{"Reviews": [{"Title": "PC to Mac", "Author": "NavySeal", "ReviewID": "R1IZQWJJ73YP8C", "Overall": "5.0", "Content": "Let me start by saying that I've been using PCs my whole life and I am now 17.  I decided to buy a Macbook Pro for college because I am going two years before I would have actually gone to college.  I was torn between the 15 inch and 13 inch.  I decided on the 15 inch because I do a lot of programming, mostly for fun, but I'm also on a robotics team, because I'm a Physics major.  I decided on the 15 inch model and I'm very happy that I did.  The screen size is perfect for extended periods of use while programming.  The free software on the Mac store called xCode is a great application.I've used PCs all of my life and the Mac OS is head over heels better than all of the Windows OS versions.  Although, Windows 7 is a much closer competitor.Parallels Desktop 7 allows you to run Windows 7 on your Mac also, this adds the best of both worlds.  Mac's killer OS and Windows' programs.Pros:Multitasking is AMAZING ON THE MAC!!!  I love it, Mac OS Lion is great in the ways of multitasking.It is extremely fast.The screen size is perfect.The Mac App Store is great.The keypad is backlit.Trackpad has amazing sensitivity.The battery life is good.Cons:It gets a bit hot on the bottom if it doesn't get proper ventilation.Glossy screen, but for me it isn't that bad.The fact that there is an App Store creates so many possibilities for the future of the Mac.  It also adds so many things you can do in the way of note taking, applications that help you brainstorm for writing papers.  It has been a big help with my 5 page essays.I would definitely recommend this for anybody who likes to program because the screen size is perfect for extended periods of use.  This is a great computer.  It would be even better if you have an iPad or iPhone.  If you have either of those than I would strongly suggest you get a Macbook because of the application compatibility.  This is a great computer and the pros heavily outweigh the cons.  The heat only happens if you have it suffocated by your lap.  This is a great computer and you should definitely get it for college, or any other work related things.", "Date": "September 26, 2011"}, {"Title": "Get the 15\" it's worth it!", "Author": "LNC", "ReviewID": "R1VGQS8QAI27XE", "Overall": "5.0", "Content": "The 15\" is worth it, it's not too small or too big and heavy like the 17\". the 17 has it's place like home or office. the 13\" is slower, check out the i5-i7 spec's.  The duel boot to Windows7 or Mac is too cool.  I got the square trade 2 year just in case.", "Date": "May 27, 2011"}, {"Title": "Is there anything else to say?", "Author": "Michael Simpson", "ReviewID": "R2HVBICM0XLPWD", "Overall": "5.0", "Content": "This is one of the best laptops on the market.  The old canard that it's more expensive than equivalent Windows laptops just isn't true.  You have to dig into the specs of this thing to really make a comparison.  But that's irrelevant, let's talk about the laptop itself.The good* Very nice graphics.  When plugged in you get nice HD video from an AMD 6490M (when you're plugged in) or from an Intel 3000HD when on battery.* Multi touch (well almost) trackpad.  It's missing a couple of things from the huge Magic Trackpad from Apple, but it has everything I can use.  I can really maneuver around the computer with my trackpad.* Brilliant screen, 1440X900, absolutely HD.* OSX 10.7 Lion.  Really the best OSX by far, and amazing what it can do.* Speedy quad-core i7 processor.  My massive Excel spreadsheets recalc fast.  And working with Photoshop and Aperture show no issues whatsoever.  This laptop really can be considered a mobile desktop.* Beautiful aluminum case.  Just makes it feel expensive.  (One note, aluminum does bend easily, so if you're rough with your computer, get one of those protective skins.)* Nice built-in camera for video chatting, Skype or other things.* Easy to upgrade to 8GB memory.  And you can get it for a lot less than Apple charges.Not so good* I'm not a big fan of the speakers.  They don't put out very much sound, even at full blast.  It's kind of hard to watch movies without a headset.* The hard drive is light for the price.  Amazon sells 1TB 2.5\" hard drives for a good price, but upgrading the hard drive takes some skill to do it right.Overall, I am very happy with the laptop.  I use it for everything from basic web browsing to photo editing to business work.  I have had a lot of MacBooks, so I guess I'm not only used to them, I know how to get the most of them.  This one is a great one.", "Date": "December 4, 2011"}, {"Title": "Great computer - SHIPS WITH LION", "Author": "Scot Stafford", "ReviewID": "R1Y3LINC8KN4XK", "Overall": "5.0", "Content": "I got the glossy model, base configuration and will upgrade through third parties.  Very satisfied so far.  Feels like the sturdiest, best designed laptop I've ever owned.My only complaint is that as of today (09/19/2011), Amazon's product description states that \"This Mac comes pre-installed with OS X Snow Leopard, but you can order a free upgrade to OS X Lion...\"  In fact, it ships with Lion pre-installed.  Dozens (if not hundreds) of major 3rd party applications have yet to announce compatibility with Lion, so this can be a significant issue for quite some time.  Amazon is not \"set up\" to do something as simple as send a customer an OS install disc to fix a problem clearly caused by their own product data.Long story short, I did call Apple and, as it's still under warranty, they dropped a Snow Leopard disk in the mail and will be here in 2-3 days.I requested that Amazon change the product description, so I'll update this review as soon as it's published.", "Date": "September 19, 2011"}, {"Title": "Upgraded from MBP 13", "Author": "Art", "ReviewID": "R9YIGDKO5ZW5", "Overall": "5.0", "Content": "The 13 inch MBP 2010 was my first mac and I thought it was the best laptop I ever used. Recently I got a special deal on the MBP 15 inch 2011 and decided to upgrade although the price of this thing is quite  high. Right away I busted this thing open, took out the DVD drive and installed a INTEL 120 GB SSD drive in it's place. Now I have 2 drives. The SSD is for OS X + software and the 500 GB spinning HD is for video since I use this to edit HD video H.265 filesAll I can say is that it made quite a difference after the switch from 13 inch. Running Premiere CS5.5 is much more spaced out and comfortable on the 15 inch. Much faster processor too.Internally the MBP 13 uses 1 fan and a small speaker attached to the main board. The 15 inch has 2 fans and 2 real speakers. There are other additions but you can look at apple's site yourself if you want to compare the models.With the SSD drive installed, my applications load instantly and everything is faster than a Macbook Air.Although I was loyal to Windows and PC all my life, I can now tell you that the average user would fall in love with OS X Lion compared to using Windows. Windows is sloppy, virus prone and doesn't operate smoothly with its hardware as Mac products do. I used many windows laptops and they all feel cheap and the trackpad always sucks no matter how expensive the unit is. Lots of people around me switched to Mac after playing with my laptop. A granny can learn to use a new mac in 1 hour while a PC might get tossed out the window.I know you've heard it before but I switched to Mac and don't plan on going back to PC.", "Date": "August 14, 2011"}, {"Title": "Apple MacBook Pro 15.4\" widescreen", "Author": "kjsand", "ReviewID": "RQUB00VJBPM8M", "Overall": "5.0", "Content": "I LOVE this MacBook Pro !, after having nothing prior but PC's this was a big step to take. I figured that since I already own an iPhone4 and several iPods my learning curve wasn't going to be insurmountable.Since this purchase I haven't touched or missed my old PC with Microsoft's CONSTANT and annoying security updates.I'll NEVER go back to a PC, in fact I'm currently trying to decide which iMac that I want for a desktop", "Date": "July 19, 2011"}, {"Title": "It's Hard To Give A Complete Review Of A Notebook", "Author": "Mister Murse", "ReviewID": "R2IBXAWR86PKXL", "Overall": "3.0", "Content": "There are many different factors to consider when writing a review of a notebook, but I'm just going to go with the topics hardware and software.First, the exterior/hardware. This is the first thing that you see when unboxing so it only felt right to start here. Of course when you open it you're in the awe of actually owning an Apple machine. The aluminum unibody is extremely attractive, clean, and just stunning. Then more time sets in, and if you're like me, you begin to inspect it, wondering if it really is as perfect as you first thought it to be. Upon inspection of this machine (my 1st of two, BTW) I noticed there were some flaws. First, I noticed when the lid was closed, there was a gap on the right side (the drive side) compared to the left. Upon further inspection, eyeballing at an angle I find hard to describe, I can see an imperfection in the form of the aluminum, as if it was bent. Secondly, after some use, I also noticed two of the backlighting on the keys, keys 'B' and '7' were noticeably dimmer than their counterparts. Lastly, upon inspecting the powercord, it looks like there are some imperfections in the sheathing...I don't know from what or how, but just another thing to make my mind boggle. For a machine of this price and from a company like Apple where form and function are supposedly equal, I personally could not 'suck it up' and live with these things, but I'm sure there are those out there who would...to each is own. But other than those things, it definitely is a striking machine that leaves an impression.Second, the software. Being this is my first time owning an Apple and working with OS X, I have to say I am pleased right from the get go. It truly is simple to use. I don't know how else to explain it, but I've been using Windows for years, and after a short time, a couple weeks on a Mac, I feel quite oriented with it. Setting up things seem much less painful on a Mac, as the system often recognizes things in advance, ie setting up an internet connection. For the experienced, not impressive by any means, but for those who have trouble fathoming wireless anything, it works like it's supposed to without needing to be \"experienced.\" I'm sitting here trying to think of a more compelling example to share, but all I can really tell you is that things work in a straight forward way. Recalling my Windows experiences, there are often multiple sidesteps that would be taken to finally reach a certain destination, but here its a straight shot.Personal experience: As stated above, due to the hardware issues/imperfections, I bought a second MacBook Pro and returned the first one. I truly love my second one, as all the hardware imperfections are no longer there...the lid is even all the way around, the backlights work on all the keys, the power cord doesn't have any weird marks. I'm happy. I will say though, I don't know if Amazon was trying to be slick or if it's common practice, but the box this 2nd one came in I noticed had been opened before and a new clear piece of tape was placed over it. I'm not entirely sure what that means? I will also say too that the first one ran much cooler, as this one seems a bit warmer...(uh oh, did I make things worse for myself?) Not hot enough where I feel like I'm getting burned, but noticeably warmer...but I have read things about 'thermal paste' on these MBPs being excessively used, so I'm not sure...have to look further into that. But all in all, this is what I initially expected, form and function are top notch, as they should be to match the cost.MBP #1: 3 starsMBP #2: 4/4.5 stars (Would be 5 stars if it operated at the same cooler temperature as the first one)", "Date": "July 2, 2011"}, {"Title": "VERY FRUSTRATED", "Author": "Jack Carter", "ReviewID": "R1OYZYG30XPMWG", "Overall": "1.0", "Content": "right out of the box the wireless card did not work. I called the company telling them it was bad, and they agreed to have the computer shipped back to them to fix. before i could get it back to them, it stopped working completely. I had to go out and buy a brand new macbook pro from the store to finish the project i was working on.", "Date": "August 12, 2013"}, {"Title": "Already Lion in it!!", "Author": "Owen", "ReviewID": "R3RAC6HBALWWE9", "Overall": "5.0", "Content": "It's already Lion install in it, like it much! But I think 4G memory is a little bit small for Xcode. When I compile an OGRE project, it will run out of memory sometimes.", "Date": "September 9, 2011"}, {"Title": "I made the switch to a Mac", "Author": "C. B. Nguyen", "ReviewID": "R2REL3UKLSV169", "Overall": "5.0", "Content": "I have used Windows since Windows ME and I have never tried a Mac. The closest I got to a Mac was in school and I thought they were terrible.Back to 2011, I felt the need to buy a new laptop to replace my existing Windows 7 laptop (i wanted a sandy bridge and faster laptop). I was hesitant at first because of the ridiculous pricing but this macbook pro changed my mind entirely of my perception of macs.The laptop finishes booting up a few seconds quicker than my Acer laptop and the user interface was beautiful in its simplicity. This is the key word here folks: simplicity. Windows involve more menu clicking and finding compared to a Mac. Dont get me started on the screen, WOW! My eyes WILL get used to this when studying. In fact, it will make studying easier because the screen doesnt have dull areas like on my acer. Now the trackpad, it is the best trackpad I have used. You can move on the trackpad and click simultaneously without letting go of your finger. I like the chiclet keys plus the backlighting LED makes it look cool. The side speakers have incredible volume that I actually have to LOWER the volume because it was just too loud! My acer's volume fail in comparison but Acer's laptop have a smaller speaker.Overall:Apple Macbook Pro design is sophisticated, clean, and functional. I feel like a heavy burden has left my shoulder thanks to the nice trackpad, screen resolution and quality, and overall ease of use of Mac's OS X Lion.Apple has converted me from PC's! (Well, for now anyway!)", "Date": "September 8, 2011"}, {"Title": "Just the best 15\" around", "Author": "baasshapshap \"baasshapshap\"", "ReviewID": "R2MXCE7ZNPUFVG", "Overall": "5.0", "Content": "I Took quite a while to decide on whether to buy this laptop. I was also considering the 13\" MacBook Pro and the Dell XPS15z. All of them are worthy laptops. I was attracted to the XPS as it is very well priced and a great looking laptop. But in the end I stuck with Mac. I have been a Mac user since about 2002. So, all my private software etc is Mac. Switching back to Windows would have been a struggle as much of the software is not available on Windows and if it is, the look and feel and functionality is a step down from Mac. So then had to decide on whether I go for the 13\" or not. I have always had the 13\" models. In the end I went for the 15\" because the sound is better and the sheer power of the laptop is brilliant. So much so that since getting this laptop I have retired my iMac i3, my son was very happy to inherit!In short then, you won't go wrong with this. It is beautiful, powerful, portable and the OS and applications are brilliant.", "Date": "September 5, 2011"}, {"Title": "Amazing MacBook Pro", "Author": "mmw1227", "ReviewID": "R1QHIXKO0267X0", "Overall": "5.0", "Content": "I recently upgraded my four year old MacBook Pro for this one and I couldn't be happier with my decision. It was difficult to spend the $1700 but in the end well worth it. PC's do not compare to Mac's, especially when you work in a created environment. If you are having hesitation like I did, don't worry you will be more then satisfied with this product.", "Date": "August 29, 2011"}, {"Title": "new Mac purchaser", "Author": "virginia h \"ghowell\"", "ReviewID": "R3DW5YER608WAI", "Overall": "5.0", "Content": "I have owned my new Macbook Pro for two months now.. I always had Dell  (four of them)  I find the Mac faster and it has much clearer grahics and lots of features which I am still learning.. I am very pleased with the purchase and recommend it if you can afford the extra money.", "Date": "August 24, 2011"}, {"Title": "Best Item I Have Ever Purchased", "Author": "Michael C.", "ReviewID": "R3B9AHZJHXGDK5", "Overall": "5.0", "Content": "I upgraded from the regular white MacBook to this laptop back in March. I've had my old MacBook for about 3 years and did a lot of video, photo and other digital media on it. When I purchased this computer and saw that my rendering time for videos was being cut down by DAYS I couldnt believe that I ever edited on my old MacBook. The graphics and visuals are absolutely breathtaking, the light up keyboard is really nice, the overall craftsmanship of this computer is beautiful and such a step up from the regular macbook. I've had this computer for about half a year now and it looks like it did when i first took it out of the box without any maintenance whatsoever. After seeing what the MacBook Pro is capable of, I will never go back to any lower model or different brand. I recommend this computer for anyone and everyone, but especially those who work with HD video and other digital media. It is truly an amazingly fast, smooth, and beautiful machine.", "Date": "August 12, 2011"}, {"Title": "Awesome Computer!", "Author": "Stephen H. Jett", "ReviewID": "RCKVOXHL5OLKU", "Overall": "5.0", "Content": "This is the first Mac that I have owned.  I also own an iPhone 4 and an iPad (first generation).  I love this product.  Two days ago, I updated to Lion, free of charge, since I bought this MacBook Pro from Amazon after June 6, 2011.  It is great for surfing the web, work, watching movies, everything!  I am an attorney, and formatting of Word documents is critically important to me.  I installed Mac Office 2011 on my MacBook Pro.  It works fabulously.  No formatting errors with my PC friends at work when working on Word docs on my Mac.  Buy this Mac, you won't go back!", "Date": "July 22, 2011"}, {"Title": "Great I love it!!", "Author": "Mitchell", "ReviewID": "R2CNK7MCFD8IYW", "Overall": "5.0", "Content": "Its everything I expected plus some! I always wanted to make the switch to mac from pc, but never had the funds. This year I will be attending college so it was mandatory to buy a laptop. I did some research and it was final I was getting a Macbook Pro. I thought about buying the higher end model (2.2, 6750m) , but I will not be doing any heavy gaming so the base model was fine with me. So far is awesome. The glare isn't nearly as bad as people say, and the screen is the beautiful! The 500GB 5400rpm HDD is very snappy and I don't think I will be upgrading to a 7200rpm or SSD anytime soon. I think 4GB of ram is more than enough for anyone, but I may upgrade to 8GB of ram in the future. Battery life is beyond what they claim if you turn down the obvious battery drainers. (Backlight keyboard, Brightness, etc) The trackpad is ALOT better than what i thought! I may just have to buy the wireless trackpad soon. Other than those things this laptop is FAST and durable, and will be even better when Mac OS X Lion comes out in a few days.So far this what I've bought for this laptop and recommend.-Rain Mstand-Logitech Anywhere mouse-Mini Display to HDMI for dual screening with TVs-Apple Wireless Keyboard-USB Hub (Sadly it only has 2 USB ports)-Moshi Clearguard Keyboard Protector (Strongly recommended if you want to keep it looking new)", "Date": "July 9, 2011"}, {"Title": "Once you go Mac you never go back", "Author": "Harmon Huynh", "ReviewID": "R3SK42J741B71M", "Overall": "5.0", "Content": "This is my second Mac purchase. I had sold my last Macbook (White polycarbonate) to go traveling and bought a Dell instead. It wasn't the brightest idea I've ever had. My Dell wasn't an entry level laptop it was actually the XPS M1330 with all the options. After upgrading to Win7 I thought my laptop was fast enough and the screen was bright and crisp. After breaking it I decided it was time to go back to a mac. I wasn't disappointed.This laptop can run laps around my Dell. Paired with a Seagate Momentus XT 500 GB 7200RPM SATA 3Gb/s 32 MB Cache 2.5 Inch Solid State Hybrid Drive ST95005620AS-Bare Drive This laptop is faster than most $2300+ Windows computers and outperforms any windows pc in terms of start up/standby/resume/shutdown speed. I find that the graphics switching helps keep the laptop cool and the fan quiet under normal web browsing and document drafting. 3D drawings load quickly and you rarely find any lag while working on large 3D projects.I only carry the charger everywhere with me because I never know when I'm going to be spending extra time in the library or spending all day away from home. However I rarely find that I need to plug in during a normal day of classes and some study time inside the library. In case you need to fuel up between meetings and whatnot the battery charges to 80% fairly quickly.Usability is greatly improved over Windows machines with the extra large trackpad that conveniently doesn't get in the way while you're typing on the full size keyboard that is a joy to type on. I find that with the keys the way they're designed has me typing ~10 WPM more than other less intuitively designed keyboards. The backlight in the keys also help when you're on a plane or other dark places like certain lecture halls. It does however eat up more juice than I'd like.If your anticipating on doing more Graphics design or 3D drawing I would suggest upgrading to the Apple MacBook Pro MC723LL/A 15.4-Inch Laptop otherwise this will be more than plenty to satisfy the general user and student. However I do suggest the 8GB RAM Memory kit for all you multi-taskers out there.", "Date": "July 5, 2011"}, {"Title": "Get's the job done!", "Author": "VISCATA", "ReviewID": "R2U448K1PFOHB3", "Overall": "5.0", "Content": "Can't go wrong with the 15\" Macbook Pro.  Enough power for photo and movie editing and great overall OS that makes using a computer fun again!", "Date": "January 29, 2014"}, {"Title": "There are many computers, but this is the one.", "Author": "Hana \"aishiteru333\"", "ReviewID": "R1R8RK9VOI2PGA", "Overall": "5.0", "Content": "Two years later and it's still going strong. This was my first computer on transition from Windows. A great computer! Apple really knows how to make them.The charger has never once broke on me, after numerous times of it getting tugged on. It has actually saved my computer's life. It's held onto the computer magnetically so it easily disconnects if need be.I've dropped this computer a few times myself and other times it has fallen on my sons tantrum. It has survived. Not a scratch or dent.Just don't go throwing it now!After my pleasant experience using this computer, I'm going to be upgrading to a newer model, probably even an iMac.Make sure to keep it on a flat surface. The bottom of it gets very hot after long use.", "Date": "November 16, 2013"}, {"Title": "Apple MacBook Pro MC721LL/A 15.4\"", "Author": "E. Nieh \"ECN Austin\"", "ReviewID": "R2PDU5E7GMB19O", "Overall": "5.0", "Content": "Apple MacBook Pro MC721LL/A 15.4\" LED Notebook - Core i7 i7-2635QM 2 GHz is as good a notebook computer as one could asked for.  It is well constructed, highly functional, and require less fuss for all its functions.", "Date": "November 20, 2011"}, {"Title": "Great Computer!!!", "Author": "Sharon", "ReviewID": "R3G56O94KAJ53C", "Overall": "5.0", "Content": "The 15\" MacBook Pro I recently purchased is awesome!  I've always been a Mac user, but I was plesantly surprised when I opened the box.  It has so many features and very user friendly.  I would highly recommend this computer and really glad I decided to get it; another great Steve Jobs product!", "Date": "October 9, 2011"}, {"Title": "Excellent Product!!", "Author": "Jorge Conde", "ReviewID": "R3TXNYQZ8NRW2R", "Overall": "5.0", "Content": "This computer is excellent, i will be an apple fan a little bit longer, no more slow startups and blue screens. I really recommend this product.", "Date": "September 12, 2011"}, {"Title": "Replaced my 13 2010 MBP", "Author": "A Techy Guy", "ReviewID": "R1LL4PVFKDETRK", "Overall": "5.0", "Content": "Let me start off by saying I have always been a pc guy until I purchased my 2010 macbook pro 13' last year and I must say I don't know why I waited so long! I purchased my 13 back in September and about 6 months later I saw the new MacBook pros came out and comparing the specs I felt like I needed to upgrade. I replaced my 2010 Macbook Pro 13 with this and I must say that I am very pleased. The dual core on the 2010 seemed fast but when compared to the i7 quad core the dual core isn't even in the same universe! The 15' is super fast and great at handling multiple apps at once. The new Lion OSX is excellent and apple has added  a lot of things to make this os superb to others. The only drawback is that Apple has axed rosetta which means power pc run applications and games are no longer supported. However I like the fact that if needed you can add windows via bootcamp (if you want to play pc games or need to use apps that are not compatible with macs). The battery life on this laptop is great. I can usually get 6 to 8 hours of life from a single charge depending on what I am doing. Most laptops can only get 3 or 4 max. The battery can actually be calibrated to help get the most out of a charge. Ilife 11 is a great addition with this laptop and apps like iMovie and iPhoto couldn't be easier to use. Portability isn't as good as the 13' but with this computer being pretty much 2x-3x faster that the 2010 13' I'm not complaining. Overall I am extremely pleased with my purchase and if your thinking about converting to a Mac, DO IT! You will be very satisfied.PROS1. The processor is a super fast 2.0 ghz quad core i7 great for gaming on bootcamp or on lion (2x-3x faster than previous generations).2. The battery life is great. ( A little less than my 2010 13' mbp but it averages about 6 to 8 hours a charge depending on what I'm doing so I'm not complaining)3. Osx Lion is a great upgrade from snow leopard and does a great job at keeping everything organized and fast.4. Great apps included like Garageband and iPhoto.5. The case looks very sleek, thin, and professional and the backlit keyboard can be super bright or dim depending on how you want it.6. Bootcamp is a great feature that many people may not know used to run windows on your mac if needed. 7. The screen is extremely bright and big and hd videos look crisp and clear.CONS1. Price is a little steep compared to other pc's with the same specs.2. When running windows the laptop can get very warm.3. In the new Lion OSX power pc run apps and games is not supported anymore.", "Date": "August 14, 2011"}, {"Title": "Mac Book Pro 15-inch Review", "Author": "HipsterTree", "ReviewID": "R331EFO18G1LR4", "Overall": "5.0", "Content": "In May my dad bought me a Mac Book Pro for my birthday. I was a little wary at first never having really used a Mac before, but today I can easily say that I'm happy with it. I'm not particularly computer savvy (and I won't pretend otherwise) so the computer is more than likely capable of far more than I use it for, but it does everything I want very well. Perhaps my favorite thing is the quick start up time, from turning my computer on it literally takes less than half a minute to get full speed. My only real complaint or observation is that the area just above the keyboard can get very hot with extended use. Great laptop.", "Date": "August 3, 2011"}, {"Title": "A Mac would never let you go back!", "Author": "Manas", "ReviewID": "R1NT68LIC3UJDA", "Overall": "5.0", "Content": "I have been using Macbook Pro for the past 2 years (though it was an official one). When I used to compare it with my personal windows laptop, actually I could not compare...there was nothing to compare. Macbook was light years ahead of it. Another plus was that with Mac OSX, you can surf the web without worrying the intrusion of spywares and viruses in your machine, effectively eliminating the need for an anti virus. All these factors were compelling enough for me to shell out 1700$ to make it mine.I have now upgraded to LION OS and oh boyyy...using it is like biting through a cheesecake...smooth! I also do a lot of photography and developing pics is just an out of the world experience on Mac. The screen is so vibrant that the pics almost speak out. I have a glossy screen and since I mostly use it indoors, I got no issues. In fact I love it more than the anti-glare one.Coming to the performance, well this is supposed to the most advanced laptop in the market and it truly lives up to its name. The booting (after installing LION) is around 30-40 seconds! The clicks are so responsive that I have forgotten what latency is, the speakers are a nice addition and it even has a slot for SDHC cards...I can just takes pics and insert the memory card directly into this slot and boom...its done. Goodbye USB cables, now I don't need to depend on you. Lastly the batter life is amazing, it gives me around 6 hrs on normal work and around 5-5.5 hours with wi-fi on.All in all, thumbs up for Macbook Pro and also to Amazon for letting me have a 100$ waiver.", "Date": "July 30, 2011"}, {"Title": "Pretty Good!", "Author": "DSK", "ReviewID": "RMDVOOGQQMII5", "Overall": "5.0", "Content": "This is a great laptop!, Came with all the things it promised and is pretty slick. At first it was hard to use for me since Im a recent Mac convert but it has won over me! Make sure to buy a cover for it though because the fragile aluminum cover can get scratches easily.", "Date": "October 1, 2011"}, {"Title": "Best computer on the market hands down", "Author": "Luke Cobb", "ReviewID": "R88AFR4E9C38U", "Overall": "5.0", "Content": "First, the operating system is that much better than windows. It does take a little getting used to if you aren't familiar with Macs, but once you get a good feel for where everything is located you realize that the system is much more intuitive and geared to the user than windows. The battery life is outstanding, the processor is incredibly fast, and if you get a solid state hard drive the thing is indestructible. I can't tell you how many times I've dropped mine with zero problems.", "Date": "April 4, 2011"}, {"Title": "Hey, it shut my daughter up", "Author": "C. J. Brown", "ReviewID": "R11MP81AMVU985", "Overall": "5.0", "Content": "My daughter is leaving for college.  From what I understand from talking to her, most universities have a large open pit in which they stone the students who arrive for their freshman year with PCs.  It's all about cool and image.  The price on Macs is incredibly steep, about three times what a really good laptop PC would cost.  While I have yet to see what that extra thousand bucks gets you, it did buy me freedom from at LEAST a year of griping and foul moods from my daughter.  Buy a Mac, be unique, just like everybody else.", "Date": "July 13, 2011"}, {"Title": "no high-res & anti-glare from amazon :-(", "Author": "M. Luu", "ReviewID": "R34OMT910LJ6Y0", "Overall": "4.0", "Content": "fantastic laptop. definitely very expensive but you're getting a high quality product. i wish they got rid of the optical drive and put in a 2nd hd. optical media is dying and i never need it.if you're going to buy this, you must get the high res & anti-glare for $150 extra. it's definitely worth the money", "Date": "August 26, 2011"}, {"Title": "A little eccentric, but still wonderful", "Author": "moose_of_many_waters", "ReviewID": "R1AKZTAKXTWNG8", "Overall": "4.0", "Content": "This is my fourth 15\" MacBook Pro in 10 years.  I buy the same model every time, new and improved.  This is the first one I have some qualms about.1) Glossy screen stinks.  Too much glare.  Glossy screens are for casual users, not professionals.2) I need to buy a dongle to hook this up to an external screen.  That's ridiculous.  A dongle, what is this 1988?3) One day the battery will conk out and because of Steve Jobs' neurotic tick about external batteries, I'll have to shell out 250 bucks or so to get a new one. Harrumph!4) Other than that, the machine is fast, slick and wonderful, a significant improvement over the one I bought three years ago.", "Date": "July 11, 2011"}, {"Title": "Great Buy", "Author": "Christine", "ReviewID": "R3U87CF333YEO", "Overall": "5.0", "Content": "Oh man how can I begin to tell you, LOVE IT, my son hasn't put it down since Friday it's fast and the condition of it was excellent couldn't believe it was used.", "Date": "June 4, 2014"}, {"Title": "It gets too hot!", "Author": "David Chan", "ReviewID": "RB4VR5NAGHCL0", "Overall": "2.0", "Content": "This thing gets really hot (around 80C) playing movies and games. Now, this is limited to pure work - not a good choice for all around computing.", "Date": "May 9, 2014"}, {"Title": "Customer Service at it's finest", "Author": "Frank johns", "ReviewID": "RVXDVSLVDXGAY", "Overall": "5.0", "Content": "Thank you for working with me to resolve the issue with warranty for this computer. I cannot wait for it to arrive and my son sees it. I’m sure he will be very happy and satisfied with the quality and condition of this computer.  I cannot tell you how refreshing it is to have a Seller that responds to every question with care, professionalism, understanding, and a will to put the customer first. I congratulate you on having employee like Jason that represents your company in that way.When I ready to buy another computer you can bet you last dollar there will not be a question on which company I have the FAITH in", "Date": "April 30, 2014"}, {"Title": "Did not work", "Author": "Donnovan Leaks", "ReviewID": "R233V93X1BYSW4", "Overall": "2.0", "Content": "The computer appeared to be in good condition physically, the only problem was that it never turned on.I will say that the seller was pretty good with correspondence, I got my responses and refunds pretty quickly.But point blank, the MacBook didn't work.", "Date": "March 29, 2014"}, {"Title": "Great macbook!", "Author": "James007", "ReviewID": "R30N2UCGK63WJF", "Overall": "5.0", "Content": "I have upgraded the RAM to 8GB (maxed out), replaced hard drive with 256GB SSD right after I received this from amazon.  Added boot camp with windows 8 OS and that boots up fast as well.Screen is bright and clear.  Sometimes the fan make noise when I play games or running video/photo editor which is normal as the video card heats up when using heavy graphics program.Keyboard is soft and very comfortable.  Trackpad is very useful as there's an ability to zoom in/out.", "Date": "February 8, 2014"}, {"Title": "Still going strong", "Author": "Melvin G.", "ReviewID": "R1LTQ8DPZAQLB1", "Overall": "5.0", "Content": "Over a year if daily use and still going strong.  Cannot wait to upgrade the RAM soon to 16GB.  Love APPLE", "Date": "February 6, 2014"}, {"Title": "Great Laptop", "Author": "Chris MacMillan", "ReviewID": "RNH8I5MKY91NI", "Overall": "5.0", "Content": "I ordered this unit used through the Amazon Marketplace.  I needed a Macbook Pro with a built in optical drive due to the nature of of my work so I didn't want to get the latest model of the Macbook Pro.  Although this review is not for the seller, I will just say that this laptop was in pristine condition and everyone that I have shown it to says that it looks brand new.That said, the Quad Core i7 in this machine is perfect.  The only thing i did is upgrade the RAM.  It is very fast for all tasks and I do a lot of media heavy (i.e. - audio and video editing) things that require a lot.  Is it a Mac Pro?  Certainly not, but by necessity I do much of my work on the go and a desktop is out of the question most of the time.Even though this machine is a couple years old it has more than enough horsepower for 99.9% of standard computer users and even though for power users.  If you want the latest/greatest like Retina display, thinner, lighter, then this isn't for you, but if you want an laptop with a built in optical drive that still delivers on the power side, this Macbook Pro definitely delivers.  I got my unit for just over $1000 which I felt was a great deal, especially given the perfect condition.  It's a good deal if you don't want to pay full price for a powerful computer.", "Date": "July 2, 2013"}, {"Title": "Thank You", "Author": "Alicia B. Covington", "ReviewID": "R1BR8NF5US8Q1W", "Overall": "5.0", "Content": "The computer was as described and in better condition than I thought. Thank You for a great product and a smooth transaction.", "Date": "June 28, 2013"}, {"Title": "Bought it two years ago and still a superb machine.", "Author": "Asha Santwan & David Vides", "ReviewID": "R1VE5ESFQKUKV6", "Overall": "5.0", "Content": "Very satisfied with this powerful computer and stillI feel I got an awesome price for it.Definitely recommended to anyone who wants power/price efficiency.", "Date": "June 17, 2013"}, {"Title": "I love it", "Author": "Robertas Sulcas", "ReviewID": "R1EAHRKG6I22OH", "Overall": "5.0", "Content": "This is the first mac I owe, but i simply love it. I've already have it for more than a year and a half, but did not have any problems with it. Moreover, I was able to extend its memory from 4GB to 8GB easily by myself at home.", "Date": "November 2, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000BNHM0C"}}