{"Reviews": [{"Title": "Great revision.  Best laptop?", "Author": "Cosmo Kramer \"The Real Peterman\"", "ReviewID": "R24KIWE86Z74FG", "Overall": "5.0", "Content": "I've owned three iBooks.  The clamshell was a sturdy design, but heavy and limited.  My G3 iBook 800 was great, worked well, but the screen was a little small (dense) and it didn't quite fit on the lap.  Plus I wasn't a fan of the drive tray.  So this new design is far better.  It is much sturdier.  They replaced EVERY material in construction for the better, improved battery life, and it is much faster.  It might just be the perfect laptop at any price.  For most people, it can even replace a desktop.  Comes with tony hawk, plays beautifully.  All other apps I have work perfectly, airport extreme is faster than airport, and keyboard is MUCH better (no longer squishy, better feedback).  You will not regret buying this machine.  Not sure that the 1GHz is worth the extra money.  This model hits the sweet spot.", "Date": "November 17, 2003"}, {"Title": "Stunning, powerful, reliable", "Author": "James Gardella", "ReviewID": "R3D5YM89LLP0J8", "Overall": "5.0", "Content": "The iBook, Apple's \"consumer\" portable (a consumer simply being an everyday user), really has it all now: a very speedy processor, great graphics, great design (it took a few years for them to perfect this white beauty), great features (a lazy way of saying \"All the other things on the machine I forgot to mention\"), and most importantly, a great price.Ever since the iBook went G4, the machine took on a whole transformation. It is no longer lacking in the processor department and thus is a very \"well-rounded\" laptop.As for the machine itself, it's great. The entire laptop is white, crisp white (a mixed blessing...it's elegant, but very, very hard not to dirty it), and the overall design is great. Everything is ergonomical and compact: the little latch to close the iBook stays hidden on the top, but then magically appears as you close it. (Gotta love Apple's design team for those little things!) The keyboard, unlike other models, isn't \"spongy.\"In fact, it is rather sturdy for a laptop keyboard. It is stationed to a strong metal backboard and if you take the keyboard and backboard off, you will see a slot for an Airport Extreme card (card that enables wireless internet). No more PC \"NIT\" cards protruding from the sides, everything is on the inside. The top of the computer has a translucent Apple logo that glows when you are computing in the dark. The trackpad is large and precise, and the button (Windows users, beware: no \"Left-clicking\" in the Mac world, only \"Command clicking\"!) is large and responsive.Battery life is excellent, I get an average of 5 hours with normal use. The charger has a light indicating the level of charge so you know when the 'book is charged (green for charged, amber for charging) without turning it on or waking it from its \"Sleep\" mode. Panther, the latest version of Mac OS X (10.3), is stunning, powerful, and reliable in its own right (go ahead and check out those reviews or Jaguar's reviews, the previous OS X version.) I don't want to go into the benefits of its UNIX core, just trust me that it is stable. The \"iLife\" set of software is one that really revolutionized the Apple world, after OS X, software-wise. It's all here: iTunes (store, burn, and buy music in one easy-to-use program), iPhoto (organize, burn, share, print, edit, email, and more with a plug-and-play friendly piece of software), iMovie (for editing, storing, and organizing your DV movies), but no iDVD...no DVD burner (but you can buy an external one.) Some other good programs that supplement your iLife are Mail, Appleworks, iChat, iCal, etc. It comes with World Book 2003, Quicken, and a few others.It's fast. CD's burn with one click. My iPod (a great addition to this for music lovers) loads with one slide of a Firewire cable (literally.) Safari has built-in pop-up control (never has a single pop-up existed here.) Games (only the Sims so far) load and play flawlessly. DVD watching is pristine. USB 2.0 and Firewire (a BIG plus for external hard drives) work at top speed. No bugs, no crashes, no viruses. This machine was engineered to have the software and hardware be integrated. Have a problem? You won't be told to call a different company. You will always have one number to call, and they can't transfer you (since they make the hardware and software)What more is there to say? I love my iBook! It's light, user friendly, and works like a dream. Quick! Go order one. You'll be in for a treat.", "Date": "January 9, 2004"}, {"Title": "Great Computer", "Author": null, "ReviewID": "R38DCC73DDTGX6", "Overall": "5.0", "Content": "I use this as a travel computer for work.  All work PC's are dell machines.  Word documents, Excel documents, and power point presentations can all move back and forth between the mac and the dell without problems.  Obviously email and websurfing are interchangeable, too.  This is my favorite computer.  Small, light, large screen, holds personal photos and music, and almost never crashes.  Compared to our Dells, this computer is a rock-solid saint.Battery lasts a long time, plays DVD's, burns CD's that can be read by PC's.Reasonable price, great value.", "Date": "April 19, 2004"}, {"Title": "Daziling Laptop", "Author": null, "ReviewID": "R1JBTMD8D4K7ID", "Overall": "5.0", "Content": "The iBook G4 is a great laptop! It runs like a charm. And is extreamly fast compared to the older iBooks. I can have several applications open and it works great! Such as I can have Safari, AIM, iTunes, and more open and play a game and it runs perfectly. In fact it would seem it is just as fast as some of the iMacs. It has very clear sound for iTunes or games or anything. Speaking of games: Because it has a very strong processor (G4 933 MHz) games run like heaven on it. Currebntly I have Call of Duty on it, a rather strong game, and it delvers the perfect experiance Mac gamers want. The iBook G4 aslo comes with for no charge at all Tony Hawk's Proskater 4 and Deimos Rising. Back to applications: Th iBook G4 has great applicatons such as iTunes, Safari, Internet Explorer, iChat, AppleWorks 6, iCal, iPhoto, iMovie,and more!  This computer also has very long battery life. Around 4 or 5 hours! As for design, wonderful. It has a great screen, and great keyboard (in fact one of the best laptop keyboards I have used). And I like it's color. It's just a simple good looking white. There you have it, the great and almighty iBook G4. Trust me, worth it's money.", "Date": "June 20, 2004"}, {"Title": "True Love At Last", "Author": "Carolina Kipnis", "ReviewID": "R39451D3N90HDB", "Overall": "5.0", "Content": "This little beauty came into my life around Christmas, and she and I have been inseparable since then.  I ordered it directly from the Apple Store Online, and I had it maxed out on RAM, and had the optional 60G hard drive installed.  I love the processor speed, immense capability, and versatility.  The screen size makes it a suitable replacement for a desktop computer.I do everything on this computer: word-processing, spreadsheets, music transcription, photo editing, Internet communications, audio editing, and managing my music collection.  I have Office X, Sibelius, and  iLife 2004. I run iTunes in the background, write a report integrating Excel and Word, plus can have all my pictures handy on iPhoto.  I can have five or six applications running at the same time (not including iChat and MSN Messenger, which are ALWAYS running), and the processor doesn't even hiccup.  I use an iPod 40G as an external hard drive (not to mention all dem kewl tunes!), and have a Canon PowerShot A80 digital camera, and an iMic audio converter.  Add to that an AirPort driven wireless network and a laser printer, and you have an ultra-powerful home office for any kind of occupation, from music composition, culinary research, to communications-based businesses.Although larger and heavier than the 12\" iBook, I believe the 14\" screen is definitely worth the extra weight and price.  If you get it, the wireless card (AirPort Extreme) is a must.  The optional built-in Bluetooth module is nice, especially if you have a compatible PDA or cell phone.I didn't realize I would love owning a laptop.  Until I met this one.", "Date": "February 23, 2004"}, {"Title": "14.1\" iBook by Apple", "Author": "Brian", "ReviewID": "RY5MB4WJMJXB2", "Overall": "5.0", "Content": "First of all, let me say that I paid the 1500 dollars in September, before they changed all the iBooks to G4s and the USB ports to 2.0 .  Why is this important?  Well, a few reasons.  Final Cut Pro only works on G4s.  I paid 699 dollars for the upgrade that my computer could certainly handle, however the software was designed to look for a G4 or G5 in order for installing.  So, as that wouldn't have been too aggrivating until I tried to take it back to CompUSA which I soon found out has a zip-O-la return policy, I got a bit peeved at both CompUSA and Apple Software design.  Well, within two months of my purchase the 'new' G4 iBooks were on the net to buy, and I had my answer on Apples ideas for makeing a touch more money by getting me to buy a new laptop, if I want to run something like.. oh Final Cut Pro, or some animation software on the market.However, the reason I put five stars wasn't Apple's beautiful software marketing and design, or CompUSAs ability to move a person to consider programming a video game thats objective is strangling CompUSA employees.The real reason is that for laptops, and for this price, it is a quality laptop.  You see, I can't justify to myself paying over 1500 of a base price for a tool that I'm going to be using out of my home.  At any moment it could be stolen and I am much more at peace with a loss of 1500 dollars for a top of the line iBook which can be much more readily replaced than 3000 dollars for a top of the line PowerBook.My laptop has survived a 2 ft plus drop while open from a bed to a not so plush carpeted floor.  There wasn't too much destruction done other than some of the lineing on the left edge of the screen and the battery doesn't fit as smoothly as before.  Everything still works, including all the ports I use, like the USB, firewire, 56K Modem, and the Adapter port.  It works fine on battery and plugged in, so I really didn't lose any functionality.The laptop operating system doesn't break down, although it does freeze every once in a while.  The software that it comes with is very useful, and handy, and not as annoying as say, windows media player..  The text editing software that it comes with is ahhhhh!!!ggrrr.. when you try to program html initially.. fortunately, after going to the preferences you can fix this loading html pages as a web browser does initial setting.  iTunes is fun, and useful, and the only drawback is that it doesn't read the song encoding on CDs that Windows Media Player does.  So you have to either manually type the name of the song in by hand, or buy your songs off the internet at a buck a piece.  The iPhoto works fine and allows for some adjustment, but if you're into adjusting your photos, use nothing less than Adobe Photoshop Elements 2.0 .  Photoshop might well be a waste of 600 plus dollars if you get good at Elements 2.0 .  In fact.. I'd dare say Adobe Illustrator and Elements 2.0 could be a grand combo.  Safari is a good browser with annoyances with interpreting java on the web.  No joke, web browsers that understand Java well on the web on macs are rare as leopard seals.  There is only two of them.  One is the Microsoft Internet Explorer(who stopped making new IEs for mac because Safari does everything it does) and the other is Safari.  Every other web browser.. say.. mozilla??  like Netscape 7.01, Firebird .7 and Mozilla and Camino seem to all be carbonized.  And the problem?  Well, for some reason, carbonizing does not like Java or something.  No Java, no chatting, or java online gaming.  So the only chatting you can do say on Yahoo is on Safari and IE.  No problem, they are both free.  And Safari is included with all the new macs.  But for your daily web browsing, you might want to download Firebird .7 .  After you get the tab browsing down and the various keyboard commands, you will find its just the best daily browser out there.  It runs secure bank transactions in xml fine and quickly.  As a bonus AppleWorks comes with every new iBook, so you definitely have a decent word processor.  But don't be fooled with the Microsoft Office that seems to be included, Microsoft wouldn't forgoe a profit that easily.  The Microsoft Office on the computer is a 30 day trial.  Office X is 500 dollars.  Not too much for full licensing for a single user.  And well worth it if you're in college or otherwise use it frequently.  Look at QuarkXPress for some serious pricing.. oww.  The clock is nifty and calendar is useful, and the internet options are easily read in the upper menu bar.  And for entertainment, you can talk to the computer and it will do what you say.. if you can speak it well enough for the computer.. you know.. the standard speech recognition flaw.  The fun thing about all this is that you talk to the chess game and play an entire chess game by speaking alone.  It's actually pretty nifty.There is enough computer software out there for the mac, especially if you want to get work done and you work with video or images.  The Mac OS X and Mac OS 9.2 don't save files quite the same way which can be a touch annoying if you are using old macs at school still.  You have to specify the exact program to open this or that file between the two operating systems.  This is easy enough.. as long as its only a file or two, come ten or so, and it gets a bit annoying.  On the good end, it is more compatable with pcs now.  There is a decent software translation of Windows XP for purchase for ultimate compatability.  Wasn't too bad, but as always.. anything Microsoft runs as slow as a slug.  Try a G5 if you want to run the Windows XP translation a lot.  If Windows XP freezes, it doesn't freeze OS X, and thats kinda nice.  Adobe has most of there popular software available on the mac, and so does Macromedia.  And Living Language has their 9.0 versions of Language Lessons in plenty of European and Asian languages available on Mac.  Also, if your into Video, Adobe dropped Premiere because Final Cut Pro was kicking their but in earning the market share.  And if your into animation software, Cinema 4D 8.5v and Maya 5 both support mac, as well as Lightwave.  So as far as getting something done, the mac is awesome.. it doesn't freeze much if you treat it decent(don't run a zillion programs at once).  It simply works, and has better compatability than Linux.  Although Linux rocks too, Mac OS X is a Unix base with more compatability.  It is simply more compatable with stability than Linux.  Microsoft Windows?  Well, its compatable with a bonus of being hacked and virus wrecked and blue screened every so often.  In other words... Microsoft Windows tends to limit me getting anything done.. particularly in Graphics Design degree which of course is only macs.As far as games, of course most of the games out there are made for windows.  On the other hand, many might argue that if you are a real gamer, you own an XBox or a PS2 already.  Besides, Microsoft XP is available for Mac.  Like I said, get a G5 for that kind of thing.The chatting programs?  Well, Windows Messenger, Yahoo Messenger, and AOL instant messenger, as well as the OS X customized iChat version of AOL instant messenger that comes with any new mac.  The Yahoo Messenger can't do as much as it can on Windows.. on the other hand.. it doesn't get hacked like the one on Windows, which doesn't freeze my computer, which makes my life a bit easier.If you're into video, you should remember two things.. one, VCD format.  You know, that old laser disk format that any CD burner can place on a CD-R/RW.  two.. if your into business cards, the business card CD-Rs can hold video flash presentations as well.  So, basically, if your not looking for 2 hour movies on a dvd, you can easily burn animations as well as edit them from the CD-Rs on the iBooks.  The other detail is that 400 firewire is the only thing sold on iBooks.  800 firewire is considered 'professional'.  However, although my 400 dollar Olympus digital camera can make short videos, it, like many Digital Cameras on the market, does not have firewire.  In fact, that is much more likely to be restricted to digital camcorders.  Such as my Digital Camcorder does have.  Still, you still have to look for a firewire port, not all camcorders have them.Hopefully, you found my review helpful.  Oh, one more helpful hint.  Certain Epson scanners come with Photoshop Elements 2.0 .  A good piece of software with a needed accessory.  I definitely recommend it.  ArcSoftware is the usual accessory.  Don't be fooled.. although its fun and useful, for work with multiple photos, nothing beats Elements 2.0 .Hope you all enjoy this laptop if you buy it.  Obviously every business is out to make money and Apple is no different.  But Apple OS X and Apple laptops as a combo are better and more useful than nearly anything with Windows on it.Brian", "Date": "December 17, 2003"}, {"Title": "Fast and Accurate Delivery!", "Author": "merci", "ReviewID": "R2MVTZ6NCDE2X5", "Overall": "5.0", "Content": "I received my purchase in a matter of 2-3 days! Have not had any technical difficulties and was amazed that computer came with microsoft office installed right along with some other basic interesting installments. No complaints here!!!", "Date": "February 23, 2014"}, {"Title": "Love my apple iBook Laptop 14.1", "Author": "Sandra M. Weber \"SM Weber\"", "ReviewID": "R1APWVGCYB1ZJ7", "Overall": "5.0", "Content": "I read all the reviews before purchasing the Apple iBook Laptop.  The Apple computer company shipped my computer quickly and was securely packaged for shipping.  I received the computer which was already setup for easy plug and go.  I have since purchased 2 more computers from the Apple computer company because the computers look new and works like a charm.  Very happy will the 3 computers I purchased.", "Date": "February 15, 2013"}, {"Title": "amazing bargain, fast & solid computer", "Author": null, "ReviewID": "RNS8AM34YLFPU", "Overall": "5.0", "Content": "I've had my ibook G4 933 for a month now. I got it from amazon with their fantastic rebate and free shipping. So far, it's unmodified, but I've ordered 512 of ram. The computer is fantastic. It feels very solid. Everyone who sees it comments that it looks like the older ibooks but better. The keyboard is a giant step up from older ibook keyboards, and I prefer it to the powerbook keyboard. I have not experienced any of the mild problems that were reported with very early ibook g4s.  I have been driving an external 8x dvd burner through firewire with no problems. Also use an external monitor with screen spanning. Everything is completely plug and play, including cameras, printer, scanner, and ipod. I love this computer!", "Date": "February 23, 2004"}, {"Title": "Another Great Mac!", "Author": "Phillip Lovgren", "ReviewID": "RT9GUWEDN5ORV", "Overall": "5.0", "Content": "Looks like Apple hit a home run with this one. This has been the best upgrade since my LC.  With Panther my 933 is one fast machine. I downloaded US Army and it runs that with no problems. Max out the memory and get Apple Care. With broadband this one great appliance.", "Date": "January 4, 2004"}, {"Title": "Great value.", "Author": "R. Clark", "ReviewID": "R73UVPNGT1DSI", "Overall": "5.0", "Content": "At nearly the 1 GHz speed and with identical specs, this is a great value.  Also, while not mentioned here, this does include all the latest software included with more recent, faster models, including  iLife (includes iTunes, iPhoto, iMovie, iDVD, GarageBand), AppleWorks, Mac OS X Panther, Quicken 2004 for Mac, World Book 2004 Edition, Tony Hawk's Pro Skater 4, and Deimos Rising.  The hardware is identical to more recent, faster models as well.  Aside from these notes, I can say I'm very impressed with the Mac experience, as this is my first Mac.  The quality of the design of the hardware and software is unending and flawless.  This is a great, lightweight (7.9 lbs) laptop for using to create documents or surf wirelessly.  I highly recommend adding the Airport Extreme card, not included.", "Date": "June 9, 2004"}, {"Title": "It''s alright laptop", "Author": "JonathanSuarez", "ReviewID": "R1X3R2GIB0YLXG", "Overall": "3.0", "Content": "This laptop is a very nice looking and it is nicely keyboard features and screen of 14 inches screen and I wanted it to said to thanks you for giving it to me of this excellent Apple IBook Mac Laptop and I love it but It's a small screen and it's very worth it of my times and it's a very comfortable a little bit laptop... And This is my first time to getting it a Apple Computers and I have it right now is 2 or 3 a different Laptop so far is Compaq, Toshiba, HP Pro Desktop, and this one Apple Computers :) and I'm a very happy with my product it right now..Other hands is that, and I am now going to using it on this Apple Mac a very nice ways to making it sure is that I don't wanted it to acting like it a very crazy to be around with it.I will recommend it you have to buy it on this Apple IBook G4 Laptop and it's a very worth it and my money etc. and I wanted it to said to Thanks you for the Amazon and in the Sellers... You're guys rocks!!!", "Date": "March 13, 2014"}, {"Title": "I LIKE", "Author": "Wilbur Leroy Roberts", "ReviewID": "R3F1VF3MYSGIYG", "Overall": "5.0", "Content": "I HAVE TWO PCS THAT ALWAYS  G IVE ME PROBLEMS......WITH THE iBOOK I ALWAYS  CAN BE SURE OF GETTING ON LINE WITHOUT HAVING TO WAIT TO DOWNLOAD OR CORRECT SOME PROBLEM", "Date": "February 18, 2014"}, {"Title": "Older Model", "Author": "Marty A. Scott", "ReviewID": "RXGEP0QL93OSA", "Overall": "2.0", "Content": "It's OK for an older MacBook if you don't need all the bells and whistles. It didn't have a camera and the keyboard was older.", "Date": "July 8, 2013"}, {"Title": "Laptop", "Author": "Kendra Storm", "ReviewID": "R2PDCU145D2YD2", "Overall": "4.0", "Content": "I like this product, but it is newer and there are some issues with the laptop when you close it, it doesn't close properly. There is a fairly large gap when it's closed. It also wasn't updated at all and cannot store the time or date. I have to put it in everyday when I use it. Overall it's just okay. It's an older laptop, so I guess you get what you get. I would suggest the sellers to others though, they were great and send a card in case of any problems.", "Date": "May 10, 2013"}, {"Title": "Love my Laptop", "Author": "Maria Ventouras", "ReviewID": "RB1KJQV1SHGQ3", "Overall": "5.0", "Content": "Love my laptop it comes everywhere with me. Also, it suits my needs for instructing an online class. Cool purchase.", "Date": "February 9, 2013"}, {"Title": "new to Mac", "Author": "Bobby R. Sims \"entertainment seeker\"", "ReviewID": "RX4NP1XFXRRY4", "Overall": "5.0", "Content": "I've always used Windows, but wanted to check out a Mac, to see how I like them. Since I'm a complete novice, or was, I purchased this used iBook mainly to check it out and learn how Apple works differently than Windows. Granted, it is an old machine, but did teach me things about the Mac OS. So, when I found out my stepdad was getting the newest MacBook, I jumped at the chance when he asked if I wanted the MacBook he'd been using. I think I've used my Windows laptop a handful of times since. Love the Mac and this iBook really helped me start learning, before I got the MacBook Pro.", "Date": "January 18, 2013"}, {"Title": "Just what I need", "Author": "mary p", "ReviewID": "R1RHUCO5BUFFR5", "Overall": "4.0", "Content": "Received in time and well packed. Combination of Apple quality and convenience of pre-loaded MS Office for small price. Little heavy compare to new models.Can run skype without image, perfect screen quality. Only minus - sometimes stops internet, when searching in U-tube, Yahoo, sometimes Google too - I guess, mostly because of advertisement.", "Date": "January 7, 2013"}, {"Title": "Very pleased", "Author": "JEM \"JEM\"", "ReviewID": "RMOM3U7D84CK4", "Overall": "4.0", "Content": "I'd have been beside myself happy if the internet worked faster than it does. With that exception, I love this computer. I bought it for myself so I could write reports. Though my last two computers were not apple, I was raised and used to apple computers nonetheless. I haven't used one though, in many years. However, despite all that time, I eased right back into the comfort of using an apple as if no time had passed at all. It actually felt like coming home.  Anyone who has grown accustomed to working on an apple computer knows exactly how that feels. Regardless of how far they've come, the basics are all there in this ibook. It's very comfortable to work on. All apples are, as I say, are idiot-friendly, that even a monkey could use them. If you're looking for comfort, ease, a wide variety of necessary and extra programs, and versatility for a very low price, you've found it in this ibook. Love it!", "Date": "December 20, 2013"}, {"Title": "Great Laptop!", "Author": "Gabriel Mendez", "ReviewID": "R2MZ992J0XU0KP", "Overall": "4.0", "Content": "The iBook G4 is a GREAT laptop, perfect for-- just about everything. I only didn't like some things in it, like it only having an Apple MINI DVI video out, no PCI slot and it does not have the extensive amount of software that you can use with windows.PROS:Just 5.9 pounds for a 14.1\" laptopGREAT design2 usb 2.0, firewire802.11g (optional airport extreme card)UP TO 6 HOURS of battery life! That's amazingCombo drive CD-RW & DVD-ROM40 GB, Speedy processor (933 MHZ) & LOTS more!CONS:does NOT come with bluetooth & airport card (sold optional)no PCI slot :(speakers are small, and are not that loudi can't find another bad thing about it!!", "Date": "February 3, 2004"}, {"Title": "Very dated", "Author": "Corey Barnes", "ReviewID": "R2E9D0M0NGC9PR", "Overall": "2.0", "Content": "Not very good. Too old to used Firefox, google chrome. Too slow to run youtube. Not the sellers fault, it's just if you buy an Apple computer for under $200, you get what you pay for.", "Date": "July 18, 2013"}, {"Title": "Bad reliability and tech supports", "Author": null, "ReviewID": "R2EC2FI08MJP7D", "Overall": "2.0", "Content": "I have bought an Apple 933 MHz G4 iBook for my wife. It worked beautifully in the first few days. Then it would not start up at all. My wife called Apple tech supports. After few questions, the lady realized my wife was not quite knowledgeable in the iBook and required some hand holding to debug the problem. She hanged up on her. I would never expect Apple support people would do that at all!The 2nd tech support was much more helpful. After running some tests, he decided the hard disk was not working and asked my wife to bring it to a nearby Best Buy for repairing. Best Buy asked us to pay for the shipping fee. We then called the tech support again. We were asked to bring it to a nearby Apple store so we don't need to pay for the shipping fee due to it's within 90 days of the purchase.It looks like the tech supports were more interested in whether we wanted to buy their Apple Care than fixing our problem. I always have very high opinions on Apple products until now.Later on I found out Apple.com has lots of informaiton regarding iBook problems and how to fix them. I was able to fix the start up problem after I have tried several instructions at Apple.com. But the computer failed again with the same problem the very next day! This time I could not get it work per Apple.com's instructions.I would suggest people check the Apple web site for all known problems before they buy any Apple product.I also found out that Amazon's supports were very responsive throughout this event.", "Date": "March 4, 2004"}, {"Title": "The  Best Laptop Ever", "Author": "Steven Litz", "ReviewID": "R30Z88EC377QFI", "Overall": "5.0", "Content": "This is the best laptop I've ever owned. That's all I have to say about that.", "Date": "January 26, 2004"}, {"Title": "Horrendous Customer Service", "Author": "David Lee", "ReviewID": "RMSJ8XZPICLUC", "Overall": "1.0", "Content": "I ordered my Ibook on the 5th of Dec.2003 received it on the 10th. Right out of the box it malfunctioned so they offered to repair it.  That was the 10th of Dec.  Now its Jan, 5/2004 still not fixed.  I've talked to so many diff customer service represents, they are all courteous but none of them know whats going on.  For about 15 days in Dec. the laptop was lost!!! they had no idea where it was.  They are always trying to transfer you to another person who is just as unhelpful and would put me on hold hours at a time.  I even spoke to one person who kept on refering to Apple as Phillips and I would correct him every now and then asking him, Dont you mean apple?  I mean come on!! at least know what company you work for.  I tried returning it but they wont let me on technicality and I had it for less than 2 days.  Talk about frustrating experience..go get a dellterrific customer service and you actually get to talk to people who know the name of their own company.", "Date": "January 5, 2004"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0000U98MQ"}}