{"Reviews": [{"Title": "Dependable system, nightmare company", "Author": "J. Leary \"jleary\"", "ReviewID": "R3GBNEZJXDH3EY", "Overall": "4.0", "Content": "I have owned a Gateway M305CRV for nearly 4 years.  The processor is a 2.4GHz mobile celeron and I installed 1GB of Ram (system max).  I also upgraded the hard drive to 100GB, which the system handles with no issues.Despite the fact that the processor is the older single core vs. the newer dual core intel and AMD models, the performance is still comparable.  I use the sytem for surfing the web, e-mail, photo editing, some video editing, and standard word and spreadsheet processing.  I have also used it periodically for database development in Access.While you cannot use the more demanding programs (such as Access or photoshop elements) simultaneously without bogging the system down somewhat, the performance is still on par with newer processors for working in a single application.  I have owned several different models of the Gateway laptops and Dell laptops, and I find in general that the Gateway models seem more efficient that the Dells. The downside of the Gateway's is the customer service.  If you don't need tech support and can do your own upgrades for most items you would want to change (such as RAM, hard drive, optical drive, etc.) don't be afraid of a Gateway.", "Date": "March 18, 2008"}, {"Title": "I agree with  J. Leary \"jleary\" -- Great computer, horrible company", "Author": "J. Griswell \"peon\"", "ReviewID": "R1RZHRMFIGPHBR", "Overall": "5.0", "Content": "I've owned a Gateway M305CRV for over 3 years with absolutely no issues.  And I bought this thing used as a refurbished unit from Gateway via a third-party reseller online.  It only came with a 90 day warranty from Gateway, but I was able to contact Gateway and get the warranty extended to a full 3 year deal (I had to pay for the extension of course).  But it turned out I didn't need the warranty at all, it expired in March without me using it.When I first bought this laptop I worked for a University in North Carolina that was a authorized Gateway service center (which is why I bought a Gateway).  Of course since I got the laptop, Gateway has gone from being shaky to downright awful.  Selling a large part of their core systems to MPC and outsourcing virtually everything.", "Date": "June 24, 2008"}, {"Title": "Gateway M305CRV a terrible computer", "Author": "Keith", "ReviewID": "R6DJ28EF0V17Y", "Overall": "1.0", "Content": "Unlike the previous two reviewers I did own this exact model computer.  It was a problem from day one.  Gateway's customer service was not helpful and outright hostile at times.  It crashed everytime it was used and its graphics speed was well below average.  It bogged down everytime any game was played.  Painfully slow.  I determined that I will never own another Gateway computer ever.  I have found that Dell's customer service was much easier to deal with.  I rated this item at one star because I could not get it to rate lower than that.", "Date": "March 13, 2008"}, {"Title": "Rock solid, dependable laptop", "Author": "Wahaj", "ReviewID": "R2N9GXMOTNLEAG", "Overall": "5.0", "Content": "I originally got this laptop from Gateway around 7 years ago, it's been the goto computer on the go for me;I've upgraded the memory last year to 1GB and since then it's been able to handle any of the day to day stuff that most people would do (word processing, e-mail) without experiencing any slowdowns; I'm running WinXP SP3 with the usual anti-mal, anti virus softwareI can work on my digital photos with freeware programs like GIMP, and even play some older 3D games (although, if you push it, it will get hot and lead to a system crash, making a reboot necessary), it handles 2D games without issuesAll in all, it's more than paid for itself, i would upgrade it more with a bigger HD if i could find one at a good price", "Date": "April 27, 2012"}, {"Title": "Great, Reliable Computer", "Author": "James S. Wight", "ReviewID": "R30WUL77EVOD7R", "Overall": "5.0", "Content": "I had the Gateway M305CRV for about eight years and it still runs fine to this day.  Sure the fan is a little loud, but this computer will never die.  Mine has even been run over by a car, don't ask, and all i had to do was get the screen replaced and it worked perfectly again.  I get mine cleaned out every 2 years or so, which makes it run like new.  I dont think I know anyone who has a laptop that is eight years old, been through what mine has and still runs. This laptop rules!", "Date": "November 11, 2009"}, {"Title": "I've had excellent performance from my workhorse M305CRV", "Author": "Traveler", "ReviewID": "R39WCCL3LGP0YS", "Overall": "4.0", "Content": "I got this laptop 7 or 8 years ago.  I'm just now looking to replace it and that it how I stumbled I came upon these reviews.Maybe I've been very lucky, but I'd have to say that this laptop has done it's job very well.  For starters, I needed something cheap (~$750, as I recall) that could primarily perform basic tasks.  No probs there.  And no others for the last 8 years, with the exception that the battery did die on my a few years ago.  That's a bummer, but, I think, a common problem not limited to Gateway.Now, the power connection or the AC adapter itself is having problems and sometimes it goes on an extended jag of giving me pop up msgs that I need to reconnect the AC because the battery is about dead.  Also, one of the keyboard letters got stuck at a weird angle and I popped it off trying to fix it.  That'll never go back on.  Along with everything else, screen technology has improved greatly so my screen looks pretty  dull compared to newer machines.Still, we are talking about a very old laptop, here.  If my next one gives me anywhere near this level of service I'll be a very happy man.", "Date": "November 3, 2009"}, {"Title": "Solid and Reliable", "Author": "A. Ortega \"AbsolutAntonius\"", "ReviewID": "R383VLMI9IDC1T", "Overall": "5.0", "Content": "I understand some of the complaints but for the most part it sometimes comes down to whether or not you were unlucky enough to just get a bad system from the company. Fortunately, like most, I got a perfect working Gateway M305CRV years ago and it still bulldozes through whenever I need it to. Powerful enough to use high graphics software like Photoshop CS3 and connects to internet perfectly. I've never had any system problems (other than the ones I brought upon myself lol). The bad reviews are probably true but I think it's because they had a bad system. Notice there are only a few?? lol The rest, like me got the real deal. D*** fine computer! I have to say 5 stars for longevity, reliability, and utility. They can't all be winners, but mine definitely was.", "Date": "August 7, 2009"}, {"Title": "I don't like it... I love it!", "Author": "ehm", "ReviewID": "R1QRXHRVH0TN0B", "Overall": "5.0", "Content": "This came in the mail on the 4th day of me ordering. I was expecting a dirty sticker covered laptop when it came but when I received it, the computer was very clean and had a fresh install of XP. All the drivers were pre Installed and the time was set. It is a very clean though the only thing I wish it had was a wireless card (I found one for $3.99). Thank you seller for this great and clean product.", "Date": "June 7, 2013"}, {"Title": "POS", "Author": "Flive", "ReviewID": "RBZI0L3MRHAQB", "Overall": "1.0", "Content": "You'll notice the first of many problems with this computer when you turn it on, as might be expected.  The noise output of the fan is on par with a 747 at about 1/4 throttle.  I bought this thing for school and used it once in a 90 person lecture hall for about 3 minutes.  Everyone in the entire room could hear it.  You would think that a fan that loud would keep this beast cool.  Nope.  If you try to run more than one program at a time, particularly anything with non-static graphics, this mother will shut off due to overheating.  I will say this for it though, it continues to run after 5 years.  That may be just to spite me though.", "Date": "April 20, 2009"}, {"Title": "Don't join the \" Gateway Nightmare Club\"", "Author": "MShaw \"Careful Shopper\"", "ReviewID": "R1WKRISH0AN1MC", "Overall": "1.0", "Content": "I don't own this specific model, however I did purchase the Gateway DS 450XL.  My laptop worked well for a year and then the nightmare began. The harddrive and screen went bad.  I didn't worry because I had purchased the 3 year warranty. After exhanging numerous calls and shipping my laptop back to Gateway. The lapto was returned.  It worked well for 2 weeks.  I called Gateway again we spent 45 min. attempting the fix the problem.  This was unsuccessful.  They wanted me to pay another $40 to send the computer back to them .  THe service is unsatisfactory and the computer had never worked properly since the first year.  Owning a Gateway Product is a nightmare and trying to keep their produts running well is a full time job.  I will NEVER purchase another Gateway product.  I wouldn't even accept one as a gift.", "Date": "August 26, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "GATEWAY CELERON", "Name": "Gateway M305crv Pentium 4 or Celeron Black Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/51u1TOnE7iL._SX300_.jpg", "ProductID": "B000A36J7A"}}