{"Reviews": [{"Title": "Very happy so far", "Author": "N. Caine", "ReviewID": "R1JAV35KNABY2Z", "Overall": "4.0", "Content": "I got this to succeed an HP Pavilion AMD Duron ZE series laptop.  I got the HP a few years ago after trying a lot of laptops, because I liked the keyboard feel (I typed without looking on many keyboards and the HP had the fewest keyboard-caused typos) and I found the text sharp.  Over time I was held back by:  1) the sound never worked without stuttering, 2) even with a memory upgrade, it was very slow running XP SP2, and 3) the screen was hard to read in a brightly lit room.  I could fix none of these, even after removing every memory resident program, uninstalling all unnecessary software, and using a professional defrag program. But the laptop otherwise served me well.  One thing I learned about laptops:  their performance is influenced largely by the rotational speed of the hard drive and the amount of memory you put in.The Toshiba, which I got on sale, has been a joy.  For a budget laptop, it is one of the few I have found with a 5400 rpm hard drive, and that has made a huge difference!  I also added more memory (512 should be your minimum, but adding a 1 gig module is advised).  Everything works quickly and I have found no little annoying things!  The screen is marvelous:  huge and bright.  Dvd's are gorgeous, especially when using the Dvd player's widescreen mode.  The sound is great.  4 high speed USB ports are wonderful, as they fill up quickly!  The wireless not only works very well, but has a conveniently located on/off switch, so you can turn it off to save energy, a feature not available on the wireless card I added to the HP.  I also like the fact that the Toshiba's only \"extra\" buttons are dvd-type controls (play, pause, etc.).  I find too many extra buttons goofy.  The Toshiba is also lighter than the HP and is thinner.  I'm amazed.On the down side, yes they saved money on the battery.  I do not have experience of long battery lives on laptops in the past couple of years anyway, so I wasn't surprised.  The battery comes out easily if you want to buy an extra.  I'm used to taking my a/c adapter everywhere.  Yet another pleasant surprise is that the a/c adapter is smaller and lighter than my HP's.  Since I take it wherever I take the laptop, this is actually an important feature!Overall, I'm thrilled.  I've read some complaints about other variations of the Satellite line, but I have read of no problems with the A105 series, and this was a very important consideration for me.", "Date": "February 27, 2006"}, {"Title": "nice but fault", "Author": "T. Chang \"tc\"", "ReviewID": "R2AQSU6TPMJDGG", "Overall": "3.0", "Content": "This is a nice computer, the low end of A105 series, the only major problem is you better put aside $144(on sale at Toshiba direct)for a 8cel high capacity battery, the one come with it is a 4cel(2000mah) that run for about 1hr to 1hr and 10min on a good day.", "Date": "February 15, 2006"}, {"Title": "Best Buy best bang for price", "Author": "Erik Breteuil \"vetusvates\"", "ReviewID": "R18VOWVPF7TGQV", "Overall": "3.0", "Content": "I got this A105-S101 model on sale in January, 2006, and for the price it has been very satisfactory.  Excellent for light office/work use and excellent for surfing the net.However: 1) The DVD player does not function at all on moderately-worn rented DVD's, sound is distorted on light- to medium-used DVD's, and the DVD player is only satisfactory at best with brand new DVD's that have just been opened.And: 2) All USB ports have ceased to recognize my Memorex M-Flyerstorage device, as well as all other plug-in storage devices.  So what do I do now with the 4 USB port's...?!And all my new documents I need to transfer to my Laptop...?!Any suggestions...?!", "Date": "August 2, 2006"}, {"Title": "Excellent multi-use bargain laptop", "Author": "Kevin M. Holmgren \"Gadget Guy\"", "ReviewID": "R2LMTJ541WOBBY", "Overall": "4.0", "Content": "I am compelled to echo my felow Satellite owner from NV. I got this laptop on sale at Best Buy for $499 with a free RAM upgrade to 512. I needed to replace my 6-year-old Dell Inspiron 7000 that was just getting too clunky and trouble-prone, the main problem being it took a full 15 minutes to start up. Anyway I want to talk about the Satellite not the Inspiron. The 15.1 inch wide screen is deliciously beautiful. I cannot accent this point enough. Fantastic for web surfing, dvd viewing, digital snapshot sharing, Hauppauge USB TV viewing, anything. The sound is also top-rate, excellent stereo separation, which I was surprised to hear on most commercials when I started using my above-mentioned USB TV tuner, which I will review separately (mini- review = excellent).The weight is perfect for carrying around constantly for whatever use you may think of, this laptop is really an all-around jack of all trades.Only reason I gave 4 stars instead of 5 is the short battery life. One hour seems to ne the limit, grossly short compared to my Dell Inspiron. Of course that is not a reflection on the laptop as much as it is on the battery - just get a better one or a spare one.Also need to warn buyers that what brings the price down markedly is the fact that it only comes (at least mine did) with a 6-monh trial of MS Word, Excel, & PowerPoint, but I solved this problem by backing up my 6-year-old Dell to a 300 gb Seagate external hard drive, and all those apps seem to run on the Satellite off the Seagate drive. Also, Sun has free beta programs that mimmick them.So if you see this laptop in the $500 range, grab it - you won't be sorry.", "Date": "April 18, 2006"}, {"Title": "Not bad for the buck......", "Author": "R. Luhmann", "ReviewID": "R192QTI9I5UHL1", "Overall": "4.0", "Content": "Owned mine for a little over a year- been in the shop twice, once for the display failing and another time when the hard drive crashed.  The \".\" button requires a sledge hammer to work at this point ( 1 1/2 years after pruchase), luckily I dont use it for other than surfing and simple games.Runs pretty hot for the most part- recommend getting a cooling station.", "Date": "November 29, 2007"}, {"Title": "Toshiba Satellite A105-S101", "Author": "LMX", "ReviewID": "R11UQUXOWWP6I5", "Overall": "5.0", "Content": "Still using this computer as of Nov 2012. I bought this at BestBuy March 2006 for 499.00 with free upgrade from 256RAM to 512RAM, it has been a fine computer so far. I upgrade to 2Gig. Nothing went wrong to the point where it does not function. There are a few clitches, but it came back normal. I regularly defrag. & clean-up, this is important PC maintaince. I also delete all the software that I do not need out of the computer, this make the computer to run lighter & faster. Few of the common mistakes computer users have are 1) not defrag. regularly 2) not clean-up disk regular 3) have a lot of software that does not need which cause a heavy load in the computer. If you could carry 50 lbs, why not do it instead of carrying 500 lbs. When the computer has many software inside which it does not need, it will run slower & slower. 4) ruffly handling the computer is a \"no, no\", your laptop is a sensitive & fragile electronic device, handle it very gently or you will pay the price for damaging it. I used cushion to sandwich between my laptop in the computer carry Targus bag. The cushion of computer bag does not have enough cushion to keep the computer from shock injury. 5) used the dust blower can to blast out the dirt every once & a while. I am in deployment right now & dust has got into my broadband portal, at first I thought something wrong with my computer why it did not connect. After blasting into the portal connection, the connection work again, no more problem since. At this time, you can get one on Ebay around 399.00 or less plus shipping, just continue to bid & look eventually you will find a nice one. Well, I hope my comment help & God blessed.", "Date": "July 5, 2007"}, {"Title": "Motherboard Failure, Toshiba Service POOR, Repairs Expensive", "Author": "Robin M. Fairchild \"Robin\"", "ReviewID": "R2LMVA0NW7DZEH", "Overall": "1.0", "Content": "My Satellite A-105-S101 is a year and one month old.  The motherboard failed and is costing me around $400 to diagnose and repair.  The more I look online at Toshiba's past problems and law suits regarding other Satellite versions, I would NOT purchase one.  I called Toshiba to get help and they were mean, rude, and unwilling to help.  I am very careful with the care of my laptop and have been since I made this major purchase.  Good luck if you buy one.  I'm an unhappy Toshiba customer and I will never buy from them again!", "Date": "March 8, 2007"}, {"Title": "Not for music; poor customer service", "Author": "Stixter \"Stixter\"", "ReviewID": "R120JK3R4O3PGL", "Overall": "2.0", "Content": "I bought a Toshiba A105-S101 from Best Buy with an additional 256 MB of memory for $499 in Feb `06.  At the time I thought it was a steal.  In retrospect, I should have left it at the store.I bought this computer to use as a jukebox.  While it performs adequately at most tasks, the machine fails miserably as a sound reproducer - it induces a garbled distortion that one hears at the end of music and system sounds as well as in quiet musical passages.  Though Toshiba's tech support was professional and courteous, they were not able to fix the problem over the phone.  So far, I have had the system board replaced twice, and as I write, it sits at Toshiba's corporate office for \"evaluation\".  They have had it for two weeks and I have heard no news from them.  They never call back or answer e-mails.  I feel I have wasted $500 and a lot of time on the phone and shipping the thing in for repair.The three system boards (original and two replacements) have all displayed the same problem, so I can't help but conclude that it is a design problem with the model, not a problem with my machine.  Yes, I have good ears, and maybe some folks wouldn't ever notice the problem, but I have four Dell machines that sound great with the same music sources; the last thing I expected was that this new machine from a highly respected manufacturer would have such a fatal flaw.If you are planning to use this machine for music, test it first in the store with headphones before buying.Long story short, I gave Toshiba a chance to redeem itself through good customer service and they are failing at that, too.  Upset?  You bet!", "Date": "August 1, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000E50OZW"}}