{"Reviews": [{"Title": "Frooze up each time I used it.", "Author": "Sondy", "ReviewID": "RB3JQY9JJ4TVS", "Overall": "3.0", "Content": "I Had To Constantly Remove The Battery Due To The Laptop Freezing Up Each Day. However, It Is A Very Good Laptop Otherwise, Fast For A 6 Year Old System. I Had To Return It Due To This Problem.", "Date": "April 21, 2013"}, {"Title": "Love it.", "Author": "C.A. Jackson", "ReviewID": "R2M8SA1A8TH77W", "Overall": "4.0", "Content": "Pros:It's cheap,cheap,cheap. Does a decent job for the price. Feels very tough and sturdy.Cons:It's kind of heavy and the battery life isnt going to carry you that long (roughly 2.5 hours with LinuxOS and *I think* old battery) but I leave it plugged in most of the time and have watched a  2 hour movie on the battery alone.The R52 is getting pretty old tech in laptop terms. I don't use it for any heavy/intense gaming or anything it should last for quite a while :)Recommendation:Buy it if you want a simple browsing laptop or to read/watch some movies on it.Maybe as a backup to store  your personal data that you need to quickly access if your main computer ever goes down. Don't expect some awesome machine though; it's a dinosaur!PS - Double check what you're getting! If it says no HD you need to get one (I bought a small flat usb drive and put Linux on it, works great) Does it come with a charger? (I have the cheap chinese charger on here and it works fine) Are there any other problems with it?Goodluck", "Date": "January 17, 2013"}, {"Title": "bAD dEAL", "Author": "DESTOKES1", "ReviewID": "RD6I9Q4DUG76K", "Overall": "1.0", "Content": "Thought i was getting a deal but i guess i didnt read the bottom line. Lap top computer delivered with no power cord and no hard drive. did return finally 10/12................Hoping i get my money back", "Date": "October 17, 2012"}, {"Title": "Surprised", "Author": "bak", "ReviewID": "RIFD0YVEZK75Q", "Overall": "4.0", "Content": "I thought this model was a little newer, I guess not, it works good and does what it has to however it was much to my surprise to not have a windows key on the keyboard. Over all it works fine.", "Date": "October 10, 2012"}, {"Title": "excelent value for the $.", "Author": "Mark", "ReviewID": "R2IL5X8EBNKOSZ", "Overall": "5.0", "Content": "Great communication with this seller. This was a great value for the $. I think I got the good end of the stick on this one. Haven't had one problem with this laptop since purchase. I will purchase from this seller again. 5 star plus!", "Date": "September 27, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000EEZEIU"}}