{"Reviews": [{"Title": "See and Feel before you Buy", "Author": "M. Dominguez \"Serious Book Knight\"", "ReviewID": "R3VBUUL4EL4MVT", "Overall": "2.0", "Content": "If you are thinking about getting a T61p, I suggest youfind one you can see and feel first.Mine is working properly -- I got it with XP Pro.But, I was disapointed in the quality.1) The T series Laptops used to be solidlike a tank -- now they are flimsy like a potatochip.2) There is a flex cable from the keyboard base unit to themonitor lid -- first I have seen in a loptop --Concerned about reliability of the flex.3) Mine has a lump (or bulge) behind the LCD.I feel it as I swipe my hand across it.It is not too visible due to the mat finish,but it is there. I did an internet search andothers are seeing the same thing.4) besides the bulge, there is a noticable dipon the lid near the flex cable area.", "Date": "October 2, 2008"}, {"Title": "I miss my T61p", "Author": "S1500", "ReviewID": "R3FNVYSZTN6K6Z", "Overall": "4.0", "Content": "Disclaimer: This review is more of a reminiscing due to the fact I no longer own one, and these are no longer available.I liberated a T61P from a former employer when I took a business trip to Taiwan and \"forgot\" to bring it back. So began a 5-year love affair that I would never forget. It was comfortable. It was feature rich. Things just \"felt right\" with it, like a broken-in pair of trusty work boots. Sometimes it ran hot overnight, but you were still there.Was it perfect? No. There were a few issues with drivers here & there, but it was in my living room for casual web surfing & mild gaming for years. I got quickly used to the touchpad & classic 2-button layout. Didn't like those? There's 3 above & the classic IBM 'nibber'. The screen was of the no-longer-used 4:3 aspect ratio, giving me outstanding resolution.My question is this: Why did we abandon the 4:3 laptop? I don't need a widescreen display for spreadsheets, websurfing, or dev work. I'm doing that instead of watching The Hunger Games. Most laptops have just 1366x768, and this dinosaur blows them away for pixels(but at a price).I wish the 4:3 laptop would comeback. You would have business users buy them in a heartbeat with a modern version of this. It's just in the screen.Goodnight, Thinkpad. We had a wonderful journey together.", "Date": "June 3, 2013"}, {"Title": "Love it! Truly Amazing!", "Author": "NIck Bond", "ReviewID": "R2QV8CQDEYIXGK", "Overall": "5.0", "Content": "I just got one of these second hand, but in very good condition from my dads work. It doesn't have a single scratch on it. My dad has the T61 and I have the T61P, this laptop is as solid as a tank and feels so good. Its just made right. Although I wouldn't recommend paying 2000 dollars for one of these, if you find a second hand one you should definitely go for it, if its in good condition. I have a G73 and two desktops one of them with an I7-2700k and the other one with I5-750, I use them mostly for gaming and stuff but this is for my school work its not a gaming machine but it does what its supposed to. fantastic laptop.", "Date": "July 13, 2012"}, {"Title": "Good machine until the hard drive crashes", "Author": "driven", "ReviewID": "R1OR8GQS18X5VA", "Overall": "1.0", "Content": "I have owned 10 IBM computers and this is the first Lenovo I have ever owned. The machine worked well and the software was pretty good; although, some of the preloaded software wasn't that helpful and just used up some of the hard drive space.The screen isn't very good and powerful graphics chip goes to waste with a not so clear screen. The computer is fast, when it works.It only took four months before my hard drive crashed. Lenovo service did a great job of sending out the new hard drive and recovery disks but they couldn't help me restore my machine from my external Western Digital drive. Windows Vista kept on asking for an installation disk and as Windows Vista was pre-installed I didn't have this disk. Eventually, I gave up and paid a local tech to restore my computer for $300.The replacement hard drive lasted about 1 year and then it crashed as well. When I originally purchased the machine, I bought the expensive 5 year on-sight service as well. The extra cost didn't bother me, I have money and NO time to deal with computer crashes.Lenovo apparently reset my warranty period when they sent me the new hard drive, to an absurdly short period of time. As such, my machine was already past its warranty period. I purchased the recovery disks for $60 and bought a Western Digital hard drive from Tiger Direct. There is no way I am paying Lenovo for another substandard hard drive.Any benefits this machine may have, is outweighed by the fact that if the hard drive is dead - you have an expensive door stop and nothing more.This will be my first and last Lenovo laptop.", "Date": "December 12, 2010"}, {"Title": "Worthless Warranty", "Author": "TedT", "ReviewID": "RJ1ZEE2CX41KB", "Overall": "1.0", "Content": "As an owner of 3 IBM Thinkpads in the past I have been very disappointed with the Lenovo Thinkpad T61p. It worked well enough for nine months but then the screen went out. When I returned it to Lenovo for warranty repair they said the screen was not covered and demanded $700.00. I pointed out that the machine had not suffered physical damage(not dropped or dented) but they said that \"sometimes this just happens\" and it is not covered under the warranty. Some warranty! Lenovo is not in the same class as IBM. I suggest you look elsewhere for a reliable machine and a reputable manufacturer that honors it warranty.", "Date": "June 3, 2009"}, {"Title": "Thinkpad LCD screens have gone downhill", "Author": "kathy \"kathy\"", "ReviewID": "RC51J4OKRM97I", "Overall": "2.0", "Content": "Agree that the T61p has many positive attributes as far as build quality and performance but the LCD screens on Thinkpads any more are just horrible. Just check some of the Thinkpad forums and you will see all the complaints about narrow viewing angles, terrible contrast, light bleeding on the top and bottom, and washed out colors. This is the one weak link on the Thinkpads since Lenovo took over from IBM is the cheap LCD screens. I was more then a little surprised when I received my T61p to see how much worse the screen was compared to my prior Thinkpads. I have decided after all these years using Thinkpads to look elsewhere for my next laptop.", "Date": "April 20, 2008"}, {"Title": "Battery life very poor. Brightness problem with LCD", "Author": "Senthil V. Gopinathan \"Senboy\"", "ReviewID": "R1C33GPUR4EEJ1", "Overall": "2.0", "Content": "I was excited when I bought this laptop. Because I know IBM thinkpad was the top of the line laptop that time. So strong construction and good keyboard. But.. after a year, the battery did not even hold power for full 30 minutes even after fully charging it. Then I noticed that even with full brightness the LCD looked dull. The maximum volume is half the volume when I compare my 5 year old Dell machine. Disappointed with T61p. It is not worth for the price! Lenovo is not upto original IBM quality.", "Date": "December 8, 2010"}, {"Title": "The North Face 2007", "Author": "Devonian Wrighton", "ReviewID": "R3KG6Q443X1V3A", "Overall": "4.0", "Content": "I just refurbished a Lenovo ThinkPad T61p 6459 & I got to say one of the best laptop designs I've seen . This laptop is a submarine graphics are the envy of more modern laptops. slight overheating fixed with good thermal paste, silent running machine.", "Date": "April 5, 2014"}, {"Title": "Some problems with wear on CPU", "Author": "JC", "ReviewID": "RQV9PP0WKL14I", "Overall": "2.0", "Content": "Hinge on the screen is loose & some of the keys are not working well. I wish the discription was more accurate.I paid a lot for this CPU & it didn't meet expectations.", "Date": "February 22, 2014"}, {"Title": "GOOD", "Author": "Shangkun Zhong", "ReviewID": "R1OPBNXFFGRS2Q", "Overall": "3.0", "Content": "At first I want to return the product because of the running speed of the computer, so I selected the return buttom.But I regreted to return that product soon after I ran the computer again.I appreciate the services in Amazon", "Date": "December 31, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Core 2 Duo T7500 / 2.2 GHz - Centrino Pro - RAM 2 GB - HDD 100 GB - DVD?RW (?R DL) / DVD-RAM\nQuadro FX 570M - Gigabit Ethernet - WLAN : Bluetooth 2.0 EDR, 802.11 a/b/g/n (draft) - TPM - fingerprint reader\nVista Ultimate - 15.4\" Widescreen TFT 1920 x 1200 (WUXGA) - TopSeller - Microsoft Office Ready", "Name": "Lenovo ThinkPad T61p 6460 Notebook", "ImgURL": "http://ecx.images-amazon.com/images/I/41IHTdxUd8L._SX300_.jpg", "ProductID": "B000TUGSC0"}}