{"Reviews": [{"Title": "Design Flaws", "Author": "Hordus \"Hordus\"", "ReviewID": "R2IH78ASWGH9FI", "Overall": "1.0", "Content": "I purchased XPS M1330 on March 2008. Based on a year of usage, I do not recommend this product.Let me layout the good things about this computer first. The screen quality is very good and shiny (I bought the Slim light-LED display for additional money). The colors are very good. The system does not come with a load of unnecessary software and does not slow the performance.  The keyboard feel and comfort is excellent.However, the hardware integration of this computer is weak.  In less than 8 months, the graphics card was completely dead. The mother board was replaced by Dell.  Worst of all the problems is the audio skipping and stuttering during just about anything, playing DVDs, listening to music (either from the harddrive or from an external harddrive), or just working.  If you search the web for XPS M1330 audio skipping, you'll notice that many other individuals have the same problem.  There is a resource conflict between the sound card and the other components of the computer.  Dell is aware of this, yet, they still ship out the computers with this problem.  Apparently, the Sigmatel, the sound card for Dell, and its drivers are responsible for this. Even if you remove the Sigmatel drivers, you'll hear the audio skipping.  My motherboard was replaced second time after consistent errors by the sound card. Still, I hear the audio skipping. I tried all the temporary workarounds that were suggested by many people in forums. But to no avail.In sum, I do not recommend this product. This is one of the premium lines of Dell products.  It is supposed to be highest quality, because it is the highest in price. Yet, the hardware integration is sloppy and poor in quality. I personally regret going with Dell. Next time, I will seriously consider other options, such as HP, ASUS, Apple, etc.", "Date": "March 22, 2009"}, {"Title": "Garbage computer and rotten customer service", "Author": "sw", "ReviewID": "R2DQWQ0HT8B84P", "Overall": "1.0", "Content": "I am now on my 3rd mother board.  Each time it takes 5 to 6, 3-hour phone calls and at least a 7-10 days to get fixed (but usually not for long).Deal with Dell at your own risk!", "Date": "August 26, 2009"}, {"Title": "Great Laptop - How to fix the dim screen", "Author": "A. Brown", "ReviewID": "RJ33DXYCMIRCW", "Overall": "4.0", "Content": "This is a solid laptop with great performance. I too was disappointed with the very dim display when running on battery until I figured out that Dell has set it that way in the system BIOS to persumably extend the battery charge. If you hit the F2 key while the laptop boots up you can enter the Setup and correct this. I moved it from a default setting of 3 to 6 and the display dims only slightly now on battery.Be careful not to change other settings while in setup unless you know what you're doing. You could cause major problems.", "Date": "December 1, 2008"}, {"Title": "Avoid -- Bad Hardware Integration with Vista", "Author": "C. Swartzentruber", "ReviewID": "R1Q3K2GE3CXCCS", "Overall": "1.0", "Content": "These dell laptops seems to have really bad hardware integration.  Purchase at your own peril.  This is my 4th or 5th laptops in the last few years, and by far the worst.  I purchased the dell thinking it would be relatively decent, but I guess I missed all the posts of touchpad issues that should have served as a serious warning.In short, the touchpad integration in these dell laptops are awful.  Less than 90 days after purchasing this laptop, I started having issues with the touchpad being frozen resuming from standby.  I'm relatively computer savvy, but nothing seems to fix it -- I've replaced drivers, done a system restore to an earlier point, and done a full reinstall of vista, at a cost of close to a day.  You can also find stories of people having dell replace motherboards, trackpad hardware, etc., and still can't get to the root of the issue.  It's pretty scary.  Just search on dell touchpad problems for more details on the variety of issues.  I've also had problems with the DVD \"disappearing\", requiring a reboot to see the drive again.  Dell has a community forum for issues, but it is worthless -- there are many more unsolved issues than solved ones.Overall, this is a very nice laptop, but with all the random hardware/device bugs, it is not my idea of a functional piece of hardware.  I wish that I had read more negative reviews myself before purchasing, so maybe this advice will help others.  Unless dell releases new drivers/BIOS, etc soon, it will be the last dell I ever buy.", "Date": "March 29, 2009"}, {"Title": "worst computer I have owned", "Author": "Christy M.", "ReviewID": "R36QGXUISNME4I", "Overall": "1.0", "Content": "This is the sixth Dell computer I own for work or home. I also own a couple macs and Thinkpads at work. This computer was purchased in Jan. 2008 and the mother board has been replaced three times, and the power adapter twice. None of the other computers I own have even needed service, just one Dell desktop that needed the hard drive replaced. Luckily on both I purchased the 3 year warranty (a must with Dell products). But the replacement and repair is slow and given the millions of problems experienced by other XPS 1330 owners just like or worse than mine--Dell is negligent in still marketing this product.  Please don't waste your time or money.", "Date": "July 19, 2010"}, {"Title": "Dell XPS M1330 after owning XPS M1210", "Author": "BigMutt", "ReviewID": "R3JAQC0STEO3V3", "Overall": "5.0", "Content": "I loved my M1210 and used it for 18 months but recently got an M1330 and I like it even better, except for a few things.I did like the 12-inch size and weight of the former, but the 1330 is brighter and the keyboard is a little larger, making for improved useability.BTW, the specs are almost equal: 2.2 GHz processor and 2 Gb. RAM;  with NVidia video card.So the speed is pretty much equal also.I put 4 Gb RAM into both, and the performance difference is negligible.  Don't waste your money:  2 Gb is plenty.The 9-cell battery of the 1330 is bulky and ugly, compared to the 9-cell of the M1210.by the way, about batteries:  that 9-cell from my M1210 is just about shot, even though the laptop was hardly ever run from only this battery.  When using the 1210 mobile, I used the 6-cell almost exclusively;  only using the 9-cell when the laptop was running on AC power.  Why would that wear out a battery?The 6-cell from the M1210 is still fine, having been used about 5 hours a week for 18 months.I liked the rotating camera of the 1210; the 1330 camera is fixed.The 1330 has better heat dissipation: there's a copper tubing setup that winds its way around heat-producing sources and wicks it over to the fan area;  new in this latest design.I hate the multi-media touch controls of the 1330 as compared to regular buttons (cooly lit-up blue) that you push & click to use, on the 1210.I don't like the fact that screen on the 1330 doesn't tilt back further than about 120 degrees,  as opposed to the 1210 tilting back all the way, flat to 180 degrees.the 1330 has HDMI port which the 1210 didn't,  but it only has 2 USB ports compared to the 1210's four.The HDD of the 1330 is more difficult to get at and swap out than the HDD of the 1210.The 1330 could have been made even a bit smaller, because there's a wide wasted-space frame bordering the screen,  but that would have meant making the keyboard the same size as the 1210.  Fine with me, but maybe users with big fat hands complained about not enough keyboard room.Overall a nice laptop.  I especially appreciate the MedeaDirect setup that both of these laptops have: a very nice & useful touch.This is my sixth Dell laptop and because of their excellent warranty service and great customer care support (especially XPS support)  I can't see myself buying anything else.", "Date": "April 10, 2008"}, {"Title": "This computer is horrible", "Author": "Yegneswaran Kumar", "ReviewID": "R1ZR5U3T7A68U3", "Overall": "1.0", "Content": "This computer needs a lot of improvements. It keeps breaking down and Windows Vista isn't compatible with many of my files. Then my C Disk driver keeps breaking down and so my computer keeps crashing. The computer also keeps over heating and I had to send it to Dell about 5 times in 6 months of buying it. I wouldn't recommend this computer to anyone.", "Date": "August 18, 2010"}, {"Title": "Expensive computer, cheap results...", "Author": "Ornela", "ReviewID": "RLHOKH0BLJUU2", "Overall": "1.0", "Content": "It's been a little over a year since I've bought this laptop and since then I've had to replace the DC jack, the AC adapter, and the keyboard. The center control do not work anymore so I have to access controls manually (e.g. volume, eject CD, etc.) The battery is now worthless. It only last for 20 minutes at the most, and the replacement battery is very expensive. Fingerprint reader doesn't work anymore and I can't uninstall or re-install its software. Many software such as Adobe is incompatible with the 64-bit Vista. It overheats to the point where it burns my hands so I had to buy a laptop cooling pad. I get the \"blue screen of death\" very often and the problem started shortly after I bought it; I've tried several anti-virus, anti-spyware, anti-malware, etc., but the problem persist to this day. The frame on the upper part of the LCD and the center controls cover are scratched due to lack of contact protection between the screen and the laptop itself. The wireless card and the touchpad continuously stop working. If I could afford to I would have moved on to another laptop long ago.", "Date": "December 9, 2009"}, {"Title": "Decent, way over priced with major flaws.", "Author": "Deimos \".\"", "ReviewID": "R2O7L8GP5N5Y0C", "Overall": "2.0", "Content": "This is a decent computer, durable and runs smoothly for the most part.  The wireless card used is garbage and cannot hold a signal to save it's life and drops out constantly.  You will need to end up using a USB wireless adapter to use this computer for any internet purpose.  The dvd rom destroys DVD's as far as I can tell, you put them in new to watch a film and get them back out scratched up like they were rubbed with brillo pads.", "Date": "July 26, 2010"}, {"Title": "Screen so dim it can only be read in a dark room", "Author": "Desert Reader", "ReviewID": "R2R4JRUSXZ397Z", "Overall": "2.0", "Content": "This is a nice starter computer, but beware, Dell screens are so dim they cannot be read easily in bright light environments. If you want to sit outside and read your e-mail, DO NOT BUY a Dell laptop. I wish I had known this before I bought the Dell XPS 1330, and I would have bought a Sony instead.", "Date": "July 28, 2008"}, {"Title": "Worst purchase ever", "Author": "Jasmine", "ReviewID": "R2QOAKGZN0DR6K", "Overall": "1.0", "Content": "Got this laptop when it first came out in 2007 for $2700. Complete waste of money. After buying this laptop, something would go wrong with it literally every 6 months. It was under warranty for 3 years. The motherboard and LCD had to be replaced multiple times. Will never buy another dell computer. Only good thing was the warranty but after that runs out you're out of luck.", "Date": "April 6, 2011"}, {"Title": "Dell's only redeeming feature? the warranty", "Author": "tightsandtea", "ReviewID": "RG2I8XW80G4LG", "Overall": "1.0", "Content": "//UPDATE: This piece of **** died on me a couple days before my finals--it lasted a whole year and a month. I've since purchased an Asus which (after a month and a half of usage) works beautifully.My one-year warranty expired a week ago, and I literally think my xps m1330 will die on me at any minute.Pros:lightweight, portable; easy to carry.Cons:everything else. It overheats so bad you could fry an egg on it. Literally--even the plastic keys get hot.Where do I begin?? The laptop broke on the first night I used it; I had just turned it on and started using the internet when it turned off and wouldn't reboot. A technician came out but said the problem was unfixable, so it had to be replaced. A couple months later, the new laptop they had sent (which was supposed to be exactly the same, but was obviously different) died on me--the night before a midterm (I had all my notes saved on it). The screen turned white and made a loud series of beeping noises. Once again, a technician came out, but was able to fix the computer.Maybe half a year later, the charger overheated so badly that it died--this happened days before my new school semester. Once again, I had to contact dell's customer service to send a replacement; though the shipping was fast, it would have been better if the product hadn't malfunctioned to begin with. For a period of time the webcam malfunctioned--I had to contact customer service twice about it. For some reason, flash malfunctions on my computer (I reinstalled it multiple times, but to no avail). The wifi detector is a piece of junk--my roommate (who has a cheaper laptop) always gets internet at our apartment, whereas mine disappears and grows faint. I could go on and on with the problems. The one thing that confuses me is that laptops with worse specs function much better/faster than mine--you'd think with 8 GB of RAM, I could at least open photoshop without it freezing.I've had this laptop for a year and a week and it took more than 5 minutes to open the 'control panel'. That and, within a couple minutes of use, it overheats. Any moment I'm not using it I ahve to turn it off.Don't let my horror story be yours. Spend a little more on a durable laptop that will actually last more than a year. And a note to Dell: if you made your products more durable, I wouldn't have had to contact customer service so often, or have to get everything replaced.Oh, and.. I'm currently trying to copy 2.6 GB of items onto a DVD, and after four hours it will still take 2 days and 14 hours.", "Date": "May 29, 2010"}, {"Title": "Good PC. Sucks to replace", "Author": "B. Keeler", "ReviewID": "R1BZNUFQFP6EPN", "Overall": "3.0", "Content": "I got this for my job as a reporter and I thought so highly of this laptop that I told all of my friends to go out and buy this thing.  I was wrong.  The motherboard crashed on me after 8 months of owning the thing.  I got the new motherboard but Dell wants to charge me 119.00 to replace the motherboard with MY new one.  You'd think that the computer would last a heck of a lot longer than 8 months but i guess not.  I will continue to use this laptop and save up for a new one.  But if this problem happens again, you can kiss this laptop down the drain.  Dell didn't think this laptop out very well.", "Date": "November 6, 2009"}, {"Title": "The Dell that made me a Mac lover.", "Author": "Briana L. Mcginnis", "ReviewID": "R21WJKXWRUHK84", "Overall": "1.0", "Content": "I decided to buy my notebook with the idea that I would spend a little more on one good, reliable computer that would get me through graduate school.Instead, I bought the Dell M1330.I've had it for about a year and half, during which it has been out of commission or only partially functioning for about six months (usually when I most needed it for writing papers).  I am currently shopping for a Mac, despite my long history of owning dependable Dells.First, it runs alarmingly hot beneath the mousepad.  Second, I have gone through 3 video cards, which are evidently soldered to the motherboard, making for a major repair each time the new one fails. This was not quite as infuriating when the computer remained under warranty, but when it expired (after 2 major repairs in the first year I owned it), I was compelled to pay several hundred dollars to extend the warranty to cover the inevitable future motherboard replacements.The M1330 is a cool, sleek, and lightweight notebook, but you simply cannot count on this computer working properly when you need it to do so.  Don't waste your money -- for a comparable price you can get a nice, reliable Mac.", "Date": "February 28, 2009"}, {"Title": "Even worse after repairs", "Author": "What Ever", "ReviewID": "RKAVPSLEKNFCU", "Overall": "1.0", "Content": "After my last review and the motherboard got replaced for the 3rd time it has gotten worse. Once again I had to go through all my settings and reinstall all the programs that I lost. Along with this is iTunes and setting up all my play lists. This takes a lot of my time and Dell just doesn't get this. I just called back because the last tech messed up the built in microphone and bluetooth. So they want to reinstall the OS to try and fix this. They ask if I have important files on my computer. Why should I have files on my computer? This is crazy. They don't care a lick for your time and effort you put into the junk that they sell you. The support might as well not be there. He warned me that my warranty will expire by January. I don't expect this piece of junk to last that long and don't care. I'm going back to Sony. Never should have left in the first place.", "Date": "May 9, 2009"}, {"Title": "Runs Well Between Repairs", "Author": "James T. Chapman \"chapjim\"", "ReviewID": "R2X2G75WQYNJEV", "Overall": "2.0", "Content": "I bought this XPS M1330 in November 2007.  Fortunately, it had a three year on-site repair warranty.  The local repair guy got to know my receptionist pretty well for all the times he fixed this thing.  It's either five LCD displays and four motherboards or four LCD displays and three motherboards, all under warranty.  I replaced the LCD display once myself.Now, the 65W AC adapter is not recognized by the computer and doesn't charge the battery, although a 90W after-market adapter works just fine.  Pradeep, the Dell tech service rep, says the motherboard is at fault.  I'm not sure it's worth the cost or trouble to replace the motherboard since the MTBF has been less than a year.Except for having replaced most everything except the keyboard and hard drive, I really like the computer.  It's the ideal size and weight for what I use it.  It looks good, I like the keyboard and display and it connects quickly to WiFi networks.  It does run a little warm.Too bad it's not reliable.", "Date": "April 2, 2011"}, {"Title": "Defective motherboards! Avoid this laptop", "Author": "thothman", "ReviewID": "R33S32JGXK3UVQ", "Overall": "1.0", "Content": "Other reviewers are right to complain. Do some research on this, and you'll quickly find that users have experienced consistent failures of the motherboard power circuits, leading to a variety of problems. Dell's business model works by pretending these sorts of things don't exist or aren't widespread, they must know given the # of motherboard replacements going on. Tech support from Dell was a massive headache on this.Just stay away.", "Date": "March 31, 2011"}, {"Title": "bad laptop", "Author": "kelsey", "ReviewID": "R193UQ7G135FHM", "Overall": "1.0", "Content": "I can honestly say that dell makes the worst laptops. I have this laptop and I already had to replace the battery and after a few months the battery went again. Also before the laptop was a year old it crashed and the motherboard went as well. It also over heats very fast. I would not recommend a dell computer to anyone I know.", "Date": "February 3, 2011"}, {"Title": "Dell should be ashamed", "Author": "C. Winton \"cwinton\"", "ReviewID": "R1FENBQGETBUZ0", "Overall": "2.0", "Content": "I've been trying to live with this machine for two years now and hate it.  It was a replacement for a Dell 700m which for its time was of a very superior design and was reliable in every respect.  In no way is this a worthy successor.  It runs hot, has a short battery time (2 hours if you are lucky), and basically just isn't reliable.  I can't count how many times it has blue screened on me (Vista Ultimate), reflecting very poor marriage between computer and OS.  Until 6 months ago, when MS released some patches, I couldn't even install software updates.  The fingerprint reader is a joke and the screen has picked up keyboard impressions even though I am quite careful about how I handle it.  Dell replaced the heat pipe to try to cool it down, but that only helped the CPU run cooler, not the overall machine.  I've taken to simply shutting it down rather than using hibernate since half the time if restarts in the case and fries things.I bought this as a long term, serious travel machine, paying a premium price for what I assumed would be superior hardware.  End result ... I feel that Dell ripped me off and will never buy another lap top from them (this was my fourth, so ta ta and good luck).  I'm currently considering purchase of an ASUS U35JC-A1 which with the same screen size is lighter, thinner, more powerful, and has a much longer battery life, all at less than half the price.  I'm sure Dell would claim their hardware has superior construction quality, but from my experience I seriously doubt it.  The company should be ashamed of itself.  Dell's management appears to be operating under the same philosophy that wrecked the American automobile industry, cutting corners to inflate short term profits.  I would like to know the inside story of how this once fine company has sunk so low.", "Date": "November 14, 2010"}, {"Title": "DO NOT BUY DELL.", "Author": "C. B. Drews", "ReviewID": "RMURCRNFZ3DZD", "Overall": "1.0", "Content": "....Unless you want to buy a product from a company that gives you a MAJOR run-around for service and does NOT stand behind their products and does NOT notify you of, nor admit, defects in their systems.", "Date": "October 20, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000WX63C4"}}