{"Reviews": [{"Title": "Great student Laptop!!", "Author": "Daysls \"Lance S Days\"", "ReviewID": "R2UFXGMMDD1RW8", "Overall": "5.0", "Content": "Ive had this laptop for little over a year and used it for two semesters in college, it fits the bill perfectly haven't had a single problem with it. The remote feature is HP's gift to college students because i can be across my dorm, turn it on and select music and videos from netflix from my bed.Pros:Light WeightMedia RemoteExtra headphone portCard readerCons:Haven't Noticed any yet", "Date": "August 9, 2011"}, {"Title": "Multimedia bells and whistles", "Author": "Addartist", "ReviewID": "R3FM8L1TUZKF53", "Overall": "5.0", "Content": "Eye-catching design; Good productivity performance; Altec Lansing speakers;  Blu-ray drive, stylish design, solid performance, and plenty of multimedia bells and whistles.", "Date": "March 6, 2014"}, {"Title": "I never received this laptop I received wrong one.", "Author": "elizabeth", "ReviewID": "R1LPCP662XAVM0", "Overall": "1.0", "Content": "This is not even close to what I paid for. I paid for 3Gb of RAM and Nvidia Gforce video card. You send 1Gb of RAM and Intel video card. I'm not even close to happy I'm returning this right away.", "Date": "June 17, 2013"}, {"Title": "Average PC", "Author": "Jin Xao Yu", "ReviewID": "R20TD1KQTIJ4RH", "Overall": "3.0", "Content": "Pro:PriceProcessor is okNVIDIA graphicsCon:Battery goes bad quicklyVarious software bugs crash computer oftenThis an affordable option if you don't mind buying a battery.  I ended up giving this to my son who seems happy with his experience (16yrs).  The processor is fast enough to run the internet and other mass software packages.  Multitasking isn't painful with the 3gb of ram.  If you are storing lots of pictures and stuff like that, then pass for something that has a larger hard drive.", "Date": "December 18, 2011"}, {"Title": "HP", "Author": "Mariela Marcano", "ReviewID": "R30QKM2UHKU87J", "Overall": "3.0", "Content": "BUENAS TARDES, PUES LE COMENTO QUE AUN NO HE RECIBIDO MI PRODUCTO.... ASI QUE NECESITO INFORMACION EN CUANTO A ESTE GRAVE PROBLEMA", "Date": "February 16, 2012"}, {"Title": "Keep Looking", "Author": "J. Rewerts \"hawkiiis\"", "ReviewID": "R2B7VHQ8MC84VH", "Overall": "1.0", "Content": "I've had this laptop for a little over a year and I wish I had saved my $1500. I've never written a review on Amazon, but after it finally croaked completely I felt obligated to.When I first received this computer, it didn't work. I had to contact HP to order recovery disks. After running the disks the computer did run.About a month ago, the screen would begin to go black and freeze periodically. Again, this laptop is a little over a year old. The screen issue began to be more frequent. I took it to an HP service provider. He told me the hard drive may need to be replaced ($200 parts & labor) or the mother-board would need to be replaced (approx $800 parts & labor). I went the cheaper route and guess what - it didn't fix the issue. So, since I am not forking over another $800, the laptop is junked.EXTREMELY DISAPPOINTING", "Date": "December 20, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Entertainment-centric notebook PC with 15.4-inch screen, HP Imprint finish, and 2.4 GHz Intel Core 2 Duo T8300 processor\n250 GB Serial ATA hard drive, 3 GB RAM, 8x LightScribe DVD-/+RW drive\nConnectivity: 3 USB, 1 FireWire, 1 VGA, 1 S-Video, expansion port 3 connector, ExpressCard 54/34, 5-in-1 memory card reader\nQuad-mode Wi-Fi (802.11a/b/g/n), Gigabit Ethernet, Nvidia GeForce 8400M video card w/webcam\nPre-installed with Windows Vista Home Premium (with Media Center capabilities)", "Name": "HP Pavilion DV6700T Entertainment 15.4\" Notebook PC (Intel Core 2 Duo Processor T8300 at 2.4GHz, 3 GB RAM, 250 GB Hard Drive, 895MB NVIDIA GeForce Go 8400M w/webcam, SuperMulti Pavilion DVD Drive, Vista Premium)", "ImgURL": "http://ecx.images-amazon.com/images/I/31xEPKzC8GL.jpg", "ProductID": "B0009ZECJ6"}}