{"Reviews": [{"Title": "I still love my iBook G4!", "Author": "Margaret Picky", "ReviewID": "R14Q6QZYMYZD0Y", "Overall": "5.0", "Content": "I've had a 12\" iBook G4 since 2005 and it's still my favorite notebook for browsing the internet, writing letters, and even reading pdf's. It's very lightweight and I consider the screen the perfect size.  It's held up very well.  One of the keys has a hairline crack and one of the rubber feet on the bottom fell off but I clean it every month or so and it still looks almost new.My only criticism is that it gets a little warm so I keep it on top of a clipboard when holding it in my lap.  No viruses, no crashes, no worries.When netbooks started becoming popular a couple of years ago, I had to laugh because I already have a lightweight, handy netbook.  In fact, I'm using it right now to write this review.  Given a choice between a new Asus or Dell netbook or a used iBook G4 for the same price, I would take the G4 without thinking about it for a second.", "Date": "June 18, 2009"}, {"Title": "Good Mac iBook", "Author": "Denis Kavemeier", "ReviewID": "R3AMP9DBLM7H0J", "Overall": "3.0", "Content": "This iBook arrived with a keyboard problem, but I was able to get it fixed for free, because it was still under warranty. Originally seller wasn't of much help with this problem, but I got it fixed locally. Works just fine now.", "Date": "January 15, 2012"}, {"Title": "Love this little computer!", "Author": "Faith Harvey", "ReviewID": "R2A3ROUDXY8U2H", "Overall": "5.0", "Content": "I absolutely LOVE this computer! It has everything you need, in a small, compact machine. It's a Mac, so you know you're getting quality, the start up time is extremely fast, and it does everything a similar-looking 13\" Macbook does without you having to pay $1000 for a new computer. This iBook G4 works just as well, and if you're looking for a good, small computer, this is the one for you! The only complaint I do have is that the CD-drive doesn't work (but it's probably an issue on just my machine). Overall, a great buy!", "Date": "September 12, 2009"}, {"Title": "Used iBook G4/800", "Author": "tvsnan", "ReviewID": "R2ZRJP754QOVVI", "Overall": "5.0", "Content": "Bought this for my 7 year old grandson and both of us are very happy with it. Looks like new and runs great. They even did a system upgrade at no extra charge, which was a nice surprise.  Delivery was better than expected. I will definitely do this again when my other grandson is ready for his first computer.", "Date": "January 6, 2012"}, {"Title": "what good is a computer without a power supply? A power supply is basic. I shouldnt have to purchase one now. Absurd.", "Author": "Merrill Cheyne \"thedramamama\"", "ReviewID": "R2BRJFP907GT4N", "Overall": "1.0", "Content": "what good is a computer without a power supply? A power supply is basic. I shouldnt have to purchase one now. Absurd.", "Date": "December 14, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000PEL3KW"}}