{"Reviews": [{"Title": "PURCHASE WITH CAUTION!", "Author": "T.'s Mom", "ReviewID": "R1Y4JHAAZYQ1MQ", "Overall": "1.0", "Content": "I wish I would have done a more comprehensive search of user feedback on the web rather than the professional reviews of this computer.  Sure it's a good bargain, it seems fast and works ok but the piece that I missed was the overwhelming number of users who reported sticking keys.  Guess what 18 days of using my computer keys began to not work.  I was so upset, called Dell and they wanted me to replace the parts.  They were happy to \"walk me through\" the process.....WHAT?! I have an 18 day old non working computer and Dell wants me to do the repairs???  I balked and then they agreed that since it was within 30 days they would send a tech out.  Oh, the techs don't work evenings or weekends, and I don't have a flexible schedule.....so we set up an appointment at lunch, and the tech doesn't show, only to call me to tell me he is on his way at the point I have to be back at work.It gets better.  I am livid at this point, what a waste of money.  I froze the charge since it was all so new.  I call back Dell again and tell them that I froze the charge and want to send the computer back.  Turns out I only had 21 days from PURCHACE to send it back.  Doesn't matter I've only had the computer in my possession for 18 days; it was too late since I was over the 21 days.  I could cry.  On a limited budget I get a computer with keys that don't work and service techs that don't show up.  By the way, the last Dell rep threatened to screw my credit up if I didn't pay.....got to love that....Buyers beware.  It's all so wrong on a number of levels.", "Date": "April 23, 2009"}, {"Title": "Great Deal!", "Author": "L. Lopez \"LouL.\"", "ReviewID": "R2K6GSTTOK3QPP", "Overall": "4.0", "Content": "This laptop does all I need it to do and then some,3 gigs of ram 15.6 inch screen and what many consider a draw back I actually am thankful for,aside from the keyboard the only button on this model is the on switch.The way it feels and where everything is located is just perfect for me.I understand that gamers and power users would require more of everything,but for a good basic notebook with the speed and power of this Dell the price is unbeatable and I love it.Lou", "Date": "March 27, 2009"}, {"Title": "It works, sort of.", "Author": "GC0110", "ReviewID": "R2C8WOM6WD43JJ", "Overall": "2.0", "Content": "I've become an avid Mac fan in the last 1 1/2 years.  I have 2 Macs, for home and office, and I only bought this notebook because I discovered that some programs still won't run under Windows emulation on the Mac.My needs for the notebook are very humble, to run 2 simple programs, that I don't use heavily.  Beyond Windows and Vista being junk, my dislike for the Dell is the keys.  They don't respond well, and I either mistype a great deal, or they simply are not registering the keystroke at all, and so a lot of time is wasted. I've owned 2 prior notebooks, IBM's, but those were bought about 10 years ago.  I'm not up on what other current notebooks are like, but the Dell leaves me unimpressed.  For my simple needs, of occasional use, it's inexpensive and compact, and so I'll keep it.  But, having owned several Dell desktops for the last 10 years, the notebooks do not measure up.Other dislikes: the DVD tray seems incredibly flimsy and fragile. It doesn't eject well, and it can get hung up very easily with seemingly paper thin objects near its path.  The screen display has poor contrast, and I've yet to figure out how to improve on it other than dimming the brightness which doesn't fix the contrast itself.  Maybe that's Windows sloppiness, and not Dell, I don't know.The start-up on a cold boot also seems slow at least compared to my old Dell desktop, and especially to the Macs.  2 USB ports are stacked on top of each other and depending on the thickness of the gadgets can block each other.I also find it hard to open the case. Maybe I have too clunky fingers, but the other notebooks I've used had a more tactile latch and point to grasp.  And the shiny cover, all pretty and glossy for the first few seconds, is rapidly covered with fingerprints which detract from its appearance.Bottom line: it works, but attention to detail is not good, quality construction is missing (made in China, where else?), and performance is subpar.", "Date": "June 16, 2009"}, {"Title": "Great computer for the price", "Author": "MChief576", "ReviewID": "R1DP74U2F461KM", "Overall": "4.0", "Content": "My old Dell Inspiron died after 4.5 years.  It treated me well, it rarely crashed.  I think the motherboard died, b/c my HD was readable when I bought the new Dell.  The new Inspiron is great.  Love the wide screen monitor.  I played the Dark Knight on it, and it looks beautiful.  The sound is ok.  The computer runs very smoothly.  Its rare I am waiting for anything.  The Inspiron connects to my wireless network without any issues.  I used to loose my connection with my last laptop.  I thought it was Comcast, it appears it was the computer.  The HD is completely silent.  The only noise comes from the fan once in awhile.A few cons...  The Mouse pad is not as smooth as my last Inspiron.  It \"sticks\" once in awhile.  But I do like the two mouse pad buttons.  I didnt like all the Vista security.  But, that is something you can turn off.I havent used the cd/dvd burner yet.  But I dont expect any issues.For those who only need the basics, this laptop is a great deal for the money.", "Date": "April 20, 2009"}, {"Title": "Will Not Last", "Author": "Mary C", "ReviewID": "R3TP5ETRNRD4TK", "Overall": "1.0", "Content": "I bought this at another retailer for $500.  Not worth it.  It developed a hard drive problem after owning it for four months.  It needed to have a new hard drive installed, with all the problems and hassles that come with that process.  I'm still not sure it will last.  Do not buy this computer; do research, and pay a few hundred more dollars upfront to avoid the problem.  The tech who looked at the machine said he's seen this model develop hard drive problems within weeks of purchase.", "Date": "July 15, 2009"}, {"Title": "Piece of total junk", "Author": "Deimos \".\"", "ReviewID": "R2O1G364X2ZFTB", "Overall": "1.0", "Content": "Ever wanted to test the dreaded blue screen of death feature in a Windows notebook, look no further.  This machine comes with Vista home basic and crashed ever 5 mins, even when I would fix the driver issues.  Then I upgraded to Vista home Premium which made the system more stable for internet use but still crashed an insane amount of times.  I now use a Dell XPS which is flawless, a Macbook Pro which I have had for a year and a new 24\" Imac, which  have yet to fail or error a single time.  Avoid the Dell Inspiron (this make of Inspiron anyway) it's a waste of time and money.  The hard drive's are garbage and the wireless cards used in this notebook and the XPS are terrible, zone out and fail in a month.  The keyboard is comfortable, alot like the Latitude keyboard but cheaper, and the dvd rom is brittle, flimsey junk.  Overall this is just a terrible computer in every sence.  It looks nice, with a nice design but it's a wolf in sheeps clothing, it's garbage.Highly recommend everyone avoid this notebook.", "Date": "July 8, 2009"}, {"Title": "Buy if your looking for a headache.", "Author": "Music like water", "ReviewID": "RAZCNT7LZWCIC", "Overall": "1.0", "Content": "Actually I would really give it less than 1 Star.In my experience, with this computer you will need to replace the battery after 6 months or less even with LIGHT use (at the cost of $175 through Dell). Secondly, your 'Laptop' will end up becoming a 'Desktop' because the screen will quit working and you will have to borrow your screen from your desktop (unless you want to pay the $200+ to repair or replace the screen).  Thirdly, you will find out that your Desktop screen will not keep a signal  because there are no screw-in options on the side where the connection for the extra screen is.  All of this will thenleave you with the the following options: a)replace the screen b)repair the screen if it is possible to repair or c)buy the replacement part that has the screws on it so your desktop screen will keep a signal.And if that isn't enough to turn you off, no worries, because it gets worse...After all of the above, out of the clear blue sky, your hard drive will take a dive & then all you will be left with is deciding which day to take it out to the trash.To give you an idea of how common my story is with this brand, here's some searches you can Google:1) Dell Inspiron+screen black2) Dell Inspiron+screen won't come3) Dell Inspiron+battery not charging4) Dell Inspiron+won't boot upBottom Line: Unless you are looking for a way to give yourself a migraine, I would highly recommend that you steer clear of this brand altogether.", "Date": "August 1, 2009"}, {"Title": "Robust Student System", "Author": "Emil A. Juman \"Doberman Owner\"", "ReviewID": "RU8JW5EST34K9", "Overall": "5.0", "Content": "Good speed, enough RAM and beautiful display screen. A great system for a student or regular user, can even play a few games well that has graphics scaled down of course.I recommend it totally for the price and if you change machines every 2-3 years as well.", "Date": "April 14, 2009"}, {"Title": "Dell's Warranty: Caution!!!", "Author": "James M. Bailey", "ReviewID": "RDCMXOB58F500", "Overall": "1.0", "Content": "This is my saga of attempting to use Dell's extended warranty.My saga begins in January of this year.  My Dell Inspiron Notebook began to fail.  This resulted in four technicians visiting my home.  I waited for one technician on three different days until he finally showed several hours late on the fourth appointment.  The first replaced my video card, the second replaced my video card but when this did not work, he phoned and another technician came and replaced the LCD.  The third replaced the video card, the LCD, and the motherboard.  There was still a problem.  I might add that with three of these, there was a long conversation on the phone.  I am now quite good at understanding Indians speaking broken English.When my computer failed again Dell finally agreed to replace my computer.  While very frustrated, I felt at least I was making progress even though this meant I would have to reload all my programs.  My refurbished computer arrived and it was an upgrade over my old computer.  I reloaded my programs but quickly noticed a problem with the hard drive hanging up.  I could not believe Dell would send me a computer with a bad hard drive but after talking to Dell again and running a long test, the hard drive was indeed found to be bad.Dell then told me they would send a new preconfigured hard drive and it would arrive in ten working days.  I phoned again in fifteen days and they apologized that there was a technical problem and the hard drive had not been mail.  They guaranteed I would receive it in five days.  I phoned again the next day and the person could find no action had been taken but he agreed he would send the drive and it would arrive in three days but it would not be a preconfigured drive.  I would have to use the restoration disc.I phone again and they said I would receive it in two days.To be continued.", "Date": "November 4, 2009"}, {"Title": "love it =]", "Author": "T. Jenkins", "ReviewID": "R2TC7Y5ML4MJBN", "Overall": "5.0", "Content": "Hi,Reading reviews is very helpful and i tend to read alot before buying something this expensive. Waiting in line to buy this exact computer i overheard a lady who was reterning the exact same one because of it failing to recognize netwerks. I bought this anyway for my daughter. And she has never had a problem with it its been around 2 months and it works perfectly for a great price! Though she wishes it had a web cam, that is really the only major drawback. Unless you need a ton of space this computer is great for a student or someone without a need for a hudge hardrive. It runs fast with a dual processor, and can run sims 3 perfectly. The screen is good and clear, but the other drawback is that sometimes stalls. There could be aproblem with internet explorer or a problem with the wireless, but that is a rare occurance. She loves the laptop and I would advise anyone looking for a fast relativly cheap computer to buy this one.", "Date": "July 29, 2009"}, {"Title": "Works great, Never had a problem. Perfect for students who want a BIG screen (Movies, homework, Netflix yay!)", "Author": "K. Woodward", "ReviewID": "R11F0ABM1LLDWS", "Overall": "5.0", "Content": "Our family has a couple of these as all of us are in college. They are perfect for homework, movies, netflix, games, and even graphics programs. Never had any issues with mine or any one else's.A great low cost solution for a powerful laptop. If you need a computer for internet, basic programs, movies, etc, then this is the perfect laptop.Any serious gamer or graphic designer may want a more powerful system though. But it does what I need it to when I need it to.", "Date": "August 8, 2013"}, {"Title": "Save your money and buy an Apple", "Author": "Jane Doe \"Jane\"", "ReviewID": "R20V4NOC2YZPAV", "Overall": "1.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo36M8A61JZBMRJembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo36M8A61JZBMRJrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo36M8A61JZBMRJchiDiv\").innerHTML = document.getElementById(\"cv_mo36M8A61JZBMRJhiddenPre\").innerHTML;\n};\ncv_mo36M8A61JZBMRJrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo36M8A61JZBMRJso;\t   \n\n\nfunction cv_mo36M8A61JZBMRJloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo36M8A61JZBMRJso = new SWFObject(swfLocation, \"cv_mo36M8A61JZBMRJAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo36M8A61JZBMRJso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo36M8A61JZBMRJso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo36M8A61JZBMRJso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo36M8A61JZBMRJso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo36M8A61JZBMRJso.setAttribute(\"height\", swfHeight);\n          cv_mo36M8A61JZBMRJso.setAttribute(\"width\", swfWidth);\n          cv_mo36M8A61JZBMRJso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo36M8A61JZBMRJso.write(\"cv_mo36M8A61JZBMRJflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo36M8A61JZBMRJ', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo36M8A61JZBMRJ';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo36M8A61JZBMRJ', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo36M8A61JZBMRJloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo36M8A61JZBMRJ\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m343BWGGL4EPSW\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m343BWGGL4EPSW\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R20V4NOC2YZPAV\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m343BWGGL4EPSW/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo36M8A61JZBMRJduration')) {\n      document.getElementById('cv_mo36M8A61JZBMRJduration').style.display='none';\n    }\n    cv_mo36M8A61JZBMRJloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo36M8A61JZBMRJloadSwf(movieID, playerVersion) {\n   return _cv_mo36M8A61JZBMRJloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo36M8A61JZBMRJnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo36M8A61JZBMRJ', 0, h);\n}\n\nfunction cv_mo36M8A61JZBMRJresetPlayer(w,h,bw,cc) {\n  cv_mo36M8A61JZBMRJnewHeight(h);\n\n  cv_mo36M8A61JZBMRJso.addVariable(\"resetBandwidth\", bw);\n  cv_mo36M8A61JZBMRJso.addVariable(\"cacheCode\", cc);\n  cv_mo36M8A61JZBMRJso.setAttribute(\"height\", h);\n  cv_mo36M8A61JZBMRJso.setAttribute(\"width\", w);\n  cv_mo36M8A61JZBMRJso.write(\"cv_mo36M8A61JZBMRJflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo36M8A61JZBMRJRollOverImg = new Image();\ncv_mo36M8A61JZBMRJRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81-LkFe3EPS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo36M8A61JZBMRJpreplay = document.getElementById('cv_mo36M8A61JZBMRJpreplayImageId');\nif (cv_mo36M8A61JZBMRJpreplay) {\n  cv_mo36M8A61JZBMRJpreplay.onmouseover = function() {\n    cv_mo36M8A61JZBMRJpreplay.src = \"http://ecx.images-amazon.com/images/I/81-LkFe3EPS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo36M8A61JZBMRJpreplay.onmouseout = function() {\n    cv_mo36M8A61JZBMRJpreplay.src = \"http://ecx.images-amazon.com/images/I/81-LkFe3EPS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo36M8A61JZBMRJpreplay.parentNode;\n\n  var cv_mo36M8A61JZBMRJcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo36M8A61JZBMRJcurrentClick) {\n      return cv_mo36M8A61JZBMRJcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:55 Mins", "Date": "March 17, 2010"}, {"Title": "good price good pc", "Author": "R. Alvarez \"OK\"", "ReviewID": "RAYF5796H8SCH", "Overall": "4.0", "Content": "Its an OK computer. Not too shabby not to fancyit will get ur email, word processing done no more", "Date": "July 15, 2009"}], "ProductInfo": {"Price": "$599.99", "Features": "15.6-Inch laptop. Windows Vista Home Premium\nUp to Intel Core2 Duo processors\n3 GB DDR2 SDRAM\n160 GB Hard Drive\n8 hours and 7 minutes of battery life with the 6-cell battery.", "Name": "Dell Inspiron 15 I15-156B 15.6-Inch Notebook PC - Pacific Blue", "ImgURL": "http://ecx.images-amazon.com/images/I/413nl6tmIUL._SX300_.jpg", "ProductID": "B001R95IDM"}}