{"Reviews": [{"Title": "Great Laptop", "Author": "Nu Mantra", "ReviewID": "R1YRFTQZIB16TT", "Overall": "5.0", "Content": "This is my first laptop and I think I made a great choice.  Firstly, I bought it directly from hp.com and with the rebates I had, saved two hundred dollars. Secondly, I got free 2 day shipping and it arrived on time.The first thing I like about it is that the color is not the cheap gold look you see in the picture. I love the keyboards on HPs Entertainment and Special Edition notebooks. They do not feel cramped. There have been many cmplaints about the glare of the keyboards on this and the black and chrome models.  So far, I have had no problems with the glare.  Yes, I agree with the other reviewer, that the keys are hard to see in the dark.  I would assume that would be the case for any laptop unless it is backlighted and this is not. It is light (wtihtout the battery), the speakers generate nice sound, it finds wireless networks instantly, and I actually like Vista.  Just a note, read up on accessing the hidden administrator account if you are new to Vista.  It has some serious security that will keep you from making even the most basic adjustments, including removing the bloatware.HP has done a wonderful job in including set up tutorials and online registration processes. The size is fantastic and screen is beautiful.  I have not attached any peripherals up to it yet, so I cannot really comment on that.Cons:The battery life is short.. maybe an hour and a half even when it in the recommended power save mode. It has a lighted HP emblem on the back of the cover that uses resources. HP could have added the backlighted keyboard instead!  The verdict is still out on there telephone tech service!  I have had better experience with there chat support.The comp does sound like it is working overtime anytime I burn a CD and the vibration generating from drive is a bit too much for me to type at the same time.This is a great laptop, esp. if you can get it for under $[...]. It has only some bells and whistles, so if you want built in bluetooth and a blueray player, you will have to go up a model.  Otherwise, no reason not to consider this one.", "Date": "February 4, 2009"}, {"Title": "don't go for bronze color notebook", "Author": "Sachin M. Agrawal \"Sachin Agrawal\"", "ReviewID": "R2J9UCLTID9CRD", "Overall": "3.0", "Content": "Performance is good, lookwise it is good and come with good features but only problem is with keyboard color...you can't see lables/alphabets on keyboard clearly (because of bronze color) specially during night time...I am good in keyboard typing so it's fine for me ..if you are not good in typing and can't type without looking into keyboard then little bit you need to strugle in finding keys in keyboard.This laptop worth it for $700....good value for money and go for it if you are comfortable with keyboardI am unable to edit my rating ...I will rate this laptop for 4 out of 5", "Date": "January 23, 2009"}, {"Title": "problem with keyboard", "Author": "D. Shah", "ReviewID": "R1DOPRJP0J018K", "Overall": "2.0", "Content": "keyboard is dark gray with black letters; virtually impossible to read except under direct bright light. I had to return the laptop.Flawed product design; HP must redesign keybord.", "Date": "February 24, 2009"}, {"Title": "Impossible to see keyboard", "Author": "Beth", "ReviewID": "R1B2IP54JWSJOQ", "Overall": "1.0", "Content": "This would be a nice little laptop but the contrast between the key color and the letters on the keys is not nearly enough to see what keys you are using.  None of my people could use this laptop, even the touch-typers because they still needed to be able to see what the function keys do.(The function keys seem to be different on every laptop.)  I have returned this as it is unusable as shipped and you can't tell by the picture how hard it is to see the keys.", "Date": "May 14, 2009"}, {"Title": "My First HP Laptop", "Author": "Danny K", "ReviewID": "R7AM9C9M5XK85", "Overall": "4.0", "Content": "I've had this laptop for two days, got a great deal from a local electronics store. My previous laptop was a Asus 1000, but the 10 inch screen on the Asus was getting to me. I really wanted the HP 13.3 inch screen model but could not find a good deal. So going with the 14inch was my choice. If you are experienced with windows, you will be able to remove all the crap that HP gives you with this machine. Newegg has many Hi Tech users and 62% give this 5 stars.PROS:1. Much much faster than my old Asus netbook (I'm learning Vista)2. I like the removable DVD drive to reduce weigh.3. The lighted controls for volume and more are a nice touch, very easy to operate. (previously I would have to click on the screen and find the volume)4. I like the mouse pad and scroll bar. Plenty of finger space.5. HDMI output with a remote control!!  I've tested the remote and it worked great. I also tested the HDMI output to my LCD TV and the picture was the best I have seen yet from a computer. (Previously I hooked my Asus to my LCD screen but had to rely on the computer sound, picture and sound blow the Asus away)6. Great Wireless N!!  Much better range than my old Asus. (Many HP laptop models have a better rating on Amazon but they don't have wireless N. This one does. With a wireless N router you can double your speed if you have a good internet connection. Moving large files in your home network etc. (I walked this to the other side of my house and still had a great connection!)7. Sound is clear and much louder than my old laptop. Very nice!8. Screen is clean and bright.CONS:1. Battery. I get two hours. (on my old machine I got 5 hrs. I'll solve this by purchasing an extra battery)2. Keyboard markings are very dim. (This is not a problem for me, in a dim room the screen is bright enough to light the keys. I should point out that my old shiny black Asus was tough to see the keys in a very dim room)3. No bluetooth, but it does come with the software built in. I see that Amazon has many dongles that can plug into the USB ports. I'll followup this review after purchasing one.Finally I'd like to add that I feel I'm going to love this machine, I've used the DVD burner and its twice as fast as my old external burner. My wife's Acer laptop model 3000 can't touch this machine.UPDATE:I removed the negative comment on the DVD, the Drive is perfectly fine. Also found out that right above the SD card location is a slot to store the remote control that comes with this. Just snap out the dummy expansion sleeve and insert your remote. Very Cool! I also bought a Bluetooth adapter and plugged it into a USB slot and it has the best sound to my wireless bluetooth headphones that I have ever used to date.Latest update 9-18-09:Downloaded the evaluation version of Windows 7 from the Microsoft. It comes in a ISO file which I burned to a blank CD and inserted into my laptop and it completely wiped away Windows Vista and installed Windows 7.  This machine now is the fastest laptop in my house. Windows 7 is better than Windows XP and blows away Windows Vista in too many ways to mention here. I strongly recommend everyone to upgrade when Microsoft comes out with their final version on Oct 22nd. I'm sure Amazon will be selling it.", "Date": "June 7, 2009"}, {"Title": "HP at it's [Affordable] Finest.", "Author": "S. Hobal", "ReviewID": "R1YCMONMOHILNJ", "Overall": "5.0", "Content": "I love HP. My LCD is from HP, my printer is from HP, etc. Something I'm not, though, is biased. Even though I prefer to buy HP products, I know a bad deal when I see one. And this, my friends, is a good deal.First of all, don't expect the computer to run like a desktop. Laptop components are steered more towards energy efficiency then performance. I'm not saying the machine is slow, just not as fast as a desktop with similar \"qualities\". That said, on to the review:The design of this laptop is slick. Not too crazy, not too lamey, but right... in... the middle. Bronze definitely does not get enough credit.I love the screen on this thing. It's the perfect size (at least for me); not too big [and heavy], and not too small. Also (and when compared to other laptops), it's pretty bright. If you're not used to using wide screen displays, the screen configuration will feel weird at first, but you'll get over it soon.I can see a lot of people having trouble with the keyboard. While it's quite clear in a well illuminated area, Without a significant light source, it becomes hard to read. I kid you not, you will be squirming and bending over tying to get in an angle where you can see the keys.The machine comes with a built in camera and microphone, which is quite nice; the camera especially has higher quality then most webcams you can buy in stores, and HP software makes it fun and easy to add some effects to photos, though you're going to want a more powerful image processor for greater versatility and options.The control it brings is nifty, but since the laptop does not come with a T.V. Tuner, you'll find little use for it aside from watching movies and listening to music.HP SmartBay let's you remove the DVD-ROM [with LightScribe!] in order to reduce weight. I find the difference insignificant.You may want to increase the weight by adding a battery with more cells, though, the battery can last a long time if you're not doing anything pressing, but gaming (or rendering complex media) will drain the battery in a couple of hours.As far as performance goes, the Laptop plays the Sims 3 faster then any machine I've tried it on, so kudos. I had my doubts about the integrated Intel GMA 4500MHD, and it could play more smoothly, but overall performance is not a problem. This Laptop delivers.An important note: this laptop comes with an N-WLAN card, which is awesome. N cards are faster then normal WLAN cards, and also work from further away.I plan to switch to XP nonetheless, but so far so good. Sometimes I think my laptop hates Vista as much as I do, but that just makes me love it more.Windows Vista comes with Service Pack 1, and it's 64-bit edition, which is necessary for running those 4 GB of RAM. The 320 GB HD, is kickin'!I have had no problems with this machine, HP delivers again with it's trustworthy Pavilion line of computers. Just make sure you have a light on.", "Date": "July 21, 2009"}, {"Title": "the best laptop EVER", "Author": "Lexi Marie Mayhem", "ReviewID": "RAX45U99U9567", "Overall": "5.0", "Content": "This is not even close to my first laptop I get a new one at least once a year to keep up with the crazy needs of my job. I love this HP so much it is fast but you need to keep in mind that is has windows vista this will not make the laptop bad but if you hate vista you may not want this. I will say I have had lots of laptops that I have spent about 1,000USD more on that dont work as well. This is fast and will fill the needs of anyone in school it is also amazing for work and play. For the price it is well worth it. As far as the dark key issue I got moonlight white : ) so I have pretty white keys that shimmer a little. HP is always a brand you can trust even if there is a issue they will help you work through it.", "Date": "April 16, 2009"}, {"Title": "Difficult to use", "Author": "kk \"KSK\"", "ReviewID": "R3S7T1MOULF3VW", "Overall": "2.0", "Content": "We have had trouble with it dropping the internet and freezing up. HP has been helpful but it is a pain to spend an hour ever few days to get it up and running again. I thought it would be fast and it isn't fast at all. I have other computers in the house that run much better so I don't think it is anything that I am doing.", "Date": "September 10, 2009"}, {"Title": "Great computer !", "Author": "Shumo Locuaz \"Logan\"", "ReviewID": "R42ES11YPLUBZ", "Overall": "5.0", "Content": "This is my first HP laptop, my father has one and that's why I decided to go with them.First the computer looks awesome, well built and solid, its shiny and good looking. Some say that have problems with the colors of the keyboard, but if you know how to type using all your fingers and the correct way you will have no problems.The performance is good too, it has 4 GB of ram wich are more than enough to handle Vista.Yesterday I went ahead and did a clean instalation of the new Windows 7 RC, Microsoft really did a good work with that OS, super fast and stable, you should give it a try!!Overall I'm very happy with my purshase, when I first powered it on I had to reinstall the sound driver for a minor issue with the touch button for the mute, but everything else was ok!I highly recommend this computer !!!!!", "Date": "July 6, 2009"}, {"Title": "Works great", "Author": "John M. Wells", "ReviewID": "RGK1478RGJAP9", "Overall": "5.0", "Content": "This laptop works great right.  It worked great out of the box.  I have been using it daily for about a month and it still works great.  No problems at all.A couple reviews said they had trouble seeing the keyboard letters.  I have no idea what their problem is.  I can see the letters fine.  Of course, most people (including me) type by touch, but when I saw those reviews I looked and the letters on the keyboard are EASY TO READ.", "Date": "June 9, 2009"}, {"Title": "Don't buy if you need to see keyboard letters", "Author": "Harry Mills", "ReviewID": "R2V67JRLVHE8RY", "Overall": "1.0", "Content": "Having to return this computer right out of the box... simply cannot read gray lettering on bronze keys... HP design flaw.. otherwise would have been just the computer for me. Frustrating and disappointing. First HP product I haven't loved!", "Date": "May 25, 2009"}, {"Title": "For what it is intended to do...not bad", "Author": "S. Melvin", "ReviewID": "RZ8TL0OLYPR8J", "Overall": "2.0", "Content": "Update: this particular model has a serious issue with heat. The internet is rife with compaints about the laptop failing to boot due to an \"overheat condition\" which is a fault that can only be fixed by HP or a trained tech who can bypass the heat fault. Mine experienced this issue and even with the new board and heatspreader it still died. I initially rated this a 4 of 5, but after realizing how bad the design on this laptop is, especially if you have this issue and have to take it apart, I have lowered my review to a 2 of 5. This major flaw is a show stopper for HP, which seems to be ignored through various models. Be forewarned!The laptop is similar to so many other basic laptops in this price range from the major manufacturers that it is hard to distinguish one from another.  The monitor is nice, the layout is alright and the overall feature set is not bad (camera, HDMI, remote, etc).  Overall, my initial impression (just pulled out of box this weekend and spending my initial time updating, installing and removing software) are that for the money, it will do exactly what we intend it to do--surf the internet, handle last and some current generation games, watch movies and provide access while on the go.  This is certainly not a desktop replacement, nor should it be treated like one.Pros: weight, camera, OS (64-bit should be the new standard), video card (for integrated anyway), and finally the HDMI and other connectors.Cons: lack of installation software (standard HP practice is to make you make your own copies using DVD backups, which is silly since you bought the dang license), weird molded corners that look/feel cheap, crapware (okay, HP and most other major manufacturers do this to offset the cost of the machine, which is a hassle when you first pull your new machine out of the box, but nothing that can't be fixed using some very simple uninstall assistance--I personally like [...] to remove all the stuff I don't need or want).Overall: for ~$600 with rebates and Amazon pricing it's not a bad machine for the basics of computing while on the go or from the comfort of our couch.  Great little feature set that should last you a while or at least until you're ready to move up to a more powerful laptop for a higher price.", "Date": "May 23, 2009"}, {"Title": "great but loud", "Author": "Aniella", "ReviewID": "R1CUB1MNRPIAX3", "Overall": "2.0", "Content": "I purchased this laptop with graduation money (2 years ago), and it was my first. I really love the way it operates - it's easy to use and a great size. However, within a couple months, the fan started running really loud. I have updated the BIOS, restored it - a multitude of things - and still the fan runs as if it's a jet taking off, even when no programs are running. I wouldn't recommend this laptop simply for that factor, and right now I'm in the market to replace it.", "Date": "June 3, 2011"}, {"Title": "18 Month Disposable", "Author": "Jack Wilkerson", "ReviewID": "R1NNRIOH4RYMQR", "Overall": "1.0", "Content": "After 13 months just after Warranty expiration, the display had lines across the bottom. Today at 18 months the display started to go into flicker failure. My \"contact\" with HP support is essentially useless. No more HP computers for me. They are worse than the worst Chinese junk systems. It really is too bad for a once first rate company. The only good thing about it is a good keyboard for typing.", "Date": "August 27, 2010"}, {"Title": "Worst laptop I have ever owned", "Author": "Jason Alden", "ReviewID": "R18QCQHIK62SMR", "Overall": "1.0", "Content": "I constantly had problems with this laptop. A year and a half later the laptop does not work at all.  It has cooling issues, and never really worked well from the beginning. After being a fan of HP for many years, I will probably never by one again.", "Date": "July 25, 2010"}, {"Title": "Going Fast!!!", "Author": "Russ", "ReviewID": "R1FU4OEDZWF68T", "Overall": "3.0", "Content": "I bought this laptop a year ago. Returned it FAST. I could not see the keys, even during the day, and I have 20/20. The keys were dark bronze on a shiny light bronze keyboard. I bought the dv7-1232nr by HP. LOVE IT!!! Almost the same computer with black on silver. That was the one I originally picked out but was accidentally handed the bronze. HP must have realized that this was a glitch because all the laptops in Bronze released after, that either had black, or white letters on the bronze keys.", "Date": "December 21, 2009"}, {"Title": "Overall decent laptop, but sacrifices for looks", "Author": "Tony H \"tonycollective\"", "ReviewID": "R35ZHWRHE4WHP3", "Overall": "4.0", "Content": "Introduction: I've had this laptop for six months and use it for random internet searching and school, occasionally i play games on it and frequently stream movies and videos. The reason i am rating this four stars is because i only paid 650$ for this.Nnow, if i were to have bought it for 800$, i would have given it three stars. But i am reviewing solely as how i personally bought it.Pros:It's pretty fast.It looks cool.Lots of memory.Lots of RAM (i don't know if 4gb is being brutally honest though)It was cheap (in my case 650$ at Best Buy).It's pretty light.Built in webcamAll the basics are included.I've had no issues with it since i restored it.Still runs about as fast as when i bought it 6 months ago.Downloads/streams fast with a good internet connection.Vista is not that hard to figure outCons:-Very, very short battery life. it goes about an hour and a half without having to charge. And if you don't want an extremely bad glare, you have to turn up the brightness and it lasts even less than that.-Bad glare, like i just mentioned. Shiny=looks good, but glare.The volume on the keyboard is slow to respond, if it responds at all.-It's filled with adware when you buy it. FILLED. So you first have to delete all the junk it comes with.The mouse touchpad is uncomfortably sticky. Would be much better off a normal smoother mesh.-Had a few issues with my files going completely missing when i opted to show hidden files and had to restore my computer to fix it. (which was okay, doesn't take too long)-Overheats if it sits in your lap-No longer opens and closes smoothly. Really rough and makes a sound.-Flimsy screen. Very Plastic in the back but hasn't caused me any issues.-Compatibility issues with vista 64 bit (can't play civ IV, among other things)-I've had to do a fair share of googling error codes, but usually i find a solutionConclusion:While i did have some early issues with it, i've made the most out of this laptop and i believe it's a good bargain. I have to connect my own mouse and keep it on a flat surface and usually just leave it charging all the time, but i don't mind that really, because i'm always near an outlet and when i'm not there isn't internet access anyway so i'd have no use for it. HP has partially sacrificed performance and convenience for looks, but there isn't any major issues. If you're new to computers, this probably isn't for you. In the long run, i will probably end up buying a mac, but, on my college budget, I'm content.73/100", "Date": "September 19, 2009"}, {"Title": "excelente articulo", "Author": "Armando", "ReviewID": "R8MVJKYUU3S9S", "Overall": "5.0", "Content": "Excelente articulo, trabaja muy bien y Amazon cumplio con la entrega a tiempo, estoy muy contento con la computadora porque ademas de su atractivo diseño es bastante rapida, tiene buen sonido, y excelente capacidad para procesar los datos de manera muy agil, puedo recomendarla ampliamente.", "Date": "July 31, 2009"}, {"Title": "Wonderful Laptop", "Author": "G. Johnson", "ReviewID": "RU81HDQRQ21CR", "Overall": "4.0", "Content": "My only complaint in my new laptop is that it will randomly (without warning) shut off (go to a black screen). At this time I am trying to trace the problem but have gotten no where. Other than that its a wonderful laptop for what I paid for it. My primary use for it is while I'm deployed to the desert.", "Date": "June 29, 2009"}, {"Title": "Buy A Dell", "Author": "B. Rhynes", "ReviewID": "RMCJ6W0N7NIHQ", "Overall": "1.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3Q6PIBQ859X8UembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3Q6PIBQ859X8Urefresh_preplay() {\n\ndocument.getElementById(\"cv_mo3Q6PIBQ859X8UchiDiv\").innerHTML = document.getElementById(\"cv_mo3Q6PIBQ859X8UhiddenPre\").innerHTML;\n};\ncv_mo3Q6PIBQ859X8Urefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3Q6PIBQ859X8Uso;\t   \n\n\nfunction cv_mo3Q6PIBQ859X8UloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3Q6PIBQ859X8Uso = new SWFObject(swfLocation, \"cv_mo3Q6PIBQ859X8UAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3Q6PIBQ859X8Uso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3Q6PIBQ859X8Uso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3Q6PIBQ859X8Uso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3Q6PIBQ859X8Uso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3Q6PIBQ859X8Uso.setAttribute(\"height\", swfHeight);\n          cv_mo3Q6PIBQ859X8Uso.setAttribute(\"width\", swfWidth);\n          cv_mo3Q6PIBQ859X8Uso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3Q6PIBQ859X8Uso.write(\"cv_mo3Q6PIBQ859X8Uflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3Q6PIBQ859X8U', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3Q6PIBQ859X8U';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3Q6PIBQ859X8U', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3Q6PIBQ859X8UloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3Q6PIBQ859X8U\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"181-7356429-0441039\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1HMFIVMNI2LVZ\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1HMFIVMNI2LVZ\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RMCJ6W0N7NIHQ\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1HMFIVMNI2LVZ/181-7356429-0441039\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/181-7356429-0441039\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3Q6PIBQ859X8Uduration')) {\n      document.getElementById('cv_mo3Q6PIBQ859X8Uduration').style.display='none';\n    }\n    cv_mo3Q6PIBQ859X8UloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3Q6PIBQ859X8UloadSwf(movieID, playerVersion) {\n   return _cv_mo3Q6PIBQ859X8UloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3Q6PIBQ859X8UnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3Q6PIBQ859X8U', 0, h);\n}\n\nfunction cv_mo3Q6PIBQ859X8UresetPlayer(w,h,bw,cc) {\n  cv_mo3Q6PIBQ859X8UnewHeight(h);\n\n  cv_mo3Q6PIBQ859X8Uso.addVariable(\"resetBandwidth\", bw);\n  cv_mo3Q6PIBQ859X8Uso.addVariable(\"cacheCode\", cc);\n  cv_mo3Q6PIBQ859X8Uso.setAttribute(\"height\", h);\n  cv_mo3Q6PIBQ859X8Uso.setAttribute(\"width\", w);\n  cv_mo3Q6PIBQ859X8Uso.write(\"cv_mo3Q6PIBQ859X8Uflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3Q6PIBQ859X8URollOverImg = new Image();\ncv_mo3Q6PIBQ859X8URollOverImg.src = \"http://ecx.images-amazon.com/images/I/81LKsrPaiRS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3Q6PIBQ859X8Upreplay = document.getElementById('cv_mo3Q6PIBQ859X8UpreplayImageId');\nif (cv_mo3Q6PIBQ859X8Upreplay) {\n  cv_mo3Q6PIBQ859X8Upreplay.onmouseover = function() {\n    cv_mo3Q6PIBQ859X8Upreplay.src = \"http://ecx.images-amazon.com/images/I/81LKsrPaiRS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3Q6PIBQ859X8Upreplay.onmouseout = function() {\n    cv_mo3Q6PIBQ859X8Upreplay.src = \"http://ecx.images-amazon.com/images/I/81LKsrPaiRS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3Q6PIBQ859X8Upreplay.parentNode;\n\n  var cv_mo3Q6PIBQ859X8UcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html/ref=cm_ciu_vr_mo3Q6PIBQ859X8U/181-7356429-0441039?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3Q6PIBQ859X8UcurrentClick) {\n      return cv_mo3Q6PIBQ859X8UcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 1:31 MinsBuy a Dell.", "Date": "January 15, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "14.1\" Diagonal WXGA High-Definition HP BrightView Widescreen Display, 1280 x 800 resolution\n2.00 GHz Intel Core 2 Duo Processor T6400 with 2MB L2 Cache\n4096MB DDR2 System Memory, 320GB Hard Drive, Intel Graphics Media Accelerator 4500MHD with up to 1759MB total available graphics memory\nLightScribe SuperMulti 8X DVD±R/RW with Double Layer Support, Wireless LAN 802.11a/b/g/n WLAN\nWindows Vista Home Premium, dims in inches: 13.15\" (L) x 9.45\" (D) x 1.34\" (min H) approx., 5.08 lbs approx", "Name": "HP Pavilion DV4-1280US 14.1-Inch Laptop (2.0 GHz Intel Core 2 Duo T6400 Processor, 4 GB RAM, 320 GB Hard Drive, DVD Drive, Vista Premium)", "ImgURL": "http://ecx.images-amazon.com/images/I/51PC7-FKdiL._SY300_.jpg", "ProductID": "B001O1MKPM"}}