{"Reviews": [{"Title": "Great But Heavy!", "Author": "Rumanea Pich \"Genisis\"", "ReviewID": "R1144O6WAVX5X2", "Overall": "5.0", "Content": "This is a great laptop! I have had mine for about a year now, no problems with anything, the only bad thing is the weight of the laptop and the size of its ac adapter, but that doesn't bother me but might be a hassle to others...besides that great and i would reccomend this.", "Date": "August 4, 2010"}, {"Title": "Heavy weight Champion of gaming laptops!!!!", "Author": "The magic turtle", "ReviewID": "R2XFWWWB6OWLOK", "Overall": "4.0", "Content": "This is a great computer i brought mine back in 09 or something like that, and it still works like a champ. It plays 2011 games on high graphics settings; also i do plan to give it a upgrade at the end of this year so it can last a few more years. The  screen, the sound quality, the durability, and the four usb drives makes this a great computer.One down fall is the mouse pad, i get very upset when my palm hits the pad and the computer registers that as me wanting to fire, or attack. other than that this is a good buy, a fair price for this computer as is would be 200-420. there is a refurbished one for sale, that might be an upgraded version, but if not i would not recommend it.", "Date": "January 19, 2013"}, {"Title": "The laptop was clean and worked as expected.", "Author": "Bill A", "ReviewID": "R5ABIETULOVBG", "Overall": "5.0", "Content": "It was a good value and the unit was very clean. My son has been using it ever since he got it.", "Date": "March 15, 2013"}, {"Title": "all in all good", "Author": "rman1413", "ReviewID": "RG1NMOLO1YLB2", "Overall": "3.0", "Content": "Came broken and the operating system wasnt activated but they were easy problems to fix but great great laptop it even plays skyrim", "Date": "October 25, 2012"}, {"Title": "Dell XPS M1730 Laptop - Sapphire Blue)", "Author": "Raphael Bruckner", "ReviewID": "RVS9WG9M83T3X", "Overall": "5.0", "Content": "AS far as the Laptop is concern it great and works for my needs (Photography) I got two of these;.when compare to other gameing laptops Alienware and such This still holds its own. As far as the Transaction was concern it couldnt have been a worse experience if Amazon added Tammey Fey Baker to the mix along with Gomer Pyle. I first bought this laptop from an Edward Nunn on Feb 4th and it wasn't untill March the 3th that I found out that Mr. Nunn desided not to sell or ship and Amazon themselves didn't know either. So there I was never knowning if I was going to get the laptop for a month.So if Edward Nunn ever desides to sell something on Amazon run far away I just ck my emails Feb 4th to March 6th that how long it took for me to find out I wasn't going to get the product I bought. So I bought one from  Douglas Decker he was a man true to his words and deeds and even when we had a Hic cup  He Douglas Decker went the extra mile and shipped it UPS because the USPS wont ship something with a Lithim Battery in it......I know. So Alls well that ends well but as far as I'm concern these 3rd party trans. I'm done", "Date": "March 30, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001JPJX7Q"}}