{"Reviews": [{"Title": "A good buy", "Author": "Tyler Quint", "ReviewID": "R2AH6LNXSNHRFA", "Overall": "4.0", "Content": "Appart from what the other guy said, this computer is a decent quality unit capable of running a lot of games. The hard drive is plenty big enough to hold your games and music, and with 3gb of ram its quite fast. I admit the graphics card is below todays games like call of duty modern warfare 2, but if you want a computer to run games like world of warcraft, or just surf the web or business then this is a great buy for the price!", "Date": "July 11, 2010"}, {"Title": "very good", "Author": "manvelita bzekalava", "ReviewID": "R1QOWN89K55RV5", "Overall": "5.0", "Content": "very good jsmals salhdsojd;sa askhojkmds;a loihjosad',sd pjsks sadudsa saghisad sakhgdi8asd sahdi9ashda ,dsakhdisaed a.,sd niasdb aldaisdb  i9sayoaskdpasud y9sao'j d'o sdisah doasd", "Date": "April 12, 2013"}, {"Title": "Modern look, reliable and plenty of TOSHIBA features!!", "Author": "gregory p. morris", "ReviewID": "R1YNEKA29GEF14", "Overall": "5.0", "Content": "I purchased this laptop 2 years ago and have had nothing but success in using it for my home business.  I do have the unit connected to my network for excessive periods of time and it has always stood up to the challenge of my small business operations.  Nice modern PC laptop for multiple lifestyle users... thumbs up Toshiba!", "Date": "October 5, 2010"}, {"Title": "RIP OFF!!!", "Author": "Jack Valentino", "ReviewID": "R1DEYHS961M91W", "Overall": "1.0", "Content": "The computer itself is halfway decent. But I've had a number of problems with over the years from a failed cooling unit as well as a bad motherboard. Also, the power cable is an absolute piece of garbage. I've had to replace mine three times in just a few months! If you value your money, look elsewhere for a computer. I'm never buying a Toshiba again.", "Date": "June 8, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Processor: 2 GHz AMD Athlon\nRAM: 3072.00 MB\nRAM Type: DRAM\nHard Drive: 200 GB Serial ATA", "Name": "Toshiba Satellite A305D-S6848 Notebook", "ImgURL": "http://ecx.images-amazon.com/images/I/41YkAcmpoUL._SX300_.jpg", "ProductID": "B001CBTQRO"}}