{"Reviews": [{"Title": "Important things to know about this laptop", "Author": "Geist", "ReviewID": "REJ4SW4GFWU73", "Overall": "4.0", "Content": "1. Bus Speed is 800Mhz. In the laptop world, this would be right between slow and fast. If you a casual user (watch youtube while checking your e-mail and writing a report), this will be sufficient.If you like to do multiple things at once (extended desktop to create dual screen enviroment, move large files to and from external HDs, burn a cd, with video(s) playing and a music production progam running) my recommendation is that you become familar with tweeking your Vista settings or buy a more powerful computer. It's not that it can't handle such lofty requests, it can. It will just be slow/will lock up.2. Comes with 4Gb DDR2 (2x2GB). Now, this will be MORE than enough RAM for almost anyone. But what if you dream big and want to be a desktop in laptop's clothing? It's upgradable to 8GB, which is rare for a laptop. For the most part, 8 Gb laptop RAM (2 x 4GB) doesn't exsist. If you can find it, it will be at least $250+. HP Build a laptop states that a 8GB upgrade would be $400. Why would you need this much ram? I cannot say. This may be useful in the future, I do not know.3. Harddrive speed is 5400RPM. This goes back to how much multi-accessing you do. 7200RPM would be nice, but not necessary.4. Bloatware. I'm not really sure why this is much of a complaint in regards of any computer. Windows/Control Panel has a build in remove software feature that can remove most software completely in a short period of time. I'm sure that some computers come with INSANE programs that are so integrated into Windows, you must have a court order and holy water to remove it from your life. If you don't like the in house program, there is 3rd party softwere (free & pay) out there that claims to do a more through job cleaning out the gunk.5. The Vista experience is rated at 3.8. Just a FYI.6. This really isn't a \"gaming\" PC. It's just not. Spades, No problem. Minesweep until you can't see straight. It's your world baby. Crysis (and if you know what this game is, you know what I'm gonna say next) ain't happpening. BUT, if someone wants to try it on this notebook, please leave a comment on this review and let me know how that goes.7. There is a slot in the PC that holds the mini remote control. On the left side of the laptop. COOOOOOOOOLLLLL! At least I think so.8. Do I like this laptop. I do. It's not the fanciest thing on the market, but for the price, it's good.", "Date": "March 18, 2009"}, {"Title": "Very Very happy with this computer", "Author": "Keshia Marie \"Keshia\"", "ReviewID": "REE54BO5UJ87N", "Overall": "5.0", "Content": "I have only had this for five or so days but i am in love with it already lol.I am a amateur photogrpher and i already have a bunch of photos stored on it, the space on this is great!I have been on about eight or nine different sites (including youtube) at once and they are all as fast as just haveing one open.The web cam is good quality, with great effects. the mic is crystal clear.The lightscribe is great, even though it isnt in color i definitely prefer it over labels.Oh, the only thing i wasnt looking forward to was the fact that the battery only last two hours. But it actually last about 4 hours, and that is with the laptop open and being used for four hours straight.", "Date": "February 2, 2009"}, {"Title": "Best Laptop at the price point, for sure...", "Author": "Bryan P. Wilmoth", "ReviewID": "R8D9WUM3GKZ8C", "Overall": "5.0", "Content": "I shopped around and believe me, this is the best \"Bang for the Buck\" around. I no longer really play games, so the Intel integrated video being the only weak point was no big deal. ***Amazon's Ethernet Specs are Wrong*** This unit does NOT have Gigabit Ethernet, 10/100mb connection only. But everything else is top notch. Core 2 Duo 2.0, Beautiful 16\" 720P HD Screen, Vista 64bit Premium (Do yourself a favor and buy the Upgrade to Ultimate 64bit), 320GB HD, 4GB Ram, eSATA, Bluetooth, USB 2.0, docking port, Wireless N!!!, remote and this is one gorgeous laptop.I added a Gigabit Ethernet Express Card for $50, from Amazon, to make this laptop perfect.This is a case of \"You get MORE than what you pay for...\"", "Date": "March 10, 2009"}, {"Title": "Pretty but....", "Author": "A. Ortega", "ReviewID": "R1Z8IFK98T1WZE", "Overall": "2.0", "Content": "I fell in love with this machine the instant I saw its specs and looks in Amazon... I got it delivered and the first problem I had was that the computer was described as having an internal bluetooth antenna, which after searching how to start it for half and hour and chatting with HP I realized it was not there!  I got a discount from Amazon for this \"mistake\" which seems to happen quite frequently (I had the same problem with a Toshiba Satellite I purchased a while ago).  The 64bit Vista is rather problematic than helpful.  I am considering either upgrading to Ultimate or downgrade to 32bit.  Although its processor is ranked as \"genious\" and it brings 4gb of ram I have runned tests with my old Toshiba running 32 bit Vista with a slower processor and with half the ram and time after time my new HP gets beaten!!!!!!!!!!!!  I experience so many software related problems I cannot feel satisfied a single day about my purchase!  The speakers and volume control give so many problems as well: I place the laptop in \"mute\" and still I get a fraction of a second of the  beep of the instant messenger I use; the speakers are always making this noise like the power was just turned on; the volume control is non-responsive and then when it finally answers my command, it gets stuck both visually and audible.  I still doubt that this machine can be expanded up to 8gb of ram as the specs in Amazon advertise, but I have not checked this yet.  I guess I will get further disappointed... It's a shame that I feel this way for a laptop I found so captivating and (thought) powerful...  Now I bought an xb3000 expansion base (which is advertised as the compatible one for the dv6) and I found myself with the obligation to purchase a new A/C adapter since the laptop AC should work with the base but guess what? the dv6 AC is too big for the base!!! So there you can add $50 extra if you decide to get the whole bunch.  Bottom line: You can get the same performance with a cheaper, more convenient model and save yourself a lot of hassle... Sad but true!", "Date": "April 3, 2009"}, {"Title": "Love This Laptop", "Author": "MrBoxhead42", "ReviewID": "R3LGW1JYFH80ZN", "Overall": "5.0", "Content": "This is my very 1st laptop, and 2nd HP computer. Originally I was looking for another desktop, as I didn't feel I could afford a laptop with decent specs. But I came across this while browsing. The price point was very good and I couldn't believe how loaded it was. Very fast, love the HD briteview wide screen. Loads up in decent time, even with all the bloatware and preinstalled Norton crap. It also has a handy little remote to run HP's media center. All in all I am very pleased with this computer.", "Date": "March 14, 2009"}, {"Title": "Love it!", "Author": "Amazon Customer \"M. Raymick\"", "ReviewID": "R3CTBRHZKZFNIW", "Overall": "5.0", "Content": "I absolutely love this laptop. I've only had it for 2 weeks and when I got it at office depot they had to go out to the truck and get it. They only had 2 and luckily at that exact time only 2 of us were wanting one.  I'd rather it didn't have all the trial programs, but most computers do so it's not a big issue, you can take them off.  My battery lasted about 3 hrs and that was playing a game that takes up alot of resources and still searching out stuff on the web. We watched movies on it while my daughter was in the hospital and it works great.", "Date": "February 8, 2009"}, {"Title": "Love my laptop!", "Author": "anp1913", "ReviewID": "R3OTTP5GPO42I", "Overall": "5.0", "Content": "I have had this laptop for about a month. It is my 3rd HP computer. The first one is still running and has been passed down to my kids. I intended to purchase a desktop but at $599 I could not find one with similar specs for a better price. It is super fast even with several applications running. The numeric keypad is a must and many laptops do not have this feature. I use lightscribe regularly and would miss it if I switched manufacturers. The battery does barely last 2 hours but this is probably due to the larger than average screen. Love it, would buy again.", "Date": "February 15, 2009"}, {"Title": "Good machine but Windows Vista only and REALLY DANGEROUS BIOS upgrade!", "Author": "Eduardo R. Rodrigues", "ReviewID": "R2PXN96CICA5MA", "Overall": "1.0", "Content": "This is a very fine and fully loaded laptop.I already had a previous HP pavillion dv-1030us model at home (which gave me no major problems for the last years) so I decided to stick to it.I still did not have the chance to really use it because as soon as it arrived, I got a HP Health Check window with a list of recommended upgrades that should be applied. Pretty normal and expected since I was turning it on for the very first time, right?Well, the 1st upgrade in the list was a BIOS upgrade, which I obviously downloaded and executed. The only problem was that the new HP Insyde BIOS flash utility for Windows Vista seems to be more of a threat than a utility. It simply popped-up a \"Verify Error\" message and completely frozen Windows and made the fan and HD run like crazy . Even the power button stopped working. The only way I was able to turn it off was by removing the battery. After that, the machine was completely dead! The power button didn't even light-up any of the machine's LED, not even the battery charging indicator.I chatted with HP \"support\" just to know that I'd need to send the laptop for maintenance. So I decided to return it to Amazon for replacement and now I don't intend to apply any BIOS upgrades from HP any time soon.UPDATE: DON'T EVER BUY THIS LAPTOP! IT'S PURE JUNK!I'm updating this review and downgrading this horribly built laptop to 1 star only (I wish there was a 0-star grade).After a few months, after I had already replaced it due to a bricked ROM, this laptop started to literally fall apart. The rubbers on the lid edges started to dissolve, I had to replace the original battery because it did not work anymore, some of the letters on the keyboard buttons became blurry because the black paint started to come off because of sweat, the left button in the touch pad \"sank\" and is not aligned with the right button anymore and most of its chrome-like coating came off as well.On top of all that, this thing is a fingerprint mess (both on the lid outside and on the keyboard and touch pad areas), it heats like hell (I can only use it over one of those laptop-cooler cushions) and its network adapters are rubbish: the Ethernet card, even though I bought it on 2009, is 100Mbps only (no Gigabit support) and its Broadcom wi-fi card is simply horrible!And I considered this laptop an expensive one (for a PC). So, NEVER, EVER, lose your precious money on this junk (not even a penny)!!!", "Date": "June 1, 2009"}, {"Title": "THE BEST OF MANY!", "Author": "Carlos Quesada", "ReviewID": "R241ZTU9YMBQXB", "Overall": "5.0", "Content": "Well, I have to say that this is the best laptop of many, is smooth, fast, everything works awesome, there's bluetooth, camera, control, everything as described, the design is beautiful, and the touch controls are too... is a perfect laptop for college students like me! I just have to say that is the best,", "Date": "April 16, 2009"}, {"Title": "This is one sexy lapdancetop", "Author": "J. R. Mitchell \"Chefy\"", "ReviewID": "R20QI9GTV2HZ8L", "Overall": "5.0", "Content": "Lucked out and actually found this bad boy in stock at off.Depot for [...] after rebates plus got a free HP printer , again after rebate.It's a sharp looking unit and so far runs like a charm. I was leaning towards a Dell but after researching and talking with the geeks i would have had to pay over a grand for similar specs. The screen is awesome and set up to network was cake...chocolate of course:) The 6 cell bat. is typical so i'm not going to rag on it like so many like to do. Deal with it. This is my first laptop and for what you get for the price you can't beat it. if you can find it..buy it....even at [...] its a good deal.", "Date": "January 21, 2009"}, {"Title": "A very nice Laptop", "Author": "M. Zepeda \"EnX\"", "ReviewID": "R3MA2CETX4LW7F", "Overall": "5.0", "Content": "I just received this laptop, and let me tell you, it is a very nice one, I paid an overall amount of 850.00 dollars including S/H and my countries taxes ( I am from Guatemala, Central America). This laptop exceeds my expectations. I have read some reviews saying that the Delete button is not well placed, I think they're wrong, to me it is in the right place (above de Backspace). It looks very elegant, and feels very solid. I dont think I have to describe the specifications(you can go to HP.com and find out), but I must say 2 things (they are not big deal to me but probably for you): It doesnt have the IEEE 1394 port, and doesnt have FingerPrint reader. To me, 5 stars!!!! very happy!! Did I mention that the Logo lights on! pretty cool....", "Date": "February 13, 2009"}, {"Title": "It's great but it has no bluetooth built in !!!", "Author": "Taher Youssef Kubbaj \"Jeepster\"", "ReviewID": "R3OBX06CEKE3W0", "Overall": "5.0", "Content": "This laptop if fully loaded with all the hardware/software that you could possibly find in laptops. Yet in the discription it says (Built-in Bluetooth) but it does not have bluetooth. I took it to HP workshop and they told me it does have Bluetooth. I have no idea why they write such misleading information in the specs.Although I'm thrilled with performance of this laptop. I'm still kinda bumped out !!!", "Date": "March 26, 2009"}, {"Title": "Great deal for the money", "Author": "Tabatha Montgomery \"Tabatha\"", "ReviewID": "RB17L9SBB6B8F", "Overall": "5.0", "Content": "This is a great laptop for the money. I bought it knowing it was larger, not the fastest computer available and that Vista would be different to opperate but to my surprise none of these things have mattered. I use it primarily at home...used it on a plane ride and it was fine carrying in a backpack. The keyboard is nice to type on; easy strokes and not very much noise when you're a fast typer. Vista really is not as bad as many people have made it out to be; only ran into one program I had to upgrade because the older version I owned was not compatible. It runs fast enough for what I need it for and I enjoy the graphics. It has some very nice features to it as well. It has settings to choose your power level so that when you unplug it you can leave it bright or lower depending on the power usage you want to use. The monitor is visable in direct sunlight too. Lots of user friendly functions built in to Vista make using it easy too. I'm very pleased with my purchase of my first HP laptop and received my computer very promptly from J & H Warehouse.", "Date": "July 30, 2009"}, {"Title": "Great home computer", "Author": "J. Milligan", "ReviewID": "R356M445QMMH8J", "Overall": "5.0", "Content": "My family is really enjoying this computer.  It is a great home computer. We use this computer for internet, email, photography, watching movies, word processing, and some database development.  It is a great computer, great speed, and we got exactly what we thought we were getting.  HP made us proud.I would recommend this computer to anyone.  Great price too.", "Date": "May 1, 2009"}, {"Title": "HP Pavilion DV6 - 103OUS 16.0 inch Laptop", "Author": "Julia E. Thompson \"Jet\"", "ReviewID": "R3ARGUWIJW8FMD", "Overall": "5.0", "Content": "Outstanding performance and quality laptop.  The only negative I have is that the keyboard is silver colored and letters on keys slightly difficult to see at an angle.I searched Consumer Report before I bought this laptop and it is truly a quality laptop.", "Date": "June 13, 2009"}, {"Title": "HP Pavilion DV6-1030US", "Author": "Fillmore fan 45 \"kennyreyburn\"", "ReviewID": "R29OWUGIUBLETB", "Overall": "4.0", "Content": "Ordered first computer and had problems right away. Would not make backup discs, and could not configure to acess password protected websites. Amazon replaced with same model computer and it works perfect, no problems. I appreciate Amazon`s promt and couteous handling of this mater,and will continue to be a loyal Amazon.com Customer.", "Date": "May 26, 2009"}, {"Title": "Very poor service", "Author": "Cathy \"Kat\"", "ReviewID": "R2K4DSFNHZIJNI", "Overall": "1.0", "Content": "I sent this product back for repair because 2 of the 3 USB ports did not work.  I was told it was not covered because the \"Mother Board\" was damaged.  I indicated the PC NEVER worked since I got it and I was told they could do nothing.  The unit still had the protective plastic on it and I DID NOT abuse it.  From my perspective their Customer Support is terrible and I would never buy from them again. I bought direct from HP......Just my opnion", "Date": "March 13, 2009"}, {"Title": "Display going bad right after warranty expired", "Author": "Old Systems Guy", "ReviewID": "R1X64CUD5WV2K5", "Overall": "2.0", "Content": "2009-03-10 Update:The resume problem indicated below has been fixed with a BIOS update.  But the low rating remains, since my screen just started flickering with garbage, 20 days after expiration of the warranty.***************************This and many other HP laptops have a flaky bios that won't resume from suspend with Linux distributions like Ubuntu and Fedora.From [...]Recent HP laptops fail disk detection after resuming from suspendProblem descriptionAs of 2009-05-18, many recent HP laptops fail to detect disk after resuming from suspend if the ATA controller is in AHCI mode.The problem has been reported to HP and it seems that HP already released firmware updates which fix the problem on some of the affected machines. libata developer contacted HP but hasn't been successful at getting information to work around the problem. Please read bko#12276 for details.Affected devicesThe problem has been reported on HP Pavilion dv5, DV5t-1000, HDX16t, dv3507, HDX18, dv6-1030us, dv5-1120el, DV4 1050el and dv7. Note that not all reports have been verified and the list may not be complete.SolutionFor the time being, the only solution seems to be staying away from possibly affected machines.", "Date": "May 19, 2009"}, {"Title": "Not very reliable", "Author": "EM1981", "ReviewID": "R20D5DCXD82WN6", "Overall": "3.0", "Content": "I liked my laptop quite a bit at first. Right about when the first year was up, the keyboard started messing up. Then a few weeks later my hard drive failed. Now, the battery is giving me a warning saying it needs to be replaced. The battery never lasted any where near as long as they claim on here. Even new I could only get like 2 hours or so out of it. Of course it all broke right about when the warranty expired. If it had lasted, it would have been a great computer for just surfing the web, email, etc.Update: Now my left mouse key is breaking. It is sinking into the computer. This thing is falling apart.", "Date": "August 27, 2010"}, {"Title": "A very good Laptop ... Vista slows it down a little", "Author": "Boston guy", "ReviewID": "R2QZ3P3K9TSCD3", "Overall": "4.0", "Content": "A very good balance between size, price, computing power, storage capacity, and cost. Still needed to turn off some Vista features to get it faster. Also, battery doesn't last that long.", "Date": "September 2, 2009"}, {"Title": "Laptop to replace oversized desktop", "Author": "C. Trainer", "ReviewID": "R3DBZ118R7EROA", "Overall": "4.0", "Content": "I took about three weeks to make a decision on this laptop. I wanted a laptop with Vista 64 bit, external sata, HDMI, good screen size, 4gb RAM, built in webcam, and styling. I do not play PC games (I prefer consoles) and was on a $650 with rebate budget. I love the chrome and black on this laptop as well as the illuminated HP logo. I have had the computer for 3 days and am very pleased with my purchase. The fan is real quiet too (hope it stays this way). Only negative is that it comes with a lot of extra crap installed, but this is the case with most new laptops. I want to try out Windows 7 and see if this is a better performing OS. I would have given it 5 stars if the graphics card was better. Good stuff!", "Date": "June 6, 2009"}, {"Title": "Smokin'", "Author": "M. Lavallee", "ReviewID": "R3N136XWIKL28R", "Overall": "5.0", "Content": "I have mainly purchased dozens of Dell laptops, wary of any other brand due to warranty issues. I took a chance with HP and I am very impressed with the quality of the display, sound, and durability. I was hoping that the video card would handle GTA4 but it does not, but that's ok, all other programs run smoothly. The touchpad is smooth so it takes a bit of getting used to in order to navigate. Because of the gloss finish, it does collect fingerprints easily, so keep a cloth handy. I wouldn't hesitate to recommend this laptop to any type of user.", "Date": "May 27, 2009"}, {"Title": "Not a bad laptop", "Author": "Kim DeRoche", "ReviewID": "REPGG95V62S66", "Overall": "5.0", "Content": "I purchased this for college at Staples. I haven't had any bad experiences with it and I have had it for about a month. I use it on a wireless network and I can go out side and connect to my desktop inside and to the internet. The only thing is when outside the screen is hard to see but that may be for all laptops. This is my first laptop. I would recomment it.July 2011 - Update: Still running strong but the keys fall off the the keyboard.", "Date": "May 19, 2009"}, {"Title": "FAULTY BIOS UPGRADE, brand new laptop won't turn on", "Author": "Flor", "ReviewID": "R1323A7NGPE7OQ", "Overall": "1.0", "Content": "I've bricked my brand new HP DV6 1030 US only one week after I bought it (dead won't power on). The HP Update tool recommended that I upgrade the BIOS. RIght after I confirmed the upgrade, I got the \"Verify Error\" and Windows frozen, fan running like crazy, HD light blinking like crazy and I couldn't  even turn the computer off. I had to remove the AC adapter and battery to force computer to turn off. The error caused the computer to crash permanently. This is happening now, and HP still has the faulty BIOS update on its website.After hours of chatting and emailing with HP support with HP support I've realized it was a waste of time and decided the best thing to do was to return this defective product and get a refund to buy another computer/brand until this problem is resolved.See this thread for more information at the HP Forums, unfortunately you will find many victims with this exact problem.good luck!", "Date": "July 4, 2009"}, {"Title": "What a horrible product - I've had TWO fail in 10 days!", "Author": "Michael Carver", "ReviewID": "R19OIPAVZGCOEX", "Overall": "1.0", "Content": "Clearly HP is not the same company that they were 10 years ago and this product proves it.  It looks nice and has nice features but I have had TWO quit dead in 10 days.  Amazon is great about this and was very helpful but the product is rubbish.To add insult to injury when I called HP support, the only recourse offered was a 5-6 week turn-around on warranty service or to send it to a repair shop at my expense (ie the warranty is not a real guarantee of relability).  HP will not stand behind their product.DO NOT BUY this computer.", "Date": "July 8, 2009"}, {"Title": "HP Pavillion", "Author": "M. Goerger \"mmg1952\"", "ReviewID": "R3NUCFQIPGM5Z3", "Overall": "4.0", "Content": "The laptop has worked well and is easy to use.  Keyboard responds easily and screen is nice and large.  The Vista OS seems less friendly than XP but is OK. Fingerprints do show up easily on the laptop surfaces but wipe off easily.  A good deal.", "Date": "May 3, 2009"}, {"Title": "Reliable, but has a few issues", "Author": "T. A. Daniel \"Alex\"", "ReviewID": "R39Z7E2NRRJWPL", "Overall": "4.0", "Content": "I have had my DV6 for going on 3 years now.  I won't go into too much detail about the specifications (you can read find them on the product page here), but this laptop has served me well.  Most of my use comes from doing office work (word processing, spreadsheets, simple programming), and this computer handles these tasks nicely.  During these three years, I haven't had any problems with the processor, hard-drive, or screen.There have been a few annoying shortcomings.  The worst is the overheating issue that I constantly have.  If I try to watch an HD movie, this laptop will overheat to the point of shutting itself down.  I think it may be the effect of a faulty fan system (as I've heard other people have this problem as well).  This overheating problem taxes my fans -- often, this computer runs incredibly loudly.  It can be loud enough to be embarrassing if I am using it in a meeting or working alongside other people.  Additionally, the power cable that came with this laptop died after about 10 months of use.  At the time, the HP-Branded adapters were 80$ or so (luckily off brands are much cheaper now), but be prepared to replace your AC power adapter if you make this purchase.I'd recommend this computer to anyone looking for a cheap(ish) laptop to do schoolwork or office work.  Be warned though, gaming or high-definition video will bring this computer to its knees.", "Date": "May 24, 2012"}, {"Title": "Noisy, battery died after 1.5 years", "Author": "Benkei", "ReviewID": "R1C6F8KL62IQAQ", "Overall": "1.0", "Content": "Yes, my Pavilion is a bit older, but the quality seems to be consistently bad with all my HP products in recent years. Fan is real noisy and it has become noisier over time. I hear it even when in the adjacent room with the door closed. It sounds like an airplane.The battery dies after about 1.5 years and they wanted a fortune for a replacement.I sure hope the graphics card won't die as it did on my other HP.HP - never again.", "Date": "March 23, 2012"}, {"Title": "Very reliable. Best screen for the money.", "Author": "Ken", "ReviewID": "R34CP78WBKI8UX", "Overall": "5.0", "Content": "Very reliable. Best screen for the money.I bought this few year ago, and it's still functioning very well.You do not need to spend $1000+ for a Intel i7 laptop. I do not see too much speed difference for this one.It's more than enough for your daily home and office use.", "Date": "July 6, 2011"}, {"Title": "Laptop", "Author": "G. Michel", "ReviewID": "R1755I5PR7IO0S", "Overall": "5.0", "Content": "I purchased one of these for my husband as a Christmas gift.I liked it so much I ordered one for myself!", "Date": "November 11, 2010"}, {"Title": "I need an option for 10 stars", "Author": "Paul D. Masten \"Technologically Impaired\"", "ReviewID": "R3P16KBD1UQRW0", "Overall": "5.0", "Content": "As an offshoot to my day job, I have a lot of people ask me for help in choosing computers and keeping them secure once they've been purchased.My niece needed a computer for school and had a budget of 600$, which slotted in nicely with the refurbished price on this computer.  Of all the computers I have chosen/purchased for people, this was the one I had a hardest time turning over once I was done working it up.The fit and finish is perfect, the functional hardware is very well balanced and works well as a unit. The remote is a neat touch, and I admit that turning the computer on with it was probably a bit more mesmerizing for me than it should have been.In the past I have done a lot of complaining about un-installing random bloatware from HPs, they seem to have more than most computers.  This computer however, in keeping with it's \"gold strike of the year\" status had almost no unwanted or trial programs on it.  It actually took me longer to get all my security stuff worked up (I'm still learning vista/7 security), than it took me to strip the OS down to where I wanted it.Generally I don't like HP computers at all.  They've been troublesome, difficult and poorly executed computers since the first one I had to fix over 10 years ago.  This machine however, almost redeems the brand for me.  All I wanted was functional hardware, and the specs for this were good enough to justify the price and leave me with money for an xp license.  As it shipped, I couldn't find anything-at all-to improve.Knowing what I know about this computer, I'd actually pay full retail for this if I had it to do over.  Perfect 10.", "Date": "August 26, 2010"}, {"Title": "Extremely weak product support! Not recommended", "Author": "Emre Kekec \"Emre KEKEC\"", "ReviewID": "RGUZM10FV8PNX", "Overall": "3.0", "Content": "I am a software engineer who has used a variety of brands. I got a 3 month old DV6t-2000 i7 quad core with 8GB RAM for development purposes. I trusted in HP brand and bought this computer to see that there is absolutely no support. The computers GET issues from time to time, a well performing computer does not necessarily mean that it is a good product.The support department is going to offer you to replace the whole panel and reformat the PC if one of your key-caps(in my case up arrow) gets loose or broken. You will have to leave your PC to service department for at least a month if you have warranty, and if your warranty is over may God help you since your will have to pay several hundred dollars. There is absolutely 0 initiative, and prepare to talk to human robots. I went up to their CEO! and could not get a resolution. Managers are arrogant and chooses to fight with the customer instead of offering solutions.I am an IT expert and strongly suggest advanced and novice users to stay away from HP as far as possible...05/27/2010After sending several emails and hours spent on the phone calls, I could get the support department to resolve the issue. However, they sent a whole keyboard panel. So, it seems, once the warranty period is over, I would have to pay for the panel. It is a powerful computer , yet the support is still weak.", "Date": "May 27, 2010"}, {"Title": "FAULTY ADAPTER", "Author": "Jannelle Warner", "ReviewID": "R134R7XIOXZ3UC", "Overall": "4.0", "Content": "HiI bought my HP Pavillion DV6-1030US on June 3rd 2009, great machine, easy to use, even recommended it to friends who inturn purchased similar machines. to my dismay March 2010 my adapter developed a short and is now completely dead. Is this the standard life span for an adapter? have I been recommending this machine, rating it highly to everyone that has seen it and it's going to disappoint them in less than a year? So now I have a really cool laptop that I cannot power up! maybe someone can advise me as to my next stepJannelle Warner", "Date": "April 12, 2010"}, {"Title": "Good piece of hardware", "Author": "Jorge", "ReviewID": "R3JCS2H269F06I", "Overall": "4.0", "Content": "As title says, very nice piece of hardware, neat, clean, love the chrome-style keyboard. The only issue i found was the preloaded Windows Vista. It's just pathetic (oh, by the way i'm a Network Engineer with over 15 years field experience, so believe me when i say Vista is pathetic). Anyway, first thing i did was re-partition and re-format the hard drive (didn't care about creating rescue discs, didn't need those), i installed Windows XP (had to do my homework searching for drivers, but at HP Forum i found everything i needed, they all work flawlessly) and latest Ubuntu distro, so now i have a dual-boot monster. It's lightning fast, no crapware, doesn't take forever to start or shut down. Can even edit HD videos on it and work with HDR photograpy using Photoshop CS3. It's really a little gorgeous fast monster. So for the hardware i give excellency rating, of course if you first get rid of that pathetic Vista frankenstein.Oh, Amazon's service: Impecable. Thanx a lot guys!!", "Date": "January 29, 2010"}, {"Title": "Great", "Author": "M. Carvalho", "ReviewID": "R2FIVPNKHPJ2QC", "Overall": "5.0", "Content": "The product was new and in good conditions. It hasn't took so long to arrived at my house, what I appreciate. I don't have anything to complain about.", "Date": "December 16, 2009"}, {"Title": "Nice laptop with good features", "Author": "kjhman", "ReviewID": "R25JVGDHJRY1U", "Overall": "4.0", "Content": "I picked this laptop mainly because Amazon did such a wonderful job posting it on their site. It was so detailed and informative, even more so than HP's website. I've been very happy with all of the ports that this computer has. I like the HDMI port. I've used my Netflix online to watch a movie and plug it in to my flat screen LCD. The picture was a little glitchy which might be from my ISP. Not really impressed with Comcast. The wireless range on this computer is fantastic. The screen is very glossy which gives great sharp clear resolution but at times can give a lot of glare also. Programs on this computer are pretty fast to pull up. It does a good job at running 2 programs at once. My Itunes on my old computer would take over 2 minutes to pull up, this one does it in 6 seconds and it's ready to run. I'm not a \"Tech savy\" person so take my review with caution. I use my computer for entertainment, internet, and I use it for keeping records and schedules for work. (construction). Everything that I want it to do it does. The only gripe that I have about it is that it is much slower when on battery power. I changed it's power settings but that didn't seem to help. It just made the screen brighter. My advice is try a display model before you buy. That way you know how it feels, looks, and functions. I tried this computer out at my local [...] and then ordered it threw Amazon. Yes, Amazon was cheaper than even [...]. Thank's again Amazon for your wonderful service, products, and great shipping.", "Date": "September 17, 2009"}, {"Title": "A decent laptop for the price.", "Author": "MY", "ReviewID": "R39RHG9U4NQHN7", "Overall": "4.0", "Content": "I bought it for my mom about 2 weeks ago. I paid like 450. For the price, it is unbeatable. Boot up is even faster than my thinkpad X61 which has higher configurations, maybe just because not much have been installed yet, but still very impressive. The best part about it is the HDMI output. I connect it to a 24 inch monitor without any problem. It can act like a HTPC perfectly. The noise level is also very low. The wirless connection is 300mbps. The LCD is good for watching movies, but I am really not a big fan of the mirror screen.The only thing I don't like is the keyboard configuration. Functional keys like delete, page up, page down etc. are placed awkwardly, and since it has not keyboard backlight, I am always worry about strike the wrong key in a dark room. I recommend to use an external keyboard since I think most users will use it as a desktop replacement. As to the BIOS issue, I haven't update my bios yet, so really cannot comment on that.", "Date": "August 25, 2009"}, {"Title": "DON'T UPDATE THE BIOS!!!!!!!!", "Author": "Neal \"nhopsing\"", "ReviewID": "R1LW4AIXLN9HY7", "Overall": "5.0", "Content": "Absolutely awesome machine, however if you buy this computer you must read the following thread BEFORE trying to run the HP automatic updates.[...]", "Date": "June 25, 2009"}, {"Title": "Disappointment abounds", "Author": "Joseph Grenon Awesome Restorations", "ReviewID": "R34QCQ0TDONZFA", "Overall": "2.0", "Content": "I am not a geek, but have been using computers since 1988, and have become somewhat literate.The specs on this thing looked good. I thought I saw that it had a s-video output and a fire wire port. No s video, and I finally located the fire wire port, I think by going through my collection of old cables until I found one with the right fit for the computer and the external hard drive's fire wire input. Does not seem to be as fast as the USB connector though.There is a remote control to run the tv function, but I have not been able to figure out how to get either to work, and I accidentally stumbled upon the slot to store the remote while i was looking for the slot to install a game card. No slot for the game card, but there is a place for the remote. none of this is illustrated in the internal documentation inside the pc. It might be in the paper manual, but if there was a paper manual in the box, i must have lost it.within a week of purchase, the screen started to flicker. I contacted HP email support and did what they told me. The flickering got better, for a couple of hours, then started up again. I contacted HP again by email, got more instructions, and the problem got worse. In frustration I called HP support and spoke to a female operative who gave me vague and incomplete instructions on resetting the BIOS. After a contentious exchange, she consented to send me a box to return the notebook for service. It will be gone for two weeks. HP continues to assure me that all the problems will be solved, but I am not optimistic. In addition to the screen issue, the Media Smart Resident TV program stopped working.I was also mistyfied why the screen saver would not start up as scheduled in the control panel, only to discover after two weeks and 3 friends that the screen saver cannot work if I have my external mouse plugged in.The Altec Lansing built in speakers are about as crummy as you would expect to find in a laptop.I am stuck with it now I guess.", "Date": "May 12, 2009"}, {"Title": "very easy to set up", "Author": "sandwich shopper", "ReviewID": "R15VKAE5CF5AJZ", "Overall": "5.0", "Content": "I was concerned about being able to set up by myself.  It arrived and within 15 minutes I was  on line.  I have only had the computer a few weeks but I am very satisfied so far.", "Date": "February 28, 2009"}, {"Title": "Avoid HP, worst service and warranty support in existance", "Author": "Jeff S. Connell", "ReviewID": "R2VUP2L4D2S45R", "Overall": "1.0", "Content": "Laptop was received with a broken ethernet port.  HP would not service my laptop due to \"customer related damage\" which it was obviously not.  There is a reason they are dead last in all customer service polls.  God forbid if you need actually service.  Between dealing with people in India, which most barely speak English, and zero warranty support, take your money elsewhere.  HP is the worst service experience I have ever had.", "Date": "August 20, 2009"}, {"Title": "Very nice computer!!", "Author": "Crystal K. Inman \"CK Island Mom\"", "ReviewID": "R3DECFRRNHJ3K3", "Overall": "5.0", "Content": "This computer is much better than my previous laptop! Our family has almost exclusively had HP Pavilion computers! I am very impressed with this laptop! The features on this laptop make it worth the price. The quality makes the price worth it! I almost went with a more expensive computer and different company; but am glad I went with an HP!!", "Date": "February 13, 2009"}, {"Title": "nice laptop", "Author": "Dave", "ReviewID": "R5WEVYYGM9CS7", "Overall": "5.0", "Content": "I had this laptop for about two months now and all I can say is that I love this thing. it's fast, has a nice graphics card, nice size screen, lots of bells & whistles  on it  and nice looking to. Been wanting a large screen  laptop for a while but being  A Mac guy I couldn't afford the $1,800. they want for the 15\" screen and the one I want it  the 17\" screen for $2,700.  that before you add stuff like bigger hard drive more ram  So I check out PC to see what they have to offer  glad I did  look at all of them. Dell, Hp, sony, toshiba, etc, for me I pick the right  one. very please with the hp dv6 1050usP S :  If your thinking of getting this one you may want to take a look at the HP HDX16-1370US  it was almost $1200. when I got the hp dv 1050us now it only $[...] after rebate bigger hard drive better graphics card and all the bells & whistles ?", "Date": "August 3, 2009"}, {"Title": "Awesome laptop", "Author": "B. Slaughter", "ReviewID": "R8DBC8IB1J6XR", "Overall": "5.0", "Content": "I read tons of reviews for laptops.  I spent a couple weeks doing research.  Over and over I kept coming back to this one.  It has been a month since it arrived on my doorstep and it has been wonderful.  Set up was a breeze.  There have been no issues with vista or connecting to other devices.Speed and memory are great.  I'm very pleased with the purchase and consider it well worth the money.I downloaded Microsoft 2007 and the entire Adobe Web Premium program.  I deal primarily with photos and videos.  Nothing slows it down.", "Date": "July 14, 2009"}, {"Title": "Laptop", "Author": "J. Robnolt \"retchap\"", "ReviewID": "RR5IMT69IK6YP", "Overall": "5.0", "Content": "This is an over-the-top good machine. It was up and working right out of the box.  There are more bells and whistles on this machine and is comparable to my desktop.  HP has a fine product here.", "Date": "July 4, 2009"}, {"Title": "HP Garbage.", "Author": "Deimos \".\"", "ReviewID": "R5UPBT56MWI4Q", "Overall": "1.0", "Content": "HP laptops are the purest form of tech garbage there is on planet earth.  When you combine with Compaq which is even worse, horrible results follow.  I can only strongly recommend that anyone looking for a laptop stay away from Compaq, HP and HP-Compaq machines.  My gf received this laptop two years ago to the day and it's totally dead right now.  Over the last 6 months it began developing a lot of problems.  The computer was never fast, always took forever to load up, had horrible internet service/wireless service and never seemed to measure up to what the specs were capable of.  Well The first problem we encountered was the laptop would start up with crazy checkered colours all over the screen and need several restarts to get going.  This was only 1/1/2 years into owning this junk.  Second about a month later the wireless card which was never impressive to begin with totally failed, so I had to buy a usb wireless adapter just to get it to work because it would be quicker than sending it to HP  for god knows how long.  The performance since the laptop was bought seemed to degrade rapidly until it was a pain in the neck to even use altogether.  A month or so after the wireless card failed the checkered colours started acting up again and upon restart the hard drive completely failed and will not boot up, the system powers on but cannot boot up the hard drive, it tries but it sounds like a car stalling out.  So in a nutshell this laptop barely lasted two years and was nearly unusable a year or so in.  I have never seen a HP yet that I was impressed with and now thank god my gf is turned from them as well.  I owned a Compaq laptop several years ago and an ACER with similar issues, so as stated I would strongly recommend looking at other brands and stay away from this poor quality, cheap unreliable hardware, over priced sham of a computer company know as HP-Compaq.", "Date": "June 12, 2009"}, {"Title": "Staples has this price beat until 6/7/09", "Author": "Canny Scotsman \"Richard\"", "ReviewID": "R1EBV9X2MHMOBP", "Overall": "4.0", "Content": "I was looking at this machine today, and it is on sale at Staples for $599 after rebate and instant savings.  I am strongly considering it, seems to be at a good price/performance point.Just thought I'd mention it in case anyone else is ready to pull the trigger. Amazon is a decent discounter, but is not always the lowest price.", "Date": "June 3, 2009"}, {"Title": "Bad operation system (Windows Vista)", "Author": "Kadao", "ReviewID": "R2RF155V9XHLY2", "Overall": "3.0", "Content": "As a customer which both this notebook, I deserve an Operation system upgrade from AltaVista to Windows 7 for free because the actual notebook performance is a shame. I am very upset with the performace.HP Pavilion DV6-1030US 16.0-Inch Laptop", "Date": "May 2, 2011"}, {"Title": "HP = Highly-bad Performance", "Author": "L. Rodrigues", "ReviewID": "R3VSGB6R1GFVUD", "Overall": "1.0", "Content": "Pavilion dv6-1030us running with Windows-7.This laptop is wireless connected to a HP printer Officejet 7410 All-in-One. I installed the latest driver from the HP net. The 1st print job after booting the PC gives always blank pages; on the 2nd and further trials it prints normal. Some Memorex CD-RW disks read ok and some are rejected. I tried exactly the same items, under the same circumstances, on a new Dell laptop and on an old Dell computer. None of these problems happened. Very disappointed with HP performance!!!", "Date": "March 27, 2011"}, {"Title": "HP's poor products and servies", "Author": "Susan", "ReviewID": "R3QORHH9GON22I", "Overall": "1.0", "Content": "Poor design, poor quality, poor services.Even the high end laptop broke right after the warranty.The services guys are all laughing at you too!", "Date": "March 31, 2010"}, {"Title": "Works well. Able to double boot Ubuntu.", "Author": "F. Klein", "ReviewID": "R3P3DBU0TIZTGK", "Overall": "5.0", "Content": "I bought this for my daughter graduating college (and going on to grad school). It works well. Vista sucks, but we knew that going in. It can double boot Ubuntu from [...], if you are willing to put in some time and get the sound to work (I did). No problems. Arrived on time in great shape.", "Date": "July 19, 2009"}, {"Title": "Good features but still not impressed with performance", "Author": "M. Salas", "ReviewID": "R167KO2PH00L6Q", "Overall": "3.0", "Content": "I bought this laptop for my son going to college. Due to the impressive features: 4gb hd, good core 2 duo,etc, I was expecting a very fast response from the laptop. However, I have to admit that sometimes, especially when running 2 apps (IE and itunes for example) at the same time,it gets a little slow. Also the sound, is kind of weak comparing to another DELL older laptop that we use for the family.I am kind of certain that this laptop falls into the category of those units that come preloaded with all the junk that the manufacturer thinks you will need. Like on-line games, some hp media center/player, hp advisor, trail versions of antivirus, ms office, aol and more. I am tempted to format the hd and reinstall the os and only the things we need. I have done this on an older laptop and it runs faster than this new one. I have tried to get make the recovery DVDs but it fails almost at the end of creating the first one. I have tried three times with DVD+R, DVD-R and it failed with both types of media. The laptop came with all the recovery files on a separate section of the hard drive, but how about if the hard drive dies in a middle of a power outage?  I guess I will have to contact HP. Anyone outhere with the same issue?We got the laptop in June, and besides all the above it has been running okay.I know that if the hard drive gets formated and only the necessary gets reinstalled, this unit will be much faster and responsive, common, a laptop or desktop with 4gb of ram should be very fast and responsive. And I am not talking about running heavy games or AUTO CAD or anything of that nature, I am just talking simple web browsing, word processing, video and music playing.I will appreciate if someone can share a solution to make these recovery discs. Once I got the discs, I will venture to re groove this baby and I will be adding stars to this review.Thanks", "Date": "July 13, 2009"}, {"Title": "Love this HP Laptop!!!", "Author": "Snoopy09", "ReviewID": "R1C9LEEMUH51ZI", "Overall": "5.0", "Content": "MY daughter wanted a nice computer but couldn't afford a Mac with everything she wanted on the computer this is a wonderful laptop she loves it and this is the best 700.00 she has spent and comes with built in web cam and lots of memory just wonderful for her she loves this and is built well it is not cheap some say heavy, we say well built you will like this one if you get it.  The HP Pavilion DV6-1030US 16.0 inch laptop is a winner!!!!!", "Date": "July 3, 2009"}, {"Title": "HP Pavilion dv6t", "Author": "Ramesh K. Karthikeyan", "ReviewID": "R1901U2T835Q2X", "Overall": "5.0", "Content": "The product is really worth buying. Very good configuration and stylish. The only drawback is the touchpad is not so smooth. If u get practiced it will be OK. Other than that it is a very good laptop.", "Date": "March 1, 2009"}, {"Title": "Excellent Laptop", "Author": "Leon R. Ellis \"HP Happiness\"", "ReviewID": "RC3V3J4JXHP1S", "Overall": "5.0", "Content": "Everything I throw at this laptop it handles. Only thing I dont suggest (which doesnt have to do with this laptop directly) is not using bitdefender on it. Been in constant back and forth with them since I brought this machine. Other then that completely satisfied. Love how sleek this laptop looks. And HP programs are very usefull", "Date": "May 2, 2009"}, {"Title": "I would give it a zero if possible.", "Author": "Kris", "ReviewID": "RZPS0DRG2PELR", "Overall": "1.0", "Content": "WHAT A LETDOWN!!!! I had it up and running for TWO days and the motherboard has failed. No reason for this, I have AVG as a security program, and have run that in my desktop for three years without a problem. Let me tell you about their Customer Service. Rude, not at all helpful, and spent almost the enitre conversation telling me what the COULD NOT do.DO NOT BUY this product. I saw the negative review and chose to go with HP's solid rep. Well, it isn't the company it used to be, they are a real disaapointment. Now, I get to ship it all the way across the country for them to repair my BRAND NEW computer. This totally disgusted me and I will tell everyone I know to no longer support HP. They have gone the way of all of the other \"big\" companies, turning out junk and getting top dollar for it, and not supporting their product well. A BIG ZERO!", "Date": "February 14, 2009"}, {"Title": "It is great", "Author": "Emmanuel Nzekwe \"Emmaneul Nzekwe\"", "ReviewID": "R1P9VZXA90SZ90", "Overall": "5.0", "Content": "When I look at it is Fantastic and when I have my job i`ll buy it", "Date": "August 2, 2009"}, {"Title": "HP DV6-1030US Lap Top", "Author": "Wayne B. Getchel", "ReviewID": "R2K66PLKUON700", "Overall": "5.0", "Content": "I purchase this item as a Graduation Present for my Granddaughter who will be using it this fall in College. I have not turned on the maching as I am leaving it for my Granddaughter to set it up for her use. The Item was shipped promptly and very well packed. Because it required a signature for receipt I was called a couple of days prior to delivery to ensure that someone would be available to sign for the shipment. Everything worked out great and I am satisfied with the product.", "Date": "May 11, 2009"}, {"Title": "Nice and light!", "Author": "Amazon Customer \"Karen\"", "ReviewID": "R27TBVH0L2VB7Q", "Overall": "5.0", "Content": "This is my second laptop purchase, the first one was very heavy so along with all the other requirements I was looking for weight was a major concern for me.I've had this laptop for about a month and I just love it. [...]", "Date": "May 7, 2009"}, {"Title": "New Notebook", "Author": "Nadene L. Whitney", "ReviewID": "R2TL43VCBDFP95", "Overall": "5.0", "Content": "I am extremely pleased with my purchase.  It seems to be everything I expected and perhaps more.", "Date": "May 1, 2009"}, {"Title": "Hp not too bad", "Author": "Draco Lore \"the biologist\"", "ReviewID": "R26RJT2OZGSCSZ", "Overall": "4.0", "Content": "This is a pretty nice computer, but the 60 day free trial of Norton didn't work the second day I had it. I would get rid of it and put in a new anti viral program, but unfortunately my computer  tells me not to or it will crash the system. Yeah for me. This one is nicer than my Dell though because after having my Dell for less than one year the mother board crashed and had to be replaced. Overall, I guess I will see what happens.", "Date": "April 29, 2009"}, {"Title": "nice", "Author": "P. Suthar \"bla\"", "ReviewID": "RUWWSN34GVE87", "Overall": "4.0", "Content": "I bought this laptop for my father because he didn't trust his old windows 98 computer for his tax stuff. Seeing that this laptop has pretty nice specs and great price i bought it for him. He did his taxes and stuff then he gave it to me, but i refused because i already have very powerfull computer myself at home. My mother ended up taking it and using it to do the internet and word processing.", "Date": "June 25, 2009"}, {"Title": "Client Purchase", "Author": "Roxroy", "ReviewID": "R3KGZQLPUWQ7XP", "Overall": "5.0", "Content": "This is the first computer owned bye the client, and they are loving it and the feature. Great product and the service was great.", "Date": "May 5, 2009"}, {"Title": "Exellent!!!", "Author": "Manuel Compres", "ReviewID": "R5NYVYWDD4CBM", "Overall": "5.0", "Content": "So far so good is a very nice product, fast and has lot of nice programs from HP, will recommend this product.", "Date": "March 23, 2009"}, {"Title": "Junk-Do not buy", "Author": "J. Janzen", "ReviewID": "R2WKV1V5EU4GWV", "Overall": "1.0", "Content": "Piece of junk.  This is supposed to be an \"entertainment\" PC, so you would think it can play DVD's easily.  Mine did not.  Every time I put a DVD in the drive, it sonn ejected the disk and asked me to put a DVD in the drive.  Turns out that the HP DVD software was fighting with Media Player, so I had to uninstall the HP DVD software.  Don't they test this stuff at all?  Also the speaker volume is so low that it is esentially useless, and the quality of the sound that does come out is very bad.  Also has Windows Vista which I had no prior experience with, but now I know why everyone hates it.  Battery life is terrible-less than 1 hour.  The HP remote control that came with the system is a flimsy piece of crap that doesn't always work.  Screen has a lot of glare and is hard to see unless the romm is darkened.  This computer also runs very very slowly.  Overall, a huge piece of junk and I am very disappointed.", "Date": "June 4, 2009"}, {"Title": "my first laptop I bought", "Author": "Wajeeh Sami Abudaood \"wajeeh\"", "ReviewID": "RMG6I9D2WWK2O", "Overall": "4.0", "Content": "it's very good laptop everyting I wanted in a laptop I found it in this one. I can play games , and work on it with high speed", "Date": "March 3, 2009"}, {"Title": "I can't work on it. I can't play on it. What good is it?", "Author": "Joshua Jones", "ReviewID": "REWLS265LP5MH", "Overall": "1.0", "Content": "This machine's specs sounded excellent, so I made the (somewhat foolish) assumption that this highly-rated model would suit my needs. WRONG. I've owned this thing less than a day and it's already going back to Amazon! The integrated graphics chipset runs into serious 3d rendering errors with Matlab. It barely runs World of Warcraft -- a 4.5-year-old game. This machine might be OK if a user never needed video performance, but the graphics chipset is a botched abortion that renders it useless. Your options are to wait for Windows 7 (and hopefully better video drivers); install Linux and spend a few weeks reconfiguring it; or just request an RMA number. 3 guesses which one I chose.", "Date": "April 11, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core 2 Duo Processor 2GHz\n4GB DDR2 RAM\n320GB 5400RPM Hard Drive\n16.0 Inch Screen, GMA\nMicrosofft Windows Vista Home Premium (64-bit)", "Name": "HP Pavilion DV6-1030US 16.0-Inch Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/51HwjovHqbL._SY300_.jpg", "ProductID": "B001NPDKW6"}}