{"Reviews": [{"Title": "Great laptop...no issues.", "Author": "C. Hughes", "ReviewID": "R20HV4IIGM648Z", "Overall": "5.0", "Content": "We purchased this laptop in 2006 or 2007 when we had dial up and now we still have it and use it as our family's primary computer.  Don't get me wrong, we are ready for an upgrade but this computer really lasted us well.  We have teenagers and no one is gentle with it.  Although I know people complain about Vista, we haven't had any issues with it.  You can burn CD's, edit pictures, watch movies, connect it to the TV, all basic things with no issues.  Definitely a worthy investment.  We did upgrade the memory when we bought it though since it didn't come with much...super easy to install though.", "Date": "November 15, 2010"}, {"Title": "Great Computer!!", "Author": "Lauren Rabich", "ReviewID": "R8TVXLBIX9K3Z", "Overall": "5.0", "Content": "I've owned my Acer Aspire 3680 for three years and I love it!! I've never had any problems whatsoever with any part of it. I'm not a gamer, but I am into Graphic Design. I don't know how well it performs with games, but it has absolutely no problem running any of my Adobe Creative Suite programs which several of my friends complain about taking a while to load on their laptops. I don't use it too much anymore just because I got an Acer Aspire Netbook because it is easier to carry with me to school and traveling. I recommend this computer and all Acer computers to anyone and everyone!!", "Date": "September 16, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Acer Aspire 3680-2682 Celeron M 1.86 GHz 14.1-inch Widescreen Notebook General Features:\nMicrosoft Vista Home Basic pre-installed w/COA Intel Celeron M Processor 440 1.86 GHz CPU Speed\n512 MB DDR2 RAM (upgradeable to 2 GB) 80 GB hard drive CD-RW/DVD-ROM combo drive No floppy drive\nIntel Graphics Media Accelerator 950 integrated video Integrated audio with built-in speakers\n802.11b/g Wireless LAN", "Name": "Acer Aspire Celeron M 1.86GHz 512MB 80GB CDRW/DVD 14-Inch Vista", "ImgURL": "http://ecx.images-amazon.com/images/I/41TumCjxgIL.jpg", "ProductID": "B0012XYWDA"}}