{"Reviews": [{"Title": "Excellent", "Author": "Edubya in Texas", "ReviewID": "R2P3GU1Z24I916", "Overall": "5.0", "Content": "First, a little background. Aside from a TI-99 we had when I was a kid and the Apple IIc computers at my middle school, I've always been a Windows guy. I feel very comfortable in the Windows environment and have been building my own PCs for about 15 years. I don't hate Microsoft. But when the need for another laptop became clear, I decided to focus my search on the higher end machines. I wanted good horsepower, but I especially wanted a nicer form factor than the creaky Dells I had become accustomed to. As I had fallen in love with the interface on my iPhone, I decided it was time to give MacBooks a try. I kept my Windows desktop in case I ran into compatibility problems.The short version of that story is that I quickly dismantled my PC and now use this laptop as my only machine. I am fortunate to be able to do so because my work as an attorney requires only Word, Excel, and an internet browser. As a bonus, my copy of Lightroom 3 also installed on the MacBook. I'm trying not to sound like a Mac zealot, so let's have a list:-Aluminum unibody is no marketing gimmick. It's sturdy and feels great with no flex and no creaking. Looks nice, too.-Keyboard is well-engineered. The key travel and spacing between keys feel just right for my taste. There is no flex here, either, which I often find disconcerting on other laptops.-Trackpad is a marvel. It really is. It's very large, but I've yet to feel like it's in the way. And the finger movements are intuitive and work very well.-The screen is bright, clear and has great color. The reflectivity is sometimes an issue in bright locations, but I find tilting it a little solves most problems. Otherwise, you can custom order the anti-glare screen direct from Apple.-The lid closes with a magnet, so there's nothing to break.-It is very fast. In my experience, Mac OS X starts up and shuts down far faster than a comparably spec'ed Windows machine. I have yet to feel a need for 8 GB of RAM, but an upgrade would only cost $90 if you know how to do it yourself. Otherwise, I have no issues running lots of standard programs at once.-Comes with Time Machine. As an attorney and amateur photographer, I have lots of stuff that needs to be backed up regularly and reliably. Time Machine works so well and so seamlessly that I can't imagine how I survived before.-Spotlight is brilliant. Type in any word, and Spotlight almost instantly gives you results from your entire hard drive, including INSIDE your searchable documents, preferences, web results, and even definitions of words.-Seven hours of battery life is very possible, even on wireless. I can sit in Starbucks for hours unplugged and still have plenty of life left. The caveat is that you really can only surf and use programs like Word. I also have Flash installed, which is a huge battery drainer, so I grabbed a Flash-blocking program that let's me choose which Flash files to activate. Nice solution.-HD webcam. Nice quality, though I haven't really done more than messed around with it.-The magnetic power cable is slick.-As a former Windows user, I find the Mac OS X interface to be really nice and intuitive. There's obviously a learning curve, though I've found it be surprisingly short. Lion is anticipated to be a nice upgrade, too.-PRICE! Well, a lot of people complain about the Apple premium, and it definitely exists. I found this laptop to be a few hundred dollars higher than the really nice Windows laptops with mostly similar specs, although I don't think comparing raw horsepower between two different operating systems is always an accurate benchmark. I live on my computer, so I'm willing to pay a little more to get what I want. It's like buying a BMW because you have to spend three or four hours a day in your car. Whether that value equation works for you or not is up to you and your checkbook.-Anything I dislike? Not really. I'd like maybe one more USB port and a CF card reader. I'd love to start seeing cheaper SSDs in these things, but that's really not Apple's fault. Decent SSDs with any size are still expensive for everyone. I was a little nervous about having a 5400 RPM HDD. I think transferring large NEF files from the card reader might be fractionally slower. The tradeoff in battery life is probably worth it. Will Thunderbolt be worth it? Who knows? I don't care just yet, but ask me next year.I know there's more to say, but I'm running out of steam. I'm happy to discuss anything in the comments.", "Date": "March 8, 2011"}, {"Title": "Notebook New Era - Quad Core Processors", "Author": "Steve H \"books911\"", "ReviewID": "R1S5F35CLT2BVW", "Overall": "4.0", "Content": "The update to the 15-inch MacBook Pro in February 2011 was significant. Indeed, significant may be an understatement when it comes to the increase of processor performance offered by the updated machines. Quick thanks to Amazon and Apple Stores for having these immediately available at launch.The primary upgrade to this revision? The processor! Intel has a brand new architecture called Sandy Bridge, and these MacBook Pros are the first Macs to feature this technology. Some have called it some of the most significant changes to Intel architecture since Pentium 4 was introduced. These 15-inch MacBook Pros as well as its big brother, the 17-inch, not only take advantage of Sandy Bridge, but the Quad Core i7 Variant. Quad Core processor in a notebook Mac! Wow.I actually chose the 13-inch model for my personal use (only Dual Core on the 13-inch), but a 15-inch is replacing an aging iMac at the office to save space and leap over its performance. These Quad Core Chips are amazing. Early benchmarks are showing this entry-level 15-inch, 50 percent faster than the upper end i7 15-inch MacBook pro from a year ago. A dramatic improvement. This higher end model is even better.  Furthermore, if you're still on a Core 2 Duo machine such as the iMac I am replacing, the performance is as much as 2.5 times faster and 3x faster with this higher end model. At least in terms of the processor. This is most beneficial in processor intensive applications, for consumers such applications are iMovie and Garageband. Professionals will see the new processors beneficial in any professional photo editing, video, or music work.This model also includes a fantastic dedicated graphics card with 1GB of graphics memory.  1GB of graphics memory is a a first for Mac notebooks.One downside is that due to cost, the machine still comes with a spinning hard drive standard. In this case, the standard drive is a 5400 RPM 750 GB drive. That offers plenty of storage, but is slightly slower than a desktop 7200RPM drive and much slower than a new, solid state drive. You do have options. You can special order the machine from Apple with a 7200RPM drive, or Solid State Drive. However, what I have decided to do, is simply, when I'm ready, swap out the drive myself. Other World Computing sells solid state drives compatible. It might not be easy for every user, but for those with some computer experience, it is a fairly easy swap. Then I can install a faster solid state drive, when the more acceptable capacity drives come down a bit in price. You might also choose to do the swap yourself because you can then put the hard drive that was originally in the machine, into an external enclosure, and use it as an external drive for backup. Of course, any damage you cause to the machine would not be covered under warranty. Therefore, if you have any concern, you might want to see if you can special order from Apple online, or in many situations, you will find the standard hard drive to be acceptable.After the processor advancement, Thunderbolt is the other great new technology included in this revision to the MacBook Pro. Thunderbolt looks like the Mini Displayport that was already included on the MacBook Pros. Indeed, it will still function perfectly as a Mini Displayport, for connecting an external display. However, Thunderbolt is more importantly a new interface to connect external devices in the future, such as, external hard drives, HD camcorders, and perhaps even iPads, iPods, or iPhones someday. Data would then transfer many times faster to and from these devices than it does currently. These devices were not available at the time of the MacBook Pro's launch, but we have already heard that external drives should be available later this year with Thunderbolt connectivity.iSight camera has been upgraded to HD resolution and Face Time pre-installed on the computer. This gives you the ability to video chat, easily, with other Macs and notably, iPhone 4s and the newest iPod Touch with front facing camera.The consumer software you expect to be included by Apple is once again here. The latest version of Mac OS X Snow Leopard (operating system), iLIfe 11 including iPhoto, Garageband, iMovie, iDVD, and iWeb is all here. OS X always includes Safari web browser, iTunes, and Mail applications too. The average user would be good to go out of the box. You might pick up Microsoft Office for your office document needs, or simply purchase Apple's iWork applications (Pages, Numbers, and Keynote) from new Mac App Store on your computer.The new MacBooK Pros, thanks to Sandy Bridge technology are fast. They will save you time, when using processor intensive applications. Time in business, saves people money and frustration. The average consumer might see less gains with this update as physically the MacBook Pro has retained it identical appearance, size, and weight. Nevertheless, under the unibody, improvements have certainly occurred which result in a much faster notebook. The fact that these 15-inch and 17-inch models now include Quad Core Processors standard is really extraordinary. This is putting recent top of the line desktop performance, into a sleek and attractive Mac Notebook. A breakthrough. Recommended Product!", "Date": "February 27, 2011"}, {"Title": "Simply the Best!", "Author": "Robert Green", "ReviewID": "R3ME90MJ0MLBFA", "Overall": "5.0", "Content": "Apple MacBook Pro MC723LL/A 15.4-Inch LaptopI have spent months reviewing different laptops. I've gone through at least 10 laptops in the last year looking for that one laptop that I will be pleased with and keep for more than a year or two. I've had Acer, HP, Compaq, Asus, Sony, Toshiba, and others. Sony was the only laptop that didn't go FUBAR within a year or so.So, I thought I would give Apple a shot and I was not disappointed. I first tried out a 17\" dual core that was super but the resolution was just too small for my eyes and I returned it. But I was so impressed with the quality of the case, the screen (albeit the resolution too small for my eyes), the quality of the innards (no cheap stuff under this hood), the quality of the power cord, the very fast 800 firewire, the backlight keyboard, the ease of typing on the keyboard, and the mouse pad. The mouse pad on this laptop was the first one I have not had to disable while typing. I have no idea why we have been stuck with those stupid PC mouse pads for so long when the solution was so easy! On the Apple laptop you push the pad down instead of tapping it. This means the cursor does not move to some abstract place and you find yourself typing three pages back!But, then Intel released their new Sandy chips. I figured that Apple would not use these chips for some time so I started looking at PCs again just for the new chip. I couldn't bring myself to buy a PC after owning a Apple. Fortunately Apple did release these new Macbook Pros with Intel's new chip with increased graphic memory and the new Thunderbolt. Plus Apple increased the speed of the memory.I just could not help myself and I purchased this MBP 15\" with the 2.2 i7 Sandy Bridge with the 1G memory. I am very glad I did. This laptop is fast. Its unibody case makes this the most solid and durable laptop on the market. The innards are easy to access to upgrade memory and the hard drive. Everything inside this machine is neatly arranged and is of top quality. The battery is rated for seven hours which is pretty accurate. The Mac OS is written to take advantage of the quad core chip, memory, etc. The LED screen is crisp and clear, and with the regular 1440X900 resolution I can easily use this laptop without any eyestrain.I only have one puzzling complaint about this new laptop. Why in the world would a company build one of the fastest top quality laptops in the world and stick a hard drive spinning at 5400 RPM? Yes it is a 750 gigabyte drive, which few people including myself could never fill. But running at 5400 RPM? I just cannot understand this.You can order the drive spinning at 7200 RPM or opt for a SSD on the Apple online store. The strange thing is that the 7200 RPM drive is the same price as the drive spinning at 5400 RPM. But that is not the point. Yes, most people will never notice the speed difference between a 5400 RPM and a 7200 RPM drive unless you are doing some pretty intensive media editing or are a avid game player. The point is why build a top of the line laptop and stick in a old busted down 5400 RPM hard drive like an afterthought. I fixed this discrepancy by installing a new Intel 160G SSD (solid state drive).I have been using laptops since 1991 when they made great paperweights when they died. This is the best laptop I have ever owned. Do yourself a favor and try one. Even if you don't like it you can always return it. I don't think you will, but you do have that option.", "Date": "March 3, 2011"}, {"Title": "true desktop power, high-res screen, great battery life", "Author": "Paul Christensen \"gadget geek\"", "ReviewID": "R1LVR5FZLRZCCV", "Overall": "5.0", "Content": "I've been a power Mac user since its introduction in 1984, and have owned various portable and desktop configurations since then. Frequently, you will see major leaps in desktop performance, but it is rare to see dramatic improvements with laptops (you typically see 25-50% improvements). But I have to say, in all the Mac laptops I've owned since my very first PowerBook G4, this is the most dramatic leap in performance I've ever seen. Not only is it 2.8x FASTER than my mid-2009 2.66GHz Core2-Duo 15\" MacBook Pro, it is slightly faster than my 2008 2.8GHz dual-quad-core MacPro!I bought my 2011 MacBook Pro (2.3GHz quad-core i7, 15\" high-res screen) as an upgrade from my mid-2009 15\" unibody MacBook Pro.  I wasn't expecting to be LITERALLY blown away by the raw computing and graphics performance of this update. I have run every standard benchmark suite in comparison not only with my 2009 MBPro, but also against my 2008 dual 2.8GHz quad-core Intel Xeon \"Harpertown\" MacPro. And to my surprise, this little wonder beats BOTH machines in CPU and graphics performance. Imagine carrying a laptop with true desktop power. My real-world tests (iMovie, Aperture, Photoshop and Nikon Capture NX) simply validate the benchmark results.Here's what my tests reveal:- Geekbench: 10450 (vs. 3722 for 2009 MBPro vs. 9533 for 2008 MacPro)- Cinebench 11 CPU: 5.56 (vs. 1.53 for 2009 MBPro vs. 5.76 for 2008 MacPro)- Cinebench 11 GPU: 36.38 (vs. 13.77 for 2009 MBPro/nVidia vs. 26.51 for 2008 MacPro/ATI 5770)Now THAT is impressive!Even though the Intel \"SandyBridge\" core i7 processor in this Mac is advertised as quad-core, each core supports 2 simultaneous threads (8 operations), which you can literally see when running Cinebench. If your computing needs don't support multiple cores, the i7 can bump the speed of a single core up to 3.4GHz (TurboBoost) as well.To truly match/replace your desktop environment, you'll need to replace the built-in hard drive with an SSD, because 2.5\" hard disks, even in 7200rpm configurations, are much slower than their 3.5\" desktop counterparts. I bought my SSD through OWC, and I'm seeing anywhere from 3-40x(!) faster performance for I/O intensive operations such as booting, working with VMWare/Parallels virtual machines, and processing large files (images, video, etc). It is simply the best investment you can make, if you can afford it.Beyond the raw power, there are a number of incremental improvements over the 2009 model:- integrated Intel 3000 graphics, and ATI Radeon 6750M (dedicated graphics with 1GB VRAM)- 1.33GHz memory backplane, supporting up to 16GB of RAM through third-party modules- new Thunderbolt interface using the Mini DisplayPort connector (super-fast 10Gbps interconnect for up to 6 devices, although no Thunderbolt devices are available yet)- Mini DisplayPort supports digital audio and video on a single cable (including HDMI with suitable third-party adapters)- higher-resolution FaceTime camera- SD slot now supports SDXC- updated optical drive (ingest mechanism is less finicky for me)- better battery lifeThe high-resolution screen in this model REALLY makes a difference over the standard screen (which I had on my 2009 model). The 1680x1050 resolution is the same as my older 21\" Apple Cinema Display. I was afraid the higher resolution would make it harder to read (the text is smaller), but the brightness and wide-angle visibility makes this one of the best displays you can get in a laptop form factor. If you work in heavily-lit or outdoor environments, you might want to consider the anti-glare (matte) screen which is available in Apple's build-to-order configurations. Both dual and mirrored display configurations are possible - simultaneously supporting full native resolution on the built-in display and up to 2560 by 1600 pixels on an external display, both at millions of color. Interestingly, in my configuration, I was only able to get an external HDMI display to operate on the high-performance discrete GPU only.Another pleasant surprise for me was the battery life of this new 2011 model. Even with all that processing power, I'm consistently getting 6-7 hours of usable life (lightweight not heavy work). One big tip for saving battery life is to install the freeware gfxCardStatus utility, which lets you choose integrated only (much lower power), automatic, or discrete/ATI graphics. Apple's own Energy Saver system preference only lets you choose between automatic or discrete. And when you're running on the battery, this can be problematic because simply launching some programs (eg. PhotoShop) can force the discrete adapter. Like earlier designs, the battery is built into the unit and cannot be swapped or user-replaced. In practical use, I don't find this to be a problem because I'm getting the same extended runtime that I got on earlier MacBook Pros with 2 battery swaps.Rounding out the compliment of ports (on the left side only) is Gb ethernet, FireWire 800, 2 USB 2.0 ports, audio out and audio in (both supporting analog and digital/TOSlink connectors). If there is any weakness, it would be nice to have a right-side USB port, or at least enough separation between the USB ports to not force you to use a short USB dongle cable with your 3G wireless card (if you want to use both ports).As with Apple's other MacBook Pros, this model is built on their \"unibody\" construction, where the main case is crafted from a single piece of aluminum. This makes the laptop amazingly rigid, and also allows it to be lighter weight, thinner, and better at dissipating heat than more traditional laptop designs. Apple makes it easy to upgrade the memory or hard drive (you just need a fine #00 phillips screwdriver to remove the screws on the bottom plate).One last note on this MacBook Pro - Apple bundles a special build of OS X 10.6.6 which you will want to immediately upgrade to 10.6.7 using Apple's Software Update mechanism. (You can't apply the 10.6.7 combo updater since this version of 10.6.6 is later than the standard build). The \"OS X 10.6.7 Update for Early 2011 MacBook Pro\" includes an important fix for the discrete graphics processor under heavy workloads.For those of you (like me) who still have older PowerPC software that hasn't been updated (Quicken!), this will most likely be the last generation of Apple notebooks to run on OS X 10.6.x \"Snow Leopard\". The next release of OS X 10.7 (\"Lion\") has removed support for running PowerPC applications (Rosetta). This alone was worth me upgrading to this model.", "Date": "April 1, 2011"}, {"Title": "Great machine", "Author": "Yu-jin Chia \"Yu-Jin Chia\"", "ReviewID": "R27W3GPZZ7YPUZ", "Overall": "4.0", "Content": "I've used a pretty wide variety of both PCs and Macs, both for personal use and for work. I've used them for gaming, development, and run-of-the-mill tasks. However, my last two machines (three counting this one) were all Macs. I'm still a believer in the PC for hardcore desktop gaming, but as far as laptops go I'm pretty much sold on Apple. Why? Quite simply, Mac laptops are just a lot less fuss. They don't break down or exhibit weird quirks as often as PC notebooks, generally last longer on battery power, and take up less space. For my latest machine, I decided to splurge a bit and get something that can actually play games- fully intending to take advantage of Boot Camp to run the loads of Windows titles I usually play on my monster desktop gaming rig. The 15\" 2011 Pro with 1 GB video was the obvious choice: not so big I can't carry it around, yet with enough muscle to run anything in my library. Was it worth the huge price tag? In a word: yes.Pros:Case design is superior, not just elegant but functional as well. It's actually somewhat water resistant (don't ask) and very easy to clean. The form factor is slim and handy- easy to carry around.Hardware layout is well thought out, and design is excellent. Speakers are positioned so the sound is crisp, almost as if you had externals. Camera is sharp. Trackpad is huge and very responsive.Mac OS X is still the best OS out there. I must say, Windows 7 is a whole lot closer than any other previous incarnation of that franchise, but OS X still has it beat in many ways: no defragging, doesn't degrade over time (especially when used for software development), more stable, boots up and shuts down faster, and generally speaking more intuitive in UI layout. You'll also have a lot less to worry about as far as malware and spyware are concerned.Screen quality is great, and the backlighting for both the display and keyboard are excellent. Note: I strongly recommend paying the extra for the high-res 1680x1050 display upgrade, unless you're always going to have your machine hooked up to an external display. It is totally worth it. Second note: if you do get this upgrade, don't bother with the anti-glare, as it's equally totally NOT worth it (you can get a third party stick-on that does the same for a lot less, and is removable).Has enough power for pretty much anything. RAM/hard drive are easily upgradeable- buy it yourself and install it yourself; it's about as hard as loading VHS cassettes. This model straight out of the box can run most current games on max settings.Dual boot is easy to set up. I'm running Win 7 64 alongside Snow Leopard for gaming purposes. Boot camp sets up all the drivers with little fuss. The only issues I've seen are that the graphics card switching doesn't work on Windows, which eats up battery a lot faster, and right clicking with the trackpad is a bit awkward. The latter is easily solved by hooking up a 2-button mouse.Magsafe is awesome. I'd probably be out a few dozen machines from tripping over the cable if not for this simple yet brilliant feature.Battery life is great. It doesn't usually last for 7 hrs as advertised; 5 hrs is more typical when doing various tasks. However, even that is huge compared to most similarly specced laptops.For a laptop of this size with this power, it's really light.Apple's customer support is top-notch. If you're in the US their stores are pretty much everywhere, and you can get same-day repair service in most cases. Try doing that with Dell or HP sometime...Cons:The mini displayport/Thunderbolt connector means you'll need an adapter for pretty much every different video device you hook up. They're a bit awkward to hook up and can get bulky if you have enough of them.If you run 3-D intensive apps like most games the big video card turns on, and it runs pretty darn hot. When the fans kick in, it gets pretty loud.Compared to some older unibody platforms, it's harder to get at the innards. You have to unscrew the whole bottom plate and remove it to even access the battery. For most users, though, this shouldn't be too big a deal.It's considerably more expensive than a similarly specced Windows laptop.Doesn't have a blu-ray drive, if you care. Most Windows machines in this price range do.Is this machine for everyone? Probably not if due to the price alone, but I've found less to complain about than just about every other laptop I've owned. I'm still a fan of the regular MacBook for non-gaming/coding tasks due to its smaller form factor, lower cost, and lighter weight. However, it doesn't have the power to do anything more serious than video playback. If that's all you're going to do and ease of transport is a priority, then go for it. If you're planning on replacing a desktop or want some serious mobile power, then the Pro is a better choice.", "Date": "May 30, 2011"}, {"Title": "MBP... where have you been all my life?", "Author": "M. Canales \"Msc\"", "ReviewID": "R2G2VZ99RUJZ9Q", "Overall": "5.0", "Content": "I can sum up my review in one word:Superb. No, Extraordinary! No, Awesome! No... well, you get the idea.Maybe i'm over reacting, but i do love this little machine. Its just over the top, the quad core processor breezes through anything i throw at it, and the 4Gb are very capable (though i'm considering upgrading it to 8gb soon). Something that really rules is the video card. So far i've installed several games on it, and ALL of them it runs on very high settings.This is my first Mac, so i had to suffer a slight adaptation period. A very slight period. It took me all 15 minutes to get used to it. It's just so natural!I love tweeking configs and personalizing my computers, and though Mac OS is more rigid with respect to the themes one can put up, its a marvel when it comes to comfort. If you get down and dirty, Exposé and Spaces will rock your world. And the dock is just so much more practical than the standard issue windows bar.Now, compatibility wise Mac OS can seem problematic, however this is just an illusion. This particular MBP packs so much punch that you can literally run windows on it simultaneously without even a hiccup. Virtualization, however, is a must for anyone that needs specialized software (specifically anyone with a CAD oriented program repertoire).Im running Parallels 6, with a Windows XP virtual machine, and it runs all my Engineering programs beautifully (Staad.pro, MathCAD, Civil 3D, Revit Structure, MS Project). There is a Mac version for AutoCAD, but if you already have the windows license, the virtual machine will run it beautifully too. With tools such as \"Coherence\" you can be using Windows and Mac simultaneously without having to deal with the typical Windows problems.Something i'm loving is the stability. Now, i have been pumping this baby with hard hitting processes since day 1, and it has responded well. Now, don't get me wrong, it did have its standard hangs on certain apps, however the hangs are very \"contained\", as the OS on a whole remained perfectly stable during these hangs. The apps that would hang, could easily be Force Quit and reopened with no data loss.I've been using video converters for a long time, since i do have preffered formats for video, and this little piece of heaven really cuts down conversion time. There is this little open source app called Handbrake that handles itself pretty well for conversion. Its one of the only apps that i've found that can handle the quad core resources almost seemlessly. Bootcamp is a must if you do heavy gaming. I installed Windows 7 on it and it runs like its native... Better even. I've installed games such as Fallout 3, Fallout New Vegas, Deadspace 2, Starcraft 2, and Just Cause 2. They all run on full graphics without a zinch. I've been really pushing this machine, and so far im extremely satisfied.I've been reading other reviews, and i cant understand some of the complaints. Maybe they got bad units, but then again Apple will replace any defective unit in a flash so it's not really an issue. I dont have any complaints with respect to battery life, i can get the advertised 7 hours, and even push out 8hours if i bump out Airport whilst im using text processors. However when using resource hogs, the battery drains quickly (for instance when running XP simultaneously the battery life goes down to around 3-4 hours. Graphicly demanding programs also drain the battery quickly.If you are looking into this particular model (15\" 2.2Ghz Quad Core 4gb Ram 6750 AMD Radeon), then chances are you know your way around computers. My guess is you are probably into graphicly demanding progs as well. So i can vouch for it, and say that it has answered elegantly to any vulgar attempt i've made at maxing it out. If you are not looking for a powerhouse though, i STRONGLY recommend getting one of the mid ranged models.The price tag on this baby was the only cringe-factor... but now, 3 weeks into this enterprise, i can say its definitely worth it. If you can afford it, and you will actually use it at its potential i absolutely recommend it. If you are a casual user, however i recommend something less expensive.Windows users don't be afraid. There are more ways to run windows on a mac than you can shake a stick at... but DO NOT buy this computer just to run windows on it... just get a PC, its cheaper :PSo in short, this laptop is over the top, i strongly recommend it for anyone looking for a powerhouse, but i strongly advise against this particular model for anyone looking for just casual computing. Anyway you go about it, Apple won't let you down. I finally understand why people say \"Once you go Mac, you never go back\".:D", "Date": "April 7, 2011"}, {"Title": "Massive power, but I'm having a problem with this machine", "Author": "DK", "ReviewID": "R1UQPCHNSCPUDS", "Overall": "5.0", "Content": "I purchased the new Macbook Pro 15\" (from Amazon, thank you) the very first weekend it was released.  I produce videos for my company and felt like this was a super upgrade in power for me.The machine is now having problems with hard freezes when I try to render video.  The system fans start to rapidly build to around 6000 rpm and the machine goes into a state where the only option is a hard reset.  The machine is REALLY hot too.  At this point, I have noticed other postings on the Apple forums which suggest that this is a problem others are reporting about the new line.I realize I'm not offering much background at this time but I wanted to make it known in case anyone is considering a purchase.  Here is my immediate take:1)  If you feel you can benefit from the horsepower, I would definitely recommend this machine.2)  If you don't need it TODAY, wait about 30 days before purchasing and see how this plays out in the forums.I have an appointment with the Apple Genius Bar and I fully anticipate they will want to replace it.  Despite this issue, I still LOVE my Apple gear and will always recommend them.UPDATE:  I noted in later postings below that I have learned a little more about my issue.  As a result, I am revising my rate to be 5 stars since the problem appears to be related to a non-Apple application.", "Date": "March 8, 2011"}, {"Title": "a great computer", "Author": "Chaya", "ReviewID": "R2WFH1PU3JG3UR", "Overall": "5.0", "Content": "The other reviewers went into the technical specs & construction, so I'll go with some real life experiences. I've been using this computer for over a week now and wanted to wait till everything was connected and all software tried out before commenting.My configuration is with the hi-res anti-glare screen & upgraded to 8 gigs of memory. The screen is breathtakingly sharp and the colors intense. If you are thinking of buying the computer, the extra $100 is definitely worth it for the hi-res option. Glossy or matte is a religious preference, so that won't be covered. The resolution is the same as a 20\" cinema display but in a 15\" package.Speed - yes! A 3d file I tried to render on my old MBP would have taken 24 hours. On this computer, it took less than one hour including anti-aliasing. This is a combination of the increased processor ability, better graphics card and more memory. How much upgrading you do will depend on the software you are using. If you are doing processor-intensive graphics, don't even hesitate before buying. In Photoshop, it opened a 34 MB RAW image immediately and a variety of filters were then applied, each without any processing delay.The cons:  - battery life has been overstated. I've been using the computer for two hours now - only doing web browsing and email, and the battery is almost half drained. Other days when running Parallels, games or graphics programs, it goes down a lot quicker. This isn't a surprise, but you need to know you can't fly cross country using the computer all day - it's not an iPad.  - display issues. There is a problem being the first one out the gate with new hardware, and I am having issues when connecting to an external monitor. Apple engineering is already working on it, and it may only be some configurations, so you may or may not want to wait before this is figured out.Migrating from an old Mac - this is the first time I've done this using the Migration Assistant software. Wow. Instead of spending a whole day recreating my customizations, they were all there the minute the computer started up. Word of warning - before you do this make sure you can connect both computers via Firewire (you'll need an adapter if the old one is still firewire 400), because it took 5 hours for the migration to happen over ethernet. Worth the wait - everything is there: the screen saver, browser history, preferences, etc. Even the printer worked without having to search for and install new drivers.In spite of the cons, I still give this computer 5 stars because one is a given (battery) and I'm sure the other will be worked out.", "Date": "March 8, 2011"}, {"Title": "Short and sweet review", "Author": "Don Montalvo", "ReviewID": "R1MBWPFGW8BNZ4", "Overall": "5.0", "Content": "The new Early 2011 MacBook Pro 15\" is an incredible leap in performance. I deal with new Macs every day, and most of the time a performance increase is not that great. This new line is a HUGE leap in performance, both in processor (quad core vs dual core) as well as graphics (discreet). I bought the low end 2 GHZ model and increased the RAM to 8G. I give VMWare 2 processors and 4G of RAM...Windows screams!!! For Adobe CS5 work, much, much faster than dual core.Don Montalvo, TX", "Date": "March 25, 2011"}, {"Title": "Little Pricey but a fantastic laptop.", "Author": "Sam2Lucky13", "ReviewID": "RD7J6WX2119FZ", "Overall": "4.0", "Content": "I just upgraded from the 2011 15 inch 2.0ghz MBP to the 2011 2.2 mostly because of the graphics card upgrade to a full gb. I also installed a new owc 240 gb mercury extreme pro 6g ssd along with 8gb of memory. To me it didnt make a whole lot of sense to spend that much money on extras and not go for the higher end model 15 inch.Ill be honest the 2.0 ghz version with 256mb of vmemory was more than enough and performs very well in comparison to the 2.2 version. Most people would never know the difference if they took the pepsi challenge.I am a label whore however and I couldnt sleep at night knowing there was more out there.The smart move and most cost effective however wouldve been to upgrade the 2.0 version mbp with probably the most stable and most reliable ssd in my opinion on the market and thats the samsung 470. it has a 3gbs data transfer rate so its not as fast as those in sata III and at 6gbps but again the difference in real world computing scenarios is negligible. It isnt however apple friendly and neither are the firmware updates if you have a mac.I wanted the fastest while  still conserving some reliability so an OWC ssd with a five year warranty and excellent customer service and the latest firmware included before shipment was the obvious choice over an OCZ. Both ssds are sata III and have a 6gbps data transfer rate.No other upgrade will make a bigger difference in the performance of your computer than an ssd. Dont waste your money on a substandard apple offering though, there's a lot better offerings in both ssds and memory out there.I will also never purchase another computer through anyone other than Amazon.My first 2011 mbp in 2.2 ghz showed up after riding around in a ups truck in 115 degree Phoenix heat all day...I dont know how hot the inside of the truck was where the cargo is kept but the computer on arrival was nearly too hot to handle with my bare hands, I knew there would be issues.The display was loose and unstable when opened and the battery took a health hit showing just 90% health...unacceptable for a brand new 2000 dollar computer.I had zero problems getting a replacement and a morning delivery time. It was sent and arrived in one business day, and before I could send UPS's goof back to amazon...I was already using my new one. The reliability, discount, plus zero tax always makes me wonder why anyone would buy anywhere else. Any way just my thoughts hope they may help someone.I did take one star for price and the cost of the apple name and like I said I wouldve been just as happy with the performance of the 2.0 ghz version if i werent so neurotic.Just one more quick edit...the free upgrade to lion from apple's website couldn't be easier.", "Date": "July 20, 2011"}, {"Title": "Returning to the Mac", "Author": "Philip Brooks", "ReviewID": "R2JSH1E8HCISQZ", "Overall": "5.0", "Content": "I used the Mac from 1984 to 1995 at which time I switched to Windows, since I retired and was starting to work as a computer consultant and the people who needed help were all Window users. After making a good income helping Window users for over ten years, I bought an iPhone and was so impressed I decided to look into the current Macs. What a pleasant surprise. It's really a joy to again use a computer that is fun to use and you don't have to spend all that time keeping it running, as I did in Windows. I still have a need to run a few programs in Windows, such as Access, so I installed Parallels Desktop for the Mac 6 and can now use Windows when I have no other choice. The MacBook Pro 15 is without a doubt the best investment I have made in years. If you want to see what the computers of the future are going to look like checkout the last Macs.", "Date": "April 21, 2011"}, {"Title": "First time Apple owner is ecstatic", "Author": "nascarlurg \"nascarlurg\"", "ReviewID": "R3EHVP1EMW1RM4", "Overall": "5.0", "Content": "Well this is the first Macbook I have ever owned and to say the least, I am not sorry about spending a little extra. The quality of this Aluminum notebook is unbelievable. To get this from Amazon also, just makes my purchase that much better. When Apple released the 2011 refresh with this Sandybridge chip I jumped on it. I actually was one of the first consumers to get this Intel chipset in an HP notebook that was part of the recall because of the mother board. I was able to use the notebook for a few weeks and was amazed how fast and powerful this chip was. Then I had to send it back but heard Apple was releasing this model.So when I seen that Apple was also using it, I couldn't resist. The chip can multitask like business and the new ATI graphics HD 6750M is a great addition. I am running Windows 7 Pro in bootcamp and all Windows programs run perfectly as do graphic intensive games. The 1 GB of GDDR5 Ram really help textures in games fly. I am very happy with the gaming capability as well as my work capabilities. I am running Adobe CS5 and even with only 4GB of Ram for now...it really hasn't slowed at all.....the Sandybridge is more than strong enough for video encoding. You can do so much all at one time it isn't funny. I think eventually I will upgrade to 8GB of RAM when I find it for the right price.So and professional that wants this notebook for work and play wont be disappointed.", "Date": "February 28, 2011"}, {"Title": "Recent Convert!", "Author": "tbidder", "ReviewID": "R2QDUOCPXZSVAK", "Overall": "5.0", "Content": "Bought this as a late Christmas/off-to-graduate-school present for son, who insisted on waiting until the newest model came out. He had never had a Mac before, having been raised on Windows computers. Transition to new operating system happened almost overnight. He bought whatever software he needed to actually work in the Windows world as well as the Mac world, as he does some web development and app programming. He says that the processor speed, video board, disk access (even though only 5400) are incredibly superior to the high-end Dell this laptop replaces. We read the reviews by the Mac-o-philes who complain about reduced battery life and other sub-par aspects, but for someone switching platforms, we have none of the nirvana Macs to compare to. The super-long battery life allows him to work through lengthy classes with having to search for power. He is absolutely in love with this computer, and keeps insisting that I switch too. This one comes highly recommended, from a geek moving from Windows to Mac. One more note: I bought this just as the computer was coming out and watched prices over a number of days before actually buying from Amazon. Amazon consistently had the best total price overall, thanks to low price + no shipping cost + no sales tax.  Glad I bought here.", "Date": "May 12, 2011"}, {"Title": "Great Product", "Author": "Kevin", "ReviewID": "RQF6554LGPH37", "Overall": "5.0", "Content": "I've always wanted to dive into the world of Mac. I'm impressed with the quality of the product. Very intuitive and innovative in design and operation. I've been a PC guy for many years. Now I'm excited about transitioning to Mac. The thing I think is very useful is the mousepad and how different touching techniques execute so many different commands that help tremendously with workflow. All around it's very well built and thought out. Highly recommended!!!", "Date": "July 6, 2011"}, {"Title": "Worthy upgrade for an older MBP", "Author": "DWhite", "ReviewID": "RL60FGY1AIRPR", "Overall": "5.0", "Content": "I purchased this computer to replace my 5 year old core 2 duo Mac Book Pro. I knew that I would see performance improvements and I have been pleased with how much this new computer is improved over the old one. I upgraded to 8 GB RAM (self installed) and the upgrade is well worth it. RAM hungry programs that I would really never run at the same time (Dreamweaver, Photoshop, Indesign) now happily run along side each other. 3D rendering is much faster. No comparison between the old MBP and this new one for 3d or video encoding - huge improvement.I needed to upgrade and decided to go for the extra horsepower and am happy with my decision. My old MBP was not a unibody. This one feels much more solid and better built.", "Date": "April 17, 2011"}, {"Title": "Best Computer I've Ever Used!", "Author": "Jake", "ReviewID": "R2RDYYBQWWLDR1", "Overall": "5.0", "Content": "I just recently purchased one of these laptops.  I had mine customized by Apple - a 1680x1050 high-res screen and 500GB 7200RPM hard drive instead of the 750GB 5400RPM.  I am extremely glad that I did.The screen is wonderful on it.  I previously owned a 2008 MacBook Pro 15.4\" with a 1440x900 matte screen, and I much prefer the glass-covered high-res screen on the new one.  I sat them side-by-side and the color difference is tremendous.  Obviously, the pixel density on the new one is also iPhone4-like, and great for typing or reading.  At one time I had a 23\" computer monitor that was the same resolution as this 15.4\" MBP, so it is really amazing.  It's also great how easy it is to really clean the screen on this new computer - since it is all glass you can put a bit of water on the cleaning cloth and it gets perfectly clean.The internal hardware in this new MBP is also flat-out incredible.  I have purchased Windows 7 Pro for it to run in Boot Camp in case I need it for work and had a very interesting find.  I also own a self-built gaming desktop I made a couple of years ago, which scores a 5.2 on the Windows Experience Index.  Get this - the new laptop scores a 5.9!  Its quad-core i7 processor scores 7.6 and the AMD graphics scores a 7.  Its hardware is comparable to a $3000 Windows gaming laptop, but it gets twice the battery life!  I have also purchased a 1TB external hard drive from Seagate that has FireWire 800, USB 3, and eSATA support.  They have promised in the future that they will make a Thunderbolt connector for it, so it will work even faster on this laptop.Other great features of the new MBP are 4GB of DDR3 RAM, an HD webcam built-in, backlit keyboard, and its SDXC card slot.  As a photographer, I am much happier to have an SD slot instead of the ExpressCard slot on my old MBP.  I was originally going to wait this summer for the new MacBook Air, but I am very glad I purchased the Pro instead.  Yes, it is heavier and thicker, but 10 times as powerful and has a better screen!Some people complain about these being \"too expensive for what they are\" or \"just made for Apple fanboys\" but the truth is neither statement is correct.  They are just the most reliable and well-built laptops on the planet, and run very fast and long on one battery charge.  Things like a lack of BluRay or USB 3 are not really a big deal, given that Thunderbolt will be 10 times faster than USB 3 and BluRay is not really necessary when you can easily download high-def movies or use Netflix.  If really obsessed with BluRay, just get a slim external drive and use Windows on Boot Camp.  MacOS X Lion is currently the best operating system in production, with tons of features but very easy to learn everything on.  iPhoto, Mail, and Safari are excellent programs for daily use - very simple yet feature-filled, and now can be full-screen.I highly recommend this computer to anyone who wants a fast, powerful, and long-lasting laptop.  Unlike almost all other companies, Apple products retain value a lot better, as they tend to last longer and are much more reliable.  I sold my previous MBP quickly, for about half of what I paid for it 3 years ago, something rarely seen when selling older computers.  My suggestion would be to buy this computer, customize it with a high-res screen if you always work with photos or videos, and buy Windows 7 OEM if needed.  Windows OEM is much cheaper than the full version and it is made for installing to new computers - $129 for Windows 7 Pro compared to $299 for the full version.  The only slight issue with Windows is that unlike in MacOS, the system will not automatically switch graphics cards to save battery.  Therefore, in Windows it is always on the high-power graphics and battery life drops from 7 hours to about 4-5, which is still better than battery on 99% of high-power Windows laptops.As someone who has owned 10 or 12 PCs, 3 Macs, and worked on 6-core brand-new servers, I am just amazed at the speed and power of this new MacBook!  Much better rated than any other computer I have ever used, and even open to higher speed given that I chose to stick with the 2.2Ghz i7 instead of paying $300 more for the 2.3Ghz.  Also, 8GB of RAM is an option, as well as up to 512GB SSDs, which would offer much better data read/write than even my 7200RPM normal drive.  If you are looking for a new, fast, reliable, powerful laptop, look no further.  You've found it!", "Date": "July 24, 2011"}, {"Title": "New to Mac.", "Author": "Occasional Amazonian \"Andrew\"", "ReviewID": "R2D5UG6RB1E689", "Overall": "5.0", "Content": "I've used Macs on and off before out of necessity and to be honest I was never really impressed with the user experience since it was so strange. Now, with more regular use, it's not so strange.Here are some thoughts in no particular order:1. The first thing I noticed was that the Mac experience is a very curated one. Whereas someone with a handle on Windows will be flying around the OS in no time, manipulating files at will and changing settings, your options are far more limited on a Mac. Sometimes you bounce into limits due to ignorance and other times because they are real limits.For example, full-screen windows are still a pain. Maximizing windows does not automatically produce the effect it does on a Windows PC. You still have to drag the bottom right corner of the application to make it full-sized. I still, however, have been unable to figure out how to change the system font size. Beware, it's tiny--and I'm not so old.2. Multitouch is very, very useful; but on the other hand I do miss Aerosnap. Two-finger scrolling does away with the mockery that is the scrollbar on a regular laptop.3. This thing is built solidly. You realize this when you subsequently handle other laptops. The \"brick\" is a bit odd (I have seen this shape on older Macs) but that's just a matter of personal opinion.The magnetically attached cord seems like a good idea.4. \"It just works\": There may be some truth to this. I plugged in two different printers (one with a scan function) and if you've ever had to deal with HP and their drivers on Windows you'd be shocked. They just worked--full-featured and all. No need to download anything.5. This thing gets hot sometimes--too hot to put on your lap.6. Flipping through files is a bit more awkward than on Windows. I'm still trying to figure this out.7. Installing applications is sometimes confusing--but I guess I will learn; although there does not seem to be a standard procedure.8. The battery takes a long time to charge and a long time to discharge (compare to other laptops I have used). You get a lot of time on the battery.This is all I can remember for now.I would buy another Mac if possible because of the sturdiness. The OS takes a little getting used to.Will I ever \"go back\"?Well, I never \"left\". I will say that things have been encouraging so far--including Safari (the browser I was not initially impressed with--being more partial to Chrome). I still do use Windows PCs and I like the way they encourage tinkering etc. I am sold on the idea of Apple laptops as far as durability goes. Maybe in the future I might buy other Apple products.Lastly, I am considering the OSX Lion upgrade later this year after all the kinks have been worked out.", "Date": "June 20, 2011"}, {"Title": "Just Amazing", "Author": "Nathan Lane", "ReviewID": "R2QE4I2CQ5N774", "Overall": "5.0", "Content": "I don't think there's too much I need to say about this one. It's super powerful and it looks amazing. I bought the Corsair 8 Gb RAM upgrade and put those in before I even turned my MacBook Pro on for the first time. Worked perfectly. The only problem I ran into was that one of the fans was making some awful noise. A couple of taps to the fan got it back in place and running totally silently.I also set up Boot Camp and loaded Windows 7 Pro 64 Bit. It runs great. Make sure you install the video drivers before you install the Boot Camp drivers. Otherwise the extra features available in the Radeon tools won't work.", "Date": "May 24, 2011"}, {"Title": "Sandy Bridge goodness, even better with 8GB RAM.", "Author": "JuanGuapo", "ReviewID": "R2T04JUY906SHI", "Overall": "5.0", "Content": "Short and sweet: You really do get what you pay for, especially with computers. The customer support is in North America and you can take it to a Genius Bar with questions. Sandy Bridge processor is a quad-core monster (8 with HT) that only gets better with an 8GB RAM upgrade--it makes iMovie cook 1080p video in nothing flat. I've had my MBP for several weeks, it it's a screamer with iMovie videos.Lion Upgrade: I bought mine a few weeks before Lion was released so I was able to get the free upgrade. The upgrade went very smoothly, took approximately 30 minutes (not including download time).Three things I love....a) Everything works as it should, boots quickly, and has killer battery life. (Free upgrade to Lion was a nice touch)b) Fit and finish is top-notch. The display has the best contrast I've seen yet. Sound quality blows away the \"Beats Audio\" I had on my DV7.c) Relatively cool to the touch. Will warm up under heavy load. Not suitable for using on your lap, get a coolpad or put it on a table.Three things that are neither here nor there....a) Thunderbolt port. No major accessories on the market yet. 10Gbps up/down is nice to have as future-proofing.b) Unibody construction, very few things to take apart. 10 screws to remove the bottom and upgrade the RAM. Built like a Swiss watch inside.c) Backlit keyboard is a nice touch. I generally turn it off but it's handy when you're in a dark room.Things that I didn't like....a) Apple only supports Windows 7 for Boot Camp on this machine. I realize XP is now out of date but I still use it for some things. VMWare Fusion 3 runs it fine, though.b) USB ports are only on one side.c) SD card slot only. Sucks for those of us who use MemoryStick or MSP.", "Date": "August 15, 2011"}, {"Title": "The best piece of technology I have ever owned!", "Author": "Christopher Pickup", "ReviewID": "RW216TLBRUJCU", "Overall": "5.0", "Content": "Quite simply stunning.  I am a filmmaker and videographer that edits my own material, and freelances for other companies.  This laptop allows me to take my craft anywhere I want to go.  The video graphics processor is stellar and the quad core i7 lets me do everything faster.  I wish the rpms were a little higher, but I haven't noticed a problem yet.  Bravo Apple!  I can't wait to see what you add to your notebooks next.", "Date": "April 7, 2011"}, {"Title": "Great Computer!", "Author": "David Bradshaw", "ReviewID": "R2RMEJWN1L3ZMI", "Overall": "5.0", "Content": "First off this computer feels well built.  It is sturdy, and solid (no cheap feeling plastic or hollow points inside).  The computer is really thin, and looks good.  The OS is very easy to use and was ready to go after I typed in my name and basic info.  The OS found my wireless printer instantly (using Bonjour) and downloaded the HP software without me doing anything (other than going to Print and selecting my Printer).  The screen looks really good, and even though it is not full HD it looks very good.  The DVD drive is nice and sucks disks in when you put the disk in (like the PS3), the only weird thing is that you have to put the disk almost all the way in before it pulls it in.  This model has 2 USB ports, which are good for cables, however, if you are trying to use a flash drive, you may not be able to utilize both ports with the another cable in (depends on your device and equipment).  The power adapter that comes with the computer is really nice, it is magnetic so if you hit the cable it just falls out; the power cable also has a handy pop out hand that ties the cable nicely, so you do not have a bunch of cables hanging out.  The computer does not have a VGA/DVI/HDMI out port, so you have to buy an adapter to use an external monitor, the computer easily recognizes when to use which monitor (when both are open it extends display (unless you specify to clone) or if you close the MacBook Pro the External monitor goes at its native resolution.  I use a 21\" HP monitor and it works fine (when extending or External only) at 1080p.OS X is really nice.  It is super easy to use and learn (it takes a while to get use to if you try to do everything like you would in Windows).  The settings are pretty straightforward, and Spotlight search is really good at finding what you need.  the Mail app and Calendar app work well with my Gmail account.  If you are a developer then you will find Xcode very useful (which is free from the App Store), and if you are like me and have a few Windows applications that you have to have, Bootcamp is super easy to setup.  Specify how big a partition to give to Windows, download the Windows Drivers CD file, and then insert the Windows 7 CD.  Write to the proper partition (follow Bootcamp's instructions (download or print before starting)), and then once you are in Windows put the driver CD to get Windows to recognize the hardware.  To boot into Windows in the future hold down Option or Alt (depends on which keyboard you use) at startup (if you get the Apple logo you missed it) and get the boot menu.  Windows works very well in the MacBook Pro and sees 8 Processors (4 Cores, 4 Virtual Cores from the Intel i7).  Windows only seems to use the ATI Graphics card, not the Intel Graphics, because Windows does use the switch graphics card like the Mac does.  Windows can also take advantage of the external display using the adapter (Start + P) to change external display settings in Windows.  Also, when in Mac OS X I see that my battery time remaining (when just surfing the web) usually shows 7.5 hours, as you perform tasks the time remaining automatically changes, to show how much battery you have using the current task. -- Note, this battery is not changeable, you have to have Apple change it (like the iPhone)The computer that I got (from Amazon) came with Lion, so I did not have to upgrade, however, Lion no longer includes the backup disks that were included with previous MacBook Pros.  Because of this you have a recovery partition on the HDD, and you do not get iWeb and iDVD(which would normally be on the iLife disk, so that is sort of disappointing -- you do get iPhoto, iMovie and GarageBand).In the end, this computer is very well built, and should last a long time (since it is very sturdy), the computer is also very powerful and should be beyond adequate for quite some time in the future.  I hope to get a long life out of this computer, and since it can support Mac and Windows it should be able to accomplish everything!  I really like the computer, and hope to have it for some time.  If anything changes I will post it here!", "Date": "October 10, 2011"}, {"Title": "mbp... beasting as usual", "Author": "C. Avery \"CRAIG AVERY\"", "ReviewID": "R2PAXLIYO3PWWG", "Overall": "5.0", "Content": "My second MBP and like my 5th mac.... beasting as usual... This is the best laptop I've ever owned. Insanely fast.. can encode an HD screenccast in like 2 minutes and have it on youtube. 40 apps open... np... Cant wait til ram comes down a little and I can upgrade to 16gb.. need to get an SSD and it will really fly. Sandy Bridge FTW :D It's the perfect laptop. Period. No complaints, only exclamation!", "Date": "August 31, 2011"}, {"Title": "Another highly functional design by the nerds from cupertino", "Author": "T. Vaida", "ReviewID": "R1YRU93R4XKOD1", "Overall": "5.0", "Content": "I've been using Mac since 1994, this is my latest, and without a doubt, best constructed laptop from Apple.  I purchased the first MacBook Pro with the original CoreDuo processor, and then later an early 2008 Core2Duo, both had issues with assembly and when the disk was replaced the case never fit right again, however this version not only has a good looking assembly, it is maintainable longer term with a design that is much more solid.  Heat is far less of an issue than the prior versions (actually can use it as a laptop most of the time without discomfort from heat) and there are nice touches like the front panel sleep/display-blanked indicator led is hidden behind the aluminum skin with super tiny etched/drilled holes making it nearly invisible when not in use.", "Date": "July 5, 2011"}, {"Title": "best macbook pro so far!", "Author": "lamixer", "ReviewID": "R3FL5WZMKJJEBY", "Overall": "5.0", "Content": "I've had a good number of mac laptops over the years, and this is the best yet. Keyboard is very solid and feels good to type on, screen is bright, CPU is extremely fast. I recommend using an SSD as your boot drive. Only possible downside is I feel the colors on the screen are not quite right. This is my first glossy screen and I like the 'pop' but the colors don't seem to be as accurate as my 2006 model -- it's not exactly the color temperature, but something like that. I'm getting used to it though. Overall, I love it.", "Date": "April 27, 2011"}, {"Title": "Buy the 2.2ghz 6970M (early 2011)/(Old Version) and save yourself some cash.", "Author": "asdf", "ReviewID": "R3TE8Q1RCWIEZL", "Overall": "5.0", "Content": "If you are in the market for a 15\" MacBook Pro this is the one you want, If you are not a tech person, and you are looking to buy a MacBook Pro 15\", read this review, It will save you a lot of researchAs of right now this model is on sale almost everywhere, because they are the high end model from early 2011, and are now clearance items. The current high-end 15\" model retails for 2199, where-as you can get one of these for 1799$.The newest high-end model has only one \"improvement\", which is a 2.4 ghz processor, a minuscule .2ghz increase from the previous 2.2ghz.Reason #1.The \"Newest Model\" MacBook 15.4\" 2.2ghz(late 2011) priced around 1700$ is a base model, this may look the one to buy, because it is newer. This is not the case, the Early 2011 (Old Version) is a high end model, this models processer is the same speed as the \"Newest Version\" but it is not the same processer, the \"Old Version's\" processer has a significantly better turbo boost.Reason #2The \"Newest Version\" has the 6970m graphics card w/ 512mb Vram, where as the \"Old Version\" has the same graphics card but with 1024mb(1gb) which is literally doubled!Whatever you do, Do not buy the MacBook Pro 15.4 2.0 ghz (Early 2011)\"Old Version\", it has a 256mb graphics card which IMHO is a rip-off.", "Date": "February 4, 2012"}, {"Title": "Wonderful, But Overpriced", "Author": "Mayflower Girl \"amazon-junkie since 1996\"", "ReviewID": "R29PEFTHDTNDDV", "Overall": "4.0", "Content": "So, I love my MacBook Pro.  I didn't buy mine off of Amazon, but got it custom from Mac--so it's a slightly different setup.  I went with the high speed hard drive, which is only 500 GB.  I had a Mac Powerbook way back in the early 90s that zoomed at 33 Mhz.  LOL  Things have improved.  Lots to like... nothing too surprising...some of the good things:1) Fast.2) Very intuitive platform like all macs.3) Looks great.4) Safer in terms of virus, etc.5) Offer 14 day return if bought in store (Apple Store) without a restocking fee, which is nice. (Ended up ordering two to compare screens, and returning one.)6) High Res--whites much brighter, grays better, colors better--which is to be expected.7)Trackback functionality is great.  Can zoom up and down and scroll very easily, flip pages, etc.8) Cheap to upgrade OS.  $35 or so vs. $200 for any Windows machine.Now some of the bad (minor criticisms, I realize):1)Don't offer OS back-up CDs anymore.  Very difficult as customer to create it on your own.2)DVD Drive doesn't have Blueray, and it's crap--HP.  Makes a ton of noise.  Can easily scratch DVDs if move computer while running.  (Had two different MacBook Pros--same issue with both.)3)Wonder about the safety of the Apple on the back of the screen.  If you touch it, you can actually see your finger on the screen.  Wonder if you'd be totally screwed if computer hit in some way.4) Pain that they don't have High Res w/ glossy in stores--so difficult to compare.  Had to order both to see which I liked--and then return another one.5) Battery on high res w/ high speed hard drive 7200 RPMs not great. Only have about 4 hours battery life.6) Choose not running in native resolution on High Res, end up in much lower than even the standard res.Just so you know, you can upgrade and do things yourself.  Don't believe that you can't open it yourself.  They show you how in the directions.  Memory, etc. totally overpriced through the Apple Store, but can do it yourself for 1/4 the price.  I also truly believe that one could probably put the MacOS on a Toshiba for like $600.00. ;)", "Date": "September 9, 2011"}, {"Title": "My best laptop!!", "Author": "elve", "ReviewID": "R2802NEYZBYDPE", "Overall": "5.0", "Content": "Best laptop I've ever had. I'm a music producer so I use my laptop to make music and this laptop has become my most important tool. Os x is a great system.", "Date": "June 8, 2014"}, {"Title": "Apple Rocks", "Author": "shaft", "ReviewID": "RF2F2SVLO7U70", "Overall": "5.0", "Content": "Beautiful Macbook Pro that has an i7 processor with 4GB of RAM at purchase.  If you are looking to get a MacBook Pro with a DVD this is a great model to get.  This model is hard to find new and you can get a used one at about half of the original cost when it was new and usually in good shape. With a MacBook Pro and 4GB of RAM is like running a Windows laptop with 8-12 GB of RAM, Macs are that effective with memory utilization and processor turbo boost.  If you plan on running intense programs add at least 8GB of RAM. Nice extras like the lit Apple, back-lit keyboard, aluminum body, track pad gestures and the chicklet keyboard are awesome.  Where Macs really shine is battery life which is nearly double that if a windows laptop.", "Date": "March 23, 2014"}, {"Title": "Nice Machine", "Author": "SMITH S RAJ", "ReviewID": "R24F8TIH45HH2F", "Overall": "5.0", "Content": "Its nice and powerful machine, only issue that i found is the HDD Speed. If it was an SSD then a lot better. the Screen is crisp and clear.", "Date": "March 6, 2014"}, {"Title": "Meet my expectations", "Author": "Sue B", "ReviewID": "R1XYDK55RU7Z3I", "Overall": "4.0", "Content": "I like the computer. it is my first MAC and i managed to do a back up and set up my passwords... I am still in the transition face.  I think  for that money i would much rather now got me a gaming laptop (PC)", "Date": "September 26, 2013"}, {"Title": "Pricey but exceptional", "Author": "JOSE MACHADO JUNIOR", "ReviewID": "R2E3836LP1ZN3V", "Overall": "5.0", "Content": "There's nothing I want to do that I can't with this laptop.All the games I want are or are to be released to its platform.OS is reliable, stable and easy to operate.Its construction is done perfectly.", "Date": "February 6, 2013"}, {"Title": "A pretty great computer", "Author": "Aakash Verma", "ReviewID": "R2XVVF01O82TX1", "Overall": "5.0", "Content": "I bought this computer used from Amazon in the later part of 2012.  I should say that in general this computer is great and it's pretty fast - even though mine has only 4gigs of RAM (3 gigs for OSX and 1 gig for Windows 8 on parallel).  I should say that I recommend that if you are planning on spending this kind of money on an Apple product, getting Applecare should be a priority - when I bought the computer, my SD card wasn't working.  I just took it into an Apple Store and the price of repair without warranty would have been $310, with Applecare it was $0.  The premium for a computer with Applecare has already paid off.", "Date": "December 11, 2012"}, {"Title": "Just as described", "Author": "Ben Purcell", "ReviewID": "R1T9TXK4SYYU7Z", "Overall": "5.0", "Content": "Good service, the macbook was working in good condition and exactly as described. The SSD hard disk is certainly an improvement over the old type of HDD, the laptop boots and is ready to go in just a few seconds.", "Date": "October 14, 2012"}, {"Title": "Good job once again, Apple.", "Author": "I. Garcia", "ReviewID": "R2DIDKS0WECQKV", "Overall": "5.0", "Content": "Considering that technology is changing everyday, for this laptop to be over a year old it performs and looks extremely well. The aluminum unibody design is amazing as well as the screen real-estate; I was accustomed to a 15.4 inch display, so the transition was seamless. A very great product and with the right upgrades, can be \"future-proofed\" for up to 3 or 4 years, in my opinion.", "Date": "August 17, 2012"}, {"Title": "Fantastic!!!", "Author": "Sassy_brash", "ReviewID": "R23P0YVZAJ4BTX", "Overall": "5.0", "Content": "I love this laptop just as much if not more than my iPhone and they both work together perfectly...and there's so much to play around with like the apps and games ect.", "Date": "March 19, 2012"}, {"Title": "I love my \"used, like new\"  early 2011 2.2ghz 15\" MBP", "Author": "H. E. Davis", "ReviewID": "R3SOGW5NM0Y4KB", "Overall": "5.0", "Content": "Bought it at a great price from Amazon Warehouse. Called Apple and they reset the original warranty to the date I purchased it.Couldn't be happier with the computer or Amazon Warehouse - price, quality and service.", "Date": "February 12, 2012"}, {"Title": "Much better than a PC!", "Author": "Joshua B. Brackin", "ReviewID": "R64D2MGL3T6WV", "Overall": "4.0", "Content": "I recently purchased this MacBook, and I'm very satisfied overall. The styling is attractive to the eye and it's a very powerful little machine. 15\" really feels perfect compared to the 13\" or the 17\". The i7 processor makes this computer really fly. There hasn't been anything that I've tried tht this computer can't handle. I did install windows 7 on it through bootcamp to play a few games. The dedicated video card handles all modern games perfectly and can do max graphic settings on almost all of them.A special note would be to mention that this computer does get very warm while doing heavy graphic work. This is completely normal and is why it is considered a portable computer rather than a laptop. It is very uncomfortable to use on your lap due to the heat. I'd strongly recommend a portable desk if you do choose to use it on your lap. I bought a Logitech portable desk and it runs perfectly without becoming uncomfortable. Great computer!", "Date": "January 21, 2012"}, {"Title": "MacBook Pro 15\" MC723LL/A", "Author": "Buyer", "ReviewID": "RTUXZXCOBNO1P", "Overall": "5.0", "Content": "Amazing product! Very satisfied with it! Apple should monopolize and take windows products out of the market! I was a windows user but when I entered the world of Apple there was no turning back.", "Date": "January 18, 2012"}, {"Title": "Awesome gift ever", "Author": "Ramiro", "ReviewID": "R2VISH0CQEMY4F", "Overall": "5.0", "Content": "I got this MacBook Pro 2 weeks agoIt Came OX S LionIts a bit heavy but i still Love itand a free update of iPhoto", "Date": "October 26, 2011"}, {"Title": "Love the new Macbook Pro.", "Author": "Anna L. Stewart \"web dev diva\"", "ReviewID": "R37NUS40K7Y7T7", "Overall": "5.0", "Content": "My new MacBook Pro 15\" (feb 2011) arrived in perfect condition in a sealed box. It works beautifully! Understated elegance with lots of power.", "Date": "October 22, 2011"}, {"Title": "Love the new Macbook Pro.", "Author": "Anna L. Stewart \"web dev diva\"", "ReviewID": "R37NUS40K7Y7T7", "Overall": "5.0", "Content": "My new MacBook Pro 15\" (feb 2011) arrived in perfect condition in a sealed box. It works beautifully! Understated elegance with lots of power.", "Date": "October 22, 2011"}, {"Title": "Apple does it again", "Author": "CAMILLA GREAVES", "ReviewID": "R1B2477FLLPJPG", "Overall": "5.0", "Content": "The color is fantastic so my pictures look better than ever.  Migration form my former mac which suffered being dropped, and was not responding was still easy. All my information, settings were the same, only much better!!!", "Date": "October 1, 2011"}, {"Title": "Love it!", "Author": "Ann M. Snell", "ReviewID": "R8CENAU50VVAF", "Overall": "5.0", "Content": "Great laptop with fast shipping. Everything I expected. I recommend this product. Easy to set up and quick as lightning.", "Date": "September 14, 2011"}, {"Title": "fourth one...", "Author": "E. Alexy", "ReviewID": "RHEFTP9T695GL", "Overall": "5.0", "Content": "my fourth Macbook Pro and i couldn't be happier.  upgrading from the 3.06 Duo to the 2.3 i7 makes things at LEAST twice as fast.  go for the anti-glare screen, trust me!", "Date": "September 10, 2011"}, {"Title": "Great laptop", "Author": "J. Manning \"bslapu\"", "ReviewID": "RT1ZD1G2AHM77", "Overall": "5.0", "Content": "This is a great laptop, only downside is only apple could sell you a $2,000 plus laptop and onlysupply 4gb of ram standard.", "Date": "August 12, 2011"}, {"Title": "Excellent Laptop", "Author": "Ali", "ReviewID": "R2CNDZJBUHZ0GV", "Overall": "5.0", "Content": "Apart from esthetics and style this product possesses, it is a laptop that will last long and perform competently well.", "Date": "June 27, 2011"}, {"Title": "Longtime PC user, first time MacBook user", "Author": "Kay One", "ReviewID": "R1RIRGGZKUA1SV", "Overall": "5.0", "Content": "As my title says, I'm a long time PC user for the last 15 years or so, in multiple desktop and laptop forms.  My photography hobby demanded I get a machine better designed to handle multimedia applications and digital photo post processing.  Although it's pricy, I decided to go for the 15\" MacBook Pro with the dedicated GPU for extra video processing power and the 750 GB HD for storage.  I can say this purchase was well worth it.  I have used Apple computer products since early college and they gone from being impressive looking but playing catchup to PCs in terms of utilities, to creating their own niche.Coupled with a gorgeous LCD screen and powerful processor.  This machine is a joy to use in terms of ergnomics and performance.  Also it couples well with my Apple brand wireless Magic Mouse and the bluetooth pairing is effortless.", "Date": "June 12, 2011"}, {"Title": "High quality laptop", "Author": "Earl D. Simpson \"Easy-listening\"", "ReviewID": "R30XUH6Z13Q8FF", "Overall": "5.0", "Content": "This is an excellent laptop computer.  Extremely fast and easy to set up.  Apple definitely has the user in mind with MacBook Pro.  I would highly recommend this computer to anyone interested in purchasing a high quality laptop!", "Date": "May 30, 2011"}, {"Title": "Macbook Pro 2.2 15.4'", "Author": "Ahmed Seif Gaara", "ReviewID": "R2Q6JLL3JNLJK7", "Overall": "5.0", "Content": "I bought this product from Amazon, it's good on the overall performance, however it was delivered with a malfunctioned hard-drive, which then I had to replace from Apple store in Barcelona. Now that the machine has been restored, it's working very effectively and it's a high performance machine. I would recommend it to business users, who are looking to be more productive in such a dynamic and fast moving business Environment.However, I would give a short comment to Apple to fully inspect their devices before it's out for sale. this is not the first incidence I experience a problem with technical issues.  I purchased an ipad before from a New York Apple store. It  also had a functional problem and then I had to replace it from Apple store in Tennessee.Being a strong Apple fan, I would much rather have apple double checking their quality aspects of the product before its out for delivery to customers.Thanks,Ahmed S. Gaara", "Date": "May 24, 2011"}, {"Title": "Perspectives from a graduate student", "Author": "J. Liu \"riceboy\"", "ReviewID": "R3GH1YQ5UZ1XMK", "Overall": "5.0", "Content": "Originally, I was going to buy a Dell XPS 15 but eventually canceled my order and bought this Macbook Pro 2.2 ghz 15\" macbook pro. I'm definitely glad I made this decision. I haven't had any problems with my macbook so far and even though it doesn't have the best resolution (it's only 1440x900), it is good enough. I really like the option to install Windows 7 (through the Bootcamp program which comes with the Mac OS X). It allows me to run Windows programs that I need to use for my classes and I still have the option to use Snow Leopard). It definitely is worth the $2000 price tag.If you haven't used a mac before, it definitely is does not take much to become familiar with the Mac OS. I had little trouble learning how the Mac worked and I've been using PCs my whole life until now. I doubt I will be going back to a PC anytime soon.", "Date": "May 12, 2011"}, {"Title": "best laptop i've own", "Author": "Diego Alé", "ReviewID": "R1AF7NODPRHQ68", "Overall": "5.0", "Content": "beautiful and amazing functionality right out of the box, but with RAM and SSD upgrade it's simply perfect!! you wont be needing another computer in 2 or 3 years easily!!", "Date": "May 6, 2011"}, {"Title": "Great Product", "Author": "Pulkit Singhal", "ReviewID": "R1L29ENELZPWOQ", "Overall": "4.0", "Content": "I wanted to give it a 5 out of 5 but not having a Antiglare Display is a really big problem. Too bad I couldn't order it with Amazon because they don't carry it ... but point being I've had non-mac laptops before and even without an antiglare screen they weren't as much trouble to handle as the macbook pro. It is really painful to work with the default screen of the macbook pro. Everything else is top-notch.", "Date": "June 6, 2011"}, {"Title": "Good but not great and at times VERY frustrating", "Author": "Tamlyn M. Hunt \"Enjoying\"", "ReviewID": "R2YZXWYSQP9Y4N", "Overall": "2.0", "Content": "I switched to Apple a couple of years ago after using PCs for 20 years. I fell in love quickly. I now own this 15\" MacBook Pro, an iPhone 4S, an iPad 2 and an Apple TV.But after having my MacBook Pro for almost a year I have to leave a bad review here. I am VERY frustrated with this MacBook. I bought an almost top of the line MacBook so that I could run top of the line software like Final Cut Pro on it and not have to worry about lags, etc.Not only is this not the case, I can't even run iMovie without series hangs and lags.I have not upgraded my RAM but I have not read anywhere that I should have to in order to avoid this problem.I just opened my computer this evening and it took me literally ten minutes before I could use it because it just kept displaying the little color wheel until I finally re-booted the computer. It restarted and opened all the same software I had running before - and then started the little color wheel again. VERY frustrating.When this computer is running well it's really a pleasure. But it's not very often that's the case.Last, the battery life projections for this computer are a joke. I've never gotten more than three hours even with fairly light use and it's advertised as having up to 8 hours use. A little truth in advertising please. And of course over time battery life steadily declines.All in all, I want to love this MacBook, but I can't. At least not all the time. Two stars. Bad Apple.", "Date": "November 1, 2011"}, {"Title": "Has potential but there are a ton of little problems that detract from the experience.", "Author": "J. Mulnix", "ReviewID": "R1EZGB69QN5363", "Overall": "4.0", "Content": "Review updated, see below.Overall this is without a doubt the fastest laptop I have ever used.  Period.  My complaints start with the fact that if you use either Chrome or Firefox and set the brightness of the display to between 50-60% you will not get the advertised battery time.  I struggle to get 4 hours, usually I get about 3 instead of the 7ish that Apple advertises.  Another complaint I have is with the heat this laptop puts off, it is hot enough to be at the maximum of what Intel recommends for the i7.  I have recorded processor temperatures above 200 degrees Fahrenheit.  For a $2,200 laptop this is unacceptable.  Old Pentium 4 Dells from a decade ago ran cooler.  The case seems to be designed with visual aesthetics in mind, not good thermal management.  As for these two issues I have spoken on the Phone with Apple support and supposedly high temperatures are within \"normal\" and the battery life can very.My last major complaint is with the Thunderbolt port, all it does is cause problems.  I have a Samsung Syncmaster that works occasionally with this computer.  Another problem is my MacBook seems to think that I have a monitor hooked up even when there is nothing plugged in, whatever program I used on the external monitor does not show up on the laptop screen.  Even after multiple restarts and shutdown/power on cycles I still have this problem.With all of the little nagging issues I and numerous other users have had, read the apple forums, I can't recommend that someone spend over $2K on this laptop.  Until there are driver updates to fix all of the issues me and loads of other users have experienced I would say hold off on the purchase.If Apple issues updates I will gladly change my review but until they admit there are problems with cooling and Thunderbolt I can't give this laptop a higher score.Apple please fix these issues, they seem to be very widespread!Update 1: Apparently I have angered the Apple gods because I now have a keyboard that will not backlight even in a dark room, really Apple?Update 2: Another issue I can add to my growing list of irritations with this laptop.  It takes anywhere between 45 seconds to over a minute and a half for my laptop to go to sleep.  Either closing the lid or using the keyboard shortcut to sleep the computer results in a lot of waiting.  It is quicker to shut the computer down and restart it than it is to sleep it for me.Update 3: After using this laptop for about 2 weeks now I am overall satisfied with my purchase.  There are still a few issues I have but unfortunately the heat issue seems to be a problem across all MacBook Pros.  For some reason the screen and keyboard dimmer issues I had are now gone.  Sleeping still takes a while but its tolerable.I will say this laptop is FAST.  Rendering 720p video is near real time.  If you have a 10 minute video expect the render time to be about 10 minutes.If you can splurge get the SSD option, its the one thing I am doing as soon as the price of a 500 gig SSD comes down to a reasonable amount.  Except for the heat this laptop puts off I am very happy with my purchase.  The overall experience is very good.  On a minor note I am pleasantly surprise at how much I enjoy typing on the keyboard, coming from a ThinkPad keyboard I have VERY high standards for my laptop keyboard, and while not as good as a ThinkPad the Pro's keyboard is still very nice.If you need to do video editing, photo work, or any graphic design and you need to be mobile this is the laptop for you!", "Date": "April 4, 2011"}, {"Title": "The best", "Author": "Wo", "ReviewID": "R1XCD9J1ZXQAD", "Overall": "5.0", "Content": "This is a great product. I had a 10+ year Macbook pro and finally wore it out. This one is beautiful and slimmer. I have had no issues with this laptop and just love it.Highly recommend it.", "Date": "August 27, 2011"}, {"Title": "Use this as a portable editing station for Final Cut Pro 7 and Avid Media Composer", "Author": "Jesse Chapman \"waitreally\"", "ReviewID": "R2HCKQ09H7TGS8", "Overall": "4.0", "Content": "This laptop is a step in the right direction for Apple, for the most part. Everything on it sings with speed and versatility. The only issue I found with this is that the speakers are definitely quieter than the non-unibody laptops (which was my last laptop). This is a shame because I use my speakers quite a bit and have to have them turned up all the way all the time, and that's often not loud enough for me.", "Date": "July 10, 2011"}, {"Title": "Very old and damaged version", "Author": "Axel", "ReviewID": "R2Q8D5LW0RGV2E", "Overall": "1.0", "Content": "This was NOT definitely the computer that I was specting, it is very old, the processor is just a intel core 2 duo, it has at least like 3 and half years and the condition is very damage, even has huge strike!", "Date": "January 11, 2012"}, {"Title": "Don't believe the hype", "Author": "AddedC", "ReviewID": "R3HW25C5UVI5ZM", "Overall": "1.0", "Content": "Mac has set a pretty highbench mark for themselves with their \"I'm a Mac, You're a PC\" advertising\".  Their laptop products, however, do not deliver on that promise.  I use both Mac and PC at work so I am familiar with the OS.  However, it definitely is not worth 3 times the price of comparable PC laptob to buy a MacBook Pro.  Plus you are also likely to find a lot of incompatibly issues.  In my case my MIDI devices no longer work for music studio functions and my video cameras are not supported by the new IO ports on MacBook pro.  It has really been nothing but frustration and nothing like the promise.  Wish I had just bought a PC laptop.  Would have cost me a third of the price.  I would likely have experienced some of the same frustrations, but at least I wouldn't have been deceived into expecting an easy ride.  And the work arounds likely wouldn't have been proprietary from Mac only $35 cables.  Don't believe the hype and don't pay the premium for Apple BS.", "Date": "September 24, 2011"}, {"Title": "DEFECTIVE LOGIC BOARD", "Author": "Christian C. Flook", "ReviewID": "R2U7PAE6RWUAZN", "Overall": "1.0", "Content": "Got it from AMAZON WAREHOUSE DEALS and the logic board is messed up and I have it repairing at my local apple shop. Very disappointed that this is supposed to be tested and functional like what is says on the unit but obviously it really was not. So buyers be aware you may get a defective unit and if you want to save a few bucks but maybe have to go thru the hassle of fixing it because it is still under warranty go right ahead but like me if you really didn't have time for repairing it don't risk it.", "Date": "September 15, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core i7 Processor 2.2GHz\n4GB SDRAM RAM\n750GB 5400RPM Hard Drive\n15.4-Inch Screen\nMac OS X v10.6 Snow Leopard", "Name": "Apple MacBook Pro MC723LL/A 15.4-Inch Laptop (OLD VERSION)", "ImgURL": "http://ecx.images-amazon.com/images/I/41hmyhKEl4L._SX300_.jpg", "ProductID": "B0017HSZWK"}}