{"Reviews": [{"Title": "Great deal!", "Author": "Angelina", "ReviewID": "R17QSEWA08P8KG", "Overall": "5.0", "Content": "It's been excellent so far! For a broke student who needs to do homework and wants to surf the net this is perfect! It came with Microsoft Office already loaded, thank you so much Shaoni-Inc. So I basically got a laptop for the price I would normally pay for Microsoft Office which I have to have for school no matter what. Shipping was lightening fast too . Only thing is, I didn't realize how old this laptop would be but I wasn't really expecting much for the price so it wasn't a huge shock. Although it is old, it is working darn near perfect. It started up right out of the box and for now the battery seems fine. The only issues I've had at all is that the java was out of date (naturally) and the letter T was sticking at first but after a few minutes of use it was better, oh and it is just slightly noisy (of course). Also although a bit of an older version I can't say enough how wonderful it is to have Microsoft Office. It also has good image quality, decent sound, and plays videos/you tube fine. I have even been able to play some games such as Bloons TD5, Papas Freezeria, and Candy Crush. It doesn't meet the requirements to play the newest stuff but actually it comes really close. I have to say this used laptop is 1000 times better than the Google Chrome laptop that I bought brand new and had to return when I realized it wouldn't even open up my school's website, let alone run any of the programs I need. Thanks again  Shaoni-Inc!", "Date": "December 27, 2013"}, {"Title": "Laptop", "Author": "F. Odell", "ReviewID": "R1EKAUFWCPLMN7", "Overall": "5.0", "Content": "I received Laptop on time and in excellent condition. It was more that I expected. Worked right out of the box. Even the battery was charged (smile). I am using it right now to write this review. I am excited and will visit this seller again with more orders. Getting some online courses done now will be a snap. Thanks.", "Date": "July 7, 2012"}, {"Title": "Thinkpad laptop", "Author": "ethanking", "ReviewID": "R1OXS7697J09V1", "Overall": "4.0", "Content": "it is good for me and all i need to do with it..which isnt much..but at times it slows down while on internet but most the time its a great comp", "Date": "June 14, 2011"}, {"Title": "Thinkpad T Series", "Author": "Kenneth W. Thomas", "ReviewID": "R3GN4QRN11GT0I", "Overall": "5.0", "Content": "This is a very well made business laptop computer. Even though it is a few years old, it can perform every task and program that I need. I use mine to process my photography and research on the internet. I now see why the Thinkpad name is held in such high regard. Truly a superb computer.", "Date": "June 17, 2010"}, {"Title": "Nice Laptop", "Author": "Wesley Calhoun", "ReviewID": "RU4KHTEIQP8TK", "Overall": "5.0", "Content": "When i was looking to get another computer wasn't sure I wanted a laptop.As it turns out It was the best thing I could have done. It does so much more than I expected. The wireless part of the computer is great; the mobility is just what Iwas looking for ,it goes anywhere.This I would recomend to any one who is looking for a nice and light laptop with a number of useful features.", "Date": "July 4, 2010"}, {"Title": "Excellent Service and product works well", "Author": "CWriter", "ReviewID": "R38CJJ1KPKTS9P", "Overall": "5.0", "Content": "My nephew needed a computer for his school work...and, of course, to play online games.  I was really surprised to received this brand of laptop at the price.  It arrived much earlier than I excepted, and it works perfectly.  He is thrilled.  Thanks.", "Date": "September 6, 2011"}, {"Title": "care in the packaging-cuidado en el empaque", "Author": "Alexander Molina", "ReviewID": "RE81VQMTC4IC0", "Overall": "5.0", "Content": "good day through this I want great care is taken to the packing of the products used, as he handed the product arrived with broken screen. COORDINADORA USA according to the company that transported the product from the international box (USA) to Colombia Bogota DC used to be a product the company is not responding. Please keep in mind this information to the proper packaging of products used.buen dia,por medio de la presente quisiera que se tenga mucho cuidado al empaque de los productos usados, pues al entregarme el producto llego con la pantalla rota.segun la empresa COORDINADORA USA que transporto el producto desde el casillero internacional(USA) hasta Colombia bogota D.C por ser un producto usado la empresa no responde.por favor tener muy presente esta informacion para el correcto empaque de los productos usados.", "Date": "April 17, 2011"}, {"Title": "Item was in excelent condition.", "Author": "Marie Diallo", "ReviewID": "R2B6NOX8KU2D19", "Overall": "4.0", "Content": "The merchandise received was in excellent condition and it did not took too long to receive it.", "Date": "August 21, 2010"}, {"Title": "Didn't Work", "Author": "Pat O", "ReviewID": "R2NFVDS044LRQJ", "Overall": "1.0", "Content": "First, the seller refunded the money with no problems other than wanting to know exactly what was wrong.  We had 3 other computers that were working with the modem in our home.  However this would not work with the modem.  Therefore no internet access with it and there was a problem with the cd part of it also.", "Date": "April 5, 2014"}, {"Title": "Will not...", "Author": "B. Rodgers", "ReviewID": "R1ID6YPATUYGU3", "Overall": "1.0", "Content": "Rate this with a positive attitude or remark,not happening. SOMEWHERE, along the line someone removed the LCD from the Device and did not put instructions in to reinstall the thing or let me know where it goes! For that lack of information, I know where a huge Dumpster is located! No lights on!", "Date": "September 24, 2013"}, {"Title": "AMAZING", "Author": "Temis Clark", "ReviewID": "R35OUV2E0W1AES", "Overall": "5.0", "Content": "Great battery life: 3 hours. Old notebook with Win XP. Just what I needed to play my old games that didn't work properly with Win7. Strong system old IBM hardware. Highly recommended.", "Date": "August 27, 2013"}, {"Title": "Time to Upgrade", "Author": "Aramovich \"Aramovich\"", "ReviewID": "R1EUT2F6XWXE3T", "Overall": "3.0", "Content": "Bought this when my original T42 gave up the ghost to avoid the hassles of getting a new machine, such as new operating system and reinstalling programs whose program discs I misplaced two moves ago. But the lack of memory, which makes it very slow sometimes, has me finally considering keeping it and still buying a faster, slicker machine.  What can you say.  A good steady workhorse that is probably ready for pasture.  Long live the T42", "Date": "August 22, 2013"}, {"Title": "Love It!!!", "Author": "Leanor Williams", "ReviewID": "R1VF6ZARGQEYJV", "Overall": "4.0", "Content": "This is a very good computer. My Only regret is that I did not purchase one for my son also. I can surf and do all my studies. I love this computer and will recommend this to anyone. My 14 year old son use it to chat on Facebook, watch Movies and  YouTube Video. I don't be fooled by the looks and some of the comments. This exceeds my expectations. For a temporary computer. I got more than I bargained for. This is just as fast as the Toshiba  laptop I borrowed for class. But I love this more. No freeze and smooth operations.", "Date": "August 7, 2013"}, {"Title": "great laptop", "Author": "sam", "ReviewID": "R3FOA6IDH4PT0E", "Overall": "5.0", "Content": "I just got the Laptop in the mail It came quicker than I expected And was handled properly by the carrier The only thing that was wrong when it came to pack was that the CD Drive with left open But no harm was done to the laptop its in perfect condition And I got on the internet right away its Running fast I definitely recommend this I bought this laptop to run FL Studio", "Date": "August 3, 2013"}, {"Title": "Great buy", "Author": "Cecil.c \"Computer Guy\"", "ReviewID": "R2BA1CGSAESBE1", "Overall": "5.0", "Content": "This laptop is just awesome i bought it worked great great for videos and i make a video tutorials easy to carry around ships fast . it worked till my brother dropped orange juice on it . and the battery life is good better than the laptop i have right now its cheap and better buy", "Date": "April 24, 2013"}, {"Title": "Great company, product did not work for me.", "Author": "jrairick", "ReviewID": "ROIWF8I8C0A8M", "Overall": "3.0", "Content": "Service by the company was excellent.  The computer must have been too old to handle today's technology online.  Had to return it.", "Date": "April 6, 2013"}, {"Title": "Nice Laptop", "Author": "Thomas A Webb", "ReviewID": "RNMBVK9YPCC1L", "Overall": "4.0", "Content": "I purchased the laptop for my 16 year old son.  I didn't think MS Office 2003 would be installed on the computer; I actually upgraded this to Office 2010.  The package arrived in a timely fashion and it had meet our expectations.  Overall, I very pleased.Thomas", "Date": "April 5, 2013"}, {"Title": "Great customer service", "Author": "Frank Buettner", "ReviewID": "R13BAPPWHIYZL5", "Overall": "5.0", "Content": "When received, laptop had a faulty DVD drive. They replaced the faulty unit quickly and without question. Very satisfied with the product and the level of service.", "Date": "April 2, 2013"}, {"Title": "works for about...well it doesn't work at all. broken machine.", "Author": "Enoch Arhinful", "ReviewID": "R1RRRED3EOTYWM", "Overall": "1.0", "Content": "works for about...well it doesn't work at all. broken machine.  squeeks for about 24 minutes before making an attempt to wake up when booting on.", "Date": "March 8, 2013"}, {"Title": "Laptop ok but wifi wasnt working", "Author": "Tavares", "ReviewID": "R2ZPTG2KTWIP0M", "Overall": "2.0", "Content": "arrived early in fare order but wifi wasnt working properly. Ask before you buy, its ok if you wanna use internet at home, but if you use or need wifi in coffe shops or restaurants theres no working wifi. 2 outta 5", "Date": "February 15, 2013"}, {"Title": "Just perfect for my needs", "Author": "Pat Burke", "ReviewID": "R29K3CHQZ4WMBS", "Overall": "4.0", "Content": "This is a great entry level laptop for my son.  He needed a computer to do simple research and type his papers and that is what this is. He already has his fire hd and touch  for video and gaming.", "Date": "December 9, 2012"}, {"Title": "I decided to get a refurbished laptop for my daughter for christmas and completely haoy with the purchas.", "Author": "elizabeth wilcox", "ReviewID": "RXXZ4GM2R8Z1F", "Overall": "4.0", "Content": "Happy with my purchase , can't beat online ordering. When I recieved it I toyed around with it. my daughter will love it.", "Date": "December 9, 2012"}, {"Title": "Nice Stuff", "Author": "Chuks", "ReviewID": "R2901X28E69P7A", "Overall": "5.0", "Content": "I bought this item for a friend and he confirms that the product is in good working condition as was advertised. I am happy for that.", "Date": "August 12, 2012"}, {"Title": "Great Laptop", "Author": "Brendon", "ReviewID": "R3PINSJD096LC4", "Overall": "4.0", "Content": "Well i got this laptop for 141 dollars and it was almost perfect. When I opened the laptop it was awesome until I recieved a message from the message center. It said battery charging but consider replacing your battery. I was shocked but at least the new batterys are cheap. So to sum it all up. Good laptop, Fair Pricing, but only four stars because it had a bad battery.", "Date": "July 14, 2012"}, {"Title": "Can't beat the price", "Author": "Sean", "ReviewID": "RL07Z4EZRXWIZ", "Overall": "5.0", "Content": "At this price, cheaper than a netbook, the price is great! I did invest in a ram upgrade, but it is still very cost effective. Great shipping too!", "Date": "May 11, 2012"}, {"Title": "review of Thinkpad", "Author": "Amazon Customer", "ReviewID": "R1DQH5FVLSVLN5", "Overall": "1.0", "Content": "The Thinkpad had a blurry screen. I've had it less than a month and now it has crashed and doesn't work at all!", "Date": "December 23, 2011"}, {"Title": "IBM T42 Laptop", "Author": "John L. Bowen", "ReviewID": "R1670PA1JCXIE", "Overall": "5.0", "Content": "I wanted, basically, a word processor that would run my old software and that is exactly what I now have. It is clean as a pin and looks and acts practically new. For the price, I couldn't be more pleased. It has become one of my prized possessions. I know it won't, but I hope that it lasts forever.The last T42 that I bought used lasted a year or so and was well worth it.", "Date": "February 24, 2014"}, {"Title": "Extremely poor product! Started having problems the day after it arrived!", "Author": "M. Okure \"Millions\"", "ReviewID": "R3EWM9GCVX3SRJ", "Overall": "1.0", "Content": "This product deserves less than a star rating. It started having a series of problems a day after I received it. It currently goes into blue screen mode maybe 5 or so minutes after startup.", "Date": "September 23, 2012"}, {"Title": "NO WIFI and more..", "Author": "josh", "ReviewID": "R3L2UBP01Z9XLD", "Overall": "1.0", "Content": "This was the worst I've ever spent my money on. Its a complete disappointment. The battery dies in literally 15 minutes at full charge, there's no wifi whatsoever, I had to buy my own Wifi adapter just so i can even have wifi on this thing, and the windows XP is so outdated, AND the computer is too slow to comprehend simple prgrams, ANNDD it has almost no space to even have music on here. DON'T BUY. You have been forewarned.", "Date": "September 1, 2012"}, {"Title": "Great with this price", "Author": "amasom", "ReviewID": "R27A312XMR7H12", "Overall": "3.0", "Content": "It does not work fails to connect to wireless untill you modify the wifi drivers and add more memory, you need to be expert to install the drivers and memory card buy etc.but with this price it is good I spend another 25$ to buy the memory card and downloaded the drivers. Now it is great computer -ver fast and working without any issues so far.", "Date": "June 2, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001QGGL3W"}}