{"Reviews": [{"Title": "Great build quality", "Author": "KK", "ReviewID": "R1PVO06JVRLQ1U", "Overall": "4.0", "Content": "The build quality of this laptop is great, much better than the home-grade HPs and Dells I used to use. The laptop is quite fast in spite of a load of Sony bloatware. Windows System Rating in Vista is 3.8, may be because of the lack of a dedicated graphics card.UPDATE: I bought two of these for my friends overseas. The display of one of them died after 6 months. She did not get warranty service as she is outside the United States.", "Date": "April 19, 2009"}, {"Title": "This junk really breaks my heart", "Author": "Tao Yu", "ReviewID": "R3M9PPOOXJVR6C", "Overall": "1.0", "Content": "I just bought this pink pc over 1 year and During those times , i haves changed 3 fans. Now ,it totally breaks down,3 months ,Belive me I was very careful and friendly to my PC.I can't turn it on anymore , i don't want spend one cent on this junk !  the price is around 850 dollars when i bought it, I choose it from Mac just because it looks cute. I belive it is because the poor fans caused my mainboard overheat and makes it burned!  sony denied to make repaire cause it is out of insurance !!!! I SWEAR TO GOD !NEVER EVER  BUY A SONY PC  ,although their customer survices are friendy !! But this junk really breaks my heart .", "Date": "July 23, 2010"}, {"Title": "Cooler fan noise", "Author": "Henrique Wajnberg \"Henrique\"", "ReviewID": "R1BU3NPVGJ5PVB", "Overall": "1.0", "Content": "I bought one Sony Vaio VGN-CS115D on OCT 2008 and after four months of use it started to make a noise that became worst and worst. Now I am having a problem with the cooler fan and I have to buy one new, because I am not on Canada and how is difficult to find the spare fan. I called Sony phone and lost a lot of time until I got the wright sector. Now I am waiting the new cooler fan as it is supposed to arrive just on 3 weeks.After 1 week of waiting the coolerfan arrived, it was exactly the spare part I needed, so the problem was solved.Bu I will keep my classification because it is a mechanical problem that happened in lass than 1 year.", "Date": "May 23, 2009"}, {"Title": "Piece of junk", "Author": "Kyle G. Kyzer", "ReviewID": "R3AEVGBBJ1CUD2", "Overall": "1.0", "Content": "The computer worked great...until I had to replace the fan.  That was fine--I had bought the extended warranty, so that was no problem.  However, now the fan needs to be replaced again (1 1/2 years later) and the motherboard needs to be replaced as well because the connection to the input for the charger has a short.  I'm selling this piece of junk and not buying another sony...", "Date": "November 26, 2011"}, {"Title": "Stylish, good PC, NOT a Mac.", "Author": "Eduardo Reyes", "ReviewID": "RDKVDTLOECTH3", "Overall": "4.0", "Content": "This PC gets the job done without even looking like a PC yet make not mistake, you still have to put up with the endless list of updates every other time you log in, download a bunch of drivers when you do upgrade to the new operating system, find your way out of compatibility issues especially 64bit-related and so on and so forth. So if you want a mac killer just get a better mac. If you just want a \"nice\" (that's what people call mine), decent PC for your buck: this is a great choice.", "Date": "April 8, 2010"}, {"Title": "Excelent computer", "Author": "Guille", "ReviewID": "RRWCPFVF6E25B", "Overall": "5.0", "Content": "This is a very nice computer and it works perfectly. Very easy to use and keep updated and get support. I am very satisfied. It also looks great on the photos and once you have it in front of you, it does look great, not just on the photos.", "Date": "June 9, 2009"}, {"Title": "Lovely and stylish laptop!", "Author": "Gary Hendricks \"www.best-laptop-guide.com\"", "ReviewID": "R2D66YEKBY2LZ0", "Overall": "5.0", "Content": "Pros:* Super stylish number with very nice LEDs and a sexy pink color* Powerful specifications (Intel Core 2 Duo, 250 GB hard drive, DVD writer)* Fast graphics and wireless connectivity* Ample USB ports, Firewire* Solid software because it has 64-bit Windows Vista Home Premium with SP1Cons:* Not all might like the pink color* Typing on keyboard gives some noise (not very silent)* A lot of bloatware - you might want to remove them", "Date": "May 21, 2009"}, {"Title": "New Sony Vaio", "Author": "Lee A Hunt", "ReviewID": "R2GRC3ZVSH4ZFU", "Overall": "5.0", "Content": "I really like this laptop. It is lightweight and very easy to configure for initial use.", "Date": "May 18, 2009"}, {"Title": "Good stuff!", "Author": "Andre L. Silva", "ReviewID": "R4FMKRSXAATDS", "Overall": "5.0", "Content": "All expectations done.The product is really good. A friend of mine bring me this Laptop. It's something we don't have down here.I recommend.", "Date": "March 6, 2009"}, {"Title": "AWFUL - DO NOT BUY A VAIO", "Author": "Bell Harrah \"Bell\"", "ReviewID": "RVSY02DUR6SIP", "Overall": "1.0", "Content": "Vaio's are terrible computers. Mine has been incredibly slow since I bought it and now my hard drive stopped working properly and I can't turn it on. When I went to the Sony website for help they told me it would cost $280 to fix. Outrageous. I had an HP for five years with no problems, Vaio's are garbage, don't waste your money.", "Date": "May 13, 2009"}, {"Title": "Sony Vaio Not Worth the Money", "Author": "BWATT", "ReviewID": "REIKHSEMB91VB", "Overall": "1.0", "Content": "I bought my daughter a Sony Vaio VGN-CS215J in April of 2009 as a graduation gift, to take to college the following fall.  By November of 2009 the power cable would no longer stayed plugged in and the battery would not charge.  Sony was good and did have someone come to the house to make the repair, but it took 4 months to get that accomplished.  Now, the hard drive has crashed.  I will NEVER buy another Sony computer!", "Date": "April 19, 2011"}, {"Title": "Disappointed", "Author": "youngernow", "ReviewID": "R2U7AHGH4GIQ5L", "Overall": "2.0", "Content": "I purchased this laptop in February 2009.  As of November 2010, I am completely dissatisfied.  At first, I was impressed because it had the built-in memory card readers, which is really convenient.  However, the screen has completely gone out.  I'm just going to go with the old stand-by, Dell.  Never again will I purchase a Sony.", "Date": "November 29, 2010"}, {"Title": "Nice computer, but having comflict w/the vista", "Author": "$implicity", "ReviewID": "R3AZXPLVHIHWY8", "Overall": "4.0", "Content": "Just received my Sony gorgeous pink laptop and tried to hooking  my new matching Microsoft wireless mouse up to USB.  Microsoft Vista recognized the mouse but the mouse will not operate.  I also tried hooking up my new Kodak all in one printer without success.After spending over 5 hours on sunday tt Sony technical support I was no more ahead than when I first started.I now have a computer tech coming tomorrow to either get the mouse working on vista or downgrade me to XP.I am not faulting Sony because it is a great product and almost everything I own that is electronic is manufactured by Sony.  The problem lies with Miscrosoft Vista!", "Date": "February 23, 2009"}, {"Title": "CROOKED!!", "Author": "Shannon F. Courtenay \"S Hotch\"", "ReviewID": "R1UNQL4OMAORMW", "Overall": "3.0", "Content": "So my boyfriend bought me this laptop three months ago. It had been working just fine and then a few weeks ago it got to where it wouldnt charge. I called customer service and they asked some questions and they said it sounded like the actual jack was messed up. So they mailed me a prepaid box and said they would take care of it. It came with a one year warranty and we bought an extra four years.So I get a message sayin I have to pay [...] bucks for them to fix it.THATS ALMOST A BRAND NEW ONE! We call and they say that the motherboard is also messed up. Ummm I dont think so! They say my warranty wont pay for it. The tech was supposed to call us and when he finally did he said he found other things wrong with it...like the mouse thing. What???Then they accuse me of breaking it on purpose and stuff. Who in their right mind would do that? They said they even called and got a \"confirmation\" that thats what happened? HELLLLOOO? WHAT? Who would they call? LOL....So they are mailing it back to me....Best Buy said they would fix it for free. I should have just went there to begin with than dealing with crooks like SONY!", "Date": "May 4, 2009"}, {"Title": "Do not buy this laptop--or any other Sony laptop", "Author": "Abagail Bloodworth \"WiseOldUnicorn\"", "ReviewID": "R2G8YZHZLDT8E5", "Overall": "1.0", "Content": "Long story short, this laptop was just fine for a year or so. Not fantastic, but I didn't have any major problems with it. Then the fan started to make a ridiculously loud noise. I go online, find out it's a known issue, called Sony, and had them come fix it for free. No problem. Then the screen starts flickering and showing horizontal lines across the bottom, which gradually gets worse until the screen is basically unusable. I go online, and find out that this is also a known issue, which Sony offers a five-year extended warranty for. After sending it in to Sony, they now refuse to fix it because of what they claim is corrosion due to liquid damage. To my knowledge, no liquid damage had been done to the laptop, so I asked for pictures. The pictures they provided are nothing but dirt and cosmetic damage, which is going to happen with a 3-4 year old laptop. Last time I checked, being dirty did not void your warranty. None of the so-called \"damage\" has anything to do with the issue at hand, which is the fact that Sony produced a laptop that eventually begins to have problems with flickering in the screen. They KNOW they produced a laptop with this issue, yet they refuse to fix it. I have been around the bend several times with Sony customer service, and this whole experience has turned me from a loyal, dedicated Sony fan to someone who will never buy a Sony product again.To summarize: Sony refuses to stand by their products, even for problems that they acknowledge are their fault. I will never buy Sony again, and I would advise anyone reading this to not do so either.", "Date": "September 27, 2012"}, {"Title": "VGN-CS215J Don't buy it!", "Author": "Lily", "ReviewID": "R37H20M907YHA6", "Overall": "1.0", "Content": "Sony recalled about 535,000 Vaio laptops world-wide due to a temperature-control defect causing excessive heat and distorting not only the shape of the laptop !I will never ever buy another Sony laptop.Don-t buy the VGN-CS215J you will have hundred of problems!My laptop not only re-heating but also the pointing device was broken[...]After only 5 months of having bought my laptop I started  having all kind of issues  with it.Now I am having problems with lines accross the screen and I read Sony has recalled VGN laptops for having this fattory defectDON'T BUY IT! HAVE A LOOK ONLINE AND YOU WILL SEE MANY PEOPLE REPORTING PROBLEMS ALSO WITH LINES ACCROSS THE SCREEN FOR VAIO SONY LAPTOPS!!! VGNI used Dell and Mac for long years never had any problem.", "Date": "May 11, 2012"}, {"Title": "Bloat ware makes using difficult", "Author": "Daniel Greenman", "ReviewID": "R28YHT4RHRNAHE", "Overall": "1.0", "Content": "I bought a sony laptop for my daughter before going to college. It's a great computer BUT the (adware, bloatware, free trial software) is terrible.As an example the free trial  (Adobe pro soft ware)(a program that does not work till you register and pay extra) stopped her from loading (Adobe reader, (a free program)) My daughter needed Adobe reader to get homework assignments. So she had to go to the computer lab.I will not buy another SONY computer till they stop installing useless, advertising software.", "Date": "March 15, 2009"}, {"Title": "Horrible Experience with Sony VAIO", "Author": "New Sony Hater", "ReviewID": "R2BALND4HTEHJY", "Overall": "1.0", "Content": "After receiving the product less than a week, I couldn't turn the computer on successfully. The black/blank monitor just keeps showing even restarting it for a hundred times. Jesus!! I was very pissed and wanted to throw it away. Then, I decided to call its customer service and received very good assistance. He analyzed that the problem occurred from \"Windows malfunction\"?!!! How could that ever happen for a brand new computer with 6 days of usage. Anyway, I had to reinstall it to the factory setting for about 2 hours. Plus, all data has been lost for good.It's been a bad half-day morning without any productive work as I was being stuck with the stupid thing like this.Oh well, it's my first time with Sony laptop and surely will be my last.BTW, I also purchased Dell XPS M1330 prior to this like a month ago for my sister. It's been working very nicely. Love it!!", "Date": "May 13, 2009"}, {"Title": "Worst product in globe", "Author": "cpabi \"Beware with Sony Product\"", "ReviewID": "RDK2JZAWU6L4S", "Overall": "1.0", "Content": "Hi All,I own this pink sony viao which is one of the worst product I ever seen.Just wanted to share some facts related to this product dont go with looks as I did same mistake ,It works good for few months then I bet u will have same problem Belive me i send this same Pink color sony vaio laptop to repair center 3 times in 1 year.However wanted to convey or spread message to all buyers ,friends and collegue not to buy this sony vaio product in your lifetime belive me.", "Date": "February 24, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001MS6NP0"}}