{"Reviews": [{"Title": "Powerful Workstation", "Author": "®", "ReviewID": "R14VUQXRNOW5Y6", "Overall": "5.0", "Content": "Well it is an entry level workstation, but has a professional graphic card not the gaming one. Basically the different are the drivers. I think 15\" widescreen is the good balance between portability and getting some work done on a good size screen. The version I ordered from Lenovo is almost max out with the newer technology. I use N draft at home with 5 GHz frequency. When I go to a coffee shop I have no problem connecting to G and B routers. There is also a wimax which is the next big thing that I don't use or have service. There is a little keyboard light which is cool, but I don't use either; gaming laptop have glowing keyboard.Features:I can't live without the rubber head mouse; I went one generation last time with a Sony Vaio SZ and had to go back. Mainly Lenovo ThinkPad and Dell Latitude laptops still carry this feature. I got to say I like the design of this laptop better than any of the new curvy edge shiny one you can find at electronic stores. Maybe the new Latitudes look very cool and modern too. Displayport (can use hdmi converter) is a great plus while the PC input is still there. I go the turbo memory and I didn't think its made a differences to the boot up speed or software performance. There aren't really any bloat-ware, but some Lenovo system softwares are hogging too much resources. Loading was a fast as my old Sony Vaio SZ, which is much slower than regular computer, which I wanted the turbo memory would fix, but didn't. I use my finger print scanner to save passwords and that is a feature I have grown to like more and more everyday.  I connected my bluetooth keyboard to this once.Built quality is good,The speakers went out after a week, but I sent it in and Lenovo fixed it. Also on the way back the hard drive got damage and they sent me a new hard drive and disc so I install the OS. Overall it is solidly built; layout is very good, only flimsy part is the area over the PC express card. No dead pixels or weird screen things.Performance:I have Photoshop CS2, sometime do Sketchup and Google earth. There is only a very small difference between my laptop and PC with this software; only on bigger files. I hardly ever lose any connections with my D-link N draft router and this laptop. N draft is better than G, I did lose connection when I had an old g router. I stream Netflix and Hulu and it is almost as good as the hardwire connection of my PC. Beside the boot-up is a little slow, I can say this is powerful enough to replace my PC on most tasks. I thought battery these days will last longer, but they really don't, even if the wifi off. I did a movie test on full charge. Sadly this laptop battery didn't last as long as my 2002 Dell Inspirion 8200 for the movie \"Star War\" but not by much. I did turn the wifi off. The Vaio performed about the same as this Thinkpad.ServiceI got to say Lenovo is a lot better than Dell. I never had to use Sony. They got my laptop fixed after I sent it in and tracking and call them was very easy. They want to please me, where Dell thought I was stupid (back in 2002). They had diagnostic they told me to do and immediately knew what the problem was hardware or software. They sent me 3 different installation discs. I guess I didn't make myself clear; I got Vista Professional 64bit. They assume things are 32 bit and Vista home if you don't tell them, which I guess I didn't.I will buy from Lenovo again, and told my brother the same. Quality and service is top notch. Only the speakers went out for some reason.", "Date": "June 25, 2009"}, {"Title": "The last great non-Apple laptop", "Author": "Amazon Customer", "ReviewID": "RCHANT7QZUN51", "Overall": "5.0", "Content": "This is one of the best laptops I have ever owned.  What drew me to it was the availability of a WUXGA screen in a 15\" format, but there are many features I love.  It's 2014 when I write this review and this laptop is still my main as I debate on which one to replace it.  I normally have 6 desktops running at once running: Open Office, LyX, Matlab, Autocad, Chrome, Thunderbird, Zotero, GIMP, and whatever other applications I am using, and it's only recently starting to slow down.Pros:Screen: The best feature of this laptop is the WUXGA screen, it is the most powerful non-apple computer you can buy with a high-resolution 16:10 screen.Waterproof: The computer is basically waterproof, you can spill liquid on the keyboard and it will safely drain through the system.Battery: Battery life is decent, on the order of 3-4 hours with a new battery.Build Quality: Build quality is superb, my laptop is scratched and nicked, but works perfectly.Ultrabay:  I love the thinkpad's ultrabay which allows you to install either a second battery, a cd drive, or a second harddrive.Cons:The main con is that it is the last professional quality thinkpad produced by Lenovo, leading users to head to Apple.Screen brightness: While the screen is the highest resolution you will find in the 16:10 format that is not on an Apple branded laptop, the brightness is to be desired.  It is impossible to use this laptop outside during the day time.No HDMI: It only has display port output, which is OK as you can remap it to HDMI with a $5 adapter, but HDMI is pretty much the standard for digital out.  The Display port also doesn't carry an audio signal, which can be a hassle if you wish to incorporate audio to a presentation.This is a fantastic laptop, and it well exceeded my expectations in every way.  This will be replaced by an Apple, ironically not so I can use Mac OS which will be removed, but so I can have a high resolution screen in a portable 15\" non-widescreen package.", "Date": "February 21, 2014"}, {"Title": "excellent performance, durable and reliable", "Author": "Anthony Carrabino", "ReviewID": "R1MZGZGJ4VF83F", "Overall": "5.0", "Content": "I purchased the W500 Thinkpad when it was released in 2008 and it's still going strong. This was my first Lenovo computer and it's been such a good experience that i just recently purchased the Lenovo Thinkcentre m92p desktop. I now basically always look to buy Lenovo first. I'm a technology worker and i can assure you that i put the w500 through it's paces, running some of the most demanding software on it such as the Adobe CS suite, Microsoft Visual Studio and more. One primary reason to get the w500 (initially, for me anyway) was the huge 1920x1200 screen resolution. Anyone that does graphics or programming, engineering, or heavy research will benefit greatly from this resolution. This computer is designed for productivity workers, technologists and designers. I see a negative review below and, well, i'm not sure what to say about that person's experience but my experience with Lenovo since 2008 has been awesome. I highly recommend the w500.", "Date": "November 10, 2013"}, {"Title": "you'll regret it", "Author": "Breanna Brown \"Bre\"", "ReviewID": "R1MFU7DYBDZPZ6", "Overall": "1.0", "Content": "Don't waist your time. I go to a technology heavy university filled with nerds. Out of over a thousand students with the same school issued laptop not one student has anything good to say about lenevo thinkpads. My class got the w500 and it sucks. The fan has had to be replaced twice now, and the computer still over heats. If you like running creative programs then don't even bother. They randomly turn off, freeze and blue screen like crazy. My school has named them \"crap pads\" for a reason. I would give it a zero but sadly one star is as low as they go.", "Date": "February 20, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "2.8 GHz Intel Core 2 Duo (Centrino, VPro) processor !\n4 GB RAM and 160 GB HD capacity !\nShips with unused Windows Vista Business disc (No COA)\nDVD Burner, DVD-RW/CD-RW\n15.4\" Widescreen & integrated Wireless/Bluetooth card", "Name": "406333U Lenovo ThinkPad W500 Mobile Workstation 406333U", "ImgURL": "http://ecx.images-amazon.com/images/I/41oDTGFymsL._SX300_.jpg", "ProductID": "B001MEHXJY"}}