{"Reviews": [{"Title": "Great laptop", "Author": "Great", "ReviewID": "R2ILGXC7JSK47S", "Overall": "4.0", "Content": "This is indeed one of the better computers i have owned laptop wise.the design is sleek and pleasant, coupled with it being lightweight it is quite the looker.The hard-were is upscale, the keyboard is responsive and sharp, no 'mooshy keys', the clicker buttons seem to die rather fast however, but a wireless mouse easily remedies this. The touch pad is centered, leaving no room for 'wrist scrolling' that seems to be a BIG problem (for me anyway, when i'm trying to type) with other models. Battery life seems low at first, but if you play with the settings enough, it will last a few hours longer then even the label on the battery itself says. the HDMI and basic computer monitor outputs are nice to have, and if set up properly, can lead to three scrolled screens which the processor can handle with no speed reduction. All other basic ports are also standard, CD drive, USB ports, headphone / microphone, even SD card slot (which i was surprised by at how quickly the system reads the cards). The fact that a webcam is optional, but the microphone is always included, is a bit of a let-down. a webcam seems like a standard with any laptop nowadays.The screen is smooth, large, and pleasant, everything from basic programs to HD movies look superb.The system itself is nice, widows 7 cranks things out in a flash, IF your not doing too much. The thing about this laptop is, that its a good work computer. it works well for school, or business, as well as running basic programs and browsing. but it should not be used as a gaming laptop by any stretch of the imagination, even mad amounts of upgrades would quickly put both your wallet and the laptop under deep water. It does a good job of playing old games however, something for early XP, but the memory it needs might suck up a lot of your space.The filler and demo products are easily removed, unlike old systems where you had to install the full program, THEN uninstall it. Even programs like internet explorer, (on my old laptop) you could not uninstall at all because it was a 'necessary program'. But every program I have is non-stock, smaller file sized, and the laptop runs just the same, even faster in some cases.It is highly customizable, as it should be, but even things that were 'un-changeable', like the logon screen, can be changed very easily.All in all, a wonderful machine for a wonderful price (even though I got mine for $350 from a local store, and yes, its exactly the same, it was a sale), provided you get it for the right reason, and don't overload it.A great school computer that is reliable, strong, and fast.A definite buy.", "Date": "August 9, 2011"}, {"Title": "Very low quality", "Author": "Valueminded \"leadpedal2\"", "ReviewID": "R3CAA7WSB8MDDH", "Overall": "1.0", "Content": "Less than 2 yrs old and the keyboard is failing. Sometimes you hit a key and nothing happens, and you have to hit it again. Sometimes you hit a key once and you get a double instead- two of the same letter.  The basic software package is very sparse.  You need serious upgrades if you want to use it for anything more than surfing the net. I will never buy a Compaq/HP again.", "Date": "March 22, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001OC4NVU"}}