{"Reviews": [{"Title": "Currently my favorite netbook, but with some problems for me", "Author": "Scott Fisher", "ReviewID": "RWJB9ILRC9G1N", "Overall": "4.0", "Content": "Most current netbooks have a lot of similarities--with the same processor (Atom N270), similar size hard drives (most new with 160 GB) and similar LCD panel resolutions.  The HP Mini-Note 2140 is no exception to most of these base tech specs except for the LCD panel resolution of 1024x576 (instead of 1024x600 like most others in the 10\" range).So why is this 2140 my current marginal favorite in comparison, after trying out friends' and those available in stores?- Unlike most manufacturers, HP really got the keyboard right.  The shift keys and enter key are large and where you expect them to be.  Unlike other manufacturers, things are in place for productive touch typing and the 92%-size of standard laptop keyboard is pretty easy to adjust to.- The exterior casing is made of solid-feeling aluminum instead of plastic.  The netbook feels more durable and looks beautiful in comparison to most netbooks which can look a bit cheap in my opinion.  The aluminum adds a few ounces to the weight, but mine is still under 3 pounds with the 6 cell battery.- The netbook has a good selection of ports and connectors on the outside. It comes with an ExpressCard/54 slot which no other netbook currently does as far as I'm aware. Most of the other connectors are similar to other netbooks.  It also has 2 USB ports, an analog (vga) monitor out jack (see below for my complaints about it), an SD card slot and separate mic and audio out jacks.You would think I would be raving about this netbook, but I ran into some problems with my computer that make it less usable.I am unable to get any resolution above 1024x768 on any of the three external monitors I've tried it on. Two of the monitors are 1280x1024 resolution and one is 1440x900.  This is even with ONLY the external monitor enabled. At the same time, my 4 year old notebook and my desktop detect and make correct resolutions available for the 1280x1024 monitors (my other monitor is a slightly odd resolution). Updating drivers seems to make no difference (the one from HPs site or the Intel drivers).  The monitor will not detect correctly and free software (Monitor Asset Manager) that bypasses the windows registry to query the plug'n'play monitor properties directly cannot detect the external monitors correctly on this piece of hardware (works fine on both my other computers).It seems other people are not having the same kinds of problems that I am encountering, so I was either the lucky recipient of a computer with some highly ingrained software or hardware problems, or it has difficulty playing nice with some monitors that have pretty standard resolutions.Unfortunately, HP support is somewhere between awful and abysmal and has not chosen to make any reply to my support request email aside from an automatic confirmation they received it (and it has been over two weeks).A more minor quibble is that the built-in LCD panel resolution is only 1024x576 instead of 1024x600 like most other netbooks.  Though it's only a 24-line difference, on this small of a screen every pixel counts more than on a larger monitor.  At least the resolution is properly advertised so you know what you're getting.The touchpad also has it's buttons on the side, which some people dislike but didn't bother me.It's overall a good netbook.  If HP would fix my external monitor issues, I'd probably think it was the best one currently available.  As it stands, it's a good, but mine is flawed and my experience with HP's support has been very poor so far.", "Date": "February 21, 2009"}, {"Title": "So far so good", "Author": "R. Montemayor \"Xave\"", "ReviewID": "R2X6VO0BZQQX45", "Overall": "4.0", "Content": "I've had my new HP 2140 for about a week now and so far so good.  Setup was like any new laptop.  Fast and easy. I especially like the XP operating system over Vista.  First thing I noticed was the solid construction of this Netbook.  It doesn't feel cheap and made of plastic.  The keyboard also had a well constructed feel that had just enough room without feeling cramped.Now the software package was limited but did offer a 30 day trial version of the MS Office 2007. I had no issues connecting to my draft N wireless network and printer setup completed in less than a minute. I do recommend the larger 6 cell battery which is rated for about 8 hours.  Depending on how you use it you may get less than 6 hours like me.In conclusion I really like this unit.  I did my research prior to purchasing.  According to Cnet reviews, this was the unit to beat and I have to say they are right. The screen size is nice and the 160 gb is plenty of storage for me.  My unit came with a free Netbook sleeve to carry it in and yes you can still use the sleeve with the 6 cell battery attached.  I may add another gb of ram for a faster multi tasking experience. The web cam seemed to work well with Skype. Picture quality was ok.  As mentioned by other users the mouse button location had a slight learning curve but wasn't bad.Note:  I have yet to test the vga out connection and its resolution as I heard someone mention was a negative. Will update later.", "Date": "March 15, 2009"}, {"Title": "Smooth metal casing and elegant design in a netbook form factor", "Author": "Dustin", "ReviewID": "R2CJSF4FJC8S1B", "Overall": "5.0", "Content": "Bought one of the first 2140s that shipped in February 2009. Have already taken it on a 1 month trip to China. This is my 1st netbook, and 5th notebook that I have owned since 2002.The portability and convenience of the 10\" form factor is great. The screen is bright, and when compared to other netbooks - the HP Mini 2140's metal exterior makes it a stand out. I had a chance to sample and feel many other netbooks while in Hong Kong and while some of them may have a few things in their favor, I realized the HP 2140 was the best choice for me.No problems connecting to any wireless / wired networks in hostels / hotels / coffee shops. The split trackpad button layout has not been a problem to adjust to. Both buttons have a nice rubbery feel/response. The quick battery recharge to 90% has been good. 6-cell battery provides a good tilt, now I don't need to bring a CoolPad to angle the keyboard!! The 1024x576 is a minor quibble. I can't imagine reading the text on the high-resolution 1366x768 display. Contrrary to some opinions, I prefer the coating/glass/whatever that is on the screen - easy to clean, and I don't worry about touching it.I have not tried an external monitor or printing with this netbook, so I am unable to comment on those aspects.Soon - I will test the ExpressCard 54 slot with a Creative Labs audio card that I am using on another notebook. UPDATE - X-Fi Audio Xtreme card has been tested and works!Performance wise - only issues are a little lag if running too much video and a couple of blue screens when too many Google Chrome tabs were open along with other programs. Memory overload of some sort. But easy to avoid, once one knows the limitations of the processor. Used the netbook to talk with a handheld SkyPE Ipevo phone in many places. Handy!One annoyance (That I was aware of before buying) is that to use the PAGE UP and PAGE DOWN keys one must use the FN key at the same time. Which is swappable with the LEFT corner CTRL key (Not the RIGHT CTRL key, which would make it a one handed motion - unless I missed a setting) in the BIOs - but still annoying - as the smaller screen requires more scrolling. The trackpad scroll works well though.  Other netbooks have dedicated PAGE-UP/DOWN keys.I also own an HP DV6000 series limited edition white notebook - which is slick but --  after experiencing the aluminum/metal feel of the the HP Mini - I will say that more note/netbooks should be built with metal over plastic.  Enjoy!NOTE: This review is of the 6-cell version. This review is attached to the 3-cell version on Amazon. Both are identical except for the battery size/life.", "Date": "April 10, 2009"}, {"Title": "Generally great, but beware BEFORE you buy--serious printer driver flaw...had to return my Mini for a refund.", "Author": "Corvus Corax \"CC Crow\"", "ReviewID": "R3IR7BP4L1PIFK", "Overall": "4.0", "Content": "BE VERY CAREFUL IF YOU PLAN TO PRINT FROM THIS TO AN HP PRINTER....IT WON'T WORK WITH SOME HP PRINTERS YOU MAY OWN.All in all, this is a great little device. Powerful, compact, well thought out. BUT--and this is a BIG but....could not get the HP Mini 2140 to print to an fairly new HP Photosmart C6180 printer. Even after spending literally days on the phone with HP's engineers in Bangalore, this is a nonstarter, and I ultimately returned the device. There's just no excuse for this, particularly since the printer accepts jobs on our home network from our Macbook Pros and from our Thinkpads, but NOT from this nice, new handy, dandy HP Mini.BE VERY CAREFUL.", "Date": "March 14, 2009"}, {"Title": "Discontinued due to serious WI-FI issues", "Author": "Tony \"Tommygun\"", "ReviewID": "RPZR7JIUKKI1G", "Overall": "1.0", "Content": "I wanted a 2140 high-rez for a long time and finally bought one just before it was discontinued by HP. I was soooo excited to get it as it is a sexy and slick looking little machine. I wanted to like this machine so bad, but the 2140 has serious connection issues, in terms of WI-FI, and does not connect to many different signals and routers. You can't just take it to a coffee shop, because there is at least a 50% chance it won't work with their router. It is a useless machine, as it has terrible WI-FI. Just do a search on Google that reads \"2140 wireless problems\", and you will find large forum discussions of 2140 owners that have this same problem, or inability to connect wirelessly to the internet, and there is NO FIX available. The machine is fundamentally flawed and I believe it was discontinued because of this flaw. HP took the machine back, and I still believe they are a good company, but this machine is a dud.", "Date": "July 14, 2009"}, {"Title": "stay away from HP!!", "Author": "David Chen \"Sniper Kitty.\"", "ReviewID": "R368XY7QZAMAV2", "Overall": "1.0", "Content": "I bought this unit after reading all the great things from the reviews.  upon receiving of this unit, it looks great, and works fine for the first month and half.... then the unit begins to slow down, and finally reached it's untimely death.  reloaded the os four times, but it keep having the same problems.  I finally formated the hard drive and start from scartch.... hp customer service were no help at all, all they can tell me is to sent the unit back for repair...... the turn around time would be 7 days.  if you want a unit that works, then get a full size laptop, don't get the mini note book. it's cheat for a very good reason..... :(", "Date": "August 16, 2009"}, {"Title": "great little netbook", "Author": "Pilotguy299", "ReviewID": "R2XVRBZGS9BVKF", "Overall": "5.0", "Content": "bought this 3+ years ago for my son to use at college.  even with as rough as he is on EVERYTHING, this netbook s still working well.  yeah the rubber feet fell off, but did I mention just how rough my son is with everything?Wish I had bought one for myself :(", "Date": "December 29, 2011"}, {"Title": "Perfect Travel Computer", "Author": "Detailed Researcher", "ReviewID": "R17ZBA5BZ725KT", "Overall": "4.0", "Content": "I've used this on three trips from the States to the Middle East (20+ hours in a plane/airport each way).- Keyboard: The keyboard (92%) is plenty big.  I tried a friend's Acer (80-something% size) and it was WAY TOO SMALL.  I haven't noticed a big difference between this 92% and my 100% on my home computer - which is a bigger HP laptop.- Touch Pad: I read other reviews that didn't care for the touch pad, but I like it.  I had to get used to where to put my finger on the right side for scrolling, but that is very minor.  I accidently touch it once in a while during typing, but I've found that typical to all touch pads on laptops.- Battery: I did not opt for the larger battery, and I'm averaging at least 4 hours per charge.  I've spent tons of hours in planes and airports without access to an outlet.  I don't need the bigger battery.  Save your money and opt just for the regular battery.- Screen: This would be 5 STARS if the screen were higher resolution.  I've heard the HD screen may come out later in the year, but don't wait.  This is good enough for a travel computer - not quite good enough for a full-time computer.This is a great travel computer and well worth the price.", "Date": "June 21, 2009"}, {"Title": "Don't do it...(sigh)", "Author": "TWebb", "ReviewID": "R3QM95KBU1VV4Y", "Overall": "1.0", "Content": "I bought my HP Netbook about 1 yr ago. I performed sluggishly from the start but i accepted that fact as i was accustomed to a Toshiba Laptop with much more power. Since i was only using the HP for travel purposes and just for surfing the internet (i would bring it with me in the car)...it served its purpose. But, after 1 yr, the thing went bad and the Video Card went dead. I called HP and was told i am SOL. I now have a Ghosted Screen that no one can fix...and because its solid state, there are no parts that will fix the machine. Thanks HP...i will NEVER PURCHASE ANOTHER product made by you. MOREOVER, i will tell everyone i know about your CRAPPY production and HORRIBLE quality products that you released to the public. I would NOT buy this product. I get it a negative star rating if possible.", "Date": "September 11, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B001R4L0WK"}}