{"Reviews": [{"Title": "Wow!!!!!!!!!!!!!!!!!!!!", "Author": "Princeps P \"The Princeps\"", "ReviewID": "R2TTLM9B635LN3", "Overall": "5.0", "Content": "A few months ago I purchased an iMac from Amazon, my first Mac by the way. I could have not been more pleased. I am a student learning computational science and I wanted to become familiar with all the major systems: windows, Mac and Linux. I have been a frustrated Windows user for many years and was pleased with the Mac. Recently I just purchased this Macbook for mobile computing. I spend most my time away from my apartment and wanted a Mac to work on when I am on the go. This computer is perfect, the size and weight is just right for carrying around everywhere. Compared to my Windows based laptops I get over three hours of battery life, which is perfect for me.  The power of the Macbook is perfect for daily computing and basic development. The addition of the Nividia graphics cards adds a lot to photo, video and light gaming. I am also very pleased that Apple did not increase the price when they added the faster 2.13GHz chip and expanded the hard drive space. Originally I was going to purchase one of the new aluminum Macbooks just for the better performance but the recent addition of this computer changed all that. I am going to keep this review short because I wrote a longer one for the iMac I purchased.  If you need a mobile computer that is not being used for extreme gaming and extensive video editing then this computer would be perfect for you. As I mentioned it compliments my studies in programming and also allows me to work with the Adobe Web Premium bundle without a problem. Furthermore you can increase the RAM to 4 GB for about $60 from Crucial.com; they have videos to show you how, and it is not that difficult. Even though I love Amazon and usually make all my major purchases through them I will say that if you are a student you can buy this Macbook for less through Apple and receive a free ipod Touch  until September, just something to keep in mind. However, if you do not need an iPod avoid paying tax and purchase through Amazon. This is an update to my earlier review of this Macbook. I was unaware at the time I purchased this that a new less expensive Macbook Pro 13\" was being released.  I really wanted one of the unibody Macbooks but because of the cost I went with this computer. However, with the release of the new Macbook Pro 13\" I was able to return this computer and upgrade to the unibody. My review of this Macbook still stands and I was very happy with it but with the lower price on the new Macbook Pro coupled with the student discount that deal could not be beat! If you can afford the additional cost roughly $100 for student and $200 for non-student, I would recommend the Macbook Pro 13\", you will get more bang for your buck. The white Macbook is still a good investment if you need to keep your cost below $1000.", "Date": "June 7, 2009"}, {"Title": "More for the money!", "Author": "Jessica Rowe", "ReviewID": "R38J84XT9PL2FG", "Overall": "5.0", "Content": "As a 2nd time owner of a MacBook (my previous MacBook Pro purchased last September) I am amazed at the huge package you get for such a little price. At the Apple Store, I was able to purchase a newly released product (3 days old) for less than Amazon (949.00 with the student or teacher discount, and they didn't even ask for proof) charges and until September 2009 it includes a free iPod Touch. (Or any iPod valued up to 229.00). I compared the specs side by side to my Pro and found it to be almost completely caught up, except for the video card and display screen size. Even the memory had a faster bus! My Pro is still working great, but my husband needed something mostly for school. The glossy display is gorgeous and the slightly smaller resolution than the Pro goes unnoticed. I have the Pro for photography and graphic design but this little MacBook can handle those as well if it really needed to, what with all the extra processing speed. (2.4 vs 2.13).Overall a tremendous value and a power packed little computer. For an entry level, I think it is loaded with a ton of power to stay ahead for the next few years. Even the Mac \"pro\" at the store recommended it over some of the more expensive ones due to my husband primarily using it for Office programs and internet based with some photos and music on the side. I'm confident there isn't anything this little Macbook white couldn't do that my Pro could.P.S. Play with all the menus in the apple icon on the LH top for the most personalized experience. This includes touch pad \"gestures\" letting you use finger combinations to scroll, right click, turn pages, etc; hotspots that let you make a program or app come up just by going to a deep corner of the screen; Spaces, which lets you have multiple applications running on several screens that you can hop between so your windows are more organized; and many more options. Don't be afraid to try stuff with menu options, you won't break it!", "Date": "June 10, 2009"}, {"Title": "Have two: one is great, one is dying!", "Author": "Cinnamon", "ReviewID": "RR6Q3W2QT9T2R", "Overall": "3.0", "Content": "Had I written this review, say a half-year ago, I would have undoubtedly given the Macbook 5 stars. I took it with me to college after my previous laptop - an Acer Aspire - failed me horribly. My Aspire had an issue with overheating, which only presented itself after my warranty expired. The cost of repairing it was not worth it when compared to getting a new laptop that was smaller, lighter, more powerful, and more capable of multi-tasking (more RAM).I come from a family that has been using Macs for over a decade, although I myself preferred Windows computers...up until Windows Vista came out. We had many Macs around the house growing up since my parents use Macs in their office, and I was never really impressed with the Apple Operating System, so I had doubts about the Macbook. But since the Macbook is loaded with 2GB RAM and an Intel processor, you can run BOTH Mac AND Windows operating systems with ease. I therefore figured worse comes to worst, I'll use my Macbook as a laptop to run Windows XP with. I used it very heavily in college and it served me very well. It's light weight allowed me to easily carry it from class to class, its included photo and video editing software gave me hours of productivity, and perhaps best of all, it was reliable! I really loved my Macbook and would like to give it 5 stars...but...My sister, who was in graduate school, also got a Macbook at the same time I got mine. Her laptop fared well, up until the end of last year. For some reason, the laptop started getting buggy...it'd freeze, it would overheat, it became a major nuisance. We've reformatted several times, hoping that would solve the problems, but to no avail. I HIGHLY recommend getting the AppleCare protection plan. We regrettably didn't, and really don't feel like forking over the money to repair the Macbook since she doesn't use it much anymore anyway. But our attempt to save money by not getting the protection plan will end up costing us more money now, should we choose to repair the laptop! The experience with our second, identical Macbook, is why I have to give 3 stars instead of 5 for an otherwise strong performance product, that can run both Windows and Mac, that comes bundled with a lot of great software, and that looks really cool (especially on a college campus where almost everyone has Macs!)A last note...I have more recently purchased the sleeker Macbook, and would like to emphasize that while its construction is nicer, and it doesn't look as cheap as this plastic one, I still think this is a good deal. If you're looking to \"wow\" people and can splurge, get the newer model, but if you are looking for a powerful laptop and don't care too much about having the latest build, this one is just fine. I still use my plastic one even though I have the newer (cooler-looking!) one.", "Date": "August 2, 2009"}, {"Title": "Now I've gone Mac, I'll never go back", "Author": "WhippetMom", "ReviewID": "R2M2F8NVJ89IFH", "Overall": "5.0", "Content": "I used Macs all through college, but then I entered the work force and had to learn and use PCs.  In my current job, I was provided with a PC laptop, but I was so frustrated with it that I bought a Mac with my own money in December and haven't looked back since.  I even got an iMac for my office (you know, so that I'm not supplying my workplace with a computer at my expense).  I travel a lot for my job, which makes me love my Mac for several reasons.  First, my Macbook is LIGHT.  I was previously lugging around an IBM/Lenovo Thinkpad, which got extremely heavy when walking around airports for hours on end.  I travel overseas for work, and the Thinkpad was not only cumbersome to carry to a place where I might have internet access, I was lucky if it worked when I needed it to.  Email became a nightmare.  Getting it to hook up to wireless internet, or any internet for that matter, was a crap shoot.  And then the crashing.  And crashing.  And crashing.  Only a few months after I got my IBM, it was crashing so much that I was having to reboot several times a day.  Not fun when you're overseas in the field, with no IT department to help you.And then came my Mac.  It's pretty, it's intuitive, it has features and software that make my husband's PC look like a donkey with pots clanging around on it.  It doesn't crash.  Setting up email was a snap--not a several-day ordeal as with my IBM (that's right--switching email from PC to Mac was easier than PC to PC).  I've traveled with it several times, and haven't had any problems.  It did what I needed it to, when I needed it to.It took some getting used to, but Apple's site has some great tutorials on switching from PC to Mac.I'm still exploring and figuring out some features, but I'm always pleasantly surprised.  My only complaint is with the Finder.  I find it difficult to organize and locate my files, but I figure it will just take some time to get used to the new system.  For example, I want to find a document, say with the word \"Costumes\" in it.  I type \"Costumes\" into the finder, and it pulls every email I've ever written that contains that word, which could be hundreds, and I need to find my one costume document out of that mess.  But this is probably user error.  Even with that, I'm still extremely happy with my Mac.My mom and her husband are constantly grumbling about their PC and use me as their personal IT person.  Neither of them are particularly tech savvy, and I think a Mac would be perfect for them.  With a PC, you really need to understand how the machine works in order to troubleshoot.  With a Mac, you don't have a lot to troubleshoot, and everything is so intuitive.  You don't have to \"look under the hood\" all the time.", "Date": "August 26, 2009"}, {"Title": "MacBook", "Author": "E. K. Moseley", "ReviewID": "R3IHEH4H93JVG1", "Overall": "5.0", "Content": "My wife purchased this great machine for me and I'm a happy camper. It is as fast wireless as hard wired and small enough to carry anywhere but big enough to still be used in comfort. Good-bye PC machines.I can and will recommend an Apple MacBook for all the reasons all Apple users state. Be a friend to the environment and buy an Apple", "Date": "July 15, 2009"}, {"Title": "Excellent Laptop, does have drawbacks though", "Author": "Holly K. Lee", "ReviewID": "R3FF31NSZJ4L0D", "Overall": "4.0", "Content": "I am in love with my laptop. I love the highly intuitive nature of a mac. I never have to troubleshoot with a mac, the way i had to on a daily basis with a pc laptop. Each new laptop that comes out is faster and more fully loaded than the last. Each new laptop the comes out also seeks to correct some issues that the previous model had.This particular model has an issue with heat. The computer gets so hot it will burn your legs if you actually use it on your lap. The excessive heat also causes hairline fractures in the encasement around the fan in the back. After the fractures have shown up, dirt is attracted, and then you have dirty looking cracks all over the back of your computer. The most annoying problem with this model is the encasement cracking and breaking off from the wrist resting area, leaving an exposed rough and sharp edge. It is difficult to get apple to replace this, as it is not a default, but wear and tear according to them. Its been a major issue among users of this model. I suggest getting a skin to protect the area, I use Moshi PalmGuard Macbook 13-inch Unibody and 13-inch Pro Palmrest Protector - Silver and it has prevented my palm area from cracking this time around for over a year now.Overall this machine is an excellent product. Once you go Mac, you wont go back.", "Date": "August 17, 2009"}, {"Title": "3 years later, going strong", "Author": "Jeremiah P. Donohue", "ReviewID": "RAK3126OUU6IQ", "Overall": "5.0", "Content": "Most reviews, strangely enough, are written within a week or 2 after something is purchased.  This is a problem when it comes to laptops, which need to prove sound over time.I bought my white macbook 3 years ago.  I've probably used it, on average, for 5 hours a day.  I carry it with me all over the place, on planes, on my bike, and I've used it to DJ at dance parties (no spills, thankfully).This is a really great and very sturdy laptop.  There have been a few problems.  Because of the way the top of the casing is designed, the edges near where your palms rest have broken slightly.  And there is a tiny bit of roughage on the screen where it closes, but I only notice if I look really hard.Other than that, smooth sailing and much happy use.  I've never had a virus, never had to bring it in for repairs, and no real problems.", "Date": "August 29, 2009"}, {"Title": "I love it so much.", "Author": "Jorge", "ReviewID": "R19ID6GY76OG4N", "Overall": "5.0", "Content": "I ordered this because I wanted a 'vintage' type laptop that would still work and wasn't expensive as hell. So I went ahead and ordered this from Amazon. It is the most perfect product ever and I wouldn't have gotten any other laptop. It came in perfect condition and perfectly clean and almost new. With such a nice pricing range, I don't know why anyone would buy anything else! This review is being typed in by this product, which I love so much.", "Date": "August 6, 2013"}, {"Title": "Least expensive MacBook, but go Pro", "Author": "Cuyler", "ReviewID": "R1P6TJHG658RYL", "Overall": "4.0", "Content": "This is Apple's least expensive notebook, but I believe the 2009 13-inch MacBook Pro is worth the higher price for the following reasons:- it's a little faster- it's a little lighter- the aluminum finish is more durable- the all metal body should dissipate heat better- trackpad is larger and fingers glide easy over its glass surface- multi-touch gestures make it easier to navigate- LED-backlit display has better color and wider viewing angle- keyboard lights up at night- expands up to 8GB of memory (useful for the future)- longer battery life- the matte aluminum finish with black keys is beautifulFor me, these features justify the extra cost, which is why I purchased the Pro -- others might not feel they are important.  I am writing this review mostly so people thinking about the white MacBook at least consider the Pro version before making their final purchase.Note, the 13-inch MacBook Pro has two versions.  I got the least expensive which has a slightly lower processor speed, smaller disk and just 2GB of RAM.  The processor speed of the more expensive model is not significantly faster and the disk and memory can be upgraded later when prices drop (I eventually will get a solid-state drive and 8GB).In late October 2009, Apple updated this notebook with the same large trackpad as the MacBook Pros. This new revision also has a faster processor and larger hard disk.  I still like the aluminum body of the MacBook Pro (and the Firewire port can be useful), but most of the objections I had with the old MacBook do not exist on the current model.", "Date": "July 12, 2009"}, {"Title": "nice", "Author": "tollo78", "ReviewID": "R28ULZQFDW13PV", "Overall": "5.0", "Content": "i was searching a long time for a  cheap macbook now i find one at the right price refurbished and trust me i was very happy.look brand new shipping was fast.i would recommend to  anyone to buy.i love it alot  5***** all the way,", "Date": "March 19, 2012"}, {"Title": "Bought this for my mother", "Author": "G. Martin", "ReviewID": "R34W449D6W55SM", "Overall": "5.0", "Content": "I bought this used for my mother as a gift and it's been perfect!It came with a new battery (important!) and office pre-installed.  It's been flawless so far and I have one very happy mother :)", "Date": "September 2, 2013"}, {"Title": "Love it.", "Author": "Steve", "ReviewID": "R2MDZIIY98U2E7", "Overall": "5.0", "Content": "I always wanted a mac but the new ones are so pricey. the quality of apple MacBooks are unsurpassable, so you get what you pay for. i figured for my first mac this would be a good choice. it's a little older and for a good price. and it'll give me a chance to familiarize myself with OS X. It works great. i upgraded the 2GB RAM to 4GB for about $45. and Upgraded snow leopard to mountain lion for $20. for a first time mac owner i'm in love. i will def buy another mac.", "Date": "August 2, 2013"}, {"Title": "WORKS GREAT!", "Author": "ALICIA L.", "ReviewID": "R2M55KYCO2TEKO", "Overall": "5.0", "Content": "The MacBook is in great condition and operates properly, everything works on it, drive, camera, USB, etc.  It was a great price too!", "Date": "May 3, 2013"}, {"Title": "Yes yes yes", "Author": "Pablo", "ReviewID": "R1QMD71X2ZZJVG", "Overall": "5.0", "Content": "Awesome Laotop Couldn't Be More Happier that I Bought This Laptop And At A Good Price So I Would Recommend This Item", "Date": "March 14, 2013"}, {"Title": "Great computer!", "Author": "RERE", "ReviewID": "R3AFW6YQQDX25O", "Overall": "5.0", "Content": "My daughter loves this computer! She received it on Christmas and has done so much since the holidays. I would recommend as a great computer for all ages!", "Date": "April 8, 2013"}, {"Title": "Great Customer Service!  Great Computer!", "Author": "donna canfield", "ReviewID": "R3T85EJBWGFE0W", "Overall": "5.0", "Content": "I was reluctant to buy a used MAC for fear if it didn't work... returning would be a pain.  I bought it through ENCORE.  These people were so very nice and helpful.  They are so easy to getin touch with and very personable.  The computer that I sent back was quickly refunded and I got another one in days.  The new one had little sticky notes explaining how to work a few things that I might not know about.I will buy here again.The MAC is so easy to use.  I will never buy anything other than a MAC again.I can't believe I waited so long. It is so user friendly.  I can see why theMAC BOOK is so popular.", "Date": "December 22, 2011"}, {"Title": "Don't waste your money!!!", "Author": "Nancy", "ReviewID": "R17JTLVKNCOF5M", "Overall": "1.0", "Content": "After 34 days the \"I\" key quit working, I contacted the seller, after several days he responded and recommended a web site that might offer a fix. But when I tried to turn the computer on nothing happened, it would not turn on. I contacted the  seller again explaining what happened. He told me there was nothing he could do as it was past the 30 day return policy (He said he was abiding by Amazon's policy) Also said he'd never had any trouble before so there must be\" post delivery damage\"to cause the computer to quit working. I ask the seller if he could fix it or I could return it but he would not work with me.  Amazon will not back you up either as a buyer. I filed a complaint with them and they said it was past the 30 days.  There was not any misuse or damage done to the computer. I had a computer business tech diagnose the problem and he said the motherboard was fried. So now I'm paying $50. a month for a piece of junk. Stay away from this seller!!!!", "Date": "May 12, 2014"}, {"Title": "Horrible item", "Author": "Prabhakara", "ReviewID": "R2OMI7XL4L6FMJ", "Overall": "1.0", "Content": "Laptop is horrible, Big crack on screen and Webcam was not working.I totally disappointed the way they have published in amazon", "Date": "December 31, 2013"}, {"Title": "Fantastic customer service, great computer", "Author": "Peter", "ReviewID": "RNFXLLY3PSP6X", "Overall": "5.0", "Content": "This is a very nice used computer in good condition.  The optical drive was not working when it arrived and the seller quickly shipped a replacement drive and I installed it and it functions perfectly.  Thanks, Eric for your assistance and for a great laptop!", "Date": "November 1, 2013"}, {"Title": "Upgrade over Dell", "Author": "Zukkie44", "ReviewID": "R3AQ8A2J80KRE0", "Overall": "5.0", "Content": "This replaced a dell laptop of about the same age. Big upgrade! Macs, even old ones, are everything they're talked up to be", "Date": "October 31, 2013"}, {"Title": "My first Macbook", "Author": "M. Lor", "ReviewID": "R263OVLGOYB5D7", "Overall": "5.0", "Content": "This deserve a 5 star because it came in time and earlire then i thought it would. This is my first time with a Macbook and it work great. I highly recomend this seller to anyone who want to go low on price on macbook because it work great even though it used i love the macbook. 5*stars", "Date": "March 27, 2013"}, {"Title": "The best", "Author": "bonecutter \"just a consumer\"", "ReviewID": "R2CCA5FIPPJM5L", "Overall": "5.0", "Content": "The whole buying process was easy. A new Apple laptop with a free iPod Touch with free shipping and no sales tax for $999. Beats any education discount because of the savings on sales tax of almost $100. Came in about 4 days, setup took minutes. The newest of 5 laptops for my college kids.", "Date": "September 12, 2009"}, {"Title": "good for people who travel, good first Macintosh", "Author": "Ronald Salerno", "ReviewID": "R2RAT50UTP4IKZ", "Overall": "5.0", "Content": "Just got one of these and love it.  Small enough that it's easy to travel with, but large enough that it's easy to use as your main computer, if you like working on a laptop.This thing is fast and the new operating system is solid.  Love the automatic backup, which has saved me a couple of times.  There is also a great selection of open source software available, so you can outfit this thing pretty much for free.If you're not a Mac person, this is a good entry level Mac.  If you've got a desktop and want something to take with you, this is a good entry level laptop.  Goes way beyond what most entry level machines can do though.Love this computer.", "Date": "July 17, 2009"}, {"Title": "Very Happy", "Author": "M. Shanafelt \"shanafme\"", "ReviewID": "R3SCFJON6PBCRC", "Overall": "5.0", "Content": "I picked up the white Macbook about 7 months ago and have been very happy with the purchase.  This is my first Apple laptop and my second Mac all together.  The 13 inch screen is perfect for my needs.  A netbook is too small, and the bigger ones are too big to haul around (for my needs, anyway).  I mainly use the machine for typical office use (OpenOffice, web surfing, etc...) and it's been great.  I've also looked into a little bit of development with it, and it performed those tasks admirably (although I'd like a bigger screen if I get serious with it).  The only draw back is the small hard drive. I have to keep pretty much all of my media (photos, music) on my other machine, but it doesn't really hinder me too much.  Granted this laptop is more expensive than a comparatively equipped XP laptop, but I've more than made up for it in that I don't have to spend time maintaining the OS and the fact that the Mac still boots up in less than 2 minutes, while my XP laptop takes at least 5 minutes before it's usable after startup (and no, I don't have a bunch of startup items and garbage starting on boot on either machine).", "Date": "July 1, 2009"}, {"Title": "a happy customer", "Author": "Timothy Lenihan", "ReviewID": "R3PG3YTATKBI1R", "Overall": "5.0", "Content": "This apple mac book has been great.  No complaints here.  Works perfectly.  I may want to upgrade to the maverick operating system, but to be honest I don't need to. Very happy with this seller.  Arrived on time and in the condition that they stated,  I also called them and I found them to be helpful as well.", "Date": "May 13, 2014"}, {"Title": "Good Buy!!!", "Author": "Tanisha George", "ReviewID": "R2FUYZSZUF3UXP", "Overall": "4.0", "Content": "As we speak I'm typing on my new Macbook! I love it! This laptop is in very good condition. Theres no scratches or wear on the laptop at all which is extremely good. It looks so good I have a clear case to show it off to the world. I will say it is still new and I only had it for a solid 48 hrs but thus far everything is great, and on top of its tip top condition I received it 4 days earlier than planned, the only reasons as to why I didn't give it a five star review is simply because 1. It didn't come in the original box (wishful thinking, but still would've been nice.) 2. No Maverick upgrade so unable to download apps until the installment is made 3.It's still very new. Being that it's refurbished and the age I don't know what to expect but I looking forward to see the outcome.", "Date": "May 11, 2014"}, {"Title": "Responsible Vendor", "Author": "M.V. Feehan", "ReviewID": "RHCO6FI6X4WO8", "Overall": "4.0", "Content": "While there were a few initial issues with the battery on my purchase, the Vendor was attentive and after about a month, with the help of the vendor and replacement batteries, my macbook was running nicely.", "Date": "May 8, 2014"}, {"Title": "Don't buy if you want to actually use it long term", "Author": "Jeremy Wallace", "ReviewID": "R17EA34HXA3T83", "Overall": "2.0", "Content": "The computers audio has stopped working after only 2 months of normal use, on top of that half the time it dosnt charge and it crashes randomly with no warning... this person is selling old computer that he probably refurbished to look nice but at the end of the day don't work nice... buy from this seller and all yull be getting is a laptop that will function correctly for 2-3 months and then start breaking, totally wish i could return it because this is garbage", "Date": "April 30, 2014"}, {"Title": "dissapointed", "Author": "Joel R.", "ReviewID": "R2OLAQPYCGVJID", "Overall": "1.0", "Content": "I purchased las month  this MacBook and It does not working well. a) I can't Upgrade the Software b) turning off alone.", "Date": "April 23, 2014"}, {"Title": "Truly one of the best buys I've ever made!!", "Author": "Warren W. Wiley", "ReviewID": "R1UGCYNIFS4IT0", "Overall": "5.0", "Content": "Totally wonderful.  Great little computer that has worked perfectly right out of the box.  It has a few minor scuffs and scratches and there was an ID number scratched into the AC adapter box.  This is  a GREAT little computer that has been totally cleaned up and reloaded with late generation OX software.This is a real sleeper and I would urge anybody who is curious about Mac's to get one of these to learn how great things are on the MacBook side of the world.Worth every penny of my money.......and more!!", "Date": "January 25, 2014"}, {"Title": "Great product!", "Author": "gurleygirl6", "ReviewID": "R1BRDGVVKVATS5", "Overall": "5.0", "Content": "This laptop is barely scratched, which is the only real indication it has been used. It performs well and was well worth the money. I would recommend it to anyone.", "Date": "January 17, 2014"}, {"Title": "Good shape", "Author": "mike bell", "ReviewID": "RJQIEOW940AR1", "Overall": "4.0", "Content": "It is what I exspected it works good and learning how to use it more, A friend has had one for 8 years and still likes it and uses it, so smooth. Thank you MB", "Date": "December 26, 2013"}, {"Title": "Used mac book on amazon, really?", "Author": "Jan Braeger", "ReviewID": "R32WN6RC98VSDN", "Overall": "5.0", "Content": "Not disappointed!!! It runs perfectly. I tell my friends what I paid ($250ish)and where I got it and they are so jealous. I just use it to surf and email check. I would definitely order from them again! THX", "Date": "November 26, 2013"}, {"Title": "Great simple cheap macbook!", "Author": "R. Sander", "ReviewID": "R2X4OM3GVP7I1Y", "Overall": "5.0", "Content": "I've owned about 20 macs and needed something cheap and simple for a new employee to lug around.  This machine, which I think I paid $250 for from this page was great.", "Date": "November 23, 2013"}, {"Title": "Macbook 2009", "Author": "Abeg", "ReviewID": "R1VO4DONQ0RRWZ", "Overall": "5.0", "Content": "Had this laptop for a couple of weeks and it's more than I expected real nice and it works perfect . Thank you", "Date": "November 14, 2013"}, {"Title": "laptop", "Author": "mandie morgan", "ReviewID": "RBHMMZQQXT4WV", "Overall": "5.0", "Content": "This product was in excellent condition, it held true to description before I made the purchase and my daughter loves it!", "Date": "November 13, 2013"}, {"Title": "I really like it", "Author": "Mary", "ReviewID": "R177XR4QR1QDI6", "Overall": "4.0", "Content": "I really like it.I wanted to change my PowerBook a long time ago but I couldn't bring myself to do it, but now I'm glad I did it.", "Date": "November 11, 2013"}, {"Title": "Great buy!", "Author": "Robert R. Dominguez", "ReviewID": "RHB5S5VK2OJ10", "Overall": "4.0", "Content": "Shipping was right on time and the laptop was beautiful.You are going to be able to tell its used but its nothing big or super noticeable.Runs like new.", "Date": "November 1, 2013"}, {"Title": "Love it!!!", "Author": "joaniev", "ReviewID": "R18QM7R5TE6SK6", "Overall": "5.0", "Content": "We received the computer very quickly, and it runs just beautifully!!  So happy with this purchase!  I've already been spreading the word out there:  fantastic service, fantastic product, just as described, just a great buying experience!", "Date": "October 31, 2013"}, {"Title": "These can run Mavericks and are easy to upgrade.", "Author": "Chuck Bittner \"Disabled comedian & gamer!\"", "ReviewID": "R6O6JRBV54OHF", "Overall": "5.0", "Content": "I gotta say these Macs are the best Macbooks to upgrade and are just solid.  Adding Ram & Hard drives is super easy.  I recommend dropping in 4GBs it should cost less than $50 and will help a ton.", "Date": "October 28, 2013"}, {"Title": "Dead", "Author": "Amazon Customer", "ReviewID": "R12AL29PYA8P73", "Overall": "2.0", "Content": "It arrived dead, seller is very slow to respond. I send the MacBook back and I was told I would get another one. After over a week of no response I emailed them. They don't answer over the weekend. So few days after I was told sorry we don't have anymore. The MacBook I received was duty and like I said it was completely dead.If I knew I wasn't going to get another one I would have looked for another one right away instead of being without a computer for this long.It would be nice if they tested their products before sending them and it would also help if they answer more quickly. It would be nice too if they kept their promises. I did get my money back, so is not a complete waste but it was a waste of my time and I'm not pleased with seller.", "Date": "October 26, 2013"}, {"Title": "In worse condition than expected", "Author": "Lucas N.", "ReviewID": "RH8E4RCPF1EXU", "Overall": "2.0", "Content": "Many many many cracks, scratches, pieces broken.  The plastic around the screen is removed, the keyboard is coming out of the base, the base around the monitor is cracked about 2 inches.  The hardware is fine, but the condition is bad.", "Date": "October 25, 2013"}, {"Title": "Refurbished but like new", "Author": "Margaret Potter", "ReviewID": "R1EBTDUEFOLBX4", "Overall": "5.0", "Content": "I had wanted this laptop for a while as all my kids had Apple laptops and seemed to think they were great. The price of a new one was beyond me so I bought a refurbished one. It arrived with only the short cord that attaches magnetically to the computer but I was able to purchase a used extension also.  Once I got it up and running I downloaded and printed a manual which eventually helped but after using only Windows for years I found it very confusing. I even regretted the purchase for a while but eventually I got used to it and now I love it. This is an older laptop but it supplies all my needs and i don't need all the bells and whistles a more updated version has.I also have a Kindle and downloaded the kindle app that enables me to have all my kindle books on the laptop. This was a godsend when I lost my kindle and was able to \"rescue\" the contents and download them onto the laptop.One little irritation. There are a couple of websites the MacBook won't allow me access to. I still have my original 7inch laptop with Windows and I have to access these websites with that. Otherwise I'm highly satisfied", "Date": "October 16, 2013"}, {"Title": "Apple MacBook", "Author": "Ginger Carr", "ReviewID": "R48653KYXY4MX", "Overall": "5.0", "Content": "Even though this is not the newest MacBook out there, its still a great little computer. It can handle the latest IOS which is mountain lion and I was able to upgrade it from a 2 GB to A 6 GB. Its a great computer to learn how to use a mac and the price was unbeatable.", "Date": "October 15, 2013"}, {"Title": "Great speed!!!", "Author": "Mame lemine", "ReviewID": "R3EE5P85KMABF3", "Overall": "4.0", "Content": "I love it!... It's very fast, the only thing I didn't like about it is that the seller didn't not mention the scratches and cracked corners..... And it's hard to find a snap case for it. Other than that I'm happy!!!!", "Date": "October 11, 2013"}, {"Title": "It broke after a short time", "Author": "SnigletMom \"Doggymom\"", "ReviewID": "R1IY0PCK5IJDEO", "Overall": "1.0", "Content": "I normally love macs but this one had to be fixed only a week after owning it. I am still waiting to hear the verdict on whether it can be fixed or not. I guess this is what you get for a few hundred dollars. I do have to say the seller did ship fast.", "Date": "September 27, 2013"}, {"Title": "Love it!", "Author": "Liza Gorbach Rudoy", "ReviewID": "R39E3YN5PDBEPC", "Overall": "5.0", "Content": "Great item! great service! everything works beautifully! Highly recommended, works as fast as my Macbook pro. Great for internet research, youtube, facebook. A beautiful present for my mother.", "Date": "September 9, 2013"}, {"Title": "Apple MacBook", "Author": "Nanalin", "ReviewID": "R2MH2RJ9QQNHM", "Overall": "5.0", "Content": "So far so good, sent to a US Army Soldier.Soldier says he really like the laptop,, setting it up .. I'm very pleased with my purchase .", "Date": "August 22, 2013"}, {"Title": "Good for my 14 yr old son", "Author": "karen mack", "ReviewID": "RDF5TX5WTNP7", "Overall": "5.0", "Content": "He found it, I bought it, he's a happy camper. I don't know much about macs since I have a pc, but I do like my iPad so based on his nonstop use of it it must be good. I was happy to buy it for less used.Thanks!", "Date": "August 15, 2013"}, {"Title": "apple macbook", "Author": "Christina", "ReviewID": "RGMLTZ5J6GYTS", "Overall": "5.0", "Content": "it works well and even better than i expected! it was exactly what the description said and exactly what i wanted.", "Date": "August 6, 2013"}, {"Title": "Right choice for teen", "Author": "Henning M Mueller", "ReviewID": "R1V7ESMVGBR9IH", "Overall": "5.0", "Content": "This item was purchased for a teen to replace a windows laptop... Apple devices just work so much better - had no problems with it.....", "Date": "July 24, 2013"}, {"Title": "Inexpensive way to get into MacBooks", "Author": "Michael P.", "ReviewID": "R3NQOBR9K30O7X", "Overall": "5.0", "Content": "We all know how great that MacBooks are. I bought this for my wife because she wanted a laptop. We had an iMac for the family and I have a MacBook Pro. She wanted something that she could travel with and use the internet throughout the house as opposed to sitting at a desk for hours.I received this 48 hours ago and installed Mountain Lion on to it within two hours. No issues what so ever with the installation. I would say that the computer needs an upgrade in the memory and the Hard Drive, but this depends on the needs of the user. The Hard Drive is a 5400 RPM so it is a little slower than what we are used to, but it works great. I highly recommend a RAM upgrade to anyone that buys a used computer. At 2GB it is in danger of being a bit lower than what you need but still works great.When you upgrade to Mountain Lion the gestures that you use on the MacBook Pro are not capable on the MacBook. Other then that there is no difference.", "Date": "December 1, 2012"}, {"Title": "The best product I've ever had!!!!!", "Author": "Blake", "ReviewID": "RQJVU6FG2QDYL", "Overall": "5.0", "Content": "I just would like to thank the seller of this MacBook. At first I had a discombobulated Windows laptop. At school we started to use iMacs and I found out that Apple would be a good computer for animations and drawing. It took just a little while to get used to it but I just have to say thank you for such a good product! It is the most expensive thing I have. Now at school things will be more organized and easier.Thank you very much!", "Date": "August 8, 2012"}, {"Title": "Mac", "Author": "Heather", "ReviewID": "R2GDLI56EK6D4J", "Overall": "5.0", "Content": "I got this item like 6 months ago with no problems and loving it each more everyday!! such a great buy!", "Date": "July 17, 2012"}, {"Title": "very good", "Author": "Eduardo", "ReviewID": "R1SDLWAIS4CL7Q", "Overall": "4.0", "Content": "The product came on time, very good item, no complains I would recommend any one to buy it. You wont regret it", "Date": "February 17, 2012"}, {"Title": "LOVE MY MAC!!", "Author": "Tyrone Ferguson", "ReviewID": "RW4ZPZEJQMLGF", "Overall": "5.0", "Content": "Got my mac on time after it shipped. I have not had any problems with in almost 2 years! Came with the latest operating system of it's time, microsoft office, and a ton of other stuff.", "Date": "December 21, 2011"}, {"Title": "Great Laptop!", "Author": "Robert Gates Bardin", "ReviewID": "R3U446ZWUTDGHQ", "Overall": "5.0", "Content": "Before this, I had a IBM ThinkPad running XP. It was slow and I couldn't do much with it. Then I switched over to Mac. Mac OS X is the best operating system out there. It's easy to use, but it's so powerful. My MacBook has beautiful design and is well thought out. My only complaints are that it costs quite a bit and it gets hotter when in use than my IBM did. iThink--ahem, I think, that iLife is a great software suite. I got iWork too, which runs well on it. I bought Colin McRae Rally Mac and it runs admirably on the Mac, besides about a second of lag every 15 minutes.The processor is blazing fast, but I hope Apple will upgrade all their computers to i3, i5, and i7 Intel processors. The Nvidia graphics are wonderful. And the screen? Well, the screen is incredibly bright. The colors are vivid and bright. I would highly recommend getting a MacBook.", "Date": "March 3, 2010"}, {"Title": "Best Computer I've ever owned.", "Author": "Alexis Janel \"Young Professional\"", "ReviewID": "R10J2AHZ0U2UB0", "Overall": "5.0", "Content": "In the month since purchasing my macbook it has become my bestfriend. Surprisingly it's quite dirt resistant considering it being completely white. If you tend to use your computer away from home a lot I'd recommend a sleeve or keyboard protector. The colors are amazing & the speed is impeccable! But, what else is there to expect from a mac?", "Date": "October 14, 2009"}, {"Title": "not buying again", "Author": "melisa", "ReviewID": "R2CS5ZTWZ9HDKZ", "Overall": "1.0", "Content": "The macbook we received was faulty. I tried to return it but there was a long process involved and I had to use it for classes. Now, I'm stuck with a macbook that has a CD-drive that doesn't work and a bad battery.", "Date": "August 20, 2013"}, {"Title": "Awesome laptop", "Author": "Robert W.", "ReviewID": "R1R0RKT5HLMN3B", "Overall": "5.0", "Content": "All I have to say is the Macbook maybe 4 years old but it still has several years of life left.  I would recommend putting in more ram and getting an SSD installed - something I will be doing hopefully in the near future.  I just updated it to OSX 10.8.4 and it works as expected.  If you are on a budget and need/want a Mac this would be a good one to consider.", "Date": "July 3, 2013"}, {"Title": "Faulty Hardware", "Author": "Punit Thakkar \"punit\"", "ReviewID": "R6TS1U4RKFCPG", "Overall": "2.0", "Content": "I bought my macbook Jan '08 (around 18 months ago)... i have to admit i love OS X. But a couple of months ago my macbook just wouldn't come on. I took it to the service center. To cut a long story short they said that there was in the logic board and it had to be replaced. The cost was $[...]. I was completely upset with this. I went online and saw that many people had similar hardware problems with the macbook. It was really upsetting to have a laptop completely useless 15 months into buying it. And also more upsetting that apple would charge such a premium almost equal to the cost of the laptop for the motherboard. It shouldn't cost that much.Unfortunately, even though apple has a great operating system the reliability of the hardware is another storyPunit (pthakkar@gmail.com)", "Date": "August 22, 2009"}, {"Title": "Best computer ever!", "Author": "Diane Barnum", "ReviewID": "R39T9Q6VX0MHEX", "Overall": "5.0", "Content": "I love this computer and using the other kinds ever again is out of the question!  It is easy to learn and so, so fast.  Get one!", "Date": "April 13, 2013"}, {"Title": "not what it said", "Author": "annonamys", "ReviewID": "R2VTYUEDTFZ25N", "Overall": "3.0", "Content": "I was told that this is a 2008 macbook when in fact it was a 2006 and it didn't have all the features i was looking for. despite that disappointment i have learned to love my macbook and even this old mac is WAY better then a new windows computer.", "Date": "September 30, 2012"}, {"Title": "Sleek and so powerful", "Author": "King", "ReviewID": "RN8SKGD7GB939", "Overall": "5.0", "Content": "I got this as an entry level computer, Had nt used a Mac before; I must say that it is the best I have seen so far.Its impossible for me to go back to Windows. Ordered a refurbished one from Amazon, came almost new and in perfect working order. Had to upgrade the RAM to 4GB in order to handle the sort of work I do....Excellent product. Very happy with this purchase.", "Date": "February 13, 2012"}, {"Title": "Buy a keyboard cover", "Author": "Dr. Sharon \"syount3\"", "ReviewID": "RVIQVULNB1O35", "Overall": "4.0", "Content": "I had this computer for only 2 months.  A cup of water got spilled into the keyboard, thus destroying the logic (mother) board.  Apple offered to fix it for $800- thanks, but no thanks.  I called Apple because I still need a new laptop.  They suggested I buy a keyboard cover next time- perhaps that would have saved it.While I had it, it was a nice computer, but I had some issues with migration- moving my data from my older laptop to this one.  The time got messed up- it wanted to stay on GMT.  I called Apple and they figured out that a folder with local time or something had to be trashed to fix the problem.  It took some time, but trashing the folder they told me to trash fixed the problem.  So if you're migrating information, call Apple if your date/time doesn't set properly.My main reason for writing this review is not to say what a great computer this is.  In fact, the newer one is out with more RAM (3Gb) and more HD storage  (250 Gb), for the same price that I bought this one 3 months ago.  I love Macs in general- mainly the fact that you don't have to worry about viruses- the hackers don't seem to be able to get into the OS system- and I think Macs are easier to use- more  intuitive than PCs.  But my reason for writing is to help someone avoid the problem I had and to encourage them to buy a keyboard cover.  The logic board sits just beneath the keyboard and water is \"a kiss of death\" to the computer, as my computer expert friend likes to say.Apple does not currently offer damage protection, so if you spill water on it, you may very well have to replace it.  Perhaps the keyboard cover will protect it.  I certainly plan to buy one for my next computer.", "Date": "November 7, 2009"}, {"Title": "New Model Available", "Author": "vucats54", "ReviewID": "RXTVO2ILRZXFM", "Overall": "5.0", "Content": "Although the white macbook is a great machine, be advised that this is the older model.  Apple released an updated model on 10/20/09 with upgraded features for $999.  You may want to check it out on the Apple website before you purchase.  However this older model is still a great machine and if you are looking to save $100 this is still a good deal.", "Date": "October 22, 2009"}, {"Title": "Great, simple laptop", "Author": "scott", "ReviewID": "R1VQGKYQHJ5356", "Overall": "4.0", "Content": "Arrived with Snow Leopard installed and virtually no scratches or signs of former use. The battery cover doesn't perfectly align with the rest of the case but you only notice it if you flip the MacBook upside down. Seems to run a little warm for a laptop (this is my first non-PC laptop so I can't compare with other MacBooks) and battery drains in 1.5 hours with minor use. It took some work to upgrade Snow Leopard to Maverick but it was worth the effort. Overall it was a great purchase and I hope it lives up to the quality Apple reputation.", "Date": "May 7, 2014"}, {"Title": "Cracked Case_But Basically Sound", "Author": "timothy healey", "ReviewID": "R3OP2S0YU063HO", "Overall": "4.0", "Content": "So far this white Macbook has been a life saver.  It is practical for using on Email, composing documents, and other tasks that are not too memory intensive.  It only has 3 gigs of RAM memory, so video rendering is out.  Even though it is a 2006 computer, the first of the MacBook line,  it is a great worker so far.  I can do preliminary audio work, which is very necessary in what I do daily.  The only imperfections are a scratched viewing screen, a dodgy power cord that cuts in and out, and the case has a few cracks in it, which I will have to tape up to keep the ants from moving in.  Other than that it is perfectly functional and keeps me going in the world.", "Date": "May 5, 2014"}, {"Title": "Great!", "Author": "Brittany Seel", "ReviewID": "R3JVEM6RLP0X1F", "Overall": "5.0", "Content": "Quick Shipping. Recieved product mostly as described (a few blemishes not mentioned) but, works very well so far! and recieved all items/cords mentioned as well. :) happy. Would def recommend to anyone looking for an affordable and not new version of a Mac!", "Date": "May 1, 2014"}, {"Title": "Covers up scratches", "Author": "GNN Photography \"GNN\"", "ReviewID": "RIU8F312VQRX", "Overall": "3.0", "Content": "Good case for covering up scratches on these white Mac's, however build quality is not the best. It feels finicky, and adds a lot of weight to the MacBook.", "Date": "April 29, 2014"}, {"Title": "Best Electronic Gift I have bought for myself on Amazon.com!", "Author": "D. Rader", "ReviewID": "R105IL9JI4OTD9", "Overall": "5.0", "Content": "I was blessed to find this wonderful device and the wonderful man who wold it to me!  He has been of great help in my understanding of a MAC Computer vs the PC I have always used.  I think I shall enjoy this MAC very much (when I master how to use it fully).  Peace be with you, sir & my sincere thanks for all your kindness.", "Date": "April 28, 2014"}, {"Title": "content with product.", "Author": "Sherly D. Vargas", "ReviewID": "R2RT7R4Z86XN6", "Overall": "4.0", "Content": "company sent it faster than I expected. When asked for help, I received an answer quickly. I was confused though, because I assumed I would be able to create my own admin account without the previous one being there. As a new teacher and being told Macs work for us, I bought it. Surprised with how well this product runs, I noticed something with the charger,but I'm letting the battery get to a percent where I can charge it and see what happens. Over all I'm content with this product. Was a little pushed to do this review, but that's okay.", "Date": "April 10, 2014"}, {"Title": "Completely died after 7 months...", "Author": "Megan Lambert", "ReviewID": "R1VZCKIL67ZO95", "Overall": "1.0", "Content": "Came in on time and looking great. After a few months I thought I had really gotten a great deal. Just a few days ago the computer started making a loud noise and then just shut off. It hasn't turned on since and I don't have the money to replace it. It is fully charged my computer friend said I will have to dish out money that I don't have to get it fixed. Very unsatisfied. My advice, DON'T buy used and just spend the money to get you a new one.", "Date": "April 6, 2014"}, {"Title": "Good purchahse", "Author": "penname", "ReviewID": "R6ZM91QSRB6DY", "Overall": "5.0", "Content": "I have had no worries getting this computer to perform as needed. I am happy I made the purchase today.", "Date": "April 3, 2014"}, {"Title": "My first Mac, i will never buy anything but Mac!", "Author": "Jason Kozlowski", "ReviewID": "RP6J7P07J3XB4", "Overall": "4.0", "Content": "I am very happy with my Mac, the only reason i did not give it 5 stars is because it doesn't drive me to work or cook me dinner. Thank you for hooking me up with such a great computer!", "Date": "March 27, 2014"}, {"Title": "Excellent product", "Author": "Gena", "ReviewID": "R2KQLADI9QPK8X", "Overall": "5.0", "Content": "I bought this computer used but in good shape, paying only a fraction of its original price. I am fully satisfied with this computer: Great price, great performance, great reliability.", "Date": "March 25, 2014"}, {"Title": "Excellent Mac", "Author": "ossuel caicedo", "ReviewID": "R30QZVDDFXIN2Z", "Overall": "5.0", "Content": "Good price.  Mac working excellent.  Good condition.  I recommend this product.  Excellent customer service.  The Mac came with a lot programs ready to work.", "Date": "March 17, 2014"}, {"Title": "fairly okay", "Author": "Olayinka Bolaji", "ReviewID": "R1ULBLXBAX5CMI", "Overall": "3.0", "Content": "Not satisfied with this macbook laptop, battery is bad and doesnt chwrge full. This macbook pro is fairly okay. Thumbs down", "Date": "March 11, 2014"}, {"Title": "Good computer, Iffy service", "Author": "Amazon Customer", "ReviewID": "R2E7S403G85NA5", "Overall": "3.0", "Content": "battery and power cord were listed as \"NEW\" they are not. trying to get a hold of the vendor/seller is like trying to reach the moon on a bicycle.", "Date": "March 6, 2014"}, {"Title": "Love My Macbook", "Author": "liz awwad", "ReviewID": "R3JHPKABS092KG", "Overall": "5.0", "Content": "I was a little skeptical to bye a used laptop, but with the great description they had about it. it trusted my instincts and purchased my macbook, every where i go i get compliments on it. The keyboard and screen had no scratches or dents just the top case had some minner scratches but i just baught a skin cover sticker for the top case and no one even knows it, looks like new. Even my boyfriends likes it and wants to bye it off me lol. I love it great buy its my first laptop i bye for myself so i'm very happy. Came with all the programs the apple comes with so that was a plus. ONLY THING I COULDN'T WATCH YOUTUBE VIDEOS ON IT, UNTILL I DOWNLOADED FLASH PLAYER but that program is Free so all in all great bye.", "Date": "March 4, 2014"}, {"Title": "Doc", "Author": "Doc", "ReviewID": "RTRVTE1RWH9VE", "Overall": "5.0", "Content": "I started enjoying apple products 4 years ago when I first got my iPod from my girlfriend after getting my iPod I researched Apple products on my computer and decided this is my future products. I purchased this computer because I was looking for a different style of computer compared to the other products so I purchased this one for a great price and I have not regretted it  thanks for a great deal and a great product", "Date": "February 28, 2014"}, {"Title": "Long Wait but Worth a Wait", "Author": "Suewong McFadden", "ReviewID": "R25J0FUGSC6AGP", "Overall": "3.0", "Content": "I love my Mac pc ! It ru s better than my toshiba. I love using adobe CS6 collection on it. I am still transferring my files from old pc to my new macbook. Only problem...the shipping took a long time. 3 weeks to be exact besides that the seller offer me refund on my shipping, so im happy with that.", "Date": "February 21, 2014"}, {"Title": "It's not perfect...but it's still a Mac", "Author": "Jeremy Harris", "ReviewID": "R35G9N8464TPR5", "Overall": "3.0", "Content": "If I had it to do again, I might have gone a different route. I mean, I know this is a refurb, but I can't help being disappointed with the screen defects (brownish spots splashed across the middle of the display). If I didn't need this immediately for my classes (my old laptop died partway through the semester) and they didn't charge a fairly substantial restocking fee, I might have returned this. However, it IS still a Mac and, with a bit of a RAM upgrade, quite capable of handling the new OS X (which, in my opinion, is pretty sweet). Knowing what I know now, I would have spent a little more and gotten something a little newer. It's ok for an older machine...just be aware that it probably will have some irritating defects here and there.", "Date": "February 14, 2014"}, {"Title": "it was great", "Author": "barbara hagan", "ReviewID": "R2OXSCGVKWTBLF", "Overall": "5.0", "Content": "it was in very good condition and The price of the laptop was at a very reasonable price. I was very happy", "Date": "February 12, 2014"}, {"Title": "Thank you. I will come again.", "Author": "Meredith Sell", "ReviewID": "R3RUUERVLSJWOX", "Overall": "5.0", "Content": "I did not fully understand what I was ordering when I ordered this computer. I needed to replace my fried PC, and I'd been wanting to convert to Mac before I graduated college so I could take advantage of Adobe's special student rates.When I turned this computer on for the first time, I realized I had no need for Adobe's student rates -- all of the software I could have imagined (and some I never would have thought of) was already installed and ready for use.The computer's cosmetics are a little flawed (some scratches and chips on the plastic casing), and the escape and 1 and 2 keys crunch a little when pressed, but other than that it's in great condition. I have no complaints. In fact, when I decide to further upgrade (in a few years), I'm going to shop for an iMac from these guys.", "Date": "February 3, 2014"}, {"Title": "Best notebook", "Author": "Brett B.", "ReviewID": "R347KJ2AUJ9ML8", "Overall": "5.0", "Content": "Apple surpasses all competitors with this notebook. Pcs die everyday from virus and malware, not the apple notebook. It's designed to \"Just work\"", "Date": "January 25, 2014"}, {"Title": "Great Deal and Great laptops", "Author": "david t vincent", "ReviewID": "R109L4E8G9UREE", "Overall": "5.0", "Content": "We got these for our 7 and 9 year old kids. The quality is great, the software is loaded on these and I couldn't be more pleased. One of the chargers were not working but the seller shipped a new one in a day and all was good! perfect!", "Date": "January 10, 2014"}, {"Title": "Worth it!", "Author": "Cheryl A. Keeler \"cherik\"", "ReviewID": "R1DWSF7GBS78VB", "Overall": "5.0", "Content": "A few scratchers, mild cosmetics with the outside, otherwise I am very pleased with this laptop.  I could not afford a brand new Mac, but I had heard about used refurbished ones.  I have to use windows at work, but I have no problems using the MacBook.  It has all the features I needed to match up with my iPod and and iPad.  I highly recommend this laptop.", "Date": "January 7, 2014"}, {"Title": "Awesome Macbook!!!", "Author": "shieldfan", "ReviewID": "R1WUJCMSKLPY9U", "Overall": "5.0", "Content": "This is my first Macbook and did not want to spend over $1,000 just in case I did not like using mac as a full time computer.  I been using this macbook as my main laptop for school and entertainment and it is great, when I got it, it had snow leopard on it, I upgraded it recently to Mavericks and it runs great, only thing you have to do to it is that and maybe upgrade the RAM/harddrive but I will do that in due time, for now it runs great, like new!!The laptop had no cracks, everything on it works, it does not hold a charge for too long but that is not an issue for me, and it has a lot of scratches on the cover, which I covered most of it with a decal they sell here on amazon specifically for Macbooks that take advantage of the lighted up apple logo.", "Date": "December 25, 2013"}, {"Title": "Love My Mac", "Author": "James Martinez", "ReviewID": "R1HMWS6YCQIEFZ", "Overall": "5.0", "Content": "Love my Mac. Even used it's still better than any PC I ever had. Spent a little time updating the software, then all was good.", "Date": "December 25, 2013"}, {"Title": "Very good price", "Author": "FM1306", "ReviewID": "R3LC1ZLO635BQO", "Overall": "5.0", "Content": "The laptop was delivered on the scheduled time via UPS. Arrived in perfect condition and it looked like new with slight signs of use. Beyond expectations. Included everything as advertised and it was ready to use. Price was very good compared to a new one. Highly recommended for teenagers and college students. I have not received yet information on the warranty.", "Date": "September 14, 2013"}, {"Title": "Trouble with the first battery.", "Author": "michael j hammock", "ReviewID": "R1V2QLCA3QADUF", "Overall": "5.0", "Content": "Great computer. Fast and simple to use. We had trouble with the first battery but he vender quickly replaced it and since then it has worked flawlessly. Runs a little hi n the bottom when you use it for an hour or so.", "Date": "July 13, 2013"}, {"Title": "used macbook", "Author": "Patricia Martin", "ReviewID": "R1IKCA142FM0JN", "Overall": "5.0", "Content": "I LOVE IT!! It has taken some getting used to as I had an ancient mac mini desktop. Still trying  to get used to the trackpad! I am not \"tech savy\" at all, but macs are so user friendly for people like me.", "Date": "February 16, 2013"}, {"Title": "Absolutely great", "Author": "Lesaya Kelly", "ReviewID": "R10BLY4BVXH2LV", "Overall": "5.0", "Content": "We bought this computer for our daughter and it's proved absolutely user friendly and reliable.Awesome for a refurbished product!!", "Date": "February 4, 2013"}, {"Title": "Amazing machine!", "Author": "Cynthia Cagnoni-Quinlan", "ReviewID": "R1F9X1B24AOMPV", "Overall": "5.0", "Content": "I bought this MAC for my husband and he is in love with it!!! The expressin on his face when he opened the box was priceless. The laptop is in amazing condition! It is the first Mac in our home and now I want one for myself. So far it's been very easy to figure it out (newbies with Mac's). It is very fast, the graphics and sound are amazing...I honestly cannot say enough about this machine.Thank you!", "Date": "January 22, 2013"}, {"Title": "This mid-2009 Macbook is the sweet spot.", "Author": "g3gene", "ReviewID": "R13MRUWOIIZGBI", "Overall": "5.0", "Content": "A new Macbook was simply outside my budget, and the older Intel Macbooks were going for $600+ in my area. Thanks to Amazon and Instant Replay Electronics I got a deal on this fantastic Macbook that was all I needed. $428 including shipping from Instant Replay Electronics,a dealer with a sterling reputation on both Amazon and Ebay. iWork, iLife and Office 2008 included at no extra charge.The mid 2009 has a 2.13 Ghz Intel cpu,bumped up from 2.00 early 2009. HDD 160 GB from 120 GB, 2GB ram and OSX 10.5.The money I saved allowed an upgrade to 10.8 Mountain Lion and ram to 4 GB. Installing ram in this model is easier than changing a light-bulb. Remove the battery, unscrew a retaining strap and it's \"pull out/plug-in\" for the RAM modules. As a bonus, the Hard drive caddy is also \"pull out/push\" in for the same compartment making an easy path for a future SSD upgrade.The sweet spot is where I payed less than half for a Macbook that has more than needed to run HD videos and the latest OSX. A model earlier would have less performance headroom, and a later model would slip up into $600 territory. As time goes on better deals can be had,but if you are not running heavy duty apps and games, you need wait no longer.", "Date": "January 16, 2013"}, {"Title": "Very nice product", "Author": "Corry Richardson", "ReviewID": "R2BQR2T3BLAU2W", "Overall": "4.0", "Content": "This laptop was for my wife, as I have a macbook pro. The only reason it did not get 5 stars is because there was no warning that there was screen damage (dark marks that wouldnt come off, scratches ect..) in the description of the computer, but when it arrived and I had the receipt in hand it did have it on there. All around though, great laptop.Corry", "Date": "January 8, 2013"}, {"Title": "I am reviewing this as a used/refurbished product, not as the original", "Author": "dad-d", "ReviewID": "R2MNKMD27LCKK7", "Overall": "4.0", "Content": "This is my second used/refurbished laptop from Laptops US.  The first was a Lenovo Thinkpad which was flawless- just like new.  This second item was not cosmetically as clean, and has a software glitch which will not allow the internal speakers to be selected.  The speakers work during boot up, but not after boot up is complete.  Digital optical output automatically comes on when headphone jack is removed, and internal speakers cannot be selected.  The computer has a functional battery and otherwise works flawlessly.  If not for the slightly beat up appearance of the unit and the lack of speaker functionality, this would be a 5 star unit.", "Date": "December 28, 2012"}, {"Title": "Runs like a champ:)", "Author": "A. Mauro", "ReviewID": "R2BII8IK4TMYA2", "Overall": "4.0", "Content": "The only thing is this one didn't have Ilife or other programs that are essential, all needed to be downloaded or purchased.  Besides that, shipping was great, no problems.", "Date": "December 14, 2012"}, {"Title": "Apple MacBook Rules!", "Author": "Michael Edelstein", "ReviewID": "R22CA80PII0ELC", "Overall": "5.0", "Content": "I love the MacBook! You're instantly greeted by glorious full screen brightness. The LED-backlit display is power efficient. And it's mercury and arsenic free. I like the smaller, lighter frame, compared to any PC.  Measuring a mere 1.08 inches thin and weighing in at only 5.0 pounds. It also offers a unique keyboard design that sits flush against the bed for a sleeker, lower profile. Other standard Apple \"extras\" includes a built-in iSight video camera. Stylishly and intelligently designed, the MacBook has everything I am looking for: affordability, innovation, powerful computing. My MacBook has a 2.13 GHz Intel Core 2 Duo processor with a 160 GB hard drive, plenty of room for music, photos, videos, and more. Hardware features include a built-in Gigabit Ethernet for high-speed networking, Bluetooth 2.1+EDR (Enhanced Data Rate), two USB ports, FireWire, and Mini-DVI video output. Apple has an updated model (10/09) with a 250 GB hard drive. I do not need the extra memory, amazingly, the newer model, does not have a FireWire port.I like Apple's magnetically connected MagSafe power adapter. This feature offers a magnetic connection instead of a physical one.  If you to trip over a power cord, you won't send MacBook flying off a table or desk, the cord simply disconnects, without damage to either the cord or the system. The adapter is easy to connect and disconnect without having to struggle with the connector. Opening and closing your MacBook is also a pleasure, thanks to a magnetic latch, there are no moving parts to snag, jam, or break. Again, I do not have to struggle with some PC toggle switch to open my MAC.The 160 GB Serial-ATA (SATA) hard drive (5400 RPM) high speed transfer of data, akin to FireWire and USB 2.0. The 2 GB of DDR2 RAM (two SO-DIMMs of 512 MB) have an 800 MHz speed, and the RAM capacity can be increased to 4 GB. The 13.3 inch glossy widescreen display, excellent video processing power from the NVIDIA GeForce 9400M integrated graphics chip, and an integrated 802.11n Wi-Fi LAN, provides compatibility with older 802.11b/g routers. It includes an 8x combo Superdrive for burning dual-layer DVDs as well as CDs. It comes pre-loaded with Apple's Mac OS X 10.6 Snow Leopard operating system, the iLife '09 suite of applications, including iPhoto, iMovie, Garageband, and iTunes.Battery lasts  between 5 and 6 hours. The hafnium-infused circuitry--which reduces electrical current leakage in transistors conserves even more energy, giving you more time away from the wall outlet. Apple has worked hard to eliminate many of the toxins that are a common part of computer manufacturing. Apple engineers removed the majority of brominated flame retardants (BFRs) and polyvinyl chloride (PVC) from circuit boards, internal cables, connectors, insulators, adhesives, in the MacBook.Because Apple makes both the hardware and the software for the MacBook, they're designed to work together to produce a smarter product that uses less electricity. The MacBook hard drive spins down automatically when inactive. The MacBook also decides which processor CPU or GPU is best suited to efficiently perform a task. The processor even throttles down to save power between keystrokes as you type. Together, these adjustments make the MacBook much more energy efficient and result in fewer CO2 emissions.Made in America by Americans. I have gone through four different PCs using Microsoft operating systems in four years.  Microsoft makes a bad product, cheaply and poorly designed made in Asia.  The Asian hard drives constantly failed and crashed.  Programs were slow to load and constantly crashed.  The MAC is fanatstic. The superior Apple product is well designed, efficient and dependable. The Apple MacBook MC240LL/A 13.3-Inch Laptop is the best that I have owned! I thoroughly endorse and recommend Apple products to anyone.", "Date": "December 27, 2009"}, {"Title": "Good Product/Terrible Customer Service", "Author": "matthew white", "ReviewID": "R2MYDF2CJPTG6", "Overall": "2.0", "Content": "I was pleased with the product that they had sent me which was a used Macbook Pro, yet was more than disappointed with several key aspects with East Coast MAC's customer service.  I had purchased the computer on Friday the 10th and my order was not processed (i.e. billed) until a week later.  I then received an email that stated I would receive the computer on the 23rd.  I did not receive the computer until the first of the following month.  Essentially, it took three weeks for my computer to arrive.  If you're not in a rush to receive a used computer then this is the company for you.", "Date": "February 3, 2014"}, {"Title": "macbook rules", "Author": "Bruce M. Fournier", "ReviewID": "R3V4JN05RJRKWB", "Overall": "5.0", "Content": "I had to get used to Mac product, but I Love this little machine. no problems with virus or malware, and it is easier to use than I expected. straight forward and dependable. finishing up my degree with this little work horse", "Date": "January 11, 2014"}, {"Title": "apple", "Author": "Royston Evans", "ReviewID": "R2SNF71D8WJ4KG", "Overall": "2.0", "Content": "I like the computer but it didn't come with the one thing I did want it to have the IPhoto install I have to buy it from the app store .", "Date": "October 27, 2013"}, {"Title": "The DVD drive won't eject after software download is complete.", "Author": "Kevin A Ngala", "ReviewID": "R334CQSF0PVT0T", "Overall": "2.0", "Content": "The DVD drive won't eject after software download is complete.  I am basically stuck.... Can't get it out. Please advise....", "Date": "July 3, 2013"}, {"Title": "grate !!", "Author": "chuks Nwafor-Orizu", "ReviewID": "R3M1NYU7W7O216", "Overall": "5.0", "Content": "the pc runs grate and East Coast Macs took time to install applications i would have normally payed extra to have installed. Thumbs up!!", "Date": "December 22, 2012"}, {"Title": "Disappointed", "Author": "tu", "ReviewID": "R3TVMGG02LWA5H", "Overall": "2.0", "Content": "I've had the computer for a few day's now and it seems fine.I like the magnetic power cord end.Three usb ports side but side...nice.DVD drive good too.The only thing I ~HATE~ about the machine is that there is \"NO\" SD card slot!! REALLY!???? VERY DISAPPOINTED IN THIS PRODUCT NOW.I would have never bought this notebook if I would have read that it does not have one.Major issue,since I need that convenience!!!  Every other machine has one....!!!! R-DICKOther than that small but annoying issue it's a good machine,I guess", "Date": "November 25, 2012"}, {"Title": "Fast and furios", "Author": "Guillermo Hasbun \"guille\"", "ReviewID": "R2JX95BMJNKE6W", "Overall": "5.0", "Content": "My 11 year old bought this computer and here is what he thinks about it:This computer is really fast and its worth all the money  for all the things it does, I like it a lot.I like this computer for its design,the magsafe power adapter and the keyboard design.I also like its colors and the beautiful graphics.I really recommend this computer. Its better than the xp windows vista and windows 7.  Windows programs are not so good  and don't function as well, they function butnot as well as a Mac.If Your going to buy a windows computer don't even think twice D-O-N-T, in my opinion I don't like windows.BUY A MAC.", "Date": "September 26, 2009"}, {"Title": "Can You Help?", "Author": "JHM", "ReviewID": "R14892R458RVUN", "Overall": "2.0", "Content": "I'm confused about what's available here. Where is the Word Processor? I write 200 page documents and need a very reliable computer and word processor that doesn't trash my writing when I hit the wrong key. Where's the Word Processor in the MacBook 13.3-inch laptop? I love this size computer because it's portable and not overwhelming in size. But where's the Word Processor? Does it exist on this computer? Maybe I should buy a pc equipped with Word. Please weigh in.", "Date": "March 1, 2013"}, {"Title": "Charger melted and DVD drive didn't work - Contact seller 3 times and no response", "Author": "Waleska E Herrera", "ReviewID": "R17W0Z01H90NS5", "Overall": "1.0", "Content": "I don't like to write bad reviews, but this time i feel like i need to. I bought this computer as a birthday gift to my child - i'm a single mom with just one income so i couldn't afford to buy a new one. I searched and searched, until i found this seller with marvelous reviews. I decided to go with them and buy this used computer. Well, the charged melted after 1 week and the DVD drive didn't read the CDs. I contacted the seller, and explained what happened. They asked me to send pictures of the melted charger and explain in more detail what happened with the Cd drive. I did what i was asked - pictures and a detailed explanation. Surprising to me - I have gotten NO RESPONSE after the first one. I even bought the refurbished one, thinking that it will be in a better shape. I'm sorry to say this - but THIS SUCKS.", "Date": "January 13, 2013"}, {"Title": "Horrible", "Author": "Alexis", "ReviewID": "R21W3QVEX20MVN", "Overall": "1.0", "Content": "I didn't like my Mac Book, I only rated it one star because the thing wouldn't let me put none.", "Date": "October 22, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "2.13 GHz Intel Core 2 Duo Processor\n2 GB of 800MHz DDR2 RAM\n160 GB 5400RPM Hard Drive, DVD/CD SuperDrive\nMac OS X 10.6 Leopard Operating System\nAdvanced GeForce 9400M NVidia Graphics, 13.3 Inch Glossy Display", "Name": "Apple MacBook MC240LL/A 13.3-Inch Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/41J4p4FbS%2BL._SX300_.jpg", "ProductID": "B001P05NJC"}}