{"Reviews": [{"Title": "overhyped piece of garbage", "Author": "EliteLamo \"too weird to live, too rare to die\"", "ReviewID": "R41KOX9KYFQTX", "Overall": "1.0", "Content": "As a young teen I used to dream about a machine such as the one alienware claimed it was. A machine that does anything and everything for gaming, with state of the art sound and graphics. Alienware claims it has award winning customer service and a computer that I nicknamed RAMBO, before I bought one.With mods, my alienware desktop replacement cost 4700.00. It is by far, the absolute worst experience I have ever had with a computer, and it has been sitting in my closet for nearly a year after I purchased it. Multiple crashes, both hdd's stripped and the machine in general was so hot at times, it would burn not only a flat surface but would retain the heat long after the machine was off. Save the argument that a large replacement desktop would do that in general, the machine has nearly not enough adequate fans to carry the weight and heft of such a system.I cannot urge you enough, no matter how slick and stylish the ads may be and how amazing the clock speeds are that alienware claims (you can build your own and clock it at whatever you like, you don't need the name alienware to do it), never, ever purchase anything from this company.The customer service was tiresome, nauseating and paltry. I had to call up nearly three times a day for months, before they would even consider having it returned, that was still with it under warranty.A company that should clearly go underground and never come back up again.", "Date": "June 7, 2008"}, {"Title": "Don't waste your money", "Author": "AJ", "ReviewID": "R2P9OY9Q1FS93L", "Overall": "2.0", "Content": "I've had this laptop for 3 years and 1 month to be exact the battery pack and the video card heat sink have died.The video card is burned and I smelled smoke coming out of the laptop and I saw dead pixels on the screen. The heat sink costs over $300 & you can't find it at any local computer repair store or stores like Staples. I didn't get the warranty because I never thought that a $3,000 laptop would have so many major problems in less then 5 years.", "Date": "July 20, 2009"}, {"Title": "Alienware Aurora M7700 \"Worst Idea Ever\"", "Author": "Nathan R. Hibschman", "ReviewID": "R34V6CCEJDMN6S", "Overall": "2.0", "Content": "I purchased this same laptop from Alienware thinking I was getting the best PC ever!  I WAS WRONG!  The only reason I saw the above post is because I am shopping for parts to fix mine.  Alienware's customer support is the worst I have EVER dealt with, I would-could get better service from a barking dog.  I only wish that I would have purchased the 4 year extended warranty.  SO far, the screen has dead pixels and the back light doesn't seem to work, the dvd drive is toast, one of the cooling fans died, and the battery is toast.  This laptop is 4 years old, I have seen 10 year old Dell laptops with less wrong.  All in all, build your own, all this laptop was is a Clevo 900D that Alienware stuck there name on.  I urge anyone who is considering buying from this company to look elsewhere! Please! Please!", "Date": "February 12, 2009"}, {"Title": "Do not buy from Alienware!", "Author": "CN", "ReviewID": "R3MAYYMR0SKGP2", "Overall": "1.0", "Content": "People -- Do not buy anything from Alienware!  It was a huge mistake for us.  We bought the M9750 laptop about 18 months ago and spent a fortune.  My son had saved up much of the money himself and was excited to pick this one out.  It was sent in for repairs at least twice. On the 2nd time, they returned it and it still wasn't fixed, they had installed the motherboard improperly.  When we called to tell them, they tried to act like WE had done something to break it again.  Finally they agreed to fix it for the third repair.  At this repair, when they mailed it back to us, it was misplaced by Fedex! [...] I also found out that they settled with Fedex two months previously, but yet they still jacked me around for additional months.  Ok, so they picked a computer to replace our lost computer with, and it's not as good of a computer.  But there's nothing I can do, I have complained and argued and begged, but they are sending me a basic model laptop that doesn't even compare to the expensive one that we purchased.  They swear that it's even better than my old one, but this is only because technology has improved, it's not because it's a comparably priced computer.  Even the case isn't as cool as the one we originally had, but they don't care.  We don't have a choice.  They were rude, and no one ever once apologized to us that they and Fedex had lost our laptop -- they treated me like a thief and even admitted to me that my account was \"flagged for possible fraud\"!  What?  Are you kidding me?  We sent in a laptop for repairs back in April 2009 and have never seen it or a replacement product since.  Apparently I will be getting a new laptop this week, but it doesn't begin to fix the time lost and the aggravation of all these months. Oh, and the only time Alienware ever did apologize was when I mentioned hiring a lawyer.  Interesting.  Beware, from Houston, Texas.  [...]", "Date": "September 22, 2009"}, {"Title": "Fastest Laptop ever", "Author": "Joerg Scheffler \"Was Du nicht willst...\"", "ReviewID": "R29ME4KX3E7S3N", "Overall": "5.0", "Content": "Das schnellste, teuerste und lauteste Notebook das ich je gekauft habe.Mit RAID Array, 2 GB RAM, 17 Zoll 1920x1280 Auflösung, NVIDIA Graka mit 1 GB RAM.3D Spiele bis hin zu Bad Company, BF2 und auch BF3 laufen einwandfrei. BF3 allerdings nicht mehr in den allerhöchsten, aber noch sehr akzeptablen Auflösungen.Die Verarbeitung ist hervorragend. Ich verwende das Aurora m7700 seit 2005 ohne jedes Problem.Das RAID Array mit 750 GB ist sehr schnell und die Platten sehr leise.Wenn allerdings die 5 Lüfter loslegen, ist ein Headset sinnvoll.Super Ersatz für Desktop, besonders auf LAN Parties. zwar hat es nicht gerade ein niedriges Gewicht, aber immer noch 5x leichter als ein Gaming Desktop.Mit Akku läuft es gerade mal eine Stunde, was ich in Anbetracht der enormen Leistung von CPU (Desktop CPU) und GraKa sogar als sehr gut empfinde.Das Netzteil sollte eben immer mit dabei sein.Windows 7 läuft hervorragend. Keinerlei inkompatibilitäten. Sogar die eingebauten Lautsprecher samt Subwoover sind sehr brauchbar.Gesamturteil bisher:Schnelligkeit: 7 von 7Bildqualität: 7 von 7Verarbeitung: 7 von 7Akkulaufzeit: 2 von 7Lüfterlautstärke 2 von 7Gamingeignung 6 von 7Portabilität 4 von 7Kompatibilität 7 von 7Auflösung 7 von 7Support 4 von 7", "Date": "February 1, 2012"}, {"Title": "Buy Alienware's!", "Author": "Jesse D. Brown \"JDB\"", "ReviewID": "R21KQLRRSDN9UE", "Overall": "5.0", "Content": "These are all odd statements, I myself have owned several Alienware's, as well as a couple of my friends have some as well, and none of us seem to be having any of the problems that you people are having...What people have to realize is that it is not Alienware that is the problem, it is computers in general, all computers (including Mac's...) have plenty of issues... the difference is, the price tag, people automatically assume that just because an item has the highest end components as well as the biggest price tag that the thing will never have issues... well that is a very false assumption.  I have friends who have HP's, Dell's, Mac's, etc... all of which have problems with them, but because they were just junk to begin with and cost next to nothing, they just go out and buy a new one.The simple fact is, hard drives do fail, Alienware DOES NOT make hard drives, graphics cards fail, Alienware does not make graphics cards, CPU's fail, once again Alienware DOES NOT make CPU's, all, all of these companies do is take parts that have already been made by other companies and put them together for you. The big difference between Alienware and the rest is they basically only use the highest end parts made by companies such as nVIDIA, Intel, Samsung, Seagate, etc... as well as place them into a flashy case. So it is understandable that they place a higher price tag on them. Plus Alienware's whether your experience with them was good or not, certainly have higher standards than any other computer maker I have seen. When you look inside a HP, Dell, etc.. the wires are all just thrown in where ever they fit, components are tossed together as quickly as possible, where with Alienware the wires are tucked away nice and neat, and each computer is made to order (hence the amount of time it takes to actually recieve it, it isn't already in a box it still has to be made!)The claims of poor support, I do agree with, but now that Alienware is owned by Dell (acquired in 2006) support is better, (better support started around Sep of 2009) rather than sending in systems for repair, they come to your home to fix them for you, but still expect to be on the phone for an hour or so if you want to get anything accomplished.But when it comes right down to it, I myself personally own three (3) Alienware's currently and have had others in the past, the only one I ever had any real trouble with was the Area-51 m15x due to the plastic casing cracking around the hinges to the LCD display. I now have the new M15x, the M11x, and an older Alienware 750i Desktop, all of which run as good as the day I got them, and all exceeded my expectations. A friend of mine has the m9750 and loves it, has never had any issue with it, and another friend of mine has the new Area-51 ALX which runs AMAZINGLY and works perfectly.", "Date": "September 27, 2010"}, {"Title": "Alienware Beware", "Author": "Billy smith", "ReviewID": "R1G11FKA6LPAT", "Overall": "1.0", "Content": "Bought an alienware laptop computer, never moved it because it served as my htpc. About 10 months after purchase the screen stopped working. Turns out the graphics card died. Tried to get a new one sent to me to replace it but they(alienware) wanted the whole computer. Sent it in and received it back via fedex 1 month later. 3 weeks using it it went kaput again;( decided to sell it on ebay, the auction ended and I had $500 so I did what I should have done all along, bought a Mini Mac to use as my htpc & have been happy-trouble free since!!!Please learn from my mistake & avoid alienware. If you do purchase one you will only regret it. I even called the president of alienware and never a call back from anyone!!!-BillyPs. Check the YouTube videos with the search alienware problems-----then do the same for MacBook pro. Worlds apart!!!!UPDATE=============More Alienware/Dell Problems===========Poor Design=====Bad Hinges====Lack of Cooling===FAILWell, it looks like at least some Alienware M17x laptop owners just can't catch a break. While the previous so-called DPC latency issue has apparently finally been resolved, a number of users are now reporting another issue that's only become apparent after the earlier problem was fixed. As it turns out, the symptoms are similar to the stuttering caused by the DPC latency issue (hence the confusion), but the new problems are being blamed on power issues -- namely, that the GPU is drawing more power than the laptop can provide. Worse still is that it seems like those with the highest-end configuration are the most likely to experience the problem, as they're effectively maxing out an already maxed-out system. For its part, Dell has apparently fixed the issue in the most recent revision of the laptop, but users on the Notebook Review forums are reporting that the company hasn't exactly been eager to dish out replacements for everyone affected (which seems to be the only surefire \"fix\" available).Source:  Notebook Review", "Date": "September 10, 2010"}, {"Title": "Your tears give me sustenance", "Author": "quityerbitchen", "ReviewID": "R21QLFR5A4AGCM", "Overall": "3.0", "Content": "See, your major problem is that you all jumped out and bought this computer when it was new. For $4000 dollars or thereabouts? No thank you. Frankly, no computer is so far beyond its competitors to earn that sort of price tag. However, if you get it now, properly upgraded, it can hold its own with mid-level new laptops, for (personally, since I got it for $250) less than half the price. Shop well, don't buy into hype for new products, and you'll do fine.", "Date": "September 14, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "AMD 4200+ Dual Core CPU 2.2GHZ\n2GB Dual Channel DDR RAM\n320GB RAID 0 SATA Storage\n17\" Screen\n7800GTX 256MB Graphics Card.", "Name": "Colorshifting Alienware M7700 D9t", "ImgURL": "http://ecx.images-amazon.com/images/I/51kttty2whL._SX300_.jpg", "ProductID": "B0014XEDJQ"}}