{"Reviews": [{"Title": "WARNING: DELL WILL NOT HONOR THEIR WARRANTY!", "Author": "Shawn Wale \"MindsEye\"", "ReviewID": "R3PMY8VH0EZCKP", "Overall": "1.0", "Content": "I ordered a Dell Inspiron laptop 1 1/2 years ago and it worked great until recently.  The screen went black and the system would not start.  Turned out that the video card had failed.I contacted Dell customer support to activate my next business day warranty and after more than a week I have gotten nowhere with them.  My claim has been \"escalated\" twice with the same excuses and refusal to fix the problem.  They claim they have no video cards in stock and I will have to wait 2-3 weeks for a replacement card, 2-3 weeks for a loaner system, or 2-3 weeks for a replacement system -- basically my NEXT DAY warranty is anything but.I explained that this is a mission critical system and a 2-3 week delay is unacceptable given the high price I paid for the next day warranty.  I offered to take another make or model of graphics card and even offered to go buy the card myself if the agreed to pay for it.They refused to help in any way.  So, I am left with a useless laptop for 2-3 weeks until it becomes convenient for them to honor the warranty.  I will never buy another Dell product again and recommend that others who are not technically experienced with fixing computers or that need a \"mission critical\" system that they look elsewhere because Dell cannot be relied upon to fix broken systems in a timely manner.", "Date": "March 5, 2009"}, {"Title": "The worst laptop", "Author": "ALY", "ReviewID": "R3DZFRVT79YTFK", "Overall": "1.0", "Content": "The worst laptop I have ever seen in my life time. The main problem is that Video card or graphic card, which is on board, gets overheated amazingly fast once you power on the laptop. For instance, the heat of video card kick in at 80 C degree. I guess it is a design flaw that there is not enough capability for cooling the video card in this laptop. Also, Dell is very reluctant to change video card because the motherboard needs changing with a new one and cost a bundle to DEll.Never buy a laptop from Dell. Once you have a problem with your laptop, they just ignore you.", "Date": "February 23, 2010"}, {"Title": "Over priced rip off.", "Author": "Deimos \".\"", "ReviewID": "R1CIQSMOGXC2MF", "Overall": "1.0", "Content": "I paid 2000 dollars when I custom built one of these systems from Dell's online store.  At first the system running Vista home premium was great, fast and ran all the programs and games I could ever want.  After about 3 months the wireless card began failing, dropping connections and then died altogether.  So I purchased a D-link wireless adapter and my wireless was faster then it had ever been with the crappy Dell wireless mini card.  At this time I really began to also notice the system starting to degrade in performance big time.  I was running 64bit Vista and the 6gb ram wasn't even noticeable as it increased nothing and was a waste of money to add to this system.  The XPS was now performing slower than my year old Gateway T series, and the XPS had dual core processor, 6gb ram, Nvidia video card, etc  The boot up times got a lot longer too and it seems with the XPS that by just installing programs (even small ones) or games that the system got progressively slower even though it was built and paid for to handle it.  The laptop gets extremely hot and unstable when playing games like Oblivion or even watching youtube which Im puzzled with.  Also now when playing games and starting up the system crashes several times a week for no reason other than cheap unreliable hardware.  Another extremely stupid, annoying feature of any dell notebook I have used (XPS, Inspirion, Latitude) is after ripping approx two cd's worth of music or burning two or three dvd/cd's or changing disc's the dvd rom slot loading drive stops working and goes missing from the my computer screen like you don't even have a dvd rom drive, how stupid is that.  This laptop sucks.  This will be my last Dell system as their 2000$ XPS or 500$ Inspirion or Latitude all have the same horrid performance and are nothing but the same cheap, unreliable garbage hardware with different housings.Oh and as the above reviewer said Dell does not stand by their warranty.  Here is the Dell Limited Warranty on their products and as you can read it covers basically nothing.What is not covered by this limited hardware warranty?This limited hardware warranty does not cover:Software, including the operating system and software added to the Dell-branded hardware products through our factory-integration system, third-party software, or the reloading of softwareNon-Dell branded products and accessoriesProblems that result from:External causes such as accident, abuse, misuse, or problems with electrical powerServicing not authorized by DellUsage that is not in accordance with product instructionsFailure to follow the product instructions or failure to perform preventive maintenanceProblems caused by using accessories, parts, or components not supplied by DellProducts with missing or altered Service Tags or serial numbersProducts for which Dell has not received paymentNormal wear and tearF-Dell.", "Date": "May 3, 2009"}, {"Title": "Keep Your Warranty Active", "Author": "Jay", "ReviewID": "R1DCMFQ2JI86GS", "Overall": "2.0", "Content": "I purchased this pc when it first came out. It was sleek and lightening fast. I bought it to take on business trips. After about two years, it began acting erratically. As it was no longer under warranty, I took it to a local pc repairman who I've trusted with other computers. He said that Dell was aware that the Nvidia graphics card in this pc was prone to overheat. I had to replace the graphics card and motherboard for about $300. The replacement graphics card was upgraded to eliminate the overheating problem. Since it was fixed, I haven't had a problem.  If you bought this computer, watch out for a graphics card that overheats, even if you use it for routine work. And keep your warranty active.  Otherwise, it will cost you a bit more in the long run. This Wikipedia article discusses the overheating problem which was endemic with this model. [...]", "Date": "January 2, 2013"}, {"Title": "You don't get what you pay for", "Author": "Della", "ReviewID": "R2LCGF5NB7DYZH", "Overall": "1.0", "Content": "When my last laptop crashed, I wanted a good and reliable one.  This is not the one I should have bought.  I've had problems with the CD drive from day one: disc doesn't get in position unless I tip laptop on it's side, gets boiling hot after burning a couple of CDs and won't work.  Overall, it is a decent laptop, not a top of the line laptop worthy of the $1400 price-tag.  For the love of God, don't buy any brand of laptop with \"Windows Vista!\"  I believe I will try a Mac next time.", "Date": "June 29, 2010"}, {"Title": "Slim, Sexy, and Powerful... A True Classic", "Author": "D. Truong \"El Duke\"", "ReviewID": "R2S2X4J3OX95PE", "Overall": "4.0", "Content": "When it comes to computers, Dell has had a pretty good reputation for \"build quality\" in their products. But, they also have a reputation for notoriously bad \"customer service\".  One thing that I never expected from Dell was a laptop that was not only built well, but also a real \"head-turner\" . But that's exactly the case when it comes to the Dell M1330 laptop. This sleek and sexy 4 pound high-end (XPS line) laptop packs a formidable punch and offers a cool array of features & options. These features include an 13.3\" LED backlit screen (LED backlight optional), slot loading optical drive, brushed aluminum casing, biometric finger print reader (optional), Media player with travel remote (optional), integrated camera, HDMI out, Solid state hard drive 'SSHD' (optional),  and a good selection of laptop colors to choose from. To finish it off, it features powerful CPU choices ( from 1.66Ghz to 2.5Ghz \"Core 2 Duo\" Intel Processors) and an optional 128mb NVIDIA GeForce Graphics Card. But along with the good, there are a few things that keep this laptop from being perfect. One thing that I really wished this laptop had was more than just 2 USB ports. Not only that, but the ports are on opposite sides of the computer.  Also, there isn't even an option for buying an integrated Blu-ray drive... which doesn't make any sense when you see that there's a beautiful 13.3 wide-screen and HDMI port on this thing.Still, there's a lot to love about the Dell M1330. It's ultra portable/super thin wedge shape design, full-sized keyboard, and built-in memory card slot, integrated web-cam & mic, and 2 headphone jacks,  also adds to it's intrinsic value and charm. Few laptops can match both it's 'power per size' ratio. And although it's been available now for a couple years, it can still hold it's own among some of the newer laptops on the market.  And when it's all said and done, I think that it makes this Dell a true \"classic\"... especially now that Dell has discontinued this model. It can still be acquired \"new or used\" on sites like Ebay, through Dell's online Outlet store, and other online sources. It's also still available at some retail stores.Pros:-Beautiful glossy 13.3\" wide screen (also available with LED backlight)-Great super portable, sleek, light, and sexy design.-Powerful (up to 2.5GHz Core 2 Duo and 128mb NVIDIA GeForce Video Card option)-Nice array of colors available including \"Blue, Pink, White, Black, and Red\"-Slot Loading Optical drive-Wide array of hard drive options including SSHD, easy to DIY hard drive upgrade as well.Cons:-Only 2 USB drives-No Blu-ray Option-Standard 6-cell battery doesn't last too long (about 2 hrs) Don't even bother with 3-cell batt.-9 Cell battery available but it's very expensive and adds much bulk to laptop.(sticks out too)Conclusion:This is a sexy and powerful high-end ultra-portable laptop. I've heard that it was rated the most powerful laptop per it's size (when it was first released) ...But this may not be true anymore. The XPS line of Dell laptop has a higher build quality than most regular consumer laptops on the market. And because the prices for this model has drastically dropped (now that it's been discontinued), it's even more of a bargain. Mine has been very dependable and I'd highly recommend it to others.", "Date": "October 1, 2009"}, {"Title": "Keep away!", "Author": "What Ever", "ReviewID": "R3F6QLB7N3PITN", "Overall": "1.0", "Content": "I am not writing this review on my Dell XPS M1330. It has been broken for more than a week. Just had the 3rd motherboard replacement in the 15 months that I have owned the machine. This last one was so bad it wrecked the operating system. Now I have to pay more than $300 to have a Dell technician come out and recover the data on the hard drive and reload the OS. I can do this myself but then I will void the warrantee. Clearly you need that. They claim this is a software problem and they refuse to accept that the hardware failure caused the software problem. They also would not admit that this is only the beginning of hard drive failure and only a matter of time before it fails and I will be out even more money and data. If you do not mind some of the worst build quality and cheapest parts the industry has to offer then this product is for you.", "Date": "March 27, 2009"}, {"Title": "Great performer until the motherboard fails, again.", "Author": "R. Porter", "ReviewID": "RP9BBIII4LDGF", "Overall": "2.0", "Content": "We have owned an M1330 Dell XPS laptop for about a year and a half now. about 8 months in the motherboard failed. After 4 hours on tech support they agreed to fix it under warranty. Now, 8 months later the same motherboard failure has stricken the computer rendering it inoperable.When it works, this is a fast, light, portable performer. If you can afford a new motherboard every 8 months, go for it, otherwise I recommend staying as far awas from this dog as you can.", "Date": "July 18, 2009"}, {"Title": "wont turn on?", "Author": "maryellen harlow", "ReviewID": "R2JSU92PERJTX0", "Overall": "1.0", "Content": "Do you mean to tell me that the Laptop Does not work?  How about figure out the problem then I might look into it.", "Date": "May 4, 2014"}, {"Title": "returned 2 both defective", "Author": "Robert Miller", "ReviewID": "R2RB9EBON2QUX8", "Overall": "1.0", "Content": "Tom at incomputer was great he excels at customer service the laptops were a bust he did refund my money the first lost hard drive connection the second had drivers that were not operating the graphics driver was out and since it was bought so my grandson could play  minecraft it was useless to him other than for school work ended up spending 3 times the money for a new Toshiba", "Date": "September 23, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "The copy of windows 8 is new", "Name": "Dell XPS M1330 Laptop - (Crimson Red)", "ImgURL": "http://ecx.images-amazon.com/images/I/51pKYxgSv%2BL._SY300_.jpg", "ProductID": "B001ATK8A2"}}