{"Reviews": [{"Title": "Let the buyer beware", "Author": "DorothyOfOz", "ReviewID": "R9RPOUSH68V77", "Overall": "1.0", "Content": "Don't throw caution to the wind as I did.  There's a reason why this product is \"remanufactured\".  And by the way... it DID NOT COME WITH WINDOWS SOFTWARE installed or otherwise.  This is a BAD DEAL!", "Date": "March 11, 2009"}, {"Title": "disappointed", "Author": "Fred \"Fred M\"", "ReviewID": "R2MDHHONY4TX1S", "Overall": "2.0", "Content": "i didn't expect much - i mean less than 300 hundred dollars HOWEVER it came with NO POWER CORD! that struck me as a little too low on the consumer shaft level! it also appears to be totally void of any programs what-so-ever - NOT AS ADVERTISED at all - it's pretty beat up as well but i'm hoping to salvage at least something as soon as my computer friend gets done looking at it! think twice before you do what i've done here!", "Date": "June 7, 2009"}, {"Title": "this computer will not come as shown BEWARE BUYERS", "Author": "James Smith \"jamerson229\"", "ReviewID": "R31O7DS71C31H5", "Overall": "1.0", "Content": "HI EVERYONE LOOKING TO BUY ONE OF THESE LABTOPS I HAVE DEALT WITH THESE PEOPLE THREW 2 DIFFERENT LABTOPS AND BOTH OF THEM WERE BADLY DAMAGED DIDNT HAVE THE RITE SOFTWARE INSTALLED INTO IT I COULDNT NEVER GET ONLINE ALSO WHEN I TURNED THEM BOTH ON IT HAD LINES RUNNING UP AND DOWN THE SCREEN IT FINALLY WENT AWAY AFTER 4 TO 6 HOURS SO IF YOURE LOOKING FOR A GOOD DEAL THIS ONE IS NOT FOR YOU IF I KNOWN THAT THIS COMPUTER HAD ALL THESE PROBLEMS I WOULD NEVER EVER HAVE PURCHASED IT AND NOW IVE BEEN DEALING WITH THIS SELLER FOR AWHILE NOW TO GET MY REFUND BUT CANNOT GET A RESPONSE", "Date": "February 3, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Latitude D600 PM 1.4GHZ\nGraphics-ATI RADEON 9000\n14\" Super XGA 1280 x 800\nWi-Fi configured; DVD-R/CR-W\nWIN XPP-SP3", "Name": "Dell Latitude D600 Pentium M 1.4GHz 30GB 512MB CDRW XP Pro WI-FI", "ImgURL": "http://ecx.images-amazon.com/images/I/41LpDzlwzUL._SY300_.jpg", "ProductID": "B001GZPOEU"}}