{"Reviews": [{"Title": "Awesome product", "Author": "dennis r crabbe", "ReviewID": "R1THLUM63F7WHH", "Overall": "5.0", "Content": "I own several Toshiba laptops, and this is by far the most efficient one that I own. This laptop is perfect for my needs with college, work, and of course entertainment. I use Microsoft Office Professional on this computer and so far I haven't experienced any problems. I can work on Microsoft Powerpoint while listening to music on Itunes, and still search the web without experiencing any problems at all. This laptop is designed perfectly for typing, and the weight of this particular model is perfect when typing from your lap. I purchased my laptop from Office Depot for 575.00 it was the last day of the sale, but I would have paid much more for a machine of this quality. If you have any question than just reply to this message and I'll try my best to answer it for you, good luck on your decision!Dennis", "Date": "September 5, 2009"}, {"Title": "Awesome Machine!", "Author": "John K. Wilson", "ReviewID": "RIQB9HXDOCM5O", "Overall": "5.0", "Content": "Forget all of the complaints about Vista b/c those are the only complaints you will hear about this beauty.  The machine is fast, responsive, and more of a laptop that most people will EVER need.  It has sleek appearance and an amazing display.  I just broke mine out of the box today and here I sit typing this review.  I returned a HP Pavilion with a crashing hard drive and made the upgrade back to Toshiba.  I will never go back!!!", "Date": "August 30, 2009"}, {"Title": "Great machine, poor sound control", "Author": "Decio Chaves", "ReviewID": "R12E2KCOSOXNYE", "Overall": "4.0", "Content": "Terrific laptop during four weeks of experience. Only problem is the disappointing mechanical sound volume control, reported elsewhere for other Satellite equipment. Otherwise would have received 5 stars. Good price!", "Date": "November 3, 2009"}, {"Title": "Nice laptop for the price.", "Author": "Randall K. Woodruff", "ReviewID": "R2MN1OCLW5O6WF", "Overall": "4.0", "Content": "Works good for what I need. The only negatives are that all the plugins are on the right side. If you use a mouse the wiring is in the way.", "Date": "October 2, 2009"}, {"Title": "Great For Daily use.", "Author": "Parth", "ReviewID": "R2CG823O6WBTFM", "Overall": "3.0", "Content": "Errm.. bought this three years ago. Still running good with-out any issues! Toshiba is known for long-lasting laptops. However speakers are so cheap, i can barely here. Sometimes, I think I am deaf. Please do yourself a favor and buy a headphones with it. I love the media control buttons. The web cam is cheap too, not great quality. Nice num pad on the right, THe keyboards types very nice!! Thats the best thing about it, the keyboard! It's heavy for a laptop. Battery is good. 3/5", "Date": "July 7, 2012"}, {"Title": "Toshiba Satellite L505 Laptop is about average", "Author": "T. Boone \"hot tea\"", "ReviewID": "R217X5N6NHJW23", "Overall": "3.0", "Content": "I was hesitant to buy a Toshiba laptop - I never had this brand before for any device.  But I bought it new and for a competitive price for a dual core processor.  My Toshiba Satellite L505 Laptop is versatile, functional, lightweight, and is nondescript aesthetically.  (As far as the latter is concerned, I would rather have the first three hit the target without any flamboyant styling anyway.)  Windows 7 Professional and high powered software run well.  The keypad is smooth and comfortable as well as the screen size - it makes it for a very comfortable work travel buddy.  However, I have had this laptop just over a year and a half and I am already getting error messages that the battery may need to be replaced.  This warning has recently come up so it may not have given me enough time to order a replacement unless I spend the rush shipping to get it here!  I must say it is a disappointment.  My previous, other brand name laptops were well over 3 years old and the batteries still worked and charged fine - but the hard drives or motherboards died out after about 3 years.So Toshiba has disappointed me for all reasons green.  It is bad enough that everyone is changing out other electrical devices and batteries at a record pace these days - but now we will see millions of Toshiba laptop batteries hitting our nearest landfills at record paces.Hard drive deaths or shotty batteries - either way, buying a laptop is a crap shoot.  Do not expect to have your Toshiba for 1.5 years without having to replace battery.  By the way, I did NOT keep it plugged into the wall 24/7 (being green) and it was ALWAYS connected to a surge protector. I think it got pretty good treatment.  It is a shame that consumers are not getting the good treatment we deserve by being able to buy laptops that can be reliable for a while.", "Date": "April 7, 2012"}, {"Title": "I love my laptop!", "Author": "RS", "ReviewID": "R3IXYO917MTNEY", "Overall": "5.0", "Content": "I got this laptop last year for $350 (not from Amazon)! It has been a great laptop! This laptop is on for about 22 hours a day, everyday, and it is still working flawlessly. I type 20-50 page papers once a month, and the keyboard is still working as good as when I bought it! However, when I bought it, I installed Windows 7 on it right away. The only con to this laptop are the speakers-they are aweful! Other than that, this laptop is perfect, and I have not had one single problem with it. I was scared to try Toshiba, but considering the price, I couldn't resist, and now I am glad that I didn't. Thank you Toshiba for being so reliable!", "Date": "December 20, 2010"}, {"Title": "GREAT!", "Author": "RAMiTO \"SNeaKeR HeaD ^SB^\"", "ReviewID": "R2EMPANBMA1LV0", "Overall": "5.0", "Content": "i had this laptop for over a year and is great for everyday use i had some problem with the webcam but i sent it back and in one week it was in my house fix very satisfied. Fast and you can customize it like more ram and graphic card the only problem with this laptop is NO HDMI :( but other than that a great laptop", "Date": "September 9, 2010"}, {"Title": "lousy repair service", "Author": "meisjevanleuven", "ReviewID": "R2USQZODN51RC6", "Overall": "2.0", "Content": "I bought this laptop a few months ago, and it worked just fine until recently when it started having problems recharging. I subsequently discovered that Toshiba does not have a helpful repair system. I called Toshiba twice. The second time it was determined that the problem was the battery, but even though I told them I was going to be out of the country a week later, and had already made a service call a week earlier, they were not willing to send me a new battery in less time than ten business days, so not in time for me to take my computer with me, even though it was still under warranty.It was also not possible to just go to a service center in my area to have the battery replaced because the policy is that all the computers of this type are sent to Toshiba depot for repair.So, no matter what problem one may run into, it will take a mimumum of ten business days to have it fixed, which implies that this computer is not a good option for people who cannot miss their computer for that much time.", "Date": "March 31, 2010"}, {"Title": "Great laptop", "Author": "Tanika L. Carroll", "ReviewID": "R1QG1I70W0QNBP", "Overall": "5.0", "Content": "I received this laptop as a birthday gift in August, and I love it very much. Although this isn't the exact model that I have it is very similar. The only differences with mine is the model number. Mine is the L505-S5971. The other difference is that mine doesn't have all the other keys that are next to the power button up top. It's still a wonderful laptop. My first laptop was the HP COMPAQ that I bought myself in 2005. It has lasted me until it finally conked out on me completely this past July. So I definitely got my money's worth out of it. Hopefully this one will do the same. I love the features that it has on there. Although I must admit I do not know all of the technical stuff and what it means but it's allowing me to do things on here that I wasn't able to do on my COMPAQ. Great laptop. I definitely recommend this product. Whichever model you get from Toshiba. I'm very happy with mine.", "Date": "September 13, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002BDU8WO"}}