{"Reviews": [{"Title": "A Solid Machine", "Author": "Kevin Seeley", "ReviewID": "R1TGBIFDF77X49", "Overall": "5.0", "Content": "It is important to note that I am reviewing the s6992 model ($899). The only real differences that I have noticed between this model and the more expensive model is the lack of a blu-ray drive and that there is no keyboard back-lighting. If these are important to you, then you should definitely get the most expensive model ($1099).I purchased this laptop about a week ago, through tiger direct, for college use after my ASUS had failed (major hardware issues). So far, I am very impressed. There are better lengthy reviews on this model already (see Mad B's for example), so I shall keep this brief.Pros: - Gaming: I am not an avid gamer, but it was important to me that my new rig could handle any new games that I would want to throw at it. To be clear, games on this machine run beautifully. The 230M is a true performer, and I had no problem playing Team Fortress 2 and  Left 4 Dead 2 (demo) on this machine at max settings. I am confident that you would be able to play more demanding games with no problems. - Windows 7 : Loving it so far. I have had zero compatibility problems with my favorite programs, and if you are buying a new laptop, you may as well get one with the latest OS. - Full Keyboard : Just a nice feature to have, really. - Speakers : Great for just listening to music or watching a movie. These speakers are plenty loud and aren't tinny like most laptop speakers.  (NOTE: There have been some reported problems with these speakers just not working suddenly. Before you assume it is a driver issue, turn off the laptop, take out the battery, and reinsert. This inexplicably seems to fix the problem. This has only happened to me once, but is a common issue with the A505 series.)Cons: - Battery Life : About 2 to 2.5 hours on a low power setting. If you are gaming, forget it. It is important to know this going in. If you don't like to have your laptop plugged into the wall most of the time, then you will want to look into some other options. If you are like me, and this is more of a desktop replacement, then no issue. - Finger Prints! : Don't get me wrong, this laptop is very attractive...just pre-use. I am constantly wiping this thing down with a micro-fiber cloth after use, to keep it shiny. Not really that big of a deal though.Overall, I'd give this a 9/10. If you can forgive the battery life and deal with the finger prints, you can enjoy a laptop that can handle itself pretty darn well.", "Date": "November 9, 2009"}, {"Title": "Toshiba Satellite A505-S6992 - good for consumers, 'OK' for the budget conscious technophile", "Author": "IT-Guru", "ReviewID": "R1X1B8X7MPVZ3P", "Overall": "3.0", "Content": "I own this notebook for the past 4 weeks, and used it hard since then. I bought it at FRYS for 750 USD; at that price it's a good notebook, but at the MSRP of 900 USD it's merely average.The good:- 64bit edition of Windows 7- Bright LED Screen- ECOnomy mode- 4 GB of faster DDR3 RAM- 500 GB Harddrive- Nvidia Geforce GT230M videocard- Higher End Multimedia options & connectivity (Firewire, HDMI, eSATA)- sensitive WI-FI card with Draft N protocol- in-built Accelerometer that 'protects' the harddrive better versus data-loss when the netbook gets dropped or bumped- slot-loading DVD-burner - no accidentally breaking-off the DVD-tray- decent Audio-speaker that actually can be loud and do not loose their sound quality; to top it off, the Speakers are housed in their own vibration-padded casing.- OPTIONAL a 12-cell battery can be purchased separately at Toshiba, which becomes a necessity if you're on the go a lot.The bad- Battery Life - a standard 6-cell Battery- Battery Life (again - why? because the battery is dead after 1 hour when watching a movie, or playing a AAA-game)- slow harddrive (takes forever to boot-up from 'cold' state)- no Bluetooth- no inbuilt keyboard back light (so you can see and type in the 'dark')- comes pre-installed with a lot of \"shovel-ware\" (that is; installed software that's not needed because windows7 has them already integrated) that causes to prolong the boot-up process tremendously.- Toshiba deviating from the MXM-standard (Mobile PCI-Express Module) for mobile video-cards - that means, you cannot easily replace the 3D-video-card against a better/faster one, down the road, to prolong the value of your notebook- in-built Processor does NOT support Intel's VT - The ability to run hardware support for Virtual Machines (i.e. Windows XP Mode in Windows 7 Professional & Ultimate)Quintessence:It's a decent system, if you get it for cheaper (as I did) than the MSRP. the Video-card is, as of time of writing, considered a \"high performance\" model, compared what's currently out there for laptops. The lack of BluRay drive I consider not a problem, since the 16-inch screen-size does not really require Hi-Def resolution. Speakers have a good sound, compared to other notebooks out there. What bugs me most is the Battery-Life, it's okay for \"web surfing & word processing\" (about 2 hours, 2.5 hours with the ECO-mode active), but if you're watching movies or playing AAA-rated games, the battery is dead in ~1 hour or less. It's highly recommended to purchase the optional 12-cell battery. What i miss the most - other than the battery life - is integrated Bluetooth (for wireless stereo headsets) and the keyboard not being back-lit (for better typing in low-light/dark). It needs to be noted that the Laptop has eSATA and HDMI connectivity, for high data-rate transfers with external harddrives or other devices, and for Hi-Def audo/video connectivity. the eSATA-port is also an USB-port at the same time, which allows to charge external devices (cellphones, MP3 players and such) while the notebook is in \"sleep mode\", but that is only feasible when the optional 12-cell battery is used/installed.What upsets me the most is that Toshiba deviates from the MXM industry standard of mobile video cards, which would allow to replace the video-card against a newer one to make the Notebook last longer in value - especially if you're a avid computer gamer. But for 90% of all consumers out there this is usually not much of concern.According to a recent survey, Toshiba and ASUS notebooks are currently the longest lasting one, whereas DELL and Hewlett-Packard notebooks have the shortest life cycles; which is also a reason why i bought this notebook.It's worth four stars at my purchase price, but only three stars at MSRP.Verdict:Buy it, if you get it for cheaper than the MSRP", "Date": "December 22, 2009"}, {"Title": "Awesome Laptop All Around", "Author": "mrooobaa", "ReviewID": "R3USJVECTMO27T", "Overall": "5.0", "Content": "It's too bad Toshiba stopped making this laptop, because it's an excellent laptop. I'm a full time student who likes to do gaming on the side, and this works perfectly. The laptop has a good, solid feel, and it also isn't too heavy.For starters, this laptop has a TON of features. Firewire 400, eSATA, 4 USB 2.0 ports, VGA out, HDMI out (can easily be converted to DVI if needed), and much more. The applications it comes with are also pretty useful. It has one app that can detect whether the laptop is in motion or not. When it detects motion, it takes the reading head off the HDD, so if it's dropped or whatever, the head won't crash into the HDD, and there will be a smaller chance of the laptop getting damaged. I'm wondering why it has a 56k/fax modem, but it does, so if you need it, this is one of the few laptops that has it built in. They should have put in Bluetooth, but there's some tiny adapters out there, so it's not a big flaw. The keyboard has an excellent feel to it, and it even has a number pad on the side (without having to use \"Fn\" keys). The touch pad for the mouse works well, but it would have been nice to have features like multi-touch for doing two-finger scrolling. The screen resolution is a bit low at 1376x768, but it manages to work. Overall, it's a decent looking display, but 1600x900 would have been more appropriate. The other really, really nice feature of this laptop is the 1GB GDDR3 GT230M video chip. It has its own memory and processor, so it runs games quite well. I was able to max out Left 4 Dead with zero lag. 512MB probably would have sufficed, but if you're using the HDMI to output it to a 1080p display, the entire 1GB will come in handy. The Core 2 Duo CPU is also fast enough for any game, and it will do a great job at any number crunching you can give it. The DDR3 memory also saves a little bit of power compared to DDR2 memory.My only serious complaint about the laptop is the battery life. If you need it to last longer than 2-3 hours, you must use the eco mode. It works pretty well in eco mode, but it's seriously under-clocked (the CPU is run at a slower speed to save battery life), so no serious gaming is possible with it on. It's not a bad idea to pick up a larger battery for this laptop.Overall, it's a solid laptop, and I'm quite happy I bought it. This is exactly what I needed for school, and I'm disappointed Toshiba stopped making it (probably to replace the CPU with an i3 or an i5, but we'll see).Pros:-Eco mode gives ~+1 hour battery life-DDR3 memory saves some battery-CPU is plenty for just about anything you would want to do on a laptop-Dedicated Video card handles all games that are currently out on the market-Nice keyboard-eSATA, Firewire, S/PDIF out, and plenty of USB ports-HDMI out-Solid feeling laptop-HDD monitor is a great add-onCons:-Battery life is a little short, even with eco mode-Screen resolution is a bit low at 1376x768, would've preferred at least 1600x900-No integrated Bluetooth-Camera/mic quality isn't great-No multi-touch for the mouse pad", "Date": "September 11, 2010"}, {"Title": "S6992", "Author": "Ben", "ReviewID": "RM1YXQIJ2VXRO", "Overall": "5.0", "Content": "Bought this along with a S6997 recieved both computers in great condition, and fast shipping, Very happy with this computer, Have two older toshibas, and they are still going strong, would buy these again", "Date": "April 14, 2010"}, {"Title": "Toshiba Satelite A505-S6992 TruBrite 16.0-inch Laptop", "Author": "GoSha \"GoSha\"", "ReviewID": "R1LZ700GQ9PLJI", "Overall": "5.0", "Content": "The Toshiba Satellite A505-S6992 TruBrite 16.0 inch Laptop computer is great, and a must buy if your looking for a laptop with a large hard drive ( 500gb )Plus Windows 7 Home Premium. I use it for making Nature slide shows, and videos. It's well worth the money.", "Date": "January 31, 2010"}, {"Title": "One Considerable Dilemma", "Author": "H. G. Osborne", "ReviewID": "R2ACZLVKEW3L3P", "Overall": "4.0", "Content": "Although the Toshiba Satellite A505-S6992 is an impressive machine, beware of the crackling of the wonderful Harman/Kardon speakers. If you experience this issue upon purchase (as I have), there is a forum with advice from other consumers who've faced the exact same problem.Google <[...]> and the site should appear at the very top of the results. Though there is no evidence of a foolproof solution as of yet, there are many helpful suggestions pertaining to specific drivers as well as resourceful input from other individuals who post updated information regarding current updates offered by Toshiba that may be useful in addressing the matter.I would have loved to have rated this notebook as a five star item. However, until an update is offered by Toshiba to resolve this issue, I think a four star rating is appropriate.", "Date": "December 27, 2009"}, {"Title": "So far so good, with few drawbacks", "Author": "A. S. Hammad", "ReviewID": "RFAFAGIJNSYEN", "Overall": "4.0", "Content": "I bought this machine last week to serve as my primary machine (desktop replacement)As a software developer, I usually care to have a powerful machine (at a suitable price), and I don't mind to play some network games from time to timeFirst of all, I got this machine from Amazon for only $850, so if it's out of Amazon's stock and you see it sold by another merchants at a higher price, you should wait till it's back to Amazon's stock, or go and buy it from Toshiba directly... You should never pay more than $900 anyway...PLEASE NOTE !!!! Another Toshiba machine with a higher screen resolution is available at the same price, it's only inconvenience is being bulky and heavy (model: P500-ST68X1), so if you really look for a desktop replacement and mobility is not so important for you, you should think about the P500-ST68X1Back to this machine, regarding to the pros, I think you can get most of it from the machine specs:1. 500GB HDD, 4GB DDR3... Should keep you running for at least 2 years2. 16\" True Brite display... Pictures and movies Looks wonderful with TrueBrite3. Dedicated NVidia graphics memory rather that a shared memory Intel chipset... Should be very important for gamers. I havent tried it yet with gaming, but I think it will work great4. Windows 7 Home Premium: Haven t spent much yet testing it, but it looks more appealing that the stupid Vista... I was totally against the idea of migrating to Vista (after testing it with one of the workstations at work), however, Windows 7 looks much more mature to me than Vista... So, probably I'll keep it and wont downgrade the machine to XPOf course there are some cons, I agree with all described in other reviews, and I like to add the following:1. Be careful, screen resolution is only 1366x768... It looks great with movies and pictures, but if you like working at super high resolutions and you love to read tiny fonts (like me), this screen might be a bit disappointing for youMy other laptop is a Lenovo W500, offering a resolution of 1920x1200... So I miss the feeling of having this global view for my applicationsHowever to be honest, Truebrite still appears to be more vivid than Lenovo's2. Be careful, the 2 memory slots are already used, so you can only upgrade the laptop memory by replacing installed chips3. Be careful, 16\" laptops will probably not fit in 15.4\" cases, so you'll probably need to buy a new laptop case for this machine4. I totally agree that the machine comes loaded with lots of unnecessary software... I've already uninstalled lots of that5. I totally agree that the laptop finish although it appears very elegant, it's still very annoying when it comes to finger prints (they occur very easily, look very ugly, and you'll suffer to remove it)6. Socket loading CD-ROM, it looks fancy, but I feel it's somehow fragile (just a feeling)7. I still dont feel conformable with the touchpad (maybe it's a matter of time, but so far I cant have good control of it, even after changing its settings several times)Another important piece of info, according to Windows 7, this machine has an overall Windows Experience Index of 5.7, which is fair enoughConclusion:Good machine for all purposes, I don't regret buying it at all, it's just that you need to understand all cons very well and accept them, then probably you'll see that this is the best machine you can get within this price range if you look for mobility and power", "Date": "December 30, 2009"}, {"Title": "BEWARE! USB ports broken after 6 months and not covered. NOT WORTH IT!", "Author": "Kodok Ijo", "ReviewID": "R2H5M4FOH32M49", "Overall": "1.0", "Content": "I bought this notebook on Oct 22nd, 2009. Last night I found out that the USB slots on the the notebook cannot be used anymore. That's only about 6 months since I purchased the item. The slots was pushed back in. The weird thing is that ALL of them (3) got pushed back at the same time. There's no way I can make backups now since I have no access to the notebook.I never dropped the notebook, it was VERY well taken care of. Most of the time it just sits on my room, almost never took it out.I called Toshiba and they said that it's not covered under warranty. They're basically giving me the finger for their own incompetencies creating a reliable hardware.I have had a Dell laptop (supposedly inferior to Toshiba brand) for 5 years and NEVER even once had to send it in. The reason I switched to Toshiba is because I thought Toshiba has better quality, and the Dell laptop hardware is getting too outdated for today's software performance (it's a 5 year laptop.. what do you expect?).This would be the last time I'm getting laptop from Toshiba (had a DVD player and portable HDD from Toshiba.. works fine).", "Date": "May 6, 2010"}, {"Title": "Toshiba Customer Service is HORRIBLE...BEWARE!!!", "Author": "Shine1Light \"Frustrated Customer\"", "ReviewID": "R1LQXMAH45C9YM", "Overall": "1.0", "Content": "I bought a Toshiba Laptop in August and I have had an absolutely AWFUL experience with Toshiba since the day I got this thing. On several occasions I have met with INEPT Technical and Customer Service staff and whenever my call was forwarded to a \"Manager\" the person basically reiterated the feedback from the staff, and on two occasions were RUDE and absolutely NO HELP AT ALL. When I mentioned in my last call that Toshiba Executives need to know how their customers are being treated and that I CANNOT recommend their computers to anyone in good conscience, I was told \"suit yourself.\" To give you an idea of ALL the headaches I have undergone since I bought my computer....here is a short list:1) My computer came with Windows Vista and kept crashing. Toshiba's Tech. people said that it was due to \"glitches\" with the operating system and said that I would have to back up my data and re-install the OS. Remember people, this is a NEW computer that is supposedly under warranty! Their Tech. people also had the nerve to tell me that they \"did not have the training\" to tell me how to back up my data and once I took it to Best Buy and PAID to have my data backed up, then they could tell me how to reload the OS!2)Also, when I purchased the computer, there was a catalog insert in the Toshiba packaging that offered a 3-year extended warranty for 15% off. However, when I called Toshiba to buy the warranty, AGAIN, their Customer NON-Service people quoted me a price that was almost $100 more than the price in the catalog and told me that they did not know anything about the reduced price offered to purchasers of new Toshiba computers. When I told them that the catalog was sent INSIDE the Toshiba computer box that was sent to me from Amazon.com, they told me that I would need to \"find a Kinkos and fax a copy of the catalog\" to them \"for review\" and they will \"see if the management will honor it\"!!!!!!!!!3)Finally, to add insult to injury -- when I purchased this computer, I was offered a \"FREE\" upgrade to Windows 7, but when I went online I found out that I had to PAY almost $12 for \"shipping and handling\". Okay, I swallowed that insult, but THEN after 25 minutes entering all the order info. the Toshiba site would not allow me to enter in my Credit Card number to pay for the thing. When I called their Customer Service people, they had NO CLUE what to tell me. After 45 MINUTES -- and after talking with 4 different people -- they FINALLY transferred me to a \"Manager\" who ALSO had NO idea what to do and said that \"I guess the website must be having problems, so try again later\"!!!Look, all I can say to anyone who wants to buy a Toshiba is BUYER BEWARE. Their Tech. people have NO CLUE, their Customer Service is INEPT and their Management is DISGUSTINGLY RUDE!!! Dealing with Toshiba is a NIGHTMARE! Consider yourselves warned!", "Date": "December 1, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002P8M8EG"}}