{"Reviews": [{"Title": "Amazing!!!", "Author": "yesy", "ReviewID": "R7UV16KZUTA3N", "Overall": "5.0", "Content": "This is an amazing labtop. Got it for a great price and I really love it! This should have been at least 600.00 when I bought it and I got it for less than 500.00.", "Date": "December 1, 2012"}, {"Title": "A good backup computer. Amazing price! (3.75 stars)", "Author": "Etienne", "ReviewID": "R27QD8NKBMWTII", "Overall": "4.0", "Content": "I purchased this laptop in late 2009 for $500.00 brand new. For all its flaws, I could look past them knowing I'd never buy a then new computer that cheap. Not once have I had to take it in for maintenance! It's spared me the grief that a 2 year warranty would otherwise cover. I don't expect to have any serious problems with it. It is highly recommended that you upgrade to Windows 7 home premium, and ditch Vista. Mine came with a free upgrade, and it loads much faster.Pros:-10-Key pad! (This was what ultimately sold me.)-Fast loading at startup and online.-\"Classic\" desktop theme makes the computer compatible with older games and programs that required Windows XP to run.-\"Energy mode\" makes the battery life much last for about 6 hours.Cons:-The shell is plastic. Try not to be careless with it.-Portable, but not lightweight. (6.5 lbs)-Unplugged, the battery life while internet surfing can barely make it two hours.-Low end video card. (Nvidia 8200M) Will run \"heavy\" games like the sims 2, but this is not a gaming computer.", "Date": "May 24, 2011"}, {"Title": "Battery gets ridiculously hot!", "Author": "rrobins", "ReviewID": "R3NYOL5RFNEJNI", "Overall": "1.0", "Content": "If you get this laptop at a reasonable price I would not deter you from buying it, otherwise choose another laptop. I am not against HP's cause I've experienced others that do not suffer from the same 'defects' as this.1)Don't put this laptop on your lap, you will get 2nd or 3rd degree burns2)Do not expect exceptional battery life (although the same can be said about half the pc's on the market today) but expect to be connected to the power cable for the most part3)It may run slowly at times but to be fair be sure the cause of that is not user basedAll in all it is not a bad machine but HP definitely needed to iron out these issues before releasing this product", "Date": "October 31, 2010"}, {"Title": "Had it for years and am writing this review on it", "Author": "Fernando", "ReviewID": "R30TJM5OPT0JX5", "Overall": "4.0", "Content": "I've had this laptop for 3 years so far and its still running strong. Honestly I love it flaws and all that is why I gave it 4 stars and not 5. Problems so far is the battery sucked never lasted long neither in charge or time I had it so it was not missed when it died, It was my first laptop so I don't know if others have this problem. You have to keep it WELL ventilated if you don't you will have problems if you watch videos they will get choppy or games will lag bad. I've tested this so yea Its a good laptop and can do things like video editing just keep it ventilated.Pros: good for playing old games, good for web surfing, music, or school suff, has hdmi so you can stream to a hd TV like I do. SD card slot and 3 usb, and overall reliable.Cons: Can run hot so keep it well ventilated, Battery sucks it died after warranty expired,", "Date": "December 1, 2013"}, {"Title": "Hot....", "Author": "gliffy", "ReviewID": "R3UW4IR4S3WQ0T", "Overall": "2.0", "Content": "For the price, I thought this would be a decent buy. The specs looked amazing on paper with a good processor, enough ram and memory. The big screen is nice too. It was nice having the HDMI and also SD/XD/etc card slot. Make sure you get the windows 7 upgrade too, it was well worth it.Cons:  As already mentioned,the battery is poor. I couldn't make it through a 2 hour class without it being plugged in. The battery was shot after a year. The computer itself heated up really fast... faster than any other laptop I have used; a friend told me that HP used cheap hardware for a couple of years, and that is why this model gets really hot. I also noticed early on, that the power supply connection was never secure, it seemed to wiggle easily. I also noticed that the CD drive was really loud, but that is understandable being it is a laptop.My biggest complaint with this computer is its poor recording capability. This computer wasn't able to record anything of notable quality, from webcam videos to audio from lectures I attended (using one note). It always turned out bad, after multiple calls to customer support, re-installing drivers and updating them again, the problem was never solved.  There are also multiple forums about users experiencing the same problems... just look up HP G60 recording issues.", "Date": "December 10, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Turion X2 RM-75 / 2.2 GHz - RAM 3 GB\nHDD 320 GB Hard Disk\nGF 8200M G; DVD?RW (?R DL) / DVD-RAM\nWLAN : 802.11b/g\nVista Home Premium", "Name": "HP G60-445DX - Turion X2 RM-75 / 2.2 GHz - RAM 3 GB - HDD 320 GB - DVD?RW (?R DL) / DVD-RAM - GF 8200M G - WLAN : 802.11b/g - Vista Home Premium - 16\" Widescreen TFT 1366 x 768 ( WXGA ) BrightView - camera", "ImgURL": "http://ecx.images-amazon.com/images/I/51yx76bhqWL._SX300_.jpg", "ProductID": "B002QNHIIQ"}}