{"Reviews": [{"Title": "Fine machine with a few lil things", "Author": "Paxson", "ReviewID": "R2STXP4HAH4P3D", "Overall": "4.0", "Content": "It's a great machine. It's light. It's really thin. It performs like a big ol' laptop. I don't know about massive performance - I'm not a gamer... just a guy who uses a laptop for work, surfing, writing, editing pics, videos. And it works really well.The funk comes with the touchpad and click bar. And the scroll buttons. Other odd keyboard anomalies. But with a small wireless mouse and some getting used to the layout, it's going to be fine. (But really, the mouse and click bar thing really sucks.)Overall I'm really happy not lugging my big heavy short-battery-life-with-a-list-of-things-that-just-stopped-working-HP 6100 series laptop around. This machine is a refreshing change in weight and function. (So many HP computers out there for so little money, but I won't ever buy another one. What a piece...)The included external optical drive didn't work right out of the box, but I found the MSI tech support in L.A. to be efficient and quick with the RMA.", "Date": "September 13, 2009"}, {"Title": "Excellent Ultra Portable Notebook", "Author": "Reginald Garrett", "ReviewID": "R1MXFK8AQNIQP", "Overall": "4.0", "Content": "After much debate and hand wringing about what my next laptop should be, I decided to review actual tasks that I would be performing.  These include; writing papers, playing moderately graphical intensive online games i.e. Second Life, VirtualBox virtual machine, internet surfing, and of course, enjoying my legally obtained music, movies, and pictures.  I require a larger screen with great graphical capability, easy portability and decent processing power.  These requirements led to considering the Apple MacBook series.  The AIR, while powerful, portable and extremely sexy, was too lacking in external ports to be practical.  The other MacBook models were far too expen$ive.  The Alienware models I considered were certainly powerful enough for all of my activities, but they were super heavy and super expen$ive as well.  I needed to find a middle ground.Enter the MSI x600.While I had not really heard of this brand outside of the motherboard realm I performed my due diligence.  The terrific options, reasonable price, and super portability allow me to comfortably perform ALL of the above tasks and then some.  This feat would not be possible at all on any netbook.  And the powerful desktop replacements would not be practical since I would need to live under a bridge in order to afford one.The x600 is not all wine and roses however, in that there are odd quirks that still baffle me after six months of blissful Human/ Computer compatibility.These include:1.  The oddly placed delete key (Where's Waldo).  Why is it mixed in with the others?  It is used so often that it should be on a corner of the board for easy access.2. There are two \"pipe\" keys for some reason.  One of which takes away precious real estate from the space bar.3.  The body feels a bit flimsy while open but I suppose that is the reality of having a super thin notebook that is not made of one solid piece of aluminum (thanks for the vision Apple).Overall I am very happy with this model of computer and see us happy for a long time (in computer time anyway).  When I meet someone with a thing that I want, I ask them if they would they buy it again.  If they say yes then that is the ultimate endorsement.  Thus, I would certainly purchase this again under similar circumstances.  It is a nice combination of features versus portability at a great price.Cheers,Reg", "Date": "March 9, 2010"}, {"Title": "Slim Laptop--mouse is a little fickle", "Author": "Walter B. Rohner \"tech dentist\"", "ReviewID": "RGS9F620B9RBZ", "Overall": "4.0", "Content": "I purchased the MSI X600 about 1 month ago and have been very pleased with it except for a few design issues.  The biggest plus is the light weight and excellent screen.  The minuses would be the processor is a little slow and the palm of my hand tends to touch the mouse pad while typing causing me to loose my place.  Overall great computer for surfing the web while lounging on the couch.  I would not use this for heavy typing due to the keyboard.", "Date": "October 8, 2009"}, {"Title": "Great laptop for the price, but some caveats.", "Author": "apickyconsumer", "ReviewID": "RK725XBEJWA3L", "Overall": "3.0", "Content": "Pros:  Thin, light, and packed with goodies, long battery life, LED backlit screen, keypad, slick look, decent integrated speakers.Cons:  mouse button, flimsy keyboard, no connections in rear, slow hard drive, overall quality.The MSI X600 laptop is an nice laptop for the price and is loaded with everything you need for home or office use.  The laptop is SLIM (just under 1\"), weighs about 5LBS and looks slick.  Although it does not have an internal DVD drive, MSI includes an external writable drive.  For me, this works out perfect as I rarely use the drive and having an external one extends my battery life.  The 320GB hard drive is decently sized.The build quality, however, is under par compared to other laptops.  It feels flimsy and the whole unit flexes if the screen is up and it is held on a corner with one hand.  The touchpad uses a single plastic piece for buttons, which is awkward.  The keyboard flexes slightly when typing and and is noticeable when viewed at certain angles.Lastly, there is a \"Warranty Sticker Void if tampered\" sticker on the only access cover on the bottom of the laptop.  This eliminates any possibility of upgrading RAM or hard drive without voiding the warranty.If it weren't for the issues mentioned above, this laptop would have gotten 5-stars.", "Date": "January 4, 2010"}, {"Title": "A slim computer with plenty of power.", "Author": "Laguna Loire \"Laguna\"", "ReviewID": "R34737TA1HZCSS", "Overall": "5.0", "Content": "This computer is great. I run some demanding software and it runs them like a charm just like that. It is very lightweight like a slim should be but with an unusual big display. So Great!To really enjoy the sound system you need to add some accessory so it can reveal her hidden power! That will be available! The Graphic is really great for cinema!The low voltage CPU allow to have plenty of time before recharging!Great laptop!", "Date": "December 3, 2009"}, {"Title": "Great Laptop but some Flaws", "Author": "Paul", "ReviewID": "RCGFG271UNPAZ", "Overall": "4.0", "Content": "Pros:1: Big Enough Display.2: Thin and light.3: Long Charger Cord.4: Very Beautiful Design.5: Powerful Enough for everyday tasks (Not for gaming).6: Great Battery Life.7: Very Good overall performance (No Crashes or Blue Screens at all).Cons:1: Mouse Sucks.2: Very Flimsy and Extremely Poor Build Quality.3: Poor Viewing Angles of Screen.4: Very Poor Hinge Construction.", "Date": "March 29, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "1.4GHz Penryn SFF C2S ULV SU3500 Processor, Chipset GS45+ICH9M-SFF\n4GB 200-Pin DDR2 SO-DIMM RAM (2GB*2)\n320GB SATA Hard Drive, External DVD Drive Included\nWindows Vista Home Premium, 6  Cell Battery\n15.6\" WXGA 16:9; LCD Resolution 1366x768, ATI HD 4330 Graphics, V-RAM 512 MB4G", "Name": "MSI X600-021US Slim 15.6-Inch Laptop - Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/31dKIVKi-TL._SX300_.jpg", "ProductID": "B002KKCQN2"}}