{"Reviews": [{"Title": "Great build quality and battery life", "Author": "Dave", "ReviewID": "R3B43BZ6Q6MH0M", "Overall": "5.0", "Content": "Recently I purchased a different version of this HP DV6 laptop for my mother-in-law and I looked at this model during that process (all HP DV6 laptop models share a common chassis and only vary on a few components).  The first thing about the DV6 line that impressed me was the build quality. It is well constructed with a metallic toned black plastic exterior. Take a good look at the shell art since it is something that may not appeal to everyone but my mother-in-law definitely appreciated having something a little more individual than the usual dull grey exterior. Despite the glossy exterior we haven't noticed much in the way of finger prints or any scratches despite the helping hands of our kids who love to \"help\" grandma with her computer.The specs for this model are aimed at someone focused on web browsing and office type applications who wants superb battery life:CPU - The Core 2 duo is the best performing notebook CPU on the market and the T6500 included with this computer is a mid-range Core2 Duo (2.1 GHZ w/2MB cache).  It can handle two threads which means you can have the virus scanner running while you surf the web with no noticeable slowdown.  It's not the highest performing CPU out there today but it's far above what you need for non-gaming tasks and it has a enough performance head-room to keep your computer from becoming outdated anytime soon.RAM - The 4GB of RAM is combined with a 64bit OS to which should provided more than enough memory for pretty much any application you can think of outside of extremely high end gaming.HDD - 320GB plenty is far more space than you need now but again, I like the future proofing. Some people may not like that it is 5400 RPM vs. 7200 RPM but the performance difference for home users is nearly zero and the reliability of 5400 RPM drives makes me prefer them in notebooks which are hard on hard disks (because they move around while in use notebook HDDs suffer far more failures than desktop drives)Graphics - While I am a fan of Intel CPUs their graphics performance has lagged the competition.  The good news is that the integrated Intel 4500MHD graphics controller in this model is a step up from previous Intel offerings and all most home users will need.  I still wouldn't recommend you try and run graphics hungry 3-D games on it but it's fine for playing videos, surfing the web, doing light gaming, and running office applications.Display - I like this 15.6\" display though I got my mother-in-law the 16\" version of the DV6.  While a little smaller than what I settled on it is far superior to the 14-15\" screens you usually see in this price range.Sound - Surprisingly good sound for a notebook. The speakers are well positioned and deliver a good range. I've heard better but it was on a $3K notebook.Battery - For years the retail notebook market has been plagued with cheap six cell and even four cell batteries that could barely deliver 90 minutes of real computing use. To see HP bundle a 12 cell Li-Ion battery in with this notebook is hopefully a sign the industry is recognizing that notebook users want good battery life. With a 12 cell battery you can realistically plan to go all day without plugging in. This does add slightly to the weight but few users will notice.  You will be hard pressed to find another laptop in this price range with a batter this good.  Most will have a 6 cell.I don't have any serious \"cons\" for this computer. The \"Touch Media Controls\" for things like the volume (as opposed to buttons you push) are a little odd at first but we got used to them quickly and hey, they look cool when they light up.To wrap it all up: a good computer for home users who don't plan on running high-end games and who looking for something with above average build quality and really good battery life.", "Date": "July 2, 2009"}, {"Title": "A Great HTPC", "Author": "Mark L. Allen", "ReviewID": "R1I5EJHGCL4M68", "Overall": "5.0", "Content": "Note: I was going to buy this laptop from Amazon but I saw the same model at Office Depot for $650.CPU - The T6500 is great for General usage. It's okay for gaming and HD playback too.RAM - 4GB makes multitasking a breezeHard Drive - The main partition is 285GB with a 12.5GB recovery partition. 285GBs is a nice size to work with too it'll take long, long time to fill that up.Graphics - The 4500MHD is okay for light gaming like Counter-Strike. It also does HD playback fine.Sound - This laptop has great speakers. They don't get too loud but that's fine. The quality of the sound is great.Battery - Will last a good long while and is better than most laptops. Most laptops have 6 cell batteries, this one has a 12 cell. Also the battery sticks out from the bottom. Some people may not like it but it is also a good thing because heat won't get stuck under the laptop.Heat - This laptop will get warm from extended use. It gets slightly uncomfortable to type on because of it. It's not really that bad though.Keyboard - This laptop is easy to type on. I can type really fast on it. It is a full keyboard with a numpad so most of your keys are there.The Home, End, Pgup, PGdown, keys are above the trackpad and delete is above the backspace.Trackpad - The trackpad may seem a little hard to move on at first but after a while it becomes smooth. You can also turn it on and off with a button conveniently placed above it if you want to use a mouse. It also has a scroll bar.Other Thoughts - This laptop has 2 head phone hacks. Both are in the front. I'd prefer one in the front then one in the side or back for speakers.HP Logo on the cover lights up when the laptop is on. This annoys me when I leave my laptop on overnight and I have to put something over the light to cover it because it's kinda bright.The remote it comes with is kind of small and it can be difficult to push the buttons but it still is a nice addition so I don't have to get up and pause, skip, etc. on the keyboard.NOTE: This laptop only has the touch volume controls and a touch wifi button. There is no Play, Pause, Stop, etc. touch buttons on this model. That was kind of a disappointment because I have to press Fn+F12 if I want to change songs.Overall this a great laptop and I am pleased with my purchase", "Date": "July 16, 2009"}, {"Title": "Perfect Student Laptop", "Author": "Working Mom \"Working Mom\"", "ReviewID": "R1Y073VP4DLAWQ", "Overall": "5.0", "Content": "I purchased this for my college bound daughter. I had it up and running for her in under 20 minutes - that includes the time it took me to get the wireless internet. This laptop has a very artsy cover that will make any student look extra cool.Great Things about this laptop for your student:Size: It's light enough to carry around but still sturdy. I suggest a targus messanger bag. [...]Battery: 12 cell battery will keep you going most of the day. It does stick out the back some, so your laptop is not as skinny as it would be with a smaller battery.Power/Speed: This laptop is fast. I was impressed with how fast it would start up and run all the applications. There's lots of ram and the graphics are awesome.Software: There is a 2 month trial version of Windows Office for students. If you want to keep it, all you have to do is enter your serial number (can be purchased online), there's no long install.DVD : No need to have a TV too, watch your DVDs on this laptop! Even has a tiny remote control.Huge Hard Drive: 320 gigs. You could use it for years without deleting anything.User Input: The keyboard is great. It is a full keyboard and the keys only require a light touch. You can input a lot of information quickly. The trackpad is a little annoying, but I prefer a mouse. My daughter likes it.Overall, this is a great buy. My daughter loves hers and it meets the requirements of all the colleges in this area.", "Date": "July 23, 2009"}, {"Title": "Great Unmentioned Battery Feature", "Author": "Aaron Morris", "ReviewID": "RI7RZQNBH6S0S", "Overall": "5.0", "Content": "Others have posted comprehensive reviews, so I just want to add a note about the battery that I don't think any of the reviews so far have mentioned.There is a plug in the 12-cell battery which permits you to charge the battery separate from the laptop -- just plug it into the charger.  The very first laptop I ever owned, a WinBook, had this feature and I have been amazed that it is not standard in every laptop.  The battery even has it's own flashing light to indicate the charging status.With a second battery, this makes life a lot easier.  For example, when I'm at an all-day deposition, I don't need to bring and run an extension cord from a wall socket to the conference table out of concern that my battery will die.  Rather, I can just use the laptop with the battery while I charge another battery at a wall socket across the room.  Get a spare power brick ($11 on ebay), and you can just plug in the battery to charge at night like you charge your cell phone, without having to pull out your laptop and charger.", "Date": "August 1, 2009"}, {"Title": "Why not anyway?", "Author": "Shaun Cox", "ReviewID": "R2B4FYTCVCGXU4", "Overall": "4.0", "Content": "The short version. This laptop is great. The long version. This laptop meets all the basic functions and features expected of laptop today.Pro's: Intel Core 2 Duo Processor T6500 2.10GHz, (ANY GHz AT 2.0 OR ABOVE IS EXCELLENT)  Intel Graphics Media Accelerator 4500MHD  (GOOD FOR WATCHING HD VIDEOS AND CAN HANDLE MOST GAMES REQUIRING HD GRAPHICS)  4 GB DDR2 RAM (2 Dimm) (8 GB Maximum)  (THE IMPORTANT NUMBER IF {4GB}. THIS MEANS YOU COMPUTER SHOULD HANDLE GAMES WITH LOTS OF ACTION AND  GRAPHICS)  320GB (5400RPM) Hard Drive (SATA)  (YOU HAVE TO TRY REALLY HARD TO FILL THIS UP. If you have 1000 dvd's and put them on your machine you  will have space left to download songs and install games)***1gb mp3 player can hold about 500 songs,  do the math***  SuperMulti 8X DVD±R/RW with LightScribe and Double Layer Support (burn cd's and make your own label)  Genuine Windows Vista Home Premium 64-bit edition with Service Pack 1 (THE IMPORTANT NUMBER HERE IS 64-bit. This means you have a really fast  operating system. Put it this way. 32 bit is better than 64-bit.)  15.6 inch Diagonal High Definition HP BrightView Display (1366x768) (NICE BRIGHT SCREEN THAT IS VISIBLE IN LOW LIGHT OR BRIGHT LIGHT)  SD Card Reader  Tv tuner with remote  Cool touch volume interface (no actual buttons to turn volume up and down)  Webcam with microphone.  Larger battery provides longer battery life and helps keep vents free so the laptop stays relatively cool on your lap or whichever surface you put  it on.  Comfortable keyboard for it's size.  Great for a teen, college student or someone that wants a laptop that looks unique out the box.Con's: 2 usb ports  attracts dust easily  Bigger battery makes the machine a little heavy.  Finish is a fingerprint magnet. Actually, a fingerprint and smudge black hole.IMPORTANT NOTE: Many reviews do not tell you this but be sure to run an update within the first week of using the laptop. Be be sure to but some blank  dvd's and make your own recovery cd's. Amazon does not provide one with the computer so if your laptop crashes and you did not do it then  you have to fork OUT AT LEAST $50 to get the right recovery discs. BE SURE TO AT LEAST RUN THE UPDATE BECAUSE THE ARE MANY.", "Date": "September 4, 2009"}, {"Title": "Decent laptop but mislead on specs", "Author": "J. Glasser \"DJ Josh Blade\"", "ReviewID": "R2ZKDJUVC8MSJK", "Overall": "3.0", "Content": "Bad:--------- The DV6-1230US does NOT, I repeat, DOES NOT have Firewire!  I was mislead by all the photos and even the photos provided by HP that this sku has FireWire.  Amazon Customer Service sent me a replacement and didnt really understand the issue so I received the exact same model with the exact same problem.  Does it mention Firewire in their product specs?  No but I can't trust their specs either since it says \"2.1 hertz\" instead of 2.1 Gigahertz.- Fingerprints galore.  I ignored this complaint and now I can see what people are saying.- HP Bloatware.  I was able to remedy this by uninstalling most of the unneeded software.  Some of HPs Total Care and advisor software can be handy at times so I just disabled it from Windows Startup.  Their HP Update software has issues with software update version conflicts.  The More Info links dont work.  A problem on HPs site and not related to the laptop.- Why did HP stick with DDR2 instead of DDR3?- the keys feel cheap and like they can fall off.The Good:---------- Very slick looking design.  After removing various bloatware, performance is decent considering its running Vista.- HDMI on a 50\" plasma looks incredible!- Battery life is actually pretty good when there isnt much hard drive activity.- Webcam quality is good.  I have fun with their webcam software with avatar and effects.- Enjoy having the Media remote.- fairly portable for the screensize and 12 cell battery.- dual headphone jacks make for easier movie watching for two people while traveling- stays pretty cool except for the battery charger", "Date": "September 11, 2009"}, {"Title": "Good, but a bit quirky", "Author": "Ash", "ReviewID": "RSD0O4HC1XGJN", "Overall": "4.0", "Content": "I gave it four stars, so obviously I like it.  Nice look and design, although the light up HP logo on the back may bother some since one cannot turn it off while the laptop is on (EDIT - after 4 months, I don't even notice it-so don't worry).  As far as laptops go it's good, 4 USB ports ( actually 3, but another port can act as a USB anyways, for a total of 4), craploads of other random things like HDMI, SD, etc.  Screen is pretty good, not as much glare.It didn't come with as much preinstalled software as I expected, so there shouldn't be much of a problem uninstalling those if you want to.  Norton and Microsoft Office are both trial versions, so too bad.  (Get Microsoft Office 2010 beta for free!)Only problems I really have with it is that the optical drive, or CD drive, tends to vibrate and get a bit noisy while reading discs at high speed, and the battery sticks out from the bottom.  Normally this would help, given that it presents a sort of tilt for the laptop, making it easier to use the keyboard.  But since the bottom of the laptop is not normalized, it can be awkward to place on certain surfacesFor one thing, I have no real idea about what laptop cooler to buy because of it...  Coolers are designed to be close to the bottom right?  And given that some coolers also give a slight tilt to the laptop, there may be something called TOO much tilt to the keyboard...Anyways, the battery is 12 cells instead of 6 cells, so that it last for about 5 hours rather than 3, although this si why the battery sticks out from the bottom, it's pretty big.  The remote control is a nice touch, even though it seems you canonly use it for the HP Real media player.EDIT:I have to mention that the graphics card on this computer is INTEGRATED (which in the gaming world means ****)I somehow got Call of Duty Modern Warfare ONE to play on lowest settings with good FPS (zero lag), and Left 4 Dead 2 on this computer with slightly OK FPS (lags in certain scenes, unplayable after an hour or so)  But I'm not even going to try to play something like COD MW2 or Dragon Age Origins on this computer...It got hella hot with L4D2, and that was with a laptop coolerAlthough I know that most gamers will avoid a computer like this, if it's light gaming the computer will do fine.Older games, with a release date around 2006 or before will play fine, even on higher settings", "Date": "August 21, 2009"}, {"Title": "Average, Value for money?", "Author": "Max \"Max\"", "ReviewID": "R1K7WYUF6UDQDH", "Overall": "2.0", "Content": "I bought this laptop close to four months ago. While I am not disappointed with this laptop, I would not call it a good deal either. The images are completely misleading.1. The extra laptop battery [12 CELL] adds to the weight and also adds a incline while you type( some people like this, but I dont) . I used a 14 inch laptop earlier and the battery makes this laptop a lot heavier. This is not shown in the image either.2. There is no FIREWIRE.3. The heat - I have run windows vista for 2 months and have used windows 7 (early edition) for 2 months with this laptop. I also dual boot with ubuntu. The laptop heats up a lot when running windows (its better with windows 7). You cannot have it on your lap for even 10 minutes. The cooling system literally does not even exist.4. The noise - When running multiple processes and heavy applications, it screams out. It is kind of annoying when you open photoshop and you will see a dozen eyes looking your way, thanks to the sound.5. CD Drive - pathetic and slow. And it screams a lot too.6. Graphics memory - i really do not see any difference with and without this, when I play games. The processor is no where near good.7. The webcam could have been a lot better.8. Its 4 months, and the keys are already feeling aged. Durability is not good.9. I called the customer support for the keyboard. I do not even want to talk about it. Horrible service.I jumped back to my 14\" HP laptop 2.2 GHz processor - [ http://www.amazon.com/gp/product/B002ONCDKG?ie=UTF8&tag;=mama0f-20&linkCode;=as2&camp;=1789&creative;=390957&creativeASIN;=B002ONCDKG ], it runs a better processor and does not have most of the defects listed above.On the other hand, I am satisfied with RAM, harddisk and trackpad. Value for money? NO!", "Date": "November 16, 2009"}, {"Title": "HP DV6-1230US excellent purchase", "Author": "Paul Sanchez", "ReviewID": "R2EEQMU2356NQT", "Overall": "5.0", "Content": "After 1 month of constant use I am very satisfied. Although this is not a gaming computer, it still handles well. I was able to run Superbike '09 smoothly on high graphic settings. The system may not come with bluetooth, but it can be added on through a USB port for less than USD$10. Functions well as an entertainment system, connected logitech X530 surround sound speakers, however, an external sound card is needed to get true surround sound. Only drawback is the glossy finish. It may be beautiful to look at but it picks up fingerprints easily. Lots of hard drive space & the ability to increase memory. Nice touch in including a remote, it comes in handy for DVD playback. Wireless works very well, speakers are very clear & loud for a laptop. The 12 cell battery is a nice addition, it handles extended use well & although may seem bulky (it protrudes about 3/4\") this seems to be an advantage since the hot air dissipates through the underside rather than being trapped as with a laptop that sits flat. A very good buy for the price. I have already recommended this to a co worker who bought one and is also pleased with the product. Another family member would be purchasing one shortly. Delivery of the item was very fast, would recommend this product to everyone.", "Date": "August 30, 2009"}, {"Title": "DO NOT BUY THIS LAPTOP NO MATTER WHAT", "Author": "William Pasquariello \"bpas41\"", "ReviewID": "R1SWB1BFXRQ6ZE", "Overall": "1.0", "Content": "I purchased this laptop over a year ago from staples after being talked out of a Sony Vaio. Well lets just say the day i got it the motherboard was defective. So i send it in to hp and they fix it for free because they have been having this issue with this specific model. So I get it back a few weeks later and it is working fine. Well after using it for a bit i notice some problems. When using the web cam that is built in the web cam can become disconnected. i dont know why but the same thing can also happen with the built in speakers. Also sometimes if you have the internet or volume shut off and you close the lid (putting it in sleep mode) when you re-open the lid sometimes you cannot get the internet or sound to come on. You have to restart. Finally The biggest problem i have noticed is that this laptop has a very hard time running programs like Google Chrome, Windows Media Player, and Itunes when it is not plugged in. Sometimes windows itself stops responding. this laptop is almost useless when it isnt plugged in... You may think this is the end but no after 4 months of use the motherboard again has an issue. so i send it away and get it back in a few weeks. a couple months go by and im still having all the \"normal issues\" until again the mother board dies... I find out that Hp does not upgrade your defective motherboard they just replace it with the same defective motherboard model. Now i am arguing with HP monthly about getting my warranty extended because i am having motherboard issues as well as issues with the fan. I warn you against purchasing this laptop. Hp has a very bad reputation when it comes to things like this and i am an example of that.", "Date": "December 7, 2010"}, {"Title": "Great computer", "Author": "coolchick88 \"SD\"", "ReviewID": "R1OBKBMWOU36XB", "Overall": "5.0", "Content": "I have had this computer for almost 4 years. Today I just found out my computer is done because of the motherboard. 4 years for a computer is great! I had to sent it back one after withthin the first year when it was under warranty.  That was the only time I had to send it back . My next computer will probably be HP because it has lasted so long.", "Date": "April 3, 2014"}, {"Title": "Keeping this one", "Author": "RNGypsy03", "ReviewID": "R11O6ZYKTHHMBV", "Overall": "4.0", "Content": "Perfect for what I use it for, but wish for longer batteryOk, so I'm an apple fanboy.  But when I made the big switch to apple! I still had this little laptop.  I thought about selling it..but decided to hang onto it.  I'm so glad I did.  there are so many times that I've had a compatibility issue with certain websites, particularly ones where I need to submit info, and the apple can't perform.  I trot out this little computer and it works!  I've never really gotten the whole media thing to read movies and stuff correctly from the directories, and now the camera card slot has stopped working ( to be fair, I may be using one that is too large in capacity for this older computer), but those are details.  We keep this laptop for business stuff...invoicing, word, excell, PowerPoint, and 3 d rendering..my husband is an architect....we do the creative stuff...photography, CAD, and photoshop on the apples.  But when we play RPGs...I choose this laptop over my retina display apple, cuz it's compatible, and it's smooth, and the graphics card is great.  an oldie, but a goodie!  Oh, the one thing I hated was no lighted a keyboard, but a little flexible USB light from ikea fixed this perfectly.  I love all the ports!  3 usb, HDMI, 2 earphone jacks for sharing..  PCI, camera card, etc etc...if you have one...keep it... If you don't, and need a second laptop that's windows based...this is a great one, and you can find them for under $300", "Date": "November 4, 2013"}, {"Title": "Great laptop", "Author": "Amazon Customer", "ReviewID": "R3Q3GLEG9IWXUC", "Overall": "5.0", "Content": "I love my HP! Ive never had any problems with it. It works great and its really durable. Not to mention it looks geat to.", "Date": "February 20, 2013"}, {"Title": "!", "Author": "bren.bren", "ReviewID": "RP9R5RCLHOMN8", "Overall": "4.0", "Content": "love my hp!using it right nowonly problem i had was the bulky extended battery that came with itbought it as a replacement for a desktop so i could still have a nice big screenworks really well and no complaints in that departmenthowever really heavy and not cool to carry aroundi got a 10inch for that so now i only use this at home", "Date": "December 7, 2011"}, {"Title": "Great for the average user; excellent battery life!", "Author": "piratesmvp04", "ReviewID": "R224U8F7LKEIFW", "Overall": "4.0", "Content": "I purchased this laptop in August 2009. It is now September 2011 and this laptop is still going strong. The processor is not the fastest Core 2 Duo, but it is fast enough for my needs as a college student and light gaming. I upgraded to Windows 7 and it runs quite well on this, and the startup and shut down speeds are pretty fast for a 2-year-old computer. The keyboard has very light keys and I love it. The whole design is really nice and pretty. The battery life was originally over 5 hours when I bought it. Two years later, I still get at least 4 hours out of this thing, sometimes much more depending on what I'm doing. The elevation of the battery took a little getting used to, but it's not as much of a problem now. I think I would not want a battery sticking out on my next laptop though.Software starts up quickly. Internet Explorer opens in 1-2 seconds when I click it. Gaming is only ok if you're not a serious gamer. I play Star Wars Battlefront II and get maybe 25 FPS average with low settings. Madden 08 works fine on here too with medium settings. Just don't expect too much for that.Only downside is the cheap quality of the touchpad buttons. Mine broke a few months after purchase, and I had to patch it up with a piece of remote control button and a piece of plastic. Right button is starting to get loose now too. Touchpad has a lot of resistance which is ok if you're doing fine-detailed stuff like drawing, but for regular use, it could be annoying.Besides that, I really like this laptop and I expect it to last me another 4 years through medical school. HP makes good quality machines. Just treat it smartly and don't bang it or anything, and it will last you a long time!", "Date": "September 4, 2011"}, {"Title": "Extremely weak product support! Not recommended", "Author": "Emre Kekec \"Emre KEKEC\"", "ReviewID": "R2EXUS99KWC6F2", "Overall": "3.0", "Content": "I am a software engineer who has used a variety of brands. I got a 3 month old DV6t-2000 i7 quad core with 8GB RAM for development purposes. I trusted in HP brand and bought this computer to see that there is absolutely no support. The computers GET issues from time to time, a well performing computer does not necessarily mean that it is a good product.The support department is going to offer you to replace the whole panel and reformat the PC if one of your key-caps(in my case up arrow) gets loose or broken. You will have to leave your PC to service department for at least a month if you have warranty, and if your warranty is over may God help you since your will have to pay several hundred dollars. There is absolutely 0 initiative, and prepare to talk to human robots. I went up to their CEO! and could not get a resolution. Managers are arrogant and chooses to fight with the customer instead of offering solutions.I am an IT expert and strongly suggest advanced and novice users to stay away from HP as far as possible...05/27/2010After sending several emails and hours spent on the phone calls, I could get the support department to resolve the issue. However, they sent a whole keyboard panel. So, it seems, once the warranty period is over, I would have to pay for the panel. It is a powerful computer , yet the support is still weak.", "Date": "May 27, 2010"}, {"Title": "I'm a gamer, and this laptop...", "Author": "Holt", "ReviewID": "R23G6AHYNN7566", "Overall": "3.0", "Content": "So i bought this laptop primarily for games, and i'm glad i did. Its great, and runs WoW fine (dalaran lags like crazy.) I also bought Modern Warfare 2 for it, because a review said it would work great. This is false. If the computer is cool, then you can get a few good minutes, but then the fps goes to like 2.All these specs are out of the box, i don't have a new video card or anything. The battery is TERRIBLE, and i only get 4 hours at most.", "Date": "February 22, 2010"}, {"Title": "Great computer at a great price", "Author": "Lego Fan", "ReviewID": "R3C5Q04SQX2LX5", "Overall": "5.0", "Content": "We bought this computer as a laptop for the family.  Its main uses are as a computer for the kids and to connect to a 1080p television to stream internet content such as Hulu and Netflix.  We also use it as our primary computer when traveling.  For all these uses, it has been great.  It looks fantastic and has a better Vista score than my quad core desktop that is, admittedly, 18 months old.  It drives the 1080p television without a problem, has respectable battery life even while watching video and is a great value for money.  The multi-media remote control is very useful for the way we use the PC.I found that speakers could be a little louder, but this is not normally a problem.  The 12-cell battery does stick out a bit, but I found that it actually positions the keyboard at a better angle for me.All-in-all a great computer for the $600 we paid for it new.", "Date": "November 1, 2009"}, {"Title": "very satisfied", "Author": "RS", "ReviewID": "R240ZVKGXMX3BB", "Overall": "4.0", "Content": "This laptop does all I want, excelent battery life and puts the computer in a better way, although heavier.The remote control did not work on arrival. Excelent customer service from HP, sent a new one.The only bad thing is that on the screen there is ocasionally a red extremely small red dot that dissapears sometimes after a few minutes.", "Date": "November 1, 2009"}, {"Title": "Great buy!", "Author": "DudeShopping", "ReviewID": "R2NWB7IRBEI0RM", "Overall": "5.0", "Content": "Apparently, HP laptops are supposed to have this heating problem. But, mind you, its not smth that should deter you from buying these stylish, great performing computing devices. I bought this on amazon for a great price and I love it! I haven't had any heating issues whatsoever.The 12 cell battery lasts 4+ hours, which is really cool! Also, it acts as a stand and lets the heat pass out freely. It also gives your laptop a nice inclination for typing.PS: You might hate vista, but this laptop works sexy with Windows 7", "Date": "October 26, 2009"}, {"Title": "Very good!!", "Author": "Anmery Melendez", "ReviewID": "R3KNW04DY75KJ5", "Overall": "5.0", "Content": "I have tried my laptop and I don't have a bad thing to say, except the design makes it a bit big. This is a plus/negative because the battery is kinda big so the laptop has ventilation when putted in a surface.Battery duration is good, and for me as an architect works pretty well. I use programs like autocad, 3dmax photoshop and they work normally and fast. The little control is for me the best thing because you can control almost everything and you can watch a movie and you dont have to move from your bed to pause it.This is a good option to buy, I'm a satified customer!", "Date": "October 20, 2009"}, {"Title": "Mostly like", "Author": "Scott Davis", "ReviewID": "R2Z0NRGU8BBL6O", "Overall": "4.0", "Content": "I haven't had a computer/laptop for about 3 years.  I like the keyboard & screen size, some of the touch features. the price and the appearance (even though finger prints are very visable, because of the finish). I don't care for the keyboard gloss finish when overhead lights are located ahead of my work space.  The glare causes me to lean forward to better view the keys.  Also at times when using the onboard touchpad, the left click funtion key will randomly engage (maybe that's specific to my unit - don't know yet).  All-n-all I'm pleased with my choice/purchase.", "Date": "October 7, 2009"}, {"Title": "my gorgeous computer", "Author": "pen and paper", "ReviewID": "RCRF5EM9F9H6L", "Overall": "5.0", "Content": "My sleek black computer feels more like a typewriter from the future, with a number pad key on the right, and a light smooth springy feel when I type. It comes with all kinds of features, including a TV capability if you buy a Slingbox for a couple of hundred, which thanks no thanks, but of course I can watch Hulu, Netflix, Amazon, YouTube, Current, iTunes, etc., & my DVDs -- it is called an entertainment computer. And I joined [...]-- for free -- & can watch videos there too.I fell in love with the Microsoft Office Word 7 3-month trial program  & almost immediately bought the software from Amazon. It's hard to describe all of Office Word 7's amazing features; just research it.I got mixed up creating back-up recovery discs (because you don't need discs) so I ordered discs from HP for I forget how much, not too much.As for Windows Vista -- I still prefer Google Chrome for my browser. IE 6 or 7 or whatever it is wouldn't let me go to Amazon, so I had to shut down Windows Defender, and there are still programs or websites I used with XP that I can't use with Vista, or is it just I can't use in 64-bits but can in 32-bits. I forget that too, but I can change the computer from 64 to 32 bits (I have no idea what this actually means).It comes with Norton Anti-Virus but I installed AVG for free and so far so good. Oh, and the battery -- there are a bunch of batteries at the back of the computer; they give the computer a natural slope, and it doesn't seem to get as overheated as my other computers did. I have MS & am very sensitive to heat so this is a huge bonus for me.Anyhow, for my needs (not school, not work) and my age (getting up there), this is a perfect computer.", "Date": "September 20, 2009"}, {"Title": "DVD drive problem", "Author": "Kishore C. RAO", "ReviewID": "R1Z4AST3ZR47O4", "Overall": "4.0", "Content": "The first one had a DVD drive problem within a week, so amazon replaced it with another one and so far it seems to be fine. Not sure how it got missed in the HP testing.Otherwise, this is a nice laptop; like the touch and feel. Tons of memory, very fast - browsing while writing a DVD is effortless!", "Date": "August 19, 2009"}, {"Title": "Free is Free, what more can I Say?", "Author": "5th_Wheeler", "ReviewID": "R1G15H24JMN28D", "Overall": "4.0", "Content": "This wouldn't have been my choice in laptops had I paid for it, however, it was a gift from my daughter when she decided to upgrade to a more powerful Sony Vaio.", "Date": "December 18, 2010"}, {"Title": "Why did I wait?", "Author": "C. Corman", "ReviewID": "R24DCU64RU2NZR", "Overall": "5.0", "Content": "This is a great home computer.  We are very happy with the speed, quality screen and overall performance.I just wish we wouldn't have waited so long.", "Date": "December 4, 2009"}, {"Title": "My first HP machine", "Author": "Jason Grimes", "ReviewID": "R3MWMSHN1RDHGJ", "Overall": "4.0", "Content": "Happy with my purchase so far.  I am very pleased with the preformance of the computer for the money.  This isn't a top of the line machine but for the price I think I got everything I had hoped to get with this purchase.  The downside is this machince has a body and keyboard (My last laptop was a high-end Sony Vaio which probably rasied my expectations).  When typing on the keyboard it feels like some of the keys are going to pop off and the body is cased in shinny black plastic that show all the finger prints and more imprortantly scratches.I would recommend this a computer for someone looking in the $500-$750 range", "Date": "November 5, 2009"}, {"Title": "GORGEUS COMPUTER!1", "Author": "Gema Lozano", "ReviewID": "R2ETEOUAZOREOC", "Overall": "5.0", "Content": "THIS IS A GRETA COMPUTER, THE DESIGN IS BEAUTIFUL, AND IT'S VERY FAST, THE IMAGES LOOK AMAZING, AND I WORK WITH AUTOCAD A LOT!! AND IT RUNS PERFECT, I CAN GOOGLE, LISTEN TO MUSIC OR VIDEOS AND WORK ON AUTOCAD WITHOUT ANY PROBLEM....WICH IS WHAT I WANTED!! THE PRICE IS GREAT. AND THE SIZE IS PREFECT", "Date": "August 21, 2009"}, {"Title": "Bad really bad", "Author": "Mingkiethii", "ReviewID": "RR682LLQ88L3V", "Overall": "1.0", "Content": "This is bull shit I bought it and it had broken left click torn off back space key scraped screen and it dead it say's boot device not found also the battery and charger where messed up haven't had it for 6 months and its useless now and now that I try to return it the order disappeared no amazon has scammed me plus I had bought some other stuff and some of it didn't come", "Date": "July 30, 2012"}, {"Title": "DIES A FAST DEATH - LIKE MANY HP LAPTOPS!!!", "Author": "Truth Be Told", "ReviewID": "R1HUEYC93ZRZKA", "Overall": "1.0", "Content": "WARNING! Purchased this HP laptop after being told HP corrected their problems with too-hot batteries burning up the hard drive and/or other internal components. This battery is outside the laptop on bottom back and is designed to raise the computer and increase air flow to prevent overheating. IT DIDN'T WORK!!! Technicians tell me consistently to avoid HP computers now (at one time they were the favorite recommended product). HP purchases cheap internal components to build their computers. They break, overheat, and cause your computer to crash. Mine died this week after less than two years (20 months) of light to moderate use. Product worked beautifully at first. After 9-10 months it consistently began to run slower and make noise when it ran. I have limited programs installed and have had computer specialists clean, defragment, etc... numerous times to guarantee the issue is not one of maintenance. NOT A GOOD INVESTMENT. This is the third similar HP laptop experience in our family. We will not be purchasing HP computers in the future.", "Date": "May 18, 2011"}, {"Title": "Don't believe the Photos", "Author": "Bill T", "ReviewID": "R1T7PKJQMNN8UX", "Overall": "3.0", "Content": "I really have nothing to add to what has already been written about this laptop. I had unboxed and running within 30 minutes and it seemed fairly fast, good screen. Like others have written, this thing is a fingerprint magnet and there is really no way not to leave prints unless you're wearing white gloves. While getting ready to move it to it's new home I looked at the left side of the laptop, down near where the expresscard slot is, near the USB ports and noticed a blank cover over where the firewire port is on the photos of the computer. I went back on line and noticed that nothing in the description indicated what kind of ports there were. I bought this specifically because I wanted to use it to edit with my Canon minidv camcorder that has a firewire connection.  The photos show the port but the computer DOES NOT HAVE A FIREWIRE 1394 port. After ordering the laptop I at $733 I went back on line to check shipping and noticed that Amazon had dropped the price about $53 so I called and the help desk immediately refunded the difference to my card.  After seeing the missing port I called the service line again and a very helpful young lady told me that she couldn't find any information on what ports is supposed to be on it,but if it was missing a port I should contact HP.  I told her that wasn't going to happen and they had used an image that showed specific ports and this one didn't have that port. She then offered to reduce my cost on the laptop by 10% which I thought was great, particularly in that she was knocking 10% off the original $733 pricetag. After thinking about it a bit, I decided to return the laptop. The finish was the deal killer for me.  I turned around and spent twice as much on a MAC Pro laptop. Hope it's better than this one!", "Date": "September 10, 2009"}, {"Title": "Avoid HP, worst service/warranty support there is", "Author": "Jeff S. Connell", "ReviewID": "R3MT5ZS96CSTHF", "Overall": "1.0", "Content": "I had a similar problem with one of the other reviewers here.  HP would not service my laptop due to \"customer related damage\" which it was obviously not.  There is a reason they are dead last in all customer service polls.  God forbid if you need actually service.  Between dealing with people in India (which most barely speak English) to zero warranty support, take your money elsewhere.  HP is the worst service experience I have ever had.", "Date": "August 20, 2009"}, {"Title": "Good Product but Awful Customer Service makes it a no-buy", "Author": "GeorgetownStudent", "ReviewID": "R1J56JA1SREO50", "Overall": "1.0", "Content": "I purchased a HP Pavilion DV6 laptop computer in March of this year. On September 8, 2009, my AC adaptor burned out and stopped working.  I spoke to someone on the HP online tech support website that evening and she told me that it would take over a week to send out an AC adaptor.  After some pushing, she told me she could expedite it and have it sent to me to arrive in 3-4 business days (arriving either the 11th or the 14th at the latest).  I waited for the adaptor, and being a poor student spending thousands of dollars on applications, I did not want to go out and purchase the $70 replacement from Walmart.  When I had not received a confirmatory e-mail from HP about the chat conversation and the shipment , I called tech support the next day and they said the product would arrive in 3-4 business days.  I received a call from case management asking if the issue was resolved on September 14, 2009, and I told them I still had not received the part. The case manager, John, basically said \"Well it takes a while.\"  I waited until Thursday September 17th to contact HP again and the Joyce from tech support gave me some story about how parts are backlogged and software issues and how it was unknown when I they would have a part available to ship.  She even had the nerve to suggest I ask around among my friends and borrow someone else's charger.  I told her the suggestion was ludicrous and asked her to speak with a supervisor.  She said the supervisor was busy and would ask the supervisor to call me that night.  Needless to say, I never received a call.  I called HP tech support at 8:30 this morning (September 18th) and Luv on tech support asked me to wait while he connected me to a supervisor.  I was on hold for 30 minutes to be told by Michelle, another case manager, that she cannot do anything for me and I have to wait for John, my case manager, to call back.  So in a nutshell, 10 days, still no AC adaptor, and still no help from HP.  Talk about great customer service - no respect for the time or needs of customers whose money they already have.  All I really want is an AC adaptor Fed Ex-ed to me overnight, and to arrive on Saturday at this point, or to reimburse me the $70 for a charger I will have to buy from Walmart.  As someone who spent several hundred dollars on a laptop so that I could do my work and school, this is not asking too much for a 7 month old computer.", "Date": "September 18, 2009"}, {"Title": "I did not find it as I expected", "Author": "Hare Ram", "ReviewID": "R10HZ5ZVZYLQEP", "Overall": "1.0", "Content": "i bought this computer two weeks ago and returned back after one week. this is not a protable computer. it has pillow on the back side which is obviously 12 cell battery. that battery weights as same as the laptop.I could not find this battery lasts such long like i saw on other reviews. Now there are lots of laptops in the market with 6 cell battery and runs more hrs than this heavy pillow. it was my bad luck that i could find those featured computers in the market before ordering this. I found later on. and you can feel that battery does not fit properly, it is loose. you can shake it with simple contact. other thing is its touch pad which is sticky. I did not like it at all. I was still making my mind to deal with all these and tried not to return BUT next day i could not boot this computer unless you select the safe mode. it asked password, and says configuring, and says dumping physical memory, and gives the options to select, open normally, or open on safemode. it did not open normally but in safe mode. and that was it. I could not afford to waste my hard earned money on such crap. so without getting any delay, i just packed it and sent.", "Date": "September 3, 2009"}, {"Title": "Do not buy an HP laptop", "Author": "Bookworm", "ReviewID": "R18VL1N9PR8UC1", "Overall": "1.0", "Content": "I bought 2 HP laptops and have had nothing but trouble.  1 laptop had to go back to the shop three times:  once because the bracket connecting the screen to the keyboard broke, once because the hard drive was defective and once because the sound card was defective.  One time I sent it to HP and they returned my computer still broken.  My other laptop had to be returned to the factory because the hard drive was defective.  I have had to do so many system restores (and in fact did one last night) and lost programs that I had to buy (Word Perfect).  Even though it was supposed to have been repaired, my itunes library still doesn't play right.  The music will skip.  This computer is a huge disappointment.  I don't even use the computer anymore because it is so annoying. Vista makes it even worse (although I think hp finally realized this.)", "Date": "October 16, 2009"}, {"Title": "DONT BY HP!!!", "Author": "Matthew Pryke \"nsolcis\"", "ReviewID": "R3VOZ2XFVVGV6E", "Overall": "1.0", "Content": "Pros: it turns onCons: very very very poor customer servicebuggy volume controlmouse buttons are stiff and not good for extended use, \"my thumbnail is bent from pressin on it\"if you have a problem, good luck getting it fixed customer service it terrible,It runs slow and I bought 4 gb of ramIt gets hotbattery life is shortSummary: first night I had it a yellow line appeared on my screen,when I called customer service they made me jump through all of these hoopsI've spent over 3hrs on the phone with them trying to get them to ship me a boxso I can send it back, and I'm still waiting, in fact i'm on hold with them right now.BEEN ON THE PHONE FOR 55MINSI've had the same problems as the other people who posted here,Customer service is very vindictive/uncaringI tried writing a review on HPs site, and they didnt post it, to me, that speaks volumes.you need this laptop like you do a hole in the head,if your a pro who works on their computer, opt for something a little more expensive,it'll be worth it,", "Date": "September 8, 2009"}, {"Title": "Don't buy HP", "Author": "an appreciative reader", "ReviewID": "R2ZQ6K8LI5ZUW", "Overall": "1.0", "Content": "I have had nothing but problems getting service for my HP. I get different answers from different people who can't understand me.If you run into a problem, they stink at trying to help. The extra money for a different company is sure to be worth the sloppy job they do on their computers. A mother board they replaced has a problem six months later and they want me to pay them to diagnose the problem that I already have identified. They want me to buy a new motherboard because its \"out of warranty.\"  ?? Too much money to not stand by your product.", "Date": "September 8, 2009"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core 2 Duo Processor 2.1GHz\n4GB SDRAM RAM\n320GB 5400RPM Hard Drive\n14.1-Inch Screen, Intel GMA 4500MHD\nGenuine Windows Vista Home Premium 64-bit edition", "Name": "HP Pavilion DV6-1230US 15.6-Inch Entertainment Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/414TXNSgMUL._SX300_.jpg", "ProductID": "B002BH4QN2"}}