{"Reviews": [{"Title": "Ok, if you need something for occasional use.", "Author": "A. K. Naravanekar", "ReviewID": "R1OMSQ85LJYHVO", "Overall": "3.0", "Content": "Note: My company gave me this laptop for work purposes. I've used it for over a month now. I didn't pay for it, so don't know what the cost of this laptop is elsewhere on the internet or in stores.Build: Looks like a good sturdy laptop for office use. Durability wise, no problems so far.It does feel heavy for it's size though. It is ugly because it's a \"business class\" product and not a home or a media class product. The screen size is thicker than other laptops that you get today.Configuration & Performance: Mine came with a Core 2 Duo, and 4 GB ram. Shipped with Windows 7 professional. So far it has handled whatever I've thrown at it quite well. I've tried a couple of videos on it, the speakers are alright. I've used it for running Visual Studio (2010) and Eclipse (Helios) and it's handled both really well. The boot up time feels a little high for the configuration, but it's not too bad.Noise: The fans are extremely silent and not just on power save mode. I haven't heard a peep out of this laptop so far. I'm really weird about the noise factor and I have to say so far this laptop has fared well in that department. The hard drive is dead silent (as it should be!).Keyboard & Pointer devices: The keyboard just sucks. The keys are way too soft so you don't get the feel of pressing them. Yet, they make that typing sound. Just weird. The touch-pad isn't responsive enough even after a lot of tweaking with the dell software. Neither is the pointer in between the keyboard. In fact the pointer is so weird, it registers a left click when you accidentally touch it while typing. That's really annoying when you're trying to get work done! Overall, the keyboard, the touch-pad, the pointer seem very cheap and flimsy. The behavior is erratic and I don't think it's a software issue.Display: The brightness is fine. The \"auto-brightness\" is nonsense. The laptop has a light sensor which adjusts the brightness level depending on ambient light. It just doesn't work. As much as someone's shadow standing over your shoulder messes it up to a huge extent. At times there is no change in light and it still flickers. I've just turned it off. The max-brightness is bright enough for work in direct sunlight. Overall, the display is ok. Nothing to brag about, but nothing really big to complaint about either.Adapter etc: The power brick is nice and thin and the cord has a power indicator on the tip that connects to the laptop. The problem is it stays on even when not connected to the laptop, but I guess they designed it that way so you'd know. The LEDs on the laptop aren't very bright. BUT, I find the HDD light rather annoying. It keeps flickering way too much indicating heavy disk activity even when it's just idling. This indicator shouldn't even be there IMHO. It's pointless.One thing I like is the ability to stop the battery from charging so you can leave the laptop constantly plugged in when you want without worrying that it'll reduce the overall battery life.Conclusion: Ok, if you want something to work with occasionally. It's not very comfortable to carry around. You might want to get a mouse and keyboard to use with this thing. I'd say this laptop is worth 500$ given what I've seen so far.", "Date": "August 15, 2010"}, {"Title": "Great laptop!", "Author": "Dan Meddock", "ReviewID": "RGAXBN1I5OMXG", "Overall": "5.0", "Content": "I acquired this laptop from a friend and I upgraded it to have 4Gb's of RAM and a 60Gb SSD and a wireless N card. Its fast as hell. Also it runs Pear OS so its faster than Windows would be.", "Date": "January 21, 2014"}, {"Title": "Reviwew of Lattitude E5400", "Author": "Randall K. Geiser \"Believer\"", "ReviewID": "R266IIHSEDT53V", "Overall": "3.0", "Content": "The computer was in pretty rough condition when recieved. Cracks in the case but so far it is working well.  Battery does not seem to hold a charge but keeping it pluged in is working for me at this time.", "Date": "January 14, 2013"}, {"Title": "Best professional dell series laptop i've ever come across.", "Author": "Rdha 96", "ReviewID": "R3C4EPJWE66Y2V", "Overall": "5.0", "Content": "when i bought this computer it looked wonderful because i knew what i was buying, this dell latitude was made for professional and educational work, when i began using this laptop i erased the windows vista it had and put a fresh copy of windows 7 professional. this computer has been by far the best laptop i've ever owned, i have always purchased from dell and dell never lets me down because i knew what i want. i work as a real pc tech and i know what im in for.the laptop contains 2 wwan slots, capability for cellular data, extra wifi cards, gps, you name it. It also contains 4 usb slots, bluetooth, 14.1 inch wxga lcd screen, 6lbs body weight, interchangeble cd drive to put hdd or other items in the cd-rw slot. also hd speakers capible of reaching 24,bit 192000 hz studio quality sound. s video port for tv, i 1394 port. vga port for external lcd. ethernet and modem port, headphone & mic port. the original battery lasts me 4 hrs on full use using windows 7 pro. my E5400 has been with me a whole year since i have owned this laptop and it has never let me down ever. i even went camping with it and traveled with it also, and my friends always expect for my laptop to die out on me and never has it crashed or physically broken or nothin. the body on this laptop isnt ugly it's called having a secure strong body frame built to last, i'm constantly using this latitude for work and home and it still runs smooth as from day one. people who have a school version, don't assume the pc itself is crap because it's not. on this type of computer the bad work is not on the physical parts of the laptop its the software that runs it. most of the time schools or education places purchase this model of computer because it was designed for easy (IT) networking, meaning that the pc can be controlled and maintained by some lazy fat guy sitting behind a desk and work on it. In my opinion this pc is for the feint hearted and people who are ready to physical demand on the pc. I purchased this pc directly from dell.com because this series is not availible at retail stores. :D very good battery life on this type of dell model", "Date": "March 19, 2012"}, {"Title": "Latitude computer", "Author": "Tiffany", "ReviewID": "R19EJGXW1MYB3M", "Overall": "5.0", "Content": "We have a Latitude computer,, it is the E5400. It was givenn to my son to use with his school work. We have had it all school year. Because of it's durabliity and size we have just started using it as our home computer. It is 11:54 pm and I am online looking to see how much it would cost to replace this computer. I have to give it back tomorrow and I dont want to. We have nine children all have touched/used this computer over the last nine months nad it is in amazing condition. It has wonderful keys. I just really like it. And if I can afford one I will be getting one.. or perhaps two. Really no joke. it has not crashed nor has it been repaired. We have had not one problem with it. I would  highly recomend this computer. Really I will miss it a lot.", "Date": "May 25, 2011"}, {"Title": "great little PC", "Author": "Guy E. Stafford", "ReviewID": "RSSFI5I495NOS", "Overall": "5.0", "Content": "Got this PC in 2009 for school. I recently upgraded to a desktop, because my latitude E5400 was full of photos, and documents.My new PC is much faster, and has windows 8.1. I prefer the latitude as a workstation, because it's still a great computer.", "Date": "May 19, 2014"}, {"Title": "Piece of Junk", "Author": "Art Lady", "ReviewID": "R2HYX871051ZV2", "Overall": "1.0", "Content": "Our school purchased a Latitude laptop for every teacher in our school this year. They are very useful if you are looking for a paper weight or need to flatten out student paintings from art class. Otherwise, they are useless. All of them crash at least once a day, and I mean with the ominous blue screen featuring the ominous fatal error message. Several crash in lieu of a screen saver-- students come in for a class, you teach for an hour and return to the computer to complete you work and, Voila!, the lover blue screened fatal error message. This has happened this morning six times already and it is only 10:26 am. I recommend you spend your money elsewhere, Perhaps in decorative paper weights with the blue bird of happiness instead of this lap top with the blue screen of despair.", "Date": "April 1, 2010"}, {"Title": "No", "Author": "Jake H.", "ReviewID": "R1URFTJ6DC4OVY", "Overall": "1.0", "Content": "I was given this laptop by the school and I want to say that this laptop is absolutely horrible for its intended purposes.- It is flimsy and cheap. The back light is a constant issue and it heats up at the drop of a pin.- The fan spits out plastic after too long of a usage.- Requires constant restarts due to \"internal issues\"- The keys fall off.- The whole thing is loosely screwed together, leaving the screws to loosen and fall out.- It crashes and or freezes with light knocks (i. e. putting my books on my desk when the computer is out)I am currently using this laptop to write this review but I would prefer anything over this... thing. In other words, this product is a no go. Get yourself the HP Pavilion dm4-3170se 14-Inch Laptop (Black) or the Lenovo 14\" Core i5 500GB HDD 4GB DDR3 Ultrabook. They are cheaper for the value and more funtional. Summary: Don't. Buy.", "Date": "February 7, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002UIVK0E"}}