{"Reviews": [{"Title": "Great Product!", "Author": "C. Houlroyd \"sing.us.com\"", "ReviewID": "RFZE26ZRZAYDE", "Overall": "5.0", "Content": "The title of this article depicts 250 GB Hard Drive, but my Merchant clarified in their listing (and the specifications on this very page also clarify) that it is a 160 GB Hard Drive.That aside, my Merchant provided Windows 7, and I note that the Laptop had a Fingerprint Security Feature. Mine was refurbished, and no software was advertised to come with it, so I had my own plans...but they surprised me and preloaded one piece of software that I intended to load myself, Open Office.This is a solid, reliable product, the most sturdy Laptop I've ever touched.If you decide to purchase this Laptop with no software (I am an ex software tester), I would highly recommend that you go to OpenOffice.org and download their free Microsoft-compatible software that will edit and save in various formats, including Microsoft formats. I have experience with the makers of this FREE software from my software days, and I can tell you this is a great offering to the public--they do take donations if you're thrilled about it.If you desire better drawing software, you can also download Inkscape for free at Inkscape.org--this software will save into an SVG format, which is the clearest and sharpest image format available for the computer, and it can save into various other formats; this program takes a while to learn, but is well worth it--a big advantage is that you can open other formats such as the less clear BMP or JPG formats and trace the images and convert them into smoother/crisper images.  I also note that YouTube is invaluable for learning new computer programs!I also purchased a Xerox Travel Scanner 150 that came with a bundled Nuance PDF Converter program that rivals Adobe Acrobat and will also save in many formats ranging from Image formats (BMP, JPG) to document formats (Microsoft, RTF, TXT)--the list is long and I've only given a few of the formats it covers.The amount of RAM and Memory on this machine are more than adequate for most computing needs; as far as Hard Drive size, you can buy a 1 TB external Hard Drive to suppliment this Laptop's Memory for around $80 these days, and they are now a little bigger than a smart phone! It's a good idea to have one of these even if all you do is back up your data.", "Date": "April 14, 2013"}, {"Title": "it's a decent machine...", "Author": "cactus", "ReviewID": "R2LT336ADJDCWG", "Overall": "3.0", "Content": "my opinion f.w.i.w.,first, you need to understand that i'm reviewing the machine...not the software. i see countless reviews that put down the machine because of o.s. problems... i run this machine with linux mint 13 (i'll throw up a screenshot), so i don't know what kind of experience you win users will go through.i bought my machine elsewhere (less money), but i can still give you a rundown about how i feel about it.i got mine in the mail the other day and i immediately tore it down for a cleaning and to put fresh cpu paste on and oil the fan. i had this machine pretty much bare framed (i do this with most of my used lappys), and i wasn't super impressed with the build.-it is mostly metal. that can be either good or bad...plastic can flex a bit where metal stays bent if it gets knocked hard enough. i'm pretty gentle with my machines, but you can factor this in yourself.-the early builds of this machine had a problem with the lid latch not staying locked. it's fixable but not very easy because you have to pretty much tear the whole machine apart to fix it. even when it's working right i don't care for it because when it's on your lap you have to jab the button in instead of sliding it and this requires tilting the machine kind of awkwardly. small gripe.-the way the cables connect to the motherboard seem kind of cheap-ish compared to the thinkpad t400 (competitor at the time) that i just built. this one has ribbons where the t-pad has more stout plugs... it may or may not affect performance or longevity, but i don't really like it. this is supposed to be hp's flagship machine.-i love the display. it's nice and bright and even and crisp. very well done. also, the hinges are nice and tight...almost too tight. i don't get the feeling that they will get sloppy anytime soon. they also look cool.-the volume control and wifi switch are touch sensitive (above the keyboard) and this has lead to a bit of confusion (more with the wifi switch) with some folks. it's not just a light, it's also a switch (can be disabled in bios).i really prefer hard buttons. another small gripe.-i love the keyboard, even though some of the keys are hard to get used to (delete, page up, dwn). it's a nice feeling keyboard. very quiet, firm, and springy. as good or better than t-pads, in my opinion. very nice.-mine does have a night light, but you have to reach up to the top of the display to turn it on-off. no biggie, it works pretty good and gives off just enough light. i have found that back lit key boards can be distracting, so i like this.- the sata speeds are great. i have a ssd drive in this and my read speed averages around 265 Mb/s with a seek time of .02ms. good honest sata2 speeds and i haven't had any hard drive issues with it.-after i cleaned the fan/heatsink and re-pasted (plain old artic5), this machine runs nice and cool. after running the cpu at 100% for quite a while, the temp stayed at around 50-55c. very nice. btw, mine has the 2.40ghz cpu. also, the fan is very quiet.-i don't really like the fact that this machine uses ddr2 ram. in my opinion they should have upped to ddr3 for a little better speed and some future-proofing. still a snappy machine, though. mine has 4gb, which is waaaayy more than enough for linux.-i alway shut off the touchpad (i'm a mouse guy), but from what i've seen so far, this one is nice. it's also tapable. the keyboard pointer works good, too.-i have to nail the power button on wake from suspend- it doesn't automatically wake when opened...which is fine.-i like the blue l.e.d.'s.in the end, if i was trying to decide between used machines (there will be a ton of these coming off-lease soon), i would be swayed toward a thinkpad--or a dell e-series latitude, knowing what i now know about them. between the t-pad t400 and this machine, i have had both torn down to almost nothing and i have run the exact same o.s. on both, and while i love the looks of the hp, in the end i am swayed my the thinkpad, but only in small elements of build quality. remember that this is what i'm pretty sure to be hp's big bad top of the line business machine and if the original price was lower, i would have looked at it in a different light.for the price that i see here today (around 120 bucks or so), it's a steal compared to what you can buy new. just keep the fan and such clean so it runs cool and i can't stress enough how a ssd drive will improve performance in this baby. i have mine pretty tweaked and this machine blows my stock i-5 asus away. it's not so much about cpu speeds these days.i hope i helped you and remember: even though it's an informed one, this is still just my very humble opinion and if i'm wrong about any of this please comment and feel free to ask me any questions about this machine. even with it's slight faults (i would be more forgiving if it wasn't billed as top of the line), i plan on keeping it.", "Date": "October 20, 2013"}, {"Title": "Good Notebook but Could Be Better", "Author": "J. Tuttle \"Gearhead\"", "ReviewID": "R2OEPH754MRUPA", "Overall": "3.0", "Content": "If you are considering buying this notebook you need to know limitations are the hardware and the software.Hardware:  I bought this notebook because I wanted a mirror image of the one given to me by my employer.  What I found out is the one I purchased from Amazon (same model as my employer's laptop) DID NOT come with a built in webcam.  Of course, my work around was to use an old webcam that I had resigned to the back on a drawer.  If would have be nicer if the one I got off of Amazon had the built in webcam.Software: The Amazon notebook machine came with VISTA Business 32-bit OS.  It is ok but one must work overtime to network it with my other machines running Windows 7.  Plus, it is only 32-bit running on an 64-bit architecture.  It works but could be better if the machine came with W7.  When time permits, I'll ghost it with my own W7 professional disk.With W7 professional installed, the two machine will be almost twins (no built in webcame for one).", "Date": "June 26, 2013"}, {"Title": "Great laptop for the money!", "Author": "Benjamin Parnell-Smith", "ReviewID": "R2LFZHGC43EA4B", "Overall": "5.0", "Content": "If you're buying used or refurbished on Amazon, make sure that you check the description of the used item itself. Don't go by the description on the main item page as the actual item can vary. This laptop came with a number of options which you can see in this PDF on HP's site: http://h18000.www1.hp.com/products/quickspecs/13061_na/13061_na.pdf . Make sure you know what you're buying. I got mine from Kucotech for $150. It was in near perfect condition, everything on it works, even the battery lasts for 2-3 hours. It has the t9600 2.8ghz CPU, 4gb of ram, and the 320gb HDD vs the p8700 and 250gb HDD listed.  Also the screen is the upgraded 1440x900. Make sure you know what you're buying! I got a great deal on a great laptop. Couldn't ask for more for the money.", "Date": "March 22, 2014"}, {"Title": "Perfect, and Great support from supplier.", "Author": "Gregory Guy", "ReviewID": "RTQN7WMXZ8A6C", "Overall": "5.0", "Content": "For the price I'm delighted. A solid unit.Extra words required by Amazon, 7 left, 5 left, 3 left, and the last word", "Date": "May 29, 2013"}, {"Title": "much better than expected", "Author": "haris \"Scarab13\"", "ReviewID": "R2J40B56OQHWUK", "Overall": "5.0", "Content": "I read previous reviews and I wasn't expecting much. Since I already have several computers (and I am mostly a mac guy), this one was needed just to run my SEO until it - well - dies. I got it very cheap, since I've opened an account with amazon at the same time. It came fast and looked good out of the well packed and padded box. The Laptop can't close all the way, I heard that this model has that problem after a while. I didn't care much about ramRAM, battery, camera, etc. Just needed a workhorse that will run for a while. Now, the laptop came with Win 7 professional, Roxio Creator, lightscribe, camera, 4 Gb of ram and 2.5ghz processor. It also came with HP docking station and a brand new cables (power and Ethernet). I am impressed, because the last time I purchased something with these specs I've paid some $500 at the bestbuy. Oh I forgot to mention, there is a fingerprint scanner too. This is a very neat laptop, well built and fast. Great purchase.Update: After abusing it for a few weeks, I got the message \"HDD failure imminent\" so I am backing it up. Those old HDD's are $30 refurbished for 60-80gb (I would rather install an SDD if possible). No biggie, still a great value, despite the fact that CD drive don't work. I don't need it anyway.  It's still booting fast.", "Date": "January 11, 2014"}, {"Title": "I Love It", "Author": "izi2brauz", "ReviewID": "R2EO055938DM2C", "Overall": "5.0", "Content": "I have never love a used laptop before, the way i love this product. I bought this item after going through rigorous research on Google about its specification. But one thing I forgot to check was whether this particular model has a Webcam or not. Though i ended up buying a product with no webcam (although the seller said he described clearly on the product page that there was no webcam), I love it specially because it is so rugged. A Business Notebook PC with all the features a businessman would want in a notebook PC: Smartcard reader (very important feature for online transaction), Business card scanner, fingerprint, bluetooth, wireless, keyboard flashlight (at the top of the screen, just where you would find the webcam) for keyboard visibility while working in dark place), a 3GB Ram with 160GB HDD, in addition to that, a genuine Windows 7 Professional installed by the seller.Wao! I've got nothing much to say but am sorry, I love this PC.", "Date": "December 1, 2013"}, {"Title": "Good solid laptop for the price", "Author": "Thomas P. Mackin", "ReviewID": "R2TWLBSBB1QXE8", "Overall": "5.0", "Content": "I purchsed several 5 of these off-lease 6930P notebooks for a small business and have no complaints. They are very solid and are excellent for use in a limited size work envirnment. As these are used or refurbished they vary in condition but are as advertised. For the price these are excellent machines and I would recommend them.", "Date": "July 12, 2013"}, {"Title": "monitor is dead", "Author": "maghraaby", "ReviewID": "R3E4CVPK365KXI", "Overall": "1.0", "Content": "the monitor is like dead .... it does not work.... i will check it again and if it still not working i will return the item", "Date": "May 4, 2013"}, {"Title": "Nice and solid laptop", "Author": "Léopold Cadet (Labadee/RCCL)", "ReviewID": "R13EH2V8BPK09V", "Overall": "5.0", "Content": "I really appreciate the selor for being honest and generate, so I hope he takes Lord's grace to keep in this position, thank you. May God bless.", "Date": "March 25, 2014"}, {"Title": "I have learned my lesson!  NEVER BUY A USED COMPUTER!!!!!", "Author": "loganburke \"kipper\"", "ReviewID": "R1F2NU2HSD7O8F", "Overall": "1.0", "Content": "After multiple attempts to 'register' the product with MSoft using the product code on the bottom of the laptop, I was finally successful in getting the code accepted...or so I thought.  When I tried to download updates, it would not allow updates to load from MSoft.I put it away for awhile and when I turned it on again it immediately went into a chkdsk routine and deleted the \"Boot? file\", so now it just goes into a perpetual 'loop' telling me the same thing over and over!!!!  Missing Boot? file!", "Date": "September 17, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002SIJFAS"}}