{"Reviews": [{"Title": "Great value!", "Author": "J. F. Monaghan", "ReviewID": "RRVAVJU7N043G", "Overall": "5.0", "Content": "First of all, I am a Mac person. I don't know that much about PCs. The reason for buying this particular model was money. I would have had to pay $1700 for a comparable laptop from Apple. I could not see spending all that money for a computer that was to be mainly used for word processing and web browsing. While made of plastic, this laptop has a solid feel to it. When opened, it doesn't seem like it will split into two pieces or that the screen is flexing. The keyboard is not flimsy and it should be able to take a lot of use. (I've only had the computer for a couple of weeks.) This model comes with Windows 7 and so far I like it. Very easy to set up. Connecting to my network was a breeze. Installing a couple of programs was also easy. Updates are simple. I have had limited experience with Vista and did not care for it. Windows 7 is a much better, user friendly, operating system. As I said previously, I have had this laptop for a short period of time, but so far I have no complaints and no regrets. A lot of computer for a little bit of money.", "Date": "November 18, 2009"}, {"Title": "A pretty good laptop overall, unless you need accurate color.", "Author": "A. Forward", "ReviewID": "RZ2UB6YZK92WN", "Overall": "4.0", "Content": "The LED backlit display that I thought would produce better colors thinking that LED backlit was all the hype in LED LCD HDTVs like Samsung, Sony, etc. produces a slightly purplish color cast to the image. I thought getting the LED backlit display at such a low cost was a great deal, but I guess you really get what you pay for. In this price range, I'm almost thinking a traditional CCFL backlit LCD would have looked more accurate in terms of colors. If you're using this for photography, I would stay away. If you're using it for web surfing or word processing, it won't matter. For my desktop I have a color calibrating Samsung display, so right away I can notice the purplish color cast on the Lenovo. I did attempt to correct for the hue by running my color calibrator on it, which helped, but didn't completely fix it.", "Date": "April 19, 2010"}, {"Title": "Good Machine overall", "Author": "Pustakadahulu", "ReviewID": "R19P5K4V5P3BNR", "Overall": "3.0", "Content": "Overall this is a good machine with some feature issues.Long Battery lifeIt is fastDisplay is greatvery strudy for the daily life with kids aroundWindows 7 runs greatNever had machine related issuesBattery never gets hot even after using for more than one hour like other laptopsBut there is one annoying thing in this computer... Keyboard and Mouse pad.Keyboard is very hard to type because I need to press exactly in the middle. If I press at corners, it does not register. and I make too many typing mistakes.Mouse pad is not sensitive enough to make it a good experience. Most times, it does not register the tocch/drag.But this machine is overall a good machine for the price I gave.", "Date": "February 17, 2010"}, {"Title": "Great Service Great Machine...", "Author": "Larry F. Rogers", "ReviewID": "R1H4QT0S86RX9M", "Overall": "5.0", "Content": "I find it strange that a couple of people (maybe the same person) complain about service for this notebook.  I called and had a response within 2 minutes.  I had a minor issue regarding the features on the notebook and was assisted and off the phone in ten minutes.Perhaps if something serious goes wrong you may find it annoying.  For example, we have an HP notebook and it took 3 technicians and a supervisor and over 3 hours of our time to get them to ship us a replacement battery for a brand new computer.The margins are very thin on these machines, so don't expect them to come to your door.  If you buy a $400-$500 computer you cannot expect them to provide you $400 worth of support time if you are inept in computing and not hardware savvy.This notebook is an absolute steal for the money and very well made.  My only complaint and it appears in HP as well is the notebooks run a tad hot.  I have not had any problems as a result, but it may be a good idea to get a cooling pad for while you use it at home.  If you are a road warrier, traveling coolers are available as well.The notebook has excellent battery life, an astoundingly nice display and a well designed keyboard.  All touchpad's stink, from the HP to Dell.  So, get a notebook mouse.Great notebook for the money!!", "Date": "December 26, 2009"}, {"Title": "Good Laptop at affordable price", "Author": "Abhishek Kumar Roy", "ReviewID": "R1E9N0WW2GZJ64", "Overall": "5.0", "Content": "I thinks its a good laptop to buy at affordable price. Till now i have not faced any problem.", "Date": "December 23, 2009"}, {"Title": "As a used machine, the criteria are different....", "Author": "High Plain Drifter \"rave_reviewer\"", "ReviewID": "R3RA1TPP1T9HGY", "Overall": "3.0", "Content": "Surprised that the reviews are not distinguishing between the buying experience as to new and used machines. I am writing this in 2014 and if you are reading this, you are considering buying a used G550. What you need to know -- they were a middle of the road value when new and they are a middle of the road value now. The specs are more than enough to run Win7 (the early G550s shipped with XP) and keep you computing at a reasonable pace for years. Hard drive swapping is very easy hardware-wise, assuming you know the procedure (Hint: get a $20 \"universal USB cable\" one of the free cloning utities, and you're good to go). The Lenovo service issues are all real -- Apple they are not -- but as a used buyer you don't care. THE ONE KEY ISSUE IS THE TRACKPAD. It stinks and the fault is Lenovo's for going with the cheaper supplier. There is no driver fix. Don't be fooled. So if normally use an external mouse, you're fine. If you rely on the trackpad, you could go quietly mad with this one, it misses command after command without warning,  and you should look elsewhere. Final top: used Thinkpads cost more but are better built overall.", "Date": "April 19, 2014"}, {"Title": "It's ok :)", "Author": "Dude", "ReviewID": "R1IVEM0LMA4KG5", "Overall": "3.0", "Content": "This Laptop is over all good. Mine does overhead ones in a while, but i play games on it, so i suppose that's to be expected. Overall, it is, however, a decent laptop, battery-lasting time is ok if you run it on low settings, graphic is good ect.", "Date": "March 9, 2012"}, {"Title": "The computer is good", "Author": "Ruth B. Ingram", "ReviewID": "R62U68F9EOCY0", "Overall": "3.0", "Content": "Now I said the computer is good, however, dealing with the home company is not.  No matter what you say or who you talk to you get the telephone suffle and parroted apology for the wait, usually 2 hours. I suggest you shop elsewhere where you can get help.", "Date": "December 5, 2009"}, {"Title": "Lenovo - avoid it", "Author": "Suresh Subramaniam", "ReviewID": "R13FKRLOMOJUWC", "Overall": "1.0", "Content": "My purchase from Lenovo left a bitter taste in my mouth.  I purchased a Lenovo G550 inNovember 2009.  I was looking for a basic laptop for my daughter who only browses, chats anddoes her homework on the computer.  I did not really need all the multi-media and high endgraphics so touted by all computer sellers.  My search narrowed to Dell and Lenovo.  Ialready had a Dell and it was working fine after 3 years. I did some research and talked tosome friends and some of them recommended Lenovo.  My company provides Lenovo laptops forits employees to use.  I normally find that at least one of my team members have to go thetechnical support to repair their laptops every week and I dont have a very large team.  Inspite of all this adverse information regarding Lenovo quality, I still took the plunge andordered a G550.  The deal was good at $449.One of the first things that gave me a pause was that Lenovo advertised the laptop as\"Intel® Dual-Core Processor\" leaving out the word \"Pentium\" (they have corrected this hence,maybe due to feedback from customers).  I thought in the beginning that it was a Intel Core2 Duo processor and was delighted to get one at this price.  Later after some more researchit turned out to a \"Pentium' processor which is inferior to Core 2 Duo.  Some blame shouldalso go to Intel for this similar naming, but other computer sellers include the word\"Pentium\".I ordered it and they shipped it (Customer Number: 4969111, Order: 2E1LJR).  It took about15 days to arrive which was normal as per the lead time published on their site.  But, whiletracking the package, I found that the laptop was shipped from China, and passed throughKorea and Japan before reaching Alaska and I was wondering how Lenovo could afford to shipan individual package from China to US and still be competitive.The laptop arrived and we opened and installed it.  An irritating setup feature was thenumerous preloaded advertisements in the laptop asking you to subscribe to some service orthe other.  It was like doing an online survery.I liked the face recognition feature.  The laptop was solid enough, a little heavy and bulkybut I had known that.  After 2 days my daughter reported that the laptop was not shuttingdown.  When you try to shut it down, it goes to the One Key Rescue Screen.  When you try toexit the One Key Rescue, it gives you two options - either you can reboot or shutdown.  Ifyou choose Reboot it would restart again.  If you choose Shutdown, it would go off andrestart again and go back to the One Key Rescue screen.  You are stuck in an infinite loop.I called Technical Support and the nightmare started.  I had to hold for more than 30minutes to speak to a Technical Support person.  I explained the problem to her.  After apause and some background conversation she again asked me to repeat the problem.  Again shewent off and there was some background converation.  I could hear a male voice and somegiggling in the background.  She came on again and asked me repeat the problem.  By thistime I was mad and told her that I had repeated it twice before and was she not takingnotes? I repeated the problem and she was attentive this time.She put me through all the steps of getting the order number, serial number and trying totroubleshoot the problem like taking out the battery and reinstalling it and so on but noavail.  Then she gave me a case number (Case # wn147498)  and told me to call Sales and givethe case number and they will help me.  I told her that if I called again I would have tohold for another 30 minutes, but she said that she cannot transfer me and I would have tocall the 800 number again.So the next day I called the number again and after a hold of 40 minutes I got Sales.  Igave them the case number and the customer support person said that she wanted the Ordernumber and not the case number (which was in contradiction to what Tech support said).  Itold that I had called tech support and I had a case number but she was adamant that shewanted the order number.  I told her to hold on so that I could get the order number fromthe box, and she disconnected the call.  By then I was again mad.I called again next day and choose the option for Returns thinking that it could be easier.A recorded voice said that since they had 'unexpected high call volumes' the hold would bemore than 30 minutes and the call was disconnected.  I persisted and called again this timechoosing the 'Sales'option.  This time there was no recorded message.  It was clear thatthey wanted to discourage returns and only wanted to talk to people who were trying to buy.After a hold of over 40 minutes I got a customer support person.  I explained the problem tohim. He went through all the normal routine of how sorry he was that I had this problem andasked me to hold on.  He conferenced in a technical support person who seemed to be Chinese,from the accent.  I again explained my problem to this person and he asked me if I had donethe steps of taking out the battery, etc and I said yes.  Then he announced that I wouldhave to return the laptop and Lenovo will replace it.  I asked him if I had the option ofreturning it for a refund and he said no.  The only option was replacement.I was fuming again by this time and asked him why refund was not an option.  He justrepeated that I could not get a refund.  This made up my mind.  Till now, although I had arough time with their customer service, I was willing to give Lenovo the benefit of doubtand had only wanted a replacement.  When the technical support guy said that refund was notan option, then I decided that I dont want a replacement and wanted no association with thiscompany.When the customer support person detected that I was getting angry he broke in and told thetechnical support guy to can it and told him that he will handle it.  Then the customersupport guy told me that I could return it and get a refund if I wanted it.  I said yes andhe gave me a RMA number.  He also sent me an email providing the details.  I think thisperson repaired some of the damage his company's reputation had suffered in my eyes.After that it was smooth.  I sent the laptop back, they gave me the refund.  I was halfafraid that they would find some excuse not to refund the amount fully but it did nothappen.I bought a Dell the next day.", "Date": "December 23, 2009"}, {"Title": "Look Elsewhere", "Author": "Canegrad", "ReviewID": "R1VQ0KWNHS4VVS", "Overall": "1.0", "Content": "I recently purchased a Lenovo ThinkPad. The computer itself if adequate but the customer service of the company is horrible. From the phone sales person arguing with us about what they can and can't do to the tech support who told me \"I don't have time to deal with you or your problem, call web sales\" I am amazed they are in business.As I said the computer is fine, I just hope it holds up and you don't have to contact the company for any reason. There are a lot of other computers out there that are in the same category as this one, I suggest you look at one of those.", "Date": "November 23, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002PK156Q"}}