{"Reviews": [{"Title": "Pretty Good and worth buying", "Author": "Pyropet \"Burn!\"", "ReviewID": "RLOB9B5IL80ZY", "Overall": "4.0", "Content": "I liked this model a lot. It has modest RAM for a laptops of its age and is very durable. Well mine is anyways, it survived a yard fall with no damage. sure the keys start popping off once in a while, but it's simple to plug them back in. I'd recomend this one for people who are resonpsible, like vista, and are ok with 2 GB ram max. It can run most things well, but for more things that require high processig power and graphics, I'd say go get a newer laptop.", "Date": "October 13, 2009"}, {"Title": "Great Laptop", "Author": "Joshua Rackoff \"Book King\"", "ReviewID": "R30GEMAT0NPA8P", "Overall": "5.0", "Content": "This is a great Laptop i have owned for 6 years now. It handels all my web design programs like flash, dreamweaver, photoshop, illistrator, and games like a champ. I did upgrade ram to 4gb to keep up with the demand and it works great. I do recommend this laptop if on a budget. This laptop can do it all, and the processor is fairly powerful. Here are some sites i built with this laptop. AcepStore dot c o m , Applerageous dot c o m. When i bought this laptop 5 - 6 years ago it cost me about 1,200.00 and still runs like a champ. I just bought myself a new dell xps laptop and tested running programs at the same time and they start up and run programs at same time.", "Date": "December 30, 2011"}, {"Title": "It works well.", "Author": "solidol", "ReviewID": "R325FMDQUZMXHO", "Overall": "5.0", "Content": "I bought this for doing my homework. I'm very satisfied with this item. It was very clean and works well.", "Date": "January 19, 2013"}, {"Title": "A productive laptop", "Author": "Nidal C.", "ReviewID": "RGO9Q261ODPRS", "Overall": "5.0", "Content": "It surpassed all my expectations. It was in excellent condition,quick and fully functional. Only two drawbacks, battery died out quick and when scrolling down a website, the page would fragment a bit, but other than that it's a perfect piece of equipment for a university student or any corporate work. Highly recommend it if you don't want to break the bank.", "Date": "February 15, 2013"}, {"Title": "Good condition but could be more decent", "Author": "Anya Nambou", "ReviewID": "R216CSUWLQ1LN9", "Overall": "3.0", "Content": "Average product, but was expecting what showed online advertised. Over wall this was a good product surely not for a price paid for. Overcharged I think.", "Date": "May 11, 2014"}, {"Title": "It is 2014 and I am still using this", "Author": "Datalady", "ReviewID": "R1KVRRYECY0ILP", "Overall": "4.0", "Content": "I purchased this new in late 2006 and have used it as my primary computer since.  It is still my primary computer.  In 2010, the hard drive went out, but I replaced it and it is still doing okay.  Just this year I replaced the original battery.  People keep telling me to upgrade to a newer machine, but this one is still as fast as I need it to be.  I have heard that this machine isn't ideal for gaming, but I don't do gaming on this anyway.  I do more than e-mail and internet surfing on this.  I run statistics and database programs as well and it is working well.  It also handles videos really well.  I have the maximum amount of RAM the motherboard can take.  The display did loosen a bit over the years so that the screen became a bit floppy when I moved the machine, but I was able to tighten it fairly easily.  I have a much newer computer that I use for work and I don't notice a huge difference in performance between the two.  Even when I do upgrade, I anticipate keeping this machine for someone else in my family to use.", "Date": "February 25, 2014"}, {"Title": "Loving My Dell Laptop", "Author": "Sunny Rowe", "ReviewID": "R1XAX7YM7PJ8CV", "Overall": "5.0", "Content": "This is perfect.  Refurbished, and I love it.  The seller did a great job with this.  And I still can't get over the price - $140! Wow!  I use it continually in my sitting room.  Thanks so much.", "Date": "November 29, 2013"}, {"Title": "Dell Inspiron E1505 15.4-Inch Laptop", "Author": "calman", "ReviewID": "R2DCOYI0NWUJKC", "Overall": "3.0", "Content": "Received the product just as described. One of the keys on the laptop was loose as described and it had a few scratches on the lid. The item was recieved on time.", "Date": "November 28, 2011"}, {"Title": "DONT WASTE TIME AND MONEY ON PEICE OF JUNK", "Author": "Love>>Laptops", "ReviewID": "R13TIEV3LOHYUX", "Overall": "2.0", "Content": "I recieved the laptop for fast shipping but the screen was broke. Also the charger was noooo good. It was a big laptop but had some really bad problems. It didnt tell me was was wrong with it. PITAFUL", "Date": "December 18, 2011"}, {"Title": "Pretty bad", "Author": "D. Guerra \"DreamPhreak\"", "ReviewID": "R1SU228HJMNBWH", "Overall": "2.0", "Content": "I currently am and have been using this laptop for many years. At first when it came out, it was really expensive (I got it for $1200), was really fast for it's time, and pretty good. Now looking at it, it is very bad and i wouldn't recommend it to anyone.Cons: The 2GB Ram is the MAX the motherboard supports, the 80GB hard-drive somehow is still magically working, and the 80GB space itself is worthless: I have 2TB external drive hooked up since I need a lot of space. The \"ATI Mobility Radeon x1400\" video card is really slow, doesn't work with a lot of games, and isn't even supported by ATI/AMD anymore, I AM USING 3RD PARTY VIDEO CARD DRIVERS right now; Imagine when Windows 8 comes out, i bet not even the 3rd party drivers would have an update out anytime soon. The DVD reader/burner constantly fails on me, i keep having to resort to using someone else's computer to rip the cd/dvd, save it as an iso file, and then copy it over using a usb. There is also a major problem with the screen hinge, do a quick search around for \"Dell Inspiron E1505 Hinge\", and you are sure to find some complaints and videos. I have NEVER used the MediaDirect, way too slow. Front speakers are really bad quality. Cannot play Skyrim, Prototype, any GTAs, WoW, LoL, Crysis, Starcraft, Wolf:ET. Can only play simple games, few exceptions for games like Minecraft where you can download mods to make it faster. Already mentioned this, but i must repeat: VIDEO CARD IS UNSUPPORTED ANYMORE, be warned! I cant find Official drivers! Havent tested recently, but battery runs out extremely fast, maybe about 4 hours without usage, and 2-3 with usage. No HDMI, but thats obvious considering laptop is 7 years old. Laptop is HEAVY and bulky, 6 pounds might not seem like much, but put it in a backpack and carry it around all day, it becomes noticeable very quickly.Pros: Keyboard area is waterproof (Dropped a full cup of water over the keyboard once, nothing broke, but don't try this at home.), buttons on the front are handy and work fine, never had this laptop overheat, i still have the original battery working 100% fine, 4 usb ports, ONLY 1 dead pixel. I only restart this laptop once every couple of months, or if a major windows update that needs to be restarted, but i cant remember the last time i kept my laptop fully shut off (not counting power outages), and it works fine overall. Linux works on it.Final notes: Again, I wouldn't recommend this to anyone unless you just need a \"Facebook machine\"; . If you were seriously considering this, know that my CPU is 1.83gHz, the ad says 2.0gHz, but either way, that's pretty slow for today's requirements. Again, the Motherboard only supports a MAX of 2GB ram, thats horrible, even today's requirements have 4GB as like the bare minimum for today's times. I regret not opting for the tv-tuner back then, it would have been extremely nice to have on a laptop. Currently using Windows 7 ultimate x64. This laptop lived through windows xp, vista, 7, and about to make it to windows 8. I really cant say how many times ive reformatted the laptop, ive lost count. Even tried linux a few times, couple of dual boots, and once time a triple boot that worked just fine. Right now the laptop just sits in the corner of my desk on top of a very light-duty cooler, i use it's screen as a secondary monitor, and use a 21\" AOC true-widescreen led monitor as my main one; in comparison, the laptop's 15\" seems too small and square. I also use a bluetooth keyboard, wireless mouse, the 2TB total external drives i mentioned, 7.2 surround sound (a 2.1 and a 5.1, using a 3.5mm splitter). As ive said earlier, i never turn off this laptop, its been running like that for about 3 years out of the 7 years or so that ive had it. Its going to be one excellent day when i finally build my gaming desktop computer and throw this Inspiron laptop out the window for the dogs to sleep on.", "Date": "April 30, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Dell Inspiron E1505 15-Inch Laptop\n2.0 GHz T7200 Intel Core 2 Duo Processor, 2GB RAM\n80GB Hard Drive, 8X DVD+/-RW Drive, 802.11b/g WiFi\nATI Mobility Radeon X1400 Video Card\nWindows XP Media Center with Restore CD (for OS and other Dell Applications/Programs)", "Name": "Dell Inspiron E1505 15.4-Inch Laptop (2.0 GHz T7200 Intel Core 2 Duo Processor, 2GB RAM, 80GB Hard Drive, ATI Mobility Radeon X1400 Video Card,8X DVD+/-RW Drive, 802.11b/g WiFi, Windows XP Media Center)", "ImgURL": "http://ecx.images-amazon.com/images/I/51X4el32nmL._SX300_.jpg", "ProductID": "B002P3EATW"}}