{"Reviews": [{"Title": "A great product with a trade-off", "Author": "A. Mathurin", "ReviewID": "R17CSXD76DJ6M4", "Overall": "4.0", "Content": "While searching for the ideal laptop for myself, I found that all laptops seem to have huge trade-offs. This one is no exception. I chose it because it packed a relatively fast CPU and a decent graphics card into a very portable PC. Every other laptop I found with discrete graphics was a lot heavier, and most were pricier. The trade-off here (as with all laptops that have fast CPU's and discrete graphics) is that battery life is far from impressive. Unfortunately, there is no 9-cell (more powerful) battery available. Based on the location of the battery on the bottom of the laptop, I don't think there ever will a more powerful (and larger) option.Performance on this is great. Windows 7 is extremely responsive, audio production software runs smoothly, and game performance is even better than I expected - Dragon Age Origins looks beautiful at the screen's max resolution with most graphics settings somewhere between medium and high. I haven't tried editing video yet, but based on what I've seen so far, I don't expect any performance issues. If you're just planning to browse the web and work on spreadsheets, documents, etc. this may be overkill for you. You would probably have no problems on a cheaper machine with a slower CPU, without discrete graphics, and with longer battery life.Speaking of battery life, it is pretty short, but I find it to be usable. Asus added a dedicated button for switching power profiles. Switching to battery-saving mode gives a significant boost over high-performance and entertainment modes. I haven't done extensive testing, but it seems that battery-saving mode will get you 4-5 hours of web browsing and other light work, while entertainment mode might let you watch one movie before you need to search for an outlet. Depending on how and where you expect to use your laptop, this may or may not be a problem. In high-performance mode, hot air blows out of the right side, but the bottom doesn't get hot enough to burn laps.In response to other feedback I've seen:- It's been said that the touch-pad buttons are stiff. I don't find this to be the case at all. They seem quite comfortable to me, my girlfriend, and my mother.- Another reviewer mentioned having issues using the touch-pad scroll. The part about scrolling not stopping without an extra touch is a non-issue. This an intentional behavior that can be changed or turned off in settings. However, the part about having to hit the line is a very real issue. The problem is that the outer edges (maybe 1/4\") of the pad do not respond to touch. You don't need to hit the line exactly, but you do need to make sure you're not right at the edge, which frequently requires a look. This is the most annoying problem I have with the n81vp.- Keyboard quality and noise is fine. It's comfortable to type on. It's not silent, but not noticeably loud either.- The function key is where most people would expect 'control' to be, but after a few weeks with the laptop, I find myself getting used to this.In summary, the Asus N81VP-D2 is great for audio production, multimedia work, gaming, and most other demanding tasks.It's a waste of money for more casual users and no good if you need long battery life.", "Date": "December 30, 2009"}, {"Title": "Fast and reliable", "Author": "Y. Wang", "ReviewID": "R314JUJORN7YXM", "Overall": "5.0", "Content": "I have to agree with the previous reviewer that this is one superb notebook.  I was also looking for a notebook that is not too large (15\" and above) nor too small and underpowered (12\" and less).  In the 13\" and 14\" range, I pretty much narrowed it down to ASUS and Dell Studio XPS 13\".  I own a two-year old Dell XPS 13\", which had its motherboard replaced twice in two years due to heat issues (this seems to be a very common problem with Dell XPS 13\" line and Dell doesn't seem to acknowledge it or actively try to find a solution).  Bestbuy has Dell Studio XPS 13\" at about the same price as this ASUS, but with only one-year warranty.  As can be expected, I am hesitant to make a purchase due to my past experience.ASUS is fast and stable with Windows 7.  The machine looks and feels well built.  Furthermore, the machine stays cool even under heavy use.  The small complaints I have are that it doesn't come with dedicated media keys/buttons, and the keyboard definitely feels different from that of Dell and takes some getting used to.  Certainly, I am not faulting ASUS for these.  A good thing is that you are getting a bargain buying from Amazon.  I was in Taiwan last December - the same ASUS model sold there for roughly US$1,300 - when you would expect a lower price because ASUS is a Taiwanese brand.  I guess Amazon's trade volume must entitle it to a huge discount.", "Date": "January 6, 2010"}, {"Title": "Great Deal!", "Author": "C. Costello \"crcostel\"", "ReviewID": "RR174SAAGFU40", "Overall": "5.0", "Content": "When I purchased this laptop I had several criteria1) Powerful enough to last my family 3 years at least2) Enough gaming power to do light gaming3) Portable - I didn't want a 17\", I wanted 14-15\"4) A maximum of around $10005) A quality name/warranty - this is a laptop afterall1) Power - The \"windows experience\" rating is 5.8 but that is due to the replaceable hard drive. The Processor got 6.4, the graphics 6.7. While the stated max of the motherboard is 4gb RAM, its reported to handle up to 8gb. No this isn't one of the lasted i7 or i5 processors but its a very powerful dual-core and if you aren't doing media editing this will last a long time.2) Gaming - I have Dragon Age running at max details and it doesn't even skip a beat. The specs call the graphics chip a HD4650, the sticker says HD4670. The only difference between the two is clock speed, and this is clocked as a 4650. You could over clock it but I don't see the need yet. This isn't a laptop for hardcore gamers but it can play hardcore games.3) Portable - this is a 14\" laptop with desktop replacement hardware! Of course the downside is the tiny battery can't keep up. I'd suggest buying a spare battery or staying near an outlet.4) When I got this laptop it was 1000 w/ a 100 dollar rebate, its gone up a bit but its still a steal!5) Most laptop companies give a 1 year hardware failure warranty. Asus gives a 2 year hardware and 1 year accidental damage. Oh and Asus laptops are much more reliable than HP/Dell/Gateway ones.Cons:1) Battery2) No DVI output3) Battery4) Typical bloatware5) BatteryBottomline: Get it while you can!", "Date": "January 12, 2010"}, {"Title": "Hardware/software issues, poor WLAN card and hard drive", "Author": "E. Loehr", "ReviewID": "R2QQ3DCXLFJP73", "Overall": "2.0", "Content": "I regret purchasing this computer; it really is not worth the price compared to others on the market now.  I have also had some issues with the computer itself.  If you Google \"ASUS N81 crash\" you will find that many people are experiencing random system crashes, especially when trying to do any gaming at all on this computer.  There is a possible hardware issue that causes the crash, which many assume to be from the ATI Mobility card, but ASUS has not acknowledged it.I sent my machine back to ASUS for repairs due to all the random system crashes I experienced; it was updated as \"Repaired\" and assigned a tracking number the day after received.  I called and they said no issues were found with my computer.  I called several times and left my number several times, but they would never let me speak with a supervisor, and a supervisor would not call me back.  I got my computer back and found that they had removed all the AMD/ATI software from the machine, but didn't make any mention of this on their notes.  There is a problem with either the graphics card and/or its software.  I did a full reformat and fresh install and got rid of all the ATI and AMD software except for the driver, and my system no longer crashes.  The WLAN card included is also really weak.  I replaced mine with a Gigabyte GN-WI07HT-RH that I had in an older machine, and it gets much better connection.  The hard drive is a Seagate Momentus 7200.4.  Just google the name of the hard drive and you see what a piece of crap it is.  It's a noisy, clunky hard drive; I guess I will replace it with a Hitachi drive on my own dime.  No real reason to RMA it for the loud Seagate because it seems like it's the product itself that is a joke, not just mine.This computer has had issues with multi-tasking.  It locks up and requires a full reboot.  When I watch stream feeds, I have to reboot 3-4 times in a 2 hour period.  I have a netbook that performs better than this computer.  It's pretty much a piece of crap.I experienced terrible customer service, a poor warranty/repair department, and unaddressed shutdown issues make this a computer to avoid, in my opinion.  I have purchased three ASUS laptops in the past three years, but after the experience with this one, it will be my last.", "Date": "February 9, 2010"}, {"Title": "Customer service is a joke, random crash", "Author": "S. Shupe \"S. Shupe\"", "ReviewID": "R1BABOVE6ZBUYD", "Overall": "1.0", "Content": "Like others have mentioned, I experienced random crashes and keyboard won't register all keystrokes.  Customer service is very rude and not much help.I will never purchase products from ASUS again.", "Date": "March 8, 2010"}, {"Title": "Superb Quality, Best Bang for the Buck", "Author": "E. Rodriguez", "ReviewID": "RH19D7BOJTS3N", "Overall": "5.0", "Content": "It's amazing how people can be so picky. First of all there's no such thing as the perfect laptop/notebook but to me this comes pretty damn close. I fully researched my options and came to the conclusion that this laptop was the most bang for the buck you can buy in this size range. It's even more powerful than some 15/16 inchers out there plus a lot less expensive. I didn't want anything too large or bulky that would divert from the original concept of having something portable but I still didn't want anything too small that would lack power and performance. To me the ASUS N81VP-D2 is the best combination of performance, power and size. The 16:9 LED screen is crisp and vivid with superb HD quality. The key board is nice and responsive and unlike the other review I didn't experience anything flimsy about it what so ever although it would of been a huge plus having a backlit keyboard but no biggie I can live without it. The 320gb 7200rpm drive is nice to have because it boots up pretty damn quick and there's plenty of storage to go around for the average end user. The trackpad is not the worst yet not the best but it's manageable and not frustrating like others say. I personally disable it and just use a wireless mouse. The battery life is the only minor draw back I can think of but what can you expect when you practically have all the bells and whistles under the hood. Windows experience is as follows: Processor 6.4, Memory 6.4, Graphics 6.7, Gaming Graphics 6.7, Primary Hard Disk 5.9 and that's just out of the box. If you're still having second thoughts, don't. You wont be disappointed by the value and quality you will receive. Try and find a laptop with similar features and configuration as this one and you'll see you can't because first of all the video card on this one is the best you can get in a 14 incher to date and second you get two years global warranty, one year accidental or two if you register your laptop within 30 days of purchase(no brainer) all included when others charge you an arm and a leg for that. Plus ASUS was ranked first in quality by the wall street journal. Luckily I purchased the laptop at the right moment and got it for only 695 with  applicable offers and rebate, free two day shipping and another big plus---not  a dime of taxes! Good job amazon and please stay out of california so that we can continue enjoying tax free shopping since we're already taxed enough", "Date": "December 30, 2009"}, {"Title": "Decent but Not Perfect", "Author": "David J. Yang", "ReviewID": "R3VHI34QIU9E1V", "Overall": "4.0", "Content": "Got a fantastic deal (not from Amazon) so I couldn't pass it.  Not a bad machine with excellent performance.  Read many people have sudden power failure problem online and I experienced it once about 30 minutes after turned on for the first time.  It just went off without any warning.  So far has not happened again yet.  Keep my fingers crossed.PRO:- Good performance;- Acceptable track pad;- Nice screen;- Decent camera;- Tons of ports;- Great warranty;CON:- Terrible keyboard, left side sinks and feels like falling apart;- Short Battery life (1.8 hour full performance);- Lack of good security software (fingerprint scan + facial recognition);- A little on the heavy side;- The entire machine, especially around palm rest/track pad area, is very shiny and slippery, personal dislike.", "Date": "January 30, 2010"}, {"Title": "Mostly great!", "Author": "DaddyGo", "ReviewID": "R27L2305ZKU1V9", "Overall": "4.0", "Content": "The ASUS N81Vp-D2 is a great laptop. It is powerful enough to handle most of today's games (currently playing Dragon Age and The Witcher on high settings)and has handled every business application I have thrown at it without a hiccup. The screen is bright and crisp although viewing angles are a little less then optimal. Not bad though. It doesn't come with 4650 vid card like is advertised. It actually comes with a 4670! Not sure how much better it is but better is good. Boot up is fast as is shutdown. Windows 7 is great although I upgraded to Win 7 Pro using the Anytime Upgrade, which went off without a hitch in less then 10 minutes. The laptop is pretty solid but the lid does have some flex and the keyboard feels \"loose\" in the upper left corner. The keyboard also has the \"Fn\" and \"Ctrl\" keys reversed which causes some headaches but I'm sure I'll get used to that. The built in speakers are excellent for a laptop. They sound much better if you have the laptop sitting on a table then if it is in your lap but, again, for laptop speakers they are great.The biggest issue I have with this laptop is the battery life. I expected it to be bad, considering the specs, but I wasn't prepared for just how bad it is. Just surfing the web on power saver mode I can get just under 2 hours. If you turn off wi-fi and just do business applications or Word/Excel type stuff, you might be able to get 2 1/2. Forget watching movies or gaming. There are no extended life batteries available either. I guess it is not a huge deal for me since I use mine mostly at home or at the office so I can keep it plugged in but it should be taken into consideration if you need to use it on battery power a lot. All in all, I'm happy with the purchase but I will most likely be buying another power adapter so I don't have to lug it around with me.", "Date": "January 7, 2010"}, {"Title": "Overheating problems, otherwise great", "Author": "AJ", "ReviewID": "RN90H81R6NLK3", "Overall": "5.0", "Content": "I have had the ASUS N81vp-D2 for around 3 weeks now, and it reboots randomly. I think it will take some time to see if this is a fluke on my end, or if others who just bought it begin to have problems too. I believe the D2 is brand new so I would use some caution if you are considering one.Other than that problem, I have no major complaints about it. The LCD screen stinks but for the price its what I expect.Update: 2/13/10This seems to be an overheating issue. I was watching an HD tv show off Amazon Unbox and it shut down every 15 minutes. I haven't tried extensive gaming on this thing, I don't know how it would work out.For business stuff, this is a fine laptop.Update: 7/15/10Have not had any overheating problems recently. Laptop now functions without any problems. The biggest annoyance is the hard buttons on the mouse keypad. Newer asus models have multi touch keypads.", "Date": "January 15, 2010"}, {"Title": "Great for the price", "Author": "Ana", "ReviewID": "R3HLTUVM308C4P", "Overall": "4.0", "Content": "I bought this laptop almost one year ago, and until now I didn't get any single problem. I like the style and design as it's not as others. For me the screen size is perfect, and also the keyboard layout works good. The only thing I don't like is that it's a bit bulkier and heavier than I thought (it's thicker than my previous 15\" and the same weight). It does not have keyboard backlight, but in general I am quite happy with it.", "Date": "October 15, 2010"}, {"Title": "Power and Performance at an Affordable Price", "Author": "Harold D. Dulitz", "ReviewID": "R1S5CU19J7JUGI", "Overall": "5.0", "Content": "As a computer consultant and repair shop owner, I carefully research products before recommending them to a client.  Although Asus has been around for years making component parts such as motherboard and video cards, only recently have they become an aggressive U.S. player in the P.C. market for complete system solutions. I have purchased,tested, and own an eee series netbook, a 24\" LCD Monitor as well as the N81vp-D2 power house laptop. I have easily sold 4 of the N81VP-D2 to clients in the last two months.Asus is one of a handful of manufactures where the paper specifications and product quality match. The laptop is an easy sell for most on the go professionals. The N81VP-D2 is very well crafted, comes with one of the top of the line Core 2 Duo processors, an exceptional 5 usb ports, HDMI, great LCD Screen, high end video card, 7200rpm drive and a warranty double the industry standard (2yrs). Asus also includes a carry bag, lcd cleaning cloth and usb mouse with the unit.  The only disappointment is that the unit does not come with Windows 7 Professional which limits my ability to sell the product. The speed and performance is virtually identical to most of the new i7 Processors which cost significantly more.Two thumbs up on this product and Asus.", "Date": "April 10, 2010"}, {"Title": "Very good.  Power.", "Author": "G. Fernandez", "ReviewID": "R1O8961HZ90JFO", "Overall": "4.0", "Content": "First off, let me tell you what I mostly use this laptop for:  gaming.  I'm not the type though, that needs to play everything at the highest settings.  This differences seem minor to me--definitely not worth the $1000 difference for a more high-end laptop, i.e. Alienware.  I did some comparing before I got this Asus laptop and this was by far the best deal (to me).  I looked into Sony, Apple, and Alienware.  To get one of these competitors' laptops I would've had to dish out at least a couple hundred dollars more (for the sony) or over a thousand more (alienware and apple).  If you check out the specs, the differences aren't that great.  This is especially true if you want something that's PORTABLE.  I mean, you could get a 17\" laptop that'll blow this Asus laptop out of the water but I didn't want to lug around a huge computer.  Anyway, on this laptop I'm currently playing Fallout 3, Mass Effect, Dragon Age, Star Wars (KOTOR), and Deus Ex and I'm loving it!  All are running GREAT on medium settings.  Deus Ex is older, so that one I have on max settings.  According to other reviews, the laptop CAN play them on high settings but I don't want slow-downs or crashes.  Speaking of which, it does have hiccups at times when gaming but they are VERY few and far between.  If you save often, you shouldn't have a problem.  Also, from what I've read, hiccups are common on PC games no matter what.  As for other things (surfing the web, streaming video, docs, etc), the laptop is flawless:  runs fast, really fast.  No crashes, no getting stuck, no hiccups.  Only downsides I have seen to this machine are:  the keyboard and the battery life.  I don't care about the battery at all.  I always use it plugged in.  The keyboard is not so great.  Some of the keys (on the left side) feel mushy, or springy (I don't know how to describe it).  Overall, I'm very happy with this purchase.  It's a great machine.  With the speed of technology though, it'll probably be \"old\" within a year.  This Asus laptop looks great too!  A great price for a great machine!", "Date": "March 15, 2010"}, {"Title": "Asus N81Vp 14\" Laptop Review", "Author": "eRawk", "ReviewID": "R2GG78IO69669Q", "Overall": "4.0", "Content": "I've now owned this laptop for about 2 months, and here is my review.First of all, it has a great price with the rebate for the power. HOWEVER, Asus' rebate is tricky. If you mail it in, you can either wait for 8 - 12 weeks to get your full $[...] rebate (at least the rebate applied to my time frame), or you can get your rebate rushed to you in 2 weeks for a [...]$ processing fee. Kind of weak, but that's okay I don't expect much from mail-in rebates.This laptop is very powerful for what it is - boots up super fast, shuts down fast, and does great overall. The wireless connectivity is excellent. Here is my list of props:-Powerful computer, handles games with high to medium high settings, processes media and videos seamlessly-Very portable, fairly light weight-Connectivity rocks, lots of ports-Nice looking screen, very bright and non glossy-Comes with Windows 7, which is vastly better than Vista-Comes with a lot of great accessories, and the laptop bag is excellent-Good battery life. I get about 4 hours on economy mode if I don't do anything intensive, and probably can last for 2 hours on \"entertainment mode\" (for a little over 1 movie or so)-Great Asus add-on software. While I installed most of what it came with, some of the utilities are freakin' awesome!-Excellent warranty. If you mail in the warranty card within 30 days of purchase, you get an additional 1 year accident extension on your warranty!This laptop isn't perfect. Here are my cons:-Keyboard doesn't keep up quite as well as I hoped! I type very fast (100+ wpm) and it often lags when I type or skips letters. Also, the keys on the left side tend to make more noise than I feel a laptop keyboard should.-Left click and right click near the touch pad are very loud. You can hear them for miles. Awkward in the library.-Comes loaded with typical bloatware, however the stuff you don't want isn't proprietary and can be removed easily. Made my comp run a lot faster after that!-Control key is swapped with the function key. I have been slowly getting used to it, but it is pretty annoying initially. Stupid decision on Asus' part.-Typical in terms of finger print magnet. I windex it pretty often because it takes them on easily.Overall, this laptop is very deserving of the rating. I would actually give it a 4.5 out of 5, but I can't with the stars. I think some people exaggerate the ability of the battery - mine does pretty well. Of course it won't last long unplugged if you game or watch movies, but very few laptops do. The charger itself is lightweight, small, and has a very long cord which is quite convenient. This laptop is very powerful for it's weight and class.If you are looking for the \"do it all\" laptop, I would recommend this. It is very balanced in terms of power, weight, battery life, and features. It surely isn't perfect, but no laptop is as far as I am concerned. For the price, it's a good purchase, and I am very pleased with mine.", "Date": "March 8, 2010"}, {"Title": "good performance, but poor keyboard&touchpad;", "Author": "Avicenna", "ReviewID": "R5P2KIMVIWYLU", "Overall": "3.0", "Content": "Good performance and nice graphics/sound support. However, very poor keyboard and touch pad. Pressing some of the keys on the left side of the keyboard is making a disturbing sound. Also, touch-pad buttons are very hard and make a disturbing click sound.", "Date": "January 24, 2010"}, {"Title": "Excellent Laptop!", "Author": "F. Czyz", "ReviewID": "R19Y3QPY647AY2", "Overall": "5.0", "Content": "This is an amazingly powerful machine, running above and beyond expectations. My only complaints are that the camera runs at a very low framerate and the keyboard takes a bit of getting used to, as you need to hit them precisely in the middle or they will not register. It also gets smudgy easily, but it even comes with a nice little cleaning cloth. But other than those minor gripes, an excellent buy!", "Date": "January 18, 2010"}, {"Title": "Powerful and cheap but clunky and cheapish", "Author": "User not Pro", "ReviewID": "R3QE1T94FNTJSW", "Overall": "3.0", "Content": "I actually bought the D1 but they are exactly the same except d1 has vista 32bit vs d2 has win7 64 bit but I installed win7 64bit 1st thing anyway , so it is now a D2 technically .. Also Amazon edited my review for the d1 to remove mention on bing cashback ... stupid ... I am really thinking of returning the laptop now ...Why did I buy it: wanted a 13-14inch with good power, so found this with slightly positive reviews , warranty/insurance, very powerful, 14inch, good ventilation. Didn't get Dell studio 14z (price, too much heat, no dvd), sony vaio CW (price), HP DV4t (price if configured the same), DELL StudioXPS 13 (price, heat issues, battery duration,small touchpad)have had it for 5 days so far ... Got it for [...] (could have gotten it for [...] if I used bing cashback and [...] )Pros:-Very powerful.. CPU , GPU , HDD (7200rpm).. it got 5.9 on windows experience index because of the HDD, the CPU/RAM gets 6.4 & GPU gets 6.6 .that's with win 7 64bit, it got as far as I remember ; 5.4 or 5.9 on the CPU with vista 32bit that came with it..-Sooo cheap for such powerful components ( d1 is $850 on amazon, d2 is $900 after rebate)-Looks nice; not super nice, but nice..-Very well ventilation design .. for all that power, it doesn't get hot.-included mouse (not wireless) and bag...-full array of ports ( including FIVE usb ports, that is amazing )Cons:when you have so much power, the input devices should be up to the same standard; they are not-No backlit keyboard.. I know; I knew this before buying it; but when you get it and can't see the f1/f12 keys in the dark and can't see the WIFI / Bluetooth either ; not even the power button if it is not turned on ...-FN key on left of CTRL key ... VERY VERY Stupid .. I already knew, but thought I can adapt; not yet..-Horrible sounding and functioning touchpad buttons .. needs too much power to press and makes too much noise .. I already knew thru reviews but didn't appreciate how bad they are .. I honestly try to avoid using them ..-Now the worst part; the left side of the keyboard is so flimsy that when pressing any of those keys (ESC,`,1,2,TAB,Q,W,A,S,CAPS,LT SHIFT, Z,LT CTRL,FN) it makes so much noise ... you won't appreciate how frustrating or annoying this is until you use it ... Same about trying to avoid using them, except u can't-The DVD tray button is very difficult to press without directly looking at it ...- the scrolling bar on the touchpad is a hit/miss, you have to press the line drawn on the touchpad exactly for it to work , and it keeps scrolling even after u remove your finger, u have to press it again like u r applying a brake .. STUPID DESIGN ..- unresponsive keys: sometimes some keys don't respond to pressing them leading to too many typing errors ..- poooor battery life, though it is understandable, but at least ASUS should offer a 9 cell option ...- f3,f4,f9 keys don't have labels for their other function ( default mail application, default browser, turn on/off touchpad in order)", "Date": "December 29, 2009"}, {"Title": "Great hardware BUT had to return, TWICE =(", "Author": "N. K. Nguyen \"chubbywubby lubber\"", "ReviewID": "R1D6EGUYK8KKXE", "Overall": "4.0", "Content": "Before buying a new laptop, I had done considerable amount of research online about Asus' line of notebooks.  I had to get a new laptop since my super old Sony Vaio's switchable wifi (a horrible idea -.-) broke and thus it was no longer a laptop but a desktop since I had to connect via ethernet cable.  After looking at different brands, I decided that Asus provided the best hardware for the most affordable cost.  Buying another Sony Vaio with equal specifications would've cost me about twice as much, so Asus seemed like a no-brainer.  As a college student, I was looking for a portable laptop with enough power for casual gaming.  I'm not a hardcore gamer, just into those those generic type MMOs.  Of course this Asus model had more than enough power for casual gaming so I was glad, especially with its 1GB DDR3 VRAM.  With a 14 inch screen, it was perfect for mobility but also for watching movies, shows, and the occasional gaming.  The processing is super fast.  Relatively few bloatware, but easy to remove.  The longest it lasts is 4 1/2 hours without wifi, and 3 1/2 hours with wifi on battery saving mode.  I'm reviewing this laptop based on its specs, which are superb for the price, but I did experience problems with it that ultimately made me return the product.In the end, I received two of these models, both experienced system errors and defects.  The first one kept popping up a window saying \"Windows Explorer Error,\" which closed every application running.  The first time it happened was on the third day after its delivery, but I didn't use it almost at all those first three days because the Internet was down at my house.  I realized that anytime I did a right click on a folder or file, this window would pop up.  Obviously this got to be very annoying, especially when it happened multiple times within a minute.  After hearing such great reviews about Asus, I didn't want to give up on it entirely, since this was my first purchase from them.  I called Asus customer support to try to troubleshoot the problem, but to no avail.  So I had to return this first one for a replacement.  I just thought I was unlucky and got a bad egg, so I was hoping the replacement would be free of any problems.  Unfortunately, that didn't happen.  Although the replacement didn't have the same problem as the first, it had its own problems.  This time, the new laptop experienced random restarts or shutdowns.  The first time it happened was the very day I received it.  I didn't want to think anything of it since it was a replacement and I didn't want to believe that I received another defective model.  I was in denial for a week, since I wanted to give it another chance, but the laptop kept restarting or shutting down for no reason at all every day.  Sadly, I decided on returning it instead of getting another replacement.  I didn't want to go through the hassle again, especially with the fear of another defective model.  Oh, and I did a full system scan for any viruses, and there was none both times, so I'm guessing its a problem with the internal system itself.Maybe I was just unlucky twice?  Well, even so, all I wanted was a normal functioning laptop.  I don't think that's too much to ask for.  Oh well, but I am giving this model 4 stars because everything else about it was fantastic.  My first experience with Asus obviously didn't go so well, but I'm not giving up on it yet!  Presently, I'm waiting for the release of the UL30Jt.  Actually, before deciding on the N81Vp-D2, I had a hard time choosing it over the UL30Vt.  I'm too anxious about ordering another N81Vp-D2, so this next time around I'll be ordering a different model.  Asus does give you the most bang for your buck though, which is largely what's influencing me to give it another shot.", "Date": "February 3, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002PAQXCM"}}