{"Reviews": [{"Title": "Approval!", "Author": "J. Mahan", "ReviewID": "R15VGMVFS4HCPH", "Overall": "5.0", "Content": "I got this laptop as a Christmas/graduation present from my parents. Overall, I'm so pleased. The battery life is amazing, the display is awesome, and the fact that it already came with Windows 7 was really convenient. And it's so lightweight! As a web design major, I carry this thing around everywhere. My previous Dell brickbook nearly dislocated my shoulders. I'd recommend maybe getting a different color if you're worried about fingerprints, though, as they're quite noticeable. The only negative thing I have is the touch pad gestures. I thought that the \"pinch\" zoom in/zoom out features would be really handy but while browsing the web it would often zoom in and out on me without me doing much. But I just disabled that feature and it's great otherwise. :) It's a great buy, I'd recommend it to anyone.", "Date": "January 12, 2010"}, {"Title": "Dell Inspiron - Competent and Reliable", "Author": "B. Husher", "ReviewID": "R29V3XU9X6ZMT8", "Overall": "5.0", "Content": "I have owned Dells for the past 10 years and have never had one issue with any of their machines. This laptop is no exception. I would recommend the laptop for the average user who isn't a big gamer and isn't working on memory-intensive High Def video editing.", "Date": "November 10, 2009"}, {"Title": "Very happy!", "Author": "D. Nagy", "ReviewID": "R1M9QWTW85530P", "Overall": "5.0", "Content": "I have had a Dell desktop for a long time and have always been happy with their products and service.  I had a tough time deciding if I was going to get this particular laptop as there were a few very negative reviews regarding their service.  I decided to give it a go despite the negative reviews and although I have only had this laptop a day, I am extremely happy with it.  The screen is bright and clear, the keyboard is easy to use and not cramped and difficult to navigate, the laptop weight is the most surprising thing to me.  I thought it would be much heavier!  All in all, I am very pleased with the entire experience.  Especially how quickly Amazon got it to me.  Normally Dell makes you go through a laundry list of \"personalization\" steps, and then it takes a long time for them to \"build\" it.  I guess a lot of people want or need to personalize their laptops, but this one was perfect for me and I love how simple it was to buy.", "Date": "January 12, 2010"}, {"Title": "Worst Laptop...EVER!", "Author": "R. Bertoluzza", "ReviewID": "R2T6D9S8GEJ2HP", "Overall": "1.0", "Content": "I bought this laptop after 3 months of very extensive research. For the price and the specs it seemed like the best possible choice. Boy oh boy was I wrong. After only 3 months I started to have problems with the charger. The laptop would only work if plugged in, it wouldn't charge and if the charger was even bumped, the computer would shutdown due to lack of power. So, called Dell and after a lengthy discussion to many other problems I'd been having as well, turns out the motherboard needed to be replaced, the whole charging housing, the hard-drive and the wireless card. I will say, I had great customer service and my laptop was returned quickly, but I did have to send it in. But, when I got the laptop back, they must've put in a different charger housing because my original plugin barely fits the hole, which was octogon before and is now round.It has now been 1 year that I've had it and the screen is going out. There's something wrong with the hinge and it makes the screen do very funny things and I have to jiggle it until the screen is clear. So, this is the worst laptop ever made. It's just kind of cheap as well. The plastic on it is awful.", "Date": "August 24, 2011"}, {"Title": "Great for average to slightly above average computer users.", "Author": "Moon", "ReviewID": "R4E8COIR0AKS3", "Overall": "5.0", "Content": "I got a great deal from Dell for a refurbished Inspiron 1750. There were no surprises, I knew what I was getting, and I've been very happy with it since.  I wanted to balance the reviews for this, because 1 was a Dell customer service review, which has nothing to do with the product.  It's capacity is way above what an average Internet/Word user would need, and the weight considering the size is lighter than most 17+ inch screens.", "Date": "September 6, 2010"}, {"Title": "not bad", "Author": "Wang Qiang", "ReviewID": "R1FGF7JQRRUTBS", "Overall": "4.0", "Content": "It is not bad.But sometimes, it will wake up automatically from sleep state.Maybe it is the software setting problem, I am not sure.", "Date": "February 1, 2010"}, {"Title": "reason for rating", "Author": "Bill Bridges", "ReviewID": "R3CYG6YJTIQVRY", "Overall": "4.0", "Content": "the charger did not work. the computer itself was fine. I did not contact the seller, but rather had the charger repaired my self.", "Date": "November 27, 2013"}, {"Title": "Over Heating", "Author": "Donald A. Moran", "ReviewID": "R1NXU23BLLW5SE", "Overall": "4.0", "Content": "Why does it get so hot on the top left side of the keyboard? Even putting a good cooling fan under it does not stop this ...", "Date": "December 9, 2012"}, {"Title": "The beast", "Author": "D. Freeman", "ReviewID": "RQGPAGCE5WYWJ", "Overall": "4.0", "Content": "I have been very happy with this laptop.  I have had the laptop for a year now, and it is a great laptop.  I paid the extra to get more memory and a good CPU and I haven't regretted it.  It is a good laptop with many great features.The Pros:  It is a fast laptop with a very good picture.  The sound is pretty good for built in speakers.  Good battery life (although I upgraded to a 9-cell to get even more life).  It will run a good many processes at a time.  I work in a marketing and design firm and there are times that I have IM, email, several web browsers, Excel, and music all running and it does not slow down.  I have never had issues with the keyboard like others have mentioned.  I have used this to type many long papers and reports and it works just fine.  I like having a number pad on the side of the keyboard.  It makes it easy to do calculations and to enter numbers in Excel.The Cons:  It is a large laptop. This would not be a good laptop for someone who will be walking around carrying it.  It is not too heavy, but big enough to make it cumbersome for a classroom setting or a board meeting.  I have enjoyed having multimedia buttons at the top of my keyboard, but it would be nice to make them separate from the F1-F12.  Fingerprints can be an issue if that bothers you.Overall: This is a good computer for your average user.  Someone who does a lot of gaming or who travels a lot would probably find this a little disappointing.  Anyone else would find that this computer is a great machine.  It is big, but it can do what you ask it to do.", "Date": "February 6, 2011"}, {"Title": "Decent laptop, with nuisances", "Author": "Phil (San Diego, CA)", "ReviewID": "R1UT8X0DR66X73", "Overall": "3.0", "Content": "The very first week we had this, one USB port went bad, the internal jack simply lost its physical bonding to the external casing and stopped working. Dell Support shined here, they were fantastic. We were able to cross ship so we were never without a computer, and they sent us an identical model.All in all it's been a decent laptop. The generous display is impressive. A plus compared to smaller laptops is that you get the full number keypad on the right side of the keyboard. All keys are flat, so if you're a touch typist who is used to being able to feel the difference between keys by their being concave, this can either slow you down or contribute to typos. In such matters manufacturers shouldn't sacrifice usability in the name of trivial cosmetic sleekness.Before purchase I was aware that this model only had three USB ports. Unlike other laptops though, the jacks and connecting ports for power and devices and connectivity are on the sides of the unit. This model, having a 17\" display, is already wide so having to connect things on both sides extends the wideness even further. This can be cramped when sitting in an easy chair or on a flight with someone sitting in the next seat. We place it on a lap tray but if a USB device is connected on the right side, the mouse has to navigate around the protruding cords. Having a wireless mouse helps alleviate clutter although it'll still take up a USB port. If you get a lap tray, go for one that has a built in cooling unit. Like most laptops this one can get hot after a while.My biggest annoyance with this Inspiron 1750 is that in a contrived effort to provide added value Dell has imposed some defaults and utilities that obstruct the competent computer user. If you're familiar with using the F-keys for quick keyboarding to get things done, forget it. Dell has decided that these commands should now require the use of the Function key as well, e.g. Fn+Alt+F4 to close a window. Perhaps if you're a guitarist or a concert pianist, having to play a three note chord every time you want to use the F-keys might be okay, but for my use this interference renders the F-keys unusable. This is configurable but by the time I had time to bother with sorting out how to accomplish returning this to standard functionality my wife had become accustomed to the Dell defaults on this, our shared laptop. An additional hazard of Dell defaulting to Fn key usages rather than F-key standards is that it's relatively easy for a key combo to be bumped, or for something to fall on the keyboard, and suddenly the wireless connectivity is mysteriously disabled (Fn+F2) or the next time you bring up YouTube, audio output is muted (Fn+F7).If you're used to grabbing a window by its title bar to move it around the screen, or even clicking on one of the tabs across the top of your browser, the Dell Dock utility will block your intended use. Move the mouse cursor to the top of the screen, start to click on something, and as likely as not the Dell Dock will suddenly pop into view to capture your click and hijack the next thirty seconds of CPU cycles on behalf of some unintended process such as bringing up a webcam. When you have an operating system that allows for shortcuts on the desktop this is just stupid. This can be disabled, but it should be an available option rather than the default setting. It lends itself to the consideration that if this is the best value add that Dell can come up with, devices like laptops truly have become a commodity and beyond reliability ratings there's no reason to pay a premium for a particular brand.We've had this for two, maybe three years. Just got a notification that the battery was nearing the end of its expected life. That's a very handy notification and explains why the laptop powered down after just an hour or so of listening to audio while doing household chores. Shortly after purchase we contacted Dell to acquire a second power cord so we could have, in effect, two \"laptop stations\" in different parts of the house. If I recall correctly I think the extra power cord ran something like sixty bucks as an accessory. If you want to add accessories unique to this model it might not be a bad idea to search around for generic alternatives.Bottom line, a decent laptop intended for the computer-averse, not such a knockout that it would give Dell any advantage the next time I shop for a laptop. Another vendor could easily get my business next time around by offering the Professional edition of the OS rather than the crippleware that Home versions seemingly are.Update: priced out replacement batteries. The popup warning from Dell that appears on the screen to warn of the battery being near end of life also provides a direct link to purchase replacement batteries. A six cell runs around $150, a nine cell is currently $180.As I think about it, shortly after this laptop's original purchase, along with an extra AC power cord I ordered a nine cell through Dell's online chat to keep as a backup. With chat the problems of trying to understand the offshored support person isn't really a factor. But the replacement battery the person determined this model needed protruded from the back of the laptop such that we were unable to open it when the battery was installed. We returned it and just used the six cell we had; the typical life of the battery runs about two to three hours. To Dell's credit, the nine cell battery presented this time through the warning's link has the same shape as the existing battery and looks like it would fit without extending beyond the backplane. At $180 for a battery, though, it seriously makes you consider just ditching the laptop, spending another couple hundred and getting a different brand. I've looked at generic nine cells for this model here on Amazon but in spite of the deep discount, the images look exactly like the battery that didn't fit and had to be returned.As a quick side note, a glance at other current prices direct from Dell confirm my memory of this model's AC power cords being priced around $60.", "Date": "July 19, 2011"}, {"Title": "Terrible computer and terrible keyboard", "Author": "Elisabeth Hoskins \"liz\"", "ReviewID": "R29PNWPYSHZS68", "Overall": "1.0", "Content": "I bought this computer for my boyfriend thinking it was a great laptop for home with a big screen. It is terrible - the keyboard doesn't work despite sending it back to Dell already once and it is back there again. I just want my money back for it - such a let down from Dell. I have bought myselfa  Compaq laptop in the meantime, and love it. No keyboard problems there. I have read that the 1750 is plagued with keyboard isses - so be wary future buyers!!", "Date": "July 29, 2010"}, {"Title": "Cheap keyboard, overall feel", "Author": "SAUCY T", "ReviewID": "R3TPTK6QM0SG1", "Overall": "3.0", "Content": "The computer runs great - however I just feel the quality is just a notch below where you would expect a Dell to be.  My biggest problem is the keyboard, which feels cheap and it's design of having basically no space between keys giving the feel of a complete flat surface makes me type more cautious(slower) then I would with a competitors keyboard(I bought an acer 15.6 at the same time and the keyboard and speakers are far superior).  The bottom line for me is that yes, it does what it should do well, but I feel there are better made laptops with better features and higher quality components than this one for basically the same price.", "Date": "March 13, 2010"}, {"Title": "Dell Inspiron laptop", "Author": "Tamara Weidenfeller", "ReviewID": "RMWT8QPQ6N8DJ", "Overall": "4.0", "Content": "I recently upgraded from a Dell Inspiron 1525 to this 1750 model.The differences....I defiantly like the BIGGER screen. (getting older I guess) The Volume control / speaker improvement with greater volume capacity is totally awesome. I was pleasantly surprised by the weight of this unit being so much bigger....it doesn't feel much heavier then the last one I had OR I am simply comfortable with the weight of this one. Also, the hinged portion of the unit <where the screen opens / lifts> is a HUGE improvement. The previous generations were cheap and actually pinched the wires that run through the hinge causing haze on the screen. This unit scores a TREMENDOUS improvement in this department from me.On the flip side....Dell still hasn't figured out how nice it would be for the cord (AC adapter) to be located in the back rather then the side. An improvement in that department would be nice but not critical to my daily use. I utilize the lap as little as possible and love the versatility of a carry along. Also, the keys on this unit are much different which I have found very difficult to adjust to. The previous lap tops I have had came with a beveled/raised keys whereas this unit is all flat. I am not a typist - I peck the keys with my index fingers and these keys seem to cause me fits....more errors. I never knew there was an option or difference in the keys but will certainly pay attention next time around.Over all....I give this new model 4 out of 5 stars....there still is room for improvement.", "Date": "March 3, 2010"}, {"Title": "USB Ports don't work", "Author": "Jean Starr \"Jean\"", "ReviewID": "R342QTZBOKMTEX", "Overall": "1.0", "Content": "The USB ports do not recognize the mouse, or the wireless antennae or any storage device. I have to take it in for repair. The message says the drivers are not installed. How does this get done? I am very frustrated and disappointed. Is this a Windows 7 problem?", "Date": "February 26, 2010"}, {"Title": "poor customer service experience", "Author": "A. N. Aschenbach", "ReviewID": "R3U3YPQMPC3861", "Overall": "1.0", "Content": "I have been a happy Dell customer for a number of years, but I had a very negative experience regarding an order for a Dell laptop.I ordered an Inspiron 17\" laptop direct from Dell for Christmas on 12/6. I noticed on the Dell website that the estimated shipping date was 12/18. I thought, great, just in time for Christmas. My order was confirmed within a day with an estimated ship date of 01/11. Three weeks after the estimated ship time on their website.The real problems began when I called customer service to cancel the order. Four phone calls were made on 12/12 totaling over an hour to cancel the order (unsuccessfully). I was repeatedly transferred and eventually was told that the people that could help me had all gone home for the night. My second attempt to cancel the order was on 12/14. I asked for a customer service manager and was placed on hold for approximately 45-50 minutes. A regular customer service rep picked up the phone and told me that the order could not be canceled because it was \"in production\". I told the rep that the computer had not been manufactured yet (shipping one month from now) and that I needed him to cancel the order. I was placed on hold again for a few minutes and the rep told me again that he could not cancel the order. When I threatened to call my credit card company to refute the charges eventually the rep relented and told me that he could now cancel the order.I wasted two hours of my time just to cancel an order.In the event of an order cancellation, is it Dell policy to place someone on hold until they give up? I am disappointed in Dell after having good experiences with them over the years and I ended up giving HP the business instead. Dell has been known for good customer service, but after reading some reviews and having a bad experience myself I feel like this may no longer be the case.", "Date": "December 14, 2009"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002PY7ON0"}}