{"Reviews": [{"Title": "Utter Disappoint, but it works.", "Author": "Ronie \"Goats & the Like\"", "ReviewID": "RRRSBCQVMZTTP", "Overall": "2.0", "Content": "I bought this Dell inspiron about a year ago to replace my 6-year old gateway. I looked around at prices for lightweight but powerful laptops including macs, gateways, hps and sonys. The inspiron is not the lightest available for its power class (core 2 duo, 3G ram, 250G hard drive) and it even got miserable reviews on the battery life, but for the price, there was no competition.Pros:Regular battery regularly lasts over 3.5 hours even after 1 year of daily use.9-cell battery regularly lasts over 5 hours even after 1 year of daily use.It's pink :)Built in webcam, speakers, microphone all great for skyping etc.SD card reader and USB's on BOTH sides (6 total) make for nice use of a portable mouse & other gadgets.Cons:It's really fat and heavy. In fact my first impression of what I thought would be a lightweight model was \"oh crap it's heavy!\" When I tried to buy a protective sleeve, the store told me they didn't have any for laptops as fat as the inspiron :)The mousepad is consistently unresponsive! Not only does it fail to recognize my strokes if my finger accumulates even a little perspiration, but it often takes several minutes after bootup to recognize vertical strokes, and only moves horizontally even after opening and running several programs. It also randomly \"clicks\" so that when I'm typing, my cursor jumps around despite taking extra care not to touch the mousepad (ironically, it just did it as I was typing this sentence!). This is ultimately not cool and perhaps the main motivation for not liking this machine -- you can't like it if you can't use it.The built in mic and webcam weren't recognizable by linux software until the 9.10 release. pretty upsetting from a company that sells linux based machines.Despite having a 4-year customer support and insurance plan, I still can't figure out how to get hold of a Dell representative -- their website is completely incomprehensible making my customer support agreement nearly useless.Finally, the screen is pretty dim. in fact, the dimness that they use to generate the battery life is so dark that it hurts my 26 year old eyes to read. even now, plugged in, the screen's whites are actually pretty gray.------------------------So overall I really expected more from a machine that, after customization, cost me about $1200. When you spend that kind of money on something, you really expect it to be kind of pleasant, if not even enjoyable to use. After all, dual processor, huge hard drive and battery life of 3-5 hours isn't even competition any more....but, it does work. Furthermore, owing to my genius decision to switch to linux, it also recognizes every printer I've ever plugged in to immediately without installation of drivers. This is pretty cool.", "Date": "December 4, 2009"}, {"Title": "Great computer", "Author": "Marcy in Alabama", "ReviewID": "R3SPL25JR32MSB", "Overall": "5.0", "Content": "I disagree on many points with the previous reviewer. I agree on all the good points, and yes, this laptop is a bit on the heavy side, but it's the one I keep at home on my desk and IS easily portable from room to room. I have also traveled with it and used it at work many times without any problems, but because of its size and weight, I do prefer using my netbook for travel. However, part of the reason it may be a little heavy is because it is a strong and well-built computer, one built to last! I have had absolutely no problems with the keyboard or with anything else, and suspect maybe there was something defective with the previous reviewer's computer.  I also love the crystal-clear display and the large screen. My computer is black and silver and I love its elegant yet retro look. I purchased it over two years ago, and expect and hope to be using it for several more years. Even my husband, who is a diehard Mac user/fan, enjoys using my computer!", "Date": "September 5, 2010"}, {"Title": "GREAT WORKHORSE", "Author": "Adam Sacks", "ReviewID": "R18FEY3R5BDAT1", "Overall": "5.0", "Content": "I have been using this laptop for years - my trusty Dell Inspiron 1420. Never a problem, works endlessly and is endlessly useful and reliable. My personal favorite and I even have \"always on\" internet with it built in. Highly recommended.", "Date": "August 2, 2011"}, {"Title": "Almost 6 years after purchase, running strong.", "Author": "grlnxtdoor002", "ReviewID": "R355I51T0U6TGA", "Overall": "5.0", "Content": "I have had this laptop for almost 6 years and it still runs almost as smoothly as when I got it. I rarely turn it off, carry it with me everywhere, and am using it almost constantly. The battery life is not so great anymore, but I really can't complain. I love my computer. It's a simple machine but it works well and it is sturdy!", "Date": "November 18, 2012"}, {"Title": "Best Dell Machine - Going Strong After 3 1/2 Years", "Author": "T. Stockwell \"tms020348\"", "ReviewID": "R11ODRHEZF1HS7", "Overall": "5.0", "Content": "If you're looking for a reasonably priced workhorse of a machine, this is a sure bet.I've had this machine for 3 and 1/2 years now.  I've taken it all over the world.  It is the best Dell I've had (and I've had six over the years) and it's still going strong.I bought this machine refurbished from Dell for about 600 bucks, with Vista, Webcam, small hard drive, and no bluetooth. Over the years I've easily upgraded this machine as needed, now to Windows 7, 360 HD, bluetooth, and 4 GB of memory, and 9 cell battery. It's just now starting to reach the end of it's work-life, but I think I will get another year out of it for my purposes.I have carried this laptop all over the world. It has an cast aluminum exterior body (not plastic like the 1520) and it's worn well under hard conditions.  I've had some minor problems with the keyboard, but because it's modular in construction, popping in a new one was a snap.This machine has done everything I've asked of it.  It's the first Dell I've had that I didn't feel I would have to throw away after 2 years.  Whoever was on the design team for this machine did a good job.It's got an easy to reach hard drive, easy to reach memory expansion, easy to exchange battery, a combo card reader, an sd card reader, dvd drive, external monitor plug, s-video plug, four USB plugs and a firewire plug.  It is not heavy, despite the review from another user (his problems are because he was running Linux on a Windows-based machine and he was having driver issues.) But with the 9 cell battery, you can feel the weight.  The 9 cell gives plenty of power, and I bought mine off ebay (not from Dell).  The battery has been in use for 3 1/2 years and is still holding a charge quite well. I use the battery that came with the machine as a backup on long flights.Vista stunk on this machine, but it was usable. Windows 7 (running 32 bit mode) turns this machine into a workhorse.I like the screen resolution, and the track pad can be easily configured (despite the other reviewer's comments).As I was anticipating the demise of this machine in the future I began looking at everything out there under a thousand bucks.  Then, by accident, I shorted out the video on the motherboard (completely my fault).  So then I really had to decide what I was going to do to replace this machine.  I again looked at everything out there (refurb'd Macs, new Toshiba 835r, another Dell 14r, HP's) and finally concluded that I'd rather get a used motherboard and keep the Dell 1420 going.  For less than 120 bucks, it's now back in business, and I can put off a purchase for another year (at least).Talk about loyalty, eh?This machine is a dynamo.  If you can find a decent on used, grab it.  Just don't get the NVIDIA graphic card models, as they have a flaw. Get the one with the integrated Intel graphics card. You won't be sorry.", "Date": "June 7, 2011"}, {"Title": "Junk.", "Author": "KR", "ReviewID": "R34X3UVJ7IKP7J", "Overall": "1.0", "Content": "What a hunk of Junk.New, this laptop worked for a year or two.After that, it required a motherboard replacement because of the NVidia Graphics card. (There was a class action lawsuit involved).Now, it shuts down randomly when over heating (not caused from dust).Don't ever reinstall the OS from its factory state, because it will never work right again, the BIOS is updated on mine, and if I reboot when its hot, it will overheat before the OS takes control of the processor/fans and it will continuously reboot.This laptop is extremely poor design, as is most of the crap Dell produces. Buyer Beware. I'll never buy Dell again.", "Date": "June 12, 2012"}, {"Title": "Keep it in good shape, with free updates but also $$", "Author": "Daughter \"Sharon\"", "ReviewID": "R2ZY7ZO6CF0GD9", "Overall": "5.0", "Content": "Purchased in 2007, it is back to being a good computer.  I have an Apple laptop as my main computer now.  But, that was after this Dell had a Trojan experience.  Since then, I do not email from this Dell, but, I do have iTunes on it.  I updated everything:  battery, OS, Ram.  That and the security updates are keeping this a good computer .... at least for the Internet and iTunes.  I was not keen on the Ancestry software and switched to MacFamily on the iMac.  What to do with this Dell, but, to keep it up to date.  It is running very cool! (I cleaned the fan.)  I pay too much for laptops probably, but this one really needed help when I went to Apple for another computer.  If it was as good as it is now, it might still be the main computer.", "Date": "December 9, 2013"}, {"Title": "Please don't buy this laptop.", "Author": "Clau", "ReviewID": "R9WYVA18UPIX0", "Overall": "1.0", "Content": "I never liked Dell, I thought they were just cheap computers, now I know it's true.  My husband convinced me that they were of better quality than before, forget it.  I hate this computer, it is so slow.  I think I will never buy Dell again.  I hope this helps people from some miserable computer.  Don't waste your precious tinme.  (My Dell just rebooted for no reason and I wrote this review on my IPad,which I love, in the mean time.). Buy Toshiba instead I loved my old computer.", "Date": "April 23, 2013"}, {"Title": "You can do a lot better...and a lot worse", "Author": "J. A. ANDERSON \"\"GET REAL, DR. PHIL\"\"", "ReviewID": "R15L58T8UCOA7", "Overall": "3.0", "Content": "This is a middle-of-the-road laptop. If you're looking for functionality and something to just get by, such as with an Office program, this will work fine. If you need a laptop for graphic or memory-intensive programs (or for gaming), the Dell Inspiron 1420 should not be looked upon as a solution. The touchpad lacked a great response time and my unit came with a rattling processor fan, which was integrated on the motherboard and therefore not fixable. It's upgradable so you don't have to run Vista, but this is not a long-term solution. In another couple of years it will be obsolete. Still, any Dell is better than any HP.", "Date": "January 11, 2013"}, {"Title": "Dell inspiron 1420", "Author": "Sam", "ReviewID": "RJ5XTT2SGEX0Z", "Overall": "4.0", "Content": "The laptop i bought is Dell inspiron 1420 is a good laptop according it's condition it is better than what i thought everything is good with it, it runs good and i hope i can keep it the way i received it.", "Date": "October 6, 2012"}, {"Title": "at least i have a computer", "Author": "S. Carter \"isuzucrewcab\"", "ReviewID": "RV5X21CRS99LW", "Overall": "2.0", "Content": "I got this when i was about five and it was really fun but it's not built for windows 8 so it keeps shutting down.Precaution: Computer cover has a rubber skin but i thought it was dirt so now i need a new one.", "Date": "September 22, 2012"}, {"Title": "Dell Inspiron 1420 Laptop", "Author": "Jessica", "ReviewID": "RRAEL47W0NWAP", "Overall": "4.0", "Content": "I purchased mine from the Dell website. I have had it for 3 or 4 years already and it's still going strong. The only problem with it now after having it for a couple years is the battery. It runs out of battery pretty quick when it is  not plugged in. It isn't the lightest laptop but it doesn't bother me because I only use it at home. I have dropped it a few times but it still worked perfectly fine. Overall, I have been completely satisfied and happy with this laptop.", "Date": "March 8, 2012"}, {"Title": "GREAT COMPUTER", "Author": "Custer \"Ron J.\"", "ReviewID": "R1G8M42O4XFODQ", "Overall": "5.0", "Content": "I AGREE WITH THE PREVIOUS REVIEW WHICH CLAIMS IT AS A WONDERFUL ADDITION TO ITS USERS HOUSEHOLD. I HAVE USED IT FOR MONTHS AND HAVE FOUND IT TO BE A JOY. IT IS VERY LIGHT WEIGHT, AND IT IS HIGHLY RESPONSIVE AND COMPATABLE WITH EVERYTHING. IT HAS AN INCREDIBLE AMMOUNT OF FEATURES FOR ITS PRICE--ENCLUDING cd/dvd BURNER THAT IS EXTREMELY QUICK AND EASY TO USE. I HAVE HAD NO ISSUES THAT INCLINE ME TO BELIEVE THIS UNIT IS QUESTIONABLE. ALL FEATURES INCLUDED MAKE IT A COMPLETE PACKAGE. FOR THE PRICE AND ITS SIZE, I HAVE NOT SEEN OR EXPERIENCED A BETTER LAPTOP OF ANY KIND. THE COMPUTTERS COSMETIC MAKE-UP LEAVES AN IMPRERSSION OF A BIGGER SCREEN SIZE THAN IT ACTUALLY IS. I HIGHLY RECOMEND THIS ITEM.", "Date": "September 17, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0026S6YYA"}}