{"Reviews": [{"Title": "Great value for the features", "Author": "J. Jessup", "ReviewID": "R25DJB892QVQMZ", "Overall": "4.0", "Content": "I bought this item for my cousin, who wanted an inexpensive laptop with a wireless network adapter to connect to the Internet from anywhere in his home. I set up the Vista operating system for him, and took a good look at the laptop's features in the process. There's a lot of plastic in the construction, so it's not the most durable design compared to more pricey laptops, but overall it's a fair tradeoff for the price paid.  I would certainly recommend this item to anyone looking for a decent quality laptop with all the essential bells and whistles, and a Great price at $329 shipped. The 15.6\" screen is quite nice, more of a rectangular format than square, but still roomy for displaying multiple windows. With a 1 year warranty from Acer, it was money well spent. I even thought of keeping it for myself after taking it out of the box and viewing it for the first time, and I'm a very discerning computer technician! If the price is still the same, BUY IT, just don't drop it, and use an external keyboard when you can because the laptop's keyboard is very light to the touch and may not be what your fingers are used to. 4 stars for the bang for the buck and the features package...", "Date": "August 7, 2009"}, {"Title": "Nice little machine", "Author": "opanto39 \"opanto39\"", "ReviewID": "R2G9WLXNUDW895", "Overall": "4.0", "Content": "Nippy enough machine, decent full size keyboard & screen, very usable touchpad unlike so many out there. Paid $300 at Micro Center (store pickup only). For what it's worth it's WEI base score is 3.0 (Processor 3.4, MOPS 4.8, Graphics (both) 3.0, Hard Disk 5.4. Well recommended unless you want small or light.", "Date": "July 29, 2009"}, {"Title": "Excellent budget laptop", "Author": "C. luong", "ReviewID": "R28XSVI1JYEQ0O", "Overall": "5.0", "Content": "I bought this laptop at an excellent price. For the money, this is a great laptop for those who need to surf webs, microsoft word/excel, movies, burn CD/DVD, etc. Only negative is that it came with Vista and lots of extra softwares I dont need. This laptop came with 1 stick of 2GB of memory, and I bought an extra 2GB (for only $25) and installed it. With extra memory, it performs alot faster with Vista and I was able to do more multi-taskings. If you dont like Vista, XP can be installed on this. For the price you cant beat it.", "Date": "September 17, 2009"}, {"Title": "Great value", "Author": "Arthur Cuda", "ReviewID": "R35M5F1PZ6XS5", "Overall": "5.0", "Content": "For $279 at Best Buy, this is quite a nice little machine.  I have only had it for a few days and can find nothing to complain about.  I have not accessed all the features, such as webcam, but those I have used work quite well.  I hooked this up to a wireless keyboard, mouse and wireless printer.  This makes a very neat package and minimizes the cables that get tangled and collect dust.", "Date": "August 22, 2009"}, {"Title": "Great gift!", "Author": "Kat E \"n2deals\"", "ReviewID": "R3OK7KFTKMQ36E", "Overall": "4.0", "Content": "I bought this computer for my son as it had all the features he wanted. It is light weight, a great size for travel, it was also very easy to set up and perfect for someone who likes to surf the net and download music.  He loves it.", "Date": "November 27, 2009"}, {"Title": "Great laptop for the price, can't beat it!", "Author": "Chris \"Chris\"", "ReviewID": "R517JJQ0857KV", "Overall": "5.0", "Content": "Great system, really nice design and fast enough for any of the basic stuff I do. I bought more memory and after installing it was much faster. The raw system out of the box comes with allot of free evil ware, but once you clean it up the system is really nice and fast, but I would clean all that stuff off at least turn it off, it really takes up allot of resources.One thing that is nice but also strange is the keypad, you get a nice big keyboard with a keypad and having a keypad is really nice if you are using it to do numbers. But it does move the keyboard over to the left and that make it some thing to get used to. But once you figure it out it really works great!", "Date": "September 21, 2009"}, {"Title": "Great machine!", "Author": "Henrique Magalhaes \"hmagalhaes\"", "ReviewID": "R29JAKVK9E9Q3C", "Overall": "5.0", "Content": "Best deal I could find at time... beautiful and fast machine. The only problem it's the OS (vista) but after some tweaks it become almost fast as XP.", "Date": "November 27, 2009"}, {"Title": "Excellent for the Price", "Author": "-> \"World Walker\"", "ReviewID": "R349NFZ3NALR2L", "Overall": "4.0", "Content": "For the price I paid, this was a steal. The configuration was very good and the laptop wasn't a budget looking laptop - it catches quite a few envious looks when I use it at a public place. The only bad bit is that it comes pre-installed with a lot of free Yahoo games which needed t be uninstalled along with the free trial version of 1 or 2 software. But then for the price, it was an amazingly sweet deal!", "Date": "September 13, 2009"}, {"Title": "good", "Author": "agustin iglesia", "ReviewID": "R2P9O9JPVHON09", "Overall": "5.0", "Content": "muy buen producto. rapido facil y a tiempo la entrega. sin contratiempos en todo el proceso. lo recomiendo a a", "Date": "February 21, 2013"}, {"Title": "my first computer", "Author": "Cristina Moreau", "ReviewID": "R3CX9IPFGA00ZY", "Overall": "5.0", "Content": "This was my firt computer and I bought it for first time on intenert, it was great experience, I want anotherrrr laptop!", "Date": "January 30, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B002A6JYUE"}}