{"Reviews": [{"Title": "OK with some pretty major problems (3.5 - 4 stars)", "Author": "Avid Reader", "ReviewID": "R3BJB4JOXVFE4M", "Overall": "5.0", "Content": "In short this computer is amazing.  You wont find anything else under $2000 that can beat this.  It comes with a standard 2 year warrant and 1 year accidental damage warranty plus a 30 day zero bright dot policy.  The included mouse and bag are also great.  So far I have been playing crysis and bad company 2(a great game for your new computer) on near full detail with amazing frames with the ati radean 5870(best single graphics card for laptops), 8gb of 1066mhz ram, and the new blazing fast core i7 processor.  Although the computer is the size of some 18 inchers, I found that it looked and felt amazing.  The whole back, palm rest area, and keys are rubberized which provides a great feel and grip.  The keys are also back lit and the speakers on the computer are very loud and provide good audio  The one thing I did not like about this computer was the touch pad buttons (not the touchpad its self which is great) are combined under a plastic cover which is really hard to press down on.Pros:Best for the priceBack lit keyboardrubberized feels greatBest single graphics card ati 5870 with 1gb gddr5 ram8gb of ram is more than enoughGreat processorCool unique lookand i can just keep going on and on..Cons:Touch pad buttons I find hard to press down onNumber pad on keyboard feels squishedOverall 10/10And as I said before this is the best!Update after about 3 monthsof useI have already lost nearly all the rubber feet which do not seem attached well (medium problem).  The keyboard has a lot of light bleeding through under the ` key (minor).  And the worst problems i have experienced, my computer overheats! It shuts its self down randomly and i do not believe that the fan over the CPU is working (very major).  I have sent it in for RMA with asus and will post an update later.If i could change my rating I would give it 3.5-4 stars.", "Date": "March 17, 2010"}, {"Title": "GPU may overheat and cause laptop to shut down", "Author": "Zephine", "ReviewID": "R5IMR7F44QHAH", "Overall": "3.0", "Content": "I had the G73JH-A1 for almost two weeks before it shutdown while playing a game. A web search for G73JH and shutdown showed it could be overheating problems. I installed desktop gadgets that monitored the CPU and GPU and tested by playing various games. While closely watching and frequently checking the GPU temperature, it was generally anywhere from the mid 90s to just over a 100 and at times would reach 107 degrees.After reading more on the web, I downloaded the FurMark benchmark utility and tried the stability test. In less than 3 minutes, the laptop reached 110 degrees and shut down. If the GPU ran hotter than a \"normal\" 95 degrees, but remained at a constant 100 or 101 degrees without reaching critical temperature, it might have been acceptable. Perhaps by using a cooling pad and making sure the ambient room temperature wasn't higher than 90 I could do without having to send my G73JH for service. But the fact that a gaming laptop could overheat to shutdown with GPU intensive programs meant an unstable video card.Just to make sure it wasn't the benchmark utility, I tested it on my desktop computer which has an ATI 5770. It ran at a constant 96 degrees for 15 minutes. A friend installed FurMark on her laptop with an nVidia 360m and it was stable at 85 degrees.I'm glad this happened during my first 30 days. Instead of having Asus replace the video card or entire laptop with possibly a refurbished one even though I had just purchased it new, I had Amazon issue me a RMA for an exchange. Hopefully there's one in stock when it reaches them because I really did like this laptop and am willing to give it another chance.Aside from the GPU overheating and having to deal with an exchange, there were some minor cons. I won't bother with what I liked because it's been covered by plenty of other reviews.- The screen is way too glossy, causing lots glare and reflection on the monitor.- After a week the spacebar sometimes made a squeeking noise.- Dedicated volume buttons would have been easier than having to use both hands to press two keys, the Fn + F11 or F12.- I wish the Numlock light was on the right side of the keyboard near the number keys. Instead it's on the left side of the laptop, beside the Capslock key.- On the Numberpad, the right arrow key is under the 1 and the 0 is under the 2. I'm used to pressing 0 with my thumb and have been trying to get used to the shorter 0 key.- The touchpad bar for the mouse buttons is difficult to press. I'm glad I use a separate mouse.- This laptop is so big it doesn't fit in my old 17\" laptop case. Asus provides a decent backpack but it's on the thin side and won't hold more than one or two textbooks. Be careful and make sure you buy a laptop case or backpack large enough.4-stars if the laptop didn't overheat but 3-stars because of the lemon. If Amazon is able to send another for an exchange I'll update this review again when I receive the replacement.Update July 9, 2010: Received my exchange today. I have to really commend Amazon's return service. It was very easy to request an RMA and they even refunded me the shipping costs for sending it back to them!After initial setup, the first thing I did was install Furmark and then I held my breath. I can let out a sigh of relief. After 5 minutes it was at 90 degrees, and after 20 minutes this new G73JH-A1 was running at 93 degrees. It might have hit 94 or even 95 but I think 20 minutes was enough to confirm it's stability.A couple of other things about this laptop:- The included mouse's buttons are very sensitive. My fingers sometimes press a top or side button when I pick it up to move the cursor. Will take a little getting used to since the buttons are so delicate.- I wish Asus had included recovery discs with this laptop. Perhaps it was a cost cutting measure. After all, this is a $1650 laptop that other companies would easily charge $2100 or more. Regardless, I don't mind because if I uninstall the bloatware and run Windows Update, I can have bloat-free updated recovery discs.Despite all the nitpicking, this is an incredible gaming laptop. Quad-core CPU for future programs and games, 8 gigs of RAM, Blu-Ray player, and one of the best laptop video card currently available, the ATI mobility 5870.", "Date": "July 2, 2010"}, {"Title": "'Gaming' review", "Author": "J. Alix \"J. Alix\"", "ReviewID": "R1FGFE5UO89SLJ", "Overall": "4.0", "Content": "You can find a ton of reviews regarding the hardware and you can compare similarly configured gaming notebooks and you'll see that this is HUNDREDs of dollars cheaper.  I've had the machine for almost 2 weeks, gaming about 1-2 hrs a day.Pluses-have not had a single technical issue-function keys for volume and brightness do not bring me to the desktop when playing games (like it did my previous HP)-HDMI to HDTV is plug and play (video and audio)Now for the Gaming partI play around with AA (anti-aliasing) from highest and then bring it down until very smooth playability.  These are the games I found to push the notebook the most (settings to be very playable at native 1920x1080, I don't use vsync):Crysis/Crysis Warhead - no AA, almost all on High/Gamer settingsBatman Arkham - No AA, All MaxRE5 - All MaxLost Planet: Extreme Conditions - HDR at medium, No AA, almost all at maxPrototype - All maxWolfenstein - All maxBorderlands - All maxRed Faction Guerrilla - No AA, almost all at maxJust Cause 2 - No AA, almost all at maxL4D 1 and 2 - All max, even vsysncEvery other older game (even newer ones), the G73 just breezes through, (such as GoW, UT3, Dark Void, L4D, TR:Underworld),  I've found it handles the Unreal engine quite well.I can't believe how this notebook handles games at 1920x1080.  Stays cool and quiet.  Audio is pretty decent, even takes care of Prototype's low volume issue (just crank it up!).  I've been gaming on laptops for more than 12 years (no space for desktop rigs) and  I've never had a gaming laptop, always had to compromise the graphics.  Not anymore.  Playing at 40-50 frames/sec is surely a welcome change.", "Date": "April 19, 2010"}, {"Title": "the much wanted gaming laptop reviewd", "Author": "asianguy", "ReviewID": "R8MCJYZC2DN9S", "Overall": "4.0", "Content": "OK so I've been using this for about a week now. The laptop was originally preordered in march 8,2010 and was received on march 13,2010...not bad of a wait. A lot of people who preordered on other sites are still in a waiting game. So anyhow let me get on with the review. P.S. to make a summary short the gaming laptop is really a 3 1/2 stars in my opinion but I am hard to please and would recommended this laptop? - yes I would.The casing: The casing is all black with different materials composing the laptops exterior. The top of the laptop has a heavy and thick rubber that feels good to touch, stays cool, looks good and provides some gripe, but the bad thing about it is that it scuffs easily. Now you might not think this is a big deal but when you start to see scuffs on your new laptop out of no where well... the armrest has a different feel from the top of the laptop and less rubbery more like a semi plastic version which is by no means bad. There is a grill that covers the speakers at the top of the keyboard. Because of this there will be a lot of dust that may accumulate there and is hard to clean. There is no volume rocker or other media controls on the outside casing which makes it hard for anyone watching a movie or playing games. Two vents in the back which drives the hot air out and also a couple of vents underneath the laptop to draw in cool air. The panels to the casing is not that good for normal maintenance, what I mean by this is when you have to clean the two fans out which your supposed to do every month or so, it will be difficult because the access is on the top, so you will have to remove the screen and the keyboard to reveal the fans. The bottom side do however have easy access if you want to upgrade rams and hard drives.screen: the screen is all glass not that edge to edge design but still pretty good. It is very bright... makes my old gateway laptop screen look dark and faded out. It's 1920x1080 resolution is awesome, however if the laptop is ever outside it will produce a annoying glare. Plays bluray movies and game all beautifully. A 2.o Mp webcam sit on the top of the screen.Keyboard: the keyboard is kind of bad. At around the middle the keys when pressed will flex and the keys will have a kind of spongy feel. There was a guy on youtube who said that it prevented him from typing too fast and I laughed at him, that is until I got my unit and started typing on it. The keyboard in particular has a long response time so when typing there will be a lot of compound words being formed. Is the keyboard durable and will it last? well I think it will last if you take care of it but I highly recommend a external keyboard if you are planning on typing on this laptop alot. Still it sure is nice looking when lit up though, well my friends and family were impress by the look of it anyway. The other bad thing about the keyboard is the arrow keys. For some reason asus grouped them together between the qwerty keys and the number pad so it makes it kind of weird.performance: well the performance depends on alot of what you do even though it is heavily spec. If you are planning on playing games and running intensive programs on this computer than you will definitely see alot of improvements depending on how old and under spec your computer is now. My old Pentium M gateway is still running strong but when I tried to load up batman arkham... well it was so slow the computer just kind of gave up trying to install. The g73 however loaded in about 15 minutes. When surfing the web Youtube videos loads a few seconds faster and the responsiveness of loading pages are a tad faster as well compared to my old computer. In short if you are planning to use this computer as a hardcore gaming or multimedia entertainment system that I think you will be impressed, but if you just go online and use standard office products well maybe you should just save your money and get a cheaper computer.track-pad: huge track pad that has multi touch and scrolling feature on the side. Not very well positioned but you can disable it so your thumbs don't accidentally activate it while typing. The track pad itself is smooth and glides easily but the double tap can sometime be unresponsive and the single click button can be hard to use as it takes a bit of pressure to actually click on it.For me I had to spend about a day deleting bloatwares and tweaking the computer to my preferences. So software wise well once your done you will have a barebone laptop with windows 7 home premium 64 bit and some utilities support. One of the biggest gripe for me was even though there was a ton of useless bloatware there was no bluray playback software. So basically you can't play bluray movies on the laptop from stock. You will have to download 3rd party software like powerdvd or windvd to play movies. Asus free windvd 8 was a bad program and caused a lot of pause and skips during the movie. It does come with trendmicro and windows firewall but I had deleted and use other 3rd party software which they are much better.The computer stays cool for the most part but summer haven't come yet so I will have to wait and see. The ati graphics card tend to be hotter than the cpu so the fan on the left side gets little more noiser but overall I can't complain about fan noises. For those who wonder if you need to upgrade thermal compounds than the answer is no unless it makes you feel better and you got the money to blow.There is 2 hard drive both partitoned into 2 parts so when you look under specs it will show up as 4 parts. At 7200rpm the computer booted up in about 45sec. I have seen people upgrade to ssd and boot up in less than 20 sec. But for the price I think I will stick with the 7200rpm seagate hard drives.ATI HD 5870 mobility runs good and though I have yet to upgrade to 10.3 catalyst the system still plays most games I throw at it with great fps. However the gpu can run pretty hot. For those than wonder if you can upgrade the gpu, well it is no soldered to the board so....?My laptop came with 8 gigs of Kingston 1333mhz rams so that will probably last for the life of the laptop without a need for upgrade even though you could take it up to 16 gigs.  From my use I have not experience any latency problems.The speakers are good it actually gets pretty loud without distortions but the sub-woofer at the bottom is barely noticeable.The backpack and mouse that comes with the A1 and A2 are pretty good, for people who said the mouse cannot be use for regular purpose well I have to disagree.well I doubt I have cover all points since this is my 1st review ever but overall I like this laptop even the keyboard really bothers me and I will have to plug in a external keyboard the machine itself will work great as a gaming and entertainment system. Make sure to have 6 blank dvds to make the recovery disk as Asus did not include one.  If you have any question just ask under reply and I will update. Hope this helps", "Date": "April 17, 2010"}, {"Title": "What an amazing machine!", "Author": "J. Bryant", "ReviewID": "R2FJELHU7KBJQE", "Overall": "5.0", "Content": "Wow! Talk about insane! Every game I have is cranked wide open on the graphics. I turned on every single feature and up to its max and have YET to see this machine sputter! WARNING: the Steam application DOES NOT work on Windows 7 64 bit!!!! If it did, Call of Duty Modern Warfare would rock! Everything else runs at or beyond crazy frame rates.The fact this machine is missing PCMCIA and Firewire is no problem. In fact, as I understand it PCMCIA and Firewire actually take CPU cycles that would otherwise be spent on better things like graphics.Editing full 1920x1080 HD video on Sony Vegas Pro was as close to real-time as you can get on a PC.Sony Acid probably could have more tracks than you could count and still not miss a beat. VST instruments and effects had a delay nearly matching the MIDI processing delay which was breath-taking to witness.This is my new carry-around with my M-Audio Torq / Xponent! Torq literally was next to real-time when syncing to MIDI. You talk about crazy? Ha, I will show you crazy; hook up my Roland MC-909 to Torq via Xponent and do real-time remixes, while running the light show all from my ROG laptop.Now, why buy a smack-in-tosh? Ain't nuffin like that going on over there, friends. I use to be anti-microsoft but now I'm a PC! Asus, put me there! ROGs rule!", "Date": "March 25, 2010"}, {"Title": "A powerhouse of computing", "Author": "Aaron T. Whitehead \"blksnak\"", "ReviewID": "RM4CICGVLD5X", "Overall": "5.0", "Content": "This computer just screams.  It runs all of my games on the highest settings without a shudder.  It has a beautiful HD display, 8 GB of ram and an unbeleivable TB of hard drive space.  It has everything that a $3000 Alienware for half the cost, plus Asus includes a one year accidental damage warranty and a full 2 years of warranty for no additional cost. It was a great purchase for me, and had no problem taking the place of my Dell.12/2012.  I have had this computer for 2 years, and the only issue that I had was overheating and shutting down when playin 3d games.  I discovered that it has the air intake on the keyboard, and my putting the mousepad there was causing the issue.  I stopped using the keyboard as a mousepad and have had no further problems.  It was a great purchase for me.  I will replace it with another ASUS when if it ever gives me trouble.", "Date": "May 20, 2010"}, {"Title": "Couple flaws, but almost all win", "Author": "Gearbox", "ReviewID": "R23AAGLLH3X0BP", "Overall": "4.0", "Content": "So here's the things that ASUS did right with the laptop, in my opinion:1. Didn't make it look absolutely tacky (like their G51 series with some lame graphic on the front).2. Matte black surfaces (no more fingerprints!).3. 17.3 backlit LED screen (great colors).4. Full-size chiclet keyboard (lights up, too).5. Choice of specs - Intel i7-720QM, 8GB DDR3 RAM, 500GB x 2 hard drives.6. ATI Mobility Radeon HD 5870, which is currently the 2nd fastest graphics card ever made for laptops (only recently superseded by the NVIDIA GTX 480M).7. Runs almost all games with high-quality settings at 1920x1080 (includes new games, too).7. 2 megapixel webcam.8. Great sound system (comes with a subwoofer and is LOUD).9. Awesome cooling system that works by taking in air from the vents under the screen and directing hot air to the back of the laptop (little fan noise, even at max load)10. Free backpack and gaming mouse (with adjustable DPI settings).11. All for under $1799.99 (I got mine for about $1580).Here's the problems that I have with the laptop:1. Standard manufacturer bloatware (I removed most of them).2. Ports for the laptop (no USB 3.0, eSATA - however there is HDMI, VGA, 4 x USB 2.0 and card reader).3. A single rubber bar for the touch pad's left/right click. Lack of tactile feedback and distinction from the left/right button may cause confusion to some users (good thing there's a mouse)4. Roughly an average of 2 hours for battery life (This is to be expected but I put this here for your reference).5. No hardware RAID.Finally, here are some tips if you are buying this laptop:1. Register with ASUS online immediately after receiving your product. You are entitled to a 2-year warranty for defects and also a 1-year warranty for accidental damages (requires mailing in some paperwork).2. Update your BIOS to 209 as this fixes some issues with the laptop. For example, BIOS 206 (what mine came with) has a bug where if your laptop is on battery power, the CPU stays underclocked even if you plug in AC power later. You will have to restart to fix this.3. Go to AMD's website to install the latest drivers for your graphics card.4. If you install Steam and are experiencing crashes, Creative's audio software may be causing your problems. Uninstall it to see if it solves your problem (Realtek will continue to provide audio support for the laptop).5. Referencing the cooling system earlier: Since the air intake vents are under the screen, and you're the kind of person who likes to plug in an external monitor, keyboard and mouse, it is not recommended to use the laptop while it's closed.I hope this review helps you. If you have questions that weren't answered here, Google and NotebookReview are great places to help you. There are many solutions, tips and tweaks to everything related to the G73JH series and they're out there.", "Date": "July 19, 2010"}, {"Title": "only laptop you will need", "Author": "Y. Kim", "ReviewID": "R3FAPJ023GDNOS", "Overall": "5.0", "Content": "just got the laptop abut 2 weeks ago, ordered it on pre-order.  so far i am thoroughly enjoying the laptop.  fast, reliable, clear and very functional.  a bit heavy to be carried around as a laptop but it was a desktop replacement so i got what i asked for.  you will have to download the windvd for bluray on asus website to watch bluray movies.  i have tried playing a few games modern warfare 2 on max resolution and everything is running smooth as ice. i highly recommend the laptop.  added plus, get it from Amazon, their customer service is impeccable.  i ordered mine when it was priced at $1699 and when it was shipped i noticed the price had dropped to $1648.  called the cr and they were kind enough to credit the difference.  NICE!!!", "Date": "March 25, 2010"}, {"Title": "A good laptop if you know what you're doing", "Author": "Eric LeMarier", "ReviewID": "R14NU6QL4N2AC", "Overall": "4.0", "Content": "I ordered the G73J-A1 at the end of July.  I decided to write this review to help people learn what they have to do in order to make it work well.First off, you must know that the drivers for the Radeon HD 5870 that are installed are the ones you should stay with. If you update to the newest drivers, it will cause problems with games crashing and videos/sound skipping or freezing.  ASUS is working on a fix for this.  I also believe that this is what people are talking about when they say their laptop overheats.The second thing you should become acquainted with is that the touchpad needs to be configured and calibrated to your tastes.  I downloaded the newest drivers from ASUS's website for the touchpad and after tweaking the settings, I'm able to use the touchpad to my liking.  When the laptop first comes to you, you might think the buttons are very hard to push and the touchpad is not that responsive to your touch.  Give yourself some time to calibrate yourself and tweak the settings with the new driver and it works fine.  Ditto for the keyboard which some people say is slow to react to their typing. I'm typing on it right now and the only problem I have is I mishit keys while I type.  It works perfectly and the backlight on the keys is awesome.Other people have also said they had problems with the Creative software (EAX) seeing that the soundcard is not a true Creative product.  I deinstalled the EAX drivers when I had the sound/crash problems from updating the ATI Radeon driver.  I never reinstalled it and I still think the sound is pretty good (I'm a music teacher/musician so I think I know a little about this).The G73J-A1 is awesome for music creation and gaming.  I use Cakewalk Sonar 8.5 for home recording and have no problem with it at all.  It also cooks on gaming and I've not had any problems except when I updated the ATI Radeon driver to the newest version.  It's perfectly usable with the driver ASUS installed and you can always download the old driver and reinstall it from ASUS's website should you have a problem.If you are good with configuring your laptop it really is worth the money.  I rated it 4 stars only because you need to know what you're doing to make it work perfectly.  I found the following website to be really good for reference if you have problems:  [...]---------------------------------3/5/2012 UPDATEI have gotten Grey Screen of Death video card errors sporadically over the almost 2 years of having this laptop.  I found a place on the ASUS Support forums where they offered a way of flashing the VBIOS (which is not fully supported but was given with directions from one of the forum moderators).  Since doing that....I've had no GSOD problems.  I still love this laptop and even use it with my wireless HDMI connector to use it as a media center in my house. I also use it for work (music teacher/composition/recording).", "Date": "September 5, 2010"}, {"Title": "A powerful laptop for a great price", "Author": "R. N. White", "ReviewID": "R3E2TBQSNC8T7K", "Overall": "5.0", "Content": "I got my G73JH-A1 from Amazon on Thursday.  For the money you really can't beat this laptop right now.  I'm very pleased.Pros: Beautiful 1920x1080 display, CPU and GPU handle games very well.  Backlit keyboard is nice and the chicklets don't bother me a bit.  Two internal hard drive bays with identical HDDs.  Bluray drive.  Great hardware for a lot less than a similarly configured gaming laptop would run you.  Easy access to HDD, wifi module, and RAM.  Superb cooling with very low noise.  Nice design and keyboard layout is good.Cons: Limited I/O: no eSATA, no SPDIF.  1066 memory.  Atheros wifi instead of Intel on mine.  Trackpad is easy to trigger while typing.  Lots of bloatware installed out of the box.  Odd partitioning on the second drive.Couple of hints: move the swap file to the second hard drive.  It comes configured on the OS drive.  Even though ASUS is slow with GPU drivers you can install the latest Radeon Mobility drivers.  Win 7 will easily merge the partitions on the second drive if you don't do a wipe and clean install like I did.  Having a second drive bay more than makes up for the lack of eSATA.", "Date": "May 16, 2010"}, {"Title": "Hello Grey Screen of Death, Day 1.", "Author": "KC", "ReviewID": "R1QI0O2P6KO87K", "Overall": "1.0", "Content": "The CPU is flawed.  The technology is great, but not in this shell/  From the Tech Support, the forums, and many posts here, the configuration leads to hardware issues.If you are into 2-3 weeks, and a few different laptops before one works, this is the one for you.  Otherwise, spend the extra 800 bucks and get the other model.", "Date": "February 17, 2011"}, {"Title": "Do not update the BIOS!!!", "Author": "William F. McMillen Sr.", "ReviewID": "RB9ISCG0RC9ZI", "Overall": "5.0", "Content": "I have had the G-73-JH-A1 for a few months and LOVE the machine. It is a true desktop replacement. The only thing I would caution potential buyers about is updating the BIOS, DON'T DO IT. If you go past rev. 205 you are likely going to loose your keyboard backlighting. I am currently having to go throught ASUS to get this problem fixed. Other then that one problem the machine is a monster. If you are in the market for a mobile gaming rig, this one is great. It will run WOW and StarCraft II at max resolution and detial with out a problem. If you just need to crunch numbers (Cadd, or LightWave) it will handle them also and not break a sweat.", "Date": "September 30, 2010"}, {"Title": "Great laptop, would recommend it", "Author": "James Cho", "ReviewID": "R1T6JEZQ3O6L6M", "Overall": "4.0", "Content": "I just got this great laptop a few days ago and so far I think it's an AWESOME machine but does have some minor flaws.  I have mostly only bought Dell's in the past but with my recent experiences with them, I will NEVER buy a Dell again.  I had been scoping out laptops for a few months and when my desktop hard drive suddenly went, it was time to pull the trigger.I had a few mandatory requirements: screen size minimum 17 inches, minimum 6 gig RAM, a good graphics card (handle multiple monitors) and at least an Intel dual core processor.  I'm not a gamer but am a software developer so I really need the processing power and RAM.  This lead me into looking at \"gaming\" laptops for their power and better graphics cards.Anyways, this computer fit the bill perfectly and then some(you see the specs), more than satisfied my requirements and it looks much better in person than the pics.  But I took a look at the version at Best Buy before purchasing it.  I would have gotten the one at Best Buy which had less RAM and hard drive space but was $400 cheaper except there were none left in any of the stores in my area and the guy said they were discontinuing it (looks like others were already all over that great deal).  So for $400 more I got 8GB of RAM vs 6GB and got 1TB of hard drive space vs 500GB plus a nice backpack to go with the laptop.This computer looks great, no problems setting up and configuring anything and is working like a charm.However, I do have a few gripes.  Other reviews complain about the keyboard responsiveness, I don't agree, it's fine and being backlit is a huge plus except the layout of the keyboards function keys is quirky. For example, I'm really into using keyboard shortcuts and a \"paste\" is SHIFT + INSERT, there is an insert key on the upper right side of keyboard but that one doesn't perform the keyboard shortcut.  There is another insert key on the numeric keypad (lower right corner) that performs the paste.  I see other reviews state that there is no external volume control, NOT true.  Again, it's a keyboard thing.  You need to press the Fn button + F11 (lower) or F12 (raise) or F10 (mute) another quirky keyboard thing.  The laptop came with a very nice matching mouse, however it's not wireless.  I hate wires and this laptop comes with bluetooth so why not include a bluetooth mouse?  so I got the ASUS BX700 bluetooth mouse.  Not that you really need it but the user manual that comes with the computer is very generic like other reviews stipulate it probably covers all ASUS computers, nothing specific for this model.  Also, no recovery cd, it prompts you to create one when first turning it on but be prepared it takes about 3 hours+ and you need 6 blank dvd's.  Why not just include one, even if they have to charge a few bucks more.So other than these few gripes, all of which I can live with, I think BANG for BUCK you cannot find a better deal for what this laptop offers.  I would definitely recommend this computer to others.", "Date": "June 4, 2010"}, {"Title": "Awesome Gaming / Desktop Replacement Laptop", "Author": "Blake Robertson", "ReviewID": "R92PJ1BCGXIRG", "Overall": "5.0", "Content": "Heya Everyone,Just bought this laptop about a few weeks ago and so far it has been a great machine.  I am able to play all sorts of graphic intensive games (anyone a Crysis fan? :P, and use Photoshop and video editing software with ease.  The laptop has especially been perfect for me while I am on travel (love to watch movies on it while I am traveling from city to city).Not to mention the laptop definitely stays cool at all times.I was planning on buying an Alienware laptop but decided on saving my money and buying this, and I definitely have to admit that it was worth my money.", "Date": "May 14, 2010"}, {"Title": "Video Fatally Flawed", "Author": "Charleston Software Associates \"WordPress Plu...", "ReviewID": "R2LXOM0L4MF0XO", "Overall": "1.0", "Content": "At first I loved the laptop. For about a week. Then I installed a few programs and started to notice problems, especially with the video. As the problems became more prevalent I dug deeper. Forums all over the Internet started talking about \"random vertical lines\" and \"black screens\". Asus was blaming the ATI video drivers. ATI was blaming the Asus BIOS. The consumer was stuck in the middle. As the random black screens & \"video striping\" became more frequent it became obvious that neither ATI nor Asus was claiming the problem and it was not about to be resolved anytime soon.A patch came out in August. New BIOS and new video BIOS. The problem became less frequent but still was not 100% resolved. Photoshop would push the video driver & the display would tweak out. Starcraft II never worked properly, more than 50 moving graphics on the screen and the cursor became corrupted.Now today, less than 4 months after buying the laptop the screen just stopped working. It worked fine most of the day, then nothing. Now every time it boots I get a black screen. External HDMI monitor works fine, but the main screen is dead.The \"awesome Asus warranty\" that they tout? Useless. With a critical system failure they have ZERO options for advanced replacement, even though I offered to prepay. The turnaround time is \"ABOUT A WEEK\". Which, from past experience with laptop service centers really means \"ABOUT A MONTH, MAYBE TWO\".Bottom line - STAY AWAY FROM THIS PRODUCT. IT IS FATALLY FLAWED.*** Update ****Now, 2 years old, the experience with this laptop is even worse.  After Asus kept this laptop for more than 3 months in repair (they said they \"lost it\") we have been struggling with it on & off for the past 10 months.The trackpad is all but useless now.  It gets \"stuck\" in a mode that emulates clicks when the button is not clicked causing pages to zoom instead of scroll.The keyboard often gets stuck with a control or shift key being pressed.  We often have to press the shift key twice to get it unstuck.  This keyboard is kept EXTREMELY clean.  It is rarely used as we always have an external keyboard plugged in unless we are mobile or at a client site.Two of the four USB ports are now loose and often drop connections with the device.  One of the USB ports will hard power down the entire laptop if you happen to touch a USB cord to the port upside down (like that NEVER happens), essentially shorting out the laptop.On each of these issues we reported them via the \"VIP\" customer service system only to wait 4+ weeks to get a response of \"try re-installing the OS from the system recovery\" and then a \"reply for an RMA\".  Yeah, like we are going to send this in again any time soon after having not had use of it for over 4 months on the last go-around.Overall this is the worst piece of technology we have owned, and one of the highest priced in recent years.  One thing is certain, we will NEVER EVER buy an ASUS laptop ever again.  Support is a nightmare for a horribly built product.*** UPDATE ***Just got the laptop back from repair AGAIN.  Motherboard was failing & hard drive would not respond.  Screen had multiple defects.They replaced the screen & reformatted the drive with an original OS (OEM) install.  I give it a 90% chance it will fail again within 90 days.  Luckily this is now a backup system at the office.My new HP Envy 17, in stark contrast to the Asus, rocks.  Aesthetically very \"Applish\", very polished from packaging to the actual product.  Great specs. Great performance.  All around an awesome piece of technology.From now on it is HP laptops with the 3-year on-site warranty to back them up.  Better support, service, and product for LESS than the Asus equivalents.", "Date": "December 28, 2010"}, {"Title": "Good Machine for the past three years", "Author": "E.E. \"EE\"", "ReviewID": "R164Z0XPISZ2LU", "Overall": "4.0", "Content": "I've had this computer for almost three years. It has worked very well in those three years. I know that the machine is very outdated now, but if anyone is looking for a used one to save some money, I'd still recommend it. There are still quite a few refurbished ones on the market, and it's a good deal if you can find one.It is very thick due to the amount of hardware shoved in there, and the cooling fans. I am able to get it in the largest Swiss Army backpack offered, barely, since I didn't like the bag that came with it.ProsGreat Gaming GraphicsFast boot timeRuns any game on high settings, not so well on ultraReliable, I think it has only completely froze up twice since I've owned it requiring a hard boot (I use a Mac that needs a hard boot a couple of times a month)Blu Ray player is awesome. Sometimes Netflix or iTunes isn't an option if you're somewhere with poor internet service. If you remember to grab a movie or two, the drive is quite handy.ConsThe rubber feet will fall off. I've glued them on a few times, and luckily I haven't lost them for good. Nothing seems to hold them on there very wellThe \"L\" key on the keyboard isn't seated well, and it's been like that the whole time I've had it. Not a deal breaker, but it's noticeable enough to be irritatingThe speakers are pretty tinny, even with the sub on the bottom. Either use headphones, external speakers, or just deal with the tinny sounding speakersI wasn't real crazy with how the hard disk was partitioned, there were four partitions and I'd rather just deal with two, just personal preference here", "Date": "May 15, 2013"}, {"Title": "Love the laptop, but there are some issues", "Author": "Zigcarruse", "ReviewID": "RY459RDQAEM44", "Overall": "5.0", "Content": "I got this laptop a year ago. I love this laptop so much, can do pretty much anything. There are some big issues I've had with it, but I'd still give it five stars.If you aren't really tech-savoy then I would not suggest this for you.few things to know:1) because of sound driver (if using old driver) it crashes a lot, the way to fix this is to just get rid of the creative driver for the sub on the bottom, many say if you put the new ones on there it fixes it... if it doesn't just do what I did.2) try to update the vbio and the bio often. Every now and then they put out updates that help improve the functionality of the computer. I remember my computer would put out a lot of heat, well if yours does this also, try updating the bios, really helps cool the old girl down.3) I suggest (only if you have the disk hard drive and not a solid state) replacing the drive because it does cause a few blue screens every once and a while (also say go with a SSD).4) I suggest replacing the dvd drive. The ones that Asus goes with often die, and if you look at the forms this is a big issue with g73things I suggest to get:1) If you don't have an SSD get one, it decreased my boot time from 45 seconds to about 8 ^^2) Increase the amount of ram from the 6 gb to about 12 (max is 16). There are a total of 4 slots and the laptop can handle it. Very easy to do ^^Over all love this laptop, great for programming, gaming, and graphic intense programs~", "Date": "August 13, 2012"}, {"Title": "excellent with a few faults", "Author": "S.G.H", "ReviewID": "R2CQI4TE6AEH7T", "Overall": "5.0", "Content": "This is the first Asus product I've ever bought and I was so impressed I went on to purchase a router and a blu-ray burner from this awesome brand. The G73 is definitly a gaming laptop; large, heavy, ugly and prone to overheating. It is also one of the best gaming laptops out there and definitly the best money-for-value.The good:- large HD screen- very good graphic card- heating vents at the back- slightly slanted for easier typing- reasonably priced-backlit keyboard surprisingly usefulThe bad:- rubbery feet thingies fall off almost immediately- as with all gaming laptops, you have to monitor the temperature- issues with GSOD and crashing, though almost all the defected ones came from bestbuy as far as I know and I never heard anyone complaining about the ones sold by amazon. I certainly never had this problem- trackpad and buttons are the worst I ever used but comes with a mouse (as if they know how awful it is)- speakers not very strong- IMPORTANT: graphic card isn't fully compatible with newer ati drivers. the last official update from asus was in 2010 and unless you don't mind your drivers being outdated, you will have to do a lot of experimenting with different drivers/OC/vbios,etc for the graphic card to be stable and every card is different so you will have to find the combo that works for youRecommended with it:- a good cooling pad with a fan in the center (the center heats up the most)- a plastic keyboard protector, you can find ones specifically made for the g73 in ebay. cheap and very very usefulBottom", "Date": "June 29, 2011"}, {"Title": "Powerful laptop, but a few cautions", "Author": "D. Bute \"Dave\"", "ReviewID": "R3E9R4T5UUU08E", "Overall": "3.0", "Content": "I had this laptop for about 8 months and thoroughly enjoyed how powerful it was.  No game I threw at it was an issue.I'd just like to caution buyers on a few points:The ATI drivers for this model are not well-supported.  You WILL run into driver problems.  I ended up keeping two sets of drivers handy since one set completely wouldn't work with OpenGL.Heat can be an issue.  You may want to prop the machine up.  Also make sure there is at least a foot or so behind the rear of the laptop for the vents.  Even with these precautions I ended up having the laptop overheat a few times during the warmer months.The screen is decent, but there are much better out there.  I felt that the quality was mediocre at best.This is a VERY heavy and cumbersome laptop.  I knew that going into it, but be warned.  You will use this as a desktop replacement with the bonus of being somewhat portable for LAN events.  It is a very non-portable laptop.All in all I give it 3/5, but only because the price is right.", "Date": "June 23, 2011"}, {"Title": "SWEET!!!", "Author": "Philrn \"bookworm\"", "ReviewID": "RJLSMA1NHO8KA", "Overall": "5.0", "Content": "This Laptop flies. Hasn't shut down yet and I don't always use the separate bottom fan that I got extra for it. This is running secial ops and email and internet at the same time. Great product!!", "Date": "February 6, 2011"}, {"Title": "The keyboard is awful !!", "Author": "Keith G. Collingwood \"WoodyBear\"", "ReviewID": "RN5KNWZDGPAVP", "Overall": "3.0", "Content": "Although the other reviewers have mentioned the keyboard issue, I do not think any of them have done justice to how bad the keyboard is on this computer.  The touch pad area is so static sensitive that I am constantly having to Ctrl-Z in order to reverse edit all kinds of bizarre stuff that happens to whatever text I am writing.  You almost have to use an external keyboard with this machine.  If it were not for Ctrl-Z, I would have returned the machine a long time ago.  This machine was obviously not beta tested enough.Granted, any machine with a touch pad has problems in this area.  But this machine has a huge touch pad approximately 2.5\"x4.5\" big and is by far the worst one I have ever dealt with.  You might think having a huge touch pad is a good thing until you have one.  Believe me it is a liability, not an asset. You only have to get a fraction of an inch above it to activate it.  You don't actually have to touch it.  And when you do accidentally touch it, the format changes in MS Word, for example, can be really bizarre and extremely annoying.It would not be so bad if you could adjust the touch pad sensitivity.  Toshiba machines, for example, allow you to adjust the sensitivity.  But no such parameter exists on this machine.  Believe me, I have looked for it.  Ideally I would like to be able to shut off the touch pad altogether, but the hardware management on this machine does not allow it.My recommedation is that if you are planning to get this machine, plan on getting an external keyboard with it.  ...And learn how to use Ctrl-Z.  Other than the keyboard issue, it is really a good machine.  It is fast and responsive.  The screen is excellent.  I have used it with an external monitor and am happy with the result.  The resolution on the external monitor is not as high as I would like it to be, but I am not sure if it is the graphics card in the computer or the monitor itself that has limitations.If you are looking for a laptop with portability, I do not recommend this machine.  It is large and bulky.  Although it is light for it's size, it is still a big machine.  And when you hull this machine around, you have no choice but to use the awful keyboard.  Carrying around an external keyboard just isn't practical.  So if a low price point is important to you and you can live with the impracticality of the keyboard and awkward portability, then you might consider this machine.  Otherwise, I would say look somewhere else.Added later:  I finally realized you can overcome a lot of the keyboard problems by putting the power supply (or some other similar sized object) under the back edge of the computer so as to jack up the back of the computer and tilt the plane of the keyboard.  It makes a huge difference.  The heels of your thumbs are much less likely to trigger the touch pad.", "Date": "October 28, 2010"}, {"Title": "ASUS Roc G73JH", "Author": "DB Robinson", "ReviewID": "R21Q0OLVCWS9T1", "Overall": "4.0", "Content": "This laptop rocks.  It is the fastest, quietest, coolest laptop imaginable.  Was shipped and delivered in 3 days (for free).  The 1080p display is visually beautiful and a perfect compliment to gaming.  Great sound system.  I have tested this machine with the KillWatt device and at idle the system uses about 30+ watts.  Playing games does cause a higher watt drain, but for mobility using basic web surfing or music, don't worry about this device eating your battery quicker than 6+ hours.  Power management is fantastic throughout.  The ASUS Windows 7 quick boot bring the device up in seconds, way faster than Windows XP, etc.  The dual 500 7200 rpm storage is very nice.  Plenty of room for everything.  I would say the only minus is the keyboard.  The 10 pad keys are too narrow?  This is no big deal but with all the room available, having a compressed 10 keypad is an insult.  Also, would have been nice to see the new USB 3.0 onboard.  My only plan for upgrade is the Intel x25 solid state drive.  As is, the G73JH is all fun and no looking back.", "Date": "September 26, 2010"}, {"Title": "The Best Value in Gaming Laptops", "Author": "Helix", "ReviewID": "RQ6NBJ4J86CW4", "Overall": "5.0", "Content": "This laptop is, perhaps, the best money I have spent in a while. 8 GB of RAM, 1 GB Video Card, DVD/Blue Ray, Bluetooth, Backlit keyboard, and a 3 year warrenty. It is also one of the cheapest Intel I7s on the Market. This runs every game I play (most of which have come out in the last 2 years) at highest resolution with no problem at all. I would advise anyone to get this.My only negative comment is all the extra stuff that comes preinstalled on your computer. This, however, did not stop me from giving it a 5 star rating, as it only takes a minute or two to uninstall it all. I would recomend this to anyone.", "Date": "September 12, 2010"}, {"Title": "Best gaming laptop/desktop replacement hands down", "Author": "Glacier Stone", "ReviewID": "R3EA3N3MEL4XTN", "Overall": "5.0", "Content": "I purchased this as a desktop replacement to replace my dead desktop.  The fit and finish is great, and the performance rocks.  Plays everything I play on close to max settings at 40-60 FPS.  The island keyboard takes some getting used to, but being backlit is a definite plus.  The only downside I've seen to this notebook so far is the power connector which plugs into the right side of the notebook, which if your like me and never use the trackpad can sometimes get in the way while gaming using an external usb mouse.  A 90 degree connector for the power cord would had been better, but that is a small negative for what you get in this notebook.", "Date": "September 11, 2010"}, {"Title": "PEFRECT", "Author": "semi-geek", "ReviewID": "R1DWR5PVYG1JBO", "Overall": "5.0", "Content": "I bought this on Wed, it was at my door at 2 on Thurs. I have to say that I was shocked when I opened the box, which arrived unscathed from UPS. This thing is HUGE!, but that is what I wanted. Out of the box it is running like a champ... after about3 hours of reloading all my games and music, I can say that this laptop is a beast, it ran CODMW2 at full everything with no problems, and sounds amazing! As others have said, the mouse clicker is stiff, and the number pad and arrows take a little getting used to. This laptop defines \"bang for your buck.\" My hat is of to ASUS for such a quality machine...", "Date": "August 26, 2010"}, {"Title": "The Best of the Best", "Author": "Buzz", "ReviewID": "R3HV2N6AYPNR75", "Overall": "5.0", "Content": "The Asus G73JH-A1 is the best value you can find.  The G73 is simply a dream laptop; it has insane performance times infinity.  I've tested it on games like Anno 1404 and Aliens vs Predator.  The graphics are a quantum leap above the previous systems! No slowdowns, no choppiness, just smooth super high-end performance.  The quality of the screen that comes with the G73 is incredible, you'd have to see it to believe it.  The 1650$ G73 is equivalent to a $3000 Alienware computer.  Unless you have 1400$ free dollars to give to Michal Dell for Brand recognition, you should save your money and buy an Asus G73. The G73 is the most insane machine you'll ever see.", "Date": "July 24, 2010"}, {"Title": "Great Machine", "Author": "LIFlyer", "ReviewID": "R150UDE2EGP065", "Overall": "5.0", "Content": "I have had the ASUS G73JH-A1 for two months and love it. I have seen people saying that certain games will not run on it but those same games run like a champ at the highest settings for me. This includes CounterStrike Source and Mass Effect 2. All of my normal business applications blaze on it too. When I was evaluating a new laptop I wanted to get a larger monitor. Those who say it is large are correct. That is a plus for me. The Intel I7 chip and video adaptor are power hungry so the battery is not going to last too long before needing a charge. This was also expected. It's keyboard has a number pad which I love. The only issue there that bothers me is that when Num Lock is engaged, you cannot use the Delete Key. Seems to my like ASUS really did not think that one through. The fans run quietly and speed up when needed but are never loud. The screen and sound is great too. About a week ago I upgraded to the 209 bios. There are no problems with it so far. Three USB ports work fine for me since so much is built in. The HDMI port also works great. Would I buy it again or suggest others do - YUP!", "Date": "July 22, 2010"}, {"Title": "Exactly as advertised and reviewed", "Author": "dsranger", "ReviewID": "R3URGJRUPY31EG", "Overall": "4.0", "Content": "I say \"exactly as advertised and reviewed\" for several reasons.The laptop is extremely fast and quiet.  The backlit keyboard is excellent and I don't understand why some the previous reviewers said the keyboard was not up to par.  You can clearly see that the keys are raised to provide ventilation for the unit.  One big problem that I had right away with my laptop was the automatic windows update.  It slowed the damn thing down to the point where I had to undo the updates and block future Windows updates.  Not a problem since.  Love the built in microphone.  Left 4 dead 2 runs like lightning.  I will be installing Office 2010 soon so I will let you know if that has any problems.  Overall, so far, the past 2 weeks has been a great experience and if all goes well, my next desktop will be looking at ASUS also.  I took out some of the bloatware like everyone should.  I would never use that stuff anyway.  I did not update the Bios but will monitor the speed on battery power like another reviewer mentioned.  Amazon made me wait about 2 weeks after saying they were in stock before actually shipping it out.  Asus G73jh A2 is a very nice piece of hardware.UPDATE:Well, it has been 1 year since my purchase and the laptop is still going strong.  Exceptional on the gaming and graphics.  Very quiet.  An absolute workhorse.  I will definitely purchase another ASUS when my other computers finally are past their usefullness.", "Date": "July 20, 2010"}, {"Title": "Outstanding quality and amazing value", "Author": "William Bolton", "ReviewID": "R2JG46XR62HF0L", "Overall": "5.0", "Content": "(I have the A1 version of the G73jh.) I don't want to repeat what others have reported about this laptop but only say that this is the second ASUS laptop I've bought  (the other I've used for two years), and it seems evident to me that the company has two guiding principles, to provide outstanding quality and amazing value. Theirs is old-fashioned marketing, marketing that doesn't rely on slick advertising but believes that if you offer a superior product at a good price, you will gain market share. I, for one, am happy to help them make this case. Thank you, ASUS, for valuing the customer.", "Date": "July 8, 2010"}, {"Title": "One of the best \"bang for the buck\" laptops in the market.", "Author": "himuradrew", "ReviewID": "R3GC2ZC4CSJVSM", "Overall": "5.0", "Content": "When the graphics card in my 2 year old XPS M1710 had conked out, I obviously found myself in need of a replacement machine ASAP.I was actually deciding between the following systems:- Toshiba's Qosmio X505-Q887 (priced at only $1499 and coming with a Blu-ray drive seemed like a tempting offer)- Alienware's M11x (it had the look factor and it was \"the most powerful 11-inch notebook\")- ASUS G73JH-A2 (much more expensive in price than the other 2 models)Toshiba's machine, while coming with a Blu-ray drive was equipped only with a GTS 360M, which I thought might not be enough for gaming at high resolutions. Also it didn't have a full 1080p capable display which I thought was disappointing. On the other hand, the M11x was a bit too expensive for what you're getting. I mean, a 1.2GHz Core 2 Duo was pretty underpowered for my tastes - I had a 2.0GHz C2D in my old XPS. Sure, they eventually offered the Intel Core i-series of processors in the prodcut refresh, but I'd have to wait till July before Dell would start shipping and I needed a laptop fast.That's when I decided to just order the ASUS G73JH. I researched everything before hand - read reviews, checked feedback on message boards, I did my homework before going through with my purchase. And when I finally took delivery of the notebook, I knew I made the right choice.Let's see what you're getting. My particular model, the G73JH-A2 came with the following specs (taken from Amazon's product page):1.6GHz Intel i7-720QM8GB DDR3 RAM1TB (500GB 7200RPM x2) HDDSuper-Multi DVD Drive (the A1 model comes with a Blu-ray drive)802.11 b/g/n wireless adapter17.3-Inch Full HD LED DisplayATI 5870 Graphics with 1G GDDR52 Megapixel WebcamWindows Home Premium 64-bitVGA port x 1, HDMI x 1, USB 2.0 ports x 4 (no 3.0), Card ReaderFirst the cons. While the track pad isn't as bad as some reviews make it to be, the button itself is very stiff. It shouldn't really be a problem as most gamers will be using a mouse (and ASUS bundles one along with a Targus backpack), but it can still be an issue.Another is ASUS's inclusion of a Turbo Boost button - in some cases, it's been known to reduce performance. It seems like ASUS's overclock interferes with Intel's Turbo Boost technology. My advice? Just leave it alone.And what's up with all the bloatware? When Windows 7 started up, I counted almost 20 useless processes running at startup. I ended up getting rid of almost all of them. Some users have also reported lock ups with the bundled Creative software - which also launches at startup by default.With that out of the way, it's time to dive in to what makes this laptop a wise purchase.First off, the back-lit LED screen is beautiful. It's real bright (maybe a bit too bright) and has some good viewing angles. I tried watching some 1080P hi-def movies on this thing and they looked gorgeous with crisp colors and clear images. The inclusion of a full keyboard is pretty nice and keys are situated in good positions. Also for those interested in the looks department, the G73JH actually fares quite well. While it's Stealth Fighter-inspired design won't call attention like an Alienware laptop would, it still looks pretty good. My brother-in-law actually said it look like a big, black tank ready to crush other laptops.With regards to heat and cooling, ASUS put 2 large vents at the back to expel hot air. It works pretty well as far as I can see - the surface of the laptop is pretty cool to the touch even after 2 hours of gaming - with the exception of the right hand side of the keyboard getting warm, but not uncomfortably so. Touching the back though is pretty hot, as that's where the hot air flows out from.Now, most people looking to buying this laptop will have one primary question - how does it do playing games? I'd have to say it pretty much passes with flying colors. Thanks to the pairing of a Core i7 and the HD5870, most current games will run on this thing at 1920x1080 with all or most settings cranked up (the exception being Crysis - which still eats most desktop systems for breakfast). I tested it in 3 games: Batman: Arkham Asylum, Battlefield Bad Company 2 and Modern Warfare 2 - all at 1920x1080.Batman and Modern Warfare 2 ran beautifully with all settings cranked up plus, 2xAA and 8xAF. Bad Company 2 suffered from some minor stuttering here and there with all settings cranked up (except shadows which were at medium). Turning off AA helped smoothen out the framerate, but at 1080P, jaggies are less of an issue so I feel comfortable turning off AA when I need the extra performance boost. This machine will pretty much handle any game you throw at it at high resolutions. Oh, it's pretty fast in Windows apps too.Bottom line I'm extremely happy with my purchase and I won't hesitate to recommend the G73JH to any one looking to buy a gaming laptop that has very good performance but won't break the bank. Sure, there are other faster, more powerful gaming laptops out there, but in my opinion, ASUS justs nails it with a solid combination of great specs and a reasonable price.", "Date": "July 7, 2010"}, {"Title": "Excellent Laptop!!!", "Author": "Michael Reinders", "ReviewID": "R2B27WKQYZHVXB", "Overall": "5.0", "Content": "I received mine last Friday, so I've only logged about 10 hours with the system, but man, is it fast!  I spent about 10 minutes playing with it before pulling out my USB stick, and wiping the system, and putting on Windows 7 Enterprise 64-bit.  That took about 12 minutes!I love the chassis, no fingerprints, the specs are awesome!  It showed as 1066Mhz ram, but it shipped with 8GB of 1333Mhz ram.  My Windows 7 experience score is 5.9, only because of the hard drive.  The CPU is 7.1, the RAM is 7.4 I believe, and the two graphic scores are about 7.3 to 7.5!I don't know what else to say at this point, just that the bang for the buck on this system is incredible.  Asus makes a decent number of parts in the system like the motherboard, so they don't have to pay too many other OEMs for the parts inside.  Plus, I haven't installed any games yet, but the ATI HD 5870 should be awesome!Wow, all I can say is, HIGHLY RECOMMENDED!", "Date": "June 28, 2010"}, {"Title": "great computer", "Author": "Nate", "ReviewID": "R3KXRZLX3U5891", "Overall": "5.0", "Content": "ASUS Republic of Gamers G73JH-A1 17-Inch Gaming Laptop (Black)I purchased This laptop a little over a month ago.  I wanted to test it a bit before I wrote a review, due to some of the problems I have read about.  I am going to school in visual technologies and wanted a desktop replacement that I could use for school work and also video editing.  I don't care much about battery life, because my old laptop had a bad battery, and rather than pay for new battery I just saved for a new computer.This machine is a beast, and has handled everything I have been able to throw at it. It edits and renders video flawlessly, and doesn't even shudder when creating and rendering 3d objects and scenes. Given this it's no wonder it eats through battery life.  I have had the battery last one hour and fifty minutes while in battery save mode while listening to music.  It is a sturdy machine with a beautiful display full 1080p and is plug and play with my LCD television. It will send sound and video through the HDMI cable. The first time you use the blue-ray player you will need to have an internet connection in order to update the player software and activate the blue-ray features. I have tried several games on the system and it ran every one with no problems on ultra high settings. I ran Mass Effect 2 for 6 hours with no problems on ultra high. I did notice a lockup issue, It may have to do with the wireless network card.  I was using Firefox over the network and it froze solid, and I had to use the power button, it has done that a few times, it locked up while gaming also. I did notice that it no longer locked up while gaming if I disabled the wireless card using the function keys. All of the lockups happened in week 2 and 3; there have been no lockups in week four at all. The pros by far out weigh the cons. this machine is twice the machine my desktop is and cost less.  I also have it set up to duel boot with Ubuntu. I have had no issues with that. I have not had time to install or try the web cam under Linux, due to not having a huge need for that yet.I would recommend this computer to anyone looking or a desktop replacement. The backpack and mouse was a nice bonus along with the 1 year accidental damage warranty and standard 2 year warranty from Asus.", "Date": "June 13, 2010"}, {"Title": "Desktop Replacement Laptop", "Author": "L. Flaman", "ReviewID": "R3H0WIVC58BNHC", "Overall": "5.0", "Content": "If you need the powerhouse of a gaming desktop in a portable package, look no further than the Asus G73JH. While the clock speed may seem sort of low at 1.6Ghz, it automatically boosts itself when it needs to (computer wizardry!) so it is by no means slow. Several comparisons between this laptop and other more expensive models have demolished benchmarks at a fraction of the price. While people are more familiar with Alienware, Falcon Northwest and others for gaming laptops, Asus may still be a relative newcomer, but they have been making computer components for manufacturers and have just decided to start making their own end products, so you know you're getting a good quality laptop at a decent price (when unscrupulous Amazon Marketplace sellers aren't horrendously marking up prices when demand is high).As for the laptop itself, it is pretty quiet, and it does get pretty warm even with the exhaust vents on the back (cooler than my old Dell Inspiron 1720 with the vents on the bottom) but that's what a laptop cooling pad is for (I recommend Antec). It has run every game I've thrown at it at high to mid-range graphics settings, and the HDMI output makes plugging into my tv a breeze, no more messing around with vga cables and adapters or whatever.", "Date": "June 13, 2010"}, {"Title": "One word: Beastly", "Author": "Kilgore Trout", "ReviewID": "R2X53ZZVIEFXTQ", "Overall": "5.0", "Content": "I am not a gamer, but I am a developer.  By far this is the most loaded laptop I have owned.  So far, it has delivered everything I need from it.  I use high memory consuming development programs, and they all run extremely fast.  Also, the graphics and screen look so crisp and clear... and I haven't noticed any hiccups yet, even when running several intensive programs.  Love it.", "Date": "April 30, 2010"}, {"Title": "Great Laptop But ASUS RMA is VERY SLOW", "Author": "Brian Outhwaite", "ReviewID": "R3C3K0SGJ68CT9", "Overall": "2.0", "Content": "I was loving this laptop before I attempted to update the bios. I downloaded the correct bios off the ASUS website updated it from the EasyFLASH utility and the laptop never powered on again. Asus received my laptop on 4/23/2010 and it is now 5/14/2010. They are saying that they are waiting on a part. They will not give me an ETA or anything. As I stated above this laptop is amazing but you better not have to send it in for repair or you might be out a laptop indefinitely. As a computer tech this is the worst RMA I have ever experienced. They tried to state that it was my fault for trying to update the bios and it should never be done. In reality they posted a bad bios on the website and I was forced to deal with their terrible RMA service..  Definitely will think twice about buying ASUS in the future, I hope this review helps. I will update this review when I finally get my laptop back...", "Date": "May 14, 2010"}, {"Title": "Why is the price higher on Amazon?", "Author": "Teacher2 \"Teacher2\"", "ReviewID": "R1JA5BBCZAIWO4", "Overall": "5.0", "Content": "I've always found Amazon to have the lowest prices due to its buying power. And yet, when I looked around on the internet for the G73JH-A1 I found it for about $300 less in a few places.  What's with that?", "Date": "April 20, 2010"}, {"Title": "No good company!", "Author": "Matthew A. Baer \"Matthew B\"", "ReviewID": "R36DE14HYN3CXW", "Overall": "1.0", "Content": "I will keep this short because I've used enough of my time over this computer and this company already.Where do I begin, oh yeah, their customer support is all over seas and I can almost never understand the guy/gal on the other end of the phone. I'm sick of it! Why can't they just employ English speakers with a native tongue (throws hands in the air). Then, it wouldn't be uncommon to sit on the phone for 10 to 15 minutes just to have the phone disconnect and it wasn't my phone ;(  Ultimately I am unhappy becasue of their customer service but, here are some of the reasons I needed to call them:First the fan on my computer broke three different times leaving the computer hot and over heating almost whenever I would spend more than a hour on the computer. The first time was day one out of the box. the 2nd time was maybe two months after having the first time fixed. The third time I just went out and bought fans for the stupid thing because calling their customer service was killing me!The screen had these bogus lines running through the computer and Asus wouldn't do anything about it until I made such a big stink about it!Next, the AC power cable stoped working ;(The hard drive crashed after the last time I recieved my computer back from mailing it out to Asus for repair. In otherwords DOA (dead on arrivel). And at one time the battery stopped taking a charge. I can't recall if that was before or after the AC cord but never the less I am sick of this computer. All this took place in the first year of me owning this computer. I have been gaming on laptops for many years now and I was so excited when I purchased this from Iraq but that feeling faded quickly. I ended up giving my (waste of a) computer away to some family. There's to many good systems out there but this just isn't one of them at all! If I were you I would stay away...", "Date": "July 26, 2011"}, {"Title": "faulty gpu", "Author": "Adam", "ReviewID": "R1Q9T1JVRNT9PQ", "Overall": "1.0", "Content": "Just so others know it's happened, there are faulty products out there. asus released a bad batch of gpu laptops and never recalled them. about 1 in 7 won't work. and after 10 mins give you a random color screen of death. If you're looking into buying this, look around first and do some research. 1700 for a risk of a faulty computer, so not worth it. Save yourself a headache.Amazon however was great. They had no issue with giving us our full refund including the shipping. This is solely based on the item and not the parties involved.", "Date": "November 8, 2010"}, {"Title": "Has Problems which will cause frustration", "Author": "CD066 \"Cd066\"", "ReviewID": "R1DHM7LKGZD9ZP", "Overall": "3.0", "Content": "I am editing this review for the following reasonsAfter about 10 days of use I started to get a large number of crashes related directly to the following software:Creative EAX / Audigy / Creative HD Sound suite - this is included with the computer.ATI Catalyst 10.6BIOS 205This was very frustrating because the computer would not operate for more than 5 or 10 minutes without the screen locking up, or what was most likely to happen; the screen became a crazed rainbow of various colors which are indicative of a problem of some type (slight understatement).I contacted ASUS tech support via an online help request.  If you have never dealt with ASUS tech support before I will forewarn you that it is pretty much non-existent.  If you are expecting some snappy responses to what you may feel are serious (in your mind) problems you will be sadly mistaken.  ASUS is really good at making products which are high performance and for the most part need little in the way of tech support, so as you American's might be misled to believe that because they make such good products there should be great tech support - this is absolutely not the case.After a couple of days I received a response from ASUS tech support - I was instructed to remove all the Creative Sound Suite software (that means all of it including drivers); remove ATI Catalyst 10.6 along with all display drivers from ATI, and revert back to the ATI Catalyst 9.12 Win7 64bit edition.  Following install of 9.12 Catalyst I was to then install VGA drivers from G73JH download page from ASUS notebook support.I performed all these actions as requested by ASUS tech support and have had a perfectly sound and stable computer since.  I am not certain of the exact nature of the problem.  The speculation I have encountered ranges from over voltage to the ATI 5870 Card to flawed software drivers in the sound card which induce an over-voltage - who knows for sure.  If these steps did not correct the problem and I continued to receive GSOD or random lockups ASUS was prepared to offer me RMA with replacement.I still rate the computer highly as I do have a perfectly operating machine....now....but I can see that someone who only purchased this ASUS G73JH because it looked like one of the best out could be easily fooled.  I would offer this as a word of caution to anyone looking to purchase a high performance laptop or computer of any type:1. Do your research2. Know what kinds of problems the unit is having and if they are able to be overcome3. Have the skill necessary to address the problems that `will' crop up4. Have patienceFYI - I find the keyboard a little unresponsive at times this is due to several possibilities -1. Synaptics Mouse Pad driver is suspected of being flawed and conflicts with the keyboard drivers somehow.  I have read on several sites that removal of the mousepad drivers and reverting to the use of the Win7 drivers is key to fixing this problem.2. Possibility of tarnished / corroded connector pins under the keyboard due to poor construction techniques or a bad batch of keyboards from the Hyu Yuan subcontractor.  Keyboard must be removed and using Tricloroethnal (Tri-C) clean off the connectors pin surface on both male and female portions of keybord ribbon connector.- The mouse included with the computer is great - use that.- There is a ton of bloatware on this computer mostly crap like trial edition this and that.  Just get rid of it and you will free up quite a bit of space.I strongly reccomend the use of a good laptop cooler of some kind; Zalman makes a great one and so does Targus.", "Date": "June 25, 2010"}, {"Title": "Great Laptop", "Author": "Did well", "ReviewID": "R2OQ7PS6PIOWBC", "Overall": "4.0", "Content": "Overall it's an amazing laptop, and the screen is incredible.  Would give it five stars except for the lack of USB 3.0", "Date": "June 10, 2010"}, {"Title": "Another 5 Star On The Wall", "Author": "Glasairmell", "ReviewID": "RY86KR477HV96", "Overall": "5.0", "Content": "Update: Power Supply failed after a month of use.  Asus says there are none in stock and we have to wait. Choice is buy an after market for $60.00 or store the laptop till the RMA power supply eventually arrives.Fantastic G73JH-A1 17-Inch Laptop.  Looks like a piece of stealth fighter equipment.  Made sure it was shipped directly from Amazon.My son did a complete format and reinstall of W7 Utimate on 100 gig partition and partitioned the rest to his tastes with a 20gig swap file partition on the second hard drive. Only reinstalled the drivers and programs he wanted.  It runs flawlessly with all his high FPS games. It has replaced his older desktop gamer.We left the Bios alone. If it is working right, we do not update Bios.  Better is the enemy of good.BTW if you want to do a back up, just use Acronis for a complete backup and restore.  You can toss the backup on the second hard drive and skip the hassle of disks.  We do not load up the Windows partition with data and it makes for a quick restore if ever needed.Right now the laptop is hooked HDMI to his Asus 26 inch monitor (another great Asus product) and displays beautiful with 2 ms and the 5870 cranking. As others have said, you can not beat the bang for the buck of this laptop.It is quiet and runs cool.  Running the top end games I suggested he keep the lid open (monitor off) for better cooling just to make sure (read another review) however I am not convinced that is necessary.  Otherwise the lid remains closed and all I hear in there is his fish tank.If he travels or goes away to college, he has all the comforts of a powerful DX 11 game computer, all his games and stuff for the road. Best of both worlds.Cons: Only one and no big deal, we do not like the blue ray disk drive tray LOL as others have pointed out. Would have been much cooler to just have a slot like the Macs instead of that silly tray popping out.Other Thoughts: Guess I will have to get one for myself when Amazon gets them back in.", "Date": "July 18, 2010"}, {"Title": "Video died on me in ANY 3D game I ran on it...", "Author": "Brian S Swiger", "ReviewID": "RSJOX1S4EDG7V", "Overall": "1.0", "Content": "Received the product and installed several popular games (World of Warcraft, StarCraft 2, Crysis, Unreal Tournament 3, etc.) and the games would run for 5 minutes, then vertical gray bars would show up and the video would be stuck.  Games would lock up frequently, etc.  I'm a seasoned gamer with several systems that I've built myself, so I ran the latest ATI drivers, patched the system, etc. and the system would still not be stable as expected.  I promptly returned it to Amazon.  I was aware of the stability with researching (yet thought it was a great deal for the components versus price), yet had to test it for myself...and it is true.  This laptop is not stable and does not hold up.", "Date": "August 25, 2010"}, {"Title": "Best thing I ever purchased.", "Author": "Rafal A.", "ReviewID": "RZ3WUQG85TJV8", "Overall": "5.0", "Content": "It's best thing I ever purchased. I have this RoG for 3 years and there is nothing better to play a surf in the Internet, Big HD screen is invaluable for different kind of games. That was good choice and I recommend this RoG for everyone.", "Date": "July 29, 2013"}, {"Title": "Worst warranty service ever, but its a Great laptop.....when it works", "Author": "Matt", "ReviewID": "RQN7RF4US1LQM", "Overall": "1.0", "Content": "I've owned the laptop for a year now and I will be sending it in for the second time with the same issue. Overheating. Even when I use the 17\" laptop cooler the laptop will overheat. The first time I spoke with Asus  I told them that I was seeing artifacts then it would shut off and I would smell burning hardware. What did they do? Flash the bios and sent it back, didnt bother to replace anything that was damged from their shoddy product. Only good thing about this laptop is the specs, when it works I can play deus ex human revolution at 1080p high settings. This will be my last Asus product since the two Asus products I've owned (a motherboard a few years ago) have given me major problems", "Date": "September 11, 2011"}, {"Title": "Very nice specs, but the design needs to be improved.", "Author": "Eduardo Castellanos \"wayo\"", "ReviewID": "R1QMC2QG4E6M97", "Overall": "3.0", "Content": "I have read most of the other reviews and so far the biggest problem I've found is that the computer overheats.After owning this laptop for about 9 months I can personally say that the two major drawbacks are the following:1. It is very easy for the fan vents to become obstructed by dust/lint, and very hard to clean. This caused my laptop to overheat and shut down whenever I tried to play any game. In order to clean the vents you have to remove the processor's and video card's heatsink. This is a major problem as you would also need to re-apply the thermal paste...2. It is very hard to open the computer and clean it, and it is very probable that you are going to break the keyboard because it's held in place by double sided tape. There's a video in [..] that describes how to disassemble the laptop.", "Date": "December 22, 2010"}, {"Title": "\"The Beast\"", "Author": "Greg Harness", "ReviewID": "R2ODBAUCOS8FFD", "Overall": "5.0", "Content": "Ye gads !  A Beast !!!  Plays multiple screens effortlessly, never gets hot. Love the facial recognition too. This bad boy will last me many years !", "Date": "September 25, 2010"}, {"Title": "THE BEST", "Author": "Calie", "ReviewID": "R30SAX5TNFXNBU", "Overall": "5.0", "Content": "I love this computer!!!!!!!  Its the best Gaming Laptop that I ever owned. I would highly recommend this computer to anybody who is thinking of buying it.  It is well worth the money!!!!!!!", "Date": "July 29, 2010"}, {"Title": "This is the TOTAL GAMING PACKAGE!! AWESOME", "Author": "Erfan223", "ReviewID": "R1YO8B96VO85IC", "Overall": "5.0", "Content": "I was about to build my own gaming desktop for around 2300. My freind told me  about this gaming laptop and how it'd be a better investment. I goto high school so this is a perfect use of my money for a high performance laptop. I have this A1 vesion and it is loaded with good stuff.Pros: Processor is Intel 720Q at 1.6GhzAMazing graphicsHD audioBlurayTwo hddsBIG sCREENnice big touchpadeasy to type keyboardASUS ROG GAMING MOUSEWEBCAM is okay not badCONS: Battery drains in about 2 hours. This isnt a problem for me because ill ha it plugged in most of the timebut for those who are on the go be cautios of this.SHIPPING was okay, I paid $50 for 2 day shipping and got it. THE UPS GUY DELIVERED IT TO MY NEYBORs house by accident and they werent home, so I had to chase his ass down with my car until he stopped and tell him he had missed my delivery. (To the right home at least).  These UPS guys need to be careful and not such bums.  Other than that everything seems good.", "Date": "July 28, 2010"}, {"Title": "Good but Screen Died after 1 month", "Author": "Joe", "ReviewID": "REYSIKQ7JXI8K", "Overall": "4.0", "Content": "Pros:Redonkulous speed.Very StylishGood WarrantyThe touch-pad/keyboard/mouse are awesome and take very little getting used to.HDMI out is plug and play; plus there's a hotkey to display: only hdmi out, only screen, or both. Pretty handy. 1080p looks gorgeous.Windows 7 is pretty slick. Connecting to a wireless network/printer was very easy even for someone who's only done it once before.I really like the illuminated keys.Plenty of hard-drive.Very large screen, but the computer is overall thinner than I had imagined.A well put together computer physically speaking. (No wiggles, squeaks, etc.)Damn-near silent.The backpack is pretty nice, lots of padding and decently stylish.Cons:I had the cyberlink powerdvd software die the first couple of times I tried to use it. With a fresh install it plays blu-ray discs smooth.Lots of bloatware. I had to remove like 12 or 13 garbage programs.No microsoft office.This thing is a power-hog. The battery lasts maybe ~1 hour with average (non-gaming, non-movie, etc.) use. I'm assuming considerably less if you're gaming.There's no flash-player for the 64bit internet explorer (I'm sure there's some better option out there, I haven't done much research yet)The rubber feet underneath come off if you (even gently) tried to slide the laptop.UPDATE: After a month of minor usage the screen died. 1/2 of the screen is white and scrolling lines while the other half is simply distorted colors. The repair process was a nightmare, it took 6 calls(each spending about 1/2 hour on hold) and overall almost a month from the time I shipped it to the time I got it back. I'm glad that there aren't more bad reviews for this comp... hopefully it was just a fluke and not a common problem.In the end I would probably buy this computer again. A faulty screen can happen on any computer, just had some bad luck, but I guess that's why they come with warranties.", "Date": "July 25, 2010"}, {"Title": "Spectacular", "Author": "Albert Churba \"Enthusiast\"", "ReviewID": "R3LBPIHPQV60IW", "Overall": "5.0", "Content": "The notebook is fantastic. Just be aware that it is a large screen and finding a case is difficult but Asus does include a backpack. The feature set of this notebook rivals most desktop systems. I liked it so much that a second unit was purchased for a colleague. The dual HDD's are awesome. The notebook is used to house virtual machines so the memory capacity was needed. The machine is not being used for gaming but I can say the dedicated graphics card is quick and the high def output works well. The bloatware was not a concern as the unit was reinstalled with retail Win 7 x64 Ultimate. The only con is that the BIOS does not have the necessary hooks to support Bit Locker so a software solution is required. If you need the horsepower that this system supplies (as I do) this is a great value for the performance offered.", "Date": "June 14, 2010"}, {"Title": "FANTASTIC Computer", "Author": "Struan \"Noble House\"", "ReviewID": "RTM6RZT0OHOQ7", "Overall": "5.0", "Content": "Performs even better than touted.  This is the best computer I have owned yet!!!Great job ASUS!", "Date": "June 9, 2010"}, {"Title": "Video driver support is terrible.", "Author": "Michael  Burton", "ReviewID": "R3DYZMIXBF5TU5", "Overall": "1.0", "Content": "I was very excited to get this laptop.  Everything worked great, for about two months.  I installed all my old games they played perfectly.  It had enough space to keep all my games, a whole bunch of media, and use Windows to backup to another drive.Then I bought new video games.  New video games require new video drivers.  This laptop WILL NOT allow you to update the video drivers.  As soon as you do the laptop will GSOD with verticle lines on the screen.  This happens in video games or if I even just turn it on and do nothing with it.  Its terrible that ASUS cannot support the manufactuers (ATI) drivers, but they don't.  You are stuck with the 01/2010 drivers that ASUS gave you with the laptop.  New video games will not play with these drivers.  I can't even get FF14 to load.Also if you call ASUS to complain about this their recommended solution is to uninstall manufactuer drivers and go back to the 01/2010 drivers.[...]", "Date": "October 3, 2010"}, {"Title": "Powerful Rig", "Author": "Bodisatva", "ReviewID": "R24GPR1X7LTZU3", "Overall": "5.0", "Content": "I've been a build-my-own tower computer guy since 2000, but this laptop changed all that.Great power, graphics, port options and price made this a no brainer for me when it came time to retire my old rig.", "Date": "July 19, 2010"}, {"Title": "Godly", "Author": "Salvatore J. Occhiogrosso", "ReviewID": "RC9WMLI1ZAZA3", "Overall": "5.0", "Content": "This is the laptop that God made and bestowed the idea to asus! It runs games like a dream, internet connection very little problems, and it is an amazing machine. Im glad I waited for this to come out instead of getting another comp, patience paid off. This runs movies and vids beautifully. but need to find out how to get blu-ray to work. This ,machine is worth getting!!", "Date": "May 25, 2010"}, {"Title": "Great Laptop for the specs", "Author": "silent warrior", "ReviewID": "R1QL1N13A9OME1", "Overall": "4.0", "Content": "I was looking for a performance/Gaming  laptop and doing research for over 1000 hours i zeroed in on it :)I dont see any other laptop beating this Model  in near future.My research also helped me in understanding how brand name increases the Price with out any significant increase in quality feature or othewise.Initially i was after big names , becasue my pshychological thinnking  was if iam spending 17k it shud be fancy name because ASUS as brand is not that known , but well hey who cares , ASUS is offering an Extra ordinary product way to go!! satisfaction guaranteed .I suggest for all gamers and Performance enthusiasts .once purchased dont look back for upgrade for next 5 years :)4 stars because no product is perfect , there is always scope for improvement .ASUS Republic of Gamers G73JH-A1 17-Inch Gaming Laptop (Black)Improvements that could have been done  :1.For 17k i expect (its my personal opinion ) fashionable product , which shud generate a wow factor !!!!!!!!!!!!!.2.Lap top touch pad and left and right key pad is a big  joke(i have to be critical here ) but they cover it up by bundling the laptop with an awesome ROG mouse (good strategy here :))probably they realized after mass production .(bad mouse pad designers)", "Date": "June 30, 2010"}, {"Title": "SOUND TO GOOD TOO BE TRUE", "Author": "Mr. Chris Teele", "ReviewID": "R1WKTRY0K55DA7", "Overall": "5.0", "Content": "I've had my eye on this Gaming laptop for six know in the U.K .Can't believe this price in AMERICA is under 1700 Dollar's.Over here it will cost me more than 2000 Dollar's.", "Date": "May 8, 2010"}, {"Title": "MUITO BOM", "Author": "CHM", "ReviewID": "R2RI4YJYIGYSXX", "Overall": "5.0", "Content": "ÓTIMA COMPRA... MUITO BOM... RECOMENDO !!!A MÁQUINA É UM AVIÃO !!!MUITO RÁPIDA... EM PERFEITO ESTADO...É MUITO MAIS DO QUE EU ESPERAVA,..", "Date": "September 19, 2011"}, {"Title": "Not bad but not the best either. Not worth this much money.", "Author": "Manny", "ReviewID": "R393EOB7R50WCR", "Overall": "2.0", "Content": "Laptop model: G73JH-A1Ownership period till date: 3 monthspast laptops owned: MacBook Pro 17\", Thinkpad R42, Asus Netbook.Setup: 2 full HD external displays - one via VGA and one via HDMI. External keyboard. Laptop's LCD doesn't work in this setup.Uses: Development (primarily) and sometimes video editing. Desktop replacement.Bad about G73JH-A1:- Driver issues from the beginning.- Creative 32-bit Audio drivers caused computer freezes - learnt this after visiting a lot of forums and a lot of frustration later.- Vertical grey stripes and freezes while playing any computer game - Crysis or NFS Underground. Gave up gaming on this after trying so  many freezes.- XP driver support is not there for video. Had to use desktop drivers for ATI Radeon 5870 for win XP 32 to get video to work.- Haven't tried keyboard much, I use external gaming keyboard. But so far, keyboard has been good in usage.Good about G73JH-A1:- Quite powerful CPU - quad core.- Aids in development, but one can get any quad core for that.- Runs cool. No need for laptop chill mat.Read about support:You send in this laptop, it doesn't get repaired for weeks. Therefore, I am afraid to send it in for repairs.Summary:Not worth so much money. This should be less than a grand.Thanks", "Date": "August 12, 2010"}, {"Title": "Mobile video game powerhouse", "Author": "Timr", "ReviewID": "R35SUL16UMQLX8", "Overall": "5.0", "Content": "This laptop is perfect for traveling and video games.  As long as there is a power outlet available.  The price vs. specs is excellent!!", "Date": "June 26, 2010"}, {"Title": "Great Gaming Laptop", "Author": "Isabella Robellini", "ReviewID": "R2LZJSB0XNDMZB", "Overall": "5.0", "Content": "It works with every game we have tried - my boyfriend is computer expert and he says is has everything you need to play all the new games on!!!  The screen is nice and big - I love it!", "Date": "May 30, 2010"}, {"Title": "Worst Keyboard Ever", "Author": "J. Bjork \"chompers\"", "ReviewID": "RFEIHIJV9A7IU", "Overall": "1.0", "Content": "I purchased this laptop, used it for about 8 weeks, and then had to sell it on Ebay for a $400 loss.  The keyboard is absolutely terrible.  Not only is the keyboard uncomfortable, but it misses about 1 out of every 5 keystrokes.  If you never need to type anything, this unit might be good for you.", "Date": "July 23, 2010"}, {"Title": "So sick of this laptop", "Author": "Ice007", "ReviewID": "RDYT9HAPG4DVZ", "Overall": "1.0", "Content": "I have so many problems with this laptop i'me not gona waste my time writing it all here.  Just wish I read all the bad comments about this before i bought it.  Hopefully people will read this before they make the same mistake", "Date": "September 12, 2010"}, {"Title": "Report on my ASUS computer", "Author": "Karen  Wilhelm", "ReviewID": "R3882URGZJ9ZDB", "Overall": "1.0", "Content": "I don't have this model, but I do have an ASUS gaming computer.  I've had it for just over two years now, and if I had it to do over again, I would not purchase an ASUS computer.  I had problems with it from the start, the DVD drive didn't work right when I got it and it soon stopped working completely.  After much hassling with tech support, ASUS finally sent me a new one out and I installed it.  I've had no more problems with the drive.  The card reader has never worked right.  There are some cards it just refuses to read.  I can put the same card in my husband's Toshiba computer and it reads them, no problem.  I called tech support and they claimed it was a driver problem.  I downloaded the driver, re-installed it and it didn't make it any better. It's unusable for almost every card I put in it!  I think they put a defective reader in these machines!  My computer also lost the little feet on the back.  The battery didn't last long before dying, and it never did last very long, maybe an hour at the most even when it was new.  The battery was still under warranty when it died, but I never did get it sent back in for a replacement.  Then the video card started giving me trouble, the screen goes black and I get a message that the driver has failed and restarted.  The problem was intermittent, happening just often enough to be annoying.  I called ASUS again, and after several months of emailing back and forth, I was told that I would need to re-install windows, wiping the computer and starting over and if this didn't work I would need to return the computer to them so they could troubleshoot it.  I did this, and for a short time the problem seemed to go away.  Just long enough for the warranty to run out!  The black screen is happening again, with more frequency and I'm worried that one day the screen will stay black.  And now, I will have to pay for it to be fixed!  If the computer does die, I won't send it in for repair,  and I won't replace it with another ASUS!  I wasn't impressed with their customer service or the computer quality!! I think I'll get a Toshiba like my husband has, he's had NO problems at all with it in the year he's had it! Beware purchasing an ASUS!", "Date": "December 28, 2012"}, {"Title": "Another Brick in the Wall", "Author": "Amazon Customer", "ReviewID": "R2PFSX7BQVU34Z", "Overall": "1.0", "Content": "Had the unit for 12 hours.  In that time it took 10 hours to complete the 6 disk dvd backup.  I didn't even get a chance to actually play games on it as it BRICKED within the first hour of setting up some software.  I do mean BRICKED, no lights, no power indicators, ect.So in my opinion, pretty much sucks as a notebook.  I am definetly looking elsewhere.  It is not fast as far as burning DVD's, which is all I really have to compare it with.Do yourself a favor and if you really want to try it, get it from someplace you can return it to, as you will most likely have to.  I returned mine to Amazon today.  Just waiting for a refund, then will get something that is reliable.", "Date": "July 15, 2010"}, {"Title": "disappointed", "Author": "A. Muntasser \"Uncle DVD\"", "ReviewID": "R1NMM3LSNCXGNZ", "Overall": "1.0", "Content": "Reading everyone's review I was very disappointed after owning this laptop for a week for the following reasons:1- Very cheap workmanship with plastic pieces falling apart.2- Lack of ESata connection which my 400$ laptop has.3- HDMI was useless with 3 ou tof 5 monitors I tried.  It just cant detect them so the resolution is all wrong.4- Contrary to what the ADs say, it runs very hot even at idle (50+C). not sure what happens if I overclock as they suggest.5- Sound crackling which is an epedimic with many of these ASUS (google crackling and ASUS). This is the worst part since muting does not stop it and it is so loud.  It happened in public freaking everyone out.6- Technical support claims to respond within 48 hours otherwise the request gets escalated as \" first priority \".  It has been a week.When it is working it runs games quite fast for a laptop I will say that but the other problems are too much to give it more than 1 star. Waste of money if you ask me.", "Date": "May 7, 2010"}, {"Title": "Amazon lists as IN STOCK - but it is not -- and there is no ETA for delivery", "Author": "Lawrence Strickland", "ReviewID": "R1GU9ZLYXYU9O9", "Overall": "1.0", "Content": "I ordered one of these laptops after a significant amount of research to determine the best product.  The laptop appears to be mostly what I would like and has received excellent reviews.One of the main reasons that I ordered from Amazon was that the laptop was listed as IN STOCK.  This can be a difficult laptop to get as they are out of stock in many places.  In addition, the free shipping made it an excellent deal.As with many orders, it is shipped by a third party dealer, Electronic Express.  I have ordered items like this before with no problem  However, in this case -- AFTER MY ACCOUNT WAS CHARGED -- I received an email from the seller indicating that not only was the laptop out of stock, but in addition they had absolutely no ETA for delivery.  They said that they expect some SOON, but with no indication of whether SOON is this week, this month, this year, or never.This may have simply been an oversight on Amazon's part, but I have been checking for two weeks and the IN STOCK status has not changed.Do not order this laptop from Amazon without making absolutely sure that it really is IN STOCK or, if backordered, when the back order will be satisfied.Normally I am very happy with Amazon.com.  This shakes my faith in them considerably. --Larry", "Date": "July 11, 2010"}, {"Title": "Powerfull computer.... but BEWARE!!!!", "Author": "Dionicio Batista \"Yerry Batista\"", "ReviewID": "R3R16O3QQT1YYT", "Overall": "4.0", "Content": "CURRENT REVIEW:------------By June 15 the computer is working LIKE A CHARM, very stable, the performance is very impressive too, I use some 64 bit programs like Adobe Photoshop CS5 and Adobe Lightroom 3 and they execute VERY well.On games I got a very good performance too.I Must say that the store was VERY responsible and fast to replace my first defective laptop, but this cost me about $300.00 more cause I live in The Dominican Republic and had to send and pay taxes for the old and the new laptop.The only negative point this model has is the VERY SLOW HARD DISK, is reducing the overall qualification of the whole system, I'm planning to buy an Solid State Drive to get better performance.  That's why I don't give a 5 star to this model.The last HD failure on a very new laptop was UNACCEPTABLE, but in this model everything has worked VERY GOOD for about a month now.ALWAYS check the disk with a exhaustive scan before start using and copying personal data to this model.Thanks every one has contacted me about this model.LAST REVIEW:------------I Purchased this laptop as an upgrade from my Previous Asus, I was so excited, I ran my games and my software like a charm... but after two days DISASTER CAME!!!Windows became incredibly slow and did not respond from time to time, so I decided to move back my data to a portable hard disk and reinstall... guess what?  THE DISK WAS DEFECTIVE!!!.I ran Check Disk at 10:17 am of May 3 until now (4:59 am - may 4) just 10% of the disk was checked, I'm expecting the worst for my data.Why don't you just check the disk BEFORE selling this product?I lost valuable data and most of it TIME trying to do things that you are supposed to do on a very old and dying laptop.Is very sad that this my first review on Amazon has to be a bad one.Hope this helps to other byers that are planing to buy this \"Time Bomb\".Update:  I Have the new computer from the store and is working (+/-), have frozen once.UPDATE:-----------I had to replace the primary disk with an SSD, now the computer is more faster.It seems that the mayor problem with this computer is the hard disks, the secondary hard disk died last week, I had lost some data thanks to a backup I had restore most of my data.Now I'm planning to replace the dead 500GB hard disk with an 1TB hard disk.", "Date": "May 4, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core i7 Processor 1.6GHz\n8GB SO-DIMM RAM\n1TB 7200RPM Hard Drive\n17.3-Inch Screen, ATI Mobility Radeon HD 5870\nWindows 7 Home Premium", "Name": "ASUS Republic of Gamers G73JH-A1 17-Inch Gaming Laptop (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/416OcTXFfeL._SX300_.jpg", "ProductID": "B0039825JE"}}