{"Reviews": [{"Title": "Awesome", "Author": "Kenneth", "ReviewID": "R2PEDEAU34ESVF", "Overall": "5.0", "Content": "I was skeptical to purchase a refurb, but this thing kicks serious butt! My wife needed a fast laptop with XP for her work,.......and this thing was flawless out of the box! Highly reccomend this seller, everything was as described and arrived sooner than promised! Great!", "Date": "November 13, 2010"}, {"Title": "LD sales", "Author": "Lorraine", "ReviewID": "R1Z15SK5XAJM7T", "Overall": "5.0", "Content": "I was very pleased with the laptop that I brought as a Christmasgift for the family.  We can have this on the kitchen table andeveryone can access whatever they need to look up while we aredownstairs.The unit arrived in great shape with everything ready to work.  Noproblems connecting to our wifi and using the internet.", "Date": "December 22, 2010"}, {"Title": "BUYER BEWARE OF SELLER", "Author": "Kathryn Kuhn", "ReviewID": "R1GQ5SNOANBXS1", "Overall": "1.0", "Content": "i bought a dell 610 latitude which i was told on line that it had 2 GB Ram 160 GB hard Drive  which in fact it only had 80 GB Hard Drive.  i ask for $100.00 off the price seller said NO.  upon discovering that the charging cords/box wouldn't stay together the seller at 2 Daily Deals told me he would get me a new Dell charging device.  The seller even emailed a  post office tracking number, after couple of weeks i tried the tracking number only to find that it was nonexistent.  i then emailed 2 daily deals to inquire about this problem they emailed me back saying that they would mail me the new charging cords and box  if i would change my rating, which i'm doing, from a rating of 2 to a zero if i could. just beware.", "Date": "April 12, 2011"}, {"Title": "There is spot on the screen", "Author": "Sardar ali", "ReviewID": "RTF9HFAJYLCC5", "Overall": "3.0", "Content": "The condition is good but there is dark spot on the laptop screen which was not mentioned.It looks very bad.At least they should mention this but they have not.", "Date": "February 11, 2011"}, {"Title": "Don't buy this", "Author": "Susan Black", "ReviewID": "R3PKPHV80HHMGK", "Overall": "1.0", "Content": "I purchased this in January for my son.It worked wonderful for about four months and then it died. Customer service was fast in replying, but it only comes with a one month warranty. He is heartborken.", "Date": "June 29, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00367A8NS"}}