{"Reviews": [{"Title": "Great Ultraportable", "Author": "C. Crowder", "ReviewID": "R1HVBXBALQJPJN", "Overall": "4.0", "Content": "Here is my review on the much anticipated new notebook from Acer, the Timeline 1830T-3927. This machine is a 11.6\" ultraportable notebook equipped with the new Intel processor, the core i3-330um CPU, which is maufactured especially for smaller notebooks, 3 GB RAM and a 320 GB Hard Drive running on Windows 7 Home Premium, 64 bitThis notebook just arrived from Amazon the other day and I have only been using it for a couple of days but since there are very few reviews thus far on the 1830T, I thought I'd write one.The overall build quality of this notebook seems to be very good, it is made of very tough light weight plastic  and has a black matte finish on the outside which is very sharp. The HD screen is designed for 720p viewing and seems to have a very sharp and bright display, this resolution is of course ther best you can  expect on a smaller 11.6 ultraportable. I have seen many displays on 11.6 models and I believe the 1830T has the best screen that I have seen. The keyboard on the 1830T does not seem to be full size as the typing experience is comfortable but somewhat cramped. The keys have a very nice feel and good feedback but I was disaapointed to discover that the keyboard has allot of flex and seems a bit flimsy, something I did not expect on a $599 notebook.( This is why I am giving the 1830T 4 stars instead of five.)In addition, the trackpad, although comfortable seems very small. The mouse buttons are excellent.The ports on this machine are very good with a nice selection, certainly all you will need on an ultraportable, of course there is not optical drive as Gateway is the only manufacturer I know of that is equipping an 11.6 notebook with a DVD drive.In addition to the excellent screen, the real strength of this notebook is the new and powerful Core i3-330um CPU. ( Note that there is an even more powerful model equipped with the Core i5 but it retails on Amazon for $699,a bit much to pay for an 11.6 ultraportable in my opinion.). The Core i3 on this machine seems very fast and responsive and seems to handle just about anything you throw at it. This CPU is noticably faster than the other Intel ultra low voltage processors currently on the market and certainly much faster than earlier Acer models like the 1410. With the new Core i3 CPU, you will lose a bit in battery time but the speed more than compensates for this. I expect the 1830T-3927 to last about 5 hours on a charge.Overall , this is one of the best, if not the best 11.6 ultraportables out there but you will have to pay a premium for it, mostly because of the new Intel processor. As I said, if not for the average keyboard, this notebook would be easily 5 stars.", "Date": "July 1, 2010"}, {"Title": "Great Laptop", "Author": "Joe Caldwell", "ReviewID": "R1GZ50LOX6GGTQ", "Overall": "4.0", "Content": "Pros:Thin, light, screen is bright and has good color, screen's high resolution makes up for its small size, processor is powerful enough for general use, doesn't get too hot, great battery life (6+ hours), great port selection, good keyboardCons:Touch-pad isn't well demarcated from the wrist rest making it too easy to drift into no man's land, the screen's vertical viewing angles could be betterOverall I really like this laptop. It boots quickly and has generally snappy performance. It isn't the fastest at some processor intensive tasks like compressing audio and video, but that's to be expected for a low voltage processor. For general use like web browsing and watching videos it is perfectly adequate. I'll gladly accept some reduced performance given that this laptop doesn't get nearly as hot as other laptops I have used and it has fantastic battery life. I can get over 6 hours with the wifi on and the screen set to half brightness.The screen looks nice, has a good resolution, and isn't too reflective. The vertical viewing angles, however, aren't the best but they are hardly prohibitive to use. Probably the most annoying thing about this laptop is the touch-pad. It's not terrible; I just wish it was easier to tell by feel when you have left the touch sensitive area. Not a deal breaker, but annoying nonetheless. Fortunately the keyboard is great. It isn't missing any important keys and is comfortable to use. I also really like the large port selection for such a small laptop. I've had larger laptops that had only two USB ports.The thing I like most about this laptop is its portability. After owning a couple of big and bulky laptops over the years, it's fantastic to carry around this little machine. If you are looking for a solid ultra-portable laptop, you won't be disappointed with this one.", "Date": "July 6, 2010"}, {"Title": "Powerful and Easy to Carry", "Author": "FFDR", "ReviewID": "R1TCKD4VZSAMKJ", "Overall": "4.0", "Content": "To me this ACER ASPIRE laptop is the perfect computer for travel. It offers a great compromise between the need to carry it around on one hand and the speed/CPU power on the other. The laptop is only slightly larger and heavier than the 10\" netbooks with the Intel Atom processor. In return it offers the new core-i processor which puts it on a different planet in terms of computing power. I have been using it for a couple of days now, and I am generally very pleased with it performance.What I like:- Small dimensions and weight make it easy to carry.- Very powerful given the size.- Sturdy built, seems solid and durable.- Responsive keyboard with very large keys.What I do NOT like:- The mouse touchpad. It has a rather rough and sticky surface which makes it rather challenging to use. This compounds the problem that the touchpad is quite small. I would have preferred to have the keyboard downsized to generate more space for the mouse.- The HOME and END keys can only be reached through the FN key. Not a big deal, but I happen to use them quite frequently, and there would obviously been enough space for two extra keys (and a larger tochpad).I cannot help closing with a bit of a rant: I absolutely HATE WIDESCREENS. I would certainly not have bought this computer if there had been a suitable alternative with a 4:3 ratio screen, even for a considerably higher price. Unless the computer is used exclusively for watching movies, a widescreen of this size has only disadvantages. When browsing the web or editing documents, it makes me feel like standing in a room with a ceiling 4 inches below my height (this last point is not included in my ranking as all competing models would have the same problem).", "Date": "July 24, 2010"}, {"Title": "The best and fastest netbook in the market", "Author": "Joao Victor O. Pinho \"joaovictorop\"", "ReviewID": "R1F0UR9MY5MBU0", "Overall": "5.0", "Content": "Well, i had a Toshiba Mini NB205 that was an excellent netbook, very portable, resistent and had a beautiful appearance, I really liked this computer the internet and word worked razoably nice in this PC, but sometimes the internet conexion was a little too slow for me, and another sites, like [...] and [...] - that are very heavy sites, were extremly slow to download and that irritated me a lot. So, I decided to change for a new netbook, and when I discover this ACER ASPIRE 1830T with the new intel core i3 inside I got crazy. And now I am really happy with this little PC!!!Pros: the 11.6 inch lcd screen is a lot better than the 10.1 inch ones, it makes lot more easier to see the internet or work with the Office. Using for long periods the 10.1 inch screen is very tiring for the eyes, and the  11.6 is the perfect size for a ultraportable notebook.The computer is very fast, you can see any page in the internet with no problem. And the Windons 7 64 bits works like a breeze, it's sensational.The built quality is very good, it really is a superior computer very beautiful and resistent.The keyboard is very good, the letters have a really nice size and you can type on this for hours and hours. I really loved the full size left SHIFT button, what is extremelly annoing in others netbooks. The keyboard don't have problem of flex, maybe just a little bit but that's will not be notice or be a problem when typing. The Toshiba Mini NB205, that is one of the best netbook in the market has a lot more flex than this one that almost don't have flex at all.The duration of battery is fantastic and even more for a i3 processor. I thought that just the processors n450 could have the capacity of lasting so much. Fortunatly I was wrong, and I discover that this machine can last longer than 6 hours of solid internet conexion.The computer is very very thin, and light, and the best thing is that the battery don't come out of the machine, it just stay where it should be, with any part out from behind or down the netbook like the N205 da toshiba.Cons: it could come with a minimum of 128 MB of dedicated Video Ram, But that's not a big deal because I will not play games in this little computer.Another problem is that this don't come with 4 GB of RAM, it could be included because this computer is expensive, but the 3 GB works more than perferctly for me.Well, finally I highly recommend this computer for ANYBODY, who wants portability, fast internet conexion, and long battery life.", "Date": "July 1, 2010"}, {"Title": "Nice Netbook Replacement", "Author": "Brett", "ReviewID": "R57PPXEKBW08O", "Overall": "4.0", "Content": "Pros: This is a nice notebook (not a netbook). Well built, but light. Fast enough for everyday use and light gaming. The 11.6\" screen is bright and crisp. It will run 1080P flash without any problems. Keyboard is great, and has nice feel. Great battery life. Windows 7 Home Premium a definite plus over lesser models that come with Windows 7 Starter installed. Swapping out the wi-fi card, memory and hard drive is easy via the bottom panel.Cons: Acer puts these really crappy Broadcom 802.11n Single band 2.4GHz Wi-Fi cards in their portables. I had a spare antenna lying around, so I upgraded the Wi-Fi card to an Intel 6300 PCI Express Half Mini Card. If you don't want to mess with adding a additional antenna, an Intel 6100 or 5100 (which only need two antennas rather than three) should work fine. Swapping out the Wi-Fi card is easy (if you can swap out memory, you can swap out the Wi-Fi card), and very much worth the additional $30 cost.The Alps Touchpad is also a bit difficult to get used to. It was much better after I played with the settings.Other: Mine came with 3GB of mismatched memory. 1-1GB 1066MHz Samsung memory module, and 1-2GB 1333MHz Elpida memory module. The combination works fine, but seems odd. Notebook does not come with Bluetooth.Overall, I'm very happy with my purchase. I would have given it 5 stars if it wasn't for the crappy Broadcom Wi-Fi card. I'll probably upgrade the memory and drop an SSD in it in the near future to make it really fly.", "Date": "January 19, 2011"}, {"Title": "Warning Other Acer Model - 1830T-6651 Intel Core I-5", "Author": "D-ave. atlantica", "ReviewID": "R1ZNUFUDZDX88R", "Overall": "1.0", "Content": "Purchased an Acer Aspire Timeline 1830T-6651 Intel Core 1I-5, exactly 2 years ago.  The motherboard just died.  Treated it with kid gloves and used it rarely, only for travel.  Asked the computer repair guy if the board going out was prevalent, for laptops in general.  He said, \"Yes\".  I told him that I thought with the advancements in manufacturing technology, that laptops would be more relible.  He said, \"The opposite is true\".  Due to my misconception, didn't buy an extended warranty. Now, I've gotta buy a new laptop but it won't be 'a piece of junk Acer'.  Buy that extended warranty!", "Date": "April 11, 2013"}, {"Title": "excelent laptop", "Author": "Marco from Brazil", "ReviewID": "R3CAF27RNIO7V6", "Overall": "4.0", "Content": "This lap top is very very good.Good size , nice weight nice feel.It is fast I dont have problems in doing several things at once, like playing videos surfing the internet pictures etc.. The Hdmi conection is a great plus.The screen is very good and I play videos without problems. I do Not use to play hard games I did not test yet this kind of games.Overall is a very good choice in terms of price and what you get. This is my second acer laptop and I have no complaints about it at all. They both work very well and give me more than I was excpecting.", "Date": "October 6, 2010"}, {"Title": "A Mega-tablet!", "Author": "Jeffrowan10s", "ReviewID": "R2XAC814JJW9AC", "Overall": "5.0", "Content": "Over the past month, I had been waiting to buy a tablet. Would the Motorola Xoom meet my needs? Would the Ipad 2 finally give in and offer flash video support? And I definitely wanted a unit with HDMI out, to send streamed video to my flat-screen TV. After doing some research, a light bulb suddenly went off in my head. Why not just get a full-featured netbook with 3 USB ports, an HDMI out, a usable keyboard, and the ability to stream video at 1080P? Sure, it's not as light as a tablet--3 lbs. vs. 1 lb.--but it's still super portable, and can be used as both an office computer, and a home media center.I bought the Acer 1830t-3927, unpacked it, set up my home wifi in seconds, promptly downloaded the Google Chrome and Firefox browsers, then downloaded Kindle for PC, and I was good to go. It does everything I would ask a tablet to do, but does it better, faster, on a bigger screen with higher resolution. What about all the apps I'm missing out on? I still have my Iphone, which is loaded with apps, and which, until netbooks and tablets come with built-in telephony, I'll always need anyway. What about 3G? I already had a USB 3G dongle (AT@T Lightning Connect) that I plugged in, for those wifi-less moments. That saved me from having to get yet another data contract!I believe that Acer has missed out on a marketing opportunity here, and has let the tablet-makers steal their thunder. This is in essence, a mega tablet, which has all the features I wanted in a tablet. Is it as cool as a tablet? No. But cool only takes you so far when you're trying to pound out an important document. Great product!", "Date": "February 28, 2011"}, {"Title": "Splendid Laptop", "Author": "David K. Jordan", "ReviewID": "RJH718ZAA0CC7", "Overall": "5.0", "Content": "I am a college professor and give lots of lectures, often using PowerPoint. When I bought this computer 6 months ago my goal was to have something very small but with a full-sized keyboard and long battery life. My local techie recommended the computer for its excellent processor, which I didn't entirely understand. I still don't, but I do suspect that part of the long battery life (originally about 6-7 hours!) may be that that the processor generates almost no heat. It also seems to boot much faster than my previous laptops. I doubt I could have picked a more suitable machine for my needs. One occasional inconvenience is the scroll bar on the side of the mouse-pad, which is invisible in most light and is crotchety always. I carry a tiny laptop mouse for occasions when I need to do much moving around on the screen. The absence of a DVD drive means you need a VERY SMALL external one. Alas ALL of those seem to be region-limited (usually switchable a limited number of times, which they tend mendaciously to call multi-region), so you need one for each region for which you may have occasion to use DVDs. I gave up and just use a separate, truly region-free DVD player when I show foreign DVD snippets in class.", "Date": "March 2, 2011"}, {"Title": "Terrific little computer", "Author": "terry", "ReviewID": "R32KPLK03ZEXOA", "Overall": "4.0", "Content": "I've never reviewed a product before but I read lots before I decided to buy the Acer Timeline 1830T-3927 so thought I'd return the favor(s).  Most everyone who bought this laptop seemed to like it and I can add my voice to that list.  It's lightweight, boots up fast, the keyboard is super easy to get used to and big enough to feel like a full size one even though I think it's a bit smaller.  Not surprisingly, I haven't found the battery to go 8+ hours but I've gotten consistent 5-1/2 to 6 hours and that's with everything running.  I'm trying to be more aware and turn the wifi off if I'm not using it to see if that improves battery life, which it should, but the jury is still out.  Regardless, it's lots better than the HP dv3600 I had before.  That was a nice laptop but in the end still too big and heavy for me (which is why I got this one).One thing that would make this laptop just that much better would be a backlit keyboard.  The HP had that and it really does make a difference when working in low light.Apart from that, I'm really pleased with my purchase -- and I'm one of those people who tend to have buyers' remorse.  I'm no techy but for $550 this is the perfect laptop for me -- plenty of memory and HD, small but not too small, and light enough to carry without it being a burden.  It's my primary computer and I don't at this stage feel a need to get anything else.  Hope this is useful to someone struggling with all the options out there!P.S.  I bought the laptop from Amazon and got free shipping though was a little worried it would take the full 3-5 business days to arrive and I needed it fairly quickly.  It arrived in about two days!", "Date": "February 27, 2011"}, {"Title": "Great and light weight!", "Author": "mooka", "ReviewID": "R3J1JEEMDE5I2Y", "Overall": "5.0", "Content": "I got this computer for work and it is great.  I was a little worried about not getting a DVD drive, but haven't missed it.  What I do appreciate is the fact that this computer weighs next to nothing - which is great because the rest of the stuff in my bag weighs a ton.  It's very fast with processing and can multitask great as well.  I would highly recommend this computer for anyone who needs a not too expensive alternative to the big, clunky laptops that are in about the same price range.  It's more expensive than some of the larger laptops, but well worth the extra to have a smaller item to carry around.  Also, the keyboard is still full sized and easy to use with a wonderful feel to the keys.Love it!", "Date": "February 24, 2011"}, {"Title": "Great Value", "Author": "SCS", "ReviewID": "R1XKBAKOOTEUQ", "Overall": "4.0", "Content": "I purchased this machine as a windows laptop & netbook in one for online classes. I added a bluetooth keyboard & mouse, as well as a 19\" monitor for use at home.  Thus far it's performed incredibly well as a dual role machine.  The HDMI out plugged and played with the Hannspree monitor. I watched a few 720p high def videos on the HD monitor as a test, and the TimelineX did a great job. The battery charged quickly, and I've gotten excellent run time with wifi on & the bluetooth usb adapter running the wireless mouse.Despite most of the experts knocking the keyboard in their reviews I've had no problems after typing on it for a bit. To put that in perspective I run Linux on a 15\" Lenovo N series laptop. It's not as nice as the Lenovo keyboard, but that's a very high standard. Some of the experts have also dinged the build quality: Again, I have to disagree.  It's not a Thinkpad by any stretch (even my N series is a bit more solid), but it's plenty sturdy for a 3lb consumer grade laptop.My only major complaint is the lack of integrated bluetooth.  If that oversight was corrected I would rate it 5 stars.  The USB adapter sticking out the side is a bit of an annoyance.The touchpad functions quite well, even though it's small. I can't hold the size against Acer, because this an ultra-portable after all. The screen resolution is also excellent, and made adapting to the smaller screen far easier than I thought it would be.Overall, I'm very pleased.  I got the size, weight, and battery life of a netbook; with the processor, memory and HDD of a laptop.  It's a bit pricier than the basic versions of either of those, but well priced compared to similarly equipped ultra-portables from other makers.  The savings on the system allowed room in the budget for the add-ons I listed above. I'd strongly recommend the TimelineX series to anyone looking for laptop power in budget ultra-portable.", "Date": "January 31, 2011"}, {"Title": "Fast notebook, mediocre touch  pad", "Author": "M. Kaiserswerth", "ReviewID": "R20B36OJWQ9HPB", "Overall": "4.0", "Content": "If it were not for the mediocre touch pad, I would rate this machine 5 stars.It is fast, light-weight, and the battery lasts long enough to do meaningful work with it.I have significant issues though with the touch pad, it is too small and two finger scrolling does not really work for me.", "Date": "November 29, 2010"}, {"Title": "USB driver not compatible with my iphone 3G", "Author": null, "ReviewID": "R2HMQA9P09XG6G", "Overall": "4.0", "Content": "I bought it two months ago and I still find it a very good computer. One thing though, my iphone cannot be recognize because of a problem with the USB driver. I called Acer support and there is nothing they can or want to do for now !!!  ...but that is the only negative point I found so far. Enjoy", "Date": "October 26, 2010"}, {"Title": "Great computer, definitely recommend", "Author": "D. Solomon", "ReviewID": "R3H8JNVJAL2XQM", "Overall": "5.0", "Content": "I have had this laptop for about a week and I would definitely recommend it. It's got plenty of power for basic tasks and decent battery life. I've run it for two hours hard with the screen fairly bright and still had well over half the battery left. I've heard complaints about the keyboard but after a half an hour getting familiar it was fine. The screen is beautiful and Windows 7 Home Premium works great. The case feels solid and the laptop is really thin and light. It's a great computer that you can pick up for less than $600.My only significant complaint is the usual bloatware, one of which MyWinLocker refuses to uninstall. My other concern is that it is not clear how/if you can reinstall the operating system if it gets trashed. There is nothing in their nonexistent hard copy documentation.Also, I purchased it from Buy.com via Amazon and they had it delivered the next day even though I chose Amazon's free standard shipping.", "Date": "October 21, 2010"}, {"Title": "Happy to have found this little gem", "Author": "climberevan", "ReviewID": "RJONESXQJXYC2", "Overall": "5.0", "Content": "I did a lot of research and found the 1830T at the last moment.  I'm glad I did.It has a great feel (not quite as nice as a Thinkpad, and nowhere near as nice as a Macbook, but much nicer than netbooks and other small PCs).  I'm running the current version of Ubuntu and it seems to work well.  HDMI has a few quirks, as does wireless, but that's linux on a new piece of hardware for you.  Optical out works perfectly, as do most other features.The keyboard is great--as good as my old 12\" Powerbook that i have been trying to replace for years.My only complaint is that the trackpad is a bit small and the lack of definition on its edges makes me miss it sometimes, but I'm getting used to it.  The Acer bloatware/junkware/crapware is pretty lame, but I mostly boot into linux anyway so it doesn't bother me much.  The 13GB partition for Acer's recovery crap is also lame, but I just burned some DVDs and re-partitioned.To my mind this is the best sub-$800 small laptop available.", "Date": "October 19, 2010"}, {"Title": "Excellent laptop... no complaints!", "Author": "NAT \"NAT\"", "ReviewID": "R322YBIOE6TYCD", "Overall": "5.0", "Content": "This is a great laptop... one of the best and most affordable smaller, high performace laptops on the market! It is physically big enough to see and type on and technologically advanced enough to use a variety of programs (at the same time, if you'd like). It starts up and shuts down super quick. Screen resolution is great, sound is pretty good for a laptop (you really can't expect too much in this category), and the battery lasts forever (8 hours on a full charge). I have used netbooks and their performance sucks and the 13-15 inch computers are way too heavy and big! This computer is faster and stonger than a netbook without the bulk and weight of a 15\" laptop. If you are looking for an affordable full performace, small laptop, then this is the one!", "Date": "October 17, 2010"}, {"Title": "Good, but not great", "Author": "DaveLovesBeer", "ReviewID": "RMCZ36W6FP11Z", "Overall": "4.0", "Content": "Before this I had an Asus EEE 1000H, so I'll be using that to compare a few things.The keyboard on this feels cheap, but I find that I type very well on it and the quality isn't so low that it bothers me like it does some other people.The touchpad is bad. Not horrible, but bad. The EEE netbook I owned had a terriffic synaptics touchpad that was much better. The touchpad is the one thing about this device that bugs me regularly.The screen is decent, very glossy and reflective, nothing special about it.The overall build quality is just OK. I paid a price premium to get more horsepower/features and a higher resolution screen in a small package over what most netbooks have, and Im pretty happy with the performance (id say if your budget isnt too tight, get the i5 version for a little more peppiness) though it does slow down a little here and there  if I'm running several things at once.Video out works well. It handles 1080P flash with mild stuttering, 1080p netflix streaming without a hitch, and 720p for any video ive watched so far just fine.Battery life is great. With wifi on, screen turned down some and some general productivity and web browsing you can get 5 easily, wifi off and you can get even more. Works great for me for taking notes in class because its quick, has long battery life, and decent performance and it's so light that I keep it in my bookbag all the time and barely notice its there.Overall I'm happy with it and have definitely gotten what I expected out of it. I've read that some TimelineX machines have had issues with Windows 7 SP1, but this just updated and seems to be fine.", "Date": "May 14, 2011"}, {"Title": "More useful than a netbook and as portable", "Author": "Jacques Allard", "ReviewID": "R30DZEJJRFN4DM", "Overall": "4.0", "Content": "This 3 lb laptop is as portable as a netbook but allows me to use my usual software suite for statistical and mathematical computing when the need arise away from my desktop.  The light weight of the included power transformer is also important for portability on long trips.The mouse pad is the weakest point - I carry a light Logitech Wireless Mouse M310 to avoid using the mouse pad.  The only keyboard I could find in Canada is multilingual which means that some usual keys are smaller than expected, an inconvenience for touch typing (I prefer to use a standard \"American\" keyboard layout even when I use the Canadian French keyboard layout).Overall, for my own use, much better value than a netbook.I was looking at a 3 lb $2000 Sony Z series laptop... For me, the $500 Acer wins the cost/benefit ratio competition hands down!", "Date": "September 15, 2010"}, {"Title": "Won't run Windows 7 SP1!", "Author": "EMF2GO", "ReviewID": "RKYRQ1UZQKJCQ", "Overall": "3.0", "Content": "This computer will not run Windows 7 SP1.  The Intel HD Graphics requires an updated driver before SP1 will install.  (See MS KB2498452.)  While Intel has released generic drivers, Acer will not allow them to be installed (neither the zip nor exe nor manual installation will complete).  Acer insists that only their OEM graphics driver can be installed, which is an obsolete version of the Intel driver -- one that is incompatible with SP1.  I'm still in warranty, and went through several levels of Acer tech support to no avail.  They have no solution, and no intention of providing one.  All they do is offer to charge me money to \"walk me through\" pointless repetitive exercises.  Their position is that SP1 is a new operating system and they have no obligation to support it.  Then why block the solutions that others provide?  Goodbye Acer.", "Date": "April 20, 2011"}, {"Title": "Warning", "Author": "Justin B. Fraser \"Fuzzmonkey\"", "ReviewID": "R2LGPHOPMED9HC", "Overall": "1.0", "Content": "I have the 13.3 in version of this computer and I am going to post the same review that I left for it as a warning=========================================================================================================The form factor is great and they are not lying about the battery life. Unfortunately I had to send my Acer laptop to be fixed within a week of receiving it. I have now sent it in 3 times and am fed up with Acer. As of right now there are 23 days left on my warranty and they will not fix/replace my lcd with dead pixels because, and I quote their own website:\"TFT displays commonly exhibit a small number of discolored dots, so-called \"nonconforming pixels.\" This phenomenon is a limitation of TFT LCD technology, not a product defect and, as such, is not covered by the limited warranty or by the upgrade programs\"So now, I get to deal with dead pixels on my computer that is still under warranty because they are not a product defect. Also the wireless card will just turn itself off at random times and i will have to restart or log in/out of my computer to get it to even see that it is there. All fun stuff.If you are one of the people who bought and enjoyed this computer I envy you. After 342 days of the random problems this computer has caused me I am looking forward to the warranty being done so I can throw this machine away and buy something reliable.Before buying this computer look over the reviews and check to see how long any of them have had their computers up and running, I bet the vast majority were entranced (as I was) by initial impressions and would change their words should they be asked to re-evaluate.", "Date": "July 15, 2011"}, {"Title": "Disappointed", "Author": "Mark L. Schlappi", "ReviewID": "R3OBBC0R9WOARX", "Overall": "1.0", "Content": "It seemed to be a very nice laptop except I was not able to load my Garmin GPS software or Microsoft Office 2003.  Acer was no help and Garmin could not determine the problem(after spending about 2 hours with me), so I returned it and purchased a Toshiba R700 that seems even nicer and I was able to load all of my software with no problem.", "Date": "September 1, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003N3GGO0"}}