{"Reviews": [{"Title": "Good Student Computer", "Author": "sesroh_paint", "ReviewID": "R98OFJFARDYVJ", "Overall": "4.0", "Content": "I purchased this item from another place other than Amazon. It is a replacement for the previous laptop I owned. This is a good student computer, it runs fast, has a good clear picture, holds a charge well for a large screen. It would not be a good gaming computer. The drawback I have with it is that it only has 2 USB ports and I had to purchase an extra USB that will allow me to charge my iPhone, plug in my mouse receiver, and plug in my jump drive all at the same time.This computer is amazingly lightweight for its size and has a thin profile. Overall it is a good computer that is fairly portable for the student on the go.", "Date": "December 7, 2010"}, {"Title": "Gaming Laptop Review", "Author": "Christopher Waggoner", "ReviewID": "R45EIZ8P101QR", "Overall": "5.0", "Content": "I purchased this refurbished for 450 dollars. I already had a borrowed Satellite and loved it while I was using it. This Laptop here though, is great for gaming, video editing, Photoshop, MS Office. Below are the games I play on it just fine.Doom IIIF.E.A.R.Assassins Creed (All)RiftDungeons & Dragons OnlineWorld of WarcraftCrysisFarcry (All)Formula 1 RacingOblivion (All)EverquestSo as you can see, quite a few nice games. Not only that, it handles 30-45 minutes of video quite nicely in Adobe CS5, which CS5 does just fine on this computer. I'd recommend it over higher end computers because of the price.", "Date": "February 26, 2011"}, {"Title": "motherboard problem less than a year after purchase", "Author": "Drevma Mom", "ReviewID": "R19R7G9KWES4X8", "Overall": "1.0", "Content": "11 month old computer stopped working after a shutdown, was told the motherboard was broken.  To fix this, I would be in as far as the cost of the computer.  The tech told me not to buy a Toshiba next time.  He said his research showed this is a common problem.", "Date": "August 23, 2011"}, {"Title": "It's been a solid performer since December '09.", "Author": "Jonesy", "ReviewID": "RLLZEH5RK75V3", "Overall": "4.0", "Content": "Built, I think, in October that year.  After assembling a tower in July, loaned it to a friend for her business.  Had to borrow it back a few months ago while saving up for part to fix my tower.While installing Win7 SP1 got the 'revolving reboot' that took Microsoft a week to fix, so in a fit of impatience and frustration installed a Linux distro and never looked back, although I did keep the recovery partition.For what it was designed to be, a low to mid level desktop replacement, it's worked fine and better than it was advertised to be.  As others have noted, it's past its prime by a good few years, especially at this price.  Yet, in fairness, it's still a solid, if older and slower, performer.  I'm using mine for surfing, email, 720p vids playback and streaming, and playing a few DX9 games under Wine as well as some Linux games off Steam.  Works fine, bogs down a bit with too many things running at once, which is normal given specs.  Maxing mem to 8GB is a good idea, btw.  Oh, and the wireless works well, good antenna.  Beautiful display for the specs, no dead pixels.I've owned two Toshiba laptops and had no problems with the machines themselves, yet from working on a couple of dozen while helping out at a friend's computer store a few years back I'm aware of the spottiness of Toshiba support and the vagaries of lemons from manufacturing - problems I've also had with Dell, HP, and others.  Best solution I've found is to buy parts and fix it yourself - or have that done by someone you trust who can reliably do the work.  Most of the problems I saw were from PEBKAC.", "Date": "December 22, 2013"}, {"Title": "2 Years and Still Standing Strong!", "Author": "Amy T.", "ReviewID": "R2NK8BZZRIO51R", "Overall": "4.0", "Content": "This is another great Toshiba laptop, I hear others complaining about broken power cords or internal components. I think for the price this laptop does do what it was priced for, student work or basic computing. It has a wonderful 17.3 inch screen that is 16x9 resolution which is more than enough space to type in Word or view entire spreadsheets. The screen is highly glossy and reflects more than you would enjoy and that is a major downfall. The speakers are nothing to boast about either. Battery life will run you 2 hrs when watching internet videos off WiFi based connection. In the end this laptop is a good one its just too old and outdated to really impress or even keep up with an on the go lifestyle. If anything try out an ASUS or look for a decent priced Toshiba right here on Amazon.com or your local electronics stores. As always this and all computers could have been better.::Personal Experience::My laptop still works well for basic non-mobile tasks plus the charger never broke. I use it for Word and Adobe Photoshop and it doesn't lag or die out even when running Chrome, Photoshop, etc at the same time. If you don't get lucky with your purchase then I think just return it if possible if not do a little more careful work on your next purchase. Check where it's coming from, how its going to get there, what have others experienced, maybe don't buy the \"latest\" computer on the shelves and much more like that.::Personal Opinion::This computer is way past its buy mark so I cannot recommend buying this machine as it will not give you what you need anymore.", "Date": "July 3, 2012"}, {"Title": "Excellent laptop", "Author": "D", "ReviewID": "R36XKSGL3HERHJ", "Overall": "5.0", "Content": "I have had mine for 2 years, still problem free.It's a great laptop all around and the only complaint I can think of is that the webcam is little fuzzy. Would definantly reccommend this to others.", "Date": "June 21, 2012"}, {"Title": "Huge disappointment", "Author": "Toshiba fan", "ReviewID": "R1526SUNCYGNF1", "Overall": "1.0", "Content": "I have owned nothing but Toshiba laptops since my first purchase in 1989, and normally use them for five or six years before purchasing a new one.  They've always been trouble-free until I bought this one.  I should have known better--it was such a good price at Office Depot I fell for it.  Within weeks, when I was living in a foreign country, the computer started crashing.  Tech support gave me some lame things to try; I'm convinced the staff have no technical expertise and simply read what's written on the screen when they input the symptoms.  Four months after purchase, the HD died completely.  I was lucky to get warranty service in the foreign country, but the OS was in that language, which made it very difficult to get the computer functioning to my likes.  Once back in the U.S., I had a new HD installed but the warranty was finished by then.  Now, less than a year and a half later, the battery does not always charge, and it discharges very quickly even under mild use.I'll be buying another Toshiba when I get back home this summer, and hope that this one I have now was a lemon and not illustrative of the whole line these days.", "Date": "May 23, 2012"}, {"Title": "dead motherboard at 16 months", "Author": "V. Russell", "ReviewID": "R1GZ3MMQRJ0RKB", "Overall": "2.0", "Content": "This laptop ran very well when first purchased.  Other than a very bouncy keyboard I had no problems until Christmas day when I turned it on and got the \"black screen of death\"!  The power came on, the CD drive engaged but there was absolutely nothing from the hard drive.  I had it checked out to be told the motherboard crashed.  In order to repair I'm looking at about $400-$500.  Since you can get a new laptop for that or just a bit more I'm looking at buying new.  I have another toshiba laptop that is 3-4 years old and other than it running slow (compared to newer ones) it is still humming along fine.  This particular model, L675D-S7016, has died after only 16 months.  I am skeptical about buying Toshiba now.  I'm thinking, maybe, HP.", "Date": "January 12, 2012"}, {"Title": "Do not buy this laptop.", "Author": "Levi", "ReviewID": "R37MOYAAL9P1PA", "Overall": "1.0", "Content": "I bought this laptop for the 17inch screen. I am a photography student so therefore, I need a big screen to edit pictures on that is portable. I bought this laptop from Wal-Mart for around $800 after tax. I also bought a 2 year warranty along with it. This laptop was great for the first few months that I had it. Had no problems with it and than while I was at school, it crashed on me and I had to reset it to it's original settings. I lost pictures that I couldn't replace, assignments for school, notes, my photo editing software, everything. So I had to restore it, I put my photo editing program back on it. Another month passes and it tries to crash again. Luckly, my Brother got it back up and running without it deleting everything. Now, just a few days ago, I got a windows pop up that said I needed to replace or send it into the factory for repairs to the Hard Disk. Also, the card reader went out on it recently too. I have to use a USB driven card reader to upload my pictures to the computer now. I've not even had it a year and it's already falling apart on me. So a summary of all that's went wrong.-It's crashed on my once and I lost everything.-Crashed on me a second time, but I didn't lose everything, but I have to boot it up in safe mode all the time now.-Now the hard disk is screwed up and it's telling me I need to replace it or send it in for repairs.-Card reader went out on it recently.I've never had a computer that's the much of a piece of junk. Also, other things that I do not like about it. This thing attracts finger prints VERY easy. The plastic up around the speakers seems to be hollow and very thin sounding when you tap it. Very cheap construction. The keyboard is cheap and moves when you push it down in certain spots. Just a very cheap made computer. If I was able to take my purchase back, I would and would have spent the $800 on a better brand. I didn't think I would be laptop shopping less than a year after I just got a laptop. But as I say again, DO NOT BUY THIS LAPTOP!", "Date": "December 18, 2011"}, {"Title": "Don't even think about it if you value your money", "Author": "missjean", "ReviewID": "R2MGAW78XQAI1X", "Overall": "1.0", "Content": "Regardless of the make or model of Toshiba laptop you possess, good luck getting any action out of Toshiba customer no-service.  After a solid month of dealing with them I have concluded that they have no intention of honoring their agreement, made that the time I purchased my laptop to repair or replace my laptop, a Toshiba Satellite L675 D,should it be defective.  My screen started blinking and flashing less than one month after I purchased it.  After following Toshiba's instructions to do various things to address the situation, I started getting hard drive failure warnings, followed by the dreaded blue screen.  At that point, I dutifully shipped off my laptop to the repair depot.  After ten days turned into 3 weeks, I called to see why my machine was still in limbo.  I was informed that they had put it on hold for parts.  My subsequent phone inquiry elicited an excuse that a parts hold extends their repair time frame by 7 to 10 days.  The rep was actually counting off the days on his fingers.  When he got to 10 and realized that his excuse no longer held water, he apologized and said that he would e-mail someone to find out what the delay was, and he would \"call me back immediately.\"  Ten days later, after nothing had changed, I called again. I was informed by a supervisor that my laptop was put on a new hold on December the 5th, and that there was no other remedy available to me. Basically, if I didn't like it, tough.  there's no-one else to talk to, and if I complain to Toshiba corporate or post on a board like this one, they could care less.  I told him that he had lost a customer, and he basically kissed me off and hung up.  Please take this under consideration when you consider purchasing any Toshiba product.  I am going to.", "Date": "December 12, 2011"}, {"Title": "Great notebook at a competitive price", "Author": "Penny Lane", "ReviewID": "R23NKS4Q2HG84U", "Overall": "5.0", "Content": "This is a great buy!  The display is large for people who have vision problems; it is also handy for students who need to look at detailed graphics and images.  It's very light for its size and has proved to be very portable.  The resolution is fantastic - it has handled all graphics very well.  I got it at a steal and I'm very happy with it.", "Date": "July 30, 2011"}, {"Title": "Don't buy until Toshiba fixes their keyboard problems...", "Author": "marquetry", "ReviewID": "R2IQGGVNY3L1OX", "Overall": "1.0", "Content": "Excellent laptop, But, the keyboard skips letters typed and also inserts double letters of some typed. Typing is very frustrating.Toshiba hasn't fixed the problem in 6 months... they say they are on the verge of fixing it.There are a lot of people wishing they had never bought the computer... you may want to hold off until it is fixed or buy from a different brand.You can check out the forum on Toshiba's website to see what aggrivation they have caused their customers:[...]Think twice before buying...", "Date": "January 27, 2011"}, {"Title": "WARNING!  NEVER BUY A TOSHIBA LAPTOP!", "Author": "tomintechsupport", "ReviewID": "R3STDY5LS0HYTZ", "Overall": "1.0", "Content": "After owning several problem-free Compaq and Dell laptops over the past 15 years, I made the mistake of buying my first Toshiba, a Satellite L675D. I admit that I was enthralled by the 17\" display.  Big mistake. HUGE MISTAKE.  Less than four months after purchase, my wife opened the laptop one evening and the screen showed a crack in the upper right corner.  I sent the laptop to the Toshiba repair depot and they claim she accidently damaged it and they want $325 to repair it.  BTW, the entire system only cost $530 brand new.  According to Toshiba Customer Relations (and I quote) the \"accident was caused by opening the case too hard\".  I asked how that was even possible. Seriously, how do you open a laptop too hard? Toshiba said (and I quote), \"you could have pulled too hard\". If anyone from Toshiba is reading this, refer to T1-1174583 case # 110 331 001 320.  I swear these are exact quotes.  I currently own several Toshiba products, but after this experience I will never purchase another Toshiba product of any type in my lifetime. And now whenever I see someone even looking at a Toshiba laptop in Best Buy, HHGreg, WalMart, etc, I will warn them not to even consider Toshiba. Stick with manufacturers who stand behind their products. Toshiba is not one of them.", "Date": "April 6, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003ZPTQVG"}}