{"Reviews": [{"Title": "Nice, affordable laptop. Don't blame the computer if you can't use google.", "Author": "mtcentralfl", "ReviewID": "RU4GFFOTV04FW", "Overall": "5.0", "Content": "This is a great little laptop with plenty of power for most people. It's a shame the previous reviewer was too lazy to search google for a simple driver that would have fixed their printer problem(there's ALWAYS a driver...sometimes you just have to make an effort).I got this computer to use for simple word processing and web surfing, but found it to be much more capable than I expected. This Compaq has become my main computer for watching High Definition shows/movies from Netflix and Hulu. It plays HD so well that I wound up getting a VGA adapter so I could hook it up to the TV in my living room to watch downloaded itunes hd movies.Overall, this laptop is light, was very easy to set up, has surprisingly good battery life, a surprisingly powerful processor, and a BEAUTIFUL L.E.D. display screen.", "Date": "December 18, 2010"}, {"Title": "Worth Every Penny!", "Author": "Lotus Spirit", "ReviewID": "R7LV8LMPC2V0Q", "Overall": "5.0", "Content": "I bought this laptop as a gift for someone.  It's a great buy!  Very fast, seamless, easy to use and ultra quiet.  The Altec Lansing speakers are a great addition to this notebook.  I'm thinking of getting one for my son too!", "Date": "December 4, 2010"}, {"Title": "Good computer but cannot connect to HP Laserjet 4", "Author": "rag742", "ReviewID": "R27HORX4HAI4V8", "Overall": "3.0", "Content": "This is inexpensive fast computer.It comes with Window 7 Home edition preloaded. Unfortunately or ironically cannot connect to HP Laserjet 4 as the preloaded Window 7 does not have the driver. HP support is no help as they keep telling me the Window 7 has the built in driver for LaserJet 4 and it should connect. Window support again is no help. I have another Dell computer with window 7, and this window shows the laserjet 4 printer driver. I know my printer is old but this should not be a problem. Look like i got to buy another printer with the driver shown in window 7.", "Date": "August 1, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B003X8OFGQ"}}