{"Reviews": [{"Title": "i think this laptop is one of the most durable and stylish ones out there", "Author": "Hector Cancel \"siiix\"", "ReviewID": "R1EGG5P4G70M74", "Overall": "5.0", "Content": "not sure how its possible that the other persons laptop fell apart, im using this laptop my self and sold 4 of those in the last 6 month, in super durable, made out of light aluminium, it is built according to military standards, the only explanations i can see that someone tuke it apart and did not put the screws back in or worse it was drooped, i have no issues with keyboard or casing what so ever , in fact i love the keyboard, its kinda different , much easier to type then most laptops, they keys are flat and very well structured. other than that operating systems run super smooth both XP or windows7, screan is super bright and sharp, and to top it off it has a real video card not those flimsy Intel cheaps, it runs even games nicely, seriously cant say anything bad about this laptop", "Date": "November 19, 2010"}, {"Title": "Excellent build quality", "Author": "Max", "ReviewID": "RH3GROOB9N4TA", "Overall": "5.0", "Content": "Let me first say, this is one amazing laptop. Before I got this, I was convinced that the IBM T60 was the epitome of durability and build quality. I begrudgingly admit that this elitebook has it beat. There is no flex in the chassis of this laptop, and no keyboard flex. The keyboard strokes feel solid and full, and the keyboard light is as easy to use as the ThinkLight. The lid is built to withstand 300 pounds of pressure, and this model does have the spill-through keyboard/chassis. I really can't say enough about this laptop, it is that good. I wish they had an IPS screen option, but even the TFT screen on this is better than the T430 I looked at. If you are on the fence, just buy it!", "Date": "December 20, 2012"}, {"Title": "Have to Revise my Rating to 5 Stars", "Author": "OBX Ron", "ReviewID": "R2FPXZG4O663HR", "Overall": "5.0", "Content": "This laptop runs cool and fast.  Expected 2MB of RAM and got 4MB. Unlike another review I like the keys.......different from 7 yr old Dell 6400 I am replacing but nice.  The more I use this computer the better I like it.  Originally I commented on the poor graphics but with several updates and tweaks to the graphics settings I now love the graphics.  This is a solid well built machine and much more substantial in build quality than my old Dell laptop.Additional info:  Good packaging, reasonable shipping charges and fast response from Gogetcomputers.com vendor via AmazonLaptop was billed as \"mint\" condition and it was................very minor cosmetic issues on the case that I would have probably done myself anyway.............This is a great seller and would definitely recommend to others and would go back to myself.The issue with the NIC internet connection mentioned by others may be a non issue.............after noticing that the computer would not autodetect when rebooted I went on line and found various suggestions.  I cancelled the wireless ip address in the cmd prompt and renewed it while connected to my router and selected \" do this automatically from now on\".............worked like a charm.NOW we will wait to see how this fantastic computer survives for the future", "Date": "March 25, 2014"}, {"Title": "Different product than announced and not allowed to enter password", "Author": "Juan Miguel Aquino Cassanello", "ReviewID": "R1IJNWXR0DW68H", "Overall": "1.0", "Content": "The order came to me after a long period but the biggest problem is that they sold me as the ad says Windows 7 but it came with Windows XP.To top the notebook asks passcode, which was not provided. I am requesting the password by mail, because until now I can not sign in", "Date": "April 25, 2014"}, {"Title": "what a pain.", "Author": "cactus", "ReviewID": "R2KSMPUPD8OMDT", "Overall": "2.0", "Content": "my opinion f.w.i.w...it would be a decent machine except for the wifi card issues. go ahead and look 'em up, i'll wait....yeah. the machine only takes a half-height card and due to the bios white-list, it only takes a few of those. some say that updating the bios will mitigate this issue, some don't. whatever. it's a pain that i've only had with this machine and i build laptops very often. i heard thinkpads had this issue, but i've built many thinkpads and i've never experienced it (maybe luck?).also, i don't care for the keyboard. compared to the hp6930p keyboard i'm using right now, the one on the 8440p seems cheap and the keys wobble.it's just a machine i am not impressed with and i would rather spend my money on a machine with less headaches.just my opinion.", "Date": "March 24, 2014"}, {"Title": "bad book", "Author": "Coffeette", "ReviewID": "R2BMNR1RJNO77B", "Overall": "1.0", "Content": "It is consistently freezing and does not do it's job, it is ok for little stuff like a kids first computer, but not for an adult!!!!", "Date": "March 3, 2014"}, {"Title": "Not good at all", "Author": "Harry Stuhldreher", "ReviewID": "R2QWF12UL4N726", "Overall": "2.0", "Content": "This laptop is a piece of junk.  This is the same laptop provided to me by my employer for my daily work.  For the last 12 years, I had Lenovo Thinkpad's and they were great.  Then last year I got upgraded to the HP 8440p.Right off the bat, there were issues with the quality and build of the machine.  The \"8\" key on the keyboard was broken.  If I hit that key with a certain force and a certain angle, it would pop off.  Three of the four rubber pads at the bottom of the laptop that are supposed to keep it from sliding on smooth surfaces have fallen off so any time I'm typing, the laptop is moving all over the desk.  On my Thinkpad, I could get ~5 hours of battery life by being aggressive with my power saver mode and dimming the screen; the HP barely gets me 3 hours on a new battery.  I've had to purchase 2 new batteries (in addition to the original) in a one year span to maintain a measly 3 hours battery life with the most aggressive power saving options available.  I've also had an intermittent issue wit the screen where sometimes it would not turn on coming out of sleep or hibernation.  The only way to recover from this issue was through a hard reboot.  The IT guys at my company could never figure out this problem.Performance wise, the machine is fine for the things that I do: e-mail and Microsoft Office applications.I recently got a new Thinkpad machine to replace this one and life is so much better.  Save yourself the trouble and go buy a better laptop.  HP makes great printers (I still have my LaserJet IIP from 1989) but they sure don't know how to make a good laptop.", "Date": "December 26, 2012"}, {"Title": "This is a turd", "Author": "jake789", "ReviewID": "R3Q7KHTZ8NWQQW", "Overall": "1.0", "Content": "I normally don't write reviews, but this laptop is so crappy I feel I need to warn others. My work only uses HP laptops. I recieved the 8440p as an upgrade for my HP NC6400. I looked forward to the speed and hdd increase. But this new laptop is crap.1. The bezel around the lcd is not very secure. It feels loose and cheap. I can pull it slightly apart at the seam.2. The esc key fell off after 2 weeks and can't be reattached. It still works when I press in the open area.3. The express card slot stinks. Its too big so I had to buy adapters for my cards to fill the space but it makes them very flimsy.4. After 1 month of use the hdd stopped working and is making crackling sounds.I'm going to send this in to IT and request a different model.The only thing I like about it is the keyboard light that pops out of the top of the lcd is very cool when working in a dark environment.", "Date": "November 4, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "2.4 GHz Intel Core i5-520M, 2 GB DDR3, 250 GB HDD, Windows 7 pro 332-bit\nWith DisplayPort, you get sharper, deeper images compared to other display connector technology\nWith HP DuraCase, which includes a magnesium display enclosure and magnesium alloy chassis, you get a durable device that has been tested at extreme temperatures\nHP QuickLook 3 provides read and write capability of email, calendar, task and contact information in seconds at the touch of a button, without having to boot up\nHP Power Assistant measures and logs reported platform energy usage and delivers comprehensive reporting (time, watts, energy cost and carbon footprint)", "Name": "Hewlett Packard 8440P I5-520M 2.4G2 GB 250 GB 14IN W7P/XPP WZ227UT#ABA", "ImgURL": "http://ecx.images-amazon.com/images/I/41HGa3niRcL._SY300_.jpg", "ProductID": "B003LYVVAK"}}