{"Reviews": [{"Title": "Pretty Happy", "Author": "Imperial Book Man", "ReviewID": "R3Q80WYFHXZOQY", "Overall": "4.0", "Content": "I purchased this notebook so I could have something to sit around in the living room, coffee shop and/or occasional work trip. I am generally a MAC person, but this computer has worked pretty well for me, since I sometimes want to use a PC and my work uses PC's.If you don't want an iPad, do want a \"real\" keyboard, but also think that netbooks are too small (especially the keyboard) and limited (smaller hard drive), then this is a good size. It's thin enough to slip in a back pack or carry on, and still enjoy a vivid screen, yet not so big as a 17 inch screen, that it should be considered a desktop.Since I am a writer (at home and work), I like the \"regular\" sized keyboard, although the touch \"mouse\" pad is too close to the space bar that sometimes my thumb hits it and moves the cursor.The computer boots up pretty quick, and if it sleeps or the battery looses power, it seems to restore it self pretty quickly, which I like very much.Since I am a MAC person, there are several things I don't like about running MS products, including: OUTLOOK DID NOT COME WITH THE VERSION OF MS \"OFFICE\" THAT I BOUGHT (but then I just downloaded Mozilla Thunderbird and am just fine not paying more to MS thank you very much). It is especially annoying that Outlook does not come with the computer, since such a solid email/calendar program come standard with a MAC. Also, there are way more software notifications and \"reminders\" that constantly pop up that are annoying.I do like the way Windows now organizes \"Libraries\" of \"Documents,\" \"Pictures,\" etc., very much like a MAC (no doubt, that's where MS got the idea).My notebook had an HDMI output, which is great when you want to hook it up to a TV at home or at a hotel on a business trip, if your hotel has a HD tv with HDMI. This latter feature is great, since that means you can watch Netflix in your hotel room on the road.The wifi works great. It was pretty easy to get it up and running for web surfing at home and in coffee shops.There's more I like, but the size and functionality have been great: Not to big, not to small, great screen, plenty of HD space for general purposes, plenty of speed for skype etc., just very pleased.", "Date": "November 29, 2010"}, {"Title": "Who at HP added those stupid buttons on the left side?", "Author": "W. Fritz", "ReviewID": "R17N6YZ7MN24MB", "Overall": "2.0", "Content": "HP generally puts out some very nice products.  This G62 is very fast, and I love Win7 over Vista.BUT... and a BIG BUT...There are new keys added to the left side of the keyboard... application keys...  say you use CTRL a lot... your little finger automatically reaches for the furthests most bottom left key.. you hit it without out looking (like most good typists)...BOOM, the Calculator pops up!!!  Who the heck put THAT button there?Same w/ CAPS LOCK... and TAB... and Shift etc.  The only standard location key they left alone is the ESC key.  Personally, I use CTRL and CAPS and TAB a whole heck of a lot more than the ESC key.Nice response to the keyboard, nice monitor, fast processor, lovely Win7BUT DANG, who was the non-genius who put those new keys on the far left hand side??My suggestion:  Find a different HP (or other) laptop, where the keyboard is standard.", "Date": "March 17, 2011"}, {"Title": "not the good one", "Author": "raj", "ReviewID": "R1HWARYO5FUT2P", "Overall": "1.0", "Content": "I bought it in 2010 and it does not work well from the very beginning. Never buy this one. It totally sucks. Harddisk gone in more than a year and I do not recommend it for anyone.", "Date": "August 28, 2012"}, {"Title": "Bad motherboard", "Author": "mt_buckeye", "ReviewID": "RQJAWTERPM8V7", "Overall": "2.0", "Content": "Good computer until the Motherboard died at 16 months.  Costs 200.00 plus labor so the computer is shot.  I will likely buy a different brand.", "Date": "December 7, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel CoreTM i3-350M 2.26GHz processor\n4GB DDR3 memory expandable to 8GB /  Multiformat DVD±RW/CD-RW drive with double-layer support /15.6\" LED HD widescreen Display / 250GB Serial ATA HD\nIntel HD graphics / Built-in HP webcam & microphone / 5-in-1 media reader /3 USB ports\n802.11b/g/n WLAN / Built-in 10/100Base-T Ethernet LAN /Built-in 10/100Base-T Ethernet LAN / 5.5 lbs. & 1.4\" thin / 5 hours & 15 minutes\nTextured HP Imprint finish / Windows 7 Home Premium 64-bit", "Name": "HP G62-234DX Laptop Notebook / Intel Core i3-350M Processor / 15.6\" LED HD Display / 4GB DDR3 Memory / 250GB HD / Multiformat DVD±RW/CD-RW /Built-in HP Webcam & Microphone /Microsoft Windows 7 Home Premium Edition 64-bit / Biscotti", "ImgURL": "http://ecx.images-amazon.com/images/I/313QSarQBCL._SX300_.jpg", "ProductID": "B003YYNEQ6"}}