{"Reviews": [{"Title": "Fantastic", "Author": "Benjamin D. Kittrell \"Ben\"", "ReviewID": "RAB3FY436RZ5V", "Overall": "5.0", "Content": "This laptop worked perfectly right out of the box! I had absolutely no problems setting this machine up or in getting it to connect to my network. It does everything that it was advertised as being able to do. Even the built in webcam works great. If there is even a single negative , it's that it comes with a lot of superfluous HP software. Other than that, I am incredibly pleased with this laptop.", "Date": "January 28, 2010"}, {"Title": "Great laptop for everyday use - battery could be longer lasting", "Author": "Amazon Customer", "ReviewID": "R33YRNW5RWOJV2", "Overall": "5.0", "Content": "Overall, I'm very happy with this laptop.  Works great, is fast, clear picture, and love the Windows 7 vs. my old Vista.  Only gripe is the battery lasts under 2 hours with normal use - not the 3.75 hours listed.  We keep ours plugged in mostly, and use on the go as necessary.  Would buy similar one again, just upgrade the battery.", "Date": "February 1, 2010"}, {"Title": "Internal microphone does not work; HP says it's a known problem with entire G60 series. Do not buy!", "Author": "Fog Belt", "ReviewID": "R17CIECMMGMR2G", "Overall": "1.0", "Content": "The internal microphone is broken, and not just in the one I bought. According to HP, it's broken in the entire G60 series of laptops. I've had mine for one week; I discovered the microphone was broken on the second day, and I've been talking with HP's case managers about my options. Looks like I'm going to return it, because there's no fix in the works at HP. And who needs a laptop that you can't use for videoconferencing, Skype, Gmail Videochat, and so on? It's a shame, too, because the laptop is otherwise great.Why is HP still selling this product when they know it's dysfunctional?", "Date": "March 13, 2010"}, {"Title": "There is a fix for the mic problem!", "Author": "C. Pepe", "ReviewID": "RAHTSTRZFZ91Y", "Overall": "5.0", "Content": "I too was very frustrated when I purchased this laptop and discovered an issue with the mic. However, HP has put out a downloadable software driver and I installed it and it works fine now!!! My wife uses skype and messanger. As for the rest of the laptop....we are very happy with it. The webcam has fantastic clarity even in not so good lighting. So, ignore the previous gripes with the internal mic. You may purchase the laptop with the defective driver but you can download the new one in two minutes.", "Date": "June 3, 2010"}, {"Title": "Awesome!! HP Notebook", "Author": "M. Webster", "ReviewID": "R2IB7MF67RGMUM", "Overall": "5.0", "Content": "I have only had this laptop for a week and so far it has been working very nicely.  I have always been an HP fan so I love it even more. I love the look and feel.  The graphics is wonderful and the brightview screen enhances the colors.  All the features makes it very exciting to use and I love the fact that it has a built in webcam and wireless network ready.  I have also notice that it is not a noisy machine in which is a plus.....thanks its wonderful!", "Date": "February 10, 2010"}, {"Title": "HP laptops are plagued with complications stemming from inadequate heat sinks", "Author": "Tell It Like It Is \"music lover\"", "ReviewID": "R3DC8JRGTM5UTN", "Overall": "1.0", "Content": "The graphics processor on this and many other HP laptop models runs so hot that over time it actually melts the low grade solder HP uses to construct these units.  This causes the graphics processor to lose electrical connectivity with the mother board.  The unit powers up (lights go on) but the screen stays totally black.  There is a big class action lawsuit in the formative stages regarding this very issue.  When you examine the motherboard from this model (and every other HP laptop since the Compaq/HP merger) one thing is striking...the motherboard thickness is about half that of any Sony VAIO model or Toshiba unit.  HP engineers also elected to use a single heat sink to cool both the GPU and the CPU.  The fix for this endemic HP laptop problem involves either reheating the GPU to readhere the solder to the motherboard or, better, removing the GPU, cleaning up the low grade solder, and resoldering the GPU with a higher grade solder that will not degrade at GPU operating temps.  If the high temps and inadequate heat sinking has caused mother board warpage, you're looking at a new motherboard.  When the computer is reassembled copper shims should be fabricated to place between the GPU, the CPU, and the heat sink.  Use thermal conductive paste also.  There are a number of YouTube videos that go through all this and the fixes in detail.In summary, HP laptops seem to be steadily declining in quality.  This is due to a combination of poor engineering and the use of inadequate quality materials.  A laptop should last at least 5 years.  These current production HP laptops often fail between one and two years.  That is, right after the factory warranty runs out.  Sony and Toshiba don't suffer from these issues near as often as HP, Dell, and even Apple does.  The few dollars HP saves in producing these laptops costs the consumer hundreds down the road.  Cost to fix the above problems ranges from $125 + shipping to $400 plus.  Thus these repairs may not make economical sense.  A new laptop purchase is mandated.  The only vote the consumer has is with his/her wallet.  Until HP fixes this endemic problem, consider purchasing your laptop from a different manufacturer.", "Date": "May 13, 2010"}, {"Title": "How to get around the microphone problem", "Author": "Chaz the SemiGeek", "ReviewID": "R1556E2JYHTQ7V", "Overall": "4.0", "Content": "I have this computer, and there is a way around the built in microphone problem.  Use a USB microphone headset.  That's what I do, and it works fine.I've tested the standard microphone port, and it is poor quality like the other reviewers have said.  I recorded my voice with it, and the sound was fuzzy and distorted.  I could make out the words, but the quality was unacceptable, and would drive you crazy if you had to use it all the time.  Shame on HP for that.  That's why I took one star off of review; it should work properly.However, the laptop is thus far, to me, a 5 star laptop in every other way.  And I have found that if I use my Logitech USB headset (which cost about $35.00) to record my own voice, the sound quality is excellent.  I've also used the USB microphone to train the voice recognition feature in Windows 7.  The results were excellent.I don't use Voip or videoconferencing, like the folks who have complained about the built in mic, but if you can use those features with a USB mic, I don't see why it wouldn't work.  Perhaps someone who uses those features could try it out and report back here.I paid $425.00 for the laptop, at Staples about a month ago.  With coupons, I've seen the price lately as low as $400.  At that price, it seems like a good deal, if all else continues to function as it should.  So far I'm happy with it.If your only concern is the mic, but you could live with using a USB mic (which I've read tend to give better results generally), then you may want to consider this model.", "Date": "May 25, 2010"}, {"Title": "Stay Away", "Author": "Eugene W. Bartholomew \"Gene Bartholomew\"", "ReviewID": "R37Z33F10X9DXD", "Overall": "1.0", "Content": "HP G0 Notebook Bought this 30 days ago from Staples. This product has been a great disappointment. Nothing works properly and never did. Sometimes it won't start at all, it is overloaded with junk programs you don't want or need. The mouse and buttons are too sensitive. This morning it died. Probably the worst piece of junk I've ever bought in my life. Beginning to think the HP name is garbage.Now I see some recent reviews with similar issues, something is wrong with these laptops, but like the Toyota's, they will probably ignore it, corporate management these days sucks, what happened to standing behind your products?Just got off the phone with HP, the hard drive is dead, they are sending me a new one, but it only lasted 30 days, and the issues others have with it not starting, etc are probably still there....update 3/09/10-- now it has a new hard drive, about 14,000 updates and it will not operate all devices, sometime between last night and today it turned them off, wireless doesn't function, I want to return it and Staples is giving me BS *** DO NOT BUY ANYTHING FROM STAPLES, they do not stand behind their products, they give a 14 day cover unless you pay about as much as 2 laptops for additional coverage, AND THAT IS LISTED IN FINE PRINT ON THE BACK OF YOUR RECEIPT, THEY DO NOT TELL YOU UP FRONT.I have spent 40+ hours of my personal time trying in good faith to get this junk running, and what do I get from Staples?? lip service.Not to mention tech support for HP is horrible, some are not IT people, they are reading from a guide and it takes hours, I have lost probably 48 hours just dealing with this, oh, and I'm typing this on my old PC, because my brand new HP will not function as it should.It is without a doubt the biggest piece of garbage I have ever bought in my life and I have never had so many problems trying to get assistance with this problem.UPDATE 5/06/11--  It now blew its mother board after a year of so so performance, slow starts, re starts, shutting off for no reason, etc etc, put HP motherboard problems in your search, there is supposed to be a class action suit going, I was told HP knew they had motherboard issues, I will never buy another HP product and urge you not to, as a nation, we must be wiser consumers ( like never buying from BP again). It's the only power we have.", "Date": "March 19, 2010"}, {"Title": "AVOID this model--extremely bad microphone!", "Author": "Mookie R.", "ReviewID": "R16GSJGQ23GA3S", "Overall": "1.0", "Content": "I bought the HP G60-630us and returned it a few days later. It has one HUGE and fatal flaw: the built-in microphone is EXTREMELY bad. If you are absolutely sure you will never want to use this laptop for anything involving the microphone (like video chat) then you will probably be happy with this purchase. But if there is a sliver of a chance you'll want to use the microphone at some point, then AVOID, AVOID AVOID.I was happy with this model the first few days I had it. I liked the look, the feel, and the fast response. It really suited my basic needs.  Then I tried to Skype (live video chat) with family members. They could barely hear me and could not understand what I was saying due to the excessive backround noise, inceassant audio drop-out, and fluctuating levels in my microphone. It was horrible. I had to write what I wanted to say on Skype; this microphone is literally unusable.I spent a long time trying to readjust the microphone settings but nothing helped. I tried an external mic and it was just as bad.I took the laptop in to the place where I purchased it to see if their tech staff could help. A day later the tech called me with bad news. There was nothing he could to to fix this mic. He also said he tested two other G60-630us units in the store and found the same exact problem. He tested two additional HP models in the \"G\" line, and found the microphone problem in those models, too.His conclusion: Likely ALL the HP \"G\" models have this horrible built-in microphone problem and there's not a way to fix it.He did test some other HP models besides those in the \"G\" series. He reports microphones in the HP \"D\" series (like the DV6-2150us, which, unlike the G60-630us, uses a digital microphone) worked just fine. I tested the microphone on the \"D\" unit display model and was pleased with the result. I will likely buy that \"D\" line model as my replacement for this \"G\" model.In conclusion: AVOID, AVOID, AVOID the HP G60-630us and it's ultra-horrible built-in microphone. To be safe, avoid buying any HP with a \"G\" in the model number unless you test the microphone first.", "Date": "March 6, 2010"}, {"Title": "Defective. Not just a fluke...*ALL* are defective", "Author": "Goody2Shz \"Donna\"", "ReviewID": "R2TLOMXN8FHKLZ", "Overall": "1.0", "Content": "Actually, I don't feel right giving this product ANY stars!The internal microphone and external microphone jack do not work. If you purchase this laptop with the expectation to be able to do video calls, forget it. The recipient of your call won't be able to hear you.DON'T BUY!!Also, you should know that HP is aware of the problem, promising a fix \"any day now\"...however, they have been making that promise for months and months.", "Date": "February 24, 2010"}, {"Title": "So far so good...", "Author": "Katrina L. Hughes", "ReviewID": "R26OPXQLIIGBHQ", "Overall": "4.0", "Content": "I purchased this after having two computers die in one week! I was able to find this one on sale locally, a bit less expensive than Amazon and available immediately.Overall I am happy with my purchase. Good size and speed. Having said that, my computing needs are basic. Mainly I use it for on-line research, e-mail, and school. When I realized that I would have to upgrade OS from Vista to Windows 7, I was a bit worried about compatibility issues but I have easily found all the driver updates I need online. I have been happily surprised with Windows 7 overall. It does not seem to be much different from Vista and has some cool visual upgrades. I gave a four star rating because my other computers were made by HP and in my opinion died before their time. So far so good...", "Date": "February 2, 2010"}, {"Title": "1 star for HP  5 stars for Amazon", "Author": "Fred", "ReviewID": "R1UB88ZBAVYUUV", "Overall": "1.0", "Content": "From the minute I got this laptop I knew that something was wrong. VERY slow progressed to intermittent freezing, random screen resets among other things. The return process through Amazon was a snap and within 4 hours of them having received it back through UPS I had an email confirming a refund. This laptop was for my wife. Instead of another laptop, we did a \"180\" and got an iMac which she loves. Hated the HP but continue to love Amazon", "Date": "July 19, 2010"}, {"Title": "Mad about the Mic Issue - No fix", "Author": "Shanelle", "ReviewID": "R1NRS93COHLN0P", "Overall": "2.0", "Content": "I purchased this laptop yesterday and have contacted HP 5 times already in attempt to fix the mic issue to no avail.  After 6 attempts to reinstall the drivers they asked me to perform a system or factory restore. How is a system or factory restore suppose to fix the mic issue when the computer is only 1 day old?  I am extremely frustrated that the representatives don't have better knowledge of this issue and a fix! Moreover, I only purchased this laptop out of a desperate measures (my regular laptop is being repaired and I needed something in the interim to make some important deadlines) and really can't afford it. If I return it due to this stupid mic issue, I'm going to be subjected to a 15% restocking fee - grr! Although it may not be important to some I donot want to spend money on a laptop that has issues out of the box... if it was refurbished perhaps I could live with it. I can only imagine the technical problems I'm going to experience in the future.", "Date": "June 14, 2010"}, {"Title": "Awesome Laptop for the $$$$", "Author": "Terri G. from PA", "ReviewID": "R3LJTIU28A9A5H", "Overall": "5.0", "Content": "This laptop is an AWESOME deal for the money. After my desktop crashed due to mulitple viruses, I needed something to replace it in a hurry. Not having tons of spare funds laying around, I needed to find something quick but with quality and reasonably priced....this laptop fits the bill!  Although I purchased mine from Staples because it was on sale this week, I would recommend shopping through Amazon any time. As for the laptop, he is sleek, has a number keypad, set up was a breeze, basically you plug it in and it did everything else for you.  I did purchase the logitech MK300 wireless keyboard and mouse just because I will never get used to typing extensive documents on a laptop keyboard, (I'm a little old school).  But even getting the laptop to recognize the accessories such as wireless keyboard, mouse, printer and magic jack was as I said plug it in and they were all ready to go!  It comes with the Norton 360 60 day trial, but PLEASE if you get no other accessories....puchase Norton 360 anti-virus for when your trial is expired.The only con I can see about the laptop is that the color resolution on the screen is not as bright and vivid as some of the other laptops I viewed in the store during the purchase, but they all carried a price ticket of $900 or more so..... if you are on a budget and looking for a great laptop that is high quality and reasonably priced, I really don't think you would be sorry by purchasing this one.  I would definitely recommend this one to anyone who wants to spend approximately $500.", "Date": "February 26, 2010"}, {"Title": "It was good but then....", "Author": "Anonymous buyer :)", "ReviewID": "R49XHVFA6JFMS", "Overall": "3.0", "Content": "I received this laptop as a present from my mother for my birthday in february 2010. It was a great laptop but it developed conspros:windows 7,wide screen,good for watching movies,three usb slots and built in camera which was also good.Runs pretty fast and is easy to function with.cons: hard to move around with,not much accessories for this laptop like skins,microphone hardly works.If you are on skype the person mostly hears static.After a while, it starts to heat up but not intensively but it does make noise but its easy to ignore. Gets scratch really easily (or maybe its just the way i treat it) and also smudges easily.Now that was the year i bought it. Lately the video drive has crashed 4 times and it causes my computer to have to restart from a earlier time. The battery is terrible. Its been a year and I have to replace it and now the charger is making weird crackling sounds and when I plug it in my computer shuts off.I would recommend something else like maybe an acer or sony vaio because they last longer.", "Date": "November 10, 2010"}, {"Title": "Good deal for the bargain hunter", "Author": "S. Chapple \"SamIam\"", "ReviewID": "R2EXJGLNK8MQF", "Overall": "5.0", "Content": "The mic and video issues reported are no longer an issue (mine worked fine right out of the box with no additional drivers required) and you will find a excellent deal in this package.  Get them while they last.", "Date": "June 24, 2010"}, {"Title": "Amazing", "Author": "Angela M. Stemen", "ReviewID": "RAIYCHNNES2WZ", "Overall": "5.0", "Content": "I love this laptop. I'm actually using it right now. I've had it for 3 days only though.. I bought mine at Office Depot and got it for 469.99 so I'd check other places first.. like I did. :)", "Date": "May 11, 2010"}, {"Title": "Nice, solid laptop computer", "Author": "DAVID OKEEFE", "ReviewID": "R601FOR1NG11N", "Overall": "4.0", "Content": "After 5 months of daily use, this seems to be a good product. I would be more enthusiastic if I hadn't been burned shortly after the end of the warranty of other laptops (notably from Toshiba). Everything works. The fit and finish are great. I can't speak to the microphone issues others have mentioned as I use a USB headset (highly recommended). The display is good. The speakers are weak. The HP support software is occasionally annoying. Whatever. It's a business laptop. It's fairly light weight. It works. The price ($550) was reasonable. If it keeps working for two full years, I'll be satisfied.UPDATE: Still working great. BTW, the internal mic is perfectly fine, although the quality of sound for VoIP calls is much better with a USB headset. I've bought 2 more of these laptops for my company.", "Date": "April 2, 2010"}, {"Title": "Flaws to Be Aware Of", "Author": "sunburst4000atYaWho", "ReviewID": "R1QG2RT2JTZRDK", "Overall": "3.0", "Content": "Be aware of the complaints of others regarding this item:  The internal microphone usually doesn't work, the batteries don't last very long (both short work time and failure complaints), the painted characters on the keyboard keys wear off quickly, and the major problem of over-heating.  The over-heating is usually because the fan intake is placed on the bottom of the laptop ... and sucks in MUCH dust.  The fan is buried deep inside the laptop and is EXTREMELY difficult to remove and clean out (see YouTube videos on cleaning and replacing the fan).  I was able to clean the fan very well, without dis-assembly, by using a shop vacuum placed against the fan's air intake port; be sure to vacuum ONLY the intake port located on the bottom of the laptop.  A Best Buy's \"Geek Squad\" representative also told me that the display's backlight fails frequently and it is cheaper replace the entire display because replacing the backlight it too labor-intensive.", "Date": "March 22, 2011"}, {"Title": "Good Deal", "Author": "B. Hanson \"boboann\"", "ReviewID": "R3EWGPUZ505NXN", "Overall": "5.0", "Content": "I am so enjoying my hp laptop. I got it at a good price. Would recommend this laptop for anyone.", "Date": "August 29, 2010"}, {"Title": "Amazon Scores Again", "Author": "J. Jones \"griffin cd fan\"", "ReviewID": "R3ENJ36G5LKD0E", "Overall": "5.0", "Content": "Again this was a gift to our Grandson for an addition to his music career.  He thinks this  is great.", "Date": "July 9, 2010"}, {"Title": "absolutely amazing", "Author": "naarmo", "ReviewID": "R1X5HECU8MPXAW", "Overall": "5.0", "Content": "i had doubts about this laptop so i kept on emailing the seller about my doubts on deciding i bought this ,it is amazing everything you could possibly want and need is in this laptop ,hats of to hp", "Date": "July 9, 2010"}, {"Title": "Best Product For The Price!", "Author": "Gustav Graves \"Kung Fu Movie Expert\"", "ReviewID": "R3A0QEQV8ZZEVA", "Overall": "5.0", "Content": "This is probably the best laptop you will find under $600. I was searching around for a laptop for about a week and it came down to a hp from best buy or a acer from staples so i went for the acer because it had a bigger hd and it wasn't refurbished. I got to Staples and they had this, the acer, and a compaq. For $50 dollars i picked this up to get the best of both worlds from the acer and Compaq. This comes with lightscribe, webcam, 320gb hd, mic, where as if you get an acer or just a compaq u can't get all those features. You can't beat this for $450i didn't plan on using a mic so if it doesn't work i won't be upset, but i just read about a driver to fix that problem!", "Date": "June 6, 2010"}, {"Title": "Great Laptop - Worth Money", "Author": "Vidhyashankar Eswaran \"evs\"", "ReviewID": "R23J568SZWUVKO", "Overall": "5.0", "Content": "Its been nearly 3 months since I bough this laptop and this laptop is just working fine and it has exceeded my expectation. I have been planning to buy a new laptop for months and finally I settled for this one. My main purpose for buying laptop is for internet browsing, watching movies, music and playing games... This laptop satisfies all these purpose more than what I had expected.. Certainly this laptop is worth the money and I would definitely suggest this laptop for basic multimedia computing...Pros-1) The laptop speakers are awesome. The music is very clear.2) The HD screen is a next plus.3) Battery stays nearly for 4 hours.4) This laptop comes with windows 7 and windows 7 media center is simply superb.Cons-1) The fan makes little noise when any antivirus software or any updates from HP or windows takes place on the laptop. For the money and the Intel T4400 core duo processor this is expected.", "Date": "April 25, 2010"}, {"Title": "My Black Beauty", "Author": "Cindy", "ReviewID": "R2DBVZ0J6V1KDQ", "Overall": "5.0", "Content": "I got the HP G60-630US 15.6-Inch Laptop in February. It was a gift. It works great. I love Windows 7...coming from XP. Got rid of some of the pre-installed software and added my favs. Battery lasts a little over 2 hours, which is fine.  Webcam and mic work great. Screen comparable to desktop. Very pleased!", "Date": "April 7, 2010"}, {"Title": "One of the best Laptop for the price", "Author": "Luis Escribano", "ReviewID": "R30UPB0FPLQNH4", "Overall": "5.0", "Content": "I bought this laptop a month ago and so far is one of the best laptop I had, everything works perfectly. If you are on a budget and looking for a great laptop this is high quality and reasonably price. I would definitely recommend this one to anyone who wants to spend less than $500. I took it for a trip to Spain and it was wonderful, the only negative thing is that the battery last only for a couple hours. Overall, I'm very happy with this laptop. Works great, is fast, clear picture, perfect size, nice weight and love it.", "Date": "April 2, 2010"}, {"Title": "Excellent buy!", "Author": "Ellen R. Wagner \"PotterFan\"", "ReviewID": "R3DSDJMLQNHRKB", "Overall": "5.0", "Content": "This is the perfect laptop for home use.  Super easy to use--hooks up to wireless very easily and has an excellent screen for watching TV shows and movies.", "Date": "March 29, 2010"}, {"Title": "Like it", "Author": "Dr. George Fadl", "ReviewID": "R5VH4WF9UD047", "Overall": "5.0", "Content": "Everything working fine as expected. Only issue is the weight which I knew about, so its not a true negative. For that price, I am totally satisfied.", "Date": "March 2, 2010"}, {"Title": "Great Laptop Computer", "Author": "Janice Rademacher", "ReviewID": "R2R3VGM3LOB2D1", "Overall": "5.0", "Content": "This is an awesome little notebook..works wonderful and so far have had NO problems!  I would certainly recommend it to folks.", "Date": "February 24, 2010"}, {"Title": "HP sells WORST laptops", "Author": "sang", "ReviewID": "R1VOMYR0AWV39R", "Overall": "1.0", "Content": "HP has the WORST battery life. Purchase this laptop and in a year, its battery is now dead. The remaining option is either buy again similar useless battery or throw away laptop. Will NEVER buy HP laptops even by mistake again.Recommending not to buy HP again, as I had similar battery and heating issue with other HP laptop , DV4 1125NR", "Date": "January 20, 2011"}, {"Title": "Amazing", "Author": "ME!!!", "ReviewID": "R1UARPN8QWHXK", "Overall": "4.0", "Content": "I got one this computer a few months ago and i love it. Although i am having  problem with it .....it wont let me open the camera and it wont let me change the desktop background. But overall it is a really good laptop and i would defiantly recommend it!!", "Date": "February 27, 2011"}, {"Title": "Powerfull pc", "Author": "gativelo", "ReviewID": "R37CVHDUW9J48G", "Overall": "5.0", "Content": "Good batt, fast, stable, looks very nice. I like it. Only need to add bluetooth to be ones of the best laptop pc 15\", big but beauty and funtional. I recommend it", "Date": "August 24, 2010"}, {"Title": "Great laptop", "Author": "Xavier M. \"MC\"", "ReviewID": "R3EBR9QS4W976K", "Overall": "5.0", "Content": "Hi, I bought this laptop three months ago, and until this moment it has been great.I love HP computers and I'm very happy whith my purchase", "Date": "August 11, 2010"}, {"Title": "a really good laptop deal", "Author": "Michelle_a", "ReviewID": "R1KBYW9PZYRTBI", "Overall": "5.0", "Content": "the laptop is just cool.the laptop has all the features as listed on the site  - no gimmicksvery affordable and high quality", "Date": "May 22, 2010"}, {"Title": "Love it!", "Author": "Let's Ride the SS Cartagena \"Romans 10:13 For...", "ReviewID": "R3MTPESBT8K1XT", "Overall": "5.0", "Content": "I did a lot of laptop researching before I bought this computer. My main purposes are for school work (I take online classes) and editing photography. I have found that for my needs this computer has done very well. However, I have never used the webcam or microphone. The disk burner works fine and the keys seem to be pretty sturdy. I have had this computer for a few months now and has yet to fail me, it runs very smoothly. I love it.", "Date": "April 28, 2010"}, {"Title": "Great Value", "Author": "Atomic Betty \"Atomic Betty\"", "ReviewID": "R37Z9KTPG7YB0K", "Overall": "5.0", "Content": "Got it for my 11 yr old, fired right up and she got on the internet in 10 minutes with little assistance. Screen is bright, performance is good, no problems so far.", "Date": "April 15, 2010"}, {"Title": "Easy to use!", "Author": "M. E. Swain \"Baker Bookworm\"", "ReviewID": "R1S4IBAK4REELI", "Overall": "5.0", "Content": "Super easy set up and very functional.  I purchased because of the screen size, built in web cam and separate 10 key digit pad. So far I am not disappointed.", "Date": "March 23, 2010"}, {"Title": "Computer shopping", "Author": "Nancy", "ReviewID": "RP8CTKPW2JLWR", "Overall": "5.0", "Content": "I had a HP laptop with XP...well used.  I shopped around for a month before ordering this laptop from Amazon.  The 15.6 laptop is a good size. Windows 7 seems to be working well, so far.  Her name is Nellie and I hope she lasts a long time.", "Date": "March 21, 2010"}, {"Title": "hp g60  630us  laptop", "Author": "James Smith", "ReviewID": "R2X2DLRZKKHE96", "Overall": "5.0", "Content": "i have to say i am very, very happy with this item. i just have to get used to windows 7.", "Date": "March 21, 2010"}, {"Title": "HP G60-630US - Excellent Laptop", "Author": "David D.", "ReviewID": "RJ16S22XKK2L2", "Overall": "5.0", "Content": "Excellent computer for the money.  Worked perfectly right out of the box.  I've read reviews where the webcam and microphone do not work but I am having no problems with mine.  Definitely worth $500 to $600.", "Date": "March 12, 2010"}, {"Title": "great computer", "Author": "R. Botti \"mac user\"", "ReviewID": "R1E7HXDRPQJKRO", "Overall": "5.0", "Content": "Lots of features for a mid priced laptop. Does everything you could want for school, home, surfing, watching video and tv. Screen looks bigger than 15.6.", "Date": "March 11, 2010"}, {"Title": "Very much worth the money!!!", "Author": "K. Wise \"kellz\"", "ReviewID": "R2R0QQOWI7LTKG", "Overall": "5.0", "Content": "I love this computer.. I would recommend it to anyone. but the battery life sucks.. other than that its great...", "Date": "March 7, 2010"}, {"Title": "Please Don't Buy This Computer", "Author": "Michael Quayle", "ReviewID": "R3BADAYPSVXMID", "Overall": "1.0", "Content": "Multiple issues that got worse and worse.Laptop continually overheats to the point that it starts smoking and burns your lap.Crashes about 4 times a day.Graphics skip when video is full screen.Programs stop running.Almost all key software you receive is a free trial (you have to pay for everything eventually).Replaced twice - same problems on each computer.Finally called customer service for the 9th time only to find out that they had cancelled my warranty. $390 to refurbish the system for me a 3rd time.Threw it in the river behind my house and bought a different laptop from another company.Please don't make the same mistake that I did. Stay away from HP. There are already several class action suits against them for similar problems. The company is going down the tubes. If you enjoy trying to understand Indian customer support and wasting your money on a junk computer, HP is definitely for you!Mike", "Date": "June 30, 2010"}, {"Title": "Lasted 3 months then hard drive went", "Author": "Tom Maciejewski \"atkinsdietbulletinboard\"", "ReviewID": "R37BDYOR4BE0VY", "Overall": "1.0", "Content": "This is my 3rd HP laptop.  the first one I loved ... but the for the last 2 the hard drive failed.  This last one the hard drive failed just after 3 months.I would not recommend this laptop.  Not sure if HP is trying to save $$$ by using junk HDs or what is going on.", "Date": "December 7, 2010"}, {"Title": "there IS A class action LAWSUIT for these. DON\"T BUY", "Author": "flea \"flea\"", "ReviewID": "R2RQZSUWQXPP6O", "Overall": "1.0", "Content": "i bought this laptop 10 months ago.  last week the screen went black.  after calling HP and having them tell me the motherboard was shot and they would send me a box to send it in for repair, i found out from friends that this is a WIDE SPREAD problem.  when i researched it online i found out that YES these laptops will overheat causing the motherboard to fail.  just hope everyones fails while under warranty like mine did.  i *think* they will fix it if it's out of warranty too b/c of the lawsuit pending.  still looking into it, but wanted to post so nobody else buys this junk!! :) link to one of a million articles about this: (...) [...]", "Date": "October 30, 2010"}, {"Title": "G60 is a Great unit its a driver and bios update TRY CALLING HP", "Author": "Michael A. Koch", "ReviewID": "R2IPXR3ASN84MN", "Overall": "5.0", "Content": "One of my customers had the very same issue and it is just as much windows 7 fault as HP fault that this issue is present I spent an hour on with support and got the problem straightened right out it took a while but now it has the best sound on any laptop i have heard it is a matter of the operating system being released to soon before the bugs where Fixed personally i think most of the people on here do not know anything about computers and that is why updates are so very important.So before you read a one star review read a review from someone that is a programmer and you will find the truth about the products", "Date": "September 27, 2010"}, {"Title": "Bad mic, no camera.", "Author": "Rodrigo  Garcia Berguecio", "ReviewID": "R20DLRIGZ9B02A", "Overall": "1.0", "Content": "It came with bad microphone, Amazon didn't help me and told to deal with HP directly. HP is imposible to reach, i gave up. Two weeks ago i went to Best Buy to buy a printer, the salesman told me they can take the laptop to HP. So, after almost 9 months i will see if the mic can get fix.", "Date": "September 12, 2010"}, {"Title": "Not worth the price", "Author": "Uma Maheswar Kalluru \"umajava\"", "ReviewID": "R2PBRVOWRRPNWK", "Overall": "2.0", "Content": "1. This Laptop's configuration is not worth the price.2. Wireless internet is not working. Cheap WiFi part is used in this laptop.3. Not good for gaming, the laptop is getting overheated.", "Date": "May 10, 2010"}, {"Title": "Very good!", "Author": "DAVID M. PUSKAR", "ReviewID": "R6ZU2VIY3KPPP", "Overall": "5.0", "Content": "This is a great machine! \"There is no fear where love exists. Rather, perfect love banishes fear, for fear involves punishment, and the person who lives in fear has not been perfected in love.\" 1 John 4:18", "Date": "February 15, 2013"}, {"Title": "Great laptop but beware", "Author": "ęļąįņę", "ReviewID": "R36I8UDDMZ477V", "Overall": "5.0", "Content": "About two years ago I purchased this laptop, I was very pleased with it. The external design of the laptop is very nice and simple and as of then, my only issue was the internal microphone (as noted in other reviews). The microphone's audio quality is extremely poor, too poor to make use of. I purchased a microphone on Amazon for under $3, and it worked fantastically (click here for a link to the microphone). Simply plug it into the microphone jack in front of the laptop. The touch pad is great, it's sometimes hard to navigate with though if it's extremely dry as the material doesn't seem to be very glossy. It's a little odd that the pad is indented so much, you get used to it very fast, though. The multiple USB ports are convenient. Something also very convenient is the button (right next to the power button) that disconnects and connects you to the internet. There is also a little button above the touch pad that disables and enables the touch pad.My main concern with this laptop was, after around a year of usage, the top left screw on the bottom came loose and fell out. I had no idea this had happened. I did notice some trouble plugging it in to get charged, some turbulence opening and closing the lid, and more majorly the monitor's picture: everything that was supposed to be black was green. This was very irritating so I began to use it less. At that time, this laptop became my secondary laptop so I didn't really look into getting it fixed. I began to use it a little more often and after time, the bottom left cracked, separating it from the top and exposing the inside. After a while, the picture got worse and worse until eventually, it went black entirely. After doing some searching on the internet about my problem, I came to the conclusion that the screw coming loose eventually caused the monitor to get disconnected inside. I knew someone else who had this same laptop and after a while, his laptop's picture worsened and eventually, the back came off and it cracked in various places. His picture quality did not resemble mine, his may have been due to exposure to moisture after the seal was broken as a result of the screw coming loose.Good warning signs to look out for are (as I stated above) minor or major turbulence opening and closing your laptop's lid, depreciation in picture quality, and when plugging in your laptop, it feels as if it's loosened inside. If you realize the screw's come loose on yours, simply take it to be repaired or you could fix the screw yourself (that size of screw is a little tricky to find).One more problem is the charger that comes with the laptop. The part where it gets plugged into the laptop breaks off too easily inside the cord. I had to replace it twice, trying out different chargers from Amazon as HP would only allow me to replace the cord for free under warranty once and the price for the cord from HP is ridiculously high. Many of the cords on Amazon are very cheap and don't work. However, the one I'm using now I've had for months and it works great, perhaps even better quality than HP's, besides a little interference now and then with my TV.Overall, the laptop is a great deal, reliable, and very enjoyable, just note the microphone problems and watch out for the screw and the charger.", "Date": "December 11, 2011"}, {"Title": "HP G60", "Author": "S. Lucas \"hunter5\"", "ReviewID": "R1L7EYE3DJMCQ0", "Overall": "4.0", "Content": "I got it on sale at Staples.After a good year and a half the battery dies.The battery sucks.The internal microphone doesn't work.The Windows 7 doesn't last that long.If you buy this Please buy Warranty!!!I forgot too now I have to buy a 13 dollar battery!-___-", "Date": "October 5, 2011"}, {"Title": "It doesn't boot up after 1 and a half year after purchase", "Author": "Kkev", "ReviewID": "RFA8RHQVSD1X7", "Overall": "1.0", "Content": "The battery doesn't work  a few months after I bouth it. Everytime, it fails to boot up. I have to do a hard booting. I take off the battery out of the machine. A big problem happened recently. It would never boot up again after many times of hard reset. I am aftaid it is because the battery is not inside, and after several sudden abnormal shutdowns, some hardware is broken.I have to send it to the repair shop and am waitting for the big charge for it....The technician told me  the mother board is broken. He also siad that the parts made for the board is of low quality to save monly for manufactureing. Anyone know how expensive it is to replace it. I have to buy a new one. A trash. Totally disappointed. My 4.4 year old Toshiba laptop works slowly but at least it can work....", "Date": "August 31, 2011"}, {"Title": "great computer", "Author": "demandzm", "ReviewID": "R18CJ234LXBNLR", "Overall": "4.0", "Content": "I dont know what everyone is complaining about, i have owned a g60 for about a year now and i hav enever had a problem with the microphone the only reason why i gave it a four star is because i have had problems with it crashing since i got it but it didnt happen very often. I sent it in for repair before the warranty ran out i'll find out tommorrow what the problem was. Thats another thing, the customer service from hp was great. I called two minutes later i was speaking with a rep that was very knowlegeable and was not indian(i could understand him just fine). I got my a box two days after i talked to hp. It took two days for it to get there from michigan. it took them three days to fix it. they shiped it yesterday morning and i will get it tommorrow. I see no problem here, i think you guys want to be spoon fed and your ass wiped with gold. No matter what computer you buy its gonna have issues. for the people in this class action suit you really need to consider that, nothings perfect no wonder the economy is in the shitter to many people going lawsuit happy.", "Date": "November 11, 2010"}, {"Title": "Mary Laptop", "Author": "M. Fox \"Surfer Girl\"", "ReviewID": "R2AAHIDMPU9S10", "Overall": "5.0", "Content": "HP G60-630US 15.6-Inch Laptop (Black)This computer is really great!  It's fast enough for me and my household.  We can scann the Internet and at the same time watch TV.  I am really happy so far with this computer.", "Date": "April 6, 2010"}, {"Title": "Excellent Laptop!", "Author": "Darci Curry \"dolphin0505\"", "ReviewID": "R293KQU8BS5DAX", "Overall": "5.0", "Content": "Got this HP a couple months ago and we love it.  Haven't had a single problem with it. We use it for  burning home movies, playing games, downloading music and all sorts of other things. It's fast and always reliable.", "Date": "April 5, 2010"}, {"Title": "I like it, but....", "Author": "uncle smoke \"45auto\"", "ReviewID": "R3PG035GU2H98U", "Overall": "4.0", "Content": "I wished I would of went with a bigger screen. I dont carry mine out of the house so I would like a bigger screen. That 4 hour battery life is a joke,but I would say that would be the case for most laptops. The only thing I use my laptop for is to surf the web and its more than enough computer for me.", "Date": "March 11, 2010"}, {"Title": "Well......", "Author": "Captain Gandhi", "ReviewID": "R2B6WJOK8WSVOJ", "Overall": "4.0", "Content": "I bought this computer over 4 years ago, and it came with the Home Premium Vista SP1, and it was loaded with a 32-bit AMD Turion X2 64. I had no idea what was happening when i got this, i was not educated at all in the whole laptop business. But now, i realized how much a save i made. This laptop has only recently started to become old and wear away. The resolution is still a stunning 1260 and it has excellent speed for a 32 bit. Granted, I did have to restore it to factory settings 2 times due to a virus, but it was nothing the computer caused. I really enjoyed the computer and i have in fact dropped it in its earlier years and it still performed well. I have not made a single adjustment to anything hardware-wise, nor software. I dont even have windows 7 but my computer can still compete with the best of my friend's, easily rendering Blender files and such. Youtube is not a problem, and my laptop performs for entertainment: exactly what i do. I have several DJ software programs and my iTunes has a LOT of content on it but my 250 GB's of memory is barely half through, and i never deleted the memory after the restores as I saved everything into an external hard drive. I suggest this for a first, \"intro\" sort of laptop, the newer version with intel processors and all is much better and will make your life easier:)", "Date": "April 8, 2011"}, {"Title": "HP laptops have long term quality issue", "Author": "Susan", "ReviewID": "RF49MY6WYS3ZY", "Overall": "1.0", "Content": "HP's quality are being probed and many laptops recalled in Asia now.Quite a few models are being reported with display problems.The US models are not much better. My own $1000 laptop broke down rightafter warranty period and the customer service manager said \"we can't do any thingfor you.\" So, just stay away from HP laptops.", "Date": "March 31, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Pentium Processor 2.2GHz\n3GB DDR2 RAM\n320GB 5400RPM Hard Drive\n15.6-Inch Screen, GMA\nWindows 7 Home Premium 64-bit", "Name": "HP G60-630US 15.6-Inch Laptop (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51jmKeB6hAL._SX300_.jpg", "ProductID": "B0030XZNME"}}