{"Reviews": [{"Title": "Best laptop for under $500", "Author": "YourOnlineHero", "ReviewID": "RC64T1A1OBJG9", "Overall": "5.0", "Content": "I was in the market for a 12.6 netbook and started looking at what else was out there for small laptops... then I came across this. I have a custom built 3.7 ghz (oc'ed) pc that I could not bring with me and this more than satisfies my needs. This is the perfect laptop for anyone that wants a powerful computer without spending outrageous amounts of money. I've owned if for only one day and I'm very impressed so far.Positives:Dual core processor.HD Video Card (handled a 1080p file I have with no issues or lag!)Beautiful screen3gb of memorySpacious keyboard, with number padNon-glossy cover so no fingerprint or smearing.Camera is sharp for only .3 MPFree 60 day trial of MS Office 2007Face recognition feature for sign inDirectX 1016:9 DisplayWindows 7 premium bundledWireless network works perfectlyUSB ports on both sides laptopQuick and easy setupNegatives:As expected bloatware and bundled programsNo gloss or shine cosmetically. A little gloss would have been nice somewhere.Screen does not lock when closedBattery charge icon does not change when chargedNo HDMI outAfter looking around for about a week, this was easily the best deal for a laptop under $500. The only thing I wish it had was an HDMI output. The negatives do not take away from the laptop as I was able to remove all the unnecessary programs in under and hour. The hinge for the screen has the perfect amount of resistance that it wont go flying open on you when it is closed, so the lack of a lock is nothing to worry about it. I am very satisfied with my purchase and no complaints thus far.", "Date": "May 29, 2010"}, {"Title": "A reasonable machine for the price, a nice big screen for my 80+ yr old mum.", "Author": "A. Mosnov", "ReviewID": "R6TXOL6E2N5VV", "Overall": "4.0", "Content": "First my cons:1) Lower quality WiFi transceiver it seems2) Impossible to type with jumping cursor until I disabled the touchpad3) I could shave in the shiny reflective screen4) The battery drains faster than the advertising5) I'll add the bloatware myself thanks if I think I need it1) I experienced some dropped connections that now apppear to be isolated to the extranet WiFi at work though both my Lenovo T60 and an Asus eeePC 901 I keep at work have never dropped a WiFi connection. The G555 did so repeatedly not keeping the connection for more than a few mins at times. I would have to disconnect and connect to regain my connection. At home the WiFi did not get dropped across the house but the performance was half to my Asus eeePC 1000H that I keep at home. So sitting next to the router the G555 could achieve only a 75Mb/s connection compared to 150Mb/s for my 1000H. Across the house the G555 drops down to 32Mb/s less than half again of the 1000H. I attribute this to seeing for the first time a Broadcom transceiver vs Atheros or Ralink. I noticed on the Lenovo support website for the G555 that the lastest drivers are from Atheros. Does this mean that Lenovo has done a WiFi switcheroo in production and I'm just one of the unfortunates not to receive version 2 of the G555. Why are the latest two drivers from Atheros?I fixed 2) by buying a mouse and disabling the touchpad, I've never had to disable a touchpad on many a laptop before. There is no sensitivity setting for the touchpad available.3) The screen is very reflective making it harder to see in a bright room or with a window behind me. I thought reflective screens like this disappeared a decade ago, how much could it possibly cost today to add a non-reflective screen.4) The battery is advertised as 4 hours but I got low power warnings after 2.5hrs on Windows 7 Power Balanced setting. This of course was a little expected due to higher performance CPU and GPU than my ASUS machines.5) Finally as mentioned in many reviews there is a silly amount of bloatware installed, I removed 90% of it. The software installs are located on the D: drive.Other than the above the rest is pretty good for the price. It feels pretty solid, its fast. The screen is nice and bright (if only they had made it non-reflective). The camera seems to work fine, all the basic features are there that I enjoy on my ASUS eeePC machines. My mum will be happy (she did not know a mouse could be used with a laptop). Hopefully Lenovo can fix a few of those issues I mention for future owners.", "Date": "June 28, 2010"}, {"Title": "Lenovo G555", "Author": "Ta-Jen Hsing", "ReviewID": "R3G0LHBGHJNTMM", "Overall": "2.0", "Content": "I bought this Lenovo laptop to replace a Toshiba that I gave away.  It sits on my breakfast table and is used like a desktop PC for reading news, trading stock, watching video...etc.  I have owned it for about 8 months and I like it a lot.Things that I like:1)The screen is big and bright, which is a positive if you use it as a PC replacement.2)It has a dual core CPU good enough for web browsing and video watching.3)Battery lasts 3 to 4 hours.4)Integrated SD card reader.Things that I don't like:1)No bluetooth.  Not really a problem. You can get a USB bluetooth \"plug\" in less than $5 on ebay.2)It uses the old DDR2 memory.  If you plan to upgrade its memory you better do it now; DDR2 is being replaced by DDR3.3)All external connectors, such as USB port, are either on the left, right or front of the laptop which occupy more real estate on my breakfast table.  I prefer them on the rear.4)The normal placement of the Ctrl button on the keypad is now occupied by a Fn button.  This screw my copy-paste operation a lot.5)The Home and End keys, which I use a lot during typing, require \"Fn\" key being pressed down.6)This is no easy way to automatically disable touch pad when a USB mouse is used.Update 02/22/2012After one year of usage, the laptop develop a weird problem that it won't boot if the laptop is warm.  This means if I want to reboot my laptop, I need to shut it down, wait for 30 minutes before it will boot up again.  Too bad that my warranty is past when this starting to happen.", "Date": "January 22, 2011"}, {"Title": "Awsome Laptop under 500 dollars", "Author": "Jeffrey Nguyen", "ReviewID": "R2CPJZPM7FF5Z6", "Overall": "4.0", "Content": "Well I would first like to say I've had this laptop for about a month and its been a perfect Gem handles 1080P MKV Media files better than expected.Like everyone else I had issues with the touch pad being in the way so I just bought a wireless mouse and use that instead and disables the touch pad.Pros:Nice big and beautiful screenGood Processing PowerNice keypad and number pad placementLight weightPortableDurableConsBattery life could be betterSpeakers could be better!!HDD space is a little lowTouch pad PlacementI would recommend this laptop to anyone looking for a nice affordable, durable, portable and user friendly laptop!!", "Date": "July 19, 2010"}, {"Title": "Lightweight, no glare on the screen, fast and a 10 key pad!", "Author": "S. L. Taylor \"Dallas Lady\"", "ReviewID": "R12HNPH4HG19OO", "Overall": "5.0", "Content": "Excellent product! Good value for the money! I've had mine for 4 months and couldn't be happier. It's lightweight and the screen has much less glare than my Sony Vaio (and weighs a lot less too!).", "Date": "May 22, 2010"}, {"Title": "Awesome Laptop For the price", "Author": "Norm Bagley", "ReviewID": "R30M6TJCXN2Z63", "Overall": "5.0", "Content": "The two negative reviews are way out of scope for this laptop.  This laptop for the price is hands-down a fantastic laptop.  It runs Windows 7 quite fast and with 3 gigabytes of ram, and a 2.1 GHZ Dual core processor, and a 160 GB SATA laptop hard drive, you get fast application processing power, and a computer that does all of the same great things that others do 3 times their cost.  The resolution is great, the web cam is okay, the CD/DVD burner works well, and the battery life is pretty decent.  THE BEST PART ABOUT THIS LAPTOP IS THAT LENOVO IS A BRANCH OF IBM.  YOU KNOW, THE COMPANY THAT MAKES HIGH END COMPUTER EQUIPMENT AND THAT HAS BEEN AROUND FOR YEARS. So don't be fooled by the price or superficial reviews, this sweet little gem is truly a bang for the buck.Tech ownership 1 yearTechnical Level High", "Date": "September 13, 2011"}, {"Title": "Disappointed", "Author": "MJackson, MFT", "ReviewID": "R3DFBY45K2HI76", "Overall": "1.0", "Content": "Reviews of the Lenovo G555 were decent for an inexpensive laptop so I bought one. Five months later the hard drive crashed. They eventually agreed to replace it and did. Next the plastic facing over the CD drive broke while lifting it out of my backpack. Then, over a period of 3 months, the plastic center piece of the two USB ports on the left side of the computer broke of while removing a USB port connection. The one year Lenovo coverage was up but I had a 2 year warranty with Frys Electronics. Turns out the USB ports are welded to the motherboard so Frys could fix the ports but I would have to pay $190 to replace the motherboard.Other disappointments include; a lot of junk programs the uninitiated would use rather than delete, an inadequate hard drive,cumbersome program access process and tendency to freeze when running multiple programs.", "Date": "February 5, 2012"}, {"Title": "don't buy", "Author": "diana", "ReviewID": "R11YT6DA4ULHSG", "Overall": "1.0", "Content": "The motherboard burned out 2 months out of warranty. you get what you pay for. stay away from this laptop.", "Date": "November 20, 2011"}, {"Title": "Only buy if you need a big, expensive paperweight", "Author": "rowari", "ReviewID": "RXH31P5RKZ70S", "Overall": "1.0", "Content": "Can't speak to all units as there are some good reviews on here, but I can speak to what I've experienced.Purchased new 1/1/2011 on sale for $300.  I recognized the validity of getting what you pay for but as this was a first laptop for my daughter I was ok with that.(note; this was not purchased through Amazon)Ran ok for a couple months.  By ok I mean extremely slow and very lengthy boots.  I chalked this up to being a $300 machine.In May it died and would not boot.  I went through Lenovo's repair service as requested, starting online.  It showed that I'd never registered the machine.  Actually, it was the first thing I did upon bringing it home and starting it up the first time.  So, I went through registration again.  Couldn't get it done via webapp so I emailed customer care and got a laundry list of information they requested to register it.  Oh, by the way, their customer care is handled in Asia, going by the time over there.  I would receive replies around 2am my time and by the time I'd get up in the morning to answer them, it took at least another couple days to get replies back.  In each reply a new piece of information was requested.  Finally, it came down to invoice #.  I'd lost the original receipt but was able to get a copy from the retailer via email.  I emailed that to Lenovo.  I had been told once they received it, all was good.  So, imagine my surprise when a week later (we were into July by now, the Lenovo agent who began with me \"went on vacation\" so I received no replies during that time, then when he came back it was handed off to another agent) I get an email back saying they want the receipt but now stamped with the reseller stamp.  Mind you, I'd sent in an pdf of the invoice that had the reseller watermark on it along with every other bit of info.  At any rate, the best I could get out of them was warranty coverage not from the day of purchase, but from the day of manufacture, August 21, 2010 (lost a full 5 months).Finally, I was allowed to call in for repair service.  The call was answered very quickly but only for me to spend the next 15 minutes listening to the rep try to sell me an extended warranty.  I tried every way of telling him politely that I was not interested in that, only in getting this machine in for repair.  It literally got to the point of me having to yell at him for him to understand.  The offer was made that if I pay for extended service they would cover the $21 shipping.  No thanks.Machine was sent in and received back quickly; within 2 weeks (only indication of problem was one word on the return invoice: memory.  Ran great for about a week then BSOD upon launching any browser.  By this time the warranty had expired.  We tried everything but the BSOD's only increased in frequency.At this point, we have reformatted the drive and are reinstalling Windows 7 Home Premium 32bit.", "Date": "August 26, 2011"}, {"Title": "Lenovo G555", "Author": "Larymor", "ReviewID": "R1XQ92ACT4RJ5W", "Overall": "5.0", "Content": "I have had this unit for about 1 yr. It is a very nice machine...super wide screen...turns on and shuts down fairly quickly. I use it for web surfing and have zero complaints. People are complaining about the DDR2 memory. Why do you need more? If you want a faster workhorse machine, cough up a grand or more and buy one! QUIT WHINING !!", "Date": "December 22, 2010"}, {"Title": "Extremely Disappointing", "Author": "Mackie91", "ReviewID": "R9V1S5S5ZY2SZ", "Overall": "1.0", "Content": "I am extremely disappointed with the poor quality of this laptop.  I was looking forward to a Lenovo laptop after a disappointing experience with a HP product. The touch pad does not not work and the right and left click pads are extremely noisy and made of cheap plastic. A wireless mouse is a must. Very poor quality and design even for a no frills design. The laptop does not have a locking mechnanism; another disappointing feature.  There is nothing positive that I can state about this laptop.  I have learned my lesson by buying a cheap product as I got what I paid.", "Date": "February 14, 2011"}], "ProductInfo": {"Price": "$499.00", "Features": "Hard Drive: 160 GB, Serial ATA-300, 5400 rpm\nNotebook Camera: Integrated, 0.3 Megapixel\nBattery: Lithium ion; Run Time (Up To): 4 hour(s)\nManufacturer Warranty: 1 year warranty", "Name": "lenovo G555 087325U NoteBook AMD Athlon II Dual-Core M320(2.1GHz) 15.6\" 3GB Memory DDR2 800 160GB HDD 5400rpm DVD±R/RW ATI Radeon HD 4200", "ImgURL": "http://ecx.images-amazon.com/images/I/31p%2ByIRBnEL._SY300_.jpg", "ProductID": "B003BRXT9I"}}