{"Reviews": [{"Title": "HP G62  watch out, mine failed", "Author": "Cindy C. Wilson", "ReviewID": "R1EVDTAY88OVOC", "Overall": "2.0", "Content": "This was a great PC until it broke within 5 months of purchasing it.It takes a lot of force to open this laptop and the screen eventually cracked at the top. This laptop stays in our house and is not abused in any way.This was within the warranty period, but I quickly found out a crackedscreen is not covered by the warranty.I checked the screen mounting and the case is warped so the hinges for thescreen are not at right angles. This is why it takes a lot of force to open the laptop screen. Also there is not a latch to hold the screen down.HP finally agreed to fix it but I had to pay 50% of the repair cost which was over $200. It was still under full warranty.I finally have the laptop back and it is still hard to open, so the screen will eventually crack again. I may leave it open most of the time.I am a design engineer and I know this is a design or manufacturing flaw.I looked at G62 reviews on the Internet and others have commented that the screen is really difficult to open.If you buy a G62, look it over carefully and make sure it is not hard to open. If it is hard to open, send it back right away. If the screen cracks after you purchase it, the repair cost is almost as much as the purchase price. The screen is not under warranty.", "Date": "December 4, 2010"}, {"Title": "HP G62 Setting the Bar straight!", "Author": "MarcM \"MarcM\"", "ReviewID": "R2ZSZZUZLB582X", "Overall": "5.0", "Content": "Fist off, by the look of this unit some might say it looks alot like the Macbook pro 13\", with that being said, looks are NOT everything, This HP G62 packs alot of KICKASS punch, Unlike the other person who wrote that he's having a track pad problem.....GET GLASSES if you cannot see the track pad. One of the features regarding the track pad is the shut off, you just tap twice on the led thats located on top of the pad too disable the track pad, of which then an amber light comes on letting you know that you have disabled the track pad, too enable it, just tap twice and your good too go, this feature was made if you are going too use an external mouse. Now as far as This unit's functionality, its awesome, all hard drives depending on your configuration, are @ 7200 rpm,the base CPU is the new i3 core by intel, of which is upgradeable too the i5 or i7. It also features the new L3 cache, giving you a smoother ride then the older L2 cache systems. The system bus is well over 1066MHz, uses very fast DDR3 ram of which this unit is upgradeable too 8 gigs of ram. In addition the graphics are in true native, and watching a dvd was an experience, with the Altec Lansing audio surround. OK now for multi-task, I have compared it too the Macbook Pro, With the Intel core 2 duo running @ 2.8 Ghz, the results were very impressive, The HP (base model) not only beat the Macbook Pro in muli-tasking, but also ran apples own software like itunes and others with little effort, running adobe CS4 was so fast I could not believe what I was seeing. As far as surfing the web, I have never been on a mobile device that has speeds that are just unbelievable. HP and Intel have put together a product that surpasses systems worth $2000 and up. Of coarse if you deside too get your HP G62 FULLY loaded with the i7 intel cpu, blueray, 500gb hard drive, and  dedicated graphics, and built in bluetooth, this unit will run you about $2400. Now weather you get the base model or upgraded version, 1 word....Kickass, its about time a PC company challenges the bar, weather your a casual user or an extreme user, makes no difference, this unit is built for decades too come! Well worth the money!", "Date": "April 6, 2010"}, {"Title": "Massive Speed & Battery Life for Price", "Author": "Joseph B. Oprysko", "ReviewID": "R3M6ZOEV8B6A73", "Overall": "5.0", "Content": "I picked this up on sale at Best Buy for $549, I was first inspired by the looks the the unit, as well as the texture of the casing.  But I went and looked at just about every other laptop in the store in similar price range.  Most of them tended to be the previous generation T4400 processors, rather than the new i3 series processors.  One of the other things that caught my eye almost immediately was the posted battery life for the unit.  Most 6-cell laptops you expect to get 2-3 hours of usage.  The G62-144DX has 5hr 15min (admittedly, the way those battery lives are calculated is with just about everything shut off and the laptop not being used, but still significantly higher)  I looked around at the other i3/5/7 series, the i3's and i5's all tended to have significantly longer battery life.  They are the perfect mix of low electrical power utilization and high performance.  Plus the fact of the DDR3 memory and the 500gb hard drive (most laptops tended to top out at 320gb), it was really an unbeatable deal.Most of the other i3 laptops at the store were running at least $100 higher or more, and didn't have all the specs of this unit.  It is quite a speedy system for a very reasonable cost.", "Date": "May 8, 2010"}, {"Title": "really fast notebook but the motherboard fried", "Author": "talha148", "ReviewID": "R2WMNCFR2H9OS3", "Overall": "3.0", "Content": "i had this notebook for 12 months it used to heat up alot i dont know why one day i left it on charge for the night and the next day it didnt turn on took it to the reapir shop they said the mother board is dead", "Date": "March 17, 2012"}, {"Title": "Poorly made.  Check your keyboard and only buy from authorized reseller", "Author": "Jabberjaw", "ReviewID": "R2M5UUF03MP5OK", "Overall": "2.0", "Content": "Poorly made.  Check your keyboard and only buy from authorized reseller.  I think this model is only authorized through Best Buy.  I bought 3 all at once...2 from Best Buy and 1 off Amazon.  HP is not honoring Amazon purchase for warranty. The keyboard on the amazon one became warped.  Keys started coming off too.  It has never left my desk or been dropped.  I also have a cooling pad under it from day 1. Going to have to toss in trash.  Other 2 have been great..thus the 2 stars", "Date": "March 26, 2011"}, {"Title": "Great notebook except for the mouse pad", "Author": "pjm", "ReviewID": "R2DYOUR8966X59", "Overall": "4.0", "Content": "For the most part, notebooks with similar specs are not much different from each other. This G62 is a great notebook which I have no complaints about when using an external mouse. The built-in mouse/track pad is another story.The mouse pad is not as sensitive to (my) touch as any other I have ever used. Sometimes I have to look at the pad to confirm I am on it when it doesn't sense my touch (unlike other notebooks, the G62's \"hidden\" mouse pad is flush with the computer case, with no visible or tactile difference to let you know when you slide your finger off it).  Another issue with this flush mount mouse is that you don't have a \"lip\" or edge with which to know that your other fingers or palm are not touching the pad and keeping your moving finger from having any effect.If you need to use the built-in mouse instead of an external one, I would seriously consider finding another notebook.This mouse pad is a very poor design element and should be eliminated in future versions.", "Date": "July 3, 2010"}, {"Title": "Powerful and nice display but really flawed", "Author": "smiller3967", "ReviewID": "R3UT1I3GKVRDML", "Overall": "3.0", "Content": "I will also add to the complaints about the track pad on this computer. It's hard as hell to use it and your fingers have to perfectly clean and free of any oils for it to respond. The stupidest part about it though is that it blends right into the rest of the computer and is impossible to keep you fingers in the right spot if not looking or in the dark. The scrolling is a pain too. And yeah the flat keyboard is really hard to type on. This computer overheats like a mofo on top of all that. And last, but certainly not least, the batteries fail after a year in a half. They go from not holding a charge quite as long for a little while then bam all of the sudden it just stops working. And mine was turning off even if plugged in. I just got a new battery the other day and new power supply will be here tomorrow.It does have great specs though and a really nice display. Lots of hard drive space and RAM.", "Date": "February 19, 2012"}, {"Title": "Good computer", "Author": "P. A. Snow \"Phill\"", "ReviewID": "R2VI7BPDLEJQN9", "Overall": "5.0", "Content": "I, for whatever reason, forgot to look at the reviews for this computer before buying it, and after reading them (while the computer was on its way), I became worried I'd ordered a dud. Thankfully, my fears have not been substantiated. So far, I have had no problems at all with this computer. The touchpad works just fine; it's as sensitive as any other touchpad. Granted, I only ever use a touchpad (I never use a mouse), so I might just be accustomed to using them. Perhaps people with less experience have a steeper learning curve. (It used to take me a long time to feel comfortable with any new touchpad). The buttons on the touchpad are a little clunky, but I'm sure I'll get used to it. The keyboard is slightly warped, but it doesn't seem to be a problem. The only thing I really dislike is the column of buttons on the left end of the keyboard. I frequently find myself launching the calculator application when I meant to hit the ctrl button.UPDATE: It's been more than a year and a half and this computer is still running strong. I've never had a laptop I liked more than this one. Fast and reliable. I love it.", "Date": "February 15, 2012"}, {"Title": "Hard to beat for the price.", "Author": "K. Austin", "ReviewID": "R3J9N4U12ORGZA", "Overall": "4.0", "Content": "I bought this laptop over a little over a year ago when it was $600 and it has yet to give me any real problems. Once the programs that come pre-installed are removed, this thing breezes through almost everything thrown at it. Granted, one should not expect to be playing many video games on this because of the Intel HD graphics, but 1080p videos are no problem at all and multitasking is superb. 4gb of RAM (very fast DDR3) is more than enough. For this price it is very, very hard to beat. The Intel Core i3 is a significant step over every older dual-core processor because the graphics chip is on the same dye as the processor which saves space, consumes less energy, and therefore produces less heat. A 500gb 7200rpm hard drive is also very hard to find on laptops that are not gaming oriented. The high RPM hard drives tend to consume a lot of power too, but the battery life is pretty good at about 3-4hrs. The only gripe that I have with this laptop is the mouse pad, and the fan. The mouse pad takes some getting used to since it is flush with the finish on the chassis, but it has support for multitouch (that is found on Macbooks), which is very nice. The fan is LOUD. You won't notice in a room that has any sort of background noise, but sitting in a quiet room it becomes quite noticeable. With all that said, I still have yet to see a laptop on the market that really comes close to beating the features+quality to price ratio that is found on here.", "Date": "April 2, 2011"}, {"Title": "Nice laptop for its price!", "Author": "horror_lover316", "ReviewID": "RTNUWC65SKVLN", "Overall": "5.0", "Content": "I love this laptop. It is easy to work on, easy to navigate, a wonder. I use it for the internet, movies on long trips and I use it to work on. It is not the sort you would buy for gaming but for everyday use.The only issue I had was the meaningless software installed on the laptop and no recovery CD. I have my own Windows 7 Ultimate so I am not too worried about it but for the average joe, that wouldn't be too good.As for the users that are complaining about the track pad...GET A MOUSE! If you don't like the track pad, USE A MOUSE! It is not that hard. If you don't like the keyboard, buy another laptop. This laptop rocks and as a Network Admin myself, I give it a thumbs up.", "Date": "February 1, 2011"}, {"Title": "Not bad, but not great", "Author": "Jason Close", "ReviewID": "R1LG1XOZOSI1DE", "Overall": "3.0", "Content": "I bought this computer for the price and system specs: $579 for the dual core i3, 7200 RPM hard drive, 4 GB DDR3, and new L3 cache (which is debatable on whether or not is worth anything).I bought this laptop intending to dual-boot it with Linux, and use it as a Linux development/sys-admin box part of the time, and then let my wife use the Windows side the rest of the time for her office work.  I bought it cold, without ever trying it out.  I'm someone who doesn't get too picky about performance and graphics, and is more concerned with the comfort of a system.  I don't care if something takes 2.3 seconds instead of 1.8 seconds as long as I'm comfortable.I'll go ahead and list the pros of this laptop: - It's fairly snappy, especially for a laptop, and works very well with Windows 7. - I've never needed to use swap space yet. 4 GB of DDR3 is awesome. - The screen seems to work fine, although the glossiness can be annoying - Fairly durable - 5 in 1 reader is good add-on - You get a great package for the price. - No dedicated number pad.  I want that real estate for my other keys. - Wireless works great.  DVD/CD burning works fine. - Stays very cool and very quiet.  Beats my MBP here hands down. - No stupid latch for opening the screen. - Lots of good connections: 3 USB (should be plenty for anyone), HDMI and a serial out, optical out. - Battery life is great.Here are the cons: - The column of buttons on the left.  No one in the world uses those stupid shortcut buttons (copy, paste, Internet browser, music client, email client).  The column on the right gets used all of the time (Delete, Pg Up/Down, Home/End).  There is half of an inch of wasted space on the left of your keyboard. - Because this laptop has an integrated graphics card, Linux does not play well with it.  Don't expect any accelerated stuff, and don't expect to use anything other than basic graphics drivers.  This is only a problem because you will try to use newer drivers, and then your Linux system won't boot right. - Because of the integrated sound card, Linux does not play well with it.  I have yet to get any sound out of the speakers in Linux.  I'm assuming no one at HP is smart enough to write drivers in Linux. - HP installs their own recovery software, which means your system comes from the factory with all 4 primary partitions already used (Windows + Windows Swap + Windows Recovery + HP Recovery).  This means that you have to use HP's installed software to create your 1 time recovery disks (takes about 2 hours), and then you have to delete the HP partition, defrag the Windows partition, and then shrink the Windows volume to have some free space for a Linux partition.  This was a pain in the butt. - THE MOUSE IS FLUSH WITH THE LAPTOP!  Because it isn't 'inset' at all, you will constantly tap the mouse area with your thumb by accident, which will then either change your application or change focus within your app to somewhere you didn't want.  Aggravating as hell. - The mouse buttons are way too difficult to handle.  You have to press them very, very hard, and there is no speedy way to use them.  You can get away with clicking by just tapping the mouse pad, but your screwed when it comes to right clicks (as much as I hate to say it, Apple has the best mouse pad in the world in their MBP). - The Esc button is to the top left of the tilde button, not above it (F1 is above tilde).  You Vi/ViM users will not like this. - The power button is weird.  If you are a man and you don't have little skinny girly hands, it's hard to fit a thick finger in the area where you have to push the button.This is still a fairly good deal for the money, but if you are a developer and are looking for something that will let you fly around on the keyboard, this might not be the best system.  Also, you Linux users will probably want something with dedicated graphics cards, as it makes you install and boots much easier.  For people who are using this for random usage and not any thick, dedicated work, this is a great deal.  I don't really recommend it for developers, especially Linux ones.", "Date": "June 3, 2010"}, {"Title": "notebook overheats and hibernates", "Author": "quitodbq", "ReviewID": "R1Q2UA8C2FBC5B", "Overall": "1.0", "Content": "Buyer beware!  Check the reviews online: there's lots of problems with this notebook overheating and going into hibernation.  Look elsewhere!", "Date": "March 27, 2011"}, {"Title": "Not the Best", "Author": "BC in VA", "ReviewID": "R3T9K0RP9TGANZ", "Overall": "2.0", "Content": "I've had the computer for about 3 months now. I'm still not impressed. The HP Advisor that comes with the computer is constantly recommending new changes. Several times now, when I allow it to perform those changes, it screws up my computer and I have to recover from an earlier session. Once, it even removed my Mozilla from my computer. The mouse pad is also not really clear. Sure, you know where it is, but it is the same finish as the rest of the computer with no outlining marks. The left / right buttons for the mouse are also rather hard to push versus other laptops I have had. This feature has become so annoying that I now have a separate mouse that I plug into the computer. If you are really considering this laptop, I would go to a store that sells it and actually use it a little before making that final decision. If I had done that, I certainly wouldn't have chosen this laptop!!", "Date": "December 11, 2010"}, {"Title": "Really a 4 start laptop", "Author": "Kevin", "ReviewID": "R1T9T4A0L9XLU4", "Overall": "5.0", "Content": "I added in 5 star review to counter a couple of the 1 start reviews from people that don't know what they are talking about. 90% of peole really like this laptop for the cost/value factor and that it does exactly what it says it does and does it well. Built in mouse is horrible - but so what when you can plug in a mouse if it bothers you THAT much. Screen is great (LED backlit LCD), and performamce is great (500GB 7200 RPM drive and 4 GB and i3 CPU). And I've opened and closed the case a thousand times without any \"build issues\" cracking the screen. Yes I know the laptop is old and not sold anymore, but I wanted to state the facts - This was a great bargain in its time.", "Date": "January 16, 2012"}, {"Title": "Great Laptop", "Author": "Brandon", "ReviewID": "R3NKSEU6ZWV3F8", "Overall": "5.0", "Content": "Like some others, I too bought this at Best Buy about a year ago. I thought it was a steal then and still think it's a steal. At the time not even Costco or online retailers could match the price at Best Buy - $550. To get a Core i3, 7200 RPM 500 GB HD, 4 GB Ram, HDMI output, and more, it's truly an incredible deal. Even today, a year later, it's pretty tough to find a laptop that matches these specs. I've had it on a cooling pad since day one - I just think it's a wise investment to allow proper airflow while the laptop is on my lap or on fabric (blankets, etc). I've never had an issue with over heating and move it around the house quite often...living room to kitchen to bedroom to basement. This is a great laptop and I recommended it to a friend that bought it and was happy with it as well. Not sure why some folks are having issues of it but I still would buy this laptop a year later. HP is far and away the best PC manufacturer out there today and I think they are pretty close to matching Apple (which is WAY too expensive for what you get).", "Date": "April 3, 2011"}, {"Title": "Jury is still out", "Author": "A. MacCabe", "ReviewID": "R3FF2NMPFHBFZD", "Overall": "3.0", "Content": "I've had this laptop for a week. The first issue I noticed was the touch pad buttons were too hard to press. The second issue is that Norton seems to be built-in. I've installed Web-Root Anti-virus, but the system keeps asking me to activate Norton. It also seems unstable. Windows 7 and/or IE8 seem to be crashing twice a day. Not sure if there's a hardware compatability issue or if it's the software.I love the weight and feel. For the price this is a great laptop.", "Date": "May 10, 2010"}, {"Title": "It was okay for 9 months...", "Author": "Kevin Becker", "ReviewID": "R3RFW7455UKU0O", "Overall": "2.0", "Content": "Mouse does freeze and is hard to use... my hard drive crashed for no reason last week and I lost everything... So now they are replacing the hard drive and Geek Squad is charging me 50bucks to install the operating system.. i'm about ready to go back to a desk top.", "Date": "January 6, 2011"}, {"Title": "Dislike this laptop", "Author": "M L", "ReviewID": "R1LTL43C4DLD4A", "Overall": "2.0", "Content": "I bought this laptop about 2 weeks ago to replace a HP Pavilion. I thought it had relatively good features for the price and I liked the look of it. My problem has been with the trackpad. The trackpad is made of the same material as the outside cover and is not very responsive to the touch. I have tried multiple settings to remedy the problem with no luck. I am disappointed with the performance of this laptop and although it is brand new I will probably replace it soon.", "Date": "March 12, 2010"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "HP G62-144DX Notebook PC with Intel CoreTM i3-330M processor - 15.6\" LED Display / 4GB DDR3 Memory / 500GB HD / SuperMulti 8X DVD±R/RW / Built-in HP webcam & microphone / 802.11b/g/n WLAN / Windows 7 Home Premium 64-bit", "ImgURL": "http://ecx.images-amazon.com/images/I/41HgG1yEVsL._SX300_.jpg", "ProductID": "B003AOPV02"}}