{"Reviews": [{"Title": "Good fast nice looking laptop", "Author": "John \"Casual User\"", "ReviewID": "RGPKK797F6OJ3", "Overall": "4.0", "Content": "So I purchased this from the microsoft store and really love it.  Its aluminum case is beautiful and solid feeling.  Its fast and gets a 6.6 for windows experience processor and a 4.5 for graphics.  In fact I wrote a detailed review on my blog but heres some points in a nut shell.  There a couple of emissions of the product discription as it does have the fingerprint scanner and webcam. It seems to be the same as the HP Pavilion dm4-1060us 14.1-Inch Laptop but sold  thru microsoft hence the microsoft signature.  Microsoft signiture means no bloatware so it should be easier to set up.But mine had touch pad click problems.  I initially tried to change mouse settings but it still failed then I called microsoft tech support (its a microsoft signiture) and he told me I was changeing windows mouse settings not driver.  When I went to to mouse driver settings they were grayed out but I was able to hit restore default and that corrected problems and got mouse settings ungrayed.Another low point is that I actualy only get about 4 1/2 hours of battery life for browsing without pluging in so 6 1/2 is very optimistic.As for bloatware free- I had to download the simple pass finger print scanner software from hp to use the fingerprint scanner and install the hp web cam software.  You would think that microsoft would have already installed these programs. The antivirus thats installed is Microsoft security essentials which I like better then norton and they include office starter 2010 a scaled down version of word and excel.  They also have a trial version of office 2010.  they also have click to install software form hp if you like the hp stuff.  But overall its pretty free of bloatware just wish that Microsoft would know what HP stuff is needed and what is not.", "Date": "October 20, 2010"}], "ProductInfo": {"Price": "$725.00", "Features": "Intel Core i5-430M 2.26 GHz\n500 GB SATA 7200 RPM\nWindows 7 Home Premium\nIntel HD Graphics with shared graphics memory", "Name": "HP Pavilion DM4-1062NR Notebook Pc", "ImgURL": "http://ecx.images-amazon.com/images/I/41NIhagwYCL._SX300_.jpg", "ProductID": "B003UPF3NQ"}}