{"Reviews": [{"Title": "Perfect everyday work horse!!!!", "Author": "Mike", "ReviewID": "R3HYA5Z07AVZ9S", "Overall": "5.0", "Content": "I'm not sure where the above bad reviews came from, but I find it hard to believe that anyone had such a bad experience with the same system that I bought from Amazon.  Looks like most of the reviews are for computers bought from someone else or even directly from Dell, and the guy that bought 3 in the last year and had all of them crash within a month after the warranty expired?????  well that doesn't make since.... they all come with a 1 yr warranty, and if he bought three within the last year, then they would still be under warranty.....  but I digress,,, and here is my review:I bought the Inspiron i1545 that is sold on Amazon.com and it has more than met my expectations.  I figured that a $619 laptop would be the low end of the spectrum when looking for performance, but this has all the componants of the \"high end\", as far as RAM and Hard disc.  Win 7 makes it easy and has very fast start up and shut down times.  It runs very effeciently when I have multiple windows open and I'm gettting close to 8 hours between charges (so far).  I did a ton of research for computers before making this purchase, and even went to places like Best Buy so I could get a better feel for what the computer looks and feels like.  This Inspiron has all the qualities I was looking for: Sleek, light weight, incredibly clear screen, and responsive keys.  Add that together with the 4GB of RAM, 500GB of Hard disc, and I love the \"Dell Dock\" that allows me to put all my icons in one place, which keeps my desktop clean and professional looking.My opinion is that you cannot go wrong with this system.  You certainly get more for your money!", "Date": "May 31, 2010"}, {"Title": "Never again", "Author": "Alessandro Csg \"Jared\"", "ReviewID": "R2JFYOO78RJTAK", "Overall": "1.0", "Content": "I have purchased three from this company in the past year -- we have twins in college and each needed one -- then one for personal/home use.Within a month after each warranty expired, the hard drive died.  Nothing could be done but order a replacement - which first requires a $49 diagnostic fee....before they can even tell you what the part is that is needed and how much that will cost.They cannot replace items lost on the drive --- so be sure to have your own external hard drive or system for back up.  They are no help.This happened three times!!  Three different laptops!!  All with simple use at home and university.  Each just AFTER the warranty expired -- and they are in India -- and make no adjustments to \"policy\" -- and have the most effective system of blocking customers from access to attaining help.Never, ever again.  Burned THREE times -- with THREE different laptops.  Never, never again.", "Date": "February 19, 2010"}, {"Title": "The last Dell I will ever buy.", "Author": "Shawn \"djsaint\"", "ReviewID": "R3VGDYX083A6M4", "Overall": "1.0", "Content": "My wife and I have been loyal Dell customers over 10 years and four machines. All our previous machines have performed well and we have never had much reason to call customer service for anything. The few times we did (years and years ago) were reasonably pleasant experiences, though. My impression of Dell has always been that they are a solid company that produces solid products.Not now.This laptop, which is my wife's, has been nothing but a nightmare from day one. Pathetic battery life, hardware and software issues, trackpad problems, cursor jumping around, intermittent wireless problems, a shoddily-made machine with flimsy screen hinges that easily break.Dell's customer service has been the absolute worst experience I have ever had with any company in my entire life. I started out trying to return the unit, but quickly found out that they count the number of days that you have had the computer as starting on the day you order the unit, not the day you receive it, so I was two days past the last day I could return the unit. After being transferred back and forth between two different departments who each thought the other department was supposed to help me, I finally found someone who understood the issue and said he would work on getting special approval to return the unit and then call me back. He also sent me an email. He never called back, never responded to emails, never answered the phone, never returned calls. Anyone else I talked to acted like they knew nothing and told me I could not return the unit. Then I tried to appeal to their business sense, by trying to exchange the unit for a higher model (figuring that if they saw I wanted to pay them more money, they would forgive the 2-day thing).It took me two more weeks of calling every day to find a guy in their corporate customer service group who (even though he shouldn't have even helped me) agreed that what I wanted to do made good business sense and would help the company hold onto a loyal customer. It took him two more weeks to get what he told me was internal approval for the return (their system only allowed them to process it as a return, not a repair or replacement). He even CC'd me on the email where the manager approved the return and gave him instructions on how to process it. I was told I would receive a return code and instructions on how to return the unit for credit. A week went by--nothing. I called and emailed the guy over and over. No response. I finally got someone else who's email address was on the approval email to respond, who explained that the person who approved the return was in one of two different departments who had to approve the return. He said what everyone else always told me--that he would personally take responsibility for resolving my case. He gave me a phone number that was supposedly his direct number and an email. Never heard from him again. The phone number went to a generic mailbox.After months of getting the runaround and taking every my lunch hour every day to sit on the phone while eating a sandwich, I simply gave up and decided it just wasn't worth it for a $560 laptop. We are already shopping for a replacement after 7 months of owning this thing. Guess who we won't be buying it from.", "Date": "August 14, 2010"}, {"Title": "Plenty of power, easily upgraded - overall a very good laptop", "Author": "Go Terps Go", "ReviewID": "R3K6LYPCYEGPIH", "Overall": "4.0", "Content": "After seeing some of the other reviews I thought I would add my two cents worth, as it may help out some of you who are looking to purchase an Inspiron 1545.I've owned this laptop now for a little over a week and I am very happy with the experience so far. I am very knowledgeable about computers, and currently run several machines running Windows 7, Windows Home Server, Mac OSX, and Ubuntu. I have also worked in IT support in the past, so diagnosing and upgrading PCs is something I'm very comfortable with.Quick Pros and Cons List:PROS:+ Windows 7 (it really is a nice and stable OS)+ Intel dual-core T4400 processor (works well for most users, easy on battery life)+ 4GB of RAM (helpful for running programs simultaneously, such as Office, Photoshop, Media Center, etc)+ 320GB hard drive (plenty of storage for most users)+ Integrated 1.3MP Creative Labs Live! webcam+ 7-in-1 media card reader (almost a necessity today)+ Easily upgradeable (discussed below)CONS:- T4400 is a dual-core processor, not as powerful as a Core 2 Duo, or the current Core i3 (1545R)- Memory is slower 800MHz speed, not current 1066MHz (1545R)- Wireless (wifi) card is A/B/G, but not N-spec- While the webcam is 1.3MP, it isn't of the highest quality - but it's okay- VGA-out included, not HDMI-out like on the newer 1545R- Bluetooth not included (though upgradeable)- High gloss surfaces do attract fingerprints (not a big negative)OVERALL IMPRESSIONS:I've owned many Dells, and this is the third computer I've purchased from Dell this year... not because something was wrong, but they've had good deals on desktops and laptops this year. This is the first entry level laptop that I have purchased from Dell, and overall I am happy with the design, layout, and quality of the build. The high gloss plastic areas on the palmrest and LCD bezel are obvious fingerprint magnets, but not as bad as an iPhone or iPod. They keyboard is laid out well, with good distance between the keys and a nice feel when typing. The keyboard includes dedicated buttons on the right hand side for Home, Page Up/Down, End, and the four arrow keys.The hard drive, a Seagate Momentus 5400.6 has decent storage space at 320GB, though it is slower at 5400RPM with an 8MB cache. After formatting, you have about 300GB of usable storage. The memory for this machine is 4GB, though the motherboard can support up to 8GB. The memory speed is 800MHz, which is fine, but is slower than the current 1066MHz memory available. It would have been nice if Dell included an HDMI video port, but instead chose VGA. The HDMI comes standard on the new 1545R with the Core i3 processor. The LCD is crisp and bright, with decent viewing angles. The native resolution of 1366x768 is good, though a little compact, but makes viewing 720p video very nice. The AC adapter is the slim variety... the only issue is that the power plug into the computer fits a little loosely - though probably on purpose to prevent damage to the laptop if the cable is snagged by a passerby.UPGRADEABILITY:The nicest aspect of this laptop is that if you find that you need more speed, hard drive space, memory, faster wifi, or even bluetooth - all of these components can be easily upgraded. Reading the service directions at Dell, you can see that taking apart the Inspiron 1545 is easy and straight forward. By removing the keyboard, you can easily add the bluetooth module and cable, which together go for about $25 on eBay. By removing the bottom cover, you can replace the memory, wifi card, and processor with little difficulty. An Intel 5100 N spec wifi card goes for about $12 on eBay. You can also add memory if need be - up to 8GB is supported. The processor can also be replaced, though make sure that the processor you choose is supported by the laptop's bios. The 1545 supports Intel Socket P (478-pin Micro FCPGA) processors; with the bios specifically supporting the Celeron 900, Dual-Core T4200, T4300, T4400, and the Core 2 Duo T6400, T6500, T6600, P7350, P7450, P8600, and P8700. The faster processors, like the P8700 include more onboard cache, faster processor speed, faster bus speeds, and virtualization. Replacement processors like those mentioned can be found on eBay for around $20-150. The hard drive can also be easily upgraded - I installed a new Western Digital 64GB SSD, which took about 60 seconds to install. The hard drive slot is on the right hand side, and comes out with the removal of two screws. I installed the new wifi in about 60 seconds, adding bluetooth took about two minutes. It doesn't take a lot of know-how to upgrade these components - just a screwdriver and a quick read of the manual.CONCLUSION:It's a good laptop for the price, which can be upgraded into a better computer easily and cheaply... all you have to do is read the manual, which is straightforward. I usually keep computers for about a year or two, and by next year I'll probably be ready to sell this at a decent price and use the proceeds to get another Inspiron - but it will have been worth it for sure. In my opinion, for the price, quality, and support, you can't go wrong with a Dell.", "Date": "August 6, 2010"}, {"Title": "Awful", "Author": "Sandra Davern \"DogLuvr\"", "ReviewID": "R1N5U3TC7JQDWC", "Overall": "1.0", "Content": "I have purchased two of these now.The one I bought at Best Buy lasted 5 days before having hardware failure.  I returned it.I bought the second one at Staples.  It lasted 3 hours before giving an error saying, \"No hard drive detected.\"Don't buy this laptop!", "Date": "March 15, 2010"}, {"Title": "Bad Screen and No Service", "Author": "Holly Blanc Moses", "ReviewID": "R3EF240TZSO81O", "Overall": "1.0", "Content": "I bought my Dell Inspiron a few months back. It has become apparent that it is not what I am needing. The screen resolution - although 15.6\" large only produces a stretched 1024x768 style image that leaves me unable to see most apps.In addition the mouse cursor stops working periodically and Dell says they will not take a trade-in or return since it is past 21 days. Instead they asked me to buy a new one. The one-year service is a joke because they will not help with the problem.Seriously, I do not think I will buy Dell again. I even offered to upgrade if they just gave me 50% of the machines value in trade-credit but no they said enjoy your Dell.", "Date": "March 30, 2010"}, {"Title": "You get what you pay for", "Author": "Amazon Customer \"Rio\"", "ReviewID": "RFVD17GW07NS9", "Overall": "2.0", "Content": "I got this dell inspiron 1545 on my birthday around December and its almost been a year since I had this laptop. This laptop is a secondary laptop which is an decent laptop for office, and internet use but that's about it. I would not recommend this for gaming, graphics or even photo shop. This machine is not upgradable after 4gb of ram and the video card is garbage, and this network card does not support wireless N, also I'm an IT guy and Ive owned lots of laptops and net-books but this one was by far the worst of them all. This thing has so many bugs and problems I simply just gave it away to my wife after fixing it many of times. The good side of this laptop is it is really good looking but attracts lots of finger prints. Also if one of the buttons fall off your keyboard good lucking fixing it because the bottom of the button is made of cheap plastic it will break on impact. I've had this laptop have hard drive failure, buttons jamming, and also it locks up on some movies I try to watch or even play. Another problem with this laptop is some times the right click will just turn on by it self causing me to highlight everything or right click on stuff for no damn reason. I have an older laptop with Hewlett Packard AMD dual core that runs perfect and its two years older than this crap. Overall I will never buy a dell again and if you have a problem good luck getting help from dell tech support, they will basically keep transferring you to other departments until some one hangs up on you and you have to start all over again. If you looking for a laptop for overall quality I would suggest looking else where and finding a more up to date computer that is not a DELL and one that supports N wireless, have a separate video card like Nvidia or ATI.", "Date": "September 12, 2010"}, {"Title": "Amazon/Dell i1545 laptop", "Author": "C-DRIFTERS", "ReviewID": "R26CHAY868QCU8", "Overall": "5.0", "Content": "After searching the internet for a product that I thought would suit our needs I found the item, Dell i1545 on Amzaon.com.It was relatively easy to work through the Amazon site and purchase the product. Delivery was on time and the product arrived in good condition.Amazon kept us informed on the delivery status and we felt included.The product itself is as it was described on Amazon and is currently working very well. The new Windows 7 is easier to get to grips with than when we first started with XP all those years ago.Kind RegardsRay and Irene McTearDell Inspiron i1545-4583JBK 1545 15.6-Inch Laptop (Jet Black)", "Date": "July 11, 2010"}, {"Title": "Did I get lucky with mine?", "Author": "Kallie White", "ReviewID": "R1NJAZFBLLGGXY", "Overall": "4.0", "Content": "I bought this in the beginning of May.  It's late June and just today the wireless adapter went kablooey.  I spent an hour on the phone with Dell trying to isolate the exact issue.  They couldn't find what caused it to stop working, so they offered to send out a replacement and then went on to explain how to put it in myself.  They will be calling back in a few days to let me know when the part ships and then again to make sure I have it installed correctly.I did have to call them three times before I got the help I needed, but I'm sure that's probably because their reps are not native English speakers.  This frustrates me, but I guess I get crappy service from American reps all the time with other businesses, so why should the outsourced people be expected to be better.Anyway, I like this computer, it's sleek, it's light, it does the job for my online schooling and playing online java games.  This is what I bought it for.And I must say, if you use your computer on a daily basis, you should always have a backup.  Computers are not made like they used to, so your 10 year old Thinkpad may still work, fine, good for you.I'm going to cross my fingers and hope that this thing makes it a year.  Even the dummies at Best Buy said that's about the normal life expectancy.", "Date": "June 21, 2010"}, {"Title": "has a sound adjustment problem", "Author": "suhas", "ReviewID": "R266LOTGL2ESTE", "Overall": "4.0", "Content": "everything of this laptop works systematically but the only problem is if i remove the headphone pins and again plug it than again i have to adjust the sound system accept everything works fine .thanks .", "Date": "November 21, 2010"}, {"Title": "Big Problem Dealing with Dell", "Author": "Chun O. Hall", "ReviewID": "R1Z1IJVBPVJZDR", "Overall": "1.0", "Content": "I placed an order with Dell for the inspiron 1545 after reading the CNET review, and then searched the reviews on Amazon; well the opinions on this website are usually dead on.  After having read the poor reviews I called back Dell less than 24 hours after placing the order (on a weekend) and the representative repeatedly attempted to tell me that it was too late to cancel the order, in spite of the fact it would not be shipped for another week.  Now I have been around for a while and that just didn't seem reasonable.  I kept asking to speak to a supervisor and several times(X7) in a row he repeated stated that the supervisor would not be able to help, they serve administrative functions????  Finally, he placed me on hold for 5 or 10 minutes only to tell me that the supervisor was busy but that they approved my cancelation.  I am writing this review because it is irritating the way they are using this tactics to hold onto a sale.  If they are willing to play these games there are real problems with the Dell organization--beware!!!  I can just see a young person being intimidated by this approach and in makes me angry.  I decided to place an order for a Gateway laptop since I have been very happy with the Gateway desktop I have.", "Date": "July 19, 2010"}, {"Title": "OK laptop, with some problems.", "Author": "Jeffrey", "ReviewID": "R7YLTCGU88NMN", "Overall": "2.0", "Content": "I had this laptop since July 2009. I still own it. The computer overall is OK, but there are some problems with the laptop.1. BATTERY LIFEAfter plenty of recharges (100 maybe), it said that the battery is dying. The price for the replacement batteries are a painful $149.2. Typing issuesWhenever I type on the laptop, sometimes, the text I'm trying to enter in the textbox completely disappears, and there's no way I can recover it, unless I copied the text into the cache or RAM.3. CursorSometimes, when I boot up the computer, the cursor starts acting weird. I don't know the reason why, but it does get cured after a minute or 2.Overall, this is a messed up laptop. Buy a different laptop.", "Date": "January 3, 2011"}, {"Title": "Dell Laptop", "Author": "Eddie Khoriaty", "ReviewID": "R13IF1K50P6TIA", "Overall": "2.0", "Content": "I'm not sure I would order from Dell again.  The customer support isn't that great.  The way they custom build the computers is strange because if some component isn't available you don't get your computer when you want it.  Did I mention the batteries on these things are horrible.  I keep having to replace them at considerable expense, aggravation and computer down time.  Why buy a laptop if it has to be plugged in all the time or it shuts down.", "Date": "May 31, 2010"}, {"Title": "Never again!", "Author": "Samantha", "ReviewID": "RN6K3C0BX0JVS", "Overall": "2.0", "Content": "Bought this laptop and a couple months later it was toast.  I used it for college and by the time my semester was over, so was the laptop.", "Date": "January 2, 2014"}, {"Title": "never again", "Author": "Abigail Stella", "ReviewID": "R2C2LL1WEIE1DW", "Overall": "1.0", "Content": "I am going out of my way to warn all future purchasers of my horrible experience with Dell and this computer. I purchased this labtop two years ago from Dell at a premium with the extended warranty on the hardware and software I thought. Within 24 hours of receiving this computer, it crashed. After 4 hours on hold and limited moments actually speaking (or trying to hold a conversation due to significant language barriers) with the technicial support staff, I was told that my software had crashed and that this was not covered in my warranty. My options were to send the computer back (at my own shipping costs) and with a -300$ restocking fee for the computer that I ad purchased 24 hours earlier or pay 200$ for a software warranty for someone to resotre my computer. After extreme frustration, I ended up paying the 200$ to have my computer fixed over the next few days (with me doing the work and spening my time to do it).Since then, it has never worked well. I frequently had to use startup launcher to help turn it on despite multiple spyware and antivirus products recommended to me to purchase by the dell technicians.Most recently my hard drive crashed for no reason.My experience with the technicians and managers was frustrating, time consuming and has only led me to believe and want to let the world know that I will never again purchase a product from Dell and recommend that others take my advice as well.- A very disappointed customer", "Date": "January 29, 2013"}, {"Title": "white video screen bad motherboards , dont last 2 times", "Author": "user", "ReviewID": "R1JZ1NE4JJNSJW", "Overall": "1.0", "Content": "this may be ok brand newbut not something that will lasthad the same problem with 2 motherboardsthe external video works but you can feel the hot spots on the components on the bad video chips, for the lcd, fades to whitethe old gateways that have the duel fans are far more betternot some heatsink stuck on a cardthe only think dell makes on this is theDell stickerall the inside is china japan or asia anyhow", "Date": "April 4, 2012"}, {"Title": "Great, durable laptop.", "Author": "Nick Ferguson", "ReviewID": "R6X6UL31Q9PH3", "Overall": "4.0", "Content": "got this laptop for Christmas of 2009, and It has been running great ever since.  And it's experienced heavy usage over these almost two year.  I am currently a freshman in college studying computer science and I use it almost all of my classes.  Many previous reviewers said that they had wireless problems, and the solution is simple!  Go to dell.com and download the latest drivers for your wireless card!The only real con I have is the graphics card, or should I say lack there off.  It just runs integrated graphics, which aren't to good.  It can play most games on low settings, but I definitely would NOT get this for a gamer.  If you plan on using this for anything else it is a solid buy though!", "Date": "October 13, 2011"}, {"Title": "After a while, it's terrible", "Author": "Patsy Fawaz", "ReviewID": "R2OIUWFAI4H3U8", "Overall": "1.0", "Content": "I've had this computer for about 8 months. In the beginning, it seems like a good computer, but after a while, it starts freezing on you, it doesn't recognize new batteries, and it's internet connection is lagging. It actually froze on me when I was trying to write this review. Don't waste your money on this computer.", "Date": "August 9, 2011"}, {"Title": "NO MORE DELL", "Author": "M. Camero", "ReviewID": "R3HP56FSK16JL9", "Overall": "1.0", "Content": "I purchased this computer a year ago and in this time span i have had numerous problems. A few days after purchasing my laptop my hard drive crashed for no reason and would not boot up.Then my right mouse button stopped working, i was disappointed. Then my webcam stopped working while I was in the middle of a video chat and it just died in the middle of it and wouldn't even detect it. Then my all my USB ports stopped working...WOW. Then a short while later my DC Jack(Power Plug In) stops working i am not able to charge my computer or even turn it on anymore, at first i didn't know what was wrong with my computer, so i call dell (somewhere in India) and they want to charge me per minute to find out and diagnose what's wrong with my computer of coarse i say no. Then i take it out to be repaired with my own money to a local repair man who charged me $150 to have it repaired. And then a short while later my battery dies(now i'm MAD). After that to add insult to injury my battery charger stopped working as well. As my closing statement this is the worst computer i have ever bought, DO NOT BUY IT, IDK about the seller though i bought it form dell. Get an Acer, like I am about to, DONT consider buying this, I WILL NEVER BUY A DELL AGAIN!!!", "Date": "July 18, 2011"}, {"Title": "WORST", "Author": "tz07hv", "ReviewID": "R394V0CLNPTR23", "Overall": "1.0", "Content": "This laptop has caused me so many problems. There is always a problem with it, whether it be the battery, the hard drive, or both. I've taken good care of it and it still has issues. Hoping to get a new one soon and staying the hell away from Dell.", "Date": "April 24, 2011"}, {"Title": "A good laptop for a good price", "Author": "Muntather J. Aldamok", "ReviewID": "RQLZDJR3HPMY", "Overall": "3.0", "Content": "Pros:1- decent processing power2- decent ram3- good priceCons:1- fingerprint magnet2- not good for advanced 3d gaming", "Date": "February 20, 2011"}, {"Title": "low build quality", "Author": "M. Walker \"thedude\"", "ReviewID": "R3L11YA0ZKB6R2", "Overall": "3.0", "Content": "I have had this laptop for a year and it has been able to function normally with annoyances that occurred early (i.e. screen can only be positioned at a certain angle, loose connectivity of inputs, etc) small stuff that irks you but the laptop is still functional (too busy and not enough time to handle honestly). Now there are more non-related major internal problems a year later and I find it's just a hassle to deal with Dell at least from my experience. Might be fine if you plan to rarely use it, just don't consider it a wise purchase by any means.", "Date": "June 20, 2010"}, {"Title": "Gets the job done", "Author": "S. Computers", "ReviewID": "R29ZU5LUPEYLJV", "Overall": "4.0", "Content": "I've installed close to 8 of these laptops for my clients over the past year.  Each system has been dependable, and I've received very few complaints on them.  Some minor issues with the system is a heavy weight with a limited battery life, but overall I'm happy with them.", "Date": "March 1, 2010"}, {"Title": "great machine, great service", "Author": "maximom", "ReviewID": "RUC7MIS0ZUDBH", "Overall": "5.0", "Content": "This is an great machine for the price.  I had a special request for delivery, and it was taken care of swiftly and efficiently.  Thank you!", "Date": "September 2, 2010"}, {"Title": "Pay attention to the bad reviews.", "Author": "Deimos \".\"", "ReviewID": "R3G2P0F0Y9L0PB", "Overall": "1.0", "Content": "Make sure you read through all the bad reviews before purchasing this piece of garbage.  I bought one and it lasted about 4 months and that wasn't even 4 months of even acceptable performance.  The Dell Inspirion crashed every 20 mins, even when the OS & ram were upgraded and Dell's support was next to nothing for this product.  Again make sure you read the negative reviews on here before buying because you WILL have all the same issues if the laptop simply doesn't die a miserable death right away.", "Date": "June 17, 2010"}, {"Title": "I am impressed", "Author": "very good", "ReviewID": "R2AK3449R6M9OY", "Overall": "5.0", "Content": "I am very impressed with this seller. From buying to receiving was so fast I almost felt like I bought from the store. Good Job.", "Date": "March 22, 2011"}, {"Title": "DELL INSPIRON 15", "Author": "D. Davis \"NEVRCHEKD1\"", "ReviewID": "R3F4RZMCIZ6DYN", "Overall": "4.0", "Content": "So far so good ! I only hope the reviews Iv'e read on this unit re; hard drive frying out shortly after warranty isn't to be a part of my experience w/ DELL.. . . We'll keep ya posted tho.", "Date": "March 29, 2010"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0030T17FK"}}