{"Reviews": [{"Title": "A great performer, super portable, a pleasure to use (updated 4/11)", "Author": "Ron Cronovich \"Ron\"", "ReviewID": "R3A0F9L28I33IH", "Overall": "5.0", "Content": "UPDATE (April 2011)It's been nearly 6 months since I bought this machine, and I still love it.  However, if you're thinking about buying one and you don't need it right away, I suggest waiting.  CNET and others suggest that Apple will update the Air this summer and equip it with Intel's new Sandy Bridge processor, which will be a huge step up in processing power over the Intel Core 2 Duo that's in the current Air.  It's not likely that Apple will raise the price; their normal pattern is to add features and power but keep the same price.My original review (with minor edits and one new part at the end):*  *  *I purchased this exact configuration (the maxed out 13\") a few weeks ago.  It's my first Mac.There are lots of cool things about the new Macbook Airs. But what stands out most to me is the performance gain from an SSD instead of a spinning magnetic hard drive. It boots up from cold to ready in under 10 seconds. Seriously. It shuts down in about 4-5 seconds. Of course, you don't need to shut it down and boot it up from cold every time - just shut the lid and it goes to sleep in 1 second. Open it later and it wakes up just as you left it - in about 1 second. Really.  Windows laptops have this same feature, but in my experience it doesn't wake up about 1/4 of the time, so I stopped using it.  But it works perfectly on the Mac.Reading from and writing to the SSD is very fast, whether you're installing programs or loading files.  The difference is striking compared to my Dell XPS laptop, which has a 7200rpm hard drive and Core 2 duo processor with a higher rated speed.Now that I have a laptop with an SSD as the main drive, I will never go back to one using a spinning hard drive - it's yesterday's technology and just doesn't perform well, compared to this. Of course, part of the performance gain could well be due to the Mac OS X.  OS X seems more stable and refined than Windows 7 (and I like Windows 7, though I'd like anything after the disaster that was Windows Vista).The Air's integrated NVIDIA 320 graphics handles all my needs very well, though I am not a graphics-intensive gamer or video editor, just an average user.Battery life is really exceptional. At this moment, I've been running my MBA 5 or 6 hours since the last charge, and the battery meter still shows 44% remaining. Since I bought it, I have gotten at least the rated 7 hours of battery life every time. This, too, is due at least in part to the SSD.  Regular hard drives use a lot of juice - they have motors that physically spin a magnetic platter 5400 or 7200 revolutions per minute.  With SSD, there's no spinning disk and no motor, hence longer battery life.  [update april 2011:  battery life over the last 6 months is consistently at least 6 hours if I'm using the air intensively, 7 or more for light use (web browsing, word processing)]The MBA runs cool most of the time. After I use it for a few hours at a time, the bottom gets SLIGHTLY warm. This is a huge improvement over EVERY OTHER LAPTOP I've ever owned or used, which get VERY WARM or even HOT.I've only heard the fan come on ONCE - the first day, when I was installing MS Office using an external DVD/CD drive. Other than that, my MBA has been completely silent and cool.[update april 2011:  the fan comes on more often that my initial comment suggests, in particular whenever doing heavy writing or deleting of large quantities of files to the SSD, such as when installing or uninstalling MS office.  however, it remains true that the MBA's fan comes on MUCH less often than the fan on my Dell laptop at home or my Lenovo laptop at work, and it is definitely true that the MBA runs very cool most of the time, and when it gets warm, it's much less warm than my Dell or Lenovo laptops]Once I complete my transition from Windows to Mac, this MBA will be my main home computer.  For average users like me, it's plenty powerful enough.  At home, I have it plugged into an external monitor (which requires a $20 adapter), an external mouse, plus I have an external USB drive for backups and an Apple Super Drive (external DVD/CD).  I slightly regret buying the Super Drive; Amazon sells Samsung drives that perform better and cost about $30 less.The everyday experience of using the 13\" MBA is like that of using a regular Macbook, Macbook Pro, or other \"serious\" laptop.  What I mean is, when you're using it, it LOOKS and FEELS like using a \"serious\" laptop, not a laptop that makes compromises to achieve ultra portability.  But when you take it with you somewhere, THAT'S when you notice how wafer-thin and feather-light it is.And for something so remarkably thin, it feels very sturdy. Build quality is excellent.I read a lot of other reviews by long-time MB users, many of whom are disappointed that the MBA doesn't have the backlit keyboard that Macbooks have.  I've never had that feature on a laptop, so I don't miss it.  But for people who do, you can get an LED lamp on an adjustable arm that plugs into the USB port - not a very elegant solution, but functional and inexpensive - Amazon has some good ones pretty cheap.This is probably not a huge factor in your decision, but you might be interested in knowing the sound quality coming from the headphone jack is excellent. I did an A/B comparison between my MBA, my Dell XPS, and the Lenovo ThinkPad I use at work. I used high-end headphones to listen to a track encoded in iTunes at 320 bps on all 3 machines. The sound quality from the MBA's headphone jack was great, as good as my iPod touch, and way better than the Dell or Lenovo.On the other hand, tiny speakers built into the MBA are no better than the average laptop speakers.[update April 2011:  when I wrote that the built-in speakers were average, I hadn't used them much, and hadn't compared them to the other laptops I use.  since then, i have used them more, and it is clear to me that they are better than the speakers on my other laptops]If you're thinking about buying a MBA, I have a few suggestions.First, go to an Apple store or Best Buy and see one in person. Play around with it.Second, make sure you know all the options available at time of order. The 11 and 13 inch MBAs can be ordered with upgrades (bigger SSD, faster processor, more RAM). But, once you buy a MBA, you may not be able to upgrade these components later. (Apple says you cannot. Some user forums say you can. I'd rather not take my chances.) So, you should probably opt for as many of the upgrades as you can afford at the time of initial purchase.*  *  *update april 2011:  my Dell xps laptop is 3 years old and on its last legs.  For work, I need to keep one foot in the windows world.  I was thinking of getting a cheap windows laptop for this purpose, but then learned about boot camp.  Boot camp comes on all new macbooks, including this MBA, and allows you to create a windows partition on your SSD or hard drive.  Then, you can install Windows 7 or Windows XP on this partition, and any Windows software you might need.  When you boot up the macbook, it'll let you choose whether you want to boot to Mac OS or to Windows.  If you choose Windows, it runs Windows natively - not in an emulator - and therefore it runs at full speed.I did this last week.  Creating a windows partition and installing Windows 7 went very smoothly.  Installing software, such as Office 2010 for Windows, went very smoothly (and relatively quickly due to the fast write speeds of the Macbook Air's SSD).  Since then, I've been heavily using the Windows side and going back and forth between the two OSes and it works really great. Even though the Macbook Air is not a powerful machine by today's standards, it runs Windows 7 and Windows applications very very well.  It almost perfectly replicates the experience of working on a Windows laptop (except that Mac keyboards do not have home, end, page-up, and page-down keys).  All of the peripherals I use with Windows laptops work with the Macbook Air, whether I boot into Windows or OS X.At this time, I have fully migrated to the Macbook Air as my main computer.  I'll be retiring the Dell soon and most likely never buying another Windows machine.", "Date": "December 5, 2010"}, {"Title": "Great notebook - some things to keep in mind", "Author": "Wm_247", "ReviewID": "R328EMPB97G3BM", "Overall": "4.0", "Content": "I have had a notebook with this exact configuration for a little over a month. I have been a Windows user since the days of Windows 3.1 and a Linux user since at least Red Hat Linux 6, so I've written this review from that perspective. I still haven't made the \"switch\" completely as I run Windows and Linux VMs using Parallels to use software that is not available for Mac OS X. Anyway, here are some initial thoughts:Pros:- Very light. While lighter laptops have been available for some time (the Thinkpad X300 comes to mind, for example), you will be hard-pressed to find one that has a 13.3\" screen, a 256 GB SSD, and a large and well-designed touchpad.- Certainly powerful enough to serve as your main computer. I have been using my Air as an ultra-portable desktop. At work and at home, I plug it into a monitor and a USB hub that is connected to all my peripherals (keyboard, mouse, external hard drives, Kindle, cell phone, memory sticks etc.). This gives me plenty of desktop space to work with (13.3\" widescreen is barely enough to display half a vertical page of text at a comfortable font size), while giving me the power to carry my work with me wherever I go. I normally have 10-20 browser tabs, a few Office documents open, some scientific or data analysis software and at least one virtual machine running. Never has any task, such as starting an application or opening a file ever been bogged down.- The lack of a CD drive, while not a pro, has not been an issue for me. After installing Office, the Adobe suite and some other programs, I have not used a CD drive and will probably not need one for a long time. I am glad that I am not lugging around a device that I don't need. My next laptop, even if it isn't an Air, will not have a CD drive in it.- The trackpad. I love the mouse gestures.- The screen. Very good color reproduction, great viewing angles, excellent contrast. I don't like it that it's glossy as dust is more visible on it, but I can live with the glossiness.- Battery life is great. I don't know how many discharge cycles the battery will last, but currently, I can easily get 7 hours when just writing documents and browsing the web (with no Flash).- The SSD makes a difference. While not the fastest SSD available on the market, everything feels snappy. Boot times are 10-15 seconds, starting applications is very quick and because there are no moving parts, you can safely toss your laptop onto your bed without worrying about a hard drive crash!Cons:- No Kensington lock slot. There is no real way to physically secure the Macbook Air. This is a well-known issue for the last few years that has even been discussed on Apple's own forums. The fact that Apple has chosen to ignore this consistently makes me feel that their vision is to see the Air as a toy, or as a device for media consumption, not as a laptop for real work. The absurd thing is, some people are so Apple-deluded as to suggest that a \"workaround\" is to carry the laptop with you wherever you go, even for 5 minutes to go to the bathroom or to grab a coffee. There are third-party devices available that are basically steel pieces inserted through the monitor lid hinge, but none of them work when the lid is closed.- The keyboard. After using Thinkpads for close to a decade, Mac keyboards just don't compare. The keys have very little travel, and typically need to be bottomed out for a keypress to be registered, which reduces your typing accuracy and speed. I get around this by hooking up an external mechanical keyboard whenever I can.- The fan, when it does come on, can be surprisingly loud. Fullscreen high resolution Flash video, 1080p H.264 decoding (with Plex or a similar package) and running quantum computational software is enough to turn the fan on at high speed. Under \"normal\" use, you are unlikely to ever hear the fan, which is great.- Occasionally, I feel like I am using an appliance. It's a strange feeling for someone who has been used to opening up computers and tinkering with them. Nothing is intended to be user-replaceable. Not the RAM (soldered onto the motherboard, yikes!), not the hard drive, not even the battery.- Apple makes many, many usability and user interface decisions that the user has no convenient way of modifying. For example, as far as I can tell, there is no way to close the laptop lid and ensure that the laptop does NOT go to sleep, without connecting an external monitor and a keyboard/mouse. Yes, there are third-party applications that can enable this, but why can't OS X provide this option to users in the first place?  Another example, I love Spaces. What would make it much more powerful is if I could redirect different spaces to different monitors, each with a menu bar at the top. Imagine how much that would increase your productivity. It has been trivial to do this in most Linux distributions for some time. No known way on a Mac. As another example, consider Time Machine. It's great and makes backup super-easy to do. However, there is no way to change the default backup schedule of hourly backups for 24h, daily backups for 1 week and weekly backups forever. How difficult would it be to add an \"Advanced\" button and allow users to change this schedule? Finally, OS X support for changing key bindings, without the help of a third-party application, is woefully inadequate. Want Num Lock to work? Sorry. The \"Home\" and \"End\" keys will not work the way you expect them to (with no built-in way to change the behavior to what you want), and the context menu key found on many Windows-style keyboards cannot be remapped to simulate a right mouse button click. Moral of the story -- Yes, Mac OS X is a UNIX, but don't expect the same level of customizability that you may have gotten used to in some other UNIces.- The Apple religion. It's strange how so many people have congratulated me on \"switching,\" as if I have completed a pilgrimage. Whatever Apple has done, one thing it has done very well is convincing users that PCs are irredeemable quagmires and that Macs are somehow infinitely better. A \"Mac\" is not such a different beast. Nearly everything at the hardware level is the same, except for a BIOS that many PCs still use, while Macs use EFI. \"It just works,\" is also a marketing tagline, not always the case. Macs do get kernel panics (the equivalents of Windows' famed \"blue screen of death.\") What Macs give you is a tightly integrated package that may not always be the most flexible for your needs. While \"Genius Bars,\" and hip-looking retails stores may be cool, the cost of these frills is going to be included in the products you buy.", "Date": "January 20, 2011"}, {"Title": "Awesome!!!", "Author": "A. Ring \"Learning Fast\"", "ReviewID": "RTBHMO7CWK2JN", "Overall": "5.0", "Content": "This is my second MacBook, and this tiny thing is better in every way than the MacBook Pro it replaces.  The only moving parts on this sucker are the screen and the keys on the keyboard.  Other than those it's just one big solid state device.  It really moves files around faster than any computer I have ever seen before.  In several cases I drag and dropped folders with hundreds of megs of files and they just copied in the blink of an eye.  So fast that I didn't believe it and had to verify that the files actually copied before I could believe it.It is really an awesome line of machines and in no way is it a \"limited\" machine like the Air's used to be.  This is going to be my main work machine.  It has the guts to do it too.  I'm just shocked at how fast it is!", "Date": "December 22, 2010"}, {"Title": "Absolutely Love it", "Author": "Jack Ryan", "ReviewID": "RVV8UQGR87KR4", "Overall": "5.0", "Content": "Absolutely love the Macbook Air. Light weight makes a huge difference when walking between airport terminals.4GB memory is plenty for daily computing needs. Matched with a high resolution 13.3\" screen perfect.Would have preferred an ethernet port without having to spend an extra $30 for the USB dongle.Purchased on Amazon but fulfilled by OnSale which is a subsidiary of MacMall. Fast shipper. No sales tax.Customer service was very good with e-mail for order inquiry & tracking number.", "Date": "December 29, 2010"}, {"Title": "Fantastic.", "Author": "David S. Patchen", "ReviewID": "R3NQYN0UTBDHDQ", "Overall": "5.0", "Content": "This is my second Macbook Air and it's amazing.  I went from a 1.86gh/2gb/128SSD (mid 2009) Macbook Air to this 2.13ghz/4gb/256gb Macbook Air and the difference is considerable.Aside from being amazingly light and beautifully designed, this machine is super fast and has excellent battery life.  I loved my old Macbook Air but I felt I had to sacrifice a few things to have such a light computer--with this latest version of the Macbook Air, Apple addressed all of these issues:1. The battery life is about 3X longer than my old MBA2. It charges very quickly--my old MBA seemed very slow to take a charge3. The screen is higher resolution so you have more 'space' in your 13.3\" screen4. Now two USB ports and no more port door to deal with.5. The hinges on the MBA were weak--now it's totally redesigned.6. With the 4gb of RAM and faster SSD it's ripping fast.At the risk of sounding like I'm drinking the Apple coolaid, I've got to say this is the best computer I've ever owned by a longshot.", "Date": "May 22, 2011"}, {"Title": "Fantastic device with outstanding performance - after an easy tweak.", "Author": "Michael Y", "ReviewID": "RY0NCRYBJ0I6H", "Overall": "5.0", "Content": "I love everything about this Macbook Air:  its build quality, the screen, the performance (instant on is awesome!) the touchpad, the weight, the size...I could go on.  There's one problem, though:  the fan noise and heat.  When rendering websites with Flash (like, say, Hulu), the MBA gets very hot and very noisy.  Sometimes, it overheated so much, it wouldn't be able to render the video smoothly, presumably because the CPU/GPU was dropping cycles. The scenes would be choppy and freeze occasionally - very annoying.This is a somewhat common problem with the Air, apparently.  In some forums, I found Coolbook, an app (unfortunately paid) that allows you to turn down the voltage on the processor.  This sounds terrifying and like a horrible idea, but it works.  The air is quieter, cooler, and gets even better battery life. I have no relation with the app developer, but I'm much happier with his app.  I installed it once, chose some settings, and haven't touched it since.A couple of minor gripes about the Air itself:  the speakers are somewhat tinny and don't have the volume of the Macbook Pro, and the lack of a backlit keyboard is a pain for travelers like myself. I'll happily sacrifice those little things for everything else the Air has.  Highly recommended!", "Date": "May 23, 2011"}, {"Title": "Great computer, but maybe too light", "Author": "P. Wong", "ReviewID": "R1BTOW6BYY9LQ0", "Overall": "4.0", "Content": "The MacBook Air 2.13 GHz, 4 GB RAM with 256 GB SSD is really a great computer to use. It is really light and faster than expected. The SSD flash drive really makes this a joy to use with the computer turning on very quickly and being very responsive. While being very light is an attribute, the hand rest area can be heard flexing with the slightest of pressure. I recently had to take in the laptop to Apple to have the trackpad replaced because it was acting very erratically after only 2-1/2 months of use. One possibility was that the trackpad area was moved out of alignment because the framing in this area is very thin. Be careful about just holding onto the front edge of the computer where its the thinnest. The other issue with the computer is the fan noise can be rather obtrusive when playing YouTube videos.", "Date": "March 6, 2011"}, {"Title": "AMAZING!!!", "Author": "Phil B.", "ReviewID": "R2CBQWU2IRICI6", "Overall": "5.0", "Content": "Well, I've only had the mac air 13 inch (258 gig, 4 ram) for 3 days, but so far, I've got to say that its AMAZING!!!  The only reason I gave it 5 stars is because I can't give it 6 or 7!  A few comments:*  Its so light, you'll forget its on your lap.  Just incredible.*  Screen is amazing. Great resolution.*  I'm trading from an old macbook pro with 128 gb to this one with 258 gb.  And my old macbook was almost tapped out with usage of 115 gbs.  However, after migrating everything to this new computer, I'm only using around 90 gigs.  Which seems to suggest that the macair is much more efficient at storing data.  Means that I didn't get 100% storage upgrade, but in reality, more like 122% storage upgrade! (NOTE:  I am not a computer geek, so may be missing something here, but nontheless migrating all my \"stuff\" uses less gigs than on my old computer.)*  So far, it doesn't heat up.  Stays cool and nice.*  Battery is fantastic.  First use got me around 8-9 hours, and then it only took a bit less than 2 hours to fully charge from dead empty.  I know its new and it will start showing some wear down after a few months, but at least out of the box, the battery life is performing as advertised.*  Videos from youtube, etc. run smoothly and nicely.*  Takes less than 15 sec to start from \"off\" position, and less than 2 seconds from \"sleep\" position.All these things are incredible.  But for me, I've saved the best for last.  Its amazing how QUIET this computer is.  I've read a few reviews about fan noise, but when I'm using it, its like having a magazine in my lap.  No noise AT ALL!!! Next to my old one....its like placing a new model lamborghini next to an old model a ford.  Just no comparison.  This is DEFINITELY the future of computing!!Now, I'm a photographer, and haven't had a chance to download my photoshop application yet.  So I may have some reservations once I've done that.  But until then.....I can't say enough good things about this machine!!!  If you are wondering if its worth the price.  IT IS!  Don't hesitate....just buy it!!!", "Date": "February 20, 2011"}, {"Title": "No Apple fanatic, I'm still falling for this computer", "Author": "Neal Lucas \"neal\"", "ReviewID": "R2SP8AUSOFK8G5", "Overall": "5.0", "Content": "I have very little to say not being a computer savvy person, but this machine is brilliant.I found I never use a spin drive anymore, but when I do I use the Samsung I bought off Amazon for $25.It's gorgeous and the solid state drive is AMAZINGLY quicker than a spin drive. AMAZINGLY!If you can find a good price, this is totally a good call.OSX is also so smooth - once you get the hang of it, its cleanliness and simplicity will turn you over.", "Date": "March 8, 2012"}, {"Title": "Fully satisfied", "Author": "csiega", "ReviewID": "RSIS0R8GG3ZX6", "Overall": "5.0", "Content": "Great product. Real fast and compact. It boots, wakes up, amazingly FAST. Top of the line.Service was also great. Promptly delivered as promised.", "Date": "July 3, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Apple 13.3\" MacBook Air 2.13GHz, 4GB RAM, 256GB Flash Storage, NVIDIA GeForce 320M (Z0JH-2.13-4GB)", "ImgURL": "http://ecx.images-amazon.com/images/I/31ACGy7jniL._SY300_.jpg", "ProductID": "B00487UR3Q"}}