{"Reviews": [{"Title": "Amazing laptop", "Author": "nesjimen", "ReviewID": "RKZ2AUP9JORFH", "Overall": "5.0", "Content": "I bought this laptop a little over 2 months, and it's been a pleasure working with it. I bought it used in very good condition. I was a little scared about buying it used, but so far it hasn't giving me any trouble. I'm very pleased with my purchase and would recommend this laptop to anyone that is on a tight budget.", "Date": "December 8, 2011"}, {"Title": "Dell Latitude D630 notebook", "Author": "Sandy Beach", "ReviewID": "R2BZAQDV0FOXUO", "Overall": "1.0", "Content": "We bought this computer for my sons birthday. Product was exactly as described. Very happy with our new computer. However, the box it was shipped in was way too big. it was not packaged right at all. It was bumped around alot in the delivery process. It was delivered in a timely fashion and it made it here unscathed. Proper packaging should be a priority in future mailings. But other than that, this was a great buy and the rest of the service we received was awesome:)*within one week of purchasing this product, the screen malfunctioned. We took the computer to geek squad and also a personal friend who fixes computers and we were told it would cost over 300 dollars to fix the screen. I contacted the seller several times before the 30 days was up and they NEVER got back to me. We now have a broken computer that the seller wont exchange or refund. Total waste of money. The refurbished parts were so old geek squad couldn't help fix it and told me I had to contact dell to see if they even had the parts. This computer is JUNK. I lost my money on this computer.", "Date": "July 24, 2012"}, {"Title": "great item for the price", "Author": "kevin sterner", "ReviewID": "R2CS1G98YYT205", "Overall": "5.0", "Content": "Have not had a problem with it since I bought it... In fact it's been running non-stop Great price for a good product..", "Date": "December 9, 2012"}, {"Title": "Dishonest seller", "Author": "Ann", "ReviewID": "RAJGNKZCKFNPO", "Overall": "1.0", "Content": "The seller lied about the size of HD. Item came with 80Gb HD while description says 120Gb HD. After my first review seller contacted me and appologised for confusion?? He gave an option of him sending a 120 Gb HD or $24.99 I chose the HD. He said I have to remove the feedback first before he send it and so i did. Two days later he asked for the service tag # to install all drivers correctly on the HD and I gave Him. I had to contact him to find out the status of the HD he promised to send. This when he is going to tell me he ran out all the ones he had kept on crashing so he ordered one. The day after he contacted me saying he received the Hd and set it up and send it off. I received it three days later Aug.4th. I asked some one to install it for me the person came today AUg. 12th to do so. When it was installed it came up with error saying 'internal hard drive not found' he reseated the drive same error. He placed the old one back it worked but theosophy called new one is not recognised. After looking on it he said see the HD is bent it is no good. I emailed seller EsYTeK Solutions (Israel) he was rude enough to say he has no control over what the tech did or didn't do and that he sent it in perfect condition. I watched the person who does very often carefully handled the HD. I had doubts about this seller upon receiving the item with incorrect HD. He is just not honest and businesslike. He needs to be addressed and stopped as he is not trust worthy. He is also asking me to send back everything then he will send me a full refund but I don't trust him to do so based on his genalship. This is poor customer service and lied on top of it. I am sooooooo disappointed and upset.", "Date": "August 12, 2012"}, {"Title": "Great and Economical", "Author": "Khalilah Saleem \"prettylady36\"", "ReviewID": "R9057594FKEVP", "Overall": "4.0", "Content": "I really enjoyed this computer and under the price range helps.  I paid under $200 Of course it is a refurbrished computer.  But it works like a brand new computer.  My son will get one as well.", "Date": "March 27, 2013"}, {"Title": "Great little computer for my kids", "Author": "Wendy Richardson", "ReviewID": "R2Z4FIICWLBQTY", "Overall": "3.0", "Content": "This works great... BUT I really wanted one that plays DVD's as well - and it won't.  Even after phone calls it STILL won't.  They had no suggestions.My beef is that I decided to use these people again to purchase another computer later.  The computer worked really well, but had a few little niggles that needed to be fixed (how it shuts down; and once it is, the inability for it to start back up again).  I could not get any response from them... they didn't answer phone calls, they never once replied to my emails - no matter how much I pleaded.  Finally one day I had a stroke of luck - they answered the phone - but by that time the screen had gone funny and I needed their help big time.  They told me to pack it up and send it back (at my expense).I'm now waiting to see how long it takes them to either send back my computer fixed, or email me with an idea of what is wrong with it... actually I'm just waiting for a response....................  I shouldn't complain I suppose, it HAS only been two weeks!  And in the meantime I'm using my kids computer.", "Date": "October 17, 2012"}, {"Title": "Exactly as described!", "Author": "S. Johnson", "ReviewID": "R383XAA8MZ5AT5", "Overall": "5.0", "Content": "This was an easy one.  The computer is exactly as described.  For a used machine, it was in exceptionally good cosmetic condition and complete with a good battery, Windows XP Pro CD (of course they had preloaded the OS for me) and even an instruction sheet with some commonly asked questions answered and phone numbers should I need additional help.  The machine works flawlessly.  Before purchasing this computer I sent an email to the dealer with a couple of questions and had an answer in less than an hour.  Three days after ordering it, I had it in my hands - that's FAST shipping.  I would definitely recommend this dealer for used machines.", "Date": "February 10, 2014"}, {"Title": "Good Buy", "Author": "Tom F Masters", "ReviewID": "R17SQHZ0NLY6YV", "Overall": "4.0", "Content": "Works fine, cabinet in good shape, monitor sharp I have to fill in  more words now one two three four.", "Date": "February 6, 2014"}, {"Title": "Reliable and trustworthy.  Solid machine, much better than HP.", "Author": "William Walz", "ReviewID": "R1BQBMJHORHO0P", "Overall": "5.0", "Content": "This computer was exactly what I needed-and exactly what was represented by the seller.  It is my second one from Tampa Laptops. Ran great right out of the box.  Solid, well-made laptop, much sturdier than any HP laptop I've had, which are more like throw-away toys in comparison.  I am very pleased with this machine and with the seller, both which have been proven to be reliable and trustworthy.", "Date": "December 5, 2013"}, {"Title": "Great laptop", "Author": "Paul Horn \"angelriver\"", "ReviewID": "R2975XLSVKHFNB", "Overall": "5.0", "Content": "I am really pleased with my Dell Latitude never had this much memory before so it's super fast and seems to be easy on battery so far. Picks up wifi signals better than my old Inspiron did. The price and shipping time was very reasonable and I would recommend this product/seller.", "Date": "October 17, 2012"}, {"Title": "Awesome computer", "Author": "Jackie612", "ReviewID": "R1LT5ZLSO0Y919", "Overall": "4.0", "Content": "This computer is fast, has great video performance and the battery lasts a long time compared to other computers I have bought.  I am very happy with this purchase.  My best buy yet off of Amazon.  Thanks!", "Date": "September 10, 2012"}, {"Title": "It died", "Author": "Terry Parcel", "ReviewID": "RZ30FEZTISNQ4", "Overall": "1.0", "Content": "I didn't have this laptop but a month or so when an error came up on the screen. After consulting with those that know how to fix it, it now either has to have a new hard drive or I have to buy a new computer.  I would have thought that it would have lasted a little longer than a month.  I would not buy anything ever from this company again!", "Date": "December 20, 2012"}, {"Title": "pc", "Author": "tracey david", "ReviewID": "R1GLHTGS7AHLQ6", "Overall": "5.0", "Content": "works good loves the lap top.. i would recomand  you all again.. everything good.. my kid will use it for collahe", "Date": "February 21, 2013"}, {"Title": "great purchase for me", "Author": "McDuff", "ReviewID": "R2SQ4CQKWKWLAU", "Overall": "5.0", "Content": "First off, this laptop arrived two days after I ordered it. I expected two weeks, it took two days! Thank you! Second, it's exactly what I wanted. And the battery was fully charged upon arrival. This was a great purchase for me!", "Date": "November 13, 2012"}, {"Title": "NOT ENOUGH GIGS IN HARD-DRIVE", "Author": "JAZMINE ROSE JOPLIN", "ReviewID": "R3TWLZQWNMBNZC", "Overall": "3.0", "Content": "IT FREEZES WAY TOO EASILY BECAUSE I THINK THE HARD DRIVE IS TOO LOW ON GIGS. JUST 60 GIGS ISN'T ENOUGH FOR IT'S MEMORY SIZE. ALL IN ALL THOUGH ITS OKAY. IT WORKS AND IT DOES A LIL' INTERNET. WOULDN'T SUGGEST GAMING ON THIS ONE THOUGH. IT COULD CRASH HARD DRIVE. BUT GOOD ENOUGH FOR A LIL' BIT OF SCHOOLING AND RESEARCH FOR SCHOOLS.", "Date": "May 19, 2014"}, {"Title": "it wha it is", "Author": "Miguel gomez", "ReviewID": "R22QNKWXHY7KAY", "Overall": "3.0", "Content": "great lap top, it was not fully functional. how ever i did a system restore, it worked for a few months and never again turn on.", "Date": "April 18, 2014"}, {"Title": "Hmmmmmm.....", "Author": "sylviashrv", "ReviewID": "R3JTV7LBSU6PD0", "Overall": "2.0", "Content": "I bought this computer for my daughter for Christmas. It worked fine until March...and now its acting  up and she is so hurt....I wish I would have just went to Best Buy....", "Date": "March 22, 2014"}, {"Title": "talk about not shipped as promised", "Author": "JOHN", "ReviewID": "R2VRTJZXZ5SE2C", "Overall": "4.0", "Content": "A stone dead battery and windows vista, (not XP as advertised)... no disks, I guess I'm lucky I got a power pack????  I should be really pissed off and send it back... But my plan was to use this unit to replace a Dell Latitude I had with a bad on board video card (part of the mother board). The hard drive from my old laptop worked fine in this one (goodby vista), and I happen to have 2 new batteries.... so for the $90 dollar price tag,  it worked out OK for me.  But I would blow a fuse If I wanted to use this laptop and found Vista in it, and vista without some much needed drivers at that!! ... The battery was stone dead and never showed signs of charging (truly \"not impressive\").But the dell latitude is one fine unit, works very well with XP... with 50 bozos selling them used its buyer beware on what you get...  hopefully you get one from a dealer that was better than my bozo. Stay with the refurbished units that say exactly what it comes with.", "Date": "December 21, 2013"}, {"Title": "Excellent little computer", "Author": "Margaret Palmer \"slave\"", "ReviewID": "RDEBOCKGO9MWS", "Overall": "5.0", "Content": "It's perfect for our needs. We aren't ready to learn Windows 8. It's fast and does everything my handicapped husband needs. He enjoys if very much.", "Date": "October 8, 2013"}, {"Title": "Great laptop for a great price", "Author": "Rashida", "ReviewID": "R4FNJOROH3FT9", "Overall": "5.0", "Content": "Except for the power cord which got to hot, i would say this is a great laptop, had no problems with it at all.", "Date": "August 22, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0045F6S2A"}}