{"Reviews": [{"Title": "I am loving it!!", "Author": "Funkyani", "ReviewID": "R25FLM803IGQ2K", "Overall": "5.0", "Content": "Well after seeing the first few not so favorable reviews, i was a little circumspect regarding the purchase..but i have been using it for a little over 2 days now and i cant be happier!!First, regarding the highly debated touchpad, i did not find any issues with it.It takes some getting used to, but after a little time you feel comfortable with it. I also bought a cute little  2.4G Nano Wireless Blue Optical/light Mouse Set with Dpi Switch Black (800-1200 DPI)wireless mouse from Amazon . It will be very useful for those who are not comfortable with the touchpad.Other than this, rest all seem good, pictures and videos are clear and crisp, intel i3 processor makes the laptop fast and zippy.For 615 bucks..its well worth the money.. :)", "Date": "March 8, 2011"}, {"Title": "a workhorse", "Author": "laura laureate", "ReviewID": "R1ASJXHZRV6SC1", "Overall": "4.0", "Content": "i'm sorry for the bad experience the other reviewers had but i must say that i am fairly happy with my DV5.in addition, the backlit keyboard is a very nice touch, HP!the performance: well... neither overwhelming nor underwhelming: just a good and reliable laptop. i am not a gamer and am using it for 'basic' computing and it is doing what it is supposed to do. in fact the overall feel is actually very solid and sturdy. in short: a workhorse with a solid built.on another note: HP seems to have gotten rid of all the bloatware i used to experience in the past. instead this model came supplied with a license for microsoft office. nice touch!speaking of \"touch\": i am usually more a tablet kinda gal and had good experiences with HP's touchsmart line including their tablets.also and despite some bad reviews, my experience with HP's consumer service has been pleasant. it even exceeds what i had to experience with apple (who will - btw - only service you for 'so long' [first 3 months]... or for additional money... or as long as your purchased \"protection plan\" lasts).", "Date": "February 25, 2011"}, {"Title": "like the design", "Author": "goodstart", "ReviewID": "R163YJY8PJ3HGZ", "Overall": "5.0", "Content": "the backlit keyboard is a very nice touch, HP!the performance: well... neither overwhelming nor underwhelming: just a good and reliable laptop.", "Date": "April 29, 2011"}, {"Title": "Good Laptop", "Author": "Jackie", "ReviewID": "R13GPPT2PVIKYG", "Overall": "4.0", "Content": "I have had this laptop for about three years and it does just fine for me. I agree with another reviewer that this is a workhorse computer. I am in college and this has been my school laptop. All the buttons and the pad work perfectly fine for me and it is a sturdy piece of machinery. I gave it 4 stars merely for the fact that it has been three years and the battery life just isn't the same as it used to be but I have worked this computer pretty hard so I don't think it's exactly unexpected. I get about 2.5 good hours of life with all my internet tabs and word/excel documents open so I am a happy customer.", "Date": "December 3, 2013"}, {"Title": "Love this Laptop!", "Author": "Brelig H", "ReviewID": "R3AQA1NOADLHSV", "Overall": "5.0", "Content": "I've had this computer as a work tool for over 2 years.  All my co-workers have it and we all love it.  We do have to plug in, but that hasn't been a problem.  We are homevisitors and we carry it in the cars rain or shine, freezing or hot weather. We work in a tall building, carry it in, up and down everyday.  Goes to meetings, out of town. Etc.", "Date": "February 21, 2013"}, {"Title": "Great!", "Author": "Vanessa", "ReviewID": "R1M75MZ1E3XLWB", "Overall": "5.0", "Content": "This is a great laptop.Doesn't cost a lot, it's fast, doesn't have problems...The sound and image quiality is awesome.It has everything I need to enjoy it.I highly recommend it, and honestly, don't know why are there some bad reviews :S", "Date": "September 7, 2011"}, {"Title": "it has good Specifications", "Author": "Abu-Aseel", "ReviewID": "R1J3TI3CKILMZD", "Overall": "3.0", "Content": "I think this device has good specifications, but the battery is the main issue it doesn't give long time working on computer so you need to recharge it many times", "Date": "April 26, 2011"}, {"Title": "HP Laptop", "Author": "danboy202", "ReviewID": "R1YYQKPS7GKX0S", "Overall": "5.0", "Content": "The HP Pavilion dv5-2130us 14.5-Inch Laptop is to replace my wife's old one.  She's not a power user, so this is just fine for her.  It booted up, pretty much hooked up with the wireless by itself and has gone on to run without any problems.  The battery life on hers is not what they advertise, but then, does anyone believe those things. I've used hers a few times and really like it.  The screen is great and it's fast enough for me.  I don't know about games on it, but a gamer wouldn't get this anyway.We're happy with it and I would recommend it to my friends.", "Date": "March 14, 2011"}, {"Title": "Problems with keyboard", "Author": "Kellie", "ReviewID": "R39P3FCKOUX9XY", "Overall": "3.0", "Content": "The battery life is pretty bad, only lasts two hours when barely any programs are running. The keyboard is pretty bad too, you have to really pound on the keys for the computer to register some letters. I never had any problems with the touch pad. So I guess its an okay laptop, but I would not recommend it for anyone who has to write a lot of papers.", "Date": "November 24, 2013"}, {"Title": "Awful Mouse Pad & Keyboard!", "Author": "joie _de_vivre", "ReviewID": "R2O2M98J2ITRUL", "Overall": "2.0", "Content": "The purchase price lets you know this is not a high end product, though should be a good value for the $.  While the system make-up seemed good, there were several problems with the machine.  I returned the laptop to Amazon. The keyboard and mouse were awful.  The space bar worked only sometimes, and the keyboard itself was difficult to type on.  It seemed you had to press hard and reach for the keys.  The mouse pad design and function was the worst I have used in memory.  An annoying issue was how HP sent the machine set-up with their proprietary \"home page\", and the amount of junk loaded onto the hard drive.  Thankfully, because the space bar was not working properly, Amazon returned for a full refund.", "Date": "April 18, 2011"}, {"Title": "Full of problems", "Author": "Corando Saenz", "ReviewID": "RGSLHV6TL5G19", "Overall": "1.0", "Content": "I'm wrting this review 1 year after I bought this item, because it serves well to notice how good or bad a laptop product truly is. My opinion on this laptop is as follows.Avoid HP laptops if you can.There are several reasons for this according to my experience.Problem # 1: After only 6 months of using it constantly,the charger stopped working, it simply died. I tried at first a generic charger, but the computer absolutely rejected it, so what happens, buy an original charger which costs a lot of money. Warranty didn't even care to answer my 10 emails sent.Problem # 2: Wifi stopped working. I checked the internet for a solution, only to find that it's a general problem and there is no solution for it.. What did I do? Bought a wifi usb. Another useless expense.Problem # 3: DVD doesn't work anymore!!! And to tell you the truth I barely used the thing! I will not spend another cent on this machine.Please save yourselves a lot of sorrow and grief, don't buy laptop products from HP, afer a year the only thing that you'll have is problems.", "Date": "February 19, 2011"}, {"Title": "Awful touchpad", "Author": "F. Mo", "ReviewID": "R3KC1Q1MTDZXNY", "Overall": "3.0", "Content": "I got frustrated after 10 minutes of using this computer.  The problem is the touch pad, more specifically the buttons on the touch pad.  On this computer the buttons of the touch pad are actually part of the pad.  A few lines on the pad mark out two areas at the bottom of the pad to be buttons.  When you move the fingers on top of the buttons the mouse pointer actually moves just as at the other area of the pad.  This means when your finger moves while pressing down the button, the mouse pointer moves off the item you actually want to click.  This is just plain awful.  HP should have discovered this with a simple usability test.  If they want to integrate the buttons with the pad, at least they should disable the mouse pointer movement while in the area of the pad marked out as buttons.  Interestingly, I bought this computer to replace a Gateway laptop I returned.  The problem with the Gateway laptop was that the computer quite often did not respond to the button clicks on the touch pad.  The design of the Gateway touch pad is quite similar to this HP computer.  It also has the buttons being part of the touch pad.  But at least in the Gateway case, finger movements in the button area do not move the mouse pointers.", "Date": "February 16, 2011"}, {"Title": "BRAND NEW OR OPEN BOX????", "Author": "J. Brewster \"jason X\"", "ReviewID": "R17FE9MWM2LTWJ", "Overall": "3.0", "Content": "when opened the box I realized that the silver edges around the bottom rim in front of the laptop were not pieced together as flush as I would expect. also there was no plastic around the screen boarder like most NEW laptops would normally have. but it works fine so far. Amazon, I'm watching you!!!! lol......", "Date": "March 10, 2011"}, {"Title": "OK laptop. DON'T BUY IT THOUGH.", "Author": "Alex", "ReviewID": "R2NTKJWPL5FFKH", "Overall": "3.0", "Content": "It has been over three years since I've had this laptop. In fact, I'm writing this review ON this laptop.Pros: Convenient, easy to use, comes with basic programs installed.Cons: Slow as HELL, has a messed up sound system, randomly will go into \"Unable to start. Use system restore?\" Is NOT compatible with many devices.It's good for a laptop, one of my first. But not excellent. And there are quite a lot of things wrong with it. Sorry HP Pavilion dv5.", "Date": "February 24, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00400OS86"}}