{"Reviews": [{"Title": "Another great HP product...not sure why at these prices you'd buy other business PC's.", "Author": "ITGuy", "ReviewID": "RJVIQAYUKA125", "Overall": "5.0", "Content": "Been building systems, deploying systems for over 20 years, and so far, for the past 3 years...our company has been buying Elitebook notebooks for our team, and we've not had a single unit fail, require an O/S rebuild, etc.  All Vista and Win7 Enterprise installed right after purchases, and so far so good. This particular model is the smallest we've bought, and it's a fast PC with very long battery life and it's packed with more disk than a corporate user will ever need.  Just Remember....NO internal DVD drive in this unit.  We don't allow users to install their own software, and so the DVD drive just becomes a power using add on that is seldom used.", "Date": "October 19, 2011"}, {"Title": "Superb laptop, highly portable and reliable", "Author": "JOHN", "ReviewID": "R2T0TFZOLICCWM", "Overall": "5.0", "Content": "This is a fantastic laptop for those that have to move around a lot... it's combination of size and weight make it our go-to laptop for physicians to do their rounding at the hospital with.Battery life is great, and you can even purchase a 9-cell battery for even more life (though as expected, it adds more weight).I cannot comment on HP support as we have not yet had to get these laptops repaired, and we have over 50 of them in use currently for the better part of a year in a healthcare setting.Has quite a few nifty features on them and I like the touchpad over the \"eraser\" pointer that you get on most small laptops.", "Date": "May 13, 2011"}, {"Title": "Powerful laptop in small package at very low price", "Author": "An Ominous", "ReviewID": "R2LID5B7DN9SDP", "Overall": "5.0", "Content": "After a week of use I am satisfied with this laptop. Since I already own a slim, USB-powered DVD writer, the lack of built-in DVD is no problem.Pros include:* very easily upgradeable to 6GB RAM,* Windows 7 Pro,* good battery life (how good is very dependent on what apps are running),* runs very quiet,* usually runs fast,* using the fingerprint reader is more fun than typing passwords,* supports hard drive encryption,* allows me to work productively sitting in cramped airline seats,* very light weight,* lots of useful ports,* SD card reader,* ambient light sensor* ...Cons include:* I wish they left out the pointing stick and its corresponding mouse buttons, allowing the touchpad to be bigger;* while the laptop generally runs cool, it shoots a stream of warm/hot air out its right side;* upgrading to 8GB requires more work, since one DIMM is located near the keyboard, and the other near the back of the laptop;* the weight is unbalanced and the cover smooth, so it is a bit hard to carry for such a light laptop;* I had to download some software update to make the laptop wake reliably from sleep mode.", "Date": "March 21, 2012"}, {"Title": "The 1 is smaller than the other numbers!?", "Author": "Raymundo", "ReviewID": "R1NKYMCK0GBKU1", "Overall": "3.0", "Content": "This is a work laptop.  Keys seem very small and compact, and the 1 key is tiny!  No webcam, but it is decently quick.", "Date": "May 17, 2012"}, {"Title": "Low Content Description of the Product", "Author": "F. M. Newcomer", "ReviewID": "R182EYL9O7XYU7", "Overall": "1.0", "Content": "The information under product detail has not been reviewed.  The size of the computer is not  16 inches  it weighs more than 3 pounds.  So the description is misleading and lacks the information easily available on  HP's web site.  This is clearly the wrong forum to buy a complicated product like the HP2540p.[...]", "Date": "January 24, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0044UAQHE"}}