{"Reviews": [{"Title": "Do not buy", "Author": "Gibo", "ReviewID": "R1PO7BC73RTJUT", "Overall": "1.0", "Content": "I too purchased this laptop from BB in February 2011..Everything started to become very buggy with this laptop after 6 months of use. Last night, I received a HDD/SMART failure message,Its game over for your HDD once that happens, it can not be repaired, the only option is to buy a new HDD.  I decided against that, and purchased a new laptop (not a Toshiba) because quite frankly, I am not impressed with this crap computer.  It looks very cheap, the keys became loose after a few months also.I don't know about you..but i find it very odd..that 3 people all purchased the same model..from the same company..in the same month .and we are ALL having major problems..", "Date": "February 11, 2013"}, {"Title": "Would Rate Negative if I Could", "Author": "SJohnson \"SJ\"", "ReviewID": "R211H4VE6R543N", "Overall": "1.0", "Content": "This is my last and final toshiba. It has been nothing but trouble. Turning it on to Windows usually results in going directly to BIOS. Then play around to find out what I need to do to open Windows. cannot shutdown or restart without receiving fatal errors. I am now running out to buy an external hard drive because Windows cannot back-up and I now have a warning that my internal harddrive is about to crash and I need to back-up to an external drive. I have done all the fixes Toshiba has put out. Toshiba shows a healthy hard drive....wrong. I have an alert that says:Your HDD has the SMART Predict Failure function which monitors the HDD operating status. Your HDD is experiencing a problem and SMART monitoring software predicts that the HDD will fail. Toshiba strongly recommends you create a back-up for your HDD data. Then contact an authorized service provider in order to check your drive and purchase a new replacement drive if necessary. Apparently a lot of the machines have this problem from the updates or fixes I have been sent. Piece of crap!!!!!!!!!The crackling/stuttering sound is almost constant. BBuy should be shamed for recommending this when it first came out. I HATE IT.My tech guy said I'd have to call Toshiba and send it to them for repairs. For a teacher, this is a disaster.UPDATE:10/21/2011 Sent it back to Toshiba. Had problem taking delivery because Toshiba wanted a signature. The hours of delivery were during my work week. I wasn't going to drive 50 miles round trip to the nearset pick-up facility. Fortunately FEDEX was willing to deliver at night. The computer is working well, but the sound is starting to screech again. Having to download my Microsoft Office, Nuance, iTunes and all the other programs again was a hassle. Now I have to pick thru my files to restore them.", "Date": "September 18, 2011"}, {"Title": "Overheating problems", "Author": "Joseph Santoro", "ReviewID": "R8WN0F62O10GQ", "Overall": "2.0", "Content": "Hello I have had this computer for about three years now and I have noticed several irritating things about this laptop. This can include the annoying overheating and the loss of function in certain keys at random. This has a two star rating because of the ok (but not great processing power and ability to run games). I would recommend not buying this product. Please listen to this review.", "Date": "June 16, 2013"}, {"Title": "Is there a negative star rating? That's what it needs.", "Author": "Kiersten", "ReviewID": "R367WGCKJ0SED4", "Overall": "1.0", "Content": "CRAP CRAP CRAP. *laptop was purchased at Best Buy in early February 2011*Listen up, folks. If you're having the same issues I've been having with this PC (Piece of Crap), go to Toshiba like I did. If they don't respond (like how it happened to me), give them notice that if they don't take steps to solve the matter, you will contact the Better Business Bureau in your area to kick start a settlement (like I did).If they contact you after you file your formal BBB complaint and you still have not reached a proper settlement (complete refund for the lemon and all its costly repairs) select the option to file another complaint.Then, contact your retailer (Best Buy). Let them know what's up. Send them screen shots and the link to this forum so they can see for themselves what a hunk of junk this laptop actually is.Look up your state Lemon Law and how it pertains to electronics. Contact your area representative telling them every step you've taken thus far and that you need to bring attention to Toshiba's crappy service. And a proper settlement.Regardless if you're out of warranty, if you've pursued the matter since it began in 2011, that issue becomes irrelevant.We need our voices to be heard on this company's faulty product and lack of customer service! Don't just think it's your tiny little voice versus an entire company!As part of the recognized one percent, we deserve proper customer service from a globally involved company. Not some lame excuse saying to take it back to the store and pay for repairs that shouldn't be needed.I encourage you to take this review and put it to good use! My fight has been months in the making, and being a student, I need a reliable laptop! I will NOT stop until the issue is resolved in a way I see fit!", "Date": "August 8, 2013"}, {"Title": "Where do I start?", "Author": "Carla Goff", "ReviewID": "R1BTMV2NO1MZQA", "Overall": "1.0", "Content": "The first one I bought crashed after not even having it for a month and I had to send it to Toshiba for it be given a new hard drive. Now.. it just shuts off by itself.  The power cord doesn't work and the battery is bad. I've had this computer less than three years and it is CRAP! Worse spend money ever.", "Date": "March 2, 2013"}, {"Title": "TOSHIBA SATELLITE A665-S5170", "Author": "Nance In AZ", "ReviewID": "R1PTTQP4YPTENE", "Overall": "1.0", "Content": "I too bought my A665-S5170 in February of 2011- my laptop is now 44 days out of warranty- I got it from BestBuy which of course they just wash there hands of the whole Hard Drive crashing- my issues also started in December as well- I took it to an independant repair shop- for about $200.00 I'm having a new hard drive installed :(I will never buy another Toshiba again !!! Ever! Not to mention their customer service must be off shore, can't understand any of them. I currently have a case open, but of course they aren't open on weekends-How convenient :(When I purchase another laptop, I will go back to Gateway... great customer service, even if you are out of warranty...It's pretty sad when a $700.00 laptop doesn't last over 12 months before having issues-And the star \"1\" is more than what they deserve.", "Date": "April 7, 2012"}, {"Title": "Problems", "Author": "Noah", "ReviewID": "R2MW91DCPEO7ZN", "Overall": "1.0", "Content": "This item is no longer being sold new online (at least on Amazon) so I'm writing this review for people who may be able to purchase this in-store. I recommend you do NOT buy it.I bought this laptop from Best Buy in February 2011, just like another reviewer did. Now it's December and this thing is failing. It started shutting off at random times. It wouldn't start up Windows once and when I finally was able to log in, I had to reinstall some programs/updates. Now a popup says that Windows has detected a problem with the hard disk and I should backup the computer with an external hard drive or flash drive in order to not lose anything. So basically, I have to spend over seventy dollars in order to buy something with enough GB to backup my entire system and if this things fails (which it probably will any day now) I'll still have to buy another new hard drive (over eighty bucks) and then reupload the backup while reinstalling a bunch of software (which may cost more money). I'm tempted just to buy a new laptop and that shouldn't happen at all within a year. I've lost a bit of faith in Toshiba. This thing looks beast and has a decent webcam and is pretty fast but within 10 - 11 months, it started dying. I could lose all of my data within the next few days. I contacted Best Buy and am waiting to see what they can do.But really if this thing crashes before I can buy something to back it up (and/or if Best Buy does nothing), my music, pictures, videos, Word documents, just everything will be lost. Toshiba never should have put out a product that would destroy stored up memories and files that had to be purchased. This was just a waste of money really. I spent over seven hundred dollars and before the year ended, I was left with an unreliable piece of metal that could go out any day. I keep this thing on for days on end now since if I shut it down, it'll take forever (or possibly never) turn on again and I will have lost it all.So I'm done with my little anti - Toshiba rant but won't diss the brand completely. Just be wary. I'm giving this thing one star on account of the fact that this product can end up completely useless/unreliable within the first 12 months of purchase. I'm going to look at Sony Vaios now...My mother's lasted over 3 years...", "Date": "December 21, 2011"}, {"Title": "Would also give this negative stars if possible", "Author": "RL Jr \"RLL\"", "ReviewID": "R1KDNWK8QW7P1R", "Overall": "1.0", "Content": "Purchased this Toshiba in February from BB.  After a week had to take it back for a new one as the volume button was stuck on a constant beeping sound and would not stop unless you hit mute.New laptop ran well for a month then immediately became bogged down.  The Toshiba proprietary support software is an albatross - clicking on the update request or message balloons hung the computer up constantly.  Much like the previous reviewer I started getting the HDD failure notices.  Eventually the laptop had to go back to Toshiba's repair depot and now they are missing a part and my service is delayed so I've been without a working computer for over a month now.Would not recommend Toshiba computer products to anyone...", "Date": "December 1, 2011"}, {"Title": "HDD Problems", "Author": "Julian Ward", "ReviewID": "R2U136CWWZMN7C", "Overall": "3.0", "Content": "It's been a good three years with this computer, but recently I was given the warning that my HDD was failing. I've personally never dropped my computer in the 3 years that I've had it so this was quite the surprise to me.Pros: It worked wonders over the three years that I used it. It's crazy fast despite the fact that I had several games downloaded on it (WoW, LoL, Rift, etc.). I keep good care of it and luckily have never ran into any viruses. The Harman/Kardon speakers work fantastic and the keyboard is very well put together. It even has a number pad if you're looking for that sort of thing. I've never had a problem with my connection and more often than not, I am amazed at the power exhibited from this machine. Once it's up and running, it's performance is truly incredible. Most likely, that's all thanks to the powerful processor inside. It's a 640 GB computer with about 582 GB free. Surprisingly, despite all of the huge MMO files I've kept on it over the years, memory has never been an issue. You could literally keep anything on this computer and memory will never cross your mind.Cons: Overheating is a huge issue for me in the summer. My work space can sometimes reach up to 90 degrees. I realize that asking a computer to work properly in such a hot room seems like a bit much, but I know of plenty of other computers that would work perfectly fine in the situation. It's also pretty heavy (10 pounds), but considering the dimensions, I can't imagine portability is your goal if you plan on buying this computer. The plastic exterior is not all too appealing or reassuring if you are afraid that you might drop it. When I put it in my bag it often clicks around because it does not have any lock-shut technology when you put the screen down.The biggest problem of all though is with the HDD. I have no clue how or why I received my HDD/SMART failure message, but after two years and six months, my lap top had finally had it. It took me about 30 minutes to power on my computer after I began to receive this message. After messing around with my BIOS, deleting a majority of programs on my computer changing start up programs that ran, deleting my wallpaper, and defragmenting it I've finally reduced my start up time to about 7 minutes 30 seconds. It used to be only a few seconds. The best way to get around this problem is to just never turn it off and only put it into sleep mode. I assume that buying a new HDD may be a solution to this issue, but I can't be sure. I don't think I will ever buy another computer with HDD again. SSD seems like the way to go if you fear this problem ever happening to you.Despite the long start up time it is still an unbelievably strong computer. I would recommend it in every other field. If I never had this HDD problem, then despite the massive size, I would give this computer a 5/5. It has treated me well over the years, and ran quickly on ever online game I've played and downloaded on it. It's reliable in every other field. I never had any other problems, and if a new HDD can fix it, I greatly recommend you buy one so that you can replace it.", "Date": "December 24, 2013"}, {"Title": "Pretty decent for a casual pc experience", "Author": "lilc", "ReviewID": "R1GU8SVVZ7P1Z3", "Overall": "4.0", "Content": "got this computer in February also, from Best Buy... it did crash four months after I got it, but I'm really starting to believe its what Best Buy did when they up load software ,( that way Geek squad is always bring in the dough! Lol)on it such as my Microsoft Office suite. I don't think that's a coincidence we all got our laptops from Best Buy around the same time and had the same problem. it was still under warranty so it was fixed return pretty fast and was fine ever since. this is my fifth laptop and I have no real complaints. however I'm bored with it now and I want to upgrade, see it's not good with Windows 8.", "Date": "January 18, 2013"}, {"Title": "Terrible Keyboard", "Author": "kyraxamber", "ReviewID": "RXYOQ3F799RLS", "Overall": "1.0", "Content": "I haven't had any problems others' have been writing about. The laptop has never had a system failure or any software problems. However, I wouldn't recommend purchasing this model unless you don't mind using a different keyboard, but to me that defeats the purpose of a laptop. I've had issues with the R button, then it started to work again on its own and the the N button went. I have to push down on it just to get the key to register.", "Date": "December 28, 2011"}, {"Title": "Terriffic", "Author": "scheuvront1993", "ReviewID": "R28GE6RRJO4BUM", "Overall": "5.0", "Content": "Before I bought the laptop I read many reviews.. none of which were good ones. But despite the many bad reviews I bought it anyway.. and it didn't disappoint. I love it. Had it for over a month now and I still haven't had a problem.. very nice laptop. Do not listen to the bad reviews this thing is awesome.", "Date": "May 8, 2012"}, {"Title": "don't stick with the windows version", "Author": "Underwood103", "ReviewID": "RISQ7KAVDTSWT", "Overall": "4.0", "Content": "i was given this laptop as a gift when i turned 15 i am almost 17(less than a week) now. afew months after i got the laptop it crashed completely so i thought itwas a pos but i then installed ubuntu 13.04 a yr after. i then heard of the ubuntu program downloaded it on to my usb and after a few hours of running between pc's to get the files correct (i suggest to burn the iso NOT the usb way) i finally got the laptop up and running like new, If you buy this pc i highly suggest putting ubuntu or some linux program on it then download wine off of winehq by opening terminal then typesudo add-apt-repository ppa:ubuntu-wine/ppa type your password to your laptop after it is done type sudo apt-get update wait for it to install then lastly install wine by typing sudo apt-get install wine1.5 after that is done you can run almost any windows program/game if there is any questions post a comment or drop me a email at underwood103a@gmail.com", "Date": "July 14, 2013"}, {"Title": "Hard Drive Crash", "Author": "M. Gibson", "ReviewID": "R386KX8VRPDIOL", "Overall": "2.0", "Content": "This computer hard drive died 20days before the warranty ran out..thank God.  We used it lightly and it doesn't seem like it should have crashed at all!  can't believe they make such fragile lap top computers....if it was a desk top, I could understand.  Lap tops should be able to be moved without an issue!  What a bunch of junk.  My gateway lasted for 5 years with rough wear and tear.Never buy Toshiba.", "Date": "September 18, 2012"}, {"Title": "Toshiba Satellite A665-S5170", "Author": "zion", "ReviewID": "R315W2I70I1JQS", "Overall": "5.0", "Content": "I like this model, its worth for the price. I bought one from bestbuy and it is working very good. only the thing is weight, it is 6.5 lbs. other than that I recommend this product to anyone want to use for daily life.", "Date": "October 18, 2011"}, {"Title": "Great!", "Author": "Amber Killion", "ReviewID": "R16ELAS84XQZTP", "Overall": "4.0", "Content": "I got this laptop from a friend that came to me from his workplace, I have upgraded to 8GB of RAM and a 240GB Intel SATA III SSD. After that this laptop became magic. I render fractals in Apophysis, songs in Fruity Loops Studio, and videos in Microsoft Movie Maker and can multitask between rendering fractals and a song OR a video and running flash and other processes. I don't have any hiccups in performance and I leave almost everything open. I use two browsers with multiple tabs open. This laptop's processor kicks butt!!!! It doesn't even overheat on a hot day while using it with load.I had to buy a brick for this one, because it was missing. It wasn't the original laptop's brick I bought, but a generic one from the local store. It supports 85Ws. It uses quite a bit under that and this usage and the awesomeness of the processor plus the upgrades makes it desirable over a desktop computer, because of it's size and low wattage usage. I'm really surprised!The downside is the graphics, I can not play Morrowind TES III more than with just bare minimum graphics. I had to wait for minecraft to update in order to play it with medium graphics.I had an issue with the drivers for my wireless and wired. I can not use my wired at all! When my wireless adapter knocked loose, I could use my wired again, but as soon as I put it back in, the wired stops working.I also wish it had SDHC support!Overall, the processor, the wattage usage, and in addition to the upgrades, this laptop is great for everything necessary to compute other than gaming. I use my laptop on a TV table and an office chair, but when I have more space in my room, I'm going to hook up my TV to it which I did before and enjoy having a second screen.Enjoy!", "Date": "May 6, 2013"}, {"Title": "Can't upgrade to Windows 8", "Author": "Norman L. Williams", "ReviewID": "RCL6R8IZAVQWE", "Overall": "2.0", "Content": "I had been previously satisfied with the Satellite A665-S5170 until Windows 8 was released. Tried to upgrade it and it kept on failing. Called Microsoft and they said I needed a bios update from Toshiba, called Toshiba and was told that this model can't be upgraded to windows 8. The laptop is only slightly over a year old and running windows 7. Was told that there is now Bios update that will allow this machine to be upgraded to windows 8. Really sucks!!!!!!!!", "Date": "November 24, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004VCZGTS"}}