{"Reviews": [{"Title": "Very good computer.", "Author": "bill", "ReviewID": "R2Q6GJTBJUJW1K", "Overall": "4.0", "Content": "This computer is good. Damn good. Great, even. Especially for a business computer, this works really good. The only complaint I have is that the graphics card sucks. Like seriously. Other than that, this computer works the way you'd want it to.", "Date": "March 14, 2012"}, {"Title": "Happy with my purchase", "Author": "Claudette Christie \"spanish crazy\"", "ReviewID": "R228C564C8NUFH", "Overall": "5.0", "Content": "I bought it for my son who is in college and based on what he tells me , he is truly satisfied with its performance and he tells me that it is \"sexy\". He means that it looks good too. And for me the price was right.", "Date": "March 18, 2014"}, {"Title": "worst purchase ever", "Author": "suzanna", "ReviewID": "R3IU9NJ0C0V0B3", "Overall": "1.0", "Content": "I have had mine for 4 years and the warranty just expired in those years I had 9 hard drive failures the mother board had to be replaced the cooling system replaces twice the cd  rom replaced and the biometric reader replaced twice. It had never been dropped  and sat on my bed on a laptop table. it has been a nightmare I have had two other dells that I loved a inspiron 1501 and dell inspiron 1520 so I was happy to purchase another from dell but from now on i plan to purchase older laptops that were before dell started making there laptops so light and cheap.", "Date": "March 5, 2014"}, {"Title": "Very Poor Customer Support", "Author": "jchasp", "ReviewID": "R1C6FI5T85CDOA", "Overall": "1.0", "Content": "Wow!  So frustrating!  Just spent 48 minutes on my now 4th call to Dell \"Custormer Care\", who doesn't seem to care (or have the ability to care), at all! Dell Driver Download Manager updated the software for the fingerprint reader on my Vostros 3550 laptop, and now it doesn't work. I called Dell to see if I could get the previous version of the software, but Tech Support's owner registration info doesn't match what Customer Care has. I registerd the laptop in my name when I purchased it new from BestBuy (BestBuy bought it from Buy.com. I have no idea who they buy from...)  Now Customer Care is telling me to contact  \"them\" to see if I can find out who purchased the computer! I PURCHASED THE COMPUTER AND REGISTERED THE COMPUTER THE DAY I BOUGHT IT! I HAVE THE RECEIPT'S AND MASTER PACKING SLIP FROM BUY.COM, but according to Dell, I don't own it!  Customer Care won't tell me who \"they\" are (the people I'm supposed to contact that it is supposedly registered to), but expects me to contact \"them\" to straighten out the registration. Also told me that my warranty is invalid until I get Dell's error straightened out!  Dell's records concerning the registration of my computer are in error, but they expect me to correct it by contacting an unknown entitiy.  Need to rename 'Customer Care' to, 'We just don't/can't care'!  Service Request #: 859372101 (KMM141813026V3810L0KM)", "Date": "July 2, 2012"}, {"Title": "Vostro V3550", "Author": "Stephen Hatchett \"Steve Hatchett\"", "ReviewID": "R1TDEDQFTWEBN7", "Overall": "3.0", "Content": "This may be my last PC. It's got the expected initial problems but is running fine now. The problem is that, having used other devices since my last purchase of a computer, I expect more. Having said that I did get what I ordered and the vendor delivered as promised. In fact faster. Have nothing but good things to say about them. Thanks!", "Date": "December 6, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "DELL Vostro 3550 Notebook\n469-0347", "Name": "Dell Vostro V3550 15.6\" LED Notebook - Core i5 i5-2410M 2.30 GHz - Metallic Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/31cq7CvaR8L._SY300_.jpg", "ProductID": "B004YA4OLI"}}