{"Reviews": [{"Title": "Great lil 'puter", "Author": "Seeqer", "ReviewID": "R2VNVC7RX9AGQ0", "Overall": "4.0", "Content": "Has exactly what you want and none of what you don't. Light, compact, and powerful. Not loaded up with bloat-ware either. Not a computer to get if you're really into gaming, but has all the power you need for pretty much anything else you need and is only a little bigger & heavier than a net-book. With the advantage of having a DVD RW drive.", "Date": "March 27, 2011"}, {"Title": "Great laptop!", "Author": "Brian \"reviewer\"", "ReviewID": "R3A2Y60RQJMA5X", "Overall": "5.0", "Content": "Truly an awesome laptop - it's exactly the same as the P41, except it has all the bloatware/trial stuff removed that most people delete and don't use anyway.  It's Microsoft Signature, so not only do you get the standard warranty, you also get Microsoft Signature phone support as well for both the computer and software (Windows, etc).  This is definitely a powerhouse laptop that is not only ultra-portable with the 13.3\" screen, but extremely durable with it's magnesium alloy casing.", "Date": "February 17, 2011"}, {"Title": "Good purchase", "Author": "ds", "ReviewID": "R95OBZI08GTMS", "Overall": "5.0", "Content": "Slick sophisticated look. Very light weight for people who travel and significally cheaper than other comparable laptopsNo complaints so far", "Date": "March 28, 2011"}], "ProductInfo": {"Price": "$1,399.99", "Features": "Intel Core i5-460M processor\n500GB HDD 5400rpm,4GB DDR3 1066MHz memory\nHD TruBrite LED Backlit display with Intel Wireless Display Technology\n65W 19V 3.42A Auto-sensing  100-240V  50-60Hz input\n2-USB 2.0  1-eSATA/USB 2.0 combo port with Sleep and Charge\nIntel Wireless LAN 802.11a/g/n\nHeadphone jack stereo  Standard stereo speakers  Microphone jack mono\nDVD-SuperMulti drive +/- R double layer", "Name": "Toshiba Portege R705-P42 13.3\" widescreen Laptop (Magnesium Alloy Casing in Blue)", "ImgURL": "http://ecx.images-amazon.com/images/I/41BNCCPXAeL._SY300_.jpg", "ProductID": "B004BJ1XS4"}}