{"Reviews": [{"Title": "Excellent product", "Author": "Carlos Maldonado", "ReviewID": "R1HLNFKPSI6LZD", "Overall": "5.0", "Content": "Really nice computer i had it now for almost two weeks and i come from a compaq dual core with win vista and let me tell you this computer at that price is really nice, with a i3core, 4 GB ram, nice hard disk and win 7 it have a really nice speed, dosent get hot watching movies or videos just the normal, battery last a good time, is not heavy at all compare with other notebooks, really cool design.Over all is a really good computer for a nice price, i use it for work and some small playing games like civilization V.", "Date": "June 8, 2011"}, {"Title": "Excellent all around", "Author": "David Y. Tay \"Dave\"", "ReviewID": "R11X2XNEARHGZJ", "Overall": "5.0", "Content": "I didn't buy this on Amazon, I got it on sale on Best Buy (< 450) but it's such a good computer I thought I'd leave a review here. This was a great deal at 450. I bought this after reviewing similar models by Dell and Lenovo and settled on this because of the larger 4gb RAM and 500gb hard drive and it was on sale. It's also lighter than most 15.6\" laptops, about 5.3 lbs. I enjoy having it on my lap while sitting on the sofa. It doesn't get hot and the only minor distraction is the fan blowing air on left side.  The Core I3 is speedy, the 500gb hard drive is huge and the integrated graphics is more than acceptable. I am able to run NBA 2K10 and MLB 2k9 with acceptable quality.I tried to install a Hackintosh but it didn't work, kept on getting kernel panics. I tried both the MyHack and iBoot so I just ended up running Mac OS X 10.6.7 in a virtual machine. Other than that, I'm happy with the Windows 7 64-bit.", "Date": "May 19, 2011"}, {"Title": "Couldn't be happier!", "Author": "Lynn Mack", "ReviewID": "R90DEMO9R2W3N", "Overall": "5.0", "Content": "I received this 2 days after I ordered it.  Fortunately, I have a \"techie\" son who handle all of the set up and brought it over and hooked it up to all my peripherals.  This is a quick computer that is lightweght and large enough for my 47 year old eyes!  Thank you Amazon and HP", "Date": "April 28, 2011"}, {"Title": "So far my daughter loves this laptop!", "Author": "G. Smith", "ReviewID": "R3NDBO5KWBU9GJ", "Overall": "5.0", "Content": "This laptop was purchased for my daughter who will be using it for college. She has used it for a couple months now and simply loves it. I shopped around and compared several name brand laptops, including different models of HP. This one stood out as a great buy. So far we are very pleased with our purchase. At this point, I'm thinking of purchasing one for my other daughter for Christmas. If any issues arise, I will return with an update.", "Date": "August 30, 2011"}, {"Title": "A Perfect match of Price vs Performance", "Author": "Abi \"abi\"", "ReviewID": "RT8R039TJ1GS3", "Overall": "5.0", "Content": "First of all you will be surprised with this sweet machine. Good for home/ home office. Not for real gamers. Core i3 processor with 4GB of DDR3 is a perfect match. Hard drive is more than enough. Till now I didn't see any flaw or cons. So I give 5 star review. Battery.....  I didn't check actually but its more than 2.5 Hrs.", "Date": "August 1, 2011"}, {"Title": "I love this computer", "Author": "Jojo", "ReviewID": "R1OF2BDSH33BAT", "Overall": "5.0", "Content": "I LOVE this computer, the price is affordable, it works well, user friendly...doesnt give me any lip. I am glad my last computer broke so I could get this one.The tech review says that it has a lackluster WiFi card, but it works great for me. I dont know what they were talking about.", "Date": "October 10, 2011"}, {"Title": "laptop", "Author": "alex", "ReviewID": "R36B2VX542CV0B", "Overall": "5.0", "Content": "excellent ex ce llent exce llen t exlnt que fastidio llenar esta cosa del reveiw.. todo fue muy bien, llegu a tiempo y completo", "Date": "September 20, 2011"}, {"Title": "New laptop", "Author": "Sonia Ewers", "ReviewID": "R4QIC5M3XNB4W", "Overall": "4.0", "Content": "This laptop works great. I just had to get used to a new windows and other things like Office but all in all, it's good.", "Date": "June 28, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004Q9T7J6"}}