{"Reviews": [{"Title": "Recommended; but not for FPS games", "Author": "The Irish Patient", "ReviewID": "RQPEFOGTYN138", "Overall": "5.0", "Content": "[Note:  I've edited my review on 10/17/2011.  The problem is that this laptop is no longer offered directly by Amazon.  The price varies and shipping isn't always free.  Therefore, it's up to you to make sure you're getting a good deal.]This listing is for the 2011 model Inspiron 17R, while most of the other listings are for last year's product.  I purchased a Dell Inspiron 17R similar to this one for my sister during May 2011.  It's quite impressive as compared to my Asus laptop from less than three years ago.  I would definitely recommend one these to a friend.CASE:  The 17R is surprisingly thin considering that it isn't advertised as a thin laptop.  The Diamond Black finish is very attractive.  [Note: the listings that mention the Mars Black finish are for last year's model.]  The hinge operates smoothly and appears to be durable.LCD:  The quality of a laptop's screen is particularly important to me.  This one is better than most.  It's somewhat glossy but, fortunately, not nearly as glossy as was common a couple of years ago.  Text is a lot easier to read than it was on the ultra-glossy screens.  There appears to be some anti-reflective treatment but it is not overdone.  Viewing angles are quite good horizontally, and are adequate vertically.  You won't need to clamp your head in a vise to use this laptop.  Vertical resolution is 900 pixels, which is as good as it gets without spending twice as much.  Movies and photographs look very good on this widescreen display.SPEAKERS:  Typical mediocre laptop speakers.  They are perfectly intelligible, but you'll want to use headphones for movies or music.WIRELESS:  There is some good news and some bad news.  The good news is that Bluetooth is included, so you won't need any wireless dongles to use a wireless mouse or keyboard.  Also, this current model Inspiron 17R supports the new version of Intel Wireless Display technology [WiDi], allowing you to display your desktop wirelessly to your television at full 1920x1080 resolution.  Of course, you have to buy a second-generation (1080p) WiDi adapter for your television before you can use WiDi.  Suitable second-generation WiDi adapters are available from Belkin and Netgear.  [Note: last year's Inspiron 17R with the Mars Black finish is permanently limited to the first-generation, 720P version of WiDi.  There are some credible reports that even second-generation, 1080i WiDi technology is not quite ready for prime time due to problems with playing DRM protected content.  You need to investigate this for yourself.]The bad news in the wireless category is that there is no support whatsoever for the 5GHz wireless band!  Look up the Wireless-N 1030 adapter on Intel's web site.  Bummer if you live in a crowded neighborhood!PORTS:  This current 17R includes a combo eSATA + USB 2.0 port, plus two USB 3.0 ports and an HDMI 1.4 port.  That's a good reason not to buy the last year's 17R without at least a one-third discount.  The last year's 17r is limited to HDMI 1.3 (translation: will never play a 3-D blu-ray disk in 3-D over HDMI) and doesn't have any of the new, ultra-fast USB 3.0 ports.BATTERY LIFE:  Too soon to tell, but there appears to be at least 3.5 hours available for basic web surfing and watching movies over Netflix.  Battery life could be better than that, but I don't know the limits yet.  In any event, battery life will be significantly better than it was on last year's 17R due to the second-generation i5 CPU.  More on the CPU later in this review.RAM:  Six gigabytes of RAM are included, a nice upgrade from the usual four GB.  It's unlikely that you'll need to bother to upgrade the memory during the laptop's lifetime.VALUE:  There's always a deal at Dell, but the deal changes faster than you can follow.  Dell is throwing in a free Blu-ray combo disk with this particular version of the Inspiron 17R.  My sister's 17R did not include Blu-ray, but it did come with a full copy of Microsoft Office for free, while this 17R only includes the crummy starter edition.  Deals at Dell are a lot like the weather here in New England: if you don't like it, wait a minute.Conversely, I would suggest you jump on this model if the Blu-ray upgrade is what works for you.  It's easy to buy and install a full copy of Microsoft Office at a later date, whereas upgrading the optical drive in a laptop is too expensive and too difficult for the average consumer.CPU:  In case you haven't heard, Intel made a major overhaul of its processor architecture for this Spring.  The new CPUs are code named Sandy Bridge.  For the i3, i5 and i7 lines, Sandy Bridge CPUs are identified by having four digit model numbers versus three digits for discontinued CPUs.This Inspiron 17R uses an Intel i5-2410m processor, identifying it as a new Sandy Bridge CPU.  There are lots of other 17 inch Inspirons available here on Amazon that use last year's models, such as the i5-580m.  Personally, I would not recommend buying a laptop with a discontinued Intel CPU unless there is a discount of at least one-third.  The Sandy Bridge CPUs are significantly more powerful (for an equal GHz rating) while consuming significantly less battery power than their predecessors.In case you were wondering why I said that last year's 17R with the Mars Black finish was limited to the original 720p version of WiDi, now you have your answer: second-generation WiDi only works on computers with Sandy Bridge processors.  Remember, any i3, i5 or i7 processor with a three digit model number is NOT a Sandy Bridge CPU.The i5-2410m is sold only to manufacturers, so a little less information is available than for Intel's retail CPUs.  Retail i5 processors have four physical cores without hyperthreading, but the i5-2410m has only two physical cores with hyperthreading, making it more like an i3.  Calling this CPU an i5 is a bit deceiving.  However, unlike the comparable i3 CPU, turboboost technology is included, allowing the i5-2410m to throttle up to 2.9 GHz when operating on only one physical core.  VT-x virtualization support is included but VT-d is not.  If none of this means anything to you, the bottom line is that the i5-2410m is as good as you need it to be.CONCLUSION:  I probably should have taken one star off for the lack of support for the 5GHz wireless band.  That was a very odd choice by Dell, in my opinion.  Otherwise, this is a very nice laptop that I would recommend to anyone who isn't preoccupied with first person shooter [\"FPS\"] games.  Game players should read my own comment to this review, regarding AMD's next-generation processor [\"Llano\"] that will be reaching the marketplace soon.", "Date": "June 16, 2011"}, {"Title": "Dell Inspiron Laptop", "Author": "Richard L. Finegan", "ReviewID": "R8EKVTVB4NGC4", "Overall": "5.0", "Content": "I've had the Dell Inspiron laptop for about a month now, and I'm wondering how I could possibly have lived \"BDI\" (Before Dell Inspiron). The 17\" screen has amazing color and resolution and seems as large as a football field, I'm in the \"I'LL Never Have Another Desktop\" crowd. I am still discovering all of the bells and whistles, it's lightning fast(I have high speed DSL), more memory than an elephant, and has a built-in web cam. I also purchased the Microsoft Office software and it loaded flawlessly. Couldn't be happier with this purchase. I took advantage of the 6 months no interest offer, which is a great bonus. Shipping was quick and safe. Get one and be happy!", "Date": "August 2, 2011"}, {"Title": "do not like its touchpad", "Author": "ETH", "ReviewID": "R1GE6T4ONB5QVR", "Overall": "4.0", "Content": "First of all, 17\" is too big to carry around, but I mostly use it at home. I like the keyboard but I hate the touchpad. The touchpad is so big and so sensitive. When I type with keyboard, the touchpad often move cursor to another place. Very annoying.Other thoughts, There is no way to open the bottom so it wont let you update memory or hard drive in the future. do not like this.The battery, I saw some information saying the battery can last 2 hours. It can only last 1 hour. I did charge the battery for more than 12 hours before I turn on laptop.", "Date": "July 23, 2011"}, {"Title": "kick @55!", "Author": "Max", "ReviewID": "R3QEN84L3WRLG4", "Overall": "5.0", "Content": "I love this laptop! its perfect for everything, even gaming. Windows 7 is better than any of its predecessors. the 17\" screen is perfect for writing essays and doing other school work, and watching HD movies. the price is right and dell is a great computer company... unlike HP or Apple. It keeps its charge and is the perfect laptop for any purpose. id recommend this laptop to anyone. and the free xbox 360 was great too! (end of summer deal)", "Date": "September 22, 2011"}, {"Title": "My first Lap Top", "Author": "Janine Peace", "ReviewID": "R2RUISI3TA5NJI", "Overall": "4.0", "Content": "This is my first laptop so not a lot to compare it to, but here goes,  I love the clarity of the display, it is a little slow on the start up but is very fast once it is booted up. The thing I am most disappointed in is the battery life, I may get 2 hours if I'm lucky. Overall it is a good machine and I haven't had any problems at all.", "Date": "September 29, 2011"}, {"Title": "Dell Inspiron", "Author": "Geoge", "ReviewID": "R17BZBY4SC3PJD", "Overall": "5.0", "Content": "It's a Dell, what else can I say.  I've had Dells before and I am never disappointed. It is fast, clean and easy to handle and the price was right.  Amazon was quick and efficient.", "Date": "December 16, 2011"}, {"Title": "Outstanding laptop!", "Author": "Douglasmagee \"Sarge\"", "ReviewID": "R22ZZ19AJCIO6D", "Overall": "5.0", "Content": "This model of Inspiron is user friendly,powerfull,and responsive! Many extras and Blu-Ray too make this a great value for the money spent. This is the second laptop I've owned and it is,by far, superior to my previous laptop. I would recommend this laptop for multipurpose use and for turbo speed performance!", "Date": "October 30, 2011"}, {"Title": "Very uncomfortable", "Author": "Nick F.", "ReviewID": "R2RZX8VIMUHZYO", "Overall": "3.0", "Content": "This would be an excellent computer if you were using it with an external keyboard and mouse, but the front edge is sharp and hurts the palms of my hands after a short time.  There is a lip on the front that protrudes and will leave an indention in your palms when using the touch pad, causing discomfort.  This can be quite painful after extended use.  Most laptops have a rounded front edge, not so much with this one.  This type of discomfort could be isolated to those of us with large hands.The other CONS for me are the keyboard layout and touch pad.  I thought I would like the keys being farther apart from one another, but I didn't care for this feature.  I found that I had to look down at the keys while typing, more so than I would have with a typical keyboard.  Maybe with time this can be overcome.  The touch pad swipe features are cool when they work.  If you don't touch the sweet spot just right you'll find yourself frustrated after a bit.  I messed with the sensitivity and all other touch pad settings and it still was not as responsive as I would like.  I also had issues with the pointer jumping all over the screen.  This was not due to the touch pad being inadvertently grazed by my hand.  This was not a constant problem, but it did happen daily.The touch pad left and right buttons \"are not\" the quiet type.  I don't like the loud click type buttons and I wish that this would have been listed in the description.  If you or others around you are the type to be bothered by this, look elsewhere.The speed of the computer is good, the large display is GREAT and the BRD player was a nice feature, but for someone who likes to use their laptop in their lap at home on the couch or in bed, this may not be the most comfortable laptop for you.I called Amazon and spoke with a Customer Service Rep and was told they don't handle 3rd party returns or exchanges.  I thought I would have received more help than that.  I wasn't happy with this so I went to the Amazon returns page and started the return process there.  Low and behold I had a response from the 3rd party seller in less than an hour with return instruction.***UPDATE*** 5 Feb 2014I decided to keep the laptop and I've been using it daily for over 2 years now.  It is a great multi-purpose computer and I would recommend it.PROS: Awesome display, love the keyboard now, movies, games, word processing, graphic design all perform very well.  No performance complaints at all.CONS: I still hate the front lip as it is very uncomfortable. The hinges are not as smooth and have begun to get very stiff and making a cracking noise.  The upper left screen bezel has cracked (no rough handling, just normal opening and closing of the lid) I'll be replacing the hinges and bezel soon. It takes several minutes to connect wirelessly to the internet. The left/right touch pad buttons are noisy. Battery life has been reduced to about 1.5 hours during constant use (fairly normal battery issue).", "Date": "November 8, 2011"}, {"Title": "Do not get this laptop", "Author": "No Hidden Agenda", "ReviewID": "RWCXZB3P59U1W", "Overall": "1.0", "Content": "Ok, maybe now almost a year later it might have had the bugs fixed. I will tell you I have had NOTHING but trouble with this laptop. I'm using my old Inspiron 15 from about what, 10 year or so?First, the cursor had the hopping issue so you couldn't even type an email much less do any work on Word. Then, after a fix was published NOT by Dell but by someone who was experiencing the same issue.Then, can't load VPN from work, will NOT allow me to download the most important fix SP 7 I think...Basically, when I have time to watch an extremely old video I log on to this account at Amazon and watch a movie.p.s. the issue is I don't have time to stay on hold forever and try to maneuver the whole \"help\" thing (tried four times) but always give up and go back to the oldie moldy.When I truly have time and money I will just take it to a computer store and PAY to have it fixed. Did I tell you it cost me over $2,000 dollars? Buyers beware.", "Date": "September 14, 2012"}, {"Title": "Dell Inspiron 17\" Laptop", "Author": "Peggy Stepro", "ReviewID": "R2FI27W5CCSCUL", "Overall": "1.0", "Content": "I have had this laptop for less than one-year and have had MAJOR problems with it. The hard drive is about to crash & I will need to replace the hard drive if I plan to keep this piece of junk.  The battery (which never held a charge for more than 90 minutes) no longer charges at all (needs a new battery).  As the saying goes: \"You get what you pay for\".  I had a Dell laptop 7 years ago which crashed in less than 2 years.  I thought in the last 7 years maybe Dell improved.  I had an Apple MacBook Pro for YEARS and the only reason I bought another laptop was due to the keyboard beginning to fall apart on the Apple.  I should have just bought another MacBook.  So:  Customer Beware!!!!", "Date": "September 2, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core i5 Processor 2.3GHz\n6GB DDR3 RAM\n640GB 5400RPM Hard Drive\n17.3-Inch Screen, Intel HD Graphics 3000\nWindows 7 Home Premium", "Name": "Dell Inspiron i17R-6121DBK 17.3-Inch Laptop (Diamond Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41ke3vqEJHL._SY300_.jpg", "ProductID": "B004XZMBEG"}}