{"Reviews": [{"Title": "It's bittersweet.", "Author": "Dylan \"Smilodoncondor\"", "ReviewID": "RJOU5PX42FNM9", "Overall": "3.0", "Content": "I was almost sad to see it go as I dropped it off at UPS today for a refund. After about a week of troubleshooting with HP about why it would lock-up after two hours or so, they reported that it must have had defective hardware.FIRST IMPRESSIONS (FINISH, HEAT, QUIETNESS)When I first took it out of the box and powered it on, I loved it! The aluminum finish was the biggest plus for me. After an hour or so setting it up and installing (and uninstalling) software, the entire unit (save for the plastic heat outlet) was still cool to the touch. And it was incredibly quiet, too. I don't think I ever heard the fans wind up in the week that I had it. The low setting that they were on was hardly audible.SCREENThe screen was brilliant, though vertical viewing angles were unimpressive. Colors were great out of the box. I chose not to play with the ATI display settings. The 1600x900 resolution is a good choice for this screen size. I wouldn't go any lower, and while I would still go higher, that is only to satisfy my greed.KEYBOARDThe keyboard had a generally positive feel to it. I didn't have time to get accustomed to the keyboard layout. I'm used to my HP dv4 which does not have a numberpad. And the fact that I used my dv4 for trouble-shooting purposes for the better part of the week didn't help. One of my favorite features, though, was the integrated action keys like you find on Macs. The function keys up top are, out of the box, primarily used for functions such as play/pause, volume up/down, brightness up/down etc. You don't need to press the fn key to access the functions. If this is undesirable, there is a toggle in the bios setup.TOUCHPADThe touchpad is a serious design problem for me, though I knew what I was getting into when I ordered it. I am pretty readily adaptable to keyboards and touchpads, so I figured it wouldn't be a problem. Truth be told, I wouldn't have a problem if I kept it. It was just an annoyance. Let me clarify: When I'm using the touchpad, I like to keep my index finger on the mouse button while my middle finger does the tracking. Since the touchpad is an entire unit, with the buttons integrated beneath the sensitive track pad, any movement of my index finger would send the cursor in a frenzy across the screen. It wouldn't take terribly long to get used to, though. And tapping the top-left corner twice disables or enables the touchpad, so accidentally moving the cursor when typing isn't a worry.AUDIOSound quality was a big factor in choosing this laptop. It had a brand-name moniker (apparently well respected, so I'm told), so I figured it must have been something special.Let me be clear up front: If you are looking for sound quality, YOU WILL NOT FIND IT HERE. The laptop speakers themselves sound good, with the built-in subwoofer carrying some of the lower frequencies you don't typically find in a notebook. But this does not mean the unit sounds good. There is some filter applied, which I could not find for the life of me, that was heavily COMPRESSING the sound (boosting the quiet sounds while ruthlessly drawing-back the loud sounds). It made listening to music with the on-board speakers literally painful at times (play a song by Atreyu with lots of cymbals and it will sound like you're underneath a helicopter from the dramatic volume cuts with each hit of a cymbal). I searched all over, and even reinstalled Windows and updated drivers, and nothing would fix the problem. On the other hand, sound through the minijack was great. The output was strong, though it seems the low-mids were boosted a little as compared to my dv4 with IDT HD audio.This whole Beats thing though is a complete gimick. Out of the box, the bass and treble controls in Windows are set to full boost, which sounds like crap. By toggling the \"Beats\" feature (fn+b), it simply turns the bass all the way up (on), or all the way down (off). Not intuitive at all! Also, the control panel is the exact same as my dv4's IDT control panel, but with the Beats logo stamped in some places. I am much more pleased with the Altec Lansing setup on my HP dv4.PERFORMANCEUnfortunately, I didn't have time to test the performance of the laptop. I did have pretty high expectations, though, as I'm coming from (actually, currently typing on) an older AMD laptop with integrated graphics. I used to be pretty interested in computers and could tell you how certain components would perform, but over the years I lost touch with that side of me. Now days, I don't know how the AMD phenom stacks up. My understanding (confirmed by a few searches) is that AMD has gotten increasingly closer to Intel's competing processors, but is still a little behind in most regards. I'm guessing that ATI graphics processor is in the midrange as far as GPUs go. With its stay on my desk, it never felt underpowered, though I admittedly did nothing to truly exercise it. When purchasing, I felt that this laptop had an outstanding price-spec ratio, which helped me pull the trigger.BATTERY LIFEAnother thing I never got to try. If it can live up to its claim of 7.5 hours, then that is very impressive for a laptop of this size (in my opinion). More time than I would ever need in one sitting. Truthfully, I don't doubt that number can be seen if settings are kept low and activity is kept reasonable.PROSstunning aluminum finish, nice screen, runs very cool and quiet, good featureset for the priceCONStouchpad can be finicky, pathetic Beats audio, disc drive eject button can be challenging to pressI'll miss most the sleek and stylish aluminum finish. I'll forget the somewhat quirky touchpad. I'm glad to be away from the terrible Beats audio....I know I didn't delve into as much as some would like, but due to my unit being defective, I spent most of my time focusing on getting it working rather than putting it through its paces. I hope my review can be of at least some value to most.*Note: My dv7 being defective has no effect on my rating. All manufacturers have duds, and I'm still in a positive relationship with HP.", "Date": "December 7, 2010"}, {"Title": "So far so good!", "Author": "shelly", "ReviewID": "R130E5PZ2RIXTU", "Overall": "5.0", "Content": "I received my computer this morning. It looked perfect out of the box. Short and easy set up, customized Windows 7 to my liking and tried some music first to try out the sound. The sound is much more clear and much louder than my little Sony Vaio. Typing is really nice on this HP pavilion. The touch pad has a nice consistency but the click button is rather on the firm side. It would be nice if it loosens up a little with use but so far that is the only thing I can even criticize. At 8+ pounds I don't think I will lug this around like I did with my 14inch Vaio. This is definitely a desktop replacement computer and the quality is as such. I imagine once I purchase a nice case for it I will be more likely to take it out. I'm anxious to try out the battery life. So, day one, I'm super happy with this purchase. If anything goes wrong I will be sure to pop in and comment. I was VERY hesitant to do such a large purchase online but so far, am not regretting it.", "Date": "November 9, 2010"}, {"Title": "I like the computer, but it's not for left-handed people...", "Author": "L. Wright", "ReviewID": "R3MRBMHQ95IFSN", "Overall": "4.0", "Content": "I like the computer. If is relatively fast, and it has lots of space on it. The monitor is large and clear. I love the fingerprint reader - mostly for the novelty. I've had no real issues with performance of the computer itself, but the driver for the fingerprint reader was out-of-date when it arrived. I initially set the reader up, but within a couple of days it mysteriously stopped working. I had to do a little research to find out what I needed to do. I updated the driver, and now it works fine. The worst thing about this computer for me is that it is not left-hand friendly. There is a spot on the top left of the mousepad that completely turns the mouse off. Being left-handed, I am constantly hitting this area. According to tech support, there is no way to turn this feature off. The tech support person did offer to tell me how to turn the whole mouse off. (Wasn't that the problem to start with???) Had I known this, I am not sure that I would have purchased this computer. It does seem to me that there must certainly a better place to put the switch. I feel that it was poor planning and lack of consideration on the part of hp.", "Date": "October 29, 2010"}, {"Title": "Scared at first", "Author": "Sue \"paxpm\"", "ReviewID": "R1VNY6PO9ZLNA", "Overall": "4.0", "Content": "When I first received the computer, I had some problems with it crashing, loading CD reading cds.  But after installing windows updates, most problems evaporated.  I love the portability of this laptop, much lighter than last HP I have, and keyboard is easy to type on.  Seems to work flawlessly most of the time and very quick.  Only gripe I still have is the cd door closer, hard to open.  Heard that from other reviewers also.  Much too cheap hardware.  Coming from HP should be better.", "Date": "November 22, 2010"}, {"Title": "Really pleased with this laptop.", "Author": "S. Miller", "ReviewID": "R5GFVR68WP0XT", "Overall": "5.0", "Content": "I have tried 3 laptops before this one.  This is like a Cadillac compared to the others.  I love the keyboard.  The mouse-pad is not a problem. The display is bright and crisp.  Movies are great!! Love the fingerprint reader.  The sound is much better than my old unit, so I don't really have a problem with this one.  Had never made this large a purchase online. but everything went like clockwork.  HP Pavilion dv7-4170us 17.3-Inch Laptop PC - Up to 7.5 Hours of Battery Life (Argento)  Just really happy overall with this computer.  Thanks Amazon.  My old laptop (also an HP Pavilion) was about 7 years old, so maybe that;s why this one is such a pleasure.  But there's a lot to be said for the fact that it lasted so long.  I don't think you can go wrong with the value either.  A laptop with the same features at a warehouse club is almost $200.00 more.  And that's after the price increased on this one.The one gripe I have is with Microsoft not HP.  It's the starter editions of Word and Excel.  I already bought an upgrade for 2007, now if I want Outlook I have to buy another.  Can't use my old one.  Enough boohoo.", "Date": "January 7, 2011"}, {"Title": "clickpad not an issue", "Author": "RN \"Jo-RN\"", "ReviewID": "RCE7V30D8PFQO", "Overall": "4.0", "Content": "I have had HP computers for many years - but this is the first laptop I have purchased.  The click pad is no issue for me because I have always attached an external mouse on my work laptop.  This is a beautiful looking laptop - screen is large and vivid and the sound is great..  I bought this for my teenagers and I so that we would have a secondary computer in the home.  The battery duration is a plus because with teenagers they always forget to plug in just about anything.  The speed is excellent and I was up and running in no time.  I was concerned about the price and I thought I would have to pay a lot more for a laptop with the same features as my desktop, I was wrong..  great price even though it went down by 75$ just a few days after my purchase - still worth it because I paid no shipping due to the special and had it ordered and at my door in about 28 hours.", "Date": "December 28, 2010"}, {"Title": "Great so far!", "Author": "angel1", "ReviewID": "R1EKO9UK7MKVKD", "Overall": "5.0", "Content": "Received my new HP yesterday and started removing junk and installing my own software. Setup has been smooth and quick. Love the keyboard and number pad on the side. I have not had any issues with the clickpad at all. My old laptop was an Acer Aspire and that thing was impossible to type on. With this HP it's like typing on a regular keyboard. Love the fun aspect of scanning my fingerprint :D The screen size and memory looks like it will be great for editing my photos. Can't wait to spend the weekend with it working on my photos - that will really put it to the test!I paid the extra for next day deliver because I was so excited to get it and as always, Amazon delivered right on time!! It's good to know Amazon can be trusted with my purchases. I debated whether or not get it from Amazon or two other places but based on my recent past history with Amazon quickly shipping other smaller, less expensive items I knew I could trust them with this larger purchase and they came through with flying colors! Thanks!!UPDATE 8/22/11 - After owning this for 9 months, I have to say I still like it a lot, however, the battery life on this computer is not 7.5 hrs as advertised. At best, I get 3-3.5 hrs battery life when fully charged. Would like to know if others have the same issue or if I just got a bum battery.", "Date": "December 3, 2010"}, {"Title": "HP Pavillion dv7.  Good laptop/bad sound", "Author": "zjschmucker", "ReviewID": "R3F7XXKA15I4VO", "Overall": "4.0", "Content": "HP Pavillion dv7  I purchased this laptop roughly two months ago and have really been wowed by it.  I read all of the reviews before purchasing it, and while some of them raised some questions...generally I'm very pleased.PROS1.  The price is pretty outstanding.  You could buy a cheaper laptop, and rest assured you could buy a more expensive laptop, but this one is an ideal laptop with a lot of good features for a very reasonable price.  I don't use the laptop for gaming or for any other very taxing applications.  It's a fast mover.  Turns right on from sleep or shutdown with little wait.  It's just a good solid computer.2.  It is QUIET.  You can barely hear the cooling fan over a whisper most of the time that it is running.  The raised battery gives it a little one inch boost to keep the air circulating when it's sitting on a desk.  I find that if you rest the battery on your knee it does the same thing when using it on your lap.  I haven't felt the laptop get hot or noisy yet.3.  Some of the reviews mention the hard to use scroll and click touch pad.  It IS a little frustrating at first, especially if you're moving from something else, but I got used to it within a few days.  Once you learn some of the finger tricks it's actually a very useful device with some features not unlike a touch screen.4.  COOL Factor:  The finger-identification is REAL.  I thought it was just a gimmick but it works great.  It doesn't let in other people either (try it with damp or oily fingers and it won't let YOU in.  Add to that the sleek aluminum finish, the gorgeous big screen, the number pad and the bright leds and you've got a very sexy machine.CONS1.  The sound is TERRIBLE.  Unless you know a little bit about sound adjustments or speaker conditions (which I don't) expect to never have the volume up the whole way.  The speakers always give that painful distortion like the bass is up too high.  Certain sounds, like the musical notes when your finger scans correctly, are ever just a little too much for the laptop.  I'm afraid that I'm going to blow out a speaker all the time.  There MAY be a way to fix this, but the amateur cannot without a little research or help.  I can't say enough that the BEATS AUDIO is disappointing.  My last laptop was an HP dv9000.  It has a speaker bar right above the keyboard and it sounded fantastic.  The dv7 was a noticeable step down.  If you hook it up to regular speakers at your desk it's going to be great.  By themselves...well just don't try to push them.2.  I had some initial trouble with the software, whether it was Windows 7 or just the lack of an update.  Programs weren't downloading correctly, itunes took a long time to get working, etc.  I think that was more my problem than the laptop.There's a lot to say about this laptop.  It took me a while to decide that it was right for me but I'm not disappointed in it at all.  Read the reviews, read the specs, and compare it to your prior computers if you have the chance.  Be smart because while it is a reasonable price it is still a lot of money for something that might not work for you.  Ask yourself if you need to have loud, cranked music while running portable or if you can put it somewhere where hooking it up to speakers isn't a problem.  If you need a solid, dependable laptop from a respected manufacturer...really consider this.", "Date": "March 29, 2011"}, {"Title": "great for media", "Author": "solodon", "ReviewID": "R136VG6FXN1GPS", "Overall": "5.0", "Content": "this is one of the best hp laptops out there i just wish i got the blu ray player with it...but overall great buy", "Date": "February 22, 2011"}, {"Title": "HP DV7-4170us is great", "Author": "HBC", "ReviewID": "R28Y2DXFCAFMTU", "Overall": "5.0", "Content": "Purchased for Christmas and was not disappointed in the features I purchased it for. The Beat Audio sounds great compared to any other laptop I have owned. The 17.3\" screen has plenty of viewing room and is clear and crisp. I purchased to replace my desktop and it was a good move. I use it for DVD movies, music and general computing and it came with everything needed to do this and more. Great buy in my opinion.", "Date": "January 17, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00400OSLI"}}