{"Reviews": [{"Title": "Best Value For The Money and Great For Everyday Use", "Author": "Consumer Advocate", "ReviewID": "R3M1JHL1NHYY8K", "Overall": "5.0", "Content": "Although this is a review for the Compaq CQ62-423NR, I have also included other information so that you can benefit more from computing if you need it.I got mine at Fry's at a very good price. TigerDirect has this, too. There are much fewer user reviews there, plus the reviews are heavily edited by TD, which means they may be less useful. That's why I come to Amazon to read and write reviews, even if I didn't buy the product here.The Compaq CQ62-423NR has an Intel Celeron 900 CPU running at 2.2 Ghz, 3 Gb of RAM, and 320 Gb of hard drive. Unless you are a heavy gamer or do lots of Photoshop or AutoCAD work, you shouldn't be concerned that this may be too under-powered. If all you do are everyday tasks such as Internet browsing, email, YouTube, word processing, spreadsheet, etc., this is perfectly suitable. Overall, the computer feels fast and responsive.While fast, the CQ62-423NR runs very cool. I used Speccy to get a reading of the PC's specifications and operating temperatures. The CPU, motherboard, hard drive ran at 32, 36, and 34 degrees, respectively. It is very comfortable to have it sit on my lap, compared to my 4-year old HP DV7 (Core 2 Duo P7350), which has a corresponding readings of 76, 70, and 43 degrees! A cool computer is also more reliable and lasts longer.This computer does not have a built-in webcam, but you can always add one later via the USB port. I'd recommend one made by Logitech or Microsoft.This 15.6 inch notebook computer does not have a numeric keypad like most in this size category, but it does have dedicated and programmable keys on the leftmost column for things like email, CD player, Internet browser, Print, and Calculator. On the rightmost column, there are navigation keys for home, PgUp, PgDn, and end that are more intuitive to use than horizontally arranged keys for these functions on keyboards with a numeric keypad.The built-in Internet Explorer always feels sluggish. You should use other browsers (Chrome, Firefox, Opera, Safari, etc), because they are mostly more speedy, more memory-efficient, and have more features. I like Chrome the best.Also, you should get a system optimization software to keep your computer in good shape all the time. I use Tune-Up Utilities ($30), but you can try a free one by Glary Utilities first. I like Tune-Up Utilities because you can pretty much set and forget; it will constantly keep your computer in an optimal state.Additionally, I recommend a free program called \"meminfo\" (by Carthagosoft) to keep track of your PC's memory usage and \"defragment memory\" when necessary. You can configure the software to show you in the lower right corner of the screen how much memory you have left (in percentage, to be more useful) as you use your computer. You can right-click on the indicator and select \"Memory Defragmentor\" to reclaim memory used by programs that you have quit using. This is a lot more useful and convenient than having to restart your computer from time to time to remedy a sluggish computer.There is a website called ninite.com which lists a whole bunch of well-known, often used, and free programs in many categories that you can select then install all at once, without any more human intervention. This is the quickest way to have your computer populated with useful programs, and it's free. Not only that, if you keep the setup file, you can run the file at a later date and it will update all those programs automatically. This is really a time-saver and I highly recommend it.", "Date": "August 1, 2011"}, {"Title": "Compaq Presario CQ 423", "Author": "BillPen", "ReviewID": "R2J7N3P41DV5UK", "Overall": "5.0", "Content": "I also purchased this laptop for $260 at Fry's, Anaheim and am very pleased.  The quality is better than most.  I did buy a wireless Microsoft 4000 mouse at Staples for $14 and that made it more comfortable and faster to surf the net.  I also own a Compaq Presario desktop and have been happy with it for over six years.  I have yet to find a laptop with 3gb and 320 hardrive, Altec Lansing speakers, etc for less money.  Highly recommend.", "Date": "June 14, 2011"}, {"Title": "Great little notebook", "Author": "Cassie", "ReviewID": "R1VZLTXSN6CYWY", "Overall": "5.0", "Content": "I was iffy about purchasing a notebook from Amazon but this particular model was recommended to me by a friend, all in all this notebook is great for surfing the web, downloading movies, music etc.. is slow at starting up but after initial start up runs pretty fast, does not have webcam or hdmi but it is solid and I would recommend it for students.", "Date": "September 6, 2011"}, {"Title": "bought it 3 years ago", "Author": "mil280", "ReviewID": "RWOW97B3JTFA3", "Overall": "5.0", "Content": "I have Toshiba anniversary computer that I paid 1900 for and it broke down three times and I decided to buy this one cheaper for university to be honest one of the best laptops I ever owned no problems with it, the only thing that I got for it was Norton 360. But every day this computer works like it was bought yesterday. Love it cant go wrong with price and computer.Pros: Life battery 2+ hoursQuick, every time it turns onHD displayLightGreat for every day useCons:Have to use air can once a year to clean fan.", "Date": "May 10, 2012"}, {"Title": "great buy", "Author": "eazyrider", "ReviewID": "R1F2JM8I1HJ3U", "Overall": "4.0", "Content": "i am going to keep it short good product at good price does the job no web cam and battery life kinda short but for the price its nice good speed to", "Date": "September 28, 2011"}, {"Title": "definitely the best", "Author": "Jonathan Valverde", "ReviewID": "R1O60NA78AKRYW", "Overall": "5.0", "Content": "I`m not gonna say is the best laptop in the world but was looking for a nice lappy that can be used by my mother for check the email. surf the web and write a couple things and it`s exactly what I got, 2 years and half later keep working without any trouble at all....", "Date": "March 17, 2014"}, {"Title": "Great computer for the $$$", "Author": "RICK DENISCO", "ReviewID": "R2V7S3N935VA7F", "Overall": "4.0", "Content": "I bought this 2 years ago at frys for $260. It's been great and super functional for my purposes. 98% I use it for web surfing and email.  I don't do any gaming. I don't know what some of these some of these negative (1&2 star) reviews are about, maybe they got a bad one, happens with all manufactures. The reviewer that said the keys were hard to read must have been blind, the font takes up 1/3+ of the key, makes me wonder what his motive was. I haven't had any wifi connection problems, and I'm at Starbucks and Mc D all the time. The battery life was an issue, 2 1/2 hrs, but I knew that when I bought it. I picked up an aftermarket battery on ebay for $39 and now get 6 hrs. It's not a $1000 gaming laptop, but its been great for the $$$ and my needs. I would give it 4 1/2 stars if I could.", "Date": "January 9, 2014"}, {"Title": "THis Little Notebook can do EVERYTHING!!", "Author": "George", "ReviewID": "R219MDDXV5HYG2", "Overall": "4.0", "Content": "I had this computer since october 2011, it runs decent i play games and it lags but not that muchi would prefer a celeron processor than a pentium.", "Date": "February 11, 2012"}, {"Title": "Buen computador...", "Author": "carias", "ReviewID": "R3DEA1ZXXX2JSN", "Overall": "4.0", "Content": "Excelente computador con buenas caracteristicas de hardware y además a un buen precio. No le doy cinco estrellas ya que su mouse me pareció un poco incomodo, pero aparte de ese pequeño detalle creo que puedo recomendar este equipo como una buena opción de compra para aquellas personas con presupuesto limitado...", "Date": "November 11, 2011"}, {"Title": "compaq cq62", "Author": "Kevin Matthew Spears \"loudpathfinder\"", "ReviewID": "R1ET33H1QGEZIS", "Overall": "5.0", "Content": "i bought this cq62 at frys factory refurbished at frys for $300 its a great laptop for the price its only.2ghz slower than my broken hp dv7 3065 i got for $699 and its sound is better also the screen is just as clear and it is not noticably slower than that one either i dont need webcams or sd card slots so not having these doesnt bother me neither does the lack of hdmi slot. the 320gb hard drive is enough space and 3gb of ram is plenty for everyday use such as internet, word processing ect. and the graphics card has good gaming graphics for price as well it has stylish looks to me the processor is out of date but great and the build quality seems good i enjoy this laptop", "Date": "October 5, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004ZBRJRW"}}