{"Reviews": [{"Title": "Fairly decent", "Author": "Luka the King", "ReviewID": "R3KW8E0HLAJCD3", "Overall": "4.0", "Content": "This is indeed one of the better computers i have owned laptop wise.the design is sleek and pleasant, coupled with it being lightweight it is quite the looker.The hard-were is upscale, the keyboard is responsive and sharp, no 'mooshy keys', the clicker buttons seem to die rather fast however, but a wireless mouse easily remedies this.  The touch pad is centered, leaving no room for 'wrist scrolling' that seems to be a BIG problem (for me anyway, when i'm trying to type) with other models.  Battery life seems low at first, but if you play with the settings enough, it will last a few hours longer then even the label on the battery itself says. the HDMI and basic computer monitor outputs are nice to have, and if set up properly, can lead to three scrolled screens which the processor can handle with no speed reduction.  All other basic ports are also standard, CD drive, USB ports, headphone / microphone, even SD card slot (which i was surprised by at how quickly the system reads the cards).  The fact that a webcam is optional, but the microphone is always included, is a bit of a let-down.  a webcam seems like a standard with any laptop nowadays.The screen is smooth, large, and pleasant, everything from basic programs to HD movies look superb.The system itself is nice, widows 7 cranks things out in a flash, IF your not doing too much.  The thing about this laptop is, that its a good work computer.  it works well for school, or business, as well as running basic programs and browsing.  but it should not be used as a gaming laptop by any stretch of the imagination, even mad amounts of upgrades would quickly put both your wallet and the laptop under deep water.  It does a good job of playing old games however, something for early XP, but the memory it needs might suck up a lot of your space.The filler and demo products are easily removed, unlike old systems where you had to install the full program, THEN uninstall it.  Even programs like internet explorer, (on my old laptop) you could not uninstall at all because it was a 'necessary program'.  But every program I have is non-stock, smaller file sized, and the laptop runs just the same, even faster in some cases.It is highly customizable, as it should be, but even things that were 'un-changeable', like the logon screen, can be changed very easily.All in all, a wonderful machine for a wonderful price (even though I got mine for $350 from a local store, and yes, its exactly the same, it was a sale), provided you get it for the right reason, and don't overload it.A great school computer that is reliable, strong, and fast.A definite buy.", "Date": "January 24, 2011"}, {"Title": "MOST AWSOME COMPUTER!!!", "Author": "computerguy", "ReviewID": "R2X8UGNUB7RNYU", "Overall": "5.0", "Content": "This is the best computer I have ever used.  I have used Mac's, I have used Dell's and just about any computer you can think of.  This is by far the fastest, best computer I have used.  I have pulled up 8 tabes in 2 windows online and downloaded dvd's and it still runs at full speed.  The only thing I would do if I bought this computer is uninstall all of the HP software.  It slows the computer down and it's not needed.  I thought I was going to buy the computer and it would be slower because it only has one opperating system, but I was wrong.  I would tell anyone to buy this computer.  Cheap and very durable as well.", "Date": "January 21, 2011"}, {"Title": "great value", "Author": "Ann H Stauner", "ReviewID": "R21DK0FAG0WNTG", "Overall": "5.0", "Content": "Excellent value for the money.  The LED screen and picture is excellent.  Keyboard is very responsive.  Mouse and scroll functions are a little touchy but can be easily rectified by buying a mouse.  I got one that attaches to USB slot for about $5.Sound is good and it operates very fast.  I can't find anything wrong with it yet.  So far, I love it.", "Date": "May 4, 2011"}, {"Title": "Perfect PC at perfect price !", "Author": "Tonyideal", "ReviewID": "R2R2D08JIRC29M", "Overall": "5.0", "Content": "Went to Anythingideal. Com and got a promo for shipping. 4 year old twins at home and thoughtthey would make a great bday gift. This pc is faster and easier to use than the $900 HP and Dell pc's I already have athome. I now take it on business with me instead of the others - it's that nice !Got free shipping and had it in 3 days. Best deal I've made in years !  You won't be sorry", "Date": "June 12, 2011"}, {"Title": "Great bang for the buck", "Author": "Amazon Customer", "ReviewID": "R2POINH99INYZK", "Overall": "5.0", "Content": "This is a great workstation computer. Although, I have watched movies on it and it performed really well. HP is a reliable company, I have two other laptops and a desktop all Compaq brand and don't have any complaints. Had one Vista compatibility issue months after purchase that HP Support was able to solve, searched for the error description and a simply firmware update took care of it. With computer parts like optical drives and even motherboards being common to many manufacturers breakdown issues are not dependent on brand names. Paying hundreds more doesn't guarantee reliability.", "Date": "March 20, 2011"}, {"Title": "PRETTY GOOD LAP TOP!", "Author": "Robin09", "ReviewID": "RTGCQ6T3IACPJ", "Overall": "4.0", "Content": "All i really i use it for is internet use and its pretty great! i love it. so far so good, especially for the price.", "Date": "March 5, 2011"}, {"Title": "LOVE IT!", "Author": "Maxine \"~Marsha B\"", "ReviewID": "R25ST52IM4VNQA", "Overall": "5.0", "Content": "This is the third Compaq Presario I've had in the past 16 years or so.Bought the first one on eBay (used) and it was going strong, five years later, untilmy son spilled large glass of juice all over it. I got the second one a few monthslater and it lasted over 10 years. Never had any problems with it. Of course, asyou can imagine, it was a tad slow.  I bought the latest one (Compaq PresarioCQ62-410US 15.6-Inch Notebook) a few weeks ago and I could not be happier.From the classy (and practical) matte finish to the sharp & clear screen I'menjoying every aspect of it.  The price amazed me. I never dreamed I couldfind a laptop, of this quality, for under $400. It certainly isn't for the serious gamerbut it is perfect for me. It surfs the web with lightning speed, loads web pagesquickly, uploads and organizes my pictures, Flip videos, plays CD's and DVD'sand so much more. (I haven't tried burning CD or DVD's yet) I'm not a techie - so Icannot comment on the RAM, etc. with much knowledge. I've never liked NOT using a mouseso I do use one with it. It's a Longtech wireless - which I love. The Wi-Fi connected easily tomy system that I use for my Kindle, iTouch and iPad. If you are looking fora practical and fun laptop with the basis (and then some) this Compaq is a great choice.", "Date": "May 13, 2011"}, {"Title": "Awesome Notebook", "Author": "Marcus A. Stephens", "ReviewID": "RUY53SIM4SK8B", "Overall": "5.0", "Content": "Easy to setup, clean and and very clear pictures, great sound quality, lightweight and very stylish. This is my first Notebook I purchased for myself and I have to say everything about this Notebook is great. Holds a charge for about 4 to 5 hours, as a matter of fact I'm writing this review on the Notebook now. Highly recommended for 1st time buyers.", "Date": "May 23, 2011"}, {"Title": "This is a wonderful start computer", "Author": "Padilla Rojas Nilber Enrique \"Luckyman\"", "ReviewID": "R2XT0S9GU30KHO", "Overall": "4.0", "Content": "This computer is wonderful for those who want to do basic computing stuffs, not that good for editing if you want to make movies or videos however, it helps you resolve the situation. It's fast and it's good. It's big enough that you feel confortable with it.", "Date": "May 18, 2011"}, {"Title": "Im so glad I got it!!!", "Author": "diva39180", "ReviewID": "R6KCHJBJAXJ2O", "Overall": "5.0", "Content": "My family has enjoyed this since I received it. I have two high school students and Im in college. It has helped tremendously!", "Date": "March 14, 2011"}, {"Title": "You can do so much better than this with the same money.", "Author": "Jim", "ReviewID": "R1PZ7DKNOZQTY5", "Overall": "2.0", "Content": "I bought my CQ62 in spite of the warnings because I found a \"great deal\". It worked exactly as expected out of the box, but I was immediately disappointed by a slight curve in the key board. The keys in the center of the top half of the keyboard were all slightly lower than the others. It was odd, but in all the time it functioned I never had a problem typing, so I got over it.The second thing I noticed was that it was difficult to use the static mouse. It worked fine, but it was seamlessly integrated into the texture of the case. It looked neat, but it's easy to run your finger off the edge without realizing it, then you have to look down to reorient your hand. Again, it was minor and I got over it.Then, about a week later, I noticed the wear on the keys. The texture rubbed off amazingly fast. Again, minor, but looked grungy and the problems were starting to add up. I've typed daily on my 2003 dell for nearly a decade, and the keys still look better.Next came the heat. That computer got very hot, and the fan ran often and noisily. I already had a cooling pad for my old dell, so I started using that and enjoyed the nearly constant gush of warm air from the fan all winter long. My fingers get cold when I type. Over all, I'd say this problem was a wash......Except that all that heat was slowly destroying the video processor (which, after hours of research into the problem, I now know is fairly common). About three months in I first saw what I thought was an eye lash on my screen. It didn't brush off, and it didn't wipe away. \"Oh well,\" I thought, some reviewers said they got dead pixels. I knew that coming in. A week later I got another, then another a few weeks after that. Then things seemed to settle, though every now and then a few more pixels would wink out. I've since been told that the little strings of black pixels were probably not dead. I was told that if they'd been bad pixels they would have been bright, not black, so they were most likely advanced signs of a dying video processor.About a year and a month after my ill fated purchase the screen failed to come on when I opened the computer. I could hear the start up sounds and the welcome to windows fanfare blared from the speakers, but no video. I closed the lid and reopened, then I restarted, then I restrained myself from banging it against my head. It worked fine the next day, and for a few weeks after. I scanned with Windows Security Essentials and Malware bytes and called it a fluke. Then it happened again, and again, and so on for several months before the screen went dark for good. I scoured the internet (with my wife's Mac) for a cause and solution. I discovered that external monitors still worked so I hooked it up to my TV. I rolled back the system, reloaded drivers, and a dozen other useless fixes. I was about to format the hard drive when the external monitor became garbled and went black.The computer lasted for a year and a half. I have since come to learn the the problem is most likely a bad solder connection in the video processor. I can either buy a new mother board, or try to heat and reconnect the one I've got (apparently people have had some success heating the board with a heat gun or in the oven). For now it's just sitting on a shelf. I bought a nearly identical Toshiba Satellite C655D for fifty bucks less. I've had it for a month and I am very happy with the build quality (Somehow it's lighter AND sturdier!) It has a little less processing power, a little more ram, bigger hard drive, a full size keyboard, multi-touch function for the mouse, a web cam, a media card reader, and a super bright display (this is the first computer I've ever been able to use outside on a sunny day). It also runs cooler, quieter (I have yet to hear the fan), and more consistently. My only complaints so far are the too-quiet speakers (I sometimes have trouble hearing quiet youtube videos even in a silent room), and the very faint *dub* noise my battery makes every time I pick up the computer. It is more than a fair trade. Just keep an eye on Toshiba.com and Best Buy for a decent sale and steer clear of the CQ62.", "Date": "March 28, 2012"}, {"Title": "Recommended", "Author": "Dj Deivid", "ReviewID": "R1FJONEQUMHDU8", "Overall": "5.0", "Content": "I've got this laptop a month ago and i have no problems with it... I love it, it's a nice price, very fast... The only thing that I did not like is that there's no NUM LOCK PAD on the keyboard, so you cannot use the ASCII code, but it's ok... It is NOT a waste of money!!!", "Date": "May 23, 2011"}, {"Title": "Son's Computer", "Author": "Patricia Kanczes", "ReviewID": "R291C8LJ1OLT6H", "Overall": "1.0", "Content": "It is loud and very slow.  I am not able to play my game on this computer and that was what I was hoping to use it for.", "Date": "May 5, 2014"}, {"Title": "Don't buy it", "Author": "Tomas Vrbada", "ReviewID": "R4XOUGE3RS67U", "Overall": "1.0", "Content": "This computer runs extremely slow, the fan is as loud as a jet engine and they keyboard is very awkward to use", "Date": "March 28, 2014"}, {"Title": "Compaq got it right with the Persario CQ62.", "Author": "Eric G. Malinowski", "ReviewID": "R1TSXAE1T7A55M", "Overall": "4.0", "Content": "I really like this unit.  It is quick and responsive,  You can probably find a good used one cheap.  If so, get it.  You won't be disappointed!", "Date": "February 27, 2014"}, {"Title": "good product", "Author": "RGLM", "ReviewID": "RWI0OLI5N3XJO", "Overall": "5.0", "Content": "excellent product quality, the purchase was fast, all I taste, I recommend this product to all people have this kind of need, because it meets all requirements.", "Date": "February 20, 2014"}, {"Title": "A wonderful computer for laid back users.", "Author": "HitroahBlue", "ReviewID": "R26O8C1T0FDU5Z", "Overall": "5.0", "Content": "If you're like me, and the most you're going to use your computer for is school work, internet surfing, with perhaps some art (photoshop, GIMP, SAI, ect) and a few small computer games (like The Sims), then this computer is wonderful.This computer is reliable, durable, and dependable. (The Windows 7 interface certainly helps with that.) Sure, it only has 2gb of ram, but as long as you're not going to be running 6 or seven windows on Steam, you're fine. Don't fret. I regularly play The Sims 3 without much hassle. This laptop has followed me through college and has survived water and being dropped- repeatedly, oops.My only warning for this laptop is that a \"stuck\" or malfunctioning keyboard seems to be a natural decay point. My laptop's keyboard died around a year and a half after being bought, and replacements wouldn't register; something within the keyboard connectors, itself, may be the issue.DON'T PANIC, for there are many, many USB keyboard accessories on the market that are the exact size of the space the normal keyboard takes up. Buy one, and it'll sit neatly in the slot, with no silver internal workings visible! It may not be aesthetic to have a chord coming from under the keyboard, but, really, the computer works fine - over a year later - and there is absolutely no reason to replace it just because I couldn't type a sentence.If this laptop will be used by a careful person who's good with electronics, it is well worth the consideration.", "Date": "January 17, 2014"}, {"Title": "Compaq Presario Cq-62 review", "Author": "Amazon product reviews", "ReviewID": "R1FM4KMCP0XI0E", "Overall": "3.0", "Content": "I gave this product a 3 star review, not because it is particularly bad, but because it didnt meet my expectations. I ordered it from EZCorp, and the product was shipped quickly, and with quality packaging. I received it in the condition they said it would be in. Overall I was happy with the product as the performance is good for the price. I returned the product only for the fact that it wasn't powerful enough to play the game I wanted. I returned it and the company took good care of me, not only taking it back without dispute, but also helping me find a laptop which fit my needs. If you don't want a laptop for gaming, just a good everyday laptop I would definitely recommend this product.", "Date": "January 16, 2014"}, {"Title": "Great Computer, Good for a wide range of people.", "Author": "K.Davv", "ReviewID": "RG6UMQ6AG4EB", "Overall": "4.0", "Content": "I got this computer when I was entering 6th grade. My father and I have always been into computers and although I hadn't known it at the time, he was looking out for me by purchasing this for me on my birthday.I've been on this computer for school work, games, fiddling with computer things. Everything worked. From Sims 3 games to ten page essays this laptop has been fantastic. I've protected it with Norton, and and I pamper my computers. But honestly this computer has been great.(Don't worry - it's in laymens terms)CONS- The fan can heat up, and it tends to be noisy (especially as the computer gets older)- The graphics card could be better, doesn't support high level games such as Skyrim, but it's good with most.- The feet on the bottom fall of rather easily- The HP tool thingies get annoying- Batteries require replacement after a year or twoPROS- Great speed (2.2 Ghz) for such a cheap laptop- Relatively light- Good memory- Sleek black design- Easy to use- Comfortable keyboard and track pad- Convenient short keysEITHER OR- Track pad take some getting used toOverall, I recommend this laptop to students, for office use, and for home life.", "Date": "July 18, 2013"}, {"Title": "Don't waste you money", "Author": "EliMcHanson", "ReviewID": "R38Z9AS3S8AUHO", "Overall": "1.0", "Content": "Compaq is probably the s***tiest laptop brand ever, I owned two and the hinges broke in the same spot. Don;t waste your time or money, buy something that is more durable and worth your cash.", "Date": "May 30, 2013"}, {"Title": "Entirely Unusable, Waste of Money", "Author": "Ryan", "ReviewID": "R1STMT8Z7R5ET7", "Overall": "1.0", "Content": "Slowest computer I have ever had the misfortune of operating. While turning it on to write this review, I decided to count how long it took. The result was 21 minutes of a black screen. At 22 minutes, a toolbar popped up asking me about projector options. I do not even own a projector. Then, at about 26 minutes, it loaded my desktop. I clicked on Google Chrome to write this review. A notice told me the computer was unable to complete the simple task of opening the internet, and I was faced with a black screen again. I turned it off and got my mother's laptop, which I am writing from now. Over the past year of using this computer, I have learned its REAL flaws, not just the ones the reviewers write. It cannot perform simple tasks. It cannot run even two applications at once. Its battery life is only about 1.5 hours not 4 like the description states. It is flimsy and requires great care as to not completely demolish the whole computer. I just opened my laptop to find a key pulled off the keyboard. I despise this machine with all my being. This is not the only HP product I have experienced problems with. I DO NOT recommend purchasing this item. I STRONGLY SUGGEST AVOIDING THE PURCHASE OF HP PRODUCTS.", "Date": "May 11, 2013"}, {"Title": "My bang around computer", "Author": "Art Cline \"artess\"", "ReviewID": "R31LOGPBH6YI3V", "Overall": "5.0", "Content": "I use this computer when traveling and it gets knocked around a lot.  I really don't treat it with \"care\" and yet it has never given me any trouble.  It has all the features I need, but the cost was low.  I've owned this notebook for several years, so I guess I'm really giving a great review to Compaq (not just this notebook) for building a reliable computer.", "Date": "April 8, 2013"}, {"Title": "Garbage computer and waste of money", "Author": "panton41", "ReviewID": "R1ZPWMXXWKCHKT", "Overall": "1.0", "Content": "My grandfather loaned me his Compaq QC62-410US to repair. His main complaint was odd behavior and that it ran too slow. If HP is the garbage in the can outside your house, Compaq is the stuff in a dumpster that hasn't been emptied in a month and is full of used diapers after a dysentery outbreak. While in 2010 having only 2GB of RAM is understandable shipping even a bottom-end computer a single-core processor is a crime. If any company in 2010 was crappy enough to still be selling single-core computer it would be Compaq. Also the 2 year-old system had a bad battery that wouldn't hold a charge at all (again, a criminally short life).After a security scan found nothing wrong I turned to the crapware to find the default Compaq image used almost 1/3 of the RAM to run useless crapware and it used 3/4 of the RAM sitting idle after boot. Ran MSCONFIG, turned it all off, and viola it ran fine and had 2/3 of the 2GB available. Uninstalled the crapware, installed Microsoft Security Essentials to replace the unholy bloatware that is McAfee and it ran ok enough to give back.Yeah, I know this computer is old but Amazon still lists it as being available for sale new and used. Don't waste your money and put the $500 they're offering for this piece of s*** on a decent Asus.", "Date": "April 1, 2013"}, {"Title": "Wonderful", "Author": "Mi. Li.", "ReviewID": "R1ME6E9ANY5JZ6", "Overall": "5.0", "Content": "I was initially reluctant to buy a \"cheap\" pc, but decided to take a chance. It's wonderful and fast and would not hesitate to recommend this computer to anyone. I'm a MAC girl, myself.... but for Windows, you can't do better!", "Date": "February 1, 2013"}, {"Title": "Bueno", "Author": "Daniel Garcia", "ReviewID": "RORF3HRAD9FFL", "Overall": "4.0", "Content": "Excelente producto, cumple totalmente con el requerimiento, escelente entrega, buen negocio, muy agradecido.  Llego en buen estado y perfectas condiciones", "Date": "January 15, 2013"}, {"Title": "Awful", "Author": "Lily", "ReviewID": "R7GKDZHAEF2YG", "Overall": "1.0", "Content": "The clickers are absolutely terrible. It's one long bar for both the right and left clicks so basically you have to press EXTRA hard to get anything...also, my laptop lasted less than a year before the fan started malfunctioning...its days are numbered now... :(", "Date": "August 14, 2012"}, {"Title": "for a normal user, ok.", "Author": "joe", "ReviewID": "R2IUKBLCAZLKJX", "Overall": "2.0", "Content": "this laptop has major flaws. the battery life. i had it for 10 months and the battery lasted 30-40 minutes. but, it charges fast. the cooling unit is rubbish. you can have it in your lap for 20 minutes, and it will be an oven. there is only 1 cooling vent/fan. it over heats too fast. if your a gamer, this laptop is not for you. i play some games sometimes on this, but it is noticeably laggy. not too much, but noticeable. for someone who checks their email, and other things like that, this is the laptop for you. if you are a gamer, a traveler, or you type long documents, this is not for you.", "Date": "June 23, 2012"}, {"Title": "Fairly good", "Author": "Rebirth", "ReviewID": "R3IF1XUOOWCK8C", "Overall": "3.0", "Content": "i bought this back in 2011 beautiful piece of equipment for work. The reason i give this 3 stars is because after 2 days of barely using it the touchpad started to give trouble which isn't really bad since i prefer use a optical mouse. I didnt really want to go through the hassle of returning it because of that. Otherwise its fast, reliable and the LED screen makes it look very pretty", "Date": "February 17, 2012"}, {"Title": "Excellent", "Author": "Robomedic33", "ReviewID": "R2N1JXOZKOYCI6", "Overall": "5.0", "Content": "Great product item was shipped prompt and in condition as described would definitely do business with again!!!!!Compaq Presario CQ62-410US 15.6-Inch Notebook", "Date": "December 15, 2011"}, {"Title": "my first notebook", "Author": "valued amazon cust", "ReviewID": "R3GP4BFHT0HZDZ", "Overall": "4.0", "Content": "just brought my first notebook a few days ago not sure if i choose the right one but after a few days in very happy with my decision im very happy", "Date": "December 12, 2011"}, {"Title": "Buy ANYTHING else", "Author": "trprJim", "ReviewID": "R2ZL335BYDTZA3", "Overall": "1.0", "Content": "I bought one of these 5 months ago when my old Toshiba blue screened.I got an HP because my Dad had one (different model) that ran for years without any problems.Now I wish I had gotten something (anything) else.When it was 6 weeks old one of the keys popped out of the keyboard.I eventually got it to go back in after fooling with it for a week.This thing puts out error messages I have never seen before.The cursor will suddenly vanish leaving me with no option but to turn it off with the power button.Screen zoom will suddenly change,either making it too small to read or too big for the page to fit on the screen.It's most annoying \"feature\" is the way the cursor will fly off all the way across the page when I try to click on something (or sometimes when I'm only trying to move it),often with disastrous consequences.Sometimes I can move it back where I want it,other times it will take off to some webpage I didn't want to go to and result in loosing something I just spent an hour working on.  My Dad's old HP died about two weeks ago.My siblings and I are chipping in to buy him a new Dell (or anything but an HP)for Christmas!", "Date": "December 1, 2011"}, {"Title": "Compaq Presario CQ62-410US 15.6-Inch Notebook", "Author": "H. K. Ball", "ReviewID": "R1QFLSRW2HW2XB", "Overall": "1.0", "Content": "... touch pad very difficult to use, much inferior to my last four laptops (last two purchased through Amazon)  ... no HDMI outlet, which I intended to use with my new TV set (recently purchased through Amazon)... had ordered an HDMI cable through Amazon, (it never arrived, you refunded my payment) ... purchased cable from Wal-Mart, new TV audio and video work just fine with my old laptop through that cable ... I notice you offer a 6 ft VGA to HDMI converter cable, but assume that's video only, no way to transmit audio ... main intended use is for playing internet based movies and youtube", "Date": "November 8, 2011"}, {"Title": "Great buy!", "Author": "ilovecali", "ReviewID": "R1CS30DKM59M61", "Overall": "5.0", "Content": "Love this little laptop. Perfect for my needs. Will take some getting use to. Has a lot of fuction keys. Get buy. Will buy from this seller again.", "Date": "July 22, 2011"}, {"Title": "it's good laptop for value, but misadvertised", "Author": "Vin S. \"vin sab\"", "ReviewID": "RPDND1MWX35SF", "Overall": "4.0", "Content": "good laptop work great but didn't have a webcam and sd card slot as advertised in pictures. other wise great laptop.", "Date": "June 28, 2011"}, {"Title": "First computer that lets me enjoy all features of modern Internet and computing", "Author": "patois", "ReviewID": "R7BYTGUKOBXTU", "Overall": "4.0", "Content": "My last laptop was a Lenovo Thinkpad so this laptop is gargantuan in comparison and I'm still getting used to the new size and extra weight.  Notwithstanding, I am really loving this new computer environment.  Beautiful desktop themes that change the background now and then, enough to keep interesting but not too much to be distracting.  I had already purchased MS Word so I could just download it onto this new laptop.  I'm disappointed that MS Word is no longer included with computers but that's been the case with every new computer I've bought in the last 6 years.Not sure what the deal is yet with some connectivity issues.  I have an external wireless device which I am now using for connectivity because the laptop won't let me connect to some local networks I could connect to on the other laptop.  Don't quite understand this and the troubleshooting application has not resolved this or lent much guidance into the problem.  Have not called customer service yet.I do love the large, clean screen with sharp definition.  Now I am finally able to just click on video links and watch them whereas I couldn't on my other machines because they would constantly be buffering.  You can really enjoy the screen quality on such applications as Google Earth.Also I love the large screen area when using MS Word; I can really zoom in or out of the document as much as I want and get different perspectives on my work.  There's a lot of cool games included too.This laptop, in the 2 days that I've had it, runs with the speed I am used to from my office experience and I really feel I can work professionally.  Seems to have everything I need.  Other people have mentioned this laptop is not the best for gaming but I'm not interested in gaming, just documents, internet use and music.  Works great for everything I need so far, including all my go-to programs.", "Date": "June 11, 2011"}, {"Title": "streaming", "Author": "polabear", "ReviewID": "R1OR7WOPGJUB61", "Overall": "3.0", "Content": "Its an ok laptop. having trouble streaming youtube videos and other online videos. keeps buffering and freezing. performance low. also the touchpad very sensative and the clicking is hard to do. Other then that its an ok laptop.", "Date": "May 17, 2011"}, {"Title": "Works fine", "Author": "BB", "ReviewID": "RPAGYZKXL5E0Y", "Overall": "4.0", "Content": "I haven't used it very much but it seems to be working like it should.The wireless works fine when I can find a hot spot. The touch pad works fine but can be a little tricky. It's a little heavier than other laptops I used. No complaints so far.", "Date": "April 2, 2011"}, {"Title": "Look for Something Else", "Author": "IP from Cali", "ReviewID": "R2UZ859K2WHHQ9", "Overall": "2.0", "Content": "I had an economical Compaq all-in-one and was very happy with that so I bought this one and hate it. The touch pad is an absolute joke. A small, undefined area for scrolling and a very narrow bar for clicking make it a nightmare to navigate through pages and to drag and drop. I have to use it with an external mouse. There is also no guide to the many function keys on the keyboard that it touts. It also often turns off the WiFi connection off and gives very poor guidance as to how to turn it back on. When trouble shooting my loss of connection for the first time, I was so frustrated that almost threw it out the window. The diagnostic system told me the WiFi connection was off but did not offer to tun it back on and gave very vague guidance as to how to turn it back on. It turns out that it's just one of the many function keys. Also be aware that it does not have webcam.", "Date": "May 18, 2011"}, {"Title": "Be careful - no built-in webcam", "Author": "Dan H", "ReviewID": "R1MRSAZFO7KLQ7", "Overall": "4.0", "Content": "I was looking for a low cost laptop for my mother. It is used for browsing and simple tasks like skype, movies, mp3s etc. Be prepared to receive this laptop without built-in webcam, that's definitively a huge  disadvantage so carefully review spec and/or contact the seller. I'd say this laptop is good value for the money but don't expect something extraordinary.", "Date": "September 13, 2011"}, {"Title": "Cheap YES...Quality...NO", "Author": "ahmomof2", "ReviewID": "R2M5YMC237077Z", "Overall": "1.0", "Content": "I have had TWO...count them 1...2 of these beauties.  The first one, the keyboard and the screen went out.  That one was stolen (I laughed when I realized that the theif left the attached keyboard, screen, and external memory needed to make that piece work).  Insurance replaced that laptop with another Compaq.  I have had the new Compaq for a year now and guess what....screen is out and several keys on the keyboard don't work. To top it off the battery was worthles within three months.  Fool me once shame on you, fool me twice shame on me!  This PC is bad enough to make me switch to Mac - something that I never thought that I would do.  Keep shopping people...don't stop here!", "Date": "July 28, 2011"}, {"Title": "Good starter Computer", "Author": "Karlee", "ReviewID": "R1WN2SR0FHJZP9", "Overall": "4.0", "Content": "Works Great! Really Fast. The only problems are the touch-pad mouse quit working after a week and the battery life went down very quick. But still works good!", "Date": "March 19, 2011"}, {"Title": "Good Value for the Money", "Author": "dedalus69", "ReviewID": "R1REJJT5U3GFTE", "Overall": "4.0", "Content": "Definitely a good value for the money.  Competitive pricing with good tech features.  Haven't experienced any of the issues others have mentioned.  Weight/size ratio is excellent.", "Date": "March 8, 2011"}, {"Title": "only buy this computer if you hate yourself", "Author": "ricky", "ReviewID": "RRSXKQ811H0H5", "Overall": "1.0", "Content": "This laptop is a big hunk of garbage!I am a 21 year old college student home for the summer. My laptop broke, so I began using my mom's Compaq US62-whatever until I could afford a new one. Since then, this laptop has brought me endless frustration and anger, and honestly has lowered my quality of life a bit. It is EXTREMELY slow, and when I say \"extremely\" I mean that if you simply \"right click\" on a blank space on the desktop, the right click menu HAS TO LOAD. Seriously??? It took me about 15 minutes just to get to this webpage so I can release some of my anger with this silly review. I have a netflix account which is being wasted, because streaming video is impossible. There is nothing wrong with our wireless internet, either; all of our other computers and wireless devices work just fine. I've tried troubleshooting our wireless and everything else. When I brought it to my mother's attention that her laptop is ridiculously slow, she simply stated \"it's not good at multi-tasking.\" HAVING MORE THAN ONE TAB OPEN ON MOZILLA FIREFOX IS NOT MULTI-TASKING!!! She uses the computer maybe 2 hours a week, to go couponing and to check her email. Even with those two activities, she recognizes the computer as slow. So, if you're thinking of gaming, watching video, or doing anything besides staring at the desktop waiting for a program to load - this is not the computer for you.Besides it's pitiful slowness, it is also really big and clunky for no reason. The trackpad is awkward, gets greasy very easily, and hurts your wrists. The keys are black, so its impossible to see in the dark. The only plus I can think of is that the screen is kind of big, but the quality isn't superb and what's the point of a big screen if THE MACHINE DOESN'T WORK AS INTENDED. When people wonder why Mac is overtaking Windows/PC, this is exactly why. Windows licenses it's operating system to lackluster, low budget companies who put the same amount of thought into their computers as a fat dude on a frito-lays assembly line. These people just want to make a quick $400 off of you.Honestly, don't waste your money.. You may be allured by the cheap cost, but the machine is quite frankly a poor excuse for a laptop. Only buy this machine if you are a masochist and are determined to punish yourself for past misdeeds.", "Date": "August 11, 2011"}, {"Title": "Compaq Presario CQ62-410US 15.6-Inch Notebook", "Author": "shoptalk", "ReviewID": "R3HMJLN2EV2FP8", "Overall": "1.0", "Content": "I bought this laptop and keep it in the box until I got my energy level up to try to connect it up and turn it on. I could not get it to work and once that happened I lost my energy and waited until I got in the mood to fool with it again. Well I final called compaq and ask them to walk me through getting it connected. I said I was seeing these black blobs and they said they would fix it for the price of a new laptop. So now I am out a brand new laptop (that I never got to use). I bought this from Amazon.Compaq Presario CQ62-410US 15.6-Inch Notebook I don't even want to give them the one star.", "Date": "August 27, 2011"}, {"Title": "Excelente", "Author": "Juan K", "ReviewID": "R2XGAB6JUT25CO", "Overall": "5.0", "Content": "Equipo se desempeña muy bien, no ha fallado para nada, excelente resolucion de pantalla, recomendado para cualquier uso que se le quiera dar", "Date": "December 16, 2012"}, {"Title": "Great for someone who wants the basics.", "Author": "GamerBoy", "ReviewID": "R3D2ERSVFKYBJN", "Overall": "4.0", "Content": "In general this laptop gets things done at a basic rate. The start up time is quite fast, and the internet connects great anywhere in the house. As long as the computer is not used for heavy duty work requiring multiple programs running at once, anyone would love this computer. It also has a great webcam and a easy to use keyboard. I do not like the mouse-pad though so I had to get a wireless mouse. It just isn't comfortable to use like other laptops. I use a Dell Inspiron with an i-3 processor and 4gb of ram for my heavier duty work load where I can run multiple programs. So if you are looking for a laptop that requires heavy duty work or for going off to school, get another one. One that has at least an i3 processor, 4gb of ram, and 250gb hard drive. That's just the minimum. I recommend 6gb to 8gb of ram, 500gb to 1tb hard drive, and a i5 or i7 processor. I recommend this laptop to people who just run a couple processes at a time.", "Date": "September 16, 2012"}, {"Title": "Muy buena inversión, desde Venezuela", "Author": "jlpm1", "ReviewID": "R1SDDA6I3QFKA2", "Overall": "5.0", "Content": "Esta representó mi primera compra por internet desde Venezuela. Para empezar tengo que decir que fue una excelente inversión, la portatil trae todo lo que menciona la publicación y en mi caso, con todos sus accesorios y en perfectas condiciones. Lo único malo es que no trae camara web integrada ni conexión HDMi, pero de resto tiene una gran apariencia y cumple con las funciones indicadas. Como dicen algunos, pagas lo que obtienes. Tardo casi tres semanas en llegar a destino, tiempo record para compras de este tipo. Muy Recomendado.", "Date": "September 4, 2011"}, {"Title": "misinformed by Amazon BUT....", "Author": "R. Best", "ReviewID": "R26W1A3EPNF224", "Overall": "4.0", "Content": "This was on a special sale, and was delivered promptly. HOWEVER, when looking through specs I didn't see a web cam and so called up Amazon where the person I was talking to looked it up and said it had a web cam. Well when it arrived there was none on board. HOWEVER, the price was so good and the machine so nice that I decided to keep it and am happy with it.", "Date": "March 10, 2011"}, {"Title": "Like this laptop a lot except for glossy screen", "Author": "Marie Lamb", "ReviewID": "R22MIDABHAO2QM", "Overall": "4.0", "Content": "I am a low end computer user. Mostly do word processing, check e-mail and look at Internet. What bothers me is the glossy screen. It seems to cause eye fatigue after many hours of daily use. Anyone have a solution for what to do about the screen? Thanks", "Date": "February 18, 2011"}, {"Title": "junk", "Author": "Martin Jones", "ReviewID": "R1RM2IGX9G9CBR", "Overall": "1.0", "Content": "I didn't get what paid for I thought I would receive a laptop like the pics it 1gig of I was running slow didn't have a webcam like the pic the hard drive was bad I couldn't send it back because it went over seas it 300 dollars to ship and another 200.00 to fix it so you do the math all for some junk, dont buy from this guy", "Date": "April 27, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Celeron Processor 2.2GHz\n2GB DDR3 RAM\n250GB 7200RPM Hard Drive\n15.6-Inch Screen, GMA\nWindows 7 Home Premium, 4.5 hours Battery Life", "Name": "Compaq Presario CQ62-410US 15.6-Inch Notebook", "ImgURL": "http://ecx.images-amazon.com/images/I/41PSLw5Fm1L._SX300_.jpg", "ProductID": "B004G5ZUFK"}}