{"Reviews": [{"Title": "Excellent Value!!", "Author": "tao45", "ReviewID": "R3LAABNODAATQR", "Overall": "5.0", "Content": "From what i can tell this is the exact same model as the dm4-1160us except with a smaller hard drive.  That smaller hard drive should result in a $50 price reduction, but i picked this one up at Office Depot for $[...] after a $[...] mail in rebate.  Due to the unusually low price i was convinced something must be wrong with this computer, but it's awesome.  I've read complaints about the mousepad on the 1160... i'm not sure what they're referring to cause it's been perfectly fine for me, infact its been better than the asus, dell, and compaq laptops i've had in the past.If you're game player with heavy graphics needs you should pass on this model.  But if you're a business users or home user who wants a light, solidly built, good performing laptop with great battery life, then I'm sure you'll love this computer even at a $700 price tag.", "Date": "December 5, 2010"}, {"Title": "THE BEST PORTABLE LAPTOP FOR THE MONEY!", "Author": "FLOWERPOWER2016", "ReviewID": "RHYVOQ5F0OK7A", "Overall": "5.0", "Content": "Make sure to check the date of the reviews when you review this laptop or buy one. Many of the issues such as the touchpad and power button problem have been worked out and this little puppy is one refined piece of work.  its very nice loooking, very light yet very substantial and durable feeling. HP has upgraded many of its parts and such, like the way the hinges are and the use of almost all aluminum with laser engraved detail and this laptop is badass.  also, with laptops such as 13 you pay top dollar for lesser specs. the 1160 us comes  with the core i5 450, 4 gigs of ram, 500gb hdd at 7200 rpm(pay attention here-most at this price are around 320 hdd running at 5400 rpm. the dm4 1162 is only 320 gb and the 1060us is the i5 430 instead of the 450 like the 1160us has. also the 1160 has widi so you can wirelessly see ur coputer on ur hdtv- and you can forget about a fingerprint reader at this price point. this computer comes with one, and a nice little hp light up logo on the lid for a nice little touch.the 1160us also has bluetooth and protectsmart for is hard drive. it has a led backlit screen also. im not sure why the 1160us model seems to be on sale moreso than others bc it has more features than the others too. one model has a wimax card(4g) and u can get this laptop custom with ati graphics if you game which i wish i had bc now im gonna have to get a vidock 2 or something for gaming but at 629 bucks on sale (i got 200 bucks off at staples) you really realy cannot beat this deal. some of you are thinking that this isnt as good a deal as it looks on paper bc of how some of hps older laptops are made but they have seriously upgraded the look and feel of them to aluminum w/ engraving ( brushed aluminum at that) with a light up logo lid sexiness beastly laptop that you will be proud of-take my word for it- dont buy the dell 14r or any acer that you will get at this price- get this laptop and email [...] w/ a thank you later.", "Date": "February 15, 2011"}, {"Title": "Failed in 14 months, shortly after warranty expired", "Author": "Rob Johnson", "ReviewID": "R3CK820DD6E5HR", "Overall": "1.0", "Content": "I bought a similar model 14 months ago, the HP Pavilion dm4-1065dx. Like this model, it looks great and has many attractive features. But it is missing something critical: reliability. The USB ports stopped working the other day. After trying several remedies suggested on the HP web site, I spoke with an HP rep who said it seemed to be a hardware problem and offered to fix the problem for $255. Then if I wanted to extend the warranty another year, they would do so for an additional $100. This system is suddenly much more expensive than the original purchase price. It's now in the territory of a Mac Powerbook, which is more reliable and comes with better service, especially if an Apple store is nearby.Compounding the sudden loss of USB ports (essential for laptops these days), this laptop has several other reliability problems including a battery that no longer holds a charge more than an hour, a screen that sometimes flickers (apparently a loose connection somewhere), and sporadic failures to come out of sleep mode (requiring removing the battery and rebooting).No wonder HP is getting out of the laptop business.", "Date": "September 18, 2011"}], "ProductInfo": {"Price": "$699.99", "Features": "14.0-inch Diagonal High-Definition HP BrightView LED Display (1366 x 768)\nBrushed Aluminum Finish with the Stream Design in Argento\nIntel Core i5-450M Processor 2.40GHz with Turbo Boost Technology up to 2.66 GHz, Intel HD Graphics\n4GB DDR3 System Memory (2 DIMM) (expandable up to 8GB), 320GB 7200 rpm Hard Disk Drive, Genuine Windows 7 Home Premium (64-Bit)\nHP QuickWeb, HP MediaSmart, HP SimplePass with Integrated Fingerprint Reader, HP TrueVision Web Camera with Integrated Digital Microphone, SuperMulti 8X DVD±R/RW with Double Layer Support", "Name": "HP Pavilion DM4-1162US Entertainment Notebook PC Laptop 14.0-Inch Widescreen LED Display, Brushed Aluminum Finish, Intel Core i5-450M 2.40 GHz Processor with Turbo Boost Technology up to 2.66 GHz, 4 GB RAM, 320 GB HD, Windows 7 Home Premium, Up to 6.25 hours battery life", "ImgURL": "http://ecx.images-amazon.com/images/I/51YwnmD0NXL._SX300_.jpg", "ProductID": "B004E4WN7G"}}