{"Reviews": [{"Title": "Very Happy", "Author": "DanaLee7", "ReviewID": "RGOANMGPYL019", "Overall": "5.0", "Content": "We recently purchased a computer.  It runs great.  It was in great condition.  We are very happy with it.  It arrived in a good amount of time and the price was right.  I will be ordering from you again I'm sure.", "Date": "August 7, 2012"}, {"Title": "Great product!", "Author": "Misty", "ReviewID": "R32MC7UIB9D828", "Overall": "5.0", "Content": "Received exactly what was advertised.  The laptop runs great and has very minimal scratches on it.  It shipped fast and in good packaging.  I'm very satisfied with the purchase.", "Date": "March 12, 2013"}, {"Title": "Great deal!", "Author": "Amber", "ReviewID": "R2CFB4FHKBBDRX", "Overall": "5.0", "Content": "This was a great deal and I will be buying again for sure! This was the best deal I found on this computer.", "Date": "November 14, 2012"}, {"Title": "not so happy!!!", "Author": "nanatti", "ReviewID": "R15NQTLMZ212EP", "Overall": "1.0", "Content": "three weeks after ordering two dell latitued D531's for my elementary school kids, I finally received the laptops to only find out that despite the way they were advertised as 2GB RAM, they came with 896 MB of RAM, I am calling their office but the recording says they are not taking calls... What a rip off...", "Date": "May 24, 2013"}, {"Title": "I like this computer, happy that it has options I have never had before.", "Author": "Clifton", "ReviewID": "R3SYBMZKAZDI1F", "Overall": "5.0", "Content": "Just received yesterday, at this time I'm getting used to the computer, it has the memory I'm needing along with extras I have not had before in a computer. Looking to get used to having them and learning to use them to my advantage.", "Date": "November 6, 2013"}, {"Title": "Wow!!!!", "Author": "George Granger", "ReviewID": "R2XSUQYH2D4G9Y", "Overall": "5.0", "Content": "Incredible buy on a terrific computer. It looks and operates like it's brand new. So impressed that it came with Windows 7 as well as Microsoft Office 2007.", "Date": "April 17, 2013"}, {"Title": "satisfied", "Author": "editing", "ReviewID": "R2H112EQZZBNLD", "Overall": "4.0", "Content": "Its been doing good was disappointed when I found out there were no Microsoft Words program install on the laptop", "Date": "March 11, 2013"}, {"Title": "laptop", "Author": "steve", "ReviewID": "R2B44MDMMPTUB1", "Overall": "4.0", "Content": "nice BIG screen.Very good condition overall.Battery doesnt seem to last very long, but kinda expected.Would NOT play DVD's untill i purchased a Plug in program of some kind On-line for $15  but works good now.", "Date": "March 2, 2013"}, {"Title": "Used Dell D531 Latitude Laptop", "Author": "Kenneth M. Moss", "ReviewID": "RPR5O1ZZ1NPV3", "Overall": "5.0", "Content": "This came with Windows 7 loaded. After a couple hundred updates everything is operating smoothly. Could'nt be happier with this purchase. Vendor shipped very quickly.", "Date": "December 24, 2013"}, {"Title": "Laptop Review", "Author": "Maryiah", "ReviewID": "R1PVQY4I2A039K", "Overall": "5.0", "Content": "My son uses this thing constantly he loves it and it is perfect for his age. We purchased it as a birthday gift for him, and it took a little while longer getting to us than it was supposed to but when I brought this to the companys attention, they were very prompt in their response and it was sent out the next day. It is a great purchase and my son really enjoys it! :)", "Date": "December 9, 2013"}, {"Title": "Review for reconditioned Dell laptop", "Author": "Robin Wagner", "ReviewID": "R2U3UXA8RQFRWK", "Overall": "4.0", "Content": "Solid laptop, decent performance--I use it at work and at home. Arrived in good condition and was easy to set up and downloads were fine, too.  Would definitely buy from this seller again!", "Date": "November 20, 2013"}, {"Title": "For casual use", "Author": "marlo Noonan", "ReviewID": "RCRM25ERIPHBN", "Overall": "4.0", "Content": "We ordered 2 for our middle schoolers to use for homework & web searching and for that reason alone they are good.  They were both pretty beat up and came with power cord--which was great considering the battery life is limited. We will have to replace the batteries at some point because they don't hold much charge.  Neither one came with any disks (as was shown in pic) but they did have Microsoft Office 7.Generally speaking we got what we paid for.", "Date": "August 13, 2013"}, {"Title": "too small", "Author": "Smilon", "ReviewID": "R1QGUX9SA279LZ", "Overall": "2.0", "Content": "It does not fit my dell laptop.otherwise it is well made.check size and order next size bigger no mailing label included for return.", "Date": "August 15, 2013"}, {"Title": "Older model but it works.", "Author": "joe larson", "ReviewID": "R3SH8GSDLCIQ39", "Overall": "4.0", "Content": "As a person who is still on a budget because of the economy, this was a suitable option and price range for my purpose. Of course the battery is useless, i knew it would be, but I'll just replace it when i can. Mine came with windows vista business, so long as it had windows i was happy.This product is working fine so far, it's an older model so it may need to have some newer drivers installed to operate the new plug and play products like optical mouses, but but my printer booted up fine with no driver disk needed.The seller answered my questions promptly, i would purchase from this seller again.", "Date": "April 23, 2013"}, {"Title": "Got a refurbished one", "Author": "Dominique", "ReviewID": "R13J1BU5VXBVJ7", "Overall": "3.0", "Content": "I've had this for about three years. The first year - I watched a lot of videos and listened to a lot of music, and it worked like a charm. It was super fast. Enjoyed it so much!After about a year, it started lagging on webpages. Two years - it heats up over opening more than one or two tabs on Chrome. Forget watching 10+ minute videos. And don't even think about adding a webcam - so much lag. The battery will hardly last an hour when unplugged now. It used to last 3 or 4 hours.SUMMARY:-Fast loading/web surfing for about a year-Alright speed after 1.5 years-After 2 years, best use is for word documents and minimal web-surfing. Can handle a video after it's been off a while.WHO DO I RECOMMEND THIS FOR?-I recommend this computer to people who have a designated spot for it (it's a bit heavy - I would never carry it around), and would like something to send emails, use word documents, simple programs like MS Paint, and watch a short video every now and then. Anyone who intends to use this computer for more than 2 hours at a time will probably be frustrated with its speed after owning it for 2 years.OVERALL:I enjoyed using it for music and videos while it was new. I still like it, but I mostly use it to type up word documents (luckily, I'm a writer. Otherwise, this computer wouldn't have gotten much use after its performance shot down), check my email, and look at a couple webpages. I use the family computer to do pretty much all of my web surfing now. Three stars!", "Date": "May 26, 2014"}, {"Title": "Meh", "Author": "Jesse strange", "ReviewID": "R18XVQSTAWPMV9", "Overall": "1.0", "Content": "It arrived quickly and you can use it to surf the web and download pictures and such but, the description lead me to believe that i could watch movies and burn dvd's along with cd's and so far i haven't been able to do any of that which was a big part of wanting a laptop in the first place. I suppose i should have spent the extra $100 or so and got a better newer laptop, i just heard bad things about windows 8 and wanted an older version laptop. I'm not a computer wiz but i thought i could trust the description.", "Date": "April 30, 2014"}, {"Title": "Nice Transaction", "Author": "CCC \"CJC\"", "ReviewID": "R1H7IUOIURR3PU", "Overall": "5.0", "Content": "Not only is this computer fantastic for the price....the customer service was outstanding.  It was missing some memory and they fixed it right away.  I would definitely buy form this seller again!  Thank you.", "Date": "April 22, 2014"}, {"Title": "Dell Laptop", "Author": "cowbaby55", "ReviewID": "R8K4TXQXAT2TB", "Overall": "5.0", "Content": "This laptop was worth the wait. Everything that our Grand daughter needs.If you want a laptop for a beginner this is the one.So I highly recommend this.", "Date": "March 17, 2014"}, {"Title": "good but have had to replace battery and supply cord twice in a year", "Author": "J Oliver", "ReviewID": "R1MQP03VKUREE2", "Overall": "4.0", "Content": "I bought this computer just over a year ago and while it is a great laptop (secondary) I've had to replace the battery and power supply twice in a year and it will not play videos from youtube or other sites. It still does a good job but if I'd realized how often I'd have to replace stuff I probably would have paid a little more and got something a little better.", "Date": "March 5, 2014"}, {"Title": "laptop was hard to figure certain things out.", "Author": "Kimberly Nance", "ReviewID": "R134RQ3CCQSEHB", "Overall": "2.0", "Content": "I purchased this laptop for a Christmas present for my son and it was very difficult for him or myself to use. Would have been better if it came with instructions or how to access the instructions through the internet. Sent back.", "Date": "February 8, 2014"}, {"Title": "check the dates", "Author": "rob lamberson", "ReviewID": "R21F497HYYK2EF", "Overall": "3.0", "Content": "the lap tops are okay but one thing that was upsetting is that the laptops are almost ten years old they need alot of updates other then that they are okay and run great", "Date": "January 7, 2014"}, {"Title": "Wonderful Laptop", "Author": "virginia", "ReviewID": "R2F56CR1IJGOWC", "Overall": "5.0", "Content": "Fantastic Deal,, Laptop looks and more importantly, works like new, fast shipping, Enjoy the built in Wifi : )  I also went ahead and purchased a new battery from you after I got the laptop and seen what such great shape it was in,, I thought why not go ahead and invest in a new battery,, glad I did, I plan to take it on trips, I will buy from you again,, Thank You", "Date": "January 7, 2014"}, {"Title": "Waiting to see?", "Author": "Chubby Hubby", "ReviewID": "R3IBJYVAXI68L6", "Overall": "2.0", "Content": "Alright guys, I just ordered this laptop for my son so he will stay off my computer! I have a Dell for my work and they do a pretty good job so we will see whats up with this used unit. As along as this thing is not a P.O.S and works like expressed by the seller I am fine with some minor wear and tear.Thanks and we will keep you posted:-)Respectfully, Chubby Hubby", "Date": "September 20, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "AMD DUAL CORE TL-56 1.8GHZ, 2GB DDR2, 80GB HDD\nWIN XP, DVD-R/CD-RW\nATI RADEON XPRESS 1270\n14\" 1280 X 800 dpi Resolution", "Name": "DELL Latitude D531 Laptop with 2.0GHz CPU, 2GB RAM, 80GB Hard Drive, DVD/CDRW Optical Drive, Built-In Wifi, and Windows Vista Business", "ImgURL": "http://ecx.images-amazon.com/images/I/51C5lS8VwjL._SX300_.jpg", "ProductID": "B004YWEL9Q"}}