{"Reviews": [{"Title": "not an authentic version of Windows 7---dont buy!", "Author": "DECEIV", "ReviewID": "RWO8XDVNCYJ0V", "Overall": "1.0", "Content": "After loading Microsoft Office Professional 2010 + Microsoft Security Essentials I began receiving messages from Microsoft that the version of Windows 7 was not authentic and that Security Essentials would shut down in 30 days in addition to automatic updates all failing. A little phrase above the time on the lower right of the screen appeared and stayed there: \"not an authentic version of Windows 7\". Since I had already loaded MS office professional 2010(a very expensive program)I was forced to buy an authentic version of Windows 7-and load the authentic product key- BRINGING THE TOTAL COST TO WELL OVER $400.Over a month later this PC is full of qwirks.DONT BUY FROM DISHONEST SELLERS LIKE THESE PEOPLECOMMUNICATIONS WITH THE SELLER REVEALED THAT HE IS BARELY LITERATE.The Amazon claim process is 99.9% automated and individual issues are not well addressed.I would not want to return a pc after I loaded MS office and was forced to buy an authentic version of Windows 7. That would be returning a much more valuable product than the one I bought.I requested a refund for the authentic version of Windows 7. The automated return process is not set up for specific requests and only offered a return.ABSOLUTELY NOT WORTH IT!!!!", "Date": "June 6, 2012"}, {"Title": "Great Laptop", "Author": "skatkat", "ReviewID": "R1QGWGEXANWU7U", "Overall": "4.0", "Content": "Maybe not for the power gamer but,great laptop for the adverage user. Purchased this laptop feb 2011 factory refurbed for $275 with the standard 6 month warranty given refurbs. Have had no problems. has web mike but no cam. Can always clamp one on. Must replace the battery now, but wait, That's 18 months of daily use on a 17\"er. Not bad at all. To the reviewer who gave this item a one star. Sounds like your problem was with the seller trying to pull a fast one. Sorry to hear.", "Date": "November 8, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004E2NK7K"}}