{"Reviews": [{"Title": "A near perfect laptop", "Author": "DarkSideMilk \"-Come to the DarkSide we have c...", "ReviewID": "R3HS4R1BX09Y5F", "Overall": "5.0", "Content": "This laptop has everything you could possibly want as far as tech specs. You got a sandybridge i5, 4 gb of fast ddr3 ram, USB 3.0 slot, hdmi out with hd codec ausio outputs for home theater systems. And the price is a steal of a deal. I got it at 666.02. The price on this thing certainly fluctuates on amazon so patience and a watchful eye on this one will probably get you the best price.Before going to my in depth rants here's a quick sum up for those that don't want to read the whole thingSo to sum it upThe i5 2410M 2.3 ghz with turbo boost to 2.9 ghz and HD 3000 graphics performs well in games and everything else, all at the same time tooThe 4 GB DDR3 1333 does its job while leaving room to upgradeIt has all the desirable features I was looking for such as- 7200 RPM HDD- USB 3.0- i5 sandy bridge- spill proof keyboard- 720P webcam- Great battery life (though I haven't been able to really test that)- Light weight- Win 7 Pro- Num pad keypad- Bluetooth- Wireless N- gigabit ethernet- Light weightIt is amazing, you should buy it. I found most laptops have the same basic specs with 4 gb ram and a i series cpu with a 320-750 Gb 5400 rpm HDD, 15.6\" screen, keyboard with keypad, and a built in webcam. Then each brand has there own extras and quirks, like toshiba never seems to have gigabit ethernet it's always 10/100. Asus likes to only have a 640x480 webcam, though they also have a accidental 1 year warranty with their laptops. Those are just a few examples I saw when searching for a laptop. This one is a sneaky little fella out of the main line of hp's consumer lappys that has all that you could want at a more than fair price. I highly recommend itNow for some semi-organized scatter brained rant of a hopefully informative review...The Sandy bridge i5 2410M is awesome. Not sure what the other guy is truly talking about as far as lacking integrated graphics. I do realize that a high end dedicated card will do better but the sandy bridge with the HD 3000 graphics is by far the most impressive on board graphics I have ever seen. For example I have tried running basic games on other laptops with them struggling to run at 640 x 480 with all settings at low. This thing can smoothly run Crysis on medium graphics. I am not a hardcore pc gamer so I haven't tested every game ever but the a few of the ones I have tried mostly just to see how it does are Crysis, Portal 1, Bulletstorm (demo), Half life 2 episode 1, Bioshock 1 & 2, & Mafia 2 (demo). All of which run smoothly at low to medium graphics and look amazing. Mafia 2 is one that runs at the lowest settings and still looks great, of course that game recommends a quad core processor and a high end video card or 2 to run at high settings so with that in mind running it at all is impressive. As well I do light editing for photos that works smoothly, not photoshop or anything of that sort though. As well I watch movies, it plays netflix hd beautifully, though that's not that hard. I have played some 1080p videos out the hdmi that are gorgeous. The windows sound settings claim that the hdmi audio out support all the current HD audio formats. DTS HD Master audio, Dolby Digital Plus, Dolby True HD etc. This shows when it's hooked up to my Home Theater Receiver. Sadly I don't have a way to test this because it doesn't come with a program that supports that output. Which is a slight disappointment considering it comes with arcsoft TMT 3. But the digital audio codecs are disabled in the program which makes that player useless. Though the DVD editing software in that bundle isn't so useless.As far as this glorious cpu's speed and power, it is just straight up awesome. Being the techy geek I am I monitor the speed and temps using Speccy. It ranges from 800 mhz per core at idle use to the advertised 2.9 ghz but that's only one core at a time, the other is usually around 2.6-2.7 when the other is at 2.9. Under my normal workload, which is relatively heavy and involves lots of multi-tasking. it boosts to 2.6-2.7 at temps of 60-70 Celsius. Which at first sounded high to me but that's just where these things run. The cool part about that is even when it is 70 Celsius or more in there you don't feel the heat. And of course the 4 gb (single dimm [stick]) 1333 DDR3 ram certainly helps with all that fun stuff as well.Also in the performance category is the 7200 rpm Hard drive. I have found that this is hard to find in main stream laptops in this price range. The majority have 5400 rpm. Trust me when I say that the 7200 makes a difference. And the 500 gb is of course plenty of space.There are of course other fun features such as the 720p webcam, the usb 3.0 slot, the \"Spill resistant\" keyboard, which I have not and will not test. The keyboard itself is very nice. It has the num keyapd and the buttons press smoothly. The mouse pad takes a bit of getting used to with the multi finger gestures for scrolling and such. But you can play with plenty of settings to turn that on or off and customize it and such. And the fact that it has win 7 PRO instead of just home premium is also a big plus.The bluetooth 3.0 is also great. I have a Bluetooth mouse that connected easily and I continue to have the joy of a wireless and recieverless mouse. I have also synced my phone with the Bluetooth to sync it with outlook and put music on it and the like.The Wireless connection is great. If I had to give a con it's that it only supports 150 mbps. Since it is a combo adapter with the Bluetooth replacing it would lose the Bluetooth. I actually tried putting a intel ultimate n adapter in it, only to find that HP has a very restrictive bios, so be careful when buying upgrades, cross check with hps's site. But I also discovered in that process that the under belly is very easy to get to via the maintenance slider thingy. Can't remember the technical term at the moment, but it has a tool-less entry system to all the user upgradable parts that is next to the battery. Back to the wireless though, regardless of that 150n instead of the more standard 300n it still has a great connection. It also only supports 2.4 ghz, kinda makes me sad to not be able to use the 5 ghz 300 mbps connection from my router but it's a small sacrifice for a constant great signal anywhere in the house or office. I work in a basement office with the router not in optimal position for that and still get a ~70 mbps connection that runs smooth. It speeds test just as fast if not faster than other 300 mbps computers on my network as well. So the wireless connectivity is awesome.The screen is also beautiful, and the speakers are impressive for what they are. It's certainly not audiophile status but it works for quiet music and such.This laptop also is very light weight, barely feels like it adds any weight to my backpack.Also it's shiny and silver. I didn't actually know what color it would be when I got it since there weren't any good pictures, hence why I added some. It looks like there is a better stock picture now though. I'm not one to care about finger prints on the finish but if you do care this one doesn't have that problem.There is a bunch of bloatware, but that is expected with hp type brand computers. Though it isn't all useless. The security program powered by digital persona gives a user friendly set up for the finger print scanner and the face recognition. When using the scanner and face recognition it adds like 10-20 seconds to start up time, which is a bit annoying so I don't use it anymore, but I'm not currently in a environment where heavy security is necessary. When I take it to college in the fall that might change. It also includes drive encryption features, something called evernote, and the arcsoft media suite. It's update software is also nice for the average consumer though I'm still a fan of checking their website manually myself. But the bloatware isn't too hard to get rid of so it's not that big of a deal. I personally have got rid of most of it, but to some it may be useful and worth keeping. Like the other guy said you will also have quite a bit of windows update to get, but that is to be expected with any new computer.So it is all in all practically perfect. The only things I would change is the 150 mbps to a dual band 450 mbps. Thought that was just at first when I found out it only had 150 mbps. Now I don't care so much since it works amazing the way it already is. I highly recommend this laptop or its little brother with the i3-2310M that has just about all the same features.", "Date": "June 11, 2011"}, {"Title": "hp 4530s", "Author": "Mike Phillips", "ReviewID": "RWE8I24PN7DEB", "Overall": "4.0", "Content": "This laptop has all the features that anyone would practically need. The price keeps dropping so any newcomers will definitely benefit from its lowered cost.The only reason I didn't give it the full 5 star treatment were several reasons.cons first1. No instruction manual, download the  HP 4530s pdf ONLINE, I Goggled it.2. No Win 7 Pro Repair disk, available separately for $10 on Amazon or eBay.3. Download Win 7 Pro updates from Microsoft, many and timely but necessary.4. UPS delivered, arrived OK but packing was almost non-existent in a large box. The HP box had enough packing though, so the laptop seemed protected.5. Be prepared for a lot of garbage which can be removed.positives next1. After running setup which was timely, I was impressed with the numerous features and add-ons that came with this model. I compared this HP with several other makes and this laptop excels against similari5-2410s.2. Value for monies paid will surely increase buyers interests obviously.3. This Sandy Bridge make all the previous i5s pale in comparison. My recommendation is to get the i5 with its turbo boost and never look back.4. The newly listed price from Circuit City/Amazon is fantastic for a \"Sandy Bridge\" i5 laptop.5. The unit seems sturdy enough.6. I like the ease of upgrading the laptop. Flip it over, remove the bottom plates and you can get to the RAM, HDD, etc quite handily.7. The HD+ screen was quite a bonus for these old eyes.8. The offset touchpad was OK.9. The Cap lite is a necessity for me and this unit has one.20. The Intel video with its turbo boost on shared video is supposed to really make a difference, as told to me by a friend who swears by it. We shall see.Overall, I'm looking forward to video editing and doing Photoshop, which were my main reasons on getting this HP.  As to its reliability, time will tell.Footnote, June 7.Runs quite cool and very quiet. No problems so far. May need to get a Vi Dock 4, or better; to boost my integrated video. Seems that the onboard video is a bit lacking and adding an Ati card via the expresscard slot should solve that problem.Footnote, June 15.Discovered HP Documentation earlier when investigating Programs and the PDF was very informative. (Wish there was a note inside the box upon opening)Onboard HD Video is very good for intermediate gaming and video editing. The Crucial 4GB RAM which I added today will handle my multitasking needs quite nicely. Buying and installing the Crucial RAM was most inexpensive method for any upgrade and easy. My PhotoShop and Illustrator applications plus my Sony Suite will benefit highly with this increased RAM.", "Date": "May 19, 2011"}, {"Title": "great laptop for actual work, terrible integrated software", "Author": "binkt", "ReviewID": "RMQTN9KUQDR0D", "Overall": "4.0", "Content": "This is a very thoughtfully engineered and full featured business oriented laptop. Some positive features that set it apart from other second generation sandy bridge core i5 laptops in this price range:An express card 34 slot for high bandwidth peripheralsAn excellent keyboard with numeric padA matte screen finish (thank you!)A generously sized, sensitive and configurable multi-touch trackpad from synaptics with a on/off switchVery easily accessible components and fan ducts to keep dust bunnies under controlThis unit purchased from Amazon comes with a 1 year warranty.After using it for some time, I have some other observations... There are no OS rescue disks included or the ability to burn them yourself. Booting to the OS recovery partition is the only way to restore the computer to the factory state. Needless to say, it is a useless option when your hard disk dies. Also, the image eats up around 16GB! This is totally unacceptable. It was not helpful when swapping in an SSD.The included software is comprised of \"special\" offer trials for office 2011 and norton internet security, adware, bloated \"maintenance\" programs, and a \"security\" suite that poorly duplicates functionality already included with windows 7. There is no unified uninstall for these programs and with the exception of the included Arcsoft media suite and hp power management utility, the only useful function of the included software is to lull the user into a false sense of security. HP, please stop! Expect to spend about 3 hours removing these useless packages.Without the hindrance of the included bloatware and with an SSD equipped, this laptop becomes the weapon of choice for people who like to get some work done on the road. It is sturdy and pleasant to use, with understated design for buttons and non-distracting illumination. The LED back-lit screen has poor resolution (1366x768 ? please.), but is otherwise high-quality. Finally, I cannot say good enough things about the keyboard! Overall, I am very happy with my purchase and I think that you will be too.", "Date": "June 20, 2011"}, {"Title": "Nice laptop", "Author": "Katie", "ReviewID": "R2M61FXP4F4VX4", "Overall": "4.0", "Content": "I've had this laptop for about six months now.  I'm reasonably happy with the laptop itself.  I use it for word processing, spreadsheet, downloading photos and editing, and on-line games.  Just routine stuff.  The Windows 7 software takes a little getting used to.  There's a game that my kids like to play where you walk by pressing the directional keys.  If you're walking a long distance and holding the key down for awhile, the computer seems to think that you're telling it that you want it to do something and the game is then messed up.  (I'm convinced that this is my computer's fault, not the game's.)  This is my first experience with W7.", "Date": "May 20, 2012"}, {"Title": "Solid machine, Excellent value...", "Author": "J. M. Barbera \"jimbarbera\"", "ReviewID": "RYXEUS6U166Q0", "Overall": "5.0", "Content": "We've had this machine for a couple of weeks now and it's an excellent performer.  Excellent feature set for the money it's really hard to beat.  The ProBook line is oriented towards heavy daily use while still being reasonably priced.  Core i5-2410M processor, 500GB 7200 RPM drive, 4GB RAM, Win7 Pro 64 bit, Webcam, SD card reader, Gigabit LAN, wireless N.  Plus it's got a solid feel.  The display is nice and bright and very clear, but I wish it had more pixels.  1366 x 768 is really limiting so figure on plugging this into a larger monitor for extended home use.  A BluRay drive would have been nice too.It seems that all store bought machines are loaded with trial versions of a lot of different software.  It gets annoying until you get it all out of your way.  I guess that's how they get the cost down.  There was a Microsoft Office shortcut on the desktop.  I entered the serial number from my store bought Office package and it all just worked.  Never had to insert the disk.If you're in the market for a machine in the $650 - $750 range, I'd definitely recommend this one.  You're not out a whole bunch of money but it still feels as though it should hold up for 5 years or so.NOTE: I ordered this from one of the third party suppliers and they shipped me the i3 version poorly packed in a beat up box.  I returned it and ordered one from Amazon and got the correct one in a nice straight box.  Cost me $90 more but it was worth it.  Regardless of who you get it from, check it to be sure you got an i5.  I'm still waiting for my refund.UPDATE: Upgraded rating from 4 to 5 stars.  Yes I had a couple of minor gripes, but at this price point, it's a stellar deal.UPDATE II: Finally received the refund for the i3 machine I returned.  The merchant was Portable Guy and they were responsive to emails and courteous.  They took the time to explain what caused the shipping error.  I'd consider giving them another shot.", "Date": "September 7, 2011"}, {"Title": "Great Laptop", "Author": "anknight", "ReviewID": "R196G4D047GFPG", "Overall": "5.0", "Content": "I love this laptop.  It is fast, the keyboard feels nice, the screen quality is good and I love the number pad.  I don't have any complaints yet!", "Date": "July 20, 2011"}, {"Title": "HP Probook 4530s XU018UT", "Author": "Shaker", "ReviewID": "R1IVHV3H8P1NEE", "Overall": "5.0", "Content": "This laptop was purchased by me for my nephew who was beginning his graduate studies. I understand from him that it is an excellent laptop with everything he wanted.", "Date": "September 19, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B004RCUIM2"}}