{"Reviews": [{"Title": "Great Laptop for the price.", "Author": "Amazon Customer", "ReviewID": "R1NKWIM0RKD125", "Overall": "5.0", "Content": "I received this laptop early today. It came packed to the point that it was a chore to take everything out, which was great since my product had no chance to mess up while in transit. Although I have only received this laptop today, I can already see that I love it.Pros:-The sound is truly wonderful. I played youtube songs on my laptop, and no matter how high, or how low I put it, it sounded crisp and clear. The DYNAUDIO works excellent. It makes you feel like you are really in a game, or if watching a movie, just sounds amazing.-Keyboard. The keyboard is excellent. The keys are nicely spaced apart, making it simple to type. It also comes with a keypad, which is excellent since there are many laptops of this size that don't have one.-The turbo fan works wonders. I played a game for around an hour, and unlike my old laptop that would get really hot after 20 minutes of playing, this laptop stayed cool throughout the entire hour. Although some people say the fan is loud, I could barely hear it while playing my game, and with headphones on, you won't even know it's on.-The Cinema Pro is amazing. It makes the colors sharper, more crisp. It really makes the movies, games, pages that you are looking at pop out. It is just absolutely beautiful.-The software on this game is great, as is the video card. I played L4D2, with all my settings maxed out. The game play was smooth, with not one hitch nor lag nor frame freeze. I loaded almost instantly into each new level, when it would take me a few minutes with my old laptop. The images are much nicer, the resolution amazing.-The keys are marked with arrows. You can tell it's a gaming laptop by how the red arrows point forward, backward, left, and right. It makes it much easier to find and use the buttons for moving about in the game.I haven't been able to thoroughly go and look through the entire laptop, so I will update this review once I do.Cons:-No instruction manual. Although many of you think no big deal, you will be surprised how difficult it is to navigate this laptop. Although the laptop does come with some papers explaining what the buttons are, they don't really go into detail on everything. So you have to figure it out as you go. And even if you have time to just press every button and see what it does, the same thing can't be said for everyone else. I prefer to start up windows, do the new software updates, and go.-The mouse pad is iffy. Mine is very touchy. If I touch it lightly, it will sometimes jump around the screen. Other times if I don't press hard enough it won't move. I solved this problem by using my wireless mouse. You can get a $15 wireless mouse and your problem will be solved. It doesn't bother me in the least.-I am personally having trouble with the text on my laptop. It is very small, and I've looked everywhere and I can't figure out how to change it. The laptop is hard if you are a beginner just for the fact that it has so many things going on in such a small packaged. So if you are really interested in this laptop, I would read up on laptops, and on MSi's just so you have a chance.Other then these small issues, I absolutely love this laptop. I happily forked over 1500 bucks for this baby. It does everything I was looking for, plus more. The features on this laptop exceeded my every expectation, as it will yours. If you are looking for a laptop with many features that really work, and amazing graphics at a decent price, this is the one for you.", "Date": "September 7, 2011"}, {"Title": "Happy with this purchase.", "Author": "Kevin S. Grail", "ReviewID": "R2JOQVWH9M7MAW", "Overall": "4.0", "Content": "I needed a laptop on which to do video editing. My old machine could not handle the work at all.  This machine has all the power needed, and a large enough screen to see what I'm doing. There is so much RAM that my machine generally runs with 6 GB used at all times, but with only 20% of CPU usage. Awesome.Other reviews said the keyboard was not good. Wrong.  The keyboard is very nice, solid and quite.There are two things that I don't like: 1)  The keyboard is not backlit. I would greatly prefer a backlit keyboard. 2)  There is no light indicating if the caps light is on. 3)  There is no light indicating when the power cord is plugged in.In summary, it could be better in some small features, but it's got it where it counts.", "Date": "October 21, 2012"}, {"Title": "Not bad at all", "Author": "J. Kaeble", "ReviewID": "RFVT8P7K4X3Q7", "Overall": "5.0", "Content": "I needed something more portable as I work 3rd shift security, so thought it would be good to have a laptop with me.  This is actually the best laptop I have ever owned.  It plays every game that I throw at it with no problems.  Plenty of ram, graphics ect ect.  When I go home, I hook it up in my room to my 37\" Flat tv and watch netflix or crackle movies via HDMI connector.  The only thing that got me was it was a little expensive (for me)  I know that's not the fault of the seller.  I just wish Game laptops were a bit cheaper. I was willing to pay the extra cash so that I could have a decent video card though :)  No complaints, Meets and Exceeds Expectations.  Thanks MSI.. Will be using you again for all of my laptop needs.  Screw the Alienhead!", "Date": "January 4, 2012"}, {"Title": "do not buy this laptop!!", "Author": "Shiva Annamalai \"khandesh\"", "ReviewID": "RTJZMD37RBZ5P", "Overall": "1.0", "Content": "This laptop absolutely sucks.  Within 2 weeks of buying it / using it, it gave up and threw in the towel.I fire it up and play for about 5 minutes and get some fuzzy lines and then the display cuts out. Backlight is still on, just a black screen. So I reboot- no screen at post. Then I think that maybe I didnt seat the mxm cards correctly/or needed to clean the contacts. Did that and fired it up while it was apart, got post. Turned it off, put it back together, no post. Took it apart again, searched google. I then noticed the the caps light was on, and the num and scroll were flashing. Followed a random response on google and reseated my ram. Post again, and again. Anyway, I'll be playing skyrim and my fans will kick up and fuzzy lines will come up lightly at first then really intense then stop completely. Sometimes when the fans are barely spinning.", "Date": "November 20, 2011"}, {"Title": "bad bad !!!!!!!!!!!!!!!!!!!!!!!", "Author": "leo", "ReviewID": "R3GXODHFBP4XOK", "Overall": "1.0", "Content": "trust me ,if u wanna buy a game computer, go for G73.''' is the worst computer ever !!!!!!!!!'It takes 5mins to start the Windows, and now i can't even log in .THIS IS''''''''''''''''''''''''''''''''''''''','''''''''''.", "Date": "September 4, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core i7-2630QM Processor Genuine Windows 7 Home Premium 64bit 15.6\"\n12GB DDR3\n1TB,     DVD Super Multi\n15.6\",     NVIDIA Geforce GTX570M\nWindows 7 Home Premium 64-Bit", "Name": "MSI GT683DXR-423US 15.6-Inch Gaming Laptop - Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41JDldypluL._SX300_.jpg", "ProductID": "B005F3TMWE"}}