{"Reviews": [{"Title": "Very Happy", "Author": "Matt T", "ReviewID": "RORVPTNISA6JT", "Overall": "5.0", "Content": "I'm extremely pleased with this purchase and would recommend looking for a gaming / high performance laptop.  I've been using the Asus G74sx-A1 literally as a laptop.  When I purchased it I was concerned about its size and weight, however after many 5+ hour sessions I'm still comfortable with the notebook on my lap and the mouse on the arm rest of my sofa.****Disclaimer****I'm using a OCZ Vertex 3 120gb SSD as the boot drive.******************Pro -* Performance is perfect for the applications I run: World of Warcraft(settings high-ultra), VMware running multiple guest machines, minecraft, starcraft 2 (settings ultra)and adobe products.* The LCD screen itself has vibrant colors* Fans are silent! Heat is almost non-existent anywhere on the laptop aside from what the vents are blowing out.* Keyboard layout is comfortable, the back-lit keys are a nice touch.* Installing upgrades is so easy.  The access panel on the underside of the laptop is simple to open(all you need is either a flat head screwdriver or a coin).  Components are laid out well and are easy to reach / access.* Running Linux Mint and Back Track with no issues.Cons -* Keyboard performance, at times key presses are missed.  It might be the way I hit the keys or a driver issue.  I'm currently using the atk 1.10 driver.  ***Bios Update 202 has fixed all keyboard performance(missed key strokes) issues I had**** Speaker sound quality is fine but the overall volume seems to be a bit low.A SSD in my opinion is a fantastic upgrade for most systems.  Money well spent.In the next week I'll be installing SolidWorks to test out some 3D CAD action.If you have any questions please feel free to ask, I'll do my best to respond in a reasonable amount of time.", "Date": "July 29, 2011"}, {"Title": "The best notebook I've bought yet!", "Author": "WolfPup", "ReviewID": "R220M7U0HELDOP", "Overall": "5.0", "Content": "First off, I want to mention that while the G74 is kind of marketed as good for games, don't let that scare you off if you're just looking for a quality, high end notebook for other uses.  The system doesn't look flashy or anything, and being good at running games just means it's good at running anything else you can throw at it too.I get a little technical in some places here, so please feel free to ask if you've got any questions!  I'm kind of trying to answer all the questions that I had about it before I bought it.In no particular order:-the G74's keyboard is one of the best I've used on a notebook.  It LOOKS similar to my Macbook Air's keyboard, but the feel of the keys is better-they're less \"mushy\" and have more travel.  By notebook standards it's quite good, and it also feels more solid than most notebooks.I love having a number pad, though should mention that for some reason it's not a \"true\" number pad.  Like on a desktop keyboard, the numberpad is actually completely separate keys, while on the G74, the numbers are duplicates of the numbers above your keyboard.  Most of the time that makes no difference, though it does mean you there's no number lock on the keyboard to turn the numberpad into arrows and the like.  (It does have almost full sized arrow keys in between the numberpad and regular keyboard, and also has typical page up/page down buttons, etc., and of course normal keyboards work like normal when plugged in to it.)-The screen is way above average by notebook standards.  The only fault I can find is it does have some light bleed when the system first boots before Windows loads, though I haven't noticed it once the system's booted.  Contrast and viewing angles and the like are way above average (Anandtech's reviews of the G73 have shown it having the best contrast of any notebook screen).  I'd rather have a \"matte\" screen than glossy, but 99% of notebooks are \"glossy\" now, and it works fine.  (I should note about half of my use of the system is hooked up to a 24\" monitor through an HDMI to DVI adapter, using an external keyboard and mouse).-The system is advertised as having an excellent cooling system, and it really seems to.  When you're just browsing the web or anything it's very quite, though what's impressive is that it doesn't really get much louder under full load.  I think under load it's the quietest notebook I've ever used (much quieter than my Macbook Air or previous Asus N80).  Dell's M15x is the only comparable system I've used when it comes to how cool it keeps the CPU and GPU when running Folding @ Home on them, which maxes out both 100%.  Although it's not as strenuous as Folding @ Home, right now I'm playing Call of Duty: Modern Warfare 2 on it just to make sure it does okay, and it seems to hold the GPU to the upper 50s or lower 60s, and the CPU just slightly warmer than that.  That's easily 20 degrees c cooler than the other notebooks I've used, despite the G74 having higher end hardware it's having to cool.Intel's i7 processors overclock themselves when needed, if they're running cool enough, and impressively, even maxing out 8 threads of Folding at Home, the CPU kept itself overclocked to 2.5GHz the entire time, which is WAY better than I was expecting.-Running Modern Warfare 2, I'm able to max out all settings at 1920x1080, and seem to get average frame rates in the 80-90 frames per second range (probably dipping in to the 60s and going as high as 115+).  That's with everything set to max except antialiasing off (I never see the point to it at such high resolutions, though I did play with it on, which seems to reduce frame rates by maybe an average of 10-30fps, which is still excellent, though I can't tell any difference in the graphics at that resolution).  It almost always looks silky smooth.I should mention that 1920x1080 is over 2.5x higher resolution than the game consoles can run this at.  While they can OUTPUT at 1080p, they're actually RENDERING at 720p or below and scaling, and of course have lower quality effects settings, lower quality textures, etc.-As per above, I'm very happy with Nvidia's Geforce GTX 560.  It's 15% faster than the 460 model in the G73 this computer replaced.  Nvidia does have two GPUs that are faster than this, but still, this definitely gets the job done with room to spare.  I should note that the Best Buy model of the G74 has a slightly \"crippled\" version of this GPU, with a 128-bit memory interface instead of the full 192-bit interface that the more expensive versions of the system ship with.  (From everything I've read, that \"crippled\" version is still excellent for the price.)-Sound through the headphone jack is clean, with no hissing or anything.  That should be a given, but I've used more expensive notebooks than this that have bad hissing and crackling through the jack.  (The only way to hear crackling is if the microphone is cranked up.)-As advertised, it's very easy to access both the RAM, and hard drive bays on this system-technically you just need a coin or something to unscrew the bottom.  It comes with 3 of the 4 DIMM slots filled (12GB total).  Right now as a power user, I'm okay with 4GB in Windows 7, so 12GB is just complete overkill...but I'm not complaining!The only aspect of the design I don't like is that the second hard drive bay uses a ribbon/cable connector instead of plugging in to a fixed SATA connection, if that makes sense.  If I ever swap hard drives again, I'll just unplug the cable from the drive, and not also from the motherboard.-The system seemed to run fine as shipped, though I did do a clean install onto an Intel 320 series SSD that I bought, with my own copy of Windows 7.  If you plan on doing something like that, probably all you'll want to install in terms of drivers from Asus' site are the Ethernet driver, and the \"ATK\" driver (this is for the keyboard, to make the special function keys work, like volume up and down, screen brightness, etc.).  Oh, and of course I reinstalled Asus' Blu Ray playback program too.  Windows handled everything else just fine, and I got the video drivers from Nvidia.com......Speaking of which-one of the reasons I bought this system is it's one of the few on the market that DOESN'T use switchable graphics, and that DOES let you install Nvidia's normal video drivers, you don't have to use special modified ones from the manufacturer, that never get updated.I'm just running Nvidia.com's newest drivers for my OS and GPU, and they installed without incident, with no hacks or tricks or anything-they install just like if this were a desktop system.I also love that this DOESN'T use \"Optimus\" (switchable graphics).  Many notebooks are now using the integrated graphics built in to Intel's new CPUs as the GPU, and then through fancy driver tricks trying to use a real, separate GPU for things that need it.  At best, that hurts performance-you'd be stuck with the GPU having to basically send finished screen shots over the PCIe bus to the integrated graphics, which basically play it as a movie.  That's at BEST.  At worst, it hurts compatibility with games and other programs, introduces weird bugs, makes it harder to get driver updates, etc.Again, to be clear, the G74 DOESN'T do that-it just has a normal setup where the integrated graphics are NOT used, and the Geforce GTX 560 is what's connected directly to the monitor....which is a good thing.For \"normal\" programs like Microsoft Office and Open Office, Firefox, etc., it's lighting quick.  Fastest computer I've used, and really a joy to use.I personally find this very portable-it's not that much heavier than my 14\" notebook was, and I really don't find it any less portable than my 14\" Asus or 13\" Macbook Air.  The only \"problem\" isn't really a problem with it, it's just hard to find a case that it'll fit in easily.  I'm trying Targus' XL case next, which will hopefully get the job done.-Unfortunately, like virtually all notebooks now (even my Macbook Air) the G74 doesn't come with a clean OS disc like computers used to.  It does have a program on there that lets you make recovery discs, which took four DVD+RWs, and I think you should also be able to make recovery discs using Windows 7's built-in back up program (\"Create a system image\", and \"Create a system repair disc\").  I made all those discs, but didn't actually use them, since I had a copy of Windows 7 Pro I bought for it.So...I'm really happy with this.  It's pretty much perfect if you're looking for a pretty high end, yet not too pricy notebook.  You can get even more powerful, but you may end up spending 2x the price, or more even.  The more expensive models I looked at from other companies had other things I didn't like-like some used Optimus, others didn't let you use Nvidia's normal video drivers, etc., so...I really think this is one to consider!", "Date": "September 16, 2011"}, {"Title": "Major Flaw Ruins Otherwise Impressive Laptop", "Author": "P. Shopper \"Practical Shopper\"", "ReviewID": "R2HAPAJ3JEXDEQ", "Overall": "2.0", "Content": "I was so excited to get this laptop. The specs on it were incredible. I got it and sure enough, it was super fast. After a while I started noticing weird keyboard issues and worse, sporadic activity with the touchpad. I typically use an external mouse at home so it didn't get to be a big deal. But then I had to start taking it to school, to meetings, other places where I just wanted to use the stupid touchpad without it lurching all over the screen. I figured this would be a simple update.Boy was I wrong. As I began to read through the ASUS forums, seeing comments from hundreds of other users with the exact same problems and no fix available, I began to get that sinking feeling in your stomach that you get when you realize you've just spent a ton of money on a lemon. BIOS updates don't work, driver updates actually made the problem worse.. When I discovered that ASUS has known about this issue for over a year and has not only failed to address it but continues to ship the laptop, I was furious.I don't mind going through a little hassle to update some software components, but when yo have hundreds of complaints of hardware issues right out of the box it begins to wound the reputation of the manufacturer - in this case, ASUS. I've always been a huge fan of ASUS. My last laptop was an ASUS, and despite the fact that all but two of the USB ports eventually failed, I was impressed enough that I decided to drop money I barely had on this nice new laptop. I'm supremely disappointed with the laptop and with ASUS's failure to address the issue.If you want to get this laptop, pray that you don't have the same problems that thousands of others are having with the keyboard, numpad key (which his laptop doesn't have - it has a calculator button instead), and worst of all, the trackpad. Some people report they don't have these problems. Thousands report they do. All of the good things in this laptop are eclipsed by this very serious basic hardware failure.If you do buy this laptop, test it out for two days without getting too invested in it. If you start having any problems with the trackpad - the cursor lurching over the screen, the cursor freezing up, etc etc, return it immediately. Don't think you're going to get it fixed through some easy software tweak.", "Date": "October 21, 2011"}, {"Title": "Great Laptop", "Author": "Kdpsnake", "ReviewID": "R32O0P1MGKOQHW", "Overall": "5.0", "Content": "Love this laptop so far.  Yeah it does come with a good amount of bloatware but as long as you know what you're doing its a quick fix.  The computer is amazingly fast much better than my G73SW I had recently purchased.  It runs silent and has easy access panels to provide quick access for upgrades.  The computer runs games like Crysis and The Witcher 2 without batting an eye.  Blu Ray drive is also always nice to have.  The touchpad almost appears to have a film over top of it but i think thats just how it is designed.  Overall loving the product, just make sure you send the warranty information in for the Accidental Coverage as soon as you get it.  Tech support can leave alot to be desired as they don't genuinely seem interested in helping you and it is easy to see you are talking to someone from overseas although they would leave you believe they aren't.  Otherwise 5 star laptop.", "Date": "July 20, 2011"}, {"Title": "Top of the line laptop", "Author": "Richard Bazemore", "ReviewID": "R3RLMCXYO1P1RT", "Overall": "5.0", "Content": "I purchased this computer about a month ago, and waited to write a review so i could get to know it better. I will say right now, i love this laptop, it can run just about everything with the graphics maxed like a breeze. The only exception to this that i have found is Shattered Horizon which i purchased from steam for $5, now $20. The game is a very intense outer space FPS, so the physics are so advanced and taxing on your processor that i had to stick to normal settings. The game is still absolutely fantastic you really don't notice a difference in the levels of graphics anyways. I don't know why i see reviews about a poor wireless card, i own a terrible router, it's a good 8 years old by now, and i can still play massive games of Starcraft 2 online with \"Ultra\" graphics settings on everything.I have used this computer for hours on end and not felt any heat on the keyboard, around the trackpad where i rest my wrists while i'm typing, or up on the speakers (placed between the top of the keyboard and the monitor). There is slight warmth coming from the fans in the back, but that is being pushed away from me, and i don't ever feel it so i don't care. The backlit keyboard is nice for some late-night gaming as well.The backpack this computer came with is very nice, and i usually use it to carry around the computer (duh), power cable, mouse, mousepad, and external hard drive for transferring data and backup. It's a little rough putting the computer in the bag because the fans in the back make it so much bigger, but it's not a problem, and it wouldn't fit at all in other 17\" computer bags, which is probably why it came with this bag. The mouse as well, is awesome, it has three more buttons than the standard mouse, one on top that toggles 5 different sensitivities, which is helpful when switching from many different things at once, and two on the side that you can program to do what you like. When on the internet, they are forward and back buttons, and in gaming, whatever is most convenient.The only complaint i have about this laptop is that both of the hard drives are split in half, so the computer reads that i have four 375 gig drives instead of two 750 gig drives. Other than that, this laptop is perfect.", "Date": "August 7, 2011"}, {"Title": "Me and my ASUS....go lots of PLACES", "Author": "got99problemz", "ReviewID": "RBFRX6TTGC0N5", "Overall": "4.0", "Content": "***2 year update*** This machine has easily been one of the best purchases I've ever made. Its traveled countless miles with me while being used between 4 to 6 hours daily week days and 8 to 10 hours on weekends. Not a single issue has shown its face, and in fact the one major flaw which was with the key strokes seems to have been fixed either by firmware, BIOS update or keystroke use. It still handles current titles pretty well on medium and high settings. When I first purchased this rig it was whisper quite even under the most demanding load (of 2011) and temps where low but now 2yrs later with more demanding software I'm finally hearing the fans powering up to full when I play Far Cry 2 on high settings at 35 to 40 fps. Battle Field 4 squeaks by at 30 fps on medium settings. I'm still amazed at this machine and I'm now in the process of shopping for a new system to take me into the next era of gaming....first thing that comes to mind because of this baby is buying Asus. I've got my eye on the G75-JH which looks juicy with the 780m ripe for my over-clocking expertise...just waiting for the price point to hit the sweet spot.**Below is my initial review. This laptop now sells for about $700 and would make the perfect first PC for a teen or college student on the go at its current price point.Well it's been 2 months since I've received my ASUS G74SX-A1. I decided to wait to write this review so I could get a good feel for the laptop and rate its performance.*First topic I'll discuss is the quality of construction. This is an overall well-built machine...hefty at +9Lbs. The housing for the lid is a rubbery composite over plastic, etched with the ROG logo and Chrome ASUS lettering. The bottom housing is plastic with rubber lining the palm rest area, an aesthetic machine finish molding around the Chiclet keypad and more chrome ascents surrounding the rear vents. This laptop is subtly striking in appearance, and although it won't get the eww's and ahh's of say an Alienware, it will get you noticed at your next LAN party and save you $$$.*Second topic, hardware. The screen is a well-constructed glossy 17\"LED backlit 1920x1080(native)/60 Hz resolution with viewing angles that extend over 2 feet any direction before picture fading. This monitor is definitely best served in a dark location for movie playback or low gamma gaming. The keyboard....although it has been stream lined by embedding alternate functions to the `F' keys and sculpted with Chiclet style keys, this is still one thing that ASUS really botched on this rig. There is a lot less flex to it than the MSI equivalent but it does have a seriously poor response to key strokes, most notably the spacebar. I have never had to use the backspace key so much. I believe there is only one response sensor under each key, even the larger ones, so you have to strike them at vertical angle to get them to respond especially if you are `light fingered'. If you pound away like me you'll be fine except for the spacebar which only responds to striking it at a 1\" location in its overall 4\" length... however, as Riddick would say \"find the sweet spot\" leave your thumb there and you'll be ok during those long typing sessions. Also, ASUS opted to include a full numeric key pad. A nice addition but why on earth they neglected to include a `numlock' is a mystery. Perhaps in a firmware update they will assign it as a ghost alt/function with another key. The keypad is backlit with a soft white glow. This feature is not customizable with multi colors like MSI or Alien rigs but doesn't affect performance at all.  The built-in finger pad is large and performed well during web browsing or simple navigation tasks, stick to the included ROG mouse for movement intense applications. At its core the i7 2630QM 2Ghz processors burn through logic functions assisted with the stock 12gb/1333hz RAM. Just a note to those who intend to upgrade this system for more performance in the future, the 2630QM cannot handle RAM pipe greater than 1333hz so don't go throwing the latest 1666 or 1866 in it or you'll be watching the Smurf porn channel allot aka `blue screen of death'. GPU processing is powered by an SLI capable, Direct X-11 Powered, NVidia GTX560M. This CPU/GPU combo scored P2220 out of the box in 3DMark11 benchmarking making it a very strong candidate for the best pound for pound game rig (cost to performance). The built in speakers are hard to hear compared to other systems. Most of the sound seems to escape through the rear cooling vents rather than being directed toward the user. Plan on using a good set of headphones or external speakers to fully enjoy the sound potential provided by this rigs strong 3D audio capability. The dual 750 GB SATA drives are silent assassins and have performed perfectly to date. Large applications load into RAM in the blink of an eye and I personally have never seen windows boot and load so fast. I honestly wouldn't bother with a SSD drive after seeing how fast data moves in this beast, but if you're used to being spoiled go ahead and have an SSD installed as your boot drive and it will seem as though things load before you even click...so don't blink. I opted for the Blue-Ray disk drive which I love. HD playback is phenomenal and with its HDMI video output and NVidia 3D Processing software all you need is a 3D capable TV or viewing device and it's like having iMAX anywhere. The G74SX has all the usually bells and whistles with (1)3.0 and (2)2.0 USB ports, mutli-card port, Ethernet,  WiFi built in, Blue-tooth, HDMI out, Monitor out, headphone/mic jacks, as well as a built in microphone and Web-cam. Oh and I almost forgot, upgrading is a piece of cake with the easy access panels provided on the bottom. Just remember BIOS is your friend so make sure your PC knows what you did to it.*Lastly, the big `P'. Performance is the main thing we all want in every aspect of life. As I said earlier, pound for pound this rig is among the best. MSI and ASUS benchmark almost identical with rigs both priced in the $1.6k range. While Alienware with all the extra frosting on it will run you almost a hefty $500 dollars more just for a logo and some pretty lights while performing just alike. \"Not true\" you say. Well, allow me to elaborate. My major thought behind buying a rig is to have a machine capable of going where I go, while still being able to run the applications my desktop could. I wanted what many want...a desktop with legs. So, next I had to ask what my budget was. Any normal individual, in my book, would not exceed $2k for a rig...unless of course the quality of the rig somehow affects your income like game designers, CAD techs and the like. If your one of them than have at it with a SLI590GX machine. For the rest of us avid to hardcore gamer types and heavy application users $2k will get the job done. Now comes the fun part, test drives. Yes, just like buying a car I like to use a rig first. I purchased an MSI, ASUS G74, DELL XPS and ALIENWARE x17 machine. I used a credit card with no interest on purchase for 30 days, so knowing this I ended up returning all but the ASUS after the 20 day mark and getting charged nothing for the opportunity to play with some of the top high end rigs. Note....I ordered all rigs with the best possible specs for performance while maintaining these key aspects. The rig must be atleast 1920x1080 native resolution, it must have a 17\"LED screen, it must have a DirectX-11 capable GPU, a minimum i-7 Intel Processor or equivalent AMD chipset, at least a 750GB hard drive, 8Gb ram and lastly Windows 7 Home Premium. Once all of these minimums where achieved, I used the remaining money to up performance features such as RAM, GPU and CPU chipset. When all was said and done with $2k spent per rig MSI and ASUS topped the performance charts. I was able to maintain 40+ FPS on some of my favorite titles like Far Cry 2, Crysis, Crysis 2, Witcher 2, and this was on the highest possible graphic configurations with Vsync disabled.  Alien's machine only pushed 30+, while Dell's XPS crawled home in the 20's. Mind you this was right outta the box, Once I installed MSI-Afterburner and tweaked the rigs I noticed that I had more headroom to push the ASUS and MSI rigs. Both rigs come stock running at about 62.4% percent of their potential. I pushed it up to 88% with some fine tuning and stably achieved 2640 to 2780 benchmarks on 3DMark11! Frame rates exploded to 60+ on Utlra settings. You simply can't beat that for $1.6k. Now, after I did some look at this....and look at that, I choose the ASUS over the MSI. But my heart really longed for an Alienware even though it couldn't top ASUS's rig with my budget. Just for the hell of it I decided to return the rig I ordered and got another one, this time I pumped up the budget. As it turns out I had to spend roughly $2300 to get an Alienware laptop that could benchmark high as or higher than the ASUS ROG machine. Funny thing is the Alien rig still had less HD space...less memory, although with a faster clock and only 1.5gb GPU(again faster clock) vs the 3.0gb GTX560m in the ASUS.  So, in my opinion, at the closing price of $1.6k the ASUS G74SX-A1 is the Manny Pacquiao of mobile machines.", "Date": "September 29, 2011"}, {"Title": "Enjoying the G74SX-A1", "Author": "dstrakele", "ReviewID": "R21RPFAQ8KSGZK", "Overall": "4.0", "Content": "Three weeks after purchase, I am still enjoying this laptop.  It arrived on schedule and was sufficiently boxed.  The ASUS box was packed inside an Amazon box with only a small amount of paper to prevent movement, but the ASUS box was well-packed and included the backpack (which helped cushion the 2nd ASUS interior box containing the laptop). The interior ASUS box had cardboard inserts that tightly cushioned the laptop and prevented any movement.  So the laptop is triple-boxed for all practical purposes.The larger 1920x1080 HD display is a big improvement over my previous laptop. It is also much faster, runs cooler and quieter, and has more resources. I've yet to stress the system anywhere near the stress test diagnostic program I ran.  CPU temperatures remained in the mid to high 60's centigrade while the GPU ran in the high 50's C - well below the 100+ C maximum operating temperatures of these chips. The fan noise is minimal during the stress test and mostly imperceptible during normal use. I also appreciate the subdued style of this system and backlit keyboard. I typically use the laptop in the dark with a 55\" LCD TV functioning as an extended desktop monitor.Audio is typical for a laptop.  Initially, volume was rather low and the speakers sounded very tinny.  This proved to be a problem with the Creative THX TruStudio settings.  When I upgraded this utility, the offending profile was removed and the sound quality and volume improved to average levels - very suitable for Skype.  I typically use headphones for music and superior audio can be had from the analog jack.I have no comments on battery life as I am using the system as a true desktop replacement - always plugged in.I initially had a problem with the touchpad moving the cursor when typing as reported by other reviewers, but resolved this issue by increasing the typing reactivation time - a configuration solution I found on the ASUS Republic Of Gamers G Series Notebooks online forum: [...]It's nice to have good technical support provided by this ASUS forum. There are several very knowledgeable folks (other users) who frequently post to help new users. An ASUS employee with the handle \"Chastity@ASUS\" is also very knowledgeable and does a great job as a customer advocate for users experiencing problems.On the con side, I would've liked RAID support, backlit touchpad buttons, an eSATA port, a larger battery, a smaller footprint, and less weight - but what can ya do? If you use Numpad shortcuts for games, you'll need to install the latest BIOS and keyboard drivers as discussed in the ASUS forum Sticky Thread as this system does not have a Numlock key and it is not enabled on a stock system. This design oversight is why I deducted a star from my rating, even though I don't use any Numpad shortcuts.**************************************************************10/29/2011 UPDATE: After about 7 weeks with this laptop, I'm still satisfied. From my experience on the Republic of Gamers G Series Notebook forum, I've found 2 things potential buyers of this system should know:1) Some units suffer from erratic touchpad cursor movement (some do not) - the cursor becomes uncontrollable and unwanted selections are made while using the touchpad. This behavior can be intermittent and not appear for several days.  This issue can occur on both Sentelic and Synaptic touchpads that are shipped with this system.  The issue appears to result from tape and adhesive being applied to the back of the touchpad during construction. It results in poor grounding of the touchpad.It appears the only resolution for this specific issue is to disassemble the laptop and remove the tape and adhesive from the back of the touchpad. Updating the touchpad driver does not appear to resolve this issue.IMPORTANT: If you notice this specific behavior after purchase, I recommend you immediately return the system and exchange it for one that does not exhibit this behavior. If you are too late for an exchange, you can try removing the tape and adhesive yourself (a relatively advanced DIY procedure requiring laptop disassembly - there is a good guide on the ROG G Series Notebook Forum), RMA the laptop to ASUS for repair, or farm the job out to a reputable, qualified shop.My G74SX-A1 Sentelic touchpad has not exhibited this behavior to date. I've updated the driver to version 9.1.7.7 and enjoy the smoother performance and new functionality it provides.  There is a \"3 Finger Straight Up\" gesture that switches the display into Aero 3D Flip Mode that I find useful, since I commonly have many windows open. Be aware that touchpad gestures on Windows 7 are more primitive than their counterparts on today's smartphones.  They don't work as smoothly and may require more than one attempt to work. I believe this is because Microsoft does not deem touchpad gestures to be important enough for the OS to work well with them. The Microsoft touchpad driver does not support gestures.The 9.1.7.7 driver also has a feature called \"ASUS SmartSense\". It will automatically disable the touchpad when you type. A circular area on the touchpad must be touched to reactivate the touchpad.  The reactivation area is configurable as to size and position on the touchpad, but I find the default to be effective.  It allows you to pause while typing and not inadvertently cause cursor movement with your palm. I find this a much better solution than the reactivation time setting on earlier Selentic drivers.If you choose to try this driver, first confirm your laptop has a Selentic touchpad.  The G74SX-A1 also ships with Synaptic touchpads.In Google, I have seen erratic touchpad cursor behavior reported on laptops from other manufacturers. In my opinion, it is a sign of the times with electronic gadgets, exchanging a gadget to get one that works without issues is becoming more common. I notice it is very common for smartphones to be exchanged multiple times. Some users have to exchange their phones 3 times or more to resolve a problem. Another example -I got my daughter an Apple iPod.  Three weeks later, it just quit working.  I had to exchange it.2) The stock driver for the Atheros Wireless LAN Adapter produces a lot of DPC Latency.  This can result in lagging performance in games, lagging keyboard performance, etc. It is very important to update the Atheros driver to version 9.2.1.432 or later to resolve this issue. I recommend downloading DPC Latency Checker to troubleshoot latency on your laptop. Other drivers can also result in latency, affecting your laptop's performance.OTHER NOTES: I updated the Realtek Audio driver on my laptop to version 2.66 and noticed Creative THX TruStudio now started with the \"Built-in Speakers\" setting that results in lower volume and poor audio quality. On a recommendation from the ROG G Series Notebook forum, I uninstalled THX TruStudio, and installed the free version of THX TruStudio Pro.  This version allowed my to configure it to start with the better \"External Speakers\" setting on boot.  In addition, it has a \"Crystallizer\" feature that restores dynamic range to music files.  I find this offers superior audio quality in headphones (particularly in the lower end of the audio spectrum) over the pre-installed THX TruStudio app.I've also had a chance to check battery performance.  I get about 1.5 to 2 hours on a fully-charged battery before the \"11% Remaining\" warning sounds during moderate use.  This is roughly what I expected from this laptop.", "Date": "September 29, 2011"}, {"Title": "ASUS G74Xs-A1 : Awesome  Sysem  & Customer service", "Author": "SG \"SG\"", "ReviewID": "R3L4CPKNB2NPD0", "Overall": "5.0", "Content": "I've been a Dell and lately HP laptop user for past 8 years or so.I was very, very skeptical about switching over or trying a new company whose headquarters wasn't in USA. Most, if not all, systems are manufactured overseas; however, i wanted headquarters here in USA in case i encountered serious customer service / warranty issues.I purchased this system the other day from a local retail ( out of box ). I did that intentionally because i didn't want to pay the restocking charge of 15% to return the system should i encountered any issues and wanted to return it.The system is simply amazing period. I did some comparisons with Alienware, HP, etc.. and for the $$$ this system simply beats rest. I don't know where you can get something this powerful, today for $1400---I'm not a gamer and I'm not purchasing the system to play games. I run multiple Operating Systems using VMware and I'm seriously into movies, divx encoding / decoding, rendering, etc...My number one concern after spec'ing the system out was customer services & support...~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~I thought ASUS would have lousy customer service since it was an overseas company.I thought I would be stuck with email support only, I was wrong...They have 365 / 24 / 7 phone support and they speak and understand English fluentlyI immediately called after configuring the systemI didn't have to wait at all, I was able to reach a support person immediatelyThe support person was:* very polite, professional, patient and courteous* knowledgeable & technical able to answer all questions I asked* If they didn't know answer they looked it up while I was on phone~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~That said, i'm going to return the system to the local retailer for following reasonsRetailer's price is too high, several hundred dollars more ( ~$300+ )Although local retailer said they would match the price, they seriously misinformedme about several other things, which is unacceptable..Local retailer told me following which isn't truea) ASUS offers one year ADP ( Accidental Damage Protection )b) ASUS offers one year warrantyc) retailer then tried to sale me in store warranty for $400~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~I contacted ASUS support and was told following:1) ADP is offered on systems purchased online only2) I confirmed that ASUS would honor systems purchased from Amazon3) ASUS will not honor nor offer ADP to any local retailer4) ASUS offers two year warranty as listed on feature sticker on laptop*) check lower right on palm rest ( should say 24 months )*) don't know why or how store nor ASUS could offer less when it's printedLocal retailers often reduce the two year warranty so customer will purchase extended warranty.Although the sticker says 24 months, ASUS will only offer 1 year on the system I purchased at local retailer. ( it's some agreement they have with store )So if I purchase system from Amazon, which I plan to do, I'll get following:1) Dead-On-Arrival Warranty - Immediately replacement with New2) No ZBD ( zero bright / dark pixel warranty ) no dead or defective pixels3) Two year manufacturer's warranty no additional cost4) Two year global warranty - not sure what that is5) One year ADP ( Accidental Damage Protection ) warrantyMust register before 30 days to get the ADPADP covers - spills, drops, breakage, etc... that isn't intentional or acts of GodI'm going to return the current system in couple of days and will most likely purchase same system from Amazon since it's better deal, plus ASUS appears to be offering special backpack that fits system for free...~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~So what did I learn:ASUS appears to have very good customer supportASUS appears to have very good quality system based on numerous reviews on webASUS offers better deals via online, than local retailersBased on various user reviews & reports on web, they like this laptop overall compared to:* Alienware* MSI GT780R* HP Envy any addition* Dell XPS any configuration", "Date": "November 11, 2011"}, {"Title": "A Silent Beast", "Author": "Ancient Rights", "ReviewID": "R2HZB3ZTVNYYIN", "Overall": "5.0", "Content": "I am absolutely impressed by the performance of this laptop. Let me start by saying that Amazon has one of the best prices out there for this laptop. I didn't actually purchase it from Amazon, though. Because of all of the horror stories I have heard about this laptop coming dead on arrival, the keyboard not responding, components simply not working, etc, I was hesitant to purchase from Amazon because their laptop return policy is just an 85% refund. To get your computer fixed you would have to send it off to the manufacturer. I purchased it from elsewhere with a better return policy where you just ship back the defunct computer and you are sent a new one. While it was a great insurance policy, it also cost me a price difference of about $100 for the price at a time. That is two new games for this beast to ingest that I missed.Out of the box Windows Experience Index:Processor:  7.4Memory (RAM):  7.6Graphics:  7.2Gaming Graphics:  7.2Primary Hard Disk:  5.9PROS: There are so many things I love about this laptop.- My favorite part of this laptop has been how cool it stays while doing anything. I have thrown just about everything I can at it to make it overheat. Fallout 3 and New Vegas with HD retextures, BFBC2, Civ 5, and pretty much everything I have on Steam. I ran Folding@Home GPU version and BFBC2 at the same time and it still performed well. During this time the surface of the laptop didn't increase in heat in any noticeable amount, and the actual GPUand CPU stayed around 130 degrees Fahrenheit/55 degrees Celsius the entire time. That was the IDLING temperature of my last laptop. The idling temperature of this laptop stays right around 95 degrees Fahrenheit/35 degrees Celsius. And all the while you cannot even hear the fans. (My room stays around 77 degrees Fahrenheit/25 degrees Celsius for a relative measure for what you may expect.)-The battery life is amazing. With the built in power management software I get up to 4 hours of literal laptop browsing that doesn't require the hard drive to be in spin. I get from 2 to 2.5 hours with the hard drive under moderate use, and 1.5 to 2 hours of battery life while gaming.- The keyboard is very nice. The keys have a nice coating on them that makes them comfortable, the backlit LED isn't too bright, the keys are well spaced and generally there is nothing wrong with it that I can find. I have heard about problems with missed keystrokes, but I have not met any as of yet, and I type at around 75 words per minute, so I would notice any annoying missed keys while typing. (I have not yet updated the drivers associated with the keyboard. I am typing with the out-of-the-box driver.) The only issue I have is that sometimes while holding a left or right arrow key to move through text it will stop moving.- The two 750GB 7200rpm hard drives are the Seagate ST9750420AS, so you have a protection against losing data in case you drop your laptop. The actual hard drives are partitioned into two pieces, so in your Computer screen it will appear as though you have four drives instead of two. I found this convenient because I moved all my games onto one drive so that I may read or write on the other in the background without having any loss in loading times. Also, the four partitions let me easily create a system image on the second HDD so that I won't be hampered too badly if the main drive crashes.- The small things. The rubberized coating on the area around the touchpad is very comfortable to the touch. The area around the keyboard is metal, not plastic. The screen hinge doesn't move around, even with gentle shakes. (I refuse to shake it hard. I am just going to place my trust in the hinge.)5 stars. The Pros far outweigh the cons.- The backpack and the gaming mouse it came with are great. My only complaint is that the mouse is not wireless, and the cord always seems to be in my way.CONS:- The speakers are sub par. They are quiet and when you turn them up they can become crackly and whine or pop. If you are in a quite room and using the speakers at around medium volume they sound quite nice, though. Just don't expect to use them in public and be able to hear anything.-The touchpad. As has been complained about, the touchpad is a bit annoying. While it is activated with default settings it will interrupt your typing a lot. It can be fixed by either turning off the touchpad completely or by reducing its sensitivity. However, that reduces its functionality if you are planning on using it. Go with the mouse that comes with it and you'll be fine.- The screen isn't as crisp as I would like. I am used to my 16.4\" 1080p screen on my other laptop, and of course upscaling the screen size is going to make each pixel a bit bigger. More of a personal note.- The 0 is below the 2 on the number pad. I don't like that. Just a personal thing.- Some have complained about the problem of the number pad being a clone of the number row, so you cannot bind things to them or use alt code characters. I don't bind enough things or use enough alt codes for this to matter to me, but if that is turning you off, there is now a patch to fix the issue.Overall, this is one amazing machine. The specs, the performance, the feel, the knowledge that you can use it as a weapon due to its weight(I love how heavy it is) to the manufacturer's warranty that lasts for a long time. I expect this laptop to be able to handle just about anything I can throw at it for quite a while and definitely recommend it to any who are trying to decide.If you don't mind losing a hard drive or the blu-ray drive, you can go to one of the less expensive models and get the exact same performance, but you lose the backpack and mouse, so beware.Five stars. The Pros far outweigh the Cons.", "Date": "September 20, 2011"}, {"Title": "Amazing Laptop", "Author": "Christopher Chavis", "ReviewID": "R2XSKORJKH0DEX", "Overall": "5.0", "Content": "I was very nervous about buying this machine based on some of the reviews.  However, I can't be happier with this purchase!  Most people will tell you this machine looks good, and I'll agree with that.  Most agree there are no heat issues and thats also true.  I spent about an hour playing Star Craft 2 (set on extreme graphics settings without a hitch) and the machine felt cool everywhere, and had a very slight hint of warmth on the bottom.. I used it on my lap.  The keyboard on this machine to me acts no diffrent than any other keyboard I've used.  There have been alot of complants about this topic with this line of laptops.. but I've had zero issues with it.  The mouse pad I can't review, as soon as the laptop fired up the first time I hit Function F9 to cut it off and it has stayed off on every start up since.  I use a gaming mouse so I cant review the touchpad.  I've heard people complain about the sound also, and to me its loud enough.  It's not going to give you ear bleeding loudness but I had a Bluray movie playing in it, in the living room with my wife and 7 year old and i could hear it just fine at 69%.  I did go into the THX settings and change it from internal speakrs to laptop, and it helped a little.The games I've played so far are Call of Duty: MW2, Starcraft II, World of Warcraft, Battlefield Bad Company 2.  I played COD and BFBC2 online and had no issues with the wireless card Ive heard people complain about, and all the games mentioned were at full graphics settings and Its all been smooth sailing.  This laptop is amazing machine.The Bluray picture was clear, the movie was loud enough... system runs cool I can't give you guys any real negative reason not to get this.  The Laptop bag is smaller for extra storage but plenty big for the laptop and its stuff.  I personally like it being more streamlined than bulky.  The mouse isn't bad at all either, I just prefer wireless so went that option.Ohh.. this thing is heavy, but doesnt feel that bad on my lap.. just pulling it up or out of its bag you notice it has some weight to it, I would say its what you would expect from the specs and reviews.Long Story Short, I can't duplicate or find any of the reasons people rated this a one star on the machine I bought, and I give it 5 stars.  I'll come back and edit this review if something comes up, but until then I have to rate this PC at its price a must buy for a gamer looking for one.", "Date": "September 15, 2011"}, {"Title": "Could not be happier", "Author": "Peter Kovalsky", "ReviewID": "R14UH4WISMFHZU", "Overall": "5.0", "Content": "I could not be happier with this purchase. The laptop is powerful as all get-out, runs cool and damn near silent, has its vents on the back (so you can set it on your lap or a soft/cloth surface and not block its cooling), and came almost entirely free of bloatware. It also came with a Targus backpack (since it can be hard to find good bags for computers this size) and a gaming mouse, which were nice bonuses, not to mention the fact that the computer just looks sexy as hell. As far as bang-for-buck goes, this thing can't be beat.There are a couple of very minor issues which are easily resolved, but may lead to a lot of frustration if you don't know where to look.First, though the full-size keyboard includes a numpad, it lacks a numlock key. The key that's in that spot just brings up the basic Windows calculator. The numpad can still be used to enter numbers; however, those keys are treated as identical to the regular number keys (above the qwerty row), which might be obnoxious if you're used to having lots of keybinding space in your games or if you like to use Alt+0000 codes. There is a BIOS flash available that will make numlock permanently on instead of permanently off; the numpad will work as before, but will register Alt+0000 codes and be able to be set as independent keybindings. Just google your exact model number and \"numlock bios flash\" and you should be good to go.Second, the media keys (play, stop, etc.) are implemented through Fn+<arrow key>, which would be fine if those combinations were at all configurable. Instead, using any of the media keys automatically launches the Windows media manager software, which I'm not a fan of. Apparently this is by design and has been a \"feature\" of Asus laptops for several generations; several years ago, a third-party utility appeared that would let you remap keyboard behavior on that level. I couldn't quite get it to work, myself, as it's somewhat out of date. But again, googling \"asus laptop media keys remap\" or similar should get you started, and you might have better luck than I did. My ultimate \"solution\" was to disable the Windows media center altogether (Start -> Control Panel -> Programs and Features, then the \"Windows features\" button on the left) and break the binding that way, freeing it up to be used elsewhere (in my case, Winamp).And finally, the trackpad can be a little picky if you haven't set it right. This also is an issue that seems to have persisted across a few generations of Asus laptops. The \"automatically disable trackpad when an external mouse is plugged in\" feature can be buggy and the trackpad can come back on on its own, even with a mouse plugged in; this isn't a big deal, since you can just toggle it with Fn+F9. A bigger issue is that when you're just using the trackpad, the cursor will sometimes freak out and start teleporting all over the screen, etc. I don't really know what causes this, but I suspect it results from a conflict between Windows' cursor speed setting and the trackpad's driver's own management of it. I haven't tested every possible combination of settings, but it seems that as long as the driver sensitivity is set to at least 1 point lower on the slider than the Windows pointer speed*, the problem doesn't arise at all.Aside from this, I have only good things to say.*In case it's unclear how to do/check this... go to Control Panel -> Hardware and Sound -> Mouse. In the \"Pointer Options\" tab, the top slider controls pointer speed (how quickly the pointer moves across the screen); this controls all of your pointing devices (trackpad and any mouse you plug in). In the \"Finger Sensing Pad\" tab, clicking \"Configure\" will take you to the settings for the trackpad itself; go to \"On-pad Functions\" and then to \"On-pad Curosr Speed\" [sic]. This slider controls how quickly the trackpad tries to move your pointer. Make sure this slider is set at least 1 point lower than the Pointer Options slider.", "Date": "November 9, 2011"}, {"Title": "love it! not for the weak or ignorant", "Author": "Chunli \"random splurges\"", "ReviewID": "R262Z39NADTAGR", "Overall": "5.0", "Content": "I've had this laptop for about 2 solid months so I decided to write a review.  This laptop is amazing! My counterpart and I both heavily researched laptops before deciding on purchasing this laptop and I have got to say, we made the right choice.  The laptop is flawless! I know a lot of people are crying about the keyboard but its not that it doesn't work, it is just a bit difference since the keys are spaced differently.  I've gone through many laptops and desktops so I know that keyboards, in general, tend to be a little different. It is nothing a little adjusting won't fix. Many of the bad reviews on Amazon for this laptop is misleading so please don't base your buying decision on them.  I mean, one guy is comparing a laptop to a desktop and crying about it, one guy reviewed the wrong laptop entirely, and well, another just doesn't like the keyboard.  I'm not sure about those guys but I researched the hell out of this thing since its $1,800.  I'm not so wealthy that I can spend almost 2k on something I know nothing about. I knew the keyboard would take getting used to and I knew it would be heavy as hell. Granted, the specs and design of the laptop semi masked the weight for me haha.  When I got the laptop and picked it up, I was surprised that it was so heavy haha. Yes yes, I knew it would be almost 10lb, I guess I was hoping I was strong enough to not let it get to me haha; do I regret it? NOT AT ALL! I'm a 5'3'' asian chick and I have no issues carrying it when I need to. It fits into the backpack well. The only con I have actually is the backpack.  Since it's summer, I wear a lot of tank tops and the backpack scratches.  The straps are made of a scratchy material so its not too comfortable. But hey, thats the backpack, not the laptop.  :)  I'll replace the backpack one day, but as of right now, its not too big a deal.  :)", "Date": "September 6, 2011"}, {"Title": "Lasts forever!", "Author": "Megan Arp", "ReviewID": "R1M49THXVWJ5W6", "Overall": "5.0", "Content": "I've had this laptop for nearly 2 years now and it's been fantastic. It's only ever had one issue, which occurred recently, with the DCIN port where the AC adapter goes. I'm still under warranty and the customer service at ASUS is being very helpful with the issue. This laptop itself is built like a beast, and has lasted 3 times as long as the other laptops my family has owned.", "Date": "November 7, 2013"}, {"Title": "Excellent performance.", "Author": "Eslam Elsayed", "ReviewID": "R1KAY3F0W595HT", "Overall": "5.0", "Content": "You get a lot for your money with this lap top... Its been working very good for me so far.  no problems.", "Date": "April 6, 2013"}, {"Title": "Not too bad", "Author": "christopher zubris", "ReviewID": "R24IT7WFM42LZW", "Overall": "3.0", "Content": "Graphically it has taken everything i've thrown at it up until recently. The biggest gripe is the awful firmware update system. It simply doesn't work.There are other minor ergo gripes. Power plug on the right hand side , not a big thing but its annoying when you're right handed and using an external mouse. Most thought out laptops will put the cable in the back or left hand side.Numeric 10 key pad. Awesome idea right?! Well for the longest time these buttons were mapped to the normal number keys along the top. Not a horrible thing if all you use the keypad for is numbers and data entry. But if you hit the numlock key ............. the windows calculator comes up???? I think this has been addressed finally with a firmware update but again updating the firmware hasn't been easy.", "Date": "December 16, 2013"}, {"Title": "More powerfull than most desktops", "Author": "Wavefunction", "ReviewID": "R37QDG1X97DAT2", "Overall": "5.0", "Content": "I bought this to prototype code in Matlab, C, C++, and CUDA.  It has proven to be a workhorse.  ASUS makes great products that are well priced.  The only thing one might consider as a drawback of this laptop (or similar models) is the size.  To be as powerful as it is, it is a monster.  It comes with a backpack, really just because it is nearly impossible to find one from other sources that can actually hold it.", "Date": "August 25, 2013"}, {"Title": "Awesome machine with three flaws", "Author": "i8beef", "ReviewID": "R3TFANMZ18BQIL", "Overall": "4.0", "Content": "This laptop is a beast in terms of performance. It runs most games I've thrown at it at full settings without an issue, and makes an excellent development machine... with three caveats.The keyboard is backlit, which is very nice for typing at night, but it seems to be less responsive than a good keyboard should be. My biggest issue tends to be function keys registering longer than they should, so when capitalizing a single letter, I tend to get the second letter capitalized as well. For example: This Is AN Example Of Typing PRetty Fast. For most people this probably won't crop up, but I am a developer and I type pretty fast... I have not found a way to get around this yet, and just have to be careful, which slows down my typing speed a little bit.Second, this screen could double as a rear view mirror... It's handy to see when your boss is sneaking up behind you or something, but annoying otherwise. Way to glossy. I find myself adjusting the angle quite frequently.The touchpad is absolutely unusable for me. It's shear size and sensitivity means that it often started moving things and clicking things while I was typing (as a developer, this is absolutely unacceptable, as it bounces the cursor around my text editors). Turning off all the \"features\" of the driver like two fingers swiping and all that crap helped a little, but it was still unusable. I have to use an external trackball, which is fine... except the touchpad driver doesn't always turn itself off like it is supposed to when an external mouse is connected, so it will randomly turn back on until I unplug my trackball and plug it back in... there's supposed to be a way to disable it in BIOS, which is what I'm about to do right now.The laptop is big, and very heavy. Like the weight of a brick heavy. I like that fact, but others who have dainty wrists might dislike it for that fact. It makes it a bit more cumbersome to lug around and take out, so the \"having to use a trackball\" complaint isn't too bad for me... it's just one more physical inconvenience and makes getting the laptop setup a bit more of a chore, but honestly, if you are going to be playing any games on this, you are probably going to want to be using an external mouse anyway.Oh, one bonus, the mouse that comes WITH the laptop actually isn't half bad... If not for the fact that I find a wireless Logitech trackball much more convenient, it's perfectly adequate.", "Date": "December 8, 2011"}, {"Title": "Super Awesome Sweet Action >>>>", "Author": "Astrofalcon", "ReviewID": "RSO7LTFOXITIV", "Overall": "5.0", "Content": "Bought this computer in order to work away from my home studio on location for a six week job I was offered. Was a little worried it wouldn't even compare to my 3.75ghz 12core XEON workstation... After installing 4 more gb of ram and a Intel 120gb SSD I was defiantly surprised at how fast and solid this computer is. So far it is hard to distinguish this awesome machine from my monster computer at home.I am primarily working with hi-end 3D graphics and HD composting in After Effects and Nuke among other application I use. I never thought I'd be able to do this kind of work on a laptop... but this computer proved me wrong.", "Date": "October 16, 2011"}, {"Title": "Excellent Gaming Laptop for the price", "Author": "D. Mcintyre", "ReviewID": "R2WHTGM76TNTU2", "Overall": "4.0", "Content": "Just purchased this laptop 3 days ago and have some initial impressions.  For the record, I have never come across the ideal Windows based laptop for everything without completely breaking the bank.  However, this laptop comes pretty close.  I have put it through some initial paces to see how it performs.  As a gaming machine, it works at high frame rates at full 1080p with older games from the last few years.  With some of the current games, you have to dial back graphic settings and play at 720p.The video playback did present some issues.  DVDs played with no problems, but Blu-ray is hit or miss.  Some movies like the Star Wars set would not play.  Not sure if this is a software issue with Cineplayer or a firmware issue with the drive.  I have been unable to find a solution.  The other issue with video is the aggressive use of edge enhancement and dynamic contrast.  You have to tweak the display settings for color, contrast and brightness to tune the display.  Some may like video enhancements, but I prefer to turn them off.The other issue is the sound.  It sounds too tiny, without much of a low end.  If only it had the sound quality of a Macbook Pro or a HP Envy, with would be near perfect.The last issue is with the track pad.  It is overly sensitive at times especially when I don't want it to be when I am using the keyboard.  But at times when I try to use the finger gestures like those found on Macs, it does not respond smoothly and consistently.  I'll try to scroll using the 2 finger gesture, and it will zoom in or out instead.  The track pad needs more work.Overall, this is a great laptop for gaming.  But I would recommend getting a decent pair of headphones or external speakers and use the supplied mouse or your own.  And realize that this is a desktop replacement with emphasis placed on performance over portability and battery life.  Better sound, stable blu-ray support and a redesigned touch pad would make this the perfect laptop.Pros:Great gaming performance for its price.Quiet operation even when cooling fans spinning.Nice Quickboot option directly into Chromium OS for internet surfing.Display is crisp, bright and works well with games and video.Cons:Sensitive and inconsistent trackpadSystem is heavy, not intended to be that portable.Blu-Ray movie play back in buggy.Sound lacks low end bass.", "Date": "October 13, 2011"}, {"Title": "Met Very High Expectations", "Author": "Ronnie Saturno", "ReviewID": "R508AAAD894HW", "Overall": "5.0", "Content": "I was prepared to buy a G73 before I discovered that the G74 was about to bce released. I waited for the various G74 models to become available among the various retailers. The G73 was damn near perfect but the G74 managed to improve in most significant areas. The keyboard layout on the G74 is a drastic improvement over the poorly conceived keyboard of the G73 as is the 3GB nVidia GTX 560M. The best in the business cooling system delivers as it always has ... I had a chanceto compare this particular model G74 at a certain electronics retailer side by side with an Alienware M17X. The Alienware was very hot to the touch on the right rear underside, I assume where the CPU was. The ASUS was cool to the touch everywhere around the machine. The screen looks outstanding. My main misgiving about this laptop was the removal of the subwoofer from the G73 to the G74. My biggest regret with my last laptop I bought three years ago (an HP DV7-1260us \"Entertainment Notebook\") was the awful sound from it's sans subwoofer speaker system. This ASUS certainly outperformed my old HP. My personal favorite \"ears test\" benchmark song is \"Summer Madness\" by Kool & The Gang. It sounded pretty good. Not great but certainly not bad. There is some bloatware, as should be expected, but it wasn't too bad of a chore to remove the worst of it. I initially had trouble connecting to my 5GHz 802.11n hidden-SSID connection in my house but I was able to quickly resolve it. Playing with the keyboard a couple of times in a store, I expected to really dislike typing on the keyboard but I am very pelasantly surprised to find typing on the low-profile keys rather nice. This hulking mammoth of a machine made my beloved Wenger Swiss Gear 17\" laptop bag useless, but the Targus ASUS ROG branded backpack is a nice bonus as is the ASUS ROG USB mouse. The backpack fits the laptop, mouse, huge power cord, my ASUS TF-101 Transformer with keyboard dock along with a few other odds and ends comfortably. This is definitely not a light or thin laptop, and you should be well aware of that fact before you click the ADD TO CART button. This is a ten pound behemoth that won't fit in most backpacks or laptop bags meant for 17.3\" laptops. I was very excited about buying this laptop, and every bit of that anticipation and excitement has been fulfilled since I have unboxed this computer. The price on Amazon is the best I have found among numerous retailers, and I did receive it the next day after paying only $3.99 for NEXT DAY SHIPPING. If you take this bad boy out in public, you will definitely stand out among the hippies with their Macbook Airs and Pros ... and I mean that in a GOOD way.", "Date": "October 5, 2011"}, {"Title": "Wonderful laptop with amazing graphics", "Author": "ValtheRed", "ReviewID": "RUQ7KVCPFJPDG", "Overall": "5.0", "Content": "This machine has to be seen to appreciate how clear the picture is on the display and how easy it is to work on for any length of time. The laptop was easy to set up and got me working quickly on a project for graduate school. The graphics are wonderful and Photoshop pictures look so good compared to a laptop that I purchased 2 years ago that it makes me smile just to think about how good the tech is on this baby! The only thing that was a little disappointing was that when I did a review of laptops, apparently ASUS isn't known for their customer service. So, just in case, I purchased a 3 year Square Trade Warranty to go along with this. I like this laptop very much and would definitely say to buy one if you can!", "Date": "September 25, 2011"}, {"Title": "It is very satisfying for Gamer like me", "Author": "cscspro", "ReviewID": "RZH1LWJG85I4U", "Overall": "5.0", "Content": "This laptop is up to 2011 September the best laptop I believe that is suitable for gaming. Some people say that there is problem with the keyboard and touch pad. Let me remind you that there is absolutely no problem even before you flash the ASUS live bios.Therefore, I recommend this laptop to any gamers who want to have a laptop with a desktop ability. This laptop is in this critics opinion, nothing less then the finest product in 2011.", "Date": "September 22, 2011"}, {"Title": "Great in nearly all respects", "Author": "Amazon Customer", "ReviewID": "RAKXLC547SZUS", "Overall": "5.0", "Content": "This is a beautiful machine.  Seriously.  Clean lines, bright and clear screen, it's understated unless you look under the hood.  Under the hood there is a monster that eats babies and spits acidic venom.  It's wildly powerful with consistently high frame rates.  It stays ridiculously cool.  My previous notebook, a Toshiba Qosmio, would get so hot that the metal in the usb ports would be painfully hot to the touch.  Even on Entertainment Mode, the middle performance level, the laptop remains actually cool to the touch.  Like cooler than the air around it.  It's just crazy.I have only two issues with the thing.  First, Asus loads the notebook with some of its own software.  Most of it is actually pretty nice, user-friendly stuff, though I think the kind of person that buys a notebook like this doesn't need that kind of help with display settings and so forth.  The updater, however, is horrible and freezes every time it's used.  Second, the speakers are really atrocious.  They're quiet and tinny.  A laptop this expensive should include speakers with at least marginal quality instead of these.  The speaker on my Droid X phone sounds better.  That isn't an exaggeration.  The notebook achieves better low notes but the phone deals with higher registers more cleanly while still doing an admirable job on the low and middle ranges.Four and a half stars but until Amazon lets us do half stars, I'll round this one up to five.", "Date": "September 6, 2011"}, {"Title": "Almost a Home-Run", "Author": "Scott \"echo4papa\"", "ReviewID": "R1S7Z1YGD5W8F3", "Overall": "5.0", "Content": "ASUS has done an amazing job with this laptop.  The build quality is spectacular.  I won't go into detail about the specs, because it has already been covered in other reviews, but this laptop screams right out of the box.  It also runs very cool and quiet.  In comparing it to my old Dell Inspiron 9300 (17\" laptop), it is slightly larger (and heavier), but runs much quieter and cooler than I imagined it would.  I had this on my lap \"shelf\" that I used with my Dell, and the bottom of the shelf (resting against my thighs) remained cool after 4-5 hours of use.  The Dell would heat up the entire shelf within 40 minutes.There are three things I wish ASUS had included:1) A SSD for the OS or replace both  HD's with Seagate Hybrid Drives2) eSATA port3) Better WiFi cardOf those three things, the SSD or Hybrid drives can be done at a reasonable cost (and still keep your overall cost at a decent price) and the wireless card can be replaced for under $30.None of that was enough for me to knock my rating down.  Be warned, if you use key bindings on the number pad for games, you might have some initial issues.  I know ASUS has made some changes to address that particular issue though, so I wouldn't let it prohibit my purchase.I also looked at the MSI laptop as well, but I just couldn't bring myself to terms with it's overall appearance.", "Date": "September 2, 2011"}, {"Title": "Very Durable", "Author": "Brandon", "ReviewID": "R5Q7YPKEUDM7O", "Overall": "5.0", "Content": "I work on a tugboat and many rough sea's have made this laptop go flying through the air and yet it has minimal damage. i give this 5 stars all around.", "Date": "February 27, 2014"}, {"Title": "Specs listed in Amazon selling web page (http://www.amazon.com/gp/pr) does not fully match with those contained in the computer.", "Author": "Victor M Vega-Villa", "ReviewID": "R2LH57MG4XH5BF", "Overall": "3.0", "Content": "The computer i did receive is indeed the Asus G74SX-1A (not A1 by the way) but, if you review the detailed list of specs at the bottom of the selling web page, it does not match with some important devices onboard the machine i received, for instance:1. Your web page says, \"RAM 12 GB DDR3\", and the machine has only 8 GB.2. Your web page says, \"Hard Drive 1500 GB SATA\", and the machine has, 1000 GB in two 500 GB hard drives3. Your web page says, \"Graphics Card Ram Size 3 GB\", and the machine has, 2GB of video RAM.4. Your web page says, \"Optical Drive Type BD Combo\", and the machine has,  a DVD burner only, not a Blue Ray reader/burner capable optic unit.Victor Vega", "Date": "January 9, 2014"}, {"Title": "Don't buy from ASUS unless you want to buy another computer in 2 years", "Author": "nathen upperman", "ReviewID": "R3BRV5LKXOE146", "Overall": "1.0", "Content": "I have a similar model, but the more expensive version, and I had a hard drive failure in 2 years 3 months, which is 3 months over the warranty. Asus wouldn't warranty or even look into the hd fault even after showing a linux analysis of the faulty sectors. They used Seagate 2- 750gb hds in mine. The power cord began to fail as well. The headphone jack also failed. For a $1700.00 laptop, I would have expected more service. The quality of Asus and customer support used to be awesome, but Asus has gotten to lax on their services. If you want a gaming system, don't buy from Asus. You will have a better chance with Alienware. I also just bought a laptop for my girlfriend and the DVD player on multiple units were slightly off center preventing the DVD player from ejecting correctly. They are no longer quality, just product pushers now.", "Date": "January 3, 2014"}, {"Title": "Another basic flaw in what should be a first rate system", "Author": "Amazon Customer", "ReviewID": "R2USE39N8736UI", "Overall": "1.0", "Content": "I bought a G74SX a year ago and I have had more problems with this computer than I have had with all the computers I have owned through the years.  The touchpad was my first issue. It required a trip to the service center to enable the \"disable touchpad\" function.  My latest issue is it's inability to connect to a 5Ghx home wireless network.  The built in network card is incapable of connecting.  Not just malfunctioning. Incapable.  By design.  I have an older HP laptop that connects seamlessly.  I naively assumed that considering the price for this laptop, it would be \"top of the line\" functionally  I would not buy again.", "Date": "March 18, 2013"}, {"Title": "FAST but a few issues yet", "Author": "Amytris Faus \"amytris faus\"", "ReviewID": "R3NHPZ6WHQEYAE", "Overall": "4.0", "Content": "This is to 'replace' A Gateway FX (which is great but using vista).It is almost intantaneous on downloads.It does run much cooler.It does seem a little bit lighter in weight, a bit.CON: the plug is situated at the right side rather than the back of the unit(this somehow caused the plug to become rotated in such a way it cut off battery charging and had to be 'tweaked')As always, the new tracking pad is difficult to get used to, having several 'tricks' i would rather not have,such as '2 finger flick' and so on.....will update later.One week later: Returned it.Colors were too crude, without enough adjustability.Sound was a hollow echo.tracking pad continued to be erratic.", "Date": "February 6, 2012"}, {"Title": "Excellent!", "Author": "Dan", "ReviewID": "R113671JI6K3DH", "Overall": "5.0", "Content": "This laptop is incredible.  It can run any program I throw at it without batting an eye.  The build quality is great too, very solid and nothing feels cheap.  As far as the most common complaints,  I have had no problem with the keyboard and I think the sound system is great (but I'm no connoisseur.)  The backpack and mouse that comes with this A1 package are great additions.  The mouse is O.K if you don't already have a \"gaming one\" but personally I'll stick with the g9x.I purchased this laptop instead of the MSI counterpart simply because I know that Asus products are historically reliable machines and they have comparatively great customer support.", "Date": "January 22, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00542SUD8"}}