{"Reviews": [{"Title": "good used laptop", "Author": "Bob Bender", "ReviewID": "R3W1C7JLQ8PHO6", "Overall": "5.0", "Content": "It is a good laptop for my uses at a good price, I would recomend this computer to anyone who needs a basic computer", "Date": "March 26, 2013"}, {"Title": "WOW!!!  I love my computer!", "Author": "Wendy Steiger", "ReviewID": "R1Y8H3CLHPJWG6", "Overall": "5.0", "Content": "I can't believe how fast my computer came.  I had it within a week of ordering.  I am so happy with it!  Everything works great.", "Date": "March 11, 2013"}, {"Title": "It works!", "Author": "garyznola", "ReviewID": "R1B6MUCQJB4N6N", "Overall": "5.0", "Content": "Of course this computer is no new or top of the line, but for the price it is a great value.  I bought this as a gift for my niece.  She wanted a laptop computer and even with the cost of laptops being so low I wasn't looking to spend $300 for a new one.  She will be using this for school to do research, type up papers etc and this will more that fit the bill for her needs.  The only extra I needed to buy for it was a network dongle and its all set.  I think she will like this gift.  I know I was impressed for what I got for the price.  Lets face it, it works!", "Date": "May 6, 2013"}, {"Title": "product performance", "Author": "angel", "ReviewID": "R18R7WQZ87O9P3", "Overall": "5.0", "Content": "works great I am very impressed .I am going to buy another one next month! for school and household I can not ask for more.", "Date": "May 5, 2013"}, {"Title": "Stolen copy of Microsoft operating system", "Author": "Cheryl Coates", "ReviewID": "RGL0EPZ7UKVRK", "Overall": "1.0", "Content": "After running updates to the laptop I was informed by Microsoft that the operating system was stolen.  The lap top will no longer work.", "Date": "March 7, 2014"}, {"Title": "Not great", "Author": "Sherry Bourne", "ReviewID": "R1P95F9NIPVXK8", "Overall": "3.0", "Content": "I had to take it to a computer shop to be worked on as soon as I got it.  I spent over $300 dollars to get it running good and able to connect to the internet.  It works really good now.  I would rate it a 4 now after the work.  I could have bought a new one for the money I have in this one refurbished one now.", "Date": "October 26, 2013"}, {"Title": "DID NOT WORK !!!", "Author": "DAVE", "ReviewID": "R2U9T0R05IVXNU", "Overall": "1.0", "Content": "Received pc before delivery day. When I turned it on it worked at that time. After a couple of times it stopped working completely.  Sent it back. Did not like at all. Will not buy from them again.  JO", "Date": "August 3, 2013"}, {"Title": "A positive company-", "Author": "Phillips B Carpenter", "ReviewID": "R1XVP0VGVITZ1F", "Overall": "5.0", "Content": "This was a used machine which I expected would be in fairly rough shape.  To my pleasant surprise, it was in pristine condition.  I have no complaints whatsoever.  There is no BS here.  All of their representations were accurate from condition of the product to when it would be delivered.  Go with this company.", "Date": "July 17, 2013"}, {"Title": "Dell Latitude D810 Centrino M 1.73GHz Laptop Computer,... Dell Computers", "Author": "Krystal Karen Hanson", "ReviewID": "R1OF5WCFM6ADM4", "Overall": "4.0", "Content": "We have three other computers in our home which we use for an in home business.  I bought this computer to have in my bedroom just for my personal use so the fact that it is slower and an older program makes no real difference to me.  I use it for writing, checking email and personal research.  It is very affordable and in my estimation perfect for student use.  It could even teach a youngster to be more resourceful and use this until they can buy their own expensive computer.  It really isn't that slow when you actually get signed in and started.Jeanne Wolfington.", "Date": "August 30, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005FMG1TC"}}