{"Reviews": [{"Title": "Great Affordable MacBook Alternative", "Author": "Dino", "ReviewID": "R3MCLB4XD4TAS0", "Overall": "5.0", "Content": "My goal was to find a PC that is equivalent or better compared to the internal parts of a MacBook Pro i5 2nd Gen, and this was the only computer I was able to snatch up during sale for $499 with such components, and in many cases better components. I wasn't expecting to be blown away, but I have been pleasantly surprised with this laptop.First of all, it looks great.  The glowing HP logo is reminiscent of the glowing Apple logo, and the brushed metal-type backing just makes it look that much better.  The keyboard and the surroundings are very clean, no additional unnecessary buttons and the keyboard is solid and easy to type on.  The trackpad has multifinger functionality for scrolling, pinching and rotating.  At first, the trackpad was hard to scroll on as my fingers did not glide, but eventually it broke in and it was easier.In terms of previous reviews saying that the software is terrible, that must be an exception.  This was a rare time for me to find a laptop with such little bloatware -- just Office and some HP games at most.  Usually I do a clean install of Windows when I buy a new computer, but with this one, it was unnecessary.  The i5 processor is very speedy, does not heat up a lot, and the fan is relatively quiet.  The battery is also decent, going around 5-6 hours on regular use.Overall, I think this is a great purchase for someone who would like a decent sturdy laptop for an affordable price and would enjoy telling their MacBook Pro friends how they paid $1000 less for a PC with better components :)", "Date": "July 31, 2011"}, {"Title": "Great laptop timely delivery", "Author": "ManliusSanta", "ReviewID": "RFE8V80A48KPV", "Overall": "5.0", "Content": "Got this laptop through Back2School Electronics.  The order was processed and delivered quickly.  Even though the seller did not send an email update when the order was shipped, the order arrived promptly and everything was fine.Laptop fired up quickly and performed well.  Tested the wifi connection (used internet from several locations) and the connection was very good.  The laptop did not drop the connection any time (this was mentioned by another reviewer as a potential problem).  There is no instruction on how to use the fingerprint reader (probably there is something somewhere on an online manual; yet to find it!).  Also worked the dvd player with a CD. Playback and sound quality are very good.Over 3+ hours of almost continuous use, the laptop remained very cool.  In fact, the fan did not come on for most part.  The laptop is very quiet and great to use during late evening!  The disk action LED is on the left side -- not very visible when you are using the laptop -- so it is hard to know whether the laptop is doing any disk access, unless you turn laptop and look to left side.  Key integrated indicator LEDs for wifi and speaker are great.  Laptop was surprisingly light weight.  Also the charger was very light (when compared to my 5-year old compaq laptop and its bulky charger).I am very happy with the laptop.  Also will recommend purchase from this seller.", "Date": "July 31, 2011"}, {"Title": "A Great Deal!", "Author": "Real food matters", "ReviewID": "R2S5AASTBCQOCY", "Overall": "5.0", "Content": "I got this laptop for college- it was the best deal I found for a laptop with equivalent specs. I love it! it is sturdy, the hinges don't wobble at all (something that endlessly bugged me with my last laptop), and is surprisingly light. the finger scanner feature took me a day or two to get used to, but once I got the hang of it, it turned out to be really convenient. the processor is fast and the keyboard doesn't have any annoying quirks- (like mushy keys. I hate mushy keys). The laptop looks and works exactly as I had hoped, and I am not disappointed with anything!I must mention that I have read reviews on Amazon and other websites that mention how frustrating the software can be on HPs. I have not experienced any issues relating to the version of OS HP installed. Then again, when I first got my laptop I had to delete a LOT of bloatware, and I also installed open source alternatives to most of the regular Windows software (at the time not for any particular reason other than I am more familiar with the open source programs).This laptop is perfect for college, but it is powerful and small enough to be a great personal laptop too- I am very glad I bought it!", "Date": "July 30, 2011"}, {"Title": "Was great to start, but durability is questionable", "Author": "Shawnee", "ReviewID": "R18YCENXSF92XT", "Overall": "3.0", "Content": "I bought this computer on sale through Staples about 1 to 1 1/2 years ago.  At first I absolutely loved it, and for the most part it is still a very good computer.  I really like the finger print security because it makes signing into a lot of things much easier and quicker and because I have client confidential material on my computer, so I don't have to worry about someone signing on my computer and being able to access that information.However, my last cheaper Acer laptop lasted 4+ years before finally giving out (the AC adapter port quit working and it was going to cost more to have it fixed than the computer was worth).  This computer after only a year or so has the following problems:1) The keyboard misses keystrokes at times, particularly the space bar.2) The letters on the keys have already worn off on several keys.3) The fingerprint scanner will sometimes just quit working and I will have to restart to make it work again, same goes for the touch pad.4) It is sometimes entering the wrong character when I hit a key, for example I will hit the letter 'W' and it will put in the number '8' so instead of 'what' I get '8hat'5) The USB ports do not always register something being plugged in, sometimes I have to unplug and replug to get it to register or plug it into a different USB port6) The SD card reader only works periodically, most of the time I have to use a USB adapter to read SD cardsI will say that my computers get a lot of use, we're talking several hours a day nearly every day, they also travel very frequently on long car rides and through airports.  I do however try to take good care of them with regular cleaning and a good padded travel case.So, all in all, its a decent computer.  However, if you're someone who uses a computer a lot don't expect great durability.  I will continue to use this laptop until it totally gives out, and for the price I paid it has been worth it...but I will probably try something different next time.", "Date": "January 15, 2013"}, {"Title": "Don't Buy This Laptop", "Author": "BarbaraG", "ReviewID": "R2MP1VXV5TIMSU", "Overall": "2.0", "Content": "Issues with the touchpad freezing which I cannot resolve anymore with reboot. Now I have to use an external mouse which means I can't use as meant to be. Makes it difficult to work at client sites where there is limited counterspace and I have to remember to bring the mouse and attach. Keys on the keyboard have worn off and I have had the keyboard replaced three times!  The finish on the keys should not wear off after just a month and a half.  I have had for a year and even tho HP has replaced the keyboard THREE times, it took an hour to have an HP tech understand that the keys' finish was wearing off (she kept insisting I had to bring the unit in and let tech's do diagnostics!).  They have extended the warranty for me for a year.  I use this laptop for work and love that it's lightweight, nice size screen and speed but it is the worst laptop I've ever had!", "Date": "May 29, 2012"}, {"Title": "This laptop is FANTASTIC!", "Author": "Bryan", "ReviewID": "R3JDMSVEQGHJLF", "Overall": "5.0", "Content": "It's super fast, powerful, and has everything I could ever have asked for.I'm a college student, who demands quite a bit of performance out of my machines. I'm a technology / Broadcasting major with a minor in graphic arts (I am a gamer as well). So a lot of computer power is needed, and this laptop gives it to me! I finally feel like I don't need to upgrade again for a long while.PROS:- Everything just works, no questions asked.- It's very solid, lightweight, and small (for portability).- Powerful, runs my video editing, gaming, and photo editing software with no hiccups at all.- Fast. Fast downloads, performance, web surfing... Everything is fast.- Sleek design, I love the brushed aluminum it's sporting.- 3 USB ports, i5 processor, 6 gigs RAM (up-gradable to 8), everything about this laptop screams superior!- The battery life is great! I average about 7 hours unplugged, sometimes I forget it's NOT plugged in because it works to it's fullest potential with max screen brightness at all times.- Spacious hard-drive, once again essential - and this laptop gives it to me.POTENTIAL CONS:- The mouse takes a little getting use to, but it works, and feels overall very solid! I use a USB mouse anyway, but when I need to use the built-in, it works extremely well. I saw a lot of complaints about it, but really. It works, guys, come on.- The USB ports take some breaking-in. I found it almost difficult to plug any USB enabled devices in my first few times. But, all in all, they're sturdy - and once broken in, cause no problems!There were a lot of complaints about problems that people encountered, and I gotta say - I have had nothing but smooth sailing, so you'll get the horror stories - but this is a VERY quality laptop, especially for the price!", "Date": "October 11, 2011"}, {"Title": "Good deal at $600, if the keyboard works", "Author": "Mondoman", "ReviewID": "R3R9KQEW70ZJSH", "Overall": "4.0", "Content": "I loved my previous HP DM3-1030US, a beautiful, svelte 13.3\" slip of a machine, and only $500 to boot! However, the 1.6 GHz AMD dual-core CPU was getting too slow for me, so I looked for a new machine with 13-14\" display so I could easily travel with it and use it on airplane tray tables, in cafes, and so forth.  Unfortunately, the DM3-like slim notebooks with faster CPUs were all much more expensive, in Mac Air territory.Recently, I saw this DM4 on sale for $600 and took a closer look -- I'm glad I did!  It's fairly light, and not too big at 14\"; it could stand to lose some thickness (but so could I!), and it does have a built-in optical drive.The i5 CPU is 50-100% faster than my DM3's CPU, the screen is *very* nice, and the 6GB of RAM and 640GB hard drive are more than plenty.  It has enough ports, although I would have liked to see an extra USB port; the HDMI output is a nice touch.  It has real Intel WiFi and a fingerprint sensor (makes logging on fast and easy), but is missing Bluetooth.  It has a webcam and microphone that seem better than the run of the mill.Overall, then, it's above average, and I'm glad to give up Bluetooth for the fingerprint reader. I haven't used the touchpad, as I'm a mouse man, but I like that the touchpad, sound mute, wifi on/off, caps lock, etc buttons have built-in LEDs to let you know when they've been activated.I was not impressed with the hard disk speed, not surprising as it's a 5400rpm model, and I had been using an SSD! Since I can't afford a big enough SSD for this (180GB or larger), I bought a Seagate Momentus XT 500gb drive with 4gb of built-in flash memory cache.  It took a bit of research to figure out how to safely shrink the factory partitions to make them fit in the 500gb, but I was eventually able to clone the stock drive onto the 500gb Momentus XT and install it in place of the original drive.  Booting and general use are noticeably faster with the new drive.The bigger drawback is the keyboard.  I'm a touch typist, and have been having issues with the keyboard missing letters that I type.  It tends to happen in bunches, with small groups of letters missing, so it may be a design flaw, it might be defective, or it may just be a too-cheap keyboard.  I'm still in the break-in period, so we'll see if it's something I can adapt to, or if service is in order.UPDATE: new BIOS update as of late 2011 fixed the keyboard problem 100% for me. I can now use the notebook again!Overall, I'm thrilled with the speed; hopefully the keyboard will work out.", "Date": "September 30, 2011"}, {"Title": "Major keyboard response problem", "Author": "DM4-phobia", "ReviewID": "R2WG4KXA7JZH5I", "Overall": "1.0", "Content": "I had a HP DM4-2070us and it skip letters like crazy after 3 months.  Every 5-6 keystrokes you type will have one keystroke that is missed, that is, even though you did type that key, it will not appear on the screen.  Or, you would hit the space bar or the Backspace key and it will not respond.I had to deal with HP Technical Support over the phone with many, many hours wasted.  They made me try out all kinds of stuff: Windows system restore point, uninstall and re-install keyboard drivers, full system recovery (that's a fancy term for re-formatting your whole hard disc), etc., etc.  All these attempts failed to fix the problem.After struggling with all these for over two weeks, I was told to ship it back to HP Warranty Repair Center and that took another two weeks back and forth.  The Warranty Repair Center replaced the keyboard and ship it back to me.  Unfortunately, that does not fix the problem.  HP replaced my unit with HP DM4-2180us.  Unfortunately, when I get the new HP DM4-2180us, it still has the same problem--as soon as you type a bit faster, the problem is obvious.I am not the only one with this problem.  Use the two links below to take you to HP Support Forum website and you will see different people with DM4-1165DX, DM4-1127 sb, DM4-2015dx, DM4-2070us and most recently, DM4-2180us:[...][...]", "Date": "November 19, 2011"}, {"Title": "A great value for the price", "Author": "K. Rule", "ReviewID": "R78QEA33TAWOV", "Overall": "5.0", "Content": "My 1 1/2 old Toshiba laptop finally gave it up after a prolonged series of manufacturing defects and hardware failures. I had been looking for a (non-Toshiba) replacement and ran across the hp dm4-2070us at my local office supply store. The price was attractive at $499 so I bought it on impulse.I've been very impressed. The build quality is good. It has an impressive set of features and is quite fast. The battery lasts over 4 hours (which is astonishing to me). The only thing that I wish it had is a back-lit keyboard. However considering the price, I can live without that.The pros:1) It's light weight2) It surprizingly fast3) The battery lasts a very long time.4) I like the biometric password manager.I don't really have any serious cons for the computer. The only real quirk I've found is that biometric finger scanner seems to strongly prefer my middle finger for identification. I guess it's middle school of me, but that makes me chuckle.Other than that, this has been the most solid laptop I've purchased in a long time and I got it at a budget price. So Kudos to HP.", "Date": "August 24, 2011"}, {"Title": "Nice.", "Author": "Edmund", "ReviewID": "R2KGBRYTQJIOJF", "Overall": "5.0", "Content": "Pretty good looking, yet powerful machine. The price is the best punch. I got it for 450 at Staples with a student discount so it was an unbeatable deal. But even at this price on Amazon it still is better than other computers. The only disappointment is no bluetooth, the screen is on the dim side and trackpad (like every windows machine) is crappy. It is an Alps trackpad so that is worst then Synaptics. But its doable.", "Date": "August 23, 2011"}, {"Title": "Light weight, portable, powerful!!", "Author": "Michael Fitzgerald", "ReviewID": "REYKCUGZPM2SF", "Overall": "5.0", "Content": "I got this computer for school and found it to be very practical, affordable, and the quad core processor makes it good for multitasking. It's not stiff like a mac it does have some flex to the slim design, however I have not had any issues with hardware. This computer has been very versatile for home or travel, battery life is around 5 hours so thats a drawback. This computer has been very reliable and sturdy. there are some minor nuances like fingerprint recognition not function all the time so I just disable it, I think it is more of a software issue with windows then the hardware of the device. If you want a powerful little computer that plays good HD and can support multi display with ease this is a good economic alternative. The webcam has good definition and brightness even in the dim lit rooms. Has very good connectability 3 usb's 2 2.0 and 1 is 3.0 hdmi and vga. For the price you can't find a better deal with a good brand name and i5 quad core thats lightweight its been a great experience for me.", "Date": "January 16, 2014"}, {"Title": "Quality Issues", "Author": "Joe", "ReviewID": "R3ICFTB7SQ1Z70", "Overall": "2.0", "Content": "the packaged showed up a day early than expected! But I am not really happy about the quality of their refurbish work. The keyboard doesn't lay flat in the laptop and the mouse pad and buttons don't always work, some of the keys on the keyboard do not work. Over all not really impressed with the quality of work they do.", "Date": "May 31, 2013"}, {"Title": "An excellent choice!, good price!", "Author": "Sarah B. Fernandez Diez", "ReviewID": "R39KH4MS3WLNA8", "Overall": "4.0", "Content": "Light, beautiful, fast,...excellent machine. Filled my expectations!. It's everything I want and need for work. Battery lasting its good but it would be better if it lasted more", "Date": "May 9, 2013"}, {"Title": "Great small but very powerful laptop", "Author": "Dinesh", "ReviewID": "RCI6YOZP2MN7G", "Overall": "5.0", "Content": "I am from India and I ordered this product from amazon to India because this is not available here and a laptop of this configuration costs more here(I paid $760 for this including shipping) and it reached to me within a week. I am using this for more than a month. I am very much satisfied with this product and I have no complaints as some other reviewers who says about the physical damage or non functioning of the USB ports but I have no such issue. It is very fast and very light, fingerprint reader works great as I don't need to fill my password at login but just to swap my finger on it. Battery life is very good and I used it continuously for 6 hrs for net surfing over WiFi,watching some online videos and editing some documents and still some battery(around 15%) left. It does not heat at all and the fan either do not run or I didn't come to know when it was running, very silent. 640 GB of storage is enough for any type of use.", "Date": "September 28, 2011"}, {"Title": "YOU THOUGHT IT WAS GREAT", "Author": "J.L.Royale \"Artist\"", "ReviewID": "R3EVOGV82IYMY", "Overall": "1.0", "Content": "It takes a person to have a computer for over a year in order to even tell you about it.  Yes when you first get it, the computer is limitless and amazing. Long battery life gives you absolute happiness.THE BATTERLIFE WAS CUT WITHIN 6 MONTHS!  I went from 5-6 hours to 1-2 hours.  ON THE SAME ENERGY SETTINGS!ALSO, right when the 1-year warranty expired my computer started acting up.  It takes 5 minutes to boot, the fan keeps running and KEEPS running and MAKES AWFUL NOISE.  I tried to clean it and even had the need to open it up, but when I tried that I couldn't get to the fan (AND NO IM NO AMATEUR TO FIXING COMPUTERS IF ANYONE FROM HP WANTS TO ARGUE WITH ME).OH! The webcam actually fell down into the screen's frame.  For some reason when I was trying to use it all I could see was black.  The cheap sticky solution they used to keep the webcam in place wasn't good enough!  I had to fix it myself... because all this happened THE DAY RIGHT AFTER MY WARANTY EXPIRED!THE LEFT HINGE ALSO IS COMING OFF! I can't close the top properly. and the alluminum is weak!  A 60 pound dog stepped on a corner of it and it instantly bent and can't be unbent.  I HATE ITYes it's all nifty at first but the computer doesn't even last a year!  Computers should at least have a life span of 3 years.I am switching to Apple officially and getting a MACBOOK. I loved PCs intill now.  This is the final straw.  I have an even bigger rant on my blog.Sorry KEWLLET PACKARD but you use poor quality parts.  And I'm never buying from HP again. THIS IS MY FIRST AND LAST!", "Date": "February 29, 2012"}, {"Title": "Can't catch a break with HP!", "Author": "Danielle", "ReviewID": "RMIHQBCQTQX50", "Overall": "1.0", "Content": "I got this laptop for college because of the i5 processor (art major), light design, and favorable design. However, within a week the touch pad started acting up. It would stop working for periods of time during class and the only way to get it to work again would be to put the laptop to sleep and then wake it up again. It was not an issue with the lock feature in the corner, the touch pad just became completely unresponsive (buttons and all). I tried changing preferences and settings, but even when the problem was there the computer would not detect something was wrong. I ended up returning it within the week and buying a replacement. This time, it didn't take even 24 hours for the same problem to happen again, this time much more frequently. Not even two days old, I'm returning it tomorrow and getting some other computer. Never again, HP.", "Date": "September 5, 2011"}, {"Title": "Good product", "Author": "PB", "ReviewID": "R2ZGF83DWEJQNO", "Overall": "5.0", "Content": "Great bargain for the price. Came in perfect condition. The laptop is just as advertised. No complaints with the laptop so far, everything works just as expected.", "Date": "September 22, 2011"}, {"Title": "Just the right size and power", "Author": "sirak", "ReviewID": "R3VYXTRPU2ZK7V", "Overall": "5.0", "Content": "This is my favorite laptop i have used in my life. The laptop was the perfect size to carry around, but it wasnt too small. The keyboard was very well laid out and very easy to use. The graphic were amazing and the laptop with an i5 processor was very fast. Webcam quality was the BEST. just amazing. The finger print reader actually worked. No one in my family or anyone could get into it.", "Date": "September 8, 2011"}, {"Title": "Keyboard broken and only 1 USB port is working", "Author": "Jeff", "ReviewID": "R1GQGPTFE7SK8Y", "Overall": "1.0", "Content": "I really don't recommend this purchase. Actually, I will never buy HP products anymore.The keyboard came with a button broken. They send a technician to change for a new keyboard. So, the new keyboard also has a problem. Now, the space bar is not working.In addition, the 2 USB ports on the right side is not accessible (I can't plug any device). This seems to be a design problem of all \"dm4\" notebooks of HP.They promised me another technician visit. I waited, and nobody came.After a month trying to solve these problem, they offered me a new machine, a \"dm4-2033cl\" model. But I search this model on the web and I discovered it usually has the same problem on USB ports. After telling that to customer support, they said I have no option. Now I am really pissed off.Customer support on HP is really bad.", "Date": "August 30, 2011"}, {"Title": "\"Reliable laptop\"", "Author": "M. Harley", "ReviewID": "R4LWNPXUFA91M", "Overall": "5.0", "Content": "Bought this laptop about year ago and so far never encoutered any issues. Fast, sharp looking. Very happy with this laptop purchase.", "Date": "October 28, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0051OLPT0"}}