{"Reviews": [{"Title": "A second look - update of buyer beware", "Author": "Old Georgia Geek", "ReviewID": "R1BORZY5H1XQGC", "Overall": "3.0", "Content": "I purchased this model in September 2011 from a big box store.Pros: It is pretty  The sound is excellent  The i5 processor is okay  Battery life okay - about 3-4 hours  Nice sizeCons: Extremely sensitive touchpad that needs to be disabled in order to input text more than 2 words  From the beginning, I've had issues with the keyboard, especially Left  shift key to get upper case text; this has deteriorated and finally in early May, the keyboard just plain died. Since May 10th I've been trying to get it repaired -with 1.5 years left on my warranty.  Sadly, I've discovered that Toshiba's customer service is the worst I have ever encountered. I had to pay $25.00 and wait for a shipping carton to send the laptop to the Kentucky service center. Even though I still had the orginal packaging and could have used that to return it, it would have been worth it, but....I sent them \"my\" laptop with access to my software and files (backed up, thankfully) and a dead keyboard.2 weeks after my original contact, I received back the same chassis with cleared hard drive filled with factory-loaded software and a dead keyboard.Before I turned it on, I read the paperwork which said there was no problem with the hardware, that there was a software corruption. It did not say what software. When I called to question this,  I was told that the problem was with MS Windows7 HP and they had done a clean install. (ie so I didn't need to worry about any of my personal software.)So, I hung up and plugged it in and turned it on. The Windows screens came up for me to enter my name and laptop's name. But since keyboard still didn't work, I was unable to even put in my first name.It took me 4 phone calls to obtain email paperwork to return my 305 for another visit to Kentucky. Since it is a holiday weekend, the soonest I will be able to have it go to UPS will be Tuesday, May 29th... Fortunately, I have a netbook (a Toshiba BN205 that has been great - and the reason I shopped Toshiba for the Satellite) so I am not totally wiped out of the cyberworld but I really need the larger format for work.I am so disappointed; this isn't the Toshiba from years past. I paid almost $900 for this laptop on sale. In my online research this past week, I found that other buyers have had keyboard, touch pad, and especially shift key issues over time.8/6/12 update: In fairness to Toshiba, I felt like I should update my review:Almost 6 weeks after I originally sent my laptop in, I finally received it back from Toshiba repair service. The motherboard and keyboard were replaced and the laptop is now working perfectly. While I was waiting, because the netbook was not adequate to handle my workload for so long a time, I ended up buying a Lenovo 570 and have been extremely happy with that. So the Toshiba is now available for sale.....Hopefully the buyer will have no further problems, because I would not wish dealing with the Toshiba customer services on anyone.", "Date": "May 27, 2012"}, {"Title": "Toshiba 14\" Satellite laptop", "Author": "Susan Millar", "ReviewID": "R2IA04FS88X5CI", "Overall": "5.0", "Content": "Bought this laptop about 4 weeks ag and am THRILLED with it! The speakers are fabulous, the keys are very easy to work with.  Love the compact design.  It has lightning speed with connections.  Would highly recommend!!", "Date": "October 24, 2011"}, {"Title": "GREAT DEAL. THANKS.", "Author": "erty", "ReviewID": "RZIXA3P2VT35Q", "Overall": "4.0", "Content": "COMPUTER IS USED AND WORKS TO SPEC INDICATIONS, THE SOFTWARE IS SMOOTH AND CONTROLED.  THE PROCESSOR IS MODERATELY FAST, AND IT MULTITASKS APPROPRIATELY AS DESIRED.  I HAVE INSTALLED A BUNCH OF EDITING SOFTWARE FOR MUSIC AND VIDEO ON THIS LITTLE LAPTOP AND IT SEEMS TO SHARE THE SPACE WITH ALL THE OTHER SOFTWARE INSTALLATIONS FOR OFFICE VERY WELL.  GOOD LITE WEIGHT COMPACT 14\" LAPTOP..  ITS THE SECOND ONE LIKE THIS FOR TOSHIBA I HAVE OWNED AND BOTH ARE A GOOD DEAL.  LIKE THEM ALOT.  FOR WORK  OR FOR PLAY.", "Date": "December 3, 2013"}, {"Title": "Excelente", "Author": "Julio", "ReviewID": "R3C0KZ7GY18U33", "Overall": "5.0", "Content": "Muy serios en su compromiso de venta y la entrega del producto fue en el tiempo pactado, lo recomiendo para sus proximas compras", "Date": "September 20, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005C1WM44"}}