{"Reviews": [{"Title": "Perfect for the price", "Author": "Matthew D. Crawley", "ReviewID": "R16T35IDBESIJF", "Overall": "5.0", "Content": "Exactly what I was looking for, and it was very affordable. HDMI and VGA output, 3 USB ports, easily adjustable screen brightness and volume. The full keypad is nice, but I don't use it very much. I mostly stream and watch saved movies, and the hardware and software setup is perfect for that. 4+ hours battery life during casual use, but battery life is variable based on screen brightness. I don't have any complaints about buying the i3 setup instead of the i5 or i7, it's worked flawlessly so far.", "Date": "December 3, 2011"}, {"Title": "slight design flaw!!!", "Author": "mandoo4u", "ReviewID": "R3N7LMOL0FHH5W", "Overall": "3.0", "Content": "the notebook was purchased for my girl friend and she like the notebook.  however, i hate it!!!  the placement of the built in mic is located on the keyboard.  because the mic is located on the keyboard, the internal fan and other internal noise can be heard when you are using skype (or other voip app).  i also have a hard time understanding her because she is usually typing or doing something while chatting.  because her hands are on the keyboard it covers the mic which make her voice sound droned out and when she is typing it creates additional noise.  so if you are planning to use skype or some other equivalent software even a few times, i suggest you avoid this notebook.  you might not notice anything but the person on the other end will hate it!", "Date": "June 8, 2012"}, {"Title": "the typing issue is very annoying", "Author": "brian", "ReviewID": "R1L15NOQGB6C8N", "Overall": "2.0", "Content": "when you type on this keyboard the cursor randomly move to other parts of the text. u always have to use backspace", "Date": "January 17, 2013"}, {"Title": "Very Decent Laptop", "Author": "Logical Query \"Kris\"", "ReviewID": "R3L0Z61M74SGNL", "Overall": "4.0", "Content": "This is the first laptop I've owned and I love it. Not to say that there aren't some things I don't like but overall I enjoy using this notebook. So first off...THE GOOD:Quick, not too much bloatware, and beautiful vivid picture quality. I mainly use my laptop for going online, checking emails, going on social medias, watching movies, TV shows and clips online, occasional typing and gaming (very casual and very rare gaming), uploading and downloading pictures etc., lots of music downloading and such. I'm able to accomplish these things with satisfaction...which is saying a lot because I have a tendency to be impatient with computers + internet. :)THE NOT SO GOOD:The screen is glossy which can pick up glare, but that's pretty much the same with just about any laptop nowadays. The arrow keys...I uploaded a picture about this. The arrow keys are jammed onto the keyboard instead of separated out. It's very easy to click on these keys accidentally. Sometimes MY laptop runs hot (but I tend to run it long hours too). Mostly the left side heats up because that's where the vent is. Easily fixed by getting a cooling fan/pad. Averages about 3.5 hours on a complete charge. That's not bad...but kind of wish it was longer (not that I travel or anything, I could easily keep it plugged up).SUGGESTION:If you're a technophile, then no I wouldn't suggest this laptop. For those who want a solid option for a decent price and aren't too nit-picky about every little detail, I would suggest getting it. It may not be able to flawlessly run some MMORPG game, but it'll get the work done and it's a great choice. I don't know about the mic and Skype because I don't use those.MORE TIPS/SUGGESTIONS(SERIOUSLY THIS IS IT):Just so you know, Windows Media Player (I think it's version 12 or something) still kind of sucks. You can watch movies on it and do your music thing but sometimes it'll completely mess up the song titles, artist, etc. You may have to manually go in and fix your music. I didn't want anyone blaming the laptop for that.Also, I'd suggest getting an external hard drive to do backups. You can get a blank DVD disc but it takes F.O.R.E.V.E.R....and a day. And for me it still had problems and wouldn't finish backing up (this is literally doing a backup on the laptop right out of the box with no music, pics or ANYTHING on it). I've read elsewhere that others have this problem with WINDOWS 7 (not the laptop). Amazon may hate me for doing this, but I got a Toshiba 500GB hard drive for $80 at Walmart, which is pretty cheap. It had very good reviews as well. It still takes a while to backup files but not nearly as long as with the disc and very easy to do. Okkkayy, I'm done now.", "Date": "August 7, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core i3 Processor 2.2GHz\n4GB DDR3 RAM\n500GB 5400RPM Hard Drive\n15.6-Inch Screen, Intel HD Graphics 3000\nWindows 7 Home Premium", "Name": "Samsung NP-RV520-A01US 15.6-Inch Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/41maffiAjvL._SX300_.jpg", "ProductID": "B005OUQAPK"}}