{"Reviews": [{"Title": "Best value for college student or professional!  Fantastic laptop!", "Author": "Don", "ReviewID": "R2H6EE8WTXNFTO", "Overall": "5.0", "Content": "Being a college student who needs access to a computer almost every day for a variety of tasks, I was in the market for a laptop with relatively high processing power and good battery life.  When I stumbled on the Toshiba Portege R835-P84, I knew it was the perfect laptop for my needs. I have had it for almost a year and could not be more satisfied. The main pros about this little machine are this:-it has an Intel i5 processor (2.40 GHz, 3.00 GHz with Turbo Boost Technology) which allows it to boot up very fast and can handle multiple programs running at once with ease-it has a 640 GB hard drive capacity which is quite impressive for such a small computer, it means I don't need to consider an external hard drive to store school file-the battery life is awesome...I have been achieving about 6-7 hours w/o charging and thats while the computer is being used for writing papers, browsing the web, you name it-it weighs just over 3 pounds and is super compact (I don't even feel it in my backpack)-despite being a 13-inch laptop and weighing only 3 pounds, it still has a CD/DVD drive!-comes standard with a spill resistant keyboard and HDMI port-if the computer senses an impact, the hard drive is automatically shifted into a safe position so that files are not lost (it is actually quite sensitive and you can hear it happen if you pick up the laptop quickly or abruptly...however this feature can be disabled easily by going into the settings)-the frame is very sturdy and feels solid when carried-it's Energy Star Certified and has a really cool Toshiba Eco program where you can monitor power usage in watts and adjust power settings depending on your needsThe few cons are the following:-doesn't come with Bluetooth (I don't understand why not, but I don't really use it that anyway)-the keys on the keyboard are kind of flat and may take getting used to...I did and now love writing papers with it-the speakers are average-the left and right click buttons are rather loud when clicked, I usually tap the touchpad for left clickOverall, you probably can't find a better laptop in this price range and I really enjoy working or just having fun with it.  I think this laptop is equal to and beats the MacBook in many aspects including processing and features, and at less than 2/3 the price, it's definetely a good bargain.", "Date": "October 1, 2012"}, {"Title": "Loving it!", "Author": "Stephanie Richardson", "ReviewID": "R1FT3R5BUUOS4M", "Overall": "5.0", "Content": "Did much research for an ultralight computer to replace my heavy weight Dell laptop. This was just what was needed.", "Date": "June 6, 2013"}, {"Title": "I love this laptop", "Author": "GM", "ReviewID": "RZOV78UDB0VIH", "Overall": "5.0", "Content": "I bought this laptop a few weeks ago. The laptop is almost the same as the P81/p56x version, but was sold at lower price because of many sellers. It's very light in hand, the color is what I like. The only issue I found is that the keyboard doesn't feel as good as my old Thinkpad T61. But for a 13\" laptop, I shouldn't complain about it at all.", "Date": "February 28, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "13.3 inch screen, optimal size for usability AND portability\nfast processor Intel Core i5, Windows 7 Home Premium (64 bit)\nattractive black design, slim and light\nembedded CD/DVD player/burner\nresponsive touchpad", "Name": "Toshiba Portege R835-P84 13.3-Inch Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/51sZsuJxTlL._SX300_.jpg", "ProductID": "B005Z5WDKK"}}