{"Reviews": [{"Title": "Good basic computer for a good price", "Author": "Cryssa", "ReviewID": "R17IE9AEEI9K8W", "Overall": "3.0", "Content": "I purchased this Laptop in August from a major retailer and paid about $275 brand new. Its a good laptop for performing basic websurfing tasks and viewing pictures and videos. Nothing special no bells and whistles and not much to shout about. At a price of $275 this is to be expected...you get what you pay for and I knew this when I bought it. However keep in mind that the RAM, even though it comes stock at 2GB, is upgradeable up to 8GB. And RAM is honestly not that expensive or difficult to upgrade and boosts your memory, speed, and performance for less than $50 if your computer savvy or know a friend who is. You can also upgrade the graphics for less than $100 depending on if you really want a gaming machine or just to view a couple videos and the occasional game now and then. You can also upgrade the processor, but I would recommend a professional repair technician to handle changing out the CPU but upgrading from the stock 1 GHz Dual Core to a triple or quad core 2.5 GHz or greater would be worth it for the power and performance you could get, but thats up to you. Depending on what you are looking for, you can upgrade this laptop for alot less than buying a top notch performance system, and get at least equivelent performance. This is why I purchased this laptop to begin with...I plan on making those upgrades in the near future. Only issue Ive had is the LCD screen got a snowy red haze that showed up against certain colors, and found out that it was the screen itself going bad. But an LCD screen costs about $60 for the part, and I got a high gloss anti-glare finish replacement screen which shows color contrast better and shows up better in high light environments...so im happy and problem solved. Its a good starting point laptop to upgrade or for a kid starting out.", "Date": "February 29, 2012"}, {"Title": "Don't Waste Your Money!!!!", "Author": "appraizer", "ReviewID": "R1Z9FW1T09OA93", "Overall": "1.0", "Content": "Purchased this Toshiba at Christmas time. In three months the left hinge went bad, in 6 months the right hinge broke, which by the way, broke the led screen. Toshiba would not stand behind this even though it is still under warranty. We fixed that part ourselves now into the 8th month the motherboard has gone out. CRAZY HUH? We have sent it back again, lets see what excuse Toshiba has for not fixing it this time.I am a previous Toshiba user and have always loved them. NOT ANY MORE!!! Good luck to you if you choose to buy any of the redesigned toshiba laptops.", "Date": "August 13, 2012"}, {"Title": "Good Price for doing nothing", "Author": "Jesse B.", "ReviewID": "R3EHUMYGBU62PH", "Overall": "2.0", "Content": "I bought this laptop thinking Satellite was very well made, but they cut every corner possible on this one. Here's a list of what I think:Pros:- Nice keyboard Layout- Has everything you need- Good sized screen- Lotta side ports if you need themCons:- Cheap plastic feeling (Compared to my Dell Inspiron or Acer 5516)- Track pad does not respond well- Track pad too small- Mouse buttons bevelled in and too close to the edge, annoying to right clickThe Biggest Negative:- It is extremely Slow.. Booting, Using, and especially multi-tasking.", "Date": "August 17, 2011"}, {"Title": "great", "Author": "oneil", "ReviewID": "RLJ23C8UKW1EL", "Overall": "5.0", "Content": "I buy this toshiba an trust me I really do love it only problem is window stop coming up sad", "Date": "November 16, 2012"}, {"Title": "Great Deal", "Author": "Christian Philip Grace", "ReviewID": "R3VF5Y1ZOF57KY", "Overall": "5.0", "Content": "This computer is refurbished and looks brand new. Everything seems to work okay right out of the box. We are giving this as a graduation gift, so if there are any issues, we will soon find out. I own basically the same computer with an Intel 2 ghz dual core processor, and 4 gb of ram. This one has an AMD c-50 1 ghz processor and 2 gb of ram. If we have performance issues, I plan to upgrade to ram to 4 gb. This computer has the features of a laptop with the battery life of a netbook, or tablet. I remember these being sold at Walmart at a great price last year. I missed out on it then, but got another chance through Speedy Mobile.", "Date": "August 9, 2012"}, {"Title": "great little lap top", "Author": "Pauls ddd3 \"Paulsddd3\"", "ReviewID": "R16HKB10FEZXLR", "Overall": "5.0", "Content": "The Toshiba came with some software that I could apply to my network. I am using this laptop only as a media center and it was so easy to incorperate in my network. I recommand anything Toshiba. I have purchased their tv.s before and have never had any issues with their equipment.", "Date": "March 19, 2013"}, {"Title": "Good laptop", "Author": "The Doctor of Fun", "ReviewID": "R3GI0GL8HF8C7I", "Overall": "4.0", "Content": "This is my second laptop, but not in a row...I was convinced by the price, the RAM and the memory capacity, I been using it for almost 2 weeks and until now I don't have any problem with this laptop...the only thing is that run very slow with some games, in special for WoW, this is definitely a student laptop or just for internet users.....I still recommend it", "Date": "October 26, 2011"}, {"Title": "Good laptop", "Author": "Lilac", "ReviewID": "R14FBRGDFGK9SX", "Overall": "4.0", "Content": "Very affordable laptop(I bought it for $280 brand new, not the price listed above) and it doesn't dissapoint. I saw a couple of negative reviews and I completely disagree with them. It is NO slower than the average laptop in its price range. Overall  - it's light  - has comfortable keyboards  - doesn't overheat  - good HD video quality  - decent quality displayThe only con I see is that no matter how much its updated its windows experience index doesn't seem to improve. But at the same time, its performance is no different than the average laptop although it costs much less.It's not for gamers but it's definitely well fit for the basic stuff.The touchpad can be annoying. But overall I recommend it to anybody that wants to get a decent laptop which is reasonably priced.Anyways you must try to get it at the price I got it inorder to be as satisfied as I am :) Don't ask me where", "Date": "September 19, 2011"}, {"Title": "ridiculously SLOWWWW & horrible lag!", "Author": "RWT Reviews", "ReviewID": "R3T0NHQPRKTQ92", "Overall": "2.0", "Content": "Out of the box, it's clear that \"dual core\" means absolutley NOTHING with this thing! The multi-tasking is terrible because of lag. Performing 1 task is terrible because of lag! The touchpad's sensitivity/responsiveness is is horrible. Everything is all around slow, even at casual use.After installing updates & trying tweek settings, NOTHING IMPROVES!!!I bought this thinking I was going to finish setting up my website, after my primary laptop died mid-project. Seeing that it can BARELY handle casual tasks like youtube, facebook, email & websurfing.... I can't image trying to complete my project on this thing. Just the thought of that drains me!I was hoping to use this (because it was a cheap) temporarily until black friday, thenI would upgrade but I don't think I can handle this piece of crap until then...... it may be going back tonight.++++++++UPDATE++++++It in-fact, went back the next day. I couldn't get rid of it soon enough!", "Date": "August 6, 2011"}, {"Title": "My Customer is Delighted with this bad boy", "Author": "Lauren Hemedinger", "ReviewID": "R3VC9WHD9PV2L0", "Overall": "5.0", "Content": "As a reseller, I always look for the best and with great pricing. Would have liked a 500G HDrive but for the money, you can't do any better. Toshiba makes QUALITY computers and this is another example of their committment to the public.", "Date": "December 18, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Product: Toshiba Satellite C655D-S5202 15.6\" Laptop Black\nProduct Number: C655D-S5202\nBrand: Toshiba\nOperating System: Windows 7 Home Premium\nProcessor: AMD Dual-Core C-50 processor 1.0GHz, 1MB L2 Cache", "Name": "Toshiba Satellite C655D-S5202 15.6\" 2GB 250GB Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/41T95MdnZVL._SX300_.jpg", "ProductID": "B005FDEG7U"}}