{"Reviews": [{"Title": "Solid choice", "Author": "Andrew Triska", "ReviewID": "RWN49H3CZIDI2", "Overall": "5.0", "Content": "Aesthetically, it's clean and plain with a boxy, modern feel. In the photo, the lid looks like brushed aluminum, but in person it's smooth, shiny plastic with a brushed look. I love the chiclet keyboard -- it types with a slightly clicky, satisfying motion, very quiet with a bit more grippy finger-feel than a Mac keyboard. The touchpad is just slightly rough and the buttons feel sturdy. It's heavier and chunkier than a typical Toshiba or HP model of this class (typical of Dell), but still portable enough that I feel perfectly comfortable walking around with it.The sound quality is fairly good, although I'm not sure why Dell put the speakers on the bottom. They're right in the front where the base slopes up, so they're somewhat pointed toward me, but the sound is a little muffled when I put it on my lap instead of on a hard, flat surface. It's somewhat easy to accidentally press the button that pops open the CD tray while carrying it. The screen is shiny and bright, and the webcam image is reasonably clear, even in dim light. The microphone sound quality is clean -- I don't hear any hiss or buzz -- and it picks up just fine from a couple of feet away.Predictably comes with useless pre-installed Dell utilities that you'll probably want to remove. I don't really feel the need to comment on its performance -- the specs on this one are fairly common, so you should be able to do your own research on the hardware.", "Date": "November 27, 2011"}, {"Title": "Grue", "Author": "Steve Richards", "ReviewID": "R16QWSADQ4KNO8", "Overall": "5.0", "Content": "I normaly don't do reviews but for this item i must. I read all the reviews for the Dell and on the advise of the computor Geek that services the computers at work boughr one. I have none of the issues mentioned in the bad reviews, it runs cool, so quiet you foget its on, fast, and with several items up at the same time the ram is only running 35% and the unit still runs lightnig fast. I use my laptop as if it was a tower, I use a wireless mouse & key pad and a 23\" monitor, the laptop sits closed in the corner of my desk, if I could find a way to start it without opening the lid I would probably never open it. If your looking for a compact power house and don't need a large screen or the 10 key option, this would be a good choice. I would recomend this to a friend.", "Date": "January 2, 2012"}, {"Title": "New laptop is fast and stable", "Author": "Hank", "ReviewID": "RLLETYZVR4PZI", "Overall": "4.0", "Content": "Laptop is replacement for 2006 XP.  So far, it is great.  Boots fast, is stable, and maintains wireless connection.  I do not like the add-on software that came with it, though (antivirus, cloud backups, etc. with) which persistently pop up and are \"in your face\" more now than ever urging you to sign up or buy.  I paid for the laptop and that's all I want and I will shop for whatever I want when I want to. I don't appreciate Dell being sneeky about the hype.  I got a good price through an Amazon vendor and fast, predictable delivery when promised. Windows 7 seems fine but is different than XP and will take some getting used to.", "Date": "December 8, 2011"}, {"Title": "Solid Black Label", "Author": "DCG", "ReviewID": "R1MAU3QEAE1N9C", "Overall": "4.0", "Content": "It's just the kind of tool I needed. A little heavy, but solid and reliable. With the necessary number of features to work at home without spending time.", "Date": "November 20, 2011"}, {"Title": "Excellent laptop at an affordable price", "Author": "pankaj", "ReviewID": "R2KU9XB0B7SUIO", "Overall": "5.0", "Content": "I ordered this laptop after searching the net for like 2-3 days.This is the cheapest i5 with 6GB Ram and 640GB HDD out there.Also, it has got every other feature, out there in other laptops, costlier than this one.Though, the only thing missing would be the presence of a graphic card.Other than that, bang on target, with every feature I wanted viz. USB 3.0 and HDMI out.I ordered this for $549 on amazon on black Friday(Got a nice deal, eh!).Now it has been like a week, I am using this laptop, no problem whatsoever.", "Date": "December 16, 2011"}, {"Title": "Dell Inspiron 14RN i14RN-1818DBK 14-Inch Laptop (Black)", "Author": "Rick T \"Rick T\"", "ReviewID": "R2S88D02QYS92S", "Overall": "5.0", "Content": "Product is as advertised. Works well. My daughter uses it for her studies, some entertainment and social networking. It fits the needs very well.The transaction was smooth and simple. Delivery was prompt.Over all, very satisfied.", "Date": "April 7, 2012"}, {"Title": "Solid workhorse", "Author": "J. Rooney", "ReviewID": "R1A2WITLIAIIX6", "Overall": "5.0", "Content": "I've had many laptops.This is one of my favourites. It's big enough to be useful but not overwhelming. I do everything from emails to programming to video editing with it. This is my go-to machine.The battery life is typical of any large screen laptop... horrible... so I'm nearly always plugged in when using it. I have computers that last a lot longer on battery, but I always wind up using this one.", "Date": "February 25, 2014"}, {"Title": "Excelent", "Author": "Carlos Silombria", "ReviewID": "R28H9IB9MWHVKB", "Overall": "5.0", "Content": "i use it for a year and i have no complain. Recomended. Use with windows and linux with no problems.", "Date": "January 8, 2014"}, {"Title": "Dell Inspiron 14RN i14RN-1818DBK 14-Inch Laptop (Black)", "Author": "lordcarlash", "ReviewID": "RZAEZCAFZ0JXO", "Overall": "5.0", "Content": "Excellent laptop for the price. Purchased Aug 12, 2012. Great features including Intel i5 with 6GB Ram and 640GB hard drive. Comes with Windows 7. I installed Ubuntu 12.04 and everything just works.", "Date": "September 13, 2012"}, {"Title": "Dell Inspiron 14RN", "Author": "Darick John", "ReviewID": "RTHVXYBERPPR", "Overall": "5.0", "Content": "I purchased this dell inspiron 14r on Amazon a week later I got it very fast shipping I could say that because I live in Trinidad anyways the laptop is working pretty good so far no complains about it rate it 9 out of 10 and it has a good price assigned to it.Here are some of its specs:Intel Core i5-2410 2.30GHz Processor with Turbo Boost Technology up to 2.90GHz6GB DDR3 Dual Channel Memory640GB SATA Hard DriveWindows 7 Home Premium 64-bitMcAfee SecurityCenter 30-Day Trial Offer[...]", "Date": "December 10, 2011"}, {"Title": "Cheap plastic and slow machine...", "Author": "ControlAltWeb", "ReviewID": "R3HXPSJQEKZD42", "Overall": "2.0", "Content": "This is my first Dell laptop, and it should be my last. The plastic chase is bad, it make noise under my hand when I write. The laptop is very slow, I had a HP Pavillion before this Dell, and it's a lot faster with an older processor and less memory. I really don't recomend it.", "Date": "May 18, 2012"}, {"Title": "Rapida, completa y Versatil.", "Author": "Juan Diego Rivera", "ReviewID": "R2RBUE2XKOED3N", "Overall": "5.0", "Content": "Excelente Producto es sumamente rápida y completa la batería tiene una duración casi que eterna y la relación de peso y dimensión es muy cómoda. Definitivamente recomiendo este equipo.", "Date": "April 12, 2012"}, {"Title": "Awesome laptop!", "Author": "Joel Moreno", "ReviewID": "R3Q0ZYERTTSQVZ", "Overall": "5.0", "Content": "I love this laptop. It was love at first sight. I found it cheaper in another website. The screen is beautiful! Nice storage, fast, enough RAM memory, fast bluetooth, nice resolution... What else can I ask for!? This baby has it all! Totally recommended!", "Date": "November 7, 2011"}, {"Title": "very bad experience buy a item from ebestpurchase", "Author": "TM contrctor", "ReviewID": "RCCYOPSYFL2U1", "Overall": "1.0", "Content": "I brought dell computer from ebestpurchase, when I got that computer there was problem with running slow, so I did contact amzon they gave me information about technique surport , but it didn't work, so I contacted Dell customer service they send me reinstallation Cd for the computer. I let my frined came my place who work at High-tech company try to find out what kind problem this computer is ?  finally, we know the problem is computer hardware , there were \"click,click \"sound from computer hardware , so I did contact seller let them know about that situation and I want reture that computer , they email me will charge me restocking fee for about 20% of the retail price, I don't understand how come there is restocking fee charge for problems item ?? ebestpurchase said computer no problem at all !! well, I realize there is not any guarantee when buy the item from ebestpurchase. how terrible ,they say what they like to say !! and I paid the send back item shipping fee , they still charged me shipping fee for nonrefundable... I just let peple know anout this situation so be careful when you purchase item from  ebestpurchase..  there should't not star for this rate..", "Date": "July 7, 2012"}, {"Title": "Exactly what i wanted!", "Author": "Joel Moreno \"Jo Black\"", "ReviewID": "R33K0Z43S2S0EE", "Overall": "5.0", "Content": "I love this laptop! It's fast, beautiful and it has the perfect size for me. Very nice laptop and an very good price. It has a beautiful screen. Totally recommeded! 5 stars!", "Date": "November 5, 2011"}, {"Title": "ww", "Author": "bb", "ReviewID": "R3PMZNMH2O6Q7I", "Overall": "5.0", "Content": "Be detailed and specific. What would you have wanted to know before you purchased the product?Not too short and not too long. Aim for between 75 and 300 words", "Date": "May 25, 2012"}, {"Title": "Hard drive not replaceable !!!", "Author": "Songdog", "ReviewID": "R20OYBM2PD6WYC", "Overall": "1.0", "Content": "I purchased a Dell Inspiron i14RN-1818DBK at a brick and mortar store then when I went online to dell's website I found that you had to virtually remove every screw in the thing and pry the keyboard off in order to upgrade the hard drive, or replace it if it went south.  That alone caused me to return it without even plugging it in and turning it on.  I always like to replace the slow 5400-rpm hard drives with faster ones even if it does cost me a bit in battery life.  That way if the faster drive I select does go south I still have the original one that I can clone again.  When manufactures make replacing hard drives and ram really difficult for me I simply vote with my pocketbook.  I just purchased a Toshiba P745-S4320 at another brick and mortar for almost $100 more. It has 1 less usb port, no e-SATA or bluetooth, but does have a blue ray player and most importantly the ram and hard drive are accessible.", "Date": "October 30, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005KP77EM"}}