{"Reviews": [{"Title": "Good laptop", "Author": "Felix", "ReviewID": "R1GRSZWDE1YZE", "Overall": "5.0", "Content": "its working very good, nice laptop Asus G74SX-BBK7 17.3\" Notebook (2.0GHz Intel Core i7-2630QM Processor, 8 GB...thank youbye bye", "Date": "April 7, 2014"}, {"Title": "not as described", "Author": "mel", "ReviewID": "R3V1SZJNMN3T2L", "Overall": "3.0", "Content": "Well used and abused,  not factory refurbished....no bluray, I've seen better in pawn shops. Nothing more to say, except NOT AS DESCRIBED.", "Date": "January 10, 2014"}, {"Title": "Used ASUS G74SX-BBK7", "Author": "AWatts", "ReviewID": "R5J3S5B3GAT5L", "Overall": "5.0", "Content": "This review is about the product I purchased from KMM5086 - Amazon Marketplace <wnl1n2wrw32kjxg@marketplace.amazon.com>I bought two of these machines from Best Buy last year so I knew what to expect. The seller said it was only being sold as used because it was an open box; otherwise, it hadn't actually been used. For the price, even if it showed some wear, I would have been happy; but when it arrived, it looked exactly the way the other units did when I brought them home from Best Buy last year.Evidently, the seller must have turned it on before shipping it because Windows 7 was updated as of Oct 1, the day it shipped. I thought that was a very nice touch that saved us a lot of time.I bought this unit for my Daughter-in-law to play games like Diablo III on along with my son, who got one of the two identical units last year. After firing it up and getting the two updates recently released by Microsoft; and uninstalling a couple of things, we installed Diablo III and she was playing it when I left.I was a bit leery at first, with him being a new seller on Amazon but the description and price overrode my skepticism and I am very glad that it did. The other thing that worried me a tad was that there was no mention of where it was coming from; but once it shipped, FedEx let me know it was coming from FL. (I think he might mention the location of products he sells in the future.)I also paid for expedited shipping which said I would get the laptop in 4-6 days. It shipped Monday and arrived on Thursday. It doesn't get much better than that!I will be upgrading its memory this weekend, which will give me an opportunity to look inside the case a little bit. I do not anticipate any problems on that score. Again, everything looked brand new and pristine, as advertised.I am complete satisfied with this purchase at this time; and I would buy from this seller again without hesitation.", "Date": "October 4, 2012"}, {"Title": "Not your average g74sx", "Author": "Iolo", "ReviewID": "R34WOPU2TRQODD", "Overall": "2.0", "Content": "This model was made explicitly for Best Buy, refurbs are out there, as are used ones.Differences vs typical rog g74sx-xxxx-2GB of VRAM instead of 3GB-128 Bit instead of 256-2D vs 3D Panel-1600x900 instead of 1920x1080 Panel-No Bluetooth-No Blu-ray-Smaller HDDs (500s instead of 750s)", "Date": "April 9, 2012"}, {"Title": "Not quite as satisfied.", "Author": "George", "ReviewID": "R23LV5FMVM6SNK", "Overall": "1.0", "Content": "I bought this because my son thought it was a great deal. Have had nothing but trouble with it. Asus customer service is non existent to say the least. NOT SATISFIED......", "Date": "May 4, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "3D, Full HDD screen,\nBlu-Ray writer, 3D Blu ray reader", "Name": "Asus G74SX-BBK7 17.3\" Notebook (2.0GHz Intel Core i7-2630QM Processor, 8 GB RAM, 1 TB Hard Drive, Windows 7 Home Premium 64-bit)", "ImgURL": "http://ecx.images-amazon.com/images/I/41QqY-yRaTL._SX300_.jpg", "ProductID": "B005T27T3K"}}