{"Reviews": [{"Title": "dv6-3216us review after a week", "Author": "mptoledo", "ReviewID": "R9WF3PZTD0MEG", "Overall": "4.0", "Content": "UPDATE:  6-21-11After downloading the updated drivers from Hp, The speakers are now much louder and crystal clear.  I would now rate this at 4.5 stars.  This is amazingly fast and has served me well over the last month.  I also bumped this up to 8 gb ram and it seems to help.  I can play fear on medium settings with no problems.This would have scored 5 stars if the speakers had been louder and the HD would have been bigger.  I bought it at a box store on their Memorial day sale, so my price per performance, is the best deal going right now.1st off, the software updates took about 7 hours including Office 07.So far, I am impressed and have no regrets. My only real gripe, is the HD size and weak speakers. But I do plan on going solid state when prices come down. The thing looks amazing and is blazingly fast(so far).The computer really beats the other two I \"test drove\"(Hp i3 4gb Intel Hd graphics, Gateway Phenom II dual core, 4gb Radeon HD 4250 graphics) The only week point was the load time for Fear, as it took 2 1/2 minutes longer to install. I suspect the DVD is weak in this hp. The card reader was lightning fast, as was my thumb drive in the usb port.The screen is pretty viewable at most angles, but does lose color at off angles including up and down. I tested \"Fight club\" on it. The sound is pretty anemic. I can hear it, but have some trouble with the quiet parts. Picture looks stunning though. I had a hard time telling the difference between it and the Gateway bluray.Fear ran on high settings without a problem.  I can't comment on the touch bad, as the first thing I do with lappys is disable it and install a good gaming mouse..I really like the design and look. I also thought it was cool as the HP emblem on the back glows when the unit is on.Pros:PricePerformanceLooks and layoutKeyboard (surprisingly good)Screen clarity(dvd)No fan noise(I had to keep checking to see it was on).Cons:DVD speed is middle of the road.HD size and speed.speakers(crystal clear, but not loud)It passed the burn in test with zero errors.UPDATE: BATTERY LIFE:I got 3hours on DVD, Fight club sound down to minimum.UPDATED DRIVERS:There are many updates for drivers. (bios, video, audio....) Just click the link and follow the directions.[...]", "Date": "June 4, 2011"}, {"Title": "High Performance & Low Cost", "Author": "Jim", "ReviewID": "R22LAUI6A70O4L", "Overall": "5.0", "Content": "I have owned my HP dv6-3216us for a little over a month now.  I bought the machine from a box store for $400.00 with a $50.00 mail in rebate on a tax free holiday.  The computer is beautiful and fast.  I use it for school and for CAD work.  The I5 480 is a very fast processor.  I have noticed that the battery seems to last a little longer than advertized with moderate use.  The keyboard is great.  Feels better to type on this then on a Macbook.  I would rate the case at about a 7 out of 10.  The mouse pad is extra large and responds well to touch functions.  The only annoyance is that the mouse pad buttons are attached to the mouse pad and require a lot of pressure to push.  I searched around for a college laptop and I could not find anything else with as much power and features for the price.  The only feature that I wish it had is a number pad.", "Date": "August 31, 2011"}, {"Title": "Great value", "Author": "mhs", "ReviewID": "R21959KSID78LR", "Overall": "4.0", "Content": "I have had this notebook for quite some time now. It works just fine for the price point. Only thing that bothers me is the battery life which is low. Most laptops in this price range are the same or worse. Also gets pretty hot when used for hours. On the plus side, it has an HDMI input which is cool.Overall, I am pretty satisfied with it.", "Date": "January 7, 2013"}, {"Title": "Excellent", "Author": "Raphael Adler", "ReviewID": "R37AR605QNAE0D", "Overall": "5.0", "Content": "Came at time good computer , very easy to install good for grown-ups. All the items came at the box nothing was missing", "Date": "November 22, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "15.6\" diagonal High-Definition HP BrightView LED Display (1366 x 768)\nLightScribe SuperMulti 8X DVD±R/RW with Double Layer Support\nDolby Advanced Audio with Altec Lansing speakers\n5-in-1 integrated Digital Media Reader for Secure Digital cards, MultiMedia cards, Memory Stick, Memory Stick Pro, or xD Picture cards\nIncludes HP TrueVision HD Webcam with integrated digital microphone", "Name": "HP 15.6\" Pavilion dv6-3216us Entertainment Notebook [Intel Core i5-480M, 4GB DDR3, 320GB HDD, Backlit Screen, HDMI]", "ImgURL": "http://ecx.images-amazon.com/images/I/31O83-hQFOL.jpg", "ProductID": "B0053OOFD6"}}