{"Reviews": [{"Title": "Avoid. (using Linux on this machine)", "Author": "Jeremy Mossa \"Jeremy Mossa\"", "ReviewID": "R131NYWS1QA9MZ", "Overall": "2.0", "Content": "Too many problems: screen malfunction, charger shorted, and a weak signal from the wireless chip. Avoid.(This was originally a long, somewhat positive review, but too many problems caused a short rewrite.)", "Date": "January 1, 2012"}, {"Title": "Fast, impressive, but one major flaw", "Author": "ThinkpadGirl", "ReviewID": "R3GF7S23HMVDNB", "Overall": "3.0", "Content": "In a nutshell: the keyboard just sucks. It's horrible, terrible. I can't emphasize enough..if you are normally a fast typist, like I am, then this keyboard will make you mad. It doesn't register keypresses!  WTH!That said, everything else about this little machine is amazing. Screen is beautiful, it's fast, it boots in like 6 seconds! Strangers at the airport (I live at airports) flip when they see this machine.Still, I'm considering returning it. The keyboard on any machine of mine MUST be an extension of my fingers...", "Date": "January 7, 2012"}, {"Title": "Find Laptop Nirvana with the Zenbook", "Author": "B. K. Lower", "ReviewID": "R2MT29Z2063363", "Overall": "5.0", "Content": "You want a computer that is powerful enough to do real work.  You also want something that has great battery life and is really portable.  Oh yeah, you want it to look nice too.  This machine is terrific and feels rock solid.  It also has nice finishes like matching sleeve and case for the included wired ethernet and VGA video out dongles.Pros- Super fast power-on, wake, and shut-down/sleep -> no waiting around for the machine to be ready to do work- The trackpad is silky smooth and very responsive and right clicking is done by pressind down the bottom right corner of the track pad- Very light but rock solid- Brushed metal looks very sleek and feels greatCons- Two finger scrolling is a bit jerky at times- Takes a bit of practice to learn how to open the clamshell case", "Date": "November 14, 2011"}, {"Title": "This Laptop Makes Me Happy!", "Author": "Melissa", "ReviewID": "R20X05GN78PUT", "Overall": "5.0", "Content": "After reading a lot of reviews about the \"flawed\" keyboard and trackpad on this laptop, I was hesitant to buy it.I'm a college student; I was looking for something super-portable to take to grad school, but more powerful than a netbook so I could process data.  I admit, I went for the zenbook because, let's face it, it's just so darn cute!After three months, I'm thrilled with this laptop.The trackpad works fine.  I disabled zoom functions because I kept accidentally zooming, but left on two- and three-finger scrolling, which work fine.The touchpad will occasionally throw a temper tantrum and start behaving erratically.  This happens about once a month, and all it takes to fix is a reboot, which takes about fifteen seconds.  It usually happens after I have been using the computer for about a week without a real shut-down(and continuously postponing my update installs).The keyboard is also fine once you get used to it.It only took me a couple hours to stop missing keys; you do have to press them with a little more conviction than you do on other laptops, but it doesn't take long to learn.That said, I'm a petite lady with tiny hands; I find the keyboard comfortable.  If you've got bigger hands you might have more trouble.I like the screen size, too, but my roommates complain that it is too small to watch a movie in a group.  Solution: watch the movie on my roommate's laptop.  Problem solved.It is tiny but not fragile.  The case that comes with it is attractive and means I don't worry about shoving it in my backpack and running off to class.  I also love being able to pick it up with one hand and no effort.The internet connectivity is great (some other reviews had mentioned bad wireless cards.  Mine works perfectly.)Yes, the power button is on the keyboard where the delete key should be.  I've never hit it accidentally, but if I did, it would take about five seconds for me to wake the computer back up, so what's the problem?To sum up:Size and portability are awesome.No trouble with internet.Trackpad and keyboard are fine once you get used to them.This laptop makes me happy every time I use it.  Even when I am using it to do my Physical Chemistry homework.  I am thrilled and recommend it to everyone with no reservations.  I hope you love it, too.", "Date": "March 30, 2012"}, {"Title": "Beware the proprietary hard drive format!  Can't be replaced if it fails...  But Amazon RULES", "Author": "WSK \"Semper Ubi SubUbi\"", "ReviewID": "R3EX7D5MP7CK1T", "Overall": "1.0", "Content": "UPDATE:  Amazon stepped up to the plate and took the product back with a full refund.  They were under NO obligation to do so under the terms of purchase and I had originally contacted them just asking for help getting a response from ASUS.  No back and forth.  Just a very polit e-mail with a return shipping label.  This was well and above what was hoping for.  So two takeaways 1).  DON'T buy a notebook with proprietary parts - especially from ASUS.  2).  DO buy from Amazon.  Great end to what had been looking like a bad story.------SSD hard drive failed after only a month or two of use (see description below).  I start to look into replacing it and discover that the UX21 has a totally proprietary drive size/shape/format and you CANNOT BUY A REPLACEMENT DRIVE AT RETAIL.  So if you decide to buy one of these, you are totally at the mercy of ASUS if your hard drive goes bad (as SSD drives often do).That would also be OK if ASUS was willing to replace it themselves, sell you a replacement drive, or even answer their e-mail.  I have been waiting for two weeks now and can't get a peep out of Asus (the only communication from them so far is a \"customer service survey\" which is ironic given I have received no service so far).The customer service problems and the early drive failure might just be my bad luck, but I would have NEVER bought this machine if I had known that I could not swap out a part as prone to failure as a SSD hard drive.  Do yourself a favor and avoid this sort of risk.PROBLEM:  The hard drive on this machine is failing.  Getting \"blue screen of death\" in Windows. I also run Ubuntu Linux and getting intermittent shut-downs with \"I/O error at sector XXXX\" reported as the system fails. Most recently the PC has started to boot up into the BIOS screen and not recognized the internal hard drive as a boot option. My best guess is the SSD drive has failed (after only a month or two of use).", "Date": "September 23, 2012"}, {"Title": "Love the Laptop.  Only lost a star because of mouse pad", "Author": "Anthony C. D. \"Tony D.\"", "ReviewID": "R3BMN1KHVAB08T", "Overall": "4.0", "Content": "I really love this laptop.  I first purchased the 13 inch version.  I loved it so much that I bought a second one (11\") for my wife.  both of them are super fast.  Resume time is always 2 seconds so it makes it awesome for travel and quick starts.  Restart is only 20 seconds.  Killer travel machine.  Plan on getting a bluetooth mouse.  The mouse isnt the best.  I use it but it should loose a star or 1/2 star for the mouse.  Love them both. I got 25% off retail price during the 2011 holidays.  Makes it a no brainer.", "Date": "December 30, 2011"}, {"Title": "Great Product", "Author": "Techenthusiast", "ReviewID": "R1UITBQLRKMTEC", "Overall": "4.0", "Content": "Ok, so honestly i have been in the market for a super fast yet portable and light tablet or a laptop for the past year. I started off with an IPad and returned it, bought an Acer Iconia Tablet, and found no use for it, and then tried the Samsung Galaxy Tab that i thought was worth keepng for 2 months and ended selling it.  Ultimately giving up on tablets, i decided to look into the new ultra light notebooks with SSD and Windows 7.  Spent 5 days doing research and ultimately decided to buy the Asus Zenbook UX21.  And guys i have to say from the monent i opened this puppy to literally wiriting this review i am enjoying this laptop more than any of the tablets i tried in the psat.  I read many negative reviews about the multi-touch funtionality for scrolling up and down and quite honestly i think its pretty decent after the update.  Also what i found is if it tries to zoom in and out jot down the Ctrl+0 combo as that will bring your screen back to the 100% view to fit your screen.  This sweet looking baby comes at a premium but i think i have found what i am looking for and this will suffice the purpose.  I think i am set for a while!  I highly recommend this product for people tht are looking to surf, type, listen to music, and watch movies!  It works like a charm havent experienced any major lags.  It took a while to completely update the hardware and software, but its well worth it.  It's better to have frequent updates than waiting for months and months like the tablet market space.My lenghty 2 cents!", "Date": "December 25, 2011"}, {"Title": "Not bad for one of the first Ultrabooks.", "Author": "jeremetron", "ReviewID": "R2RZSU9AJDLW4S", "Overall": "4.0", "Content": "I bought this computer because I needed something a little more powerful than a netbook. It's easy to say that the ux21 is a Macbook Air(MBA) clone... but keep in mind that Asus basically invented the netbook market(which the MBA is arguably trying to fit in to) and also the \"seashell\" design. I believe the i5 version of the ux21 has very similar specs as the low end 11 inch MBA but at a slightly cheaper price tag. Keep in mind that Intel is coming out with new processors around mid 2012 which should be faster, use less power, and also less expensive so expect faster \"ultrabooks\" next year with better battery life and better price tags.I really love this computer but I have few qualms...Most important is the short battery life. The battery lasts around 4-5 hours, which I've heard is comparable to the MBA but I've personally used the 2nd generation MBA and I found it's battery life to be closer to 5-6 hours. BUT, on the other hand the ux21 has a feature Asus calls \"Instant On\" which allows the computer to restart in about 12 seconds and return from sleep in under 2 seconds(both times are better than any Macbook I've used). If you are not constantly using the computer and you set it to sleep after a few minutes this will save a lot of battery life.The glass trackpad is really nice and almost identical to the MBA(the entire trackpad acts as one large button that you can click anywhere, but it still has a designated left and right mouse click at the bottom of the pad) but it doesn't seem very accurate. I tried playing with different speeds of the mouse but it just doesn't feel right. It's kind of hard to describe but it's definitely the only real bad thing I can think of besides the battery life. Hopefully this can be fixed with a driver update.Pros:-cheaper than a MBA-build quality-all aluminum(except keys)-nice trackpad-runs Windows-extremely fast startup/wakeup time-two finger scroll with non-customizable gesturesCons:-battery life-get's pretty hot/loud while playing 3D intensive games  -Team Fortress 2 runs fine but VERY hot/loud  -Minecraft runs very choppy... which stinks because it's fine on the 2nd generation MBA-trackpad responsiveness is a little weird-it's easy to miss certain keys while typing-still a hefty price for a laptop-a little too similar to the MBA in design", "Date": "November 12, 2011"}, {"Title": "perfect mba alternative for win", "Author": "LV", "ReviewID": "R2QBGY3A8NF4OA", "Overall": "4.0", "Content": "Coming from a July 2011 MBA, I purchased this UX21 as a replacement and have no regrets. The other \"ultrabook\" choices are ugly or not as good. Toshiba Z830 is the only other one i'd consider in the US mkt atm. There are newer models in Asia that I haven't looked into yet.If I were to buy a laptop over again, I'd consider the 1.8ghz ver. This PC is bottlenecked only by CPU and GPU. I was able to run PS CS5 fine on a project with 8 layers but it had some occasional display inconsistencies.First, I have not experienced any of that audio jack problem some people claim. This PC is works just as you'd expect any new purchase to work.Pros vs MBA:1. much better hardware spec than MBA. The SATA III SSD rocks MBA's at a base level. Win 7 is clearly heavier. If they both ran OSX, this build would be faster. 128GB HD is a definite plus even with the default OS taking up a lot of space. 64GB runs out really fast. navigating the OS, I found the UX21 to be snappier. It's more Win 7 animation, slow fx, and more process loading that make it seem slower at times, such as during boot. you could always load a new OSaudio was nice. need headphones to really tell the quality difference.ppl seeing the UX21 for the first time found it very sleek and stylish. doesn't loose to mba at all in its own way. i like the spun metallic look.2. lid & display do not smudge nearly as often as MBA. i like things clean and MBA almost always needs to be wiped constantly cuz even closing the lid, smudges from the keys to the lcd appear so you have to wipe both.3. compatibility is a big plus. Some network printers output garbage when printing with the MBA. different disk format is not really effective for cross-OS file transfers. dealbreaker though was the WiFi. So many troubles with picking up networks and logging in. Finally, I found that Lion doesn't accept WEP networks for certain applications. It will only read WPA networks. The lack of a decent OS restore method killed the MBA for me. If you have other Apple product, you might have enough to put together a bootable USB, but this is my first MBA. There's no OS disk! I was downloading the OS via Internet Recovery but after it failed the first time following a couple hrs, I was not doing it again. I'm traveling often so I can't change network encryption or sit there waiting for an OS recovery. This led to me returning the MBA.Cons:1. The touchpad...sucks. It's decent as in it works. But on a scale of 1 to 5 vs MBA touchpad, this is a 1. Enabling drag locking makes it usable if you're used to do 2-finger drag actions. Otherwise it will read it as a rapid cursor relocation.2. The keyboard has no backlighting!! o.o I didn't find any problems typing though. Of course, you can't type as quickly since these are more stiff, but you can't really type that fast on such low profile keys anyway.3. MBA's power adapter is actually a lot better. At first glance, it just appears to be a fancier look, magnetic strip for plugging in, but if someone trips on the wire, the MBA cord tends to fly away, preventing drops. This is my biggest problem with the UX21 right now next to the touchpad. Both need to be improved ASAP.4. the UX21 lid is a lot tougher to open with one hand. the positive aspect of the stiff hinge is that the display will probably never flop in the next X yrs. I've gotten used to it but the inset groove from MBA is clearly a better design that the protrusion lip of the UX21.5. might be my imagination or windows chrome problem, but chrome flash plug in crashes a lot more than mba. i'm considering a clean reinstall or switch to linux to compare performance change after i store a backup", "Date": "November 23, 2011"}, {"Title": "Fatally Flawed", "Author": "kenryan", "ReviewID": "R1BAPMME6JX5XX", "Overall": "3.0", "Content": "I had high hopes for this machine. It is truly a beautiful work of art. Very stylish, seems to just ooze quality ... but... unfortunately the WiFi is terrible. I tried everything to get he WiFi working acceptably, but never could get it reliable. If I were rating WiFi alone, I would give it one star. The other big problem is the keyboard. It must be struck exceptionally hard or the character won't register. I thought I would adapt to this, but after a week and lots of typing it continued to be a problem. In the end I reluctantly returned it. I wanted so badly to keep it but the WiFi and keyboard issues were constant and serious irritants. Dang!", "Date": "April 14, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core i5-2467M\n4GB DDR3\n128GB Solid State Drive (SSD)\n11.6-inch HD display (1366 x 768)\nWindows 7 Home Premium 64-bit", "Name": "ASUS Zenbook UX21E-DH52 11.6-Inch Ultrabook (OLD VERSION)", "ImgURL": "http://ecx.images-amazon.com/images/I/41qjKELEpnL._SX300_.jpg", "ProductID": "B005UF6G80"}}