{"Reviews": [{"Title": "Samsung Series 9 > Macbook Air", "Author": "Drew C. Davies", "ReviewID": "R2P0M82QXNL8AU", "Overall": "5.0", "Content": "Alright, I wanted to be the first one to review this specific version of the Samsung S9 so here I am. First off, I'd like to say i'm a college student that was in need of a solid Laptop, as i'm majoring in Graphic Design next year. I researched this product endlessly before I bought it, and after working with it for some time I wanted to write a more full review than from what I've seen.My Experience: I'm 20 and have been using a PC my whole life, I was glad to see an Ultraportable Windows computer on the market. I am extremely skilled with W7, and have no biases against the Mac OS X having used it as well. My main reasoning behind my decision by choosing the SS9 over the MBA (Macbook Air) is my skill with W7. If you are a dedicated Mac user I wouldn't bother reading my review at all, buy the MBA V2 (second generation). Whereas the SS9 seriously out-specs the MBA V1.The Design: To kick my review off I'm going to get into the design first. Destruction, this Laptop destroys all other PC's design in a single look, but this isn't anything new. The duralumin is clearly strong, lightweight, and clean. I've read complaints about it being a fingerprint magnet, however, I haven't had any issue with fingerprints. Personally, I don't have a lot of oil off my hands and am generally a clean person, I'm not sure if this is the issue constituting that argument. And even if you do have this issue the laptop is black, not much shows up, and if it does it's an easy clean due to the material. One of the things that makes this laptop for me, ontop of the matte screen, is the ability to hide the ports on the side. Not only does it increase portability and look cool, it protects your ports from damage and dust.The Keyboard: If you've used a Macbook the keys are extremely similar in feel and are of high quality, however, completely different in usage. The SS9's F key options were utilized well in development, by pressing Fn and F1 it brings up a management screen specifically designed for this Laptop. In the application, you can alter the Wi-Fi, turn on \"Silent Mode\" + Bluetooth, adapt brightness, change the levels of backlight on the Keyboard and even set the backlight to turn off after a predefined amount of time being ideal (to save battery). Also, there are options to turn on \"Battery Life Extender\" which boosts the battery's life and minimal performance cost. And Lastly, there is the option to turn on \"Fast Start\", which shuts down the computer momentarily when you close the lid to save battery and starts up in 3 seconds, \"Chargeable USB\" which can charge your iPod or any other USB connected device while the SS9 is off, and \"Movie Color Enhancer\" which increases all movie displays. All of these options are simple and easy to adjust(Fn + F1). As for the rest of the F key options, now that I'm done explaining F1, are even better. F2 + F3 increase in decrease screen brightness, F4 easily changes external display, F5 disables touchpad, F6 easily turn on and off the \"Battery Life Extender\" that was also accessible in the F1 menu, F7 + F8 increase and decrease Keyboard backlight, F9 mutes the audio, F10 + F11 increase and decrease audio, and F12 is the Wi-fi. Needless to say it's extremely usable.The Performance: The i5 processor coupled with the SSD makes this Laptop the fastest one I've used. The system does come with pre-loaded applications, therefore, it's necessary to uninstall them. If you're not sure what to delete simply google it, if your SS9 detects something important was deleted, such as a driver, upon startup it will prompt you to re-install it easily. If you don't want to deal with this you can purchase this laptop from the Microsoft store and purchase their plan to wipe the system of useless programs, I've heard it was nice especially considering the limited storage space.The Wi-Fi + Tracpad: I've brought this up on concerns for the bad Wi-Fi and Tracpad issues, which were something I watched for as I purchased the SS9. Currently, I'm typing this as far away from the router as possible, across the house on the second story, and have honestly had no issue. Occasionally the Wi-Fi bar at the bottom will read it's low, however, if i click on it and it displays the connection it shows much higher bars, and I notice no difference in the speed even from being right next to the router. I'm not sure if this issue is exclusive to only some models however, I could easily use the stressed Wi-Fi I'm using now for schoolwork, intensive projects, or media streaming. I say \"stressed\" Wi-Fi only due to the distance from the router not the performance. Overall, I'd keep an eye on this issue when you first purchase your Laptop but from my experience with mine this is a folk tale in my mind. As for the tracpad I am more of a mouse person, the Samsung 2.4GHz Mouse looks and performs great with my SS9. However, despite my lack of the issue if for some reason god hates you and this happens to you, just re-install the drivers, it's not an issue concerning the actual tracpad itself. The way I see it this is a quick fix even if you experience the issue, nothing to defer you away from the product.If you're a skilled Windows user and you're looking for an Ultraportable laptop, don't be swayed into the slim Macbook Air you can grab at bestbuy, because eventhough you can't touch it the SS9 destroys the MBA is looks. This is something you've got to see. They SS9 and the MBA (VERSION 2) have the exact same processor, 128SSD, Intel HD 3000 Graphics, but the SS9 sports a 400nit display (brighter) and has duralumin exterior that's not only awesome looking, it makes your Laptop LAST. For me, I was satisfied with my order. If you have any questions or concerns please post a reply to this.I'll add onto this review as I use the laptop more. Hope this review helps.UPDATE AUGUST 9TH 2011Now that i've used the laptop even more I do have some things to add to my review:I've sent back my Samsung S9 NP900X3A-B01 but for one reason; hard drive space. I just bought the Samsung Series 9 NP900X3A-B02 13.3\" which has 256GB of SSD space. Honestly, I could have worked with the 80+GB SSD especially considering my organizational skills. However, I felt that more space would give me room to stretch, as I am using this computer for college.If you're not willing to pay for the extra SSD, see my \"Other Thoughts\" section below.SIDE NOTE: (The SSD upgrade from 128GB to 256GB did cost me more money $1,303 compared to $1,635. However, if you're in the market for a Macbook Air and you want the increase in SSD space as well you'll be paying about the same for the extra hard drive space) -ofcourse i'm talking about Gen 2 MBA.I've uploaded wireless information that I used on my old SS9 to all of you here reading this, in hopes that if you do occur the WiFi issue this can be a quick fix for you. Here are my WiFi settings:Intel(R) Centrino(R) Advanced-N 62302.4 Band - 20 MHz Only5.2 Band - AutoN Mode - Enabledad Hoc QoS Mode - WMM DisabledFat Channel Intolerant - DisabledMixed Mode Protection - CTS-to-self EnabledPreferred Band - No PreferenceRoaming Aggressiveness - 4. Medium-HighTransmit Power - 5. HighestWireless Mode - 6. 802.11a/b/gDriver Date 1/4/2011Driver Version 14.0.2.2Now if you're not sure how to get to these settings got to: Control Panel> click \"Category\" in the upper right corner, and select \"Small Icons\">Device Manager> WiFi Adapters> Under it should list your WiFi card (Intel(R) Centrino(R) Advanced-N 6230)>\"Advanced\" tab>And you're there.SIDE NOTE: Make sure to first Check to see if your Driver Version is 14.0.2.2 if not you can easily update it by simply clicking \"Driver\" right next to the \"Advanced\" tab, and updating it there.I also recommend routinely checking for WiFi driver updates.My long Story: A few weeks ago my WiFi was incredibly slow, my SS9 was struggling to even get up webpages. So I go downstairs and hard wire my SS9 directly into my router to see if i saw increased speed...(cuz i'm a bit scared my SS9's WiFi was ready to leave me) and it was just as slow. My brother came down and asked why his desktop was struggling and when we resolved it, our Internet Service Provider (ISP) was failing hard. My point in telling this story was that if you do occur some WiFi issues with the SS9 it's not always the laptop itself, which is why I think I see so many harsh reviews on it.To this day I have had no issue with my WiFi. (that was the 1 time).Other Thoughts: Everything is running smoothly, just as it should, I do love this laptop and honestly there's nothing else to say about it. However, I would like to show a few tips i've learned:The Mouse: A few tips I would like to add is directed to mouse users like me. I recommend buying a Bluetooth mouse for your SS9. It will enable you to really harness the portability of this laptop (because you do not need to remove a USB port to operate it). I just open my SS9 in the sun or wherever I want to work and turn on my mouse.If you're not willing to pay for the extra SSD there are other valid options to this problem if you have them. Buying an external portable HD can instantly solve your HD issue. I recommend a 500GB to 1TB.Another option is to simply grab a 16GB - 32GB - 64GB Flash Drive. I bought a 16GB, which provides me with enough space to move anything I want. Usually, I will keep files I'll need soon on my Flash Drive and archive larger ones in my external HD. It's up to you.I'd put more in here but I'm bored. I'll update when I feel like it. hope my review helps and thanks for reading.UPDATE AUGUST 10TH 2011I noticed some prices on several Samsung Series 9 Models and realized how mis-priced some of them are so I wanted to talk about the deals available for the given prices concerning each individual model:NP900X3A-B01  128GB SSD - $1,300NP900X3A-A02  128GB SSD - $1,610NP900X3A-B02  256GB SSD - $1,645NP900X3A-A03  128GB SSD - $1,440Essentially, the best deal by far is the B02 with 256GB SSD which matches the A02's price range. However, I think the A Series offers 3Year Warranties, which if you're clumsy might be good for you, but for the rest I would recommend the better model.NP900X3A-A05  256GB SSD i7 Intel - $1,980If you can afford it the A05 is an incredible machine, it's out of my price range and if you're going to get a laptop with specs like this one I wouldn't recommend it. This is not a solid gaming computer only due to the integrated Intel HD 3000 graphics card. I say this because there is no reason to run an i7 processor unless you're gaming, anything less that gaming does not constitute the price increase.", "Date": "July 26, 2011"}, {"Title": "Samsung series 9: how to resolve the WiFi issue", "Author": "AT", "ReviewID": "RR4ZFD2M93SLD", "Overall": "4.0", "Content": "I was shopping for new laptop and decided that I want one with SSD - much faster, lighter, quieter and consumes less power. The choices were: ss9 and MacBook Air. After reading all negative reviews about the horrible WiFi issue with the ss9, and also some display flickering, I chose the Mac - beautiful HW, but took me a couple days to realize that I'm not a Mac OS person.So I ordered the SS9, despite all negative reviews. It holds its ground really well against the MBAir, and even aesthetically looks better, except for the surfaces - fingerprints stains all over. However, the WiFi issue was still there: ~1/10 of other laptop's bandwidth test in downloading speed, and terrible reception. I was sure in my gut that they simply used poor quality antenna, because the Intel WiFi adapter is top notch...To resolve the WiFi issue: go to Samsung website and download under \"Drivers\" tab WLAN_Intel_64bit_14.1.1.3 - COMPLETELY RESOLVES THE WIFI ISSUETo resolve the annoying auto dimming of the display: press Fn+F1 and uncheck \"Adaptive brightness\"One more issue to be aware of: to replace the battery you'll have to ship the laptop to one of their service locations (I know of one in Buena Park, CA and another one in TX). The replacement takes 5-10 biz days + the shipping. Doing it on your own voids Samsung's 3yr warranty. This really sucks due to 1)the long time w/o your favorite tool, and 2) you'll have to remove all sensitive info from the computer, including your cookies, browsing history and saved passwords, and then put it all back. I wish they had a batch file to perform all that for you.", "Date": "September 21, 2011"}, {"Title": "A great mobility, design and performance in a single tiny laptop", "Author": "Daniel", "ReviewID": "RZXKDFGFFKNCR", "Overall": "5.0", "Content": "My job supposes a lot of mobility. Have few offices to visit regularly, sometimes have to work virtually anywhere (outside of the Town, in my car, in a plane etc.) At the same time I need my work device to be able to run graphical and sound software (which might be quite demanding in terms of performance). I have to say Series 9 totally handles my every need. Here's the list of pros that in my opinion make this laptop the best of ultrathin mobile laptops at the moment:* Incredibly fast boot: it boots whithin 3 seconds if in sleep mode, and less than 15 seconds if shut down allowing to start working immediately.* Lightweight, slim and slick. Can carry it wherever I go. I'm not really the guy loving to show off with my stuff but no matter whether I want it or not, it does attract other's attention.* Really bright screen: my previous laptop (ASUS M50VM) had a real dim display and it was glossy making it a real pain in the ass when I tried to work outside, uptown, breathing fresh air. The display at S9 is bloody awesome, you can work with sun shining right into it and still be able to see everything.* Powerful and blazing fast: can run graphical software (like Photoshop or Flash), sound software (like Audition or FL Studio) 2d and 3d games, and because of SSD and USB 3.0 file management (copying/pasting internal/external) is really fast.* Quiet. In some reviews before buying I read that it makes a lot of noise. It's not true: even if I put my ear right to it I hardly can hear the sound of coolers.* Backlit keyboard. Too late, Apple.* It's not MacBook Air: explains itself.Now despite all pros there still are few cons (which is normal), and if these are cruical for you, you should consider another laptop.* Really bad touchpad. I never noticed how the touchpad was working on my ASUS M50VM until now. It's said that you may not notice good thing until it's gone. The touchpad is Achilles' heel of Sammy's Series 9. You might accidently touch it while typing. In fact as I was typing this I had to return the cursor in the right position for about 5 times because of this. Of course this isn't a problem when you use mouse, you can disable touchpad with an Fn+F5 key combination. But when you hold the laptop on your knees usually you don't have how to use mouse. It was a bad decision to get rid of touchpad buttons. You have to look at touchpad every time otherwise you can just hit the wrong mouse button. Working with MS Visio or other stuff that requires a lot of mouse becomes hard as a hell. I really hope they will find a way to fix this with driver updates.* Not quite good sound speakers, but it's not a big deal. When I want to listen to quality music I either wear my Beyerdynamic DT-770 headphones or use my KRK RP6 studio speakers. I don't expect the tiny laptop sound like a cinema theater. It's loud enough and that's enough for me.If these two things are not a huge problem for you (as they aren't for me) this is a great choice in terms of mobility and performance. Besides you get it in a really cool packaging.", "Date": "August 17, 2011"}, {"Title": "Great machine except....<UPDATED>", "Author": "Max G. \"MathGuy\"", "ReviewID": "R3GDQD96S60BDP", "Overall": "3.0", "Content": "This machine is loaded with terrific features. It boots incredibly fast, the display is amazing, and the keyboard response is wonderful.  The touchpad did take some getting used to, but wasn't a big deal.However, I cannot recommend this device for one reason:  the blasted power cord doesn't attach firmly to the laptop. When I pick up the laptop, it falls out.  When I move the laptop, it falls out.  When I close the lid, it falls out.  Sometimes it just falls out for no apparent reason.  Worse, sometimes it doesn't fall all the way out, but it just kind of hangs there, not charging the battery. This is especially annoying, since there are no indicators that the machine is charging when the lid is closed.  Thus, I have closed the lid, the power cord has jiggled and disconnected, and the next morning my laptop isn't fully charged.This is incredibly bad design in a machine that is otherwise superb.<UPDATE>About 3 weeks ago, I started having the wireless problem other users have noted.  I went to the online help provided by Samsung to report both the wireless problem and the problem with the cord.  I spent a frustrating hour there, with instructions like, \"plug the cord FIRMLY into the machine.\"  Annoyed, and not expecting much, I called the 1-800 number for service the next day during business hours.  I am pleased to report that this worked out extraordinarily well.  The person on the phone line was helpful, courteous, and prompt.  Within 15 minutes I had a return authorization for both problems.  Ten days later, I have my machine back.  Both problems are fixed.  The cord no longer falls out, and the wireless is impeccable.  I'm now again delighted with my laptop.My only reservation is with the build quality; I've owned 8-9 laptops previously, and this is the first time I've had to send a new machine in for service.  This is a great machine, now that it's working...but for over  $1000, shouldn't it have worked in the first place?", "Date": "November 4, 2011"}, {"Title": "Excellent laptop with 2 major drawbacks", "Author": "Joseph Namey", "ReviewID": "R34I1X39GFH90A", "Overall": "3.0", "Content": "-The Trackpad: It sucks. No driver updates have changed that. It's not that it has a problem distinguishing between gestures, but it seems to lack any sort of sensitivity. No, I do not mean mouse movement speed, I mean the accuracy of it detecting fingers present on the pad. I have a 5 year old laptop that you could glide your fingers across and the mouse would move accordingly. This one only seems to pick up fingers gliding near the center of the track pad, leave the center and it actually requires some pressure for it to pick up your fingers. Considering that the track pad is central to a laptop, this is incredibly disappointing.The only gesture I really have a problem with is scrolling up and down. There is major lag between the time you scroll with your fingers and the time it takes the page to scroll. You will either scroll too far or not far enough because of this insane delay.-The Screen: I understand that Samsung decided on a matte screen for anti glare, but on a laptop that is designed around aesthetics, it's hideous. There is a distinct lack of clarity which becomes increasingly noticeable on lower brightness settings. I thought ClearType was disabled when I bought it, but it turns out that is just how to the screen works. Want to simulate it on a glossy screen? Go turn ClearType off and look at the jagged artifacting around the text on the desktop icons and various windows. That is what a matte screen looks like all of the time.Now for the positives:-Battery Life - The laptop has three power modes you can choose with the fn keys. Power saver, balanced, and max performance. On power saver, I get an average of 5-6 hours of battery life with wifi enabled.-The Keyboard - It has very quiet and sensitive keys. I find it very enjoyable to type on.-The Duralumin Body - Other than the fact it looks awesome and is very light, everything about the body styling is perfect. The screen closes and opens smoothly, the edges are nicely tapered, and it feels much more solid than the mac book air without being much heavier.-Runs Cool - it won't warm your lap. After watching a 2 hour movie with the fan partially obstructed by my blanket, the bottom of the laptop is barely warm.-Very quiet - because of how seldom the fan comes on, and because of the solid state drive, the laptop is virtually silent under all conditions.-The Wi-Fi- I haven't had any issues with Wi-Fi connectivity. Supposedly it has been resolved with the latest drivers.Bottom Line: Get a portable bluetooth mouse, if you can stand one, and the laptop is easily the best ultrabook out there.It gets 3 stars, because to me, the trackpad is the center piece of the laptop, I hate carrying around extra stuff, and needing a mouse for a laptop is absolutely ridiculous. The trackpad apologist reviews are saying you know, \"oh you get used to it\". No, the lack of any consistency with mouse movement is not something you simply get used to.", "Date": "February 15, 2012"}, {"Title": "A few things not mentioned in other reviews....", "Author": "Tinoskier", "ReviewID": "R1VN47ZDS4AI5C", "Overall": "4.0", "Content": "I just got the NP900X3A-B06US from the Microsoft store.  I will not reiterate everything, but it is indeed beautiful, tiny, and well equipped in terms of power. A few things I felt that were missed or not emphasized in the dozens of reviews I saw....Form: The computer does NOT have a true unibody case like the MB Pro or Air (sorry to jump right to the comparison). It is a great design, but bottom is plastic, with the duraluminum only on the lid and the keyboard/palm rest. Rigid enough.Screen: Although only 1366 x 768, the screen is beautiful and the 400-nit makes it extremely bright. It is striking.Keyboard/tracpad: I see a lot of complaints here, but I love the chiclet style keyboard. Tracpad has been great so far.Wifi: NO issues. Have connected to multiple wifi networks, public networks, streamed HD video.  Wifi issues seem to be resolved with the B models.Warranty: Only 1 year, previously posted here, but don't let someone tell you otherwise. Replacing RAM or SSD will void your warranty (yes, also true). Good news is since the warranty is only one year, you won't be voiding much.Also, the new series 9s have been announced.  Slightly different design, same innards (sandy bridge chips, 4GB ram, same size SSDs) but higher res display and possibly a 15 inch model!  Should be out mid spring if you can wait, otherwise pick this one up for cheap somewhere. I am enjoying mine.", "Date": "January 10, 2012"}, {"Title": "The true \"Windows Air\" ultraportable", "Author": "H. Friedman \"soulhealing\"", "ReviewID": "R2PKL4N7OJ135Q", "Overall": "5.0", "Content": "After researching ultrabooks and ultraportable laptops for weeks, I decided upon this Samsung series 9 because it has the best screen, the lightest weight, a great keyboard, and a fine processor.After receiving it, I went to a brick-and-mortar store and further compared ultraportable models, and this one is clearly the best. It is incredibly light, powerfully built (with a Duralumin shell), and has a stunning screen. The keyboard is the best, and the trackball -- with the latest driver updates -- works like a charm.None of the other \"ultrabooks\" comes even close to this one, which is why it has been given the moniker, \"the Windows Air\" It has the same or better quality as the MacBook Air in all categories, and starts up lightning fast, and has a long battery life.As a person who has built his own PCs, is a software reviewer, and who knows his way around CPUs, refresh rates, etc. I give this PC my top recommendation.", "Date": "December 6, 2011"}, {"Title": "Small, sleek and \"sexy\"", "Author": "James Nordman", "ReviewID": "RFFPVGR2I0DO7", "Overall": "5.0", "Content": "I've been wanting a Samsung 9 since they first came out. Finally, my Dell M1330 (may she rest in peace), gave up on me and it was time to go shopping. I researched all of the new ultrabooks and strongly considered a MacBook Air but I settled on the Samsung for a number of resons.1) I really wanted a full SSD as my primary drive - not a combo HDD and SSD (like the ASUS)2) I love black laptops, I personally don't think that laptops should come in any other color3) A bright screen was very important to me4) Of course, I wanted something light and easily portable since it goes back and forth to work with me5) Mac's are great but I'm partial to PC's. I like tweaking nearly every aspect of my computer.I read a lot about it, I visited it in the store a few times and even did some price comparisons to make sure I could get the best deal for the money I wanted to spend. So here's how all this turned out:Speed - The SSD is amazing! Coming from HDD's, this thing takes nearly no time to boot up.Aesthetics - It's a great looking machine. It has a very thin profile (in some cases, smaller than most ultrabooks) and I've received compliments on it at work. My boss says it's \"sexy\". Yes, it does attract finger prints but it includes a microfiber cloth and I don't mind cleaning it.Heat - Wow, my last laptop would get so warm that I couldn't have it on my legs after a while. This seems to stay cool throughout its use.Battery - A little disappointing in the battery area - I ended up with about 4 hours of run time. Some of that is due to me tweaking the WLAN settings (see below). I'm usually plugged in so this wasn't a huge area of concern for me.Setup - Bloatware is definitely an issue, it took me about an hour to remove it all but I don't really count that as a con. I enjoy doing things like that.Keyboard - The backlit keyboard is handy for those of us who may work while watching a movie in the dark. The keys are more spread out than I'm used to and I'm sure that I'll eventually adjust.WIRELESS - Ok, so here's the really important part... If you research \"Samsung 9 Wireless\" you will see a number of complaints regarding the speed and reliability of it. I was very concerned as most of the networks I connect to are wireless. I unboxed it and tried a few different things to test it out. Plugged-in, battery, xx number of feet away from access point, etc. What I discovered was that the only times I was receiving a weak signal was when I was running off of the battery. I changed the power settings to provide maximum performance to the WLAN card even when not plugged in and everything was smooth sailing after that. I did several tests with speedtest.net to verify it was working as it should.Screen - It's bright, it's nice, it shows what I'm doing - I'm not sure what else you'll need after that.All-in-all, I'm extremely happy with my purchase and hope it'll last me as long as my Dell did (about 5 years).", "Date": "February 4, 2012"}, {"Title": "Got rid of my ipad and two other laptops - great device", "Author": "Joe Boyce", "ReviewID": "R2M4I74CAUA9OS", "Overall": "5.0", "Content": "Have had this \"Win 7 Mac Air equivalent\" for about a month now.  Highly recommended. It's fast, boots quickly, wakes up in <2 sec every time, and has great usability.  Keyboard, screen, usability are all fine.  Battery life gets me through the day since I can put it to sleep just by closing lid and wake it back up 20 minutes later due to the SSD.  I'm moving most of my storage to cloud so not too concerned about 128 g SSD. Only thing I'd like is a VGA port for presentations (you have to get a mini HDMI dongle) but otherwise this device has allowed me to get rid of two other laptops (one a Powerbook, one win7), and an ipad.  It's just so much easier to browse the web without worrying about ipad feature gaps, not to mention flash.  No issues with wireless connectivity I've seen on other posts.Looking at this device for enterprise deployment and really glad to see some alternative to the Mac Air for mobility.", "Date": "December 14, 2011"}, {"Title": "not flawless but close", "Author": "desertfox \"desert fox\"", "ReviewID": "R32W288YP0DVGY", "Overall": "4.0", "Content": "I can have any computer I would like, thanks to my jobs. I use 3 or 4 on a daily basis. My personal machine is a MacBook Pro 15\". I was looking at MacBook Airs over the years and they seemed to be fitting my needs more and more. I use several Windows 7 machines for work, and when it came time for a new laptop, I found the Series 9.Love it. Love the super-bright matte screen. Love the keyboard backlighting. It is a faster, more capable MacBook Air running Win7.Even the box that this machine comes in is sexy! There is a certain profile of users that these ultra-portable machines are perfect for. I do not need an optical drive nor do I need huge internal storage. Trackpad is probably the best I've found on a non-Mac laptop. MicroSD card slot is OK for me but full sized SDHC would have been way better, considering the door cannot be closed with a MicroSD inserted anyway. SDHC has become my media of choice for backup/archive.Connector for gig-Ethernet dongle is touchy - would have been way better to have a LOCKING dongle or the RJ-45 built right in. Haven't used the microHDMI yet. USB 3.0 is cool although I don't have anything USB 3 yet. USB 2 port charges attached device even if laptop is asleep or off. Sound is freaking unreal for 1.5W built-in speakers. Bluetooth 3 works great for keyboard, mouse, cell phone, everything I've tried to attach. It attracts fingerprints but this is a minor and ubiquitous symptom. The LED that indicates charging is not visible with the lid closed. Very fast boot and very fast awake from sleep. All this comes at a pretty steep price, even more-so than the MacBook Air! Might have to get another with i7 processor...I fixed the trackpad issues with multi-touch and scrolling not working by leaving the trackpad control panel open on my desktop. Kludge but works great...", "Date": "November 19, 2011"}, {"Title": "Beautiful, Great Performing Laptop with Average Battery Life", "Author": "Nayab", "ReviewID": "R3R3VNKDDPLXU6", "Overall": "4.0", "Content": "I bought this Series 9 as a refurbished model via Amazon Warehouse and it was one of the best investments I've ever made. The laptop is beautiful and performance is great. The WIFI card is weak but it is easily remedied with a cheap $10 USB WIFI adapter. The other problem I had was battery life which is only 4-5 hours. But these problems aren't enough to drown the beauty and performance of this lightweight and durable laptop.", "Date": "August 14, 2012"}, {"Title": "Samsung Series 9 NP900X3A-B01 Laptop", "Author": "Steeler Fan", "ReviewID": "R15RKXD30B9JAU", "Overall": "5.0", "Content": "Ordered the Laptop through Amazon and received within one week.Laptop if very light and turns on and ready to go in less than 8 seconds.The wireless connection is a little weak for longer distances, since the laptop works best when the smart phone hotspot is in the same room, otherwise the laptop works well.I would recommend the Samsung Laptop for someone who needs a light laptop with a SSD drive.", "Date": "March 20, 2012"}, {"Title": "Liking it!", "Author": "MM", "ReviewID": "R2B1KKPLSTHRQ6", "Overall": "4.0", "Content": "I got mine from the microsoft's online store for $999 with a $200 coupon so its a much better deal than the one here.So far I really like the laptop. Its really light, feels well built unlike a couple of the ultrabooks I have looked at. No wireless issues yet, but I live in a two bedroom condo with the router in the middle of the house so you never know.The touchpad was a bit funky out of the box but now it feels nice. Hopefully I won't get the bugs other people found overtime.The SSD makes it boot pretty fast, installations are a breeze too.", "Date": "March 15, 2012"}, {"Title": "Extremely Lightweight and Portable", "Author": "R. Garza", "ReviewID": "R2OPLEQHJXISWT", "Overall": "5.0", "Content": "I buy a new laptop almost every year for about 10 years.  This is my favorite so far!  Obviously the weight and dimensions are my favorite, but the flash memory hard drive is awesome.  There are no moving parts inside so it's ultra quiet.  If I had to tell you the worst part about this laptop, it would be without a doubt the USB ports.  I don't mind having only 2, but I do mind how difficult it is to get the USB seated into the port.  Its tricky to get plugged in, but once its in, then there are no problems.  The computer is powerful enough for what I need, which is email, internet, and managing the family pictures.  It's pricey, but worth it!", "Date": "September 17, 2011"}, {"Title": "Great laptop", "Author": "Inx", "ReviewID": "R1DJUPH8C7Y416", "Overall": "5.0", "Content": "This laptop is very thin and fast. Bought for a friend and she loves it. She was so elated she hugged me many times and it is her first ultra-book ever.", "Date": "July 27, 2013"}, {"Title": "Everthing is great for the the most part...", "Author": "zjl23", "ReviewID": "RT2ILICXTMLX5", "Overall": "4.0", "Content": "First off I will say that I am not a serious computer guy by any means. I bought my computer for school work and browsing mainly. I bought the ultrabook for its fast boot times and nice construction. The Series 9 boots up and is on the internet in a few seconds...literally. The battery lasts at least 5 hours and I only charge it to 80% using Samsungs battery saving technology (it stops charging at 80% to make your batteries lifespan a lot longer). I have not noticed a decreased battery capacity in the 5 or so months I have had it. I bought it at Best Buy and I was debating between this and the Macbook Air. Both were very similar in specs as far as processor, size, weight, etc.I have had this for about 5 or 6 months and it is an excellent computer but not perfect and not on par with the macbook air and I will tell you why (in my simple opinion). The MAIN reason is the trac pad. I used both in the store and the Mac was by far superior in terms of feel and especially the multifinger gestures. The other thing that was better about the Mac was the case/frame. The mac did not show finger prints like this one and also this one has some rather sharp edges that can become uncomfortable when typing for a while(the newest series 9 model has a new case that has eliminated this and made the case look the same shape as the Mac). That being said the keyboard is excellent and probably better than the Mac because the buttons stick out a touch more and I just love the feel and the way that it types. The main reason I ended up choosing the Samsung was because I really did not want to learn a new operating system. I know Windows and I like 7 plenty good enough to have no reason to want to learn new things. Not to mention I got this for about 400 less. So all things considered, the Mac is a better built machine with a much higher price tag. I think it is worth it if you know and like Mac OS but this Samsung is certainly a good Windows alternative. It is fast, sharp to look at and it IS very well built...just barely behind the Mac. This computer will serve any normal person computing needs admirably with the only notable weakness being the mouse which annoys sometimes but is still acceptable and functional.", "Date": "August 26, 2012"}, {"Title": "Rather disappointed", "Author": "Ron F Brown", "ReviewID": "REACUG9EGMCQB", "Overall": "2.0", "Content": "I purchased the ultra light laptop as I travel internationally frequently and weight has become an issue.  Esthetically it is very pleasing and the backlight keyboard makes working in dark hotel rooms easy.I've had to use an USB drive to have the storage capacity needed which defeats the reason to buy the laptop in the first place.  I also plan of getting an USB mouse (wireless?) as the touchpad is either too sensitive or else freezes up on me and is very fussy on the location of the touchpad to left or right click.My real frustration is the keyboard.  The right shift key does not work, must be a defective unit, but I'm in Pakistan and stuck with it.  Since most strong passwords use upper case letters, I frequently have to try time and again to get a password typed in.I have to use work arounds like stop and use the left shift key, but it's eratic also.I must say the the sound is superb and the video is quite nice.As much as I don't like Apple, I wonder if it would have been easier to shift from PC to MAC.", "Date": "October 19, 2011"}, {"Title": "Looks nice, but has some major issues", "Author": "AnnieRoRod", "ReviewID": "RIVZMKKX987J9", "Overall": "2.0", "Content": "I was really looking forward to purchasing this powerful, ultra-portable laptop but was soon disappointed.  It looks great, but there are some serious problems that made me regret my purchase.  First, the wireless reception is very, very poor.  My husband and I can be sitting side by side on the couch and his Lenovo will quickly load pages while my laptop takes considerably longer (I'd say about 30 seconds to one minute) to load the same page.  This is a commonly-noted problem with this machine and I would assume that it happens more often than not.  In fairness, I downloaded Google Chrome and this problem hasn't been as noticeable now -- I'm not sure what it is about Chrome that sped up the connection, but this seems to help with the wireless problem.Another huge problem is that the power cord became very loose after about one month.  The plug does not click into the input jack and falls out if the unit moves slightly.  Even worse, the loose power connection does not charge the battery.  This goes beyond an inconvenience; this is a serious structural issue that warrants a major technical repair. I am in the middle of dealing with Samsung's customer service and don't have any major complaints with them-- but I would rather have difficult customer service if it meant that I had a more reliable computer.If I had known about these issues before, I would not have purchased this laptop.  I do not recommend that anyone purchase this machine until these serious structural defects are addressed by the manufacturer.  I did a lot of research prior to this purchase and was impressed with reviews from cnet and other laptop sites, but these reviews do not reflect the system's performance several months after purchase.", "Date": "November 18, 2011"}, {"Title": "Excellent. Refurbished one was good.", "Author": "jongbhak", "ReviewID": "RXW14IT064YRS", "Overall": "5.0", "Content": "The notebook is great. It is solid and fast. It was cheap as we bought a refurbished one. No problem.", "Date": "February 3, 2012"}, {"Title": "awesome laptop", "Author": "Xina", "ReviewID": "R3L9MX8ZCDV6VI", "Overall": "5.0", "Content": "its serves its purpose well. upgraded to 8gb ram. only thing that could make this laptop better is an i7 and a dedicated graphics card", "Date": "January 28, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0056EY8X0"}}