{"Reviews": [{"Title": "Wireless problems made it useless-Asus support gave up", "Author": "Monica", "ReviewID": "R3KNQ0XMEK6MWG", "Overall": "1.0", "Content": "Works beautifully if plugged into the wall.  On battery it disconnects every ten minutes or the second i plug in my iphone.  All the known power saving settings problems are addressed: setup F2 to latest defaults, latest wireless adapter configured so it does not let windows disconnect for power saving, windows 7 up to date.  Case 1778026 if other Asus techs are reading this.  The last Asus tech I got assigned to (I talked to three because they will not wait five minutes to see if their solution works) , who in all fairness did wait at my request, after seeing that her last attempt did not work, said that they could not do anything else about it.  When I said that there is no option for me but to return it then, she agreed, apologizing.  Replacement was not suggested, which leads me to believe that this is a known problem for which they do not have a fix yet.  I have two new $400 HP pavilions notebooks with same power working beautifully on my home network, with windows 7, albeit a bit uglier looking.  That tells you that it's nice for a notebook to be beautiful with all solid hardware, but does not do you any good if it cannot perform a basic function, in this case connect to wireless, consistently in the marketplace.  I'm glad I bought it thru Amazon, their return process is flawless.", "Date": "April 6, 2012"}, {"Title": "Excellent Laptop", "Author": "Buckeye Mark", "ReviewID": "R1XJWAR3TTOOP8", "Overall": "5.0", "Content": "The ASUS Zenbook has performed as advertised. The response times are fast.  The system boot-up time is within seconds. My frame of reference was a Lenovo T61 running Windows XP which had a boot time of nearly 5 minutes.I have experienced no issues with the keyboard.  The feel is different than traditional laptops since the \"travel\" distance is very shallow. But I required little time to adjust to the feel.  I also experienced no problems with the touch pad.  It seems that the prior issues must have been corrected.Overall a very light, stylish piece of hardware.", "Date": "January 31, 2012"}, {"Title": "Beautiful notebook", "Author": "Natasha", "ReviewID": "RWFNGU6DG555P", "Overall": "4.0", "Content": "This notebook is really light, solid, looks awesome. Touchpad is really good as is the sound. The faults: no backlit keyboard, the screen is not full HD and the big ammount of Asus programs.", "Date": "December 17, 2011"}, {"Title": "Don't think... just BUY it.", "Author": "alx", "ReviewID": "R21AN5RHRUC2D7", "Overall": "5.0", "Content": "I've owned many laptops over the years. Still have and use most of them for one purpose or another. Each has its niche in my life. This is by far the BEST all around satisfaction machine of the lot. The culmination of current technology, battery, ssd, size and weight, instant-on, finally makes for a laptop to fit the dream of a near ideal machine.Buy it - you will LOVE it.", "Date": "January 15, 2012"}, {"Title": "Fantastic Laptop", "Author": "Dan S", "ReviewID": "RQY3ODOIDFE9Y", "Overall": "5.0", "Content": "I've had the laptop for 10 days and I love it. I can't believe how light it is and how fast it comes out of standby. I'm an application develop and bought this as my personal laptop, but I have loaded it up with CS 5.5 Web Premium, Visual Studio 2010 and SQL Server 2008. It handles them all with out a problem and still comes out of standby in 2 seconds. I have not had any problem with the keyboard or mouse. The high resolution display and sound are incredible for such a thin laptop.I do wish it had more ram and wireless N, Overall I am thrilled with this laptop and my friends are jealous.", "Date": "December 2, 2011"}, {"Title": "Deceptively Beautiful", "Author": "Hamid Thomson", "ReviewID": "R16AH47YBEOI0W", "Overall": "2.0", "Content": "On first look, the Zenbook is a gorgeous, sexy machine.  It is evident from the packaging alone, which resembles origami, that ASUS is striving to be the Apple of Wintel.  But they have a ways to go.  From the engraved model description at the top of the keyboard (in a typefont terribly mismatched to the \"ASUS\" logo immediately above) to the chinglish documentation to the fascinatingly cheesy entertainment portal, ASUS Vibe, the Zenbook does not bear close scrutiny.  Yet I still wanted to like the Zenbook... until the click started.  After warming up for the thirty minutes, a repeating two \"click\" noise would begin, roughly beneath the escape key.  The \"click\" was subtle, but spaced far apart enough and quiet enough to never become white noise.  Then, the wireless network connection began to fail, requiring reboots.  Soon after the internet connection failed even when successfully connected to the wireless network.  On and on it went.  Thank god for Amazon's return policies.I hope that ASUS pulls it together.  The design is clever, if in need of polishing, and there are some truly impressive achievements such as the speaker sound quality.  I have never heard a laptop produce such true, resonant sound.  It is a marvel.  But in its current state, the UX31 is a major disappointment.", "Date": "November 4, 2011"}, {"Title": "Unstable Wireless and Irritating Touchpad", "Author": "Klara", "ReviewID": "R1EF96ATFJRYT8", "Overall": "2.0", "Content": "I've had this computer for about a year now. I was excited because it was priced really well and looks a lot like the MacBook Air.I should have paid the extra $400 for a MacBook Air (or gone with another Windows laptop). There are two major issues that make this computer a straight up pain.1. The touchpad is really weird and sensitive. It often jumps over the page; I can't count the number of times I tried to cut and paste and ended up cutting the wrong thing.2. The wireless connection is awful. It disconnects really frequently (in the past hour, it has disconnected me nine times, while no one else in my vicinity has had that problem) and it runs slowly. I have since searched for that issue and it seems like it is widespread - people blame it either on the quality of the wireless card or the solid aluminum body. For me, a good internet connection is crucial to basic functionality, so this does not deliver.Bottom Line: If I could go back in time, I would not buy this laptop.", "Date": "March 26, 2014"}, {"Title": "Caution!! 128 GB hard drive instead of 256!", "Author": "Anna", "ReviewID": "R17HII7MHXOUV0", "Overall": "2.0", "Content": "Be careful! The description says it has 256BG hard drive (in 3 different places), but it's actually came 128! They cheated on me! It's really terrible, as hdd size was the reason I've chosen this one. The laptop is OK, but with such a hard drive size it's merely useless.", "Date": "October 7, 2013"}, {"Title": "I don't get it", "Author": "Bing Ni", "ReviewID": "R1SMO9EE4XUOHQ", "Overall": "2.0", "Content": "I don't get it, so it's hard to say whether it's good or not. But I got a refund, that's the only good news.", "Date": "August 16, 2013"}, {"Title": "I'm in PAIN!", "Author": "Everyday Kay", "ReviewID": "R1UWIDS6LTP9NJ", "Overall": "2.0", "Content": "Zenbook, why have you forsaken me? You are beautiful, sleek, uber-portable, fast, but you suck, Grasshopper.1. I had to send the first one back within 2 weeks because the screen went black. The problem is the screen is wobbly/loose where it attaches to the keyboard. The second one came with the same issue, so I have been babying it so it won't die on me, too. It kind of makes the whole portability thing moot if it wobbles all over kingdom come when moving it from one spot to another.2. The keyboard takes tremendous effort to register a keystroke. It happens all over the keyboard, but is the worst with the right hand, particularly the first two fingers. This cuts into productivity because it requires one correction after another, is a worse PAIN when typing passwords, and this gets old really REALLY fast.3. Touchpad -- yeah. Good thing I prefer a mouse. Updating the driver didn't help, though some have had luck with it.4. Wifi, you hope. It drops off my home network often, and I have to reset the modem before the Zenbook will recognize it again. None of the other laptops in the house have this issue except... oh, wait... another Asus laptop flaked out this same way. Asus? Knock knock! Are you home? People don't like this, and updating the driver more than once DID NOT HELP.As I write this, Zenbook Numero Dos has been Fedexed back for repairs. This is a total pain in the patoot, since all data has to be transferred, programs uninstalled, blah blah blah. Seriously, nobody has this much time to spend on wonky computer issues. I told Asus not to send it back to me if they couldn't eliminate all these problems. I'll keep you posted.", "Date": "May 14, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005USCA4Q"}}