{"Reviews": [{"Title": "Solid Performer", "Author": "akakpaws \"akakpaws\"", "ReviewID": "R10YXL75OBSU62", "Overall": "4.0", "Content": "This computer appears to be very solidly belt. The keys and touchpad feel solid and well-designed.  The touchpad has very good ballistics.  The screen is bright and clear.  This computer worked very well right out-of-the-box and is  very quiet and fast. It also runs extremely cool, I have not detected any hot air emanating from it despite the large hard drive and fast processor.  All my software installed easily with no hiccups. The performance exceeds my expectations. At the price I paid this computer is probably one of the best laptop values  I have experienced.  This one is a winner.", "Date": "November 18, 2011"}, {"Title": "Probably my last computer ever", "Author": "Spenco", "ReviewID": "R1BFGAM4CP1VYG", "Overall": "5.0", "Content": "Bought one of these from Fry's ~2 weeks ago. Worked right out of the box w/ easy setup instructions. I am in the age bracket that has been buying a computer, upgrading and then replacing repeatedly for almost 30 years now. I think we have collectively made Mr. Gates wealthy having to do the same thing with software. This is now all the computer I expect to need the rest of my life. It does everything quickly and cleanly and now it sees better and is probably smarter than I am. It certainly can remember more. We have come a long way baby from my first hard drive with only 20MB to the 640GB on this well-configured computer which, ironically, was also the least expensive of the bunch. All I need to do now is keep it clean (thank you Norton), use automatic updates (yeah Microsoft), install another 4GB memory (thank you HP for designing to leave one open slot) and my long love-hate relationship may tip the balance clearly to love.What might make it better? HP and Logitech make a deal to install the transceiver for a wireless mouse\\keyboard internally? Bluetooth? All I am sure of is that this computer is pretty sweet for the price.", "Date": "November 5, 2011"}, {"Title": "A+ Highly Recommend", "Author": "Toronto79", "ReviewID": "R289ON8OK3REWY", "Overall": "4.0", "Content": "I purchased this laptop to replace my bulky six year old HP laptop. My primary use for a laptop is for pleasure, I'm not an avid gamer, nor a programmer. My needs are simple, internet for search functions, office software for work, downloading pictures off the camera, storage of old pictures, movies, etc.My old laptop was repaired twice in the past three years, I could have stretched it out a little longer, but I'm glad I upgraded. The shipping was extremely quick, the package was mediocre (the computer box packaged in an external shipping box with no fragile sticker, no peanuts, nothing to absorb a faulty shipping company. Luckily, the shipping company did not put one dent on the outer box.The battery life thus far has been great, LED screen resolution takes a bit of getting used to from these LCD and plasma affixed pair of eyes, networking is relatively painless, the on-board mouse pad has awesome functionality (zoom-in, zoom-out, two finger scrolling, etc). Keys are easy to use, webcam/microphone built-in is amazing, look is sleek, design is light and easy to transport, the fan output has been routed to the side, so it doesn't heat up your lap, restricting airflow, the dvd drive can be somewhat loud during loading software, but I guess the spin rate is just that high that it creates that type of sound. The average battery lifespan thus far has been three (3) hours fully charged.Great buy for students, working professionals, desktop users who are weary of buying a laptop and for those like me wishing to replace their older laptops with newer and sleeker designed laptop for the general public.", "Date": "January 30, 2012"}, {"Title": "TERRIBLE SPEAKERS", "Author": "Diana", "ReviewID": "R3LB8UBLCMEHV", "Overall": "2.0", "Content": "speakers broke within a couple of month of use.  also lid is almost half broken.  overall, a very cheap feel. screen quality is also not the best.", "Date": "April 8, 2014"}, {"Title": "Love it", "Author": "Ayesha", "ReviewID": "R2IOW7J8N9B8ZX", "Overall": "4.0", "Content": "HP Pavilion g6 is my first ever personal laptop that I got about a year ago, and I don't think I would ever want a replacement since I am in love with it.We have started to understand each other well. The keyboard is comfortable to use and the touch-pad has features like auto-scrolling, zooming in & out (even the desktop can be easily zoomed in to magnify everything if need arises, perhaps showing something to my uncle who has a poor eye-sight etc. )The pavilion g6 is very user friendly.The reason why I did not give it a five star rating though, is that I have had some problems of getting slight electric shocks through the keyboard while charging. The customer service said it is because the plug I use for charging is not earthed probably, but I have experienced the electric current even when the laptop was not plugged on for charging. Anyhow, it is only occasionally that happens, and since everything else about the laptop is just great (the webcam, the speed, the smooth start-up & shut-down, auto-updates for every thing, great HP support etc.) I'm all happy.", "Date": "May 31, 2012"}, {"Title": "simple y exelente", "Author": "Yasneiri", "ReviewID": "R2TNNKVFXE0WNA", "Overall": "5.0", "Content": "el equipo es sencillo,  perfecto de todo... bastante completo y rapido. me refiero a sencillo por que es un equipo que lo unico que le falta para ser perfecto es el bluethoo integrado. de resto el equipo es perfecto.", "Date": "February 20, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005NQVJM4"}}