{"Reviews": [{"Title": "New 13\" MacBook Air vs. New 13\" MacBook Pro: A side-by-side comparison", "Author": "Farb Dannon", "ReviewID": "R2B3ZDOLDK86Y5", "Overall": "5.0", "Content": "I purchased both the newly updated 13\" MacBook Air and the updated 13\" MacBook Pro the day they were announced at WWDC and released for sale in June 2012. After using the two machines side-by-side for a couple weeks now, I can say that the MacBook Air offers superior performance in virtually every respect to such a degree that I've pretty much stopped using my brand new MacBook Pro. Of course the Air (which I got factory upgraded to the 2.0 GHz i7 processor and 8GB of RAM) is lighter, slimmer, and sleeker than the Pro, and yes, it does have a much higher resolution display, but I was surprised just how much faster the MacBook Air is compared to the Pro is despite the Air's slower CPU clock speed. The SSD hard drive on the MacBook Air makes an enormous difference in everything from casual web browsing to video editing.Speed and Performance: Advantage MacBook AirApart from the hard drives and port configurations, the technology inside the machines is virtually identical in both the newly refreshed MacBook Air and MacBook Pro. Both Pros and Airs come with either i5 or i7 Intel \"Ivy Bridge\" processors, Intel HD Graphics 4000, USB 3.0, and lightning-fast Thunderbolt ports. While the MacBook Air models are at a disadvantage to the MacBook Pro models in terms of CPU clock speeds, any performance disadvantage from the processor speed is more than made up for by the lightning fast performance of the Air's SSD hard drive, which Apple markets as \"Flash\" storage. In everyday tasks from gaming to web browsing to watching Flash movies and editing video, the MacBook Air is faster significantly faster in virtually every task. The Air boots up in less than 12 seconds while the Pro takes upwards of one minute.Screen: Advantage MacBook AirOnce you get used to the super high resolution 1440 x 900 LED display on the MacBook Air, the 1280 x 800 back-lit LED display on the MacBook Pro looks downright grainy and primitive. Simply put, once you get used to a higher resolution display, the 1280 x 800 display on the 13\" MacBook Pro just isn't acceptable. Even for simple tasks like email or word processing where you wouldn't think the resolution would matter, the graphics look grainy and pixelated, which just isn't acceptable for a pro-level laptop in 2012.Upgradability: Advantage MacBook ProOne major difference that's important to consider between the Air and the Pro is that the Pro is more flexible and adaptable in terms of upgradability. With only a screw driver and about 10 minutes of your time, you can add more memory to the Pro, replace the hard drive, and even add a second hard drive in place of the optical disc drive. The Air, on the other hand, is stuck in the configuration you purchase it in except that you can opt to replace the SSD \"Flash\" hard drive with a higher capacity drive. However, both the Air and Pro have USB 3.0 (which is five times faster than USB 2.0 and backward compatible) and Thunderbolt (which is ten times faster than USB 2.0), I see no reason to replace the Air's hard drive any time soon given how cheap external hard drives are and how fast the connection has become.Design, Weight, Portability, Battery Life, and Form Factor: Advantage MacBook AirThe MacBook Air is the most beautiful computer ever produced by man. The aluminum case is impeccably designed, almost tailored to accommodate the necessary internal components, while maintaining practical ergonomics. It's an incredibly thin, svelte, sexy little notebook. The aluminum case seems sturdy and durable, and its mechanics are very similar to the time-test unibody construction of the MacBook Pro. The MacBook Pro, on the other hand, is a bit of a dinosaur in its bulky circa 2006 unibody. The Pro is heavier than a half gallon of milk at 4.5 lbs, while the MacBook Air weighs in at less than 2.9 lbs. Battery life is roughly even on both machines at anywhere from 4 to 7 hours depending on workload and settings.Summary Judgement: Buy the MacBook AirSimply put, the guts of the two machines are basically the same, but the Air's SSD hard drive gives it a tremendously significant boost in performance. Sadly, the MacBook Pro's 5400-rpm hard drive leaves the machine unable to capitalize on the newest, most expensive Intel \"Ivy Bridge\" i5 and i7 processors that you're paying a $300 premium for in the newly updated Pros. If you are going to buy a Pro, invest  the extra money and get it upgraded with a SSD hard drive and get an extra external hard drive if you need additional cheap storage space for multimedia files. When you also consider the superior display, lighter weight, increased portability, and lower price of the MacBook Air, it's hard to find a reason to justify purchasing the current 13\" MacBook Pro, which to me looks like a dinosaur rapidly headed for extinction.Specs on the models compared:13\" MacBook Air (mid 2012) factory upgraded to the 2.0 GHz dual core i7 processor and factory upgraded to 8 GB RAM (1600MHz DDR3L SDRAM) with standard 256 GB SSD (\"Flash\") hard drive13\" MacBook Pro (mid 2012) with 2.9 GHz dual core i7 processor, 8 GB RAM (1600MHz DDR3L SDRAM), and 750GB Serial ATA Drive @ 5400 rpmBoth feature Intel HD 4000 Graphics, 3.0 USB, Thunderbolt, 802.11n, etc.", "Date": "June 29, 2012"}, {"Title": "Portability and performance: a photographer's perspective", "Author": "Noah", "ReviewID": "RXY11D94G6N5W", "Overall": "5.0", "Content": "I am a professional photographer, and recently purchased the Macbook Air 13\" base model as an addition to my desktop workstation. It replaced a 2010 13\" Macbook Pro as the machine I'll use when away from the office. After a few days of testing, here are my thoughts:Processor: The one word response would be \"sufficient.\" Overall, the beauty of this laptop is that it gets out to the way and simply lets you do what you need to do. The processor isn't the fastest on the market, but I have never been left waiting for any processing tasks to date. As an email access point, word processor, and internet browser there is more than enough processing power to have a boatload of applications and multiple tabs open without a stutter. Web pages scroll nicely, new programs open in a second or two and when it comes to productivity tasks this is night and day better than my iPad since I can actually use the keyboard, Microsoft Office etc. The processor doesn't need to be all that powerful in large part due to the flash memory storage, upgraded in this generation to the faster 6 Gb/s connection so that read/write processes don't drag the computer down at all. While I use my desktop for all of my heavy duty processing of images and HD video, I will occasionally need to process an image or two on the road. So far I have found that Photoshop CS5 runs very nicely on this model, with nearly instant effects utilizing simple layer/curves adjustments. Processor intensive tasks such a gaussian blur related filters have a slight lag, taking approximately 30% longer than they do on my i7 920 desktop processor that is a few years old. It all gets done though, is far faster than my previous laptop, and nothing I regularly do has taken more than 2-3 seconds of processing time for an image, totally acceptable. It's the 30-40 second drags from my prior laptop that made me ready to throw it out the window. However, the few seconds of slowing is enough that I wouldn't want to process thousands of photos on this laptop, but for the casual edit it is more than sufficient. Lightroom runs smoothly as well, in large part due to the cache being on SSD storage, so even my 5D MkIII raw files at 30MB each are rendered to a smaller jpeg preview that the lighter processor can handle and render quickly off the SSD. Imports/export rendering take longer on this machine to be sure, but by that time I'm off doing other errands so I don't mind this lag. Video editing is functional as well and would likely work for most casual users, but massive projects simply wouldn't be possible on this machine for a multitude of reasons ranging from storage space to video card, screen size, processor etc. Overall, it does handle all casual productivity tasks that I need faster than any laptop I've owned, and can handle more processor intensive image applications acceptably for a laptop, though not fast enough that I'd consider using this as a full time professional machine.Screen: The 13 inch model seems to be the perfect blend of portability and functionality for me. This particular screen is vibrant, and has the capability to professionally render the images that I need with a few caveats. Firstly, the factory set color profile for the screen looked good enough for basic use, but to my sensitive eyes had a bluish hue to it. Apple laptops are notoriously inaccurate for color rendition (increased contrast, saturation in reds and blues) so I would highly recommend that users who do much imaging work create a custom color profile their monitor. Even casual users are likely to be disappointed when actually printing images that look great on this screen (i.e. pumped up colors and contrast with a flat and lifeless print in real life). Also, for all of us that send files over the internet to Facebook/email etc, I would think it would be nice to know what your photos would look like \"on average\" to most of the users out there without a similar Mac screen. The \"profile\" utility built into OS X is worthless, and I'd recommend a software solution such as ColorEyes Display Pro, combined with a sensor such as the Spyder 4. I wish I could have assessed the default profile to find out how much it was off at baseline, but my software can only analyze custom profiles that it creates. Needless to say, things look a lot different after the profiling, and at 75% brightness I was able to get the monitor down to an average dE of 0.51 with a max dE of 2.99 in the greys (less than 1 is great accuracy, less than 5 is sort of standard to start professional work for me). I also notice that the edges of the screen on all sides have a very slight dark tinge/wave that extends for about half an inch. It is only faintly noticeable, shows up most against white backgrounds, and decreases with increased screen brightness. This isn't a defect unique to my unit, as it seems to affect all of the models at the Apple store that I went to see, as well as a few friends with Airs from years past. It would be nice if this screen were perfect, but it works and the minor screen variation doesn't effect the center working space of the image...so I think of it sort of like a built in vignette. This is a well documented complaint you can find on many forums with a quick internet search. If it's persisted into the 3rd generation of modern Air I don't see it going away soon. The resolution is also acceptable and a noted improvement over the 13\" standard Macbook pro. Not retina, but the graphics on this model couldn't handle that resolution anyways. Retina display on the Macbook air will be a welcome addition in the years to come when the technology to scale everything down at a reasonable cost becomes feasible. Till then, this does the trick.Battery life: one of my most important considerations for a laptop. This computer consistently achieves 7hrs of battery life as advertised. Screen brightness can be set to a custom level for increased battery life but I have yet to beat 7.5hrs. Surprisingly, Wifi intensive tasks such as downloading large files seem to have the biggest impact on battery life. I'd love to have a 10hr laptop at some point, but this model can get me through a busy work day every time so long as I start with a fully charged battery before.Value/Upgrades: I am happy with the 128GB base model with 4GB ram, and made that decision mainly based on the value offered by the Apple upgrades. First off, with the base processor, all of my tasks seem to fly along with the exception of major processing such as photo or video exporting after edits. The i7 2.0 GHz upgrade would only be of marginal help, with the advantage of the \"turbo boost\" performance at 3.2 GHz versus 2.8 or a 11-14% increase for $100 (but requiring the $300 memory upgrade as well). I seriously considered the 8GB of ram as well, as the $100 upgrade would help to future proof the computer's performance. The problem with this, or any other upgrade over the stock base model is that you need to purchase the custom Air models directly from Apple, without the Amazon discount, with the added sales tax and recycling fee. That's an additional $150 or so in immediate outlay for privilege of even beginning to customize the computer at an additional price (or about $250 extra for 8GB of ram rather than the initially apparent $100 which would have been worth it). I have found that most Mac laptops depreciate at about 10-15% per year from the base price (any additional cost to tax etc is thrown out immediately), so selling this computer in a year or two to stay current with technology is by far the better value for me.Regarding space, I have all of my programs (Lightroom, Office, Photoshop and a few others) on the 128GB drive with 95GB to spare. That's a lot of extra space for working files so long as they aren't media based. For that, you would need an external drive either way, as a day of photography can produce 60-70GB, and video can get into the hundreds of GB quickly, nothing that the minor 128GB upgrade would cover. The USB3 connection and a 7200RPM external drive does a great job, and ensuring that Photoshop etc are using the onboard flash storage as a scratch disk makes for great performance without compromise. Also, for storage in a pinch, the SD card slot provides an opportunity for a cheap upgrade. A 64GB SD card just barely sticks out of the side and can be had for $50 or so, while a 128GB SD card costs ~$150 with prices dropping fast. These won't have anywhere near the same read write speeds as built in memory, but would be more than sufficient for music, document, image storage etc when needed.Overall, I'm thrilled with this machine and would recommend it without hesitation. I thought briefly about the new Retina Macbook Pro, since I could find many uses for the extra resolution and processing power. However, I ultimately decided to use this machine for its exceptional value and extra portability. The rMBP is a beautiful machine, but even with its performance it isn't close to a modern desktop machine of similar pricing equipped an i7 3770 processor, SSD boot and scratch drive, GTX 670 or similar, 16GB ram and a nice 24\" dual monitor setup all for the same 2k price tag. So I'll take this with me on the road or the coffee shop, and save the serious work for my desktop with multiple monitors etc. No computer can be everything for everybody, but this Air is surprisingly versatile and ranges between best in class and acceptable for everything I've thrown at it. I'm a big fan.", "Date": "July 12, 2012"}, {"Title": "No longer the undisputed champion of the ultrabook sector, but still the odds-on favorite.", "Author": "icarus", "ReviewID": "R10KKPM7BQTDU9", "Overall": "5.0", "Content": "UPDATES:1/6/13 - 3 months in, and still going strong. Picked up Applecare about a month in (you can buy it at any point before the included warranty expires). Cost me ~$200 (you can use student discount at Apple stores) for 3 years of support. All the Mac people I know swear by Applecare, and it seems like a pretty good thing to have just in case. Battery life is still a solid 5-7hrs. if not more, depending on my usage. As expected, watching HD movies or playing games does kill the battery life. Bought this neoprene sleeve since it looked solid, was inexpensive, and had good reviews. Definitely recommend a case/sleeve of some kind to avoid scratching up the shell.Preface: I own a computer I built myself and have been continuously tinkering with and upgrading since 2007. This is my \"primary\" computer, and I virtually never use my Macbook while at home as a result. Prior to this purchase, the only Apple product I've owned is an iPod Touch from 2010. This is the perspective of a long-time Windows user with access to a computer of considerable horsepower. If you want to hear from someone who spends >90% of their computer time on this Macbook, I'm not your guy. However, I can still talk about the properties that make it strong for my demands of a portable, secondary computer for use whenever I'm not at home. I'll be breaking this review down into the criteria I needed my next laptop to satisfy, and where the Macbook Air fell in relation to the competitors.One-Sentence Review: The 2012 Macbook Air is not head-and-shoulders above the competition (it's not even the best in any one category) but it's so great at everything that it's hard to say no to.1. Portability: Both the 11\" and 13\" model have set the standard for the portable \"ultrabook\", and competition from Asus, Samsung, Lenovo, Dell, HP, and anyone else has used these laptops' dimensions as the benchmark. This 13\" model weighs in at a svelte 2.9lbs., but in 2012 that's not really saying much. Look up the ultrabook offerings from the above companies and you'll see they're all within +/-0.1lbs. It's no doubt a lightweight and portable design, but I can't hand this one to Apple given how close everyone else is.Verdict: Draw for the Macbook, since everyone has the same dimensions and weight.2. Design & Build Quality: This used to be Apple's home court. The unibody aluminum shell of the Macbook Air was a league apart from the plastics of certain competitors. However, Samsung's Series 9 and Asus' Zenbook Prime give the Macbook Air a serious run for its money. To its credit, Apple is one of the few manufacturers who grace their ultrabooks with a super-large trackpad (which is superior to any PC laptop trackpad I've ever used) and backlit keyboard. The frame is sturdy, the lid doesn't creak or sway, and there's very little flex in the body.Verdict: Other guys look nice, but I have to give this to Apple on the back of the keyboard and oversized trackpad.3. Battery Life: I have yet to run my Macbook from full to empty, but I have used it for long stretches and (assuming the battery meter is accurate) can make a reasonable assessment of battery life. While browsing the web, writing a Word document, and listening to music, with screen at half-brightness, I was going for about 3.5hrs when I hit the 50% mark. A reasonable estimate places total battery life at 6.5-7hrs., which is right in Apple's factory estimate of 7. I bet you could squeeze an easy 9hrs. out of this by turning Wi-Fi and Bluetooth off and dimming the screen some. Regardless, I'm usually not away from an outlet for more than a few hours anyway, so this is a nice cushion to have. Also worth noting that the Sleep function seems to be extremely battery-efficient. 24hrs. of sleep resulted in only a 1% loss of battery life, and the Macbook instantly took me to the login screen when I hit the spacebar.Verdict: Extremely respectable battery life and fantastic sleep efficiency.4. Screen Quality: This is in my opinion the laptop's weakest category. The Macbook Airs use TN panels, with resolutions of 1366x768 for the 11\" and 1440x900 for the 13\". For the unacquainted, TN panels are the bottom shelf of LCD panels in terms of color quality. The aforementioned Zenbook Prime absolutely kills the competition with a 1080p (1920x1080) IPS panel (IPS is the top-shelf panel), and even the Series 9 has a respectable 1600x900 PLS (mid-range panel) display. This fall Apple introduced a Retina 13\" Macbook Pro with an insane 2560x1600 display, but did not similarly update the Macbook Air. It may happen next year, but for now you're stuck with a low-end display. This is not to say it is objectively bad (it's not), but the competition does leave this laptop feeling somewhat inadequate.Verdict: The Macbook Air's TN panel just cannot compare to the IPS and PLS panels on other ultrabooks.5. Software: I had a passing familiarity with Mac OS X, and thought it to be a generally snappy, good-looking, but not well-supported OS. That last point is mostly untrue, as I have virtually everything I use on my desktop (MS Office, Spotify, Chrome, VLC Player, Steam(!), Dropbox) running natively on OS X without any issues. There's a bit of a learning curve, but I found it a genuine joy to acquaint myself with Mountain Lion's \"Mission Control\" feature. This allows you to create multiple desktops with independent docks and applications, effectively allowing you to segregate your computer for work and play. Many of Mountain Lion's features, as well as Safari, are well-integrated with multi-touch gestures on the trackpad, so executing commands through the trackpad is wonderfully simple. I miss the comfort of Windows only slightly, to be honest.Verdict: OS X is a very well-designed OS for anyone who isn't strictly tied to Windows.6. Value: Value is awkward and highly subjective. You have to make your own goals before any purchase, and evaluate which alternative offers the best chance of fulfilling that goal. As a first-year medical student with a very competent primary computer, my goals were to have a reliable, portable, and decently powerful laptop for bringing around with me to class, the library, lab, and anywhere else that wasn't my apartment. Ideally this would be a 4-year computer, lasting me the entirety of medical school. $1100 is a lot of money to spend on a laptop, so I had to be sure of what I picked. In the end I went with this because of the literally dozens of classmates and friends who have had the same Macbook (Pro/Air/whatever) for years without a hiccup or slowdown. I feel this is due in part to Apple's willingness to make its OS as backwards-compatible as possible, which means you get a non-bloated OS that's designed to work as well on yesteryear's technology as tomorrow's.Verdict: TBDIf you've made it this far, thanks for taking the time to read, and I hope you found this useful. I would add a final caveat about potential improvements to the 2013 Macbook Air, but honestly don't give it much thought. There's always one more thing coming around the corner, and if you need a laptop now just get this one. Like I said, it's not the best at anything (except the trackpad maybe) but it's great at everything and should last you for years.", "Date": "November 12, 2012"}, {"Title": "Absolutely amazing lightweight notebook", "Author": "Nick \"whereishawkins\"", "ReviewID": "R2MKUDXKC5GLF9", "Overall": "5.0", "Content": "Going from a White Macbook circa 2008 to the 2012 Macbook Air is a massive leap forward in technology for me. The big question is deciding which one will be best for you: The 13\" Macbook Pro or the 13\" Macbook Air.Things I like:It's fast! I plan on using this when I travel for Office, Adobe Lightroom and other photography applications. I'm able to move quickly, even when shuffling around hundreds of photos in Lightroom. This is remarkably different from my old Macbook.The SSD. Absolutely fast. Bootup/shutdown/restart times are in seconds. Yes, it's pricy, but I love it.Solid build. It feels much like other Macbook Pros, despite the thinness. Yes, it feels like it'll be a magnet for scratches, so I'm off to find a case/skin.Opposite side USB ports! The most annoying thing about my Macbook (old White, new MBP as my office computer) is that there's not enough spacing between the USB ports, so a chunkier flashdrive and another USB device won't fit. Now I don't feel like I have to choose what gets plugged in.USB 3.0. I've got enough USB 3.0 flash drives and the speed increase will be noticeable. Thunderbolt technology is supposed to be a lot faster, but a lot more expensive and quite frankly, cost-prohibitive.Weight: I've gotten used to heavier laptops so this feels downright thin. Thin enough that I don't notice it in my bag.Screen resolution: 1440x900 gives me more real estate than the 1280x800 of the 13\" Macbook Pro. The screen was bright and vivid.---Things I don't like:Non-upgradeable: So much for adding more RAM down the road.New Magsafe power connector: This might cause an issue with places that have older Macbooks as well and determining which is which. That's what labels are for.Aluminum case: It's beautiful but I'm feeling worried that I'm going to scratch it.Software update: 350MB worth of fixes out of the box. Ugh.---Sound. It's decent enough - it seems like any other laptop's audio that I've ever used. If you're serious about audio, you'll have external speakers (or even pair it up with Airplay speakers.)Battery: I got about 6 hours in a torture test of watching video while surfing the web on WiFi. It's pretty decent and within the 5-7 range that Apple stated.DVD drive: I don't miss it. I thought I would, but I don't. It just adds weight and bulk to the computer.The webcam is also a higher resolution 720p camera. It's quite nice, but now the downside is that during Facetime, my friends and family can see my ugly self more clearly. Also, early adopters won't have the computer come with the newest version of OS X - Mountain Lion. That will come in mid/late July. It's nice that this will come gratis to those who bought early.The big question is Macbook Air or Macbook Pro? It comes down town a number of issues. If this will be your primary computer, then Macbook Pro is the way to go. The MBP is a faster computer with more storage and an optical drive. If you plan on doing any high-end computing, you'll notice the difference. If this is going to be a secondary computer or if weight is the deciding factor, then the Macbook Air is for you. Either way, you can't go wrong.", "Date": "June 19, 2012"}, {"Title": "Wifi problems", "Author": "Christophe", "ReviewID": "R11BGG5IOAJ13", "Overall": "3.0", "Content": "This is a wonderful product, well designed and very light. Unfortunately, the Wifi is not reliable. I have many other Apple products connecting to my home network with no problems, but this MacBook Air just can't keep a reliable connection. The connection slows down to a crawl every few minutes, sometimes it drops.On Apple users forums, I discovered hundreds of other people had the same problem (google for 'Macbook Air Wifi problems'.) Some hoped that an upgrade to Mountain Lion would fix the problem, but this is not the case.", "Date": "August 29, 2012"}, {"Title": "My First Mac", "Author": "K. Chan", "ReviewID": "R1V910VCJ74QVE", "Overall": "4.0", "Content": "The first Apple product I owned was a 1st generation iPod Nano. From there I got an iPhone (1st Gen), iPad 1, and the 3rd generation iPad (most of these were gifts). I had good experiences with all of them and my MSI laptop was dying on me, so I decided to get my first Mac. I ordered an upgraded Air with 8GB or RAM from the Apple store. It arrived in eight days, and as always, it was beautifully packaged.Here are some my observations after owning it for about a month:- The multitouch trackpad is one of my favorite features. It is intuitive and much better than a mouse/scrollwheel. Going back to a Windows computer actually felt a little weird because I didn't have the multitouch gesture controls (e.g. swiping to go back in the web browser or two finger zoom). The keyboard has a nice feel to it and is quite quiet.- The computer boots up in 10 - 15 seconds, which is around 3 to 4 times faster than my friend's 2009 MacBook Pro. And the Air usually shuts down in 3 seconds. Waking up from sleep is almost instantaneous. All of this is possible because the Air has a SSD whereas most laptops today have traditional hard drives.- Wi-fi connects really fast. I can visit a website right after boot up/wakeup.- The Air is relatively quiet. The only time I usually hear the fan is after I have been streaming a video for a while. Even then, you don't hear the fan for long.- FaceTime looks much better with the 720p camera in the Air compared to the new iPad.- The speakers are solid. If I have computer playing music downstairs, I can still hear it upstairs. And turning up the volume doesn't distort the sound. Of course, the computer speakers pale in comparison to my Logitech Z-2300's.- GeekBench score of around 6150.- The appstore makes installing software much easier.- It's easy to plug in a monitor and use my computer with the lid closed (clamshell mode). You'll need to plug in a keyboard and mouse.- The Air is beautiful and light. It was almost too nice to use at first.- The battery charges pretty fast - it's at 22% right now and OS X estimates that it'll take an hour and 16 minutes to charge the rest of the battery.- Some reviewers and users have complained about the MagSafe 2 power connector (they like the first one more). As a first time Mac owner who haven't experienced the MagSafe 1, all I can say is that it hasn't been a problem for me, though my Air pretty much stays on my desk all day long.But it's not perfect:- I like my screen to be bright but based on my estimations, the battery won't last 7 hours if the screen is set to the brightest setting.- The bottom left corner of the trackpad is much lower than the other three corners of the trackpad. I don't think it'll be a big deal, but it'd be nice if it was perfectly aligned, especially considering how much Macs cost.- Two USB ports aren't enough, especially if you plan on using clamshell mode a lot. Since I don't have a USB hub, I have to exit clamshell mode whenever I wanted to plug in my external hard drive or print something.- Minecraft froze on me twice.Not Apple's fault:- Chrome is my favorite browser but I can't use it right now because of some bug that causes Lion to freeze up when Chrome is used. (See update below.)I'm still figuring out some things in Lion but overall, I'd give it 4 and a 1/2 stars! Recommended.Update (7/4): I downloaded Chrome after Google came out with an update for it. I haven't had any issues so far.Update (7/21): I've stuck with Safari because it feels snappier than Chrome.Update (7/29): I downloaded and installed Mountain Lion. Dictation is my favorite new feature (Safari's unified URL/search bar is my second favorite). Even with speakers playing music less than a foot away from my Air, the mic picks up what I'm saying quite accurately. I'd give accuracy a B+/A-. See my example below. And I recently had issues with videos buffering really slowly, though I don't know if it's the modem/router's fault. The problem seems to be fixed after the Mountain Lion update.Update (9/1): I have Avast Free Antivirus installed and it's been causing some issues. When I shut down the computer, it automatically restarts it and I get a report saying there was some sort of kernel panic. This usually happens once or twice a week. I don't think this is Apple's fault though. On another note: Using an external monitor along with your Air's monitor doesn't require you to have the power adapter plugged in but using the Air in clamshell mode does require the adapter to be plugged in. Kind of dumb if you think about it. You'd think that clamshell mode uses less power than supporting two monitors.Update (9/12): I updated Avast and haven't had the restart issue since. it's also interesting to note that when I use FaceTime while blasting music from an external speaker ~2 feet away, the other person can't hear the music but can hear me.Update (10/28): I had to bring my Air into the Apple store because of an issue with my screen - if you looked at it from an angle, there was a white/bluish spot that wouldn't go away. Scheduling an appointment at the Genius Bar (my first ever) was easy and it started right on time, even at 6:30pm on a Friday evening. The Apple Genius took a quick look at it and determined it was an issue with the interior of the screen. And instead of fixing it, which they said would've taken at least 10 days, they replaced my machine with a top-of-the-line 13\" Air with a 2.0 GHz processor and 512GB SSD (my old machine had a 1.8GHz processor and the standard 128GB SSD) at no charge. Since they gave me a brand new computer, I got a new MagSafe 2 charger too. The retail difference between the two machines is over $700. On top of that, they \"refunded\" my AppleCare and restarted it from the day I took it in. To say the least, I'm an extremely satisfied customer.Update (11/17): My new MBA (see the update on 10/28) seems to be quieter than my original MBA. I don't hear the fan as often, even after streaming videos for a while.---Dictation example [Nothing after the colon will be edited except for punctuation/capitalization. Things in brackets are not dictated]: This is an example of the dictation feature in Mountain Lion. I am speaking about one and a half feet away from the mike in a room that is relatively quiet. The only background noise is coming from a different room. I am talking relatively slowly right now so let's see how well the dictation feature works when I talk little faster and with the music in the background.[Turned music on, speakers are about 2 1/2 to 3 feet away. The volume is set at 25% on the speakers and 50% in OS X]Okay, no music playing in the background and I'm talking a little faster. I would say it is still pretty accurate. I think the dictation feature is pretty useful. However, I think it would be pretty awkward to use in public or at work. The best place to use it would still be at home in private. Next I'm going to read awesome tests on the right side column in a normal speaking rates with the music still playing in the background.[Begin reading random text]What makes a good review?Be detailed and specific but when you wanted to know before you purchase the product? Not too short and not too long in for between 75 and 300 worksFor video reviewsmake it fun is that he can't informative and entertaining? How about a little action the next those cuts and product reviews as you describe your experience with it.The FinePrintawesome in the reviews are subject to the license terms set forth in our conditions of use. Your reviews will be posted within 48 hours.[End of reading the random text]Okay, that wasn't as great as I would have liked it but I still think it is a pretty accurate example of the dictation feature in Mountain Lion. I hope you found this helpful.[End of dictation]", "Date": "June 28, 2012"}, {"Title": "Overwhelmingly Happy with this Laptop", "Author": "C. M. Poole", "ReviewID": "R2GLZSA5II4X0D", "Overall": "5.0", "Content": "Now that Macs can run Windows, I am glad I can buy Macs and get the best of both worlds.  I purchased my Macbook Air for school.  I am a Sophomore at college and I have used a Macbook Pro, an HP Laptop, and most recently an iPad.  The first two were bulky and added a lot of weight to my backpack.  I ended up leaving the laptops at home and using campus computers instead, negating the purpose of even having a laptop.Next, I tried an iPad.  While it was super easy to carry around and beautiful to use, it wasn't as functional as I'd have liked due to the restrictive software (iOS) and lack of ability to help me with programming in my computer science degree plan.I took a chance and bought the Macbook Air and was instantly relieved of these problems.  It is incredibly light, thus enabling me to carry it around in my backpack and hardly know it is there at all.  You can hold it between your thumb and finger with no problem, it is so light.  It is VERY quiet.  I rarely hear the fan come on.  The screen has a great resolution, and the newer features brought from the Macbook Pro (back-lit keyboard, for example) are a great addition.  I have a Corsair Voyager GT USB 3.0 flash drive and transferring files is insanely quick thanks to the two USB 3.0 ports.  Having one on each side helps a lot.  I have been getting comments about how nice the laptop is.  Please note, I don't use this for gaming so I can't say how powerful it really is.I have not encountered any Wifi issues as some have said.  I did have a little bit of a problem getting Bootcamp to install Windows 7 because it didn't like my USB drive for that.  I had to borrow someone else's drive but it worked a charm then.  I enjoy flipping to Windows to do my programming at school, then switching back to OSX to browse the web and watch movies.  This is the best laptop I have ever bought.-----------------------------------UPDATE: 3/31/2013The Air is still running great. I wanted to add that I have played Portal 2 and a couple of other older games on the laptop and they actually run very well. The only thing is, the fans come on and it can be a little loud once the graphics start churning out.", "Date": "October 8, 2012"}, {"Title": "Returned my top Ultrabook for this... and no regrets", "Author": "Imran", "ReviewID": "R37YNMMSAH9D0E", "Overall": "5.0", "Content": "Before I start this review, I would like to mention that I had an Asus Zenbook UX31A for a week or two before I ordered the Air. The Ultrabook was stellar - most reviewers say it is the top Ultrabook out right now (the MBA technically does not classify as an Ultrabook), but it had some shortcomings that I could not stand. Therefore, I bought the Air instead. Anyways, here is my opinion on the 13\" MBA (2012 edition).Pros:- VERY thin and light and small- Looks nice and original, design-wise- AMAZING trackpad. Seriously... no other laptop has this good of a trackpad. The multitouch gestures are phenomenal and making using the MBA a breeze.- Chiclet backlit keyboard- Not that much bloatware compared to the UX31A- Very fast SSD - great write speeds- (Related to SSD) Fast bootup and sleep resume times (faster than the UX31A)- Great Apple warranty support- Enough hard drive space by stock - I had around 108GB available by stock which is pretty good compared to some other ultrabooks- Very loud and clear speakers- Display is not overly saturated- USB 3.0 ports- Get the satisfaction of having a Mac ;)- Ability to dualboot/use Parallels to get Windows 7Cons:- The resolution could be higher. The UX31A has a 1080p display, which absolutely murders this. Still, 1440x900 isn't bad.- Battery life is okay. I get ~6 or 6.5 hours, which is fine, but it really should be higher.- You own an Apple product, which requires you to either be ignorant or constantly defend yourself. You choose.Okay well that is my unbiased (I think) review on the Macbook Air. So far I love my choice of returning the UX31A to get the Air. If anyone has any other questions about the Air or comparisons between this and the Zenbook, please comment.", "Date": "July 22, 2012"}, {"Title": "Returned upgraded SSD 13\" MacBook Pro for this, no regrets!", "Author": "Nick H", "ReviewID": "RGKCMTE2BN7LT", "Overall": "5.0", "Content": "I upgraded from a 2010 HP Envy 14 to the 13\" MacBook Pro about 3 weeks ago. I tinker at a basic level, so I opted to purchase a SATA III SSD and 2x4GB 1600MHz RAM on my own and installed it. So, I had an upgraded MBP 13\" I was very proud of.Over the next week, I came to realize I should probably return the SSD, RAM, and MBP for a BTO MacBook Air with 8 GB of RAM. This was based on the following:1) Lighter Weight: I carry my laptop everywhere I go, often making 3 or more trips with the laptop in my bag. The extra 1.5 lb. from the MacBook Pro makes a difference to me, and I'm not a small guy at all.2) Better resolution: The MBP 13\" resolution maxes out at 1280x800. The 1440x900 on the MBA is more functional and allows better detail useful for work. Buyers should be aware that the MacBook Pro 13\" has a better color gamut though - intensive Photoshop work requiring color accuracy might be better on the MBP.3) Sufficient RAM: Running a memory clearing app (Clear Memory) showed me that I hover right at 4GB of RAM usage in my daily tasks, mostly involving Excel, Word, PowerPoint, and Outlook on Windows Office 2011 for Mac on top of 5-15 open Chrome browser tabs. Getting 8GB of RAM would put me in the clear, meaning I would never need or use the maximum of 16GB allowed by the MacBook Pro.4) Comparable performance: The lower clockspeed and voltage of the i5 on the MBA had me concerned at first, but most benchmarks show the MBP i5 outperforming the MBA's i5 by only about 5-10%. Since I did nothing that required that additional speed and the MBP i5 seemed plenty zippy to me, I decided that the MBA's i5 wouldn't be a noticeable downgrade in performance.5) Sufficient disk space: 128GB is plenty for me. I access most of my work files from a shared server and store videos/photos/music on an external HDD to save space anyway.Basically, I came to the conclusion that buying the MacBook Air upgraded to 8GB for $100 was a better bang for the buck, with sufficient future proofing, when compared to buying a stock 13\" MacBook Pro with user-upgraded SSD and RAM.I got my MacBook Air in the mail last week and returned my MacBook Pro. I haven't looked back - the performance feels identical to me, packed into a tighter and more portable shell.", "Date": "July 23, 2012"}, {"Title": "From the perspective of a .NET web developer/former PC only user", "Author": "Dacia Gulledge", "ReviewID": "R1QJCPLV30P3EY", "Overall": "5.0", "Content": "This MacBook Air is my 5th Apple product and definitely won't be my last but I am in no way an Apple fangirl though I'm beginning to have a whole new appreciation for all of their products and the whole ecosphere, but I do recognize its faults.  I put off the purchase of a Mac laptop for at least two years trying to make do with my PC.  I bought a high-end Sony Vaio with every feature I wanted except a lighted keyboard.  Other than having to occasionally use Adobe CS and Visual Studio on Windows to do .NET development, I haven't given my old laptop a second thought since I got the Air 3 months ago.I run a Windows virtual machine on my iMac but I didn't want to adulterate this machine with it.  So, I do as much coding as I can using Sublime Text, Coda, and Espresso and only use my Windows machine when I absolutely have to open a project in Visual Studio.  I'm waiting for Adobe CS7 to come out before switching that over to Mac also.  I really like the Mountain Lion OS and am committed to becoming a true Mac user all the time.  The switch from Windows to Mac presents some paradigm shifts for long-time Windows users, and there are quite a few things to get used to especially when using ported programs such as Office for Mac, but otherwise the overall experience is very good and generally well thought-out.  One thing that amazed me was that, out of the box, I literally had this new machine up and running and connected to Dropbox and my mail, contacts and calendar from my iPhone in less than 10 minutes.  I've wrestled with new PCs for over an hour getting up and running so as you can imagine, this was a really refreshing difference.I ordered my Air directly from Apple in order to get an education discount and a back to school gift card that was a better deal than Amazon's.  I upgraded the RAM to 8GB because I knew I was eventually going to be running CS, among other things, and I didn't want to tax the life of the SSD by constantly using the swap space.  Now I really wish I had gone ahead and upgraded the SSD also since the factory software, Office, and a few other programs I've added as well as my music library has me down to around 20GB of free space, yikes.So here goes.  First, the good stuff:1) The battery life.  I am clocking 6-8 hours per charge and that includes running the screen on at least half brightness or higher, having the backlit keyboard on it's lowest light setting, and running several programs including numerous browser tabs.  I've never gotten more than about 3 hours tops off a PC laptop battery, ever, and that's being extremely miserly with consumption.2) The size and weight.  It is almost unbelievably thin and light, especially compared to my old PC laptop which wasn't necessarily huge, but still a big difference.3) The screen.  It is so bright and clear and possesses normal, natural color quality - an absolute must for web designers/developers.  Also the native resolution, at 1440x900, is more pixels in less space (13\" vs. 15.4\") than my Vaio's 1366x768.4) The trackpad.  Hands down the best trackpad any laptop has ever seen.  Your fingers glide over it so smoothly.  When I do have to use my old laptop now, the trackpad feels like someone has left tape on it too long and removed it, leaving behind the sticky stuff.  The multi-touch gesturing is amazing, convenient, and super intuitive.5) The keyboard.  I have achieved my fastest typing speeds yet on this keyboard.  I really liked the keyboard on my Vaio as it was my first PC laptop with the chicklet style keys.  This one is even better in every way possible.6) The speed.  On/off in seconds as opposed to minutes for HDDs.7) The quiet.  Noticeably missing is the sound of any processor/fan/etc.  It's soooo nice.  My Vaio's fan runs nearly constantly.  The only sound I hear right now is the clicking of my fingernails against the keys, pure bliss.8) The App Store.  If you like the App Store for iPhone, you'll very quickly come to love it for the Mac. I was able to quickly connect to some of my favorite apps on my phone and share the data between them.9) Network connections and backups.  Connecting to new networks and running backups couldn't be faster or easier.  Mac has definitely got PC beat in this area by a landslide.  Bluetooth and Wifi are flawless.  Bluetooth on my PCs has always been super spotty.10) Adding peripherals.  No need to install/download anything to connect to your printer and many other peripherals.  I've connected to printers in places I've never been before in a matter of seconds - impossible on a PC.Finally, the not-so-good stuff:1) Most programs, especially those with more mature PC counterparts, don't quite act the same as what I'm accustomed to, specifically in the area of keyboard shortcuts.  Some of them are simply missing, others require more key presses than usual.  We're talking default configuration here though there are a lot of options which can be configured in the preferences.  In this same vein, I am also having a difficult time getting used to clicking the Command key instead of the CTRL key for keyboard shortcuts, especially since my muscle memory wants to press the key that's in the control key position on the Mac which actually happens to be the control key on the Mac, it just doesn't do what a long-time PC user expects it to.2) No dedicated delete, pg up, pg down, etc. buttons.  Traditional PC-like deletion requires a press of the function key in addition to the \"delete\" key which is actually what we PC users know as the BACKSPACE key, ugh.3) As much as I love the trackpad, there is room for improvement particularly in the area of the multi-touch gestures.  It seems like it would be super easy to allow for some customization or even offer some pre-programmed convenience features like three-finger tap to cut/copy/paste, etc.  There are several apps that make this possible, which serves to indicate Apple's oversight here.4) File system organization and management takes a little getting used to coming from the Windows environment.  Also, I'm entirely out of my element with the Mac command line, and I suspect most long-time Windows users would be as well.5) Safari pretty much sucks.  I immediately installed Chrome and Firefox for testing purposes anyway but Chrome is my browser of choice.  One really frustrating thing though is that Chrome for Mac doesn't yet allow the option to open tabs from the browser bar when pressing enter like it does on the PC.6) The Mac OS runs an Apple-ized version of Java which hasn't necessarily given me any problems yet, but I am constantly getting warnings that I need to update Java when using programs like LogMeIn, GoToMeeting, and WebCT.  If I try to update Java, I get a warning that says it will overwrite Apple's Java (something I haven't had time to research yet to know whether it's good, bad, or neither).7) The aluminum casing is beautiful but is very easy to scratch and dent.  You'll want/need a cover/case/sleeve/etc.  I highly recommend the Incase Neoprene Sleeve For Macbook Air 13-Inch -  Black (CL57802).I was initially concerned that my work and school development workflow might be interrupted by going all Mac, but in reality, if anything, it's been bolstered because I absolutely am in love with this machine and since it's so portable, I take it everywhere!  If you're like me and you're torn over the decision because of the Windows development issue, you won't be sorry if you make this purchase.  Plus, Mac computers hold their value better than any other on the market so if you absolutely hate it (you won't), you can always take a (very) small loss by selling it back on Amazon or eBay.", "Date": "December 10, 2012"}, {"Title": "I'm a brand new first time Apple OSX user and this machine is really quite remarkable", "Author": "Trevis Thomas", "ReviewID": "R294N354OUN3MV", "Overall": "5.0", "Content": "I'm a brand new first time Apple OSX user and this machine is really quite remarkable.  I'm a software developer and i purchased this laptop to use for learning iOS development, and i have to say, it's an impressive device. The form factor is nothing short of amazing. The fit and finish are great.  I love the back lit keyboard, and the large, gesture enabled trackpad.  The screen looks very nice and the SSD makes the machine feel very zippy considering its relatively modest specs. When closed, this laptop and my ipad take up less space in my bag than my 15\" dell did all by itself, and together they're much lighter.  It even has a much longer battery life.I've tasted the apple cool-aid and i'm beginning to believe.", "Date": "December 26, 2012"}, {"Title": "Mac Noob has found true love", "Author": "S. Justice", "ReviewID": "R3FYNXWA1KO6LM", "Overall": "5.0", "Content": "Ok let's get a couple things out of the way first and foremost so this review is PERFECTLY understood by anyone that stumbles across it.1.  I'm an avid gamer and I play my games on a custom PC running Windows 7 Professional2.  I have neither desire nor expectations concerning GAMING on this MacBook Air (ok, MAYBE minecraft or Civilization 4 and/or 5Now that we're clear on that, I absolutely LOVE this machine.  I have Microsoft Office University (4 year license) and run Office on my PC as well as my Mac and have had ZERO issues going back and forth between PC/Mac.  Something may come up down the road because the PC runs Office 2013 and the Mac runs Office 2011 but so far I've had NO ISSUES at all.  I love that.  I don't always want to sit on the couch and use Office.  Sometimes I want to sit at my desk and work with Office.  I have the best of both worlds here as far as I'm concerned.  No, this is not a MS Office review so let's move on.The MacBook Air boots from POWERED DOWN to FULLY OPERATIONAL in less than 10 seconds.  It boots from SLEEP mode to FULLY OPERATIONAL in 2 to 3 seconds.  Now this is a brand new machine and all I have installed is Office and 5 or 6 other app's so far but at this moment the speed and the super light mobility of the MacBook Air has made my life so much easier...I use my iPad mini during lecture to take handwritten notes on my Professor's 'Powerpoint' slides (not actually Powerpoint but Apple's version, I forget the name) because I can sketch drawings and such with ease.  I send those notes to my Cloud/Dropbox/Google Drive and when I get home I work with them on the Mac OR PC.The keyboard is backlit and high quality regarding key responsiveness.  I like the 'chicklet' style.  It doesn't have a full size numpad but being a great typist it doesn't bother me at all.  The aluminum body/case or whatever you call it is tight and strong.  It feels strong.  If you've held a cheap half plastic laptop in your hands you know what I mean.  The Air is solid.  The screen looks fantastic and clear.I haven't even connected a mouse to it yet because I haven't needed it.  The touchpad/trackpad/whatever works great, stock, right out of the box.  Long time Mac users list an app as a MUST HAVE that lets you reassign a gazillion new gestures to the pad and I'm going to download that next but I had to comment on it anyway because as I said, this is my first Mac, and I'm impressed with the touchpad.  I've been using a hot rod gaming mouse for the last 20 years and I say this honestly... I don't miss it.  I haven't needed it, at least not yet.  The built in WiFi is running great right out of the box.  I have a Netgear router that does N protocol and my Mac zips right along surfing the net and downloading fairly large files.Well, what more to say?  I love this machine.  Super light, super quick boot up/refresh from sleep and it has a great keyboard.  The only drawback I can think of is that I wish you got a little bit more for your $ from Apple but this is just my opinion.  What I mean is that I bought a 128 GB model and I wish that for the price I could've gotten a 256 GB.  Honestly, if I could've afforded it RIGHT NOW, I'd have gotten the highest capacity Solid State Drive that they offer.  I'm going to guess that most Apple customers feel this way as well but what are we gonna do?The bottom line is this:  This machine is light, fast, sturdy, stylish, easy to transport, and rock solid when it comes to running all the software I need to use.*THIS IS NOT A FANCY LOOKING GAMER MACHINE*This is a great laptop for college students and, for lack of better words, ADULT computing.Simply put, \"I love it\".I hope my review helps somebody make a good decision about whether or not they buy the product.", "Date": "May 25, 2013"}, {"Title": "Own Every Apple Product Made, but the Macbook AIR is my only 'always Go-to' Product", "Author": "VeritasluxMea \"Neoplatonic Platonist\"", "ReviewID": "R1AUQH3YF8IST6", "Overall": "5.0", "Content": "Sitting around typing on my macbook air, with a mac mini near and the newest macbook pro nearby,...Ive used this Macbook air now for nearly 2 years, believe or not, its speakers are louder and clearer than the MBP (unless you install the BOOM application to boost volume), and the screen is far superior, not in my opinion, but apple inc. itself admits that even a 2 year old Macbook Air has a superior/sharper screen (samsung made) than the screen on the NEW non-retina Macbook pros. If the SSD 6 seconds to boot doesnt impress you about the MB Air, then the fact that its a SMOKING FAST computer that weighs in right at the level of an IPAD, ....if you want to turn on your computer and do something REAL FAST and do a shutdown and run along in life, then ONLY the Macbook AIR is a go.All the power of a desktop, but FASTER (ssd drive).....lite as an IPAD, easy to pack around without bruising your shoulder. I must have heard at least a 1000 people lament \"jeez, I wish I'd bought an AIR instead of my MBP!\".  No optical drive? Who cares, stick your torrent movies on a $70 1TB HD and pack it around.Its pathetic and laughable that anyone complained about 128GB of HD space when a 1TB portable drive is now around $65! Insanity. Just get a Macbook AIR, you'll be glad you did.The Macbook AIR really is the 'all future laptops will be somewhat like this'., and thats a fact. Conventional HD are slowing dying out as SSD become cheap, and the notion of a MBP in ANY flavour, even the Retina, is a joke. The Retina MBP is useless unless youre a pro photographer or plan on video editing, since it has NO optical drive, you have absolutely and utterly NO purpose in owning a Retina display laptop, NONE.And as far as relative to the MBP retina: As many new Retina MBP users have recently lamented \"hey, my old macbook air is running faster than my new Retina MBP!?\"", "Date": "April 19, 2013"}, {"Title": "A cutie!", "Author": "Victoria", "ReviewID": "REB1SZTW304D1", "Overall": "5.0", "Content": "I have always been a PC user. My HP laptop start to have severe overheating problem( so hot it hurts if I put my finger over the fan area for more than 5 sec).I do have also have a Dell laptop issued by work, however, it is too heavy for me to carry around school all day.  I decided to give it up and hunt for a new one.  I not a crazy apple fan, I am only a fan of quality. After getting a iPhone 4s this year, I was truly impressed by its stylish design, features and over quality. That made me put apple brand into consideration.... ok, enough of the story and let's get into the real part.I was debating over Macbook air or Macbook pro. After lifting both of them up several time, Mac Air wins without a doubt. If you are student or a traveler, I highly recommend the air. I was a little disappointed after realize there is no HDMI or a ethernet port on the Air ( I heard you can by a Ethernet adopter around $30). I was even more scared when suddenly switch from PC environment to Mac environment. Just like other people said, it feels like mac has everything backward from pc, and the thought of return it came across my mind a few times on the first day. HOWEVER, after couple days, I start to LOVE it. I  thought about returning it because I am afraid the change and too lazy to make the effort to learn something new before I really use it. It turns out that I do not need much effort to learn at all, I just need to start to use it.  The back lit keyboard is cute, the trackpad is amazing ( make sure you take a glance at the little booklet in the package, it tells you different ways to play with your trackpad, trust me, it will not take you more than 10 sec to understand and remember the gestures). If you are one of the PC -->Mac user, my suggestion would be use both in parallel for awhile until you naturally attracted to mac completely!  I have been owning my mac air for a week now, and I loved it more each day and got very use to it. It is so cute, fast and stylish that just makes me happy!I do not get hot headed nor satisfied easily, but this  little thin mac air just simply makes me happy!", "Date": "October 21, 2012"}, {"Title": "It's about time I switch from micro&$&@", "Author": "B. Duff \"Bcduff\"", "ReviewID": "R2TTMZ7OZGG9IV", "Overall": "5.0", "Content": "Five plus  star is the review.  I love my Mac air.  Thank you Apple.  Three months now and no crashes.  Instant on and off.  A standby that works.  Fast and easy.  I was a Microsoft user for years.  Microsoft 7 and 8 stand for 7 or 8 times more problems.  At first I had buyers remorse because I had to learn the new operating system.  After a week the Mac air made 100% common sense.  No more new menus to learn after every new release of Windows or Office.  My windows pc was a boat anchor.  My Mac air is so easy to carry in my work bag.  I have been able to get all my software on the Mac.  I have no idea why companies stay with windows.  The time ms windows takes to boot, the high number crashes, the connectivity issues, the security issues, viruses,  etc., etc., etc.,  The raw waste messing around trying to get the windows based system to work everyday, year after year.  My Apple offers No more Windows' reliability, quality and performance issues wasting my time.  Do I really care about a new operating system from ms windows? I can't wait around for them to get it right.  After 30 years mirco$@&$ still wants me to pay for junk. I  just want something that works and adds value to my life.  I actually enjoy using a computer again.  My Mac has fast turn on, connects everywhere, no crashes, long battery life, no security issues, light weight, easy, easy os and application software upgrades, connects to my iphone and ipad, etc., etc., etc.,I wish I would of never wasted so much of my life with Microsoft upgrades, crashes, viruses, boot time, memory hog, reliability, slow performance, etc., etc., etc.,  I would pay money to line up windows machines and blow them all away with a 12 gauge shotgun. Micr$&@? has no idea the definition of the words useful, reliable, quality, performance, robust and easy.My Mac air has added value buy successfully performing the requested task and having zero computer software and hardware issues.  It easily connects to my iPhone, iPad and the world every time I use it.  Thanks Apple!", "Date": "October 20, 2012"}, {"Title": "Truly Outstanding", "Author": "Justarasta", "ReviewID": "R1M8K3MOY95ZM4", "Overall": "5.0", "Content": "Despite being the guy who wrote the article about how with an iPad and a keyboard case you don't need a laptop anymore, I had a large case that was going to trial that required the purchase of a laptop.  Despite being an Apple guy generally (4S, iPad, 27 iMac) I cheaped out and bought a HP Envy 4.  My justification was similiar performance at half the cost.After spending time with a group including a MacBook Pro 13, a Dell ultra book,  my HP ultra book and a couple of recent vintage 13\" Airs I saw the error of my ways.  Display, keyboard, general speed, sleep, start up,  and battery life are all better on the Air.  The much better display and battery life alone justify the additional cost.  The track pad is also outstanding as is the keyboard and general build quality,  I exchanged the Envy for the Air along with a significant payment which ended up being the best money I've spent in a while.Make sure you update to OS 10.8.2.  Not only do you get (with the related firmware upgrade) true 8 hour battery life so long as you keep brightness at half way (which is as bright as  the Envy at 75%) you get the ability to dictate pretty accurately into most applications.My only complaint to date is that the OS Email server has no ability to limit email uptake on accounts like the iPad. I have only found one program to date that I could not get in a Mac OS flavor and Office 2011 for Mac is a superior product to the PC version.  The only compatibility problem I have had to date is with an Epson projector whose wireless USB key supposedly does not work with a Mac OS despite there being a suitable patch on the Epson website.  While there truly is no need to go there this computer works nearly as well in PC emulation mode if you insist.SInce I originally wrote this review I have only grown to love this computer more.  It is truly one of those things that is the best of the best and to think that you can acquire a best of the best for just a bit more than ordinary is extraordinary itself.  I truly enjoy this computer in every way and use it as much as I can as it is such a joy to use,This  is an outstanding computer.  I love it!  So will you.", "Date": "October 15, 2012"}, {"Title": "Pure Awesome!!!!", "Author": "Whitey", "ReviewID": "R3TS5LMDBQAMWE", "Overall": "5.0", "Content": "I switched to a 2012 MacBook Air from a 2011 15\" MacBook Pro (2.0GHz Quad i7). I was nervous to make the switch because I did want something lighter, but didn't want to sacrifice the speed of my MacBook Pro. I purchased the 13.3\" which has the same resolution as the 15\" MacBook Pro, so I didn't lose on the realestate of the screen. I am very impressed with the speed and do not regret getting rid of my 15\" MBP one bit. The solid state drive makes up for the less powerful processor and graphics. The snappiness of the computer is tremendous. I would highly recommend the computer to anyone. One of the biggest problems with my MacBook Pro was the temperature. Sometimes you couldn't have it sitting on your lap because it got so hot. The MacBook Air stays nice and cool. You can sit with it on your lap in the summer without dying of heat.Buy one....you'll love it! Also, I did upgrade to 8GB and it was definitely worth it.", "Date": "September 21, 2012"}, {"Title": "Mac > PC", "Author": "Thomas", "ReviewID": "R19ZOE8LHICM7Y", "Overall": "5.0", "Content": "Let me start off by saying I've been a Windows user for 10+ years, and \"thought\" windows was the best out there and the easiest to use.  Ask me a day before I bought this computer, and I would swear nothing was better than Windows when it came to operating systems.  About a week after getting the system, and I'm seriously considering never buying a windows PC again.  If you are looking for your first mac then the MBA is perfect.I've had a iphone since January 2010 and its the best phone I have ever had.  Bought a iPad 2 last year because I wanted a travel device to watch movies on and play games on.  Then decided I'd like to trade in my iPad 2 and maybe upgrade to a Macbook to give it a try.  Loved everything Apple has made before then so I thought its only fair to try the OS and a computer from them.BEST DECISION OF MY LIFE.  There I said it.I will admit for the first few days, I hated it, everything was backwards from windows and just seemed so foreign.  Some reason thought never crossed my mind to send it back though.  Keep struggling with the OS but slowly starting to become better at using it and then after I got most of the shortcuts down and how everything works down.  I started to slowly like it then started to love it.  Everything on Mac is about being as user friendly as possible.  Once you get it down, I doubt anyone would really given the choice go back to a PC.I bought this not only to try but to replace my iPad 2 as i've said above, I wanted something with high portability while still performing extreme task and staying quick and smooth when I needed it to be.  My main computer is a Alienware", "Date": "August 31, 2012"}, {"Title": "Should have dumped windows long ago", "Author": "bossdoug \"doug\"", "ReviewID": "RI9OEBMTX1ZC5", "Overall": "5.0", "Content": "This machine has quality.  I find the Apple system much simpler than windows and not subject to all of the grief and puzzles that I experienced with many years of windows.  The Apple touch pad I found difficult, so I bought a good wireless mouse.  Everything works very well and I am pleased.  I should have done this long ago.", "Date": "June 9, 2013"}, {"Title": "Best laptop ever", "Author": "Gabriel", "ReviewID": "RXG17WSO10UZ7", "Overall": "5.0", "Content": "This is the best laptop I ever had, great price and extremely fast! So thin, and light, the screen is crystal clear, I even run Starcraft II in Ultra Graphics.", "Date": "May 25, 2013"}, {"Title": "New Experience", "Author": "Abubaker Elshaikh", "ReviewID": "R35NQ93TX9JHAE", "Overall": "5.0", "Content": "This an amazing productAwesome design and very portable deviceThe mac OS X is an amazing and tremendously different than microsoft windowsI highly recommend it for college and university students", "Date": "May 19, 2013"}, {"Title": "Why did I wait so long?!", "Author": "Nancy D.", "ReviewID": "R1OTFXJQKT18SZ", "Overall": "5.0", "Content": "My nephew eats and breathes \" Apple\" products. I was always a PC person. Once I got my iPhone, that led to an iPad and once I decided to get a new laptop for my job search it was a no brainer that I would get a Mac.I am not techie by any means and all of these products are just so common sense/user friendly, should have switched over years ago.", "Date": "May 11, 2013"}, {"Title": "Everyone deserves a macbook air", "Author": "n00pster", "ReviewID": "R1VAWYDDUK2KQD", "Overall": "5.0", "Content": "Its amazing and worth the money, love every inch of it even after 1 year. Its faster too than other laptops with better specs, don't know what's the difference - maybe SSD ?", "Date": "May 4, 2013"}, {"Title": "Awesome as expected", "Author": "Rahul Singh", "ReviewID": "R2AAG9XLDOE5KB", "Overall": "5.0", "Content": "Can't believe how lightweight this laptop is - weighs nearly the same as my iPad - works beautifully. Awesome battery life and amazing display!", "Date": "May 2, 2013"}, {"Title": "Amazing. Love It", "Author": "ytoossi", "ReviewID": "R1N7M9U7GC4CYL", "Overall": "5.0", "Content": "I love my new macbook air!!! I used to have a 2006 Macbook Pro, but I finally had to lay it down to rest. When deciding on my purchase, I was interested in both the Macbook Air and the Macbook Pro. I decided the best thing to do was test drive each so I could see the difference. The lightweight factor of the macbook air won me. It's sleek and much lighter compared to the Macbook Pro and is perfectly capable of fulfilling my all computer needs. No regrets!", "Date": "April 23, 2013"}, {"Title": "Needed a personal laptop and this is great!", "Author": "Texas Rangers fan", "ReviewID": "R2BQQSQK7M4H45", "Overall": "5.0", "Content": "Absolutely love it! My first Mac has turned into my favorite computer yet, I still have things to learn about it but I am super satisfied with this product. My wife is so jealous I am going to have to get another one for her!", "Date": "April 22, 2013"}, {"Title": "Great gift", "Author": "Meeshieme", "ReviewID": "R24797B5JKCRBI", "Overall": "5.0", "Content": "Bought this for my daughter who is about to go to college.  She loves it.  Tells me how much she loves it on a regular basis.  She makes me want one for myself.", "Date": "April 10, 2013"}, {"Title": "New mac user", "Author": "Arlene Coffey", "ReviewID": "R27VA6JHTG5ZVW", "Overall": "5.0", "Content": "Big transition but learning curve easy and tutorials helpful. Bought book mac for dummies so hope to be pro before long", "Date": "April 8, 2013"}, {"Title": "Fast, small and elegant", "Author": "Alex B", "ReviewID": "R2L0WR3P2CO954", "Overall": "5.0", "Content": "Well it boots in no time, applications work extremely quick. It is not hot like my other laptops. Battery life is extrordinary. It is very elegant device.", "Date": "February 15, 2013"}, {"Title": "Best laptop I've owned to date", "Author": "Tortoise", "ReviewID": "R667X0PU5HGKH", "Overall": "5.0", "Content": "Much of the computer experience is dependent on the operating system.  This is my first Mac.  I learned the system quick; not too much of a learning curve but does require some effort.  My wife has been a little slower to pick up on it.  There are some differences in shortcuts between it and a Microsoft computer, but I should pick those up over time.  I haven't had a better laptop to date and expect to stay with Mac for the foreseeable future.  The Air is light and has tremendous build quality.", "Date": "February 13, 2013"}, {"Title": "Mac Air", "Author": "Catherine E Meadow", "ReviewID": "RJTMI330JUVOO", "Overall": "5.0", "Content": "I have a Mac iPad which I love. Was going to purchase another HP computer. My daughter suggested  I purchase this 13 inch Mac air.. No anti virus apps needed. We installed it yesterday, and after playing around with  it for a while I am really enjoying it. It is fast, bright and clear,I synced my iPad, and iPhone so they are all working together. I would highly recommend this laptop. It is also very classy looking.", "Date": "February 10, 2013"}, {"Title": "Apple Love", "Author": "C. Peterson", "ReviewID": "R3176IZ67UK40W", "Overall": "5.0", "Content": "I always have apple products, so I can't be very helpful with those switching over, but I do love their product.  I find them intuitive.  This Air version, 13\" is a perfect size, very slim, lightweight and easy to travel with, but still sturdy and well-made.", "Date": "January 29, 2013"}, {"Title": "Great laptop but some build quality issues and buggy software", "Author": "William B. Partridge", "ReviewID": "R3QQOWG5558UV5", "Overall": "4.0", "Content": "I want to like this laptop for what it is: an unbelievably smooth, lightweight, fast computer.  Unfortunately I've had to exchange this device three times, each time seemingly better than the last but not without problems.  Suffice it to say the first unit had dead pixels, the second wasn't properly sealed and the bottom would creak when used.  The third and longest lasting of the group is fine except for two issues: it doesn't stay asleep (randomly knocking me off IM conversations on my desktop) and it constantly has issues with the audio wherein things that should make sound do not.  The system makes noise, like when adjusting volume levels, but frequently Adium or Chrome or another application will just not play sounds.  Couple this with AirPlay audio randomly failing and I'm not that pleased.  Only a reboot seems to fix the issue.  This appears to be documented as an issue with the OS, but doesn't affect everyone so it's hard to say.It's minor in of itself but when it happens nearly on a daily basis I'm a bit put off.  So I'm going to try my 4th and final unit.  If the issues persist I'll drop my review, if not then it's a 5 star winner.Pros:++Lightweight++Fantastic battery life+Fast, thanks to SSD+Backlit keyboard+Amazing trackpadCons:-Edges are a bit sharp, can be painful to hold in certain circumstances-Bottom is aluminum so it can and will slide on your lap--Build quality and buggy software that should have been fixed by nowOS is a draw for me, I like Windows better for some things (gaming, file management), MacOS for other things (photography, general browsing).  If you're familiar with MacOS this is what you'd expect only better/worse with some regards (performance and battery life/build quality and bugs).", "Date": "January 28, 2013"}, {"Title": "Light and fast.", "Author": "Gregory Kotlarsky", "ReviewID": "RIU4SZNA95WH2", "Overall": "5.0", "Content": "The perfect product? Very good for home and business. It is the second Mac I have and I am not going back to PC.", "Date": "January 27, 2013"}, {"Title": "Great service and battery life", "Author": "Susan \"Susan\"", "ReviewID": "R1DZ42SBHVU2R", "Overall": "5.0", "Content": "I ordered this on Monday and the price dropped US30 a day after, and Amazon refund the difference after I email them. Great serviceI use this laptop mainly for school, and in home I usually use my PC which has a larger screen and more softwares. So battery life is important to me. I browse and type notes every day for about 2hrs on this Air and two days later it is still more than 50% left. So this laptop can easily lasts me 8hrs with screen brightness lower down.I am new to Mac and I found this laptop a pleasure to use. With the lack of software and support for Windows system, I would not use Mac as my main laptop. But it is far more intuitive and faster compare to Windows laptops. Simply the best ultrabook ever.", "Date": "January 24, 2013"}, {"Title": "Solid", "Author": "smksk", "ReviewID": "R2L8AMK32GY48N", "Overall": "5.0", "Content": "Very Good and Solid constructionVery thinGood displayeasy to useGood battery lifeand of course its MAC !", "Date": "January 19, 2013"}, {"Title": "Wow!", "Author": "J. Z. K. \"Guru of goofy\"", "ReviewID": "RS9I15EFSGY8B", "Overall": "5.0", "Content": "Having been a Windows OS user for ever, I never had the urge to try an iMac or Macbook for personal or business needs.  But, now teaching more university classes, I need my own laptop. The given capabilities are what drew me to the Macbook Air, mainly battery life, size, and durability.  While getting to know the OS, I have been easily acclimated to the system. Right now, I would recommend this versus a Macbook Pro, it works awesome.", "Date": "January 12, 2013"}, {"Title": "Macbook Air the way to go for school", "Author": "JustinJ", "ReviewID": "R4U6WSXKHLZJX", "Overall": "5.0", "Content": "If you are wondering which would be better for school, let me tell you the Macbook Air is the best way to go over the 13 inch Macbook Pro. 1) It's much lighter, 2) It's faster or more responsive thanks to the SSD. 3) The battery life is awesome. You can't go wrong with this laptop.", "Date": "January 12, 2013"}, {"Title": "Good, but broke after only 6 months", "Author": "intotheblues", "ReviewID": "R33M1B7OCSVXPX", "Overall": "4.0", "Content": "The computer worked great! Until we did a system update, and then we got the white screen of death. Lost some stuff we hadn't yet backed up (oops, my bad!) and took it in to the Apple store to get a new harddrive put in. Thankfully under warranty, because that sucker would have been almost $800 to replace!! This from a 6 month old computer?? For shame!So, I was NOT happy about that. But, since the new harddrive was installed, and the Apple Genius people upgraded it to the latest OS while they were at it, I've been really happy with it. This was our first Mac (computer) purchase and I'm not 100% sure I would purchase a Mac again, mostly because of how bloody explensive they are, and yet for what I use it for, I can do the same things with a $400 PC. Email is still email on a Mac.....But you get stickers with it when you purchase, so there's that...", "Date": "January 11, 2013"}, {"Title": "Amazing is an Understatement", "Author": "Robin Swilley", "ReviewID": "R10KVLV48B5JUH", "Overall": "5.0", "Content": "Cold boots in about 10 seconds, wakes from sleep nearly instantly, and less than 3 pounds. What more could you ask for?So glad I got the MBA. I was originally going to get the 13\" MBP, but after reading a few reviews on here about the air being all flash technology I went with it.This has me wanting to put a solid state drive in my Mac mini!", "Date": "December 25, 2012"}, {"Title": "So in love with this laptop", "Author": "flhorizon", "ReviewID": "R27Y6T29NSFIS5", "Overall": "5.0", "Content": "I'm a former educator and used MAC desktop computers way back in the 90's. After I stopped teaching, I became accustom to PC's. When I bought my first iPad, I decided to give MAC's another try. I can't recall why I ever stopped using them. My best guess is the price. Now I'm hooked on MACs. My work computer is a PC and I don't even like using it anymore. I bought this MAC after I went back to school to get my doctorate degree. When school is in session and I have to travel for work, I carry my work laptop (because I have to) and my MAC just so I can complete my coursework and not have to use my work PC to do it. I won't get into all of the technical comparisons of MACs and PCs; others have already done that. I'll simply say that it's user friendly, easy navigation, the mouse pad is much better than those on PCs (I typically use an external mouse with PCs, but I only use the mouse pad with my MAC) and the keyboard is more comfortable.", "Date": "December 23, 2012"}, {"Title": "Slim, Light and Fast!", "Author": "Esteban Vallejo", "ReviewID": "R29V8NO17ZTG23", "Overall": "5.0", "Content": "The MacBook Air is lighter and slimmer than the MacBook Pro. The SSD hard drive on the MacBook Air makes a big difference in performance vs. the HDD drives. It boots fast, like in 10 seconds. The aluminum case is very well designed, it is thin and strong at the same time.", "Date": "December 22, 2012"}, {"Title": "From PC to WOW", "Author": "Ed Marra", "ReviewID": "R6YYDU7L9UR0N", "Overall": "5.0", "Content": "OK I have been a PC guy for, well since the punch card...yea Im pretty old.  I always bought PC cause I had to use it for work and everyone else had PC and Windows.  I am a traveling consultant and I now see all these people with these MacBook Air and I was jealous.  I finally broke down and changed over.  LOVE IT!  I am still finding all of the little tricks to moving around in this world but the platform is STRONG.", "Date": "December 14, 2012"}, {"Title": "Over Priced", "Author": "ED", "ReviewID": "R2JF2RW6LXMUA1", "Overall": "5.0", "Content": "Over priced, but otherwise great. If you are debating an IPad vs. MacBook Air, and you are a student spend the extra money on the Air. iPad does not have a mouse option and you would have to touch the screen for some functions even if you buy a wireless keyboard for it. Also the Air has the full function program of Pages, and you can buy Microsoft Office for it as well. I love how light it is also.", "Date": "December 10, 2012"}, {"Title": "Better than any other laptops out there", "Author": "Chau Nguyen", "ReviewID": "R16PJ1LDEN6HRQ", "Overall": "5.0", "Content": "I originally had a MBP 15 but it was too heavy to use on a daily basis since I have to bring it with me to class every day. I decided to get the Air and the difference is huge. It is so light I can hold it in one hand without fear of dropping it. Thanks to the SSD, it also starts up in 3-4 seconds which makes it a great portable device and discards the need of an ipad. The keyboard is great and I highly recommend u buy a keyboard cover because the oils from ur hand will eventually create permanent smudges on the keys. Also, it protects ur keyboard from anyone who uses ur laptop with dirty food-ridden fingers.", "Date": "December 7, 2012"}, {"Title": "I was shocked!", "Author": "Josh", "ReviewID": "R3POYGSHV33NWU", "Overall": "5.0", "Content": "IT JUST WORKS!I have been an avid windows user for many years. I was very skeptical about purchasing this notebook. I have owned 5-6 laptops in the past (1 Dell, 1 Toshiba, 1 HP,  2 Asus). Each laptop died within 2 years. This was usually due to hardware reliability issues and poor cooling design.While, apple does not always have the greatest spec:price ratio, it has the best reliability:price ratio. Don't buy this if you want a computer that will last a long time.This company knows how to make a reliable and trustworthy computer. However, not only is it reliable, its responsive! As a hardware guru and pc enthusiast, I regret to say this laptop will outperform most third party windows platforms.It took some time to get used to the new OS, but it has proven worthwhile. I can get things done so much faster!! (regardless of the processing power) OSX has been designed and tweaked for excellence towards a specific set of hardware.If you have not noticed, Microsoft is developing their own hardware platform for windows 8. The slew of 3rd party companies have simply proven themselves unworthy of the OS (Dell, Toshiba, HP, ASUS, SAMSUNG, etc) If you don't get an apple platform, then wait for the Microsoft platform. FACT: OS developers build better products than those that don't.", "Date": "October 10, 2012"}, {"Title": "It seemed expensive at the time, but I will never go back!", "Author": "Andy Peters", "ReviewID": "R329WR5A6566JA", "Overall": "5.0", "Content": "I'm a real estate agent, and I've been through 3 PC laptops in 5 years.  I didn't want more of the same.  I'm an ipadder and an iphoner.  I never guessed that I'd be a mac person, but it's happening.  The SSD hard drive is awesome in this computer. No more replacing hard drives.  It's the perfect traveling laptop, and it fires up in seconds literally.  If you're on the fence, do it.  You won't regret it.", "Date": "August 15, 2012"}, {"Title": "Unbelievably light and thin!", "Author": "Ronald Hynes \"iPhone freak\"", "ReviewID": "R61JF0N0U4J0J", "Overall": "5.0", "Content": "I'm a longtime Apple Computer user.  From the Macintosh in the early 80's, through the dogs of the late 90's.  I thought my last MacBook was about as good as it gets, but this MacBook Air exceeds all expectations.  To my mind 13\" is about the optimal screen size.  I do lots of spreadsheets and any thing smaller is impractical.  It seems bulletproof.  The battery easily lasts 6 hours...really haven't tried to see what the ultimate life is since 6 hours is a normal computer work day.  I like the lighted keys and the keyboard.  About my only complaint is the touch pad which I find has an annoying delay.  My last MacBook utilized a trackpad that was a lot more sensitive.  Perhaps all the new \"gestures\" that allow many operations to be performed directly from the pad are the reason.  For my money, I'd prefer using custom function keys which are easily configured.  All and all a spectacular machine!  I purchased from Amazon for a $50 discount over Apple's price and no sales tax although shipping was about $13, if I recall correctly.", "Date": "August 10, 2012"}, {"Title": "Perfect", "Author": "Mike60", "ReviewID": "R3876R4LQ8LW2K", "Overall": "5.0", "Content": "I have had imac's, MacBooks, pro, iPads.  The air does the trick.  Easy to carry, does not get hot.  Base model is fine for most needs.  Space, multimedia, photos, docs, use the clouds.  I have a loaded imac 27 and to be honest the cost of the upgrades for me did not pan out in performance.  Don't get mr wrong, if you upgrade, you will see a performance increase.  But could not see a $300 difference between the imac i5 vs i7.  Hence, I would expect the same with the Mac air.  But we a talking $300 plus.  If you buy the base model, it's $100 less then apple store, and if your in a state with no sales tax burden, the base is a great buy.  The quality of the air is amazing.  For me it will replace my ipad, even thou I still like my ipad, the mac air does it all.  As for the air vs the pro, for a college student , the pro might be a better choice as a sole computer.  But if you have desktop, the pro is duplication, but portable.  The MacBook Air is light weight, thin, and perfect for most tasks.  IMHO the MacBook Air at $1098 is way to go.", "Date": "February 20, 2013"}, {"Title": "I can't put it down!", "Author": "Travis L \"Travis L\"", "ReviewID": "R39HHQBX2P7Z6R", "Overall": "5.0", "Content": "My first Apple was a 2008 Macbook Pro that my graduate program forced us all to buy.  While I was annoyed at the cost, I quickly became a fan of the form of the machine as well as the bombproof operating system.  However the machine was slightly large for my needs and the battery life was poor.  After 4 years of heavy use it was time for a replacement, and at this point I wasn't going back to brand X. I also needed something smaller than the Pro.I replaced it with this MacBook Air.  I did not buy Apple's extended warranty and do not recommend it based on my previous experiences.  After 3 months I'm very pleased with this purchase.- Super thin form slides very easily into the laptop sleeve on my backpack- No noisy hard drive!  It's basically silent.- Battery life is fantastic!.  I watched Stand Up Guys last week on a flight and I had nearly 5 hours left when the movie was over.- Ridiculous battery standby time means I can get by if I forget to plug it in a night.- Runs much cooler than my Macbook pro.Quite honestly I can't think of anything I dislike about this laptop.  It fits my needs perfectly for internet and media.  I'm confident this machine will serve me well over the next 3-4 years.", "Date": "January 30, 2013"}, {"Title": "9 second boot.  9.  Holy wow!", "Author": "James Lyford", "ReviewID": "R2XISAPAWNOQNW", "Overall": "4.0", "Content": "I've never been a Mac guy; I have issues with the \"closed system\" model. I work in a computer shop as a tech and I see a lot of computers.  However, we got a new MacBook Air in the other day to set up for a client.  It has a nine-second boot. Nine seconds from \"Off\" to your login screen. I have never before seen a nine second boot.  That's faster than a camel with a roman candle in it's ass.  I have put aside my issues with Apple.Build quality is excellent, though it is missing a network port and requires a $30 adapter if you want to hardwire to the internet.  Unlike early models, this one has a Thunderbolt port so you can connect it to another computer in Target Disk Mode.  That's important. Also, unlike early models, it has an SSD, which is apparently very fast.  2 USB3 ports make it very well-rounded; a lot of ultrabooks are still using USB2.I've seen a number of netbooks and ultrabooks, but this one is the fastest, by far.  If you're a Windows guy, like me, you can run Parallels or VMWare Fusion.  Cost is a little higher than you'll find in a comparable ultrabook, and if you actually need to fix something on it, you're in trouble.  These are damn near impossible to disassemble by anyone other than Apple; I knocked off a star rating for that.  But, if you've got the bread and need a really fast, powerful mini-computer, you really can't go wrong with this.  Get the 3-year Apple Care Warranty and sell it after 3 years.", "Date": "December 16, 2012"}, {"Title": "Ultraportable, yet powerful", "Author": "mudkipfluffy", "ReviewID": "R1Q25PFY0ZH3BJ", "Overall": "5.0", "Content": "I have had this for about 3 months now and have become quite attached to it. It is actually quite fast, thanks to the intel i5 processor and the ssd.I mostly use this for school (ex: typing reports, surfing the web) and for light gaming, such as Call of Duty 4 (I average around 60 fps, a decent frame rate for a laptop without a discrete graphics card.).Pros:1. good touchpad2. fast hard drive3. light and portable4. decent battery life (about 5.5 hours)5. easy to type keyboardCons:1. not enough USB ports (only 2, I would prefer 3 or more)2. sometimes crashes when it is in sleep mode3. gets very hot in the back when gaming4. sound comes from the keyboard, so when you put a keyboard cover beware of mufflingOverall, the pros outweigh the cons, making this laptop a keeper!", "Date": "November 3, 2012"}, {"Title": "There's a reason ultrabooks are being measured against the Air", "Author": "J. Silvia", "ReviewID": "R1VB6IBOCL90M0", "Overall": "5.0", "Content": "I've been a PC user for nearly twenty years. This is my first Mac. The build quality is stand out, head and shoulders against comparably priced Ultrabooks. The OS is simple and user friendly. Amazing battery life, I'm getting six hours under pretty heavy use and I can't believe it. I feel liberated from the charger! The trackpad has to be mentioned- I typically hate trackpads because they get in the way while typing, often causing my cursor to jump into the wrong place and screwing things up- not this one. The gestures are a huge plus and make navigating the system a breeze. The display is bright and very clear. HD movies look excellent. You can game on this at low settings. I've tried Diablo 3 and can confirm that it does run well on reasonable settings. If you're looking for an ultrabook style computer look no further.", "Date": "October 27, 2012"}, {"Title": "Good enough to keep me hooked", "Author": "BrianJH", "ReviewID": "RU5OE5AV3F21Y", "Overall": "4.0", "Content": "Not thrilled but happy.  Replaced an older MB Pro 13\" with this one (also 13\").  Just got the least expensive option I could live with that would keep me in a mac.  Feels like I am addicted to macs and beginning to notice they really aren't a great value yet I can't even believe how awful the windows experience is in comparison, so here I am.  Being a mac person is expensive but has saved me countless hours as an instructor and student due to superior handling of PDFs, better index searches, and stability.Pros:Very light and thin of coursevery fast doing basic tasksmigration was completely painless with time machine, done in a few minutes with nothing lostrelated to the migration, I don't need a cd drive because all the apps I previously installed from disk transferred overcreates MUCH less heat then the MB pro I hadgreat battery lifeusb ports one on each side, my old one had too little space between themCons:Screen has less vivid color than my previous machinefonts tend to be smaller than I prefer because of the high pixel count and same size screen I had before, so the fonts did in fact get smallernot much computing power for $1100wish it had firewire port, but will live withoutI always feel like I will break it, but probably just that - a feeling", "Date": "September 3, 2012"}, {"Title": "Low battery", "Author": "TomP", "ReviewID": "R15BU80F0SWQM7", "Overall": "2.0", "Content": "I bought two of these, one for me and one for my daughter. The computer has a nice design and is user friendly. However, the most critical aspect of a laptop is being able to function for a long time even when you are away from a power source. In this regard, this laptop fails miserably. My battery lasts for 2-2.5 hours only. It is so annoying that I had to buy a portable Hyperjuice battery. So now I have to carry this relatively light laptop together with a heavy portable battery. Ridiculous!!!", "Date": "November 30, 2012"}, {"Title": "Quite an ultra Ultrabook!", "Author": "WhatsTheHurry?", "ReviewID": "R2FHECU9IZAH1Y", "Overall": "5.0", "Content": "The current \"Ivy Bridge\" Macbook Air line is hard to find fault with.  As long as you keep the SSD configuration at 128GB it's not significantly different in price from a comparable quality ultra book on any OS.  If you want a precision metal case, long battery life, and a fairly hi-res display (1440x900 on the 13-inch model) in under 3 pounds you're looking at $1200+ on Windows too.Having USB 3.0 now is nice since hard drive sustained transfer speeds have long outpaced USB 2.0 and Firewire.  If you're planning to use virtualization like VMWare 5 or Parallels I recommend going with the 8GB RAM option which only adds $100 to the price.Note that you can't change anything in this computer yourself - hard drive nor memory, and there's no optical drive so buy what you think you'll need even if eventually.  For those so-inclined, the battery is user-replaceable after your warranty runs out but that's all that may ever find its way onto the table.  There's no wired ethernet on this model but you can get an external gigabit interface for about $30.  The built-in Wifi works on 2.4 and 5 GHZ and maxes out at 300Mbps because it has two antennas.Compared to my previous Macbook Pro 13-inch, this provides about twice the computing power using half the energy (=almost no heat) and 1/3 less weight.  An optical drive isn't something I think many people get much use out of any more so giving it up wasn't a sacrifice.In daily use it barely gets warm, the lit keyboard feels great, the sound is good - especially considering how thin this computer is, and the trackpad works great and doesn't ever make your cursor jump while you're typing.  Battery life is excellent at around 7 hours.  I'm not necessarily a fan of Apple the corporation, but I am a fan of great quality hardware and a solid UNIX-based OS.", "Date": "September 30, 2012"}, {"Title": "Game Changer", "Author": "John Fraser", "ReviewID": "R29N0SESWW9S9L", "Overall": "5.0", "Content": "I got my MacBook Air about 2 weeks ago now, and I haven't looked back!  I have been a PC owner my whole life, and I can honestly say after having my MacBook Air for two weeks, that I have no idea why!  Everything feels so smooth and intuitive on the Mac OS X Mountain Lion (the Mac operating system).  The trackpad actions are amazingly responsive and extremely intuitive.  This helps to increase productivity and is just a lot of fun to play with!I bought this computer to use while at Law School, and I can honestly say that I made the right choice!  I bought Microsoft Office for Mac, and it works great-just like the PC edition that I've been accustomed to.  Overall, this is the best computer I think any student could own.  Weighing in at around 2.5 lbs, it is super lightweight, ultraportable, and it looks and works great!  The display on the 13\" MacBook Air actually has a higher resolution rate than the 13\" MacBook Pro.  This is great news because it actually has a clearer picture, and the increased resolution means that you have a bigger workspace!  Furthermore, the battery on this computer is amazing!  You can easily get 6-7 hours off a single charge, probably a lot longer if you are working in a well-lit area (so you can turn down the brightness).  Another one of my favorite features is the back-lit keyboard.  It makes it great to use in low-light.  The built in web cam takes great pictures and videos, and FaceTime is included with OS X Mountain Lion, which is a great way to video call your friends and family members!Now for the fun stuff: The MacBook Air just looks amazing.  It is AMAZINGLY thin!  It is literally thinner than your standard spiral notebook!  You might think that means the MacBook Air is fragile, but you would be wrong!  The aluminum unibody is amazingly durable, and it feels very sturdy in your hand!  When I first began to look into purchasing a new computer, I put a great deal of weight into having a SSD (solid slate drive).  The SSD means that the hard drive for the computer does not move!  This is amazing because it virtually eliminates the need for a fan!  Which means, the MacBook Air never heats up (it gets a little warm, but nothing to worry about!), it is SUPER quiet (since there is not a fan always humming), and my absolute favorite fact is that the SSD means that there is very little chance of damage when transporting the MacBook AIr to and from class!  It is not going to be damaged from being shifted around precisely because there are virtually no moving parts within the MacBook Air.I spent months looking into which computer to buy for Law School, and I kept coming back to the MacBook Air.  There is a reason.  The MacBook Air was the trendsetter for all the Ultrabooks that now saturate the market.  Many of those ultrabooks are comparably priced, but none of them are as much of a complete package as the MacBook Air.  For the price, compared to similar computers on the market, the MacBook Air is truly the best of the bunch!", "Date": "September 12, 2012"}, {"Title": "The Original Ultrabook", "Author": "the Lorax", "ReviewID": "R1MS1YOJ1PAMQP", "Overall": "5.0", "Content": "I recently purchased the 13\" 2012 Macbook Air with 256GB hard drive. I've spent a good amount of time with it. These are my first impressions.Not surprisingly, the first thing I noticed was that it's very light weight. When you are traveling, and picking up and moving your laptop often, having something that's lightweight is appreciated.The next obvious characteristic is that it's very slim and compact. Unless you are fortunate enough to be flying business class, or first class, you'll be mobbed up with the rest of us average joes in coach class. There is little room on that tray table. I tried using a 15\" alienware gaming laptop once on coach, and I made myself look the fool. This will fit within the confines of your crammed seat. Even if you're a lanky 6'1 guy like me.Battery life is excellent. If you are on an international flight, a flight with a layover, or on a long road trip or train ride, you will need every minute of battery life you can get. This will net 5-7 hours depending on what you're doing, and how low you can tolerate the screen brightness being.Shutdown, Boot up, sleep, and awake times are blazing, blazing fast. Perhaps the fastest of any commercial grade laptop? This is good for a laptop because you may very well find yourself using the laptop in small spurts of time, and you'll need to put it in sleep, and wake it up more often than you would a desktop machine.Another great thing is the solid state drive. This is what gives the Air it's long battery life, and its impossibly sleek dimensions, but the great thing about solid state hard drives is that they are much more reliable than optical hard drives, especially in laptops, where they experience drops, shock, and impact more than desktops. Even a minor bump has the capability to put an optical hard drive out of commission.I remember having original iPods that had optical hard drives, and I always had problems with them. I have owned every iPod Touch generation since its first release, and not one has ever had a hard drive issue, since they all use solid state storage.So you have all these great features that lend themselves well to the purposes of a laptop. The keyboard is the best I have ever used on a laptop. Keys are well spaced, and have a crisp feel. Typing is super accurate, and the adjustable backlit keys are a welcome feature to a nightowl like myself. The track pad is HUGE. I couldnt ask for any more real estate, and I have unusually long fingers too.I spent some time learning all of the trackpad gestures, and once you learn them, web surfing, file browsing, and viewing pictures will be faster, and more pleasant. I love being able to swipe instead of pressing my browsers forward and back button. When I go to a website that has tiny text, I pinch out, and increase the font size quickly and effortlessly. I rely on clicking and scrolling on a mouse less. You accomplish tasks faster.The screen is sharp, vibrant, and gorgeous. The brightness level goes high, which you will need if you ever use it outdoors on a sunny day. But make sure to set the brightness as low as you can if you are running on the battery.The laptop is as quiet as a ninja in the night. When doing basic tasks like web browsing, or listening to iTunes, or viewing pictures, its near silent. When you are running hardware intensive programs or 3D gaming, the fan starts going, but it is still pretty quiet.Even though it has integrated graphics, this laptop is still capable of running some pretty good looking modern games at moderate settings. You can run Diablo 3, Starcraft 2, Battlefield 3, MW3, Grand Theft Auto IV, and Assassins Creed on medium settings with acceptable framerates. To me, that's impressive for a super thin laptop that doesn't have a dedicated GPU.I considered the Macbook Pro because of it's more powerful specs, but in the end, i'm confident that i'll be happier with the Air. The performance meets my needs, and the sleekness, lightweight, style, and lower price give it the edge.I have used retina displays on the iPad and iPod Touch, and I know how gorgeous it is, but still there arent very many OSX apps and websites that utilize the retina display, so I don't feel that I am missing much. Plus the Retina display demands more power, and that means more battery consumption. Still, this non retina display is still sharp and beautiful.If I absolutely needed a macbook with the best hardware, I would have chose the Pro, but for my needs, the Air handles the things I need.As far as downsides go, I like the previous magsafe power adapter better. It was thinner, and less prone to accidentally being disconnected.Like all of Apple's computers, the price isn't cheap. I can't say that you're getting a bargain. But i'm willing to pay more for a good product. I think it's worth the price. And it helps that Apple products have the best resale value of any electronics brand.I don't know how tough and durable the laptop is, since I haven't dropped it, or used it in harsh conditions for long periods of time, but I have had good luck with macs in the past. No serious hardware failures so far. And I love the aluminum enclosure, which is stronger, feels better, and is much more classy than your typical plastic bodied laptops.This is what a laptop should be!", "Date": "August 10, 2012"}, {"Title": "Everything I Need", "Author": "Samuel Claney", "ReviewID": "ROGUFBMQU1WQQ", "Overall": "5.0", "Content": "I'm a college student, and a writer, and this computer is absolutely perfect for me. There is plenty of memory and power for things I do because it's really just writing, surfing the web, using iPhoto on occasion, and using Spotify. If you were a graphic designer or video editor, this might not have enough power for you, but I've done a bit of video editing in iMovie on this, and it worked really well, and didn't slow down at all. And since I'm ususally taking my computer to class, or other places to write, the light weight is so much easier on my shoulders when it's in my backpack as opposed to the old black macbook I had. All in all, it's the perfect computer for someone whose not doing giant loads of complex work. And even then I think it would still do very well.", "Date": "August 6, 2012"}, {"Title": "I've had many of these, great computer.", "Author": "Michael Dupree", "ReviewID": "R18GYJB59MJ75U", "Overall": "5.0", "Content": "The macbook air is a great computer, I've had at least 10 of them since they were released. Highly recommended.", "Date": "February 23, 2014"}, {"Title": "Mac air", "Author": "Papagigo", "ReviewID": "R2KKHN3S1JEAL9", "Overall": "3.0", "Content": "Great computer but the  one I order could not transfer file so I returned it. Love the light weight and the portability of this laptop", "Date": "February 20, 2014"}, {"Title": "Love my mac book air", "Author": "Paul", "ReviewID": "R2G2V3J9KH1KWO", "Overall": "5.0", "Content": "It took a little bit to get used to the Mac versus my old PC but now I love, Love, LOVE my mac book air.", "Date": "February 19, 2014"}, {"Title": "great fairly priced macair-0 problems", "Author": "r___22 \"Retired physician.......proud father ...", "ReviewID": "R3P77HSCP5TLY2", "Overall": "5.0", "Content": "i would re-order.this is a great litr laptop & u can c the PRINT.Smartphones r great if u r youngand 2/20 but few stay that way.Find a good well-priced laptop.RA  r__22", "Date": "February 14, 2014"}, {"Title": "best laptop", "Author": "Jerryb", "ReviewID": "R3N6N0TZX5Q7Z1", "Overall": "5.0", "Content": "i previous owned macbook pro and i do not regret the change. the computer is everything i look for in a computer, its light, fast, and does not get hot.", "Date": "January 28, 2014"}, {"Title": "My favorite", "Author": "thatoneguy", "ReviewID": "R2BWSOQCZQHB6T", "Overall": "5.0", "Content": "Best laptop I have ever owned. Hands down. That's it. I've had custom built HPs, Dells, ASUSsss?, and others; but this has by far been the best. It has just enough of everything, and nothing you don't (Dramatic head tilt and stare at you Mr. HP Fingerprint reader). I really like the backlit keyboard, multi touch trackpad, and the actual display and hardware itself. I have never used this mac and thought \"man, if only it had a little more\". Having owned the old model 11\" and now this 13\" for quite a while I can say after everyday use and carry they are the best mobile laptop on the market.", "Date": "January 13, 2014"}, {"Title": "airbook", "Author": "Russell White", "ReviewID": "RP79IVKBPI1N8", "Overall": "5.0", "Content": "I won this in a contest. I much prefer tablets for daily use away from home, but this is nearly as compact and light as my I pad, but slightly more functional. I was in the market for a Macbook pro, but think this might be a better choice. I have not once wished for a drive for cd or dvd.", "Date": "January 12, 2014"}, {"Title": "disappointed", "Author": "Random User", "ReviewID": "R1CSMMBWKJ8UDF", "Overall": "1.0", "Content": "After a year of using the computer primarily for productivity (using basic applications) it started to fall apart. Keys have fallen out and the battery stopped about 7 months in. Fan has been replaced three times from Apple. They've been incredibly nice at Apple Support but this computer has had so many issues.", "Date": "December 23, 2013"}, {"Title": "Like it", "Author": "Limei.pranke", "ReviewID": "R1SOFK83E87Y72", "Overall": "4.0", "Content": "I got this computer a couple month ago, it is really good.  The only problem is sometimes the double click don't work very well.  This is only happen once a while, I need to figure out what caused this problem.  But overall, it is really good, light and beautiful.", "Date": "December 22, 2013"}, {"Title": "As expected", "Author": "Kenneth Payne", "ReviewID": "R3DEMVT1D0ZIK7", "Overall": "4.0", "Content": "Upgraded from a 11\" model for more screen space and larger hard drive.  Easily migrated from the old Mac Book air to the new one using the migration assistant.  All data, applications, email and even vmware ported over very easily", "Date": "September 15, 2013"}, {"Title": "Good price", "Author": "Lala Land", "ReviewID": "R204H03SWTLAY3", "Overall": "5.0", "Content": "When I know the new model is announced, I jumped on the old model and save hundreds of dollar.Why pay more for little bit performance increase??? This is exactly what I need...Again, you need to keep checking the price daily, Amazon change their price almost everyday!!!", "Date": "August 26, 2013"}, {"Title": "Love this Macbook", "Author": "Kevin \"Kevin\"", "ReviewID": "R2LT5WEQ7FIR9G", "Overall": "5.0", "Content": "I have had this macbook for almost a year and I love it. The macbook air is very lightweight and I love the aluminum case design. The speed is very fast due to flash storage. The macbook air boots up and shuts down quickly. The trackpad is made with glass and is extremely smooth. The battery life is amazing often getting 7 hours on a single charge. I also like the backlit keyboard and the high resolution on the screen making things extremely clear to see. Overall this is a great buy and is better than all of the laptops I've previously had.", "Date": "August 23, 2013"}, {"Title": "Love it", "Author": "RS", "ReviewID": "R2XYBJSZMY89CD", "Overall": "5.0", "Content": "Switched over from PC.  The best decision of my life.  I wonder why I kept using windows based PCs all these years.  Just plain and simple love it.", "Date": "August 23, 2013"}, {"Title": "The ultimate computer.", "Author": "j05hua", "ReviewID": "R17ZA1DZIFZF07", "Overall": "5.0", "Content": "There is not a computer on the market that can match the Macbook Air. It has an outstanding battery life, crazy fast speeds, and brilliant display.I have owned PC after PC and they all pail in comparison to this beautiful machine.Here are a couple of pros and cons:PROS- up to 12 hours of battery life- incredible screen quality (mine displays better than my 24 inch HD work PC)- quite and cool (no noisy fan always blowing and sending a wall of heat barreling towards your crotch)- insanely fast (This is due to the 4 gigs of ram and the solid state drive)- lightweight, yet sturdyCONS- lightweight (This is also a con because it does take some getting used to)- No disk drive (This is easily fixed by purchasing a USB super drive or using dropbox)- No way to add more ram or change the battery (This is really not a big deal to me. I am happy with the default setup)The fact is eveytime I purchase a Mac, it ends up living for 6 to 8 years. Here is my equation for purchasing a computer:Computer's Value = aComputer's Lifespan = bTotal cost per year = ca/b = cI gave my last mac away at 7 years old and it lasted another year until a glass of water was spilled on it...Equation: $1000/8That comes out to $125.00 per year. Try that out with any P.O.S asus, acer, or hp brand you have owned and see if yours does better. I am going to make a guess: no.", "Date": "August 23, 2013"}, {"Title": "awesome laptop", "Author": "Santiago", "ReviewID": "RBX7ZR6R3W7WI", "Overall": "5.0", "Content": "Ultra fast, ultra thin, ultra portable without missing performance. This is one of the best apple products in the market", "Date": "August 12, 2013"}, {"Title": "Good computer", "Author": "applecider", "ReviewID": "RP1FCWEE8LACT", "Overall": "5.0", "Content": "I have not had any system problems, except the fan will come on when it runs hot.I do not like the fact that I could not partition the boot drive.The audio volume is not very loud when turned to max. volume.", "Date": "August 7, 2013"}, {"Title": "My wife loves it", "Author": "Paul K", "ReviewID": "RQUL9DSVYWR2I", "Overall": "5.0", "Content": "Got rid of her HP and went the Apple route.  Not disappointed.  Extremely light and very fast.  I may get one for myself", "Date": "July 29, 2013"}, {"Title": "Lighweight and easy to use", "Author": "Elizabeth Peacock", "ReviewID": "RVPRML11S9BAX", "Overall": "5.0", "Content": "I love having a sleek, lightweight laptop. I was used to a bulky Dell laptop--what a huge difference! Easy to set up and get started.", "Date": "July 27, 2013"}, {"Title": "Best computer I have ever owned", "Author": "B. Rowberry", "ReviewID": "R238XW5Q8BOKB0", "Overall": "5.0", "Content": "This is my first Apple computer and without a doubt the best computer I have ever owned!  The keyboard feels amazing - I actually type faster and more accurately.  The variable keyboard backlighting is also great.  The trackpad actually does what I tell it too (imagine scrolling without fighting your computer!), the display is great, speakers are surprisingly good, wakes up almost as fast as an iOS device for quick note taking, and the App Store has great free or inexpensive utilities (like Better Snap Tool so you can easily do the half-screen split introduced in Windows 7, but better, of PDF Toolbox Star for splitting up and combining PDF documents without having to buy Adobe Acrobat Pro).  Office 2011 works great and is more stable than Windows versions of Office.  In the future I may switch to iWork, we'll so how that progresses.  SolidWorks ran better on this using VMWare Fusion than on campus Windows machines.  The battery life is just unreal and doesn't die unexpectedly - you always know exactly how much charge you have left.  iMovie and GarageBand are excellent bonuses (I don't do photo editing so I can't speak for iPhoto).  Having iMessage on here is fantastic and it does FaceTime amazingly.  One of my absolute favorite things is getting frequent and meaningful OS updates and NEVER having my computer shut down on me because stupid Windows update doesn't shut down my computer in the middle of working on something.  There is a bit of a learning curve, but once you get over that, I'm sure you'll never want to go back either.  I also recommend getting an external hard drive for backup (about $70 for an awesome 1.5TB pocket hard drive with USB 3.0) and since the 128GB isn't that big anyway.  You know you should be doing backups anyway, right?  Files transfers are often instantaneous when using a USB 3.0 ready hard drive.  Buy a MacBook Air!", "Date": "July 22, 2013"}, {"Title": "Best computer in my opinion", "Author": "JA \"G0d!sL0ve\"", "ReviewID": "RQ5J8K1E93CF8", "Overall": "5.0", "Content": "First off this is pretty cheap for a MBA. I got this computer to use for college and it is amazing. It super light, so carrying it from class to class is a breeze. I have been using Microsoft products for a while and it is really easy to figure a mac out. At this point i have absolutely no complaints about this products but i would recommend buying a usb hub (which are extremely cheap) I am a college student i would recommend this.", "Date": "June 12, 2013"}, {"Title": "mac is King", "Author": "Kenneth Cetinich", "ReviewID": "R1ON3TUDI1H6F6", "Overall": "5.0", "Content": "Small but is a well oiled machine id never go back to windows again. Well, worth the money no matter the expense.", "Date": "June 12, 2013"}, {"Title": "MacBook Air 13\"", "Author": "omar delarosa", "ReviewID": "R2JFG001R404A0", "Overall": "5.0", "Content": "This laptop is a dream to work on.  Very very light weight, but the 13\" form-factor also ensures that the keyboard is still easy to type and work on.", "Date": "June 10, 2013"}, {"Title": "Worth the money", "Author": "DONNA", "ReviewID": "RP231M458LFY1", "Overall": "5.0", "Content": "Having a mac book air is a treat. I dont know what took me so longnext step, I phone", "Date": "June 9, 2013"}, {"Title": "Love my new MacAir", "Author": "Gabi Tiefenbrunn", "ReviewID": "RWO3OX7BFT5NV", "Overall": "5.0", "Content": "Got it for business. Love it doesn't weigh anything as I travel with it. I bought the external DVD player to load a couple of programs. So glad not to have to drag that weight around.", "Date": "June 1, 2013"}, {"Title": "My new favorite travel buddy", "Author": "meggyfin", "ReviewID": "R19OCHD9P8DW40", "Overall": "5.0", "Content": "This laptop is my new best friend. I travel a LOT and bring my laptop with me so that I can work on the road. I had NO IDEA how heavy my old Macbook Pro was until this arrived. OMG, travel is beyond easy, I can seriously just slip this into my purse and go. I've been using it for months now, and can say it only bothered me that there's no cd port ONCE. But not enough to purchase one. Switching from a Macbook Pro to a Macbook Air was WAY easier than I imagined and I'm super glad I made the jump.", "Date": "May 31, 2013"}, {"Title": "excellent", "Author": "Nirav", "ReviewID": "R1F0TMNR3N2WPL", "Overall": "5.0", "Content": "apple macbook is always greatr. stylish , attractive, fast, graphics are excellent. i would refer it all my friends. just buy it", "Date": "May 20, 2013"}, {"Title": "Great product", "Author": "Fabiana E.", "ReviewID": "R19Z5X27VDZ1SN", "Overall": "5.0", "Content": "Very solid product, great performance. Super fast shipping from amazon as expected. I recommend for those who look for performance, beautiful design and apple enthusiastics.", "Date": "May 19, 2013"}, {"Title": "I love Warehouse Deals!", "Author": "E. SPENCER \"Spen_Korb\"", "ReviewID": "RSBGQYEHU5HDU", "Overall": "5.0", "Content": "Have always had a very nice experience with Warehouse Deals! If everb there's a problems, it's quickly resolved. And the reduce cost is a wonderful bonus!", "Date": "May 9, 2013"}, {"Title": "Apple Apple Apple", "Author": "selvakumaran", "ReviewID": "R2812MIW93AEA2", "Overall": "5.0", "Content": "My dream system from my child hood days.  Its really awesome.  Any other product can beat this technology.  Track pad is the awesome, doing magic.  My daughter 2 years old handles better than me.", "Date": "May 4, 2013"}, {"Title": "Best Lap Top Ever", "Author": "J. Eduardo", "ReviewID": "R1OC10E7WIW01N", "Overall": "5.0", "Content": "This laptop is great for watching videos, school work and browsing the net!  It is amazing how thin it is.", "Date": "May 3, 2013"}, {"Title": "13.3 MacBook Air", "Author": "Carol Harrison", "ReviewID": "R2I9TQRTPUMOPX", "Overall": "4.0", "Content": "The laptop is very lightweight, and starts up very quickly.  I was disappointed that the screen and screensaver is not as bright and clear as my 21.5 IMac.  I've made some adjustments and will play with it some more.  I don't use it everyday, but the battery seems to last quite well. Other than the display, I am very satisfied with the laptop.", "Date": "May 3, 2013"}, {"Title": "Love my MACBOOK", "Author": "Amazon Customer", "ReviewID": "R21YYXQVAIJ35G", "Overall": "5.0", "Content": "I absolutely love this macbook air! This is my first macbook and I will never go back to pc. It works so well, quickly, and has really long battery life! I bought mine at best buy and have had it for a few weeks. My only con is that the power cord comes out to easily for personal preference. However, since the battery life is amazing this is rarely a problem.", "Date": "May 2, 2013"}, {"Title": "Very efficient and complete", "Author": "mauricio", "ReviewID": "RMS2X5H3444PW", "Overall": "5.0", "Content": "I have always had personally chosen Apple computers since the first Classic model. All the improvements since thenwere Mac computers either the desktop models or the laptops. Apple Mac Book Air is the thinnest of all those alreadybuilt.", "Date": "April 28, 2013"}, {"Title": "It just makes sense", "Author": "Epsilon Delta", "ReviewID": "R3H03UFSB366HP", "Overall": "5.0", "Content": "I got the Yoga 13 from Lenovo and the Macbook Air 13, and I have used them for 6 months.  The Yoga 13 is ok, or \"good\", but the Macbook Air is the machine I *love*.  Everything makes sense.  It is light, quiet, the speakers are very good, the screen very good, the keyboard is very good.  It is one of the best computers I have used since 1982, for 31 years.  The PCs I have used, I may give the best one an 8.5 score out of 10.  And the Macbook Air, it is simply a 9.5 or above.", "Date": "April 27, 2013"}, {"Title": "More than I expected", "Author": "Jan", "ReviewID": "R1LIBOD9316UE7", "Overall": "5.0", "Content": "Lightweight. Easy to navigate. Very intuitive. I have always had a PC and thought this would be difficult to learn how to use. Not so.I love it.", "Date": "April 21, 2013"}, {"Title": "I like the Macbook", "Author": "Cozma alex", "ReviewID": "R30WF50441VB8O", "Overall": "5.0", "Content": "Everything arrived as advertised. The MB Air is my choice for its speed on doing everyday tasking. It has a good enough video card, but the rest suits me perfectly. I had a few crashes on my mail app, but it's ok. It runs smooth, no fan noise, no blue screen. I have no cons for this product, just pros", "Date": "April 20, 2013"}, {"Title": "nice improvements", "Author": "Miguel", "ReviewID": "R2NUREGKP6G2DA", "Overall": "5.0", "Content": "I used to have a 2010 model and it made an annoying sound when it was hot after using it for 2 hours. With this version I've had no problems I just wish it had lion so I wouldnt have to pay for it. One other thing that makes it perfect to buy it on Amazon is that there are no taxes at least in my area.", "Date": "April 15, 2013"}, {"Title": "Excellent example of the proper notebook", "Author": "DZMITRY SLAUNIKAU", "ReviewID": "R3CHGB1ZNDHD3N", "Overall": "5.0", "Content": "I like my MacBook Air and I'm ready to recommend it for every person who needs fast, durable and stylish notebook for work and for life. I use it for all my working tasks in the office. It's my eternal satellite. It's weight is very low, so it's convinient to carry it everyday without a problems. I like to control it with gestures touching my touchpad and it's really easy to do all you want with MacBook.My next notebook will be just only MacBook.", "Date": "April 13, 2013"}, {"Title": "Better Than Expected", "Author": "David Stone \"Crane\"", "ReviewID": "R1RLVDG98UN0KH", "Overall": "5.0", "Content": "From the smooth, ultra light uni-body design to the instant on feature, this computer is as I hoped it would be and more. Running the latest Apple OS and apps while I carry it easily around with me makes it the perfect digital companion I hoped for.", "Date": "April 12, 2013"}, {"Title": "Great Gift", "Author": "eurydice", "ReviewID": "RHDE71P7A8R1H", "Overall": "5.0", "Content": "I love the gift, and highly recommend, fast and efficient service. Arrived in great condition. If i could give more than 5 stars you would have gotten it.", "Date": "March 2, 2013"}, {"Title": "Almost perfect. Could use a better display.", "Author": "Matías Javier Rossi", "ReviewID": "R2W3SIHGW6BPSG", "Overall": "5.0", "Content": "Ultra portable, solid casing. Very fast and snappy. Amazing battery life, unless you use Skype or flash video too much.SSD speed is worth the limited disk space, at least for my usage. I recommend to consider buying a portable hard drive in case you don't have one to solve that limitation.Display is not as good as other Apple products, probably because it is a non-retina LCD without IPS technology, but it isn't too bad.Speakers sound flaky, but listening to music isn't the standard usage of an ultra portable anyway, and yet sound quality when using headphones is very good.", "Date": "February 26, 2013"}, {"Title": "The BEST computer I ever had", "Author": "Toren", "ReviewID": "R1AFF0FFBTI974", "Overall": "5.0", "Content": "I have the newest version of MacBook Air for more than a year now.It is the second MacBook Air after the previous version (the white plastic one, which used to get really hot after a couple of hours).This version of MacBook Air is lightweight, fast, has a long battery life, starts-up instantaneously, great WiFi, big enough screen, high rez , never gets too hot and is also stylish with the slim looks.The only downside being the lack of CD/DVD, but first I don't use them anymore and second - you can always add an external device if you must.It will not be an exaggeration to say the MacBook Air is the best computer I ever had.", "Date": "February 22, 2013"}, {"Title": "Excellent", "Author": "Empress", "ReviewID": "R165I07IKO2DYV", "Overall": "5.0", "Content": "This product at first was a little difficult to use and i wanted to return it, but i decided to keep it, but then on 2/18 i notice one of the keys was loose. I got on line and said i wanted to exchange it, low and behold today 2/19/ ups was at my door with my replacement laptop. LOVE IT, EXCELLENT SERVICE, wouldn't trade for any other laptop, it's worth the price. Amazon keep up your EXCELLENT service i give you guys 5 stars, and i wish i could give you more stars.", "Date": "February 19, 2013"}, {"Title": "Apple MacBook Air MD231LL/A 13.3-Inch Laptop (NEWEST VERSION)", "Author": "John R. Dockery", "ReviewID": "R3N0VGM4T1038Z", "Overall": "5.0", "Content": "It is light, fast, has updated software available  which could not be loaded on the older model.Yes I would recommend it to others.I dislike the way pictures look after transferring from other computer. The appearance and arrangement is not good.John", "Date": "February 19, 2013"}, {"Title": "You Gotta Love Macs!", "Author": "Living the Life", "ReviewID": "R1TSA7WAP75DDE", "Overall": "5.0", "Content": "What a great laptop. Well worth the price. Works flawlessly. Feels and acts like a precision instrument! Mac forever, as far as I'm concerned!", "Date": "February 4, 2013"}, {"Title": "Pretty much Brand new open box", "Author": "Defender007", "ReviewID": "R15VUQDHR5BH9Q", "Overall": "5.0", "Content": "Worth the money I saved compared to the sealed boxes. The warranty was never started either. Full one year when I got it. Excellent!", "Date": "February 4, 2013"}, {"Title": "Good product. No supprises.", "Author": "Dimitar Kolev", "ReviewID": "R5ORA6KCMNBGB", "Overall": "5.0", "Content": "With this product you get exactly what you expect - good build, good screen, one of the best trackpads (if not the best), instant reaction, fast on regular tasks.", "Date": "February 4, 2013"}, {"Title": "Perfect Portable", "Author": "Gary Hays", "ReviewID": "R3P18K9HN4SCRW", "Overall": "5.0", "Content": "This laptop feels orders of magnitude more powerful than my 2008 13 inch aluminum MacBook. And It feels like a feather in the hands compared to the old laptop too. The new Os is snappy and plays well with the multi-touch track pad.Keep an external disc drive at home and call it a day because this is all the laptop most people need and will keep you happy.", "Date": "January 29, 2013"}, {"Title": "One of purchases that i can never regret.", "Author": "SHSO", "ReviewID": "R2FMDBRROCZ0ST", "Overall": "5.0", "Content": "I bought two of these. My husband wanted to give one to his brother and his wife and one for us. We are laptopoholics and have manyyyyyy laptops and comppyters at home ( partly because we have a software business and need to test our software on different paltforms) Anyway, these are our first APPLE computers and all of us are loving this....this is extremely lightweight and fast and good looking. I am a little unhappy with the battery life, it drains out a little faster than our other laptops(dell,HP etc)but anyway, It is an amazing laptop and since we got it on a deal I dont think we will regret this decision :) Love amazon !", "Date": "January 29, 2013"}, {"Title": "Great pc for everyone!", "Author": "Alejandro Frankenstein", "ReviewID": "R1QQVTPULS2IEE", "Overall": "5.0", "Content": "Powerful, light and very usefull for my activities.Harware and software is the best convination.No problem of any kind!", "Date": "January 29, 2013"}, {"Title": "Awesome", "Author": "Lynn Charles Wright", "ReviewID": "R2RXQT0W4BNI36", "Overall": "5.0", "Content": "Incredible Mac.  I have owned Mac's since 1984 and this one is just too good.  It's lightweight, fast and compact.  I use it for business since I travel often.  The compact size makes it easy to travel with and I now play movies on the airplane on it instead of my iPad.  Since I acquired the 13\" Mac I don't need to travel with a computer and iPad.", "Date": "January 27, 2013"}, {"Title": "No complaints", "Author": "Peter", "ReviewID": "R3VKJGE0UEZJ7M", "Overall": "5.0", "Content": "This is an upgrade from an old MacBook and I've been very happy. Starts quickly, lightweight, certainly faster than my old laptop, screen resolution is much better, and I really don't miss the DVD drive. And at a nice holiday discount, too. All in all, no complaints.", "Date": "January 8, 2013"}, {"Title": "Truly Amazing", "Author": "Gadget Lover", "ReviewID": "R11WV0JHN6A4IJ", "Overall": "5.0", "Content": "This was a gift for my nephew. He is only 8 but very smart. I wanted a powerful notebook but something light and small for him. The MacBook Air being an apple product, I knew would be 5 star quality. The fit and finish is first class all the way. The huge plus and why I am writing the review is that a 13.3\" laptop is under 3 lbs with 7 hours of battery life. What other company puts out a product even close for only $1100? The use of the solid state drive is a big plus in this price range and did I mentiion a 13.3\" screen and under 3lbs. I now want one for myself.", "Date": "January 5, 2013"}, {"Title": "Love my Macbook Air!", "Author": "L. Burns", "ReviewID": "R3E0BSTW04XG0M", "Overall": "5.0", "Content": "This is a very easy-to-use laptop. I work in IT (primarily with PC's) and am loving the fun and easy to use aspects of the Mac products.", "Date": "December 27, 2012"}, {"Title": "Bad ass", "Author": "Spencer", "ReviewID": "RCJFXCLE0YB3O", "Overall": "5.0", "Content": "So I was really hesitant between the air and the pro. I have owned multiples of each. The cons of the air is that what ram you get, you keep you can cannot add more. Also the battery can not be swapped at home, unlike the pro. After monitoring my usage I found 4GB of ram would be adequate. I only do very minor music and video editing. The added cost of apples ram isn't so bad but you can't get it via amazon (saving discount plus taxes)The computer is itself is like everything apple designs. Beautiful and elegant. My MacBook Pro took multiple falls from 4 feet onto concrete. One time with the screen open, kitting the screen and bottom at the same time. Multiple battle scars a bad battery and 4 years later it still sold for 550$ on eBay! Beat that pcs. You just can't loose with apple", "Date": "December 24, 2012"}, {"Title": "Good laptop my kid just loves it", "Author": "D. Wong", "ReviewID": "R10UK6IOT7OEZI", "Overall": "5.0", "Content": "Bought this on black Friday at very good price. My high school kid was looking for a thin laptop, so I just grabbed it when I saw it on sale.  My kid loves the iMovie as he has been using it to make YouTube video (channel J4FP2).  This laptop is lighter than any Windows ultrabook on the market and the built and finish is unbeatable.  I see other manufacturers are copying its design (e.g Samsung).  I tried the Windows 8 laptop and its just confusing.  The touch screen may look cool at first sight, but not sure how much useful it is in practice.  It may get confused at times.  The other reason I bought the Mac is to avoid any virus issue down the road, I don't want to be technical support for my kid.  I think you will like it.", "Date": "December 24, 2012"}, {"Title": "Lightweight and awesome!", "Author": "sexysherri", "ReviewID": "RI9KG1XV41HRF", "Overall": "5.0", "Content": "I decided to purchase a MacBook Air after my 5-year old MacBook started to become too slow, I hope it lasts as long as my previous one. The computer is very light, very beautiful and the battery life is amazing! I can use it all day without needing to charge. As advertised, it wakes up from sleep mode almost instantly. I use Microsoft office seamlessly and love the OS, everything works well and is plug and play right out of the box! Will definitely buy another mac when this one gets old as well!", "Date": "December 22, 2012"}, {"Title": "A perfect laptop for developers", "Author": "Gourav", "ReviewID": "R2D4IN6EFJMEDG", "Overall": "5.0", "Content": "No doubt this is rated as #1 laptop this year, fast, sleek and light weight. I Can't ask for more!With i5 processor, 4 GB RAM and 128 SSD it's really fast!", "Date": "December 5, 2012"}, {"Title": "MAC book Air is all that it calimed", "Author": "Steven Beers", "ReviewID": "R2C12NEPT6UZ0U", "Overall": "5.0", "Content": "The computer is light, fast and easy to use.  The only drawback is one which is known from the outset for Microsoft users and that is the fact that you have to employ an additional step or two to get the programs to run.  But that was no surprise and the facility and response available from the MAC Air makes it a true pleasure to use.", "Date": "December 4, 2012"}, {"Title": "First Time Mac User is Happy!", "Author": "Meli S \"Melissa\"", "ReviewID": "R24SJRV392O1V0", "Overall": "5.0", "Content": "I have always been a PC user but have wanted to switch to a Mac for a couple of years, just didn't have the money.  This year has been more successful in my business so I started saving and saw this was on sale (I had always heard Macs don't go on sale) and with free shipping and no tax it was a better buy than purchasing locally.  The computer was shipped in the time frame specified and exactly as described.The Migration Assistant program to migrate my PC to this Mac did not work and after several calls to tech support (I must say Apple has the best tech support I've ever talked to) and a trip to an Apple store, I finally gave up and had a computer guru I know come over to copy my files and such from my PC to my Mac.  Once this was done, I was ready to go and have now been using my Mac for three days and love it!  I now know why I've heard so many people say \"Once you go Mac you'll never go back\".It is different than a PC in many ways but so far has been easy to adjust to.  Probably helps that I already had an iPhone so was somewhat familiar with the Apple interface.The computer itself is so sleek and compact, much lighter in weight and size than my old laptop and keys have a nice touch.I can now say I am a Mac user and happy.", "Date": "August 23, 2012"}, {"Title": "Apple MacBook Air MD231LL/A 13.3-Inch Laptop (NEWEST VERSION)", "Author": "mikeb", "ReviewID": "R1EY59KTKGHEKI", "Overall": "5.0", "Content": "Super fast with free upgrade to Mountain  Lion. SSD allows one second boot up. Gestures take a while to get used to but then are a natural thing. Very light and portable.", "Date": "July 28, 2012"}, {"Title": "Decent computer but constant issues with display", "Author": "Taylor", "ReviewID": "R3NJ4NBBS6CZQO", "Overall": "3.0", "Content": "Overall this laptop is ok.  Its fast and easy to use but I have had some issues with the screen. I have had it about 6 months now and the screen had a bright spot develop near the bottom of the screen that was really distracting.  After I could not stand it anymore, I took it in to the Apple store to have it looked at.  They replaced the screen but it took them a week to do it.  When I got it back, the screen was badly misaligned when the laptop was closed so after I complained about it they tried several more times to fix it.  Finally they had to replace the screen again but it was still not aligned properly like it was when I purchased it.  They then told me it was all they could do and they would not do any more to fix it.  The technician said It was a common problem but only cosmetic so I am out of luck.  I though Apple products were supposed to be higher quality than this.  My wifes cheapo budget laptop has a better screen and its aligned properly.  She makes fun of me for wasting my money to but this one.  I am not really impressed with the quality of the product or service at this point.  Way overpriced for what you get.Other than that, it still works reasonably well.  I do like that its light and thin.  Its also pretty fast thanks to the SSD.  Not sure I will buy a Mac again though after this experience.  I do like the Mac OSX though, just not impressed with the hardware.  I might just have to make a hackintosh after this one.I am an IT specialist and have experience with a great deal of different computers and laptops and I can say there is nothing special about this one.  Should have spent my money on a more powerful windows laptop instead for the same price.", "Date": "January 10, 2013"}, {"Title": "beautiful computer but too small", "Author": "Danielle", "ReviewID": "R3RUO0EXY2U334", "Overall": "3.0", "Content": "This is a beautiful computer. It is thin, light, does not overheat. No radiation heat headache or skin burn from this computer. You don't even miss the disk drive. When you think about it, everything is downloaded now. Disks are not used that often, and when they are needed, there is the option of an inexpensive external disk drive.It's simply an amazing computer. Turns on in seconds when you gently tap the button. Super fast. Quiet. I can't say enough good things about this computer. I love it but needed to return it because the print was very small and not adjustable in some areas. The toolbar print is ridiculously small and not adjustable. Web text is adjustable. But for me, no matter how many times I changed the font or adjusted the resolution, my eyesight was not good while using this.I also found I was needing an extra port that was not there. No big deal. The positive definitely outweighs any small amount of negative with this computer and it will be great for anyone that uses it. This is the perfect travel computer. I did not want to return it, but I just felt it was too small. I'm really hoping apple will release a 15\" Macbook Air. I love the design of this computer I just wish they offered a larger screen size.", "Date": "June 29, 2012"}, {"Title": "Didnt know that apple change version in 2 weeks", "Author": "norberto hosaka", "ReviewID": "R10ISGZAWVVF7M", "Overall": "3.0", "Content": "I bought this computer and two weeks later apple sell a new one cheaper !!!I fell like stupid buying this old version", "Date": "June 16, 2013"}, {"Title": "The MacBook Air is ideal for anyone.", "Author": "jhdmbd", "ReviewID": "R11X9UDDNXKGWK", "Overall": "5.0", "Content": "The MacBook Air is more than it appears to be. The thinness of the Mac is very useful. As a college student, I constantly need a computer that I can slip into a small space and take out again when needed. The Mac Air definitely fits this need. Also, the MacBook Air starts up very quickly. This is very helpful anywhere, especially in college. You can quickly open you Mac and take notes with no delay.My Mac Air has never frozen as so many other brands often do. I have never had any complaint about it. It has served me well. This computer supplies all needs that I have as a student. However, it is also very useful for many other areas. Its thin frame and light body make it a computer like no other.  I definitely recommend this Mac for anybody, regardless of what they need it for.", "Date": "May 10, 2013"}, {"Title": "More than Applesauce", "Author": "Robert Randle", "ReviewID": "R19SS2XI04NET4", "Overall": "4.0", "Content": "The Air is just that, air.  It's sooo light and easy to handle.  Screen has great resolution and it's fast.  Being a long time (and old) PC user, it's taking a while to learn the power of this new OS, but getting there.  Still, all in all, the MacBook Air was a good idea.", "Date": "March 20, 2013"}, {"Title": "Greatest computer ever!", "Author": "Helen Turner", "ReviewID": "R6V4RSSTF1KRY", "Overall": "5.0", "Content": "I have owned several laptops but this one surpasses all of them. I like everything about this computer. I can't think of anything that I don't like. I would recommend this computer for anyone. Wish  the price was less but its worth every penny. I checked all the stores & I got a better price from Amazon than any other store.", "Date": "March 16, 2013"}, {"Title": "awesome,but....", "Author": "allenp", "ReviewID": "R5OSUWVP1DUOL", "Overall": "4.0", "Content": "I very much enjoy my air. It is very fast and weighs virtually nothing. The draw back is the audio. It is not loud at all. i recommend buying headphones or speakers. I also have a problem of closing the laptop and it restarts and i sometimes lose my programs. I recommend a case and warranty because they scratch and get dirty easily.", "Date": "March 14, 2013"}, {"Title": "Great product", "Author": "Thassius", "ReviewID": "R1E23PSXWFM1SN", "Overall": "5.0", "Content": "It is a really well constructed computer with the best operating system. The SSD makes the MacBook Air just fly. Please, choose the 256 GB version.", "Date": "February 16, 2013"}, {"Title": "TecMonkey Buyer Beware", "Author": "Robert H. Kurz", "ReviewID": "R1LP7RFIJJDTIN", "Overall": "1.0", "Content": "TecMonkey does not stand behind their products and it they fail past 30 days - there is no recourse. Purchased two Lenova desktops, the monitor went out after 90 days and they refused an solution.", "Date": "May 8, 2014"}, {"Title": "WARNING - READ THIS BEFORE YOU BUY APPLE", "Author": "Frank Erfurth", "ReviewID": "R3MYEN8PU8VK6H", "Overall": "2.0", "Content": "If you are purchasing an Apple computer for ease of use and a super user-friendly GUI, go ahead and push \"BUY IT NOW\".  But if you are migrating over to Apple to take advantage of the apparent bargains to be found in the professional software arena (Music Production, Video Production, Graphic Arts, etc.) I am issuing a warning that Apple is lying to you.  Apple has implemented an aberrant pricing policy that varies widely from the industry standard pricing policy for professional software.  Apple, in true corporate fashion, has made this change without warning or notice.  The new policy is NO PATH TO UPGRADE.  You heard me right.  If you pay professional software prices for a piece of Apple software, and two months later they release the new and improved package, you will be stuck paying full price for the upgrade.  Do you feel like you got a deal now?  You have now paid more for your software than if you had gone with the industry leading software package (PreSONUS, Adobe Premiere, CorelDraw, etc.) and next update, you will be well behind the pricing curve.  I do not have a problem with Apple software, but rather the sneaky way in which they implemented the pricing policy.  If you are buying Apple to take advantage of these apparent deals...save your money and stick with a PC.  You will pay more initially for your software, but within a year you will be saving money.", "Date": "September 5, 2013"}, {"Title": "Doesn't get any better", "Author": "Joshua", "ReviewID": "R2ENZHMHYVS78J", "Overall": "5.0", "Content": "Wonderful laptop, the best I've ever owned.  Boots up so quick and plenty of storage and speed for any task.  Not to mention it is a beautiful machine.", "Date": "July 12, 2013"}, {"Title": "Superb Laptop", "Author": "Larry", "ReviewID": "R2FFNYF9PQ3LU4", "Overall": "5.0", "Content": "This is a laptop that I've been wanting ever since it was released. It is truly an elite laptop compared to no other. It is lightning fast and extremely light to carry around as well as being durable! Just get it, you won't regret it.", "Date": "July 3, 2013"}, {"Title": "Works as advertised", "Author": "Brian J Williams", "ReviewID": "RJX862UMKLSCH", "Overall": "5.0", "Content": "This is my first mac computer, after using windows pc's and laptops for many years and getting more and more frustrated with slow speeds I decided to buy a macbook air. It does everything that is claimed, the flash drive hard drive gives an almost instant boot up and I am extremely satisfied with it.", "Date": "May 19, 2013"}, {"Title": "Love my new Macbook Air", "Author": "Ruthie Reeves", "ReviewID": "R1O1ZIK82TIPMA", "Overall": "5.0", "Content": "I love this computer, so compact, easy to carry to work. It's really fast and does everything I want it to and more.", "Date": "May 15, 2013"}, {"Title": "excellent", "Author": "Yinping Rue", "ReviewID": "R1Q7JPX6KY6WAL", "Overall": "5.0", "Content": "its like the new one. good quality. It is well worthy it, much cheaper than the product in apple store.", "Date": "May 12, 2013"}, {"Title": "excellent", "Author": "gw", "ReviewID": "R1QTZ5BBNYRC8V", "Overall": "5.0", "Content": "The mac book air arrived on time and everything about it is superb! It is sleek, light, fast and stable. I enjoy every minute of using it. No what whether I am doing home finance or relaxing with some video watching, it is fun! I was a long time PC user, but now a converted Mac fan! Highly recommendable. Go get one! Money is well spent on this one.", "Date": "May 5, 2013"}, {"Title": "love", "Author": "kara lee", "ReviewID": "RRM4OEE26GD22", "Overall": "4.0", "Content": "apple products are expensive, but reliable and gorgeous and.... too bad no ethernet connection or CD slot tho or else perfect!", "Date": "May 4, 2013"}, {"Title": "beautiful computer", "Author": "GARY FUSS", "ReviewID": "R2BO8ECRW29A7P", "Overall": "5.0", "Content": "I received a beautiful computer in less time than I expected. It was a pleasure doing business withthis person. I would recommend this person to everyone...", "Date": "April 30, 2013"}, {"Title": "Trying A Mac", "Author": "Billy", "ReviewID": "R2GG7X26WT92UK", "Overall": "5.0", "Content": "Need a lightweight laptop so tried this one because of less trouble with spam and viruses. So far it seems to work out for me. Some things I like better about windows but no big issues.", "Date": "March 17, 2013"}, {"Title": "I purchased the Macbook Air 13 to replace a Macbook Pro 17 -- it is great!", "Author": "Michael Gardner \"Mike\"", "ReviewID": "R319F8CEHZ8Q9J", "Overall": "5.0", "Content": "I was skeptical about replacing my Macbook 17, after ordering the Macbook Air 13, it arrived in 2-days and has worked perfectly ever since I put the electricity to it.  It is a terrific computer and I am glad I bought it,", "Date": "March 10, 2013"}, {"Title": "Love it!", "Author": "jda", "ReviewID": "R388A9YLF8HZ1J", "Overall": "5.0", "Content": "It was all i expected. Still learning. Price better than Apple even though product brand new. Why is the question", "Date": "March 5, 2013"}, {"Title": "Mac Book Air 13.3 inch laptop", "Author": "Warren Horne", "ReviewID": "R2ACCCYE7484W3", "Overall": "5.0", "Content": "I purchased two of these at Christmas.  I really love these Laptops!.  They are very well made!.  They are easy to set up, do not crash, they're fast and a joy to use.  I can not beleive that Apple can put this much computer in a package as light and powerful as this.  Just to be clear on a couple of things, I and my family are long time users of DOS/ Windows operating based computers.  We all know that with a windows based poerating system, the user is always having to \"fiddle\" with a setting, defrag, clean up or tune up the system.  This does not seem to be the case with these Apple units. In fact I also own an I phone and the Air Port extreme, all with no issues.  I purchased a Mac Laptop for a family member ten years ago.  To this day it has not had the first hardware or software issue.  I have another family member that purchased a desk top and an I pad at the same time and again, not one issue.  I might add that when I purchaced the Mac Book Air, I was on my third Dell during the time the one family member was on and still is on the first Laptop.  This is what I have learned from this purchace.1.  Apple, well done on the MacBook Air!2. Apple, well done on the AirPort Extreme!3. Apple, well done on the I phone!  I have the 4S.4. For those of you who for some reason like to bash Apple, well...... grow up.  I watched other people use their products for years before I ever purchased the first Apple product.5. I would never ever buy another computer  that did not have a SSHD.  It makes a world of differance6. I have never had a lap top that will run seven hours continuiously off of one battery charge.  This Mac Book Air will do that.7.  I installed Office Mac on two Mac Book Airs, and I have not had any issues.Anyone looking at a laptop, should take a serious look at Apple's offerings.  Like me, you may be asking yourself why you had not made the switch sooner.  Again I say, Well done Apple!", "Date": "February 4, 2013"}, {"Title": "Great computer", "Author": "Mark Sherman", "ReviewID": "R3GAFNA9JZA6M7", "Overall": "5.0", "Content": "The solid state drive is one of the reasons I love this computer.  It starts up fast after being inactive for a while and it is very quite and stays cool as well.  It turned me into a Mac fan.", "Date": "January 28, 2013"}, {"Title": "Exchange 2003 unsupported", "Author": "Benjamin H Randolph", "ReviewID": "R2P0NSM2J7HOFT", "Overall": "3.0", "Content": "While I do wish my company would accelerate to 2007 or 2010, its still baffles me that the new Mac OS Mountain Lion does not support Exchange 2003....you have to use a clunky intermediary application to convert your exchange to an IMAP account.  Defeats the purpose.  Otherwise, the laptop is GREAT.  Super fast processing and with the Solid State is awesome.", "Date": "January 22, 2013"}, {"Title": "Gorgeous!", "Author": "Yash Divekar", "ReviewID": "R1HY9OLNXM9MNK", "Overall": "5.0", "Content": "Absolutely brilliant- like all Apple products!Apple's attention to detail is simply mind blowing and the overall design and engineering is world class", "Date": "January 20, 2013"}, {"Title": "Now We're Talkin'!", "Author": "TheDoug", "ReviewID": "R3M2ECAB5TNQCS", "Overall": "5.0", "Content": "This is the best Apple product I have ever bought, and the challenge of learning how to use some of the different programs has caused me to sharpen my skill set. This is a pricey computer, yes, but worth every penny.", "Date": "January 14, 2013"}, {"Title": "Perfect!", "Author": "Kimberly A. Weatherley", "ReviewID": "R3K155FFJ2T2PV", "Overall": "5.0", "Content": "I traded in an iMac for this computer because I wanted something light and portable. I love Apple products. I have absolutely no problems with this computer. It works great! It's beautiful and light, too.", "Date": "January 14, 2013"}, {"Title": "Best Ultrabook EVER!", "Author": "L. Rivera", "ReviewID": "R2JCFMH3YLVXCM", "Overall": "5.0", "Content": "I'm so happy with this purchase! After using Windows PC's for years; I'm amazed how simple it was to learn using this computer. Extremely glad I made the switch.", "Date": "January 12, 2013"}, {"Title": "Superb!", "Author": "Ravi Iyer", "ReviewID": "R28R0BUQK5O0PM", "Overall": "4.0", "Content": "Faster than my old MacBook Pro. Lighter than my old MacBook Pro and good enough to go. Extremely light and easy!", "Date": "January 5, 2013"}, {"Title": "Why didn't I switch to MAC earlier?", "Author": "P. D. Mehta", "ReviewID": "R480PDNBIMZAR", "Overall": "5.0", "Content": "So light, so fast, and so easy to use. I did not realize how much better a computing experience this computer was until I switched from Windows 7 to OS X.", "Date": "December 25, 2012"}, {"Title": "It is a good choice", "Author": "Alex", "ReviewID": "R3HHU746Z6SRYD", "Overall": "5.0", "Content": "I want to using it for programming and its multiple desktop make programming much more confortable because of easy switching , I love it", "Date": "December 25, 2012"}, {"Title": "its a mac, buy 2", "Author": "Eric Stein \"ericbase\"", "ReviewID": "R2US9EEYO2GILM", "Overall": "5.0", "Content": "solid product, no moving parts. starts right up. I use it more than my 27 imac due to speed, buy 3", "Date": "December 25, 2012"}, {"Title": "Fantastic, at a price.", "Author": "C. Worsley \"uttvguy\"", "ReviewID": "R3IP2E17683R8R", "Overall": "4.0", "Content": "This is my fourth apple laptop and I can say that the quality of the construction continues to improve. The design and functionality are second to none. My only complaints are the so so HD size and the price. Obviously they weren't enough to keep me from buying it, but an annoyance nonetheless.", "Date": "December 25, 2012"}, {"Title": "New Apple MacBook air", "Author": "Alejandro Martinez", "ReviewID": "R377UMOO76D3DV", "Overall": "4.0", "Content": "Tremendo acierto de Apple , aunque un poco costosa para las características ( poco dd) el diseño es espectacular excelente opción para viajar", "Date": "December 25, 2012"}, {"Title": "good price", "Author": "Saleh Mohammed Al-turki", "ReviewID": "R1EL0HDM74DJBS", "Overall": "5.0", "Content": "good pricesend it in a good timethank u so much. ,. . .. . . . .", "Date": "December 25, 2012"}, {"Title": "Recommend people buy apple laptop", "Author": "Ruggy", "ReviewID": "R3T6UCYJVU5L1W", "Overall": "4.0", "Content": "This is a good laptop!!! The heavy of this is light, even this is 13 inch. And the function in it also is diversified.", "Date": "December 24, 2012"}, {"Title": "VERY GOOD", "Author": "Fozan", "ReviewID": "R1US1RJ7QMEJUX", "Overall": "5.0", "Content": "it very good and it is in very good quality and very good shape and the package's is very good", "Date": "December 17, 2012"}, {"Title": "very compact and quick", "Author": "A. M. Steiner", "ReviewID": "R37DPL4WYXW363", "Overall": "5.0", "Content": "I like this. I wasn't going to get one but on black friday they had such an incredible deal I decided to get one for work. The battyer life is good when browsing the web or other low processor applications. Going on to intensive applications such as Jalbum, photoshop or imovie and it will deteriorate quickly. I still like this laptop. It is sturdy and super light.", "Date": "December 8, 2012"}, {"Title": "Love it!!!!", "Author": "Big Jimmy", "ReviewID": "RRKOFJ5598AAP", "Overall": "5.0", "Content": "I was very hesitant about buying the 128GB Air.  I originally bought a MB Pro but within a 2 week time frame I had to take it in to the Apple Store twice.  The last time I said I'm done..  Returned it to Amazon then bought the Air.  I do LOVE it!  I love the portability factor and how speedy it is.  I don't think i'd ever go back to a MB Pro after this.", "Date": "November 7, 2012"}, {"Title": "I really should have switched to Macs earlier", "Author": "CostBenefitAnalysis", "ReviewID": "R2XB3Z6Y7JAB1P", "Overall": "5.0", "Content": "I am a long-time windows user and this is my first Mac. I've decided to switch to macs because of 1) extremely good experience with iPhones and iPads (I admit they are not perfect, but they are by far the best package I've tried, and I used to be very into gadgets until I started using iPhone/ iPad); 2) saw my roommate using it and was really impressed by the battery life and the size.It's my first week owning it and so far, all I can say is, wow... Mac is just so easy to use! I'm usually pretty good with computers, and by using all the shortcuts and gestures of the trackpad, using the laptop is just such a pleasurable experience!I recommend this 2012 Macbook Air whole-heartedly to anyone who's looking into a portable laptop (as opposed to a workstation, gaming gig, etc).", "Date": "August 23, 2012"}, {"Title": "Best ultrabook on the market", "Author": "Yu-jin Chia \"Yu-Jin Chia\"", "ReviewID": "RAF4OOV0E4RRX", "Overall": "5.0", "Content": "I was looking for a replacement for my big 15\" laptop and decided to go for an ultraportable this time around. I like the brute power and screen resolution of larger laptops, but have seen new ultrabooks that rival those in even those areas. That sold me, especially coupled with the fact that I'm tired of carrying around a 6+ pound machine.Most consider Apple to be a premium, expensive but aesthetically-pleasing brand, and in most respects they are. However, at this point in time the MacBook Air 13\" is really not a bad deal from a hardware standpoint. I did a lot of looking and spec-reading, and it simply looked the best from a cost/performance standpoint. The fact that it looks cool and is Apple branded is just icing on the cake. My next choice was the high-end ASUS Zenbook. Toshiba and HP's offerings also caught my eye, but were all clearly deficient in at least one area (usually CPU) in order to boost battery life. I understand the tradeoff, but I'd rather have 10% more CPU power than 10% more battery life.In comparison to the Zenbook, the Mac Air has a smaller capacity SSD for equivalent price, and slightly lower resolution screen. However, it's got a faster processor and SSD. I'll admit that the last one is a bit subjective since they're both pretty fast and are running different operating systems, but that is my judgment based on familiarity with Win 7 and OS X 10.7 boot times on similar hardware. What decided it for me hardware-wise was the keyboard. The Mac Air has essentially the same keyboard as the 15\" Mac Pro, and it's probably the best laptop keyboard ever made. The Zenbook... well, it's different. I guess some might not mind it, but I kind of do. Additionally, the 256 vs 128 GB of SSD space is not a significant difference the way I look at it. If I'm going to be storing massive files like videos, I'd use an external USB 3 HDD anyway, and 128 extra GB isn't going to make much difference (especially when you factor in how much larger Win 7 is than OSX).On that note, I'd say it's debatable whether OSX is better than Win 7 overall, and I still use the latter for games and such. However, if I'm not planning on running games I'd say there's little doubt that OSX is more streamlined for general tasks. That's what I'm using this machine for, so I count that a plus.Note- the 'good' one is the base 13\" model. The stock 'high end' one is not a good deal, as all you get is a bigger SSD.Pros:Excellent keyboardOSX 10.7 and iLife (iMovie beats the snot out of Windows Movie Maker)Good performance with turbo-boost i5, GMA 4000 and 4 GB of RAM. Fast SSD.USB 3.0 for fast external data transferScreen has good resolution- better than 13\" MBP and way better than any netbook.Cons:As with all ultrabooks, not easily modifiable or expandable.", "Date": "July 14, 2012"}, {"Title": "still adapting to it", "Author": "Kurt M Helm", "ReviewID": "RYD2H3K8BS6QY", "Overall": "4.0", "Content": "Is a nice peace of electronics but very different to the windows world, maybe I will appreciate it more over time", "Date": "February 9, 2013"}, {"Title": "Fast and Light", "Author": "AK", "ReviewID": "R2XA43V3W89A2W", "Overall": "5.0", "Content": "Very please with this product. The SSD really shows its teeth even when comparing it to my Macbook Pro. The speed and portability of this Macbook Air is great, just what one needs if they need to be ultra portable or need something small. I was for a long time anti-Mac but after using them more for work and personal use, they really are great. They keep going, and keep going at the same rate they started at, quick, and efficient.", "Date": "January 22, 2013"}, {"Title": "Exactly what we expected.", "Author": "M Clark", "ReviewID": "R2UHTC2F7Z8Z7U", "Overall": "4.0", "Content": "Just what we expect from Apple.  Finest quality and workmanship.  Easy to get started and works great.  Only 4 stars because Apple products are so expensive.", "Date": "December 27, 2012"}, {"Title": "First Mac Ever -- Will Never Buy A PC Again.", "Author": "Robert Hebron \"Avid reader\"", "ReviewID": "R37S10NTES3HN4", "Overall": "5.0", "Content": "This is my first Mac ever. I love it. I have been a PC user for 20+ years. My work demands that I be on a computer 18 hours/day. My new Mac makes it soooooo much more enjoyable.It runs cool and silent. No moving parts! I am not sure why people say this unit is so fragile. They must be rough or clumsy in general. I baby ALL of my electronics. They all get covers and cases to protect them. I always treat my computers very carefully/cautiously.I've owned my Mac going on 8 months... and it is NOT a flimsy/fragile machine --  it is EXTREMELY lightweight! I can work from my lap all day long and hardly notice it.I LOVE IT! I also highly recommend getting yourself a clear, plastic shell. They run $15-$30. On an additional note, the lighted keyboard is very easy on old eyes.I also own an iPad and an iPhone... EVERYTHING is integrated seamlessly... all of my docs, memos, to-do's, etc. If I take a pic with my iPhone, it is transferred to my Mac automatically. Ditto for notes, docs, etc. What a concept!I will NEVER go back to Windows.... even Windows 8. I have it and... ugh. Never. Forget it. I'm sold 100% on the Mac.", "Date": "December 14, 2012"}, {"Title": "Love it.", "Author": "D. J. Holloway \"Sirron girl\"", "ReviewID": "R183S3IRYGRSDK", "Overall": "4.0", "Content": "Fully met my hopes for the ideal laptop.  I am a lifetime Apple fan but this is a high evolution of the computer.", "Date": "December 9, 2012"}, {"Title": "The best $1200 I've ever spent. Period.", "Author": "J. Murphy", "ReviewID": "R2AFLVZKWBCS6", "Overall": "5.0", "Content": "Birthday was coming up and didn't really want to spend bday money on a computer for work. But, with my iBook getting really (really) old, I needed to upgrade. This thing is amazing. Super lite, super durable, SUPER fast, and super usable. About the flash drive - you really don't understand how much faster a flash drive makes a computer until you use one. My wife has a 2010 Macbook Pro and this thing blows it away as far as start-up, opening programs, etc. And despite not having a CD drive, you still have many options to make a CD/DVD. Because I have an old 2004 iBook and my wife has her MBP, I can \"borrow\" (through CD/DVD sharing) one of those drives to rip/play/burn a CD/DVD. I've already ripped a couple DVDs so far. This borrowing, though, only works with Macs. I also use Google Drive (can't stand iCloud) to store everything so that anything I do on my Air, I have available at my PC at the office.Didn't want to spend the money, but SOOOO glad I did. Best present ever!!", "Date": "October 12, 2012"}, {"Title": "Convert", "Author": "Matthew Louis Dufrene", "ReviewID": "R2ZOEC4Z6LNC3K", "Overall": "5.0", "Content": "I've always been a windows advocate; until now.  This UNIX based OS X platform is great.  Completely learned the system within a days time.  The multi finger gestures are unbeatable.  If your hesitant about leaving the windows comfort zone, you won't be disappointed.", "Date": "September 25, 2012"}, {"Title": "Good. But Battery?", "Author": "Andrew", "ReviewID": "R2G21NZT8FV9V3", "Overall": "5.0", "Content": "When I first got it, everything's good, except for the battery life. 13\", Wifi on, screen 30% and a few random applications. The estimated battery life is 5:33. It is less than the \"Up to 7 hrs\" as said on apple.com. And the MagSafe 2 is kind of loose.Besides that, everthing's good.Oh by the way, for those who would like to buy an SDHC card to expand the storage spaces(including myself, as they are so cheap): the Card does reach out around 1/3 to 1/2 of an inch from the slot, instead of completely hidden inside. (I used to have a HP and it's the hidden kind(with less than 1/8\" hanging outside). You only need to push and the card would pop out. That's convenient.)And I do think this laptop looks kinda fragile and probable need a case or at least a good sleeve. I'm trying to find one, but it seems most case now would double the thickness of it, which means losing its one of the proudest advantages.", "Date": "July 23, 2012"}, {"Title": "LOVE my new Macbook Air", "Author": "TiffPro", "ReviewID": "RURDX4EHV4SBE", "Overall": "5.0", "Content": "We purchased this last week & I LOVE it! Up till now, I have had PC's. The Macbook is so much more streamlined & user friendly. Things just work, when you open the lid, it comes right up to the log in screen, no having to \"wake it up\". My iPhone connects seamlessly & I can easily download pictures from it to my Macbook. Connecting hardware, like my printer, was a snap. I just plugged it into my Macbook & it popped up a window asking me if I wanted to search for the drivers. I told it yes & it searched, downloaded & installed the printer in a matter of mins. It is light, but feels very durable. It has 2 USB ports, I've never needed more than 3. The power plug magnetizes to the computer, which is wonderful for me, I tend to have power plugs that fall out of computers. The bottom of the computer does not get hot because there are no any moving parts inside. We got the computer from an Apple store & bought the OneToOne service where you can go back in with your computer & have them teach you how to use it. I wasn't sure I would use the service, but there are SO many different things that you can do with the computer, that I recommend you get this service. I also love all the touch sensitive things you can do with the touchpad. SO much nicer than a regular PC. My husband, who wasn't convinced at first is now jealous & wants one for himself! Now I just have to find a cover that I like as much as I like the computer!", "Date": "July 2, 2012"}, {"Title": "Beautifully made, fast and easy to use, portable. Not as much customization, horrible battery life", "Author": "kylie \"kylie\"", "ReviewID": "R12GODDAKC0YJE", "Overall": "4.0", "Content": "The thing about Apple products is that you always need to buy more accessories just to PROTECT your product. I have had this item for about a day and I feel like I need a case and a sleeve for it. Then again, it is a very nice product, made to be displayed beautifully and its aesthetics were meant to be appreciated. With my previous windows laptop, I honestly did not care much for scratches and dents on its exterior surface. If you're paying close to or over a grand for something, you better make sure to take care of it.As far as functionality, the interface is easy to use, beautifully designed and breathtaking. I am being spoiled and I know it. There are a few more options that I would like available to customize my dock and folder options, but maybe I just need to do more research. The multifunction trackpad is heaven sent and if you are  a stickler for efficiency, the Mac will win you over.I found it a pleasure to work on this piece of art. It super light to carry around and the power cord isn't bulky and heavy, making it so much more portable than my old laptop.In conclusion, worth the investment.", "Date": "January 30, 2013"}, {"Title": "Repeat Customer", "Author": "Pinetar321", "ReviewID": "R15C28LL7JTS38", "Overall": "5.0", "Content": "I once had a macbook pro 13\" and lost it. I was determined to buy another since my God does apple make great computers. If you're reading this review, you probably already know all about macbooks and want to get one. This one is amazing for the price. I picked it up for $1020 tax-free (retail $1200) and couldn't be happier. Do yourself a favor and click the order button.", "Date": "November 26, 2012"}, {"Title": "Spend another $100 for 8GB of RAM", "Author": "Michael Drips \"Book junkie\"", "ReviewID": "RVEB4988AAKE4", "Overall": "5.0", "Content": "I bought my MBA direct because I knew from experience that investing an extra $100 to upgrade to 8GB of RAM was worth it. The extra RAM increases performance significantly. Other options not shown on this site are the 512GB SSD and a faster CPU.The last Mac I owned was the Macintosh II which cost $5500 in 1990. I own several PCs but having owned all 3 generations of the iPad got me spoiled as to instant on computing, so I thought I would try the new MBA.It's great, but I am still going through a learning curve on all the commands and operating system features.I did purchase the Level 8 case at the Apple store which is designed to carry both a 13\" MBA and an iPad, plus it's TSA compatible, so you only have to open it up and lay it flat at airport security.The two software products I've installed are Office and Norton Internet Security. I'm not that much of a foolish Apple fanboy to ignore the probability of getting hit with malware or a virus from the Internet.I considered the 11\" MBA, but as I'm older I felt the 13\" would be better based on my eyesight. It's a very nice light, fast laptop.", "Date": "July 3, 2012"}, {"Title": "What an Ultrabook", "Author": "Servo \"Servo\"", "ReviewID": "R2MIBXQQ2GTYFN", "Overall": "4.0", "Content": "I reluctantly bought this because I was a Windows power user but after working with a network engineer he stated Apple is the future in private industry. I took the plunge since he stated Parallel 7 can allow you to run windows on mac. After 2 weeks of use this has to be one of the best ultra books  I ever used. Thin, light, and powerful with the option of windows. if you just want something simple Mac os is easy for average users simple clean and easy but if you want a power pc that is light this is a good purchase at max specs. I use my windows software with no issues and the mac side has better development software for pictures, movies, and office than windows. A great buy for it's size and features worth every penny. Just on thing expensive accessories but it is worth the investment.", "Date": "July 18, 2012"}, {"Title": "Macbook Air 13\"", "Author": "G. T. Wilson", "ReviewID": "R3OMHQ3UE2Y3NH", "Overall": "5.0", "Content": "This is without a doubt the best laptop I have ever purchased.Much faster than I initially thought it would be. Has taken everything I have thrown at it with relative ease. (I'm a software developer).Battery life is excellent. I routinely get 7+ hours a charge.Display is very bright and clear. I've abused my eyes for 25+ years behind computer displays so this is no small point.Light as a feather yet very sturdy.Almost zero noise from the fan under a normal load. Under a very heavy load it is still surprisingly quiet.Although I am not a fan of chicklet-style keyboards, this one has managed to not annoy me. Good size, layout, spacing and just enough travel. Ample palm rest for even large hands. The backlighting is a very nice touch.The multi-gesture trackpad is extraordinary. Hands down the best one I have ever used. This is the first time I have not reached for a mouse out of frustration. I don't even pack one in my laptop bag now.If this thing proves reliable and long-lived, I don't see myself ever going back to a PC-based laptop again.", "Date": "June 24, 2012"}, {"Title": "Buggy product", "Author": "BAO MAI DUY", "ReviewID": "R22ZXIONY77BFH", "Overall": "2.0", "Content": "I bought this Macbook Air because of recommendation from friends. However, first day the laptop could not connect to my home wireless network. I have tried at my work place, my friend home; but nothing seemed to work. I brought the laptop to apple store for service. After the service, I could connect to the wireless network after that service; but web page freeze all the time. My iPad which also used the same wireless network had no issue at all. I had also try again at work place, and friend home. The web page and app store  still freezing. I had to brought the laptop back to apple store for sevice again.", "Date": "August 22, 2012"}, {"Title": "Great portability, not so great guts..", "Author": "bmckinney", "ReviewID": "R33ZKRZBXLCZTQ", "Overall": "3.0", "Content": "I have owned many macs over the years, and I might have made a quick jump on this one.  I purchased the 11\" this past October, and I am already to go back to my macbook pro.  The first thing you notice when you get it, is the screen, it is definitely made of a different material, and it doesn't have nearly the same quality as the macbook pro does.  The memory that comes stock on these is also not the best.  I am not to worried about the disk drive, as it is almost 2013 and you really don't need anything to read a disk, cause you can get it mainly online now days.  It is definitely light, and very portable, but I would suggest for anyone to spend a couple hundred bucks more and purchase the macbook pro.  It comes with better processor, better built in memory, and a lot better looking of a screen, it is by far my favorite mac product ever made.", "Date": "December 17, 2012"}, {"Title": "beautiful laptop!", "Author": "margaret m still", "ReviewID": "R1DTIH8LLGNFU6", "Overall": "5.0", "Content": "Fantastic laptop!  Arrived in perfect condition and I'm really enjoying learning all it has to offer.  Very high tech product.", "Date": "December 25, 2012"}, {"Title": "Always the best", "Author": "Ronald", "ReviewID": "RX0ROEJHMCT53", "Overall": "5.0", "Content": "Best OS(operating system), best hardware designs, superior quality, super light, no PC can get near it. If you are looking for computers to help you to do the job, this is it. but if you are looking for computers that need your help, then PC is for U.", "Date": "December 25, 2012"}, {"Title": "Great laptop", "Author": "aashish", "ReviewID": "R14SNJXVN323Q4", "Overall": "4.0", "Content": "if you want something thin and lightweight..which gives excellent performance..this is what you should get..it is a little pricey though..", "Date": "December 9, 2012"}, {"Title": "Mac Air", "Author": "patrick mills", "ReviewID": "R25MUMV8ZIC1XA", "Overall": "5.0", "Content": "Love this mac, light, easy to use, would tell all my friends how great and easy this product was from Amazon.", "Date": "December 9, 2012"}, {"Title": "Best laptop", "Author": "Michael", "ReviewID": "R28TGLO8EMGJBI", "Overall": "5.0", "Content": "As expected, this laptop is very easy to set up and very fun to use.Highly recommend to all especially those who haven't tried Mac.", "Date": "December 9, 2012"}, {"Title": "Love it!!", "Author": "Jennifer", "ReviewID": "R4557D8WMDZY9", "Overall": "5.0", "Content": "I was weary to get a mac because I haven't had much experience using one, but decided to take the plunge. I have had my macbook air for a few months now and I still love it. It is so light and easy to transport. It has pretty long battery life and so nice it never  overheats the way my HP did. You also easily adjust to the mac features and way of navigating.", "Date": "December 2, 2012"}, {"Title": "Blazing fast and easy to use", "Author": "C. Kim", "ReviewID": "R1MBNF54DLUH0I", "Overall": "5.0", "Content": "The only downsides to this computer are 1) the 128 GB harddrive and 2) the lack of ability to user upgrade components such as RAM.  At first I thought the lack of optical drive would bother me but I realized almost every piece of software can be downloaded and if push comes to shove, you can buy and external optical drive for about $30.Also, the 128 GB harddrive can be expanded with an external hard drive.  The only one that really bothers me is the lack of ability to upgarde yourself.  The 4 GB of RAM is probably not enough but I didn't want to over pay from Apple to get the RAM and the price on Amazon was way cheaper than on the Apple website.Otherwise, this computer rocks and the amazing style, size and design are superb!  Worth the few extra hundred dollar premium to windows based ultra books or sleek books.", "Date": "November 29, 2012"}, {"Title": "Rocks!!!", "Author": "T. Pugh \"B1GTED\"", "ReviewID": "R2MH8FXX70EH3C", "Overall": "5.0", "Content": "The Mabook Air just rocks.  I gave up a iPad 3 \"New iPad\" to buy this.  I the ipad works good for most stuff,  but when you need a real computing OS,  OSX beats IOS hands down.  The ability to download whatever you need is a plus in my book.  Speaking of books,  the macbook air is smaller, lighter than any book I have carried.  The weight is awesome. The size, the layout, just works great.  I recommend this laptop for anyone that is concerned about size and weight.  It is the perfect size.  Amazon always delivers.  I ordered this laptop and Fedex lost it right after they picked it up from Amazon.  When I didn't receive it the next day as scheduled,  I called fedex and they confirmed that it was lost.  I called Amazon,  and even though it took 3 calls to get them to understand the urgency of the issue, they handled it with flying colors.  Thanks Amazon for making it right!", "Date": "November 21, 2012"}, {"Title": "Son got it and its perfect - as expected!", "Author": "Bigdaddyota \"Bigdaddyota\"", "ReviewID": "R34BSU43ODRRCE", "Overall": "5.0", "Content": "Take it Out of the Box and start running with the short introduction and initiating your profile, that's it. Now you have fun and look out for the App's you need.", "Date": "November 11, 2012"}, {"Title": "Nice piece of hardware", "Author": "M. Zerko", "ReviewID": "ROAUBCGTIJ5TD", "Overall": "5.0", "Content": "Very thin, light, long battery life. Just have to be careful that where I leave it as it is so thin, I might have trouble finding it in a pile of papers.", "Date": "November 11, 2012"}, {"Title": "Excelent", "Author": "V. D. Jose \"JoseNumis\"", "ReviewID": "R1OHFVKZFZR1DQ", "Overall": "5.0", "Content": "Great!!I passed from a pc to this mba, and i am totally satisfied. Not that i didn't like my other pc, i did, though this one is just perfect!it came sealed in box, everything just as stated, very happy with the acquisition.", "Date": "September 28, 2012"}, {"Title": "Right Decision", "Author": "Mindi J.", "ReviewID": "R1HZUWWUO9RMBF", "Overall": "5.0", "Content": "I was looking for a second laptop and was considering getting another Macbook Pro, but after reading reviews it seemed that the Macbook Air might be the better option. Glad I took the time out to make the right decision, the Air is much more responsive.", "Date": "September 24, 2012"}, {"Title": "First Mac in years, and completely satisfied", "Author": "Jennifer", "ReviewID": "RDO84MHNNM4RC", "Overall": "5.0", "Content": "Using strictly company issued laptops for the past several years (in combination with a Samsung netbook for personal use) I haven't regularly used a Mac since around 2005. Now, after having used my Macbook Air for the past couple of months, I have to say that I'm completely pleased with the purchase. Very light and mobile (the battery lasts several hours), it's as convenient as a netbook, but with a much larger, stunning display (and it's certainly more powerful, too). I use it mostly for word processing and online research.For me the biggest plus is the gesture enabled trackpad (I honestly didn't think I'd like it at first, but I grew accustomed to it almost immediately) -- it's perfect for browsing the Internet. I'm so happy that I didn't opt for an inexpensive laptop.", "Date": "September 18, 2012"}, {"Title": "Great laptop!", "Author": "George Diaz", "ReviewID": "R2B0HNA7M7A3K3", "Overall": "5.0", "Content": "Great laptop!  Very lightweight!  Well made, as most Apple products are!  Would recommend to anyone who wants a lightweight, easy to use, powerful laptop!", "Date": "September 1, 2012"}, {"Title": "mac book air", "Author": "Jerry Smith", "ReviewID": "R203RJ8TFQGT6L", "Overall": "5.0", "Content": "got this mac book air for my wife and she loves it ,fast ,clear pic ect all good .buy one you,ll love it", "Date": "August 26, 2012"}, {"Title": "Best Laptop ever!!!", "Author": "E. Castagnetti \"Enrico Claudio\"", "ReviewID": "R18CAR5VF2CCZB", "Overall": "5.0", "Content": "I bought my Apple MacBook Air MD231LL/A 13.3-Inch Laptop (NEWEST VERSION) one week ago and I love it!!! Best laptop I ever had. It's fast, super fast. Also I got the Sena 13\" Folio Case for MacBook Air to protect it. I'm really happy with my purchase!!!", "Date": "August 24, 2012"}, {"Title": "asweome +++++", "Author": "shrikikumar", "ReviewID": "R1BK07J1MW9PIT", "Overall": "5.0", "Content": "i am so glad to own new macbook air.It is so amazing...worth for the money.I strongly recommend this product.", "Date": "August 22, 2012"}, {"Title": "One word: Sublime.", "Author": "Pat", "ReviewID": "R2KI4S42ORQF8D", "Overall": "5.0", "Content": "This is with out a doubt the best laptop that can be had at this price range. If not because it sports the latest Ivy-Bridge, amazing unibody design, USB 3.0, Thunderbolt, and many other cool features, then simply for the damn trackpad. I'm serious, go into an electronics store, and try out the trackpads on other ultrabooks and you will be immediately struck with the feeling of amazement on how such a simple part of a computer can make or break an immersive experience. And Mountain Lion takes full advantage of this wonderful trackpad. Sure, OSX does take a bit to learn when switching from a Windows OS, but in the end it honestly is more efficient at doing the things you love doing (surfing, writing e-mails, watching videos etc.)Overall this is a superb laptop. It may seem expensive at first, but Macs last so long, and they are built with such attention-to-detail that it makes the couple extra hundred bucks worth it. And yes, Macs used to be overpriced, but with this Macbook Air, that \"Apple Tax\" is dwindling ever more rapidly. You won't be disappointed!", "Date": "August 21, 2012"}, {"Title": "Macbook Air (2012)", "Author": "Atilla Lazar", "ReviewID": "R3IW03HJO50069", "Overall": "5.0", "Content": "Bought my air through a reseller on Amazon.  Great experience from DataVision.  They were not in stock after I ordered it and emailed me personally to let me know it would be a few extra days.The Air itself is awesome.  super lightweight, runs great, and can handle starcraft 2 and diablo 3 well.  a great all around comp.", "Date": "August 20, 2012"}, {"Title": "the best one", "Author": "Simon", "ReviewID": "R37GNNNPDNLHZG", "Overall": "5.0", "Content": "i was a windows user i have have to say there is no way that im going back to windows, and abaout this mac, if you really need to always carry your laptop with you like i do this is just the perfect match.", "Date": "August 6, 2012"}, {"Title": "Battery will not charge", "Author": "ddude", "ReviewID": "R1QZRO2Z70OPV8", "Overall": "1.0", "Content": "Had this only 3 months and now the battery will not charge no matter how long I leave it plugged in.", "Date": "March 24, 2013"}, {"Title": "Sleek, Fast, Light and Amazing", "Author": "Lockdup", "ReviewID": "R194YFQO87V7MO", "Overall": "5.0", "Content": "Received my MBA today, and boy, was I happy. Great product. Had trouble syncing earlier bc I've been a PC guy all along but it was fairly easy after I read some forums.  It is a bummer that this doesn't have vga, hdmi, and ethernet ... but then that is why there is a MBP. Overall, very satisfy with the product plus the discount from Amazon!", "Date": "December 29, 2012"}, {"Title": "I like my macbook air", "Author": "Rainlily", "ReviewID": "R25O9A0LYOT03J", "Overall": "5.0", "Content": "When I received my macbook air, I was very exciting. IT'S a good computer. I like it very much. It's very thin and very beautiful.", "Date": "September 25, 2012"}, {"Title": "Still Prefer PC", "Author": "Robert Carlton", "ReviewID": "R1Z75ZAQ4J1AVF", "Overall": "2.0", "Content": "I've always used PCs but I decided to try a MAC based the reviews and because they are known to be trouble free in terms of viruses.  But after buying it and trying it for about two weeks I decided to return it.Its a nice computer but everything is different.  For me to be able to use my computer \"right out of the box\" without any problems was the most important thing.  I had trouble with the \"really annoying\" voice help system.  I couldn't get it turned off for days.  And there were other small things that were just a little different.The final issue with me was compatibility with a writing program I hoped to use.  It required a lot of modification to the download to get it to work with a mac and I hate stuff like that.Anyway, so I started asking myself why I spent more on a computer I don't like?  So I got a PC.", "Date": "December 9, 2012"}, {"Title": "The multi-touch trackpad is the worst thing about this piece of crap", "Author": "D", "ReviewID": "R727QJM4MK3MZ", "Overall": "2.0", "Content": "The multi-touch track pad has allot of functions which makes for a nice case of \"bat s*** haywire\" later on. PLEASE PURCHASE A WARRANTY ON THIS!!!!! I have read MANY different people's posts on forums that experience the same problem. One minute you will type something and if you click send it will erase the text, it highlights things I have no intention of highlighting, opens programs when moving your cursor past a program icon, has ended up sending emails when all I do is click to read them. I bought a warranty with it so I fully intend to have it fixed, but I am here to tell you that YOU NEED TO DO THE SAME, BUY A WARRANTY!!!", "Date": "December 21, 2012"}, {"Title": "Niceeee", "Author": "Sheila Baker \"sheilab\"", "ReviewID": "R9MWUHNTFU0GY", "Overall": "4.0", "Content": "It's small and compact, like the features.  I think it's needs something like Microsoft excel other than that it's a cool laptop.", "Date": "November 29, 2012"}, {"Title": "Mac forever", "Author": "severed head", "ReviewID": "R3V2RZK1ZJ4N1X", "Overall": "5.0", "Content": "I've been a Mac user since the first iMac came out and haven't been disappointed yet. This is the best iteration of the Mac concept so far", "Date": "November 23, 2012"}, {"Title": "MacBook Air", "Author": "G1", "ReviewID": "RNFAAA8681TDJ", "Overall": "5.0", "Content": "Just super!Setup was a breeze and working with it is a pleasure!The iCloud is something that is real nice.", "Date": "October 26, 2012"}, {"Title": "excellent", "Author": "GeerChen", "ReviewID": "R2JY8N5LM5VZIG", "Overall": "5.0", "Content": "So fast, light, beauty......OMG  NICE PC EVER  ...my wife love it so much.  Hope everyone like it and apple release more friendly price for everyone.", "Date": "September 16, 2012"}, {"Title": "La mejor maquina en el mercado.", "Author": "Juan Munera", "ReviewID": "R2N7NNM8RH3PXC", "Overall": "5.0", "Content": "Es una maquina excelente. El peso es sensacional lo que facilita la portabilidad. Fácil de manejar incluso para los que venimos de PC.", "Date": "August 27, 2012"}, {"Title": "Amazing Mac!", "Author": "DribbleCastle", "ReviewID": "RR0ED5YQVU3SC", "Overall": "5.0", "Content": "I've had many Macs over the years but this is Air is amazing.  Upgraded from a MacBook Pro (mid 2010) and its way faster in every way.  It actually has me using my iPad (3rd gen) less which is surprising.  It's just so light and the screen and battery life are great.  Retina screen would be the only improvement but I still think thats 1 1/2 - 2 years away.  I purchased a 13\" i5 / 4GB / 256GB,  its plenty fast but I decided to return it and future proof a little with a custom build 8GB RAM and 2.0 GHZ i7 processor direct from Apple.  Cost a little more but I think it will also help with resell value.  I usually only keep my Macs for a little over 2 years before I sell.What ever model Air you get, there is a very high chance you will love it.", "Date": "July 3, 2012"}, {"Title": "Most Amazing one ... Yet", "Author": "phatdesign", "ReviewID": "R3VZHVE3M6JU2Z", "Overall": "5.0", "Content": "I have been with Apple for long time, and by far this is the most amazing Mac i own yet.  Battery life is way better and charge faster. Lightweight ... everything is just amazing.  You falls in love with it in about 20s after turn it on.", "Date": "June 29, 2012"}, {"Title": "Macbook Air", "Author": "Abby", "ReviewID": "R2F420XYORK1RQ", "Overall": "5.0", "Content": "I have recently bought this computer because I needed something that I could carry around and do my homework on. I love that this computer is very light and small, but is also very durable. When I bought it, I was a little nervous that it would break easily, but that is not the case. The computer starts up and shuts down very fast. This is nice because I am an inpatient person. The last computer I had did not have a built-in microphone and camera. I like this feature very much because I use Skype a lot to meet with groups for my classes. The one thing that I don't like is that it doesn't have a cd drive on the side. Overall this is a great computer and has done everything that I expected it too.", "Date": "June 21, 2012"}, {"Title": "Battery Life issue", "Author": "Chris", "ReviewID": "R2IOTNWZZ9JLNY", "Overall": "2.0", "Content": "Such a disappointment. The laptop is great and agree with the other reviews. We already had one (version 2010) and it works like a charm. Unfortunately, I bought the 2012 version where the battery last 2 to 3 hours if you are lucky. For me, the battery life and weight are the most important for a laptop. I read a lot of things, contacted apple, went to apple but I am still with a great piece of hardware that I need to plug every 2 hours. Apple lost it and they are now too big to be customer focus like in the earlier days. This is my last Apple purchase. Sorry Steve but your legacy has lasted less than a year.", "Date": "November 4, 2012"}, {"Title": "excellent but expensive", "Author": "kate", "ReviewID": "RLR3K7BY0Z2JU", "Overall": "4.0", "Content": "If there was a similar product i would have bought it. However, after reading all the reviews of various laptops, macbook seems to match what i needed. I would have given 5 stars if it wasn't too expensive.", "Date": "November 4, 2012"}, {"Title": "madeline", "Author": "Gumdrop", "ReviewID": "R1XPT6B3CUJG1I", "Overall": "5.0", "Content": "I was a little scared to buy this since it is so much cheaper than you can find almost anywhere but I am So happy with my purchase!Best computer ever and brand new! The box had plastic wrap on it.This is the best deal you can find and everyone should buy it! you won't be disappointed! :)", "Date": "October 23, 2012"}, {"Title": "Look Somewhere Else", "Author": "Tuffle", "ReviewID": "R14JROU6NQS0S0", "Overall": "1.0", "Content": "My family owns a lot of Apple products, and this by far is the worst. This was my first Apple computer, and probably my last. I didn't expect there to be so many issues encountered, as I was unfamiliar with the differences when I first bought it. A few are that there is little to no storage (I'm constantly being reminded that I have less than 1 GB left of 60), barely any riveting games available to Apple (Except The Sims--But be careful, because you have absolutely NO storage to support it), and the act of carrying around a separate CD drive can be obnoxious.I must admit, the Movies feature is impressive and useful for school projects, but that's about it.Congratulations Apple, I've officially been converted.", "Date": "June 24, 2013"}, {"Title": "$700 repair even with warranty", "Author": "Jim", "ReviewID": "R2HKDWN9TUM3C8", "Overall": "1.0", "Content": "I just spent $700 for a repair on my Macbook Air that has a warranty.  It was only the track pad that wasn't working.  First story was that the repair was covered under my warranty.  Three days later the story was that  there was water damage and I would have to pay.Given the issues with compatibility, the premium price, and the issues with the warranty, I have to consider something else for my next computer.  Apple is good for user ease, synchronizing with other Apple devices, but it is behind the curve in technology and features and overpriced.iWorks is not as good as Word/Excel.  I have to duplicate everything that I share so that my documents and spreadsheets can be opened by my friends and colleagues.My next computer will likely not be an Apple.", "Date": "October 21, 2012"}, {"Title": "Buy a Netbook for $249 if you are not sold on the name \"Apple\"", "Author": "A. Gupta \"Andy G\"", "ReviewID": "R2TE2CJNFZWWN3", "Overall": "1.0", "Content": "I bought this thinking it is a good machine with good features.To start being an Apple or Mac fan can be really expensive or I should say a rip off. The productivity software, the anti-virus, the accounting software, the HDMI ports, you are looking to replace everything with this purchase as nothing that you owned before works.I agree with the graphics and some hardware superiority this machine might have over others, but I am not a gamer, and I do not focus on pictures and music a lot, so this MacBook Air goes back to Apple store after 24 hours of me having it.", "Date": "March 7, 2013"}, {"Title": "Delicate, Easy to Break Screen", "Author": "Chris&Karma", "ReviewID": "R3I9WW2M01L6QJ", "Overall": "1.0", "Content": "I purchased this \"new version\" of the Macbook Air as a birthday present for my wife when it was first released.  First off let me say that she absolutely loves the thing, but that being said I HATE it.  About 3 months after I purchased it she broke the screen. It is the only thing not covered in the warranty. I replaced the screen at a cost of $750. It broke again, and I replaced it for $750. Now, once more, it has a broken screen. I will obviously not be replacing it(this makes my wife cry). I gave this product the lowest rating possible because I feel like it breaks by design(She never broke any screens util she got this laptop). The screens on the older version of Macbook Airs can be fixed for around $250(perhaps Apple was not satisfied with this reasonable repair cost). I am so irritated that Apple would make something so breakable, so expensive, that I will not ever be purchasing an Apple product again. I am left feeling like Apple makes real cool products that are designed to break real good, and it is working out real well for them.", "Date": "August 13, 2012"}, {"Title": "Sad but Apple not honouring commitment to free Upgrade to Mountain Lion", "Author": "Rohan", "ReviewID": "RGAHW0PFWS628", "Overall": "1.0", "Content": "I received my Macbook Air yesterday. The first thing that I tried to do was to upgrade the OS to mountain lion as this laptop came with a free upgrade. But to my surprise/Shock , even after repeatedly going through a tedious process of submitting the proof of purchase and delivery for the Macbook air that I have purchased through Amazon.com, I still kept receiving the same one line response from Apple saying \"Receipt does not indicate product was paid for and received\". What do they mean by product was paid for and received , when I have already given them a photo of my mac with  serial no.  and a Amazon Invoice and package tracking with status delivered.It's difficult to understand how else a customer can prove the same.It is very sad to see customers to be given a run around when they have been committed something by the Apple, that too for a $ 20 item. One of the reasons that for then not honouring their commitment is that Amazon is not one of their Authorized reseller. This clearly means that Apple would like to force their customers to purchase only from their own website or stores , which is highly anti- competitive and illegal in my opinion.  Overall ,It has been a very bad experience for me buying the Macbook on Amazon , coming from a long time loyal Amazon customer.", "Date": "July 31, 2012"}, {"Title": "BUY IT BUY IT BUY IT!!!", "Author": "4yoyo", "ReviewID": "RB06RL87V6Z7N", "Overall": "5.0", "Content": "DONT LISTEN TO ANY BAD REVIEWS ON THIS COMPUTER! Apple is a great company and will help you with anything you need. This computer makes you feel like a techy person. LET ME STRESS THIS TO YOU.......EVERYTHING IS EXTREMELY EASY TO DO. you can explore everything and feel fantastic. the internet opens for me probably .5 seconds! and not to mention how thin and extremely light this lapop is! Just buy because you will NOT regret this decision.", "Date": "June 27, 2012"}, {"Title": "Not enough RAM.", "Author": "Adobe Master", "ReviewID": "R9XZIOH8K67QN", "Overall": "1.0", "Content": "Too slow for a $1400 Computer. It should come with minimum 8GB Ram.Total mess, I will be returning and purchasing a ASUS instead.  They have higher screen resolution, faster CPU and More RAM for less money. And overall ASUS is a superior brand.", "Date": "October 9, 2012"}, {"Title": "Screen resolution not great and no HDMI", "Author": "surfca", "ReviewID": "R1S3F6TMCPR4NG", "Overall": "1.0", "Content": "I really like the style and build of this laptop but I cannot get over the screen resolution. For me, fonts not being sharp and crisp is a deal breaker. I googled the issue to find that many are experiencing the same complaint. If you read a lot and look at small text, the fonts are automatically smoothed (anti-aliasing) which is a default by Apple. I have found a few tweaks to adjust this but it is still does not solve the resolution issue. Also, for the price, it would have been nice to get an HDMI port. I don't think its pratical that I now have to go and but another cable in order to use HDMI.", "Date": "July 22, 2012"}, {"Title": "Macbook Air Sucks", "Author": "Lee", "ReviewID": "R1TMNSF6XH1VL9", "Overall": "2.0", "Content": "Really not happy with Macbook Air.  Without Adobe Flash Player, the computer is very limited.  I am afraid to download it onto it because of the problems others have had with crashes.  Whatever conflicts Apple has with Google, Adobe, and others is not good for Apple's customers.  Would not recommend this item to anyone.  I have to use my old Dell Laptop for Facebook and Youtube Videos.  Anyone looking to buy this product should first check out it's limitations.", "Date": "January 15, 2013"}, {"Title": "Dnt buy Apple Mac Book Pro With Retina Display", "Author": "baba2kul", "ReviewID": "R5XPOOEEOB1E6", "Overall": "1.0", "Content": "I spend 3000 bucks for this stupid mac book pro retina display and it does not function well? Everything lags. I went to genius bar and they say my hands are tied and wait for update to see if that fixes. I should not have bought apple!The problems are:1) The wifi does not work2) The wake up screen freezes too long3) The noise of graphics card is too huge when watching movies4) When I slide between the desktop it freezes atleast sometime before it come backs to normal5) The safari is the worst browser.a) It lags when you scroll in safarib) Lately, when I open safari and slide between the deskstops it takes foreever as if the trackpad is not working.c) It keeps logging me out of facebook.d) It is dirupting the display when you scroll the pages.6) When I try to use mission control it simply lags very ugly.7) The battery performance is worst. It not even close to 7 hrs as in advertisement.8) Its not even quieter when I watch movies or any other applications as told in advertisement.9) I did not have credit card so I did not make apple account so when I formated my computer as directed by the apple customer care I had to buy OS X mountain lion againg.And I spend 3000 bucks for this laptop and when I go to genius bar they expect me to just listen they can't help anymore. Why did I even buy this thing?", "Date": "March 12, 2013"}, {"Title": "Does not ship with latest OS", "Author": "Norman", "ReviewID": "R5Z6OV3P49TTZ", "Overall": "1.0", "Content": "This is not a complaint about the machine but about Amazon. We purchased this computer on Sept. 20, 2012, and it shipped with OS 10.7.4 -- well over a month after 10.5 was released. Amazon customer service was unable to help. It is annoying that we have to pay for the OS upgrade after buying a new machine. We will probably have to return it and order another one. Of course I guess there's no guaranty Amazon will ship that one with the newest OS.", "Date": "September 22, 2012"}, {"Title": "Sleek, beautiful but under powered for the price", "Author": "jonahrobertpierce", "ReviewID": "R39J0SEWG9CXI9", "Overall": "1.0", "Content": "Great deign and user friendly interface, but it simply isn't worth the money. $1500 for 250 gigs of storage? Insane! The computer i just built has a 2 terabyte hard drive which costs $120", "Date": "January 28, 2013"}, {"Title": "Apple's standards down the drain...", "Author": "JCLopez", "ReviewID": "R2BTEJINSJQC59", "Overall": "1.0", "Content": "Power cord dead on arrival. It is simply unacceptable that an out of the box computer that costs over a thousand dollars has this kind of flukes. Apple's quality standards are simply down the drain. I guess the poor chinese kid that assembled this POS power charger was hungry that morning, huh?I traveled to Mexico the very next morning I got this computer just to find out I was unable to use it. Thank you, Tim. Keep up the good work.Really pisses me off.", "Date": "September 11, 2012"}, {"Title": "Too bad", "Author": "mono", "ReviewID": "R21XRV7EHC9TJQ", "Overall": "1.0", "Content": "Terribly slow, capricious computer. Shuts itself down whenever it wants to and can't recover the documents afterward. Don't waste your money. Ever.", "Date": "October 11, 2012"}, {"Title": "Sexy laptop with substandard components", "Author": "A.M.", "ReviewID": "R2WQD9S3K3LO10", "Overall": "1.0", "Content": "I admit the air comes in a sexy shape, it is very thin and light but the inside components are substandard in quality. The only moving part (the fan) breaks all the time and it is very noisy.", "Date": "July 18, 2012"}, {"Title": "Bite The Apple Aye?", "Author": "Quad", "ReviewID": "R2KA5MBXOI73UV", "Overall": "1.0", "Content": "I just love how people waste their money on outdated hardware and then try to tell everyone else what a great buy they got.  Apple has never given equal hardware for equal prices. Your paying four or more times the cost of the technology. In this case out-dated hardware. Sure their are thousands of idiot minded diehard Apple Users; you can see them standing in lines; who are most likely also Obama supporters. The game here is to train the technology sheep; and then feed them hardware fodder; and once they get their fill; they will follow wherever you take them. (mostly to their banks to withdraw some more money to hand over)", "Date": "January 28, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B005CWJB5G"}}