{"Reviews": [{"Title": "Super Fast and Portable", "Author": "billgano", "ReviewID": "R2RO9X7OKBQFOC", "Overall": "5.0", "Content": "This new MacBook Air has replaced my two-year-old 13\" MacBook Pro for a couple reasons. First, I wanted a more portable machine so I am not lugging around nearly five pounds of computer and second, this MacBook Air far outpaces the MacBook Pro. Sure, it doesn't have as much storage, but the SD card slot makes that a non-issue since I can use flash memory for those items that do not easily fit on the SSD hard drive (think virtual machines).For reference, look at the specifications for this machine at [...]. This is a build-to-order machine.For anyone looking to use this machine for virtualization, it works great! Running Windows 7 Professional and Windows 8 Developer editions inside Parallels Desktop, this MacBook Air returns a speed rating of 4.9 which is very reasonable for testing and demonstration purposes. That rating was returned while using Safari, Mail, Word, Excel, and Pandora within OS X simultaneously. Not too bad at all!This machine does not come with a OS X Lion recovery DVD. There is now a hidden partition that includes the parts of the OS needed to recover the full operating system via the Internet. I tired this within a Parallels virtual machine and the process works seamlessly, but does take about an hour to complete.I purchased this through Amazon from onSale and they were excellent. I had the brand-new computer in one day at about $50 less than retail.As I put more hours on my MacBook Air I will post updates. Please email me if there are specifics you want feedback on. bill dot gano at yougotbill dot com.", "Date": "November 5, 2011"}], "ProductInfo": {"Price": "Unavailable", "Features": "4GB RAM\n256GB Hard Drive\nMac OS 9.X", "Name": "Apple 13.3\" Macbook Air Dual-core Intel Core I7 1.8ghz, 4gb Ram, 256gb Flash Storage, Intel Hd Graphics 3000, Mac Os X Lion", "ImgURL": "http://ecx.images-amazon.com/images/I/51qCeH796NL._SX300_.jpg", "ProductID": "B005ZUIJ0S"}}