{"Reviews": [{"Title": "It's been such a great little laptop for the price!", "Author": "Danny Rowe \"Danny\"", "ReviewID": "R1QV5PPMASUFOI", "Overall": "4.0", "Content": "I didn't expect this little laptop to run Office 2010 Pro very fast, but it performed very well. I didn't expect to set speed records running ArcGIS (heavy duty mapping program) but have successfully ran my mapping business for two years with few hitches, solely off of this laptop. For the price, this little brown laptop has made me an ASUS customer for the foreseeable future.I DID just buy a new 17.3\" HP Z Book because the GIS software I use has limits on a laptop with such limited hardware resources. ASUS didn't have the sort of machine I needed or I would've gladly given them my business. But you can bet that the ASUS K53U will be riding around in my truck and in my backpack for a long time to come. (I HATE Windows 8 !!!!!!!!!!!!!!!)Perhaps the previous reviewers should look up PCTechBytes and learn to maintain their computers? Just a thought..If you need an affordable laptop, want Windows 7, and can luck across one of these, jump on it! I LOVE the brown color and the textures of the plastic. The keyboard has become my favorite style. I've loved its light weight and portability. Thanks for reading..", "Date": "January 5, 2014"}, {"Title": "I would avoid it", "Author": "Gavin Acevedo", "ReviewID": "RE7A8122SU1R6", "Overall": "2.0", "Content": "I have worked with computers long enough to understand that a 1.6GHz processor is not all that great, but I figured since it was a gift I couldn't complain, though it was awfully slow even when it was simply trying to pull up Google. I hadn't had it for much longer than 5 months before the computer's screen warped and then it shattered. I was completely frustrated with this horrid excuse for technology. I have a Dell b-130 with a Pentium M CPU(1.87GHz) with 2Gb of RAM that ran better and faster without the dual core and the 4gb of RAM that this thing came with. It is really not so much that it is an atrocity as it is just simply a bad computer even for the price that it was purchased at.", "Date": "August 13, 2013"}, {"Title": "It's OK, but You get what you pay for", "Author": "K. Frei \"the_talon007\"", "ReviewID": "R3JX8MUD0ULIY", "Overall": "3.0", "Content": "I bought the K53E at a local retailer two years ago for about $500 and it has been a great laptop until this week.  We don't do much gaming and all of the word processing and the like was done using Google apps.  This was used mostly to access the internet, occasionally stream Netflix and store Photos.  It was a good thing we had the last backed up to a cloud device because after just two years (almost to the day) the hard drive quit.  I expect more from a A computer than just two years of life.  The repair guy said that the Hard rive was stuck in a boot cycle and the it was a total loss.  I am going to try and replace the drive, and will see if that works, If it does then this is a four star computer (last week I probably would have given five) But if not the n maybe I should have left just two stars.  Over all  three and a half.", "Date": "February 14, 2014"}, {"Title": "Lasted Less Than a Year", "Author": "N. Oconnor", "ReviewID": "RW5HR6XV3LX83", "Overall": "2.0", "Content": "I knew that this was not going to be the best or fastest laptop but I did expect it to last more than a year.  It was very slow from the start and progressively got worse.  One day is just stopped working.  Asus was of no help.  I would do more research and invest a little more money for a better laptop that will last longer.", "Date": "June 17, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "AMD dual core e 350 Processor 1.6GHz\n4 GB SO-DIMM\n640 GB 5400 rpm Hard Drive\n15.6-Inch Screen\nWindows 7 Home Premium 64-bit", "Name": "Asus K53U-RBR5 15.6-Inch Laptop (Brown)", "ImgURL": "http://ecx.images-amazon.com/images/I/51Dlz1U%2BceL._SY300_.jpg", "ProductID": "B005QU0S8S"}}