{"Reviews": [{"Title": "Good Looking Computer But Poorly Engineered", "Author": "G. Dill", "ReviewID": "RU3M1DF9759IC", "Overall": "2.0", "Content": "Pros: Cool looking exterior. Top of the line video card.Cons: Overpriced. Easily overheats. Sub par components. Poorly engineered on the inside.I have owned four Alienware computers, including three laptops and one desktop computer. I was severely disappointed with all of them. My first two laptops all died within one year. And, my last two were replacement computers given to me by Alienware and lasted no more than two years. They have a bunch of power under the hood and therefore have a short shelf life. Although Alienware computers look really cool on the outside, it's what's on the inside that is horrendous. With exception to the graphics card, the rest of the components are poor quality. And, the engineers at Alienware did a poor job in constructing the computers. Placing the hard drive next to an overheating video card is not smart engineering. Furthermore, screws were missing on the inside and the casing is typically made out of cheap plastic. I highly recommend to stay away from Alienware and consider other high-end gaming computer brands.", "Date": "December 2, 2011"}, {"Title": "Great speed..with a major flaw!", "Author": "Michael Jude Kelsey \"Denegra\"", "ReviewID": "RO3PRW9NNMCWD", "Overall": "1.0", "Content": "I have owned this laptop for about 8 months at this point.  Let me tell you that is by far the fastest laptop I have ever used.  It handles most games with ease at full graphics.That being said there is a major flaw with this laptop.  Within 2 months of owning the laptop, the keys started popping off.  Dell does have a picture tutorial on how to put this keys back on, but if you follow the tutorial it will often lead to adjacent keys popping off.  And if you push too hard when trying to get the keys to latch, then you are out of luck.  Luckily my first experience with Alienware customer service ended in a keyboard replacement in less than 2 days from calling tech support.  However when it started happening again tech support was not that helpful.  I was told I would need to purchase a replacement keyboard for $110!  The laptop is under warranty for 4 more months.  I was even considering extending the warranty.My suggestion is to use the built in keyboard as little as possible.  I use a logitech keyboard now, my biggest issue is now the laptop does not really travel easily anymore.", "Date": "April 22, 2012"}, {"Title": "Bait and Switch", "Author": "lloyd mizell", "ReviewID": "ROXM2AJCMPODQ", "Overall": "1.0", "Content": "The seller wasn't honest in selling this product. He advertised that the hard drive was 750mb but when it arrived it had a 256 hard drive installed. I reach out to the seller and he stated that the 256 hard drive was a better hard drive for gaming. I pointed out that battery wouldn't take a full charge. “He stated that he charged it and should take a full charge\". I informed Amazon of these issues and they gave me a 150.00 credit toward my next Amazon purchase. I purchased this Alien ware M17X as a gift to a friend and was he disappointed with the computer as was I. I will NEVER EVER EVER purchase a computer or a napkin from this seller and potential buyers please beware of this seller or should I say AKA Mr. Bait and Switch.PS I have a copy of all the emails traffic between Bait and Switch,Amazon and myself..", "Date": "May 24, 2014"}, {"Title": "Great Laptop", "Author": "Zack B.", "ReviewID": "R32O9FL2TXFAWO", "Overall": "5.0", "Content": "I have had mine for about 4 years now, never had any issues with it. (Other than the Pre-loaded Windows Vista - but Alienware sent me a free Win7 Ult upgrade when I purchased the laptop)A lot of people see \"Alienware\" and think they all over heat and that they are all garbage becuase Dell owns the name - If you are going to game, it's going to get warm...I placed mine on a desk when I gamed and never had it overheat. I keep it cleaned out of dust, and don't smoke so that helps a lot.I went through a hard drive, but that is expected so I replaced it with a Solid State Intel drive and it's been running faster than ever with that. (Been in for about 2yrs). If taken care of, this laptop runs perfectly. Neglect with anything that's high performance can cause catastrophic failure.PROS: Speed, Reliability, Look, basically everything!CONS: Doesn't hold valueI'm in the process of selling my M17x R1 to get one of the newer models!", "Date": "January 19, 2014"}, {"Title": "Awesome Computer", "Author": "SW", "ReviewID": "R3FEX7ECUWPBHP", "Overall": "5.0", "Content": "this computer is awesome for all my games. i can even hook up my xbox 360 and ps3 through the hdmi ports. and i can hook up the computer to the tv through the hdmi port.", "Date": "December 11, 2011"}, {"Title": "Piece of Garbage.", "Author": "no", "ReviewID": "R1X3ABNGB5IN6W", "Overall": "1.0", "Content": "How can I start this review off.First of all, it was a great laptop for the 3 months that it worked.It got a Windows error, causing me to reinstall Windows 7.It installed fine and all, until I needed the recovery disk that it never came with.I called Dell asking about sending it to them to get it fixed properly, they told me it would cost about $400-$500 dollars, WITH the warranty still on the stupid laptop.It was a $1500 paperweight, and now it has Ubuntu Linux and can only be used to watch movies and browse the internet.All in all, never purchase an Alienware laptop, or desktop because they will probably have a similar problem knowing that you can also build a desktop cheaper, or get a more powerful laptop from iBUYPOWER for about $300 cheaper.1/10 would never trust Dell again.Thanks for basically stealing my money.", "Date": "September 6, 2013"}, {"Title": "This is a beast", "Author": "Lightningtmass", "ReviewID": "R2NKWT65JV7ZZV", "Overall": "5.0", "Content": "this is awesome. it doesn't lag at all for FPS games including Modern Warfare 3.you can play at high performances and still no lag :OAll I have to say is that this is the best gaming laptop I've ever got, the 3d features are also really nice but most gamesdon't have 3d so i don't recommend 3d. Thanks for reading .MAKE SURE YOU BUY THIS.#", "Date": "December 19, 2011"}, {"Title": "Do not purchase the M17x (or any other alienware pc)", "Author": "Brady R Faist", "ReviewID": "R3FIA71N6KKTOZ", "Overall": "1.0", "Content": "First of all, let me say in plain english, Do Not Buy an M17x or any other Alienware PC.I remember that once upon a time, dell was a great company. They built quality consoles, they had the warranty that set the industry standard, they cared about their customer support. It is clear to me that these things no longer matter to Dell. A big name and customer loyalty brings us back time after time. Over the past decade, I have given them dozens of referrals and direct purchases, but in the year since I purchased my dell M17x 8GB with dual Nvidia 260M graphics in SLI and an Intel i7 processor, I have actively scuttled just as many purchases by telling all about my personal experience.Its unstable. Out of the box, brand spanking new, it barely even qualifies as a paper weight. It took me 3 days, and probably 30 hours to get through simply downloading and installing window's updates, firmware mismatches all kinds of errors and stuff that i'll get into later caused me so many problems that its not even funny. If your top of the line(or at least above average) gaming PC can't even run Mcaffee or your own on-board Aliensense programs, then how the hell are you going to run dragon age, fallout, league of legends, even counterstrike or NES Emus?So, what kinds of problems did I experience? The laptop will power down completely without even attempting to shutdown windows and completely without warning. The screen goes solid white with a streak of random pixels near the bottom. The computer freezes... FREEZES. I haven't seen that since High-school and Pentium 3. and these errors can occur with or without an obnoxiously loud tone blasting me in the face for a minimum of 3 seconds while i try to hard off the PC.The obvious issues. Well, first of all there was an obvious NVIDIA driver conflict with something on-board. since alien-sense is the only non-standard program that comes pre-installed, i choose to blame that, however it doesn't really matter. after trying 5-6 other Nvidia drivers I find one that doesn't crash my computer every 30 mins like clockwork. Issue two. Poor design. The screen is too far back, the external shell gets too hot, too fast thanks to poor internal cooling, mother-board has no internal sensors on-board, inferior components like the SSD that they charged me to install but has a SLOWER read/write speed than my last HDD. Also the \"break me\" button at the top right has no tactile response, no toggle and no \"oh i didn't mean to break my pc, UNDO\" button. see below.Less obvious problems. the \"break me\" button also called \"stealth mode\" instantly insures that you will not have a moment's rest until you figure out what exactly stealth mode is and why you never-ever want to graze that button. Stealth mode is dell's commitment to green in action. when you touch that button, it will instantly shut off all graphics cards except for the one built into the i7(which cant handle much) underclock your CPU, shut down anything that is drawing power from a USB port, kill your wifi, bluetooth, even your keyboard lighting. anything to conserve power, except of course toggle down the brightness on your monitor. you need to use window's settings to do that. and before you ask, no. you can neither disable, nor change the settings of the \"break me\" button, and no. once \"break me\" mode is initiated, you can't turn it off. you must unplug the pc, power down the pc restart the pc, go into the Bios for the PC, mess with the settings re-enabling all the stuff that is disabled(like your USB port and hybrid graphics), plug in your pc and restart it. first of all, the creation of such a button on a GAMING PC is just dumb. next everything it does, you can do through settings or by unplugging your externals, windows calls this \"power management.\" third, there is no way to make this setup stable. i need at least one GPU to run windows for more than 5 minutes without it crashing, period. hence the \"break me\" button.also if the laptop comes unplugged, perhaps you foolishly wanted to present a project or surf the web while watching TV you must restart your computer in order to re-enable hybrid graphics, i guess the battery just can't provide that much power. I do get an NVIDIA GPU though which is handy if i'm not interested in gaming or doing anything processor intensive. it should be noted that i needed an alienware patch before, under some circumstances, the power supply that came with the PC was recognized as \"the proper\" power supply. as if i happened to have a compatible low-watt version hanging out at home and i thought \"gee, all computer parts are interchangeable\" derp.presently, my alienware pc is more or less stable. but, needless to say, i came very very close to sending it back before everything clicked. i say more or less because it can still glitch out when i push it and every once in a while when i don't. so i say it again. Don't buy an Alienware M17x. I hear good things about ASUS, Lenovo, and even HP if you aren't obsessive about high end graphics.", "Date": "November 28, 2011"}, {"Title": "Alienware is JUNK", "Author": "Lance W Turner", "ReviewID": "R2Z464OQ82USAC", "Overall": "1.0", "Content": "I've had the Alienware M17x for almost three years. I'm trying to get a few more months of use out of it before I take a hammer to it and then set it on fire.I'm not very tech savvy and I'm not a gamer but I spend a lot of time online. I wanted the fastest laptop available for that simple task so I ordered the Cadillac version of the M17x which set me back nearly $4,000. For that much money, the thing should perform flawlessly even if you drop it off a cliff.Since I've owned this POS, I've gone through three power cords, spent approximately 30 hours on the phone with Dell \"support\", had three different service visits to replace the motherboard and other components.Despite all that, the M17x overheats causing random shutdowns every hour or two. Two or three times a day the screen will just go blank and I'll have to do a forced shutdown and restart. It's ridiculous.You would be wise to not chalk my experience up to getting a random lemon. Too many others here and elsewhere have had the same or similar experiences.The bottom line is that Dell/Alienware are putting out outrageously overpriced pieces of junk. If you buy one, there is an excellent chance you'll hate yourself for it.My actual rating is negative 5 stars.", "Date": "May 29, 2012"}, {"Title": "Alienware --- Don't buy this product.", "Author": "JD", "ReviewID": "R28F6GP1PLAV3B", "Overall": "1.0", "Content": "I was thinking about buying the Dell Alienware M17X laptop,but I changed my mind when I read all of the complaints about Alienware. Got to the Dell website and type in Alienware Club, and read all of the complaints about Alienware. I had a Dell desktop several years ago and had nothing but trouble with the computer and customer service.Dell hasn't changed. They still sell poorly engineered junk and still have crappy customer service. Dude, I don't want a Dell.", "Date": "May 3, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core i7 2630QM Processor 2GHz\n8GB DDR3 RAM\n750GB Hard Drive\n17.3-Inch Screen, AMD Radeon HD 6870M\nWindows 7 Home Premium (64-bit)", "Name": "Alienware M17X 17.3\" Black Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/41RNWdKiJdL._SY300_.jpg", "ProductID": "B0054Y5X36"}}