{"Reviews": [{"Title": "Excellent Computer for the Price", "Author": "Kaleb", "ReviewID": "R14NVSTCED1L5V", "Overall": "4.0", "Content": "After owning a Samsung Netbook for 3 years, I decided it was time to upgrade to a big-boy computer and bought this Notebook a few months back.  Following are the positives and negatives:POSITIVES:+Awesome processing speed for the price.  I looked at Sony Vaios and other brands with comparable specs, and Samsung was the only one that was even in this ballpark price-wise.  Also, I'm not a huge gamer, but this computer will run Starcraft II with no trouble, and I am constantly streaming movies and ESPN3 seamlessly.+Sleek and well-sized.  This computer looks great and the screen size is just right to give you ample viewing space without feeling clunky.+Good portability.  This computer is light, with a reasonably good battery life.  I believe I read somewhere that this computer gets 7+ hours.  Don't count on it.  With the screen brightness turned all the way down and running only word processor, I think I eeked out 6 hours.  Don't get me wrong, 6 hours of computer life could be all the difference if you're trying to write your thesis paper on a flight from NY to LA, but you're not going to be playing movies with the volume and brightness turned all the way up for 7 hours... more like 2.5 or 3.NEGATIVES:-I know it sounds whiny, but the track pad on this computer is just awful.  \"How bad could it be?\" you ask.  Well... it senses movement, usually.  Though, its sensitivity to certain movements (double finger expansion/contraction, scrolling swipes down the right-hand side, etc.) is not always great---the material the track pad is made of doesn't lend itself to smooth, fluid finger movements. Also, be careful to NEVER touch the track pad while you're typing, lest the cursor inadvertently move to some totally random spot in your paper, causing you to have to delete and find your place again.  Finally, if you are a big time right-click user (as I am), just forget about it.  There is no actual dedicated button for right clicking.  Rather, there is this vague area on top of the track pad that is delineated with lines that in no way represent where the right click button actually is.  I think about 1/16 of the area that is supposed to be the right mouse button on this track pad actually is---if you're really lucky, you might hit it.  I have gotten an external wireless mouse that I take with me everywhere in my computer bag, so I don't ever use the track pad anymore (there is actually a function to disable it, which I use frequently).-The other drawback I see with this computer is all the proprietary Samsung software on board.  Don't get me wrong, I like a lot of it (the display setting tools are great for setting up multiple external monitors easily).  However, the \"quick boot\" feature was a pain, because it disabled the Windows setting that allows your computer to stay running if the lid is closed (if, say, you wanted to attach to an external monitor).  With some fiddling, I realized that this Samsung software was causing my problem, disabled it, and am able to use the full Windows functionality (booting up takes exactly 2 more seconds with quick boot disabled because you have to actually push the button to turn your computer on, big deal).All in all, I give this computer 4 out of 5 stars.  I'd probably give it 4.5 if that were an option, since the negatives aren't really all that bad and I really do like this computer, but the stupid track pad is gonna keep me from rounding up.  If you buy this computer, don't forget the external mouse!", "Date": "December 15, 2011"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0056EY4UM"}}