{"Reviews": [{"Title": "Good inexpensive laptop/notebook computer.", "Author": "Jakpro", "ReviewID": "R11HPWPZDFOY8X", "Overall": "4.0", "Content": "I have been using this computer for about a week. So far, it has worked very well. It is fairly peppy, but not fast. I have had one Blue Screen reboot, but I don't believe that it was the machine's fault. I am pretty sure that it was a 32 bit program that I had loaded that did not want to play nicely with Windows 7.The keyboard is a joy to use. It has no perceptible flex.The case is rigid and feels well-constructed. I do have issue with the cheap optical tray. It is made of thin plastic and feels very cheap. I am uncertain how well this optical tray will last.The LCD is washed out, but is is serviceable in using for most daily tasks. It is bright, but I don't feel comfortable using it for photo editing even after adjusting the colors as well as possible.The sound is weak, at best. I adjusted the software settings and was able to get fairly usable sound out if it.One thing that I am very disappointed in-- NO HDMI output!! Lenovo really dropped the ball here. It would be easy and inexpensive to drop one of the USB ports and include an HDMI port.The loaded software contains very little \"bloatware\". It was easy to set up and everything worked very well.Overall, it is a good basic computer. It is a good value, IMHO, compared to competitor offerings. I researched many machines priced $500-600 and I feel that this is the best value.", "Date": "January 30, 2012"}, {"Title": "Fine laptop, Mac user running Quicken", "Author": "Judy \"Judy Murray Jack\"", "ReviewID": "R2X4OEQSJ3OWIP", "Overall": "5.0", "Content": "I was looking for an inexpensive Windows laptop to run Quicken.  I've benn using iMac for most applications for over 3 years and have just upgraded to Lion.  I did not like iBank or other Mac  financial apps.Office Depot had the Lenovo 570g on sale this week for $399, my price point.  Set up was easy.  I've installed Quicken and downloaded transactions from 5 accounts.  I also installed Turbo Tax and got 2011 out of the way.I've enjoyed the Chrome browser that was bundled.  I was surprised I had to download Adobe Acrobat  Reader, but this was easily done.  I'm looking forward to a walking tour of my apartment when I next Skype with my out of town daughter and grandchildren.I don't see a downside to this pc for the casual user.  I'm a retired IT professional who enjoys easy to use applications.  Windows is easier to use than when I abandoned it 3 years ago.", "Date": "March 5, 2012"}, {"Title": "Needs a Windows disk", "Author": "Derek", "ReviewID": "R3UT38PTPX6L4Y", "Overall": "4.0", "Content": "So far, the computer is exactly as billed.  It seems nice and fast with the Intel i5 chip.  The case looks nice and the display looks good.I have to say that I absolutely hate that they don't include a Windows 7 disk with it.  It uses the Lenovo 1 Key recovery system, so you will need to create your own recovery disks for the inevitable day you need to re-format or replace the hard drive and re-install Windows.  The file is 32GB, so it took 5 DVDs to make the reboot disks.  If you have an option to pay a few bucks extra for the Windows install disk, then do it.", "Date": "April 27, 2012"}, {"Title": "The Best value in laptops. It is awsome", "Author": "Austin Seeley", "ReviewID": "RU6FYR8SJWZKF", "Overall": "5.0", "Content": "I just revived the Lenovo G570 this past Christ mas and I love it. It has all the features and perks that a higher price laptop would have. The built in web can is very cool. and when you start of your laptop you can set it so it will recognize you face so you can make sure no one is hacking into you personal computer.The only complaint that I have is that it is only a four hour battery.  -Austin", "Date": "January 24, 2012"}, {"Title": "Casing is Poor Quality", "Author": "stintage", "ReviewID": "RO1BFZKPK95IN", "Overall": "2.0", "Content": "I bought this laptop around this time last year during a sale.It was amazing at first, since the keyboard was very easy to type on and the casing was a solid matte finish.I used it as my main computer for months since it had nice specs, barely took it out of the house twice.However, around January the side of the casing started to crack off just from regular opening and closing.I could push it back into place and it would hold fine, but it got worse.The entire left side started to crack off, leaving the screen to not stand upright or close correctly.I brought it in and tried to call in but repair was not covered on my warranty nor was it cheap.I've heard of the same problem happening with many people who have the same laptop, if you are looking for a new laptop, stray away from Lenovo's consumer line.", "Date": "November 19, 2012"}, {"Title": "Great laptop!", "Author": "OMGCat!", "ReviewID": "R2VSCZKCXTW3A2", "Overall": "5.0", "Content": "After tons of reviews, reading everything I could find and just plain procrastinating I went ahead and purchased this laptop. I've had it for about three months now and can say that I'm very pleased with my purchase. The screen is nice and clear, the keyboard feels really nice and the performance is really great for an inexpensive piece. I wouldn't hesitate to recommend it to anyone looking to spend about 5 bills on a basic laptop.Only cons so far are:Windows updates. Either it sat for a while before I bought it or Windows 7 just has a butt load of updates but twice it's taken about 20 minutes to install them before it would either start or shut down.I got the BSoD once! I have no idea why as I shut it down normally but on start up, there it was. I restarted it and it's not returned but, yeah, not a nice thing to see.", "Date": "April 9, 2012"}, {"Title": "good laptop", "Author": "Luis Sebastian Pire Boada", "ReviewID": "R3UO44WYDMXA9B", "Overall": "5.0", "Content": "i bought this laptop with no reason on mind, just a laptop to have it in case of travel or while i stay at home but without use the desktop. I choosed the Intel i5-2450 configuration (wich is almost my i5-2310 of my desktop) and i'm surprised, its fast, it's big (not extremely big but big) and also it's very light, i'm totally impressed how light weight this laptop is, and even better it's a very whisper laptop (almost don't make any noise at all)For someone who wants a fast laptop to explore the internet, to watch pictures or videos, movies, play some games and do some office work, this is your deal! It comes with 4gb of ram and 500gb in the HDD.I'm in love of lenovo and specially this product (i own also a G460 14inch laptop) wich also is great one!.", "Date": "March 12, 2012"}, {"Title": "Good basic, budget friendly laptop", "Author": "defcon4", "ReviewID": "R3NS509UWX1RPV", "Overall": "4.0", "Content": "Good, basic laptop for basic web-surfing, email, etc. The keyboard is a bit small and the right shift key is infringed upon by the up arrow key which causes typos occasionally, but that can be easily solved with an external keyboard when at my desk. The keyboard is very sturdy vs. other laptops and doesn't feel \"spongy\" when typing. Also very happy that there was not a ton of bloatware installed by default (I wish pc manufacturers would offer a \"vanilla\" or windows only option). Quiet enough and plenty fast for basic use.", "Date": "May 13, 2012"}, {"Title": "Solid Laptop", "Author": "Kevon Walcott", "ReviewID": "R3CKEM6MLO0QSN", "Overall": "5.0", "Content": "Purchased for my wife and she loves it.Simple mid range laptop that I picked up for $499.Core I5, 4 GB Ram no issues.Happy with my purchase.", "Date": "December 21, 2012"}, {"Title": "GOOD VALUE", "Author": "WMCSPAREN", "ReviewID": "R2OJTHHLGTEHMJ", "Overall": "3.0", "Content": "So far this computer has been a dream.  I really like the locking system and the one-key rescue system.  This is the first time buying a Lenovo and I am quiet happy with it.", "Date": "October 4, 2012"}, {"Title": "Very Nice for the price", "Author": "daBarg", "ReviewID": "R38TLD55B3H1VZ", "Overall": "5.0", "Content": "just needed  laptop for the wife in the kitchen. Staying up to date on e-mails and facebook this Lenovo is right on the mark. The speed for the price ratio is fantastic. The feel of the case seems a little cheap, I'm glad I'm not throwing it in the overhead compartment.", "Date": "May 16, 2012"}, {"Title": "Poor Quality Casing", "Author": "GMRM", "ReviewID": "R1TXTFZWUJ0VC3", "Overall": "3.0", "Content": "God quality laptop features wise except for a very poor quality casing. After about a few months only, the side of the casing will start to crack off just from regular opening and closing. Guaranteed to get worse until the entire left side will start to crack off, leaving the screen to not stand upright or close correctly.", "Date": "March 30, 2014"}, {"Title": "Lenovo G570 43349KU 15.6-Inch Laptop", "Author": "Bob", "ReviewID": "R3A0KD05P9OIHV", "Overall": "4.0", "Content": "Bought it since it was on sale for a good price. A functional laptop. Isn't the fastest on the market obviously, but enough for everyday work.", "Date": "March 4, 2014"}, {"Title": "Nothing buy trouble for 2 years.", "Author": "lg1995", "ReviewID": "R1V13HLZVQM8SW", "Overall": "1.0", "Content": "I purchased this laptop 2 years ago directly from Lenova. They no longer carry it so I can't write a review on their website, but I wanted to make sure someone knew of the issues I've had with this laptop.I've used Lenova laptops at work and have not had any issues with them. That's why I bought a Lenova laptop for my daughter. In two years with this, I've had to send it back to Lenova during the 1-year warranty period for hard drive issues. I've had to take it in to be repaired to an indenpent dealer twice because of slowness and other performance  issues. Currently, the hard drive is not responding and needs to be replaced. Also, there headphone jack is loose and we have to tape the headphone cord into the socket for it to be used. I will not buy a Lenova laptop again. It's been very disappointing.", "Date": "January 7, 2014"}, {"Title": "Bad design", "Author": "Roderick Byles", "ReviewID": "RK0884WMIDEK8", "Overall": "1.0", "Content": "Please do your research before you purchase any Lenovo products, their customer service is not the best, the design of this particular laptop, has an inherent flaw, with the screen hinge.  After 1 year of purchasing this unit the hinge broke out of the case, and you then would have to send the whole unit back to Lenovo, to have it repaired.I have used Dell for year and never had any such problems, so I am selling this units and getting a DELL.", "Date": "September 25, 2013"}, {"Title": "Best computer I have had.", "Author": "Nate", "ReviewID": "R52XHIUMTFZUS", "Overall": "5.0", "Content": "This has been a great computer. I chose this one for price. About $400 with 500 GB of hard drive, DVD burner, and numeric keypad on right of keyboard. Overall I will buy a Lenovo again.", "Date": "May 24, 2013"}, {"Title": "lenovo", "Author": "Jonathan millan", "ReviewID": "R1H76060C2A7LX", "Overall": "4.0", "Content": "it is a good computer does basic functions , i love the key board its really cool . i'm using it as i write this so its pretty  good i;m happy with it", "Date": "March 20, 2013"}, {"Title": "Poor design", "Author": "Alexis", "ReviewID": "R341T9FHEPYRDM", "Overall": "1.0", "Content": "Terrible quality design. I take good care of my things, especially my computers, and after only a few months of use the hinge on the screen broke while opening the laptop. Was impossible to open or close after that, and the whole thing always seemed flimsy and liable to break. Fortunately it was under warranty so I was able to get it fixed, although I had to pay to ship it in, which is absurd. Lenovo's faulty, cheap manufacturing caused the problem and my options are to spend $22 to ship it in or $60 to take it into a shop just to look at. I have sold my used Lenovo to be used as a child's computer, and now have switched to an Asus, a brand I highly recommend to anyone looking for an affordable, well-made laptop.", "Date": "March 9, 2013"}, {"Title": "laptop troubles", "Author": "missacutioneerist", "ReviewID": "R3H7DFKZ5XE6ZK", "Overall": "4.0", "Content": "The laptop is good, but beware of the hinge for the the screen it tends to get loose even if you take good care of it. You will also have to pay to ship it if you need the hinge to get repair.", "Date": "January 16, 2013"}, {"Title": "Lenova - Good Buy!", "Author": "Cecil Stewart", "ReviewID": "RI50GASP1IY1B", "Overall": "4.0", "Content": "I would buy another and recommend it to friends.  It was priced right and had no issues out of the box.", "Date": "January 4, 2013"}, {"Title": "Fantastic Buy", "Author": "TimH", "ReviewID": "R3M0M72T4LW9M1", "Overall": "5.0", "Content": "I bought this laptop for my son about a year ago. This machine is still working great! I have recommended this same laptop to other family members and those that bought  have had no complaints to report.", "Date": "December 20, 2012"}, {"Title": "Good price for the specs, average design, but screws falling off", "Author": "hao", "ReviewID": "R28NDDGTL1IV52", "Overall": "3.0", "Content": "I have owned two G570 laptops. One with i3 CPU, the other one with i5 CPU. In both cases, screws fall off not long after we used them within a month. So I had to re-screw the fallen screw. I believe the problem is that the thread is too shallow. This clearly indicates the design overlook.As for built-in software programs, I didn't find any of the them particularly useful besides Onekey Recovery, which makes factory pre-installation less of a headache.Based on the images I found on the Internet, the easy-to-take-off back panel makes CPU fan cleaning less of a headache, although I haven't had the chance to do that. Not many laptops have this convenient back panel.The keyboard is easy to use and easy to clean. Number pad is a plus.The laptop is very light because the case is made of plastics entirely. This also makes it very fragile. Make sure you need to avoid bumping or any kind of impact or compression.Some areas of the bottom gets hot when you used it for a while. However, the temperature is not high enough for any concern, based on the data gathered from third-party software.Finally, the stability of the laptop seems to be OK, as far as I know.NOTE: the Memory comes with two 2 GB memory modules, and there are only two slots available. Therefore, you will have to take off at least one of them for memory upgrade.Also, there are only three useable 2.0 USB ports, one one the left side is supposed to be a USB port, but I really can't stick any USB flash drive or USB cable into it.The power adapter is small and relatively shorter than ASUS laptops. The proximal end of the laptop adapter has nice right angle protector for easy wrapping.If you haven't noticed, this is an old model: no HDMI port, no 3.0 USB port.In conclusion: it's a cheaply made, good price for the specs laptop by Lenovo (Chinese). And it was made in China, if you want to know.", "Date": "November 7, 2012"}, {"Title": "Very satisified", "Author": "Nickd", "ReviewID": "R2AP74J0JQC7R1", "Overall": "5.0", "Content": "I am very satiisfied with the Lenovo laptop.  It looks brand new and the performance has been flawless thus far.  The item was received quickly and the overall transaction was very smooth.", "Date": "October 7, 2012"}, {"Title": "Its exactly what I want? Nice.", "Author": "Suresh", "ReviewID": "R2TNM7ZK80C1B8", "Overall": "4.0", "Content": "Hi,This product is good. nice look, great battery backup and key board..Value for money. No regrets. Perfect for personal use.", "Date": "July 15, 2012"}, {"Title": "excellent", "Author": "fernando dominguez", "ReviewID": "R7I00SDBOI5WH", "Overall": "4.0", "Content": "proscesando excellent product information quickly and to navigate let alone exceeded my expectations not I would not hesitate in recommending this product, besides having a good price has nothing to envy to any other within the same category are", "Date": "April 21, 2012"}, {"Title": "Great value and performance, but lacks HDMI", "Author": "Neutralist", "ReviewID": "RTTFCGQLDC2Z7", "Overall": "4.0", "Content": "I've been shopping for a new laptop for wife and the Lenovo G570 i5-2450M is the best value currently available.  It looks good, has nice responsive keyboard, and the screen isn't too bad.  However, I ended up buying a Dell Inspiron due to following reasons for the 43349KU model:- No HDMI port- No Gig-E port- No USB 3.0 portIf above are not important to you, then Lenovo will be the best value at about $500 and $550 for the Dell.Strongly recommended if you can live without the above shortcomings, especially HDMI which is why I took one star off for this model #43349KU.---- Update 4/1/2012 ----Now I wish I had bought the Lenovo instead.  The Dell Inspiron should be called the \"Smudge magnet\" since every single fingerprint and palm prints are smudged everywhere you touch to the extend that the laptop looks dirty. I'm not a clean freak, but the plastic material Dell uses needs to be completely revamped for an otherwise a great laptop.Lenovo has it's downfalls, but not this bad.", "Date": "March 4, 2012"}, {"Title": "Poor performer", "Author": "nhcabin", "ReviewID": "R325PYLWA2ON72", "Overall": "1.0", "Content": "Bought this for my husband who refused a Dell due to problems with customer support in the past.  Well, newsflash!  Lenovo is a piece of junk and you can't even reach customer service in their convoluted phone system.  Next time... stick with the Dell. This Lenovo is slooooooow to start and it's diagnostics says it is working in tip top performance.  Really?  I don't think 3 mins start up is tip top!  The mouse sticks constantly.  You have to hit the keyboard with force to move it!  Very very very disappointed in my purchase.", "Date": "July 6, 2012"}, {"Title": "RATHER SLOW", "Author": "Botino Gutierrez Jose Luis \"JB\"", "ReviewID": "R25VV4CJ564ZZH", "Overall": "3.0", "Content": "I HAVE PUT ON ANOTHER 4GB OF RAM MEMORY ON THIS LENOVO, BUT STILL I FELL IT RUNNING PRETTY SLOW. AUTOCAD 2012 RUNS ON THE EDGE, ALMOST AS FAST AS IN MY OLD DELL 6400. I'M A LITTLE BIT DISAPOINTED WITH THIS G570, THEN AGAIN ITS A 500$ LAPTOP", "Date": "April 19, 2012"}, {"Title": "strange system/bios behaviors", "Author": "Jeremy A.", "ReviewID": "R1XNOQ8XT9EKLT", "Overall": "1.0", "Content": "the laptop is inexpensive and has nice features. i know 99.99% of purchasers will be happy with the stock configuration of the unit; however, i'm a computer tinkerer. i seem to constantly upgrade and modify my system to suit my needs. after purchasing this unit, i wanted to upgrade the included mini pci-e wireless card to an intel ultimate-n 6300, to take advantage of the 5ghz network in my home. i discovered the bios has a lockout for hardware changes.  it gets to the bios spash screen and gives  and \"unauthorized wireless card detected\" error message. after researching, it was discovered that the hardware is locked preventing one from changing the wireless card. The only way i've come across to circumvent this restriction are a series of  hacks to the system bios. i can't think of any realistic reason not to allow an owner to upgrade/modify thier own system. i have never come across this before with other manufacturers, and i would not have purchased if i had known beforehand that the system intentionally prevents me from installing certain upgrades.i wouldn't tolerate not being able to configure my desktop pc, i should have the same freedoms on any laptop/notebook i purchase.", "Date": "February 1, 2012"}, {"Title": "Battery status indicator light!", "Author": "Gabriel Mercado \"Gabriel\"", "ReviewID": "R2UGSU3ZO3ZJO2", "Overall": "1.0", "Content": "The battery status indicator light doesn't let you know when a full charge is reached, just a solid light when plugged up!!!!!!", "Date": "August 3, 2012"}, {"Title": "not user freindly", "Author": "Atul", "ReviewID": "R2OOPSBHUUVIA9", "Overall": "1.0", "Content": "this lenovo laptop is not user friendly, numeric key pad is not there on side. keys are not soft, I even didnt liked the performance", "Date": "June 2, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core i5 2450M Processor 2.5GHz (3MB Cache)\n4GB DIMM RAM\n500GB 5400RPM Hard Drive\n15.6-Inch Screen, Integrated Intel HD 3000 Graphics\nWindows 7 Home Premium 64-bit, 4 hours Battery Life", "Name": "Lenovo G570 43349KU 15.6-Inch Laptop (Black Textured)", "ImgURL": "http://ecx.images-amazon.com/images/I/31nlURN%2BUDL._SX300_.jpg", "ProductID": "B006M9ZWNS"}}