{"Reviews": [{"Title": "Solid, but slow", "Author": "Amazon Customer \"deepeepee\"", "ReviewID": "R31JH9GLWZ5816", "Overall": "4.0", "Content": "Picked this up at a local retailer for a mere $233 to replace a P4 desktop running XP in our kitchen.  While I wasn't looking for a notebook, I could not resist the price tag in order to declutter our kitchen counter.  Dual core processor is slower than the P4, according to Windows 7 ratings, but video is far superior, sound is ok, good enough to replace the desktop speakers.  I have always had trouble with XP hybirnation, so using the desktop required a full bootup since I shutdown the desktop when not in use.  Win7 and this notebook are ready in seconds...There are certainly better (faster) notebooks out there for $100 to $150 more, but for the price and its functionality as a web browser, video player and email computer, I couldn't be happier with this notebook...Battery life is supposed to be 5.5hrs, so far that is a disappointing 2 to 2.5 hrs on full brightness...may get better with some cycles, but again, since it will be primaraly be used plugged in, not a huge deal...Bit slow, nice clear 15.6\" screen, 5 lbs weight is good and I was shocked at finding out that a memory upgrade from 2Gb to 6Gb was only $20.  I was going to wait a while on this, since it seems to defeat the $233 price, but I went ahead with this easy upgrade...I also plan on taking advantage of the built in bluetooth with a compatible mouse", "Date": "December 21, 2011"}, {"Title": "My daughter loves this", "Author": "Cynthia T.", "ReviewID": "RRASFKZM4TT6L", "Overall": "5.0", "Content": "I bought this for my daughter's birthday present & she is thrilled!  It was a great little laptop for a good price.  Very pleased.", "Date": "May 31, 2013"}, {"Title": "excelente", "Author": "Yanira Martinez", "ReviewID": "R1LWBBRV7UC6IK", "Overall": "5.0", "Content": "Un producto de alta calidad muy buen desempeño, confiable y estable, excelente calidad y buen precio, se recomienda para trabajos de medio rendimiento.", "Date": "February 25, 2013"}, {"Title": "Your excellent basic laptop", "Author": "Katya", "ReviewID": "R136OAKW6PO22Z", "Overall": "5.0", "Content": "I purchased this for my father who lives in Russia and never really had to deal with any computers at all. So I wasn't looking for anything fancy, just a basic laptop that would work in another country, would get him online and let him watch movies.  For what we needed it for - it was perfect. Still is. My dad has now been using it for about a year and is very happy with it.  It has all the basic laptop features, very user friendly (even for a total beginner!) and really made him very happy. If you just need a bsci laptop for the purposes that I needed it for - this is just great!", "Date": "January 4, 2013"}, {"Title": "Great,Great,Great.", "Author": "Christine", "ReviewID": "RV7TUHWVEVDTA", "Overall": "5.0", "Content": "I have never purchased a laptop from amazon. It was a Christmas present. I was very very pleased and so wasn't the person who received it ! Thx.", "Date": "January 26, 2012"}, {"Title": "A terrific bargain", "Author": "Marilyn Johnson", "ReviewID": "R3MGYNLSB5LENN", "Overall": "4.0", "Content": "I purchased this for $233 and didn't read the instructions.  I tend to rest my hand on the large touch pad and didn't realize that was causing weird behavior such as zooming out so the print was unreadable.  Even worse was accidentally turning off the touch pad.  I thought it was slow and purchased more memory.  Before installing the memory, I removed Norton and replaced with MS Security Essentials.  For now, at least, my computer is no longer sluggish and I know how to use the touch pad.", "Date": "January 16, 2012"}, {"Title": "cut off", "Author": "nathaniel marshall", "ReviewID": "R33UA4861IL8IW", "Overall": "2.0", "Content": "like to say,even  though it been past a years,which I thought laptop,would,click out of,when turn off,its take 20 minute,this is real,have time over 50 times,have had over the year 8 laptop over the years,which I know,very important,how the laptop,cut off,make the laptop,work harder,make long story,short,its take 20 minute ,or more,on a count down,from 1 to 5,its take,over 20 minute for the laptop,to cut off,properly,", "Date": "June 28, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006KRRL2M"}}