{"Reviews": [{"Title": "Inexpensive introduction to Apple", "Author": "Edward J Garrett", "ReviewID": "R2A9EQ23XD1BAD", "Overall": "4.0", "Content": "Though I have owned three Apples in the past, everything has changed.  With my new iPhone 5s I want to change over to Apple in everything.  So, I purchased this used, refurbished Mac from a California company that has been doing Apple refurbish and sale for many years.  Just over $300, this computer is fast and easy to learn to use.  It looks brand new, albeit a little outdated in appearance.  It is a 2009 MacBook.  Within a year I will replace it with the strongest and best Apple computer made.", "Date": "March 16, 2014"}, {"Title": "Happy Grandaughter", "Author": "BigJim", "ReviewID": "R6J0EL5ZJO494", "Overall": "5.0", "Content": "My granddaughter had saved up her pennies to get a new computer, and really wanted an apple macbook pro, but the cost was beyond her reach, so she chose a regular macbook instead and loves it!  Sellers description was spot on condition wise and it seems to work great.  So she has her apple and a few pennies left over and everyones happy.  I have the macbook pro and this one runs almost as fast as mine.  A great ways to get into an apple and not have to break the bank to do it.Big Jim  (aka Pop Pop)", "Date": "March 6, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Apple MacBook Core 2 Duo 2.13 GHz 13.3-inch Notebook General Features: White color\nMac OS X Version 10.5 6-cell Lithium ion Polymer Intel Core 2 Duo P7450 2.13 GHz processor\n3 MB L2 cache, 1066 MHz FSB, Intel 64, Enhanced Intel Speedstep Technology, Execute Disable Bit\n2 GB DDR2 SDRAM 160 GB hard drive Slot-loading DVD RW DL drive No floppy drive\nNvidia GeForce 9400M graphics with 256 MB of DDR2 VRAM shared with main memory", "Name": "Apple MacBook Core 2 Duo P7450 2.13GHz 2GB 160GB DVD±RW DL 13.3\" AirPort OS X w/Webcam, 6-Cell Battery & Bluetooth", "ImgURL": "http://ecx.images-amazon.com/images/I/51BVfXEmRdL._SY300_.jpg", "ProductID": "B006RM6F6I"}}