{"Reviews": [{"Title": "Best Laptop On Market for Price", "Author": "C. J. K.", "ReviewID": "R2TI8GXYZFDAS4", "Overall": "4.0", "Content": "I have had this laptop for a little over a year and at $1200 this PC outperforms my friends $2200 macbook pro in every aspect except the trackpad. The trackpad is very good, but still isn't what the Macbook's is. Also, speakers are very good for a laptop. Lastly, I do not see a huge problem with reds and blues. If I hadn't read negative reviews about it I wouldn't have even noticed. I would say the battery life is around 3 hours on average.Negative things would include: 1) Volume knob worked fine for a couple of months but now is very finicky and doesn't always work. 2) I noticed that the keyboard would miss keystrokes, but that issue has since gone away and I have not had a problem for about 9 months. 3) Fan runs a lot.One of the best laptops on the market, highly recommend it.", "Date": "May 14, 2012"}, {"Title": "Sturdy, powerful and sleek", "Author": "Praveen Kumar \"\"Expert\"\"", "ReviewID": "RGUV90I6O0S7H", "Overall": "5.0", "Content": "I bought this laptop from Costco so Amazon won't be able to verify my purchase. I went through various reviews of this laptop on amazon and other sites. I was very skeptical initially as I saw many negative reviews (hence reason to buy it from Costco that comes with 90 days return policy). I will advise all prospective buyers to ignore the negative reviews. As in many other reviews, comparison has been made with Macbook Pro, that is only fair. You get same power at lower price.Pros* i7 cpu is amazingly fast. After working on this laptop, all other PCs (including desktop at workplace) seems to be century old. I have installed bunch of heavy usage software development environment, MySQL database etc - all working smoothly.* 1920x1080 display is just amazing - one of the reason to spend few extra $.* very nice keyboard - though I use logitech wireless keyboard and mouse with it - I never have to use touchpad.* no crapware installed. HP made wise decision not to include crapware. Usually I have to spend few hours to uninstall all crapwares from a new PC or laptop.* Aluminium body gives a sturdy and sleek look.", "Date": "March 31, 2012"}, {"Title": "Poor man's Macbook", "Author": "Savraj Deep", "ReviewID": "R15DX5TDX22Z5K", "Overall": "5.0", "Content": "The HP Envy 15 replaces my 4+ year old Dell which was a great machine but was starting too get too slow for comfort. Being a software engineer by profession, I'm very picky when I buy new technology and this is even more true while purchasing a laptop that (hopefully) I will use for many years to come. Living in New York City, I made sure I got a feel of all the laptops I was considering at brick and mortar stores before pulling the trigger on my purchase at Amazon, as I do not need to pay tax for purchases and the prices are almost always cheaper.The design of the Envy 15 is par excellence both in terms of robustness and aesthetics. I was seriously considering the Samsung Series 7 which has similar specs as the Envy at a somewhat cheaper price but after looking at both of them in person, the Samsung lacked the certain \"je ne sais quoi\" I was looking for. The design, I felt, was inferior and the screen in particular was severely lacking in quality as compared to the Envy. I also looked at the HP dv6t quad edition which was significantly cheaper with similar specs and I would have gone with it but the build quality of the Envy won me over. I had decided not the go with the dell 15z to begin with as I found the design, especially the speaker mesh, quite off putting.I was well aware of the orange-red issue on the Envy and had made my peace with it even before the laptop arrived. I figured the 1080p resolution and the otherwise excellent quality of the display would offset this shortcoming and I am glad I was proven right. The issue is noticeable, especially when you know it exists and are actively looking for it, but it wasn't nearly as bad as I thought it would be. If one is looking for extremely accurate color reproduction then the display would disappoint but for general productivity work, entertainment and light gaming the issue is largely unnoticeable. I have received many compliments about how amazing the display is and as time passes, so do my concerns about the red issue. Pure reds do look reddish and if one does not have a accurate display close by to compare with, the brain (at least mine!) perceives it as red and that's good enough for me. There are talks of HP offering a calibration tool to fix the issue but from what I read in the forums, the color gamut of the Envy is limited and I'm not counting on the tool to do anything useful (though I really hope I'm wrong here).The keyboard is excellent though there is some flex on the left side. Again, not noticeable if you're not actively looking for it. The stock touchpad drivers are horrible. Fortunately I was aware of this an quickly upgraded the drivers to the ones in the notebook review forum and all was good. Multitouch gestures are excellent though not quite up to par with the Macbook Pro's. My only complaint is with clicking on the touchpad. The entire touchpad is clickable but it takes a significant amount to force to do so. I am used to tapping to click so its not a deal breaker for me though this was quite disappointing.I have done some light gaming on it and older titles work very well. I don't suppose newer games would do as well, but with the Radeon 7690m they should certainly be playable. Beats audio is not just a gimmick but I've never been a big fan of audio on laptops, though the quality of speakers is well appreciated.In conclusion, I would highly recommend the HP Envy 15. The notebook looks like it is build to impress and last. It has enough horsepower to make it future proof for some time to come. You can certainly find cheaper machines with similar specs and in this regard I would say that the HP Envy is the poor man's Macbook. The quality is comparable to the Macbook and you do pay a premium for the build quality but at $1150, its a worthwhile investment.", "Date": "March 31, 2012"}, {"Title": "September 2012 Delivery, No issues, perfect build, Thanks Amazon!", "Author": "jjohnohara", "ReviewID": "RR22JQO17OMUL", "Overall": "5.0", "Content": "I pulled the trigger on the Envy 15 after reading every review here, as well as elsewhere online. I received the unit in perfect condition, no flaws except the screen cover was loose on one side, but it popped back in, took under 10 seconds. Initially, there were problems streaming video, but since downloading the latest bio for the envy 15 I've had no issues streaming movies. No keyboard issues (love the backlighting!), and no issues with volume fluttering, as apparently the first rollout had.My pre-purchase concerns were: should I get the 1080p,,,especially since the type would then be too small to read, and that movie streams are 720p, not 1080p (and if they are 1080p, there would likely be dropouts, as there are sometimes with 720p), and, secondly, how good is the Beats audio?Get the 1080p. Yes the type is smaller, but you can change the DPI in windows, or, Google Chrome allows you to change font size of each page, OR, you can press ctrl and use the mouse wheel to enlarge any page you are reading. Unfortunately, this magnification won't apply to applications. I use Spotify and some other audio recording applications that are now a little harder to \"read\", but the upside is absolutely stellar graphic displays of images and video, with seemingly perfect reds. As we know, most applications aren't designed to be \"read\" as much as navigated, etc. Most importantly, with 1080p, the viewing angles are nearly perfect, with no loss of image clarity even when viewed off-angle (even watching 480p or 720p). Unless you won't be watching video, the 1080p is the way to go.The Beats audio is the best internal-speaker audio I've heard in a laptop. My hobby is streaming music on MOG and Spotify, and playing/recording Audials Radiotracker. Each of these programs work just fine with Beats. The speakers are loud and very high-quality, and the Beats enhancement can be turned off (recommended if you are recording streaming music or video). Naturally, good earbuds should be used for the best audio, but there are times that's not practical, and the internal speakers are sufficient. For watching movies, the internal speakers are very good, for listening to Spotify music, the speakers are good. There is more bass on the 15 than any other laptop on the market that I am aware of, just don't expect a thumping bass from such small subs.My previous laptop was the HP dm4, with a 14\" screen. The Envy is a much larger laptop, and heavier, but I wanted something larger for more realistic video streaming, and the better audio that comes with a heavier unit. The ultra-thin laptops come with fewer, smaller speakers. The only downside with the 15 is its battery and power brick. The power brick is HUGE, and the battery can't be removed. Normally with laptops I use ac power, so I take the battery out to preserve it, and to reduce the weight of the laptop on my lap. Now I've got a larger, heavier laptop, with a battery that won't come out, yikes! I'll research how to remove the battery, I'm sure it can be done.I opted for the 30-day Amazon Prime trial, and received free 2-day shipping, and free TV and movie streaming via their Instant Video service which is very nice. Dowton Abbey looks incredible in 720p. I am happy with Amazon service and selection, would buy this again. I visited my local Staples and Best Buy, before this purchase, only to find really poor selection, units with the older Intel i3 or i5, and with lousy configurations. The Amazon buyers know what they're doing.", "Date": "September 26, 2012"}, {"Title": "BEST PC I EVER OWNED!!!", "Author": "C. Peterson", "ReviewID": "R26OJ8U88P5JJI", "Overall": "5.0", "Content": "Let me start of by saying that I am a PC GURU, working in many technical departments, IT departments, and if there is one thing I know, it's computers!!I originally purchased a Hp DV6 2011 model with AMD A8 processor, and that thing is fast, powerful, lots of ram \"8GB\" in total. However I only use that one for my joband I wanted something for more personal use.This is where the HP Envy came into place, it's sleep, sexy, and powerful, what more could you ask for??Pros1. Great Display, the 1080p HD display has awesome colors, and makes my Desktop Monitor and DV6 monitor look washed out.2. I7 QUAD CORE processor is indeed very powerful, and I have used alot of processors, all the way fromIntel Celeron to AMD Sempron, to AMD Dual Core and to Intel Duo Core, AMD X2 Dual Core, and then finally AMD A8, and the I7 is the best performance I have ever seen.3. WIFI, this laptop has the 5GHZ WIFI radio built into it, most of the pc's you have to manually add it.4. Back-lit keyboard, now this is not a big plus for me, but it does come in handy in dark rooms.5. Analog volume control, who knew it would be awesome to still have actual volume dials?? Well it is!!6. Speakers, awesome sounding, loud, clear, no issues, not like the average laptop pc speakers, for that fact they sound better than the cheap average desktop speakers.7. Design, you want something that looks sexy like a Macbook pro, but without the retarded Apple OS, I have no issues admitting to be pro Windows, Istarted my computer experience with Windows and I will end with a windows experience.8. Two USB 3.0 jacks, again not a big plus for me, but more bang for the buck.9. AMD RADEON GRAPHIC CARD! Now I'm not a huge game player, but I do use Dolphin Emulator for playing someWii Games and Gamecube titles, and this thing cane max Dolphin out, high settings with not using any frame rates,normally 60FPS.CONS1. Ok mouse pad, the entire mouse pad is a right click button, way to sensitive for my taste, andI would rather it just have a normal left and right click button.2. Battery is not what is promised, I normally get around 3-5 hours on low performance settings.Do I recommend it?? Yes. Is It worth the price? Yes. Is it better than a Macbook? Hell Yes! lol", "Date": "May 19, 2012"}, {"Title": "Amazing laptop for the price.", "Author": "rajtoor", "ReviewID": "R16YH4HGYV7P15", "Overall": "4.0", "Content": "After much research, I was tempted to buy the HP Envy 15. To be honest, I was very nervous because like many, I had read about the touchpad and screen issues. However, I have to say that I absolutely love everything about this computer!! For the money that you invest, you will not find a better machine.  I bought mine from Costco because it comes with a 2-year warranty, only difference is that the Amazon one comes with a faster ram speed. Grrrr. Other than that they are the same exact machine.Pros:  - Super quick computer. The second-generation 2670 quad core 2.2 ghz processor is lightening quick. Add to that 8 gbs of solid ram and you got a machine that will handle anything thrown at it.  - The battery life on this machine is superb. On a full charge, it will give you a solid 4-5 hours of non stop use surfing the web and normal use. I have not tested it with movies or games yet but I generally plug the laptop in when i play games.  - The audio on this machine is amazing. The six speakers sound really nice. This is as loud as you can get for laptops and the listening experience increases dramatically when you plug in the  headphones. I don't do any work with music so I'm not an expert on that topic. However I am a college student and I generally have the headphones plugged in and the music from this machine sounds amazing.  - The display is really nice. The HP Envy is among the very few laptops with the best screens available. The screen has high clarity, reading on this machine is a pleasure. Movies look really nice. The red looks orange issue is present. IMHO it really is not a distraction if you are a regular user and do not do any graphic work. To the normal eye, it is barely noticeable.  - The back-light keyboard is nice touch. It doesn't bleed out like the Dell XPS 15z.  - The fans are really quiet and i mean really quiet!! HP got this right. I can place this machine on my lap for hours and it does not heat up one bit. Again when I play games, I use a cooler because computers generally run hotter when the graphics card is under strain.  - Extremely light. This is a joy because I can carry this laptop around campus without too much of a burden. I'm replacing the Envy with my old 17\" Gateway FX which was a beast in its own right. However that laptop weighed over 10 pounds so this is definitely an upgrade weight wise. The power cable brick is pretty slim so it is not that heavy.Cons:  - The track pad has some issues with it. Two-Finger scrolling works but it is kind of laggy. Maybe it is my fingers but sometimes it doesn't scroll properly. For this there are a couple of fixes. One, you can download this program called TwoFingerScroll from google. This is a real nice program that also allows you to right click by tapping with two fingers. Another thing you can do is turn off two-finger scrolling and turn on normal scrolling. I actually like using this much better because I'm used to it.  - The keyboard on the wsad side has flex in it. To be honest, i would not have noticed this if i had not read about it in reviews.  However once you know about it, you can tell that it is there. However it is not bothersome when typing and the keyboard is relatively quiet. I did however read that the flex fixes it self out over use however I cannot say it is so since I've only had this laptop for a week.Overall, I'm really pleased with my purchase. It also comes with a niffty little feature, there are two red lights that will light up when you are in front of the computer and when you walk away, it will turn off the screen after some time to conserve battery. The computer is really snappy and is very speedy. Surfing the web, watching movies and playing games is a pleasure on this laptop because of the Radiance screen. I just wish HP had fixed the Red/Orange issue on this laptop because for this amazing screen, that is the only downside. That may be a deal breaker for people who are invloved with graphic design and such but for normal users, it is really not that big of an issue. To be fair, I will take off one star for that issue because it has been present for sometime and HP has done nothing to address the issue. However for the money you are spending, this computer can get everything done for you.", "Date": "March 5, 2012"}, {"Title": "Like it", "Author": "4Dzone \"4Dzone\"", "ReviewID": "R3799GBBN3T9BW", "Overall": "4.0", "Content": "The HP Envy 15-3040NR is a very good middle size laptop. The screen quality is top notch with good viewing angles and the only downside is using it in a sun lit environment you will see a reflective glare. But, let's face it, what top quality screen won't do that! The speed is more than good. The boot up is good. Internet and wifi is good. There's only three personal dislikes and I'll tell you what I've found the in 4 months that I've had this laptop. 1-the touchpad is mediocre. 2-fan is somewhat louder than I'd like. 3-I dislike the Monitor connections on the right side of laptop. I think they should have put it in the backside. Everything else in this price about $950-$1100 is a tough beat.", "Date": "May 10, 2013"}, {"Title": "This older model beats today's new laptops and then some!!", "Author": "C. Schuster \"Love Latest Electronics (LLE)\"", "ReviewID": "R2NGG7HI1V1FVG", "Overall": "5.0", "Content": "Wow...I took a chance at ordering an older model (no longer being produced) and I'm glad I did and I'm glad I found one still for sale!!  I had a strict criteria while I hunted for a laptop:  Must have - IPS display with full HD (1920 x 1080), an Intel i7 CPU, bluetooth, USB 3.0 ports, USB ports on BOTH sides of the laptop, a good sound system, centered keyboard (touch pad in center), SD card slot, back-lit keyboard, slot (not tray) loading DVD drive, Windows 7 (not 8), a 7500 rpm hard drive, at least 8GB of RAM, at least 750GB or larger hard drive, and be a 15\" size screen.  Through my search, there wasn't very many laptops (with a decent price too) out there that met my criteria except this one!I must say, so far, no regrets as it is even better than I expected especially the crazy good sound system!!  Are you kidding me, 6 speakers and a sub woofer in a laptop!!  Killer!!  It is my portable stereo and portable TV as it does great at both music, and movies as well as all my computing needs to boot!  My only negatives...is that the AC adapter is a bit larger than I think it needs to be and I wish it came with a Blu-Ray drive but that is it!  Awesome laptop and I see the few new ones left out there have went up in price instead of down which goes against the norm as usually the older the system the lower the price keeps going but I know why  this is going up as it is is definitely better than any of the other new laptops that are in this price range for sure!!  If you want a portable boom box, DVD player, TV, and power to do all your computing tasks...better get this one before they are all gone!!  I even like the software that came with it...not often that happens!!  I give this 5 stars as to me...it was my best computer purchase...EVER!!", "Date": "May 3, 2013"}, {"Title": "DONT PAY ATTENTION TO THE BAD REVIEWS ABOUT HTHIS COMPUTER!!!!!!!!!!!!!", "Author": "D", "ReviewID": "RU3517EBN5ZMB", "Overall": "5.0", "Content": "Becuase of them I almost didnt buy this computer...  I am not sure what happened to the others that bought it, maybe they ALL bought it as a refurbished or USED laptop, but let me tell you,,My track pad is GREATMY SPEED IS GREATTHERE IS NOTHING BAD ABOUT THIS COMPUTER....LOVE IT", "Date": "April 5, 2013"}, {"Title": "Really great laptop!  I'm happy!", "Author": "Phire404", "ReviewID": "RZJ93BXGYP2E1", "Overall": "4.0", "Content": "I bought this laptop and I was worried because of the reviews.  But I bought it anyway because it had a 30 day money back guarantee and 1 year warranty.  The specs were so good on it and the look and feel of the laptop is exactly what I wanted compared to any other laptop on the market right now.I work as a graphic designer and website developer so I need a powerful computer that is comfortable to use.  And I'm not willing to buy a MacBook Pro.  This computer is very powerful, fast, and runs smoothly.  I have inserted DVDs in the CD drive without any issues (I read reviews saying theirs didn't work).  I love that's it doesn't pop out and you just insert the CD/DVD in.  The backlit keyboard is gorgeous.  Some reviews complain it doesn't light up all the keys (back keys like f1, f2, etc) but I still see them perfectly fine so I don' care.  And there is a cool button where you can turn the backlit keyboard on and off (f5).  I love the little turntable volume control on the right.  You can push it down to change the settings.  The mute button is right there too.  It's a really convenient and clever design.  The beats audio sound is excellent.  Best sound I've ever heard on a laptop.  The resolution on the screen is really good.  I love that there are three USB ports two being SS USB (faster than normal USB).  There are two ports for headphones so if you and a friend want to listen to something at the same time you can.  The design is so sleek and the keyboard is super easy to type on.  I love the aluminum body.  Some people complain about the finger prints but I really don't mind.  If anything it can be a reminder to keep your laptop clean.There are only a few cons I have been able to easily overlook.  The mousepad is a bit hard after use overtime.  But I usually use a wireless mouse anyways.  Wireless mouse is so affordable and so much easier to use I don't know why everyone doesn't use one.  A mousepad is only for minor use anyways.  At first when you use the computer the mousepad is sensitive but the settings can be easily changed in the control panel.  Just change the double click from slow to fast.  And like many other laptops, if you shut down this laptop with accessories attached in any of the USB ports, like a smart phone, MP3 Player, or wireless mouse USB connector, and start the computer back up it won't start up properly and it will think something is wrong.  Just detach all accessories, restart, and it should be good to go again.  Other laptops don't do this and I don't know why HP doesn't fix this issue.  The battery really only lasts 3-4 hours not 8, and that's with regular use like surfing the net.When you're at home I recommend using a logitech laptop cooler <--- google search.  They're like $25 and will make your investment last longer.I'm also looking forward in 1-2 years to buying 16 gb of memory once its cheaper on the market.  This computer already runs fast with 8gb and the i7 processor, but why not upgrade when its more affordable and your output of work will be done faster?***Update*** After owning this laptop for over a year now it still works great but there are a few flaws.  The drivers for external accessories like a monitor, mouse, or keyboard sometimes stops working.  Also the driver for the built in Beats Audio Volume Control (turntable button) also from time to time does not work.  So there is a driver issue, thinking I will go on the hp forums to try to find a solution to this issue.", "Date": "September 8, 2012"}, {"Title": "Just disappointed.", "Author": "Jason Smith", "ReviewID": "R2WYII4AAZHV3M", "Overall": "2.0", "Content": "I tried my best to love this laptop the best way I can but it just keeps giving me problems left and right. Ordered a replacement from amazon to correct the problems I had before with my first unit but that didn't solve a thing. The laptop makes an awful beeping sound booting it up and it keeps on beeping until I shut it off. It freezes causing me to reboot constantly, mouse jumps everywhere, shuts down unexpectedly, and leaving me confused why I payed over $1200 dollars for this laptop to work half way. What was HP thinking releasing a bad batch of these things and causing so many people problems in the process. Coming from someone who has bought HP products for years, I'm just shocked that things like these happens on top quality laptops from HP. I am not sure I will be buying another one of these in the near future. I give HP props for the nice sleek design and sound but other than that, i'm quite disappointed and will be getting a refund as soon as possible.", "Date": "June 27, 2012"}, {"Title": "Worst Mouse and Key pads ever!", "Author": "adam", "ReviewID": "R22YIN5IAI5V7Y", "Overall": "2.0", "Content": "I switch to HP in the hope that they had finally become competitive with Apply products and this computer has left me nothing but disappointed since I ordered it. First off, in order for the keypad to work correctly you have to continuously use the computed. If left unused for a day or so the left side of the keyboard does not respond to keystrokes and some times you have to restart the computed multiple times. I had hoped that this was a minor software issue but they problem has continued for over 6 months. The beats audio system is a plus when it is working properly. On some days when I open the computed the system is locked in mute and the computer needs to be restarted in the hope of getting the audio function back. The body of the computer it self is also an issue. It seems like the parts do not fit together correctly and are constantly creaking and clicking when the computer is opened. I am waiting for pieces to start falling off. The computer connections are also extremely lacking. The computer has 3 USB ports but only 1 or 2 of them function correctly on any given day and are constantly not registering on the computer.The biggest complaint I have about the computer is its mouse pad. It is by far the worst pad I have ever used. It is poor to respond, it gets locked in secondary functions, and occasionally doesn't work at all. Furthermore, when you are typing on the computer your had has a tendency to slide across the pad and causes the mouse to select and in many cases delete your work. I have lost several documents on Microsoft word to this shotty mouse. There is a function to turn off the mouse pad when you are typing, but if you want to use your mouse at all in between typing spurts you have to constantly turn it on and off which is extremely annoying. There is a special place in hell for the person who designed this mouse pad.In short this computer is almost enough to drive me away from PC all together and move back to Apple. For now I know I will not be purchasing another HP product for some time. This computer is very unpolished and seems as though they rushed it into production before it was properly tested. If the rest of the Envy series is anything like this computer I would fully discourage any potential buyer from getting this computer.", "Date": "February 1, 2014"}, {"Title": "Major overheating problems and screen color issues", "Author": "Tanner Mermis", "ReviewID": "R3339Z3O1SLM1L", "Overall": "3.0", "Content": "Every time I try to run a server or play a graphics intensive game, this laptop gets hot enough to burn skin. Then after it gets really hot (usually about 30 min) the game crashes. I cleaned out the air vents and bought a cooling pad but nothing seems to work. Really disapointed.", "Date": "December 28, 2013"}, {"Title": "Good product. Worth every penny.", "Author": "Stefan Petrov", "ReviewID": "R2RZ5A7BA190FD", "Overall": "4.0", "Content": "A very good machine. There are a few thing that can be done better but a whole it is very good purchase. The only that this lacks a bit is Driver support from HP but the community is great and you can find a lot of new drivers from the HP user community.", "Date": "December 6, 2013"}, {"Title": "High Quality Laptop", "Author": "Phil Skogmo", "ReviewID": "R2NLBLC36EOEHG", "Overall": "5.0", "Content": "Very high quality laptop.  Have not had any problems running very big programs or games.  I am a student in college this computer has been very helpful especially for engineering running programs like solidworks and Matlab.  Battery life is good lasts for hours.  The audio is incredible with Beats. the processor and the 8 GB of ram make this one of the fastest computers out there.", "Date": "November 16, 2013"}, {"Title": "I'm Lovin' it!", "Author": "Derek W", "ReviewID": "RFOXEQC8SJCX", "Overall": "5.0", "Content": "Wow! This is possibly the sexiest PC every made. Pictures do not do this computer justice. It's pretty much a Macbook Pro with better styling! I've replaced the HDD with an SSD and this computer is BLAZING now. Boot-up with Windows 7 in less than 20 seconds.What's to love?*Screen is gorgeous!*Beats system is loud and clear! Best system on a laptop period.*i7 CPU is future proof*Keyboard is very comfortable (as a student I type 5-10pg papers regularly)*Build quality is top notch. ( I came from a DV9. it was so horrid I had to question this computer, but when I saw it in person I fell in love at first sight)What could be imporoved?*Battery is just average (about 3-5hrs real world use)*Fingerprint magnetIf you can pick one up for a good price I highly recommend it! I only paid about $400 and added a $100 SSD. This thing stomps on competitors costing twice as much.", "Date": "November 14, 2013"}, {"Title": "Quiet good", "Author": "Agustin", "ReviewID": "R3BOZLK8RMQD8B", "Overall": "3.0", "Content": "It was not what i expected, is fast and the screen is graet but the hard drive stop running into the first month", "Date": "November 5, 2013"}, {"Title": "amazing laptop, got it for an amazing price", "Author": "Bryan", "ReviewID": "R25GYSU9V65FO5", "Overall": "5.0", "Content": "This laptop is everything that you could hope for in a single package, quad core, good GPU, 1080p screen, 8gb of ram, backlit keyboard, and decent battery life. My only issue with it is that it gets a little hot when running games or videos, but that's to be expected with what this thing is packing. It might be a last gen computer, but I recommend it especially now that it can be gotten so cheap.", "Date": "October 2, 2013"}, {"Title": "Best computer", "Author": "Bryce Crabtree", "ReviewID": "R2IJB977YDMVX9", "Overall": "5.0", "Content": "so much yes, this is computer is a tank, with style and whith optimal performace got this as a gift im more of a gamer not graphic or music but D*mn this is nice", "Date": "July 18, 2013"}, {"Title": "HP Envy 15 Laptop", "Author": "Phil, LA", "ReviewID": "R2V5VY48ZZOBY1", "Overall": "5.0", "Content": "This laptop was originally purchased with Windows 7, but I upgraded to Windows 8 Pro, without much issue.  The multi-touch pad works perfectly with the Windows 8 functions, this laptop continues to give great service.", "Date": "July 9, 2013"}, {"Title": "excellent", "Author": "Nelson Soler", "ReviewID": "R32C5PFUPLQXDL", "Overall": "4.0", "Content": "This machine is excellent, speed, weight and presentation are excellent, the only thing that is missing in this machine is a solid state drive.", "Date": "July 2, 2013"}, {"Title": "Great specs for the price! Can't go wrong with this one.", "Author": "S. Krishna \"Sam\"", "ReviewID": "RZSUHPYK1OZ1Y", "Overall": "4.0", "Content": "I've had this laptop for the past month or so.  I LOVE IT!  It looks like a macbook Pro and acts like one too. :)I don't get the negative reviews.  The only drawback I've seen so far is the lousy battery life (just like a macbook Pro's) and heats up enough to make an omlet...again just like a macbook pro.  BTW, the macbooks I'm talking about are 3 yr old ones...just to get that thing straight.PRO's- Love the IPS display- Love the speed!  Right now, I have a movie playing on TV using the HDMI-out on the laptop and I can work seamlessly on laptop editing my pictures, movies, etc.  There is no lagging of my apps.  This laptop is a champ!  No more endless rainbow ball spinning like on the macbook.- Love the fact that I don't need to hold the 'fn' key and only then be able to access brightness and other features.- In a macbook, the backlit keys is a cool feature.  Its available in this laptop as well.  but there is only one setting.  On or off.  But the cool thing is that the key which turns on/off the backlight is always on.  So, in dark, you don't need to press a bunch of keys to figure out which one turns on the backlight.- The trackpad is fine.  There are no number keys like on other 15 inch laptops.  The keys are spaced exactly like on a macbook pro and so if you're used to using one, then you can hit the keys right everytime.  My other laptop is a 14\" dell and so I have a bit of difficulty when I switch between the dell and this one.CON's- Gets pretty hot! I am thinking about purchasing a laptop cooler infact.- The beats audio turnwheel is too loose.  Any accidental touch and the volume is affected.- I loaded Win 7 professional immediately after getting the laptop.- Heavy!- reflective screen!- horrible battery life! but mine was a year old used laptop in MINT condition which I got for HALF the price of a new one!", "Date": "June 28, 2013"}, {"Title": "5 Star laptop", "Author": "Roman", "ReviewID": "R38V3LC47FC056", "Overall": "5.0", "Content": "So far ive had the laptop for about 2 months.  I am fairly tech savvy.  This computer is good stuff!  Awesome speakers, gorgeous design, brilliant 1080p screen, video card is noticeably better then the integrated 4000 card, the absolute only negative I can think of is the glossy screen.  No matter where I am, if its not dark in the room, the reflection of the screen is almost like a mirror.  I see myself in the screen and It can be distracting.  Otherwise, this is a very strong computer and is very capable of bring a desktop replacement, though I move from school to work and back home daily with this computer in my book bag.  Dont forget the charger though as at full brightness and usage, battery lasts me no more then 2 hours.  Still, I wouldnt trade this computer for any ultrabook known to man.  I'd say $800 or below for a used device like this is a steal in my book.", "Date": "June 24, 2013"}, {"Title": "AWESOME MACHINE", "Author": "jstjean73", "ReviewID": "R34ACY49J4UZM", "Overall": "5.0", "Content": "The machine is super fast and responsive. It takes no time at all to load windows during start up and the graphics processor runs great on heavy FLASH web sites. Couldn't be happier!!!!", "Date": "June 14, 2013"}, {"Title": "Never had any issues and lots of linux users", "Author": "mwc", "ReviewID": "R1D77LDQ1FYZCB", "Overall": "5.0", "Content": "Basically a mac book pro that is very easy to run linux (well Ubuntu) on.Strongly recommend getting a 3rd party solid state hdd with the purchase.", "Date": "June 6, 2013"}, {"Title": "Nice laptop but a pain in the butt", "Author": "W. Jittjumnongk", "ReviewID": "R2D4UUGDIKCDDT", "Overall": "2.0", "Content": "This laptop is pretty good and has everything you need for gaming and other things. But since having this laptop I had so many problems in 1 year. The first problem I had was games freezing up on me. I had that issue taken care of threw HP. Then I started having blue screen popping up on my laptop. This ended up being a USB drive issue which I had to send back to HP to fix. But since I still had another year on my warranty It wasn't a problem. One thing I like you guys to know is I had the care package warranty which is pretty much a premium warranty in case of accidents. The difference between the 2 is with the care package you get your laptop sent back to you faster. If you don't have it then you will be waiting for a month. It cost me like another 200 dollars. Another issue I had was the beats audio wheel on the right side. Sometimes it doesn't work properly. I did find a way to get around it. And the CD drive cover was causing issues for me. I didn't want to deal with having to send it back so I ripped out the CD drive cover just to be able to use it. Just recently I had a wifi driver go out and I had to call HP again to fix the problem. I got the issue taking care of but it was just another headache for me to deal with. HP customer service is pretty good I have to admit but one thing I do notice they will try to resolve your issue as much as possible instead of having you send it back. I am to the point where if I have a issue where I have to reformat again I will just have HP make me a new laptop since I ordered threw them. Don't get me wrong I love this laptop but I would recommend you guys try looking at some other high end laptops before getting this one.", "Date": "April 13, 2013"}, {"Title": "HP Envy 15 laptop purchase", "Author": "clramoy", "ReviewID": "RZ23KD2NTBPSL", "Overall": "4.0", "Content": "My son loves the HP Envy 15 laptop we bought for his graduation gift! The laptop was delivered and recieved ON TIME and in very good condition, no aesthetic and hardware damages seen. However, we did encounter the same issues on the color \"RED\" being displayed as \"ORANGE\" basedd from the other reviews of HP Envy 15 owner and users :(Hope to get color issue fixed at once by HP.", "Date": "April 2, 2012"}, {"Title": "Disappointment is an understatement", "Author": "Brooke", "ReviewID": "REV9K6J2ROG59", "Overall": "1.0", "Content": "I wanted to love this machine but was soured on it almost immediately. When I first booted it up I noticed the screen looked warped. It was then that I noticed the screen separation problem everyone has been mentioning recently. All around the screen you could see the electronics inside. I was able to snap it back into place but this should never be required of me, especially on a high end machine.At that point I figured I just finished off the job that should have been done in the factory. I was annoyed but hadn't lost faith in HP just yet. For two days I used the machine and was quite pleased. Then, out of nowhere, I got the blue screen others have mentioned. Hard drive failure.Thankfully Amazon customer service is wonderful and they gave me a full refund, including shipping. They said they had to refund because at that point they had pulled this product. It's back up now but I just don't trust it enough to order another one. I think I'll wait for Ivy Bridge and maybe go with a Macbook Pro. After all, it's what this machine is trying to be and I'm willing to pay a couple hundred more to have guaranteed quality.As for the problems most often attributed to this machine, I would advise people to ignore them. The image quality is beautiful and I noticed no problems with red. Also, the crappy touchpad and keyboard response are quickly fixed with a software and BIOS update. Again, not something I should have to do (especially the BIOS update) but I expect this sort of thing out of the box with a Windows machine.Come on HP. Do something in the future to restore my confidence. At this point you're like a cheating spouse. I've loved you for years but I just don't know if I can ever trust you again.", "Date": "May 11, 2012"}, {"Title": "DVD drive failed", "Author": "Sean Rider", "ReviewID": "R3G8SMNWBQ42A1", "Overall": "4.0", "Content": "I bought this laptop for the IPS display, even though it's a high-gloss finish.  I couldnt find any matte finish IPS laptops.  I was hesitant to make the purchase due to some of the negative reviews here, but I went ahead anyway since overall the machine had the stuff I wanted in a laptop.The laptop arrived in perfect condition, I turned it on and initialized everything perfectly, and have had absolutely NO PROBLEMS whatsoever.  It seems to be a great machine and I'm very happy with it.EDIT 7/4/2012:  After reading some more recent reviews, I'm thinking I'm lucky to get one of the good builds of this laptop, lol.  One thing that I did do once I initialized the laptop, was to go to HP's drivers and update sites and downloaded every update that was available.  It took awhile (less than 1 hour) but I ran all of those updates and I've had no software or OS problems thus far.The build quality is excellent, no dents or popping screens.  It is a little difficult to insert the USB plug on the right side, but a little push and wiggle and in it goes.  My only real complaint would be the positioning of the multi-gesture pad. It is not centered with the QWERTY keyboard layout, so my right thumb/palm bumps the pad as I'm typing sometimes and causes pages to jump around, etc.  There is a quick disable if you tap the upper-left part of the pad (where the \"touchpad\" icon is).  I've acclimated to it mostly, so I simply lift my right hand more to type successfully without disabling the pad. The multi-gesture works just fine. Sometimes i need to try again when I \"click\" something because either it didn't register the first time or I didnt do it hard enough.  The \"left-click\" and \"right-click\" have been working fine.  I also use a wireless mouse occasionally, so it's easy to just disable the pad in that case.I finally watched a couple of dvds w/ my girlfriend last weekend and the video quality was great. No lags or stutters whatsoever. The red/orange issue has been forgotten in my mind.  I don't even notice it.  But the one thing that stood out was the sound.  The speakers sounded just fine for web videos and such, but when playing the dvd, the sound was amazing.  I chose the movie option (i think thats what its called) in the Beats audio menu (push down on the volume knob and choose \"listening experience\").  The sound was great.  Voices were clear and loud, and sound effects were perfectly mixed in.  We were both commenting on the quality of the sound during movies.Once again, I'm glad I got one of the good builds!EDIT:  8/4/12Not even 2 months and the DVD drive failed.Of course it fails while we are traveling and attempting to watch movies while on a 10 hour train ride to Montreal.My primary source of entertainment for the kids on a long trip and the thing fails.So much for my decent review.  Not happy.", "Date": "June 16, 2012"}, {"Title": "Touch pad is this machines downfall!!!!", "Author": "ajsfunn", "ReviewID": "R10G5E0ZQBKXDQ", "Overall": "1.0", "Content": "Everything about this machine is super sweet but the placement of the mouse pad is disastrous!!!!!  I cannot even begin to say how much work I have lost because my palm on my right hand slightly brushes the pad.  I have had pages close out after 30 minutes of work. There is a button on the pad that will shut the pad off but after a while of going back and forth of turning it on and off you start to leave it on.  Then WHAM you erase your work and go back to using the button.  I am selling this for something else that the developers actually put some work into.", "Date": "June 9, 2012"}, {"Title": "Regular Notebook", "Author": "Victorsounds", "ReviewID": "R1YPLP7B3BDZJP", "Overall": "3.0", "Content": "I'm a webdesigner and I use this notebook with adobe master collection CS6. Works very well with Photoshop, Dreamweaver, Flash and Premiere (to work with premiere and prelude you must have to make changes on the BIOS). I use this notebook as a desktop, with external monitor, keyboard and mouse. The trackpad of this notebook is not good, the same happens with the keyboard (the keyboard fails sometimes). But for the price is a beautiful notebook, with good options to the sound, the monitor have a very good bright and resolution, but it's to hot (emphasis on the yellows). The battery have a long life. I also have an old MacBook, and works so good or better than this HP, so, in my opinion if you want a good notebook, go buy a Mac.", "Date": "June 6, 2012"}, {"Title": "Good but didn't impress me !", "Author": "Eric Ferdinand", "ReviewID": "RGHKAOI63J68Z", "Overall": "2.0", "Content": "I wanted to love this laptop but I couldn't bear some of its issues and then I decided to return it for a full refund. About the display, the clarity of text was nice, but I can't live with te orange issue (reds appear orange)and a 1920x1080 in a 15inch screen doesn't work well. I want to upgrade to a 17 I heard good things about it, I hope it will not have same issues. Did I mention that it was slower than I expected ? Others said it was fast but I didn't see any difference than a pretty basic one I have. Let's hope a 17\" will be good as the reviews I read. The two stars I give is all about its good external look !", "Date": "March 15, 2012"}, {"Title": "Hp Envy 15-3040NR 15.6 Inch Laptop", "Author": "Deborah Clark", "ReviewID": "R2GR5DXI3JQ3W9", "Overall": "5.0", "Content": "Great Laptop, have yet to find an issue with it. Love the volume control, super rad! I love it because it seems to be made with higher quality materials and it runs really cool even with more high end programs and games. Has yet to slow down in anyway, so really good speed. Very worth it for anyone looking for a new PC, or any Mac users who want something as similar to your old Mac as possible!Zaraxeon", "Date": "February 4, 2013"}, {"Title": "great laptop", "Author": "anastasia", "ReviewID": "R13M8YXJB94RG7", "Overall": "5.0", "Content": "great laptop i recommend it to everyone !!!! great performance and speed !!! totally worth the price !!! good job HP!!!", "Date": "February 4, 2013"}, {"Title": "Defective", "Author": "M. Kerr", "ReviewID": "R26CBV2M3DVX0T", "Overall": "1.0", "Content": "This computer is the exact one that my daughter's heart was set on.  Ordered it, waited for it to arrive, and off to college it went!  25 days later, it totally shut down, won't turn on - nothing.  Thank heavens Amazon is taking it back for a replacement.  We'll see how the next one works.", "Date": "January 30, 2013"}, {"Title": "The area around one of the USBs is bent", "Author": "Predrag Drljaca \"UI designer\"", "ReviewID": "R2L39T9MBC9WXJ", "Overall": "3.0", "Content": "The area around one of the USBs was bent right from the box. I was unpleasantly surprised that this expensive item can have such a flaw.I bought it for my friend, so I haven't turned it on and tried it myself. She's not upset because of the damage, but still - it looks like it was hit on that part :(The laptop looks amazing and compared to my Macbook Pro I must admit that it looks better, apart from the fact that the design was inspired from Macbook Pro.", "Date": "January 27, 2013"}, {"Title": "Poor support in Brazil - Audio Problems - Very disapointed", "Author": "MRGM", "ReviewID": "R130WK5RLDYABI", "Overall": "2.0", "Content": "I bought this computer on one of my business trips to the USA and I use it for business purposes and for entertainment at home. After six months (and after my last business trip to the US) the sound on the earphones stop working and the audio on the speakers makes a very low and strange noise. I contacted the HP Support in Brazil and they told me that since they don't sell this model they don't have the sound card to replace it, so I contacted the US Support and they told me that I need to get my laptop back to USA in order to fix this problem. I don't know if I'll have to go back to the US in the next 6 months and my guarantee will expire before that. Surprisingly I found that in Brazil there's a similar Envy model, using the same Beats technology (and soundcard) I know about hardware I'm an IT Professional so nobody can fool me about hardware.The US support is very good I had a problem in October 2012 with the power cable and they send me a new one very fast and free, and I'm OK overall with the laptop performance, looks and graphics, the only problem right now is the sound and without it I cannot do video conference, listen to music, videos or IP calls, so is a very annoying issue for me.If I had a chance I would return this laptop and get a better one and maybe another brand, this is my 2nd HP notebook and with my older corei3 Pavilion 14 I didn't had problems for 3 years. I'm very disappointed about the HP support in Brazil.", "Date": "January 24, 2013"}, {"Title": "I expected more", "Author": "Kervin Delice", "ReviewID": "R36Z35OECUXD6M", "Overall": "2.0", "Content": "It looks nice in pictures and youtube videos but after awhile you realize how cheap the materials are. It has a heating problem too. I regret buying it.", "Date": "January 9, 2013"}, {"Title": "Nice design, faster than my past computers, but still several flaws.", "Author": "J. Hedgepeth", "ReviewID": "R3K2FUX4650H6L", "Overall": "3.0", "Content": "I'm not going to go over all the features. They can be viewed elsewhere. I think if it wasn't for the malfunctions, it would get five stars for design and performance. Unfortunately there are some problems that shouldn't be.Well, for starters, for some reason I have to run Word in safe mode. However, most software works good. I find it to run smoother than the desktop and laptop I owned before this.The screen doesn't show red  spot on, but its mostly unnoticeable but still a slight flaw.The audio is great. Although, my beats button that allows easy and quick access to beats audio settings seems to stick or not register all the time, and its done that from the moment I got it.Also, the USB 3 port doesn't seem to register right, @ times connecting and other times not connecting.The fan wasn't too bad at first, but after a month or so, it got really load. So load, carrying my laptop to say class just isn't a viable option because their is no doubt it will be too big of a distraction. Furthermore, now it's having the fan is messed up and could cause heat problems. I can't keep ignoring it because the computer Ida getting to hot to touch in places.Now the fan is the biggest problem, followed by word, which I use often. I bought it in July. I'm going contact HP about replacing it. There has to be some sort of warranty. I haven't had it six months and there are hardware failures.", "Date": "December 7, 2012"}, {"Title": "Awesome!", "Author": "Dan Regan", "ReviewID": "ROSXH6ITRRJT7", "Overall": "5.0", "Content": "Love this computer im writing the review on it now ive had it for about 5 mounths and its been great the sound quality has been pronominal but when your watching a movie you have to make sure you switch it back to movie mode or you wont be able to head any of the voices. great computer.", "Date": "December 4, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006PCDJI2"}}