{"Reviews": [{"Title": "Great buy!", "Author": "Daisy Miller", "ReviewID": "RMD3KOSMVY7UJ", "Overall": "5.0", "Content": "I bought my Toshiba laptop almost three years ago.  It's been great.  My husband and I both use it as our primary computer and move it all over our house.  I know it's gotten bumped and jostled a lot but it works perfectly.  This computer is fast and user friendly.  As a banker I love the 10 key option.  The computer itself is easy to carry although not the lightest computer I've ever held.  It's also comfortable to type on unlike other laptops I've owned and the keyboard is almost as large as a standard keyboard.  The screen is large and the picture quality is great I watch a lot of instant videos on my laptop and they always come through really well.  This computer has already lasted much longer than both Dell and HP computers that I paid twice as much for.  I could upgrade but this computer works so well I have no desire to.  I'm planning on buying my husband one for his birthday and I know my next computer will eventually be a Toshiba too. I've never had a laptop I actually loved before.  This one is just awesome and so reasonably priced!", "Date": "February 12, 2012"}, {"Title": "Positive experience", "Author": "For Real \"HAND\"", "ReviewID": "R2G6KWMTQ84KDF", "Overall": "5.0", "Content": "I bought my C655D a few months ago at a local store when it was on sale. Even though the 2GB memory is not a lot, it's enough for my needs! I use it daily for watching streaming videos, a few times a week DVDs, and I also use it to surf the web and use Word and Excel. For web surfing I use it to participate in Amazon's Vine program. The laptop is fast enough, and thanks to IE9, I've been able to consistently log on quickly and request stuff I'm interested in trying out. I'm typing this review on the comforable keyboard. I find the C655D a good inexpensive laptop that's much faster than a netbook which costs about the same or even more. The screen is big and bright - and it's nice to have a numeric keypad! Currently I have 5 tabs open in IE9, Word 2010 open, Windows Live Mesh and Messenger running in the background, I also have WMP 12 open but paused on a streaming video, and I just downloaded LastPass in the background. The C655D feels fast and responsive all this time! For virus and spyware protection, I use the lean and mean and highly effective Microsoft Security Essentials, which is free for all Win7 and Vista users. (XP users can get the free Windows Defender, also from Microsoft.)", "Date": "March 15, 2012"}, {"Title": "toshiba review", "Author": "roberto", "ReviewID": "R2KXVHCW8GGF7S", "Overall": "4.0", "Content": "Computer is lightweight and very easy to use. Power consumption is resonable as well as battery life.Cost is very affordable", "Date": "March 25, 2012"}, {"Title": "Bad Interaction Problems", "Author": "ScienceGal", "ReviewID": "RFWTJQVPN6S45", "Overall": "2.0", "Content": "I owned a previous version of this computer which I really liked.  The first thing you need to know is that this computer requires a fairly unique power source so if you want to order extra power cables, it is going to be a pain and expensive.  The computer itself has a long lasting battery, is fast, and has beautiful graphics.I love the light up keyboard but do not get any liquids anywhere close to it.  You should consider investing in a keyboard cover since even a fraction of a drop of liquid can short out the keyboard.Now for the downside, the computer bluescreens constantly.  There is some kind of a change to the software from its previous incarnation that interacts badly with something I have loaded and causes constant bluescreens.  I have fairly basic software. The longest I have gone without blue screening is three weeks.  However, mostly it blue screens multiple times in a day.  I have reloaded the operating system twice and I have had the computer into an authorized Toshiba repair shop multiple times and I still have the problem.  This is a deal breaker for me and I have reverted to using my old computer.Therefore, I give it two stars.", "Date": "June 2, 2013"}, {"Title": "Laptop", "Author": "Mel", "ReviewID": "R2XLX0ENTISVOG", "Overall": "5.0", "Content": "this product is wonderfull.  I love it.  I am still learning about Windows 7.  This product is easy to use, light and exactly what I wanted.  I would hightly recommend this product to everyone.", "Date": "November 28, 2012"}, {"Title": "my old toshiba was better", "Author": "T. Williamson", "ReviewID": "R1O8XLJ2GMTA37", "Overall": "2.0", "Content": "this one seems much slower and less able to handle videos and downloads. not satisfied with this one at all.", "Date": "February 24, 2014"}, {"Title": "good laptop except for faulty mouse buttons", "Author": "a dad", "ReviewID": "R2CYF6EY6CTY8X", "Overall": "1.0", "Content": "I've owned about 6 laptops and this is my favorite brand except that the left mouse button only lasts about a year. It gets weaker and weaker as the spring inside wears out.  I first experienced this about 5 years ago and had to trash my toshiba then. Now in 2012 my Toshiba c655 laptop is doing the same thing. I looked online and it's a real common problem. Conspiracy theory is that Toshiba doesn't fix the problem so people will buy new computer every couple of years. I don't know why they don't put a better button on the machines, this is not a cheap computer.", "Date": "March 4, 2012"}, {"Title": "nice for low price.", "Author": "Dieosa Garden", "ReviewID": "RPSNU3SGRYETM", "Overall": "4.0", "Content": "the computer was used and i found that i am happy with it and i am using it right now .", "Date": "February 18, 2013"}, {"Title": "No windows 7 disk", "Author": "Cadull", "ReviewID": "R1OULNETVMEUE7", "Overall": "1.0", "Content": "Windows 7 license was pirated or already used.  Sent laptop back.  Recieved full credit. Toshiba support was really bad.  I'll never buy this brand again!", "Date": "December 28, 2012"}, {"Title": "Really great for the Black Friday price!", "Author": "Sue Nicklin", "ReviewID": "R1IYDYT3T6O3B4", "Overall": "5.0", "Content": "Bought this for my son for Christmas!  He loves it and for the price, it is unbeatable! Would definitely buy again", "Date": "December 25, 2012"}, {"Title": "Dc jack out in ours", "Author": "TLC \"mamatc\"", "ReviewID": "RY4FE9AGLF6TV", "Overall": "3.0", "Content": "4 mos after 1year warranty, dc jack worn loose, will take $225 to fix.....wouldnt buy again! Only fixing because still cheaper than new oneUpdate.. figured out the shop who said it would take $225 to fix, didnt really want to fool with it.  When I said go ahead, they hemmed and hawed and never started on it.  Luckily, I found an awesome repair shop that offered to take a look at ours.  I had initially called them to ask out transferring the hard drive files to a new hard drive so we could at least save those.  2nd Repair guy said they do see a lot of broken jacks with this model and he recc trying to fix before junking.  So glad he did.  Repaired it (epoxy to reinforce it) for only $75.  Since then, it has worked great.  I feel I owe an apology to Toshiba.  There was nothing wrong with MB, or HD, unlike what 1st shop had me believing.  After jack was fixed, it fired right up.  For the price, this has been a good laptop.  When we need a new one, I am prob going to buy Toshiba again.  They do need sturdier jack connections though.  Hope they will work on that.", "Date": "February 17, 2012"}, {"Title": "ABSOLUTELY TERRIBLE!!!!!!!!", "Author": "MICHELLE D.", "ReviewID": "RYDCD2K2Q73QX", "Overall": "1.0", "Content": "This laptop crashed less than 2 weeks after I purchased it as a Christmas gift for myself.  Not dropped or otherwise mishandled.  Registered my warranty 3 TIMES with customer service (registration was always \"lost\" even though I had a reference number for each call).  Toshiba required that I spend hours on the phone with tech support after each registration to attempt a cyber repair.  Always told a return mailer (at my own expense) was on it's way.  STILL WAITING!  DO NOT PURCHASE!!!!!!", "Date": "February 22, 2013"}, {"Title": "Cheap", "Author": "Matthuff", "ReviewID": "R3MTOYS3OMJ2RU", "Overall": "1.0", "Content": "Had this laptop a little over a year and here are the problems I have already experienced.Webcam shuts on and off from time to time,DC jack has already broken,something is loose to the right of the mousepad and pressing on the casing it makes a high pitched noise,the sound shuts on and off,Battery already says it needs to be replaced.My opinion is to spend the extra money and get a dell or hp, because unless you want to buy another laptop in a year this isnt worth your time.", "Date": "March 5, 2012"}, {"Title": "Crash, boom, bang!", "Author": "Mindlink Educational Consulting Inc. \"Roxana\"", "ReviewID": "R19LO5ASGW25T7", "Overall": "1.0", "Content": "The Toshiba Satellite I bought new also crashed about one month past the warranty period.  Lots of important documents and personal photos were lost.  It wouldn't even turn on, and my computer tech told me it wasn't worth the $$ to fix it because the data would be lost anyway.  Customer \"service\" was no help whatsoever. In fact, one guy just told me to throw it out and \"would you like to buy another Toshiba Satellite?\"  What nerve!  Never again!!", "Date": "March 1, 2012"}, {"Title": "Worse money ever spent", "Author": "Steponapoptop", "ReviewID": "RNVA94Q9INLAR", "Overall": "1.0", "Content": "I am usually a Sony man but thought I would buy this laptop for my non-business uses. It totally crashed on my 3 months out of the 1 year warranty. Cost to repair? $350 minimum. Called warranty and the said sorry can't do anything for me! I asked for a discount on parts or service and they said they couldn't do anything. Run don't walk away from Toshiba!", "Date": "February 6, 2012"}, {"Title": "Perhaps the worst..", "Author": "Felix", "ReviewID": "R2XDOP04MCGBZP", "Overall": "1.0", "Content": "I had this PC for 2 years and it just died on me, dont spend your money on this PC, pay a little more for something better.", "Date": "March 19, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006TI4292"}}