{"Reviews": [{"Title": "Great Deal! Good laptop!", "Author": "Musicfan \"Alexis\"", "ReviewID": "RI6PVCYBG99SV", "Overall": "4.0", "Content": "I needed a new laptop after the hard drive on my 3 year old Dell laptop crashed a few months ago. Because I am a college student, I wanted a smaller computer to carry around campus or use comfortably outside of my room. The 14'' screen is a  widescreen and is excellent for viewing pictures, videos, and movies. My old computer had a 15.5'' screen. I prefer a larger screen, but the bigger the screen, oftentimes, the heavier the laptop. This computer weighs about 5 lbs with the battery (without it, it is obviously much lighter), but it feels like it weighs much less. The keyboard is also a good size and the keys are not raised, so food, dust, and hair are less likely to get caught in the keyboard. I own this computer in black and the photos are true to real life. Orginally, I wanted this laptop in white, but decided against that because it would get dirty very quickly. The computer uses Windows 7. My old one had Vista, so I'm still getting used to Windows 7's new features. I've had this for almost a week and it is very easy to use.PROS:Screen sizeKeyboardMemory (4GB included. Very fast! I can listen to music, be on the Internet, and run other programs without the computer slowing down)Hard Drive (640GB is more than enough space for me and the overall price is great.)WeightCONS:The lid is not fingerprint proof. Even in black, fingerprints are still visble. Not a big deal to me.The mouse is a little unrespnsive at times and the touchpad isn't very smooth. Not a deal breaker, however.No recovery software included.*Make sure to backup your files often on an external hard drive or CDs and make a recovery disc (instructions are provided). The computer does not have any discs containing the OS software or recovery information. *", "Date": "January 25, 2012"}, {"Title": "Best Laptop I've had so far...", "Author": "N. Senman \"NS\"", "ReviewID": "R1O82EAKKXCX97", "Overall": "5.0", "Content": "I purchased this laptop for $499.00 at PC Richard. It was the last one they had and was originally $699.00 and marked down so I said I can't beat this price anywhere for this model so I purchased it. I like the look, even though it is all plastic and I am not a fan of all plastic laptops I still think it is one of the best constructed ones I've seen. The ASUS are pretty good too. The keyboard is nice with the chicklet style which is pretty popular these days. The keyboard is attractive and I like the laptops simplicity in design. Vaios are always know for being pretty cool looking. I upgraded the RAM from 4GB to 8GB and now this thing is blazing fast. It gets a Windows Experience Index of 4.7 overall within which is based on the lowest score which is the graphics but the rating says it can use up to 1.6 GB of video memory which is pretty good. The Processing speed is at 6.7, and the RAM is 7.2, so overall this laptop is fast for the price you pay. I don't care too much for Home Premium Edition but at least it comes with 64bit. I may redo the hard drive with Windows Ultimate 64bit version. Here is my list of pros and cons...Pros: Good processor speed, works fast with 4GB and 8GB RAM, Good stylish design, HD graphics, Good screen resolution, nice keyboard, expansion slots, 4 usb ports, DVD RW, good battery life.Cons: Touchpad can be quirky at times, Windows home premium---would prefer Pro or Ultimate, plastic. Changed to Windows 7 Ultimate...it was well worth it.Overall, I am glad I bought it. It satisfies me, and works well for what I do. I mainly do word processing, video, and browsing the net. Not really into laptop gaming, I've got a desktop for that and the Sony PS3.Thanks", "Date": "June 15, 2012"}, {"Title": "Good Laptop", "Author": "Jillian R. Viles \"ATLJV\"", "ReviewID": "R360VSIJNM0OU8", "Overall": "4.0", "Content": "I think this computer is really not that bad!  Considering I bought mine at Best Buy for $320.00 and it runs very smooth!  I to have issues with the mouse pad, but once I plug in my travel mouse which I prefer anyway everything is fine! I installed Norton 360 and have not had any issues with performance.  Great laptop for the price considering most Sony's are astronomical.  Thanks Sony for making a nice laptop at an affordable price.", "Date": "May 11, 2012"}, {"Title": "Works great & lovin' it!", "Author": "gingerbread", "ReviewID": "RQY5N1FP9F1AD", "Overall": "5.0", "Content": "I've had my laptop (pink) for about 5 months and its working great!  I love the white keyboard which makes it so much easier to see the letters on the keyboard.  I love the 14\" size, I would never buy anything else.  All in all I have had no bad issues with it.", "Date": "April 1, 2012"}, {"Title": "sony 14\" laptop", "Author": "frank", "ReviewID": "R3U6JTPR4J8SQQ", "Overall": "5.0", "Content": "There is not much more than to say that this is a quality laptop. This is the second Sony laptop I've had, and it is overall excellent. I have no complaints...", "Date": "May 26, 2012"}, {"Title": "iT'S OKAY, NICE FOR THE PRICE", "Author": "Olivia", "ReviewID": "R10YI6TMZS2PCL", "Overall": "3.0", "Content": "I sort of wish I had saved up more money to buy a mac, but this computer is nice too. I bought it used, it was 400 dollars. It has many security warnings that pop up constantly and I don't know how to get them to stop... it's also a little slow after it has been closed for a while sleeping. But its very functional and works fine for everything else.", "Date": "June 5, 2014"}, {"Title": "Great laptop", "Author": "Gil Weiner", "ReviewID": "R2PNPN51FYZH3I", "Overall": "5.0", "Content": "Love the feel of the keyboard. The speed is good for all types of work and play. It is light weight.", "Date": "May 22, 2014"}, {"Title": "Don't waste your $$$", "Author": "BearsDancing", "ReviewID": "R2IIB7992RD6T1", "Overall": "1.0", "Content": "I bought a VAIO laptop in 2009.  It was great.  So when I wanted another laptop I bought this one.  Worst decision I've ever made picking a computer.  My first VAIO was great.  This one is garbage.  It would take entirely too much space to describe the myriad of problems.  Don't buy this computer.  You'll regret it.", "Date": "January 23, 2014"}, {"Title": "light weight, screen is just the right size", "Author": "Heather G.", "ReviewID": "R20CC6SM9089I9", "Overall": "5.0", "Content": "Bought this so I wouldn't have to work from my old desktop that the kids and husband use. Makes my life easier, have had some quirks like the mouse jumping around on the screen occasionally just like I read in other reviews. I worried about that but it's really not that big of a deal. I also wanted to avoid Windows 8 and Windows 7 has had good reviews compared to Vista and 8. When I went to college for computer information technology the rule of thumb was that every other operating system by Microsoft is the good one. So since Vista had quite a few issues, seven was the way to go. This little laptop offers room to upgrade to the next good OS so it should last me a long time.", "Date": "October 16, 2013"}, {"Title": "Anonymous", "Author": "Anonymous", "ReviewID": "R3NR3E27G3QC5H", "Overall": "2.0", "Content": "A week after i had bought this laptop, it started to give me a hard time. It would slow down and freeze and I would have to restart it alot. I had to call Sony vaio Care a couple of times to fix it for me. So i did system restore and system recovery on it a few times. Even after all this, it would be okay for a while and then go back to its annoying ways. So i was basically going back and forth between the laptop giving me a hard time and me restarting it or calling Sony Vaio. If anyone purchases it, Good Luck with it.", "Date": "June 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006MB8GKW"}}