{"Reviews": [{"Title": "thought it was good, 6 weeks later it's dead.", "Author": "AmethystWoman \"AmethystWoman\"", "ReviewID": "R35UCNRWH69NOZ", "Overall": "1.0", "Content": "***my original review of mid Jan was great. I was impressed. it's now April 6th. yesterday it was fine. Today, as soon as I hit the power button a white screen comes up and that is that. I tried fixes I found online (taking out battery, holding the power button for a long while, hitting it ten times, putting battery back in etc.) still no boot.Warranty is handled by IBM EZ serv. I spent 3 hours online yesterday trying to find out where I could get it repaired locally. By the time I found it, after the mess of IBM EZ website (what a nightmare. Why do they need you to sign up for an account THEN ask you for your name and address like 4 times before they will get you to a screen where they finally STOP asking! They even kept saying I needed to add the floor my business was located on. I don't own a business. In the end, made on up. just stupid. The most frustrating experience esp since I was trying to do it on my cell phone. The only other internet access I had at the time.)  Course, by the time I finally found out where the most local repair authorization place was (gave up on the IBM site and dug till I found the info elsewhere), it was after 5 on friday and now have to wait till Monday. But from the message on the answering machine, it doesn't sound like the place I found in Asheville, NC is really a repair place either. We'll see if they call me back. I did manage to put in a ticket to IBM in the end. Think twice about where you will get this fixed before you buy it. I can't throw away a few hundred dollars on a computer that lasts only 7 weeks. And I just discovered this is a not uncommon problem? So much for sturdy enough for kids. This computer was treated kindly yet still broke in less than 6 months. Call me angry!----original review. all true except if it won't boot, it don't really matter right?-----I am a writer and needed certain things. they say the netbook is going away but for writing, we can't use a tablet without a real keyboard. this is the answer for many of us.1. battery longer than 3 or 4 hours. This one is 6 without a dimmed monitor. btw, the only way to get the 8.5 stated is to have the monitor so dim it's almost black. stupid for them to even begin to count that! but 6 is good for writing anywhere there is no plug. I'm NOT limited to certain coffee shops etc.2. Has windows 7 pro64 which I found amazing. Most have windows starter - a real stripped down version of windows. Wanted 7 because 8 seems to be a nightmare. More work to learn a system to do the same thing in the end. (without a touch screen, windows 8 might as well not exist.)3. runs on the amd equivalent of the intel i3. Many run on ATOM (stay clear!), the new ones run on chrome which means you can't run your own programs (like celtx, photoshop, indesign etc.) You can only run google apps and they all get stored on the cloud instead of in your personal computer. NOT ok for writers or anyone who wants the document on their OWN computer. no better than a tablet without a real hard drive. This one had only 1.3ghz rather than the newer version which has 1.66 but for about $300 less, i'm good with the slower processor. I'm not intending to run the world from here! :)3. 320 gig and NOT a 5400 hard drive. For those who don't know, the faster hard drive is quite amazing! it's rare to find such a fast hard drive in such a small device. Lenovo seems to mostly use faster hard drives which is a very pleasant surprise and speaks a lot to me of the company. (doesn't just stick in the least expensive parts even if you have no idea what a fast hard drive is.)4. upgradable to 8 gigs of RAM/memory! most gateway 10in netbooks have 1 gig and difficulty upgradable to 2 max. This one has two ram slots and can be good enough to run all adobe products you want to run in a small screen.5. speaking of which, an 11.6 inch screen rather than the traditional 10.1. great.6. AMD dual core is the semi equivalent of the i3 intel. same system I have on my \"real\" laptop and it works fast enough for me (a graphic designer). good enough sometimes is financially good enough right?7. price. this is almost $600 on the lenovo website. this is a great price. older netbook but not by much. worth a little older for windows 7. the technology is less than a year old. good enough for gov. work.8. this is a \"built tough\" netbook which I frankly didn't know when I bought it. (got it from woot.com for $300 + $5 shipping on special.) it's almost 4 pounds because the plastic on the computer casing is much higher quality than any other I looked at. it's not flimsy. there is a rubber rim all around the monitor  which encases all the edges when it is closed. Less chance to bump and dent and have a \"mild\" drop and have it no longer work it seems. The keyboard is spill proof or resistant. forget which. it's made specially for grades 1-12 which doesn't turn me off at all since the plus is \"tough built\". works for me, an adult wanting my netbook tougher and the extra 3/4 pound is ok with me.  btw, this also means that all the side ports are recessed! and the plug seems more heavy duty as well. I have lost an HP because it would no longer charge because the plug on the laptop broke loose from the motherboard. this seems much less likely to happen on this computer. there is even a center wire (like on a cable wire) on this plug which makes it seem like it's less likely to be yanked out - which I think caused the \"broke off the motherboard\" issue I have had.***there are two problems I have already seen in 3 days. One is that the mouse track pad is really bad out of the box. you put the mouse somewhere and it slides away. a real PIA and enough to make me want to return it. You can't put the mouse between letters and next thing you know, you are typing elsewhere. NOT ok.I googled the issue and found that on December 18th, they came out with an update to the drivers for the ultranav system on thinkpads. I installed it and bam, problem fixed. yeah.the other thing that matters to me and may not to the casual user, is the placement of the fn key. I am used to the control key being at the end of the lower row of the keyboard. I use \"control A\" \"control C\" and \"control v\" tons. Its not working for me since I find myself always pushing the fn key instead. that will take adjustment is all.  I wish they had put the function key closer to the space bar like it is on many laptops - like my viao. bad design decision in my mind but I will adjust.otherwise, and with the ultranav update, this seems like it will be perfect for me.  the newer version with the 1.66 is the exact same organism, so this review will count there as well.  the ultranav update:[...]hope this helps.", "Date": "January 18, 2013"}, {"Title": "I like the computer, but beware of the seller's misleading description", "Author": "ideagirl", "ReviewID": "RBC9992XJ7PKV", "Overall": "4.0", "Content": "These are actually great little computers. I bought one at a super discount last fall and it has been a rockstar. However, it got the H20 virus and I needed a replacement asap to get some important project files off the drive. I found this one. The title says \"2GB RAM\" but the description says \"8GB RAM.\" I asked an Amazon rep to clarify the actual equipment and she confirmed it shipped with 8GB of RAM.When the computer arrived it only had 2GB RAM. Because the purchase was through a third party vendor \"fulfilled by Amazon,\" my only option was to return the computer. At that point I had already installed my old drive, was on the road with my project, and didn't have time to return and re-order, so I settled for purchasing a RAM upgrade. I will say Amazon's customer service was very good, but there is only so much they can do regarding third party sellers.This title not matching the description issue has been plaguing the site for quite awhile now, Amazon really needs to reign it in. 2GB of RAM barely gets Win7 Pro up and running.Now, regarding the actual computer, these things have a bad rap, but as an IT professional I have found mine to be solid workhorse of a netbook. Don't expect to do any gaming or major video procution, but if you need a good, solid netbook that travels well, is solid and reliable and will handle day-to-day office tasks (Office, basic image editing, PDF creation, etc.), this is a great buy. An 8GB RAM upgrade is under $100, so you can save some money by buying this one they cheaped out on and adding some RAM.", "Date": "June 11, 2013"}, {"Title": "powerful little guy", "Author": "leefuji", "ReviewID": "R2L8PK9DFUOCXT", "Overall": "5.0", "Content": "I keep coming back for these little guys. they fast, reliable. the price is Ok. We deploy these to our Salesmen on the road and we haven't issues with them. great buy!", "Date": "January 23, 2013"}, {"Title": "Love This Little Computer!!!", "Author": "Jo Ana Starr \"Mind-Body-Spirit\"", "ReviewID": "R1B97616U7RUQY", "Overall": "5.0", "Content": "I am a recovering Dell uesr, by way of Asus, and now finally home!!! I love this computer, so little with a full size keyboard and about 3 pounds of power.I am surprised by the negative reviews. It's quick, boots up pretty fast, and it is the perfect size for life on the road. I have large hands and I manage just fine with the keyboard, and I appreciate the 11.6\" screen when compared with a tablet or 10\" netbook screen. This one seems so much larger.I love Thinkpads and also had a Lenovo x120e that I dumped a can of soda on, so this cute little guy is its replacement.Great company, great netbook-sized laptop!", "Date": "June 16, 2013"}, {"Title": "Cool lenova laptop", "Author": "Amit Kumar Jain", "ReviewID": "R19IKQTHO52MJ6", "Overall": "3.0", "Content": "I bought this lenova laptop its nice small looking a bit weight then comparing with other small laptops and key pad works slowly and other application as well ok to buy not fully satisfied", "Date": "February 7, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006RA09S0"}}