{"Reviews": [{"Title": "This is the best notebook I've used", "Author": "shufengjue", "ReviewID": "R1W2V2L3X86EBZ", "Overall": "5.0", "Content": "I just got it few days ago and love it. The guy runs so fast that even better than my other Sony i5. The HDMI turns my 70' LED TV into a giant screen, which is beautiful, as well as the video games. I definitely recommand this one, with such a great price.", "Date": "January 9, 2012"}, {"Title": "Best Laptop I've Had", "Author": "CJ", "ReviewID": "R3SX47ZPTANELX", "Overall": "5.0", "Content": "I'm not really a \"techie\" kind of girl but I had a short list of my needs for a new laptop. After a little research I wanted at least an i5 Core Processor with Windows 7 and enough GBs and I didn't want to spend too much.  I really like this Asus and found it more than meets my needs and for a fantastic price (in my opinion anyway). It was easy to uninstall anything I didn't want and then to set it up to my personal preferences, like setting power saving options and default programs, etc.  Good set-up and fast right out of the box (after charging of course).  I've had it for 5 months now and I'm still happy to use it every day, whereas my former laptop was a pain.  Battery life is good and I'm happy with the keyboard too. Love my new Asus K53E Laptop.", "Date": "March 18, 2012"}, {"Title": "Overall a good laptop", "Author": "librarian129", "ReviewID": "R2S6B5YJHHQ048", "Overall": "4.0", "Content": "Have had this for about three months.  The key board is nice, but the mouse pad has been having some problems being almost too sensitive to movement sometimes.My main computer before was a netbook and while this much faster, I haven't been thrilled to carry it in a bag to and from work.  But what I had before was less than 2 pounds so I did expect this.Also, this has taken a few knocks and hasn't yet had a problem surviving them.  So is great if you want to take it about places.Not really brown.  I received it and thought it was black.  The matte finish does not get fingerprints.3 UBS ports, HDMI, and what I think is a VGA, which will took up to a monitor.It is a lot of computer for the price.", "Date": "December 3, 2012"}, {"Title": "got to get it", "Author": "mandraak", "ReviewID": "R1J62FZ3XZL7KU", "Overall": "5.0", "Content": "the laptop is a good buy it is proforming above my expectation. very fast and the i5 processer is a real upgradefrom my last computer. the color is nice also", "Date": "February 22, 2012"}, {"Title": "well sell", "Author": "mariosuperca", "ReviewID": "R18QPQTQB9BDTB", "Overall": "1.0", "Content": "First thing when I ordered that laptop its says intel core i5 and it was only i3 and also was missing important programmes, couldnt also turn that windows 7 in and another language, than english.this time I am very desapointed, this was a gift for my granddaughter, I didnt return that laptop because it would cost me to much for its value, and the case of the laptop was broken on the corner.......", "Date": "February 13, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006O3T4D6"}}