{"Reviews": [{"Title": "Nice!!!", "Author": "Travis45404", "ReviewID": "R3NVYA05HZ3WEA", "Overall": "5.0", "Content": "I'm moderately tech-savy and I think this computer has it all. Built-in camera takes awesome video even in low light, the sound quality is incredible and the processor on this thing is fast...much faster than my old desktop. I love the many USB ports it has and my wife and I am excited about how sleek it looks and the quietness of the keys. Very pleased.", "Date": "February 14, 2012"}, {"Title": "Great Compaq quality, a little slow", "Author": "Alaska Computer Tech", "ReviewID": "R2GYON548H2T93", "Overall": "4.0", "Content": "I bought this recently as a gift. I'm a PC tech and deal with laptops and desktops a lot. The first thing I noticed out of the box was the quality of the build. Compaq used to be a very high end laptop company back in the mid to late 90's before HP bought it out. So the laptop was well packed, and the case and fittings were very high quality matte black.On setup, I was walked through the usual Windows legal blah blah, and on startup I noticed it a bit slow. Not bad, but I noticed it. I was pleased to find that Compaq didn't load a pile of junk on it like the other companies do today, and they all do. I only had to remove the antivirus to install free Avast and remove the HP Dock and one other docking station on the desktop.The installation went great and after paring down the operating system I still felt that the computer was lacking speed. So I opened it up to add a 2GB memory SIMM and found that Compaq had used 2 X 1GB memory SIMMS! For those of us in the industry we know this is \"cheaping out\" by the computer company. They could have at least used 1 X 2GB memory SIMM so I could have a total of 4GB of memory. The installation was a snap, if you need to know how go to youtube.com and search for compaq latpop memory upgrade and it will walk you through the procedure.The laptop has built-in webcam and a JBL sound system, which is nice for a small system. The picture is clear and bright. The hard disk is 250GB, which would be more than enough for most users. The keys are very high quality, again, that Compaq touch to finishing, they are quiet, soft and sure feeling. The lid closes softly but securely. All around an excellent build.After activating Microsoft Office, doing some updates, and removing some startup programs, I feel this is a good speed computer for the money. Sorry Amazon but this laptop can be found for $299 elsewhere.This laptop exhudes quality and after a memory upgrade and some OS tweaking, it operates just fine. It's no screamer, if you work with 6 or 8 windows open you might want to consider a more powerful CPU, but for casual surfing, email, and movie watching, this one will work fine.  I highly recommend this system with one caveat: Upgrade the memory to 4 or 8GB, and bear in mind you will end up using the two internal memory sticks for earrings, they aren't really worth much. Good job, Compaq! :-)", "Date": "April 19, 2012"}, {"Title": "Amazing Laptop for the Price", "Author": "springfieldsharon", "ReviewID": "R2LAQ5DR333DOU", "Overall": "5.0", "Content": "Once again, Amazon has provided excellent service, products, and prices! My new Presario CQ57 was a snap to set up and comes with lots of bells and whistles... so many shortcuts and even a free introductory period of Norton Security! If you just want a laptop for fun, photos, email, and web browsing, this is your best buy!!", "Date": "March 30, 2012"}, {"Title": "Satisfied", "Author": "Bargain shopper 77", "ReviewID": "R2PGSP4OU7V82X", "Overall": "5.0", "Content": "My old computer just went haywire on me and I didn't want to just replace it I wanted to upgrade. This was a wonderful replacement and I am enjoying all of it's benefits. I have alot of responsibilities that require the use of my computer and this product performs well and can do much more than I need it to do.", "Date": "March 20, 2012"}, {"Title": "Good product", "Author": "Robert R. Salyers", "ReviewID": "R2O20USEQ6MZF5", "Overall": "4.0", "Content": "Fairly good starter unit.I use mine for travel and browsing ,e mail .have a pc for morer serious things.Functions well,very easy to set up.Got mine at wall mart for 299.00Dont spend more if you dont need to.", "Date": "April 9, 2012"}, {"Title": "Good!", "Author": "Squeeks", "ReviewID": "R2YP9BT7D7M4P2", "Overall": "4.0", "Content": "Low memory space (can be fixed), but overall really great! So far so good with no problems. It is a good buy.", "Date": "April 18, 2012"}, {"Title": "Great laptop; no overheating and very fast!", "Author": "Cass", "ReviewID": "R1TOMJL09C34WP", "Overall": "5.0", "Content": "I bought this computer because my old one(Emachine; which is also a great laptop) started to overheat. I was worried that it might start on fire because it got so extremely hot. Well I bought the Compaq with a big of concern because my Mom has one and I didn't really like it and how the keys are set up. I soon changed my mind, this laptop is so fast and never overheats. Sometimes  you can heart the fan running but that's normal, but I do suggest disabling some of the toolbars and the norton on Internet, it slows you down a TON. So that being say I recommend that you download AVG with it, other than that...it's a great laptop and worth the money!", "Date": "June 15, 2012"}, {"Title": "The Compaq is a very good computer", "Author": "Kimberlyann Stevenson \"D&A;\"", "ReviewID": "R20H0WUN2Z0ZZ3", "Overall": "5.0", "Content": "i got the compaq CQ57 because my old netbook crashed and i wasnt getting another one of those because there not very good. i love the compaq because its easy to use.", "Date": "May 12, 2012"}, {"Title": "compac 15.6\" laptop", "Author": "Clare Garabedian", "ReviewID": "R322891AQHMT0X", "Overall": "4.0", "Content": "It is perfect for what I'm doing. I'm a director of Emergency Management and there is a lot of paper work especially when a shelter is opened. I just needed a laptop to store forms, phone numbers, and other information.I also need to make spread sheets to enter information on volunteers and visitors and their time in and time out when the shelter is opened. It will help eliminate a ton of paper work. This lap top does all of this for me with no problem.", "Date": "May 5, 2012"}, {"Title": "Disappointed", "Author": "CHRISTOPHER WELLES-PRYOR", "ReviewID": "R1GEW8LU3P6RBR", "Overall": "1.0", "Content": "I've had nothing but trouble with this computer. It's been back to HP two times and still it's , we'll I guess I bought a lemon.", "Date": "January 8, 2013"}, {"Title": "Need a upgrade", "Author": "Kj", "ReviewID": "R2SOF6FBR8EFQ7", "Overall": "3.0", "Content": "Needs to Be faster , my phone is faster than this shit ! But anyways an ok laptop . Getting a MacBook Pro when the new on comes out .", "Date": "July 12, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B006OEL9HE"}}