{"Reviews": [{"Title": "Pretty close to perfection", "Author": "Roger J. Buffington", "ReviewID": "R1ZZPS56VQDMHB", "Overall": "5.0", "Content": "Laptops have been around for quite a while and they keep improving. HP has really gotten it right with the DV7t Quad Series.  These are powerful and beautiful machines that are well-thought out, with impeccable build construction, and lightning-fast performance.  I bought the one featured here on Amazon with the exception that I added a 2GB Hard Disk Drive and went with 12GB of DRAM.  Overkill perhaps, but there you are.The screen is superb on this Notebook.  I have an external HP 2511x 25 inch monitor which I have considered to be pretty much the gold standard for monitors.  The 17 inch screen on the DV7t is every bit as crisp and bright (perhaps even a touch brighter and crisper) and is very, very pleasant to work with.  The keyboard is well laid-out and the keys are what touch-typists like myself look for.  The touchpad is about as good as pads of this type get, and it has a hardware off-switch by tapping rapidly on a designated part of the pad.  So if you are using an external mouse, like I do, you can deactivate the touchpad without having to deal with layers of Windows menus.One nice feature that the touchpad has is the ability to \"pinch\" the screen so that it is magnified less or more.  This is a very convenient feature for those of us who wear reading glasses.  If a given website uses too-small type, on this computer the user can \"pinch\" the touchpad causing the size of the type (i.e. the magnification of the web page) to increase to any desired amount.  I find myself using this feature often.The Blu-Ray disk drive works perfectly and the picture is incredible.  I played several movies on it with great results.  I have not burned any Blu-Ray files yet.Performance of this computer is what you would expect: lightning-fast.  It can manipulate huge digital files with ease and perform other heavy-duty tasks better than any other computer that I personally have used.  Unfortunately most digital photography programs are still 32 bit, but when they become 64 bit this computer will be ready for them, with performance that we can only guess at.Physically, this is a beautiful machine.  The black chassis has a spectacularly nice metallic look to it that is not the fingerprint magnet of earlier HP chassis.  There are 4 USB ports (two on each side) and an HDMI port, which many users will want to use in connection with a second monitor.  Personally I would have preferred that the USB ports be on the back rather than on the side.The audio on this unit is pretty good, but the volume could be better.  Playing a Blu-Ray disk, I found myself wanting and preferring powered external speakers.The fingerprint reader is easy to use and works well.  This enables the user to scan a finger, and subsequently log into Windows with just a swipe of the finger rather than typing in a password.  Very nice.  The Hard Disk Drive indicator LED is (weirdly) on the side rather than the front, so it is not visible to the user and thus pretty useless.  Not a huge issue in the greater scheme of things.  In mitigation of this, the external headphone and speaker jacks are on the other side of the computer, rather than the front, which is a big improvement over earlier models on which these jacks were on the front, presenting the user with cumbersome cables.  Plus, this unit gives you two speaker jacks instead of one, which is nice to have.This is not a small computer.  Most users will not be toting it around for casual use like a tablet or netbook.  This one, with its 17 inch screen, is really a portable desktop computer and that is how it fits into my scheme of things.  It is really designed to be the user's main computer (it has no compromises as regards performance) with the added capability of being portable and capable of use without an AC cable for a time.  For me (I am an attorney) that means I can work with it at home or in the office, and when necessary take it to the courthouse. For this type use this computer is hard to beat.  iPads and netbooks have their own niches, and this computer is no iPad.  But there are still certain applications for which a full-powered computer is required, and the so-called demise of the personal computer will not be occurring any time soon.This is the best computer that I have thus far owned and used.  Recommended without reservation.  RJB.", "Date": "January 20, 2012"}, {"Title": "Do not buy", "Author": "steven", "ReviewID": "R1UYY49VYKCRMS", "Overall": "3.0", "Content": "The pavillion feels very cheaply made compared to previus pavillions.  It feels like a toy and like it would break if I looked at it wrong.  I picked the computer up by the bottom and the bezel and this caused the screen to crack.  HP will not cover it under warranty because they say it was \"accidental damage\".  I picked up my computer on purpose ... not accidentally.  I should have a reasonable expectation that the act of picking up the computer wouldn't break it.  I've tried on other laptops to apply enough pressure to the bezel to effect the screen and I couldn't do it.  I would not buy from HP and buy from a company with a better constructed product and better customer service.Update - HP has decided to do the right thing and fix the computer for free", "Date": "March 30, 2012"}, {"Title": "Good Laptop Overall", "Author": "Bill", "ReviewID": "RJIVME89LC0BH", "Overall": "3.0", "Content": "I ordered this laptop to do CAD work on. So far no problem opening and working with the very large Catia files I use for design. I had to mess around a little with the switchable graphics to get it to run Catia with the stand alone video card. It was trying to run it off of the built in video card. The obviously wan't cutting it. The battery life is pretty short, about 3-1/2 hours but that is expected considering the hardware this laptop has. I only have a few complaints. No back-lit keyboard, minor but slightly irritating for such an expensive laptop. HP bloatware that slows the boot time down quite a bit. The flat keyboard bezel was not snapped down all the way on the top part of the keyboard right at the center. I thought I was going to have to send the laptop back because of it but was able to snap it into place with a little prying and pushing. I guess I would say that the laptop is fast but typical of the way things are built now a days, not very refined and kind of cheap feeling. You shouldn't have to snap the keyboard in place on a brand new laptop you just spent $1,250 on. I guess if you really want build quality you could buy the similarly spec'd mac book pro and spend $3,000 for the same computer with a different OS.", "Date": "December 10, 2011"}, {"Title": "Fantastica laptot", "Author": "hrivasr", "ReviewID": "R2VPPTK3XV9SZL", "Overall": "5.0", "Content": "La mejor inversion, super rapida , calidad de sonido, imagen, y salidas de video increible.....El autocad funciona sin tiempos de espera, igual que corel, photoshop, pinnacle studio, etc.Tengo pc para muchos años...", "Date": "February 22, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0062TURJC"}}