{"Reviews": [{"Title": "Chrome OS (Software) Review", "Author": "Captain Awesome", "ReviewID": "R3AB8R9S1L7A6J", "Overall": "5.0", "Content": "I've been using one of the laptops that Google originally distributed in order to test Chrome OS. As the idea behind Chromebooks is new to some, I thought I'd focus on the operating system, though I've covered the hardware to a point.I'll try to make this in-depth without it being too technical.If you're looking for a quick idea of whether or not this is for you, jump to the bottom and read the summary.The ConceptThe premise on which Chrome OS is based is that almost everything you do when you use your computer happens in your browser, so Google have built a system that makes that experience as fast, as simple and as secure as they can. That simplicity also leads to an 8-hour battery life, which very few laptops can offer.This simpler approach means that you don't have to deal with software updates(with one exception, see below) or worry about anti-virus software.This also means all of your files and media is stored on other computers, on the internet. Some people aren't ready for that and if you're not, Chromebooks aren't for you.Applications and LimitationsAs you might imagine, just the web means no Windows, Mac or other typical software applications. Because of this, there's no CD or DVD drive in a Chromebook.Though `just the web' may sound extremely-limiting, you can do a lot in your browser; multimedia editing(including video), as well as voice and video chat is all entirely possible on a Chromebook, as is the creation and editing of documents, spreadsheets and presentations. This software is available all over the web and there's a selection of useful tools to be found in the Chrome Web Store, with free and paid solutions.That said, you can just type in a web address or search as you would normally to find a helpful website. As an example, Google, Zoho and Microsoft all offer web-based office suites, some of those are free and some paid.SetupSetting up a Chromebook is as simple as turning it on, putting in your Wi-Fi connection details and logging in.If there's a new version of the operating system(as there was when I set my machine up) it will download that before you can continue. This may seem odd, as the idea is to make updates invisible to you, but Chromebooks check for updates the first time they're run in case something in that update changes something key, like the introduction process for new users.Once the laptop has checked for updates, it reboots and you login. You're then shown how to do various things with the click-able touchpad, such as scrolling and right-clicking.SpeedAfter the first time it's turned on Chromebooks are designed to be very fast. In my experience, that means booting up in around 9 seconds from off, whether that means the power button being pressed or the lid being lifted. If you close the lid for a while but leave the machine on, it should resume instantly.SecurityWhilst not being able to install traditional software can seem restrictive, it also has a huge benefit: no more anti-virus software.Viruses are so common on Windows(and lately the Mac operating system, OS X) because the more software that's installed, the more potential vulnerabilities there are to exploit.Because the Chromebook knows what software should be installed, it can keep a copy in an encrypted area of the hard drive. Each time you turn the machine on, it checks to see if anything unathorised has changed in the software. If it has, that encrypted copy overwrites everything and any updates will be installed when you connect to the internet.No system is 100% secure, but this method(called verified boot) makes it much harder to compromise your machine.Privacy and GoogleSome users don't like the idea of being dependent on any large company for their computing needs. So, does a Chromebook make you reliant upon Google?In short, no. Whilst Google does encourage you to log in to a Chromebook with your Google account, you can log in under Guest mode. Whilst using Guest mode, nothing you do is saved on the machine, you don't need to log in to a Google service and you're free to use any web-based service you choose. Google is currently working on other login methods.However, should you choose to login using your Google account(as I do and most users ultimately will) your settings and bookmarks can be saved and synched across any other device running Chrome(which now includes Android phones running Ice Cream Sandwich - version 4.0 of Android - and above), just as they are in for the Chrome browser.Files and DevicesA key thing when using a system like this is being able to use files people email you and external hardware, just like you would on a Windows PC or a Mac.If someone emails you a picture, for instance, you can download that file and directly upload it to Picasa Web Albums, Google's photo hosting site. This is called a file handler(think of it like you would a piece of software that opens certain files in Windows) and Google has released tools for companies to do similar things with different file types. For example, Google Docs will soon be able to upload Word documents, Excel spreadsheets and Powerpoint presentations directly to your account, without needing to go to the web address of the service.I've tried various hardware with my test laptop. All have worked well.Inserting a usb thumb drive or plugging in an external hard drive will make a Chromebook scan it for files it can play(there's a built-in media player) and plugging in a camera will show you the pictures on it. I've also tried an external webcam, microphone, keyboard and mouse and my Android phone. All worked as I expected.Off-line AccessChrome OS is great when you have internet access, but what about when you don't have internet access? Many(but by no means all, yet) web sites can work off-line and then upload your game progress or document when you next connect. This functionality is coming soon(this summer, according to Google) to Gmail, Google Calendar and Google Docs. Some of the applications that currently function off-line include the NY Times, Huffington Post and Angry Birds.Hardware and PricingThose who dislike Chromebooks often bring up netbooks. A netbook is a small, cheap laptop which almost always has low-quality, slow hardware. This results in a poor experience, as they typically run Windows and because of their cheap hardware, can't provide the resources Windows needs to run at its best. On top of that, Windows can't offer the security that a Chromebook does, can't boot as quickly and very rarely will you find any laptop that run for 8 hours on a single charge.Right now, Google has only 2 partners who are making Chromebooks. That lack of competition keeps prices higher than they likely will ultimately reach.My experience with the test machine Google distributed(called the Cr-48) from a hardware perspective has been very positive; my Windows machine boots in 1 minute 22 seconds and my Cr-48 is at the login screen in just under 10 seconds. Depending upon the task, I've experienced between 8 and 10 hours of use per charge.It's similar to the machines you can buy in that it has the same quantity of memory and storage and a similar sized(though not as hi-quality, I'd imagine) screen. The major difference is that the Cr-48 has a single-core processor, whereas the official Chromebooks use a dual-core chip, making them better able to handle more intensive tasks, such as video playback.SummaryTo put it simply, Chromebooks are fantastic if you use only the web or spend almost all of your time on the web; sub-10 second boot, great security and great battery life.If you don't or don't have internet access most of the time, these aren't for you just yet.UpdateAs of May 2012, Chromebooks will soon have a very different interface, making them look more like a typical operating system. They will also soon have Google Drive support built-in, as part of the options for managing files.It should also be noted that Google's Cloud Print service(not so new) can be used to wirelessly print from a Chromebook(or any Chrome install on Windows, Mac or Linux and, eventually, Android, I imagine) to a printer.Update 2As of today, the 29th of May 2012, a new, more powerful Samsung Chromebook with 4GB of RAM has been announced, along with the Chromebox, a desktop version of the latest Chromebook, with some additional ports. Both of these devices should soon be for sale, if they're not already.Also announced today was version 19 of Chrome OS which has the radical(closer to Windows or Mac) UI design, which should make it more familiar for users of those two operating systems. Along with this, it's been announced that there will(in the coming weeks) be an off-line Google Docs editor, allowing the important functionality of a word processor to not rely on an internet connection. This certainly applies to Chromebook and Chromebox devices, but should work on any modern browser that supports the required technologies, too. This is a big deal and makes Docs(and Chrome OS) much more useful for those who are on the move a lot and worry about not always having a connection.Finally, Google Drive integration(including off-line support) is said to be released in 6 weeks, with version 20 of the operating system.With that we'll be close to a point where losing your connection for a while won't be a huge issue. Especially with there being plenty of web apps and Chrome apps out there with off-line support already.", "Date": "May 30, 2012"}, {"Title": "Hassle-free, fast and powerful", "Author": "JB", "ReviewID": "R2MIAJ347MU4G7", "Overall": "5.0", "Content": "I had an older Chromebook and the new Samsung 550 is much much better.  It is fast, simple and surprisingly powerful.  As long as you're comfortable with the Google Apps products (great word processor and spreadsheet, adequate presentation editor and capable of reading all Microsoft Office attachments) this is a perfect laptop for casual use.  The concept of everything in the cloud works great, and makes it easy to upload, view and share pictures from your camera, do your email and social networking, and do your day-to-day document editing all from one place, then pick it up and continue on a different computer if needed.  Google video chat or hangouts are better than Skype, and accommodates video conferencing with multiple parties, so ideal for families.  This will save me a ton of time acting as tech support for my parents and sister, because there is so little to know to get this laptop working.I find it interesting to read reviews about how you can get a more powerful Windows laptop for the same price.  To those reviewers: you're missing the point.  This laptop has none of the crud that is windows (with its slow boot, patches, updates and virus checkers) and simply works.  Of course, if you are into gaming, or want to do video editing you need something bigger - but that is not the target audience for the Chromebook.  For casual use (and that encompasses the majority of what most people do on a laptop) the Chromebook is perfect.", "Date": "June 6, 2012"}, {"Title": "Does not work well with Hulu and other video sites; otherwise terrific", "Author": "Jon", "ReviewID": "R1CO0MS69YRKMA", "Overall": "3.0", "Content": "Let me begin by saying that I love my chromebook.  I have a 3-month old Macbook Pro that I paid over $3K for, but I consistently pick up my chromebook instead because it is just faster at booting and shutting down, and it has AMAZING all day battery life.  If you mostly use your computer for surfing the web, and if you trust Google with your information, then there is nothing better for you than a chromebook.But there is one caveat.  Specifically, the chromebook does not work well with video sites like hulu and netflix.  The problem is best illustrated by hulu.  For example, when you watch a video on hulu there are intermittent video advertisements.  The problem with the chromebook is that it cannot recover the video feed for the video after the commercial ends.  The audio is there, but the video is not.  This occurs every single time an advertisement is played.  The only way to fix it is to refresh the browser.  This is more than a little annoying, and renders the hulu website useless.Google needs to fix this problem now.  Melissa Daniels, the honcho at Google for all things chromebook, I'm dedicating this review to you.  Please fix this problem.  Other than this one issue, the chromebook is an outstanding product that I highly recommend.**Update - 6/20/2012**I have noticed that the chromebook is frequently unable to load webpages I request.  For example, I will type in the URL for cnn and the browser will just churn and will never open the requested webpage.  After a few *minutes* of waiting I get an error message saying the browser cannot resolve the DNS for the requested webpage.  The chromebook does this even when it is connected directly by ethernet to the router. Also, this is a frequent problem that happens every single day.Hopefully Google can fix this and the other problem associated with the chromebook being useless with popular video streaming sites like hulu.  If these issues are not resolved by the time my 30 day return window approaches, I will be returning this item to amazon for a refund.**Update - 6/28/2012**My Amazon return window closes tomorrow, so, it is decision time.  Video websites like hulu still do not work well.  Lots of other people are complaining about this problem, but Google does not appear to have done anything to correct it.The network connection issue also remains a problem.  I have sat my Macbook beside my chromebook and the chromebook has dropped the network connection repeatedly when the Macbook did not.  I think this is a hardware problem inherent to the chromebook, but I am not sure.A new problem has also emerged.  Specifically, one of the chromebook's speakers has started buzzing.  I have not abused this computer whatsoever.  In fact, because websites like hulu are useless on a chromebook, I haven't used the speakers that much.  When I do use the speakers I do so responsibly.  There is no reason that the speaker should be busted when I have only had the computer for 29 days.Because of the reasons described above, this computer is going back to Amazon as defective.  I have ordered a replacement and will continue to post updates on how the replacement computer performs.So far the chromebook has been a disappointment.**Update - 3/02/2013**The chromebook is still unable to work well with Hulu and other video streaming sites.  I have found an additional problem: the chromebook is unable to stream audio from Sirius.  Why is it that Google has been unable to fix these problems after so much time is passed?", "Date": "June 17, 2012"}, {"Title": "A Fantastic Update For a Killer Concept", "Author": "Joe", "ReviewID": "R2R9CIJOPVJO8T", "Overall": "4.0", "Content": "I bought this after finding that I used my original Samsung Series 5 Chromebook more than I used any of my devices.  With the increase in specs compared to last year's machine, I was certain this would be an excellent device and my new favorite machine.Shell - Easily the most improved aspect.  It's not metal, but easily some of the best looking and feeling plastic you'll find.  The bottom has a textured brushed feel.  There is a slight wedge feel to it vs. the uniform thickness of the original series 5. There are nice bumpers on the bottom and small ones near the keyboard which keeps the screen from touching the keys.Screen - Same screen as the prior model.  Nice and bright when turned up.  Matte.  Wide viewing angle.  The top to bottom viewing angle can be bit limited.Keyboard - The chiclet layout is same as prior.  They have a bit more bounce than last time, and instead of the brushed plastic from the Series 5, these have a smoother surface.  I like it, and it's a pleasure to type on.  Very bouncy and responsive.  And as others have said there is the search button where the caps lock key is but you can change it back to caps lock function.Trackpad - Also MUCH better than before.  New gestures include the three finger swipe for moving forwards and backwards when browsing.  More responsive and accurate.  It's a bit smoother than before and feels of much higher quality.Speakers - Also greatly improved.  On the series 5 the speakers were often barely audible even at full volume.  These speakers can fill the living room with the volume turned up.  Watching shows doesn't require headphones to hear anymore.  Very happy with this upgrade.OS - With the faster processor Chrome OS moves quickly and is much smoother than before.  The new layout (which is on the older chromebook as well) is nice but I kinda liked the full screen \"only browser\" layout from before.  This moves more towards a traditional OS look, where you can dock the apps at the bottom (such as Calendar, Youtube, etc).  I'm not sure this adds much because formerly the New Tab page contained all your apps so they were all instantly available instead of the smaller selection you put at the bottom.  They have also added the Google Drive to your File Manager area, which is nice.  I highly suggest that if you want to get the full use of your Chromebook you need to make use of Google Docs and Drive.  They are working to make creating docs offline possible.  As a side note, the menus when you right click are also bigger now, which wasn't really necessary.3G - Can't judge how well this works because it isn't working at all right now.  I can't even activate it.  I called several people at Verizon and none of them even knew what a Chromebook was.  I sent a message to the Chromebook ninjas and they informed me this is a \"known issue\" that they are working with Samsung and Verizon to resolve.  I'm very nervous that this is a hardware issue as you can see that the 3G 550 isn't available for purchase anymore, which makes me think they've pulled them.  Hoping it's something they can fix with Verizon's network or with a Chrome OS update, but they really should have been able to do that by now.Another random issue is that it has trouble accessing Facebook.  I've let the ninjas know about this as well.  No issues on my Chrome browser on my Mac.  No other websites seem to be affected.So basically the two major issues are the 3G access and the Facebook loading.  Otherwise this is a great update and a wonderful device to use as a secondary machine.  THIS IS NOT TO BE USED AS A PRIMARY MACHINE.  You can't install printers or other software.  But for the same price as a tablet you get a nice large screen and a keyboard with greater functionality.  Before anyone says a tablet can do more, try turning off the network and then see how much it can do.  You can play some games and that's about it.I'll update with any information as it rolls back on the 3G issue.Update:  I meant to post this sooner.  The facebook issue is entirely resolved.  As is the 3G.  Personally if you have an android phone there are numerous free tethering apps out there at this point so you can usually get away with having the wifi only version and saving $100.  That's just one opinion so obviously it's up to you.", "Date": "June 6, 2012"}, {"Title": "An Excellent Device", "Author": "drpaul", "ReviewID": "R1A07AP2NV7KQV", "Overall": "5.0", "Content": "After immersing myself in my Chromebook the last few days, I feel like I know enough about how it works to be able to write an objective review.The thing that struck me first is how fast this computer is. You are up and running in 10 seconds from the computer being completely turned off. Browsing is fast. Navigating around the computer is fast. It is evident that speed was a big priority in the making of this device.The computer itself is quite aesthetically pleasing; I have gotten asked about it already in the few short days I have had it. It feels solidly built, and is very comfortable to hold and use. I love the keyboard, it feels good to type on. The track pad is great as well. It is large, and has a clickable button built in that is neat to use. From what I can see, the computer doesn't seem too fragile, and there isn't anything hanging off that can get snagged.As for the Operating System: Chrome OS is great, if you know what it is all about. This computer is not for the person who is set in their ways of having certain programs they use every day, such as iTunes, Photoshop, MS Office. You can not install these programs on the Chromebook. That being said, there are many applications that can take place of these programs. Google Docs is a stripped down MS Office that has the same basic functionality. There are several music apps that would be happy to let you store your music library on them. Google is constantly updating the software and bringing more functionality to Chrome OS as well.No frills, no viruses to get, minimal set-up, instant start up and shut down, and great hardware is a great experience. I highly recommend it.", "Date": "June 8, 2012"}, {"Title": "Only one major flaw...", "Author": "Laura Laramore", "ReviewID": "R2OY1UFQMMM4MM", "Overall": "4.0", "Content": "For the last six years, I've been using a Macbook that I got through work.  I love my Macbook.  Now that I'm switching jobs, I need to replace my laptop and Apple is out of my price range.  First, I tried going back to a PC.  I hated it.  Every time I opened the laptop, I had messages reminding me about software updates, antivirus updates, registration opportunities, etc.  It took 10 minutes to click out of all the reminders and options to open programs I didn't want to open.  Even after uninstalling much of the bloatware, the whole thing was too much of a hassle.  I found myself avoiding using the PC, so I took it back.I had looked at Chromebooks earlier, and I was encouraged when the next generation appeared with better reviews and even faster speeds.  I love my Chromebook.  Immediate access, responsive touchpad, comfortable keyboard, automatic updates - all as promised.  However, one thing I did not see mentioned anywhere is that Amazon Instant Video is not supported for Chrome OS.  Oh, please fix this, Google and Amazon!  I love Amazon, and I love my Chromebook.  One is peanut butter, and other is chocolate - they belong together.  I understand why Amazon wouldn't support Instant Video on rival tablets if they're promoting the Kindle Fire, but why not support Chrome OS?  You're leaving out a growing potential market.", "Date": "June 7, 2012"}, {"Title": "Pefect for kid's school work", "Author": "Home Movie Buff \"Riptide360\"", "ReviewID": "R1ASBQVEBB8Q0B", "Overall": "4.0", "Content": "Purchased the Samsung Series 5 550 3G model because it allowed 2 years free access on Verizon's 3G network.  I was amazed at how after turning it on, selecting our WiFi network and password that my kids could log right into their school's account in a matter of seconds!St Leo the Great of San Jose has all the students using chromebooks.  Each student is issued their own school email address and password.  All their school work is saved in Google docs and on Google drive (cloud based).  All their email, homework, calendar, video lessons, etc. are available.We debated between a MacBook Air, a Windows laptop or a Chromebook.  Overall I'm happy we went with the Chromebook.  There are cheaper Windows laptops out there, and some folks find the WiFi is more stable and the web browser is faster, but for our needs and to keep our kids from having to deal with administering a Windows machine it made sense to pay a premium and go with a Chromebook.Since a Chromebook is basically useless without an internet connection going with the 3G and 2 years free 100mb a month option made sense.  If you use more than 100mb a month you can buy more ($10 for an unlimited day pass).  This is useful if they are working on homework in the car or at a friend's house without WiFi access.  Your 2 year period starts once you configure it in settings (about a 15 min. registration setup - you can configure it by going to the lower right hand corner, choosing your google login icon, select settings and in Internet connection choose mobile data, activate Verizion Wireless).The coolest thing is that anyone can walk up to a Chromebook and if they have a Gmail account (or a school account that uses Google like Bellarmine or St Leo) they can log in.  Everything is stored online and the browser window leaves off right where you left it.A couple of items to point out (see product photos I uploaded):- The AC power cord to brick connector isn't flush.  Not a big deal, but it looks sloppy when you don't get a tight fit.  The power brick has a useful green LED to let you know it is plugged in.- The power tip connector to the laptop isn't flush either.  You do get an amber light on the laptop to show you it is charging, but I do wish Apple would give better licensing terms for their patented magnet power adapter  (magsafe) connection.  I can totally see this small Samsung power tip bending or sending the chromebook flying if someone trips over the power cord.- The trackpad is large and works better than previous models.  It doesn't have Apple's multi-gesture shortcuts and the scroll direction is the opposite of what I like but that can be changed in the trackpad preferences.- The keyboard doesn't have a caps lock key (they put a google search magnifier) but you can use shift+magnifier to toggle caps lock function ON/OFF.  The keyboard isn't backlighted.- The screen has a dull matte non-glass finish which is better for reading (not too many reflections).  The screen size is small at 12.1 inch LCD at WXGA 1280x768 resolution.- Video out is via the full size displayport connector.  I wish Samsung had put a HDMI connector instead.  You'll need to buy a full size displayport to VGA, DVI or HDMI connector for your video output needs.  If you use DVI or VGA you'll also need to buy an mini-jack 1/8\" standard audio cable.  Make sure to fully plug the Displayport to HDM cable into the laptop in order for it to fully connect and detect your HDMI TV.Here's a list of the video out adapters you may need to buy:Cable Matters Gold Plated Premium DisplayPort to HDMI Male to Female Cable AdapterAccell B087B-005B UltraAV DisplayPort to DVI-D Single-Link Active Adapter ATI Certified (Black)Accell UltraAV B101B-003B Display Port with VGA Active AdapterBelkin Mini-Stereo Audio Cable (12 feet)- You should take the time to learn the keyboard shortcuts for the Chrome OS.  Hit Ctrl+Alt+? to bring up a graphical map of the keyboard and all the useful shortcuts.- You may get intermittent trying to connect messages inside a Google Docs that locks you out of the document for a few seconds.  I've never noticed this when using the same google doc on a Mac or PC laptop so I'm not sure if this is a Chromebook WiFi adapter issue.  The chromebook has built in gigabit ethernet CAT 6 cable connector so that may be more stable if you run into this too.- The boot up time for a Chromebook is fast! The Chrome browser however is slower than a Chrome browser on your Mac or PC when loading pages.  Hopefully this will improve as Google learns how to optimize their Chrome OS.- Printing is a pain.  Your best bet is to buy a Goolge Cloud compatible printer.  Our HP Envy 110 printer was already Mac Airprint compatible and worked well with the Chromebook.  These new cloud based printers use an email address for your printer so technically you could just email it if all else fails.  Google Cloud Print is tied to a primary Google account that then shares the printer with other users, so be sure to set it up with your primary Google account first.  Lower left corner, select your profile icon and choose settings, choose show advance settings and select Open Google Cloud Printer.- Scanning is also a pain.  Your best bet is that same Google Cloud compatible printer will also allow you to type in your printer's TCPIP address and load a web based scanner utility that you can use to scan a photo into the Chrome browser.  You can then Control+click the image to get the option to do a save image to your Google drive.  In our case our HP envy resets it's IP address every time the router reboots so I'll need to hardcode it's IP address and then save it as a bookmark in the browser to make it easier to access.- The Goolge Chromebook comes with a built in camera for video conferencing across Google Talk and Google+ Hangouts.  You can also use Evernote to use it to capture images as a poor man scanner with OCR detection!- Battery life is awesome.  6+ hours on a full charge.- Plugging an SD card into the slot brings up a folder drive icon and you can copy whatever images you want over to Google Drive.- Kensington security lock hole makes securing your Chromebook a no brainer.  Why Apple dropped this off the MacBook Air makes no sense.  That said, a Macbooks have the Find my iPhone app that also tracks your Mac's location.  The Chromebook has no current method for tracking stolen Chromebooks (something that probably happens frequently at schools).  The good thing is that any data is encrypted on the Chromebook and that you can access all your work on any Chromebook with an Internet connection.- I wish the Chromebook had USB 3, but that said I haven't really connected any USB devices to it yet anyways!If this review helped give it a thumbs up, if not feel free to add your gripe in the comments.  Chromebooks aren't for everyone, but I'm amazed at how the challenge of having to always have an internet connection is offset by the wonderful ease of use of cloud based computing.", "Date": "October 8, 2012"}, {"Title": "My favorite computer", "Author": "Matthew C", "ReviewID": "R1WMYPE86UHZ2V", "Overall": "5.0", "Content": "I find that Google is the easiest ecosystems to become a part of. Consumers who use Google applications don't need to have an Android phone. They don't need to buy a Chromebook. They don't need a Nexus 7. They don't need to own any Google hardware to use Google products. They basically just need a web browser on any popular platform. Before I started buying Google products, I already felt immersed in the ecosystem. I used Gmail, Docs, Google Play Music, Chrome, and others. I used all of these from either a Mac computer or a Windows 7 computer. It didn't matter which operating system I had. The specifications of my system did not matter either. It always worked.The first Google product I bought was a Galaxy Nexus. All I had to do was sign into my Google account. Everything was there. My contacts were there, my email was there, my music was there, etc. I liked that. Since school was starting up again I decided to get a Chromebook. When I first opened the lid, I was amazed at the quality of the hardware for such a low price. Then it powered on. I connected it to my WiFi network, and it downloaded the updates and installed them right away. Once it restarted, I signed into my Google account and felt right at home. Once again, everything was there. No bloatware, no virus protection to install. I love it.What I mainly use it for is schoolwork and a Chrome Remote Desktop connection to my work computer. That is a must-have for anyone who is afraid of missing out on legacy windows applications. Setup takes 5 minutes. It is as fast as Microsoft's Remote Desktop Connection Client and setup is more simple (in my opinion). The computer is light, looks great, has an awesome keyboard and track-pad, and boots up in ~5 seconds. After receiving this Chromebook Series 5 550, my girlfriend could not stop using it and talking about it. I just finished ordering her one and it is coming in 2 days.I have never looked forward to using a computer as much as I look forward to using this one. I have a powerful desktop I built for 3D rendering and gaming, yet I always want to use this one instead. As of right now, this is one of the best purchases I've made this year. That's why I bought a second one. Hope this helps anyone who uses Google web products. Once again, for those people who want a more traditional experience, Chrome Remote Desktop is amazing.I recommend this product fully. I hope this review has answered any questions people have had.", "Date": "August 22, 2012"}, {"Title": "Amazing Technology!", "Author": "ArtinTampa", "ReviewID": "R2UTFSF4X6HCHL", "Overall": "5.0", "Content": "This is the first time I have ever reviewed anything.  This product far exceeds my expectations.  I am not one to use a cd drive. I have had problems with hard drives crashing and viruses wiping out all my information and pictures.  This product is refreshing since that simply cannot happen since the information/pictures are stored elsewhere.  It is unbelievably limber.  It feels exactly like a regular notebook.  There is a very small learning curve (very small).  I do not like dealing with windows or mac and all their bloatware.  Most of the features are simply not used by me.  With me, if the internet is down, the computer is off so an internet based computer is a no-brainer.  This is by far faster than any other systems I have used wether it be laptop, desktop or tablet. I experience literally no lag time at all.  It has an enormous amount of useful applications that vary from business, lifestyle, entertainment etc etc etc.  If you want a super fast computer to surf, print, email, facebook etc etc.  This is the top gun!More about the computer.  I have installed applications that are available on their app market that while on the computer, all my text messages, phone calls, etc all come through displays on my screen and I am able to respond.  I literally can turn off my phone and do all my phone calls (yes, it takes calls also through mic and speakers), text messages, google +, facebook, emails etc,etc all while on the computer surfing. The search extensions are amazing.  I now search websites with such an amazing amount of options.I am a very strong believer in this product. Honestly, by far the best computer I have ever used. When the general public finds out more about it, it will spread like wildfire.A side note.  Buy the 550 not the 5 series.  There is a MAJOR difference in performance.  The extra money is simply worth it, dont skimp!", "Date": "June 5, 2012"}, {"Title": "Chromebooks are really the way to go!", "Author": "W. Wilson \"Mobile Madness\"", "ReviewID": "R23UX6XS239EQQ", "Overall": "4.0", "Content": "I've been using a Samsung Series 5 Chromebook and truly love it.  I think many of the people that have made complaints about the Chromebook have the wrong expectations of how to use it and what they're for. Yes, there were certainly some issues with the first Series 5, like speed, but as the OS improved (and they release new updates to the OS very, very frequently), performance definitely improved.Have I fully moved away from my regular laptop/PC?...no, but I'd definitely say that it is extremely rare that I use it now.  And for the record, I have a Sony Vaio that's never given me any problems and has been a great device with a very large screen.  However, there are some things that I was looking to get away from as it relates to your traditional laptop, both Windows and Mac.Firstly, I loved the idea of having a laptop that was instantly on. In general, I always found it frustrating to wait for my Windows PC to boot up. I could often make a cup of coffee by the time Windows was fully on and ready to function.Secondly, is the removal of the need to have to install software.  When you buy a traditional laptop (Windows or Mac), you always have to add the extra costs of MS Office, anti-virus protection, etc...which in the end will run you a couple of hundred dollars more than the price of the laptop.  With Chrome, you have the full access to Google Docs (and its office counterparts) and if you also have a hotmail/msn/windows live account, you automatically have access to Microsoft's OfficeLive & Skydrive, which gives you web versions of Excel, PowerPoint, and Word that quite frankly are pretty darn close to the desktop Office version, especially if you're a general user.  The great thing about a web based system is that whether you're using Google Docs or OfficeLive, you're using the power behind their servers to power your document...so it's fast.Thirdly, I love the fact that the OS is constantly updated and that it's quite simple to do so.  You just turn the laptop on, it gives you a simple notification that there's an update available.  All of the updates (even the latest major one done in May) was extremely quick.Fourth, from a security perspective, because of the fact that everything is coming from the Google servers and the sandboxing capability of Chrome, I feel very safe with the device.Fifth, battery life is way better than a standard laptop.Quite frankly, I often reach for my Chromebook even before my tablet on many items because it's instantly on and just works.  A long while back, I moved all of the contents of my traditional laptop to a cloud-based storage and at this point, when the inevitable day comes that my laptop goes (they only last max of 3.5 to 5 years max), I can't see why I would buy another PC.If most of what you do is browser based search/surfing and your media (music, photos, etc.) are in the cloud...you have to ask yourself...do you really need to purchase another laptop and all that comes with it?  I think the fundamental question is \"what do you really use your computer for?\"...if the answer is as I described then your expectations are right and a Chromebook is for you.  I think the new enhancements of the 550 make it a much more compelling purchase for those who were holding out.", "Date": "June 5, 2012"}, {"Title": "A review by a PC gamer", "Author": "Doree Sharp", "ReviewID": "R1VYT9DGD7F058", "Overall": "5.0", "Content": "One of the main reasons I bought this device was that, while I like Windows, I don't feel as though it is an operating system for portable devices (at least Windows 7, that is.)Before considering purchasing this device, browsing through the Chrome Web Store is recommended. Due to the entire OS being based on a browser, only websites and Chrome Store apps can be used- that's it. No outside software can be installed.The device is sturdy and built solid. It is very light when compared to traditional laptops. No qualms with the touchpad after getting used to it. The decision to strip down the keyboard to the most used keys and shortcuts was smart. The screen is bright and great to look at. Since it is a matted screen and not glass, you can wipe away a stray hair or fluff without worrying about smudging. The power connection is a bit worrisome when the device is plugged in. It seems as though one rough bump could snap something, either the connection at the cable or the device. That is my only gripe with the device physically.A big draw of the device is the 7 second startup and instant resume from sleep. This is not exaggerated. It takes me longer to enter my password than it takes for the machine to boot. By remembering how speedy this machine boots, you can drastically extend the battery life to a whole day by shutting down the device when you set it down, even if it is just for a few minutes.Not having to worry at all about antivirus is a plus.If you are stuck between buying the new Series 5 550 or one of the older Chromebooks, the Acer AC700 or Series 5, I assure you that the new Series 5 550 is well worth the additional money. The upgrades massively boost the performance of the machine to give no hiccups while browsing. 1080p YouTube videos stream flawlessly, as does Netflix. In a WebGL benchmark aquarium test, the new Series 5 550 rendered 1000 fish at 30 fps while the older Series 5 struggled with one fish at 2 fps.Being a stripped down operating system, you cannot install anything to the machine. That rules out any sort of intense gaming (but really, why would you pick a laptop for that purpose?) What it can run are flash games which are plentiful on the web. I highly recommend Newgrounds for games, as the Chrome Web Store's games are more casually geared. For photo editing, I recommend Pixlr. It functions nearly the same as Paint.net.If you already own a desktop or are a casual internet user, this device is perfect. If you are looking for a laptop as your main computer and rely on a variety of software not found on the Chrome Web Store, you would be better off buying a traditional laptop.", "Date": "June 30, 2012"}, {"Title": "The future of computing is here. Go get it!", "Author": "Amazon Customer", "ReviewID": "R34FRU0VE9CTN", "Overall": "5.0", "Content": "Absolute no brainer to buy a Chromebook if one or more of the following is true:1) Already a Google apps user.2) Ready to eliminate the constant hassle of Windows/Mac maintenance, data backups, migrations, fear of crashes, etc.3) Need an additional laptop.4) Want essentially unlimited storage accessible across multiple devices.5) Have the need for speed.There are many more compelling reasons to get a Chromebook. Here's how it worked out for me. I have a 3yr old Macbook Air that was starting to get slow and get low on storage. I wanted to get a Chromebook as a 2nd laptop, but with the intent of eventually making it my primary computer. I've been a Google apps user for years and was ready to go \"all Cloud\". My primary concerns were, would it adequately handle my needs for documents, photos/video, music, printing/scanning, be secure, and fast. The answer after using it for a month is absolutely yes.Documents -Google apps with cloud storage in Google Drive is perfect for me. Pushed all existing files I need into Drive and create all new docs in Google apps. Google apps has come a long way over the last couple years and to me has far more upside than using traditional office suites like MS Office. There is limited offline access available, but I have no need for it at this time and have not tested it. Google Docs and files converted to Google Docs format don't take up storage space, so if you use it you never even dent your storage cap, which is great.Photos/Video -I had been using the Google Picasa application on Mac for several years and was already syncing files to albums on web Picasa. Now I just upload files directly to Picasa web. It's still very easy. For my iPhone, I had been syncing the pics to my Mac, then uploading to Picasa web. Now I use an iPhone app called Web Albums to push those files to Picasa web, which is actually easier than what I was doing before. If you sign up for Google+, photos up to 2048 x 2048 pixels and videos up to 15 minutes don't count toward your storage, which again is great. Having photos/videos accessible on any device with Picasa web and virtually unlimited storage is a killer app for me.Music -I had approx 1500 music files that consisted of ripped mp3s and music purchased from iTunes. I had already used my Mac to push those to Google Music, so they are all available to listen to from Google Play on any device. Over the last year I've become a huge fan of Pandora and Spotify and at this point don't really need or want iTunes anymore. I'd primarily use those two services whether I had a Chromebook or not, so music on the Chromebook is a non-issue.Printing/Scanning -My older HP printer was having problems just prior to buying the Chromebook, so when I got the Chromebook it was by chance that timing was right to get a new printer as well. I got an Epson Artisan 837. Google Cloud print works flawlessy with it. No more print drivers to install. To scan docs to pdf, I have to plug a usb drive into the printer to accept the file, then plug it into the Chromebook and save it to Google Drive. I would have preferred a way to do that without using the usb drive, but it's a relatively fast and  acceptable work around that gets me what I need. A nice feature is that you can print/save any page you're viewing to a pdf in Drive. Another great free app is Hellofax for sending/receiving faxes and electronically signing documents.Security -Some people may be uneasy putting all their data in the cloud. Most people with traditional PCs probably already have much of their data tied to the web anyway. If you're worried about security, beef it up using Google's 2-step verification. It's easy to implement and should put your mind at ease. I was using it before I had the Chromebook and continue to use it. One feature I really like is the user profiles and guest access. You log in with your Google id/password and your profile appears with all its apps, history, bookmarks, etc. If you want to let a kid or guest use your Chromebook they can use the guest profile and don't need a password to log on. They don't get access to your data and can't accidentally mess it up, and their browsing history, cookies, etc are all wiped when they log off. Best situation for both parties. One could argue that having your data in the cloud (properly secured) is actually far more secure than having it reside in local files on a traditional laptop. If my Chromebook is lost or stolen, there are no files on it to steal, and even if they had my password I can sever its access immediately from another device using 2-step verification.Speed -Using the Chromebook will quickly make you realize how much time you waste booting up and powering down traditional PCs. It is ridiculous how much faster the Chromebook does that process. Web pages load and videos run as fast or faster than any traditional PC. The webcam runs well and battery time is more than sufficient. The nice thing about Chrome OS, Google apps, and many other available web apps, is that they automatically get exponentially better over time, and don't cost anything for that extra value add. Something that is really impossible to achieve with traditional PCs and software.If Google could market like Apple, Chromebooks would be everywhere. For me it's a fantastic device. I'd highly recommend it to any person or business.", "Date": "July 21, 2012"}, {"Title": "First impressions of the Chromebook", "Author": "Kyle Tolle", "ReviewID": "R2X2N08I08F99E", "Overall": "4.0", "Content": "When I first read about the Chromebook being a computer wrapped around a browser, so to speak, I thought it was pretty much a novelty and not much else.  Now that I'm an owner of a Chromebook, I can see a true appeal here for its straightforward functionality as a true web surfing machine that performs very well in that regard, in my opinion.  With that in mind, I'll lay out my observations, thus far, in what I've seen from the Chromebook.Initial boot up - Chromebook booted up in 16 seconds from right out of the box.  Additional setup time was approximately 15 minutes until I was connected to my home Wi-Fi and surfing the internet.  This included reading directions and looking at a few tutorials.  Following this, it has booted up for me in about 10 seconds each time I turn it on and it comes out of sleep mode in 2 seconds.  Nice.Battery Life - on my first initial battery charge, I got about 5 hours and 45 minutes battery time and that was surfing many different web pages, playing a couple of Facebook games and watching sporadic but limited video on a few different applications.  Not bad.Keyboard - nice layout of keys with good spacing and nice response.  There isn't a delete key and function keys above the keyboard are replaced with volume controls, screen brightness adjustments, and keys for web pages such as forward and back between tabs, reload, and a full screen/minimize screen button.Desktop look - application icons are located on the bottom toolbar (called the \"launcher\") and can be pinned or unpinned from there.  You can also switch between applications by clicking on the icons on the launcher.  Clicking on the apps icon on the launcher populates all your currently saved applications to the desktop and you can choose what to open from there also, if you prefer.Screen display -  images are sharp and bright.  Brightness can be adjusted by keys (above the keyboard) or by clicking the `status' area in the lower right hand corner of the screen.  Here you can adjust the time and date, screen brightness, internet connections, shut down, sign out, lock the device, and access the `settings and help' menu.  Video playback looked really nice when I visited YouTube, Netflix, and HULU.  There wasn't any stuttering or buffering problems anywhere.Sound Quality - I was surprised that the volume was considerably louder than what I was expecting.  I'd read a review somewhere else on the Chromebook stating the sound was terrible.  Naturally I'm pleased that the sound is good on my machine.  It is distinct and generally crisp.  Keep in mind though, for some reason, the volume doesn't even become noticeable until you adjust it to the 75% point.  So, between 75% and 100%, that is your adjustment levels.  A little strange but otherwise fine.  I tried headphones too while using the Google Play Music application and the sound was very nice, in my opinion.Touchpad - the touchpad was responsive and worked well although you have to use two fingers to simulate a right-click and for scrolling.  I'm a fan of wireless mice and if that is your preference, rest assured that when you plug in the USB transmitter for the mouse, it works immediately and problem free on the Chromebook from what I've experienced.  Although I would have preferred it, I haven't found a way to turn off the touchpad while I'm using my wireless mouse.  Luckily, when I type, the touchpad isn't in the way so that there isn't any inadvertent cursor movement.  I had this problem on a previous laptop where I couldn't deactivate the touchpad and it was irritating.Size and weight - the Chromebook is light in my opinion especially compared to a seven pound HP laptop that I also tote around from time to time.  The Chromebook is compact and has a nice appearance and feel to it.As far as the applications go, I like offerings such as Google Play Music (it transferred all my iTunes music over to Google and it is all stored on the cloud server and uses no memory on the Chromebook), Google Docs is a nice alternative to Microsoft Word and has nice features, and the Google Web Store has hundreds of appealing apps to choose from.  You could spend a couple of hours, if you're so inclined, just looking at all there is to offer there.  All the websites I have visited up to this point and applications I have launched have all started in 3 to 5 seconds and the device itself is very fast.Regarding the appeal of a Chromebook when there is no Internet connection, well, that's a tough subject to tackle.  For me, I have a Wi-Fi hotspot on my smartphone so I can get a connection in many different locations but for those that can't, I'm not sure how appealing that will be to have a laptop with possibly really limited functionality at that point.  I can use the Kindle Cloud Reader while offline which is good, and a couple of other things, but not much else and this is why I'll be relying on my HP laptop when I'm not able to use the Chromebook with an internet connection.Lastly, when it comes to the pricetag, I will admit that paying over 500 dollars for a Chromebook, whose large degree of functionality is based primarily on having internet access, can be a questionable expense for many.  Hopefully the price will come down in the future and sooner rather than later.All in all, I am personally pleased with my purchase of the Chromebook, so far, and like what it has to offer.  If a device like this appeals to others out there and is affordable to them, I would certainly recommend the Chromebook to others with that in mind.", "Date": "June 15, 2012"}, {"Title": "What was good is now GREAT", "Author": "Nicholas Holland", "ReviewID": "R28WJMWQCZGWR9", "Overall": "5.0", "Content": "If you need a workhorse family computer, you can't beat this. We have a multi-person household and as the \"IT Guy\", its hard to keep everything in working order. The Chomebook eliminates this concern because everyone gets their own login and the machine is virtually indestructible.  Zero maintenance, zero worry.Those that compare this to a netbook don't really understand what a Chromebook is all about - especially when the vast majority of people ONLY need the internet. One guy got an attitude with me saying \"Oh yeah, what happens when it doesn't have internet?\" I said... \"its useless\". He said... \"HAHA.. SEE!!!??\"  I then asked him what his wife would do on their computer if it didn't have internet... I enjoyed as the slow realization poured down his face :)As for the new Chromebook, it solves the main complaint related to the previous model... its now FAST.", "Date": "July 2, 2012"}, {"Title": "Sheer Bliss!!!!", "Author": "Tiffster", "ReviewID": "R26I0XJH98Y1E1", "Overall": "5.0", "Content": "Just got my Chromebook delivered yesterday. My first impression was that I didn't like the way the buttons looked (kinda cheap). However, the exterior does look really nice. I'm using this for school and had done a lot of research on it before. I love the idea of having apps at my fingertips (downloaded netflix, budget application, facebook etc.) You can customize the app bar at the bottom, which with one click brings me to my favorite websites. Its light and small enough to fits easily in my backpack and the battery life is amazing! Google Docs takes a little getting used to but works fine to import/export/create any documents. It boots up very fast which I love and the processor can handle my workload. The screen resolution is pretty good and on the homescreen you only have your wallpaper. To access all your apps there is a icon at the bottom, so the home screen is never cluttered. All in all, it's some pretty user friendly software and I am extremely happy with my purchase.", "Date": "June 8, 2012"}, {"Title": "Exactly what I hoped it would be", "Author": "bozzle", "ReviewID": "RLM2DGEUR2EO5", "Overall": "5.0", "Content": "I've had the Chromebook 550 for a few days now, and I'm very happy overall with it.  I've only ever used Windows PCs, but realized that 99% of my computer time was spent in a browser.  A majority of my online experience involves a Google product anyway, so I wasn't worried about anything other than the hardware.  I skipped the first generation Chromebooks after reading about the poor performance of the Atom processors, but jumped at this iteration literally minutes after it was available.  Could I truly transition to a Chromebook as my primary computer?So far, I think the answer is yes.  Browsing the web on the Samsung 550 is fast.  It's comparable to my Windows 7 laptop with an Intel Core i5 processor.  Every webpage I've opened loads in full quickly and without a hitch.Setup is a breeze (all you need is your google account and your wifi password), and I had all my preferences in terms of interface and security set up in roughly 15 minutes.  The mouse takes some getting used to, but there's a quick tutorial and now I see that the mouse controls are far superior than anything I've ever used.The build quality is decent.  It's very lightweight and looks sleek.  The matte display is great and the keyboard is very easy to type on.  Two very minor things: (a) when closed, the bottom sticks out a millimeter more than the lid, so it's a bit difficult to open the lid all the way with one hand; and (b) there is a thin plastic horizontal line that runs along the bottom facing you that sticks out - maybe not sharp enough to do any damage, but it's still annoying.As for Chrome OS, I'm so relieved not to have to deal with bloatware/software or managing processes.  Avoiding that was a huge factor in my decision to ditch my PC.The only thing other than web browsing that I use my computer for is storing my music and photos.  16 GB of internal storage seemed like a lot, but apparently my music and photo collection exceeds that, so I'll have to use an external hard drive.  The File Manager is okay... everything on the internal drive starts on a folder called \"downloads\", and then you can create as many folders as you wish as subfolders.  The music player is simple, maybe too simple, but it's nice that I haven't had playback issues.So yeah, I'm really happy with this as my primary computer.  I was basically only using the browser on my Windows laptop, so the Chromebook 550 is perfect.", "Date": "June 7, 2012"}, {"Title": "excellent improvement over first generation of Chromebooks", "Author": "Gordon Conaway", "ReviewID": "R2O93S86NHA4AA", "Overall": "5.0", "Content": "I jumped onto the Chromebook bandwagon with the first device available at retail last summer, the Acer AC700. Since then it has been a rocky road with Chrome but with big improvements. I decided to purchase this Samsung 5 550 this summer and have had it in my possession for the last few days. The $50 Amazon coupon available as of this review was the final enticement for me to buy, I love those Amazon clippings. So anyway my reference point is someone upgrading from the Acer.The Acer has improved a lot with steady upgrades to the Chrome OS over the last year. Whereas it was extremely buggy at first, now it works great. However I could not be more impressed with the vast improvement with this Samsung released in May. It represents the next generation of Chromebook, and I believe the one that really makes Chrome a viable alternative to Mac or PC in terms of everyday use.The improved Intel processor is a lot faster than the Acer. And you have twice as much memory, 4 GB instead of 2 GB. The memory also makes a huge difference. I have not seen the problems with video sites mentioned in other reviews. I can play two YouTube videos at the same time in HD with no problem. And while the hardware on the Acer felt cheap and pretty low-quality, the exterior design, feel, and performance of this computer all hold up as high quality after a few days of use. The screen and keyboard on this computer are also a major improvement over the Acer. Although this screen is supposedly only a half inch larger, it feels like more screen space than that. The Acer felt slightly cramped even for a netbook. I use a 27\" display on my desktop but this 12.1\" screen feels just as comfortable for checking e-mail, watching video, or other such functions as that setup. It really has the feel of a high-end laptop that costs several times more, but without all the additional equipment.If you are like me and mostly use the internet while sitting at Starbucks (as I am now), doing office work, or reading the news on your computer, this is for you. Yes I still have a MacBook Pro at home which I use as a desktop, the other chromebook, and a few other devices. But this is my go-to. It is incredibly lightweight and starts in under ten seconds. There is no need to mess around with the setup, it just works out of the box and remembers your settings from other computers once you log in.You still need a conventional Mac or PC in my opinion for certain activities, for instance I still use Excel on my Mac. Google Docs while steadily getting better is still not quite in parity with the Microsoft Office suite in terms of finish. In comparison, buying this product is your entire expense. Buying a PC you have to buy the operating system if you ever want to upgrade and additional software; all that comes for free with the Chromebook and updates for free for life, automatically. Other intensive functions still reserved for the conventional computer are: iTunes, editing video, reformatting drives, and playing certain games. The cloud-based third-party Google Drive apps promoted by Google have not reached the complexity of their hard drive brethren, but they're getting there.I have no doubt that this kind of cloud platform will be the norm for the majority of casual computer users in 5 to 10 years. There is no longer any need for the extra hardware and software the comes in a conventional computer.", "Date": "August 13, 2012"}, {"Title": "LOVE IT!", "Author": "Alan", "ReviewID": "R1U0WM72WZ884L", "Overall": "5.0", "Content": "Ok, so first thing is first, no this is not a full fledged pc or mac, but that's not why you buy one of these!  I have my work PC and it does all the boring stuff, but for all the personal things in life, the chromebook is great!  it boots super fast, and so far has run really well for me.  Unlike the iPad i also have, it has a keyboard and all the ports i need, a keyboard and connects to a TV.  Moreover it doesn't only play things off the iTunes store, so i can buy my media from other places that will stream on my device, my xbox and other toys.  Plus, for personal use, the switch to the cloud was not a big deal.  I do most my personal computing online anyhow, and don't have to pay for antivirus, and if i really need word, i have my work computer, but for the most part, google docs does just fine.Downside, its not a full fledged pc (?) but if that is what you are looking for, and really need that, then you are looking at the wrong place.  If, however, you want a small, portable computer, that acts as a great portal to the internet and a move towards cloud computing this is your guy.  Honestly, my brother gets a little jealous of the chromebook over his pc because of the super quick boot time.Netflix and Hulu and amazon prime video have all worked great for me, so i don't know what the other complaints were about.all in all, i really recommend one of these if you want something fast with a keyboard, and don't really need a lot of other software, which lets face it, is kind of the way the world is going, where everything can really be done cloud based.", "Date": "July 17, 2012"}, {"Title": "Game changer", "Author": "tarheelalum", "ReviewID": "R9A38EW54733C", "Overall": "4.0", "Content": "I'm a pretty tech savy guy who enjoys trying out the latest and greatest products from the world's leading tech companies. I have more than my fair share of Apple, Samsung, Google, and Microsoft products. Because of this it takes a lot to impress me. Well, I think Google is on to something here. You get the near instantaneous reaction time of a tablet, the utility of a keyboard and screen that holds itself upright, AND a full blown Chrome browser, all without the performance penalty of a \"heavy\" OS. Don't get me wrong, I like Windows and even OSX to an extent, but combine either of those with sub-$500 hardware and you get a machine that moves at the pace of my grandpa. I have an iPad that is gorgeous and fun and a Nexus 7 that is slightly less gorgeous but more portable and equally fun but neither of these enable me to efficiently consume web content with their touch screens, mobile browsers, and app-centric designs. They're just too slow compared to my regular desktop experience. In contrast, everything about the Samsung Series 5 500 Chromebook is fast. The hardware is good considering the price point (just don't expect Series 9 quality here), and the user experience is great. While overall I highly recommend the product, it's not perfect.Some constructive criticism for Samsung:1) Improve the touchpad! The touchpad is center stage in a Chromebook and there's no reason to cheap out here. It needs to be macbook air quality guys!2) The webcam is terrible. I mean really terrible. How much would it have cost, really, to put 2.0mp camera in? I know you're making a profit margin on this (probably even more than most of your tablets) so give up a little and make an exceptional product rather than a good one.3) While the battery life is respectable compared to Windows and OSX notebooks, this is a 3 pound Chromebook with a Celeron processor and extremely lightweight OS. This is a decent size notebook chassis, so you should certainly be able to fit a higher capacity battery so I can get 10+ hours of use at full backlight brightness doing normal web browsing or even streaming YouTube on WiFi.Bottom line: I love my Chromebook. It's the most visionary piece of consumer tech in my opinion since the iPhone. The hardware is a good value for the money and I think it should appeal to a lot of consumers. Personally, though, I'd love to see a higher end option (are you listening Samsung?!). Give me a Samsung Series 9 chassis, 32 GB SSD with Samsung's own controller (so I can store some music offline to listen to when I don't have a WiFi connection), native Spotify app with offline support (here's where that 32 GB SSD comes into play), a true 8 hour battery life (as in I can stream Netflix over WiFi for a full 8 hours and make back to my charger without it dying), change the screen to Super Amoled Plus (you can maintain the current resolution if you like, Samsung), and I'll give you $999 and we can call it a day! In the mean time, I'll enjoy my current, still very good, Chromebook.***Oh, I guess I should mention Amazon did an A+ job with my order. Amazon is so efficient and professional when it comes to connecting me with products that its role is nearly transparent. If I didn't pay attention it'd be easy to mistake Amazon for a first-rate logistics company. Transactions are just like I like them: smooth as butter (not unlike Jellybean... come on Google, these names are ridiculous).Samsung Series 5 550 Chromebook (Wi-Fi)", "Date": "August 7, 2012"}, {"Title": "Better than I expected", "Author": "ViBu \"Striderhayasa\"", "ReviewID": "R29A9C56PX26SG", "Overall": "4.0", "Content": "Let me begin by saying that I've used Chrome apps on a WinPC laptop so I'm familiar with the concept of Chromebooks and cloud storage/computing. Also, these are my initial impressions of owning my own Chromebook although I've used Chromebooks before on two separate occasions. I will update this review with new information if it's relevant.Ok, now with that out of the way let us begin.The good: The Samsung Series 5 550 (referred to S550 going forward) has good build quality overall. It's a solid build that will remind some of the Samsung Galaxy S series of smartphones. The screen quality is impressive as well and actually better than a $900 Samsung laptop that I own. Key reaction is good on the keyboard causing no problems in typing long messages (like this review which I'm typing on my Chromebook) and the ChromeOS specific shortcut keys are welcome.The specification for the S550 is also good (for what the device is built for), sporting 4GBs of RAM, 720p HD screen and a Celeron dual core 1.3GHz CPU. 16GB solid state drive (SSD) is a bit skimpy but it'll do considering the amount of cloud support available.The S550 is incredibly easy to setup and the average user can be up and running in about 5 to 10 minutes. That's from taking it out of the box, powering it up and logging in, with the 10 minute time being suggested for those that are slow getting the device out of the box. Chrome OS boots incredibly fast, about 9 or 10 seconds when I powered on. Logging in with your Gmail account at the prompt will automatically make all of the Chrome apps (if any) you use readily available.Battery life is also better than the average laptop by far. I've heard 6hrs on a charge but I've also read that some users have made through a day and a half on moderate use. So far, I've been running my Chromebook pretty hard from a 100% charge and after a little over four hours, I'm down to about 70%. Battery life is definitely a plus. Keep in mind that this is from using image processing apps, combination with Google Drive and Docs, checking email, browsing, Google Voice...We're not talking high powered computing with 3D applications and video editing here.Speed. The S550 performs well for every task I've thrown at it thus far. Navigation is snappy with only minor hiccups with scrolling here and there and performance has been a pleasure to experience.-----------------------------------------------------------------------------------------------------------------The Bad: Price. Samsung likes to charge a premium for their devices and this is no different. As much I like the S550 and the idea behind ChromeOS, $449 is a steep price to ask for a laptop that lacks key standards (more on that later) If Samsung priced this at $349 or even $299, then that would make more sense.The other bad item is the total lack of bluetooth support. Bluetooth has been a standard for so long there was no reason to leave it out, especially since Samsung has Bluetooth support in their Chromebox. I would like the option to keep my USB ports free if possible using a Bluetooth mouse.*I originally stated I had issues with the charge connector on my S550. This was my mistake as I didn't have it plug in completely. It took just a bit more effort to \"snap\" the connector into the port and I was worried about breaking it. Once I realized this I have no issues.But I do have to add that I bought a 64GB SDXC card for my Chromebook and was disappointed in that the card doesn't fit snuggly into the card slot. It hangs out by an inch or so. Why Samsung designed the Chromebook this way is beyond me but that is a definite negative.Chrome OS is lacking key features that may turn many off. Some features like basic customizations, lack of traditional widgets and a file manager that's not quite as robust as I'd like. (More on that below)Offline support is hit or miss depending on which apps you're running. Working offline should be a standard function supported by most if not all apps.If your suite of apps aren't offline functional then your Chromebook is pretty much useless with a data connection.-------------------------------------------------------------------------------------------------------------------XFactor: Chrome OS. Personally, I've found a lot of apps in the Chrome App store that I can and have used. Photo processing, design, music editing and creation as well as other productivity apps are well represented. In its own right, it's an impressive collection with many of these apps being free of charge. But it's finding replacements for specific WinPC or MacOX applications that may or may not be a challenge...depending on the user. For instance, there is absolutely no replacement in the Chrome App store for Indesign. There are no robust 3D modeling apps, no replacement for Premiere or AfterEfx and the one excellent music editing app I've found on Chrome (that I already use on my laptop) is Audacity. It's in the ChromeOS app store, runs in the Chrome browser but only if you have Roozz installed on a WinPC or MacOS machine. Attempting to run Audacity on an actual Chromebook results in an error message stating that Roozz isn't currently available for the platform. For those that aren't using high end applications on other platforms, you can definitely find a lot to like on the software side of a Chromebook. I was definitely surprised at what I found going through the Chrome App store even before I purchased the S550. But if you are a video editor, 3D model specialist, graphic design, or animator. The Chromebook app library is probably not mature enough for you.-----------------------------------------------------------------------------------------------------------------Customizations - There are key things missing in this area. We've grown accustomed to being able to download an image to local storage and then use it as a wallpaper on our desktops. ChromeOS doesn't allow this. Being spoiled by Android, I was also disappointed that there isn't any native Widget or Gadget support. There's a dedicated app tray but I see no way to actually make folders filled with most used apps or even a way to add apps to the launcher screen. Pinning an app to the launcher tray on the bottom left is possible but it's a weak alternative. What are we supposed to do once we have 15 or 20 apps that we like to use everyday among 150 overall? No folders means no custom folders, no custom color schemes. Android has shown us the power in customizing a device and making it your own, as opposed to running a device that looks pretty like every other user using the same hardware. I'd like to see Android level of (or close to it) of customization to accompany the better offline use.-------------------------------------------------------------------------------------------------------------------Final words (for now) I really like the S550 overall. It's a very streamlined experience that has a lot of potential...if Google can get the OS mature enough for the masses to buy in, they'd have a game changer on their hands. I purchased one at the $449 premium price because of my deepening hatred for the constant bloat of Windows and the dilemma of \"to pay for expensive software or pirate.\" Although I have a lot of experience with MacOSX professionally, I would never buy a Apple machine for personal use so that isn't an option either. This could work for me. It's just a question of how well will it work for me over time. Initially, it's been great thus far. For people on the fence that aren't tied to platform specific applications, the Chromebook may be worth a look, but understand that there are currently a lot of \"if's, ands, buts\" in the equation. Mileage may vary.", "Date": "July 10, 2012"}, {"Title": "Awesome but no 3G yet", "Author": "Amazon Customer \"PizzaPanther\"", "ReviewID": "R33MGBKYH88BLR", "Overall": "4.0", "Content": "Love the Chromebook but my Verizon 3g won't activate.  Contacted Verizon, Samsung, and Amazon no one is any help.  Also waited a couple days like someone stated in a previous review, but no luck.  So I'm returning for a replacement with 3G that hopefully works.", "Date": "June 3, 2012"}, {"Title": "Warranty trouble", "Author": "Thomas W. Trigg \"Tom Trigg\"", "ReviewID": "R2DQX14YEMPK5E", "Overall": "3.0", "Content": "Six months after receiving my Samsung Series 5 550 Chrome book, I noticed that the case had separated near the bottom left corner of the screen. I've treated the computer very well and am not aware of anything I did to cause the problem. I called Samsung, described the problem with the case, and after two hours received an RMA. I sent the computer for repairs or replacement.I received an email from the repair facility telling me that any damage to the case voided the entire Samsung warranty and offering to evaluate the computer condition for a refundable $50 fee and to repair it for an understandably unspecified fee. Samsung could have told me this before I sent the computer away, but it did not.I tried to locate a copy of the Samsung warranty but have not yet succeeded.This is a great computer, but you should be aware that the case is not substantial and that the computer is essentially sold without any warranty. In addition to the cost of the computer, you might very well have to pay for repairs based on Samsung's poor case design or manufacturing.I have rated the computer with three stars. The performance of the computer deserves five. Samsung's warranty and its response to problems caused by a poorly designed or manufactured case deserves one star at best.I had planned to buy other Samsung products, but I am rethinking that.", "Date": "February 21, 2013"}, {"Title": "Great for web app addicts", "Author": "Waysh", "ReviewID": "R3EOER267QE1Z1", "Overall": "4.0", "Content": "If you're still hesitating about buying a Chromebook, let me tell you this:1. It's not for everyone. If you don't already know how to use web apps to make your life easier, don't buy it.2. You won't be paying $450 for \"a browser\". You will be paying $450 for simplicity and a worry-free experience.3. Build your web-app working environment in your Chrome browser before you buy this. Get the wifi version, save the 3G money and get ready to pay for good quality web apps(worth the money).4. This cannot be your only computer, unless you're buying for your 50 yr old mother.Why not 5 stars:1. Battery life... are you kidding me? 2 hours less than the first generation?2. ChromeOS UI consistency issue: The concept of task bar is really confusing.3. Auto-brightness: you can't turn it off! Fix this in the update, Google!", "Date": "October 16, 2012"}, {"Title": "Exactly what I've been looking for", "Author": "dbadave", "ReviewID": "RS0BBA8KNKDE4", "Overall": "5.0", "Content": "I purchased the Samgung Series 5 550 Chromebook (WiFi) on 9/10/2012 and have been using it for a month now.  There are many excellent user reviews here on this product, on what exactly this product is, what it will do and what it will not do.  This is my experiential review and suggestions for consideration for personal use.  First, this product should not be your main Personal Computer at home but rather an additional device in the same vain as your smartphone's browser, iPod, iPad or other small form-factor devices.  My house already had most of these but I constantly found myself either sitting in front of the PC or lugging out the heavy, sluggish laptop because I needed/wanted something with a real keyboard/monitor just to do e-mail and surf the net.  Sorry tablet market, I thought you'd be great on the couch or in bed but ultimately I grow tired of always holding them up.  I was also looking to NOT get yet another machine with Microsoft or Apple OS.  The Andriod OS on my smartphone seemed to be built pretty well, perhaps Google can achieve some modicum of success with ChromeOS.  I just don't want or need more Microsoft in my tech support life or wallet-draining Apple for that matter.  This machine, this Internet Device, was exactly what I had been looking for.", "Date": "October 12, 2012"}, {"Title": "Excellent device", "Author": "SDP1228", "ReviewID": "R25MXHY6OMAVFP", "Overall": "5.0", "Content": "The Chromebook is everything i hoped it would be.First, the quality of the device is excellent. It is small and light, but solidly built at the same time. The keyboard is great, and the screen quality is superb.Second, it is a great device to use on-line. Think of it as a tablet, with a bigger screen, and an attached keyboard, but still light and portable. The Chrome OS and browser are fast and reliable, and there are plenty of apps to do what you need to do.Third, it is becoming more and more useful as an off-live device. Google docs now work offline, and it is amazing what you can get done with them. I also run a number of other apps offline. The switch from on-line to off-line and back again in areas of spotty wifi coverage is impressive.I highly recommend this as an alternative to a tablet if you do a lot of typing and need a real keyboard.", "Date": "September 14, 2012"}, {"Title": "Great product!", "Author": "Mike", "ReviewID": "R30ND06CNLMHH7", "Overall": "4.0", "Content": "I did a lot of research before i purchased my Chromebook.  I mostly am on the computer for email, facebook, banking/paying bills, and browsing/researching things on the internet, etc.  If this is you, I think the Chromebook is an excellent choice.  Especially if you already have a google/gmail account.  And if you have already been using google chrome browser, you will be a pro.Pros:Very fast start up!Chrome browser works very quickly. Everything loads very fast.Customizable. Lots of chrome apps.I really like the thought of not having to worry about operating systems upgrades.  This will never be out of date.You can access everything on your chromebook from any pc.Battery life is phenomenal!Cons:Price.  I think to really make this successful, the price point should be closer to $300.Google should pay attention to the user interface as well.  Make it a little more polished looking.  I hate to compare it to Apple, but they have set the standard.  Don't get me wrong, i love my chromebook.  Just thinking about how to get it into more peoples hands.Do your research.  Make sure whatever programs/devices etc you use on a daily basis will work before you pickup a chromebook.  It's not the answer for everyone, but if your usual experience on your laptop is email/internet, this should definitely be considered.Lastly, i did have one issue with my initial purchase.  The spacebar started sticking after only 2 weeks.  I called Amazon, and no questions asked, they had a new chromebook out to me the very next day.  This was my first experience with Amazon and a return, and they really came through.  No issues with the replacement, and i really think i made a great decision getting the chromebook. Have had it a month now, and would not hesitate to recommend it.", "Date": "September 11, 2012"}, {"Title": "Cutting Edge - Great Device", "Author": "S1", "ReviewID": "R3KYIF173Q0LSM", "Overall": "5.0", "Content": "I have had my Samsung 550 for about a month now and I am very pleased with it.  Like many have noted the boot time is mind-blowing.  Its like turning on a light switch and the computer is ready.  Its fast, light, and powerful. Also very secure because you can only login with your google password (or as guest). I gave in to Google and now upload all my photos to Picasa and files to Google Drive for easy access- couldn't be happier.  Chrome browser has come a long way and I love how you can print to Google Drive.  I find myself using this laptop more than any computer in the house because of the speed and simplicity (and we have 3 desktops - 2 imacs and 1 windows system).  This type of experience is the future of personal computing and I expect more good things to come as Chrome OS continues to develop.You get a lot of bang for the buck for $450 in my opinion as compared to the crappy laptops out there with more memory for this price - they are loud, heavy, and sluggish.  Also, the Netbooks I messed around with at the store before I bought the Chromebook are very portable but they take a couple mins. to boot windows and you could jog around the block before you get to the desktop screen and open your browser.The Chromebook in comparison is like a breath of fresh air - almost instant boot, no virus software needed, no more incessant questions from my computer demanding I click \"OK\" or upgrade Itunes every 5 mins., and nothing useless running in the background draining the computer's resources (EVER).  Also free automatic upgrades of the Chrome operating system every month or so.", "Date": "August 5, 2012"}, {"Title": "best laptop i ever had", "Author": "sucram1217", "ReviewID": "R1CNV6V2ULOE63", "Overall": "5.0", "Content": "I was a previous windows user and then I became a mac user and I had a complete apple ecosystem for a little over three years. I became an apple fan boy but once I actually used a Chrome book for a while i fell in love with it. I have a complete ecosystem of Google now. Some people complain about the chromebooks loss of functionality once its taken offline but for me it works. There are plenty off offline chrome apps and the Os is more mature now with file management and media access. People also complain about hard drive capacity but i just purchased a GB SD which solved my problem of 60GB of media ranging from music,pictures,documents and video. You don't have to worry about system maintenance or antivirus protection. The  Chrome Os updates are free of charge and automatic...the boot,sleep and wake time are seconds the battery life is on par with my previous Mac Book Pro. So i think its a good buy i love mine. I have one small gripe i think they could have made a better connector for power cable and port seems like it wont last long. But all in all I recommend this computer for anyone.", "Date": "July 21, 2012"}, {"Title": "An incredible device. Just don't call it a computer.", "Author": "Redwan Huq", "ReviewID": "R1794SHIA4QOA2", "Overall": "5.0", "Content": "The Cr-48 prototype device was my first exposure to Chrome OS. I instantly fell in love with the idea of a minimalistic, cloud-based operating system and haven't relied on a traditional computer since (except for StarCraft). I was also ecstatic when the 1st gen Chromebooks were announced last year, but unfortunately they weren't a sufficient upgrade over the Cr-48. That's why I decided to hold out on purchasing one until I felt the hardware was \"ready\".Well now the hardware couldn't be more ripe for the picking. The biggest change in the 2nd gen model, as noted by almost every reviewer, is the  speed. Everything just flies. It boots up in 3-4 seconds and sleeps/resumes instantly. Go ahead and throw it 20 tabs while playing multiple 1080p YouTube videos, it won't stutter once. You can even play a real game like Bastion on it with no lag whatsoever. Chalk it up to Intel's brilliant Sandy Bridge architecture and 2X RAM (now 4 GB).Another major upgrade was the build quality. The keyboard is quiet and has the perfect amount of bounce. The trackpad on the Cr-48 and 1st gen models were a disaster. Thankfully, the new models' is sublime -- gesture control works like a charm as your fingers glide across the surface. Although the Chromebook is made of plastic, it's some high-quality stuff -- no creaking or bending. The hinge is also nice and stiff. Also, the palm rest area is aluminum, which is a fantastic idea. Plastic palm rests discolor over time and an all-aluminium body conducts too much heat onto your hands. Finally, the device footprint is petite, being only 0.83\" thin and weighing little over 3 lbs, almost as much as a MacBook Air.The most common complaint about the new Chromebook is the price. Detractors complain that a traditional laptop at the same price can do so much more. But that same laptop slows down over time, crashes randomly, force closes, has bloatware, requires hours to setup, takes minutes to boot, requires spyware-scanning/virus-scanning/disk-cleanups, endless patches and updates, reboot after installations, has loud fans, poor battery life...should I keep going? It's sad that this is what we've grown accustomed to in the past 30 years. Chromebooks are the first device out there that don't have the above frustrations whatsoever.Another complaint is that you can't do everything on the web. That's true...for the fraction of people who compile code, do professional video and photo-editing, are hardcore gamers, 3D modeling, etc. The point is that nowadays, the most used and in a lot of cases, the _only used_ program on your computer is the browser. And since +Google Chrome is the most popular browser on the planet, using a Chromebook is easy, natural and kinda makes sense. And the list of offline Chrome apps is ever-growing. With the new Chromebook, you're getting the most hassle-free, pleasant computing experience out there with the build quality of a $1000+ laptop _at less than half the price_. Anyways, that's enough of my pitch for Chrome OS.I really want to get my parents a Chromebook so we can finally video chat with Google+ Hangouts without fiddling with all the webcam settings. But it's also ideal for power users who use Google products since so many of them are baked in. Regardless, the new Chromebook is an awesome, forward-thinking device and in my honest opinion, the best computer out there for the majority of people. Oh and did I mention, it comes with 12 free in-flight Wi-Fi sessions?", "Date": "July 13, 2012"}, {"Title": "Great improvement over first generation of Chromebooks", "Author": "Anon", "ReviewID": "R3UZJ8OOPWT5LO", "Overall": "5.0", "Content": "I don't use the Chromebook as my primary PC, but I find it a great travel companion for week-long trips (business or leisure). It boots instantaneously and pretty much everything I need to handle on the road can be done through a web browser. It's also great for the non-computer-savvy who just need a web browser in a box.The second-generation Chromebook fixes the most annoying thing about the first batch which was the speed. You trade off some battery life for it but it seems to be a good balance.", "Date": "June 1, 2012"}, {"Title": "Bad device, terrible customer service from Samsung", "Author": "H.", "ReviewID": "R14S2I2RGYZ2ZP", "Overall": "1.0", "Content": "I only bought this to use Chrome and access Gmail and Google Drive.  For that, it has worked very well.However: it won't print through Google Cloud Print, even though the printer in question works perfectly through Google Cloud Print from other devices.  I spent hours on the phone with Google Ninjas about this, and they finally said they didn't know why it wouldn't work, but I'd just have to print from somewhere else.I've only had the Chromebook for just over 2 months.  In that time, I have been prompted to do 3 restarts for system updates.  Every time, the whole system has crashed and required me to do a full system recovery (reinstall Chrome OS).  I have never downloaded any files to the harddrive.  The machine also seems to occasionally work very slowly and I can hear it chugging away when I am engaged in minimal bandwidth activity like editing a document on Google Drive.I discussed this with the Google Chrome Ninjas and they felt this was clearly a hardware issue, likely a failing SSD drive.  I had a very difficult time using the Samsung online support site, but when I finally was able to contact a representative, they had me send it back (I had to pay for packaging).  They told me if they can't fix the problem, the best they'll do for me is give me a refurbished device even though I have only had the machine for 2 months, it's still under warranty, and I've had nothing but problems from the very beginning.Samsung received my Chromebook a week ago, but they do not have any updates.  They will only give me the number to a 3rd party repair company who tells me that any Chromebook is on hold indefinitely because they need parts from Samsung.  Samsung \"executive\" customer service says they need to put in a query as to if parts have been requested and have no information for me at this time, but call back later.  Total run-around from a company who gave me a defective model to begin with.I am a huge Google fan, and the Chromebook seems to be designed very well; but Google should get out of business with Samsung.  Do not buy THIS Chromebook.  I can't speak to the other models - hopefully they have better hardware and better customer service.", "Date": "October 7, 2012"}, {"Title": "Just Keeps Getting Better", "Author": "hdtravel", "ReviewID": "RAQVZ7Q56IPVW", "Overall": "5.0", "Content": "Here we have a nice incremental update to the Google Chromebook. It just keeps getting better.Very easy to use. Rock solid stability. No fuss, no muss.Very fast boot up time and you can just work.No need to worry about patches and updates, virus's, malware, spyware and all of that crap. Ahh.....so refreshing.Great screen that is bright and sharp, great keyboard, thin and sleek.This is just the best laptop out there.", "Date": "May 30, 2012"}, {"Title": "If you want a ChromeBook, this is a good choice.", "Author": "Bron \"Bron\"", "ReviewID": "RK4P7JHCN3YU0", "Overall": "4.0", "Content": "First, you need to understand the ChromeOS and what it's all about.  I won't cover that here except to say it's pretty nifty if you know what you want and that happens to be a secure environment for working online in \"the cloud\" (but still like to have the capability of occasional local music, videos, and such for casual viewing).  My main focus in this review is on the hardware and that is because the Samsung Series 5 550 is, currently, about the best of the lot for the price and especially so if you can find a good, used item at a lower price.  At $579, I think it's not a great value, but at around 300-350 it becomes a better deal.The 550 is well made, looks very nice, and has the best performance of any of the ChromeBooks available at the moment (excluding the new Google Pixel model which is still an unknown to me at this point[Update the Google Pixel is at least twice as fast - but also twice the cost. But it is sweet!]).  I have several of the first Acer models which I got for around $200 and I have been very happy with them.  But occasionally, they lack sufficient power (streaming HD videos, for example).  So when I had a chance to pick up one of these used at around $330, I went for it (and glad I did!).The screen is about the same, Acer's are a little better, but the color is good.  Contrast ratio is average (i.e. poor!).  Viewing angles are poor/average as usual, unfortunately, but on a small screen like this, you can get by.  The screen is quite fine for web browsing, email and such, but not so fine for movies (acceptable but not good at all if you're used to better quality displays). The speakers, however, are better than average for a small laptop like this and actually good enough for casual movie watching.  Of course, you can always use external speakers for even better sound. (Update: Speakers have pretty good stereo separation and quality when listening to music.  Not much bass or power, but a nice clean sound. Better than average.)You get the usual 2 USB 2.0 ports, an SD card slot (as others have noted, the card sticks out a bit, not a deal killer, but something to be aware of).  You get Ethernet, DisplayPort, an 3.5 mm audio out (headphones level) and so on.  Nothing special except for the 4 GB RAM which is double what you get on most ChromeBooks and a welcome bonus. Very decent keyboard and touchpad. (Update: Keyboard and touchpad are very nice, much better than average.  Two fingered scrolling is very smooth.)As I use more of these devices, I've come to really appreciate the Google sync up that automatically syncs my setup and info over multiple devices.  And, of course, the instant on/off convenience of the ChromeOS.  Acer's low cost models are still the best value, in my opinion, but if you specifically need the higher performance (many will not), this is your only choice. (And this is definitely a nicer looking rig.)All in all, a very decent unit, and the fastest CPU currently available in a ChromeBook.  (Update: Except for this: Super Google Chromebook Pixel (WIFI) Touch Screen 12.85\" 2560x1700 3:2 LCD i5-3427U 4GB DDR3 32GB SSD 3.4lbs Ultraportable)  I enjoy using it very much.(Update: Super battery life with no drain. Came back after several weeks and still had a full 90% battery which was where it was when I turned it off.  Not a small thing in my opinion. Some notebooks are notorious for draining the battery even when \"off.\"}", "Date": "March 24, 2013"}, {"Title": "Becoming a daily driver", "Author": "Jim Gribbin", "ReviewID": "R3RQWKTNXB0VU0", "Overall": "5.0", "Content": "Works very well for me. Use it pretty much daily in my Real Estate practice.I needed to go to a newer computer and as my world is pretty much on the Internet anyway, I thought I'd just go this route.It comes with a 2 year subscription to 100 GB on Google Drive, so the limited 16 GB in the device is not really an issue for me and the office tools there or more than enough for my purposes.The only issue I've had so far is that Java is not supported. This means you're not going to be able to use some common tools such as GoToMeeting.", "Date": "February 4, 2013"}, {"Title": "Perfect for our home", "Author": "youthleadergina \"CookingmamaG\"", "ReviewID": "R1XUHLXLEFXSOW", "Overall": "5.0", "Content": "My husband is a teacher and he came home with a Chromebook for us to test out all summer. His school now uses all Chromebooks for the classroom. Our kiddos also attend the same school where he teaches.After using his Chromebook all summer, I was hooked! I ordered myself one as soon as he went back to school with the Chromebook.I was pleased at how after turning it on, selecting our WiFi network and password that we were ready to roll! My kids can log right into their school's account. My 10 year old son has his own school gmail email address and password and can log into my Chromebook with it and work on his schoolwork. All his school administrated settings are saved (giving him a safe web experience at home) and he can access his google docs files, e-mail his teacher, and get his school homework assignments.With google docs and cloud based services like picmonkey, animoto, edmoto, slide rocket, prezi's, google docs, etc...we really can use this computer for almost everything. My kids can have easy access to a computer we can afford! Instead of one expensive Macbook Pro for a family of 5 to share, we can instead have several Chromebooks we can all use for school, work, and fun. No waiting in line for your turn to do homework. I set up bookmark folders in the Chrome web browser tool bar with all the kids \"approved\" websites, and no matter which Chromebook they are on, they can access \"their\" stuff. I am a fan. In an age where we are decluttering our life, the simplicity of cloud based computing is awesome.", "Date": "October 21, 2012"}, {"Title": "Can't put it down", "Author": "Firas", "ReviewID": "R14YNZ1DUH1M12", "Overall": "5.0", "Content": "Although I own a couple of traditional laptops and a netbook, I have to say that I always end up picking up the Chromebook. It's light and boots almost immediately and it's just a pleasure to use. I just want to add that as an engineer, I am a power user and not a casual one.", "Date": "October 5, 2012"}, {"Title": "Exactly what a netbook should be", "Author": "Pierre Douyon", "ReviewID": "R3C2LH496AMSQH", "Overall": "5.0", "Content": "This is a fantastic product and one that I'm sure will never get as big as it deserves to be.  The Chromebook is really for people who aren't afraid to let go of native applications and that's a step that I think many people probably aren't ready to take.  However, I really believe that the inability to install native applications is one of the greatest features about the chromebook.  Once you get a netbook and start installing a bunch of applications it's going to slow down fast and you quickly lose all of the convenience of a small, speedy, laptop.  The Chromebook makes sure that you aren't even tempted to make a mistake like that, because if you're getting a netbook it should be to have fast access to the internet, not to run a million programs on a slow processor.Plus with the Remote Desktop App by Google, you can leave your PC at home, and use your Chromebook just like a PC with access to all of its applications.  I've accessed my old PC remotely to upload files to the internet that I need access to, free up memory by removing unused programs, and written substantial amounts of code.I will concede that not having an optical drive is a bit annoying, but between Google Play and Amazon Instant Video it's really not that much of a setback and the other features like instant Google Drive backup make this laptop well worth the purchase.Fast access to the internet with a web-optimized interface, Google did a great job creating a true netbook, rather than a glorified mini-laptop", "Date": "August 6, 2012"}, {"Title": "I just...don't like this", "Author": "AnitaBath", "ReviewID": "R3KI1TYA5XY5HR", "Overall": "2.0", "Content": "I read a lot of reviews before buying this, and I've had it for about 6 or 7 months now and have put off reviewing it. I knew the main thing that I would be using this for would be for internet browsing, so it seemed like a good bet. I knew that I would occasionally be needing to use it for other things, but since the bulk of it was for the internet I thought it would make up for it. Plus, it's so lightweight and fast! How can you beat that?Even though I primarily use it for the internet browser, the 1% of the time that I don't is just a huge, frustrating pain. I could go into excruciating detail, but I feel like if I want to do anything other than browse websites, I have to spend a ton of time finding the necessary work around to be able to do it. I bought this laptop and had to buy a new printer so that I could use Google Cloud print. Obnoxious, but I knew what I was getting myself into in that regard. The printer only shows up about half the time, but that's an entirely different story. If I want to print anything, I can't just print it from the browser. I have to first save it to my computer and then print, so I have to routinely clean out my files and get rid of unnecessary pdfs that I don't need anymore.The thing that spurred me to write my review was that I needed to scan a simple document. Normally you could just plug the printer/scanner into the computer and be done with it, but not now. I had to go into the back, innerworkings of my printer and go through the IP address. From there I could webscan, but it won't let me save the file. Why not? Because it doesn't work with Chrome. There's no workaround for this that I've been able to find. You can't download an IE or Firefox app. While you could argue that it's not Chrome's fault, there are tons of websites that I've found that have problems with Chrome, and you're just kind of screwed when that happens. I'm in school and there's a quiz site that has problems only with Chrome, so the instructor just told us to use a different browser if that were the case, but that doesn't exactly work for me.If this isn't your primary computer and you're ONLY using it as a lightweight, fast internet browser it's good. But even on those rare occasions when you might be needing it for a simple task that you take for granted, it's a huge pain. It took me a while to even find a good, reliable document app, and even then I still routinely have trouble. One time I was writing a paper in the web app and the app decided it needed to update right as I needed to print my paper. It wouldn't let me print without first saving the file, but it wouldn't let me save the file until I updated and then I would lose everything.Maybe I just didn't know what I was getting myself into, but I did look into it before I took the leap from regular laptop to Chromebook. I could just be guilty of not knowing exactly what that entails, but mostly I think that I just didn't expect the few times I needed it to function normally for simple tasks outside of web browsing to be so frustrating.EDIT: Ran into another problem with the word app. You know how some documents you get through email frequently have protection enabled, and it's just a simple fix of saying that you want to edit the document and enable editing? Well, in the word web app, that's not possible. It has to be opened in the actual version of Microsoft word to enable editing....except there's no way to do that on a Chromebook.Also, I've found out I can't use Skype! It's not supported. I have a friend who is having trouble setting up a Google account so we couldn't use Google Hangout, and every other option for video chatting is just through a Facebook app. Except that since Facebook uses Skype for video chats, I haven't found a way to video chat through Facebook either. So Google Hangouts is the only option available for video chats.EDIT 2: I don't mean for this review to sound overly negative or like it's a horrible device. Maybe I'm guilty of not looking into every detail of it before my purchase, but I did look at a lot of the main features of it. My purpose in this review is less to try and prove that this is some horrible product (it's not - I'm just definitely immensely frustrated with it at times), but more to compile all of the bullet points that were easy to miss or brush under the rug when I was researching it in hopes that someone else doesn't encounter some of the surprises that I did. Informed purchases and all that good stuff.", "Date": "March 1, 2013"}, {"Title": "Love It", "Author": "M. Lobdell \"mmlobdell\"", "ReviewID": "R3QS6EYGZ56CBU", "Overall": "5.0", "Content": "I purchased this for my husband who likes to surf the web, answer e-mails, and not do much else on a portable. His tablet does not run the same, does not have as big of a screen and isn't designed to surf the web like a lap top; this fills the bill for all of his needs. He did not need the disk drives or software. He loves the Chromebook; fast, easy to use, picks up wi-fi hotspots and isn't complicated for a guy for whom technology is not his thing. It is sleek and light and easy to travel with. Great purchase.Update: It is now March, and this has become my husband's \"go to\" machine for all things web related. He never misses his laptop. No issues with viruses, no mechanical problems. Still love it.", "Date": "February 5, 2013"}, {"Title": "ChruBuntu Web Developer Box", "Author": "David Parrott \"Matt\"", "ReviewID": "RDKJLURIVHT9M", "Overall": "4.0", "Content": "I spent less than five minutes in the ChromeOS, which were as many minutes as I needed to take the steps necessary to install the modification of Ubuntu, Chrubuntu, on it. ChromeOS seems well and good, and I would probably be able to spend my holidays and family reunions doing something other than virus scanning and malware removal in a world filled with ChromeBooks.I also stripped the Chrubuntu down to what's essentially a lightweight Lubuntu installation. The only GUI apps I use are Chrome, Gimp, Inkscape, Audacity, and Skype. Everything else is either in the cloud or in the terminal. The installation process was idiosyncratic, but straightforward enough, with no major problems on my first attempt.I won't dwell on performance. The specs speak for themselves. I have absolutely no complaints. I open dozens of browser tabs and image editing windows without giving a second thought to performance. The battery life is excellent. If you're a gamer or something, it probably falls short. I would be the last to know.But there are several things about this product that aren't easily captured by 'the specs'. I believe they justify the modest premium one pays for this relative to models with similar specifications.* KeyboardThis keyboard is practically a Happy Hacking keyboard adapted to a laptop. The 'shift', 'ctrl', and 'alt' keys are huge. It's much easier to program on this laptop than on my previous laptop. The keys at the top are actually useful for day-to-day browsing, which is nice.* TouchpadThe touchpad is very spacious, spacious enough that I am just as happy with it as with a wireless mouse. I had disciplined myself to using the touchpad on my previous laptop, but always felt a bit cramped. After adjusting the sensitivity and palm detection to my liking, and getting used to the simple gestures and lack of traditional buttons, I'm very happy with it.* Matte screenMy previous laptop's screen was prohibitively glossy. With this one, I don't struggle to see the screen when I'm in a room with windows.* AestheticsI do a lot of my work remotely, at coffee shops and other wi-fi hotspots. With the longer battery life and nearly instant booting, I can sit right down and get to work without worrying about booting it up or plugging it in. I think clients also perceive it as more professional and serious looking than my previous laptop, and that makes a bit of a difference in my line of work.And honestly, it's nice to have a laptop which makes the statement that I selected a computer which is simple and lean, yet well-built.* NegativesThe battery life is solid, but a couple hours short of what's advertised. This may be due to my abusing the computer's resources with programming tasks it wasn't really intended for. I haven't been able to get Hibernation to work, yet.", "Date": "November 24, 2012"}, {"Title": "Very nice!", "Author": "Charles Koeppen", "ReviewID": "R26MZK0UXZREAR", "Overall": "4.0", "Content": "First and foremost it needs to be noted that this is not a laptop. People who want to store their documents, music or video library on the machine, or run any non-web application including Skype, MS Office, LibreOffice, games, etc... will be disappointed. This takes some thought, as while I thought using web-based applications was fine, I had forgotten all about Skype. It's not that Google doesn't have a free web-based alternative, it has one called Google Video Chat. The annoying part is that whoever I chat with has to have me in one of their circles and I have to have them in mine. This wouldn't be bad if as many people were on Google+ as there are on Facebook, but right now I've got quite a few friends who I have to get them to do a lot of stuff starting with getting a gmail account just to be able to video chat with them.Also related to this not being a laptop is that the screen, while bigger than most tablets and my Acer netbook, is still tough on the eyes and I find I need to use the CTRL+'+' netbook trick to enlarge the font often.Of course, for a machine like this, the disadvantages are made up for by and sometimes caused by the advantages. This chromebook is incredibly light and thin. It boots up fast, giving it the tablet type computer \"always-on\" feel. This makes it great as a second computer for when another family member is using the main one. It's easy to check your email without having to wait for the long boot up time if you chose a laptop instead, and unlike a tablet or a phone, you can type back a reply very easily with the keyboard. And since I can not download and run applications, I was pleasantly forced to become acquainted with Google's web-based services. The fact that it doesn't run downloaded executables also means I don't have to worry about viruses.A little nitpick could be the lack of a delete key, I miss it. That would be a small part of the star I took off keeping this from being a 5-star review. The majority of that missing star would be the concept itself. There are just a few too many compromises being made.", "Date": "October 18, 2012"}, {"Title": "Perfect for going everywhere", "Author": "Frank Milton \"Frank\"", "ReviewID": "R3NT82CTGJLY88", "Overall": "5.0", "Content": "I was sold on the Chromebook one month ago when I saw some positive YouTube reviews and some guys in my Google Plus Circles had thrown out everything to gladly use their new Chromebooks full time. I received it from Amazon exactly on time. It came in kind of an ugly box, but that means nothing. The speakers are the best I have ever had on a laptop. It's a little getting used to, NOT worrying about charging the battery each hour. This thing can last the day through with lite to medium usage. Another amazing fact is Not Once have I had the desire to connect a mouse. With all my previous laptops, and especially netbooks, I could not function at all without a mouse. This thing is simply fantastic. I look forward to sitting in a Barnes N Noble Cafe and being maybe the only one working on a Chromebook. If I see anyone else using it, then will give him or her a high 5. I already have my large Chrome sticker on the lid, so it's easy to see.Most of all, this is not an Apple or Windows machine at all. Once I'm in the Chrome browser in a few seconds, the online world is whatever I want it to be! No more Apple Logo staring at me squarely as I surf and trying to download annoying updates to every program like iTunes. And no more Windows flags to install updates and restart. No worrying about anti-virus programs. That's huge. I can be online reading email or whatever in about the same time I can pick up my Nexus 7 tablet to do the same thing.I'm typing this whole review on the Chromebook this very moment and the keys are so easy and inviting to keep pressing away. I'm glad that the Function keys were totally removed. To me, that was something back in the 90's on business machines. That top row of keys on the Chromebook were replaced with practical, one-press, buttons. I like how Chromebook looks to look more different by having a search button in place of the Caps key. Although, just press 'Shift-Search' and the all caps button is activated. Hit it again, and it goes away. After all, I don't like ALL my words to be in Caps. I spent a couple days learning the keyboard shortcuts. Hint: 'Control-Alt-Question' mark keys are still a big help.My wife has to use some Windows exclusive desktop apps and she sees no need for this machine. But I love the entertainment in all Google products and love finding new things on the web. Therefore, I recommend the Samsung 5-550 Chromebook to anyone.", "Date": "September 29, 2012"}, {"Title": "Perfect for a Student", "Author": "bjthebookworm \"bj\"", "ReviewID": "R3S3MDJGIB0KCO", "Overall": "5.0", "Content": "8 years ago when I started college, I had a desktop and used it all the way through college.  When I graduated, I bought my first laptop.  It served me well for 4 years, but this year now beginning graduate school, I decided I wanted something new.  My laptop was still functioning but needs to be plugged in (no battery life) and sometimes acts up in ways that make me think it could suddenly drop dead.  I began researching the Chromebook and had a strong feeling that it was the right choice for me and bought one almost impulsively.  I haven't regretted the purchase once.  I am in my first couple weeks of grad school and find the Chromebook to be perfect for a student.  It has a quick start-up time and is fast.  I like the keyboard.  It has a long battery life (6+ hours) so I can unplug and grab it off my desk and head to class without even bringing my cord along.  Now that I've entered the passwords once, the Wifi connects quickly on its own when I open up either in the classroom or at home.  The internet is fast, and I love the simplicity of having everything on my Google drive which I can access anywhere and also feel like my files are secure.  I don't have to remember to save when I'm typing a document - it is constantly auto-saving.  There are still some things I am learning about it that are different than on my laptop/Microsoft software, but it hasn't been a real problem.  I still have my laptop but never feel the need to use it except for watching a DVD now & then - although already I do a lot of my TV watching online with Hulu, Crackle, & Amazon Instant Video -- all of which work well on the Chromebook (at first I had trouble playing Amazon videos but the wrinkles must have gotten ironed out because now it's totally fine.)  I will say that this is not the best choice for photo & video editing - I even found going through my photo files to organize/delete to be a bit of a pain.  But this is not a big deal for me personally - and isn't what Chromebook advertises as it's best feature anyway.  If the main thing you use your computer for is on the Internet, you are willing to use Google Docs for word documents, powerpoints & spreadsheets, and you like the idea of storing your files in \"the cloud\" on Google Drive - you won't have ANY complaints about the Chromebook.  I LOVE IT.", "Date": "September 14, 2012"}, {"Title": "Excellent Product", "Author": "Michael Smith \"Michael Smith\"", "ReviewID": "R2JUVFUS8H65OP", "Overall": "4.0", "Content": "I love my Chromebook!  The only reason I did not give it 5 stars is because it's just a little to pricey.  I wish Samsung would drop the price of the 3g and WiFi only models by $100 - that would be the sweet spot.  As a matter of fact the Chromebook (3G) with all the accessories cost almost as much as our Dell Inspiron R15 notebook that is fully loaded (less high end video).  A Chromebook is not a complete replacement for a Windows or Mac, but it comes pretty close these days.  For me, I simply cannot find a photo DAM that is online that meets my needs, but that's another story.  First, it takes a little getting use to using a Chromebook, but it grows on you quickly.  Press the power button and it is on and you are ready for business.  Second, it's really quiet.  My Windows notebook would at random times spin up the fans to cool the system down which produced a lot of noise and heat.  Third, it doesn't put off much heat, but I still recommend a notebook pad.  Fourth, the battery just keeps on putting out power.  Some other things I like about ChromeOS is it simply works.  No fussing with patches and antivirus.  No having to deal with locking the system down to keep the kids from doing things they shouldn't.  No real software to install.  It is what it is and it just works.  So I guess if you've ever spent a day or a weekend rebuilding a second Windows computer for the family the extra $100 becomes worth it in the long run because it pays for itself.", "Date": "September 9, 2012"}, {"Title": "Google search and find an awesome device!", "Author": "Noel", "ReviewID": "R8V1CGCZXSZOF", "Overall": "5.0", "Content": "Chromebook looks like a laptop but it's not a laptop nor is it a netbook. You can't download anything on this device, moreover you can't do much with this device unless you have an internet connection. The Chromebook is designed for optimal surfing for those who don't like tablets, touching screens, and prefer a keyboard to type on than a glass surface.Because everything about this device's software is online, there are no programmes that need to be updated, no patches that need to be downloaded, no upgrades, no nothing. It's straight up internet. Opening it up, it starts automatically, in a moment you see the Chrome logo, then the log-in page (you need a Gmail account and a live internet connection), then once logged in the Chrome browser opens and you're online. Total time from lifting the lid to browsing the web - 7 seconds. Maybe even less.That's basically what sold me on this device. The incredibly fast boot time from cold machine to browsing the net. My Vaio laptop takes around 5/6 minutes to fully load up Windows 7 and the multitude of programs that need to start up with the machine. Then there are updates that need to be downloaded and installed and the machine re-started... it's a hassle. This isn't that bad if I'm going to be using it for a while but if I just want to do a couple of things - check mail/weather/cinema listings/whatever - and then log off, it's annoying. With Chromebook you're on and off in under a minute.But it's no laptop substitute entirely - as you can't download anything, that means no iTunes. Anything downloadable is off the table. The plus side is no virus can download onto your Chromebook either. It's basically virus-proof. Also if I need to use Microsoft Word, Excel or Powerpoint, I use my laptop rather than Google Drive. Drive has versions of those programs which are excellent to use but the format is not as universal as the Microsoft Office package so formatting docs is usually necessary on my laptop.The keyboard is regular size and easy to use and the touchpad is larger than a laptop's and just as sensitive. It streams Youtube HD perfectly with no blips. The desktop is very spare and looks similar to Windows 7. On the bottom left are tabs for Chrome web browser, Gmail, Drive, YouTube, Google search, and Apps. The bottom right shows the time, battery life, internet strength and profile pic. The background can be whatever you like. And that's it. Spare but functional.Battery life is 6 hours though I've yet to test this beyond 3 hours so far. It's really light and half the size of my Vaio. As a concept, it's brilliant. Store everything online and throw out all updates and patches. Log in, start surfing straight away, turn off, pick up whenever. It's so easy. All that other stuff about maintaining a PC are taken out of the equation with Chromebook - you never have to defrag your hard-drive, do a disk cleanup, worry about malware or firewalls, buy anti-virus software, have your browsing interrupted with notices about updates being installed and your system needing to be rebooted. Chromebook looks and operates almost exactly like a laptop without the annoyances a usual laptop/desktop PC has because everything is kept in the Cloud, online. This also means that in concept it remains as fast to boot up in 3 years as it was when you first bought it. With all the extra software and data build-up over the years, my Vaio laptop went from 2/3 mins boot-time to double that in 3 years. With Chromebook, the boot-time should be 7 seconds - forever.Besides downloads, Microsoft Office, and the occasional game, I barely use my Vaio at all. The Chromebook isn't a replacement for a laptop yet it basically has done just that! It's wonderfully easy to use, really fast, light but durable, and is a perfect portal to the internet. People talk about tablets as if they are the only future for consumer electronics but with Chromebook I beg to differ - this device offers a real and viable alternative to tablets. I couldn't be happier with it.", "Date": "August 30, 2012"}, {"Title": "Samsung series 5 550", "Author": "M.N.U.", "ReviewID": "R3FK6H92UVVXJ8", "Overall": "5.0", "Content": "I bought this mainly for college. As of writing this review classes haven't started, but my first impressions are that this is a great laptop. Even though it is  sub $500, it feels sturdy and well put together. This outperforms all the other small-form laptops/ultrabooks I've tried, despite the dismal sounding specs. Its performance is on par with a macbook air with 64gb (lets be honest, your not going to install games nor huge programs on that either).I'll update this review once I get to use the Chromebook for school work.---------------------------------------------------------------------------------------------------------------------I'll start off by saying that after nearly a semester with this laptop, I am fully satisfied with my purchase. Battery life is awesome, keyboard is great, and it's super fast. My huge 18 inch laptop doesn't get much use anymore, except for the occasional game.I will say that this laptop may be over-powered ( and over-priced) for Chrome OS compared to the new Samsung Chromebook... try both out before you make a decision. Chrome OS doesn't seem to need much horsepower to get it going, so maybe the ARM chip is enough.", "Date": "August 15, 2012"}, {"Title": "Just ordered the new one because my wife monopolizes the other one", "Author": "googlefan", "ReviewID": "R11T0EV85WJ80A", "Overall": "5.0", "Content": "It's on it's way and the specs indicate that it will be even better than the first samsung that I ordered whenever the chromebook was first introduced.  Initially, I didn't use the chromebook much, but over the last year, I have completely moved to it and away from my pc laptop.  My wife has an ipad that she never uses anymore as she prefers the connectivity of the chromebook and the real keyboard and touchpad.  If Mint software or quicken would introduce more robust cloud based software ( saving data, creating reports, etc), I would have no need for pc at all.  I'm looking forward to that day.  BTW the new chrome update is great and will be much better for people who are just now moving from pc to chromebook.", "Date": "June 2, 2012"}, {"Title": "Perfect for Web life", "Author": "Benjamin Lefebvre", "ReviewID": "R2ECTD90LXZ533", "Overall": "4.0", "Content": "I use this computer everyday - it's basically replaced my tablet. It also works well for documents and other productivity - much easier to write on and edit than a tablet. I like matte screens, so this is fine, and the keyboard is great. Battery life is about 5.5 or six hours - really wish could be another hour or two longer, which is the only reason I didn't give it more than four stars.", "Date": "December 6, 2012"}, {"Title": "Amazing little laptop...but know what you're getting", "Author": "betazed", "ReviewID": "R3AGTSRGXAMNAZ", "Overall": "5.0", "Content": "This little thing really shines at being a secondary computer. If you find that you are using the browser more and more on your laptop, this is definitely something to consider. The performance is snappy, the interface is much more refined than it used to be and looks pretty nice; it almost echos Windows 7. The keyboard and trackpad are really rather nice once you get used to the gestures. I will note: mine came with a cosmetic defect from the factory (there is an \"o\" key where the \"0\" key should be) but it functions flawlessly. Please note that if you're into gaming on your laptop this is not the device for you. If you need Microsoft Office you have two options: 1) use Microsoft's cloud-based version or 2) use virtualization like InstallFree which requires payment.Please consider purchasing the new models which are considerably cheaper and only take a marginal hit to performance.EDIT: Typo \"visualization\" to \"virtualization\"", "Date": "November 25, 2012"}, {"Title": "Perfect! Good job Google and Samsung.", "Author": "Mikestuh", "ReviewID": "R2M9RQY9PA30", "Overall": "5.0", "Content": "I received my chromebook earlier today. This laptop is awesome and very fast! I am a college student and I plan on using this as my main computer as it does everything I need it to do. The display, sound quality, and battery life are all amazing! Im still getting use to the touchpad and keyboard as they are different than my old windows laptop. I havent had any problems yet and hope it stays that way. I will be back soon to give an update.Update: 11/19/2012So I received my chromebook almost 2 weeks ago now and it seems to do almost everything fine. The only problem I have ran into is with Netflix. Its hit and miss some videos seem to work fine while others dont want play. Also now that I have had this laptop for some time I have grown accustom to the touchpad and keyboard and I actually enjoy using now rather than my old keyboard and touchpad on my old laptop. Other than Netflix not being fully functional I am really glad I made this purchase and can say I am using my chromebook as my full time laptop and have gotten rid of the old windows.Update: 12/22/2012The Stable channel has been updated to 23.0.1271.110 on 12/19/2012. Some highlights of these changes are updated the 32bit Netflix plugin to 2.0.8 which fixes video corruption seen on some videos. Tested it out and Netflix seems to be fixed :)", "Date": "November 7, 2012"}, {"Title": "Chromebooks are the best!", "Author": "J. Wollam", "ReviewID": "R1IZ5VHXM9JRHC", "Overall": "5.0", "Content": "I was told when I bought the chromebook that it was just a web browser. It is much more then that. It does just about everything a normal laptop does except it does them differently. It does not have CD drive and that is because it does not download software. But what I have found is that it has an app for just about every software that you might use from Office to windows explorer. They even have apps that allow java and silverlight to work on chrome. It does almost all functions of a normal windows pc but it does do those things differently. I love my chromebook. I would much rather use it then a windows pc. It is faster, less cluttered, more secure and the battery lasts for twice as long as a normal pc. Hope this review helps clear up somethings.", "Date": "July 8, 2012"}, {"Title": "The Perfect Companion Machine", "Author": "The Hessian", "ReviewID": "RGAFTOK4GDMA8", "Overall": "5.0", "Content": "The first thing I read about chromebook's are the fact they lack to do any real computing, that they lack programs.  This is true I'm not trying to get around this but when I log on to my laptop the first thing I go to is the browser, where low and behold the first site I go to is facebook.  About 90% of what I do on my laptop can be done on the chromebook.  This past year I started taking notes in google docs.  This has allowed me to sync my documents over several devices including my android phone.  It's also nice knowing that my documents are with me wherever I go and that I don't have to worry if my computer fails me.  This device is in no way a replacement for a regular pc, but if you find yourself tide to gmail, google docs, and anything else google related this is the device for you.  Instantly when I took it out of the box it was fast to boot, fast to update, and fast to login.  All of my information and bookmarks for when I was logged into chrome on my pc was there.  Many say that why not just have a tablet with a keyboard, well I say why not just have a chromebook that can do more than the average tablet, especially run flash.  I have only run into a couple of problems so far.  First being that every now and then my wireless will just go out randomly and come back on in a couple of seconds.  So far it has only been on one of the two wireless networks I tested so it my be the routers fault.  Secondly hulu can be a bit finicky at first but I was able to watch videos with no problem.  The only downside to this machine is the fact that it cost so much.Pro's:-Fast boot time-Google account sync-flash integration-laptop experienceCon's:-pricepointOne last thing I would like to mention that got some getting used to is the fact to right click you must have two fingers on the touchpad and click.  Other than that the touchpad rivals that of the macbook air's.", "Date": "July 7, 2012"}, {"Title": "Very Happy!", "Author": "Andres Valencia \"ARVAL\"", "ReviewID": "R105GPCWYKKZOT", "Overall": "5.0", "Content": "This Chromebook is excellent!  Light and good looking too!The operating system is solid; No crashes, no bombs, just works.The available free software is very adequate and the MS Windows Office App works well.The screen resolution and color rendition are very good, same goes for the Wi-Fi connection.  I don't turn the Chromebook off, just sleeping when not in use, wakes up instantly.  No need to reboot since day one, more than a week ago.E-mail is easy for Gmail and Hotmail.  The Kindle Cloud App works well.", "Date": "June 30, 2012"}, {"Title": "my fiancee likes it too much", "Author": "geckovision", "ReviewID": "R3AJ0TOWOHSAC2", "Overall": "5.0", "Content": "I love this thing. starts up in seconds, internet is crazy fast. It actually seems to make my parents dsl faster.i've never seen a reason to have a laptop for anything besides browsing the internet. if i'm gaming it is on my phone or my desktop.I've run into the problem of my fiancee liking it too much. We got it to share, but i expected to use it more than her. I usually have to ask to use it. I could see getting another one this fall.I haven't had a single problem loading a webpage. I've noticed that it will loose connection to my router randomly. but my router is a piece of junk and i haven't noticed this at any other place ive used it.I look forward to a more robust offline experience. I'm contemplating getting a chromebox now...", "Date": "June 9, 2012"}, {"Title": "Chromebook looks great, but Verizon activation doesn't work yet", "Author": "KENT IRWIN", "ReviewID": "R1K86Z00NKI7U3", "Overall": "4.0", "Content": "The chromebook looks great, and works well on wifi.However, when I tried to activate the 3G wireless, it failed in spite of a strong connection to Verizon wireless. A call to Verizon (after an extensive game of phone tag) revealed that they did not have this chromebook in their system. They are now trying to add it in the next \"24-48 hours\". Until then, the chromebook won't get much use.Update: After 24 hours, chromebook is activated on 3G.Aside from this glitch, the chromebook is fantastic *for what it is*. I love it, but know what you are getting. You can get faster, better machines for the money, but nothing else does what the chromebook does.", "Date": "May 31, 2012"}, {"Title": "My Favorite Laptop", "Author": "Amazon Customer", "ReviewID": "R158UFMV80XQF1", "Overall": "4.0", "Content": "I got this laptop for my wife because I thought she would like it - turns out she loves it. So do I. My laptop is the Asus 53sw gaming one and is very fast. But, for web browsing the Chromebook is much preferred.Jean mostly web browsed, emailed, etc using a dual-core HP running Windows 7 and mostly Google applications - email, chrome browser, docs, etc. She transitioned to the Chromebook without a hiccup.The Chromebook is light, quiet (no fan noise) and very portable, cool (sets on lap without burning legs), fast, easily maintained with no worries about virsus, maleware, updates, maintenance, slow-downs with age, etc. Just exactly what she needs to be self sufficient (no help from me - ever. She finds that very liberating).The matte screen is sharp, bright and beautiful. It is easily usable outdoors. Videos look great on it.Sound is good and music sounds good on it. The volume could be a little greater but otherwise it sounds very good.The keyboard is very good and is preferred over my Asus.The matte touchpad is large, very responsive and easy to use. Again better than my Asus which is no slouch.The case doesn't show finger prints and is easy to clean. Browsing is top-notch and very fast and smooth. We have found no limitations to our browsing experience compared with our Windows 7 machines. In fact for browsing the Chromebook is better because it starts instantly (we don't turn it off) and there is no waiting around for it to \"wake up\".Hers has no problem with Wifi staying connected. It has been connected for 3 days now with no disconnects.I recommend this for anyone who is sick of the virsus's, maintenance problems, update aggravation of Windows 7, etc and who uses google applications such as Gmail, Chrome browser, etc.  If you like the idea of the Chromebook but don't use Google applications I recommend that you sign up for a Gmail account and try Google for awhile. If you like their applications then you are a canidate for the Chromebook. I actually prefer the Chromebook over a tablet when portability is not the ultimate goal.Update- After 20 days Chromebook developed the dreaded disconnect problem. A work around is to shutdown and cold start. Amazon will replace it but I don't have much hope that will fix it. At this point I don't recommend it at all. I would wait for the 3rd generation since neither Google nor Samsung seems able to fix the problem.Update #2 - Discovered wife's Chromebook disconnects only (when it sleeps) while on battery power. It does not ever disconnect while plugged in or while it is being used. When it disconnects either a cold start or a manual wireless reconnect fixes the problem until it disconnects again. Based on this information the problem is easily worked around in our situation. We just plug it in when not using it. Because of this flaw we dropped the rating by one star. Still useful to her even with the documented behavior.", "Date": "July 21, 2012"}, {"Title": "Very easy, very good, I wish it could run Skype", "Author": "Amazon Customer", "ReviewID": "RCPILU974L5VG", "Overall": "4.0", "Content": "It's very speedy to get on-line for a quick look at email.  Most websites browse better than in Windows, although there is an occasional exception -- I remember a budget airline website that didn't play nicely with Chrome.  The only deficiency is that I wish it could run Skype.  There's a client called IMO that lets you do Skype phone calls, but video isn't supported. Google talk works really well, just running from the browser, and the video works on that.", "Date": "May 22, 2013"}, {"Title": "I love Chromebooks!", "Author": "Mark", "ReviewID": "R3TQ820R1HEQCV", "Overall": "5.0", "Content": "I've been using windows for 20 years, every product has been a worse experience than the last.  My last windows 7 computer stopped updating, so I called microsoft and watched while 3 technicians tried to remotely fix it over 3 sessions of about 3 hours each.  The last one said to fix it I would have to back everything up, wipe out and re-install windows 7, and then re-install all my programs and files.  I just bought a chromebook instead.  NO MORE PROBLEMS!!!", "Date": "November 24, 2012"}, {"Title": "great secondary computer", "Author": "Scott B. Crosson", "ReviewID": "R58HAKSU30ZCH", "Overall": "4.0", "Content": "After a year of using a cloud-oriented Linux distro (PeppermintOS) on my personal netbook, I started looking for something with-a larger screen-faster processor (I like to stream MLB.TV full screen while cooking dinner)-highly portable, thin, no more than ~3 lbs-no DVD/CD drive-SSD only-long battery life (at least six hours)This fits the bill. It helps that my work has sprung for the business version of Google Docs, which makes this worlds better as an out-of-the-office machine than getting a \"regular\" work laptop with all of the heavy-duty, speed-sapping security our IT department is required to put on such machines. The keyboard is top notch once you adjust to it, it is customized to the OS.  I have separate logins for my personal and work Gmail accounts. Highly recommended if you can mostly adjust your work around cloud-computing.", "Date": "October 4, 2012"}, {"Title": "Perfect for me.", "Author": "mike", "ReviewID": "RH0ULC593KA9L", "Overall": "5.0", "Content": "Display - The display is 1280 x 800 and 12.1\" (It's not as small as a netbook but it's not as big as an ultraportable.), it is clearer than most other displays Ive used and has a matte finish (which I love). The viewing angles are not terrible side to side but can be 'washed out' up and down...however! not any more than other laptops in this price range. For the price, it has an above average display.Audio - Loud. Ive read reviews saying the sound is lacking, I have NO idea what they are talking about, my previous laptop had Dolby and fairly large speakers, the Chromebook is louder. I can hear it in the next room, I can hear it over doing dishes, it's unexpectedly loud.Trackpad - My favorite part! What a joy! Its smooth, huge, very fluid and a complete treat to use. The entire thing is a clickable button but you can set tap to click and 'inverted' controls so you can push and pull pages. 2 finger scroll by default, 2 finger touch is the right button and there's a setting for 3 finger tap for middle mouse click, though its experimental.Keyboard - My 2nd favorite part of the laptop, it was springy and a little loud at first but after not even a day it started to break in and quiet down considerably to the point where its almost dead silent. A joy to type on and it doesn't feel small.Battery life - Wow. All day battery life with Wifi on? The specs are accurate, it does 6 hours without a problem.Case - The entire thing is high quality plastic. The palmrest is brushed aluminum and feels amazing. The hinges are sturdy, the display bezel is top notch (and matching! : O), all very good quality. The build quality reminds me of a Macbook.Conclusions ; The Chromebook isn't for everyone. It's not for graphic designers, it's not for music producers, it's not for hardcore gamers (yet!). The Chromebook was built for people who surf the internet, listen to and watch streaming media, type documents, play casual games; it was built with the typical computer user in mind. Why pay $450 for a low end laptop, full of bloatware and an OS that sucks up half the battery life? Chromebooks remove the bloated and resource hungry OS and programs that people don't use and in return you get speed, efficiency and battery life. Moving to the cloud doesn't equate to losing features, it equates to losing problems that everyone has gotten used to. Chromebooks ARE the future, though some may find it hard saying goodbye to routine...the reward is worth it ; )", "Date": "October 2, 2012"}, {"Title": "Perfect for web-based browsing/work", "Author": "JT", "ReviewID": "R1S7ODRD5FB7WA", "Overall": "5.0", "Content": "If you go on and purchase this Chromebook thinking it will be like Windows/iOS then please refrain from buying it.  This laptop is built specifically for the web and the use of the \"cloud\".  The specs seem very meager but the fact that the system itself (chrome) is so light weight, it is very \"quick\".  Web pages load up just as fast as my gaming desktop at home.  I bought it for school use and it fits the bill perfectly.  I read my books e-books through it which is helpful.  Since i'm tied into google services, I can hook onto google drive to access files that I may need, listen to my music library through play music, remote desktop connect to my pc at home.  The possibilities are endless.  If you find yourself using a computer to browse the internet rather than using Microsoft Office then give this Chromebook a look at.  It may be limiting in certain areas but just keep in mind what you do the majority of the time and if you see that it matches, I recommend you buy it.", "Date": "September 28, 2012"}, {"Title": "Samsung Chromebook 5 550", "Author": "Martin Dubois", "ReviewID": "R1O41C5SSOSMLP", "Overall": "5.0", "Content": "Great product! Small and light, super fast, auto updates, no anti-virus required, free office application, cloud storage, off-line doc editor... Boot faster than any PC or tablet, instant on after sleep... Best for browsing the internet, email, office apps. Not for power users who need full office app or Itune.Martin", "Date": "September 15, 2012"}, {"Title": "Review", "Author": "Carl", "ReviewID": "R2QC70U8ZH9VWZ", "Overall": "5.0", "Content": "It's fast. The battery lasts a long time. You can work easily 7 hours (I do not know about playing games since I don't play).If you are already using google aps or chrome store, you will like it.On top of that, it has a nice look.", "Date": "September 12, 2012"}, {"Title": "Love it", "Author": "Cat_Pack", "ReviewID": "R1DZKLQRDW02BW", "Overall": "5.0", "Content": "I'm actually writing this review from my chromebook now. I'll admit it has taken some getting used to. There are some limitations with the chromebook, such as a lack of a cd drive, although from what i've read you can buy one to hook up if needed. I download almost everything anymore, especially programs from amazon, cheaper that way sometimes anyways. The battery life is phenomenal on this, I can take it with me to college and use it all day and even the next before I even have to think about charging it. Normally with my other toshiba laptop I can make it through a class maybe a class and a half and the battery is low. It's small too, not too small mind you. There is still plenty of room to type and rest your hands, they skimped on a number key to save space. This isnt really a big deal. They did get rid of the delete key, however backspace works just as well as i'm concerned. The touch pad is very big as well, I'm not used to having soo much space available. At times my hands do bump it and it scrolls about but that's seldom. Having access to google marketplace is nice I can get all sorts of apps that are also on my phone and tablet. The space on the chromebook is limited at 16gigs, however the google drive makes up for it with storage on the cloud. I dump alot on there and pull it out as needed or easily send it to my canon printer via wifi. Makes it very handy.It also has a card reader on the side and since it's so thin and compact I can haul it around with me to photo shoots to back up my data as needed. Just as the commercials state, this computer does seem to stay like new. I've become spoiled by the 3-5 second bootup time. I barely use my desktop anymore unless I need to do something serious photo editing. I also enjoy how it syncs seemlessly to google. Everything from my tablet to phone stay up to date and in sync with each other, I don't have to worry about looking for a file or a picture, it's always there at my fingertips. If you just need a computer for school and to connect to the net then this is the right choice for you. If you are wary about \"the cloud\", no cd drive, or expect a something to keep up with your 7 core desktop then it would be best to look elsewhere. I highly recommend this to anyone seeking a good netbook, it blows all the other's away.", "Date": "August 31, 2012"}, {"Title": "Great Netbook Replacement", "Author": "Stephen", "ReviewID": "R32MSOY3M6EZJ5", "Overall": "4.0", "Content": "I was reluctant to get on board with the always online Chromebook, but was convinced by the offering of offline Google Docs. I am glad I was finally persuaded.It is SO fast.  I can literally open it up and be searching in less time than I can use my smartphone.  If you are able to stay online most of the time, there is no reason why this couldn't be a full time replacement for personal use.If you do have problems, the user community is great and Google is constantly making updates, but you never see them, they're already there when you log in.The biggest drawback is that they definitely expect you to store everything in the cloud (there are lots of services you can use from the Chromebook).  I'd like to see more local storage space for offline use.  It's a little bit embarrassing to have your phone have more storage than your computer.If you use your computer for surfing and email almost exclusively, you'd be hard pressed to find something better.", "Date": "July 12, 2012"}, {"Title": "Everything you need in a laptop, and nothing you don't", "Author": "Ken Fose", "ReviewID": "R3CZ43YWD7Z3EZ", "Overall": "5.0", "Content": "Our computing lives are moving to the cloud, period. And no other product helps you get there more easily or elegantly.Drop dead simple, perfect size, amazing battery life! Only an owner for a few days, but I see myself riding the Chromebook wave for a long time to come. The Google ecosystem is very mature and amazingly integrated.", "Date": "July 11, 2012"}, {"Title": "Chromebook, Forever my hero.", "Author": "Brittany Peterson", "ReviewID": "R2SZIBJ0QFVR9F", "Overall": "5.0", "Content": "I love my new chromebook. This is very cheap compared to how expensive I thought it would be. It is very fast and it's easy to use, that is amazing considering I'm not very tech savvy. It connects to the internet quickly and has a long battery life. It doesn't freeze up and the sound quality is amazing for a lap top. It is light weight and big enough to watch movies on. My husband is jealous and wishes he would have bought it for himself rather than me, and he has a mac book. As with all things, it has it's flaws though.I would recommend getting it at the cheap price before it takes off and is the next big thing!", "Date": "July 8, 2012"}, {"Title": "Much improved!", "Author": "CsBn", "ReviewID": "R3JIL95GI6ZMPP", "Overall": "5.0", "Content": "I have had the new Chromebook for one month and find it much better than the original.  The speed is very good and there is no locking up of the screen.  If you use and like Chrome, you will appreciate this device.  The latest version of Chrome runs very smoothly and will only get better on this hardware.", "Date": "July 5, 2012"}, {"Title": "Perfection Embodied. What did you expect from Google+Samsung?", "Author": "doobiebuys", "ReviewID": "R22I91Q2KHTKA9", "Overall": "5.0", "Content": "Fantastic product. Has a few quirks, obviously not the same as using windows - therefore takes some getting used to, but totally worth it. Beautiful machine. You can't be disappointed here if you do the research before you buy.", "Date": "June 30, 2012"}, {"Title": "I just purchased this Great little unit from Amazon. My wife loves it.", "Author": "irisch \"irisch\"", "ReviewID": "RNTI7REJ48IVW", "Overall": "5.0", "Content": "Well, my wife is shopping today so I have been using her new Chromebook I just bought her. I got to be honest with you I really like it. The keyboard has a nice feel. The touch pad is much better then on my Dell. I plugged in my wireless mouse and it works great also. I just can't believe how fast it is. I have been setting up some apps for her and myself so I have been switching back and forth from her account and mine, and it only takes seconds.I setup Pandora Internet Radio and with my earphones plugged in it sound great. So far there is nothing I have found about this little light weight Chromebook that I don't like.Of course it is not my Ubuntu laptop, but this is one of the greatest little carrier around unit I ever used.I have been on it now surfing for a few hours and I still have over 3 hour left on the battery. My Dell would be telling me the battery is running low right about now.With the new intel process the battery life has dropped but I am getting over 6 hours on a charge.One last thing, the LCD screen is very clear and crisp. I have the brightness set about 80% and I can still see it very well in sunlight. The screen has a mat finish. My Dell has a gloss finish and it does not do well in sunlight.I feel like I made the right move getting this for my wife.By the way the shipping on this was free and I got it in 2 days.", "Date": "June 21, 2012"}, {"Title": "Excellent alternative to Mac and Windows", "Author": "Pam Van Londen", "ReviewID": "R1P78KL31FW0OZ", "Overall": "5.0", "Content": "I have defected from the Mac to Chrome. The transition has gone smoothly and I have no regrets. Tasks I have accomplished include:Managing mail with Gmail and Horde.Editing sound with TwistedWave.Editing video with WeVideo.Video chatting with WebCam Toy.Editing images with the built-in viewer and Pixlr.Editing web pages with ShiftEdit and Wordpress.Preparing my accounting with Mint and Google Spreadsheets.Reading news and bookmarking favorites (Chrome saves these so I can see them on all my Android devices).The only things I have to do on my old Mac are edit Adobe Illustrator and InDesign files and maintain/print from a FileMaker database, which are not a daily occurance.", "Date": "January 28, 2013"}, {"Title": "It's light. It's fast. It's fun.", "Author": "marcvg \"marcvg\"", "ReviewID": "RSSC6L1PPVYP0", "Overall": "5.0", "Content": "It's light. It's fast. It's fun, and it does every I need for personal computing. I take it everywhere and I use it all the time. Highly recommended.I am not lacking for computer resources. I have a Lenovo desktop at home, an HP workstation at work, and a 7 lb Dell laptop. But this Chromebook is by far my favorite device. The fast boot time and instant-on from sleep-mode enable me to pick it up and use it without a second thought.Please note: A Chromebook is a Chromebook. It is not a Windows PC. A Chromebook will not run Windows apps. It will not run Skype (as of Dec 2014), or Word, or Photoshop, or any Windows.exe. No kidding. I really mean it. And Google really means it too. A Chromebook runs Web apps in a Chrome browser. Yup. That's it. You need fast, WiFi connectivity to make it worth your while. Google Documents and Google Gmail do have an offline mode (as well as Angry Birds) So I can edit documents and play games while on a plane.Since I'm a committed user of Google apps and I'm on the web all the time, the Chromebook fits the bill for me.One more point: One reason I bought the Chromebook was because I figured that the Chromebook was the future of personal computing. Since I bought the Chromebook a few months ago, Comcast has deployed Xfinity WiFi hot spots near where I live and work. Google has come out with three new Chrome OS releases. And Samsung has come out with the $249 model, which has become a big hit on Amazon. I'm waiting to see what happens next.", "Date": "January 27, 2013"}, {"Title": "Samsung Chromebook - Cool Product", "Author": "Patricia A. Miles \"Moosette\"", "ReviewID": "RYNUYCP1XYH2W", "Overall": "4.0", "Content": "I ordered this for my husband who does not like a lot of pop ups and updates and who likes to surf the internet and use email.  It is very fast and is easy for him to use.  I really like how fast it is too.It's a great product for some reason is not marketed very much.", "Date": "September 10, 2012"}, {"Title": "It works!", "Author": "Ben Chow", "ReviewID": "RL7XODZ8NQ5F0", "Overall": "4.0", "Content": "It works as intended and is blazingly fast in boot up and shutdown. I found myself reduced in usage for my iPad and iMac at home. The one star deducted is for the awaiting improvement for the printing solution of the device. Although google has cloud print, it seems it cannot cover all files in all use case, but I am sure it will become better in the future, given the fast chrome version iteration.", "Date": "August 5, 2012"}, {"Title": "Chrome book review", "Author": "teach4u", "ReviewID": "R3YNXAC3QHYVK", "Overall": "5.0", "Content": "I have the 3G model Chromebook.  Initially I wasn't able to activate the 3G.  It was a simple problem, that had to do with the information not added into the Verizon system.  My computer was manufactured 04/12.  It took a few days to set up the3g and I use it on occasions.  I like this machine as much as my previous MacBook.  I can do a lot if what I did on the MacBook, with the exception of working offline.  I simply use another machine and save to my Google drive.  I see potentials uses for education.  Samsung Series 5 550 Chromebook (3G)", "Date": "August 2, 2012"}, {"Title": "Samsung chromebook 550...", "Author": "dtrik", "ReviewID": "R2BFCESHTZN336", "Overall": "3.0", "Content": "Well first off im impressed with the chromebook sleek and Sharp looking. Boots quick... Way quick i like that. Its 4g of ram is speedy for apps web music whatever. Its fast. Screen is bright and crisp.  I gave it 3 stars because when i connect my phone or a flash drive nothing happens and i dunno what to do or how to access them.  If i can get it to work its five stars", "Date": "June 29, 2012"}, {"Title": "Ignore the hype, though I like Google products, this is not ready for prime time", "Author": "Sachmo", "ReviewID": "R25OGTHU7Y35ZY", "Overall": "2.0", "Content": "First let me say that I was excited about this product, and really wanted to like it... So much so, that I blinded myself to a lot of the negative feedback on the web regarding lack of regular apps. I figured that 90% of the time I spend on a computer is on the internet, so who cares if occasionally there is some friction regarding desktop applications, right?Well it turns out that there are still some basic issues Google needs to work out with ChromeOS.1) Bluetooth - The chromebook 550 doesn't have native bluetooth hardware, but with a bluetooth dongle the chromebook should be able to pair to all sorts of bluetooth devices.  Unfortunately, at the time of this writing (Dec. 2012), Chrome OS only supports bluetooth for a mouse and wireless keyboard.  No audio for bluetooth speakers, no voice / headset capabilities.  For me, this is a major FAIL as the chromebook was marketed as bluetooth compatible.  Again, I'm aware it doesn't come with the native hardware, but it should work with a bluetooth dongle, and this criticism is equally true for the ARM chromebook as well that does come with the native bluetooth hardware - no audio streaming capabilities.2) Dual Display - As of the time of this writing, the chromebook doesn't support dual monitor setups... Also a major disappointment when I first tried to set this up.3) Although it was clearly advertised - and this is entirely my own fault - not having standard windows apps is more of a pain in the ass than you might imagine.  I can't connect my scanner to the laptop (something I didn't think about at the time of purchase)... Supposedly there is some google cloud printing that will work with might work with my printer, but I can almost guarantee that printing is not as simple as clicking 'print' in the top left corner of the screen as I am accustomed to.  Google Docs, while fine for READING office documents, is not quite as functional at WRITING office documents.The spreadsheet - while ok - is nowhere near as good as Excel.  Once you've learned Office, (and you still use it in the context of work, or because other people send Office docs), it really isn't worth it to relearn all of the shortcuts and tools of the google versions of Office.  This may seem like griping, but are all manners of formulas, filters, etc. in Excel that I use that I would have to relearn in Google Docs... not worth it for the time being.The other area where the standard apps are needed is for general media.  For music, no spotify, no sonos, pandora works (because its web accessible), but no bluetooth to transmit to hardware.  The display port is some strange format that requires special adapter cables to connect to HDMI / DVI /  VGA displays... Not sure why they didn't just make this with a standard display port in the first place, and again as I mentioned - no dual display mode.Many review are correct to point out that this is basically a laptop with the chrome web browser only.  That's basically the experience you get on the chromebook. On a positive note, it does feel like a web browser on steroids though.  You won't notice the under-powered Celeron processor b/c there is no background Windows bloat.  Side by side with a newer i7 laptop, I haven't noticed any actual performance differences surfing the web - and I generally tend to browse with 15+ tabs open at a time.Booting in 10 seconds is great.  I can see why many people claim in reviews that it has become their go-to laptop.  It's addictive to not have to wait to get on the internet, but the novelty wears off once you realize all of the limitations of the chromebook.Side by side with a $600 laptop, it's still very difficult to justify the purchase.For only $150 more, I can get a dual core 3rd gen i5 CPU.  6gb of ram.  500 gb hard drive (I'll give the chromebook the advantage of an SSD, but still the windows laptop has 500gb of local storage that you'd otherwise have to pay extra  for online), BLUETOOTH, dual display capabilities, the ability to use just about any program / application I feel like, AND I can still use the chrome web browser with 15+ tabs open, and store whatever I like in the cloud if I feel inclined to do so.  The only drawback I can think of to the slightly more expensive windows laptop is the boot-time, and maybe the added possibility of getting malware.I plan to return my chromebook in the near future.  All this being said, I would take a look at a chromebook again in a couple of years.  In subsequent OS releases - which are released every 6 weeks or so, and transmitted via internet - they plan to add bluetooth & dual monitor capabilities (though I'm not willing to twiddle my thumbs and wait).  I also think the google app store will fill out a bit with time.After filling in the glaring oversights, google still needs to focus on some kind of windows emulator that can interface with printers / scanners / cameras / mobile phones and other hardware.Also a real competitor to microsoft office is needed.  The Google Docs are not quite there yet, though they are ok for very basic work like taking notes during a web browsing session.  If they can nail hardware and an Office suite, they could really have a platform that people would develop software for.Until all of these gaps fill in though, its just not worth all of the work-arounds necessary to make the chromebook a serviceable laptop.  And it's hard to justify this as a '2nd' computer, when I can get a significantly improved '2nd' computer for only $150 more.Not recommended at this time.", "Date": "December 3, 2012"}, {"Title": "Great purchase", "Author": "Isaac Privitera", "ReviewID": "R35KKZSLI1C87S", "Overall": "5.0", "Content": "I bought this primarily as a travel laptop but I find myself using it all the time, more so than my far more expensive macbook. It's pretty fast and I love that I never have to update it myself. I've heard some complaints about its ability to stream video but I've had no issues with that whatsoever. For the price it's got the ability of much more expensive laptops and so long as you don't mind using web based programs and applications I think it's a pretty solid primary computer. It's exceptionally light and powers on in literally 2 seconds. Not that much more expensive than a tablet and FAR more useful.", "Date": "September 13, 2013"}, {"Title": "great device!", "Author": "Cinda Reid", "ReviewID": "R3OOUV7YEHW51A", "Overall": "5.0", "Content": "Have had it more than a year, no problems anytime or anywhere! With the Verizon connectivity has out performed the Ipad users when wi-fi not available. It's all determined for what you want it for, but for the portability, connection and ease of use it suits my needs and more. Very happy!", "Date": "July 14, 2013"}, {"Title": "Great device", "Author": "John", "ReviewID": "RTZ81IJAQVSG5", "Overall": "4.0", "Content": "This product is very nice. I thought it would be a little lighter for all the more it is. I like the speed and simplicity. I think they idea of calling the items apps, or whatever is kinda dumb. They are all just shortcuts. It just opens a new tab in the same window. There is nothing special about that. It's a bookmark. No more no less. But I do love Chrome, and the way this performs, so I do think it is an excellent product, just not as light and sexy of a device as I would expect from Samsung with a Google OS.", "Date": "May 23, 2013"}, {"Title": "Easy to use. Quiet, fast and smooth.", "Author": "J. Wong", "ReviewID": "RG9HA6Q3D0LCZ", "Overall": "4.0", "Content": "We have been using window based notebooks for years. I am not a computer geek and simply need a notebook to run my business. Chromebook runs so quietly that you can tell it's energy efficient. So far the battery hasn't drained on me on an average daily use. Well, not sure what will happen in a year. My kids love the screen size and light weight. I would highly recommend this product for people who mainly use browser to their business or personal use. The only issue is the printer. Chromebook sends your print job to Google Cloud and it comes back to initiate printing on your printer. We have experienced delays in the last week. Not sure why.", "Date": "September 26, 2012"}, {"Title": "Chrome O/S is AWESOME", "Author": "Cody", "ReviewID": "R1QOQ8M3E9RJV2", "Overall": "5.0", "Content": "I have a Chromebook and I absolutely love it. It is super fast and reliable. The new O/S does take time to get used to but you will find that you can do majority of the things on your Chromebook that you can do on your PC and Mac. The only person I would not recommend this device to is someone who needed a specific software that is not available in an online format although the Chrome app store is always growing so I would not be surprised if a lot of these softwares are soon offered as online apps. There is a reason why Google calls this the always new computer. If you are having any doubts or have any questions i created and online Google Group that I can answer any questions that you have. If you already have a Chromebook I also would like you to join this group so we can all share any cool tricks, tips, or cool Chrome apps that would be useful. Here is the link![...]", "Date": "September 25, 2012"}, {"Title": "Chrome OS Awesome", "Author": "kurt v neiswender", "ReviewID": "R6JDOI4MYS7HL", "Overall": "5.0", "Content": "I have been anticipating this product for a long time. I also have always enjoyed the easy to use Google products. When the time came for me to decide between a chrome notebook and an ipad. I chose the chrome notebook and do not regret it at all.Awesome hardware and of course software.", "Date": "September 23, 2012"}, {"Title": "Awesome Little Computer", "Author": "Jenn Tate", "ReviewID": "R165SYH9VNXK2", "Overall": "5.0", "Content": "I bought the Samsung Series 5 550 Chromebook (Wi-Fi) from Amazon a few weeks ago, and I love it! It is very lightweight and travels well, looks great, and has an impressive battery life (longer when in use than my smart phone). The only problem I have encountered had to due with its lack of Java. There has been a few hurdles there, but other than that, I would definitely recommend this computer!", "Date": "July 24, 2012"}, {"Title": "No Windows!  (At least no Microsoft ones!)", "Author": "E. Cohen", "ReviewID": "R1EF46HFM6BYQP", "Overall": "5.0", "Content": "If you're frustrated with PC software being buggy, slow, unreliable, ..., then this is what you need.I can't count how many times I've wanted to throw my PC out a window -- never had any issues with a Chromebook.I've been using a Chromebook for over a year, and this new generation is a big step up -- faster, lighter, ...Live a Microsoft-free (and more pleasant!) life -- get a Chromebook.", "Date": "May 31, 2012"}, {"Title": "Only 100MB per month? Modern sites burn thru that in a day.", "Author": "Amazon Customer \"--SJH\"", "ReviewID": "R3VX59RIPG5OON", "Overall": "4.0", "Content": "I've seen this beast in Best Buy, and wanted one.I craved it.  I have techno-greed for this machine.It's not so much needed; I have an Eee ep121 slate, a desktop, and so forth.Still, it would be an ideal solution for my Mom's use.She's in an area where wired internet is ridiculously expensive and therefore getting wifi means going elsewhere.Verizon, the provider selected by Google as of the time I write this review, might even have decent 3G in her area, though I prefer Sprint.  (Note that Verizon's been failing to keep up their side of the deal and there is no guarantee that Google will stay with them.)I would get this in a heartbeat except for one thing.  100 MB per MONTH is pretty much a slap in the face to anyone who wants to use this like a \"regular\" laptop computer, and the form factor is such that they WILL want to use it like a regular laptop computer.Even if you do nothing more than look at Facebook, view a few Youtube videos, listen to an hour of Pandora or another service -- you can easily burn through 100MB in a single day.Add to this the fact that anything you put on this machine, whether your own creation or something someone else sends you, is backed up to your \"cloud\" so it won't get lost.  This is a good thing, usually, though I would just as soon be able to have SOME things stay local. But uploading and synching is an additional overhead that eats even more precious bit-budget.So, until Google can make an arrangement with whoever, to ensure REAL broadband wireless at a price that even a retiree on a fixed budget can afford, even if it isn't free for two years, it won't meet the needs of a pretty large potential customer base.", "Date": "July 3, 2012"}, {"Title": "The BEST chromebook hands down.", "Author": "Ryantooz", "ReviewID": "R1Y74ER27BSGPZ", "Overall": "5.0", "Content": "I have used this for about 3 months now. I have used many other chromebooks that my friends have and I believe this is the one to get. The keyboard is very nice, it is of surprising quality, and although it is a little bit smaller than some, it is very easy to get used to and works excellently. The processor and ram is completely adequate for all its uses. I have 20 tabs open very often and it doesn't slow down a bit. The trackpad is where it really shines. It is very large, and just like a trackpad you would find on an apple laptop over $1000, no lie. It is seriously great. It is one of the main reasons this is the best chromebook. It allows very fast two finger scrolling, switching between tabs, forward and back in chrome history, three finger click to open in new tab. It makes the laptop feel like its worth way more than the cost. The screen is surprisingly good, even though low quality works very nicely and I don't notice it much, 720p video still looks very nice. It can get really bright too. Startup is insanely fast. The 16gb flash drive is enough, as you really don't store anything on the laptop, I use about 1 gb, I store everything in google drive. The webcam is crappy but it gets the job done for casual video chat. The dedicated buttons are where the \"f\" keys would be are very nice and useful. Battery life is pretty good, with a very solid 4 hours of use, that is enough especially when you can shutdown the computer and start it up in about 5 seconds. Overall this laptop is so fast and quality I couldn't recommend it more highly. The screen size is also very important. Many chromebooks stink because of their 11.6 inch screens, and this 12.2ish screen is much better, the small difference is way more than you think. It makes the computer usable as a primary computer, and doesn't stink to look at. The pixel is cool but way too darn expensive, so this is the perfect chromebook. I love is sooo much. My friend with a macbook air feels so stupid with his 1400 dollar computer that my chromebook is just as good as.", "Date": "December 27, 2013"}, {"Title": "Worked great for a year, then died.", "Author": "JB", "ReviewID": "RNV396PU13IFU", "Overall": "2.0", "Content": "I completely replaced my regular laptop with this, and it quickly became a daily driver for me for almost everything else (sans gaming and photoshop). I took incredible care of the Chromebook, never dropping it or leaving it out of a case when not in use.Naturally, 1 month after my 1-year warranty expired, the charging port failed. I spoke with Samsung support and they said their estimated cost would be between $200-250. A new Chromebook is $220. Seriously Samsung? I paid $500 for a laptop that lasted me a year, and is now essentially a paperweight.", "Date": "August 19, 2013"}, {"Title": "for the money a terrific choice", "Author": "S. Rome \"sterlingrome\"", "ReviewID": "RM4QKH2FX5EWU", "Overall": "5.0", "Content": "this laptop is perfect for someone who wants all the best of the internet and e-mail and being on-line without (literally)any other clutterthe machine itself is gorgeous and resembles a high-end MacBook (and that's not hyperbole - I have one)but imagine a world with no bloatware, no constant virus warnings, no useless crapsimple, easy, and fastest start up I have ever seen on any system ever", "Date": "June 10, 2013"}, {"Title": "the chrome system is superior", "Author": "Ron Sheldon", "ReviewID": "R25IYJ00ZJOFES", "Overall": "4.0", "Content": "Very fast boot up.  Everything is saved automatically.  Offline features are adequate. It has performed as advertised.  The display port is a valuable feature for my use.", "Date": "April 24, 2013"}, {"Title": "Chromebook with Chrome OS", "Author": "Audio Technician", "ReviewID": "R13XG6QTHLFS3S", "Overall": "4.0", "Content": "These laptops are quick. Mine can start up and get to the desktop in 3 seconds. It is fast and has a bit of customization that can be done. It is an AT HOME use laptop though. This is not the best for work environments as some features that you'd like to use, do not work. It's best used for Facebook, Document processing (In Google Drive), and checking emails. It does not support JAVA at the time (Which means no Minecraft for gamers) and does not support JAVA webpages. Everything basically runs within the chrome browser app on the computer which seems like a limitation to me. Games downloaded from the webstore are usually just links to flash games on external sites. Most can't be placed in full screen either. I like it for just basic web access. I would recommend it for someone like grandma who stays at home facebooking all day or someone who is computer illiterate because it is so basic and simple to use.", "Date": "November 23, 2012"}, {"Title": "Great Product", "Author": "HawaiiMike", "ReviewID": "R1CFHR3P8159KF", "Overall": "4.0", "Content": "Recently purchased this item.  My company has converted over to google docs for business. Most of the employees are creating google documents due to the workgroup features on these types of documents.  So I'd recently become a big enough supporter of google docs to want and give the chromebook a shot.I purchased the 3G Samsung 5 550 and it's a pretty good machine.  The battery life is good (6-7 hours), the laptop is responsive and most of what I need can run out of the chromebook.  I do have a couple of issues/comments if you are thinking about switching to a chromebook.1.  Processor.  The celeron processor doesn't really cut it.  Although it's responsive pulling up web pages and editing google word documents working with google spreadsheets is too slow.  I think they need to roll out a better processor fit for this type system.  At least an I3 in my opinion.2.  Apps:  Although you might think you can live with apps running out of chrome (web based) there were several missing components I wish were included.  These include the ability to connect to CIFS shares locally and app selection.  I was hoping to run local movies stored on my home NAS but no luck so far.  I also think they should run a small repo for some apps if the user wants to have them added such as GIMP, VLC, LibreOffice.  That probably goes against the way this was setup but that type of solution would solve some of the deficiencies of trying to live off chrome apps.  Also netflix is running at low resolution for some reason even though the screen should support 720 HD.3.  Pricing:  Considering that I could get a ultrabook for a similar price with a better processor and drive storage I think the pricing should either be lower or the processor upgraded to an I3.4.  3G:  This is probably just an issue with my service area.  But I've had no luck activating my 3G service with verizon.  Although we have verizon coverage in my service area the activation process has hung every time I've tried the activation process.Overall I'm happy with the chromebook despite my comments.  Using it quite a bit but just wish it could handle more functions and came with a more powerful processor.", "Date": "October 8, 2012"}, {"Title": "Fast and easy to use.", "Author": "Y. Li", "ReviewID": "R2UEAMM26NXT2E", "Overall": "4.0", "Content": "I bought this for my mom, who uses the computer to watch video and visit websites. It's easy to use, convenient and fast. The only minor problem is the loose ethernet port cover.", "Date": "September 27, 2012"}, {"Title": "So far so good.", "Author": "Dwight Saunders", "ReviewID": "R19KUV71I2AP6K", "Overall": "4.0", "Content": "I have had my chromebook now for about two weeks and it is overall fantastic. The only issue I have is with the DNS (the thing that translates a websites name into it's address and allows it to load) and I reported it as a problem, but turns out it is on their list of things they are working on already so it should be fixed pretty soon. The feel of it is similar to a macbook air when you are holding it and I love the screen size. It is sleek and well designed. The screen is very easy to see since it is matte and works well in all light. Overall I am happy with my purchase and am impressed by the speed of the device when the DNS does work.", "Date": "July 21, 2012"}, {"Title": "Best Travel Laptop", "Author": "Xill", "ReviewID": "R3Q1U8KWE78AH", "Overall": "5.0", "Content": "I bought the series 5 550 to replace an aging lenovo s10 as my travel laptop. The s10 was getting a bit too slow and I wanted something with a bigger screen.I was concerned that ChromeOS was going to be too limited and drive me up the wall, but I really like it so far. Since this is my travel computer and not my work computer I can get away with pretty much only having a browser.If you want a thin, light, and fast laptop with good battery life that does not break the bank this is the perfect laptop.", "Date": "June 30, 2012"}, {"Title": "Perfect device for kids, parents and Google Apps users", "Author": "Tanya S. Rosenblat", "ReviewID": "R2J8CYFB168GID", "Overall": "5.0", "Content": "My husband and I bought 4 Samsung Series 5 Chromebooks last year for our extended family (3 of them) and our own family (1 shared with kids). This year we upgraded to the Series 550 Chromebooks and sold the old ones on Ebay.We all love these machines: our parents can operate them without inadvertently messing up a setting of forgetting some virus update. They mostly use browser-based applications and therefore the Chromebook does not impose any limitations. Our own children are heavy users of the family Chromebook. Their school district adopted Google Docs which makes these devices perfect for them. My husband even uses Spark View (from the Chrome web store) to RDP into his Windows machine at the university which works very well (note: you need to install an RDP redirector on the remote server - hence, RDP use is not trivial to setup even though it works well).The Series 5 Chromebooks were nice but these new Series 550 Chromebooks are a significant upgrade: Netflix and Flash applications now work without any lag or dropped frames whatsoever. Everything just feels snappy. Moreover, the touchpad is much better in the Series 550 Chromebook compared to last year's version. I still wish that they would offer a Thinkpad-like pointing stick, but the latest touchpad is very good.If you are into PC gaming or heavy video editing, this device is definitely not for you. But for many (if not most) people it will work surprisingly well.", "Date": "September 21, 2012"}, {"Title": "Solid, secure and quick. But is it the right kind of an improvement?", "Author": "Jonathan Cleary", "ReviewID": "R3D7I50YMP7U6S", "Overall": "4.0", "Content": "I love this laptop as I loved its predecessor, the Series 5. It feels solid in the hand. You just know it is well built, easily rivaling Apple in overall build quality. However, as an owner of the 1st gen unit, I remember what the problems were, and I'm not sure they fixed it correctly. It is better, up to daily driver quality, but it took a tradeoff.Pros:Rock. Solid.Fast to boot, fast to wake and fast to browse.Excellent keyboard and trackpad. Customized to Chrome.Best browser out there.Small footprint, with a great matte 4:3 screenCons:No backlit keyboardBattery life dramatically reduced from 10 to 6 hours.I returned my first series 5 because I had too many open tabs and extensions. I filled up the original 2 GB of RAM under heavy usage. Doubling the RAM to 4 GB really took care of the problems. I have none of those issues any more. Samsung, however, also bumped up the processor to a Celeron. I question this. The idea was likely to add more video capabilities and multi-tasking. Well, the last one multi-tasked fine. And HD video is cool, but the Atom could do that well enough on its own. The result of the power bump means going from 10 hours to 6 hours. No notable differences traded for 4 hours? That's an unnecessary pill to swallow.Still. I can easily get by with 6 hours! Great device. Get it and love it. Ignore the critics reviews, read the actual user reviews. That's what matters to you anyways, right?", "Date": "August 22, 2012"}, {"Title": "Faulty battery and/or battery life", "Author": "dk3stl \"Dan\"", "ReviewID": "R2PQ16F1JSZ7Q2", "Overall": "3.0", "Content": "This chromebook worked as advertised except for the battery life - - during normal usage, I would get sometimes 2 hours, or 1.5, or 3.5 hours... the indicator would show 60% left only to have a low battery warning pop up 15 minutes later. So, I think the indicator was off, or the battery was bad, or perhaps battery life is more like 2-3 hours, not 6-8 hours.Samsung customer service was *not* helpful - - I emailed/submitted help requests three times but received no response or support beyond the automated acknowledgment.Other than that, the chromebook worked well, it is small and light, and I like the concept of not having to do any maintenance or updates or virus scans. A strength of the concept is that you can do 90% of everything you typically need to do with it. However, that other 10% is important, e.g. no itunes is a bummer. Rather than get a replacement, I'm going to wait a while to see if windows ultrabooks come down in price.", "Date": "July 30, 2012"}, {"Title": "Awesome laptop with room for improvement.", "Author": "Pierce Hite", "ReviewID": "R18H0L27GN0CQD", "Overall": "4.0", "Content": "Let me start by saying I love this laptop. I own both Apple and Windows computers as well, but this is the only one I use any more. However, there are several things that I believe can and need to be improved upon in the next iteration of this laptop and future Chromebooks. First, as is commonly mentioned, please add a back-lit keyboard!!! This is the main feature I need. Two others things I've noticed other than this are that the feet on the bottom of the laptop are overly sticky and the shiny liner around the track-pad is extremely annoying. Also, the log in screen needs to have a darker background. The bright white is hard on the eyes and batter life. Also, when waking from sleep, the laptop will often go to full brightness before adjusting to an appropriate one, please fix this as well. Otherwise an awesome laptop.I'll update as I come across more problems.", "Date": "July 30, 2012"}, {"Title": "It's for Google fanboys and early adopters", "Author": "Ian", "ReviewID": "R2B1VF1YR8NNL0", "Overall": "4.0", "Content": "I love mine but it's basically a laptop that runs only Chrome and boots lighting fast.  If you're wondering if it's right for you, try using only Chrome and nothing else for a couple of days.BTW, the track pad is really nice.  Near Apple quality. Also, no Bluetooth and DisplayPort to HDMI support is a little spotty.", "Date": "July 11, 2012"}, {"Title": "Perfect", "Author": "Pat", "ReviewID": "RIVXZ3554FI75", "Overall": "5.0", "Content": "I can sit and watch TV and check my email and Facebook without getting up and going to my desk with my laptop.  Great for traveling.  We have a Hotspot and use it when we can't get service, but this has 3G and it works just like my phone only larger.  I use it a lot and it's very serviceable for me.", "Date": "November 24, 2013"}, {"Title": "A robust and powerful machine at a decent price", "Author": "Michael Dennis", "ReviewID": "R2IK5MP1N2RMKY", "Overall": "5.0", "Content": "One of the best products I have purchased. I love this Chromebook. I truly feel that once people understand that a Chromebook is fundamentally different than a traditional PC, they will embrace the concept. A Chromebook is not a PC, it operates off of Chrome OS, a cloud based operating system, and that's a good thing.", "Date": "November 20, 2013"}, {"Title": "Wife prefers this over Windows 8", "Author": "DeDub", "ReviewID": "RG68HR9OU7EWI", "Overall": "5.0", "Content": "I won't comment much on the Chrome OS; either you'll love it or hate it. Just one note, if you take the time to learn, or re-learn I should say, how to do everything in Chrome, it can be a very powerful computer. My 5-star review is for the Samsung hardware, which is excellent. The build quality is tops. The trackpad works better than more expensive PCs and the keyboard is tops. Let me put it this way, I bought this for my wife and then bought her a Windows 8 laptop a year later. She prefers this one.", "Date": "November 18, 2013"}, {"Title": "Great value and shipping was quick!", "Author": "mignon bourgeois", "ReviewID": "R1S1TT1A7XV9DL", "Overall": "5.0", "Content": "This is the best value for the money!This was required for my sons schooling in 5th grade.  The laptop is light.. easy to use.. and the best value for the money.", "Date": "November 5, 2013"}, {"Title": "Inexpensive Linux Box, Works Great with Developer Tools", "Author": "Scott Rice", "ReviewID": "R2SW1689NRSINQ", "Overall": "5.0", "Content": "Using the Crouton project available on Github, I am able to run Github on my Chromebook and use Intellij Idea, Eclipse, Sublime Text 2, as well as a variety of other developer tools. With an Intel chip and 4GB memory, the 5 550 Chromebook is plenty powerful enough for developing.", "Date": "November 1, 2013"}, {"Title": "Can't enjoy the Chrome 5 550 without the USIM card.", "Author": "Alcindor Guillaume", "ReviewID": "R3U1GL92C74GKM", "Overall": "4.0", "Content": "I like my 5 550 Chromebook but I can't enjoy it the way I would like to:away from home by going on line. The reason:My USIM card is missing. In possession of the card,I will love this product. it is light and fast. please send me the USIM card.", "Date": "October 29, 2013"}, {"Title": "great deal", "Author": "Stewart A. Feldman", "ReviewID": "R27GYGE5MC3R4K", "Overall": "5.0", "Content": "i bought a used one just to keep around.  great machine. fast.  long battery life.  only limitation is that  gotomypc.com doesn't yet support chromebook.  it's a bargain. now buying my second one.", "Date": "October 13, 2013"}, {"Title": "A Late Review, A Happy Purchaser", "Author": "Amazon Customer", "ReviewID": "R28H1NM988FJ59", "Overall": "5.0", "Content": "I recently spoke to yet another person who was unfamiliar with Chromebooks.  I won't rehash how I came to buy our first Chromebook, you can see my review of the Samsung Series 5 Chromebook if you are interested.  Much of what I like about that Chromebook applies to this model.We used our first Chromebook (the Series 5) so often that I bought this Series 5 550 (what? really?) so we would have a second.  That was over a year ago.  I use the 550 for a couple of hours most every day, while other family members use the Series 5.  We love them!  Flip it open, it awakens.  Wonderful. Every now and then a free operating system update is available, constantly improving the performance.  And the update is quick, not a ten or fifteen minute affair as with another unmentioned operating system.We are very pleased with our Chromebooks.  The Pixel Chromebook is more than I want to spend on a new laptop, but I'm certain there are more Chromebooks in my future.", "Date": "October 7, 2013"}, {"Title": "GREAT MACHINE FOR THE PRICE.", "Author": "JOHN C. DORR", "ReviewID": "R37NVS1WN639FG", "Overall": "5.0", "Content": "AMAZING. GOOD SPEAKERS,  VERY FAST START UP, NICE RESPONSE ON PLAY BACK, LIGHT, CHICKLET KEYBOARD, TOTALLY GOOGLE DEPENDENT, EXTRA PORTS ON SIDES.", "Date": "October 5, 2013"}, {"Title": "The perfect computer for school.", "Author": "Trofmok", "ReviewID": "R5OBBOLISFPTL", "Overall": "5.0", "Content": "I purchased this as an alternative to expensive tablets on the market. I have had this for three days and I am in love with it. This perfect for a person on the go. I do not use this for all my computing needs; most of my computing time consists of surfing the web, taking notes, and getting minimal online work completed. This computer comes with me to school (it has a long battery life, so I rarely need to charge it), it sits next to my bed so I don't have to lug around my MacBook Pro (super fast boot up time - it's ready to go when I need it), and is light and compact. I love the freedom that comes with this device. I won't be as afraid to damage this or have it stolen due to its low price point; if my Mac was stolen my life would stop. Everyone needs one of these. I should also mention that this is my first Samsung product and I am impressed with how much it can do. I love this thing!", "Date": "August 25, 2013"}, {"Title": "Amazing", "Author": "07tjt07", "ReviewID": "R1AFKJUI6VFAY6", "Overall": "5.0", "Content": "If you are ordering from the amazon warehouse deals... don't worry. My chromebook arrived a day early, and in perfect condition. There was no sign that anybody used t before me. My chromebook is fast, and perfect for coffee shop use.", "Date": "January 5, 2013"}, {"Title": "Works great!  WiFi connection issues turned out to be my faulty/old modem.router.", "Author": "David Otazu", "ReviewID": "R3UDP92G0LMG6M", "Overall": "5.0", "Content": "Battery life is about 4.5 - 5 hours of continuous use, in my experience.  I can't get 6 hours of constant browsing use on a single charge.  It's long enough to keep me happy, though.I've had this machine for 7 months and I've had spontaneous WiFi connection losses that have been getting progressively worse, especially over the last couple of months, even to the point where I had to refresh pages up to 20-30 times before the connection spontaneously returned.  I would get error messages saying that the page I was requesting either did not exist or the server may be down or something, even when looking for [...], so I knew that wasn't true.  When pages did load, they would often load in the basic HTML format (single column, no graphics, etc.).  Instead of pictures, just little picture placeholder icons would appear.  I heard about WiFi connection problem with Chromebooks and Chromeboxes (I have both and had problems with both)  but I thought they had been fixed.  I was going crazy searching the Internet for possible causes and solutions.  My DSL speedtest results showed normal speeds, but pages were still loading at speeds that weren't even as fast as one expect from dial-up modems!  I did a factory reset on my Chromebook, but that didn't help.  I was about to do a clean install of the Chrome OS, but I really didn't want to go through that hassle.  So I tried purchasing another router.It turns out that my 7 year old ATT 2Wire HomePortal 1000 modem router was beginning to fail.  I bought and installed a new ATT modem/router two weeks ago and all these connection problems have been solved.  My internet speeds are all back to normal, pages load completely and quickly and I'm very happy now.  I think the problem was that my old router only operated in 802.11b/g, whereas this new router operates in 802.11 b/g/n.  The Chromebook and Chromebox operate or are compatible with 802.11 a/b/g/n.  Or maybe my old modem/router was just dying.Anyway, I hope this review helps other people and saves them from all the frustration I had to go through.", "Date": "January 3, 2013"}, {"Title": "great product..but do your research before you commit!", "Author": "jay seidel", "ReviewID": "R1FR3GGZ6RFOTF", "Overall": "4.0", "Content": "chromebook provides a wonderful light and eficient laptop experience. does not run windows but almost everything i do on my laptop was internet based anyway. email, schoolwork, blackboard, facebook. the only issue i had was with voice-over powerpiont presentations...google docs doesn't support those files. all else was very good, with smooth clean interface and operation", "Date": "January 2, 2013"}, {"Title": "This is my new favorite go to device", "Author": "T. King", "ReviewID": "R3OPBUD2E91KX2", "Overall": "5.0", "Content": "I've had this Chromebook since July and I still can't put it down and my Windows laptop is collecting dust because I only turn it on to conduct the maintenance. After carefully realizing  what I used a computer for, I realized that I only really used the browser 98% of the time. This device saved me from wasting money because I used to buy custom hp laptops costing over twice as much only to mainly use the browser and it also saved me from buying a dreaded Windows 8 device...thank god.For those of you requiring dedicated programs and hard core games, this is not for you. So don't go out and buy one knowing it can't run windows programs or hard core game so that you can whine about it and write a bad review.I like the size, weight,the speed, coolness, battery life, aluminum palm rest, ports and connections on the side instead of the back like the newer smaller cheaper one and this one plays Netflixs out of the box.  The screen looks great and its really bright and the speaker sound good for their size. Google and Samsung built something I needed and not just what I wanted. Since owning my Chromebook its got better and better with more features added and becoming more like a real OS.Although I had it for 5 months I still got the 100 gb cloud storage upgrade and every new Chromebook comes with 12 free go air in flight wifi sessions...its been a great device.  It has frozen on me a few times but all it requires to reset is unpluging with the screen on and pushing the pin size reset button under the track pad and plugging in, hit power and that's it.", "Date": "December 30, 2012"}, {"Title": "FAAAST", "Author": "Rick", "ReviewID": "R3SPTLDB4YJ7ME", "Overall": "5.0", "Content": "this google chromebook is hard to believe, It boots up in seconds It is made for the internet. All the applications you could want are free. Since the applications are in he cloud you can access anywhere with a googe device. I am currently working in Tucson and using  the google drive for my  documents on my IBM laptop. I have access to the my files whether I am home in Denver or working in Tucson.", "Date": "December 28, 2012"}, {"Title": "Yay!  Working perfectly - has not given me a single problem!", "Author": "Animal_Poet", "ReviewID": "RIS7KHA7GJJJ4", "Overall": "5.0", "Content": "Love this device.  It has functioned perfectly up to now.  Very happy with it.  I recommend it.  Lovely to have no virus or upgrade worries.", "Date": "December 28, 2012"}, {"Title": "good deal", "Author": "Thomas de Triquet", "ReviewID": "R2W1ZA6X6RY2NK", "Overall": "5.0", "Content": "It's been a month- only froze once when using Google maps.  May have been going a little fast.  It doesn't have a caps lock or delete buttons.  The buttons don't light up and CD drive is not included.  It boots up fast*. Perfect reviews \"so far\".", "Date": "December 28, 2012"}, {"Title": "Love it", "Author": "Debra Wilson", "ReviewID": "R1S36T2HIZQ6BT", "Overall": "5.0", "Content": "It is so easy to use.  For documents I used Dropbox.  It takes a little while to get used to working with a excel type document but it is not difficult.", "Date": "December 27, 2012"}, {"Title": "LOVE IT!", "Author": "Barbara Shackelton \"Barbara Shackelton, BookW...", "ReviewID": "R2E8TPFBA7XVHF", "Overall": "5.0", "Content": "Simple to use; does everything advertised; great screen quality; navigation to all sites, easy.Perfect for home use. Especially for this semi-retired engineer.Riverside, California", "Date": "December 26, 2012"}, {"Title": "New", "Author": "Spider2258", "ReviewID": "R1T6RG7SW6YJ6U", "Overall": "4.0", "Content": "I'm still getting use to the machine and not being very computer literate I'm struggling with some features but that's more on me than the computer!! Very fast clear picture easy to set up. I would recommend it", "Date": "December 26, 2012"}, {"Title": "Faster than previous model but visual design less exciting", "Author": "Tblakeslee", "ReviewID": "R1JKHVBUPHMY9I", "Overall": "5.0", "Content": "Speed really matters even for just browsing. I had the old series 5 and it kept hesitating while loading web pages. All those ads and graphics take computer power so the scrolling while loading was jerky. I love the fast startup and now hate my Windows computer which is continually loading updates and rebooting. Updates in Chrome OS are invisible.I do miss the beautiful design of the older model which was all rounded edges and very stylish. The 550 is beautiful but just like everybody else is trying to give the illusion of thinness with sharp edges.", "Date": "June 23, 2012"}, {"Title": "A good replacement for netbooks and most laptops", "Author": "Sean Chitwood", "ReviewID": "R1JD118S0KC0E", "Overall": "4.0", "Content": "As more people move to the cloud, they really need a cloud computer. This is it.As time passes more apps will move to the cloud and more people will be able to use this computer. Right now only extensive media tasks and client side programming are ones where you have to have a non-cloud computer.", "Date": "July 16, 2013"}, {"Title": "Not as useful as it could be...", "Author": "Barry D. Mcgrath \"sly dog\"", "ReviewID": "R2IIRIJ9WS05CH", "Overall": "3.0", "Content": "The computer hardware is good - good display, battery life is excellent...but you just can't do enough with it to use it as your one travel computer.Obviously, Windows or Mac applications don't run here, but you could probably do without that.  It's the web applications that don't run that make you crazy.  It doesn't support Java and one of the databases I use needs Java so I can't log into that with the Chromebook.  It doesn't support Flash so Lynda.com training videos won't run on it.  It doesn't support Silverlight so your NetFlix account won't play movies on it.  It doesn't support Skype.  I could go on and on.  They have an attitude about it too - they tell you Silverlight is being phased out so why should they bother to develop a version? - well because I'd like to play a movie now??Android apps that will work on an Android phone don't work here either.  So forget about the million and one Android apps and make do with the dozens of Chromebook apps.The printing solution is either hit or miss - or their definition or \"working\" is different from mine - I have sent print jobs to printers in the same room and it didn't print out until the next day - hey, who's in a hurry?  Maybe they think PCL is getting phased out too, so why bother writing a decent driver?If Google made an effort and put developers onto this project to fill in the gaps this could be a really good solution, but for now, you'll really need to carry a Windows or Mac laptop anyway, and then what's the point??", "Date": "June 23, 2013"}, {"Title": "Amazing convenience of fast boot", "Author": "A. Shaikh \"Stocks n Stocks\"", "ReviewID": "R1K0ZUJ5F14ZF1", "Overall": "4.0", "Content": "The chrome book is quite easy to use. I liked the portability, fast boot, 5-6 Hr of battery charge and no hassel of antivirus with built in encryption for security. I am bit disappointed with noisy fan, no bluetooth support and display port instead of HDMI. The other new chromebook would make for these missing things.", "Date": "May 30, 2013"}, {"Title": "Back It Went", "Author": "E. Hollowell", "ReviewID": "R1R5OLY0BIA3C3", "Overall": "2.0", "Content": "Can't run Googleearth. 3G was troublesome. Netflix, Youtube, etc. displayed only partial screen. The \"fullscreen\" display had a large border surrounding the actual video so it wasn't really fullscreen. ALL video files need to be uploaded to Google first before they send back the video stream. Documents need to upload to Google to get opened on the Chromebook.After 3 days I ask 'WHY am I doing this to myself?' and then sent it back. Never got the the 3G working which made return much easier.", "Date": "April 11, 2013"}, {"Title": "Price", "Author": "Rafael", "ReviewID": "R2YTX15CW0Z3HT", "Overall": "5.0", "Content": "It was just what I needed and for real cheap to! Glad I got it hear rather than Wal-Mart or some other place", "Date": "April 5, 2013"}, {"Title": "What a surprise!", "Author": "surface artist \"SA\"", "ReviewID": "R2UILAZTDPTTGT", "Overall": "5.0", "Content": "This little powerhouse is strange to accommodate to, but once I learned the power of cloud computing, I was sold. This little baby lets me do my schoolwork anywhere. I create the doc on Google Docs, Sheets, what have you, then save it out in any format you need. I love it. It's easy to port, fun to use and fast, powerful, I bet it would leap tall buildings...the charge in the battery lasts super long. It identifies and remembers the passwords to every hotspot. It is awesome.", "Date": "March 28, 2013"}, {"Title": "awesome!", "Author": "Margaret Putnam", "ReviewID": "R2NB46WRJWNLW3", "Overall": "5.0", "Content": "The Chromebook is functional, fast, and dependable. I LOVE my Chromebook! I even use it for school and it syncs with my phone and tablet.", "Date": "December 1, 2012"}, {"Title": "I like it!", "Author": "IEML", "ReviewID": "R29FYF0COLSH3S", "Overall": "4.0", "Content": "I really like this Chromebook however I don't like its printing system....having to have a windows or mac toprint out a document makes it very inconvenient. The Chromebook is definitely great as a second computer.", "Date": "November 27, 2012"}, {"Title": "Chrome O/S is AWESOME", "Author": "Cody", "ReviewID": "RKJITOUC24G3Z", "Overall": "5.0", "Content": "I have a Chromebook and I absolutely love it. It is super fast and reliable. The new O/S does take time to get used to but you will find that you can do majority of the things on your Chromebook that you can do on your PC and Mac. The only person I would not recommend this device to is someone who needed a specific software that is not available in an online format although the Chrome app store is always growing so I would not be surprised if a lot of these softwares are soon offered as online apps. There is a reason why Google calls this the always new computer. If you are having any doubts or have any questions i created and online Google Group that I can answer any questions that you have. If you already have a Chromebook I also would like you to join this group so we can all share any cool tricks, tips, or cool Chrome apps that would be useful. Here is the link![...]", "Date": "September 25, 2012"}, {"Title": "Great Chromebook", "Author": "CAN", "ReviewID": "R4YOFJ55TIA70", "Overall": "5.0", "Content": "The Chromebook was everything it said it would be and more.  Very easy to set up and navigate. Apps are just what we needed. Perfect for students and busy moms.", "Date": "September 6, 2012"}, {"Title": "next generation 550 chromebook is a home run", "Author": "William B. Rodgers \"peterodgers\"", "ReviewID": "RAXXFOK58AV9T", "Overall": "5.0", "Content": "this 2nd  generation 550 chromebook is a home run.it has the speed and the power to deliver on the promise of the  google cloud.this is the future....but it all flows from the CR-48 prototype.....(of which i still have 4).Machine is a  \"super\" CR-48, one where everything works as it should, at the speed of light.l was sold within minutes of using it to check into my Google cloud. Bang. Done. Gotta have it.1ST UPDATE: the more i use this next generation 555 chromebook, the more i'm convinced that the cloud is the way out. i have 7 machines (including 5 laptops) in my house and i only use this one, nowadays.of course, one has to know something about Google Apps (e.g.:  Docs) to fully appreciate the potential ....2ND UPDATE: Printing problems a deal breaker for chromebooks. I've been an early adopter but very tired of having to keep a PC on to print from my chromebooks. Willing to buy a new wireless printer but don't know which one. This is absurd situation for a company wanting to establish a new standard.3RD UPDATE:managed to get my current  wireless printer working with my chromebooks.Settled for PC laptop staying on but with lid down and settings changed, so as: 1.  to avoid time out and 2.  not to  require password on restart. Good enough for now, for me...but, make no mistake that,  this wireless printing issue is a huge deal breaker for less techy people.4th UPDATE: returned my new 5 550 to Best Buy, until Google resolves the printing issues. Present printing situation acceptable for a $100 used CR-48 but not for a $450 5 550. Replaced it with a used Acer chromebook for $125 from craigslist.5TH UPDATE: all of these problems have been resolved now (6 months later) and i have just purchased  a used  559 chromebook on Craigslist", "Date": "June 8, 2012"}, {"Title": "Good, but unable to load a lot of programs", "Author": "BH", "ReviewID": "R3OIE1VJGLMZ1J", "Overall": "4.0", "Content": "This is good for online use, but there is a lot to get used to. There is an in ability to download drivers for printers and other peripherals.", "Date": "February 24, 2013"}, {"Title": "Fast and light", "Author": "Andres Magnusson", "ReviewID": "R2G4917179NOPI", "Overall": "3.0", "Content": "I bought the Wi-Fi version. I had problem to connect to my old SpeedTouch 585 router. It only got to portal state and I had to ask for a new router.I wish I had bought the 3 G version. The chromebook is light and fast. I like the touchpad. The battery live is good. I dont like the chrome OS . I am considering to install Ubuntu as some users have done. I cant use my native language on the keyboard -I miss that.", "Date": "December 12, 2012"}, {"Title": "dissapointed", "Author": "john", "ReviewID": "R1FVG801YO2IU9", "Overall": "1.0", "Content": "Had to return the product because it could not run a very important program for me....I get a live quote screen from Schwab and it simply would not run.  I researched and found others had the exact same issue.I'm not a techy, but I was surprised because the Schwab program I need runs on my pc using the Chrome Browser.  I had assumed that any program that ran on my pc under Chrome would run on the Chromebook.Also, given the price point, I was not impressed with the hardware build of the device, especially the power connection.  It felt way more like the quality of a nice calculator vs. a $450 machine.", "Date": "January 2, 2013"}, {"Title": "I like it!", "Author": "Brian Furches", "ReviewID": "RSP5BN3ACU0LZ", "Overall": "5.0", "Content": "Very cool little machine. Well built with great keyboard and track pad. Could use more off-line apps,but that is a minor complaint.", "Date": "June 15, 2012"}, {"Title": "Waiting for Integration with MS Word", "Author": "Tom", "ReviewID": "R2C5XU2O401P3L", "Overall": "3.0", "Content": "If only word docs would seamlessly integrate with Google docs, the world would be a much more peaceful place but as long as they are at war with each other, we must wait for Google to make something as good and that others can use should you send attachments.But it is great for web surfing and typing in cases where you need to type and tablets are even more of a useless luxury.Over time I am rooting for Google and will probably just use this for light duty email, web surfing, youtube, reading anything on a big screen,  etc -", "Date": "April 12, 2014"}, {"Title": "Half the price of an iPad and twice as powerful.", "Author": "Clayton A. Cohn", "ReviewID": "R3PJEMK0PMXIM5", "Overall": "5.0", "Content": "People like their iPads, and I do get the Apple addiction. But the iPad, which is incredibly expensive, still won't play flash or really do a whole lot considering Apple is incessant about keeping their platform closed. The chromebook, however, is powered by Google Android, an open source platform, which makes the possibilities for usage much more boundless. Furthermore, it has an actual keyboard which is SUCH a relief from having to type on the iPad screen. Sure you could buy the iPad keyboard attachment, but if I so why not just get this in the first place?? It comes with top of the line firmware (android) and top of the line hardware (samsung). If you think you need a tablet, forget it - you're really looking for this guy.Bottom line: Don't be an iPad sucker. Chromebooks have the best hardware, Samsung, the best firmware, Android, are half the price, and are open source so you can do much more with them. I also love the BUILT IN keyboard...not the hundred-something dollar attachment you can get for the already overpriced iPad.", "Date": "December 28, 2013"}, {"Title": "Back to the drawing board", "Author": "letsdoit", "ReviewID": "RQQKIEO13OEKN", "Overall": "2.0", "Content": "Basically it was a good idea...just doesn't work right.  Works well when it is connected to the internet but It doesn't stay connected to the internet. It has trouble finding the signal and it will shut down even when you are online. Go figure.", "Date": "August 1, 2013"}, {"Title": "Samsung Chromebook", "Author": "Antoinette F. Ledger", "ReviewID": "R326AT8GD6FBR", "Overall": "2.0", "Content": "I am a professor and thought the chrome book would be excellent for my purposes. However, the operating system is incapable of reaching a website I must have in order to communicate with my students and post documents. If its purpose is primarily for online use, the operating system must expand its capability.", "Date": "October 1, 2012"}, {"Title": "Constantly have to enter wifi pass and user name", "Author": "Djoiner", "ReviewID": "R2DMZ95UE58F11", "Overall": "1.0", "Content": "My chromebook loses its wireless network settings daily, and loses its user names. It basically has to be re-setup as if it were just out of the box.Google has not been very responsive, so maybe this is not an issue they are seeing a lot. Neither has Samsung had much to say. I am taking this back to BestBuy pretty disappointed.", "Date": "November 23, 2012"}, {"Title": "Is she a keeper??", "Author": "Grace", "ReviewID": "R1SQ8PMUNDG5ZQ", "Overall": "4.0", "Content": "I am on day 29 with my Chromebook 5 550 and trying to decide if I'll keep it.  It's true what everyone says about it being fast and efficient, well designed, simple and functional.  However, I've had a few snags.1. I listen to all of my music via Spotify and there is no version for Chromebook.  They say you can run the Linux beta version through Wine, but that is Greek to me.  If I keep the computer, I'll be trying to figure this out.2. The same goes for Scrivener, a software program for novelists - naturally, there are only versions for Mac or Windows.3. I can't edit pdf's in Google Drive, even though I downloaded a Chrome extension that is supposed to allow this. (There is no Adobe Reader for Chrome.)And this is just the first 30 days.  I didn't think I was someone who used much software, but I'm finding I rely on more than I thought.  I imagine this will always be an issue with the Chromebook, unless they become wildly popular and developers are forced to create new software to accommodate.", "Date": "November 19, 2012"}, {"Title": "impossible to write Foreign fonts", "Author": "ttt \"Tun\"", "ReviewID": "RNRPO51FN3D38", "Overall": "3.0", "Content": "The computer is fine in terms of weight, speed, price and esthetic. But someone like me who use Burmese font face a fundamental issue. I can read by installing our font, but so far it is not possible to write the Burmese font. Any help or advice to solve this???", "Date": "September 26, 2012"}, {"Title": "Fan went out, freezes, Verizon a pain to configure, not a Mac experience by far", "Author": "CharlesBabbage", "ReviewID": "R3FFGAFY59IANF", "Overall": "2.0", "Content": "After first plugin it in, fan starting making a clicking noise.Thought it would eventually work itself out and go away. I think it did, by malfunctioning.This is not a product you can give your older parents as I did.Complicated interface that is hard to navigate people through over the phone.Verizon data plan is almost a gimmick it eats 100 MB fast, and is a pain to configure.I would not buy another Chromebook for awhile.And I believe I will only buy Apple for gifts. Everything else just isn't worth the hassle and time sink.", "Date": "February 13, 2013"}, {"Title": "Really Just for Web Browsing", "Author": "Ellis3", "ReviewID": "RJMH80AB6A1CF", "Overall": "5.0", "Content": "Update 12/5/2012: First off, the Chromebook has the best keyboard that I've ever used on a laptop (compared to a Mac, HP...) - this is one of the most important factors when choosing a computer (in my opinion). Also, you're going to have the highest quality web-browsing experience with it, it really does load web-pages faster and you can stream quicker (compared to my macbook pro and dell inspiron).You're pretty much limited to stuff that be done in a web browser. 90 percent of the stuff u do might be through a browser but what about the other 10 percent? It gets annoying switching to a computer just to use skype or some other software that isn't an app or can't be used thru google docs (obviously it's not meant for real gaming). Not being able to use skype is only real problem. - Not having to deal with software updates is a benefit for me, I could never stand it when my windows computer would randomly shut down for an update, although, I never thought of having to install anti-virus software as much of a hassle (I just use the free version of AVG). - Some of the short keys will take some getting used too, its very different from the keyboard that you're probably used to (there's no caps lock button on the keyboard plus some other buttons, you've got to use a combination of 2 different buttons to put the keyboard into caps), plus it doesn't use the conventional start menu system and I h.It's very good at picking up wifi, it can make connections that higher-end laptops can't do and it can attain a much higher download speed then other computers using the same connection (i've tested this against my mac plus the HP envy).You can copy/paste music right off of an Ipod (also off of other devices that normally need software installed first)!! the files names will be random digits/letters but when you transfer it to a different ipod it will read it as the real names.Update 5/24/13: all of the problems/cons below have been fixed - it no longer randomly crashes ever and it lets you know current power levels pretty accuratelyMore Cons: - randomly freezes and browser crashes (usually happens when I go days without powering it off) - it's really hard to know when the battery is going to die (it doesn't last for 9 hours - maybe if you're on the lowest brightness level) but every laptop seems to have this problem.That's it.", "Date": "June 22, 2012"}, {"Title": "The honest -  good and bad", "Author": "Press", "ReviewID": "R1CV09ISYV8CQO", "Overall": "3.0", "Content": "Here it is. One of the most honest and straightforward reviews about this product.Pros:Fast boot timeBeautiful displayLong battery lifeFull sized keyboardCompact and portableMulti-Touch trackpadAuto UpdatesCons:All this laptop is, is a glorified Chrome Browser. Really. Anything you can do In Chrome on your desktop, you can do in here. And really, nothing more. If all you will use your laptop for is to browse the Internet, then this is definitely the way to go. If you need it for more than that, get a netbook, laptop, or an ultrabook. :)", "Date": "June 24, 2012"}, {"Title": "Hmm, This thing needs to be $199.", "Author": "Robert King", "ReviewID": "R3C62BM4EIRT3W", "Overall": "1.0", "Content": "Brought one to test for work. We Run a Google apps domain. Seems like a logical choice to fit in with our network.However:The Domain management needs work. Seems like a half finished product.The entire thing just feels cheap. The power adapter- where it plugs into the laptop seems SUPER CHEAP, brings me back to the day when you would have a pile of laptops with power adapter busted off the mother board.Leaves me wondering why this thing costs so much? You can get a Nexus 7 Tablet for 199.Consider me disappointed.", "Date": "September 6, 2012"}, {"Title": "Love it without ChromeOS", "Author": "Chris Scheepr", "ReviewID": "RGUB971P3G6JS", "Overall": "5.0", "Content": "Pros:  Light, Fast, Versatile, Powerful and a seemingly endless battery with the brightness turned down.  With Chrubuntu it is a powerful network tool.Con:  Only 1 so far.  The ChromeOS kernel needs to be used for Chrubuntu and it is not capable of running the 8021q module.", "Date": "May 18, 2013"}, {"Title": "Operating system constantly crashes and developer mode limbo", "Author": "Cosmic \"Cosmic\"", "ReviewID": "RW5UTR1BFFBPA", "Overall": "1.0", "Content": "I've had this chromebook for 2 months now and it has only been functional for almost one month. At first it would just give me error messages and not let me do the things I was accustomed to doing on my computer, which was annoying but I figured I just hadn't figured out how to operate it properly. Eventually it shut down and said the operating system was not accessible and I'd have to reboot my entire system for recovery. I was in the middle of a hectic week of online classes so I had no time to deal with this. Finally, I had time to download another operating system for it on my girlfriend's computer and try to reboot my chromebook. It kept telling me that I was in developer mode and it wasn't verifying the operating system, but it wouldn't tell me how to get out of developer mode. I called Samsung's help and they were NO help. I did everything they told me to do and it still doesn't work. I've \"recovered\" my system (and lost all my papers and personal information on the device) multiple times now and it still won't work. The location of the supposed developer mode switch has no switch, it's just a dark opening and even when shining a flashlight down it, nothing can be seen.I've had computers since the 80's and never had one that was this shoddy. I highly recommend getting anything other than a chromebook because I can't even get the company (Samsung)Samsung Series 5 550 Chromebook (Wi-Fi) to say they will take it back and replace it when I've only owned it for 2 months and it should still be under warranty.", "Date": "October 16, 2012"}, {"Title": "Marginal product, would not recommend.", "Author": "George Humann", "ReviewID": "R2H3NUH1R0T80Y", "Overall": "2.0", "Content": "Not satisfied with performance of product, glaring problem was lack of a delete key...Returned product within one day. Was searching for something between a PC and tablet, based upon description the Samsung seemed to meet my needs.  It did not.", "Date": "December 26, 2012"}, {"Title": "Overpriced and underperforming.", "Author": "Njrg", "ReviewID": "R16V5APUX13PAR", "Overall": "2.0", "Content": "Boots fast.However it's just a barebones \"operating system\" with limited functionality and chokes when running flash-intensive sites or highest-quality videos. 16GB storage space is limiting and Cloud doesn't help so much knowing that you have to be in a good wifi network to have it work. For the same amount of money, one could buy a high-tablet, or a low end, but better-in-most-ways laptop. Properly configured Windows can bootup on a standard harddrive in under 30 seconds or under 10 seconds on a SSD, and can resume from sleep mode almost instantly. This makes the novelty of Chrome OS's boot times less impressive.", "Date": "July 23, 2012"}, {"Title": "One important instruction not included!", "Author": "Cindy Porter", "ReviewID": "R2RRID7JCRHG3K", "Overall": "2.0", "Content": "My husband bought this because he thought it would be easy to use. One of the BASIC instructions that the touch pad needs to be pressed firmly was omitted. It took 2 computers to figure it out and even the Samsung help desk didn't know about it.He has had another computer for quite awhile and went back to using it and returned this one. The first one he sent back probably DID work, just no one knew to tell us that the Touch Pad had to be tapped like a key to get it to work. Sorry - we are not tech savvy.... just a grandpa trying to use a laptop.", "Date": "July 8, 2012"}, {"Title": "junk", "Author": "jack walker", "ReviewID": "R2GSA4R3G5GDV5", "Overall": "1.0", "Content": "sounded great didn't work...glad I didn't get stuck with it..ended up buying a real laptop a Toshiba 15.6 and I love it", "Date": "December 18, 2012"}, {"Title": "True user of this product.", "Author": "Chromebook", "ReviewID": "RZ0YG3GNOSAXM", "Overall": "1.0", "Content": "I purchased this chromebook at BestBuy and cannot be more disappointed in it as a purchase.The following is my reasons against a purchase:The price is outrageous considering anyone could buy a better equipped laptop for half the price.!!The bad battery life it says six to seven hours which is not really good in the first place considering it doesn't have to do any heavy lifting as a real computer. But in real life use the battery life is a lie, I get two hours tops! from this machine it is a joke! It spends more time dead than it does up and running! !The scrolling locks up or just doesn't work when it doesn't feel like it.The \"applications\" are not apps they are slow and clunky web links that have ads all over them! It is insulting.The keyboard feels cheap to the touch and the layout is counterintuitive ie search key is where the caps lock should be but it does have a work around but it is still annoying. The whole computer is like this. Everything that should \"just work\" doesn't! It isn't that fast it is  non intuitive and very clunky.Give up on it if you want to print anything.To close: please stay away from this laptop. If I could I would return it.", "Date": "October 7, 2012"}, {"Title": "so small", "Author": "tina k. fusco \"tina k. fusco\"", "ReviewID": "R2IVHN8CWDQ6C", "Overall": "3.0", "Content": "setup was extremely difficult. i finally got att to tell me how to set up my wireless connection. they don't make it easy. also, this thing is tiny. i have to put on my glasses to read the screen. why does it cost so much compared to other chromebooks? well i can stuff this little thing in my purse...the sensor pad feels kind of cheap. i bought a wireless mouse. you have to press really hard on the pad to get it to scroll. other than that it's great.", "Date": "December 4, 2012"}, {"Title": "its frustrating", "Author": "kay", "ReviewID": "R2B0M9D8GXNVSG", "Overall": "3.0", "Content": "I was looking for a product that I cook use for school that was portable.When I saw the Chromebook I love the size and didn't think twice about buying it. Unfortunately, its nothing like a windows or mac, its a completely new system that I am unfamiliar with. It took me three weeks after purchasing it to find a something similar to Microsoft Word. The only thing i know how to do so far is navigate the internet and type up documents. Which is all I needed it for but it would be nice to now how this products functions. I've never felt more technologically impaired. But on the bright not navigating the internet has never been faster.", "Date": "September 22, 2012"}, {"Title": "Samsung chrome..", "Author": "Paul22", "ReviewID": "R1X5J12YAV8ZVR", "Overall": "3.0", "Content": "I've got it from Amazon very fast for free shipping though. Ordered Wednesday evening and received Saturday early afternoon. So far very happy with the notebook.Giving three stars only because the charging jack is sticking out like a toothpick and brakes off as easily. What would happen if the Samsung put a 90 degrees angle for God sake? At least you don't need two hands to turn the volume up or down like an idiot.Other vise very light and only third what you would pay for perfect Apple.Cheers./", "Date": "July 1, 2012"}, {"Title": "The Worst Computer I have ever owned", "Author": "Redwoodization", "ReviewID": "RV1STVLVKHJ99", "Overall": "1.0", "Content": "You need very fast internet for this machine to work and it's still second best when you have a signal!I love amazon and I love reading reviews so I bought this computer on peoples word that they enjoyed it, that it was fast and fun but no one mentioned that it needs internet or its essentially a paperweight.I have never been led so astray, this is the single worst purchase I have ever made through Amazon.Ok, lets see why people use a computer.. well I like to write and I obviously like microsoft Word.. well it doesn't run on google chrome. Ok, I can use google docs but it has to be online.. what if you are not getting a signal and you want to write?!If you like skype .. forget about it, it doesnt run on google chromebook.If you like watching movies, it cant play movie files like AVI or most anything from my library without being completely glitchy and it cant run any media player except its own. So forget VLC, it doesnt run on chrome. Even Netflix plays back terribly on this machine. Movies are barely watchable on the Chromebook!If you want to learn a language on the worlds most popular program Rosetta stone.. you cant, because it doesn't run on google chromebook.Ok, maybe you like pictures .. well it has no internal editing program so you cant correct a picture without being online .. think about how much slower that unnecessary step is of sending your picture to a third party program to edit and then send it to facebook or redownload it back to your machine?! Forget storing any photos on your computer to show anyone .. the computer is only 16 gb, meaning you have to be online to show anyone your photos?!Maybe you like torrents .. nope you cant download any torrents on google chromebook.Maybe you dreamed of writing a screenplay.. nope it cant run Final Draft.The list goes on and on it cant run almost anything ...  please understand the pigeon hole you put yourself by buying this thing. For the same money you can buy an awesome microsoft 8 machine and it can do anything or splurge on a nice mac and you wont be disappointed, just please dont make the same mistake I did.", "Date": "January 28, 2013"}, {"Title": "its ok", "Author": "fifel", "ReviewID": "R2ET1SK71FRWQL", "Overall": "3.0", "Content": "its ok. it boots up fast. kind of limited as to programs and such. it is pretty \"locked in\" ie you cant set one of your own pictures as the wallpaper? seems like u must hack the thing to get it to do something youd want to do. very good laptop for kids maybe..?i think google could have done better.", "Date": "September 9, 2012"}, {"Title": "Item does not Work.", "Author": "Ericalo", "ReviewID": "R1ZNTUXQTOAZBR", "Overall": "1.0", "Content": "The computer was brought to Brazil by a friend and it does not turn on. I can't ship back to US because the taxes and freight would be more expensive than the product. It sucks!", "Date": "February 13, 2013"}], "ProductInfo": {"Price": "$699.88", "Features": "Intel Celeron_867 Processor 1.3GHz\n4  GB  RAM\n16GB   Hard Drive\n12.1-Inch Screen, Intel HD Graphics\nGoogle Chrome OS", "Name": "Samsung Series 5 550 Chromebook (3G)", "ImgURL": "http://ecx.images-amazon.com/images/I/41401bcjSbL._SX300_.jpg", "ProductID": "B007Y8DJAO"}}