{"Reviews": [{"Title": "Reliable, fast and at a good price.", "Author": "Ken L. Temple", "ReviewID": "R1YY43M59MRSYU", "Overall": "5.0", "Content": "Just retired and needed a reliable computer for home and travel.  I have my pictures on it and it works very well on Google searches and email.  Fast and reliable.  Compact and easy to travel with.", "Date": "December 9, 2013"}, {"Title": "just not a go", "Author": "miss nistar", "ReviewID": "R204F6N7M65YY", "Overall": "1.0", "Content": "slow as ANYTHING! i bought this laptop thinking it would be good enough for me to use while my other one was being serviced, and BOY was i disappointed. it is so maddeningly slow and dumb... if i wouldn't value my hair just this much, i would've pulled it alllllll out by now. it's so, so frustrating! it looks impressive, and seems ok for the first few weeks, but then it starts slowing down and throwing you for a spin. stay away!", "Date": "December 9, 2013"}, {"Title": "geek squad to the rescue", "Author": "Earl Holcomb", "ReviewID": "R3SPIWRQFBFKAK", "Overall": "5.0", "Content": "We had I glitch with this item at first but things worked out,  great item,  works great  my son loves it. When we first got it the hard drive did not work in transit the laptop might have been mishandled or dropped which dislodged the hard drive. A simple fix we open the laptop and pushed the hard drive back into the cradle. Very simple no more problems  to date.", "Date": "December 4, 2013"}, {"Title": "Still using the laptop?  You might like this product", "Author": "marilyn", "ReviewID": "R2GNVVL8BEX4P4", "Overall": "4.0", "Content": "It would have had a five star, but I had to purchase the word package separately, which I  guess I didn't read when Ipurchased it.  You think buying any computer today that would have been programmed", "Date": "November 15, 2013"}, {"Title": "dell laptop", "Author": "Julane", "ReviewID": "RQA70YHLNMC5J", "Overall": "3.0", "Content": "Hard drive replaced...2 weeks after purchace it was sent to Dell. Thankfully I purchased a Square Trade warranty. It's a good computer for my needs,", "Date": "November 8, 2013"}, {"Title": "Dell Inspiron Purchase from Secondipity", "Author": "Angel", "ReviewID": "R3J5GEPDWVNGPW", "Overall": "5.0", "Content": "I was looking for a pc and was shocked by how little they cost now.  I decided to used amazon reviews to find out which model to get.  I noticed a pc could get a good \"average\" review but when you look at the star split some good reviewed pcs can have many 1 star ratings.  So I choose a pc mfg and model that had a lot of 4 and 5 stars and little to no 1 stars.  The Dell inspiron was the pick.  In reading one of the reviews I noticed you can save a lot with a refurbished unit.  I took a chance and bought this one.  You cannot tell it is refurbished.  It came in like new condition, even included that sticky plastic protective cover.  I will say it came with some junk (trial versions of this and that) software loaded so my first step was to delete that from the PC.  It was also missing the driver for wireless so I loaded it from the driver CD that came with the unit.  In the end I am very happy with the pc.  I have since bought another one from another merchant, and I now want to by a 3rd unit but I think inventory is getting low due to the hollidays.  My goal is to get these pcs for my kids to get them through high school for the next 4 years then I will probably do this all again for my kids college years.  Things are changing fast in the pc world so I did not want to spend top dollar during this changing times.", "Date": "October 25, 2013"}, {"Title": "Great Home Laptop", "Author": "Marcie Wardenburg", "ReviewID": "RD2VCYHS1QBPW", "Overall": "5.0", "Content": "Our second Dell Laptop, we are sure of quality service from this product. Our first Dell with Windows XP Home lasted about nine years.", "Date": "October 12, 2013"}, {"Title": "Decent laptop", "Author": "busterusaf", "ReviewID": "R3HYWCA9R5S57U", "Overall": "3.0", "Content": "The specs are decent for the price. Hasn't given me any trouble. However, the all-glossy surfaces are a pain. Shows many scratches.", "Date": "September 6, 2013"}, {"Title": "Amazing", "Author": "BB", "ReviewID": "RSYLMIDZ55ABI", "Overall": "5.0", "Content": "I love this computer.  I surprised my husband with it for his birthday.  It is incredibly affordable.  It did not come with any Microsoft apps, though, so you will need to get word or look online for a free site.  Overall, we are pleased.", "Date": "August 30, 2013"}, {"Title": "Time will tell-", "Author": "david j pedreira", "ReviewID": "R11SW6RMN3V0FZ", "Overall": "3.0", "Content": "I received the laptop and really liked it. Then I started noticing things missing or not working as they should(back button either wouldn't work, or you would be thrown back too far).I called Dell and had to send it back for a hard drive replacement. And this after only 6 months! Also upsetting that the new hard drive does not have a fresh guarantee, but the original still applies and now I am covered for 6 months less. I like the unit as far as design, and quality-", "Date": "August 22, 2013"}, {"Title": "sharp and clear!", "Author": "yacobelli", "ReviewID": "RVS44PJY055R6", "Overall": "5.0", "Content": "nicely packaged product;  compared other lap tops and this one far exceeded the others for everything; wonderful product would rate this v. highly", "Date": "August 21, 2013"}, {"Title": "Good laptop", "Author": "Pedro Gainza", "ReviewID": "R2C5UCA6Q75S80", "Overall": "5.0", "Content": "the \"Dell Inspiron 15 i 15N 1900Bk 15.6 Inch Laptop (Obsidian Black)\" is exelent for work and have elegant designe", "Date": "March 30, 2013"}, {"Title": "Meets my expectations", "Author": "jo", "ReviewID": "R3OD41JWOINGQD", "Overall": "5.0", "Content": "have not found anything about my Dell Inspiron I do not like. Enjoying the newness and the ease of it. Get one for yourself.", "Date": "March 10, 2013"}, {"Title": "Perfect!", "Author": "Frequent Buyer", "ReviewID": "RURQ49WHVPM1N", "Overall": "5.0", "Content": "Perfect for the wife to have her own laptop to run her out of home business.  Has everything she needs! Perfect brand, perfect price!", "Date": "March 9, 2013"}, {"Title": "muy bueno", "Author": "Yasmira Campos", "ReviewID": "R3DPFA0WVYWK7U", "Overall": "5.0", "Content": "muy buen producto llego en perfectas condiciones y de muy buena calidad. completamente satisfecha con la compra de la lapto", "Date": "March 4, 2013"}, {"Title": "Very Great Choice", "Author": "Bethany Marshall", "ReviewID": "R1Z2R6H4LP990B", "Overall": "5.0", "Content": "i just got it! and so far i LOVE it... easy to set up and so glad its windows 7!!!", "Date": "February 27, 2013"}, {"Title": "Good laptop for the price", "Author": "HIPPY MAC", "ReviewID": "R22XQO6QTMV9ZJ", "Overall": "4.0", "Content": "I purchased this laptop about three weeks ago and I have no major complaints. My only gripe would be the keyboard (but that could be my nails). Otherwise, it's a solid and budget friendly machine. It's much faster than my old 17 inch Inspiron Dell that has Windows XP. It's a good laptop for the average home user.", "Date": "February 19, 2013"}, {"Title": "Laptop", "Author": "Anonymous", "ReviewID": "R1G2L479GBO3RX", "Overall": "1.0", "Content": "Laptop is not working after only 3 1/2 months of purchase. I guess I should have bought new since it would have included a warranty.", "Date": "November 6, 2013"}, {"Title": "Really Disappointed With This Laptop", "Author": "Roise", "ReviewID": "R3GIK9S65ZGNE9", "Overall": "2.0", "Content": "This is the second Dell laptop I've purchased and I have to say that it's lacking in overall quality.  I bought it to replace a PC that my husband used and that had long outlived it's usefulness.I hate the flat keyboard and would prefer the \"chicklet\" style keys.  It's too easy to stray off the correct typing position on this model, and I find I'm always hitting the Caps key!The unit I received is noisy, whereas the 13 inch Dell Laptop I bought, about five years ago is whisper quiet and has been a little workhorse for me.The DVD unit is so flimsy that I'd be surprised if it held up for six months of regular daily use.  The eject key for the DVD is practically invisible on the side of this laptop, but on my older Dell laptop, the eject key is located just above the keyboard (that's where it should be!).This was not a cheap laptop and I am very disappointed in it and would not recommend it to anyone!", "Date": "August 1, 2013"}, {"Title": "Save your money!!", "Author": "Alara", "ReviewID": "R1KXU3O9G65TES", "Overall": "1.0", "Content": "I never take time to review, but I am so disappointed in this purchase that I can keep quiet. I choose this computer because of the positive reviews, and was really excited when it came.  Here it is 4 days later and I'm returning it.  From day one the conputer would freeze up and close programs... it was Extremely slow... and after troubleshooting numerous issues for Days, I couldn't even do a system restore.  On top of all that, the installed antivirus couldn't be activated.  Avoid the headache and keep looking...", "Date": "February 25, 2013"}, {"Title": "Good, but:", "Author": "F. Molly \"Frank\"", "ReviewID": "R1S29XG56GC6GO", "Overall": "4.0", "Content": "It is much faster than my 10 year old Gateway, but I am having trouble getting use to touch pad, and their is a problem with the intel driver manager.  Not sure yet if software or hardware problem.  Had some problems with cold start (crashed), but restart OK. Down loaded new BIOS and trying to down load new drivers.  Received in box OK and not to much delay in shipping. Box was slightly damaged but laptop seems OK.  New windows design a little different then what I had, takes some time to get use to it. It came with windows 7. It has a spare window 7 software disk in box. It does not have a paper manual and you need to down load manual from Dell. Some software included with lap top but not many. Ya role your dice and see what happens, do you feel lucky? A million things can go wrong. My next steep is see how good Dell help can be????", "Date": "February 7, 2014"}, {"Title": "Not complete", "Author": "William DuChene", "ReviewID": "R3AD5OW37DEVLZ", "Overall": "3.0", "Content": "This item did not come with any of the operating software. All computers purchased in the past where ready to go.", "Date": "December 2, 2013"}, {"Title": "ok", "Author": "lamlou", "ReviewID": "R15HBJ7NZ5IZO6", "Overall": "3.0", "Content": "i would have bought a cheaper computer and believe  it would do as wellas this one would not buy again", "Date": "November 13, 2013"}, {"Title": "Works great", "Author": "KS \"KS\"", "ReviewID": "R26E7X9703FATP", "Overall": "5.0", "Content": "I really like it, I only use it for basic stuff but no real problems so far. 3 more words", "Date": "September 11, 2013"}, {"Title": "Not Bad", "Author": "Emy", "ReviewID": "R2YYLGZKRGN9L0", "Overall": "5.0", "Content": "Not bad for the price. Bought it just to back up for all our pictures rather than buying an external hard drive.", "Date": "February 13, 2013"}, {"Title": "Dell Laptop", "Author": "J.R Funk", "ReviewID": "R1QIZTPZ8JWCA1", "Overall": "2.0", "Content": "Within a week of purchase, the computer shut down-hard drive issues.  We contacted with Dell about the situation by phone.  Dell attempted to resolved the issue overnight.  When they contacted us-by phone-the following day, the issue was yet to be resolved.  Dell supplied us with a shipping box (they paid postage for package return), and we returned it to Dell the next day or two.  Dell contacted us earlier this week (less than a week after sending the laptop back to Dell) to let us know the part needed to repair the computer was OUT OF STOCK!  After more than a weeks' contact with Dell, they know the problem, yet did not have the replacement part?  Why were we not notified about that earlier?  We purchaced the Dell laptop because of its quality reputation.  I suppose we'll think twice about that next time we purchase a computer.So, a WEAK TWO stars for the computer.However, Dell's customer services was very helpful and prompt with following up the situation.  Also, having Dell pay the cost for return was helpful!", "Date": "March 24, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007IFSYMQ"}}