{"Reviews": [{"Title": "Dissapointed", "Author": "Anant", "ReviewID": "R1Q0U12I4N3S9J", "Overall": "3.0", "Content": "Purchased June 5.  Fist time buying Asus.  Bought Asus because of online reputation of Asus.  Speakers cranked up to 100% are barely audible.  Frequently will not recognize DVDs, either original software, or movies.  Disk Management reads \"No Media.\"  The only way to get laptop to read the DVD is to reboot.  User guide lacks instructions for some preloaded software, such as facial recognition.  Replacing 4 year old Dell 17\" running XP Professional, laptop still working fine, just wanted something a little smaller and lighter.  This Asus is definitely more portable.  Laptop used primarily for web surfing, email, word processing and spreadsheets.", "Date": "June 23, 2012"}, {"Title": "Asus Rocks!!!", "Author": "Yanet Josefina Zerpa", "ReviewID": "R5R0IKSZYW6Q8", "Overall": "5.0", "Content": "This laptop behaves amazingly smooth, indredible performance, the surface texture looks like carbon fiber, its almost like stealing having such a great pc for this price!!! thanks amazon and of course ASUS!!!", "Date": "May 31, 2012"}, {"Title": "great computer, great price", "Author": "Twins fan", "ReviewID": "R2U6P2SBZI7ECN", "Overall": "5.0", "Content": "I like this laptop overall. The shift key is a little smaller than I am used to, so sometimes I hit another key accidently. Also the speakers are on the bottom of the computer, so you have to turn it up to hear music. I love how the keyboard stays cool to touch. I would not hesitate to buy an Asus again. I like it better than the Acer and Dell, I have owned in the past. This computer starts up quickly and is easy to navigate through programs because the mouse pad on the keyboard is the best I've ever used.", "Date": "September 25, 2012"}, {"Title": "Pretty Good Asus Laptop", "Author": "gulfcad", "ReviewID": "R2VQTMBWJI97LQ", "Overall": "4.0", "Content": "Ordered this laptop to replace a Netbook computer that I had used at home. The Asus laptop is a really good deal for the price. There are a few drawbacks that I am listing below, but overall I am very satisfied with the laptop performance. I ordered the laptop with an additional 4 Gb of memory. I used Minitool Partition Wizard Home Edition (free version) to delete the D: partition and extend the C: partition to the full drive. So far CPU performance is very good and I have never used more than 25% of the 8 Gb of memory even running CAD programs. The laptop is also very cool and have only noticed that the power supply gets a little warm when running intensive disk utilities. Overall I am very pleased with the laptop.PROs:Great display resolutionGood Key size on the keyboard while still including a numeric keypadRuns coolGood priceCPU and disk size is great for the priceCons:Soft and thin case top - could be easy to damage the displaySpeakers and not that good...full volume is not that loud", "Date": "September 9, 2012"}, {"Title": "Amazing Laptop", "Author": "JohnRiver", "ReviewID": "R2NKPM2PHULGH2", "Overall": "5.0", "Content": "This is a great laptop for its price.Pros: Excellent specs (RAM, Hard Drive, Video Card), it comes with one 3.0 USB, decent material quality, light, price, amazing heat control (never gets  hot), not prone to get fingerprints, perfect screen size, decent resolution, solid keyboard.Cons: battery life it is not the best, speakers are NOT loud at all. Sometimes problems reading the disc unit... could be a software issue, touchpad not the best.I purchased this laptop because its specs and price. I have to admit this is not the most beautiful laptop you are going to find... but that is not important to me. I use this laptop for work and for gaming and I am completely satisfy with its performance so far. I highly recommend to purchase this laptop with the extra 4 GB  of RAM.Now here it is a list of games I have tested and next you will see the graphics quality I could get.* Command and Conquer 3 - Full graphics* FIFA 2013 - Full graphics* Fallout New Vegas - Full graphics* Trine 2 - Full graphics* Call of duty 4 - Full graphics* Dishonored - Full graphics* Transcripted - Full graphics* Left 4 dead - Full graphics* Dirt 2 - Medium graphics (still look very good)I know the majority of the games are not the newest but they required a decent video card. You can overclock your APU (CPU and GPU together) A6 VISION and this will increase you clock speed but I haven't done it yet ( if you don't know how to do it correctly don't do it)... if you want to determine whether this  laptop is a gaming laptop or not  that's your choice.During my job I use the laptop with programs like excel, photoshop, dreamweaver and other programs  and it can handle all of them at the  same time with NOT lagging nor heat at all.I've been using the laptop for a month.... No problems so far.If you are looking for a cheap laptop with great built quality and excellent performance(decent gaming, office and adobe CS5 - perfectly) this is your choice. But If you are looking for a fancy  machine with a lot of aesthetic details or very strong gaming capabilities... this may not be for you.", "Date": "November 17, 2012"}, {"Title": "Great for games!", "Author": "Fan of Good Products", "ReviewID": "R3E9N2F29XSCXL", "Overall": "5.0", "Content": "Let me start off by saying that all of the negative reviews are incredibly stupid. It does not feal junky it feals great and not plastic heavy at all. It doesn't get hot very easily, the charger might but who cares.This laptop plays games very well, I game a lot and games such as Fallout 3 run great. Couldn't have asked for a better laptop in the $400-$600 price range.", "Date": "July 19, 2012"}, {"Title": "updated: Defective upon receipt", "Author": "Bill", "ReviewID": "R2ZI0YJ955J4ET", "Overall": "4.0", "Content": "update: The new laptop arrived and has been in pretty heavy use now for a few weeks. I have to say this laptop is simply amazing for the price/feature set. The only thing I would recommend is upgrading the RAM from 4 GB to 8 GB for that little extra kick since the drive is a tad slow (to be expected on a laptop). My son has been doing some mid range gaming (minecraft/tf2/civ) on it as well as word processing (school) and web browsing (facebook/gaming sites) and for that this system fits perfectly.The amount of garbage-ware on the system is minimal for this price point and all of it uninstalled quickly and without complication and for that I have to thank ASUS. This laptop shipped and worked perfectly out of the box; it appears to have a different power supply than the previous one so that may have been the problem and was already resolved so a pass to ASUS on that.All and all I am pleased with ASUS and Amazon in this transaction and would recommend this system to those looking to do a bit of everything on a budget.original: I expected a basic system with little frills but what I got was a system that would not power on. I am disappointed in ASUS Quality Control but I will give them another shot to get it right. I will update this review once I receive the replacement accordingly.Amazon was amazing as usual; overnight delivery on the original arrived as scheduled and the exchange was processed immediately and the replacement laptop was shipped before they received the package. Amazon was also rad enough to send the replacement part overnight as well in the fashion in which I originally ordered. With customer service like that and the great selection why shop elsewhere?", "Date": "November 16, 2012"}, {"Title": "Great laptop!", "Author": "Sasha S.", "ReviewID": "R146BDW2HKJPPC", "Overall": "5.0", "Content": "INFINITE STARS! I've had this computer for about 2 months now and am completely satisfied. The quad core processor and 4GB of RAM lets her perform smoothly even when I am running multiple large programs. I recently downloaded Adobe Creative Suite 6 and am able to run Photoshop and Illustrator and surf the web simultaneously without ANY lag! I have purchased several ASUS products over the years and am happy with each and every one. I cannot recommend this laptop enough!", "Date": "September 26, 2012"}, {"Title": "Excellent buy!", "Author": "Iconoclast", "ReviewID": "R3I8WTHEGE7NYN", "Overall": "5.0", "Content": "I followed the advice of one the reviewers below, and purchased a 120GB SSD, along with what I needed to replace the optical drive with the HDD that comes with the laptop. I then upgraded to 8GB of RAM, and let me tell you, this thing is fast!There was some bloat on the computer to begin with. If you aren't planning on getting a new SSD or HDD, I'd still recommend just performing a clean windows install, then downloading the Asus driver program to reinstall the essentials without the bloat. Battery lasts about 2-3 hours. Smart USB port placement, although I wish the power plug was located on the rear, instead of on the side. Stays cool to the touch, even when I'm running hours of code!", "Date": "July 10, 2012"}, {"Title": "DOA ASUS A53Z", "Author": "Dan in Mass", "ReviewID": "RV52G0KD33GPP", "Overall": "3.0", "Content": "My first new notebook computer in 5 years, my first DOA computer in almost 30 years. Thankfully, Amazon has a great return policy and they are shipping out a replacement in short order. But still, it gives me a reason for concern about this company's quality control, the screen was totally dead on arrival. All the manufacturer wanted to do for me is send it back to them and wait 14 days to hear what they had decided to do about it, not cool at all for a totally dead LCD screen on day one. Make up your own mind about this, for me I am willing to give them one more try, mainly because the other reviews sound great.Am I doing this because I have been in the computer field since 1980 and have seen a lot of bugs in both the software and hardware side and am more tolerant? Maybe so...time will tell. I will let you know if the next one is working and for how long.", "Date": "June 19, 2012"}, {"Title": "Content Computing", "Author": "ContentComputing", "ReviewID": "R13A0LO2QO9M7M", "Overall": "4.0", "Content": "This was the first laptop I've purchased since 2005, and I have been very pleased with the performance.I am NOT a tech guy, but I work with a few. As far as specs go, my colleagues say this machine has some real robust features, in example, being 64 bit. For me, it was just a pleasure to have a \"starter\" package of Microsoft Word and Excel already installed. I write a lot and have found these to be adequate. The keyboard is also decent, though I really have no use for the number pad and wish that instead more effort had been put into light-up keys or a more \"mac-like\" feel, but ultimately this is trivial. The speakers are also not wonderful, but it is a laptop and I don't expect much in this category. The battery life is great though. And the screen is vibrant.Thus far, everything has run smoothly, looked great, and been a major improvement over its ancient predecessor. I don't play games, so this review should not be considered if you are heavily into such. For me, this piece of equipment has been just what I wanted -- I'm not very demanding but I'm certain it could handle more - and the price was fantastic.If you are realistic about you actually do with your laptop, what your needs really are, then this ASUS is probably a great deal for most everyday users.Enjoy.", "Date": "November 12, 2012"}, {"Title": "Bad spacebar", "Author": "K. Cortes", "ReviewID": "R175WQBE4W31DV", "Overall": "3.0", "Content": "It may seem trivial but it's nearly impossible to type with a spacebar that does not work. You need to hit the center of the bar for it to work. Hitting the right side does not activate the sensor and thus youhavesentencesthatlooklikethis. I am hoping it's just my laptop and not a problem with the model (although I have found on-line forums where others have complained about the same issue). I am working with ASUS tech support but so far that have not found a solution.Otherwise, I have no issues. It's light and the battery lasts for hours. Lots of useless programs need to be uninstalled to speed things up.", "Date": "October 29, 2012"}, {"Title": "Excelent", "Author": "RICARDO LOPERA E", "ReviewID": "R1YN3M6BRRDV9H", "Overall": "5.0", "Content": "Inicialy i had my doubts... but after arrive.... i installed AUTOCAD 2013 and REVIT 2013 (architectural design programs).... and the laptop works perfectly... is a very good machine", "Date": "August 10, 2012"}, {"Title": "Good specs but cheap plastic feel", "Author": "Roger", "ReviewID": "R120AWREUJLTVW", "Overall": "3.0", "Content": "This is a decent laptop for $430. Good specs but there are a few flaws that I did not see others point out. The first thing I did was do a clean install of Windows 7. I then installed a few essential programs (i.e. browser, antivirus, etc), at this point the system was quite bare, yet I still experienced hiccups in performance here and there. For a machine with 4GB of ram (and hardly any programs installed) I did not expect the machine to lag when doing simple tasks such as opening two internet browsers. Needless to say, this was disappointing so now I'm considering upgrading the ram sticks.Many people mentioned this but in case you're wondering, yes the plastic case does feel cheap. In fact I heard a small crack when I flipped the laptop upside down to copy the windows key. I was not using force or anything, I am actually quite careful when handling electronics. The good news is nothing seemed to have broke.Note that you won't be able to tell if your laptop is finished charging once you power the machine off. Why? You ask? Because ASUS failed to make the battery light blink while charging. This might not be a big deal for some of you but I would like to know when my battery is finished charging. As some of you may know, constantly overcharging a laptop battery is a great way to kill it. Anyway the battery light stays completely solid when the AC adapter is plugged in, so you'll have to keep tabs on the battery yourself. I'm still amazed how ASUS left out that feature. Even my 11 year old laptop has a blinking charge light, not this one though.Other than that the laptop has been pretty good. Resting on a heatshift pad I have not seen it go over 47C. The intake vents are placed on a curve between the bottom casing and the palm rest so they are never blocked, this is an A+ in my book. Speaking of the palm rest it doesn't warm up until ~43C, which is good enough for me.I love that there is a USB 3.0 port. I purchased a USB 3.0 flash drive when I bought my desktop but didn't use it much because the 3.0 ports were in the back. It was too much of a hassle to reach over to the rear ports each time. I'm glad I can finally take advantage of the speed now!The right and left click buttons are very responsive and do not require much force unlike some laptops. The keyboard is awesome, it feels very solid and soft to the touch, if the 10 keys weren't so squished it would have been perfect. My issue is that the arrow keys and number keys feel a little awkward with no spacing between them. I've gotten the keys mixed up a few times because they are right next to each other. Regardless, the keyboard and buttons feel great.Bottom line: if you're okay with a laptop that has cheap plastic case and quality specs then this laptop is for you.", "Date": "July 25, 2012"}, {"Title": "Nothing special, does what it does.", "Author": "Lynn", "ReviewID": "RPWLVP97PJKT0", "Overall": "4.0", "Content": "My wife needed a new computer and this definitely fit the price range.  It is definitely a bit bulky, but overall feels much lighter than the old Dell 15\" laptop she had mostly due to the battery being much smaller in the ASUS.  When we took it out of the packaging the mouse touchpad did not work, I had to plug in an external mouse to finish the windows set-up and called tech support who tried some rudimentary troubleshooting and eventually said I would have to send the computer to them for repair.  I was a little upset, but the ASUS tech support personnel were friendly and easy to work with, they also paid for shipping both ways, I just had to print out a piece of paper and take it to a FEDEX drop-off location.  The total time from when the computer was sent in until we received it back was around a week and a half and it seems like they have fixed the issue.  Overall, it's a good computer the styling is very nice as well and (although unfortunate that they were needed) tech support/warranty were excellent.", "Date": "July 11, 2012"}, {"Title": "Great computer", "Author": "Ryan", "ReviewID": "ROWEZH1WSQFWF", "Overall": "5.0", "Content": "This seemed to be a steal of a deal so I snatched one up and put in a SSD and upgraded to low latency 8gb of ram and cloned the HDD onto the SSD and put the original HDD into the optical drive bay with an adapter. I was basically following the setup of another reviewer. Anyway's it worked out great, the most demanding thing I do is play Diablo 3, sometimes I get a bit of lag if there are tons of animations on screen (usually from Wizards) bur other than that I get pretty good frame rates, usually 20-26 (pretty playable). But the new patch of diablo has a bug where all the fps display as 0 so I dont actually know what my frame rate is now that I tweaked it a bit more.", "Date": "July 2, 2012"}, {"Title": "Better than expected", "Author": "Sam S. Senteney \"Sambo\"", "ReviewID": "R1LFW1T6TH123A", "Overall": "5.0", "Content": "I was expecting a lot less for the money.  It is fast enough to be sure. The USB 3.0 and the front facing card slot make this a versitle machine.  I did order an additional 4Gb of RAM for the extra headroom.  I'm using it primarily for field use for my photos, although I have edited video as well. (Photoshop and Premiere) It did take a few days to get comfortable with the multi-touch pad sensitivity and functions. That is so far the only thing that has been of concern.Yes, I would recommend this machine for the casual user as well as for the business/artist not needing a bleeding edge laptop.", "Date": "November 20, 2012"}, {"Title": "Great machine for the price.", "Author": "dmcg", "ReviewID": "RS4BQDWPCS16G", "Overall": "5.0", "Content": "My ASUS laptop is easy to set up, easy to use and has a nice bright screen.  Windows 7 runs great and plays my some what older games very well.  Contrary to some of the reviews that I had read when researching my purchase, the sounds is fine for what I use it for.  I use the laptop for internet and gaming.  I have not tried to watch a movie on it, so maybe that is where the audio problem shows up.  For a machine that costs less than $400.00, it has amazing stats.  Very happy with this purchase.", "Date": "November 1, 2012"}, {"Title": "So far, so good", "Author": "Theodoric Mill", "ReviewID": "R2F83RMT5VH7AS", "Overall": "5.0", "Content": "I bought this latop only 5 days ago, this might be too early for a review but all I can say is that so far this latop, for the price I've payed, is a delight.I might use it to play some games but I mainly use it for music production and I've been running my program ( Ableton Live and Pro Tools ) smoothly without any problems, even allowing me to open other programs such as Internet and Documents at the same time without problems. The quad core is excellent and that is what I was looking forward to. That's all I can say so far.", "Date": "October 29, 2012"}, {"Title": "Amazing!", "Author": "Various", "ReviewID": "R9MNJSW9M7FM7", "Overall": "5.0", "Content": "I purchased this notebook pc from amazon. I could not be happier with the product. The graphics are very good, and it is incredibly fast. It even keeps the palm rests cold for comfort. The laptop came even faster than it suggested. Battery life is decent, but it charges pretty fast. The 4GB RAM helps. The laptop is incredibly light and fast. It supports a few games. The power supply can charge ipods/iphones about as fast as the wall charger.", "Date": "October 15, 2012"}, {"Title": "Monitor dead after 6 weeks. Now fixed", "Author": "Michael R. Dickman", "ReviewID": "R67WZLWY6RBXH", "Overall": "4.0", "Content": "I bought this for a christmas gift for my son at college.  He reported last night (2-11) that the monitor wasn't working.  He said if he shined a bright light on the screen he could see enough to print out the paper he had due but not to proof it or change it.  ^ weeks and the backlight is out?  Not acceptible.  Edit:  So you don't have to wade through the comments,  We sent this back to Asus who fixed it, and shipped it back for free.  So, it is a fine computer for the money.  We opted to have the extra 4 gigs of ram on and my son reports it is able to play all of his games w/o breaking a sweat.  Nice computer for the price and customer support was great to work with.", "Date": "February 12, 2013"}, {"Title": "Great Buy!", "Author": "WILL HODGE", "ReviewID": "R1O3WEPCSH7JFR", "Overall": "5.0", "Content": "I researched this machine and compared against the others of it's performance. I did not care for Win 8 - don't need touch screen.Best buy I have made in electronics lately.", "Date": "February 6, 2013"}, {"Title": "ASUS A53Z-AS61 15.6-inch laptop", "Author": "Virginia C. Montcrieff", "ReviewID": "R3IZXRX54MCUL5", "Overall": "5.0", "Content": "I knew nothing about choosing a laptop.  The reviews helped me decide on the ASUS.  I am very happy with my choice.I am a senior citizen and my Grandchildren who are all out in the computer world are just as impressed as I am.", "Date": "February 5, 2013"}, {"Title": "Nice laptop.", "Author": "Joe B.", "ReviewID": "R1IHEK32HM6HI3", "Overall": "5.0", "Content": "The internal guts have some serious processing power.The external casing looks nice and is well constructed - but is made entirely of plastic.The keyboard is very nice. The keys have a nice mechanical \"Click\" to them, and are well spaced apart, it even has a number pad!The screen is run of the mill. Its a bit white-washed out, but not un-watchable.It boots up fairly quickly  (1.25 minutes) but does have a fairly large amount of bloatware pre-loaded on the machine. I'd recommend a fresh install of Windows.Its a great buy! Worth every penny spent. Its just not for  movie buffs or hardcore gamers, but for traditional office or home use it knocks the ball out of the park, especially for $400!", "Date": "January 31, 2013"}, {"Title": "No complaints!", "Author": "Cheryl", "ReviewID": "R2UGAXK0TYZS3N", "Overall": "4.0", "Content": "My husband bought this for work to take with him when he travels.  No complaints.  Exactly what he needed and he likes the mocha color too rather than black.", "Date": "January 31, 2013"}, {"Title": "Mom loves it!", "Author": "WordyGrrl", "ReviewID": "R1VES5YA6HJPMC", "Overall": "4.0", "Content": "Bought this for my mom when she finally expressed an interest in getting online. The main criteria were \"powerful enough to still be useful for several years\" and \"not so complicated that it might intimidate somebody who's very new to using their own computer.\" The instruction manual was brief and very concise, did a good job of describing what's what. There was minimal bloatware for me to remove, and I added some software (MS Office 2010, AVG and MalWareBytes), tidied up the desktop and sent it to her along with a mouse (takes less time to get used to than a trackpad). It's small and lightweight, and powerful enough that if Mom turns into a gamer, it can handle that, too. The only downside is that this model has only one USB port, so I had to send along a USB 4-port extension so she can hook it up to a printer.", "Date": "January 30, 2013"}, {"Title": "Didn't buy it for myself.", "Author": "Jin Champloo", "ReviewID": "R26LI6F7JAIT91", "Overall": "4.0", "Content": "So I don't know if any complains. However we bought a replacement memory (RAM) right away, this guy has not enough. Probably he reinstalled OS anyway :)", "Date": "January 30, 2013"}, {"Title": "Satisfied", "Author": "Lauren J", "ReviewID": "RCKZ02F1CL2HJ", "Overall": "5.0", "Content": "Very happy so far after several months of using this computer. My favorite part is that the bottom of the computer stays cool. I have experienced other laptops that burn your lap!", "Date": "January 28, 2013"}, {"Title": "Very nice big laptop", "Author": "Steven J. Ponchot", "ReviewID": "R3DNP1G2VII2RI", "Overall": "4.0", "Content": "We are using this computer as the server on our wifi network.  I really like the screen size (perfect for movies), and having a real numbers pad is a very nice feature.  It has not let us down yet, with the exception of Windows!  I hate Windows, and recommend a Mac any day, but I needed something I could use as a \"hub.\"  This one has performed well, apart from the mess of Windows.  Buying an \"off brand\" has not hurt us in any way.  It does its job very well.", "Date": "January 23, 2013"}, {"Title": "Good buy for the right user", "Author": "david m. owen \"dowenslc\"", "ReviewID": "R3T4XVC3AY2L6P", "Overall": "5.0", "Content": "I got this for my son who's going to college. The Windows is last generation, but he did not care as he planned to install and use Linux. He is very pleased with it so far - it seems to perform as required.", "Date": "January 19, 2013"}, {"Title": "Very fast.", "Author": "stif47", "ReviewID": "RN83S7QQEDZGC", "Overall": "4.0", "Content": "I bought this for my cousin but use it a month down in Mexico.  I had bought a 10 wee for a few years ago.  She was surprise by the speed.  I think you wouldn't go wrong buying this, their quick delivery was alsonice.", "Date": "January 18, 2013"}, {"Title": "Durable, compact laptop... perfect for writers", "Author": "Molly R. Smallwood \"Molly Cutie\"", "ReviewID": "R1JIXTGQWD544Z", "Overall": "5.0", "Content": "As a writer I have a very busy ever growing career and with that career it is so important to make sure that I have all of the proper things needed. I chose to buy this laptop. This laptop not only has a decent screen, but it also has 4 GB DIMM RAM and 750GB 5400rpm hard drive which is nice especially with all of the work that I have to do over the year. If you are someone that is a writer this is one of the best computer brands out there that will withstand the everyday use without overheating.", "Date": "January 17, 2013"}, {"Title": "Vannah\"s x-mas present", "Author": "Pen Name", "ReviewID": "R1YIV7KOW70DGA", "Overall": "5.0", "Content": "I bought this computer for my daughter who is 16. I had really shopped around for a couple months, wanting to get the fastest, biggest, and nicest computer, while paying the least amount of money! Lol I read reviews on, what felt like a hundred computers, probably closer to 50, and decided I would go with this one, even though we have always owned Toshiba brand computers. What made me decide on this, besides the great price and good sped, was the horrible customer service reviews for Toshiba. I guess we had never had any issues with any of ours, so there was never a reason to speak with them. All I can say is my daughter was so estactic when she opened the box on Christmas, she asked, is this really a laptop, or did you wrap something in a laptop box, lol, as we often wrapped things in other boxes, this computer came with a one year \"bumper to bumper\" warranty, as I like to say, protecting it from spills, drops, everything, and with a 16 year old you need that. They give you 60 days to set up the warranty, but it's effective from the date of purchase, so that's a bummer since I bought it in November and didn't do the warranty until mid-January. Thank God for the 60 days!!! A lot of other companies and computers just didn't compare! She will be able to use this for at least her last year of high school and the 1st two years of college. I bought an extra 4g so now she has a total of 8g with 750 mb, I hope I said that right, I'm sooo dumb when it comes to computer talk. The 1st thing she did when she turned it on was download the backup disc, since it didn't come with it, but it's a quick little computer! All this for $399.00 and free shipping to boot, you just can't beat that! I think I might get one next! Time for an upgrade!", "Date": "January 16, 2013"}, {"Title": "ASUS lap top", "Author": "Gwen Hughes", "ReviewID": "R296XFMRZRZJZT", "Overall": "5.0", "Content": "Great computer for the price. We were looking for a lap top for our 11 year old grandchild. We didn't want to pay a lot of money due to his age. It has a lot of features, great speed, and lots memory for the price. He loves it.", "Date": "January 14, 2013"}, {"Title": "Buy it NOW!", "Author": "The Bonedaddy", "ReviewID": "RYADDHEHPZKYT", "Overall": "5.0", "Content": "Buy it NOW!  a GREAT little laptop.  It has the same Specs or better than my 3 to 4 times as expensive 5 YEAR OLD Dell.  My Dell was giving me fits and starts, so I pondered buying this for a long time. When I first saw it it was $399.99 the it jumped to $420 something then $479, $500 plus, etc.  When it fell back down to $399.99 I was all in.It has a large 750GB 5400rpm Hard Drive which is hard to find at this price range.  I needed it for my large music and photo libraries.  It came with Windows 7 Home Premium 64-bit which was eligible for an upgrade to W8 for $15.  That was a mistake.  Stay with W7.The only thing I miss from my Dell is the lighted keyboard, but I guess that's a personal preference.Did ya read that ASUS...LIGHTED KEYBOARDS!Buy it NOW!", "Date": "January 9, 2013"}, {"Title": "great value", "Author": "Paul", "ReviewID": "R339VR3K0T75C7", "Overall": "5.0", "Content": "perfect value - this is a solid, capable laptop with a good display for a very low price.  I also added 4GB more of RAM for cheap and it's a great laptop.", "Date": "January 3, 2013"}, {"Title": "Excellent for the family", "Author": "Brian", "ReviewID": "RO5IOWWGF3SS2", "Overall": "5.0", "Content": "First time I ever bought an Asus product.  After comparing it with other similar brands & models, went with this one based on a trusted friend's recommendation for Asus in general.  I will now always highly consider Asus products after this experience.  This is the best laptop out of the previous three (HP & Toshiba) that I've had over the years.  Just a very solid, well built unit.  Over the last 6 months or so that we've had it, my family has put it to the test and it's never had any problems.", "Date": "January 3, 2013"}, {"Title": "no complaints", "Author": "jj \"jj\"", "ReviewID": "R2NJ79VMU5S6KF", "Overall": "5.0", "Content": "used by a student who uses it for web browsing and microsoft office.  Also occasionally used to stream movies to big screen tv via hdmi OUT.  Handles all these tasks easily... as expected.  Pretty light laptop and battery consumption seems really good (atleast compared to my laptop).But definitely not worth the current amazon price of $530", "Date": "January 2, 2013"}, {"Title": "ASUS A53Z-AS61 15.6-Inch Laptop (Mocha)", "Author": "jkscottusa", "ReviewID": "R2G71UF78GJ6VS", "Overall": "5.0", "Content": "Heard that Asus was very good for the price and I was not disappointed. So far I have been very happy with this computer with no complaints. I can play my games and what not with not problems. I should add that I maxed the ram soon after buying but I was fairly happy with it before I added it. I bought just before Cyber Monday and got a really good price too.", "Date": "January 2, 2013"}, {"Title": "Great value!", "Author": "Julie", "ReviewID": "R1GNE45DSZL164", "Overall": "5.0", "Content": "I was looking for a cheap laptop that I could surf the web and use MS products on.  I read the great reviews for this one and at the time it was $200 less than the listed normal price of $599.  Really like it!", "Date": "December 31, 2012"}, {"Title": "Great laptop...", "Author": "C Lezcano", "ReviewID": "R2910KNVXGFBV5", "Overall": "5.0", "Content": "works better with and extra 4GB module... you can even play the newest games... just love it!!! recommended purchase if the price drops below 400...", "Date": "December 13, 2012"}, {"Title": "Excellent PC for the price!!", "Author": "Carlos A.", "ReviewID": "R11B9QIWO7KTDK", "Overall": "5.0", "Content": "bought this pc on november 2012 for $399, i installed wow pandaria expansion, run like a charm, tried some other games, left4dead and others, no problem, runs smooth, keeps kool, only upgrade ill be making soon is add more ram, only brings 1 4gb ram card, but has an empty slot to upgrade, the pc still fast and quiet, but yeah i run some software and when browsing and playing the memory usage goes up to 80-90%. i agree with some other review that the buttons of the \"mouse\"  feel cheap. but i keep this pc mostly at home and use it as a \"desktop\", connected to a hub with usb mouse and keyboard and connected to a 21in monitor, so no problem here.for not being a \"gaming\" pc it runs the games i play currently like a charm.", "Date": "December 12, 2012"}, {"Title": "Amazing....", "Author": "Elvin Evangelista", "ReviewID": "R1DF0FW0BY258A", "Overall": "5.0", "Content": "It's fast, neat, user friendly. The size is not the best but good enough. The screen display is amazing and when I upgraded to Windows I encountered no problem at all.", "Date": "December 10, 2012"}, {"Title": "I was thrilled to find this computer!", "Author": "Amanda H.", "ReviewID": "R1STGTYVVLQUGD", "Overall": "4.0", "Content": "My husband desperately needed a new computer and I wanted to surprise him with one. I was prepared to save up for a pricey computer, but was so pleased when I found this one. It has everything he needs with an amazing price point that was more in my budget. I would say that the one downfall is that the speaker volume is quite low but overall my husband loves his new laptop - I'd buy it over again!", "Date": "December 7, 2012"}, {"Title": "Excellent computer", "Author": "Caleb Willing", "ReviewID": "RXQP45AX5Z45Y", "Overall": "4.0", "Content": "I bought this computer for my sister who is heading back to school who needed a good laptop at a excellent price. After searchingover many many ads and and websites I settled on this laptop based on features and specs for price. So far she has loved the computer and it has done everything she has needed it to do! I can recommend this to students and anyone looking for a good laptop on a budget", "Date": "December 7, 2012"}, {"Title": "Exact same problem I had with my old laptop...", "Author": "Nathan C. Crouse", "ReviewID": "R2MVEY9T78XUE", "Overall": "3.0", "Content": "I bought a Lenovo G570 Dec 2011.  Fast forward 7 months and the plastic that holds the hinges to the case are cracked and one of the hinges isn't being held down at all (this is a very well known problem with the model).  I decide to do a quick fix and JB weld it down and sell it after doing research on a newer laptop.  I came to the conclusion the ASUS A53Z was the right one for my price range.  I bought it brand new.When I received it the case felt very sturdy and everything worked great.  A month into ownership one of the hinges starts clicking and getting stuck.  I don't think too much of it, maybe it just needs more lubrication.  After 2 months I open the case up and to my dismay the plastic holding the clicking hinge down is broken on one lower spot and the top plastic as well and the top plastic on the other hinge.  I couldn't believe that the same thing happened to my new laptop in less time, which was the reason I sold my old one...  These manufacturers just set the screen hinges way too stiff and the plastic holding the metal hinges in place can't take the strain.  I don't open my screen in any abnormal way BTW.  I decided to just JB weld the plastic back together and reinforce the parts that haven't broken yet, then loosen the hinges so that it will hold up on it's own but put less strain on the plastic.  I could send it in for warranty, but I'd be without a laptop for an undetermined amount of time, and even then the case plastic will likely break again.All I can say is my next laptop will be made of metal...  I wanted this laptop to last a good several years, but it broke in a month...  I'm still keeping it because the rest of the laptop is great.  But I don't think it's going to last me several years.", "Date": "December 7, 2012"}, {"Title": "its a christmas gift", "Author": "john Avery sr", "ReviewID": "ROAJCGQ6R03RX", "Overall": "5.0", "Content": "its a christmas gift wont be able to give a review till after christmas best i can do for now", "Date": "December 6, 2012"}, {"Title": "Agreat value for this computer.", "Author": "Fazeworld", "ReviewID": "R1P6AVPDZOXK6A", "Overall": "5.0", "Content": "I was searching the sale papers for an affordable notebook computer. When I saw one of interest I checked online for a better price. Amazon was the place. I found the computer that my family wanted at a great price! This laptop was the perfect choice for us. The Asus Mocha serves all of our needs. The built in camera is the first reason we chose it because of the abilty to Skype and stay in touch with friends and family.My son is in college and uses this computer for his class assignments. This computer is so lightweight and easy to use. We love our Asus Mocha. An excellent choice for all of my family's needs. Great price,quality,and it looks nice!", "Date": "November 26, 2012"}, {"Title": "Wish I would have waited...", "Author": "Phil Wildberger", "ReviewID": "R1I09GZP6Z3NW2", "Overall": "4.0", "Content": "I like the laptop for what I bought it for and I am able to share files with my wireless network which runs Vista.Could have got a little better deal if I would have waited to buy.", "Date": "November 25, 2012"}, {"Title": "Could not be happier!", "Author": "T. Stahl", "ReviewID": "R13TTR9RVN1HOQ", "Overall": "5.0", "Content": "For a bottom of the barrel laptop this thing just plain ROCKS!Bought another 4mb memory at time of purchase.Love the pebbled surface as it makes it very easy to hang on to. Don't bother with a 'skin' as I doubt it would work.The only complaint I can muster is it is a bit on the heavy side......but for the price I just do not think you can beat this.As others have reviewed, the touch pad can be finicky and it took several adjustments to get it right.The color is pretty cool in a world of black white and red laptops and tablets...Going to dual boot with Ubuntu.....bet it's a speed demon with Linux...:)", "Date": "November 18, 2012"}, {"Title": "Value for money", "Author": "Buchyke", "ReviewID": "R2CGYHA6E2LS0P", "Overall": "5.0", "Content": "I must confess that I was surprised at some of the negative reviews when my laptop arrived, everything worked so well out of the bag. The keyboard is so spacious and not cramped, I still type as fast as I used to on my old compaq and Dell and I don't  mistakenly hit the wrong keys, the sound output is quite loud and clear, the wireless was a constant 4 bars where my old laptops were fluctuating btw 3 and 4 bars. It does feel a bit plasticky but that doesn't mean it's not a quality laptop unless u plan on dropping it intentionally. I purchased it alongside the kingston RAM which is so noticably faster after unistalling the bloatwares. I think impatience and not knowing exactly what to do will cause a lot of people to return this laptop. I don't plan on playing games with this laptop cos I don't have the time so I can't comment on that, however it's a great laptop @ $400.", "Date": "October 26, 2012"}, {"Title": "Very Good Laptop!", "Author": "Jonas_M", "ReviewID": "R1CYNMWBCCEV64", "Overall": "5.0", "Content": "I bought this laptop from Amazon last Autumn and caught it on sale for $400.00, new, out of the box.  I have used Asus motherboards for years in my PC's and when my HP 510 laptop gave up the ghost I went with Asus, good choice.Rather than write zeros to the hard drive, or replace it with a new one I simply used my 64 bit Windows 7 disk and over-wrote the existing data on the drive with good results,  All the factory stuff is now gone and I have a near clean install.I cannot fault the Asus.  The battery life is remarkable, exceeding the factory specifications by about 30% and I never run the machine on low settings.The AMD quad core works well with the 4 gigs of DDR3 resulting in smooth operation and superior graphics.  I am not a Gamer, so my requirements are not as stringent.  Just a good, reliable laptop for daily use and I do use it regularly.Jonas Mannion", "Date": "October 9, 2012"}, {"Title": "Not living up to ASUS good name", "Author": "Twyla M Hennen", "ReviewID": "RD036URG044GG", "Overall": "3.0", "Content": "A bit disappointed, I have had to contact technical support three times about laptop issues. Three times the laptop has frozen. I end up calling for help and have to remove the battery to get it up and running again. ASUS technical support not very supportive, they make you feel as though you are bothering them. Was advised to send the laptop in for repair, crap with that, they most likely would have told me there was an issue with the user, not the laptop then I would have had to pay while I have only had the laptop for two months. I have an ASUS desktop and live it no problems in the four years I have owned it.", "Date": "May 9, 2013"}, {"Title": "Dead Charger After 1 Month", "Author": "violetmeade", "ReviewID": "RXRNMQX6DQ91J", "Overall": "2.0", "Content": "I gave this computer to my daughter for Christmas.  On January 30th, the charger stopped working.  The little light on the charger will no longer illuminate, so I know that it isn't the computer, just the battery.  Now I'm in RMA hell with ASUS.  I'm navigating a website with non-responsive java scripts, broken and missing links.To fix this, I am now having to spend an hour of my day dealing with \"on-line chat\", then I have to buy a box, pack the computer up, mail it to the service center, and wait 10 business days (probably from the day they get it, which will probably end up being nearly 3 weeks total) without a computer.It's a dead charger.  They could have sent me a new charger and I would have been back up in 2 days.  Now it's a half-day ordeal and 3 weeks without a computer.", "Date": "January 31, 2013"}, {"Title": "Don't be deterred by the brand", "Author": "KDawn823", "ReviewID": "R3U9HFXHMVG65L", "Overall": "5.0", "Content": "I was very hesitant to purchase an Asus, as I have never really heard of it.  But I kept thinking that it was such a great deal for the amount of storage, battery life, RAM, processor, etc.  I read so many good reviews that I just decided to do it, and I have not regretted it for a second.  It's got way more storage than my mom's Dell, is lighter, and has the full number pad...and hers was $130 more expensive than mine.  I haven't truly tested the battery life yet, I've just been using it around the house...but it seems good so far.", "Date": "October 26, 2012"}, {"Title": "Asus Laptop", "Author": "aighead", "ReviewID": "R1MMUGJXV70DCX", "Overall": "3.0", "Content": "I was looking for a good inexpensive laptop and after going around and reading a bunch of reviews I settled on this one for the price compared to the specs. The computer is not bad. I'm a bit disappointed that I didn't see much of a speed improvement over the Acer laptop I bought two years ago, but it's a little better. The ergonomics are ok. The arrow buttons and number pad are laid out a little strange and take some getting used to, I'm still not great with the small number pad but I'm getting better with practice. The keyboard takes some getting used to as the buttons seem just a tad off to the left and I'm still not up to full typing speed (oh and the enter button is already sticking a bit, this pc is only a few months old!). My biggest complaint is that I record a podcast and I bought this mostly to make recordings. The sound chip in this is terrible, and after searching around I've found a lot of other people with similar RealTek issues. Playback is fine but attempting to do any input gets wonky very quickly. The ports don't recognize that things are plugged or unplugged properly. I contacted Asus and their initial solution was to reformat and reinstall Windows. Again after reading of other folks having the same issues I determined that wasn't likely to help so I just spent 34 bucks on an external usb sound card. I just got it today but it seems to be working fine. Another bit of trouble I've had is the ethernet port doesn't seem to function properly. I went to setup an Asus wifi router which has you plug the router into the pc for setup. The router would never read as functional through the ethernet port on this computer. Luckily, I still have the Acer sitting around and used it's ethernet port to complete the router setup. I would have continued using the Acer but the video card got a bit screwy upon lightning hitting the house, and I needed a new computer with a properly working monitor quickly. Overall the size and weight are ok and battery life is good. This one vents out the side which I can't tell if I like or not. My Acer vents out the back causing my legs to get very hot and while this is a bit nicer it also often blows straight onto the power cord, which seems bad to me though it may never cause any problems. The cool wrist rest feature really seems to work, so that is good. The monitor is just ok, the viewing angles aren't great, but that's kinda what you get with a laptop. The trackpad is nice and the buttons feel better than the Acer. I would hesitate to buy another Asus product after getting this laptop. I did just get a Nexus 7, built by Asus, that I really like, so who knows... With this you are buying a cheap laptop and if I had it to do over I'd get another Acer instead.", "Date": "August 28, 2012"}, {"Title": "ASUS A53Z-AS61 15.6-Inch Laptop (Mocha)", "Author": "Tre Sten", "ReviewID": "R86IAKBKINMFM", "Overall": "4.0", "Content": "I would have given it a 5 star rating but the 2 key jams time to time overall its a good product it arrived on time and it works fast I would definitely recommend it a pretty good Laptop", "Date": "May 21, 2013"}, {"Title": "Not all funtioning", "Author": "Carl D. Lindgren \"2FO2BB\"", "ReviewID": "R107LETS44610B", "Overall": "3.0", "Content": "unit arrived with internal wi fi adapter non functional, and an after market adapter plugged into one of the three USB ports.unit functioned OK otherwise.", "Date": "February 9, 2013"}, {"Title": "Power cord failed after less than 3 months", "Author": "Durdle", "ReviewID": "R3KUC38HKSI7DC", "Overall": "1.0", "Content": "The power cord failed and quit working after less than 3 months. I contacted the company who told me I had to send the entire laptop in and it would take over 30 days to get it back. I am an online seller and can not go without my computer for that long. I was also told I would have to pay for the shipping back to them and return- even though it is a warranty covered item. Or I could just buy a new power cord myself. I will not be a returnign customer to ASUS", "Date": "January 24, 2013"}, {"Title": "Disappointed. Wouldn't buy again.", "Author": "Candace", "ReviewID": "R3P3YG7PQT31AX", "Overall": "3.0", "Content": "For anyone looking to be slightly excited about a laptop purchase, I would keep looking, especially if you have a technical background or interest.  I purchased this to replace a awesome work-issued Lenovo, since being laid off.  Since I didn''t want to spend the $1100 to replace it, I thought I would look around for something affordable but not too disappointing.  I took a chance, and I just feel very meh about this.  I love asus and would probably buy one of their higher-end models.Pros:-It gets the job done for basic home computing. For the specs, I would say it's worth $350 at most.-It's not glitchy, the processor is fast and stays cool, and performance of hardware 'under the hood' is satisfactory.-Videocard is great.Cons:- Resolution is horrible - 1366 x 768 - I thought would be okay for me, but it's really unclear and hurts my eyes.- Speakers/Soundcard: Highly lacking.  I don't just mean sound isn't quality, I mean I can barely hear things even at max volume.Keyboard- This is so frustrating. It has a 10 key, but there is no space between that and the regular keyboard, so it throws off your typing if you happen to be off-centered at all.  You have to press really hard on the keys and the 'n' often doesn't work.Mouse:  This is a horrible touch pad.  It is completely unresponsive and often my hand will swipe and select things I don't want and I will end up loosing whatever I may have been working on.  I have troubleshooted this several times, including trying to find other manufacture's drivers, but it's just not functioning as it should.  The tap is unresponsive and in general, very frustrating.I'd keep looking and def don't pay over $6.", "Date": "January 21, 2013"}, {"Title": "Meh", "Author": "YLG", "ReviewID": "R3MUTBWQ75YC7K", "Overall": "3.0", "Content": "It gets the job done. Nothing to shout about. I would not buy this again if I had the chance.", "Date": "January 6, 2013"}, {"Title": "Okay laptop but has problems", "Author": "Jason DeVoe", "ReviewID": "R34CHOQZHMDNC3", "Overall": "3.0", "Content": "Biggest problem is that the backlighting on the screen doesnt come back up about half the time when the computer is woken from sleep.  It is also a little light on battery life compared to what I expected.  Some programs seem to stall out - programs that I dont ever remember freezing up on previous laptops.UPDATE - After about two months, I had some kind of accident and the screen was broken.  I found out after researching that ASUS has a one year free replacement for user damage.  This is obviously pretty awesome.  They repaired the screen and sent me back my laptop within one week.  Very nice service.", "Date": "November 23, 2012"}, {"Title": "laptop good, but the charger no (cargador dañado)", "Author": "maria", "ReviewID": "R2YGIDDJ3ZSL6E", "Overall": "3.0", "Content": "On the laptop everything works fine, but I RECEIVED A DAMAGED CHARGER.. the laptop it has good design and responds well to any requirement,  the storage unit dvd is a little loose, it moves slightly", "Date": "July 8, 2012"}, {"Title": "Warehouse Deals not worth it", "Author": "Ben Hoag", "ReviewID": "R11VV062MK9P00", "Overall": "1.0", "Content": "The product was delivered with none of the original packaging, rough, dusty, and obviously not handled with care. This is clearly returned merchandise that was wiped clean with a refurbished install of win 7. Many of the \"F\" function keys simply do not work on the laptop including the mute and volume adjustment keys... I purchased the additional 4GB Kingston Ram to improve speed when running multiple programs -- yeah right. The computer is terribly slow if I run anything other than chrome. I have been very unimpressed with the computer and wish I would have just purchased it straight from manufacturer or a higher grade model. The only pros are battery life and refund of my 1 day shipping charge when amazon couldn't deliver as promised.", "Date": "August 3, 2013"}, {"Title": "Not worth the risk", "Author": "sarah", "ReviewID": "RBG6H8S1CIZPF", "Overall": "1.0", "Content": "I really wanted to love this computer. After my trusty Dell Studio laptop stopped working, I did a lot of research. I figured that since I don't do anything too sophisticated with my computer (no gaming, no heavy computations, no video editing or really even music playing), I could use something with just the basics. This computer had great ratings and seemed like a steal for the price, so I went with it. From the very beginning it was slow. I really only use my computer to surf the internet and type up documents for class, and it was slow with these very basic applications. One night, not even two months after purchase, I shut the computer down to finalize some updates (automatic Windows updates, mind you). Before shutting down it said it was applying the updates and not to turn it off. Standard. Except that it continued to do this for several hours, although the progress bar froze at 16%. Finally it powered itself off in the middle of the updates (even though it was plugged into the wall). When I attempted to reboot, it gave me a blue screen. It told me to uninstall the updates by booting into Safe Mode. Except that it wouldn't allow me to boot into Safe Mode. I tried booting from a Windows disc and from USB-- no luck. I passed it along to my friends in the computer science department and they couldn't fix it. It doesn't help that Asus's website is pretty terrible as well, and that you practically have to jump through hoops to access the information you need to. At one point I filled out a form with all my computer's information and the registration number on the bottom, pressed submit and the website changed entirely to an Asian language rather than giving me the page I wanted. I was in disbelief. I had registered the computer for warranty the very night it was delivered, but when I finally got in touch with an Asus rep through the website, he or she merely gave me some poor instructions to try to restore the operating system and said they could not replace it or offer a refund. At the same time, Amazon was telling me that I would need to have the computer serviced under warranty by Asus and they couldn't replace it. The entire thing was a mess. I am fairly certain that I received a defective unit (because the computer is so well-rated by others), but to me it is simply not worth the risk. In the event that you get a defective laptop, you will have to bend over backwards to send it back, will have to interface with Asus' horrible website, and will be told conflicting stories all along the way. Eventually Amazon took it back (but only because I had ordered it during the holidays and had an extended return window) and refunded it. Thank god. I'm pretty sure I'm going to buy a MacBook Pro now, simply so that I can be guaranteed in-person, competent service in the event that something goes wrong.", "Date": "February 4, 2013"}, {"Title": "Never buy an ASUS", "Author": "J. Fisher", "ReviewID": "R3TF6KTILHHER1", "Overall": "1.0", "Content": "I am a computer technician and have absolutely had it with ASUS. I have 2 friends this year that purchased ASUS products. This was one of them. Both of them have been met with world class epic failure for technical support or customer service. If you buy this product, pray with every ounce of your being that it works out of the box because if it doesn't, you will be out of luck. Don't buy this product. Move on!", "Date": "October 15, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007MW13PA"}}