{"Reviews": [{"Title": "Works as Expected", "Author": "SwiftHex", "ReviewID": "R1W994WNT7MCTN", "Overall": "5.0", "Content": "I bought this from Lenovo's site about 6 months ago. It's worked out of the box, and has worked since. The package was shipped from China and took 2 weeks to come. One thing that was difficult was the drivers for adjusting the brightness. This did not come with an OS DVD on it. I'm not sure if it had one on the hidden partition as I formatted my drive with a fresh install of win7. I did backup my laptop into an image file before that. Make sure you download the network drivers on Lenovo's site and copy it on a usb flash drive or somewhere where you can get it after if formatting your harddisk. This laptop came with other software installed and I wanted to make sure nothing was on my system. I saw another post about not working when ordering from Lenovo. If your system does not work when you first get it, return it right away.", "Date": "November 11, 2012"}, {"Title": "Awesome compared to other alternatives", "Author": "Gabriela Proano", "ReviewID": "R2Q563578OPU2G", "Overall": "5.0", "Content": "Got it after going trough a lot of other brands. After a partner show me his, I wanted one. Awesome screen, awesome processor, nice video card, I use a lot of ilustrator and photoshop. This machine runs it really well, no complains with the factory specs. The most impressive thing is the battery, 5 hours in the lowest brightness level. Cooling is quite good too, no heat trough the palm rest, and its quite light too. All in all, good purchase. Cons, well not many really,maybe the charger gets a little hot, buy is quite small too.", "Date": "October 18, 2012"}, {"Title": "Dead on arrival, lousy support", "Author": "Arrr", "ReviewID": "R3BC0BTJO1ZU3S", "Overall": "1.0", "Content": "I was looking for a cheaper alternative to replace my aging MacBook Pro.  Fully understanding that I wouldn't be getting as high a build quality as an MBP (and hoping to save a bundle of money in the process), I pulled the trigger and ordered one of these.  It arrived dead, complaining there was no bootable device.  This probably happens a lot, because the packaging LeNovo uses is absolutely pathetic.  The laptop was shipped in a very flimsy box with the computer wedged in between a couple small pieces of styrofoam on either side of the notbook.  That's it. I'm pretty surprised that the computer didn't arrive with a few dents the way it was packaged.  Anyways, I called Lenovo support, and spoke with a gentleman who took my details, provided me a case number, and then attempted to transfer me over to another department for an exchange.  I was then bombarded by advertisements for a free $25 supermarket card and a free gas gift card by an automated system, then disconnected.  Confused by what had just happened, I called back the number I was given in case of disconnect and got the same advertisements.  It appears the LeNovo rep not only gave me the wrong number to call, but also transferred me over to the wrong number.  I called back the main support number, and spoke with a different guy.  He gave me a different number, and then transferred me.  While trying to enter in my number to the irritating automated system I was disconnected again.  I tried calling back the new number I was given, and it just rang forever with no answer.  So for the third time I called the main support number and actually ended up talking with the same person again.  He apologized and tried to transfer me in directly to the correct department, but was unable to do so.  Instead I was given yet another number to try.  By this point I had received a dead computer and wasted an hour just trying to talk to the right person.  Maybe the dead computer was a fluke, but there is just no excuse for the joke that LeNovo calls customer service.  Anyways, after an hour of a half of my life being hung up on on and waiting on hold, I had completely lost faith in Lenovo.  If this is the level of support offered to someone who was shipped a brand new dead computer, what is a regular warranty service call like?  When I finally spoke to someone who could help me, I said if you cannot ship me a replacement overnight then I would like to return the computer.  She said they do not ship replacements overnight.  I got an RMA number, sent the dead laptop back, and will be taking my business elsewhere. Hopefully they Lenovo won't botch the return like they have everything else.Update #1 7/1/12: Yep, they botched it, why am I not surprised? I ordered a bluetooth mouse with the computer, and it was set to ship a week or two after the laptop shipped.  When I told customer service that I wanted a refund on the defective laptop, the rep assured me that the mouse order would be canceled.  Well, I just received shipping confirmation on the canceled mouse order, and my credit card has been charged.  I'm still waiting for my refund on the laptop as well.Update #2 7/9/12: For those who are wondering, the computer was purchased through LeNovo's website, not Amazon. I really, truly wish I had bought this through Amazon, because I would have had my refund and been done with this weeks ago. If you must buy a Lenovo, go through Amazon or a retailer who has a reasonable returns process. I am just posting this review on Amazon for the benefit of others.  As of today I still have not received my refund from LeNovo for either the laptop or the mouse.  Last week I filed a complaint with the BBB. I received an email from the \"Customer Advocate and Complaint Resolutions\" department about 3 days later, but when I try calling the guy who emailed me he is never there.  Going though Lenvo \"support\" is a hopeless endeavor.  I sure hope Lenovo is enjoying the interest free loan they took out on my credit card.  What a racket!Final Update: Things got much better once the BBB was involved.  I finally got my money back after a month of waiting.", "Date": "June 21, 2012"}, {"Title": "bad customer support  :(", "Author": "Ozgur Bozkurt \"ozzie\"", "ReviewID": "R16H15DNF7PYX0", "Overall": "1.0", "Content": "unfortunately I did not get to test this computer at some local store and got an idea about the screen quality before I bought it.on paper this computer has excellent specs for its size!!!! but the moment I turned the computer on, I noticed that the screen is very dark, and the colors off  :(  I played with the settings for hours and it did not help. I connected the computer to a monitor to see if it is the screen or the graphics card etc.  In a nutshell I concluded that it is the screen. I called the lenovo customer service, and after an hour of connecting to the computer and running tests remotely, I was told that \"it is a new computer, with a new screen. it just comes with that (strange) coloring and brightness, and there is nothing they can do about it\" . I sent it back to the seller, and lost $200 in the transaction for shipping and restocking fees etc.1- the screen that all y480 series come with, it is the cheapest screen I have ever seen2- if it was a faulty screen, then it was the lamest customer service I have ever experiencedother than the cheap screen it is a good computer ... if the customer service was helpful or if they could replace the screen I would have kept this computer. it has excellent specs for its size, but cheap screen coupled with cheap customer service made me change my mind about lenovo.It seems like PC companies are lowering their standards and competing with each other to produce the flimsiest disposable computers ever ... Unless you want a disposable computer, I would not recommend lenovo (except thinkpad series), hp, dell, compaq, asus, and even sony!!!", "Date": "February 9, 2013"}, {"Title": "Very Poor Support - BIOS also has a whitelist disabling upgrades", "Author": "Sachmo", "ReviewID": "R3SQKMSFD54CBC", "Overall": "1.0", "Content": "I bought this laptop, and at the same time purchased an SSD with the intent of upgrading the hard drive.Despite many attempts I could not install windows 8 with a clean install on the SSD.  I contacted Microsoft support and their team spent no less than 4 days attempting to install Windows onto the SSD with the brand new Y480 Ideapad.  After 2 days, the call center assigned me the best technician available at a tier 2 level of support.  The tier 2 technicians routinely perform about 10 Windows installations per day.  They usually take the most difficult install cases.  Using remote applications, they virtually monitored the entire install until boot.  They ultimately could not install Windows 8.  They concluded that the issue was my Lenovo laptop.I contacted Lenovo support.  I was continually disconnected from calls after waiting on hold for long periods of time (this happened 3 times).  Despite taking my phone number, none of the employees that I worked with called me back.  I escalated support to two supervisors and to the manager of the customer support - literally the person that sets procedures for receiving calls.During my calls, I discovered that there was a known issue with the Lenovo BIOS preventing users from making Windows 8 installs.  Despite acknowledging this, I was not offered any support or suggestions as to how I could solve the issue with the BIOS.  I was told that to receive any more assistance, I would have to pay for premium support from the software team.  The hardware staff was rude and not at all interested in actually supporting the Lenovo product.While this was going on, I read online forums and discovered a 'whitelist' maintained by the BIOS that only allows certain system configurations.  Based on my readings on the internet, I believe the whitelist limits upgrades to the wireless chip for example, to only a few manufacturers / products with a particular serial number.  Any other upgrade will not be integrated correctly by the system.  A forum even posted a non-whitelist version of the BIOS - though this is out of date and crashed someone else's computer.I speculate that the whitelist also has Windows activation codes that prevents clean installs of windows on the machine.Overall, this was a very frustrating experience.  Though I was never able to install Windows 8 on the SSD, I was able to use imaging software to backup and restore the HDD onto the SSD and essentially clone the hard drive (Not at all a straightforward process, I think due to particular configurations of this laptop).If I had to do this again, I would not have purchased this laptop, though it is very reasonably priced, and has great hardware...  The reason to buy from a large brand name like Lenovo (or anyone else - Dell , Toshiba , Apple, etc) is that when things go wrong, they support the product.Well the support is lousy.In the future, I would go with a small business laptop builder based on the internet.  Though these companies are smaller and don't have name recognition, I am certain that customer support would be MUCH better, there would be no weird proprietary black lists on the BIOS - I faced a similar issue with a Dell workstation I bought a couple years back related to a CPU upgrade, and I ignored my own advice from back then...  Generally small custom builders companies tend to be priced reasonably as they don't have a name brand to back them up - they may sell 'Sager' notebooks for example.  The name brands are irrelevant though, because all the internals are literally commodities.  And I would rather use a Sager motherboard without any tampering of the BIOS than a Lenovo / Dell computer with proprietary crap added to 'differentiate' their product.In the end, since I got the darn thing to work, I kept the laptop with my SSD, but definitely not dealing with this hassle again.", "Date": "December 27, 2012"}, {"Title": "A nice overall package with a few blemishes", "Author": "Sean", "ReviewID": "RAISFCTTKRFT4", "Overall": "4.0", "Content": "After a year of owning the Lenovo Ideapad Y480, I have to say that its performance has more than exceeded my expectations. However, there are a few issues with this laptop that I'd like to share with everyone who is interested in either buying this product refurbished or second hand.First, the screen. How was Lenovo able to drive down the original price of this laptop while including top of the line specs? Answer: screen size and quality. The screen on the Lenovo Ideapad Y480 is more than adequate when it comes to doing most tasks, but I've found after a year of use that the screen is starting to wear out. Granted, I am not exactly your typical computer user. I use this machine for long periods of time, as my job requires it. I also use it as my main machine in general, so you could say I use it around the clock. I am a bit disappointed though that this has begun to happen. No laptop I've ever owned has shown that kind of wear and tear so quickly.Second, heat. This laptop produces a lot of heat. I've used multiple operating systems on this laptop and most end up with the same result: high temperatures. I make sure that the vents are clear of dust and the fan seems to be running on high all the time. I'm sure if there is anything I can do to fix this problem.What are the plus sides to owning this laptop? Quite a few. 8 GB of DDR3 1333 RAM, 1TB HDD space (at least for me, I bought one of the first models ever released), exceptional battery life (the first batch of machines had better batteries than later models.) and excellent build quality. Lenovo knows how to design ergonomically friendly laptops, and it shows in their Ideapad line.I'd recommend this machine to anyone looking for power on a budget. Lenovo's latest offerings may offer more graphically but the GeForce 640-LE can more than handle any game out there today. The small screen helps in that regard - games can't run past 1366x768, so you're bound to at least get decent FPS on most AAA titles.", "Date": "July 10, 2013"}, {"Title": "Excellent laptop for college", "Author": "Ruth53", "ReviewID": "R2KLX6TR80NMF5", "Overall": "5.0", "Content": "I use this laptop intensively to code, run scientific computation, browse and watch stuff. It is the whole package! The look could have been better but more than makes up for in reliability and performance.", "Date": "June 9, 2013"}, {"Title": "nice nice nice", "Author": "Glen A. Urbina Cespedes", "ReviewID": "R1HNYAQBNYW4QP", "Overall": "5.0", "Content": "this computer its amazing for the price! it runs game smoothly and the i7 makes it capable of almost anything, the only drawback is that it uses a 20gb SSD and an HDD, it's like a hybrid drive but no so fast as an SSD! if it were an SSD, it would be blazing fast ! you can't get a better deal! and the i7 is not a low voltage processor like most new laptops, so its a bit faster!", "Date": "May 17, 2013"}, {"Title": "Horrible Customer Support", "Author": "reks", "ReviewID": "RE1LWTU2S7PAK", "Overall": "1.0", "Content": "I purchased the Ideapad in September 2012 and after few days I noticed a portion of the screen cover was sticking out . I had to carefully close and open the lid fearing the entire screen cover might come out. I talked to the tech support guy and he told me that I need to send the laptop for repair and it will be done in 7 business days. This is the biggest mistake I've ever committed.. Believing his words. I had sent the laptop to the service center in Jan 2013 and since then i'm counting days.During the course of time I have made several phone calls to the support and all I hear is silly excuses. We don't know when you will receive your laptop and the thing that drove me nuts was they put my laptop on hold since the day they have received it. I was told I'd be getting a phone call from the service center to learn more about the issue but nobody called.Beware if you send your laptop for repair . Keep in mind the following.1. You will have to wait several days for the support center to work on your case.2. Lousy excuses from the customer service.3. You can only call the customer support to check the status of the repair. If you have any questions/concerns all they do is  send the request to the case manager and he will forward the request to the support center.4. You can check your status sure but you will not find any update.All you can do is sit and pray hoping you will get your laptop back someday.If you wish to endure all this you are at your own risk. For me I will NEVER BUY ANY PRODUCT FROM LENOVO IN FUTURE.", "Date": "February 11, 2013"}, {"Title": "Nice product", "Author": "Yumei Hou", "ReviewID": "R2JJYQGGAPD9R5", "Overall": "5.0", "Content": "With its I7 processor, my son was having lots of fun playing on, ine games. I am happy with its performance as well, great value for the price.", "Date": "January 16, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel core i7 Processor 2.3GHz (6MB Cache)\n8 GB DIMM RAM\n750 GB 5400 rpm Hard Drive\n14.0-Inch Screen; NVIDIA GT640M-LE 1GB DDR5 Graphics\nWindows 7 Home Premium 64-bit, 3.5 hours Battery Life", "Name": "Lenovo Y480 20934FU 14-Inch Laptop (Dawn Grey)", "ImgURL": "http://ecx.images-amazon.com/images/I/317GWMEqFpL.jpg", "ProductID": "B007CL3AZC"}}