{"Reviews": [{"Title": "decent computer, decent price", "Author": "twitchoh", "ReviewID": "RTZEUOXE7QMP3", "Overall": "4.0", "Content": "ive had this computer since February, and i gotta say it has impressed me, though the processor is kinda lacking, it is a pretty sturdy little machine, and it gets FANTASTIC battery life, my only real complaint is that the network card likes to fail at completely random times, probably an isolated incident, as ive never heard of any of these doing that, but over all, for the price, this is an impressive laptop, i like it alot", "Date": "November 25, 2012"}, {"Title": "Avoid at all costs", "Author": "Amna Malik", "ReviewID": "R1HCOKHQS2RS6X", "Overall": "1.0", "Content": "I've been using laptops and desktops of all makes, shapes and sizes for the past 13 years and this has to be one of the poorest built laptops to ever be sold under the HP brand. Out of the box this laptop is inconsistent and crashes often. The software issues are on a whole other league of terrible.", "Date": "May 20, 2014"}, {"Title": "A great computer at an affordable price", "Author": "Selina", "ReviewID": "R2E2ZMEO6BN602", "Overall": "5.0", "Content": "It is a great computer at an affordable price. Everything works great so far and I have nothing to complain about yet.", "Date": "March 8, 2012"}, {"Title": "infuriatingly slow", "Author": "Al", "ReviewID": "R1ZUQ1JQXEGBUD", "Overall": "1.0", "Content": "this is the slowest computer I have ever used. Worthless for anything more than word processing, or simple spreadsheet. Opening pages, or control panel panes or just about anything results in painfully long delays. I have given up on hp products, as I have seen a steady decline in quality over the years. Invest your hard-earned dollars in a comparably priced Lenovo for a much better value.", "Date": "November 21, 2012"}, {"Title": "loveeeeeeeeeeeeeeeeeeee", "Author": "victor", "ReviewID": "R1X2YC8FEJHUPX", "Overall": "5.0", "Content": "muy buena la maquina es rapida ,y es bonita no tan pesada y ademas excelente precioooo 100% positivo el vendedor", "Date": "January 12, 2013"}, {"Title": "Slower than a tumbleweed on a calm day", "Author": "Matthew R. Lemons \"ML\"", "ReviewID": "R3R23JIGBYKWI8", "Overall": "3.0", "Content": "We purchased these for the teachers at our school.  As the IT guy I got to put our software on them.  Windows 7 is already a challenge for those who aren't tech savy so that aside while setting these machines up for use lets put it this way.  As I said in the description.  Slower than a tumbleweed on a calm day.Save your money and your sanity.  HP missed the mark once again.", "Date": "April 11, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "AMD Radeon HD 6310 Discrete-Class graphics, 15.6-inch diagonal HD BrightView LED-backlit display (1366x768)\n10/100 Ethernet LAN card with 802.11b/g/n WLAN\nFull-size keyboard with touchpad with on/off button\nDigital media card reader for Secure Digital and Multimedia cards, 3 USB 2.0, 1 VGA, 1 RJ-45, 1 headphone, 1 microphone\nIncludes HP Webcam with integrated microphone, 6-cell 47WHr Li-ion battery", "Name": "HP 2000-417NR 15.6\" Notebook (1.3 GHz AMD Dual-Core E-300 Accelerated Processor, 4 GB RAM, 500 GB Hard Drive, SuperMulti DVD Burner, Windows 7 Home Premium 64-bit) A7A75UA#ABA", "ImgURL": "http://ecx.images-amazon.com/images/I/317yDoBcXgL.jpg", "ProductID": "B0078C025G"}}