{"Reviews": [{"Title": "Dont buy it", "Author": "jeannine r turner", "ReviewID": "R2FA3Q9SG4V14T", "Overall": "1.0", "Content": "Full disclosure. My laptop specs are slightly different but very close. E420 Intel Core i3-2310.  CPU 2.10. 4GB 64-bit.  The problem..the laptops die with no warning.  We purchased several for the office in early 2011. Thus far 3 have died. They made it thru the warranty period and started dying soon afterwards. No ability to recover data from hard drive. If you only need it to work for a year... No problem. Very frustrating indeed", "Date": "November 3, 2012"}, {"Title": "Good laptop while it worked", "Author": "Tory", "ReviewID": "R2Z7VGX3NQ2B1Z", "Overall": "1.0", "Content": "I had the E420s with the i5 bought right from lenovo. 3 days after the warranty expired the laptop just up and died. I have taken it apart but was not able to find the issue... $700 down the drain. Do not get this laptop unless you need it for ONLY 1 year.", "Date": "October 23, 2013"}, {"Title": "Motherboard problems after warranty expires", "Author": "annoyed customer", "ReviewID": "RCL33HENSY648", "Overall": "1.0", "Content": "Do not buy this laptop.  I have only had this laptop for a year and just a month or two after the warranty expired, the laptop started having problems.  Randomly, the laptop will turn itself off and on for no reason.  It turns off, a few seconds later it turns on, few seconds after that it turns off again, and so on.  It can take me up to an hour waiting for this to stop so that I can just turn the laptop off!  I have taken it to several different places to see what's wrong and it is conclusive from all those places that the motherboard needs to be replaced.  I went on the website to see if I could send it in and get it fixed by them without the warranty (I bought the laptop from the lenovo website).  I went around in circles on that website trying to figure out how I could get them to fix it (I was more then willing to pay the cost without the warranty).  No luck.  I have learned that lenovo is a pretty awful company and I strongly suggest never buying from them unless you are ok with a laptop that only lasts a year.  Now I will have to spend even more by paying a someone to fix it or buy a new laptop.", "Date": "December 20, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core i3-2330M 2.20GHz, Intel HD Graphics 3000\n4GB DDR3 1333MHz (8GB Max)\n320GB HDD (7200RPM), DVDRW\n14\" Display, 1366 x 768 HD anti-glare LED backlight display\nWindows 7 Professional 64-bit", "Name": "Lenovo ThinkPad Edge E420s 14\" Notebook PC i3 2.20GHz 4GB 320GB DVDRW Win7 Pro 4401-5GU Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/31FjcmaCd3L._SY300_.jpg", "ProductID": "B0076A209G"}}