{"Reviews": [{"Title": "Mac Book Retina", "Author": "Sarah", "ReviewID": "RJPBFINEB6DI5", "Overall": "5.0", "Content": "I am not an apple junkie. I hate the iPhone and the iPads and find them to be outdated technology. Be assured I'm not an Apple cult follower who will tell you everything Apple has ever made is a piece of gold.Now, on with my review.I used to be a PC user. I know Windows 7 inside and out. My old laptop was just getting outdated and weighed no less than 8 lbs and was getting heavy to carry back and forth from school. I intensely dislike the windows 8 interface but I didn't want to be stuck behind on an old OS either. My father turned me on to the Apple Macs and I am glad he did.The screen is beautiful. As a Windows user that was always something I envied. This retina is supposed to have a 30% less glare than the MacBook pro without Retina display. I can't say I know for sure (because I don't have a previous macbook to compare it too) but I haven't had a problem with glare.The overall physical quality of the product is outstanding. Nothing feels cheap, no pieces that don't belong. It's a very attractive piece of equipment and it feels like it will last me a few years.The Solid State Drive (SSD) is no joke. I read some other reviews that say there is lag and I think they are crazy. This computer doesn't hesitate to do anything I ask it to do. 8gb of RAM is more than I have had on any other computer and it easily handles everything. I'm not a gamer or a high tech junkie but I do expect my computer to perform quickly and flawlessly. This beast far surpasses my demands. 256 GB may or may not be enough memory. I have had the computer for about a month and have a little under 200 GB left. The only downfall to this computer is that YOU CANNOT UPGRADE THE RAM. The RAM, mother board, and battery are all soldered to the chassis. That means any modifications will destroy the computer.Another small issue, but easily fixed, is there is no ethernet connection. I'm well aware that wifi is now keeping up with the wired internet, but I do find the wired connection much more reliable and much quicker when downloading big files. A $30.00 adapater is needed (which I have), but it is still something I would have liked to have been actually on the laptop itself.The computer weighs less than 4lbs and my back thanks me.The battery life is astounding, but like I said I'm coming from an outdated laptop in which 3 hours was a generous battery life. 7 hours of HEAVY use is much more than I could ask for.This computer also comes with some cool features. I really dig the keyboard backlight. I've never had a computer with that before and I do find it really helpful. The facetime camera is also of excellent quality.If you buy this computer from Apple (I bought mine in July, maybe its running through August 2013) as a student they take $100.00 off at the store and give you a $100.00 itunes gift card. I used this gift card to purchase things like pages, keynote, and numbers. The service I received at the Apple store was phenomenal and I got an excellent deal on this computer.Overall I love this computer. I went all crazy and cased it up and got ridiculous unnecessary accessories (like a keyboard cover) but it's all because I love my Macbook pro. While the price tag may be eye-popping, you are getting your money's worth out of it.UPDATE:I've been using this computer about 2 months now for various activities like school work, video viewing and surfing the internet. This computer leaves me with no wants. The battery life is awesome and I do not worry that I need to bring my charger to school just in case because I know it will make it through the day.I have also found that while viewing videos for about half an hour or so (like workout videos), it only eats about 5% of the overall battery life with brightness on a good setting.Now here was something I found interesting. If one were to shop around for a comparable computer, such as an Asus or Samsung, one would end up paying almost as much as you would for this MacBook Pro. All the computers I've looked at all have touch screen (a feature I do not want) 4GB of RAM and about the same SSD storage. I'm sure those are quality computers, but I really dislike the Windows 8 interface.I still love this computer and expect to keep loving it as I use it more and more.", "Date": "August 16, 2013"}, {"Title": "AAAWESOME!", "Author": "Bruno Terra", "ReviewID": "R1QSUKBHOA9CGG", "Overall": "5.0", "Content": "I was a PC user for all my life, this was the first time I decided to buy a Mac and I was a little bit scared by the OS but really ... this laptop its simply awesome! Works perfect, fast and smooth! If you are an active pc gammer DO NOT BUY THIS LAPTOP I do play some games and this its the main drowback of this product for me (I knew it before buying it  so ... im not going to take off a star for it!)If you are a software developer, designer, musician or anyone who need a really strong fast performance for work buy this!If you are like a internet browsing person... do not do the investment in this laptop, you can find something cheaper that will do the job.", "Date": "August 14, 2013"}, {"Title": "Macbook Pro 13 Retina vs. new Air 11", "Author": "A Customer", "ReviewID": "R36NYVW0YRFQV6", "Overall": "4.0", "Content": "These reviews really helped me when I was figuring out what to buy, so here are my two cents. I couldn't figure out if I wanted the Pro Retina or the Air, and I wasn't sure if I wanted 13 in. or 11 in. Now, I actually own both the Macbook Pro 13\" Retina and the new Macbook Air 11 inch, and I understand most people won't want to buy both but these are my thoughts. I first got the 13\" Retina, because I loved the screen, esp. the way text looked because I read a lot and it made such a difference. I have the i7 version, plus the 8 GB RAM, and 256 hard drive. I love this thing. It's gorgeous and fast, a pleasure to work on. BUT. The only problem with it for me is the weight. I know it's lighter than it used to be but I'm petite and when I'm traveling and need to give presentations, this thing is in my bag the entire day, and I find it heavy. Many people may well be stronger than I am but I personally find it a pain to drag around when I'm on the road. Also, the battery life is good but not brilliant, so if I use it all morning and a part of the afternoon unplugged, it's dead.So I recently bought the 11 inch Macbook Air as well, the new version, also maxed out, i7, 8 GB, etc. That thing is so light, it's amazing. It is lightning fast and the battery life is incredible. I can use it and use it and the battery won't budge. However. The screen is so much less good than my Retina Pro. I'm not a picky person and before I got used to the Retina screen, I didn't mind but now, it's a huge difference. The text is pixelated and very small, the whole thing looks much less good.Basically, I think that if you're going to be mainly stationary when using the laptop, I would definitely go for the Retina Pro 13 inch. At home, it's all I use nowadays. It's a joy to use and looks amazing. However, if you travel a lot and will mainly be using it on the go, I think the new Air is fantastic.  I hardly notice it in my bag and the screen is fine, just not as beautiful as the Retina, plus the performance and battery life are incredible. If the weight and shorter battery life of the Retina doesn't bother you, that would be the clear choice.", "Date": "August 29, 2013"}, {"Title": "Good design, Bad performance", "Author": "Yano", "ReviewID": "R2D6HEZW2U4KHQ", "Overall": "3.0", "Content": "Luckily I was able to get this model on educational discount with tax exempt, but the price tag is still too high for the performance.The MD213LL/A model with a 256GB SSD is selling for $1499 now and that's probably the best value for the 13\" retina models. The 3210M and 3230M intel processors differ less than 5% in performance. The only trouble with the older model is the screen burn-in issue that may be present in a large batch. On this current model, the burn-in is not noticeable unless you go all white from a high contrast still image, then there is still some minor burn-in. But other than this minor annoyance, the screen looks amazing in terms of details and color saturation.Intel HD 4000 on a 3230M is a joke for a 2560x1600 screen. It will play movies and do some light design work, but anything a bit advanced causes problems. Even AutoCAD 2D work and Photoshop CS6 presented display problems in multiple instances for me. This should really be a Macbook Retina, not Pro at all.A few years back, Intel barred Nvidia from making Northbridge chips for Intel which included an embded NVidia graphics chip, so now Apple has to put 3 large chips in a Macbook Pro for it to have discrete graphics. This is very sad. The Intel HD 4000's performance on a 3230M chip is at best on par with a NVidia 320M. I would have been VERY happy if the 13\" model had even a 630M graphics chip, not to mention one of the new mid-range 700M series. It would have made this little laptop almost PERFECT! The price tag then wouldn't be so unjustified neither.I use many Windows applications, Bootcamp with centralized drivers allowed me to install Win 7 on it hassle free and runs as it should.It really depends on what you use this laptop for. For everyday internet browsing, documents and typical use, this laptop will run very nice for you. For design work, heavy processor usage or ANY graphics intensive applications, this laptop is a major disaster. For gaming, steer away completely.UPDATE: The newer batch of the 2103 MacBook Pro 13\" Retina does not seem to suffer from image burn-in at all. A burn-in test revealed no ghosting at all (as of April 30th). Apple seems to have silently resolved the issue in production.", "Date": "April 3, 2013"}, {"Title": "Slim and Ultra-responsive and brilliant design", "Author": "Neftali Palma", "ReviewID": "REL2C2I5GWQOC", "Overall": "5.0", "Content": "The retina display is amazing as far as doing everyday tasks with so much detail to each application. I started out with the 15inch cMBP w/ i7 Core and 8GB RAM and 750 GB HDD with nVidia discrete graphics card. I took it back the week after because 1. 15inch is getting less exposure for day-to-day tasks such as: browsing, editing, and recording. 2. The larger screen with all the bells did not look as well as the retina 3. Retina is getting to be where the future is. I thought I needed the 15 or 13 with optical drive now that I have used my 13 I realize I do not use it as much as I thought I would. I love this Notebook it is so portable yet very powerful and can handle multiple tasks that are more typical of your average laptop user.", "Date": "February 26, 2013"}, {"Title": "My First Mac Experience !!!", "Author": "C. Murphy \"Oak Customs\"", "ReviewID": "R1CP2HWNMOPXN0", "Overall": "5.0", "Content": "This is the first Mac that I've ever used or put my hands on.  The display is really amazing. After a month or so with this I'm starting to dread photos and text on displays that have less resolution than this one has. The Solid State Drive and 8 Gigs of RAM let this thing run quite fast through software programs, and start up takes about 27 seconds from an \"Off\" state, to up and running and connected to my homepage on the internet!  This thing is a real pleasure to use.  The transition from PC to Mac hasn't been as hard as I thought it might be, but there are differences.  I have one regret in that, I travel, I use mapping extensively.  I enjoy maps at my disposal, and have used Delorme Street Atlas USA for over 20 years.  That isn't available for this machine, and a good solution that would replace it with all of it's features is still lacking.  Don't tell me about Google's or other online mapping.  Delorme has always been more accurate, feature rich, and the standard that all others should judge themselves by!  I really do WANT a great mapping software for the Mac platform.  Other than that I've found the move to my Macbook Pro Retina, to be a good move and hope that it will only get better going forward.  Cm_", "Date": "April 21, 2013"}, {"Title": "AWESOME PRODUCT!!!", "Author": "Teddy Bullock \"Teddy Bullock\"", "ReviewID": "RGU6X1N3JZQ5F", "Overall": "5.0", "Content": "I was afraid about the battery life of this product. The previous Macbook Pro 13\" claimed 10 hours of battery. This one only claimed 7, but I found that the battery life was about the same! It said I would get about 14 hours on a full charge when I'm not doing much. Also, people said it was laggy and had problems with scrolling and other stuff and I was worried about that. NO PROBLEMS WHATSOEVER. This product is WAY faster than my last MacBook Pro and has NO lag, and my last one didn't have much. I do some pretty intense video editing and also some pretty intense gaming. This held up NO problems at all! I probably wouldn't put the video graphics settings on full unless you have that dedicated graphics that the 15\" has, but this thing does it's job no doubt! Battery life amazing as always, and graphics and processor amazing! I had no problems and 100% satisfied, and the shipping was great! Shipped sunday night and arrived thursday and I chose the free shipping. It was very sufficiently packaged to protect from transit. Great job, Amazon and Apple!", "Date": "July 18, 2013"}, {"Title": "Once you go MAC....", "Author": "M. Doyle", "ReviewID": "R2OWQNMWNIN2DF", "Overall": "5.0", "Content": "I am a iPad, iPhone, and iPod Touch user- but PC for laptop.I needed to get my own laptop after having to replace my PC laptop 3x's, so I wet with a toshiba win 8 laptop. Now my kids are at the age that they need PC's for school, so I wanted to get something just for me.In asking around almost everyone recommended a MACBOOK.After weeks of research and the advise that it would take a while to adjust to windowless format, I bit the bullet and purchased this MacBook Pro with Retina. I choose this model due to the Retina and excellent reviews.When I received it, I embraced myself for much confusion and a huge learning curve. Surprisingly though, going from Win 8 (which IMO is the most user unfriendly windows) to my new Mac was a breeze! No learning curve whatsoever, but maybe that's also because I'm so use to the iPhone and iPad.But I LOVE this. Really really LOVE this!!! I was concerned about the 13 inch screen size & lack of optical drive, but now I believe the size couldn't be more perspective for me- and so far the drive has not been an issue. And I always have the option of buying an external.If you are a MAC person- you will stick with a MAC. If you are a PC person, justify the price by knowing that MAC's last longer than PC's.You will not be disappointed- honestly!!Also- with Prime, this was the best price out there (free shipping) and is backed by Amazon's awesome return policy should there be any issues...", "Date": "May 18, 2013"}, {"Title": "Awesome packaging!", "Author": "Joshua Szanto", "ReviewID": "R3ISO07VBS4STS", "Overall": "5.0", "Content": "Co-worker is very happy and satisfied with the laptop. The Apple-packaging of the laptop is an incredible experience. It is no wonder why Apple products are liked.", "Date": "November 29, 2013"}, {"Title": "Excellent laptop", "Author": "Scott W.", "ReviewID": "RSLPW6KF9MBPE", "Overall": "5.0", "Content": "Very happy with 13 inch macbook pro. Excellent battery life, quick processor, easy to switch over from pc to mac.", "Date": "August 16, 2013"}, {"Title": "Best Laptop Ever!", "Author": "David Snook", "ReviewID": "R3TVNGZUXEO3AF", "Overall": "5.0", "Content": "I switched from a PC laptop.  The Apple product is much nicer in design and feel than my previous PC.  It took a bit to get use to the different user interface but now that I've gotten use to it I don't expect to ever go back.", "Date": "June 19, 2013"}, {"Title": "Performs flawlessly", "Author": "KL Diver", "ReviewID": "R2W07SISHT6G59", "Overall": "5.0", "Content": "Although overpriced, this machine has an incredible look and feel. This is the 6th lap top I've owned and is by far the fastest to boot up, has the longest battery life, and the best \"feel\" when typing. Performance is good for photo editing and the airdrop feature makes file sharing with my Imac straightforward and quick. If you are prepared to pay a premium for design and performance then you will be happy with this machine.", "Date": "May 11, 2013"}, {"Title": "GREAT LAPTOP SO FAR", "Author": "European Sales", "ReviewID": "R11BQFOG3ZOC27", "Overall": "5.0", "Content": "It needs more time in order to be correctly evaluated. Some features took a while before gettting accustomed to. I thought battery lasted longer but it goes for a good 5-6 hrs with normal usage e.g. no streaming, or other CPU-intensive tasks. Still it is impossible to understand if it mounts an SSD or not. It is quite difficult to get to that information through normal browsing.", "Date": "December 20, 2013"}, {"Title": "First Mac", "Author": "J. Lang", "ReviewID": "R3IENH9A7JTVGQ", "Overall": "5.0", "Content": "This is my first Mac and having the iPhone made it easy to use and get around. battery runs forever.", "Date": "August 30, 2013"}, {"Title": "Macbook PC with Retina Display", "Author": "Gregory A. Buss", "ReviewID": "R2PE83WIXQGQG8", "Overall": "4.0", "Content": "I'm in transition for a PC, but it's lightning quick and easy to work with.  Would recommend to anyone.  Little pricey though", "Date": "August 30, 2013"}, {"Title": "Gift for my wife", "Author": "Grant Jeffcoat", "ReviewID": "R2RQ5DE9OHGFM5", "Overall": "5.0", "Content": "Bought this for my wife for her birthday and she loves it. It arrived right on time. It was worth the money and is exactly what we were expecting.", "Date": "July 27, 2013"}, {"Title": "LOVE IT!!!!!", "Author": "Jennifer Marx", "ReviewID": "RDSHCJGC4OACZ", "Overall": "5.0", "Content": "Has added features that I like better then my last mac book pro. Absolutely love it. You pay for what you get!", "Date": "May 30, 2013"}, {"Title": "Awesome", "Author": "Pegalou \"Pegalou\"", "ReviewID": "R26BC75Y9U8WBM", "Overall": "5.0", "Content": "This laptop is very thin and light and works great.  The display is lifelike. Took me a bit to figure out the system as it is different than a PC.  I hope to use this for a very long time.", "Date": "May 2, 2013"}, {"Title": "Powerfull, very light and slim", "Author": "Sergio Danin", "ReviewID": "R2CF300BB3VSR", "Overall": "5.0", "Content": "As usual Apple products, very powerful computer, but incredibly light and slim. The Retina display is something amazing comparing to other computers is just ridiculous beautiful, with incredible colors and precision.", "Date": "June 5, 2013"}, {"Title": "It's just all i expected", "Author": "Juan Ignacio Saba", "ReviewID": "R1RC3R42U3YRX9", "Overall": "5.0", "Content": "Not much to say about this item. Apple stuff is just great and i was long wanting to have this.", "Date": "June 21, 2013"}, {"Title": "Best Ever!", "Author": "Luap", "ReviewID": "R2TCSB7NLSB5FG", "Overall": "5.0", "Content": "Comes with the worst instruction \"book\" ever. Phone support is best in the world. Julia should get a statue. Computer is the finest I have ever experienced. The new screen, the solid state drive and super-duper slim design are a perfect fit into my instantaneous matter transporter. Beam on....", "Date": "May 13, 2013"}, {"Title": "Love it!", "Author": "Alec", "ReviewID": "R24Y8R592XY7NH", "Overall": "5.0", "Content": "Just got this computer a couple days ago and so far it has been great with no problems! This is my first Mac and let me tell you I am LOVING it!!! It starts up in like 5 sec and when sleeping it wakes up as soon as I open the device. I would really recommend this product. You pay for what you get.", "Date": "March 17, 2013"}, {"Title": "Perfect replacement", "Author": "Alexandra Taylor \"enchanting_eternity\"", "ReviewID": "R22KAMW2A6SNCQ", "Overall": "5.0", "Content": "Love this laptop and the retina display. The one thing I would change? Get one with a drive already installed. It's annoying without one if you have software you still have to download.", "Date": "May 30, 2013"}, {"Title": "Great Computer", "Author": "Robert L. Baker", "ReviewID": "RJF34JROYLW3T", "Overall": "5.0", "Content": "This is my first Apple computer. I wondered about my decision since the cost is prohibited but thus far, I have really found that I do enjoy it.", "Date": "April 25, 2013"}, {"Title": "Exceeded Expectations", "Author": "Dan Cook", "ReviewID": "RH84AHDPZBSQ5", "Overall": "5.0", "Content": "Everything I hoped it would be. Exceptional clarity, speed, ease of use, etc... I would definitely recommend this computer for just about anyone.", "Date": "April 10, 2013"}, {"Title": "I like it", "Author": "Hui SUN", "ReviewID": "R3U6OGYU46SXL", "Overall": "4.0", "Content": "It is so fast, and clear.I like it. But I feel sorry, I must buy office for MAC and I can't use it for Chinese Bank Service.", "Date": "July 9, 2013"}, {"Title": "Thin", "Author": "SOB", "ReviewID": "R2CTTJHOKHOL26", "Overall": "5.0", "Content": "I upgraded from a 13'' white macbook from 2005.  This was a huge leap for me!  The display is beautiful, love the backlit keyboard.  its much thinner and lighter and faster than my old MB.  Battery life has been great too.  I am VERY hard on laptops, my old MB lasting as long as it did shows the longevity of Mac hardware.  I'm excited to see how long this one will go!", "Date": "May 21, 2013"}, {"Title": "Beautiful... but new model has come!", "Author": "Hanjung Lim", "ReviewID": "RZX5M9Q7JJXPQ", "Overall": "4.0", "Content": "I has been a PC user before getting it.So it's quite strange and needs my new effort.It was really beautiful and simple.but unfortunately.... new model has come just ago..", "Date": "November 1, 2013"}, {"Title": "Not worth the hype of old Apple, but it works well", "Author": "Wideglide", "ReviewID": "RCPC4APE4TT5M", "Overall": "4.0", "Content": "The retina display would be fine if the graphics system could push the screen properly.  When I consider the competition, the question comes down to, is the Apple name/brand/hype worth the cost?", "Date": "May 31, 2013"}, {"Title": "apple", "Author": "xin Li", "ReviewID": "RSR11OGWSII2H", "Overall": "4.0", "Content": "i thought the screen would be a little bit bigger. this item is very good for many functions. i like it", "Date": "June 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007473FNQ"}}