{"Reviews": [{"Title": "Not good", "Author": "Marion Meyers", "ReviewID": "R2IIQB5ZHPIRKV", "Overall": "2.0", "Content": "I wanted something cheap and that is what I got. It has been in for repairs often. I would have made a smarter deal by buying new for a little bit more. I would not buy a used computer again", "Date": "May 30, 2014"}, {"Title": "Good laptop for travel, service and public access areas where losing it or damaging it would not break your heart or lose data", "Author": "ChipGuy", "ReviewID": "R36M2GQW5XZVJ8", "Overall": "4.0", "Content": "I wanted a cheap, expendable Laptop for use on the road and on service calls. I use it primarily for web and email access and field service apps where everything is replaceable. I never store irreplaceable data on it and can use it from a Linux Live CD. It works well with the Tails Bootable CD version of Tor for use in public WiFi access areas and hotels. I downgraded it a star only on the basis of the battery which only has about a 1 hour life on it. I honestly didn't expect much from the battery on a refurb unit but I think they could screen them a bit better.", "Date": "March 29, 2014"}, {"Title": "Works well for the purpose", "Author": "Deborah Algren", "ReviewID": "R34H5KKTOIJKK7", "Overall": "3.0", "Content": "I bought this computer for my daughter-in-law when her son had poured hot chocolate on her old laptop.The computer works fine.  It does not come with a camera which is also fine.I was unaware that it was a 2009 system and the video card is obsolete and crashes the system.For the price it is great for surfing and research.", "Date": "February 9, 2014"}, {"Title": "Great Deal", "Author": "rebecca littleton", "ReviewID": "R34E7HECV0UEPJ", "Overall": "4.0", "Content": "Was under impression that Microsoft Office was on computer but it was another version. Computer looks and runs New. Happy with perchance :-D", "Date": "February 4, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007AV3T0U"}}