{"Reviews": [{"Title": "Great machine at a great price", "Author": "Dan S.", "ReviewID": "R3DHN2T1CY3MYY", "Overall": "5.0", "Content": "Great machine.I use this for regular household stuff, but also for running Line 6 music processors and KRK near-field sound monitors. Sounds great. And the large screen allows me to work with multiple apps (video, audio, and text simultaneously) without an additional video monitor.It's plug-and-play into my large-screen TV with an excellent picture for online sports and movies - even with a straight RGB connection (supported), though it's pretty large for dragging around the house.I'm enjoying the step up from XP to 7. A lot of software downloads/updates initially, but all installed seamlessly. Blotware? Some - but I've certainly seen a lot worse.I can hear the fan, but for the amount of power in this slim case, the fan noise is not more than would be expected. I run CPUID HWMonitor to watch temperature and other hardware diagnostics.  The fan is definitely doing it's job. I had difficulty adjusting to the touchpad, so I bought a cheap, Logitech wireless mouse. All is good.Recommended. I picked up one of these at Best Buy for less.", "Date": "August 1, 2012"}, {"Title": "\"A\" grade for screen width, \"F\" for noise level of fan", "Author": "vonnie", "ReviewID": "R3H29MBK0V3JSY", "Overall": "3.0", "Content": "I love having a nice wide screen, and have had no problems with features on this laptop, but I cannot recommend purchasing this simply because the fan noise is sort of....extreme. It is extreme to the point of being distracting. I do not have the vent in a place that would make the fan have to work harder to vent, or anything like that. It is simply noisy. Would not purchase this one again.", "Date": "July 8, 2012"}, {"Title": "HP pavilion", "Author": "DannY", "ReviewID": "R3DVC0C4PYKYPY", "Overall": "5.0", "Content": "This computer is great! I use this for everyday usage and im glad to say this pc looks great runs great and has alot of features. Ive got mine from best-buy with geek squad protection. After 2 months of using this computer iv had no problems.Finger scanner is a awesome feature. I also love how fast this thing is.For the size of this machine the battery life is excellent no problems there. I defiantly recommend this computer no matter how old you are.", "Date": "September 23, 2012"}, {"Title": "Excellent", "Author": "James W.", "ReviewID": "RYZGGKCQ3P57Q", "Overall": "5.0", "Content": "Came on time with no issues to report on it. Have had it for three months now and i can say I'm quite happy with it.", "Date": "June 3, 2014"}, {"Title": "Good for digital, not quite for gaming or DVDs", "Author": "Mark Doxtater", "ReviewID": "R2U4R5FLCK38BQ", "Overall": "4.0", "Content": "Overall I like it.  The screen is nice and big and its got plenty of processing power.  The caveats I would list are:  Its not up to snuff for gaming.  Random errors in games that seem like they should be supported (see Mass Effect/Mass Effect 2/Skyrim) will annoy or infuriate you if you are buying with the assumption you can run them.  The bigger beef on my particular unit is that the DVD drive seems to be \"weak\".  What I mean by that, is that DVD's with the paper labels on them seem to give my computer hell and I can't view them.  DVDs that my set top player has no trouble with, this drive chokes on.  I was told by an expert that its because my player can't \"spin the disks\" to the correct speed.  Now whether that's a systemic problem with this model or not I don't know.  I only know that I'm currently looking for a new drive to install.  For day to day internet and digital media viewing (with an HDMI out as well) it works great though.  It also doesn't break the bank.  Good bang for the buck I think.", "Date": "January 31, 2014"}, {"Title": "Not a Gaming Laptop, But preforms like one!", "Author": "Mitchell", "ReviewID": "R2G7AY2NC16MQX", "Overall": "5.0", "Content": "This may look like it is just an ordinary Laptop, but it has the power to do so much more, I Love it, and so should you if you choose to buy this!", "Date": "October 21, 2013"}, {"Title": "Failed expectations", "Author": "David B", "ReviewID": "R8AODMOZWI95R", "Overall": "2.0", "Content": "I purchased my dv7-6c95dx a little more than a year ago. It had awesome specs and i was exited to have a viable laptop that could run memory intensive programs with ease (games, video streaming services, hd video, etc.). It did run very well, for the first couple months. The cooling fan became a very big distraction, constantly running at full power, even when i had the power setting on power saver + lowest screen brightness. it became a constant drone and my siblings frequently called it \"the jet engine\". i stored it in a place where ventilation would not be an issue either. a few months later, the hard drive failed. got it replaced and still encountered hard drive issues (failed to boot when opening the lid, LEDs came on but screen didn't, tried shifting through displays and everything, only way to fix it was to hard boot) also, upon loading certain programs/booting, the CD drive would clunk every so often. The screen is too big for the hinges it is attached to. after months of opening and closing, the strain on the hinges has caused them to wear, and just recently (right after my 1 year warranty expired), the right hinge broke completely and i can no longer close the lid due to the screen starting to bend the black screen trimming. if i were to close the lid, the screen wouldn't come with it and i would simply crack my screen. Also since my warranty expired, my cooling fan no longer runs at full blast! that may sound like a good thing, but now my laptop overheats. even with the power saver setting + lowest brightness. Battery only lasted 8 months, now i have to constantly leave it plugged in. If left unplugged, with no intensive programs running, i'm lucky if it lasts an hour. My little gateway, i3 with 4gigs mem and 250gigs hard drive space lasted 4 TIMES AS LONG as this P.O.S. never had any problems with it, and it still runs fine, but i donated it to one of my siblings because i planned on getting a better laptop. or so i thought. extremely disappointed.", "Date": "August 21, 2013"}, {"Title": "fan noise is so annoying", "Author": "Di Allen-Thompson", "ReviewID": "RGJ996DG0JSEN", "Overall": "2.0", "Content": "I do like the graphics, the size and most of this computer, it does not get hot, but the fan noise is so annoying, I would not recommend this laptop for that reason.  I have also had a lot of trouble with the cursor jumping around, but that could be windows 7.", "Date": "August 14, 2013"}, {"Title": "Just awful", "Author": "Sharon Tucci", "ReviewID": "R2V1LSUAYLTGJD", "Overall": "1.0", "Content": "The laptop was a great value - amazing specs for the cost. BUT this is now my 3rd HP laptop where I've had keys pop off and my 2nd one where I've had major fan issues. The noise is just awful. I can't even use Skype to talk to people because it is too loud.", "Date": "August 13, 2013"}, {"Title": "I'm a very happy camper !!", "Author": "FLgram", "ReviewID": "R361ZNCIQ4UZ0C", "Overall": "5.0", "Content": "The laptop was received on time, in excellent condition, and exactly as described.  It has all the features that I wanted and at a great price.  So far, it's working perfectly.  I couldn't ask for more.  I would buy from this seller again and highly recommend them.", "Date": "April 27, 2013"}, {"Title": "Capable machine", "Author": "E. Garrett", "ReviewID": "R3VRELM8I7K7H4", "Overall": "5.0", "Content": "For what I bought the laptop for, the fast processing speed as a media laptop, it functions quite well. I, unlike many computer users, do regular maintenance to make sure it stays running fine, & in about a year's time, no issues, which is more than I can say for previous computers.", "Date": "April 22, 2013"}, {"Title": "I would buy again from this person and HP!", "Author": "Tyrone Smith", "ReviewID": "RACZLQMSLOWCM", "Overall": "5.0", "Content": "Actually my product arrived three days early because of FedEx. I'm only mad about this product because one of the buttons which is the arrow up is faulty when I push it the button comes halfway off. It's not a big deal because it's refurbished and its something I can definitely fix with a little bit of glue. not worth sending this bad boy back for that other than that I rate you 99% you missing 1 because of my button! :) Everything on here runs fast for this type of processor for this price you can't loose good luck find a I-7 for under 700 bucks by HP. no complaints you wont regret buying all you have to do is adjust to your liking.", "Date": "April 17, 2013"}, {"Title": "Iv had it 2 months now", "Author": "LPIII", "ReviewID": "R1V2PUR1CG7V98", "Overall": "5.0", "Content": "It works great. I like that it has windows 7 and not 8. and I like that it is 17 in screen and quad core intell i7 for way under 1000 bucks.", "Date": "April 5, 2013"}, {"Title": "Decent except for the touch pad", "Author": "Phineas M. Hanks \"Phineas\"", "ReviewID": "RJO4A4IWG0T2V", "Overall": "3.0", "Content": "The computer in general is okay.  It seems to have decent speed.  The keyboard is very solid and the battery life is good.The real reason I'm reviewing this is to warn others of what an absolute, thorough, total, and complete piece of dog crap the touchpad has turned out to be.  This is about the only thing in my life that causes me to cuss. %#&!!! there it goes again! %#&!!!  I've set the sensitivity at the lowest point and yet it still senses my hand above as I type and it relocates my curser.  So, in the past 8 months, I've hardly been able to type a full paragraph without looking up to find that I'm typing in the middle of something I've already typed.  This is frustrating as heck!  %#&!!!Back in September I thought, \"Well, I'll just have to retrain myself when I type to keep my palms well away.  Hasn't worked.  I do wish I'd never bought this computer because of this constant agonizing feature. %#&!!!", "Date": "May 4, 2013"}, {"Title": "Great for school and entertainment", "Author": "Nick D", "ReviewID": "R2PSYL4BBPVBWA", "Overall": "5.0", "Content": "I got this about I want to say 6 months ago. I'm going off to college in 2013. Right know I'm in high school and for me this works great. I love how I have protection through my finger. I fell safe knowing that its harder off people to logon.  The HP coolsence works great. The sound is awesome. so is the 17.3 inch screen that on alumni  design gives this a high quality feel.", "Date": "November 12, 2012"}, {"Title": "Very nice laptop", "Author": "Robert L. Barrett", "ReviewID": "RHHX4Q1B646L1", "Overall": "5.0", "Content": "excellent viewing screen, but laptop overall is heavy. I wanted a laptop to replace my desktop and this does that job. But would be unwieldy to cart around.", "Date": "January 26, 2013"}, {"Title": "Dont buy it!", "Author": "sk", "ReviewID": "RFPWKARSO19QB", "Overall": "1.0", "Content": "I bought this computer because I wanted something that could handle a speech recognition program without dragging. I loved the HP simple pass, and this computer screen great. In the end, it has only given me problems and I would not recommend anyone purchase this computer if they need to use anything that requires speech recognition programs to work efficiently. The HP simple pass is no longer working. I still owe $600 on this computer and it's already basically a pain in the butt. I could go on and on but wont...just take my advice and don't waste your time and money.", "Date": "January 18, 2013"}, {"Title": "hp-pavillion dv7-6c95dx", "Author": "Christopher A. Mullen \"Mulldog\"", "ReviewID": "R1SJIOHLNHQLXR", "Overall": "1.0", "Content": "I bought this machine 6 months ago for the fast processing speed I need in my photography business.  FORGET IT!  This computer absolutely SUCKS.  Processing is fast for sure...but don't dare let it sit still for any length of time and expect the screen saver to engage.  NOT.  The only thing you can look forward to is the BLUE SCREEN.  This is the absolute worst computer I have ever owned.  It constantly freezes...right out of the box.  (similar reviews have stated the same).  Very, very, very disappointed w/ this computer and will never buy another HP product again (if they are still in business...hmmm wonder why they are struggling w/ that issue)  The absolute worst P.O.S. I have ever wasted my money on.  Don't even bother w/ this company, let alone this model if you are seeking a piece of mind.  I constantly have to maintain \"sleep\" mode or the machine defaults to the \"blue screen\".  This computer SUCKS!  DON'T EVEN ENTERTAIN THE THOUGHT OF BUYING THIS MODEL OR ANY OTHER FROM HP.  SAD.  I'm surprised it let me even get this far w/ out freezing up.  UNREAL.  TRULY A P.O.S.  FORGET IT!  SAVE YOUR MONEY and look elsewhere for a much better machine.  This machine is not worth the box it comes in.  P.O.S.!!!  Forget about HP.  They are headed down the drain fast....unfortunately I am a testimonial customer to that claim.  JUNK!  Head to any other manufacturer or even build your own from household kitchen items...you will more likely achieve better performance from a papertowel tube and tin foil.  SAD, SAD, SAD excuse for a computer!", "Date": "August 2, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007XQM0TS"}}