{"Reviews": [{"Title": "did not disappoint for it's price tag", "Author": "Kent T. Whitney", "ReviewID": "R6N9XMTZFNRW7", "Overall": "5.0", "Content": "This computer does not disappoint for it's price tag. Is it the most powerful ultrabook? no. But it's versatility is not to be reckoned with. It can handle day to day gaming, has fantastic build quality, is speedy, and I'm not afraid to lay it down on the covers.There are a few minor disappointments. The touch pad is a touch flakier than my last laptop, and the chicklet keys arn't the best keyboard I have ever used.On a technical note I was afraid that the split SSD/HDD would be a problem for re-installs, but I was able to use it for swap space in linux, and still maintain part of it for windows caching. Another interesting technical aspect is that it actually has 2 GPUs, the 4000, and the GT640M, possibly someone could take advantage of that for an ultralightweight computation platform.Bloatware, before I blew away the OS was lighter than normal, but still present.I recommend this laptop to people who game occasionally, students looking for an inexpensive ultra book, and tinkerers who want to play with the more interesting features.", "Date": "August 26, 2012"}, {"Title": "Was working perfect as FIRST", "Author": "Shiiiinglow", "ReviewID": "RYJP4KLHJD6ZR", "Overall": "1.0", "Content": "I realized most of these good reviews are from recent buys and are not from someone who has owned it for a couple of months. I bought my Acer Aspire M5 touchscreen windows 8 ultrabook back in January of 2013. I had to return the first one i bought because of some errors in it, but I got a new one after returning it and I was extremely happy with the product for the price I paid ($679.00 at Target with taxes). It has been 9 months exactly since I bought this ultrabook.. and I have to say this thing is breaking down on me. The touchscreen has completely stopped functioning and the laptop itself has become extremely slow. The internet always drops and the connections always fail. No bluetooth device connects. I have been trying to get help from acer and they asked me to refresh the laptop, and I lost all my data in the process and it did not help fix the problems, and then I was asked to do a system recovery and it still didn't fix the problem.. So basically, this ultrabook will function absolutely find for a couple of months and then it goes downhill from there. so my advice is, pay a little extra and invest on something that will last longer than a couple of months.", "Date": "September 10, 2013"}, {"Title": "Where to Begin...", "Author": "PJ", "ReviewID": "R3U9MAW2Y0T62X", "Overall": "5.0", "Content": "Pros: Where to begin I don't even know.-Ivy Bridge i5-Kepler graphics-Backlit keyboard-LG Shuriken display (thin bezel and very bright)-Dolby sound that can fill a room-20 GB solid state cache-6 hour battery life-0.81 inches thin-AND a CD drive all at $780? Absolutely incredible.Cons: -Screen is bright, but viewing angles and contrast could be better.-Build quality is middling-Ports on backside, but I understand why.Other Thoughts: Absolutely amazing value. You don't realize how thin and light this thing is until you pick it up. Screen is bright and speakers are loud, Ivy Bridge and Nvidia Kepler graphics absolutely soar through any game you throw at it. Skyrim played at Native res. (1366x768, High Quality, 8X AA, 8X Anti-Aliasing) at a steady 35-40 FPS buttery smooth. I did experience some very slight throttling playing CS:GO after a couple of hours but it subsided fairly quickly. Boot-up times averaged ~20 seconds due to the 20GB solid state cache. Does get hot during gaming between the Pause Break and Ins Keys, but it wont burn a hole in your desk. The keyboard is full-sized and the back-lighting is adequate. Keys have good travel and virtually no flex. My model (which I did not buy off Newegg) featured an ELAN trackpad. Gestures are extremely responsive and two finger scrolling is the best I've ever used on a Windows PC.TL;DR:Buy 2.", "Date": "November 6, 2012"}, {"Title": "Battery Reset Required", "Author": "roperdan", "ReviewID": "RJM0947S13TWO", "Overall": "2.0", "Content": "So the computer arrives and i soon learn that after entering sleep or hibernation the battery requires resetting before the computer will turn on.  After a couple of very superficial sessions with India, I am instructed to send it back with me paying one way shipping.I am still trying to work out the problems myself.  Never had these problems with Dell or HP.  Do not buy!", "Date": "February 19, 2013"}, {"Title": "Damaged product.", "Author": "Lena White", "ReviewID": "R2TNT7F9FLD75I", "Overall": "1.0", "Content": "The computer arrived damaged. The fan made a horrible sound the moment I turned it on. I tried restarting it, but the sound continued.", "Date": "March 7, 2013"}, {"Title": "It's just OK", "Author": "RG", "ReviewID": "R1WANCW12N97O1", "Overall": "3.0", "Content": "The Acer laptop is OK.  We bought it to avoid buying Windows 8.  The price was too high ( our fault or paying so much) , the rear ports and the off/on switch are difficult to get at and the cursor pad is difficult to manipulate.  It's fast and trim.  All in all it's an OK laptop.", "Date": "February 13, 2013"}, {"Title": "Preload os sucks", "Author": "Lovelace", "ReviewID": "R244S501PMXIKE", "Overall": "4.0", "Content": "The preload operation system only recognize 3G memory. It almost makes me return it...and lots of problem with its preload os. Well it take me whole day to reinstall os and everything. Well, the memory problem is solved. But as it come with no drivers including the LAN board so there is no internet connection, It took a cop of hours to find another computer to download driver online. Where are these great traditional goes that we buy computers with a hard copy of drivers?Beside this, everything I'd fine. Oh I recognize that there is no microphone plugin, only the earphone. But it ok.", "Date": "September 12, 2012"}, {"Title": "Flawed wifi - avoid.", "Author": "Telo", "ReviewID": "R86HE08M96WN6", "Overall": "1.0", "Content": "The wifi is incredibly slow, even compared to much older computers. Avoid it, unless you dont need the wireless connection, or you get it so cheap that you can buy a USB dongle to replace the broken wifi card. I've seen on forum that other users had the same issue, and the hotline dont know what to do except reinstalling everything.", "Date": "August 29, 2012"}, {"Title": "crashed Screen of a brand new laptop", "Author": "Sadegh", "ReviewID": "R11ZJLHYG8ATHJ", "Overall": "1.0", "Content": "My laptop was crashed and damaged in screen such away that the screen shows the stuff and materials like windows etc as a broken screen but I had ordered it as a brand new laptop.", "Date": "October 11, 2012"}, {"Title": "I have a previose model timeline X i5", "Author": "J. Araluce \"ace ventura\"", "ReviewID": "ROLH1KRBFG3CN", "Overall": "5.0", "Content": "I cant wait for this new istalment by acer to come out! its going to be amazing. I have a timeline 4820 t and i paid the same price for it - 750. this one is much nicer, and its the same price. you got to give it to acer, they try to be cheap AND SMOOTH!! i love it.", "Date": "June 24, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0085H65VS"}}