{"Reviews": [{"Title": "Needed it, love it.", "Author": "Sandra Mercer", "ReviewID": "R21Z8U04BI17W9", "Overall": "5.0", "Content": "I had done lots of research before choosing this laptop. I am very happy with it and the price was just what i had in my budget. I would recommend this.", "Date": "October 22, 2012"}, {"Title": "Excelent product", "Author": "Alexander Estrada", "ReviewID": "RQFNC8UX2QW5D", "Overall": "5.0", "Content": "It.s a very fast laptop, with 4b of Memory  RAM and 500GB for internal storage, I am very happy with this purchase in MongooseDirect", "Date": "April 27, 2013"}, {"Title": "Great Buy!", "Author": "Gretchen", "ReviewID": "R165D2VMKVDIT9", "Overall": "5.0", "Content": "I had no clue what kind of laptop I need and Acer came highly recommended.I love my laptop!slim, light weight.have had no problems.", "Date": "February 8, 2013"}, {"Title": "Fine", "Author": "Pat Gossage", "ReviewID": "R3LJDCKD18EIRX", "Overall": "4.0", "Content": "No hdmi connection.  The computer does anything else that I need it to do.  I usually have at least 5 applications or sites open at a time and the speed is just fine.  Picture is good.  No out of the ordinary problems with the computer.", "Date": "November 30, 2012"}, {"Title": "Nice laptop.", "Author": "Joseph J. Hiller", "ReviewID": "R3MVI7LH7K9YSV", "Overall": "4.0", "Content": "I purchased a very nice used laptop on the Amazon Marketplace from Dutchmonkey10.  I did require anything that we as state of the art or super powerful.  I have heard  some negative comments about Windows 8 as well, so this prompted me to explore the used market.  So I purchased an Acer laptop from Dutchmonkey10.  I came with a Pentium 6200 dual core processor, 4 gigabytes, ram 500 gigabytes hard disk and Windows 7.  Just what I was looking for.The only negatives that I notice after having it 2 days is the right click button sticks a little bit and the laptop is a little on the heavy side.  Neither is a problem as I prefer a wireless mouse and I will not need to move it very frequently.I can highly recommend Dutchmonkey10.", "Date": "March 22, 2014"}, {"Title": "2.5 stars.  Lost Hard Drive ... Luckly I just backed up.", "Author": "fdoamerica \"fdoamerica\"", "ReviewID": "R15YYPZJWY6DP7", "Overall": "3.0", "Content": "I have had two other ACERS and they were very good laptops.  Initially, I liked this computer, especially factoring in the price.  I like the display, the keyboard and the processor (for daily use) - but most I liked the price $299 on sale.  Then, recently I was told by a salesman at 'Best Buy' that ACER's quality has gone down and they were getting returns because ACER has been having problems with laptop hard drives.  Two weeks after he told me that - wham - the hard drive when out.  Thankfully, I had 1 week remaining on the 1yr warranty (1 week - what a squeaker) .  They replaced it (took over 20 days total turnaround time) and now it is back up and running.  Since I grew up with failing hard drives I am a zealot for backing up - almost daily.  So the hard drive failure was not a data disaster.  That said I can only give this computer 2.5 stars because of reliability. I doubt I will buy another ACER.", "Date": "August 22, 2013"}, {"Title": "Acer for the win!", "Author": "Brittney Hibdon", "ReviewID": "RTISWOVXSZCGV", "Overall": "5.0", "Content": "I have owned a lot of computers for a few hundred dollars to Alienwares \"laptop\" that was a whopping 4 grand. (a ridiculous amount of money to pay for a computer that was the worst thing I had ever owned) This Acer has been incredible, usually i go for the heavy name brand computers, my HP's were great, but dealing with my roommates Acer to do homework on and finding that it was the only reliable computer, I sought out this little guy that was the best bang for the buck. it is powerful, has no trouble supporting multiple apps flawlessly and remains relatively cool (my Alienware would burn the crap out of my leg). It is a great computer that will get you through everything without making you want to chuck it under the tires of your car. It is lightweight, the palm rest and track pad are in comfortable locations, just overall very happy with it and I have had it about 6 months I daresay.​", "Date": "August 19, 2013"}, {"Title": "Review of my laptop", "Author": "Marge Roberts", "ReviewID": "RE3YJ2GLIPDJN", "Overall": "4.0", "Content": "the only problem for me is the touch pad is off to the left and not centered like all the other laptops. Other thsn that I like it.", "Date": "May 5, 2013"}, {"Title": "Acer's great", "Author": "Dan and Sherri from PA", "ReviewID": "R2NWGP5CIE9CO7", "Overall": "5.0", "Content": "Acer has a great product and a great price.  This one we bought for our daughter who uses it mostly for playing games and social networking.  We use ours for surfing the internet and watching movies.  We love them and we love their price.", "Date": "March 15, 2013"}, {"Title": "All kinds of problems.", "Author": "yada-yada", "ReviewID": "R2CI9ILVVS78W8", "Overall": "1.0", "Content": "I guess this is a refurbished or used computer. It had all kinds of problems including not connecting to the internet and freezing. I would have to force it off as it would freeze in the shut down mode. I tried tech support and rebooted it. I erased everything off of it but it didn't fix the problem. Luckily Amazon is great at returns so back it went.", "Date": "August 23, 2013"}, {"Title": "OVERHEATING!", "Author": "Xena", "ReviewID": "R3AOSG1FKXS3AB", "Overall": "1.0", "Content": "This product is terrible! I've had it about a year. It constantly over heats!!I can't even type a paper without it overheating and shutting down.", "Date": "June 2, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008CHC1HS"}}