{"Reviews": [{"Title": "exactly what we ordered", "Author": "Dime a dozen", "ReviewID": "R2SRD14UFKY5VA", "Overall": "5.0", "Content": "If you are an Amazon review nazi, this review is probably not for you, but rather the few folks who are sincereley looking at this laptop and just want to see what a real person who bought the thing thinks. To anyone else, read on...**************************************************************************************************************************The quick and dirty is that we like this laptop.  We bought it for my wife's dad and he loves it.  He is able to open multiple windows and tabs on the internet(something his previous computer just could not handle) all the while using MS Office at the same time.These tasks and storing family movies and photo's is all he ever wanted his computer to do and this laptop does it flawlessly.  The fact that he can now take all of this with him on the go, verses having to wait until he is at home in his office, is just a bonus. If you only need a computer for these things, then rest assured this is a good buy and you will be happy with this laptop.**************************************************************************************************************************Ok, for those budget minded people who may be interested on how we came to buy this laptop over the endless sea of others, this part may be for you.When searching for a laptop I narrowed down what was important to us to a few things. All of which are things you can not change after the fact.  Screen size, processor type, and max supported memory (ram).  Everything else is generally easy to replace or install with a little research and know how. So when compairing prices between computers, this one was chosen against all other types in the 17\" screen or greater, quad core CPU, 8gb or more max supported ram types.We shopped BB, TigerD, NewE, CircutC, Dell, HP, Gateway, and Acer and feel confident we got the best compairible deal out there barring any promotional event that may be going on for a NEW laptop.  If you do not care about upgrading to windows 8 on the cheap in the future, you can get a refurbished laptop at some of the fore mentioned shops with the same specs for a slight discount.Gamers:Although this laptop does not have a high end card, for casual games its not too shabby either.  The windows index score marked it at 6.7.  My aging mid range \"gamer\" laptop of 6 years ago that I paid $1600.00 for (nvidia 8600gtm, 2.5 intel duelcore t9300, 4gb ddr2) only scores a 4.5.  I played lOTR online, WOW, AOE online, all on hi or maxed (sacrificing shading/lighting for draw distance)while using a chat server with no problems. This laptop has a Radeon HD 7640G which notebook check rates near the top of a class 3 card. (class 1 highest, class 5 slowest) My nvidia 8600GTM is upper middle of class 4 now.  Just throwing that out there to the few who may care.Other thoughts:I agree with one of the reviewers about the screen.  At 17\" the 1600 x 900 is not the greatest. But it doesn't look bad either.  You may notice you are not getting the best of image when watching a movie, but it didn't seem like that big of a deal.As for the reviewer not happy with the keyboard.  Me and my father-in-law found the keys to be responsive and rather liked having the space between the keys. They do feel different from what I am used too, but it did not hinder at all and I believe it wouldn't take long to get used to it.  He has yet to complain about anything so far and removing him from the laptop has proven to be quite a chore.Well, hope this has helped someone.", "Date": "August 19, 2012"}, {"Title": "Good buy", "Author": "Juande15the", "ReviewID": "R2NFA57CJIMOWQ", "Overall": "4.0", "Content": "I gave 4 stars because the AMD drivers aren't available for Toshiba (at least this model)Let me tell you that 17 inch is quite amazing, and keep this in mind: for this screen size you'd better get a 1080 resolution instead of 1600 the image isn't as vivid as you could expected, but is very fast (i change the original 6GB for Corsair 2x8GB DDR3-1600), the Toshiba value pack is a very good part of the software.I did quite a research to buy (I'm a Informatics Engineer) and for the price and the memory ad, this was the best choice i could find.", "Date": "August 10, 2012"}, {"Title": "Head phone jack defective", "Author": "Splashmedia", "ReviewID": "R1YOH7B9SLR61J", "Overall": "4.0", "Content": "Head phone jack works only if you twist the cord... I got a defective one. Besides that its a good laptop I use it to edit 1080p hd footage", "Date": "December 30, 2012"}, {"Title": "A great deal!", "Author": "Animals", "ReviewID": "R6ZHFQZMFYMX1", "Overall": "5.0", "Content": "I got this laptop for a great price a couple months ago, and have been loving it ever since.The 17.3-inch screen is great, I'm not lugging it around anywhere, it just moves between my desk and my couch, so it's great to have such a large screen. I watch a lot of TV and movies on the screen and the resolution has been perfectly great, if I hadn't read other reviews mentioning image resolution I never would have thought twice. I can't comment on anything gaming-related.Other reviews also mention how the keyboard is a bit wonky, and the keys are oddly spaced out. This caused me to stumble a little for about the first 10 minutes, then my fingers quickly got over it and haven't noticed since.This laptop was by far the best deal I found for specs/price ratio, and it's been running great so far. A fantastic deal for around $500!", "Date": "October 23, 2012"}, {"Title": "It won't charge.", "Author": "Aly Up", "ReviewID": "R2SY3BQSXT7ECC", "Overall": "1.0", "Content": "The computer was bought for my dad. He's not a heavy graphics user and is generally gentle on his machines. About six weeks after purchase, he said that it would not charge. This has happened intermittently and I've found that sometimes taking the battery out, plugging it in, starting it up and then replacing the battery gets it charging. NOT COOL! The 30 day replacement period from Amazon is up, so i'm looking at the manufacturers warranty...the Toshiba website made me throw my hands up in despair. Next time dude is getting a Dell...bought directly from Dell.", "Date": "May 8, 2013"}, {"Title": "Best buy under $500....", "Author": "Jeff Ashworth", "ReviewID": "R3BTCBMTYVMKFV", "Overall": "5.0", "Content": "I picked this up over weekend (Staples 479).... Best buy under $500 by far.....Cant't beat this wei out of the box under $500.... (no driver updates or overclocking)CPU 6.7RAM 7.1Aero 6.7Grapics 6.7HDD 5.9Add 2 x 8gb 1600 ram and ssd for $150 and you have one hell of a system under $700...Cpu benchmark over 4000 and GPU over 600....I'm sure aero/graphics will move a bit after RAM upgrade with (matching) dual channel memory...Will update after RAM upgrade but have no intention of adding ssd...I picked up a cooler master 160mm silent, elevated cooling fan for 20 bucks that works great....I think fan is a must buy for people like me using system for desktop replacement or people using it for extended periods of time..... Fan Link [...]Btw, screen is excellent even though I'm not using it atm.... Have vga running through 25in monitor and hdmi running through 50in lcd for streaming, etc purposes....Can't comment on gaming since I don't... But I've read everywhere the the 7640G is adequate for light gaming....Note that the 6gb installed is 1600 ram and its capable of 16 gb.... You won't find this in another laptop under $500..", "Date": "September 11, 2012"}, {"Title": "terrible experience -worst EVER!", "Author": "forest", "ReviewID": "R1FCOKVV2LDOEQ", "Overall": "1.0", "Content": "Where to begin,I have never written a  review that I can remember-although all experiences with Amazon before this issue were perfect.........(3-5 purchases over 12 mos).This laptop purchase has been a nightmare!!!!!!!!!!First my budget was under $400-(credit limit)needed 17.3 screen,HDMI output,webcam,decent battery life-Windows 7 only-found what appered to be a great deal on refurbished Toshiba $375 -including shipping.SOLD..........I was excited.Keyboard felt cheap-immediately noticed cursor jumps around trying to type-can't complete two lines of type before discovering your letter is messed up=randomly jumps from place to place on it's own.Computer also seemed slow and would freeze up alot-not what I expected with the specs it has and WIndows 7.Contacted seller-told me no problem-he had 30 day free replacement -policyI noted the Amazon online store showed it out of stock-told me he had purchased several dozen of these-and would send out Fed-X ground shipping label- So I could return it-and he would immediately send me replacement.I was happy!Now  two weeks-no label and bunch of B.S. hassles-and big mystery-feel like I purchased this and got sucked intoTHE TWILIGHT ZONE!Contacted him one week later-said he thought I would CALL HIM back if it continued THEN we would send label-regardless I confirmed-\"Send LABEL NOW\"-computer is nightmare-told me only problems he heard of it-one customer said speakers were bad-Fully one week later-no label-then I get mysterious phone call shows local number-but message is from operations manager-whom I spoke with-asking me to text him my email address to a private cell phone #-completely different than caller ID #-so he could email me label for return.'Felt uncomfortable so I call Fed-X-they said they frown upon this tactic-and do NOT support emailed shipping labels-though it probably happens-when a customer has their own account.I try to CALL the mysterious cell#-hear a voicemail-then it says it's full-no messages can be left.I wait 15 minutes thinking he would call back.NOT!I text my displeasure-don't understand being contacted this way or asking for my email-when he promised to mail shipping label and had he done so when promised -I'd already have the replacement.I get immediate text back-\"\"been very busy past two weeks-he didn't handle it properly-I will NOW have label the NEXT day,blah ,blah,,,,,,,,,,-48 hours later-Friday-7-26-2013 -STILL NO LABEL.I call the number for Intent Notebooks-on Amazon.com-get voicemails-all are full-no messages can be left.I also call the mysterious cell number-voicemail says he operations manager of Intent Notebooks-voicemail-and GUESS WHAT?......voicemail is FULL--no messages can be left---what a HASSLE!I call 5 times in succession-try all available extensions-finally able to reach warehouse worker-I complain-he gives me another extension-says he can't transfer me-when I share frustration-asking him to please step into office ask ANYBODY to take my call who cares about this issue and would please help-30 seconds later-I am disconnected.All phone calls later are unanswered-all voicemails are FULL.I contacted Amazon immediately and complained and Amazon-GE credit-to dispute charges-I am very uncomfortable with this company Intent Notebooks.Very unprofessional-not what I would expect from Amazon,comJust noticed this seller has 25% negative feedback last 30 days.Very discouraged-and it seems mysterious to me if they honestly do have dozens of these -asOperations mgr.stated to me -why does it show out of stock at Amazon?I also felt it important to contact Amazon GE credit because this computer is useless to me-and the first bill is nearly due-and IF they ever do send shipping label-I am not convinced I will actually recieve a replacement-and am very concerned it could take a long  long time before actually discovering it has been delivered. therefore I do not feel I should be making payments-or worrying about $35 late fees-with a useless computer on hand-and no one at Intent Notebooks will take a call during normal business hours.Strange situation-I hope I never have to relive this nightmare-when only trying to buy a decent laptop online.I was intially happy to find this laptop-on paper it had all features I desired-and this was the ONLY seller available with this model.To me,this way of doing business in completely unprofessional.I'm not sure if I should just get a full refund and move on-or give them a chance to make it right?Anybody else had one of these models before? .", "Date": "July 26, 2013"}, {"Title": "just ok", "Author": "bigj", "ReviewID": "R39NIEBOKIK3X8", "Overall": "3.0", "Content": "i like it for its big screen.  it's also fast, which is good enough reason for this product to earn 3 stars from me.i don't like the keyboard, it's hard to type.the buttons at the touchpad is small, sometimes it's confusing if you're on the button or already at the edge of the laptop.the downside of the big screen is that the laptop is heavy, it's clunky.battery life i think is just 1 to 2 hours.", "Date": "February 5, 2014"}, {"Title": "LOVE IT!", "Author": "Jim Hebin", "ReviewID": "RM21F8TLNPZKZ", "Overall": "5.0", "Content": "Came with windows 7... price was great... the quality is excellent as expected... best large screen laptop for the price!!!!!", "Date": "February 3, 2014"}, {"Title": "the computer cord over heats", "Author": "jim williams", "ReviewID": "R3812YODG46USO", "Overall": "2.0", "Content": "the computer cord get very hot to the touch and the sticker on the charger bubbled up so i got worried about it and have not used it since i got it i would like to have a refund of some sort but not the whole amount of the computer i really like the computer  i bought it for my family use like i said i would like some kind of refund ok thankyou  sincerely james williams and again thanks", "Date": "January 20, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "AMD A_Series_Quad_Core_A8_4500M Processor 2.8GHz\n6  GB SO-DIMM RAM\n640GB 5400rpm  Hard Drive\n17.3-Inch Screen, AMD Radeon HD 7640G Dual Graphics\nWindows 7 Home Premium 64-bit", "Name": "Toshiba Satellite L875D-S7232 17.3-Inch Laptop (Mercury Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51soNNIKqrL._SY300_.jpg", "ProductID": "B0085N1D8M"}}