{"Reviews": [{"Title": "A great alternative to some more...famous...computers", "Author": "Lee G. Moore", "ReviewID": "RJXZ5YGQQZJIW", "Overall": "4.0", "Content": "I was a bit hesitant to purchase this ultrabook due to the very late entry of Vizio to the computer market. Anyone and everyone can tell who they are trying to mirror with this product and, thankfully, they largely succeeded.I have switched laptops pretty regularly, searching for the best within my price range. What I like about this ultrabook especially are the following -PROS1. the screen quality/resolution (higher than cheaper notebooks - and Vizio knows what they're doing!)2. inclusion of an SSD instead of a classic hard drive (way, way faster)3. slim and attractive construction4. battery life (very good overall - not the best I've seen, however)5. inclusion of an HDMI portAnd now for the inevitable -CONS1. keyboard is not the island style; keys are flatter and connected2. the touchpad (a well-known problem with these; updating the software helped some, but it is buggy to say the least)3. lack of a CD drive (DUH, you say; I know this is an ultrabook, but I still miss it sometimes)4. general lack of USB ports5. when I first opened the computer, part of the border surrounding the screen had come loose (utilized a bit of super glue to fix it myself)I could go more in-depth about both areas, but these seemed to me to be the most important qualities. It is important to remember that this is literally Vizio's first try at an ultrabook. The second generation will undoubtedly improve upon the faults mentioned here, but I don't think you could go wrong with this computer at this price.", "Date": "January 16, 2013"}, {"Title": "Beautiful thin laptop (like macbook air) except cheaper", "Author": "zenvent", "ReviewID": "R12YGNLMO31O4D", "Overall": "5.0", "Content": "Freaking awesome laptop that I'm sad I didn't buy multiples of... The only problem I've had with mine is flakey wirless, which I simply solved by sliding in a micro USB wifi wireless N adapter. Annoying the wifi doesn't work well for me, however with the USB device it's solid and it only cost $10 to fix.", "Date": "January 4, 2013"}, {"Title": "Excellent Ultrabook Vizio...", "Author": "Pinoy", "ReviewID": "R26HM3V6RA1REC", "Overall": "5.0", "Content": "VIZIO Thin and Light CT14-A0 14-Inch UltrabookI got my Vizio Thin and Light i3 at Walmart for $600+ with Win7 installed. I then upgrade to Win8 with full SSD format (created a full image backup of original setup total size 86GB) giving me 95GB of free space. Went to Vizio support website and update all drivers necessary for Win8 to run perfectly. Now i'm happy... everything runs perfect and more space to play around. Thanks Vizio for a great product!!!", "Date": "November 25, 2012"}, {"Title": "Nice, but hate the touchpad.", "Author": "Saijin Huang", "ReviewID": "R1NU9YKNM3O4IB", "Overall": "2.0", "Content": "The laptop is nice. I'm a college student and I bought this because it seemed nice and portable. And in most ways it is what I was looking for. It has a nice compact body, it's quite light and definitely thin. The battery life is ok, could be longer, but doesn't die off too quickly either. However, seriously? How can you make a touchpad so bad in today's era of nice, fluid touchscreens that you find on say an itouch? Sometimes, the mouse just freezes. The computer is working fine but the touchpad just suddenly dies on me and I have to make the computer sleep before it works again. The material of the touch pad is not too nice feeling and feels forced. It's not very responsive and is hard to control. It's just a thing for me, where I like to have nice control of the touchpad. In all other ways though I like the computer. If you carry a mouse around often, then this'll fit well.", "Date": "November 16, 2012"}, {"Title": "Best $599 I have spent on a computer", "Author": "Ravi C. Sangtani \"rsan\"", "ReviewID": "R3BMAD9JWJ7SZ9", "Overall": "5.0", "Content": "I have been playing with this ultrabook for a week now and I am really surprised that this product isnt selling more quantities.  Even after reading all the positive reviews about how beautiful this device is, I was still incredibly surprised by its sheer beauty. It's very very fast, looks as beautiful as McB Air and about as thin, comes with no bloatware at all which adds so much to the computing experience on this device and an incredibly sharp screen resolution.I won't go into the tech specs since more users have done a better job of it than I can, however you will see polarizing views on how acceptable/bad the trackpad and keyboard is on this machine.  Ultimately it comes down to how you would like to use this device.  I looked at it as a cost benefit analysis where I just could not get the same specs on any machine for the price of $599. I personally do not find the keyboard and trackpad to be as unusable as some of the users have mentioned but then again I am only using this machine as my entertainment device with browsing and some office work.To avoid disappointment, identify why exactly are you looking for a laptop and then go to a physical store and use the device to get a sense of whether this is for you or not.  I personally would recommend this device to all my friends.  Best $599 dollars I ever spent.update 9th nov 2012:The ultrabook is still quite fantastic and the trackpad issues are not even noticeable but the keyboard remains a bit of an annoyance.  Personally I still wouldn't dock a start because it is still great value for money for my needs. Just updated to Windows 8 and though this laptop isn't touch compatible the experience on Windows 8 has been really really good.  The laptop now shuts down in about 4 seconds and boots up in about 6-7 sec which is almost as good as a tablet. As developers come up with more applications for this OS, the experience will only get better and the cost of buying Windows 8 for just $16 is also a no brainer.  There is a bit of a learning curve to using it but as with any new technology adoption, the first 3-4 hours of usage are the toughest and then it gets better.At $750 ish the appeal of this machine goes down a bit because put in another $100 or so and you can get decent ultrabooks for the price.  So glad I bought it when I did.  I would still recommend that you use it personally in a store before buying so that you ensure you get the value for what you are spending.", "Date": "October 31, 2012"}, {"Title": "Thin One", "Author": "Joe", "ReviewID": "R3PZJ9V22O085J", "Overall": "5.0", "Content": "Found the VIZIO Thin and Light CT14-AO 14-Inch Ultrabook to be everything as described.The size and weight are perfect for me. The operating system and display leave nothing to desire.Would recommend for anyone wanting a small lightweight with all the power you should need.", "Date": "October 29, 2012"}, {"Title": "Fast and easy!", "Author": "redsox09", "ReviewID": "R8NYHA883THCB", "Overall": "5.0", "Content": "We have a Vizio notebook and are very happy with it. The company is looking for a niche and is doing very well at this. The product just arrived and it took me minutes before I was up and running. We got this for our son in college. No bloatware just the stuff you need to get going. Everything works great out of the box. Boots very quickly and is a pleasure to look at. MS Signature really helps because no need to install and pay for an additional antivirus. Love the purchase.", "Date": "October 2, 2012"}, {"Title": "You're going to be asking \"what if\" every time you use it", "Author": "bebuckle", "ReviewID": "R37EWSPY3QWI4M", "Overall": "2.0", "Content": "The first \"what if\" that you'll ponder pre-order: \"What if it's not as bad as people say?\"The Vizio is so cheap -- $600 at the time I got mine -- that I figured it was worth risking it just to see if it's really as bad as people say.  \"What if I'm one of the people who will mind it's shortcomings?\"  \"What if the drivers have improved?\"  \"What if I get a good one?\"So it arrived, and sure enough, it turns out I'm one of the people who minds the shortcomings.  I'm a fast typer, so typing is a chore because of all the time fixing mistakes, and because you have to watch super-close for double-taps and missed keys since there's no way to tell by feel whether any given keystroke was clean or not.  This is a mechanical design issue since the keys are so large and flat, but it's also a programming issue because there's no other way to explain why it registers so many double-letters.Also, the TRACK PAD is kinda lame.  (I didn't know how lame until I tried a better computer.)  It's jumpier than I'm used to from Dells I've owned, and the buttons are very stiff.  Plus it's not especially accurate, and there's a lag when you tap.  All very annoying, but...\"What if all ultra-thin computers are this bad because they're so thin?\"  \"What if there's just not enough space for effective input devices?\"  The only way to find out would be to test a better computer!So I went for the only glowingly-reviewed ultra-thin I could find with 900 lines resolution, the Samsung Series 9 (15\").  More than twice as expensive as the Vizio, but man, it's a different world!  Track pad is amazingly fast and accurate, perfect firmness for clicks, great click action, tap-to-click works fast and great.  Keyboard is predictable and consistent.  Battery lasts forever.  I've never owned a Mac, but now I know what it's like to work on a laptop that seems flawless.  I just have no complaints.Which leads to the final \"what if\" you'll be asking yourself for the next 1-4 years you'll be asking if you buy the Vizio: \"What if I'd just forked over the extra $300 or $600? for a better machine?\"  Because every time you use the thing you'll have issues.  These aren't occasional mis-types: they're constant.If cost is a huge issue for you, then maybe you should buy the Vizio.  But then again, there are plenty of laptops that are as cheap as the Vizio, they're just a bit heavier and thicker.  But having tried both the good and the Vizio, I'd take the heavier computer every time, because the Vizio really is difficult to use compared to laptops that actually work well.  The glamour of the super-cool Vizio is simply nothing compared to the pain of actually using it.  And if you do have the bucks to try a Series 9: hello, this thing is amazing.The only thing I liked about the Vizio is the rubberized grippy bottom (almost dropped the Samsung within five minutes of receiving it), but I just slapped some Invisishield material on the bottom of the Samsung so it wouldn't slide off my lap, so now I don't even have that to complain about!", "Date": "November 19, 2012"}, {"Title": "Horrible American Based Customer Service", "Author": "Candice", "ReviewID": "R2YS31L0R19B9F", "Overall": "1.0", "Content": "Before I purchased this laptop I scoured over the reviews on Amazon and CNET. The principal CONS articulated by Amazon users were generally the same as CNET so I have provided the four critiques from CNET and my thoughts:1) \"The touch pad is just unresponsive enough to be annoying.\" This is a fair arguement. However, I think the unresponsiveness is a bit exaggerated and it is certainly not enough for me to want to send the product back. I think the degree of unreponsiveness is comparable to the slightly annoyed feeling you might get when trying to go between specific letters on an iPad. However, unlike the iPad the degree of sensitivity of the track pad can be adjusted. For now, mine will stay just the way it is.2) \"The keyboard is a nonisland throwback, like an old MacBook Pro keyboard, but with shallower keys.\" The keyboard is fairly shallow but I have had none of the difficulties that other reviewers have experienced. Still at keeper.3) \"Battery life is unimpressive.\" With WIFI, MS WORD, and streaming Hulu, I got about six and a half hours.4) \"And, oddly, there's no SD card slot, which is a surprising omission; even $299 Netbooks include that basic feature.\" Not a dealbreaker for me, but it might be for you.Overall, after twenty-four hours this laptop seems like an excellent value. Super lightweight and super sleek without the price tag that usually accompanies those features. I will update this review a month from now as I get to know it better.Updated: 09/23/2013: Don't throw away the box. Don't misplace the box. Why? Because it hws your serial number on it...which, despite the words \"Serial #:\" imprinted on the back of the the laptop, does not actually appear on the laptop. So if your AC adapter suddenly stops working less than a year after owning the product, you will need the box to file a very a claim through a very tedious and inefficient process. Also, don't throw away the AC adapter. For some reason it has your Windows key on it. For some reason. If you do have to file an in-warranty claim, expect it to take at least a week. Other than the tedious claims process, the non-responsive trackpad has become annoying enough to warrant a change in review from a 5 to a 4. While it is still a good value, I won't repurchase.Update: 9/30/13 - So I had to call Vizio AGAIN to follow up about this IN WARRANTY replacement. Of course there has still been no update to their website and the representative once again promised it would be shipped on today to arrive Thursday...TWO weeks after the initial claim. This is literally the worst customer service experience I have ever had with a product. Lesson: Buy America then buy a Mac.", "Date": "October 22, 2012"}, {"Title": "Fantastic Ultrabook. Vizio makes top quality ultrabooks.", "Author": "Colbert Fan", "ReviewID": "R1G5RJY5H8HZJQ", "Overall": "5.0", "Content": "This is a phenominal ultrabook. I recommend it highly to anyone in the market for one. The entire Thin and Light series ultrabooks are well build, great components and phenominal screens at the perfect resolution.", "Date": "September 10, 2012"}, {"Title": "Great Laptop", "Author": "Ben Malec", "ReviewID": "R3GRJQPOT2R6VD", "Overall": "4.0", "Content": "I'm just going off to college, and I got this laptop.  It's absolutely amazing!! Only a few issues occur every now and again, mostly with the mouse, but I'm sure with a few driver updates, it'll be fine.  It was a great purchase.", "Date": "August 9, 2013"}, {"Title": "very good", "Author": "pengfei li", "ReviewID": "R21O67DQCX7TDV", "Overall": "5.0", "Content": "I love the clear, bright display and the high resolution as someone said.i think it is a great little laptop!!!", "Date": "July 22, 2013"}, {"Title": "Had it less than 9 months, overheats and has started crashing lately", "Author": "M Patel", "ReviewID": "R34ITHHW57BQR1", "Overall": "3.0", "Content": "Worked well at the beginning, but slowly it has begun to deteriorate.It overheats significantly, like hot to touch overheating.It also has recently begun to freeze for no reason. There are maybe 200 documents on it, tops.", "Date": "July 16, 2013"}, {"Title": "Good Enough", "Author": "A. Collins", "ReviewID": "RLO788EAYYL3E", "Overall": "3.0", "Content": "The display on this \"IPS\" panel isn't nearly the best from what you would expect.  The viewing angles get pretty specific.  You have to be looking with the display tilted a certain way,  and at a certain brightness.I have to say thought the WORST part of the ultrabook, is the Touch pad. This is the most,  unreliable, unresponsive touch pad you could possibly get on any laptop/ultrabook. It's the worst out of the box, and there is a firmware update on the Vizio website that I HIGHLY recommend that you do all the updates on the site. Yet,  with the updates, I've had to restart the laptop (although not often at all) due to and unresponsive pad.  Yet,  if you try to only use the pad with one finger,  it's a much better experience.On the bright side,  this is a VERY convenient option for someone that wants something more capable than a high end tablet yet lightweight, fast,  and portable. It's perfect for those who just want to surf the internet,  listen to spotify, etc.One side note,  I did have to reinstall the operating system after it just..  Stopped booting one day.  Most likely just a one time thing for me,  but I thought it was worth noting.", "Date": "July 4, 2013"}, {"Title": "Good purchase.", "Author": "NOM", "ReviewID": "R1VARDN16EFYSX", "Overall": "4.0", "Content": "Good purchase for this cost.Best display resolution. Very ergonomic and thin.But LAN port does not exist, so 4.0 my rating.", "Date": "June 18, 2013"}, {"Title": "Broekn After Merely 4+ Months", "Author": "MJH", "ReviewID": "R2T36CEFDPVP3F", "Overall": "3.0", "Content": "update 0213-0404I sent back for repair and got it back in less than 1 week. working fine now but never explain what went wrong.I really love this laptop. It's light and pretty. The keyboard is a little awkward but I got used to be. I can do my typical jobs, writing email, surf the web, watching youtube video, facebook, google talk... But it just suddenly decided to quit.Press the power button and the power light turned on. The fan turns for couple seconds then stops. The screen stay blank forever. This past Amazon return time. Now I have to deal with manufacturer.", "Date": "March 8, 2013"}, {"Title": "Sometime one problem can be crucial !", "Author": "Wai Y Chan", "ReviewID": "R1S2IDFGL5SSJ8", "Overall": "2.0", "Content": "Yes the laptop is well built, yes the laptop is fast, yes the laptop is super nice, yes the laptop's keyboard is to die for.However, all these cannot over come the fact that the mouse is useless. Also, the drivers don't work, I set the trackpad to disable the pad when i am using the bluetooth mouse but when I turn the mouse off it doesn't enable the trackpad to function.Sometimes we do need to use the mouse and those are the time when life sucks and almost throw out a $700 computer off the window.That is why I give it a 2 star to let Vizio's engineer to look into this defect.", "Date": "March 8, 2013"}, {"Title": "Great Little Laptop", "Author": "ebby2u", "ReviewID": "R33MJO1MDMYDD", "Overall": "4.0", "Content": "I bought this laptop for my daughter so i could have mine back, needless to say she still has mine and i am using this one.I like the visual and speed performance.I like that I cant hear it run or have to worry about it overheating because of venting issues.I like the HDMI port for connecting to my big screen TV if I want to watch something on line that is not available through my other devices.I like that there is an option so I can turn off the mouse-pad when using an outside mouse since I am handicapped in my hands and will sometime hit it by mistake with my hand when typing which is very frustrating to me.The down side is that some of the keys on the keyboard sound like there is sand underneath them keeping them from functioning.I don't like that there is not a 10 key pad since the keys are large they could have made them slightly smaller and fit one in.I would like to see a keyboard that doesn't sound like there is sand trapped in it and full keyboard with a 10 key number pad", "Date": "January 28, 2013"}, {"Title": "Great little laptop with one huge flaw", "Author": "Mark Jensen", "ReviewID": "RH0A3DBWYMYV1", "Overall": "4.0", "Content": "I bought the first version of the VIZIO Thin and Light for my wife and the build quality and design are very impressive for the cost. Build quality is comparable to a Macbook with it's light but durable metal housing. The underside has a rubber coating which makes it less slippery when having it on your lap. I really wish that my Macbook had a similar coating!The specs are also very impressive for the price, outdoing a low end Macbook Air. A great little performer that launches programs almost instantly thanks to its solid state hard drive. Just don't plan on doing heavy gaming with this machine, because the integrated graphics cards won't be able to handle much. The keyboard is very is also responsive and I almost enjoy typing on it more than I do on my own Macbook.The biggest flaw with the machine is it's touchpad (which has been improved in newer version as I've been told). It's temperamental, deciding to take input when it feels like it. Though it's capable of multi-touch gestures, you might as well forget about that feature because it's so unresponsive. We made the mistake of upgrading the machine to Windows 8 which heavily relies on gestures... with this touchpad it's anything but enjoyable.Still, for the price we do not regret buying this laptop and with an improved touchpad in the newer versions, this has to be the one of the best cost-friendly alternatives to a Macbook Air.", "Date": "January 1, 2013"}, {"Title": "Impressive", "Author": "Rory Knottnerus", "ReviewID": "RLLO6YZVNDSND", "Overall": "4.0", "Content": "It is impressive Vizio produced such a sound laptop. It works fantastically but the mouse pad can be a bit touchy.", "Date": "December 16, 2012"}, {"Title": "vizio ultra book", "Author": "Diana McConnell", "ReviewID": "R1XS5I8HB1CT0U", "Overall": "5.0", "Content": "This is a very fine computer....and I got an especially fine price thru Amazon!  It is lightweight, boots up quickly, has a long battery life and the screen resolution is better than hi-def! It's very easy on my eyes-I find that I can use the computer with ease for a much longer period of time. There is no fan noise, which was an annoyance with my other computer.This is the perfect computer! Vizio needs to upgrade their marketing...this is comparable to the other brands that sell for double the price!", "Date": "November 18, 2012"}, {"Title": "Fantastic product for the price", "Author": "Scott P. Cutler", "ReviewID": "R1ENO3DUTYTO3L", "Overall": "4.0", "Content": "I purchased the VIZIO CT14-A0 after a long search for laptops in the <$700 range.  My key requirements were price, light weight, and a screen that was over the 1366x768 resolution that is so common these days.I wasn't necessarily expecting much else in a selection--after all, those three are fairly hefty requirements.  So I was utterly surprised to see a $599 laptop with a 1600x900 screen, MacBook Air-like size and weight, and great construction.After a few weeks of using it, I could hardly be happier.  As others have said, the keyboard and touchpad are a bit finicky and could be improved, but after some getting used to I don't have a problem.  The overall performance is great, the build quality is awesome, and the screen is fantastic.  Even the camera is excellent.I docked a star for the minor keyboard problems, but it really is quite minor and by no means ruins the experience.", "Date": "November 8, 2012"}, {"Title": "Met High Expectations", "Author": "Mark Schlitter", "ReviewID": "R2TO4C4A14MMF", "Overall": "5.0", "Content": "After reading several reviews I knew there were going to be some annoyances with the trackpad, but they were few compared to the many great things about this laptop.  The hardware is fantastic and beautiful, I've had several people ask what kind of laptop is was and were blown away when I said Vizio.I recently upgraded to Windows 8, and the laptop became even more amazing.  I have recommended this laptop to several friends who are looking for something new and light.", "Date": "November 6, 2012"}, {"Title": "Fast boot up and very nice screen", "Author": "ridgepath", "ReviewID": "R1NZGN9FZZKT4X", "Overall": "4.0", "Content": "I was attracted to this computer by the price and nicer screen than  many competitors. It was also important to get a computer that booted up quickly. I am pleased.The touch keys work fine and I had no major problems otherwise. It will be used as \" a second car\" not as my primary work computer. For that type of use ,the weight and boot up time make this at a price of $600 a good deal.", "Date": "November 5, 2012"}, {"Title": "A winner for me with a few drawbacks", "Author": "Gnouel", "ReviewID": "R2MHMEBUS1102K", "Overall": "4.0", "Content": "At the $599 price point is hard to find something with better specs than this ultrabook. It looks and runs great, upgrading to windows 8 was easy and almost everything works, the cold boot time is less than 10 seconds. Just make sure to don't delete the vizio folder with the drivers in case anything goes wrong.It's a beautiful laptop with an unibody metal design, the screen is beautiful and is very light and thin. There are a few things I don't really like, the keyboard gets a little time getting used to, I'm not getting repeated letters when I'm typing like others users, on the contrary some keys won't register if I don't hit it right in the middle.The touchpad, well good luck trying dragging something, it just doesn't work well. Maybe it'll get better with a driver update. I always use a mouse so I won't be using the touchpad that much.The charging pod fits a little loose on the computers port, I hope it doesn't give me any problems later.Overall you can't go wrong with this laptop at the $599 price.", "Date": "November 3, 2012"}, {"Title": "Good specs but horrible KB/Touchpad.", "Author": "Cleiton Santos", "ReviewID": "R1CF8ZWUN9AN6A", "Overall": "3.0", "Content": "Amazon service is top-notch as always. Ordering was painless and the unit arrived extremely fast.The actual product on the other hand...For the price ($600) this ultrabook seems like a steal and it would have been if the Keyboard and Touchpad weren't atrocious.Pros:Amazing display for a $600 ultrabook, you won't find a better screen for the price.Windows 7 Signature Edition (no bloatware installed).Unibody chassis.Cons:Keyboard is unresponsive and overall just feels cheap. Keys won't always register or will register twice.Touchpad can be usable, if it decides to work. TP on my unit actually went dead 3 times in a period of 2 hours, forcing me to reboot to get it back working. Continued having issues even after updating the drivers.Being a programmer, I require a laptop with solid keyboard and touchpad more so than the other specs. Unfortunately, this Vizio fell short of that requirement with its faulty KB/TP.", "Date": "October 30, 2012"}, {"Title": "Excellent value, horrible touchpad", "Author": "Ron", "ReviewID": "R34I14X001ITF1", "Overall": "5.0", "Content": "I bought this computer on Amazon when it was still 600 dollars. The screen is stunning, startup and shutoff are extremely fast, the form factor is elegant, and battery life is not bad.That said, the touchpad is the worst mouse I have ever used, and upgrading the driver has done little to help. But the price keeps it up at 5 stars for me.", "Date": "October 27, 2012"}, {"Title": "Overall Satisfaction", "Author": "ajb", "ReviewID": "RK7KSSENQPLZS", "Overall": "4.0", "Content": "Pretty good job for the first line of laptops from Vizio.Positives:-extremely lightweight, can be carried anywhere with ease-HD display, everthing looks quite nice-low profile keyboard, makes typing effortless-powerful ultrabook for being at lower end of lineNegatives:-first and foremost; the trackpad, it sticks it lags and sometimes it freezes, not nearly as smooth as a Mac, kind of gritty mking it difficult to use fingers if even mildy moist (sweat)-no backlit keys, difficult to see what you are typing in the dark, even moreso because of the low profile keysAll in all I am satisfied with this laptop, the negatives are minimal and one can deal. Recommended.", "Date": "October 25, 2012"}, {"Title": "Fast", "Author": "David Watkin", "ReviewID": "RZMP76ITWLT78", "Overall": "5.0", "Content": "Best pc I have ever used. Its so extra fast and has very good display. Its the cheapest ultrabook that I found (600).", "Date": "October 24, 2012"}, {"Title": "Vizio Computer", "Author": "Amaze", "ReviewID": "RK0G3JW81BS2F", "Overall": "4.0", "Content": "Love the computer, but the touchpad is not user friendly. I wish I knew how to use it the proper way.", "Date": "October 24, 2012"}, {"Title": "Great computer ever!!", "Author": "Shi Shang", "ReviewID": "R26XLA2DEPX2IS", "Overall": "5.0", "Content": "It is super fast computer and very high quality.very good looking and I hope I can use it for while and don't need to change it!", "Date": "October 9, 2012"}, {"Title": "Vizio CT14 A0", "Author": "mucha", "ReviewID": "RAONH9D3A97CM", "Overall": "5.0", "Content": "At $600 this is by far the best ultrabook you can get in the price range.  The SSD, display, and ivy processor make it a solid deal.  This is a secondary computer since I have a solid desktop and it's great for that purpose.  I took a big risk considering Vizio is new to the computer market and i'm glad I did.  If they keep it up they can be the next brand to have on the PC side of the market.Pros:- Fast startup- Can play WOW and Diablo3 (runs fine on the low settings and I only use this when I don't have access to my desktop computer)- No bloatware- Display is great for the price- AC adapter feels solid and the connecter looks like it's built to last- Keyboard feels weird at first but is actually really good (Trackpad worked fine for me, I use a separate mouse anyways)- Clean and professional look.  A very simple and attractive design.Cons:- 128GB hard drive might not be large enough if you plan on using this as your main/only computer- USB slots seem a bit tight- Upper left side of the above the esc key gets fairly hot if using graphics", "Date": "September 29, 2012"}, {"Title": "it is not movable device!", "Author": "Righter", "ReviewID": "R3BIBDEP0PY974", "Overall": "1.0", "Content": "For what purpose people buy laptop? - To use them on the way. I bought mine in US and took abroad with me. At this time it stopped to work. I contacted vizio support and they refused to help me with my problem because I was not in US those time! Silly behaviour with crazy rules in vizio. 2 years ago I got the similar problem with Samsung - they helped me the same time when I asked them.", "Date": "November 1, 2013"}, {"Title": "awesome!!", "Author": "Gavaun Dean", "ReviewID": "R3L1D9G1R1I3IQ", "Overall": "5.0", "Content": "I was expectation was a little becuz it was refurbished instead a new. But I Loveeeee it. So sleek and think. Fast delivery as well! Only thing that's alittle disappointing is the traftpad.. other than that thw computer is perd", "Date": "December 22, 2013"}, {"Title": "changes everything", "Author": "terrence gil", "ReviewID": "R17ZFGS04FMFCV", "Overall": "5.0", "Content": "i always wanted a laptop such as this one. I love it like it wanted it wanted it wanted to", "Date": "January 24, 2013"}, {"Title": "Not surprised.", "Author": "LivTheReviewer", "ReviewID": "R20J6E3OAS9QOM", "Overall": "3.0", "Content": "I order the laptop about 3 months ago. The Internet is much faster than my last computer; although, the laptop constantly freezes and the mouse is a nightmare", "Date": "October 26, 2012"}, {"Title": "Nice laptop, but....", "Author": "TravisinAtlanta", "ReviewID": "RP96F4TYKERG6", "Overall": "1.0", "Content": "I bought this Vizio because it was highly recommmended by Cosumer Reports.  The number one reason that I went with Vizio over HP, Dell, etc was because of the great, high quality screen that the Vizio has.That being said, after only having the PC for several months, I've noticed that a pixel towards the middle of the screen has gone out.  Now I'm out side of Amazon's return window and I need to contact Vizio to replace the screen because one pixel has died.What a waste of my time and $!!!!", "Date": "March 23, 2013"}, {"Title": "Looked Good But C-Drive Failed and 5 Keys on Keyboard Didn't Work", "Author": "Bruce D Lightner", "ReviewID": "R135DQ79PXFGR0", "Overall": "1.0", "Content": "UPDATE #2 (April 3, 2013):Six months into the replacement Vizio Ultrabook the solid-state drive (SSD) has failed.  It had been hanging and needing reboot every few days.  No it will not boot.  Not just a few errors but errors everywhere on the C-drive.  Windows startup repair hangs up doing nothing.  Booting the notebook into Linux and copying the disk drive image to a USB drive showed hard errors every few gigabytes.  TOTAL LOSS of data on the Windows disk partition.In baseball you get three strikes---but with PC hardware two is enough to tell you're OUT!  Pure JUNK!!!!ORIGINAL REVIEW (September 2012):Vizio's 14\" ultra-thin notebook just arrived in what seemed to be pristine condition, but during Windows start-up I was unable to type in \"Vizio\" as the computer name because the SHIFT, \"V\" and \"Z\" keys did nothing!  Same problem with the \"X\" and C\" keys in the same row.I'm sending it back for another one---but only because our Vizio TV has served us so well for many years.  We shall see if this is worth the effort.Needless to say, I'm a bit disappointed with the out-of-the-box experience---and the initial quality of this product.UPDATE #1: A replacement arrived a QUICK four days later.  (Amazon sure makes returning merchandise painless.)  I am happy to report that all the keys on the replacement notebook worked!!Pros: The small number of processes running on Vizio's version of Windows is truly impressive.  My \"high-end\" HP laptop needs an extra 2 Gbyte to have the same amount of free memory as the Vizio when runnng under Windows 7.  This is a cool machine...literally.  And, it is absolutely silent...except for the clicking of the (now working) keys.Cons: The keyboard lettering is truly stupid.  Stylish is fine, but when one needs to \"peek\" at the keys, it would be nice if the SHIFT key functions were readable.  The \"touch\" of they keys is fine---but talk to me in another 12 months AFTER I have had time to get some \"crude\" under the keys.  I am not a fan of touch pads...and this one isn't going to change my mind about that.  A Bluetooth mouse solved that problem.  (I do wish a IBM Thinkpad-style \"pointing stick\" was an option. [sigh])Bottom line: We are going to keep it. :-)", "Date": "September 27, 2012"}, {"Title": "Wasn't what I wanted", "Author": "Robert O. Oberkrom", "ReviewID": "R2D12WRFH180RD", "Overall": "3.0", "Content": "I never even opened the box because I decided on another Laptop that I am very happy with. I refused it and sent it back to Amazon.", "Date": "December 9, 2012"}, {"Title": "Dusty trackpad", "Author": "Charlie PC", "ReviewID": "RJ0JZU5VW30S2", "Overall": "1.0", "Content": "For an $800 dollar machine, I expected to have a better trackpad. It's so easy to get inside and impossible to clean. Definitely returning this. Huge disappointment.", "Date": "September 23, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0088L182C"}}