{"Reviews": [{"Title": "Very good option for 15 inch class portable workstation", "Author": "Dan Ketchpel", "ReviewID": "R2ODTKAPM1VXZ1", "Overall": "4.0", "Content": "I researched for some time which workstation class 15\" laptop could replace my desktop as a portable workstation. After looking at Dells, Sangar, Toshiba, etc. I chose the Lenovo W530. I had a very good experience with a Lenovo G570 I purchased earlier for another employee and it gave me good expectations for this unit. The price and feature ratio on the W530 was very hard to beat. I really wanted the Nvidia Quadro 2K card for CAD work and few offered it or something similar as most are focused on gaming. I'm not gamer, I wanted this for my work/home computer as 75% of my work entails CAD/CAM along with IT support.The one feature I REALLY wish it had was a 10 keypad and the Ctrl & Fn keys reversed in position. The G570 has a 10 key in a nice chicklet style keyboard with the Ctrl & Fn keys in the correct position. Why Lenovo can't give this keyboard style in a high end laptop is beyond me. At least the included keyboard is very nice to type on, except for occasionally hitting the little red navigation nub above the B key. I could get along without that nav button just fine. It works, but I don't make great use of it and it interferes with typing more than it helps with navigation. Luckily I mostly use the unit with a USB full sized keyboard and mouse.The other aspect of the W530 I am not very fond of is the Intel LAN/WiFi cards. This is for 2 reasons. First, I have found the Intel WiFi cards to be the least compatible with routers of all the WiFi cards I've used in laptops. I have had the same experience with Sony VAIO laptops using the Centrino cards, they are very finicky to connect. I had to reconfigure my FiOS router at home to get it to connect and most of the time you need to turn off the Ivp6 feature in the card settings or it won't connect. I have never had this problem with Atheros, Nvidia, or other WiFi cards. It is also not readily recognized by many Linux Distros, a fair sized negative in my book. Second, I do NOT like Intel's PXE boot agent which interferes with accessing the BIOS menu. After the Lenovo Tech support agent failed to help me get around it, and much trial and error on my part, I found out if you simply hold down the F1 key for an extended period it will eventually go past the irritating PXE boot agent menu and into the BIOS settings. I cannot find a way to turn this feature off and I have zero need for it. Since it's built into the on-board BIOS Intel's bootutil program won't control it, I tried that option and it doesn't work with on-board PXE. My beef is more with Intel than Lenovo.The Webcam is pathetic, seriously. For a high end laptop the Webcam is not even in in the ball park for this decade, it's nearly useless. I tried to skype with it twice, gave up, installed my Logitech 9000, and things rocked, super clear, no lag etc., the way it should be. Do not plan to use the Webcam, just forget it's there. The built-in microphone isn't much better. It works but the audio quality is poor, my skype recipients told me I sounded like I was in a barrel. I just switched to the microphone on the Logitech and bingo, audio quality was right there.The Speakers are pretty decent for audio playback, movies etc.Other than the above issues I have been quite happy with the unit. I bought it with the 4GB of RAM option with the plan to upgrade it to 16GB. I was stoked to find out they ship it with the 4GB in the hard to access primary RAM position under the keyboard and the 2 slots for extra RAM on the bottom empty. I was able to plug in the 2 x 8GB sticks I bought and end up with 20GB on board in a matter of minutes, very nice. I have no complaints on the speed of the unit.The Nvidia Quadro 2K (2GB) card has been so so. It's compatible with my CAM/CAM software but not nearly as fast as I'd hoped it would be running packages that use surfaces. You can use Nvidia's software to configure which GPU runs your applications, either the Intel HD 4000 or the Quadro, or let it choose automatically. You can also configure details of the Quadro. In many instances I find the HD 4000 GPU just as fast which doesn't speak highly for the Quadro card. This isn't a reflection on Lenovo but rather Nvidia. After some research on the card I found they really choked it in terms of the RAM R/W speed. If this feature is a big part of the buying decision (as it was with me) do some research on the card's performance first. This is my one disappointment.I have been using the system with Lenovo's MiniDock Plus Series 3 and it works great, love it. I run a twin screen setup off the docking station plus the built in screen for a total of 3 screens and it works very smoothly. I have also used the VGA out port for a single extra monitor which works fine. The Win 7 Pro OS is very good about remembering your settings for different monitor setups. I think the docking station approach is completely worth the extra couple hundred dollars, plus you get a second power supply, that's hard to beat. Speaking of power supplies, the 170w supply is a beast. It pumps out the power but sure is a brick to carry around. I'm thinking of getting the smaller 90w unit just to keep in my carrying case and leave the other two 170w bricks at home and work.I have the 9 cell battery and the life is pretty good if you set it up to optimize battery life. I've gotten 4-5 hrs of run time from it which is pretty dang good for a high powered laptop. The 9 cell battery does stick out the back an extra inch or so. If you want a flush fitting battery you need the 6 cell which would also make it slightly lighter to carry. If you carry it around a lot I'd suggest the 6 cell and 90w power supply, the two would shave off more than a pound from the combo I think.I have not had any problems with the unit and it's been rock solid in operation. I'm pleased with the 1920 x 1080 HD display. I recently replaced the 500GB HDD with a Seagate 750GB hybrid drive to improve speed and capacity. I cloned the new drive using the Apricorn USB 3.0 SATA kit and it worked flawlessly. The new drive booted up like it had been in there the whole time. I was able to resize the primary partition during the cloning to give me a sizable second partition for my data files. I set the fully configured OEM drive aside as a backup. The HDD bay is easy to access but be careful of the screws holding the caddy on the drive, they are ultra tight and I think have some thread lock compound on them. The first time you remove them have a good fitting screw driver and be very careful or you'll strip the heads of the screws. Once you get them out it's no longer an issue.To recap, overall I'm very pleased with the laptop and would recommend it. It has a VERY solid build feel and an excellent array of ports. The ultrabay is nice for swapping in other drive options. I had to buy a mini display port to HDMI adapter cable to connect to a big screen TV but it works fine. You'll most likely find that cable in the MAC stuff, it's common for them. If I had a choice I would not get the Intel net cards but you may not have the option. They do work once you tweak the settings. If you can't connect to WiFi try turning off the Ivp6 option first. If you come face to face with the stupid PXE boot agent menu hold down the F1 key for a long time, it will get you past it and into the BIOS setup.Final note to Lenovo, offer an updated keyboard with a 10 keypad and the Ctrl & Fn keys reversed, ie just like the keyboard in your G570, you know how to do it. And PUT IN A REAL WEBCAM!!!! Professionals use WebEx, Skype, etc for business video calls more and more, it's an essential tool for remote communications. My wife's $350 ASUS netbook has a far superior webcam in it.If Lenovo fixed the keyboard layout and gave it a state of the art webcam/microphone I'd rate it 5 stars.I hope this helps somebody considering this laptop.", "Date": "January 15, 2013"}, {"Title": "Hit and Miss, or Am I Just Unlicky?", "Author": "flatpicker", "ReviewID": "R9N9388E22RU3", "Overall": "3.0", "Content": "I  bought a W530 with a Pantone color callibrator from Lenovo Direct, and went through an awful experience with Lenovo's customer service department.  The color callibrator in my machine didn't work, right out of the box.  I've used Lenovo laptops exclusively for the last ten years, and have really enjoyed them.  I've had everything from the 12 inch mini to the 15.6 workstation.  They've been fast, tough, and reliable.  But of the eight Lenovo laptops I've bought for myself and my family, I've had two that have been defective right out of the box, and my son received a lemon, too.  Each time, we've been run through the time-consuming and frustrating process of working through Lenovo customer service to get a replacement.  Long waits on hold, shut down, reboot, retest, finally send the machine into engineering, etc.  This last time with the W530, almost six weeks passed between the time I first called Lenovo and the time I received a replacement computer that worked.  My replacement W530 is humming along fine, and it is clearly the fastest, most powerful computer I've ever owned.  The callibrated, high resolution screen is fabulous.  It's been a month and it hasn't crashed or even hiccuped once.  The machine I now have is a five star, but my experience with Lenovo support and the sketchy three out of eight lemon rate makes me downgrade to a three star at best, and I have to wonder how many lemons Lenovo lets out.  I tried posting a review describing my unpleasant experience on Lenovo Direct, and .... big surprise, it isn't posted.  So I'm posting it here at good old Amazon to let you all know.  I think my new W530 is a terrific machine, but I sure have received a lot of lemons.", "Date": "December 18, 2012"}, {"Title": "Flatpicker is not alone, Lenovo does not care about customers", "Author": "nicemostly \"thevmw\"", "ReviewID": "RB26BK6PZPZMW", "Overall": "1.0", "Content": "This is an interesting product with useful features, from the ability to use expresscards to add connectivity and functionality to a lovely LCD screen. Review the features list carefully, and proceed if you need those features and can't find them elsewhere (expresscard slots, for instance, are increasingly hard to find).I was excited to get my new ThinkPad W530, but it was nonfunctional out of the box--something wrong with the communications sequence, from the motherboard to the antenna which makes any kind of internet connection not an option.  Lenovo tech support had me reload the OS, replace the hard drive, re-reload the OS (from media this time), use an ethernet connection (luckily I have one!) to run the dreaded Windows updates, run hardware diagnostics, and more.  All to no effect.  A decent company (and you know they're out there!) would have had me ship them the machine for repair and shipped a new one for me the same day and fixed up the defective one for sale later on.A month later, I'm finally in the queue for a repair which will take a week or so.  I have to deal with the repair process, evaluate the repaired machine, and had to argue with staff to ensure that I was still eligible to return the thing if I don't like the way it works when I get it back.Lenovo Customer Support, particularly on the sales side, is grossly inefficient.  None of the people you talk to when calling them with issues has real authority to help you.  This can be very frustrating if you are an individual or a small business.  Tech support is competent but not well linked to sales side in the event you need to return product, so techs lean to having customer make repairs on their end instead of asking you to send them the unit to repair at their leisure while providing the customer with a functioning machine.Do not purchase from Lenovo unless you have strong internal hardware support staff and a dedicated person to manage communications with Lenovo...or just really need a particular feature on their machines.  If you have issues with CS, press to speak with supervising staff and express concern with their process.  Currently, staff are reluctant to let you go to supervisors, probably due to internal regulations that penalize sales staff for putting customers first.  Perhaps they can improve.", "Date": "January 3, 2013"}, {"Title": "Great Hardware, Terrible Quality Control", "Author": "A. Walker", "ReviewID": "R1FZ376CC41EMM", "Overall": "3.0", "Content": "The hardware is great, everything you would expect from Lenovo in a workstation grade laptop. However, you may spend an entire day chasing drivers and loading the color calibration software yourself. When mine arrived, it barely functioned and had no wireless, discrete graphics, optical drive, or wireless monitor capabilities and the device manager was full of exclamation points. I had to load the X-rite software myself and run the first color calibration routine, something Lenovo claimed they would do at the factory. Once you actually get the laptop up and running with the right drivers, it works great, but I wouldn't recommend this to someone who need a machine that works right out of the box.", "Date": "February 12, 2013"}, {"Title": "Just pay the premium for a M4600 (or a Elitebook if you really like FirePro for some reason)", "Author": "sonictk", "ReviewID": "R2RRISA8R5DKSK", "Overall": "1.0", "Content": "I recently made this purchase via the official Lenovo store due to my old laptop's battery giving out and have had nothing but grief throughout the entire process.First of all, I was deciding between this and the M6400, but decided to go with Lenovo due to talking to a sales agent and getting assurance that it would ship before would. What he failed to mention was the delay that would be caused by customs, and the fact that it also ended up shipping 2 days after the stipulated date that he assured me of. 48 hours is a long time when you have deadlines every day in the actual working world.But that's just overeager sales people, right? So secondly, when I finally checked my order status, I was shocked to discover that the configuration I had listed no RAID whatsoever. I had to look up the product manual to discover that there were some W530 models that actually did not have the RAID mboards in them, and after going back and forth between Lenovo sales/tech phone support (thanks for redirecting me everywhere and not actually answering my question, by the way Lenovo), I ended up getting a solid answer from the user forums: that there ARE no RAID models available at the moment, and not for a few months at least.I'd like to point out that at NO POINT in the ordering process was this mentioned, anywhere. And on the main product page, it mentions that it supports RAID. If not for the fact that I needed it urgently and had no time to go through the process of cancelling the order and going with a instead, I would never have gone through with this purchase.So anyway, I finally get the laptop, set about stripping out all the existing software and going with a fresh install of Win 7. And then I get BSODs whenever the AC is unplugged, which took me yet another 4 hours to diagnose before I discovered that the BIOS wasn't updated. After flashing it, now the ExpressCard slot no longer works (thankfully that's not a critical problem, since it just means I lose one USB port). The customer support tech I contacted had the gall to tell me that I had too much RAM that was causing the problem!Additionally, if you do end up choosing to go with a W530, do yourself a favour, and get the full HD screen (I got the 1600x900 because I hate having screens with anything higher than 90DPI). The lower-end screens have absolutely b ad colour gamut and viewing angles (completely out of whack white point and blue gamma). It's worth mentioning that this is the first ever screen I have actually had to use a colour calibrator to correct gamma, instead of eyeballing it like I usually do. It's that b ad. And I've calibrated Phillips screens before.Build quality, despite what most people think, is actually not-so-good. The keyboard panel sags, the general material used (with the exception of the screen housing, which is actually quite well-built) is crappy plastic all over and the new keyboard rubber dome feel is not as crisp as other manufacturers' (Acer/Asus actually has better feel)Also, the lack of a numpad. I knew I was already going to miss it, but it boggles the mind as to why Lenovo chose this new layout, presumably to fit in larger drivers for the speakers, which are massive. Unfortunately, I think it's a poor compromise (who the hell mixes on laptop speakers anyway?) since the speakers don't sound that good at higher levels, and have b ad response through the mid-range of tones. I always use an external sound card and monitors for my audio, anyway, so it's not a huge issue for me. No Caps Lock/Num Lock indicators, however, which means you have to rely on a OSD display, which takes up RAM and CPU, along with GPU draws to screen. So, pretty annoying.So...the good points. The general aesthetic is actually alright, the matte finish is welcome, and the arrangement of ports (with the exception of zero USB ports on the right side) is alright. The RAM slot positioning and HDD slots are well thought-out, making upgrades accessible and less frustrating (but to be fair, almost every manufacturer has caught onto this these days)In summary, however, with all these problems of reliability, fraudulent sales, and absolutely useless tech support, there is no way I could recommend this to anyone, or any Lenovo product for that matter, considering this is the way a professional product is being marketed and supported. I am terribly disappointed that in a already small market for workstations, Lenovo has chosen to blatantly disregard its offering, I suspect, in favour of its probably more profitable consumer lines.Just remember: we're the ones making the actual entertainment media for those products.", "Date": "March 16, 2013"}, {"Title": "Terrible cracking and poping noises when used with Lenovo Docking station.", "Author": "B. Vincent \"bvseattle\"", "ReviewID": "RKLRO2OXUF032", "Overall": "1.0", "Content": "Terrible cracking and poping noises when used with Lenovo Docking station.  Use your web search to go to \"Lenovo W530 cracking noise\"  This will lead you to an article on Lenovo's own community discusson website where this problem was reported in July 2012 and is still being reported on new W530's shipped in December 2012 6 months later.  In that community page Lenovo techs believe this due to a defect in the Motherboard design meaning it affects all W530s and the only way to repair is to send the unit to a service depot for several weeks where they will remove and replace the motherboard.  While this only presents when the laptops is used with a docking station, its unknown if the issue shortens the life of the unit or will lead to further complications.", "Date": "December 30, 2012"}, {"Title": "Fast Computer!", "Author": "d-dub", "ReviewID": "R9VWP5HAC4OFB", "Overall": "4.0", "Content": "So first, I got this computer through Computer Upgrade King. I got an upgrade on Ram (16megs), a solid state drive, and an upgraded intel processor.  This is the fastest laptop or maybe even desktop I have used (and i work in the technology industry).  I love the speed!  Monitor is great.  I've heard the cam is bad but honestly I just need a fast computer to run graphics intensive programs (not gaming).  My biggest gripe with this comp is the keyboard and such.  I hate that the fn key and Ctrl keys are switched on this keyboard compared to every other computer and keyboard I have used.  Very annoying.  Also, the touchpad is stippled which I am not a fan of.  I think the mouse buttons on the touch pad are far too small.  The matte black case gets dirt and shows dirt far too easily which is a bit annoying.  And maybe I'm getting too picky here, but when you open the case the Lenovo and ThinkPad logos are upside down to people who see your comp (poor advertising message). Not like an apple or even dell who fixed this issue years ago.  The size of the keyboard should allow a dedicated num pad.  The backspace key is also too far away compared to other computers.  These things are all probably nit picky for a computer that performs so well, but I'm a industrial designer so I think a lot about these things.  Still, for the deal I got and the speed of this computer I am perfectly willing to put up with these issues.  I have worked with Dells and HP's on a professional level my entire life and this computer is head and shoulders above.  This computer flat out out performs every other comp I have used in the past so I would recommend this computer to anyone.  Computer Upgrade King tested the computer so I had no issues on delivery like others.  Like I said, I think this is a great computer but I hope they think about some of the finer details in the future. I think it is ironic though that of all the reviews I read about this computer before I bought it, the keyboard was one of the top points haha!", "Date": "January 18, 2013"}, {"Title": "This is a workhorse", "Author": "John W. Moulton \"jojomo\"", "ReviewID": "R30ZJBYFSMZMOH", "Overall": "5.0", "Content": "I upgraded from a Lenovo W700 to this model for the dual video drivers.  The machine is flawless.  I work with 3d CAD color renderings and the process is seamless.  Battery life is excellent.  I converted my wan slot to an MSATA SSD drive 128 gig and  use this as my primary.  Upgraded it to windows 8 and it will quickly and accurately recognize the 3 different monitors that I use in two different offices actually able to remember location settings for each. Sound could be better...", "Date": "January 28, 2013"}, {"Title": "Portable Powerhouse", "Author": "A. C. Frank", "ReviewID": "R1DYBV55CRHWD2", "Overall": "5.0", "Content": "I needed a mobile workstation for image processing.  This W530 has lived up to my needs.  A little modification with some extra RAM and a solid state drive has also made things run even more smoothly.", "Date": "January 26, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008AZT9PY"}}