{"Reviews": [{"Title": "wifi issues a killer", "Author": "Ryan England \"yikes199\"", "ReviewID": "RRXPZGU4HKGII", "Overall": "2.0", "Content": "I did a good bit of research on laptops before making a purchase, went into stores, read reviews, etc.  A few comments.A number of people note how the screens are flexible, go into a store and try bending screens, all thin laptops are quite flexible.  Seems odd to me too, but if everyones doing it, it must work.I saw a few reviews about wireless problems with the u310, but saw many other good review so I disregarded.  Don't disregard.  There is a detailed summary at [...].Seems to be that lenovo figured out the wifi was really bad, but kept selling units and just fixed it on the new ones.  I bought my laptop on Sept 20, it was manufactured on May 28, the fix didn't come out until July 23... The date is printed at the bottom of the tag on the outside of the box, so if you buy in a store you can check.In my case, the speed seemed not great to me, but the range was terrible.  I got maybe 50 feet from the router before I lost signal.  Even my phone (which I think has pretty bad reception for wifi) was better than that.  I decided to go into work and see if I could pick up signal at my desk and couldn't ... back to the store we go.  I read lots of reviews of 2-3 weeks for repairs and the problem not fixed, didn't sound like what I wanted to do with a brand new laptop.Aside from the wifi issues, it was a great unit, solid build, really nice touchpad, good keyboard, screen was fine.  I suppose some people might only use a machine at home, but for anyone that travels around, I think the wifi problems makes this machine a no-buy.", "Date": "September 20, 2012"}, {"Title": "WiFi Issues.", "Author": "denhamcla", "ReviewID": "ROQEATY19VV9C", "Overall": "1.0", "Content": "I ordered this laptop for my wife for xmas. It is going back after two days of light use. Take the warning that there are WiFi issues seriously. Amazon must have a bulk hold on the older models that still have this issue. Do yourself a favor and get something else.", "Date": "January 3, 2013"}, {"Title": "Stay Away", "Author": "David", "ReviewID": "R3FKYUKCWVX4AL", "Overall": "2.0", "Content": "The first laptop I received was obviously defected. The bezel around the screen was unattached and the wireless card refused to work at all.The replacement got off to a better start, however things ultimately ended up in a return and a refund. The body of the laptop is okay. Metal bottom and lid but the inside is plastic. The screen brightness is very low even at max settings and the colors are extremely washed out.The deciding factor in returning the laptop came down to the wireless card. It just doesn't work correctly. I re installed windows, updated the drivers, upgraded to Windows 8 but nothing helped. It had problems connecting and when it did connect my speeds were horrible.There are much better alternatives out there for your money. It's a shame, Lenovo used to be my go-to brand.Do yourself a favor and spend a little bit more for an HP or even a DELL (can't believe I just recommended a Dell laptop).", "Date": "December 23, 2012"}, {"Title": "No wifi", "Author": "William", "ReviewID": "R7A64J6XXQHF0", "Overall": "1.0", "Content": "Wifi does not work ... period.  What else is there to say? Lenovo should reimburse all purchasers of this flawed product.", "Date": "October 5, 2013"}, {"Title": "Do not purchase", "Author": "ronsal", "ReviewID": "RQAT6F4JDQ354", "Overall": "1.0", "Content": "Without a doubt the worst wifi connectivity of any laptop on the market. Looks beautiful; but without reliable wifi what good is it?", "Date": "August 25, 2013"}, {"Title": "it is just great. the wifi problem is fixed now", "Author": "chemnash", "ReviewID": "RNQ9D9XROP3VO", "Overall": "4.0", "Content": "I wasnt expect the building quality is so wonderful, very cool very solid!The old wifi signal problem is fixed now, I've tested it intensively use on varies conditions comparing to my thinkpad laptop, iphone, ipad, etc. People who are interested in this laptop shouldn't worry about it now.but the battery life is not that great. It is advertised as 7h which is not quite possible.under normal usage of wifi and multimedia, I got about 4h battery life.", "Date": "September 6, 2012"}, {"Title": "keep searching", "Author": "jlr", "ReviewID": "R2UXIRIVYD6R2V", "Overall": "1.0", "Content": "Keyboard was unresponsive on the refurbished model I tested but at least the wifi issue seemed to be fixed.  Also it's bulky compared to options in the same price range.", "Date": "November 16, 2013"}, {"Title": "Believe the reviews on poor wifi", "Author": "R B Miller", "ReviewID": "R1FOIGFHU1VJLS", "Overall": "2.0", "Content": "I've had to return two of these Lenovo U310's manufactured prior to the wifi reception fix.  The reception drops off very quickly as you move away from the router, when compared to other properly functioning laptops.  Otherwise, a pretty sharp computer.", "Date": "June 17, 2013"}, {"Title": "I installed hackintosh on it and works well", "Author": "Yang Bai", "ReviewID": "R1ON0957GUJFDP", "Overall": "4.0", "Content": "Everything seems ok. Only two problems are:i)I dont like the integrated graphic cardii)The noise of the fan.But overall, this little machine is above average for sure. I really like it.", "Date": "April 4, 2013"}, {"Title": "It is just Okay", "Author": "l310", "ReviewID": "R1ZVTPZADFJPE4", "Overall": "2.0", "Content": "THERE IS SERIOUS INTERNET CONNECTIVITY ISSUES WITH Lenovo U310 ideapad!!!everything else seems to be fine but it is a pain when I try to connect with internet in college wifi while everybody else's laptop connects just fine :(", "Date": "March 17, 2013"}, {"Title": "This product more than met my expectations", "Author": "Timothy C. Hansley", "ReviewID": "R2FVTN0I041I8E", "Overall": "4.0", "Content": "I was very pleased with this product and it more than met my expectations.  My IdeaPad is performing very well on all of the applications that I have utilized so far.  One item that I failed to notice is that it does not have an incorporated disc player.", "Date": "December 19, 2012"}, {"Title": "Wifi Issues", "Author": "Jack Smith", "ReviewID": "RHZOPD6UV4WWS", "Overall": "1.0", "Content": "The unit I received had wifi problems. It would connect and show strong signal strength, but would only give extremely slow download speeds. I was unable to use the laptop in several rooms of my house, but could use my other 3 year old laptop and phone wifi without any problems. Lenovo did not have any solutions to the issue, so I have returned the computer. Other than the wifi issues, this appeared to be a great machine.", "Date": "July 28, 2012"}, {"Title": "Nice and Clean Ultrabook", "Author": "Dave", "ReviewID": "R2B5S5FYE3H7S1", "Overall": "5.0", "Content": "Pros:-Build Quality ~ The palm rest and outside of the u310 are made out of metal. This makes it a little on the heavy side for a 13.3 in. Ultrabook, but definitely gives it a more solid feel. A great trade off in my opinion. However, on the downside, the keyboard deck and bezel are plastic.-Trackpad ~ The trackpad is quite large and responsive. You can click the entire trackpad with one finger for a left click and click it with two fingers for a right click. You can also use the more conventional way of clicking the bottom left side and the bottom right side for a left and right click.-Keyboard ~ The keyboard has a nice travel (well, relative to an ultrabook that is). Though the shift and backspace keys were minimized, so I find myself pressing the up arrow instead of the shift sometimes. I got used to it eventually, so it's not really a big issue.-Speed ~ Boots in 15 seconds. Though I should mention that I did a clean install of Windows 8 and installed it directly onto the 32 GB SSD. Also, in general, there's no lag or anything.Stuff if the middle:-Battery life ~ About 6 1/2 hours with light usage. It's not great, but it is an ultrabook.-The screen ~ The brightness could have a higher light ceiling. If I use it outdoors on a sunny day, the sunlight easily overpowers the brightness of the screen. It's also glossy, making it more prone to outside light. For inside use, its perfectly fine as long as you are not sitting next to a window on a sunny day.-Fan noise ~ It gets a little noisy when booting up and under a heavy load. Though under normal usage, it is hardly noticeable.Cons:-Keyboard deck ~ The plastic surrounding the keys it flexes a lot. When you type, you can actually see the keyboard deck flexing up and down. It doesn't feel like it's going to break, but it makes the keyboard feel cheap and flimsy.-Bloatware ~ It's kept to a minimum, so not too bad. It can be easily uninstalled as well.Other thoughts:~The Wi-fi issues that the other reviewers have mentioned are fixed for the most part. Lenovo has said that any laptop manufactured after July 23 will have the Wi-fi fixed (mine was built in August). If you do unfortunately get one before July 23, you'll have to ship it back to Lenovo to get it fixed.~It works well with Windows 8, all the drivers are updated for the new OS.Overall I'd say it's a great ultrabook for the price.", "Date": "November 22, 2012"}, {"Title": "Terrible Wifi", "Author": "Jeffrey Launiere \"Tampa Realtor\"", "ReviewID": "RZ918TNNPJZJS", "Overall": "2.0", "Content": "I bought this laptop from a local store as my hard drive had gone on my old laptop and I needed one the same day for my business. First, I registered the laptop and found that the date it showed as purchased was four months ago. I called and was told the warranty period starts from when the laptop is manufactured, rather than when it is purchased, which to me is totally unsatisfactory. The worst thing though is that the wireless is terrible. I will get messages of poor connectivity, and lose connection numerous times a day, with a few times of a good connection. Some web pages will not load, or take excruciatingly long to load. My wife's HP laptop flies through the same web pages.Lenovo tells me there is no trouble with the WiFi and that I should call Verizon FIOS. Funny then why does even a very old Windows 98 laptop connect much faster too.I just ordered a USB WiFi adapter so that I can hopefully get a good connection. I will never buy another Lenovo.", "Date": "January 30, 2014"}, {"Title": "U310 unreliable", "Author": "Stephen Kline", "ReviewID": "R3KQXJ94OFDH5H", "Overall": "1.0", "Content": "I bought this just before Christmas.  I was very happy with it until about a week ago when the screen when blank.  It won't boot any more.  The power light comes on.  The status light come on.  The caps lock flashes and that's it.  The screen stays dark.  At first I considered this abnormal behavior, but after visiting the Lenovo support pages I'm quite shocked at how many people have this happen at the 3 month mark.  This computer is not reliable.  Send it back NOW!  Support on the Lenovo web site is virtually non-existent.  Ishan, in particular, has no helpful advice.", "Date": "March 10, 2013"}, {"Title": "Try before you buy", "Author": "rommyc \"rommyc\"", "ReviewID": "R2TQNCOSD1Y2G6", "Overall": "3.0", "Content": "First off, it looks just like a Macbook.  Everyone will think that's what it is, if that matters to you.I wish I had driven it a little longer before I bought it, but I was tired of looking and it was on a one-day sale at a B&M; store nearby.  The keyboard flexes like crazy.  As in, a lot.  I purposely got a lappie instead of a tablet because I wanted a keyboard, should have waited a bit longer.  It is very sleek and stylish, acceptably light, has a nice small power brick, pretty good trackpad.  Nice display.  I use it mainly through the Ethernet port so hopefully I won't have all the wifi issues everyone is reporting.", "Date": "October 2, 2012"}, {"Title": "Good performance, poor design.", "Author": "RS Apogee \"RS Apogee\"", "ReviewID": "R2Q7T39EZV1979", "Overall": "3.0", "Content": "This new Lenovo model performs well out of the box.  Not much bloatware, reasonably fast bootup, and decent hardware specs and features.  The appearance of the laptop is appealing, with a brushed gray-finish cover and aluminum-finished chassis.  Like most of the ultrabooks, the Macbook Air product line is an obvious design benchmark and this, unfortunately, is where the Lenovo fails miserably.  The chassis is NOT cut out of aluminum block.  It seems to be just sheet metal, so it flexes. . . a LOT.  In fact, when sitting on a flat surface, the entire chassis bows downward in the middle and, as you type, you can see it flexing.  The impression is that you could bend the laptop over your knee quite easily.Other areas I found disappointing were the keyboard and the display.  Lenovo laptops are famous for carrying over the former IBM excellence in keyboards.  The U310 keyboard, however, feels flimsy and, quite frankly, un-Lenovo-like.  Display resolution is okay, but it lacks contrast.  Oh, and the fans run constantly, and my machine is blessed with a high-pitched whistle.All in all, it's not a bad unit for the money, especially with the current Amazon $100 gift card deal.  I will only use this for my occasional Windows needs, so I will keep it.  Whether you're a Mac person or a PC person, my best advice would be to get some hands-on time with your potential new purchase before swiping your credit card.  The Asus Zen line seems to be much more solid, but more expensive.  The Macbook Air, in my humble opinion, remains the best overall design.", "Date": "July 20, 2012"}, {"Title": "Don't believe the bad reviews...", "Author": "Jordan Cunningham", "ReviewID": "R8QPN6GF62JEO", "Overall": "4.0", "Content": "I think the majority of people who have given this notebook poor reviews are ignoramuses. I am a college student who has owned this computer for a few months and I love it. It is the perfect marriage of power, portability, and price. These qualities, combined with its professional aesthetic, make it a perfect choice for students everywhere and I highly recommend it. There are some imperfections, but the cons are far outweighed by the pros.***PROS***-PerformanceThis computer is fast and powerful. The i5 processor handles any task I have given it very well, including light gaming, video editing, photo editing, HD video content and more. I attribute this speed and power to the 4 logical threads of this processor, along with turbo boost, fast memory, and an SSD/HDD caching system.-WeightThis was a serious consideration for me as a student. I am always going from one place to another, and much of my travel is on foot. I needed something that was light, which is why I sold my ASUS N56VM (which was much more powerful) in order to get this. The ASUS was a fat lard, but this computer I hardly notice is in my bag.-PriceI purchased the Windows 7 version of this laptop for $650. Can't beat that price for this amount of performance in an Ultrabook form factor.-AestheticThe look of this computer is very nice. It is thin, and has an gray aluminum lid. The inside is plastic, but it is of sturdy construction and made to look like aluminum. Overall, a very good looking machine.***CONS***-ScreenScreen resolution sucks and the panel itself is nothing to write home about. However, the low resolution helps with battery life (I get several hours out of one charge).-Internet(?)Some people have mentioned problems with the internet on this computer, which is a perfectly legitimate reason to knock it down a star. However, I have not experienced any serious issues beyond some minor connectivity problems. Be aware, I must be connected to the internet for 90% of my computer usage; if this was a big problem I would say so. Note also that you can purchase an external wifi dongle for ~$10, so no reason to rage about the internet anyway.-KeyboardKeyboard flex is very noticeable. It does not make typing really uncomfortable, but I can't imagine why it's so difficult to make a sturdy keyboard.***CONCLUSION***Overall, very nice computer. It does exactly what I need with minimal problems. 4 stars. I would also like to note, that after I bought this computer my friend bought the U410 and my dad bought the U310 (Win 8 version) and they are both very happy with their purchases.", "Date": "April 1, 2013"}, {"Title": "Problems about Mainboard", "Author": "cxxchen", "ReviewID": "R3I8U1Z9FJ1IDR", "Overall": "1.0", "Content": "The quality of this laptop- Lenovo U310 may be not good, because sometimes it occurs to short circuit on main board. In my opinion, there should be something wrong with the mainboard. So I really hope that the seller can make a explanation for this kind of hardware fault.", "Date": "September 4, 2013"}, {"Title": "Clickpad Does Not Cut It", "Author": "Nate M \"ndmcclur\"", "ReviewID": "R2QA3MXPW03VO3", "Overall": "2.0", "Content": "I bought the U310 based on its reasonable price for an Ultrabook with good specs; I was particularly after the WIDI capability.  While I was not thrilled with Windows 8, I was able to get back to a simulated Windows 7 mode that met my needs.What makes this machine a real loser for me is the clickpad.  It drives me nuts.  Because the active area for dragging the cursor extends into the click area and there is no way to turn that off, you end up constantly inadvertently moving the cursor away from its intended position.  It is especially bad for right clicks.  I would think it could be fixed with a firmware revision, but I'm not holding my breath.  Obviously I could use a mouse, but since I like to use it in my lap, that is not a very good solution.Other than that it is not a bad machine.  Unfortunately for me that one problem makes this guy a real loser!", "Date": "April 20, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0082PT89E"}}