{"Reviews": [{"Title": "After using it for a few weeks and getting the kinks worked out, it's good for what it is.", "Author": "Kevin S.", "ReviewID": "RMSF590MU1F8J", "Overall": "4.0", "Content": "****UPDATE 8/20/2013****My job role has changed a bit in the past year and I'm traveling and doing presentations to potential clients.  The thinness of the Series 9 is awesome for traveling, as is the battery life, but I decided to ditch the dreary no-frills Samsung and for an Acer Aspire R7.  I'll put up a review of that whenever (if) it becomes available from Amazon.****ORIGINAL REVIEW****I'm replacing my 2009 model Dell Studio XPS 1640 that died on me with a bad motherboard hard drive connector :/I'm a consultant for several clients in San Diego and I use my laptop for EVERYTHING, so not having one meant work stoppage for several days and I needed a new one QUICK.  I went to best buy, frys electronics and for whatever reason, costco.  I needed to try out every model I could to make a quick, but informed decision.I went with the Samsung Series 9, mostly because the Series 7 they had at Best Buy caught my eye and nothing else I got my hands on really compared.The Good:Battery Life - The battery isn't nearly broken in yet, I have been downloading and installing software like crazy, and I'm getting about 7 hours with brightness set to the middle setting. (See below).  I'm used to about 1 hour and 45 minutes with the XPS, so 7 hours is astonishing, and when the battery is broken in I'm sure it will be a few hours longer.Matte screen & brightness - I can actually use this thing outside!  It was absolutely impossible using my XPS outside because of the gloss screen and good-for-indoors brightness.  OK so I'm not joking when I say this thing is bright. On full brightness it's actually somewhat painful to look at it if you're in a dark room.  It's great if you're outside at high noon on a sunny day, but I don't see myself ever going above 2/3rd brightness indoors.Weight - 3.6 pounds, sounds a little hefty until you look at it with the screen closed and how much real estate it occupies on your desk.  It truly is astonishingly light.Thickness - .58\" thick.  That's with the screen closed.  I found that it is only slightly thicker than a BIC lighter laying on it's side.  When you open the screen you'll be amazed at how unbelievably thin it is.  It actually makes me a little uncomfortable when I open it, thinking that my meat hooks will break it.  But not to worry, it's quite strong.Build quality - It's solid. When I un-boxed it I was worried because of how thin it is and my tendency to be rough on things.  But the all metal body is very, very strong.Boot time - With the SSD you can expect about 14-16 seconds.Wake from sleep - With Intel Rapid Start Technology you can expect wake time to be around 2 seconds.  Yeah...2 seconds.  IRST uses a partition on the SSD that is the same size as your memory, (8,192MB for this ultrabook) and caches the memory to the partition when it goes to sleep.  So it's ridiculously fast.Heat - I got the chassis of the ultrabook just barely warm, and that's sitting on a pillow on my lap, downloading, installing software and charging the battery.  There's a silent setting on the keyboard (FN + F11) that throttles the processors so it doesn't generate enough heat to use the fans.  I couldn't get the fans to turn onto a setting high enough to hear it when I was doing regular work so I'd be hard pressed to get this thing hot enough for the fans to be audible.  Bottom line, it's nice typing on a keyboard that isn't +90*F, or having sweaty legs when you're using it on your lap.The OK:The I5 1.7 Ghz processor & video chip is ample for my needs: I use SQL Server Management Studio, Visual Studio 2010, remote desktop and of course browsing the web.  It's not great for 3d applications, I use Google Sketchup Pro fairly often to design simple wireframe furniture when I'm away from my office and finish off the design on my desktop at home.  But it's acceptable, but not as good as my old XPS when it was healthy.The keyboard.  I love, love, love the keyboard on my old XPS.  Keys were soft, but firm when you mashed them, always quiet, and thoughtfully placed.  The keyboard on this Samsung is just ok.  Somewhat noisy, but not that bad, the travel is short and when you reach the limit of it's travel it abruptly stops.  Granted, the keyboard needed to be thin because you have to squeeze electronics and a battery below it, so it's not a negative, just something to be aware of if you're a keyboard snob like me.The connector on the power cord.  It's tiny and metal, a little bit smaller than a standard headphone jack, but it's hollow.  I have actual fear that someone will tug on the cord (trip over it, or bump into it) and break the connector.  Is it possible that there is fault protection built in so that the laptop won't short out? I hope so, but I'll just keep it charged and hope that the battery lasts most of the day so I don't have to worry about it.The bad:I really only have two complaints, and they're equally bad.First off, the track pad is AWFUL.  It's quite large for whatever reason.  It means that your palm will touch it whenever you're typing and if you're not paying attention you'll be typing somewhere you didn't intend.  So it's not only horrible when you're typing, it's awful to use!  As far as I can tell from using it so far, there is no pressure sensitivity setting for clicking.  If you want to move the cursor around, all of a sudden you'll notice that you're dragging a selection box, or moving icons around for no reason.  I probably need more time to get used to it.  I have gotten better but it's still an issue.  Maybe they'll come up with driver updates...UPDATE: Been using this for a few weeks now, still not used to it.  I'm better at using it, but not great, I use a USB mouse whenever possible.UPDATE 7/28/2012:  There is a driver update out for the track pad! It allows you to turn off some features that cause all the problems (tap to drag, double tap to execute).  That means they allow you to take away functionality to fix a problem that shouldn't have existed in the first place.  It's now easier to type without causing you to accidentally click the mouse, but you lose some of the features every other laptop on the planet has.  I neither added nor removed a star for this.And next is the screen.  Yes, it's bright, yes it's matte.  But the contrast ratio is ABYSMAL (I can't find the site that actually told me the value but 175:1 comes to mind).  Hard number's aside, you don't need them to realize that EVERYTHING is washed out.  Some website backgrounds and text (such as Samsung's drivers page) is so faint that you can barely see them on this screen.  It almost looks like a watermark...  It is this reason, and this reason alone that I might consider returning this ultrabook.  I'm going to give it a few days of use at work and see if I even notice, after all this is a work laptop and I'm only using it to write code.UPDATE: I just played around with the display settings and got it to look not so horrible: Right click on desktop and go to Screen Resolution > Advanced Settings > Intel Graphics and Media Control Panel > Graphics Properties...  Change it to Advanced Mode.  General Settings > Color Enhancement Change the Color drop down menu to All Colors, adjust the Contrast and Gamma settings until a photo looks as normal as possible.  My settings are:Brightness: 31Contrast: 40Gamma: .7Hue: 0Saturation: 5I'm sure I'll be playing with this as I go on, but for now it doesn't look absolutely awful, just mostly bad.Dan brought up the keyboard backlight, if you need to look at the keys to type be aware that the backlight is a green color and is ridiculously dim.  There are 4 adjustment settings, the first 3 are just about worthless, the 4th (brightest) looks like it should be the 1st or 2nd dimmest setting.  It doesn't bother me much since I know the keyboards backwards and forward.Other thoughts:I upgraded to Windows 7 Ultimate almost immediately after it's first boot.  The drivers on the samsung website all installed without a hitch if you install them in the proper order: Chipset first, everything else on the Samsung drivers page, but save IRST and HECI for last.  Getting IRST to actually work after doing a fresh windows install is actually a pain, and I haven't been successful getting it to work yet.  Copy and paste this into a Google search for a guide on notebookreview: \"660222-samsung-series-9-np900x3b-np900x4b-guide-intel-rapid-start-technology\"Apparently amazon doesn't allow you to link to external websites so you'll have to search for it.UPDATE:  I got IRST working finally.  I enabled UFEI in the BIOS, restarted, opened Easy Software Manager and it actually started working.  Installed Rapid Start software automatically, restarted and voila! The 8.3 GB partition created automatically and no more error saying IRST not enabled.  So it Is now safe to upgrade to any version of Windows 7 and retain use of all the Samsung software.  As such I am upgrading my rating from 2 to 4 stars. (It really should only be 3.5...)It comes with a 128SSD, but has partitions that you can't see (21.7 GB for recovery, 8.3 GB for IRST) so you're looking at usable disk space of 89.2 GB.  I have just about all the software I use installed and it's only occupying ~40 GB.  If you want to get that space back you'll have to delete the recovery partition, but you might have trouble returning the laptop if you choose to do so.Windows Experience Index Ratings:Processor: 6.9RAM: 7.6Graphics: 6.4Gaming graphics: 6.4Primary Hard Disk: 7.5Bottom line: It's no desktop replacement, but it's adequate for my needs.  Being unplugged for 7+ hours is ridiculously awesome.  I can't wait for taking a day off to sit at a park, cafe or beach and working on both business, and my tan, that sounds sexy enough to keep this thing around.  I'll be updating this review as I use it.", "Date": "June 13, 2012"}, {"Title": "Very Nice Ultrabook Contrary To Some Reviews", "Author": "EmbeddedFlyer", "ReviewID": "R1UP3ROY82EAOV", "Overall": "4.0", "Content": "First of all, I want to address some common criticisms of the 15 inch Series 9 (NP900X4C-A01US) in other reviews:Screen. Several have said the screen is \"horrible\" with very poor contrast and limited viewing angles. Perhaps Samsung has made some improvements but mine is just fine even with the out-of-the-box default settings. Yes it's sensitive to viewing angle in the vertical direction but you just adjust the angle of the screen and it looks quite good. Pictures, movies, and any combination of text and background colors I've yet seen all look reasonably good. The screen is better, overall, than a few Dells I have. Like any mat (vs glossy) screen the blacks are not as black but I prefer that over lots of annoying glare and reflections.Touchpad. Some have said the touchpad is a problem. Again, I've had no issues with mine. The cursor doesn't randomly jump around, I didn't have to turn off the gestures or upgrade the driver, and it generally does what I want it to do. Again, it works vastly better than the multi-touch pad in my newest Dell. It's made by Elan.WiFi. A few have complained the WiFi performs poorly. Granted I have a great WiFi router, but the Series 9 has equal or better signal strength anywhere in the house compared to my other laptops and devices. It's always 4 or 5 bars.Upgrade Options. One negative review here complains the SSD can't be upgraded without voiding the warranty. I'm not sure that person is aware that most Ultrabooks, the Macbooks, etc. have the same issue and often use proprietary OEM SSD boards (as the this one does) rather than regular 2.5\" drives. Sometimes the SSD is part of the motherboard. Laptops designed to use only an OEM SSD can be made thinner and lighter. If you want to pop the bottom off and upgrade components, get a regular laptop not an Ultrabook.STRENGTHS:Thin & Light. Samsung says it's the thinnest 15 inch laptop made and it's one of the lightest. The charger is also small and light. In a backpack you really notice the difference. It's nearly as powerful as a 15 inch Macbook Pro but far thinner, lighter, and cheaper.Cool & Quiet. The fan almost never comes on and it has a silent mode if you manage to get it to come on. It also doesn't make any squeels, whines, chirps, or other noises that some laptops (even with an SSD) make.Amazing Battery Life. I managed over 8 hours of constant use with the screen up fairly bright and heavily using the WiFi even on the first charge of the battery (it should improve further). With a full charge the time remaining estimate is often over 10 hours. For such a thin and light laptop with a fast CPU this is as good as it gets.15 Inch Screen. A rare Ultrabook feature and Samsung wisely chose not to cram full HD 1920 into only 15 inches.Well Done Industrial Design. Samsung is really giving Apple lots to worry about. This Ultrabook is every bit as sexy as any Apple laptop. The non-glossy dark charcoal metal finish isn't a fingerprint magnet like so many other laptops these days. The nearly all metal chassis is very rigid and well executed. The indicator LED's are very small, blue, and tastefully dim rather than blindlingly bright. There are many nicely done details.Fast Boot & Wake Up. The SSD and fast i5 CPU really help here but Samsung has added their own fast wake up technology and it really works. Almost by the time you swing the screen fully open the logon screen is there and even a full \"cold boot\" is very speedy.Lighted Keyboard. Many Ultrabooks don't have one including the 15 inch Vizio.WEAKNESSES:Sharp-ish Front Edge. There's a large palm rest area, and as long as you use it, the Samsung is comfortable to type on. But if you have big hands and like to rest against the front edge of the laptop, the metal edge there (just like all of Apple's current laptops) is a bit sharp and only slightly beveled.Keyboard. For an island/chiclet style keyboard it's as good as any I've used and I like it better than the Macbook Air keyboard. The layout is great. But the keys have limited travel and my fingers don't naturally fall into place as readily as with more conventional older style keyboards. It's unfortunate Apple started this fashion trend and nearly all companies, including Samsung, have followed.Upgradeability. As mentioned above, Ultrabooks are generally difficult or impossible to upgrade as they don't have any extra room in them. This isn't specific to this Samsung, it's true of most Ultrabooks. You should buy the model you need to begin with. At least with 8GB of RAM you shouldn't need to add memory.SanDisk U100 SSD. Some NP900X4C-A01US laptops apparently ship with a Samsung SSD but mine has a Sandisk U100 128GB drive. So far it's plenty fast but the reviews of the U100 indicate it's a bit slower than a lot of newer SSDs. At least SanDisk knows a lot of about flash memory and it should be reliable.Display. It's a normal TN LCD which means it has limited viewing angles--especially vertically. If you're doing critical graphics design, photo editing, etc. you may want a laptop with an IPS or otherwise better display. But for everything else, I think the display is fine.Samsung Branding. The default Samsung-specific screen backgrounds, user icon, etc. are not all that visually pleasing but everything is easily changed. It's kind of odd Samsung did such a great job on the physical design and then made poor choices for the \"soft\" stuff.WHY THE 15 INCH SERIES 9?I did quite a bit of Ultrabook research and ended up with this one because:15 inch screen with 1600 pixel resolution. Some 15 inch laptops run at 1920 x 1080 (full HD) and you end up with really tiny eye straining text or you have to increase the text size or lower the resolution creating fuzzy re-scaled text. And the 13 and 14 inch Ultrabooks suffer from either not enough screen real estate (i.e. 1366 screens or 1600 jammed into too little area).Thin and light chassis. Samsung claims this is the thinnest 15 inch laptop made and it's one of the lightest (take that Apple!). The nearly all metal chassis also makes it durable, attractive and solid.SD multi card reader. You would think this would be in all Ultrabooks but it's not. Even the new 15 inch Vizio leaves it out for anyone with a camera or wanting an easy way to take desktop files with you it's nearly a must have.Bright screen. Ever tried to use a laptop outdoors even in the shade on a sunny day? You can actually do it with this one.8 GB of RAM. A lot of Ultrabooks at this price and under only have 4GB of ram and many are not easily upgradeable due to their thin designs. 4 GB isn't enough if you want to run virtual machines or like to have lots of windows/apps open at once.2nd gen i5 Sandy Bridge CPU. This is an ideal CPU for an Ultrabook. It runs cool and offers amazing (10+ hour!) battery life yet it's plenty fast for anything except hardcore gaming. Faster CPUs just make make more heat which means fan noise and a hot lap. Slower processors don't help battery life much. The i5 is the sweet spot.No Power Hungry ATI/nVidia Graphics. A few ultra portable laptops use a dedicated graphics controller but, unless you're a gamer, you just don't need one and they seriously shorten battery life, run hot, require noisy fan cooling, etc. The Intel 4000 graphics in the Samsung work great for watching even HD video while not using any unwanted power.Value. This isn't a cheap laptop but, compared to other Ultrabooks, you get a lot for your money. The 15 inch Vizio is perhaps the closest competition and it doesn't even have an SD card slot to view pics from your camera.USB 3.0. In my opinion it's a must have for faster USB storage access and future expansion options. Contrary to some specs, it has 2 USB 3 ports.Gigabit Ethernet. Some Ultrabooks, and the Macbook Air, lack a wired ethernet port. Not everyone needs one, but if you need to move large amounts of data, even the best WiFi is far slower than a gigabit wired connection. A wired connection is also far less prone to glitching HD movie playback.128GB SSD. Some think 128 GB is too small, but my last ultra portable laptop had only a 40 GB SSD and I made that work just fine with Windows 7. I'd MUCH rather have an SSD than a noisy, fragile, error prone conventional larger drive. If you have huge amounts of video, movies, etc. throw them on a 32 GB or even 64 GB SD card or small USB 3 thumbdrive. If you need even more storage, use a USB 3 external 2.5\" portable drive. You can get a terrabyte for around a hundred bucks.Industrial Design. As mentioned above, Samsung is one of the few companies challenging Apple with their product design. The Asus Zenbook is another but it only comes with much smaller screens and has other drawbacks.HDMI + VGA. Some Ultrabooks leave off one or the other or even both. A lot of projectors (especially the ones built into meeting rooms) only accept VGA.Minimal Bloatare. Some manufactures load up their Ultrabooks with so much trialware and other unwanted software they take 4+ times longer boot than this Samsung and you lose a lot of drive space. The companies are paid to put all that junk on there and some of it gets left behind even if you try to uninstall everything. Samsung was far more restrained than most and out of the box the Series 9 boots very quickly. I only removed the games and Norton apps.CONCLUSION:Everyone's needs differ, but I'm really happy with the Series 9 so far. And I'm somewhat puzzled by some of the negative comments. Either Samsung has poor quality control (unlikely), they've made running improvements (more likely), or some here have chosen to unfairly critize it as they favor another brand or have unrealistic expectations (perhaps most likely). Mine is an Amazon verified purchased and I can only comment on my Series 9.", "Date": "September 6, 2012"}, {"Title": "Excellent ultraportable desktop replacement", "Author": "triskite", "ReviewID": "RZO9FQL0JI73B", "Overall": "5.0", "Content": "I had the np900x3b (2012 non-ivybridge 13.3\" series 9) since it was released and have loved it. Loved everything except the 4gB RAM. Being a Chrome user who likes to have 100s of tabs open, I couldn't do much else other than 'browse' the web.The np900x4c, while significantly heavier-feeling than its younger brother, is still extremely lightweight and sexy (3.5 pounds).The 8gB of RAM is user-upgradeable//replaceable, and the 10 hours of battery life is awesome (note: I have not tested it yet. Windows reported that I would have about 6+ hours with a full charge while running High Performance mode with maximum brightness).Pros:8gB RAMivy-bridge processorgraphics are excellent - it can play Diablo 3 without a problemmicro-HDMI out so you can watch Netflix on your TV with easegood number of ports (2xUSB 3.0, micro ethernet, 1xUSB 2.0, micro HDMI, SD slot)excellent build quality (very sturdy duralumin)15\" screentouchpad worked well out of the box (very impressed with that :)Cons:feels kind of heavy compared to other ultrabooksthe enter key is not the furthest right key (makes it harder to press quickly/easily/at night without a day of getting used to)128gB SANDISK mSata SSD - still 440 mB/s read/write speeds but not as fast or as high quality as the Samsung SSD found in the np900x3bSD card sticks out thus cannot be left inside the laptop (which would be nice because you can get a 64gB//128gB SD relatively cheap, effectively doubling the storage capacity of the machine)", "Date": "June 12, 2012"}, {"Title": "Beautiful, but cannot upgrade SSD without Voiding Warranty", "Author": "Shawn Wildermuth \"Author and Speaker\"", "ReviewID": "ROIX6P4NP7CFC", "Overall": "2.0", "Content": "It's a gorgeous piece of hardware and I liked the computer a lot but...I purchased this machine (From ANTOnline - don't do that, they have a 30% restocking fee). Only to discover that the 128 GB SSD only has 60GB available after OS install.  It's 90GB before OS install as they use 8GB for hibernation partiion and 25GB for recovery partition. 60 GB is utterly unusable for me.  So I thought i'd just upgrade it, but Samsung (pulling an Apple) decided that the SSD isn't user accessible so your stuck with the memory and SSD size.", "Date": "July 12, 2012"}, {"Title": "Good, but not great.", "Author": "Eric Jung Kit Lau \"Expert of Thangs\"", "ReviewID": "R36Z2ATUITUK7Z", "Overall": "4.0", "Content": "I first heard about the 15\" Samsung Series 9 back in early 2012; I wanted it as soon as I saw it but it was $1,500.  Definitely not worth it back then.  Fast forward to January 2013 and the price dropped to $1,019 on Amazon for the Windows 7 version, i.e. trigger pulling time.  (I immediately upgraded to Windows 8 for $15 through the Windows Update Offer when I received the laptop).I bought the Samsung with the knowledge of the other reviewer's gripes with the screen and trackpad as the main caveats.  In general I agree, the screen is not quite up to par.  It looks decent from one specific viewing angle, but if you move your head at any variation from the sweet spot the picture will look washed out.  Viewing angles are just bad.  However, after making adjustments with the Color Enhancement from the Intel Graphics and Media Control Panel, I got a much better looking picture that doesn't look quite so washed out:Brightness -1Contrast  48Gamma  0.8Hue  0Saturation  1The track pad is decent enough though, you just have to be hyper aware to not let your palms rest on it so that the mouse pointer doesn't spaz out.  Multi-touch gestures on Windows 8 are quite responsive.  Keyboard is so-so, again I'm still getting used to hovering my palms up in the air all the time.In terms of performance, this thing is plenty quick with the SSD and 8 gbs of Ram.  No noticeable slow downs.  Memory was extremely tight with only 50gbs or so of usable space, which is ridiculous.  I would recommend deleting the 21 gb Samsung Recovery partition in the C: drive and using that as additional storage.  This probably would make returning the laptop impossible though.All in all, comparing the Samsung to the newest generation Macbook Air that I've had for 5 months, i would say the screen, keyboard, and the trackpad are far superior on the Macbook Air.  The only advantages the Samsung enjoys over the Macbook Air is that it looks more stylish (in my opinion), is slightly thinner, and has much longer battery life.In terms of recommending the Samsung, I'm on the fence.  2013 will probably release a slew of Windows 8 convertibles/laptops with 1920 x 1080 screens for about the same $1,000 price point.  There's also rumors of the Samsung Series 9 being upgraded to a 1080 screen later on this year, but of course you'd probably be paying around $1,500 when that version comes out.  In summary, this laptop is a decent buy at around $1,000, but if you have the patience or don't need a laptop right away you should wait it out and get a newer 2013 laptop with much better specs for the same price point.  In your face.", "Date": "January 11, 2013"}, {"Title": "The perfect Ubuntu Ultrabook", "Author": "gnoshme \"K\"", "ReviewID": "R28TKN0X1HV7GE", "Overall": "5.0", "Content": "FOR EVERYONE:Only 57 GIGS FREE! Yikes.. That's Windows and the Windows recovery partition.LINUX / UBUNTU PEOPLE:I decided to write in detail because I'm sure many Ubuntu users out there are trying to think of a good Ultrabook as their weapon of choice.I chose this over:HP Spectre Envy- The don't get good performance reviews- I don't want to break the glass!Vizio Thin and Lights- Astonishing spec!- People don't love the keyboards- On Windows even after a driver update, touchpad still is quircky so that seems like a Linux risk..- Can't seem to find anyone out there who has installed Linux on it, and certainly no communityZenbook- I came close but the choice of resolutions for a 13.3 inch screen 1377x (too low) 1920x (too high) put me off- Ubuntuforum shows some serious challenges and I just don't want to fight with it.  If it had been perfect in all other ways I might have gone for it, but it isn't.- Most expensive optionSO.. why any Series 9.- 15\" screen with 1600x resolutions.. Heaven. Right in the sweet spot.- Theres a Ubuntu Community page for the series 9 which talks about various issues but none serious.  For me in the end the ONLY thing I had to do was paste the 4 lines in to two text files to get 4 extra function keys to work.. that's IT!- It's a really sexy piece of kit.  I've had a 15\" macbook pro up to this point and it looks like a monster beside this baby ;-)So.. why THIS Series 9Revisions: There have been 3 generations of series 9.  the 900X4B, X4C and now X4D.  Samsung seem to make things WORSE over time as they try and drop the price.X4B: Awesome SSDX4C: Better processor 8Gigs Ram, SSD is kinda junkyX4D: Slightly Better processor on the best models 4Gigs Ram!!!, Same crappy SSDSo, for me the X4C is the winner.  Give it a year and I'll put in a screaming fast 256gig SSD, and for this model it is confirmed that you can upgrade to 16gig.. (google it).UBUNTU INSTALL SUGGESTION:- boot into windows- attach an external drive.. NTFS ONLY- go to control panel > backups and make an image. If you have to return it you probably want it back to normal- UPDATE FIRMWARE!!! You can only do this under windows, and the latest firmware fixes an issue with suspend on close. Find the exe at Samsung.com and take care of this.- Install Ubuntu 12.10 64bit in \"replace windows\" fashion and you have 110 gigs free- Google \"Samsung Series 9 Community\" and follow the steps to fix anything that doesn't work (which like I said, for me was a few function key mappings).That's about it.  Phenomenally happy with this purchase and amazed that everything \"just worked\".  I'm used to fighting with some junky Broadcomm wireless card or something like that, but this just works.Have fun..K", "Date": "January 9, 2013"}, {"Title": "Worth It- The Best Ultrabook Right Now", "Author": "ITguy", "ReviewID": "RRLJNHRYGRMF4", "Overall": "5.0", "Content": "NP900X4C-A01US 15-inch Ultrabook, Ash Black; 8gb RAM and 128gb SSDThis is the best laptop I've ever used, and I've had some pretty expensive ($6000+) business laptops.  It's not cheap, but it's totally worth it.  It's one of the few products that makes you a chearleader for it. I'm very picky about computers, and I've been involved with them (building, repairing, supporting, writing software) since about 1996. This laptop has the perfect combination of features- it's truly optimal.  There has not yet been a better combination of capability and portability.  It comes at a price, but the premium level hardware and features definitely justify the expenditure.PROS:- The screen is beautiful, ignore the critics. I honestly don't know what their problem is, I'm  picky about displays. For my main PC I have two Samsung 24\" IPS displays that I bought when they were >$600, so you know display quality matters to me.  This is a VERY nice laptop screen.  It does have a 'sweet spot' for the angle, but I don't have any trouble getting it at the correct angle when I'm working. The matte finish is a huge bonus, you can use this outdoors or in any lighting.- Keyboard- the best one ever on a laptop; no mush, solid, no flexing. The layout is great, I have no trouble with the Delete/Home/End layout, it's better than any De-l or  Len-vo I've had, and I consider Len-vo to be the standard.- Has TWO USB 3.0 (right side) and one 2.0 (left side), check the icons- the ones with 'SS' for 'Super Speed' are the 3.0 ports. They are also blue.- I had never used multi-touch before, I adapted in one day. I see why people rave about it. Now I'd rather use the multi-touch trackpad than an external mouse.- Boot times are unbelievable. The first time I rebooted, I was talking to someone and completely missed it- it was already at the login prompt.  Average is 10 seconds to boot including BIOS, and 1.5 to wake up from sleep.- Again, boot time.  You -WILL- start showing people so they can see how fast it is.- Battery life has been EXCELLENT- this is the first laptop I've had that can go more than 6 hours on a charge, and it usually goes 7+ when I'm actively using it.  If I do nothing but stream movies, 6+ hours is average. This is with fixed medium screen brightness.  If I'm only browsing (usually along with streaming music), it will routinely do 7.5 hours.- Drive space has NOT been an issue as I feared; after I added everything for my standard build, and removing all the pre-installed crap, I have 38gb free of 89gb total. When I get tighter on space, I'll get a replacement mSATA SSD and swap- after the warranty is expired.- It has the best laptop sound I've heard. With good headphones, it's FANTASTIC. The built-in audio controls are very good, comparable to EAX. The speakers are very good, they are under the front sides about 2 inches from the front- volume and clarity are very good.- The charger is NOT cheap, it's light- great for travel.- CPU Speed is great, NOT an issue, I was thinking about buying an i7 instead, but I've seen no slowdowns in my day-to-day use, and the expense would NOT be worth it.- Has 2 video outs- mini HDMI and mini Displayport. Not sure if both can be used together, but HDMI connects to HDTVs without trouble. The keyboard video-out controls work great with HDMI.- Does NOT burn my legs when I use it on the couch. This is the first laptop I've used that I don't need a pad or cooler under it.- Hinge is great, the lid stays where you put it. The lid has magnetic closing, so when it gets almost closed it kind of 'snaps' shut. It also stays closed, in fact opening it has to be done with two hands. This is partly due to the light weight, the bottom doesn't weigh enough to let the bottom stay down while you lift the top.  I'm used to laptops with a latch or button you can open with one hand.- I thought the lighted keyboard was a non-feature, but I like it. It's a soft greenish glow. There are 4 brightness settings, the middle two should work in almost all situations, and you can turn it off.- Overall design is really wonderful, many thoughtful touches.  The Series 7 and Series 9 are basically the same, just different port placement. This thing looks nicer than a Macbook Pro, it attracts attention from Mac people who think it's Apple hardware.  If you've ever thought of building a Hackintosh, this is what you should get instead.  The color is actually a midnight blue, very dark, but I wouldn't call it black.CONS:- I thought I was having intermittent trackpad problems- the pointer would stop and not react at all. I've found that this is ALWAYS from my hand resting on another part of the trackpad, usually my left palm. This is made worse by the trackpad being pretty far to the left.  I have gotten used to this and now lift my left hand if the pointer stops. I have not found any adjustments for this, some touch/trackpads have adjustable 'palm rejection'- I think it's built-in to this one and not user-adjustable.  I think this is the only design flaw in the entire system- the trackpad should be farther to the right.- The charger plug is tight, if you pull the cord it will yank the computer off a table.- WiFi is not super speedy, but no worse than other (Len-vo, De-l, H-P) laptops.- The keyboard volume control uses steps that are too large - only 10 steps total. It could use about 16.- For this level of laptop/Ultrabook you would think the SSD would be larger than 89gb.  It's because it uses a mSATA drive.  This is the one area that was compromised for portability's sake.  To compensate, I just bought a 32gb micro-USB drive (San-isk) for $20.  I can leave it in the USB port and never notice it.  I thought an SDXC card (64gb) would work, but the card sticks out past the edge of the laptop, I was afraid it would break when taking the laptop out of my bag.- The display backlight sensor is above the ESC key, so if a shadow falls on it- like when your hand moves while you're typing- the backlight dims. It's annoying, I just disable it. Ok, maybe that's the second (very minor) design flaw.Tip:  With 8gb of RAM, it's hard to run out.  I use 1gb as a RAM drive and point Windows (and browsers) to use it as TEMP file storage.  This speeds things up even more.", "Date": "September 22, 2012"}, {"Title": "The best available today.", "Author": "Curtiss", "ReviewID": "R2778CFIRW94BL", "Overall": "5.0", "Content": "If you're like me, you read these reviews obsessively.  Given some of the crazy comments I've seen on here, and having owned one of these for a few days now, I had to add my two cents.First, regarding the screen -- it's great.  Maybe these guys are professional photographers or something, but I don't notice it being washed out at all.  It's RIDICULOUSLY bright.  So much so that the only time you'd ever need to turn it up all the way is if you're outdoors in full sunlight -- and even then it works great.  I'd say it's on par or better than the T420S and the T410S I had before. Certainly better resolution.The trackpad is AWESOME.  Far and away the best trackpad I've used on a windows machine.  I'm a lawyer and I'm pretty picky about my input devices.  I've been using Lenovo laptops for the last several years.  Coming from a Dell in law school, I've been disappointed with Lenovo's trackpoint software.  There's some glitch where the scrolling doesn't work quite right in certain applications.  I'm told this is somewhat improved in the X1 Carbon, but that it's still iffy on some applications.  The multi-finger gestures with the S9 work fantstic.  Maybe some of the early models had problems, but the palm rejection, the scrolling, the double-finger tap, etc. -- all great.As for the keyboard, a couple comments -- the backlight works fine.  Really, the only thing it needs to do is illuminate the letters, which it does with aplomb.  No problem seeing the keys in the dark (I'm typing this in the late evening on my back patio).  IMHO -- the only reason to make it brighter is to burn up the battery quicker.Second, coming from a Lenovo, I have to say that I was initially disappointed with the keyboard feel.  All the reviews are correct that the keys are shallow with a harsh landing.  That said, I've been typing with Lenovo keyboards for years.  A transition is to be expected.  After only a few days, I'm already much more comfortable with it.  I just did 103 words per minute on 10fastfingers with 98% accuracy.  I'd say that's pretty good, and matches anything I ever did on my T420S.  I'm a guy who types for a living, and I'm plenty happy with this.  I imagine that, in a year when I upgrade, I'll be complaining that the new keyboard doesn't feel like this one.Relative to the X1 Carbon, which, I think, is the natural comparison, I get more memory, a bigger screen (same resolution -- but at resolution this high, who wants the actual letters even smaller?), replaceable memory and hard drive, and a WAY BETTER BATTERY LIFE.  Battery life is what makes or breaks an ultra-portable.  A whole day of meetings without having to recharge is an absolute game-changer.  With the bigger screen, I can have two Word documents up at once and the text is plenty large enough to read.  Also, the charger is a lot more elegant than that brick shipped with the Lenovos.All of that is to say, I'm happy with this purchase.  Also, I bought it at a local Walmart for almost $100 less than the cheapest Amazon retailer (crazy, I know).  Feel free to ask questions.  I'll respond promptly.****************** UPDATE December 5, 2012 ******************I sold my Series 9 and bought an 11.6\" mid-2012 MacBook Air.  I purchased the Series 9 for a particular job, and wound up taking another.  That said, I have some thoughts to share, having used the machine for a couple months.First, I take it back.  The keyboard is pretty horrible.  In contrast to the Apple keyboard, it's really spectacularly bad.  The keys are \"clackety\" and pretty loud in meetings.  The shallow travel is harsh, and without the concave surface, my hands tended to drift while touch-typing.  In contrast, the MBA keys are a dream (on par, I'd say, with Lenovo's)  Likewise, the trackpad was constantly picking up random palm touches, particularly when the machine was placed higher relative to me (e.g., some tables in conference rooms are higher relative to the chairs, than others, which would lower my palms relative to the deck of the keyboard causing palm touches and crazy cursor).  That NEVER happens on the MBA.  I'm not certain what the difference is, but for my typing style the difference is night and day.I bought the machine thinking I'd principally be doing desktop work.  However, in my new job, I use it primarily for meetings.  In that environment, 15\" is just too big and obtrusive.  Even with the smaller bezel (and dazzling good looks), it's just too much real estate.The battery life was spectacular, and the Samsung branded sleeve I bought is really very nice.  It was easy to carry around and the performance specs were all as promised.  In the end, I was really pretty frustrated with the keyboard and trackpad.  Samsung needs to hire better engineers in those departments.Now, if I could just get more battery life out of the MBA.  Thinking about picking up an Asus VivoTab TF810C.  19 hours and Windows 8!!", "Date": "August 27, 2012"}, {"Title": "Premium product at a premium price with inferior quality", "Author": "Albert Schmitz \"Albert\"", "ReviewID": "R33K5X4Y4XJRPQ", "Overall": "1.0", "Content": "First of all I loved the Samsung series 9 for it's speed and sleekness.That being said the product has continued to disappoint me to the point of finally reviewing it.Ownership since July of 2012 has been bliss until one day I needed to restart the machine and noticed upon shutdown that the bottom of the screen had white lines in it.  Upon further review the screen has a crack from the left to the center of the screen and has since started to radiate up into the screen itself.Chatted with customer service and was asked to fill out a concise clam with pictures which I promptly did.  Noticed once the pictures were loaded that the submit button disappeared.  Went back on to the chat and another less helpful \"customer service\" person engaged me.  At that time I was told that a cracked screen was not their problem and considered abuse.  (Note:  I have had many computers in my life and this one is the most fragile that I have ever owner.  First broken screen on any of my products.)  Sorry for the rant.  Told me that he would escalate my concerns to the executive level and they would be call me back in 2 business days.  That was last Friday and today is Thursday.  I guess 2 days was a lie to get rid of me.  Here is the impersonal email that I just received. \"Albert;  We received your claim in our Executive Customer Relations department regarding your Samsung Notebook Computer. I reviewed your request for an warranty repair due to a cracked panel. Samsung warranty does not cover replacing a cracked panel. This is considered physical damage. This can only be determined after inspection by a Samsung Tech. Please give us a call at 1-800-726-7864 to further discuss your concerns and for assistance in setting up a service to repair the unit.  Thank you;  Gregg L.\"So much for the phone call.  I have purchased many Apple products over the years and anything that happened within a year they handled at the store or online with no hesitation.  This was not the experience that I had with Samsung and cannot recommend any of their products considering the price you pay for it vs the reliability, quality and service you receive for the dollar spent.  If this was a sub $1000 computer my level of contempt for them would not be as much but alas I am off to the Apple store to buy a better product again and never to consider the Samsung brand again.", "Date": "December 20, 2012"}, {"Title": "An OK laptop but not worth the money for me", "Author": "Namo", "ReviewID": "R283NGFYCAUZIZ", "Overall": "3.0", "Content": "I've had this laptop for about 5 months now and have finally decided that it's time to return it. I used my previous laptop for about 5 years and after 5 months with this one, I absolutely cannot picture myself using it for another 4.5+ years. I purchased this Ultrabook as a business travel/internet machine. I didn't need a super-high performance laptop since I build my own desktops so that's where I'm coming from with this review.The pros:- Beautifully bright screen and amazing aesthetic design. This thing is pretty, that's for sure. Probably why I put up with it for so long.- Speakers are surprisingly good for a laptop. I was surprised when I heard them the first time.- Keyboard is very nice. Well-spaced and backlit.- Quick SSD that I haven't had a single problem with (besides Samsung's \"fun\" partitions).- Charger is light and tiny. Definitely a travel plus.- Battery life is amazing. I can go an entire night without charging the computer. 6+ hours easily.The cons:- Immediately out of the box, I had to reinstall Windows. The computer had a bunch of bloatware on it and there were a few driver incompatibilities that meant that the computer was not performing up to what it should based off of specs. Reinstalling windows... no problem, right? Well it comes with a recovery disk... but of course there's no optical drive. I didn't have a USB optical drive so I installed off of a thumb drive. It worked just fine, but it's kind of a silly oversight to send a recovery DVD with a system that has no DVD drive. It would not be easy to do this if you have little tech knowledge.- The \"hardware\" buttons on the keyboard (LCD backlight, sound up/down, wifi on/off, keyboard backlight...) are all run through Samsung's proprietary software EasySettings. You can guess where this is going. These buttons do not work if that software isn't running. It makes no sense that physical buttons on the keyboard have to go through software in order to function. On top of that, even if Samsung HAD to do it that way, it's frustrating that the software noticeably slows the system down.- The SSD is partitioned in an amazingly stupid way. It would make sense if you had a 500GB+ drive, but this is a 128GB SSD. There's the standard loss of space with the OS and such, but Samsung partitioned a recovery hard drive with 20GB+ and with all of the bloatware, I booted up for the first time with about 60GB usable. That's pretty unacceptable for a 128GB SSD. I cleared Samsung's partition and after the Windows reinstall, I had 100GB+ which is enough for me. Again, someone with little tech knowledge or someone who just \"wants it to work\" might be in over their head with this.- Noisy fan when it's plugged in. Not a killer con, but still kind of annoying.- Screen is starting to get keyboard imprints on it (from the lid being closed). The laptop is only ever closed on a desk (that is, no pressure on the lid to push into the keys). Nothing bad, but you can definitely see it when the backlight is off.- Screen has contrast problems. It's bright, but a lot of times it's tough to make out words when it's not black on white text. At wide viewing angles, you lose all contrast. The screen even flickers if you look at it at the wrong angle (from extreme below, on battery power. This reflects onto the keyboard and you can definitely notice it in your peripheral while typing).- When the laptop is on battery power, there's some definite drop in capability. Typing will lag every now and then on browser-intensive sites (like Facebook, specifically). I'll be typing away and then realize that half of my sentence hasn't shown up yet. Definitely not acceptable from a laptop of this price.- Here's the kicker for me and why I'm returning it: the trackpad. When it works, it's not bad at all. But starting about a month after I bought it, it started having hiccups. I would be swiping around while browsing the web and it wouldn't register some of the swipe. Odd, but it was only every now and then. Nothing to complain about too much. But then it got worse. Over the next few months, the trackpad would stop registering any touch at all for a few minutes at a time. Very frustrating. But at the very least, it would come back semi quickly. Then, over the last month, the trackpad will die out for more than half an hour at a time every hour. It's gotten so bad that I have resorted to using a USB mouse because I can't use my laptop otherwise, which completely kills the travel aspect because I have to lug around a mouse too.Bottom line: It's a great travel laptop. It's lightweight and sleek, too. For me, though, I'm a bit of a perfectionist when it comes to computers since I'm on one about 12 hours a day between work and personal, and this laptop just didn't cut it. For the price I paid, I'm not willing to accept all of the nuances and frustrations. Samsung customer support is VERY poor. Amazon customer support is VERY amazing. The former treated me like I was an idiot but were offering repairs since it was under warranty but no other compensation. Amazon treated me with respect and offered a full refund. Guess which one won out. I'm returning this laptop as soon as I can and hoping to try my luck with another brand. Like I said above, I can't see myself living with this laptop for another 5 years, especially with the trackpad problems.", "Date": "March 8, 2013"}, {"Title": "REALLY REGRET!!!", "Author": "Ralphael Brito", "ReviewID": "RTS699YQQYU6B", "Overall": "1.0", "Content": "I really regret buying this device... the charger get really really hot. The wireless adapter does not work well, just to hibernate and you have to reboot your computer. But the worst part is Samsung support: it is the WORST ever!!! I followed all the procedures they told me to fix the wireless adapter problem, just a Basic Recover.... and since then my computer just get Windows blue screen!!! I went to Customer Representative office and I got the worst service ever! Now I have a big big problem. Think 1000 times before buying Samsung!", "Date": "February 25, 2013"}, {"Title": "Way too many problems", "Author": "SG", "ReviewID": "R3U28W1IMOHX8X", "Overall": "2.0", "Content": "I bought this laptop about 6 months ago from Best Buy for 1,499.00$ after reading every review available in any configuration and size. Back then this was the best model available and I debated whether or not to drop 1,500 on a laptop was worth it. Well, I can tell you now with 100% certainty that it's not even nearly worth it.PROS:Small size - I travel a lot and needed something that would take up minimum space in my carry-on and this was probably the thinnest and lightest and best reviewed laptop available at the time. It's probably still the most portable 15\" laptop available. If portability is more important to you than anything else this might be worth it. But then again, you are better off getting the 13\" model. I regret not doing that from the start.Durable - This is probably the most durable laptop I've owned and I've gone through about 6 in the past 3 years. I've held on to this one the longest now. This thing is tough on the outside.Good Screen - It's bright and has good viewing angles. I don't do photo editing so I can't tell you if the colors are great or not.CONS:Glitches - Wow does this have glitches. Forget about the super fast start. It only starts fast when nothing goes wrong and that rarely happens. More often than not, you're laptop won't start up from sleep, will have the track pad not respond, or be extremely slow with windows crashing. Total BS for a computer of this price. Upgrading to Windows 8 did nothing to help. In fact it might be a little worse. Your only fix is a reboot. This happens often.SD Card Slot stopped working after a week.Lack of ports - All the mini version ports and no dvd drive is the price you pay for having a super thin laptop. I rarely ever use these things either but when you do need it, you'll hate yourself for buying this.LOUD - I think its the CPU fan but it's the most annoying thing I've ever heard on a laptop. It will drive you crazy. Maybe it's just my laptop, but still, that doesn't speak well of Samsung build quality.SLOW, SLOW, SLOW - This computer can not handle 20+ tabs, a few excels, and a few docs open at once. It's only a matter of time before it crashes. If you need a lot of things open at once for work, don't even think of getting this model.Keyboard and Mouse - I always thought I could get use to the thin keys and trackpad. and for the most part I have. But if you use your laptop a lot, you'll definitely notice your work is being slowed down by both.WIFI isn't greatDO NOT buy this laptop. Trust me. I know it's good looking and you're convincing yourself that I probably just got a bad one, and you can get over most of the other negatives.. but trust me. It's not worth it. Even if money is not an issue, it's just not worth it cause it performs so poorly. And the glitches and build quality will make it barely usable. If I had to do it over, I would get the cheapest 13\" model of this laptop (just because portability and durability is essential for me), use it only for travel and light work, and buy a more powerful slightly larger laptop for every day use. I will now never own another Samsung or Toshiba laptop again.", "Date": "January 30, 2013"}, {"Title": "Almost quite the perfect laptop", "Author": "Soo J. Lee", "ReviewID": "R16ZHY1N6UR3DE", "Overall": "4.0", "Content": "I have been playing with this laptop for a few days to assess all aspects. First off, the build quality is top notch. The screen hinge is sturdy, buttons work well, etc. This thing feels extremely solid. Although the SSD is a SanDisk U100, it seems fine for me as I am coming from a 7200rpm hard drive. I was a bit skeptical of any Windows touchpad but this one works really well. Zoom,scrolling,multiple finger gestures all work.I have yet to test out the Intel HD 4000, I will be hooking it up to two 24'' monitors later this week. That will also test out the 8gb RAM, although that amount should be fine for most users.I only have one con,rather annoying one. After various recovery and hibernation partitions, usual space upon unboxing is only 52gb! Since I am not a tech expert, I have spent several hours researching how to clear up some space. So far, I have deleted the recovery partition which has given me back around 22gb of usable space. To save space, I have developed my music library on a SD card(the card for the most part is inside the slot so it is not a bad solution to save some space. Hopefully later this year or next year, I can upgrade to a 256gb or even 512gb(if available next year).", "Date": "July 22, 2012"}, {"Title": "EXCELLENT Notebook for Work and Everyday Use!", "Author": "Osiris1818", "ReviewID": "R22XLE41JXV081", "Overall": "5.0", "Content": "I wanted to do a little bit of test-driving with this product before putting up my review.  I had read reviews rating this notebook on both ends of the spectrum.  Some noted issues with the track-pad while others seemed to use it just fine.  Some complained about the size of the SSD.  Some complained about the quality of the picture/text and the viewing angle.  These are the 3 main discrepancies that I saw.  Here are my comments to those issues:Track-Pad: I personally have had minimal discomfort using the mousepad on this laptop.  Other buyers complained about the sensitivity or it not working correctly.  I bought this notebook primarily as my work computer, so to be honest I rarely use the track pad anyways.  I use a USB mouse since any trackpad would hinder my ability to work on it, so honestly if you need to move the pointer with efficiency and accuracy, you should probably be using an actual mouse anyways.  But as for when I am just sitting on the couch or in bed, the touchpad works perfectly fine for me.  It does have some interesting features such as the pinch and contract/expand to make the text or interface of certain websites/applications bigger or smaller.  A pretty interesting feature, but honestly not necessary.  I am sure this can easily be disabled to avoid any frustrations.  So while not PERFECT, the track-pad is FAR from a disaster.SSD Capacity: The 120gb SSD yes does end up being about 92gb with OS and recovery partition.  But honestly, what respecting computer consumer actually expects to get the full capacity of the hard drive advertised?  After installing some programs and games, I still have over half of the remaining 92gb left.  As long as you do not use the laptop for music/video storage you will be fine.  (Get an external for all the other crap.)Monitor Complaints: Again, this is a nit-picky thing that I have found to be a non-issue.  Now I am the type of tech guy that gets headaches when I watch TV in standard definition, but the picture quality of the Samsung ultrabook is nothing short of satisfactory for a 1600x900 resolution picture.  Text in webpages look fine, and I have had almost no issues with the viewing angle.  While the monitor will not blow you away with ulta-real looking images, I have not once regretted getting this sub-1080p computer.So in conclusion, this notebook was an amazing buy for me.  The i5 processor speed combined with the quickness of the SSD makes doing my work a breeze since I am NEVER waiting on this thing.  If you want a laptop just for general web-browsing and typing college papers, this thing is actually over-qualified.  But the on-board graphics make this thing a no-go for gamers.  It is a well-balanced piece of equipment that capitalizes on efficiency and heck, it damn sexy to look at.  I constantly get compliments on it's appearance alone, not to mention its operations speed/power.10/10 for my purposes.  You will not be disappointed.", "Date": "September 30, 2013"}, {"Title": "Blue Screened Right out of the box", "Author": "DavidsonvilleMom", "ReviewID": "R10HC161SKBEPB", "Overall": "2.0", "Content": "The computer blue screened within 5 minutes of being on! the Wifi is terrible!! I did speed test with the Samsung and did it with a 5 year old dell. . . . the Samsung barely had .49 download and only 1.4 up.... the dinosaur (old Dell) was significantly higher. WAY to much money for a computer of this price. I like that it is quiet and cool sitting on my lap but it is going back just waiting for info from the seller. VERY disappointed.", "Date": "August 18, 2013"}, {"Title": "Terrible Laptop", "Author": "Chris Maksimik", "ReviewID": "R1VXGEBM8H1WTS", "Overall": "1.0", "Content": "Touchpad is too big and too sensitive, it gets in the way while typing.Stress cracks appeared at hinges after 3 weeks of use. Samsung acknowledged problem and coverage under warranty. Sent to 3rd party for repairs, repair company then voided warranty due to \"Damage\". They then offered to repair $7 cover for a $50 \"Evaluation Fee\" and then whatever costs for the actual repair.Laptop sent back from repair facility with hinge cover split open with screwdriver from Technician.Keep away from this product until Samsung designs better mechanical limits on this laptop hinge.We have had a very poor experience with Samsung on this. As a Global company, it would be nice if they would stand by their products.I have had IBM (Lenovo)and Dell laptops in the past. They had no issues making repairs, IBM even sends a prepaid Box for shipping.", "Date": "April 22, 2013"}, {"Title": "Awful screen, INSANE trackpad.", "Author": "Susan \"Susan\"", "ReviewID": "R12P8T3L3UKH5X", "Overall": "2.0", "Content": "I did read all reviews on Amazon before making the purchase. I know the screen and trackpad is awful, and I thought I could live with it until now i have it on my hand and found out that this is THAT BADI am by no means a photographer; I am a student. I've used many brands laptops, Apple, HP, Toshiba, and Lenovo. Apple is the most user-friendly laptop, other three are average Windows laptops, while Samsung's laptops is NOT MADE FOR HUMANAfter changing contrast and settings, it gets better, but still unacceptable. It looks purple, and everything looks wash out. Black does not looks black, white does not looks white. Not to mention the insane trackpad, moves as you are typing so you will end up with somewhere random. It also make great noise when tying, which is annoying. Both issues are stated in previous reviews, and I regret that I did not listen to them. I am going to send this thing back and wait for new generation to comeThe only thing positive is the battery life. But the screen and trackpad make this laptop totally unacceptableI also want to comment on Amazon Warehouse as I purchased a Like New unit from them. It supposed to be functional, but the backlit keyboard and several function keys are apparently not working. If they really ever check rather than just list it, they should not ship this defective unit to me and list it as Like New to confuse other costumers.Samsung needs to focus on user's experience, rather than putting specs all together making an device. I own many Samsung electrons, including Galaxy note, nexus, while they are well made, I still cannot compare the experience I had with them to that with Apple's products.", "Date": "January 30, 2013"}, {"Title": "Very Good Computer - Terrible Track Pad", "Author": "E. Hall", "ReviewID": "R1M9DQIQFC6QTS", "Overall": "2.0", "Content": "While I very much like the computer, the touch pad is a deal breaker. It is so sensitive that sometimes merely passing my hand over the pad opens a window. I know it sounds impossible, but it is true. I have downloaded the most recent driver and set the sensitivity setting to the lowest values. If you are willing to rely on an external usb mouse the computer will meet your needs. It is light, attractive, great battery life, and I find the screen to be fine.I have upgraded to Windows 8 in the hope that might mitigate the problems with the touch pad, but no luck. As I bought the Series 9 to take with me when traveling, the use of an external mouse is not an option. Therefore, 2 stars is the best I can do on balance.", "Date": "January 19, 2013"}, {"Title": "Warranty Service is very Poor", "Author": "G. Yocum \"fixitgeorge\"", "ReviewID": "RJ0E5RVPK422Y", "Overall": "2.0", "Content": "After less than 3 months the Computer Died..No Video , Nothing came on.Sent it in for repair. Warranty is 36 months both Parts and Labor and They fixed the Hardware issue and now they want to charge me to reimage and to ship it back. I did nothing to cause the problem as it was a Hardware issue.Then they try to get money from me when it was Samsung's fault.Cheap service....", "Date": "December 21, 2012"}, {"Title": "Bye Bye Samsung", "Author": "Paul", "ReviewID": "R1DS0Z42CIBBP6", "Overall": "2.0", "Content": "A great looking machine.... BUTThe display is utterly crap... washed out, too bright, high contrast... bareley readable. Ive tried various settings reccomended on forums from users facing the same problem. Outrageous considering the $1400 pricetag.WiFi drops out ever three minutes or so, regardless of power settings.Buyer Beware.", "Date": "December 13, 2012"}, {"Title": "Classy, Beautiful, and Lightweight", "Author": "MH \"author and freelance writer\"", "ReviewID": "R20EMQ26GT47PV", "Overall": "5.0", "Content": "I've used Dell and Thinkpad laptops in the past, so it was a pleasure to try something different in the Samsung Ultrabook. This laptop is very sleekly designed as well as being lightweight and highly portable. The touchpad is intuitive and easy to use. Because of is classy appearance, this is a great laptop for anyone who must work in a public or professional environment. I also love the quick boot feature, enabling me to go right to work where I left off on projects from the previous day. The keyboard on the Samsung is not quite as flexible as others I've used, but this is not really a problem. I'm hoping that this laptop will prove to be more durable and reliable than others I've had in the past. However, I've had great experiences with other Samsung products so I'm hoping this one will hold up to extended use. The Samsung performs exactly as advertised so far. A real joy!", "Date": "May 13, 2013"}, {"Title": "Same laptop, completely different review", "Author": "Inseock Lee", "ReviewID": "R2RM41JKC20V2H", "Overall": "3.0", "Content": "Before I bought this laptop from amazon, I researched about this laptop in Korean website and blogs. The review was pretty good. People said this laptop provides the best display angles. While comparing Samsung Series 9 NP900X4C-A01US model and same spec Korean model (NT900X4C-A58), I found out NP900X4C-A01US has 340 nit brightness, while same spec Korean model has 400 nit brightness. I really didnt think there are no differences between NT900X4C-A58 and NP900X4C-A01US. But after I bought this laptop, I realized I was competely wrong.The display. Yes I was horrified by the washed screen and its horrible angle. The reality was completely different from reviews of same model written by Korean people. The model was exactly same. There are no differences between NT900X4C-A58 and NP900X4C-A01US except brightness. Why Samsung sells this horrible laptop that has horrible screen problem while they sell  same laptop that has perfect display in korea with almost same price in America????Samsung why?", "Date": "May 8, 2013"}, {"Title": "Less is more", "Author": "Prisoner zero", "ReviewID": "R18OXVYE4ZFBCA", "Overall": "5.0", "Content": "I was a little concerned about running with such a small hard drive. But after almost six months of using it I can say it hasn't been an issue. The bloatware is minimal. The included Samsung software is somewhat useful but there is some elements of it that seem unnecessary.The build is solid. The screen is nice and I have grown to appreciate the matte finish. The charge connector is the only weak point. I don't know why you would make such a well built laptop and throw on such a cumbersome and seemingly fragile charger. The location isn't great either.The price seemed a bit excessive, but I would probably buy another Samsung laptop regardless.", "Date": "April 27, 2013"}, {"Title": "nice but.....", "Author": "Nomlad", "ReviewID": "R2Z0VZVZG8HPYW", "Overall": "1.0", "Content": "This is a well constructed piece of hardware and of course I expect with computers that software issues can sometimes come up over which the manufacturer has little control.  That said, for such an expensive laptop I don't expect to have the mouse pointer regularly disappear/trackpad freeze leaving no choice but to reboot get it back - even driver updates and hours of googling has not fixed this.  The trackpad and mouse are at the center of a user's experience with a laptop and should simply work - life is too short. I will return it, hence, 1 star.", "Date": "April 11, 2013"}, {"Title": "Perfect for work", "Author": "Edward Ahn", "ReviewID": "R6IMDX6Y3CKGU", "Overall": "5.0", "Content": "I chose this laptop for its weight and thickness. I work across 3 different sites so I knew I had to have something ultra portable and snappy fast. It completely lived up to my expectations!", "Date": "March 29, 2013"}, {"Title": "Best laptop I've bought", "Author": "Aleksandar Hristov", "ReviewID": "R1O65MP9OX95N3", "Overall": "5.0", "Content": "This is hands down the best laptop I've ever purchased.It is incredibly fast, very mobile and very nice design and quality.Quality:Exceptional ! I've had gaming laptops with top components from respectable companies and with every single one I've had issues with the smaller things (mic, camera, speakers, etc). This is where they've saved some cash. Thankfully this is not the issue here and Samsung has paid careful details to every component, not just the CPU and RAM. There's really no fault I can find with this laptop and I've tried, really tried to find.Fast:Boots windows in 13s. Starts every application within the second. Can play any game !!! I'm serious, it does play every game. Most of them on very low or low, but still it does play them and it is very convenient. I'm a gamer and I'm usually very picky on this subject. To give you an idea, I have Alienware M17x R2 with maxed out specs, CF and so on and now I play the games on the Samsung. This is really weird, but taken the fact that it is 10 times quieter, lighter, this really won me over when gaming.Overall, I really and I mean REAAALLY encourage everyone that is ready to spend ~1000$ for a laptop and wants something ~15 inches to buy this laptop. You won't find ANYTHING better. I've looked hard", "Date": "February 13, 2013"}, {"Title": "Great weight, speed and performance for business travel", "Author": "Norman", "ReviewID": "R1UZTW7Q32I09J", "Overall": "5.0", "Content": "Had a bit of a challenge to initially set-up and configure the original system, as I had purchased a 'refurbished' new unit. But using online resources, got everything working to factory specs and all information successfully transfered from my earlier 8 year old Sony Vaio laptop. This Samsung system's large display looks awesome. After one month of break-in and use, getting 10 hours of battery life. The AC power supply converter is less than a quarter of the size and weight of my previous laptop and this Ultrabook itself is truly 'featherlight' at less than 4 pounds, while having a larger 15 inch HD screen. The keyboard works fine and have had no issues with the touchpad, even when typing at >60 wpm. After three months of research prior to making this purchase decision, I am totally satisfied with the quality and superior performance provided by this Samsung Series 9 Ultrabook.", "Date": "February 8, 2013"}, {"Title": "Not quite perfect", "Author": "Annice Y. Grinberg", "ReviewID": "R3A5PJ1LQ61AWD", "Overall": "4.0", "Content": "I've been using my ultrabook for about two weeks, and am very pleased with it except for one thing: the touchpad.  I find that my finger has to be at almost the exact center for the left-click option to work or for selecting or dragging text.  So I bought a Bluetooth mouse, which solves the problem when tne $#%&@ thing works.  (See my review of the Microsoft Bluetooth Laser Mouse 5000. Microsoft Bluetooth Notebook Mouse 5000 - Black)Other than that, I love the backlit screen, the keyboard and the very light weight.", "Date": "January 25, 2013"}, {"Title": "great product when used as an Ultrabook", "Author": "Paul Lang", "ReviewID": "R1YXUAB00F18R6", "Overall": "3.0", "Content": "EDIT**** 3/24/13:  3 months of use as the primary computer in the house, and daily use at school.Uses:  Micro$oft Office 2010, Basic Surfing, Occasional torrenting of work-related files (I'm too lazy to post zip files to mediaf!re), playing music (both saved flash videos and mp3's using Winamp).Avg use per day: 6-7 hoursTech Level of User:  moderateHerein, I review the Samsung Series 9 after three months.Bottom line review (specifics below):  This is an Ultrabook, designed for and intended as a superlight, portable machine for school, coffeeshops, and lightweighti stuff you'd do there (surfing, office stuff, listening to music).  As an Ultrabook, the SS9 is an excellent product that competes with the best on the market, and generally suffers flaws similar to other ultrabooks, with caveats (keyboard and touchpad delight some and horrify others - your mileage may vary).  As anything else (eg desktop gaming, graphics, etc.) or when used beyond what it was designed for (like running 3 monitors while writing a paper while running powerpoint while checking email while running winamp off a portable drive), the SS9 becomes mediocre and hard to recommend.***Do not buy this as anything other than an ultrabook, because most of the features quibble about relate to uses beyond its design.***I bought this because my huge Quad-core desktop replacement was too heavy to lug around on campus.  Wanted something light with a decent screen and great battery life. Its limitations frustrate me, but it does what I wanted it to do otherwise.**********Pros***********As a machine for school it has very fast boot and transfer via USB3, it's light, I get a full day's worth of use out of a single charge, and it recharges quickly.  Has a nice screen that allows outdoor use.Build is aesthetically pleasing, nice webcam, fairly useful system software, minimal bloatware.Designers eliminated ports/components that don't enhance the intended ultraportability (namely the DVD ROM and full-sized ports) and replaced them with mini-ports.Runs very cool and quiet - I've never heard the fan kick on before.***********Features that have mixed reviews**************Touchpad:  Essentially, people who like or dislike the pad make the same observations:  It's large, sensitive, and designed to be used in a specific way based on gestures and zones.  So, if you've got big hands and long fingers like I do, and you take time to learn how to use it, and of course if you patch it from original drivers to current, it ranks among the best pads to be released (IMHO) in spite of a few bugs.  Those with smaller hands, clumsy fingers, impatience, or those who expect the pad to do what they want it to do in the manner that they want it (instead of how it was programmed) will hate it.  If you plan to buy this laptop, if at all possible you should testdrive the pad because it's a make/break feature for many.Keyboard - Keystrokes are shallow, not much recoil, keyboard is sort of cramped, and the ease by which you can accidentally hit the touchpad and move the cursor while typing is a huge deal-breaking annoyance to many.  I had that problem often, depending on the angle that I'm typing from.  It's irritating as an ant bite between your toes.  That said, we all have different tastes in keyboards. Those with smaller hands or people who have nimble fingers probably won't mind the keyboard.  Personally, I prefer deep keys on a full-sized keyboard with lots of recoil.  My hands are big and I type like I play the piano - percussively.**************Minor Cons********************HD could have been bigger, and having to pay extra to get Win7 on the machine (given that Win8 is geared towards touchscreens) ticked me off.*********************Cons************************It appears that when closed, the keyboard contacts the screen.  This lead to a nick in my screen, and requires me to clean the screen fairly often.The Intel HD card SUUCCCKKKSSS.  I've experienced all sorts of graphical corruption with certain applications, acceleration is non-existent, the control panel interface can't be configured for three monitors (which I do run at home using my Series 9), and the driver has a tendency to crash.  I run my computers hard, so it's possible that single-taskers / surfers won't run into the same problems.  Worst of all, though - when you hook up a second or third monitor (via the mini-HDMI), the second screen has a tendency to momentarily disconnect and reconnect (takes about 5 seconds) and at this time there is no fix.  ****One more thing - my mini-hdmi will do the same thing (on/off) if I bump the cord even slightly.  Has anyone else experienced this? In any event, these problems relate primarily to uses of the machine beyond its intent (ultraportable), so take that into consideration.  This isn't a desktop replacement.Some folks say that the HD is cheap and should be replaced - I can't comment on that.The ports are all fairly tight - it's kind of hard to fit the power adapter and mini-hdmi adapters into the ports.  It worries me given the lightness and build of the machine.  This is one aspect of the design that might prove detrimental in the long run.The backlit keyboard is marginally useful - only in a dark lecture room has it actually been useful.Could have used a fourth USB port.  Assembly feels a little flimsy in some places.I boughtis b ecause my desktop replacement Dv6 Quad Core Edition (8g RAM, 1 Gg dedicated video card) was too heavy to lug around.h I was a little skeptical about the Series 9's video capabilities because it has the intel HD 4000, whereas at home I ran three monitors off the Dv6.  After a couple of weeks, here are my thoughts --First and foremost, the Series 9 is capable of three monitors, but the Intel Graphics Manager is clunky and doesn't seem to support the configuration.  Rather, I use a USB adapter for the monitor and it works fine, with the caveat that switching between the configurations (eg, from desk to school and back) is kind of annoying because it doesn't always snap back to the native screen.  Also, having multiple monitors running seems to screw up other software aspects - for example, because a monitor has speakers, bluetooth seems to no longer pick up my bluetooth wireless speakers.The laptop runs cool at all times, and handles basic stuff like office, browsing, movies, streaming video, etc. with speed and fluidity.  It isn't as fast as my old desktop replacement, but I can forgive this because it has one half the processing power.  One thing that puzzles me - for some reason, Google Chrome seems to hang when opening multiple tabs on this laptop - I have no idea if it is the laptop or some addon, but I can't reproduce the error on other machines.The screen is fantastic, if a bit bright.  Works fine outside as well as it does inside.  The hinge for folding the screen back and forth is nice and tight.  The webcam is a basic webcam, no frills.Could have used a fourth USB port.  Assembly feels a little flimsy in some places.", "Date": "January 24, 2013"}, {"Title": "Samsung Series 9 has met all of my expecations", "Author": "Joe Dutra", "ReviewID": "RTMRKGS09CWY2", "Overall": "4.0", "Content": "Great for College Students!!!  Light, Durable, and meets all necessary computing power.  Extremely portable and easy to carry. The 15 \" screen provides user with plenty of viewing surface. All solid state, so additional external HD is recommended for large files ( Music, Photo, Video).", "Date": "January 21, 2013"}, {"Title": "Samsung 15Inch UltraBook", "Author": "varma1986", "ReviewID": "R85N2R14N7I82", "Overall": "4.0", "Content": "The Pros of this machine:-Thin & Light Weight.-7 to 10 Hours of Battery life.-15 Inch screen.-Under 10 Second Boot time.-Back lit Keyboard.The Cons of this machine:-Track Pad is at times tricky, the problem can be solved by changing the settings of the track pad in Control panel.-Ultra Books do not have CD/DVD/BluRay drives.-Battery is not changeable.-128GB mSata drive leaves U with just 35-40Gb of free space.-The Media Card sticks out instead of being locked and secured into the machine.-Should have come with a Microsoft signature edition of Windows 7 Home premium.-Backlit Keyboard sensor can sometimes annoy when the screen dims and brightens when your hand passes or rests on that area.-Samsung does not offer extended warranty package option.-The screen should have been 1080HD.Some of YouTube videos might be blurry when seen on full screen mode.-The plug in power socket could have been more innovative like a magsafe adapter.-MicroPorts for HDMI & VGA means U need to buy these if U think U will need them. The MicroPort for Ethernet comes with the machine.-Expensive @ >1150US$.I thought about purchasing the Vizio UltraBook CT 15-A2 and here is how it compares with the Samsung machine:Pros:1.Third Generation Intel Core i7U on Vizio versus the Core i5U on Samsung.2.256GB SSD versus 128GB on Samsung Ultrabook3.Screen is 1080HD on the Vizio machine.4.Full fledged HDMI port on Vizio versus Mini HDMI port on Samsung.5.Cheaper by 100-200 US$ from the Samsung Machine.6.Windows 7 Home Premium Signature Edition on Vizio.Cons:1.No Multimedia Card reader on Vizio.2.Ram is only 4GB upgradeable to 8GB on Vizio.3.Battery life is 4-5 hours on Vizio versus Samsung which has 7-10 hours.4.Build quality & Design of Samsung appears more reassuring.Update:2 months after using this machine and after upgrade to Windows 8 have noticed that Samsung introduced support for Windows 8 OS for this PC Ultrabook through a program called SW UPDATE.The SW update replaces the old software suite that came with the machine and also adds a cool \"start\" button to the Windows 8 interface!!.", "Date": "September 13, 2012"}, {"Title": "Ultra Book", "Author": "David R. Colan", "ReviewID": "R14AKHP61QS8P7", "Overall": "4.0", "Content": "This product is lightweight. Start up is ultrafast. There is no DVD drive which might be a problem for some users. The hard drive is small, so I did not have much free space left after loading Photoshop and Lightroom. Overall a good product with the limitations stated above.", "Date": "September 10, 2012"}, {"Title": "love it", "Author": "Rachel", "ReviewID": "R3CETMJXA25589", "Overall": "5.0", "Content": "i love it! definitely recommend. The only possible issue is the lack of CD drive, but size & slim profile more than make up for that.", "Date": "September 6, 2012"}, {"Title": "This laptop is very nice.", "Author": "Alessandro Isaacs", "ReviewID": "R3V4PERL4HGI3W", "Overall": "5.0", "Content": "I needed a new personal laptop, so I bought this one. I wanted:- lots of battery life. I fly a lot, and not all planes have in seat power. On long intercontinental flights, being able to get (a decent amount of) work done is great.- Nice touchpad. I don't like macs, but the one thing that is really exceptional about them is the touchpad interaction. I almost bought a mac because of that.- Weight. Again, this is for traveling... the lighter, the better.This is based off a week of use - so I might update the review later, but:- Battery: seems like the battery life is as advertised. Plenty of it.- The touchpad is nice. Two finger scroll works well, and the gestures it supports all work ok. I did not find it to be too sensitive like others have said / did not have issues with my palms hitting it. Maybe it's been updated?- Weight: it is light. But that is not subjective. It just is.Overall I am really happy with it. It also looks pretty slick.", "Date": "August 17, 2012"}, {"Title": "Best among other, but not as good as Mack Books", "Author": "Eugene", "ReviewID": "R3OJ6P422O6HF1", "Overall": "4.0", "Content": "Very-Very satisfied with this ultra book.I like and believe in Samsung, and they did their job right this time again.Pros:+ slim+ quiet+ lightweight+ excellent display quality+ performance (i5) like on desktop+ battery holds it's time even with video playingCons:- touchpad needs some improvements... Actually this is the only point they loose to Mack Air laptops.Best so far on the market (Dec 2012)", "Date": "December 17, 2012"}, {"Title": "Samsung does not support this product", "Author": "plozay", "ReviewID": "RUBDZNJNK515W", "Overall": "1.0", "Content": "I purchased this notebook at the end of July after reading various reviews about its design and performance. Initially, I was pleased with its speed and build quality, but I noticed that the wifi performance was horrible. I tried changing the drivers, used various access points, and used different versions of Windows 7 to see if there would be any improvement. Nothing worked. I purchased an external usb wifi adapter to see if that made a difference, and it did yield faster speeds. Unfortunately, shortly after trying the usb adapter, two of the three usb ports on the laptop stopped working. I contacted Samsung, and they arranged to repair the device. I sent them the laptop, and after two weeks, they sent it back. The laptop wifi seems a little faster (not as fast as other wifi devices in the same room on the same access point), but it frequently drops connection now. At least the usb ports work. I contacted Samsung about having the laptop replaced, but they refused to consider it until they had the laptop for another two weeks to make the same repair. I find it absurd that I have to go about backing up my data again and not having access to laptop I purchased  three months ago for another two weeks (making it four weeks of having it in for repairs out of the twelve I've owned it). I now wish I had just sent it back to Amazon within the 30 day return period as Samsung's support is awful.", "Date": "November 27, 2012"}, {"Title": "Everything great except for MAJOR flaw", "Author": "Jo Xu", "ReviewID": "R3TLYP6UQSP202", "Overall": "2.0", "Content": "There is something wrong w/ the wifi adapter. Mine keeps needing to be reset because it loses connection. My old HP computer had better connection (stayed connected to wifi for longer periods w/ more bars) than this one when put side to side. Great laptop otherwise, but considering that people who buy ultra books want the portability, bad wifi connection is a huge minus. I'm giving two stars because I'm comparing this w/ others of its class- Mac Air still has better track pad and wifi connection even though the prices are similar. If anyone out there knows how to fix this wifi issue, please let me know! Someone suggested to put the battery level at \"optimal\" which i've done, but doesn't seem to fix the problem. Would hesitate before buying if u need good wifi connection.", "Date": "September 27, 2012"}, {"Title": "Better choices out there", "Author": "Jon", "ReviewID": "R17TIIJ9BW71F9", "Overall": "2.0", "Content": "Horrible screen. By horrible I mean very poor contrast and washed out colors. All my TVs are samsung whch are typically the best so im very suprised they can't build a decent screen.  Keyboard is pretty bad as well.  Overall shape and specs are good and I found the trackpad to be ok. The Samsung software built into the machine makes the computer worse.", "Date": "August 10, 2012"}, {"Title": "Cute Ultrabook", "Author": "KP", "ReviewID": "R28QYCVIXAPHN5", "Overall": "5.0", "Content": "First of all, I got this ultrabook because it's so cute and I love the design. It's sleek and different than macbook air/pro. It's actually better design than macbook air/pro. It's very thin 0.58\" and I love the mineral ash black color than silver, it looks different and stand out than macbook air/pro. I love it", "Date": "April 3, 2013"}, {"Title": "Fantastic laptop", "Author": "Vladislav Georgiev", "ReviewID": "R2FVE7XXKGV2CY", "Overall": "5.0", "Content": "For me this is a great replacement of a desktop! the 15 inch screen is good for both work and entertainment.The original 128 GB SSD is a bit small. I have upgrade it with  Mushkin Direct Atlas Deluxe 240GB mSATA SATA III Solid State Drive and know it is perfect.", "Date": "February 20, 2013"}, {"Title": "perfect laptop to purchase", "Author": "baobaorosa", "ReviewID": "RJTZMKHFJLRF4", "Overall": "5.0", "Content": "Slim, elegant, light and function well. The screen is awesome. The boosting time is shorter than mac.Even the box is well designed! Worth to purchase!", "Date": "September 26, 2012"}, {"Title": "mousepad", "Author": "sam", "ReviewID": "R1B06BEN3R2PJS", "Overall": "3.0", "Content": "I'll be honest, I bought this laptop because of battery life and a sufficient alternative to the macs.  I bought this laptop taking into consideration other peoples complaints about the mousepad and the fact that the Solid state harddrive is not even a samsung brand.  I didnt really think I would be that annoyed about the mousepad but in hindsight i would probably have picked a less expensive laptop.  I carry around a bluetooth mouse and use that in liu of the pad bc it is that bad.  For such an expensive product I would think Samsung would not skimp out on a simple thing as the mousepad as i is practically a wasted space for me.", "Date": "October 22, 2012"}, {"Title": "OVERRATED AND WAY OVERPRICED", "Author": "C. Smith \"grey ghost\"", "ReviewID": "R1TL2Q7S6F3Z5L", "Overall": "2.0", "Content": "EVERY OTHER LAPTOP I HAVE PURCHASED OVER THE YEARS HAD THE CAPABILITY TO BE UPGRADED FROM THE VERSION PURCHASED - MORE MEMORY OR LARGER HARD DRIVE - NOT THE CASE WITH THIS SAMSUNG - THE MEMORY IS SOLDERED TO THE MOTHERBOARD AND INSTEAD OF A CUSTOMARY SSD IT HAS A PROPRIETY STORAGE CHIP THAT IS REPLACEABLE IF YOU ARE WILLING TO VOID THE WARRANTY TO INSTALL IT. THE SSD CHIP IS AS COSTLY AS ANY STANDARD SAMSUNG SSD THAT FITS INTO 99% OF OTHER LAPTOPS.THE CASE IS SLICK AND I GET LOTS OF COMMENTS ON HOW NICE IT LOOKS BUT IT CAME WITH 128 GB OF STORAGE AND AFTER YOU TURN IT ON YOU DISCOVER THE OPERATING SYSTEM ETC TAKES UP ABOUT 80 GB SO THE EFFECTIVE STORAGE IS IN THE LOW 40'S HARDLY ENOUGH TO STORE PHOTOS OR MUSIC  WITHOUT CONTINUALLY OFFLOADING THEM TO ANOTHER DEVICE - SO YOU DO NOT MAX OUT THE FIXED ON-BOARD STORAGE. IF YOU WANT FLASH OVER SUBSTANCE THIS IS THE ONE FOR YOU IF YOU NEED MORE MEMORY OR STORAGE LOOK ELSEWHERE", "Date": "July 20, 2013"}, {"Title": "Defective", "Author": "Jane", "ReviewID": "R12O9W26CU9FVR", "Overall": "3.0", "Content": "Unfortunately product arrived defective with several keys on the keyboard not working. Since this had to ship as a replacement overseas, we had no way to attempt to return product for refund.", "Date": "January 17, 2013"}, {"Title": "Had to return", "Author": "Charlotte Collins", "ReviewID": "R1KRNT11A9CMDB", "Overall": "2.0", "Content": "Did not realize that this does not contain a cd drive...had to return...expensive lesson. 20% restock fee to keep one day,", "Date": "June 3, 2013"}, {"Title": "win8 compatibility false advertisement", "Author": "JimM", "ReviewID": "R2M7YJLNYJ88SH", "Overall": "1.0", "Content": "I purchased this expensive win7 ultrabook six days before win8 was released because of its advertised win8 compatibility.  Though the hardware is wonderful the compatibility claim is false.  I updated the bios as recommended by Samsung then converted when win8 released.  On conversion I lost all function key control of hardware (display, keyboard, monitors), keyboard backlight, trackpad control and have two unresolved issues in device manager with PCI Communication Controllers.  Visiting the Series 9 support website I found zero Windows 8 drivers. Attempting to use legacy drivers and Samsung \"Easy\" software utilities was unsuccessful.  Contacting Samsung support twice it was explained that the hardware WAS win8 compatible but the drivers and software was NOT!!!  I've been in this industry 30 years and that is a new type of compatibility exception for me.  When I asked when I could expect win8 software utilities and drivers I received no clear answer other than \"coming soon\".  I have previously bought Asus ZenBooks for my company.  I am displeased with this compatibility \"game\" from Samsung and barring a quick correction (win8 drivers and utilities showing up on the Series 9 support website THIS WEEK) I will be returning, after a lot of wasted effort, to what I can trust.", "Date": "October 27, 2012"}, {"Title": "unacceptable high level of hardware failures", "Author": "Anjo108", "ReviewID": "R20FI248LH43NJ", "Overall": "1.0", "Content": "I got this laptop 13 inch 1600x900. lot of hardware problems and the display color temperature and range is unacceptable! big distorsion on yellow/magenta in all new products. chech this images in this display and compare with othe led display u have at home and see the reds and violet color.![...]", "Date": "July 19, 2013"}, {"Title": "Samsung NP900X4C is a worthless buy", "Author": "Saveez", "ReviewID": "R22ZLVSEKFADSU", "Overall": "1.0", "Content": "Hi I was very excited about this computer when I got in in July. Unfortunately the display died on me about three weeks ago and it took one week to send it back to samsung support. they told me it will be sent back within 3 days, all they need to do is just send me a new machine. It has been 5 days since they received it and they claim it may take up to 14 business days which means three real weeks to get it back. I have asked the customer service that I need this computer for business and if they can please overnight it back to me. but the custmer service respnds that they can not overnight. (Customer service agent Jason). So I am now ready to rate them at minimum due to really bad customer service.", "Date": "October 5, 2012"}, {"Title": "Poor quality", "Author": "Fair", "ReviewID": "R345FS2DAG115F", "Overall": "2.0", "Content": "Key board over sensitive and type wrong lettersLoss of paint on key board shortly after useNo reguar micophone connectPower cord broken after a few months", "Date": "October 29, 2012"}], "ProductInfo": {"Price": "$2,399.99", "Features": "Intel 1.7 GHz Core i5-3317U Processor\n8 GB DDR3 RAM\n128 GB Solid-State Hard Drive\n15.0-Inch Screen\nWindows 7 Home Premium 64-bit", "Name": "Samsung Series 9 NP900X4C-A01US 15.0-Inch Ultrabook (Ash Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Y4Meafs3L._SX300_.jpg", "ProductID": "B0083S3NC8"}}