{"Reviews": [{"Title": "Excellent Laptop", "Author": "S. R. Laybourn", "ReviewID": "R2GZ2B52KSXEUF", "Overall": "5.0", "Content": "I have enjoyed using this laptop for about 6 months.  Intel i5 processor is fast and 6GB of RAM makes  multitasking a breeze.  Start up is fast, about 20 seconds until fingerprint reader.  Really like the fingerprint reader feature, keeps data quite secure.  Keyboard has nice feel and touchpad is very responsive.  Only change would be a larger delete key.  The fit and finish is excellent.  The brushed gunmetal aluminum cover and keyboard looks great.  Appearance is much better than plastic.  Highly recommend this laptop.", "Date": "January 6, 2013"}, {"Title": "Factory Defect, TOO BAD I love this laptop!", "Author": "Jodie  L Hart", "ReviewID": "R2KNNA7CSPC5CE", "Overall": "1.0", "Content": "I have to say that I LOVED this laptop and the seller delivered it promptly and everything was great.  But a defect caused the screen to go out within 6 weeks of use.  If it wasn't for that and I'm sure it was a fluke I would have sung its praises!", "Date": "February 7, 2014"}, {"Title": "Excellent Fast Machine", "Author": "sunny \"sunny\"", "ReviewID": "R123VTRFYN4XPV", "Overall": "5.0", "Content": "This is great laptop, pretty fast and trouble free. I like the keyboard, all in all I paid $425 for used and \"very good\" laptop and I am happy with the deal.", "Date": "November 2, 2013"}, {"Title": "Very Good performance laptop", "Author": "Abhiraj Patil", "ReviewID": "R1USUJSNHQED2M", "Overall": "5.0", "Content": "This laptop is value for money,it has a very good performance and no problem with the hardware and drivers,booting and multitasking is fast and reliable.", "Date": "February 16, 2013"}, {"Title": "Really horrible touchpad, shift key too small, but fast machine", "Author": "poloniusmonk", "ReviewID": "R1732RRT3KA8U", "Overall": "3.0", "Content": "I type - A LOT. This computer is NOT one I'd recommend if you also type a lot. The keyboard layout is not so great - the shift key on the right is much smaller than a standard shift key. I thought I'd adjust to this, but after having the computer for almost a month, I'm still having to search for the shift key while typing, and I often hit the arrow-up key instead, which then requires me to readjust my position in the text I'm typing. Really an unnecessarily bad feature. However, this I can handle in comparison to the touchpad. My goodness!! This thing has a mind of it's own! I'll want to scroll down and it will instead enlarge the view of my screen. I'll want to enlarge the view of my screen and it will instead scroll down. I cannot copy things the way I'd like to either - instead of highlighting a line of text to copy, the touchpad will interpret my attempts at highlighting as me wanting to pull and drag the text elsewhere (which might be all right if I was able to highlight an entire line before it attempts to do this). Totally useless. All this being said, I have to add that it's a fast machine. This is why I gave it 3 stars. It's worth the money in that respect for sure (I bought mine new for a little over $500). If you don't mind fumbling with a possessed touchpad, and having to search for the shift key over and over again (which slows down typing and leads to errors), then I'd recommend this laptop. But, if you type a lot or enjoy properly navigating with a touchpad mouse, DO NOT GET THIS LAPTOP!!", "Date": "September 23, 2012"}, {"Title": "Best laptop for the money", "Author": "darwin", "ReviewID": "R1LKAJZRUWM9HG", "Overall": "5.0", "Content": "Lenovo V570 Laptop review[...]\"by Witness I have had this laptop for over a month now, and I have to say, it is a rare gem! This computer has components in it that you normally do not find in this price range (649.99 at Best Buy...\"\"I have never seen a laptop with so many features for such a low price...\"\"It seems too good to be true, but I assure you as an owner of one that you will not be disappointed if you purchase one...\"", "Date": "October 24, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "2nd Gen Intel Core i5-2450M 2.5 GHz processor / 6GB DDR3 Memory / 500GB Hard Drive / Multiformat DVD±RW/CD-RW drive / Windows 7 Home Premium 64-bit / Silver Gray", "Name": "Lenovo 15.6\" IdeaPad Laptop V570-1066AWU / 2nd Gen Intel Core i5-2450M 2.5 GHz processor / 6GB DDR3 Memory / 500GB Hard Drive / Multiformat DVD±RW/CD-RW drive / Windows 7 Home Premium 64-bit / Silver Gray", "ImgURL": "http://ecx.images-amazon.com/images/I/41RrTVvHfhL._SX300_.jpg", "ProductID": "B008RZ4PT2"}}