{"Reviews": [{"Title": "Dell Inspiron i15R-1632sLV 15-Inch Laptop (Silver)", "Author": "John L. Ragle", "ReviewID": "R1FH5362EW5N9L", "Overall": "3.0", "Content": "I purchased this laptop after returning a similar ACER version which was defective. The Inspiron is a typical DELL product, very good but not outstanding. This particular machine has no defects that I can tell; it has a chicklet keyboard like the ACER, but the keys are a bit more raised and rounded, and I find I can touch-type on it without too much difficulty (I do not like chicklet keyboards!) One property of this machine that astounded me was the weight...this is no feather-light item--it seems to weigh a ton, figuratively speaking. The screen definition is excellent, but this particular unit can't be set low enough in brightness to make viewing comfortable under all conditions. I recommend it as a compromise between a fixed-location unit and a true portable. One can carry it in an appropriate satchel, but it is not a unit that one would use on the subway or in an airplane...it is too massive.", "Date": "September 20, 2012"}, {"Title": "Dell Inspiron 1632 - Great buy!", "Author": "A. Mottola \"ALM\"", "ReviewID": "R2L5EPYN7DV48N", "Overall": "4.0", "Content": "I have owned many Dells desk tops and have been supplied Dell lap tops by my work, and when my eight year old Dell desk top started slowing down, I decided to order another Dell. This lap top arrived in a sealed factory box and booted up without any issues.I would have given it five stars, but the keyboard is a bit flimsy. It seems to move downwards when I press the keys. The other issue which others have reported, is that the wifi reports lower signal strength at the same location then what my other Dells do. Other than these two issues, this is a nice machine.", "Date": "February 18, 2013"}, {"Title": "Dell is horrible - First review I have ever felt compelled to create", "Author": "Matt", "ReviewID": "R24LQ2X609O3E3", "Overall": "1.0", "Content": "Ordering from Dell was ridiculously complex.  Involved returning multiple emails confirming past three living addresses to an incredibly rude customer service rep and having to preemptivley clear charges with financial institution to state purchase was not a fake.Received product and it flat out stopped working within one week.  After 90 minutes with another pissy customer service rep they state it is the operating system that is crap.  Too bad they don't provide you the operating system disk with purchase.  State they will send me a copy of the disk in the mail.  Fail to notify me that I must be present to recieve purchase and they will not even allow you to have the option to pick up from delivery service directly.  This is an issue since I work during the day.Contact company to return piece of garbage and they state it isnt eligible to be returned since they think the product wouldn't be defective if they could just fix it.Horrible customer service.  Avoid at all costs.  I should not have purchased a product from a company that clearly has no interest in accountability.One last note.  I purchased the McaFee security package for 3 years.  It was not installed.  I talked to McaFee customer service and they were able to install right away...but it should have been installed by Dell prior to delivery.", "Date": "March 13, 2013"}, {"Title": "Do not buy this. Defective with MULTIPLE problems.", "Author": "E. Garrett \"EG\"", "ReviewID": "R3UZRG5RE3GYMZ", "Overall": "1.0", "Content": "I attempted to buy this as my new laptop, as I work from home and use them regularly but am pretty experienced with them, having owned quite a few over the last 15 years.It's less than a week later, and the computer has already required a 2-hour call with tech support to correct the horrible wireless reception (which is mentioned in the review by Lexi above) which ended with little help and them telling me it must work on a \"different frequency\" then the previous laptop and Apple iPod I own which both connect with no problems to my router. Now, this morning, the hard drive started randomly clicking loudly and the entire thing became almost frozen and unusable. According to Google this is ANOTHER known problem with these laptops.I can't believe a company would take my money and then send me something so defective in response. I feel embarrassed about having mentioned to people that I'd bought a new laptop and now explain when they ask me that I have to return it, and I feel like the company either took advantage of me or attempted to rip me off by sending me this and hoping I would accept it. Furthermore, they have placed me in an awkward situation of having to get rid of this barely functional piece of garbage while I NEED a functioning computer to do my work.The rest of my feelings about this \"product\" and the company which sent it to me are the type I couldn't say without resorting to some vicious and inappropriate language, so I will stop myself here. The laptop is getting returned as soon as possible and I will be getting my money back and doing business with another company. And if Dell gives me a single issue about it, then I will take this MUCH further and see to it that they lose more than one customer.", "Date": "March 8, 2013"}, {"Title": "Excellent computer... if your expectations are reasonable.", "Author": "xman", "ReviewID": "R20EQ75QCD2Q6S", "Overall": "5.0", "Content": "I purchased this computer to serve as a personal/backup machine to my custom built desktop that is running high end specs that take care of most of my personal computer tasks and gaming.This is a excellent machine for the price.  I choose it because I do like Dell's and the fact that it is becoming harder to come by a Windows 7 laptop, which was another big reason for deciding to go with this machine too. There are some real pleasant surprises in this computer that I found.Just for the record, I only use this laptop for the essentials, meaning I only use it for internet, email, chat, Netflix/youtube and word processing. Anyone that requires capable gaming or other intensive programs should probably up their price range a bit.Pros- Great clean looking casing and build. Smooth all around, plastic, but feels pretty robust and durable.- Large and responsive touchpad with multi gestures, this is one of the best touchpads I've used on a windows laptop- Keyboard is nice and sturdy and pretty easy to type on- Speakers are very capable- Overall smooth and responsive once the computer is started up and running- Screen is bright and clear and easy to read- Dell's service tag system makes it very easy to retrieve drivers and support off their websiteCons- It's a bit heavy if you plan to travel with it- Lots of preinstalled bloatware slows the machine down when first starting it up, and must be stripped to reach desired performance- Start up is a bit slow even after stripping bloatware, the 5400RPM drive seems unusually slower then most- The fans kick up a bit at times, I am particularly a little sensitive to noise so this may not bother others much as it does meAs you can see, the pros greatly outweigh the cons, and once I configured and customized the laptop to my liking, its great for basic tasks and looks nice. I mostly use this laptop in my bedroom and a little bit around the house, I wouldn't recommend it as a daily traveler, but as a secondary/backup computer, I couldn't go wrong with this choice.", "Date": "March 19, 2013"}, {"Title": "Excellent laptop and great value!", "Author": "RAF", "ReviewID": "R1YNHU8O7VLN0A", "Overall": "5.0", "Content": "The Dell Inspiron 15R-1632sLV offers computing \"punch\" for a reasonable price.  I had a specific need for a Windows 7 laptop with a reasonable processor (Intel i3), as much memory as I could get (6Gb), and as much hard disk space as I could afford (750 Gb).  For less than $450, the Dell 1632sLV fit the bill.  Couldn't find anything better for under $500 (including HP, Asus, and Lenovo).  A number of critical programs used for music composition are not yet compatible with Windows 8, so I bought this laptop specifically to run that software.I've had the machine for about a month as I write this review.  It started up right out of the box, connected to my 802.11 n Linksys wireless network in a flash, and works perfectly.  It's a great \"interim\" machine as I save my pennies for a \"significant\" desktop (32 Gb memory, core I7 processor, 2 TB) for my business.If you want a good low priced laptop with Windows 7, this is it.And, as always, Amazon beat expectations.  The laptop was delivered ahead of time (they're good at managing delivery date expectations) and in great shape.  Kudos to Amazon.UPDATE 3/16/13:  Currently having minor problems with the wireless card in this machine.  Occasionally (2 or 3 times seemingly randomly during the day), the wireless signal fades out.  Have to run the Windows 7 routine to \"reset the network adapter\" before the signal is again captured.  Have read several posts from other Dell laptop users of the same class of machines who have experienced similar problems.  I have several older (5 years) laptops from both Dell and HP (all 802.11 n) that have no such problem and are located on the same dining room table.  I've changed the power saving feature to \"performance\" so that the card will not fade out due to power regulation.  That fix improved the performance of the card, but didn't completely solve the problem (it fades out less often now).  Plan to install a new Linksys/Cisco 802.11ac wireless router in the next couple of weeks.  Hopefully, the improved transmission capability of the new wireless router (the old router is a Linksys/Cisco E1000 802.11b/g/n) will improve reception.  Also, have more wireless devices running now (3 laptops, 4 smartphones on WiFi, a Roku box, an Xbox 360, a PS3, and a Kindle Fire HD as well as 2 desktops on 100 mbps Ethernet cables).  So, we may have conflicts/signal strength issues.  Will let you know how the new router works with this specific laptop.  P.S. - the current and new routers are/will be positioned about 20 feet from the laptops.", "Date": "March 12, 2013"}, {"Title": "Just set up and going", "Author": "Carole harris", "ReviewID": "R1P5KQALCS3RSC", "Overall": "4.0", "Content": "We started using this (windows 7) computer this week in the office, so don't have a track record yet to give it a 5. Set up was quick and simple, Dell clearly indicated which were add-on programs and how to remove them. The display is beautiful, keyboard response is very nice and the touchpad is quite sensitive. It seems quite sturdy so far and can't find a thing I'd change.", "Date": "February 14, 2013"}, {"Title": "Great computer.", "Author": "Mike in Nor-Cal", "ReviewID": "R3IW7KAVMK1KZE", "Overall": "5.0", "Content": "I am using it to write this review. It was excactly what I wanted. It was delivered in three days and in excellent condition. The price was exceptional.", "Date": "December 11, 2012"}, {"Title": "AMAZING", "Author": "Pen Name", "ReviewID": "R159NPQ84383HI", "Overall": "5.0", "Content": "I have the Core-i5 version, and I must say this is the best laptop I have ever used in my life. Its super fast, looks amazing, and is very sturdy. I HIGHLY reccomend this laptop especially since its very cheap.", "Date": "February 26, 2013"}, {"Title": "Lousy", "Author": "Dennis D. Martin", "ReviewID": "RLVA785W4QDI8", "Overall": "1.0", "Content": "Lousy set-up.  Reject activation of the pre-loaded McAfee bloatware and go into anti-virus limbo while the recovery disk creation process drags on for hours and hours.  Call Dell support and listen to ads for McAfee while on hold.  Support won't answer the simple question whether taking 3 hours to initialize the recovery disk creation is unusual or a sign of something gone wrong.  No way to cancel the recovery disk creation process once started.", "Date": "March 12, 2013"}, {"Title": "Dell Laptop", "Author": "Gwennie", "ReviewID": "R29X821TZORT6A", "Overall": "4.0", "Content": "I prefer Dell over any other & other than a few glitches, this one is great. Twice now it has just flat died & I had trouble getting it back on but I'm not sure why.", "Date": "May 4, 2013"}, {"Title": "Solid Performer", "Author": "Ronald Derksen", "ReviewID": "R2I2ANOITW19L7", "Overall": "4.0", "Content": "This laptop performs as is advertised.I did shopped for a Windows 7 operating system.This operating system is my choice because it is a stable operating systemand an easy upgrade from Windows XP Professional.This laptop would have been a 5 star rating with an Intel core 5 processor.", "Date": "May 4, 2013"}, {"Title": "Excellent for the money", "Author": "REM \"Loopy\"", "ReviewID": "RHFCGGVUFET48", "Overall": "4.0", "Content": "Very nice for simple stuff wife does.  Attractive, easy to set up and fast response.  Too much embetted apps one does not want.  But excellent for the price.  Arrived on time and no worries.", "Date": "May 2, 2013"}, {"Title": "This laptop is a good buy and performs well.", "Author": "Marti", "ReviewID": "R30SF1WMCRAYDM", "Overall": "5.0", "Content": "Bought as a backup computer, to take with me on trips and to run programs I do not have on my other computer.  Have had this computer for a month and have no problem up to now.", "Date": "May 2, 2013"}, {"Title": "Great price", "Author": "Ben", "ReviewID": "R3OIE2TWG7DTV1", "Overall": "4.0", "Content": "Shipped fast... Read that the internet use was slow and was true... Works great after updates installed... Unit is on the heavy side but I bought it for home use...", "Date": "May 1, 2013"}, {"Title": "Laptop", "Author": "Janet P", "ReviewID": "R1KY6D2QS85KM9", "Overall": "4.0", "Content": "Arrived in excellent condition.  Easy to set up.  Windows 7 takes some getting used to after using XP but the computer works well.", "Date": "May 1, 2013"}, {"Title": "Broke within the first 30 days", "Author": "Kristaps Krumins", "ReviewID": "R3I8Y26YJ1CTJ7", "Overall": "1.0", "Content": "From the first day that I got the laptop, the Windows operating system appeared to be quite sluggish and crashed a few times. If that wasn't bad enough, the laptop decided to break on me while I was writing a college paper. Luckily, I had my paper backed up on a flash drive. However, the laptop did not start for like 2/3 days as the screen would not turn on. So I sent it back to Amazon and received a refund within a week, which was pretty good.All in all, the laptop appeared visually nice. I might have just got a faulty one.", "Date": "April 29, 2013"}, {"Title": "It's fair one. Nothing special. Problem with power management.", "Author": "ABHINAB BEHERA", "ReviewID": "R29R2L46MF1IDH", "Overall": "3.0", "Content": "When I am putting it in sleep or hibernate mode, it's not starting the next time until unless I remove & re-install the battery.", "Date": "April 28, 2013"}, {"Title": "Dell", "Author": "Bob", "ReviewID": "R1WERQRYRX2J6R", "Overall": "1.0", "Content": "I have software problems with this computer.  Dell tells me there is no warranty on the software.  They want about 50%  of what I paid for warranty.  They say I bought it in January which is when Amazon bought it not me.  Never buy aDell computer.  Easy to see why computer sales are following.", "Date": "April 28, 2013"}, {"Title": "we love dell", "Author": "Amazon Customer", "ReviewID": "R2PLBZ2HDYGZA3", "Overall": "5.0", "Content": "We always buy dell computers. We've had other brands and they aren't as good of quality.  We'll always buy Dell,", "Date": "April 26, 2013"}, {"Title": "great buy", "Author": "sheldon", "ReviewID": "R3E9JFJGYX6V5B", "Overall": "5.0", "Content": "If you are looking for a good laptop at a great price this is it. It has a big hard drive, lots of ram and is really quick. I also like the 8 in 1 card reader......that comes in really handy.", "Date": "April 18, 2013"}, {"Title": "Product is good", "Author": "Paul Ekeh", "ReviewID": "R11ZQH1D1LBAZQ", "Overall": "4.0", "Content": "I like it because the product is as described. It arrived as at when due. It is a quality product.", "Date": "April 17, 2013"}, {"Title": "I LOVE IT!!", "Author": "Dr. Natale Sicuro", "ReviewID": "R21XG4UWL805HQ", "Overall": "5.0", "Content": "THIS IS ANOTHER EXAMPLE OF DELL'S PROMINENCE IN THE WORLD OF COMPUTERS!! THANKS TO MR. MICHAEL DELL AND HIS GREAT COMPANY!!", "Date": "April 17, 2013"}, {"Title": "Kept it", "Author": "ab", "ReviewID": "R22MDUBN50S9ZX", "Overall": "3.0", "Content": "Still wanting somethiing more  similar to XP! The print is still too pale for a senior to use easily, but I guess that's the way they make them these days!", "Date": "April 14, 2013"}, {"Title": "A fine laptop.", "Author": "Forrest S Johnson", "ReviewID": "R1JECOORT36QXO", "Overall": "5.0", "Content": "The price for the features is what attracted me.I'm not bothered that it's an older model because it does all I want and has plenty of unused capacity.I'm using it to log on and write this review.", "Date": "April 14, 2013"}, {"Title": "Great Value", "Author": "Sharky", "ReviewID": "R2XV90S6OK4WW", "Overall": "5.0", "Content": "This dell computer was a great value for the cost. Out of the box and since we have had no issues! Fast delivery.", "Date": "April 14, 2013"}, {"Title": "Good, but trackpad is larger than necessary", "Author": "E. Ongerth", "ReviewID": "RS506ZC7059AR", "Overall": "4.0", "Content": "Performance and everything is great (after I removed some bloatware including McAfee and other Dell-provided unnecessary stuff, installed all updates and a better free antivirus and anti-malware program).The trackpad is larger than it needs to be -- it's quite a bit larger than the one I love on my Dell Studio 15Z which is basically the same size of case and keyboard.  There's no reason the pad needs to be so big, and having it this big is just asking for more unwanted thumb contact.  I don't personally have too much problem with it because I use the classic typing hand position and good posture, but my parents have been experiencing accidental thumb hits with effects like losing an email they were composing because of changing window focus or accidentally reacting to their window focus mistake by pressing Backspace.The somewhat smaller pad on my Studio 15Z gives more than enough fine resolution, so I can't see a reason to go larger and make the pad be such a large target and a large part of the hand rest area.  But otherwise this is a great laptop and a great value, maybe one of the best values available right now.I was very glad that Amazon still had the Windows 7 version in stock because I just don't agree with Windows 8 and the push to make desktop and laptop computers too similar to tablets and smartphones.  And I'm not one of those people who has always held back on OS releases... I was an early adopter of XP, Vista, and 7 because each made better use of my hardware.  But Windows 8... not going there.  (Plus on the business side I already do all my work in Linux and use Windows 7 only for Photoshop... Microsoft owes Adobe a big thanks for the millions of other people for whom this is true).", "Date": "April 13, 2013"}, {"Title": "very good", "Author": "Isaiah", "ReviewID": "R2YN9W7F9NHRSC", "Overall": "5.0", "Content": "Laptop is extremely neat, I'm a techy so I know my laptops, this isn't one if you are into heavy gaming of course but it looks really good and is excellent for normal everyday use, I personally use it for school work and some low level gaming like call of duty and such...works great...", "Date": "April 13, 2013"}, {"Title": "couldn't turn it on", "Author": "Enrique M Jimenez \"BOL\"", "ReviewID": "R24LH7HBYL1S8K", "Overall": "1.0", "Content": "i was not able to turn it on, the button on/off didn't work, so i had to return it .", "Date": "April 12, 2013"}, {"Title": "muy bueno el producto", "Author": "antonio alongi", "ReviewID": "R2EU04WGW6DL1M", "Overall": "5.0", "Content": "tremenda laptop muy rapida hasta los momentos todo esta muy bien, buena compra se las recomiendo sin lugar a dudas", "Date": "April 11, 2013"}, {"Title": "It's a beautiful laptop!", "Author": "Becky", "ReviewID": "R1ZMO6VOE3D1XG", "Overall": "5.0", "Content": "It has Windows 7, it's a Dell, it's exactly what I was looking for.  Easy to use, worked right out of the box.  I couldn't be happier.", "Date": "April 8, 2013"}, {"Title": "low heat", "Author": "Grace", "ReviewID": "R2L1VEJQ7DV6HC", "Overall": "5.0", "Content": "I have used 2 laptops before I bought dell. They both got hot when being used over half a day, especially in summers.  I have to buy a cooling pad for laptop. To my happiness, dell doesn't seem to have such problem.", "Date": "April 8, 2013"}, {"Title": "Homework notebook", "Author": "ricardo", "ReviewID": "ROLX9BPR9C03U", "Overall": "5.0", "Content": "Good size, practical for my purposes, quick, a bit heavy perhaps, but more than I needed for my work. Pleased with the purchase", "Date": "April 5, 2013"}, {"Title": "Laptop Met expectations.", "Author": "tkane06", "ReviewID": "R1OUOIKB8BCD81", "Overall": "4.0", "Content": "There was a slight problem with one of the keyboard keys, but Dell support was able to correct it quickly.", "Date": "April 5, 2013"}, {"Title": "too noisy", "Author": "Qingxuan Liu", "ReviewID": "R2DLYXPTXXN1K8", "Overall": "2.0", "Content": "Can you enjoy your time with the computer working while a bee bird sounding all the time?  I do not like it.The other factors are ok from now.Without the noisy sound, I would give this item 5 stars for the price", "Date": "April 4, 2013"}, {"Title": "Good Deal at $469", "Author": "Glenn Jagdeosingh", "ReviewID": "R2K3GT1W5VYDD4", "Overall": "4.0", "Content": "I bought this laptop on Amazon for $469. This was a steal of a deal for this price. Overall the laptop specs were pretty good coming with i3 2.4GHz,  6GB ram, 750GB HDD, DVD burner, webcam, Bluetooth etc. Compared to what was being sold on Dell's website, this was a reasonable deal.I have two complatints however with this laptop:- The Wifi signal is pretty weak. Other laptops which I use have much higher signal strengths than this one. I am considering purchasing a USB wireless card so that I use the laptop a few rooms away like I used to do with my older laptop.- It is surprisingly slow for a new laptop. I read from other people in the reviews that they removed the unnecessary software which Dell installed. I will try that and hope that it would speed things up a bit.I do recommend this as a buy, however you need to keep the Con's in mind. If you want a fast performer which will work anywhere in the house this isn't the laptop for you. If you want a basic laptop to surf the web, watch videos or type documents and you will be close by to your router, then this is a perfect buy.", "Date": "April 4, 2013"}, {"Title": "Perfect", "Author": "Garret snyder", "ReviewID": "RQ30L0N8GIPND", "Overall": "5.0", "Content": "Setup was minimal, very fast moving and start up. Overall, a wonderful computer for the tiny price especially. I am very satisfied :)", "Date": "April 2, 2013"}, {"Title": "Great Laptop", "Author": "Tuttle \"Mama Tuttle\"", "ReviewID": "R29WV3ZKJC89BU", "Overall": "5.0", "Content": "We really like this laptop. Got it for a good price here on Amazon too. $180 less than retail. That's always awesome. Haven't had any problems with it yet. Seems a bit heavy, but lighter than the last one we bought by far. Easy for my 11 year old to use and carry. Our only complaint is battery life. Its fine if your just typing or painting and such, but watch out if you use the internet. That seems to suck it dry REALLY fast. Probably should have given it 4 stars because of that but we do love it too much.  We always trust a Dell. She is an artist and an author so it serves its purpose well. She just has to remember to plug it in if she goes on the net. Nothing quite like being in the middle of something on the net & your pc telling you its getting ready to shut off due to low power LOL. I would recommend. She said it works MUCH better than her best friend's laptop which cost more.", "Date": "April 2, 2013"}, {"Title": "meets my expectations", "Author": "S. Nasar", "ReviewID": "R39E0TT5AUCTH9", "Overall": "5.0", "Content": "I have been using this for a month and so fat it has met my expectations.  It was not easy finding a laptop that has the features and specs I want with the the budget I can afford and run Windows 7, I do not want Windows 8 because I tried it and hated it. I have not had any trouble yet, no crashes or freezes, it runs quite and cool. The sound quality was surprisingly good. The laptop is heavy, it's not very portable, on the plus side it feels very durable. The keyboard is OK I am not a fan of the chiclet kind but I am getting used to it.", "Date": "March 31, 2013"}, {"Title": "fast AF", "Author": "Matt", "ReviewID": "RKWZ7U7078NKX", "Overall": "5.0", "Content": "this comp. is just exactly what i was looking for. its perfect. it working great for editing go pro videos.", "Date": "March 30, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0081ZDYQI"}}