{"Reviews": [{"Title": "Best ultrabook for the price", "Author": "Joe CT \"PC guy\"", "ReviewID": "R3UQB8OWHEDL6V", "Overall": "5.0", "Content": "Great performance, sleek form factor, great price. I love this ultrabook.It got good storage, many ports, great processor. You can add RAM with the Free slot -  upto 8 Gb for $20.Very nice keyboard.", "Date": "June 27, 2012"}, {"Title": "Charming 20% of the time", "Author": "LearnIIBurn", "ReviewID": "R3EALH58814NOH", "Overall": "1.0", "Content": "Really have to chime in on this laptop. I know Sony doesn't distribute it anymore, and for good reason. These are expensive. And my does it have issues.First, the fan is unreasonably loud and usually pinned even when Windows is idle. Really disappointing, because that fan eats battery alive. It's not even the noise that bothers me as much as the fact that a fan running all the time kills your charge.The \"ultrabook\" design and philosophy is low-power consumption paired with high-quality components and mobility. This thing is pretty light and not bad to haul around at all. It's pretty powerful too so no complaints there. But the screen is really fragile. Like another reviewer mentioned, it flexes easily and rubs on the keyboard while in transit. As a matter of fact, my screen on mine right now goes between all red and all black often, as I'm sure the display connection has come loose and is causing the flicker. If I squeeze the laptop near where the display meets the body, the screen goes normal, then red again. Perfect symptom of a loose connection.This thing is almost impossible to take apart and maintenance too. I am an IT engineer and have taken apart everything under the sun. This one goes down as one of the worst experiences ever. This poor little Sony is the only thing broken in a company full of MacBook Airs that run perfectly. A real shame to see obvious poor manufacturing, workmanship and cheap parts used in something THE EXACT SAME PRICE AS AN AIR.I'm done with PCs. Completely. Bye forever Sony.", "Date": "July 25, 2013"}, {"Title": "Long time since I heard a fan this loud", "Author": "uzevla", "ReviewID": "R1KJ3B6EWH4H8T", "Overall": "1.0", "Content": "So, the fan runs and is annoying even when CPU shows no load. At the same time, CPU temp is at 50C.Under the load, the fan is as loud as some old old desktop computer fan.Amazing what they make in 2012 while the fan needs to cool a 17W CPU.", "Date": "March 5, 2013"}, {"Title": "Great Laptop but watch out for screen", "Author": "Jamie", "ReviewID": "R1ZC15QJXR07C9", "Overall": "4.0", "Content": "Every thing on this computer is great, except for the fact that the screen can flex and rub on the keyboard when just carrying it around.  Be sure to buy a screen protector with it.  Other than that the computer works flawlessly and runs very fast and quiet, except for the slightly louder than average cooling fan.", "Date": "December 19, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008C3GQEQ"}}