{"Reviews": [{"Title": "Great Budget gaming Laptop - for the money, can't be beat", "Author": "DC10", "ReviewID": "RKMWSHI3BSEC8", "Overall": "5.0", "Content": "This is great budget gaming laptop as the reviewer before me mentioned - For the money it can't be beat - I got mine off of Ebayy for $389 - Although the laptop states it may only support 8GB I think it can do 16GB, but do not know for sure -For $32 I put in a Blu Ray Drive and had a spare Seagate Momentus XT 500GB (with 4GB Flash and 7200rpm, super fast). Honestly, really good looking laptop - I have it connected to Samsung 24\" LED - The only con is it has just 3 USB ports - but HDMI is very cool - along with the ESATA Port - Really love it and it' great looking!I game on WIFI - and it is very capable on COD MW3- go get one!Updated*** Well, about 2 weeks ago - I just upgraded the memory to 16GB on this thing - I am wondering if down the road, whether or not the system can do 32GB - anyway, just a great laptop - someone did ask me regarding the blu ray upgrade - I did my homework and found a samsung blu ray drive on ebayy, but I did tell them that you need blu ray software - like power DVD 12 or something like that - Power DVD is what I use - it's worth $20 or $30 bucks I spent on it - This laptop is pretty much like a little beastie now! 16GB Ram ($65), 500GB Seagate Momentus XT Drive with 4 gig Nand SSD and 7200rpm (I had this HD drive for about 2 years lying around cost about $70 - my Dell now boots up in under 22 secs) + Samsung BluRay ($32) wow - and installed win 7 pro 64bit (no cost my version) - it's like a $1700 laptop - The Used Mac equivlant is about $1700 except no blu-ray... and of course Paid $389 off of ebayy - that includes shipping!!! tada....... by the way the NVidia Card is very close to a AMD/ATI HD67xx series cards - a while back ago I had an HP with a HD6750 great card - The GT525M just as good if not better - Handles all my games and the supports 1080p out through HDMI - Love it!!!", "Date": "January 29, 2013"}, {"Title": "Excellent Bang for Its Bucks!", "Author": "Aman", "ReviewID": "RZL5FMY1WSMIM", "Overall": "5.0", "Content": "This laptop is worth every penny! I bought it back in May and have had NO issues since! The laptop is PERFECT for a budget gaming laptop. With its dedicated graphics card, it did just as well as my gaming desktop does with it's ATI Radeon HD 6870 Card (The laptop itself has a Nvidia GeForce GT 525M). I absolutely love this thing. If you are looking for a laptop around this price range, this is THE laptop to get!", "Date": "October 26, 2012"}, {"Title": "Poorly Designed", "Author": "Daniel Bourdon", "ReviewID": "R2X1WAXYPP9PT8", "Overall": "2.0", "Content": "I had to completely disassemble the laptop just to get to the hard Drive to swap it with a SSD. The Hard Drive was buried under the motherboard. The internal design is awful! Whats worse, I damaged the keyboard trying to take this laptop apart. Then later after putting it back together I realized Dell didn't send a Windows 7 restore disk with the laptop. I will never buy a Dell laptop again! I would not recommend this laptop to anyone who would want to upgrade it in the future.", "Date": "September 1, 2013"}, {"Title": "i like it", "Author": "JHF", "ReviewID": "R2UZ6XSE5Q23HD", "Overall": "4.0", "Content": "I like it, took a while to arrive, but it did in certain periods, expected to have less wear marks, but otherwise everything is fine, I'm very satisfied", "Date": "May 17, 2013"}, {"Title": "Good Laptop", "Author": "Eric", "ReviewID": "R1IJWNNXBJRF3J", "Overall": "4.0", "Content": "Good presentation, It came in its box with all the protection.I haven't used it for work yet, just for watch movies and internet and this is what I have found so far..I have to clean up the surface regularly because all the grease from my hands remains on itOnce time I turned it on and it showed some kind of win7 safe mode screen, it said something like a file was missing.. I just rebooted and it did not showed it again so far..I use bsplayer to watch movies with subtitles files and from time to time the software crashes..I found the speed of transfer data from the dvd unit or from a usb unit, a little slow.. perhaps its just an impression but I bothers me.I think these problems are related with the OS and perhaps if I make a clean new install, or just use another OS these details would disappear.One more thing: When I am in a very quiet room I can hear the reading/writing sound from the HD, its not a problem for me though.I gave it 4 stars because I think its a good machine but perhaps win7 its not so stable on it..", "Date": "August 19, 2012"}, {"Title": "Excellent Product and an excellent Price!", "Author": "Eddy", "ReviewID": "RH8MEPE81513K", "Overall": "5.0", "Content": "Few weeks Ago my new laptop arrived and i couldn't be more happy about it, it's everything i was hoping for!!.. Great speed with his 6GB RAM, i have already installed to it AUTOCAD 2012, SOLIDWORKS 2012, BIZAGI EXPRESS, and a few games like CALL OF DUTY and HALO 2, and man, they run amazingly well!! recommended for everyone with needs of engineering  programs and video games!", "Date": "August 9, 2012"}, {"Title": "Amazing laptop, amazing price. Happy customer!", "Author": "Ulises", "ReviewID": "R2VJZG75D11A6C", "Overall": "5.0", "Content": "This laptop is amazing! i haven't seen any other Dell laptop at Amazon.com as low as this one featuring a Nvidia dedicated video memory. Besides, you got Intel Hd Graphics, this means that you can play, design and watch as many hd movies as you want without lagging. Great buy!", "Date": "August 14, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Performance: Intel Core i7-2670QM, 6G DDR3 RAM, 750G 5400 RMP, 1GB NVIDIA GeForce GT 525M Graphics with Optimus Technology\nSoftware: Windows 7 Home Premium (64-bit), Microsoft Office Starter 2012, Dell Stage Software\nIncludes: 8x tray-load CD/DVD burner (dual layer DVD+/-R drive), Wireless b/g/n, Webcam, HDMI, 2 USB 3.0 • 2 USB 2.0 (1 regular, 1 combo eSATA).\nAdditional Specs: Intel Wireless Display (WiDi) capable (separate adapter required), Bluetooth, High Definition Audio 2.0 with SRS Premium Sound, 8-in-1 memory card reader.", "Name": "Dell Inspiron 15R i15RN 5297BK 15-Inch Laptop i7 2670QM 6GB RAM, 750GB HHD, Nvidia GeForceGT 525M 1GB (Diamond Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/51RFFt2hVcL._SX300_.jpg", "ProductID": "B0089PHR2M"}}