{"Reviews": [{"Title": "awesome computer", "Author": "J. Donahue", "ReviewID": "R36LES50JLA2FU", "Overall": "5.0", "Content": "I have had my laptop since September and I love it. It boots up very quickly and has a built in split screen function that is really useful if you don't have a second monitor readily available.The laptop is used primarily for website development. I have installed SQL server and Visual Basic 2012 and it runs these programs with no problem. Granted I don't have a large database to work with so my memory doesn't get pegged.  I have been using the Adobe Creative Cloud applications with no problems either.I love the screen, the solid state drive, the backlit keyboard and the weight of the machine. I needed a computer and didn't want to wait until Windows 8 came out. I have used Thinkpads, Dells,and Lenovos and they each had different issues that I knew I didn't want to deal with again. I looked at Toshiba, ASUS and Samsung laptops and ultrabooks and ultimately I choose this one because of a recommendation for Toshiba computers from a friend. And I truly think this Toshiba is the best computer I have ever used. (I am very fond of Samsung products as a whole and expected that would be the direction I would have gone.)This Toshiba doesn't have a touch screen, and I haven't upgraded it to Windows 8 because I have heard nothing but bad things about W8 when using it without a touch screen and that it is just a pain to get used to with a touch screen too.  If I want a touch screen I will probably buy a Surface but right now I am truly happy with this computer.", "Date": "April 29, 2013"}, {"Title": "Good ultrabook with excellent audio for $800.", "Author": "Shah, A.", "ReviewID": "R14S0OEZ58I4L1", "Overall": "5.0", "Content": "SSD and excellent sound are the main differentiators.8Gb Ram should have been better than the installed 6GbKeyboard needs improvement with option of charging battery to only 50% for battery health.", "Date": "April 7, 2013"}, {"Title": "Incredible Ultrabook for the price", "Author": "A. Minassian", "ReviewID": "R2GEKDR1162FQ5", "Overall": "5.0", "Content": "After weeks of research, finally ended up getting this ultrabook. It turned out to be everything that I was looking for. Perfect size, and extremely fast. The multitasking really is practical, especially if you like to use excel. Photoshop and dreamweaver work great on this machine. I was worried about the screen size, but it's great.In terms of what other complaints have been, I really dont see it. Mouse works fine, and I really like the way the keyboard feels. I guess it is important to note I upgraded to this from a 4 year old laptop, so maybe other people are basing their opinions on newer computers.In the end, it really is a great ultrabook, and I am extremely happy with my decision. Plus the price on it is really unbelievable right now. (I bought it through amazon-tigerdirect). I still cant believe I got all this for such a low price. After all the research I did, i couldn't find another ultrabook close to this price, with all similar features. Very happy!Follow-up 4/26/2013Still very happy with the laptop overall. have been getting a lot of attention for its uniqueness and aesthetics. One important consideration is the the screen though. I accidentally cracked the screen (had buyer [protection on my my card so i'm covered), and the replacement for it is way more expensive than that of a regular screen. Figure you are going to spend double or almost triple the cost of a regular screen replacement. 2) none of the big lcd companies carry this replacement screen, so you are going to have to  buy internationally, or use Toshiba's 3rd part's company which is grossly overpriced.I still highly recommend this laptop, but just something to keep in mind.", "Date": "March 5, 2013"}, {"Title": "VERY GOOD", "Author": "timothy us", "ReviewID": "R146GT7ZNETVLF", "Overall": "4.0", "Content": "excellent design with win7. stable fast performance. once u got used to the screen it is perfect.amazing speaker .bad thing, screen height is the same as 11 inch laptop, big big fan noise", "Date": "August 4, 2013"}, {"Title": "Windows 7, Wide Screen, SSD, what's not to Love?", "Author": "Jed", "ReviewID": "R1T9W99ZFKLG5A", "Overall": "5.0", "Content": "I looked at Ultrabooks a few months ago and quickly realized that there were not many options that did not have Windows 8.That focused my attention on the Toshiba and in the end it pointed me to exactly what I wanted.I really like the widescreen because the unit is big enough to rest on your lab, both legs, not just teetering on one leg...The rubberized grip not only looks good, but has fantastic grip and I feel that this Ultrabook is not going to slip out of my hands!However, a must have is a Mouse!The wide screen is great, but the short screen is annoying so a mouse is a must have to make scrolling so much easier.Let's not to forget the SSD and the i7 combination that makes this unit very fast.While there are other units out there that are a little bit lighter, overall, I am very pleased with my purchase!", "Date": "July 18, 2013"}, {"Title": "Good product so far", "Author": "Yangfan Xu", "ReviewID": "R22GCXI28ZIKRG", "Overall": "4.0", "Content": "The bottom of the computer is not flat. it is tilt and one corner is not touching the table other than that, I like it very much", "Date": "May 14, 2013"}, {"Title": "It is perfect for my needs.", "Author": "Ruben Clark", "ReviewID": "R1P093762VM1KE", "Overall": "5.0", "Content": "I love it because it does every thing perfectly that I want it to do for me in every situation.", "Date": "April 11, 2013"}, {"Title": "No Number Key on Keyboard", "Author": "Jessica Dighton", "ReviewID": "RBS4HN6HZF61F", "Overall": "3.0", "Content": "I read reviews, but somehow I missed that this laptop doesn't have a number key. Without having one it makes keying numbers for my business very difficult. I tried to return it but the restocking fee was between $200 - $300. So I unwilling kept it. :(", "Date": "March 24, 2014"}, {"Title": "Work great for me", "Author": "YI LING BAUCHAU", "ReviewID": "R34KW7W9VAUVOO", "Overall": "5.0", "Content": "This computer has worked very well for me. Despite the unusual screen aspect ratio, it has worked flawlessly. After a short period of adaptation, it is a great machine and I do not regret having purchased it", "Date": "March 22, 2014"}, {"Title": "I like it - (don't love it - yet, maybe)", "Author": "nelson", "ReviewID": "RDFP4452QCPJJ", "Overall": "4.0", "Content": "Takes some getting used to.  A lot of Toshiba junk loaded on it.  I like it - (don't love it - yet, maybe) ??", "Date": "January 26, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0086OGLXC"}}