{"Reviews": [{"Title": "First review for Amazon readers", "Author": "Russell Fanelli", "ReviewID": "RMRY8LUTUFTQR", "Overall": "5.0", "Content": "I bought this HP 17.3 Laptop yesterday and will give Amazon readers my first thoughts on this machine. I own a Gateway laptop with Windows Vista, a Dell laptop with Windows 7, and a Dell desktop with Windows XP.  I will be comparing the HP with the Dell and Gateway laptops.First, setup could not be easier.  It took less than 15 minutes to take the laptop out of the box, hook it up, and connect it to the Internet. Much of that time was spent as HP initialized the machine and its settings and registered it for use.  I have a Linksys router in a third floor office and use the laptop on the first floor of the house.  No problem setting up and using WiFi.  I first tried a video on YouTube and then a film on Netflix.  Both worked perfectly -- good clear picture and sound with no transmission glitches.I was suprised by the quality of the sound.  On both my Gateway and Dell laptops I have external speakers I use when I want decent sound.  I won't be hooking up additional speakers for the new HP.  This is not to say that the sound is great, just that it is good enough for YouTube and Netflix.  I won't be playing concert music on the HP anytime soon.The HP with IE 9 is fast; perhaps not quite as fast as Google Chrome on the Dell laptop, but IE 9 is a full service browser which I am using for the first time.  I have AOL on the desktop, which I like, and Firefox on the Gateway, which is also OK.  BTW, the HP with IE 9 will play saved songs from YouTube that the other browsers will not play.  This surprised me.I immediately put an external mouse on the HP so I can't comment on the touch pad other than to say that when I had to use it to start up the machine, it seemed not much different than other laptops, even though I know this is not correct given the ads I have read about it.The keyboard is a step up from what I am used to.  It is a soft touch, full service keyboard that is a pleasure to use.  I won't be setting up an external keyboard as I have done with the Dell laptop.The HP runs cool, unlike the Dell and Gateway machines.  This is as advertised and a big plus for me.  The HP people say the battery will run the laptop for over five hours but I think that is a stretch from what I have seen so far.Amazon readers are used to reviews on computers by truly competent people who know what they are talking about.  I am just a user with no special knowledge.  Even so, I did not see any reviews on this machine and I thought that some readers might find my first thoughts of some value to them.Last comment.  This machine cost me $479. at Staples.  The people there were friendly and helpful.  This seemed like a fair price for a laptop for everyday use. I looked for less expensive machines and found some for as little as $329.  I convinced myself that it made sense to spend a little extra money for the HP.  I'll come back to this review after I have spent more time with the HP and give readers my update.Update 1: The battery does last just about five hours.  I put the machine into hibernate after I'm finished with it and when I want to use it again, it starts up quickly.  This machine is whisper quiet.  I'm not sure how they keep it so cool without noticeable fan noise.  The screen is bright and clear for all applications.  The laptop itself is thin and light.  So far, no problems of any kind!Update 2: After three weeks, no problems.  I loaded Google to use as an additional browser and it is fast.  I added a Kingston flash drive and the Piriform CCleaner without any difficulty.  Both work perfectly.  For the money, this seems like a good machine.  I'm hoping that other people give their reviews when they have a chance.Update 3: After six weeks I removed IE9 and installed AOL 9.7 which is lightning fast on this machine.  Still no problems of any kind.Update 4: We watched several Sherlock Holmes films streaming live from Netflix when we were on vacation; the picture was sharp and clear and the sound was good, much better than I expected for a laptop.  The 17\" screen makes a big difference for watching films.Update 5: After four months of daily use, I am more impressed with this computer than ever.  I mentioned that I use an external mouse; even so I am still able to use the touch pad to make text on the screen larger and smaller with a few quick and easy finger motions.  I have dropped the laptop a couple of times, not far, and on a carpet; fortunately, no problems -- concrete would likely be a different story.Anyone else out there have anything to add about this laptop?Update 6: I am surprised by the price increase for this laptop.  I paid $475. for it at Staples, on sale.  I hope that those folks who decide to buy this computer can find a good sale price.  Also, I am interested in any comments by those people who buy the computer with Windows 8 installed.  Is it worth going back to Staples to have them put this new operating system on the machine?  Thanks.", "Date": "August 8, 2012"}, {"Title": "Another 5 Star Review", "Author": "Matty", "ReviewID": "RKZQ8PL1YJWE8", "Overall": "5.0", "Content": "Count me in as another very satisfied customer.  Setup could not be easier.  Hardest question asked was probably my time zone for setting the time. (LOL)  Incredibly easy and intuitive, connected to my wireless network in a breeze.  Took maybe 10-15 minutes total.Can't think of a single negative thing to say.  Touchpad is textured, which is a little weird, mostly when I go back to my old machine, which is smooth.  (Old laptop is a Sony VAIO, running XP, and only 2G).  Other thing that takes some getting used to is that this one has a number pad, which my old Sony doesn't.  It may well come in very handy, but I'll have to get used to shifting my hands left a bit when I touch type, but a few days and I'm used to it.  Also had to adjust the brightness, which I found blindingly bright, but that's just a few clicks on the brightness key.So now comes the hard part... customizing and tweaking.  Biggest headache is just getting used to different software (like Windows 7 vs. HP, and Office 2010 vs. 2003), but the headaches of trying to find where MSFT hides places to change settings is always the same hair-pulling adventure! (That's not related to this machine, just venting at MSFT.  Glad I opted not to get a Windows 8, which is all that is sold in stores these days.  Hard enough to customize when I have a clue how the OS works!)All in all, I love it.  Excellent machine for a great price!  (I have watched as the price hopped around over the past few days.  I got it at $545 on 12/27, and have seen it go up as much as $100 in the past week, and then slip back down.  The seller changes, tho, so that's probably why.)I also paid extra for 1-day shipping (fulfilled thru Amazon, not the seller), and it was delivered on time!  All in all, I am a very happy camper!", "Date": "January 2, 2013"}, {"Title": "Review from a very happy, non-technical person", "Author": "pixie", "ReviewID": "R3VLX0OUY1D3", "Overall": "5.0", "Content": "Looked around for several months for a notebook that suited my needs. Based on several factors (and in large part to Mr. Fanelli's excellent and understandable review) I purchased this item. Delivery was very quick, just a matter of a few days (I purchased this computer from Amazon, vendor was Blizzard LLC). The notebook was so easy to set up, just a matter of several minutes with the little instruction sheet that was included. I was rather concerned that I needed a larger tutorial, but turns out I didn't, as the sheet included what I needed to do my part and the computer did its bit and we were off and running. Recently had to contact my internet provider to set up my anti-virus protection and after the technician \"took over\" my computer (I'm not a technical person so there's probably a better term for this) he said he was very impressed with its speed. I also really like the 17\" display. I had thought that its size would make the notebook unwieldly, but it sits quite comfortably on my lap and I'm not a large person. The display is also really clear and sharp. The notebook seems to run pretty cool but I purchased the X-Pad Slim from Amazon, just to be on the safe side. I use the touchpad instead of having purchased a mouse, and it is quite responsive. I also like the keyboard which has a nice touch. Another reason I selected this computer is that it has Windows 7, rather that Windows 8. I got burned with Vista a couple of years ago and am a bit wary of new operating systems. I see on-line that Windows 8 has mixed reviews.After having this computer several weeks, I'm delighted with my computer and have no regrets.", "Date": "December 26, 2012"}, {"Title": "So far, so good.", "Author": "Teresa Holifield", "ReviewID": "R385BNQBH4VANP", "Overall": "5.0", "Content": "This laptop replaced a Gateway with similar specs.  It was very easy to set up and it is much cooler than the Gateway.  After using for several hours, it is slightly warm instead of hot.  Good resolution and decent speakers for a laptop.  I like the touchpad and found it easy to use.  For the price, I think this is a good value.  I would recommend this purchase based on my experience with setup and usage so far.", "Date": "December 30, 2012"}, {"Title": "Great Computer!!!", "Author": "Chris Barish", "ReviewID": "R3RZODQ3ECGKDI", "Overall": "5.0", "Content": "I normally don't leave reviews for things I buy but so far I have really liked this laptop. I have had it for about a week now and it was worth the price. It may just be that my previous computer was really bad but this computer is much faster than my old one. Not only that the screen resolution looks better the sound quality is so good you don't even need headphones and the wifi works perfectly. I ordered mine refurbished and honestly they could have sold it as new and I wouldn't have known the difference and yet I still saved 200 bucks!!! Finally made a smart move when purchasing a laptop.", "Date": "February 11, 2013"}, {"Title": "Excellent for the the low price!", "Author": "J. MICHAEL DEPOY", "ReviewID": "R15OJGBMVGGCJL", "Overall": "5.0", "Content": "Big screen with excellent resolution and a fast processor. Highly recommended as a replacement for a desktop and significantly more versatile and mobile.", "Date": "February 15, 2013"}, {"Title": "no learning curve here", "Author": "Lee", "ReviewID": "R2P34TDESIF2HT", "Overall": "5.0", "Content": "this is the perfect pc for those of us that are non-techie  .the transition was almost seamless. We actually bought 2. 1 for me & 1 for my husband.", "Date": "January 24, 2013"}, {"Title": "love it", "Author": "Stacie Joerg Cobb", "ReviewID": "R1H8VM7XL95S9Y", "Overall": "5.0", "Content": "Bought for my son for his birthday.  It is lightweight and runs great.  He loves it, it is great for his homework and games", "Date": "March 10, 2013"}, {"Title": "Very happy with this purchase.", "Author": "Collin Ross", "ReviewID": "RZE32HP84AGQ", "Overall": "5.0", "Content": "I am very happy with the speed, functionality and screen display of this HP. Although most people prefer the smaller 15 inch screen laptops I personally think that bigger is better.", "Date": "June 3, 2014"}, {"Title": "Good computer, RUN AWAY IF USING FOR GAMING", "Author": "Gordon C.", "ReviewID": "RPBLKS77TIFSD", "Overall": "4.0", "Content": "Great computer for personal use, but for gaming, I suggest you spend your money on a desktop. It can barely run most games, and they usually come with a horrid fps.", "Date": "May 20, 2014"}, {"Title": "Review", "Author": "sonny", "ReviewID": "R3MANMNKBG8IRT", "Overall": "5.0", "Content": "This computer came packaged very well.  The product works beautifully and I'm very pleased with it.It is very easy to operate and the size of the screen is a big help to older people.", "Date": "September 27, 2013"}, {"Title": "Great Computer", "Author": "David Shelton", "ReviewID": "R2WFULK57XXVBI", "Overall": "5.0", "Content": "The computer arrived as expected, nice computer that only needed a little cleaning up. The computer is top notch, fast, and a good name brand for support.", "Date": "July 22, 2013"}, {"Title": "Love It", "Author": "Rickgum", "ReviewID": "R2MDOUU8SQ3KGM", "Overall": "5.0", "Content": "It goes everywhere with me. Easy to pack, and the battery life is unbelievable. I remove the battery when I'm using it plugged in, and this saves the lifetime of the battery.", "Date": "July 14, 2013"}, {"Title": "Works with GNU/Linux", "Author": "Steven L. Grace", "ReviewID": "RAMZP7TEM3ZAP", "Overall": "4.0", "Content": "I'm very pleased with this computer. It's probably more powerful than my desktop PC.My biggest issue has been the keyboard layout. Some of the keys I use a lot (Delete, Page Up/Down, Home, End, and the cursor arrows) are not very big. Also, there's no Num Lock indicator. Other than that the keyboard is nice.The computer came with Windows 7, but I won't be reviewing that because I'm running a GNU/Linux system (Xubuntu 12.04). Xubuntu runs well on this computer. The only issue I've had is that wireless networking didn't work \"out of the box\" -- I needed to install the proprietary Broadcom driver (which was easy to do).The original hard disk layout had all four primary partitions in use. In order to install Xubuntu while keeping Windows I followed instructions on the HP support forum (I deleted the System partition, repaired the Windows boot process, and repartitioned the disk with three primary partitions and one extended partition).", "Date": "May 29, 2013"}, {"Title": "HP Does it again for us!!", "Author": "banannafingers", "ReviewID": "R3SFA8169OD8DX", "Overall": "5.0", "Content": "This HP replaces a 5-yr old unit.  We love our new one.  Easy to set up.  Easy on Batteries too.", "Date": "May 26, 2013"}, {"Title": "good", "Author": "GA GIRL \"GA GIRL\"", "ReviewID": "R279XL1BWQ3CJ1", "Overall": "4.0", "Content": "a decent computer but I wish the keyboard was lit so it was easier to see in the dark. good buy", "Date": "February 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008GLB5B8"}}