{"Reviews": [{"Title": "Great Laptop!", "Author": "Andrew", "ReviewID": "RZ2NEG1G9M29R", "Overall": "5.0", "Content": "*Note: This is an updated review. Updated on, 3/7/2013Ok, before purchasing this product, I searched and searched everywhere for other laptops. I'm not too technical when it comes to computers. To me, a computer is a computer. However, as a college student, I do want something that runs fast and smooth yet inexpensive. So my super old laptop broke, when I mean old, I mean Windows XP old. I went on the hunt for a new laptop. I know there are better ones out there, but I do recommend this laptop if you're looking for something that is not expensive and runs VERY smooth and fast!If you're on a budget, this laptop will work for you. It's not expensive and it has a lot of amazing cool features that will satisfy all your entertainment needs. Videos on Hulu and/or Netflix work well. I haven't had a problem yet. Games also run smoothly. If you're a Sim player, then this laptop will run it smoothly, and without a problem.Webcam is pretty cool, too. Although it's not HD quality or anything, it still takes view-able pictures and videos. Works well with Skype and other third party communication applications. The sound is okay, not too fancy like I expected, but it's good quality.Not only do I use this laptop for entertainment, it's indeed very useful for school. As a college student, we depend on our computers to function, this laptop has not let me down yet.In the end, I do recommend. Funny thing, my sister bought one after I did and she loves it too.*Update, August 2012:The computer is still fine, working properly, no problems whatsoever! I use it all the times for school, since the Fall is now beginning! Even if you're not in school, it is still good for your entertainment needs, and all your other necessities!*Update, March 2013It's the Spring term, and the computer has not let me down yet. Everything works fine. I have two writing classes, which all deal with research, and it's really easy to do with this computer. It's still fast and reliable. The only problem that I'm seeing is that it's overheating. It just overheats quickly. I think this is because of me playing too much Sims 3 during my freetime (which I have none, oh my, haha). So, what I suggest you do is purchase a laptop cooling fan. That's what I did, and the computer is not overheating anymore, thank God! If you do purchase a fan, please make sure it's the right one for your laptop. In terms of size, etc.I still recommend this laptop to anyone. Although Windows 8 is out, I think you should hold on getting Windows 8.-Andrew", "Date": "July 26, 2012"}, {"Title": "Great product", "Author": "Fusebomb", "ReviewID": "R38EL3I9YRUPGP", "Overall": "4.0", "Content": "This laptop  is a great buy for the price. It is exactly what I expected, and I really like the size of it after having a 17 in' for the last 2 years. Performance wise, avoid running multiple application at the same time ( and I mean running more than 5 apps at the same time). Tested it to see how much it could handle, and it didn't hold up very well. If your looking for something that looks nice, works great, then you can't go wrong for $389.", "Date": "August 4, 2012"}, {"Title": "Better then expected", "Author": "Matt A.", "ReviewID": "R3UTCLAOGX868P", "Overall": "5.0", "Content": "I debated tablet, netbook, and new laptop. Netbook and tablet wasnt going to fit the bill because I need something with a drive. After much deliberation I went with the G6. Turns out I made a good choice. The picture clarity is fantastic. Its one of the fastest laptops I have owned.With windows 7, how could you go wrong. I have owned other HP laptops in the past and I think this one here is the better of the ones Ive used. The wireless works well on my network. So far so good, I will post something out if things go wrong but to be honest I do not forsee that.", "Date": "July 31, 2012"}, {"Title": "Excellent Laptop...Great Step Up from Netbook", "Author": "Ashley Mott", "ReviewID": "R2A50IFBOHVMLZ", "Overall": "5.0", "Content": "I purchased an HP netbook around July of 2010 and really adored it for quite a while. In December of 2011, I had oral surgery and didn't feel like sitting at my desktop for a couple of weeks because my neck and upper body ached (I have no idea why b/c I was out cold). Anyway, while working from my easy chair and watching the Golden Girls, I gradually began to realize that my netbook was basically useless when I had to research articles (I freelance) and/or log into my college's online system for completing/submitting assignments. The netbook was actually restricing the performance of my high-speed internet.So, I shopped around and saw this laptop in a store then came home to research it online, analyze the specs in comparison to other models, etc. I felt that this laptop was the best value (as of early 2012) when compared to other laptops with similar features. It definitely has all the power I need for running office programs, blogging, playing Zynga games (I confess), etc. My netbook would have died if I looked cross-eyed at anything beyond my Facebook wall. I also loved that this has all of the F buttons and \"Home,\" \"End,\" \"Page Up,\" and \"Page Down.\" Navigating without a mouse is awkward enough without losing my favorite keyboard shortcuts because the buttons were gone.For anyone needing a work/school/casual entertainment computer, this unit will suffice. However, you will need a pair of headphones to truly enjoy a movie since even the improved speakers leave a bit to be desired. This probably wouldn't be powerful enough if you are into high-end gaming or a high-end media consumer.The only quirk I have experienced with it is the brightness adjustment buttons losing their ability to actually adjust the brightness. I had to look around online to find the way to fix this issue. It was fairly simple to correct, but still an odd situation that (based on my reading) seems to be common with some models of HP and Compaq laptops.I don't think I will be replacing this unit at any time in the immediate future since it has all of the power I need at the present time and likely will for many years.", "Date": "September 10, 2012"}, {"Title": "Excellent laptop", "Author": "AKN", "ReviewID": "R3B9W3OO3XSHGC", "Overall": "5.0", "Content": "I have owned many HP Pavilion desktops over the years, and loved them all.  They all lasted for many years, and never had any problems at all.  I'm not sure if the Pavilion is a separate division of HP or not, but it's a name I know and trust.  I have had several HP printers also that print beautifully without problems, so when it was time for a new laptop, I chose another HP.This is a sleek, good looking, lightweight workhorse of a computer.  It comes loaded with Office, which I wanted. The keyboard is perfect, and the screen is matte and doesn't seem to collect dirt and fingerprints easily.  The fingerpad mouse works effortlessly as well.  I like this so much, I stopped using my desktop computer completely and now have only this on my desk.This stays remarkably cool on the bottom, unlike some other laptops I've used. And the price is good for a remarkably nice laptop, carrying the Pavilion brand no less.  The case is glossy but it also fingerprint resistant. It's a classy chassis and not cheap feeling.  The keys feel solid and are very quiet.The touch pad is excellent.  It is a simple textured plastic pad built into the wrist rest with two mouse buttons underneath.  The pad is the right texture, and the buttons are solid feeling.The display is LED backlit, with great quality image.  This also has nice Altec Lansing speakers, which sound very good for a laptop.  Not great, but better than most.I'm no expert on chipsets and processors.  I can only tell you tha this one doesn't slow down when I have Dreamweaver open along with Office, at the same time.  I keep those two programs, along with a few other windows, open at the same time.  I can't tell that this is such an inexpensive laptop, since all these programs respond perfectly even though I am probably using the maximum ram.The built-in CD/DVD burner was a must have for me.  So many laptops skip this, but I use a lot of CD's since I subscribe to Netflix, and was tired of hooking my external CD drive to my last small laptop.I can't think of any negatives on this laptop.  I have found that anything with the HP Pavilion name on it works flawlessly, and this one is no different.  This is my fifth Pavilion.", "Date": "October 24, 2012"}, {"Title": "HP Pavilion g6-1d80nr 15.6\" Laptop Review", "Author": "John F. Clark Jr.", "ReviewID": "R35KBIY9N5RX8N", "Overall": "4.0", "Content": "The HP Pavilion g6-1d80nr 15.6\" Uni-body is made of plastic. This type of plastic shows to be very strong, not what you would expect with plastic construction. The top lid has large hinges that snap it close, the lid has no latch, so far it does the job. The keys are nicely laid out, the only thing here is that the letters and markings are hard to see in low light. Next thing, the mouse pad has some problems. The mouse is hard to scroll, and hard to control. The mouse will hang up and jump around. The software that is supplied is not that good, some of it needs to be uninstall. There are some good things about this unit, that is for a 15.6\" laptop it is very light weigh. With 4gb of ram and a 500gb hard drive, it has good speed. The video screen is lacking in pixels, but it gives a very nice bright picture. The audio speakers are very weak, not much going on there, for good audio you need to add head phones, are mini speakers. For the price, this is a good basic laptop. I think that an upgrade to Windows 8, and adding some good software, will make this a great laptop. I am giving it 4 stars.", "Date": "September 10, 2012"}, {"Title": "who knew?", "Author": "Satisfied Customer", "ReviewID": "RBJ5299IW5VPM", "Overall": "5.0", "Content": "i got lucky! just bought this two days ago using my cell after my 6yo iBook went to laptop heaven.  a lot has changed in six years LOL.  loving it. my iBook was pre-intel too so this is a lot of fun. everything loads.. and fast too. just like the two other reviews this is a winner.. buy it. (and i got it for $379 JUST TWO DAYS AGO!!!)", "Date": "July 30, 2012"}, {"Title": "great", "Author": "invisibleman2", "ReviewID": "R1WZRL0TOQYCTY", "Overall": "5.0", "Content": "I love it. Runs quiet. It is pretty fast. The sound is no problem at all. It isn't really that low starting out. Just right to me. The cam and mic works good on Oovoo web cam chat program. It was easy to set up and easy to get use to the mouse system. The keyboard types great. I got this laptop for 389.99 so it was a great deal. Still likely a great deal because you'll get a good laptop. If you don't like using the mouse pad you can hook up an usb mouse easily.", "Date": "August 9, 2012"}, {"Title": "Great laptop", "Author": "William R. Harris \"Billy Bob\"", "ReviewID": "R2PB6BAH3J39CV", "Overall": "5.0", "Content": "After having purchased 3 or 4 Sony laptops I decided to try an HP and thus far couldn't be more pleased.  It was priced very reasonable, it is very fast, it accepted all my existing software and it connects to my wireless router much faster than my Sony.  I say keep it up HP!!!", "Date": "August 21, 2012"}, {"Title": "Mt First Laptop", "Author": "LMC", "ReviewID": "R3XJ76MF6BCL8", "Overall": "3.0", "Content": "I bought this laptop for my first semester of college, I have only had it for a month and so far it has performed with out any major hitches. Although, the only issue I have had with it to date is it having an issue starting up.One time I had to try a few times to get it to start up right, but I think that had more to do with an update it had installed and was \"trying to deal with\".Some features I love about it: the size vs the weight(It is a decent size, but very light weight), crystal clear webcam, nice keyboard, brilliant screen and sound resolution,decent battery life(4+ hours), and it's really fast (dual core processor).", "Date": "October 27, 2012"}, {"Title": "Fantastic computer except for the touch pad.", "Author": "Apvizon", "ReviewID": "RJPU88QHB26JT", "Overall": "4.0", "Content": "Overall a pretty amazing value for the price. My only major complaint is the touch pad, what a glitchy piece of garbage. The two finger scroll feature is a joke and I'm constantly clicking and highlighting the wrong stuff while trying to simply move the arrow across the screen. Makes me really appreciate how well the Mac Book Pro got it down.", "Date": "November 5, 2013"}, {"Title": "Biggest annoyance for a college kid", "Author": "Meghan", "ReviewID": "RZTMHM96MN2N8", "Overall": "2.0", "Content": "I hate this laptop. It worked fine for almost a year but then I started having all sorts of problems. Every time it shut off I would have to restart it 5-10 time (no joke). You could tell it was on but the screen would be black. Finally, after many tries,  it would give the option to do a scan and restore which would sometimes take 20 minutes. With college homework online this was a real inconvenience with deadlines.Sometimes problems would arise without shutting it off then, of course, I'd have to shut it off to restart it again and the circle continued. I also dont like how cheap it looks and feels.", "Date": "October 2, 2013"}, {"Title": "WARNING: Laptop Freezes! Don't Buy!", "Author": "Jenny Pruitt", "ReviewID": "R41EA6W6TH3SN", "Overall": "1.0", "Content": "I wanted a new laptop because my Dell is older and I wanted a newer, faster laptop. I thought this HP laptop would be a great laptop for me. I now wish I had NEVER purchased this computer! I have had nothing but trouble since I bought this laptop.For a short time (less than a month) after I purchased this laptop, it worked fine. Then all of a sudden it froze one night. I figured that I'd just call HP and they would fix it. Was I ever WRONG! I ended up staying on the phone for over TWO hours! It was after MIDNIGHT before I ever got to hang up! I was told to restart the laptop, which I did. It froze again. Then I was told to perform every diagnostic test possible on my computer. Every test reported no problems. The laptop still froze.So, I waited until the next day, and I called HP again. This time I was given more instructions, that I followed. The laptop froze the first time I turned it back on! This time it wouldn't even allow me to enter my password because it froze before I ever even got to that point!I called HP yet AGAIN, and yet again I was on the phone for a very lengthy period of time, and most of the time I was on HOLD! Finally, after waiting a ridiculous amount of time, I was finally transferred to a woman who decided to send me four discs. I received three system recovery DVD's and one application and driver recovery DVD. I followed ALL of the instructions. I was hoping that the problem would finally be fixed. Well, it wasn't. The very next time I turned the laptop on, it froze!I called HP once again, and once again I was on the phone for a very lengthy period of time. Finally, after being placed on hold for a ridiculous amount of time, I was told to ship the laptop to HP to be repaired. I received a box to ship it in, and I thought \"finally I am going to get this laptop repaired\". Well I was wrong. I received the laptop a few days ago. I turned it on for the first time last night. It froze again!Today I called HP. I spent a very lengthy period of time on the phone with them. I was on hold for a very long time. Finally I was told to send the laptop back to be repaired once again. I really couldn't believe it when I was told to send this laptop back a second time. It's under warranty, so I assumed that HP would offer to replace the laptop or give me a refund. Well that's not at all what they offered. They offered for me to return this laptop once again, to be \"repaired\" once again. At this point I don't believe this laptop will be repaired. I am terribly afraid I will send this laptop back and receive it, a second time, in the same condition.HP's customer service is simply horrible. I own a business and I stand behind my products. If I sell something to someone, and they aren't happy with it, then I give them a refund. HP doesn't do this. HP informed me that I needed to return this laptop THREE times before they will consider refunding my money or replacing this laptop. I really don't think that I should have to send this laptop back THREE times to be repaired before I might get a refund or a replacement. This is a waste of my time. I'm very disappointed with this laptop and HP's customer service.If you want a reliable laptop, I would strongly suggest that you don't purchase this laptop. I've had nothing but trouble with this laptop, and I am STILL having trouble.", "Date": "July 23, 2013"}, {"Title": "The screen is going out less than a year after purchase", "Author": "Lis", "ReviewID": "R2JMMDRJBBSAWE", "Overall": "1.0", "Content": "I purchased this laptop in August 2012, after my old Sony laptop died after nearly five years.  Right off the bat, I wasn't fond of the keyboard or touchpad; I feel like I have to mash down some of the keys (particularly the space bar) to get them to work.  As I intended to use this laptop for writing, that was a big problem, and I ended up sticking with my netbook for writing.Still, it was a fairly good laptop, and I stuck with it.Fast forward to July 2013, and the screen is going out on the laptop.  At random times there are flickers running horizontally across the screen for several minutes, and the duration is getting longer each passing month.  I've owned this laptop for less than a year.  I have babied this thing.  It has never been mistreated, dropped, or even moved (it has remained on my desk since I pulled it out of the box), and the screen is going out already?  Seriously?I'm going to have to buy another laptop, it seems, and it definitely isn't going to be an HP product (ever again!).", "Date": "July 4, 2013"}, {"Title": "Garbage", "Author": "Marcus House", "ReviewID": "R3UK098CCSDWU2", "Overall": "1.0", "Content": "The price is great but you get Garbage.  Within 1 week of buying I see that the keys on the keyboard stops working.  You will hit a J and it thinks you are trying to do F2 or screen swap.  The only way to get out of this is to log off and log back in.  The hot keys at the top of the keyboard are swapped.  So F5 does not do refresh.  I have never been able to successfully connect wirelessly with my printer.  Now after about 2 years, entire folders disappear.  What do I mean by that?  Well you can go to Windows Explorer (file manager) and you can go to your My documents folders and you can see your \"Kids\" folder (as an example) but if you write a word document and then go to save it, the \"kids\" folder within your My documents folder cannot be seen.  So what I have to do is save it to my desktop and then move it manually to the kids folder.  This also means that for the most part if I want to send an email with an attachment I need to save to the file to my desktop to ensure I will be able to find the file to attach to the email for sending.  I bought this laptop brand new and before this I had a Compaq Presario CQ60 that went bad a few short years after buying brand new.  I am really starting to think I should avoid all HP laptops all together.", "Date": "June 28, 2013"}, {"Title": "Works great", "Author": "Marc", "ReviewID": "R3SMQIKF6LV0BA", "Overall": "5.0", "Content": "Have had this for several months with no issues. Will buy HP again and recommended to friends and family. Fast shipping also.", "Date": "May 28, 2013"}, {"Title": "Touchpad is terrible", "Author": "criticalcritic", "ReviewID": "R3PNNN0NKS6SOE", "Overall": "2.0", "Content": "Most of the computer is fine, but I'm having major issues with the touchpad and the problems were immediately noticeable.  I've searched other reviews on other sites and it seems to be a very common problem on this model.Basically the touchpad is slow to respond if at all.  The 2finger scroll and zoom never work properly at first, and then, once the computer figures out what you are trying to do, it tries to correct for the movements you made making the screen scramble all over the place.  The click dimple in the top of the touchpad is impractical, since most of us use our pointer finger to scroll, so you either have to use both hands to use this feature, or learn to hold with your index finger while scrolling with your middle finger, or become a left handed mouse user.If your finger ventures off the pad at all and then returns, it switches the screen to another Windows tile which is super annoying.I can't find a place in any of the settings to adjust or calibrate the pad.This problem is so distracting, I am buying a regular mouse, but do not recommend this laptop, because carrying around a mouse and finding space on the airplane to use a mouse is defeating the purpose of a LAPTOP.", "Date": "May 13, 2013"}, {"Title": "Sometimes you get lucky", "Author": "Alex", "ReviewID": "R36350DL02Q9LE", "Overall": "1.0", "Content": "This is very true. However, I didn't get very lucky with this laptop. This laptop was alright for a little while, but it continually blue screened on me. I've had to switch out the hard drive already and it isn't getting any better. I don't move the computer very much and I don't use it unless I need to. It has and awkward design (IMO) and the battery just didn't do it for me. It was great when I got it and it has been nothing but downhill since then. However, I've seen that they have upgraded the computer since my purchase. For the price, it's okay.", "Date": "March 3, 2013"}, {"Title": "HP Pavillion g6-1d80nr 15.6\" 64 bit notebook Windows-7", "Author": "E IN MARYLAND", "ReviewID": "R3LD58LARGL8AG", "Overall": "5.0", "Content": "The laptop/notebook arrived in perfect condition. The (gray) color was not a factor for the purchase, the screen 15.6\" works well and the display is easy to read, it is bright and clear. It has a 640gig hard drive, 4gig ram memory, runs at 1.9 gig, with a dual processor and reads the data 64 bits at a time, vice the standard 32 bit. Runs quite well, setup was easy since it is menu driven. The laptop is lightweight, and I am very pleased with this laptop. It has a built in camera (which I will probably never use). The laptop exceeds all my requirements, I am very please with this notebook.", "Date": "February 26, 2013"}, {"Title": "It's OK", "Author": "Patricia Russo", "ReviewID": "RAWDFDOMRLB8K", "Overall": "4.0", "Content": "It's the laptop I'm writing this review on!  It works well and is well protected but doesn't come with a Word Processing program of any kind, you must purchase it.  I guess that is why the cost is so low, it is so devoid of software.  Also, it doesnt come with many directions so it's not good for a beginner.  You have to use the computer to get the directions!  But what if you don't know how to use the computer?  Also, it is hard to run many websites at once, unless I'm doing it wrong.  I like the webcam and it has Skype.", "Date": "February 23, 2013"}, {"Title": "Muy buena", "Author": "José Luis Ruiz Agüero", "ReviewID": "R189OEMR4DFFBG", "Overall": "5.0", "Content": "Perfectamente empacada y a tiempo, 100% funcional y hermosa. El envio fue increiblemente rapido y muy bien cuidado el paquete.", "Date": "February 19, 2013"}, {"Title": "Great product", "Author": "steve", "ReviewID": "R1LSPD3OWVY9A5", "Overall": "5.0", "Content": "Not only did I meet my expectations but I had the same laptop before I bought a new one and this one is more upgraded that the one I had before", "Date": "February 15, 2013"}, {"Title": "a great HP laptop", "Author": "Arlene", "ReviewID": "R3TPL5P42T057", "Overall": "5.0", "Content": "I needed a new laptop and this is perfect for home use.  I wasn't ready for Windows 8 yet and this has Windows 7.  I am very happy with this laptop.", "Date": "January 30, 2013"}, {"Title": "Loving it, and writing this review with it!", "Author": "Kara L Barnes", "ReviewID": "R56KKUGCBTR5", "Overall": "5.0", "Content": "Fast, decent battery life and soo much better than my last laptop. Highly recommend! Screen is big and bright and the weight isn't too bad for the size.", "Date": "January 29, 2013"}, {"Title": "Love It", "Author": "L. Parks \"Lady Reads-a-lot\"", "ReviewID": "R1V34J3QE4G4XX", "Overall": "5.0", "Content": "Really love my HP laptop!  Had a Dell prior to purchasing this HP and it was less than desirable!  I am glad that I went with HP because so far it has not given me a moments problem. Love the fact that you can disable the touch pad while you are doing a lot of typing. This helps to keep the cursor from ending up in weird places.", "Date": "January 26, 2013"}, {"Title": "HP Pavilion", "Author": "Cari Lindsley \"Cari\"", "ReviewID": "R2H3TQUIH224H9", "Overall": "5.0", "Content": "For the price it's very good.  If I had paid a few hundred more I would expect the sound to be a little better.wonderful value.", "Date": "January 6, 2013"}, {"Title": "Great Deal", "Author": "Toni L Marston", "ReviewID": "R282WNZSXNT9GK", "Overall": "4.0", "Content": "I got this model on a special and admit was surprised the 15.6 larger than I expected, but am more than pleased with its' daily performance.", "Date": "December 31, 2012"}, {"Title": "Buen producto, excelente capacidad de almacenamiento", "Author": "Edith Romero", "ReviewID": "R2JYL7WFTQ1CN9", "Overall": "4.0", "Content": "Califico con cuatro estrellas porque la laptop fue entregada sin factura comercial, eso retrasa el trámite aduanero y retarda el envió", "Date": "December 18, 2012"}, {"Title": "Sin factura comercial", "Author": "Yulismar Romero", "ReviewID": "R2ZUQBIWER9LE", "Overall": "4.0", "Content": "Es un buen producto; coloqué 4 estrella porque el vendedor entregó  la hp sin factura y eso retrasó el envió a Venezuela. Recomiendo siempre entregar los productos con sus respectivas facturas", "Date": "December 18, 2012"}, {"Title": "Everything we need.", "Author": "Kay M. Wehrle", "ReviewID": "R1MSCYBXP6CI24", "Overall": "4.0", "Content": "So far, so good.  Everything works exactly like we anticipated and we are very satisfied all way around.  Our son is  microsoft certified and he recommended this particular computer when we were looking to upgrade.  It definitely fits our needs.", "Date": "December 12, 2012"}, {"Title": "always buy and HP", "Author": "murfsdeb", "ReviewID": "R1ILC1SGSOINA5", "Overall": "5.0", "Content": "...and I have never had a problem with an HP product...so far...lol...it is exactly what my mother needed and wanted...nothing fancy, just your basics...", "Date": "November 18, 2012"}, {"Title": "Perfect for Me", "Author": "AJ", "ReviewID": "R34ZDNWKGUHUWL", "Overall": "5.0", "Content": "I love it!  It has everything I needed it to have.  It originally wouldn't hook up to some Wireless servers apparently because of a setup with HP, but it's fixable with just a phone call! :)  It's so much more easier to lug around than my 17\" one was.", "Date": "November 12, 2012"}, {"Title": "great product", "Author": "mell", "ReviewID": "R3SJREH2CS2TZJ", "Overall": "5.0", "Content": "this product is great, will recommend it to anyone and the keys makes it so easy to type, just love it", "Date": "November 10, 2012"}, {"Title": "Good PC", "Author": "Norman", "ReviewID": "REB4QPE8AHYON", "Overall": "4.0", "Content": "Good for the price and I like the design it's nice look slick. I will update more after I use it more", "Date": "November 3, 2012"}, {"Title": "Good product", "Author": "Juma", "ReviewID": "R3TC6A4H321P27", "Overall": "5.0", "Content": "Easy to use, lightweight, arrived on expected date, exceeded my expectations!My money was worth it! Good product with an easy configuration!", "Date": "October 29, 2012"}, {"Title": "PERFECT LAP TOP", "Author": "angeldust43578 \"Sandra Tabor\"", "ReviewID": "R88E85QF24Q25", "Overall": "5.0", "Content": "I purchased this laptop for my grandson,and he really likes it alot. He had a friend that had one, and decided he would like one for himself. The shipping was very fast.The laptop was securely packaged. The product was easy to set up, and use right away.", "Date": "October 11, 2012"}, {"Title": "excellent", "Author": "Leo", "ReviewID": "R3NORLVH4E3LFV", "Overall": "5.0", "Content": "For the price I paid for this computer, it's more than I expected. I recently bought it so I'll try to update my review later on to see how it's performing. I would recommend this product.", "Date": "September 30, 2012"}, {"Title": "Great deal for the price!", "Author": "Amazon Customer", "ReviewID": "RS6ITWGB68PZD", "Overall": "5.0", "Content": "I actually bought this computer from a reletive but came here to check reviews first.  I was glad I did!  This computer is very good for the money!  I spent $200 more on my previous laptop and only got half as many options as this one.  It has a nice sized hard drive along with 4 gb of ram and a built in webcam.  the processor could be better but for the price its fine.  That being said it probably wouldnt do well with some high end games but is excellent for every day stuff and web browsing", "Date": "September 26, 2012"}, {"Title": "Wasn't satisfied with the product", "Author": "Shaun P", "ReviewID": "RK7RMGIX4S7ZE", "Overall": "2.0", "Content": "When I received the product the laptop box was smashed in on one side, which shows it wasn't handled with care. Another thing is the keys were sticking and hard to press, which shouldn't happen on a new laptop, It was slower than my desktop I have had for 3 years. I was looking for a optimal laptop and what I got was nothing compared to what I was expecting. I probably won't order from this buyer. Perhaps it was just my luck I got stuck with a not so good service.", "Date": "September 4, 2012"}, {"Title": "Find a better laptop.", "Author": "Edward A. Del Castillo", "ReviewID": "RYKWOZPKGVVP1", "Overall": "1.0", "Content": "I have owned this laptop less than a year and am frustrated enough to write this review.  I'll be brief.1. Keyboard is flimsy - the faster I type, the more keys don't register.  the result is excess finger fatigue from over pressing the keys and loss of flow (it's happened already while writing this).  The Dell Vostro series and all Apples have much better keyboards.2. In less that a year, 2 of the 3 USB ports are no longer fully functioning.  I can still get power from both, but can't get data from either, making them effectively useless.I have no idea what it's going to cost to fix this but if it's not free it will be too much.  Sure, this might not happen to you, but why take the chance.  Get yourself something more reliable.", "Date": "March 11, 2013"}, {"Title": "So Far It's Great!", "Author": "Ines", "ReviewID": "R3H3MBK8Q4QCMW", "Overall": "5.0", "Content": "I just recieved my laptop yesterday, shipment was really quick and i must say so far its perfect! The internet works really fast and the images on my screen are crystal clear and sharp. I haven't played any games, my main reason for buying a laptop is because i need it for school work and research. I havent really done anything else so I'll keep you guys updated but so far its great I recommend it!", "Date": "August 15, 2012"}, {"Title": "Nice laptop for the price!", "Author": "Pinkydoodle2", "ReviewID": "R1IR1YFOFMYD7X", "Overall": "4.0", "Content": "I have mine for a little over a week now, and so far so good! Its very fast and has a nice large screen, works very well!  Great price too!", "Date": "August 8, 2012"}, {"Title": "Dont buy", "Author": "Joee", "ReviewID": "R3C6C2735ZFQG6", "Overall": "1.0", "Content": "I bought it new from Best Buy and my HP pavillion broke one by one....first the laptop hung after the first boot ever.Then I lost the USB ports in a few months...then I lost the SD card slot in next couple days....then I lost the DVD drive in further few days....then I lost the power adapter and now this laptop reboots very often spoiling my hard done work....I dont use it except for browsing.Beaware of HP's product. My pavallion is not this model so take your chances if you think HP has improved. Please note that their customer service could not resolve any of these problems.", "Date": "October 1, 2012"}, {"Title": "2 Year Warranty", "Author": "Darlene Couch", "ReviewID": "R29MOQLA7166TX", "Overall": "5.0", "Content": "The warranty came the same day I received the new Laptop. From what I read, the warranty looks great...but of course it's hard to comment on something that you haven't had to use! I'm glad that I have this 2 yr warranty, it gives me a sense of security to have it!Darlene Couch", "Date": "October 17, 2012"}, {"Title": "Juwan's Rateings", "Author": "Reviews", "ReviewID": "R12XV9LU6684I6", "Overall": "5.0", "Content": "This is a good product to use.It last up to seven hours on power.There already at Norton secerity on the system.Thats a better price than a Mac", "Date": "October 13, 2012"}, {"Title": "HP Pavilion G6", "Author": "DJ", "ReviewID": "RCTEA0X102QX3", "Overall": "5.0", "Content": "The Best Laptop Ive evr Used. Good Price...arrived In New Origional packaging.Battery Dies a Little Fast But All around Good Product And FAST", "Date": "September 24, 2012"}, {"Title": "my HP Pavilion g6-1d80nr", "Author": "connie", "ReviewID": "R1KZK2IEWJE6LY", "Overall": "5.0", "Content": "Just love my HP Pavilion g6-1d80nr. It works great for my needs. If I need help I can get it online or from family members.", "Date": "August 31, 2012"}, {"Title": "Husband Pleaser", "Author": "Harriet", "ReviewID": "R1MJE5INERHC9R", "Overall": "4.0", "Content": "I purchased the HP Pavilion g6 from Amazon, for my husband's birthday. I got the absolute best price for this unit after researching it with The HP Store among their other Laptops. It featured all the elements he needed. It just so happens we would have chosen the dark gray color in which it automatically came.  My husband got annoyed with being chained to our desk PC and wanted the freedom to move around with a Laptop. He enjoys working his photography application, doing research and of course, the games, ie., chess, freecell. Amazon is amazing! Thank you for inviting us to participate and share our opinion.", "Date": "August 31, 2012"}, {"Title": "HP is the absolute worst, I am embarrassed to be a customer", "Author": "Adam T.", "ReviewID": "R3G9L8DGBUWA3U", "Overall": "1.0", "Content": "I bought this computer just over a year ago. It worked great...for 10 months. Then about 2 months ago the computer started freezing every time I would lift it up (physically) and move it to another location. Then when I would force restart to get out of the freeze, the internet connection was unavailable. I would have to restart the computer 5-10 times before the internet connection miraculously returned. But whenever I moved the computer again, it would freeze again, making this computer,  A PORTABLE LAPTOP, practically unusable.So I called HP for help, to find that my warranty had expired literally the day before. I don't know what warranties only last 10 months, but I didn't have any proof of otherwise, so I thought screw it, I'll renew my warranty in order to get help. After that, I spend 3 HOURS on the phone with a customer service rep (50% of the time on hold), who asked me through every diagnostic test possible on my computer. Every test reported no problems. I insisted that it was a hardware problem and not a software problem, but they insisted that these steps were necessary. They then had me WIPE MY COMPUTER ENTIRELY CLEAN, claiming it was a bad software application insalled on my computer. Still the problem was happening. They then told me they would speak to their supervisor and call me back that day. THEY NEVER DID.I called back the next day, waited on hold for an hour, and finally got to a customer service rep. This rep wanted me to REPEAT ALL THE DIAGNOSTIC TESTS FROM THE PREVIOUS DAY. I tried to refuse this, but she insisted, so I spent another 3 hours running the diagnostic tests. Everything came back fine. She then put me on hold for 45 minutes and transferred me to a hardware specialist. This new \"specialist\" asked me to UNSCREW THE BACK OF MY COMPUTER, REMOVE THE BATTERY, AND EXAMINE THE MEMORY CARD. Luckily, I am somewhat competent in these things, but the thought of my mother being on the phone with this rep and trying to follow these unstructions is hysterical. This would never happen from an Apple representative.After everything was STILL fine, and after almost 10 hours of being on the phone with HP, they finally agreed to repair my computer. They sent me a box that I put my computer in, and also a form to explain my problem in detail. The computer came back 10 days later (yes, I was without my only computer for 10 days and had to borrow old ones from friends. Luckily all my files are on DropBox). When I got the computer back, I turned it on, and lifted it up, and THE COMPUTER FROZE. Yes, after 10 days of \"tests\" and \"repairs\" at HP, they had done absolutely nothing to fix my problem. I called them again, they said they were \"so sorry\", and sent me another box to send my computer back to them.My computer came back 10 days later, and it was actually fixed! Too good to be true, I thought! And I was right. 4 weeks later, my computer is freezing AGAIN. And it won't connect to the internet, AGAIN. I called HP, AGAIN (now having spent over 20 hours on the phone with them over a crappy $400 computer), demanding a replacement. Somehow, \"THIS COMPUTER IS STILL NOT ELIGIBLE FOR REPLACEMENT\" and there is \"NOTHING THEY CAN DO EXCEPT ATTEMPT ANOTHER REPAIR.\" So they are sending me another box, which I will send my computer back to them in.I guess I should have expected this from a computer that is only $400, but for me to spend over 20 HOURS on the phone and not be with my only computer for what will soon be 30 days, without it getting fixed, is completely ridiculous. HP has no sense of customer service; everything in their system is about saving money and managing costs. They have no concept of creating a valuable experience for their customers. Apple's best salespeople are their customers--everyone who owns a Mac tells their friends to buy Macs. NOBODY who owns an HP should EVER recommend it to anyone, because they are literally the worst company I have ever dealt with. That is all.", "Date": "September 22, 2012"}, {"Title": "Great Quality", "Author": "pjf7915", "ReviewID": "R8BNX4NMLLE9J", "Overall": "5.0", "Content": "This is a high quality laptop for a very affordable price. The monitor has a very crisp display and the blu-ray player will make it great for watching movies.", "Date": "September 3, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "AMD a_series_dual_core_a4_3305m Processor 1.9GHz (1MB Cache)\n4  GB SDRAM RAM, 3 USB 2.0\n640GB 5400rpm  Hard Drive\n15.6-Inch Screen, AMD Radeon HD 6480G\nWindows 7 Home Premium 64-bit", "Name": "HP Pavilion g6-1d80nr 15.6-Inch Laptop (Dark Gray)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Zog-FesXL._SX300_.jpg", "ProductID": "B0085RUZ7S"}}