{"Reviews": [{"Title": "Amazing value!", "Author": "Jacqui", "ReviewID": "R1QZ6I7UHBKQ4Y", "Overall": "5.0", "Content": "This is a wonderful lap top for the money. Fast, nice screen resolution, clear, and the keypad is very accessible. Bought this for my 86 year old Dad and he loves it. This would make a wonderful lap top for someone going to school. as it is not that heavy. Great value for the money.", "Date": "August 20, 2012"}, {"Title": "poor quality at the design level.", "Author": "Donald Jones \"donmarjon\"", "ReviewID": "R1H1J1W5MHCW6J", "Overall": "2.0", "Content": "The Pavilion G6 series lap top from HP may look nice but has some HP known issues. I purchase one about three month  ago. And was working fine until the other day. I went to turn on the laptop and nothing. No display and No power led's. I verified that the power pack was working giving out the correct voltage with a volt meter. I called HP and told them what was happening. I ended up getting the laptop working with a couple of simple steps. 1st remove the battery and unplug the laptop. Plug the power pack back in with the battery removed. This resets the laptop. Once powered up I shut down windows. I then plug in the battery to test if I had a battery problem. The laptop came back up without any issues. After talking with the HP rep he stated that this was a known issue with the pavilion G6. Ii seems that static will build up on the plastic case causing a charge across the motherboard. When this happened the laptop needs to be reset to dispel the unwanted charge.  I would expect a known with a company like HP to correct the problem instead of continuing to manufacture a defective product. A simple fix would be to use a static resistant plastic in the laptop design.", "Date": "August 16, 2012"}, {"Title": "GREAT111", "Author": "Rody", "ReviewID": "RTMUG93IUYBTN", "Overall": "5.0", "Content": "I bought this laptop at a local Micro Center. This thing is amazing!!! i paid $399.99 plus taxes and a 2 year accidental warranty it came out to a total of $575.00. let me make this clear to you..i am a Techie, i love technology, and i like to be up-to-date with lots of things, Computers and laptops Being among them, let me put it to you like this. The best computers on the market Have \" intel core i7 processors\" those are quad-core computers and usually have at least 6 gigabytes of ram and 500 gigabytes of harddrive space. This computer, the HP Pavilion g6-2010nr Notebook PC can definitely compete with that. let me show you pros.PROS:1) intel i3 processor at 2.3 ghtz2)above average size screen, not big, but definitely not small a 15.6 inches.3) long battery life ive had it working on battery for over 5 1/2 hours.4) Altec Lansing Speakers for loud, and clear sound.5) 4 gigabytes of ram with just facebooking, school work or alot of other things 4 gigabytes is all you need. but you can also add 4 gigabytes of ram to this laptop. making it an 8 gigabyte monster. (which is what I am going to do soon)6) 640 gigabyte hard drive!!! way above average. alot of laptops still come with a 280 or 320 gigabyte hard drive. making this one amazing.7) Comes with windows 7. wich is very stable and well designed.8) HDMI port, to connect to a tv for slideshows movies and other awesome things.9) High Resolution Screen. running at 1366x768. its great for youtube, or movies.10) Great camera. comes with lots of cool built in features mom's will love to use. This laptop EVEN COMES WITH FLASH for pictures. not a whole lot of laptops come with flash, usually just $800 and up laptops.11) very light weight. less than 6 pounds.12) usb speed 3.0 the newest and fastest speed. making file transfers faster than before.13) Comes with 2 usb slots, a memory card slot a headphone slot9(3.5mm universal size in all laptops)14) DOESNT GET HOT!!! cool to the touch! even after 4 or 5 hours of use, due to new hp cooling technology, typing on you lap is now MORE COMFORTABLE!!!CONS:1)this laptop still comes with a DVD player i really dont care since i usually dont watch movies on my laptop, i mean come on, why do we have t.v.'s?Newer and more expensive computers usually haveintel i7 proccesors6 gigabytes of ram720 gigabytes of harddriveand bluray players. but if you want that, expect to pay well over $800Bottom Line: I highly recommend this laptop to anyone in need of one, but on a budget. HP is American and one of the highest rated laptop and desktop companies today. HP was so awesome that when i opened my box, i got a free 60 day anti-virus software FOR FREE!!!! HP has amazed me. hopefully it amazes you as well.P.S. What do you think i wrote this review with? ^_^", "Date": "August 25, 2012"}, {"Title": "99% I like, but that 1% is a glaring fault...", "Author": "Amazon Customer \"A novel a day\"", "ReviewID": "R3DIFP6NDRNEWC", "Overall": "3.0", "Content": "I will keep my review concise:Pros:-Price.  You cannot beat the price for such a large laptop with decent memory-General usability.  It's pretty much set up out of the boxCons:-The track pad.  I cannot stand the track pad.  It has an extremely steep learning curve, thus making me having to consciously think how to do something with it.  To scroll down a page you use two fingers and swipe them down or up.  Easy enough, right?  Well, no, it's not.  Sometimes the cursor doesn't move.  Most of the time, it does move, but so fast it is as if your grab the scroll bar on the right side of the page and move it up or down as fast as you can.  It is ridiculous.  Same for moving horizontally, though that isn't needed as often.I have a Macbook, as well.  And while it has its own faults, the track pad on it is golden.-Lots of bloatware on this machine.  I had to delete quite a bit.I'd be hard pressed to recommend this product.", "Date": "August 10, 2012"}, {"Title": "Piece of junk, terrible customer service", "Author": "Carter Adler \"cmadler\"", "ReviewID": "R14NWNNRUIPHD4", "Overall": "1.0", "Content": "This is a reasonably fully-featured laptop computer, mostly suitable as a desktop replacement, at a budget price. If having an optical (CD/DVD±RW) drive is a must for you, this is one of the least-expensive options. Speakers sound pretty good for the size, and WOW can they go loud!The biggest problem, as others have mentioned, is the track pad, which is difficult to use. Scrolling (vertical or horizontal) uses a two-finger swipe. Sometimes this doesn't work at all. Sometimes it goes very slow. Sometimes it goes very fast. Sometimes it mistakes a swipe for a pinch (adjusting the zoom). Single-finger scrolling on the edge (right edge for vertical, bottom edge for horizontal) worked much better. And frankly, the track pad pinch-to-zoom is just stupid. It's a laptop computer, not a phone; if I want to adjust zoom I can do that via menu. If you get this laptop, you'll probably want to use a mouse.I'm also fairly concerned about heat generated by the processor. Running even an older game (e.g. Sid Meiers Civilization IV: The Complete Edition [Download], which is 4+ years old) causes the fan to immediately kick on, and within 30 seconds it revs up to full-speed. It's a brand-new machine, so there should be no issue with any dust or other blockage, and this happens even with the computer sitting on a flat surface with the fan completely clear, in a 63-degree room. I don't know if this is an issue with the CPU, the GPU, the heat sink, or something else, but it's got me a bit concerned. However, this problem does not show up when playing music, watching video online (e.g., YouTube or Hulu), or doing other work, only when playing games.Update (12/26/12): Downgraded by 1 star for poor customer service. On 12/21/12, \"Scott B., Hewlett Packard Company, Executive Customer Relations\" left a comment on this review inviting me to email him \"...to discuss this issue...further\". The same day, I emailed him, as invited. Today, 12/26/12, I received a response, in the form of what appears to be a form letter email, saying: \"Thank you for your feedback. Hewlett-Packard always appreciates input from its customers. Your concerns and comments will assist us as we make future product decisions. We apologize for any problems or inconveniences this may have caused you. If you need technical assistance, please contact HP Technical Support at: 1-800-474-6836 (Please have your Product/Serial number when calling)\"Don't invite your customers to \"discuss\" their concerns with you and then throw a form letter back at them when they seek to take you up on the offer!UPDATE (10/30/13): After less than a year, the battery is faulty. After more than an hour working with a rep (the second person, since the first attempt on a previous day went nowhere), I was advised that he couldn't help me and I'd have to go to a different department. To send the computer in for a warranty repair, causing me to be without it for 2 weeks. Customer service is inept, inefficient, consistently gave wrong information, demonstrated a lack of knowledge/information about this device (despite me providing the product number and serial number multiple times), gave me troubleshooting processes that I obviously could not do (e.g. \"charge the battery fully before proceeding\"), and generally not helpful.I WILL NEVER BUY FROM HP AGAIN, AND WILL WARN EVERYONE I KNOW THAT THEY ARE MAKING GARBAGE DEVICES.", "Date": "December 19, 2012"}, {"Title": "buggy screen bad hard drive", "Author": "johnk", "ReviewID": "R1E82CY0SJYTGV", "Overall": "1.0", "Content": "Since buying this computer I've had to replace a hard drive after 6 months.  I've had a system crash and it was non recoverable and had to go back to hp-lost some info.  The screen has these weird dots in some programs that move with the windows.  sent it back to have it repaired, they said it was the keyboard and replaced it.  Got it back and same problem.", "Date": "April 25, 2013"}, {"Title": "Great little laptop!!!", "Author": "Quella \"Quella\"", "ReviewID": "R27BB9Q92JDVOI", "Overall": "5.0", "Content": "This is a nifty little laptop for home use.  It is exactly what I wanted.  My only complaint if I must find one is the power plug is on the right side of the machine.  I am right handed and use a mouse.  Had to find something wrong with it!  :)", "Date": "February 19, 2013"}, {"Title": "Good Laptop!", "Author": "Kevin R.", "ReviewID": "R28D7QWOMPWGRD", "Overall": "5.0", "Content": "I bought this right before starting college in September of 2012. I have had it for four months or so and have not had any problems with it whatsoever. I would definitely recommend this product to people.", "Date": "February 4, 2013"}, {"Title": "Work well except...", "Author": "NSquare", "ReviewID": "R3AP25Y5XDKVA3", "Overall": "4.0", "Content": "Works well except the battery contacts seem to not make proper connection at times. Had to reseat the battery many times in order for it to charge.", "Date": "December 24, 2012"}, {"Title": "Nice unit", "Author": "flocrest", "ReviewID": "R1UDBFXQ0VOTFW", "Overall": "5.0", "Content": "Bought for my wife's business laptop. Swapped out the drive for an HDD and she loves it. Nice sound and no issues with the computer.", "Date": "December 16, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core_i3_2350M Processor 2.3GHz (3MB Cache)\n4 GB Memory\n640GB 5400rpm Hard Drive\n15.6-Inch Screen, Intel HD Graphics 3000\nWindows 7 Home Premium 64-bit", "Name": "HP Pavilion g6-2010nr 15.6-Inch Laptop (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41kREcPJM%2BL._SX300_.jpg", "ProductID": "B0085RUZE6"}}