{"Reviews": [{"Title": "Great Computer", "Author": "Sarah2ya", "ReviewID": "RXFI2UAIZBCDZ", "Overall": "5.0", "Content": "Computer is very-light and the perfect size at 14\". The back-lite keyboard is a nice feature, but it does not seem to distract or enhance much. I thought perhaps if you got the white version that might be problem, but I got black, so it's just a really cool cosmetic feature. Bootup time is really fast and impressive. Computer does not make any weird \"processing\" sounds. The speakers are on top (not the bottom), so there is no distortion of sound. The usb drives are all up front, so it would be nicer to have those in the back. It would also be nice to have a 10-key pad, but you really have to go up to a 15.6\" for those, and those really are too big for me. Wish it had a micro sd slot instead of a pro duo slot, but it is a Sony. Processor and graphics are pretty good but not great. But not at all bad, and I upgraded from netbook, so I am really noticing and benefiting from the speed difference. Overall, I would recommend this computer. I think between a PC, 15.6\", 13\", and those netbooks, this size really gives you the best of everything that you are looking for including: a DVD drive, 6GB RAM (that's a lot), and a hard drive with well over 500 GB of storage (640GB to be exact), good graphics, i3 processor (of course i5 and i7 are better - but most people wouldn't even need that and many computers out of box come with much worse), without being too big or heavy. This is a really great value and design. Buy it with your Amazon credit card like I did and you save 3% on top of that!! Highly recommend this.", "Date": "August 21, 2012"}, {"Title": "Pretty in Pink Performance", "Author": "okeydokey3262", "ReviewID": "RN42EB7Y0PDQM", "Overall": "4.0", "Content": "The Sony VAIO E Series SVE14112FXP is a pleasure to use! The laptop itself is an eye-catcher because of its bright, pink case and illuminated, soft-to-the-touch keys. Beyond that, it's a real workhorse.This laptop performs all the tasks I desire and allows me to run multiple applications at once. I have had no problems using my VAIO to write papers, explore the web, stream movies and music, download songs to my iPod, play DVDs, read e-books, connect to my wireless printer and run educational software. The web cam and microphone are also adequate and easy to use. I'm not an avid gamer or video editor and can't comment on how it would handle those projects.However, I would like to comment on two features that attracted me to the VAIO:The Backlit Keyboard - I love having a laptop that I can use with the lights off. My only gripe is that the only way you can turn it off is by changing the settings in the VAIO Control Panel (under \"Keyboard and Mouse\"). There should be a keystroke (ideally a switch or button) to turn the back lighting off when it's not needed.VAIO Gesture Control -  Waving your hands around to skip back and forth through songs and control volume is a bit silly, but I want to do it! This feature is disabled by default when you receive your laptop and can be turned on through Sony's Media Gallery or VAIO Gesture Control. According to the settings, you can use it when running Media Gallery, Windows Media Player, Power DVD and Internet Explorer. I find the camera to be very fussy about your distance from the computer and it doesn't pick up your gestures in poor or dark lighting. I'm not sure how much more time I'll devote to trying to master gesturing because it's faster to use the clickable touch pad.I almost didn't purchase this laptop because I was concerned about negative reviews about the clickable touch pad on previous VAIO models. I've never used a touchpad like this before and it took me a short time to get acquainted with it. I recommend practicing and watching the tutorial video (also in the VAIO Control Center under \"Keyboard and Mouse\") to novices like me. Scrolling and enlarging images with two fingers is my favorite part.Overall, I'm very satisfied with my purchase and would recommend a Sony VAIO E Series SVE14112FXP to my friends or people who perform similar tasks. I haven't had a computer that I could get THIS excited about in years!", "Date": "August 9, 2012"}, {"Title": "Not as great as I thought", "Author": "Truth Seeker \"Seek\"", "ReviewID": "RJD4Y8BQGHZ7Q", "Overall": "2.0", "Content": "It truly pains me to write this review.  I researched laptops more than I should have, spending a lot of time trying to figure out just the perfect one for me.  I decided to spend a little more than my $400 budget, and went with the $550 Sony.  All my laptops have been in that $400 to $500 range, so this was a bit higher than normal for my wife and I.I received it quickly, and really liked the looks of it (I did check out a similar model at BB).  We opened it and noticed the keyboard was not properly snapped into place, so I just pressed on the outer perimeter and snapped in all the edges.  Typing on the keyboard felt nice.  I liked the backlight too!The touchpad was not great.  I am accustomed to just lightly tapping my finger on the pad to click, and with the settings adjusted to be very sensitive, the touchpad would still require a few tries before it accepted my \"tap input\".The left and right buttons are on the corners of the seemingly continuous touchpad.  They are very flimsy and feel awkward to use.Multitouch input is a FAR cry from any smart phone I've used.  It usually took a few tries to get it to function the way I needed it to.  I mean, come on Sony... this is 2012.  Is this technology stuff that tough?  Sony has always been a great brand, but the touchpad is as if its never been invented before and I'm getting a beta version of it on my laptop.  $300 laptops have a better feel in the touchpad than this one.The speakers were VERY tinny and pretty quiet.  I guess I'm spoiled from the speakers on my 17\" Acer laptop that had some kind of built in subwoofer.  I thought those were mediocre, but now I can appreciate them more.  This Sony has lousy speakers.  Don't let the fancy trademark fool you.FINALLY... the MAIN reason I returned this product.  The screen.  How is it that a laptop that is 4 years NEWER than my best one in our home has a screen not as bright, not as crisp, and lacks in deep blacks in comparison to the older ones?  Shouldn't there have been improvements over the past 4 years?  Keep in mind, we never have spent this much on a laptop.Also, the screen had a blue tint that was impossible to adjust.  We had to put the screen at its brightest, and it still wasn't as bright as any other computer in the house.  It appears Sony has put cheap technology in this thing all over.In conclusion, technology should ONLY improve over time, but this laptop was a step back to 2004 technology in some ways (obviously not the processor speed).  I have to send this back because the the poor touchpad, the screen quality, and the processor created as much heat as my old Acer (one reason I really wanted a new computer... a burnt lap gets annoying).  My wife also mentioned her opinion of it right out of the box was that it had a cheap feel.  I don't know about that, but that was her input.I'm regretfully sending this back.  I REALLY wanted that Vegas movie editing software it came with too.", "Date": "September 8, 2012"}, {"Title": "So far, so good.", "Author": "Megan", "ReviewID": "R22XYSR8Z9ABCP", "Overall": "4.0", "Content": "I received this laptop a couple days later than was posted. But so far I'm pretty happy with it. Very good webcam, the keys light up when you type which is very helpful. I had never owned a 14 in before and thought that it would be too small but it's just right. It doesn't have a number pad to the right, so that's taking some getting used to. But it's very light weight and hasn't overheated. The only issue that I have with it, is that you have to push the keypad a little harder than on other laptops to get it to click. It's only been a few days, but so far I am satisfied with it. Will update in a few months if things change.", "Date": "August 7, 2012"}, {"Title": "Stylish, fast enough!!", "Author": "Francisco Ortiz", "ReviewID": "R28DUPTB8T0KPW", "Overall": "4.0", "Content": "Granted you could probably get a better deal out there for another laptop form another brand with better specs. Trust me ive seen plenty. Yet None of those in this price range compare to the styling on this one. the wife loves the VAIO line, she comes form a VAio N which has served her well for the past 3 1/2 years. It took various drops and even one lcd change, but never failed her. So obviously she wanted another Vaio. This computer is a perfect size, 14\" is a sweet spot for laptop screens. She is a fan of 15 inchers yet due to her carrying it around on our family trips and sometimes to work i wanted something lighter. This laptop is light enough to carry all day, and battery life is good, not great, but very good. We get around 5 to 5 and a half hours on it, surfing and watching youtube videos. Trackpad is good, not like my MBP, but very good for a pc. i3 processor is fast enough for daily use. I doubt most people need more. 6gb ram is great no need to upgrade for a long time. Keyboard is good and backlight is a plus. So far we are very pleased and like i said you might get a better deal specwise, but build quality at this price range you can't really beat and styling is an added extra. One thing you should know there is a bit of flex on the trackpad area but nothing we cant live with. Same trackpad on my work Vaio S13P does not have this but then again that laptop costs almost 3 times as much.", "Date": "August 29, 2012"}, {"Title": "Best Laptop Ever", "Author": "Hillel K", "ReviewID": "R2GO4W9OLRYK9I", "Overall": "5.0", "Content": "I bought this laptop and it came with in 2 days. It was very easy to setup. Internet is fast plus the downloading. It also comes with audio, music,movie, and architect studios. The keyboard makes it very easy to type. Unlike my acer the keyboard is not half broken. The screen is not too big and not too small.The battery life is very strong 8 and a half hours! Again Unlike My acer which is 2 or 3 hours.So..... Great Laptop I recommend it to kids, teens, adults,the elderly, and everyone!!!!!!!", "Date": "August 31, 2012"}, {"Title": "Excellent", "Author": "Daniele (VE)", "ReviewID": "RB0I1W5640LOL", "Overall": "4.0", "Content": "Excellent product, very happy with this laptop. Just what my daughter need for the college, light and nice, the only issue is that the keyboard illuminate all the time and some times is difficult to distinguish the letters on the keys.", "Date": "August 1, 2012"}, {"Title": "Much problem due to heating", "Author": "Sanjib", "ReviewID": "R1C1LPAPSMBCFF", "Overall": "2.0", "Content": "It hasn't been even a month and I have been facing problem with my laptop. It gets heated so quickly. I even changed this one but also the problem is same. And I also don't like mouse pad of this laptop.", "Date": "October 19, 2012"}, {"Title": "Great Product!  Wife Loves it!", "Author": "DT15", "ReviewID": "R1O0Y3QL16IQPI", "Overall": "5.0", "Content": "Bought this laptop for my wife to use as she goes back to school.  She loves the design and color and how light it is.  Laptop does everything well.  Not sure how it would operate for someone in a more demanding field, but for her to do her college papers, pictures, video chat, internet browsing, etc... It's a good product with no flaws so far.", "Date": "October 8, 2012"}, {"Title": "Can't get better hardware for this price", "Author": "12345", "ReviewID": "RG48VMVW8TRAT", "Overall": "5.0", "Content": "For this price, this is a steal:1. Intel i3 processor, which does not tend to overheat unlike AMD2. Backlit keyboard looks very nice3. 6 GB ram4. 1.3 megapixel webcam5. Good battery life6. BluetoothBut of course, everything has its cons:1. Mousepad can get annoying. Need to get used to it. I just bought a separate mouse.2. Some say it looks like it's made of cheap plastic. I don't really mind, I actually think this material makes the computer weigh less.3. Speakers are small.I actually did a considerable amount of research and ended up buying this one. Similar laptops with these specs tend to cost more.", "Date": "September 24, 2012"}, {"Title": "Don't buy a Sony", "Author": "ReviewPal", "ReviewID": "RWI8MUXCGCDG6", "Overall": "1.0", "Content": "I'm a TV Director and spend a lot of time on my computer, and we use a lot of computers for various things.  Of course we use Macs a lot, but also need to stay connected to the PC world, especially when dealing with clients and web video.  Over the years we've had a few Sony Vaios, and I had a Sony laptop for my main computer that I bought back in 2003.  So I know a few things about computers.  But it's become clear to me that sadly Sony has lost the ability to engineer quality and reliability into their computer products.  I bought a sony vaio about 9 months ago, paid more than a Mac Powerbook Pro to get exactly the features I needed.  Since then I've had nothing but problems: the HDMI output stopped working, Sony display drivers are out of date and limit HDCP functions and therefore don't allow basic functionality that I get with a $400 Acer, and the Sony software that they put into every machine is a joke.  For example, the battery and power charging application stopped charging my battery (just when I needed it most), so I had to wait until I could get home to waste an hour or two of my time to discover that the Sony \"Vaio Care\" software had changed my power settings to \"maintain battery health\". BTW I've tried running it without the Vaio Care and had more problems, since they seem to embed it so deeply into the functionality of the machine.  And their support is in India... and they always end up telling me to use my repair disk to restore to factory settings, which I could have figured out myself if I wanted to waste a day backing up and reinstalling all the software.On the other hand, in the past year or so we've been buying Toshibas, and have had really good luck with them.  Solid, tough, and a much better bang for the buck.  Of course, we still have to delete some of the proprietary software too, but it's pretty minor.  Acers are actually quite good too.  HP was OK too, but I'm concerned about their future in the business.I used to be a staunch Sony fan, and I love some of their cameras.  But I'll never get another sony computer.", "Date": "January 11, 2013"}, {"Title": "Sony VAIO or nothing!", "Author": "Dan Desmarais", "ReviewID": "R2BS6BW2RSUL50", "Overall": "5.0", "Content": "I am the proud owner of several Sony VAIOs - and yes - I named them... and think of them as family. So there!", "Date": "April 30, 2014"}, {"Title": "It's pink, and that's it's only positive trait...", "Author": "Zawn Villines", "ReviewID": "R3O7200Z6ZIYGZ", "Overall": "1.0", "Content": "Ultimately, I bought this computer because it's pink, and I suppose the punishment it has rained down on me is fair penalty for someone who buys a laptop based on its color. But still. This computer is remarkably awful.The touchpad is horrible. It's nearly impossible to right-click, and the pad's sensitivity is poorly calibrated. It's challenging to even click on a link without the pad moving, and the button itself is clunky and requires quite a bit of force to manipulate. Consequently, I am completely unable to use this computer without a wireless mouse. The few times I've left the mouse at home have been disastrous.It comes with Windows 8, which is a definite downside. I planned to uninstall and replace with Windows 7, but the process was nearly impossible. Ultimately ended up with Linux. And of course, installing Linux (the only way to make the Windows 8 monstrosity marginally usable) voids the warranty. So I was pretty angry when the hard drive crashed at 3 months.I replaced the hard drive, and the computer is still marginally usable, but with a veritable cornucopia of problems. Notably, the hardware is awful. The keyboard was giving out after a few months, and the frame is cracking/peeling/breaking after a year.The worst laptop I've ever owned. And I've owned some pretty bad laptops.", "Date": "January 18, 2014"}, {"Title": "Get a longer warrenty and make sure it covers the battery. Sony charges for phone assistance.", "Author": "Daniel", "ReviewID": "R3N7L2CSZOH5AS", "Overall": "1.0", "Content": "I will start with the good. I got this for college almost 2 years ago and it started out great. For the price, I thought the specs were amazing. The battery life was really great too. My first problem was that the built in camera stopped working almost immediately. This didn't bother me much so I let it slide. Now for the bad. My warranty is now up and my computer is no longer recognizing the battery. My battery was able to hold a 5 hour charge easily just a few days ago. SONY will actually charge you to talk on the phone with them to fix a problem with their own product. Let my clarify, SONY WILL CHARGE YOU AROUND 50 BUCKS TO ASSIST YOU WITH PROBLEMS WITH THEIR PRODUCTS OVER THE PHONE. This doesn't include the amount you will have to spend when they say you need to send it in to them to have it fixed. I have done some research and their isn't any simple solution except to get a new battery which is not cheap. And to be honest, a new battery may not even solve this problem. If you can get a long warranty, get it and make sure that it covers the battery. I don't like to make fusses and would much rather be relaxing right now instead of writing this review but I really don't want someone else to go through this mess. If something changes and their is a magic fix for the problem I will change my review but till then, avoid Sony laptops.", "Date": "November 20, 2013"}, {"Title": "moogman04", "Author": "L. Lee Boswell \"LovinMom\"", "ReviewID": "R1F71IN9VI8BG3", "Overall": "1.0", "Content": "Computer works great... except the Blu-Ray player. I ordered a Blu-Ray, I paid for a Blu-Ray... but when I try to play a Blu-Ray disc it doesn't work. BE FORE-WARNED... all Sony support is in the Philippines. The people at their call center read from a script and cannot resolve issues. Their answer is to try to SEL me COREL software to make my Blu-Ray player work.  Please note that in the U.S. this is called \"Bait & Switch\" and is illegal. By the way, I already had purchased the software when I bought the computer (but they didn't install it) so it's bait and switch times 2. I can't even get them to send me a return label so I can send it back to them and be done with SONY forever.  I had previously thought that Dell had the worst customer service and business practices in the world... Sony is ten times worse.  If you're thinking about a VAIO go forth with the knowledge that if it doesn't work you're out of luck. The warranty is worthless as there is no way to enforce it. Shame on Sony.", "Date": "August 20, 2013"}, {"Title": "I love Sony", "Author": "shelley wilson", "ReviewID": "RGQZRJ8M4SVN3", "Overall": "5.0", "Content": "I this dropped this laptop on concrete and still working !I play a mmo game every day and its still workingnuff said", "Date": "July 18, 2013"}, {"Title": "Love my laptop.", "Author": "S. Silva", "ReviewID": "R2MN4RUTJ4YE0P", "Overall": "5.0", "Content": "Great laptop.  Quick.  Backlit keyboard. Not to heavy. Clear screen. Battery lasts for quite a while. Have not had any issues to date.", "Date": "July 15, 2013"}, {"Title": "Waited a year to write this!", "Author": "Sara Dubay \"Yertle\"", "ReviewID": "R3M2LBWZAUX293", "Overall": "5.0", "Content": "Bought this last August(caught the FANTASTIC back to school sale Amazon had!).My ONLY complaint is the touchpad. I get a little confused with not having the designated buttons, even now. But for the price I paid I can get over it!I use this daily for hours for work. Does not freeze. I've had issues with programs, but it wasn't any fault of THIS product, just the 3rd party software companies not making sufficient patches/updates/bridges for 7.As for poor battery life, NO! I use this for over 4 hours every time. I've noticed no decline.I highly recommend this laptop (and have!)", "Date": "July 5, 2013"}, {"Title": "Excellent.", "Author": "R. Claytor", "ReviewID": "R4LS0ZKF1B6WF", "Overall": "4.0", "Content": "Not the highest end but certainly well worth the price and then some.  While the graphics aren't up to high end gaming I never have heating issues and have had no difficulty with the applications I use.  Definitely a lot of bang for the buck.", "Date": "June 29, 2013"}, {"Title": "So Far So Good", "Author": "K. Kindle \"Katie\"", "ReviewID": "R3S82HCB4QXJ9U", "Overall": "4.0", "Content": "This laptop has worked perfectly for my needs. It is not to big but not to small and very lightweight imo. It also will play most games that I like for instance: KOTOR, SWTOR Dragon Age I, Mass Effect 1, and a few older games (note I am not a \"new gamer\" I doubt the machine would be able to handle brand new games) The sound is very good, wireless is stead, screen is bright, it stays cool and quiet and I absolutely love the backlight. The only downside is the batty doesn't last very long imo.Long story short, a great laptop for business or pleasure unless you need something with all the bells and whistles this is a great bargain.", "Date": "February 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0080EBMFU"}}