{"Reviews": [{"Title": "Solid, basic media laptop hobbled by touchy touchpad", "Author": "D. Chien", "ReviewID": "R14ZQL5QM1D0I3", "Overall": "4.0", "Content": "+ A generally well-built laptop made from the usual components (eg. LiteOn DVD Drive, Intel CPU, Hitachi HD).+ The form-factor is nice - no significant hard points under the unit when placed on the lap, smooth, rounded corners and general shape holds well in the hand and carry case.+ 8GB is sufficient for Win7/8 and running a VMWare Player emulator running Win7/8 with VS2012 for W8/WP8 development simultaneously.  750GB HD is also sufficient for installing mutliple OSs and VMs.+ Fast access to sound volume using touch panel buttons. But none for screen brightness.+ LCD Screen panel does flip open to about 140 degrees or so. About 5-10 degrees more than typical screens, so you get just a little bit more open angle on the lap.+ A 'decent, quiet fan' when the CPU is taxed at 100% for hours. Definitely far quieter than a MacBook Pro 2006 fan, which sounds like a jet plane. You can run this at night or at school and not bother too many nearby. (The noisy keyboard model that ship with some Z580s will however, so pickup a Z580 with a quieter keyboard.)  Muted and non-annoying in general. Air coming out is never HOT, just warm. Bottom and top of laptop never gets hot either, so very good cooling design. (Unlike Macbook Pro 2006 where you can toast yourself with the CPU running at 100%.)+ Nice, free technical repair manual on Lenovo's website. You can easily find out how to swap out the DVD, RAM, HDD, keyboard, and even CPU for better, faster ones. Nice to know that when i7 quad-core CPUs drop in price, can swap out the i5 for an i7 later on.+ Decent number of USB ports. Wish all were USB 3.0 but two 3.0 and two 2.0 are sufficient. Decent placement of ports as well.+ Easy one-panel bottom access to remove RAM, HDD, DVD, keyboard, etc. for upgrades and swaps.+ Slim, light AC adapter.+ Battery runs about 3-5 hours, depending on use.Naturally, bechmarks online in various reviews provide additional detail.+ i5 is decently fast for almost all uses in Win7/8. Snappy and quick response launching apps, compiling, etc. QuickSync feature is nice - can convert 2hr movie down to H.264 MP4 in about 10-15 minutes using MediaEspresso, etc. QuickSync enabled apps.  No problem running two H.264 QuickSync or a single Handbreak encode while surfing and watching HDTV using a Hauppauge WinTV. Doesn't feel sluggish at all doing all that.+ HDD isn't a 7200rpm model, but silent all the time. You can upgrade to SSD anytime for faster performance, but works fine for daily use at the price point.- Glossy screen. Doesn't have a superior anti-glare coating like the $2k Sony laptops, and is typical of what you can find in most $300-$600 laptops nowadays. You can apply a Photodon matte screen protector on top to significantly reduce the glare, recommended....but, the bezel is glossy and you'll get annoying reflections off the bezel even with the matte screen protector applied! Silly Lenovo designers.  Contrast is a bit limited, along with color gamut and viewing angles - the usual notebook reviews online provide detailed specs to examine. Typical of the the $300-600 range TN TFT panel quality - nothing spectacular, nothing amazing. Just average.- Some units come with a noisier, harder to type keyboard instead of the softer, quieter keyboard. You should check, if possible, prior to buying, but it's nearly impossible without opening the box. Almost all the latest do come with the softer, quieter keyboards, but you'll be annoyed by the click-clack of the noisier, older keyboard.- The speakers suck. Sound like tin cans. With the Dolby software turned on, it's acceptable - sound quality improves to the point where you can watch TV (using a Happauge WinTV USB Adapter) and listen to the sound without too much annoyance, but external speakers/better speakers on another laptop prefered if you're after great sounding laptop speakers. With the Dolby turned on, the sound level can get quite loud and you can fill a living room easily.- The One-Touch theater buttons really don't do much except crush blacks and increase contrast while turning the Dolby sound software to movie mode. Not very useful at all - wish they'd simply replace that touch button with brightness buttons instead for fast access.- The screen coloration is a touch too blue (cold color temperature) by default. You can adjust this by using a hardware color calibrator (eg. Spyder4) or eyeballing it using the Photodisc SRGB color test target + Windows Color Calibration. Once that's done, you can adjust the Intel Display Settings to adjust the Saturation up by a few points since the panel is merely a TN TFT panel. Here, after the grays were neutralized win Windows COlor Calibration, the Saturation was increased by +5 in the Intel panel.  Even after this, don't expect miracles from these kinds of laptop TN TFT panels. You should look into the higher end IPS TFT panels on the Y580 and other laptops if you need better color rendition and gamut.- Software updates are not fast. Intel already has graphic drives verions ahead, but Lenovo only has those from 2012 still.- SIGNIFICANT touchpad issues. TEST BEFORE YOU BUY!!  The touchpad has sensitivity issues. If you have Palm Check and Touch Sensitivity at the minimum, you'll get a very responsive touchpad, but many, many mistaken touches while typing. If you turn them up to minimize such, you will ALWAYS experience a <1 second delay between typing and moving the mouse or vice versa. This is NOT something you can get around!  This is not encountered on any other laptop I've used before, so it's a bit annoying. Move the mouse, wait a fraction of a second, type.  Many on Lenovo's forums have noted this issues and it's simply the Synaptics Clickpad used that's at fault.  Once you get over the delay, it's mostly decent once you've adjusted the sliders, but you don't feel as sure in your mousing as with other touchpads, and mistaken touches still register now and then as you type. Think of it as if you were using a 1st generation, ball mouse vs. the latest laser mice.Becuase of these negatives - sound, touchpad - 8.5 rating on an otherwise, very nice laptop.", "Date": "March 15, 2013"}, {"Title": "Laptop Hobbled by Hard Drive", "Author": "Joe Blazy", "ReviewID": "R31X5W37KPPBSB", "Overall": "3.0", "Content": "Purchased the Lenovo Ideapad Z580-2151-28U for MS Office and Web Browsing use.  I expected it to really perform well with the i5-2.5GHz CPU.  However it was sluggish at best.My specific install included Software Firewall, AV software, MS Office.  Running wireless on a G-network. (Network NOT an issue... continue reading.)  As received BIOS and drivers.You would click IE icon in quick launch toolbar an wait a second or two for IE's window to appear.  Similarly for Outlook.  Very disappointing performance considering the CPU and memory.I got a great deal on a Seagate Momentus 500GB Hybrid drive, so I replaced the 5400rpm drive in the laptop with the 7200rpm 4GB SSD Momentus.Results were dramatic.  Icon-click-time-to-window-appearance was fast, even the 1st time (not cached in 4GB SSD).  Once cached on SSD it was almost instantaneous.  Boot time dramatically faster as well.  Note: This also means my wireless network was NOT an issue, since the faster HD solved the problem.So either the as-received HD was malfunctioning, or Lenovo hobbled this laptop's performance by putting in \"meh\" HD.Also demonstrates the \"links in a chain\" nature of computer performance.  All the components work in concert and should be performance-matched.  The weakest link in the chain determines the performance you see for a given application.", "Date": "November 29, 2012"}, {"Title": "Quality Product", "Author": "A. R. Keith", "ReviewID": "R3VD8FI0JF7MJ8", "Overall": "5.0", "Content": "I was looking for a replacement for my desktop system & found the Lenovo, I purchased was a good fit & had all the necessary included items that I needed. It, along with a couple of added software products completed a very functional & well running machine, so far, this past month.", "Date": "October 11, 2012"}, {"Title": "Junk screens", "Author": "ted_d_bear", "ReviewID": "R2TE1X8AI25VXR", "Overall": "1.0", "Content": "LED screen tapped out within warranty period.  They replaced it and 4 months later, it went bad again.  This is in addition to the fact that two other Lenovo laptops that I purchased also had LCD problems.  I will never buy Lenovo again.", "Date": "April 13, 2014"}, {"Title": "i like", "Author": "Ángelline", "ReviewID": "R1RE2XWB3J9FEB", "Overall": "4.0", "Content": "this good computer I like get this I can do my work no pro blemsthanks so much yeaah! :D", "Date": "February 28, 2014"}, {"Title": "Something with the Wireless Network Connection", "Author": "Dylan", "ReviewID": "R3OI6BUJSM728R", "Overall": "2.0", "Content": "I got my Lenovo Z580 in early 2011 and it works amazingly, I really do love it. The processor is just about perfect, as with the RAM, amount of ports, the screen, etc.... My only problem with this computer is the fact that after about 8 months of usage the connection to my wireless network stopped functioning properly. All I can do with the internet is instant message and access google hosted sites, and very slowly at that. I've asked my few friends with Lenovo products about this and they all seem to have the same problem. I've directly connected it to my Wired internet connection and the internet seems to work pretty well. I've had it like this for over a year and, as you would expect, it's very awkward. I wouldn't recommend this product to anyone who really cares about they're wireless internet connection, and at that point I would just get a desktop computer.", "Date": "November 25, 2013"}, {"Title": "Wrong Laptop Sent... However", "Author": "C. Taylor", "ReviewID": "R35YSRCJPRIZY8", "Overall": "4.0", "Content": "I cannot comment fully on the IdeaPad Z580 product itself because the seller, Blizzard LCC, sent me the wrong laptop I needed for work. I received the Lenovo G580 15.6-Inch Laptop (Dark Brown IMR/Metal) instead. Even though I received the wrong laptop, the construction will be the same so I commented on it as far as it pertains to what I experienced.NEGATIVES:- I didn't like, which other Lenovos will most likely share, was that the caplock light is positioned on the front edge of the machine as opposed to the caplock key.- I use a wireless mouse instead of the pad. The machine has to be fully alive before using the mouse plus the USB antenna plug has to be pulled out then put back in for the mouse to work. I'm unsure if other devices would do the same.PLUSES:+ The construction seems to be very good... solid.+ The display is really nice and clear, no problems.+ The keys are tight and positioned well, no wiggly movement.+ DVD drive is very good.+ Preloaded Power2Go (DVD) and Nitro Pro 8 (PDF) software which I really like.BOTTOM LINE:A good laptop and I was unable to obtain this Lenovo 8Gb RAM, Intel model. However, gauging 4Gb Lenovo did give me an idea of how the 8Gb would perform and I've had and bought other laptops. Buying the 8Gb model... you'll do well. I see no reason that you should not purchase it. Meanwhile, I bought the ASUS K55A K55A-DS71 15.6-Inch Laptop (Mocha) because there were no more Lenovo 8Gb laptops available. I'll comment on the ASUS when I get it... stay tuned.OTHER:The 4Gb laptop (received by error) began bogging down some with a browser, email client, PaintShop Pro X5 and an Adobe Photoshop programs (both high memory demand graphics programs), up and in use. Then again this WAS NOT A 8Gb machine and processor, it was 4Gb and slower. If you use graphics creation and manipulation, get 8Gb of RAM.Use the other purchasers reviews with this since mine is not in full. I've purchased computers about every 2 years since 1992 so I've been at this a while.Amazon live chat helped a great deal (thanks Jeremy H.) and the return paperwork is on the way.", "Date": "June 21, 2013"}, {"Title": "Excellent Laptop", "Author": "Ravi", "ReviewID": "R2EZW0FRR8QT8I", "Overall": "5.0", "Content": "I bought this for school work as well as watching movies and playing some games. It meet all my expectations, i love the two USB 3.0 ports, the laptop has a good rugged feel to it but yet still light enough for me to carry around. The sound quality combined with the Dolby Digital makes watching movies a wonderful experience. I specifically and pleased with the software that came bundled with it, in particular the one that checks for all system updates. Multitasking is handled really well and lots of hard disk space to store music, movies and pictures and when that is full you have the Lenovo Cloud!", "Date": "March 20, 2013"}, {"Title": "It was fast and easy", "Author": "Mary Kay Lux", "ReviewID": "R255T1Y6SVGKPM", "Overall": "4.0", "Content": "I have enjoyed my laptop I ordered from you. It was quite quick and arrived in good condition. I was replacing my work laptop that had crashed and originally I purchased a Ipad that I thought would do the job. I found out was not compatable with my work program. Then I purchased a HP Windows 8 locally and found that again, it was not compatable with my work program. Now 3 months had past and there were no local Windows7 avaiable. I found several to choose from on your web sight and narrowed it down to this choice. I am very happy with it. If I was to complain about anything, it seems like the touch pad is a bit slow when I first open it up so when I sign in and usually misses the first  couple letters I typed in. I am new to ordering anything on the internet. You made it pretty user friendly!Thanks.", "Date": "January 15, 2013"}, {"Title": "very good", "Author": "Zheng Liu", "ReviewID": "R16PCEDW4D9OKS", "Overall": "5.0", "Content": "I like it .But when I got it ,it is very difficult to seprate the space out of disk C. You must delete a original disk first.", "Date": "November 26, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Generation Intel® CoreTM i5-3210M 2.5GHz 3MB L3 Cache Processor; Enjoy an automatic burst of speed when you need it with Intel® Turbo Boost Technology 2.0\n8GB DDR3 Installed Memory\n750GB 5400RPM SATA Hard Drive\n2 x USB 3.0, 2 x USB 2.0, 1 x VGA, 1 x HDMI, 1 x RJ-45, 1 x Headphone, 1 x Microphone\nWindows 7 Home Premium", "Name": "Lenovo IdeaPad Z580 215128U Laptop with 15.6\" HD LED-Backlit Screen & Intel Core i5-3210M Processor & 8GB RAM & 750GB Hard Drive (Grey)", "ImgURL": "http://ecx.images-amazon.com/images/I/41a8U-6TADL._SX300_.jpg", "ProductID": "B008RH54GI"}}