{"Reviews": [{"Title": "Really Good.", "Author": "Ben Stewart", "ReviewID": "R1B86ZJXAVL43Y", "Overall": "5.0", "Content": "Ok, so heres the deal. This is an incredible machine as far as performance and things go. Win8 is not bad, just still has some bugs that need to be worked out. THis sucker can handle Battelfield3 on ultra graphics with only a slightly slower framerate. The only problem is the networking capabilities are not the best, however, that is possibly a problem with the wifi on campus and sometimes the keys get stuck, but tap them a couple times and they come right up. Good machine for the money.", "Date": "September 8, 2013"}, {"Title": "Great Desktop Replacement Laptop", "Author": "Carina Monnett", "ReviewID": "R22NY1GL0100RD", "Overall": "4.0", "Content": "I love everything about the Laptop, except that comes with Windows 8 its just not cool. other than that I'll rate this to ***** 5 stars.", "Date": "August 15, 2013"}, {"Title": "Love this laptop!!!", "Author": "Chris T.", "ReviewID": "R1W3JN5C0SFEXV", "Overall": "5.0", "Content": "It's a great laptop with awesome all around performance.Pro:-Great Performance-i7 3rd gen processing-Blu-Ray/Dvd bay-Dual cooling system (looks pretty sweet in the back)-Good sound system-Key bumps at W,F,J, and 5 on the keypad-Pretty good boot speeds even w/o an SSD-Games really well-Lots of shortcut function mapped keys-Fans run really quiet-1 year of free Accidental protection once you register (fine prints says it doesn't cover \"acts of god\" though. lol.)-Republic of Gamers branding is pretty sweet and they include a few stickers, lcd cloth, and velcro-strap in the packaging.Cons:-HD but not Full HD screen rez (1600x900 i think so main screen won't blow you away with amazing pic details, but still good)-Touch pad isn't in a great place. I frequently trigger they touchpad shortcuts w/ my palms.-Subwoofer on bottom overpowers main speakers and this kinda muffles the sound since it's on bottom. (best w/ headphones)-Not a touchscreen, which kinda makes win 8 harder to navigate (touchpad is heavily required.)-All of the rubber surfaces gather fingerprints/grease/dirty stuff fairly easily. (cleaned of pretty easily w/ a microfiber cloth like the one included.)For Gamers: Touchpad often won't respond while you are using both keyboard and it. I recommend you buy an external mouse if you plan on gaming with it. (Asus is quick to remind you that they have Republic of Gamers headsets, ASUS  Republic of Gamers Shuttle Backpack for Laptop and ASUS  Republic of Gamers GX1000 Eagle Eye Laser Mouse for sale.)Not A+++, but definitely a fine laptop over all. Love it! The RoG says they based the designing of the case off of a fighter jet.(Notice: After writing this review I discovered that there was indeed a piece of protective plastic recessed over the top of the trackpad. I left it there since it seems to not affect the performance of it too much, and I doubt removing it would resolve some of the sensitivity issues. If anything leaving this piece there might help the trackpad from gathering as much fingerprints and grease as the rest of the case seems to do.)", "Date": "October 13, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009POU36S"}}