{"Reviews": [{"Title": "Cool specs, but WAAAYYY too overpriced", "Author": "xSL", "ReviewID": "R28ZWFLZDVTRDX", "Overall": "3.0", "Content": "this looks like a good product, but as i take a look at the specs i see that for the price it is, youre not getting what youre paying foryou could find a laptop better than this one for more than half the price", "Date": "May 10, 2013"}, {"Title": "The price...", "Author": "Albert Li", "ReviewID": "R317XOCIQM4SDF", "Overall": "1.0", "Content": "You're paying for the brand name if you get this laptop. Take a look at this laptop for around 600-700 bucks only.HP Pavilion dv7 6c95dx Intel CoreThis laptop is the one I have. Now look at the specs. You get longer battery life, a second generation core i7 performing just as good as this laptop, ram just as good as this laptop, an optical drive,and tons of ports and functionality for what.. 700 bucks! There's only a good graphics card in this Razer laptop, but Razer is telling you that a GTX 660M is worth $1800. No way! By the way, this laptop is just as heavy as the laptop I'm using right now. It is NOT light. One more thing, if you think thickness is very important, let me try to convince you otherwise. This laptop I'm using is maybe .25 of an inch thick, but what's wrong with that? You can't fit a whole textbook in .25 in. You can probably fit a very slim folder, but that's it. Look at the weight; it's still going to be bulky.If you want a good gaming laptop, look for Alienware. The 14 inch performs just as good. Everything is the same, except for its thickness. As I said earlier, what's so good about having something a little less thick? Not very much... (I didn't research but the Alienware is probably around .75 in. more thick, which is a space where you can't fit much.PS: If you hate Alienware, don't say that here, since you should hate Razer even more for super-expensive laptops that do not perform very well.. Just saying that to any Alienware haters looking at this Razer page. I admit that a cheap gaming desktop can be easily made, but this is chat about a gaming laptop. Also, keep in mind that I did not buy this product. This is just my opinion of this laptop when I saw this outrageous price. Buy it if you want, but if you want a decent laptop, take a look at the link above, or visit Alienware for a good gaming laptop.", "Date": "July 8, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009ZPJMIC"}}