{"Reviews": [{"Title": "It's nice, but..", "Author": "Amazon Customer", "ReviewID": "R2SO7DII7IDTO9", "Overall": "4.0", "Content": "I agonized for weeks before finally purchasing this laptop.  In the end I decided what I really needed was a desktop replacement.  A powerful, capable machine that could replace my aging tower and still be a laptop.  In that I was not disappointed.The goodThis machine is quick!  Video plays flawlessly, I am able to convert movies from one format to another averaging 10 minutes per 1.5 hour movie.  My old tower would take 2 hours.The screen is bright and clear.  The keyboard lights up nicely and the sound is pretty darned good.  Build quality is good, no flex to it even if you're Mr. Universe and manage to heft it by a single corner.I like the fast wireless built in to the laptop and its easy to switch between wireless connections.The so soThis notebook does heat up and grows uncomfortably warm on the legs if you are lounging around with it.  The fan is on most of the time and you can hear it humming away although I wouldn't call it annoying.Windows 8 takes some getting used to.  The touch pad is only partially effective at gesture recognition and will leave you disappointed half the time.  I guess I don't really get the purpose of the live tiles.. I have reverted to using the desktop mode almost exclusively.  I probably won't bother with the hassle of downgrading to windows 7.The badI really, really dislike the battery pack that came with this machine. In order to fit more oomph into it, there is a 1-inch tall ridge that runs for most of its length, functioning as a bit of a kickstand for the laptop so its tilted a bit towards you.  While this is fine when its on a table, try putting it on your lap and that ridge quickly digs in and becomes uncomfortable.  I am forced to keep my legs well apart so I catch the edges where the bottom is still flat which is also uncomfortable.I also experienced a weird power pop up that kept coming up every 15 seconds warning me about my power supply.  In the end I had to find the utility responsible and delete it from the HD before this warning would go away.Fnally, perhaps due to some software I have on the laptop, perhaps due to something else, when I display and file open/save dialog, the machine frequently pauses for 10-15 seconds during which time the dialog is frozen.  Very annoying for something this fast to be doing this so frequently.", "Date": "February 23, 2013"}, {"Title": "Great Machine", "Author": "Carlos Rios Ramirez \"Carlos\"", "ReviewID": "R2UD9H927254YG", "Overall": "5.0", "Content": "I consider this is a nice buy. It has all you want from a high performance laptop for a reasonable price compared for a Macbook Pro or something else.At the first time i was wondering if this machine has softbuttons to have quick access to volume, wifi, bluetooth and others, I searched over the internet with no luck. So I had to wait to receive the laptop and finding this out by myself. For my surprise I found the F keys has this option as primary option and if you want to use the keys as F's you have to press Alt+F* as a very nice found.The laptop is very quiet, materials are good considering I hate black laptops with easy finger printing. For 16mb you have to challenge yourself and the computer to use that much of memory. I bought this one to edit photos in Lightroom and Photoshop, while I listen music and stream movies. I can consider I have all these services run with no issues. So happy for that.Windows 8? no issues found at this moment.", "Date": "December 26, 2012"}, {"Title": "Terrific laptop", "Author": "A. Hardcastle, Jr. \"Tiotaco\"", "ReviewID": "R2QCMRQ37NXTIJ", "Overall": "5.0", "Content": "Everything I expected and more--fast, beautiful screen, good keyboard (love backlighting) and generally good feel. Can't ask for more. Can't even suggest improvement.", "Date": "January 11, 2013"}, {"Title": "A MUST READ - Detailed Review of this Laptop!", "Author": "Mr. Paul", "ReviewID": "R186H269WU6MUD", "Overall": "5.0", "Content": "When I was about to purchase this Laptop, I did what everybody does, and read reviews like crazy. I was very impressed with the specs but other customer reviews had me in doubt.I decided to go with my knowledge of the specs and purchase the laptop regardless of issues stated by others.Firstly I just want to touch on some of the issues that other 'reviewers' posted along with their lower star rating... These claims made by others created hesitations in my mind but was never experienced after my purchase.(1) Fan Noise:The fan comes on pushing the slightly warm air out of the left side vents of the laptop.The noise that someone mentioned simply cannot be heard. Rather a very light, gentle humming.Feeling the light movement of air from these vents is comforting to me, know that heat is escaping.In some other laptops, you can't feel air movement anywhere around the pc making you wonder about the internal cooling.This laptop is very efficient in keeping the powerful i7 processor cool on its own without the need for a cooling pad.The fan is effective and efficient; just ensure that with time, you try to keep the vents clear from dust.  This will ensure that the heat is escaping efficiently.If dust or any other material/substances are blocking the vents the heat will not escape and the fan will increase in speed. This increase in speed will obviously cause the fan to sound louder since it will be working harder to get the heat out.(2) Heating:Like I said before, the fan effective and efficiently remove the unwanted heat and keep the body of the laptop cool.So far I never experienced any overheating of the laptop, used on a bed, used on a sofa, used on a table, used on my lap.Once the vents are clear and not blocked by anything, the laptop will cool itself down effectively.(3) 1 inch Ridge underneath laptop:Other basic laptop designs have a base that lies flat onto whatever surface it is placed on.Surprisingly enough these laptop designers put vents here (on the underneath) for heat to escape, but since the base of the laptop is pressed flat onto the surface it is placed on, then the heat gets trapped inside and you are then required to buy a 'cooling pad' to push cool air in these otherwise blocked vents.But with this HP ENVY, the battery is designed is such a way that it has a ridge on the underneath.This 'ridge' keeps the base tilted off the surface that it is placed on allowing air to pass freely keeping the system cool.The underside of this laptop has a Beats Audio Subwoofer. Since the 'ridge' keeps the rear of the laptop up, the bass sound from the subwoofer is echoed effectively of the surface that the laptop is place on. This creates a cleaner, clearer sound as compared to other flat based laptops.The tilt also positions the keyboard at a comfortable angle for your typing use and gives a clear view of the keyboard while it rests on a flat surface.Since this ridge is only on the battery, it is not designed 'end to end' on the laptop. Rather it is positioned to the middle-back of the underneath, creating a comfortable space for both of your legs to hold up the laptop while you sit and use it.Therefore the 'ridge' in no way creates and un-comfortable experience while being used on your lap.Since the position of ridge forces you to position you legs to the both sides to hold up the laptop, the under vents are kept clear keeping the system and your legs cool.The design also keeps the subwoofer vents clear, maintaining the free flow of the bass sound from the subwoofer.(4) Weight:This laptop has specs that will give alot of desktop systems some real competition, with that in mind, making a powerful laptop like this mobile is very impressive.In other words, the system is thin and relatively light when considering the features, power, speed and various capabilities.(5) LED Backlit:The Keyboard is Full LED Backlit and is switched on/off by a key on the keyboard.It has a beautiful pure white glow around each key along with the individual numbers and letters being lit.A key for the caps, muting and switching the wifi on and off also has a LED light on it to indicate on/off position.(6) Finger Print Scanner:So far I've had no issues with this feature as the scanner reads my finger with one pass.I assume that if issues are present, it may be a manufacture problem.(7) Heavy Gaming:Although the Laptop has impressive specs, don't give it a bad rating because you can't run one of your high graphic games that can't even play on your desktop.For persons looking for a gaming pc, my advice is to try getting a six core with a 3.5GHz and up processor on a desktop tower.This laptop handled games with medium graphics very smoothly without ever freezing, overheating or requiring reboot.(8) Windows 8:Giving any PC a bad rating due to your experience with Windows 8 is very unfair and unfortunate.To all the persons unsure about Windows 8, give it a try. No one could have been more sceptical that me about it, but after familiarizing myself a bit, I realized that it wasn't much different to Windows 7.The usual desktop screen that would appear after booting, is now a screen with tiles that act like shortcuts to different apps and folders.These 'live' tiles (shortcuts) can be modified to the user's liking, for example more shortcuts/apps can be 'pinned' to this screen just as shortcuts were 'pinned' to Windows 7 Task Bar.You can even revert to the more common desktop screen via one of the tiles.Since the Windows 8 requires fewer resources to operate, the graphics can be set to max to show all the 'fluid' display graphics on any pc without taking away from other app performance, so on this laptop it runs effortlessly.It just requires some getting used to it does have some bugs and some aspects can be improved but so far I have no major issues with it.(9) Wifi and Wireless Connections:As expected, the wifi reception range is very impressive.I am now picking up signals from neighbours that I never saw coming up with my old pc.The wireless connections are made fast and effortless by this laptop, contrary to what others are saying in previous reviews.After I am connected, I stay connected without any drops or interruptions, maintaining high signal strength.(10) Shipping: The shipping was very fast and was maintained in excellent packaging.Laptop came in original HP Box in mint condition. I even got it with a 'Prime' offer, so fast shipping was free.The above ten points I made were to clear up some bad reviews that was mentioned by others who might influence you to purchase something else and lose out on this monster machine.I wanted to post this since they, some of the other reviewers, almost convinced me not to buy it.But I took a chance based on the specs and decided to check everything out myself.I wanted to confirm if the statements made by  these (few) people, represented actual product flaws or just unfortunate manufacture defects.I am in no way discrediting persons with genuine issues; I am just saying that their issues may me of some manufacture defect and not a product defect. Some people though tend to exaggerate minor personal dislikes and give poor ratings.I'm providing a review based on actual experience compared to many other laptops that I had encountered in the past.(11) The Body and Structure:I must say that this pc in no way feels cheap. It is made of a metal frame with solid structure.The keys feel soft and comfortable, pressed effortlessly.The touch pad is large and positioned away from hands while typing.I did find that the right and left click buttons on the touch pad are a bit 'clicky' and could have been designed like the keyboard buttons.I especially like the feature of: Wifi, Sound, LED Backlit, Screen Brightness etc, all being controlled without the pressing of a function (fn) key. Just press the assigned key and the changes can be made.The overall design is strong durable and well thought out, providing comfort of use, flow for heat and sound, etc. Even the HP logo on the top face of the laptop lights up, just as the apple in Macs light up.(12) The Speakers and Sound:There are five Beats Audio Speakers including the Beats Audio Subwoofer on the underneath.The sound is truly immersive! You wouldn't believe that it is coming from a laptop.There are two speakers on the monitor facing you, two speakers facing upward just above the keyboard, and the subwoofer below.Tested it with the Blu-ray Transformers2 disc and I was blown away.It's unlike any other laptop sound. You just have to experience it!(13) The Upgrade to 16GB RAM:When the RAM is upgraded to 16 GB, the Intel Rapid Start Technology is disabled.I will go into a bit of explanation of this to help others understand what took place and the benefits.There are two types of these 'Technologies' on this system:(1) Intel Rapid Start Technology(2) Intel Rapid Storage Technology (cache acceleration)* What is Intel Rapid Start Technology?Intel Rapid Start Technology is basically a feature that allows the PC to resume from `sleep mode' faster than usual.* What causes the Upgrade of the RAM to affect the Intel Rapid Start Technology?The laptop has 32GB of SSD (Solid State Disk).8GB (from the 32GB) is used as a hibernation partition for fast resume via Intel Rapid START Technology.The remainder of the SSD, about 22GB as displayed by Windows, is used as a cache to accelerate the 750 GB hard drive via Intel Rapid STORAGE technology (also called Intel Smart Response Technology).NOTE: the 32BG is displayed as 30GB, just as the 750GB hard disk is displayed as 699GB, nothing new here.Intel Rapid Start requires the hibernation partition (the 8GB) to be equal to or larger than the total amount of RAM installed. Since there was an upgrade to 16 GB of RAM, Intel Rapid Start will no longer work.From the 32 GB SSD, Intel Rapid STORAGE Technology requires a minimum of 18.6 GB. Therefore the 8GB on from the SSD cannot be increased to the 16GB (equal to the RAM) for the Intel Rapid Start Technology to be enabled, because there will be less than the 18.6 GB that is required for the Intel Rapid Storage Technology to work.Hence the reason why the Rapid Start Technology is disabled, but the Intel Rapid Storage Technology is still functional as normal.If you want to have 16 GB of RAM and both Intel Rapid START and Rapid STORAGE technologies working, you'd need to replace the 32 GB SSD with something larger, like a 64 GB SSD for example. But this would require some detailed research before interfering inside there.COMPUTER UPGRADE KING was the seller that I bought my HP ENVY with the 16 GB upgrade and the Intel Rapid Start Technology disabled.I personally tested the system performance with this Intel Rapid Start Technology disabled, (that is; resuming the pc from sleep mode), and it resumed very fast regardless.To me the upgrade to the 16GB of RAM from the original 8GB is a very big improvement in overall performance, hence the reason why I refer to this machine as a beast.The benefits of upgrading the RAM to 16GB outweigh the benefits of the Intel Rapid Start Technology, since the computer resumes fast (from sleep) without it anyway.I still got the 1 year warranty from HP for the original parts of the laptop, and COMPUTER UPGRADE KING gave me three (3) years warranty on their upgraded parts.(14) Seller : COMPUTER UPGRADE KING - Customer ServiceThe customer service was excellent!I posted many inquiries to them and they did not hesitate to give full explanation and answers to my questions with fast response.The delivery was free and on time with secure packaging.Conclusion:the only major hesitation that existed in my mind was the fact the RAM was upgraded, causing something to be disabled.But the benefits of faster overall performance outweighed the Intel Rapid Start Technology.And with the full warranty provided by 'Computer Upgrade King' for their upgrade and parts, it is well worth it!My Laptop is now the \"ENVY\" of all who knows about it...", "Date": "August 5, 2013"}, {"Title": "Great Laptop", "Author": "Agbaje Olalekan", "ReviewID": "R3GBBVZR4XY56M", "Overall": "4.0", "Content": "Main reason for the purchase:I have a HP DV9000 from 2008 which is still running, I only had to change the charger about two months ago. It never gave me any problems until recently when I started having OS crashes too often. I am a developer and also do some graphics on the side, so I love big and wide screens for my job.I decided to upgrade my machine so I could focus on my work and not spend much time recovering from windows crashes and blue screens.The machine:Wide screen, fast response and quiet for its specs. However, I did have issues with the keyboard as it had and still has ridges. It’s not perfectly flat and lifts in some places near the numeric keypad. I guess it was due to the upgrade from the backlit keyboard. Also the feedback from the keyboard when typing requires getting used to. I have this feeling like the keys haven’t been depressed enough and then I hit a hard surface. Lol.Windows 8:I was a bit worried with all the issues I have heard about windows 8, however I am actually enjoying it. It does take some getting used to but it’s not a no go area as some other reviews described it. Admittedly, it was designed with ‘touch’ in mind and it isn’t even much of a big leap from windows 7 in my opinion.All my windows 7 apps run without any problem.The track pad:Big spacious and fabulous. Interesting gestures too.The charger:Flat, wide and a bit bulky for my liking. Although, this may be because of the size and power requirements for the laptop it is mean to charge.The delivery:The package was delivered on time, well packaged and met all my expectations as regarding the delivery. I would definitely do Eluktronics again. Plus they have a very responsive customer service team.", "Date": "April 29, 2013"}, {"Title": "Great laptop great fast power", "Author": "Karl S Washington", "ReviewID": "R377L08G7BEL7M", "Overall": "5.0", "Content": "This thing dose the job, I'm a photographer and need a lot of ram and good graphics for a affordable price. This is the ticket. I can run my programs without the slow lag time I was getting from my previous laptop. Haven't had it that long, so I will give a follow up in maybe month, but so far I'm impressed. Just what I hoped I was buying.", "Date": "April 25, 2013"}, {"Title": "do not use biometric fingerprint reader", "Author": "Debra", "ReviewID": "R1I44DMC4Z5U1Z", "Overall": "3.0", "Content": "I love my laptop, HP ENVY dv 7 but made the mistake of using the biometric fingerprint scanner. Now in order to be able to use my laptop I have to enter a password which I did not want to do. The fingerprint reader sometimes works but takes at least a dozen swipes before it will recognize my fingerprint. Sometimes it takes even more. Today I swiped my finger 17 times before giving up and typing in a password. Laptop works great except for that feature. If you buy this product, do not use the biometric fingerprint reader.", "Date": "July 23, 2013"}, {"Title": "Way more than expected.", "Author": "Waasay Sophie", "ReviewID": "R60VCTGZMGZGO", "Overall": "5.0", "Content": "For the price this laptop has way more features than it should. Its got more than the top of the line apple laptop has except the retina display which is hardly noticeable for regular users or even gamers.", "Date": "June 4, 2013"}, {"Title": "HP ENVY DV7-7212nr Quad Edition mSSD Windows 8 Notebook PC; 16GB RAM..", "Author": "Phoebe", "ReviewID": "R1OT2X6L59EU6M", "Overall": "5.0", "Content": "I love this computer. I have had it a couple of weeks now.  I love the large size and that is not that heavy.  I purchased it to handle my photo's.  I love how fast it is.  The sound is amazing.  I don't do games so I can't say how it would do with them.  The windows 8 is different but not that difficult to figure out.  It kind of reminds you of a smart phone with apps it has that kind of feel.  I would purchase this computer again.  Some people don't like the way the battery sticks up but I don't mind it at all.  It kind of gives  you something to hold on to.  I like the lit keyboard.  I like the number key pad also.  I like the feel of the keyboard.  It is just a very nice computer.", "Date": "April 1, 2013"}, {"Title": "Very Fast Graphics", "Author": "J. Martinez", "ReviewID": "R2MTDJVPNTNQKE", "Overall": "4.0", "Content": "I play an online game regularly, and this computer has plenty of speed for that.  I am mostly pleased with its overall performance.  The computer does crash every few days, however.  It reboots quickly.  Whether this could be from my browser or the game itself not being completely compatible with Windows 8 is beyond my level of tech savvy.  Overall it's an excellent buy - faster and cheaper than my old Dell!", "Date": "March 2, 2013"}, {"Title": "This is an AWESOME laptop", "Author": "k k", "ReviewID": "R21JEZ665LG574", "Overall": "5.0", "Content": "Laptop is mainly used for browsing, home entertainment and gaming. This thing is fast. Games are rendered at max graphic settings aka (borderlands 2, StarCraft 2) and run (so far) without a single hiccup. This unit does get quite hot at the WASD zone when playing graphically intense games but is warm during normal use. Sound is great. Some bloatware comes preinstalled but is easily removed. Windows 8 took a few hours to get used to but so far its a solid OS. Backlit keyboard is great and the keys are very responsive aka you know when you have pushed the key and better yet they are separated from eachother (hard to explain)TL:DR I would highly recommend this laptop to anyone. I basically love everything about this laptop. HP is top shelf.", "Date": "July 22, 2013"}, {"Title": "amazing", "Author": "drew", "ReviewID": "R3EN0OZ4ZPD7B9", "Overall": "5.0", "Content": "this product is flawless!it is exactlywhat I wanted and more! Photoshop works perfect and so does  steam games. Even battlefield 3!!! I love it!", "Date": "July 17, 2013"}, {"Title": "Great decision", "Author": "Ely Gomez", "ReviewID": "RX5SQ97LTV5X", "Overall": "5.0", "Content": "I Work both as a graphic designer and a video editor, thanks to HP ENVY DV7-7212nr Quad Edition i'm able to do my job without any restrain, i can open the entire Adobe Master Collection CS6  without laggin of any type, each and every single one of those programs opens in mere seconds.Pros:Is incredibly responsive and quick, no waiting whatsoever.I've had it for over a month and even with a very high cpu usage (Photoshopping, editing in premire pro, after effects, lightroom, ACDSee etc.) This pc hasen't froze a single time, only restarting it once every few days, ocassionally shutting it down once or twice per week.As I previously mentioned, i work as a graphic designer and a video editor, the thing is that i'm not alone, my coworkers all have macbook pros, from 2000 to 2700 US dollars, and believe it or not, this pc is twice as powerfull as the most powerfull of those macbooks.The graphics card, makes pc gaming experience truthfully amazing, both the nvidia 2gb graphics card, the 1920x1080p resolution, the antiglare, etc. in conjuction makes a person like me who didn't do any gaming in any time of my life, want to play for hours.The sound quality is unreprochable, just awesome, great bass, volume capability, design integration within the device. Flawless; does the job of any external speaker i won't have to buy.In terms user's experience  there are integrations of hp that make the experience of the hp dv7 even nicer, the fingerprint scanner, actually comes in handy many times. I got a prize from hp, in my box account, as i logged in, a message poped up saying that hp had given me 50 gbs of online storage, great, just great.The wifi setup is quick and easy, it connects to any wi fi signal y less than 3 seconds (believe me)Windows 8 is actually pretty awesome, of course it takes a while to get used to, even more with me, who had an iMac for over 4 years, in a day or two i got used to it, and within a week, i felt like a master about the topic of windows 8 functionality, i think people should just give it a try with an open mind, and think of the reward rather than the complications; the minimalistic design is lovely, from the point of a graphic designer; the things that you can do differently are countless, not saying that the desktop mode experience is bad, not at all, but it was time for a change and i've got it with Windows 8.Cons:I find the battery life not to be very good, about four hours a full charge, maybe it's just mine, not really a big deal for me.The build quality, is actually pretty good, no flexing, in spite of that, i feel that if i ever dropped it, i would instantly lose it.That's all i got, overall i feel very good with this device, it's makes me happy to have made this decision.", "Date": "July 11, 2013"}, {"Title": "Excellent computer with fast Shipping", "Author": "IMACDSP", "ReviewID": "RXGLJHBTNL73T", "Overall": "5.0", "Content": "I had previously bought a dv-7 pavilion a few months back via eluktronics..great machine that I ended up giving to a family member as an excuse so I could upgrade to this beast. Im by no means a computer expert, but its fast, picture is great, and I really like windows 8.It registers I think a 5.9 on windows experience only because its not taking into account the 2GB of Nvidia graphics. Music plays great with the beats settings. The only thing I will say is that you should probably purchase a mouse because windows 8 can be a little sensitive with the touchpad(changing screens when you don't want to based upon a movement). Other then that, great machine. Used mostly for work but with some gaming on the side(starcraft) and it runs flawlessly. I also spent 5 extra dollars just to make sure I got shipped from Eluktronics. There shipping is always faster then expected and whenever you have a question, they are fast with a response. I have and will continue to use them for all electronic purchases. Thanks HP and Eluktronics", "Date": "February 18, 2013"}, {"Title": "fantastic machine!!", "Author": "Amit Singh", "ReviewID": "R2MT8OD3T8C6T", "Overall": "5.0", "Content": "Fast and furious!!looks stunning and things are done with in seconds. Upgraded version also give great battery backup.Delivery was also fast and no problem with it.If it would have 100-200 bucks less then it would have being nice on pocket.Overall satisfied.", "Date": "January 30, 2013"}, {"Title": "dv7-7212nr quad = great, but...", "Author": "David Coffler", "ReviewID": "R1XSVGXXVLO1O0", "Overall": "4.0", "Content": "Windows 8 is problematic and when prompted to update a keycode is required that is not available to the quad owner; of course, one can be purchased! The quad is fast and reliable.", "Date": "February 11, 2013"}, {"Title": "Fast!!", "Author": "Pablo Sesma", "ReviewID": "ROADDG5CRFZO4", "Overall": "5.0", "Content": "Pros: the notebook is really fast, wakes up in a few seconds!!Cons: i only have to learn Windows 8 interface.", "Date": "June 21, 2013"}, {"Title": "I love HP brand but???", "Author": "CAD LEADER", "ReviewID": "R36T719FJT9D5E", "Overall": "4.0", "Content": "I think this is my best own laptop , I always buy HP . just one problem I still find : HP support is very complex and need time for understand , Thanks", "Date": "April 12, 2013"}, {"Title": "SHIPPING SUCKS", "Author": "Vicki Thomas \"ER fan forever\"", "ReviewID": "R2G0R8KDN3VWX3", "Overall": "1.0", "Content": "I purchased this item thru Amazon because I needed it quickly and they have always been great at shipping.  I ordered on a Monday and it is now Friday and the HP has not even made it to the carrier yet.  And Amazon says it was IN STOCK - but when I contacted Eluktronics I was told it takes a while to get these HP Envy computers because they have to build them.  Really?  Then why does it say IN STOCK?  I am very disappointed with Amazon and Eluktronics.  And then I read all the other reviews and they are singing their praises of how fast their shipping was.  I am glad the computer itself is getting high ratings but right now I have to go with 1 star due to shipping.  My son has a computer similar to this one and he loves it so I am hoping the HP Envy turns out to be worth the unbearable wait. I hear the graphics are great, and the speed too.", "Date": "April 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009VQU27A"}}