{"Reviews": [{"Title": "Inexpensive and Powerful. Great Value!", "Author": "Josh from Boston \"joshman25\"", "ReviewID": "R3ABKBSGJEB4DL", "Overall": "5.0", "Content": "I bought this laptop to use as my Digital Audio Workstation (DAW). I wasn't looking to spend too much, but I wanted a minimum spec, which this laptop filled. Most important was a dual core processer. The i5 in this machine is plenty powerful enough for my use. I also wanted a 7200rpm hard drive - this one has it. I did upgrade the RAM to the full 16GB (an extra $88 in Crucial memory) - the machine comes with 4GB and is upgradable to 16GB. That upgrade took all of 1 minute. All in, I spent under $700 for a laptop that could have easily cost $900 or more.I love the look of this thing. It's big, with a large screen. Might not be a great traveling laptop, but for my needs it is exactly what I want.Everything arrived in new condition. Fired it up out of the box and installed the updates. NO bloat ware to deal with at all, really. Just some HP tools that you don't need enable. This laptop is clean and PERFECT for my use. No processing issues when recording music - I get about 4 or 5ms latency using ASIO drivers - I can get similar latency with the WAVE RT driver as well. The Windows rating on this system is 5.9 out of 7.9 which is pretty respectable.I'm running Mixcraft Pro Studio 6.0, Superior Drummer 2.0 & Melodyne Editor 2 without any hiccups.I'm extremely pleased with my decision to go with this laptop. Yes, it comes with the Windows 8 upgrade but I'm not touching it! Windows 7 Pro is very stable and what I'm sticking with in this particular instance.I would recommend this laptop of you're on a budget and looking for performance without a bunch of frills. There's no office productivity software pre-installed so if you're buying this for business purposes make sure you have all of the software you want to run. I'm sure that's one of the reasons the price is so reasonable.For the home audio enthusiast, this is a great entry point platform for your audio recording and editing needs.", "Date": "March 1, 2013"}, {"Title": "I'm very happy with this laptop.", "Author": "Donna Gray", "ReviewID": "R2DEGF5TG2IRTY", "Overall": "5.0", "Content": "I like the raised keys on the keyboard.  I like how quiet this laptop is.  The sound and video are very good.  Compared to other laptops I've had it's amazingly quiet..  It's nice and light.  My last laptop, an Acer, would get burning hot.  Not this one.  Thanks to some new technology developed by HP it stays cool, which is a very nice feature.  It's fast enough. I tried a Toshiba laptop before I got this one but sent it back because the sound and picture were both terrible, and because I HATED the Windows 8 operating system.  I feel very lucky to have found this excellent computer with Windows 7, which I much prefer. I would recommend this laptop.", "Date": "June 13, 2013"}, {"Title": "GREAT BUSINESS LAPTOP !!!", "Author": "Yuva", "ReviewID": "R2QIVPY8VDQT3X", "Overall": "5.0", "Content": "Alright guys, let me see how precise I can be with this review. I bought this machine for a client of mines and they absolutely love it!First of with the build quality. Its brushed aluminium with some plastic around so the build quality does feel pretty solid. It's a bit heavier than the equivalent lenovo with the same specs but it's not terrible and of the bat, of the better things about the build quality is that everything sits securely on the machine. The lenovo I bought a while aback had q/c issues with the dvd drive sticking out. But this machine was perfect. Oh the machine is a little wider than you think it is, but its not that big a deal. the black finish at the bottom hides how wide the machine actually is.Now for what comes in the box. I TOTALLY LOVEEEEEEEEE the fact that it came with BOTH operating system DVD's. HP ... YOU GUYS ROCK FOR THAT! So this laptop came with both installation cd's, either windows 7 pro or windows 8 pro, which ever you choose to upgrade it to. And of course with all HP machines it comes with a tonne of bloatware that would take you at least an hour to get rid off (my only major gripe but I still give it 5 stars). But one you get rid of the HP bloatware it works brilliantly!Now I did notice an earlier review where someone was complaining about it coming in french which I did think was a bit odd. But for those of you who are reading this rewview pay attention. When the laptop is booting for the FIRST time a screen will come up to select which language you want installed to use your machine. YOU MUST BE VERY CAREFUL AT THIS POINT. Because once you select the wrong language it cannot be undone unless you do a complete reinstall. So I figured either the gentleman or his mom was rushing the setup and didn't realise until it was too late. So ppl, please be careful when running the set up.And I absolutely HAVE to mention the software update for this machine. Now when I was trying update the lenovo I kept getting a stupid error about the updates failing and had to go through the painstaking task of installing them one by one. Which I thought was a bit odd. And guess what, on the dare HP ... NO SUCH PROBLEMS !!! Clicked download, windows installed, even told me there were some unecessary updates and to date it's purring like a kitten !!!And one final thing is that FN key was not working on my laptop. I was abit alarmed and concerned at first, but if its one thing, I can't fault HP online customer support, and sure enough there was a nice little file on HP's website which said HP FN driver update/fix .. and with that installed the machine didn't fail to impress me.All in all I highly recommend this HP laptop, which is strange of me to say because I used to hate HP, but if I had to choose this and the lenovo(which was a fingerprint magnet btw), I DEFINITELY would go with this!If any of you who are reading this and still have more questions. Feel free to contact me!", "Date": "August 5, 2013"}, {"Title": "Its Fine so Far", "Author": "D. Laster", "ReviewID": "R1VQ533E1JLHRH", "Overall": "4.0", "Content": "It's a computer laptop.  It works as expected.  I got this one because I didn't want windows 8, but wanted a decent amount of memory.  This gave me the option of sticking with 7 and also gave me a disk I could use to upgrade to windows 8 if I ever feel adventuresome.  I like the key board.  The keys are raised.  There are some features I haven't tried yet.  It is light weight.  That is a plus.  Much faster than my other laptops.  The CD/DVD slot is not well designed, is flimsy and is hard to open.  Update:  It has a strange deal with the mouse.  There is a small pin light (not a button) in the left portion of the mouse closest to the monitor.  If you touch it by accident the light will come on and your mouse will freeze.  The only thing that will make the mouse unfreeze is to tap that light several times.  Apparently my other HP laptop is like this as well and I never have been unfortunate enough to accidently press it.  Other than several hours of panic, it didn't harm anything.  But scared me to have my computer essentially frozen and unable to access my documents.", "Date": "March 12, 2013"}, {"Title": "Good All Around", "Author": "Roger Dodger", "ReviewID": "R2CXGZCDHMCM3M", "Overall": "5.0", "Content": "The only complaint I have about this laptop is that it's a little big.  But hey, I knew that going into it.  I upgraded from a Toshiba 13.3\" ultrabook that was very light-weight and compact but lacked a little on the power side.  I found myself needing a little more power.15.6\" is a little larger than I am used to, but I can't blame HP for that -- I knew what I was getting, and I'll get over it in time.  And it's actually a lot lighter weight than other comparably sized laptops.Beyond that, I have a lot of good things to say about this laptop.  First off, it's one of the few laptops remaining on Amazon that comes with Windows 7 at all, much more Windows 7 Professional.  That was a serious selling point for me.  It's got some nice features like a fingerprint-reader that you can setup to process your Windows login rather than typing in a password, which is fun as well.It also has an excellent keyboard that feels just right...raised keys that have just enough umphh to feel what you are typing, and a 10-key! (Okay, I'm an accountant, so 10-keys matter to me more than most.)I am consistently getting about 6 hours of battery life doing light computing (word processing, internet surfing, but no video streaming or playing music.)  That's exactly what I was looking for.  And after coming from a 2nd generation i3 to this 3rd generation i5, the thing seems blazingly fast.I've had this laptop for about 2 weeks and so far I am loving it.  As long as you are okay with a 15.6\" computer, I would highly recommend this.  And it came with a free Windows 8 disk if you ever feel the desire to upgrade...thus far I do not.", "Date": "July 18, 2013"}, {"Title": "I fell in love with my new pc", "Author": "Bandoman \"bando\"", "ReviewID": "R1048RZKCZPF5J", "Overall": "5.0", "Content": "I have just received my HP ProBook 4540s few hours ago and I have spent some time playing around with it. So, this is only my first impression. I love everything about this laptop so far! I have just returned my $950 sony laptop and got this $600 HP laptop, and I am so happy to do so. This is a really good laptop for students.I will write more about this laptop in few months, the time for me to go deeper in its features and usage.By the way, thank you very much to all people who write reviews about products on amazon.com and online sites. 5 stars for the seller TigerDirect, 5 stars for Amazon.com (I sell and buy on Amazon, and I love the way they handle this business), and more than 5 stars for this wonderful laptop. This is not my first laptop. In fact, in the last 4 years, I have own laptops from Dell, Asus, Apple MacBook (which I returned), Samsung, Sony (which I have just returned today). I have also owned an all in one pc from Asus and another from Sony. However, this is my first time to write a review about a pc, this is my first time to like my pc to the point to sit down and share my first impression...", "Date": "May 14, 2013"}, {"Title": "HP Pro Book Fills the Bill for this Realtor", "Author": "Neil Pogeler", "ReviewID": "R3ML223LABFEWR", "Overall": "5.0", "Content": "This laptop took the place of a finicky Dell I've had for about 5 years. So far I love it. I had to get all the advertisements cleaned out of it when I first bought it (downloads come with them automatically now I guess), but now that I've got the bugs worked out, it performs well. Glad I got one with Windows 7 instead of 8. I've heard lots of bad things about Windows 8. I'm a Realtor, so I don't do a lot of gaming and store a minimum amount of pictures on it, but overall, everything works like it should. It doesn't get hot on my lap like my old computer and is faster and lighter which I like. I also like the fact that you can turn off the thumb pad if you want with a double tap in the upper left hand corner.", "Date": "August 13, 2013"}, {"Title": "HP 4540S i5", "Author": "PCDuck \"PCDuck\"", "ReviewID": "RKNHKNHZH14W1", "Overall": "4.0", "Content": "Very good laptop. Make sure you create a system restore point once you buy it and start using it. You can always go to that point without using any disks. Also, those who love the fingerprint login must be very careful because maybe that info is stored online and if HP's database is hacked your info can be abused.", "Date": "September 19, 2013"}, {"Title": "Nice - solid laptop!", "Author": "M.J.", "ReviewID": "RA8FI4Z8QYE9R", "Overall": "5.0", "Content": "I've only had the laptop for a few days now, but so far, I have no complaints.  It came quickly and was well packaged. It set right up out of the box with no problems. I also liked that it came with Win7 Pro installed, with the option to install Win 8 yourself, if you want it, which I did not.  It comes with CDs for both Win programs, and with accompanying Recovery CDs for both programs. There were quite a few downloads from Windows Update for Win 7 to take care of, but no problems with that, other than some time.I too liked the raised keys.  The screen resolution is very good and adjustable.It comes with very little in the way of added software (unusual), except Windows Explorer. It has its own security protection system, which I have not delved into yet.I will echo the complaint about the sorta flimsy CD/DVD slot, but I found the easy way to open it was to just click on it from \"My Computer\" and it pops right open.  I just try to be real careful with it because of its seeming fragility.  Aside from that slot, the computer is very stoutly built, but not too heavy or inconvenient in any way.It connected to my router right away and so far everything has been great.  Will update, if that changes.  I appreciate those that posted their opinions before me, because I relied in part on those reviews in making my purchase.I especially appreciated those reviewers who \"alerted\" to the issue of the \"language setup\" choice at the beginning of the setup program, because if one is not paying close attention at the time, and just hits \"next\", one can easily end up with French as the default language, since French is the first language listed in the choices, and I noticed that it states just below on that screen that the choice cannot be changed thereafter.  I presume that you can uninstall and reinstall since you have the CD, but it was because of that alert in the previous reviews, that I made sure to pay special attention for that particular question.", "Date": "August 23, 2013"}, {"Title": "Great Laptop", "Author": "Trix", "ReviewID": "R29HYYWCYG7COS", "Overall": "5.0", "Content": "Let me start off by saying that I don’t write any product reviews, mainly because I’m excessively lazy. Also, with so many people already writing such thorough reviews, I figured that the average buyer would already have a decent overview of what to expect. Additionally, I was hesitant to buy laptops online because I couldn’t physically assess it (important to me, a non-computer person), but I’ve been so pleased with this purchase that I felt the urge to write a review.Pros:- Windows 7 – one of the top reasons why I bought this laptop. Don’t get me started on Windows 8. I find it gimmicky, loathe it with a passion, and have generally accepted the fact that I will stick it out with Windows 7 until Microsoft releases a newer version that at least offers the option to switch to a permanent desktop mode.  The laptop itself comes with both Windows 7 and Windows 8 CDs.- Looks nice – the brushed aluminum makes for a beautiful silver/grey matte finish. Go to YouTube and search ‘HP ProBook 4540s’. There are unboxing videos aplenty. It’s hard to deny how aesthetically pleasing it is.- Keyboard is easy to use, as is the two-button touchpad. Call me old fashioned, but I dislike touchpads with no physical buttons.  Of course, that’s just my own personal preference.- Decent battery life – about 5 hours worth of moderate use (i.e. surfing the web + streaming videos + Microsoft Word + editing software)- Automatic internet connection even after hours of idleness. It’s as if I never left the laptop!This might not seem like a big deal, but compared to my old Lenovo laptop (bought 2010), which always needed troubleshooting and manual resetting for the internet to start working again, this is a godsend.- Fingerprint reader- Anti-glare LED-backlit displayCons:- CD/DVD slot is difficult to open and rickety. Even when you press the button, it takes a few extra seconds to eject, and once open, it’s wobbly.- 4GBs of RAM – perfectly fine for regular school/office work use, but probably not enough if you need to run photo/video/sound editing software + video streaming + surfing the web + other programs. This is easily upgradable, however.- Heavy, not very portable, not suitable for travelling – 15.6” screen, about 5 lbs. Then again, you probably already know this from reading the specs.Minor quibbles:- You have to press the fn + louder/softer/mute buttons simultaneously to change the volume–personally, a bit of an inconvenience- Headphone port in an awkward place, right underneath your left hand. It would be nicer if the port was on either side of the laptop.Overall though, I love this laptop to pieces. I read Josh from Boston’s review and may follow suit with some form of RAM upgrade.", "Date": "July 30, 2013"}, {"Title": "Great Notebook for business or home... Ordered it Windows 7.... Fast, easy to work with and a terrific monitor", "Author": "Adam B. Colter", "ReviewID": "R2KSMYJ3S1O6AC", "Overall": "5.0", "Content": "Great Notebook for business or home... Ordered it Windows 7.... Fast, easy to work with and a terrific monitor. AAA+", "Date": "November 24, 2013"}, {"Title": "Solid performing machine", "Author": "AK Music Lover", "ReviewID": "R2PB8XFXA2PYX", "Overall": "5.0", "Content": "Came as advertised.  Solid construction, well laid out USB port locations.  No functionality issues.  Windows 7 launched and operated correctly and without hiccups.  This machine is fast.", "Date": "November 2, 2013"}, {"Title": "Good computer", "Author": "Pam", "ReviewID": "R2TH4QC7VJFV0", "Overall": "4.0", "Content": "I was looking for windows 7 as I really didn't want to go to 8 yet. This fit the bill. Good computer, not much blot wear. Easy to sit up. For the price a great buy.", "Date": "October 20, 2013"}, {"Title": "Love my New HP!!", "Author": "Amazon Customer", "ReviewID": "R39EIGBC0U1Q1H", "Overall": "5.0", "Content": "I bought the HP ProBook to replace my three year old Dell. I wanted to get a Windows 7 notebook. I found HP to have a good rating and looked at it more. The more I read about it the more I knew I would get this. It had the configurations I wanted - i5core, 15.6\"screen and of course windows 7. I have been using it for over two months now and have found it to be perfect for me. I have some my old softwares (FrontPage) and some new (office 2013), and both work perfectly well on this. The keyboard is beautifully quite and smooth. I am still getting used the the numeric pad as I did not have it in my old Dell. The speakers are great! I recorded some audio on my power points and the sound came out very well. DVD player is great. I have not burned any cds yet, but I am sure it will be fine. It is a fast computer and starts up in about 30sec...really good!! So far I have not had any issues with it at all. For me its a great buy.", "Date": "September 21, 2013"}, {"Title": "Fast as hell and great price", "Author": "F. Campbell", "ReviewID": "R27RHA89QT6ZTU", "Overall": "5.0", "Content": "Got this on sale for $650 w/ the 7200 Hard drive and it is very fast and with Windows 7 Pro very stable and no issues. Love it!", "Date": "September 7, 2013"}, {"Title": "Great machine for a great price", "Author": "Tommy T. Maras", "ReviewID": "R1UP6G5VIYDYFH", "Overall": "5.0", "Content": "I really like this machine.  Was looking for a laptop to run my small business.  10-key pad was key.  This machine has a fingerprint reader that is very cool.  Very happy with this HP product and would highly recommend it.", "Date": "July 28, 2013"}, {"Title": "Best Buy", "Author": "JakeR", "ReviewID": "R141W065VS2YJY", "Overall": "5.0", "Content": "Very good buy for money.  Excellent laptop with most of the latest features.  Amazon's delivery was exceptional.  Would seriously recommend for college use -- great graduation gift.", "Date": "July 13, 2013"}, {"Title": "Nice laptop.", "Author": "Yuriy Antonyak \"Ukrainian\"", "ReviewID": "R2T1UTTX06ZQMJ", "Overall": "5.0", "Content": "I like very much so far. Meets my expectations completely. Comes with entry level Word Processr and Xcel.Very reasonable price, too.", "Date": "June 3, 2013"}, {"Title": "Unfortunate", "Author": "Catherine Fellows", "ReviewID": "R2AI5OR29D8WHV", "Overall": "1.0", "Content": "This was not for me, it was for a dear relative.  Unfortunately it crashed in less than a week, and put him through agony.  Finally straightened it out with hours of on-line help.  Then it crashed again.  It went back.  Thank the Lord for Amazon's great return policy.", "Date": "August 23, 2013"}, {"Title": "Low rez screen, lots of HP crapware", "Author": "Walt", "ReviewID": "RPOZSC2DTBUXK", "Overall": "3.0", "Content": "The screen is very low rez for the size of it, and the drive seems very slow. I added a high speed SD card for Windows to use as a cache, but I'll probably have to replace the HDD with an SSD to get better performance.HP also includes WAY too much crapware that needs to be removed. In fact it's so bad I'll probably end up wiping and reloading.", "Date": "December 18, 2013"}, {"Title": "Solid.", "Author": "Turnkey895", "ReviewID": "R1ATRFRQY8LM91", "Overall": "5.0", "Content": "This is a solid laptop.  It's big so if you are looking for a really small laptop this isn't it.  You can use Windows 7 which comes loaded or load Windows 8 with the disks provided.  Others said they had a problem loading the wrong language but if you follow directions it is a non-issue. Also one review said  the buttons  didn't work to open the laptop, but this model doesn't have any locking mechanism, not sure what's up with that.  Overall I think this is a great buy for the money Core I5 and well built, it doesn't feel like a piece of junk like many laptops.  The one complaint I do have is that the mouse pad is really sensitive, but I can live with it.  The overall quality is above my expectations and I would suggest to friends and family.I looked at a lot of laptops and couldn't find any with these specs for such a low price.", "Date": "August 28, 2013"}, {"Title": "Does what I need.", "Author": "Steven", "ReviewID": "R31JTP106OFI2Y", "Overall": "5.0", "Content": "Great computer.  Compact, lite and worth the money.  Like the security features and the sleek look and feel of the design.", "Date": "May 3, 2014"}, {"Title": "WOW!!!", "Author": "Krystin L Mahoney", "ReviewID": "RXMS6PWYNJUP5", "Overall": "5.0", "Content": "Bought for my dad's small business and it works great.  I used it for the first couple of weeks just to make sure if he had any problems I could help him out.  It is a really nice little unit!", "Date": "April 28, 2014"}, {"Title": "I like it", "Author": "Rich Meyers", "ReviewID": "R34OPP2APZ54VC", "Overall": "4.0", "Content": "ok!", "Date": "April 24, 2014"}, {"Title": "Loving my new HP Pro Laptop", "Author": "lrob", "ReviewID": "R21EBZ1WFTAYN2", "Overall": "5.0", "Content": "I love my new laptop!  I am still getting used to it.  I love the fingerprint option and the number pad!", "Date": "March 29, 2014"}, {"Title": "EXCEEDS MY EXPECTATIONS", "Author": "Josimin \"Coffee lover\"", "ReviewID": "R3BURIQKFDGTO3", "Overall": "5.0", "Content": "I was very happy to receive my laptop and it was ready to go!  It is performing in an excellent manner and I would recommend it to my family and friends.  Very easy to set up and connect to existing printer and internet service.", "Date": "March 23, 2014"}, {"Title": "Got what I paid for...", "Author": "ALFRED F. O'MEALLY", "ReviewID": "R18CZ6LZ2TQRRT", "Overall": "5.0", "Content": "The HP ProBook Core i5 Notebook with Win7 Pro installed, with the capability to be upgraded to Win8, is exactly what I needed in my current profession as a retired person who is very active in community organizations. I settled on 5 stars because I have yet to discover any disappointments in the machine's operation. It works as advertised!", "Date": "March 22, 2014"}, {"Title": "Bought this for my son and he loves it", "Author": "mike tatum", "ReviewID": "R166Y82T8FV9H", "Overall": "5.0", "Content": "my high school son loves the speed of this machine. He will not stop talking about how much the loves this PC.", "Date": "March 12, 2014"}, {"Title": "Great unless you get a virus!!!", "Author": "Micki B. \"spa lover\"", "ReviewID": "R10PIN4G4F17V7", "Overall": "5.0", "Content": "WE had a bad week with someone hacking into this and calling me to say Microsoft was sending error messages to them and because there were so many they needed to fix it. I normally don't answer the phone when it doesn't list a name and number but I had to look for my phone. They duped me, walked me threw taking things out and adding others. They took control remotely and added a virus that they said someone hacked in and they needed to get it off and I needed to buy their product or my notebook would no longer function! I contacted HP and it was a scam and they did mess my new notebook up; HP resolved the issue. This is a very good buy and it still has windows 7 that works better than 8.", "Date": "March 5, 2014"}, {"Title": "Perfect for my work at home", "Author": "Brenda", "ReviewID": "R2O0H7QTD0IV5D", "Overall": "4.0", "Content": "I may want to say that I've only had this computer 2 months or less but it has all the features I needed for my work at home and I was familiar with system as this is my 2nd HP windows 7. So far no issues and it seems to meet my expextations", "Date": "February 17, 2014"}, {"Title": "its okay", "Author": "Emily Andrade \"Major Texter\"", "ReviewID": "R19P8CGYVWZQ7K", "Overall": "2.0", "Content": "Not what I was expecting :/ but its a good laptop, but when it arrived at my house, it wasn't what it looked like in the picture. the color of the laptop was PINK, not BLACK!! But other than that mixed connection, it's a great laptop. I love it. I just ordered a skin from skinit.com and put it on the pink laptop. its adorable now. ! :D I would recommend this laptop to anyone, but remember that it might be pink. LOL!", "Date": "July 26, 2013"}, {"Title": "More expensive than an Acer and no nearly as good", "Author": "Christopher", "ReviewID": "R214YHQPU5ZW8D", "Overall": "2.0", "Content": "I bought this computer a few years after I purchased a very cheap Acer laptop. I purchased this one because I figured something a little more pricey would prove to be more powerful and easier to use in a work environment. Boy was I wrong. Not only is it exactly the same speed as my Acer but its a little tougher to use. The mouse pad is not very good, its hard to get it to read double clicks and scrolling is nearly impossible. Not to mention, my Acer came with a plethora of word processing and spreadsheet programs, this came with absolutely nothing. I had to purchase everything all over again. I think I learned my lesson. Buy an Acer, its cheaper and a much higher quality.", "Date": "November 5, 2013"}, {"Title": "Making the grade", "Author": "scotts kindle", "ReviewID": "R26W03M3OO5Y8P", "Overall": "3.0", "Content": "I have not got all the programs in it yet for school But my past exspearance with HP have been good and it's much faster but when all is said and done it will probity need a five star", "Date": "March 11, 2014"}, {"Title": "Average Computer", "Author": "Barbara Elbert", "ReviewID": "RS167ZLY12X8T", "Overall": "3.0", "Content": "This is not a top of the line computer, but then the price would indicate that.  It is fine for our casual use.", "Date": "September 11, 2013"}, {"Title": "HP DOWNLOADS VIRUSES", "Author": "gp55", "ReviewID": "R5T8Q9MDIHBEB", "Overall": "1.0", "Content": "My new laptop was good for 6mons started to have viruses a lot. Call hp thay said 199.00 to fix it. My pc did a download and I got popups videos not working.So if you like bad pcs then go for it hp is waiting to take your money.", "Date": "February 26, 2014"}, {"Title": "I thought it would cook eggs for me", "Author": "Van", "ReviewID": "R1SCOEU8V7TLGT", "Overall": "3.0", "Content": "No such luck. Keep a spare battery or two and stay busy not being plugged in all day. You're aces.", "Date": "August 24, 2013"}, {"Title": "ONE OF HPs LATEST AND GREATEST! GAMERS OR SURFERS DREAM", "Author": "Terry Mitchell", "ReviewID": "R6VL2ZDACTPVA", "Overall": "1.0", "Content": "This turned out to be a lemon....I'll never buy from HP again My 2 Computer expert friends were mad that I didn't talk to them before ordering. They said currently ACER is # 1....I make a whloe lot of money and the first person to contact me and wants to pay for shipping can have this piece of Garbage!...", "Date": "November 5, 2013"}, {"Title": "technical fiasco", "Author": "Paul  H.", "ReviewID": "R3MAXHQ9ED92DT", "Overall": "1.0", "Content": "presented as a win7 system with license to \"upgrade\" to Win8. could not be taken back to Win7 even with manufacturers support. Had to return it as non-functional after upgrade attempts failed, even with phone technical support and Win7 discs.", "Date": "August 1, 2013"}, {"Title": "Ackward keyboard layout", "Author": "o'neal lane", "ReviewID": "RP26H7PSLI6OM", "Overall": "1.0", "Content": "I just opend my box. Gosh I hate this thing already, the keyboard layout is spastic. The mousepad and keyboard are oriented toward the left side of the computer, instead of the center. Very ackward!!! This goes back in the morning pronto!redundant keypad on keyboard.Wish I had noticed it, othere might like it but I would never get used to it", "Date": "November 14, 2013"}, {"Title": "couldn't even open it", "Author": "Natalie Falconer", "ReviewID": "R1FMQRUWR6FE3G", "Overall": "1.0", "Content": "The buttons that are supposed to release the lip of the unit to open it didn't work. Who knows, it might have been a great laptop, but I'll never know. Doesn't engender a whole lot of confidence in HP though.", "Date": "August 15, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009PHTHRG"}}