{"Reviews": [{"Title": "good 1", "Author": "Manohar Chamana", "ReviewID": "R2FQZD6Z3GQ6E2", "Overall": "4.0", "Content": "Its been a good buy till now..can't complain much! Would recommend to ppl if they r looking for a good deal on sleek ultrabooks", "Date": "June 1, 2013"}, {"Title": "Slick product and comfortable for pocket", "Author": "MAKARAND JOSHI", "ReviewID": "R2NU8PWGP3QTFB", "Overall": "4.0", "Content": "I needed an ultrabook as a gift for my wife. Her work does not require hardcore performance but she likes slim and stylish workstations. Lenovo IdeaPad U310 met both of these conditions, in fact it proved better on performance than expected. It has core i5 3rd generation processor and 4 gig memory so that was more than enough for performance and it has the McBook styling yet it differs (in a good way) - with nice blue color. Plus it was very affordable for my pocket! All in all, my wife is very happy and hence I am happy with the product!", "Date": "March 3, 2013"}, {"Title": "Product came DoA", "Author": "JJ", "ReviewID": "R3AALFKHOF7MID", "Overall": "2.0", "Content": "Heard good things about lenovos quality from friends, so while browsing for a laptop for school I decided to try this model. It came DoA so I'll review what I can. I would also like to add that I'll be sticking with ASus from now on which is my primary brand of computers.Pros-aesthetically its wonderful the blue and white color scheme is great-Light weight - I'm used to gaming laptops so this was a breathe of fresh airCons-came dead- it was shipped in the laptop box itself, I have never received a laptop that wasn't packaged with another box for safety, the lenovos box was also a little beat up which is probably the reason it broke- screen was unhinged, I actually saw this review from another buyer and thought nothing of it, but this may be a common occurrence- keyboard seems to flex, i don't know how much this would affect use, but it flexes pretty deep- when lifting the screep up it makes a scratching noise at the hinges, doesn't seem to scratch anything, but could be annoyingIt definitely seems like it would be a great college laptop with it's portability, but I'm not going to deal with lenovo anymore. I'll be looking at a more premium line from Asus.Just want to add that UPS did a terrible job.", "Date": "March 27, 2013"}, {"Title": "Dead display and the panel that holds the display was open", "Author": "Ravi", "ReviewID": "R1MV64HFWN45Y4", "Overall": "2.0", "Content": "Display back light was dead and the front panel that holds the display was open.This is my first return on Amazon, looks like bad quality check. Dont know who is at fault lenovo or distributor or Amazon.I purchased a HP Envy 6t and had to live without a personal laptop for 10 days :)", "Date": "February 23, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009AEPXAY"}}