{"Reviews": [{"Title": "Very Good Laptop & Like Windows 8 Very Much", "Author": "Steve G. \"Steve-in-Ky\"", "ReviewID": "R2W7KKCBWLFPY", "Overall": "5.0", "Content": "I read so many opinions, ranging from total novices to so-called experts.  I finally just got one...this one, based on my own research and talking with a friend who is a computer engineer.  First off, I am not some computer expert who nit-picks everything he can find.  I have used computers since the late 1980s for the most part.  I have had 2 desktops and 1 laptop.I've thought about the negatives that people have mentioned, and I'll add my own perspective.  There are some things about this computer than I absolutely love, and some things that I don't like.  If you go to the Asus page, it isn't listed.  The computer is actually the K55 base model, with some changes for Amazon.  It has a few different specs, such as i5 vs. i7, etc., but the guts are basically the K55.First off, the complaints about the speakers.  They aren't what I had hoped for, volume-wise.  I'll explain...  Yes, the sound comes from the bottom.  It reflects nicely off the table for a rich sound; especially with bass boost.  This appears to be more noticeable if it is in a cabinet.  If you want to sit it in your lap, get earbuds--the sound does diminish quite a bit.  The level of sound is dependent upon the input.  This small of an amp can't push that much.  I (Heart) Radio gives a rich and loud sound.  Soft modulated sounds are very low in volume.  I am watching a streaming video, and the sound is such that I have to concentrate.  Other times, the sound is very loud, as with the internet radio.  Overall, the sound is not what I had hoped for, but it isn't totally unexpected.  This is disappointing...  I will admit that softly modulated input can result in very weak audio.  However, I didn't buy it to listen to the bare speakers.  I figured that I would use ear buds, or similar when I ordered it.  I have a good set of computer speakers and an AC powered subwoofer from an earlier desktop that can get quite loud with a lot of bass, that that isn't a problem.  So, with external speakers or earbuds, it sounds great.  With decent input volume to drive the speakers, it sounds pretty good.  Give it soft input, such as people talking softly, or room noise and your opinion will change rapidly.  But, again...this was not a deciding factor for me; merely a bit of an inconvenience if I'm someplace where it isn't practical to use speakers.On to the keypad...  I've never liked laptop keypads.  That said, this one feels good, and I like it fairly well.  I can type pretty well, and don't make many mistakes on it.  I actually sort of like it, now that I've had a chance to get used to it.  I still have to be careful when hitting keys.  It is definitely different than a desktop keyboard.  The touch pad is weird, until you understand the things it will do, such as rotate images, etc.  If you are used to separate buttons with the touch pad, this will take some getting used to.  It is easy to press the wrong side of the key pad.  Using a downward swipe to end a program can be a bit frustrating, as the mouse pad is one piece, with two separate types of functions.That noted, it is still weird.  I don't really like it.  I honestly find the touch pad somewhat annoying.  I haven't explored the various uses of it.  I use an external keyboard as well as an external wireless travel (Logitech M325--absolutely love it) mouse whenever possible.  I keep the travel mouse in my case and use it almost all the time.  Working with an on-board mouse frustrates me anyway.  My next purchase will be a wireless keyboard.Battery power varies with usage and settings.  It doesn't seem to last very long, as other reviewers have noted.  The level of settings does affect that.  However, I have it set to high resolution, which I figure is a large part of the problem.  Most of the time, I am near a power source, so no problem.Regarding other features: I added 4 additional GB of RAM.  Never used it with the 4 MB.  It is 1600 MHz, so if you add additional, get that instead of the 1300 MHz.  The webcam is .3 MP.  It is rather poor, but I want to stress that this is typical in this price range.  I was given a Logitech C920 HD Pro Webcam as a gift (retails about $90; Amazon sells for about $71).  Together, they kick butt, as you can take photos, record video and have streaming video with the external camera, at up to 15MP and HDMI 1080.Performance-wise, the i5 3210 chip is the slowest in the i5 series, but quite sufficient.  With Hyperthreading and Turbo Boost, it is quite an improvement over the i3, and is a high performing chip for anybody who doesn't actually need the i7, which is considerably more expensive.  Being a 3rd generation processor, the improvements are impressive over the 2nd generation chip.Likewise, the 5400 RPM hard drive isn't as fast as a 7400, but it is the norm in this price range.  From a practical perspective, it doesn't use as much battery and doesn't get as hot.  This is good.  Having 750GB is plenty.  A computer LAN engineer buddy isn't sure why they needed to partition the hard drive.  He made a ghost copy of the drive for me on an external drive.  Should this one crash or be corrupted, we can re-install an exact copy. *caveat--as of April 3, 2013, we are over-writing the drive with the ghost copy.  Malware did indeed sneak itself onto the hard drive--thank you advanced Windows 8 antivirus...The IceCool palm rest works really well.  Now about Windows 8. I upgraded to it from 7, due to the fact that not only was it cheap, but the price at the time included a rebate for the cost of it.  Windows was giving away Media Center for free at the time.  If you get Windows 8, definitely take advantage of Media Center.  My computer buddy uses it to record all the TV shows he watches on his hard drive, so he can watch them between calls.  After reading reviews, I was sure I would hate Windows 8.  It was difficult to believe that reviewers disliked it so much.  I was ready to re-install 7 the moment 8 made me mad.  I made backup disks and a copy of the upgrade to 8.  The truth is, regardless of other reviewers trashing it, I really like Windows 8...sort of.  It is almost idiot proof.  The Metro tile function is pretty cool, but you still have a desktop option.  My one \"makes me curse at it\" issue is that if you leave the mouse pointer over something, it opens it--not the fault of Windows.  Maybe I am doing something incorrect, or putting light pressure on something...I don't know.  Also, I've accidentally hit a combination of keys/mouse quite by accident and either gotten something I didn't want, or completely closed a program.  Be wary of leaving the track cursor on anything you don't want opened.As for using it, it operates a lot like a smart phone.  I do not find it clunky if one doesn't have a touch pad laptop; sometimes a bit quirky and at times I have had that \"what were they thinking?\" concern.  Windows 8 vs. 7/XP?  Better in some aspects, but I miss other aspects of the previous versions.  Since it is the operating system of present, people have to except it.  I've found that while I can load programs from the tiles, I usually keep the desktop mode running, with my favorite programs as task buttons at the bottom.  My wife hates it.Apparently, there have been issues with compatibility when using other software. I ran into this with one program.  I'm a ham radio operator, and logging software for our 3905 Century Club nets will not work on Windows 8.  Fortunately, the developer of the program has a step-by-step guide on how to re-write some parameters.  It runs fine after that.I read where one person noted the screen wasn't what she expected.  I am a bit disappointed by that myself.  It is a bit glossy, and the peripheral field can drop off, to where somebody beside you can't see it nearly as well as you can.  It is pretty noticeable when watching a movie, as there is a critical angle.  But, how many other monitors have you seen with the same issue?  And, how often will you actually have somebody beside you?  Some day, I plan to get a larger, flat panel monitor.  They are so cheap these days...I learned to try and judge things as to their value.  The fact that it will do \"X\" is not that vital if I never use \"X\".  It took me a long time to get over wanting the toy with the most controls, when I didn't need some of them.  An issue noteworthy is that a lot of things are not that easy to discover at first.  Windows renamed some and you have to explore to find stuff.  Not having a touch screen laptop to compare it to, I can't really comment, with previous concerns noted.Sometimes, having it highlight or open something I drug the mouse over is a royal pain, but it does come in handy for a lot of stuff.  I just now accidentally opened up a new window over this one and I was afraid that I had lost the edit of the review--something I already did a few minutes ago.  Trouble is that I don't know what I did to open up the new menu.  The layout of the laptop and the design of Windows 8 do have their share of very fine merits.  It isn't a flop by any means.Don't let my noting of what I feel are negatives dissuade you from a very fine computer.  It auto-installs many things and keeps track if updates are available, plus some additional cool stuff...that I can't happen to think of at the moment.  When I hooked up my new webcam, it automatically went to the site and downloaded the software in the background while I did something else.  That was pretty cool.  There are a lot of nuances that I could discuss in greater detail; I won't.  It does automatically place videos in a video folder, photos in a photo folder, documents, etc.  That is very handy, as you don't have to go looking for something.  However, it keeps track of sites and downloads in several different places.  If you operate covertly (even in Chrome Incognito mode), there will be some history of it.Windows 8 does not support the DVD player per se, so you'll have to use something else.  It also appears that while you get crisp HDMI video to your television, it lacks audio.  I read where there is a way to add it, and downloaded some additional software from Intel, but so far I haven't gotten it to work properly.  Apparently Microsoft is following in Apple's footsteps.  As they consider optical drives to be on the way out, they don't want to pay royalties to put the software in Windows 8 for the DVD.I watch internet via the TV's HDMI connection, with headphones at the present.  I'm still looking for a way to make audio work.  With a wireless mouse to adjust volume and such, it works well.  So, 2 negatives are that it won't play DVDs and give HDMI sound to the TV without a patch of some sort.  Streaming video or thumb drive video works fine.  If you have a CD/DVD software program to install, I guess you need to get the patch installed, or do the install by transferring the code to a thumb drive, etc.  A pain in the tush, but in my opinion it's nothing to influence a purchase decision.  As Bruce Hornsby sang, that's just the way it is.Now that Windows 8 is standard, I guess one doesn't have much choice.  There are a lot of free apps in the Windows store, of which I have downloaded several.  Read some reviews of 8 and you'll know some potential snags in the learning curve, thus making the actual learning curve very simple.  It's not nearly as difficult as some people complain about.  The most difficult thing for me was learning where they put the off command--I kid you not.  I left it plugged in the first couple of days because I couldn't figure how to turn it off.  It turns out that you put the mouse in the bottom right and a screen comes up on the right side.  You click settings, and an option is for power.  It is a lot of moves to turn it off; much more than on previous Windows versions, however it is  very simple, and I don't know why XP and 7 users hate it so badly.Trying to go to various settings is so simple \"once you learn\" where they are and how to get to them.  I put the Control Panel as a shortcut icon on the desktop.  If you are in the Metro mode, you right click the bottom of it, and an icon comes up that you click.  It shows you all the installed apps--again pretty cool.  If you mouse the upper left corner, it shows you the previous program.  There are many more functions that I find not only neat, but useful.  Anyway, I can't figure out why people trash it so much.  I think the combination of Windows 8 and this laptop are a winning combination.I must admit that I miss my XP a little.  I boot up my desktop, and it's like seeing an old friend.  But, my new friend is exciting and fun to be around!  I think a lot of the difference might be that it is so totally different from XP and Windows 7.  People mark things like this down for trivial reasons, and likewise they inflate reviews for some rather odd reasons.  I once saw where a lady gave a point and shoot camera 5 stars because it was a pretty pink.  When evaluating reviews, think of all the thousands of that model sold, and that a few bad reviews or an occasional \"lemon\" does not make a bad product.  To give a product 1 star because you got a defective model, or you don't like the keypad is in my opinion, stupid.One gripe: I did find out that the surface of the top scratches easily.  It is a soft, shiny finish and I put it in a backpack, where it must have rubbed against something, scratching it--I didn't find anything that looked it would scratch it.  I guess I should have kept it in my padded case, except that it wouldn't fit in the pack.  Judgement error...it fit o.k. when I experimented.  The rest of it appears very sturdy.  I paid $549 for it on a Pre-Black Friday Sale on November 12.  I see now that a newer purchase model is available, and it has come down to $499, then gone up in price.  Then, it went up in price. Now, there is a version with a different model number.  Looks like the same specs (AB51/AH51).  I do not like this aspect of Amazon.  The price and service are what I like.  Don't sell me something at a price one day; then drop it the next day and I have to eat the loss.  Best of luck with your decision.", "Date": "December 24, 2012"}, {"Title": "Nice Machine", "Author": "RTR", "ReviewID": "R26IBT9UW6Z6S2", "Overall": "4.0", "Content": "This little beauty, for the price, is going to be hard to beat. Not big on frills, but is a solid performer.", "Date": "September 20, 2013"}, {"Title": "Excellant Laptop for the Price", "Author": "Amazon Customer \"CommenterExtraordinaire\"", "ReviewID": "R1AVQP5FD2CNN3", "Overall": "5.0", "Content": "Good laptop thus far.  I added another 4GB of RAM when I ordered it and everything has been great so far.  Windows 8 isn't as bad as I thought it would be.  Just takes some time playing around to get used to it.", "Date": "July 17, 2013"}, {"Title": "Cool running-great sound and graphics.  Keyboard and touchpad seem mismatched", "Author": "Dorsie L. Hathaway \"FairieGodmother\"", "ReviewID": "R2PQQFWWTPYC0G", "Overall": "4.0", "Content": "ASUS A55A-AH51-RD 15.6-Inch LED Laptop purchased as a replacement laptop-I chose it because it had a high number of positive reviews on the site.Drawbacks-Touchpad is massively oversized on this machine-more than half my attempts to comment or connect land me on a prior page or in a completely different and unwanted application.  As a result I am communicating less, not better-for me, the keyboard and touchpad mismatch were so limiting I bought a USB keyboard-less frustrating to navigate.This laptop will work beautifully for someone sitting completely upright-for anyone leaning back in a recliner or bed relaxing, forget touch typing-keys are oddly spaced, resistant to pressure, and the space bar is tiny.  The ASUS A55A-AH51-RD touchpad is so responsive that hovering any part of my hand near it activates different pages and applications-just not the ones I want or need to see while trying to type/comment on a web page.Advantages-Screen is gorgeous, graphics are great and without additional memory this machine can run several Flash-intensive games at a time.  I have tried running them simultaneously in 3 different browsers and found no lag whatsoever.  Been noticing details never before visible and my scores on blitz games have increased by about 10 percent.  Sound on this machine is fantastic-I will recommend it to audiophiles.  Color and finish are a gorgeous cherry red.  The components are durable and I am happy to report the ASUS A55A-AH51-RD 15.6-Inch LED laptop runs cool and quiet night and day.", "Date": "July 16, 2013"}, {"Title": "Great Laptop !", "Author": "KidCh3nz", "ReviewID": "R2G8C6A3AF3CT1", "Overall": "5.0", "Content": "Asus is a solid Laptop especially for the price you can't go wrong with it, also I will choose this brand over HP or Dell on any giving day.  My previous regular laptop was an hp had screen issue and couldn't stand with the overheating issue. This laptop runs way cooler and doesn't overheat .  This is perfect for everyday use laptop web browsing/ emails/ movies/ etc.... The only thing that was lacking is the 4 gb ram on win 8, its good for now but later down the line you might want to consider adding another 4 gb($30~) in it. The battery life you get is around 4 - 5 hours which is pretty normal.  Overall this laptop is pretty good for the price.", "Date": "July 7, 2013"}, {"Title": "Great laptop, perfect for my needs", "Author": "Sarah M Dean", "ReviewID": "RM1JJYU5B4B9V", "Overall": "5.0", "Content": "I got this laptop because my 7 year old MacBook was on its last leg. I was unsure about how a PC would differ from my Mac, but it was the right price range and had all the specs I needed.It came within the quoted window, and was well packaged and shipped. It included all manuals and cords needed.I am very happy with this purchase and with the seller. The computer works great, was easy to set up, and was fairly priced.", "Date": "June 30, 2013"}, {"Title": "Fastest Laptop of Any OS I've ever seen", "Author": "weAponX", "ReviewID": "R3PCL09MD7SBJ", "Overall": "5.0", "Content": "Before I saw this Asus laptop, the fastest Windows based Laptop I had ever seen was a 17\" Macbook Pro running Windows 7 through Bootcamp.- It was the fastest that OS had ever run on any PC or Laptop I had ever seen it installed on.Today, that record has been broken by THIS excellent Asus Laptop. It literally boots to full in less than one second, it recovers from Hibernation in even less time.After I installed Classic Shell I had my Program Menu back and it booted to desktop, As of now, I am totally ignoring the Metro side. Windows 8 would be a great OS if not for Metro, the only thing that irritates me is the lack of Aero Transparency, on all of my open windows.Everything else? Is where Windows 7 left it, but the built in Disk Optimizer as they call it now is many times better than Windows 7, and the Built In Firewall is there as well. I've been using Windows 8 for 5 months and so far every program I have been running in XP through 7 runs on my own machines, even better on this one.The HDMI Display Output, is painless to setup and Rescale for 1080p, the Intel Control Panel has the controls for adjustment sufficiently apparent.And it is as if, the battery barely budges, I've used it a whole day without recharging. And to put Icing on my cake I have two 300 GB Drives, which are the partitions of the 750 GB Drive which is inside.", "Date": "June 23, 2013"}, {"Title": "So so... Still watching out for error(s) (UPDATE)", "Author": "Truong Bui \"Alex Bui\"", "ReviewID": "R24K4JF2RLIWS2", "Overall": "5.0", "Content": "I have owned this product for about over 12 hours now. Cannot say that I am supper happy about the purchase because other reviews make it sound MUCH better than it turns out to be. That said, this is not a SLOW or BAD laptop, but when I saw people wrote something like \"it runs like a breeze,\" I thought muti-tasking would be much more smoothly: there are certain long pause moments when I am trying to install software + moving data + using Chrome. Speaking of Chrome, before I forget, the \"normal\" 64-bit version (which you download normally on Chrome website) won't work  properly on this laptop. Solution: Download Chrome Canary.This morning, after a short sleep, I was rather excited to get back to the laptop. 1st thing happened? It didn't load. The screen turns on, and a black screen appears, and... that was it. It didn't go any further than that for like 3 minutes. Something has to be wrong here. I tried to reboot one more time using the power button; the problem still persists. Third time, nonetheless, I get some luck: it finally boots to the start up screen. Phzz. SO... Now I am constantly paranoid that it will randomly shut off in front of my face at any possible moment. Still waiting to see that to happen (The whole experience makes me kind of nervous and agitated now). Certainly, this is not a pleasant circumstance to be in because I have moved most of my stuff to this laptop + set up configuration already. It is too much of a hassle to send this back and redo every thing.Give it 3.5/5 stars for now. Stay tuned for more update!!!Question for whoever-know-the-answer: the delete button on the low right corner is integrated with the period. Sometime I tried to delete something, but it rather adds more dot to the sentences. Is there anyway to control it? Like how to switch between the two functions?Never mind, I found the answer after looking around like 5 minutes thinking about \"Where the heck is the numblock button?\" So yah, basically, numblock off = delete, numblock on = dot.P/s: I bought this when the price goes down to $475. Paid around $525 after tax. Black. Just so you know.-------------- UPDATE (06/21/2013)After the incident described in the original post, there is no further complication that occurs. The laptop works wonderfully. I guess it was just not too happy to be woken up from the box *joking*Comment about the OS: I can't believe that people hate Window 8 so much. I mean... It's just a fancy update of Window 7. Everything is pretty much the same (at least for me). Just use Start8 if you want a traditional Start button. In short, don't care about the version. Window is Window. It works.", "Date": "June 19, 2013"}, {"Title": "Just what I was looking for.", "Author": "Donna Potter \"hat lady\"", "ReviewID": "R3A0FCWWQ1MCGG", "Overall": "5.0", "Content": "It meets my needs and is pretty to look at. It is light in weight. Easy to charge. would recommend it", "Date": "June 5, 2013"}, {"Title": "Great Computer for the price", "Author": "George", "ReviewID": "R33604UMVGP0TG", "Overall": "5.0", "Content": "Now that I am retired, I prefer using my desktop computer because of the large screen etc. However, I like to have the portability of a laptop for vacations, family visits, and also a backup of all my materials. When my Lenovo laptop began to have issues, the technicians recommended the ASUS computers. I did my research, and based on the many reviews, this ASUS computer fits my needs. Although I am really just learning the Windows 8 format, I am beginning to know all the necessary functions. However, I enjoy learning new things so I am sure that during the next few weeks, I will learn something new each day. This ASUS computer seems to be one of the best that I have owned in the past 15 years.  Overall, I am pleased with Amazon's quick fulfillment process, as the computer arrived within three days.  Again, this computer is great deal.", "Date": "June 2, 2013"}, {"Title": "Very nice notebook", "Author": "Tony Bushell", "ReviewID": "R1JBT19Q2IPH3X", "Overall": "5.0", "Content": "This was a Christmas gift for my wife who absolutely loves it.I almost bought the older version and I had to cancel the order when I saw this one.Dodged a bullet there.", "Date": "February 20, 2013"}, {"Title": "I like this product", "Author": "Albert Camacho", "ReviewID": "R2DEY3PKJONR0W", "Overall": "5.0", "Content": "This is a very good computer. I like because the batteries last a long time and I have little time for connecting the machine to the outlet because I'm always working on the street.", "Date": "February 13, 2013"}, {"Title": "Lovely little computer", "Author": "Haley Horton", "ReviewID": "R3GVA6J295W9Y1", "Overall": "4.0", "Content": "This computer in white is so pretty!  The keys are black so it's very striking.  It's very slim and way lighter than the Dell laptop I had before.  750 GB harddrive is great.  Super fast.  I like everything about it.  If I were going t nitpick, I'd say the main thing I would change is the clicker on the mouse pad.  It's a little harder to push than others I've used.  It's not like a regular key on the keyboard.  The speaker is underneath, so the sound can be muffled at times if you're sitting it in your lap on a pillow or something, but who really uses their computer to listen to music at home?  I thought the shiny screen would be a problem but it hasn't so far.  I love that it doesn't have a latch closure..just shuts.  And you can do the two finger scroll like on a mac.  It's great!  Oh, and Windows 8 is no big deal.  I am not techy AT ALL and I just click the \"desktop\" tile on the start screen and it takes you back to a Windows 7 look.  The only difference is there isn't really a start menu, but it's totally manageable.", "Date": "January 22, 2013"}, {"Title": "Excellent Laptop", "Author": "Will Teegarden", "ReviewID": "R4NWALFOR1IE5", "Overall": "5.0", "Content": "Extremely reliable, long battery life, and quite fast. Works great for gaming too! This has been a very pleasant surprise $500. For those who are wary of Windows 8, once you learn a few keystrokes, it's quite nice to use in my opinion.  My only issue I had with this computer was the small RAM space available, which was easily remedied on a $40 8 GB upgrade (DDR3 1600)  I am very happy with this purchase", "Date": "January 4, 2013"}, {"Title": "The laptop itself is great but i did not like Win8", "Author": "Bakor A. Kamal", "ReviewID": "R3484Y7XGIYVKC", "Overall": "5.0", "Content": "The laptop itself is great but i did not like Windows 8. Moreover it came with complementary accidental damage warranty, which is great for me", "Date": "December 27, 2012"}, {"Title": "Awesome!!!", "Author": "R. Quintanilla", "ReviewID": "R3DRK02EQET8V0", "Overall": "5.0", "Content": "this is an awesome computer...this is my second ASUS laptop, purchased it on Black Friday and got an awesome deal, then I upgraded the ram from 4 to 8 GB. it was so simple to do, I'm so glad I got the pink one, at really wanted it just beause it a different color from my other computers, the pink is a stunning color, everyone that's seen it loved it,  the Windows 8 took some getting use to, but when you figure it out, you'll be amazed and all the new features.  I highly recommend it.", "Date": "December 18, 2012"}, {"Title": "Great brand", "Author": "Catherine", "ReviewID": "R2CN1CTH1O4A9J", "Overall": "5.0", "Content": "I purchased this laptop with it only having 4GB, upgraded it with in the week to 8GB, great brand owning THREE ASUS would buy another one when I need one.Cool to the touch not like the old school laptops very warm or almost hot when on your lap, I hardly know it is on my lap.Jump on this great price, nice look and well worth the money being ASUS.", "Date": "May 13, 2013"}, {"Title": "Sharp, fast, and elegant", "Author": "krafty31g", "ReviewID": "R23DXDUW4HV2YG", "Overall": "5.0", "Content": "I upgraded from a Toshiba netbook to this laptop, so my praise for it may be solely for how much I missed having a large laptop with better components (my netbook has about 1GB of memory.  Yeah...).From opening the box to switching it on, my first impression was the sharp appearance of the A55A.  I ordered the computer in the White color, which gives it a nice balance of looking a little like a Macbook without TRYING to look like a Macbook.  Turning it on and setting up my Microsoft profile was simple, and the computer has worked beautifully since.The i5 processor, 4GB memory, and massive HD space sets this far above others at the $500 level.As for the OS, I'm a fan of Windows 8, and this laptop was my first experience with Win8.  If you're even slightly tech-savvy, you'll find your way around the new features and added benefits Win8 has to offer.  Graphically, it's a very simplistic, elegant OS, which makes me happy.So overall, get this laptop.  You won't regret the decision.", "Date": "March 21, 2013"}, {"Title": "Got a lemon...", "Author": "Christine S. Moninghoff", "ReviewID": "R34TPVHX0WJMF4", "Overall": "1.0", "Content": "Well, I wish I could've given this more stars but...I actually returned it after owning it for only two days!  The first day, right out of the box, I kept seeing an \"ASUS Live Update\" alert and after pressing the OK button, the laptop proceeded to supposedly update and then reboot.  I knew there was an issue when the same drivers kept updating over and over.  I called technical support on day one and was told to \"reset\" the laptop.  Unfortunately that did not solve the problem.  I called technical support on day two and was told to send it back because the problem could not be solved and something must be wrong with the laptop.  I sent it back and ended up ordering an HP Pavilion g6-2260us.  That laptop has worked great so far but I just got it yesterday so maybe it's too early to say.Just a few other nitpicky things...(1) I didn't like the fact that the ASUS keyboard had no CAPS LOCK light.  (2) I think it's kind of annoying that ASUS feels compelled to place a large non-removable sticker right next to the touchpad with an \"advertisement\" of all the companies and features of the laptop.  I guess it wouldn't be so bad if it was on there while on display at your local electronics store but once you get it home, is it really necessary?  I know...nitpicky but it was very noticeable that the HP Pavilion did not have that obnoxious sticker!  (3) Last but not least...it was difficult to unscrew and remove the bottom plate to add more RAM.  I found it extremely easy to do on the HP Pavilion.Even thought this ASUS came with an i5 processor, I'm finding the HP Pavilion with a third generation i3 processor to be even faster than the ASUS.As always, Amazon was great about the return...that's the reason I bought a laptop from them in the first place!  Thank you, Amazon.", "Date": "February 23, 2013"}, {"Title": "Good Hardware, Not A Win8 Fan", "Author": "D. Boeger \"bambitheslug\"", "ReviewID": "R2FXMPGK3ZTHB6", "Overall": "4.0", "Content": "I'm editing my review. I'm still keeping it at 4 stars, but I messed up a few points before. To be honest, I was taking a quick look at everything the first time, and I was probably tired and in a rush.So basically, I originally thought there was some ridiculously large recovery partition. I now realize that's not the case. There are two large data partitions on the hard drive, and a small recovery partition. However, there is still no included recovery DVD, either burnable or on disc, FROM Asus. There are methods of recovery built into Windows 8, but it doesn't seem consistent with the online documentation, so you may have to hunt for them.As for Windows 8, I think it's horrible. If I was reviewing Windows 8, I think I'd give the functionality 5 stars as it improves upon Windows 7 and adds some cool new features, but the interface deserves 1, MAYBE 2 stars. It takes way too many clicks just to see your programs, and there are a million other weird quirks that make transitioning from previous versions of Windows an unnecessarily time-consuming chore.The hardware is good. I like the Asus quality and fantastic warranty, and the sale price was amazing. Unfortunately, Asus has apparently transitioned to one of those more \"modern\" Apple-like touchpads which don't have separate click buttons. They are built into the touchpad. This would work semi-okay like on a Mac if the entire touchpad could click, but the only clickable regions are at the bottom just like the old touchpads with separate buttons, which makes me wonder why they made the transition at all. So to click, you have to move your finger down there and press the touchpad. This motion makes it extremely difficult to not move off of your target when clicking, because the clickable regions are also part of the touchpad and will pick up your movement. It's an inherently bad design only dreamed up by someone to challenge Apple's \"OH LOOK AT ME I'M RICH AND HIP\" factor.So for, Linux Mint 14 is working great for me. The LiveDVD came up with a weird filesystem error, but after waiting for a few seconds, it was able to fix itself and load up the OS.", "Date": "December 18, 2012"}, {"Title": "Could have been so good, but ...", "Author": "Jeanette D Peppers", "ReviewID": "R3FLVN0E4O6ECI", "Overall": "3.0", "Content": "This could have been a nice notebook, but it fell short in so many ways.  To start with, it has a polished screen, not a matte screen.  I already have a polished screen laptop, and it reflects everything.  However, a Green Onion screen guard solved that problem.  Of course, that was more money.  The next problem was that it came with Windows 8.  About that, all I have to say is, \"What was Microsoft thinking?\"  This thing is a bigger turkey than Windows ME, and a lot worse than Vista.  I continually had problems with various controls being activated when I didn't want them to, and never could figure out why they happened.  I am no novice, but a computer professional, and a fairly early adopter of new technology.  Win8 might be OK for tablets, but Microsoft seems to have turned their backs on the business market.  Fortunately, I have access to Windows 7 to put on it, so I fixed that problem, too.  I replaced the hard drive with an SSD, and the computer screams now.  I still find the track pad unacceptable.  The entire track pad surface, including the buttons, are active.  Every time I go to click a button, I put my thumb on it, and the mouse moves.  It's neat looking, but not very effective.  I don't think that there is any fix for this problem.  Some reviewers said to go to Synaptics and download their drivers, but my computer doesn't have a Synaptics pad.  It is a different manufacturer.  There are a lot of features that I like, but these drawbacks are enough to lower the rating to just three stars.  I may be a little generous with that.", "Date": "December 9, 2012"}, {"Title": "Fantastic Computer for general purposes and even some advanced purposes", "Author": "Lucas Adam \"Lucas\"", "ReviewID": "R33V9F068VPAPA", "Overall": "5.0", "Content": "I bought this computer as a replacement for an old Gateway laptop. This computer is easy to upgrade (it has 2 ram bays and only has 1 4GB stick from the start, meaning that you can double the ram for about $25 and be done with it). The cooling in this computer is fantastic, it's yet to even get in the \"warm\" range. It is a fantastic school computer, and is even great at playing PC games in HD (Tested with Civilizations V, Darksiders 2, and other Steam Based Games.)I only have 1 complaint about this computer, and that is that the keys will randomly not work. By this i mean i'll be typing a sentence for a paper and there will be random letters missing from 1 or 2 words. It also doesnt seem to be any specific keys. I've heard of this being an issue for some of the more recent ASUS computers, and I'm guessing any issues like this can and will be fixed in the near  future.", "Date": "April 1, 2013"}, {"Title": "Incredibly happy with this laptop", "Author": "soccer747", "ReviewID": "R3SLLF25DGZ0VR", "Overall": "5.0", "Content": "I recently received this laptop as a gift (it was indeed purchased on Amazon), and I could not be more happy with it.  This computer is extremely fast and easy to use - especially after I added a 4GB RAM card by Kingston, which installs very easily and costs only $30 (you can find it on Amazon.)My last laptop was an ASUS, and I absolutely loved it.  This new model has been equally impressive.  I will admit that Windows 8 can be troublesome, but one can quickly learn how it works, and eventually you will grow accustomed to it.Initially I was concerned when reading complaints about the touch-pad and wireless connectivity, but I have not experienced these problems.  On the contrary, I love the touch-pad, which is quite sophisticated, and which I prefer to an external mouse, due to its many shortcut operations (e.g. 3 fingers swiping downward brings you directly to the desktop.)  And I have never had any problems with internet connectivity; I have full bars right now, despite having a router on the opposite end of my house.Given these facts, and given its price, I would highly recommend this laptop to anyone.", "Date": "March 18, 2013"}, {"Title": "Great Computer, but touchpad is wonky", "Author": "Kevin Mills", "ReviewID": "R1RYWAZCACGK6G", "Overall": "5.0", "Content": "This computer runs fine and ASUS machines are as reliable as ever, but you should really buy a mouse along with this unless you intend to mess with the touchpad's settings", "Date": "May 29, 2014"}, {"Title": "Excelent laptop. Best quality/price laptop in the market.", "Author": "Daniel Guerra \"Dan82\"", "ReviewID": "R3BZMIJ72ZGZ01", "Overall": "5.0", "Content": "It's so far the best laptop you could get for 500bucks in 2013. Now in 2014 I am very happy of the decision I made. The laptop has been working for a whole year very fine. The temperature is always cool. The image quality is so nice. The speed is really good. I totally recommend it. The mouse-pad is the only ting I would criticize but I use an external mouse and barely noticed it. If you plan to use an external mouse like me, don't bother. This is a great laptop.", "Date": "May 4, 2014"}, {"Title": "So far, I like this computer very much.", "Author": "Leslie Boling", "ReviewID": "RBKID0U8DIYN5", "Overall": "4.0", "Content": "However, I do not like window 8 and wish we had the option of getting windows 7 instead.  Windows 8 is cumbersome and NOT user friendly.  I feel you have to click a lot more than with windows 7.The computer itself is fine.  The operating system should never have been invented unless the intent was to frustrate the user!  That, of course is micro soft's fault not Asus.", "Date": "April 27, 2014"}, {"Title": "The best", "Author": "Francisco F. Fuentes \"Quito\"", "ReviewID": "R1FVSTP10NM33N", "Overall": "5.0", "Content": "I love this laptop.  I lke the finishing and materials.  The screen is good. It's bright enough.  It's very fast on startup.  Great quality at an affordable very good price", "Date": "March 3, 2014"}, {"Title": "Very nice machine", "Author": "PL Customer", "ReviewID": "R3HRV5FBU7D581", "Overall": "5.0", "Content": "This is the only laptop in the office and lots of people use it in the conference room to facilitate demonstrations in meetings. No one has reported any problems with it.", "Date": "February 5, 2014"}, {"Title": "Does what its suppose to, most of the time", "Author": "Chrisg", "ReviewID": "R1NT35JL90AIIX", "Overall": "3.0", "Content": "I ignored everyones reviews about the \"Sensitive touchpad\" DONT IGNORE THEM! Holy shiznit i have never used a computer so sensitive! It wants to scroll then stop scrolling whenever it feels like and swipe back and forth from menu to menu! But when its not doing that its doing its job so its ok", "Date": "January 14, 2014"}, {"Title": "Very Satisfied with ASUS and Windows 8", "Author": "David Nace", "ReviewID": "R3SADINJSA9AM7", "Overall": "4.0", "Content": "The ASUS laptop is a quality product and Windows 8 has many great features after you \"break the code\" so to speak.  Interestingly, we found the desk top version of Windows 8 is preferable to the tiles. The mouse pad on the ASUS is a little too sensitive and hard to get used to so we use an external mouse to compensate.  Great color choices on the ASUS as well.", "Date": "January 13, 2014"}, {"Title": "Broken Battery, Slower than my last computer", "Author": "Michael Rugh", "ReviewID": "R3TDH3JIG4EOLK", "Overall": "3.0", "Content": "My last laptop was 4 years old but $2000 at the time. This one is somewhat slower than that one but is still able to play my favorite games like League of Legends and Minecraft. It handles Netflix and Amazon Prime fine. The sound is loud. The complaints about the keyboard being insensitive are true but you get used to it. For the price, I am very happy with what I got.Pros:$500 is pretty cheap for use as a gaming laptopThe laptop can sleep for up to 8 days and start up from that sleep in about 4 seconds.Speakers are more than enough to fill a room. (though at max lvl I'd worry about busting the speakers)Cons:The computer has shut down for updates without warning twice now.The battery connection is broken. I do not know if that happened while shipping or while I had it.Insensitive keyboard takes some getting used to.Change what the sleep button does or you will accidentally set it to sleep a lot", "Date": "September 10, 2013"}, {"Title": "ASUS A55A - AH51 PINK", "Author": "Lucky Tran", "ReviewID": "R1UC4SFOYWH3HO", "Overall": "4.0", "Content": "This laptop so far only had it for a weekend, a lot of updates... which stops one another from updating. Like Asus Updates in the background, preventing Windows Updates to update.. and there are app store updates that can't update until Windows is updated.. It was a very long process. I had to wait until all ASUS updates were done before anything else could be done.But after all the updates were done, the laptop performed splendidly! The boot up was very fast after disabling everything in start up which I usually do for my PCs. Smooth and powerful. Everything is good so far.Bought this for my girlfriend in pink and the pink is a really nice pink color. The keyboard is not backlit and there are no lights for caps lock, number lock. Other than that, I think the laptop is amazing for the price!", "Date": "September 10, 2013"}, {"Title": "So far so good", "Author": "DL \"DL\"", "ReviewID": "R17D9NRGBGXIF2", "Overall": "4.0", "Content": "I have used for 3 months now.  the touchpad is sensitive, but I disabled a few settings and it is manageable.  for the price you cant go wrong.  I, like others, HATE windows 8.  I never use the stupid new tablet look.  those apps suck.  I always use the desktop view.  I didn't want to spend $100 for a computer with win 7, I just deal with what I got.The computer is very fast and does what it needs to do.", "Date": "September 7, 2013"}, {"Title": "BEST Laptop I have owned for a great price.", "Author": "Johnny S. Davis Jr", "ReviewID": "R24NZWVIU1U2QT", "Overall": "5.0", "Content": "This has to be the greatest laptop I ever owned. The finish is great! I just love it. It is fast, and has great storage. If your looking for a new laptop this is the one.Comes with Windows 8, but you will come to like it after, you figure it out.", "Date": "September 3, 2013"}, {"Title": "Windows 8 SUCKS", "Author": "Ed C", "ReviewID": "RCOF4SC9954HL", "Overall": "3.0", "Content": "This is a great little laptop.  Bought it for the wife but she complains about Windows 8 constantly.  Geez, I spent about an hour on it 1 night and totally agree.  Windows 8 SUCKS.  It totally ruins this little laptop.  If you like that crappy bloated over fluffed software then don't let that detour you from this little machine.", "Date": "September 2, 2013"}, {"Title": "It's pretty good...", "Author": "momoftwoboys", "ReviewID": "RTE15WQAO1PE6", "Overall": "4.0", "Content": "I used to use a mac book pro, so there are things I miss about mac having moved back to pc. I've had the laptop for over a month now, and for the most part, it suits my needs - word processing, internet, some design work. Windows 8 seems like it was built for a touch screen, which this laptop is not, so that's frustrating, but a Windows 8 problem. Also, one of the reasons I purchased this laptop was because I thought the touchpad was going to be like a mac - click with one finger or click with two fingers for right click, spread fingers to zoom, multiple fingers to scroll - but it doesn't. The spread fingers to zoom does work, but there is a small area at the bottom to right click and small area to left click. However, with no raised button, it's difficult to tell where this area is unless you're looking at it instead of the screen. I also can't get scroll to work for me. AND, the pad is so extremely sensitive that the slightest brush of your palm/wrist while typing will end up accidentally cutting/pasting or moving the cursor. Also very frustrating. I enjoy the color, the sound is fine unless you have it on a blanket/carpeted surface. The screen seems larger than I expected, which is great, but it's also a bit heavier than I was imagining.", "Date": "August 17, 2013"}, {"Title": "Can't Hate It", "Author": "Sara Molina", "ReviewID": "R340XQU3XDXX9F", "Overall": "4.0", "Content": "The overall look and functionality is very good even though it has given me an issue which I hope will be the only one. One day I turned it on and saw an error message saying something like \"Insert boot media\". I called the manufacturer and they said to contact Amazon for a return because I just had bought it. I contacted Amazon and they said I was out of the 30 day return window. This happened the day or 2 after the window! I went crazy! I decided to look online to see if there was any one else that had the same issue (mind you I was almost in tears). I came across one blog response that gave some instructions on how to change the Boot option. I had to press F2 while it was turning on and a menu popped up. I scrolled over to Boot then under Boot Option 1 I had to pick Windows Boot Manager. This worked! Although it has happened a couple times after that, I now know how to fix it. I just hope ASUS finds out and fixes it for other models because for a brand new computer I should not be telling the computer how to boot. Other than that the computer is a gem.", "Date": "August 15, 2013"}, {"Title": "A major shift", "Author": "Saurabh", "ReviewID": "R31BOJ2BF7H1HV", "Overall": "5.0", "Content": "My previous personal laptop was Dell 15 inspiron with Vista OS. After almost 4.5 years, it became sluggish with other issues that made me decide to go for another one. I have been a happy Dell customer (my work station is another Dell), so I was pretty much inclined to get another Dell.Couple of months back I came across an article which was some kind of survey for laptop makers & customer satisfaction. Asus was at the very top followed closely by Dell. So, now my choice was widened.Next was Windows7 vs 8. I have win7 in office and it's good. Also many people & critical reviewers have said that win8 is not good enough. After reading & understanding more about win8, I decided to give shot to windows 8. And I am very glad I did that.I have panasonic smart tv & logitech google tv revue. So, I have grown accustomed to apps, and windows 8 provide similar functionality. I don't mind not seeing \"Start\" button, when I know that moving cursor will bring me the \"Charm bar\". For me, it is like something new and the concept is actually very refreshing..maybe I was feeling bored looking at similar screen since Windows 2000. The current setup allows me to focus on the work I am doing at that moment since that fills the whole screen.With ASUS itself, this is a solid and sleek product. I don't have over sensitive touch pad. This is lighter than my previous Dell (should be too with increasing hardware density). The battery back is pretty good, almost 5 hours in Asus hybrid power mode.Asus has put in lots of stuff, though I wouldn't have mind lesser of these softwares.Overall I am pretty happy with this choice.", "Date": "August 13, 2013"}, {"Title": "This is the most amazing computer I hae ever had.  Love it", "Author": "Pansy Caldwell", "ReviewID": "R3RTCEG843XIR4", "Overall": "5.0", "Content": "I love everything about this computer.  I will never own any brand other than Asus.  Besides the technology of the computer being above all else the price is very inexpensive.  I have tried different brands of computers but this is the most advanced.  Love it", "Date": "August 11, 2013"}, {"Title": "The Best!!!!!!!!!!", "Author": "Mary E. Inghram", "ReviewID": "R391WIT2T8451P", "Overall": "5.0", "Content": "I use this all the time I never use my desk top any more. It is so fast. Also great color.", "Date": "August 6, 2013"}, {"Title": "finally my own piece of hi tech", "Author": "Love the 19th century", "ReviewID": "RKKW7XQ1M0NHU", "Overall": "5.0", "Content": "I was able to purchase a treat for myself and asked our computer guy for his opinion.  He suggested this model and make of laptop.  I discovered I could get it in pink/mauve.  It did take a few sessions to figure out how to use this updated version of IE.  I like the computer very much.  I really like typing on a good keyboard.  The laptop does not get hot.", "Date": "August 3, 2013"}, {"Title": "unsatisfied", "Author": "betty hanley", "ReviewID": "RGKQ37R0XQQ5C", "Overall": "2.0", "Content": "This ASUS is highly rated, so I gave it a try. Too many issues, mouse pad is quite a challenge and annoying.  Error msg 4310, which has to do with burning music from ITunes and remains an issue after days of tech support from different sites.  The screen freezes now and then.  Unfortnately, I am returning it and purchasing my old standby HP.", "Date": "July 27, 2013"}, {"Title": "Good", "Author": "Jiayi Zhu", "ReviewID": "R2V2ZUTAZTKEQJ", "Overall": "4.0", "Content": "A lit bit slow, but fine with others. I don't know if it is suitable for those who play games, but it's ok to me.", "Date": "July 26, 2013"}, {"Title": "Good for the price", "Author": "Jose Alejandro Morales", "ReviewID": "R36QFT44BI5BHH", "Overall": "5.0", "Content": "I bought this at the amazon warehouse (like new), so i pay less than 400 with taxes, i also bought an aditional 4GB RAM (overall less than 400 USD), the laptop is fast. I played Far Cry 3, PES 2013, Bioshock infinite without any problem and with a normal speed, COD Black Ops 2 did run a little bit slow.Pros:Good price even newVery cute laptop (white version)FastNot heavy at allCons:Plastic feels cheap.It takes time getting used to Windows 8, at the end i only use the normal interface... Never metro", "Date": "July 14, 2013"}, {"Title": "My Grandson suggested this", "Author": "Gloria", "ReviewID": "R1DXX06GHNLSK5", "Overall": "5.0", "Content": "I haven't had or used it long enough to really rate this. I ordered it because I needed a new laptop and my grandson, who works with computers felt it would be great for me since I don't do heavy gaming ,etc. I would recommend it to anyone.", "Date": "July 1, 2013"}, {"Title": "Fast and wonderful!", "Author": "Susan M. Baganz \"Silygoos\"", "ReviewID": "R15VYXPP7M82O4", "Overall": "5.0", "Content": "While it is taking me awhile to adjust to Windows 8, this laptop has exceeded my expectations. The color was deeper than it looked on the website - but I love it! The computer has been functioning well, fast, easy on, no problems at all running my programs. It was a great purchase at a great price.", "Date": "June 26, 2013"}, {"Title": "make sure you pick the right color", "Author": "Isabella", "ReviewID": "R2K42WBOG83VP4", "Overall": "4.0", "Content": "Laptop works fine. I use it for online games like maplestory and dragonnest. Windows 8 is easy to movenaround in, even though i havent even messed with the customization yet. Better than my HP laptop, HP sucks. The only problem is that i wanted this laptop in pink but i guess i must have chosen the wrong color cause it came in blue, sooo double check before making the purchase ;p", "Date": "June 15, 2013"}, {"Title": "Love My New Laptop", "Author": "Book Monkey \"Book Monkey\"", "ReviewID": "R18VV6B0PPXE4Q", "Overall": "4.0", "Content": "As a writer and editor, I needed something reliable, and this was it. Light weight, easy to get started (with the exception of getting used to Windows 8), easy to use. Sometimes the Asus applications are really slow to open (calculator or built-in web program), but the Microsoft Suite and Chrome applications work very well. I would recommend this to anyone.", "Date": "June 9, 2013"}, {"Title": "Just what I needed", "Author": "Glory Crafts", "ReviewID": "R3CC8PNZ1RLFW", "Overall": "5.0", "Content": "I run a real estate business and needed to upgrade my laptop. I chose the Asus laptop as a recommendation from a friend. My old Dell laptop was about 5 years old and was not able to process pages quick enough. This computer is working perfectly.", "Date": "May 27, 2013"}, {"Title": "Great notebook.", "Author": "Francisco Crescimbeni", "ReviewID": "R3498ZPW3UP5RS", "Overall": "4.0", "Content": "Bought it for daily use, it really fulfilled my expectations.I will soon expand the RAM to 8gb, if you think that 4gb is not enough.I have been using it for a month, and the only issue I encountered is that sometimes when viewing folders and moving files, it suddenly ends and closes those windows, without completing the task.Should I look up for it better, I think.", "Date": "May 27, 2013"}, {"Title": "I think the hardware is probably fine - Software updates have caused problems", "Author": "Yoda", "ReviewID": "R2C6PIZWRXJ8RN", "Overall": "2.0", "Content": "This is the second one of these I got from Amazon.  The first was fine out of the box, but after doing automatic updates the computer would not boot.  I talked to ASUS, and they said to send it back.  I did.The second one was also fine out of the box.  After auto updating it became unstable and will crash after 5 to 10 minutes.  I'm still fighting with it to find the problem software.  Stay tuned!", "Date": "May 9, 2013"}, {"Title": "fine laptop.", "Author": "Elchin", "ReviewID": "R1WTQN95K43YXU", "Overall": "5.0", "Content": "Laptop was new,in original box. Box was unopened. Have international warranty.Price for this deatial,for this laptop i think fine. Reccomenede ++++++", "Date": "May 7, 2013"}, {"Title": "Excellent value, no major downsides thus far", "Author": "Dan Maloney", "ReviewID": "R29N2QYWYDG3EB", "Overall": "5.0", "Content": "I went ahead and got the red one and saved $20, only thought about that is the red on the lid is pinkish pending on light but the red aluminum  palm rest is red red.Came with Windows 8 pre installed so i thought id keep it and partition to run 7 mainly. I've tried to get used to it before and hated it, if you don't have a touch screen device you're better off with 7 in my opinion.Build quality is very sound in comparison to my previous ASUS K53E. Everything feels very solid physically. The palm rest and area around the keyboard are metal the keys and screen bezel have a flat feeling finish. The touchpad is large but unfortunately has rocket buttons and has a dry feeling, which to me gives you less pointer precision and is slightly uncomfortable. Screen is brilliant and bright. Something very important to me is that while the power jack isn't the ideal type it is VERY sturdy, also getting ~4hrs battery life.Physical things i would prefer to be different: glossy screen back, rocker bar on touch pad, and differently finished touchpad.When it comes to power this computer is an excellent value. A 2.5Ghz hyper threaded dual core processor and 4GB of 1600 Mhz ram should be plenty for most application. Drop $25 on another 4GB and you're be running anything you want with ease.The integrated hd4000 graphics were a delightful surprise compared to hd 3000. Enough gpu power for moderate to light gaming such as MMO's and some other less demanding games. Don't expect to play battlefield or crysis smoothly on this. Also nice to be able to change dedicated VRAM in bios to 512mb.Other thoughts: low rpm HDD, considering replacing optical drive with an SSD. Wish screen back was metal, but that would just bump the price.Would definitely buy this again and recommend this model to others", "Date": "April 28, 2013"}, {"Title": "excellent for the price", "Author": "mark specyal", "ReviewID": "R2DBHZ92PW2P00", "Overall": "5.0", "Content": "got this for son for collage he really loves it and for the price we paid was perfect for him", "Date": "April 18, 2013"}, {"Title": "Excellent laptop and great price", "Author": "Rony Boscan", "ReviewID": "RZU6IU9TLW09D", "Overall": "5.0", "Content": "This laptop is amazing, packing so much and at a good price, with high performance, no heating, nice graphics and sound. Overall this laptop has met all my expectations. ASUS delivers.", "Date": "April 10, 2013"}, {"Title": "it is great", "Author": "CHARLES A CASEY", "ReviewID": "RP1EJZG7SK7SP", "Overall": "5.0", "Content": "it is all I wanted to keep me intouch with friends any every day work and paying my bill's and paying games", "Date": "April 7, 2013"}, {"Title": "Great Laptop, Booyah!", "Author": "N. Mihalich \"Neil\"", "ReviewID": "R3KOUTZ8MSSZ32", "Overall": "5.0", "Content": "So I purchased this bad boy because I was looking for a well rounded computer. I got it with this one. My only complaint is the LED screen. I can see the lines on the screen (pixels I guess). Other than this this thing is sweet. It's fast, easy to upgrade, easy to set up, and the USB 3.0 is lightning fast. I am very happy with this purchase. ASUS makes quality products and I will continue to purchase from them. I have an ASUS tablet as well and I know that the company is up to date on the latest technology needs of the consumer. Multi-tasking is a breeze. I can listen to music while downloading/uploading, burning a dvd, writing a paper or transferring files via USB. The keyboard is great, easy to clean and type on. CD drive is fast and I can't say anything about the touchpad because I use a wireless mouse. I have never been a fan of the touchpad for any laptop. All around, I am so happy that I got this computer and I hope that it last for many years more than my HP did. By the way, motherboards on HP computers are junk. They fry really easily. I always use a laptop cooler now, but this laptop doesn't get very hot. Ok, so anyways, I love it!!!", "Date": "March 31, 2013"}, {"Title": "Very good", "Author": "Javier Martinez Siles", "ReviewID": "R2MK59SZOHDPKS", "Overall": "5.0", "Content": "Very good. The procesor is fast and resolution is excellent. I love it. I recomendation this item. Windows 8 is good.", "Date": "March 26, 2013"}, {"Title": "Good Notebook PC", "Author": "Wayne Maden", "ReviewID": "R4F536UKCAXZ2", "Overall": "4.0", "Content": "This particular model I ordered was for my wife, she picked it out. However, it does come with the new Win.8 system on it.  I personally do not like win 8, I prefer the more established business like operating systems instead of the social networking styles as this OS appears to me. Outside of that, it seems to be a very fine machine.  Had an issue about a program that was loaded on it without the licensing documentation but I agreed to a solution with Amazon(seller) to a resolution to that.If you like win8, then I's  say this is a good buy.  Not sure, but I think you can get a different OS if you want to.", "Date": "March 20, 2013"}, {"Title": "Buy something else", "Author": "mxUser", "ReviewID": "R209UEEMLHNVTQ", "Overall": "2.0", "Content": "I would like to review it higher but the touch pad is the worst that I have ever used. It is really difficult do a simple click without some unexpected behavior. Also, windows. 8 is too heavy for this lap.", "Date": "March 17, 2013"}, {"Title": "Love it", "Author": "Jacque Tiegs", "ReviewID": "R25ZYD0GK3HJ4K", "Overall": "4.0", "Content": "great price, works good, but trying to figure out Windows 8 is a pain. But I love the computer a lot", "Date": "March 16, 2013"}, {"Title": "Great laptop for the price", "Author": "Robert Wrobel", "ReviewID": "ROLFGHF06EY9J", "Overall": "5.0", "Content": "Hardware is everything I expected and more.  Windows 8 does take some getting used to.  The learning curve was more than previous versions of Windows.  I am glad I had another system in the house to take of business while learning how to do things on Windows 8.", "Date": "March 11, 2013"}, {"Title": "I love my laptop", "Author": "Nato Nonikashvili", "ReviewID": "R1049YPIEB15UX", "Overall": "5.0", "Content": "It's a great laptop for this price. Red color is very nice, It's exactly for girls. I really love it. I like w8 too. It's very nice. Laptop is very fast and battery works very well. I am very satisfied.", "Date": "March 10, 2013"}, {"Title": "Windows 8 a challenge", "Author": "melissa", "ReviewID": "R2DS5E2XXE0U41", "Overall": "4.0", "Content": "The PC is great, learning curve not so much.  A Windows 8 for dummy summary should be sent with each purchase.  Was not happy to see that Windows 7 was not provided.", "Date": "March 8, 2013"}, {"Title": "Overall ok", "Author": "Jeffrey Ong", "ReviewID": "R25ECIS6DH9HYX", "Overall": "3.0", "Content": "Nice product but I din manage to sign up the warranty online. Not sure if it is system error or what.", "Date": "February 27, 2013"}, {"Title": "Wireless sign weak", "Author": "Leslie Wilson", "ReviewID": "R3UF6XU9P9K4VE", "Overall": "2.0", "Content": "ASUS A55A-AH51-WT 15.6-Inch LED Laptop (White)I have always liked ASUS products. I bought this computer becase of the good specifications and great price. However, the wireless sign gets very weak if I am not in front of the router! And if I move to other room I simply loose the sign completely.This is very, very dissapointing, since having no internet makes the computer almost useless for many of the tasks that I have to do during the day. The computer was delivered in California, but I live in Costa Rica. I called Amazon Costumer Service but for changing this computer I would have to pay sending it to the US and then the delivery back to Costa Rica. Is this cost worth for a $500.00 computer? I asked Amazon, as an alternative to solve this issue, to replace the broken part (Atheros AR9485) and I was willing to pay for the transportation from the US to Costa Rica, but they were not willing to do so...", "Date": "February 18, 2013"}, {"Title": "I am pretty happy with it", "Author": "Alex Pyle", "ReviewID": "RY1JZFSBPLA0O", "Overall": "4.0", "Content": "When I first received my laptop I was very frustrated with Windows 8 and the Asus Live software updater.  It was shutting down every 5 minutes or so and I started to panic a little.  I called Asus support and he walked the through the steps of fixing the problem. It turns out it was a bad operating system so we reinstalled Windows 8 and I have not had a problem since.Except for the initial problem with Windows I am very happy with my new Laptop.  I have had it for about a month now and use it on a daily basis.", "Date": "February 18, 2013"}, {"Title": "Should have done research before buying", "Author": "J. Pugliese \"Busy Mom\"", "ReviewID": "R2JWHNHFIXM1LE", "Overall": "3.0", "Content": "I assumed that all products by Asus were well made and operated as they should.  This laptop drops that internet connection several times a day.  My old Dell never did this.  Other then the connection issues, it is fine.", "Date": "February 8, 2013"}, {"Title": "good product", "Author": "Marina", "ReviewID": "R1SB3AIHZC285D", "Overall": "5.0", "Content": "I bought this laptop on Christmas and so far I do not have any problems with it. Good quality, fast, has enough memory.", "Date": "January 29, 2013"}, {"Title": "great", "Author": "Kenya R. \"BostonGirl\"", "ReviewID": "R12EQUXMXB8NLB", "Overall": "5.0", "Content": "This is everything I expected.  I don't love Windows 8, but it'll probably just take some getting used to.  But the computer itself it awseome", "Date": "January 28, 2013"}, {"Title": "Wireless Internet Problems", "Author": "R. Langill", "ReviewID": "R22LZLAAXS2TJK", "Overall": "1.0", "Content": "Keeps dropping the connection 2 to 4 times per hour. I disabled the firewall, anti-virus and changed the power settings. Good luck with this one. Is it windows 8 or the A55A?", "Date": "March 18, 2013"}, {"Title": "Great piece of hardware.  Lousy OS.", "Author": "Kim Sheets", "ReviewID": "R26QQBDT5UCMDK", "Overall": "5.0", "Content": "This is one of the most solid, well built computers I have ever owned.  It has tremendous amount of disk storage, connects to the internet almost instantly and is overall a very fast machine.  The only drawback to it is Windows 8.  I absolutely HATE Win 8.  It is not intuitive at all.  I cannot get it to start up in desktop mode so everytime I boot up I have to switch from tiles to desktop.  You have to look around to find where MS has hidden some of the basic features.  Windows 7 would have been so much better on the ASUS.", "Date": "March 14, 2013"}, {"Title": "Very satisfied", "Author": "Kenny Kang", "ReviewID": "R33Z2DV8NTTV2P", "Overall": "5.0", "Content": "First, my biggest concern was the reliability of the computer. I have read/heard many awful stories about blue screen/non-functional displays/over heating/ poor packaging etc. This computer is very reliable. Very fast with i5 3210M 2.5GHz, Light weight. Well packaged. Promptly shipped. and Definitely affordable with its processor. It only has one SATA-III drive port (very easily accessible) but you can always replace the optical drive with an HDD. The computer has two sockets for memories for those of you who want to upgrade that as well. Wish it had a back-lit keyboard but I can type w/o, no problem. Heard about the touch-pad issues. Not a problem with this computer. All in all, very satisfied.", "Date": "March 5, 2013"}, {"Title": "Overpriced for nothing exceptional", "Author": "Deer Hunter", "ReviewID": "R2SH863VMBVK07", "Overall": "3.0", "Content": "I am not a computer genius or anything, but this laptop and the OS (Windows 8) are nothing special. I thought I was getting an amazing laptop for a great deal on cyber monday. It was $480 lightning deal ($520 after tax). It was regular priced at $599, so I just had to buy even though my other computer is perfectly fine. I would not recommend this computer if it were actually priced over $500. The mouse pad is way too sensitive. The webpage I am on will disappear if my thumb even touches the pad sometimes. The main menu always pops up. Its stupid, I don't even know why there is that apps menu. The desktop setting should be the main setting, not a bunch of apps. This is not a tablet or iphone, so whats up with all the apps? The screen does have good clear picture for movies and tvshows etc. The sound sucks because the speakers are on the bottom of the computer. My old laptop (toshiba) has better speaker placement on top of the keybord so you can actually hear. The speakers are not that big of a deal though because I use HDMI cable to hook up to my TV to get better sound. DO NOT spend more than $500 for this computer. There are better ones out there for that price. A couple of months after purchasing, I still perfect to use my toshiba over the Asus for almost everything. The one exception is for watching movies.", "Date": "December 13, 2012"}, {"Title": "Favorite computer I have ever owned.", "Author": "Andrea Munzer", "ReviewID": "RRUBTBBACF5Z6", "Overall": "5.0", "Content": "I was skeptical about buying a laptop. This is my first one. Did some research, with the help of a wonderful geek friend who explained the importance of processor type to me. For my money and my needs, this ASUS is wonderful; beyond expectations. Being a sexy red color helps too.", "Date": "April 23, 2013"}, {"Title": "notebook can't connect to internet.", "Author": "Samuel C. Tamayo", "ReviewID": "RKK7IJMSBW3DP", "Overall": "1.0", "Content": "i just opened the box and i tried to install all apps. when i tried to set up my internet connection, it will not connect. i called asus tech support andl was not able to resolve the problem. they want me to send the notebook for repair in california which is unacceptable since i just received the notebook not even for an hour. i am sending it back.", "Date": "February 8, 2013"}, {"Title": "Wish I could give -ve 1 Star", "Author": "Disappointed Customer", "ReviewID": "ROHMC8YY72DKX", "Overall": "1.0", "Content": "I never thought this would happen to me but it did, the machine came on time, packaging was good, machine was in excellent condition. Little did I know what was under the hood would not be worth the paper the warranty card was printed on. An error message came up, after rebooting that was it, It never booted. It gave an error message \"PXE-E61 media test failure\"on a black screen. After research it said it was a network boot, go to bios and change boot sequence to DVD or hard drive as primary. Did that and now you just hear the fan come on, HD, battery light, power light that's it... Blank screen. Thank you Asus for spoiling it for me, never me again. Sincerely Disappointed.", "Date": "September 25, 2013"}, {"Title": "lotop", "Author": "pescador2004", "ReviewID": "R2ACCA1JUJV7LA", "Overall": "5.0", "Content": "it work nice and I love it is a very good loptop I will recommended to my friends is a very good product", "Date": "September 16, 2013"}, {"Title": "dont buy", "Author": "Michael Rojo", "ReviewID": "R2D49IW6NZKMVS", "Overall": "1.0", "Content": "out of no-where my entire hard drive was shot and now the entire computer wont work, even took it to three computer repair shops. No way to fix it.", "Date": "September 10, 2013"}, {"Title": "Great laptop", "Author": "Dennis", "ReviewID": "R20TU0PRAABEVC", "Overall": "5.0", "Content": "ASUS will not provide any guidance and will not support additional memory installation.  WE purchased the extra 4GB of RAM but have no guidance or installation documentation.", "Date": "July 12, 2013"}, {"Title": "Great computer for the price", "Author": "Marisa Ramos", "ReviewID": "R3UJ4GPLTR8FN9", "Overall": "5.0", "Content": "A friend asked me to purchase a computer with a specific price point and this met all his requirements. It was a gift so I didn't actually use it.", "Date": "March 20, 2013"}, {"Title": "Great combination buy for X-mas", "Author": "whooplash", "ReviewID": "R3DXBZYG73333P", "Overall": "5.0", "Content": "Above average laptop.  Want to know how to make this a great value.  Buy a 512 Gb SSD and upgrade the memory capacity.  The speed increases 10 fold.  Don't get me wrong it is a great price as is, but sometimes \"you have the need for speed\".  And with the brother HL-2270dw laser printer you can not go wrong.", "Date": "December 20, 2012"}, {"Title": "If only it worked", "Author": "CompGeek812", "ReviewID": "R9IFT7QI6XI7H", "Overall": "1.0", "Content": "I got this laptop as a present for my wife. She loves pink and her old laptop is getting on 6 years so its way past time she get a new one. For the price this seemed like a great deal but I've received two units and am currently in the process of returning the second, this time for a refund.The first unit I received had numerous problems. Every time the computer would boot the ASUS update utility would try to run and would freeze the computer. Eventually I reset Windows 8 and the update utility would still freeze but wouldn't freeze the computer and I'd just kill the process.The mouse pad was a special kind of hell where it would randomly pick up movement even when you weren't touching it. So anytime you would type it would spaz out the mouse which would run all over clicking on random things making you re-select the field you were trying to type in to begin with.The wifi card is fairly strong, when it works. On my model it would keep losing connection until I disabled it and reconnected. This happened every ten to fifteen minutes, sparse enough to keep you trying to surf, often enough to make you want to throw the unit at the wall. The unit suffered from a few other oddities such as freezing up randomly.The second unit I received didn't suffer from quite so many maladies but had its fair share. The mouse pad still acted up but was usable most of the time. However the wireless card was still pretty bad. Every few minutes it would stop loading pages however instead of saying it'd lost connection it would just refuse to load pages. Disconnecting and reconnecting usually fixed the problem otherwise we'd have to restart the laptop.I used to be a really big fan of ASUS but between this model and some other recent experiences I've had with the brand it saddens me to say I'll be shying away from it going forward.However this experience has made me extremely glad I shop for these things at Amazon. While it does suck that I can't handle the laptop before purchasing, the return policy for defective units is the best. I've had similar experiences in the past with big box stores that just ended up extremely frustrating, but I don't ever get that with Amazon.tl;drCrappy mouse pad and unreliable wifi will drive you crazy, buy a different laptop.", "Date": "June 14, 2013"}, {"Title": "Had to return this thing TWICE! HORRIBLE", "Author": "REN REN \"Ren\"", "ReviewID": "R2SXSFW0VSJWFR", "Overall": "2.0", "Content": "first one I bought had a broken touch pad, the second one crashed within 3 hours of using it. Had to return it, def not worth it...two buggy computers....", "Date": "December 4, 2012"}, {"Title": "I have had two turn to brick within a 2 months", "Author": "Will Shoemaker", "ReviewID": "R2NS485K04WHEO", "Overall": "1.0", "Content": "I just got my second one sent to me after having to send the first one back after turning it on maybe 4 times in the first week. The two problems with seemed similar in the fact that I could turn it on, but it wouldn't get passed the ASUS splash screen before giving an error that required a disk, which conveniently enough it doesn't come with. I called ASUS tech. support for the first one and wanted me to ship it to them and pay one-way shipping, so I didn't bother with them a second time. Amazon is great on returns and I will just look for a different laptop. For whatever reason I have had two duds :\\ which is very annoying in that I need a laptop for school. Long story short, in about one moth I have had to send back two of these from bombing. I'm going to assume it's a Windows 8 problem and not ASUS.", "Date": "March 28, 2013"}, {"Title": "Great for the price", "Author": "JackJack", "ReviewID": "R3QMYZW4HEBAOO", "Overall": "4.0", "Content": "At $479 this is a great laptop. My only real issue is the touchpad.The first unit I received the touchpad would completely lock up when plugged into AC.Amazon had a replacement to me within 24 hours which was awesome!Now the touchpad works perfectly but seems to have a little give when you tap it.It seems to be a build quality issue and doesn't affect operation at all but you hear this loose sounding vibration when you tap the pad which is really annoying.Otherwise a great machine.", "Date": "May 11, 2013"}, {"Title": "Blame Microsoft, not Asus", "Author": "Richard J. Garcia", "ReviewID": "R2DS0KMUDTMJRI", "Overall": "1.0", "Content": "I got this laptop for my girlfriend and it was a complete mistake.  Not due to Asus, I'm sure that it would be a nice computer if I put Windows 7 or something else on it.  However Windows 8 is every bit as bad as you have heard plus more.  Stuff randomly pops up if your cursor gets too close to the edge of a screen, nothing is consistent with what you have learned about Windows in the past, etc.  Things just seem to randomly happen and then you waste time to figure out the \"solution\" to a problem that shouldn't have happened in the first place.  For example, a unit converter program kept popping up (ie inches to cm) for seemingly no reason.  Why?  Who knows, it's just one example of many involving Windows 8.  If they offer a Windows 7 version of this product buy that instead.  I really can't say enough about how much of a frustration Windows 8 is.", "Date": "May 6, 2013"}, {"Title": "Not pleased at all", "Author": "Amazon Customer", "ReviewID": "R3NVBOWSZSM3UU", "Overall": "2.0", "Content": "I hate Windows 8 and am sorry I wasted money on a laptop that came with it.I also hate the fact that the mouse pad seems to have a mind of its own.", "Date": "May 5, 2013"}, {"Title": "Im to old to learn new tricks", "Author": "cindy", "ReviewID": "R1GC00QUDA7BF4", "Overall": "5.0", "Content": "I assume this is a great laptop.  All reviews I have read from tech magazines says that its one of the best under apple which I could not afford.  Anyway I did not get to use the laptop much.  I had problems with windows 8.  So I sent the laptop back.  Other than that everything went great!!!!  Now Im searching for a laptop with windows 7.", "Date": "April 17, 2013"}, {"Title": "This laptop stopped working", "Author": "K. Gefroh \"kimg\"", "ReviewID": "R1ECEO5FBHFDJK", "Overall": "4.0", "Content": "I originaly gave this a 1 star but now I am giving that review to Amazon not the computer-  I bought this in November on a lightening deal.  We didnt set it up until the end of Janurary.  I used it about 10 times and then it completely stopped working.  Our IT guy can't even get it to start up.  I guess I only had 30 days to return it so it looks like I'm stuck with a laptop that won't turn on.  If I had bought it at Best Buy or a store I could walk in with it I wouldnt have this problem, I know they would take care of me.  I have never had a problem with an Amazon purchase that wasn't easy to return so I didnt think twice when ordering from them.  I won't buy electronics from Amazon again.Update...I called the toll free phone # on the Laptop box and spoke with Chris.  At this point it looks like ASUS is going to fix my computer at no charge.  I will update on service when complete.  I did like this laptop the little time that I had to use it so at this point I can't give a bad review.  I understand that it is electronic and things happen.  I won't give a bad review for something going wrong as long as they are willing to take care of the problem, but boo on Amazon!", "Date": "February 11, 2013"}, {"Title": "CRAP! CRAP! CRAP!", "Author": "Kapahulugirl", "ReviewID": "R1TFUWE0K2PDIE", "Overall": "1.0", "Content": "This will be the second ASUS product in our household that did not work properly and had to be returned. I don't have much more to say that would follow the guidelines and get me banned from reviews so I'll just say WINDOWS 8 is JUNK!", "Date": "January 1, 2013"}, {"Title": "It stinks", "Author": "Manuel L Medeiros", "ReviewID": "R2ZP1AALVOOMWP", "Overall": "1.0", "Content": "This system 8 really sucks you find your self in places you can't get out of and half to shut down and you start typing and touch some thing and find your not where you started and have a mess I wish I would have got and Apple. You can bet I will have and Apple the next time I buy one I don't care how much it cost me.", "Date": "July 7, 2013"}, {"Title": "Asus computer with Windows 8", "Author": "RACHEL L", "ReviewID": "R3TCKC4GD50MZ3", "Overall": "2.0", "Content": "I use my computer for e-mail; shopping; and games. You have to be really careful about the cursor mover on the computer. It is very sensitive and will take off what you were doing. You can get it back easily. But the most frustrating thing is when I am playing a game, the screen turns white and interrupts your game. And it comes back very slowly. It happens throughout the game. I would really like to know how I can stop this. Other than that, the computer is easy to use. The keyboard is soft and easy to use.", "Date": "November 19, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009MBC2HW"}}