{"Reviews": [{"Title": "Ubuntu works on it.", "Author": "Craig R. Crabtree", "ReviewID": "R6KTKL6BXVYY9", "Overall": "5.0", "Content": "Please let me add another perspective if I may. I set up a dual boot with W8 and Ubuntu 12.10, and this was my experience:PRO: Keyboard is excellent for typing relative to other laptops.  Build quality is good, not dazzling.  It has horsepower. The price/performance ratio is superb.  It's quiet and light.  W8 is quick and responsive, 'a nice fit with the laptop.CON: Battery life is under three hours.********UBUNTU Installation:********1. Beginner level - One can easily replace W8 with Ubuntu doing a USB install. Everything except the screen brightness control works right out of the box.2. Intermediate level - You can do a standard dual boot install but will have to change back and forth between W8 and Ubuntu each time by going to the BIOS and selecting the respective boot loaders. Google to find how to add a line that will let you adjust the brightness.3. Advanced level - To completely solve the brightness issue, upgrade to the Linux 3.7 kernel. (It takes 5 minutes, 'simple instructions using a script. Google it for instructions.) You can also get the dual boot to work well by working with grub a little.Bottom line: this is a relatively powerful product at a very good price. W8 and Ubuntu both work well on it. Don't expect an ultrabook and do expect to play with it a little to set it up like you want.'Enjoy.", "Date": "January 20, 2013"}, {"Title": "Great for the price, but not much more.", "Author": "Mike", "ReviewID": "R2RGQ316Z8GNIM", "Overall": "2.0", "Content": "Structural build quality: Poor. The design of the system is quite portable; its as thin as most other ultrabooks, and feels like the perfect size for a 14\" laptop. However, it lacks the structural integrity of more expensive ultrabooks. The entire body is very poor quality plastic, not comparable to even the lowest-end Thinkpads like the x120. The hinges scare me quite a bit; it has a good opening and closing action, but they just don't feel secure.IO: Good. The keyboard is very nice, easily the best feature of the product. Full size and great key placement (I compare this to the x120, which switches the position of the CTRL and FN keys; not good). One minor key on mine tends to stick down every once in a while. The mousepad is okay. Its very spacious, but lacks distinct physical buttons, instead opting for the full pad clicking action found on other models. The selection of ports is great; the addition of an ethernet port is a very welcome addition considering how few ultrabooks have one these days. The machine also has a very small physical button on the left of the machine which will cause it to boot straight into the BIOS/boot menu; a *very* cool feature for those who tinker a lot.Screen: Average. The resolution is mediocre, at 720p. Brightness is not overly impressive. The brightness keys have the capability of turning the screen off, like MacBooks, a feature I quite like. Every once in a while my screen will \"flash\". I have not been able to conclude if its a hardware problem or a problem with Ubuntu, but it is so rare that I haven't had the opportunity to see it but out of the corner of my eye.Battery: Ten lightyears beyond abysmal. In Windows 8, I was averaging around 2 hours. When I installed Ubuntu, that number dropped to 1 hour 10 minutes average. This is on medium brightness, and very low load levels. I could squeeze out another 20 minutes if I disable WiFi. The battery is exposed and user replaceable; another welcome feature compared to other ultrabooks. However, I can't find *anyone* that sells a replacement, let alone a unit with upgraded capacity. Not even Lenovo; the S405 is not even listed on their available model list, with the closest model being the incompatible S300.Performance: Average. Again, for the price, I was pleasantly surprised. Day-to-day usage, such as internet browsing, is perfectly fast. I was capable of loading World of Warcraft on the machine, and managed to log between 20-35 FPS on low/medium settings. Boot time is acceptable on both Windows 8 and Ubuntu. For those who care: The Ubuntu install process was very painless, with no EFI or driver problems to report.Overall: Do not buy. I was able to obtain this machine during a sale for much less than what it is currently priced. However, even at that lower price, I cannot recommend this machine. I have not experienced any of the unique issues which plague some other users on Amazon, so my experience and conclusion was formed with a fully operational unit. Even then, I would be scared to recommend it even at half its current price. Purchase with caution.", "Date": "January 22, 2013"}, {"Title": "Not a Tech-Person But I Like It", "Author": "jassvduck", "ReviewID": "R2502WY34PGXNE", "Overall": "4.0", "Content": "This is by no means a fancy Apple product or similar. It's a very basic (for 2013) laptop that will serve the average laptop user's needs perfectly.It's lightweight, the sound system is excellent (note there appear to be speakers underneath laptop. Can still hear very well), and the design is very sleek and attractive. In fact it looks so much like my roommates MacBook that I occasionally confuse the two, until I pick hers up and realize it's so much heavier.I primarily use my computers for basic Internet stuff, as well as watching Netflix, Hulu, etc. The screen resolution (that's the right word, right?) is perfectly adequate and a darn sight better than my last laptop (4 years old now). I am sure you could get something better on a pricier computer, but everything is still clear, crisp, and very watchable. There's very little issue with images becoming too dark when you tilt the screen slightly, which is nice because you don't constantly have to adjust either your angle or the laptop's.The ergonomic keyboard actually does help with my carpal tunnel in that I don't notice an increase in pain level after hours of use. The Intelligent Touchpad is decent. I know it has to walk the line on touch sensitivity, so I can't fault it too much for not always responding when I \"tap\" to get it to click on a link etc.The battery life is fine. I've not tested it to full potential yet but I've gone a good 3+ hours watching Netflix/Hulu on it without it needing to be charged. It does, however, eat up battery if you just close it and leave it unplugged. You have to put it on Sleep if you don't want to wake up the next morning and have less than an hour of battery left.Windows 8 took a bit of getting used to and frankly I'm still not convinced I like it. Not the laptop's fault.I wouldn't recommend this laptop for anything outside of the basic stuff. If you need a laptop to play games, to install a lot of programs, and whatever else people do on computers these days (I'm far too young to sound this old), then move on up the line and spend the money to get what you need.I got this on sale when I just really needed to replace my old (and nearly dead) Dell. I am happy with it. It does what I need it to do, while also being light, attractive, and easy to transport.", "Date": "January 31, 2013"}, {"Title": "DOA But Later Revived", "Author": "Frugal Shopper", "ReviewID": "R147FHJ5TWSVPF", "Overall": "3.0", "Content": "Directly out of the shipping box I received the following message \"Unable to install windows, please restart your installation. . .,\" but this was easier said than done, due to no onboard DVD drive, much less a Windows installation disk or product key.  To Lenovo's credit, however, I was able to quickly reach a live technician via their support number, who steered me to a \"hard reset\" button just beside the power button but on the side of the case.  This commenced a relatively problem free Windows 8 installation.  This was the 3rd one I had done on three different laptops.  It apparently restored from files stored (along with drivers, digital manual, etc) under a hard drive partition marked \"Lenovo.\" The next problem was inability to link to WiFi due to an IP configuration error.  Lenovo tech support did not do so well this time, promising me a call back Christmas Eve morning, which has not been received roughly 36 hours later.  Luckily, however, the next WiFi site I tried (with an ATT U-verse rather than a cable modem) connected just fine.  The machine worked well, once I figured out how to disable the silly Windows 8 \"Tile\" startup screen and get back to a classic style windows desktop.  The only remaining problem as I am writing this is that the onboard webcam is not being recognized, no luck in re=installing the drivers.  The machine gives an error message regarding an \"unrecognized USB device, which I am guessing is the camera.  More to follow as this situation unfolds.  Despite all this, I actually  like the machine, since it is both light but big enough to have a 14 inch screen and boots very quickly.UPDATE: Factory repair replaced the motherboard and it worked great, but this was way more work than a brand new machine out of the box should require.  I am still also curious whether or not this is a quad core chip, as advertised.", "Date": "December 25, 2012"}, {"Title": "Poor Man's Ultrabook - A Great Bargain", "Author": "Steven L. Petillo \"Steve - Chicago\"", "ReviewID": "R2DP2SSJSPGIOW", "Overall": "4.0", "Content": "Pros: Great Price ($329!), Solid Construction / No Flex Keyboard, Handy OneKey Lenovo Rescue System, Surprisingly Peppy A6/HD 7500g Processors, .83in Thick & Looks Great.Cons: No VGA port (HDMI), Battery Life.Summary:I bought this laptop primarily for running accounting and desk top publishing software....to work on the go and to start getting used to Windows 8.Although I was already familiar with this AMD chip series, I was surprised at how well the peppy A6 handled the programs I through at it. I even went as far to install MW3 on it just to see how it would handle games. MW3 looks and plays great without hick-ups or stuttering. I didn't buy it for gaming but it's nice to know it can handle a graphic intense game like MW3 if you want it to.It doesn't have an optical drive but at this weight and thickness, you wouldn't expect it to. And although you can't call it an Ultrabook since it's powered by AMD and running an old school hard drive, it looks and in many cases performs better than many Ultrabooks.Many users have complained about the battery life and certainly, it's not very good. But keep in mind Windows 8 is a pretty big power draw since it's constantly pulling data to keep your Start screen populated. Toss it in airplane mode and adjust the screen brightness and you'll see a noticeable increase in battery life. Or go even further and slow down the processor when you don't need it at full performance.My only real complaint is that it's missing a VGA port so I'll need to pick up an HDMI to VGA converter to use any of the monitors I currently have.Bottom Line: At around $329 it'll make most people very happy.", "Date": "June 3, 2013"}, {"Title": "Very Light!", "Author": "David A. Greenberg", "ReviewID": "R1YCDX9DYOPRR1", "Overall": "4.0", "Content": "This is a very light laptop.  Works well.  No concern other that trying to figure out Windows 8!  Average battery life.", "Date": "March 20, 2013"}, {"Title": "Solid", "Author": "A. Marrero \":)\"", "ReviewID": "R14RPPB4TAD6TS", "Overall": "5.0", "Content": "It has being working great up to now.  It is very light and portable.  Windows 8 takes some getting used to.", "Date": "February 24, 2013"}, {"Title": "Lenov0", "Author": "Shirley Hendel \"Shirl The Whirl\"", "ReviewID": "R16F9JXZMSVIVR", "Overall": "2.0", "Content": "Cursor way too sensitive....screen enlarges with very slight touch.  Too much back and forth to go from one IP to another....and there were NO instructions on how to use it.............I probably wouldnot repurchase this machine.", "Date": "March 15, 2013"}, {"Title": "blows", "Author": "Wes Hensley", "ReviewID": "R1BHIYUPH6TJKB", "Overall": "1.0", "Content": "Shipping and service excellent. Product is terrible. Starting with Windows 8, the worst operating system ever.  Keyboardis near perfect, as expected, however, the mouse is inaccurate. The unit crashed 5 times in a week with no programs installed and defrag run twice on both partitions. Stupid on my part, I didnt notice it lacked a dvd drive. Useless without it to me.", "Date": "January 16, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "AMD Dual-Core 2.1GHz A6-Series APU for Notebooks\n4 GB DIMM\n500 GB 5400 rpm Hard Drive\n14.0-Inch Screen, ATI Radeon 7600 Graphics\nWindows 8, 5-hour battery life", "Name": "Lenovo S405 14.0-Inch Laptop (Silver Grey)", "ImgURL": "http://ecx.images-amazon.com/images/I/41zN-ANrAoL._SX300_.jpg", "ProductID": "B009AEPH00"}}