{"Reviews": [{"Title": "Computer", "Author": "Sunny H", "ReviewID": "R3PXITW9UV359G", "Overall": "5.0", "Content": "good quality for the money. Easy to use and looks great. Bought it for a ten year old boy who has had no problems using it.", "Date": "January 18, 2013"}, {"Title": "ok", "Author": "The Marine", "ReviewID": "RTQT2OU80IQ93", "Overall": "3.0", "Content": "its ok for the price but there is nothing that really that special about the product only got it for my Nana because she needed a new computer so she would write me daily while Im deployed.", "Date": "January 18, 2013"}, {"Title": "muy buen producto toshiba satellite", "Author": "darwin guatarasma", "ReviewID": "R1705FMACPUUIY", "Overall": "4.0", "Content": "muy buen producto, cumple con mis expectativas y requerimientos, producto llego a tiempo y en excelentes condiciones por parte del vendedor, se los recomiendo para futuras compras.", "Date": "January 14, 2013"}, {"Title": "New Windows 8 Computer", "Author": "Michael J. MacCarroll", "ReviewID": "R1VNAURSOBLARX", "Overall": "4.0", "Content": "Unable to download the free Windows 8 for Dummies. I could use the help for this totally different operating system.", "Date": "January 12, 2013"}, {"Title": "Staying Stressed", "Author": "Wyolene Reed-Parker \"reedy777\"", "ReviewID": "R137XMPD3GC6Q0", "Overall": "3.0", "Content": "This has taken some getting used to.  I had a slight problem when I first got this and had to call Customer Support but the support was in India.  True!!  They couldn't understand what I needed and told me they could send out a guy who could re-install Windows 8 but it would cost me a lot of money to do so.  I told the guy no way since my computer was brand new.  I figured I would leave it alone and call one of my friends who knew about computers.  But, in leaving my computer plugged in and on, it came on all by itself.  I suppose it just needed being charged up.  It took a lot longer than I had expected and it was very frustrating.  I gave my previous computer away and regretted it but now I am getting used to using this new computer.  I would have preferred just turning it on and having it work right away without stressing me out.  It is a nice computer.", "Date": "January 6, 2013"}, {"Title": "Pretty good for the price", "Author": "PerfectPeach", "ReviewID": "R24YKUBXHJOM05", "Overall": "4.0", "Content": "I bought this laptop for my daughter as a Christmas present.  I'm not a fan of laptops, so i'm basing this off of the things she's told me.  Overall it works great for the price.  Got this as a lightning deal on black Friday so the price was significantly lower than retail.  It comes equipped with windows 8, which we don't like at all.  It is not like any other windows OS and it is not intuitive.  I do not like the preinstalled apps either.  If I wanted a tablet or ipod, I would have bought one.  It runs fast, starts up quick.  The keyboard seems a little junky, so she is going to have to be easy on the keys.  Battery life is good; lasts for a long time before having to be charged.  Brightness on the screen has to be adjusted when moving between the battery and A/C power.  The webcam is cool; it can take stills or record video.  We only had it for a few weeks but so far so good.  We'll add additional info as we learn to use it.", "Date": "January 6, 2013"}, {"Title": "Christmas Present", "Author": "Belinda Qualls", "ReviewID": "R36H0G0U0576O8", "Overall": "5.0", "Content": "My husband and I gave this to his mother for Christmas.  She was so surprised and has enjoyed learning touse it.", "Date": "January 2, 2013"}, {"Title": "Its A'IGHT...", "Author": "Thien Nguyen", "ReviewID": "R1J500FNYQW2HA", "Overall": "3.0", "Content": "I am currently using the laptop only for school purposes and it is so far holding up to the task. The problem is that when I try to listen to music, the laptop takes forever to play a song and don't even start with movies. The pad turns on and off (lucky I have an extra mouse that I just bought). Don't even think about games, this laptop cannot handle League of Legends on lowest quality so if you are a college student like me but wants to play games with the same laptop, look somewhere else.", "Date": "December 26, 2012"}, {"Title": "Laptop Bargain", "Author": "judi wolansky", "ReviewID": "R3G8L43MVDUF8Q", "Overall": "5.0", "Content": "Everything I expected, on time at a great price.  A black Friday special.  I am very happy with the deal I got.", "Date": "December 26, 2012"}, {"Title": "Basic laptop, poor sound. Windows 8 makes it sloooowww. AMD chip not as fast as Intel. OK to buy only if under $250.", "Author": "AmazonDiva \"Keep Calm and Carry On.\"", "ReviewID": "R38JDWZUEQJRS1", "Overall": "3.0", "Content": "The title says it all. This laptop would have been ok as a basic laptop if it did not have the clunky Windows 8 software that slows everything down to a crawl. You'll have to add more memory if you want to use Windows 8. It was an ok buy at $240 as I wanted to spend the least possible for a laptop to surf on the couch and just leave it there.As others have mentioned, this is not the best laptop for portability and you will be better off looking at Chromebooks and slightly higher price point Asus/Acer etc. This is not even a desktop replacement as it is way too slow and not too responsive. I bought another Lenovo for my teen that was slightly over $300 with an Intel dual core processor and similar specs but it is much, much faster, as it runs on Windows 7. It also has a better build quality and some nice Lenovo extras like ThinkLight and Fingerprint reader. The only reason I did not go for the Chromebook which was at a similar price point is that I wanted to use MS Office on this laptop and be able to burn CDs/DVDs if needed.The laptop would have not been half bad with Windows 7 but Windows 8 is top heavy and slows it down to a crawl. Even email takes a while to open. It is even slower than a 10 year old Dell that has been knocking around the house. The first thing you need to do is get rid of the Toshiba bloatware and uninstall Norton, and use some other virus softwares that don't slow down the system as much. I bought add-on RAM memory today on another reviewer's suggestion, let's see if it gets any better with it!One other note on Windows 8. This O/S is really meant for a touch screen computer, it is very inconvenient if you're just using the mousepad as the side bar keeps popping up every time I am scrolling down a webpage. Typical Microsoft. Windows 8 needs at least 6GB of RAM to perform with the speed you are used to from Windows 7, and then to load it on a system with a 2GB AMD chip is just wrong.Overall, get this system only if the price is below $250. I rated it 3/5 as I did get it for a lower price. Had I paid over $300 for it I would rate it 1.5/5.", "Date": "December 3, 2012"}, {"Title": "DO NOT BUY THIS LAPTOP", "Author": "Riccardo Di Blasio", "ReviewID": "R3RHCR0EFHS18U", "Overall": "1.0", "Content": "I work in IT and I did one big mistake (at least I admit ). Mistake has been to trustt that Toshiba can make a product for $330,00 capable to run such heavy weight operating system like Windows 8 (one of the worst OS in the market for me btw...) + another heavy weight like Norton, with a miserable processor like this AMD. Buyers should be warned about this. Better to spend some more money and buying an Apple (as I will probably do) or a Chrome one, rather than lock yourself in a supe slow old bag like this piece of plastic. Stay far as much as you can!!", "Date": "December 28, 2012"}, {"Title": "WINDOWS 8 is the WORST SOFTWARE EVER SOLD!", "Author": "Roger Tavares", "ReviewID": "RVBJTMENTV2W3", "Overall": "1.0", "Content": "Any word other than THRASH would be a compliment to this garbage! DON'T BUY ANY COMPUTER PRE-INSTALLED WITH WINDOWS 8!", "Date": "February 21, 2013"}, {"Title": "Don't ever buy Toshiba Laptops", "Author": "rufusQ", "ReviewID": "R3L6WQ6WFGPWFR", "Overall": "1.0", "Content": "My brother and I bought Toshiba laptops different models, his from Toshiba mine from an electronics store. Both of the laptops malfunctioned and are useless!Store and Toshiba won't stand behind them for repair or replace even while under purchased warranty. They argue there is nothing wrong with the laptops.", "Date": "December 15, 2012"}, {"Title": "Do not buy", "Author": "lash", "ReviewID": "R3HQW9NYRBD2TX", "Overall": "2.0", "Content": "I just bought this and will return it, for the product was not built from specs and if you want a little look into the inside of Toshiba just give them a call.  They want to sell their product not satisfy the customer.  They will lie and cheat you so do your self a favor go else where.", "Date": "December 3, 2012"}, {"Title": "Still on the fence", "Author": "tercel", "ReviewID": "R333G5KGHAD812", "Overall": "3.0", "Content": "Couldn't give it more than 3 stars because performance wise it wasnt elite a bit slow if you ask me.Couldnt give it less than 3 becuase bought it on sale $260 I think so pratically a give away at that price.Had it for a few days and I liked it but gave it to my bf since he was in need of one.The most pressing issues were its slowness but like many other reviewers stated that can be fixed by adding memory and the sound from the speakers are quite low and horrible .Apart from that no real issues I can think of .Btw windows 8 on this thing is highly annoying.Bottom line I dont think I would purchase it again.", "Date": "April 7, 2013"}, {"Title": "Great for kids..", "Author": "Angela J. King \"ajk\"", "ReviewID": "R2AQJOC7JFGBS0", "Overall": "3.0", "Content": "We bought this for our teenager. Smaller kids use it..pretty easily! We HATE Windows Vista 8.. It demands updates all the time..and will cut u off from what u r in the middle of doing!  Grrrr..", "Date": "March 17, 2013"}, {"Title": "nice", "Author": "proud momma", "ReviewID": "RVMTEKP1GHZVS", "Overall": "4.0", "Content": "Good first laptop for a teenager. Sending him off with a good computer.had to purchase microsoft proogram. Did not come with the computer.", "Date": "March 16, 2013"}, {"Title": "cheap cheap cheap", "Author": "jeremy gravelle", "ReviewID": "RTYBD07S86BKP", "Overall": "1.0", "Content": "horrible product.  bought for christmas, and it already died!!!!  cheap plastic body, and horrible harddrive which died in 2 months....do not buy this computer", "Date": "February 18, 2013"}, {"Title": "Horrible design/material construction", "Author": "K. Calderone", "ReviewID": "RBZ55VWJ0T0WU", "Overall": "1.0", "Content": "This thing is a real piece of junk.  I type 100 wpm in short spurts, and the lack of support under the keyboard slows me down.  The whole keyboard flexes in the center as you type.  And I really hate the Windows 8 operation system.  It's only a matter of time before there's probably no getting away from that - but for the moment, I spend as much time waiting for the system updates to configure as I do computing on the thing.  Not only would I not recommend this to a friend, I've gone out of my way to tell people not to bother.  I won't be buying another Toshiba product again anytime soon.  And I should have known better than to buy a low-end product without putting my hands on the keyboard first.", "Date": "January 20, 2013"}, {"Title": "Functional for only 4 months!", "Author": "Joan R. Laves", "ReviewID": "R10GSA04DU9FA6", "Overall": "1.0", "Content": "We purchased this laptop in August, and by December, there was a blurry splotch in the screen.  We sent the laptop back, hoping to have a working laptop by school again, but they told us that it would cost $325 to fix it.  Sleezy practices, and working for a short time;  will I purchase ANY Toshiba product ever again?  NO WAY!!!!!", "Date": "January 13, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009FX5CY2"}}