{"Reviews": [{"Title": "This is a very good lap top that I had simpatico with immediately.", "Author": "Neuro-felicity \"another student of the brain\"", "ReviewID": "RJKXOQCBR3UVZ", "Overall": "5.0", "Content": "I am surprised at the negative reviews of this little lap top. It is attractive and more importantly worked out of the box. After booting, I went immediately to Windows update and downloaded 61 updates and all loaded successfully. This little beastthen recognized my other system computers and downloaded music and software for various printers. I have been able to load and run older versions of Microsoft Office, Dragon Naturally Speaking,download video and music from the Teaching Company and and Amazon as well as update Skype..... The keyboard is perfect for my ratherweak touch, but not overly sensitive. Multiple open programs work quickly. I was expecting that an i3 would be slower and have hesitancy with all that I threw at itbut it just churned on. I have not tested the HDMI port yet but will update the review later.One reviewer mentioned that the Windows 8 update would be problematic, but I don't think so. I see also that the links for the 15 dollar rebate AND the Windows 8 upgrade for 14.99 have been restored and I was able to register this computer at Dell Advantage.. no problem.The service tag is present both on the box AND below the battery. A manual of the computer's specs can be easily downloaded at DELL.I really do see more rapid data transfer with the USB 3 ports. There are  four USB ports not three and the aforementioned  HDMI.This is my sixth or seventh Dell computer in the last several years. While they all have some  battle-scars (mostly due to my travel and bad habits) and a few naggling problems; they all can still function.This computer is the least priced with the most power and ease. The sound is a bit weak and tinny but is easily remedied with a stereo connection.Thus, I would rate this computer an outstanding value, working well out of the boxand exceeding expectations. I am uncertain if the Windows 8 upgrade will be a benefit or an aggravation as this computer segued into our home network Windows 7 premium with ease and perhaps unnecessary updates are just that!I sympathize with those that received a problematic or DOA computer. Last year the same happened to me with another internet vendor (Tiger.....)and it really has taken a lot of time and effort to deal with it.My opinion would be to give this laptop a try: Amazon will always back up their warranty and it would not be difficult to ship a defective unit back.Good Luck!Update: I just tested the unit with respect to  the HDMI port functionality. I went online and streamed a lecture I had downloaded from the Teaching Company. I then projected via the HDMI port of the 15 R 5110 to a Sony internet TV. The laptop performed extremely well in both connecting to the WIFI and streaming in real time and the HDMI port to the TV via a generic Amazon HDMI cable. There were no buffering issues, hesitations or drop outs and the quality of the picture was excellent. I had to fiddle with the Sony TV controls a bit to get the audio to come thru, but when it did it was excellent. The quality was equivalent to the AV output I get from my Blue ray disc player playing ordinary DVDs. No complaints. I hope this is helpful for all of those who have doubts about this little i3 laptop. I am not a gamer but laptop is a good companion and appears to be very reliable to specs. It does not run hot. I posted a review of the generic 15 R 5110 from May 2011 in the comment(3) section of this review. I hope this helps.", "Date": "December 1, 2012"}, {"Title": "Just what I ordered", "Author": "M. Finn", "ReviewID": "R128O3XLR9VD0Q", "Overall": "5.0", "Content": "Got this a few days ago when I ordered it from a black Friday deal(yeah so that offering was not a scam, some people did get one). It was a Christmas gift so I wasn't planning on opening it. After reading the 4 reviews for the product on 11/29 I decided I better open it and check it out...cause if it can go wrong, it will...that's my luck.Anyway, I opened the box with a fair amount of trepidation, and it was in there, so far so good. Next I unpacked it and plugged it in waiting for the blue screen of death, smoke, hard drive clicking, a total lack of activity, or anyone of the myriad of other signs indicating issues with the product.Well after holding my breath for a few seconds the machine started right up, went through its initial use procedure, got online through my network and is now being updated. PERFECT, works great! No ISSUES. Was just what I ordered and arrived as described. Now I can't guarantee it will still be working in a few months, but right now I am a very satisfied buyer.To address issues in other reviews:1) I bought it with windows 7, it came with windows 7, I didn't buy it for any windows 8 upgrade special so no points off there.2) Not repacked came new in a sealed box, no points off there. I must point out that one reviewer complained that no one checked his laptop to make sure it was configured correctly prior to shipping and another complained that his had been opened, so it comes down to how do you please everyone? Me, I want mine unopened please.3) A reviewer said his did not work, mine did so no points off there. Who knows maybe he forgot to hit the start button. This one doesn't automatically turn on when opened unless it's already been turned on...hey I've seen weirder things than that, like the guy who emailed brighthouse from his home computer to complain he couldn't get online from his home computer.Bottom line I have a working Dell I3 with 750GB hard drive, internet access, and it is a 15.6 in laptop running windows 7. I have what I ordered, it works fine, so 5 stars.", "Date": "December 2, 2012"}, {"Title": "crashes every week, Dell touchpad doesn't always work", "Author": "Dannyboy", "ReviewID": "RRDMY1YI0GLFN", "Overall": "1.0", "Content": "See UPDATE below, dated 3/24/13. Original review 12/12)I needed a basic laptop that was less than $500 and was dependable. I went through no less than 3 expensive HP laptops (around $2500 each) that were all lemons in less than 2 years, and had to hassle each time with the company from which I purchased them because I also bought an extended warranty. After my 3rd HP laptop crashed for the second time, I decided to buy a relatively inexpensive computer from Amazon.This was $470 with free shipping. I bought the Dell Inspiron because I really like my Dell home computer which is also an Inspiron but has a wireless keyboard. This laptop loaded up in no time at all. In less than 10 minutes I was on my work website and printing to my wireless printer. It already had MS Office 2010 installed, so all I had to do was enter in the product key. I purchased MS Office 2010 from Amazon for $94 and it came on a disc and allows downloads to 3 PCs.This laptop has a 15 inch screen which is larger than I really needed. For this reason, it's also a little heavy, but that doesn't bother me. Today I sat in an easy chair with the laptop on my lap and, surprisingly, it never got hot after working for 9 hours from home.I like the keyboard and large touchpad which gives my wrists plenty of room to rest while typing. If there is not enough room for your wrists to rest, the wrists end up resting on the edge of the laptop and can get really uncomfortable. This laptop doesn't have that problem.The one disadvantage I found, which may not be a problem for most, is that the power cord plugs into the left side of the unit. While it's still 8 feet long, with the plug being on the left side and my outlet located to my right, it didn't quite fit into the outlet located across the room. I solved this problem by plugging it into a surge protector (which will no doubt be better for the unit to protect it from surges). I still don't like the cord hanging over my legs, it would have been nice to have it plug on the right side or in the back. I consider this a minor nuisance.It is Windows 7 and has a CORE-i3 which is plenty fast for the work I do. The keyboard doesn't light up, but the display light is bright enough so it doesn't need it, even in dim overhead lighting. It has more memory than I'll ever need, and also has DVD/RW.I'm happy with my purchase. I'll never waste my money on expensive computers, especially HP, again.UPDATE: 3/24/13I am sad to report this computer is a LEMON. It crashes every week when I am in the middle of a program, despite my running Webroot Spysweeper daily before I power it off. It crashes in different programs, like MS Word, my work program, amazon.com, etc. The Dell touchpad also fails to work many times, despite my changing the sensitivity. It is frustrating to try to scroll down, only to have the screen stay in one place. Maybe not all of the Dell Inspiron laptops are lemons, but I certainly bought one. Next time I'll stick with local Best Buy and get the warranty.", "Date": "January 4, 2013"}, {"Title": "Nice keyboard, works great", "Author": "Amazon Customer", "ReviewID": "R36TV8T1ZNS2OZ", "Overall": "5.0", "Content": "This has one of the best keyboards of any laptop I have tried. I type 50+ words a minute and this keyboard helps to reduce mistakes. I never hit the touch pad while typing. That was a big problem with an HP laptop that I used to have.", "Date": "December 22, 2012"}, {"Title": "Love my laptop!", "Author": "Kekai", "ReviewID": "R1622CKKZO2PBA", "Overall": "5.0", "Content": "I ordered my computer on Jan 8 and it was delivered on Jan 16, that is super fast for an order from Hawaii, with free shipping!  The computer arrived in excellent condition, brand new.  I plugged it in and followed the prompts and was ready to download my programs and use my computer within 2 hours.  The keyboard is a little too flat for my liking but I can get used to it.  The cursor jumps all over the place but I will find a fix I'm sure.  Good deal for $472, free ship to Hawaii, 6gb ram, 750 hard drive and intel i3 processor.  I love it that it came with Windows 7 since I'm not ready for Windows 8. Will update review later.PS...to keep cursor from jumping all over when typing, press Fn and F3 keys to lock the keypad.  Good to go!", "Date": "January 17, 2013"}, {"Title": "Screen became white in three weeks", "Author": "T. Sen \"Ted\"", "ReviewID": "R3IDC1Z82VISZ6", "Overall": "1.0", "Content": "I purchased this laptop the day before Thanksgiving and had waited for 6 days. After calling Amazon customer service several times and hearing a different story from each Rep. finally found out it had never been shipped out of Amazon Warehouse.There was a UPS tracking created but they didn't have any left in the warehouse. After fighting and using different kind of languages with Amazon Customer Service Reps, suddenly they had it in the stock and gave me the lightening deal and plus an extra discount and send it to me next day with no charge.I received it 9 days later from my original order and since my old Toshiba laptop was dead for almost a month, I kind of destroyed the box in the opening so I am not sure if the seal was original.As soon as registering with Dell, I tried updating to Windows 8. Again I had to call Microsoft, since I didn't receive their e-mail with the upgrade link to Windows 8. Technician spent about 20 min and run the download after purchasing (14.99) the upgrade (haven't received the rebate from Dell yet, probably it will be another call). After a small challenge in the restart I was able to set up Windows 8 and start enjoying the laptop.This is a great laptop for the price definitely. For someone like me who is a Toshiba laptop user, I was surprised to see the quality in the screen and keyboard. I3 processor with 6GB Ram, should be enough for everyday using and again it is very good deal for the price. Bluetooth is an extra which I appreciate a lot, since I like to use my Bluetooth headphone most of the time when I am watching sports ( so wife doesn't complain about the none sense noise !).I saw another version of this laptop in Costco with little bit better features and processor it was $750. (it was windows 8). Please bear in mind that this laptop's list price was $699.I will update my review later on and change my rating if necessary, since I am expecting to use this laptop for couple of years. Hopefully I will not have to change the brand again.Update 12/21/12:After 22nd day of purchase, screen lost all the color in the task bar and became all white. I called Dell customer service and they said since it was more than 21 days after the purchase, they can replace with a refurbished lcd screen. No way I could accept a refurbished part on three weeks old laptop, I returned it to Amazon and decided not to buy any Dell computer in my lifetime. Dell is a lousy laptop manufacturer for Retail Consumers.One addition, Amazon advertise 15 dollars rebate from Dell next to the price tag. This is not true. There is no way you can get that rebate. I called multiple times and spend maybe around 10-12 hours on the phone with Cust. Reps. who has first no idea if there is a rebate, then check and learn and still do not know how to proceed and keep you wait for 20 min minimum and then calls dropped.", "Date": "December 1, 2012"}, {"Title": "Dell never disappoints!!", "Author": "Never received!", "ReviewID": "RNECIVVZVHFS5", "Overall": "5.0", "Content": "Bought this at on Thanksgiving as a lightning deal.. Yes, I'm so happy with it, considering what I paid! It works great so far, and my husband loves the camera, as we're able to skype while I'm away.  It's fast, has everything needed for standard use, and well worth the money!!  Have always loved Dell computers, and again, no regrets!  I highly recommend this laptop, and you won't be disappointed!!!", "Date": "December 2, 2012"}, {"Title": "Started off well...then...", "Author": "J. Oakley", "ReviewID": "R2IJZ4CFFDXJD7", "Overall": "2.0", "Content": "12/18/12  So, I did my homework and compared features,reviews,and prices. I have to admit,I was a little concerned about some of the reviews on here for the Dell Inspiron i15R-1633sLV 15.6-Inch Laptop, but it was so well rated everywere else that I had to consider it. It well fit my budget at $459. (I was willing to spend up to $700) I intentionally only looked at laptops with Windows 7 as I have an old engraver that will not work with Windows 8 and I needed the CD ROM/DVD player to run my old software.  (I have a mobile business and did not want an external drive). I do not pretend to be a computer expert...far from it...I have very limited knowlege and a fair amount of anxiety when it comes to computers!So, my laptop arrived today. From the time I started to open the box until the time I was finished with set up it was less than 45 minutes. That included adding my wi-fi,wireless printer and preferred search engine with all of my settings. The set up process was a breeze! It recognized and connected to my wi-fi instantly. I have opened several windows at a time, watched videos with Facebook open in another window, and downloaded some documents without any hang ups, freezing, or buffering. In other words, I have intentionally tried to create the same problems that my old laptop used to encouter.I am finding it fast and easy to use. It has many new features that I have not yet explored but my initial impression is wonderful! I will update my review later if my opinion changes!12/26/12 So, here's my update....The first night,all was well....since then I am having connectivity issues....sometimes I cannot stay connected for even 5 minutes....I spent some time on the phone with tech support last night and it did not fix my problem....I spoke to our internet service provider this evening and they are coming out to check their equipment tomorrow. (Even though our other wireless devices are working fine)....If that doesn't fix it,I will give tech support one more try...Even using my phone Hot Spot within a foot of the computer it disconnected some...(Too expensive to run that way anyway...)1/3/13... We have had 3 long calls with Dell tech support with them making adjustments in the computer, once even going into my router to adjust settings. I have also had my internet provider out to check our service. One Dell tech tried to tell me that I needed to keep it within 10-15 feet of the router. (Why not just wire it in? Why have a laptop?) I am trying to not send it back because I have now downloaded Microsoft Office and had my engraver hardware installed. (So purchasing a new one will cost me about $200 for my software again!) They are suppose to be sending a Tech to my house tomorrow to change out the wireless card \"Änd something else\"....In the mean time, my old HP (+/- 5 years old) can sit right next to it and maintain it's connection just fine! I am frustrated! It they do not fix it tomorrow, it will go back for a refund! I just hate to eat the cost of the software again! Grrrrrrr", "Date": "December 18, 2012"}, {"Title": "Great purchase", "Author": "Linskey", "ReviewID": "R3GV1WL6W23MJU", "Overall": "5.0", "Content": "I didn't have any of the problems other reviewers talked about for this Dell. It's a lot of bang for the buck, with 6 ram and a 750 gig HD and four, not three, usb 3 ports. The wifi seems so far to be just as good as my HP pavilion laptop. I haven't had a single problem so I'm quite happy with my purchase. If anything comes up later, I'll come back and update - but right now I have no problem recommending this Dell laptop. I  was actually looking to stick with Win 7, so that was part of my decision to get this one. Right now, however, there is still  a free upgrade to 8, if that's what's stopping you! My only complaint is that right away windows wants to do a gazillion updates. But that's par, isn't it?", "Date": "December 16, 2012"}, {"Title": "After the wifi issue was resolved, everything was great!", "Author": "John Dunphy", "ReviewID": "R139KURHPZ0T2S", "Overall": "4.0", "Content": "I was surprised to see so many posts online about there being wifi issues with Dell Inspirons, which was discouraging (also, kind of weird. Not something you expect to be a problem out of the box). However, after about an hour on the phone with a very helpful tech service technician from Dell, we had addressed that and now I am enjoying my new laptop. I am moving from the Macbook Pro I used the last 2.5 years for my job. To be honest, I don't feel like I am losing that much. The battery life is the biggest difference, going from about 5 hours to about 2.5. Also, the screen is not nearly as vibrant but it's by no means bad. Unlike the last PC laptop I bought several years ago at Walmart (the cheapest they had), this thing is blazing fast. I have not lost any speed or performance moving from a $1500 Macbook to a $450 Dell PC. Like I said, the Macbook was for work, so I didn't pay for it. And, after purchasing this computer, I definitely would never pay that ridiculous amount of money. It's not worth it.Yes, it's a lot heavier than my 13\" Macbook was but so what? Also, one definite positive so far is it does not get scorching hot like the Macbook did. Seriously, with that aluminum casing, that thing could leave red marks on bare legs. This so far has kept its cool, even while I was watching Youtube, Netflix, listening to music, multi-tasking, etc. Hope it lasts!", "Date": "January 5, 2013"}, {"Title": "Computer never worked", "Author": "L. Parr \"Worried Pet Owner\"", "ReviewID": "R2TGS5G0Q20W55", "Overall": "1.0", "Content": "The laptop arrived with no damage to the box or laptop, however it would not turn on.  Dell sent a tech to work on it.  He checked the power supply first and then was going to replace the mother board.  However the part box was marked refurbished-if  I had wanted a refurbished computer I would have bought one, so I refused the part.  A clip holding the power supply to the mother board was missing-it was not broken during shipping it was never installed.  When I asked Dell to just replace the laptop assuming it may have other problems-they refused. I returned it using Amazon's policy which worked great.  I would have absolutely no problem with the Amazon's service.  I am still looking for a new laptop but it will not be a dell.  I have a dell desktop and could not have said enough good things about it but now if anyone asks I tell then anything but a dell.", "Date": "February 6, 2013"}, {"Title": "Great computer", "Author": "Ashley Wilson", "ReviewID": "R3J8796UVVGNVT", "Overall": "5.0", "Content": "So far this is a great computer. It is running greatly and I havent experienced any problems with it so far.", "Date": "February 1, 2013"}, {"Title": "Great", "Author": "Vixky", "ReviewID": "R2BKEUUDDG50B0", "Overall": "5.0", "Content": "I love Dell products, and this laptop was not the exception! It's cute, practical, the OS works great, no complaints at all. A good laptop all around.", "Date": "January 30, 2013"}, {"Title": "Luxury Laptop", "Author": "Ronald R Meador", "ReviewID": "R1PJRLOYML38J1", "Overall": "4.0", "Content": "I enjoy the great response and performance the product offers. It is way above average in both areas. The case design is pleasant to the eye while presenting a toughness of steel. I DO NOT like the \"\" bloatware\" that comes loaded on the system. I would like to be given the option of choosing my own preferences. Overall I am greatly pleased with the product.", "Date": "January 30, 2013"}, {"Title": "Good Product overall", "Author": "Hipolito Diaz", "ReviewID": "R3QHT5S8O031M2", "Overall": "4.0", "Content": "Exactly what I expected and on the expected date. Description is the same as the item received and It was packaged accordingly.", "Date": "January 28, 2013"}, {"Title": "Great home laptop for the price", "Author": "Sarah", "ReviewID": "R1F5WVB6NIX8UT", "Overall": "4.0", "Content": "After seeing other reviews about wireless connection issues for this computer, I had some reservations. But I decided that it was a good match for my budget and that I could probably change the wireless settings if needed to make things work. Not surprisingly, as soon as I had the computer set up I started having internet connection issues even though my previousDell laptop (now 6 years old) and other devices in the house do not have problems staying connected. I called Dell immediately and they instructed me over the phone how to change several of the wireless device settings. Since that time, the internet has been working great. Sure, it was a pain to reconfigure those settings, but it only took about 25 minutes total and everything else with the computer works very well. I am definitely pleased with the purchase.", "Date": "January 27, 2013"}, {"Title": "Laptop", "Author": "Arnold M. Culbreath", "ReviewID": "R3QRE18Z6WOJLV", "Overall": "5.0", "Content": "It is a great little laptop.  it started right up and everyhing so far has worked very well.  My daughter wants one now.", "Date": "January 26, 2013"}, {"Title": "Look carefully when making your descision", "Author": "Jamie W", "ReviewID": "R1X3E6R5K90QZD", "Overall": "3.0", "Content": "Have only had the laptop for a short time and have been mostly pleased.  I purchased as new and it is clearly NOT a new laptop but a refurb but for the price I was mostly ok with that even though Amazon sold it as new (I considered returning but decided to just keep it).  I use mostly for internet and some light duty work and it does well for that.  The battery life is not great so if you need something that you can spend the day working on away from a plug, look elsewhere.", "Date": "January 18, 2013"}, {"Title": "Not great", "Author": "The Otter", "ReviewID": "R30G2VXHKS9IKT", "Overall": "3.0", "Content": "I have ordered 3 Dell desktops and one laptop previously to this model.  I wanted to order a Dell because of the ease of ordering replacment parts and getting support.  But I wish that I had not ordered this computer.  As other reviewers have mentioned, the sound from the speakers is very tinny and not good.  And even more disappointing is the poor internet connectivity.  Compared to my old Inspiron 1501, the signal is much weaker on this computer.  I was concerned about the screen going black, but found that was only the screen saver going black after the default setting of one minute.  I don't find this computer to be any faster than my old AMD Athlon processor.  And the built in mouse is very sensitive and in the road.  I quickly bought a wireless mouse to use. Even though the price is good, I recommend looking elsewhere for a different model.  It is cheaply made. The DVD drive is not sturdily made.", "Date": "January 16, 2013"}, {"Title": "Perfect for personal use", "Author": "Adrian Arias", "ReviewID": "R3QAOATP4DL60N", "Overall": "4.0", "Content": "It is perfect for personal use, if you are not a professional designer it will works for you. Have good RAM and good Hard disk space.", "Date": "January 16, 2013"}, {"Title": "Excellent Laptop", "Author": "Anonymous", "ReviewID": "RP8ZZT9SFXW55", "Overall": "5.0", "Content": "This laptop is gorgeous in person, the keyboard is great, and the trackpad is actually in the middle of the keyboard and not off to the left like every other laptop made in the past few years, and there's tons of RAM (6GB) and storage (700GB).  Awesome computer at any price, but even better under $500", "Date": "January 15, 2013"}, {"Title": "Decent Computer", "Author": "Julie Kotek", "ReviewID": "RR8PQO882STBT", "Overall": "4.0", "Content": "Have only had this computer for about a month, but so far so good.  Maybe a bit slow and battery life not the best.  But other than that, I am satisfied.", "Date": "January 13, 2013"}, {"Title": "Not bad for gaming", "Author": "JuJuBeans", "ReviewID": "R1Y22CGBDGLENG", "Overall": "4.0", "Content": "I bought this for my husband as a Christmas present this year to replaces his old one which overheats and is on its way out. He very much enjoys this laptop for a few reasons: It's design is very sleep and pleasing to the eye. Even I had to admit that it is FAR more attractive than any of the laptops I've ever had. Good job on the design, Dell. The processor is an i3, so it's not an Ultrabook, but if you're looking to get some gaming done, like Assassin's Creed III, Call of Duty, or Medal of Honor, this will meet the needs and play it well. I'm curious to see, however, how the speed holds up over time, but thus far we are definitely pleased.", "Date": "January 9, 2013"}, {"Title": "Not all that great", "Author": "Mat", "ReviewID": "R2FID0RE4NCLXV", "Overall": "3.0", "Content": "Its a nice enough laptop for the money, but right out of the box the disk drive open button is busted, So I called dell for help and after an hour of trouble shooting dell decides to send a new disk drive in the mail for me to install. They offered to have a tech guy come to my home and install it for me which is cool, but its something I can easily fix on my own", "Date": "December 29, 2012"}, {"Title": "keyboard didnt work", "Author": "Bijoy Chellan", "ReviewID": "R1WUFR5M0S9E7U", "Overall": "3.0", "Content": "I brought this from amazon and found to my dismay that the keyboard didn't work, and that too after contacting dell customer care and making sure that the keyboard was just not working..it is hard to believe that the keyboard may have gone bad during shipping considering the type of shockproof package that it  came in..dell promised to send a technician to replace the keyboard but i dint want that I called amazon and amazon promptly took back the product...but i was wondering why in the world would dell technical staff forget to check the basic things in a system before they put an 'inspected' stamp on their products..i had 2 other dell systems since the last 4 years they never had any problems except i had to replace the hard drive recently which is quite normal considering the usage. Iam little disappointed with Dell this time", "Date": "December 26, 2012"}, {"Title": "Gift for daughter a big hit!", "Author": "Jim R", "ReviewID": "R3IHWSEXK6AZO", "Overall": "5.0", "Content": "Our daughter's laptop, which she used for her work, was worn out!  We got this for her Christmas and she absolutely loves it.  The memory, storage capacity, built in camera and other features are great.  The price was very reasonable for the product.", "Date": "December 26, 2012"}, {"Title": "Great laptop", "Author": "Kiwisteph", "ReviewID": "RI4BOH1DYGDYV", "Overall": "5.0", "Content": "I have been using a Dell for the last ten years, and decided to go with this one not because I love the brand but because it provided the best value for money at the time of my purchase.  I mainly wanted this computer for video calling and basic word processing functions.  It is performing extremely well straight out of the box.  I was on a skype call within an hour of receving the laptop by UPS.  I have also just watched a movie with streaming video and it worked very well.  The only difference between this laptop and my other Dell is that I am finding the mousepad less resopnsive on this model, but it is most likely due to a slightly different design and I will get used to it.  I would recommend this machine to anyone with medium use requirements.", "Date": "December 24, 2012"}, {"Title": "Wireless Connectivity Awful", "Author": "Waning Crescent", "ReviewID": "R3MXFXM5DTQU2H", "Overall": "1.0", "Content": "I bought this laptop for my daughter.  It found our wireless network OK but then it would constantly connect/disconnect over a period of several minutes such that it was impossible to download anything.  I have several DELL computers including one that I use for work that is entirely wireless.  They work fine.  This computer definitely has a faulty wireless card.  I just received the computer today and am sending it back tomorrow.", "Date": "January 11, 2013"}, {"Title": "Very unhappy", "Author": "Sandy", "ReviewID": "RG8EM9PAALYC4", "Overall": "1.0", "Content": "Computer came on time, started up fine, everything looked good.  Second day? Wouldn't start, wouldn't even get to the start-up screen.  My wife ran through all the troubleshooting procedures, and still nothing.  I took over, and ran through the advanced recovery operations.  I finally got the computer running again with a complete system restore back to 'factory settings', but it is still having issues.Continued...I managed to get the computer running, but now it takes several minutes (more than 5) for the machine to go from 'on' to operational.  Everything is dead slow, from running apps to going on the internet.I am sending it back, and will probably never buy a Dell again.", "Date": "December 26, 2012"}, {"Title": "Could have been a decent laptop but wireless connectivity is terrible", "Author": "M. Umali", "ReviewID": "R31YRVPRDLL40W", "Overall": "1.0", "Content": "This laptop was bought to replace a four year old laptop using Windows Vista.  It has a nice clear screen but that is about the only positive.  The keyboard has also malfunctioned occasionally.  The worst problem is the wireless connectivity.  I have been experiencing problems similar to what other reviewers have mentioned with the connection to the router being disrupted every few minutes.  We have tried the troubleshooters but have had no luck. We will double check with our ISP but I feel this is not the problem since our 4 yr old machine is connecting fine as well as our other wireless devices (Ipod touch).", "Date": "December 30, 2012"}, {"Title": "Mine was re-packaged", "Author": "mani", "ReviewID": "R3VOWJ2XWVE4L7", "Overall": "1.0", "Content": "Bought this on Black Friday. The laptop was delivered on time. Even though it was supposed to be new, it is clearly re-packaged. You can see on the cardboard box where the original Factory tape was removed and it has been re-sealed with a generic packaging tape.This might be acceptable if it was sold as refurbished or re-conditioned but definitely NOT for a new laptop. I wonder who opened the original Factory packaging (Security Tape).I have decided to send the item back to Amazon. Unfortunately, all the Black Friday / Cyber Monday deals are gone and I've asked Amazon for a Replacement with the same model. The sad thing is that Amazon does not have it in stock any more and Customer Service cannot order a replacement for me. This is supposed to be a gift and I don't want the recipeient to think that it's a refurbished/reconditioned item.Reading at the other 2 reviews, I am having second thoughts if I should really gift this Model.", "Date": "November 30, 2012"}, {"Title": "DELL, as is typical, refuses to honor warraty", "Author": "Vidrine \"Peter Vidrine\"", "ReviewID": "R1Y6Y4B3IZT8DZ", "Overall": "1.0", "Content": "Purchased laptop on January 23, 2013 ... Hard drive failed on August 13, 2013Contacted DELL for warranty exchange of hard drive on Aug 14.  This was the gist of the conversation:DELL: Who is it registered to?ME: [My name]DELL: Not, it isn't registered to [My name]ME: How about [My Company name]DELL: No, it isn't registered to [My Company name]Tried different employees who may have made the purchase.  NO!DELL: How about we do a transfer of ownership?ME: Sure.DELL: Who originally purchased it, and on what date?ME: I originally purchased it on January 23, 2013.DELL: No, you didn't purchase it, and the date wasn't January 23, 2013.ME: Well, that's when I bought it.DELL: Since you didn't purchase it and don't know who originally purchased it, we will not honor the warranty.Apparently, purchasing a DELL computer from Amazon is just another way for DELL to refuse to honor their warranties, by fabricating who and when it was actually purchased.I've had enough of this rip-off company, and am now moving forward with a lawsuit.  Even if I have to spend more money than a new hard drive costs, they will at least have to come to Louisiana to defend their refusal to warranty their products.", "Date": "August 14, 2013"}, {"Title": "Worst wireless connectivity", "Author": "Rash", "ReviewID": "R14E0NLON81O4E", "Overall": "1.0", "Content": "I am very very disappointed with the wireless connectivity on this model.If you are going to use this machine for mostly off line work then this is a great computer but I would give 0 stars for it's wireless capabilities and 4 stars for the machine hardware.If wireless is important to you I would suggest you look elsewhere because both machines gave me a lot of grief for such a simple task as connecting to a network. I am a heavy shopper with Amazon and over the last 6+ years have never had a problem as bad as this was for me.", "Date": "January 11, 2013"}, {"Title": "Do not trust dell again or buy", "Author": "william welch \"Wildman\"", "ReviewID": "RPT6SQF1VJS2F", "Overall": "1.0", "Content": "I purchased this in 12/12 and due to my DSL lines at home very rarely used it. I developed a video problem and 10 days past warranty Dell refused to help. My fault on not getting to dell earlier but I thought I had purchased a 3 yr  warranty. I don't even think I have more then 40 hours of run time on this. That tells me it was pure dell retread garbage. This was my second Dell and a similar issue with the first one that they corrected and is still running. They want me to buy more insurance that costs more than half of what I paid for this one. I don't think I would ever buy a Dell again and want to warn Amazon buyers beware Dell does not stand behind their products. Once you buy they are done with you.", "Date": "April 30, 2014"}, {"Title": "DIED AFTER A YEAR AND 1 MONTH.", "Author": "Joe Obiefuna", "ReviewID": "R2QVW9EAKSEBQJ", "Overall": "2.0", "Content": "THIS SYSTEM WAS LEFT ON CHARGE. LATER IT WAS DISCOVERED THAT THE CHARGER INDICATOR IS OFF. ONCE THE CHARGER IS DISCONNECTED FROM THE LAPTOP, THE INDICATOR COMES BACK ON. THE LAPTOP DOES NOT CHARGE, DOES NOT BOOT THROUGH THE BATTERY HAS SOME CHARGE. GAVE IT TWO STARS COS IT WORKED WELL WHEN IT WAS ALIVE", "Date": "February 10, 2014"}, {"Title": "Excellent", "Author": "Sammy", "ReviewID": "R3W17OLUVSBYO", "Overall": "5.0", "Content": "I don't use the lap top as much as my desk top but it's fast and easy to use when I'm away from my lap top.  Glad I got it.", "Date": "January 7, 2014"}, {"Title": "Acceptable", "Author": "SL", "ReviewID": "RLVOTNH99YB8V", "Overall": "3.0", "Content": "Mousepad is very difficult for me to adjust to and adjusting settings does not address all of my issues with it.Might just be me and not knowing all the ways to use it. Still adjusting!", "Date": "December 27, 2013"}, {"Title": "Works all right. Specs as advertised.", "Author": "rcy", "ReviewID": "R33095K8SCKRBC", "Overall": "4.0", "Content": "I have been using the computer for a few months now. No major problems, works as well as it should.Two minor quibbles:When 'Switch User' is pressed while logging in, laptop goes dark for about 30 seconds. Not sure if this is a windows issue, or something with the hardware.Another problem I just noticed a few days ago, the key-combination to increase screen brightness does not work. You can lower the brightness using keyboard, but to increase the brightness you will have to go into power options.", "Date": "December 13, 2013"}, {"Title": "junk", "Author": "Bernie", "ReviewID": "R2VV4ZMZYBI6LL", "Overall": "1.0", "Content": "We had trouble from the beggining it never worked right out of the box and it is still not working properly.", "Date": "December 6, 2013"}, {"Title": "Nice", "Author": "D. Lopez", "ReviewID": "R41RYKEAC0OYL", "Overall": "5.0", "Content": "Had some issues with the seller but the computer overall is really nice. The key board is super comfortable. Very fast too!!! Love that it has windows 7!!!", "Date": "November 25, 2013"}, {"Title": "Good value", "Author": "The T", "ReviewID": "RIUVOAHESXARM", "Overall": "4.0", "Content": "For $700, you get everything you'd expect in the Dell Inspiron i15R-1633sLV. However, next time I'd spend at least $100 more to get a lighted keyboard and a faster processor than the Inspiron's Intel Core i3-2370M.", "Date": "November 12, 2013"}, {"Title": "Hard drive went bad.", "Author": "Pam Masters", "ReviewID": "R3FH63VFV2C1QW", "Overall": "1.0", "Content": "Initially worked well.  Used it for 9 months then the hard drive went bad and it \"crash dumped\" my extensive work, which wasn't recoverable.  If it was actually new, as it was advertised as, it should be replaced.", "Date": "October 10, 2013"}, {"Title": "Too good to be explained", "Author": "WON HUI LEE", "ReviewID": "R1AG5MZ9POEACQ", "Overall": "4.0", "Content": "too good to explain.suggest to everybody.specially to whoever trying tomake a fun with it.Battery life kinda short but long enough to use it", "Date": "September 15, 2013"}, {"Title": "excelent", "Author": "Maria Elena", "ReviewID": "R3CKLLDLDREDOO", "Overall": "5.0", "Content": "i love this laptop is very very good the best is fast and beautyfoul. i really love it so much", "Date": "August 13, 2013"}, {"Title": "Great Purchase", "Author": "Bobby.J.Fletcher", "ReviewID": "R12IHOVJZ2G87E", "Overall": "4.0", "Content": "I researched this particuliar lab top for several months. I am so glad it came with windows 7. I wouldn't ever want a PC with Windows 8 given all the consumer complaints with access.  Given less than $500, I was able to afford a replacement policy in case it got dropped or damaged.  I was disgusted with the so called MS Office software included package. If you are planning on doing work with the normal office software, forget it. Better off either buying MS Office Home or Professional complete and uploading it.  I would recommend this product for a  for anyone needing a great performing PC at a great sale price given all the bells and whistles.", "Date": "July 9, 2013"}, {"Title": "If god wanted to sell a computer  this would be it.", "Author": "KejiFuen", "ReviewID": "R2LK0NDUVDPL7O", "Overall": "5.0", "Content": "Its so convenient usually there when i need to do something in a hurry with it. So its very accessible and entertaining at most times of the day seems like i find endless uses for it...", "Date": "June 17, 2013"}, {"Title": "Nice to have", "Author": "Roberto A. Villegas T.", "ReviewID": "R8303GYYCPH73", "Overall": "4.0", "Content": "All required features and more supported by a world leader. Excellent shape and amaizing lines that suggest more for less money.", "Date": "June 12, 2013"}, {"Title": "A weak and Faulty Laptop", "Author": "abayomi", "ReviewID": "R3DVVQU9Z46X57", "Overall": "2.0", "Content": "I got this laptop for school assignment and some entertainment purpose. After three months of using the laptop,its start crashing repeatedly. The laptop would not start unless i m the safe mode.I had to pay $70 to repair it for the laptop to start normally. i will not recommend this to anyone that need a strong, reliable laptop.", "Date": "May 21, 2013"}, {"Title": "Be careful!!!!!", "Author": "Irish", "ReviewID": "R2UFOG24LC91RV", "Overall": "3.0", "Content": "I purchased this laptop in January 2013,,, we are now in may and its just stopped working... It refuse to come on when it does the screen is blank...This laptop \"when working\" is great for everyday use,,, features are great as well seemed like a good bargain for the price guess not!!!!!!!!!", "Date": "May 20, 2013"}, {"Title": "Very Happy with Laptop", "Author": "Brook Kumsa", "ReviewID": "RTSB4T83XHMGH", "Overall": "5.0", "Content": "Great price and the Laptop performs as advertised. I am very happy with this purchase. I would recommend this to others.", "Date": "May 14, 2013"}, {"Title": "Problematic", "Author": "Daniel W. Armstrong", "ReviewID": "R3HWTSB2OAC7E1", "Overall": "2.0", "Content": "I have to reboot a half dozen times a day because it locks up, and that includes 2-3 reboots where the only way I can regain control of the computer is by taking the battery out.  Extremely frustrating.  Computers aren't made of millions of complex parts.  They're assembled by putting together several common components (motherboard, hard drive, bios, etc).  How can they screw up screw up something this straight-forward?  On top of the continuous, nuisance reboots- it's slower than I expected based on the RAM and processor.  Too bad the executives, designers and assemblers of this product don't build their own cars.", "Date": "March 16, 2013"}, {"Title": "lo máximo en pc portatil", "Author": "david", "ReviewID": "R3D0OTRGVCNGU0", "Overall": "5.0", "Content": "muy buena pc es una maquina de calidad, que permite mejorar el aprendizaje en los avaneces de los nuevos tiempos.", "Date": "March 16, 2013"}, {"Title": "Runs better with Windows 8.", "Author": "Josh", "ReviewID": "R1XHD3SPCH2BT0", "Overall": "4.0", "Content": "I use this laptop mostly for casual internet browsing your typical youtube, facebook, craigslist, etc. It was a bit slow at first but I had a promotional $15 upgrade to windows 8 once I put windows 8 on it. It ran a lot quicker. If youre going to use this laptop to just go online its all you need I give it 4 and not 5 because I did have to put windows 8 on it to run nicer.", "Date": "March 16, 2013"}, {"Title": "excellent", "Author": "YAMILE MEDINA", "ReviewID": "R1WA9RYW04HHU2", "Overall": "5.0", "Content": "This PC met my expectations, is lightweight good screen resolution, easy to use. and excellent operating system. In summary versatile. Price.", "Date": "March 16, 2013"}, {"Title": "Good laptop", "Author": "Natalie", "ReviewID": "R2J2WH87S27SMD", "Overall": "4.0", "Content": "Overall for what I want it to do, it's a good laptop. The touchpad is a bit too large and so the cursor will move around a lot, but the keyboard is perfect.  The sound isn't the best, but it's great for watching streaming videos online.  I like the webcam and has great clarity.  Not the best computer, but for writing school papers, streaming, and video chatting, it's a great deal.", "Date": "March 11, 2013"}, {"Title": "No number pad :(  very light weight :)", "Author": "Michelle LeClaire", "ReviewID": "R159P4IYVPJL3H", "Overall": "3.0", "Content": "For the most part I'm happy with my purchase.  Do not like that it doesn't have a number pad on the right :(  Very lightweight laptop...easy to use.", "Date": "March 10, 2013"}, {"Title": "Dell Inspiron i15R-1633 laptop", "Author": "Douglas Hermle", "ReviewID": "R18W7Z2WJ6URL0", "Overall": "2.0", "Content": "This is the third Dell I have owned.  My second Dell laptop also has Windows 7 and I have had very little problem with the second one.  I bought this current Dell laptop to have a second computer for wireless in the house and I wanted something that still had Windows 7.  I want nothing to do with Windows 8.  I barely had this laptop when I began having problems.  One problem I had was that when printing an article from the internet at least once a day the computer would blue screen then black screen and shut off and reboot, causing whatever I was printing to be lost.  I took it to a repair business locally.  Dell no longer covers these costs even under the one-year warranty.,  You have to mail it in.  Just another fine example of the rise of corporate chintziness.  The repairman seems to have fixed the problem and am thankful for that.  My other chief complaint is that even though this computer has Windows 7 it does not work quite the same as my middle computer.  Dell integrated some features of 7 differently and I don't care for the changes.  But I am getting used to them.  What can I do?  The one feature I do like about this computer is its processing speed.  Very fast.  This computer along with my Charter 30 Mps high-speed internet makes using the internet a breeze.", "Date": "March 9, 2013"}, {"Title": "Good laptop for hunt and peck typists only", "Author": "Lori Brown", "ReviewID": "R3AO6ZHVE4MAW3", "Overall": "3.0", "Content": "This would be a wonderful laptop if the mousepad were only smaller and recessed.  The mousepad is very large and located a bit toward the right and lies exactly where the heel of the right hand rests while typing.  I found it impossible to avoid having any part of my hand touch the mousepad accidentally, resulting in losing control of the cursor.  Looking up I would find myself typing in the middle of text I had already typed or deleting a section of accidentally highlighted text.  There are settings to reduce sensitivity and turn off entire sections of the mouse, but none of the things I nor the Dell techs tried relieved the problem.  After 5 unsuccessful service calls, I returned the laptop to Amazon and bought another brand of laptop with a recessed mousepad.", "Date": "March 8, 2013"}, {"Title": "Welcome to Delhi...", "Author": "Critical \"I\"", "ReviewID": "RUWAWRSDMBD43", "Overall": "1.0", "Content": "I don't know if this is the exact Inspiron model I bought, but the principal will remain the same, so, in any event...I have had frequent problems with my new-ish DELL laptop, and the most recent is one that requires that the hard drive be replaced. A work order was placed on Thursday of last week, and a technician was supposed to come on Saturday. Of course, none ever did. The technician I spoke with at the end of the day on Saturday said there was no way it could be fixed that day, and said he had to create a new work order, and it would be 2-3 MORE business days before the laptop was fixed. In the meantime, he promised that a supervisor, a SUPERVISOR, mind you, would call me on Monday between 9-11am my time. Of course that call never came.Today, Tuesday, I reached out to the Texas number listed for Dell, and, of course, ended up back in Delhi with someone named Malek. He finally got me on with a supervisor, whose name I'm not even going to attempt, who told me that the new work order had been cancelled, through no fault of mine he had the nerve to assure me, and that ANOTHER work order was going to have to be generated, and ANOTHER 2-3 business days would elapse before my laptop was fixed. Yeah, I'm freakin' positive THAT'S going to happen.So here is what you need to know: If you buy a DELL laptop, you are going to be stuck with an absentee tech support crew who couldn't pour piss out of a boot if the instructions were written on the heel. You may be charged extra for express service you won't get, and promised to be called and kept in the loop by people you will never hear from again. While you are drumming your fingers waiting to get your means of livelihood back, they will be out chowing down sag paneer and not caring a tinker's cuss about the people here in the US who bought there crappy product and who are waiting, like for Godot, for someone to come and fix it.I don't know if there is an outfit out there anymore who has a domestic customer service team, probably not, but I can guarantee you one thing, I will never buy a DELL again EVER.", "Date": "March 5, 2013"}, {"Title": "not a good product", "Author": "Elizabeth Marvin", "ReviewID": "R2VOAIX5PLGSXQ", "Overall": "1.0", "Content": "I bought this computer for grad school and even though it's the cheaper end of DELLs line, I was hoping to get 2 years out of it. I have had the computer for 2 months and it will shut down without warning approximately 1-2x/day. I have active virus and spyware protection and when it shuts down it does not offer any reasoning. The curser also moves spontaneously throughout my word document while I'm writing so I often need to re click where I'm writing a sentence. I will unfortunately need to buy another computer because with it shutting down this way it is not reliable for my grad school papers. A dark area often appears in the top right corner of the screen as well. I wasn't a satisfied customer considering this was a new computer purchase.", "Date": "March 4, 2013"}, {"Title": "Perfect for my college freshman daughter", "Author": "Colin S. Brady", "ReviewID": "R3M9WOTJS3XXBM", "Overall": "4.0", "Content": "She is very happy with this laptop.  It has everything required (and more) by her college professors.  Added the MS College Edition of MS Office which has programs the Student/Teacher version does not.  This version of the Dell Inspiron was an excellent value for the price.", "Date": "February 9, 2013"}, {"Title": "Excellent value for the price.", "Author": "Emory L. Mertz", "ReviewID": "R12GQINZ2C6GVZ", "Overall": "4.0", "Content": "The Dell Inspiron i15R-1633sLV Laptop is a high quality, well built machine that will meet the needs of most homecomputer users.  The weight of the machine makes carrying it around a bit of a burden but overall I am well pleased with this product.", "Date": "February 8, 2013"}, {"Title": "Dell Laptop", "Author": "Kim M Sullivan", "ReviewID": "R2L82BL9PP65O", "Overall": "5.0", "Content": "This laptop is great and I couldn't beat the price.  What a great deal.  I got it for my 82 year old mother-in-law and was happy to be able to get her Windows 7 yet.  She wasn't looking forward to trying a new program.  The laptop offered more than what we needed but for the price we couldn't pass it up.", "Date": "February 8, 2013"}, {"Title": "Dell Inspiron laptop", "Author": "Margaret Ruth Schultz", "ReviewID": "RJOYWB7FZEVP2", "Overall": "5.0", "Content": "We wanted windows 7 and Dell Inspiron has it.  So far we have no problems but wondering if the volume does go higher.", "Date": "February 8, 2013"}, {"Title": "Great computer", "Author": "Laura G", "ReviewID": "R243J4OASML076", "Overall": "5.0", "Content": "Great computer for the price.  Worked well out of the box.  I like the size of it too.  Not to small and not too big.  Had a small issue with double security blocking my internet.  Dell has great support and assisted to fix the problem immediately.  I use the computer for surfng the internet, email and a few games.  It's great for my needs.  Would recommend.", "Date": "February 8, 2013"}, {"Title": "Best for the buck!", "Author": "Kim D", "ReviewID": "R3IE8NV977J00S", "Overall": "5.0", "Content": "Delivered very fast and appropriately to assure no damage.  Set up was super easy and love the graphics and keyboard's touch.  Cannot beat the quality for the price!", "Date": "February 7, 2013"}, {"Title": "Dell Inspiron Laptop", "Author": "Patrina Pfeifer", "ReviewID": "R9RGNGCDN62MF", "Overall": "5.0", "Content": "Great!  Came quickly and has everything you need to set it up right away and start using.  Instructions on set up were easy and the computer came with quite a few pre-installed programs.  I am very happy with it", "Date": "February 7, 2013"}, {"Title": "Exc!!!", "Author": "minor vega vega", "ReviewID": "R2X29QS851B1PF", "Overall": "4.0", "Content": "Very good product. I liked it. It was for a gift and the person was delighted. I hope to remain so my other packages", "Date": "February 6, 2013"}, {"Title": "dell computer", "Author": "tthurmon901", "ReviewID": "R32VA8DEQYTHR5", "Overall": "1.0", "Content": "Since I received this computer from you, it has never worked, I have called on three occassions and they did not help me. I will never buy another dell.", "Date": "February 5, 2013"}, {"Title": "Great Windows 7 laptop at a great price!", "Author": "SoldierSide77 \"Rock Fiend\"", "ReviewID": "R9ZO8WAXEJP62", "Overall": "5.0", "Content": "This is a fantastic laptop! We haven't found anything yet we don't like about it. It's pretty speedy and sturday, and my wife loved the pink switchable cover I got with it...although 30 bucks was a little pricey for just a laptop cover. For a great price you get a very nice and capable laptop with lots of RAM, CPU power, and Hard Drive space. It's perfect for students or anyone on the go, as it isn't too big or heavy, nor too small. Go Dell!The best part for me was that it came with Windows 7 Home Premium, not Windows 8. If you're buying a new laptop, Windows 8 is NOT a great Operating System for laptops, as it was designed directly for use with Tablet computers. It's performance is very clunky and awkward on laptops. Therefore, I was thrilled to find such a great laptop with Windows 7 at such a great price.", "Date": "February 5, 2013"}, {"Title": "Son Is Happy", "Author": "M. Lobdell \"mmlobdell\"", "ReviewID": "R2NS32B0G160G5", "Overall": "5.0", "Content": "This is the second Dell I have purchased for my kids. The first has taken a year and a half of going back and forth to school with  a now 17 year old and still works great. This one I bought for my middle son and he is very happy; it worked great right out of the box, no issues. It will get him through MOS in the Marines quite adequately, came loaded with everything he will need and allow him some fun and games, too. This was not a purchase for a hard core gamer or a graphics artist, just a kid who needed the basics. This model of Dell delivers just fine.", "Date": "February 5, 2013"}, {"Title": "Had to return for a refund.", "Author": "S.G.", "ReviewID": "R1LL9OYY4C9S2H", "Overall": "1.0", "Content": "The first one I ordered arrived with the security tape cut and had obviously been opened, so I exchanged it for a new one because I didn't order an \"open box\" item, I ordered a new one.The replacement arrived with the security tape intact but while using the computer the cursor and everything else kept freezing up and the fan would run at a very high speed at the same time. This would happen about once every half hour or so and made the computer difficult to use.The computer was always sitting on a flat surface with no vents blocked and the fan was clean but I kept having the same problem. I had to return it for a refund. Amazon was very good about this. Its a shame because it was a very nice looking computer.", "Date": "February 4, 2013"}, {"Title": "Great Machine", "Author": "Gretchen Parks", "ReviewID": "R1IHDBSZ1PTDUB", "Overall": "5.0", "Content": "Arrived on time; was packaged properly. Very nice laptop; works great and I would recommend to family and friends. Great purchase.", "Date": "January 25, 2013"}, {"Title": "Easy to operate", "Author": "michael paccione", "ReviewID": "R2WBQEJDEEU0VA", "Overall": "5.0", "Content": "Very user friendly. Easy to set up and use. I would highly recommendand and thats from someone thats not a computer geek..", "Date": "January 23, 2013"}, {"Title": "Dell Inspiron Review", "Author": "Toni Plaster", "ReviewID": "RM2E7XJOFKV7V", "Overall": "5.0", "Content": "Bought the laptop for my husband and he loves it.  Was impressed at the ease of setting up the system on line.  We were both impressed at the ease and speed of getting the laptop once the product was chosen.  This was our first time making any purchase from Amazon and our initital impression was very positive.  We will definately continue to shop at Amazon.", "Date": "January 23, 2013"}, {"Title": "Great Solid Computer", "Author": "John", "ReviewID": "R3UHVJHG6CA4O7", "Overall": "5.0", "Content": "This computer is really good. It comes with Windows 7 which is really nice and it is a good product. It is fast and does not come with a lot of crap ware. I have used Dell in the past and my opinion does not change each time I use their products. Dell is the superior manufacturer and that may be my opinion but i'm never proven wrong. For the price, it's a great buy.", "Date": "January 22, 2013"}, {"Title": "i15R-1633slv Or R15-5520 as listed in computer info screen", "Author": "Daniel S", "ReviewID": "RF1ORGTMV9I3K", "Overall": "4.0", "Content": "As stated on the box it's model i15R-1633slv as far as dell and the tag number its R15-5520.Ok, it arrived in two days, booted right up and runs good.I ran the Windows Experience Index and it scored a 4.8. not bad. ( good for surfing)All components are as listed. Price was good. Windows 7 home installed and Microsoft office starter.", "Date": "January 22, 2013"}, {"Title": "BUY IT", "Author": "Linda Bendick", "ReviewID": "R1DTD0Y9QWWCVV", "Overall": "5.0", "Content": "Everything I wanted in a laptop.  It's sure nice to have all of the computing capability.  I'd get 10 more if need be.", "Date": "January 22, 2013"}, {"Title": "First laptop", "Author": "Jeff D", "ReviewID": "RD2OQSNFGXP9A", "Overall": "4.0", "Content": "The laptop is just what I expected except the touch pad is a little bit to touchy. I am going to add a mouse because that is what I am used to.", "Date": "January 22, 2013"}, {"Title": "AWESOME", "Author": "Bryce Schantz", "ReviewID": "R1HQPQ29RO1ABL", "Overall": "5.0", "Content": "good computer. it shipped fast and I got it before Christmas. it has plenty of speed. it is everything I was hoping for thanks. I'm glad it has windows 7 on it and not windows 8 that is also one of the reasons I got this computer. i absolutely hate windows 8. but this computer had windows 7 that is one of the main reasons I got it and it has plenty of ram and hard drive for me.", "Date": "January 15, 2013"}, {"Title": "dislike this laptop.", "Author": "Vivian C Eckels", "ReviewID": "R2NITM1N5DSN7V", "Overall": "2.0", "Content": "I had a hard time with this laptop.  I had problems with the  cd-dvd vibrating with some disc. also had problems with the sound. It would play ok  on some sites , but some videos the sound would not go up loud enough to hear.  I have returned it and have another one on the way.", "Date": "January 13, 2013"}, {"Title": "Dell", "Author": "CINDEE OAKES", "ReviewID": "R6HAI7Z3QU8NK", "Overall": "5.0", "Content": "This truly a quality product. I had an hp laptop that the warranty was 30 days over. They basically said sorry can't help. Won't make that mistake again. Thanks dell.", "Date": "January 13, 2013"}, {"Title": "Buying Second Dell", "Author": "Richard Perkins", "ReviewID": "R3A1AGWSHFFWP0", "Overall": "5.0", "Content": "First one  we bought was over ten years ago and is quite the workhorse!  Love the screen, the keyboard and the fact that it turns on and works every single time is the reason why I chose the Dell over Lenovo (my next choice), both were at the SAME price.  Also, I compared these elements; (1.) Dell: 750 GB HD vs.Lenovo: 320 GB HD. (2.) Dell: 6 GB of RAM  vs. Lenovo 2 GB of RAM.....again, for the EXACT same price. It was a no-brainer for me.", "Date": "January 13, 2013"}, {"Title": "Pleasantly surprised.", "Author": "Willacoochee Ga", "ReviewID": "R3PWRBVQU819H", "Overall": "5.0", "Content": "This is the first Dell computer I have bought. My last laptop died right after the holidays, so I didn't want to spend a lot of money. I really just thought this would be a \"get me by\" laptop because of the price. I was totally wrong. I love this laptop.I took it right out of the box and started it up. No discs to install, great size, just a great laptop. This is a definite keeper for a long, long time.", "Date": "January 11, 2013"}, {"Title": "Crossed out circle cursor on my new Dell!", "Author": "Bev", "ReviewID": "RH7C2WWJNX1O0", "Overall": "4.0", "Content": "Cursor Issues on my new Dell!I bought this new laptop for my personal use.  I do love it, except for the cursor that constantly changes to a circle with a line through it and freezes!  I can drag it down into my taskbar, click, and it becomes a normal arrow cursor again.It's driving my nuts....I've tried adjusting all I am aware of to do.  Any help?  Would love to fix this issue.To contact Dell it seems is impossible, said today online my warranty expired on 12/3/12 which is interesting since it wasn't delivered to my home until 11/30/12!  I am ready to send it back!Otherwise I love this laptop, have it set up the way I want etc., but when you can't scroll it's useless!Bev in MN", "Date": "January 11, 2013"}, {"Title": "A DREAM COME TRUE!", "Author": "Trina Aqui", "ReviewID": "R7U4QKO3SSK2T", "Overall": "5.0", "Content": "What can I say? I LOVE IT!! Its fast, was easy to install, it works like a dream. The only little hitch, it tends to get pretty hot, I recommend a laptop cooling fan.", "Date": "January 11, 2013"}, {"Title": "Slow", "Author": "Leon Vitale III", "ReviewID": "R9UX6WQBCAUS7", "Overall": "3.0", "Content": "I bought this laptop for my mother for a Christmas gift. I had obviously never had any hands on with it, but after my mother received it she quickly found she did not like it. When I asked why she said while typing there was a delay for the letters to appear on the screen and she often had issues with the over sized touchpad and hitting her palms on it. I went into the settings and played with the touch pad palm settings and it didn't seem to fix it fully. I work in the IT field and knew all the guts of the computer would work for her, but when something as simple as a touchpad causes issues and for some reason it is slow out of the box that is never a good sign. Although I did not see the delay in key strokes when I was using it.", "Date": "January 8, 2013"}, {"Title": "Keys that don't function and a crooked camera inserted", "Author": "Robert S.", "ReviewID": "R768KGISNYTR6", "Overall": "2.0", "Content": "I have the feeling that I'd like this product very much if it were not for the quality control issues.  The letters C and V simply do not function and the camera is visibly crooked. Would that mean I would appear as crooked on a video conference?On the upside, Dell support was very good and I’m supposed to hear from a technician who will come on-site to replace the keyboard and the camera in a few days.Net / net it was disappointing to have a brand new computer not function and to have to wait for a service call vs. having Dell overnight me a replacement for my trouble.  Also the crooked camera insert really calls into question the quality control process – how did that get past anybody?", "Date": "January 7, 2013"}, {"Title": "Exactly as described.", "Author": "NC", "ReviewID": "R14IAR9LFJ050J", "Overall": "5.0", "Content": "I was up and running in minutes.  It was even better looking than pictured. I would recommend this product to anyone.", "Date": "January 7, 2013"}, {"Title": "Nice Laptop", "Author": "Jason Kile", "ReviewID": "R2O268N411CZSY", "Overall": "4.0", "Content": "I had an HP Pavilion that crashed on me. Bought this Dell Inspiron on Amazon a couple of weeks ago. It's been a. Very good computer so far. No complaints.", "Date": "January 7, 2013"}, {"Title": "Laptop came damaged, awful customer service, laptop is good, once fixed", "Author": "Ronald Sisco", "ReviewID": "RP950JQQKSQ1F", "Overall": "3.0", "Content": "I ordered this product December 21, 2012 with 2-Day shipping in order to recieve it by Christmas as it was a gift for my girlfriend. Amazon ended up canceling my order without telling me and I didn't find out until I checked the shipping status on Dec. 23. After almost 2 hours on the phone and speaking to three levels of customer service managers, Amazon re-ordered my product, gave me a discount and promised it would be delivered by Dec 26. After Christmas had gone by I was informed that it wouldn't be delivered until the 27th. I again had to spend an hour on the phone to have the package rerouted since I was only visiting my family for Christmas and would be returning home the 27th. Amazon offered me a $30 amazon credit which I accepted but only was granted $10. We FINALLY got the laptop at home on the 27th and upon opening it, the laptop was inoperable, the LCD was non functioning. We immediately called Amazon and Dell and they said it could be fixed by a dell technician within 24-48 hours. As you can probably guess, this also didn't happen! After many phone calls and emails, we finally got the laptop fixed January 4, 2013. The laptop works fine and my girlfriend is happy but this was am experience I will never forget, I know this isn't the norm but it seems like everything that could go wrong did, and Amazon seemed to believe it was no fault of their own!Bottom line: Good laptop especially for a student, good battery life, but go ahead and buy it at Best Buy so you don't have to wait, or deal with nonfunctional laptops!", "Date": "January 6, 2013"}, {"Title": "the unit was fine", "Author": "Larry Snyder", "ReviewID": "R38H1QY87MDA8I", "Overall": "4.0", "Content": "The unit vwas as it is suppose to be. It did not come with some of the vfeatures that the manufacturer listed. There was no microsoft cuopon for upgrade to 8 there was a 1 month instead of 15 month Mcafee service.", "Date": "January 5, 2013"}, {"Title": "awesome", "Author": "Greg Cruse", "ReviewID": "R1U1D2UFU3NI4A", "Overall": "5.0", "Content": "Machine is awesome however when i did it there was a minor issue that i troubleshooted myself with the battery other than that i love it...Also Start up could be a bit faster but again other than that love it", "Date": "January 4, 2013"}, {"Title": "Everything as described", "Author": "chris", "ReviewID": "R3DC9O8U4TLBN6", "Overall": "5.0", "Content": "The laptop came on time and it was worth the wait.sound and picture is awesome.There is no faults", "Date": "December 31, 2012"}, {"Title": "Doesnot meet my expectations", "Author": "Priya Saxena", "ReviewID": "R39LQM4AFKPWRZ", "Overall": "2.0", "Content": "IT has many problems..it seems amazon always ship defective product. I have exchanged it once but still i am not satisfied.ITs brightness is not working sometimes and many other issues i can see in this model.", "Date": "December 31, 2012"}, {"Title": "Actually, this was a gift for my son, but", "Author": "Capital K", "ReviewID": "R2J6ZSS0EJCE63", "Overall": "4.0", "Content": "He seems happy with it. Says it's fast and smooth going. He specified that he didn't want Windows 8 so he's happy.", "Date": "December 30, 2012"}, {"Title": "Price vs performance =Great", "Author": "Ricardo Vargas", "ReviewID": "R1ZE2MFTN2N9TQ", "Overall": "5.0", "Content": "Yes, and this pc not only beautiful is powerful, offering great experience for Using photo shop, illustrator, Sony Vegas and even playing some games.I like mine a lot. I recommend this.", "Date": "December 29, 2012"}, {"Title": "Good solid laptop", "Author": "J. Hakim", "ReviewID": "RGIZU3FXGBTBA", "Overall": "4.0", "Content": "The laptop worked out of the box without any gotchas.My only negative complaint is that the keyboard is a little small, I would have preferred keys which were a little larger for my big hands.Other than that, it works great.", "Date": "December 28, 2012"}, {"Title": "Great laptop!!!", "Author": "Mary Doherty", "ReviewID": "R1D0KTRL5TM539", "Overall": "5.0", "Content": "I bought this as a gift for my husband...a very picky guy, and he loves it.  Fast, fun, and lots of RAM.  Couldn't be happier!", "Date": "December 28, 2012"}, {"Title": "Dell reasonably priced", "Author": "Nina \"Nina\"", "ReviewID": "R2RUF303ZIXTX8", "Overall": "5.0", "Content": "I was really impressed with the quality for the price. A very reasonable lap top for everyday needs. When my daughter saw it she wanted one too.", "Date": "December 28, 2012"}, {"Title": "never buy any dell, trust me.", "Author": "Jeff", "ReviewID": "R1OLO6OMLTYBLS", "Overall": "1.0", "Content": "Dell has a long reputation of not being able to keep their machines cool. After just 3 months, my computer would overheat to the point of automatically shutting off. I've had to take it apart, pull the heat sink off the CPU, only to find that there was almost no thermal paste, and what was left had the consistency of dried out gum. Also, the heat sink makes an arc, passing from the CPU over the graphics card part of the motherboard. The heat from the CPU just gets passed on to the graphics card, so my GPU is always about 15 to 20 degrees hotter than the CPU, which gets up to 80 degrees with just internet browsing! Horrible design.Also, the battery dies after 2 months. What's the point of having a laptop that you have to haul around the power cord or else it dies after 5 minutes?Dell lies about battery life. They said it would last 6 hours light use, 4-5 hours moderate use, and 3 hours with heavy use like gaming. Lie. When I first bought it, it lasted 1 hour with heavy use and 2.5 hours with light use. Then, like I said, the battery completely died after 2 months.Never buy a dell, period. This is not a one off situation. Search the internet about dell overheating and dell skimping on hardware. You'll find lots of results.Also do a search on how horrible their customer service is.", "Date": "May 26, 2013"}, {"Title": "poor laptop", "Author": "nobody", "ReviewID": "RH9UQGVH27QDP", "Overall": "1.0", "Content": "This 'laptop' is put on the floor so my dogs piss on it!The mouse pad doesn't work!! no sound, no way to adjust.  I want to return it now!!!  it jumps all over the place and I loose my data,if your off one degree on the screen its not visible, the left and right buttons are soft!!  Do not purchase!!!!", "Date": "March 23, 2013"}, {"Title": "Seems Great..Just Wish I Could Use It!!", "Author": "Aficianado, \"Music, Film and Book Lover\"", "ReviewID": "R2QEBWHHYNABAM", "Overall": "3.0", "Content": "I picked this particular model of laptop to purchase because I wanted to get Windows 7 and not Windows 8 (which seems to be in the process of being poorly received by users just as Vista was earlier). That's a story for another review and another day however. I also purchased this laptop because I liked the other features that it offered (such as an excellent keyboard) and at a good price point. Dell does offer a great range of computers and with a very attractive selection of features.  Overall, this one is a beautiful machine and at a good price. Now for the problems, however.This is the fourth Dell computer (and first Dell laptop) that I have purchased over the years.  Of the first three Dell computers I purchased, one was DOA and had to be returned to Dell for a complete replacement. The other two died within the first few hours of operation and required a Dell tech to come to my home to repair them.And....what do you know? Exactly 2.5 hours of use of this laptop it died completely as well. That's four out of four failures on Dell computers for me. After a fruitless hour on the phone with a Dell tech, he finally informed me that I would have to ship the laptop back to Dell for repair or replacement (shipping and repair at their expense under warranty of course).  It took several other phone calls and e-mails to finally get the machine back to Dell. Right now, my laptop is somewhere in the bowels of Dell's repair depot in Houston, TX being repaired and prepared for return to me.To be fair to Dell, the problem in this laptop turned out to be a bad hard drive (not of a Dell brand and which of course was not manufactured by Dell). The problem on one of my other Dell computers also turned out to be a bad drive from another manufacturer. Also, the laptop seemed quite spiffy for the several hours that I have spent with it before it failed.Some people may call me a slow learner for continuing to purchase Dell computers even after all of these problems but it's been my experience that Dell works hard to correct situations such as these once they occur and I am eventually left with a fine computer. I do fault Dell over specific weaknesses in their service operation, such as length of time it takes for them to grasp the particular problem I am describing (even when it should be quite simple for them to do so) or my not being able to understand what the person on the other end of the phone call is saying. Unfortunately, getting caught in the Dell \"service pipeline\" is usually not a very pleasant experience.Dell service seems to be becoming aware of this however, since they now seem to redoubling their efforts to try and improve their customer satisfaction. For example, whenever I have talked with a service person recently, their supervisor gets on the phone at the end of the call and asks how the tech performed. Sometimes the supervisor will not get on the phone but will call you back later to follow-up and see if you are satisfied with the transaction and if your problem was solved to your satisfaction.Also, I notice that Dell is starting now to respond to negative reviews on Amazon by providing soothing balm and apologies for the user's poor experience and by providing a list of other \"options\" such as their \"Dell Cares\", \"Dell Community Forums\", \"Facebook Account\", etc. I have tried those options and found them either only marginally useful or completely unuseful.  This entire process seems to be an attempt at damage control.Only time will tell if I have any other problems with this laptop once it is returned to me. My other Dells settled down and performed quite well after their initial problems however. The oldest one, a Dimension has been performing flawlessly (knock on wood) for 15 years now after being replaced originally. One of the other ones is less than a year old. I do not regret this laptop purchase however since it seems as if it is a great machine for my particular needs. I just wish the darned thing had worked and I will update this review as necessary once I receive my computer again and can start (hopefully) using it for real! Right now, I have given this review a marginal 3 stars (barely above 2 stars). If the machine settles down and works as well as my other Dells have once repaired, I would consider it a 5 star machine!", "Date": "February 20, 2013"}, {"Title": "Product was non functional", "Author": "Mark Haugen", "ReviewID": "R33PKMP5WRFYCL", "Overall": "1.0", "Content": "As soon as I recieved it I had to call Dell and have their techs take control of the laptop to install a new wi-fi chip..( which I ended up having to finish. I was on the phone with the tech while he worked on it for 3 hours, what a waste of valuable time.Pop ups of advertising everywhere even though the no pop up option was checked.The screen size would never stablize.I purchased it in January 2013 and looked at the progams when they were installed, almost all were in July of 2012 so everything was mainly outdated.I had heard so many good things about Dell and the product I purchased was just not fucnctionaly operational", "Date": "February 4, 2013"}, {"Title": "Exelent Product!! But  have Experience troubles with Amazon Prime Service", "Author": "Maria Virginia", "ReviewID": "R1VI5FALV0A4MM", "Overall": "4.0", "Content": "Hi; good evening to all Amazon services fellas.I have a problem with one of the services and I need your help to solve it. On january 23, I had buy a laptop and when the shipment method window appear; I saw that, there was an AmazonPrime trial has an option with 2 day shipping for free then I made the reg in the system to get the trial and now seems like the system is trying to charge some money on my credit card for the free 30 day trial. Please help me to sing out from this service, due to the attempt  of charging money. I don't want the free trial any more. I did try to cancel it on the management prime menbership link but it just appear a window that is asking me for another payment method.Thanks for your help.", "Date": "January 27, 2013"}, {"Title": "Processor is too slow", "Author": "T. Hedrick \"tanamom\"", "ReviewID": "R139ZY4133FS5X", "Overall": "2.0", "Content": "I purchased this from Amazon and returned it the day I got it.  The processor is extremely slow and it took several minutes to download one page.  It is worth the money to buy a faster processor.", "Date": "January 24, 2013"}, {"Title": "I love it!!", "Author": "Deborah M. Sullivan \"Daisy\"", "ReviewID": "R2ATKXM8700NXF", "Overall": "5.0", "Content": "This laptop was just as you described and new in a sealed box. It is beautiful and I love it!!! Amazon you never disappoint. Thank you!!!", "Date": "January 22, 2013"}, {"Title": "Dead on arrival.", "Author": "Amelia", "ReviewID": "R2M50X4LLXYOYD", "Overall": "1.0", "Content": "Just got my new laptop today and... it doesn't work.  Great.  Spent an hour on the phone with Dell tech support and it appears to be a hard drive issue.  They offered to send a tech to my house to take a look at it (next week, the beginning of the semester).  Haven't decided if I should have them take a look or just return it.  Not cool, Dell.Update: Decided to send it back and get something else.  Too many bad reviews for this product.  I should have listened!", "Date": "January 4, 2013"}, {"Title": "Good laptop", "Author": "D. Dodenhoff", "ReviewID": "R3CB6WCXHXZTQL", "Overall": "4.0", "Content": "Everything that I had expected. Arrived on time and in good working order! I would recommend this model for anyone looking for an intermediate range laptop.", "Date": "December 24, 2012"}, {"Title": "Excelente", "Author": "Marco Monterrosa", "ReviewID": "R2VCSJ0UJLKK4G", "Overall": "5.0", "Content": "cumplio mis espectativas para uso del hogar, y lo mejor es que la puedo llevar a cualquier parte la recomiendo", "Date": "December 13, 2012"}, {"Title": "I wish I could say I hate it because...", "Author": "D. Brown \"animal lover, avid reader and flipp...", "ReviewID": "R2RSN9ZYBEOE1Q", "Overall": "5.0", "Content": "This is for my soon to be ex. He whined because he didn't get a computer a long time ago when I told him to, and he wanted one for his new apartment. I ordered this and believe me, he WILL be paying for it. Unfortunately, I know it will be reliable and last for a while. He is going to be screwed when it comes to dealing with tech support. Once again, unfortunately, I know the jerk won't have to very often. I'm kind of hoping it fails, but I know it won't. His lying, cheating *** will be just fine with it.", "Date": "February 1, 2013"}, {"Title": "WORTHLESS JUNK", "Author": "Billy", "ReviewID": "R2BX5VXWTMYJ8U", "Overall": "1.0", "Content": "Worthless, worthless, worthless!!!!! Dell has no quality control and Amazon is slow,slow slow about making it right! I bought the computer as a Christmas gift for my daughter, who is going off to college.The operating system didn't work so nothing could be down loaded.Worthless!!! Amazon has been doing nothing about a refund. WHO CARES IF IT WAS SHIPPED FAST!!! IT IS WORTHLESS AND SO ARE DELL and AMAZON! Let the buyer beware!", "Date": "January 17, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009US2BKA"}}