{"Reviews": [{"Title": "Excellent computer", "Author": "Mario Castaneda", "ReviewID": "R337VIDJ2SW7EE", "Overall": "5.0", "Content": "Very good computer, arrived in time. Have tested it for more than a month, battery life is impressive and love the fingerprint security. I highly recommend it, only issue is Windows 8, I downloaded a software (2mb) from a website that gave you the typical start button.", "Date": "August 16, 2013"}, {"Title": "Good machine", "Author": "Djean Antunes", "ReviewID": "RL2GOGP2VYQ9E", "Overall": "3.0", "Content": "It seems that in this machine HP finally fixed the BGA problem, so, it's reliable, fast and everything that you expect it fulfills", "Date": "May 17, 2014"}, {"Title": "Good Laptop for the Price", "Author": "Arinthros", "ReviewID": "RACJ9FVI0S5A7", "Overall": "4.0", "Content": "Overall a great laptop for the price. Good specs, just comes with Windows 8. Really hard to find drivers for Windows 7 on this laptop. Was looking to replace the keyboard with a backlit one, but sadly no LED headers on the mobo.Pros: Fast processor & memory. Easy to install new hard drive & ram. Biometric Fingerprint Scanner. Webcam.Cons: Not 1080p. Windows 8. Not backlit keyboard, & not upgradable. A little on the heavy side for notebooks nowadays. Keys have a really weird texture, reminds me a little of slate.", "Date": "March 12, 2014"}, {"Title": "deception", "Author": "Jorge Maranho", "ReviewID": "R2PBNLJN2HHTT0", "Overall": "1.0", "Content": "Less than one year in use, and some keys of keyboard do not work.as  warranty is not worldwide, now i have a big problem being in Brazil.", "Date": "February 26, 2014"}, {"Title": "Good laptop", "Author": "James Williams", "ReviewID": "R3C7FRZDE5JJU", "Overall": "4.0", "Content": "I love this laptop.  Does everything I needed it to do.  Only reason it doesn't get 5 stars is that it comes with windows 8.  I wiped the hard drive and put windows 7 on.  You will run into problems doing this.  The keyboard, usb, and network (wifi or wired) connections won't work.  Track down the drivers for these first and burn them on a cd.  After you get that done this puppy will cruise right along.  My thumb print scanner doesn't work, but not really an issue for me since I wouldn't have used it anyways.", "Date": "January 2, 2014"}, {"Title": "Nice Notebook", "Author": "Eddie", "ReviewID": "RJ4LSXB0OXLAD", "Overall": "4.0", "Content": "Fast shipping, overall great notebook. The only 2 complaint's I have is the screen; which tends to blur out if you're not looking at it dead on. Also, the built in camera really sucks (the picture is really bad). Other than that I really like the fingerprint reader, makes logging in/unlocking a lot faster. Windows 8 is a little confusing without the start button, but is pretty easy to use once you get the hang of it. Also, the blu ray player is a nice feature and really brings up the value of this notebook.", "Date": "October 26, 2013"}, {"Title": "Great Additional Functions", "Author": "Sankha Lakshan Wanigasekara", "ReviewID": "R26BGR3I23A3PJ", "Overall": "5.0", "Content": "I was extremely impressed by the fingerprint scanner, which can be used to even log into websites through HP simple pass. the web browser might get stuck a little but it's better than trying to remember passwords from various websites. Among other things, the speed of the notebook is great and even the color, which doesn't look too appealing through the photos but looks better in reality.", "Date": "October 22, 2013"}, {"Title": "Awsom", "Author": "hamdi", "ReviewID": "R1L6T5W2OYG2EW", "Overall": "5.0", "Content": "This laptop is really very good laptop .I advise everyone to buy it.as well as I find in this laptop more than what I expect.", "Date": "September 18, 2013"}, {"Title": "WORST SCREEN EVER!!!", "Author": "Jeiner Fonseca R", "ReviewID": "RW5UK5OBTCESA", "Overall": "1.0", "Content": "IF YOU ARE THINKING TO BUY THIS LAPTOP, STOP AND GO AWAY FROM DV6 HP LAPTOPS.I BOUGHT A HP DV6-7300 LAPTOP AND AFTER 2 WEEKS OF USING IT, MY LAPTOP SCREEN STARTED TO FAILING. IT HAS SOME LINES OF DEAD PIXELS, SO THAT MEANS THAT IS NOT A PROBLEM OF MY COMPUTER HANDLING, IT MEANS THAT WAS A CONSTRUCTION ISSUE. THIS TYPES OF LINES APPEARS WHEN THE BUS OF ELECTRICAL CONECTIONS FROM THE \"MOTHERBOARD\" TO THE SCREEN IS VERY WEEK AND START FAILLING. SO I CONTACT AMAZON AND THEY RETURNED TO ME THE MONEY. THE COMPUTER WAS VERY FAST SO I THOUGHT THAT MAYBE IT WAS JSUT BAD LUCK SO I BOUGHT ANOTHER HP ENVY-DV6 PC. IT CAME TO MY HOME AND AFTER 3 WEEKS OF WORKING GUESS WHAT? THE SCREEN STARTED FAILING AGAIN, SAME ISSUE, JUST ANOTHER PART OF THE SCREEN (ALWAYS VERTICAL DEAD PIXELS LINES). I AM VERY UN HAPPY WITH THIS I AND WONT EVER BUY AGAIN AN HP LAPTOP.", "Date": "September 13, 2013"}, {"Title": "Horrible Wireless Connection", "Author": "Z_zOhIB", "ReviewID": "R2A01EWLWBOON8", "Overall": "2.0", "Content": "I bought this computer brand new, and right out of the box either the wireless card or an antenna was messed up. It would get connection only if i was sitting right on top of my router (which defeats the purpose of a wireless computer). HP is supposed to be a reliable company so i thought something like this wouldn't happen. Everything else about this computer is amazing, but without internet connection you cant use your laptop for anything.", "Date": "July 26, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Genuine Windows® 8 64; 3rd generation Intel Core i7-3630QM Processor 2.4GHz with Turbo Boost Technology up to 3.40GHz\n750GB 7200RPM hard drive with HP ProtectSmart Hard Drive Protection, 8GB DDR3 SDRAM (2 Dimm)\n15.6-inch diagonal HD BrightView LED-backlit display (1366 x 768), Blu-ray player and SuperMulti DVD burner; 6 Cell Battery\n1GB GDDR5 NVIDIA(R) GeForce GT 630M Graphics; 802.11b/g/n WLAN; 10/100/1000 Gigabit Ethernet LAN; 120W AC Power Adapter\nStandard Keyboard; Beats Audio & HP Triple Bass Reflex Subwoofer; Fingerprint Reader; 3 SuperSpeed USB 3.0 Ports; 1 Year HP Warranty", "Name": "HP Envy dv6-7215nr 15.6\" Notebook (2.4GHz Intel Core i7-3630QM Processor, 750GB HDD, GeForce GT 630M Graphics, Blu-ray player, Windows 8) Midnight Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41Ya0cbCS6L._SX300_.jpg", "ProductID": "B009RSFJD4"}}