{"Reviews": [{"Title": "Great computer", "Author": "Jack", "ReviewID": "R14JJS27TAZCML", "Overall": "5.0", "Content": "I actually purchased this laptop a week ag from Staples - for about $100 less than the Amazon price. I love it! I agree, Windows 8 takes some getting used to, but the more I use it the more comfortable I am with it. I simply use the Windows 7 desktop that I can easily access from the \"Metro\" desktop that comes up when I first log on. Also, the Metro desktop shows all the files and program shortcuts that I have on my Windows 7 desktop. They are located over on the extreme right side of the display, and so its only takes a second to get to the programs I use...without even having to go to the Windows 7 desktop.I love the nice, crisp display. The keyboard is like silk and it's size makes it, at least for me, very easy to use. The Fn keys are useful, and having a separate number pad is terrific. This laptop also has both USB 2.0 and USB 3.0 outlets, which is a real plus. The only thing that is a very slight disappointment is that the battery only last 4 hours, but considering that the battery on the 7 year old Toshiba I had been struggling with (as a second computer just for email and writing)only lasted 15 minutes, 4 hours is a breath of fresh air.I would buy this computer over and over again. It seems to be a fantastic machine.Additional comments two weeks later:I still really like this machine, with just one complaint...the display has a blue cast that is impossible to get rid of, no matter how many color corrections I try. I've been able to reduce the  blue cast significantly, but if I go try to reduce it further in the color cast setting or in the processor settings, the cast starts turning green or red. Since I use this computer to do some photo editing, I'll just have to make the color cast corrections (which are usually only white balance changes) with my desktop that has a 22\" ViewSonic LED and is connected directly to the printer. I have tried three HP G7 laptops, two with AMD processors and one with the Intel i3 processor, and they all have the same cast, so it's the display and not the processor. If anybody has any success correcting this, let me know.Incidentally, I LOVE Windows 8. Nearly all the low ratings for this computer are because of Windows 8 and not the computer itself. I've been through XP, Windows 7, and now Windows 8, and I think 8 is far better than the other two. Here's what I like so far:  The charms provide easy and quick access to all those files, folders, programs, and system tools that were so darn hard to find, particularly if they're in the control panel. Just type in the name of what you are looking for and the links to the item show up instantly. Very cool.  I can switch back and forth between the media window and the traditional Windows 7 desktop with a simple push of the windows button on the lower left side of the keyboard. And get this - every program I install has a shortcut on the traditional desktop AND the media desktop. Since they open at least three times faster when I access them on the media desktop, I always start there. And...with some patience, I've been able to move all the programs I use to the left side of the media desktop so they are front and center on my display at startup; a piece of cake.  One aggravation is that I have not figured out how to make a shortcut to the system tools I use - \"create a restore point\" and \"computer management\" to put on the desktop. If anybody knows how, please let me know because I use these tools a lot.", "Date": "January 4, 2013"}, {"Title": "Great notebook!", "Author": "Richard Perdue \"sage533\"", "ReviewID": "R3JRXBTS1UL8MP", "Overall": "5.0", "Content": "I have bought several lately of various brands, 2 of this one for me and my wife. This one is the fastest. Windows 8 can take some adjustment if one is not tech oriented, so I downloaded classic shell and it opened up old school familiarity with new app functionality.", "Date": "July 31, 2013"}, {"Title": "Very Reliable, So Far", "Author": "Sir George Martini \"Verbalosity\"", "ReviewID": "RIM3VPE07676A", "Overall": "5.0", "Content": "This Toshiba is a great laptop for the price and it has a decent amount of memory and disk space, although you can find it cheaper elsewhere. The display is slightly larger and movies look good on it. I personally dislike Windows 8, but that's a minor problem once you get used to it. I also purchased a Toshiba 3TB external hard drive for all my movies and both work excellently.", "Date": "June 29, 2013"}, {"Title": "Great once you beat Windows 8 into submission!", "Author": "Kate Kaos", "ReviewID": "RVC90ZUG4HF2S", "Overall": "4.0", "Content": "Got this from Blinq, advertised as used, but when I got it, it looked brand spanking new - original box, paperwork and all.  Once I got it up and going, I immediately installed all updates (91!  Yikes!) and downloaded Windows 8.1.  Then I installed Classic Shell and set it to automatically boot to the desktop.  I couldn't be happier with it now.  My game library on steam plays like a charm (I don't have the newest games, but it's easily able to handle say, Portal and Portal 2).  The speakers are loud and crisp, and while I thought I'd totally hate the apps, having the netflix app running while simultaneously working on my desktop is well nigh magical.  The screen is bright and vivid, and the whole machine feels solid without feeling bulky.  It's light years better than my old Dell, or even the Macbook I had before that.  Highly recommended!", "Date": "January 7, 2014"}, {"Title": "Toshiba Satellite L75D", "Author": "Brenda Richmond", "ReviewID": "R4QG7TLWH8Z3A", "Overall": "4.0", "Content": "Not sure I like the keyboard.  It works beautifully for what I wanted it for. It took longer to get than other items ordered from Amazon.", "Date": "October 23, 2013"}, {"Title": "Solid performer", "Author": "D. Deutsch \"Chance favors the prepared mind.\"", "ReviewID": "R37LD5FO5AI73K", "Overall": "4.0", "Content": "I really like this laptop. I upgraded from a 15.6 inch display to this 17.3 inch display which makes a huge difference. The screen is sharp and vibrant with pretty good contrast among indoor lighting conditions. It is not a touch screen. The keyboard area is large and keys well-spaced if a touch small. The numerical keypad is a nice touch and the function keys are intuitive and responsive. The touchpad works well, but I have always found the \"touch gestures\" somewhat superfluous and this time is no different. This machine is powerful enough to handle Windows 8 which the kids and I adapted to fairly quickly, but some may prefer the Windows 7 shell. My only real gripe with Windows 8 is the laborious shut down sequence. This machine is not meant to be a tablet and needs shut downs and restarts occasionally. So far performance has been reliable with the gamut of standard household programs, such as internet to word processing executed without complaint.", "Date": "October 2, 2013"}, {"Title": "OK, buy for the money", "Author": "John Grimm", "ReviewID": "R10H6G7WYG7RD", "Overall": "3.0", "Content": "I hesitated on this one because of Windows 8, but after reading the reviews on Windows I went ahead.  Windows 8 does take a little getting used to.  I set mine up with auto logon and put my browser and other apps on my start page. I also turned off gestures on the touch pad. This works great.As for the machine.  Some of the functions don't work all the time, such as the power button having to be pushed just right to get it to turn on and off.  I got around this by setting the lid to power on when opened and power off when closed.  Turning the wifi on and off does not work.  There is no volume control other than windows.  No blue tooth. No \"F\" keys.I do love the extra large screen.If you are just going to do the internet, a little word processing and some photos, this might be the machine for you.", "Date": "August 30, 2013"}, {"Title": "GREAT BUY", "Author": "MJC", "ReviewID": "R385ZQ13W5S7IZ", "Overall": "5.0", "Content": "Like others I have found this laptop for a much lower price (in my case $299 after rebate) at local brick and mortar office supply stores (Office Depot). It is last years model so it is on clearance. It runs fine and has a very, very nice screen and keyboard. It took a while to get used to the mouse pad but with a bit of tweaking of the settings it settled down OK. Still, it works much better with an external mouse but that is just my personal preference. Windows 8 took 1/2 to get used to but Toshiba provides a single click link to the traditional desktop. My fifth version of Windows so I guess I've gotten used to making transitions. So I am very, very happy. Was ready to spend up to $200 more to get a 17.3 inch screen with 500+ GB of disk and 6+ GB of RAM but didn't need to.", "Date": "July 31, 2013"}, {"Title": "Laptop Computer", "Author": "Carolyn M. Geddings", "ReviewID": "R36M7QIECOX6K8", "Overall": "5.0", "Content": "I love this laptop. The performance is great. It's fast and easy to use. I like that it's lightweight. Thanks", "Date": "July 30, 2013"}, {"Title": "Wonderful Computer", "Author": "Tina Cappillino", "ReviewID": "R2Q4EJQPL2PHDK", "Overall": "5.0", "Content": "So far so good !!  I hope it continues with no problems !! God Bless !  May Jesus be your Lord and Savior !!", "Date": "January 20, 2014"}, {"Title": "Toshiba L875D-S7332 17.3 inch Laptop Greatest Ever", "Author": "Scott Caudel", "ReviewID": "R24IL5CRXAY508", "Overall": "5.0", "Content": "I bought this laptop on a whim hating every new windows system they ever came out with.  after getting such a good deal on this computer and using Windows 8 I will never use anything else. I even sold my brand new MacBook Air. This Toshiba can and will do more for you than any other laptop you could get. Every app is blazing fast crystal clear and never lags or freezes. Anyone complaining about this laptop has been fed with a silver spoon and only complains because they are to lazy to get the hang of Windows 8 which makes this computer even better. The only thing I could even remotely be sad about is that there is no touch screen but We should know this is not a tablet and nowhere on it does it say touchscreen.", "Date": "December 9, 2013"}, {"Title": "My New Toshiba Laptop", "Author": "William C. Glenn", "ReviewID": "R26WJ2MZVB69YZ", "Overall": "5.0", "Content": "From the beginning of the process of choosing and ordering my new computer, Toshiba made it simple.  The website was very clear and offered many different computers to choose from.  It arrived in good time which was a blessing as I was completely without internet, mail and important documents until it was delivered.This is a great laptop computer!", "Date": "October 16, 2013"}, {"Title": "Totally Worth it!", "Author": "Leancarlos", "ReviewID": "RYZ8TZUBJQ0T", "Overall": "5.0", "Content": "I cant find any problem with this laptop, it's totally awesome! Fully filled my expectatives!! It's fast, stable, doesnt get overheated. Pretty good.", "Date": "October 5, 2013"}, {"Title": "not win7 frendly", "Author": "Dana Wellen", "ReviewID": "RB372U51DMMZV", "Overall": "3.0", "Content": "Win 8 only option, no windows 7 drivers. Runs Linux without problems or driver issues. Good performance running Linux, windows not so much.", "Date": "November 13, 2013"}, {"Title": "Speed is a blur", "Author": "tammy", "ReviewID": "R3ECAF3G55U0QG", "Overall": "5.0", "Content": "HelloI bought this for my daughter who had saved up for 10 weeks to purchase this laptopShe was SO excited to finaly get it in the mailFinally she has a laptop powerful enough to play higher graphic games with her friends with.Also no more dorky headset for skype callsI want to say thank you for the fast delivery and excellent brand new conditionThe one and only complaint I have is the w key may be a tad iffy but perhaps it just needs to be worked out", "Date": "October 22, 2013"}, {"Title": "Great computer...Windows 8 questionable", "Author": "Lisa D.", "ReviewID": "R1H3HBCWS1WD4S", "Overall": "5.0", "Content": "This computer works great! The start up speed is phenomenal and the computer operations themselves are flawless. Windows 8, however, is definitely something that has taken some getting used to. In fact, I gave up trying to understand the whole \"tile thing\" (as I am a diehard Apple/Mac fan) and ended up giving this brand new computer to my husband. He absolutely loves it and has Windows 8 to thank for the unexpected present!", "Date": "July 31, 2013"}, {"Title": "nice", "Author": "antonino di salvo", "ReviewID": "R3A16LZ3FPO1U6", "Overall": "5.0", "Content": "the was a great deal this computer was purchased one of  for my sons he plays games on line with friends and its very excellent,fast reliable i do recommend to any one great computer, great price .if you in laptop shopping i strongly recommend this laptop .", "Date": "April 9, 2014"}, {"Title": "Speakers not working.", "Author": "Shivam Patel", "ReviewID": "R1HJK3YJ4YDG3M", "Overall": "4.0", "Content": "Speakers not working. I tried everything to fix them but no. The computer repair shop says that they dont have speakers for this particular laptop at their vendor. Except that, pretty good decent laptop from speed, RAM, screen size, etc.", "Date": "March 21, 2014"}, {"Title": "good machine", "Author": "mschuchs", "ReviewID": "R29VGA6STW3W3L", "Overall": "4.0", "Content": "like new machine --software a little screwed up -- but it was a good buy and is working fine now", "Date": "February 18, 2014"}, {"Title": "toshiba", "Author": "susan l wilcox", "ReviewID": "R1KP1KKH5FWHQ4", "Overall": "5.0", "Content": "my husband bought this for me and I love it.  it was nice to get a computer that has bells and whistles  I would buy this product again", "Date": "February 9, 2014"}, {"Title": "Excellent laptop for the price.", "Author": "Roper Rock", "ReviewID": "RZWLR8U4EEQG9", "Overall": "5.0", "Content": "This is a remarkable laptop for the price tag. I have yet to have the hardware come up wanting. I would suggest stripping windows 8 and installing windows 7, as the new tablet OS is miserable.", "Date": "January 28, 2014"}, {"Title": "Pro Gamer and Video Editing", "Author": "Tou J. Lee", "ReviewID": "R2A09OMK8M52DX", "Overall": "2.0", "Content": "This say it can be overclock to 3.2ghz. Have to download a desktop version amdoverdrive so it can be overclock to 3.2. This one is not good because of missing software that it need. AMD doesn't support Tosbiba so don't buy it if you need support on amd chip. GPU is a low-mid grade gaming computer and it run good. Playing assassin creed iv on it and running 15-30 on overclock. Need to upgrade the HDD if you want to play high end game. If you want to play cube world, you need to upgrade the HDD since this memory catch is slow. Need some few upgrade on rams and HDD if you are doing video editing. Need to download amddrive so it can be overclock to 3.2ghz. AMD product doesn't support Tosbiba.My grade for this is 2 out of 5Gaming:8 out of 104 out of 5Video Editing:6 out of 103 out of 5This is a basic score that I do in making gameplay video. I make gameplay video for youtube and has been testing cheap low-mid end laptop.Good for gaming, Bad for video editing. Need some new parts and software to fix that.Total price overall to get new parts and this for gaming and/or video editing plus getting this laptop:$1000+$100+ for 2x 8gb rams stick$200+ for better HDD OR SSDThis laptop  price change over time.", "Date": "January 24, 2014"}, {"Title": "Good machine.", "Author": "linda faye scott", "ReviewID": "RYP4ZLMCPP4RD", "Overall": "4.0", "Content": "Keys are smaller and harder to locate than on my P205 model.  I also miss the premium speakers on the P205.  Lots of changes between Vista and 8.1 that I am still getting used to.  Other than that, I love it so far.", "Date": "December 29, 2013"}, {"Title": "Great", "Author": "Thomas Hemingway", "ReviewID": "R6O2EPBYXMR5E", "Overall": "5.0", "Content": "Over all I was very satisfied with the product and got everything I was looking for for a good price.", "Date": "December 21, 2013"}, {"Title": "Toshiba L875D-S7332 laptop", "Author": "John F. Bush Jr.", "ReviewID": "R39KBN20RB110S", "Overall": "5.0", "Content": "Purchased the laptop for my wife's friend and she loves it.  My wife has the same unit and she too enjoys using it.", "Date": "November 24, 2013"}, {"Title": "A horrible investment!", "Author": "G. J ROBINSON \"mean_gene\"", "ReviewID": "R1UFMHNSKGQND8", "Overall": "1.0", "Content": "Opened it 24 hours ago, It's been a struggle ever since. Not at all easy to use, randomly jumps to pages and functions I didn't seek, has trouble with Pandora and battery life is nil. Very much regret this purchase.", "Date": "November 6, 2013"}, {"Title": "Awesome Computer!", "Author": "Sandra Dickey", "ReviewID": "R1YBIJY5LWRNUH", "Overall": "5.0", "Content": "I absolutely love this computer.  It is much nicer than the ad depicts :). I am highly recommending it to everyone!", "Date": "September 23, 2013"}, {"Title": "windows 8, ie 10", "Author": "kiwi", "ReviewID": "R2BH9IAFFAF42N", "Overall": "5.0", "Content": "first time with windows 8 and ie 10.  a wee bit confusing in the beginning.  after the first couple days, it is great.  Toshiba has a great product - fast, reliable and cost efficient.", "Date": "May 13, 2013"}, {"Title": "Toshiba satellite", "Author": "Mae22", "ReviewID": "R3DKQI363L1EIO", "Overall": "5.0", "Content": "It took me forever to decide on a laptop and when I finally decided on this one I was certainly NOT disappoint. The laptop is amazing and came right on time. I strongly suggest this one!!", "Date": "August 25, 2013"}, {"Title": "Toshiba is good hardware", "Author": "purnanand wagle", "ReviewID": "R11LD8ISHITTKU", "Overall": "5.0", "Content": "my first laptop which i bought in 2001 was toshiba. When my daughter was very young she smeared the keyboard with her food yet the laptop worked. This old one with XP still works. I bought a new Toshiba because I am big fan of Windows 8 and it couldn't go better with a sturdy hardware. My Toshiba 17\" does what I need it to do efficiently. It is quiet, fast to boot and has plenty of disk space. If anyone wanted me to recommend a hardware platform for choice in laptops, I'd say get Toshiba!", "Date": "June 27, 2013"}, {"Title": "My Performance using the Toshiba L875D is Awesome!!!", "Author": "Dj DrunkenMaster of FUNK FLO' PRODUCTIONS", "ReviewID": "R1S088KZ9AMWJY", "Overall": "5.0", "Content": "Wow...I use my Toshiba Laptop when I perform as a DJ &  I must say the work load I use is quite heavy...The Toshiba L875D is Incredible!!! It handles my Music with a Sound Quality that is out of this World..very clean!!! It also has a Camera with High Definition I use for my Internet Radio Show!..Super Clear & Great Quality!!! I recommend this product with ★☆★☆★☆★!!!! Thank You from*Dj DrunkenMaster of FUNK FLO' PRODUCTIONS*", "Date": "November 1, 2013"}, {"Title": "As expected", "Author": "amacostumer", "ReviewID": "R1Y57CGWJEDYFH", "Overall": "5.0", "Content": "I like this computer.  I use it at home for basic home needs, and it meets all my expectations.I'm having fun getting to know Windows 8 on it.", "Date": "February 16, 2013"}, {"Title": "Computer is really nice and love the size of it", "Author": "lu liu", "ReviewID": "RJJ1RWXCQ1ECO", "Overall": "5.0", "Content": "The product is good sound quality, lighting fast , a touch pad works great and good Toshiba support so far.", "Date": "April 14, 2013"}, {"Title": "Unusable due to Win8", "Author": "Todd and Stephanie Bailey", "ReviewID": "RSRIG60YGGP04", "Overall": "1.0", "Content": "First of all, the hardware seems to be fine.  The only reason I rate this laptop so low is because it is running Windows 8. Windows 8 is practically unusable.I bought this for my son for Christmas so he could play online games like Marvel Heroes and Roblox. I can't get either to install. For some reason, Win8 won't launch any .exe files that I download. I have researched the issue and many users have the same issue with no clear solution. So, in a nutshell, my son was a little disappointed Christmas morning.I tried to return this to the vendor before Christmas (I discovered the Win8 issues while setting it up before Christmas), but they wanted to charge me a 25% restocking fee (10% handling and 15% restock). I have since ordered a Win 7 build CD (another $140) to revert to a usable OS.Don't buy this laptop unless you're familiar with Win 8 and know what to expect.", "Date": "December 29, 2013"}, {"Title": "HIGHLY RECOMMEND TOSHIBA LAPTOPS", "Author": "Fredrick T Latinis", "ReviewID": "R1TJ74GQ0RPLSO", "Overall": "5.0", "Content": "THIS WAS OUR FIRST LAPTOP AND WE WERE INFORMED THAT TOSHIBA WAS ONE OF THE BETTER QUALITY LAPTOPS THAT DOES NOT HAVE ALOT OF EXTRA STUFF ON IT THAT IS NOT NEEDED. WE ARE VERY PLEASE WITH THIS EVEN THOUGH WINDOWS 8 IS A LITTLE TOUGH TO GET USED TO. I WOULD RECOMMEND THIS PRODUCT FOR ANYONE AND THE PRICE IS FANTASTIC.", "Date": "July 9, 2013"}, {"Title": "Great computer at an affordable price", "Author": "Juana Guerrero", "ReviewID": "R3OS8EKQBM5MKY", "Overall": "4.0", "Content": "This is a great computer at an affordable price. Only thing is the \"z\" key which feels a little sluggish. Beyond that, it's as described : a  nice desktop replacement.", "Date": "July 15, 2013"}, {"Title": "Bad Purchace", "Author": "Cheryl M. Maas", "ReviewID": "RLXDL4AWX71AX", "Overall": "2.0", "Content": "1. You need a touch screen with the new windows 8...in my opinion. 2. This computer hard drive went out onsept.26 1913. I purchaced this computer in the middle of April, 1913.....5 months is all it lasted and it cannot be returned. I have yet to find a number to call for Amazon . Buyer Be Ware", "Date": "October 1, 2013"}, {"Title": "Windows 8 System", "Author": "Tina M Caputo", "ReviewID": "RKO2KWP82YVT0", "Overall": "2.0", "Content": "Windows 8 operating system, even though Amazon website said it was Windows 7.  I am more comfortable with Windows 7 and was hoping to get the Windows 7 product that I thought I was ordering.", "Date": "September 4, 2013"}, {"Title": "For the price, would have been super great with an i7 and Windows 7", "Author": "DRM1", "ReviewID": "R2VF9TY2MKU40R", "Overall": "1.0", "Content": "I bought this laptop because the Intel i7s cost too much. This laptop actually looks better than the pictures. The keyboard does wobble or spring up and down a little while typing. Rarely hear the fan blowing, maybe I haven't been overworking the processor yet. The screen is nice and sharp. This pc so far stays cooler than the i3 that I had. This laptop would be great with Windows 7.  Windows 8 sucks. Windows 8 is a p.o.s. and should be flushed down the toilet. The ceo of Microsoft should be fired now because of this Windows 8 crap that was pushed out onto the masses during his reign. Windows 7 is superior to this MS Windows 8 TURD. Microsoft had no business trying to cookie cutter everything into 1 os. The only reason Microsoft is not yet extinct is because Windows 7 is still available and Apple is too expensive. Toilet paper is more productive than Windows 8 will ever be. The hell with tablets. Tablets can not replace desktops. The standard Microsoft games are not on Windows 8 and MS tried to force users that liked the music, video, and pictures applications that were available in XP and 7 to create online Xbox accounts. I almost want to buy an over priced MAC and forget about ever buying another MS system again.", "Date": "August 27, 2013"}, {"Title": "Windows 8 NO START MENU!!!! There is a FIX!!!", "Author": "Magnumous", "ReviewID": "R3H9XU2U3YFIW5", "Overall": "5.0", "Content": "Great price and great performance. However, Windows 8 can take a bit of getting used to. There isn't a start menu. You can download a fix to this at:[...]Check it out. I love this laptop now!!!Thinking of you always,Magnumous", "Date": "December 8, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "AMD A6-4400M Accelerated 2.7GHz up to 3.2GHz with AMD Turbo Core Technology 3.0 1MB L2 Cache Processor/\n6GB DDR3 1600MHz Memory, Expandable to 16GB/6 cell/48Wh Lithium Ion battery/\n640GB 5400RPM Serial ATA Hard Disk/DVD SuperMulti drive/1 HDMI, 1 RGB, 1 RJ-45, 1 Security Lock, 1 Microphone, 1 Headphone/\nBuilt in HD webcam/17.3\" diagonal HD+ widescreen TruBrite® TFT LED-backlit display (1600 x 900)\nAMD Radeon HD 7520G/Wi-Fi Wireless networking (802.11b/g/n)/3 USB (2 USB 3.0 + 1 USB 2.0 port with USB Sleep)/", "Name": "Toshiba L875D-S7332 17-Inch  Laptop (2.7GHZ AMD 4400M Processor, 6GB RAM, 640GB Hard Drive, HDMI, Windows 8)", "ImgURL": "http://ecx.images-amazon.com/images/I/31gfugPQWIL.jpg", "ProductID": "B009XTWJYE"}}