{"Reviews": [{"Title": "This computer is horrible.  Period.", "Author": "Albert Kwon", "ReviewID": "R2X2AT1JXLSNZ0", "Overall": "1.0", "Content": "I purchased this computer for my wife for nothing more than basic computing. In other words, it was purchased to browse internet and to run basic office products.  It cannot even do that without insane load times. . . I have a mid-tier laptop I purchased in 2006 that runs better than this!  It is quite frankly an embarrassment to HP to sell.  In light of my experience, I may avoid their products all together.", "Date": "December 18, 2013"}, {"Title": "Such a great price for a laptop!.", "Author": "maricer acevedo", "ReviewID": "R2ZALC8PW8B9V4", "Overall": "5.0", "Content": "Such a great price for Compaq laptop!, it was a great deal!, I think when I've bought it, this product was at a good offer!.Thanks!.", "Date": "September 1, 2013"}, {"Title": "I had to get use to the it.", "Author": "LittleMama", "ReviewID": "R657FF6EVU454", "Overall": "5.0", "Content": "I love my new laptop. I loved my old one (also a Compaq) with Vista but it died. I had to get use to the Windows 8 and the removed numerical key pad on the right.  This took just a  little bit of time and now I am comfortable using it. The solid color is appealing  and it is lighter than the old one. I payed less for this one and that made me very happy.", "Date": "August 26, 2013"}, {"Title": "This laptop is amazing,", "Author": "loriana lathulerie", "ReviewID": "R1124OQKO3CN7T", "Overall": "5.0", "Content": "Is fast and i mean fast. Yep i only had a couple of horus using it blah blah but it is what it is. I was a little inhibited for the whole \"new windows 8\" but one get is to it. So for the price you get a amazing computer.", "Date": "August 2, 2013"}, {"Title": "HP COMPAQ LAPTOP COMPUTER.", "Author": "James T. Burris", "ReviewID": "R1OSBMM9ZHG78L", "Overall": "5.0", "Content": "I bought this computer for my Grandson in order to keep him off my computer. I am pleased to say it worked quite well as to what I needed it to do. It was easy to set up and operate and my Grandson loves it. He is 9 years old and into the computer craze like all the young people are. He takes it with him every where he goes. I will be getting another for for a Xmas gift so my 14 year old Granddaughter will quit yelling about her cousin getting one and she didn't. I can't win for loosing.", "Date": "July 27, 2013"}, {"Title": "Laptop", "Author": "Sharon Cox", "ReviewID": "RP5TXBPBBUCDN", "Overall": "5.0", "Content": "The laptop was purchased as a gift to my daughter and she loved it. Only had it 2 weeks when her house was broken into and the thief stole it.", "Date": "October 2, 2013"}, {"Title": "perfect", "Author": "Diego", "ReviewID": "ROLP4KTOP7809", "Overall": "5.0", "Content": "the computer arrived on time. it is very easy to use computer even if you are new in the system. perfect !!!", "Date": "February 15, 2013"}, {"Title": "EDIT to review - From one star, to three stars", "Author": "Paul McDonald", "ReviewID": "R2ANNMO2JL4NK9", "Overall": "3.0", "Content": "I just want to say to all: do not buy! Compaq isn't even a real company anymore. You go to Compaq site and try to shop for computers, and it redirects to HP site. Yes, HP bought out compaq. But I mean that you don't even see compaqs on HP's site, either. Besides, there's no such thing as AMD Celeron processor! The Celeron was INTEL! So the specs on this item are a LIE. Also, Compaq uses very generic parts. The computer will fail very shortly after ordering it.So, incorrect specs, windows NT is a very old OS at this point, and 2 GB Ram isn't enough to do anything with nowadays. This is a horrible idea and Amazon needs to better filter their products before selling them. Horrible, Horrible, Horrible.Get Samsung, Sony, HP, or Lenovo with good specs based on your needs. This computer is a FLUNK for everyone. Pay more for something that will last - not for something that will fail or fall apart. Oh, and about warranties - if you need them, there's a problem. You will use up the warranty with many many headaches. Stay away from Compaq! And stay away from this product!  EDIT  EDIT  EDIT  EDIT  EDIT  EDITEDIT: I am editing this review because they corrected their specs. So good going on that. I still see things wrong, but at least the specs were corrected. And very happy about AMD processor. Actually, they are calling it an HP now! WOW! But, I can not give it ABOVE a 3 star, unless I tried it myself.", "Date": "December 14, 2012"}, {"Title": "A lesson learned, one gets what one pays for.", "Author": "Ms. Susan Coleman \"Money Pitted\"", "ReviewID": "R2GUZPKMT5LDGV", "Overall": "1.0", "Content": "First of all, I hate it because it has Windows 8.  For what I use the computer for, many of my downloads cannot be downloaded because the vendors are not up to speed on Windows 8!  Secondly, HP decides to come on line on my machine in the middle of a fine Sunday afternoon and disrupt me.  Third, the accents of the attendants at the HP helpline are difficult to undertand.  And lastly, it keeps freezing...I have to take the battery out.  At least that's what one techie at HP told me.  Never heard of such a thing.", "Date": "April 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009A17B7U"}}