{"Reviews": [{"Title": "A great laptop", "Author": "Lee", "ReviewID": "R38OHM4D2VH5KZ", "Overall": "5.0", "Content": "It was easy to set up right from the box.It came preloaded with win7 which was my choice.It has a very durable case,strong hinges and an incredible keyboard.The display is sharp and crisp.There was hardly any bloatware to remove.The only thing(very minor) is that the external speaker jack is in the front which is unhandy at times as I like to use an externalkeyboard from time to time.It came eqipped with 4gig of ram which is OK for most things.I added 4Gig and it made the laptop very quick.I would highly recommend this unit for any one.", "Date": "January 24, 2013"}, {"Title": "HP cus serv rep *called me* to offer follow up assistance!", "Author": "F. A. Fitzgerald \"Frank\"", "ReviewID": "R24QDFCLPEYGEN", "Overall": "5.0", "Content": "Arrived on time 3 weeks ago. Easy setup. Wanted a laptop to replace an aging, slow-moving tower used mostly for email, Office docs and, more importantly, streaming video to our tv. Our goal was to have the Notebook's on-board display + VGA & HDMI displays lit up simultaneously. Intel (processor manufacturer) specifications stated \"Supports - 3 displays,\" but a pre-sale HP support guy said this was not possible and that only 2 would be available at a time. We didn't have confidence in his answer, so decided to go ahead and buy. Turns out he was right, though it can be done by adding a $150 multimedia docking station.It was a bit bumpy getting the various displays configured for switching back and forth. At one point I thought that it might require plugging and unplugging the external displays- which did not make me happy. I called HP post-sale support for assistance and got a guy who told me that the laptop *was* capable of using all three displays simultaneously. But he wasn't much help in showing me how to work out the software (Intel Graphics & Media Control Panel) configs to switch monitors and I had a sense that he was in above his head. He left me with the time honored \"Update the graphics driver.\"After poking around a bit, I found an HP app already installed which informed that I needed quite a few HP updates (some probably programs I will never use), but the graphics driver was not one of them. I confirmed that the driver installed is the latest. After installing the updates, I was able to get the monitors co-ordinated and we are doing fine.What impressed me the most was that, a few days after my call, the HP tech guy *rang me up* to inquire if the problem had gotten resolved! I cannot remember the last time a customer service rep from any company called me back to find out if I needed additional assistance. For that alone I would give HP 5+ stars if I could.", "Date": "March 24, 2013"}, {"Title": "great laptop", "Author": "Elaine", "ReviewID": "R34692N9PNWC4N", "Overall": "5.0", "Content": "very happy with this product. I would recommend it to any one.  I would purchase it again it is worth the price", "Date": "September 4, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Operating system installed - Genuine Windows 7 Professional with Windows 8 Pro License\nProcessor - Intel Core i3-3110M (2.40 GHz, 3 MB L3 cache)\nStandard memory - 4GB 1333 MHz DDR3 SDRAM\nInternal drives - 500GB 7200RPM SATA HDD\nOptical drive - DVD+/-RW SuperMulti DL", "Name": "HP ProBook 4540s 15.6\" Business Notebook PC - C6Z36UT", "ImgURL": "http://ecx.images-amazon.com/images/I/41oYjItF5oL._SX300_.jpg", "ProductID": "B009PHV8QY"}}