{"Reviews": [{"Title": "Excellent laptop. Better than the Dell XPS 15.", "Author": "A. Ochtinsky", "ReviewID": "R1TCLUW0KAC4X2", "Overall": "5.0", "Content": "It would be hard to say more than the other extensive reviews already here, so I won't try; they're there if you want to read them. Here are some salient points, specifically comparing this machine to the Dell XPS 15. If you happen to be comparing the two, maybe you'll find this useful. (TL;DR warning. There is a summary at the bottom if you prefer)I first bought a Dell XPS 15 (highest-end model, with 1 TB + 128GB SSD drive), for $800 more than this laptop. I didn't like it, and here's why: - Dell XPS: Bad trackpad. Vizio: Good trackpad. - The Dell has a delay on every action. A lot of false detections of gesture. Can't possible configure it to accept a double-tap as a right click (only a double-full-click). I can't stand the Mac-inspired \"press the whole trackpad as if it were a mouse button\". Conversely: the Vizio has an excellent trackpad, on par with the MacBook Pro, and handles double-tap and every other gesture I care to use without any trouble. Also, the Dell's trackpad seems to have higher friction than the Vizio. Both use basically the same finish for the trackpad as the body; the Dell's matte rubber body would seem to require a \"stickier\" finish on the trackpad. - Dell XPS: Excessive fan noise. Vizio: little to no fan noise. - I bought the XPS (and Vizio) because I want to at least occasionally play games. I'm not super hard-core, I don't need an AlienWare, but I at least wanted something on par with my 6-year-old MacBook Pro; these days, it seems like 99% of all laptops have no discrete graphics. The Dell XPS 15 has the same chip as this machine. The performance in Skyrim (full HD resolution, high graphics), while not stellar, is playable in both. However, the Dell needs to spin the fan at max RPM constantly, generating a racket well in excess of a full-size room-cooling tower fan right next to it. Meanwhile, the Vizio, running the same game at the same performance, only sometimes needs the fan, and the volume is much lower. The actual heat of the laptop (to the touch) is far less, as well. I credit the metal casing, as opposed to rubber (seriously? rubber? in a heat-sensitive device?), and likely superior cooling for the GPU. - Dell XPS: Heavy. Vizio: light. - I didn't expect this, and I'm not sure the official specs can back me up, but I'll be damned if the Vizio isn't at least 1/3 lighter than the XPS. It's the lightest 15\" I've ever handled...lighter than a MacBook Pro. Not sure what the deal is. Maybe better heft? Something about build quality? It's light. Really light for a 15\" that can play 3d games like a boss. - Dell XPS: Backlight chiclet keyboard (good!). Vizio: Non-backlit traditional keyboard (less good). - The Dell wins here. I liked that keyboard. The backlighting I can understand--the Vizio is 40% cheaper at nearly the same internal specs. The flat style vs chiclet? I think that's a matter of personal preference. I don't like the Vizio's arrow keys--there are two different sizes to force the bundle into a solid rectangle--but it's hardly a deal-breaker. - Dell XPS: Normal Dell charger (ugh). Vizio: nifty new charger (yay!) - Coming from a MacBook world, I was dismayed to see the sad state of PC laptop chargers. I feel like I just stepped back in time by a decade. That being said, Dell chargers are hard to come by without buying direct, in some cases paying 3 digits. What? Seriously, wtf? Even Apple charges 50-60 bucks for a charger...and they're APPLE. And apparently Dell computers detect if the charger is \"genuine\" and won't charge if it isn't. Okay Dell, get off your high horse. You're Dell, not Apple. I will give them this though: if you already have Dell laptops, your existing chargers will likely work. - The Vizio charger isn't a MagSafe (damn patents), but it's perhaps the next best thing. Less bulky than the Dell charger pin, with a colored LED to let you know if it's charging or not, it was a welcome change. Unfortunately, I cannot find a replacement charger anywhere on the internet (at this time, Vizio is \"out of stock\" with expectations of having more stock soon). Ding vs Vizio. Still, if they get more stock soon, all is forgiven. They're smaller than Dell or Apple, I can understand. - Dell XPS: Windows 8. Vizio: Windows 8. Result: draw. - Windows 8 is terrible. Awful. Abhorrent. Stupid. Folks, I've been using Microsoft operating systems since 1985. I'm not some Johnny-come-lately. I've never been a huge fan of Mac OS, could never seriously embrace Linux full-time, and have never used anything but a DOS/Windows machine as a primary dev/gaming/general use box. I say this in my full capacity as a consumer, a developer, a gamer, and an IT professional: Windows 8 is a usability disaster so bad that I honestly hope Microsoft permanently goes out of business (or at least leave the OS business) forever. As a tablet OS, it's at least a distant 3rd place. As a desktop OS, it is a crime against humanity. - That being said, both machines ship with it. If you use the new UI, the Vizio is your best bet (see previous issues with trackpad gestures). If you use the Desktop (and Pokki!) like a boss, it doesn't really matter. It's just software. But it's worth mentioning; unless you're 100% cognizant of who is to blame for the awfulness of Windows 8 (hint: neither Dell nor Vizio), you might despise either of these laptops (at least until you learn how to replace the Start menu and stay in Desktop mode). - Dell XPS: Attractive. Vizio: Very attractive. MBP: Extremely attractive. - I admit it. My primary laptop for the last 6 years was a MacBook Pro. I like an attractive machine. More importantly, I also like a machine with serious build quality--none of this creaky plastic that slowly loses its paint job and accumulates nast. After more than 6 years of heavy use, without any babying or protective casing, my all-aluminum MBP looks about 90% as good as the day I bought it. I can't say the same of any plastic PC laptop of half that age. - As any serious laptop buyer knows: most PC laptops are ugly and poorly built. That's changing (slowly (way, way, too slowly)), but there are leagues to go just yet. With either the Dell XPS or the Vizio, you pay a premium for appearance and build quality. Of course, in the Vizio's case, that premium is much, much less. - The Dell XPS is made primarily of metal (one would think aluminum, but the relative weight has me wondering if it's actually steel...or maybe polonium). The top looks very MBP-like, save for the Dell logo instead of an Apple logo. But the working surface (the one with the keyboard and trackpad) is covered almost entirely in black rubber. Why? I don't know. Just to be different? I'm paying for aluminum. Apparently aluminum costs hundreds of dollars per pound in laptop form (as opposed to ones of dollars per pound in any other use ever). So I shelled out the cash...why coat it in rubber? Rubber is high-friction; that's why tennis shoes have rubber soles. Got a pet? Or hair? Or humans living in your house? Count on hair, lint, and dust clinging to that rubber like Spider-man to a skyscraper wall. - Meanwhile, the Vizio's exterior is nearly 100% metal; the bottom is rubberized, but that's fine. I don't really care if cat hair sticks to the bottom. The top of the main body, and of course the top of the laptop when closed, are 100% metal, with the usual silver finish. Like that color? You'll like this. It also happens to be much less high-friction (see above), and I suspect far better at conducting heat (see above again).A few notes about things where neither one wins: - Both of these machines have the same problem for me: when running 3d applications on an external monitor (via the HDMI port), the screen frequently (3-10 times per minute) flicks off and back on, with 1+ seconds of blackness, rendering it unusuable. This *only* happens in \"second monitor only\" mode, as opposed to extended desktop mode, or built-in-display-only mode. Because it happens in both machines, I suspect the Nvidia GPU--common to both--is at fault. So far, driver updates haven't fixed it, but I suspect it will be fixable (on either machine) eventually with only software updates. - Both machines seem to be having WiFi problems, with the connection randomly dropping (interval ranging between 5 minutes and a few hours), requiring manual re-connect. I doubt it's either laptop's fault (I haven't begun to rule out my home network, although it's worth mentioning I have two different routers from two different manufacturers, one of which is a WRT54GL, not exactly known for unreliability, and none of the 14 other WiFi devices on my network are having these problems), but the Dell does have a lot of complaints about WiFi, and it has me wondering if both of these machines are using the same, faulty chip, antenna, or some other such component. In any case, YMMV, but this is certainly the kind of thing either manufacturer should be on the hook for, should it affect you.Well, there you have it. Didn't mean to ramble so much, but hey: more data > less data, I guess. I'll update if I find a solution to the WiFi or GPU problems.TL;DR: if you're comparing a Dell XPS 15 to this, buy this. The performance is a virtual match for the high-end Dell XPS 15, but a vast price difference (at the time of purchase: roughly $2000 for the Dell, $1200 for the Vizio), and every single feature of the Vizio is at least as good, if not better, with the exception of a backlit keyboard and subjective appraisals of appearance.", "Date": "December 6, 2012"}, {"Title": "Fantastic, but not without it's irks.", "Author": "Reuben Shea \"Binsk\"", "ReviewID": "R17AIKWG4I1YBE", "Overall": "4.0", "Content": "While this computer is $999, go for it! Fantastic price for this piece of tech!That said, I purchased this laptop before the discount, and even then I think it is a fantastic price for what you are getting.The two most iffy parts about the computer:1. The touchpad. Whew boy. Initial thoughts, \"I love it!\" 20 minutes later, \"I completely LOATH it!\" About 4-5 hours of use later, \"Meh, it is ok.\" Firstly, the gestures with this thing are fantastic, very smooth, work flawlessly most of the time. No complaints there. Moving the mouse around is speedy and very sensitive, which is great as well. I haven't really had any of those glitchy jumps and such that were described in the earlier models. The issue is when you start clicking. I found that clicking wherever your finger lays on the touchpad is the most accurate way to go (though still not flawless). Moving your finger to the bottom of the touchpad often makes the mouse jump a little bit when you click, often making you miss what you are clicking if it is small (though this still happens a little when using the whole pad). However, the top 1/4 off the touchpad isn't really clickable because the buttons ARE actually at the bottom.EDIT: I find that the bottom of the touchpad goes down into the case a LOT when you click on it. I am thinking the mouse moves when clicking near the base because the touchpad is actually flexing a decent amount, making your finger roll a little or something. Not a huge deal, kinda annoying but not too hard to get used to.2. The keyboard is a little shallow, but very solid. The keys are bigger than average, and quite close together. This might take some getting used to, though I honestly love the layout of this keyboard. I miss my page up and page down buttons (EDIT: Though not labeled, holding FN and using arrow keys act as page up/down and home/end), but I can indeed make due without, though it really wouldn't have been hard for them to add as the have plenty of room. There is one annoying glitch with the keyboard where it sometimes registers a key twice. I have played with it a lot and it isn't my typing, the keyboard does indeed register key strokes twice here and there. It happened twice with typing the previous two sentences. Another small gripe is the shrunk up and down arrow keys. I would have been happier if they just shrunk them all, as shrinking just the up and down makes it a little awkward to use in video games because of the different size. However, like everything else, it isn't that hard to get used to. And if it REALLY bugs you, redefine your controls in-game to something else.The rest of the computer I find superb. The frame is extremely solid, very little flex in the monitor (which is absolutely beautiful), not to mention the whole machine has a fantastic simplistic design. It is a little hard to open, though you will soon discover the required technique and can open it with one hand. Also, the edges of the computer are decently sharp and can leave marks on your wrists after even short periods of use.For such a thin laptop, you get some decent guts for a fantastic price:- Intel i7 ivy quad, 8 threads, with 2.3ghz clock and 3.3ghz boost. (Intel 4000 integrated graphics, but who cares? ;] )- Nvidia 640m LE of which I found was a Kepler with DDR3 and 1GB vram(to those who care, as there is a Fermi and DDR5 version as well) Underclocked base to 500mhz, boo, but there are ways to remedy that. This thing ran Unigine in 720p with 2x antialiasing, full tesselation, 2x anisotropy, and full shaders without dipping into the single digits, though it got awfully close. It liked the framerates of 11-17 in the heavier areas (This isn't a good analysis by any means, but take what you can from it).-8GB DDR3 1600. You're not going to be upgrading, but you shouldn't really need to.Also to note, I have yet to see this thing get really hot, even running Unigine (though I didn't run it for more than a few minutes). If this thing starts to burn I will come back and say so. Secondly, I find the battery life is about 4-4 1/2 hours of basic web browsing and full brightness (though this thing is monitor plenty bright, even when half way dimmed).EDIT: Computer seems to be cooled quite well. I have done some gaming (GTA IV, UT3 and the like) for a few hours. It does get a bit hot under the speakers, however I am overclocking the video card a little and it still stays around 68-70C, highest it has ever reached was 72C. Not bad at all for such a thin laptop.So yeah, quick sloppy review by moi (I don't generally write them). I would recommend it because of the build quality, nice specs, and cheap price. The only determent is the keyboard glitch and getting used to the oddly sensitive mouse clicking.", "Date": "November 22, 2012"}, {"Title": "The best Windows laptop I have ever used.", "Author": "Phil ski", "ReviewID": "R1AF9QIMCKOAS0", "Overall": "5.0", "Content": "I've always been a desktop guy. My main machine I built by myself just to make sure everything was the way I wanted it. I never saw a laptop that could rival the power of a desktop that wasn't one of the 6 inch thick bricks they sell as \"gaming laptops\". I was excited by the ultrabook concept because it could eventually lead to a Windows revolution of thin laptops with solid specs, but the ULV chips inside are lacking in processing power and Intel Integrated Graphics 4000 was a bit of a let down. I was looking at the Asus UX51VZ for a really long time but the $2500 price tag immediately dropped my interest. So I sulked around for a bit until a video from The Verge about Vizio's new computers came out. It piqued my interest enough that I eventually purchased the CN15-A5.First impressions: The machine is gorgeous. The build quality is amazing. The device is heavy, but having this incredibly durable aluminum chassis is worth it. Also, not important but the box was very elegant and extremely durable.Powering it on: Boot was fast, but I credit that to the general nature of Windows 8. It's comparable to booting Windows 7 on an SSD. I went to ninite(.)com and downloaded all of my favorite applications as well as classicstart, which lets me skip the whole \"interface formerly known as metro\" thing and brings highly customizable start button back in. I recommend anybody using Windows 8 get it.First hour. WiFi dropping like crazy. After one drop the wifi antenna disconnected and I had to use an ethernet cable. I investigated and sent Vizio an email. Here's what I got:Thank you for contacting VIZIO PC support, I can definitely assist you with your inquiry.First you'll need to download the Win8 Wireless driver from the VIZIO Website. Then follow these steps:1. In desktop press WINKEY + X and press Device manager on the context menu on the bottom left.2. When Device Manager opens open the Network Adapters list and Right Click \"Qualcomm Atheros\" and Uninstall.3. A window should appear to confirm Device Uninstall, Check \"Delete the driver software for this device\", Press OK.4. Reboot the PC5. Run the WLAN installer and check remove to uninstall the software windows could not delete.6. Reboot the PC7. Run the WLAN installer and to install, it will ask to launch the installer, keep it checked and run the installer.8. In the installer it will come with \"Previous Installation detected\", Check Uninstall and press OK to remove, Press OK to remove profiles. Press Finish9. Reboot the PC10. Run the WLAN installer and check remove to uninstall the software once more.11. Reboot the PC12. Run the WLAN installer and complete the installer now. (It should install straight forward now). Finish. Wi-Fi should work without rebooting now.13. Double check to see if \"Metered Network\" Is turned off in PC Settings > Devices.14. Test the wireless now.This did the trick.Keyboard+Mouse: I only use mechanical keyboards, which should be a sign that I'm picky. It's been three days and I'm still getting used to it, but it's definitely better then most. It should have a backlight though. The mouse is the first I've used of it's kind. The multi-touch gestures are very convenient and work pretty well. Vizio did a great job on it when compared to the generic ones I'm used to. One thing to note is when you click using the center of the trackpad the pointer skips a little. It's a pain but I'm getting used to compensating for it.Battery: Not impressed. Getting around 4 hours with Windows Signature settings, but I am downloading something 99% of the time. I'm sure I could get 5+ when doing general browsing and music, but still, the fact that this is still an issue in our world baffles me.Screen: Amazing. I'm not a fan of matte displays but this one does it right. No annoying color shimmer from poor application of matte coating. 1080p was a necessity on a laptop and this one nailed it. Maybe Vizio used some of their TV technology on this one.Gaming. As of this review, there has been no in-depth gaming analysis. I've played a few games now. I overclocked the GPU a little and I reccomend you all do the same. I used a program called MSI Afterburner to do it.BF3: Definitely the one of the most demanding games out there. 1080p is unplayable with anything above low settings. I played with many resolutions and settings and got the 40-50 fps I needed with nice settings at 1600x900p with a mix of low to high settings. Everybody is different in this aspectL4D2: Not the most demanding game, but a 3d game nonetheless. I play it at 1600x900 at max because I like the satisfying gore effects. 1080p would be easy if you turned it off.Civilization 5: 1080p with medium effects its very playable. As my civilization got bigger I had to drop some things a little, but this game is perfect for this computer because you can play it without a mouse.Borderlands 2: 900p at medium/high settings. Very fun game btwLooking forward to trying more!Final thoughts. Although the WiFi should have worked out of the box and the keyboard could be backlit, it's a fantastic computer. One last thing worth mentioning is the general sluggishness of the 5400RPM drive. The SSD caching really helps when it's being utilized, but 32gb only goes so far, but keep in mind this is coming from somebody who only uses solid state storage in his primary computer, so it may be perfect for you. I'd still like to repeat that it is the best Windows computer I have ever used.", "Date": "December 27, 2012"}, {"Title": "Hi performance in a somewhat flawed package", "Author": "Tariq Gibran Hamid", "ReviewID": "R7QC46MH8NO6O", "Overall": "2.0", "Content": "Like a few others, this laptop had peaked my interest with it's combination of price/ performance and screen quality and I finally took the plunge.  Having used 13\" laptops, including a 13\" Macbook Pro Retina most recently, I was a bit surprised by the size.  Even though the specs are right there to see, this laptop just feels BIG.  Not heavy but it sort of pushes what is comfortable using in ones lap.  I think part of this has to do with the tapering design of the bottom case with what appears to be a flat piece of metal on the top creating an overhang or lip around the edges. These metal edges have not been rounded/ smoothed in any way and I was a bit shocked by how sharp they are.  Touch the case edge with your hands, arms or wrists - say while typing- and, after a while, it sort of becomes a bit chafing.  I've only been typing on this laptop now for a few hours and already I'm not sure if I will be able to put up with these sharp edges.  The problem seems so obvious, I don't really see how the laptop was released with this issue.  For that reason, I think it would likely be better used on a desk or table, preferably with an external keyboard and mouse.  It's really a shame because that's the one really major issue I have noticed, but it very well could be a deal breaker for many.As far as the positives, there are many.  First off, this thing flies.  It is as powerful,if not more-so, than most higher end laptops available with it's I7 quad core processor.  Running Geekbench in 64 bit mode, this 1K laptop scored over 13,000.  That's right up there with the 2K+ 15 inch Macbook Retina Pro and about twice as fast as the 13 inch Retina.  This also translates perfectly into real world use as I was able to batch process raw files at twice the speed of the 13\" Reina mentioned above.  Simply outstanding performance.Secondly, the IPS matte screen is very good once calibrated - but note it looks pretty dismal with regard to color accuracy and gamma without calibration out of the box so to speak.  There is a little light leakage at the bottom right occasionally with an all black screen but I have really only noticed it when booting up.As far as the keyboard, it's fine though I do wish it was lit AND that the keys were a bit more concave like my ancient 15\" Powerbook keyboard [which this one looks as if it were trying to emulate}.  It has a decent action but not as good as any of the Apples nor the Lenovo's.  The trackpad also seems fine.  Not great nor terrible but perfectly serviceable.  I actually found my favorite trackpad not to be one of Apples - which are very nice - but the glass trackpad on my wifes Lenovo Ideapad U260 from a few years back.One thing which also surprised me about this laptop was the really HUGE power adapter.  It is the size of a brick almost, certainly the largest one I have ever seen.  Another reason why this is not really that portable of a laptop, even for a 15 incher.  Really, it feels more like a 16-17\" portable computer in use.Finally, the fan can be annoying as it cycles on and off in a sort of whining way.  Coming from the Retina, this was very noticeable and annoying as the Apple fans are almost silent.Least this all sounds a bit negative, this really is quite a bargain for what you get given the performance, screen quality and, as mentioned below, upgrade-ability.  If one is looking for strictly performance and a very decent, IPS screen in a not so portable package, it would likely be difficult to find a better deal.  But, If one needs portability in a more refined, user friendly package - this is not it - but, of course, THAT one will cost you!Edit: Due to constant wifi issues [random disconnects from network] and a battery life that, at best, is only half of what is claimed, even under light use such as web browsing, I have reduced the rating from three to two stars.  At this time, I can't recommend this laptop.", "Date": "December 12, 2012"}, {"Title": "Vizio CN15-A5", "Author": "myAmazon", "ReviewID": "RCVKF34JDCMZL", "Overall": "5.0", "Content": "I'll get straight to the point.  The first thing you notice about the computer when seeing it in person for the first time is that it is simply a beautiful machine.  I couldn't be happier with the design and appearance.As others have noted, the computer is super fast when booting up.  The display is amazing.  The keyboard is easy to type on. I read some reviews on other sites that they keys are not spread far enough apart, but I find that they are quite comfortable and easy to type on. The touch-pad, IMO, is great.  Someone wrote about how when clicking with the button it moves the mouse.  To me, that seems to come more from sliding your finger on the button while pressing it.  If you press straight down, the mouse doesn't move.  At least in my experience.  I love the gestures and the size of the touch-pad.Nobody has mentioned this, but I absolutely love the charger.  I've had to replace chargers on several different machines because the way they are built.  I think this is a charger that will last a long, long time.  I personally have not seen one built like this.The specs for this machine are great which makes the price I payed for this machine seem like somewhat of a steal.  The machine runs quietly and it remains cool, which is a total plus.  My wife's XPS gets super hot, and I can't stand it.I was a little worried about Windows 8 being the OS on this machine because most everything I've read about 8 has been negative.  However, after playing with it some, I've found that it's not as bad as some make it out to be.  I still may make a change to Windows 7, but I haven't decided for sure yet. (You can get the normal start menu you on your desktop.)A couple things I'm disappointed about are:1. No back-lit keyboard.  This wasn't a deal breaker for me, but I would have loved for that to have been included.2. There is no disk drive in this machine.  Again, this isn't a huge deal since you can by an external disk drive for $15 or $20, but I just thought I'd throw that in there.  I guess it could be an inconvenience to those that travel a lot and want to watch DVDs, but that's not me.All in all this is a 5 star machine, and I'm very pleased with my purchase.  If you're looking for a Windows machine with the look and feel of the MacBooks, this machine may be the way to go.", "Date": "November 28, 2012"}, {"Title": "Decent laptop, not without its flaws.", "Author": "Allen Mak", "ReviewID": "R247VO0VCB2IA8", "Overall": "3.0", "Content": "Many of the points here will be repeats, but I'd like to add my two cents in case there are some who want to trawl through the reviews.  Overall the laptop is very good on paper, acceptable in performance, and has some quirks that could turn people towards another brand.Pros:-Aluminum construction for \"Premium\" feel and look.  It is a very nice machine to look at.-Full HD (1080p) Display: Great for viewing your media, putting two documents side-by-side, etc...  The display is decent as far as laptops go.  The one used in mine is a LP156WF4-SLB5 manufactured by LG.-Microsoft Signature: Clean install of Windows, no bloatware!-Nifty charger with LED that changes colors to indicate level of charge-Discrete Nvidia graphics: relatively decent for *light* gaming, able to switch with the Intel integrated graphics to save power.  However this setup may cause bugs or crashes.  The latest drivers from both companies go a long way toward mitigating this.Cons:-Edges: Fairly sharp. I haven't been cut or anything, but they can cause a lot of discomfort depending on the position you're using the machine in.  Also the lid is hard to open until you figure out a trick or two to use it.  (I find that lifting it from the side is easier than trying to get my fingers into the slight notch in front.)-Windows 8.  I know this complaint has been hashed endlessly by now, but this was my first Windows 8 PC so I was extremely frustrated trying to break into the new features and Metro UI.  Using the touchpad and start menu were very poor experiences for me.  Ultimately I used 3rd party software and played with PowerShell to revert some of the changes Microsoft made.  Hopefully Windows 8.1 will be better off the bat on PCs!-Lack of peripheral ports:  There are only two usb 3.0 ports and one headset/microphone 3.5mm jack.  While not be a problem for one on the go, the lack of usb ports and separate 3.5mm jacks (I have separate headset and microphone) disqualify it as a desktop replacement in my book.-Typing experience: While some have not had a problem with the keyboard other than the lack of backlighting (something I find a nonissue), I find that it leaves much to be desired.  The keys are *very* shallow-feeling (hardly any accentuation response until you hit the bottom) so typing quickly causes me to skip some letters and occasionally double-type letters. (Normally 85 wpm, laptop 60 wpm)  Moreover, I found myself incessantly swiping the touchpad while word processing without any FN-key combination to turn off the touchpad!  Thankfully there's a software called Touchpad Blocker, which can turn off the Synaptics touchpad with a simple key combination.Neutral observations:-Audio: Passable, but if you're used to audiophile products they are the typical quality OEM products that will fail to impress.  The SRS audio application helps a bit.-Battery life: My typical experience with the battery reveals that 3-5 hours will be the max depending on what you're doing.  I don't have much a problem with this, but those on the go will want to tweak the power and hardware settings to get every last drop of life out.-VIZIO driver support: Fairly standard manufacturer driver support on their website (generally speaking *poor*).  There are the usual outrageously out of date (Graphics driver) while there was one missing (the touchpad update, judging by the version numbers, it would probably be very important!).-Heat:  Under normal circumstances (word processing, watching videos, browsing internet, etc) there have been no problems.  However once you get under full cpu load with video editing, playing games, rendering 3d animations, etc... it will get very hot.  The exhaust grill is under the monitor hinge at the bottom back of the laptop, which makes it pretty uncomfortable to use on your lap and is extremely poor at dissipating heat until you've finished your task.-Wifi connectivity:  Reading all the reviews complaining about the faulty wifi drivers convinced me to immediately upgrade as soon as I switched the machine on.  All-in-all it's like many other windows laptops I've used in that I can't tell if it's the router or the laptop itself that is the problem half the time.  (I can assure you the other 50% of the time it's the 2.4ghz congestion in my neighborhood...)", "Date": "July 29, 2013"}, {"Title": "Overall good, but with some issues", "Author": "Rahul Tikoo", "ReviewID": "R1JM8WSRJDWMWP", "Overall": "4.0", "Content": "I ordered based on the reviews and generally most are spot on.  I do really like the laptop and will most likely keep it.Pros:-Price is fantastic for what you get-Speed...super fast, lots of memory, good graphics card.-Build is nice, i like the aluminum body and it doesn't feel super heavy.  Pretty thin also and haven't seen any flex.-Screen is very good, great angles, sharp, love the 1080p.-Track pad is good if you use the Synaptics software and not the Vizio software.  It gives more options for customization and -features.-Battery life is decent for me...at  4+ hours i'm happy with it given specs.  This is mostly for web-browsing right now and work.Cons-Keyboard end, home, page up, page down are annoying to not have.  Arrow keys are annoying.  You can download free software to remap F11/F12 to Home/End (I use Excel and text editing a lot).  Free software i used was Map Keyboard.-Latest Wifi software causes disconnection every 2-3 minutes.  I found the Atheros software for the wireless chipset and used the 10.0.0.75 software and it's perfect...no disconnections for days now.-Aluminum edges are a little rough/sharp...they hurt your wrists if they are rest on the edge of the laptop.  It depends on the angle of your wrists/arms resting on the laptop...-Windows 8...i just dont like it for a laptop, gets in the way of doing things quicky.  I use Windows 8 desktop feature and Start8 from Stardock to give it the Win7 look.  I spent hours trying to reinstall Win7 and its extremely difficult given how Win8 machines are a lot more locked down in Bios and hardware.", "Date": "February 9, 2013"}, {"Title": "Best Value in Windows Machines", "Author": "Amazon Customer \"Blaskobliatch\"", "ReviewID": "R18L933E0ORCUR", "Overall": "4.0", "Content": "First off, here is my Spyder4Pro calibration file for this laptop's monitor. You can download it and load it in yourself through color management settings in windows.visualplastikDOTcom/stuff/vizio-spyder4-calibration.zipScreen was overly warm and yellow before calibrating. May take your eyes a minute to adjust to new profile.I would say its a nice laptop screen, on par with the pre-2012 macbooks. Not the new 2012 IPS macbook retina and some nicer external glossy IPS screens. Plenty of resolution for Photoshop.A mini displayport would be best for running my 2560x1600 27\" monitor. That would be the only way to run it at 60hz at that res. Currently I'm using the HDMI port and that is limited to 40hz at that resolution (custom intel graphic setting). Not really that noticeable a drop, unless you are gaming. Photoshop runs real smooth at that size so the GPU is up to par. I'm also running another 24\" monitor through EVGA UV+ USB adapter and that works fine thanks to the fast USB 3.0 ports.I would prefer the keys were backlit and had a bit more travel.The hybrid drive speed is good, not as solid as a full solid state drive. But you can always upgrade yourself later (likely will void warranty). And I believe you can manually upgrade to 16gb of RAM.Build quality is very nice. People definitely take a second look when walking by.One bug I've had is repeated drop-off with the internal wi-fi. Drops every 10 minutes some days, even with latest driver. Reverted to a cheap USB wifi plug from Amazon and problem went away, though that does swallow one of the two usb plugs.Internal bluetooth works perfect with a bluetooth mouse.MARCH 2013 UPDATEI've replaced the main drive with an SSD and upgraded to 16gb of ram without issues.Disclaimer: Not for faint of heart or those that wish to keep their warranty. I wasn't aware of what a hybrid drive was until now. There is a main regular spinner hard drive and an MSATA which is a caseless SSD drive that looks like a big stick of ram. Those two drives are set as RAID 0 to generate the increased performance. This means you can likely upgrade the MSATA drive separately, which is cheaper than a normal SSD and have two separate drives. I'm currently using the stock 30gb MSATA as a second drive in non-raid and haven't upgraded it.", "Date": "January 29, 2013"}, {"Title": "Great Laptop, even better price", "Author": "Mike", "ReviewID": "R12YZQ63ZI1FQF", "Overall": "5.0", "Content": "I bought this laptop as my official \"college laptop,\" and I am ecstatic to say that it was one of the best investments I made.The first thing that pops out of this laptop is the sleek design, beautiful 15 inch HD display, and the textures used on the laptop. More importantly though, the cheap price for such a great product. I believe that this is a hidden gem. I don't know how Vizio is managing to keep the prices so low, but I would take advantage of the opportunity before demand for this brand goes up. I was trying to find a Windows version of an Apple computer, and I think this laptop is it. I feel like I'm using the next generation of Windows computers, and I'm confident that this line will exceed Apple products.Pros:Excellent displayGreat specsDesign is modern and stylishThinPriceCons:Average battery life (5+ hours, with low brightness)No back-lit keyboardNo touch-screenCould've had an SSD, but that might have made it really expensive", "Date": "November 25, 2012"}, {"Title": "Took a chance on Vizio laptops and am very happy! (Not any more...)", "Author": "Robert Barkoski \"HighCaliber\"", "ReviewID": "R3RVYZOGJULWN1", "Overall": "3.0", "Content": "UPDATEJust under 2 months after delivery of the laptop the hard drive has failed.  I have contacted Vizio's tech support in South Dakota who pride them selves in being the best US based support...  Well after going through the steps neccessary to diagnose the hard drive as faulty and proving my purchase through AMAZON, Vizio decided to have the laptop repaired by having me send it in.  To send it in they have to email a shipping label of which the tech told me will take no longer then 2 days to arrive.  2 days via email...  Your kidding me right?  No they are not kidding.  So I wait 2 days and then some.  NO LABEL in my email and no SPAM either.  I call Vizio again:  \"I don't understand why you haven't gotten it...\"  Checking the email address revealed they have the right email so the tech offers to take over the order and produce a label himself.  From there I told him you have 2 hours to send me the label or the laptop gets it...3 hours later:  NO LABEL!  I call AMAZON who agrees to exchange (I love the hardware and if the drive fails on the new one, I'll replace it myself) the laptop on the spot.  The AMAZON CSR then says I'll email you a shipping label (in my head:  NOOOOO!)  My email dings and my label is there!  Within 30 minutes I had my busted laptop at the UPS store.  Good riddance!  Thank you AMAZON!----------------------------------------OLD REVIEWOk so I know Vizio makes a good TV for the money but when I saw they make laptops I'll admit I giggled.  However, being open minded I looked into them.  I needed a laptop with a core i7 and 1TB of storage.  That's right a TERABYTE of storage.  All the fancy cloud storage in the world can't hold an LCD to that.  Now on with the review:PROS:This laptop is well built with an aluminum chassis and exterior.  Holding one corner produces NO flex in the frame.  Pressing on the back of the LCD produces NO spots on the screen and the rubberized bottom makes the laptop a joy to grip.The keyboard is simple and useful for common typing tasks.  If you need a number pad look elsewhere.  Typing on it they way I do (my fingers are heavy) makes me feel like the keyboard can handle the abuse.The screen has a matte finish so it easy to see with less glare and it runs in a native 1920 x 1080 (HD) resolution.  Colors are nice and vibrant and the refresh rate is good with no ghosting at all.A dedicated video card!  Sporting a GeForce GT 640M LE, this Vizio can handle a lot more then solitaire.  I'm talking FPS or games like Fallout New Vegas at 1080 resolution.Speed!  with a Core i7 I was happy but with a hybrid flash drive and 1 TB of storage I'm ecstatic!  The thing boots insanely fast and hasn't bogged down yet.  I've thrown Photoshop, Vegas HD 10 and games at it and it just keeps going.Battery Life!  I feel the battery life is very good for a core i7 laptop with dedicated video card.  Now I haven't timed it but I've never said to my self:  \"The battery is dead already?\"...CONS:Heat.  Playing a game generates a lot of heat below and to the left of the spacebar.  I suspect this is the location of the video card and pushing 1080 res. at 30 fps is very demanding and the heat shows.The touchpad is nice but I turned off the pinch zoom gesture as it repeatedly zoomed when I wanted to scroll.Wireless.  Out of the box the wifi would only maintain a connection to ANY network for 5 - 30 minutes.  After an email to tech support in South Dakota, that's right South Dakota in the USA, I received a friendly yet detailed set of instructions to fix the problem.  Since then the wifi has not malfunctioned.SummarizeWho should buy this:  Power Users who need to have their data with them, secured and not floating in the cloud.  Also people who work for a living but like to play serious game titles to unwind.  People who do light video editing.  People with good taste :)  People who love change (Windows 8)Who should not buy this:  Avid gamers who do nothing but play games, you'll burn it up before the warranty.  People who just browse the web and socialize on face-tube ;)  People who want something lite-weight.  People who hate change (Windows 8)", "Date": "January 13, 2013"}, {"Title": "Great laptop, a few minor issues", "Author": "John Mason", "ReviewID": "R1GHRC0O871U21", "Overall": "4.0", "Content": "I've had this laptop for a couple of weeks now. Windows 8 isn't bad, but there is a big learning curve (google for shortcuts and tips). It took me a few days to get windows set up in a way that suits me. It's almost like using Windows 7 now, so I hardly even notice the difference. As soon as I got the computer, I downloaded all of the driver updates from Vizio's website. Overall, I'm very satisfied with this laptop and I think the next design from Vizio could be perfect if they would make a few changes.Pros:Incredible screen- wide viewing angle, very crisp, and the matte finish is awesomeSuper fast- Instant-on, just seconds to restartHigh-quality build- aluminum finish on the top and inside is very nice and seems durable. Underside is a plastic/rubber material. This actually helps to keep the laptop from sliding aroundCons:The edges of the laptop where you wrists rest are RAZOR SHARP. It can actually get pretty uncomfortable. This should really be rounded.The keyboard sometimes registers a keystroke twice. I've tried fixing this using the keyboard options, but no luck. Maybe a driver update will fix the problem?The sound is very marginal. Even playing music at a low level (14/100) it sounds like a busted speaker.Overall, I would buy this laptop again. I would give 5 stars if not for the uncomfortable edge, poor speaker quality, and keyboard issues.", "Date": "December 28, 2012"}, {"Title": "Excellent Laptop for the Price", "Author": "Geoffrey L Braden", "ReviewID": "REIZQ8JI0TMYO", "Overall": "4.0", "Content": "This laptop has a superb screen and is lightning fast with its i7 quad core processor. It has two problems. The Wi-Fi logs off at random times and needs to be reconnected manually. I used device manager and it states that my driver for the Qualcomm Wi-Fi chip is up to date. Also, I am having a little trouble adjusting to the short throw on the keys on the keyboard. I have a tendency to type double letters because the key board is a little sensitive because of the shallow depression of the keys. The computer has a beautiful deisgn (similar to the 15\" MacBook Pro). The 1920 x 1080 resolution and graphics colors on the screen are beautiful. This is the best configured laptop on the market today for the price.  I am editing my revview today. I havve been having a problem with the keyboard typing doublle letters that I have not been able to fix by increasing the delay in the keyboard manager in control panel. I also have adjusted the key delay by changing the keyboard delay in the Windows Registry following an edit of the Windows registry. This has still not corrected the problem. It does not seem like other users have hadd tthiis double key typing problem on the keyboard. This is a major usability factor howevver. I have left the double letters in this paragraph to demonstrate the problem. I do not think this is fixable with a registry tweak. The driver for the keeypad is from Microsoft from 2006. This according to Vizio is the most recent driver for the keyboard. Good luck if your keyboard types double letters because there does not appeear to be a solution for this problem. I have just created a Twitter page for this discussion. The hashtag is #viziokeyboard. Please continue the discussion if this is a design problem. I love this laptop andd it is a great deal for the money. I just cannot type accurately on the keyboard.", "Date": "December 26, 2012"}, {"Title": "Nice machine, but arrived with a dead battery", "Author": "Drew Bennett", "ReviewID": "R3NI6F8DY3WT3D", "Overall": "4.0", "Content": "This computer is a huge bang for the buck, containing nearly all competitive hardware to a MacBook. I haven't had a chance to do any heavy duty graphic design work on it yet, but I'm certain it will handle all my needs. I also own the Vizio All-In-One and have been very happy with its performance.The only reason it received 4 stars instead of 5 is due to the machine arriving with a defunct battery that would not hold a charge. This required me to send back the computer to Vizio for replacement, delaying me use by a week or so.All in all, a great value for the price.", "Date": "May 27, 2014"}, {"Title": "Beautiful display. Good performance. No junk software.", "Author": "Krista", "ReviewID": "R2A6PL4MKIGP97", "Overall": "4.0", "Content": "We got this for my husband, this is his review.You won't find a better display on any laptop. Vizio's IPS 1080P LED back lit display is simply beautiful. The CPU and graphics performance are quite good, especially considering the price of the laptop. Its nicely styled and not bulky. It has only two USB 3.0 ports but that's good enough for most situations. The built in memory card reader is a must. It has no DVD ROM drive.Windows 8 install is very clean. There is no \"bonus\" junk software installed like most of the major brands. This is my first use of Windows 8 and I'm not impressed, I see no point in giving an OS two graphical user interfaces. One is enough for anyone.The hardware in the laptop is standard intel kit with HD4000 and Nvidia GT640M. The motherboard includes two DDR3 Dimm slots with two 4GB sticks installed which is up-gradable to two 8GB sticks which I'll probably do later. It has a tiny 32GB mSATA SSD which Windows 8 uses as a cache for the 1GB SATA spinning disk. It boots into Windows 8 in a matter of seconds. The mSATA SSD and hard drive are begging to be side graded to dual 256GB SSDs which would yield data throughput of a RAID 0 array of between 800 MB and 1 GB / sec for high end Samsung SSDs.Linux installed easily with a Kubuntu boot USB drive (I run Gentoo). To boot linux the easiest solution is to install rEFIned, an open source EFI boot manager that recognized all OSes and an EFI boot-strap-able linux kernel which will load from rEFIned. I have not found a good way to get to the intel RAID BIOS setup. Setting Boot OS to \"other\" got me there once.The laptop has a few drawbacks. The first laptop we received could not charge its battery. We returned it to Amazon without issue, the second laptop did not suffer from that malady. There is a review on another vendors site that talks about the same issue. Clearly this is a production problem for the device.The keyboard is pretty bad. When I say bad, once in a great while it fails to type when a key is pressed and slightly more often will give two characters instead of one. I generally keep this laptop docked to an external USB keyboard so it doesn't matter to me, but it may become an issue when I take it on the road.When pushing performance to the limits, the laptop gets uncomfortably hot, so perhaps the label \"laptop\" is a bit of a misnomer.Even when idle the fan spins at low RPM. This might annoy some people, it doesn't really bother me.I take its quirks because its display is unequaled. I'm looking forward to future designs from Vizio. If they deal with some of the problems I've listed here, I'll be a happy Vizio owner for years to come.", "Date": "July 23, 2013"}, {"Title": "defect keyboard", "Author": "Nickolay", "ReviewID": "R7YDYK94P6RZ6", "Overall": "2.0", "Content": "Notebook arrived with defected keyboard. Button \"X\" like pressed all time itself. I have at the moment is not possible to send back notebook, and Vizio does not send a separate spare replacement of keyboard. ;( Sadness...", "Date": "June 28, 2013"}, {"Title": "If you thought that Vizio only made great TV's - think again", "Author": "Gary Burr", "ReviewID": "R32QEPKU3GM1LF", "Overall": "5.0", "Content": "Pros:There is much to love about this machine - speed, display, and features for less than $1000!.It does not get hot - not even a little bit - the fan is a little bit noisy when it kicks in - still better than having a sweaty lap.Instant startup is sweet.Cons:Windows 8 is DIFFERENT but once you find the Desktop mode - it is tolerable.The trackpad takes some getting used to - I will update this post in a couple of weeks.Not sure of how to get software loaded to the 32gb SSD - this may be reserved for system software.It seems to be bothered by the fact that I do not have any bluetooth devices - I will have to get some.Ok. The trackpad sucks - going back to usb keyboard/mouse.Update after a couple of months - the wireless drops multiple times per day and there is a hokey fix that I need to apply. The trackpad totally sucks and there is no getting used to it.", "Date": "February 12, 2013"}, {"Title": "Great specs but quality issues...roll the dice if you feel lucky", "Author": "DukeofWagner", "ReviewID": "R30GFKKUJNJ2AP", "Overall": "3.0", "Content": "This machine has the best specs for the price of any laptop on the market...I7 processor, 1080p display, 8gb ram, 1tb hard drive.  The display is beautiful as advertised and the overall fit and finish is clean.  Problem is, both machines I received were defective.  The first machine had a bad USB port.  I called Vizio support and they were fantastic.  They concluded that the port was defective and immediately offered to replace the unit.  The next unit I received had issues with the fan turning on and running for no apparent reason even when virtually nothing was running.  If the fan did shut off (if say the machine was idle for a while), it would turn back on the second I launched a web browser.  Not exactly high stress activity.  Once again, called Vizio support and they concluded that I needed yet a third machine.  That's when I decided to return it to Amazon.  I polled other users on Amazon and there were mixed responses as far as the issue with the fan.  Some had problems, some didn't.  That's why I gave it three stars..If you're lucky enough to get a unit with no defects, this machine is about as good as it gets.  If not, have plenty of packing tape on hand and get ready to be on a first name basis with Fed-X and UPS.Pros:Beautiful displayGreat lookingGreat performanceBest price performance on the marketClean Windows 8 install.  No bloatware.  Don't underestimate how important this is.Cons:Keyboard is very limited...requires function keys to emulate some of the most used keys on the keyboard including HOME, PgDN, PgUP and ENDTouchPAD is difficult to use.  If you are going to try to click or drag conventionally, make sure your thumb is firmly planted in the lower left hand corner or results will vary.  The only way I really could get it to work for me was to keep the default \"tapping\" on.  Also, make sure you download the touchpad update from Vizio support immediatelyAnother con: You will experience Wifi network drops unless you download the Wifi update from Vizio's site as well.Conculsion:  Not quite ready for prime time.  Vizio seems to be getting better with each generation of laptop and maybe third time will be the charm.  But right now, they clearly have quality issues.", "Date": "January 24, 2013"}, {"Title": "Excellent  Laptop for the price", "Author": "Joseph Picone", "ReviewID": "R3615VOKZMP1EH", "Overall": "5.0", "Content": "I've used a Dell XPS 15 and XPS 14.  This laptop is much cheaper and equally stunning.  The Dells had a wifi problem, so I returned them.The touchpad on this laptop is far", "Date": "November 21, 2012"}, {"Title": "Touch Pad and Keyboard= horrible", "Author": "SJG", "ReviewID": "R2LAD4D2Z2NPCW", "Overall": "2.0", "Content": "The computer itself is sleek and functional,for the most part. I do have issues watching videos (I have super fast internet and that's not the issue, it's the computer) and running multiple programs.Also have experienced multiple problems with the wireless connectivity (again, reliable internet and another computer operating without issue at same time) that would just disappear for no reason. It would take 20 minutes or so of shutting down and rebooting computer. SUPER STRESSFUL when trying to run a business from your laptop.The keyboard and touch pad could use a major re-design. They are not functional for everyday use and the keyboard sticks and the buttons are hard to push down after a month use. Everything else is fine but I would highly recommend another computer if you plan to use the keyboard and touch pad on a regular basis.It looks cool, that's about it and you are overpaying for that reason alone.", "Date": "March 18, 2014"}, {"Title": "bad computer", "Author": "Sal Burd", "ReviewID": "R2VL40MRUYT0LV", "Overall": "1.0", "Content": "It was dead on arrival. I could not turn the computer on. It looked ok but...I would not buy Visio for business", "Date": "February 20, 2014"}, {"Title": "Worth every penny plus", "Author": "Joshua Thompson", "ReviewID": "R1XEPJY5ABA7A3", "Overall": "4.0", "Content": "I got the laptop when it was on sale and I have to say I'm really impressed. It is well worth what I paid for and I am happy with it. Though the battery life isnt all the best but the screen resolution is wonderful and the graphic card beats the Intel 4000 series by far. The computers sharp design may annoy most because the edges are pretty sharp and may chafe you but it hasn't bothered me yet while I play games on it. Typical fast amazon shipping but the keys are spaced close together but with a lot of extra room around the keyboard. The design favors Mac book in a way just bigger keys and no spaces enbetween them", "Date": "February 10, 2014"}, {"Title": "Performs well but with some design flaws", "Author": "Paul S. Lewis", "ReviewID": "R2101ZXOEV7EIG", "Overall": "3.0", "Content": "This laptop performs well but has a few quirks that make it not ideal.The design is nice. The computer itself has a very clean look.It seems very quick. It easily handled any program I used on it such as Photoshop where I often do some fairly intense procedures. I'm not a gamer so I can't comment on that.The screen was very crisp & clear.What I do not like are many of the outside connections. The power brick is one of the biggest I have ever seen and it is impossible to find a third party charger like Targus or Kensington or even the cut rate foreign ones so if you want a 2nd charger you are stuck with buying one from Vizio at their outrageous price. The SD card does not fit in all the way so it would not be practical to use it as a ready boost or leave it in there. The ethernet connection is a little funky as it is hinged to put the connector in (Mine failed after about two weeks).So if you can live with those few oddities, this computer could work for you. Certainly the price is right, well below what most companies are asking for similar computers.", "Date": "February 9, 2014"}, {"Title": "This Laptop is pretty chill", "Author": "eric gu", "ReviewID": "RTNXMRIECB5P9", "Overall": "4.0", "Content": "I chose 4 stars out of 5 for only one reason: when it came, it had wifi problems that took me a while to fix. Otherwise, if you can get used to the different keyboard and use a mouse if you don't like the touchpad, this laptop is outstanding. I am a kid and I like to play games, and the video card with the Quad-core processor is definitely amazing. I can play Minecraft, Tf2 and even Battlefield 3 with ease. It's also great for overall use, projects and etc. However, you will also need to get used to Windows 8, which I personally despise, but I can't blame the laptop for that. I'd say this laptop is definitely worth it's money, and if you need a pretty cheap yet good and can spare a few minutes fixing the laptop, it's a must buy.", "Date": "January 27, 2014"}, {"Title": "Internals are great; Externals are lacking", "Author": "Dan P", "ReviewID": "R29KTJS8BYG93X", "Overall": "3.0", "Content": "Same review as everyone else, apparently. Great internals, severely lacking externals. Keyboard and mouse are spotty, case edges are sharp.Screen, battery, computing power are exceptional for the price.", "Date": "January 26, 2014"}, {"Title": "good laptop", "Author": "Sky Beisel", "ReviewID": "R3F858X0P05LY8", "Overall": "5.0", "Content": "VIZIO CN15-A5 15.6-Inch Laptop: as described, well packaged and arrived early even around MLK day. I'v seen some reviews about the track pad not working, i thought that at first but the reality is its really sensitive and it just took a few days getting use to the way it worked. (not to mention this was the first time using Windows 8 so there was a little learning curve there.) I would give it a 5 star except there is a small piece rattling in the inside of the laptop. (not sure if I'm gonna return it or not since i NEED it for school) Other than that its working great and the screen is wonderful. I haven't put the i7 through its paces yet. I expect it will work out fine with the photo, video and audio editing i plan on doing.  Other things to note is there is no optical drive, and there are no covers on the bottom to upgrade the ram. (haven't looking into how to access that yet.) over all nice slim sleek powered laptop.1/25/14 Edit: removed info on under powered usb ports. I just needed shorter cables for my external drives.2/9/14 Edit: The rattling was the battery. I pulled off the back cover and tightened a screw that held it in place. All fixed. I was having some wifi connectivity issues which were solved by the free upgrade to windows 8.1. The only issue I've been having is while typing papers for school if I rest my hands on the laptop I accidentally move and click the mouse due to the large size of the touch pad. And getting use to a keyboard with out a 10 keypad. Minor issues.", "Date": "January 25, 2014"}, {"Title": "magnificently!", "Author": "Amazon Customer", "ReviewID": "R1M4SEB9DPCMLI", "Overall": "5.0", "Content": "In my opinion, a great combination of quality / priceExcellent screen for graphics, durable metal body, a powerful stuffing and stylish appearance. The notebook market will be a serious player.", "Date": "January 2, 2014"}, {"Title": "Vizio laptop", "Author": "Janice stanton", "ReviewID": "R2U5QVMQRNAQOG", "Overall": "5.0", "Content": "It took a little adjusting for me, just because it is a bit different than what I was used to.  But I absolutely love using it.", "Date": "December 26, 2013"}, {"Title": "Best money I have ever spent!!!", "Author": "stephen Joy", "ReviewID": "R2CUC17A52UHUE", "Overall": "5.0", "Content": "If you are thinking about getting a laptop this is it.  It took me about 2 weeks to be able to spend 1k on a laptop.....  I finally did and it SAVES me time.  The boot up is so fast, I am starting to learn windows 8.Hands down best laptop!", "Date": "September 11, 2013"}, {"Title": "I have nothing good to say", "Author": "Sir Cadogen", "ReviewID": "R18NX8997DNGMW", "Overall": "1.0", "Content": "Pros:battery is not baddoes not tend to get hotCons:Bad keyboard layoutsharp,uncomfortable casetrouble with wifi connectivityunreliableawkwardly placed ports2/10 would not recommend. I am getting rid of it after less than a year of use.", "Date": "February 2, 2014"}, {"Title": "Worst Designed Notebook I Ever Had", "Author": "D. Martindale", "ReviewID": "RZ1KY2Y4772IR", "Overall": "2.0", "Content": "The specs look great, as does a photo from a distance, but this thing is a monstrosity of bad design. The build feels junky with dangerously sharp edges on a poorly assembled case. It is hard to open and one could slice a finger opening it. The touch pad is not responsive. The keyboard layout is smaller than it should be for the case size and is weird and feels loose and cheap; even the key labels are bad. Ethernet port is incorrectly built, so connector must be jiggled into and held at a certain angle to maintain connectivity and must be literally taped in place to not fall out. My first product form this maker, and probably my last. It DOES work, but the mechanical design flaws and junkiness make it a horror to have to use. What use are good specs when the physical design makes for such a horrendous user experience? I have owned this more than 2 months and delayed reviewing in hope more usage would make me hate it less. Sadly, my disgust and disappointment have only increased.", "Date": "February 1, 2014"}, {"Title": "I order new one, bu Amazon give me used one", "Author": "Danny", "ReviewID": "R2PPDTLK08SD98", "Overall": "1.0", "Content": "after around one month, I got this year gift for me from amazon.  When I start to use it, the screen shows that have a user name(komara) and ask me input passwords. It is crazy that is new one I had order from amzon. after working two days, still can not think out the passwords with password hint:ripcity. It is not portland!!!  The manufacturer, VIZIO reply that when they send to amzon, confirmed that is new one. but what I told them it is real used one. Acctually customer service from amazon give me some solution. it is hard to choose which one is better. Today my IT help me on that. He shows me that CN15 had been used on Augest, 30.This is not my want gift. It is a terrible work to reboot and can use it.I do not konw how good this CN15. Only feel this nightmare experience.", "Date": "January 25, 2014"}, {"Title": "This review is definitely worth looking into!", "Author": "Moe Ziaran", "ReviewID": "RTHNXUIH30H5G", "Overall": "2.0", "Content": "So this is not your one in a million dissatisfied user. I have been in extensive contact with Vizio and my experiences are as recent as it gets (in fact late 2013).To cut a long story short, the issues with the laptop persisted after sending the laptop in 5 times!!! I ended up getting 3 different machines from them (all the CN15-A5) with all of them being flawed and I went 3 weeks without having a laptop.Eventually I have had to settle for a machine which I paid $1000 for, which has a touchpad that double clicks every time I click it, and a keyboard with buttons that I have to press perpendicular to make sure they register and a noisy fan.Going through what I went through, I decided to make sure that this does not happen to any more people. I dealt with their tech support many times and got 3 different \"new\" laptops from them. They have a terrible customer support and really don't give a crap about you. I had to deal with Google and my experience was completely different.So here's the longer version of the story:I got the first laptop, the fan was very noisy, the keyboard wouldn't register quite a few buttons (had to be hit really hard), and the touchpad would register single clicks as double clicks in one major part of the touchpad. So I sent it in for \"repair\".When I got the laptop back, at first it seemed like nothing had changed except for the fan noise had gone away. Later on it turned out that they had put an older version of the touchpad and that it would freeze on me half the time. So I sent it in again and put a note in there with instructions and links to youtube videos that showed the problem.This time when I got the laptop back, it seemed like I had made them angry and they had taken it out on my laptop. There were scratches and dents everywhere, the ethernet port lid was broken, the laptop lid wouldn't close properly and the touchpad was now the \"newer\" version but all the old problems were still there with the double clicking and the keyboard.I got furious and called them up and they said that they would send me a \"certified laptop\" which is supposedly Vizio's attempt at making returned laptops new and sell them.So they sent me this laptop which seemed to be ok (only the touchpad was flawed) but there was NO BATTERY in the laptop, so as soon as I would unplug it, the laptop would shut off. So of course I sent it in again for the last time.They eventually sent me another \"certified\" laptop which is the same one I am using now. This laptop has the same touchpad and keyboard issues as ALL the Viizio laptops that they have left seem to have. I guess their \"certification\" says a lot about them.This laptop was a great idea and it almost happened. They wanted to make the best Windows laptop on the market, but the execution was very poor. Great idea but very poor execution would be the bottom line.", "Date": "December 28, 2013"}, {"Title": "Don't buy this!", "Author": "Cathy", "ReviewID": "RG1X91LURF3LU", "Overall": "1.0", "Content": "I cannot tell you how much I regret buying this machine. The keyboard is so sensiitive that I'm constantly typing duplicate letters and winding up on another screen that I didn't intend to be on. It is absolutely maddening. And now I can't seem to pick up a wireless connnecttion unless I'm in the same room as the modem. This is not a problem on my old laptop, which is picking up the wireless signall just fine from anywhere in the house. The typos in this review: All thanks to Vizio.", "Date": "October 1, 2013"}, {"Title": "Vizio missed the boat with OS, and tries very hard to lock you in", "Author": "Thummper", "ReviewID": "R1WTBI5MFZU3SP", "Overall": "1.0", "Content": "So far, it seems fair, although the bottom edge is rather sharp and I can see how that would be very uncomfortable on wrists / palms soon. The problem is windows 8, and their / Vizio's efforts to lock you into it. For reference I wanted to run Ubuntu with win8 installed under VM, which is specifically stated to be within the license. Windows 8 comes with such \"features\" as a \"locked bios\" (effort to prevent you from installing any other OS). Vizio has chosen to take it further by hiding the windows re-installation partition on a hidden HD as well as with proprietary obfuscating configurations, and omitting tools other manufacturers (like asus and lenova) provide which allow you to make images and produce an actual installation disk. It took me a week to crack through all the systems put in place to prevent you from using anything other than windows 8. Even if you wipe the main HD and install a different OS (having jumped through all the hurdles to just get there), if you didnt also find and wipe the hidden disk it will revert you on boot. Further, Visio claims they do not provide any win8 installation media due to micro$oft licensing, however plenty of other manufacturers do, and Visio is happy to sell you one for an additional $35.All-in-all, its YOUR laptop, run whatever software you want. While Visio cannot be expected to offer support for alternate OS's, Visio has no business actively trying to force you to stay with windows.As to the laptop itself, the afor mentioned sharp edge could be significant to many people. It rubs your wrists raw very quickly. Also, under moderate use the laptop heats up dramatically on the bottom and towards the back where the vents are, although kudos for not having down facing vents. As to battery life, left alone with the screen dimmed all the way down, running no programs, and not in use (but on, and set to not suspend), the battery lasted 6.5 hours. With VERY light use (minor web browsing, typing emails, screen at 50% bright), even after being massively tuned for battery life, I got 2.5 hours. I think everyone knows that battery life specs are not real-world specs, but spec'ing 7 and producing 2.5 with light use is simply unacceptable.Customer service was available, but rude and unhelpful.", "Date": "August 21, 2013"}, {"Title": "Good value but beware of the battery", "Author": "J. Huie", "ReviewID": "R1E2FWBDG155GO", "Overall": "3.0", "Content": "A friend of mine bought one of these and it arrived with a dead battery that would not hold a charge at all. There's at least one other review on here that mentions the machine arriving with a dead battery as well.  My friend was able to return his and Amazon sent him out a new one that worked fine.Well, we bought one and it arrived with a working battery but after having it for less than a month the battery won't hold a charge for us either.  This appears to be a weak spot for these so consider that when making your purchase. Otherwise, it's a screaming fast machine with a beautiful display and a great feel.", "Date": "August 21, 2013"}, {"Title": "Absolute disaster if purchased from unauthorized reseller", "Author": "roy g niederhoffer", "ReviewID": "R1YNJTBTFNYAKO", "Overall": "1.0", "Content": "As soon as I learned of the CN15-A series I purchased a CT15-A2  on Amazon with a 256GB SSD. Eager to receive it, I purchased from the only vendor showing at the time, ManjaTech, which appears to also go by the name Sunshine Trade.I have found the computer to be extremely responsive and a pleasure to use with the exception of the touchpad. I find that for some reason my fingers do not slide smoothly on the pad and as a result the cursor is difficult to control at times, perhaps due to the texture of my fingertips. I do not have this problem on any other laptop I've ever used. But I eventually learned to live with it.However, last month the SSD or HD controller failed and the unit failed to boot.  I attempted to get a warranty replacement, but unfortunately, it turns out that ManjaTech is not an authorized reseller,and both Vizio and Manjatech refused to honor my manufacturer's warranty. With no alternative, I opened the case to see if I could replace the SSD unit myself. I discovered that it is not a stock SSD unit and is extremely difficult if not impossible to replace. So, I'm stuck with a brick.For all it's worth, DO NOT purchase this laptop from a grey market reseller.", "Date": "July 25, 2013"}, {"Title": "WiFi disconnect issue for me as well. Great otherwise!", "Author": "Botanika", "ReviewID": "RZGILNH1IJ4LQ", "Overall": "4.0", "Content": "I'm having the same random Wifi disconnect bug others are having. This is on a 2.4GHz router. Depending on where Vizio's issue is perhaps a 5GHz wifi router might not exhibit this. Regardless its a show stopper for what is otherwise a wonderful machine for the $.I'm going to search out official support but if I can't find a quick resolution I'm going to have to return it.  If anyone knows the current status on a fix an update would be appreciated.", "Date": "March 3, 2013"}, {"Title": "great value", "Author": "majid", "ReviewID": "R1RJFV0ZVMP4X0", "Overall": "4.0", "Content": "amazing value for $1000. it seems like it should cost 1350. my only complaint (that i couldn't fix) is the keyboard. no home or pgup/pgdown keys and small up and downs arrows. also had to fix the dropping wifi connection by following the solution another poster posted here. i shouldn't have had to deal with that. and i had one mushy keyboard key that i fixed by detaching the key and removing a a piece of debris that caused the jam.otherwise, great computer. the alternative would have been a high end samsung or macbook pro retina. both cost almost twice more.", "Date": "February 14, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009PJHD3Y"}}