{"Reviews": [{"Title": "Excellent mid-range ultrabook with good mix of features", "Author": "David Mccann", "ReviewID": "R1POPIITTJ9UAG", "Overall": "4.0", "Content": "With a shrinking number of ultrabooks with Windows 7 on them as shipped, this system offers a really good mix of hard-to-find features including VGA and HDMI port, an RJ45 network jack, and throw in a DVDRW drive and 1 USB 3.0 and 2 USB 2.0 ports.  The traditional hard drive with small SSD cache is a good compromise on a low-cost system.  Very thin yet feels solid with aluminum casing.  Really the only negatives are lack of backlit keyboard and trackpad a little tricky to get used to (left/right buttons are integrated into pad), and no recovery media and no way to make them, a poor trend for most vendors.", "Date": "April 24, 2013"}, {"Title": "needed a lot of work right out of the box", "Author": "amateur wrench", "ReviewID": "R3QX3JRYT2VNOB", "Overall": "1.0", "Content": "ASUS was recommended to me as a good brand, this seems to be the best 14\" with Win 7, Amazon had the best price through another seller Technology Galaxy.  However, return policy for TG is once the box is open it's yours, no exceptions, my bad for not reading the fine print.  Right out of the box the cooling fan ran fast and loud, you could hear it in the next room.  When typing in Word, email or in a web text box, the cursor would jump around causing you to manually set it back to the end of a sentence to continue typing.  That's enough for me to return it, but as stated above, the return policy won't allow it.  I spent hours with ASUS tech support via chat (tech support was good) to download a chipset to solve the cooling fan problem and some other software upgrade to stop the cursor jumping.  Fan is solved, it runs quiet now, the cursor is still problematic, but we finally figured out how to disable the touchpad, the laptop is primarily used with a mouse.  Another review talked about the touchpad being the deal killer too, take note.  Other than that, the unit works fine (now) for word processing, web surfing, and some simple psychology testing software.  If you want to buy this brand/model, go find one that you can demo before you commit.  Buy direct from Amazon so you can return it if you don't like it.  Beware of sellers selling through Amazon, they might not let you return it if you open the box.", "Date": "June 26, 2013"}, {"Title": "This Laptop Is Awesome!!!", "Author": "M. Gorlick \"markie\"", "ReviewID": "RKCAWPXLTID1D", "Overall": "5.0", "Content": "this laptop arrived about half hour ago...after i fried my other asus(twice) with nice french wine...ugh... love windows 7...easy set up because i know this true and tried operating system...this desktop top fires up...not loaded up with bloatware...very snazzy looking...love it...ignore the whiner reviews..this laptop is lightning fast..appears to be well-built...i travelled with my other asus for 3 solid years...buy now because these laptops /w/ windows 7 are going to be harder to find...also still use the vga connection and this one has it !!! yeah i always disable trackpads and use a wireless mouse...there is no comfortable trackpad on a laptop...they all are kinda weird...thank you amazon for Next Day Delivery...we love seeing mr. ups on saturday morning with the amazon box...after the thursday nite wine spill drama on laptop...fyi...just purchased a membrane to protect keyboard...wine and coffee are 50 ft. away until the cover arrives!!!!", "Date": "October 12, 2013"}, {"Title": "worked perfectly right out of the box", "Author": "Amazon Customer \"xdancer\"", "ReviewID": "R1W9WGBOV7JGLA", "Overall": "5.0", "Content": "this was by far the easiest setup of my 10? laptops -- based on reviews i read here i chose this model (with win 7) over a new vaio with win 8 (my last 5 computers have all been vaios) -- seamless, fast setup, speedy, lots of RAM -- only caveat is no numeric keypad but i only used it to type accents, so --downloaded browsers, software, printer drivers & updated versions of this n' that -- no problem whatsoever. so far so good -- it's only tweaking & transferring files now -- from the previous laptop whose touchpad i drowned --", "Date": "May 30, 2013"}, {"Title": "Crappy Keyboard Nice Screen", "Author": "MDN", "ReviewID": "R1U1B5N35RWV38", "Overall": "3.0", "Content": "I chose this laptop primary because it had a very fast processor and it was a Windows 7 instead of the new Windows 8.  It was actually a little more expensive than Win 8, but I heard Win 8 has problems.  I still prefer a full size keyboard, because I like to type fast.  The keyboard on this laptop is too small and very flat.  It is difficult to use and the pad is inaccurate.  I spend quite a bit of type with the pad to try and move the cursor around.  The mouse works a little better than the pad.  The keyboard also has options that let you use certain keys for other functions.  It is these extra things that make for a bad experience.  Besides being hard to type, there are regular problems, where the cursor just flies all over the place when you are trying to type.  The way the keyboard ends up working is more akin to a cell phone than a computer.  It is just very frustrating to use.  Start up to my surprise is very slow.  It takes about 20-30 seconds to start.  The internet connection was flawless and has worked very well.  The area surrounding the keyboard and pad is a very nice aluminum finish.  The rest of the computer feels and looks cheap.  It is very light plastic and there are places where the plastic finish is pretty rough.  The screen is pretty good, it works well even strong lighting conditions and even when it faces the window.  I don't know why it got such high ratings.  With the exception of the aluminum finish and the screen, it is very average and substandard in some instances.", "Date": "June 23, 2013"}, {"Title": "Trackpad is terrible!", "Author": "Ryan Law", "ReviewID": "R29H2Y74TJQ0TU", "Overall": "1.0", "Content": "I was looking forward to using this computer - I did a lot of research before purchasing it and finally found the best deal here on Amazon. A few people had said that they hated the trackpad (ASUS' new version of the mouse) but they just plugged in an external mouse and it was fine.I tried for over a month to get used to the trackpad (I can't really use an external mouse because I'm not often sitting at a desk with my laptop), and I hated it so much that I finally gave up and returned it for a refund. The computer itself seems great, but the trackpad was a deal-killer for me. I'm unlikely to look at ASUS in the future and I am back to hunting for a new laptop.", "Date": "June 7, 2013"}, {"Title": "Great Laptop!", "Author": "jd", "ReviewID": "R4WIEDNIVIYJL", "Overall": "5.0", "Content": "Asus is Definitely the best computer brand out there.  This computer is no exception to the quality of their products.  This is the perfect balance of Performance and Price.  I would Highly recommend this Laptop to anyone.", "Date": "March 4, 2014"}, {"Title": "Slight issues", "Author": "Aleia McDaniel", "ReviewID": "RGHKM06S34M7R", "Overall": "3.0", "Content": "Bought this laptop a year ago and unfortunately had to send it in for a hard drive replacement. Good computer but does not have the full power I need as a graphic designer.Overall 3.5/5", "Date": "January 23, 2014"}, {"Title": "Yeah windows 7", "Author": "Sue Vaterlaus", "ReviewID": "R3F0S66Q5RIC6L", "Overall": "5.0", "Content": "Love this computer. Did not want windows 8 so I ordered it online and got windows 7. Quality computer with everything I wanted.", "Date": "January 17, 2014"}, {"Title": "Great ultrabook at a good price point", "Author": "Roy Kroll \"Puter Geezer\"", "ReviewID": "R1Z3805PG8VLD6", "Overall": "4.0", "Content": "Light and well built. Best touch pad design ever. Might almost consider giving up wireless mice with this beauty. Very responsive with the low wattage Intel i5 and Windows 7 Professional (64-bit). Wakes almost instantly from sleep. I bought this for my son for college and he loves it 2 months into the semester. I only have 2 minor cons to bring up.  Battery life is only 3.5 to 4 hours ; for an ultrabook, it should be at least 6. My other con is that there is only 1 USB 3 port and its on the wrong side of the laptop. There should be 2 USB 3 ports, 1 on each side.", "Date": "October 26, 2013"}, {"Title": "Happy with new laptop.", "Author": "Robert E Albright", "ReviewID": "R1ZV3EVXUWLRR4", "Overall": "4.0", "Content": "I was interested in getting a 14\" laptop with Windows 7. This meets all my expectations and I am using it daily.", "Date": "May 2, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009PTNBEO"}}