{"Reviews": [{"Title": "don't buy!", "Author": "Lisa B.", "ReviewID": "R3DIFPK7SK05RF", "Overall": "1.0", "Content": "This computer has a major flaw with the wifi connectivity.  I bought it for travel and cannot get a decent wifi signal.  My old laptops have 5 bars when this one has 2 when side by side, plus it drops connection all the time.  I have done a lot of research online, this is a broad problem reported and intel/dell are not fixing the problem.  If you travel and plan to use at hotels as I wanted to, this laptop is useless.  Shame Dell doesn't correct this, otherwise a nice computer but what good if you can't stay online???", "Date": "November 3, 2013"}, {"Title": "Great computer. Windows 8? Not yet", "Author": "ZPM \"zpm\"", "ReviewID": "R2Y8CCMKEFJ9T0", "Overall": "4.0", "Content": "I am returning the laptop and getting a replacement in hopes of receiving a non defective one. I received a Windows 8 error from the first time I logged on and put all my information in. After I finally got through that, the computer (software) was acting up. Programs not working, occasional freezing, wireless connection going in and out. I downloaded a bunch of Windows Updates which seemed to help a lot but the Internet was still just awful.I do have to say though, with my limited experience with Windows 8 so far, I did enjoy using it. That is why I'm hoping the replacement is free of defects.As for the physical computer, I've never seen anything like it. The design is awesome. It's much smaller than I imagined. The screen is very clear. Once I got through the updates, the computer moved very fast. The trackpad is really not that bad. If people have a problem with it, use a wireless mouse. The keyboard is great. My prior computer (Dell Latitude Z) had the best keyboard I've ever used and this XPS13 is up there with it.", "Date": "November 30, 2012"}, {"Title": "It's a perfect design", "Author": "Trauquen", "ReviewID": "R2YBCDF8LHWGTX", "Overall": "5.0", "Content": "Even a little bad screen and missing sd card slot, I love its beauty so much. It's a outstanding industrial design.", "Date": "March 31, 2013"}, {"Title": "A very sleek ultrabook...I'm very pleased", "Author": "G. Ryan \"Gmy\"", "ReviewID": "R3MLEZTPRJF8ZU", "Overall": "5.0", "Content": "Very impressive design in person....pictures provide limited justice... My first experience using a ssd drive...neither a hiccup or stall at all and is upgradable. Great ultrabook for my needs....burden less travel - great size slightly under 3lbs. Screen is beautiful at front angle views. Wireless connection is reliable and strong. Windows 8 however is a work in progress as I like what was done 'under hood' over Win 7 but the new start mode but requires practice.", "Date": "March 18, 2013"}, {"Title": "A lot of problems..", "Author": "Xu Yihong", "ReviewID": "R10NGHP2WSEDF6", "Overall": "2.0", "Content": "Not good, I bought for my sister. she has a lot of problems when she use it. the internet connect problem is so bad! she said always disconnected several times per day.", "Date": "April 6, 2014"}, {"Title": "Great computer!", "Author": "Santiago Kegevic", "ReviewID": "R27673HKV4FOIP", "Overall": "5.0", "Content": "It is a very good computer. Very fast and convenient. Easy to carry it around, also Windows 8 is great.", "Date": "August 3, 2013"}, {"Title": "Poor WIFI card!", "Author": "Marcos Mattos", "ReviewID": "R34SA591SO0WHE", "Overall": "1.0", "Content": "Legendary june seels me a defective laptop. It's already registered on dell a month ago. Don't buy it, there is no free lunch. There is thousand of bad review about centrino advanced N-6235 WIFI card. The new one XPS 13 comes with the killer N-1202, think about it!", "Date": "October 20, 2013"}, {"Title": "Compact size but frustrations", "Author": "E. Thacker \"Grtmkr\"", "ReviewID": "R1G4BVLFEX40A6", "Overall": "3.0", "Content": "This machine does a good job at computing functions but had a few issues:The E on the keyboard keeps coming off and I have to return it for a replacement keyboardThe drive size of 120 GB is pretty small and I had to upgrade it within a couple weeks.The trackpad is an ongoing and massive source of frustration, where the cursor just stops and I have to hit the escape key and gives jerky or spurious movements as I move my finger smoothly across it.  This is the first laptop I've used in many years where I have resorted to using a mouse.On the other hand, the laptop is thin, pretty fast, and hasn't had any operational problems.", "Date": "August 24, 2013"}, {"Title": "good!!!", "Author": "pablo", "ReviewID": "RFVEZXM9UQOPA", "Overall": "5.0", "Content": "dell is good quality!!! I have not words for explain it, but I have good experience worn with dell product...", "Date": "January 5, 2013"}, {"Title": "No SD card slot!", "Author": "gg", "ReviewID": "R3M2V7ASWQ4028", "Overall": "3.0", "Content": "Can not believe that this does not have a SD card slot.USB drive is to inconvenient. Limited memory on 128 GB SSD drive after system software is installed.At this price...this was a major factor that prevented me from keeping this otherwise decent ultrabook.Will reconsider the XPS if dell makes a change.", "Date": "February 14, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009FX7D12"}}