{"Reviews": [{"Title": "Dell is sucks and customer service is sucks too", "Author": "Marmutertawa", "ReviewID": "R8O2DRBM4GRW8", "Overall": "1.0", "Content": "this laptop might be powerful and the best laptop but at what cost?I bought this laptop for my graduation presents. i bought it through alienware.com (official website) because i want to customize my laptop to be a bit more powerful. i ended spend $1800s for my laptop. it's okay i think, i planning to use this laptop for the next 3 or 4 years. i make the purchase on june 04, 2013. the estimated production is june 17, estimated delivery is june 24. when i saw that, i'm thinking to my self. am i ready to wait that long? then i think again, f it i gonna buy this one. and the waiting game is on (everybody love the waiting game right? the best game invented by God).June 18,2013i got my email from dell saying that \"You're order has been shipped\". i jump around the house very happy that finally the waiting game almost over for mejune 20,2013starting to get curious. dell.com keep saying that my laptop in production, but i already received the email about my order has been shipped. something fishy happening herejune 21.2013i contacted dell and trying to find out what is really happening. they apologized to me that it'a a wrong email and they accidentally send that email to me. i was like \"omg how can this happen? you get me exited by sending that email and now i facing the fact that my laptop is still in production\". then i ask them when is my laptop will be shipped. they answer as soon as possible. i cant say anything more to dell customer service and decide to hang up my phone.june 22,2013dell finally provide me with my tracking number. i'm so happy. i got my new estimated delivery date which is june 26,2013. another two days from the original delivery dates. i said to myself, it's okay, i can still wait. fedex is the carrierjune 24, 2013i checked my order almost everytime. i use fedex tracking on their website. it's stuck at city of industry,CA. and it's only 2 days left until it's delivered. i starting to get worry.june 25,2013i check fedex website again, it says Barcode label unreadable and replaced. i call dell again to get the update of my order. Dell said that they give me the wrong tracking number. i'm starting to lose my tempergonna update again tomorrow to see what happen. until today dell has been handle my order unprofessionally", "Date": "June 25, 2013"}, {"Title": "love it", "Author": "Caiyang li", "ReviewID": "R2EYWULEWLVJS4", "Overall": "5.0", "Content": "best game laptopbest fanmust beautiful laptop ever i know$1645 be worth to buyenjoy my game ha", "Date": "March 27, 2013"}, {"Title": "NO NO NO!!!", "Author": "Idiosyncracy \"Mista Mista\"", "ReviewID": "R1BDHC8AFWZ83N", "Overall": "1.0", "Content": "I cant list them here, but there are sites where you can get MUCH MUCH cheaper (4-500.00) that Alienware and with better configurations.AND they dont charge for state tax like the Dell website does.I recently bought a M17 because I didnt know better and am dissapointed. For starters the video card is shared memory. And you have to upgrade to a 1920x1080 screen. Seriously? On a gaming laptop?Alienware USED to be top of the line, but those days have long past especially with Dell's purchase.I dont work for a sales company or anything. I'm a gamer that got burned by a \"name\".If you want the name for some reason, go ahead. These laptops look nice, but if you're looking for better quality at FAR cheaper prices, do some research..there are sites out there that let you do custom builds and I'm not talking about the two main ones everyone knows about.", "Date": "April 15, 2013"}, {"Title": "Hardly Linux Compatible", "Author": "Bluecount", "ReviewID": "RTHY876H3DT5S", "Overall": "2.0", "Content": "Out of the box, the latest version of Ubuntu and Linux Mint won't install.  This is as annoying as the fact that it ships with Win 8 instead of Win 7.  To be useful as a Linux laptop, you must dual boot Windows and your preferred Linux flavor, and when you're in windows you have to press the (Fn + I/D GFX) which implies that it's a switch button to switch between your integrated or discrete graphics card...  I think what it really does is disable/ enable the Enduro feature in the AMD/ATI graphics card which is EXTREMELY BUGGY.  With that 'feature' disabled, you should be able to install any Linux operating system normally just like you would on an actual pricey, high-end laptop...But still I notice some nasty artifacts and flashing with things like the brightness changer and the 'roll up' effect on the start menu (you know, when you set it to auto-hide).  With certain settings, graphics settings, the graphics card stops refreshing during the login and screen lock screens, so it looks all glitched out.  Very unfortunate, but you can still type in your username/password, you just can't see it.The screen quality (or maybe graphics quality) is extremely nice, when I first played an FPS I thought the screen must be refreshing at 120hz or something, but it must just have 'very little ghosting' or something like that.If you intend to install Steam on Ubuntu, I would NOT recommend this laptop.  Pay full price and get an nVidia based gaming laptop instead.", "Date": "March 21, 2013"}, {"Title": "it is a cheat!!!", "Author": "BEN_MA", "ReviewID": "R22VG7YZJ6P3JT", "Overall": "1.0", "Content": "it is a cheat!my friend bought it for me,as many customer say,the machine's display is 1600*900,not the 1920*1080!how Amazon can do this!it is a terrible experience!and i live in China,when i know about it,the machine is on the way to my home!NIGHTMARE!", "Date": "December 30, 2012"}, {"Title": "Fake！！", "Author": "Costumer", "ReviewID": "R546DKS9EZJ20", "Overall": "1.0", "Content": "Never buy this crap! The display is not as good as their description!! Be careful with it!! It's a horrible laptop without good screen resolution!! Never never buy this!!", "Date": "January 16, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009FX7BE6"}}