{"Reviews": [{"Title": "Fan Problem", "Author": "Priscilaofphila", "ReviewID": "R3DSYHMQ31WCVI", "Overall": "1.0", "Content": "My computer broke after 4 months and it was the fan and asked me to sign off and return it to manufacturer.  When I have to return to the manufacturer, I have to pay for shipping.  Why do I have to pay for shipping obviously the computer is defective and it is under warranty.  The shipping comes with an option to mail it by yourself or with their glorified laptop box and the confirmation receipt for $24.99.  What a big rip off!", "Date": "September 10, 2013"}, {"Title": "I love my laptop", "Author": "gemini", "ReviewID": "R3SSXDOK2I598S", "Overall": "5.0", "Content": "I love my laptop. the new windows 2008 is way different from anything I've ever experienced. Its at times sublime and simple, and at other times very weird and a little mind boggling. However I do honestly like it and enjoy using it. This laptop runs smoothly and facebook games are no problem on it.", "Date": "August 20, 2013"}, {"Title": "i like it", "Author": "Shatha", "ReviewID": "R1C6EO80MHWDTP", "Overall": "4.0", "Content": "This computer is good and work is excellent, however the new system (windows 8) is annoying. If you are trying to buy a new laptop that would be a good choice but try to stick with (windows 7).", "Date": "March 28, 2013"}, {"Title": "Love it except for the key board.", "Author": "chill", "ReviewID": "R39A9UE537UFML", "Overall": "4.0", "Content": "I love the entire unit except for the key board seems kind of flimsy in its construction. Time will tell. Other wise excellent.", "Date": "March 11, 2013"}, {"Title": "EXCELLENT", "Author": "TonyMosquera", "ReviewID": "R2MRMXVPRV2J97", "Overall": "5.0", "Content": "THE BEST COMPUTER THAY I BUY! I RECOMMENDED, WINDOWS 8 IS FANTASTIC, THE ONLY THINGS IS THAT DIDN`T COME WITH OFFICE 2013", "Date": "February 18, 2013"}, {"Title": "awesome", "Author": "jeramy johnson", "ReviewID": "RIKBSCDG7M0PG", "Overall": "5.0", "Content": "I love it fast an big hard drive wish it had a bigger screen but other than that its been working great for me", "Date": "February 14, 2013"}, {"Title": "Toshiba Laptop", "Author": "rip", "ReviewID": "R4ISY8RMC8DLS", "Overall": "4.0", "Content": "Can never go wrong buying a Toshiba product, The windows 8 takes some getting used to, but the laptop is great, nice picture quality, everything you would expect ina computer, light weight, durable. great price, I gave it 4 stars because I feel the mousepad area could be alittle bigger, like on some other models", "Date": "February 8, 2013"}, {"Title": "Excellent !!!", "Author": "Francisco Marquez", "ReviewID": "R16YDLH35ZHKUR", "Overall": "5.0", "Content": "Excellent Package. Excellent computer. I used to work in home and the office, and works fine. Nice performance. But Window 8 is not really great for this Laptop. I thinks is better if you can used  with Windows 7. I think that Windows 8 works better in touch equipments like tables o laptop with touch display.", "Date": "February 6, 2013"}, {"Title": "LOV ITAND WILL BUY IT AGAIN", "Author": "james mcnally", "ReviewID": "R3O8QEQ9SCJJIO", "Overall": "5.0", "Content": "IT JUST SEEMS  TO WORK SO EFFORTLESSLY COMPAIRED TO MY OLD ONE.  I JUST LOVE IT. EASY TO USE .  HAS THE QUALITY OF A MORE EXSPENSIVE MACHINE.  THIS LAPTOP IS BETTERTHAN ASUS FOR EASE OF USE .", "Date": "January 11, 2013"}, {"Title": "6 Toshiba laptops later :)", "Author": "Melanie \"weatherwoman\"", "ReviewID": "RYTOSSE39F8Z9", "Overall": "5.0", "Content": "Six Toshiba laptops between me and my son and all were great though the average 4 years we used each of them and then sold them because we just wanted a new one.", "Date": "November 30, 2012"}, {"Title": "I like it", "Author": "Gary T Olson", "ReviewID": "R3F164SBOBP467", "Overall": "5.0", "Content": "Works like a charm.  The laptop that I wanted just as advertised.  I guess i need to type 8 more words", "Date": "January 15, 2013"}, {"Title": "Excelente", "Author": "Rafael Mosquera", "ReviewID": "R13Q3QGKUHKZKV", "Overall": "5.0", "Content": "Muy buena la maquina, funciona perfectamente a la persona que le regale lapto quedo encantada estoy que me compro una para mi", "Date": "January 30, 2013"}, {"Title": "Very poor build quality", "Author": "Deepak H", "ReviewID": "RM2813G32WIVY", "Overall": "1.0", "Content": "Purchasing extended warranty is a must for this product. The build quality is poor and if u dont have the extended warranty protection, you might as well be ready to discard the product for a new one.. as the cost of repairs will quickly set you back by a few hundred dollars.", "Date": "March 9, 2013"}, {"Title": "A good value", "Author": "Tiffany Thomas", "ReviewID": "R1GGN5F2GZ4DHS", "Overall": "4.0", "Content": "I like this product because it's a good computer for the money you pay. I do not like microsoft 8 however but Im still working out the bugs and trying to get use to it.", "Date": "December 17, 2012"}, {"Title": "Fast shipping, really nice laptop", "Author": "Miguel", "ReviewID": "R1Q4KMH0KSL7TP", "Overall": "5.0", "Content": "really happy about my purchase. I bought two different laptops. I dont really want to wrtite this review, its kind of annoying at this time.", "Date": "December 29, 2012"}, {"Title": "Windows 8 stinks", "Author": "edith", "ReviewID": "R1X4OWF1U4JRS", "Overall": "3.0", "Content": "This Toshiba satellite is ok but I should have listened to the other reviews here. I absolutely HATE windows 8!", "Date": "December 28, 2012"}, {"Title": "Worst service in the world", "Author": "Mr. avner taler", "ReviewID": "R3SUFL4Q7UB2SU", "Overall": "1.0", "Content": "Do yourselves a favor and stay away from this product and from Toshiba in general.I bought a laptop and it stopped functioning well before the waranty ran out. After a lot of grief, they were ready to \"fix\" it for about two third of what it cost me. Then they shipped it back before I had a chance to respond.At the end, I got it fixed for about 35 dollars.Their service is the worst I have ever experienced in my life!", "Date": "November 22, 2012"}, {"Title": "Unless you are good at computers, dont buy!", "Author": "bigaud", "ReviewID": "RLD140AIHVJI2", "Overall": "2.0", "Content": "I bought this computer to replace my old Toshiba windows vista. The mouse would not work, had to get my \"plug in mouse\" to find the help page, to get the finger mouse to work F5. I did NOT get a product key card(that should be a label on back of computer) so I cant access the free 30day trials. Overall this computer is cheaply made, nothing like my old Toshiba. The set up is very confusing, I will need a computer pro to help me figure it all out, windows 8 is not like your old windows, vista, etc. The book that comes with the computer is only a Quick Start Guide it only shows u the main functions of the computer(where to plug in,etc.) Looks like I have scratches on the left side of screen too.", "Date": "December 12, 2012"}, {"Title": "great gift idea...", "Author": "eurydice", "ReviewID": "R3ETYSDMCCONT9", "Overall": "5.0", "Content": "It was an easy process, high marks all around, highly recommend and will buy again... keep up the great work!", "Date": "December 18, 2012"}, {"Title": "I hate it.", "Author": "SongBird", "ReviewID": "R2HA3F2VFAUMDC", "Overall": "1.0", "Content": "1. It has no scroll bar.2. It has a rough texture on the touch pad, so a woman's finger is irritated when using it and has to press very hard to make it work.3. It's SLOW as molasses!4. Windows 8 is awful. -the font is too small- even on \"Medium\" setting (the largest possible) and all the good things are gone. The buttons which are supposed to fly in from the sides, only do so occasionally.Of course, with all the schemes to prevent returns, like it doesn't work until you register the software, and once you do, you are stuck with it. I'll never buy another Toshiba!", "Date": "December 15, 2012"}, {"Title": "Buyer beware!  Support is not customer focused!!!  AC adapter failures common!", "Author": "Michael A. Moore", "ReviewID": "RGWYC7XDX2B7G", "Overall": "1.0", "Content": "Purchased this as upgrade for my wife.  After investing my time creating backup media, configuring for home network, installing software and virus protection the AC adapter failed 10 days later.  NOTE - the AC adapter was plugged in once and never moved, as this is home based computer and charges overnight as needed in the same location.  Called Toshiba support and was told - they will ship a replacement UPS 3-5 business days!  Asked to speak with a manager as this was 9:00 PM at night on a Wednesday, so my wife would not have a computer for a week just before Christmas.  I explained to her 10 day old laptop, failed charger - need one quicker than a week - she told me there was no other option.  She was very professional, however corporate Toshiba support is focused on their bottom line and not on their customers.  Their short sited view has me returning the system - I am picking up a competitor model on the way home.Also, google Toshiba and AC Adapter - this is a common problem...", "Date": "December 13, 2012"}, {"Title": "Great seller, fast shipping, Hate this computer!!!", "Author": "Amazon Customer \"Getting Real\"", "ReviewID": "R1X4EYGZIW4VPS", "Overall": "1.0", "Content": "First off this review is based on the product and not the seller. Fast shipping! The computer itself is lame. Microsoft Office is NOT loaded on this so plan on spending another $150. and an hour or 2 to download it!!! The mouse is generic. You cannot slide on the side of it. You have to point and click and slide the bars in each window... Lame even my 6 year old Dell is better than this and it overheats! If my kids didn't love it for Christmas I would return the 2 I bought. Windows 8 is really tough on this computer because of the generic mouse. More people would probably actually like it if the computer itself wasn't so generic and lame. You really need a touch screen for windows 8 which this does not have. Don't waste your money on this generic setup. Spend more and get a whole lot more!!", "Date": "January 3, 2013"}, {"Title": "Toshiba Laptop", "Author": "genie at WC", "ReviewID": "R85DKO1TTR0EO", "Overall": "3.0", "Content": "This was a gift for my grandson going to college.  I hope he likes it.  Bought it in November for an Xmas present.", "Date": "December 8, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009AF52NQ"}}