{"Reviews": [{"Title": "Excellent laptop in top flight condition", "Author": "Maurice G. Lacourse \"mglacourse\"", "ReviewID": "RGI68FIVOJIP0", "Overall": "5.0", "Content": "I needed a sturdy laptop for use outdoors for Astrophotography but didn't want to buy a brand new laptop.  I spent months researching refurbished laptops listed on Amazon and other vendors.  I wanted Windows 7, a DVD drive, and a minimum of 40GB hard drive. The HP EliteBook 6930p met or exceeded all my criteria.  I researched the vendor, ARRindy and liked what I saw.  The order was placed on April 12th.  I got an email from the vendor the following Monday.  They seller wanted to make sure I was aware it was a refurbished machine and gave a detailed description of the condition of the laptop that went beyond what was posted.  At first glance, I was puzzled.  Then I remembered during my research seeing one or two remarks made by customers who thought they were getting something newer.  I had discounted those reviews as unreliable.  It made sense - the seller was trying to prevent returns made by customers who did not understand what they were buying. The seller requested a confirmation email before sending the laptop.  I sent it immediately.  I appreciated this extra step.The laptop arrived in excellent condition and has exceeded my expectations.  The 6930p is a well rated laptop used in business/industrial settings.  For me, this was a plus - I wanted a robust machine - and this laptop is just that.  It's not lightweight.  If you are looking for a lightweight model, this laptop is not for you.  I've had the laptop for two weeks now.  The keyboard layout is perfect.  Typing on this laptop is extremely comfortable and I don't have to worry about striking the wrong keys as I am accustomed to a traditional keyboard layout.  The screen is 14.1 inches, which is easy on the eyes when your preparing documents or surfing the web.  The clarity of the screen is very good.I have read reviews about the 6930p that take issue with the battery.  I did not run into any problems while watching a two hour DVD movie.  The battery still had a good amount of life.I would definitely recommend the HP Elite Book 6930p for anyone looking for a reliable laptop, just keep in mind this laptop is a little heavier than your average laptop.  As stated earlier, the laptop I bought was refurbished.  The keyboard, screen, DVD drive and all computer functions check out perfectly.  The seller - ARRindy, was very upfront about the condition of the laptop.  To be honest, they actually UNDERSTATED the condition in my opinion.  Their description said I should expect some slight dents in the LCD housing - this was hardly noticeable and I only looked closely because of the description.  There were a couple of minor scratches and there is some signs of wear on the outside, but this was all well within their description.  The seller included a 'Readme' note on the computer that addresses common questions a customer might have.  By the way - the Windows 7 is GENUINE.  A reviewer had challenged this.  The 'Readme' included on my laptop addressed this concern.  I contacted this seller on two occasions (the first in response to their email, the second to THANK THEM for the top notch condition of the laptop).  Every communication was professional and courteous.I would urge anyone buying this laptop REFURBISHED to go to the HP website to reference the manuals on all the features of the laptop.  And folks, research what you are buying!  Don't expect a brand new laptop when the description very clearly states it is used/refurbished.  After buying this laptop from ARRindy, I can appreciate how difficult a 'spur of the moment' purchase by customers can be.  I rated this seller as excellent.  I'd buy from them again and would recommend this laptop to a friend.", "Date": "April 26, 2014"}, {"Title": "HP is the way to go", "Author": "james stoudemire", "ReviewID": "R3LJI4BTZ87QGM", "Overall": "5.0", "Content": "product performance is great used hp products in past elitebook  give me time to stay online would give it six stars yes I would recommend it great product", "Date": "January 3, 2014"}, {"Title": "Hard to see", "Author": "Carol M Olson", "ReviewID": "R2GZIQYSVY0J8J", "Overall": "3.0", "Content": "screen is very dark when using and it doesn't get any brighter. Other then that it is meeting our needs.", "Date": "November 26, 2013"}, {"Title": "Great computer!!", "Author": "MARILYN LEIKER", "ReviewID": "R321HNOO4DLXCW", "Overall": "5.0", "Content": "Have been using this computer for a few months now and have had no difficulties.  I needed a little help when a couple of programs did not load correctly.  Contacted the seller and was told what to do and how to do it.  Completed the steps and have no problems since!!", "Date": "December 1, 2013"}, {"Title": "Good laptop", "Author": "Kenneth A. Ensley", "ReviewID": "RK8646XJ69IFI", "Overall": "5.0", "Content": "I bought this refurbished laptop for my daughter to use at college and it has done a great job. Price was good also.", "Date": "June 5, 2014"}, {"Title": "was not happy", "Author": "donna morgan", "ReviewID": "RDZVLMEM5UD35", "Overall": "1.0", "Content": "it wasnt exactly up to code. it was defective.it wouldnt work right and wouldnt show any pictures or icons. it was a fraudulent item.", "Date": "June 3, 2014"}, {"Title": "I love my \"new\" laptop!", "Author": "Faye Moore", "ReviewID": "R3EMUCY2Y4OSKN", "Overall": "5.0", "Content": "I am very pleased with my purchase of the HP EliteBook 6930p.  The unit itself was refurbished but was in very good condition.  Windows 7 came installed.  I am enjoying my \"new\" laptop!  I have already recommended this product to several friends and talked to them about buying \"refurbished\".  I feel like I got a very good deal!!", "Date": "June 3, 2014"}, {"Title": ".", "Author": "Denise L. Easterly", "ReviewID": "R1Z5K841V7QBTB", "Overall": "3.0", "Content": "The computer works great. Took out of the box and it meets expectations. But the charger cord was garbage. Had to go buy a new cord. Just make sure accessorites work before grabbing one out of the bin of chargers.", "Date": "June 2, 2014"}, {"Title": "Refurbished is Refabulous!", "Author": "Phillip Jenkins", "ReviewID": "RTJ1DSSS2P8RF", "Overall": "4.0", "Content": "This is one of many refurbished items that I have purchased.  Two computers (the one I am using at this moment), two canon camera and a web cam.  They are just as good as a new item to me.  A slight dent on the outside of the HP laptop but works great.  It had a \"Microsoft Vista\" plastic sticker on the console below the keyboard which at first I found annoying until a friend said, \"Leave it.  Nobody will steal your laptop if they see that sticker\"  lol", "Date": "May 29, 2014"}, {"Title": "Real impressed", "Author": "William", "ReviewID": "R71M0ZHVN5WYM", "Overall": "5.0", "Content": "First time I have purchased a refurbished item. If it continues to work as well as it has it will not be the last. More than meets my needs.", "Date": "May 13, 2014"}, {"Title": "HAS IT'S PROBLEMS", "Author": "Kenneth Hogan \"PUFFIN\"", "ReviewID": "R1B32IDP6GYB1", "Overall": "3.0", "Content": "IT'S O.K. BUT HAD TO GET A TECH HELP SYSTEM TO KEEP IT RUNNING AS FAST AS IT WILL AND FOR WHAT I PAID FOR THE TECH SYSTEM AND THIS COMPUTER COULD HAVE BOUGHT A GOOD ONE BUT I MANAGE WITH IT.", "Date": "May 9, 2014"}, {"Title": "Great value, great performance", "Author": "Ms Viv", "ReviewID": "R8UPGVCMXHJPM", "Overall": "5.0", "Content": "Bought this for my grandson whose old computer had quit. Decided to try a refurbished unit and so far it is passing our expectations. Has Windows 7 loaded, has lots of memory and he is very pleased. The price was definitely right.", "Date": "May 3, 2014"}, {"Title": "Good value", "Author": "Edward Bubert", "ReviewID": "R2K1DTTQYMD6DC", "Overall": "4.0", "Content": "I thought this computer would be a little faster than what it is.  It's much faster than our previous lap top but slower than our recently purchased tower.  After that being said, I would still recommend it to a friend.", "Date": "April 23, 2014"}, {"Title": "Arrived just in time for Christmas", "Author": "D. Guthrie \"Goddess of Nuke\"", "ReviewID": "R1D5EN1S9ZRZC9", "Overall": "5.0", "Content": "Quality product for my last minute emergency purchase. Arrived the morning after purchase, leaving plenty of time to load software and wrap.", "Date": "February 24, 2014"}, {"Title": "great computer", "Author": "Amazon Customer", "ReviewID": "R2571EY0UDA5BH", "Overall": "5.0", "Content": "great computer. was better then i expected got it for my wife she is using it for a book she is writing. works great", "Date": "February 18, 2014"}, {"Title": "A hit!", "Author": "James Misenheimer", "ReviewID": "RUKHPTT6E9SF2", "Overall": "5.0", "Content": "It's all that I was hoping form  More than I really expected, the overall quality surprised me I love it. A lot for the money.", "Date": "February 10, 2014"}, {"Title": "EXCELLENT PRODUCT", "Author": "jon", "ReviewID": "R1KY6MIJ5HCRJN", "Overall": "5.0", "Content": "This arrived on the 24th of January  five days before it was to be shipped. In excellent condition, I was able to power it up and get online in a few minutes. It even came with a house charger!", "Date": "January 25, 2014"}, {"Title": "Bought as a gift", "Author": "froggie612", "ReviewID": "R3748606XB0XRM", "Overall": "4.0", "Content": "Bought this as a Christmas gift for my boyfriend.  He seems to like it.  It did not come in office products and has a difficult time playing videos, but overall is a good buy.", "Date": "January 19, 2014"}, {"Title": "Very disappointed", "Author": "uklynn", "ReviewID": "RDRNU6U4H471G", "Overall": "2.0", "Content": "This was purchased as a Christmas gift for my Grandson.  After opening his gift he immediately plugged it in to charge only to find, after waiting patiently, that the battery does not hold a charge and is basically useless.It was extremely upsetting to give our grandson a gift that was broken from the start.", "Date": "December 31, 2013"}, {"Title": "HP EliteBook", "Author": "Teressa", "ReviewID": "R5SIM2YAZCORV", "Overall": "3.0", "Content": "I gave this rating because the laptop did not meet my expectations. I understand that it was a refurbished product but did not expect to receive a dented laptop that looks to be very used.I would not recommend this to anyone.", "Date": "January 2, 2014"}, {"Title": "The best computer I ever had", "Author": "Kalley R.", "ReviewID": "R1PEK5F62TYR8J", "Overall": "5.0", "Content": "This computer is so awesome, I plug my Wi-Fi it and it sets  it up automatically! It's has great games already on the system. The screen is wonderful, and you can turn the volume down so no one hears you playing games when other people are sleeping. It has extras but you have to pay for them like a wireless mouse, the video cam to talk to see and talk to the other person. I love this computer, would recommend it to everyone who needs a laptop.", "Date": "May 19, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "2.5GHz Intel Core 2 Duo Processor\nWiFi\nWindows 7 Home Premium Operating System", "Name": "HP EliteBook 6930p, Intel Core 2 Duo 2530 MHz, 160Gig HDD, 2048mb DDR2, DVD-RW, Wireless WI-FI, 14.1 WideScreen LCD, Genuine Windows 7 Home, Laptop Notebook Computer, Professionally Refurbished", "ImgURL": "http://ecx.images-amazon.com/images/I/41iOIbf4LbL.jpg", "ProductID": "B009XI4T6Q"}}