{"Reviews": [{"Title": "No Regrets Switching to Samsung Laptop", "Author": "Tomaso Pig", "ReviewID": "R3HHS0MW0Y8SNU", "Overall": "4.0", "Content": "Once I got this computer loaded with Windows 8, I thought I should have my head examined for not staying with an earlier version, like my octogenarian friend did.  Of course, I couldn't be bothered with manuals, so I've stumbled through the past twelve months.  I've managed to get done what I need to- finally.  However, I can't comment on technical aspects of this machine, because in spite of the Radeon graphics that are claimed make this an excellent machine for gaming, I have to admit that I gave up games as a pathetic waste of time even for someone retired as I am.  I'm sure I wouldn't buy this machine at this point in time simply because the price appears to have gone up considerably.  I wouldn't pay $1000 for a laptop for what I need.  Of course, it would have been helpful if the computer had come loaded with AT LEAST Word, if not Excel.  I'd have thought I'd paid enough already to have them included.  I decided to switch (from Dell) to Samsung on the strength of my satisfaction with the three Samsung HDTVs we now own.  I have no regrets in that regard.  The problem I experienced briefly with the numeric keypad 0 may have been the fn lock key was inadvertently pressed on (and then later pressed 'off'?), but it's working again.", "Date": "March 29, 2014"}, {"Title": "Just Right..", "Author": "sunshine326", "ReviewID": "R3DXVWM0A4ANEX", "Overall": "4.0", "Content": "This was a gift  and the person that received it was very happy with it. I was happy because the price was with in reason for the features offered.", "Date": "December 18, 2013"}, {"Title": "Wifi issues", "Author": "Ameen Walker", "ReviewID": "RZV9E431QC6UC", "Overall": "3.0", "Content": "This isn't a thorough review.The specs are amazing and when sold for $749.99 it is definitely a steal, however, there are issues: The mouse pad will occasionally freeze(solved using an external mouse), hibernation or sleep mode will sometimes fail and cause the laptop to restart(boot ups are quick luckily), and most annoyingly the wifi card would shutdown/crap out every now and then, usually when I'm running desktop. By crapout I mean it will stop detecting any wifi signals regardless of distance, normally solved by restarting the laptop even though this is only a temporary solution. Until today restarting worked, since yesterday my laptop wasn't picking up any signals whatsoever, even when restarted it was still out, My only solution was to do a system refresh. It now works after the system refresh but this is a big concern. I'm going to contact support.UPDATE 1/22/13: While this problem may only be occuring with me, I believe that the wifi lockout issue only occurs when at a great distance away from the router. So the wifi should operate normally in apartments or dorms, or when you're within a 4 bar distance. It occurs mostly around 3 bars.UPDATE 1/23/13: Nevermind. Even within close proximity of the router(5 bars) after a given time, albeit more extensive then when further away, the wifi anttena lockedout/crapped outUPDATE: 1/26/13: For 3 days now there has been no issue, assuming that maybe the updates to windows have done something. Still some issues with the Hibernate mode, but otherwise this laptop is great. So far, so good.UPDATE: 1/31/13: Had to lower the score back at 3 stars because the issue has happened again and I'm not doing ANOTHER SYSTEM REFRESH AND RE_DOWNLOAD EVERYTHING AGAIN!!! Hopefully over time this issue will resolve itself.So during troubleshooting my laptop has resolved the issue on it's own and I have now discovered the issue. The wifi adapter would randomly disable itself, and to solve this you have to right click the internet connection/wifi icon > open network and sharing center > click change adapter settings in the left panel > right click the router and click enable.UPDATE: 2/15/2013: Some wifi issues still persist, and I don't know of anyway to solve this other than restarting your system. The computer will also fail to start up properly sometimes, and momentarily freeze during use regardless of an i7 processor.UPDATE: 8/10/13 From researching, the wifi issue has to do with Intel's new drivers and the problem should be solved by installing the Microsoft one's", "Date": "January 15, 2013"}, {"Title": "WiFi Is Still A Problem-Continuing Saga", "Author": "USMC Combat Vet \"Retired!\"", "ReviewID": "R2FON3H8UR4FLD", "Overall": "1.0", "Content": "FINAL update:  After even the warranty replacement (different model) was crap I got this: Sony VAIO SVF1532BCXB 15.5-Inch i3 Laptop.  I have NO idea how, but is cored the exact same window \"score\" for performance but with NO problems, less money, back-lit keyboard, astounding battery life etc, etc. Wrote a review if interested. As a former Samsung \"fanboy\" I will NEVER buy another Samsung (sadly).Most recent developments: Yesterday (08/27/2013) Samsung has offered me a free replacement, the model NP470R5E-K02UB. I consider it quite a step down but and taking it. In some ways (for ME0 it is also a step up for my intended use as an email checker, YouTube browser etc. I already have a gaming desktop and Samsung Series 7 gaming 17 inch laptop....I can use the bigger hard drive, already have a portable USB optical drive/burner. I DO miss the 2nd 3.0 USB on this since the replacement only has a single 3.0. Same crappy screen resolution so that is a wash. 8 megs of ram but slower processor. Uses an entirely different WiFi card so I can only HOPE I am done with those issues! To my surprise, they are even paying to ship my old unit back and fronting me the replacement before getting my old one back. The catch is they take my credit card for a $700.00 hold in case I run:-) In the grand scheme of things, I suppose for ME, this is pretty much a wash as to \"value\" considering I only paid six hundred seventy nine bucks with NO tax or shipping at adorama camera. I will hope for the best, expect the worst. Been a long, LONG & winding road with this nightmare.###########################Major UPDATE-More at bottom############################################  I just got this laptop back from Samsung repair late yesterday. SAME PROBLEMS! WiFi random disconnects, mouse/track pad comes & goes etc. A 1 hour 10 minute call later to Samsung and they offered to replace it with the same model. I told them NO way since so many others have had issues when checking online as well as NO stores are selling it after just a couple months. As a result, in the next 3-5 business days they will call me to advise me what my replacement options are in other models. I hope they will be fair. I offered to downgrade at MY expense for a reliable model but they \"promise\" to offer comparable or even an upgrade. Samsung has been great to me and I LOVE my other Samsung computers and products. I honestly feel this computer simply has a ghost that is impossible to find & fix.....I would also like to note that unlike other companies, Samsung paid the shipping BOTH ways, both times. Not sure if I have to pay to return this yet or not. Least of my worries. Makes me sick to lose a computer that flat kicked ass when it worked! I envy those of you who have had such great luck.*****NOTE*****: Many updates at bottom of page. And note that on June 26, Microsoft  will roll out a MAJOR Windows 8 Update, restoring the Start Button, bypassing the Metro Interface (that I hate anyway)and will hopefully, make this computer run a bit more stable. Below are some of what we have coming:Lock screen (pulls in your images)Start screen (tile size changes)All Apps screen (sorting options)Personalization options (background colors and wallpaper)New search features (curated results)SkyDrive (cloud-based storage)Multitasking (resizable app windows)The Windows 8.1 preview will be available June 26 if you'd like to try things out early. Otherwise, the update will roll out later this year.More Windows 8.1 coverage:Microsoft Previews Windows 8.1′s Changes (Yes, the Start Button Is Back -- Sort of)Microsoft Windows 8 Update Will Be FreeWindows Blue Preview Coming Next MonthA Brief History of Windows Sales Figures, 1985-PresentMicrosoft: 100 Million Windows 8 Licenses Sold, Windows Blue This YearMicrosoft's Strategic Blunder With Windows 8____________________________________________________________________________________________________________________I waited a full 6 weeks to write this review. Why? Because like other reviews here at Amazon, I was having NIGHTMARE Wi-Fi problems. Also as some other reviewers, I had mouse freezes and problems with programs not installing etc. Last night I was on Samsung support chat. Transcript removed by Amazon.....So there I was, preparing to box this up to send back to Samsung for repair. Then a funny thing happened. I had tried in vain to explain to my wife what Netgear Genie did and get her to tell me if SHE ever had any disconnect messages from in her room when she is online. She had NO clue what I was asking. I know this is shocking, but even after the study of the female language from the Planet DINGBAT for over 30 years, I have failed to learn their language. Anyway, she brings me her computer all upset and shoves it into my face yelling \"HERE! YOU show me then!\" And after this whole month the discovery happens. I set this new Samsung down on the table next to my recliner where I LIVE on it all daylong every day. I take hers and note that her mouse won't even work (much like mine with the new Samsung-both wireless of course). I start cussing about her computer being even a bigger piece of crap than my new one. She glares at me and adds \"well it works PERFECT for ME\"!!!!!!And it then hits me ....INTERFERENCE? Yep. This whole time, that has been the entire problem. Next to me on my left, about 6-8 inches away from my wireless mouse, sat my Panasonic 5 MHz wireless phone receiver. To my right, on another table surrounding my recliner sat a Liftmaster 829LM Garage Door Monitor for my garage door. It uses wireless to close my door remotely in case I forgot or an intruder opens it. It sat about 12-18 inches from the right of my Samsung. So I relocate my Panasonic phone base to the kitchen, relocate the Liftmaster wireless garage door controller/alarm to the other side of the living room about 15 feet away. The result?You guessed it! I share it all here in the hopes those who have had these problems and may still have this computer try what I did. Look around and MOVE any darn thing you have that uses wireless that is within a few feet of your computer....I simply cannot believe that something so simple, so silly caused me a month of pure Hell. I own 4 computers, I game 8-12 hours a day EVERY day since I retired. On a gaming desktop, a new Samsung Series 7 gaming laptop, XBOX and PS3, PS Vita etc. I have 4 of the latest expensive and fastest ever routers. I have never before failed to figure out any problem. And yet here I was, boxing this up for repair. If it had not been for my wife, I would be dropping this off at UPS today, MAD, heartbroken and forever disillusioned.If there is one single dark cloud that still remains it is this. I sold my old 14\" Acer laptop dirt cheap on (Censored), assuming IT was junk like I thought about this Samsung. I wondered why after wiping the drive & re-installing W7 on that old Acer and showed the new buyer how if worked in my garage, WHY it was so perfect? Live and learn. An expensive lesson but a valuable one.So how do I like this now? Amazing. Exactly as I expected it to be based upon the specs on paper as well as my experience with my Samsung Gamer Laptop. It FLIES, plays games, ANY games as well as I need for the computer on my lap in my recliner. For mega-gaming, I whip out the big gun computers I mentioned above for the better screen resolutions they offer etc. But this never staggers, stutters or has ANY problems of any kind. Wireless is now blazing fast ( I have COX Cable) and I use this computer now for all my video editing programs and for YouTube uploads etc.Multitasking is seamless, the video editing rendering SCREAMS (now-DUH), and all is well with my DUMMY award planted firmly in handIf you have read the few 1 star reviews, consider that THEY also may have simply had the issues I was too dumb to figure out for a month. Maybe they had genuine lemons too? I am not here to judge. But I thought I knew everything. I don't feel real proud or even comfortable admitting my shortcomings on diagnosing the problems I had, here in public. But I am SO stunned at how simple the solution was, to fix such a staggering amount of problems caused, I HAVE to share it.UPDATE 6/15/2013  The WiFi issues have returned. I went thought tech support and it seems my only recourse is to send back to Samsung to be checked. At this point I am unsure if they could find the problem since it is sporadic with WiFi, screen freezes and mouse lock outs etc.  When this laptop works it is just a joy. When it doesn't and goes STOOPID, it makes me want to toss it in the trash. It has now become an honest love/hate relationship. Had I bought from Amazon direct, I would have returned it for replacement and tried a 2nd chance with an identical replacement in hopes I got a lemon. If that failed I would have gone to a different brand. At this point I have SERIOUS regrets in buying this.....UPDATE 6/17/2013: Now this piece of junk is failing in several areas. Graphic card is shooting error/failure messages, WiFi fails every couple minutes now, Can't even open pictures most the time with graphics card failure messages flying. Unable to configure switchable graphics for same reason. I KNOW it will come back in the same shape .Update 6/18/2013: I have now been awake 48 hours without sleep working on this. Dis a complete wipe of the drive, fresh install of Windows 8, then used a USB Dongle WiFi adapter to get wireless and went to Samsung sight to re-download ALL the software, drivers etc. At this point I am so punch drunk I can't even explain what all I have done the past 6 weeks now in my frustration with this machine, trying to get it to work and work with ANY consistency. But as of today at 5:15 AM, it ALL works. Why? How? NO idea.....Even better, my Call of Duty Black Ops II even runs on this now and prior, would crash the entire computer even after I reconfigured The AMD card to run it in Max Performance mode. So here I am, completely lost, exhausted and at this point, don't even CARE how or why it is working. I have now had 4 hours of stability, even on battery power alone. If it goes STOOPID (SIC on purpose)again, I will update.  To anyone who may think I write all this as a Samsung \"hater\" please remember how in love I am with my Samsung Series 7 Gamer Laptop. That is what made me buy this little 15.5\" Samsung as my daily workhorse. I will now adjust this to 3 stars since I have had it from 1 to 5 stars and everything in between as I have wrestled this machine to the ground, kicking & screaming all the way. I am not a complete moron, have built 2 gaming rigs (desktops) and been around since the Commodore 64, Amiga and first versions of DOSS, ran a BBS before the internet. But in my 64 years I NEVER have been so utterly frustrated or ridden such a roller coaster of emotions of loving, then hating then loving again as I have with this \"thing\". Since this morning when I had wireless download speeds of 32.4 MPs and 5.3 MPs upload speeds I posted a photo of test here at Amazon today), played Call of Duty Black Ops II almost as well as my Samsung 19\" gaming laptop (minute the FULL HD screen and 16 megs of ram it has etc), I feel like I want to snuggle up with this thing and sing to it or something. But I have NO confidence that any of this will hold or work for more than till I blink or till the next reboot when I will discover I once again have an \"all new\" computer and NOTHING WORKS AGAIN!  Hope springs eternal but at 64 years of age and with this thing stressing me out, I may not live long enough to see how it turns out:-)Stay tuned.UPDATE June 26 2013~ computer has been sent in to be repaired. Samsung thinks the hard drive has now failed.......for the record, THEY paid shipping both ways. They also however, spent some time first warning me of, and listing, ALL the charges I will be held liable for if there is any question as to the viability of claim.UPDATE July 11 2013:  I got this back 4 days ago and have spent 4 days adding all my \"stuff\", upgrading to the quite new Windows 8.1, re-installing ALL that the Texas repair facility failed to put back on my drive. Most notably, the switchable graphics program so I was not even able to USE the extra AND graphics card. But my petty bitching and LOTS of frustration aside, how does it work now? SO FAR.....perfect once I got all the missing drivers back. What did Samsung do? Not so sure. All it said in paperwork was \"software problem & update firmware update\". Odd since I had already done the update but suppose they duplicated that once they re-imaged the drive? All I can say is it has been rock solid, 100% of the time. So back to 4 stars I go. This roller coaster has been NO fun! But as I had experienced in the past with Samsung on an early 10/2\" netbook, THEY paid the shipping BOTH ways and repaired it with no hassle. More than I can say for any other manufacturer and THAT is why I have become an almost Samsung fanboy. Or in my case fan CODGER.....If anything goes south, I will yet again update. I so want to give this 5 stars but with the endless 7+ weeks of crap I put up with trying all I knew and having lost so much, I just can not.  But know I still may if I get a couple years of trouble free use out of this.UPDATE July 18 2013:  OK, it is only a week in since the return but given my battle, a week may just be a very telling story? 7 days of no, ZERO problems of ANY kind, in ANY way. 100% perfect. Now that I have said that I fully expect it to burst into flames in my lap....but in all honesty, this has now been simply flawless. It is beginning to remind me how my Samsung Gaming Laptop stole my heart and why I bought this in the first place. Unless something changes, consider this fixed. And still, with all the crap it presented me with early on, I still give it 4 stars unless something changes. For me, it has been worth it given the bang for the buck, the stand up behavior of Samsung Support and their paying round trip freight etc on my repair. I honestly hope you NEVER hear from me again:-)MikeUPDATE 8/6/2013: I am FED UP with this piece of junk, back to 1 star. As of last friday it has begun the same crap of WiFi failure. I have 5 other computers in my home that all work 100% fine. Have bought 4 new routers (5 total now) and this computer is just junk. I am done, will try for a charge back with my American Express card. Just not worth another heart attack. I see Amazon has even quit selling these as well as ALL other vendors. Their was obviously some major design flaw.8/8/2013: A BIT calmed down now, it is on it's way back to Texas repair facility AGAIN for same problems. And just like the promises they made me the first time that were MEANINGLESS, the swear to not only replace it if not fixed this time and replace with upgrade. For the record I begged them to do it now, and would be happy to take a significant downgrade for a reliable laptop. I have zero faith. Zero expectations from Samsung at this point. Sad since I have just invested so heavily in so many of their products. No more for me.", "Date": "May 31, 2013"}, {"Title": "Excellent computer when it is on sale for $750!", "Author": "Z. Cellura", "ReviewID": "R2VLBVJV72XFML", "Overall": "5.0", "Content": "This laptop is great! Sure it is missing a few features like back-lighted keys, but overall it was perfect for my needs.  This laptop is extremely fast! Although windows 8 does take some getting use to; please do not listen to these other reviews it truly works a lot faster and is way more reliable then the old windows.  Windows 8 let's your computer boot up in mere seconds so you can start what you are doing quicker.  Their is some downfalls about windows 8 the start thing does get a little annoying because when you open up a pre downloaded app like skype it is hard to work with the new windows (cannot find a way to add someone) and also their is no red closing x on the top.  So I am always wondering when I hit windows to back out if it is still up or not.Now back to the laptop the i7 quad core processor will meet all your needs it is extremely fast and can easily handle world of warcraft/skype/grooveshark/and about 3 google chromes up at once.  I have never had a problem with this computer yet.  The graphics card is alright, it can run WoW perfectly on good and I run it on high with my computer settings all the way maxed up on image quality instead of performance with 4x anti aliasing.One more complaint all of the ports on this laptop feel really tight.  I do not know if they will loosen up over time but it is as the point to where it is actually hard to pull something out of the computer, and when you are trying it feels as though you are going to break it from yanking it out.But overall computer is really fast and seems durable.  Keys are easy to use.  I have had no problem with Samsung's mouse drives it has not froze on me yet.  If this laptop goes on sale again for $750 trust me it is an absolute steal!  Considering the next best laptop around the 750 dollar price range is an acer for 759.  And trust me who would rather have a laptop made by acer instead of samsung?  In the longrun the samsung will most surely last longer then the cheap acer laptops.  I am happy about my purchase and it plays games very smooth on good/high settings.  I would surely recommend this product if you could get it in the 700 dollar price range.", "Date": "January 10, 2013"}, {"Title": "Way too many issues ...", "Author": "Melissa Mao", "ReviewID": "R27IJ0OUK61EW8", "Overall": "1.0", "Content": "Hands down the WORST laptop I've ever owned.  Within a month of getting it, my screen developed a flickering problem, and soon after the screen went full berzerk and would either turn black or be covered with color spectrums (basically nothing can be seen).  This was definitely a screen/monitor reception issue, as I was able to use my computer \"fine\" by using my TV as a monitor.  I did eventually have to send in my laptop to get the problem fixed.  It was fixed.  HOWEVER, now I am having a huge problem with internet cutting out every hour (sometimes even more frequently).  I think this is a wireless card issue.  Highly inconvenient and annoying.  I wonder what other problems will pop up next!", "Date": "November 2, 2013"}, {"Title": "Pretty good computer", "Author": "Talia", "ReviewID": "R3A6F3TCWUH694", "Overall": "3.0", "Content": "I thought I'd write a review of this laptop because I had some issues with it in the beginning and wanted to help others in case they have had the same problem. The wifi hasn't been the issue so much as another problem with image rendering. I installed Chrome and Firefox and both had problems (as did IE) rendering images and content on any web page. I'd have to refresh and then refresh a few more times to render all the content. I found a thread in the Chrome forums about this which suggested uninstalling the Samsung Software Support Center application. Sure enough, removing that (and then clearing all my browser caches) resolved the problem. This software interferes with browser caches and prevents them from caching images and CSS correctly. If you're having this problem, I'd suggest uninstalling that software and clearing your caches. You can always install the Support Center program again if you really want it (I didn't).Apart from that headache, it plays World of Warcraft nicely. I also use it for work and have a million web applications open at a time and usually don't have any other issues with it. Once you get over the steep Windows 8 learning curve, it's a pretty comfortable laptop to use.", "Date": "August 21, 2013"}, {"Title": "First impression review", "Author": "Mario Castillo", "ReviewID": "R10JLC8Y5V8YVZ", "Overall": "5.0", "Content": "I will do a terse review based upon my first impressions.I was looking for a new desktop-replacement laptop that wouldn't break my budget and would let me play my games -I'm nowhere near a hardcore gamer, but I do like to run my Starcraft II, my League of Legends and my steam games at a decent framerate.After a little google research I decided to go for this laptop, based upon its specs, the usual quality of the Samsung brand and the good experience a friend of mine had with a similar equipment.Upon opening the box, I found a very sleek design, almost spartan.  The placement of the USB ports and power outlet seemed sensible enough -trying not to get in the way of your mouse or desk.  I booted the laptop and was greeted by.... windows 8.  At first it was a bit jarring, but after going through the registry procedure, un-anchoring IE and getting Chromium and Launchy, I could care less for the demise of the Start menu.  The screen seems bright and functional, not much to say about it.Then I got my games installed, and configured the video options to use the High Performance mode with my games' executables (this is VERY IMPORTANT, otherwise you'll end up paying extra for a Radeon Graphics card and NEVER USING IT).I then tried a little ARAM action in LoL, and it looked beautiful (who would have thought Irelia could be such a beating?)Afterwards, I tried SCII (Heart of the Swarm) with medium graphic settings.  Everything ran flawlessly.  I was a bit afraid of the keyboard, it seemed a bit too small for all the hotkey shenanigans required to play decently in Starcraft.  But it felt just right and my APMs didn't drop a bit -not that they're THAT high, but I can do a decent macro build, cut me some slack!I tested the battery life -browsing and setting up some cloud stuff, like dropbox and evernote. (By the way, friends don't let friends game online running batteries, there's a special kind of hell for that people).  It lasted for a solid 3 hours.  As a precaution, I'm removing the battery while using the laptop in my home, I understand modern batteries get damaged a lot less by overcharging, but I'd really like to have that battery fresh when and if I need it.All in all, I'm yet to find a problem with this laptop. Windows 8 is still a bit unruly, but it didn't seem crippling to me. I would recommend it to the middle-aged, semi-hardcore gamers as myself.  This is probably not what you're looking for if you want to play the Crysis series at the highest possible settings, but if you need a laptop for the occasional LAN party with your IT buddies and don't want to dish out a grand or more for an Alienware, this Samsung laptop will do just fine.", "Date": "August 9, 2013"}, {"Title": "Pretty happy!", "Author": "Donald J. Gray", "ReviewID": "R1H7VN2SO01RRF", "Overall": "4.0", "Content": "Not many problems with the computer itself, my main problem is with win 8. I don't know when sp1 comes out, but the current version requires modification, I used StartisBack, and recommend it highly, it's cheep and effective. The actual machine was great, except for wifi, mousepad and minor heat issues. Wifi was a bit dodgy and occasionally slow, but definately very usable and generally better than your average usb adapter would give you. The mousepad feels cheepo and is slightly unresponsive, i would suggest a usb mouse, but the mousepad really isn't that bad. The computer heats up a bit if you use it on a bed etc., and a little under the left wrist rest where the cpu is located. I got this computer for $660 though and it looks like the price is up, might as well buy from Samsung now. Great computer, really pleased.", "Date": "June 11, 2013"}, {"Title": "Using Solid works on it", "Author": "diegocim", "ReviewID": "R1RGBQ68GRY5D8", "Overall": "4.0", "Content": "Pros-The hardware it has is just great. Wouldn't get anything better for this price.-Solid works 2012 is running well with AMD Radeon HD 7730M 2GB.-Almost Every work well in this computerCons-Windows 8 ( Maybe for those who are learning windows for the first time its ok. But for those who already knew it, I wouldn't recomend)-Touch pad doesn't really work. For I  was used with apple touch pads, this one sucks. It was suposed to do most of the things new touch pads do. But it doesn't ,the 2 /3 /4 fingers functions work just sometimes, and it drives me crazy.Neutral-I would want the same hardware for the same price in a smaller and lighter notbook.", "Date": "May 29, 2013"}, {"Title": "Awesome Quality", "Author": "Jeffrey Kaufman", "ReviewID": "R2UDG356YTCARB", "Overall": "5.0", "Content": "I have a thing for Samsung products I guess, everything electronic I own is a Samsung. As always, Samsung keeps their quality almost seamless, from one product to another. This laptop is of exceptional value, with the best processor, great graphics, and for the price, better than others. Most of the laptops I compared had lower end products for a higher price tag. This Series three beats others in the same price range. I am totally satisfied and happy to say that the poor reviews I've read DO NOT hold water. This is an awesome quality, higher end component carrying product, worth it's price and then some.Seller provided exactly what was stated, and it was shipped timely.Well done! Five Stars for everything, great deal.", "Date": "April 19, 2013"}, {"Title": "Awesome Gaming Laptop", "Author": "William Dye", "ReviewID": "R20AKE7EVVL1J5", "Overall": "4.0", "Content": "I would love to give this a five star rating but I have two critical complaints. One, since day one it has become warped above the keyboard on the left side between the Fkeys and the monitor, Two, Windows 8 is a headache. I wish it came with Windows 7. One minor complaint, the arrow keys are too close together. Overall I am happy except the warping. I am not thrilled of having to send it back so I will just have to live with it.", "Date": "March 11, 2013"}, {"Title": "Quality product, and a vendor that stands behind what it sells", "Author": "Dennis Zea \"Youve Got a Sale\"", "ReviewID": "R38YO0QDSXNBNP", "Overall": "5.0", "Content": "I am the head of IT for the top Luxury Yacht manufacturer in the US. I have now purchased 4 of these Samsun laptops. I have nothing but good things to say about these units.We did have one that has some sort of hardware issue that was causing issue with loading software. A 15 minute chat with Samsung and it was determined it was a hardware issue. Samsung immediately offered to replace the unit, and that was refreshing. I am used to manufactures giving me the run around about returns.Seeing as I purchased this item from Amazon I chose to do the return through them (it has only been 3 days since I purchased it). Amazon took care of the issue with no hassles.Electronics fail, it just happened. What I expect is when it does happen I want the vendor, and or manufacture to stand behind the item. Samsung and Amazon did just that.I will be buying more of these in the coming month.Only CON is the 6 gig of memory, but a simple swap of the 2 gig stick for a 4 gig stick gives this machine an noticeable increase in performance.", "Date": "February 25, 2013"}, {"Title": "Some issues", "Author": "Artfully Minded", "ReviewID": "R3VL1XB98S0SOI", "Overall": "3.0", "Content": "We just got it, though it took 3 tries, one damaged, one wrong, till we got the laptop. (Be cautious, this is an i7 processor, but the i5 looks identical and is but one digit off on the model number. Amazon sent the wrong one in their second try)The touchpad is not as sensitive as I'd hoped, we've already had to restart it a couple of times to get it to work when it become inactive, but I'm trying to figure out if it is because we're switching sometimes from remote mouse to touchpad...Other reviewer is right about the screen, it's OK, but does not have a wide viewing area. Though I dissagree about the processor, it seems quick to us.I will update this review as I go, but I was hoping to be thrilled and so far, I am more worried about this rather expensive purchase than not.Update: 3 weeks later. We went back and forth about returning the Laptop before the 14 days window and opted to keep it. The issues we are having now are likley about Windows 8 compatibility with some programs. Most things run fine, but some programs become glitchy... but not glitchy enough to return it.We will try the system refresh suggestion from another reviewer and see if that helps our mouse-pad issues.", "Date": "November 30, 2012"}, {"Title": "Excellent product", "Author": "Amazon Customer", "ReviewID": "R3PF5TN8NO616T", "Overall": "5.0", "Content": "I bought this mainly for work, browsing the web, and ocassional gaming....this laptop has exceeded my expectations so far! I also really liked windows 8, once you get used to it, and start using windows store apps, you will never want to go back!", "Date": "November 1, 2013"}, {"Title": "excellent", "Author": "John", "ReviewID": "R2T59VUJV0I14Y", "Overall": "4.0", "Content": "laptop works excellent. matches the back of my note 2 phone. only thing I didn't like was the built in anti-glare screen. shipped fast safely packaged.", "Date": "September 12, 2013"}, {"Title": "Great Performance", "Author": "Daniel Bromfield", "ReviewID": "R3SG1NSNROG5QY", "Overall": "4.0", "Content": "It is a good system in terms of performance but the only reason it didnt get a 5/5 rating from me is the windows 8 operating system it came with. It is very annoying to manipulate but as i said the system is very good for the price it was sold (Y)", "Date": "July 4, 2013"}, {"Title": "Works as advertized", "Author": "N.E.", "ReviewID": "R1YAQLS7IGQA52", "Overall": "4.0", "Content": "Installation was flauless right out of the box. I was looking for the best computer for the price and this one meets the criteria.I expect this computer to serve the college student who owns it, well.", "Date": "June 27, 2013"}, {"Title": "Awesome", "Author": "Andrew Morris", "ReviewID": "RKGYOYLWKVQ1F", "Overall": "5.0", "Content": "This is perfect for our uses; the graphics set-up in particular is fantastic for a notebook. My wife will use this for on-the-go graphical design, and so far she has zero complaints.This was shipped from Adorama, who beat all delivery estimates and got it to us ahead of schedule - can't ask better than that for a birthday present!", "Date": "June 18, 2013"}, {"Title": "Good Laptop...I hate Windows 8", "Author": "Rayo", "ReviewID": "ROR4JDVKTDXOS", "Overall": "4.0", "Content": "This laptop has a nice design, good specs and comes at a good price. The main issues I have with this laptop is the screen makes a noise when I open and close it which is a little concerning for a new laptop and the other is the touch pad, I dont know if its the way windows 8 handles the input as gestures can be preformed with the pad or its an issue with the actual device. The touch pad just doesnt feel right, but thats where the wireless mouse comings in.", "Date": "June 3, 2013"}, {"Title": "Good for the price.", "Author": "George schrils", "ReviewID": "R3DVZRUGY4SD1V", "Overall": "4.0", "Content": "It is a very capable laptop. My only drawback would be Windows 8. It is not yet ready. Some of my programs crash and it is not very comfortable or intuitive if you don't have a touchscreen.", "Date": "March 19, 2013"}, {"Title": "Doesn't get hot", "Author": "Amazon Customer", "ReviewID": "R3IHELS4OZ8YZP", "Overall": "4.0", "Content": "It uses very little energy but is quick.  Display is awesome.  Only problems is Windows 8 and getting things to work properly in it.", "Date": "March 15, 2013"}, {"Title": "Great Laptop", "Author": "Bla", "ReviewID": "R1GPN3VXOHW3EI", "Overall": "5.0", "Content": "Got this laptop for my brother. He loves it and its a great laptop. We both love the fact that it has the ability to switch between the Intel HD Graphics card for battery battery life and the Radeon HD graphics card for playing games.", "Date": "February 10, 2013"}, {"Title": "Best Laptop I've Owned", "Author": "Brice A. Laris", "ReviewID": "RW4JTN06QGI8D", "Overall": "5.0", "Content": "I consider Samsung products the new \"high-end\" electronics.  Initially I was hesitant having got a bad DVD player 15 years ago, but Samsung has redeemed themselves.  I have a TV and cell phone from Samsung which is why I went with this computer.  It is fast, portable, feels great to type on.  It has a great picture and it amazes me how well I can play games like Starcraft 2 and Command and Conquer on it.  I'm not too crazy about Windows 8, but I suppose I'll get used to it.", "Date": "January 25, 2013"}, {"Title": "Great laptop", "Author": "C. R. Metzgar", "ReviewID": "R5W3BNQP1DP67", "Overall": "5.0", "Content": "This is a great laptop for people on the go and for photographers who need a computer to work in the field.  I haven't gotten photoshop on it yet, but Lightroom runs well on it and I've seen a friend use Photoshop on it for several projects.", "Date": "January 24, 2013"}, {"Title": "Great for the price... Got rid of Windows 8!", "Author": "Joe \"narly charley\"", "ReviewID": "R651T1M5YFM5W", "Overall": "5.0", "Content": "Alrighty, I've never written an Amazon review, but I thought this laptop needed one. I actually bought the laptop at Bestbuy because I got 18 months interest free, and they even price matched Amazon's $750.Before I bought it, I was reading reviews on how it was impossible to remove Windows 8 on the laptop, they are wrong. It was kind of a pain, but not impossible. I tried Windows 8, but it just wasn't cutting it, and I use a few things don't work with it.Here's what I did to remove Windows 8, and boot a different OS to the HDD (I did Windows 7, and also tried Ubuntu too):The problem with not being able to boot a different OS to the HDD is that you can't enter the BIOS. You can't get to it because Samsung has that stupid fast boot crap. I removed the HDD and hooked it up to my desktop to where I could enter the BIOS. I then booted and installed OVER Windows 8. I booted Windows 7 to it and then got it installed. I put it in the laptop, and it went straight to BIOS! I wasn't upset, I was actually really happy that I was able to enter the BIOS! I then went through the BIOS and the first thing I disabled was the quick boot option, so I could then enter Bios when the \"Samsung\" screen first shows up by pressing F2. I then had to figure out why Windows wouldn't boot from the HDD that I had installed from my other computer. I had to go into the BIOS settings and switch the OS setting to \"Legacy\", so that Windows 7 would read. I saved the settings and restarted it. The Windows emblem came up and it said \"starting Windows\", but then it froze and then went back to the first main boot \"Samsung\" screen. It was in this loop (unless I pressed F2 to go into BIOS settings). So I then popped in my Windows 7 x64 bit and then switched the BIOS settings to boot from the disc drive first. It started up and I was then able to do a CLEAN INSTALL of Windows 7!After the clean install, I went on the Samsung website and downloaded EVERY driver for this laptop and installed every one.I'm so glad I got rid of that Windows 8 crap and now can use the laptop like it was meant to be used.Ok! As for the laptop itself, I really like it! It is pretty light, easy to carry around. The ports are all very snug. The disc drive seems pretty slow, as well as the HDD, slow RPM's.The 2GB AMD video card seems to handle games VERY well. It won't be able to play Crysis on max settings, but it plays newer games just fine!I would recommend this laptop to anyone, especially for $750.", "Date": "January 23, 2013"}, {"Title": "Laptop great, Windows 8 ain't", "Author": "Vaio127", "ReviewID": "R3BZBH0RRZXBQD", "Overall": "5.0", "Content": "I've only had this laptop for a day now, but I'm already quite pleased with how it is performing.  As a 'super user', I've found that this machine's components have easily performed all the tasks I've put it to, including typical business work and playing mid-range games quite well.  The Intel Turbo Boost runs automatically, and drastically improves the performance beyond my other laptops which are all multi-core and in the low 2.x GHz range.  Aesthetically, it is very smooth and streamlined, and runs quite cool and quietly.Even while shopping for a new laptop, I had the intention of wiping the hard drive completely and installing Windows 7.  During the first few minutes with Windows 8, I was utterly disappointed with the layout, and also the lack of the traditional start menu.  For my purposes as a computer programmer, the traditional Windows 7 layout is ideal for productivity.  WINDOWS 8 IS A PRODUCTIVITY KILLER!  Fine for a casual internet surfing experience perhaps, but for anyone who uses the computer for work of any kind, academic, business, or personal, Windows 7 is the way to go.In summary, the hardware boasted by this laptop is excellent for the price range, but do yourself a favor and consider a different operating system.", "Date": "January 4, 2013"}, {"Title": "Hardware problems; WIN8 went from bust to winner", "Author": "Amazon Customer", "ReviewID": "R16DR9YP7FT2QU", "Overall": "1.0", "Content": "I've had this laptop for 2 months, too long to return it without a penalty.  Too bad.  I spent too long trying to make it work, then came the holidays, etc, etc.Windows 8 is an incredible productivity killer.  Things that work at first, stop working.  Sometimes they begin to work again, only to fail again.  For example, Google Earth worked initially, but it has stopped.  It will not re-install, presumably because it thinks Google Earth is installed.  When I try to uninstall it under Win8, the uninstall hangs.  My MS Outlook stopped downloading my mail from Bellsouth.net.  It will still send mail, but it does not download my mail. Of course, I have a workaround but it is slow & frustrating.  Sometimes a Win8 app will stop working, then, after the machine is restarted, the app works ok.  Yes, very inconvenient.I'm forced to go back to Windows 7.  It will cost me at least $175 plus a lot of my time.Update:  I ordered Win7 (ca $167), however, I was out of town for a week and did not install it right away.  During this time, there were a number of Win8 upgrades.  And, guess what, Win8 started working like it should have on day 1.  I can now download my email--that is a biggy.  There are other small things that are also working better.  Bottom line, I returned the copy of Win7 today.  I have no benchmarks, but the computer seems fast at boot-up and various operations.  At this point I am quite happy with this computer and Win8.  I've raised the rating to 3 star.  You still have to go to the Win7 desktop to do things like word processing, spreadsheets, etc.  That is still where I handle all my files and images. Some of the Win8 apps are useful.  If things continue to work, I may come back and raise the rating again.Update 2:  Computer still seems fast at booting up and most operations.  I'm working solely in the Win7 desktop mode.  Current complaint: after being able to download/send my bellsouth.net email in Outlook for a month, it has stopped sending.  First, it wouldn't receive, now it doesn't send.  Hard to believe.  Fortunately, I've found that I can send/receive from my Gmail.com account.  I just have to get everybody to start to use my Gmail account.  Basically, I like the computer, but WIN8 on this computer continues to be problematic.Update 3:  I've used this computer about 6 mos. now.  I'm very pleased with it.  Outlook started downloading my bellsouth.net email, but stopped sending.  Now, I've given up sending mail via my bellsouth.net account through MS Outlook.  I don't know if the problem is AT&T;, WIN8/Outlook or both.  Now, I use gmail--works great. I'm happy.  Do all work on the WIN7 desktop, but I use a few WIN8 apps like \"To Do\" list, \"Unit Conversion Tool\", \"ESPN\", \"Kindle\", but spend almost all of my time on the Desktop.  I was finally able to uninstall non-working Google Earth & re-install it.  Works fine now.  A couple things I now like about WIN8 and this machine is it is reasonably fast and rock solid.  Raised my rating to 4 stars.Update 4: Dropped my rating down to 1 star.  Used this laptop for over a year.  Both graphics adaptors have stopped working. Machine now using generic adaptor--pretty poor if you do any kind of gaming (I don't) or video work.  After numerous emails to support, it appears the problem is improper drivers.  I have been unable to get Samsung to send links to obtain WIN8 or WIN8.1 drivers for the 2 display adapters.Lesser complaints: keys are not backlit, couple that with the fact that the F and J keys, which have a raised portion to locate your hands on the keyboard, that raised portion is very small and, my hands are hard to locate properly on the keyboard.  Therefore, in dim lighting, like in the evening, it is hard to use the keyboard.", "Date": "January 3, 2013"}, {"Title": "Works perfect", "Author": "Alicia", "ReviewID": "R3O2M1S4JQFKCN", "Overall": "5.0", "Content": "The laptop is excellent. The only thing I don't like is that I have to lock the mouse every time I run it.", "Date": "September 8, 2013"}, {"Title": "Great for the price", "Author": "oddrobot", "ReviewID": "R6MI1G497T9LU", "Overall": "3.0", "Content": "pros: plenty of RAM, good CPU, good video card, good keyboard.cons: heavy, screen could be higher resolution, they should remove the dvd player to save weight.only 3 stars because of seller:DO NOT BUY EXPEDITED SHIPPING from sunnytechsale. They ship ground no matter what. It double the shipping price for nothing.Packing was barely adequate.Notebook itself is a 4 stars.", "Date": "March 23, 2013"}, {"Title": "Impressed with Windows 8", "Author": "Ibejoe", "ReviewID": "R2KDQOU2T8M85D", "Overall": "5.0", "Content": "This computer is great for the price, although Im giving it five stars there are a couple of small things I am having problems with, but they can be easily fixed with updates to certain software.Windows 8People who hate windows 8 are people who are brand junkies. Anything that has a label with windows on it, they hate. And anything with a apple logo on it, they buy. They'd buy a car just because had an apple bumper sticker on it. I thought windows 8 was gonna be bad until i actually used it. Im impressed, its actually a pretty solid OS. Its definitely is made for touch screens, but its not bad for a desktop. What i like on this computer is the mulit-touch mouse pad. You can do things similar to what you can do on a mac, like swipe the edges to go in between programs, 2 finger scrolling, swipe opposite direction for settings. The track pad does have a few problems that can be fixed if the developer would update its darn driver to fix the bugs o_O.Its different than other windows versions, yet with the same feel. It takes some getting use to but once you are use to it, its really awesome to use. What i like is how they didn't put a lot of time and effort into pointless gimmicky things (bells and whistles), like what apple does) for just looks. They actually made it more simple than vista and windows 7, yet a LOT more proficient and you are able to be more productive with the way the switched it up and adding new features. Im big on windows XP, because its not over the top with stupid gimmicks to wow you into buying it, it straight forward, simple, requires very few ram to run so you can your programs better. Vista and windows 7 killed this with trying to look \"cooler\" than mac. But windows 8 finally bring us back into something that's actually made for productivity.The actually computerThe Mac equivalent to this computer would cost 1800 dollars. Considering this is only 690 your getting a pretty good deal. The Raedeon graphics processor is awesome, though the 2 graphic cards made things confusing at first cause you actually have to tell it to run certain programs with it. I ran Star Wars the Old republic on it at the Highest settings, and it runs soooo smoothly. 2 GB is plenty to run almost any game you want. 6 GB of ram is enough, I think im going to upgrade it to 16GB but you have to update to windows 8 Pro in order for it to recognize the cards.(the one thing i don't like)The the actual screen is not that great. Its okay, not terrible, but its not a HD screen. Its looks a lot better when you switch the programs over to the Raedeon card instead of the 4000. Helps a lot.", "Date": "March 24, 2013"}, {"Title": "It's a GAMER", "Author": "Andy Cutrona", "ReviewID": "R3J10DCCQ28SI", "Overall": "4.0", "Content": "I have run a high end game on it for a week at about 8hours at a time with no problem. This laptop is great but,,,, Win8 is going to take some time to ?(figure out)?(give me back my (start button)). Using it so far leads to believe it would be great on a Tablet not a PC. I believe they will fix Win8 which will put my ratting at (5 stars).", "Date": "December 24, 2012"}, {"Title": "nothing bad to say except..", "Author": "Prince Leonil \"Leonil\"", "ReviewID": "R3WZEDCXD7T8J", "Overall": "4.0", "Content": "i bought this recently with windows 8 installed, with core i5- 6Mb ram.So far working. but im an engineer and not a social parasite, so i need an interface similar to windows 7 so i can use it for home and office work to easily access my engineering (cad and design) and utility applications.first off, windows 8 is not proper for the screen as it is not a touchscreen. fail here. metro should not be the default, but an option.so i installed the free Start Menu (Pokki) to restore the old START menu. that sorted out the problem and avoided the desktop starting in the metro.i installed all my programs and now its working as expected.but i noticed i cannot access the Bios even by pressing F2. now im traveling abroad and i need to setup the Bios password access just in case this laptop gets stolen by some crooks to deter them from accessing my files and email.i was able to find the solution by UPDATING THE BIOS to the latest version using the Samsung SW Update program. after updating, it allowed me to access the Bios using F2 and thereby set the supervisor password and startup password. weird, now im thinking my laptop must be some kind of prototype not their retail.im giving them 4 stars because of this necessary effort i have to make.i also installed and use the Windows 8 Manager program to deactivate from startup the samsung programs and some other programs that is useless crap. but this seems to be common to all new laptops anyway.overall the laptop is ok. can even run and play the latest games at lower settings. a good purchase in general and i would recommend it!", "Date": "February 23, 2013"}, {"Title": "avoid at all costs...", "Author": "T. Cooney", "ReviewID": "R3EMYLYB9VWKWV", "Overall": "1.0", "Content": "holy cow.... this thing is ridiculous.. i got it to replace a 4 year old lap top and the thing is way worse than my old one.. the pointer freezes constantly and the wifi is the worst i have ever seen.. also the touch pad is awful... i cant even describe how disappointed i  am with this thing.. oh and i had to call samsung (terrible) and try and get the amd graphics card to work because the computer came without the drivers even installed.. i HATE this thing and will never buy samsung again.", "Date": "April 1, 2013"}, {"Title": "Windows 8 SUCKS!", "Author": "samuel lee", "ReviewID": "R13QRJ7OGAQ6T", "Overall": "1.0", "Content": "There are no other words to describe my frustration with Windows 8.I had to return the notebook just because of the Windows 8 platform.", "Date": "May 1, 2013"}, {"Title": "Avoid This, look for other products available on Amazon", "Author": "Tony", "ReviewID": "RE2PT5N6RISJZ", "Overall": "1.0", "Content": "Quite simply, the computer is terrible, and the customer support is just as terrible maybe worse. The mouse froze on the computer once about every 10 seconds, and the computer would not install aps or programs. Their customer support representative did not know how to diagnose the issue, and so their customer service was practically useless. So I, essentially wasted 1 hour on the phone for nothing. The support representative told me that the mouse might be freezing because I was running too many applications on the computer at once, but the only applications i were running at the time were internet explorer and maybe norton internet security. But The computer comes equipped with an intel core i7 and 6 gb of 1600mhz of ddr3 ram, and that's what the i7 is meant for, which is essentially to handle many applications at once and multi-task. The customer support representative that I spoke to seemed clueless about the issue and could not assist me in the issue. Just do yourself a favor and look at hp or asus laptops...", "Date": "February 6, 2013"}, {"Title": "Decieving model name", "Author": "CaptainNeb", "ReviewID": "R36THIN359UL81", "Overall": "3.0", "Content": "The specs for the price seem 'fair' at best. The low res of the monitor and sub-par graphics card would hardly make this a 'gaming' laptop. Sure it will handle graphics from games like WoW that came out nearly a decade ago but newer games are more demanding. Just because you call it a gaming system doesn't make it so.", "Date": "November 25, 2012"}, {"Title": "Disgustingly slow", "Author": "Curtis", "ReviewID": "ROT9GMEHT5GD5", "Overall": "1.0", "Content": "I was given this laptop as a present for Christmas this year (2012) and it worked good the first day or two, now 4 days later, it took me 20 minutes to get to this page on amazon. its windows 8 I believe though, as I've heard the the whole operating system is just garbage, which frankly, id have to agree with. it looks good but doesn't work good at all. I am looking for a new HP to continue what I'm doing. Samsung makes many good things, but laptops certainly aren't one of them. HP's are the way to go.", "Date": "December 29, 2012"}, {"Title": "Sucks...", "Author": "john french", "ReviewID": "RG97F08VWF678", "Overall": "1.0", "Content": "enough said.....not to mention it has windows 8, which i was excited for, but its terrible, dont buy anything with windows 8.", "Date": "March 14, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0098O6CMO"}}