{"Reviews": [{"Title": "Fast, Powerful and a great screen", "Author": "The Man", "ReviewID": "R17H7FXIRJAZNB", "Overall": "5.0", "Content": "I love this laptop, it is extremely powerful and quick, the only flaw I see is it's a bit on the heavy side and the battery life is not that great. But if your like me I was replacing a desktop and wanted the larger screen and didn't really care about battery life I was wanting a power packed machine and this laptop delivers in every way... Would definitely buy another...", "Date": "December 17, 2013"}, {"Title": "Great Notebook", "Author": "Johnsow", "ReviewID": "R2UEVG900Q4PN2", "Overall": "5.0", "Content": "These are getting harder to find.  These are great notebook computers.  They are a little pricey but still worth the price.  The only downside to these laptops is they come with Windows 8 preinstalled.  I installed Windows 7 and it works great.", "Date": "March 6, 2014"}, {"Title": "Nice speedy machine", "Author": "C. Giglio", "ReviewID": "R2TXOBA2M19RLJ", "Overall": "4.0", "Content": "I bought this laptop to use mainly for web design. I wanted the larger screen because I use photo shop a lot and I couldn't see using a 13 or 15 inch screen to do that. This is a desktop replacement machine for me. I really like the ergonomics of the laptop. The profile makes the screen higher up in the back, so I'm not hunching down to view the screen at the correct angle. I was worried about that while deciding to buy a laptop instead of  another desktop or all-in-one. Windows 8 was an adjustment, but I really like it now. I got the extra ram and i7 because of the photo shop use. It's great, such a difference from my 5+ year old desktop! I'm not a gamer, so I can't comment on that aspect, but I feel pretty cool anyway! :)", "Date": "March 6, 2014"}, {"Title": "kinda like a starter", "Author": "Throthren", "ReviewID": "R2JZ9UVHO7ZRPR", "Overall": "5.0", "Content": "This is amazing laptop and I great upgrade from what I had before.  This is a great laptop to get if your working your way up to better one or you want a really good laptop", "Date": "February 22, 2014"}, {"Title": "Laptop wows Service SUCKS", "Author": "Bill Kepford", "ReviewID": "R1QBL2W284O4D1", "Overall": "1.0", "Content": "Really nice laptop. Quality gaming laptop with top performance.  Up to today I would always recommend Asus for most of their product line.purchased 12/17. Gave it to my son for Christmas 12/25. on 1/11, I had to rma the whole laptop to get a windows activation issue resolved because it was policy not to provide product keys. Didn't get the laptop back until 1/28. on 2/8 I call because the power adaptor has stopped working.  I verified that it was the adaptor by replacing it with one from another Asus laptop with the same power specs. First I was required to argue with the agent about if the product was under warranty(because Dec to Feb is always more that 90days) but he would gladly sell me a new adaptor. Finally agreed that an in warranty rma was justified. Explain to me how it would happen exactly as before and we would be down for another 2+ weeks. When I asked if we could do something to make it faster like some sort of advanced replacement, I was told no.  I asked to talk to a supervisor because I figured since this was the second issue a higher level of service was warranted. Robert a supervisor in the support department told me that was policy. oh and what the agent didn't make clear is they wanted me to send in the entire laptop again because the adaptor doesn't have a part # or serial #.  If that didn't annoy me, while I was looking at the adaptor I noticed it had a part # ADP-150NB D  and right below that is a serial number. Did Robert like that? Didn't matter policy is policy I can send everything in if I wanted a replacement.  Their policy saved them money, I will take the $50 it cost to ship the laptop the first time and buy a generic power adaptor. And not ask them to do anything.I may have bought refurbished but service is universal. I don't think the service would have been different if I had spent the $1250 on a new laptop than $1250 I spent on the refurbished one.", "Date": "February 10, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00ADDX53I"}}