{"Reviews": [{"Title": "Nice Laptop!!", "Author": "Bill", "ReviewID": "R1DKJ7E7SX66S6", "Overall": "5.0", "Content": "What a laptop!! I have no idea what that other guy was talking about with the slow responding issue. This laptop is extremely fast!! I am able to play all sorts of games like minecraft and call of duty on nice settings. I will recommend this to anyone who wants a multimedia laptop! I was really happy with my purchase but I wish they had a back-lit keyboard included, not that big of a deal though.", "Date": "May 11, 2013"}, {"Title": "I am in love!", "Author": "franedwards76", "ReviewID": "R3KU0IHKHUT9XR", "Overall": "4.0", "Content": "This laptop is so amazing and really fast right out of the box. I can not get over the amazing sound quality that it has. My only BIG problem I have is that it is  falling apart after having it for 3 months and taking very good care of it. The entire corner on the back left side chipped off and not I have to snap it shut several times a day. The colors are starting to not show up right *colors running together badly). I am glad that I got an extended warranty because it is going to need this. I am awaiting on my box to ship to me so I can send it off for repairs. Besides that, it is the BEST Laptop I have ever owned and I think it is very good minus it falling a part from cheap parts. If anything happens and I loose this laptop, I will get a full refund and buy the exact model again. I got the Square Trade Warranty on it for 3 years. I had a Dell and although it did not fall a part, it failed with Mother Board, Hard Drive & few other minus issues all in 6 months. This Laptop is much better then Dell. MUST BUY!!!!!!", "Date": "November 10, 2013"}, {"Title": "Heating problems", "Author": "Pierce", "ReviewID": "R3GITEYLR983E3", "Overall": "1.0", "Content": "I own 4 of these laptops.  The first several months were good.  My 3 teenage daughters and I are all advanced computer users.  They absolutely know not to use the laptop on your lap.  It blocks the vents for the fans and causes the computer to heat up.I maintain all of our computers keeping the vents cleaned and generally making sure all is running well.  Replacement costs generally come out of my pocket.Though the laptops have been intelligently and well cared for, 3 of the 4 are now having heating problems. Once you start looking into it, you learn that most of the DV series has heating problems and the DV7 is no exception.  We are using laptop bases that have fans in it blowing up on the bottom.Sadly the video chip has not fan, no heat sink and no vents.  It is very common to lose these mainboards due to this.  The computer starts but the video is black.  Single blinking caps lock light means the processor has a problem.  Again it generally isn't the processor but the video chip.Even with all my effort, this happened to me today.  The repair guy at the computer shop tried to \"reflow\" the chip but no luck.  The board is trash.  I'm trying to figure out what I can do to keep the other computers from being complete losses as well.Good luck if you own one of these.", "Date": "April 28, 2014"}, {"Title": "Works well for my purposes", "Author": "Alexander R. Pruss", "ReviewID": "RGKJKLWG3GGE", "Overall": "4.0", "Content": "I got this for family and for hobby Android software development.  It seems to work great for both purposes.  It all feels pretty snappy (certainly compared to the 10-year-old Pentium M that it's replacing, but also doesn't feel any more sluggish than my work i5-based laptop).  For just plain web browsing, it's very decent (Browsermark 4530 with Chrome).Development work:It's fast enough to run the Kindle Fire HD emulator that I couldn't run on my old laptop.  In hindsight for that purpose it would have been better to get an i5-based laptop so that I could use HAXM which needs the Intel variant of the virtualization extensions.  Still, for Android emulation purposes I can run Bluestacks on it, and Bluestacks runs at a very nice speed (it must be using the AMD virtualization, as expected since they have a partnership with AMD).Startup times for things like Eclipse are good, and build times are fine.I installed Cygwin and, just in case I need a real Linux for something (I sometimes find a need to run something on a Linux machine), VirtualBox with Lubuntu in it.  I haven't played much with VirtualBox/Lubuntu except to start Firefox and install Chromium in it, and it seems to work at an OK speed (Chromium gets 3851 Browsermark, with only one CPU core dedicated to VirtualBox), so the virtualization extensions on the A10 must be doing their job.Fun:Haven't really tried any games other than Minecraft and Trine, which work quite smoothly.  Most of the non-phone games I play are old, sometimes very old (e.g., Infocom text adventures) so I don't foresee any difficulties.Screen:Nice and bright.  I was concerned about the glossy screen--I've always had only matte screens, but it's generally fine.  The colors were a bit muted until I ran the Windows color calibration (Windows+Q and type in \"calibrate\") after which they are *really* nice.  Unfortunately, the calibration was being reset each time I logged in, but I fixed that by starting the task manager (ctrl-alt-delete, Task Manager), going to Startup, and right clicking on Catalyst to disable Catalyst.  (I didn't really need Catalyst Control Center.)Slightly higher resolution would be even nicer, but 1600x900 is acceptable.Trackpad:I initially occasionally hit it with my palm and it moved the pointer.  A smaller trackpad would be better, as would one that's better placed.  This one is so placed that for natural typing, almost half of the right hand would be over the trackpad.  One can turn it off, though, with a double tap on its upper left corner.  (Which also turns on a nice trackpad-is-off light.)I eventually lowered the sensitivity of the trackpad and the accidental-hit issue isn't there any more I think.Sound:The sound is very good for a laptop.  Laptop sound has always been too quiet for me even at maximum volume but this one is more than loud enough for comfortable movie watching even without maximum volume.Temperature:It heats up like all laptops do, but I haven't been uncomfortable.", "Date": "October 25, 2013"}, {"Title": "Great AMD laptop", "Author": "Dave", "ReviewID": "R8B0Q75FUZGWK", "Overall": "5.0", "Content": "I have the 15.6\" version of this and its a great laptop for the price. The graphics card is integrated and runs on system RAM, meaning it will outperform many 1-2gb cards with dedicated RAM when the laptop demands more performance. The A10-4600m is a strong AMD CPU, able to compete with the comparablely priced Intel i3 & i5 CPUs. For gaming purposes,  it will run almost all newer games at low-medium settings with antialiasing off. Older games 3+ years old all run at high-ultra settings, including games like Fallout 3/NV, Oblivion, Age of Empires 3, Bully, Company of Heroes, Lord of the Rings BFME2, and many others without issues. I would recommend this to anyone who needs a graphics intensive laptop for music and video editing, as well as gaming or just facebooking.", "Date": "July 17, 2013"}, {"Title": "Decent", "Author": "Andrew Stull", "ReviewID": "R2RIOBT68L4RAP", "Overall": "4.0", "Content": "I receive this laptop has a present. Its worked fine so far. No problems at all. It plays games like Minecraft, and even the original Halo combat evolved pretty well. If you are using it right, the battery could last for four hours, which is nice. Like I said in the title, it is a all around nice laptop.", "Date": "June 2, 2013"}, {"Title": "Best Laptop I have ever owned.", "Author": "Joseph C.", "ReviewID": "R458ZQQ9NWOJW", "Overall": "5.0", "Content": "This has to be the best computer I have ever owned.  Plays any game I want it too.  Browsing through computer loads files instantly.  Runs HD videos FLAWLESSLY.  I bought mine for the same price on NEWEGG refurbished and It was one of the best investments.  I highly recommend this laptop to anyone who is looking for a decent gaming laptop.", "Date": "April 5, 2014"}, {"Title": "Trouble, trouble eveywhere", "Author": "CJ Christian", "ReviewID": "R1O8A0EKKIV9Y5", "Overall": "2.0", "Content": "I have been billed for 2 of these machines.  I only received one....but the Amazon retailer billed me for 2?  I've contacted those concerned and requested a refund on the non-existent HP ENVY.  We'll reserve judgement until we receive correspondence from the retailer.  Anyway, the HP ENVY that did arrive took forever to engage for the first time and then worked for about 30 seconds before the screen began blinking on and off for no reason.  I shut it off and tried again with the same results.  So I shut it down and headed for bed.  Yes, I tried once again in the morning, hoping the third time would be the charm?  Nope!  So now I have  zero working computers and TWO refunds requested.  Bah Humbug!!CJ Christian", "Date": "December 24, 2013"}, {"Title": "Great Laptop", "Author": "Juan Pablo Medina Balza", "ReviewID": "R39AGEW0S8V7YH", "Overall": "5.0", "Content": "I've being using this computer for more than a year and with photoshop, corel, and other graphic softwares and is incredible, I dont like 2 things, windows 8 sucks.. I hate it. And the 2nd thing is that gets hot at the bottom and i needed to buy a laptop extra cooler mini table.The sound is amazing, the graphics A+, Windows 8 sucks, built on an elegant frame, nice detalis, good webcam, also I bought 16 gb in ram and if this computer had a different OS will be just heaven. ohh I almost forgot.. Windows 8 sucks I hate it!!", "Date": "May 5, 2014"}, {"Title": "This is a great laptop", "Author": "anatoliy", "ReviewID": "RMNZYV6IU7TQD", "Overall": "5.0", "Content": "I ordered it and received it as it is in the description, its exactly what I wanted thank you very much:D I'm super excited, its my first laptop.:D", "Date": "September 14, 2013"}, {"Title": "Garbage", "Author": "tbehland", "ReviewID": "RK4JQ3LAXLIHO", "Overall": "1.0", "Content": "Again disappointed with the garbage that HP has put out.  Took computer out of the box and proceeded to use wireless internet and as usual HP did not load the driver for it.  Went online to web site and downloaded driver, after trying to install it, restarted my computer and you guessed it...a blank screen with several dots going in circles.  I figured it was loading the software at startup and left it for several hours then over night.  When I looked at it this morning it was still blank.  Would like to send it back to HP...only problem is I am in Saudi Arabia and FedEx would cost me about the same as the purchase price to send it and we all know how cheap HP is...they would bill me when they sent it back...never again will I buy HP.", "Date": "October 6, 2013"}, {"Title": "Worst laptop company ever, pavilions are tarrible. Do Not Buy HP", "Author": "Eva B.", "ReviewID": "R1534PR2VBGSRI", "Overall": "1.0", "Content": "I bought a HP pavilion a few years ago for school. It has great specs and looks and I had owned an old HP before that ran great. I figured I couldn't go wrong. I won't deny that it runs great and does what it's supposed to. But less then a year after buying it, it breaks. There was a minor problem with the screen and it wouldn't turn on. I contacted the customer service about the problem. They said they didn't cover screens under the warranty, and it would hundreds to fix. They didn't care about the fact that it wouldn't turn on. If I sent it in, I would be charged no matter what. Furious, I put it away for a year and forgot about it. After finding it again a family member with computer fixing skills had a go at fixing it. To my delight he fixed the problem, a loose cable by the power button. Hardly a costly fix. The screen hasn't shown the problem, everything runs fine. This was two days ago. Today it went into hibernate and I could not get it out of sleep mode. When I hard crashed it made an unusual sound, like everything was shutting down and then it clicked. It's hard to discrible the sound but it was not good. My family member said it was the same sound he heard when his previous (rather new) HP pavilion's motherboard died. I have been unable to turn it on. Nothing was out of the ordinary on both occations of it dieing, nothing was done to it, the computer was less then a year old the first time and hasn't been used for months the second time. Their customer care alone is worth less then one star. The fact that mine broke without notice, and the fact that everyone I know who has owned an HP has had a problem is enough for me to say, Do Not Buy From This Company! Save your money and buy an Asus or Lenovo. Everyone I know who bought from them hasn't had a problem and the customer care is great. Save yourself a headache and money, don't buy HP.", "Date": "August 7, 2013"}, {"Title": "Fail, fail, fail", "Author": "Rowdy", "ReviewID": "R399D23UTW2KXF", "Overall": "1.0", "Content": "I did not purchase my HP Pavillion from amazon.com. but want to take this opportunity to warn others about the failures. Even with the best, most current Virus protection, my hard drives have crashed twice in 14 months. the product is cheap, customer service fromk Mumbai, a joke. buy something else..", "Date": "August 27, 2013"}, {"Title": "Slow responding", "Author": "Howard L Ratcliff", "ReviewID": "RPXGFWMW5W094", "Overall": "2.0", "Content": "The system with windows 8 seems slow along with learning the new system which is designed for a tablet and not the laptopThe screen in sunlight was difficult to read.", "Date": "December 31, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00ABE3JFS"}}