{"Reviews": [{"Title": "Aspire S7 - Beautiful but not completely perfect.", "Author": "B. Hines \"bwebmasta\"", "ReviewID": "R2DRX5KTX34S71", "Overall": "4.0", "Content": "The Aspire S7 line has quite a few models with flavors of processors, screen size, and what not. One of the newer models is the 9427 iteration. I have used it for about 3 weeks now, and the S7 is a very well designed product, well thought out, and durable. The aluminum chassis is a things of beauty and durability, making the ultrabook lightweight as well, 2.8lbs. The bottom is a tough plastic or polycarbonate which is well designed and looks very good. The cooling vents were well thought out, the hot air is pushed out the back, so using the laptop on your lap is very comfortable with no heat buildup. The S7 9427 comes with network 10/100MB and HDMI to VGA dongles, along with a leather like carrying bag, and a Bluetooth mouse. These added goodies are very welcomed in this kit. There are some major plus sides to this Ultrabook, but a few flaws, such as life no thing of beauty is not without those. The bullet list to be concise:Pro's:Fast Processer i7 2.04GB RAM256GB SSDDolby sound, awesome speakers, great placement on the sidesHD 10 point touch screen, accurate and mind blowing resolution2.8lbs2 USB 3.0 portsHDMIGorilla GlassIlluminated KeyboardMiddle: Battery life has been around 4.5 hours with wifi on, on balanced mode do not believe anyone telling you the life is 6-7 hours. You will not see that with normal use and wifi on. One of the points for accessories, the Acer store has a second battery that screws in on the bottom which is flat, contoured, and has a battery life indicator on the side. It adds on about 3-4 hours, when used as reported on the Acer forums from people that have bought them, looks very nice it fit and form. I am purchasing one, price is $149.Con's:SD slot has the SD card sticking out, it does not click in. Not major, but should click in all the way.Fans get loud at times, but this can be adjusted by software settings. Make sure to have the latest BIOS update.Accupad, touchpad, (or whatever you want to call it) can be a little annoying with the clicks takes a little getting used to - however, no accupad has been flawless even MBA. The Elan software can be adjusted for the swipes, clicks, and gestures though.", "Date": "March 9, 2013"}, {"Title": "USB to Ethernet FLAW & \"Fishy\" Price Fixing", "Author": "chris_sf", "ReviewID": "R2AK33PT31YJLN", "Overall": "4.0", "Content": "Most people buying this computer are the type of people seeking the best of the best.  This computer meets those expectations in many ways so I will give it 4 stars DESPITE the appalling \"secret\" I am about to reveal:The USB to Ethernet \"goodie\" dongle included with this computer is USB 2.0 and not USB 3.0!!You might not think it would make much of a difference, but you would be wrong.  When I bought a USB 3.0 to Ethernet adapter (for approx. $30) my speed when wired went from 24 MBPS to 36+ MBPS.  In fact, no matter what time of day or night I use my computer now, the wired speed never falls below 36 MBPS  -- whereas before I felt thankful to get 24 MBPS (sometimes it would drop as low as 16 MBPS!).  So, a more than 50% difference in wired internet speed.What a deceiving trick!  To buy a top of the line computer, pay top dollar, and then be given a hand-me-down USB 2.0 chip set adapter for Ethernet as a supposed \"goodie\" when the computer itself is wired for USB 3.0.  To confirm it's a USB 2.0 adapter versus being a USB 3.0 adapter, go to your device manager while your included (and outdated) \"free\" Acer Ethernet adapter is plugged in.  That will tell you.Shame on you, ACER.UPDATE RE FISHY PRICING AS OF 4/1/13:I got this computer for $1,456 (the price at that time was fluctuating daily between that price and its current $1,539). So, I'm wondering if Square Trade and Amazon have some sort of deal going....because the moment the price drops below $1,500 the cost of the Square Trade warranty drops from $299 to $181 for the exact same coverage. Fishy, fishy price fixing. BUT -- THE COMPUTER OVERALL IS GREAT... even with its flaws. At this point in time, you literally can't find better.", "Date": "March 15, 2013"}, {"Title": "Battery Review", "Author": "steverey8", "ReviewID": "R3N82M5NZHHISK", "Overall": "5.0", "Content": "Although many have commented on the short battery life, I wanted to concentrate on the second battery sold by Acer.Acer does offer a second battery on the Acer store online for $150.  In my opinion, it is definitely worth the money.I did a few drain tests of the battery to see how long it lasted.  All testes were done in default power saving mode and playing a movie on repeat.Laptop itself with wifi on: 3 hours 45 minutesLaptop with second battery, wifi on: 7 hours 31 minutesLaptop with second battery, airplane mode on: 8 hours 21 minutesI do have photos available: https://sites.google.com/site/stevestechreview/home/acer-aspire-s7-391", "Date": "June 13, 2013"}, {"Title": "Nightmare! Paid top dollar for a 'top of line' laptop and have had nothing but problems.", "Author": "rick macneil", "ReviewID": "R25YPEUFHM1679", "Overall": "1.0", "Content": "First laptop received had line through the display.  This was immediately replaced through the Amazon warranty-thank you Amazon.  Of course had to be without the laptop during the shipping time.  After the first month, but within only the first few months of ownership, the laptop had to be returned because it was very loud.  The fan was replaced and the laptop was returned.  But I was without a laptop for a couple weeks for the repair process.  A few months later, the hard drive failed and I again returned the computer for repair.  I am now in my second week without a laptop AGAIN.  I have had to return the laptop 3 times in the first 7 months of ownership.When the laptop actually worked, I liked the design and the processing speed was good.  The keyboard was better on the first one (with the display problem) that I had for less than a week.  The keyboard and the touchpad mouse on the replacement computer has been extremely annoying.  The keys often don't respond and they often stick and type double.  The touch pad is erratic.The customer service from Acer has been mindless as they fail to recognize the importance of making a customer happy.  Obviously a customer should expect better when paying top dollar for a laptop.  But they stick to their script.  \"Your warranty provides for repair of the laptop in the first year.\"  Send it to repair center.  We will repair and return to you within 7-10 business days. Meanwhile, the customer who has spent $1,800 for a laptop continues to do without.Maybe some one at Acer will read this and do something to make it right?", "Date": "November 26, 2013"}, {"Title": "Just What I expected", "Author": "Guy Martin", "ReviewID": "R2FXIJ9YKGHH72", "Overall": "4.0", "Content": "The computer is very nice, but it would have been better with a minimum of 8GB of RAM.It works just fine. No problem so far with the WIFI as mentioned somewhere else", "Date": "August 20, 2013"}, {"Title": "Beautiful yet functional", "Author": "Jessica", "ReviewID": "R2GE1SL2KEH7G9", "Overall": "5.0", "Content": "I have been using the S7 for about 3 days now and love it! the touchscreen is fantastic with Win 8. The keyboard is a little shallow but you get used to it. No problem with the wi-fi like some have mentioned. The only thing I would have liked to see is longer battery life. Also I purchased the Targus USB 3.0 Dual Video Docking Station and it works great with the S7; super helpful with my dual monitors and other peripherals", "Date": "March 13, 2013"}, {"Title": "Great ultrabook", "Author": "Graham Bullard", "ReviewID": "R2GRRIO3HYPGQ7", "Overall": "5.0", "Content": "Pros: This is a great ultra portable rig. I got it from another website because I had a gift card and I'm so glad I did!1) It is fast and SO thin but feels sturdy in your hand.2) The screen is crisp and has great viewing angles and brightness. The touchscreen is a little gimmicky right now but if Windows 8 ever gets some good apps then maybe it'll make it more useful.3) The keyboard is awesome and easy and comfortable to type on.4) The SSD's in raid 0 are crazy fast.5) The sound from the speakers is much louder than I expected coming from the bottom of the machine but can get muddled if you're playing it on your lap on something soft like in bed.6) Wi-Fi problems have been fixed and runs very smooth.Cons: These cons are very small to me but there are a few:1) The trackpad is a little flaky as well as the gestures but the gestures work great on the touchscreen its self2) Fans can get a little loud in hotter environments but that's to be expected when you cram so much power into such a tiny frame3) Intel 4000 graphics aren't great but you're not buying this as a desktop replacementOther Thoughts: It can run games like WoW and Diablo 3 on medium at 1080 but that's now what you buy this for so that's just a bonus. If you're looking for one of (if not the) thinnest and lightest computers that can actually do work then you've found it.", "Date": "April 2, 2013"}, {"Title": "IPad Substitute", "Author": "HDGuy", "ReviewID": "R29R60UUEULJMA", "Overall": "5.0", "Content": "This laptop is fast and responsive. It is so light and thin that I find myself reaching for it rather than my IPad.  The touchscreen is extremely responsive and really a necessity to appreciate Windows 8.  My only complaint is that the keys are difficult to read, especially in poor light  There is insufficient contrast between the light green backlighting and the silver keys, and the backlighting itself is inadequate.  This is a minor point, however, in what otherwise has been a great computer experience.", "Date": "April 13, 2013"}, {"Title": "Love it!", "Author": "John D. Livingston", "ReviewID": "R2DL2SW8KQJUVH", "Overall": "5.0", "Content": "Light weight, compact, super fast. Couldn't be better unless, of course, it had Windows 7 instead of 8. A mouse was included, which I did not expect.", "Date": "December 31, 2013"}, {"Title": "Our second one works better than the first.", "Author": "P. N. Payne", "ReviewID": "R2JNYYUD6VSQXK", "Overall": "5.0", "Content": "I bought one from Costco for myself, and one through Amazon (for less money) for my wife.  The Costco return policy is fantastic, but they stopped carrying this model.  The Amazon return policy for computers is non-existent now.  Mine has the same keyboard problem and needs to go back to Acer (a 2 or 3 week process).  Sometimes I get no characters and other times I get double characters when typing, just as others have reported.  My wife's works great.  I am not a fan of Windows 8, but I am a fan of the Acer S7.  I can unplug mine from my big screen, power, and usb hub in a couple seconds.  Close the lid to hibernate, put in a thin bag, and off I go.  Re-connecting takes a few seconds longer.  This is the thinnest, fastest laptop I have had.  With the solid state drive, it can be used in motion without hard drive head crash worries.  Ie: in a moving car, motor home, small boat, plane, etc.  I take mine almost everywhere I go, including some very bumpy roads.  The 1080 resolution on the small screen can be hard to read, so I use a 28\" monitor set to 1080 at my main desk.  I usually have a couple or several open windows open at a time.Yes, I can sometimes hear the fan.  But it is not all that loud.  Yes the battery could be bigger and last longer, but I carry a portable charger and use it when I need to.  I really like it because it is so portable.  Great computer & highly recommended.  $1100 or $1200 for this computer?  A bargain.  May be we have been lucky that our only problem is the one keyboard.  If I had as many problems as some, then I would be angry too.", "Date": "December 25, 2013"}, {"Title": "Very disappointing performance...", "Author": "Narisi \"Narisi\"", "ReviewID": "RUV6ILB9UVW57", "Overall": "2.0", "Content": "I have been using since March 2013.Following are the key issues:1. Very poor/slow wifi connectivity.  Connection drops frequently. Other laptops at home connect way better than this.2. Keyboard gets stuck. Either it types twice or doesn't at all.  Typing passwords is a nightmare.3. Cannot run more than two office applications for more than 10min.  If Adobe pdf reader is opened, it pretty hangs and kills some other running apps.Keyboard is really stressfuul and bothersome. I wish I had returned it on time.Thanks!Narisi", "Date": "December 4, 2013"}, {"Title": "Serious bugs; too much pain", "Author": "K. Srinivasan \"Krishnamurthy Srinivasan\"", "ReviewID": "R2RXGGAPD02OSC", "Overall": "1.0", "Content": "I got this system in May 2013.  I was really impressed with its light weight and sleek appearance.  However, in August, the display went totally off -- restarting the machine, draining the battery, etc., did not help and I had to send the system for fixing it.  I got it back in about 10 days (can't complain about it considering it was ground shipping both ways).  Now, I have run into \"No bootable device\" problem.  Resetting the BIOS did not help.  The laptop has gone back to Acer!This laptop has hardly ever left the table on which we keep it while using it.  Hence, it cannot be anything we have done.  May be I just got unlucky?If the laptop is fixed for good and continues to work fine for a few months, I will update my review and may be change my rating.  Right now I am just frustrated by not having the laptop for such frequent and long periods.", "Date": "October 25, 2013"}, {"Title": "after couple of months started to randomly shut down", "Author": "Jose Federico Ugarte", "ReviewID": "R1LZVGX091H78D", "Overall": "1.0", "Content": "nice ultrabook but started to randomly shut down while running on battery. After checking webs and forums, seems that the middle rear screw becomes loose, and triggers a safety battery precaution. UNBELIEVABLE[...]", "Date": "October 4, 2013"}, {"Title": "Nice Laptop", "Author": "Eduardo Esaine", "ReviewID": "R2OLQFMDZ2ATCO", "Overall": "5.0", "Content": "For me is an exellent laptop, only the english keyboard is kind of confusing sometimes in some simbols, but i like it!", "Date": "July 22, 2013"}, {"Title": "SSD died and it is not a garranty issue", "Author": "Tatiana", "ReviewID": "R23BDQ43ZDZ1PE", "Overall": "2.0", "Content": "The \"International Travelers Warranty\" was not filled in by the seller. SO I can not use it outside the USA.And after 2.5 weeks the machine couldn't find the boot drive. As a result of improper filled in garranty I can not repair it.However,first two weeks the notebook was great, exactly as I expected, light, fast and very handy.", "Date": "June 6, 2013"}, {"Title": "Nice Ultrathin", "Author": "Nestor Ivo Ochoa \"Nestor\"", "ReviewID": "R2PE22CV7R8KJ0", "Overall": "4.0", "Content": "Nice performance and look. No problems with the WiFi. Excelent size and weightThe only issue to improve from Acer is the keyboard sensibility and backlight.", "Date": "May 27, 2013"}, {"Title": "The hardware is not robust and the Operating System has many issues", "Author": "Atrina Mehdipour", "ReviewID": "R252XB1TILCLEG", "Overall": "1.0", "Content": "Myhard drive died after 5 weeks and now the laptop does not boot up. Acer does not have a support center in each state, you have to call the Support number in India and then send the product at your cost to their center in Austin Texas for repair. This by all means is the worst quality laptop I have ever purchased. While the design is good there are too many 'advertising induced' gadgets loaded as part of an OS which already has many security issues.The hardware design is great, the quality extremely poor and the support horrible. Do not purchase this product and look at other brands. $1700.00 all in in addition to Office Tools, 5 weeks of transfering and loading all the applications from WIndows 7 to Windows 8 with hardware failure. What a disaster!", "Date": "July 2, 2013"}, {"Title": "Great Ultrabook- Glass is nice but Cleaning it all the time", "Author": "michael Orlinski", "ReviewID": "R1CYBU5MWSUFQL", "Overall": "4.0", "Content": "This is a great little ultrabook. Works well as a out of office working laptop. My only chief complaint is that the amazing looking glass does get dirty often, but Acer nicely provides microfiber cloth and fleece lined case to help with that. The machine feels very solid even when using the touchscreen.", "Date": "April 9, 2013"}, {"Title": "Acer S7", "Author": "Brigadier \"RussDiehl\"", "ReviewID": "R2JMZV9SOG79W7", "Overall": "5.0", "Content": "Nice unit.... but Windows 8 is a huge pain in the behind.The unit does NOT come with WORD, OUTLOOK, EXCEL,`or POWERPOINT. Add $180 if you need these.i7 chip Acer S7 is super thin, super light, super fast....it is about as portable as a full computer can be..... I like it better than a tablet. While a bit bigger, it is a complete machine....Everything I need is in it or can be put in it.Not cheap,....but a five year hold is probable.And it looks like it will last even longer.Russell", "Date": "June 26, 2013"}, {"Title": "The best of both worlds", "Author": "Eclectic Reader", "ReviewID": "RI6UBWA2O5F87", "Overall": "5.0", "Content": "I just got my Acer Aspire touchscreen ultrabook this week and LOVE it.  It was easy to set up with my Windows Office software and other software, the touch screen was easy to configure, and I feel like I have the best of the iPad world and traditional PC world in one very light weight machine.  So far, all my peripherals work smoothly with this laptop (2 printers, external hard drive, external DVD drive, docking station, and monitor.  It looks nice and sleek too.  The only minor complaint is that the keyboard has such a low profile that I'm hitting the keys harder than needed, so my emails contain double letters by accident.", "Date": "June 15, 2013"}, {"Title": "Not too happy with this machine", "Author": "James E. Forrest", "ReviewID": "R39RF7EJWXZGCL", "Overall": "1.0", "Content": "I purchased this laptop because I previously purchased an Acer S3 for my wife and it was great.  I am more of a power user, so I bought this computer even though I know nothing about windows 8.  I have had many Dell notebooks over the years, so this was also an experiment.I like this machine.  it is very fast, the fan is not a big deal (dell fans are also noisy), and the transition between apps and the windows 7 desktop is seamless.  I love the size and weight, and have no problems with wife connectivity.UPDATE JULY 2013:  I have been using this produuct for the past few months, and as you can just notice, I have  doouble impressions from the crapp keyboard and missed keys (see the past sentence; I am a good typist and all the errors come from the keyboard).  i sent the machine in for a keyboad replacement and look how poorly it still peforms.  Note the missing r's in what I typed.  terribly inconsistent, and bad tactile feedback.  I will try again to get it fixed but the keybord in my wife's S3 is far superrior to this piece of crap.  The mouse pad also has a mind of its own, and will requentlly take me places without having been touched.I cannot recommend this computer at all, stay away because of the keboard.  (Note: i like the operating system and the speed, but like a car, if you hav a good motor andd good bakes but bad handdling, what good is it?????)", "Date": "April 10, 2013"}, {"Title": "Way too expensive and has some flaws.", "Author": "Jagga", "ReviewID": "R2QGXYWV5Z8SCY", "Overall": "2.0", "Content": "two things I wished that worked better on this thing. One is the mouse pad and the other thing is to have the flexibility of having the screen flip 180 degree and be able to sit on top of the keyboard with the screen up.", "Date": "December 5, 2013"}, {"Title": "good", "Author": "alvan", "ReviewID": "R24KMQ6F2BZDO1", "Overall": "5.0", "Content": "Acer  Aspire S7  is  beautiful  and  fashion,  and the price is not very expensive, but my wife love it  very much.", "Date": "November 8, 2013"}, {"Title": "Worth the money", "Author": "Delroy A Warmington", "ReviewID": "R2WMN10OPPHPGN", "Overall": "4.0", "Content": "Bought it for my wife. She loves it. Space bar is sensitive.  Skips to spaces sometimes. Otherwise, very good UltraBook.", "Date": "August 30, 2013"}, {"Title": "Very good computer.", "Author": "Lynne M. Howard", "ReviewID": "R1SO35DFEZ54ZD", "Overall": "5.0", "Content": "This is a great computer in every way. Love it only complaint is that the fans are very loud, but they do get the job done.", "Date": "March 7, 2013"}, {"Title": "After 3 weeks the hard drive died", "Author": "Laurence P Dodge", "ReviewID": "R34Z0HS5B2DWLH", "Overall": "1.0", "Content": "Cant really say much good other than it looks nice and is very light -- I was getting use to Windows 8, but then the machine died.  After two weeks of trying to transfer info and applications, the machine woke up this morning and couldn't find the boot drive.  Oh, Acer says they will repair it, but of course all my data is lost...so, so far, a piece of crap!", "Date": "May 31, 2013"}, {"Title": "fan is very loud and crashes after opening a few IE sessions and MS word", "Author": "H. L.", "ReviewID": "R1I99VBD8AF07H", "Overall": "1.0", "Content": "Thought that this was the right computer for my daughter as the reviews were good, its weight was light, and it was top of the line configuration when i boought it in May, 2013 for my daughter. My daughter just started to use it for her school work about a month ago. She often opens 4 to 8 IE sessions and uses MS Word. This computer has 4 GB memory in it but it shows low memory warning from time to time. After a while it crashes. My daughter hates it and asks me for another one. I hope there may be a fix on it...Besides the low memory to crash issues, this laptop's fan is noticeably laud, the laudest of 7 laptops since we started using laptops 12 years ago.I thought it would be as stable as Mac Air as it was more expensive. But its quality was not comparable. It I rate it from 0 to 10, 10 is the highest score, i can only give it 2 while i would rate 10 for Mac Air.", "Date": "September 30, 2013"}, {"Title": "love love love", "Author": "Reckell Small", "ReviewID": "ROO9ZVFXGOR2O", "Overall": "5.0", "Content": "I added this laptop to my cart sometime before I purchase it and never regretted but decision to purchase it. I am so impress with it.  The speed at which it moves, the lightness etc.  I can't say a negative about this product.  The packaging was unique and worked well for shipping.", "Date": "July 15, 2013"}, {"Title": "Why I happily re-sold this laptop for 2/3 of its original price", "Author": "Lysle Shaw-mcminn", "ReviewID": "R3VEWXGE8TWMJ5", "Overall": "1.0", "Content": "This laptop looks gorgeous.  Do not trust it or Acer.It only looks good on paper.  When you take it home you find its fan is insanely loud, battery is terrible, keyboard is horrendous, mouse is barely functional, webcam is absolute s***, bluetooth mouse constantly goes in and out of service.All these little things you didnt think to check.  You already bought the laptop, too late.  You think you will 'get used to' the keyboard and mouse but you never will.  The fact is, you can press down on the keys as hard as you can, but if your fingers do not sit in the center of the key then they will not register as pressed.  This is especially true for the ridiculously small arrow keys.", "Date": "March 25, 2013"}, {"Title": "Beautiful, but going back", "Author": "Sydney's Mom \"7923\"", "ReviewID": "R3IH4Z10WKUPQZ", "Overall": "1.0", "Content": "I loved this computer for a couple weeks.  Worked great, and it looks great.  But starting the other day, it drops the internet every 10 minutes.  I might have even kept it, because it is so pretty, but I use it for work, and this reset every 10 means I have to log out and log back in to my work computer.  I've tried updating the driver, changing power settings, even browsers!  Nothing helps.But I loved it while it worked.  Windows 8 seems to have gotten a bad rap-I love it!  So whatever my next computer is, it will have windows 8.", "Date": "April 2, 2013"}, {"Title": "Close,  but no cigar", "Author": "DJ", "ReviewID": "R3OXBFNEEAVUWI", "Overall": "1.0", "Content": "This super sexy,  thin ultrabook falls short of the mark.  There are Wi-Fi connectivity issues ( randomly disconnects from your router,  known issue)  even after  diligent updating.  Touch screen is awesome,  but only in  Windows 8 Metro mode.  I was also surprised with how long I waited for programs to load.  Seemed to lag quite a bit.  I suspect it is an issue with drivers,  but this laptop has been on the market for quite awhile.  I was frustrated on so many levels. ( I'm sure that Windows 8  with its  non-intuitive  dual shell is a major source of my irritation. No Start menu button?!!  What were they thinking?) At this price point I absolutely can NOT  recommend.", "Date": "March 23, 2013"}], "ProductInfo": {"Price": "$1,549.99", "Features": "Intel Core i7-3537U 2.0 GHz (4 MB Cache)\n4 GB DDR3 RAM\n256 GB Solid-State Drive\n13.3-Inch Touch Screen, Intel HD Graphics 4000\nWindows 8, 6-hour battery life", "Name": "Acer Aspire S7-391-9427 13.3-Inch Touchscreen Ultrabook (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41CNJpVkJcL._SY300_.jpg", "ProductID": "B00AVYPLPY"}}