{"Reviews": [{"Title": "Great little notebook", "Author": "Andy Do", "ReviewID": "R3I3RJQ8O4UODA", "Overall": "5.0", "Content": "I actually got this at staples with a coupon for $100 off the sales price.This notebook looks amazing! The top cover and inside frame are aluminum with the exception of the bottom being a smooth-rubberdized finished. The one that I got (black) have a very subtle brown appearance when coming in contact with bright light. The 11.6\" screen have a very glossy finish which makes it very fingerprint prone. Trying to find a screen protector for the s200e is a little tricky, as Asus doesn't have a Buy option on their website (it's there but you can't buy it). Other sellers carry a wide variety of 11.6\" screen protector, however I'm looking for one that covers the frame along with a hole for the camera. I came across a company called Kai (from HK)and ordered it to see if it will fit or not (order hasn't come in yet).I'm not an advance computer person but I do appreciate the 3rd gen intel processor that came with this notebook. The speed is fast, from the time that I turn it on to the time I shut it down. It loads quickly and perform on the same level if not a little faster than the average notebook. I've ordered a crucial m4 128GB ssd to replace the seagate 500gb hdd. Windows 8 runs great with the touchscreen. Scrolling and zooming through websites, apps, news, is effortless easy and fun! Battery life is phenomenal, I get around 4-5 hours before I have to find the charger and plug it in. However, replacing the battery will be a difficult task as it is internal. With networking, I do noticed that the wifi wasn't that great compared to my other dell notebooks. I don't know if it is the wifi chip or windows 8 that I can't connect to one of my main school's network (I had to use the \"guest\"). Typing on this thing is rather a challenge. It's not that the keyboard is small, but rather the sleekness of the keys itself. They are slippery and my fingers tend to slide pass the keys that I'm aiming for.Overall, I would recommend getting this notebook if you're looking for a small ultrabook notebook that has touchscreen capability and good overall performance.For me:Pros:+ touchscreen+ lightweight+ very high quality build+ good processor+ sleek and very attractive+ HDMI, 1x USB 3.0+ battery life (~5 hours)Cons:- wifi signal/chip?- screen/display is too glossy- slippery keys", "Date": "February 2, 2013"}, {"Title": "solid laptop with few flaws", "Author": "glo \"glo\"", "ReviewID": "R2UQ4501CBXUEK", "Overall": "4.0", "Content": "As other reviewers have said this is a great laptop that doesn't skim on the quality for a budget pricetag. I also purchased this computer with a coupon from Staples for $425 +tax.  It weighs as light as a netbook but with a sleek metal casing. There is a learning curve to Windows 8, and it's quite frustrating.  I have had this laptop for a week, and several times my keyboard both touchscreen and physical froze up occasionally.  At times, while typing my cursor jumped a few lines down.  I assumed this was a driver issue, so uninstalled SmartGesture touchpad application and reinstalled the touchpad driver from the ASUS website and everything is resolved so far.  I doubt this is a hardware issue so I blame Window 8 for now.  The touchscreen is extremely responsive however one must understand the full capability of Windows 8 to utilize it well.  It can be tedious to move from the home apps screen to the classic Windows screen.  Once I started getting to used to the gestures of the touchpad and the touchscreen I love the versatility although more complex than previous versions of windows.  The screen resolution is adequate and bright enough for my viewing purposes (watching DVDs, browsing, word processing, no gaming).  Also, this Asus comes with a DVD-RW external drive with a slot to store it's own USB cord, albeit one that is extremely short.  Reviewers have complained about the fan being loud. The fan isn't loud but a persistent low hum runs in the background.  I have heard of people customizing and switching the HDD to a SSD which may resolve the humming but I am by no means a computer expert. The battery is internal so you cannot upgrade the battery but battery life will get you 4 or so hours with browsing and checking e-mails.  I would say if you are looking for a second laptop for traveling, or a light user who doesn't game this is a great laptop for you.", "Date": "February 24, 2013"}, {"Title": "Best of the Best", "Author": "ScottP38", "ReviewID": "R3OTLKFW4RGAN1", "Overall": "5.0", "Content": "I just got my Asus Touchscreen laptop today.  I didn't even know they had touchscreen laptops until I saw this one at Office Depot.  I have to say I love it!!  I needed a smaller laptop to take with me for work.  The netbooks were TOO small and the other ones were too large.  Like the three little bears.  HA!  Anyway, this one is just right.It measures EXACTLY 12 inches from the OUTER edges.  Although it's very slim in design, it's a tad heavier than you think it would be.  The brushed aluminum has a bronze look to it that I really like.  It's made extremely well.  No issues there.  The only thing is the battery life.  You COULD get 5 hours if you were just doing word processing.  Playing (I mean) doing work on the internet and other light applications drops it down to 3 1/2 to 4 hours.  My advice would be to buy an external battery pack like the Lenmar PowerPort External battery and charger.  That will add an extra 4 hours!!Windows 8 is okay.  I'm getting use to it now and the touchscreen is so much fun!!  The only thing I don't like is that it keeps asking you to setup a Microsoft online account to 'personalize' your computer.  Just another information scam in my humble opinion.  Also, the screen itself is sort of small, but it's better than a netbook.This model is the one in-between the Q200E and the X202E.  Don't get the Q200E!!! That one has a slower processor.  This model, the S200E is the middle version with the faster processor.  The only thing it doesn't have is blue-tooth which I don't really use anyway and the last model, the VIVO X202E apparently has some issues with the hard-drive even though that one has blue tooth.  I posted some pictures for everyone.  I hope my review is helpful. :PUPDATE:  Not that this is specific for everyone, but the Adobe Reader in Windows 8 with the READ ALOUD function actually sounds like A REAL PERSON!!  That's a big deal to me because I use mine for writing. :)", "Date": "February 16, 2013"}, {"Title": "ASUS S200E Tweak Guide", "Author": "Robert Salita \"Software Developer\"", "ReviewID": "R201LR8AJFAI5Y", "Overall": "5.0", "Content": "Update 26-Jun-2013: Hurray! The touchpad issues have been normalized with a driver update from ASUS. I downloaded and installed SmartGesture_Win7_8_VER201 from ASUS website. It fixes the issues with the touchpad. However, I still prefer turning off all features in ASUS Smart Gesture except for single touch \"Select\" and \"Activate\". Also, I prefer, in Control Panel->Mouse->Pointer Options, select \"Fast\" in pointer speed and check \"Enhanced pointer precision\". These have been a major improvement so I've raised my rating to a full 5 stars.Update 18-Mar-2013: Wanted to specifically mention that battery endurance is impressive for my usage. I can get up to four hours of web surfing if I needed it. I find that I'm more productive with this computer because the processor and SSD (user upgrade) are quite fast. My morning web surfing episodes are noticeably shorter.Update 15-Mar-2013: I improved the touchpad by installing ASUS touchpad driver from their website and customizing features. The current driver is named SmartGesture_ASUS_Win7_8_VER1036.zip. Once installed, double click the ASUS SmartGesture icon in the taskbar (usually bottom-right on desktop). My preference, YMMV, was to uncheck all features except Select and Activate. I still don't like the touchpad but now it's more predictable. I also changed Control Panel->Mouse->Pointer Options->select-a-pointer-speed a couple notches faster.The ASUS X202e (ASUS S200e) is an excellent value despite its flaws. Here's some tweaks to share. Some require hacker-level experience. I use the X202e mainly for web surfing. Your tweaks may vary with use case.1. Replace the hard drive with an SSD for much faster speed. The processor is quite fast for web surfing but you'll really appreciate the added speed of an SSD. I only need a 60GB+ SSD for my usage. Be sure the SSD is a 7mm height drive such as a Samsung 840.2. I hate bloatware. I reinstalled Windows 8 from a generic 64-bit Windows 8 DVD. No activation key was needed. The only driver I needed beyond what Windows 8 installed was the audio drivers for the microphone. I downloaded from ASUS support web page. I installed using a generic USB DVD drive.3. The default screen settings make the display a bit washed out looking. To fix, right click on the desktop->Graphics Properties->Display->Color Enhancements. Change Brightness to -20, Contrast to 51 and Gamma to 0.9.4. I use Ninite.com to quickly install many often used programs.5. I swear the touchpad has been improved by an initial cleaning. I used window cleaner.6. I haven't found a better touchpad driver than the stock Windows 8 driver. I'm open to alternate drivers. Please make recommendations in comments but please, document any non-standard settings.7. I reset the BIOS to defaults and then chose \"Optimal Settings\". Don't assume the manufacturer installed with optimal settings selected.8. I love Windows 8 but only when with the Windows 7 shell, so I installed EX7FORW8 software. Recommended. Touch continues to work.With these tweaks, you'll get a much better X202E experience. I'm hoping a new driver will improve the too touchy touchpad. Yes, the screen could be a bit better but it's acceptable. Battery life is ample with my usage. I get about 4 hours web surfing -- more than expected and more than needed for my usage.", "Date": "March 18, 2013"}, {"Title": "Makes the trackpad all jumpy", "Author": "Tommy Koo", "ReviewID": "R1ZZHP46X1PSEY", "Overall": "3.0", "Content": "I purchased this as a backup for my Asus X202E and like the title says, when my laptop is plugged into this adapter I essentially can't use the trackpad because it makes the cursor jump all over the place. For $15 though, I'm not complaining because I can still use the touchscreen perfectly fine and if I ever really need to use the trackpad I can just unplug the laptop for that length of time. And I don't have the problem of the plug being loose and falling out of the laptop; the one I got has a firm little snap when you plug it in and it stays in well. For the price it does what I need and I can live without the trackpad as it is only a backup adapter. 3 stars, but would be 5 if they resolved the trackpad issue.", "Date": "August 15, 2013"}, {"Title": "Great W8 Touch Screen Notebook", "Author": "R. Thompson", "ReviewID": "R1QCHV8BMIO2D2", "Overall": "5.0", "Content": "Maybe we should call it a \"LapBook\".  My 17\" laptop runs an i7 first generation processor but I have to say, the i3 third gen. is a pretty fast unit.  I run everything on the 11\" ASUS, except Photoshop CS5...for obvious reasons, that I run on the i7, 17 inch laptop.  A partial list, Office 2010, QuickBooks Pro, Sky 6, a Professional Astronomy program, Acronis, McAfee, Skype and others.Both Laptops are networked together, (wireless), so I share data between the two and this allows me to work on anything by sharing files.  I could use \"the cloud\" but this is OK as I just update both PC's when I save a new or updated file.A \"touch pen\" works very well on this screen.  This eliminates the fingerprint smudges and when typing, I use the pen or keyboard as I have big fingers.  I wish the lettering on the keyboard was brighter.  When typing in my recliner, I angle the unit in my lap in a 90 degree \"V\" and this gives a great view of the screen but the keys aren't as visible and I need to tip it back down to type. (not really a complaint)  I suppose I could use two pens and type on-screen.In January I updated from W7 to Windows 8 Pro + Media Center on my 17\" and Windows 8 (NOT RT) came on the ASUS.  When I switch between the two, I find I'm always reaching for the BIG screen to do \"stuff\".  W8 took getting used to but it is designed for a touch screen and it really shines on the ASUS.  There's not a significant difference between the two as far as performance, (what's a few seconds) but I enjoy the ASUS for the touch screen.  Using the BIG mouse on the 17\" is becoming a pain.  Tapping with the pen is a snap!  If I didn't need the larger screen to render images with PS-CS5, I'd probably just use the ASUS!  I'm sure it will run PS but the screen is just too small for image processing. (This wasn't the plan) I could connect this to a monitor but...maybe when the 17\" dies.The DVD-RW \"outrigger\" is a great inclusion with the ASUS.  This allows for a smaller Unit and it isn't used except for running my Acronis backups.  I have a 500GB USB3 external HDD I save the backups to.  I boot with the DVD-RW and save on the USB 3 HDD.  You will need to change the BIOS to boot from the DVD-RW. (very easy)  There are two USB-2 and one USB-3 port.  Almost forgot the SD Card slot.  No slots or jacks in the front or back, everything is accessible on the sides.I would like to add a 128 GB SSD to this unit and be able to change batteries BUT to open the box voids the warrantee.  I'll wait a year and see how it holds out before I jump in. This is a great unit as it performs well for all I need it to do and battery life has been OK, even when giving presentations with Power Point.  I haven't used it with Sky 6 and the telescope but will wait for better (warmer) weather to play outdoors.The ASUS is about a month old now but it \"feels\" like an old friend.  Much easier to transport for presentations and it comes with full size connectors for video and HDMI so you don't need the \"micro\" connectors on this unit.  I was in the market for an iPad but I'm glad I found this.  Most of the Apps are shut down to improve boot time and I only use two or three of them, when I have the time.  I recommend this \"little\" unit to anyone looking for a good touch screen for productivity and fun!", "Date": "February 22, 2013"}, {"Title": "A great Windows 8 Laptop with Touchscreen", "Author": "H. Birenbaum", "ReviewID": "RNE2GYF1IZBL8", "Overall": "5.0", "Content": "I purchased this primarily to become familiar with Windows 8.  The price was right, and the PC included a touchscreen, a 500 GB HDD (slow at 5400 RPM) and a 3rd generation Intel Core i3 processor. Includes an external DVD drive/burner. Relatively light weight, average battery life, would have preferred with an SSD drive.I had some initial issues where the touch screen froze (although the mouse cursor would work), but flashing the BIOS to version 205 seems to have solved that issue.Well built!  Fairly speedy, good quality screen, responsive touch.  Excellent mouse pad (just as good as in their Ultrabook series).  Only issues I have is that you cannot remove/replace the battery without opening up the back.  Same with regard to the HDD.I would have preferred a Core i5, but that is available in the 14 inch model (which is larger, heavier, has a built in DVD drive) and I wanted the 11.6 inch screen.A real PC, a great alternative to a tablet, and much more cost effective than a Macbook Air, though heavier.I'm also impressed with Windows 8.", "Date": "March 11, 2013"}, {"Title": "Great little laptop!", "Author": "Riddller", "ReviewID": "R1HTK8GNM2LO7P", "Overall": "5.0", "Content": "I got this laptop from Costco about 9 months ago.  I needed something small/lightweight because I travel a lot, and this thing has been great!  Obviously it's Windows 8, which I upgraded to 8.1 with no issues.  You can read other reviews for the OS, I'm just talking about the hardware.  I've had no problems with any part of the laptop.  It boots up fast every time (my biggest like!), I use MS Word, Excel, and Powerpoint extensively with no issues, and all the other programs I've used/downloaded have worked great.  I've even used it for video rendering (converting DVDs to .avi format for easier storage) and it was almost twice as fast as my 3 year-old desktop computer.  When I'm not working on it, I use it a lot for watching movies from both the hard drive and via streaming (Netflix mostly) and the picture/audio is wonderful.  Occasionally I wish it had built in bluetooth, but if I really want that I can get a USB dongle for cheap somewhere.  I'm not a big gamer, so I couldn't tell you how it works in that regard, but for a simple laptop I can use on a daily basis I've been extremely happy and have no regrets buying it.", "Date": "February 23, 2014"}, {"Title": "Great laptop purchase", "Author": "NB22", "ReviewID": "R3HQ958VANJW4J", "Overall": "4.0", "Content": "I bought this laptop for my husband so that he could have a toy to play with. He is enjoying it immensely. He is able to connect it to our TV and watch Netflix and he recently downloaded a fun music mix program that allows him to use the touch screen to \"scratch\" as a DJ. I reviewed a lot of laptops for days and am very satisfied with my purchase.", "Date": "June 5, 2013"}, {"Title": "Love it!", "Author": "Slade Grayson", "ReviewID": "RA7BPD0R8CRN6", "Overall": "5.0", "Content": "It's everything I wanted in a notebook computer: fast, lots of memory, light and easy to carry... It's better than the HP laptop I had (which, for some reason, always ran hot). There's a small learning curve with this one, but really, for the price, you can't go wrong.", "Date": "April 5, 2013"}, {"Title": "Asus Vivobook x202e spare charger", "Author": "Stef Lombard \"propofol\"", "ReviewID": "RMQIAFDPBIG4J", "Overall": "5.0", "Content": "Small, compact and works very well. I bought a spare charger elsewhere previously and it must have been poorly filtered since I had a jittery touch-pad. I did not have any similar problems with this & it is much cheaper than the official Asus charger.", "Date": "June 22, 2013"}, {"Title": "Great Touch Screen Laptop", "Author": "Manny Fernandez", "ReviewID": "R2PFTPQ9R4YHFK", "Overall": "5.0", "Content": "This computer met all my expectations and exceeded some.  Being used to a quad core PC I was concerned that a dual-core laptop with on-board video would be sluggishly disappointing.  That is not the case with the Asus S200E.  It runs all my Windows programs seamlessly and smoothly.  Please note, I am not a gamer and don't edit video or large music files.  I use my laptop primarily for net surfing, email, word processing, and spreadsheets.  I Skype on it while traveling.  It replaced a 15\" laptop and it is now my sole travel companion.  Great machine, with great features at a great price.", "Date": "April 11, 2013"}, {"Title": "Great ultra-portable", "Author": "Pete \"pohlipit\"", "ReviewID": "R3QPMHPDG5WEPF", "Overall": "4.0", "Content": "This is a great ultra-portable.Pro's:- portability- keyboard- touchscreen- build quality- sexy lookCon's:- screen glare- battery life (I am getting 4 hours max)Overall I can highly recommend it", "Date": "March 9, 2013"}, {"Title": "Speedy, functional touchscreen Win8 Laptop", "Author": "J. Onsager \"JONsager\"", "ReviewID": "R3OP8XTTM8MW88", "Overall": "5.0", "Content": "I also bought this laptop at Staples for $399 with a $100 coupon.  Win8 has great potential but is still rough around the edges with Microsoft making some changes for change's sake.  Sometimes, conventional desktop is buggy about touchscreen and confusing w/r/t HP printer driver for print options using WiFi networked CM1322nfi printer.", "Date": "February 8, 2013"}, {"Title": "Seller pointed problem before I noticed it", "Author": "Silicon Valley Chicken Farmer", "ReviewID": "R1L8MDKTCU4R13", "Overall": "5.0", "Content": "I ordered this power supply to leave with my travel items as I have twice left on a trip without my power supply (would you believe in Peru they wanted to charge me $250 for a power supply at Radio Shack?). So I hadn't used it when I got an email from the seller saying there might be a problem with it fitting properly. It tried it and sure enough it was not working. I sent an email confirming the problem and within a few days had the proper pin to fix the problem. So happy that I didn't discover there was a problem when I was away from home.Update - I am extremely pleased with the customer service here. The item broke - they sent me a link to print out a label to return it free of cost and the very next day I receieved the replacement. I am not even sure how it was possible for them to receive my old power supply and get the new one to me so fast.", "Date": "July 26, 2013"}, {"Title": "Left powerless in Hawaii", "Author": "K. McCollum", "ReviewID": "R3TGI58JVQX7UB", "Overall": "5.0", "Content": "I had been looking for a travel power cord for my Asus laptop but it has a tiny connection so I was having no luck.  I went to Hawaii on business and left my regular one at home. I contacted an Amazon seller and ordered one and got it the next day. The power cord is great and got me back to business again! Now I have my travel cord packed and won't be powerless again!", "Date": "May 30, 2014"}, {"Title": "very Good Compact Charger", "Author": "Antonio Cervantes", "ReviewID": "R377F8L8A36HFA", "Overall": "5.0", "Content": "small brick and decent length cable, wish it was a 2 prong plug in rather than a 3 prong plug in though.", "Date": "May 20, 2014"}, {"Title": "Great secondary computer", "Author": "Nicholas Samosir", "ReviewID": "R168MVLKQUUFVB", "Overall": "5.0", "Content": "Purchased as a take-a-long computer for work or play.  It is pretty reliable and very portable.  Dont expect to play video games on it, but great for watching streaming movies, and facebook type stuff.", "Date": "May 15, 2014"}, {"Title": "Works Perfectly!", "Author": "John Wilkinson", "ReviewID": "R3DAW8SJ7H9EQ0", "Overall": "5.0", "Content": "The power supply instantly brought me back to functionality with my Asus touchscreen.  I left the original power supply on an Airplane and was very pleased to find this well priced replacement.", "Date": "April 30, 2014"}, {"Title": "Solid laptop with caveats.", "Author": "Steve", "ReviewID": "R20FX03FNKKBM2", "Overall": "4.0", "Content": "Good snappy laptop for the price.  It seems like it sat in a warehouse for a while because the battery was dead on arrival and it took the better part of a day to get it patched up.  Once it was patched and charged it ran quite well.  Battery life is a bit underwhelming but its what I expected.  Came with a external dvd/w drive that came in handy to install office.", "Date": "April 17, 2014"}, {"Title": "Nice.", "Author": "David V Clements", "ReviewID": "R3IZINVGL8ASOQ", "Overall": "5.0", "Content": "For the price, the build quality is great, has decent battery life, windows 8 is kind of a bummer though.", "Date": "March 19, 2014"}, {"Title": "Very good product and FAST shipping", "Author": "Murtaza Siddiqui", "ReviewID": "R4KHO0SA2TCAF", "Overall": "5.0", "Content": "This Charger is very good and it does the job perfectly. Its nice and compact and charges quickly as an OEM charger would do. I also was very pleased with how fast the item shipped out.", "Date": "December 20, 2013"}, {"Title": "Great computer.", "Author": "Nicholas Gordon", "ReviewID": "R3KDEKB9C1HFHM", "Overall": "5.0", "Content": "This is a fast, compact, light, excellent computer. Unfortunately, the Windows 8 OS is not great, but that's not the computer's fault.", "Date": "November 22, 2013"}, {"Title": "Superb Notebook", "Author": "Crisanto Mendoza", "ReviewID": "R1E69FIUSYVUOC", "Overall": "5.0", "Content": "Excellent performance of the notebook...waiting for the next upgrade of windows 8 to have the start button. All in all functionality exceed my expectation.", "Date": "September 21, 2013"}, {"Title": "Good product for Asus x202e owners.", "Author": "Hano", "ReviewID": "R384AP1UZ80MEO", "Overall": "4.0", "Content": "Works great on Asus x202e other than the jittery mouse issue, not a big deal if you are like me and don't use the trackpad.  Not as portable as the oem charger but more portable than typical laptop chargers.  It is of the two piece design.", "Date": "September 21, 2013"}, {"Title": "GREAT ITEM", "Author": "RAUL", "ReviewID": "R22VXFOUCFP6F1", "Overall": "5.0", "Content": "I AM HAPPY WHIT THIS ITEM. IT IS GREAT. I LOVE IT. I RECOMEND IT. IT IS WHAT I WANTED.", "Date": "September 1, 2013"}, {"Title": "Good", "Author": "Adewale Adisa", "ReviewID": "R1C3I3UOOHKS8R", "Overall": "3.0", "Content": "Working well so far. Just started using it though, I hope it all last long. Not as small as I thought", "Date": "September 1, 2013"}, {"Title": "Great Computer", "Author": "Rosario Citrino", "ReviewID": "RLX8FIW5HPM3F", "Overall": "5.0", "Content": "This is a great computer for the price.  Windows 8 AND touch screen included.  I couldn't fine any touch screens at this price.", "Date": "August 20, 2013"}, {"Title": "Two chances", "Author": "Mesa", "ReviewID": "RMJWBUNQJV4YK", "Overall": "1.0", "Content": "I ordered this as an extra cord for my Asus X202.  Delivery was prompt however the first one that was sent to me didn't fit right in my computer.  It kept sliding out and would not recharge my computer.The seller had included a contact email and asked before we do a review on Amazon to contact them first.  Everyone deserves a chance so I sent an email and the seller did respond.  He was very apologetic and sent out a replacement cord.  This one did fit but before I wrote a review I wanted to make sure that it worked for a while.Unfortunately I have used it for 2.5 weeks and this morning the tip snapped.  This is not a good product and I have ordered another type on Amazon.", "Date": "August 21, 2013"}, {"Title": "Macbook quality, netbook price.", "Author": "JORDAN", "ReviewID": "R1NTQB3SP2XE8Y", "Overall": "5.0", "Content": "This is a great little laptop for the price:-Phenomenal build quality. The case is aluminum, apart from the bottom which is matte-black plastic.-The keyboard is very Mac-like, which is a good thing.-The trackpad is large, although you may not like the default driver.-The speakers are very good for a laptop of this size.-The power adapter is long and doesn't have a brick in the middle.-Great boot and resume time.That being said, it was made with some sacrifices:-Battery life is not great, expect about 3 1/2 hours.-Screen is glossy and on the dim side. This is not an issue indoors.-RAM cannot be upgraded.-It runs Windows 8. I had to spend a couple hours banishing Metro, installing Classic Shell to bring back the start menu, setting real, desktop software to open documents, and telling Windows not to phone home with my personal info.", "Date": "January 14, 2014"}, {"Title": "dead in a month", "Author": "Fei Han", "ReviewID": "R3LQIBULUT7DIQ", "Overall": "1.0", "Content": "Last month the origin ac adaptor of my asus Q200E was dead, so I bought this item for a replacement. What make me amazing is this new one was used for only one month and died again.", "Date": "December 17, 2013"}, {"Title": "Cord does not work", "Author": "strickke", "ReviewID": "R3PY1IHSW2YPH2", "Overall": "1.0", "Content": "This cord worked for about 2 weeks and then the tip snapped. Do not buy this cord. It will be a complete waste of your money.", "Date": "October 27, 2013"}, {"Title": "garbage, cord pulled out of plug in a week", "Author": "stro", "ReviewID": "RCDX8S8BHSF5S", "Overall": "1.0", "Content": "dont waste ur time or money, lasted a week then cord broke, was small and cool while it lasted, shop on", "Date": "July 28, 2013"}, {"Title": "Broke within a week", "Author": "Lindsey Kay", "ReviewID": "R258819BOEU8PI", "Overall": "1.0", "Content": "So I'd only had this for about a week before I unplugged it from my laptop and the head broke off.  I'd only plugged and unplugged it twice before that, so I guess third time is a charm.", "Date": "January 5, 2014"}, {"Title": "I would have given a negative rating, if possible!", "Author": "s", "ReviewID": "R2QBCD8F9R5T62", "Overall": "1.0", "Content": "I bought this at staples for about $400 end of Jan., spent 130 bucks for MS office, another 100 for the data transfer from my beloved but broken lenovo(my own fault, got dropped during airport transit).And suddenly (early June) this Asus 200E stopped charging, drained out of battery. Too bad I cannot just replace the battery as it is molded in as opposed to some thing you can pop it out. I treated this machine like a baby with utmost care, always kept in heavy padded case n every thing, no gaming, gentle use for just email n skype. Now I am stuck- did not want pay another 70 bucks for staples tech to just diagnose.Sending back to CA for manufacturer, paying for the shipping from out of pocket keeping my fingers crossed.If they replace this with the newer one, I will have buy again new MS office and for data transfer? What are my consumer rights?Besides, this is not even a comfortably machine lousy mouse pad and awful keyboard- It has carpal tunnel syndrome written all over itThe moral for me? is to go for one that is from reputed maker and BACK IT UP all the time- cloud based and on external hard drives", "Date": "July 5, 2013"}, {"Title": "Makes me want to cry", "Author": "Divya", "ReviewID": "R3BI6K7XLKKPOU", "Overall": "1.0", "Content": "I can't even return this thing because it's past 30 days from the purchase date. Horrible buy, and I paid nearly $500 for this, when I could have bought a Chromebook for about half that price. The problem? It is SO incredibly insensitive to touch (it's got a touch screen in case you didn't know), and even clicking on things can take FOREVER for it to register. I don't like this one bit. I want to sell it, but feel bad about putting someone else through this crap. Don't buy this, buy a Chromebook. The only reason I didn't buy a Chromebook was because it doesn't have a caps lock button (it's got a search button where a caps lock key usually is).", "Date": "July 23, 2013"}, {"Title": "Just go buy a Mac", "Author": "Kailey Fish", "ReviewID": "R10VNQY9LY2G95", "Overall": "1.0", "Content": "This computer is ridiculously hard to use. About once a month a notification pops up that some crucial update needs to install and gives you 15 minutes before it restarts and updates itself which takes anywhere from 15 minutes to four hours. If you need to do something important on the computer you can't, it just shuts down in the middle of whatever you are doing.It comes with a DVD player attachment, spoiler alert: it doesn't work.Windows 8 in itself is super confusing but the mechanics of this computer make it that much worse.", "Date": "December 22, 2013"}, {"Title": "hate it", "Author": "kira", "ReviewID": "R13Y0QFHV28APK", "Overall": "1.0", "Content": "nothing works.Cannot use the DVD reader have had to re-install multiple times.hard to navigate anythingwaste of money will be happy to sell on Amazon barely used computer", "Date": "March 25, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AP66YL8"}}