{"Reviews": [{"Title": "Fujitsu Lifebook LH532 i5", "Author": "Pagoda Products", "ReviewID": "R1ZSB25ALDUKW5", "Overall": "5.0", "Content": "Fujitsu is not as well known as other Japanese manufacturers, such as Sony or Toshiba, but Fujitsu makes absolutely great notebook computers, and when you compare features to prices, you cannot beat Fujitsu for value.  The Lifebook LH532 i5 has more and better features that the Sony Vaio, which costs $250-300 more. The quality is excellent and the 24/7 service is great.Fujitsu Lifebook LH532 i5-3210 Notebook", "Date": "December 30, 2012"}, {"Title": "Small letters on screen", "Author": "Jeroen Au", "ReviewID": "RCQG76EYL2A47", "Overall": "3.0", "Content": "This laptop with not too big screen has small letters in the 'system text'. It doesn't seem to care much about your eyes, as the layouts are sometimes structures in such a way that the letters turn out - readable of course - but small.I'm not knowledgable enough perhaps to rate this laptop. I just wanted to point out a disadvantage of it to warn others. But after 10 months, I am satisfied with the other features, it is has decent speed and doesn't freeze often even with many taps open.The reason I gave this three stars instead of four, is because of this advantage and because the screen is rather small. So this is a rather personal rating!", "Date": "May 10, 2014"}, {"Title": "I love it", "Author": "Sandra Francisco", "ReviewID": "R26QZJ15L0R2VP", "Overall": "4.0", "Content": "The only drawback I have with it so far is the weak speakers but I did not necessarily buy it for the speakers much more the functionality of a laptop.  I also dislike how the swiping method from outside the mousepad onto the mousepad alternates open windows but I am sure I can edit that once I figure out more of the operating system.Seller experience:  It was a bit confusing due to the fact that the seller sells products on both Amazon and Ebay.  I wanted two of these units however one sold on eBay during my purchase of two.  I had great feedback from the seller and we cancelled the order and I just had to reorder the one he had left.  It was tedious but at least he is up front and honest.", "Date": "February 25, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AU9SW10"}}