{"Reviews": [{"Title": "Great laptop for writers!!", "Author": "Inigo Montoya", "ReviewID": "R3OQ7VUKK30AKZ", "Overall": "4.0", "Content": "Overall fantastic laptop! I've had roughly 14-15 laptops over the last couple of decades and this is one of the nicest I've ever owned. I was looking for something with a good screen, good keyboard (without a 10-key) and good build quality and this really hit the mark pretty well.First the pros: - AMAZING screen...seriously, its beautiful - solid construction. It is a bit heavy but I like that as my previous (lighter) laptops felt like I was going to drop them all the time. This is a perfect size to keep on your lap if you want or use on a desk. It is heavy enough that it won't move around on you if you're a heavy typer like I am. - backlit keys are great. Not too dull, not too bright, perfect - keyboard....now, i personally don't like chicklet (island keys) keyboards but it virtually impossible to find a laptop nowadays that doesn't have one. Usually they are too weak and positioned oddly so that you're always hitting unintended keys (cntl, shift, etc). This keyboard doesn't seem to have that problem too badly. I've been typing on it the last few days and its far better than my last laptop's chicklet keyboard. The keys are responsive, spaced about right and soft to the touch so that it actually feels close to a regular keyboard. - It's FAST...right out of the box it boots up fast and with the hybrid hard drive it just works fast overall. Way faster than my other laptop which has a regular hard drive but almost identical other specs.Cons: - battery life...this thing really was intended to be plugged in all the time. You can dial down the settings to make the battery last 5-6 hours (no wifi, lowered CPU speed, etc) but it becomes laggy. I used it last night to surf the web while watching TV and it lasted about 2 hours on wifi. Not bad but not great either (I've had this laptop for about 4 days now). However, if you can plug it in and use all the components at full power..this laptop is awesome!!**Side note** - there is an option to get a full SSD hard drive with this model. If you can spend the extra money and get it, it makes the laptop even faster and extends the laptop battery immensely. The SSD uses almost no power so on my friends XPS (same as mine only with a 500gb SSD) her battery life was nearly double what I got. - hard drive (500gb hard drive with a 32gb SSD hybrid) is a little noisy. It makes some weird noises but its lightning fast! I almost got a full SSD but this seems to be just as fast despite the noise that it makes. It's really not that bad, I'm just a little picky sometimes.I would highly recommend this laptop to anyone that needs something to do some extensive work. I write in my spare time (which is why i didn't want a 10-key..it just gets in the way) and this laptop is perfect for that. Great screen, remarkable resolution, good speed, excellent quality. Just make sure if you really want to do some serious work (5-6 hours without interuption) you sit near a good power outlet.Oh, and a side note, the specs above list that it has 4 USB 3.0 ports...it DOESN'T. It has 3 of them. The other one that looks like a USB port is a network port. Also, one of the USB ports is a \"powered\" port that is on all the time. This way you can plug your phone into it and charge it while the laptop is off. My last laptop had this feature too and I loved it. This feature came in very useful on trips. And one last thing. There is no VGA port on this. It has a 'minidisplay' port. It doesn't come with an adapter so if you want to use a VGA or DVI port to connect to an external monitor (instead of the built in HDMI port) then you'll need to buy an adapter. They are cheap though and you can get one for $10-$20 just about anywhere.", "Date": "November 22, 2013"}, {"Title": "awesome", "Author": "thapa", "ReviewID": "R3HNO9F2S3V0I0", "Overall": "5.0", "Content": "I bought this laptop despite of all the bad reviews and I personally don't regret it at all. I've been using this laptop for past 2 weeks and haven't faced any problem; no wi-fi issues or anything. The machine boots very fast and graphics is awesome. I enjoy watching movies and playing games in this pc. Although it is quite heavy and battery life doesn't last that long, it is still a good deal for those who want laptops with good performance and looks. I recommend it for both its looks and performance.", "Date": "September 29, 2013"}, {"Title": "Great Product", "Author": "Cooly", "ReviewID": "R19G7OTH186WJ5", "Overall": "5.0", "Content": "Dell has fixed almost all the issues with this laptop and it runs great! Battery doesn't last as long as i would like it to. After first day it got stuck on bios screen but i fixed it with the other reviewer's link. I would recommend this laptop to anyone looking for one. No wifi issues at all!!!", "Date": "May 23, 2013"}, {"Title": "Sleek and Solid Build", "Author": "Mr. J. O. Beecroft \"Taipan\"", "ReviewID": "REC2WB72P99NJ", "Overall": "5.0", "Content": "The laptop looked absolutely lovely and I wasn't dissapointed by the looks. It was also very fast and my colleagues were all impressed.Unfortunately, after the first day, the laptop refused to boot and got stuck on the Dell screen at the beginning. I tried all sorts but couldn't get it to work. Finally, I browsed the internet and found that others too had experienced the same problems. Luckily, instructions for sorting out the problem were on the Dell forum - see below.[...]", "Date": "April 14, 2013"}, {"Title": "Good device!!!", "Author": "villa131982", "ReviewID": "R4ZWQFDSSWQ4I", "Overall": "5.0", "Content": "It's very fast to start and the battery lasts longer than I expected. A little heavy but very stylish as well.", "Date": "November 22, 2013"}, {"Title": "Good Solid Laptop", "Author": "gnairooze", "ReviewID": "R3CZNQ5CP8VVAA", "Overall": "4.0", "Content": "It is awesome laptop.Pros:1. Excellent screen with full HD resolution, good colors.2. Keyboard is OK. It feels solid.3. The laptop exterior is elegant metal. The back feels like a rubber and not plastic together with the area around the keyboard and the touchpad. It feels great.4. The memory is (6 GB) allows me to run many apps together, also to run virtual environment like VirtualBox without suffering performance.5. The HDD together with its mSata disk are great in performance. Windows 8.1 with all my apps boots in 5 seconds. My apps run flawlessly.6. The processor (intel i5 3rd generation) performs decently.7. It graphic card (nvidia 630m) is good for gaming. I have need for speed world. I put the graphic settings to high values. It performs very nicely, but I am not of an experienced gamer. So I 'all leave the gaming review to the others bought this laptop.Cons:1. Touchpad worked moderately but with strange behavior when scrolling. It may get to the end of the page suddenly. This behavior corrected after reinstalling its driver.2. The keyboard has no dedicated keys for: home, end, page up, page down, break. But there are a lot of apps that can assign custom keys to those.3. It is a little bit heavy.Conclusion:It is a great laptop. I recommend it to everyone.", "Date": "December 6, 2013"}, {"Title": "Bad wireless connection..", "Author": "Shukiri", "ReviewID": "RZCU9P6TRJGQX", "Overall": "1.0", "Content": "Don't get this. It has the same wireless network card issues that the other versions of the xps15 have. It's not fixed.", "Date": "November 28, 2013"}, {"Title": "Nice Computer", "Author": "Chris", "ReviewID": "R3H214F9VY59AB", "Overall": "5.0", "Content": "I like this computer, good speed, good looking, good screen. The only but.... a little bit heavyI recomend this computer.", "Date": "September 7, 2013"}, {"Title": "Not sure if I got what was advertised", "Author": "Sid", "ReviewID": "R1F7V82IUYACYJ", "Overall": "1.0", "Content": "I bought this laptop in November. It worked for a couple weeks but out of nowhere a white horizontal line started to appear on screen.  I called the people I bought it from (BestDeal Tech, they suck) but they said I have to call Dell directly.  I did that and Dell sent someone to replace the screen with a \"new\" one.  Turns out that \"new\" one was refurbished and had existing damage.  The rep admitted it was damaged and said he would send someone else out to replace it...never happened.  The laptop crashed days later and I've been dealing with Dell support (no thanks to BestDeal Tech) to fix the problem with no solution yet.  BestDeal Tech refuses to help me even though they sold me what I believe was a defective system because of a BS 30-day return policy.  The problems started after 30 days.  I had a Dell Inspiron Notebook for 9 years before I bought this one that lasted about 9 weeks.  Now it's an $800 paperweight.", "Date": "April 24, 2014"}, {"Title": "Dell XPS 15", "Author": "Joey San Juan", "ReviewID": "R1781C6QX77YZR", "Overall": "3.0", "Content": "The touchpad is glitchy at times. Also the battery life is not good. Plus it won't let me upgrade to Windows 8.1 patch. It is an ok laptop. And I did not pay for just ok..", "Date": "April 10, 2014"}, {"Title": "Bad business, stay away!!!", "Author": "Ben", "ReviewID": "R1J9HZH8WWVDLC", "Overall": "1.0", "Content": "Gee, where do I start?1. Right out the box for the first time, there was a big scratch mark half way across the touch pad, that should ring the bell at that moment, but I thought if it's the only problem, I'll just suck it up.2. The OS was Windows 7, NOT Window 8 as they descried on Amazon. So I contacted seller, they said they could send me a product key for myself to upgrade it to the Windows 8. I felt it was a little iffy, so I took a $75 refund instead. If that was the only thing I had to suck up again, I'd be still cool with it.3. There was no Intel Wireless Display installed! I tried to download and install it online from Intel's website myself, and it kept saying \"the platform is not compatible with Intel WiDi...\" Now that's the red flag- if the processors are 3rd generation Intel i5 like the seller advertised, there is no way the platform wouldn't be compatible with Intel WiDi. So I ran a Intel's software \"Intel system identifier\" to see what actually is inside the laptop, guess what, Intel software could not identify the system!4. I called the Dell customer service today (April 7, 2014), after providing the service tag, they told me this laptop is a \"REFURBISHED\"!! NOT \"brand new\" as the seller described on Amazon and reassured me in the email they sent me! And there's another person's name attached to this laptop, until I'm able to confirm I'm the owner of the laptop, they are not going to do anything for me! By the way, I was also told if I had upgraded the system OS with the key they provided, the laptop would lose its factory warranty automatically.I am SO sending it back, not only it's a bad laptop, seems to me there are legal issues involved... To say the least, the seller deliberately lies to its customers! I will not recommend this laptop nor the seller to anyone!! Stay away!!!", "Date": "April 7, 2014"}, {"Title": "It is good I like it but...", "Author": "Nick Na", "ReviewID": "R371XRB4F03SU9", "Overall": "3.0", "Content": "IT IS MUCH HEAVIER THAN I EXPECTED.I CAN HEAR a lot of NOISES WHEN IT WORKS.I WANT TO RETURN IT BECAUSE OF THOSE NOISESBUT I WON'T.", "Date": "March 6, 2014"}, {"Title": "dont buy", "Author": "frankie Costa", "ReviewID": "R25IVSDG3NEFLC", "Overall": "1.0", "Content": "The internet did not work I was on the phone with Dell for about 5 hours installing stuff. Finally they sent a person to my house to try and fix it but he didn't so then after 10 weeks I got them to send me a new computer.", "Date": "February 6, 2014"}, {"Title": "GOOD Laptop!", "Author": "Wei Haitao", "ReviewID": "R11XHWX456GV8S", "Overall": "5.0", "Content": "Very excellent built, fast starting speed. No problems other people have happened, the screen is also very good. Good laptop.", "Date": "December 2, 2013"}, {"Title": "I like it very much!", "Author": "Cheng Li", "ReviewID": "R2Q0GSS6GFZY4I", "Overall": "5.0", "Content": "They update my computer for free and I got my computer very soon! I like my computer very much.BTW, this computer may have the problem stated by other reviewer. Their solution really works.", "Date": "September 15, 2013"}, {"Title": "Look elsewhere for a quality product", "Author": "kk.ro \"Kyrsten\"", "ReviewID": "RK4QXDYJHB7UR", "Overall": "1.0", "Content": "I absolutely hate this computer and regret spending money on it. I strongly encourage either purchasing a top end laptop from somewhere that is not Dell. At the least, purchase a cheap laptop-you won't be able to tell the difference. The sound quality is about the only decent thing about this computer. Aside from that, it is slow, the battery is atrocious, the graphics card will not allow any updates for gaming purposes and the disk drive no longer works. Worse, every encounter I have had with the Dell customer service has been horrible. I have taken good care of this computer. I wish I could say it did the same for me.", "Date": "December 2, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00ANKN1DA"}}