{"Reviews": [{"Title": "seriously awesome computer", "Author": "Carissa", "ReviewID": "R268TQSFYSZWX4", "Overall": "5.0", "Content": "i spent an entire week researching laptops and finally decided on this one, and i'm so glad I did!! first off, I'm in college, so i needed something light so i could carry it in my backpack without noticing the weight.  i also wanted a touch screen because of the windows 8.  this laptop is beautiful, looks like a macbook and i've seen some complaints about that which i dont understand. it looks awesome.  i have not had any wi fi issues at all, it connects automatically to every network (home, work, school) i've connected it to and stays connected 100%.  the touch screen is amazing, makes it feel like a tablet. windows store could be better, but i'm sure that's something that will continually improve.  I did not want to get a windows 8 device, and it took me about two days to get the hang of it, and i'm still learning cool new things but now I love it!! just give it a chance, it's a great operating system.  i was in class the other day, on one of the cool homework/student planner apps i had installed and the guy sitting next to me on his ipad watched me for a few minutes and asked, that is so awesome, what is that?! get this computer, you wont regret it!", "Date": "August 31, 2013"}, {"Title": "Great Ultrabook", "Author": "Amazon Customer", "ReviewID": "R36KF2H2R9KFQD", "Overall": "5.0", "Content": "This is my first experience with Windows 8 and it does take a bit of getting used to.  On advice from another reviewer, I downloaded Start8 from Stardock which  gives you a Windows 7 start window.  The neat thing is you can then toggle between the start windows with a single finger swipe.  I've been using the Windows 8 Start more and more as I get used to it.This is a very fast machine and I have had no problems with only 4 gigs of RAM.  Like an earlier reviewer, I plan on upgrading to 8 gigs sometime soon.  Since I have an extended warranty, I'll get it done at an authorized dealer to preserve the warranty.As it does not come with an internal optical drive, I use an external LG Multidrive drive when I need to load a CD or burn one.  Also, I have an external HP Simple Save 500 gig for backing up the computer.  Neither of these need to stay connected for routine use.The wi-fi feature works very well. We have created a wi-fi hotspot with a range extender that covers three neighboring homes nicely.  I can hit my HP wireless printer from anywhere within 500'.  I am frequently in other wi-fi areas and this machine detects and connects very fast.  I use Norton Mobile to help protect me when out there in the outer realms.The one thing I wish it had is a removable battery.  That way I could have an extra charged battery and extend my operating time when out and about.I do definitely recommend this ultrabook for anyone's use.", "Date": "August 1, 2013"}, {"Title": "Not what I hoped for.", "Author": "Amazon Customer", "ReviewID": "R31RZZU08E2H65", "Overall": "2.0", "Content": "I wouldn't purchase this again.  The network connection has been a continual pain in the......All of our other computers have no issues connecting to wi-fi, but this one does not keep it's connection.  I'm even writing this review on another computer because I cannot get on the internet with the laptop. I had purchased this for school, but am considering returning it for a different model.", "Date": "July 28, 2013"}, {"Title": "WiFi is terrible and there is no fix!", "Author": "Kimberly Kan", "ReviewID": "R3ETEEF30GJKEY", "Overall": "1.0", "Content": "I spent the last 3 hours online trying to find a solution for the TERRIBLE wifi that comes with this laptop. I would recommend against purchasing this laptop. I am in a 700 square foot apartment and cannot receive internet access across the apartment! Even my iPad received better internet access than this.I was planning on using this at school, but am afraid that the laptop will be rendered useless! I expected more from Lenovo. The overall feel is okay. The keyboard keys stick sometimes (also a problem I see with my dad's HP...is this a PC thing?) I experience some weird scrolling with the touchpad. I understand that this is a budget friendly laptop, but acceptable wifi should be standard.Also, when I tried to submit this review, it couldn't happen because the wifi is just that bad.", "Date": "August 20, 2013"}, {"Title": "Serious issues, ignored by Lenovo !", "Author": "Ariel", "ReviewID": "R3PE3WHN1J9BBY", "Overall": "1.0", "Content": "This laptop has everything to like- Sleek look, Nice touchpad, good over all performance and a competitive price, 24GB SSD for Cache-  nice, right ? Well, NO !!! There are numerous Threads and users suffering from the same problem involving, seemingly, the SSD Cache. Another issue is the UEFI bios absence, to say- there is one but you cannot access it.For some reason Lenovo decided to ignore all of the customers (and there are many) having this issue. Which leaves us users with a piece of junk for a laptop- although it does look pretty nice paper weight. Seriously, I bought this ultrabook for my wife two weeks ago and since then I spent days trying to fix this issue. I think it's a hardware problem and if it is Lenovo should have a Recall !!! I bought a new Item that should work properly.I don't mind there is a malfunction that can happen to every company, anytime- but he way Lenovo deals with this problem is embarrassing.Don't buy this product, or for that case- any other Lenove product, at least until they'll come back to their senses.", "Date": "August 14, 2013"}, {"Title": "Stay away", "Author": "tkny", "ReviewID": "R3UN3NMYDV5NI9", "Overall": "1.0", "Content": "I bought this machine direct from Lenovo, there are many issues wifi is terrible, the machine is slow, if you have to restore the operating system you will not be able to use the SSD again unless you buy the recovery disks, it loaded with terrible software for example something called nitropro for PDF files.  I wanted it to work but sent it back.  The windows 8 touch screen is cool but windows  8 is a nightmare if you are use to win 7 or XP. The apps are terrible very slow and loaded with ads, it a neat idea but very poorly executed. The weather.com and accuweather apps take what seems like for ever to load, I clicked it and opened the same app on an iphone checked the weather and started reading a email and the win 8 app was still loading. I will say it's a nice looking machine but thats about it.", "Date": "August 10, 2013"}, {"Title": "Wifi Adapter issues", "Author": "Voltron", "ReviewID": "R1691KNQ8AESCK", "Overall": "1.0", "Content": "No need for a review. We bought this idea pad to test our app. Unfortunately, our app requires network connectivity (100 percent of the time) this laptop will not provide that for you and has MAJOR issues with intermittent WiFi connectivity.- 1 star for Lenovo.", "Date": "July 29, 2013"}, {"Title": "Very impressed so far", "Author": "D.A.G.", "ReviewID": "R1SG5MDSASO0K1", "Overall": "5.0", "Content": "I have had the IdeaPad Touchscreen for about 48 hours and so far I am very impressed. The touchscreen works and looks great, keyboard seems very solid and the computer is fast.  I really like the size and light weight - about 3.7 pounds. This is a very portable ultrabook.  Windows 8 is working great. It takes a bit of getting use to, but I give it 5 stars as well. The price can't be beat for what you get - touchscreen, i5 processor, light weight, etc.", "Date": "April 4, 2013"}, {"Title": "worst. laptop. ever.", "Author": "Aarthi", "ReviewID": "R2TZW17E9ZZ1F4", "Overall": "1.0", "Content": "This laptop is the WORST and I would suggest not buying anything lenovo in general. This laptop might seem to work at first, but give a little while and the WIFI will basically completely stop working. It will connect and disconnect a crazy number of times and just not work. I have spent hours at a time just connecting and disconnecting before giving up. I called tech support 5+ times, sent in the laptop for repair, before the laptop just crashed and stopped working altogether about two months in. I lost several papers, my resume, all sorts of things, right in the middle of finals week. (Granted, I should have backed up my files, but I wasn't expecting a few-month-old laptop to completely crash.)Not to mention the touchpad two-finger scroll will just stop working for hours at a time.You might think that this is just a lemon, but countless other people who have this wifi issue and have received the same s***ty advice from the lenovo tech support. Lenovo knew about this issue a LONG time ago and didn't do anything about it/didn't stop selling the laptop.Piece of s*** laptop, piece of s*** company. Don't buy Lenovo.", "Date": "May 28, 2014"}, {"Title": "The screen broke after only two weeks of use", "Author": "Carlos Escobar", "ReviewID": "R1EZE40AHIJDIF", "Overall": "2.0", "Content": "I bought one for my son.  After only two weeks of using it (majority of the time in home, under controlled conditions), the screen broke and the display was set apart of the case, hanging in the air.  It works, but is a problem the fact that permanently we need to put a hand over the display in order to obtain it remains on site.  We had tried with the phone support of Lenovo, but have been irresponsive and doesn't bring any solutions until date.", "Date": "April 23, 2014"}, {"Title": "Great laptop", "Author": "Amorn Thothong", "ReviewID": "R1YIQEJIWTVELK", "Overall": "4.0", "Content": "Great laptop.  A little heavy.  After out of warranty, will change hard drive to be SSD.  Battery not as good as ASUS.", "Date": "April 23, 2014"}, {"Title": "Sleek and slim", "Author": "Hope Brooks", "ReviewID": "R3O32RPZFOF1TK", "Overall": "5.0", "Content": "Bought for my granddaughter who is at University and lives on her computer.  Actually she choose it and I've heard no complaints so I guess thats recommendation of a kind.  If young people like it it must be \"Up there\".  Suitable for all who qualify.", "Date": "March 5, 2014"}, {"Title": "Very good design, but slow for programming", "Author": "nishant", "ReviewID": "RC3XO8CY6JUL0", "Overall": "4.0", "Content": "Pro :touch screendesigndoes not heat upCons :might feel the need of a higher RAMscreen contrast not good", "Date": "March 3, 2014"}, {"Title": "I was expecting way more ULTRAness", "Author": "steven hanna", "ReviewID": "RZ4OU349TRQWY", "Overall": "3.0", "Content": "This computer is nice, but it seems to be pretty slow for being brand new and with an i5. The touchscreen has a low viewing radius and isn't very sensitive at times. I would likely choose another model just based on the picture quality. My 7 year old Toshiba Satellite had a better overall picture. Though not touch capable,", "Date": "February 25, 2014"}, {"Title": "Great laptop but win8 sucks", "Author": "Aveesh Kumar", "ReviewID": "R245SXQAEFZX1N", "Overall": "4.0", "Content": "It ook a while to get used to the touchscreen but many things are better - how t o turn it off or choosing a point on google maps but i think win8 spoilt it for me - skype wont work until i created a microsoft account - so i downloaded and installed the old fashioned way - things take far too much time - while it \"thinks\" - and it just wouldnt resume after I close the damn lid - after endless hours of windows update, dirver update - bios fiddlingso I had to do it - I blew away win8 and installed win7 32 bit - it is amazingly fast now and responsive. Great hardware for the price - unbeatable in my opinion - but it was being held back by win8 - IMHO", "Date": "February 16, 2014"}, {"Title": "Terribe Wi-Fi", "Author": "H.Kaura", "ReviewID": "R28JN9CKK13QGG", "Overall": "2.0", "Content": "The laptop looks nice, and runs well, except for the Wi-Fi.  It works maybe 30% of the time.  We even purchased an expensive Wi-Fi adaptor but this laptop still has problems connecting.  I depend on using Wi-Fi for work and at home.  I will definitely be returning this laptop.", "Date": "January 22, 2014"}, {"Title": "Excellent buy!", "Author": "IM D1", "ReviewID": "R3TF68WHQ4PGS", "Overall": "5.0", "Content": "This ultrabook is very fast, sleek, very light, and affordable price.  Highly recommended.  Touch screen function is a must if you want a new ultrabook as your \"pet computer.\"", "Date": "January 20, 2014"}, {"Title": "First one broke, second one slow thanks to Win 8.1", "Author": "J. Katz", "ReviewID": "R365GTQT194M2W", "Overall": "2.0", "Content": "Basically what the title says.  The first one broke right at the 1 month mark (something about drive state error).  We got it replaced with another one, and ever since updating from Windows 8 to 8.1, starting up takes forever and we're getting errors (first it was with Dolby audio software, and now it's with Intel Rapid Start Technology).Before 8.1, we had the computer in a different language, but ever since installing 8.1, it refuses to return to this language.  The fan's always whirring away, too (since the beginning).  And it's not easy to sync it with an iPhone (or at least, in my case, it's giving me problems).", "Date": "December 26, 2013"}, {"Title": "Defective product, bad service, inept repair, bad retail experience, disaffected uncaring support... what a horrible experience.", "Author": "WMS", "ReviewID": "R1689BCC1KUBGU", "Overall": "1.0", "Content": "Bought it as a gift for a friend.  Terrible purchase.  Been in lenovo service center 4 times, issues persist.  Keeps dropping the drive/ or drive errors.  Service center replaces the drive, then after a few weeks use drive errors recurr.  No attempt on part of service center to identify / remedy root cause.  Just a bunch of automatons, amoeba moving from stimulus to stimulus without a rational cogent thought in their heads.  The service center techs are seemingly incapable of listening to reason or even following a methodical troubleshooting decision tree.  Purchased in June, this device has spent most of the time either in service, or reloading the OS from the recovery partition and subsequent reinstallation of office.  Is nice looking, has good specs, seemed to be a good purchase but I am so disappointed in customer service both from Lenovo and the Lenovo service center in Bogota Colombia I will never buy another Lenovo product.  My experience is so bad I don't even want to do business with IBM anymore... I know Lenovo is not IBM, but I\"m angry, and anyone even remotely associated with Lenovo is on my \"do not do business with\" list.  Oh.. yeah... add me to the \"wifi sucks\" list... can anyone say class action ?", "Date": "December 9, 2013"}, {"Title": "Light - weight laptop with good performance - Buy a Tenda USB Micro Adapter to Improve Wifi", "Author": "snd220", "ReviewID": "R3SW8UMSX0PGOU", "Overall": "4.0", "Content": "For the price this laptop is a great size, light weight, and has good performance.  I bought this laptop in August 2013 and purchased a Tenda wireless USB micro adapter at the same time (thank you previous reviewers for the heads-up).  I don't have any problems with wifi connectivity thanks to my $15 Tenda purchase.  I do wish the battery lasted couple of hours longer. Overall, I have not had any problems with the laptop in the last 3 months.  I think it is a solid investment.Here is a link to the Tenda:  [...]", "Date": "December 5, 2013"}, {"Title": "WiFi Problems: YES, Bought last AUGUST 2013", "Author": "AnneSalas", "ReviewID": "R3NFUTAMX64GER", "Overall": "2.0", "Content": "WiFi is terrible. I've researched a couple of reviews for this laptop, and found a couple of reviews that state that the WiFi is horrible. But I checked back, and some had said that it was resolved. Not for me. I still had to buy a WiFI adapter - the WiFi on the computer kept on disconnecting and connecting.", "Date": "November 25, 2013"}, {"Title": "overall good laptop - check on the warranty expiry dates after u buy", "Author": "GTALKING", "ReviewID": "R1I3J5O33ICZZ2", "Overall": "4.0", "Content": "I liked the laptop for about a month and as usual windows free upgrade to 8.1 launched with bugs for the users to deal with the buggy software. Hibernating the laptop comes around with the infamous blue screen error / memory dump nonsense. Anyways I called the Lenovo support to get this fixed..the support was real nice but one thing they told me was that my laptop was registered as bought on FEB 2013 where as I order it from AMAZON in Sep 2013. Makes me loose almost 7-8 months of warranty. Now I need to send my original order receipts etc to get this fixed .So In case you guys order this laptops doesn't hurt to check with Lenovo on the warranty  expiry dates just to be on the safe end. Other than else the laptop itself is a good make from Lenovo.", "Date": "November 23, 2013"}, {"Title": "Converted User", "Author": "Natosha McNeal", "ReviewID": "RIRO28P5SU373", "Overall": "5.0", "Content": "Shocker Alert: I am a former MacBook Pro user and I thought about upgrading my 2009 model to a newer one but was swayed by the $1000+ price tag. I heard good and bad things about Windows 8/touchscreen so I did my research and landed on this laptop. I received it yesterday and the setup was easy enough. I would classify myself as somewhat computer savvy but I am not technie so I think that this will fit my basic needs quite fine.", "Date": "November 8, 2013"}, {"Title": "College Computer", "Author": "Martin57 \"Techno weenie\"", "ReviewID": "R155PBLWIJXQPQ", "Overall": "4.0", "Content": "My daughter is using it at college and really likes it.  She is a great fan of Windows 8. The machine is light, has good battery life and the WiFi seems to be quite adequate and works all over campus.  Regrettably, the hard drive failed after 6 weeks of use.  Lenovo replaced it at no charge. Beware that you have to ship the machine to their repair center in Texas. Turnaround time (door to door) was 4 working days.", "Date": "October 22, 2013"}, {"Title": "Perfect for what we needed.", "Author": "Patrick O'Toole", "ReviewID": "R38VKFKUYN1YJO", "Overall": "5.0", "Content": "Needed a simple computer to lesson plan, check email, surf the web, and use iTunes. Excellent price, easy to use just seconds out of the box. We're not tech savvy, but Lenovo seemed to be the most recommended from a great number of people.", "Date": "October 5, 2013"}, {"Title": "So far, so good!", "Author": "ron", "ReviewID": "R19FJKU1WJFPG", "Overall": "5.0", "Content": "I had a hard time deciding on this product because of the negative WiFi reviews but I have faced no WiFi connectivity issues. Glad I bought it! Met my expectations :)", "Date": "October 2, 2013"}, {"Title": "Great for high school", "Author": "VA", "ReviewID": "R3418EF5E9NX6R", "Overall": "4.0", "Content": "My son loves this laptop. Best of both worlds with the touch screen  and the regular keyboard/trackpad. Highly recommended. Doesn't hurt that it looks like a Macbook Air from a distance :-)Update: Taking off a star for the poor wifi adapter. It is very slow to connect to my home network, other devices have no issue. Youtube videos take a long time to load, buffer a lot. Planning to get a USB wifi adapter dongle, hopefully that works better.", "Date": "September 27, 2013"}, {"Title": "Look great but ITS NOT!!!", "Author": "sage", "ReviewID": "R3RP9CUKURZQ7F", "Overall": "2.0", "Content": "The touch is meh. The WiFi is crap. In addition the win 8 has to be activated. Everything else seems to be OK (that is nothing exceptional.) My advice is not to buy it.", "Date": "September 19, 2013"}, {"Title": "Nice design, but poor quality", "Author": "johny", "ReviewID": "R2SDFXLER38ROX", "Overall": "2.0", "Content": "Happy with the design and operation- but the hard drive failed within 2 weeks.  That is poor.  Hope the repair works out!", "Date": "September 16, 2013"}, {"Title": "Stylish laptop.. Quirky internet situation", "Author": "Palks", "ReviewID": "R15LMEMM3LB8HW", "Overall": "4.0", "Content": "From a style perspective, this laptop is excellent. Many of my friends have said \"you got a mac for the fraction of the cost.\" It's light, simple, and has a comfortable key board. Windows 8 works great with the touch screen and for those who like newer technology, I think you will really enjoy the look and functionality of Windows 8.Now for the downside. Initially, the internet connection with this computer sucked. If I sat right next to the router it worked great but once I would move one floor above the router, it was extremely slow and would often drop the connection. Luckily if you type in \"Lenovo internet connection issues\" you will find a ton of customer responses and I was able to troubleshoot the problem myself. The internet now works decently well, but is slow for loading things like videos. The computer also freezes sometimes which can be annoying but it's usually only for a second or two.All in all, the pros for me outweigh the cons with this laptop once you troubleshoot the internet issues. This computer is stylish, light, fast, and has the cool touchscreen capabilities for a fraction of the cost of a mac or high-end pc.", "Date": "September 15, 2013"}, {"Title": "new computer", "Author": "Katie Ewing", "ReviewID": "RNPS9SVDXBJ01", "Overall": "4.0", "Content": "I have been using it for about a month.  For the price it is outstanding.  I am still getting used to windows 8 otherwise it would be a five.  Navigating Windows 8 is  not intuitive.  It is quick on start up but it is still new.  To me it is very light and doesn't heat up during long use.  I am pretty happy with the whole computer.  Hopefully Microsoft will fix this operating system.", "Date": "October 14, 2013"}, {"Title": "i dont like it", "Author": "ladybug001", "ReviewID": "R2I3SMVOONC9PE", "Overall": "2.0", "Content": "i have had this laptop for about 10 months. it has been very slow and the display is distorted unless you are looking directly in front of it. to top it off, it just stopped working a few minutes ago. it was plugged in....and the whole thing just crashed. i really wish i had spent a little more and bought something better (at the time, i did do a lot of research and found that for the price range i wanted, this laptop's specs were very good). also, windows 8 really sucks. i was sure i would get used to it with time, but it is just awful. for $200 more, i am sure i could have bought something more powerful and lighter.", "Date": "August 30, 2013"}, {"Title": "GREAT ULTRABOOK", "Author": "Fede", "ReviewID": "R27NW83MTFFUYT", "Overall": "4.0", "Content": "Absolutely fantastic ultrabook. got it for 600 a really good deal. it is realy fast.i can notice some fingerprints in the screen but that was expected. it starts up very quickly. i have put microsoft office 2013 and is working very well. i heard that some people had issues with the wifi, well, so far so good, nohing has happened. i love the fact that is has got an hdmi and two 3.0 usb ports, you can notice the speed difference between a 3.0 and a 2.0. the only thing i would improve is the battery life, at the moment i'm getting 3-4 hours of constant use, the other thing i would include is a backlit keyboard.overall this is a great product, it is really useful for students. this pc is really thin and light. i'm giving it four stars because of the battety life and the backlit keyboard. for 550 bugs this is a great deal.p.d battery won't die if you're plugged to ac, this is  the only way you can get more battery life", "Date": "July 31, 2013"}, {"Title": "Possible Network Issue from Previous Model", "Author": "Fishdish", "ReviewID": "R10VOLUMBR1926", "Overall": "3.0", "Content": "I did a lot of research before deciding on a notebook, yet was avoiding this Lenovo line due to certain issues, but since I was able to get for $599 last week (not on Amazon), I gave it a shot.  Went for full refund due to some bad pixels instead of an exchange for several reasons:Good:1. Small and light (objective)- I like the size2. Price3. Looks (objective)4. Good specs on paperNot so good:1. Was a little slow- when checked even after a cold boot/no programs launched over 65% of RAM was being used up constantly2. Network issue (note this from previous model)- Not sure if it is the same as the previous model (which Lenovo claimed to have fixed over summer), however I noticed extremely slower speeds when over 10 ft away from my router.  Compared with another notebook in several rooms.3. Trackpad (possibly due to reason number 2)- Touchy, sometimes wouldn't respond at all3. Screen Smudges- I know it's a touchscreen but it gets dirty so fast4. Significant keyboard flexNote: Network issue, which can be googled to verify all this information, on previous model has been widely discussed and Lenovo said that models created after June or July 20 2012(sometime around there)no longer have this hardware issue.  However, many purchasers have noted models made after said date still have the issue. According to specs, this has the same network card as the previous model and from my experience it seems to have kept the hardware issue as well.", "Date": "April 22, 2013"}, {"Title": "Wifi doesn't work properly", "Author": "Loc Tran", "ReviewID": "R2EOM1OOCAZ7Q6", "Overall": "1.0", "Content": "All we need is the video streaming to watch netflix, it stops and goes every few minutes.I checked on the internet, there was a big issue with the wifi on this laptop and currently there is no fix..Here is the link to it.[...]We return and get 20% restocking...I have nothing against ProSell, but whoever looking to buy this laptop, please be aware...", "Date": "August 15, 2013"}, {"Title": "total piece of junk", "Author": "Amazon Customer", "ReviewID": "R31XGG902K33MD", "Overall": "1.0", "Content": "Wait until the hinge breaks on you and Lenovo charges you to fix it. Lenovo equals trash. I'll never touch one again.", "Date": "May 20, 2014"}, {"Title": "good", "Author": "HaEun Yoo", "ReviewID": "R31FUM15IPFGNP", "Overall": "4.0", "Content": "This laptop is very good.color is simple and not heavy.I like the size.If you do not download any app which is not necessary, speed of computer is good.", "Date": "April 7, 2014"}, {"Title": "pc shut down problems", "Author": "Kevin \"Kevin\"", "ReviewID": "R3T3FMR2G5PABW", "Overall": "1.0", "Content": "keep having problems. DC Watchdog message. the pc goes into a blue screen mode and the shuts down quite often.", "Date": "February 6, 2014"}, {"Title": "Stay away from this ultrabook", "Author": "Bryan D. Uslick", "ReviewID": "R3EQ1OD078E4SF", "Overall": "1.0", "Content": "The O L and period keys stopped working in 4 months.  Lenovo support is nonexistent.  Stay away from this ultrabook.", "Date": "January 1, 2014"}, {"Title": "I only need to understand the operation of solid state hard drive, and configure the synchronization system", "Author": "Jesus Araque", "ReviewID": "R1ERUFQ3STK633", "Overall": "4.0", "Content": "I only need to understand the operation of solid state hard drive, and configure the system synchronization, the rest all ok", "Date": "December 31, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00ATANWLK"}}