{"Reviews": [{"Title": "Very good budget laptop", "Author": "Miriam", "ReviewID": "RBS2FCM72MH3S", "Overall": "5.0", "Content": "First, let's get the WIFI disconnection problems out of the way. No promises, but this is what worked for me and many others:1) Update the WIFI driver to the latest one. Go to us.acer.com/ac/en/US/content/drivers to get it. As of this writing, the latest driver is version 10.0.0.225. Install the driver and reboot.2) Then, on your computer, open Network and Sharing > Change Adapter Settings > **WIFI Adapter Properties** > Configure > Power Management > UNcheck **allow the computer to turn off this device to save power** See? You want to stop the PC from turning off your WIFI to \"save power.\"3) Then go to your Battery Settings.....Click Battery icon > More Power Options > Power Saving / Balanced / High performance > Change Plan Settings > Change Advanced Power Settings > **Wireless Adaptor Settings** > Power Saving Mode > on Battery > Change to low or medium power saving (Medium works for most people. I chose Low). Reboot one more time. Done.--------------------------Now the review. I'll update this later if I encounter problems.Pros:* Optical/DVD drive. DVD drives are growing increasingly rare in the \"budget\" category. Maybe you don't want/need a dvd/cd drive. I do. I think the closest rival to this laptop is probably the HP Envy Touch, and it doesn't have an optical drive.* i5 Processor. This is middle of the road. Not as slow as the i3, not as great at the i7. But the i5 does its job well. And yes, you can game on this, IF you adjust your game's Resolution and Details to Minimum, bringing the fps down. It still renders the play smoothly, example world of warcraft, sims.* Graphics card / Memory. This comes with the Intel HD Graphics 4000 card (update the 4000 card driver when you get this laptop!) - and 128MB of dedicated system memory. Yes, I would definitely prefer an nVidia and more Memory. But, for the money, it can still juggle multiple programs being open at the same time, some CPU intensive. For example, if you're playing a game, you definitely should close all other programs first to free up that Memory. However, let's say your editing videos; in that case, you can manage to have your editing software open as well as other programs and truck along just fine.* More USB ports, including 3.0, and dongles (HDMI/VGA/Ethernet, packaged separately) than I've seen in most laptops under $600.* HD webcam.* HD space. This is 750gb. Some other V5's offer 500gb, yet cost more.Cons:* Battery life. 4 cell is far from stellar. The description says \"5 Hours,\" but don't count on it, unless you're an extremely light user with minimal programs running. With heavy use, it's more like 3.5 hours. I think you could probably find a 6 or 9 cell for this and it would increase your time to 6-7 hours, but I haven't looked for one - yet.* Resolution. 1366 x 768 - max, is not great, at all.. However, the only time I can really see the effect of that low resolution is when I'm pinching to zoom in the browser, it can look somewhat pixelated. However, the desktop and programs UI look great, as do videos and everything else.Ambivalent about:Windows 8. I miss the Windows 7 interface sometimes, because the familiarity of the Start button. I use Stardock Start8, which gives you the option of using the Windows 7 or Windows 8 interface, both.Overall: A+", "Date": "August 2, 2013"}, {"Title": "Updated software since previous reviews.", "Author": "Cameron", "ReviewID": "R3F7WGUDFCA3YU", "Overall": "5.0", "Content": "I took a gamble on this laptop because it seemed that most reviews on any version of this laptop comments on broken wifi.The reason I took the gamble was thanks to another review that stated how to fix the wifi issue, but luckily when I received my Acer Aspire it worked fantastically out of the box.The first time you power it on it takes awhile to setup the files, but that's to be expected.Once the initial setup is finished everything is good to go. Wifi works fantastic. I had absolutely no issues with it.The touchscreen is awesome and I truly had no idea how much I would enjoy it.The backlit keyboard is fantastic.This is not a gaming computer! Don't go in thinking all your supposed game should work. Just a disclaimer.The only two issues I've had are:1. The battery isn't as nice as I would like. I probably get 3 hours of heavy use. I still haven't looked into an extended battery.2. About once a week you should completely restart the laptop to free up all your volatile memory.Overall, I completely love this laptop. I'm on it right now typing this review. It actually works so great that, even though it's 3 months old, I still haven't transferred even half of my files over because it's just so great out of the box.", "Date": "July 7, 2013"}, {"Title": "Works Perfectly!", "Author": "D J", "ReviewID": "RBW7JZLW7O0AF", "Overall": "5.0", "Content": "Set up, performance, and yes WiFi all work flawlessly - out of box without any driver updates.  I'm not sure why some are claiming major WiFi issues, but I have had none.  For the price, I don't think you can beat its performance.  I also downloaded Microsoft Office 2013 Professional and all is good.  Again, it to works flawlessly.  I have been a Dell and HP fan in the past but it seems their build quality has dropped for their lower end models while Acer is trying to grab some market share and it shows in the quality build of this model - again not sure why some are complaining here either - my daughter compared it to Apples $1600 laptop, in build quality.  I don't typically write many reviews but I'm so impressed with this purchase, and almost didn't buy it because of the somewhat negative reviews.  I just don't seem to have any of the problems others have claimed.  Good luck with your decision.", "Date": "July 27, 2013"}, {"Title": "Best Laptop Under $600 Anywhere", "Author": "Kerry W. Frye", "ReviewID": "R2PJJ7975TUY96", "Overall": "4.0", "Content": "This machine is a beast for the money.  Loads of RAM and spacious hard drive, laser-quick I5 Ivy Bridge (new technology) processor, backlit keyboard, touch screen, and much, much more.  Incredibly slim and sleek-looking, and easy setup out of the box.Like some other users, I had an issue with Wi-Fi drops out of the box, but a quick update of my Wi-Fi driver completely cured this issue.  I've had the machine for over a month, and have had zero other functionality issues.If you're looking for a monster of a budget laptop, I've done all the research for you.  This is your baby...", "Date": "July 21, 2013"}, {"Title": "Good except for the wifi, which does have a imperfect solution", "Author": "Xiaofan LIN", "ReviewID": "RGPN01FM6NVO5", "Overall": "4.0", "Content": "The product largely does what it's expected to do: CPU is fast, integrated graphic chip is good for non-gaming applications, and touch-enabled screen goes well with Windows 8 Metro interface. Out of the box, wifi indeed is not stable (obvious compared with other devices connected to the same network: changing to \"limited\" connection and then coming back after some time). Installing the latest driver from Acer's support website has solved the wifi problem, but the bluetooth no longer works. Since I use wifi all the time while seldom connecting to a bluetooth device, it seems to be worthwhile trade-off for now. Hopefully Acer can introduce a patch that can make both wifi and bluetooth reliable.", "Date": "May 9, 2013"}, {"Title": "Keep it...if you don't mind using wired internet access (Acer Aspire V5-571P-6831)", "Author": "Johnny", "ReviewID": "R1QMRDN81TQBBF", "Overall": "3.0", "Content": "I bought this product at my local electronics store.  I have no major problems with this laptop, but the wireless adapter seems to fail constantly.  I have connected to my wireless router 37 times in the past 3 hours.  I have search Acer forums for answer, but most other customers are experiencing the same problem as me.  Seems Acer has not found a solution to the wireless issues that me and other customers have already experienced.  I will be returning this laptop due to constant dropped internet connections via wireless access.  Other than that, I think anyone else can enjoy it,but if you don't mind hard wiring it to your router for internet access...then you'll do just fine.", "Date": "March 27, 2013"}, {"Title": "Light and fun", "Author": "Jose Colon", "ReviewID": "R1RPYGZ1F6BQEB", "Overall": "4.0", "Content": "I needed it a new computer for work. This offers a lighter version of previous Acer that I had for years. I like the new touch feature.", "Date": "January 23, 2014"}, {"Title": "Best laptop in the $600 range!", "Author": "509fisherman", "ReviewID": "R1O3MC095BE04S", "Overall": "5.0", "Content": "I have had this laptop for 4 months now and it's absolutely amazing! This workstation can easily compare to $900 laptops from other manufacturers!Pros: Intel core i5 (middle of the road, but hard to see in inexpensive laptops still), Graphics card, 6gb RAM, 750gb storage, boots in a reasonable amount of time.Cons: Battery life, need to update wi-fi drivers out of the boxAs mentioned before the wi-fi issue can get pretty annoying but once you update the drivers it works like a champ. Do not expect to get 5 hours out of the battery life, but for the boot speed and the performance I'm getting, it's a sacrifice worth taking.*would recommend a ssd for even faster boot times!", "Date": "January 6, 2014"}, {"Title": "So far it's great!", "Author": "Aaron Misuk", "ReviewID": "R1AAJZMV98MCE0", "Overall": "5.0", "Content": "I originally bought a Toshiba 1.4 GHz POS...it was a great laptop if I just wanted to stare at the desktop (it lagged even bringing up the control panel), so I took it back immediately and got this. After finally resolving the aforementioned issues w/the wifi (which dropped every one minute) which I had to download the update for 30 minutes on my desktop PC, burn to PC and install, this thing works perfectly. No wifi problems at all. Very fast w/no drops.As far as performance, I ran multiple programs while looking at the processes tab, I watched it just from about 1 to 2.7GHz continuously. So far it's handled everything w/no lags at all. Touchscreen is good.Two things that are a little annoying are Windows 8 and the touchpad. Windows 8 is just new so you have to learn it, and as far as I can tell, just about all laptops have touchpad issues, so I don't hold it against the laptop or Acer. Price was good, shipped past and packaged well. Happy!", "Date": "October 12, 2013"}, {"Title": "Still the WiFi", "Author": "jcreedon", "ReviewID": "R112FCISPDMPA4", "Overall": "1.0", "Content": "Pros:  I don't know yet because I can't get past the wifi issues.Cons:  A laptop without wifi is a horrible desktop and since you need a dongle with this laptop that doesn't come with it, then that makes this laptop a really expensive paper weight.I have tried everything in the forums as well as in other reviews here and mine still won't connect.  I contacted Acer and they had me do a recover WITHOUT telling me that it would create a new install and put everything in the Windows.OLD folder, so now I get to redownload MS Office 2013 while tethered to my cell phone.  What a piece of junk.  I think this one is going back.  I'd rather spend an extra $20 for a Dell that will connect out of the box.", "Date": "September 21, 2013"}, {"Title": "It does what I need it to do", "Author": "Paperflower", "ReviewID": "RQZXAC2WWPMTC", "Overall": "3.0", "Content": "This product does what it needs to do to get the job done. It is a lot slower than what I was using (a borrowed Mac air) but you get what you pay for, and it is a good basic computer. The touch-screen can be finicky with web-sites, sometime working great and others requiring the mouse do make selections. But it works hard and is working well and if you want fun and fast get a Mac.", "Date": "September 15, 2013"}, {"Title": "Still getting used to it.", "Author": "Gerry Schomisch", "ReviewID": "R13N9TNBI2WR50", "Overall": "4.0", "Content": "Went from Windows XP to Windows 8 on the new lap top. The computer works great. Still need to figure out how to get the mouse to scroll down when I swipe down, instead of the opposite. I am right handed and having the mouse biased to the left side of the key board is a big pain in the rear. I am constantly activating the start screen.", "Date": "September 6, 2013"}, {"Title": "Some glitches that should not be there", "Author": "cagey", "ReviewID": "R3HYUJ9T4VTTER", "Overall": "3.0", "Content": "This laptop is OK, but there are issues with it.  The touchpad is overly touchy, sensitive, and glitchy, even on its least sensitive setting.  For example, when using it to move to an icon, if you pass over other icons, it might click on them and open up those programs.  While typing this review, my hand brushed the touchpad and I lost the review page, and had to start over.  Others have complained about constantly losing their wi-fi LAN connection.  I found that I lost mine about once/day.  My previous six year old laptop never lost its connection.  I have just loaded a new wi-fi LAN driver from Acer's website, but it is too soon to know if it solved the problem.  Acer's website provides no instructions on how to install new drivers. Both of these items, the touchpad and the wi-fi LAN driver, are mature technologies, and anything less then their working perfectly are inexcusable.Because the laptop is so thin, it does not have room for an Ethernet port.  The machine comes with a flat connector/adapter that fits into a port on the side of the computer.  The connector divides into an Ethernet port and a port for an external monitor.  If your travel, this adapter is one more thing to forget or lose.", "Date": "August 24, 2013"}, {"Title": "WiFi", "Author": "BALRAM RAMDATT", "ReviewID": "R2Q5XLSOB7NAYR", "Overall": "2.0", "Content": "This computer drops the wifi connection frequently...i wish i knew about this problem before i bought it, if its connected to the LAN it will work fine.", "Date": "August 10, 2013"}, {"Title": "Good machine for students, staffs", "Author": "Hunter", "ReviewID": "R3W0WHVOE1LLM0", "Overall": "4.0", "Content": "I try this machine and feel comfortable with profession work. It's really good for student, staff. But the battery always around 3 ~ 4 hour. With some applications and games need a strong processor, 6GB DDR3 is not enough. I prefer Acer Aspire V5-571P-6698 than Acer Aspire V5-571P-6831 because of the larger memory. You will never use full performance of 1.8 Ghz core with 6GD DDR3. Trust me !Beside, Acer is the famous brand, I bought many acer laptop for my students and feel ok with Acer's machines.Acer Aspire V5-571P-6831 : $598.00- 1.8 GHz Core i5 3337U- 6 GB DDR3- Item Weight: 5.5 pounds- Top ### Not AvailableAcer Aspire V5-571P-6698 : $529.99- 1.5 GHz Core i3-2377M- 8 GB DDR3- Item Weight: 5.3 pounds- Top #29 in Best Seller notebook(Amazon)You can look Acer Aspire V5-571P-6698 with special discount here:B00CHGNCZ0", "Date": "July 20, 2013"}, {"Title": "Wifi Connectivity Issues", "Author": "Ashley Robinson", "ReviewID": "R3VJM8BNAW7MIJ", "Overall": "3.0", "Content": "I like everything about the computer except the wifi connectivity issues. It worked perfectly on the first day. On Day 2 and Day 3  I see that the wifi drops like 5 times an hour. Really annoying. Wifi connectivity is a basic necessity for a laptop. I'm most likely going to return this computer. Shame.", "Date": "July 26, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AVYPON8"}}