{"Reviews": [{"Title": "A perfect entry level laptop by the boys at Samsung", "Author": "Benjamin Valley", "ReviewID": "R3H4UJ9Q9R6ZC8", "Overall": "5.0", "Content": "It's cheap, has a camera & mic, DVD/CD recorder, 2 cores, a decent 320 gig hard drive, wireless, 4 gigs of ram, and the newest version of windows. Nuff said. everything works great. The only other person who rated this rated based their review on the seller. I hate when people do that. Even if the battery did fail, the manufacturer warranty guarantees it. Plus I have always big a supporter of Samsung products. Most of my electronics are Samsung.My first laptop was a Dell. It cost me $1,500, and absolutely died in 2 years. Now all I get are these simple cutting edge entry level laptops, and I highly  recommend them. Unless you are a gamer, these do absolutely everything you would ever need. The meat and potatoes of laptops.", "Date": "July 30, 2013"}, {"Title": "Everything I Need", "Author": "Anne Gusmano", "ReviewID": "R2YZKR7Y0MHTTU", "Overall": "5.0", "Content": "I bought this laptop a few weeks ago after returning an HP model that I was disappointed with.  I'm just a retired lady who likes to email, search the web, play a few games, store photos, and compose the occasional letter, and this laptop does it all for me.  What I like most about it is its speed--no waiting for a page to load.  It has Windows 8, which I just updated for free to 8.1, and after a day or two I adjusted to the way that works.  It's just a very user-friendly, quick-operating, simple laptop with all the features an amateur like me needs, at a very reasonable cost.", "Date": "November 20, 2013"}, {"Title": "Great!", "Author": "Heidi LaFleur", "ReviewID": "R2OH65A1JANA50", "Overall": "5.0", "Content": "So far I have had little to no problems with this laptop. The sound quality is amazing, camera could be a little better. Otherwise, this was a great choice, it was within budget and I can game on it (you DON'T have to pay 1,000$ for a gaming laptop xD).", "Date": "March 20, 2014"}, {"Title": "Good computer", "Author": "Maria del Carmen Mijares", "ReviewID": "R1PLM3TOAG6YR1", "Overall": "4.0", "Content": "The computer is beautiful, it more than expected but no Microsoft office. Purchase is sepparate. Everything is is ok. Its a good buy", "Date": "February 16, 2014"}, {"Title": "BAD, AFTER 5 MONTHS distorted the VIDEO", "Author": "Jose Luis", "ReviewID": "R1LSBENBA8FMWW", "Overall": "1.0", "Content": "I'm from Ecuador and I requested this product for Amazon.There is no doubt that the product is good time for the video worked smoothly everything was correct.Internet one day sailing off the laptop as usual, the next day the video it looked distorted.I am a systems engineer, check equipment without affecting the warranty.reset the device to factory settings in the BIOSdrivers reviewupdate the BIOSreinstall the operating system (I knew that would not affect, but I did)nothing worked.connecting to a crt monitor and only the photos and videos were seen wellconnect it to my TV via HDMI sony and so only the photo and video were seen and the colors are distorted.I contact the seller to see if it is responsible for a failure in the video card and the monitor of the laptop itself.not coming back to buy a samsung computer.", "Date": "December 10, 2013"}, {"Title": "windows", "Author": "Andra Vacar", "ReviewID": "R1UE00LP8V6YJ0", "Overall": "4.0", "Content": "Windows 8 is not the best option for a leptop without touch screen... Should be better anouther version of windows!", "Date": "October 27, 2013"}, {"Title": "Battery failure", "Author": "S. Kidd", "ReviewID": "R3RWA05S6L7ON6", "Overall": "2.0", "Content": "Set up was easy, but the battery failed right out of the box. I called the service desk and chatted several times with a rep, but to no avail. Nothing they recommended worked...the battery was worthless. I mailed the computer back to a Samsung authorized repair shop in Texas, because they wouldn't mail me a new battery. I hate red tape. Now I just hope the computer comes back without any flaws, but nevertheless, I have to reinstall all my third-party software all over again!", "Date": "July 26, 2013"}], "ProductInfo": {"Price": "$561.56", "Features": "Windows 8 (64-bit); Microsoft Office Starter 2010, Norton Internet Security (60 Day Trial)\nIntel Core i3-2370M Processor (2.4GHz)\n320GB HDD with 5400 RPM\n4GB (2GB + 2GB) with DDR3\n15.6 LED HD Matte Display, 16.10 Ratio, 1367 x 768 Resolutin, 220 nits Brightness", "Name": "Samsung Series 3 Np300e5c-a06us 15.6-inch Laptop I3-2370m 4GB DDR3 320GB HDD Windows 8 64bit Blue Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/41cVdrXA3-L._SX300_.jpg", "ProductID": "B00ANHD05M"}}