{"Reviews": [{"Title": "Effective & Affordable Windows 8 Laptop (READ BELOW FOR AN IMPORTANT ANTI-VIRUS TIP)", "Author": "Michael Yovkovich", "ReviewID": "RKZVEFJUR8H6", "Overall": "5.0", "Content": "My company has used Dell workstations for as long as I have been employed (which is nearing the 10 year mark), but this was my first venture into the world of Dell laptops, so I wasn't sure what to expect from this affordably priced offering. First off, the specs are impressive for such a low-priced laptop. 4 GB's of RAM, 500 GB's of storage, 1.8Ghz processor, and a middle of the line nVidia graphics card is a steal of a deal at the current price Amazon is selling this laptop for. The first thing you'll notice that might make your eyes pop is the shipping weight of 7.8 lbs! Fear not though, I put this laptop on my trusty scale and the results came back as 4.2 lbs (.4 lbs lighter than advertised). I also have a 13.3 Macbook Pro with Retina Display, which weighed in at 3.4 lbs. So if you're looking for a laptop that you'd like to do a lot of traveling with and you can afford paying almost three times as much, you might be better off looking at a Macbook or a Macbook Air. If you can't afford jumping up to the price of an Apple, this laptop will still be very convenient to tote around as it is very slim and sleek.Setting up this laptop was extremely easy, as I was able to immediately connect it to my home WI-FI system. This was my first experience with Windows 8, and I must admit it was a bit jolting, but I was able to get used to it after a while. The next paragraph I'm about to type is by far the most important and useful one to read, so if you're going to ready any paragraph, please read the one below.This computer came with a trial-version of McAfee anti-virus software. That means that you get the software for a trial period, but then you have to pay for it in order to keep getting virus definition updates. Let me save you a lot of time and money, DELETE THIS FROM YOUR COMPUTER AS SOON AS YOU SET IT UP. This sounds extremely backwards, but let me explain. Microsoft has been providing free anti-virus software for Windows users for years via download. The software is called Microsoft Security Essentials, and is superior to all third party virus programs in the way that its free and also that it comes straight from Microsoft, who is always the first company to know when an issue has come up because the issue involves their own software. Companies like McAfee and Norton get their information from Microsoft, so there is always a lag. For Windows 7 and prior, you would need to download Microsoft Security Essentials in order to get the anti-virus protection, but with Windows 8, it is already installed via a beefed up version of Windows Defender that includes Microsoft Security Essentials. The trick is, and this is important, you have to remove any third party anti-virus program before being able to turn on Windows Defender. Microsoft had to do this in order to avoid getting sued by the big anti-virus companies, but make no mistake about it, YOU DO NOT NEED TO PAY FOR ANTI-VIRUS PROTECTION EVER AGAIN. Uninstall whatever was installed to begin with, re-start your computer, and turn on Windows Defender and you will be set. Anti-virus rant over!I've been using this laptop for the past several weeks and could not be happier with it. The screen resolution is impressive, and the built-in webcam works great for Skyping. In the past I have been impressed with Dell for the workstations I've used at my company's office, but now I can appreciate them even more for creating a high quality affordable laptop.", "Date": "May 2, 2014"}, {"Title": "Awesome Dell Windows 8 laptop!!!", "Author": "Biswajeet Satapathy", "ReviewID": "R1DZIRDVZU34UN", "Overall": "5.0", "Content": "I was looking for a laptop mainly to browse and for multimedia purpose and found this inexpensive built-like-a-tank Dell XPS 14. I am very impressed with the build quality, stunning looks and there is absolutely a very nice feel to it. I have many MBPs at home and this one is better in appearance and worked out of the box with minimal set up. I was up and running in 10 minutes or so.I found the touch pad not up to par with Apple track pad but with the latest driver update it came pretty close. I uninstalled the McAfee software and went with Norton security as it comes free with Comcast. There is a new BIOS update from February 2014 and also audio driver update that you may want to apply immediately. Do the WiFi-BT update as well.Pros:- Audio - beautiful sound even better than some of my apple gadgets - no need for a separate DAC- Nice back-lit keyboard- mini display port is handy - i am using the HDMI port with my Samsung monitor- Handles multitasking handily - this is clearly the intention at this price range - not a gaming laptop- Skype works great- Netflix movies plays in hi-def and streams flawlessly without any hitch- Strong WiFi signal throughout my house - both 2.4 GHz and 5 GHz work good with strong signal- Runs cool. Doesn't get hot unless you go gaming with it  - fan is loud as well when you do that- Features at this price point - I paid $629 plus sales tax from amazon.com- Battery is good and lasted for more than 5 hours with my documentary watching and it still had 35% charge leftCons:- Not enough memory - I am constantly noticing memory at 75% - I have ordered a 8 GB module- Not for heavy gaming - although Portal 2 played pretty well with a slight lag - this is the only game I tried- Display - is already known for narrow viewing angle - I am OK with it since I have connected this to a Samsung monitor which serves my purpose and it wasn't any inconvenience when I watched a documentary series with XPS 14 on my lap - viewing angle was just fine- Not enough USB port - there should have been one on the rightThis is an awesome laptop for general mass and clearly not for heavy gaming but light gaming should be okay. Windows 8 is awesome. Don't get stuck with old Windows XP and Windows 7. There are no driver issues at all with Windows 8 and there is only slight learning with Windows Metro. I have two systems with Windows 8 now and my kids love it.Hope this review was helpful!Jeet", "Date": "May 9, 2014"}, {"Title": "Great Windows 8 machine!", "Author": "dottyyyy", "ReviewID": "R381TFRYEJ9XID", "Overall": "5.0", "Content": "This is an initial, first glance/use review. I will hopefully update it in a few months after continued, heavy use. Ihave had it for 5 days, and this is my impression.Initially, out of the packaging, it is a sleek, minimal looking machine with very nice specs. In a world with countless laptops and configs, this is a nice middle of the road laptop for a fair price at $650.The laptop does boot/hibernate/wake/sleep very fast, which is nice. The track pad is very nice for a pc, not the same as the macbook, but close, and I find it to be intuitive, and easy to use. The battery is impressive for a pc, and I am able to get a solid 6 hours out if, which I appreciate, although you have to alter a few settings.The screen is nice, and does have limited viewing angles, but I find that to be minor as I usually sit directly in front of it.Windows 8 is nice on this machine, just learning it, but am doing so fast.I recommend and 8GB ram upgrade to use it to max potential. It only has one slot up to 8GB, so be warned. I got a 1 x 8 GB crucial stick and it is working great.The performance is great for day-to-day basics, and light gaming, and all MS Office applications.I have also installed Photoshop and will update to let everyone know how that works.I love this laptop for the price (i paid $649), and would recommend it for the money v. performance factor.It is very sturdy, but still light enough for carrying/traveling. I am impressed with Dell and the product they put out on this machine.", "Date": "May 12, 2014"}, {"Title": "Wonderful laptop; though i dont think it really qualifies as an 'ultrabook'", "Author": "Nick Alec", "ReviewID": "R2HGH8GQQCWWIW", "Overall": "5.0", "Content": "I've had this laptop for the past 3 weeks or so now and i really like it. I dont think it really qualifies as an 'ultrabook' based on its specifications but thats up for debate since the ultrabook term is used so loosely now. Either way, this is a good laptop for you if: you want something thin, well built, lighter than the normal laptop, and easily able to do all the normal stuff and maybe some less graphically intensive games and light photo/video editing. That's basically a quick summary; below are my observations from my time with the laptop:BATTERY: This laptop takes quite some time to fully charge. I timed a full charge from 0% to 100% and it took roughly 3.5 hours... and that was with it powered off! I would imagine even longer if its being used at the same time. In terms of battery life; i tested this by setting it to max performance (peak brightness, no display dimming, etc...) and opening Netflix and letting it play a video till it died. It timed in at roughly 4 hours; which is good. My Asus UX31A ultrabook never got me more than 2.5 at high settings. With regular usage and a balanced power plan, this Dell laptop gives me around 6 hours on average. Once again this is quite good. I never tested on the most power-saver type plans because the screen is just too hard to see at those low levels of brightness. Maybe that's how you can get those 11 hours they advertise for this laptop. But 11 hours wont do you much good if you cant see what your doing!BUILD QUALITY: I absolutely love the build quality. It is by far my favorite aspect of this laptop. For an ultrabook it is heavy at 4.6 lbs. But this is probably the most sturdiest and well built laptop i have ever owned and i have owned quite a few laptops. The beautiful aluminum lid, the soft touch coating on palm-rests, a silicon base on the bottom to prevent too much heat from hitting your legs... just overall a great job by Dell on this front. The only thing that could be better is the touchpad. It doesnt always respond to clicks and moves the cursor instead. In fact i had another issue with the touchpad at first; where two finger scrolling would sometimes just cause the page to jump all the way back to the top. I fixed this later on by updating the drivers but the touchpad still sometimes doesnt respond to clicks.GPU: I found this interesting because this laptop does something i had never seen before. Its actually got 2 GPU's. One is an Intel 4000 HD and the other is an Nvidia GeForce GT 630M. It uses these two in a technology called Nvidia Optimus. It basically helps save battery since the more powerful Nvidia gpu isnt used unless necessary.WEBCAM: Worst part of the laptop. Its pretty bad. 0.9 MP on Skype meaning ugly images and i have had some problems with the microphone as well with people on the other side not being able to hear me.HARDDRIVES: This laptop uses 2 hard drives. On mine, one is a Hitachi HTS5450 which acts as the main storage disk. It has 454 GB of capacity and you have 420GB available to you. The other is an Samsung PM8 SSD, which is meant to improve startup times. It does an OK job, i timed it in at 15s from a cold start up. My Asus uses just an SSD boots up in 6-7 seconds. If you leave the Dell on standby instead you can get it back up in about 8 seconds though.OTHER BITS OF INFO: Its got a really cool lightbar in front to show charge status. The ac adapter is capable of 100-240v input. The Windows Index rating is at 4.6 mainly due to the graphics card. Everything else is rated 5.9 or 6.4. The back-lit keyboard is nice, though its only got 3 settings: high, low or off. The AC adapter isnt too big, so it wont add to much weight to your backpack if you take it with you.", "Date": "May 23, 2014"}, {"Title": "Total Lemon! Defective Machine Masquerading as Good Laptop", "Author": "Stewart U", "ReviewID": "R30KAC4T191O1", "Overall": "1.0", "Content": "Made the decision to purchase this laptop due to the fact that it seemed like a deal too good to be true. Well, it was. It's practically impossible to find this much power in a 14 inch laptop at such a low price. As far as being a powerful system, it certainly delivered. For example, Dell put the operating system on a solid state drive, meaning boot times are very quick. The track pad is pretty bad, often skipping around or making other such errors, but the power of the system itself is solid. It should be a great laptop, however my experience has been plagued with difficulties.Day 1 I began having severe issues with the computer. I would crash whenever it came out of sleep mode. This issue culminated in a  hard crash on Day 2 of ownership, necessitating a call to Dell. Customer service was helpful, and eventually after some monkeying with the boot order and installation of a fresh BIOS, that problem was solved.With the crashing solved, I turned my focus to the issue of the incredibly poor wifi performance. The computer would simply fail to connect with any sort of reasonable speed if I left the room the router was in. I ran comparative speed tests on the device from another room, about 30 feet away from the router, and while the new dell was getting less that 1Mbps in download speed, my other devices were able to connect at speeds 10 times greater. Customer Service has been somewhat more difficult in this case, first running diagnostics, then troubleshooting my home router, before finally agreeing to replace the wireless card.Replacing the card didn't work, nor did re-installing the operating system. Now they want to send a new hard drive rather than try replacing the antenna. Dell is flailing. There is something deeply wrong with this model, and if you google around you'll see that this model and the XPS 15 both seem to have issues receiving strong wireless signal which appear to be unsolvable. Personally, I'm done dealing with this nonsense, and plan to return this lemon of a computer as soon as possible.Happily, where Dell has failed, Amazon picked up the slack, and has been very accommodating so far.", "Date": "May 15, 2014"}, {"Title": "slower than molasses", "Author": "adchara p saunders", "ReviewID": "R3LT9J40VTB7RK", "Overall": "2.0", "Content": "computer runs very slow and has trouble staying online and sometimes does not recognize wireless connections available...this product was refurbised and definitely needs to be refurbised again.i have sent this product back and the seller has accepted it.i do appreciate the ease of returning a product that did not meet expectations but i will only buy products that are new from now on", "Date": "June 6, 2014"}, {"Title": "It works well", "Author": "dongwei", "ReviewID": "R2R3GXBH3BPKR8", "Overall": "5.0", "Content": "It works well,and the design of the A surface so cool but easy to be scratched. A little heavy because of metallic meterial", "Date": "June 5, 2014"}, {"Title": "Ok computer, had to have it fixed twice", "Author": "Cilene Farrell", "ReviewID": "RNIM4NX3P4654", "Overall": "4.0", "Content": "The laptop itself is very pretty and light, however after one week of minimal use I got an error message (blue screen) and had to call our IT guy to fix it. It was unable to boot and kept asking me to trouble shoot with no results. He returned it and within two days a different error message came up (Checking Media [Fail].  He called Dell customer support who directed him to a forum on their website which explained how to fix the problem ( [...] ) .  Apparently it's a software problem, not the hard drive as we first suspected.  Very happy I didn't have to return it to Amazon or Dell, as I'm overseas and that would've been more trouble than it was worth. Overall the laptop itself is very nice, I took away one star for the issues I've experienced.", "Date": "May 26, 2014"}, {"Title": "LIKED", "Author": "Rafis Gizatullin", "ReviewID": "R2XPLS6K0B0DVK", "Overall": "5.0", "Content": "Strong unibody case, bright screen, ultra low core cold processor - I like this laptop! My girlfriend wants the same laptop now.", "Date": "May 23, 2014"}, {"Title": "I Don't like it", "Author": "jesus uzcanga", "ReviewID": "R2FYY66XWRRF6C", "Overall": "2.0", "Content": "First the touchpad is very bad. Always back to top (jump) when i scroll 2 fingers in any page.Second I spent about 6 hours troubleshooting a Rapid Start technologie... My Laptop dont start because the system say \"NO OPERATIVE SYSTEM....\" My solution was disable this function.Finally the firewall (antivirus McAfee) don't start. I'm unprotected.Recomendation: Don't buy this laptop.", "Date": "May 19, 2014"}], "ProductInfo": {"Price": "$1,099.99", "Features": "3rd Generation Intel Core i5-3337U Processor (3M Cache, up to 2.7 GHz)\n4 GB DDR3 RAM\n500 GB 5400 rpm Hard Drive\n14.0-Inch Screen\nWindows 8", "Name": "Dell XPS 14 XPS14-1909sLV 14-Inch Ultrabook (Silver Anodized Aluminum) 2013 Model", "ImgURL": "http://ecx.images-amazon.com/images/I/41dO-9QIdDL._SY300_.jpg", "ProductID": "B00ANG3T1S"}}