{"Reviews": [{"Title": "I liked this product", "Author": "ullas vishwakarma", "ReviewID": "R19WVS3KQRTBEE", "Overall": "4.0", "Content": "I did online research lot before buying this.  You will find very few good 14\" laptops in this price range and also very steep increase in price as one move from 15\" to 14\" with same configuration. Of course one can get better configuration with 15 inches in this price range. But I didn't liked bulky 15 inches laptops much with my previous experiences. I wanted something smaller. I got this delivered with perfect condition. It works marvelously and flawlessly. Bright screen. Flawlessly fast. I like the look of it. Just the one I wanted. It is so light and slick. Battery lasts longer. Had not much problems since I bought it 8 months before. The only small problem I faced till now is that time to time internet connectivity fails. But may be this is because of my router itself. But overall I am very much satisfied with the product.This is one of the best 14 inch laptops in market in this price range!", "Date": "May 26, 2013"}, {"Title": "The window 8", "Author": "it's not minectaft it's minectaft", "ReviewID": "R25KQFUFK10B4I", "Overall": "3.0", "Content": "I've owned this type of laptop for almost two months now and so far so good. The only thing I hate about this laptop is that it comes with window 8. I have three window 7 and two window 8. Window 8 is not as good as window 7. Another problem is that the wireless disconnected more often than my other window 7. I'm still waiting for Microsoft to update window 8 to see if it works better or not. Will not buy computer with window 8 any more, but will wait for window 9. Any way, I still in love with windows...Thanks,Kneng", "Date": "July 17, 2013"}, {"Title": "DO NOT BUY THIS JUST SAVE YOUR MONEY", "Author": "Walter R. Ginther \"BBQ Walt\"", "ReviewID": "R32Z0I69SJTCVY", "Overall": "2.0", "Content": "I bought this product from Frys and I was told just how great it was by a Sony associate. Now the thing that sold me was the i5 processor and this computer was on sale for the same price as computers w/ only a pentium or i3. This computer sucks, I've had it for a month and immedietly i noticed a loose 4 key. Luckily sony can come to my home and fix it but its still iritating. The case is awful, it gathers fingerprints more than any other computer i have ever seen. It gets dirty really easy and the track pad is a flimsy piece of crap. The \"HD\" webcam is no better than a damn 1.3 mp camera in a cheap cell phone. My 12 dollar phones camera looks better than this crap. I would not recommend this product to anyone just save your money and go with HP. ALSO WINDOWS 8 SUCKS", "Date": "June 6, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core i3-3120M Processor (2.5 GHz)\n4 GB DDR3 RAM\n500 GB 5400 rpm Hard Drive\n14-Inch Screen, Intel HD Graphics 4000\nWindows 8, 6-hour battery life", "Name": "Sony VAIO E Series SVE14132CXB 14-Inch Laptop (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41NzhR9SjAL._SX300_.jpg", "ProductID": "B00AW4NZ7E"}}