{"Reviews": [{"Title": "Great affordable laptop for under $200!", "Author": "Brian O' Connor", "ReviewID": "R2URR7MQ48IP5H", "Overall": "5.0", "Content": "I waited in line at Black Friday for 2 hours for the laptop and the wait was worth it! This is my 1st laptop and it is amazing for the price! Setup was a breeze and within 30 minutes of boot up, I was already using it. Boot up time is lightning fast only taking 12 seconds! Windows 8 takes some time to get used to, but there is a guide with the laptop that explains the process to you. Battery time is decent lasting 5 to 6 hours of heavy use or up to 3 days in standby time. Wi-Fi works great with this laptop and the internet is lightning fast! You can also switch from a  Windows 8 to a Windows 7 mode by clicking this application called Desktop. I haven't had a single problem with this laptop in the 2 weeks I have had so you can tell that is a quality machine. Great laptop for only $179, and is highly recommended that you get the 2 year warranty from Walmart for only $19. The laptop itself comes with a 1 year warranty and with the warranty from Walmart, it will bump it to a 3 year combined warranty.Also, if you wish to upgrade the RAM, please be aware that there is only one DIMM slot for the RAM, and the RAM can only be upgraded to 8 GBS of ram. Happy laptop hunting and have a nice day!P.S. This particular laptop has a turbo-boosting technology that will bump the processor to clock at 1.20 GHz and above, when performing certain tasks such as gaming. This is extremely useful when performing many tasks at once.Update: I have been using this laptop for about 2 months, and still working like a champ! There have been zero problems with this laptop, except the annoying notifications for Windows updates, which just ask you to re-boot your laptop to start the update. Other than that, this laptop has been working great. I highly suggest that the upgrade the ram to 8 GBS, as this will pay off in the long run. Have a nice day.", "Date": "December 6, 2012"}, {"Title": "Memory slot accepts 8GB RAM", "Author": "blksix", "ReviewID": "R2QU95KNZ01TW2", "Overall": "5.0", "Content": "I upgraded my wife's laptop and in fact it only has one memory slot. Typically stores will not carry the single 8GB ram chip so I looked and found it at Best Buy. I had it shipped to the store which was free and cost about $40. I have had no problems with this memory upgrade and the computer is very fast and my wife loves it. Overall it was well worth the money and for the people that say that the specifications are lies on the memory slot i agree but on the processor speed they need to understand that it works like intel chips. They also have a boost feature that will automatically overclock the processor depending on your needs. It will not boost it to the 1.3ghz if you are checking your email. Hope this helps.Patriot Memory - Signature 8GB 1333MHz PC3-10600 DDR3 SoDIMM Laptop Memory", "Date": "January 4, 2013"}, {"Title": "Great for the price!", "Author": "Victoria", "ReviewID": "RCSRPSSAJX1TW", "Overall": "5.0", "Content": "I bought this computer on black friday for $179 and 9 months later it is still going strong. I have had really no issues with it at all. I put this computer through hell and back and it is still working great. My last computer was an Acer and I paid $300 for it and i had to replace the screen 3 times because it kept cracking, but with this compaq, i am known to drop laptops a lot and i have dropped this one several times and the screen has never cracked. The speed is okay, and the memory is okay but i wasen't expecting greatness when i paid for it. So i highly recommend this computer to anyone.", "Date": "July 19, 2013"}, {"Title": "Bait and Switch", "Author": "wise8ddm", "ReviewID": "R3180ANUCVVDQX", "Overall": "1.0", "Content": "I stood in line on Black Friday to buy the Compaq Presario Cq58-bf9wm for 4 hours. When I got the computer home, I opened it up to add more RAM;1)there was only one dimm slot when there should be 2.2)I upgraded to a 4gb of RAM and it made the computer freeze and constantly reboot.3)The processor speed is suppose to be 1.33GHz and it's only 1.0GHz.Those are some of the things I noticed and asked my Brother-In-Law to check his out and the exact same things, he even went as far as to say that it is a different mother board as well.Bait and Switch", "Date": "November 26, 2012"}, {"Title": "about loation of second memory slot", "Author": "viper71285", "ReviewID": "R3NE7F4U4CI4WF", "Overall": "1.0", "Content": "There is no second slot for memory as advertised. a whole discussion about it is located here at the following link  http://www.amazon.com/forum/laptop/ref=cm_cd_fp_ef_tft_tp?_encoding=UTF8&cdForum;=Fx2G99T61XZXSS7&cdThread;=Tx36ZK8NFC9EMIS", "Date": "November 26, 2012"}, {"Title": "was ok", "Author": "t g", "ReviewID": "R1Z6EIW685ZCNY", "Overall": "3.0", "Content": "it was ok that about all i have to say not the best but but i can live with it it just was not on time", "Date": "April 14, 2014"}, {"Title": "compaq PC", "Author": "Matthew Spayd", "ReviewID": "R7IV0M6CL2XLV", "Overall": "5.0", "Content": "Very affordable. cool looking once your apply to your controller. Would recommend to anyone looking to spruce their system up.", "Date": "December 26, 2013"}, {"Title": "Good product", "Author": "Dacx Jernigan", "ReviewID": "R2BF0IPSJU50KI", "Overall": "5.0", "Content": "Good quick , quality it's like it was brand new good seller will do with guys again you won't regret itGreat8888888888888888", "Date": "December 6, 2013"}, {"Title": "ITS WONDERFULL HOW...", "Author": "Mario Martinez", "ReviewID": "RLU4S7NESXIQ2", "Overall": "2.0", "Content": "I loved how it didnt have any of the drivers nescssary and how its packaging looked like a 5 yr old packed it and I love love the incorrect drivers installed... tho I found someone who could help me because if i hadnt i would be stuck with a big peice of plastic...", "Date": "February 27, 2013"}, {"Title": "Great computer", "Author": "Heidi Buffalo", "ReviewID": "RIH49YDTLZQTH", "Overall": "5.0", "Content": "I waited in line for 3 hours at walmart on Black Friday for two of these bad boys for the price you can't beat it they are very good laptops  and the hardware is great", "Date": "November 25, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00A2T9ZNW"}}