{"Reviews": [{"Title": "A very decent low end ultrabook.", "Author": "Benny G", "ReviewID": "R2YB7JET4V3DJS", "Overall": "4.0", "Content": "I purchased this hp pavillion sleekbook on black Friday at staples which costed me 299.99.  Its not bad,  very light and the windows 8 os is very responsive with the sleekbook touchpad.  Note this computer does not come with a touch screen and no cd rom drive.  It comes with bells and whistles like bluetooth hd webcam and 3 hour battery for internet use. Off internet the battery last for 4 hours.  Last an hd screen display.  This is a decent laptop if your looking to do productivit and lite media editing and nothing to heavy.  I dong give 5 stars but I will only give it a 4 stars.", "Date": "January 13, 2013"}, {"Title": "Decent laptop, good value", "Author": "Gregory J. Pearson", "ReviewID": "R2Q5CR4YPNMHML", "Overall": "4.0", "Content": "Not too impressed with Windows 8.  I really miss the \"start\" button.  However, that's a Microsoft issue, not HP.  The integrated camera works well, no problems with any of the video features - kids constantly watching Youtube. Extra USB slot is nice - comes with 3.  Miss a DVD drive for the kids, but most of the movies they watch today are digital downloads.  I actually bought two of these - one for each son.  Very satisfied, the only reason I didn't give 5 stars is the missing DVD drive.", "Date": "May 16, 2013"}, {"Title": "Sweet Semester Relief!", "Author": "Hersom", "ReviewID": "RG9LMXGGEBM7C", "Overall": "5.0", "Content": "This is my second HP laptop and I am not at all disappointed. I Thought I saw the separate number pad but it is not in this laptop, which is ok, because this laptop is super! It is very light compared to my last one and very sleek look. The camera works well. The set up is easy. Still working on what the life of battery is [I am doing a personal study with multiple trials to do this, I will update later]. The sound is crisp and clear but still not loud [kinda a bummer]. The Bluetooth is great! I much more prefer the Bluetooth capabilities than a CD/DVD drive [which doe snot come with this model]. The description clearly states there is no CD/DVD so be advised. Plus the only negative review on this product is simply that of someones own mistake(s) when shopping. The Bluetooth is easy to set up and use. I enjoy sending pictures to the computer from my phone, using the computer as a speaker phone while I am doing my homework or taking quizzes. This allows me to just connect via cell phone and jam instead of taking extra effort to upload music or even popping in a CD [which cannot happen with this model :P ] It is just conveniently. Love this product.For clarification: This is my second HP in 5 years. This was not a product or brand problem, the brand has been wonderful to me so far! [the story:] My other one was plugged in at the kitchen table so I could work on a final paper and watch my kids paint and when I was getting them their drinks my oldest son tripped over the cord and I was unable to brace the fall and my previous laptop screen shattered beyond use. It was a suck fest. I have tried a few other brands only to be an angry/psycho scholar who had been screwed during finals/midterms [that happened 3 times]. SO I am biased towards HP now, simply because they have provided me with great products :)", "Date": "February 12, 2013"}, {"Title": "Light and Nimble on its Feet", "Author": "J. Bondy", "ReviewID": "R1ZYB9CV849HVN", "Overall": "5.0", "Content": "This 14-b031 Sleekbook is light and nimble on its feet. After using it for a couple of months a more balanced review can be given. Facing the new learning curve of Windows 8 focused my attention on the operating system rather than the computer. Once Windows 8 had been learned the Sleekbook has some neat and nimble features.  First the weight is much lighter than my former laptop. This makes it nice to travel with. Open the lid and it starts up very quickly. The smaller 14\" screen has been no hindrance. The keyboard is nice too, it seems just right. It never seems to run hot in my lap with HP Coolsense. It is my hope that I never have to use the HP Protect Smart for dropping it. However, packing a laptop around increases the risk of being dropped.  The general features of being light weight, price, and amble work capacity, makes it an all around machine that does all I need to do.", "Date": "June 17, 2013"}, {"Title": "Another Grrreat Product", "Author": "Great Smooch o Reno! \"Quality Is Everything!\"", "ReviewID": "R1LX7CP805ENAP", "Overall": "5.0", "Content": "I love my new HP pavilion laptop 14-b031us Sleek book computer!  It's amazing and working great! I'm getting us to the keyboard set up fairly quickly and getting better at each day, it's actually really easy to use.  That's how I like my computers anyway!Thanks  HP!!This is awesome product.", "Date": "February 21, 2014"}, {"Title": "Great Laptop", "Author": "Nyree Cabrera Lugo", "ReviewID": "R3G3Q9YKNFEXBP", "Overall": "5.0", "Content": "My husband is that tech savvy so this was bought for him and I must say I love it.  It is very sleek, light weight, great battery life.  The camera for video chat is very clear.  Quick start up, and I can have multiple windows open and still have the speed no slow down.", "Date": "May 9, 2013"}, {"Title": "glad", "Author": "tommy Fournier", "ReviewID": "R388040S3H35R8", "Overall": "5.0", "Content": "i'm writeing on this laptop  right now it is a good one and it works fine just wish I could fine spell check", "Date": "December 17, 2013"}, {"Title": "Excellent light weight Sleekbook.", "Author": "PL.G", "ReviewID": "RCVWXL7J7D5G2", "Overall": "5.0", "Content": "I bought this HP Pavilion 14-b010us 14-Inch Laptop Sleekbook (Black) during Black Friday Sale. It is very light, only 4 Ib weight,  to carry around easily. I also bought HP 14.5-Inch Notebook Sleeve - Black Link Pattern for this sleekbook from amazon.com which works very well with this sleekbook . Both these products meet all of my requirements. This is excellent laptop for everyday use and I find it very easy to set up and very  easy to use. I am fully satisfied with it. This is another excellent product from HP. It also works very well with my HP deskjet Printer.", "Date": "December 2, 2012"}, {"Title": "NO CD DRIVE", "Author": "Christine", "ReviewID": "RLLG32XKLMWV1", "Overall": "1.0", "Content": "Just so everyone is aware, this computer has no cd/dvd drive!! I got this laptop for a good price, but it is completely worthless without a cd drive. I'm not dishing out the extra $ for an external one, what's the point?", "Date": "December 10, 2012"}], "ProductInfo": {"Price": "$529.99", "Features": "1.50GHz Intel Pentium 987 Processor\n4GB DDR3 SDRAM (1 DIMM)\nBluetooth\n14.0-inch diagonal HD BrightView LED-backlit display (1366 x 768)\n320GB 5400RPM hard drive with HP ProtectSmart Hard Drive Protection", "Name": "HP Pavilion 14-b031us Sleekbook 14.0in Laptop (Intel Pentium 1.50GHz CPU, 4GB DDR3 SDRAM, 320GB Hard Drive, Bluetooth, 802.11bgn, USB 3.0) - Model C6N76UA", "ImgURL": "http://ecx.images-amazon.com/images/I/41aUX7f0epL._SY300_.jpg", "ProductID": "B00AFOCKZY"}}