{"Reviews": [{"Title": "Love mine!", "Author": "Laynah \"Laynah\"", "ReviewID": "R2DOPOLEO58SHW", "Overall": "5.0", "Content": "Im using it right now to type! Its great. Windows 8 is stupid feels more like im using a phone and Ive caught myself trying to use the screen as a touch lol but overall its nicely built, works well and is really cute. I would recommend for a younger crowd and those who dont want much memory as I have used most of mine in less then a month! But I have alot of songs, apps, movies etc...", "Date": "February 28, 2013"}, {"Title": "VERY NICE LIGHT LAPTOP AND CHEAPO", "Author": "Mauricio A. Chacon R \"mauricio chacon\"", "ReviewID": "RGIK91HTL8FXF", "Overall": "5.0", "Content": "OK, first of all i am not a noobthis laptop has a very nice cpu, nice ram, nice everything, the best part is the weight 1.8kg, and yes it is very light for its size, i carry always on my backpack without risking my health, so keep that in mindabout the noob part, yes many people get their laptops and says it is slow, i want my money back, boo boo, well... they are noobs, off course laptops are crap no matter if they have an i7, they have 5400rpm hdds and stupid manufacturer puts antivirus and bloated crap, you have to remove all and tweak windows, also slap an SSD and you will get an amazing pc, at least format windows, don't use the windows that comes with laptop, remove that recovery partition full of crap and also get latest drivershere we goformatting the laptopit was a little hard messing the bios and finding the right option to boot usb but after that it was easy, stupid windows 8 secure boot uefi crap, pain in the ass to boot  another OS, but once you disable you are setabout drivers, asus sucks, they only update drivers for newer laptop, so be sure to check newer laptops driver page for last versions ans also internet have more updated drivers for other stuff than asus webabout installing ssdread, this is a little hard, it is not easy to open the laptop at all, there are vids on youtube, be very careful, it is very scary, but i put my crucial m4 ssd there and it works perfect with sata3screenlooks great for me, but angles do suck hardcons-color should have been matekeyboardperfect, won't say more, super confortablemousepadkinda sucks so-so, it is big, very nice but some dumb ass did not separate the mouse buttons, so it`s very easy to mess until you get used to it, at first is very rigid, not the best pad at all, it sucks for some time and after that, shame on you asussound:normalbattery3-4h of heavy use, 6h with minimum light, very nice imaodesignlaptop looks amazing, very thing and cool, looks like ultrabookheatonly on one side, and very heat, i mean a lot when you do heavy stuff, other than that it is cool below and on the keyboard, so hot area is just one sidewifiperfectwebcamwho caresgraphicsintel hd gma 3000off course it sucks, even my old ati x800 from 2004 is better, but at least is ok for 2d games like angry birs, and ps2 era games, also decodes hd vids 1080, 720p perfect with intel sync or dxva, but is not powerful enough for use madvr or sharpen complex2 shaders with media player classicso there you go, an amazing laptop for 360$, i know there are better ones with dvd, blu, etc, but remember this thing is all about cheapo and lighter if you have no money for an ultrabook, also ultrabooks my ass, they only have an i3 instead of a pentium (pentium = i3 - hyper thread), both are sandy bridge, very fast cpus, and dvd crap readersoproscheapsuper lightlooks greatpowerfull for office, surfing, full hd moviesfast laptop if you are not a noobcool with no annoying heateasy to setup with few driversconsmousepadscreen not the best at alljust 2 usbs sucksasus does not update drivers for this model anymore (you have to look on other sites)", "Date": "February 16, 2013"}, {"Title": "Comes with built-in niggles", "Author": "A.K. \"totalplonker\"", "ReviewID": "RCOLKOZIHTZMW", "Overall": "3.0", "Content": "- The build was surprisingly good for the price. The case does not hold fingermarks, and is an attractive metallic green.- The screen quality is poor. I have the eyes of a 48-year old, and I can still see the pixels. Despite running through all the colour modes, it is washed out.- Processing is good. The computer stays cool, doesn't make noise and accesses wi-fi as quickly as any other.- The huge problem, which others have endured: the space-bar doesn't work all the way across.- The trackpad works will, and when you press it you can certainly hear it.I don't want to grumble. I got this laptop dirt cheap when Best Buy was selling refurbished Doorbuster Specials in January. I think I got at least what I paid for. But that d**n space-bar !", "Date": "February 15, 2013"}, {"Title": "Perfect laptop for the family", "Author": "Scott Anderson \"Sharpsburg\"", "ReviewID": "R1Q1HH31IEKGGW", "Overall": "5.0", "Content": "As a Black Friday purchase for my kids, this system as been a real gem.  The quality is right on the money for the cost.  The screen is bright and easy to read and the keyboard is totally awesome!  Great response time, feel and look, almost the same as my Mac Book Pro but without the backlight feature.  Touchpad is very responsive and right on, works great with double touch slide for scrolling and single touch for clicking.The Pentium powerhouse processor packs plenty of speed and support paired with the 4GB of Ram.  Since my kids don't do any intense gaming I can't say for certain what the true speed shows, but it's great for online gaming and a variety of kids games that we currently use, such as subway surfer, fruit ninja and such.  The only confusing part of the laptop for my kids was Windows 8, but once they figured out how to get to the desktop everything else was simple.Pros of the System:High Quality ScreenFast Pentium ProcessorLight WeightQuality buildFast on the internetGreat DesignLow PriceGood Battery LifeCons of the System:No CD-Rom DriveWindows 8 (Difficult for Some)Asus is a really nice system for the money and it's loaded with features that the whole family can enjoy.  I highly recommend this system.", "Date": "January 22, 2013"}, {"Title": "Laptop was great", "Author": "Rebecca Harwell", "ReviewID": "R2Q3TANWRSXMCB", "Overall": "5.0", "Content": "I wanted this laptop for playing games and making cute pictures and this computer is perfect for what i needed!  And the color is cute i love pink..and it was very light and i loved that the laptop was light enough to hold in my hands while standing up", "Date": "April 27, 2014"}, {"Title": "Great computer for the price", "Author": "Micki Smith", "ReviewID": "RXQI87PB9SVRS", "Overall": "4.0", "Content": "I like my computer. I wish I would have checked around, though. The speakers leave a little to be desired, but all in all, I really do like it. Great for what I need it for.", "Date": "March 11, 2014"}, {"Title": "Not very Sturdy", "Author": "Willis Lint", "ReviewID": "R3N1TW37AO9PW2", "Overall": "2.0", "Content": "Within a day one of the button had popped off from use. The idea with having a portable device is it should be sturdy enough for use in a variety of places, If the buttons are falling off within hours of opening the device what will happen to it when you actually take it somewhere besides the house??", "Date": "January 11, 2014"}, {"Title": "Very light, and fast.", "Author": "Steven Eyler", "ReviewID": "R1U0WUNX185JNV", "Overall": "5.0", "Content": "Excellent laptop for the money.  Like all computers, came with too many pre-installed programs that are useless.  But the computer itself is fast, handles multiple open windows and tabs without lagging.  Connected to our wireless network without issue.", "Date": "January 7, 2014"}, {"Title": "Asus lap top 14 inch.", "Author": "Ms.lizzy", "ReviewID": "R26LIFIIPL58C3", "Overall": "4.0", "Content": "Nice looking lap top but seems to be slow. Colors are so nice looking on the screen.Well made. I am pleased with  the price I paid .", "Date": "January 7, 2014"}, {"Title": "Love it", "Author": "Jason D.", "ReviewID": "R2OWAZIUU0CWIB", "Overall": "5.0", "Content": "I've been using this product for 1 year and it is amazingTbh get the laptop it works its fast and it's great", "Date": "December 13, 2013"}, {"Title": "Cheap", "Author": "Diva G \"divagirl\"", "ReviewID": "R3M2PW1YSXNUID", "Overall": "3.0", "Content": "The shell and keyboard are very cheaply made.  I would not buy another asus computer after having this one.  I've only had a while and already I'm having issues with keys sticking.", "Date": "October 18, 2013"}, {"Title": "Computer works well but", "Author": "A. Harris", "ReviewID": "R2LX24ZXPW7E29", "Overall": "4.0", "Content": "Computer is fine but  touchpad is so wide you can't rest wrist to type without hitting it and getting tossed back to a previous screen. Windows 8 functionality is terrible.", "Date": "June 11, 2013"}, {"Title": "Windows 8 with touchscreen appears to be a bit too much for the regular person", "Author": "Carlos Fernandez", "ReviewID": "R2UMGY9IZ0CV29", "Overall": "3.0", "Content": "Calling the ASUS buyer support with a totally new operating system like windows 8 (touchscreen) very deficient is an understatement. I have spent two days trying to figure out which account I need to enter every time I am asked for ID. This operating system requires quite a bit of handholding for your non computer nerds.  Besides they do not work on Saturdays, that is when I can experiment with the computer.  I am sorry I chose this product.", "Date": "May 19, 2013"}, {"Title": "I regret purchasing this computer!", "Author": "S. Bauernfeind", "ReviewID": "RHHN0GE968AVB", "Overall": "2.0", "Content": "I bought this computer in October of 2012 at Best Buy because they had a promotion sale on the laptop. I have now owned the computer for 7 months and I feel I can now write a proper review on it because I use it everyday.First off, the Windows 7 software that was already downloaded on this computer is screwed up. My browser is forever freezing as is the picture gallery/editor, skype, and some other stuff. I have uninstalled and then redownloaded ALL of my downloads that are forever freezing and I keep my plug ins updated - still it freezes on me constantly. I asked for advice from my brother in law whom is a computer engineer and he said I would need to completely uninstall windows 7 and then re-install it again. WHAT A LOAD OF CRAP!Last week the letter \"L\" on my keyboard fell of for no reason! I was typing away and BAM it just fell off? I am still able to use the letter but it's a pain in the butt because I can't breeze through when typing for words that need the letter \"L\" - instead I have to bang down on it to get it to work which is super annoying.The speed of this computer is nice though but when it freezes up then everything else does too and I have to restart my computer or it will continue doing so. I regret this purchase and will NOT be buying an ASUS in the future.", "Date": "May 18, 2013"}, {"Title": "thankful and pleased", "Author": "mapache", "ReviewID": "R1V07PD1SXD6WV", "Overall": "4.0", "Content": "excellence, i'm pleasedwith this purchase nice and functional it meets all my expectations about it. definitely I would buy it again", "Date": "February 10, 2013"}, {"Title": "ASUS laptop in white", "Author": "Hernandez", "ReviewID": "R1GTX0F3USED54", "Overall": "5.0", "Content": "Great laptop! Beautiful looking in white! Fantastic price! A bit slow, but great for school work and teenagers! Very happy customer!", "Date": "January 28, 2013"}, {"Title": "Complete PoS", "Author": "Hopelessly Caffeinated in Phoenix", "ReviewID": "R1U1AOQNGI6K5C", "Overall": "1.0", "Content": "So there's really nothing special about this laptop - it is what it is.  However, it functions very reliably, has what I needed it for (bare bones features - I use this as a junker laptop for testing purposes and back-up for my normal system, predominantly).  I love the color though!  And I do have to say that the battery life is superb, as are the functions of the unit itself.  I have not yet gotten used to Win8 (I hate it, actually) but that's not the laptop's fault.*****Update - I originally gave this 5 stars.  I now have it set to a 1.  Here's why.I only used this less than 5 times.  Unfortunately, the times it worked were before my last review.  The next time I booted it up, it blue-screened.  Several reboots got it back up and running, so I was nervous but decided not to sweat it.  The next time I turned it on, it blue-screened again and stated that the computer needed to be repaired.  Nothing brought it back to life.  Then there's ASUS support.  Or maybe they should be called ASUS Non-Support.  They want me to send it back at my own cost, then they maybe will send it back or maybe replace it - or maybe claim that it is something I did (which it most assuredly isn't).  Awful long list of maybes.  I have now lost all respect for the ASUS brand and will never use their products again.  I would highly recommend that any browsing potential buyers do the same.  Yes it is inexpensive, as far as new laptops go, but that doesn't mean you should blow your money on junk.  If ASUS doesn't even stand behind their products, that should be a clear indication of what consumers should expect.", "Date": "April 10, 2013"}, {"Title": "Agile and Full Featured", "Author": "Terry Davidson \"trdavidson\"", "ReviewID": "RADQ38JA11SID", "Overall": "5.0", "Content": "Mine arrived today.  I have been tooling around on it for the two hours or so and haven't encountered one thing that makes me regret purchasing it.  Web access is quick, HD content plays without hesitation. Multitasks easily. Very little bloatware (in fact nothing I have felt compelled to uninstall except the TrendMicro Internet app as I already employ Norton 360).I'm not a fan of windows 8 OR touch technology and this little gem is perfectly suited to my tastes. I've added  a Logitech M315 Couch Mouseand an Asus External DVD-RW optical drive to complete the package and I honestly don't see any critical difference in this  and my beast of a desktop pc (quad core cpu and 16GB RAM).Highly recommended!", "Date": "July 16, 2013"}, {"Title": "I LOVE IT!", "Author": "Lynda Bullerwell", "ReviewID": "R15MF1IPIJQE6M", "Overall": "5.0", "Content": "I got my laptop in December. My husband and I had decided to store the desktop and each get a laptop. He got a green one first and liked it so well that he got me a white one. I love everything about it. It is light in weight, fast, and looks great. The only thing I do not like is WINDOWS 8, which has nothing to do with this amazing laptop. ASUS does it again. If anything happened to ours, we would get another one just like it. If you are looking for a great laptop at a lower price, this is my pick.", "Date": "June 2, 2013"}, {"Title": "This Asus is really great for my daughter who needed it for college...small but lots of speed!", "Author": "Fancy25pets", "ReviewID": "RL1RMOISHZ0AJ", "Overall": "5.0", "Content": "My daughter loves her new computer....the size is perfect for all her needs but has alot of memory. I would love one for myself!", "Date": "January 19, 2013"}, {"Title": "Great!", "Author": "L. Williams \"Not a big movie person\"", "ReviewID": "R1D0MFBD2YWKGF", "Overall": "5.0", "Content": "Arrived well-packaged; easy to connect & get started. Bought for an 11 year old boy to be used for school & perfect for starters. Am glad I purchased it :)", "Date": "January 13, 2013"}, {"Title": "Pretty good", "Author": "FireandIce \"FireandIce\"", "ReviewID": "R1OVYW0TXZQPBE", "Overall": "4.0", "Content": "There are a few things I do not like. One, I am not a fan of the new Windows 8 installed on this with the touchpad feature. It is quite annoying and even when you turn them off it still comes back on.I also was not thrilled you cannot play any type of disk on it. With today's technology that was disappointing that it did not come standard.Other than those issues I do very much like the computer.", "Date": "January 6, 2013"}, {"Title": "buen equipo buen desempeño", "Author": "carlos daniel", "ReviewID": "R22MJQSVCED6V7", "Overall": "5.0", "Content": "es exelente precio calidad recomendada a cualquiera que quiera un equipo eficienteunica limitacion no viene con cd rom, es veloz en internet", "Date": "March 5, 2013"}, {"Title": "Not happy", "Author": "KAE", "ReviewID": "R2L7TXG0CA4QB9", "Overall": "1.0", "Content": "Got this for my 11 year old for Christmas.  Have had all sorts of strange problems with it...it makes a high pitched whirring sound randomly and very often.  Also it totally froze up where we had to completely reset it and lost different files that we had.  All this in under two months time...bummer.  Originally I was told that ASUS is a great company, but this has been much less than impressive for us.", "Date": "February 11, 2013"}, {"Title": "asus 410a", "Author": "james", "ReviewID": "R3BG4GA1XIOSGZ", "Overall": "5.0", "Content": "bought this at best buy as a spare labtop for school so i dont have to drag my expensive labtop around. this lab top from what the specs were sounded pretty cool and i payed 299$ for it .i use it more than my other labtop i love it i upgraded my ram and my hard drive and im even more impressed.the generic i3 is pretty inpresive to handling most of todays dirty work with ease all and all exelent buy!", "Date": "January 15, 2013"}, {"Title": "Good value", "Author": "RickD", "ReviewID": "ROOWJE9M831C3", "Overall": "5.0", "Content": "Great for our teenage daughter! Good specs and lightweight. Be aware it doesn't have an internal DVD/CD drive. We bought an external so we could easily load software and run games.", "Date": "January 14, 2013"}, {"Title": "asus netbook", "Author": "dan", "ReviewID": "R2O2LRE43AW7EN", "Overall": "4.0", "Content": "the netbook is good and at the price I got it for a good buy but it is surprisingly underpowered too run its operating system windows 8", "Date": "January 6, 2013"}, {"Title": "Nice but kinda slow", "Author": "Amazon Customer", "ReviewID": "R3QCNBX9EJCUV8", "Overall": "4.0", "Content": "Good laptop but it overall seems slow I feel like i am always waiting for it to think. But still nice cheap laptop.", "Date": "January 2, 2013"}, {"Title": "Crappy laptop", "Author": "I love books \"Book lover\"", "ReviewID": "RSJXGCS0MEG26", "Overall": "1.0", "Content": "I got this laptop on Black Friday 2012. At first, it worked okay. It did what I needed, though I did notice the space bar was slightly off and the touch pad was too sensitive causing me to mess up as I was writing because it would click me somewhere else on the screen. Annoying, but I could live with it. About two months into using it, it began crashing. Sometimes it would run fine, sometimes it would crash repeatedly. Really annoying, but I dealt with it. Now, here it is May 2013 and it has crashed and will no longer load. It tells me it has no boot device. It has never been dropped or anything. The computer is not worth it for only six months of use. Disappointed in asus for this terrible quality laptop. I've had an asus before and it was fine. This one.... No good.", "Date": "May 17, 2013"}, {"Title": "JUNK!!!!!!!!!!!!!!!!!!!!!!!!!", "Author": "Corinna", "ReviewID": "RCLD0QEKBEPML", "Overall": "1.0", "Content": "Got this computer took it to school next day NOT even 12 hours later, when the IT services at school went to put wifi on my computer so i could connect at school, this laptop crashed and If I don't get any help with this faster then I have been I will return it. VERY unsatisfied customer. This computer don't even have a cd/dvd drive so I can try restore it myself. Instead once you get it to restore point it asks you to insert your windows installation or recovery media to continue... Pretty sure THERE IS NOTHING that came with the stupid thing... I WOULD NOT BY THIS PRODUCT, NOT WORTH THE HASSLE !!!!!!!!!!!!!!!!!!", "Date": "February 15, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00A9IOWMA"}}