{"Reviews": [{"Title": "Very expensive and brilliant laptop.", "Author": "Pastaboy", "ReviewID": "R15TM2KD2BXCDQ", "Overall": "4.0", "Content": "I purchased this exact i5 Helix pre-launch from an Ebay reseller so I've had about a month of use with it. If you don't already know from watching one of those brief Helix ads, it's a tablet convertible laptop with dual batteries. I'll skip all the specs and go to my experience.First of all, I come from using a Surface RT, Razer Blade, and self-built PCs. I sold my Surface RT and Razer Blade to pursue my journey of finding my ultimate device to augment my work. Razer Blade was incredibly fast and powerful, but it was too big, gets too hot on the lap, and looks unprofessional. The Surface RT's kickstand is a pain to use on a lap. It keeps falling over and it's ARM processor doesn't allow for freedom of programming languages. I have to use Python and Visual Basic for financial modeling. The Helix fixes all these issues for me of course. Design-wise, I believe it to be the best implementation of a convertible so far. I'll list the negatives though.The touchpad is frustrating. The usual Thinkpad buttons are gone and the whole pad is allowed to be touched to move the pointer. That's a problem because when I click, I tend to move my finger. I would ultimately start dragging things or clicking the wrong links. Lowering the sensitivity helps but it really shouldn't be that troublesome. Lowering sensitivity obviously makes it less responsive, such as touching the touchpad slightly to the side of your finger won't be registered if sensitivity is too low.Two-finger scrolling is terribly unresponsive and unusable. I have since switched to one-finger scroll with the circular gesture. I find the one-finger scroll to respond enough of the time to work effectively. However, it is no match to a MacBook's touchpad's two-finger scroll response. I wish they got this right.Fan is always on. Don't get me wrong, the fan is not noisy compared to something like the Razer, but it's strange that it has not turned off while I just type this review. I can't really figure out how to install TPfancontrol for the Helix. Some help would be appreciated.The upper right corner of screen/tablet can get pretty hot. It's not too much trouble for me since I usually work on my lap and there is no heat from the keyboard.The battery life is great but it's nothing like the Surface RT. The Surface RT claims 8 hour battery life. Lenovo claims 10 for the Helix. Well, if both were playing videos, I'm sure the Surface RT would last longer. The Helix drains quicker. The battery life is still phenomenal for a device this powerful, and I haven't needed to charge at work yet. However, I watch my battery life closer with the Helix than I did with the Helix. I drain the keyboard battery so quickly. I understand it is a trade-off though. The Helix has a much nicer display and I can definitely attach an external monitor or TV to the Helix. I would experience horrible, unusable lag if I did that with the Surface.Next problem may be a Windows 8 issue. Because the Helix is 1080p and only 11.6\", everything is pretty small. If I try to get Windows to enlarge icons, text, etc., fonts and pictures would look blurry. I haven't found a solution to this yet except keeping to the default smaller settings.Next issue is the price. For about $1700, this is extremely expensive. I LOVE the design but I start to doubt whether it's really worth the price. I love a small tablet PC that I can work on in bed with a fantastic feeling keyboard. One alternative is the Thinkpad Tablet 2 which I tried in a store and it was pretty awesome. I actually prefer the design of the Tablet 2 over the Helix. It is so small and Lenovo designed a beautiful case for it. The problem with it is that I cannot adjust the screen angle, hdd space is limited, keyboard trackpoint is annoying, and the performance of the processor with multiple screens is dubious. However, as a simple programming and office device, I could see myself happy with the Tablet 2. For now, I still think the Thinkpad Helix is possibly the best business laptop, but I would love a slimmed down version that's even thinner and cheaper.", "Date": "June 8, 2013"}, {"Title": "Phenominal Device", "Author": "Simisimi", "ReviewID": "R2ZC6KHHXI8F7N", "Overall": "5.0", "Content": "I wish I had time to write a comprehensive review but here is the bottom line.  I sell over 1,000 PCs and Notebooks a year and have been doing it since 1987.  This is the most impressive machine I've had the pleasure of working with in many, many ways.It's solidly built.  The screen is super bright and sharp.  It's touch and it has a stylus for jotting notes and marking up documents and presentations.  It boots super fast and it runs just as fast (mine is the i7 version but can't be much of a noticeable difference).  It presents no compromises as a notebook or as a tablet.If you fly a lot you will appreciate the battery life which got me to Europe with power to spare.  Also by detaching the tablet, turning it 180 degrees around and re-attaching it to the keyboard base you get a tablet that will sit at a 30 degree angle on your trey table.  Much easier to manage than a typical tablet sitting flat.The only weakness I found is not the machine's fault - Windows 8 remains a struggle for me.  It's a great touch OS but going back and forth between \"Metro\" applications and the traditional desktop and non-Metro applications is a bit painful.  That is probably more my lack of experience than anything but it's definitely an issue for me at this stage.It's expensive but it's worth the money in my opinion.  Not affordable for everyone but neither is a BMW.  If you are looking for a flexible travel machine that doubles as a notebook and tablet, the Helix is what I would recommend.", "Date": "June 11, 2013"}, {"Title": "Excellent with Windows 8.1 on it", "Author": "Flag Rider", "ReviewID": "R3KGZLZ7OSCXAG", "Overall": "5.0", "Content": "Expensive yes, but its a great laptop.  No Haswell is not a huge problem as the battery runs 9 hrs as is.  Keyboard far better than another hybrid option.  Its is a great laptop and a solid tablet.  Everything else has a stronger bias, such as the Lenovo Yoga - which is great laptop but a mediocre tablet.  Or the Microsoft Surface devices, which are very nice tablets but really so-so as laptops.  The Helix does both extremely well.  Its somewhat overpriced, but if you really want the laptop/ultrabook in one (as many travelers do) and don't want do use two machines to do it (laptop plus tablet) this is the best option on the market today.Update - Major issues with trackpad.  Hard to use and ultimately resulted in returning the device.  The trackpad had a lot of travel when click and causes the pointer to hop around when clicking.  Small issue ultimately brought down the utility of a very interesting hybrid.", "Date": "July 6, 2013"}, {"Title": "A great laptop, an ok tablet", "Author": "Tim Byers", "ReviewID": "R2KJ13FUVUWEML", "Overall": "4.0", "Content": "I've got to admit I'm kind of a sucker for these combo units.  My first serious tablet (not a combo unit) was the original Samsung Galaxy Tab 8.9.  The Logitech bluetooth keyboard let me write easily enough, but set up wasn't super convenient (you undo the keyboard, turn it on, enable Bluetooth, make sure it stays paired).  That's what got me interested in the Asus Transformer T700, a 10 in tablet with a gorgeous display and snap on keyboard.  I liked it very well with its pseudo-Office apps like Polaris and Quickoffice.  Then a month ago work provided a Lenovo Helix.  Finally a combo with real Word and the potential for another app I love for writing--Scrivener.  So far I really like the Helix.Pros:-Real Windows (compared to the Surface with RT) for real windows apps I want-Real keyboard (compared to Type and Type 2 for the Surface line) which is solid and very responsive-very nice trackpad (compared to the Asus Transformer line--hey, at 4x the price it should)-nice size for a laptop--11 in screen which is super high resolution and very bright-super speedy processor and graphics.  I'm not a gamer but the Intel HD 4000 can handle several-stylus, which I'm still getting to know.  Great alternative to mouse sometimes-Handwriting recognition with the stylus is great and might really come in handy-sturdy construction like other Thinkpads with that grippy black finishCons-11 inches makes the tablet unwieldy as a tablet.  When I'm on the couch it's just as easy to keep it in laptop mode, both for balance and navigation.-battery Life-- I might not have this optimized but it seems like even when I put it to sleep it drains battery (by the way, my Asus Transformer did the same thing until I turned off some of the background stuff like location services).  This is not a big deal since I'm usually within 4 hours of power but I guess I expected more-screen resolution.  Believe it or not, it may be that the resolution of this is almost too high!  1900 lines of resolution on an 11in screen makes things pretty small for middle aged eyes.  Of course I can reduce the resolution and zoom in on the browsers but I have an external monitor at work.  There's probably a way to optimize this but I haven't done it yet.  Not a huge con, but something to consider.-screen size as a tablet.  I heard Samsung is working on a 12 in tablet.  Who will feel comfortable with a screen that big trying to hold on to it?  The same is true here.  I'm not sure it works as a big tablet.ConclusionWith the content I need to produce I admittedly favor the laptop mode of this unit.  I'm wanting to appreciate the flexibility of the tablet but find myself forgetting it can be used that way.  Hence I'm questioning the whole design.  Why does it need to be a tablet?  (I know the tablet can be connected face forward to fold down or display forward but I don't see the benefit yet of those modes).It's got me wondering if I could optimize weight, size, and tablet use in the 10 in Asus Transformer T100 or go back to the standalone tablet with external keyboard in the Dell Venue 8.  Both of these alternatives would give me the Windows experience I want for content creation and the chance to benefit from the tablet form factor.", "Date": "December 22, 2013"}, {"Title": "Great device, I would buy again and recommend to others", "Author": "Dan J. Endthoff", "ReviewID": "R2BLV9JMRNQPC5", "Overall": "5.0", "Content": "Absolutely love the Helix. I have had it for a month now and as a frequent business traveler, it is provided a great combination of performance, battery life and portability.Pros- Beautiful screen, running on 125% DPI- Easy to use on plane: Laptop, Tablet, Reverse Laptop (or whatever it is called)- Excellent battery life for pre-Haswell chipset- Great keyboard- Stylus silo in tablet (really missed this on Surface)Cons- Stylus is too small (you can replace it with another Wacom stylus but have to remove it from the silo to use it)- Gets a little hot when pushing it hard (it is the screen side which is great if you are using as a laptop)- Is a little top heavy in laptop mode- The is some ghosting on the screen near the edges with certain color schemes. It goes away in a few minutes and can be minimized by tweaking color settings but it is still there.", "Date": "November 13, 2013"}, {"Title": "Great Ultrabook.", "Author": "J. Tanner", "ReviewID": "R1AY3FUCE9ILDZ", "Overall": "4.0", "Content": "Love it. Works great as a business ultrabook as well as a nice sketch tablet I am finding out (Use it for Manga Studio now that Wacom Has updated their drivers.). I wanted to wait for Windows 8.1 to post my review because I was a bit agitated with it when I first recieved it.  Glad I did.Pros:Lightweight for a full featured laptop.Windows 8.1 is surprisingly good on tablets.Wacom Digitizer is very accurate.Cons that have been fixed with 8.1 Update and recent drivers:Wifi driver had issues that dropped alot. Especially in hotels. Would suggest updating on a stable connection as soon as you unbox it.Pen digitizer did not work well with Photoshop and Manga Studio.  It has since been fixed.Cons:Still having strange driver issues.  Widi does not work well since Windows 8.1 with any of my TVs. Worked fine for 8.Random CPU spikes, causes computer to lag in any Metro application. Does not happen on desktop.CPU is right behind the screen on the upper right side, making it get a bit warm if you are using it for Handwriting or Artwork.CPU is not latest generation (Haswell). Wish it was, but I knew that going into it.Bottom Line: Great machine if you got the money for it. Lenovo is a good buy, with minimal bloatware, nice system update features, and a stable computer manufacturer(economic wise.) There isn't much on the market that even comes close to what this little baby can do.", "Date": "November 11, 2013"}, {"Title": "Great Hybrid, Great Computer", "Author": "Kevin Hinton", "ReviewID": "R258K2B17RDFHG", "Overall": "4.0", "Content": "This is how your review will appear:4.0 out of 5 stars Great Hybrid, Great Computer, August 23, 2013ByKevin Hinton - See all my reviewsThis review is from: Lenovo ThinkPad Helix 36984RU 11.6\" Convertible Ultrabook/Tablet i7-3667U 8GB RAM 180GB SSD (Personal Computers)I've been looking for a tablet/computer that I could use for work and for play (and that runs real Windows) for over a year now and the Helix has delivered on both fronts. The portability is amazing, pop the screen off and you have a tablet you can carry around the house or into meetings, snap it back on and its ready for work (or a little gaming). And through this, the battery keeps on going.A couple things could be improved on though, it could have the next generation of Intel processors (Haswell) in it. This would drastically increase battery life. Also the graphics card is only on-board (Intel 4000), so don't expect to run anything at high rez, but I've been able to play both SWTOR and Civ V without any real issue. Also the RAM is supposedly soldered onto the board making it pretty much impossible to upgrade later. Though it sounds like the hard drive is removable.If you can afford to wait, I would wait until these guys have Haswell chips in them (you'll get WAY better battery life). If not, buy this computer. I did a lot of research into all the hybrids on the market right now and this is by far the best.", "Date": "August 23, 2013"}, {"Title": "Returned it.", "Author": "george-usgr", "ReviewID": "R18XMTG714YJPG", "Overall": "2.0", "Content": "- Frequent requests for buying additional software (for PDF, backup's etc)- Spacebar key (left side ok, right side or center needed extra push)- The helix has two batteries: keyboard dock and tablet. The tablet one stopped being recognized by the OS after  a week.- Stylus would would stop working every other day and I had to recalibrate it every time.- Noisy and overheating (Not a biggie; I had the i7 core; not much that Lenovo could do to fix that).+ Nice display+ Touch screen works very nicely+ Windows 8 works smoothly+ Two power chargersAfter two weeks of playing with it  I returned it, mostly because of the battery failure. (Tried to update BIOS, of course loaded all updates, etc).Nice idea, somewhat poorly executed. For a machine that costs over $2K I expect something better.", "Date": "August 22, 2013"}, {"Title": "What an incredible device!", "Author": "Amazon Customer \"Jennifer\"", "ReviewID": "RNPMKFFWEXF87", "Overall": "5.0", "Content": "I have spent a couple hours with my new Helix, and I have to say, it has far exceeded my expectations. It is quite fast and snappy. I was worried about the heat after reading other reviews, and I will say. The back gets a bit hot when the CPU is running hard, but normal activity has it only slightly warm and fans unnoticeable. Kind of odd that it includes a trial of Office 2010 since MS doesn't sell that version anymore. but fortunately, I still had a copy around and punched my key in and was good to go. I work in IT, and have already deployed 2 Surface Pro's to users, I have to say, this device is miles beyond those in function.", "Date": "December 9, 2013"}, {"Title": "Super nice computer", "Author": "Snake Eye \"SET\"", "ReviewID": "R1XIBCZ49Y327Y", "Overall": "4.0", "Content": "Been using it now for a couple of weeks. Its super portable, love the aspect that you can use it as a laptop or a tablet. The screen resolution is wonderful and super bright. I can sit with clients, use the touch screen and go over cad drawings in any light setting. The screen has a little bit of glare, but it is a non issue since its super bright. The keyboard is what you expect from a Lenovo Thinkpad. I am still getting used to the mouse touch surface, wish they had kept the three buttons for using the joystick, that was a much better design. I have the 1.8ghz icore 5, and its plenty of power for what I use it for... Excel, Word, Web, Email, etc. This computer is not for games, the video card is not powerful enough. Ive had a couple of problems in where the computer will go into sleep mode and then it will not come out of sleep mode, this means I have to restart the computer by leaving the power button pressed for more than 3 seconds. Kinda of annoying.Overall do like the computer, cannot give it 5 stars since it will not come out of sleep mode, the touch pad wish it would have kept the three buttons and finally wish it had a better lean angle on the screen when used as a laptop.If they improved on all theses things I would definetly buy it again.slds.", "Date": "September 15, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BBLEX78"}}