{"Reviews": [{"Title": "great value for a top quality touchscreen laptop", "Author": "Stacie", "ReviewID": "R29000B81GMVAD", "Overall": "4.0", "Content": "you won't find a better 15.6\" touchscreen for ~$500. Three usb ports, HDMI port, internal DVD, 500+ GB HDD, backlit keyboard -  there's a long list of great stuff. it's fast, quiet, and doesn't put out much heat (no Dell thigh-burn here). i bought this for work and liked it so much after a few weeks that i bought another one for my family. expect maybe 3hrs on the battery. meh - but that's the market reality.only real peeve is the physical spacebar response on the keyboard can be erratic when typing fast - it cangetannoying. also the trackpad is very sensitive. it can pick up a contact from your hands/thumbs pretty easily while typing and unintentionally move your cursor downscreen mid-sentence - super annoying. basically, be mindful of your hand position while you type - and be extra assertive with the spacebar.overall though - this is a great buy for work, school & general family use.", "Date": "July 5, 2013"}, {"Title": "Beware of this Seller", "Author": "T. R. Wilson", "ReviewID": "R2HI96LHFVCFZB", "Overall": "4.0", "Content": "Be aware - this review concerns the SELLER Antonline, not the product from Acer. (I selected \"Like\" for product -- but would rate the Seller, Antonline, \"I hate it\")I ordered the Acer laptop in June as a graduation gift for my son. It actually arrived earlier than expected and was gifted a short time later. While the laptop seems fine in all other respects, it had one manufacturer flaw - it simply would not charge. While plugged in, it operated well and my son loved the Windows 8 interface, but remove the plug and it would not operate. I tried to seek a repair or replacement under the factory warranty through stores local to my area. I was always redirected back to the original seller. I contacted Antonline within the 30 day guarantee window by email through Amazon. I then contacted Amazon to make them aware of the issue and they, also, sent an email explaining the issue. I received an email back explaining that my 30 days had been exceeded and, therefore, outside the return policy (Antonline was counting down from the \"order\" date, not the \"received by\" date). I contacted Amazon once again to determine when the 30 day guarantee begins and they confirmed that the guarantee begins the date of delivery to the customer, not the order date. They, also, sent another follow up email explaining to Antonline that I was within the return policy time frame and this matter should be resolved by them. I received my final email notice from Antonline explaining (again) that they do not follow the Amazon guidlines and, instead, begin the 30 days from the date of order, not the date received. (For clarity, the difference between the two dates was 3 days).After contacting Amazon and asking what to do, I was told I would receive a total refund of the purchase (isn't this why we all LOVE Amazon in the first place?) and I could simply reorder the laptop from another seller. While that isn't the easiest way to resolve this issue, it is one way and I have chosen to do just that. It really seems as though Antonline went out of their way to not resolve a manufacture warranty issue that could have been handled simply and would have resulted in a sale retained by them, a happy customer with a good review and need not have involved Amazon at all. Personally, I would never order from Antonline again knowing their attitude towards the consumers they sell to.If you like what this laptop has to offer - as I did - I suggest searching another seller on Amazon and find yourself happier in the end should you face a warranty issue as I have.", "Date": "July 14, 2013"}, {"Title": "Excellent Hardware, some challenges with Operating system windows 7", "Author": "anthony wainaina", "ReviewID": "R23U1CZBFB9PJ8", "Overall": "4.0", "Content": "overall, the computer was good, just as described. light in weight and sleek look. Lighted keyboard and other features that make it look a worthy computer for the price especially. only setback is with Operating system windows 8, It became really had for my parents to adopt to the new homescreen as opposed to desktop and start menu in the previous windows versions. applications provided are only microsoft based. one cannot load a yahoo application based on another browser like chrome. then there is the issue of closing the windows. the x on the top right which windows users are used to is gone. closing different tabs and open windows is a nightmare. i found myself closing running applications through the task manager.otherwise, the hardware is recommendable.ill be more than happy if i can be upgraded to the newly released windows 8.1 which solves most of this issues.", "Date": "June 2, 2013"}, {"Title": "WOW!!! what a machine, and I love windows 8", "Author": "walter", "ReviewID": "R30CKKSG64Z9NC", "Overall": "5.0", "Content": "I purchased this machine from a different supplier but felt I needed to tell all how great the product is. I read all the complaints about windows 8 and almost didn't purchase this laptop. I felt that there were always people who complain about everything, so I took a chance. Boy am I glad I did. Before the laptop arrived I went on youtube and looked at instructions by Jay and I also have a tablet and am use to apps and a touchscreen. When the laptop arrived it took about an hour or so to apply what I had learned, what FUN, so now I am finding out new things daily. As far as the laptop its self, runs cool, great screen, love the lit keyboard, streams look outstanding.I am not geek just an average computer user who shops on the web, reads and sends emails, plays games, downloads photos, etc. I feel the complaints are not on the laptop but the OS, these are people who do office applications and are use to a different format, but for all of \"us\" average consumers, this is the affordable machine for us.", "Date": "August 11, 2013"}, {"Title": "Delight", "Author": "omotayo", "ReviewID": "R2AXT6UVQUQC8I", "Overall": "5.0", "Content": "This Laptop is one of a kind, the Tablet/PC combination makes it a must have for work and play. Screen touch responds very fast. Its got everything desirable and its really slim and very sleek.", "Date": "June 2, 2013"}, {"Title": "windows 8", "Author": "Sandy", "ReviewID": "R3RP4DGTRDSD0U", "Overall": "4.0", "Content": "I didn't like windows8,  had bugs and had to pay company to fix. But after they fixed seems like all is well.", "Date": "June 15, 2013"}, {"Title": "Amazing!", "Author": "Freddie", "ReviewID": "R1INYAE2KO57HD", "Overall": "5.0", "Content": "Wow - I am so glad I picked this one.  After retiring my 2006 Compaq - welcome to the future!  Not a big computer geek, but this could change that.  Great price and hope I am still singing its praises in a few years from now.", "Date": "May 20, 2013"}, {"Title": "I love the touchscreen!", "Author": "Kathryn S.", "ReviewID": "R2YRA0YOY1QSPU", "Overall": "5.0", "Content": "Although I haven't had a lot of time to use the laptop, so far I love it! The touch screen is amazing! It's smooth and the speed is very fast compared to my old computer. I've read bad reviews about Windows 8 but I really like it. The programs are all right there at your fingertips. I'm very pleased with it.", "Date": "October 17, 2013"}, {"Title": "An amazing laptop for an amazing price!", "Author": "Cally Prince", "ReviewID": "RFJ5MKEWVM7XF", "Overall": "4.0", "Content": "I ordered this laptop two days ago, and to my surprise, it was delivered in just 48 hours! The laptop was secure, safe, and neatly packaged when I opened it; nothing was damaged or out of place. Setting up this laptop was quite easy. It took around twenty minutes for me to set it up to my liking and standard. (I was taking my time...*Smiles*) This laptop is a Windows 8; I'm liking it so far. The keyboard is wonderful! I am in love with the black chiclet keys and having the backlit keyboard definitely makes this laptop look sleek, clean, and modern. The backlit keyboard is bright and noticeable; there is nothing to complain about here. It's beautiful to say the least! Typing on the laptop is a breeze; the buttons are easy to press and very durable and strong. The touchpad is larger than most, but it works perfectly. The touchscreen is miraculous! It moves and slides with ease; just a touch of my finger and it responds beautifully. I've been using this laptop for a couple hours now, and I have had no trouble at all. There has been no lagging, and it is very responsive and quick. The laptop has not been hot; the fan on the side does it justice. The laptop is quiet and the screen quality is crisp and fresh. The ONLY downside, I must confess, is the speakers. I believe they are on the bottom of the laptop and the sound quality is just \"okay\". It's not good and it's not bad. I'm normally not a picky person, but the poor sound quality was noticeable, in my opinion. Using headphones makes the sound quality much better though. Other than that, I still really love this lapto and I do not regret buying it. The price was magnificent! You cannot find a laptop that has a touch screen, chicklet keyboard with backlit lights, and cd player for this price! It's just AWESOME! I'd recommend it to anyone! :)I hope my review has helped you. Have a great day! <3 - Cally PrinceP.S:If you have any questions, contact me here ----> callycat2311017992@gmail.com", "Date": "October 16, 2013"}, {"Title": "Good Value", "Author": "Christopher Durant", "ReviewID": "R1R2OMYO5TYZDJ", "Overall": "4.0", "Content": "Pro:ResponsiveGreat keyboard feelQuality ScreenCon:I little heavier than the slim lines make you think it shall be", "Date": "September 11, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BBMGZF0"}}