{"Reviews": [{"Title": "Not a bad little machine. 4 stars because Windows 8 UI and Mail are lacking.", "Author": "reset3x \"Linux Advocate\"", "ReviewID": "RX70MXHMR5PA1", "Overall": "4.0", "Content": "I read the reviews others have left for this model and I felt compelled to come to it's rescue. I didn't buy this netbook from Amazon. I got on sale from a major retail store. The reason I purchased The Aspire One is because my aged Eee PC 900 Linux has seen better days. I happened upon the AO756-2840 while browsing the computer section of a store and the price was good and being familiar with Acer products I jumped on it. When I got home I looked up some reviews for the 2840 in particular and found that besides Acer's website the only other place I found any were here. Acer's website had glorious reviews (of course). The reviews here weren't so hot. My heart sank. I decided to try the machine and form my own opinion. (Not to toot my own horn but I've been building and using PC's both as an enthusiast and professionally over the past 27 years. So I do possess a little technical knowledge when it comes to these matters.) From a hardware standpoint what you get for your money is far worth it. A 64 bit dual core processor running at 1100Mhz, 2 GB RAM and a 320GB hard drive. Intel HD graphics, etc.. You can see the specs above. On further investigation I found via using SiSoft SANDRA that the machine does in fact have 128 MB of dedicated video memory. This is not found in the specs. That brightened my day a bit. I should also mention that the 2840 has UEFI. The machine I purchased came with Windows 8. To my surprise there wasn't a whole lot of bloat-ware installed as I've experienced with other products. This was my first experience with Windows 8. And I have to say I do not like it. Thus the 4 stars. The dumbed down \"Apps\" page gets in my way and does not always find what I look for when using it's \"search\" function. Windows 8 and it's apps seem to me as those made for mobile devices such a tablets or smartphones (Android-like.). Also Windows 8 does not include a mail reader that supports POP mail. I found this to be a major put-off. I wound up installing Thunderbird, which I use on my desktop PC anyways. I also wound up installing a third party application to make Windows 8 behave like Windows 7 with it's Start button and menu. This provides me with a much friendlier user interface and something that I am more accustomed to. (I use GNU/Linux as my main OS and Win 7 for gaming.) I've run the machine through it's paces and I've found that for a netbook with low specs it performs better than I had hoped. Once the machine has booted it's pretty perky and opening applications doesn't take long at all. In all fairness for the given hardware this thing performs much better than I anticipated. You can multi-task and an acceptable rate of performance in my opinion. I should also mention that I was able to get 5 hours of battery life without forgoing anything. Buyers just need to be aware that this is a \"NETBOOK\" it's not a laptop and it's not going to perform like one. But it does do what it's designed for very well. You can surf the web, read and write email, write documents and presentations, do some light gaming on a machine that comes in a pretty small package. I should also mention that the 2840 has approximately the same specs as the 2626 (Except that the latter comes with 4GB RAM.) and has much better reviews. (The 2840 probably hasn't been purchased and fairly evaluated by Amazon customers due to the reviews it has received.)I've been using the AO756-2840 for about a week now. I had intended to wipe the hard drive and install GNU/Linux but being that it does what I want I'll leave it as is. I really enjoy this little machine!!(BTW.. I've tested this machine with various Debian GNU/Linux distributions and everything works fine right out of the box. If you choose to venture that way make sure that the distro you choose supports UEFI!)In my humble opinion the AO756-2840 is a good product and a good value. Again I'll mention I gave it 4 stars because Windows 8 UI and Mail are lacking. Hardware-wise I would give it 5. I wouldn't hesitate to recommend this model to a friend or anyone looking for an inexpensive netbook at a decent price.", "Date": "August 10, 2013"}, {"Title": "Ok Little Netbook", "Author": "Eric Z.", "ReviewID": "R35TXIQPA5G75T", "Overall": "3.0", "Content": "This net book is pretty nice. I really like the track pad and the screen is sharp and colorful. I got this to replace my gateway that died, and I didn't have enough money to get another, so I got this and I couldn't be happier.UPDATE:This computer is very slow! It was so frutrating that I returned it. It took up to 10 minutes to load a webpage.", "Date": "September 27, 2013"}, {"Title": "Decent netbook for the price", "Author": "Shubham Gandhi \"sag92\"", "ReviewID": "R1T26FP0XZR18K", "Overall": "4.0", "Content": "Well for $300 I wasn't expecting much, but it does the job. It's great for just browsing the web and watching youtube or netflix. It lasts a modest 3 hours on battery.Pros: Has 2GB ram, while most other netbooks come with 1GB. Decent sized harddrive, and comes with Windows 8.Cons: The Celeron processor is a little on the slow side if you try to do a few things at once.", "Date": "July 12, 2013"}, {"Title": "Alright computer", "Author": "John T.", "ReviewID": "R1HAPDS034J0CS", "Overall": "3.0", "Content": "When we first got the computer the screen would turn blue and shut down, I fixed that problem, now it takes a really long time to start  up. I bought it for my daughter so I told her someday after school this week I would call Acer and see if I can't get some of the problems fixed. I would recommend Acer but not a refurbished one. I should have bought new I don't think she would be havng these problems.", "Date": "March 16, 2014"}, {"Title": "Acer Aspire One expensive POS!!!", "Author": "DowenA", "ReviewID": "R3ON4219SB6ZFS", "Overall": "1.0", "Content": "Let me start off by saying that I had high hopes for this little machine. I understood from the beginning that the computer's specs reflect the cost, so I expected there to be some quirks. This is my first Windows 8 machine, so there was a slight learning curve but I had it down in under a day. Aside from the awkward setup that Windows 8 is based on, this machine is SLOW, WEAK and DIES quickly. This Acer Aspire One wishes it could hang, but it just cant. Even simple tasks can make this computer freeze up, resulting in lost time. When this computer gets overwhelmed and has a fit, you are not getting anything else done for at least 10-20 minutes. Depending on the amount of work you were attempting to accomplish, the machine might even restart itself on it's lovely 12 minute restart cycle. I mean that too! This thing just sits and sits, never giving a consistent restart time. Even with the machine working flawlessly, my internet will just drop out and that's it. Sometimes it will automatically reconnect itself, but mostly I end up having to restart the machine. A return wasn't an option, so I headed down to the nearest Wal-Mart that carried this model on display. I brought my cord with me and managed to find a plug and fired the display unit up. Someone had already set it up, so I was good to play around and see if my computers experience was anything realistic. Sure enough, not even a few minutes into me testing my personal scenarios the machine locked up. This time, not even long presses of the power button could get it to restart. I couldn't take the battery out of the display unit, so I abandoned my mission feeling like this Acer Aspire One is really just a POS that I happened to buy. For the money, it's just not worth it. I had a smaller, Atom powered, Windows 7 netbook that out performed this Windows 8 machine all day long. I just needed something more and thought the Acer would have provided that. People, don't end up like me with an Expensive Paperweight that will sit on craiglist until the end of days... Stay away, trust me.", "Date": "May 30, 2013"}, {"Title": "Great purchase", "Author": "Donald W. Happe", "ReviewID": "R3S9RCUKRN3I4R", "Overall": "5.0", "Content": "It was advertised as just like new, and it exceeded those expectations.  I believe that it had never been used.", "Date": "August 30, 2013"}, {"Title": "Pathetic", "Author": "Zardshark", "ReviewID": "R320GMA25607H0", "Overall": "1.0", "Content": "I wish I could have rated this zero stars but on Amazon you can only rate 1.The trackpad sucks so badly that I never use it and always carry an external mouse.The screen sucks too because it's reflective so unless you have perfect lighting it's hard to see.There is this stupid program it runs called read HD audio or some s*** that takes up CPU and if you stop it the headphone jack won't work.  So either you have a slow computer or no headphones.  On, yeah it's already very slow anyways.The worst part is the pathetic battery life.  I always leave this piece of s*** plugged in.  I also have the screen set to dim and the battery life still sucks.  like 2 hours or something pathetic.So, in conclusion, the screen is bad, the mouse is bad, the battery is bad, and it's slow.  Worst laptop you can get.I regret buying this piece of s*** and will never get an Acer again.(lol first world problems)", "Date": "August 3, 2013"}], "ProductInfo": {"Price": "$304.99", "Features": "Screen Size: 11.6\"\nScreen Resolution: 1366 x 768\nProcessor Type: Intel\nProcessor Model: Celeron 847\nProcessor Speed: 1.1GHz", "Name": "Acer 11.6\" Aspire One Laptop 2GB 320GB | AO756-2840", "ImgURL": "http://ecx.images-amazon.com/images/I/41Xcfk8JPoL._SY300_.jpg", "ProductID": "B00BJ6UW9I"}}