{"Reviews": [{"Title": "Very good laptop", "Author": "Tommy", "ReviewID": "RPQ9NUKCY2LU5", "Overall": "5.0", "Content": "I do a lot of research before spending a lot of money on purchases. After reading reviews on several sites I decided to go with HP. I am very satisfied with this laptop, very good speed and no hangups!", "Date": "March 23, 2013"}, {"Title": "great choice!", "Author": "RWise", "ReviewID": "RLCD6S0ZNNZX6", "Overall": "5.0", "Content": "I am very pleased with this laptop. The start-up was easy. The screen and keyboard size is great. This laptop meets our needs for surfing the net, playing games, and word processing. This laptop appears to be very sturdy as well. I would recommend this product to anyone.", "Date": "July 8, 2013"}, {"Title": "Rough start-up", "Author": "Bruce Roehsner", "ReviewID": "R2TWOKBTI9G3UF", "Overall": "4.0", "Content": "The start-up was a little shaky. I had to take it to a friend who uninstalled all the garbage or bloatware as he called it. After a few hours of work it now runs fine. The touch key pad is quirky at times. Added a Microsoft 3500 wireless mouse, nice addition.", "Date": "April 11, 2014"}, {"Title": "i love it love it love it", "Author": "Bookiee", "ReviewID": "R9TA5A4JZNBID", "Overall": "5.0", "Content": "so far the laptop is everything that was promised, its working perfectly fine, am very impressed. I love it very much", "Date": "February 25, 2014"}, {"Title": "Great Laptop", "Author": "BookBella \"BookBella\"", "ReviewID": "R1NHGZAPLMQ6P8", "Overall": "5.0", "Content": "I bought this after my other one died. I had never had an HP, my last one was a Gateway. I love this laptop. It is a refurbished unit but I have had no issues at all. Runs great and very cool, not hot at all.", "Date": "February 22, 2014"}, {"Title": "Some problems", "Author": "PJR \"bmw\"", "ReviewID": "R1RF5W7BQJS0FU", "Overall": "3.0", "Content": "I really like Hewlett Packard products and have always owed a HP laptop but this is my second HP with windows 8 and I'm not sure if it's the laptop or the software. I returned the last HP and ordered this one. I really thought it would be different but I'm experiencing the same problems. I can barely touch the mouse without the screen changing sizes. Sometimes I'm on a site and it will minimize while I reading an article and I have stop and reopen. I'm constantly closlng the side screen that slides out automatically whether I click on it or not. Overall it gets pretty frustrating.", "Date": "January 21, 2014"}, {"Title": "New HP Laptop", "Author": "Steve Gorton", "ReviewID": "R3QFVA2LIXB875", "Overall": "5.0", "Content": "Received the new HP-2000-2c29WM 15.6 inch laptop as scheduled. No problems have been noted so far. Thanks for getting it to me for Christmas! =)", "Date": "December 31, 2013"}, {"Title": "Don't say refurbished if its not.", "Author": "Kevin", "ReviewID": "R2XPFEV8ZMD9QW", "Overall": "1.0", "Content": "Was not cleaned had viruses spent 120 more dollars.  NOT SATISFIED WITH THIS PRODUCT. If its going to be sold as refurbished it needs to be refurbished.", "Date": "December 22, 2013"}, {"Title": "In my opinion, this is the best laptop there is!l", "Author": "Deidre", "ReviewID": "R2IBQ8I906CEP9", "Overall": "5.0", "Content": "I think this is the best laptop there is!  It's got everything and has never given me any trouble since I got it !  I would recommend this hp laptop to everyone! It's perfect! Beautiful looking, too!", "Date": "November 29, 2013"}, {"Title": "How can they sell this at such a low price???", "Author": "Matt Roseberry", "ReviewID": "R23XPQRP1TU4Z8", "Overall": "5.0", "Content": "Bought is as a gift.  Sister raves about how nice it is.  Can't go wrong.  Buying another if I can find it at the <$400 price again.", "Date": "October 26, 2013"}, {"Title": "HP 2000 & mouse", "Author": "Irene Rose", "ReviewID": "R2VC3NXB6A0PFY", "Overall": "5.0", "Content": "I you are use to a 10 key this doesn't come with one! I love my pink mouse & works great!!", "Date": "July 27, 2013"}, {"Title": "Was great, until speaker broke after 4 months...", "Author": "Wine Diva Desi \"wine tasting diva\"", "ReviewID": "RF3EKR5EQG3CZ", "Overall": "3.0", "Content": "My son saved up and bought his first new laptop in January. He was very happy with it until today, when he announced there is a problem with the speaker plug. When he unplugs a headset, the sound goes off all together, and the only way to get it working again is to reboot. The laptop has been sitting on a table and was not mishandled. Needless to say, he is pretty upset. I usually buy everything from amazon, but this time I bought it (he bought it) from walmart online. I'm sure we have no recourse and that's $330 down the drain. If anyone has any ideas to help, it would be greatly appreciated. I'm not a computer expert, so can't really comment on technical specifics, but before this incident, he was very happy with it. However, it did seem a bit flimsy in materials to me compared to the laptops I use at work. Buyer beware.", "Date": "May 26, 2014"}, {"Title": "Glad everyone else is happy, mine already broke", "Author": "Linda Timms", "ReviewID": "R15E618N85UY9O", "Overall": "3.0", "Content": "I gave this 3 stars because I do love the computer.  However, I bought this at Walmart on Black Friday for $178, and the start button went out last night.  It is stuck on \"on\" and will not go off, and all I get is a blue screen.  I called HP, and they kindly offered to send a technician out to my house at the cost of $169.  In what lifetime would I pay them $169, to come out and fix a computer I spent $178 for?", "Date": "December 7, 2013"}, {"Title": "Absolutely to slow", "Author": "Sophia Price", "ReviewID": "RCBHETV4LFS6", "Overall": "2.0", "Content": "I love the Windows 8 and all of the features but this computer is way too slow. Maybe because I have recently been more of a Mac user but everything about the Laptop is slow. It starts up slow, when you are creating a PowerPoint it stalls after every animation that you add, or effect put on a picture. It saves documents very slow it takes forever to load programs and get started. If I had it to do again I honestly would not purchase this laptop. i only gave it 2 stars because of the features for Windows 8", "Date": "April 22, 2014"}, {"Title": "ok", "Author": "Ar", "ReviewID": "R28YB0A97JGPCT", "Overall": "3.0", "Content": "came with 8.0.  easy to change to 8.1. not that thrilled with 8.1.  good enough to give to a relative, I'll keep my old Compaq for now.", "Date": "January 13, 2014"}, {"Title": "Good one", "Author": "siaw kwabena", "ReviewID": "R1E04TKP6FXBDY", "Overall": "5.0", "Content": "i like it is really nice phone i would say that if you want phone to use this is good phone.", "Date": "January 4, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "AMD E2-1800 accelerated processor. 1.70GHz, 1MB L2 Cache\n4GB DDR3 SDRAM (expandable up to 8GB), 320GB SATA hard drive\n15.6\" HD BrightView LED-backlit display, 802.11b/g/n Wireless LAN\nHP TrueVision HD Webcam, 3 x USB 2.0 ports\nMicrosoft Office Trial Version, Windows 8", "Name": "HP 2000-2c29WM 15.6-Inch Laptop PC (Black Licorice) / 4GB DDR3 RAM Memory / 500GB Hard Drive / Webcam / HDMI / Double-layer DVD±RW/CD-RW / Windows 8 / 1.7GHz AMD E2-1800 Processor", "ImgURL": "http://ecx.images-amazon.com/images/I/41ZzngaGiNL._SY300_.jpg", "ProductID": "B00BLOBRO2"}}