{"Reviews": [{"Title": "Just DON'T do it, its not worth it.", "Author": "emjay25", "ReviewID": "RR6UA51MH5NHQ", "Overall": "1.0", "Content": "This has been by far the worst computer experience I have ever had. I will absolutely never buy from Toshiba again. I ordered from Toshiba directly. In order of occurrence:1) They said they'd ship next day, they shipped almost three weeks later...and only after I sent an inquiry.2)Computer finally arrives. It was fine, speedy and light as promised. Fan is a bit loud, speakers are tinny but I expected this from the reviews.3) 2.5 months in: my screen stops working.4) I troubleshoot with their online whatsit, repairs are suggested.5) I call, go through troubleshooting again. Tech services interrupts constantly while I am answering to ask the exact same question again. Eventually, they decide I do in fact need repairs. Tells me I need to pay for shipping...on my two month old computer, under warranty, with a major issue. I have had three computers, with three brands, I have never been asked to pay shipping on a warrantied computer. When I object, tech services interrupts again to tell me how its so awesome that they include all the packaging and everything...this is really not that awesome, its just basic customer service. I ask to return and after trying to sell the shipping about 4 more times he finally transfers me to customer service.6) Upon arriving at customer service there is NO option to speak to a representative, pressing zero saying representative gets me HUNG UP ON by the electronic system. Wow.7) Somehow finally manage to speak to a person, and a manager. I'm informed that I can't return my computer b/c its past 14 days BUT the shipping actually is free, they can set up a box to be sent. Greeat, we can finally get this fixed up.8) Box arrives...and its 2 inches too small for my computer. Seriously?9) Can't find anyway at all in their completely automated website to ask the fairly simple question of \"can you resend my box, in the right size, please?\" When I finally get someone on live chat, all they do is give me the number for customer service...the customer service system that hangs up on its customers.Any one or two of these things wouldn't be so bad. They're just part and parcel of the digital age of customer service but EVERY single step with Toshiba has been an uphill battle through crappy service, crappy systems, and crappy policies that treat the customer as an enemy. The computer is light, and when it worked it was nice to have, but in the end, its just NOT worth dealing with Toshiba.", "Date": "June 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BADYAXO"}}