{"Reviews": [{"Title": "good so far.", "Author": "dissed", "ReviewID": "R3CTR25OC9MJKY", "Overall": "5.0", "Content": "**update 8/21**this computer screams...no junk..nothing! i took things a step further (i guess i was bored) the other week and completely formatted the laptop with a fresh copy of windows 8 via usb.this gets really kinda techie so if your not up to the task just skim over this part of the review.from Microsoft's terms of service. \"May I make a backup copy? Yes, you may make a single copy of the software for backup purposes..\"do the following at your own risk.with some google searching...you will need to download the official .iso format of windows 8 file named: en_windows_8_x64_dvd_915440.iso and make sure it matches the id sum: 1CE53AD5F60419CF04A715CF3233F247E48BEEC4. (official version)after thats downloaded then google: Windows7-USB-DVD-tool (don't worry it works with win 8 too)run the program and select the .iso and make your bootable usb of windows 8. (i used a 4gb sandisk thumb drive)copy all the files off the same thumb drive and reformat the drive to a fat32. why? samsung boot cant read NTFS format.then put all the boot files you took off back on the newly formatted thumb drive.unplug the usb drive.reboot your pc. repeat pressing f2 during boot to enter bios.change under advanced tab fast bios mode to disabled.change usb charge in sleep mode to enabled.save settings and reboot. put in the win8 usb in the 2.0 usb slot (right side) and boot to bios again by repeatedly pressing f2.go to boot tab change your boot order to the usb instead of the hard drive to top of list. save and exit.win 8 install screen will boot. select the install a fresh copy option. delete all partitions. install win8. you will not need a win 8 key. you own win 8 and the key is imbeded in the samsung bios system. there will be no option to put a key in.when booted in windows 8 and you have a big smile that your computer is completely clean...do a google search and download the sw update software. re download all software/drivers via samsungs software.everything work like a charm now. fresh and clean windows 8.i also recommend start 8 software. i prefer a desktop experience and having a start button like win7.afterwards, go back into bios and reverse your settings to the defaults, what they were before you changed them.enjoy friends!**update 6/26**just a quick heads up!do not bother updating to the new intel driver released 6/4/13 for wifi.i tried it for a couple days and the wifi issues came right back again.just stay on the microsoft wifi driver and you will be fine.**update 6/19**after a month this computer is still a beast. after reading the long thread and discussion about putting in a SSD, and it being too difficult i figured i would give a shot at installing one. (remember now i have no tech experience). well let me tell you it was retarded easy...and i did it in 20 minutes. and man this thing screams!!!so you want to upgrade the ssd? do it. its easy. and don't worry the back comes off super easy and no it wont snap if you pull carefully.steps you ask? don't mind if i do. :)(before proceeding with this please order some nitrile latex free gloves and a micro philips screwdriver)*order the samsung 840 ssd with the data transfer cable kit. (to clone your current hard drive)*install data migration tool off samsung website and clone hard drive. (it took about 45 min)*shut down computer, flip over computer, unscrew ALL back screws.*start at front computer corner (left or right, doesn't matter) with a credit card pop up the edge.*take that same card and push it down the crack on the whole front side of computer.(it will pop all the clips out, don't worry it wont break)*do the same on both sides pulling the cover back. only thing now that should be connected is the back corner hinge things.*push the back plate forward off the hinges and the enire backplate will come off.*unscrew harddrive mount screws.*unscrew hard drive holder screws.*replace hard drive with ssd.*reverse all your steps and re-boot.this thing boots in 3 seconds now completely and opens all programs instantly.ill post a few pics under user pics. enjoy.--------------------------------------------------------------------------ive had this laptop for a few days so far so i will update this review as time goes on.the good:1920x1080p resolution w/touch on a ultra book style laptop.dedicated GPU plus integrated.(good for those who play a game now and then)back-lit keyboardthe touchbad: i love it, works almost as well as a mac...no joke.amazing speakers...no joke very good for a laptop.solid built laptop with premium feel.decently thin with what i think is a perfect size screen/keyboardaluminum body.small power brick.5ghz wireless support.decent battery life.2 video outs (hdmi/vga for dual monitor support)core i7/8gb ramthe bad:no solid state hard drive (you can notice it slows loading speeds down a tad)no matte screen :( screen will have smudges especially touching with your finger.aluminum body does leave smudges, but not that bad.the plastic in-between the keys on the keyboard is GLOSSY! so dumb. it gets all greasy looking in-between keys. the picture they have showing it on here it looks matte but believe me its not...not a huge deal but whatever.fn lock key, adjustable everything, u can even turn the fan noise down or completely off.THE BIGGEST CON?Intel 6235 wifi driver. If you on wifi it cuts you off randomly sometimes...and its really annoying, It is not the chip its the DRIVER. was almost a deal breaker but heres the fix:getting rid of the \"intel\" driver and reverting to Microsoft driver.1. Uninstall the Intel Proset wireless software/driver from the computer under control panel uninstall program. (not the blue tooth just the wireless)...after thats done..2. Open device manager/network adapters3. double click centrino advanced-n 62354.click driver tab5. It should say driver provider Microsoft / 12/5/2011 / 14.8.8.756. click events tab to see if driver service added was (NETwNe64)that will fix the drop problems.then fine tune your adapter1. click tab power management  / uncheck allow computer to turn device off to save power2. click tab advanced / make sure transmit power is set to highestwell i love this thing. its awesome. its slick. its powerful and it will make you very happy.questions? just ask.buy it", "Date": "May 23, 2013"}, {"Title": "Beware...", "Author": "c1oudrs", "ReviewID": "R3BHF2SG163SZU", "Overall": "2.0", "Content": "Ok--all the reviews about this laptop are true.  It's great for the money.However, there are some design considerations to keep in mind.  1rst--the battery is buried in the unit.  So you won't be able to swap out the battery (or take the battery out).  2nd--unlike some other laptops (ASUS comes to mind)...this Samsung laptop comes out of sleep & hibernation via the power button... hitting any key won't do it; you HAVE to use the power button.  3rd--if you hold down the power button for 5-20 seconds, it doesn't necessarily reboot.This combination opens the door to a catastrophic failure.  If you get stuck in sleep mode...how will you reboot the computer into post?  That's what happened to me after the first morning with this laptop.  If holding down the power button doesn't work to reboot out of sleep mode, then SOP is to take out the battery--except you can't with this unit.  Engineering woopsie.  There is a little pin hole in the back that is supposed to disengage the battery but my suspicion is that it doesn't fully do so.  Likewise it might be pretty hard to total drain the battery.  So your stuck in sleep mode.After the first day with my new laptop I had what amounted to a brick blinking 'sleep mode'.  I called Samsung customer support--the guy was real nice but he couldn't get the laptop out of sleep mode any more than I could.Thank goodness I bought with Amazon.  I was able to return this Samsung unit with no problems and I bought another brand with better engineering.", "Date": "August 9, 2013"}, {"Title": "Defective but otherwise good...", "Author": "TheGarbageEater", "ReviewID": "R3T8FY0341IR9J", "Overall": "4.0", "Content": "Pros: Nice design, solid feeling keyboard, touchscreen, good specsCons: WiFi Drop-outs, Auto back-lit Keyboard, Heating/Fan Issue (on first laptop), minor smudging, no SSDMay 14th 2013Received this laptop today and almost immediately noticed it had a fan and heating issue. Alot of heat keeps being produced at minimal cpu usage (only surfing the internet) so the fan, located right underneath the screen by the hinge, keeps kicking into an abnormally high rpm to cool down the system. The system continually becomes very hot and the top of the keyboard, possibly thanks to the fan location, becomes hot to the touch as well. This includes the 3 or 4 top rows of keys, making it extremely uncomfortable to use for even brief typing periods. Also putting the computer into the lower performance mode with the F11 Fn doesnt do much to fix this heating issue.In short this means it is a very loud and extremely hot system most of the time... which needless to say completely ruins the computer.I contacted Samsung about the issue and after about a good 45 minutes they suggested i send the laptop in for repair. I am awaiting a replacement laptop from amazon at the moment, will update to see if same issue occurs or if it's just an isolated defect.During the periods of time when it is not behaving this way however i am pleased with the laptop (although keep in mind ive only had it for a few hours now). The keyboard is surprisingly very comfortable, the touchscreen works well, and the overall mechanical build is of high quality. The screen has almost no wobble but has some reflection to it like any device. The 1080p graphics on it are a surprising huge step up from the 720p of my 4 year old laptop too. The matte finish of the case unfortunately allows for minor smudging, which might bother some especially if moving from a silver finish like myself, but isnt a major annoyance. The few times i tested the JBL speakers i was impressed. They are certainly nice especially compared to your typical laptop speakers.Apart from these minor things and the heating issue I had the Ativ book 6 is a first rate computer by my standards.5/16/13:Received replacement laptop yesterday and was suffering from same heating/fan issue initially for a  bit even after the initialization and all the updates were completed. Today however the fan has been low and heat minimal unlike the initial laptop. Ran the replacement laptop at max cpu usage and experienced the same heat as what the initial laptop experienced at 3% usage, fan wasnt interchanging btwn rpms though which is another good sign for this one. Also confirms something was terribly wrong with the first unit. Additionally putting it into low power mode with F11 puts the fan to a whisper even quieter than the 'low' rpm it has been at today (had no effect one defective unit fyi).To be more specific than before the defective computer became very hot where the fan blows causing the keyboard keys to become hot and uncomfortable. Fan would not run at a consistent rpm for a long duration but rather interchanged between medium and high, along with a rare low, when simply browsing the internet. Running the photoshop app alongside certainly made it worse. Plugging the battery charger in also causes the fan to increase rpm and vice versa independent of the charge on the battery too on both computers.5/27/13:Had this replacement computer for awhile now and was experiencing frequency wifi drop-outs and connectivity issues. After uninstalling the intel driver and reverting to the windows one (as described by dissed in the review below) I have not experienced any issues! Had to change power settings as well so that the computer wouldnt turn off the wifi to save power.Another issue is that the computer automatically turns on the keyboard back-lighting during low light conditions. The reason this is an issue is that you are unable to turn this off and unable to control the brightness level.Certainty had alot of headaches with the defect unit and wifi issues, these things aside this laptop runs great!So in quick summary computer initially has lots of wifi issues/drop-outs and is prone to become a bit hot/noisy under heavy loads. Unable to turn off keyboard back-lighting during the night and smudging is pretty common on the casing (but not too bad). Battery life was about 4.5 hours in my case which is alright considering the i7 and graphics card inside this laptop. Lastly had to make a few setting changes due to alot of automated things that dont make any sense (like putting the computer into sleep mode after 1min idle on battery and disconnecting wifi adapter after 5min). Meaning that someone who isnt great with computers might want to avoid all this hassle.", "Date": "May 15, 2013"}, {"Title": "Broke after 1 month, waiting more than 7 weeks for Samsung to repair it!", "Author": "J Penname", "ReviewID": "R308JCH2K8B2AW", "Overall": "1.0", "Content": "I bought this laptop, and after slightly more than one month the case around the screen started to come apart.  It seems not to be held together by any screws, only plastic snaps, and the snaps were not holding.I went on Samsungs website for customer support, and was told I would have to ship it (and pay for shipping) to them and then I had to pay them $60 to diagnose the problem.  I said that didn't sound right, and that it should be covered by warranty, and why do I have to pay for diagnosis, especially when the problem is clear?  The Samsung rep then told me what they just told me was wrong, and I would have to take it to a service center.  I asked for the nearest Samsung Service Center, they said that they didn't have that information and could not tell me.  I googled it myself.  How can I figure this out myself in 1 minute on Google and a Samsung rep cannot tell me at all?So I go to the Samsung Service Center and am told it will take 3 to 5 days to fix, maybe sooner, and they will call me.  After 5 days and no call, I went back to the Center.  They had not touched my laptop.  They told me I had to pay $228 to fix it because of \"customer abuse.\"  I had taken very good care of the laptop and in no way, shape or form done anything to damage or drop it.  They had said nothing about when I first came in and showed it to them about any concern that I had caused the damage myself.  They had not called me in 5 days to tell me about the situation.  They insisted they had called me, but when I produced phone records showing that they haven't (my smart phone keeps track of every call and every missed call, even when the phone is off) they went silent.  The rep then got the manager of the Center who again kept insisting that I had broken it so had to pay $228.  I explained again that I hadn't, that besides the case coming apart everything else was fine with the laptop physically--no scratches, dents, cracked screen, etc.I asked to speak to manager's superior, and the manager responded by saying she would have to put in a request to get it fixed for free.  Finally, a few days later I received a call from the manager saying it was covered by warranty and they would finally fix it and for free, but had to order the part and it would take 2 or 3 weeks.After 3 weeks, I had heard nothing and called the manager.  I was told the replacement part they received wasn't working and they were waiting to hear what to do.  I waited another week, and called back since no one updated me.  Manager told me the same story, still waiting on instructions on what to do since the replacement part wasn't working.  Called again, and got same story.  I asked to speak to her supervisor, but was told he didn't speak English.  When I finally got him on the phone, he spoke English just fine.  He promised to call me back in a few hours but never did.Samsung has now had my laptop for over 7 weeks and have been unable to fix a simple defective case.  Beyond that, I have gotten conflicting information, been asked multiple times by multiple people to have to pay different amounts of money for an issue that should be completely covered by the warranty, been lied to and been ignored.I spent over $1000 on this laptop, had it little over a month, and have had it sitting broken at the Samsung Service Center for a longer amount of time.  I have no idea when it will be fixed, if ever.I can in no way recommend this laptop.  I understand that any electronic company will have some products with defects, but am not happy at how quickly this laptop started to fall apart and the incredibly horrible customer service I have received in response to the issue.", "Date": "November 13, 2013"}, {"Title": "Amazing Potential - But a few issues.", "Author": "Joe Hi-O", "ReviewID": "R2EAGYJ7S5N99S", "Overall": "5.0", "Content": "I love everything about this laptop. The display is gorgeous Full HD. The JBL speakers are fantastic. The touchscreen is very responsive as well. I do have a couple issues with this Laptop though. It came with a dead pixel to the left center of the screen, it's only really noticeable when watching darker videos or darker backgrounds. But during those particular times, it can be quite annoying. On top of that, I'm having the same WiFi issues as the other two reviewers are having so far. If I am just sitting in a webpage typing and the laptop isn't attempting to connect it's fine and seems to be working great. But if I go to youtube or another website to watch an HD video, sometimes even just a basic webpage, the WiFi will start doing the same thing as the other reviewers. As expensive as this laptop is, I'd expect the Wifi to work properly.I love Samsung products, I own a Galaxy Note 2 cell phone, I have a Samsung Google Chromebook, a Samsung HD Television, and now this laptop. I'm hoping I can have it replaced with a model that has a fixed WiFi card and preferably without the dead pixel. I'm going to give it a day or so and see if the WiFi issue gets resolved, but if it doesn't I will most definitely be returning the laptop and hopefully having it replaced with a fully working model.So I'm giving this Laptop a 2/5 for shipping with a dead Pixel and a pretty terrible WiFi issue. Changing battery settings didn't help my issue at all. But I'll happily give this a 5/5 if I can get the dead pixel and wifi issue resolved.----------------------------------------------------UPDATE:I received my replacement Laptop today and the WiFi was still an issue for me. After reading \"Dissed\" review (which was added after my original review) I followed his advice and deleted the default Intel WiFi drivers and let them roll back to the basic Microsoft drivers and I've had Zero issues since then. The WiFi is working perfectly and quickly. It's also nice that this unit has no dead pixels. (also, my original model was having Touchpad issues that I didn't notice until after I wrote my original review) this unit has zero issues with that at all. It's an amazing laptop with a top quality screen. Worth every penny. I have now kept my promise and will upgrade this review to a 5/5. Fantastic Purchase so far.", "Date": "May 22, 2013"}, {"Title": "Lotta bang for the buck; couple of small things", "Author": "Brent", "ReviewID": "R1OPL1IPHV9BG1", "Overall": "5.0", "Content": "I must say, this laptop was a great purchase and I have zero regrets. Its a touch on the heavy side for a laptop this size, but the trade off is an easy one; its feels incredibly sturdy. There are  couple of issues that are definitely not make or break, but are quality of life wishes and things to maybe consider: - Windows 8, while not as awful as it is made out to be, is pretty bad. The curve is somewhat steep moving from Windows 7, but not insurmountable. Red a guide before the purchase and pick one up frequently as you use this machine. It helps. - The WiFi does drop out when you close the lid and open it up. a quick toggle of the airplane switch turns it back on. This can likely be controlled via some of the device/power options, it its so incredibly minor, I haven't even poked around. - The Catalyst control panel is a bit confusing, but once its sorted an properly set up, the switching between graphics cards is seamless and the Radeon sings and the heat output is not that much greater. - The speakers are on the bottom of the laptop. Odd choice, I thought, but I usually (if not always) have headphones on. - The bloatwaree is fairly easy to remove.The good is great though: - The graphics are stellar and the display when cranked to the max is beautiful. Deep, rich and colorful. - The backlit keyboard is great, it is bright enough to be seen in a well lit room and not so bright that it burns out your retinas in a dark one. - It's a pretty quick little computer; the hard drive is spacey as well. - The laptop itself runs quietly and with very little heat even after an hour or two of run. - The touchscreen is very responsive; much more so than many of the floor models I've seen at certain electronics stores.I would buy it again and not think twice about it. Dollar for dollar, I have yet to see a better value.Suggestion, however: grab a windows 8 compatible mouseLogitech Zone Touch Mouse T400 for Windows 8 - Black (910-003041) for instance.", "Date": "July 8, 2013"}, {"Title": "Overall I am disappointed", "Author": "Tamela M. Halvorson", "ReviewID": "R3L2W6W2G5UAWG", "Overall": "2.0", "Content": "Overall I am disappointed with this laptop and now with Samsung as a company.The laptops review is below but I thought I would start with why owning this laptops has made me disappointed with the company. I wrote a negative review about this laptop on the company's website but they denied the review. They claimed it was because I mentioned other products in my review, but I think it was because it was too negative about their product. The review they denied is below so you can make up your own mind about why it was denied. My personal feeling is they are using their \"posting guidelines\" to help keep out negative reviews and the reviews are why I purchased the laptop.The bad: The laptop uses a slow 5400 RPM hard drive even though many other laptops in the same price range use 7200 or very small SSD. You can't upgrade the hard drive either because it voids the warranty. This is due to a poor design, instead of having an access door like they do on many other of their laptops. The next problem with this laptops is that the battery is built in so you can't change it either without voiding the warranty. The last problem I have with this laptop is that they use a 3rd generation Intel processor instead of the current 4th generation. Even though the 4th has been out for a while and it would save some battery life and be faster they choose not to use it. I decided I would deal with the poor design issues because it was getting great reviews.The good: The laptop has a great touch screen and the screen is bright with great detail which good because I am a photographer. You can upgrade the RAM to 16GB and the battery is fantastic. I can get between 7-8 hours with general continuous use.I think if I as allowed I would upgrade the laptop with an SSD and then with the 16GB of RAM this laptops would scream.My experience with windows 8.1 on this Laptops:I tied the upgrade to Windows 8.1 and this laptops would no longer function. I contacted Samsung and they said it was a Microsoft issue. From my research it looks like a driver issue so I am not sure who is dropping the ball on this one but to me is seems like Samsung needs to put a little pressure on the manufactures of their hardware to get a driver submitted to Microsoft.", "Date": "November 5, 2013"}, {"Title": "Very good once you replace the HDD with an SSD", "Author": "Brandon \"ba116\"", "ReviewID": "R3T6QC9YSX1WKH", "Overall": "4.0", "Content": "I was shocked at how slow the computer was for the first week that i used it. Programs would constantly hang as the computer tried to catch up. Startup (including automatically starting Outlook) took over 90 seconds. Opening a metro app (like mail or weather) took about 7 seconds. That is not what i was expecting w/ a quad core i7 and 8 GB of memory. The hard drive was obviously the culprit so i replaced it w/ a Crucial SSD (256GB). It's night and day. It feels zippy, programs ope quickly, full startup is about 25 seconds.Also, one of my main concerns with going from a macbook pro to a pc was the trackpad. This one is quite good. It's not as nice as a macbook but it's fairly close. The main issue is that it often highlights text when i'm just trying to move the mouse. I turned off the tap to drag feature which was just infuriating (and unnecessary). Overall, i'd say the trackpad is 80% as good as a macbook pro.UPDATE TO THE FOLLOWING PARAGRAPH:I spent the weekend really trying to learn windows 8. I played around w/ the metro apps, learned the shortcuts, learned how to navigate around, etc and I am much happier w/ it than i was when i wrote this review. Metro is actually pretty damn nice, despite the fact that it's not well integrated into the traditional OS. I think once windows 8.1 comes out, it'll be a  real winner.  /END UPDATEAs far as Windows 8 is concerned, I'm largely unimpressed. Maybe i just need to give it more time but it is quite annoying most of the time. I just want a minimize button and close button on every app. Perhaps windows 8.1 will bring that. If you've ever used parallels for mac, it is quite similar to using windows 8. The standard windows desktop and the windows metro interface are like two completely separate entities, much like parallels and OS X. It just doesn't flow well at all. But windows 8 doesn't factor into my star rating b/c you can always install win 7 on this machine.I deducted one star b/c I'm just not blown away. It's a very good machine but just not as nice as a macbook pro (which is deserving of 5 stars, IMO). But using parallels sucked so i needed a PC. This was a good choice.", "Date": "June 29, 2013"}, {"Title": "enjoyable but frustrating", "Author": "ryan sherbun", "ReviewID": "R1YXT0DQ2YFJFN", "Overall": "3.0", "Content": "I am fairly tech savvy and i fall in the group of bigger is better. i was contiplateing between this laptop and an ultrabook. I didn't buy it for its size or the size of the hard drive (but it is nice). i picked this one because of the keyboard and its number pad and i am glad i did. Doing real work on the computer, having the number pad attached is nice. It has a great keyboard, its sleek and feels solid just like the unit. It has a awesome screen, its beautifully clear and sharp. My frustrating complaint is, its side/sync and home network are terriblely difficult to get each devise to see each other and transfer files. Side sync works once it finds your phone. i love samsung products but they put a lot of bloat ware in. i recommend removing it first thing. Many people complained about how slow it was, and it was when i first got it but after i installed all the updates its quick enough. Now its not SSD fast but if you want that you can change the HD for a SSD yourself. Basicly i give it a thumbs up", "Date": "August 22, 2013"}, {"Title": "Great notebook computer, smoking fast with an added SSD", "Author": "Cedar", "ReviewID": "R3KCSMDSJNIY2A", "Overall": "5.0", "Content": "Followed the directions posted here for installing the Samsung 840 Pro series 256GB SSD and this thing works great.  Boots to log in about 15 seconds (I've already loaded a bunch of software that slows it down too, before the added software it booted in about 7 seconds).  Super slim, had to bite the bullet on Windows 8 and have had a few problems with USB 3.0 hubs crashing the OS but overall I'm very happy with this system.  It replaced a 2 year old Asus G75 17\" notebook, but is way faster and many pounds lighter.  I use this as my main desktop/development system, choosing to carry a 2TB USB 3.0 WD passport external drive to lug all the archive junk, old docs, music and photo collections, etc.", "Date": "July 29, 2013"}, {"Title": "A great buy!", "Author": "J. Shain", "ReviewID": "RBSUSYIREP1CV", "Overall": "5.0", "Content": "I am rewriting my review to cover some things in a bit more detail.The battery and hard drive are not user serviceable, it is not easily accessible unlike the memory which you can upgrade yourself. Another reviewer posted a how-to on replacing the hard drive, but be warn if you do it yourself you could void your warranty. Also extended warranties (i.e. SquareTrade) don't generally cover accessories and that includes the battery, but since its technically part of the laptop then its theoretically covered under their warranty, you would think.This laptop had a solid quality feel and at less than an inch thick, its also very thin.Realistic battery life  is about 4 hours if you don't drain it all the way and only using minimum load with Intel's integrated graphic. Since battery can not be removed, buying an extended or additional battery isn't likely. If you need more battery life, a external battery is another option.I didn't have any Wifi issues as other reviews mentioned, but wasn't worried since another reviewer posted a fix.The weakest link is the hard drive, but for the price it's a pretty powerful laptop. To get a laptop at this price with an SSD, you would be sacrificing processor, graphics, quality, and/or etc. I can live with the hard drive, seeing how its one of the only things that can be changed for a noticeable improvement in performance without having to replaced the laptop itself. I much rather have a better spec laptop and just replace the hard drive down the road with a more affordable SSD then having to replace a lower spec laptop because it's just not cutting it anymore. Even with the limitations of the hard drive and some optimization, boot up time is about 45 seconds give or take and opening up programs like Photoshop takes less than 15 seconds. However, if you use sleep mode often and reopen a program you previously exited out of then it only takes a few seconds to do. I currently favor capacity and getting an SSD that meets my needs is cost prohibitive.This laptop packs a switchable Intel integrated HD 4000 graphics which is sufficient for most task to help conserve power and AMD dedicated HD 8770M 1GB DDR5 for when you need it. Manageable by right clicking the desktop and clicking Configure Switchable Graphics. I don't consider this a gaming laptop by any means, but might be a capable laptop for the casual gamer. I was able to play PlanetSide 2 smoothly on medium overall at 1920x1080, but FPS slowed to a crawl in highly populated battles. It's still  pretty remarkable what this little thing could do. Also the entire time gaming, the laptop was very warm to the touch and had me a little concern about cooling. I did paired this up with Cooler Master NotePal X-Slim Ultra-Slim Laptop Cooling Pad with 160mm Fan (R9-NBC-XSLI-GP) to help aid in cooling which is perfect fit for the laptop.Touchscreen is a plus. I felt it made Metro a much more pleasant experience, but I prefer multitasking and still favor the desktop. The touchscreen is still a convenience to have for other things and I use it in conjunction with my Microsoft Arc Touch Mouse - Black and find myself rarely using the touchpad. However the touchpad is quite nice, the surface area you use to move the cursor around is much larger since the left/right button is built into it.The convenience of Fn Lock makes it simple & quick to change volume, brightness, and etc. Also, the silent mode button is a nice feature that quiets down the internal fan. I can see that being useful at places like the library.I further removed all the unnecessary software that came installed. The only annoyance was the start up program, SAgent. That's in the Task Scheduler and you simply stop then disable it in that panel. Got rid of Norton and enabled Windows Defender instead. Also coming from Windows 7, I missed the function of the Start button so I installed Classic Shell.My final thought is this laptop is a great buy, as long as you can get past the lack of an SSD and just put one in yourself if you want to further improve performance.", "Date": "June 28, 2013"}, {"Title": "Very Nice Laptop for work", "Author": "Alfalahi", "ReviewID": "R2WWH44CL89O0X", "Overall": "5.0", "Content": "i like this laptop , now i own 4 laptops , Toshiba , Msi , Lenovo and now samsunghere what you need to know1- it has built in Battery2- it has 2 video cards , Intel 4000 and Ati 8770 1GB3-samsung sw update which update everything in your machine even Bios4-recovery software very easy just saved factory image on external HDD5- has fan button and i dont know if that work or not (FN+9) i believe7-keyboard better than everything i owned before8-touch screen with full HDi almost forgot , this laptop has no CD/WR/DVD/Blu driver (who needs it now days anyway)im going to try it and post moreupdate 16-4-2014its going to be hard on people who don't know how to work the AMD video card on this laptopyou need to left click on desktop and switchable video card then added the game / program to the AMD list ( High performance ) so game/program work using AMD video cardalso make sure the power management on High performance ( right corner next to time/date )or Samsung need to make new Bios which you can disable the Intel card or make easy video driver for games ( i don't think i ever got video driver update since i bought this laptop )also be careful if you going to install Linux , this laptop isn't Linux friendly , some laptops from Samsung got damage because of Bios bugdo not update to windows 8.1 unless you know what you doing , clean install better and you need SW update software from Samsungthis laptop would be great if it have only 1 video card AMD or Nvidia most people have trouble with switchable cardsfor Samsung please next time when you want to sell something make sure the Specifications is correctjust checked your website for the same laptop and it says AMD card , it dose not says Intel and AMD (misleading )", "Date": "July 8, 2013"}, {"Title": "Love the laptop - WiFi resolved", "Author": "Gunder", "ReviewID": "R29DWCJBCHPGP9", "Overall": "5.0", "Content": "Just received my laptop and am really impressed.  Though much heavier than my wife's series 9, this laptop is very sleek and well built.  I did have the same wifi issues as the others. After trying many suggested fixes I was finally able to resolve the issue by rolling back the driver to the Microsoft version.  Three days later and not a single dropped connection.", "Date": "May 24, 2013"}, {"Title": "Disappointing and Frustrating", "Author": "Mark M Ford", "ReviewID": "RB91LOKH8XFC2", "Overall": "2.0", "Content": "This is a disappointing experience - my list of issues is similar to many others posted.  This machine is frustratingly slow, quirky and pretty much does what it wants to, not what I want it to do.  Freeze ups, jerky navigating, WIFI dropouts, unwanted messages.  Difficult to tune - locked tight and adjustments hidden.  I have bought many computers in my time and this is as unhappy as I have ever been - and As much as loved my past Samsung products, this isn't one of them.", "Date": "November 9, 2013"}, {"Title": "all good except for wi-fi driver issues", "Author": "Paul Alexander", "ReviewID": "R2PZ5SD371D43H", "Overall": "4.0", "Content": "Bought this for my daughter heading off to college.  Came in good condition and was easy to start using right out of the box.  We had read the other reviews concerning the WI-FI driver and noted the same problem as well.  She was able to follow the instructions from the other reviews to change the driver and now has no issues.  I would have given 5 stars except for that issue.", "Date": "August 22, 2013"}, {"Title": "A Great Deal and Great Product from Amazon !!", "Author": "Robert J. Wayner", "ReviewID": "R25I3CJRFJUUJX", "Overall": "5.0", "Content": "I tried several laptops (Acer, Dell, Lenovo) before I ended up buying this one. I wanted touch screen, quad core processor, a good dedicated graphics card, SSD, and relatively lighter weight than my 2 year old HP. The Book 6 came the closest to providing most of what I wanted. My only wish was for a SSD but I can live without it for now. Best Buy offered to install one but I hate to give up the capacity of the 1T hard drive. Samsung makes good products including their Pro series 840 SSD so I may opt for it later on when prices drop I hope. Getting use to Windows 8 was a struggle but Start8 helped a whole lot. I really like this laptop. Even the internal JBL speakers sound good although I use Bose Soundlink. The keyboard is easy to see and the screen is bright providing lots of contrast. I tried a few tablets too but wasn't happy with either the small screens or their lack of horsepower. It doesn't have an optical drive but that's not a deal breaker for me since I DL most of my programs and it would have added extra weight but you can always purchase an external burner. I'm also very happy with Amazon since they delivered the laptop (well packaged) next day in the afternoon. They are amazing offering great prices and I will order from them again without hesitation. Amazon is a company you can rely on for excellent service and prices !!", "Date": "June 24, 2013"}, {"Title": "Love my new laptop, Ativ 6!", "Author": "James Saunders \"Crimson Seoul\"", "ReviewID": "R33Y3BUTWB0UIN", "Overall": "5.0", "Content": "Just got this laptop in the mail today. Been playing with it for about 3 hours. I love this laptop! I haven't experienced the same issues as the first reviewer. No heat issues, little to no fan noise and wifi connects no problem. Browser speed is faster than my new workstation I use for work. I'm really impressed. The keys are really comfortable and quiet. It has a number pad which is nice. It's so sleek and pretty. It's just a beautiful and it feels sturdy. The screen is really crisp and very responsive to touch. Overall after a few hours of playing with this beauty, I absolutely recommend this laptop.Update 5-24-2013.Have had this computer about a week, still loving it. I started having some intermittent connection issues with wifi. My other laptop and dropcam connections were experiencing zero problems. I followed what the first reviewer said about changing the power settings for wifi to maximum performance. I still had occasional issues. I did the rollback to microsoft driver fix that a reviewer, dissed, said would fix the problem. Now this laptob is nearly perfect. So yeah, no other issues to report. My only noticeable negative is that this thing loves fingerprints. It's really no big deal, just wipe it down every so often. Windows 8 doesn't seem to be everyone's favorite software, but after playing with it for about a week, I've gotten used to it and now I actually prefer it. Boot up from sleep is pretty much instant. Really enjoying this machine.", "Date": "May 16, 2013"}, {"Title": "Great Computer, just too slow", "Author": "Joseph S. Borrow", "ReviewID": "RI9QPLVSFH379", "Overall": "3.0", "Content": "Flawless shipping, flawless set-up...far too much Samsung bloatware.  Am using a SSD on my desktop, and found this painfully slow. Considered opening and changing out the 5400 RPM drive, but decided to opt for a laptop with a built in SSD. For this reason only, returned the laptop.", "Date": "June 25, 2013"}, {"Title": "Very happy !", "Author": "Glamak", "ReviewID": "R2UFWZHF8H238P", "Overall": "5.0", "Content": "I am very happy with laptop itself, everything meet or exceed expectations.Like usually always something: I would like that come with Windows 7 instead of Windows 8, but again overall very happy. Laptop came on the time and was in original box. Happy camper !", "Date": "January 14, 2014"}, {"Title": "Major screen issues.", "Author": "juttman", "ReviewID": "R2H6C3EINGQEOP", "Overall": "2.0", "Content": "Worked perfectly for about 1 month.  Now the screen flashes/pulsates & strange lines go across the screen without notice.  Not sure what is happening here but the last computer I bought lasted 4 years.  This one is less than 2 months old.", "Date": "November 21, 2013"}, {"Title": "Amazing hardware and feel. Software took a little work.", "Author": "Dylan", "ReviewID": "R8VSC4N8D63MJ", "Overall": "5.0", "Content": "Build:Lets start on the physical build of the computer. I love it. The design is simple and classy looking yet is still interesting. The laptop feels EXTREMELY solid. There is no flex in the keyboard or where you rest your hands.The hinge is very sturdy and allows you almost 180 degrees of motion. This thing is also very thin, but it still does have some weight. Nothing unmanageable though. The material is very nice with the aluminium deck/top and plastic on the bottom. The entire laptop just feels premium.Hardware:Not much to say/complain about here. The computer has solid specs. A speedy processor and decent gpu, enough to do most anything including some gaming. Don't expect 1080p ultra though. The ability to add a second ram stick is a nice touch, but 8gb is enough for most things. The biggest letdown was the hard drive. I had an SSD laying around so I replaced the hard drive. If you aren't afraid to open the laptop I would for sure put in an SSD. It makes the laptops seem twice as fast if not more. I also bought a usb3 hard drive enclosure for the 1tb so I can keep the space but have the speed of the SSD.Software:Biggest issue beside the slow hard drive. When I first got the laptop it barely worked. I don't know what the issue was but it caused the entire computer to be almost unusable. I almost just fresh installed windows but I was able to fix the issue by uninstalling all the junkware, which there is a lot of. After uninstalling the junk I have no issues.After I removed the junkware and replaced the hard drive with an SSD the computer is amazing. I would have trouble recommending the laptop unless you will put in an SSD because it feels to slow otherwise. Also, the touchscreen is very nice. it seems weird at first but it is very natural to use it. I don't use it for everything but I wouldn't want to get another laptop without one. It just feel natural when using it in some scenarios.4/5 with included hard drive. 5/5 AMAZING if you put in an SSD.", "Date": "May 6, 2014"}, {"Title": "Solid computer with amazing performance for everyday use.", "Author": "Z", "ReviewID": "R1W11KLUAKG23U", "Overall": "5.0", "Content": "At $1,199, the Samsung Ativ Book 6 is no bargain. However, you do get a lot for your money. As laptops are slowly evolving to tablets, the Ativ Book 6 displays the perfect balance, a device with the advantages of a tablet without the lack of performance. The Ativ has a brushed aluminum body and is beautifully finish, giving it a sleek look and solid feel. The touchscreen on this computer is faultless, it is responsive to touch and lives up to the standard of tablets without losing any resolution. The touchscreen feature is extremely useful when surfing the web as we grow more accustom to dragging pages up and down with our fingers. The first thing to notice about the Ativ is how deep and rich the color is displayed. This is thanks to a Radeon 8770M graphics car and also an LED display. Combined with an i7-3635QM processor, the Ativ provides a seamless gaming experience with great performance and graphics.Sadly, like all machines, the Ativ does have a few flaws. For example, Samsung has preinstalled tons of “useful” apps that take up almost 5GB of space. Though 5GB is nothing to the 1TB hard drive, these preinstalled apps are extremely annoying. The Ativ also comes with a few hardware issues. The Wi-Fi adapter kept losing connection which was annoying but rolling back the driver software seemed to fix the problem. Upgrading to Windows 8.1 was also a hassle as a ton of drivers had to be updated using Samsung’s sluggish SW Update software before downloading and installing Windows 8.1. Despite the draw backs, the Ativ Book 6 is still ahead of the competition, providing the experience and performance of a MacBook Pro at half the price. The Samsung Ativ Book 6 is definitely not cheap at $1,199 but with its vibrant display and outstanding performance, it certainly feels like it’s worth a lot more.btw, I had to publish a written piece for school, hope you find this useful!", "Date": "April 23, 2014"}, {"Title": "Great computer, horrible OS.", "Author": "Another wrong item", "ReviewID": "R2YI3AS0CM5O1P", "Overall": "5.0", "Content": "The computer is fantastic.  Windows 8 is a bloody nightmare.  And rolling back to WIn 7 is no picnic either.  My only suggestion would be to get Win 7 if at all possible and STICK WITH IT.", "Date": "March 27, 2014"}, {"Title": "Awesome product, shows crazy amount of finger print/oil though", "Author": "Bill Nelson", "ReviewID": "R2PPN9MIUDD9ZD", "Overall": "4.0", "Content": "Even more awesome than its predecessor, this is a SOLID laptop.  The only problem, besides getting used to windows 8, is the casing.  It shows MAD finger prints and hand oil stains.. Worse than any laptop I've ever had.. I wish they would have stuck with the aluminium casing....  Awesome specs though, truly a great piece of hardware....", "Date": "March 26, 2014"}, {"Title": "Great Computer!", "Author": "Brenda", "ReviewID": "R3JWY88BQTS74W", "Overall": "5.0", "Content": "This computer is very fast and fairly easy to use and the screen size is excellent!  Would highly recommend it.", "Date": "March 21, 2014"}, {"Title": "I haven't been able to get Sidesync working yet", "Author": "Cleveland Quarles", "ReviewID": "R2DI9IK00MZDA", "Overall": "3.0", "Content": "Being as I started from an older Dell, 32bit XP OS desktop, my ATIV much better.  It did die once - I couldn't reboot. I just waited until the fan stopped, and let it chill-out a bite.  I do shutdown now whenever the PC is not in use.  I did install 8.1, and that was painless. However, can't get my Sidesync working, even after sending 2hours on the phone with Samsung tech support.  I am going to try them again - I really want that application to function, which is a major reason I brought this PC. My phone is a Samsung 4, Andriod 4.2.2, model SCH-1435.  Whenever I try to get past the Phone screen Sharing window, my connect fails????  I brought the Book 6 in early February.", "Date": "March 20, 2014"}, {"Title": "Best laptop i've owned", "Author": "N.Krupa", "ReviewID": "R37HJGKZHA5BLT", "Overall": "4.0", "Content": "was originally considering a MAC but after researching and reviewing the choices of laptops, the SAMSUNG was by far the best! I purchased this laptop the summer of 2012 and fell in love with it after the first use! I am an avid gamer so having a computer that will keep up with high graphics and the demands of a sophisticated movie program was a must. A sleek modern design combined with an incredible operating system, impeccable graphics and great sound. The only thing I was not happy with was the speed of the HD. After buying a samsung evo SSD I am as happy as can be!", "Date": "March 5, 2014"}, {"Title": "DO NOT BUY", "Author": "Steve Sweat Pants", "ReviewID": "RC91YADDCXCAA", "Overall": "1.0", "Content": "Do not buy. Had it less than 6 months, intel wireless display does not work. Tried upgrading mine to windows 8.1 and completely crashed and wiped my system. Just got it back after 3 WEEKS and 900 GB's of the hard drive are now unusable. Have to send it back again, Samsung customer support is a joke.", "Date": "November 16, 2013"}, {"Title": "Defective computer when I opened the box - told to send to service center - I may not have my new computer for weeks", "Author": "VoiceofReason", "ReviewID": "R1P94HFPRALOY", "Overall": "1.0", "Content": "I just received the Samsung ATIV Book, As I performed initial set up, the display had a long thin line on the left side; like notebook paper. The line showed up when the display was first turned on.I immediately went to Samsung online customer service. I went to customer service chat and was told to not return the computer but go to the service site that I was directed to. After spending way too much time inputting information about the product, myself, my purchase and the problem I was experiencing, I was asked for more information or I would be charged $55.00. I provided the information and was told to take the computer to the nearest service center. The nearest service center is in Fort Worth, Texas and I live in the Seattle, WA area.I AM NOT HAPPY.I LOVE AMAZON.  I use them because they are fast and efficient and back up their product. This came through a third party. I will go to them and see what they do.The efficiencies and great service of Amazon has been lost by the lack of service by Samsung.", "Date": "October 14, 2013"}, {"Title": "Versatile Laptop", "Author": "Gregory", "ReviewID": "RG8GAAKO9PWAP", "Overall": "5.0", "Content": "This Samsung ATIV BOOK 6, is just great.MAIN REASON'' High performance at good price'', despite not being a laptop exclusively for games, it plays with good yield figure to the demands.DESIGN'' Flawless'', has stylized lines and with a very good finish, ash black color adds a touch of luxury and sober enough to think that not only is a computer for games.LARGE BRIGHT SCREEN FULL HD, with their tactile possibilities provide a different experience and has also high responsibidad to touch, so sometimes it seems that was before a digital tablet.NEGATIVE POINT'''' keyboard lighting not so bright and poor finishing materials.'''' In my consideration CONCLUSION worth every dollar invested in this machine, and for lovers of technology, they would provide good functionality and interactive experience, highlighting much its design and power.", "Date": "June 15, 2013"}, {"Title": "Bad deal", "Author": "Tim", "ReviewID": "RQ9PFM7VYS9VJ", "Overall": "2.0", "Content": "This is a great laptop but the price is out of range. You can go buy a ativ 8 at best buy for the same price but get 8 hours of battery life instead of 4. I don't know what amazon is doing by selling this laptop for more with less value.", "Date": "August 4, 2013"}, {"Title": "Just learning", "Author": "ILLICEMAN", "ReviewID": "R3OGNJ0X0IK6NF", "Overall": "4.0", "Content": "Just got it last week.I am not a geek just a plain old user.1st thing I have found out not slots for my camera.Not good.Windows 8 I have by passed as much as I can.Prefer Google.Overal I no doubt over bought but I have Samsung phone and TV I really like.Still no memory slot for my camers.", "Date": "August 19, 2013"}, {"Title": "WORTH EVERY PENNY. FANTASTIC MACHINE!!", "Author": "T. M. KITEBUS \"Kitebus\"", "ReviewID": "R2OGE0C3GCXTRU", "Overall": "5.0", "Content": "AWESOME COMPUTER. LOVE WINDOWS 8. EASY TO LEARN. FANTASTIC MACHINE. ADDED ADDITIONAL 8 GB MEMORY. CANT SAY ENOUGH TO PRAISE THIS BEAUTIFUL LAPTOP. STUNNING VISUAL WITH IMAGES.", "Date": "November 24, 2013"}, {"Title": "Horrible.", "Author": "Adam dietz", "ReviewID": "R1JNB4ZT4ED88P", "Overall": "1.0", "Content": "windows 8 was far from ready to be released, it is full of glitches and errors. laptop always boots up to limited connectivity for the internet. i have to forget the network and reconnect a few times before it will let me browse. so including all that its about a 10 minute boot time every time. with no help from samsung support they are clueless, i have 3 laptops a tv ps3 and 2 smart phones that have no problems ever connecting.", "Date": "August 9, 2013"}, {"Title": "terrible product don't buy", "Author": "c p burgess", "ReviewID": "RHDE2GN88T32Y", "Overall": "1.0", "Content": "We have had issues with this since we purchased it. Amazon would not take it back!!!Take caution when purchasing and not being able to return...", "Date": "December 25, 2013"}, {"Title": "Looks nice.", "Author": "Ron", "ReviewID": "R3S1XDLSF7WIGB", "Overall": "1.0", "Content": "I purchased this the day before I left the country and did not get a chance to verify that everything worked.Sound system is barley addible.Touchpad works when it wants to.Had to do a system restore right out of the box in order to update windows.Samsung technical support was useless. Told them I was out of the country but all they could do was tell me to send it back for repair.DO NOT BUY SAMSUNG.", "Date": "January 25, 2014"}, {"Title": "Samsung computer all suck in varying ways stay away", "Author": "Marc H. Popek", "ReviewID": "R27NUH97GZZF5Y", "Overall": "1.0", "Content": "Samsung, how disappointing they design to fail .  The panels fail with misalignment, white line on outside or in about 15 months the panel will have line sir columns of pixel fail. Customer service knows this and will not ever send rma to fix, instead they say well you pay shipping both ways and labor we pay for parts. Guess which cost more? Labor shipping. They know that and are ripping off there own old customers,I have upgraded using Sony way better experience, better panel, better Sony features, integrates well with Sony sound, gaming HDTV and blu ray player is from there gaming engine, best images you can throw at a screen. Sony yes Samsung has turned greedy and will take your money and you will e buying another item in 15 months.", "Date": "January 7, 2014"}, {"Title": "Just a piece of junk!", "Author": "MBT \"Moncef\"", "ReviewID": "R2WLBLA2FOVV0V", "Overall": "1.0", "Content": "Just a piece of junk, the hard drive is small, the key board is hyper sensitive and the touchscreen feature does not work. I will never buy a Samsung computer as long as I am alive! It comes with Windows 8 with no license. Just a waste of my money!Do not believe the specs, they are mostly false.", "Date": "December 7, 2013"}, {"Title": "crap ..stay away..", "Author": "Girish Rane \"RGirish\"", "ReviewID": "R160GREQT2PMWI", "Overall": "1.0", "Content": "I was one of the first buyer...though its good but  touch pad is most important thing if you want to experience  fails big time", "Date": "November 30, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core i7 3635QM Procesor (2.4 GHz)\n8 GB DDR3 RAM\n1 TB 5400 rpm Hard Drive\n15.6-Inch LED Full HD Screen, AMD Radeon HD 8770M Graphics\nWindows 8 (64-bit)", "Name": "Samsung ATIV Book 6 15.6-Inch Full HD Touchscreen Laptop (Mineral Ash Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Xlms2BAqL._SX300_.jpg", "ProductID": "B00B588J6S"}}