{"Reviews": [{"Title": "One of the fastest ultrabooks!", "Author": "Open Source Guy \"quattrofan\"", "ReviewID": "R1SWOM55S1H94O", "Overall": "5.0", "Content": "I replaced the drive to a Samsung 840 EVO 250G SSD and this thing really flies. Booting up takes less than 10 seconds and all programs start up in no time! I retained the mSATA 24G SSD and use it for page file and Windows temp files; I uninstalled the Express Cache. BTW, the 24G SSD has terrible write speed for a SSD (80MB/sec, my EVO is over 500MB/sec) but it is much faster than 80MB/sec since Windows uses write cache unless you are writing more than a GB of data to the drive. This will also help making less writes to the EVO to extend its life span; SSD drives has limited write cycles but it is very high.I also spent the time to update the BIOS, update to Windows 8.1, took out some of the unnecessary Lenovo and Intel preloaded software. This make the machine run faster and smoother. I also got a Diamond Multimedia DS3900 docking station to manage multiple USB devices (keyboard+mouse,printer,scanner,wireless 2.4G headset,hard-drives) and dual monitors.Windows 8 su*ks. I downloaded and installed Classic Shell and never dealt with the Metro screen again. I wanted a notebook so I can multitask easily with multiple windows and not your single-window tablet apps that should belong to an iPad or an Android pad. I started to delete some of the pre-installed windows apps too. Like Skype, there is a Windows app version and a desktop version...FYI, crtl-alt-(one of the 4 arrow keys) will rotate your screen and this is a must since the auto rotate does not work very well on this computer. The \"hkcmd\" Intel module handles these hot keys so do not disable \"hkcmd\" from the Task-manager->Startup page. I learned the hard way and took me like an hour to figure why the rotate commands stopped working. This also affects the rotate button right above the power button.Update from 11/19/13:Just noticed the option to not fully charge the battery (this would prolong the life of the battery) is gone once I updated Windows and the Lenovo settings dependency package to the latest versions. Here is the link to a post that shows how to set the battery charging percentages in the Windows registry:[...]I have created several registry files to allow me to change the values with ease.This is a must for turning off the auto brightness adjustment that basically makes your screen gets dimmed randomly and annoyingly:[...]", "Date": "November 3, 2013"}, {"Title": "This would get 5 stars except...", "Author": "RWm \"Rick\"", "ReviewID": "R3DXDCYJX2BVJ2", "Overall": "4.0", "Content": "Some Twists come with WiDi support and some don't.  Mine didn't.  It had the newest dual band (2.4 and 5 g) WiFi card that doesn't support WiDi because it isn't made by Intel.  Lenovo did this all to save a couple of bucks.  So I brought a WiFi card that did support WiDi and Lenovo had whitelisted the card and I had to return it to get a single band, \"Lenovo certified\", Intel chip. It would have been nice if Lenovo stated that it didn't have the correct WiFi card for WiDi.  You will need the Intel WiFi part 2230BNHMW chip with \"FRU P/N 04W3765\" written right on the face of the card - the 04W3765 is the Lenovo part number.  This is the only chip that will get past Lenovo whitelisting that will make WiDi work.  Using the new Intel Wifi card had no impact the Twist's WiFi performance at my house.When I installed the WiFi chip, I didn't have to update any drivers.  The computer automatically did it upon booting.  The chip was very easy to install and if you go to the Lenovo Twist support website the manual shows you exactly how to do it. However, I did have to update the Audio driver using the Lenovo driver website.  This is important because I updated all of the drivers using the Lenovo website when I got the computer.  However, the Lenovo website failed to update the audio drivers.  So when I first used the WiDi I had no sound.  It was very easy to update but you will likely need to update the audio drivers separately should you do what I did.Once I installed the WiDi software for Windows 8 (from the Lenovo Website) and added the Neatgear Push2TV 3000 to my TV, it worked like a charm (I also updated the software on the Push2TV 3000 - PTV3000 that I purchased from Amazon.  However, I don't think that this was critical).NETGEAR Push2TV Wireless Display HDMI Adapter with Miracast (PTV3000) Certified for use with Kindle Fire HDXIt doesn't have a lighted keyboard for working in the dark.  I purchased this from Amazon and it works great:BIRUGEAR Black Dual LED Clip-On Reading Light and Cable Tie for Amazon Kindle, Nook, eBook Readers, Tablets, PDAs, Cell PhonesWhen I purchased the Twist it didn't say that it had a 24gb SSD cache for quick booting.  Mine does and it works like a charm.  This laptop boots in less than 60 seconds.  I think that with the Twist's 24gb SSD cache and the current prices of SSDs it would be a waste to buy a full SSD to swap out the HDD that my Twist came with.  BTW, I found the 24 gb quick boot SSD when I was swapping out the WiFi card...I've updated it to Windows 8.1.  Mine came with 8.0.Its battery lasts about 5 hours with normal use.One other quirk, this laptop doesn't have a disk drive light.  You can't tell when it is accessing the disc drive.  It is a little unnerving at first, since this is my first computer without a disk light ever (my first was an IBM with dual floppy disk drives), but the performance of this laptop with the SSD is quick and rarely do you have to wait for more than a few seconds for it to do anything complex.  I've found Windows 8.1 to be very stable, but be patient and I think that you will get used to the user interface.  Now that I've been using it for a while I only reboot it once every week or so.  I leave it on when I close the cover and it wakes up as soon as I open it.I like the Twist.(Just a note.  The Netgear PushtoTV 3000 - PTV3000 - is nice but it isn't as good as a HDMI or DisplayPort connection.  There is a little delay.  So if you use the PTV3000 for movies, photos or other similar, it is awesome.  If you use the PTV3000 for an additional computer screen the slight delay can make it a little more difficult, but not too bad.  I prefer the Twist's HDMI or the DisplayPort connection.  I've found that you can only be about 12-15' from the PTV3000, line of sight, for a quality HD picture, with little delay.)", "Date": "January 28, 2014"}, {"Title": "I wish I could love this computer", "Author": "tdub", "ReviewID": "R1S5AJWOA0A9WO", "Overall": "4.0", "Content": "Design is spectacular, the build quality is something that rivals the pricey macbook series. The touchscreen is responsive, and has fantastic brightness. The battery life is not as much as Lenovo claims, but it is able to get me through a SOLID 4+ hours of course work, (several PDF files open, and onenote + word running + chrome) before windows 8 politely tells me to plug in. This may have to do with the hardware, I have the i7 with 8GB of ram. Not sure why it is no longer an available in that configuration, but it is not a purchase i regret as the aforementioned programs simultaneously ran smoothly.And the trackpoint...I may be biased for this cpu because i love the trackpoint, the placement and quality of the interface is fantastic with one exception, but more on that later.I really want to love this computer, but I only like it because of a couple flaws.Every single time i open up the laptop, the screen automatically rotates either 90, or 270 degrees. simply moving the laptop to right the accelerometer does not work. i have to go into the settings (via os8.1 \"charms\") and shut off the automatic screen rotation, and then use alt+ctrl+uparrow before i can do anything on this computer, all while the screen is in an awkward rotation. It wouldn't even be bad if the automatic screen rotation would stay off, or if the accelerometer would right the screen. Neither of those work, I have exhausted the options suggested by what i could get from the forum. It was through the forum however, that I was able to successfully troubleshoot some other issues. Cheers to the forum, good stuff there.The only other issue i have with this computer, is the quirky nature of the trackpoint to keep moving for a couple seconds after my finger is off and back on the keyboard. This may be an inherent flaw with this type of interface, because my dell had the same exact issue. The trackpoint is still fantastic and i am 85% pleased with it.I may end up having to return it to Lenovo to have it repaired, if it is in fact a hardware issue, but do not believe that i will return it altogether for a refund. The few issues I have with this computer are FRUSTRATING. but the overall computer is so fantastic i may suck it up. If there is somehow an executive for lenovo reading this, if you fix the few issues and have a wacom enabled pen input, I would buy two.", "Date": "November 12, 2013"}, {"Title": "Good So Far", "Author": "Dain Wadley", "ReviewID": "R362N8G93PMTWL", "Overall": "4.0", "Content": "I like the laptop but Windows 8 takes a lot of getting used to.I purchased this because I needed the i7 CPU, 8GB RAM & 500GB HD but wanted to be able to use it as a tablet. I use it for work so I use it as a laptop more than anything but it is nice to be able to use it as a tablet or turn the screen around for others to see. So if you need a real laptop but want some versatility this is for you. If you want more of a tablet get one of the other more tablet oriented convertibles.", "Date": "September 10, 2013"}, {"Title": "Good features at a comparatively low cost", "Author": "Jagan Choudhary", "ReviewID": "R1BRU26I3HERMI", "Overall": "4.0", "Content": "More features than its comparable models at a low cost. The touch screen feels and works good. looks better than the old thinkpads. The twist feature works great.  Applications are compatible to use with the tab.Gets heated up quickly while using as tablet. Dont expect a battery life of more than 4 hours. Also, feels heavier when compared to other convertible laptops.", "Date": "October 13, 2013"}, {"Title": "Excellent choice for the price.", "Author": "Richard J Cheverton", "ReviewID": "R3IA1LRATMKCSB", "Overall": "4.0", "Content": "I would give it a five star rating except the windows 8 is hard to learn without a tutorial which should be included. Beautiful graphics and the touch screen is as good as a tablet.", "Date": "January 17, 2014"}, {"Title": "Fantastic Tablet", "Author": "David S. Mohler \"dsmohler\"", "ReviewID": "R1Y4ZZ7VEIJEH2", "Overall": "5.0", "Content": "This is the best tablet currently on the market. I have purchased five of these so far. Keyboard is wonderful; touch screen is perfect. Weight is ideal. Battery life is great. I just can't find anything in this product that is weak. It is well-rounded in every way. There are models out there with 8GB RAM, too, at a great price.", "Date": "December 30, 2013"}, {"Title": "Battery Life not too good", "Author": "William T.", "ReviewID": "R16FEQLGF4RDZW", "Overall": "4.0", "Content": "Nice PC. My only complaint is the battery life. I barely get 1.5 hours out of a charge even with everything minimized.", "Date": "December 10, 2013"}, {"Title": "Has will of its own", "Author": "Jon Sigurgeirsson", "ReviewID": "RW5JKDX8UI3H8", "Overall": "4.0", "Content": "Excelent laptop exept it has will of its own. Sometimes the cusor moves unexpectitly and new pages come up when I am just moving the cursor. Posible it is a question about learning on the new system.", "Date": "November 23, 2013"}, {"Title": "Does what I expected", "Author": "Amazon Customer", "ReviewID": "R4F4CPWCISOM0", "Overall": "4.0", "Content": "This computer does exactly what I wanted it to. I took away a star because battery life COULD be better.", "Date": "November 15, 2013"}, {"Title": "Decent computer - should be 3 1/2 stars - reasonable value", "Author": "Matthew", "ReviewID": "R15F81VWIPAXB7", "Overall": "3.0", "Content": "I bought this for work to replace a 5 y/o Lenovo G series laptop. One of my clients is an IT consultant and he recommended it, of course warning there's a learning curve with it being Windows 8 and laptop tablet combo. I'm probably not completely through the learning curve and I guess I did what many people do with a Windows 8 machine and that is I did everything I could to make it feel like a Windows 7 machine...I largely ignore all of the Windows 8 stuff, it boots to the desktop and I've installed a Start Button and it feels like I'm in a Win 7 machine most of the time.Pros-Light weight - lighter than my MacBookFast - it's got an i7 processor, 8 gig and a small ssd drive for bootingCons-Irritating software jibber jabber - there's some kind of Intel rubbish on there that does not work. For example it keeps popping up saying your firmware is not compatible or something and then I click on the notice it doesn't take me to any kind clear cut help to do whatever this firmware upgrade might be. I will probably get this taken care of at some point, but no thanks to Intel.  Lenovo has also got some kind of supposedly helpful software on there for us small business owners, but it's more of an irritation.Battery life is decent, not great, not horrible. I have not tracked it exactly but the typical Mac has better battery life.", "Date": "January 17, 2014"}, {"Title": "Really, just awful. Theres no silver lining on this one.", "Author": "Kyle", "ReviewID": "RX015ZUF115VI", "Overall": "1.0", "Content": "This is one of the worst electronic devices I have ever used. The mouse constantly moves around at it's own will as if stuck in the direction I was using it in. The orientation of the screen constantly changes and when corrected using control+shift+arrow will move back when clicking through programs. It freezes constantly which might be due to the fact that it has windows 8 which is another awful bit of technology all it's own. Don't waste your money, it's a dumb gimmicky toy that doesn't work well at all.", "Date": "November 18, 2013"}, {"Title": "It has a few flaws but I love it", "Author": "Matt", "ReviewID": "R32I7OI6KULOAQ", "Overall": "4.0", "Content": "I use this computer for personal use, gaming (Mostly legacy) and for travel. I did my research I found that this laptop fit all three categories the best. I can honestly say this laptop is not the best in any of those three categories but is the most versatile. It is not underpowered like tablets are but it is larger and definitely heavier. The computer is not as cumbersome as most full sized laptops but not as powerful as some either. I want to add that this computer truly takes advantage of Windows 8. The combination of touch screen and laptop functions were just fantastic when you got the hang of it. I did state it had its problem, and I will list how I overcame those problems.Personal/General Use: If you are just searching the internet I feel there are better priced computers that do the same thing. For me I felt the computer ran slower then my other laptop with the same specs. The thumb stick or what ever it's called in the middle is nice when you are typing and don't want to take your hands off the keyboard. There is two sets of spots for left and right clicking. The first two you can see above the touch pad. The other two were at the bottom corner of the touch pad (You cant see them). In the UEFI settings you can switch where the FN and Ctrl Keys and also set it so that the function keys are the default so you don't have to hold FN to get to your function keys. It does have an HDMI port but its a small HDMI, and I would have ordered the adapter for it with the laptop. I do recommend a USB bluray player. You never know when you'll need to pop in a CD/DVD/Bluray. I feel a blue tooth mouse is required if you decide you want a mouse for it. It only has two USB slots and they can fill up quickly depending on what you are doing.Travel: As I said the thing is bigger and heavier then most tablets. Bigger isn't necessarily a bad thing especially watching movies, but it does take up space. The auto rotate feature on it really sucks, and does not adjust unless its going from landscape to portrait (not vice versa). I corrected that by pressing the windows button + O and that turns off auto rotate. The using Ctrl + Alt with direction key to orient the way I want it. This does have a portrait feature as I mentioned which is really cool for reading. I do like being able twist the screen and lay it flat so it looks and works just like a laptop. Usually in airplanes they make you put away laptops for landing and take off.... but allow you to have tablets out. It was great for flights because I could watch movies longer or read. When the flight was going and I was watching a movie I would turn the Lenovo around and twist the screen so I couldn't see the keyboard but the screen was vertical. This was great because the guy in front of me could lean his seat back and it wouldn't affect me at all. If you have a friend with you there is only one head phone slot just so you are aware.Gaming: There really isn't much to say here. Gamers know the specs. It handles the games that I play pretty well. It is also Hyper-V capable.Pros:Powerful for it's sizeTouch screenThumb stick (pointer)The twist featureWorks well with Windows 8Hyper-VCons:Runs slow for specs (this is completely opinion based)Auto rotate isn't useless, its in your way!Holding it like a tablet can tire out your arms. (It weighes 3.5 pounds where a similar size tablet may weigh 1.8 pounds)You may drop it if you don't hold it properly! Almost dropped it a few times because the screen and key board twisted when I went to pick it up.Conclusion: As I said I love it for its versatility of being a hybrid laptop. It has its good sides and bad sides. The travel portion was its biggest selling point to me. This was my experience with it for the three weeks I have had it.", "Date": "May 15, 2014"}, {"Title": "college gift", "Author": "Frank Easterling Jr.", "ReviewID": "RHU1KWVD8SFFW", "Overall": "4.0", "Content": "Got this as a gift for my sister who was going back to college. Extremely pleased with the ease of programming, and is very user friendly. She has as two kids so opted for the full Protection plan. Highly recommend this for anyone going to school, or has a future college student.", "Date": "February 9, 2014"}, {"Title": "Lenovo twist", "Author": "Bella A", "ReviewID": "R21SX5UBDV6JIH", "Overall": "1.0", "Content": "Battery life is less than 2 hours, autorotation does not work properly, it rotates by itself without any reason, when you rotate laptop screen autorotation won't work. Brightness of the screen changes automatically which is very annoying.  Also has other small issues, but those one are biggest one. $900 is a very high price for this quality.", "Date": "March 23, 2014"}, {"Title": "Can it be worse? yes", "Author": "Mirfarrokh Shayegansalek", "ReviewID": "R2B99TEIGA1MKG", "Overall": "1.0", "Content": "This laptop might have one advantage: keyboard. But that even is not the standard sizeThe screen is miserable. Super reflective with a cheap look. Don't forget the low resolutionThe touchpad is as whimsical as it can be.The screen vibrates like crazy. Forget about using it in laptop mode in a vehicleThe screen rotation can be considered random. Never expect it to rotate when it shouldAdd to all of these: mine stopped working twice in the first few months. They reset the whole laptop each time. Had they gave $1000 to take this laptop, I would not have, had I known what I was getting", "Date": "January 14, 2014"}, {"Title": "Not Impressed with the first one!!!", "Author": "CNHoiland", "ReviewID": "R208QF0WOG4D5U", "Overall": "1.0", "Content": "Like a couple other reviews have addressed...this ultra book is extremely glitchy! The touch screen didn't work at all at first then it was like it was trying to catch up to previous touches and it would just go crazy bring up apps closing them moving the screen. The keyboard wouldn't reaping the screen rotated and would get suck. Mouse was beyond glitchy...I called Lenovo and they tried to trouble shoot it but when i couldn't get the computer to do anything they were asking me to do they told me I will need to send it back because something was really wrong and I most have gotten a lemon...So I have sent it back, and because I NEED A working computer and needed it ASAP for my husbands work I had to have the replacement shipped via one day shipping FYI that is $100! I was told I would be reimbursed...So i was suppose to be getting the replacement no later than today...it is midnight its not coming ha ha :) sooo I tried to track it and it told me i should expect it tomorrow or the next day!!! This was VERY time sensitive!! So much for one day shipping! Not impressed to say the least!", "Date": "December 16, 2013"}, {"Title": "This machine gets an \"F-\" for form, function, and price.", "Author": "LynneSnyder", "ReviewID": "R2QN2ROS9MP9X7", "Overall": "1.0", "Content": "I started a new job in January and they gave me the Lenovo S230u Twist. My new boss said it would be great for presentations and it's very flexible and that the company will be giving their sales people this product in the future. Do not buy this machine! Yes, it does rotate and you can make presentation with it but you can do the same thing with a normal laptop for less money!The keypad is the worst in the industry. It's upside down where the left and right buttons are near the keyboard not your thumbs. The corners of the mouse pad can be pressed but the pressure is inconsistent and the cursor is constantly moving around by itself.I own a Samsung Note 10.1 and it outperforms the twist hands down. The Note's screen is too small for more than one-on-one presentations however. But I have eliminated my paper notepad and do everything electronically.The Twist has a touch screen but doesn't offer a stylus for handwriting, something I love about the Note. All you end up doing is getting the screen dirty touching it. The screen resolution is poor as well. If the Twist did handwriting recognition I could live with the warts it has, but it doesn't.The Twists case has a matte black or grey finish and it sucks up finger oils and constantly looks dirty. Don't eat or snack while working because whatever you eat will end up on the case or mousepad. Bad design.The Twist can swivel. So what? Turn a normal less expensive laptop around and you can accomplish the same thing.The Twist crashes randomly. I don't know if it's because of Windows 8 or the unit itself but it's feels like the old school pc's that would just crash for no reason.The keyboard is weird as well. The delete key is above the backspace key. Not well thought out at all.This machine gets an \"F-\" for form, function, and price.Buy something else.", "Date": "March 8, 2014"}, {"Title": "There is a big problem in this computer", "Author": "vivid", "ReviewID": "R2DXID62JY2UX2", "Overall": "2.0", "Content": "The mouse movement is extremely unstable. It will change position automatically very frequently.I am requesting a return, but not sure if I will get full refund.", "Date": "October 31, 2013"}, {"Title": "Worst tech and customer service in the business", "Author": "Yeti", "ReviewID": "RW6FWFDI64D1H", "Overall": "1.0", "Content": "I got one of these that constantly froze up and came with really loose connections for the audio.  The tech people are really bad.  They keep no records of constant unresolved problems with their faulty machines, so every time you call, you have to start over again as if it were a brand new complaint.  When they can't figure out what to do, they tell you they will contact you, but they do not.  Worst company, crappy computers.", "Date": "February 4, 2014"}, {"Title": "Good hardware", "Author": "Rodrigo Dinis \"Rodrigo\"", "ReviewID": "R3E9FXF3ZJWDTU", "Overall": "2.0", "Content": "Windows continues being an issue. Sometimes the screen goes dark and returns many times something looks wrong in energy saver system. The touchscreen locks sometimes.", "Date": "January 28, 2014"}, {"Title": "Solid Computer", "Author": "Hal Stanley", "ReviewID": "RLVPDH3MDMLCN", "Overall": "5.0", "Content": "I have been using this computer at home and school for the past half year or so. Here are my two cents.Cons:- Screen does not always rotate correctly. Sometimes I will have the computer sitting in my lap and it will suddenly change orientation. My solution is usually to turn the autorotate off and just use ctrl+alt+arrows to change the orientation. Annoying, but functional.- Loading from sleep mode takes longer than it should. I generally have to wait a good sixty seconds to get the screen to show up after putting the computer in sleep mode. Although it is not a major flaw, it does get a bit annoying.- No support for Digitizer Pen. I was aware of this incompatibility when I bought the computer, but it is important to mention. Generally, you have to buy a more expensive or more business-oriented computer to use a digitizer pen, which makes this computer sub-ideal for taking written notes in classPros:- Runs smoothly for my purposes. I usually don't have memory-intensive software running, but I do tend to have a lot of windows open. At any one time while working for school, I may have two or three .pdf format textbooks open, a few word documents and upwards of 40 google chrome pages open. As expected, the Twist rarely gives me response problems.- The twistable touch screen is  a dream come true. It twists easily. The screen is responsive. Overall, it just leaves me with a good feeling.- Good boot-up time. Although it takes a while to load from sleep mode, it does not have the same problem on boot up. Sometimes I feel like I am better just to turn off the computer instead of putting it in sleep mode between uses.Overall, I am giving this computer five stars because, for the price, I feel like I received a good deal. Without the price in mind, I would rate this computer 7/10 for its orientation confusion, lack of digitizer support and wake-up time.", "Date": "January 26, 2014"}, {"Title": "Some question or problems?", "Author": "MAURICIO", "ReviewID": "R37B2OE1J2UJTX", "Overall": "3.0", "Content": "I just get my laptop, and I'am testing it. However, something weird is happening with the screen. Screen lighting constantly increases and decreases. I already check energy setting but it's still happening. Is that normal?Also there is a little noise after started it. I guess is the hard drive, but it is normal?", "Date": "November 21, 2013"}, {"Title": "Perfect travel companion", "Author": "Hoehne", "ReviewID": "R3OMRGYB6476TR", "Overall": "5.0", "Content": "I needed a laptop do be a little of everything computer that would be sturdy enough to travel, become a tablet when needed and a decent keyboard. This took care of everything and definitely exceeded my expectations. The keyboard doesn't have those little chicklet keys crushed together but raised individual ones that give you a desktop feel. The screen resolution and touch response is excellant and with the SSD, boot up is quick and efficient.", "Date": "May 29, 2014"}, {"Title": "Ok, but", "Author": "Rev. E.", "ReviewID": "R3UZMYTSOWGBCB", "Overall": "4.0", "Content": "The computer works well, but the auto-rotate sensor is screwy.  Sometimes the screen rotates, but then won't rotate back.  Pushing the rotate button doesn't work.  Sometimes raising the laptop over head helps, other times only a restart helps.  Otherwise, the actualy computing part works well.", "Date": "May 24, 2014"}, {"Title": "Lenovo ThinkPad Twist", "Author": "Sherrie", "ReviewID": "R1HJCPWH36P6Z4", "Overall": "5.0", "Content": "I love this product. Have not had a chance to play with all the function because I am trying to learn Windows 8. But the Pad does everything I wanted to do when I did the research to find this product. I needed a laptop and a tablet, my IT people suggested I research several hybrids and find out if they would work. It works great. Kudos to the person or people who thought to combine a laptop with a tablet.", "Date": "May 16, 2014"}, {"Title": "My best gift !", "Author": "Thai Hoang", "ReviewID": "R1FCDNE2G1F1NK", "Overall": "5.0", "Content": "It's the best laptop I haven't had before. So I think it will help me a lot in my work.", "Date": "January 8, 2014"}, {"Title": "Not impressive looking Laptop.", "Author": "Sudha Ramanujan", "ReviewID": "R26EU7V3NAQRFA", "Overall": "4.0", "Content": "the look and feel could have been a little better.  I wish there was a DVD burner on it.  But there is nothing wrong with the Laptop itself.  It is just not impressive looking for the price and config it has got.Thanks & regards.", "Date": "December 16, 2013"}, {"Title": "I love this pc.", "Author": "Online shopper", "ReviewID": "R3GHO7JOJZOIM7", "Overall": "5.0", "Content": "I really love this pc.  It is very light. The look and the feel of the surface is great.  The touch pad is almost right at the center.  There is no number key pad on the right side of keyboard and this is exactly what I like about it too.  I don't use the number keys much so I personally prefer the number keys to be on the top section of the keyboard.  It does not have any glossy frame or surface around the keyboard and that is exactly what I was looking for. My old pc has the glossy surface around the keyboard b/c of that the light at night would reflect from the glossy surface at certain angles and it was very annoying to my eyes.  The only fraud that I find it is that sometimes the auto-rotate screen problem just like other reviewer said in the first few days. However, I think the update might have corrected the problem.  After the update, I don't have much of the trouble again.  I only have this pc for almost a week and I am still testing it. I am so happy with this new pc and I am glad that I made the purchase.", "Date": "December 11, 2013"}, {"Title": "Lenovo is a great computer", "Author": "Marilyn", "ReviewID": "R1RSYEXFL5R9IE", "Overall": "5.0", "Content": "Wonderful computer, light weight and the conversion from lap top to tablet is awesome.Lenovo builds a great computer, highly recommend.", "Date": "October 3, 2013"}, {"Title": "Fast and portable", "Author": "Larry J Stuckart", "ReviewID": "R3SL18JEH5Z0A3", "Overall": "5.0", "Content": "Does everything I  expected.  Boots up very fast. Replaces my desktop and works as a very powerful tablet. I have no complaints. Great value.", "Date": "September 4, 2013"}, {"Title": "Junk, even when reconfigured as a Linux machine.", "Author": "Amazon Customer \"ulfsark\"", "ReviewID": "R1394JXTX3ZLLJ", "Overall": "1.0", "Content": "I've had nothing but problems with it and I'm done wasting my time replacing parts and rebuilding it. This thing is junk. I won't buy Lenovo again.", "Date": "December 31, 2013"}, {"Title": "Very nice machine. Better after 8.1 upgrade", "Author": "BL \"PB\"", "ReviewID": "R2N480II1ERZGL", "Overall": "4.0", "Content": "Machine is very nicely constructed. Win 8 takes some getting used to. I think I'd give it a 5 star if the battery was more along the lines of 7-9 hours. With average use, about 4 hrs. Decent, but not stellar.Definitely get the 8.1 upgrade, which is free.All the Lenovo software/utilities are quite annoying.", "Date": "January 30, 2014"}, {"Title": "Everthing is ok but.....", "Author": "JIAWEI CHEN", "ReviewID": "RPPDLVCK0X5S0", "Overall": "4.0", "Content": "I'm a little disapointed because the screen always twist in disorder. The screen lock is useless. I don't know this is common or just for my laptop.", "Date": "September 22, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BFFDF3I"}}