{"Reviews": [{"Title": "Really good budget laptop with performance and features", "Author": "Andy Do", "ReviewID": "R3Q89T6AC61BBS", "Overall": "5.0", "Content": "First off, I got this laptop at BB.I have searched around for days on end looking for a laptop that is <$700 with good features and performance that can withstand some gaming and photo editing softwares with no problem. For a while I couldn't decide between this laptop and the Toshiba at staples (it has i7 quad core), but what ultimately led me to picking this laptop can be described below.GENERALMy first impression of this laptop is that it is very light compared to the traditional laptop/notebook style, however it is not light like you would feel in a sleekbook from HP or an ultrabook for that matter, but there is a difference nonetheless. The hood casing is brushed titanium and so is the inside. The bottom is plastic and is in black. The overall feel and look of the laptop was one of the reason why I fell in love with it (I love the look of brushed metals). The top part of the keyboard is a grill area with a \"beats\" logo on the far right. The great thing about this laptop is that there are more USB 3.0 here compared to the older USB 2.0 (It has 3 USB 3.0 ports and 1 port of USB 2.0). There's also a DVD-R drive for the occasional burning of DVD or CDs for your pleasure. The bottom of the laptop is very easy to take out if you want to upgrade the memory or the HDD. Also an FYI, it will fit a 9mm or 7mm SSD. The memory is PC3-12800 with a maximum memory of 16GB verified by HP and other memory websites (ex. Kingston and Crucial). There is a webcam if you're into skyping or google video chat, I don't remember the megapixel but the quality is adequate and not that amazing. If you're into security, it has a finger print scanner on the bottom right of the numeric keypad. It's pretty accurate and useful when you want to set up as logging-in feature or designate a password to a specific fingerprint. The screen is clear and pictures show up nice and crips. I didn't have any problem with the contrast or brightness, but that's my opinion.KEYBOARDThe keyboard has a backlit feature that can be turned on or off with a touch of a button. Typing is very smooth and quick. Each key is easy to press and spaced enough that it provide accurate typing at fast speed. I really like the design and functionality of the keyboard and it's one of my favorite feature about this laptop.BATTERY LIFESo it has a 6 cell laptop battery that last me about 3-4 hours depending on what I'm doing. At BB, it states that it'll go up to 5 hours of usage.PERFORMANCEAs for performance, it is quick and does daily task faster than my old dell laptop with an Intel i3-2.1 GHz processor. Microsoft applications and Photoshop opened up pretty quick and without any lag in between files. I don't do any benchmarks but I do know that even though it is an A10, it's speed and ability to process information might be a little slower than the new Intel IVY architecture--however, I don't need that much power. With AMD's A10 lower power consumption and good video card compared to the other Intel's chip, I find it more than adequate for daily use.AUDIOThe beats audio is...well, it's just speakers right? If anything, it falls just a little bit above the mediocre laptop audio if I were to rate it. It is a little bit louder than the average laptop and provide pretty good sound when played with the right type of music (like classical, acoustics, and some covers). It has a \"bass\" subwoofer on the bottom right of the laptop that \"suppose\" to deliver more bass compared to other laptops (Beats = Bass Bass Bass right?). However, I don't noticed that much of a difference in bass quality even with a good BEATS setting in the laptop. The sound delivery of this laptop is better if you were using headphones (I'm using a VMODA M-80). After you adjust some of the simple settings in the BEATS control panel, you'll be able to get \"pretty good\" sound from the driver. In fact, I think it sounds a lot better than my phone, computer, friend's computer, and iphone/ipad. After listening music via headphones and giving some time for the sound to sink in, I can say this Beats feature was a plus for me.MOUSEPAD/TRACKPADAfter using the trackpad for couple of times now, I came to realized that I can't use the traditional trackpad anymore. I really like the texture and \"smootheness\" and how easy it is to slide your finger without resistance. It's so convenient that the on/off trackpad touch-button is at the upper-left hand corner. The track buttons are also easy to press. When I'm surfing the web and youtubing, I find it is easy to navigate to specific areas on the page with just the trackpad. Two finger scrolling is responsive on this laptop. Zooming in and out is not as smooth but at most it's mediocre.By going to the start menu and search for \"trackpad\" --> \"Setting\" . You can change the different features on the trackpad. Ex. Four fingers swipe down to bring to Desktop. Left or Right to switch between applications. This was turned off when I got the laptop.POSSIBLE UPGRADEIf you're thinking about upgrading here's are the information again that this laptop comes with.Memory: 6 GB PC3-12800 at 1600. Max of 16GB (HP homepage and some website like BB/Staples/Etc will not list this)HDD: 750 GB at 5400RPMWhen I got the laptop, I installed a Samsung 840 series 120GB SSD and a Crucial 8GB RAM chip.I cloned the HDD with Acronis Image program via a bootable disk. After cloning, I checked to make sure my disk was aligned and it did. I also make sure TRIM was also enabled and disable defragmenter. All of these information can be found via google if you're looking to upgrade, but do so with caution.So what happen after I upgrade? It takes about less than 10 seconds for the computer to boot up so I can start opening programs. It resume from sleep practically in an instant and signing in with a fingerprint take less than 2 seconds. Shutting down takes about 10-15 seconds to completely shut down. Opening photoshop was drastically improved. Opening Word and PPT is practically instant. I haven't installed any games so I can't tell you how it affects gaming, but I supposed it's a little bit better since I got the SSD and the vast amount of memory.Another thing I want to mention is that after upgrading the SSD, I was able to get at least an additional 30-50 minutes of battery life. It last significantly longer and you can tell right away. This is one of my main reason to upgrade to an SSD because I hate to go to a cafe and have to carry a charger around, let alone trying to find an empty socket in a crowded room.WHAT WOULD NOT MAKE THIS LAPTOP GREAT:This laptop comes with a mediocre screen resolution. Certain images and icons aren't crisp and clear. The bezel and the screen itself is super glossy, this combination make it so hard to see what you're doing in bright lit areas--glares are horrible. I have a anti-glare screen from my school laptop which I'm planning to use.The hinges on most HP laptop, especially the envy line, are horrible and this laptop is no exception. When the laptop is closed, the hinges can be moved up and down if you're holding it with the hinges faced down (this is the result of the lid not being able to close completely). I wish it was sturdier but it's not, and this is one of my main problem with this laptop.The craftsmanship of this laptop looks great, but after looking at it closely (after having it for couple of days now,) it seems like the opposite. Certain area on my laptop seem to have very small crevices that pops out after a closer inspection. I'm not too picky on the details but I hope it makes up for its durability.SUMMARY+appearance / looks+audio+budget laptop+performance and features+finger print reader / security print+keyboard (easy to type) with backlit feature+weight (feels light to carry around)+upgrades-low amount of ram that it came with, I feel like it should've come with 8GB instead of 6GB, but if you're going to upgrade like me, it doesn't really matter. Just my two cents.-Windows 8?-Hinges-Glossy screen+bezel-Mediocre craftsmanshipHope this review helps!UPDATEAfter a week, I had issues with the finger print scanner not working when I logged in. On HP website, they posted the driver but the simple pass program was an outdated version. I first tried uninstalling and re-installing the driver, that didn't work. I tried uninstalling and re-installing the driver AND simple pass, that didn't work also. I came across a download from HP for simple pass + driver of an HP elite notebook (I don't know why they have it here). After installing that program+driver, it worked fine thereafter.Then a few days later, I had a problem with the audio jack, it didn't recognize my headphone or any headphone for that matter. The Beats equalizer setting was also messed up. I downloaded the audio driver from HP and re-installing it and that seemed to work. It's just annoying that these simple thing happened without reasons.After I resolved the two issues, everything is working fine.", "Date": "February 18, 2013"}, {"Title": "A favorable mixed bag", "Author": "SelfContainedThinker", "ReviewID": "R1EO8CA59QAE7L", "Overall": "4.0", "Content": "WARNING: THIS COMPUTER WILL NOT RUN SMOOTHLY AND WILL CONSTANTLY OVERHEAT AND SHUTDOWN UNLESS YOU TAKE THE FOLLOWING STEPS:1: Go to [...] and download the drivers for this laptop.2: Go into power settings and scale the CPU Power to 75%. Note that you will have to do this for all the power modes, plus you'll have to either plug or unplug your power cable and do it again.3: Purchase a cooling pad. I recommend the Cooler Master U2 which can be purchased here on Amazon at: Cooler Master NotePal Configurable R9 NBC 8PCKA GPNow you should be good to go. I've had these steps implemented and have had no problems with my PC. But now that's settled, let's get on with the review!--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------I've had this laptop for a couple months now, so I feel comfortable in doing a review on it. I actually got this laptop as a replacement for an Acer M5 ultrabook that kept crapping out on me, so I was pretty skeptical on how this one would perform. In short, this laptop is a very fast, well built machine.A10 processor: The CPU in this laptop is very fast, and contains some on-board graphics. It has a windows index score of 6.9, and can handle games at least at native resolutions. However, because this is an AMD core, it generates more heat, and it is less efficient than Intel equivalents. And while it can play games, it only will for about 10 minutes before overheating, so getting a cooling pad for gaming is a must. On day-to-day tasks, it is fine.Keyboard and track-pad: they keyboard works fine, no problems there. It is back-lit, and has full sized keys with a number pad. However, when the laptop gets hot, the keyboard flex can become almost unacceptable. I also like how the function keys are enabled by default, where you don't have to hold down \"fn\" to do things like change the brightness. The track pad is an average-sized, finely textured piece of plastic with 2 separate, responsive buttons. Windows gestures work as well as you would hope.Body: The lid and body are made of a finger print magnet aluminum, while the hinge and screen bezel are made of a hideous reflective, podruding black plastic. The hinges creaks uncomfortably, but other then that, it is very solid.Extras: Beats audio is pointless in my opinion, but it sounds above-average. The included equalizer software is a nice touch, though. The webcam and microphone suck, and are in poor quality. The screen is very nice and has accurate color reproduction, but has poor viewing angles. One more thing: the bluetooth in my laptop seems to be broken as I couldn't get a wireless keyboard to connect to it.So overall, this is a very good deal for $600. It is a capable gaming machine, and a good looking one for that. While the build quality is hit or miss, I doubt there is a better overall notebook out there better than this one.", "Date": "March 23, 2013"}, {"Title": "AWESOME!!", "Author": "Timothy L. Slavin", "ReviewID": "R3VUGUK187WFJB", "Overall": "4.0", "Content": "I am not a gamer or anything, but this can hold it's own-just not the carzy latest games like Far Cry or Max Payne 3..but not many laptops in the price range do.  I paid $600..I do play some 3d games, and the games I want to play work.  If you go to Futuremark's website, and put in the spec for this computer, you shall see that this play 100% of the games at the MINIMUM settings at 71% at MAXIMUM settitngs!  Not bad for $600!  Plus, the backligh keyboard is nice and the fingerprint reader is handy for more security.  It certainly is much quieter than my 7 year old Gateway which just didn't turn on.  I cocluded it was a motherboard or power supply issue-and it was a hassle to get someone to troubleshoot.  I figured I'd just buy a laptop-it's a great machine!  Annd the once reviewer who gaave this 1 star based on lack of \"restore\" disks..well, that just being ignorant!  Very few..except maybe old skoll Dells game w/ the system CDs.  To base a review on that alone is LUDICRIOUS!!", "Date": "January 23, 2013"}, {"Title": "Great general gaming upgrade", "Author": "Carter", "ReviewID": "R2JLHXZDPPT9GI", "Overall": "5.0", "Content": "I bought this from a store locally to replace a laptop from 2007.  So far it has been able to handle any middle of the road game (Think Sims3, Lego: LOTR) I've thrown at it.", "Date": "March 12, 2013"}, {"Title": "Fast, quiet, cool(!), and it even plays games!", "Author": "Dustin Barton", "ReviewID": "ROZF5UR2ESO4E", "Overall": "4.0", "Content": "To give a bit of background on this particular electronics purchase, I originally built my very first PC build from scratch back in the summer of 2008. It was middle-of-the-road by all accounts, but I was \"stoked\" to finally upgrade to the \"dual-core\" era. Specifically, I had an Intel Core 2 Duo @ 2.53GHz. I also grabbed an Visiontek Radeon 4850 w/512MB, and 2GB of RAM. Again, nothing spectacular but it got the job done quite well.Fast forward almost 5 years and it was clearly showing signs of its age. The harddrive was considerably slower and made clicking sounds that I'm positive it's not supposed to make. My graphics card was idling in the 80's (C!), and 2GB of RAM just wasn't enough.So with all of that in mind, I decided it was time to upgrade. I went back-and-forth between a desktop and laptop for a few weeks but ultimately decided on a laptop. I initially tried the HP g7-2320dx with an A6 APU and Radeon 7460G, but it was just too slow. I returned that two days later and decided to wait for $150 in Best Buy gift cards to arrive, and also to take further time to check reviews and specifications. That didn't really yield much since on paper anything can potentially look good.So we made yet another trip to Best Buy, and happened across the new HP m6-1205dx with the AMD Quad-Core A10-4600M and Radeon 7660G. This combination is MUCH better. Boot times are quick and switching between apps is fast. And with that 7660G discrete graphics card I can play almost all of the most recent games (as of 2012) on medium settings (at 768p resolution). I haven't tried Diablo III yet, nor Guild Wars 2, but they are on my list, and if I can find some keys/codes, I'll gladly put this new laptop through the paces. I have all the confidence that this thing can run the games at a playable (read: 30 fps minimum) setting.As for features, the built-in camera is 0.3 MP...which is disappointing, but considering the price is only $599 (currently) it's hard to complain. It also features Windows 8 for better or worse, though I'll have to write up a separate article for that sometime in the future. Design-wise, it's quite sleek. That's what originally drew my attention; the brushed metal look. I haven't confirmed this, but I believe the top of the laptop/lid is metal, as well as the surface surrounding the keyboard, but naturally, the rest is hard plastic. But that's OK. Really, the only disappointing piece of this machine is the display. It's not so much that the LCD is bad, but the colors are a bit faded compared to my old 20\" monitor. And again, I understand certain sacrifices had to be made to get this to a reasonable price point. Plus, I can always hook up said monitor (via VGA or HDMI) and use it as a second screen OR as the main screen and just turn off the laptop portion. So there ARE options.What really matters is the performance, and thankfully AMDs combination of the A10 APU and the 7660G graphics is up to the task.", "Date": "March 7, 2013"}, {"Title": "Ignore bad reviews from people who are clueless", "Author": "Rhino", "ReviewID": "R15WQ2B3HYGZRP", "Overall": "5.0", "Content": "A few things to get off my chest first.1. Restore discs don't ship with computers any more...they just don't. It's not hard to make the restore discs yourself. DO IT IMMEDIATELY.2. If you don't know how, pay someone.3. No idea what virus program you would have to load as soon as you un-box this laptop, considering it ships installed with Windows Defender active on start up. I don't even know where to begin on the comment that the aforementioned anti virus ruined the OS. What the hell did you install, dude?4. Don't 1 star a laptop that bricked from user error.Now, I've had this laptop for a few weeks now and I love it. The Trinity A-10 4600M processor with discrete class gpu is powerful enough to compete with an i-5 running an Intel hd integrated gpu. I just installed a crucial m4 256gb SSD and upgraded the ram to 16gb, did a clean install of Win8 and this baby screams.", "Date": "March 6, 2013"}, {"Title": "[1 YEAR UPDATE!] Excellent affordable laptop, but requires cooling for serious gaming", "Author": "K. Bramwell", "ReviewID": "R14W46UBDDV0G8", "Overall": "4.0", "Content": "About me: Network security analyst, hobbyist photographer, casual gamer.-----1 YEAR UPDATEAlthough I first reviewed this item Nov 2013 I owned it since Mar 2013. So far I've upgraded the hard drive to a Samsung Electronics 840 EVO-Series 500GB 2.5-Inch SATA III Single Unit Version Internal Solid State Drive MZ-7TE500BW. BOY IS IT FAST. Windows 8.1 is booting in about 5 seconds.I've also replaced the built-in Wifi with a Intel Network 6235AN.HMWWB Centrino WiFi Card Half Mini PCI Express Advanced-N 6235 Dual Band Bluetooth. There was nothing wrong with the Wifi it came with, but for ~$25 I gave my laptop Bluetooth 4.0 and dual band (2.4GHz and 5Ghz) Wifi for wireless-N speeds up to 300mbps. Upgrading it was as easy as upgrading my RAM to Crucial 16GB Kit (8GBx2) DDR3/DDR3L 1600 MHz (PC3-12800) CL11 SODIMM 204-Pin 1.35V/1.5V Memory for Mac CT2K8G3S160BM.I've found a way to get 5.5 hrs of battery life by turning down the max processor speed to 60% while on battery in the AMD Vision Control Center. Very nice!A year later this is still a great laptop!-----OVERVIEW1. SUMMARY2. DESIGN3. PERFORMANCE4. LIMITS1. SUMMARYThis is the section if you just want to hear the answer to your question: Should I buy it. Yes! There's not many other places you're going to get a quad-core processor, discrete-class graphics, a backlit keyboard and biometric sensor for less than $700. However if gaming is important to you, check out the \"LIMITS\" section below.2. DESIGNIt has an aluminum lid, palmrest/keyboard area and everything else is plastic. It is pretty light for a 15\" laptop. It sports a full keyboard including the number pad \"island\", great for entering lots of numbers. I would've liked if the Num Lock key had an on/off indicator though. The keyboard is comfortable with keys spaced out enough not to have too many accidental strokes. You have to hold down the \"fn\" key to access f1 thru f12; they operate the various media/settings hotkeys by default (brightness, volume, music playback etc). This can be reversed in the BIOS/UEFI settings. If you are a gamer I recommend you do this. You don't want to disconnect your wifi by accidentally pressing the f12 key, which is near backspace and the volume control keys.The touchpad functions well and has a pleasant texture to it, but I feel the two buttons below it are an eyesore and could have been styled with more subtlety. Since it is multitouch, I never use the buttons. Hint: a two-finger tap is a right click.The charging/power on light by the charger port will flash amber when the battery is at 15%, whether the laptop is on or off. I like that.The speakers, covered by an aluminum plate with a pinhole pattern, can get stuff stuck in the small holes, taking away from the visual appeal of the laptop. Like any other computer, I don't recommend eating while using the machine or using it with dirty hands.3. PERFORMANCEThe AMD Vision chip is no joke. The quad-core A10 paired with the 7660G discrete-class graphics makes it great for photo editing, video editing and gaming. The AMD Vision Control Panel allows you to adjust for more battery life or more performance and supports profiles for when it's on battery and when it's charging that are more specific than Windows' power options. For example, I can set the maximum CPU frequency.The Radeon HD 7660G blows the Intel HD 4000 out of the water, period. This is better for gaming than any i7/HD 4000 laptop, period. NotebookCheck benchmarks report the 7660G is STILL better than the new Intel HD 5100 \"Iris\" line and is only slightly behind the Intel HD 5200 \"Iris Pro\" seen on the 2013 Retina Macbook Pros. It has 512MB dedicated DDR3 memory and up to 2GB shared memory. I have no problem doing Spot Healing large areas in Photoshop or juggling between various HD video clips in Adobe Premiere. It plays Skyrim on medium settings on 1366x768 resolution, and Diablo 3 on high settings with the same resolution, but it needs help when it comes to heat management. More on that in the LIMITS section.It has a snappy experience out of the box. I don't know whether to give credit to Windows 8 or the hardware for that; perhaps it's both. The laptop supports 16GB max RAM.The wireless card could be better. In certain spots in my home I have 3 bars of signal strength where my 2012 Macbook Pro has 5, even after installing the latest drivers. The wireless card is easy enough to upgrade if desired. Bluetooth is not included.I've gotten a consistent 4 hours battery life doing web browsing and word processing on wifi with brightness at 50% and keyboard backlight on. I've plugged it into a TV via HDMI and played a 2 hour movie, it still had about 40% battery life and an estimated 1h20min battery life remaining when the movie was over.4. LIMITSThis laptop has one flaw I can't ignore: poor heat management under serious gaming. Perhaps the 7660G is too powerful for the chassis but the fans simply can't keep up. If you're a gamer you're going to have to invest in a cooling pad. I'm happy with the Targus Lap Chill Mat. The laptop simply cannot get enough airflow/cooling for extended gaming without external assistance. I was overheating playing Diablo 3 after two hours (on max settings) with the laptop on a flat surface. Cooling pad or not, the bottom left corner of the laptop can get uncomfortably warm. I haven't found a solution for this aside from going in the AMD Vision Control Center and lowering the max CPU Power one notch to 86%. It still delivers excellent graphics performance despite the cap.All in all this computer is a great value and I would recommend purchasing. Just make sure to get a cooling pad if gaming is important.", "Date": "November 19, 2013"}, {"Title": "more than I expected", "Author": "louis", "ReviewID": "R2BCKBH1S94SRC", "Overall": "5.0", "Content": "I'm an IT professional who designs websites, I'm a musician who records audio tracks, and a hobbyist who likes to edit videos.  I own this very same computer, although I didn't get it from this particular vender I still feel pressed to comment on it. I have owned this computer for about 6 months now and I haven't had not 1 issue with it. I've edited many HD videos with no issues, and I've recorded and edited live audio and midi tracks using a very heavy music program. I am able to use this computer for both work and play with no issues. The physical design is very nice as well, the all silver aluminum body adds durability and attractiveness to it which in my personal opinion looks a lot like an HTC one lol, which is a good thing. I love the keyboard, I noticed most laptops are switching to the separate key style, this keeps the keyboard cleaner and it's easier to type on. I have no complaints man, this is awesome, I loooove it.I would highly suggest getting one if you're into video and music editing, or you're just interested in a well priced laptop with good specs. oh yeah, and the battery life is great, but I'm probably going to get another battery just to be safe.", "Date": "December 13, 2013"}, {"Title": "Amazing Machine!", "Author": "Wasabidude", "ReviewID": "RNR7L9GOGPDHA", "Overall": "5.0", "Content": "This product is amazing! I use it everyday and it works like a charm! i play some video games on it and I started to play my most demanding game that would crash my old computer and this one got 60 fps in it! GREAT MACHINE! i was going to buy a new mabook pro but I'm glad I did not, it cost twice as much and this preforms better!", "Date": "August 26, 2013"}, {"Title": "Great PC... except for the keyboard. Or did I get a fluke?", "Author": "Joshua Storme King", "ReviewID": "RDCPOQH7DPQVL", "Overall": "3.0", "Content": "As my title says... great pc. Looks fantastic, aluminum. Doesn't feel cheap at all, light, and small profile. When mine arrived, the keyboard was popped out of the bezel. It worked itself in and out over the few days I kept it, and it is scheduled to be picked up today. VERY happy with Windows 8, with this computer itself, just not with the keyboard. Decided to buy a Toshiba with very similar specs also here on Amazon, 1 tb hdd, 8 gigs ram. HP made a fantastic deal with this AMD A-10 and \"discrete\" graphics, but the keyboard broke the deal for me.", "Date": "May 28, 2013"}, {"Title": "NIGHTMARE!!!", "Author": "Joe", "ReviewID": "R3RMS4WL1XQ2ZL", "Overall": "1.0", "Content": "Please do yourself a favor and stay far away from this model, and any HP model for that matter.  This computer will freeze up, will reset itself, will shut itself down, will not boot up, etc.  This model laptop is also strictly configured for the use of Windows 8 ONLY, regardless of enabling features for Windows 7 capability or other operating systems within the bios.  Windows 8 has many buggy issues that are just slightly less problematic than Windows Vista was, hence the introduction to Windows 8.1 to be released this October.  Yes, Windows must take some of this blame as well here.  The laptop is extremely weak in benchmark scores, and has generic hardware that is faulty, such as the Hitachi hard drive, and questionable motherboard.  If you bought one and you're within the time frame for a full refund, by all means, RETURN IT.  I explained this to a potential buyer now sucker, that knows I work with computers, and they did not take my advice.  (Couldn't beat that price)  The computer cannot be returned to Best Buy because of their \"we only sell junk and offer 15 day return policies to ultimately steal our customer's money.\"", "Date": "September 4, 2013"}, {"Title": "What ever possesses Manufacturers not to ship disc sets with the computer?", "Author": "Jim Frankland", "ReviewID": "R29HYBILP5YIYA", "Overall": "1.0", "Content": "This isn't JUST HP, but we can start with them.  So they ship you this computer, but withhold the 3 OS and Restore discs that would cost a $1 during manufacturing to package with the computer.  Then they want $16 for the discs, postage, and handling later; except most people don't know they need them until their machine is in a bad way.  So then when you need them the most, your waiting for delivery.  So by \"saving the planet\" they are wasting more fuel, packaging, and time by SELLING to you what is already yours.  Sure, on some machines you can burn your own, but when you get a new machine, with new antivirus that says \"load immediately\" which then crashes the OS prior to building one system restore point and your machine is toast, then what?", "Date": "December 29, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BGYFGKI"}}