{"Reviews": [{"Title": "Keyboard", "Author": "Ron Shuss", "ReviewID": "R2B2B56KZOVWME", "Overall": "3.0", "Content": "The computer itself is great. The keyboard sucks. When typing you really have to punch the keys to operate, space bar does work as long as you push it hard. The key board feels cheap. I am currently looking to see if there is a replacement keyboard to replace it, no luck yet.", "Date": "August 6, 2013"}, {"Title": "Not a day goes by I dont regret buying this model", "Author": "David Krupczak \"my71chevynova\"", "ReviewID": "R38QB8629K90J4", "Overall": "1.0", "Content": "This is a bargain basement laptop. I purchased this for school and its barley capable of even the simplest tasks without giving a warning saying the processor is maxed out. The keyboard leaves a lot to be desired.Do yourself a favor and spend a few hundred more for a better computer. Ive used this one semester and hated every minute of it.", "Date": "February 17, 2014"}, {"Title": "Not too wowed!", "Author": "Dove", "ReviewID": "R3ONSYPY3B8DMX", "Overall": "2.0", "Content": "Keyboard middle area is soft and bouncy not solid as the sides and one screw around the screen came loose, fell out and got lost.  Other than that its ok for the money.", "Date": "January 15, 2014"}, {"Title": "Very cheap look and feel", "Author": "Al Segarich", "ReviewID": "R3816CHZMQ3GTB", "Overall": "2.0", "Content": "The intire keyboard flexes when you touch the keys.  It feels like is will break very fast.  No HDMI port as advertised.  If you're used to Toshiba laptops and know they are generally durable, this is not like that.  I can't believe Toshiba is selling such a shoddy product.  I've had 5-6, this will be the last.Tried to open/download the user manual direct from their tab and just errors, says manual located in a bad sector.  I wish I could send this back but live in Latin America and it would cost too much.  Do yourself a favor steer clear of this one.", "Date": "August 26, 2013"}, {"Title": "It was good at first...", "Author": "DeMarco", "ReviewID": "R1BDP47K5FK8O8", "Overall": "2.0", "Content": "I bought the laptop 1 year ago for my birthday and i loved it at first then it started to freeze allot then the wifi driver stopped working and when it does work it freezes so i dont know whats wrong with it but i would like it to work so i could actually use the $300 that i spent on the pc so if u can help me than please send an e-mail to this address; dubdem13@live.com", "Date": "May 20, 2014"}, {"Title": "Awesome!", "Author": "Lisa Preity", "ReviewID": "R2M7IERCCYLNK6", "Overall": "5.0", "Content": "Money well spent. It's responsive, thinner than I expected and a bit lighter than my previous laptop. There is only one problem that I'm facing right now and it's that ever since I upgraded to WIndows 8.1 my webcam suddenly doesn't work at first I was assuming it might be the laptop's fault but now I think it might be because the driver software isn't compatible. I just hope it is sorted soon because I really love this laptop and would recommend it to anyone :]", "Date": "November 17, 2013"}, {"Title": "Wireless Dnt Work and It Freezes Consistantly", "Author": "Quienton Laing", "ReviewID": "R1KQWM0XDQGJYV", "Overall": "1.0", "Content": "When i got this laptop and started to set it up it frooze like three times so i had to hold down the power button to complete the initial setup. After about a two weeks of freezing up the wireless stopped working. I figured the freezing up would work itself out so that didn't really bothered me.But now the wireless don't work so i figured it was my wireless router so i upgraded to a better router. To my surprise that wasn't the problem. I had a computer guy i know looked at it for me and he said that the wireless card in the pc in defective, it would just dissapear and reappear when it feels like. After contacting the seller he told me that they have a 30 day return policy so i would have to contact toshiba, Wow. I am not in the country so now ill have to pay shipping to send it to toshiba. So now i just have a laptop looking at me. I wouldn't recommend this laptop at all. Be aware", "Date": "August 23, 2013"}, {"Title": "Excellent rate this seller", "Author": "LOYANARA ELENA CASTELLANOS", "ReviewID": "RWS2VC2VW1KEE", "Overall": "5.0", "Content": "I really liked the product and arrived very quickly, is a tool that can serve anyone, I am very pleased to have purchased this way.", "Date": "August 20, 2013"}, {"Title": "my 3rd Satellite!", "Author": "jillycheesefries", "ReviewID": "R3QBV3G8SS8Z1I", "Overall": "5.0", "Content": "this is my 3rd Toshiba and once again, not a dissapointment.  it took a couple hours to get used to Windows 8 (as expected), but dont let that scare you off.  this machne has great capacity and i am NOT sharing this one :)", "Date": "August 19, 2013"}, {"Title": "good stuff", "Author": "gûolinliwei1234", "ReviewID": "RJJYB48159CDS", "Overall": "5.0", "Content": "fast deliver ,nice stuff.good serviceYou'd better provide some high-end digital products. I need to book a apple computer, if you can provide more..Apple MacBook Pro ME662LL/A 13.3-Inch Laptop with Retina Display (NEWEST VERSION)", "Date": "July 27, 2013"}, {"Title": "where is my product code", "Author": "Boni \"Say something about yourself!\r\nUnfortun...", "ReviewID": "R35CWMJCLPLTZH", "Overall": "2.0", "Content": "I believed I had bought windows 8, I am looking to install Office but my product code for office is not in the package. There is no other place for me to ask for it, please tell me where is my product code for OFFICE download?", "Date": "August 31, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BXQ50PU"}}