{"Reviews": [{"Title": "Nice Acer Windows 8 touch screen notebook - Thin and lite :)", "Author": "R. Hurt", "ReviewID": "R3IM8913479OZF", "Overall": "4.0", "Content": "I bought this because I wanted a touch screen for Windows 8.It includes Windows 8 and the touch screen is wonderful.  Once you use Windows 8 with a touch screen- you'll get it.  The keyboard is backlit- a first for me and something I find it convenient in low light.The touch pad is huge!  I'm not sure why, but it doesn't have a scroll region. At least, that I've found.  I'm downloading the manual now to find out how to enable it.Speaking of downloading- this is one area of Acer support that is frustrating.  I'm attempting to download the 96MB manual form the Acer US support site and it's so slow.  The estimated download time is over 30 minutes!  Come on Acer- you can do better than this.One of the other reviewers mentioned that the plastic case flexes and it's true.  To me this isn't a big deal-  I don't need an industrial strength case and would rather they use the minimal amount of materials to make something that (in the US) will eventually end up in a landfill.Overall I'm very pleased with this notebook.  This is a slim design that's lite weight and is convenient to carry.  It's very quiet and runs cool.", "Date": "March 25, 2013"}, {"Title": "Good Computer", "Author": "Catherine Characky", "ReviewID": "R3H182DXZ8Q0CO", "Overall": "4.0", "Content": "My friend bought this for my eight year old daughter. She insisted on having a touch screen. I had some misgivings on this one due to the other reviews on Acer products having internet issues. This does have some issues in that regard. It isn't consistent though. My daughter uses the internet for school. (she is home schooled) There were days when she'd have to reconnect 3 times in an hour then not again for a few days. Frustrating but not a deal killer. It would only be a real issue if you were playing an online game. I tried to download the new driver, which it did but it won't find it when I search for it. To be honest I haven't tried it again; my daughter doesn't complain about it that much.The case does seem flimsy but she's had the computer for about 3 months now and it's holding up fine. The touch screen works well, even if it doesn't get used much. Even my eight year old prefers the mouse for most things. The screen itself is very bright and movies look good on it.The touch pad doesn't work as well as the one the HP I had did. It doesn't seem to be sensitive enough to catch the Win. 8 swipes. I don't know if that can be adjusted or not. I haven't looked.The keyboard is a typical island keyboard and the back lighting is good. It can be turned on or off; so that is helpful. I only wish there was a light or notice if you turn on/off the cap or number locks. The only way to know if either of these is on or off is to just start typing. It resets the number lock to off when you turn off the computer or switch users. Frustrating, all my other computer default to this being on not off.Once you get used to Win. 8 this is a good computer. It plays the games she wants to play; specifically Sims3. It also plays a few others but as they weren't designed for Win 8 there are a few glitches. This isn't an issue with the computer though, I know it would play them fine if not for Win 8.We got this computer when it was a little cheaper and my daughter is very happy with it. I would have preferred it to have more RAM memory though. That was a trade off though for the touch screen. All in all it is a decent computer.", "Date": "June 11, 2013"}, {"Title": "Love the touch screen", "Author": "L Robert Soules", "ReviewID": "R12IMVQ22VUFT", "Overall": "5.0", "Content": "So far the computer has been great I have had no problems with it. Windows 8 takes a little getting use to. The computer has everything that I need on a computer.", "Date": "July 26, 2013"}, {"Title": "great", "Author": "bluesupermommy", "ReviewID": "R2NYLED9HDN8ZB", "Overall": "5.0", "Content": "my nephew loved this late birthday gift. it was more than perfect, it came with great extras, only thing no directions, or the warranty info. but based on info it should be registered and I can get directions off the net. so no bigy!", "Date": "July 1, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BJUH4GI"}}