{"Reviews": [{"Title": "GREAT LAPTOP", "Author": "edna", "ReviewID": "R3F2WSTF7JZ1PT", "Overall": "5.0", "Content": "I really like this laptop because its fast and has two 3.0 USB ports for my external hard drive. It also has an AMD Radeon HD 7520G graphics card which performs better than the Intel 4000 that comes with Intel based computers. Overall this is a good computer for a student or casual user.", "Date": "February 6, 2013"}, {"Title": "Nice and speedy", "Author": "Bob Day", "ReviewID": "R1OLUMO2ZFDS76", "Overall": "5.0", "Content": "This is a very nice and speedy laptop -- 2 core 2.7 gHz processor, 4GB memory, and a large hard drive.  In a pinch it could pretty easily replace my desktop PC.  The first thing I did was to wipe the drive to get rid of all of Samsung's junkware and Install Windows 8 Pro.  For various reasons I would have preferred to install the 32-bit version of Windows 8 Pro, but it turns out that that is not possible, as this laptop has the more modern UEFI firmware rather than the older BIOS firmware.  But except for that, I am extremely happy with this laptop.", "Date": "March 9, 2013"}, {"Title": "Great price great laptop", "Author": "MrM", "ReviewID": "R38IXO0LQXL0U0", "Overall": "5.0", "Content": "Laptop was better than I expected window 8 takes some getting use to. An upgrade imemory would turn it into a monster the current 4GB doesn't do the 2.7ghz speed much justice aside from that i love it", "Date": "June 6, 2013"}, {"Title": "Great for the price", "Author": "mark lentz", "ReviewID": "R3QEEE3SSHEHAV", "Overall": "5.0", "Content": "Exactly what it said it was.... Could use a bit more ram for the 64 bit OS... But plenty of computer for the dollar.", "Date": "March 28, 2013"}, {"Title": "Great Product", "Author": "JavierOcandoC", "ReviewID": "R2ODM38JOUN2H5", "Overall": "5.0", "Content": "great products, excellent materials and fast warm, $ 400 for the product is great and good materials greetings from Venezuela", "Date": "April 3, 2013"}, {"Title": "Getting Acquainted With Samsung", "Author": "Kimetta Coleman \"Lovin The Music\"", "ReviewID": "R1E9MUAHDQCOOU", "Overall": "3.0", "Content": "I received my new Samsung laptop on Monday and have spent the last two days acquainting myself w/Samsung products outside of or other than Samsung Handsets. This system is definitely for the casual-student user. It has its basic functionality as a machine but the feel is somewhat \"toyish\" and the mouse cursor of course jumps back and forth, all over the screen until you make whatever adjustment necessary.Additionally, it is fast booting, and playing simple games (although it was purchased for business use), viewing documents, switching between all the gizmo's that Windows 8 has thrown at us. However, I would not recommend this product for the business owner neither the corporate traveler....just doesn't feel like it will hold up to the pressure of multi-tasking needed to run a business or operate w/multi-channel devices simultaneously.", "Date": "March 13, 2013"}, {"Title": "Fast shipping! but...", "Author": "Jax", "ReviewID": "RERTT33RU070X", "Overall": "3.0", "Content": "I was really suprised by the shipping. It got here 4 days ahead of time which is awesome! Looked nicley packed and everything.HOWEVER the laptop itself was sent to me dirty. It looked as if something had been spilled on it at some point and looked to be coverd in specks of various other stuff. Was a little put off by that but the laptop itself seems to work fine aside from what I guess is a faulty charger. Charger only seems to work occassionally and goes in and out of the charging process. Hopfully that will stop with a replacment and means the problem isn't internal. A few of the keys also seem to be tricky.", "Date": "May 21, 2014"}, {"Title": "Does what I need it to do.", "Author": "Edgar", "ReviewID": "R2UDINXNI6JNZ5", "Overall": "4.0", "Content": "It is a basic laptop that does what I need it to do that I bought for my son to replace his old one. Works well.", "Date": "March 23, 2014"}, {"Title": "Thanks", "Author": "Khayal Sadikhov", "ReviewID": "R1GJ4YJ87AIJD2", "Overall": "4.0", "Content": "Thank you. It's really a great item. Perfect deal and great price. Works very good - pretty cool stuff - I'm satisfied", "Date": "April 23, 2013"}, {"Title": "Grest value for the price", "Author": "MARSHALL", "ReviewID": "ROWWXMD48AMU9", "Overall": "5.0", "Content": "Since I received it I am enjoying it, I have no complaints with the new windows 8 that many people seem to be criticizing. Probably people are not  to o welcoming to change. I like the new interface and the free apps that it comes with the performance is good and works well for home  and office use. It may not be the best for gaming. So if you are looking for a gaming computer you can choose another. Every thing functions well and I have no regrets of purchasing this device/ PC. Go ahead and buy it don't let the price scar you to thinking it not of good quality or some fraud as I initially taught. You will not regret it.", "Date": "March 3, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "16-Inch LED high-definition display, 4GB Memory, 500GB Hard Drive\nAMD Dual-Core A6-4400M Accelerated Processor with AMD Radeon HD 7520G graphics\n3-in-1 media reader, 2 USB 3.0 and 2 USB 2.0 ports\nBuilt-in 1.3MP webcam, Bluetooth 4.0 interface, 6-cell lithium-ion battery\nMicrosoft Windows 8 64-bit operating system", "Name": "Samsung NP365E5C-S05US 16-Inch Laptop (AMD Dual-Core A6-4400M Processor, 4GB Memory, 500GB Hard Drive, Windows 8 64-bit) Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41dvZtJ2LzL._SY300_.jpg", "ProductID": "B00B5W2924"}}