{"Reviews": [{"Title": "Good product", "Author": "Alexander", "ReviewID": "RGP5721G2J1CP", "Overall": "4.0", "Content": "Got this about a week ago and overall I'm pretty satisfied.Pros:-lightning fast startup/shutdown time.-Solidly built. Don't let the twisting aspect worry you. Does not feel flimsy at all.-Does everything I need - a near perfect complement to my desktop computer.-Speakers are LOUD!Cons:-Screen rotation upon switching from tablet to laptop can be a little buggy.-Tablet form needs a little work - Some functions when using desktop mode don't work as well as they should i.e. scrolling. Windows 8 apps do work spectacularly in this mode though.-Trackpad is not the greatest in my opinion, but still not bad.Overall, the positives of this laptop/tablet combo far outweigh its minor bugs/faults.", "Date": "August 15, 2013"}, {"Title": "Beautifully design just wished it worked", "Author": "Xiong Lee", "ReviewID": "RU5KJ5WS3C90J", "Overall": "1.0", "Content": "When browsing the internet the screen zooms in and you have no control of viewing. Also the screen display shuts off or gets frozen when shifted into a different position.", "Date": "January 2, 2014"}, {"Title": "great", "Author": "fang yuan", "ReviewID": "RIACVECC4TRBQ", "Overall": "5.0", "Content": "It's light and portable. The resolution is good, too. It's the best laptop I have used. very convenient. just the size I want", "Date": "December 6, 2013"}, {"Title": "Excellent", "Author": "xiaolei", "ReviewID": "R2O0ZGMZTSFVQF", "Overall": "5.0", "Content": "I really love it. It's can be touched easily,  like a tablet and can be changed into different angle. It's very fast. And the price is good.  I love amazon.", "Date": "November 25, 2013"}, {"Title": "wonderful ultrabook", "Author": "Xuan Shen", "ReviewID": "R39F6XTIPR8WD7", "Overall": "5.0", "Content": "this ultrabook is amazing except the ram is a little bit small, and it is hard to decompse and add a new msata ssd", "Date": "November 16, 2013"}, {"Title": "meets our needs", "Author": "Chris Penning", "ReviewID": "R2KDLV9SVLHNYA", "Overall": "5.0", "Content": "in the work place - medical office with a emr this thinkpad meets our needs on a daily basis - good investment so far", "Date": "October 29, 2013"}, {"Title": "Buggy screen", "Author": "Kristin A. Wilson", "ReviewID": "R9II7D1J8NPSC", "Overall": "1.0", "Content": "My school bought these for the teachers. I've had it for two weeks. The screen will not turn on after being in sleep/hibernate/shut down. Eventually it will come on after 3-4 forced shut downs using the power button. It already needs to be sent back for repairs.", "Date": "September 5, 2013"}, {"Title": "Great value and works well", "Author": "A. Salabsky", "ReviewID": "R39J3IGASK544P", "Overall": "4.0", "Content": "Light, long lasting battery for a powerful laptop.  Wish there was a little less border around the screen, but like an iPad Lenovo left dead space for you to hold it without interfering with the touch screen.  Overall a good buy and works well.  This or the Yoga were my choices for a convertible.", "Date": "December 15, 2013"}, {"Title": "Lenovo ThankPad Twist", "Author": "Patricia A. Reynolds", "ReviewID": "R261OVAOCATO8R", "Overall": "5.0", "Content": "I give it 5 stars because it is great.  The only negative I would give it is that it is very slow to come back from sleep mode.", "Date": "April 12, 2014"}, {"Title": "Very stylish and light weight", "Author": "Sakura Avelon", "ReviewID": "RHP1RLICTEBEU", "Overall": "5.0", "Content": "I expected it to be heavier since it had a 500 HDD. But the laptop is very light and fast.", "Date": "February 18, 2014"}, {"Title": "Great!", "Author": "Angela G.", "ReviewID": "R3K6V1EDN0D1SS", "Overall": "4.0", "Content": "Love it, love it, love it. The screen gets confused sometime, but the rest out weighs that.It is perfect for what I need! And then some!", "Date": "February 4, 2014"}, {"Title": "Disabled autorotation with registry hack or disable device in  device manager", "Author": "Farouk", "ReviewID": "R2BTTG39E9ZU5S", "Overall": "5.0", "Content": "Update Day 14.I have purchased Anker Astro Pro External Battery pack.  It is light enough and has enough \"juice\" to be a permanent travel companion with Twist.  I will test it out in my trip to South Africa in 4 weeks time. It should prove handy during the flight from Amsterdam to Johannesburg. Twist is now my favourite e-reader.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@UpdateI had to do fresh installation for another reason.This time I just disabled autorotation in the device manager.To get better battery life I disables a few other features.Incredibly simple solution.@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@@2I have had mine for one week. Having worked out the bugs with a new 120 gig ssd and a fresh installation I love the computer.Reading customer reviews I was prepared for short battery life. However I did find the autorotation behaviour disturbing.I found this registry hack from Windows 8  forum to LOCK AUTOROTATION and it  works!OPTION 4How to Lock or Unlock Screen AutoRotation in Windows 8 and Windows RT[...]", "Date": "September 7, 2013"}, {"Title": "Don't do it!!", "Author": "TritonXL", "ReviewID": "R2KO4HWVR4MT36", "Overall": "1.0", "Content": "Got mine a week ago. The touch screen is buggy  and very unreliable and requires restarts. I bought the system for speed, ITs VERY slow! Constantly having to reboot, ect., ect. It pisses me off I feel the need to spend the time to warn others. Don't buy it!! Mines headed to the dump! POC I'm going back to Dell!", "Date": "August 28, 2013"}, {"Title": "The great machine", "Author": "WANJUN LI", "ReviewID": "R37IE4970H3CBZ", "Overall": "4.0", "Content": "I buy three! One of the machine cannot work normally because of the fan!I went to the after-sales service, quickly replaced the fan, can now normal work!", "Date": "December 16, 2013"}, {"Title": "Beautiful machine. :) NO memory expandibility. :0", "Author": "dgb \"gbarnes30\"", "ReviewID": "RON1NVHN3KOPE", "Overall": "2.0", "Content": "I bought this couple weeks ago and it's a wonderful machine. Proceeded to upgrade the 4 gig of memory to 8 or 16 and found of that the memory and soldered in and therefore not upgradable at all. Taking it back to the store. Would have loved to have kept it if the memory was upgradable. If you are content to run one application at a time this may be the machine for you otherwise take a pass.", "Date": "August 15, 2013"}, {"Title": "two hard drives in 6 months", "Author": "A. Menche", "ReviewID": "RNJEOM5F7SZFW", "Overall": "1.0", "Content": "title says it all. besides the buggy screen the constant crashes i had my hard drive go twice. not replacing this time.one positive is I now externally back up everything on a regular basis", "Date": "January 23, 2014"}, {"Title": "Poor design, spend your money on a regular laptop and save money.", "Author": "LynneSnyder", "ReviewID": "R25SK925WHF1RI", "Overall": "1.0", "Content": "I started a new job in January and they gave me the Lenovo S230u Twist. My new boss said it would be great for presentations and it's very flexible and that the company will be giving their sales people this product in the future. Do not buy this machine! Yes, it does rotate and you can make presentation with it but you can do the same thing with a normal laptop for less money!The keypad is the worst in the industry. It's upside down where the left and right buttons are near the keyboard not your thumbs. The corners of the mouse pad can be pressed but the pressure is inconsistent and the cursor is constantly moving around by itself.I own a Samsung Note 10.1 and it outperforms the twist hands down. The Note's screen is too small for more than one-on-one presentations however. But I have eliminated my paper notepad and do everything electronically.The Twist has a touch screen but doesn't offer a stylus for handwriting, something I love about the Note. All you end up doing is getting the screen dirty touching it. The screen resolution is poor as well. If the Twist did handwriting recognition I could live with the warts it has, but it doesn't.The Twists case has a matte black or grey finish and it sucks up finger oils and constantly looks dirty. Don't eat or snack while working because whatever you eat will end up on the case or mousepad. Bad design.The Twist can swivel. So what? Turn a normal less expensive laptop around and you can accomplish the same thing.The Twist crashes randomly. I don't know if it's because of Windows 8 or the unit itself but it's feels like the old school pc's that would just crash for no reason.The keyboard is weird as well. The delete key is above the backspace key. Not well thought out at all.This machine gets an \"F-\" for form, function, and price.Buy something else.", "Date": "March 8, 2014"}, {"Title": "Fail.!", "Author": "David N", "ReviewID": "R1L2RIC27FWFPV", "Overall": "1.0", "Content": "This year I bought a lenovo computer using your services and it came with the hard drive damage. I had to fix it twice in less than a year. The international waranty I paid doesn't work, they take more than a  month to fix it and they make you do everything. My experience with lenovo have been terrible, it's not a quality device.", "Date": "September 22, 2013"}, {"Title": "Pooh pooh sause", "Author": "John Peterson", "ReviewID": "R17KNBIBO1M6WK", "Overall": "1.0", "Content": "This is bad. Troll i actually didn't buy it I just put a terrible rating for fun teehee tehee teehee trolled", "Date": "July 31, 2013"}], "ProductInfo": {"Price": "$999.99", "Features": "Intel Core i5 3337U 1.8 GHz (3 MB Cache)\n4 GB DDR3\n500 GB 5400 rpm Hard Drive, 24 GB Solid-State Drive\n12.5-Inch Screen, Intel HD 4000 Graphics\nWindows 8 Professional, 6-hour battery life", "Name": "Lenovo ThinkPad Twist 12.5-Inch Convertible 2 in 1 Touchscreen Laptop (33476UU) Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41-ve5MKs-L._SX300_.jpg", "ProductID": "B00BFFDFJM"}}