{"Reviews": [{"Title": "good computer, chrome os still has kinks", "Author": "Josh", "ReviewID": "R10IFWNS5DIN85", "Overall": "4.0", "Content": "first, to give some background - I am basing my rating on the computer itself not Chrome OS. I think that I would give the operating system three stars. It is still lacking some significant things. For example, there is no screensaver, and there is no way to sync your ipod/phone. But, it is great for doing all the web-based things you want to do without the clutter and weight of other operating systems.As for the computer itself...In relation to a Unibody mac, there is no comparison. The HP Chromebook feels cheaper. The keyboard isn't as comfortable, nor is it backlit. The trackpad can be a little jittery, and the buttons just don't have the same solid feel. But, and here is a huge but, at $330, there just isn't any way it could compare to a $1500 computer. Looking at it for what it is, it feels pretty OK. The screen is bright and clear, and the 14\" size is just a whole lot better than 11\". For what it is, everything seems to be made pretty well. It feels solid for plastic (no squishy feeling where you rest your hands while typing). And, even though it is heavy for a Chromebook, it is still really light. Most importantly it is fast. Really fast. It boots almost instantly. I think it takes longer for me to type my password than it does for the operating system to go from off to ready to go.As I try more things, I will update this review. As a first impression, I would call myself impressed.*edit 1:So, my first computer was a lemon. As it turned out, it would not charge when the power was off. I have not heard of anyone else having this problem, so I don't think it is a general issue...and I can see why QC would not have caught it. The only reason I am adding anything here is because I had a terrible experience with HP's technical support. The main problem is that they are just not set up to handle Chrome OS. Eventually I got to a point where I realized they were trying to use windows troubleshooting steps on my chrome machine (figured that out when they kept asking me to go to \"control panel\" or use \"run\")...so I took it back to the store where I bought it and exchanged the defective computer for a new one, which works great.But, moving on from that, I have to say that the trauma of this whole situation was not really that traumatic at all. If it had been a windows machine or even a mac, I would be cursing the day's worth of work that was left for me to get back up and running. Instead, I powerwashed my computer (chrome's way of saying erased all the user data) before returning it, and when I got the new one, I put in my email info and it was back right where I left off. No reinstalling this and that or recovering via time-machine. It only took me about twenty seconds longer than a standard startup. Needless to say, that made me very happy.On another note, I have done the optional ram upgrade that caused me to choose this machine over the samsung, and here is a warning. Even if you are a computer DIYer, don't try this one. I consider myself pretty handy, having built a few desktop computers and even a laptop, but I was not able to do the ram upgrade. You need the proper tools to get the HP case apart and the ram is located all the way at the bottom - so you literally have to take the whole computer apart to get to the extra ram slot. Leave it to the pros. or let the 2 gigs suffice, it probably wasn't really necessary to do the upgrade anyway. I really wish they would offer a 4 gig pre-installed option...*edit 2So this edit is more about chrome OS than it is about the computer itself, which has been working flawlessly. I have run into a few more issues that have yet to be resolved for chrome OS. Apparently Java is not supported. This hasn't been the biggest issue, but it is frustrating to not be able to use some websites...and if you think 'I am not a super user, I wouldn't have that problem'...that isn't really the case. Some pretty basic websites  like the webcam feed for our puppy's daycare uses Java...I wouldn't call this a deal breaker, but it is something to be aware of...", "Date": "March 16, 2013"}, {"Title": "Love this Chromebook", "Author": "hiho", "ReviewID": "R1O86OBDURI2VP", "Overall": "5.0", "Content": "I received my HP Chromebook today. I have been disgusted with Windows 7 operating system now for sometime. When my desktop was new it took about a minute to boot up, after constant Windows updates it now takes 8 to 10 minutes to boot up (plus the web locks up if it decides to update while I am in the middle of something even after turning off updates). I read reviews of Google Chrome OS and decided to try a Chromebook computer. I looked at Samsung and Acer laptops and with old eyes I wanted a larger screen so I chose the HP with a 14 inch screen. Set up could not have been simpler. I went thru the installation and set up in about a minute. I was using Google Chrome on my desktop so all the bookmarks and all else was transferred to the HP Chromebook without a hitch. It boots up in seconds and I am online in a matter of seconds. It also has Google Docs and Google Sheets (word processing and spreadsheet basic) that is very user much like Windows Office. If the performance continues,(I expect it will) I could not be more pleased. Windows needs to figure out a better OS or Google OS will take over completely as far as computer systems go. I am 100% pleased with this system as I did not want a tablet. If in the near future some one comes out with a desktop Chromebook I will buy one. For web surfing and emails, basic word processing and spreadsheet this can not be beat. I would recommend a Chromebook to anyone who wants the above mentioned usage in a computer system.", "Date": "April 12, 2013"}, {"Title": "A capable product with a few limitations", "Author": "Electro-Kid", "ReviewID": "R1I6DRQ57AEIF", "Overall": "4.0", "Content": "I received this HP product Friday and have only used it for a few hours.  This is my first laptop so I can't compare it to other similar products.  First impression:  solid construction, nice screen, good keyboard, good sounding speakers (at least to my ears).  The speakers are upward-facing  as opposed to speakers on the bottom on many similar products.  Surfing without a mouse is a new experience for me, but the more I use this product, the easier it gets.  A negative for many is two hours less battery reserve than the Samsung, but I wanted the larger screen and decided I could live with this shortcoming.Gamers who need JAVA and others who need JAVA for certain programs should not buy this product.  I don't miss it as I removed it from my desktop recently due to security concerns.  The main negative for me is that I don't like using web mail; I much prefer Thunderbird.This product excels at surfing the Web and watching videos including HD videos and if you have been using the Chrome browser on another computer, all of your settings are carried over for a smooth transition.", "Date": "April 7, 2013"}, {"Title": "Best Laptop Ever. I've had them all. Brilliant, Lightening Fast. E Print Outstanding.", "Author": "Stanley S. Alari \"stantheradarman\"", "ReviewID": "R365ZTSADYDHR9", "Overall": "5.0", "Content": "I've bought all the macines, DEC Mini at $8k, All the Apple mahines, Tablets..name it. I got the samsung chromebook and loved it and wanted a bigger screen, so got the HP 14\" and just love it. I got the little e print Epson printer so I can google print too and it's excellent. The HP Chromebook has both left and right clicks, beautiful sceen. I'ts my default machine at home on my lap and on the road as I travel to CA courts fighting tickets for folks. I got mine at Best Buy because of it's price for 4G's of memory. $300+ is Insane!  No software or Virus protection to buy. Constant upgrades. Great Apps and Instant App Access from the handy ever present Ikon's on screen. It even has a function key that brings up all the apps to acivate!! You will love it! I can access all my 640 Kindle books and see them instantly in full screen pages! Wow! Forget about any smaller tablet or Apple device!  And the Price is Fabulous!", "Date": "September 13, 2013"}, {"Title": "A very interesting, different approach to personal computing", "Author": "Harry Stingle \"Refugee 133\"", "ReviewID": "R34MV0SOWO7D0W", "Overall": "4.0", "Content": "Four stars because so far, I have been unable to locate a multi-account mail handler that will run in Chrome OS.  The closest I can get is adding other POP accounts to my gmail, and that isn't something I want to do.  This seems strange, as there are any number of such mail handlers available for Android - and Google owns both Android and Chrome OS.  You'd think there would be some technology bleed-over.HP does a good job with the fit and finish of this device.  Very nice screen, keyboard a natural fit for my fingers,  lightweight, and booting from completely off to log in screen takes just 4 seconds!  Another nice feature is that after you turn the computer off and close the lid, the next time you open the lid the computer boots up automatically.If you're looking for a business machine, this ain't it.  It won't run the full-featured business software most enterprises need to run.  But for personal use it works just fine.  You can write, you can spreadsheet, you can prepare presentations, you can game, play music, shop, surf, and so on.  Even better, it comes with 5 gig of free cloud space for you to store your documents and other work, if you like.  Or you can store them on your machine.  Or both.  You can add an SD card to increase memory up to at least 32 gig.  I have been writing for 15 years, including 9 full-length novels.  All that work is less than 4 gig.Think of this as more computer than tablet, but they share a lot in common.  I'm one of those early adopters of what seems like good ideas, and so far this is one of those.  Now if they just had a mail handler . . .", "Date": "April 21, 2013"}, {"Title": "HP finally got it right !!!", "Author": "Mario", "ReviewID": "R309P1NV4RYNXS", "Overall": "5.0", "Content": "Being a programmer and on the road a lot I got about 10 Chromebooks from different companies, ACER, Samsung and today HP. I have grown tired of Windows O/S with the installs, upgrades, constant Virus upgrades; Google O/S has it right and now HP has it right; I hope ACER and Samsung will follow suite.  I mostly use my Chromebook for Remote Desktop into servers at different data centers.  HP is giving us back our delete/insert/home/pgdwn/pgup/end key; no need to remember a silly key sequence anymore.  The upper row of keys has well labeled F1-F12 keys even an F13 key. The 14\" screen is fabulous. Yes, a back-lit keyboard would be a nice addition, but the jump from the 10.5\" screen and the RJ45 port is already a huge step. And thanks for the HDMI port.", "Date": "September 8, 2013"}, {"Title": "Could use some tweaking", "Author": "Ecclesia", "ReviewID": "R3KBUAMKM9HE11", "Overall": "3.0", "Content": "First, let me start by saying that I understand what the Chromebook is and isn't - I think it's great that this isn't running a full version of Windows and that's fine with me. It won't factor in to this review. There are some problems with this machine in the form that it's in. Good news first: The screen is bright enough and the viewing angles are ok. Better than I expected. It's much easier to see at this resolution than the smaller Chromebooks - unlike the Acer C7, where you need to use key combinations to change the size of the print on the screen. The keyboard layout is pretty good compared to the other Chromebooks as well, though not as focused, on Chrome as the Chromebox keyboard or the Samsung Chromebook. That's a plus if you're switching between laptops. Also, the speakers are decent for a cheap laptop. Still, you aren't going to want to listen to music on it, but a youtube video is fine.Now the bad: the keyboard feels cheap and the key travel is low. It's hard to tell when you actually depress the keys so I find myself typing harder than I would otherwise (or making lots of mistakes), even though the travel is so shallow. It also sounds cheap and the keys feel like they are shifting around almost like they're going to fall out. For me, the keyboard seems to be the primary reason to get this over a tablet - so the keyboard should feel better than this. Along similar lines the trackpad is even worse. It has a rough texture and rather than feeling smooth and effortless, it's like you're wrestling with the thing. It has standard buttons, which could be good, but they are loud and clicky and take more effort to depress than they should. Finally, the battery life is quite poor. Why not make the thing just slightly bigger and give it another hour or two of battery?I can't see recommending this over a decent refurbished or off lease laptop with Linux/Windows unless you need Chrome OS for some reason. I know Chrome is taking off - if they could just provide some decent mid range hardware for it, I might jump on the bandwagon.", "Date": "August 5, 2013"}, {"Title": "Love this fast, lightweight computer", "Author": "DD \"tudorose\"", "ReviewID": "REQESA7LD6EQS", "Overall": "5.0", "Content": "After using Windows based computers for years I find that this little beauty suits all my needs and then some. After researching this computer online I found that Google Docs can be saved as a Word doc, can be used offline, and I found all the necessary steps to reboot in case there is a problem with the OS, how to 'clean' the computer if necessary, and steps on how to add your own screensaver. There is a 'Get Started' app which takes the user through many important features so I feel pretty confident that I can handle almost any situation that might arise. The items I mentioned may sound silly and easy to some, but I'm not that computer literate, especially with the Chrome OS. I think the keyboard is great. The keys feel as comfortable and easy on the fingers as my Windows PC. I use a mouse so don't really have an opinion on the finger pad. I don't miss the 10 key numbers on the keyboard since I have always used the top number keys when typing. I love that updates are in the background. Windows 7 would kick me out every time it decided to load updates, and I love that security is built-in so that I don't have to pay to install anti-virus/spyware/malware or set up nightly or weekly updates. I can easily use this computer as a laptop because it is so lightweight that after hours of surfing or typing in Google Docs I don't have a problem with my legs and knees getting sore and numb. Some reviewers complained about the cheap housing but it's nicer than my Toshiba which cost more money. I think this Chromebook is a winner and I'm really enjoying it. It is well worth the extra bucks for the nice, large screen as well. No problems with brightness and the colors are vivid when I watch a movie or play games. I have used my USB stick which houses all my Word docs and have had no problems accessing those files. Lastly, the computer turned on in seconds right out of the box and the battery charged fully within an hour. I'm a happy camper so far!", "Date": "June 6, 2013"}, {"Title": "Better than I imagined!!", "Author": "Suzanne Vaughan", "ReviewID": "R1QHLRMSWXG6SE", "Overall": "5.0", "Content": "I was toiling over needing a new laptop and the cost.  I needed it for writing so had to have a keyboard.  Thought about the Surface but really wanted a bigger screen.  Then I ran across a Chromebook and was curious.  After reading reviews and comparing my needs to its pros and cons I took a chance on it and I am very pleased.  The keyboard is like a laptop with keys in their usual places so I can type without missing a beat.  I am using Google docs instead of MS Word and have found it doesn't have as much in the way of formatting choices but I also have found that when I am writing my first draft I don't really worry with that anyway.  It's more important that I can easily, quickly, write what's coming to mind from where ever I am.  Also I can share it easily so others can review it for me, leaving comments.  The only other thing I want to do but haven't tried is the Skype type app to talk with video. Streaming video full screen is amazing and I can also shoot it onto the TV via an HDMI cable which is cool.  The battery doesn't last long when streaming video or even music but for just writing and checking email and Facebook it lasts plenty long for me to not be terribly inconvenienced so far.  It is light, quiet, and cool enough to use on my lap in bed whether I am writing, reading with the Kindle app, or just watching a movie.  It is such an improvement over my old slow heavy laptop and for only $300 bucks I could not be happier.  The camera is not comparable to ipads from what I have figured out so far but the 14\" screen was more important to me than taking pics.", "Date": "June 9, 2013"}, {"Title": "Awesome!", "Author": "Russell Bly \"Russell @ Liberty Health Network...", "ReviewID": "RL75OSVG0S8IL", "Overall": "5.0", "Content": "What more can I say? Works great. Software upgraded just fine. The larger screen is a real plus. Really a great computer. On the netbook to laptop scale, this Chromebook is definitely on the laptop side of the equation.", "Date": "July 1, 2013"}, {"Title": "Its Okay", "Author": "meh", "ReviewID": "R3NSBMALHAAVQD", "Overall": "3.0", "Content": "bought this as a replacement laptop for our aging mother to send and receive emails and play card games.  It works ok for that but is not as user friendly as we had hoped.  could not adjust size of icons which makes it difficult for her to see.  It is light weight and would be good for a younger person to browse the internet and basic games.", "Date": "August 2, 2013"}, {"Title": "an excellent product.", "Author": "Daniel Bross", "ReviewID": "R37PY6M7UX84X3", "Overall": "5.0", "Content": "This chromebook from HP exceeded my expectations. have no complaints about it, very slim, lightweight, fast, nice glossy screen, full size keyboard and a very good track pad. This chromebook turns on in seconds when the battery is inserted. Battery life is very good, and it charges 100% in just about an hour. Would reccomend to anyone looking for a bigger chromebook with a glossy screen instead of the matte screen on the 249 chrome book.", "Date": "May 7, 2013"}, {"Title": "Not what was expected", "Author": "Monique Peters", "ReviewID": "R15O3N454XAP04", "Overall": "1.0", "Content": "Battery isn't keeping charge long at all. It isn't being used more than two hours a day I have to charge it every night.", "Date": "February 7, 2014"}, {"Title": "Does all I wanted - and more!", "Author": "memaw", "ReviewID": "R3UHA48MXKS6L6", "Overall": "5.0", "Content": "Needed a new computer, old windows based desktop was so slow and always getting virus after virus. Love the HP Chromebook! Read all the reviews, researched prices and get the best deal at Staples - $250! They were just switching to Square Trade protection so got a good deal on that too. This laptop does it all and I've never worked on a computer that was so fast, and I work with the every day. Only one issue - downloading ebooks and audio books from my library - software is not available yet. Hope they are working it out with Overdrive. Bought a wireless HP Photosmart printer too, great deal also. Once I got their email set up they work so well together I fell like I was living in the Stone Age before.", "Date": "February 1, 2014"}, {"Title": "Decent Product, Faulty Charger + HORRIBLE Customer Service!", "Author": "k.lynn", "ReviewID": "R3RMULW3IVKT7Z", "Overall": "2.0", "Content": "I bought this for my father for Christmas, it seemed simple and easy to use for the bit of web-surfing he does. He loved it.. for two weeks, until a glued piece of plastic on the charger became un-stuck, exposing wires and rendering it useless.I immediately called HP, it was within warranty and they assured me they would send me a better one within 48 hours, that this was a problem with their charger. Two days later, I received a phone call saying it would be two weeks before I received it. Two weeks later, I received another phone call saying it would be another 5 weeks before I would receive a replacement charger. I phoned and spoke to another customer service rep, who explained they had to manufacture more chargers (as this is obviously a common problem for this model). They escalated my case to a case manager when I insisted that a 7 week wait for a product that only worked for 2 was unacceptable. At this time, due to them repeatedly pushing back the delivery date, it was outside the 30 day window I had to return it to the store I purchased it from.They returned my call, however I missed it. I promptly called back.. 30 minutes I spent on hold waiting to speak to someone, however my break was over at work and I had to hang up. Later I called back, waited on hold 18 minutes, and a man answered the phone. He explained to me that even though they were open for another 4 hours, and I had waited on hold a total of 50 minutes to speak to someone, there was no case manager available to take my call and wouldn't be until Monday.I am buying a universal charger today so it is usable until they send a replacement, and when I add the cost of this to the cost of the Chromebook, I should have just bought a regular laptop.From the short time we had the Chromebook, it seemed like a straightforward and easy product. However, my experience with the terrible customer service and the faulty workmanship leads me to discourage anyone from buying one. Computers are fickle, things go wrong.. you are better off going with a company with better customer service to protect yourself if/when this happens.UPDATE Jan 29/14 - It is now Wednesday the following week. I have contacted the company by phone 2 more times (and a few hours on hold), sent 4 emails, and have received no reply. I have spoken to two people on the phone who have told me there is no case manager available to deal with my case after waiting over an hour on hold. I have had 3 notes left on my file by people I have spoken to, in order to have someone call me.. and they have been unanswered. I was repeatedly told that they are the only people who can deal with my claim, however I am COMPLETELY unable to get into contact with them despite NUMEROUS attempts. I am now far more upset about what I have been through, than I was about the initial damaged product.DO NOT BUY HP PRODUCTS!", "Date": "January 25, 2014"}, {"Title": "Second Computer", "Author": "Jazmyne Williamson", "ReviewID": "R36GX6OY5IJKTC", "Overall": "3.0", "Content": "I would not get this computer if it will be your main computer. The computer is internet based and you cannot do anything without it. If you are in the government this is a complete no go since you cannot access any government sites.", "Date": "January 2, 2014"}, {"Title": "it's ok", "Author": "pen name \"pen name\"", "ReviewID": "R38R7G70C7RW54", "Overall": "3.0", "Content": "i never write reviews like this but was compelled this one time because i do think that there's an interesting idea in cheap, basic, streamlined portable computing. i love my iMac and by no means is this an iMac. not in any way: screen, build quality etc. but it's under $300 and it works reasonably well for what i need. and that's, primarily, something to write on and secondarily, something to check web stuff on. that's it. as i write all day i was needing a basic word processing laptop so i could get out of that confounded chair that i need for writing on my iMac. so really i bought this HP Chromebook for my back. and i write on MS Word clip it and mail it to myself on my iMac where i can incorporate it and save it to my mac hard drive and backup. for the way i work, it's fine. the keyboard is ok, ditto the touchpad, and screen. again, none of it's as silky and buttery and sharp as the imac. of course i'd prefer a 13\" mac pro or mac air but really i don't need all the programs that come with it and that i have to pay for. i wish apple would build a stripped down machine like this for $600. so far so good with the HP. i'll be curious to see if it holds up. the battery by the way is quick to charge and quick to run down.", "Date": "November 19, 2013"}, {"Title": "Chromebook", "Author": "Kelly C. McCarty", "ReviewID": "R3F04850HLB7LH", "Overall": "4.0", "Content": "Somewhat cheap and plasticky in its construction, it functions as you would expect it would, a solid web browser and pseudo-laptop that isn't so dear and precious that you worry about it getting scuffed up. My only major critique would be the difficulty in just flipping it open. You have to kind of wedge/pry it apart to flip the screen up.", "Date": "October 18, 2013"}, {"Title": "CHROME", "Author": "Antoinette Troup \"Troupster\"", "ReviewID": "R34GQOB65TE2VH", "Overall": "4.0", "Content": "Good for surfing the net with very nice hd screen display.  My kid loves it - had to figure it out first, but it is not a standard laptop something new and nice!!", "Date": "October 7, 2013"}, {"Title": "Just about perfect.", "Author": "Jason Smith \"Colorado Jason\"", "ReviewID": "R1MD73XOL0P2MP", "Overall": "5.0", "Content": "This does everything I want it to do.  I have had to adapt a bit in the way I store things but overall, it's awesome.  Very fast, great for getting work done on google aps/drive and I can even watch video on it.  Downloading pictures from a memory card is a bit more involved but now I'm used to it.  Highly recommend this machine.", "Date": "October 2, 2013"}, {"Title": "Ideal companion for the road", "Author": "Christian Frank", "ReviewID": "R1535JEYDZ5AYG", "Overall": "5.0", "Content": "With the 14\" screen this is the ideal companion for the road, being easy on the eyes and having enough screen real estate to do complex spreadsheet magic.", "Date": "June 21, 2013"}, {"Title": "better than my desktop", "Author": "Patricia Herrick", "ReviewID": "R3HRA82J0F90YX", "Overall": "5.0", "Content": "I wanted a laptop but not large. This is perfect and very easy to use. Better than my Dell tablet", "Date": "June 18, 2013"}, {"Title": "HP Chromebook 14 inch", "Author": "Road Glide South", "ReviewID": "R21ZR6CJZFSXLQ", "Overall": "5.0", "Content": "Great chromebook; screen is great and the chromebook does what its suppose to do; only runs chrome and nothing else.  Very light weight, easy to use, almost instant on when opening.If you are looking to do something else other than Google chrome, this is not the device for you.", "Date": "June 12, 2013"}, {"Title": "Love it", "Author": "Danny", "ReviewID": "R2XAMR3Y9R071J", "Overall": "5.0", "Content": "Love it! If chrome on a windows computer meets your needs, then this will be even better for you. No waiting time to power on. No virus or updates to worry about. It's the perfect browser computer. All of my work can be completed with google products like gmail, calendar, and drive. If that's all you need, this product is great. Also, a google cloud compliant printer is a must for printing needs. I like this HP 14\" laptop size because the screen is plenty big and it is very stable in my lap or table. Much lighter than windows laptops. Touchpad is ok, but a wireless mouse with a scrolling wheel makes browsing websites much easier. Speakers are ok for this price point. Quality sound is the only thing I miss from a desktop PC. Great keyboard. I've never ran the battery all the way down, but I'm sure it will not get you through a busy day of work. Power is needed close by for a busy day. I rarely use my PC any more. Great product for the price.", "Date": "October 6, 2013"}, {"Title": "LOVE THIS THING", "Author": "Maryann Mckeogh \"maryann\"", "ReviewID": "R17NF6ZI782IBI", "Overall": "5.0", "Content": "I bought this not to long ago and really LOVE it. I bought a mac pro a couple of weeks ago and my daughter basically took it over, lol. I needed something to check emails, surf the web, play my face book games,things of that nature. I initially had the acer with the 11 inch screen. It was good but I wanted a bigger screen so with Best Buy's awesome return policy, (I do not work for BB), I swapped this one out with some extra cash. This thing is lightening fast, faster then most laptops I have owned in the past. I would say it's as fast as my mac pro. I think the bad reviews come from people picking this up thinking that this is a full fledged laptop, it is not. Do not give it bad reviews if you do not know what this laptop is intended for. If you are looking for something to check emails, play web based games, watch Netflix, things like that, then this is your machine. If you enjoy the web but hate the lag that a lot of computers put out, then get this machine. I enjoy this as much as my mac as far as doing the above tasks go. The screen is nice and bright, the keys feel good, it is light enough for travel. Two things I wish it would have had and I would have paid more for, is a back light as I enjoy my computer in my bed at night, with the lights off. Also wish battery was longer. These are not deal breakers though as I have mentioned I still LOVE it. I would not hesitate to purchase another. Love how you do not have to worry about virus's or updates etc. Oh also, I would buy this at Best Buy or another store instead of here on Amazon. Some of these sellers are charging way too much for a used one of these. I bought mine brand new for $300.00. Get real sellers, stop trying to rip us off. That is it, just go out and  get one. I think you will really like it!!! I personally am glad I did not listen to the negative reviews!", "Date": "September 24, 2013"}, {"Title": "My New Toy", "Author": "Marilyn DIckerson \"Marilyn\"", "ReviewID": "R3V93EXU01UJSS", "Overall": "3.0", "Content": "I purchased this laptop for playing games on face book and pogo.com, I have a lot of problems with the shockwave player crashing and not having the correct java for playing pogo,com.  I am wairing for support to assist me.", "Date": "June 4, 2013"}, {"Title": "Died after initial update - Fixed it by reloading OS", "Author": "Mark A Barrick", "ReviewID": "RPH5ODO01NV2Q", "Overall": "1.0", "Content": "Like others here mine died within 15 minutes - right after the initial update.  After doing a search I used the suggestion from here: [...] and then followed the steps here to complete the OS refresh: [...]So, if this happens to you, grab a USB drive and plan on spending a little less than an hour to get the Chromebook going again.  It is great hardware but unacceptable that we have to reload the OS on arrival, thus the one star.", "Date": "May 8, 2013"}, {"Title": "First Chromebook", "Author": "Rick", "ReviewID": "ROG81G0FGAKM3", "Overall": "4.0", "Content": "And I was impressed. Super simple, and just has what most people now need. I thought the build of the hardware was nice for the price. And the computer itself couldn't be simpler. Had issues connecting to a BT printer but had problems on a PC as well so not sure it had anything to do with the Chromebook. (Full disclosure, I work for Motorola.)", "Date": "August 11, 2013"}, {"Title": "New Laptop", "Author": "Mellowdee", "ReviewID": "R2P2032X3XRXZP", "Overall": "4.0", "Content": "I had believed there was a cd drive on this notebook, there is not. I am learning more and more of rhe operation every day. The size is just perfect. My last laptop was much bigger. Overall...not bad for the price.", "Date": "May 16, 2013"}, {"Title": "Trouble With Videos, MS Office Applications", "Author": "Jasphil", "ReviewID": "RDRZWU77SNSUT", "Overall": "3.0", "Content": "The laptop is a nice, inexpensive addition to my computing needs. I use it mostly for schooling needs - I take online courses and for this it seems to work fine.  It has the ability to convert Google Docs or Google Sheets to Microsoft Word and Excel, respectively, but it has been very difficult to manage this. For example, a paper I wrote on Google Docs lost all of the formatting, paragraphing, etc when I converted it to MS Word. Since Google Docs is not compatible with anyone without a Chromebook, I need to submit papers in Word.Google Sheets did not migrate at all to Excel. I lost all the data I had entered. I had to resort to using my Dell Windows laptop from work to do that assignment.And as I have been frustrated with lately, Chromebooks do not work with MLB.TV, or with Amazon Prime videos.In short, its a great little computer for web browsing, and I really do like how easy Google Docs is to use, and I love the automatic saving of my work to the cloud. But, its an incomplete laptop experience - I cant do simple things like stream live baseball games or watch the movies in my Amazon Prime account. It does not allow me to complete my schoolwork in a quality or easy way, and this is the most frustrating part of all since this is why I bought the machine.MLB.TV and Amazon Prime works with the Chrome browser, but not on a Chromebook, and not for the customers that went the extra mile and actually bought a Google machine. Google - are you listening?I don't think its too much to ask for a laptop to allow me to do these things these days, even one that costs as little as this one. I hope that Google works on this because this machine is becoming less and less useful to me.  I'm likely to be having a look at a Windows machine if it will allow me to have a more complete experience.", "Date": "June 1, 2014"}, {"Title": "not chrome", "Author": "sandra widener", "ReviewID": "R2HMGC20G52U48", "Overall": "4.0", "Content": "Are you sure you want me to do this when I bought it I thought it was Chrome  I was very surprised to find it was black  but after I Had my Grandson help me and explain that was the operating system  I am now very satisfied", "Date": "May 4, 2013"}, {"Title": "Cannot support anything!!", "Author": "Lissa McIntosh", "ReviewID": "R1UHFFN3C876GY", "Overall": "1.0", "Content": "If you are looking for a computer to read emails and facebook....  This is the computer for you.  I was not looking for anything savvy but wanted something light weight and easy to work from at home.  It was a huge waste of money.  Will not support Java, I tunes or run videos from my camera.  I am a Realtor and did not need anything to complicated but it will not let me load java to type a document.  Every time you want to open something, it tells you to go to google apps and bingo not available.", "Date": "August 13, 2013"}, {"Title": "4 stars", "Author": "Brandy Lee", "ReviewID": "R3FLF1AUF6OGFT", "Overall": "4.0", "Content": "I chose to give it a 4 because it has no disk drive. It runs great and I love it. But a lot of programs aren't compatible with the chrome os. Most programs want windows of some sort.", "Date": "April 2, 2013"}, {"Title": "Don't like it", "Author": "Josephine", "ReviewID": "R589780L3AHBK", "Overall": "1.0", "Content": "I cannot do much with it if it is not with the internet a miscalculation. I was completely wrong in buying this product.", "Date": "October 20, 2013"}, {"Title": "garbage", "Author": "bravo", "ReviewID": "R2IQA3SQKPNZRY", "Overall": "1.0", "Content": "This product should not be considered a computer. In order to do most functions of a normal computer you have to download everything to a google cloud and at all times need internet. It requires you have a gmail to create a profile in the system. Most plug-ins are not read by the computer and if they are, most likely you will not be able to do anything other than view the file. Overall absolute garbage.", "Date": "October 9, 2013"}, {"Title": "VERY Misleading! Don't be fooled!", "Author": "SpikeysMommy", "ReviewID": "R2AL3Z3TUYIDAW", "Overall": "1.0", "Content": "I have tried using the Chrome OS and I was fairly pleased with it. So when it came time to upgrade to a newer computer, I chose this one. The sleek black finish and well sized keyboard were an immediate attraction, but that is where my positive comments end.I had checked out Google Play and was impressed by the vast array of apps available. The games accessed through the Chrome Web Store are a joke. Most are available only in a very small screen, are NOT full versions but similar to trials, Have so much flashing advertising all around it that I almost went blind, and EVERY site, game, app, I tried was telling me my computer was infected, could not download, needed upgrades, and then tried to sell those items to you. Imagine my surprise when I was playing a family based game only to have X-rated app advertising pop up, and attempt to connect me with a new wife from a foreign country! NOT family friendly in any way.I attempted to use Google Play and quickly found out that my brand new computer was NOT a compatible device and the store was virtually useless! (I know what you are thinking...Chromebook computer, chrome store, but you can't access it no matter what you do??! Crazy!) I even proceeded to purchase a Chromecast unit since it was listed under devices that were compatible with Google Chrome only to find out I still could NOT purchase anything from the store!To make a long story short...I am writing to warn all prospective purchasers that what is advertised is NOT what you will receive in any way shape or form!! The MOST misleading advertising I have ever seen! I have lost all respect for both HP and Google Chrome based upon the fact that they seem perfectly comfortable ripping off the average customer like me.I proceeded to pack it up for return, when I noticed for 3 straight days I could not connect to the Wi-Fi without waiting over an hour, sometimes never connected! My Kindle, and my Toshiba were sitting in the same location and BOTH connected immediately upon turning them on. More useless function from a computer claiming to boot up in seconds!Let the Buyer Beware! I wish someone had written a similar review to this and I may have avoided the aggravation and expense this has brought me. PLEASE think twice before purchasing this computer. The old saying if it looks too good to be true it probably is, is the perfect description for this highly disappointing purchase. Shame on you HP and Google for leading consumers on and allowing them to waste money on something that is is not even 1/3 of what you claim it to be!!FINAL RECOMMENDATION:  Do Not Even Consider this Chromebook unless you have money to throw in the garbage!!", "Date": "August 14, 2013"}, {"Title": "Return hassle makes seller look unprofessional", "Author": "Wilma J Durham", "ReviewID": "RU3HDLAIYRFPA", "Overall": "1.0", "Content": "I originally purchased the chrome book to substitute my dead Windows 7 computer. Upon fixing my other laptop, I wanted to send the chrome book back. I hadn't used or unwrapped the new computer, so I figured shipping it back would be a breeze. I received an email stating that I would have to pay a 18% restocking fee and a shipping cost and other charges. Not impressed. Will not be doing any business with them anytime soon.", "Date": "May 28, 2013"}], "ProductInfo": {"Price": "$329.99", "Features": "Intel Celeron 847 1.1 GHz (2 MB Cache)\n2 GB DDR3\n16 GB Solid-State Drive\n14.0-Inch Screen, Intel HD graphics\nChrome, 4.15-hour battery life", "Name": "HP Pavilion Chromebook 14-c010us 14-Inch Laptop (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41yr7Ch3AfL._SX300_.jpg", "ProductID": "B00B7HW5YE"}}