{"Reviews": [{"Title": "Style, Power, mobility all in one.", "Author": "Jrab", "ReviewID": "R1FXBGG1LHG8GV", "Overall": "5.0", "Content": "Buying this laptop, I was skeptical at first. Until I actually noticed it's full potential! This is a Good laptop for day to day use, gaming, and all those other things you do on your desktop! clocked at 2.2GHz It's Intel CORE i7 is loaded with PowerBoost! That pushes it to an amazing 3.2GHz! That was enough for me to buy this laptop. Music fans, your going love this. BEATS has installed a subwoofer in the laptop. So go on and have your pretend DJ fun like I always do! I wish I could say more about this laptop but I really can't. Your going to have to find out how good it is on your own time! But, I prefer this laptop to everyone!", "Date": "May 9, 2013"}, {"Title": "All around good laptop", "Author": "Joseph Gaynor", "ReviewID": "R1XO3KS9HL9VG9", "Overall": "5.0", "Content": "I bought this on black friday  2012 for much less than the current price still. I'll spare you the number. Nonetheless, excellent laptop. Start with the build. Good solid structure. The metal case is sturdy and I have always been fond of the island style keyboard. It's backlit as well which I like. Smooth touchpad and the fingerprint reader is decent. Only thing, it usually doesn't work if you boot from battery power. Not the end of the world.  The screen isn't upgraded so it does okay if you are big on watching movies on your laptop. My old laptop had an nvidia graphics card and high res monitor so it was a bit of a let down but certainly not a deal breaker.  Windows 8 isn't bad. Very fast start up times. I don't really bother with the apps much but they seem functional. You can even force windows to jump straight to desktop mode and you can add a start menu.  HP does great with the cooling system but I still use a cooling pad when I'm using it on my desk or bed. Don't suffocate the thing. Battery lasts about 5-6 hours regardless of what you do. Typically put it on energy star mode and it's good. Finally. If you find the computer slow, do yourself a favor and buy a solid state drive. I did after about 6 months and it's all the speed you need. Buy a USB 3.0 enclosure for the 1TB and there you go. Got a 1TB external for $20. I wouldn't be running autoCAD every day or developing software often. Though it can handle it. This computer (especially with SSD) is all a typical laptop user could need. For advanced users, it probably will do the job. I don't game much. I've done Halo, CS, Need for Speed on LAN a few times and it was fine. About 6 hours straight of gaming. All good. That's it. Best of luck and I hope this helps.", "Date": "October 2, 2013"}, {"Title": "I absolutely HATE this STUPID laptop save yourself!! do NOT buy!", "Author": "MKUD", "ReviewID": "RVM0QDVFHMOUG", "Overall": "1.0", "Content": "I have always brought HP computer products but this will definitely be my last. I cannot explain in words how this computer has a mind of its own, rarely functions correctly, has been freezing since the day I brought it and never remains connected to the wifi for more than an hr or so.  Usually laptops play DVDs as soon as u insert them but not this one.  In fact I cant even figure out how to play a dvd in this dumb POS. Im really about to go buy a MAC and I haven't even had this for a year but it is straight up GARBAGE.. they tried to imitate MAC and did a HORRIBLE job.  you cant even access all programs from desktop which means you have constantly got to switch back and forth between apps.  Whoever made this computer was NOT thinking. I urge you to save yourself the money, hassle, and headache that will ultimately come with this purchase.  RIP to HP. They officially lost their touch.", "Date": "January 9, 2014"}, {"Title": "do not buy", "Author": "Erik Paulson", "ReviewID": "R2EPYTSYJV075A", "Overall": "2.0", "Content": "i chose this laptop thinkng it would be a great choice due to the higher end i7 processor. it dose every day things fine, try anything else and it will make you want to cry. i have had numerous incidents with the wifi recever. it has a mind of it's own. if it wants to work, it dose, if it dosent want to work, it dosent. dont even get me started on multiboot. this computer has no capabilities to run multiboot. i have tried half a dozen different operating systems on here. none have worked. i cant even get a server to run off of this computer. this computer is meant for the typical consumer. not for someone that wants more.", "Date": "December 27, 2013"}, {"Title": "Great insides, poor outsides", "Author": "Adam Clarke", "ReviewID": "R2EY8UDBCEUCHQ", "Overall": "3.0", "Content": "The computer itself is super fast (despite windows 8. I digress) and the specs are awesome. However I carry mine around with me all day and after only six months of use the paint has chipped off of the sides, the keyboard is dented, the back of the screen has scratches, and the display itself has numerous lines running down it from frozen pixels. I wouldn't recommend getting this if it will be doing a lot of travel, or if you do you should buy a super nice case for it.", "Date": "February 27, 2014"}, {"Title": "nice refurb unit at a good price.", "Author": "Steven T \"tech user\"", "ReviewID": "R1ERBBLJVDX9FQ", "Overall": "4.0", "Content": "I7, 1 tb, 8gb ram. runs great although I put another drive with Win 8 in it. fairly light weight compared to an HP laptop from 3 years earlier. Screen looks pretty good although its only 1366x768. some scratches on the case but nothing serious.", "Date": "January 23, 2014"}, {"Title": "nice hp technology", "Author": "PRINCE MODESTY", "ReviewID": "RWHGOPAIBA5TG", "Overall": "4.0", "Content": "Great technology,Its so nice, I love it and recomment it to any one that want to get a hp laptop. I must confess you guys are doing a great job keep it up.", "Date": "November 2, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": null, "Name": "Hewlett Packard C2M81UARABA Recertified Hp Envy M4-1015dx Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/419ZMItuXOL._SX300_.jpg", "ProductID": "B00BI6WK3A"}}