{"Reviews": [{"Title": "This is the best laptop in the world", "Author": "zattack \"-Z\"", "ReviewID": "R1PUCGFH696X5I", "Overall": "5.0", "Content": "I personally think everything about this laptop is flawless. I have owned the asus ultrabook and an ipad and several asus tablets like the transformer 300 and such in the past. This laptop is a combination of all the great things of the 3 devices about with  only 2  cons (battery life and a bit on the heavy side) in my opinion. I spend every waking moment on a laptop for work, and pleasure. This thing goes with me everywhere. Its a little heavier than the ipad but it blows it out of the water in so many other respects.First off, let me tell you, the only reason I am comparing this device to an ipad is becuase it has an excellent touch screen functionality that has allowed me to work on it full time using only the touch screen. I have had tablets in the past, and (besides the ipad) they have never been able to function for me smooth enough without frustration.But i digress, here are the pros and consPros: Speed (fastest processor currently available)  Functionality (full windows 8 platform can run any program smoothly, even games)  Touch (smooth and silky and responsive, pen is good for precision if you have too fat fingers for the high resolution  Sound quality (outstanding stereo hands down better than any of the other 3 devices i mentioned)cons: heavy and battery life 3 hours only without extra battery", "Date": "March 13, 2013"}, {"Title": "This is a computer, not a toy", "Author": "Karma007", "ReviewID": "R2QXNESR2Y7NW1", "Overall": "5.0", "Content": "If you want to read books, buy a kindle.  If you want to read books, watch movies, play a game bought from an app store...buy a kindle, or an Ipad.  If you want to actually get things done on your computer.  Load powerful software (the kind that costs more than $.99.  This is the computer I have been waiting for and so far I love it.  The processor is fast.  The machine is responsive.  And I can put any software for windows I want on it.  I considered the Surface pro, the Samsung Ativ 700t and even a Sony vaio Tap 20.  Because I got an awesome deal I went with this one and I have not been one tiny bit disappointed.  It's power belies its size.  I am running a Dell u3011 monitor through it.  No lag, no problems.  I have an ipad, which was great for the above mentioned uses.  But I could never get any real work done on it.  I wanted something that I could lay in bed, sit on the couch, use on the train to work in lightroom, photoshop, corel painter, adobe illustrator, and I found it.  While I am also building a workstation desktop, this is serving as my main computer for now and it has not let me down once. And let me tell you something.  I got rid of my MacBook Pro 17 inch to go to this computer and it was a great decision.  I can't recommend this machine enough to people who want to do more than play on their machine.Pros: Size, cool factor, 8gb Ram, 256GB SSD, built in HDMI output, beautiful screen, I can use it as a tablet when I feel like it and use it to do actual work. The best part? REAL WINDOWS!  I'm not locked into anyone's \"App store\" anymore.Cons: the keyboard takes some getting used to.  I wish it had a DVI out for using my monitor at full 2550 x 1600 Resolution instead of the limitations of HDMI and VGA.", "Date": "April 7, 2013"}, {"Title": "Excellent!", "Author": "RH", "ReviewID": "RP5SFT14JOJJ7", "Overall": "5.0", "Content": "I just got this a few days ago after much research and trying to decide between it and the Lenovo Yoga and couldn't be happier with the choice. I got the extra battery and can go for days between charges (although I'm not a serious gamer and only use it a few hours a day mostly for business) - unlike my HP with less than 1 1/2 hour battery life. I set it up to use my Microsoft presenter/mouse, but with the digitizer stylus and optical sensor, I haven't had to use the mouse yet...and may never have to. And I'm using the stylus much more than I thought.It's amazing how little things make a big difference. With this device, you just take it out of its case or whatever, turn it on and start using it. If you need the keyboard (and I use that less than I expected so far), just pop up the screen. With the Lenovo, you have to first open it, turn it all the way around if you want to use it as a tablet, turn it on, and then use it. Those extra steps are just a pain.Windows 8 does take some getting used to, but I haven't found anything I don't like about it once I figure out how to use the various features. And there is a lack of documentation on how to use the apps, e.g., Note Anywhere - looks like a great product, but learning it is trial & error.Another big plus is the connectivity. I do a lot of PowerPoint presentations, often using clients' projectors...which \"all\" have a VGA connector. With the Duo, I don't have to carry a VGA adapter dongle - just plug it in. Ditto with the full size HDMI port and SD slot.My HP laptop is now my \"desktop computer\" and one of the issues I've been wresting with is how to sync the two since they both run Windows & Microsoft Office. Files can be handled by putting them in the cloud, but email & calendars in Outlook were a problem. After much research (again), I decided to go with Office 365 on both computers (and on my Windows phone which I'll get whenever a good one comes out) - it's working flawlessly so far.Amazingly, this computer is rated at about 3 stars by professional reviewers and a solid 5 stars by users/owners - go figure.More to follow as I get more into it.", "Date": "June 5, 2013"}, {"Title": "Best laptop I have ever owned", "Author": "tafan", "ReviewID": "RNM8UF9R1ZE63", "Overall": "5.0", "Content": "This is a really good laptop.  It is a laptop, not a tablet, although there are certainly times the tablet functionality is rather handy.  As a laptop, it is great.  Very fast, in all respects.  The high resolution screen allows a great deal of information to be on the screen at once (eg excel columns) even thought it is a relatively small screen.  So you have the best of all worlds, a small device, with a very useful screen for doing real work.  Once you are used to the mouse mechanism, it works as good as any track pad (although, like every laptop I have owned for 10 years, I keep a wireless mouse handy for when I am at a table or desk).  The small keyboard is NOT too small, you can type on it as well as any other keyboard, and I have big hands.I really, really like it.", "Date": "May 30, 2013"}, {"Title": "Fast, good battery life, touch is sometimes annoying", "Author": "Damon Black", "ReviewID": "R1X83MTY76VGPA", "Overall": "4.0", "Content": "I've had this computer for about two months and it has met all of my expectations as far as speed, functionality, and battery life. I can play music through my bluetooth headset for over four hours while other programs are running in the back ground (streaming from pandora, downloading large files, etc).There are two downsides:1. When browsing (I use Chrome), tapping the screen can lead to inadvertent clicks. If you tap the screen near a link or button (not actually tapping the button) the button or link will be clicked. This is useful if you have poor depth perception or spacial acuity, but if you are just trying to select the chrome window or deselect something you have highlighted, you don't want to accidentally click on some advertisement in the process. There may be a way to fix this, but I haven't yet found it. It could be a windows 8 thing, and not the fault of the computer.2. The second annoying thing is the keyboard. I have small hands and the size doesn't bother me, but the lack of key sensitivity does. If you don't hit these keys square on and press them all the way down, they won't register. I cant tell you how many times I have had to go back and add in missing letters while typing this review alone. Very annoying.The sound quality is good, but the volume is not very loud. I tried to watch a movie outside on the deck, but the sound was drowned out by the chirping of the crickets and cicadas. I had to resort to a bluetooth speaker.My stylus broke within the first week (I knelt on it), but sony said they would send me another no problem.Everything else works as advertised and I am very satisfied!", "Date": "August 9, 2013"}, {"Title": "the perfect laptop", "Author": "ivan geerlings", "ReviewID": "R3MXVYPS9PECEP", "Overall": "5.0", "Content": "works super easy never new this could be built. screen is beautifull . System is fast and very light. i used to use my asus 700 transformer but now it is all covered with dust", "Date": "October 22, 2013"}, {"Title": "Perfect for me", "Author": "Amazon Customer", "ReviewID": "R1U7RJAYZ0TKIR", "Overall": "5.0", "Content": "Everything about it is first rate.  The size is convenient for carrying around, yet large enough to see the screen.  The pen works very well and makes using the computer a lot of fun.  This is my second Vaio...the other one is quite old and still working great - gave it to a relative.  The Sony programs seem to be a lot easier to use than their older ones.  Beautiful to look at, very responsive.", "Date": "December 16, 2013"}, {"Title": "I love this thing!", "Author": "Amazon Customer", "ReviewID": "R2CWXZR5W6VFQ", "Overall": "5.0", "Content": "I have seen some bad reviews throughout the internet on this computer...BUT I don't understand why. I think it is a great product. I use it everyday and love it!", "Date": "May 14, 2013"}, {"Title": "I Love it", "Author": "Elizete Borges Luiz", "ReviewID": "R1P6HQ7AX0JTSJ", "Overall": "5.0", "Content": "The product met all my expectations. Beyond what was expected. Thank you for your attention. I liked very much. Recommend the product.", "Date": "July 20, 2013"}, {"Title": "Great ultrabook!", "Author": "Lnakamoto", "ReviewID": "R1BTBKA628U2B8", "Overall": "4.0", "Content": "Product very good. It is very fast. The touchscreen works fine. But Windows 8 is not so good. It is not intuitive.", "Date": "April 24, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B9QFFJA"}}