{"Reviews": [{"Title": "Love it", "Author": "Jake Allen", "ReviewID": "R3O9J8KMIAGS0V", "Overall": "4.0", "Content": "This is a great laptop for everything I need. Its fast and gets everything done I need to quickly and easily. I was a little disappointed it wasnt touch screen but thats not a big deal. The only problem I think I have with it is the absence of some shortcut keys for music controls. Also, the speakers are located on the bottom of the laptop so when I tilt up the laptop, I get a lot more sound. It would have been nice if there were more speakers on the top.", "Date": "June 7, 2013"}, {"Title": "Great computer", "Author": "yakw", "ReviewID": "R2SS0DDOH6L9YJ", "Overall": "5.0", "Content": "This computer is extremely fast and very reasonable considering the specs and ASUS quality. An unexpected bonus was that I found it had Office 365 already installed.", "Date": "May 7, 2013"}, {"Title": "Heads up about the warranty bundle (make sure you get the $700-800)", "Author": "Donna McCombs", "ReviewID": "R11ACLM8KT43E2", "Overall": "5.0", "Content": "Just a heads up, be careful if you buy the warranty from SquareTrade, under as Frequently Bought Together.. they automatically stick you with the $600-700 package, but once you pay for this laptop after tax (just the laptop) it comes to $713.51 I was lucky enough to cancel mine quickly when I realized that the insurance wouldn't cover this laptop if anything were irreparable and they had to issue me a new one, as the lady told me over the phone, in order for that to happen you need to have the complete cost of the laptop covered in your warranty price. So I canceled it before it charged to my card, and went with the $700-800 coverage. Just thought I'd give a heads up to everyone. I bought this laptop for my daughter, I will be having her write a review on it once it gets here and she has a chance to try it out for awhile. I rated this 5 stars for the warranty, because they were extremely helpful and got it transferred over to my daughters name in less than 10 minutes, and it took less than half an hour for it to receive to my email and everything verified.", "Date": "April 29, 2013"}, {"Title": "Love my ASUS!", "Author": "Caroleen", "ReviewID": "R1OWX8AKKKH07S", "Overall": "5.0", "Content": "A Mac user for 5 years, I had to buy a Windows machine for work. I chose this particular model because of its great price and performance, and it has more than met my expectations. The screen is beautiful, the keyboard feel is good. It has been something of a challenge to get use to a new operating system, but now I'm used to Windows 8 and have actually started to like it.", "Date": "June 8, 2013"}, {"Title": "ASUS = VERY GOOD. WINDOWS 8 = Trouble *(READ)*", "Author": "C. Taylor", "ReviewID": "RGCW0RZMSVQXV", "Overall": "2.0", "Content": "5 STARS FOR ASUS. 2 STARS FOR MICROSOFT.My second return to Amazon... not their fault.+ PLUSES: Very good construction, visually attractive, powerful internals, clear display - no problems at all and I recommend ASUS as a company and brand of computer over the Lenovo, Dell, and HP which I checked out and bought. A better fit and finish overall than most laptops. ASUS is based in Taiwan. Lenovo is based in Beijing, China (and crazy NC).- MINUSES: Windows 8 in this model is terrible. Just 2 days after starting the laptop up, Win 8 crashed and continues to do so at least twice a day. Search *Windows 8 crash* and there's a lot of posts on forums as well as other sites. Microsoft's forum on their site has complaints exactly like mine and have been awaiting a Microsoft person to address this problem for a good long while. NOTE: The Amazon rep said he's seeing a number of pcs and laptops with Windows 8 customer complaints and returns.My advice is to stick with Windows 7 or Vista. Windows 8 seems to be unstable whether it's turned on fresh from being off, after sleep, or hibernation. Nothing seems to help unless one runs a registry and junk cleaner of which I use 3. So is it a Win 8 bug that causes the system to be more unstable? I think so. I just try to minimize the chance of a crash by constantly cleaning the system. I do know Amazon's live chat with a representative worked and this thing will leave this house.Dear Microsoft: Being fat and happy will get you beat down by an upcoming OS like Chrome.I did purchase an ASUS N55SL-ES71 15.6-Inch Laptop (8Gb RAM)... more money but I can't afford the loss of business.", "Date": "July 2, 2013"}, {"Title": "ASUS Laptop", "Author": "April A. Nollmann", "ReviewID": "R3PPWLQIGNP9V0", "Overall": "5.0", "Content": "This laptop is great!  I do a lot of work with photoshop as well as light gaming on it, and it handles everything perfectly.", "Date": "July 11, 2013"}, {"Title": "Excellent value for money!", "Author": "CollegeB", "ReviewID": "R1UUYSYVRHOCD", "Overall": "5.0", "Content": "I bought this laptop to replace an ageing (though relatively new) and chronically overheating HP laptop. Needless to say, I will never buy an HP again!This laptop was a great investment and does everything I need, and quickly.Most importantly, I have had no overheating problems- this laptop stays ice cold! Even when doing intensive video encoding, this laptop stays cool. With my HP, you could not keep it on your lap without getting third degree burns!I made a few modifications to this PC to improve its speed... I replaced the hard drive with a solid-state drive and I put a second hard drive in the optical bay. It now runs at lightning speed, only taking 3 seconds to boot!For its price, you cant go wrong with this!", "Date": "July 22, 2013"}, {"Title": "awsome", "Author": "Liz", "ReviewID": "R1JVLLMJJADSCE", "Overall": "5.0", "Content": "Absolutely the best laptop I have ever owned/used, it's fast and efficient. Windows 8 takes some time to get used to but I love it none the less.", "Date": "April 13, 2013"}, {"Title": "Would have been better with Win 7", "Author": "Dan BC \"7 billion universes\"", "ReviewID": "R6Q0AGTPBLZAC", "Overall": "4.0", "Content": "Win 8 on a computer without a touch screen is lame, but the computer seems to be working well, and the transfer of files and everything went smooth from the old Win 7 machine. It arrived in good condition and setup went rather smoothly. It is our 3rd new ASUS in as many years for different family members and they are all working fine with no problems that I can blame on ASUS. As a general rule, I blame Microsoft for everything that Apple can't be blamed for (dumbing down computers, for one).Two books that should never have been written:\"Computers for Dummies\"and\"Fertility for Dummies\"  (who the heck wants THAT?)", "Date": "October 22, 2013"}, {"Title": "Good quality for money", "Author": "Xiao", "ReviewID": "R1ZL4PPDO2S0WM", "Overall": "4.0", "Content": "Some people rate this 5 star, but I think it's more of a four star. The win 8 system is not very handy on this gadget, because it is not touch screen.Pros:Good priceGood qualityGood speedDoes not become overly hotNice big screenLike the keyboard, not too stiff not too loose, and has a number padCons:Speaker at bottom - sound reduces dramatically if using the laptop in bedOperating system is trickyNot very portableIn general I like it. Pleasant buy.Touchpad sometimes acts funny", "Date": "September 6, 2013"}, {"Title": "horrible touchpad, otherwise good machine", "Author": "contactbarker \"contactbarker\"", "ReviewID": "RTV34373VGBUG", "Overall": "3.0", "Content": "Been using an ASUS K55A for over a year. We bought it as a second machine because we had been using an almost identical ASUS for a year prior to that. Both machines are great, no problems, exceed expectations, blah, blah, EXCEPT - Unlike the previous machine which had discrete left and right click buttons with the touchpad, the more recent purchase has the left and right buttons merged into the touchpad. After using both, I will never buy a computer that has one of these crappy touchpads again. It is so bad, I usually will try to wait to use the computer until I can hook up my trackball. The touchpad itself even seems to pick up on my fingers moving too close to it sometimes and I will find the cursor jumping around the screen or to a different input field. I find myself hoping the whole thing will die so we can justify going and buying something with a real touchpad with real left/right buttons.My frustration with the touchpad issue makes me want to leave a \"1 star\" rating. The rest of the machine deserves \"5 stars\". I really can't stress enough how frustrating this thing's touchpad is. I even contacted customer service to see if I could get the touchpad swapped out for the other type, but they are physically incompatible so I'm stuck with it. I'm convinced ASUS went with this newer design because it was slightly cheaper to produce. Awesome - ASUS saved 10 cents building it and probably lost this customer for life.", "Date": "August 18, 2013"}, {"Title": "Super satisfied", "Author": "DedoA", "ReviewID": "R1F3YS1P0YF1QC", "Overall": "5.0", "Content": "The computer is just phenomenal! the second I opened the box I knew I made the right decision. The i7 quad core really is doing its job. I do a lot of photoshop and web design, so I run a few high opacity programs. This beast of a laptop is handling these multiple tasks like a piece of cake. Havent done any gaming yet but no doubt that it will do well. Highly recommended!", "Date": "June 15, 2013"}, {"Title": "Nice laptop... but windows 8 sucks", "Author": "Fairyfemm", "ReviewID": "R3GK1NI6M1HKYQ", "Overall": "3.0", "Content": "I love the laptop... but I HATE WINDOWS 8. If I could, I would take it out. The laptop is fast.. works great.. lightweight.. perfect all but that stupid windows 8, I can't figure out how to do anything.", "Date": "December 7, 2013"}, {"Title": "Awesome laptop great price", "Author": "leibnitz", "ReviewID": "R3RHWDVAB71C9X", "Overall": "5.0", "Content": "I love this line of asus laptop. I have bought at least 40 of this series and apart from changing the hard drive to a solid state drive first thing They are perfect right out of the box.  plenty of memory, and with a SSD change a fast hard drive.  easy drivers. fairly rugged.  I issue these to linemen and have had very few brokens come back. none if it wasn't for aaron, he broke 2  but he also broke a cell phone every month.  I was relieved when he got a job and moved away. :)remember. it stays within budget even with a SSD hard drive swap.  I favor the crucial m500 240GB drive right now.", "Date": "November 26, 2013"}, {"Title": "Love the Laptop but hate windows 8!", "Author": "R. Garth \"rgarth\"", "ReviewID": "RRHSIPVE4930Y", "Overall": "4.0", "Content": "It's a great laptop, it has just about everything one could want in a laptop but it comes with windows 8 and after spending 3 days with it I was ready to chuck the thing out the window.  Luckily it was not for me, it was for my niece and she’s 18 going off to college, so I figure her younger mind will adapt to windows 8 more quickly.Update:Well I was wrong, after she used it for 2 weeks she called me up and said she is very frustrated with windows 8 and asked me if I could get windows 7 put onto the machine.", "Date": "September 5, 2013"}, {"Title": "Wife is satisfied.", "Author": "Richard Roush \"Adams Addict\"", "ReviewID": "R2OQ7UV4Z9WCR", "Overall": "4.0", "Content": "I purchased this for my wife, and she seems satisfied with it.  It seems to be a very good bargain for the price.  While it is not the fastest laptop out there by a mile, it is also far from the most expensive.  I think it is well worth the modest price.  I have a more expensive Asus laptop, and I almost always use Asus components when I build myself a new PC.  I don't think you can go wrong with them.  I would have preferred something with Windows Seven instead of Eight, but they were few and far between, and my wife doesn't seem to be having any problems getting around in the new OS.  Good value for someone not heavily into gaming or other resource hogging applications.", "Date": "September 2, 2013"}, {"Title": "Good computer", "Author": "Lica", "ReviewID": "R72DN79BIJPBQ", "Overall": "4.0", "Content": "This is very fast computer, and works really well. It really do not get hot!There are only two things I don't like about it. My old computer had a LED screen, and I thought it would make no difference, but it actually does. The LCD screen has much more glare and the resolution is not as sharp. The other thing is that this computer actually looks very fragile. The plastic case looks very cheap and I guess it would brake very easily.", "Date": "August 13, 2013"}, {"Title": "Good Quality laptop", "Author": "Krzysztof Kowalski", "ReviewID": "R2EFVGDB97HR4V", "Overall": "4.0", "Content": "Overall very good laptop.Would recommend it.I had to return it since the max RAM is 8GB and I needed to expand up to16GB, but all the laptop is very fast anyhow.Good job by Asus.", "Date": "August 5, 2013"}, {"Title": "thanks", "Author": "Ali Babar", "ReviewID": "R2WE352SVE04B7", "Overall": "5.0", "Content": "this completely met all of my expectations, exactly what i was looking for and all i wanted! thanks a lot!", "Date": "July 14, 2013"}, {"Title": "Good performance and features but poor video", "Author": "motowrench", "ReviewID": "R3LSMC906O9PG", "Overall": "4.0", "Content": "Aside from windows 8, this is good laptop. It boots up quickly, has plenty of power and memory.  The sound about what you should expect from a laptop.Updated: Video performance can be improved by allocating more memory to video card. Default is 32megs. I changed that to 512. You can adjust settings in bios when the computer boots by pressing F2 before the Asus logo shows.Still a great laptop for work and keeping multiple apps running.  Top of laptop stays cool and is comfortable to use.Week later and I'm happy with my purchase. Windows 8 is still terrible.", "Date": "August 6, 2013"}, {"Title": "Like it", "Author": "Anne Renel", "ReviewID": "R34FETDBTRXBR8", "Overall": "4.0", "Content": "I have been happy so far with this laptop.  Of course, it's my very first one, so maybe I'm just happy I finally have one.  It takes a bit of patience getting used to Windows 8 but I haven't had any real problems yet.", "Date": "June 24, 2013"}, {"Title": "Step up for better speakers.", "Author": "Ken Toal", "ReviewID": "R2LHQSQVNCWBGP", "Overall": "4.0", "Content": "The laptop itself is not bad, the speakers have poor sound quality. My biggest complaint is WINDOWS 8 SUCKS! Spend the extra for better sound.", "Date": "June 15, 2013"}, {"Title": "my son loved it", "Author": "villy1231", "ReviewID": "R1BJSPX3UXKALW", "Overall": "5.0", "Content": "Notebook is well used, is genuine, is the use of the system to be upgraded before, playing games quickly, my son loved it.", "Date": "May 21, 2014"}, {"Title": "Would be great if not for a few key issues.", "Author": "Lightus", "ReviewID": "R1WYSJ0LNJ2N8B", "Overall": "3.0", "Content": "Pros:8 gigs of ram is plenty to handle most things.Decent amount of Storage space. (It's split into two partitions: one with 278 GB as C drive and one 397 GB as general storage)i7 @ 2.40 GHz is very solid for the price.Satisfactory build quality. (no particularly flimsy parts, but not impressively sturdy)Number pad!Runs cool and quiet.Okay I guess:After about 7 months of ownership battery lasts roughly 2 hours on \"balanced\".Cons:TRACK PAD:-over the course of ownership my track pad has went from great to completely unusable. It will often (as in roughly half the time) misinterpret my finger placement, not pick up on clicks, think I am using multiple fingers when I'm not (or vice-versa), just stop all together or a weird combination of all these.I've reinstalled drivers, switched drivers, unactivated smart gestures and generally tried everything I could think of software wise to fix it with no results.  I've come to the conclusion that the hardware must be faulty.  Browsing the internet, it seems it's not just me having this issue. I've since switched to using a bluetooth mouse with no issues.HDD:My main HDD is already showing errors on read tests and triggering warnings during S.M.A.R.T. tests.  It hasn't completely died on me yet, nor is it making any particularly worrying noises.  Programs are hanging often though and resource monitor is often showing 100% usage even while nothing is going on.I highlight these as a heads up.  It's possible that this is an isolated incident and most of laptops of this model run fine. If buying used make sure to ask the seller if they are experiencing these issues.  I'd HIGHLY recommend testing the laptop out in person if you have the opportunity when buying used.", "Date": "March 6, 2014"}, {"Title": "excellent product I recommend", "Author": "Sonia Velandia", "ReviewID": "R11ZANGF2J93YU", "Overall": "5.0", "Content": "excellent product I recommend, which is described in the sale of the article, is a good material and is 100% original", "Date": "March 5, 2014"}, {"Title": "Perfect for a college student!", "Author": "Bengirlxd", "ReviewID": "R3DPVMZTLWVG1Y", "Overall": "4.0", "Content": "I am an upcoming college student and I needed to buy a new laptop because my old laptop was outdated. I needed a laptop that was fast and kept up to the demand I was going to give it. I have now used this laptop for a good 6 months and it has yet to let me down. It boots all the way up in around 10 seconds and I am quite amazed by its performance. Installing applications are a breeze and you can run multiple applications at the same time without any hiccups. The extra RAM guarantees switching between applications painless. I was able to run adobe after effects which is a very RAM heavy software for video editors and the computer handled it just fine. However, the computer can handle moderate video editing but not professional. Keep that in mind because it can pertain to other apps such as photoshop and other applications that requires extensive use of your computer's processor and RAM.For you gamers out there this computer can handle moderate games such as League of Legends and Diablo 3. I believe that it can also run games like assassins creed on low settings but it depends on the game. If you are into indie games this computer is perfect for it because they don't require too much in terms of computer specs.Web browsing is smooth like butter if you have a good internet connection and you can seamlessly switch between tabs effortlessly. Office applications also open in a cinch. The ideal laptop for any college student.", "Date": "March 4, 2014"}, {"Title": "Put in an SSD and I LOVE this.", "Author": "MDC", "ReviewID": "RE3PTH9R7UHVN", "Overall": "5.0", "Content": "I put in a 120GB SSD and I absolutely love this computer. The battery lasts ~6 hrs (The SSD makes a big difference) if I'm not watching videos and the computer flies. The processor is super fast. I do a lot of data processing (getting a grad degree in analytics and i have a lot of throughput) and it is fantastic on day-to-day usage. Big Excel and Access files won't give you any trouble, and I've done some programming with it and have been super pleased with the speeds.The only area where it is not perfect is graphics; you cannot play super graphics heavy games with this computer. Granted, I don't play a lot of games to care about that.", "Date": "February 11, 2014"}, {"Title": "I loathe Windows 8.", "Author": "Michelle Smythe", "ReviewID": "R38AJ1P25ZQ8UF", "Overall": "3.0", "Content": "Aside from Windows 8, which I cannot locate anything within, the touchpad is pretty terrible. I like to hold a finger on the buttons to hit the scroll down arrow as I read things online, but because the buttons are not separated from the mouse section, I keep accidentally moving the mouse without noticing. The color is pretty okay, and it's a nice, fast, lightweight, cool laptop. If the touchpad was better, I'd probably give it 5 stars, but I've had to deal with using a mouse while I'm sitting on the couch, and it's not very convenient.", "Date": "January 28, 2014"}, {"Title": "Best bang for the buck.", "Author": "Ken R.", "ReviewID": "R3EO7J53WN1PLR", "Overall": "5.0", "Content": "This is fast and lightweight. The battery life is fantastic and it never gets hot even on your lap. I am a professional photographer and needed something to powerful enough to import, edit, and export thousands of images on software like Lightroom. I am probably going to buy another one of these as my kids have been loving this too.", "Date": "December 11, 2013"}, {"Title": "good purchase", "Author": "Tricia Perilloux \"Tloux\"", "ReviewID": "R34YC2QGQ43K7H", "Overall": "4.0", "Content": "The only draw back is with the operating system, not so much the laptop itself - windows 8 is a little harder than i thought to get use to, but getting the hang of it.  overall, this pc does exactly what I bought it for and I've been very happy with it.  Have had it for about a month now.", "Date": "November 30, 2013"}, {"Title": "ASUS K55A-DS71  Working Fine, No Issues.", "Author": "Stephen L. Holcomb", "ReviewID": "R15PLX4W8KPJQ5", "Overall": "5.0", "Content": "Received it Nov. 8, 2013. It looks good, the keyboard is fine, the touch pad is VERY sensitive (but I like it that way, you don't have to \"pound\" on it). It was easy to \"set\" up. I have had NO ISSUES with it. Its \"fast\". It has NOT got hot (but I haven't run a lot of things at one time). The power supply gets warm, has NEVER been hot. The \"space bar\" kinda \"clicks\" when pressed, not loud, but just a \"click\" you can hear and feel (maybe its supposed to ?). The keys are silent & have a GOOD feel to them. Overall, I'm quite happy with it. I would recommend it.This is my first impression of this laptop: I WILL BE UPDATING THIS REVIEW AS TIME GOES BY. (Nov. 26, 2013). Steve H.", "Date": "November 26, 2013"}, {"Title": "Beautiful and No Issues", "Author": "Tam", "ReviewID": "R3BF3AHWKEX7EI", "Overall": "5.0", "Content": "Beautiful lap top.  Purchased it for our college son and it took him a little time to get use to the set up of the icons but he has had no issues with this computer at all.", "Date": "November 24, 2013"}, {"Title": "It's okay.  Not as great as hoped.", "Author": "DJArthur", "ReviewID": "R3LV67ANLRQ3CN", "Overall": "3.0", "Content": "Seems much slower and more finicky than my Asus N53S.  Windows 8 is much harder to use.Mousepad is not as responsive as on N53.", "Date": "November 2, 2013"}, {"Title": "Installed 16GB of RAM. It Works!", "Author": "GLENN CHEN", "ReviewID": "R3D1Z7YD46AI6O", "Overall": "4.0", "Content": "Installed 16GB high-speed memory (COSAIR Vengence DDR3 SODIMM, 2x8GB 1600MHz).Intel i7 4-cores + Hyper-threading + 16GB of memory, this laptop is a beast. Hyper-threading here is like running 8 cores in parallel. (yeah, no more lag~) Appreciate the free windows 8.1 upgrade over the Internet; still it takes me a few days to get used to it.Over all very happy with the build quality and performance. Plan to upgrade this baby to 32GB Memory + SSD in the next few years.", "Date": "October 28, 2013"}, {"Title": "Excellent choice!", "Author": "yonathan markman", "ReviewID": "R175JFJON8YKFF", "Overall": "5.0", "Content": "Great laptop! Great value for money! Runs smoothly and really accommodate all my needs as a student! Really glad I made that choice!", "Date": "October 15, 2013"}, {"Title": "Some problems", "Author": "Ian", "ReviewID": "R1JGP8R845W51Q", "Overall": "3.0", "Content": "Good computer besides sometimes on the log in screen I cannot type and screen goes black a few times every now and then.", "Date": "October 13, 2013"}, {"Title": "The Asus computer is great; windows 8 isn't", "Author": "Lynn Delzell", "ReviewID": "RD7ZV1I9FREUG", "Overall": "5.0", "Content": "I personally don't like the sensitivity of the 'zoom' on the touchpad mouse.  It keeps changing when I am not trying to change it, so I use a mouse when I think of it.  However, that may just be a matter of getting used to a laptop from being a habitual pc user.  This computer does have the power so that I am no longer tied to a PC, which I really appreciate, and there is nothing else about the computer I would change, except the operating system which I cannot stand but was unable to avoid.  When I WANT to use 'apps' I'll use my phone.  Can't stand the 'mobile app' type attempt to organize what it presumes I want, but my teenage son likes it.  HE on the other hand, doesn't need the computer for as many functions.Love the computer.  It arrived quickly and well packaged.", "Date": "October 2, 2013"}, {"Title": "Incredible..", "Author": "E. Spruill", "ReviewID": "R2KEYCRBGCOU6", "Overall": "5.0", "Content": "I love this laptop.  It is fast and responsive.  One of the best decisions I have made from a great manufacturer.", "Date": "September 22, 2013"}, {"Title": "Perfect except one thing i havent figured out yet...", "Author": "RawrFaline", "ReviewID": "R3A67KEVDNLR5T", "Overall": "4.0", "Content": "Perfect computer for me. Light weight, runs smooth, fast, and easy to bring with me on the go. The only thing that I either do not fully understand or it might be a glitch....or something that I am doing...that makes the screen switch to the start page with all the apps when i am simply sweeping my finger across the mouse pad when I am on any other program like modzilla, word, pretty much anything. Once I figure out why its doing it ...it will be perfect. I am still learning to use this microsoft 8.", "Date": "September 13, 2013"}, {"Title": "Great computer", "Author": "david rigdon", "ReviewID": "R2NT811JPUNNAM", "Overall": "5.0", "Content": "Fast, smooth, really fun to use. Runs everything I've tried. After using my old computer this is like super fast.", "Date": "September 12, 2013"}, {"Title": "Bought for a home based business", "Author": "M. Lachapelle", "ReviewID": "R75T0JXWAEK6C", "Overall": "4.0", "Content": "I purchased this ASUS as an update to my home computer in addition to using it for my home based business. I was cautious about buying a Windows 8 computer. Many of the reviews read panned Windows 8, but as with anything new it is just different. I don't do more than basic functions, so many of the challenges some encounter I haven't. This was, also, my first purchase of the ASUS brand. On that front, I love my new computer. The speed, ease of use, and fast start up are wonderful. The biggest downside I've discovered is the speakers. They are quite soft compared to previously owned systems. I gave this computer a 4 star rating because of the challenge of Windows 8. Great computer for those looking for a not-so-pricey upgrade that still has performance.", "Date": "September 6, 2013"}, {"Title": "nice pc", "Author": "judy shamp", "ReviewID": "R2DG84JWNJG1RG", "Overall": "5.0", "Content": "it meets my needs. light weight. I still don't know how to use windows 8 but the laptop is nice", "Date": "September 5, 2013"}, {"Title": "Fairly Good", "Author": "Jinsu Bae", "ReviewID": "R2N5YSFY080NX4", "Overall": "4.0", "Content": "This is my first laptop to work.  I am used to desktop PC.  It works fine, even with graphic softwares.  Then, it's heavy.", "Date": "August 30, 2013"}, {"Title": "Nice Laptop.", "Author": "Sokreth", "ReviewID": "R11K0Y2D6P5RS0", "Overall": "5.0", "Content": "I have using this laptop for a week now, I enjoy it very much. I know how everyone compliant about the Windows 8, but I guess I got used to it. The hardware of the laptop is very nicely design. But my only critic about the hardware is that the right-shift shares its area with the up-arrow, and the number 0 for the number pad is too small. Also, the number lock keep turning off every time I restart, shutdown, or leave the laptop to sleep. It bothers me. But everything else is fine. 5/5 stars", "Date": "August 15, 2013"}, {"Title": "Great Laptop but Windows 8 is Garbage", "Author": "Prosch", "ReviewID": "R2DO1CCL0OT97E", "Overall": "4.0", "Content": "Everything is great about this laptop except Windows 8. Windows 8 just makes everything more complicated than it was in 7, while at the same time adding in a clunky user interface. I'm planning on just installing Windows 7 on it to make life a lot simpler.", "Date": "August 15, 2013"}, {"Title": "Very Happy with this FAST laptop!", "Author": "WDA IT Team", "ReviewID": "R37VDYNN3EWLZO", "Overall": "5.0", "Content": "What a great price for this fast laptop with nice specs and features! We are so glad that we found this deal!", "Date": "August 13, 2013"}, {"Title": "It works perfectly!", "Author": "Andres Dellepiane", "ReviewID": "R1IDVUN98MWVSV", "Overall": "5.0", "Content": "Great speed and response. Love it! Windows 8 is kind of new to me, but you get used to it.", "Date": "August 13, 2013"}, {"Title": "it looks like a piece of art", "Author": "Xueqing Wu", "ReviewID": "RF8IS21240OTN", "Overall": "5.0", "Content": "it works really well, and  I love it . it is worth the money, way cheaper than the same computer that you can get in China.", "Date": "July 25, 2013"}, {"Title": "Great product", "Author": "Johnny W. Walker", "ReviewID": "R19IIPI7H3NT7Y", "Overall": "5.0", "Content": "It meets all of my needs. I am very pleased with the computer. I would consider another one if I needed a another computer.", "Date": "July 12, 2013"}, {"Title": "good product", "Author": "Ariana", "ReviewID": "R3EUA87UV4NYDV", "Overall": "5.0", "Content": "its everything i expected soo far, however it cut off once, not sure if its the fault of windows 8..", "Date": "June 23, 2013"}, {"Title": "Great computer choice", "Author": "Dustybunny", "ReviewID": "R1BYU4G2Q77NVP", "Overall": "4.0", "Content": "This computer runs great and was a good value for the money.  My only objects is that it runs windows 8 and windows 8 is nothing like windows 7.  It has extra steps to take that would be quick if you had a touch screen but this computer is not touch screen.  So learning windows 8 is not fun, not easy not compatible without a touch scene computer.", "Date": "June 20, 2013"}, {"Title": "Nothing to complain..", "Author": "brad kim", "ReviewID": "R6TRDAOCOAU5Q", "Overall": "5.0", "Content": "I already decided to buy this laptop, and I had to chose where to buy.I have received it in perfect condition, and received in time they promised.There are nothing to complain...If I have problems about the product, then I will complain to ASUS.", "Date": "August 5, 2013"}, {"Title": "Do yourself a favor and don't go with this one", "Author": "ELynne", "ReviewID": "R1DU7HYYVJ66EV", "Overall": "2.0", "Content": "DvD player is very grainy appearing. Also, when you hit the eject button on the side, when it pops out, it feels like you're going to break it just by touching it. VERY very flimsy, and I was so scared to put a dvd in it that I actually held the bottom of the tray while putting the dvd in.. Also, during the playback of one of the DvD's I was watching, at first the Esc button worked fine and took me out of fullscreen as needed when I wanted to look at or do other things at the same time. But then after awhile, it just stopped working. The Esc key didn't do anything, so I had to use the touchpad to minimize the screen. Le sigh..Seems like my internet connection can't stay on at all, even though it says I have full bars of signal. When I try to go download something, halfway in it says download failed, and so I look at the internet connection, and it appears everything's just frozen. Also cannot do 'multiple' things at once like previous i7 processor models claimed to be able to do. Freezes up and lags if you have more then 2 or 3 things downloading or going at once.Also, like most, the drives are partitioned. Only 279 in C drive, the drive that most everything uses, but 397 in D... don't really understand this so I tried merging the two drives together as stated you could do in the user manel, tried what it said by pressing F9 during bootup and hitting enter, but it keeps bringing me to a totally different screen that doesn't say ANYTHING that's listed on the user manual. I also confirmed with both ASUS and Amazon that this thing had a backlight keyboard. Well, either I have no idea how to activate it, or they both lied, because nothing comes on. Overal, for the price I paid, I am kind of let down, mainly because of the partioned hard drive that ASUS claims cannot be merged together or else I could damage the system because they put them seperate for a reason... and the fact that this machine can't seem to multi task for s*** and keeps dropping internet connection, thus me not being able to download a damn thing without it saying it's failed. Also, when I went to do a system health report, it failed, saying it had timed out.. I tried to do it several times, without luck.. Don't know if I just need to wipe this computer completely or what exactly to do about it. Right now it's also now running loud as hell, like some sort of fan or something just kicked on, and it hasn't shut off. Also, good luck loading the internet when all this lag BS is happening.. I'm now writing this review from my backup notebook because this one wouldn't even load any of the pages it kept timing out!", "Date": "April 30, 2013"}, {"Title": "badly configured", "Author": "Nael", "ReviewID": "R238XF5I42HKRG", "Overall": "1.0", "Content": "257 g are only for data out of 750g. Cannot Create factory disks. They charge $50. Customer service are not well trained.", "Date": "July 5, 2013"}, {"Title": "Absolute GARBAGE!", "Author": "Jennifer", "ReviewID": "R2E4GPKTMPSR1M", "Overall": "1.0", "Content": "If you carry this Laptop to and from work, do yourself a favor, and do NOT purchase this piece of crap! It defeats the purchase of a \"Laptop,\" if you can only use the internet, at work, or home. With this piece of s***, every morning I cpome into work, I have to \"update\" or \"refresh\" which takes me through approximately a 30 minute wait.Tech support. Worthless. They can update this, update that, but this Laptop is pure garbage. I should've stuck with HP.Slow and worthless!", "Date": "August 2, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BCHHZGW"}}