{"Reviews": [{"Title": "Works great, others don't know what they're doing", "Author": "Mark Lesko", "ReviewID": "R1AU71R4TV9KBC", "Overall": "4.0", "Content": "I bought this laptop on 14-June-2013.  It works very well, and I'm very happy with it.  As for the complaints from others:1)  The volume up and down buttons work just fine... if you understand that you must hold down the blue function key while pressing volume up (F11) and volume down (F12).  If you don't press the blue function key, you're just pressing the F11 and F12 keys.  Also, you do not need to press the function key in order to activate (and deactivate) the mute button.2)  The fan noise can be fixed in (literally) two minutes by going to the Dell website, and in their search box type \"Fans spinning High, Excessive Fan Noise - A06 Bios Update Fix\".  You will be directed to Dell Article ID: 597270.  Scroll down and click on \"Insp 3721 - 3721A06\" to download the executable file which will update your BIOS from A05 to A06.  Run the executable file and presto, fan noise fixed forever.", "Date": "June 24, 2013"}, {"Title": "AMAZING", "Author": "Doreen", "ReviewID": "R1T92DIU119ILN", "Overall": "5.0", "Content": "I'm writing this review from my moms account because she got it for me for graduation! I love this laptop so much, the screen is huge the keyboard is well placed as is the touch pad. The sound quality is great, i love listening to music while i study. at first I was iffy about Windows 8 but now I am extremely impressed with it. The battery life is not super amazing but honestly I can't complain. The texture makes oily fingerprints show up more than I'd like but it is very easy to clean. Everything runs super fast, the screen resolution is nice and the web cam is clear and not too pixlated. I'm super happy with this product and suggest it for anyone going into college or just having it for entertainment :)", "Date": "June 10, 2013"}, {"Title": "The Sunshine store was very helpful .I bought this Dell laptop had a problem with hard drive 3 weeks after purchase", "Author": "Patricia \"Say something about yourself!\"", "ReviewID": "R1W6UQ072W8YA8", "Overall": "1.0", "Content": "I had a problem with the Start up screen not opening, it would act like it was going to open but it just never would. I called dell tech support, they charged me 119.00 to take control of computer with manual assist just to tell me that the hard drive was out. then dell tech support said they would repair hard drive but it would cost me 169.00 additional dollars. thank god for Amazon standing behind their products, what a fantastic company Amazon is, I would feel comfortable buying anything from amazon. disappointed in Della company i have bought many computers from. What happened to customer service being good??? I WILL NOT BUY ANOTHER DELL COMPUTER. THIS WAS A BRAND NEW COMPUTER, CHECK YOUR WARRANTEE'S", "Date": "August 7, 2013"}, {"Title": "Work well", "Author": "Tracy", "ReviewID": "R272A8EG0AVMY8", "Overall": "5.0", "Content": "Everything is working well so far. The volume keys were designed like this that you have to press it with \"Fn\" key simultaneously.", "Date": "June 25, 2013"}, {"Title": "Sigh....", "Author": "Shaun", "ReviewID": "R19DY2XQ2PQPLM", "Overall": "3.0", "Content": "As previously stated the volume buttons do not work. Ironically mute works just fine. I called Dell and of course they tried to hit me with a $299.99 fee to fix that problem and others that they found on my day old computer. I'm disappointed to say the least.", "Date": "May 3, 2013"}, {"Title": "Perfect for the web", "Author": "Mauricio Becerra", "ReviewID": "R3S895RD99QWTG", "Overall": "5.0", "Content": "I bought this machine for my mother, she only uses it to surf facebook, read the newspaper, check your email, view photos and now learned to transfer photos via bluetooth from the photographic camera and phone to the PC and vice versa.For what it does is excellent for the price and features", "Date": "July 1, 2013"}, {"Title": "MY DELL !!!", "Author": "Karen G.", "ReviewID": "R3EWCGRRF9R9KJ", "Overall": "5.0", "Content": "This Laptop is GREAT!!! I am an older Lady who had on of the first HP computer ever for sale for home use. As I watched my children grow up and buy Laptops I thought they were making big mistakes. But when my HP dino of a computer gave its last beep, I decided to try a Laptop, I knew that Dell made good reliable computers, so I bought a Dell from AMOZON.com, and fell in LOVE!!!!", "Date": "April 2, 2014"}, {"Title": "My wife is happy so I'm happy", "Author": "computer tech", "ReviewID": "R1WJQLN4UZPM1R", "Overall": "5.0", "Content": "Great PC. Wife totally enjoying win 8.1 and on it most of the day on face book games and email with family.", "Date": "January 28, 2014"}, {"Title": "Defect!!!!!!!!!!!", "Author": "Joao", "ReviewID": "R2QGXVV22PVQXE", "Overall": "2.0", "Content": "The buttons (F11 & F12) Volume up and volume down on keyboard doesn't work. If I turn on Windows Media Player the buttons (F8 & F9) rewind and Play/pause on keyboard works like down and up volume. I'm very disappointed with this purchase!!!!!!!!!!!", "Date": "April 18, 2013"}, {"Title": "This computer arrived and within 2 weeks required service.  I should never have purchased a Dell product", "Author": "Dan Davidson", "ReviewID": "R12BNWG5RP7874", "Overall": "1.0", "Content": "I thought I would try a Dell product.  However, big mistake.  Within 2 weeks this unit had to be serviced.  It has been in the shop for the past 3 days and as of this writing has not been returned.  I will never again by anything with the word Dell on it.", "Date": "August 21, 2013"}, {"Title": "New", "Author": "Judith A. Gustafson \"Mystery reader\"", "ReviewID": "R3TMFHLEPGYWAH", "Overall": "5.0", "Content": "This seems to have everything I need in a computer for a very reasonable price.  I would recommend it. Go", "Date": "April 10, 2013"}, {"Title": "Don't buy!", "Author": "GuyOnYurScreen", "ReviewID": "RX6YIB59W3TS6", "Overall": "1.0", "Content": "I've always owned Dell's, but this one SUCKS! The first day I had it, I get the prompt \"not enough memory\", or something like that. It is SLOW AS H@LL, even doing the simplest tasks. I can click on a folder or a file, and it takes 5-10 seconds just to open! Not to mention it has Windows 8, WHICH I HATE! The spacebar half works, I had to buy a wireless keyboard just to use this thing. It has no card reader OR a port to hook up a monitor, I've never seen a laptop that DIDN'T have either of those. I purchased mine here on Amazon from ShopAmerica, I'm wondering if it's a reconditioned computer, as I find it hard to believe a Dell works this crappy.  I would in NO WAY suggest to anyone purchasing this computer.", "Date": "November 23, 2013"}, {"Title": "This is the worst computer I ever bought.", "Author": "phyllis connell", "ReviewID": "R1P07YIIEGLBXA", "Overall": "1.0", "Content": "Well, I guess I am out of luck because I cannot return this item, but I would not recommend this product to anyone.  Every 5 minutes, I get internet explorer not responded, and I have to shut it down, and then it freezes, so I can't even get it to turn back on.  I pay for anti-viral protection, and I only use it for games and facebook.  It is very frustrating, as it never works.  :(", "Date": "August 24, 2013"}, {"Title": "so far, so good", "Author": "Teresa Kerstetter", "ReviewID": "R17FUCHJ6YWPA", "Overall": "5.0", "Content": "ordered for my mother who is not tech savy. she has some problems with windows 8, but seems to be getting used to it as time goes on.", "Date": "June 7, 2013"}, {"Title": "volume has never worked", "Author": "Marilyn", "ReviewID": "R34TN5L3EFP7CH", "Overall": "3.0", "Content": "It is amazing to me that now in the search for a new laptop the reviews on this one has the same problem I had the one I want to replace.  NO volume keys work except the MUTE.  Why has not DELL company fixed this problem.  I am now leary of purchasing it.", "Date": "June 6, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B2066S2"}}