{"Reviews": [{"Title": "Great Laptop", "Author": "Kailua Papio", "ReviewID": "R29P7Z46W1ZFQS", "Overall": "5.0", "Content": "I waited a long time for this one. I wanted portability, great battery life, a disk drive and small size.  It has blue tooth, HDMI, USB 3.0 has 4 gb ram Windows 8 and it is small enough to carry for travel, but big enough so you can read the screen.  Any way the build quality is very high and it is very light.  I downloaded classic shell so the laptop is looking like a classic windows laptop. The touch pad is responsive and I have also used the unit with a wireless mouse and big monitor and keyboard and it worked flawlessly.  Having HDMI means I can show pictures on our big TV and the resolution was great.  Battery life is about 5 hours--I know because used it for 5 hours straight.  I could not be happier!", "Date": "June 6, 2013"}, {"Title": "Computer works well", "Author": "Emily Carpenter", "ReviewID": "RMD60A5VSAXCP", "Overall": "4.0", "Content": "I've had the ASUS 11.6 \" for about a month now and everything is working well. I bought this primarily for the size/weight and was interested in a lower price computer with enough hard drive size and speed. I'm really happy with all these functions and Windows 8 hasn't even annoyed me too much yet, but I primarily use all functions from the desktop not Start Screen.Pros: Screen is nice and clear, and font size adjustment makes it easy to read. Keyboard is a little small, but not uneasy to use. No complaints with the speed yet.Cons: Only main complaint is the touchpad, which is a little large for the size of the computer and my palm sometimes drags against it when typing and moves the cursor without me wanting it to. The touchpad is also a little under-sensitive when scrolling. #2 Battery life seems good, about 3-4 hours, but the battery only recharges when the computer is off/sleeping.", "Date": "July 29, 2013"}, {"Title": "Great price + Windows, but BIG start up problem", "Author": "John M. Haberstroh", "ReviewID": "R24L1GDWJIILLO", "Overall": "4.0", "Content": "Purchased in late June, this computer is working out great, now that I've figured out the at-first cataclysmic 'd-mn thing not starting up' phenomenon.BIG START UP PROBLEM: In brief, a couple months ago I 'left the computer on', as ASUS encourages you to do, just shutting the cover and putting it into automatic sleep. Then, next day, I go to work on it again and it refuses to start up. Serious problem! The first time it happened I didn't know what to do, took it to our university's computer center and they didn't know either. Anyway, I figured the thing had just 'crashed', unplugged the thing and put it aside for a few weeks, thinking about whether or not to buy another 'cheap' computer. Just for the hellavit I plug in and press the power button and wa-la it turns on. I only learned how to deal with this today: same thing happened a couple days ago; I shut the ASUS, putting it in sleep mode, opened it next day and it refused to start up (but the computer was still 'warm', so I knew it was 'on'). This time I deliberately unplugged, let power go to zero, then next morning (a few minutes ago) plugged in, pressed power button and it started right up. In the future I'll never put it into sleep for long stretches of time: I'll either turn it off or hibernate. I never was all that comfortable leaving the thing in 'sleep' overnight, but as I say 'they' encouraged you to do that ...GENERAL REVIEW: The price is outstanding, and Windows and its word processing products are essential for me. It also is sturdy and stylish, a cool-looking machine even though it's under $400. Normal keyboard layout with 11.6 inch size is perfect, especially for increasingly tight economy air travel. It also starts up quite fast, and the sound quality is surprisingly good for what I assume are pretty tiny speakers.Admittedly, with its lack of a Start button, Windows 8 is a hassle, but you can either get 'Start 8' or another free app that will artificially 'reinstall' the start button, or/and just wait for the inevitable Windows 8 update that will restore the start button. Other complaints (aside from the BIG start up problem) would be about the touchpad, which I sometimes accidentally touch while typing, this magnifying the screen in a disrupting way. The battery life also is not as great as ASUS claims, it's about 3-4 hours, though it recharges just fine when the computer is on.Overall, I'm very happy with the ASUS X201E, now that I've figured out how to avoid the gut-wrenching 'not starting up!' problem.", "Date": "October 21, 2013"}, {"Title": "Perfect computer for a frequent traveler", "Author": "J. Lawson", "ReviewID": "R3IZIAHF7BI3IS", "Overall": "5.0", "Content": "I had heard that changing from a windows xp os to a windows 8 would be very difficult but I have found that it was quite easy.  I needed to replace my ASUS net book that I had used for 4 years as my traveling computer.  I chose the ASUS X201E because I had been happy with the ASUS that I had been using.  The X201E is an 11.6 inch model which means that I have a bigger screen and a bigger keyboard which is a definite plus, and the larger size has not meant a heavier weight.  All this at a very reasonable price.  It is cheaper than my cell phone and much easier to use.  Consumers Reports, a very reliable testing organization, feels that any reliable net book will cost more than $700.  I thing my ASUS net books have been very reliable.", "Date": "December 18, 2013"}, {"Title": "This is really a kewl machine", "Author": "Veronica Montoute", "ReviewID": "R8AQFQFXDM48E", "Overall": "5.0", "Content": "it was difficult for me to make a decision, but I don't regret my choice. Mouse pad a bit tricky", "Date": "September 10, 2013"}, {"Title": "Love it!", "Author": "CA shopper", "ReviewID": "R354C6GU5ZB7ZZ", "Overall": "5.0", "Content": "This is a great little computer. So far, just as reliable as my 'big' Asus laptop, but super light and nice design. Several people have asked me if it's a Mac Air. Great for travel. Probably a bit too small for every day work.", "Date": "July 29, 2013"}, {"Title": "dead after 35 days", "Author": "Agim", "ReviewID": "RJZ7X1C9DZQBG", "Overall": "2.0", "Content": "I was happy with the computer until one day it just didn't want to turn on any more and it happened only 5 days after the 30day return policy, now i have to deal with asus which they probably want me to send it for repair and i wil be without a computer for a week or two....i guess u get what you pay for and that's what happened here...i would consider this a cheap computer and will not buy one anymore from this buyer..i know that asus is a good product but maybe the seller have these listed as new and they may be refurbished or defected.", "Date": "December 13, 2013"}, {"Title": "Fabulous Little Laptop", "Author": "sneilk \"sneilk\"", "ReviewID": "R22WA2M4T7OJS4", "Overall": "5.0", "Content": "Fabulous machine.  I bought it for my niece to start college.  She needed something light and trustworthy.  We looked at many and compared reviews and prices.  We decided on the ASUS.  We bought it in the US but she studies in Europe and it works perfectly in either country.  Amazon did a great job with the delivery.  It came early and exactly as described..", "Date": "November 3, 2013"}, {"Title": "great value for money.", "Author": "German \"German\"", "ReviewID": "R33NRD4X4737KU", "Overall": "4.0", "Content": "Is not the most powerful, nor the lightest but this product is great and would buy it again in future.", "Date": "October 11, 2013"}, {"Title": "Excelente máquina", "Author": "DAguilar", "ReviewID": "R211LNDV5JKM1U", "Overall": "4.0", "Content": "Es una máquina muy versatil, ideal para cosas básicas de la casa y el trabajo. Además de ser delgada tiene un diseño moderno. No da problemas al arranque. Según los entendidos, la marca ASUS está considerada como una de las mejores marcas del mercado (PC MAgazine) por encima de las marcas tradicionales.It's a excellent computer, one of the best I have had. I recomend it for everyone who searching laptops for home, work (not graphic designer work). According to the laptop's experts , the ASUS brand it's in the top 10 best laptops (PC MAgazine)", "Date": "July 8, 2013"}, {"Title": "Power adapter died within a week", "Author": "Upul Doluweera", "ReviewID": "R3R184PFK9CSBO", "Overall": "3.0", "Content": "Pros : Good design and portability, Great display and good for average userCons : Power adapter died within a week. Relatively low processor speed.Tip : Go for a core i3 processor.", "Date": "July 23, 2013"}, {"Title": "Worst Amazon Buying Experience -- Ever", "Author": "Daniel Wallace", "ReviewID": "R3MZM2DBNWIL6V", "Overall": "1.0", "Content": "I had an opportunity to get a used version of this laptop for my son's 21st birthday, but splurged, got the new one. We opened it together -- very excited -- turned it on . . . and discovered that not only was it USED, they had neglected to wipe the drive: we had to know \"Jennifer's\" password to get in . . . Not knowing Jennifer, I sent it back, and did not opt for a replacement.", "Date": "April 12, 2014"}, {"Title": "Way too slow.", "Author": "Ron", "ReviewID": "R1OEJX6KVVRUNL", "Overall": "2.0", "Content": "I usually don't pay much attention to the speed of my computer but this one is the slowest computer I have ever used. Even to just shut it down, after the screen goes black it still takes at least another minute to finish shutting down. I would not recommend this Asus at all.", "Date": "February 3, 2014"}, {"Title": "not even turning on after 9 months!", "Author": "eloise oneal", "ReviewID": "R3PRBNLX70ADTV", "Overall": "1.0", "Content": "I was unimpressed by this computer from day 1.  i would sincerely NOT recommend buying another one of these pieces of junk", "Date": "January 25, 2014"}, {"Title": "Worst Customer Service: Buy literally any other computer", "Author": "Adriana Teran", "ReviewID": "R1R6T9ERTUTW2H", "Overall": "1.0", "Content": "I bought a brand new laptop. I need my computer for work. The charger broke almost immediately. No one at the company can tell me where I can buy a replacement in the country. I was told it would take a month to order a new charger. So now I'm left without a computer for upwards of a month. No one at the company seems to care. This is the worst experience I've ever had with any product. Customer service is incompetent, unprofessional and uncaring. I will never buy another Asus product again. If you're considering an Asus computer, make a better choice. Buy literally any other computer.", "Date": "December 16, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B7JRH9U"}}