{"Reviews": [{"Title": "Faulty trackpad, awesome laptop", "Author": "maverickstudent", "ReviewID": "R58YVMMLQRBVZ", "Overall": "2.0", "Content": "Pros: 15.6\" screen, DVD drive, 6 hr battery life, numeric keypad, price, lightweight, stylish, slim, backlit keyboardCons: faulty trackpad, no standard VGA port (mini VGA is non standard and adapter is not available), HDMI to VGA adapter not includedI really like the 15.6\" screen, DVD drive and a numeric keypad, which are not common features in ultrabooks. These features are very important to me. Based on this, I would rate this 5/5. However, the unit I received had a faulty trackpad. It randomly jumped around on click gestures, moved and clicked at random, was sluggish, didn't register scroll gestures correctly. Tweaking settings and sensitivities did not help. Without a properly functioning trackpad, I found the laptop to be useless and had to return it. I gave it a score of 2/5 because even though it has all these awesome features, a fundamental component was faulty. I'd rather have a basic laptop that works than a fancy one that doesn't quite work. Other than the trackpad, I totally loved this laptop.The unit I received had an ELAN trackpad. For comparison, my old Dell has a Synaptics trackpad, and I have never had a problem with it.", "Date": "April 2, 2013"}, {"Title": "Great laptop", "Author": "Asa", "ReviewID": "RVT19HPTVRF1L", "Overall": "4.0", "Content": "Great laptop it's very quick and stylish. it has a lot of the nice features like a dedicated restore button, a backlit keyboard (which is awesome at night!) Super light weight and a great screen. I also feel in love with the HDMI port, its so nice to not have to fight with streaming it to the tv just plug it in and your done.( I use Logitech's touch mouse server on both the computer and my smart phone to control it from across the room and to freak out my girlfriend)  The only problems I have it's a fingerprint Magnet, the speakers are not as robust as i would like them to be and windows 8.... Windows 8 is nice but it's built for a touch screen, and makes it sometimes hard to use with the track pad. All and all a great buy!", "Date": "March 30, 2013"}, {"Title": "Best computer I have ever owned", "Author": "Thomas", "ReviewID": "R2T4R4CEGROTY0", "Overall": "4.0", "Content": "I owned a Gateway Windows Vista laptop, an IBM Thinkpad (running Vista, but downgraded to XP) and a Dell Inspiron Windows 7 machine before this computer. I also used an iMac at my old job.This is without doubt the best machine I've ever owned.I love the backlit keyboard. It is the first time I've owned a laptop with one and it's hard to believe I ever used one without it.I love the number pad.I love the novel interface on Windows 8.I love the fast boot-time because of the solid state hard drive (SSD).I'm giving this laptop 4 stars (and not 5) because of 2 things. First, I don't like the function keys, I wish the \"special\" commands where not the default button, I had to dive into the system BIOS to modify this and now I have to use the FN key to use functions like home, end and page up/down. The other reason I'm giving this laptop 4 stars is the lack of a removable battery. I got this computer for $550 and it is worth twice the price.", "Date": "October 22, 2013"}, {"Title": "unhappy with touchpad", "Author": "vishnu", "ReviewID": "R3HQEP9ISE4HUI", "Overall": "4.0", "Content": "its good...but poor touch pad performance it stuck while working and clicks something else automatically this one irritates alot....remaining things are good...", "Date": "July 28, 2013"}, {"Title": "wifi connection os not stable", "Author": "voojta", "ReviewID": "R2ZJRN0AELBJ9O", "Overall": "2.0", "Content": "All my roommates have stable wifi connection instead of me. My wifi is dissconecected like every 10 minutes if I have a bad day.", "Date": "July 21, 2013"}, {"Title": "Good lap top, touch pad issues though!", "Author": "Jamie Porter \"detbenson\"", "ReviewID": "R2GS8JG1TLB3H7", "Overall": "3.0", "Content": "I had read all the reviews and saw that some people had issues with the touch pad.  I thought to myself, \"what's the chances mine will have that...\" But sure enough, it does.  The touch pad is unusable, I have to use a mouse.  Luckily I'm still under warranty and Lenovo is sending me a box to return the computer to fix it.  BUT now I am out a computer again for who knows how long.  Annoying!!Basically the cursor jumps all over the screen without me even touching it.  It bounces so much you can't click on any buttons.  Worse when it's hot.  Using a mouse fixes the problem (although every once in a while my cursor will fly away) but it'd be nice to have the option of using either one!Other than that, the computer is nice.  Good screen and keys.  Windows 8 is a PITA, but that's not Lenovo's fault.", "Date": "June 10, 2014"}, {"Title": "speakers are horrible", "Author": "gary p bendykowski", "ReviewID": "R3KYG0RNJAD6RS", "Overall": "3.0", "Content": "for watching movies, speakers are not very good at all. also the big thing, the courser just start jumping around the page by itself. as I am typing this right now, I have to bring the curser back so I can continue typing. I don't know if it is a glitch in the system but something seems to be seriously wrong.", "Date": "September 10, 2013"}, {"Title": "Don't buy this", "Author": "M. Western", "ReviewID": "R3JGJLANFJOLYD", "Overall": "1.0", "Content": "Cheap Chinese Computer should be the title of this laptop.  Plastic keyboard and crappy mousepad. Pay the extra and buy an asus, never buying a Lenovo again. Stay away from this brand, this product and this company.", "Date": "August 13, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BDTUBVA"}}