{"Reviews": [{"Title": "Didn't run fast at all", "Author": "brandy kesler", "ReviewID": "R3M4FPYTGG18WV", "Overall": "1.0", "Content": "Slow to run, Just not happy over all with this product. Ended up returning it only to receive all but 70 some dollars of what I paid. Not to happy with this computer or the seller.", "Date": "May 22, 2013"}, {"Title": "I love my computer", "Author": "v", "ReviewID": "R3PLDTRTZ7PGCY", "Overall": "5.0", "Content": "very nice this is the second 1 I bought  One for me 1 for wife  soon another for daughte rthanks", "Date": "May 21, 2013"}, {"Title": "THE PRICE IS GREAT THE PRODUCT IS WORTH IT", "Author": "Vivian Francis", "ReviewID": "R1R1C0LJK0JQVV", "Overall": "5.0", "Content": "OKAY, I HAVE READ EVERY COMMENT ALL 48 REVIEWS..... to be honest the reviews had me thinking if i should purchase this item or not.this laptop have been my daily use and it working excellent, NO Freezing, NO Glitches or anything of the sort..the laptop is sleek, the buttons are Large , soft and quiet  the screen is bright & it's  light > Personally i have no problems with WINDOWS 8 people all you gotta to do is take time and LEARN the WINDOWS 8, because most computers are coming with the windows 8this laptop is solely for my \"school work\" being a B Ed student i have alot of research and typing to do, so may  never find out the negative effects of this item.but in one months time i will be making further comments.so for those wanting to purchase this LAPTOP , go right ahead its a great investment..hey, Amazon I received my Laptop in record timing, long before the  suggested date. THAT'S COOL!", "Date": "May 4, 2013"}, {"Title": "good laptop for the money", "Author": "Jeremy Foster", "ReviewID": "R1YVN65EO3J544", "Overall": "5.0", "Content": "so far this laptop is working good and is just what I expected. its a good buy for what you get.", "Date": "April 12, 2013"}, {"Title": "Toshiba Satellite", "Author": "Jonathan D Elliott", "ReviewID": "ROW61ZU4B6PCM", "Overall": "5.0", "Content": "I felt that when I first purchased this laptop it was going to be under powered. But now that I have been using it, it plays my HD media no problem and streams it easily also. For the money it was an excellent purchase.", "Date": "March 31, 2013"}, {"Title": "Toshiba Satellite laptop", "Author": "Mary J. Kibbe \"theatergirl\"", "ReviewID": "R14N0ZDVQC4OVX", "Overall": "5.0", "Content": "I'm used to Windows 7 but I'm getting used to Windows 8, which was confusing at first. It's like using an iphone.", "Date": "March 31, 2013"}, {"Title": "Great for the price", "Author": "Andrea Marquez", "ReviewID": "RJMC29WMTXC2B", "Overall": "4.0", "Content": "The laptop is great, looks like any other toshiba, is a little simple in design, but, you take what you paid for. Windows 8 is great, a new version.The sound is not a very good sound, but, the screen is awesome. Recomended for the price.", "Date": "March 25, 2013"}, {"Title": "I love Toshiba!", "Author": "Jason M Skiba", "ReviewID": "R1NAZU14B3W0PF", "Overall": "5.0", "Content": "I am a Toshiba die hard and I recently purchased a new laptop for my Daughter through Amazon.  I was satisfied with the shipping and product!", "Date": "March 24, 2013"}, {"Title": "Excelente Laptop", "Author": "JACKELIN PADRON", "ReviewID": "R1H5TZDN4CKD3D", "Overall": "5.0", "Content": "I received my Toshiba Satellite computer I love the computer itself,I highly recommend if a person can to go with another windows program installed on your computer. Other than that, I am pleased withmy purchase and delivery.", "Date": "March 19, 2013"}, {"Title": "love it", "Author": "Nancymaria", "ReviewID": "R1BLHPITGTGLZI", "Overall": "5.0", "Content": "Love it love it love it my daughter ould say she uses it primarily so she happy im happy:) but be warned windows 8 kinda sucks if your not computer savy or that ur used to windows 7 n lower!!! It changed quite abit for my liking in used to the 7 n less I know how to find what I want w the windows list too nany apps to distract the userfrom finding the controls. If I spent more time im sure I could get used to it but I already spent enough time learning it as it is!!!! If anything would wish it would make simple easy systemfor us older gen to use so were not sitting there for hrs  and have time to enjoy the outdoors:)", "Date": "February 25, 2013"}], "ProductInfo": {"Price": "$389.99", "Features": "AMD E-Series Dual-Core E2-1800  1.7 GHz\n4 GB DIMM\n500 GB 5400 rpm Hard Drive\n15.6-Inch Screen, AMD Radeon? HD 7340G\nWindows 8", "Name": "Toshiba Satellite C855D-S5320 15.6-Inch Laptop (Satin Black Trax)", "ImgURL": "http://ecx.images-amazon.com/images/I/41YozSDgrqL._SX300_.jpg", "ProductID": "B00B3PLPEQ"}}