{"Reviews": [{"Title": "Manage your expectations, and the Gateway NE56R41u is a solid value.", "Author": "Eagle80", "ReviewID": "R1RS8C5GBEVF2U", "Overall": "4.0", "Content": "IN A NUTSHELL: This laptop is priced low, it meets all the basic needs, and it even has a few nice touches. If it were a car, it would be a silver and black, 2011 Kia Forte.BACKGROUND: I bought this laptop as a dirt-cheap refurb from a short-term deal site. We use it as a family laptop in a multi-computer household. Here's what I think of it.PROS:Price. It's cheap. Given that it's so cheap ...Performance: It's good. It works well with Kingsoft Office and Open Office (both free and compatible with MS Office). It handles big files. It streams HD videos from Amazon Prime and YouTube smoothly. It grabbed my wireless network tenaciously, hauling in a solid signal throughout the house. It plays youth-appropriate online games including kludge-y educational modules connected to the school district.Keyboard: The keyboard feel isn't up to ThinkPad standard. But it's better than most, with a slightly dulled clicky feel, decent keystroke travel, OK spacing, and no flex. It is quite quiet. It is not backlit, and the white-on-black keys and thin font may confound hunt-and-peck typists in dim lighting. Neat features include the numeric keypad that doubles as a full-sized cursor arrow array. There are also half-sized dedicated cursor arrows and one-touch/two-touch keys. The social media launch key makes me smile, offering more affirmation than I'm likely to get from actual social media.Touchpad: It has a nice feel. It supports multi-touch gestures, and has an up/down scrollbar on the right edge. The single left/right click bar feels solid and positive. The touchpad is centered on the typing keyboard, which prevents you from hitting it with your right palm while you work.Not too much pre-installed software: Just a few things to get rid of and the usual things to install.CONS:Display: It's one of those \"Tru-Brite\" screens that reflect glare, white walls, light fixtures, your face, you name it. I've never understood why a device intended to be portable would have a display best suited to staying very still in a darkened room. Still, for its type, it's better than many others.FURTHER DETAILS:Windows 8: This is the first machine I've used with Windows 8. It'll take getting used to, but here's the big hint: think \"tablet\" or \"smartphone.\" Win 8 is actually pretty intuitive, which is unusual enough that it sort of isn't intuitive if you're used to previous versions of Windows. It was easy to set up user accounts with age-appropriate restrictions.HDMI: A lot of low-end laptops lack this. But this laptop has it, so I can stream content to my TV.USB: There are three USB 2.0 ports, all located on the sides, toward the front of the machine where flash drives and connections interfere with paperwork.Camera: Its webcam shows a lot of background. Skype video calls were fine, with clean images, good sound, and adequate volume.Speakers: They're OK. With the volume set to maximum the sound is harsh but not super loud.Battery life: No problem working all day on ordinary school/office tasks.Construction quality: Better than I expected for the price, a marvel of cost engineering. Fit and finish are tight, and the keyboard, I/O jacks, and hinges feel solid.Indicator lights: There's only one indicator light up top, a blue light on the power button. In addition, there are four tiny indicator lights along the front edge. There are no NUM LOCK or CAPS LOCK lights.Appearance: The Gateway NE56R41u looks business-like with a black keyboard, silver trackpad and palm rest, and a glossy, slightly metallic gray top that attracts fingerprints.UPDATE AFTER A FEW MONTHS OF USE: The laptop continues to perform well (and remember, there are four people sharing it on an occasional basis, including two kids, so although the total hours of use might be less than that of a single user, the amount of wear and tear is exponentially greater). The kids found it easy to customize their accounts, and move easily between this laptop, a desktop running Windows 7, and a truly ancient laptop running XP (!). Finally, the more I play around with Windows 8, the more I like it.", "Date": "June 26, 2013"}, {"Title": "Good laptop for the money", "Author": "GMX", "ReviewID": "R3E5G0ME77NAZQ", "Overall": "4.0", "Content": "I purchased this laptop from Wal-Mart -- but had exactly the same issues as rjhouse describes in his review.  After a half hour or so of useless troubleshooting with Gateway support, I resolved to return it to the store and get a roughly-equivalent laptop from HP for $20 more.But before doing so, I used Device Manager to \"Update Driver\" on the \"Broadcom 802.11n Network Adapter.\" which swapped out the Broadcom driver for one supplied by Microsoft.  I have not had a problem since -- it has been working 100% great, not a single drop, and network performance has been fine.I kept the laptop and haven't looked back.  This laptop is pretty decent for the money.  Performs well, good amount of storage, reasonably low price.  Knowing what I know now about how to get the networking to work properly, I'd buy one again if I were in the market again.I won't give it 5 stars though -- it's not all roses -- there are a few things I find annoying or unsatisfactory:- Audio isn't loud enough- The touchpad button is one long bar that acts as 2 buttons, depending on which end of it you press -- but this renders the center of the button unusable and the button is progressively harder to press the closer to the center you get.  So you pretty much have to press the very ends of the bar.- The touchpad is offset to the left.  I guess this makes sense as it's more like a full-size keyboard since they fit a full numeric pad onto this one -- but since it isn't centered with the screen, it takes some getting used to.- No caps-lock/numlock/scroll-lock lights (somewhat resolved using keyboard-leds.com app).  But I think many laptops are like this nowadays.", "Date": "May 23, 2013"}, {"Title": "3 months, 1 restore, 1 hard drive failure, refund or replacement refused", "Author": "Matt", "ReviewID": "R13FGOG3Z2FOIE", "Overall": "1.0", "Content": "I know this is a cheap laptop, but it would have been nice to use it for more than three months (light business and very little web use) before it crapped out.  Just a few weeks after I bought it, I had to restore it.  Then it worked decent for a month or so before I started getting hard drive failure warnings, and now it's kaput.  Luckily, they're replacing the hard drive and all I have to pay is shipping, but I shouldn't be sending off this item so soon.I don't recommend buying this.UPDATE: I spent twenty-five bucks for shipping with insurance to have the hard drive replaced.  The laptop arrived in the mail today, and after spending hours moving my files back to the laptop & reinstalling programs, I'm getting a blue screen telling me the PC ran into a problem and has to restart.  I've contacted Gateway support and requested a refund.UPDATE #2: Acer (apparently when I bought a Gateway, I was actually buying a disguised Acer) support tried multiple times unsuccessfully to fix my many problems with this computer, then asked me to send it in for repairs again.  I refused, as I am not investing another dime in this piece of junk.  They refused to give me a refund, so I asked for a new unit to replace this one, as it is completely useless.  They refused to do that as well.  \"We do not offer refunds or replacements,\" they said.  I will never buy anything Gateway/Acer again, and I strongly discourage anyone else from doing so.", "Date": "June 17, 2013"}, {"Title": "Mooooo", "Author": "Bond, James Bond", "ReviewID": "R1NY5W2IES9TBB", "Overall": "4.0", "Content": "First of all, what happened to the cow boxes....?This is my first gateway computer and a replacement for a Toshiba satellite that i purchased with no research whatsoever bedsides being inexpensive and having a  number keypad.First impressions- Not a bad computer at all! 3 USB slots and a HDMI so thats an upgrade for me. Windows 8 is kind of funky and I don't like it one bit but that has nothing to do with the computer itself. the screen is clear and large enough and the camera works good enough for video chat  bad stuff- speakers suck,great buy for the price!edit*** a few weeks laterspeakers are stil low quality but you get used to it. I wish there was a caps lock and number lock indicator light but I guess I can use my eyes as i type.I am happy with the battery life and I think this computer s a keeper.No as far as Microsoft goes..........grrrrrr making Office super expensive and a horrible interface.But the computer is good once chrome takes over :)", "Date": "March 19, 2013"}, {"Title": "Very Good Computer with Minimal Draw-Backs", "Author": "Jacob Murray \"book worm\"", "ReviewID": "R1TV1JGHO4UF39", "Overall": "4.0", "Content": "This is a decent computer, I am really happy with my purchase.PROs:-Large screen allows for great video/ movie watching-Keyboard is easy to use-Trackpad is offset, so that I don't hit it with my palm.-Number pad is included-Easy to set up and use-Lots of space for pictures with half a Terabyte-Pretty good RAM to handle multitasking and video conferencing.-Durable material-Well madeCONs:-Function keys seem backwards, in order to use the F1 through F12 keys you have to hit FN first.Takes some getting used to.-The number pad functions as the computers only source of Home, End, PG Down, PG Up keys, so you have to turn off Num Lock to use them. However this is how it is on my other computer, so it's not like I'm not used to it. It's just a way to save space.-The Really Big Kicker is: there is no indicator lights for Num Lock, CAPS Lock, or Scroll Lock. I just have to check my paper as I go. The computer does come with a program pre-installed that allows for some indicator, but you have to have the screen open at all times. You do get used to it.Overall, I am happy for with this computer, and I am actually buying another one.", "Date": "October 6, 2013"}, {"Title": "Refurbished? Looks and preforms like new. Bought another one.", "Author": "Daniel Shannon", "ReviewID": "R15VE0D8RB7HH5", "Overall": "5.0", "Content": "I liked the first one so much I bought another one.  Both were spotless and worked well.  Other reviews said the speakers were bad - they were right - all laptop speakers are bad. Buy some amplified speakers $20 - $40.Nice computer  Great price", "Date": "August 26, 2013"}, {"Title": "wanna be computer", "Author": "Johnny", "ReviewID": "R2LIGYFV8605II", "Overall": "1.0", "Content": "When I got this computer the windows 8 took a minute to get used to but I do like it. Have a little trouble with mouse pad being offset with the screeen and my big hands hitting it when i type. Download speed is a little slow to me compared to a friends HP laptop. Heres the big issuse I have. On the night of the second day having this, lines start appearing on the screen as if the screen is going down. Will call the shipper and see what they recommennd, but will most likely send it back and get an HP or Dell. This is too big an issue to have to deal with, but other than the screen acting stupid I do like it.Update on 10/28/13. On the 27th the mouse pad quit working, the cursor disappeared and I will be sending it back.", "Date": "October 20, 2013"}, {"Title": "very nice laptop", "Author": "William McDade", "ReviewID": "R1VXIKN4CMM13T", "Overall": "4.0", "Content": "This is a very nice laptop.  Still learning windows 8 so not able to give 5 stars.. Laptop does get hot fast but this has not been a problem with the workings of the computer.  nice job", "Date": "June 27, 2013"}, {"Title": "slower than imagined", "Author": "MELISSA BROWN \"MELLY\"", "ReviewID": "RDDOTQY57L2VC", "Overall": "3.0", "Content": "it was very slow and was crashing right away, its memory sucks and is not a very good buy, wouldn't recommend.", "Date": "April 6, 2014"}, {"Title": "Refurbished Gateway", "Author": "Diana M.", "ReviewID": "R3KJE0MI9EPC7P", "Overall": "4.0", "Content": "not a bad laptop for the price i find windows 8 takes some getting used to but over all performance is good!", "Date": "February 20, 2014"}, {"Title": "Good value for the money", "Author": "Chris O'Leary", "ReviewID": "RQNTG4W6BNK1S", "Overall": "4.0", "Content": "I've had this laptop for 2 months and have been pleasantly surprised by it, given the price. Speed is good. Battery life is very good. Display is good.The only thing that I worry about is the power plug connector. It's a little wobbly and I'm very careful to not put any strain on it.", "Date": "December 20, 2013"}, {"Title": "Messed Up Wireless Adapter", "Author": "rjhouse", "ReviewID": "R182VWE240I1RL", "Overall": "1.0", "Content": "Broken straight out of the box. It would connect to the Internet, but it wouldn't stay connected. Everything else in my house connects just fine - Xbox, Wii, desktop computer, cell phones - but not this. Reinstalled driver and it said it couldn't find the wireless network card. It would still connect though...for a minute, or five or ten. Gateway is taking it back. Not worth the hassle", "Date": "March 29, 2013"}, {"Title": "you get what you pay for...", "Author": "K. eadie", "ReviewID": "R3TYIHFFMWLOJN", "Overall": "2.0", "Content": "This is my very first laptop. There are SO MANY different processors & I had no idea what was better ~ I had no idea about anything! The only thing I knew was that I only wanted an inexpensive model, so I was happy to find one with so much memory for such a low price. And, I had always thought that gateway made a really good product. Well, now I wish I had done more research before I bought this one. It just looked so nice!The very first thing I noticed was that the keyboard looked like it was warped ~ all the keys look like they were removed & put back on without pushing them all the way down. After looking at friend's laptops, I believe the keyboard looks this way because there are so many keys on it. The number keypad is nice, but not all that important on a laptop. They could have spent a little more on the plastic they used for the keys & it wouldn't feel so cheap. Also, the pad itself feels awkward when typing, because there are so many keys on the pad, I have to center my hands way over on the left side, or I hit ENTER all the time... there is no space between the number pad & the typing pad because there are two ENTER keys.The other big problem I have with the keypad is that there are NO LIGHTS ON THE CAP LOCK OR NUM LOCK KEYS! This makes it really a guessing game when entering passwords... something I never thought about until they weren't there.Now for the computer itself... it is really fast. But, there are many times when I turn it on and it does NOTHING! Just a black screen. I don't think it is updating anything, because it doesn't even go to the start up screen to tell me it's doing anything. I have read about this happening to other people, too. I've just held the power button & let it sit for a few seconds, then turn it back on. I tried letting it go until it turns on, but it never does. I do believe this is a manufacture defect, but as long as it does turn on & start, I won't do anything with that... oh, and there is no lid lock on this computer ~ which is pretty minor. That is about all I have to say right now about the computer itself. WINDOWS 8 is a little hard to figure out, but once I figured it out, it was easy to use. and it was really easy to figure it out.I forgot to add this to the list of computer complaints... THE SPEAKERS ARE HORRIBLE!!! THERE IS BETTER SPEAKER QUALITY AT THE LOCAL TACO BELL DRIVE THRU!! I have to use headphones if I want to listen to ANYTHING, because the speaker quality is so bad that it's almost impossible to tell if it's music or words or just static coming out!! However, the VOLUME buttons are very nice & handy to use!! (one for MUTE, one for VOLUME DOWN, and one for VOLUME UP).", "Date": "June 25, 2013"}, {"Title": "I like this computer", "Author": "Mr.Bill \"Children author\"", "ReviewID": "R1I2F1ZVXY878Y", "Overall": "4.0", "Content": "I have a Compaq desk top computer that is 8 years old and very slow. 1.8, and 1gigram.This lap top I got at Walmart for my self, within 2 months it crashed. I read on line and corrected.This issue has happened twice in 6 months, since this time bought one for my 19 year old daughter and It's been a charm.Lacks in sound at 100%, but not in it for movies or gaming. I use it as I'm a children author.From Concord,Ca.", "Date": "April 4, 2014"}, {"Title": "Excellent computer!! The best computer I've ever had!!", "Author": "Purrrfectcat \"MY PURRRECIOUS IMPURRRFECT CAT ...", "ReviewID": "R1Q8NRETFPSTWJ", "Overall": "5.0", "Content": "I'm an intermediate computer user.  I purchased it on November 3, 2013 at walmart online (as a package deal at $328 with a $8 flash drive & $8 laptop cover) and it arrived 3 or 4 days later.First of all, I was just looking for the cheapest most reliable laptop ever since the ASUS eee pc was no longer made and mine had broken.  I first bought a googlechrome computer at newegg thinking it would solve that problem, but I could NOT download any other of my usual apps like jarte or audacity or irfanview, etc.  and it would not work with my non-cloud ready $200 HP printer.  So then, I saw the package deal at walmart online and was willing to pay more for a more reliable, convenient laptop with a WINDOWS operating system. ( I'm not a big fan of microsoft and in fact, I love Google more than microsoft (microsoft's browser and search engine will never compare to google's apps/search engine), but the googlechrome computer should give an option for consumers who NEED the microsoft operating system.)I was quite shocked to see how BIG and heavy and POWERFUL it was!!  It's 8 pounds, about the weight of a heavy shopping bag of groceries.  The laptop monitor is the largest I've ever had on a laptop for a 15.6 inch and you don't have to scrunch your eyes to see everything.The computer started up SO FAST, automatically had a password screen which reminded you below the password field whether you had caps lock on or off.I HATED the Windows 8 charms(which is the main route to the control panel), multiple ads, etc which I was forced to view first before it allowed me to click \"Desktop\" so I could get to the desktop to do my work.I was finally able to delete all the useless programs like games, nero, cyberlink, weather, etc.  and download and install my favorite programs:open officeutorrentjarte plussolid converter pdfabbyyfinereader OCRzonealarm pro firewallaudacityrename masterirfanviewspybot(my HP printing driver utility software which I downloaded from the HP website)googlechrome web browserprofessional notesbrowser(a faster, easier, more organized reminder app that's better than sticky notes that can hold tons of to-do info)wordweb (dictionary/thesaurus)the sage (dictionary/thesaurus)With all the above apps + a few more small apps AND my music and video, I've still only used 76 GB of my 500 GB hard drive.My HP LaserJet Pro M1217nfw Monochrome All-in-One Printer worked great with the laptop.What also shocked me was that it had a DVD/cd player!!There is a webcamera on it, 3 usb ports, a microphone port, an earbud or speaker port.There was no physical laptop manual with it.  Instead, it's installed as a pdf on the laptop.  It's easy enough to print out the sections you want to save for later.There is an automatic recovery system on the laptop and all you need is a 16 GB or more flash drive to save the recovery contents.I like how you can organize files now thru their \"Libraries\" in the Windows explorer filing system.  It makes it easier to locate files with Search automatically on top thru the Windows explorer filing system.The speaker isn't very loud but that's ok because when I'm at a cafe or library, I don't want everyone around me shocked because of my loud music with my headphones.  I just buy speakers to push up the volume when I'm at home.I had NO issues with the wi-fi.  I could connect anywhere when I traveled to Starbucks, other cafes, the library, etc.On the bottom left of the desktop, there's a red button \"gateway power button\" to quickly shut down/restart the computer.  It no longer is under the start menu.Also on the bottom left of the desktop is a blue button \"gateway device fast-lane\" where you can easily/quickly turn the wifi to \"airplane on\"(to stop all wi-fi) and view/turn on or off the caps lock and scroll lockThe charms are on the bottom right that control things like the control panel.I've used it all this time WITHOUT the battery since I wanted to save the life of the battery and I've always just used the adapter outlet cords.It takes a while to learn how to use the keyboard buttons (especially the F1-F12 keys), but it's not that difficult to navigate.The only problems I've had are when my cat nonchalantly steps over the computer keys especially the F6 key (which won't let me use the touchpad) and the mute speaker key on the top right of the keyboard (which kills the sound), then I have to figure out how to correct them which gets easier the longer you're on the laptop.The computer included Norton security software which I paid a year for Norton Internet Security's anti-virus system.  It kept conflicting with my paid for zonealarm firewall so I chatted online with Norton support which took a while but the tech support was fabulous from Norton!The reason I give it 5 stars is because I have NEVER had a computer that has failed because of malware and FIXED ITSELF!!  I downloaded lots of malware(being stupid and not really investigating what kind of adware/spyware/malware a software download had) and so my computer would crash or was uncontrollable.  Well, when I shut the computer down and restarted it, it FIXED ITSELF!!  I never had to call tech support, never had to call walmart nor gateway!!!!  In fact, while I was chatting with Norton, I asked them to remove the malware and they did it quickly & smoothly!!", "Date": "January 23, 2014"}, {"Title": "Problems from the start", "Author": "Robyn, VT", "ReviewID": "R3VHQNIH9OA9WY", "Overall": "2.0", "Content": "Bought this in a store, not from Amazon, but feel obligated to warn others about this laptop.  First of all I was really bothered that this didn't come with Microsoft Office or the like, as did the last laptop I bought.  I guess that is the way now, making you pay for the additional software...lame.  Upon attempting to use the disk drive for the first time it was not properly installed....spent a good chunk of time with tech support, which we were able to fix it, but not off to a good start.  Now after only a couple months, the mouse is freezing up all the time; I've had at least one occasion where it wouldn't start without removing the battery and returning it before it would power up.  Couple times it's frozen completely and I need to manually shut down.  Also, as most people find, Windows 8 is a disaster to navigate, so confusing, impossible to find basic stuff, open two folders at the same time, etc...  not a good operating system.", "Date": "July 9, 2013"}, {"Title": "Great System for the oney", "Author": "rosalie owen", "ReviewID": "R2AYTNUOGBKFIT", "Overall": "4.0", "Content": "It was a gift for my granddaughter, and she seemed very pleased with it. I was a little shocked in the shipping package. huge box with the Gateway wrap in packing tape stuffed between a bunch of paper. . I also purchased one for her twin brother refurbished also from Walmart , and that arrive in a  Gateway box  the same as a new one, which was a lot more presentable . end result both notebooks work the same.", "Date": "April 4, 2014"}, {"Title": "The Gateway is great", "Author": "Trey", "ReviewID": "RJRP65EA5JCB2", "Overall": "4.0", "Content": "My wife loves it. It does what she wants and she can easily cam with her family which is most important.  Typing is easy with the keys and the speed is good.  The speakers would be the only upgrade for it's daily use.", "Date": "October 29, 2013"}, {"Title": "I'm making great progress with my new gateway.....", "Author": "Edwina Brown", "ReviewID": "R3QDX432O31LKQ", "Overall": "3.0", "Content": "It started out a little slow but with a couple of tweaks I will have it just the way i want. Then it will be what I like in a laptop.", "Date": "August 27, 2013"}, {"Title": "Sweet!!", "Author": "Melissa", "ReviewID": "RF1F0DY6DGT1J", "Overall": "5.0", "Content": "Actually better than I expected... Love the look and I am liking windows 8, great new enhanced features. Great buy...", "Date": "April 14, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00BL5RFNS"}}