{"Reviews": [{"Title": "Quite satisfied, minor disadvantages", "Author": "Andrew N. Lietzenmayer", "ReviewID": "R38YQQB77XEG9B", "Overall": "4.0", "Content": "I am quite satisfied with this laptop.  It serves my purposes, decent battery life, good performance when the set to high performance, nifty features.  What really blew me away was the built in disc tray.  I despise trays so that was huge for me.  The keys are nicely spaced and the backlit keyboard is another nifty feature.The few things I have to complain about:  The track pad was a pain at first but with some programs installed is no longer a problem.  And the Fn Lock key is nifty but I entirely dislike that the function eject key is on the Delete key.  Very inconvenient when using Function Lock because I use Delete a lot when I'm working.  So I end up not using that helpful feature at all.  Other than that, the built in battery is a bit iffy because I more than likely will have to take apart the entire case to get to it if I ever have to replace it.  I don't think I'll need to change it but technology, you never know.Otherwise, great laptop, very satisfied.Side note:  The 14 inch does NOT have that num key pad as advertised in the photo.", "Date": "November 11, 2013"}, {"Title": "Decent Gaming, Nice HD, Fast, Sleek, Light, Low Heat", "Author": "Sora", "ReviewID": "R2U3DX8ZNPO4BZ", "Overall": "5.0", "Content": "I like the thin HD screen with anti-glare / non-gloss. I can use it in well lit rooms without images disappear under reflection of everything. Resolution is higher than most 15.6\" screens and lowers well for easier viewing. Outputs easily to HDMI without any adjustments required, unlike VGA outputs. Light sensor automatically adjust screen brightness to reduce eye strain. Download the control softwares from Samsung website for them to function.Graphics by nVidia GeForce 630M is decent and gets 9000+ on 3D Mark 2006. Most 2008-10 games will play at High quality settings. Intel HD 4000 graphic chip runs under low load to save battery. As always, download latest drivers from nVidia and Intel directly for best results.Hard drive is fast due to 8GB Solid State Drive used for cache.Laptop profile is very slim and small. Amazon pictures show larger and thicker 15.6\" model.One severe issue I had was the Ethernet wired network port chip driver (updated by Windows 7 Update) was using 20% to 30% of CPU power all the time. Since I don't use wired network I disabled the device from BIOS settings (F2 during initial power up screen). That fixed it. A proper fix would be to uninstall the bad driver and download a good driver software (perhaps older version from Samsung website).I bought mine at $417 shipping for used that looked new.", "Date": "November 15, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00B9KV766"}}