{"Reviews": [{"Title": "The Twist is a great option for those that want the features of both a laptop and a tablet", "Author": "Jack W. Bransom", "ReviewID": "R2RLC6EKG7MPZW", "Overall": "5.0", "Content": "The twist is the ideal mix of laptop and tablet.  It is proving that there is a middle ground. I would recommend this device", "Date": "October 9, 2013"}, {"Title": "Light and convenient", "Author": "Epicurean", "ReviewID": "R7BB5LWX6PYCB", "Overall": "4.0", "Content": "I love the touch screen and it's very responsive. The new Windows took getting used to, but the Thinkpad is great. I don't use the twist as much as I thought, but I love how light it is. performs like my old Dell. I can't tell it was refurbished; seems new to me, even after six months.", "Date": "May 6, 2014"}, {"Title": "Really unhappy experience", "Author": "Siqiao", "ReviewID": "R39I9FX09LWCBS", "Overall": "1.0", "Content": "The battery of this laptop doesn't charge at all. Can't use it. Otherwise the laptop it self is pretty cool. Very fast and nice touching screen and cool design. The only but fatal problem is the battery.", "Date": "January 14, 2014"}, {"Title": "almost fantastic", "Author": "nevvy", "ReviewID": "R243F42N1LKDSF", "Overall": "4.0", "Content": "+ hybrid form-factor (laptop+tablet), very convenient+ good screen with touch capabilities+ decent cpu productivity+ hybrid HDD+SSD storage (significantly improves boot and work speed)+ 2xUSB 3.0+ i experienced no heat and/or noise problems so far, but my loads are usually not that heavy+ fine weight and sizes (though hardly fits in sleeve pouches even for 13.3\" and weights too much to be held with one hand)+ soft-touch plastic for outer surface (though i guess all thinkpads have this?)+ price (i bought a refurbished one with i5-3317u for about $540)~ preinstalled Win8, which seems not as horrible once you have a touchscreen at hand~ no discrete videocard (so forget about serious gaming), though it's not the device which is supposed to have one-- relatively weak battery (3-3.5 hours)-- the keyboard really, REALLY sucks, I can't get used to it even after a month of usage:(1) i don't like the keys mechanism - it's too soft and frail;(2) it also lacks some keys like Insert or Menu (the one between your right ctrl&alt;), which I use and need;(3) the F1-F12 keys are small and not in any way separated from others, arrow keys are also extremely inconvenient to use;(4) no numpad, but it's a matter of size - i'm not sure i've seen a single laptop with even a 13.3\" screen that has a numpad(5) Fn & LCtrl keys are switched, but you can switch their assignments in BIOS-- the lid (screen) is not very stable in laptop state - printing makes it shake-- few interfaces: could use more than 2 USBs and a usual HDMI instead of a mini-HDMI-- no HDD load indicator (LED light on front panel)-- not really great with Linux (I use Ubuntu and the clickpad is the main source of trouble there; also some problems with suspend)my twist also has a sim slot, but I have not tested it and have no idea whether it works/should workSummary: great as a portable device if you need/want something more than a stupid disfunctional tablet under ios/android (but be careful with the battery), but it makes little sense to use it as a stationary computer. Though it might be a decent tradeoff if you need one thing to play both roles.", "Date": "December 7, 2013"}, {"Title": "Exceeded my expectations!", "Author": "O4", "ReviewID": "R24G1E0EHVP33", "Overall": "5.0", "Content": "The computer was exactly as described.  The performance exceeded my expectations.  It included all the software described, including Windows 8 Pro, which saved me $129 upgrade when compared to most other ultrabooks I looked at.  I am very satisfied, particularly given the prices.", "Date": "November 11, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CDU5JQK"}}