{"Reviews": [{"Title": "Deceptive Labeling", "Author": "Alejandro \"Alejandro\"", "ReviewID": "R1HRZOAST2650P", "Overall": "3.0", "Content": "THIS IS NOT THE VAIO FIT 14.Perhaps due to some confusion on Amazon's end (or else deceptive practices) this product has been mislabeled as being the Vaio Fit 14-inch variant. This is actually the Vaio Fit E 14-inch variant. This E (basically for economy, or entry-level) means this is slightly fatter and made of matte plastic. This true Fit 14 laptop you'll find on Sony's website is a much more professional, thin aluminum-frame laptop. In truth, Sony should take some of the blame for naming two laptops made from totally different materials and components so similarly (Fit/Fit E) but I just wanted to warn anyone else before they purchase the incorrect laptop.", "Date": "September 25, 2013"}, {"Title": "Defective WIFI across VAIO line - NO ETA FOR FIX", "Author": "J. L. Wood \"Media Engineer\"", "ReviewID": "R15D356H8HL0TJ", "Overall": "1.0", "Content": "Avoid VAIO - Hardware WIFI IssueI am sitting here looking at a the white version of this Sony VAIO, 14\" (touch) i7-3537, 750 HD no SSD, 6 GB ram and it is fun as long as you don't need the WIFI to work. Sony VAIO across the spectrum are defective when it comes to WIFI. In particular they drop the WIFI signal and Sony's answer to this is \"NO ETA\" on the cure. Do yourself a favor a either Google this or go to the Sony User forums and you will see this is a major failing by Sony and they are not offering any kind of resolution other than \"NO ETA\".My Sony VAIO is not even 2 months old and it has had multiple driver updates with no fix. In fact the last driver update appears to have disabled the computer from being able to alert you via the WIFI icon if the system has dropped connection. As of the last month it randomly disconnects and connect, making it useless unless it is physically wired via the Ethernet.I venture Sony is trying to program around defective hardware in the form of the wireless card that appears to be in all levels of the new VAIO back into 2012.Now if you don't care about wifi, this computer is pretty nice. 1600x900 works better than FULL HD or 1366x768 in my book. Bring magnifying glasses if you opt for full HD. USB placement isn't the best, but at least the VAIO has four where many have only two. It has an optical drive and Ethernet, so it will work wired up like a nice desktop and the HDMI out drives a nice signal on my 47\" LG LCD (120hz) (using Cheetah brand HDMI cable acquired on Amazon.)Sony Art Rage and other productivity apps are extra fun bonuses.Real world battery life is about 4:20 for me which is as long as my longest flight.The WIFI issue that remains unresolved is a VAIO-Killer when compounded by Sony's lackluster customer service. This is the second Sony I purchased this year. After a lot of research, this is one of the better fully capable laptops of the second generation of 2013 Win 8 touch screens IF YOU DON\"T NEED WIFI.", "Date": "September 1, 2013"}, {"Title": "Great laptop...plus its white!", "Author": "Charles S. Lawrence", "ReviewID": "R1HC1UEFZ4W8WD", "Overall": "5.0", "Content": "I got the laptop for my daughter who just started at the University of Notre Dame. I have a limited budget but I did want to get her the best I could since she got a full-ride to ND. I knew the next gen ultrabook/laptops are coming out now, but I needed it a month ago. She wanted this one because it was white and had a touchscreen.I picked it because it had a 3rd gen i5, 1600x900 res (FHD would be better), backlight keyboard, not an ultrabook (to many issues with wifi and keyboard/trackpad in many current models), 14\" screen (wanted 13\"-14:), weighs 4 lbs.I created the backup on usb and replaced the hard drive with a new Intel 240GB SSD, I then restored the system and customized the software. It boots in 14.7 seconds with the SSD and is very responsive.She used it at home for a couple of weeks to get used to it and loves it.  I had to connect remotely after leaving the university using LogMeIn to get her properly setup on their secure network (IT department seemed like they never heard of windows 8) but since then she has had no issues.BTW, Win 8 is pretty dam good, especially if you have a touchscreen.  I don't and just use desktop mode and I have had it for a year and love it, my kid does too.I also purchased a second, Sony battery for the laptop from another vendor so she could make it through the entire day.NOTE: The first laptop of this model I received worked fine for a few days till I tried to create the restore image and it started to crash. I could have reloaded it myself but since it was so new I returned it for another, and I must say, AMAZON HANDLED THE RETURN SO WELL, I will not hesitate to make any size purchase with Amazon. I issued the RMA on Friday evening and by Monday we had a new laptop.  This time I created the recovery media right away (after updating it) and had no problems at all.", "Date": "September 3, 2013"}, {"Title": "Built-In Wi-Fi is defective indeed", "Author": "J. Rejoso", "ReviewID": "R36SB7H1CJO57H", "Overall": "3.0", "Content": "Got one for my daughter last July and still waiting for Sony's fix on the built-in wi-fi.  Tested it in 3mbps Manila, in 100 mbps Tokyo and in 20 mbps Houston - and it just sucks everywhere!  I am seriously contemplating on buying that $22 Intel WiFi Card and request Sony Service Center to replace that horrible Broadcom wi-fi chip, or perhaps I can pay a 3rd party computer shop to do it for me.  Last resort, I can probably do the replacement myself with the proper tools.I recently bought another new laptop (Toshiba) for myself and one of the main checklist items is the built-in wifi card.  Thankfully, it has an Intel card and it's simply amazing!  When I saw a young lady checking a Fit 14 unit intently in a major consumer electronics store, I warned her immediately about the wi-fi issue.  Of all laptop functions that may not work well, this is totally unacceptable!Perhaps one of the most stupid opinions I heard about this issue is from a Sony Store staff who said that the wi-fi issue is probably attributable to the low-power CPUs of the newer models (but then I have already tried disabling all power saving settings of the Fit 14 and the wi-fi card itself). And he further explained that he wasn't surprised at all that a 3-year old Vaio (my daughter's older laptop) running on i3 is faster than current gen Vaio i5s or i7s in terms of wi-fi.  What???Could have been 5 stars if not for this serious defect.  Looks so sleek!", "Date": "October 4, 2013"}, {"Title": "Wireless is useless", "Author": "Miguel Naranjo \"mignargon2\"", "ReviewID": "R3MUV2S4EZ68L4", "Overall": "1.0", "Content": "Computer works terrible in wireless. You need to be next to the router for it to work more or less decently. Away from the router or in public wifi it is useless.A shame for an otherwise nice laptop.", "Date": "October 31, 2013"}, {"Title": "Great laptop", "Author": "Reji Thomas", "ReviewID": "R27639BDHL7H4H", "Overall": "5.0", "Content": "The device is amazing. It is easy to use, very lightweight, and easy transition from Mac and PC Computers. It had easy set-up instructions and I could customize it as well. Overall, two thumbs up!!!!", "Date": "September 9, 2013"}, {"Title": "wi-fi defect", "Author": "GA", "ReviewID": "R1HRIZZY5YQL3E", "Overall": "1.0", "Content": "I had to give it one star in order to post this but it deserves a zero. I bought this at bestbuy and it does have Wi-Fi defect. I have installed every driver known to man including the new ones recommended by Sony. it will not stay connected to the internet. You have to restart the PC to get a reconnection. It is a piece of junk: Buyers beware.", "Date": "September 28, 2013"}, {"Title": "hard drive crashed after 6 months", "Author": "Inga Liu", "ReviewID": "R28HIZ4BL4ZV4V", "Overall": "2.0", "Content": "I had this for around 6 months and the hard drive crashed and I lost all my data. I had to send it back to Sony and they replaced the hard drive, but still, very disappointing considering I spent all that money buying it. It's a bit heavy, and the touchscreen stops working randomly. it's a pretty color, but the outside scratches very easily, and what's the point of getting a pink laptop if you have to put a cover over it??", "Date": "June 2, 2014"}, {"Title": "exelent", "Author": "Mauro Ferreira", "ReviewID": "RW6CILWGKKVM9", "Overall": "5.0", "Content": "I like it... It works quickly and ever sony supports you when you need something...This have high performance and I love it", "Date": "April 25, 2014"}, {"Title": "The usual sony best", "Author": "Vicky Grant", "ReviewID": "RMJAVIOYM5HOM", "Overall": "4.0", "Content": "My only regret is that I didn't get a bit faster model but the look and feel is lovely.  I always defer to sony for the best products around.", "Date": "April 9, 2014"}, {"Title": "Aside from minor gripes-- a solid laptop", "Author": "Jordan Gerblick", "ReviewID": "R17KP4RG0ZMNEG", "Overall": "4.0", "Content": "* I'm writing this to counterbalance some of the one star reviews which were obviously written out of frustration due to the common wifi issue people seem to be having. I don't think the occasional faulty wifi card justifies a one star rating, so here's my attempt at an objective review of the computer as a whole and my experience with it so far.I've owned the computer for a little over 5 months and my overall opinion is positive. It's reliable, consistent, stylish and quick (mine has 6GB of ram and the i5 processor). In regards to the wifi complaints, I can only speak from my experience which has been perfectly satisfactory. I usually get around 3-4 bars when I'm on the furthest end of the house from the router and modem. What this says to me is that the card itself is strong but not consistently reliable from one laptop to another. Lucky draw, I suppose. The picture quality is good, boasting vivid colors and sharp detail with the Vaio's 1600X900 screen resolution.While the 'Fit' series from Vaio is certainly catering to a younger demographic, the even more budget-friendly 'Fit E' series still manages to look and feel like a more expensive machine. The cheaper plastic on the E series repels finger prints and stays clean easily while feeling sturdy and well-constructed. The most noticeable compromise is most certainly the track pad-- it's clunky and unresponsive. The ability to pinch and zoom, along with switch tabs by swiping your finger across the border of the pad is nice, but it just isn't sensitive enough to really prove useful. I find myself having to repeat movements often and the way the cursor responds is choppy and at times, laggy.Every other complaint I'd be able to come up with is with the operating system, Windows 8, rather than the actual computer. It's unfortunate that the product itself is getting weighed down by all of these one star reviews complaining about the operating system or problems related to Amazon like receiving a damaged unit.", "Date": "March 7, 2014"}, {"Title": "Okay Computer, good touchscreen, very bad key pad", "Author": "Susanna", "ReviewID": "R102Q5JZM9DNEO", "Overall": "3.0", "Content": "My wife gave me this as a Christmas present. I have spent a lot of time moving files etc from my 7 year old computer to this one which has given me a lot of time to get used to the new computer. I have noticed that the key pad is very sensitive, to the point of the curser always jumping around. I have not found a way to decrease the sensitivity. The pad is also very large which is causing me fits when I try and click on something. The touch screen is very nice however the jumpy keypad makes working between the touch screen and key pad very difficult. Lastly, the computer came with Windows 8, and as instructed I downloaded 8.1. That was a week ago...things have been going downhill from there. Today, I am on my way to the Sony store near me as the computer will not boot. I says contact Sony Care...(on another computer). I am going to see if they 1.) Can get the computer up and running; 2.) Fix or replace the key pad...if not I think I will return it to Sony and keep looking.UPDATE: I took the computer to the Tysons Corner VA Sony store on Saturday Jan 25. No one called me with any info. I called the store every day and was told the tech isn't in, the tech didn't leave any info about it, I don't know where to find your computer. Today, Wed, Jan 29th I finally got a tech on the line. It seems the hard drive crashed and he ordered a new one. He expects it next week sometime. So Sony will have my \"new\" computer for over ten days, and I will have lost all the data I put on that computer. When I get it back I will be returning it to Amazon for a refund. Shame on Sony, Shame on Amazon for such a defective product and service!", "Date": "January 25, 2014"}, {"Title": "Vaio not recommended", "Author": "andrea", "ReviewID": "RIW03FDFW6T0N", "Overall": "2.0", "Content": "somehow it's not working now. It seems to be the hard drive, can not apply for international warranty... just a  waste of money", "Date": "December 13, 2013"}, {"Title": "Sony Vaio", "Author": "MARIA INES VELA CHERONI", "ReviewID": "R30QHVXNEKQZ61", "Overall": "5.0", "Content": "This is a beautiful laptop with a perfect size and weight.  The characteristics are the best in the market. it's very useful", "Date": "September 9, 2013"}, {"Title": "poor seller!", "Author": "C. Newton \"sixcat\"", "ReviewID": "R38N8JSYAN4HD6", "Overall": "1.0", "Content": "received with screen not touch! had to return not happy to have to wait for another computer!Sony has a great name but the seller didn't sell a working product. i wanted a working computer for the money,  i went with a HP and solid state drive for 200.00 less!", "Date": "October 25, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CFGVJCA"}}