{"Reviews": [{"Title": "Clarification on product description", "Author": "Learning2bdad", "ReviewID": "R30GBXS6JJXBZX", "Overall": "4.0", "Content": "I believe the other reviews have already described how fast and sleek this machine is and the value that you're getting in a laptop that can actually run modern games and do video editing at this price point.  I agree with those sentiments.  However, I felt compelled to give potential buyers some more information regarding the product description.I bought the IdeaPad Y510P - Model Name: 20217.1.  This model does come with two NVIDIA 750M video cards in SLI configuration.2.  The 1 TB 5400 RPM hard drive is partitioned into 2 drives.  One primary one and a smaller 24gb partition for Lenovo's system backup.3.  This model does NOT come with an on board SSD hard drive to cache windows.  I was curious if I could simply buy a small mSata hard drive and install it myself to speed up windows a bit.  Upon opening the case, the area where the mSata SSD is supposed to go does NOT contain a connector to plug in an aftermarket mSata drive.  The mSata connector/adapter is not soldered onto the board for this model.  I'm assuming this is to cut costs.  I don't know anything about soldering components to a motherboard so I will eventually replace the 1 TB mechanical hard drive with either the next generation hybrid drive or a SSD for a smoother and faster computing experience.No regrets on buying this machine.  I am happy with the purchase.  I just wanted to let potential buyers know what they're getting since the various reviews and product descriptions were a bit unclear if this notebook had a SSD and/or a 2nd video card in SLI or not.I hope you find this helpful in your laptop buying experience.", "Date": "August 7, 2013"}, {"Title": "Strange Shipments of the Y510P", "Author": "TheNearEnd", "ReviewID": "R3RQXWF0FAGQJ7", "Overall": "5.0", "Content": "This laptop is labeled without an SSD however, the one I ordered came with a 24gb SSD loaded with the laptop drivers. along with 1TB HDD 5400RPMAlso, The SLI was included making this laptop an extremely good deal at this price. (I was worried at first, the wording is vague)1x8gb of ram DDR3 were included as statedUpdate:This thing is blazing fast. At first I was slightly dissapointed with the SLI performance. But after i updated the video drivers through the NVIDIA website, I was getting 30-40% better fpsSkyrim with 22 graphic enhancing mods and ultra video settings -> 60fpsRift Ultra settings -> 60fpsBioshock infinite ultra settings with a few high tweaks due to some broken features -> 55fps", "Date": "July 30, 2013"}, {"Title": "wifi card defective", "Author": "K. Otto", "ReviewID": "RUUV7X2NRIDYG", "Overall": "2.0", "Content": "I bought this laptop for my son who is starting college. The wifi connects only intermittently. After reading other posts on the companies forum, it appears this is a common problem for which there is no easy fix.", "Date": "August 31, 2013"}, {"Title": "Great laptop but defective WiFi card", "Author": "ACKeith", "ReviewID": "R35188UYGXCQWM", "Overall": "2.0", "Content": "I had this laptop for about a week before I was forced to return it. This thing is a beast for a great price and I was so excited to use it but after a few days the internet started to randomly drop and I had to keep reconnecting. I tried everything imaginable to fix it, from making sure the drivers were up to date to reformatting the hard drive and everything in between.There is apparently an issue with this laptops WiFi card according to others who have had similar problems on the Lenovo forums. Their remedy is basically to make sure the drivers are up to date, which I did. It is also apparently impossible or very hard to install another wireless card because of the way the laptop is set up.I really wanted to keep this laptop but because part of the main reason I bought it was to use for an upcoming deployment, I can't take the chance that the wireless issues will work themselves out with a future fix and risk losing communication with my family for an extended period of time.Overall, this would have been an excellent laptop for the price if not for the issues that I came across with the WiFi card.", "Date": "August 13, 2013"}, {"Title": "Don't Buy This Laptop", "Author": "miketkong", "ReviewID": "R1XR85J83DDC8V", "Overall": "1.0", "Content": "As someone that relies heavily on being able to connect to the internet, this laptop is a huge pain and a major obstacle to productivity as it disconnects me from networks every few minutes. This is straight out of the box, brand new. The problem is well documented by users of the machine while it is not acknowledged by Lenovo (search y510p connection problems). I've spent hours troubleshooting the network settings for the settings on the laptop such as the drivers for both the wireless network card (Intel wireless N2230) as well as the Operating System drivers as well as the network itself, from the wireless router to the modem, to the settings and drivers for each network component and this laptop remains the only device on the network that can't maintain a connection out of an Apple Air, multiple iPhones and iPads, PS3, Wii, wireless printer, etc. You'd think that when you buy something brand new it would work--at least be able to connect and stay connected to the internet--assuming that you had a stable connection to begin with (which I do), but that's not the case. A quick Google search for y510p connection problems will show you that I'm not the only one--and to be honest, I wouldn't want to use this laptop even if it was free because of the connectivity issues. This problem makes using it a frustrating headache. I wanted to like it, I tried to like it, I thought that my experience with computer software and hardware would allow me to fix it even though it shouldn't have been broken in the first place, but after almost 3 months of using it I feel compelled to warn potential buyers of this connectivity issue because they deserve better. Buy something that works. Unless you don't want to. The choice is yours.", "Date": "November 12, 2013"}, {"Title": "Good, powerful laptop, but...", "Author": "Girolamo \"Cyclist, Driver, Rocker\"", "ReviewID": "RAK0O0189KEBE", "Overall": "4.0", "Content": "I've had this for a month now, having bought it on the Lenovo site.  Mine has the dual graphics card setup, and no DVD drive.  Can't say that I miss the drive, and there are cheap USB-based DVD drives available should I need one for a software install.The processor kicks butt; faster than my quad-core i7 desktop unit from last year on math problems (1 million point matrix inversion using LAPACK).  The screen is very nice--on a par with my three year old Macbook Pro.  One thing that this computer isn't is portable.  It is thick, heavy, and the screen has a border of about an inch of cheezy plastic around it that not only takes up room, but detracts from the otherwise clean, functional look of this laptop.  Were that the only thing wrong with it, I would probably still give it 5 stars.  The touchpad is a disaster--don't even think about using it for more than setup of the computer.  You get random crawling of the cursor across the screen, impossible-to-make double clicks because the cursor moves every time you hit the buttons (left or right), and no amount of driver rollback or sensitivity adjustment in the Elan software will make it go away.  Just get a mouse and live with it.And then there's the power brick.  Computing power like this comes at the price of a 3 pound power supply the size of a brick.  You can do curls with it for your morning workout in the hotel, but then you probably won't be traveling with this computer much, given the size of it.  It doesn't fit in my 15\" Targus laptop bag because it is too wide and thick.Other problems, like the wireless and the Windows 8 Metro user interface, can be dealt with by driver rollbacks and doctoring of the OS.  I'd rather not have Win8 on this computer (it isn't a touchscreen after all) and will probably do away with it in the future. Hopefully by then it will have a better touchpad driver to make it a real laptop.To summarize:  If raw computing power is important to you, give this a look.  Then decide if the heft and the inconsistent aesthetics bother you.  The touchpad is a total loss--but easily worked around.", "Date": "October 12, 2013"}, {"Title": "A great gaming laptop for the price", "Author": "Tommy", "ReviewID": "R1AEKHRA0I2M26", "Overall": "4.0", "Content": "SetupY510P 750M SLI config 8GB Ram 250GB intel extreme SSDSummaryPros:Dual 750M'sstylish design, red backlighting.Great keybaord and screen.Not too bad on weightSpeakers are awesome.Cons:Front edge on the laptop feels sharp.With SLI there can be problems.THE CPU NOT ACTIVATING TURBO BOOST (biggest con if you couldn't tell ).Attracts fringerprints.Does not come with a NGFF connector if you do not get the ssd cache(NGFF is the newer form of MSATA) If you want this get the laptop with an SSD cache.Experience with laptops.I buy and refurbish laptops of all kinds. I am coming from an M17x r4 gaming laptop with a 7970m.I downgraded to this laptop as I never fully utilized the power of my 7970M as I really only play league of legends on my computer but I do alot of CPU intensive programs.The laptop looks really nice and the keyboard is very nice with a spring behind every key, almost the feel of a mechanical keyboard. The sharp edges on the casing are noticable on the wrists when typing and playing games, this is my biggest flaw with the laptop.The laptop came with an amazinly bright Matte screen which blew me away with the quality for the price.The red backlighting is nice although I sometimes miss being able to change the color like on my M17x.The speakers are very clear and crisp I was very impressed with them.The exterior design is a nice carbon fiber like look with a nice looking lid with slight jet style curves on the top IE ASUS ROG. The lapop is a fingerprint and oil magnet.The trackpad that everyone hates, I do not see any issues with it. Yes you must be use to the windows 8 gestures to like it but when you are it is great. I like it much more than my Alienware's trackpad.Performance.The laptop performs wonderfully in all day to day tasks. Even without the SSD boot-up time was still acceptable. During CPU intensive programs like compiling and running Verilog programs through large test cases I am noticing the CPU is throttling back down to the 2.2GHZ instead of using the turbo boost feature it comes with. This is very dissapointing.The graphics setup allows for most games to play nicely, the SLI 750's are very nice but with SLI there can be problems I have had some freezing but it is during the burn in of the graphics card. It has not happened in the last 2 nights of playing games which is a plus. Some programs do not recognize the dual 750's and run with only one gfx card.3dMark is not recognizing the dual 750's and is giving me a score of 2200 for one card, I am updating to a newer beta driver now to see if this fixes the issue.Edit: After updating the drivers it still did not work but upon further investigation SLI was turned off in the nvidia control panel after fixed i get over P4000 in Passmark and great gaming performance.Battery life I can not account for as it has been plugged in as the dual cards only work when plugged in. You have to keep in mind this is a gaming laptop which means battery life will not be as good as an ultrabook or even a standard laptop as it has to run the 750M and this laptop does not have optimus to save battery.HeatHonestly the laptop runs much cooler than my alienware even though it hss two graphics cards. The laptop is always kept on a notebook cooler though just because i play on my lap and want the fans propped up. The cooler is not always plugged in becasue I feel it is not as needed as it was before.I am happy with the laptop and will hopefully fix the 3dMark issues with driver updates.", "Date": "August 10, 2013"}, {"Title": "What a beast!", "Author": "Sergio", "ReviewID": "R3W2VNE93WQNUU", "Overall": "5.0", "Content": "I ordered this laptop directly from Amazon on Thursday the 8th, and I received it on Saturday the 10th.  As others have pointed out, the description is different from what I got, but in  good way as I got the version with 1080p screen rather than the 720p screen specified here. And yes it does have dual graphics.  No SSD drive though.Out of the box, the Windows rating were as follows:Processor 7.6Memory 7.8Graphics 7.5 and 7.5Disk 5.9.Before I received the laptop though I ordered a OCZ Agility 4 256GB solid state drive.  Getting the laptop open and replacing the HDD with the SSD itself was a breeze, however the issue was reloading the OS on the new drive.  The problem is that you can't create recovery media like you would with HP or Dell or any other brand computer, you actually have to call Lenovo tech support and order recovery media.  While the built-in backup/recovery software is decent, it is useless for hard drive to hard drive transfers. Now I didn't want to call Lenovo tech support and pay whatever they wanted for the recovery media and get it in a week, and then having to go out and buy a DVD drive, that would've been my last resort.  Luckily I found a Windows 8 Standard iso (not a cracked or illegal version, just the iso) and used the trial version of PowerISO to create a bootable USB.  Then all I had to do was plug the USB drive in and boot from it, then followed the Windows 8 install prompts.  Since the Windows key is built into the bios, it automatically activated it.  If you try to use Windows 8 Pro here, it will warn you that the key is not compatible with this version, and you don't get the option to put in the Pro key, so if you are thinking of replacing the HDD with an SSD, first you must use a Windows 8 Standard disc/USB and then later upgrade to Pro.  I'm planning on doing that since I already have a Pro key.Now most of the important drivers automatically get installed here, but you still have to go to the Lenovo website to get some of the other drivers and software if you need.  I also recommend going to NVIDIA's website to get the latest driver, even though on the NVIDIA website they recommend getting it off Lenovo's website.Now that I have a fresh clean install of Windows on an SSD without all the bloatware, the laptop boots up in less than 10 seconds.  And the Windows rating has even seen a boost:Processor 7.9Memory 7.9Graphics 7.5 and 7.5Disk 7.6Hope this review was helpful to anyone thinking about purchasing this and upgrading the hard drive, which I highly recommend anyone buying this laptop does.  The mechanical hard drive really bogs this beast of a computer down.", "Date": "August 12, 2013"}, {"Title": "Best Multimedia Laptop at the $1000 price", "Author": "Anonymous", "ReviewID": "R1BEYVYEG7BAQ1", "Overall": "5.0", "Content": "So I've used the model sold by Amazon for a few days and have had a great experience with it. The description of the product is confusing; this is a model with a 1080p screen, dual SLI 750m configuration, 1TB hard drive (a little under 900gb useable), 8gb RAM, and no SSD cache.Pros:*The 1080p anti-glare screen actually does its job. Could not ask more from a laptop screen. Bright and vivid.*The keyboard is of a very nice quality, and the backlighting is a neat feature.*The sound is the best I've heard from a laptop.*The SLI 750m configuration will blow past most modern games at 1080p and at high/ultra settings. (BF3 runs at a solid 45fps if you turn shadows down to high and MSAA down a notch)*Speedy and responsive setup, Windows 8 is great if you take the time to get used to it. Boots in under 25 seconds (and this is without the SSD cache available in higher end models).Neutral/Things to Consider:*The edges are sharp; this could be a problem for prolonged periods if you type with your hands at a certain angle.*WiFI is spotty, but updating the drivers from Lenovo's website fixes the issue. Also, make sure to update the NVIDIA drivers and download the GeForce Experience program to maximize performance from games.Cons:*The trackpad isn't all that great. Useable, but not upto the standard of the rest of the build.If you're looking at a multimedia/gaming laptop under $1300, this is your machine. Feel free to post any questions in the comments.", "Date": "August 4, 2013"}, {"Title": "Quite Impressed", "Author": "JG", "ReviewID": "R2VV7R97WP1XHQ", "Overall": "5.0", "Content": "I have had my Lenovo y510p for 8 months now and I am so far very pleased with it. There are some discrepancies in the description versus what I bought, but the only differences are that my machine was $999 and came with a 1080p screen. I had been watching the deals on the y510p all last summer and snagged one up when I saw a good price.Pros: GORGEOUS screen (I get comments all the time from jealous friends on how nice, sharp, and bright it is), soft keys (makes typing papers a breeze), and an all around fast machine.Cons: Finger print magnet and poor trackpad. The case really does attract quite a few finger prints, but they come off quite easily with a soft cloth (I just use a cloth meant for eyeglasses and it works well). The trackpad is really lackluster, but I mainly use a mouse with the computer so it doesn't both me much, but if you mainly use a trackpad you might want to invest in something else.I would highly recommend this computer. I use my computer very frequently, mainly for school and gaming, and this fits the bill. It has no problem running most games in the upper-quality settings. I don't play too intense games, but it lets me play LoL and Skyrim on max settings without a problem. Running 10+ tabs on a browser, iTunes, MS Word, and a slew of Adobe programs under load all at once and it never bats and eye. I use the always-on usb port more than I thought I would and it has turned out to be a nice extra feature. The speakers also are very nice for a laptop, although I do mainly use a standalone set of speakers. I would highly recommend this machine. The performance you get for the price is well worth the money.", "Date": "May 6, 2014"}, {"Title": "Awesome performace!", "Author": "Juan Carlos Rojas", "ReviewID": "R2B6QEJKFB4X9D", "Overall": "5.0", "Content": "For the price, this laptop has an outstanding performance; also i didn't expect such good sound.Performance / Price = Unbelievable.By the way , just a tip: Cuz the Sli config, optimus is disabled by default; however you can activate it by removing the second video card (remove it, do not just disable it) and install intel vga drivers located at D:Definitively i love this purchase.", "Date": "September 9, 2013"}, {"Title": "Best laptop for the money on planet right now,", "Author": "Cesar Alcantara", "ReviewID": "R3TIGDUJH902CT", "Overall": "5.0", "Content": "got this laptop, tweak the sli a little bit, get better performance than gtx770m, it does not not overheat so much, only downside is batery life and touchpad, anyway you need to be plug in to play intense games and i always use mouse or gamepad to play, so no downside for me <3", "Date": "August 26, 2013"}, {"Title": "Great laptop", "Author": "Justin", "ReviewID": "R1I394KYF6QLLR", "Overall": "4.0", "Content": "This is a great laptop but the mouse pad is HORRIBLE.  Randomly goes places and pulls up windows in Windows 8 that I didn't want up.  If you use a normal mouse all the time, it would be a perfect laptop.  If the mouse pad was way better, there wouldn't be many better laptops for this price.  Plays most games at high settings and runs them beautifully.", "Date": "August 15, 2013"}, {"Title": "Terrible customer service", "Author": "Blanca Erben", "ReviewID": "R2XZR4YZZGID2H", "Overall": "1.0", "Content": "This wasn't a bad laptop or anything but as soon as I got it I immediately had trouble connecting to the internet on it so I called their customer service and 2 of the 3 guys I talked to were complete jerks and blew off my questions. It was a brand new laptop that I payed a lot of money for and all I wanted was for it to work properly but for them to help me it would cost like $80 for them to help me this one time. So if I had trouble in the future.. Well.. Another $80.. Overall it's been a terrible experience and a complete waste of time. And also this laptop comes with windows 8 which is the worse. I suggest looking to another company for a laptop.", "Date": "September 24, 2013"}, {"Title": "IdeaPad UltraBay is a farce", "Author": "R. Wagner \"wagnerism\"", "ReviewID": "R2P5NXWD20SR6B", "Overall": "3.0", "Content": "If you buy an SLI unit, you cannot buy any optical drive from Lenovo - not even the ones that are included in non-SLI models.You can buy the SLI graphics adapter UltraBay module, but the Lenovo forums say that it is far from a convenient simple plug-and-play swap.You can't even buy the plastic rails and bezel where you could supply your own 9.5mm high SATA optical drive.The forums say that Lenovo was promising this UltraBay optical drive sales support since the Y500 came out, but that never materialized.I believe that Lenovo will further abandon this model soon because the Y40/Y50 models should be coming out soon, and they have no UltraBay.  The release date for the Y50 is currently showing the same trustworthiness as the UltraBay support.Sadly, this has nothing to do with the actual performance of the product.  It has everything to do with manufacturing support of a current laptop line", "Date": "March 22, 2014"}, {"Title": "Nice gaming computer", "Author": "Donna", "ReviewID": "R3EWVKVDHK5YS0", "Overall": "4.0", "Content": "Excellent computer but I overlooked that it was lacking in a CD-rom drive so I have to knock off a star for that though it matters less and less as we use USB ports (it has 3) instead more and more.  It's also Windows 8 and I'm finding I utterly hate Windows 8 but that's not the computer's fault.  I'm a gamer and the video card is excellent.  I'm not getting any lag or drag or glitching on any games, even an MMO which I am addicted to and got lag on my previous computer.  If you're an on-line gamer, you'll love the video card.", "Date": "November 23, 2013"}, {"Title": "Full feature set laptop if not for HDD but easy to fix", "Author": "Nicholas Andrei Barbovitch", "ReviewID": "RW7GA56K5KW9L", "Overall": "5.0", "Content": "Pros:Dual 750mFull hd screenSpeakers are very niceCons:I swapped out HDD for SSD to complete the laptopPaid more than I wanted", "Date": "October 27, 2013"}, {"Title": "best computer I've had in years", "Author": "Mom of two", "ReviewID": "R38UNZBHKBSW44", "Overall": "5.0", "Content": "I bought this for my son and husband to use. To quote my son:  Does everything I've asked of it. Fantastic gaming computer, incredible battery life. My husband had some difficulty with Windows 8 being. compatible with other software when first setting up but these problems were mostly resolved. Both are extremely happy with this laptop, especially the cooling system.", "Date": "October 2, 2013"}, {"Title": "ok", "Author": "Johny", "ReviewID": "R2W723A036N42F", "Overall": "5.0", "Content": "I think that's good and I love it very much and the box is very beautiful and strong,so thats all", "Date": "September 15, 2013"}, {"Title": "nice", "Author": "Frank  Geng", "ReviewID": "RPDJ7WCH4F1S9", "Overall": "5.0", "Content": "this laptop is very cool,nice screen ,nice keyboard,nice graphics card，yes，it is very sharp，and easy to ues.i must to talk 20 words???", "Date": "September 12, 2013"}, {"Title": "Good for the price.", "Author": "Will", "ReviewID": "RQZJCDLQAWVIA", "Overall": "4.0", "Content": "I have had my Lenovo IdeaPad for a little over a month so far and have really enjoyed it.  It's certainly not a powerhouse machine, but it's more than capable of running most games and certainly top of it's class in the price range.I'm still getting used to Windows 8 though. If you have the option, go with Windows 7 for now.", "Date": "September 8, 2013"}, {"Title": "Better than expected for $999 in August '13", "Author": "movielurking", "ReviewID": "R2H4HQCRYRO0VW", "Overall": "4.0", "Content": "Arrived with dual 750 video cards as expected. Recieved 1920 res screen instead of 1368. Thats usually $150 more on Lenovo's site. Rec'd built in HD camera (dont care but it said it wouldnt have it) Too bad it has Windows 8, I dont like it. They should have the MAC address listed on the box. It tries to set up wireless but failed for me without it. I had to go back in and it took a while. It came with loaded trialware which was promptly removed. I Loaded Norton 360 with no hiccups. Fingerprints show if you care, I dont. It does not have SSD or a hybrid hard drive. No DVD or CD. You can buy an external Bluray DVDrw/ CDrw for $68 with great reviews if you search. I have not found Ultrabay fans or drives from Lenovo. If I had, I would have given 5 stars. Someday they'll be out. This machine boots fast and has increadible video. Thats what I bought it for. I plan to upgrade the RAM to 16g. Thats about it. I was charged tax but thats OK. Free shipping and it arrived two days earlier than the earliest date promised.", "Date": "August 19, 2013"}, {"Title": "For Those Who Don't", "Author": "Spencer S.", "ReviewID": "R3UYP9V8RXTYZT", "Overall": "1.0", "Content": "So I posted this on Lenovo's page after my experience with their on-site tech today. I'm going to just keep posting this everywhere I can find.Lenovo; For Those Who Don't:January 23rd I received the IdeaPad Y510p from Lenovo, and it ran like a dream for 13 days, then I go to take my dog outside and put my laptop in sleep mode and come back in and it won't turn back on. I called in and had the option to return/refund it or repair it. I went with repair in hopes of being able to keep my data and awaited the box that tech support said I would be receiving in 3-5 days...It's the motherboard that needs replaced; power light turns on but the fans, hard drive, keyboard lights, screen, and even USB power are unresponsive. A $1,649 paperweight.20 days later I call back, having been busy with two jobs in Advertising, furious. I found out that it was never sent out and that it was just kind of forgot about. So you kindly \"escalated\" the repair to an on-site request after you said it would take almost twenty days for a repair and I would still have to wait, that you thought I was sending it in a second time for a second repair, and that you said I couldn't refund it until I told you I talked to a Sales Manager and they said I could and you looked into my history and found I actually did talk to someone and I could due to the situation.Well that on-site guy THAT YOU SENT OUT came today and broke the laptop even more. He lost one screw when taking it apart, forgot to put two screws back in, broke the bottom latch/lock for the laptop, part of the frame (a little plastic clip on the inside but it looks warped now) and was banging the laptop, jabbing it with his plastic tool, and kept saying \"I sure hope I don't broke it, don't wanna do that!\" I took pictures and cringed the whole time. I about had a stroke watching this guy \"try and not break\" my laptop. AND IT'S STILL NOT FIXED. It's just been sitting on my desk since I got it.This is a work laptop.I not only make money on this laptop, I spend money on it monthly for my software.I make $18 an hour at the job I got this for, and it has cut back my time there drastically. I can't work there I can only work from home. I was averaging about 3-5 hours a day until the laptop broke. Now I get less because my home computer isn't meant for this work.The software is $20 a month that I can't use.My freelance pays $30-$60 an hour just for design fees.I've lost more money because of this laptop possibly than for what it's even worth.You better get back to me soon.You have my case number.You have my name, phone number, and email.If Lenovo is for \"Those Who Do\" then what you need to DO is start making up for what you DON'T DO.So do something right for once and call me.This laptop has not only cost me time and money, but now it's cost me my patience.", "Date": "March 3, 2014"}, {"Title": "Warning:  May not be full HD 1080p", "Author": "Brian \"reviewer\"", "ReviewID": "R266D4QD8F0LJ9", "Overall": "1.0", "Content": "Noticed in the technical specs this is listed as having a resolution of Full HD 1080p 1920 x 1080 .. However, the model number is listed as 59369999, which is NOT 1080p, but rather 13366x768.  I would be very cautious in purchasing this laptop and make sure you are getting the Full HD one, as it cannot be model 59369999.", "Date": "September 20, 2013"}, {"Title": "the l510p", "Author": "Thomas Feldmeier", "ReviewID": "R2JXX7YYDSYFVX", "Overall": "4.0", "Content": "yayyy i can write my own review now of the system. i just got it today and am very excited to be using this computer. although my old computer wasnt old or bad, it was getting kind of slow and couldnt handle the games and loaded pretty slow. i would say the screen quality of this computer matches and exceeds (looks the same but lets say it exceeds since its 13\" vs 16\") my sony s series (my old computer). i still dont know which version i received though i did get dual graphics since i can clearly see another graphics card where the ultrabay port is. i havent used the computer enough to say more but ill edit my post later. also...it said my computer wouldnt ship until tomorrow(the 8th). shipped a week early due to new stock and got to me still ahead of schedule (estimated date of arrival was for the 9th).reasons for 4/5 DESPITE the fact that this truly is a 5/5 computer:1)i really hate windows 8 (nothing toward windows 8 or this computer...i just like windows 7 since im more used to it2) the mouse pad on the computer is weird since its a complete touch screen  with no physical keys (cuz whenever u try to click down on the area where the left click physically should be, u might accidentally move ur cursor)3)as i kept typing this review...the edges of the computer are kind of sharp and its hurting my hand :(  (though external keyboard will help...which i will use after this review :P)", "Date": "August 7, 2013"}, {"Title": "Technical Details are incorrect (No SSD and not Full HD)", "Author": "Felipe A. Silva", "ReviewID": "R2ZFE9JTRMKJGP", "Overall": "1.0", "Content": "This model of this Laptop is 59369999.It doesn't have the 24 Gb SSD and the display is not Full HD as it is announced.Be aware that the description is wrong.I strongly recommend you to look for another seller. Unfortunately, I am on US for a short period and wont have time to return the product.", "Date": "October 22, 2013"}, {"Title": "didnt even arrive", "Author": "Gustav Kiik", "ReviewID": "R1C6B79VSM2NWH", "Overall": "1.0", "Content": "placed the order on 26th of august and on 15th of september i received an e-mail saying the item was refunded with an explanation \"customer return\". I didnt even receive the item...Although i got my money back i noticed that 25euros had been deducted. Meaning i paid 25euros for nothing..", "Date": "September 19, 2013"}, {"Title": "the worst customer service", "Author": "Bryan Cain", "ReviewID": "R1SVPF8DTSD29E", "Overall": "1.0", "Content": "Lets be clear, I do not have this laptop.  I ordered it on 11/13 and cancelled it on 11/13 to order a better machine from Lenovo.  Despite cancelling the order and re-ordering a new one, they still shipped the cancelled order on the 11/18.  On 11/18 I called and cancelled the order - again AND had the laptop rerouted back to their warehouse.  They had already billed my credit card for the cancelled order and would not credit my account till they received it back.  On 11/22, it was still in transit (to me) so I called again.  Same story, they will reroute and do credit when the laptop returns to their warehouse - even though they will not process a reroute...  11/25: First attempted delivery to my house... reroute still not done, credit still not done and the second machine I order was also cancelled.  Now I have no laptop and an $800 bill on my credit card that they will still not credit despite numerous calls and even involving my credit card company on the phone with their supervisors.Purchase At Your Own Risk.", "Date": "November 26, 2013"}, {"Title": "Worst pc/laptop ever owned", "Author": "Christopher J. Smith", "ReviewID": "R2ASKXY70W18QZ", "Overall": "1.0", "Content": "Spent a $1000 bucks on this pos and I will explain why it is junk.First of all you turn on the laptop and expect it to load rather fast but takes about 3 minutes to get to the windows 8 screen when I have nothing on my computer but what came on it.After this you realize you got no cd drive so you're stuck with windows 8 unfortunately.You realize windows 8 is a pile of junk and when I try to play Tera which I bought this for realize it isn't allowing me to login to the game....Also realized that on sli this on the battery last about a hour when surfing the net.So all in all this comouter was a big waste of money and probably won't ever pay 1k for \"gaming laptop\" again.This laptop has to be plugged into a wall or goes dead instantly and even when it was turned off I would turn it on the next day to find the battery already dead after being fully charged when i turned it off.This is junk and I'm rather disappointed in this laptop buy at your own risk.I don't even write reviews but this laptop pissed me off so much I had too.", "Date": "September 21, 2013"}, {"Title": "no  dvd", "Author": "Takashi Tamasu", "ReviewID": "RXC6ZMRVKZGA5", "Overall": "1.0", "Content": "I returned it ... it had no dvd drive and at th Lenovo site an identical system had one.  at about the  same price (a bit cheaper because of  a sale", "Date": "August 23, 2013"}], "ProductInfo": {"Price": "$1,099.99", "Features": "Core i7-4700MQ 2.4 GHz (6 MB Cache)\n1366 x 768 Display, 8 GB DDR3\n1000 GB 5400 rpm Hard Drive\n15.6-Inch Screen, NVIDIA GeForce GT750M GDDR5 2GB", "Name": "Lenovo IdeaPad Y510p 15.6-Inch Laptop (Metal - Dusk Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41-y5AUm8xL._SX300_.jpg", "ProductID": "B00CRXZSYQ"}}