{"Reviews": [{"Title": "I'm impressed for the most part.", "Author": "shubhangi dhodapkar", "ReviewID": "R2TRH724ZC10Q9", "Overall": "4.0", "Content": "This laptop isn't bad at all for the price. I bought this for college use and it will do that fairly well because of how thin and light it is. I was surprised that it  even had a light up keyboard even when being so thin. The touchscreen couldn't be better, it's fluid and responsive. As for the CPU and GPU, before I get into that I'll say that my main computer before this was a custom built desktop with a AMD FX-4100 unlocked processor and an AMD Radeon HD 7770 as well as 8GB of RAM. The processor is clocked to 4.2GHz, and yet somehow, I prefer this laptop's AMD A10 CPU over the FX-4100. Both run the same Windows 8 OS, and yet, copying 12GB of data on the laptop took around 5 minutes, while doing the same on the desktop took more than twice that amount. There are many more situations where the A10 stood out against an overclocked FX chip. The A10 also comes with a built in GPU, as a competitor to Intel's HD Graphics 4000, and I must say, AMD has won this competition. The graphics is better than the graphics on my year old Dell XPS L502X, which is a big heavy laptop and was intended for performance, it came with an i7 and a Nvidia GeForce 525M. Some games like Syndicate do lag a lot even on lowest settings, but other games like Just Cause 2 and even Sniper Ghost Warrior 2 will be PLAYABLE at the highest possible settings. By playable I mean yes there will be a lower FPS, but it'll be high enough to play. Decrease the graphics settings a bit and both games play lag-less and with great graphics.There is one issue when it comes to the hardware. I find the touchpad to be ridiculously annoying to use as it's not very accurate.The overall feel of the product seems very plastic-y and I expected a better feel for a laptop at this price. But then again, the materials used for it is the reason why it's not so heavy. Also the webcam quality sucks. It could have been way better. But I rarely use it so it doesn't bother me.All in all I really like this laptop, but it did take some time to get used to it. People complained about the keyboard but for me it's just fine. It's a bit cramped but I can still type on it pretty fast. And as for the touchpad, you won't want to use it when you have such a great touchscreen. I recommend this laptop to everyone, regardless of whether you want a laptop for gaming, work, or entertainment. The speakers on it are tiny but they're loud and sound great with the surround sound option so watching movies on it is a pleasure as well. I bought this laptop with high expectations and in most aspects, this laptop surpassed those expectations.", "Date": "August 16, 2013"}, {"Title": "The Quicker, Not Thicker, Game it Upper.", "Author": "Jerod Lytton \"TechCineFoodie\"", "ReviewID": "R2F3LV2LML5813", "Overall": "5.0", "Content": "Everything I was looking for but one thing was included with this laptop.PROS- Powerful enough to run anything I need- Enough memory to run anything I need (with upgrade possble)- Video Card can run all the current games on acceptable settings.- DOES have a backlit keyboard- Touchscreen is responsive and a joy to use with Windows 8 (otherwise I would never have 8 on a system I own.)- Lightweight and screen is crisp, clear, and performs well.- The features included with the price paid makes it a great value in my opinion.- 1TB HDD, enough storage for plenty of games and apps- able to push it to over 3GHZ as oppsed to the 2.5GHZ standard setting, great for ramping up a few more FPS while gaming, and back down when just surfing.- The Dolby sound that comes out of it is great. Crisp, clear, and impressive for such a small unit.CONS- no optical drive, I knew this going in so not a negative, anything this thin and light will not have one- Windows 8 is much more of a joy to use with a touchscreen as it was intended, but it still has annoying features that I find more of a hinderance than a positive.- would have like to of seen more USB connections on it.For the money, this is a great desktop replacement to take with you on the go for gaming, working, or watching media. I recommend this to any gamer or businessmen looking for something to fulfill multiple roles with bonus features to satisy the nerd in you.", "Date": "December 11, 2013"}, {"Title": "It Has What I Was Looking For!", "Author": "J Swink", "ReviewID": "R3KWFZVF8YWLVK", "Overall": "4.0", "Content": "If you are looking for a laptop that is fast, plenty of Hard Drive, USB ports, HDMI connector to hook to your TV, then this one may be one for you.  I wanted speed, large hard drive, but the one thing I did forget to check was the CD Reader/Writer.  It doesn't come with a CD Reader/Writer, but I ordered a external CD writer from Amazon for $28.  Since I don't use CD that much, not a big deal to me.", "Date": "August 19, 2013"}, {"Title": "HUGE DEAL LOVE IT", "Author": "GrannyGoodWitch \"NanBell\"", "ReviewID": "R16KX6GU5KX12C", "Overall": "5.0", "Content": "I can't say enough about this laptop.  Is it the BEST out there, the GREATEST, FASTEST, ETC? Maybe not but it is super fast with the AMD A10 chip, it's a QuadCore, have an enormous hard drive and a great TOUCH SCREEN,  More than this 70 yr old granny will ever need. I am a  X Microsoft Solution Developer so I know technology and I'm telling you you won't be sorry you bought this one.  It had MORE BANG FOR THE BUCK, believe me I did my research.", "Date": "February 21, 2014"}, {"Title": "great laptop", "Author": "Frank Lasala", "ReviewID": "ROFRYYV2ZJ033", "Overall": "5.0", "Content": "Upgraded software to 8.1and the drivers.  Playing Thief and Battlefield 4 no problem. I love the lighted key board and touch screen. I didn't think I would use the touch screen but I find it easy to use in bed or on the couch.  I have not one negative thing to say.", "Date": "March 7, 2014"}, {"Title": "Super powerful laptop, especially at the price!", "Author": "Marc", "ReviewID": "R1XJP7YQ53W1Y0", "Overall": "5.0", "Content": "Great laptop, does everything we ask of it, including running a small business and doing design work. Windows 8 takes a while to get used to, and tutorials aren't immediately obvious, but the system works well.Super pleased with the purchase!", "Date": "January 9, 2014"}, {"Title": "I love this laptop", "Author": "Christian Melgarejo", "ReviewID": "R1BCL2L2AP6FJM", "Overall": "5.0", "Content": "This is the laptop I'm writing this review on, and so far it is GREAT! Superb performance in any task, and it's great for gaming, not extreme but all newer games work in medium-low which is good, I hope this one sticks around with me a long time :)", "Date": "January 3, 2014"}, {"Title": "top notch Machine", "Author": "casey Barnett", "ReviewID": "R209QLAXZYTWE6", "Overall": "5.0", "Content": "has all the bell and whistles of any laptop out there. I researched the laptops out there and this one with the AMD 10 quad processor and 8gb ram was the best price for a machine like this with touchscreen in this price range. great bang for your buck!The machine has a metallic shell and you feel the sturdiness of it when you hold it.", "Date": "August 18, 2013"}, {"Title": "lightweight and powerful", "Author": "Amazon Customer", "ReviewID": "R109LP4IBHWJW2", "Overall": "4.0", "Content": "Good processor speed, lots of RAM and huge hard drive.  This is a widescreen layout, so you get a dedicated numeric pad, but you will be typing \"left of center\" if you hold it on your lap.  The laptop is very lightweight, partly because it has no internal optical drive.  The backlit keyboard is a nice feature for dimly lit areas.  Screen resolution is very sharp.  The touchscreen is very responsive, but I've had problems with the browsers and web pages not responding appropriately.  For example, trying to close a pagetab by touching the \"X\", or trying to display the contents of a dropdown list by clicking the arrow.  Often it takes two or more touches (or I give up and use the mouse). The brushed metal looking case (actually hard plastic) feels sturdy.", "Date": "September 10, 2013"}, {"Title": "I like it, but....", "Author": "Just Me", "ReviewID": "R4QOEA1R6COTX", "Overall": "4.0", "Content": "I love the form factor.Wish it had flip / tent or fold over screenkeypad is very light to the touch and is backlit!A big plus for those of us who prefer to work in the dark.I spend too much time looking at a computer screen to have the brightness turned up to compete with the house lights.I was expecting fast but the large drive is very slow and takes away a lot from the whole.Drive upgrade is not easy from what I read.But with an SSD upgrade i expect I will be very happy.The touch pad is fussy and a learning curve (where are the buttons?) but I don't care.I use wireless a Logitech roller ball and the touch screen.Don't try updating the drivers for the touch pad (and other) it will only make things worse.if you did there are key combos to release it when it locks up.Remove all the bloatware/virusware and it will go a bit faster and you wont feel like you are being attacked with popups.Sound is very very niceWindows 8 not so much.Upgrade to Ubuntu is planed, I have heard of success stories with the touch screen.I suspect it will fly ruining Ubuntu, my old brick of a dell laptop seemed like a powerhouse when I put Ubuntu on it.But alas graphics cards don't upgrade with a better OS so it was time to buy a new laptop and I chose this one.Windows 8 is more of a touch screen index menu wrapped around windows 7I am sure there will eventually be some good apps on windows of interest to me that make good use of the touch screen but for now the touch screen was not the best investment for me.", "Date": "April 11, 2014"}, {"Title": "great laptop", "Author": "peter", "ReviewID": "R28U12F7XQXSKE", "Overall": "5.0", "Content": "Acer Aspire V is an all around great laptop for a student or small office. I recently purchased the Aspire V for school purposes, and touch screen makes it easy and fun to navigate though Windows. It's not a gamers computer that's for sure, but its light weight and durability which makes it great if your also lugging around text books.DurabilityI'm not most graceful person in the world, and have had my share close calls with this laptop. But it has never taken damaged from falls less than a couple feet onto carpet. The Acer is as tough and sturdy as it looks, it rides along with me in my backpack full of text books with no problem. The Acer has survived three months with a person notorious for dropping things, and has done well.The insidesI do not know a lot about computer operating systems, but for what I use the Acer for which is mainly school work it does quite well. I have only had the computer freeze up on me a couple times, due to the fact I had to many windows open. As long as you don't use this computer as a gaming system it will have seamless operation.Touch Screen The touch screen is remarkable and instantaneous; I think it is the greatest feature of the laptop. I don't even bring paper to class anymore thanks to the screen, I just squiggle on the screen, and I have my notes. If you like solving math equations on a white board then you'll love this screen.WeightI don't even notice the weight when it's in my backpack, and when the laptop is in my hand it feels like rigid manual about an inch thick; however, there is a price to its slender nature, which is the absence of an internal CD drive, But CDs are a dying commodity.PriceAs with all new technology on the market there is a higher price, but I was surprised to find the cost was much lower than I thought. I paid $745.00 for a computer that makes me want to do homework and it's all the touch screen really. If you look around on-line the Acer is probably even cheaper.", "Date": "April 21, 2014"}, {"Title": "Better Than I Expected. I Am Impressed", "Author": "Sue's World", "ReviewID": "RFP8FWXM9T02C", "Overall": "5.0", "Content": "This is a surprisingly delightful computer. Now, let me go on to explain. I'm not a gamer. But my work is online constantly. I wanted a laptop that had both power and speed. This Acer Aspire has both. But it even has more little features that surprised and delighted me. The touchscreen wasn't a requirement in my work, but it's rather nice. Especially for scrolling through web pages.The heat vents go out the back, not the side. Another nice feature. There is also a heat vent that comes up through the keyboard. For some of you, that might not be a nice feature. For me, it's great! On those cold mornings, my fingers warm up nicely while I'm working. I haven't yet used my laptop in the heat of the summer, so I don't know what this vent might be like then. But, in the cold, yes baby - I love it!I went for a month trying to use the sensitive touchpad. Then gave in and got a Logictech lapdesk with mouse tray and attached my wireless mouse. Now, I have the perfect laptop for my uses. It's easy to disable the touchpad and it stays off, even when I restart the system.There is no CD drive in this laptop. I thought that might be an issue, but it turned out not to be one at all. I got an external drive and plugged it in for those very few times when I need it.This laptop has incredible sound quality. Which was NOT a requirement for me, but another nice added feature. And the first time I saw a video on the screen, I was amazed. The picture quality was incredible as well. Another very nice feature.Yes, I could have spent many more hundreds of dollars to get the speed and power that I wanted, but I didn't have to. The Acer Aspire gave it to me. With the addition of the mouse, I have my perfect working laptop. And I do my work sitting comfortably in a chair, couch and even propped up in bed. I am impressed.", "Date": "April 18, 2014"}, {"Title": "Best performance bang for the buck!", "Author": "mph", "ReviewID": "R11ZRLJ863N1SD", "Overall": "5.0", "Content": "I just got this laptop, and I also own a mid-2012 15 inch MacBook Pro. This laptop matches the gaming performance of the MacBook for 1/4 of the price! If you are looking for a solid laptop on a budget, get this.", "Date": "April 5, 2014"}, {"Title": "Love it.  Great Computer", "Author": "Aaron", "ReviewID": "R28OXPYSNJR5NA", "Overall": "5.0", "Content": "I got this computer through Sam's Club for work and I couldn't be happier.  The battery life is phenomenal, screen looks great, and the touchscreen is smooth and responsive.The touchpad mouse is hard to get used to.  The buttons are integrated into the touchpad.  I find myself moving the cursor when I am trying to click the buttons.  I highly recommend a bluetooth mouse if you do anything in powerpoint, publisher, etc.The sound quality is amazing.  Not just amazing for a laptop, but great sound.  I highly recommend.", "Date": "February 5, 2014"}, {"Title": "the best computer i have ever had", "Author": "Carlos Carrasquillo", "ReviewID": "R3AYU0428A0IGO", "Overall": "5.0", "Content": "love all the feautures for the low price you will never find all that for less. I select it after a huge search on internet and it was Simply awesome.", "Date": "September 7, 2013"}, {"Title": "Takes a little getting used to.", "Author": "Desertrose \"desert_rose501\"", "ReviewID": "R2XW5RATKBFLZF", "Overall": "5.0", "Content": "I bought this to replace my gateway laptop and the laptop will be primarily used for school. I have a custom built desktop that blows other peoples computers away, so I didn't expect the tablet to compete with that. I just wanted something light enough to carry around and study with. Right out of the box the computer worked great. I had no issues connecting it to my router. It took a little getting used to with the apps and trying to navigate around but once I figured it out ( which took only 20 minutes to do) I found that I was loving the laptop. I love that anything that i install on the laptop I can access on the main app screen. The touch screen I love. The lack of a CD drive was no problem. I just got an external CD drive and was able to install the programs in needed to easily.", "Date": "August 18, 2013"}, {"Title": "The little touchscreen that should, but, couldn't...", "Author": "Celadon", "ReviewID": "RAY9LS6O2WYPN", "Overall": "1.0", "Content": "Being a power junky looking for an relatively inexpensive model, I overlooked the problematic reviews hoping 'those issues' wouldn't happen to me. Well, it did!Approximately 1 month into use the touchpad and screen started darting around erratically. In part, I was able to remedy this issue with a USB keyboard and mouse. Still, the touchscreen is arguably the biggest feature on this unit and probably the only reason anyone would willingly tolerate Windows 8, and it's loss renders it useless to me. If that wasn't enough, the unit randomly restarts for no apparent reason. Programs close, minimize or shift on their own volition. Lastly, the processor will sometimes seriously lag when, for example, only a word doc is open and then cycle back to normal as if a large memory consuming program was closed. This machine is seriously 'possessed' and getting returned today!..", "Date": "January 31, 2014"}, {"Title": "I love it.", "Author": "Artem", "ReviewID": "RHL44MYG37KDF", "Overall": "5.0", "Content": "When I listen music, EACH time I am surprised of the sound quality. Had no problems with router connecting. Very comfortable keyboard and touchscreen display.", "Date": "September 26, 2013"}, {"Title": "with", "Author": "Richard White", "ReviewID": "R2X5N868XC43ZR", "Overall": "1.0", "Content": "I did not like this computer at all.  I was trying to return it and they said they would contact me in 48 hrs and I haven't heard form them at all.  I would like to return this item but have no shipping label to return it.", "Date": "June 6, 2014"}, {"Title": "good laptop", "Author": "roselys zabala", "ReviewID": "R3VLAFVE7QGTS3", "Overall": "3.0", "Content": "excellent product, Windows 8 is a new experience, I have a single complaint until recently received heavenly product in my country, and the surprise was that the charger is fully damaged, no charge and can not be repaired", "Date": "May 20, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CXKSPA2"}}