{"Reviews": [{"Title": "Perfect fit for me", "Author": "Robert E", "ReviewID": "R31PSK450QPBEY", "Overall": "5.0", "Content": "First I'd like to clarify the product description. The processor chip is actually an Intel Celeron  1005M. The rest of the description is accurate. My needs are for internet, spreadsheets, word docs, email, photos, videos, Netflix, Youtube, Amazon, Google Earth, games, animated weather maps, specialty soft ware for flight planning, etc.  this laptop does all that with ease.It is well made. All components seem perfectly matched. AND BEST OF ALL...IT COMES WITH WINDOWS 7!!!!!", "Date": "July 16, 2013"}, {"Title": "Very good for general use; great for seniors.", "Author": "anon87", "ReviewID": "R3KS9GGGSEQPQC", "Overall": "5.0", "Content": "I purchased this computer for my mom and dad to use. They are 74 and 77 years old, respectively.Since their old PC was Vista--need I say more?--I thought that the more reliable Windows 7 operating system would be to their liking. I did not want to burden them with Windows 8, which is not appealing to most of my friends, who are in their 40s and early 50's.It was easy to configure the Internet Explorer, Firefox, and Chrome browsers to their liking.The touch pad was something new for them. Both are trying to get used to it. I did teach them to turn it off when they are typing documents, in case the trackpad is too sensitive and starts causing keyboard errors. Even if a mouse is connected to the system, if the trackpad is not turned off, there may still be typing errors.I like the DVD burner. I used it immediately to make eRecovery disks, one set for myself and one for them. The password reinstaller  CD may also be a helpful thing to do early on. It is easy to find the eRecovery area, in case you need to reinstall it to original factory specifications. I like that feature. In the older models, it was not always there.I removed some bloatware, like the Norton Backup and the version of McAfee that came with it. I installed the McAfee software from their internet provider, instead, which did not take very long.Installing their external hard drive with our family photos was also easy to do. The screen quality is good. With their old Vista PC, the slide show did not function well. I did not need to worry here. It shows Youtube videos without hesitating, which I tried after the Adobe Flash Player was updated.I own other Acer laptops, the Acer Aspire One 725-0899, Win 7, which I use for word processing and business trips. It sometimes hesitates during Hulu viewing, but for the convenience of portability that fits in my purse, it's okay. I don't like the SD slot, in which the cards stick frequently, requiring tape and pressure with fingers to extract the card. I have 2 old XP machines, which are Aspire 5002 WIMI and an old netbook Aspire One, which are compatible to my workplace computers. I still use them sometimes.I am very satisfied with the Acer E1-531-2686 as being family friendly, good for emails, multimedia, and general purpose use.It is also a very attractive red color, which pleased my mom very much.I hope the company keeps this model around longer. I really don't like Windows 8. People need alternatives before Windows Blue fixes the problems that we have currently.", "Date": "September 4, 2013"}, {"Title": "Great Budget Laptop", "Author": "PhilMcKrevice", "ReviewID": "R7N4GDONK5A2U", "Overall": "5.0", "Content": "Like you, I needed a laptop and started my search on Amazon only to compare what I liked to the big box stores.  I was looking for a cheap \"beater\" laptop.  I didn't need anything fancy, and this laptop looked like it fit the bill.This laptop comes with a Celeron processor.  I had images in my mind about the Celerons of yesteryear and was put off by this because they were typically slow.  I took a chance without looking into the CPU further due to the price.  This Celeron is an Ivy Bridge processor which was a huge shock to me.  And though it's not an i3,i5 or i7 it does the job just fine.Who should buy this and why.You should buy this if:You need something somewhat inexpensiveYou want a computer that has Windows 7You need a CD/DVD driveYou want a laptop that has a full size key boardYou want/need a laptop that has a large hard drive - this laptop has a 500 gb hard driveYou do not want to \"upgrade\" to Windows 8I personally do not use the keyboard as I am not a fan of the style of keys that this laptop has.  Plus the layout is weird and my fingers never got used to it. I would have preferred the mouse pad to be moved over to the right about 3-4 inches.  No matter.  I bought a Logitech wireless keyboard right away as nothing beats a real deal full size keyboard.The battery life is pretty good.  I have not timed it out, but I'd say it's on par with Acer's claims.One thing that does suck is the bloatware (pre-installed software) that comes on this machine, which is to be expected nowadays.  It does come with a bunch BUT you can get rid of all of it almost immediately using PC Decrapifier.  This works very well.  I highly recommend.  Plus, it's free.Basically if you want something cheap(ish) do not ignore this laptop.  I consider myself to be a more advanced user as I have built numerous computers from scratch, so my expectations are somewhat high...and even so I find this laptop to be above average for my needs.  I'm sure at some point I could upgrade the RAM, but at this point I don't even see the need.For the money, I think you would be hard pressed to find something comparable with the features this has.11/14/13 UPDATEI play Left 4 Dead 2 on the regular.  Not on my laptop but on my main desktop computer.  I was bored last night and hopped on Steam and downloaded L4D2 on this laptop, just to check.  I was expecting it to be laggy and choppy, and eventually crash, due to tons of fast moving objects on screen.  I was way wrong.  Talk about impressive!  This game plays very well on this laptop.  Not like my main computer...but then, my main computer has a video card in it that was more expensive than this laptop.  I did notice some choppiness when the screen filled with zombies, but nothing that made me want to turn if off.  I was planning on getting rid of this laptop and then get another one with a video card so I could play games, but after playing last night, I don't see the need anymore.  I'm keeping this until it dies.  Way to go Acer.12/12/13 UPDATEI have experienced my first hardware/software problem with this laptop.  There are 3 USB ports.  1 on the left and 2 on the right.  The port that is closest to me on the right hand side has pretty much died.  Anytime I plug something in it says that the device has failed.  But this is weird.  I can plug my smart phone in, and it will charge the phone, but that's it.  I cannot access anything on my phone.  But when I move it to the port next to it, I can access everything/charge the phone.  So there is power there, but something is not right.  Annoying?  Yes, as I am using the other 2 ports on a consistent basis.  One for the wireless keyboard and 1 for my external mouse.I went into the device manager and tried uninstalling the \"unknown device\" and then plugging my phone back in, in the hopes that it will reinstall the driver for the phone like normal, and that didn't do anything.  When I plug my mouse into this port, the laser does not come on, and it does not work, yet there is power there to charge a phone, but not enough to allow you to do anything else with this port.Maybe this is hardware, maybe it's software and the computer could use a fresh install of Windows 7.  I may try that out later on down the road.  Or maybe I'll say screw it and just buy a USB hub and deal with it.  This is not a deal breaker, I still love this laptop.", "Date": "October 15, 2013"}, {"Title": "Nice laptop with nice win7 system！", "Author": "Lara Davis", "ReviewID": "RRV0VL9CO0IV6", "Overall": "5.0", "Content": "It was a good choice for people like me who want to still keep having the win7 instead of win8.Then I found this deal，it was deep red with win7,running pretty fast，good for my work，love it！", "Date": "July 24, 2013"}, {"Title": "great laptop", "Author": "Roman", "ReviewID": "R3641GFQQAPCP8", "Overall": "5.0", "Content": "First of all it has 1005m 1.9ghz processor.  Second of all it has 1 stick of ram.  It means you can bump up the performance for $25 bucks with another stick of 4gb ram. It has sharp acreen,  great colors, very decent speakers,  soft and responsive keyboard.  Also comfortable trackpad with engraving to feel the scroll.  You can not go wrong with this machine for the price, just ignore word Celeron,  CPU is pretty fast.", "Date": "August 22, 2013"}, {"Title": "Good, sturdy, affordable laptop WITHOUT WINDOWS 8!", "Author": "Kimberly \"nicktee\"", "ReviewID": "R2KLBAPA91KQG8", "Overall": "4.0", "Content": "Earlier this year I purchased a slim/lightweight compute with Windows 8 and hated it.  The \"app\" interface was very off-putting to me in the laptop setting, and though you can use the \"desktop\" side it did not have full operational control of the computer and you still had to do some basic things on the \"app\" side.  Others may like it fine, especially if you like social media integrated into everything you do (I don't).  But it was not for me.  I began looking for comparable inexpensive lighter-weight laptops with Windows 7, as most new machines are outfitted in Windows 8.  After searching for a bit, I came across this Acer.  I read the Amazon reviews as well as a few \"tech\" reviews I found on the web and gave it a try.  I was also motivated by the fact that I've had an Acer tablet for 3.5 years and it has been a reliable and sturdy little machine.  Acer products are not high on \"glamour\" and \"bells and whistles\" but get the job done for significantly less than more popular tech manufacturers.  My assessment of the laptop after a month comports with my prior Acer experience.  It does everything it should for my laptop needs.  If you have more specialized or sophisticated use (such as heavy gaming, etc.) perhaps this would not be the right machine but for basic web browsing, document production, music and videos I couldn't ask for more, especially for the price.  Browsing is fast, even with lots of windows open.  Keyboard is more spacious than many other designs, which I like.  No complaints at all.", "Date": "October 3, 2013"}, {"Title": "Love this!", "Author": "Kat \"Yooper\"", "ReviewID": "R2HCLXIJDQUKF9", "Overall": "5.0", "Content": "The first \"plus\" is Widows 7.  It has a great price and intel inside, I would buy another one anytime.", "Date": "August 15, 2013"}, {"Title": "Acer Laptop performs well most of time BUT", "Author": "Robear \"monkseal\"", "ReviewID": "RWK0GYJ4A7VC8", "Overall": "3.0", "Content": "Now I have had the computer for 100 days and have more to share. NOT as good.  Customer service is no longer quite excellent. Computer would not boot, Called Acer. They set me over to techie after initial questions. What they did not tell me was that they were referring me to a company in India that would charge for their services. (Would have been nice!) So when they worked with me rather ineffectively,  I was thinking they were Acer and getting  service as in first 90 days. When they figured out the problem after 1 1/2 hours and logging into my computer, say they will fix it and i can choose from the following payscale. ($70-$200)  I felt totally highjacked! Here they were logged into my computer and just telling me that I owed them $$$'s!! Buy APPLE for good customer service! Have 4 a year old MacBook Pro, WOW! I know there is a big difference in price here but would recommend their laptops. Everything has been upfront with Apple. Each time I upgrade system I get another 90 days for free to help you learn. No deceit.  Add to this the persistence of Norton and other embedded programs from ACER continuing to pester me to Buy their brand. Obnoxious!  Really  I like the Acer computer but NOT what goes with it. And yes it is a bit tempermental.", "Date": "August 2, 2013"}, {"Title": "Very Happy", "Author": "DaisyGirl", "ReviewID": "R2BZHGIQ1UFOB5", "Overall": "5.0", "Content": "After giving a fancier laptop with a touchscreen and Windows 8 a try, I'm thrilled to return to Windows 7 and familiar territory.  It's just been two days, but everything is working well and I enjoy the fun red color.  Good deal and shipped much faster than I expected.  If you do the basic stuff - email, internet, photos - this is a great user-friendly choice.", "Date": "September 13, 2013"}, {"Title": "Good bargain", "Author": "cmdvimes", "ReviewID": "R3PGAOLQVTPWHH", "Overall": "4.0", "Content": "This machine was to replace a 2007 HP dv6500 laptop that was showing its age. Ordered on a Saturday night and got it Monday morning at work, which is impressive. Spent some time running windows update, uninstalling McAfee and replacing with Avast. Malwarebytes did not encounter any pre-existing infections. I was able to transfer Office 2007 from the HP over to this machine resulting in *more* updates. The machine is sleek and lighter than the old HP pavilion and the fan rarely kicks in. The casing does show fingerprints easily and feels less solid than the old machine.Pros: windows 7 home premium instead of the abomination that is win8, nice 15.6 inch screen and casing, 4 gigs of ram is enough non-gamer needs.Cons: A couple of things that are a bit irritating, the touchpad is quite sensitive which can be adjusted but the location is left-of-center which often results in placing your hands in the wrong position. The click-bar under the touch pad is one solid piece, not divided into two segments for left-click, right click functions. You can still do these functions but it may be confusing to a novice. The off-center location of the touchpad is something you just have to get used to. The speakers are underneath and the sound quality is okay but the volume is rather quiet, even on max. I'm considering getting external speakers and realize this machine doesn't have bluetooth.Overall, I'm happy with the machine, with a modest investment in wired external speakers it will be even better.Addendum after a few months of use: I still have good feelings about this laptop. We did in fact invest in a pair of those inexpensive popup speakers which helps boost the sound quite a bit. As a complaint, the reddish tint near the trackpad has worn away but functions just the same.", "Date": "September 12, 2013"}, {"Title": "I'm Happy With My Purchase", "Author": "Paul H. Kemp", "ReviewID": "R17EHH85J350XG", "Overall": "4.0", "Content": "I want to be fair with this review -- I haven't read the manual. The machine is generally exactly what I wanted for a good price. My only issues are with the cursor that unpredictably decides (for me) that I want it to scroll up or down the page, when I'm trying to do something else. I've never encountered this with any other Windows computer I've owned or used and trying to control it is wasting time and my patience.Other than that, for a non-techie, it's a good, light, full-featured machine. If I find the time to read the manual, I may learn to like my Acer Aspire even more.", "Date": "August 18, 2013"}, {"Title": "Sent in for repair the first week!", "Author": "Amazon Customer", "ReviewID": "RH4582MAOIKDR", "Overall": "3.0", "Content": "I was excited to get my new computer and immediately started setting it up. The battery died and I plugged it in to charge and found the port for the charger was bad. When I called they were going to have ME pay the shipping to have it fixed and told me \"if they find any abuse to the computer they would charge me\". I sent it in and the time for repair and to get the computer back was very good. Since I got it back I have used it and had it freeze up a couple of times. I knew I was not buying a high end computer, but I have been somewhat disappointed with it.", "Date": "October 12, 2013"}, {"Title": "I love it so far", "Author": "Dose", "ReviewID": "R19ORAL4BCJVM5", "Overall": "5.0", "Content": "So far so good. The computer is sleek black and bold. My girlfriend has the Sony Vios, but every since I have gotten my Acer she can not leave it alone. However fresh out of the box you may have problems connecting to WiFi. The solution is simple; right click on the wifi connection logo on the bottom right side of the screen and adjust the advanced settings. Also go to Intel.com and download all of the new updates for your acer. It takes a few minutes.Cons: Slow without the updates. Little memory and not so good speakers.Pros: Fast after updates, cool design, easy to use, beautiful screen and affordable", "Date": "November 23, 2013"}, {"Title": "Acer Aspire laptop review", "Author": "Gail Harrington", "ReviewID": "R5QTIMNT5VAUO", "Overall": "5.0", "Content": "My HP \"died\" so I needed another laptop immediately. This Acer is similar in action so I did not need to initiate myself to a bunch of new procedures and I ordered it in Windows 7- all is good. Cost was competitive and delivery quick. A+ rating all around.", "Date": "October 3, 2013"}, {"Title": "A good purchase for the money.", "Author": "Sally A. Schrum", "ReviewID": "R1473DMFCKPA0X", "Overall": "4.0", "Content": "So far, no complaints.  I especially like the fact that it has Windows 7.  Easy initial setup and I had no problems using the import features.  Glad that I made the purchase.", "Date": "September 3, 2013"}, {"Title": "HORRIBLE LAPTOP CRASHED IN ONE MONTH!!!", "Author": "Katherine Todd", "ReviewID": "R2RTHEY66DFWPW", "Overall": "1.0", "Content": "Horrible laptop, the computer crashed within one month of purchase!!!  I had to call Acer 3 times. The first time I called Acer the representative tried to troubleshoot over the phone with no success.  The representative from Acer told me that because all the trouble shooting we did over the phone did not work, I needed to PAY $ 20.00 for recovery disks I needed to purchase from them.  So, I have the computer one month and the computer completely crashes and the consumer has to PAY for recovery disks????I receive the recovery disks and after trying to run the recovery disks 3 TIMES the computer would crash when I got to the 4th disk (I am not incompetent with computers). I called Acre again.  The rep walked me through trying to troubleshoot again…. this time it would take over 12 hours for the computer to try to run the disks, after 12 hours the laptop still did not work.  I called Acer AGAIN. The representative from Acer told me I would now have to ship the laptop to Acer to have the laptop serviced and if they were not able to repair the issue they would have to replace the hard drive.  I expressed to the Acer representative this entire process was completely unacceptable.  I advised the Acer representative I wanted nothing to do with the laptop and wanted to return it, at the bare minimum replace the laptop with a NEW one. The Acer representative that was there policy and they would not replace my computer but only troubleshoot the one I purchased. I explained to the Acre representative I had now wasted HOURS dealing with this issue and did not want to waste any more.  The Acre representative told that’s all they could do and I could not return the laptop to them, I needed to contact Amazon if I wanted to return it (at this point I had been without a working computer for 8 days).Here we go again wasting more of my time.  I call Amazon and explained the situation regarding the laptop. After 30 minutes ofexplaining the situation and being placed on hold for 10 minutes the Amazon representative told me I could return the computer however, I would only be refunded 50-80% of the purchased price. I want to return the computer to Amazon I do not get a full refund?!!??  Let me get this straight, I purchase a computer, it crashes within a month, and I cannot get a new from Acer or Amazon or a full refund. I did nothing to cause this computer to crash and I am the one is stuck with the bag, unreal.Consequently, my options are return the computer to Amazon and only get half of my money back or send the laptop to Acer and have the computer repaired leaving me another 7-10 days without a computer which I use for work.I AM COMPLETELY UNSATSFIED WITH ACER AND AMAZON!", "Date": "December 9, 2013"}, {"Title": "Great basic PC...but get rid of McAfee", "Author": "islandgirl \"fran\"", "ReviewID": "R3G5ZVG5FAS0NC", "Overall": "5.0", "Content": "Love this laptop NOW, after removing the pre-loaded McAfee \"free trial offer\" program.Had to search for PC with Windows 7, tried the Windows 8 and hate it, yes just hate it.Was not real crazy with the performance of this computer at first, lots of goofy un-controllableactivity and s l o w response.Since I use my iPad for so much everyday I was putting up with the slow response, justthought I should up-grade with my ISP for a faster ($$) speed.Last night while using it McAfee kept interrupting and shutting things down.  Was so frustrated thatI un-installed the Mc Afee program and went on-line and installed the Norton program provided bymy IPS (free!).  It has been a dramatic improvement in operating this laptop's performance.SO...it may just be me, and I certainly don't understand all the mechanics, but getting rid of the\"free trial\" pre-loaded program made all the difference.Please understand I am NOT bashing McAfee, I have used the Security Suite for many yearswith no problem.But getting rid of it made the response lightning fast.  Great computer, great price and fast shipping,hoping it will last for years.", "Date": "November 3, 2013"}, {"Title": "BETTER THAN EXPECTED", "Author": "jwilliam747", "ReviewID": "R30IHM1XDA209Y", "Overall": "5.0", "Content": "First Acer laptop purchased....have run through many other brands... love the clarity of the screen, great keyboard sensitivity and feel.Starts up much faster than I expected. With the purchase of Microsoft Office, still the total was very affordable.....AND it came with Windows 7 which I had on the computer I replaced ..... all-in-all, one of the best buys I have made....", "Date": "September 16, 2013"}, {"Title": "Exactly what I was looking for.", "Author": "Alyssa Jo Barger", "ReviewID": "R1VX08JYV7TM05", "Overall": "5.0", "Content": "First let me start off by stating that I have not owned this long. Like, not even a full week long.I didn't need anything fancy when I was looking at laptops. I more use it for normal things; netflix, facebook, email, etc. Very basic things. I work from home so I pretty much have netflix going as background noise for a good 8-12 hours everyday. My old Sony laptop was slowly starting to die after giving me many years of good use so I knew I had to replace it.I find looking for a laptop to be pretty confusing. All the good vs bad reviews, making sure you aren't spending to much money, etc. And now there's Windows 8, which I have played with, but in no way wanted to actually deal with.This computer works perfectly for those who in the end, don't need much. It's quick as I surf or shop online. Netflix runs perfectly with no lagging or freezing. The battery has lasted me 4+ hours which is nice for when I take it out of my office to do something with. I love the fact that it has a number pad! The screen is crisp and clear. And it's not noisy what so ever.Yes, it does pick up finger prints pretty fast but really, who CARES?!So if you are looking for a computer to do pretty common things on, at a decent price, with the luxury of still having Windows 7 - this one would be perfect for you!", "Date": "November 15, 2013"}, {"Title": "Many nice features", "Author": "S. Levine", "ReviewID": "R3TATPHKB3MOJ5", "Overall": "4.0", "Content": "I initially gave my new Acer laptop a poor review but I am revising it. There is much to like about this computer and the price (I paid $387) is certainly worth it. It has an LED screen that is a mixed bag: it's bright and has good colors but can be very glaring during the day. At night, without sunlight pouring in, it is much better. The keyboard is simply OK but it's not bad once you get used to it. One weird thing, and this may be endemic to all 15\" laptops, is the keyboard is not centered but rather off to the left to accommodate the keypad on the right. Sound quality from the speakers is OK but not nearly as good as those on the 17\" Mac Pro i also have (this is to be expected). It is a relatively fast computer with Windows 7 and, so far, good battery life. I also like the glossy red color. For the money, I think it's a very good buy.", "Date": "October 10, 2013"}, {"Title": "Great quality laptop!", "Author": "kimmie", "ReviewID": "R2VI0XLZY1VN54", "Overall": "5.0", "Content": "This laptop is lightweight, easy to setup and has lots of great extras! I would recommend this product to anyone!", "Date": "September 25, 2013"}, {"Title": "A good deal", "Author": "Dave L", "ReviewID": "RLLQBYUHQYNAD", "Overall": "4.0", "Content": "A great computer for the price.  With my needs there was no reason to buy a high priced laptop that can smoke and burn games etc.  The other thing I like was that I was able to get it with Windows 7 which is the choice of most people I talked to.", "Date": "September 13, 2013"}, {"Title": "excellent value for high school student", "Author": "W. Cameron Nixon", "ReviewID": "R2MF1LDOLWLMKY", "Overall": "4.0", "Content": "i choose this product based on the cost and the capabilities my high school student could use for that cost. we will have to move to something more aas he approaches college but this was a good place to start.", "Date": "August 29, 2013"}, {"Title": "worked for 1 month", "Author": "Tim", "ReviewID": "R3TJGGR8LDZM54", "Overall": "1.0", "Content": "This computer worked well for 1 month...then started flipping out for no reason, one day I turned it on, put in my password and it said \"incorrect password\"...it did that about 20 times until it finally worked, but then half of the letters on the keyboard did not work, the spacebar did not work, the cursor would freeze in place for 10 minutes at a time,  that went on for about a week, now it is totally  frozen on the start up screen...going to try and turn this lemon back in.....good luck if you order one, hope it works better for you.", "Date": "January 10, 2014"}, {"Title": "for people who are tired of windows 8", "Author": "Florian Bellanger", "ReviewID": "R2SKIHTOMG35NA", "Overall": "5.0", "Content": "for people who are tired of windows 8 (the worse OS around for sure) and want to stick wit windows 7been using this computer for a week now ---love it for now -- fast , light and good screenarrived in perfect conditionsfor the price you cant beat thathighly satisfied", "Date": "November 22, 2013"}, {"Title": "This computer is fantastic.", "Author": "Cynthia E, Wallace", "ReviewID": "RD9OO6MKXFWV5", "Overall": "4.0", "Content": "The ONLY complaint I have with this computer is the volume.  It is very difficult to hear things with the speakers.  Otherwise, I'd have given it 4 1/2 stars if possible to do so.  It is easy to use (proud to say I am NOT tech savvy, but set this up without any help from a child at all!)  It is light, and the best part, still has windows 7!  Windows 8 was a nightmare for me in a laptop I returned because I couldn't figure out how to use it.  Even the salesman at the store said people are returning windows 8 for that same reason.  So, I am in my comfort zone with a nice sized laptop that I can USE!!!!", "Date": "October 21, 2013"}, {"Title": "Great product for the money", "Author": "DJinAK", "ReviewID": "R1O3T8V1459904", "Overall": "4.0", "Content": "This is a good computer for those not needing all the whistles and bells.  Windows 8 is garbage so getting this with windows 7 was a huge plus.  I added another 4 GB of RAM and now it hums right along. I would have given 5 stars but the sound quality is minimal at best. All in all it was the best bang for the buck I could find anywhere else.", "Date": "October 8, 2013"}, {"Title": "Great Laptop for the price", "Author": "Matthew Sullivan", "ReviewID": "R2CKJBXJRKSD4K", "Overall": "4.0", "Content": "I've had this laptop for about a month.... so far it is working great, no complaints.I used it recently to live webcast a conference event.  It handled the video processing from two video sources and broadcast two live streams simultaneously (admittedly at less than HD resolution).My only complaint is that it doesn't have USB-3... but considering the price, it's a bargain.", "Date": "September 16, 2013"}, {"Title": "Hard Drive crashed at initial set up.", "Author": "Shannon R. Eckenrode", "ReviewID": "R3M4L1TAQCHRY3", "Overall": "1.0", "Content": "Straight out of the box, going through initial set up and the screen goes black.  I call Acer and they tell me if I want them to tell me what is wrong I have to ship it at my own expense to them.  Luckily Amazon returns are amazing and I was able to return it for a refund.Won't buy an Acer product ever again.", "Date": "September 10, 2013"}, {"Title": "Yikes", "Author": "carey finn", "ReviewID": "R30703HAUGCX5V", "Overall": "1.0", "Content": "This computer has crashed on me several times and I've only had it for a few months.  Honestly I don't think it's worth the money.  And keep in mind that it does not come with Microsoft word/works.  You'll need to purchase this separately and it will run about $100.I am wondering if maybe they gave me a refurbished computer??", "Date": "January 1, 2014"}, {"Title": "Cannot Beat for the Money!", "Author": "Boardrider", "ReviewID": "R330OSK48ID9GO", "Overall": "5.0", "Content": "Want speed and function without Windows 8 at a great price this is your computer.  Enough features to perform a wide variety of PC tasks.  Browsing is super fast.  Anyone needing a PC to deliver fast internet browsing and capable efforts with any MS Office application will not need to spend more money.", "Date": "December 19, 2013"}, {"Title": "LOVE MY ACER", "Author": "Jamila Thurman", "ReviewID": "R1CDY9FXY231TB", "Overall": "5.0", "Content": "I love my Acer it was my first laptop and I am very please it arrived as scheduled  and is exactly what I wanted.  I wanted Windows 7 and there were not alot of laptops with this I was not familiar with Windows 8 and wanted to feel comfortable with my laptop.  I looked at lots of laptops and ACER had great reviews....Thanks ACER", "Date": "November 25, 2013"}, {"Title": "Outstanding value!", "Author": "D. Senne \"Dewey\"", "ReviewID": "R1G84HCNCFJP9H", "Overall": "4.0", "Content": "Have had this laptop about 2 months now and it has been rock solid stable and enjoyable. The touchpad sometimes has a mind of it's own, otherwise this would have received 5 stars. The wireless connection has been fast and reliable, the screen is easy to read and clear. I use this mostly for internet use, but also have edited a few pictures and did a couple of spreadsheets (I installed MS Office after I got it). Always seemed to have enough \"ooomph\" for what I was doing. The fan seldom kicks on and the battery life has been outstanding. I would highly recommend this laptop.", "Date": "November 3, 2013"}, {"Title": "Nice computer", "Author": "Cindy", "ReviewID": "R3B67UEVT9WE0K", "Overall": "5.0", "Content": "This is a very nice computer for it's price.  We were looking for something with a fair amount of memory and speed.  Also for something that wouldn't require taking out a second mortgage to pay for.  This fits the bill quite nicely.  About the only complaint is the sound quality.  It isn't as clear as some other laptops we've owned in the past.  However, that's being pretty picky!", "Date": "October 19, 2013"}, {"Title": "great laptop", "Author": "Paul", "ReviewID": "R4Z0MMN88ASKW", "Overall": "5.0", "Content": "I wanted a laptop with windows 7, and this laptop was better than I expected, VERY HAPPY with it I like Acer laptops I had one that was 7 years old with no problems", "Date": "October 17, 2013"}, {"Title": "met all my requirements.", "Author": "June R. Breese", "ReviewID": "R2J1XB6KZO6T1I", "Overall": "5.0", "Content": "I have only had the computer for a few weeks, but so far it has preformed all the tasks I needed.  If  a portable computer is what is needed I would recommend this one.", "Date": "October 9, 2013"}, {"Title": "A great computer!", "Author": "Patricia Ward", "ReviewID": "R2ZPIOP8K1J77L", "Overall": "5.0", "Content": "It is amazingly fast and the processor is built for the types of programs I use. It meets every expectation.", "Date": "October 5, 2013"}, {"Title": "good deal!", "Author": "peter", "ReviewID": "R1OQPBGXO5OFHF", "Overall": "5.0", "Content": "Needed a cheaper computer and it fits the bill. Did need to send the first one back since it was \"dead on arrival\", but Amazon was quick in replacing it.", "Date": "September 27, 2013"}, {"Title": "She loves it", "Author": "maurice", "ReviewID": "R3DXX4VU4HLAR2", "Overall": "5.0", "Content": "Bought this computer as a gift for my aunt. she loves it! Works great and looks great! She has no complaints", "Date": "September 10, 2013"}, {"Title": "Windows 7", "Author": "G. Burns", "ReviewID": "R1FO9T0A3TSI2N", "Overall": "4.0", "Content": "I bought this computer for my nephew.  He loves it.  The reason I purchased this computer is because it had Windows 7 as the operating system.", "Date": "September 24, 2013"}, {"Title": "The shoe fits", "Author": "ross allen", "ReviewID": "RZLWFB6V69DE2", "Overall": "4.0", "Content": "This computer does everything I expected it to do with exception that I had to lease Word Office. I guess I am behind times as I was not aware that this is now the norm. I'm cool with everything else.", "Date": "September 22, 2013"}, {"Title": "What a value!", "Author": "Thomas Molodetz", "ReviewID": "RZ2E9TRXG36SN", "Overall": "5.0", "Content": "If you're primary purpose for a PC is getting on the internet I can't think of a better value than this Acer E1-531-2438. It's fast, well put together, looks great, and comes with Windows 7, all for $388. What's not to like? This is our second Acer, and the first one is still going strong after close to 4 years of daily use. You have to make your own backup discs but it's a snap, and I've never had to use them with the first Acer anyway.Windows 7 is fast becoming phased-out so you might want to jump on one of these Acers quick!", "Date": "September 7, 2013"}, {"Title": "I got a lemon", "Author": "Charles Holliday \"Lonotz\"", "ReviewID": "RG05JM29XFPM", "Overall": "1.0", "Content": "I turned it on at first and thought it might be nice but when I tried to work with a couple of programs it kept crashing and re-booting. Sent it back.", "Date": "February 17, 2014"}, {"Title": "Acer laptops don't work in out of the box condition!", "Author": "Cathy", "ReviewID": "R3I1K7SUAV2X9K", "Overall": "1.0", "Content": "I have purchased two Acer laptops in a year and neither one worked in out of box condition.  I mean I couldn't access the internet.  On each one I worked with Acer tech's and they couldn't fix them and they wanted me to mail them to Acer to be repaired.  They wouldn't exchange them so that meant I paid for brand new laptops and, because of their poor quality products, I would end up with  reconditioned ones.  (Reconditioned laptops sell for a cheaper price.)  The first one I returned to the store I purchased it from and the second one I returned to Amazon.  They weren't the same model so that wasn't the issue.  I will never buy an Acer laptop again.", "Date": "January 7, 2014"}, {"Title": "Great choice", "Author": "Theresa Wells", "ReviewID": "R1YSF4EPB9JAYI", "Overall": "5.0", "Content": "I chose this for a personal computer for myself and my college classes. It is great, does everything I need and is perfect as a student. I am very happy with it.", "Date": "December 18, 2013"}, {"Title": "Great value!  Good laptop", "Author": "Maria E Ramirez", "ReviewID": "R1R5QW20D3IZEN", "Overall": "5.0", "Content": "I bought this computer a couple of months ago.  I did not have many to choose from as I wanted Windows 7.  I was unsured of the brand.  Today, I installed all the necessary programs and started using the computer.  I really like it.  Keyboard is soft, internet is fast enough.  And the value is excellent.", "Date": "December 12, 2013"}, {"Title": "Decent but spend a bit more for a better model.", "Author": "Crazy4mykids", "ReviewID": "R1DQ7FQQCUPL09", "Overall": "3.0", "Content": "I got this laptop specifically for Windows 7 and the Microsoft office starter.  I have another laptop with Windows 8 and am not very happy with it, or the fact that with Windows 8 you need to subscribe to Microsoft Office annually and can't purchase it.This laptop was a decent price, but I am sorry I didn't spend a bit more on a better model.Positives:  I like the weight of the laptop and the battery seems to hold out for a long time.  (I have not timed it, but I would say several hours or more.)  I like the keyboard.  The keys don't press down too easily, but it is not like typing on a typewriter, either.Negatives: The speakers are terrible.  You can barely hear anything.  They work fine with headphones, but if I want to listen without headphones, I need to strain to hear it.  There is also no slot for a camera card.  It's possible that was in the description.  I just assumed that would be standards on laptops today.  I don't know if it is the computer or Internet Explorer, but IE shuts down on me at least twice a day.  Sometimes I log out of all IE tabs, and then click the IE icon, and it won't bring anything up.  I try to shut down and restart the computer and it gets stuck in shutdown mode.  I eventually need to just turn it off and back on again.  Then it works fine.  I don't think that it is a virus because it has been happening since day 1.I have been using the computer for exactly 5 weeks.All in all, the computer will work as a spare, but not what I had hoped for.", "Date": "December 12, 2013"}, {"Title": "BEST DEAL ANYWHERE FOR THIS LAPTOP AND WINDOWS 7 MACHINE", "Author": "POLICE MILLENIA", "ReviewID": "RFDBQSGOMY3IR", "Overall": "5.0", "Content": "Awesome price and computer. Nothing else to say except this is a deal and great computer to keep Windows 7 alive!", "Date": "November 21, 2013"}, {"Title": "acer has a great product", "Author": "Andria Caldwell", "ReviewID": "RYSZRJKO7YH7H", "Overall": "4.0", "Content": "The laptop has been a lifesaver for me. It hss definitely exceeded in the capacity for which it was intended.  I love it's light weight and it's speed.", "Date": "November 2, 2013"}, {"Title": "Acer Aspire E1-531-2438 laptop", "Author": "scooter", "ReviewID": "R2M6NFRBPTEUN2", "Overall": "5.0", "Content": "fast delivery,laptop works just fine. fast start-up,clear picture, lite for portabability has all the features that one would look for in a portable laptop.", "Date": "November 2, 2013"}, {"Title": "ACER ASPIRE AA GREAT LAPTOP", "Author": "c j corning", "ReviewID": "R2JW0HABJWL1K2", "Overall": "5.0", "Content": "It is light weight. The battery life is good. Has sharp clear images and good colors. Arrived In packaging well protected . It was easyto setup.", "Date": "October 29, 2013"}, {"Title": "computer", "Author": "Jackie Heimbuch", "ReviewID": "R2IQIYNMM5XWFW", "Overall": "3.0", "Content": "This is an ok computer. Had to send back the first one I bought because the ports didn't work. You have to wear headphones to hear anything on this computer. Would not buy an acer again.", "Date": "October 21, 2013"}, {"Title": "Buyer Beware !  Purchased as Prime Eligible- know what you want before purchasin THIS model!", "Author": "kei. \"g.k. bevido\"", "ReviewID": "R3H3D301S6IECU", "Overall": "1.0", "Content": "First, this was a Prime Eligible sale, so the packaging and condition this arrived in is one issue; XL BOX w/ ABSOLUTELY no packing material, just this computer taped to cardboard, no manual, description says fulfilled by Amazon, while online invoice says a different name. The previous owner's data was still inside, but description says\"refurbished\". I had to restore this to factory state, had to pay $50 to find out necessary drivers  to use my printer are not available longer from Acer.  I purchasedthis so I could reinstall the software for a year-old e-printer, or wireless printer that I accidentally restored to factory status by touching the wrong option on keypad. I had other software on discs and needed a laptop with OPTICAL drive, after a tech from the company where I purchased the e-printer and laptop destroyed laptop withsuper glue, then refunded money to wrong credit card, who n took this money thinking I wanted to pay off most of my balance!  An Amazon rep recommended I purchase this Acer as this was all I actually needed a laptop for, considering I owned four other ways to access internet, NEVER MENTIONING optical drives  are now sold separately like external hard drives. I gave this one star because this was definitely not what I needed, it was described as being refurbished and fulfilled by Amazon, until invoice showed otherwise and sold as Prime Eligible. This may suit another's needs, but should you want to print or use any software..in other words- if all you're looking for is a means to get online, maybe -MAYBE- this will work for you. If you want to view DVDs stick to whatever you're using now.  If you want to stream video this model I returned had to be connected via ethernet cable; attached to WiFi modem, plugged into this laptop.  But after shutting down, it never came on again. Another thing regarding the description provided here, there was no Windows Home Premium in it, it was just Windows 7 and Recycle Bin. As far add being \"refurbished\", the most anyone did was put 'plastic-wrap' over the monitor screen!  There is much more I could say here, but my Prime membership is still active for a few more weeks.", "Date": "November 10, 2013"}, {"Title": "Works Great (when it DOES!)", "Author": "Barry Scheps", "ReviewID": "R3NRP9I0VT1V34", "Overall": "2.0", "Content": "Based on my experiences, thus far, with this 4-1/2 month-old unit, I should actually be giving this \"Acer Aspire E1-531-2438\" a SINGLE \"star\" rating.  However, since I STILL like it (don't know why...just being hopeful, I guess!), I won't: ....1- Purchased in early NOVEMBER of 2013.  All's well for a couple of months.2- JANUARY 9th, 2014:  Laptop developes a defect.  One of its three USB ports fails, resulting in the computer's failure to recognize any hardware that is plugged into it (I soon notice upon close examination, that one of the port's 4, internal, metal contact strips has become displaced, so that its alignment can't correlate with that of the corresponding contact strip of any plug).3- Contacted \"Acer.\"  They issue me a \"case number\" and instruct me to mail the computer to their factory in Texas, for repair under-warrantee, at MY EXPENSE for the shipping cost of >$20.  I oblige.4- Receive computer back from them about 2-1/2 weeks later.  All's well, once again.5- JANUARY 28th (just under 3 weeks later):  A DIFFERENT USB port developes the IDENTICAL problem!  I again phone \"Acer.\"  They issue me a new return-case number and again instruct me to mail it back to them (THIS time, though, they e-mailed me a pre-paid shipping label for return via \"Fed Ex\"... don't know why they didn't do so for the first problem).  I send back the unit to them.5- They again replace the 2nd defective USB port, under warrantee and I receive the laptop back from them about another 2 weeks thereafter.  All's well, once again for a few more weeks.6- MARCH 12th:  A few days ago, while on the internet with the laptop at my local library via their Wi-Fi, my Acer suddenly loses internet contact (no one else around me there on their laptops seems to be experiencing any problem).  I shut off the computer, wait a few minutes and re-boot it.....STILL no internet access (and the wi-fi indicator icon at bottom of my screen is \"greyed out\" with a small, red \"x\" over it).  Ever since, the computer fails to recognize ANY wi-fi signal.  AGAIN I phone \"Acer\" a THIRD TIME and speak with a technical-support representative.  Despite about an hour of working with her instructional sequences to correct the problem (including \"wiping out\" the entire hard drive and re-installing \"Windows 7\" \"from scratch,\" the problem persists.  I am ISSUED A THIRD RETURN-CODE-NUMBER and they e-mail me another pre-paid \"Fed Ex\" return-label for laptop's return to their Texas repair facility.Receive the 3rd-time-repaired computer back from them, via \"Fed Ex\" on March 26th and, once again, all's functioning well (?but for how longs?, I am wondering!)SUMMARY:  In-between its once-every-6-weeks-breakdowns, the computer works quite satisfactorily for my purposes (despite its:  Somewhat sensitive touch-pad; Weak, tiny speakers' audio; And its pre-installed \"McAfee\" virus-protection software, which sometimes slows down internet surfing), and it has several useful \"perks\" for its price:1--Camera & Mircrophone (\"web-cam\") atop its screen for \"Skype\" or other Internet-related video-audio purposes2--500 GB Hard drive3--4 GB RAM4--CD/DVD \"+/-\" \"R/RW\" Optical Recorder/Player drive5--\"SD\" Memory-card Slot (I believe it accepts some other formats, as well)--- It's elusive, so look carefully just to the left of the computer's front indicator lights...press in its \"dummy card\" firmly until it \"clicks\" and pops out, then remove it for the slot's access!6--\"WiFi\" (worked great at my library, for a few months, until its failure of March 12th, 2014 till its subsequent repair-under-guarantee a couple of weeks later)7--Three USB-\"2\" ports (two of which failed and had to be replaced since computer's purchase 4-1/2 months ago in early November of 2013)Now that \"Acer\" has again repaired it (regarding the WiFi), am hoping, once again, that this will be the END of this unit's \"bugs\" for longer than just a few weeks' time!", "Date": "March 16, 2014"}, {"Title": "Very dissatisfied with McAfee", "Author": "Ron", "ReviewID": "R3HTO1Z7BAA2C0", "Overall": "2.0", "Content": "The computer would probably have been great with any security system besides McAfee. When I had problems, a technician wanted to bill me to correct the issues, on a computer that was a few days old. I even tried to remove the McAfee, without success. I'll never buy another computer that has McAfee installed. Amazon's return policy is great!", "Date": "February 13, 2014"}, {"Title": "Not as good as previous Acer", "Author": "emily cordes", "ReviewID": "R3C4RKN52C1NXV", "Overall": "2.0", "Content": "Have had an Acer previously and never had a problem.  This one is slow, locks up frequently and has to be shut down and restarted.  The delivery was late and the box was left on a porch and did get wet.", "Date": "February 12, 2014"}, {"Title": "slow", "Author": "jacob", "ReviewID": "R3SDB7CMRYABV9", "Overall": "2.0", "Content": "this item came damaged  with the screen destroyed , which i blame ups for . other than that thi s computer is very slow  in its processing speeds i was expectiing more out of this system", "Date": "February 1, 2014"}, {"Title": "Acer Aspire E1-531-2438 15.6\" Laptop", "Author": "pearl lindsley", "ReviewID": "RBC1SHFX6L8ZH", "Overall": "4.0", "Content": "I like the Acer Aspire E1-531-2438 15.6\" Laptop but I had trouble with the offered virus protection. I still had a year left on my Norton contract from the lap top I replaced so I replace the MacAfee with the Norton.", "Date": "January 29, 2014"}, {"Title": "Defective from the box!", "Author": "Dane Knighton", "ReviewID": "R2C80CJKFX3A3Q", "Overall": "1.0", "Content": "Unfortunately I never had a chance to see the performance of the Acer.  Had issues with screen right from the box.", "Date": "January 26, 2014"}, {"Title": "3 Months old and broken", "Author": "LP \"LP\"", "ReviewID": "RSXL49SNVDHHU", "Overall": "1.0", "Content": "I bought this 3 months ago and the motherboard is already broken. Whatever it is that regulates the flow of electricity went bad already. I can't find out where the warranty information is. Awesome.", "Date": "January 24, 2014"}, {"Title": "A great low cost Laptop", "Author": "David", "ReviewID": "R2GJD8Z2BYJW5Y", "Overall": "5.0", "Content": "If you need a laptop and don't need a fancy one this computer works well.  With window 7 this computer will do most things well.  However if you want to buy a great computer that will play videos perfectly and keep up with the latest games you should not get this computer. It is a good general purpose computer and a great price.", "Date": "January 1, 2014"}, {"Title": "Home use.", "Author": "Donna Kay Niver", "ReviewID": "R25GSIJT297EJY", "Overall": "4.0", "Content": "This is a good laptop for home use. I followed some of the suggestions and removed the virus protection as soon as I did my set up. I replaced it with what I wanted.I have to agree with a previous post about the speaker volume. It is just bad.  I have had no problems with playing videos or processing speed.I love what I got for the price.", "Date": "December 30, 2013"}, {"Title": "Great computer!", "Author": "Ceil Andersen", "ReviewID": "R1HI9ZB50X5RME", "Overall": "5.0", "Content": "Thanks for a computer with Windows 7.  My husband uses my computer all the time, and he's not that computer literate, so I wanted something with an operating system he knew.  Was able to turn on the computer and immediately start browsing.", "Date": "December 29, 2013"}, {"Title": "Great laptop", "Author": "Grandma Sparkle \"Grandma\"", "ReviewID": "R2HI02FDBIF13H", "Overall": "5.0", "Content": "This is a great machine.  I use it when we travel and it's so nice to have a full size screen and keyboard away from home.", "Date": "December 22, 2013"}, {"Title": "Nice.", "Author": "Robert McKinney", "ReviewID": "R3JV8XO7PVQAQ9", "Overall": "5.0", "Content": "This is not my first computer, but it is my first laptop. I got it because it did not have Windows 8 installed. It's a good looking computer, if you care about that. Runs good and is wireless. I bought three of them. One for me, one for my wife and one for my daughter for Christmas. I like Acer. I have an Acer desktop with Vista installed. It's still running good, is trouble free and has lasted longer than other makes of computers I've had.", "Date": "December 20, 2013"}, {"Title": "Very good.", "Author": "Jjoek1", "ReviewID": "R2H3BQ029PN55A", "Overall": "5.0", "Content": "Wanting to still get a Windows 7 system, I jumped at the chance to buy this Acer Aspire. Very good, and a bargain for the price.", "Date": "December 20, 2013"}, {"Title": "Boots really fast", "Author": "Hayden Burrus", "ReviewID": "R2E4PWBJMZSBZD", "Overall": "5.0", "Content": "It boots fast because there was no freeware on it. This is a great feature. All computers should be sold that way.", "Date": "December 18, 2013"}, {"Title": "I Must Admit . . .", "Author": "Yuri Sobol", "ReviewID": "R185D5SYRWGD37", "Overall": "5.0", "Content": "I must admit I love this laptop--so far.  I've had it about three months.  My needs are not great, and this device fills them all.I needed a laptop fast, and when I checked with the local brick and mortar retailers, I found they no longer had computers with Windows 7 in stock--only the dreaded 8.  Fortunately, I found this Acer with Windows 7 at Amazon.  It's got a nice, wide screen; it's quiet and fast; it has plenty of capacity; and it fills all the requirements of the job that demanded I get a new computer.", "Date": "December 15, 2013"}, {"Title": "Very nice!", "Author": "Cat Lover", "ReviewID": "R3SPVPD0WLLISQ", "Overall": "5.0", "Content": "I received this the other day, and I love it so far.  I wanted Windows 7 because it's most like what I'm used to, which is Windows 95, 98, XP and Vista.  I've always had desktop computers (and an Ipad), so the laptop is new to me.  I'm not a novice with computers, but I'm not an expert either.  This was easy to set up.  I only needed one call to my internet provider to find out which number on my modem was the \"security key\" which Acer was asking for in order to set up the wireless connection.  I installed all the Windows updates thus far, and found a small manual online to better familiarize myself with the keyboard.  I'm getting better with the touchpad, but might purchase a mouse too.  My main use is e-mail and internet (some games, but not high-action ones).  I also plan on using it to watch DVDs.  Haven't tried the DVD player yet.  The Celeron processor isn't the fastest, but it meets my needs just fine!", "Date": "December 13, 2013"}, {"Title": "Solid workhorse of a machine, for a PC", "Author": "bmore", "ReviewID": "R1N316INKSAUIY", "Overall": "3.0", "Content": "This is a solid machine that's fairly simple to run after you delete all the bloatware and install some maintenance programs to keep it clean. I got two, one for my Mom, so I could walk her through IT issues.I've had it for nearly two months and it hasn't crashed or frozen on me yet. The battery life is excellent, and I get the full 6 or so hours it says I should. I'll leave the cord home if I don't think I'll be using it longer than 3 or 4 out in the wild.The display is okay and the speakers are weak, so not a Netflix machine, but I bought it for school, and it runs Access, Excel, and all my browser/social media needs quite well. It's fairly fast.But the touchpad is a disgrace. I turned it off and use a bluetooth mouse instead.Also, the build seems a bit flimsy. You need two hands to open it, I worry about how long the lid hinges will last, and the keyboard has a bit of give (gloss red is a bit tricky to keep the fingerprints off).I typically use MacBooks, so I'm used to higher quality in the interface - keyboards, trackpad, visuals and audio. If you can get over this and a Mac fanboy's aversion to all things Windows, I'd recommend it.", "Date": "December 9, 2013"}, {"Title": "Good value", "Author": "Pen Name", "ReviewID": "R3BHP7LFM1A304", "Overall": "4.0", "Content": "I bought this laptop a few months ago to replace my old one. I'm not a techie or anything , but it works well enough. Set up was simple and easy, and I have not had any problems with internet connection like some other reviewers have mentioned. I use this for school, as well as games and watching movies.", "Date": "December 8, 2013"}, {"Title": "super computer super price", "Author": "Gail Noland", "ReviewID": "R1TU4HTS804T4D", "Overall": "5.0", "Content": "Exactly what I wanted.  This is the windows operating system I prefer. The new one is too confusing.  Love it!", "Date": "December 8, 2013"}, {"Title": "Very pleased with this purchase", "Author": "kb in florida", "ReviewID": "R3DMS00C889718", "Overall": "5.0", "Content": "Exactly what I was looking forgot. Dreaded the time I'd need a new computer because I didn't want to go to Windows 8. This is my second Acer and I'm very satisfied with it.", "Date": "December 7, 2013"}, {"Title": "ACER", "Author": "Gill", "ReviewID": "R160PZHKQY1MGY", "Overall": "5.0", "Content": "I have another Acer Aspire and I found it to be user friendly...The new one just purchased was for my personal business use. I am a Real Estate Practitioner and needed a smaller laptop that would be easier to take with me on appointments and to and from the office.", "Date": "December 6, 2013"}, {"Title": "Acer Aspire E1-531-2438 laptop", "Author": "Joal", "ReviewID": "R954N2QMAZHSJ", "Overall": "4.0", "Content": "I don't give anything that I've only had a few days higher than 4, but so far, all is working well and it is meeting my needs, and I wanted Win 7 again, so I'm happy!  The keypad on this notebook had confusing options on it, but I found the Manual pdf camepreloaded on the notebook.", "Date": "December 6, 2013"}, {"Title": "Would definitely recommend", "Author": "T. Smith \"tennesseeguy\"", "ReviewID": "R1VJSQNEKFLXFC", "Overall": "5.0", "Content": "Great little box for the money! Good value and great performance at a reasonable price. I do recommend Windows 7 v. Windows 8. ;)", "Date": "December 6, 2013"}, {"Title": "Little sound", "Author": "rwh", "ReviewID": "R3R88BJ08O5YD8", "Overall": "2.0", "Content": "The sound on this laptop is horrible, If I would have known this before the purchase, I would have chosen a different one that I could hear.", "Date": "December 3, 2013"}, {"Title": "Acer Laptop", "Author": "Nancy Schabel", "ReviewID": "ROPY6WF0XO7UF", "Overall": "5.0", "Content": "absolutely love it, everything I hoped for in a laptop I would suggest, anyone that is interested, to go for it", "Date": "November 22, 2013"}, {"Title": "Great laptop", "Author": "wintersnow", "ReviewID": "R1VKKSC1B8LG8X", "Overall": "4.0", "Content": "Great laptop, esp. for the price.  Lost a star because I wish the volume was louder.Anyone looking for windows 7 at a bargain price should check this out!", "Date": "November 21, 2013"}, {"Title": "Had to return one, second is fine", "Author": "E. Nonymiss", "ReviewID": "RGJNHX6VRL005", "Overall": "3.0", "Content": "Had we not had to return a faulty one within the warranty period, I would have given more stars.  The second or repaired one is working as good as the previous name brands owned and comparable in use and appearance.  Service was fast and helpful.", "Date": "April 20, 2014"}, {"Title": "Pleased with purchadse", "Author": "Ronald Wynn", "ReviewID": "R327YP4T2GY6Y5", "Overall": "4.0", "Content": "Wanted a 15' laptop for my wife. This one looks nice for a used laptop and installed easily and is working fine.", "Date": "April 19, 2014"}, {"Title": "Nice, hardy.", "Author": "S.M. Dishman", "ReviewID": "R6MU9QDM5X5EE", "Overall": "5.0", "Content": "It's nothing fancy but we got this for my son to do schoolwork on. He also watches movies a lot on it using the DVD player, and external hard drive that he just plugs in or online (like Amazon Prime or Netflix). It's nice that the kids are going this direction now and we can save on our cable bill.", "Date": "April 16, 2014"}, {"Title": "Great laptop for the price.", "Author": "Bob Basil", "ReviewID": "R1RRL5TE87L5AJ", "Overall": "5.0", "Content": "I got this for my son's graduation a while back and he is still enjoying it for college work and a lot of gaming. My son says it is very fast and it responds well while gaming. He loves the fact that he can use his x-box controller to play his games.", "Date": "April 15, 2014"}, {"Title": "Simple and quick processor", "Author": "AmyFarahFowler", "ReviewID": "RUJ4VE3JSDJQI", "Overall": "5.0", "Content": "I'm no computer expert by any means but my first laptop was an ASUS gaming laptop that cost me $2k.  I wanted to replace it after 4 years...and I bought this Acer bc all i need now is a computer for my business. (Typing - surfing - spreadsheets) I haven't tried to play Sims or RCT on it yet... but as I have a gaming laptop still i will most likely use that one for games. Acer Aspire starts up very quickly - 20-30 sec from start to log in screen - keyboard is standard..and keys are NOT backlit. I find the battery lasts longer than my ASUS when unplugged avg: 4 hours (as long as you're not watching movies - then it lasts around 2hours) Overall I am very happy with my purchase... great price and a great little machine. =)", "Date": "April 1, 2014"}, {"Title": "Marvelous laptop", "Author": "TweenSteam", "ReviewID": "REJ591EJSWO4I", "Overall": "5.0", "Content": "Had to replace my old laptop because I spilled a drink on it and fried the motherboard and other components. Excellent laptop starts right up and runs smoothly! Very happy with my purchase. I would recommend it to any basic user for office productivity, surfing the web, classic board games, and checking emails. This came with Windows 7 Home Premium installed. It's very lightweight and performs flawlessly. Will buy another Acer again and would recommend it to any user for basic computing needs.", "Date": "March 26, 2014"}, {"Title": "Acer Aspire Computer", "Author": "obihan", "ReviewID": "R10GZRRLETQTKU", "Overall": "5.0", "Content": "Great laptop computer for the price.  It connect via WiFi (or Ethernet cable), and it has sufficient memory, a built-in webcam, a large screen, and a variety of inputs: USB, Firewire, SanDisk, HDMI.  With an HDMI cable, the computer's screen can be displayed on an HDTV.  It may also be possible to mirror the computer screen wirelessly but I have not researched this capability yet.", "Date": "March 25, 2014"}, {"Title": "A  great computer.", "Author": "Harold Roy,Jr.", "ReviewID": "R2H8TSML7QS35Z", "Overall": "5.0", "Content": "I have another Acer computer and I am happy with it. We needed another basic use computer and this Acer Aspire exceeds our needs. It  works great with my wireless router.", "Date": "March 25, 2014"}, {"Title": "Clear and easy to get going on", "Author": "V. Pierce \"owenparryfan\"", "ReviewID": "R18YDR0MPV7CSZ", "Overall": "4.0", "Content": "This laptop was extremely easy to set up. There was very little required on my part. The monitor is clear and crisp, action when surfing is fast, the layout altogether is easy to use. The flat keyboard is not my favorite kind, so I use a separate keyboard with indented letters. Easier for me.", "Date": "March 20, 2014"}, {"Title": "So Far, So Good", "Author": "M. Boring", "ReviewID": "R2BZI4HD6SF7MW", "Overall": "5.0", "Content": "I bought two of these when two of our HP laptops died at almost the same time after four years of ownership.  I didn't have or want to spend a lot of money, so I tried to buy the best computer for the dollar, and I think I have.  The Acer Aspire has worked very well for us, so far.  The one draw back is that the cursor likes to jump around which can make typing a paper or an e-mail \"fun,\" but other than that, it seems to be doing very well.", "Date": "March 19, 2014"}, {"Title": "love it", "Author": "Cathy Doring \"catndogs\"", "ReviewID": "R3J5IY5JP2XN3P", "Overall": "5.0", "Content": "Love it - everything works great, nice size, good price.  Was not familiar with the brand, tho some friends were - would buy an Acer product again", "Date": "January 13, 2014"}, {"Title": "everything we needed", "Author": "Kimberly ZAYas", "ReviewID": "RL394K9PNZ7Y8", "Overall": "5.0", "Content": "Good price.  Excellent for my young son to play games and learn a new language. He loves the screen size, yet it is not too heavy for him to carry about.", "Date": "January 11, 2014"}, {"Title": "Seem OK", "Author": "Leonne L. Broughman", "ReviewID": "R1KZJTGJSK9T9N", "Overall": "4.0", "Content": "Just got it and seem OK.  Had a previous acer that the screen went out on in a years.  Hoping for better", "Date": "January 11, 2014"}, {"Title": "item okay", "Author": "Susan S.", "ReviewID": "R2B0O37S108Y2U", "Overall": "4.0", "Content": "this item arrived quickly,the price was good and the the reviews were fairly good,but the the cursor has a tendency to stick,I'm living with it but it is a hassle.", "Date": "January 9, 2014"}, {"Title": "Great Laptop for anyone that isn't a Hardcore gamer", "Author": "Adam Boorstein", "ReviewID": "R1JHZH1VWXGGKF", "Overall": "5.0", "Content": "I love this laptop.  I had been on a search for a laptop for a few months.  I had an Acer Netbook which I bought 5 years ago.  It was getting slow, the mouse pad stopped working, and now with windows XP no longer being supported it is a time bomb.When looking for a laptop I was looking for one specific feature: Not windows 8.  I think Microsoft has lost it's way in trying to force it's mobile operating system on computers.  It does not work as well for a laptop or desktop.  It is a mobile OS and should only be on phones, mp3 players and tablets.  Microsoft also has a history of having a very bad OS every other release:Windows 3.1 = goodWindows 95 = badWindows 98 = good (the best)Windows ME = bad.Windows XP = goodWindows Vista = BadWindows 7 = goodWindows 8 = badSo the laptop had to have windows 7.  This met that requirement.  It had a 500 gig hard drive, 4 gigs of ram, a big screen, and a dvd drive.  And it was less than $500.It did come installed with a lot of garbage from the manufacturer.  But it only took an hour and a half to get all of it off.  Which is actually quite quick compared to other computers I've purchased.I am loving the machine.  Unless you are a hardcore gamer or music editor, this laptop is a perfect for you.", "Date": "January 8, 2014"}, {"Title": "Good for the money", "Author": "Patti Fons", "ReviewID": "R24LRDT3VQ8NCU", "Overall": "4.0", "Content": "It runs a little slow but I bought it for my mother who won't load it down with programs.  The reason I bought it was because it had windows 7 installed.  My only problem was the shipping (not with the seller).  I don't know exactly who delivered it, if it was UPS or UPS then USPS but whoever delivered it threw it at the front porch and left and let it sit in the snow.  You could see the marks in the snow where it was thrown there.  I was tracking the package so someone would be home but it came one day early.", "Date": "January 8, 2014"}, {"Title": "another student laptop", "Author": "jk", "ReviewID": "R5UZN9R5JSWYM", "Overall": "5.0", "Content": "Bought as Christmas present replacement for daughters Dell that was stolen via smash and grab from her car by a local crackhead.  I gave up on Dell as dealing with them anymore is incomprehensible, and Acer had the 2nd best failure record for 2013 (Consumer Reports).  It's what she needed for the price and is working just fine so far.  We already had the full student version of MS Office from last time and it's Windows 7 OS.", "Date": "January 8, 2014"}, {"Title": "Just what I hoped for", "Author": "Lauralee227", "ReviewID": "R2NQZ75Q8AF6YY", "Overall": "5.0", "Content": "Bought for our son.  He loves it.  It has worked as expected and it's everything we hoped it would be.", "Date": "January 5, 2014"}, {"Title": "great laptop", "Author": "L chance", "ReviewID": "R2N659LAWPO0T3", "Overall": "5.0", "Content": "this is my first laptop and I just love it. glad I made the purchase and it has windows 7 which is what I wanted", "Date": "January 5, 2014"}, {"Title": "Great product", "Author": "myers", "ReviewID": "R33JLYSLV5K4N3", "Overall": "5.0", "Content": "Great value at a great price.  5 stars.  Has been used for a month and is fast, and user friendly.", "Date": "January 5, 2014"}, {"Title": "Perfect for me!", "Author": "Marcy Hick", "ReviewID": "R7X81A5CK1SVD", "Overall": "5.0", "Content": "So easy to set up and even easier to use. Fast, safe delivery. Love it!!  I would highly recommend for the home user.", "Date": "November 15, 2013"}, {"Title": "Windows 7 Special!", "Author": "skohl \"skohl\"", "ReviewID": "R2UGDTKVE41WDX", "Overall": "5.0", "Content": "Excellent value for the price. I wanted a laptop that had Windows 7 on it and there aren't many options out there. Does everything that I need. Even has a web cam. Fast Delivery.", "Date": "November 13, 2013"}, {"Title": "Acers cool", "Author": "Born2shop", "ReviewID": "R3XR63JXZWXV7", "Overall": "4.0", "Content": "This laptop fits my needs.  I merely need it for surfing the net and creating documents.  I have one complaint and that is the keypad is off center.  I'm slowly adjusting, but initially made lots of mistakes typing previously.  Other than that, its a great product.", "Date": "November 11, 2013"}, {"Title": "Very good value", "Author": "KGB", "ReviewID": "R2TY2I35240DFF", "Overall": "5.0", "Content": "An inexpensive laptop that so far has performed well. Does all we ask. Windows 7 is a plus since we're moving up from XP. Primary use is for banking, email, Skyping with grand kids.Our samsung Galaxy tablet failed after an Android upgrade and still isn't fully functional 8 weeks later. So this is our interim machine until retirement, when we will go all Mac - Air in both laptop and tablet formats.", "Date": "November 10, 2013"}, {"Title": "works  great,  love  Windows 7", "Author": "pimpedlightsaber", "ReviewID": "R4SR4M3WBTV7C", "Overall": "5.0", "Content": "We bought this for our daughter to use at college about 3  months  ago,  and it works great.  Only downside was lack of MS Office,  but for the price I really can't complain.  Really  happy it has  Windows 7  instead  of Windows 8.", "Date": "November 10, 2013"}, {"Title": "Review", "Author": "Kalen C.", "ReviewID": "R344ZIBT54FGLY", "Overall": "4.0", "Content": "Only reason I do not give it 5 stars is because the speakers aren't loud at all. Other than that it was okay", "Date": "November 9, 2013"}, {"Title": "STILL HAS WINDOWS 7 !!!!", "Author": "Pug Lover \"Pug Lover\"", "ReviewID": "RVYH37T5FMZN4", "Overall": "4.0", "Content": "Great Computer for the price......and it has WINDOWS 7!!!! I did not want to learn a new operating system. All the local stores had windows 8. The only reason I am not giving this 5 stars is the mouse or (whatever are called where you use to navigate on a laptop) are a little stiff and very sensitive. Other than that........A GREAT PURCHASE!!!!", "Date": "November 8, 2013"}, {"Title": "Be wary of this laptop", "Author": "Ryan McCaslin", "ReviewID": "R318L9RP3ZVODU", "Overall": "2.0", "Content": "Product arrived and when first turned on worked fine, next morning screen failed and weird screechy black and white lines and jagged shapes all over screen =( Not impressed and I will be finding another Vendor to purchase a replacement laptop from since the one I got couldnt even last 2 days.", "Date": "November 7, 2013"}, {"Title": "Great laptop at a great price", "Author": "Amazon Customer", "ReviewID": "R22YM0Q2IGO1IF", "Overall": "5.0", "Content": "Very nice laptop for my sales people.  Very fast and the keyboard is spaced nicely.  It does everything I need it to do for a very reasonable price.", "Date": "November 4, 2013"}, {"Title": "Excellent purchase!", "Author": "Alain C. De Brousse \"Computer buyer\"", "ReviewID": "R19N7495L8HOIW", "Overall": "5.0", "Content": "Excellent product! We are familiar and like the operating system! We are completely satisfied with this laptop. There is plenty of hard-drive space.", "Date": "November 4, 2013"}, {"Title": "It Stole My Heart", "Author": "Kamie A. Scanlon \"NinjaPixie\"", "ReviewID": "R1S7QXJ2YWAXO1", "Overall": "5.0", "Content": "First why the 5 stars? Win 7! I love Win 7, I am not going to change to Win 8, and this laptop made it possible for me to stay with Win 7. Secondly, no issues one with it, things are loading and running fast, no keys falling off, no mouse getting a mid of its own. The package it was in, made it stay put in a secure spot. And, I must have either missed it in the description, but there is a built in webcam (for me bonus, but if it is in the description then not a bonus to you haha). The color is great, the sound is awesome! And best yet, did video chat just the other first time ever and there was no funny face pause sessions, could hear clearly from both ends. I really do not think I can think of anything I would want to change about this laptop. Unless it knows how to do house chores ;).", "Date": "September 10, 2013"}, {"Title": "Failed on Liftoff", "Author": "Gary", "ReviewID": "R2XCKIH962JXES", "Overall": "1.0", "Content": "I purchased this for my grown daughter as her previous lap top (of 6 plus years) was on the verge of expiring.  Since I am in Japan and she is in the states, I thought buying online a good idea.  Anyway, the computer was a dismal failure. She never even got it up and running.  Maybe it was a 'lemon' (it happens) maybe it was the OS she preferred to have installed. Anyway, a complete bust. Buyer beware.", "Date": "December 17, 2013"}, {"Title": "Locks up regularly", "Author": "Jan", "ReviewID": "RQC2YBODTC5JG", "Overall": "3.0", "Content": "Computer seems to lock up every day.  Have to take out battery and reinstall to get it to unlock.  Not sure why.  Maybe that is a problem with all laptops.  This is my first laptop so am still learning.", "Date": "November 3, 2013"}, {"Title": "Blue screen of death", "Author": "Old Techie", "ReviewID": "R382X8GA03C7SB", "Overall": "1.0", "Content": "The machine exhibited problems from the first time it booted up.  First the wireless went in and out, then multiple dumps to protect the unit after loading software.  Had to return the unit.  That part worked exceptionally well.  No unit available to replace the defective one.", "Date": "October 18, 2013"}, {"Title": "I expected a good laptop and that is what the Acer Aspire is.", "Author": "Gart", "ReviewID": "R1O5ZUF5V62MDF", "Overall": "4.0", "Content": "I give the Acer Aspire laptop a four star rating because I like it. I do not love it. it is, after all, a laptop computer. I do not sleep with it. I think \"love it\" ratings are stupid!It also works better than whoever keyed in my name for this review. Gart? Does anyone know someone named Gart?", "Date": "March 23, 2014"}, {"Title": "Acer Aspire", "Author": "denesha", "ReviewID": "R4VHZKKFU2XXP", "Overall": "4.0", "Content": "Its a pretty nice laptop, big enough but too wide. Besides that i love it and would recommend it to others.", "Date": "December 18, 2013"}, {"Title": "Newer isn't always better", "Author": "M. Elliott", "ReviewID": "R1E2Q9KRCXB6YD", "Overall": "2.0", "Content": "I got an Acer Aspire in 2010 and used the heck out of it.  When it died a month or so ago, I found this Acer.  It is a bit smaller than my first one, but it had Windows 7, and I reckoned it would be the same as my old Acer.  WRONG!  It came preloaded with all kinds of crap that I had to clear out, the cursor jumps all over the place (I bought a new mouse, but the mouse wasn't the problem), it freezes up at least once a day, Firefox browser doesn't work well at all on it, so I had to go back to IE, and the sound level is barely above a whisper.  One would think same brand, same model (only newer), same OS--things should be great.  Not so.  I have had it too long to return now, but I sure won't be buying another Acer.", "Date": "December 10, 2013"}, {"Title": "Good deal- good laptop", "Author": "findjul", "ReviewID": "R1YAGDUTTSXHER", "Overall": "5.0", "Content": "I purchased two of these and they are both performing well. I feel like I got a good deal on these and would repeat the purchase if I were in the market for more.", "Date": "December 8, 2013"}, {"Title": "Great little laptop", "Author": "Bruce Puckett", "ReviewID": "R3DHMV5GL4DSMK", "Overall": "4.0", "Content": "If it did my work for me, I would give it a five. I only give 5's to Pecan Pie and strong coffee.", "Date": "November 19, 2013"}, {"Title": "not stable", "Author": "R R.", "ReviewID": "R1BLG9FS7UA28W", "Overall": "2.0", "Content": "had to reboot 3 times the first week. The one before it locked up twice in one day before I sent it back. This one is on thin ice.", "Date": "November 13, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CU2K35I"}}