{"Reviews": [{"Title": "Amazing machine!", "Author": "Noj", "ReviewID": "R3DP3545FDVAGT", "Overall": "5.0", "Content": "This laptop is everything you'd expect from a high-end gaming laptop. From inside to outside, all features and components have been designed for top notch gaming performance.This particular model utilizes Intel's latest CPU- the 4th generation i7 8 Core processor which packs more processing potential than most users will ever need.This model is loaded with 16 gigabytes of DDR3 RAM and is upgradable to 32 gigabytes. This is more RAM than most games will recommend for system requirements.The GPU is Nvidia's latest mobile model- the GeForce GTX 770m. Packing 3 gigabytes of super fast GDDR5 dedicated VRAM this bad boy will push high frame rate benchmarks even under high graphical settings. Some games will drop significantly in frame rates under super max video settings due to poor game run engines but I have never been happier with graphics performance since purchasing this laptop. This system also comes equipped with a super cooling feature at the push of a button. The fan system will kick into high gear and DROP temperatures of the CPU and GPU to extremely admirable levels making this laptop very versatile. This mobile GPU is second only to the GeForce GTX 780m which is Nvidia's top GPU model.Three USB 3.0 slots. Two USB 2.0. Top of the line networking adapters for WiFi, LAN etc... The keyboard is the new SteelSeries with a customizable backlit keyboard that may be adjusted at the touch of a button. I have to stress how comfortable and responsive this keyboard is. I have never type so fast on another keyboard. The keyboard on this laptop is truly a wonder in and of itself.The sound system is remarkable. Three speakers- left, right and bottom. Crisp and clear sound. No crackling or muffling. Even has some bass to it. The sound system is the best you can get for laptops. You won't be disappointed.THE ONE FLAW...This particular model comes with only a 7200RPM HDD. It has an open bay to add a solid state drive which will greatly increase performance when and if you upgrade. The system comes with a mounting bracket specifically for this SSD upgrade. It will be located inside the box with the power supply in a sealed bag. Windows will score this laptop at a very insulting 5.9 due to the HDD being the lowest sub score. The processor and memory score a whopping 7.9 and the graphics/gaming graphics score a very nice 7.1. Once upgraded, this laptop will score an all around 7.1.Buyers will be pleased nonetheless. I am so happy with this system.", "Date": "June 5, 2013"}, {"Title": "Almost perfect!", "Author": "Valentine Palazkov", "ReviewID": "R3Q07GPN895XY4", "Overall": "5.0", "Content": "Got it about 3 weeks agoQuite powerful. I can use it for both development and gaming.The sound system can be set to much more louder level than it was in my previous laptop -- HP TouchSmart (which is good if you are going to watch movies without headphones).Only one thing that seemed not to be perfect -- I can clearly hear HDD and other electronic noises in my headphones, so consider buying external USB sound card if you like listening to music and have a good pair of headphones.", "Date": "August 27, 2013"}, {"Title": "I am satisfied with the machine", "Author": "I. Koch", "ReviewID": "R8BS5RNUT03X", "Overall": "5.0", "Content": "I have had no problems with this machine.  It came and works as advertised.  It was my first win 8 machine.  I thought I would not like win 8, but I do.  You just have to consider the tiles as the start menu, then it makes sense.  Basicly it is windows 7 after that.  Just remember to turn off protected mode in IE security settings and disable active filtering. ASome of the driver software uses http to communicate for updates and it will jack all of that up and throw errors on boot if you don't adjust those settings.  It games well.  Seems pretty stable. I Have no complaints.", "Date": "January 8, 2014"}, {"Title": "Quality for a reasonable price", "Author": "Tom Wacaster", "ReviewID": "R3NZJ75Z7RB1D6", "Overall": "4.0", "Content": "I am very happy with this laptop.  Being unfamiliar with the MSI brand, I had reservations concerning quality, but I went ahead and bought it as a gaming machine, and it has not disappointed.  I also use it for software development (mostly Java and android programming so far).  The only real complaint I have is the Page Up and Page Down keys also double as the Home and End keys via the Fn key.  This isn't that big of a deal for most users, but for a programmer this is a serious pain.  I probably actually use Home and End more often than I use Page Up and Page Down.  But aside from this annoyance, this machine has performed and continues to perform admirably.  It is what I am using right now to right this review.", "Date": "December 15, 2013"}, {"Title": "Excellent Desktop Replacement", "Author": "Ben", "ReviewID": "R34V0ZW4SL9AR5", "Overall": "5.0", "Content": "Received this two weeks ago and so far its been amazing.  It's handled any game I can throw at it right out of the box and can be moved around anywhere in the apartment, which is the primary reason I bought it.Pros:- Minimal Bloatware, updated the AV software and otherwise good to go.- Quiet, yet very powerful- Very large screen with great resolution for both gaming and moviesCons:- It is large and heavy, should be expected since its a 17\" laptop - but i was still a little surprised.  Its a desktop replacement, not a traveling laptop.- Not in love with Windows 8, but not MSI's fault.I would recommend this to anyone looking for a solid gaming desktop replacement.", "Date": "November 22, 2013"}, {"Title": "MSI GT70 2OC-059US", "Author": "Peter B. Hodson III", "ReviewID": "RA6X6H7SVKEY", "Overall": "5.0", "Content": "Great performance for the money. All of the inputs / outputs required to be a portable desktop and can drive the laptop screen and 3 other monitors simultaneously. Bought a 500GB SSD and migrated the contents of the hard drive to it and the performance is excellent. 8 seconds from power on to desktop. Typical gaming machine bling but necessary to get the attention to detail in hardware selections from the manufacturer. Video and audio performance is very good. Great machine with no problems thus far.", "Date": "December 3, 2013"}, {"Title": "Great performance value", "Author": "Brent Gibson", "ReviewID": "RVI6DN2JCHP4K", "Overall": "5.0", "Content": "Had this about a week and with exception of Windows 8 (not an MSI issue) I'm very impressed and happy.  Quality feel; doesn't feel plastic and cheap.  Keybaord is responsive and quiet. Backlighting is nice as it helps in low light situations.  Screen and display is crisp and bright at 50% brightness.  Battery charge is decent if the Nvida GPU isn't engaged.  Runs quiet as well but when the fan revs up under load it will be noticed; louder than most desktops I think.I've only run into 2 issues and potential issue, which I haven't yet figured out: 1) Nvida drivers won't update, 2) Sims 3 will not run.  On 1), the driver update will start to Install then fail due to not finding \"compatible hardware\".  Everything seems to be working with Nvida graphics; Device manager shows its working properly, Nvida driver website recognizes the GPU and recommends the driver update.  Running it or saving it and then running it locally results in the same error.On 2) the game loads fine but when it enters game mode from a typical install and game updates from launch console, Windows displays a messages that it had problems and is terminating the TS3 program.  Made recommended adjustments the DEP and then game goes into \"game mode\" but then blacks out\".  Sometimes get a popup saying TS3.exe has been prohibited from accessing graphics hardware.  Only way out is hard reboot.  The kids weren't happy but I uninstalled the program and will continue to look for a solution.  THe potential issue deals with the BD burner not always recognizing a disc I load.  SOmetimes I'll have to open and close the drive several times before it will recognize its loaded and display in Explorer.Win 8 is just a terrible interface for laptop/desktop use.  Not efficient at all.  Some movements from the mouse or touchpad will take you from your app or desktop window to the tile window.  Just very annoying.If you don't want a big and heavy laptop then don't buy this.  The physical specs are pretty true; it's big, barely fits in my Victronoix messenger which is for most 17\" laptops.  The power unit is also big and heavy.  It's 180W supply so be ready.", "Date": "September 1, 2013"}, {"Title": "Great lap top", "Author": "Lyle", "ReviewID": "RKLGGCLI2YIQ8", "Overall": "4.0", "Content": "As advertised and more. It works better than any of my friends. I would recemmend it to anyone looking for a fast and affordable gaming lap top.", "Date": "January 8, 2014"}, {"Title": "Great laptop", "Author": "WDT", "ReviewID": "R3PAK5QLBE1QNJ", "Overall": "5.0", "Content": "I am more than pleased with tbe MSI GT70 laptop computer.  It is powerful and fast; however, a bit heavy.  I highly recommend it.", "Date": "November 2, 2013"}, {"Title": "Great laptop...great Amazon customer service", "Author": "Emil Bodenstein", "ReviewID": "R29OUAKSAC9NSV", "Overall": "5.0", "Content": "I received my laptop and within 3 hours it lost all power and would not turn on. Because I am by no means a computer expert I brought it to a computer repair center locally where that my friend owns. They confirmed it was a defective machine. Amazon shipped me another one next day. (I had paid for next day when I ordered) If I had to go through MSI it would have taken weeks. This confirmed why I love to purchase through Amazon Prime.As for the laptop, when I received my replacement I brought it to the computer shop and they updated to 8.1 and took off Norton Anti-Virus for ESET NOD32 Anti Virus. $59 for 2 year which I am very happy with. Seems to work great without messing with performance. I do not game and bought this for video editing. Have Adobe Creative Cloud and this can handle everything I need and then some. Very sturdy build but I can still bring on the road if I need to do video editing. Most of my travel is in the car. Only wish for me is if the mouse pad was a little bigger but everything else is great including the keyboard which was important to me.IMPORTANT: Tip I learned from the computer repair center. When updating computer. After you update Windows get all the updates for the driving for Nvidia, Killer, etc. from the MSI website. They have a Live Update app that will pull all updates for all the devices for this model computer for you. If you get the updates from the company website you could have compatibility issues.", "Date": "February 22, 2014"}, {"Title": "Nice laptop", "Author": "tongtong.wu", "ReviewID": "R2PAPM8JZ2QP", "Overall": "5.0", "Content": "I think this is a very good laptop. It is worked very well. But it is a little heavy, Not easy to carry.", "Date": "January 19, 2014"}, {"Title": "Great product, fast shipping", "Author": "Kathryn Hefner \"Sloane\"", "ReviewID": "R1IDBTSZTHGN9E", "Overall": "5.0", "Content": "Arrived quickly, in good shape, and is hands down the best laptop my son has ever had. No more complaining about games not running, locking up, bad video graphics, etc. Great investment!", "Date": "January 9, 2014"}, {"Title": "Disastrous wifi issues", "Author": "James A. Cummons", "ReviewID": "RXJCZH93D8D7I", "Overall": "2.0", "Content": "This is my second MSI gaming computer. the first one lasted 6 years. this one is nearly unusable for gaming.The Pro's are:A very good processorlots of fast ramgreat video card7200 rpm hard drive.not a ton of useless bloatware, but enough to annoy.The cons are:Windows 8 is not very good for gamingThe Network card software conflicts with a lot of win 8 features.The problem with gaming is, the Killer Networking card constantly disconnects from the wifi router. have changed the router twice to no avail. have updated the drivers and the firmware, to no avail. have updated every driver for every piece of hardware on this machine. to no effect. have tried every NIC configuration I could find recommended. to no avail. some fixes helped a little. some made it worse. none resolved the issue. this issue with this card and windows 8 and 8.1 is rampant. it is all over every forum for every computer that uses this card. while apparently it is not an MSI issue per say, they are who put the ruddy thing in here. after two weeks of updating and tweaking I hate to RMA this thing and have to upgrade all the drivers and the OS from 8 to 8.1 again, but I may have toThe", "Date": "January 4, 2014"}, {"Title": "So far, so good!", "Author": "Pablo", "ReviewID": "R3HA9TTUJEL1IY", "Overall": "5.0", "Content": "So far, so good! I did a lot of research and if you're looking for a gaming laptop this is the one for not such a high price, I mean it's beautiful and powerful the only bad thing about this computer is windows 8 which is a crap I hate it! But  we can't blame the computer for that, MSI has all the driver for win7 in case you want to do a downgrade, they also offer a good customer support you can send them an email anytime and they will answer soon.This laptop's warranty is for two years so there's no risk if you want to buy it but don't know if it's a good brand. Check out NVidia's website they recommend MSI.", "Date": "November 20, 2013"}, {"Title": "Amazing speed", "Author": "bmlima", "ReviewID": "RQ91UGSPSBL9U", "Overall": "5.0", "Content": "That's a laptop for serious gaming... no negative points at all. Some say about the heating, but it is just great, I can stress the card a lot and still got cool temperatures.", "Date": "October 21, 2013"}, {"Title": "Fast & powerful machine", "Author": "Z. Smith", "ReviewID": "RIQ5K1265FXS4", "Overall": "5.0", "Content": "I upgraded to this laptop from a previous MSI laptop and I couldn't be happier. It has top of the line specs, and the Windows 8 operating has been a pleasant surprise. The first game I wanted to play was Battlefield 4, and this beast of a machine runs it on a mix of high and ultra settings at 1080p without a hitch.It is quite heavy, but that is to be expected of a  17\" gaming laptop with a dedicated card like the 770m. I'm a strong guy anyways so it feels quite 'normal' in my hands.", "Date": "December 8, 2013"}, {"Title": "The best laptop you can get.", "Author": "MoonDragon", "ReviewID": "R379IA31AULDR2", "Overall": "5.0", "Content": "My friend bought this for me. This laptop does it all. I was running World of Warcraft on the highest settings, while League of Legends was running in the background, along with Prime World, and it ran ALL of them at 60FPS just fine. (Note: I did have the turbo on.) If you have the money, I would definitely get this bad boy.", "Date": "November 28, 2013"}, {"Title": "awesome machine", "Author": "Samayra", "ReviewID": "RT91V0WUSG3WH", "Overall": "5.0", "Content": "I am very Happpy with this machine,run great...Perfect for gaming...I love This Machine so muchhh...xD, my kids like this machine to play some games online...xD", "Date": "April 22, 2014"}, {"Title": "The power of a PC in the convienence of a laptop!", "Author": "panthor \"ken43733\"", "ReviewID": "R2ZSMBZHXBQL2F", "Overall": "5.0", "Content": "Excellent notebook. I was given an MSI GX620 notebook from my previous company as a reward after completing a project for them and I have had no trouble with that laptop at all and I've put it through just about everything you can possibly throw at a computer - video editing, web design, running continuously, etc. so I figured I would stick with MSI for a new laptop and have had my eye on these G series models for well over a year.The only complaints I have is only to do with Windows 8/8.1 driver support so that is not really MSI's fault at all. I have discovered that basically the only USB 3.0 devices that I can use with this laptop are the WD Passport series hard drives. Any other type of a USB 3.0 device will really cause problems and/or not even be recognized at all. Before trying this notebook, I tried a new HP Touch Smart Envy laptop and I had no problems with any other USB 3.0 devices on that. I guess MSI uses the Intel USB 3.0 eXtensible Host Controller and HP uses a different model. There are lots of problems with the Windows 8 drivers on the Intel USB 3.0 host controller and neither Intel or Microsoft want to release a new more compatible driver. But that's rumbling again and has nothing to do with MSI.The other complaint is that this one only came with Windows 8 instead of the new Windows 8.1. Microsoft says that you can easily do an upgrade from Windows 8 to Windows 8.1 through the Store, which would be fine and dandy if they would give you the option of performing a clean install instead of only making you upgraded the current version to 8.1.  I have tried over and over again to upgrade and can never get the upgrade to result in a perfect Windows 8.1 system. However, I have no problems with performing a clean install of 8.1 and everything runs smoothly and flawlessly. I hate the original Windows 8 and really cannot stand it. Microsoft never should have released 8 because it wasn't ready. 8.1 does a really great job to finish the operating system off and make it more complete and polished. In fact, I really like 8.1 a lot better than Windows 7! Anyway, I ended up going out and purchasing a copy of Windows 8.1 Pro (on sale) to use so that I can do the clean install and not have to bother with all the problems of upgrading Windows. It would have been nice if MSI could have shipped this machine with 8.1 on it instead so that I would not have needed to purchase a full copy of it. All I would have needed is just an ISO image of 8.1 and I'd be all set.", "Date": "April 4, 2014"}, {"Title": "Great high-end gaming laptop for the price.", "Author": "Rhett Facer", "ReviewID": "R2TZTTOLCNCE9L", "Overall": "4.0", "Content": "Great high-end gaming laptop!  It feels very solid, and the keyboard isn't too bad for a laptop keyboard.  Runs all of my games on highest graphic settings.  Doesn't seem to have any overheating issues.  The webcam is turned off by default unless you use a keyboard command to turn it on.My only complaint so far would be the integrated Intel graphics card and nVidia graphics card conflicting with each other, and sometimes the integrated card will try to run a game instead of the nVidia GPU (I'm guessing this is designed this way to save battery life when not gaming).  This is fixed by setting power settings to \"high performance\" and making sure that the nVidia graphics card is selected as the primary GPU under the nVidia control panel.  In my case, I had to reinstall my nVidia GPU drivers in order to set the nVidia GPU as the default GPU properly.The keyboard LEDs don't serve much purpose but it does make it look pretty (you can customize colors and set lighting patterns based on 3 keyboard sections), and makes gaming at night time nicer.Also, I installed a 512GB Samsung 840 Pro SSD as the primary drive, and changed the 750GB HDD to a secondary data drive.  With Windows 8 and the SSD, boot up time is frighteningly fast! (about 8 seconds).Lastly, if you need a carrying case for this, I'd recommend a backpack style carrying case so that you have room for your accessories.", "Date": "March 27, 2014"}, {"Title": "Fantastic gaming laptop for a more than reasonable price.", "Author": "Frederic Blin \"Nodbuddabag\"", "ReviewID": "R2NSM5H5NRUY99", "Overall": "5.0", "Content": "If you are looking for a gaming laptop that has all of the necessary power and quality you are looking for for a computer of that caliber you will not be disappointed with this one especially when you take the price in consideration.  I can't believe what a good deal this is and anyone looking to spend this much will be very hard pressed to find any PC gaming laptop out there that is better than this one from pretty much every perspective. I recommend this item to anyone that is willing to spend the stated amount.  You won't find better for this price.", "Date": "March 25, 2014"}, {"Title": "Beast", "Author": "ahsanomar", "ReviewID": "R198S3S3PVQOXM", "Overall": "5.0", "Content": "Looks and performs like a champRuns Planetisde 2 at 1080p ultra at ~50fps without overclock, ~70fps on high with max render distance and fovPlayed for a couple of hours straight and fan didnt even have to go much above normal", "Date": "March 3, 2014"}, {"Title": "¡Great!", "Author": "Amazon Customer", "ReviewID": "R1DCHOE2FGUIWE", "Overall": "5.0", "Content": "Though it is a little expensive, it's the best laptop for digital games lovers (it doesn't mean that you can ONLY use it for that, of course).", "Date": "January 6, 2014"}, {"Title": "Smokin'", "Author": "john bravo", "ReviewID": "R1OWCF4I80PSNM", "Overall": "5.0", "Content": "Win8 new MUI is a pain in the rear!I purchased laptop for gaming.  This laptop is a heck of an upgrade from my older model.  No more msgs during game play that my machines video setting is slowing down the game and no more lagging due to built in Killer Network feature!!", "Date": "September 12, 2013"}, {"Title": "Almost Perfect", "Author": "Amazon Customer", "ReviewID": "RELMAUYQVB8IE", "Overall": "4.0", "Content": "I looked a long time before I chose the MSI GT70 20C-059US. It had the 16gb RAM memory, 3gb video RAM, 17\" screen size and 1080 HD clarity I was looking for while still being portable. I like the look and feel of this machine even with the learning curve of Windows 8.1... where I was a little disappointed is in the touch screen ready aspects. This is not a touchscreen, it is a touchpad with gestures of a touch screen enabled... sometimes those gestures work, sometimes not so much. Would I buy it again? Probably - it feels substantial and looks great. It is a bit of a battery hog but with a 17\" screen and 16gbs RAM that was expected. Its expensive when compared to other laptops, but not compared to comparable laptops. MSI has responded to any questions quickly and pleasantly... so would I recommend it? Yes as long as you understand Touch enabled doesn't actually mean touch-able!", "Date": "February 20, 2014"}, {"Title": "Best laptop I have ever owned.", "Author": "Robert L. Skelley", "ReviewID": "R3AP0Y2FB4NG97", "Overall": "5.0", "Content": "a great gaming computer, works very well for those times I have to work as well.  A tad bit heavy, but a lot lighter than my desktop and just rocks when you use it.", "Date": "December 11, 2013"}, {"Title": "The Pinnacle of a Portable Performance Powerhouse", "Author": "The Yeti", "ReviewID": "RQCACSBDDQR9", "Overall": "5.0", "Content": "This laptop is a powerhouse. I didn't know what kind of performance I would get out of it, but MSI definitely delivered. After running it through some stress tests for a few hours, the bottom of the machine was barely warm -- talk about heat management! This is a great, great deal, I absolutely recommend buying it.Pros:- Big, Clear Full HD Display- Customizable Backlit Keys- Immersive Audio- Performance is out the roofCons:- Battery life drains relatively quickly, especially if on the 'high performance' setting", "Date": "April 1, 2014"}, {"Title": "Good computer", "Author": "Dante C.", "ReviewID": "R3MBOQGQVZ9SBW", "Overall": "4.0", "Content": "I choose this rating because I feel it is really a good and powerful computer. The game experience is so good that I must finish writing this review and back to my game.", "Date": "March 29, 2014"}, {"Title": "Real nice gaming laptop", "Author": "Dave from EC \"regular guy\"", "ReviewID": "R1DBOVF2XA8CP1", "Overall": "5.0", "Content": "I'm reviewing this for someone else who uses the computer most of the time, but I have used it myself for routine activities, not gaming specifically.  For the price, which isn't the price you can always find it on Amazon for, this was a great value.  The components are comparable to high end laptops like Ailenware, but the computer costs less!  Starts up in 20 seconds or less so the spinning HD is very fast as it is.  Overall the computer is very cool looking.  The keyboard feature that lights up the keys and allows you to change the color pattern is really cool.  I think this feature is to help you focus on only those keys you use for gaming by lighting them up a separate color.  Even if it really has no purposeful function, I can tell you it wows a teenager.  The typing on the keyboard is very nice and effortless.  The computer has metal case components that make it very sleek.  Windows 8 takes getting used to, but its ok I guess.  I think I need to learn how to get the most out of it.  I have been using Vista previously so I'm behind the times OS wise.. Regarding the gaming, I have to say my son has not complained about any game he has played on it.  The 3GB DDR5 memory video, I believe, is a great feature of this computer.  It has good cooling.  Due to my mess up and/or a problem with Windows 8.1 upgrade (that my son downloaded after we had bought the computer) disabling the recovery disc function on the computer, I also had to call technical support for help.  They sent me new recovery discs and got them in 4 days or so, FOR FREE.  Very nice of MSI (they said Windows 8.1 upgrade was messing up recovery function on their computers for a lot of people).  I have to say I really liked the technical support guys in CA.  They helped me very efficiently and weren't worried about finding reasons to say they could not help.  They even answered general questions I had about installing an SSD HD so I could make the computer even faster.  I am VERY happy with MSI's technical support, such that if I bought another computer I would have to consider MSI again, because I know I can count on HELP!  I bought the computer from Amazon Warehouse deals and I'm happy with the savings.  All in all I couldn't be more happy with the decision to buy MSI from Amazon.", "Date": "March 23, 2014"}, {"Title": "Awesome laptop", "Author": "Amazon Customer", "ReviewID": "R38SZ0YKJBL5BU", "Overall": "5.0", "Content": "So far I have had this laptop for 2 months it has lead me through school and my gaming the pros are that there is very good specs ram,cpu,gpu etc. so far I have used it for youtube and I am able to play games whole in. Recoding at 30 to 45 fps on high or normal if anyone wants to check out my channel it's Steven bran", "Date": "February 23, 2014"}, {"Title": "Glad", "Author": "Erik Iturbe", "ReviewID": "R2UJBRR0TR3AVL", "Overall": "5.0", "Content": "Fast, loud, sexy, great price!!!  Had an Asus g71 this is first msi but very nice puter!  I am not disappointed.", "Date": "December 30, 2013"}, {"Title": "got a defective one", "Author": "Tony", "ReviewID": "R3VDW4SICJH4V0", "Overall": "1.0", "Content": "crash suddenly when I was skyping and gaming at the same time, and later on it  lag sometimes. maybe I am unlucky to get a bad one.", "Date": "January 1, 2014"}, {"Title": "AWSOME MACHINE", "Author": "the best", "ReviewID": "R2OT2MJNK9LLJC", "Overall": "5.0", "Content": "THIS LAPTOP HAS AN AMAZING SET OF PROGRAMS AND CAPABILITIES NOT FOUND IN THE NORMAL LAPTOP.RAM IS THE MOST IMPORTANT ITEM ON A COMPUTER. THIS HAS PLENTY.", "Date": "March 2, 2014"}, {"Title": "its a perfect laptop but... the drivers", "Author": "Daniel", "ReviewID": "R3GC9GID7CG8O7", "Overall": "2.0", "Content": "I've choose 3 stars because the laptop has some problems at the startup and I have to restart it 3 times to start well.for be specific... when you press the button to turn it ON, the circles of Windows system not appear or doesn't move so I have to restart again. after a week, when i've turned off the bluetooth the option in windows 8.1 was deleted, so I can't use the bluetooth, and the pad is working very bad, the battery calibration never ends, and the most important problem.... WHEN I PUT THE CD OF THE ORIGINAL DRIVERS, THE SYSTEM DOESN'T READ THE CD AND APPEARS AS IF THERE IS NO CD IN THERE. I WANT A FULLY REPARATION, I HAVE 2 YEARS MORE OF WARRANTY IN MSI, NOW I WANT OBVIOUSLY USE IT THE PLAN OF WARRANTY.THIS ITEM ARRIVE DEFECTIVE, I WANT MY LAPTOP REPAIRED.I WILL RECOMEND THIS TO A FRIEND??? IF THERE WERE NO DEFECTIVES LAPTOPS.", "Date": "December 28, 2013"}, {"Title": "Hopes soo high... deeply disapointed....", "Author": "Nesgon", "ReviewID": "RYWAMWC4NGOGK", "Overall": "2.0", "Content": "Let me just say i looked for at least 2 months before making the decision to buy this computer. Specs , price , reviews all over the place the whole 9 and finally made my mind on the MSI Laptop. Im not in the states so i had it shipped to a friend who in turn shipped it to me pretty much in the other side of the world needless to say to return the product was never in my mind and in this case was never an option.I have to say even though the product is working ok...iguess... boot time takes just as long as my other low end computers. the back part is a fingerprint magnet it NEVER looks clean. And the part that really broke my heart is the fact that right under the spacebar next to the mouse pad lock button theres a bump on the glossy marquee ( dont really know how to call that part) that leads me to believe the laptop suffered tampering or its deffective or something. the best way to describe it would be to take your finger and put it on the lower left  on the part where the left Ctrl Key meets the glossy border and fllow through to the right you will feel a bump and 2 depressions along the way. The middle of the keyboard is a bit raised as well in the middle section .im hoping someone will tell me this is normal cause if not i made a HUGE mistake on trusting MSI.I will elaborate later on as to the complete performance of this piece later on but right now i cant say im happy, im left with a bitter taste of disapointment and the what if ..... What if i had gone with alienware or Asus G series", "Date": "September 27, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel® CoreTM i7-4700MQ 2.4GHz; up to 3.4GHz w/ Turbo Boost\n16 GB DDR3 RAM\n750 GB 7200 rpm Hard Drive\n17.3-Inch Screen\nWindows 8", "Name": "MSI Computer Corp. MSI GT70 2OC-059US;9S7-176312-059 17.3-Inch Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/41AASeZWrTL._SX300_.jpg", "ProductID": "B00CU9GLX4"}}