{"Reviews": [{"Title": "the best", "Author": "learner of life", "ReviewID": "RI2YUWNTFQIIR", "Overall": "5.0", "Content": "this laptop has a beautiful and bright screen for watching dvds or surfing the web. The processor is incredibly fast. And, the hard drive has ample space. I highly recommend this laptop! It's a great purchase. :)", "Date": "June 13, 2013"}, {"Title": "Awesome Lightweight Champion of Laptops", "Author": "MrDan3184", "ReviewID": "R3AFPVBK2NBBE9", "Overall": "5.0", "Content": "I own three all fast and snappy (if one keeps it clean), all windows 7, not the win8 garbage. Yes the processor is \"weak\" in Ghtz, but I can play any modern game I can throw at it (low settings) and photoshop with ease. A good all around laptop for average users. Do not expect this to be a power house with a 18 watt processor. I put an SSD in one and I see little difference, snappier, but little difference in speed (due to processor low Ghtz) other than that it only consumes 20 watts of total power consumption now (with SSD) compared to less than 40watts before with a spindle hdd. I recommend this to all my clients who are just average, go online, play lite games, check email, etc., users. 100% satisfaction so far, and my clients. Also, its pretty lightweight. HP did it right and AMD did it better with their baked in graphics card right in the processor. Oh, yeah and its dual core. I love it.", "Date": "June 13, 2013"}, {"Title": "processor", "Author": "jason", "ReviewID": "R20TG3XJQQ4FAM", "Overall": "2.0", "Content": "the processor is very slow on this laptop . The surface is very easy to get scratch .overall it could just be used for simple work .", "Date": "June 3, 2013"}, {"Title": "good buy", "Author": "Briana Phouthavong", "ReviewID": "R1VLLFYOJB60X6", "Overall": "5.0", "Content": "I've used it everyday, it's a good computer but I'm not a big fan of Windows 8. Sometimes lag on full screen YouTube.", "Date": "September 16, 2013"}, {"Title": "hard to navigate", "Author": "Jennifer", "ReviewID": "R2SNHYFDNV4PX2", "Overall": "2.0", "Content": "I find that I hate the preloaded windows 8 software and my \"old\" laptop is my go to lap top. I bought this one with the intention of replacing the old one but in comparison now refuse to give up the old one.  The screen is overly sensitive,  difficult to navigate and seems to have its own problems with streaming continuously from its \"apps\" that my other laptop,  tablet and smart phone running off the same network don't have. Originally bought with intention of buying updated microsoft software and decided against it after getting this laptop.  Ended up giving it to my young daughter (and now she is frustrated). I purposely don't even have antivirus software on there secretly hoping it will cease to work so I can toss it guilt free.", "Date": "June 5, 2014"}, {"Title": "Garbage... plain and simple", "Author": "Jay", "ReviewID": "R8QO3QPO2F2B1", "Overall": "1.0", "Content": "If all you were ever going to do on a computer was type reports for say, school projects, than by all means by this computer. But for ther rest of the world, with Netlix accounts, or avid gamers. This is a sore disappointment. it can't even run simple movies off of the DVD drive without being overloaded and crashing.", "Date": "August 28, 2013"}, {"Title": "windows 8", "Author": "Patricia Varanai", "ReviewID": "R1W0G3P6OOB38O", "Overall": "4.0", "Content": "I am not a fan of the new windows 8. I do not like the tiles, I find them like looking at a puzzle. This may be good for touch and for children, but it simply annoys me. I want a start menu listed, one that is organized. Otherwise, the machine works well and I am happy with it.", "Date": "June 25, 2013"}, {"Title": "Excellent", "Author": "Anthony K.", "ReviewID": "R5JYKOZD0OTUL", "Overall": "5.0", "Content": "It is really good as expected. So I loved it. So please continue to do a better job. Thanks and peace", "Date": "July 3, 2013"}, {"Title": "hp", "Author": "dwayne", "ReviewID": "R186NCRYZUY756", "Overall": "1.0", "Content": "I don't like it bacause it too slow d curser movement I dnt lke it I rather a windows 7", "Date": "October 2, 2013"}, {"Title": "advertise to be new but it wasnt", "Author": "carlene Hernandez", "ReviewID": "RM7IO3315TE9R", "Overall": "1.0", "Content": "buying this laptop felt like a scam . it said open box  ( new ) i really taught it  was just the box open .  this laptop was used . the sad part for me in live in trinidad and it would of cost me a fortune to send it back . the seller gave me back 20 dollars lol .", "Date": "June 1, 2013"}, {"Title": "HP laptop is very nice.", "Author": "stanley sayler", "ReviewID": "R1MANVSDLKJWP5", "Overall": "5.0", "Content": "Very nice machine. Has windows 8, and 8.1. took me a little bit to get used to from 7.  But really like it now. All I expected.", "Date": "January 26, 2014"}, {"Title": "Good Value..major exception", "Author": "fairplay4all \"rjheckma\"", "ReviewID": "R2XN2AJZHZBLIG", "Overall": "1.0", "Content": "This PC is satisfying my needs in every way. It is not a superspeed, metal case computer; but then again that's not what I wanted or was willing to pay for. It is not the fastest computer, but I need it mostly for email and internet browsing for which it does a good job. My only concern is \"will it be reliable?\". With this price point, I do hope they still built in HP reliability.PRO...........one of the last 15.6 PC's out there without a numberic keypad. For me that is a huge plus.CON...........if you want to get to the hard drive you basically have to take the computer apart to get at it. I am used to removing two srcews and sliding them out. I have also determined that this computer will support windows 8 only. You cannot load windows 7. Major flaw and reason to return this extremely limited computer.", "Date": "June 16, 2013"}, {"Title": "Aargh!", "Author": "New Englander 5 \"5GK\"", "ReviewID": "RC3UQSAPQZRFQ", "Overall": "3.0", "Content": "This computer is not at all intuitive and I HATE Windows 8 and I've had to manipulate most of my programs to make them usable.  Unless you like being totally frustrated keep away from this computer.  I'm surprise HP would put out a product of this quality.", "Date": "June 13, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00C5M6UGE"}}