{"Reviews": [{"Title": "Best I could find without going used", "Author": "Ray", "ReviewID": "R2IHORIKXNRBNZ", "Overall": "5.0", "Content": "After shopping around what seemed like the entire internet, I came upon this laptop. I only had 500 dollars to spend, so I wanted to make the best possible decision. After inter comparing every feature and taking into account the reputation of the makers, I narrowed my choices down to one or two laptops, and eventually chose this one due to the price. I'm quite satisfied with it. The only thing I didn't like was windows 8, but with some modification and programs, I customized even that to my liking. Overall, this is a no frills laptop with excellent performance for the price.", "Date": "August 25, 2013"}, {"Title": "Good budget laptop", "Author": "Bryan Pearson", "ReviewID": "R2YJ1DHYG1HOS0", "Overall": "4.0", "Content": "I have had this laptop for a few months now, and I like it. The machine is reliable and hasnt had any issues.My issues surround the trackpad, 1 its textured and after long term use, my fingers can become sore.  The trackpad also butts rightup to the buttons and on many occasions I hit one and not the other.  Beyond that, it does support multi touch, so you can zoom and drag down the page easily using multiple fingers.The keys are good and responsive and have enough travel to make let you know you did something.  Sound is very nice for a laptop.  Dont expect deep bass reproduction from any laptop, but this is certainly clearer then any other laptop I've owned.I would surely go Lenovo again, and would look at this laptop for a second purchase.", "Date": "October 1, 2013"}, {"Title": "Great laptop for the $", "Author": "CA Lann", "ReviewID": "R47ZSO0V7KRFQ", "Overall": "5.0", "Content": "Bought this for my high school grads going off to college. Great quality. Not crazy about Win8 but Lenovo doesn't put a ton of bloat ware", "Date": "August 22, 2013"}, {"Title": "Not bad", "Author": "Radiskull \"Radiskull\"", "ReviewID": "R3KQ2HRQKG77HY", "Overall": "3.0", "Content": "So I needed a new computer for work, I'm not a flashy guy and I liked the way this computer looked, black and pretty plain with no cheesy looking parts. I actually bought it from the Lenovo outlet store and was a pretty good deal $490 out the door refurbished, 8GB ram 1TB HD and core i5 3230 so it's all good. I received it and it looks new can't tell if its refurbished.It run very quite and does not get hot, the internet on my unit works flawlessly and never disconnects.Two things that I don't like about it is the screen is horrible, it has a soft out put and you can never get the contrast right, it just sucks, and the entire computer is a finger print magnet. Aside these two flaws I think its a great budget computer and works pretty fast.Things people might find irritating there is no light or any other indicator for caps lock or scroll lock, I'm telling you they wanted this thing cheap. All the buttons F1-F12 are in reverse meaning that in order to use them you would have to press Fn button to use them. For example if you wanted to use F1 you would have to press Fn +F1.Instead those buttons now control the volume, brightness, scroll pad lock, wifi etc Not really that bad but takes getting used to. It would have cost nothing to put two little lights for caps lock and scroll lock.This would suck if your're using win 8 and at the log in screen you're trying to log in with your 15 character password and the characters are hidden and you don't know if you have caps lock on or off.It's a sharp looking laptop, not that heavy, runs quiet and pretty fast and cool. Be aware of which G500 you buy they have the same model numbers but different CPU's. This that will take getting used to is there are no LED indicators for CAPS, NUMS or SCROLL lock. A free software called NumsCapsScroll Indicator 8.0 once downloaded will fix that.The bad part is the screen is not that good no matter what you do it does have this white tinge over the whole screen no matter how much you adjust the contrast, I am never able to get it right. When I us documents I push the screen all the way back for it to look decent and when looking at jpegs or watching videos I pull the screen up all the way to at least a 90 degree angle. But that's just me.Now bear in mind I use this for school and only paid $422 so for the price its great, if you want a better machine look at other models more $$$.Also I have had no problems with the Wireless card for the internet it works just great.Battery is small and only lasts about 2-3 hrs.Does show a lot of finger prints", "Date": "October 26, 2013"}, {"Title": "Cheap, Decent Quality, Good Specs", "Author": "jonathan0000", "ReviewID": "RGSJ9HCQ36WGV", "Overall": "4.0", "Content": "I have had no major issues with this laptop, only small complaints, but overall for the price that I bought this at, it's definitely worth it. Take note that I have only owned this laptop for a little over a week, so I can't attest to how long it will last. I will definitely update if I have any hardware issues.PROS1.) Intel Core i5 processor is very fast (2.6GHz)2.) Plenty of RAM for the average user (4GB) and has an extra empty slot to install another 4GB, which is what I'll be doing, as I am a heavy user3.) Price. I bought mine on Black Friday here on Amazon for $359.99. I probably would have chosen a different laptop if it were above $450.004.) I like the way the keys feel and even the sound of them5.) Hard drive is very quiet and spacious (500GB)6.) An unexpected plus was the HDMI port, which I am glad to have so I can connect it to my TV.7.) The headphone jack is very close to the front (some laptops have it on the back or on the side at the very back)8.) The OneKey Recovery button is a nice addition for restoring the PC9.) I like the LOOK of the textured plastic (but it does FEEL cheap, so it's also a CON)10.) Stays cool on your lap (most powerful laptops I've used tend to get pretty hot and will burn you up)CONS1.) **This is not part of my rating for this product, as it's not Lenovo's fault, but I have to get it off my chest** I can't stress enough how much I literally hate Windows 8. It is the worst operating system I've used in a long time. It's not user friendly at all and it takes 6 clicks to accomplish a task that only took 1 click in Windows 7 and below.2.) No backlit keyboard3.) Lots of bloatware. I researched all the programs installed and ended up uninistalling a majority of them, which sped up the PC considerably.4.) Feels very plastic-y and cheap5.) Fingerprints are horrible on the cover (I'm not quite sure why as the cover is textured and not shiny)6.) The Backspace and Enter keys are way smaller than I am used to. Every time I go to hit the backspace key I end up hitting the next key over, which is quite annoying. I suppose they did this so that they could fit in the full keyboard with the number pad.", "Date": "December 8, 2013"}, {"Title": "Good Buy for the Cost..", "Author": "LaNcE19", "ReviewID": "R1ESL9ALN8RM2R", "Overall": "5.0", "Content": "Good Low Cost Laptop for General Email, Office Products, Web Browsing, Watching Movies, FaceBook, eBay, Simple Games, and Watching Movies...", "Date": "September 8, 2013"}, {"Title": "Very Nice Budget Laptop", "Author": "Amazon Customer", "ReviewID": "R27XBSLK3NKMBL", "Overall": "4.0", "Content": "Why is it cheaper than other laptops? It is because of all the bloatware it has; however, they can be uninstalled. It is a great at home office laptop with sold performance with 5 hour battery on battery saving mode. The accurate keyboard is great and smooth. I've had this laptop for a month now and I'm still a happy consumer!", "Date": "August 11, 2013"}, {"Title": "Bought 2, had to return 1.", "Author": "Hm", "ReviewID": "R15FP7HAI9KKRO", "Overall": "3.0", "Content": "I bought units for each of my high schoolers.  One of the 2 units had difficulty connecting to the internet.  I assumed naturally that it was our own router and spent several hours re-starting and with tech support.  Finally, I tried connecting at a public wifi and determined that it was the unit itself.The computer business being what it is, that particular model was no longer available from the same vendor.  Amazon did give me a credit for the purchase price but I would up spending a little more to find the same model from a different vendor.  The kids would compare so it had to be the same model for drama avoidance.  In the intervening time, my home state had also arranged with Amazon to start collecting sales tax.", "Date": "January 11, 2014"}, {"Title": "Great value for you money", "Author": "Garvin Emamdie", "ReviewID": "R352WJVDDLY6HB", "Overall": "4.0", "Content": "Its fast, works great..its rugged and looks nice..what more could you want for the price. its being use for school work and personal as well.", "Date": "August 21, 2013"}, {"Title": "I love this laptop", "Author": "Tim", "ReviewID": "R3SHC3FSWN1ORB", "Overall": "5.0", "Content": "I love this laptop. The design is very good. The battery life is so long. I watched a HD movie (2hours) then surfed internet near 2 hours before the battery low. The system is quite good for basic demand. Don't forget buy with a wireless mouse. It's very helpful. I found the best ones here, the long battery life mouse :)B005DSPLCQ", "Date": "October 21, 2013"}, {"Title": "Great Laptop", "Author": "David Gross", "ReviewID": "R1ZMWOFALKSR3W", "Overall": "5.0", "Content": "I am running Ubuntu 12.04 on this laptop, and it runs great!  I have had no issues with it. I doubled the ram in it, and it now runs even better.", "Date": "November 20, 2013"}, {"Title": "Light, Quiet, and Quick", "Author": "Brenna Garth", "ReviewID": "R2AN341EI08JOU", "Overall": "4.0", "Content": "This computer seems like it will likely serve my needs in Law school quite well.  It is completely silent, which is very convenient, and it is not very heavy.  It has a lot of crap on it but it's quick and once I have a second to clean it off it will probably perform even better.  Has an awesome long battery life.", "Date": "October 7, 2013"}, {"Title": "Exactly tailored to my needs", "Author": "Jose Guedez", "ReviewID": "R26WXQBKYYJOMG", "Overall": "5.0", "Content": "Features of my laptop are accurate and complete. This is my main tool for working so I'm pretty satisfied with its roughness and capability.", "Date": "September 16, 2013"}, {"Title": "I love it", "Author": "Pratham Merchant", "ReviewID": "R3LZTLPF5Q3FPN", "Overall": "4.0", "Content": "This is my first laptop for High School. I am very happy with functionality ,speed and display. I  am very satisfied for the price and features.", "Date": "August 18, 2013"}, {"Title": "piece of s***", "Author": "P. KIM", "ReviewID": "R36VU26DBUF2QB", "Overall": "1.0", "Content": "DO NOT buy this damn notebook. I bought a factory sealed brand new one, and had problem from the beginning. Google any lenovo notebook with randomly network connection lost. Many people had return their machines. Not even that, I did recovering the system twice within 3 hours. Windows crashes, and leave me with blank start screen. Any brand new computer should work right away after pushing power button for first time. I am struggling 3 hours to make it work since i got it out of the box. Don't buy lenovo. IBM is not making good machines anymore.", "Date": "January 25, 2014"}, {"Title": "Great!", "Author": "BLESSING", "ReviewID": "R3I9W5CCML7KEK", "Overall": "5.0", "Content": "I am not going to go spec by spec about this item, but I will tell you that if you need a laptop for browsing the internet, doing school work, and multimedia purposes, this is a good computer for you. It has i5 processor, 4GB of ram and best of all with Lenovo is the one touch (key) recovery. Meaning that your PC takes a dump, all you need is to hit that button, and we are back again. You may lose all your data, that is why you need to backup your stuff. Again, I am not the spec for spec guy because the detail portion already said it all.", "Date": "October 18, 2013"}, {"Title": "cheap lenovo failed on this one", "Author": "mika", "ReviewID": "R3KQLU135IWCTO", "Overall": "1.0", "Content": "Bought two of these and within 4 months the hinges broke.Took laptop apart and not only found loose connectors,cheap parts and screws that were never tight by the factory the hinges are made so cheap I couldn't believe it.They have metal lock nuts but are mounted in plastic.Yes ,nothing holding the lock nuts but plastic which fail with the slightest push of the screen too far and there are no stops to keep it from going to far.Thought lenovo was a decent brand but this thing is just cheap and poorly made,period.Actually the hinges fail so much there is a fix on you tube which involves drilling through bottom of laptop and installing real screws with nuts on the bottom of unit.Last lenovo I will buy.", "Date": "October 21, 2013"}, {"Title": "Lenovo laptop", "Author": "Lauren \"Lauren\"", "ReviewID": "RYBHVJV5SI8J9", "Overall": "5.0", "Content": "Took awhile to get used to Windows 8, but it's a terrific laptop for going to college and I plan on using it at least the next four yrs.", "Date": "August 21, 2013"}, {"Title": "I really love it. A great laptop for a student.", "Author": "Alexander", "ReviewID": "RBXYAAIM8DMNS", "Overall": "5.0", "Content": "I have 8 months using this laptop and it's the best laptop i had in my life. In all this time it never froze or gave any problems.I use it for watch movies and series online, play video games, for work and other stuff.This laptop is really fast, when i turn it on it just takes like 3 seconds to be ready for use.I adapted really quick to windows 8 and now its one of my favorites.Speakers have a decent sound for a laptop. Battery works really well (5 to 6 hours in use)The only issue is the mouse pad. sometimes i just hate it. It's just like sometimes i try to move the cursor with another finger and it gets crazy and does something that i dont want it to do. (like move to the other side or something like that). But i consider that's not a big deal.I totally recomend this laptop.", "Date": "June 12, 2014"}, {"Title": "Great college laptop", "Author": "Amelia", "ReviewID": "RPS1GDF135TCU", "Overall": "4.0", "Content": "I've had my laptop for half a year and it still works like new. I bought it on sale for under $500, so it works very well for a college budget. It has the processing power to run all the software I need in my engineering classes, and I can multitask without programs slowing down significantly. Windows 8 was a bit of an adjustment at first, but once I customized the settings, it wasn't a problem. All in all, I'm very happy with how sturdy it is.", "Date": "June 10, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CRXZUG2"}}