{"Reviews": [{"Title": "Design Issues", "Author": "eqtyanalyst", "ReviewID": "R1NR6SE7D5Q1GO", "Overall": "2.0", "Content": "While the laptop looks great (aesthetics and awesome picture), a couple of design flaws make it tough to keep. The first problem is that the wrist rest area gets very hot; there doesn't seem to be any thermal insulation separating the surface and the CPU inside. Second, the wifi connection works intermittently. Never had this issue at home with my other computers. And I see from the Sony site that many others are experiencing this.", "Date": "August 2, 2013"}, {"Title": "Sony Vaio are Ok, but there is a downfall.", "Author": "BAD", "ReviewID": "R1GNIMO86ATE0A", "Overall": "3.0", "Content": "I liked the size and the screen was good but these new mouse pads are terrible 1 hour into it I wanted to throw the computer out the window. The mouse pad had no right or left click buttons and there was no control with the cursor at all. If your going to get a Sony Vaio I recommend the i5 processor the i3 is a little to basic and slow for me but could do well for someone who just looks up e-mail and browses the web. I also loved the illuminated keyboards, all laptops should have this feature most people use there laptops all the time and that would be good to see on more models in the future.  Also get a computer that has windows 7, windows 8 is garbage.", "Date": "October 15, 2013"}, {"Title": "Excellent Laptop", "Author": "Emir Vega", "ReviewID": "RXD45HPI84YX9", "Overall": "5.0", "Content": "This is a very nice laptop. It looks and feels far more expensive that what it actually is. The boot time is around 10 seconds, which I must say I truly enjoy as I am now departing from my aging HP and Asus laptops. The backlit feature is great for low light or night time and the screen is great. The only complaint I would say it the bloatware that comes with it. I used the Sony Update feature to update all drivers and it made the keyboard unusable so I would say uninstall and be weary, trust updating from Windows Update only. although this is not the touchscreen version, the interface is very fluid, and even thought Windows 8 has that terrible learning curve, it is still a great laptop. I definately recommend this laptop as a \"back to school\" laptop as it has both the capacity to serve as a work and entertainment laptop. :-)", "Date": "August 4, 2013"}, {"Title": "Great Media Friendly Laptop", "Author": "tesi", "ReviewID": "R3QSUVIJ49H4KM", "Overall": "5.0", "Content": "This laptop is awesome. A week prior to this, i bought a Toshiba with an a4 processor. I was in the market after my daughter broke my dell inspiron. Her school program is based online; i searched chromebooks and lower end toshibas. Out the door price on the toshiba was certainly cheaper by a couple hundred bucks in comparison to the vaio. However, the toshiba didn't make it 3 days in my household before i was executing a return. On the Toshiba, the mouse froze several times, it was only for a couple minutes at a time, but when you're trying to get something done, it felt like hours; Netflix also took forever and sound quality was mediocre. It performed like a $300 laptop. That being said, if you're able to spend a couple hundred more, grab the lower end Sony vaio. For me, it's definitely worth it. The sound and display quality are suberp and it's able to process faster. It had no problem with Netflix and it plays music even when you close the lid. The light up keyboard is fun too. Great quality and still within a tight budget....On the flip side, the one minor annoyance (with the sony vaio) and i will say minor because i prefer the annoyance over the consistent freeze-ups of the toshiba: the vaio does lose internet connection on a scale of...i'd say infrequently after a week's use. It's maybe done it 3 times of the 10-15 uses. My wifi signal will indicate \"limited\" even when i'm right in front of my signal. At that point, it's been a simple disconnect (from the laptop wifi), count to 10 and reconnect. It's worked all 3 times so far, but it does need that 10ish second gap. Not a deal-breaker for me, but i could see how it might annoy others on varying degrees, so heads-up.", "Date": "October 13, 2013"}, {"Title": "GREAT!", "Author": "Richard Hanooman \"Richard Hanooman\"", "ReviewID": "R3ENMUKG5HLKRX", "Overall": "5.0", "Content": "So far I'm still testing this, and getting use to it.  I'm for one isn't a fan of Win8 buuuuuut I'll get use to it.  Was going to install Win7 but couldn't get into the bios.  Otherwise, it's a fast start up.  Very fast.  IMO I think the trackpad is a weird placement, and I miss the actual left click and right click button, takes awhile to get use too.  Many adjustments.The backlit keyboard doesn't have a brightness adjustment, I think.  But it's not bad.  It's not to bright, or to dark, its just right.  I've been dealing with desktops for years and not had a laptop for a long time so I am still getting use to the keyboard and thats why I got the 10-key version.  So far I'm still getting use to it and its not bad.The screen does need to be adjusted for your viewing angle, soooo make sure you adjust it in the right position before you move it.The sound quality is amazing!! Loud! Clear! Skyping right now and the voice is clear!Haven't tested the battery life.To end it all, the webcam is amazing! According to the other person on Skype. \"It's so clear!\" and I'm in a dark room.  Like no other lights except the laptop.  Very satisfied!  I also installed a start button, and I love it.  I am also having problems with transfering a picture from my Oppo Find 5 to this laptop via NFC.  Says \"The receiver doesn't support large beam transfers\", so I don't know why 147kb is alot.  But I will see what I can do to fix this.Great laptop for the price.  Still testing it out as this review is out.", "Date": "August 6, 2013"}, {"Title": "A nightmare", "Author": "DANNY", "ReviewID": "R2TYWK278G3BVA", "Overall": "1.0", "Content": "The worst laptop I ever owned.sent it back to Sony because it froze on me.Not to mention the 4 other times I called tech service on the phone for hours.My son had important docs. that he lost because the laptop had internal issues.I would not recommend this vio fit.", "Date": "May 8, 2014"}, {"Title": "good laptop", "Author": "amanda", "ReviewID": "R7X75CZRI3Q1N", "Overall": "5.0", "Content": "I love it because its white and runs fast and basically a mac but in pc form... if that makes sense. good college computer but if you are going to be taking it to class everyday I would suggest getting a smaller one. but if its mainly for home use the 15.5 is a wonderful size because its big enough to do my work on like a desktop. also one of my favorite parts is the light up key board!", "Date": "January 3, 2014"}, {"Title": "It is ok", "Author": "Nick", "ReviewID": "R1HDEV6JSJFTI", "Overall": "4.0", "Content": "This is my second Sony Vaio and my first computer with Windows 8. This Sony is not as stable as my previous model. It often gets stuck for 5-10 seconds when I have an internet browser open.Windows 8 is terrible....", "Date": "December 21, 2013"}, {"Title": "Awesome buy", "Author": "V, H", "ReviewID": "R2X60XRRZ57LA1", "Overall": "4.0", "Content": "Its always been my fave brand when it comes to electronics, very reliable and durable, so far so good no complains yet, totally recommendable.", "Date": "October 9, 2013"}, {"Title": "Wifi Never Works", "Author": "Azure Ingram Boynton", "ReviewID": "RK2NN85PU8VXF", "Overall": "2.0", "Content": "The laptop looked great and Windows 8 was okay once you get use to it however, the wifi never worked. Once connected to any router after a couple minutes it would stop working. This was tried on several different networks. After further research decided the Sony Vaio was not for me.", "Date": "September 30, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CFGVEFM"}}