{"Reviews": [{"Title": "Good solid option. Overall a really nice productive laptop with solid components and performance. Screen is only con.", "Author": "microeconomics", "ReviewID": "R2HAIK092YPKRF", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo2ADCQ6MLBTRVMembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo2ADCQ6MLBTRVMrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo2ADCQ6MLBTRVMchiDiv\").innerHTML = document.getElementById(\"cv_mo2ADCQ6MLBTRVMhiddenPre\").innerHTML;\n};\ncv_mo2ADCQ6MLBTRVMrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo2ADCQ6MLBTRVMso;\t   \n\n\nfunction cv_mo2ADCQ6MLBTRVMloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo2ADCQ6MLBTRVMso = new SWFObject(swfLocation, \"cv_mo2ADCQ6MLBTRVMAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo2ADCQ6MLBTRVMso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo2ADCQ6MLBTRVMso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo2ADCQ6MLBTRVMso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo2ADCQ6MLBTRVMso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo2ADCQ6MLBTRVMso.setAttribute(\"height\", swfHeight);\n          cv_mo2ADCQ6MLBTRVMso.setAttribute(\"width\", swfWidth);\n          cv_mo2ADCQ6MLBTRVMso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo2ADCQ6MLBTRVMso.write(\"cv_mo2ADCQ6MLBTRVMflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo2ADCQ6MLBTRVM', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo2ADCQ6MLBTRVM';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo2ADCQ6MLBTRVM', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo2ADCQ6MLBTRVMloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo2ADCQ6MLBTRVM\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"mX14CBUYL25RE\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"mX14CBUYL25RE\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R2HAIK092YPKRF\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/mX14CBUYL25RE/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo2ADCQ6MLBTRVMduration')) {\n      document.getElementById('cv_mo2ADCQ6MLBTRVMduration').style.display='none';\n    }\n    cv_mo2ADCQ6MLBTRVMloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo2ADCQ6MLBTRVMloadSwf(movieID, playerVersion) {\n   return _cv_mo2ADCQ6MLBTRVMloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo2ADCQ6MLBTRVMnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo2ADCQ6MLBTRVM', 0, h);\n}\n\nfunction cv_mo2ADCQ6MLBTRVMresetPlayer(w,h,bw,cc) {\n  cv_mo2ADCQ6MLBTRVMnewHeight(h);\n\n  cv_mo2ADCQ6MLBTRVMso.addVariable(\"resetBandwidth\", bw);\n  cv_mo2ADCQ6MLBTRVMso.addVariable(\"cacheCode\", cc);\n  cv_mo2ADCQ6MLBTRVMso.setAttribute(\"height\", h);\n  cv_mo2ADCQ6MLBTRVMso.setAttribute(\"width\", w);\n  cv_mo2ADCQ6MLBTRVMso.write(\"cv_mo2ADCQ6MLBTRVMflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo2ADCQ6MLBTRVMRollOverImg = new Image();\ncv_mo2ADCQ6MLBTRVMRollOverImg.src = \"http://ecx.images-amazon.com/images/I/819nkIVkOnS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo2ADCQ6MLBTRVMpreplay = document.getElementById('cv_mo2ADCQ6MLBTRVMpreplayImageId');\nif (cv_mo2ADCQ6MLBTRVMpreplay) {\n  cv_mo2ADCQ6MLBTRVMpreplay.onmouseover = function() {\n    cv_mo2ADCQ6MLBTRVMpreplay.src = \"http://ecx.images-amazon.com/images/I/819nkIVkOnS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo2ADCQ6MLBTRVMpreplay.onmouseout = function() {\n    cv_mo2ADCQ6MLBTRVMpreplay.src = \"http://ecx.images-amazon.com/images/I/819nkIVkOnS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo2ADCQ6MLBTRVMpreplay.parentNode;\n\n  var cv_mo2ADCQ6MLBTRVMcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo2ADCQ6MLBTRVMcurrentClick) {\n      return cv_mo2ADCQ6MLBTRVMcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 3:09 Mins*** Quick edit / update: I need to say that all around, this is a very good laptop. It performs well and has a great keyboard with a more than adequate screen. It has touch screen capability and has plenty of ports. It is small enough to be mobile and powerful enough to be a desktop replacement. All in all, a solid, solid machine.You will get good value from this machine and should do great for many years.First of all, the Dell 15R here is a solid performer in all areas except one. I would certainly give it a solid 5 stars for performance and value except for one detail. The screen resolution. I am not sure why all the windows 8 laptops that have touch enabled have moved to this lower resolution. The resolution is slightly better than 720p, but not by much. The additional cost to upgrade a screen size to full 1080p couldn't have been that large. So it makes me think it must have something to do with the touch screen interface and the ability of windows 8.Anyway - the keyboard is fantastic, the battery life is very respectable (I was able to get 5 hours + of decent use), and it has a good array of usb ports, a dvd drive, a HDMI port, and a sd card reader. This is really best designed for students that need a laptop that they can do everything at the dorm and occasionally pack it up and take it to the library.The finish is good, but when when you pick it up, it has the plastic bottom. Bummer. It feels very solid and I have no doubt the quality of the machine will allow it to last.Pro's:1. Solid and capable construction with a nice brushed aluminum look tot he cover and keyboard area2. Fantastic keyboard that is wonderful to type on. Good travel and no flex.. Awesome ..3. Very fast processor, good drive space (500GB), and good amount of RAM4. Has all the ports you need and a dvd drive5. Good price with tech support (not mom and dad at 10 pm on a wed night - yippie!)6. Touch screen, but this is low on the list. I am not sure that the touchscreen is all that useful for 99% of the work you do an a laptop ... I think it is kinda gimmicky ...Cons:1. Plastic bottom, with no sex appeal :(2. Low Screen resolution3. Windows 8 (jury is still out, but I like windows 7, hopefully windows 8.1 will bring back the productivity of win 7)Otherwise, you cannot beat the affordability and the \"bang for the buck\" in productive tasks. It works, it is fast, and will handle anything you throw at it. Any student will be able to do whatever school work and more on this machine. Just be warned, that if your new college student is at all socially minded and wants to be like the other kids, they will want a mac. While Dell has done a good job at making an attempt at a sexy laptop, it just doesn't compare to a sexy macbook.This is an effort to match the affordability and raw horsepower of a Dell, but also adding some design elements (cover and keyboard platform in brushed aluminum) to give it some respectability, just wait to pick it up and put it away when everyone else isn't looking.", "Date": "September 1, 2013"}, {"Title": "A Winner from Dell", "Author": "Patrick O", "ReviewID": "R1JRB57ZJB17JG", "Overall": "5.0", "Content": "I have a mixed relationship with Dell laptops. I have been using or helping those who are using Dell laptops since about 2004.  They had a great build quality then, great service and prices.  But, it seems that Dell goes up and down in quality as the years past. You never know if you're buying during a lemon year (2008) or a great year (2006). I note those years because those are specific laptops. My wife had one from late 2008 and it was constantly causing problems. Constantly crashing, restarting, freezing.  It was always a bother, even with lots of attention.  Finally died entirely early last year.On the other side, I got a laptop in very early 2007. Still use it.  I've replaced some parts here and there, like the touchpad and keyboard and LED screen. But, it keeps on ticking.  Works great.  We got a Dell Desktop in 2010 and it works great.So I want to like Dell, but I've known others who have mixed stories like we do, and so I'm cautious.Dell has a winner with the Inspiron 15R here.  I recommend it absolutely.  It's not a sleek, light laptop, but you have to pay a fair amount more for that. It's really the laptop that has been around for about 10 years, updated with contemporary technology. And updated well.First of all, it has Windows 8.  Windows 8 can be a real bother for all kinds of reasons, but I find this computer works as well with it as possible. No glitches or crashes or any problems. My wife has an HP model of similar build and price, and it seems to have consistent problems with drivers or other concerns which cause a freeze.  After 6 weeks of constant use of this (I'm a professor and writer), not a single problem.  The trick to getting Windows 8 to work right is a very cheap program called Start8.  Look it up online, made by stardock. It basically restores Windows 7 convenience while still making use of Windows 8 functionality.As to this computer. The touchscreen works wonderful, though, I find I have to remind myself to use it. I'm used to the old fashioned way. Add to this the problem that Microsoft insists on Windows 8 having a touchscreen look, while not really making a touchscreen all that necessary.  For instance, the Office programs have very little touchscreen functionality that I've found. It's good for apps and such but basically a distraction.Features include USB 3.0, which is the newer standard and makes USB transfers extremely fast. Which usually isn't a big concern except for backing up onto an external hard drive. And with only 500GB of space on this computer, I'd definitely recommend an external if you're doing any multimedia. There's also an HDMI out, which is wonderful, but there's no VGA out, so if you're planning to use this for presentations you might need to get an adapter.This 15R has strong wi-fi and bluetooth, picking up and holding onto signals better. I have a Onkyo CS-355 CD Hi-Fi Mini System with Bluetooth. The bluetooth signals from other laptops I tried would be very, very tentative.  Move the wrong way, signal is lost. Sit the wrong way (like with the laptop on your lap) it would lose the signal.  With this laptop, it's consistent and strong.  Another one of those minor strengths that points to the overall build quality of this laptop and the components they are using.  In other words, they're not shoving in cheap and sketchy components just in order to boast about features. The features work and they work well.The memory is 6GB, which is probably the minimum for good running computers these days, however, it's easily upgraded. It often costs more to have higher memory upfront than to upgrade later.Video works solid, HD though not the highest resolution. Honestly, you probably won't notice. I don't notice a big difference between my computer and my wife's, which has a dedicated video card and higher resolution. Such dedicated cards take away battery life and add complexity to the system, resulting in more problems.The touchscreen itself is great. Multi-touch, meaning it can sense at least ten points of contact. I only have 10 fingers, so that's all I was willing to test.  Very sensitive, very fluid. There are good apps that do make use of it well.My one complaint has to do with the screen. Very glossy which means very reflective. Turn it on and you're looking at yourself in a reflection. It has good brightness, so mostly overcomes this, but if you're working outside a lot, this might be an issue.All in all, I'm exceedingly pleased with this model. I'm not entirely sold on touchscreen necessity yet, but the great thing about this is it's a bit more future-proofed should software (like Word or Powerpoint!) be increasingly more touchscreen optimized.  It makes for a great bridge between a traditional laptop and a workable tablet like access. Great for school or work.  It has worked well with all the software I've used and that includes Microsoft Office, the new Adobe Suite, Corel Painter, and other multimedia. Not a glitch, or a problem to note at all.Highly recommend if you're looking for a workhorse laptop with a touchscreen.", "Date": "October 8, 2013"}, {"Title": "Good laptop, but keep your options open for an ultraportable", "Author": "Sukru Tikves", "ReviewID": "R1T00C9L5PJUIP", "Overall": "4.0", "Content": "This is a very good laptop, and overall nice parts overweight its issues. However the price is approaching ultraportable levels, so the choice is not a clear cut one.First the things I liked:- The touch input actually works. The combination of the touch screen, with the trackpad makes both local movements (like scrolling), and targeted movements (like closing a window) very easy to perform. The Dell configuration application is very useful for this purpose. Yet, I should say that I could not get some of the trackpad gestures working.- There is actually little \"crapware\" installed on the system. I only needed to uninstall the antivirus, and some Intel drives (you would not need RAID on a laptop). This is of course if you like the installed OS that comes with the system.- Overall performance is very good, the boot speed is fast, and applications rarely slow down. The only thing I would recommend - after switching the antivirus program - is getting an SSD. I could not find this model offered with such on option neither here on Amazon nor on Dell's own site. This makes the installation harder. Unfortunately UEFI and OS migration rarely work smoothly.- It is very silent. The third generation core processor helps keep the fan off most of the time.- The laptop seems to be upgradeable. There is easy access to RAM, disk, and several other on board items. If you need more headroom in the future, this might help keep your options open.- The battery life is rather good. I can use it for a few days without needing a recharge. My usage is light, but the battery easily lasts more than six hours in total.There are a few bad parts though:- The port locations are not optimal. The USB on the right side is on the middle, below the optical drive. This makes connecting a wired mouse more difficult than necessary.- The SD card reader is only USB 2.0. I understand that USB 3 bandwidth is precious, and better spent on regular ports, however given recent expansion of SD storage, I would prefer to transfer my media faster. An HD recording easily takes 10GB per hour depending on bitrates.- The driver update failed on the first run. Generally OEM software for these kind of purposes are really low quality, and Dell's updater is only slightly above average.- Wifi did not work on 5GHz band. For most apartments, this is a less congested option than the regular 2.4GHz.My overall judgement about this laptop is positive. While there are annoyances, they are minor. This is a job well done by Dell.", "Date": "October 3, 2013"}, {"Title": "I Would Skip It...", "Author": "JP \"J.P.\"", "ReviewID": "RSVYWYR5VBTV5", "Overall": "3.0", "Content": "The Dell Inspiron 15R 15.6-Inch Touchscreen Laptop is a middle of the road notebook computer, I would probably have not purchased if I could do it over.  I purchased it from office depot, and luckily was able to get it returned with out losing any money.Design:There is no question this notebook looks absolutely fantastic.  When Dell redesigned the Inspiron 15R again, they made this machine look really sleek and beautiful.  The cover is done in brush metal that is absolutely fantastic and really looks stylish.  The adjustable hinge on the screen allows for a greater movement of the screen, more angles than my HP notebook with similar hinges.Connectivity:The Inspiron 15R has a total of 4 USB ports (two USB 2.0, and two USB 3.0).  On the right side of the machine you have your Kingston® Lock port, CD/DVD multi-drive, and one USB port.  On the left side you have 3 USB ports, HDMI out, RJ45 (Ethernet), and a headphone jack. The two speakers are on the front along with the connectivity lights (power, HDD, Wi-Fi, etc.).Performance:This is where I was most disappointed with the system.  This has little to do with Windows 8 as an operating system, but more about how this computer performs overall.  While I like that the keyboard feels full size including a number pad and the wrist-rest is both generous and comfortable in use, after turning the unit on and setting it up, it's quite laggy.This unit features a touch screen which is wonderful for really experiencing windows 8.  The problem seems to be that the performance is rather sluggish and slow to response when moving from side to side on the start screen (kinda jerky).  I installed office and the computer is fine for office, but when browsing the web or looking at email, the machine again is rather bogged down.  I can understand the Intel Core i5 1.8GHz is not the top of the line (the I7 is), but the machine is really unacceptably slow.  There is not much in terms of 'bloatware' pre-installed, so that is both good, and clearly not the problem.I tried restoring the system a couple times, both with the windows 8 refresh option and using self-made restore discs.  Perhaps my Inspiron 15R is faulty or there is something extremely internally wrong with it, but from my experience, I would not recommend this particular system.", "Date": "March 16, 2014"}, {"Title": "Bulky, but otherwise very nice", "Author": "Anonymous", "ReviewID": "R3BKUOI6WX9J6V", "Overall": "4.0", "Content": "First of all, this laptop ships with Windows 8, \"Metro\" user interface and all.  This isn't going to be a review of Windows 8, but users should be aware that it's a huge and weird UI shift anyhow.Second, it has a touch screen.  You might not think you want it, but this is a surprisingly great feature for everyday tasks like web-surfing and scrolling as you read documents.  It's not perfect -- I found it sometimes mistook a swipe for a click, with unintended results, and it's very hard to tap small targets -- but it's pretty good.  The screen itself is somewhat thicker, and feels more like the image is under glass (rather than like the pixels are right at the surface), as a result, but it's a reasonable tradeoff for the neat functionality.The 15R's hardware specs are all very reasonable, especially considering the price.  But before buying, check the pricing on the 8 GB / 1000 GB model before purchasing -- the prices fluctuate, and sometimes the more capacious unit seems to be available for a very small upcharge over this one.The other thing to realize is that it's a very big and bulky laptop.  It's every bit as thick and clunky in shape as you might think, and it's much heavier than the claimed weight -- Dell's data sheet says it has a 5.1 lb \"starting weight,\" whatever that is, but the actual laptop (with battery, but without counting the power adapter) weighs 5 lbs 13 oz on my scale.  I wish they wouldn't lie about these numbers.  And for all the size, the keyboard is quite small and fiddly in feel, and off-center, because they've added a numeric keypad.  Which is great if you need that, but otherwise makes typing words less pleasant.All in all, despite a few minor flaws, this is a great low-end laptop for Windows 8 users. Recommended.", "Date": "September 13, 2013"}, {"Title": "Good functionality for most everyday mobile computing tasks...", "Author": "35-year Technology Consumer \"8-tracks to 802.11\"", "ReviewID": "R13SDGJWGK18FC", "Overall": "4.0", "Content": "This laptop sits in a crowed part of the laptop computing market. While the question of its longer term performance and reliability remains to be answered, in the early part of its service it has performed solidly in range of the most typical tasks I ask of my notebook computers: Office productivity applications, online activities (not gaming, I can't address this) video editing and  music library managementExpect to invest some time initial set-up and preparation. After unboxing, mine required about 40 Windows 8 updates. After accepting and installing these, I moved forward with the Windows 8 to Windows 8.1 update. This is available at no cost and was easily accessed via the \"Store\"  icon on the Metro interface. Be prepared: it's a large download (over 3 GB), although you can keep working until the very end of the update, which includes several computer restarts. All of these updates were completely error-free. It took about 90 minutes total for the download and Windows 8.1 upgrade.This computer ships without installation discs or recovery media. A Dell OEM program will prompt you to create your own using either the optical drive (for writing to DVD) or a USB port (for writing to a USB drive). You'll need to have at least 12 GB available. Out of an abundance of caution, I created one set of each. Writing to a USB solid state device took about 35 minute. Optical disk writing required four DVDs and took about 100 minutes. In the event you need to restore the computer, the recovery media returns it to a Windows 8 state (although Dell will sell you an option to restore directly to a Windows 8.1 installation, I can work with restoration to Windows 8).Pros:-abundant connection options for data transfer tasks (optical drive, four USB ports, ethernet port, SSD slot, integrated WiFi and Bluetooth).-touch screen allowing full exercise of Windows 8 (and 8.1) functions. This is the first computer I've used with such a capability. While I'm still assessing the user experience, it is improving my interaction with Windows 8.-Brushed metal case and wrist-rest surface reduces fingerprint visibility.-Battery life: about six hours when fully charged (depending on what you're asking it to do)-Display size-RAM. I consider the 6 GB spec for this model adequate for most purposes. It's upgradable to 8 GB, which I'll consider doing.Cons (these are minor, but you should be aware):-Already discussed above: no included back-up media. You get to roll your own.-The four indicator lights (for power on disk activity, AC connectivity and and WiFi on/off are located on the forward vertical edge of the case. In short: not viewable without significant repositioning of the computer or your head. All I can say is:what were they thinking?Don't let these two totally forgivable cons fool you. This is a solid performer.", "Date": "November 29, 2013"}, {"Title": "The large touchscreen is great with Windows 8", "Author": "PT Cruiser", "ReviewID": "R19C7KIBWPMJ8A", "Overall": "5.0", "Content": "It's been several years since I've had a laptop computer. The desktop, smartphone and Kindles have gotten me by, but I'm realizing now how much I've missed using a laptop for the portability and the processing power that tablets just can't fit into their small sizes. This laptop comes with Windows 8 installed and it opens a whole new world in laptops for me. With the touchscreen it has the \"hands on\" feeling of a tablet where I can expand windows or text using my fingers or touching the spot where I want the cursor to go, but it has a big, beautiful 15.6 inch screen and lots more processing power and memory than a tablet or smartphone.I love my desktop computer but it sure is nice to be able to work anywhere I want to, and in fact be able to communicate with the desktop from other locations. The built-in Wi-Fi works very well with our home network and stays connected without any problems. It communicates with our wireless printer and also has Bluetooth. It isn't a real sleek little laptop, it weighs 6 pounds according to my scale although it's shown here as 5.1 lbs. And at 10.20 x 14.80 x 0.98 inches you aren't going to be tossing this into your backpack, but hey, that's what a tablet is for. This is a serious computer and it has a nice, solid feel. I'm also impressed with the speakers which are surprisingly good for a laptopI wasn't sure if I was going to like Windows 8 since I've been using 7 and hadn't had a chance to try it before. This laptop came with it installed and 8.1 is available through the Microsoft Windows Store as a free product update so I downloaded and installed it the day after I received the computer. One word of warning: allow a lot of time for the upgrade. It's a huge install file, something like 3.2 GB. And once you've got it downloaded it seems to take forever to install. I started it around midnight with a pretty fast Wi-Fi cable connection and didn't want to go to bed while it was downloading and installing. It didn't take any work on my part, I just watched it whirring away, but it was at least an hour and a half before it was finished. I'm really liking Windows 8.1 so far on this laptop. The touchscreen is very responsive and I love being able to go back and forth between the screen and the keyboard. Everything feels very fast and now that I'm getting used to it, it's easy to navigate. Being able to just start typing the name of a program anywhere and have it open is very cool. And it's always fun to have something new and different when it comes to operating systems.I like the solid feel and speed and since we've had several Dell computers over the years I'm expecting this to be dependable like the others. Two thumbs up so far!", "Date": "November 27, 2013"}, {"Title": "I Think I'm In Love", "Author": "Georgia Peach \"B\"", "ReviewID": "R3CHE09CTEPCFV", "Overall": "5.0", "Content": "Just received. Took no time to set up even for me. I say this because I am not Techy. I am a grandmother with 10 grandkids and know very, very little about computers. I love the quad processor, the touch-screen, the light-weight. (have arthritis so can't lift heavy things) The wide display is a plus and it looks sharp or should I say makes me look sharp. Don't even mention 300 G memory. Camera. DVD burner and player.Now I am a really cooler grandma!! Oh yeah, I'm in love with this Laptop.RosePs. Will update as I use more.....", "Date": "August 27, 2013"}, {"Title": "LOVE", "Author": "Noname", "ReviewID": "R122T3U7F4QF7G", "Overall": "5.0", "Content": "My husband has an old laptop.  I have a netbook.  I wasn't sure how well I'd take to a touchscreen laptop.  I just couldn't fathom moving back and forth between touching and typing and using the touchpad.  Let me say now, I love it.  I just love it!SETUPYou don't have to be a computer geek to set this laptop up.  Turn it on and it guides you all the way.WINDOWS 8.1The laptop comes with Windows 8.  In order to get the Windows 8.1 upgrade (free), we first have to install the updates and then Windows 8.1 will magically appear in the store.I have Windows 8 on my kitchen PC.  That's just a regular PC.  When I got it, I thought, it can't decide if it's a tablet or PC.  I hate, hate, HATED it!  But now, now I understand.  Windows 8 is ideal for touchscreen laptops.  Oh, the beauty.  It's not hard to go from touchpad to keyboard to touchscreen at all.And for those who want the old desktop back as the startup screen, Windows 8.1 has it.  Switching back and forth between tiles and desktop is a cinch.  I had my desktop set as start up, but I'm beginning to see the beauty of the charms.PERFORMANCEAt first, I thought Internet Explorer was very sluggish on this brand new machine.  Then, I realized, I don't like Bing and the Internet Explorer I get from the charms page is different than the one I get on the desktop.  I like the desktop version much better.  The apps version is clunky at best.Battery life has been very good.  I've used it for days (on and off, not straight through), and the battery just keeps on ticking.  My husband's laptop dies in half an hour, so this is a huge improvement.Typing is comfortable.  The laptop doesn't get too hot. Swiping the screen is intuitive, it only takes a few strokes to learn.  The touchpad works as well as any I've used.The more I learn my way around this laptop, the more I love it.  Windows 8 finally has a place in my heart.", "Date": "December 7, 2013"}, {"Title": "So far so good", "Author": "M. Paolucci", "ReviewID": "R139BECQFE3XDL", "Overall": "5.0", "Content": "I hate trying to pick out a computer.  So many options, so hard to decide.  I finally narrowed it down to this one and then spent time trying to find the best price (which honestly changes from day to day on many sites).  I have a just about figured out windows 8 and the computer works great.  Of course my old computer was 85 years old in computer years (5 years), so this machine seems like a wonder comparatively.", "Date": "August 31, 2013"}, {"Title": "Practical touchscreen laptop", "Author": "Dave Edmiston", "ReviewID": "R3BBLMPJGNE286", "Overall": "5.0", "Content": "DISCLAIMER:  I can't stand Windows 8.  This review covers the laptop, not the operating system.  If I were reviewing the operating system then poor Dell would get a 1-star review from me, which definitely would not be fair of me.TIP:  Set aside some time to run all the system updates and then upgrade to Windows 8.1.  In my opinion Windows 8.1 is much less of a drag than Win 8.  Just make sure to install the Windows Updates first, because you won't see Windows 8.1 Upgrade in the Windows Store until you run the other updates first.About this laptop...This is a really nice laptop.  It has a nice sized screen and a decent full keyboard (for a laptop).  Having a full numeric 10-key keyboard seems to make all the difference in a laptop.  For whatever reason, the best laptops I've owned were the ones with the larger keyboards.  I know that sounds superficial, but for some reason my other laptops with the smaller keyboards seemed to have cut other corners that were disagreeable to me.  This one is just right though.I'm still getting used to the touchscreen.  I love the convenience of it, but there's something about putting my grubby paws on my display that bugs me.  I never touch my regular display and I really don't want fingerprints on this display either.  I've put a soft cloth in my laptop bag though, so I can keep it clean and get over my phobia of poking and dragging apps across the screen.I'm happy with the performance of my apps on this PC.  I regularly use all the Office products (Outlook, Word, and Excel).  I also use Photoshop quite a bit and it runs just fine.  I'm not a fan of IE, so I mostly use Chrome and sometimes Firefox.  All these applications run just fine on this PC.This laptop is nice and quiet.  The battery lasts a long time.  The keyboard feels good.  I can get a lot of work done and not have to worry about my machine.  Perfect!", "Date": "December 9, 2013"}, {"Title": "Great performance!", "Author": "bta015", "ReviewID": "R1HPBWUF9MXELP", "Overall": "4.0", "Content": "We all love this laptop at home! Once you get used to Windows8, it all flows..Touchscreen is a plus, although it's kind of difficult to avoid opening any other window at any accidental or unintended touch.The boot speed is fast, applications rarely slow down.Battery life is great.Consthe touch function has frozen a couple of times while the laptop was plugged being charged.the weight, not as described (I believe 5.2 pounds) but not less than 6.5.Wireless connection keeps falling, and have to run the troubleshooter to re-connect, but still don't know if it's about my home connection or its a system failure.Overall, its a great buy. Solid performance, User friendly, Strong for home use and still portable.", "Date": "October 30, 2013"}, {"Title": "No worth the money", "Author": "jeff pimenta", "ReviewID": "R1IOQHZX5RRNH7", "Overall": "1.0", "Content": "My 5 year old computer gets on and stays on the internet this thing keep losing signal at excellent signal? once on slower than my old ACER. I do not recommend.", "Date": "May 22, 2014"}, {"Title": "It was defected piece", "Author": "Laxmikanth P G", "ReviewID": "R3VQPOYPRD5N2I", "Overall": "2.0", "Content": "I trusted that the product will be tested before shipping. By having such confidence i did not even tried starting laptop once and bring home to india. here when i tried to switch on the laptop boom its not starting i googled around and found in couple of youtube that it could be problem with  mother board, it was upset.I had quick chat with amazon support they guided me well, so i can return the laptop back from india to usa.Over all it cost me 50$ for shipping but still i got my money back for this laptop that's why rating 2 star.", "Date": "April 2, 2014"}, {"Title": "I do not know how this product got so many stars accross the internt", "Author": "Ann Brown \"Unmerited Favor\"", "ReviewID": "R1GEW98XF9I4HE", "Overall": "1.0", "Content": "This was a surprise gift from my husband, oh how I wish that he did not bother.  Not only is it slow, it freezes constantly.  I am thinking of buying another laptop and passing this on... it is a waste of money", "Date": "December 20, 2013"}, {"Title": "Fast, and love the touchscreen", "Author": "MrLance", "ReviewID": "RZ56L3NWBTL07", "Overall": "5.0", "Content": "I didn't think I would use the touchscreen that much but decided to get it since that is the way tech is moving --- Now I love it! I keep swiping at my wife's laptop now (which doesn't have touchscreen) wondering why nothing is happening.  Not a fan of Windows 8, but it works very well on this machine. I am really amazed at how quickly it boots up / recovers from sleep / shuts down.  I don't know if that is a feature of Windows 8 or the Inspiron or a combination.Not using this for gaming or anything graphically intensive, but for everyday activity it is very fast.", "Date": "November 3, 2013"}, {"Title": "A great bargain!!", "Author": "Abhinav T.", "ReviewID": "REMO86B14QK3J", "Overall": "5.0", "Content": "What a wonderful laptop!!! I was quite suspicious at the time I took it, but Windows 8 with its brilliant touch screen feel more than great. Also, the battery of this laptop(4-5 hours) at present is such a relief from my old laptop!!", "Date": "September 27, 2013"}, {"Title": "nice computer", "Author": "Tp", "ReviewID": "R2S57RQ2S3GVUM", "Overall": "5.0", "Content": "Everything arrived just as advertised.  Touch screen is a little weird at first but is a nice feature.  Camera is low resolution.", "Date": "September 21, 2013"}, {"Title": "More about the internal components than a flashy exterior", "Author": "Angela Streiff", "ReviewID": "R35824OPY440CL", "Overall": "5.0", "Content": "*** 4.5 stars***The more I use this laptop the more it grows on me. After a month of use I've found it to be a great system, with just a few physical design details I wish I could change.Size/Weight:This is not going to the the lightest 15 inch laptop on the market. It's not huge by any means, but it has some weight to it. Don't pick this up thinking it's going to be a super thin case design. I don't mind the size, since it means everythings less crammed inside the casing. I'm all for giving my system's internal components a little breathing room.Touch screen:At fist I didn't know what to think of it. I wasn't sure I needed it. Hours into using it I realized just why I can't live without it. Two words: Windows 8. The only thing more complicated than navigating Windows 8, is doing so without a touch screen. This OS is so much easier to learn when you can touch the screen instead of having to just magically know where on your screen there is the invisible spot you'tr supposed to move your mouse to so certain menus pop up. The touch screen works very well and responds nicely. It's not overly sensitive, but I also don't have to bang on my screen to make it recognize my commands either. I've gotten so use to my touch screen that when I'm at my desktop PC in the office, I find myself trying press the screen there, accidentally forgetting it's not a touch screen.Speakers:For a laptop, they're fine. Don't plan on DJ'ing any parties with your Dell and you'll be happy with them. They're nothing amazing, but I've also heard worse. I prefer to use headphones with it when I'm listening to something anyway.Keyboard/touchpad:The keyboard is nice and large. I'm able to type on it fine and I love that it has a full number pad on the side. Everything is very well spaced and I don't find I have any problems with my fingers feeling crammed together as I try and type. The touchpad is large and works fine. However I found I prefer to use the touch screen and USB mouse I've attached to it.Casing:The case of this computer is where I take off the half star. The area where my wrists rest when I'm typing tends to dig into my arm to the point where it can be pretty uncomfortable. The keyboard is set inside enough that I find I have to position my wrists in a spot where they end up being a little uncomfortable after a while. The lid is pretty stiff to open and close. Not something that you can do easily with one hand if you needed to. Also, the case has a very basic design. Nothing eye-catching or unique about it (if it matters to you). It has a very industrial feeling/design to it. Like the kind of laptop a company would buy 1000 of the same one for everyone in the office to use for work. This isn't a problem, just something to make note of in case you're looking for something with a little more flash to it. For me it's not the looks that are an issue, but the case itself has some odd angles which I personally find can make for occasional uncomfortable wrist positions when trying to type.Wireless Card:The wireless card has great strength and I've had no problems with it holding signals. It connects easily and I've yet to have a dropped signal even once.Software:Windows 8, ugh. This operating system is not the fault of the computer, so I can't blame the system for it. But be warned, if you're new to it, it has a learning curve. The first time you go to shut your computer down it might take you 10 minutes just to find the location of the button. Windows 8 feels like a cross between a regular Windows OS and a tablet OS. In theory this was probably a good idea. But now that it's been implemented, it's made it so tasks that use to take 3 seconds to complete, now take 10. Everything is hidden under layers of stuff. You have to spend hours tweaking your system so you don't have to dig for even the smallest things. After a month of working on it, I've got it figured out, but it's still a pain. Doing the free update to Windows 8.1 will help a lot, but it still keeps a lot of things buried and things that were 2 clicks away are now 5. The touchscreen this computer has helps navigate Windows 8 immensely.Performance:I've been beyond pleased with how well this computer has been working thus far. I've not had any issues with crashing, peripheral incompatibilitys, software incompatibilitys, system updates, etc. Everything runs smoothly and I wouldn't hesitate getting another one of these laptops in a second. They work really well and you're money is spent on the internal components rather than a flash exterior. The more I use it, the more things I discover I like about it.", "Date": "December 31, 2013"}, {"Title": "windows 8 is slow", "Author": "nascarone", "ReviewID": "R34BWXRBXCJQOU", "Overall": "2.0", "Content": "I don't know if its the computer or windows 8, but its slow and the touch screen doesn't always work correctly. I am not happy at all.", "Date": "December 4, 2013"}, {"Title": "I like DELL it is one of Best product", "Author": "tana", "ReviewID": "R1NXP0ELO1WZN8", "Overall": "5.0", "Content": "I like how worked this product, also it is pleasant qualities of a material and design. I think that Dell does the most beautiful laptops. Thank you.", "Date": "May 26, 2014"}, {"Title": "good product!!", "Author": "LearnerGB", "ReviewID": "R1HPSYE3X1QK4E", "Overall": "4.0", "Content": "Little slower than expected but yeah amazing product!! good product under budget with so many features.touch is smooth and battery life is as expected", "Date": "May 14, 2014"}, {"Title": "Nice.", "Author": "Suresh", "ReviewID": "R1ZNM806SRY3SY", "Overall": "5.0", "Content": "Touch screen is pretty nice and keypad is really good and missed back-lit. Performance is good.Overall nice laptop i like it.", "Date": "April 4, 2014"}, {"Title": "Very good entry level laptop", "Author": "Keerthi Shankar Ravikkumar", "ReviewID": "R34R6ZEVJ9SXXF", "Overall": "5.0", "Content": "This is a very good entry level touch laptop. I bought this for my dad, and he really enjoys using it. It takes a bit of time to get used to Windows 8, but that is not an issue of the laptop. It is a bit heavy in my opinion, but most 15 inch laptops are heavy, and I am comparing this to my Macbook Air which is a bit unfair. There are a lot of smudges on the screen when you touch, and needs to be cleaned regularly. The battery life is nearly 4 hours, which is good enough..", "Date": "March 24, 2014"}, {"Title": "Great machine!", "Author": "Guigui", "ReviewID": "R1DYKGBPAB81Q", "Overall": "5.0", "Content": "After a few years using my XP machine decided to buy a new one. This touch display really caught my attention. I loved the machine, fast, big screen for what I wanted, just need to get used to the new windows 8. I would recommend to anyone. I am only using it for about 2.5 months but still I am happy with the product. Gui", "Date": "March 8, 2014"}, {"Title": "very satisfied with this laptop", "Author": "Maureen E. Wroblewski", "ReviewID": "RHLGW48W4JWLZ", "Overall": "5.0", "Content": "This is my 3rd laptop. I've previously used an HP and a Dell. It is used both for personal and business activity on a daily basis.I went with the touch screen with Windows 8 and  absolutely love it. Use the tutorials and take the time to get to know how the system works and enjoy! Trying to navigate without that can be very frustrating so don't waste your time.Other than the fact that it is a little heavy to carry around,I like the screen size and having the numerical keypad. The brushed silver casing is attractive but I expect it to eventually get scratched.The only thing missing on this is the back lit keypad.", "Date": "February 14, 2014"}, {"Title": "this type is not the one described by the amazon", "Author": "zhang qiushi", "ReviewID": "R13J2RUZ6JFZ59", "Overall": "3.0", "Content": "this laptop have a beautiful outside, comfortable keyboard. I was so exiting when I saw it first. but this are two serious problem in it. first, the laptop have no function of touchscreen, it is a common LED screen. Amazon give the wrong advertisement. second, a hardware in device manager can't be drive, even I have install. so I finally return it.", "Date": "February 7, 2014"}, {"Title": "Great Laptop", "Author": "Jay", "ReviewID": "R1CX2CCAQLL3A4", "Overall": "5.0", "Content": "Very happy with the laptop. It arrived quickly and is very responsive. Took some time to get use to Windows 8, but I getting the hang of it.", "Date": "January 9, 2014"}, {"Title": "Touch experiance is awesome", "Author": "Srinibas Patnaik", "ReviewID": "RLGGEE1GB39OV", "Overall": "5.0", "Content": "Laptop with touch is very good experience. It is fast on booting and very user friendly... I recommend it... Go for it!", "Date": "September 10, 2013"}, {"Title": "It is an excellent machine", "Author": "Victor Ml Espiritu", "ReviewID": "R100DQXAIWBT47", "Overall": "4.0", "Content": "It is an excellent machine. Its only drawbacks are The monitor that is not as sharp as I expected and Windows 8 that is so crude so far.", "Date": "November 22, 2013"}, {"Title": "good touch screen", "Author": "Aleshell \"Ale\"", "ReviewID": "R3VJ1FTSBRFSEI", "Overall": "5.0", "Content": "This dell is well done, since the touch screen is very nice.The laptop is not heavy and run fast.thanks DELL!", "Date": "July 29, 2013"}, {"Title": "Nice computer", "Author": "Bethany Conover", "ReviewID": "R2M3AX90LZAGPV", "Overall": "5.0", "Content": "My son started college this fall and this is the laptop he wanted.  Loves it and it works great for him.", "Date": "September 16, 2013"}, {"Title": "Unhappy with this PC and Microsoft software...", "Author": "Anthony Grata", "ReviewID": "R3VEI519RARHW6", "Overall": "1.0", "Content": "I was not happy at all... Let me preface to say that my disappointment was probably more directed at the entire PC platform (and Windows software) than the Dell Inspiron itself, but, they are attached at the hip.10 years ago I had problems with a desktop PC... lots of mall ware, trojan horses and viruses... I spent hundreds of dollars in security software, and ended up trying to re-initialize the entire hard drive to get rid of it... within a few days it had all returned.  I was so frustrated, I immediately unplugged the computer, and took it all down to the trash dumpster, where I threw it all away... I bought a Mac the next day.  Since then (10 years), I have had effectively NO problems.About a month ago, I retired, and decided I wanted a laptop to travel with.  I bought the Dell Inspiron 15.6 touch screen.  I thought Microsoft might have cleaned up their act over the last 10 years... it looked like a good deal, and bought it.  Almost immediately, all the unwanted mall ware, and trojan horses returned.  It came with some security software, but it was worthless... I had more problems with that PC in the week I had it, than I had with the Mac in 10 years.  I called the help center, and they were very nice, but wanted to sell me HUNDREDS of dollars worth of software and support services to keep the PC clean.  I decided WHAT was I really saving?It seems to me that the Microsoft software is flawed, and allows these unwanted intrusions (possibly to CREATE an entire software security industry), when Apple has obviously found a way to limit and/or prevent them... A little calculation on my part, and I realized that the cost of the computer (which worked fine if it could keep all the mall ware from infesting it), plus the hundreds of dollars in security software, plus undoubtedly additional yearly costs... what was I really saving?I boxed it up and I returned it yesterday... I was disappointed, frustrated, and angry.  I won't ever buy a PC again.", "Date": "November 30, 2013"}, {"Title": "Windows 8 was not installed properly.", "Author": "Denise Gregory", "ReviewID": "R40XVRWDAYWHT", "Overall": "3.0", "Content": "I bought this for my son.  He is pleased with the computer except for the fact Windows 8 wasn't installed properly.", "Date": "November 2, 2013"}, {"Title": "Windows 8", "Author": "Steven Saltzberg", "ReviewID": "R29FQAK9X2JP4T", "Overall": "2.0", "Content": "Hate it. Neither fish nor fowl. Pushes you into the tablet app when you are in the desktop and it is not obvious how to move between the two wrt to sharing data files. Frankly I am sorry that I did not just get Windows 7.", "Date": "September 19, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CRGJJHU"}}