{"Reviews": [{"Title": "Slow with lack of room to grow", "Author": "Andrea Polk", "ReviewID": "R1H386TQ1SGGMK", "Overall": "3.0", "Content": "For the price you pay, there are better options available.  This HP is slower than it should be - that's the main reason for my 3 out of 5 star rating.  The build quality is good, and it has adequate features (HDMI, card reader, full-sized keyboard), but if I'm paying over four hundred, I want zippy too!  And that's lacking with this laptop.Some will blame Windows 8, but I look under the hood.  Operating systems do bog down performance, but that's only because they require certain things to perform.  This PC lacks those things at a basic level, and thus even if Windows 8 (which is actually lighter on system resources than Windows 7) was something we all enjoyed using (I don't like it either...), we'd hate it on this PC.First, the stuff I like about this one...PROS: \"All the basics are covered.\"+ 17.3-inch diagonal HD+ BrightView LED-backlit display (1600 x 900)+ DTS Sound+ AMD Radeon HD 8450G graphics with up to 2158MB total graphics memory+ Full-size keyboard with numeric keypad+ Multi-format digital media card reader for Secure Digital cards+ Front facing HP TrueVision HD Webcam with integrated digital microphone+ Wireless plus Ethernet port for wired connectivity+ 1 HDMI+ 2 SuperSpeed USB 3.0+ SuperMulti DVD burner+ Free Norton Antivirus for 60 DaysAnd now for the stuff I really don't like...CONS: \"At this price point, I'd expect more.\"- This laptop has only (1) memory slot (dimm) filled with 4GB memory stick. It can be upgraded to 8GB, but not by simply adding another 4GB.  You have to buy the more expensive 8GB of RAM to put into the (1) slot, and then you have a 4GB stick that is left unused.- Slow 5400rpm hard drive; not uncommon at this price, but a 7200rpm drive would be better.- Only 1MB L2,1600MHz DDR3; 1MB is simply not enough to keep Windows 8 happy, no matter what processor and RAM combo you have!- AMD A6 2.9 GHz (1 MB Cache); AMD isn't bad, nor is the A6 at 2.9 GHz - again, it speaks to the 1MB cache which makes this processor under perform.- Lots of HP bloatware (unnecessary software).WINDOWS 8 WOES: \"Work towards acceptance and understanding, or buy a Mac.\"I'm with you on the dislike of Windows 8, but it makes no sense to buy a PC with Windows 7, as it means going backwards. I still have a Windows 7 desktop that I use daily, but I also use a Windows 8.1 PC with a touchscreen - totally different experience and they both have their pros and cons.  Since we can't all afford Mac computers, I guess we'll have to find a happy co-existence with Win 8 and 8.1 until the next big thing comes along.I suggest a book like: Windows 8: The Missing Manual to help you get the hang of using this operating system.  Basically, it was designed for touch screens more than the point and click way of doing things, and thus some of the frustrations with using 'charms', etc... within Windows 8.THE BOTTOM LINE: \"If it's under 400, I'd consider buying it and maxing out the memory, but only if your needs are basic ones.\"This PC is limited by its lack of a second memory slot and 1MB cache.  It has no real room for upgrades and is a slow performer, priced higher than it should be at its list price.If you got it at the right price (under 400) and then purchased a 8GB memory stick like this one (Crucial Single 8GB DDR3 1600 MT/s (PC3-12800) Notebook Module, CT102464BF160B) to put into it in place of the existing 4GB, I'd consider it only if I needed a laptop with a full-sized keyboard and the 17\" screen.It would be a desktop replacement for someone like my Mom who emails, and browses the Internet, but little else. It's not an entertainment PC, or even an intermediate performer.  It's not the ideal PC for someone interested in streaming movies to Netflix, while also emailing, shopping online and instant messaging all at the same time - like me.As it is, this laptop is just OK (3 out of 5 stars).  It's slower than I'd like, but it is attractive and well built. Windows 8 isn't great, but again, it's Microsoft's current offering so we have to deal with it.  (It's not the PC's fault!)I returned this item to a local store after unboxing and playing with it a bit.  I was going to give it as a gift, but decided that it wasn't up to my standards of performance so I returned it.  Bear in mind that my standards may be higher than your standards, so again, if you get it at the right price - you may be perfectly happy with it.  It all depends upon what you want, and what PC your coming from whether you'll like it.", "Date": "October 31, 2013"}, {"Title": "4/5", "Author": "Jesse", "ReviewID": "R1GHLZBAJV08A4", "Overall": "4.0", "Content": "I love my new laptop! It's easy to use and has the raw processing power I wanted! The only downside is it didn't come with more ram. Other than that I would definitely recommend this!", "Date": "March 16, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "AMD A6 2.9 GHz (1 MB Cache)\n4 GB DDR3\n500 GB 5400 rpm Hard Drive", "Name": "HP Pavilion 17 17-e010us 17.3-Inch Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/41QgI6woH5L._SX300_.jpg", "ProductID": "B00CXFH878"}}