{"Reviews": [{"Title": "Decent Ultrabook", "Author": "Colts187 \"Drew\"", "ReviewID": "R25DRYLVJA7LQS", "Overall": "4.0", "Content": "I like the look of the computer.  It is a little \"plasticky\" feeling but not so bad. I like the keyboard.  The track pad takes some getting used to.  It just feels really hollow.  It could be a deal breaker for you.  I usually use a mouse anyways.  The two finger scrolling stuff works for the most part.  The right clicking function is a little hard to pull off though.  The screen isn't very bright and colors are a little washed out but the fact that its a decent touchscreen more than makes up for it.  The only thing that makes me consider making it three stars is the annoying fan noise.  You can always hear it.  If you play any type of game or any significant computations the fans kick into high gear and it gets pretty annoying.  I wish it had an ssd and that would prob make this computer considerably better but that comes at a price obviously.  I love that they made it 8gb of ram because its using about 4 gb already.  Nice computer overall.  I like the Samsung series 9 better but it doesn't have the number pad and its quite a bit more $.  Great business type ultra-book with the inclusion of the # pad.  Don't believe the BEATS hype.  It may get a LITTLE louder but not much.  Computer speakers just suck period.", "Date": "October 10, 2013"}, {"Title": "Nice", "Author": "Enobong Utin", "ReviewID": "R3VMZ2LFK3TCNS", "Overall": "5.0", "Content": "The laptop is awesome, I read reviews saying that there is something off about the keyboard.  I really like the laptop. Sleek and beautiful", "Date": "October 15, 2013"}, {"Title": "Like the Laptop, Not Happy with Windows 8", "Author": "GoogleGordon", "ReviewID": "R3C8HCAV9CUET1", "Overall": "3.0", "Content": "Old laptop going out, thought it time to get something more current. Like the Laptop and the price was great. When I tried twice to update to Windows 8.1 it wouldn't let me. Disappointed in that.", "Date": "April 3, 2014"}, {"Title": "This laptop has some serious issues", "Author": "G. Mcclellan", "ReviewID": "R1PZ04KCIF98KO", "Overall": "2.0", "Content": "1) When the power is turned off, the battery still drains.  This is likely due to the \"feature\" where one USB port is powered even though the computer is off.  This cannot be disabled in the BIOS, even with the latest update.  This is a common issue and has been reported to HP several times.  Search Google for \"hp envy battery drain turned off\".  The people who report this issue get nowhere - HP is clueless to resolve this issue.  This would be a deal-breaker for road warriors.2) HP does not offer any support at all for Windows 7.  If you choose to replace Windows 8 with Windows 7, you are on your own to figure out what drivers to use.  HP does not provide Windows 7 compatible drivers.3) WiFi unstable.  Intel Centrino N-2230 is still not fully baked.  Search Google for \"centrino 2230 disconnect\".  Lots of folks reporting issues, and Intel is behind the ball and asking people for help to debug it for them.  Still not resolved with the latest driver, which was downloaded using the Intel Driver Update Utility web site.", "Date": "December 30, 2013"}, {"Title": "Sleek, beautiful and fast", "Author": "Diallo Sanders", "ReviewID": "R2QM9UDT22AONN", "Overall": "4.0", "Content": "Love this laptop!!  The seller got it to me fast, the touchscreen is sooooo awesome, and it's generally just a great choice.  My only issue was that because it's so thin, it doesn't come with a DVR Drive.  So I bought and external one, which works great and wasn't expensive, so no real biggy.", "Date": "December 17, 2013"}], "ProductInfo": {"Price": "$1,098.00", "Features": "Intel Core i5 3230M 2.6 GHz\n8 GB DDR3\n750 GB 5400 rpm Hard Drive\n15.6-Inch Screen, Intel® HD graphics 4000\nWindows 8", "Name": "HP ENVY TouchSmart15 15-j040us 15.6-Inch Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/41Z4F%2BxuGZL._SX300_.jpg", "ProductID": "B00CXFH4G8"}}