{"Reviews": [{"Title": "Dell Technical Support is total fraud", "Author": "Raj", "ReviewID": "R1CADVG8NOZ26C", "Overall": "1.0", "Content": "The horrified experience I had with Dell Repair Depot has made me to write this review so that some of customers can be saved from fake promises made by Dell.I had issue with Laptop LCD hinges from day one and I was told by Dell Customer Care that it will be smooth with time but it didn't. Then finally the hinges appeared that It will come out if we press hard to close the LCD. Then we reported the problem to Dell and they created report and sent us Dell Depot Box with shipping label and during the entire they were prompt and quick. The Trouble started when the laptop reached the Repair Depot and I got a call that the hinges were not covered under warranty it has been put on hold. I was asked to pay $179.00 to get it repaired then I denied it as I was never informed earlier that hinges are not covered. I was told that my Laptop will be returned unrepaired on 07/17/2013. I didn't get any information on Laptop being shipped till 7/24/2013 and the repair depot status was showing that the Laptop is being repaired after released from hold. I called customer center and they said that it is not getting repaired and it will be send unrepaired. After so many follow-ups they sent back my Laptop which improperly packed and LCD broken by Dell.I have written to Dell Director - Customer care but till no positive response.Let me mention here that same Laptop had issue with Motherboard too which was replaced after 2 months of online troubleshooting.I never expected this unprofessional behavior from Dell that they will break my Laptop when I denied to pay extra being covered in Warranty.One of the Out Of warranty representative staff mentioned me that they can't return the Laptop in same condition in threatening way that If I do not pay $179 for which they said is not covered by warranty they can't return the Laptop in same condition in which sent.So now I have a Broken Laptop (Broken by Dell) which was unrepaired and I am not sure whom to contact for my grievances.At least I would never suggest any one to buy even a small part from Dell.http://www.amazon.com/review/R2002JCN8VMM6Q?_encoding=UTF8&asin;=B009FX7DGW&cdForum;=Fx1GNCQS2Y27IVA&cdMSG;=addedToThread&cdPage;=&cdThread;=Tx5MR0H0JUIZAR&newContentID;=Mx1KPHAV0LUAMLV&newContentNum;=2&store;=pc#CustomerDiscussionsNRPB---------------I got several calls and emails from Dell after I raised complaint with BBB about my Laptop broken by Dell Depot and they told that my Laptop LCD, Heat Sink, Hinges, Bracets are broken which needs replacement and they just need $179.00 as Diagonostic charge and they are not charging any thing for Part. Let me tell you that I have repaired my Laptop myself after going through manuals only thing which needed replacement was Laptop Base costing $16.00 which too was broken was Dell Depot.So if I would have not have repaired my Laptop myself, I would have ended Paying $179.00 (Instead of $16.00) plus Taxes. Dell stop cheating your Customers please.", "Date": "July 30, 2013"}, {"Title": "Again, Dell support is horrible.", "Author": "MWest", "ReviewID": "R12IK47L0FLILY", "Overall": "1.0", "Content": "Spoke with someone from another country and after 30 min of us trying to understand each other and them get information from me they wanted to charge me for some support upgrade to do anything. I've always been a Dell guy but not anymore. My dell Insiron is dead and I'm down 1K.", "Date": "August 9, 2013"}, {"Title": "Nice Computer...speakers are horrible", "Author": "James Bush Jr. \"RedHawkWarrior\"", "ReviewID": "R2K8LPXLD6KQQJ", "Overall": "4.0", "Content": "This is a nice computer. Plenty of memory, it boots up quickly, and has some sweet programs pre-loaded. The display is very good. There are three USB ports, a card reader, and and HDMI port. All pluses in my book. I even like Windows 8. Of course, I added a program that restores the classic Start menu. That probably makes the transition easier.The biggest drawback for me is the sound from the speakers. It is pretty bad. There are no settings that make it sound acceptable. It sounds very tinny and thin. Imagine the cheapest speakers you can imagine installed in a tomato soup can. That is what the speakers remind me of. Now, if you plug in a good set of aftermarket speakers or a decent headset, then WOW! The music becomes rich and deep. It is apparent that the music processor and software are more than adequate it is just the speakers or the computer case itself that limits the sound quality so immensely. Trust me, you do not want to start up your favorite playlist without plugging in better speakers or a good set of headphones.Just a few days ago I streamed a movie through the HDMI port to my Sony television and the music was fantastic. So, it is just the speakers and/or computer case that limit the sound.Overall, I am very satisfied with this laptop. I would recommend it to anyone looking for a moderately priced machine that can do just about anything well and a few things very well.One last thing...has anyone replaced the DVD player in this computer with a Blu-ray player or player/burner? I tried to upgrade to a B003AXW2YQ  but it was a little too thick. I need something thinner.", "Date": "August 17, 2013"}, {"Title": "I really enjoy the Dell Inspiron laptop", "Author": "Steve Monroe, Ph.D", "ReviewID": "RODNIB892JW52", "Overall": "4.0", "Content": "The Dell Inspiron laptop has proven to be a very good computer and arrived in good condition and ready to work. This one is a keeper!", "Date": "September 3, 2013"}, {"Title": "An excellent computer!", "Author": "BOGDAN V PETRENKO", "ReviewID": "R2GM2RYZITP3P9", "Overall": "5.0", "Content": "This has been an excellent computer! I have run run Ubuntu 12.04 on it. I have been totally satisfied with both this computer and Ubuntu.", "Date": "August 10, 2013"}, {"Title": "Excellent", "Author": "Jorge Sarabia", "ReviewID": "R348B55WXBT5NC", "Overall": "5.0", "Content": "This is amazing. An excellent machine for a good price. Excellent hardware and beautiful design. The best for Dell Inspiron.", "Date": "May 25, 2014"}, {"Title": "DELL Inspiron 17R i17RM-8355sLV Laptop Review", "Author": "Marvin Best", "ReviewID": "R2S7DLOJAMRFG", "Overall": "4.0", "Content": "Laptop itself was fine as expected. Documentation included and documentation available on the DELL website was extremely lacking in coverage, details, and user friendliness.  For example the specifications for this laptop states it has a \"media card reader\" built-in.  A thorough review of all documentation failed to even mention such a feature. Two phone calls to DELL also failed to provide any information on even where this accessory was supposed to be located.  Five hours of Internet research scanning user forums, FAQs, and parts references finally revealed a tiny unmarked slot 3/4 inch wide under the lip on the front of the case which was the opening for the media card reader. The factory installed Windows 8 was configured with dozens of useless apps pinned to the initial screen after login. I doubt most computer users need a pre-configured 1-click access to E-Bay, Facebook and Twitter. DELL has obviously eliminated documentation to increase profit at the demise of the customer's satisfaction.", "Date": "October 15, 2013"}, {"Title": "Rock Solid..", "Author": "Koala", "ReviewID": "R1ZCP5SSPGCAN7", "Overall": "5.0", "Content": "Does the job, arrived on time, price was right, fuse was included,quality looks real good... would recommend it and buy it again.", "Date": "September 21, 2013"}, {"Title": "Connectivity issues", "Author": "Renan Henrique", "ReviewID": "R1QRZ089N8EB71", "Overall": "3.0", "Content": "I have always to click on troubleshoot problems for accessing internet and it takes around 5 minutos everytime I turn the computer on.", "Date": "October 9, 2013"}, {"Title": "Love me Dell", "Author": "Lynette Novak", "ReviewID": "R3V49LQ02H9010", "Overall": "5.0", "Content": "Love the 17\" screen and the price beat all the big box stores.  And since I live near a distribution center it was here in less than 24 hours with no additional cost of shipping.", "Date": "October 14, 2013"}], "ProductInfo": {"Price": "$849.99", "Features": "Intel Core i7 3537U 2.0 GHz (4.0 MB Cache)\n8 GB DDR3\n1000.0 GB 5400.0 rpm Hard Drive\n17.3-Inch Screen, Intel HD Graphics 4000\nWindows 8", "Name": "Dell Inspiron 17R i17RM-8355sLV 17.3-Inch Laptop (Moon Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2BgRhiaDyL._SY300_.jpg", "ProductID": "B00CRGJFT2"}}