{"Reviews": [{"Title": "Excellent 11.6 inch Windows 7 Notebook", "Author": "Edward J. Doura", "ReviewID": "R2G1KKD9R4WE4N", "Overall": "5.0", "Content": "Long story short.  I wanted an inexpensive 11.6 inch notebook with Windows 7 to travel with and use in and around my home.  I found it with the Acer V5-131-2629.When I discovered this Windows 7 laptop, I was excited to find that it was still available in mass quantities.  In fact, mine was manufactured only a couple of months ago.  I really didn't want to go the Windows 8 route for what I was trying to accomplish with this laptop.This laptop had everything I was looking for; Windows 7 Home Premium, Intel Celeron 1007U 1.5 GHz dual core processor, 11.6\" screen (1366x768), 4GB DDR3 ram memory, 500GB hard drive, Intel GMA HD Graphics, WIFI A, G, N and Bluetooth 4.0.  It also has three USB ports (2.0) and not 3.0 as advertised along with HDMI, VGA and Ethernet ports.  It also comes with a 6-cell lithium ion battery with a battery life of 6.5 hours.  The battery does protrude at the bottom of the laptop, but in turn gives it a nice angle to use.  You can order a four cell battery replacement if you want a slimmer and flush look to the laptop at the expense of battery life.  I ordered one and will use the 6-cell battery as a spare.The laptop itself has a great design and form factor.  If you have seen Acer's Chromebook C710 11.6\" laptop, this is the same exact laptop, but in black and the inclusion of Windows 7. The chiclet keyboard and screen are very good.  It is very easy to open the back panel for any user upgrades such as upgrading the ram or hard drive to an SSD.  All you have to do is remove one screw and slide the back panel off.After using this laptop, I'm very pleased with it.  The Windows Experience Index rates it 4.4 out of the box with no upgrades. It is very fast and has no problems streaming 1080p video.  I have noticed no lag at all.If you want the flexibility of a laptop without the limitations of a tablet, this Acer laptop offers lots of bang and a real good look for the buck.  I strongly recommend it.I have a video of the laptop hands on.  Check out my youtube channel HDiNDEMAND.", "Date": "July 20, 2013"}, {"Title": "Great Notebook for the Price", "Author": "P. Holowaty", "ReviewID": "R1VQGD8FU0Z30V", "Overall": "5.0", "Content": "I am upgrading to this unit from an Aspire One 751, which was also based on a dual-core Celeron but from the Core2 generation. Other than not being a fan of click pads (industry standard these days) and the lousy internal speakers, it's hard for me to find things about this notebook I don't like, especially considering the $350 price tag. I was surprised to see that Acer didn't cheap out and provided a nice 6-cell battery.I had pretty specific criteria when considering a replacement for my old model:-A low-end CULV ivy bridge intel CPU that doesn't produce too much heat-RAM expansion up to at least 8GB-11.6\" Matte LCD screen-Windows 7 or Linux-Decent battery life (4+ hours per charge in real world use)-Low CostThis was really the only one out there I could find that met all my demands.I also learned that Celeron 1007U in this model has Intel HD 2500 graphics, which is supposed to be supported in OSX 10.8, so this could possibly be a good contender for running OSX86.I'll give this one 4.5/5 stars for the lousy speakers (you get what you pay for)", "Date": "July 21, 2013"}, {"Title": "I made a good choice.", "Author": "Jennifer Dages", "ReviewID": "R134L7ZDE44GAU", "Overall": "5.0", "Content": "Although I only got this laptop this week I am very pleased with it.  I was looking for something in between a regular laptop and a tablet and this is it.  It only weights about 3 lbs which is perfect.  It still has a full keyboard and a 12 inch screen so it is not hard for me to use but it is light to carry around.  I did order a case for it.  It came easy to set up for a wireless network.  I got Skype loaded right away and it is great b/c it has a camera installed so works well with Skype.  I wanted Windows 7 and it has that so I am also pleased with that.  So far the battery life seems decent and I am trying to keep it charged up for when I leave the house with it.", "Date": "July 25, 2013"}, {"Title": "For the price, I'm liking it a lot", "Author": "Hawke", "ReviewID": "R2SU9SAQF70Z4K", "Overall": "5.0", "Content": "I've had the laptop for a few days, so this is just a first impressions, but it seems pretty good so far. My last laptop was a 17\" ASUS gaming machine, which performed admirably, but having since built my own desktop and really settling into the college life, I found myself wanting something smaller and less cumbersome, not to mention that the ASUS had been slowly developing problems ever since I bought it about 4 years ago.So for this purchase, I was looking for something cheap, mostly as a mobile programming terminal, and this thing performs quite well in that aspect. It's quite small and lightweight, and has some really good battery life. I turned it on this morning at about 11 o'clock to check a few things before going to class and have had it on -or at least asleep- ever since (for reference, it's about 5:30 and I still have 28% remaining, which the computer claims is still well over an hour). It's certainly better than my old laptop which only just recently (thanks to a driver update) managed to pull just over 2 hours.The only downsides so far are that the speakers are pretty awful, but then again this should be expected and is easily counteracted by some earbuds or external speakers, and the mousepad is a little hard to use if you have big hands, but I pretty much always carry a wireless mouse with me anyways, so that still hardly an issue.Overall:Pros-* Good battery life (easily 5-6 hours, more if you put it to sleep when not in use and dim the screen)* Nice keyboard, even for those with large hands* Decent boot time (takes about 45 seconds or so; could be made faster with an SSD)* Comes with Windows 7, for those of us that still enjoy the interfaceCons-* Speakers are bad (but why would you be using them anyway?)* Touchpad is mediocre and takes some fiddling to work with, but workableWill update if anything of note comes up.[Random Update: 3/22/2014]It's been a little over a semester since I bought this thing, so I guess a quick update couldn't hurt.Since finishing out the last semester, I've replaced the Windows 7 install with #! [Crunchbang] Linux. It took the replacement very well, though trying to get the Bluetooth to work properly under the new OS is proving quite annoying (not that I ever used it anyway :P).Still, it works beautifully. It runs a few games really well under Linux, and under Windows it would run things like Risk of Rain and Hearthstone quite well. Bumping up the star rating since I've gotten used to the touch pad and I'm still loving it some 6 months later.", "Date": "August 29, 2013"}, {"Title": "This is a great little PC", "Author": "johnw", "ReviewID": "R33K9C6B00W3ZI", "Overall": "5.0", "Content": "I have had an Acer Aspire One AO150 for a few years and have been very pleased with it. Unfortunately, it runs XP and Microsoft is dropping support next April. I really didn't want Windows 8 so I felt between a rock and a hard place. The V5 has helped me escape this dilemma.  While small and light, with great battery time owing to its 6-cell battery, my Aspire One was a netbook, i.e. it had alimited Atom CPU and 1GB of memory, not really enough power to handle upgrading. The V5 doesn't have those limitations. With a Celeron CPU, 4GB memory , 500GB HDD, a full 1366x768 display and HDMI, it has all the features of a low-end 15\" laptop but only weighs 3 lbs. The V5 also has the 6-cell pack and hopefully has the same battery life as the smaller Aspire One.  One thing I really liked about the Aspire One was its keyboard, which was small but had a nice feel, not cheap like the Asus eeePC. The V5 has the same feel but its keyboard about the same size as a 15\" PC, so it's easy to type on.  I really don't know why anyone would want to buy an overpriced, underpowered tablet when the Acer V5 has most of the features ( light weight, long battery life ) and none of the hassles one can have using a tablet. Many people end up adding a keyboard to their tablet - this one has a nice keyboard built-in and only 480+GB more disk space. In sum, the V5 is a real computer, only just a little smaller.", "Date": "October 15, 2013"}, {"Title": "11.6\" Acer Aspire Notebook", "Author": "Maurice", "ReviewID": "R378NIP0PLS5FA", "Overall": "4.0", "Content": "My three plus year old Acer Aspire one Netbook started to cause me problems, slow and overheating.I found this Acer Aspire V5-131 on Amazon for a good price with Windows 7, which I wanted.They advertised 3 USB 3 ports.  Which it did not have, only 3 USB 2 ports.  That is why I gave it only 4 stars.It seems like a very good Notebook, small with full size keyboard.Boots in 45 seconds.Battery life is over 5 hours.I ran a two hour movie from the hard drive 2 and 1/2 times until the battery dropped to 10%.  (a little over 5 hours)Screen brightness was on at almost full for the duration of my test.Windows Experience Index is 4.5.  Plays, with no problems, all the video types that I tried including .mts files from my camera.Audio from the small speakers is poor but I expected this.HDMI work good, Bluetooth works good, and the WiFi sensitivity is good.I tried converting my camera video (.mts files) to .wmv.  Processor ran at 90 to 100 percent and CPU temp never got over 60 C.I would recommend this laptop it to anyone who needs a simple computer.You should have good eyesite for this small screen though.I might install a solid state drive to give it more speed and longer battery life.Update May 2014:I installed a Samsung model 840, 250GB SSD, and the Windows Experience Index moved up to 6.6.I am ordering another 4 GB of ram from Amazon then I will update this review again.Best travel laptop that I ever had and I have had many since the Window 95 days.", "Date": "August 29, 2013"}, {"Title": "Surprisingly powerful little laptop. Although not perfect, it is an excellent buy considering the price and functionality.", "Author": "Jason", "ReviewID": "R6G43M2QEKZTA", "Overall": "4.0", "Content": "Pros:+Windows 7 64-bit instead of the woeful windows 8 means this laptop is way more user-friendly and less frustrating to use.+Very small, lightweight, and portable!!+Powerful (fully functional PC as opposed to a chromebook that doesn't allow for Microsoft Office etc.)+Fast bootup times and operating system (especially once you remove bloatware and disable unnecessary visual perks)+Long battery life, especially if yours comes with the 6-cell battery (6.5 hour life with low-resource programs)+Wifi works great and it also has bluetooth for wireless mouse, a webcam, and an SD card reader+Has 3 usb ports, a vga output and an HDMI output so it is great for presentations with projectors+Not a touchscreen (those things are so imprecise and frustrating)+Very reasonably priced (especially compared to tablets that are less functional!)Cons:-The 6-cell battery is larger and does not sit flush with laptop case so it makes the laptop sit at an angle. Although this doesn't really impact functionality, it looks a bit odd.-The \"home\" and \"end\" functions can only be used when holding the Function key which takes some getting used to, especially for complex keyboard tasks like \"ctrl, shift, home\" (which becomes \"ctrl, shift, function, home\"). Likewise, the arrow keys and page up/page down keys are very small.-It has a trackpad (though to be fair, I have a bias against all of them). Although the laptop does come with software to customize the trackpad a great deal (including scrolling, two-finger commands, 3-finger commands, etc.), I personally prefer a mouse.-Acer, like most brands nowadays, pre-installs a fair amount of bloatware so it took me an hour or two to get rid of all the unnecessary programs and trial-version software.Final thoughts:If you want a very small, yet powerful windows-based laptop that does not have Windows 8, this is the best one I could find after days of searching. Although it does have a few quirks and some bloatware to remove, after several days of intensive usage in graduate school I must say I am extremely pleased with this product. I got this laptop because I already have a gaming PC at home so I just needed something for grad school so that I could work away from home when needed. If this were my only PC, I would probably get something with a larger screen. That being said, you can always customize windows and zoom-in in your browsers and programs to maximize the monitor it does have. For an on-the-go workstation, this laptop works marvelously. One other thing to keep in mind is that because this laptop does not have a disc-drive, it is advisable to make an image of windows 7 on a usb flash drive, which requires around 14 gb of space. Something to consider.", "Date": "November 26, 2013"}, {"Title": "not bad", "Author": "Tx", "ReviewID": "R3346PNWTOKDVV", "Overall": "3.0", "Content": "I tried a similar windows 8 computer, hated win 8, returned it and bought this instead.  Its a pretty decent computer.  It has severe flaws with the mouse and keyboard.  The speakers are weak.  Ive had it about 4 months nows.  The hardware and graphics card are good.  I play skyrim on med settings.  The battery is good, and its very portable and quiet.  With the exception of the mouse and keyboard its a very good computer , but as-is 3 stars.", "Date": "October 28, 2013"}, {"Title": "Nice little computer", "Author": "D \"D\"", "ReviewID": "R3ED1PYVP6VAEZ", "Overall": "4.0", "Content": "This was a gift for my husband, it works well and he loves it. The windows 7 is what I was wanting since I didn't want the win8, he is used to the vista and 7, the 8 would have had a learning curve. Everything works great except it seems to have a problem keeping an internet signal. It can lose it sometimes completely. I have no problem with any other device in the house so it has to be this little computer. I don't know what is wrong and it doesn't do it constantly.Other than that problem it works well, I just wish it had a dvd drive, I bought an external to go with it but that is just something more to carry around.The size is great, so easy to carry around, it is small like a chromebook and seems to have a lot of power and speed for the small size.", "Date": "September 24, 2013"}, {"Title": "Love my first Acer", "Author": "SET2011", "ReviewID": "R1EIRRCWSXZU2O", "Overall": "5.0", "Content": "I've been using this for a couple of months.  I bought it because I had to travel a lot and needed a computer, not a tablet, but regular laptops were too heavy.  This is small and lightweight.  It has Windows 7 (which I wanted instead of Windows 8).  I loaded it with MS Office 2007 (which I'm used to).  It has THREE usb ports which really comes in handy when I want to use a mouse, a flashdrive, and my mi-fi plugged in instead of as a hotspot.  I hope that it lasts because I want to use it for a long time.  I'm not a \"techy\" person who wants all the new toys on the market.  I just want and appreciate something that's reliable and does the job.  So far, this Acer has been doing the job for me.  .", "Date": "April 4, 2014"}, {"Title": "Works Great", "Author": "oldladygamer", "ReviewID": "R3O2MQ12V83KQ5", "Overall": "5.0", "Content": "Easy to set up & Just the right size - for the money a awesome Deal !!! and it fits in my briefcase with ease", "Date": "September 8, 2013"}, {"Title": "Dead on arrival - Corrupted Operating System Files", "Author": "NJML", "ReviewID": "R3R79BUZVWL3UP", "Overall": "1.0", "Content": "Turning the system on the message 'No bootable device - - insert boot sidk an press any key' appeared.  Chatting with Acer support, I was advised the problem was corrupted operating system files.  And I was advised to purchase a recovery disk on the Acer website.  The service rep finally suggested they send me the disk after some prodding on why I should pay to fix a defective item just received.  Decided to simply return.  Great advantage for shopping at Amazon to process returns quickly.", "Date": "December 6, 2013"}, {"Title": "An upgrade from my old netbook even though some features are added and some are missing", "Author": "Amazon Customer \"Tomasthanes\"", "ReviewID": "R1SX7C2EDR4OQ1", "Overall": "2.0", "Content": "I purchased this netbook to replace an aging (and failing) Acer Aspire 1410, so my comments are relative to that older (same size) Acer netbook.  Both have 11.6\" screens.This newer netbook has no hard drive or network lights.  This makes it a bit harder to subjectively gauge whether the system is actually working or not.  I suspect that the hard drive is a bit slower as well (even though it is twice as large as the older netbook).  I'm not sure why any netbook comes with anything other than an SSD.This newer model is a 2 core with 4GB of RAM; the older netbook was a single core with 2GB of RAM.  I doubled that netbook's RAM to 4GB; I'll eventually double this netbook's RAM to 8GB.There are no left/right buttons on the touch pad the way there was on the older netbook.The keyboard looks cheaper on the new netbook but it is surprisingly good.  I chose this netbook originally because it has a near full size keyboard; this new netbook has a keyboard with \"chicklet\" keys that are about 1/8\" smaller.The USB ports are 2.0.  Why would any computer sold in 2013 NOT have USB 3.0 ports?There was a surprising amount of \"bloatware\" that came with this machine.  I removed 17 separate packages before starting to install my own software.The fan, when it kicks in, is noisier than the older netbook.Now the good things: it has built-in Bluetooth and an SD (multi-card) reader.  The bigger battery causes the netbook to tilt up a little bit when its on a table; I like that angle better than the older netbook.So far, so good.  I'm hoping to use this netbook for a USB wind instrument computer.UPDATE: 11/1624 hours after receiving this computer all networking (wireless/wired) failed.  According to the Device Manager, it didn't see any networking hardware at all.  I re-seated the \"WLAN\" card inside and re-installed the LAN device drivers.  [BlueTooth was working.]I called Acer tech support and the only thing they could do for me is to have me ship it to them for 7-10 days while they repaired it.  Amazon, giving amazing customer service, allowed me to return the netbook for a refund.  +1 Amazon, -1 Acer.I will probably never purchase another Acer product.", "Date": "November 15, 2013"}, {"Title": "Good enough for the price.", "Author": "Tyler Sanford \"TylerStorm\"", "ReviewID": "RWEGSXSFKAXM9", "Overall": "4.0", "Content": "It's cheap. Due to that fact, you can't expect too much. It's not amazingly fast, but I knew that before I bought it.It plays 720p video off youtube without a problem. The keyboard and touchpad are pretty mediocre but not terribly bad either.The whole bottom is detachable which makes upgrades relatively easy.Pros:-Looks good for the most part.-It's got a matte screen. (Biggest pro in my opinion.)-Battery life is good enough (approx. 4 to 5 hrs. in the real world)Cons:-Cheap plastic construction (doesn't feel very durable.)-The battery protrudes from the bottom quite a bit.For the price, this thing is just fine. Now, if it were $600, I would give it one star.", "Date": "November 29, 2013"}, {"Title": "Not a bad little laptop for the price", "Author": "Dane M.", "ReviewID": "R3FRL41341TD26", "Overall": "4.0", "Content": "I purchased this laptop because it seemed to be a good compromise between power, size, and price, and so far it hasn't disappointed. I needed compact size since I would be putting it in my brief case and taking into my insurance office with me every day, then taking it back home and using it there periodically. I also wanted good battery life, so I wouldn't have to plug it in when I was at work. I sometimes have several web pages from standard internet sites, as well as several from the company's intranet servers open at the same time, along with Outlook, and maybe a word doc or two, so I wanted something with at least 4 gig of memory. A good screen was essential after spending 3 years squinting at a dull, washed out old IBM T42.This Aspire V5 has met all of those criteria quite well. It's light and compact so it's very easy to pack up and carry. The battery lasts a solid 4-5.5 hours under fairly rigorous use, and it has enough power to handle doing a number of tasks at once. I occasionally will watch a netflix video or youtube video on it while eating lunch, or before going to bed, and even 1040 hd videos play smoothly. This is a HUGE improvement from my old T42 with 2 gigs of memory running XP. Even 480p videos would stall out and buffer with that one.Only a few small complaints with it. The IBM was slow and antiquated, but it had a GREAT keyboard. This Aspire's keyboard is functional, and that's about it. The track pad is a bit squirrely at times- sometimes too sensitive, and sometimes a bit unresponsive, but it's usable. All in all, it's probably one of the best $329 options out there if you're looking for something extremely portable with good battery life.", "Date": "October 2, 2013"}, {"Title": "Loaded with garbage programs and poor customer support", "Author": "Byron Fitzgerald", "ReviewID": "RIKPLSFC77GKO", "Overall": "3.0", "Content": "I use the computer in the TV room and its primary use is to provide access to emails I can read while watching TV.  When I first got it I found it was loaded with programs I did not want or need and when I removed them the computer seized up and I had to do a factory reboot to get it started again.  It really balked when I removed the factory anti-virus program and added Security Essentials and really gagged when I loaded Microsoft Office. When I add new programs it takes an impossible time to process the additions and I am afraid that the machine has frozen up because it takes it so long to process new additions.  To help solve the processing time problem I decided to upgrade the machine to 8GB RAM and ordered the chips to do the upgrade.  Although Acer advertises the computer as 8 GB machine, there are no instructions in the operator's manual on how to open the machine to add the chips nor can I find the chips for sale on the Acer web site.  After looking for several hours for instructions on how to open the machine to add the chips, I finally gave up and called customer support.  Much to my displeasure, the off shore tech rep I spoke with told me they did not want me to open the machine and that if I did my warranty would be voided.  They declined to give instructions on how to gain access to the RAM chip area.  It appeared that there is an access plate on the bottom of the machine that needed to come off and this is held by a single screw.  I was hesitant to remove the back plate without instructions because it was not obvious whether the plate snapped or slid into position and I did not want to damage it by putting pressure in the wrong place.  I did find an excellent internet site that explained how to open the back plate (it slides to the front after removal of the one retaining screw) and I was able to add the chips to upgrade the machine to 8 GB. The RAM upgrade has not appreciably improved the performance of the computer and at random times it takes considerable time to boot up. The audio volume is quite low and virtually unusable in a room with any background activity. As an overall evaluation, it has been a real challenge to purge the machine of garbage software and add the programs I normally use and the customer support from Acer leaves much to be desired.  Cannot recommend for purchase.", "Date": "December 20, 2013"}, {"Title": "Great travel computer", "Author": "Amazon Customer", "ReviewID": "RJQLQEQOVIYQ8", "Overall": "5.0", "Content": "I have a number of physically large heavy powerful laptops.  I have always traveled with them and they make going through security harder, and lugging them form hotel room to meeting rooms harder.  My iPad just isn't enough and can't do the things I need. I'm sure a macbook air would be wonderful.  But at a fraction of the cost I've been completely satisfied this this little machine. And if it gets lost while traveling, it's not a major disaster to replace.", "Date": "April 13, 2014"}, {"Title": "I love Acer!", "Author": "J.", "ReviewID": "RR24KS7SK2C89", "Overall": "5.0", "Content": "I have an Acer Aspire M with an I5 processor and it is a great laptop. So I wanted something smaller like a tablet. After researching tablets I found that when you bought the optional keyboard you spent more than this unit. And this is a real computer that I need to run Microsoft Office and all its programs which it does flawlessly.  This is a great computer that uses Windows 7  (this was another huge reason!!)  It is just like all my desktops and laptop. (So I don't love Win 8....)Computer is so light.  Bought a neoprene zip cover for it and it feels like I am toting around a book.Great laptop!", "Date": "March 16, 2014"}, {"Title": "Simple \"netbook\" that works ok", "Author": "Sam Gummy \"bosho12\"", "ReviewID": "R37433080I4067", "Overall": "3.0", "Content": "Pros:  Small size with decent performance  Mouse pad works very well  Extended battery (included) extends power to 6 hours  Based on my previous Acer Aspire, I find it very reliable.Cons: Overpriced  LED screen has poor resolution with streaming Netflix. My older version of same netbook had a better screen  Even with an upgraded memory to 8 gig and it's 1.5ghz processor it struggles to stream Netflix on Public WiFi.Recommended if available at $250. or less. I paid $330.", "Date": "March 13, 2014"}, {"Title": "My first real attempt at portable computing.", "Author": "bryan wilson", "ReviewID": "RA2MMRQRR7TEF", "Overall": "5.0", "Content": "Since my first laptop lasted all of two hours (a rash choice that I regret now), I decided to take a better look at what I wanted.  It needed to be 1) Windows 7 powered, 2) have a decent battery life, 3) be as portable as possible, and 4) be reasonably priced.  I think I found it in this little gem.  It powers my high def movies and TV shows just great, it plays my old games just fine, and it has huge storage space.  Best of all, it does all this while being pretty darn speedy!  What convinced me that this would be a good machine is a friend of mine owning an Acer netbook and giving rave reviews.Yes, the sound from the speakers is pretty poor, invest in some headphones or perhaps a set of peripheral speakers.  And if you must burn discs, you can get a very reasonably priced external burner for less than $30.", "Date": "February 18, 2014"}, {"Title": "LEGIT little computer!", "Author": "Francisco", "ReviewID": "R3K71TG8K99MPX", "Overall": "5.0", "Content": "This Acer does everything I need it to do. I'm not a big computer user. I just needed something to write papers when needed, surf the net and even watch Netflix (with no lag)... Its quite fast. Its great for a basic college student. Of course I'm not planning on editing videos or do any gaming. I bought this to simply surf the web and research things needed for class. The basic free edition of Windows Office works for me. I will add that the battery life is fantastic! I squeeze about 10.5 hrs out of it. Of course I'm not watching videos and movies.. All in All if your a simple web surfer or want something small and SUPER light to carry around. I recommend this.. Then again who am I to recommend anything. Try it out for your self. I'm only reviewing this so I stop getting amazon notifications haha..", "Date": "January 25, 2014"}, {"Title": "Exactly the right size for a truly portable computer.", "Author": "Patricia C. Billingsley", "ReviewID": "R3KU0YLQFCETKK", "Overall": "5.0", "Content": "Exactly the right size, big enough to see the screen (my older Acer was only a 7\" screen, too small) yet small and light to traqnsport.  And windows 7 works like a charm. I hope it lasts for years, as my old Acer did!", "Date": "December 5, 2013"}, {"Title": "Great Replacement", "Author": "Amazon Customer \"Mary Lee Propst\"", "ReviewID": "RBL9CZIJMN9HO", "Overall": "5.0", "Content": "It arrived just as ordered. The 11.6\" format makes it a bit easier to use than my previous netbook which was 10.1\". It has more storage and seems to be a bit quicker than my old one. The keyboard is noticeably larger, making it easier to type. The windows 7 operating system allows me to keep all of the software that I had been using.  A number of programs would have required replacement, costing me as much as the computer did.  So, I'm very happy..", "Date": "November 6, 2013"}, {"Title": "Everything I wanted", "Author": "Tami Tobolski", "ReviewID": "R1BG2R3WS9IJYJ", "Overall": "5.0", "Content": "I am writing this review on my new Acer after a few months of use.  For what I use it for, this is the perfect laptop.  It can run a couple of programs at a time, including ITunes and internet, while still maintaining speed and usability.  I have found that if I am working in a program, listening to music and trying to open a pdf attachment the computer can hang up for a couple of seconds, but this is minor.  Since I use my laptop for writing and surfing, nothing could be better. And, I was able to order it with Windows 7, which is a clear bonus since I hate Windows 8. Overall, a great little laptop.", "Date": "October 15, 2013"}, {"Title": "Great little netbook", "Author": "Ed", "ReviewID": "R35V9JLXRE4U83", "Overall": "4.0", "Content": "To start off, this netbook originally was meant to be a Windows 8 but for some reason, Acer decided to downgrade them to Windows 7 (maybe because they are selling more with Win7 than Win8). The reason I know that is look at the Windows Logo on the keyboard. The \"squared\" Windows Logo belong to Windows 8. The netbook is a great little one. I am able to watch Youtube, movies off AmazonPrime, Hulu, and tv shows from their official site without a problem. Although I will say the speakers do not sound the greatest. I would suggest go into the speaker settings and play with the enhancements to make it sound a bit better. I would have definitely preferred if they were on the top part rather than on the bottom part. It can easily be upgraded to 8GB of ram. All you need is (1) 4GB ram stick. It will definitely help with the speed. I noticed an improvement. This netbook would have been a perfect 5 star for me if it had better sound. Otherwise great little netbook with Windows 7!", "Date": "October 21, 2013"}, {"Title": "satisfied so far", "Author": "pemberjd", "ReviewID": "R1HDG7AVJG39UR", "Overall": "5.0", "Content": "very little bloatware and wifi antenna much better than more expensive lenovo edge. easy to carry around very light.had to uninstall mcafee virus software because it wouldn't register but i had 3 computer norton virus detector so no problemwould recommend", "Date": "February 10, 2014"}, {"Title": "10 minute setup!", "Author": "Honey Solomon", "ReviewID": "R27H1TGMYNM0U6", "Overall": "5.0", "Content": "Read the  technical reviews for this terrific 11.6\" computer! Light weight and oh so easy to use . . . for those of us who dislike Windows 8, it would seem to be the perfect answer. Tweaking a Windows 8 computer isn't all that difficult but when it has a 'touch screen,' it can be frustrating. The ASUS 11.6\" is a reasonable computer/tablet for $300.00 but it is now in second place. No problems with this computer . . . added the SANOXY USB External CD DVD RW Burner Drive For Acer Aspire one and the  Case Logic AUA-311 11.6-Inch Laptop and iPad Slim Case (Black) for a great way to keep all the accessories in one convenient place. Very pleased with these purchases!First month update: The more I use this computer, the more I realize what a great choice it is for me! The mouse pad can be used to increase or decrease viewing size and there is an 'on screen' notification for CAPS LOCK. Windows updates are immediate and you may need to download Flash Player for 'Amazon instant videos' . . . smooth streaming and stereo earbuds allow for a crisp audio. Terrific!March is here and this computer hasn't had any problems! The mouse pad remains responsive and now I will add, 'grandchild approved!' My 6 year old granddaughter watched an instant video (her 4 year old brother insisted on 'Diego' ). A bit hesitant about allowing a child to use what has become my favorite PC! She enjoyed 'Penguins of Madagascar' and even used 'Paint.' She is computer literate and accustomed to using her Kindle Fire . . . her question? \"Can I trade the big one you gave me for this one? I REALLY really love it!\"", "Date": "February 1, 2014"}, {"Title": "Great laptop for the price", "Author": "Parish", "ReviewID": "R3RV81SQ77B3QW", "Overall": "5.0", "Content": "I've been using this laptop for a while now and am very happy with my purchase.  Out of the box I noticed how small it was and was exactly what I was looking for.  I want the portability of a tablet, without the limitations of a tablet and that's where this laptop comes into play.  It runs Windows 7 which is a plus so you don't have to deal with the Windows 8 nonsense for those who prefer not to use Windows 8 (me included).  It is pretty snappy and starts up in about 30 seconds which is good enough for me.Right away there was tons of bloatware.  It took about an hour of uninstalling to take it off.  But it's simply uninstalling from control panel, not any of the crazy uninstall processes some bloatware makes you go through.  I feel like the keyboard is slightly smaller than a full size one, but after using it for a while you get used to it pretty quick and can make the transition.  Just those few days you will miss a keystroke here and there, but it is nothing big to worry about.  The arrow keys are pretty small, but they are still definitely usable.  The touch pad is the kind where the track pad also pushes down in the appropriate places for left and right mouse clicks.  I have dealt with this kind of touch pad before so it didn't bother me, but I can see how some people hate it.  You can also tap it to click too which leads to accidental clicks sometimes.  The HDMI port is also a very nice feature and is straight plug and play.  The laptop does emit heat after extended use on the bottom and is warm on your lap, but by far less heat produced than any other laptop I have used.Also some people may not realize this laptop does not have a disc drive in it.  All you have to do is simply copy and paste files onto a flash drive or use a cloud service, but for some people that do not have either option then not having a disc drive may be a problem for them.Another huge issue other people complain about are the speakers.  While they are pretty bad, they are still usable.  The sound quality is similar to as if you turn up the volume using headphones and use the headphones on full blast as make-shift speakers.  But once you plug headphones into it, the quality is just fine, so it's not a hardware issue that turns into bad sound all the time.  If you plan on using headphones most of the time, you're fine.I mainly use this when I'm away from my desktop or traveling.  I do game quite a bit and have run many basic games on Steam with it just fine.  I do recommend investing in a wireless mouse if you are not used to gaming with a track pad because it is not for everyone.I eventually upgraded to 8 GB of RAM and the laptop responded and is even snappier.  Definitely a must buy in my book.The few things that are wrong with it are very minor things.  The battery sticks out about two inches.  It gives the keyboard a nice angle to type on when on a desk.  However the product picture shows it being flush, which it definitely is not and may be a deal breaker if that's what you're looking for.  Another thing is sometimes the fan starts making odd noises, I simply tap (very gently) near the fan and it goes away.  It doesn't happen often but it happens once in a while.  The sound as mentioned earlier isn't the best, but it can be solved with headphones.  The visibility of the screen on different angles isn't bad for me at all, I don't mind adjusting the screen and what not but I can see how it would really annoy other people.Pros:- Fast performance- Expandable to 8 GB of RAM- Small & light- Battery life- Quick start up & shut down- Windows 7 (for those who aren't a fan of 8)- Does not get really hot on your lap (other laptops get painfully hot after extended use)Cons:- Battery protrudes- Fan sometimes makes odd noises (quite rare)- Lots of bloatware", "Date": "December 31, 2013"}, {"Title": "Terrible product", "Author": "Amazon Customer", "ReviewID": "R27WVYN0CPBQRX", "Overall": "1.0", "Content": "After about 2 months, touchpad gave out on me without any hope of being fixed. My husband is a computer technologist and cannot get this one figured out. I guess I wasted my money. I am truly upset. Don't make the mistake I did. Pay a few dollars more and get something better.", "Date": "February 27, 2014"}, {"Title": "Bad Experience!", "Author": "ShaRhan", "ReviewID": "R194VRQVLT50I5", "Overall": "1.0", "Content": "I received this unit second hand - it was obviously a returned item.  The box was not factory new (dirty and had all kinds of labels on it covering the original surface).  I opened it anyway.  I probably would have kept it, if I could have used it though.  BUT.... the first owner apparently returned it to the seller without removing her/his password!  The seller did not do a good job with this order so I am sending it back.  \"Thank you\" Amazon for making it easy to return stuff.", "Date": "December 31, 2013"}, {"Title": "Hair-pulling frustration with touchpad.", "Author": "Dr. Green", "ReviewID": "R2TVROA70TXCK2", "Overall": "1.0", "Content": "I purchased an Acer laptop three years ago and was mostly pleased with it. When it broke I wanted another Acer and chose the V5. I deeply regret the decision. My first Acer had a mouse touchpad that was difficult to use; it was not very responsive to touch and at times had a mind of its own. I thought in three years Acer would have been able to improve on this but the opposite is true. The Aspire V5 is absolutely awful. Not only have they eliminated the right/left click buttons, but the sensitivity is even worse and around half the time you are unable to even move the mouse. I spent a lot of time in the control panel trying to adjust the settings with no improvement. There are no updated drivers available for download online.You know how a typical mouse behaves after the trackball gets gunked up with hair and dirt? That's how this touchpad behaves fresh out of the box. It's hair-pulling frustration trying to do anything except type with this laptop. Pick a different one and maybe stay away from Acer entirely.", "Date": "November 26, 2013"}, {"Title": "Perfect for me", "Author": "Elizabeth Wolfe", "ReviewID": "R2XOR2RRCR3DY0", "Overall": "5.0", "Content": "I purchased the Acer Aspire V5 about a month ago.  I had the smaller Acer which was working fine, but unfortunately had XP so I was forced to look for something else.  I was very pleased when  I stumbled across the Aspire V5 with Windows 7 and the 11.6 screen.  Everything else I looked at 8.0 or 8.1, I did not want the touch screen. I travel a lot and need something small to carry with me. I am very satisfied so far. No complaints on speed and like the keyboard.  Only negative is that the description given on Amazon was that there was 1- 3.0 USB and 2- 2.0 USBs, machine came with 3- 2.0 USBs.  So far I have not found this to be a problem. For my use this is an excellent machine and I would recommend it to anyone that wants a small, lightweight, easy to use computer.", "Date": "April 25, 2014"}, {"Title": "Clear Manufacturing Defect and Horrible Warranty Service", "Author": "Greywulff", "ReviewID": "REATHEI6DJ9FG", "Overall": "1.0", "Content": "Do not buy this laptop. I purchased this laptop in December and the casing that covers the keyboard has already started to crack in two places from normal, light use.  I inquired with warranty service about getting it fixed and was first told that it was not covered.  After talking with a supervisor, they informed me that my only option was to ship my laptop to Texas for two weeks to have them look at it to decide if they would repair it (no guarantee of repair) (I live in Seattle.).  This is clearly a manufacturing defect in the product in that the covering around the keys is not strong enough to withstand normal use. If you decide to buy this product, be sure to purchase an extended or supplemental warranty from the place of purchase because the warranty provided by Acer is virtually worthless. I've never given a product such a low rating before but their warranty is just terrible.", "Date": "April 25, 2014"}, {"Title": "Great Laptop", "Author": "Amazon Customer", "ReviewID": "RLW9MES0P0LBF", "Overall": "5.0", "Content": "Great Laptop.  Light, powerful, windows 7, 4gb ram (upgradable to 8gb), 500gb disk, etc.  I purchased this to replace a Samsung netbook which was 4 years old, windows 7, only 2gb ram, and 250gb of disk, 10\" screen, 6-9 hour battery life, 3lbs, windows 7 starter.  It was great, served me well,  but over the years it became too slow, and ram could not be increased.  So I upgraded to the Acer Aspire V5-131-2629. which had double the disk, 4 times the ram, a more powerful processor, etc.  The system is the perfect size for me, 11.6\" screen size is perfect for any work that needs to be done, windows 7 professional is powerful and will be supported for the foreseeable future, battery life seems to be around 5 to 6 hours, etc.  The only cons that I have are that the keyboard is a little noisy and  requires firm presses to register, and the speakers could be stronger, however, I paid $279 for a factory reconditioned system, it looks new and has the new warranty.  My requirements were for a small, powerful, full blown laptop that had a screen no larger than 11.6\", intel or Celeron processor (not atom), 5 hours or more of battery life, 500gb minimum of disk, windows 7 (not 8), weight 3lbs or less, ram minimum of 4gb (upgradable), reasonable price.  This is the only system that I could find with good review that met my requirements.  I have had it for a month and after unloading the bloatware, fine tuning windows 7 (eliminating much of the unnecessary start up software, etc.) the system is perfect.  My only complaints is that the quality of the keyboard could be better, and the speaker could be stronger, other than that, everything else is perfect, especially for the price.", "Date": "April 24, 2014"}, {"Title": "Acer Aspire V5---131---2629  11.6 \" computer", "Author": "M. Gregg \"mysfre\"", "ReviewID": "R1BIZU12YFD5UL", "Overall": "5.0", "Content": "Love this little computer.  Fits well in a large purse and works great.  Did not want  Windows 8 and this came with Windows 7.I wanted this for travel and it is a wonderful computer for travel.  Wi-Fi picks up well any where.Would recommend to anyone who wants a smaller screen---this is 11.6, a nice size.  Only draw back is you have to buy DVD player separate and plug in if you want to back up files or play DVD's.  This is my second Acer computer---love them.", "Date": "April 14, 2014"}, {"Title": "Issue with Microsoft Office 2010", "Author": "beach bum bob", "ReviewID": "R1MYN1HYAK5N1O", "Overall": "3.0", "Content": "I bought this laptop because it appeared to have all the options I need in a small, business laptop.  The laptop itself is fine.  The problem is that the laptop stated that it came with full Microsoft Office 2010.  So, when trying to activate the Microsoft Office 2010 with the product key supplied, it says it is an invalid product key.  I have no use of Office 2010.  I have downloaded work software on it already.  Amazon is willing to take it back for a refund.  No problem with Amazon.  Problem is the product key is invalid.  I think it is misrepresentation.  I don't buy computers with \"trial\" software.  All that being said, you get what you pay for.  Be aware.  Lots of options on laptop.  No cd/dvd on it.", "Date": "April 13, 2014"}, {"Title": "MY 2nd ACER", "Author": "Helene Dudley", "ReviewID": "R72U2FLLGMCI6", "Overall": "5.0", "Content": "I bought this compact laptop to use when traveling. I am part of a volunteer team that does pro bono consulting for micro-credit programs and we have spreadsheets, photos, presentations, etc. that need to be available where ever we travel. My previous ACER finally gave out after many years of good service. I hope this one lasts as long.", "Date": "April 12, 2014"}, {"Title": "Great Laptop", "Author": "Katarina", "ReviewID": "RKV4X32I6Q57K", "Overall": "5.0", "Content": "I've had no problems with this acer, it works at a great speed for its specs and does everything i need it to do and more. If you are those who strain to see small print then i suggest u stay away from this one and get a 13 inch or bigger. Battery life is around 4 hours for me with the brightness all the way down. it's so light, i love it. I bought it so i can take notes in lecture and it's been great.", "Date": "April 10, 2014"}, {"Title": "LOVE LOVE LOVE", "Author": "->stevezilla \"stevezilla\"", "ReviewID": "R2NY327UQ3CBT5", "Overall": "5.0", "Content": "That's what my wife said. I bought her this computer after her old one died - and after 24 hours she said that she loves loves loves it. I think I saw her kiss it. It's light. It's got some big ass memory. Fast processor, sleek shiny black plastic. It exudes CLASS. It smells better than a NEW CAR. It delivers the internet and BRINGS HAPPINESS.", "Date": "April 8, 2014"}, {"Title": "mouse pad is crap", "Author": "jbeazl", "ReviewID": "RFN70MJ7BDD41", "Overall": "2.0", "Content": "The track pad never works, I'm not a computer genius but not exactly fumbling in the dark.  I have tried many different fixes to this problem and nothing works for more than a few days.  I have given up and am using a usb mouse, so much for portability of such a small laptop.", "Date": "March 10, 2014"}, {"Title": "I WOULD HAVE GIVEN IT FIVE STARS BUT NOBODY WALKS ON WATER!", "Author": "JB", "ReviewID": "R2AZDW0OER9TX4", "Overall": "4.0", "Content": "This little computer does everything I want to do.  My present (Former) computer is suffering from late stage electronic Alzheimer's disease.  This fills the bill, plus it's a lot more portable.  The only thing missing is an optical drive, but I have an accessory drive that plugs into USB.  All's well.JB", "Date": "February 12, 2014"}, {"Title": "Good.", "Author": "Jerry W. Allen", "ReviewID": "R11EO8FBCUURR6", "Overall": "4.0", "Content": "It meets my needs. The only thing that is not very good is the sound system.  Everything else seems okay.", "Date": "February 9, 2014"}, {"Title": "Great for my train commute", "Author": "Christopher Drew", "ReviewID": "R31NTZ8COB1NDE", "Overall": "5.0", "Content": "I got this laptop primarily to work on editing music during my rather long daily commute. For this purpose, it's great. It has the power to run relatively modern (circa 2011) digital audio workstation software, synths, sequencers and the like. Windows 7 was an absolute requirement for me, so this fit the bill and I'm very satisfied with it.I also play simple games on it, but nothing too demanding (i.e., nothing 3D) and it's fine for that as well. The track pad--as others have mentioned--is not the best, so I have to choose games suited to its limitations. I especially find the right click to be finicky, but not awful. It's right on the cusp of \"annoying enough to notice,\" but all things considered I don't consider it much of a downside.One unexpected benefit I found out early on is that the screen is very simple to replace. My daughter stepped on and cracked the screen within the first week of it arriving. :/ But $60 later, and just 10 minutes of install time, it was good as new.", "Date": "December 31, 2013"}, {"Title": "Definitely a \"Best Buy\" for me", "Author": "Rabid_Reader", "ReviewID": "RBUQTO8LO1ZIJ", "Overall": "5.0", "Content": "I am using this small, inexpensive laptop to run everything from Microsoft Office to the music composition application, Finale, and this computer has far exceeded my expectations.  I did add 4G of memory which made a noticeable difference in performance.  The battery performance is outstanding.  And while the touchpad works fine, I prefer to use a Bluetooth mouse when at my desk.  It's just more efficient.  I've owned dozens of computers over the last 30 years and this one is definitely a \"Best Buy\" for me.", "Date": "December 2, 2013"}, {"Title": "Easy and Fast", "Author": "keith barnes", "ReviewID": "R30EO5LFEPDG3O", "Overall": "5.0", "Content": "I like everything about this model. It is fast, easy to use, and thin. I blog quite often and do quite a bit of other things that require I carry it along when leaving home. The weight makes it easy to tote.", "Date": "August 22, 2013"}, {"Title": "Good product ruined by poor touchpad", "Author": "Smantie", "ReviewID": "R29F29EBFQDVIW", "Overall": "2.0", "Content": "This is a relatively strong netbook for the cost, it runs programs well, has nice battery life, and is lightweight and portable. However, there are MAJOR issues with the touchpad which render the device nearly useless.", "Date": "November 15, 2013"}, {"Title": "Great machine, excellent value", "Author": "Closer", "ReviewID": "R3L0VEA15H0LNE", "Overall": "4.0", "Content": "I bought this to upgrade from a Samsung netbook that I liked very much, but it was running Windows XP and had pretty limited memory.The Aspire V5 131 is almost the perfect package in my view: the right size, the right power, the right price.Pros: Size: I like to carry around a computer no larger than this, in terms of weight, thickness, or profile.  I think this is about as good as it gets at anything close to this price point. The machine is lightweight but not flimsy, and I feel comfortable often picking it up and setting it down using the screen as a handle.Power/speed: The V5 boots up from being \"off\" very quickly, and from being on standby it's nearly instantaneous. The half-terabyte hard drive has plenty of room for practically any data you could want to carry (in my case, a library of Amazon Unbox videos to watch while traveling). The power pack is nicely a bit smaller than most.Price: The machine is a bargain for combining good power, low weight, and trim size into a package this price. I did a lot of shopping, and I don't think you can do better.Cons: NOTE that this machine ships with a six-cell battery that significantly alters the size profile, sticking out across the bottom by a good half inch. It is NOT the profile pictured on Amazon, which is the 4-cell battery. Since the machine's slim profile is critical to me, that was a problem. In my case, that problem was solved very nicely when Amazon gave me a $60 credit for the \"problem\", and I was able to buy a 4-cell battery directly from Acer for $30. I now have the battery I want and a higher capacity back-up for less than the initial purchase price.Worst feature: the viewing angle is the worst I've seen on any device. I normally dismiss viewing angle concerns as not too important, since if you're the only person looking at the screen you can just adjust it a smidge here or there to get it the way you want. The viewing angle is so narrow on the Aspire V5, however, that simply shifting up or down in your seat can change the quality of the view, so you have to adjust the screen again to match.  It's definitely something you can live with, but it's a bit limiting to have to tilt the screen several times in the space of an hour.I'd definitely buy it again, viewing angle notwithstanding.", "Date": "October 14, 2013"}, {"Title": "It was good for its cost", "Author": "Rene-Pierre Azria", "ReviewID": "R249D4GVJOJSEK", "Overall": "4.0", "Content": "The computer was largely sufficient for it's cost. Though please note that sometimes it crashes, and the sound quality isnt superb. Howevr, for this cost, it's hard to find a better machine.", "Date": "August 12, 2013"}, {"Title": "Might be okay for your needs, but wasn't for mine.", "Author": "Jenifer \"cthylla\"", "ReviewID": "R2LFZXC2YPOGSP", "Overall": "1.0", "Content": "I understand that this is a lightweight laptop designed for lightweight needs- that is fine.  I was happy to use it for the internet, taking notes, writing, etc.My problem arrived when I attempted to install a label-making software, and the software told me I would need to update my video driver.  There is no Acer \"updater\", but I ran DxDiag and obtained the manufacturer of the card- Intel, and went directly to them to update the driver.  Intel's site ascertained my driver (from 2012) and suggested the update. Acer blocked the update- saying I needed to go through their website.Okay, fine.  I go to Acer's support site and search for the most up to date drivers.  According to them, the most up-to-date driver was the one from 2012.  *RIIIIIGGGHHHHHT.*  I contact customer support.  He helpfully sends me right back to the webpage of the 2012 driver that I was just on.  I argued with him; he said that was it.  That was all Acer had for me.  NO UPDATE FOR YOU.I am SO GLAD this happened within the return window.  To not allow your product to be updated is ridiculous.Like I say above- this laptop may meet your needs right out of the box.  Just wasn't going to cut it for me.", "Date": "May 28, 2014"}, {"Title": "Terrible laptop and even worse customer service", "Author": "Marufa", "ReviewID": "R32SD6OB1MAMQP", "Overall": "1.0", "Content": "I bought this laptop for my sister for $600+tax (on sale) for back to school back in August 2013. I read mixed reviews but thought that I should give them a chance. I was wrong. After a month use, the WIFI on her laptop kept dropping and after a few weeks her laptop would no longer charge and that was a huge inconvenience for her as a student.I went back to forums and many people cited those as  issues. I called their customer service and they said that I would need to send it in for repair at a cost of $100 for shipping and handling, although I had a one year warranty.I reminded them that it is their faulty equipment and that they should be covering for the shipping, but they refused. So spent that extra money to send out.Few months, still the same issue, WIFI does not pick up at all and it stopped charging and they refused to replace with a new laptop. So spent over $700+ on this laptop with no gains and hours of struggling with very slow or no internet or charging the entire night and still battery not being charged.Save your money! Even if it is cheap you definitely get what you paid for with this laptop. Never buying another ACER product again.", "Date": "May 24, 2014"}, {"Title": "Do not buy from B&D; company", "Author": "DW New York", "ReviewID": "R301XSMLJ9F8DO", "Overall": "1.0", "Content": "Do not buy from B&D; company. This item arrived in a box with numbers and letter written all over it as if it had been used in 10 other deliveries. There were 2 small pieces of brown paper inside to \"protect\" the laptop. The \"security seal\" on the computer box itself looked sketchy, not new. I immediately took pictures of the box inside and out and sent it to the seller and to Amazon with my concerns. I read if you break the seal you have more to deal with for a return so we chose not to open it, and not take the chance that it was a used, or a damaged computer, and decided to return it.The company has been aware from day 1 of our concerns, yet when we told them we decided to return the unopened computer because of concerns regarding how poorly it was packed and the representation, they told us there would be at minimum 15% restocking fee and based on their findings (and who controls that) a possible higher fee! This is ridiculous. Not only should there be no restocking fee but they should pay the return shipping.If you click on their name near the item, for their Detailed Seller Information, under Returns and Refunds it says nothing about restocking fees. They do not adequately disclose their return policies etc.Strongly recommend not ordering from them and I hope Amazon reviews allowing them to sell via their site.", "Date": "May 20, 2014"}, {"Title": "Crapped out within the first day", "Author": "M. Werner", "ReviewID": "R1OBEWFF5367CF", "Overall": "1.0", "Content": "Well, perhaps I got a lemon?  But this thing crapped out immediately.  Froze up, blue screen of death and made a bad clicking sound.  Wow that was a mess.  Returned it for a full refund.  I won't order an Acer again!", "Date": "May 6, 2014"}, {"Title": "Size Matters", "Author": "R. A. Fox \"rafox4\"", "ReviewID": "RH12L9GF2JHKZ", "Overall": "4.0", "Content": "Would have given it 5 stars if it came with Microsoft Office, however since I am moving up from a 10\" screen to an 11.6\" both the screen and the keyboard are noticeably larger and easier to use. With my old net book I had quite a problem going back and forth from it's smaller keyboard to a full size at work, this keyboard is much closer to normal size so I find it easier to switch between the two.The screen size is great and the mouse pad is much wider, I used to run out of room on my old net book. Next computer project, convert the old MSI Wind to a Hackintosh.", "Date": "May 4, 2014"}, {"Title": "Good portable computer....very bad speakers", "Author": "Bruce D. Kennedy", "ReviewID": "R2LXC269TXPNHG", "Overall": "3.0", "Content": "It is a good computer to travel with, which is why I bought it.My only disappointment and criticism is the speakers...why Acer did not spend a couple more dollarsfor higher quality speakers baffles me.  The speakers are horrible to the point I can't even understandverbal conversations let alone videos or movies and forget about music.  So a very functional computeris totally compromised by poor quality speakers.", "Date": "April 29, 2014"}, {"Title": "great purchase!", "Author": "Jodessa", "ReviewID": "R1CILTHMSF5IVQ", "Overall": "5.0", "Content": "didn't want to leave windows 7 so this little guy was a perfect fit! battery life, compact size and light weight, no problems what so ever with it! would recommend to anyone.", "Date": "April 28, 2014"}, {"Title": "Computer needs help", "Author": "Laura M Mack", "ReviewID": "RPPPJT91KA2GV", "Overall": "1.0", "Content": "I returned this computer because it would shut off randomly for no reason and then it would not reboot for an extended period of time.  One time I had to wait two hours before I could restart it.", "Date": "April 28, 2014"}, {"Title": "To much preloaded advertisements", "Author": "kizblk", "ReviewID": "R3MFF3328TORSV", "Overall": "3.0", "Content": "Had to pay to have all the pop up preloaded ads removed.  Have not uses it since I got it back", "Date": "April 27, 2014"}, {"Title": "GREAT INEXPENSIVE LAPTOP", "Author": "shopinful", "ReviewID": "RHRUUFR9I7FOQ", "Overall": "5.0", "Content": "This laptop doesn't have a lot of bells and whistles.  It is a basic laptop but works well.  The battery life seems average and size and weight similar to laptops that are much more costly.  I would buy again.", "Date": "April 25, 2014"}, {"Title": "Exactly what we were looking for.", "Author": "vic seeber", "ReviewID": "R3NCSBLD6PRSFK", "Overall": "5.0", "Content": "What a sweet laptop. Lightweight, quick to boot up, quick to run, long battery life, cool running, slim, everything needed for general computing, and with Windows 7 to boot. We bought this for a friend to use on the ranch for herd management, but I like it so much I'm considering getting one for myself before their all gone!  The only thing I added was an external DVD drive, an ASUS unit that works off the USB connection. I was surprised that even though the drive came with a double USB connection for additional current to run it, only one needed to be connected. Sweet!", "Date": "April 25, 2014"}, {"Title": "Will continue to buy this product as long as possible", "Author": "Sonny Reeves \"Sailorman\"", "ReviewID": "R1CKJC3BBA3578", "Overall": "4.0", "Content": "Great little lap top for the airplane rides and easy to carry. Battery lasts about 6-7 hours. I have had 3 of these in past. They seem to last about a year of hard use.", "Date": "April 23, 2014"}, {"Title": "Perfect little laptop.", "Author": "Brenda Paupst", "ReviewID": "R20EODOCHJ2YFN", "Overall": "5.0", "Content": "This Acer is just what I wanted; a lightweight, small laptop with Windows 7...not Windows 8 but Windows 7!  I got a USB mouse which makes it even easier to use.  As I use it usually plugged in, I have no rating on battery life.  The few times I have used it on battery, it has lasted several hours; 6 hours is what the manual says is its life but I didn't use it for that length of time.", "Date": "April 21, 2014"}, {"Title": "Good choice", "Author": "NANA", "ReviewID": "R2LPTJK5X5D9MD", "Overall": "4.0", "Content": "I really have enjoyed this computer. I just got it for some personal use. Other than having to load Microsoft Office it has exceeded my expectations.  Now I'm probably going to buy another for my 15 yr old son.", "Date": "April 20, 2014"}, {"Title": "Nice product large battery", "Author": "Wendel McKinney", "ReviewID": "R2HBRV7RLBAG8P", "Overall": "4.0", "Content": "I really like the size of the screen and Keyboard. The OS is nice because its Windows 7.The battery could be smaller or flatter.", "Date": "April 19, 2014"}, {"Title": "GREAT DEAL FOR THE MONEY", "Author": "EDWARD J. GILSON Jr.", "ReviewID": "R24J035WG4NFR6", "Overall": "5.0", "Content": "I wanted a  WINDOWS 7 laptop and this was the best price I saw.  It arrived and I was able to set it up with no problems.  It has a built in installation wizard which was very easy to follow.  I appreciated that because I am not very savvy.  I was also able to move my I tunes library quite easily.  I liked the size and weight as well, very compact.", "Date": "April 19, 2014"}, {"Title": "A cost effective mobile solution.", "Author": "Justin K. Wang", "ReviewID": "R20QEGM24LOJNB", "Overall": "5.0", "Content": "We need a computer to replace the HP desktop, which has been in service for more than 10 years.  After upgrading the OS to Window 7, the HP just becomes too slow to do anything.  We decide to buy a notebook instead of another desktop (even a compact desktop).  The Acer Aspire V5 has good rating.  It is a well built notebook, which is very compact and light weight.  It has all the basic connection, bluetooth, WiFi, and regular RS232.  Better yet, I hooked it up  w/ the 32\" LED monitor via HDMI, it does not feel small at all.", "Date": "April 18, 2014"}, {"Title": "Touchpad difficult", "Author": "HMB \"nj-hank\"", "ReviewID": "R37PI76VLOVIV4", "Overall": "4.0", "Content": "I would give it 3 stars, but maybe in time I might be more proficient with the touchpad.  Right now, I have given up and am using a usb mouse.", "Date": "April 13, 2014"}, {"Title": "met my needs", "Author": "christine", "ReviewID": "RH9Y66TTI6XB1", "Overall": "5.0", "Content": "wanted a lightweight laptop for occasional use when on the go,this met my needs perfectly and I don't have to worry about virus protectionstill getting the hang of the various apps but already more than happy with what is available -can read my books, listen to music, as well as the usual emails, youtube etc.", "Date": "April 6, 2014"}, {"Title": "good performance for the money", "Author": "RRW", "ReviewID": "R1YQ5HF9ZP575J", "Overall": "4.0", "Content": "light weight and functional...this is my only computer...I travel with it and hook it to a large screen at my home office.I added 4 GB for a total of 8 GB RAM.Pros:  light weight, fairly rigged, nice design,good keyboard, great screen,Cons: battery sticks out under computer doubling the thickness at the back end so it doesn't fit into slim sleeve in my backpack; touch pad is too sensitive (even after adjusting) so make unwanted clicks; touch ad has no buttons so sometimes hard to click; headset has only a single round jack....most headphones have a mic and a earphone plug...the adapter i bought did not seem to solve the problem as the earphones worked but not the mic.", "Date": "April 3, 2014"}, {"Title": "I really needed a laptop for College and had little money for one... so I bought this one.", "Author": "LRae", "ReviewID": "R17RGBO55RNGH3", "Overall": "2.0", "Content": "It lasted less than a semester. It had some minor issues with the space bar from the beginning but nothing too serious. The problem now, only 3 months after I bought it, is that there's an issue with the battery or the charger... whatever it is, it's not charging. I tries to charge for a few seconds and then it stops and all the lights start blinking...", "Date": "April 1, 2014"}, {"Title": "Warranty is an illusion", "Author": "John A. Gehrig", "ReviewID": "R1S3W437U9Q375", "Overall": "3.0", "Content": "The \"I\" key requires fantastic compressed pressure to work.  I called ACER and tried to get a warranty \"fix\".  My assigned case person was not too skilled at English and it took me fully fifteen minutes to learn that the gyrations I would have top go through to submit the machine for cure for this very basic problem would be risky, expensive and time consuming.  I have enough Zen to accept the machine as it is, without making more waves in the world.  Other than this, the laptop is what it is..", "Date": "April 1, 2014"}, {"Title": "Good value", "Author": "WEPLLC", "ReviewID": "R24EEUGTQO9LQ0", "Overall": "4.0", "Content": "It's by no means perfect (a little on the small side, a little bloatware), but for the price it's a really good computer, and much better than the HP brick I've been lugging around for the past 2 years.", "Date": "March 31, 2014"}, {"Title": "Just Love It", "Author": "JMG Leduc", "ReviewID": "R2EO2L8D1AWT0T", "Overall": "5.0", "Content": "Love it.I'm a fitness center monitor on the 6:00 am to 9:00 am shift. I leave my house at 5:15 am. I find it's great to have a small computer that does everything and be so compact I purchased the 11.6 Amazon Basics computer bag at the same time and love that as well. I also purchased an external dice drive, so I could down load programs to us at work. It would have been great if it had come with Microsoft word BUT I ended up buying that separate too.ThanksJMGL", "Date": "March 31, 2014"}, {"Title": "It had McAFee, which I dislike already downloaded on comp.", "Author": "rosalie bingham", "ReviewID": "RAJFMMAZOUNS1", "Overall": "3.0", "Content": "I wish this  and the other pre loaded programs were not on the computer and should have been disclosed before I purchased the computer.", "Date": "March 28, 2014"}, {"Title": "This Little Thing is Perfect!", "Author": "Two Texans", "ReviewID": "R2JTY3QS13QF1U", "Overall": "5.0", "Content": "I bought this to replace my HP Mini.  This one is a little larger than the mini but pretty similar.  I installed Office 365 Small Business suite which I use almost daily, I've had no problems with the keyboard.  The touchpad has a slight texture to it.  Instead of a right or left click button you \"right-click\" by pressing the lower right corner of the touchpad.  You push the lower left corner (or double tap the pad) to \"left-click\".  I've dropped the computer three times already, from the arm of my couch onto the floor, so far nothing has glitched.  I have an external CD/DVD drive that I purchased for use with my old computer it works great with this one, be aware this computer doesn't have one built in.  This laptop is just so cute.", "Date": "March 27, 2014"}, {"Title": "Not Recommended", "Author": "Rivers", "ReviewID": "R2ZJJHYJDSQG4N", "Overall": "1.0", "Content": "Mouse freezes almost daily. Internet surfing is slow going. I constantly get the following message: \"This webpage is not available\" even when it really is available. Some programs I've tried to install have been  only partially installed. Worst computer I've ever owned.", "Date": "March 26, 2014"}, {"Title": "this is rediculous", "Author": "Penny", "ReviewID": "R31QR9JAU0K09T", "Overall": "2.0", "Content": "first when i tried to update it locked up i was going to return it but i got it unfroze and managed to update it but when i canceled the return i lost my ability to return it completely. the mccafy is usless and cant and wont down load but it keeps popping up in way you have to make sure you delete every part of it same with norton  then the touch pad dont work properly and i cannot get it to change settings. you be doing something and it will scroolll up on its own or it will not stop scrolling when you click it to stop. cant do much with page jumping around.their are so many glitches in this one and it ashame cause acer is usually a good computer. people need remember if you think you should return it do it dont change your mind or think you can fix on your own cause if ya cant you are stuck ewith it that is annother thing i always had acer support with computer i bought that this one dont have WHY! i dont know i will try accessing the acer website on my own.", "Date": "March 26, 2014"}, {"Title": "Light and quick...good battery life", "Author": "tfly \"terryflynn\"", "ReviewID": "R15QZDGZOMWH62", "Overall": "3.0", "Content": "Definitely wish I had played with the touchpad a bit more before I purchased though. The lack of physical right and left click buttons takes getting used to. It's ok for browsing and basic word processing stuff but I think it would be very annoying to use Excel or PPT. If you plan to use an external mouse, disregard that complaint because otherwise it's a nice pc for the price.", "Date": "March 24, 2014"}, {"Title": "Great computer", "Author": "D. Caron", "ReviewID": "R1CW5Y4SNB8C8Y", "Overall": "5.0", "Content": "I replaced my Acer Aspire One mini lap top with this one and am very pleased.  It was easy to set up. Since my desktop is also windows 7  I  can share documents and print from the laptop to my printer which is hooked up to the desktop.  The keyboard is very easy to use.  It seems to have enough speed for me since I mostly use it to surf the web and get emails.  The size is perfect to sit with it on my lap on the couch.  Any bigger would of been too big.  It more than met my expectations", "Date": "March 24, 2014"}, {"Title": "nice little netbook for travel", "Author": "rosepetal", "ReviewID": "R1MKTEWINB9M1E", "Overall": "4.0", "Content": "This is an attractive and lightweight netbook, loaded with Windows 7.  I bought it to replace an HP netbook with Windows XP, now that Microsoft no longer going to support XP.  It is great for travel, in part because the power cord too is blessedly light (unlike the refrigerator-sized power cord on my old HP netbook).  The keyboard has a pretty good feel, though it might not be so great for someone with fat fingers.  The touchpad is easy to use.  It came set at an overly responsive speed, but I'm sure it can be adjusted; I got lazy and plugged in a mini-mouse instead, and that works fine.  The computer as a whole is not super speedy, but it is a lot faster than my older netbook.  My only real gripe is that it is set up with a lot of stuff that pushes you to get McAfee security.  I gather that McAfee is very good, but I wanted to use a different security system that I can get for free through work.  I couldn't get rid of all the McAfee stuff on my own, and had to get someone from the office IT stall to help.  If you want McAfee, no problem.", "Date": "March 23, 2014"}, {"Title": "Acer Aspire V5-131-2629 11.6\" Laptop Windows 7 H/P", "Author": "felrodrios", "ReviewID": "R3KL3P9A8QNV41", "Overall": "5.0", "Content": "Awesome!! The best buy I've made so far this year. \"11.6\" inch monster,\" it comes with a 4GB Ram upgradeable to 8GB and a 500GB hard drive. A true work of art, to have all of these features and to top it off, it's a Windows 7. Proven to, \"take a licking and keep on ticking,\" So far the best Windows O/S, to come out. Believe me I have several Windows 8, bottom line they just don't make the grade. Even with their, latest upgrade 8.1. Which cost a pretty penny to install, Microsoft has forgotten, that we were the ones who made what it is today. So if you're still looking for a computer, for yourself or a family member? Amazon.com still has them, at a great price.", "Date": "March 22, 2014"}, {"Title": "Good for the price!", "Author": "car4cap", "ReviewID": "R2G3GF2S3PARQY", "Overall": "4.0", "Content": "This Acer model is certainly OK for the price paid.  Specifically ordered it with Windows 7, since have not been totally comfortable with the Windows 8 programs.  Keyboard is easy to navigate; size is much smaller, but, still has a keyboard that does not feel too 'cramped'.", "Date": "March 21, 2014"}, {"Title": "Perfect size for the traveller", "Author": "Mark Ross", "ReviewID": "R2986LGX9JK1EM", "Overall": "4.0", "Content": ".Have had a 10\" HP Netbook for years that I was pleased with, but  the extra 1\"+ on this  11.6\" screen make a big difference. Didn't want to make the transition to Windows 8, so I'm very happy with Windows 7 on this Acer. This netbook is also much faster than the single core processor on my old HP 1103.", "Date": "March 21, 2014"}, {"Title": "Fairly solid machine.", "Author": "rico", "ReviewID": "R1B7P7QEJ46QX1", "Overall": "4.0", "Content": "I was looking for something portable but not too heavy. This piece is perfect for that. Screen provides me enough room to do whatever I need to, unlike some tablets I was leaning towards prior to this purchase. Fairly nice keyboard and mouse pad. Responsive to the touch, but not too sensitive. Speakers can be a bit low, but I always have a Bluetooth connected to my laptop and phone so I never really use the audio. Built in webcam and mic are solid as well. Although , I use the Bluetooth for audio input most of the time. Battery life is pretty good. 4-5 hours average. Sometimes more. My comp is on and off a lot.One thing that has been a bit annoying for me. Sometimes I think the unit starts overheating, because I will start to hear a noise, like a sharp whistle from the unit. If I shut the comp off right away I can restart a few minutes later with no problem. If I miss the opportune time, I have to take out the battery due to freeze up. Sometimes this can happen 30 minutes into use or 3 hours. I does not happen often though.Fair price. Solid machine, good space. USB drives. Built in Wi-Fi.  I like it!", "Date": "March 21, 2014"}, {"Title": "Works Great.", "Author": "D. K. Jarvis \"D. K. J\"", "ReviewID": "R13JGU0YJQZFC2", "Overall": "4.0", "Content": "Had it for a while. No real issues. I wish it would go louder but that's nothing some computer speakers can't fix. Great screen, works pretty fast. It's only slow when there is an issue with a website, not the computer.", "Date": "March 19, 2014"}, {"Title": "How we like our Acer Aspire V5-131-2629  11.6\"  Lap", "Author": "Annette Thornton", "ReviewID": "ROTO3VIPLIZG6", "Overall": "3.0", "Content": "because it locks up too often, other then that it is what we wanted.  The size is great for couch sitting.", "Date": "March 15, 2014"}, {"Title": "I'm Still In Love With Acer!", "Author": "Catalina C Novotny", "ReviewID": "R1MZY8EHPCXZLZ", "Overall": "5.0", "Content": "It started when I purchased an Acer Aspire One approximately 5 yrs ago.  I love that little blue friend.  It took me anywhere in the world (thanks to the internet) and I took it everywhere, but things change and we need to move on.  I wanted a new portable laptop, so I started my search.  Whether it's a $5 item or a $500 item i need to know as much as I can about the product before I'm sure it's what I'm looking for.  As usual I started with Amazon and went from here to all other websites, and after gathering all the information I could find, I ended up back at Amazon, which happens 99% of the time.After going back, one more time, through my list of ultrabooks, laptops, chromebooks and notebooks, I ordered my Acer Aspire V5-131-2629. because after all the mumbo jumbo (I'm not a geek, wish I were) it had almost all that I was looking for.  My one concern was the screen size. I thought maybe I would be happier with a 13\" screen.I received my Acer on time (thanks again Amazon) and when I opened the box the size was perfect.  Needless to say I am very, very happy and I'm glad that Acer is still making a great product.Thanks", "Date": "March 12, 2014"}, {"Title": "For the price and need, nice little laptop", "Author": "abcdefg", "ReviewID": "R25QUUGB15TPH7", "Overall": "4.0", "Content": "Needed a small laptop for mainly browser uses. This delivers on that. Not the speediest, but I don't care. Almost as easy to carry around as iPad. Wish Acer and others would quit preinstalling tons of junk-ware programs though. I wasted almost an hour going through programs installed list, removing useless games and programs.", "Date": "March 11, 2014"}, {"Title": "Good but lots of bloatware", "Author": "RoadDawg", "ReviewID": "R26ERRQKP6MJJU", "Overall": "4.0", "Content": "Love the laptop and the Windows 7, hate the bloatware. The McAfee nag screens are especially annoying as they keep popping up continuously .. I'll remove it someday haha Other than the bloatware everything is ok and the battery life is very good. Keyboard does suck a little but nothing major. No regrets here.", "Date": "March 11, 2014"}, {"Title": "Sweet Machine", "Author": "SuzieQ", "ReviewID": "R3K1OPW447E8EF", "Overall": "5.0", "Content": "I bought this Acer to replace my previous Acer netbook that bit the dust. I have had this a while before putting in my 2 cents worth as to functionality. Right out of the box I was able, in a very short time, to get it up & running, plus deleting the un-necessaries. I am pleased with the speed, downloading software (I purchased an external CD/DVD driver) with no issues & am pleased with the battery life. I find I like that this battery allows the netbook to sit at an angle. If you want specs please read them elsewhere as I am not a techie. I am a gal who likes to have a fun little companion when leaving the house. It is light and the carrying case I purchased has a pocket for the adapter and earphones. I took my previous netbook to Europe twice and this one is going with me next month. Battery life is important on long flights! I like the touch pad which is light to the touch but for some things I do use a wireless mouse. I have used Skype several times with no problems. What I don't like is that the adapter plugs in on the right ... I prefer the left side then the cord is not draped across my lap. I also don't like that the card slot is in the front ... I find it awkward. My previous Acer had the slot on the left side.To sum up I find this Acer Aspire V-5-131-2629 to be a great sidekick. Great price, right size, great speed, fast booting up and not heavy when balanced on my lap. Oh and I should mention that it doesn't run hot ... my previous Acer Aspire netbook ran hot and that's what ultimately aided in it's demise. I feel pretty darn lucky to get a pc that runs as well as it does and that I had no issues right out of the box. Amen!", "Date": "March 9, 2014"}, {"Title": "Bad experience, crushed - Corrupted Operating system Files", "Author": "Ghalib Said", "ReviewID": "R3LWCMUKOC3YMN", "Overall": "1.0", "Content": "Overall speed and performance was not fast, but fairly good for the price; however, after working ok for about 3 weeks turning the system on the message reads “No bootable device… insert boot disk an press any key” appeared on the monitor.", "Date": "March 9, 2014"}, {"Title": "Adequate", "Author": "B. Murphy", "ReviewID": "R1J3MUHL0387NC", "Overall": "3.0", "Content": "1) For what I wanted it for it worked...for 2 days, and then2) It Crashed and wouldn't boot.3) Celeron Chip was a little laggy4) I'm sure it would have been fine, but this particular machine was faulty.", "Date": "January 7, 2014"}, {"Title": "Good cost x benefit", "Author": "Ricardo R.", "ReviewID": "RLP66G46HN95S", "Overall": "4.0", "Content": "The laptop is good but slowly I expected more about performance instead of be a little heavy otherwise the battery has a good capacity.", "Date": "January 6, 2014"}, {"Title": "Very Pleased !!!", "Author": "Ronald L. Hyman", "ReviewID": "RR4493H3MWPR5", "Overall": "5.0", "Content": "First let me say dealing with Amazon was---as always a pleasure.My new laptop arrived in the time frame promised and in excellent condition.It was an easy process formatting the V5, as well as setting up my wireless and remote printer.Just follow the online instructions.The screen is bright, the processor is fast, the battery averages 6 to 8 hours depending on usage.Best of all this laptop comes with Windows 7. ( tried windows 8 and hated it !!! )So if your looking for a great little windows 7 ( 11.6\" ) laptop to serf the web, send & receive email and do other daily tasks the Acer V5-131- 2629 could be the one for you.PS--This price on this 4GB--500GB hard drive is also very attractive.", "Date": "January 1, 2014"}, {"Title": "Great little computer, and it has Windows 7 instead of Windows 8", "Author": "Timothy Seaman", "ReviewID": "R2EMUMUK7ZKLO4", "Overall": "5.0", "Content": "Bought a new Gateway computer with the new Windows 8 operating system and immediately regretted it. Windows 8 isridiculous to use, and the system was always, always trying to do updates. Also, some bad pixels on the Gateway screen. We took itback and bought this Acer with Windows 7 and have been absolutely satisfied with it. This computer will be very useful whentraveling in our motorhome. A great computer for the price.", "Date": "December 20, 2013"}, {"Title": "Acer Aspire Review", "Author": "Sandy Eggo", "ReviewID": "R2GDSTMMZW68V6", "Overall": "5.0", "Content": "Just the right size for travel without the limitations of a \"toy\" tablet. Get this instead, you won't be sorry.", "Date": "December 11, 2013"}, {"Title": "Great Value", "Author": "gypsea \"gypsea\"", "ReviewID": "R3T6J6WNQB14ZQ", "Overall": "4.0", "Content": "I bought this because it had Win7 and I did not want Win8. Has all the other features I wanted including a VGA port, HDMI, ethernet and 3 USB ports. It seems that the USB ports are NOT 3.0 as they are not blue. Screen resolution is good, firm touch keyboard. The mousepad takes some getting used to. Using Win7 easy transfer, it was painless to transfer data from my old laptop. (I did notice that my Outlook calendar did not transfer, but my internet favorites and toolbar links did). Impressive battery life, too! I would recommend this to anyone who does not want Win8 but hurry because I suspect supplies may be limited.", "Date": "December 10, 2013"}, {"Title": "Portable fast and reliable", "Author": "Ron B.", "ReviewID": "R2JECCQ3S1YPU7", "Overall": "5.0", "Content": "Portable, fast and reliable. Ideal for someone on the go or for a high school students. I was surprised how long the battery lasted.", "Date": "November 29, 2013"}, {"Title": "Excellent product for the price point.", "Author": "D. P. Williams", "ReviewID": "R3DV0VC5GDAJPJ", "Overall": "4.0", "Content": "Perfect for what I ordered it for. Surprising quality. User friendly except that single touch pad is touchy to use...get a mini-mouse to use with it. I wanted a simple, cheap back-up, and got more than I expected.  Quite sturdy, too.", "Date": "November 18, 2013"}, {"Title": "Holds all my collections and does what I need well (writing and MP3 music listening while traveling) - not hard to get used to.", "Author": "rwp728 \"rwp728\"", "ReviewID": "R3SYXKPEA6ZPNE", "Overall": "4.0", "Content": "The good: -  Ideal size for use on the bus, has Windows 7 and not 8, 500GB Hard drive, good keyboard feel, good display, speed and battery life.  Not much junkware to get rid of.  Booted up fast before all Windows updates were installed.Irritations: - No dedicated Home and End keys so have to use function key to get those; tried keyboard remapping but it didn't work.  Spacebar doesn't work if pressed with normal force on left side; have to use right side or press hard which slows down writing.  Touch pad a bit too sensitive for me even on lowest sensitivity setting.  Boot-up slowed significantly after all Windows updates were installed.", "Date": "November 1, 2013"}, {"Title": "New Acer Computer.", "Author": "Larry", "ReviewID": "R3KW1PLLJRJTPG", "Overall": "5.0", "Content": "Our computer came about 3-4 days early. Most if not all our orders from Amazon show up early. I got this lap top for my wife to replace her old one. Acer is a good product, and reliable. We unpacked it and everything was perfect. Were looking for ward to great service from it. Acer is a good computer, and the price was great..", "Date": "October 26, 2013"}, {"Title": "BEST LIGHTWEIGHT WINDOWS 7 LAPTOP!", "Author": "ROBERT CHANG JR", "ReviewID": "R1J89NXIQ5T6MX", "Overall": "5.0", "Content": "I love my little Acer Laptop,it's lightweight,and the most important thing I love is Windows 7,not Windows 8 which I hate! After I've upgraded from hard drive to soild state drive and from 4 gb to 8 gb of memory ram,my little Acer is totally lighting fast machine,the first I've ever have,for being a small portable lightweight laptop I've had and it's the very best 11'6 Acer Aspire V5 at the price of $348.99.", "Date": "October 23, 2013"}, {"Title": "Great tiny laptop", "Author": "EnidLove", "ReviewID": "R3G7EP0GBOJN4B", "Overall": "4.0", "Content": "I've been quite happy with this so far. I tried an Android tablet because I was going for tiny, but the fact that you cannot use applications with it was very disruptive, so I got this laptop. The price was great. It's so light! I haven't had any problems at all. The only thing I miss is that my old Alienware laptop had backlit keys.", "Date": "October 16, 2013"}, {"Title": "Very good for an economical computer!", "Author": "janice holt", "ReviewID": "RMQPSF83169CU", "Overall": "5.0", "Content": "It's lightweight but sturdy, and has many components which were exactly as I expected it to be. I've never seen an 11.6 computer this sturdy or good with memory and processing power. If you're looking for something light but great with videos and basic school/gaming then this is what you want. Definitely something I'll be looking for in future laptops and computers.", "Date": "September 18, 2013"}, {"Title": "Acer aspire 5733 laptopI a", "Author": "Carol S. Raulston", "ReviewID": "R2PNDL6O6CZFFN", "Overall": "2.0", "Content": "I bought the 5733 laptop and only a few months later the password stopped working.  This means I can make no changes to my computer.  I tried accessing customer support only to discover it is NON-EXISTENT.  The only sources I could access wanted to charge $199 per year for support.  Since I am 100% sure i made no changes to the password, I am highly frustrated with Acer.  I will NEVER buy another Acer for this reason.", "Date": "January 23, 2014"}, {"Title": "Had to send in for repairs", "Author": "Jessica Biloxi", "ReviewID": "R2SJQCI3BBCRMK", "Overall": "2.0", "Content": "After less than a month of use, the touchpad went out. I had to pay to ship it to the Acer repair center. All they did was return the unit to its factory settings which somehow took several weeks. They did this even though I had already taken all the steps to resolve any software issues and explicitly told them and demonstrated that it was a hardware issue. When I got it back, it worked for about a week before, shockingly, the touchpad started having the same issues. After dealing with customer service for hours, I finally got them to agree to pay for shipping it back again. Unfortunately I am in the middle of a big project right now and can't be without a laptop again for weeks. So I am stuck using a USB mouse (which sucks because I work in my vehicle a lot; touchpad would be super useful) until I can pack it up and send it away for who knows how long. It's a good laptop otherwise, but dealing with the repair problems has taken out way too much of my time and productivity.", "Date": "January 23, 2014"}, {"Title": "Disfuntional battery or charger upon arrival", "Author": "cartere", "ReviewID": "R35643YXBONEOM", "Overall": "1.0", "Content": "I was really excited to get this computer. That is until I actually got it. I opened it up, let it charge for a while then installed my preferences. However, I come to realize that either my battery is defective or they sent me a useless charger... nonetheless right now my computer is completely useless and although Acer has been helpful, it has not been an enjoyable experience. Acer support will be sending me a new charger and I will update my review if this situation is fixed. Mind you this problem was experienced on the first day that I received it. You would think they would test their product before selling it.", "Date": "April 15, 2014"}, {"Title": "Doesn't work!!!", "Author": "Sadie Sue", "ReviewID": "R1SPT6H018YMZQ", "Overall": "1.0", "Content": "Purchased this computer and, due to illness, was unable to try using it until now, 7 month later, and it doesn't work!!!  Got it to turn on, which took forever and then it would not turn back on.  We had given it a full charge before trying to use it so know it did not lack power.  The next day my husband got it to turn on and he took our McAfee and installed Norton, which I have on other 2 computers, and it worked for short time.  Today computer will not turn on and our daughter in law was over and she tried, repeatedly, to get it to work to no avail.  She told me that she had purchased the same computer and just took it back as it had same problem.  Now I am stuck with computer that doesn't work!!!!  I would suggest you look at other Brands and not buy ACER!  I originally bought this due to it still having Windows 7 and that is a system I prefer.", "Date": "April 13, 2014"}, {"Title": "Bad choice on my part.....for the thousandth time!", "Author": "Amazon Customer", "ReviewID": "R1HRUSC1MQW4KQ", "Overall": "1.0", "Content": "I bought this item used from Warehouse Deals.......huge mistake! It was locked when I got it and I was unable to log on to it. So when I finally figured out how to restore it from the start up screen, the internet would not work via wifi or cable. SMH. I was really hoping this one worked considering the deal I got on it and it has Windows 7. Some PC Manufacturers sell Windows 7 PCs, but I don't want a 15.6 in screen. Well I'll suck it up and brace myself for Windows 8. Guess I will buy a new one and hopefully it works. I do not recommend this item. On my way to the UPS dropbox.", "Date": "April 1, 2014"}, {"Title": "Unimpressed", "Author": "Jennifer", "ReviewID": "R3NRF66AR2XSBQ", "Overall": "2.0", "Content": "I returned this product. I disliked the mouse touch pad, it kept resizing the screen font without intention.  The price might be right but it just seemed cheap,", "Date": "March 11, 2014"}, {"Title": "Shiny New Windows 7 Gem", "Author": "D. Young \"Dixie Cup\"", "ReviewID": "R3B9WY8TT3U1XY", "Overall": "5.0", "Content": "I have a full size Windows 8 laptop that will now be the back-up to this little treasure.  It does everything the big one does just as well and sometimes faster. The big plus for me is not having to put up with the very counter-intuitive Windows 8 operating system. On my sweet little Acer I can actually do simple things simply like find what I'm looking for, mass delete junk mail, copy, paste,  print, etc.  I love that little windows are not flying out from all 4 sides of the screen at me if my finger is not perfectly placed on the track pad. Welcome home, Windows 7- I missed you.I watch a lot of videos on Swagbucks.com and they play seamlessly with no crashing. The McAfee free trial it came with is doing a great job filtering potentially harmful content from said videos keeping my Acer safe while I rack up Amazon gift cards!There are 4 small things I am less than thrilled with. There is no light on the keyboard to signal the caps lock is on but an Icon will pop up on screen to let you know which takes some getting used to. A tap on the track pad does not always work- just move your finger slightly and try again. There is no optical drive which would make backing up easier but that's all I would use it for anyway. The battery is good but not as good as the specs indicate which is probably typical. No worries, I will pick up a spare with one of my gift cards. I'm also snagging on of those cool aqua blue snap on covers I spotted today. Love me some Amazon, Swagbucks, and this little Acer!", "Date": "March 6, 2014"}, {"Title": "Compact and responsive", "Author": "Brent B.", "ReviewID": "RMFVQTO8H8R4R", "Overall": "5.0", "Content": "I was looking for a lightweight computer with a full key board to use for  global travel.  During my first work assignment overseas the Aspire has proven to be just what I need.  I primarily need it for word processing and checking the internet but really appreciate the dependable Windows7 system.", "Date": "June 7, 2014"}, {"Title": "Good enough", "Author": "SpacemanEd", "ReviewID": "RZFVX39O0SK46", "Overall": "4.0", "Content": "Likes:  Bang for the buck.  Windows 7 64-bit.  Chiclet keyboard; good key size.  Plenty fast enough. Light.  Clear, crisp monitor.  Can take it and use it anywhere.  Set-up is easy. Very good, if not outstanding, battery life.Dislikes:  Glossy case shows fingerprints; a cleaning cloth is included, though.  Sound is tinny - RealTek audio is included, but you'll need to play with the audio controls to make the sound tolerable on some websites.I've seen some reviews of folks unhappy that it doesn't lay flat.  That's due to the oversized extra-life battery.  The slight tilt is better ergonomically anyway.Background:  This is my 2nd one of these.  First was for my wife, to replace her full-size XP laptop.  She works from home and our small business office and when traveling.  Comfort and portability are key to her.  It's common for her to have Word, Excel, an Access database, Outlook, and our proprietary cloud employee management system open at the same time.  This laptop handles it, and my wife has become quite the Windows 7 Toggle Queen.  Rarely uses the office desktop anymore.Once my 80-year-old mother saw and played a bit with my wife's new computer, she wanted one for herself to replace her obsolete XP desktop.  Windows 8 on a full-size laptop for Mom was an absolute non-starter.  Mom uses it for her e-mail, browsing, Quicken and that's about it.  Took it with her on a cross-country trip.  Her biggest pleasure (actually, maybe mine) is instead of having to browse at a desk in a spare bedroom, she now reads her morning news and e-mails at the kitchen table or on the patio, with a cup of coffee.", "Date": "June 7, 2014"}, {"Title": "Very functional machine with a decent sized screen", "Author": "cancer", "ReviewID": "R2P03F4MION4VU", "Overall": "5.0", "Content": "Formerly I was using a Toshiba (solid and reliable for 5 years), but this is a better machine than the comparable Toshiba one. I love the larger screen size and the slightly angled display thanks to feet under the keyboard. The single mouse is actually easy to use and has the added advantage of being able to minimize or magnify also. The only negative about it is the speakers are stupidly placed underneath the keyboard, so if you are watching a program, you will probably want to use headphones. Fortunately this is readily remedied. I use this computer for writing, some EXCEL work, and for research, as well as for entertainment. It is not my only laptop, merely my newest.", "Date": "May 29, 2014"}, {"Title": "Garbage", "Author": "Kevin", "ReviewID": "R1X9BEL8GXCXY3", "Overall": "1.0", "Content": "It was slow and froze on me after initial set up. Sent it back for refund. Don't recommend this item", "Date": "May 26, 2014"}, {"Title": "Gets the job done", "Author": "dram", "ReviewID": "R1PZ3DWL52UK8H", "Overall": "5.0", "Content": "I have only owned this for about a month so I can't really comment on this laptop's longevity.I needed a thin, lightweight laptop that I could carry to night classes. I am studying computer science, so this is a perfect machine for tooling around with programming, virtual machines, etc. I didn't need to spend gobs of money on a MacBook, I wouldn't use most of the bells and whistles anyway. This laptop is well made and it actually packs a lot of features for the money. It has Bluetooth, HDMI, large storage, 4GB memory! The only noticeable thing that is lacking is the graphics display. The screen is a little bit pixelated. So it's not a good choice if you will be watching a lot of high res movies or games. Otherwise great little machine. I hope it lasts!", "Date": "May 23, 2014"}, {"Title": "Acer Aspire V5-131-2629 11.6\" Laptop expectations", "Author": "Lester R. Burroughs", "ReviewID": "R37YF1PB8E0F07", "Overall": "5.0", "Content": "I purchased this laptop for a friend whose original laptop had insufficient processor speed and RAM to download anything but short e-mails. My friend loves the new laptop. She is now able to do research on any topic sh choses and to download pictures and large text articles. This little laptop is a winner!", "Date": "May 18, 2014"}, {"Title": "Great PC", "Author": "Lorena Sikorski", "ReviewID": "R28MPQ8AGXEDSO", "Overall": "5.0", "Content": "This little PC is fast and a great buy.  I didn't realize that it didn't have aCD drive, but I can live without one.  It's lightweight,  speedy and easy to use.A great buy for the price.", "Date": "May 8, 2014"}, {"Title": "Great product from Acer", "Author": "Dean C. Dickinson", "ReviewID": "RL8V7KIKXJC42", "Overall": "5.0", "Content": "Just right to keep up with news and emails while we are traveling across the country. It has the Windows 7 operating system and I bought MS office home and student so I can access my Word and Excel files while on the road. I also equipped it with a wireless mouse to use in lieu of the touchpad (which can be toggled on and off by pressing the Fn and F7 keys). LOVE the large keyboard. A great value for the price!", "Date": "May 8, 2014"}, {"Title": "Great for Travel", "Author": "Kenneth R. Velten \"California Ken\"", "ReviewID": "R1OR379YJKUEPI", "Overall": "5.0", "Content": "We use this computer when we travel.  It is lightweight and easily fits in a carry on bag.  Has all the features of a desk top.  The screen is big enough for most applications.  I use an external disc drive to load from discs.  Keyboard is good and the display is good.  We are satisfied.", "Date": "May 8, 2014"}, {"Title": "Great bargain..", "Author": "Mary M Koss \"mcdak\"", "ReviewID": "R1GMZ8388UIOKW", "Overall": "4.0", "Content": "I could do without all the extra adware stuff on it though.  I didn't recognize a lot of it and was afraid to delete things I don't recognize. It works a lot faster now that  my son has deleted the extras.", "Date": "April 1, 2014"}, {"Title": "Its fine for what I use it for", "Author": "Neill Hamilton", "ReviewID": "R3J0O5W23OSCSL", "Overall": "4.0", "Content": "The keyboard is adequate, the battery lasts about 5 hours.  The software loaded on the computer by Acer is not too annoying, and Word Starter is fine for my purposes.  It accepts the data card from my camera. If you load Google Chrome it surfs the net just fine.The only drawbacks were that the Norton Anti-virus software didn't work, and the keypad is very sensitive.  I loaded Microsoft Security Essentials for the anti-virus, and have learned to live with the sensitivity.", "Date": "March 29, 2014"}, {"Title": "an excellant choice", "Author": "barbkubera", "ReviewID": "RECZTWWS95ZXU", "Overall": "5.0", "Content": "excellant choice- compact, full keyboard which is very easy to use, not tiny keys-fast and just what I had wanted.highly recommended.", "Date": "March 27, 2014"}, {"Title": "Was Perfect For Me", "Author": "Christopher D. Marshall \"Chris\"", "ReviewID": "R3RWFOMJEIYHY2", "Overall": "5.0", "Content": "This is a perfect, light weight, small footprint, long battery life (4+ hours) notebook for me. It's surprisingly fast for its size. I use it for watching video and surfing the web. I bought a Windows 8 notebook and hated the interface plus it seemed slow. I didn't want to ascend a steep learning curve just to watch a video or figure out how to shut down, so I returned it and was so happy to find this little gem still available with Windows 7. I haven't experienced any keyboard or touchpad issues. Very happy.", "Date": "March 26, 2014"}, {"Title": "great  compact computer", "Author": "james thompson", "ReviewID": "R3PVLUJIUYAP3C", "Overall": "5.0", "Content": "Grate small laptop perfect for travel. mouse pad is a littel different but is easy to adapt to but meets all my expectations.", "Date": "March 19, 2014"}, {"Title": "Great Performance!", "Author": "nilesfrancis", "ReviewID": "R2NU7MQ86GWC0U", "Overall": "5.0", "Content": "I'm an Apple user, but needed a PC for a specific and dedicated purpose.  This notebook was recommend to me and the reviews were favorable.  It is good value for the money.  Get a small mouse to navigate as track pad is not particularly responsive.", "Date": "March 13, 2014"}, {"Title": "Good product", "Author": "Jennifer", "ReviewID": "R1ENKB66XEQ5LY", "Overall": "4.0", "Content": "For a PC and the price this was a good computer. It is small and light. The battery is also 'legs' for the computer which is neat. It already has shortcuts on the desktop for things such as Netflix, and the Nook reader, which saved some time. Sometime it runs slow but we will see how long it lasts?", "Date": "March 11, 2014"}, {"Title": "Happy  with computer", "Author": "Betsey", "ReviewID": "RMC4GIEZZC4CL", "Overall": "4.0", "Content": "I find it easy to read---quick to respond--nice size----this computer is a big improvement over my smaller Dell notebook--would recommend it", "Date": "March 8, 2014"}, {"Title": "First PC purchased that the purformace was priced cheap!!!!", "Author": "Richard A Byrum", "ReviewID": "RQFTEMAPSS49V", "Overall": "5.0", "Content": "It  has great screen and sound, Be sure to update video drivers, they will b @ Intel. Battery life is great, I charge it two days.", "Date": "March 6, 2014"}, {"Title": "Acer Aspire V5-131-2629 11.6\" Laptop (Black)", "Author": "Sharon D. Large", "ReviewID": "R34MBLP3XFZNDG", "Overall": "5.0", "Content": "My son and husband love this laptop and use it frequently. I have a larger and older Aspire laptop that I use all the time. I recommend this brand to everyone because I love it.", "Date": "March 4, 2014"}, {"Title": "Great small laptop", "Author": "avid mystery reader", "ReviewID": "RXE9Y8SHBPRDB", "Overall": "5.0", "Content": "We wanted a smaller laptop to take with us when we go on short trips and vacation so we can keep up with the news, etc.  I was surprised how fast this laptop is, it is quicker than my larger one.  The price was also great.", "Date": "February 28, 2014"}, {"Title": "Big Help", "Author": "JAIME MUNGUIA", "ReviewID": "REX3PDJ9BNB85", "Overall": "5.0", "Content": "It's now 6 years old, still works fine. I started my online freelance carrier using it .. maid my first buck and 12x netbook price using it! I gave it to my father and bought High configuration desktop for me. ..", "Date": "February 28, 2014"}, {"Title": "Parents love it!", "Author": "flyingmonkie", "ReviewID": "R17QX5J6CMSWO4", "Overall": "5.0", "Content": "Got this for my parents about 6 months ago and they absolutely love it!  Does everything they need.  Was afraid it would be too small for them, but they always comment on how perfect the size is.", "Date": "February 27, 2014"}, {"Title": "Just right", "Author": "Erdsters", "ReviewID": "R3GN6RH8YVQUW2", "Overall": "4.0", "Content": "Everything as expected, great little laptop. excellent service. Easy start up.great battery life, bluetooth works perfect. built in kickstand is nice", "Date": "February 25, 2014"}, {"Title": "Acer was listed as one of the top computers for a reasonable price", "Author": "Loraine D.Anspach", "ReviewID": "R2AW7YE0NA2XCJ", "Overall": "5.0", "Content": "This was a gift for my granddaughter.  She loves it.  I checked on the internet for a computer for her and this seemed to be a very good one for her needs when she starts college.  It had good reports on it and I also had an Acer for my first computer, which was given to me. I would recommend this computer to others.  Reasonable in price and is just the best for her.", "Date": "February 23, 2014"}, {"Title": "COMPUTER SUMMARY", "Author": "KEVIN KULL", "ReviewID": "R1DY0FUK50XZVM", "Overall": "5.0", "Content": "I DID SOME RESEARCH AND GOT WHAT I ORDERED, THAT'S  WHAT I WANTED SO I AM HAPPY WITH IT! HOPEFULLY IT WILL ALWAYS WORK OUT THIS WELL!", "Date": "February 21, 2014"}, {"Title": "A Real Performer", "Author": "Stanley O. Epstein", "ReviewID": "R3GVMQCB8WEFFY", "Overall": "5.0", "Content": "This laptop is very reasonably priced and does everything that I needed it for, and then some.  My primary purpose was to connect it up so that i could do the procedures while lying down and viewing everything on my TV screen.  Stan Epstein", "Date": "February 20, 2014"}, {"Title": "The only Windows 7 computer that I could find", "Author": "mazie", "ReviewID": "R27AOAYZQ6C5G3", "Overall": "5.0", "Content": "I love it.  I was afraid the keyboard would be too small and hard to use, but no problems at all.  I hated Windows 8 and this was recommended by a friend who has one and loves it too.  I have no complaints and highly recommend it.  All of the keys are perfectly tight/loose, however you want to put it.  Not too sticky, not too loose that you accidentally hit the wrong one.", "Date": "February 20, 2014"}, {"Title": "Very Decent for Price", "Author": "M", "ReviewID": "RW18SFSAOMBJE", "Overall": "4.0", "Content": "I purchased this computer for my job search and it has served that purpose well. The wireless internet card has not had any issues, and I am able to have multiple Modzilla tabs open at once without any problems (I also have multiple word documents open at the same time-- this has not caused any issues). Occasionally I watch short (10 min) Youtube videos, which seem to run fine.The battery usually lasts 6-7 hours between charges. I like how this computer is light and very easy to carry around-- it is similar to the size of a book!The only problem I run into is that my Solitaire games sometimes stall out,  which is remedied when I minimize and re-open the window (weird!). This machine probably wouldn't work for on-line gaming or more demanding applications, but it works for my purposes. Overall, I am happy with my purchase.", "Date": "February 19, 2014"}, {"Title": "good netbook but", "Author": "Jazzygirl719", "ReviewID": "R2O1XRXIQ6WTFK", "Overall": "4.0", "Content": "This netbook was a gift for my ex so I decided to keep it instad of returning it after having it engraved.it is a functional PC however the processor has some lag", "Date": "February 17, 2014"}, {"Title": "Very Good", "Author": "Daren Arellano", "ReviewID": "R3IZ3NXLTMH671", "Overall": "4.0", "Content": "This computer is a good alternative if you want to work for essential stuffs. I really like it a lot", "Date": "February 3, 2014"}, {"Title": "Acer Aspire", "Author": "Peg Dienhart", "ReviewID": "R2SO20LG46AZOD", "Overall": "4.0", "Content": "More of a notebook than a laptop...quite small/compact.  Works great - but find the mouse is extremely sensitive.  Also need to determine how to quite getting all the dang pop-ups that seem to have come with it.  A little smaller than I wanted, but it's functional.", "Date": "February 1, 2014"}, {"Title": "Nice computer for price", "Author": "Andrew F.", "ReviewID": "R2G21122HWKN81", "Overall": "4.0", "Content": "I think it is a great computer. I've had it for about a month. I have had no issues with it. It is a compact size. I was expecting it to have the DVD Drive in it. I just didn't read the Specs on it close enough before I bought it. I don't watch a lot of DVDs anyway. I just use a portable DVD player to download info. Good deal on it Though.", "Date": "January 31, 2014"}, {"Title": "JUST WHAT I NEEDED", "Author": "J. Jackson", "ReviewID": "R3T8EVSK45ES0M", "Overall": "5.0", "Content": "Small, light weight. Still could get Win7. Ideal if you do a lot of traveling. Does not have to have battery installed if plugged in.", "Date": "January 27, 2014"}, {"Title": "Seems to work ok - reserving right to comment again later on down the road if it fails to live up to its advertisement ratings.", "Author": "M. Thompson", "ReviewID": "RPVYU1MA2VEPE", "Overall": "4.0", "Content": "Arrived via UPS packed fairly decently but I would have liked to have seen more padding around it in a larger box from Amazon as it was too tight in its box from the manufacturer and the way the delivery company handled it (carrying it with one hand) didn't seem so safe for a $350 price.  --Aside from that, it seems to work ok, the only minor problem was that when I uninstalled MacAfee's Anti-Virus big whopping generous 1 month trial (can they spare it?sheesh!) and after thoroughly cleaning it off my machine and then trying to load one of the much better freeware anti-virus programs I know works much much better (and costs nothing) - the program wouldn't install until I manually chose a specific folder (of 5 choices) for where the usually automatic \"download manager\" to download the program to. A quick attempt to reach Acer techs to ask met with a very convoluted system designed to prevent you from calling them, and or chatting with them either-- so I called a friendly tech I know at ANOTHER  company - and he answered my question for free.  I would have bought his company's computer but it was out of my price range. I'll give this Acer a try however, and if after a year it;ls still working ok (or before that if it doesn't), I'll update this review.", "Date": "January 23, 2014"}, {"Title": "Very pleased with this laptop", "Author": "Sojourner Truth \"Sojourner Truth\"", "ReviewID": "R2WOZOU5K1WOPE", "Overall": "5.0", "Content": "I have two older Acer Aspire netbooks, the older, smaller versions of this one.  I use one to run my amateur radio station and the second to run my weather station.I use this one for my volunteer work . . . haul it around from rescue squad to museum to free clinic.I'm somewhat puzzled at other commenters who say the keyboard doesn't respond and the mousepad is not sensitive.  I find exactly the opposite . . . I've had no problems with the keyboard and I find the mousepad to be a bit too sensitive.Battery life is great; I'm getting 5 - 6 hours from a charge.  The battery tilts the laptop slightly forward and I find that quite convenient.No DVD player, but, I have an external HP DVD drive that plugs into the USB port and works fine.", "Date": "January 22, 2014"}, {"Title": "Acer", "Author": "pat d.", "ReviewID": "R3F143QKTXHSKL", "Overall": "4.0", "Content": "This laptop is great,and I really like it. Would recommend to family and friends. My nephew has already bought one.", "Date": "January 22, 2014"}, {"Title": "Perfect", "Author": "Ramblin Gamber", "ReviewID": "R33FKDOGD3CF18", "Overall": "5.0", "Content": "Got it as a gift for my wife, she loves it.  I liked that it was still available in windows 7, I was afraid I was going to have to use windows 8 (I plan to skip that OS altogether).  I wish it had a touch screen, but it looks like only the windows 8 laptops had touch screens.", "Date": "January 20, 2014"}, {"Title": "a lot of bang for the buck", "Author": "Glenn Harvey", "ReviewID": "R3NPKDQ9GVJ2TL", "Overall": "5.0", "Content": "unit booted up at once and has preformed to all expectations and beyound, I would gladly do it again thank you", "Date": "January 17, 2014"}, {"Title": "5 star good laptop, great prize", "Author": "Stretch", "ReviewID": "R2KD81ZM0UZUT4", "Overall": "5.0", "Content": "The laptop is light, easy for travelOthers laptop I have are heavier, harder for travelGood prize, not to worry too much, when travel with", "Date": "January 14, 2014"}, {"Title": "MUCH BETTER KEYBOARD THAN EARLIER MODELS", "Author": "Shopperdeluxe", "ReviewID": "RI3D5TPX44N5O", "Overall": "5.0", "Content": "I had a smaller early version that I carried around forever because a netbook is so convenient.  This one is a little larger but I can actually type on this keyboard instead of having to resort to using two fingers because the keyboard was so small and awkward.  I have been confined to bed with a broken foot, and this allowed me to keep up with the world and my work.  The netbook is also much faster than my desktop.", "Date": "January 14, 2014"}, {"Title": "Overall good computer", "Author": "Cbutzkazoo", "ReviewID": "R3ZNEQEVWWPES", "Overall": "4.0", "Content": "I got this as a replacement to my Acer Apire One...which I loved, but it was 5 years old and needed to be replaced. I like the bigger screen and Windows 7. I don't like the keyboard as much as the old one due to the fact that the keys are spread out instead of touching each other. I can't type as fast, maybe as I get used to it I'll like it better. I don't like that it's heavier than my old one, but not too big of a deal. At first I had trouble staying connected to the internet with the new one, while all my other devices had no problems, but after resetting my modem and router it seems to be doing better at keeping the connection. Overall this is a good computer.", "Date": "January 14, 2014"}, {"Title": "Daughter loves it", "Author": "CrazyCatLady", "ReviewID": "R7BDX4TN0I3LA", "Overall": "5.0", "Content": "My daughter needed to replace her old laptop and wanted something smaller. This is definitely smaller! We looked at different brands and read reviews before deciding on this as being the best value for her money. I don't like that it doesn't have a separate number keypad, but she doesn't mind. Haven't heard any complaints out of her yet about it and she downloads and/or watches lots of shows and uses it for her college classes.", "Date": "January 12, 2014"}, {"Title": "Aser Aspire", "Author": "Patrick Irelan", "ReviewID": "R2EYQZZR6OOZEK", "Overall": "4.0", "Content": "Very reliable laptop. It's light and easy to transport. I take it with me everywhere I go. It was well worth the money.", "Date": "January 10, 2014"}, {"Title": "Great lil laptop", "Author": "Lisa Taylor", "ReviewID": "R3N34PR4IU4KZJ", "Overall": "5.0", "Content": "This laptop was easy and simple to set up and get started.. perfect for my home and easy for my kids to use.  The speakers could have been better but it wasn't a deal breaker... this is a great little laptop... love it!", "Date": "January 6, 2014"}, {"Title": "Bought for work", "Author": "AZ Frequent Flyer", "ReviewID": "R3658D177DM6KJ", "Overall": "4.0", "Content": "My work requires me to do a lot of work in the field, so instead of writing it all out and then coming back to the office, I could use this in the field and then copy/paste to an email and send it to work, and then copy/paste from there, no sense doing work twice.  I had to buy a wireless mouse to go with it, as I am old school and hate the pad, but knew that before I bought it, now it works great, need to get adjusted to the key board, as I am used to a bigger one and pounding.  Too bad my company does not provide us with these, or reinburse, but almost everyone goes and buys there own, so why bother, hope it can come off my taxes, as otherwise I had no reason to buy it.  It  works just fine, and I ordered it because it had Windows 7 on it, I didn't want the hassle of Windows 8, I wanted to be ready to go..", "Date": "January 4, 2014"}, {"Title": "Great size!", "Author": "minnie", "ReviewID": "RLB01C39VBZOR", "Overall": "3.0", "Content": "This is a great size for my needs. But......it will not send letters and freezes up frequently. I always have to restart it. Slow but fine for my kitchen use.", "Date": "January 1, 2014"}, {"Title": "Exactly what I was looking for", "Author": "Kristopher Garity", "ReviewID": "R1HGMZTIAIHOJR", "Overall": "5.0", "Content": "This laptop is a great buy. I would recommend this to any of my friends or family. I love it.", "Date": "December 30, 2013"}, {"Title": "great laptop", "Author": "Cameron Klein", "ReviewID": "R1AOKM3UG8LWZJ", "Overall": "5.0", "Content": "I got this laptop for my Christmas present and so far I have had no problems with it and it is a great laptop for the price", "Date": "December 27, 2013"}, {"Title": "Its very good for its price.", "Author": "Ortodontic", "ReviewID": "R2CD8GDU0NTJX2", "Overall": "5.0", "Content": "I had to replace my old netbook, I found this pretty netbook for 299 dollars, what a good de al I did. After a week of use, I think it is better than I spected. My lema in laptops is: buy the cheapest you find, they dont support moré than 3 years.", "Date": "December 27, 2013"}, {"Title": "Nice little travel laptop", "Author": "R. Carlson", "ReviewID": "RJLLTX4P36PZ8", "Overall": "5.0", "Content": "This is a great little laptop for travel, with much of the power of a full-size laptop.  Keyboard is easy to use.", "Date": "December 12, 2013"}, {"Title": "Acer Aspire V5-131-2629 11.6\" Laptop", "Author": "Katharine A. Espinoza", "ReviewID": "R1ON41M3JY5BU9", "Overall": "5.0", "Content": "I purchased this computer for my future travels.  I recently travelled to Europe, and took my 17\" laptop, as well as cameras, etc. and decided then that I would look for a smaller computer, and this one is perfect.", "Date": "December 11, 2013"}, {"Title": "Excellent", "Author": "Maria Sandoval", "ReviewID": "R3QJGLZVJGBQMX", "Overall": "5.0", "Content": "Excellent product. Comes as is as pictured, well packed. Thanks for the Sale and Happy Holidays. Very good. very nice", "Date": "December 5, 2013"}, {"Title": "Works great for me.", "Author": "T. Roberts", "ReviewID": "R1ZC089FEFCT5B", "Overall": "5.0", "Content": "I really like the size of this laptop. Very portable. Also, I was ready to go back to Windows 7. I don't hate Windows 8 but I really prefer 7. No internal CD/DVD drive but given how rarely I use them, no big deal. Would recommend this computer.", "Date": "November 26, 2013"}, {"Title": "excellent", "Author": "Joey Cook", "ReviewID": "R2W4696CBP1Y96", "Overall": "5.0", "Content": "loves this computer I needed a step up from my windows vista desk top. I use it for my photography bussiness and internet and it downloads all my photos perfectly. Of course I keep my photos in another place so I didnt need alot of storage space.", "Date": "November 26, 2013"}, {"Title": "Acer laptop", "Author": "yokosen", "ReviewID": "R2V0W1KBWAWIBG", "Overall": "5.0", "Content": "It's in perfect condition, and works very well. I'm so glad I purchased this item, as a gift for someone.", "Date": "November 21, 2013"}, {"Title": "Simple and well designed", "Author": "Dan C.", "ReviewID": "R2U420NBXNXZ68", "Overall": "5.0", "Content": "great buy--simple and efficient. I replaced an aging Toshiba for use as a quick internet source on the kitchen counter.", "Date": "November 9, 2013"}, {"Title": "My new computer", "Author": "Fred Yule", "ReviewID": "RY0F82H0NMB0N", "Overall": "5.0", "Content": "Great product. I had a little problem adjusting to the small screen but works fine as long as I remember to carry my glasses. I do a lot of traveling so the small size is perfect. Fred Yule", "Date": "October 10, 2013"}, {"Title": "Nice small laptop", "Author": "MT G'ma", "ReviewID": "R3U03T8D22248D", "Overall": "5.0", "Content": "This one fits in my oversized bag -- no need for a big briefcase. I really like the size and I'm a fan of the ACERS.", "Date": "October 9, 2013"}, {"Title": "All I hoped for", "Author": "Gary Smith", "ReviewID": "R1GTTAESN8NM1", "Overall": "5.0", "Content": "This computer is a perfect traveler with a long battery life and it is FAST! I couldn't be more pleased.", "Date": "October 8, 2013"}, {"Title": "KEYBOARD SUCKS!!!!", "Author": "Shuga", "ReviewID": "R19HMBU8JIRC0L", "Overall": "1.0", "Content": "I bought this computer two years ago and within a year the \"T\" button on the keyboard went bad. I had no way of replacing it so I had to buy a whole new key kit to replace the one button. Within six months of replacement, three other keys had the same problem---including the first key that had the issue!!! It is so annoying trying to type with it. Now I have to attach a wireless keyboard in order to make it functional! What a waste", "Date": "January 28, 2014"}, {"Title": "Acer Aspire not fully what I expected", "Author": "Susan C. Thomson", "ReviewID": "R1WAYKFEL4FCFZ", "Overall": "3.0", "Content": "The Acer Aspire arrived on time and the setup was easy. I bought it to be able to dedicate a small, portable laptop to my writing and was surprised to learn that I needed to buy a word processing program to do so. The \"Starter\" MS Office (Word) did not function like I expected it to. So now, after spending a substantial amount of money, I can actually do what the purpose of my purchase was.The other issue is that the touch pad is not very sensitive and the space bar, when typed, only makes a space about 50% of the time.", "Date": "October 2, 2013"}, {"Title": "several keys on the keyboard don't work", "Author": "JES", "ReviewID": "R862VMVXY0GMU", "Overall": "1.0", "Content": "I just received this today, and everything seemed great -- but I soon discovered that three of the keys just don't work ( the 5, 7, and 9).  I'm obviously going to have to return it, which is a major pain. I guess I'll ask for a replacement; I hope that happens quickly, since I really need a laptop within the next two weeks. I'll update this review with the outcome of the return.", "Date": "May 18, 2014"}, {"Title": "Defective product", "Author": "Palma You", "ReviewID": "R9VEC9G2DLQTT", "Overall": "1.0", "Content": "The Acer service center told me someone called about this particular laptop in March 2014 and it didn't work then. Amazon sent it out to me in May 2014. Lucky me, it still has the same problem, the screen is defected.", "Date": "May 9, 2014"}, {"Title": "Let down by the keyboard and touchpad", "Author": "KC", "ReviewID": "R3F8G2U6FTA973", "Overall": "3.0", "Content": "This is a decent mini laptop (I won't call this \"ultrabook\" because it is obviously built for the bodget-minded). Nice solid construction. Decent screen. The Celeron is adequate for general internet browsing, social networking, Skype and simple Office work. The battery life is decent for its weight and size.My biggest pet peeve is the KEYBOARD - keystrokes are shallow and sometime inaccurate, plus, some keys such as the \"O\" and \"Z\" are faulty - this should never happen in a brand-new laptop. Bad keyboard is obviously a cost-cutting measure, but keyboard is so important on a laptop computer!! The touchpad performance is also sub-par - navigating the pointer and double-tapping are not very sensitive.I was so mad about the bad keys I actually bought an OEM replacement keyboard. It just arrived today and I spent two hours replacing it (quite a chore!), and then to find out that the <arrow down> key is faulty!!! At least all the letter and number keys work alright, and I can get by using the mouse. This just shows that Acer uses low quality keyboards.", "Date": "May 8, 2014"}, {"Title": "second time around is better than the first time!", "Author": "C. Van Blake", "ReviewID": "R19HS5IXZ44A3C", "Overall": "5.0", "Content": "This is my second Acer Aspire notebook and I swear by them.  They are sturdy, fast, light weight and have all the computing power of a much larger machine in a smaller, more convenient package.  I love them!  For serious computing power on the go this is the machine. Invest in a good carrying case that protects it from bumps and it will serve you faithfully for years.  I consider this the best value for the money on the market.  I have tried other reasonably priced brands and was disappointed. For the features, speed, memory and hard drive capacity this is the one!  I have been a software engineer for 30 years and work online frequently.  This little number delivered what I needed for professional on the go computing beautifully. Don't know how it works for gaming and other uses but for business applications, internet access. VPN access and professional usage it fills the bill for a very reasonable price. Recommend getting an external USB CD drive to go with it if you will need to read or write CDs and DVDs.  Highly recommended.", "Date": "May 1, 2014"}, {"Title": "great little laptop (notebook)", "Author": "catlover", "ReviewID": "RJFW5KARDA2BA", "Overall": "5.0", "Content": "Has Windows 7 & is great size - my 2 major reasons for buying it. Tried an Asus notebook with Windows 8.0 & touch screen and didn't like at all. Windows 8 is not nearly as easy to use. I have had this notebook for about 6 weeks and the battery life is super - at least 6 hours. Only problem I've had is hooking it up to our HP printer. I think that is our printer and me. No fault of the notebook.Again, great little laptop, easy to use and transport.", "Date": "April 27, 2014"}, {"Title": "Weird little beastie", "Author": "critters", "ReviewID": "R2GKI2VS13MB7R", "Overall": "5.0", "Content": "I have to say that this is a seriously strange little computer. First, it has NO CD/DVD drive; and second, it has a completely bizarre plug. Size wise this one reminds me of my mom's Acer Chromebook, but, yes, it DOES run with Windows. At times I find the screen to be too small, and I can't read it, but sometimes the small size (almost pocket sized) is terrific. I didn't realize it didn't have DVD, which has been an adjustment, and the weird, screw on plug is positively huge; it literally takes up my whole power strip. If, however, it manages to be better than last year's lemon (and, hopefully, LOTS better), I'll be satisfied.", "Date": "April 19, 2014"}, {"Title": "first and last acer laptop computer", "Author": "collinsj61", "ReviewID": "RCS9J5SNLE224", "Overall": "1.0", "Content": "after a few hours use the acer locked up and wouldn't turn off. i had to return it for a replacement.", "Date": "January 2, 2014"}, {"Title": "Acer", "Author": "ISMAT A.", "ReviewID": "RC2Z8BD1CDJ91", "Overall": "4.0", "Content": "ACER is...Small and convenient, and of course it's way better than the sucking Windows 8 which makes people sick", "Date": "November 7, 2013"}, {"Title": "the worst laptop I ever owned", "Author": "Lola Lee", "ReviewID": "RWPFTM7LZVKB4", "Overall": "1.0", "Content": "I bought this laptop due to the good reviews and I own an Acer tablet that I absolutely love. So I thought: Give  this ACER a try. You could not beat the price, and I didn't have the money to buy a new MAC after mine died.Horrible decision. It stalls on me all the time. I have to reboot so much, it's not even funny anymore. Programs sometimes open or not. Usually I have to reboot if that happens, then it works like a charm, until I try to do another task on this computer.I am so frustrated, that I think to leave this device now just for writing documents, printing and watching movies. By the way: I write this review here on that device, after rebooting this morning again, as usual (often have to remove the battery as well to make it work again). It wasted so much time of my day, that I am more than frustrated. I will look for another laptop now for online duties, and leave this as a spare. After all, it is a good DVD player and burner. But it is not up to the task, and I am not even using it that much. I guess in the end you get what you pay for. After this piece of junk, I am dreaming of the good ole days with my MAC. Will not be able to afford another MAC, so I will check out ASUS for a backup laptop. Because with this piece of junk, you NEED a back up.", "Date": "February 8, 2014"}, {"Title": "If I Could Give No Stars, I Would", "Author": "angelina", "ReviewID": "RB2Q01OS9BZ98", "Overall": "1.0", "Content": "I bought this laptop for my boyfriends birthday which was 2 days ago. I bought it towards the end of February since I wanted to be for sure that it arrived on time. I am so pissed off. We turned it on and it showed Windows starting up, then flashed to  a blue screen, then a black screen and said \"Windows cannot repair this computer.\" I tried reinstalling Windows, no luck. I think the hard drive is corrupt. Last time I buy electronics on Amazon. Also, since I bought it over 30 days ago, guess who spend $400 and isn't getting a refund or new computer? This girl!", "Date": "April 23, 2014"}, {"Title": "Power supply defective", "Author": "JanJ", "ReviewID": "RHGFOEX9TTO2H", "Overall": "1.0", "Content": "I bought this laptop for my 12 year old for Christmas. The power plug has to be connected to the power adaptor to charge the battery but won't stay connected. The instructions say to push in and turn clockwise until you hear a click. No matter what I do, it won't turn so if you move the cord, it disconnects. I tried calling customer service at Acer but you reach someone in India that is absolutely unintelligible. The phone noise is very bad, they don't speak very good English and don't listen to the problem. He just kept saying \"can you turn the laptop on\"? This laptop is also very slow and takes quite a while to load anything on the internet. I can only hope it doesn't get any worse.", "Date": "January 7, 2014"}, {"Title": "Shipped With Wrong Battery", "Author": "Bob", "ReviewID": "RKBQLH20NA7QK", "Overall": "4.0", "Content": "Hey Amazon.....Your service is usually so perfect that I'm a little surprised. The battery is not as shown in the product photos. Can I get the correct (flat) battery please.Otherwise, it arrived quickly and without damage.", "Date": "November 13, 2013"}, {"Title": "Disappointed!!", "Author": "Luciano Insua \"Lucho Insua\"", "ReviewID": "R3F7SZZKYURJNE", "Overall": "2.0", "Content": "Cheaply made.  It feels cheap, the keyboard is not very sensitive. The touchpad is clunky and not very responsive, the screen resolution is not very good either.  Good battery life and lightweight.  It is really thick around the battery.", "Date": "November 9, 2013"}, {"Title": "Stuck key?", "Author": "Barbara", "ReviewID": "R2Y8N48F2KY3NJ", "Overall": "1.0", "Content": "The computer is \"possessed\", the letter \"h\" just fills in by itself.  I am having a friend look at it , but will probably return it.", "Date": "October 14, 2013"}, {"Title": "Just What I needed", "Author": "Amazon Customer", "ReviewID": "R2FSTFRPCX32ER", "Overall": "5.0", "Content": "I use this computer for church.  I downloaded a bible software and a dictionary and used Word for my church notes.  It helps me to keep up with my minister.", "Date": "September 3, 2013"}, {"Title": "Defective", "Author": "S & J", "ReviewID": "R2AS08PDPZUYF0", "Overall": "2.0", "Content": "Whenever I moved the computer in any way, the screen would flicker off momentarily (screen turned black) then it would turn back on.  Clearly a hardware-related issue.  I returned it for a refund.", "Date": "September 25, 2013"}, {"Title": "light, cheap, functional", "Author": "Christopher", "ReviewID": "R3JCYOYOP9R7QP", "Overall": "5.0", "Content": "If you don't want to spend a lot of money and use a computer for the basics (browsing, occasional video watching, music downloading, etc., then this is perfect.  I bought it used/refurbished and had no issue setting things up.  I was reluctant at first to buy used, but I'm glad I did and saved a good amount of money.", "Date": "May 13, 2014"}, {"Title": "Pleased with performance for the price", "Author": "B. Shields \"ShieldsBJS\"", "ReviewID": "R2AUI9W2T2TIRD", "Overall": "4.0", "Content": "I inadvertently purchased this laptop without paying attention to the fact that it was an 11.6\" screen.  When it arrived, I thought, \"oh no, I'm going to have to send this back\" but curiosity and the need for a new laptop took over so I took it out of the box and booted it up.  It's not going back.  It is perfect for my needs.  I use it every day for hours at a time.  When I need a large screen, I can connect to a larger monitor but I rarely do that.  It is the perfect size for working off your lap.  Most consumer laptops are enormous and heavy and not ideal for true 'on your lap' computing.  Not this one. Small and relatively lightweight.A couple of times I've heard an unusual sound that from past experience sounds like it could be coming from the hard drive but all health checks continue to come up clean so keeping my fingers crossed and my backups up to date.Running MSOffice 2013 and basic Internet browsing activities and am very happy with the device for the price.  Don't be afraid to get this machine for your student or yourself if you need something small and affordable for basic computing needs.", "Date": "May 11, 2014"}, {"Title": "I love it", "Author": "Judy Kolish", "ReviewID": "R2YAKM9KTT6TI3", "Overall": "5.0", "Content": "was given as a gift", "Date": "April 27, 2014"}, {"Title": "exelent for my special needs", "Author": "barranness", "ReviewID": "R2KKJ36PRNUCV7", "Overall": "5.0", "Content": "bought this as a backup for my work. i work for a power company. this netbook fits my needs for the work i use. neough HD space. and i really wanted a windows-7 edition. if i could i would buy another as a spare. soon they wont make them anymore.  also i sue it for my Ham Radio station and for Field Day. yes i would recomend this product. seller shiped fast. thanks Amazon.", "Date": "March 27, 2014"}, {"Title": "it is a good labtop notebook", "Author": "andy", "ReviewID": "R1RBL374Q8OKA9", "Overall": "5.0", "Content": "it goies good home had to get resetit is easy to usenice set upit help to use it", "Date": "March 13, 2014"}, {"Title": "not as portable as the older 8\" version", "Author": "MJ", "ReviewID": "RJQ2NTYJLVMAU", "Overall": "3.0", "Content": "I actually didn't realize my old one was 8\", now I wished I'd paid more attention.  The new 11\" one isn't as easy to travel with because the battery pack sticks out away from the base, its not a flat surface so it gets caught on things making it harder to pull out of carrying case at airport, for example.  Its also really uncomfortable to rest on your lap when typing.", "Date": "February 8, 2014"}, {"Title": "Touch pad is defective", "Author": "lajreader", "ReviewID": "R1QFCHQMMCBZ6C", "Overall": "3.0", "Content": "I had an Acer Aspire One 10.1 inch net-book that I loved. Trashed it when I spilled a latte on it while writing at a cafe. So sad. I bought the Acer V5 11.6 thinking going a little bigger might be nice. I also wanted Windows 7 not 8. I like the net-book very much, but like many other users I.HATE.THE.TOUCH.PAD!! It is so defective! I am not liking the larger keyboard either, I spend a lot of time backspacing and deleting if I don't watch what I'm typing. BUMMER!  It's not comfortable to use on my lap, I have to sit at a table if I want to do any serious typing. AGAIN BUMMER! This is a serious issue for me, I've had the V5 for 3 months and I'm ready for a change. I'm thinking I'll mortgage my house and buy an I-Mac.It's too bad, because for the price and it's easy carrying around weight and size this could be a terrific net-book,  It really falls short of the mark with the horrible touch pad and the too wide keyboard. I am regretful to say the least and I miss my little Aspire One immensely.", "Date": "January 6, 2014"}, {"Title": "Returned It", "Author": "Liz Hamill \"Liz\"", "ReviewID": "R3E03UVH1RAZ27", "Overall": "1.0", "Content": "I originally gave this three stars but after using this computer a few days I couldn't take it anymore - had to return it. Unbearably slooow.", "Date": "January 1, 2014"}, {"Title": "Not what I expected", "Author": "Christina Lorfing", "ReviewID": "R2IAO6Y3DUHRW5", "Overall": "2.0", "Content": "It is much smaller than I thought it was going to be compared to the pictures.  The keyboard is not even user friendly where the spacebar is not even in a convenient spot.  I would not recommend this computer to anyone that has to work on a pc.", "Date": "March 21, 2014"}, {"Title": "no power to it", "Author": "Ben Ohmart \"book publisher\"", "ReviewID": "R33HU4OIJKMH5D", "Overall": "1.0", "Content": "Terrible computer. I had to return it because it wouldn't even start. That is, it was so sluggish, it wouldn't do a damn thing.", "Date": "November 10, 2013"}, {"Title": "Problem on Keyboard", "Author": "FRANCISCO N.", "ReviewID": "RDRAOKLGEACRO", "Overall": "2.0", "Content": "It came with problem on keyboard, exactly on space bar. It's annoying very much and I won't ever buy any Acer products.", "Date": "October 2, 2013"}, {"Title": "working well", "Author": "goodsign", "ReviewID": "R57GZJ9ZDUW39", "Overall": "4.0", "Content": "I bought this as a back up to my other 2 laptops. Set up was a lovely breeze.I was able to take it out of the box and have it connected to my other W7 machine and install chrome in maybe 30 minutes. But, I'm kind of slow. I like the light weight. My other laptops weigh a ton.Another plus: it doesn't seem to be pre-loaded with a lot of junk. I think McAfee is on there but I haven't figured that out yet. I'll probably switch to Avast. So far a few difficulties with little things, but it works nice.Cheers,", "Date": "August 30, 2013"}, {"Title": "junk trackpad - good laptop", "Author": "becky", "ReviewID": "R3TZTSDWYN7SXK", "Overall": "3.0", "Content": "I only rate it as okay because it's forgone major software errors thusfar. However, as advertized, the trackpad is a Piece of $***. It regularly glitches out and refuses to work, and it's obviously a hardware problem since I've already tried reinstalling try drivers. You'd think Acer would do something about this, but as far as I've seen, they're still selling the laptop as is.I bought the model from sams for a hundred dollars more, it came with a terrabyte hard drive and a better service plan ( which of course does nothing about my track pad problem since it only seems to happen when I'm typing a college paper of something of the sort).Overall, as long as you don't mind buying a logitech mouse to go with it, it's a good computer. The webcam works well, it does good browsing the internet. Like any laptop the battery claims are exagerated, but it's still got a good two or three hours of heavy use in it.As far as the touch screen goes it's somewhat unresponsive when it comes to zooming in. However when operating touch-based features such as apps and Windows 8 features it does very well. Which comes in handy when I forget my logitech and my track pad screws up.", "Date": "November 23, 2013"}, {"Title": "Eh.", "Author": "Bill", "ReviewID": "R33LCW4RF3NIN1", "Overall": "2.0", "Content": "Ok laptop. Has a strange hum to it which is pretty loud for such a small laptop. Good laptop for surfing the internet.", "Date": "November 17, 2013"}, {"Title": "Pricing???", "Author": "seakfh \"seakfh\"", "ReviewID": "RJ51FIMIJ1F90", "Overall": "4.0", "Content": "this computer dropped to $299.99 yesterday 11/18/13.  I was going to buy today and noticed it went back up to $344.99?  Seems like a good basic computer for those that want win 7.  Would be even better at the lower price.  I guess I will wait and see if it drops again.", "Date": "November 19, 2013"}, {"Title": "good not great", "Author": "chris stipak", "ReviewID": "RNPLTYRNJ1CRT", "Overall": "3.0", "Content": "its not put together well. for something new, its a little beet up. other then that its a good laptop.", "Date": "November 19, 2013"}, {"Title": "poor display", "Author": "carol a. petry", "ReviewID": "RMGYUUNG3NH9T", "Overall": "3.0", "Content": "the screen is difficult read  --- is disapOtherwise I like the size, keyboard and battery life but I would not recommendit to someone else ointing!", "Date": "November 27, 2013"}, {"Title": "came with hardware issues", "Author": "S. Tan", "ReviewID": "R3EKA0TQTP62FD", "Overall": "1.0", "Content": "The price is good for the specs and I liked the size but it came with hardware problems so I returned it.", "Date": "October 14, 2013"}, {"Title": "Acer Aspire Review", "Author": "Connie Coddington", "ReviewID": "R33PQXHUDA84TY", "Overall": "3.0", "Content": "Mouse pad is terrible.  Must have a mouse.  No CD Rom, so can't use any CDs,  Some items are very small due to screen size.Weight and size are convenient and I am getting use to the small keyboard. As an only computer not the ideal choice, but the cost was good.", "Date": "September 2, 2013"}, {"Title": "no cd drive", "Author": "mohammed bhuiyan", "ReviewID": "R2DT2NRHLNVJPC", "Overall": "1.0", "Content": "i did not know that it does not have cd drive. now i have to buy portable cd drive. extra $50", "Date": "April 4, 2014"}, {"Title": "Junk", "Author": "Peach", "ReviewID": "R7U80GGC6WOW8", "Overall": "1.0", "Content": "Crashed frequently, difficult to use,Did not meet not meet my expectations.Returned it after one week.Very disappointed in the quality", "Date": "October 11, 2013"}, {"Title": "Piece of crap", "Author": "B. Stancliff", "ReviewID": "RSSZ9VL37D5TQ", "Overall": "1.0", "Content": "Main computer use is word processing, web surfing and minor computer based art and photo manipulation. Acer Aspire V5 was purchased after a HP laptop died after three years of rather heavy school use. Main selling points were 4 megs of RAM, 500 meg hard drive and the $340 price at Staples. In the six weeks between the HP dying and my purchasing of the Acer Aspire V5 I sampled a few tablets with the idea that they could adequately replace the HP, I had various issues with each of the tablets but the death knell for all of them was connectivity issues with my printer and their small RAM and hard drives. However, after dealing with this Acer for over a month I feel I would have been better off sticking with the Microsoft Surface. Yes the Acer V5 has 4 megs of RAM, unfortunately the processor takes the speed down to around 1 meg, I had a Gateway 12 years ago that was faster, in all aspects, than this Acer V5. I had to spend a three days scrubbing the bloat ware which was using 90-95% of of the CPU, after uninstalling the mountain of Acer crap it is now running with around 70% of the CPU free, from time to time, however, it starts running slow and shows that 90+% is in use and has to be restarted before it will clear its cache. On top of the memory space issues it also has trouble handling wi-fi signals, connecting isn't an issue, neither is staying connected, where it has issue lies is with the computer accepting that there is in fact internet access. Again, restarting is the only thing that resolves this issue once it starts. On top of those issues I kept getting virus warnings, straight out of the box, from McAfee and Norton both. Downloaded AVG just to make sure and AVG informs me that Windows has been installed incorrectly and is causing a false virus signal. Other issues consist of, touch pad unresponsive to tapping and the scroll is horridly placed (entire right hand edge of touch pad) for a right handed user. The SD card reader is located under the right hand side of the device, an SD card can be inserted without flipping the lap top over, extracting it however is essentially impossible. The SD card reader is slightly recessed and upside down (the nail slot on the card cannot be accessed), if this was a self ejecting slot this would not be an issue, but its not. The first time I used the card reader it took half an hour and a pair of tweezers to remove the card. I will not be using that slot again. All in all I've found the Acer Aspire V5 to be a wonderful, if lightweight and somewhat expensive, paper weight. The chances that I will be purchasing another Acer product in the future are very slim, I didn't expect a super machine, but I did expect something faster and more reliable than a computer I had over a decade ago.", "Date": "September 16, 2013"}, {"Title": "Don't waste your time", "Author": "Robbie L. Eidson", "ReviewID": "R223IK9EW6ASVA", "Overall": "1.0", "Content": "This computer comes standard with so many viruses and malware that it's unusable. Stay away ... very bad decision to buy this", "Date": "March 12, 2014"}], "ProductInfo": {"Price": "$440.53", "Features": "Windows 7 Home Premium - 64-bit version\n1.5GHz Intel Celeron 1007U processor, 4GB DDR3 memory, 500GB hard drive\n11.6-Inch LCD display (1366 x 768), Intel HD Graphics, Intel NM70 Express chipset\nWebcam, Wi-Fi, 10/100 LAN, Bluetooth, HDMI, USB\ncard reader, 6.5-hour battery, 1-year limited warranty", "Name": "Acer Aspire V5-131-2629 11.6\" Laptop (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/412RLkUwNxL._SY300_.jpg", "ProductID": "B00CU2K6MS"}}