{"Reviews": [{"Title": "No complaints - good backup pc  or travel laptop imo", "Author": "MCB", "ReviewID": "R1U88X1ANRIEQZ", "Overall": "4.0", "Content": "OK Well it's big, the keys are large and have a good feel/feedback. Built in web cam/mic works nice if your into that. Lots of other aux inputs usb, hdmi, mic in, earphone plug card reader yadyada...Performance is good for some games, BF2 and Unreal Tourny run fine but Farcry3 is way to slow even at the games lowest settings, but it does load and the graphics look outstanding to me.Battery power is decent, I guess about 5-6 hours, as long as your not taxing the crap out of the system. Haven't timed how long it will play a dvd movie, just web serving, email, angry birds...The plastic black case is tough but I wouldn't drop test it.I really like the textured/recessed scroll pad, this sucker was made for windows 8. Two fingers and your ready to expand, contract, basically everything you can do on a touchscreen you can do on this (don't quote me there though).Windows 8 (OS comes preloaded/no discs but can be backed up once) is like the new kid next door, once you get to know him/her then  things aren't as bad as they seemed. It's that transition that's hard. Now if you have a desktop w/out one of these laptop scroll pad things, well you may have a harder time, not that the mouse won't work it's just that Win8 seems to be built to appease both mouse and touchscreen users at the same time and things aren't organized as before. I admit I had a hard time at first (less so 2 weeks later) but it does get easier. Until I get better with Win8 I'm using a program called Classic Start Menu. It's a big help sometime.April 2013 Best Buy for $399", "Date": "May 2, 2013"}, {"Title": "Great PC", "Author": "Monica", "ReviewID": "R28BH0UBTWVCR5", "Overall": "5.0", "Content": "I had to order this for working from home. this laptop is wonderful. its large enough for me to see the entire companies applications w/o me having to use the scroll bars. this is my 3rd hp laptop. I have another 17.3 in purple for personal use and a 15 in white for the kids. love the products and their support.", "Date": "March 18, 2014"}, {"Title": "HP Pavilion 17-e113dx great laptop.", "Author": "Jose Gregorio Herrera \"Jgreg\"", "ReviewID": "R30ONWINPGU5VZ", "Overall": "5.0", "Content": "Great laptop.After doubting about the CPU I just bought it. My last laptop was a Core i3 and it was fast but screen got broken and needed a new laptop asap. I just added another memory module and with 8 GB it rocks. Also got rid really quick of Windows 8.1 and installed Windows 7. The drivers are a real issue but after few hours you will find them from lenovo and HP. The screen is huge and really nice. I like the color combination on the body: silver and black which makes it look thinner. I ran 3d mark 2003 on windows 8 and Windows 7 and the results were really different (11k on Win8 and 14k on Win7). It runs everything very well even some light gaming. Good laptop for the price and the video card is really powerfull.", "Date": "May 25, 2014"}, {"Title": "good", "Author": "reda", "ReviewID": "R7KOQWO86HIN5", "Overall": "5.0", "Content": "it is excellentbut unfortunately  it was written the color is silver  while i received  a black color onethank you", "Date": "April 19, 2014"}, {"Title": "It is okay", "Author": "Chrystal Mavencamp", "ReviewID": "R2M44YIMGIBJO2", "Overall": "3.0", "Content": "I love how big the laptop is. the only downfall is that sometimes i have to push really hard on the keyboard so the letters pop up. I am a fast typer so it is hard for me to get use to it! Otherwise don't have any other complaints.", "Date": "March 1, 2014"}], "ProductInfo": {"Price": "$699.99", "Features": "AMD Quad-Core A8-4500M Accelerated Processor (1.9GHz up to 2.8GHz)\n4GB DDR3 SDRAM Memory\n500GB Hard Drive (5400 rpm) / DVD±RW Double Layer\nAMD Radeon 7640G Discrete-Class Graphics, up to 2GB Total Graphics Memory\nWindows 8", "Name": "HP Pavilion 17.3\" Laptop Computer- AMD Quad-Core Processor A8-4500M, 4GB Memory, 500GB Hard Drive, AMD Radeon HD 7640G Graphics, DVD±RW, Window 8", "ImgURL": "http://ecx.images-amazon.com/images/I/51MgTPV2lpL._SY300_.jpg", "ProductID": "B00CDTVBJK"}}