{"Reviews": [{"Title": "great", "Author": "Kenneth McKenzie \"hotjazz2b\"", "ReviewID": "R3IC06UVTGZ1BL", "Overall": "5.0", "Content": "ok yes there are no reviews on this but I took a chance and ordered it, well its fantastic, the color is so nice and it stands out not like others but looks so cool and it does not weight much, it is slim and easy to carry, yep everything works on it like a pro, the windows 8 is so nice give it a chance, get used to it and u will love it, this things quick and boy is it easy to set up and run, the sound if excellent, the pic is so bright and has so much color to it, let me tell you , YOU WONT BE DISAPPOINTED AT ALL, AND WITH AMAZON RETURN POLICY 30 DAYS, YOU CANT GO WRONG REMEMBER TO KEEP EVERYTHING BOX CORDS AND YOU CAN SEND IT BACK WITH NO PROBLEMS, BUT YOU WONT, ITS SO GREAT I WONT ANOTHER ONE.", "Date": "August 2, 2013"}, {"Title": "Next big Thing", "Author": "dymond 33", "ReviewID": "R20025HRJ14CSW", "Overall": "5.0", "Content": "This is an excellent purchase. it is light and it is very quick. I am learning windows 8 it takes some getting used too. The colors and graphics are excellent. One con the pad is really sensitive, but you have to let the page settle and then move the cursor or the page keeps moving up and down. Great Price for a laptop with keyboard/blue-tooth/great speakers. It works great with Samsung Galaxy Phone.", "Date": "October 20, 2013"}, {"Title": "IT IS THE BEST", "Author": "Hammad", "ReviewID": "R35SQ5HKNDWZ7P", "Overall": "5.0", "Content": "I purchased, this and it was awesome, really fast, good graphics.  I play heavy games on this laptop.  And I use it for college, comparable to the MacBooks, but who wants to pay over one thousand dollars.  To buy one cheaper go to this link :[...]", "Date": "October 1, 2013"}, {"Title": "Love it.", "Author": "Nicola Lawrence", "ReviewID": "R25B98R1JBVDOS", "Overall": "5.0", "Content": "Great buy, no complains as yet. Hope not to have any now or in the near future. Please be the best one buy I've made. Windows 8 is okay to work with.", "Date": "November 19, 2013"}, {"Title": "Very good", "Author": "Emily Smalheiser", "ReviewID": "R26FKQY1AXZG1B", "Overall": "4.0", "Content": "I didn't give it a 5 star review because I can't commit to 5 stars.  But I have had this for about 6 months now and it's been nothing but great for me.  Granted my last computer was a linux that couldn't do much, but this little guy has been a dream.  Once I updated the apps they all worked like a dream.", "Date": "January 26, 2014"}, {"Title": "Good product with great price", "Author": "JMBrado", "ReviewID": "R2A0FNDMMT2ZV5", "Overall": "4.0", "Content": "A light weight laptop with a durable casing.  Has quick start up time.  A surprisingly good laptop for the price.  I am very happy with it after switching from a Dell 15R Inspiron.", "Date": "November 13, 2013"}, {"Title": "Its perfect", "Author": "Sara E. Bernhardt", "ReviewID": "RKTYQ36SS8J8B", "Overall": "5.0", "Content": "So I read all reviews on products and when I bought this laptop it only had one review posted. I'm so glad I purchased this. It's quiet and really fast. It is also very light weight. I just use it for internet, writing papers and making spreed sheets. So it's perfect for my needs.", "Date": "October 28, 2013"}, {"Title": "Love it!", "Author": "MaryJane", "ReviewID": "R2QCAKHSWGQU1R", "Overall": "5.0", "Content": "I absolutely love this laptop. I use it to keep up with my small business. It does exactly what I need. It's quick and easy to use. This is a perfect investment for a student or small business owner or even someone who likes to surf the web.", "Date": "March 10, 2014"}, {"Title": "Great", "Author": "Joshua Engelbrecht", "ReviewID": "R1F9KFG1M145W7", "Overall": "4.0", "Content": "Easy and fast to work with.Light weight and great graphics.Windows 8 runs well and no glitches on system.", "Date": "February 5, 2014"}, {"Title": "It's pretty cool, but not really fast!", "Author": "byrnes102", "ReviewID": "R298GX9MFRV1JF", "Overall": "4.0", "Content": "I guess for what you are paying for it, it is a good buy. I think that the lag on the videos and the slower processor speed will be something I will have to get used to (along with Windows 8!). The picture on the screen is great and the fan is super quiet. The computer itself is overall a good buy if you are looking for something simple and portable. If you are looking for quickness, go with a computer with a decent Intel processor!", "Date": "October 23, 2013"}], "ProductInfo": {"Price": "$549.90", "Features": "AMD E2 Series Dual Core E2-2000 1.75 GHz\n4 GB DDR3 RAM\n500 GB 5400 rpm Hard Drive\n15.6-Inch Screen, AMD Radeon HD 7340 Graphics\nWindows 8 (64-bit)", "Name": "Samsung ATIV Book 2 NP275E5E-K01US 15.6-Inch Laptop (Mineral Ash Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41X4O5rXEuL._SX300_.jpg", "ProductID": "B00CTLFNSM"}}