{"Reviews": [{"Title": "Best gaming laptop at this price point", "Author": "Andrew", "ReviewID": "R34A4ZRCS7F7BC", "Overall": "5.0", "Content": "Pros- Plays any current game you want at ultra settings with great fps. (runs wow 25man on ultra at great FPS because of the ridiculous fast i7-4700)-Look amazing. Backlit keyboard is awesome and the quality of the build of the laptop is outstanding.- Great Screen, awesome sound and very helpful buttons, for instance, can turn super cooling feature on that will keep the laptop very cool.- i7-4700mq and gtx 770m extremely powerful.- Overall amazing, portable and extremley powerful gaming laptop that gives the most bang for your buck.Cons-Slow HD but has to be to keep the price down so they can put the powerful gpu and cpu in. You can always add an ssd or upgrade later if you want-Windows 8 sucks but you'll get used to it (should be their motto)-Lots of updates at first that take a long time to install so be prepared for lots of restarting and updating that takes a long time. Once you get past all the windows updates you are golden though.In conclusion, this is most powerful, beautiful, well built, with the most features for a gaming laptop that you can get at this price point.", "Date": "September 19, 2013"}, {"Title": "Great Gaming Laptop At An Excellent Price", "Author": "Adam", "ReviewID": "R2PXJBBZH5282J", "Overall": "5.0", "Content": "First of all let me preface this review with a note that I've only had the laptop for 3 days now. I'll update this review in about 3-6 months to make sure it's accurate and fair.Edit: Found another con with it, however it doesn't change my overall rating of the laptop: The position of the audio jacks (mic & headphones) are not in a great place on a laptop. I use this on a small table with very limited room for my mouse on the right side. When I plug in my headset the audio cords are in the way of the mouse. Not sure why it was designed this way as it isn't very smart in my opinion. I've remedied this by purchasing two 90 degree 3.5mm adapters to route the cables away and underneath my laptop cooler and out the front underneath. This may or may not affect others but it's important to note.Overview-----------Pros:~ Top notch Nvidia 770M with 3gigs of DDR5 video memory~ Steel Series programmable backlit keyboard~ Killer E2200 \"True\" wireless N card~ Sound Blaster Cinema and Dynaudio Speakers for top notch sound onboard~ Crystal clear display, with no glare and 1080p resolution~ 3 additional display out ports for up to 3 external displays (VGA, HDMI, Mini display, +onboard)~ SD card reader~ DVD Multi driveCons:~ (Edit) The position of the audio jacks (mic & headphones) are not in a great place on a laptop.~ Only 8gigs of RAM~ Slower 5400rpm Hard Drive~ Lists 5 USB ports (3 USB 3.0, and 2 USB 2.0), however there are only 4 USB ports total (3 on the left hand side, and 1 on the right side)Not sure on the speeds of them but my guess is the 3 on the left are USB 3.0 and the one on the right is USB 2.0. I'll have to verify this later.-----------So far I am loving this quality laptop. It has top notch top-of-the-line graphics gpu by Nvidia with 3gigs of DDR5 video memory which for this price point is excellent. The SteelSeries backlit keyboard is an amazing perk and looks awesome in any of the colors. The display is great and has no glare, is crisp, clean and clear at it's native 1920x1080 resolution. The touchpad is built sturdily and I haven't found any issues with the quality of it as some others have posted regarding the touchpad. I do wish that it had a hardware button to disable the touchpad instead of just the function on the keyboard. I personally almost never use the touchpad unless I'm mobile and just want to browse the web quickly. The con with it is that each time you resume/start windows you have to disable the touchpad with a combo key press. Not a terrible thing just a minor inconvenience. It has a nice set of quick touch buttons along the top panel to the left and right of the power button for several features. On the left is a button for the default dvd/media player, then the turbo boost cooling fan, and toggle for the keyboard backlighting. To the right of the power button are: An airplane mode button, External display toggle button, and finally a G-Series System manager button to bring up the System Control management program to have quick access to toggling wifi, bluetooth, touchpad, webcam, display brightness, audio volume, power/eco manager mode switcher, External display toggle and optical drive eject control.Optical Drive: The optical drive external eject button is a tad hard to find just by fingertip and is almost flush with the drive so this can be a slight pain. I also noticed that the optical drive tray seems a tad tight when closing the drive, not that in interfered with the functionality however.Wireless: The wireless card is a Killer E2200, and works top notch. I have not had any disconnects so far at all as some others have reported on other MSI laptops. The Wireless is also a true N card and operates up to the 5gHz band for use on dual band routers.Hard Disk: The hard drive is probably one of the weak points of the system but is an easily upgradable item. It's main weakness is it's speed at 5400rpm which makes it one of the slower hard disks that you can get, however I think it's size somewhat makes up for it's speed. It also should be noted that the hard drive is on a sata 600 connection which is significantly faster than a sata 300 connection which also helps with the slower drive. It comes partitioned to two drives; a 600gig OS Install drive(c:) and a 400gig Data drive (d:). It also has another hdd bay and supports RAID, and SSD's for an upgrade on the hard disks.Memory: The RAM is also the other weak point of this system. It only has 8gigs of installed memory, however it is up-gradable to 32gigs max.Battery life: At this point I can't really rate the battery life as I haven't taken it portable to fully test it(Yet). I'll update when I do some more testing on it.Graphics Processors: The system supports automatic switching between the built in Intel gpu for low end graphics or web browsing (power LED will be white), and the Nvidia GPU for high end games (power LED will be orange). Have not had any issues with the gpu switching whatsoever and another reviewer has reported that updating to windows 8.1 will make the high end graphics useless. This is NOT true as of the date of this review. I have successfully updated to Win 8.1 and have no issues with the Graphics card or drivers at all. I've tested this in several high end games with graphics set to Ultra. The built in Turbo Boost cooling fan is an excellent feature to cool off the gpu's and main cpu's. It is quite loud but it's cooling capacity is awesome. In my testing with just the default cooling system and graphics set to ultra the gpu/cpu's got up to about 70-80 degrees celsius. Once I turned on the boost cooling fan the temps quickly dropped down to 40-50 degrees C.Status LED's: There are 6 orange indicators located at the bottom of the touchpad, just below the button. They sit about 1/4 inch up from the edge of the laptop. The touchpad is slightly recessed in the lower panel so when the lid is closed the display indicators are still visible from the front. There's indicators for the following from left to right: Bluetooth, Wireless, Battery Life(will be off unless running on battery), Sleep Mode, Hard Disk activity.HD webcam: I haven't tested this out yet.Keyboard: Aside from the awesomeness of the programmable backlit keyboard by Steel Series, this keyboard is very sturdy and robust. You know that key is pressed when you press it, the keys are not squishy or wobbly at all as on some other laptops. They have just a slight dip in them that fits your fingers nicely, and the key size is perfect even for someone with larger hands/fingers like myself. The only things I dislike about it so far is the right shift key is a tad shorter than normal and I dislike that the Home and End keys are a function of the Page Up/Down keys.Summary: Overall I'd say(so far) that this laptop is a great quality laptop with top notch graphics and a great price even with the cons of slower hard drive and only 8gigs of memory.", "Date": "December 21, 2013"}, {"Title": "great buy!", "Author": "Alessandro", "ReviewID": "RT9OJVM0L90UJ", "Overall": "4.0", "Content": "This pc has very good components, it works very well with the latest games. I like very much the screen and the possibility to change the colours of the keyboard, which is very comfortable. Touch keys are useful. It's very fast at starting up, about 11 seconds :).The only lack is the weight, specially if you carry it with the power pack.I recommend it!!", "Date": "February 3, 2014"}, {"Title": "Great high performance notebook", "Author": "Hakan Aydin", "ReviewID": "RU1DMB9H5ZFDI", "Overall": "5.0", "Content": "I purchased this notebook in August and I can say that I'm very happy with it so far. I can play graphicswise demanding games with high settings and although the notebook does run hot, the full blast fan option is enough to cool it down but remind you it is very loud. The only problem I've had with the laptop is the horrible quality of the microphone on the notebook. Though I don't really care since I use a headset with a microphone when I'm going to communicate via Skype or some other voice software. You should know that it is a very heavy unit that comes with a very heavy power brick. But if you decided to buy a gaming notebook, I think you should be ok with that. I do recommend this product.", "Date": "October 28, 2013"}, {"Title": "Amazing", "Author": "thaer mustafa \"thaer\"", "ReviewID": "R30MCF5467F2DB", "Overall": "5.0", "Content": "It's an amazing laptop, it doesn't overheat ,the screen is pretty clear, smooth playing , wonderful keyboard , it's simply awsome.", "Date": "September 13, 2013"}, {"Title": "Very good Laptop.", "Author": "Aleksandr L.", "ReviewID": "R2G58GJMZ9DPJO", "Overall": "4.0", "Content": "Very good laptop. Don't have any problems with it. Works Great. But a little bit slow if you consider to use it for Photoshop.", "Date": "April 24, 2014"}, {"Title": "MSI GT60 laptop", "Author": "Jim Higgins", "ReviewID": "RBJ0EMYPYHS0F", "Overall": "5.0", "Content": "So far I Couldn't be happier. the laptop boots up quickly and beside getting rid of the norton anti virus and getting AVG everythingworks great. I have been playing starcraft II, the laptop gets a little hot but if I just turn on the boost to the fan it cools right down.", "Date": "December 27, 2013"}, {"Title": "Outstanding", "Author": "Nikolai Nolan Lewis", "ReviewID": "R35ECZVPBL3WU9", "Overall": "5.0", "Content": "Positively floating on cloud 9 here. Love the build and the features for the price. One draw back is Windows 8; still getting used to it, but that doesn't stop the party. I'm over the moon here in mobile gaming bliss.", "Date": "December 22, 2013"}, {"Title": "good price", "Author": "warner lee hall", "ReviewID": "R2W40G5OKG10U", "Overall": "4.0", "Content": "this laptop is about the best your going to get for this price. the only bad thing like the others have said is the hdd is a 5400 rpm.", "Date": "October 3, 2013"}, {"Title": "Great system! But many technical issues.", "Author": "ZetiX", "ReviewID": "RKM8G0GCGE2XG", "Overall": "3.0", "Content": "Really nice system but windows 8 killed it, also poorly manufactured. Here are the pros and cons.Pros:-Runs many of my games smoothly. (Neverwinter,League of Legends, Minecraft (Shaders+High res Texturepack) andSplintercell:Blacklist Deluxe(got this for free because of the promotion.))-Really cool backlit keyboard.-Useful and easy to access touch controls near the power button.-Useful indication light on the power button. (White = integrated  Orange = dedicated graphics card)-Amazing sound system.Cons:-Windows 8. (too many buggy features, one where the shutdown takes FOREVER because windows is configuring the update, but would happen randomly on shutdowns all the time. Solution: run cmd as admin and type \"sfc /scannow\")-Updating driver issues. (I spent a good 6+ hours trying to get my wifi to work after updating to the latest driver. The first problem was the wifi randomly disconnecting (and yes it is the system's fault because my other devices connected to the same network still works. I reinstalled the drivers again using the drivers/utility disk that came with it, and after a restart, wifi driver becomes unrecognized by windows. Solution: install the latest drver, then uninstall the wifi drver, and scan for hardware changes and then update the driver by browsing to a wifi driver only patch found at MSI forums.)-CD Drive is EXTREMELY Loud.-Only 3 of the 4 sound jacks are gold plated. Unless one fell out during shipping/manufacturing.-5400RPM Hard drive, but its to keep price low on this machine.-The laptop was poorly manufactured, the hinged to the back of the laptop isn't completely in, one of the edges was sticking out and i had to push it back in.", "Date": "October 25, 2013"}, {"Title": "College Computer", "Author": "DONNA", "ReviewID": "R1ASG3X0TZ5PRF", "Overall": "5.0", "Content": "Has worked perfectly from the get go; allows me to do all my engineering classwork and gaming.  Fast start up.  Love it!", "Date": "October 19, 2013"}, {"Title": "Everything as listed", "Author": "Tom Sullivan", "ReviewID": "RWWFJBWX28AR3", "Overall": "5.0", "Content": "Everything about it is great. But extremely nit picky stuff as follows - The turbo fan feature is great especially to blow out all that trapped heat exhaust generated by the graphics card and other parts, but it is as loud as my desktop computer so using it in public places is somewhat embarrassing. Also the picture of the laptop shows a rainbow lit keyboard. Im not sure if the keyboard is actually capable of displaying that way or if it is just to show those are the color options but it does light up (i forgot what color, not on it now) and can be turned on and off so im happy. Love the grip buttons on the bottom, very well built laptop. As soon as i got it switched to windows 7. The built in mouse pad is very nice but it is slightly inconvenient because the whole button favors clicks on the side its on (ie, left clicks work better when you press down further to the left). The keyboard is a pleasure to type on, sound and key pressing. No problems so far, it has yet to be a month. I have ran a few intensive softwares and have not experienced any problems. I would recommend the laptop :)", "Date": "September 2, 2013"}, {"Title": "Awesome laptop", "Author": "J.K.", "ReviewID": "R1NZK9OCH4F2P0", "Overall": "5.0", "Content": "This thing is super fast, the 4th gen intel quad-core and GTX 770m makes a powerful gaming laptop.  The speakers are the best I've heard from a laptop.  The keyboard is really solid and feels good.  The screen looks great.  Solid aluminum body feels very durable.  Good cooling fan.  Haven't had any issues with it.  I'd recommend it to anyone wanting a powerful laptop with lots of extra features.", "Date": "August 3, 2013"}, {"Title": "IF  PEOPLE ONLY KNEW", "Author": "DJ", "ReviewID": "R1XWCG5H7NJMH0", "Overall": "5.0", "Content": "THE KEYBOARD NOT ONLY LIGHTS UP, IT DOSE IT IN MANY DIFFERENT COLOR PATTERNS,AND IF THATS NOT ENOUGH, YOU CAN HAVE IT GO TO THE BEAT OF THE MUSIC.THE KEYBOARD HAS A GREAT FEEL SIMILAR TO A MAC BUT BETTER.THE SOUND SYSTEM IS NUMARK.I WAS NEVER CRAZY ABOUT NUMARK,ALWAYS FELT THEY 'LACKED' WHEN IT CAME TO DJ EQUIPMENT BUT OVER THE LAST COUPLE OF YEARS THEY CAME A LONG WAY.THE BASS IN THIS MACHINE MAKES IT A TRUE 'BADBOY'.WINDOWS 8 TAKES A LITTLE TIME GETTING USE TO BUT THATS WHAT YOUTUBE IS THERE FOR.WINDOWS 8 XBOX MUSIC IS SCARY BAD UNPINNED IT FROM THE START AND ADDED FOOBAR PLAYER I AM GOOD TO GO .LETS NOT FORGET ABOUT THE I7 CORE.THIS MACHINE IS SO ON I DONT EVEN WANT TO TAKE IT ON JOBS......", "Date": "January 3, 2014"}, {"Title": "had a rocky start out of the box. it kept freezing and crashing.", "Author": "andy", "ReviewID": "R276Z1QDZ1KL0", "Overall": "4.0", "Content": "ok... i like this laptop... or maybe i should just say i like having a i7 paired with a gtx 770m. i wasn't so sure about this laptop at first, my first choice was the clevo151sm, but black Friday/cyber Monday offered me a better deal with this MSI GT60. the only thing was it came to me defective. there was something apparently wrong with the drivers, it would freeze and crash after start up and sometime the keys and mouse wouldn't work. after i reseted it back to factory settings(the inital out of the box windows 8 boot up froze and i think it corrupted my first few start ups) and re-installed the drivers (many drivers weren't working and were the cause of many crashed) the laptop seems to be working how it should now.", "Date": "December 10, 2013"}, {"Title": "APL(A Perfact Laptop)!", "Author": "Lucas Luo", "ReviewID": "R1RB8W2KO8B9VX", "Overall": "5.0", "Content": "one of my friend told me laptop of msi is very good, and I play Crysis 2 for Windows and it is very good! this is one of the best gaming laptop, 90% game can work on this computer!", "Date": "October 6, 2013"}, {"Title": "Great notebook, as i expected and what i needed but.....", "Author": "Jodi Arias", "ReviewID": "R3BSMZS4WQ5QPI", "Overall": "3.0", "Content": "all features like the fan and everything work like a charm. although it's a great notebook, i had to deal with the irql_not_less_or_equal crash several times. The crash is caused by the Killer network card and driver, and causes the laptop to crash a few times. this isn't a serious crash (just a restart and an error report) and you can get back to what you're doing in a minute. The crash hasn't been happening lately so i am a bit happier but they should read up on the problems and fix it. otherwise, the computer is absolutely great and definitely worth it. Please note that you CAN NOT play dark games, like slender. the blacks are absolutely horrible, even if they're on. the first time i booted the game i thought the contrast and brightness was messed up but i was wrong. i turned contrast and brightness in game and on the actual screen and could not make out anything in the game. it was absolutely unplayable. i play  a lot of other games like bf3 and diablo so it's not too bad and i've already beaten both slenders. the fan feature was more useful than i expected and gets rid of the heat in about 30 seconds.", "Date": "September 3, 2013"}, {"Title": "A great machine", "Author": "amazonbuyer22", "ReviewID": "R3JUAR3WB54CJ0", "Overall": "5.0", "Content": "I ordered this for the purposes of working with HD slow motion video for editing. Great machine, it handles the video well and the dual hard drives that came with it are awesome for storage. Anyone looking for a powerhouse machine that runs fast with no issues look no further! The only thing is it's extremely bulky, other than that I love everything about it.", "Date": "September 14, 2013"}, {"Title": "Everything's perfect but the weight.", "Author": "Shuwei Li", "ReviewID": "R18VTFIO01NUQS", "Overall": "4.0", "Content": "Overall this is a great product, everything''s amazing, it's fast, it's quick, it runs like a Lamborghini. But the problem is it's WAY too heavy. The laptop itself is like a 7-pound monster, and the charger also weights about 3 pounds. So unless you are a super indorrsy  gaming guy, don't buy this; cause it's just TOO heavy.", "Date": "August 20, 2013"}, {"Title": "Pretty Great Laptop with a lousy warranty", "Author": "D. Joseph \"DugALug\"", "ReviewID": "R3KMS4XMMXIPHV", "Overall": "3.0", "Content": "I have the previous version of this laptop and it is pretty great, except that when the keyboard started acting up (My [Esc] key was saying it was pressed intermittently). I contacted MSI who told me to send the laptop back to them and they would fix in it 15-25 days. If this is your sole computer (As is my case), this warranty is completely worthless. If not having your computer for nearly a month is okay, then this is a really good deal.Because of this I can't recommend any MSI laptop and their response ticked me off enough to come here and write this review.", "Date": "November 14, 2013"}, {"Title": "Much more quiet than expected", "Author": "W", "ReviewID": "R7MCWRVITDULG", "Overall": "5.0", "Content": "It is much more quiet than expected, of course in the condition of closing Cooler Boost.The GPU is not very fast for computation. Roughly 6~7 times slower than GTX 780, desktop edition.", "Date": "October 13, 2013"}, {"Title": "MOUSE TOUCHPAD/KEYBOARD DID NOT WORK OUT OF THE BOX!!!!", "Author": "Sophie M.", "ReviewID": "RA4K7JY5PVO6U", "Overall": "1.0", "Content": "Not cool MSI NOT COOL!!!! I was so excited to get a new gaming computer and overnighted this computer for a World of Warcraft raid. I needed a new gaming computer because of lagging on my old computer, which I am using as we speak(AND THE MOUSE TOUCHPAD WORKS ON THE OLD COMPUTER!!!) OMG I could not do the raid or even download the game, because the mouse touchpad and keyboard did not work out of the box!! Since the mouse touchpad and keyboard did not work, I could not surf the web to download the game or add my new virus protection. The keyboard kept locking up, so much that it was impossible to even tab to register my information on the computer. The technical support for MSI USA was NO support at all,and just tried to blame it on packaging or a hardware issue. There was no damage to the laptop package when I got it, and Amazon.com did a good job with delivery of the computer. I am very disappointed that a $1400.00 dollar computer came with such defects!!! >:< I will never again buy any computers from this company again!!! I had to return the computer and get my money back.", "Date": "August 1, 2013"}, {"Title": "SOUND DID NOT WORK OUT OF THE BOX!!! REALLY!?!?", "Author": "Spartan05 \"Spartan\"", "ReviewID": "RQ0MEOLX2YDC9", "Overall": "1.0", "Content": "Okay folks, after researching which gaming computers are good to buy on a budget, I choose this one. The computer came in a nice box that had no damage at all. After the first use of the computer, I had a issue with the sound. I noticed the sound was jacked up while playing my World of Warcraft game. I needed to use Ventrillo, in order to discuss some game mechanics to my fellow players during a raid. WOW, each time I listen to them speak to me, I heard this awful static sound. It was like I was turning the nob on a ancient radio looking for a channel to listen to. I complained to the guys in my raid that I was having a hard time listening to them, and quickly finished my raid. So, the next day I called technical support about the sound problem on the computer. Boy did I get no where after two hours of reformatting the computer and downloading and uploading the Realtek software driver, which controls the sound. I still heard the static noise even when following the tech guys instructions. One technical support guy at MSI USA just had no clue and just told me it was a hardware issue and instructed me to return it to Amazon.com. On the other hand, another technical support guy told me to keep trying to download the Realtek driver software to fix the static noise. I was getting really annoyed with the technical support because of the impatient attitude of one of the tech guys, while helping me fix the problem. After getting no where with technical support, I actually did what one of then told me not to do. I actually delete the RealTek driver from the computer and WHAM BAM THANK YOU MA'AM, the sound issue was fixed. The Microsoft sound software kicked in and the sound was perfect. I can't believe that I was sent a brand new computer, which was not that cheap 1400.00 bucks!, and the sound was screwed up out of the box. That was really bad, I don't think I will deal with this company again. Take my advice and stay away.", "Date": "August 13, 2013"}, {"Title": "Do not buy MSI", "Author": "jrooney", "ReviewID": "R3FRYNWP0TAUR1", "Overall": "1.0", "Content": "The products are quality with some great thought into the design & parts. I would say overall the performance is 4 outta 5 stars.MSI does not offer replacement keyboards on their \"Steelseries\" version laptops nor does Steelseries. You have to send it in for \"service\" which has a 2 week turnaround. I will not pay to have someone else to do such a simple task that I have done hundreds of times. Replacing a keyboard is simple. Nor will I send in my laptop for 2 weeks. That's ridiculous.There are no aftermarket replacement keyboards either. Do not buy. I have officially boycotted all MSI products because of this. I have burned 5+hours with support from both MSI and Steelseries on this problem.Buy from a manufacturer who offers replacement parts. Hardware goes bad, you want to be able to replace it.This is why they get 1 star.", "Date": "August 19, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Core i7-4700MQ Processor (3.2 - 3.4 GHz, 6M Cache)\n8 GB DDR3 RAM\n1 TB 5400 rpm Hard Drive\n15.6-Inch Screen\nWindows 8", "Name": "MSI G Series GT60 2OC-022US 15.6-Inch Laptop (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41chJVTNlCL._SX300_.jpg", "ProductID": "B00CU9GKZ8"}}