{"Reviews": [{"Title": "Strange, in a good way.", "Author": "mnstar", "ReviewID": "R38EG0ZG4O88FZ", "Overall": "4.0", "Content": "I dislike it when people write a review about something they have only owned for 24 hours. Yet, here I go as the opportunity to be first can't be resisted.First, I happen to think a 14\" notebook is the perfect size for my purposes. I will resist the urge (mostly) to comment on Windows 8 since this is my first time with that OS. Suffice it to say the learning curve was steeper than previous Windows versions, but not terribly bad. The world has gone nuts over apps, it appears.First impression: Cheap! I am a huge Samsung fan, and I was expecting something....different. When closed, this laptop has a classy look and feel to it. Opened, it looks and feels....cheap. It is light enough to pick up with one hand, and if I lift it by the corner the keyboard actually flexes.The screen portion will flex too. The keyboard half looks and feels cheap. It appears the entire unit is plastic. Maybe that is the new trend; I am coming from a Sony Vaio which was metal and very rigid.However, I'm not a plastic hater and once I got past the initial shock I really love the laptop. Not surprisingly, the display is amazingly sharp and clear. I like the keyboard layout and feels very similar to my Vaio.I'm not an aficionado of touch pads, I would rather use a wireless mouse, even if I have to set it on one knee while balancing the computer on the other. However, I did give it a thorough test drive and I was very impressed. I'm sure those who primarily use touchpads will be very happy. Processing is very fast, but then aren't they all when new? We'll see in six months, and I will report back. Battery life is spec'd at 4.8 hours and on my first try that turned out to be realistic. Much better than my Sony Vaio.In summary, I have been using computers now for 30 years. My first was an IBM Jr. that only ran on DOS and didn't even have a hard drive, but a 5kb memory. We have gone from that to this, and I have enjoyed every improvement step along the way. :) I have high hopes that I will be enjoying this Samsung notebook for a long time.", "Date": "September 14, 2013"}, {"Title": "Not what I was hoping for.", "Author": "Kathryne - Professional Law Student & Clo...", "ReviewID": "R2MVGZPMJEUYQH", "Overall": "3.0", "Content": "I bought this laptop for a few reasons: it's some of the best processing power available for the price, it's a Samsung, and, as a student, I wanted a 14\" laptop that doesn't weigh 100 lbs, so I can drag it to class.Firstly, I cannot speak to the processing power because I didn't use it for very long before deciding to send it back.  Windows 8 is a mess and is clearly meant to be used with a touch-screen.  The ATIV Book 2 is not that and it leaves you with a feeling like, \"Then, why does this thing run 8?\"  From the moment you turn it on, the fan kicks on and it's not what I would call loud, but it is noticeable.Secondly, by buying a Samsung, I was hoping for something I knew would be reliable and quality.  This honestly feels like it's made of cheap plastic.  It isn't a $1200 laptop, but $550 isn't terribly cheap and I expected something much nicer for the money.  I didn't like the display quality, the touch pad, or the feel of it.  I'd rather spend a few extra dollars and know that something is going to last a little bit longer.Lastly, the reason you'd buy a 14\" laptop is portability, but, it's laid out in a ridiculous way.  The keyboard isn't placed effectively.  It has a \"centered\" feeling on the bottom part of the laptop with lots of wasted space on either side of the keyboard.  For being one of the smaller, full-powered laptops out there, it felt massive.It seemed nice as far as processing is concerned with the brief browsing and web surfing that I did while I had it, but if you buy it, make sure you buy it running Windows 7.  Windows 8 just isn't meant for this machine.", "Date": "October 20, 2013"}, {"Title": "Laptop Computer", "Author": "Mo-Be", "ReviewID": "R26PGP6ZOHC7EA", "Overall": "5.0", "Content": "My 17 year old daughter loves this laptop!  Very modern, speedy and efficient! Great for everyday use..Will not choose another over this one....", "Date": "February 27, 2014"}, {"Title": "Good laptop. Doesn't give 4 hours as promised.", "Author": "Faisal Yaqoob", "ReviewID": "RTY0WP4TJD9VK", "Overall": "4.0", "Content": "Good notebook. But doesn't give promised battery time of 4 hours. Usually gives about 2.5 - 3 hours per charge.", "Date": "February 24, 2014"}, {"Title": "Product review", "Author": "K. KANO \"gertrude\"", "ReviewID": "ROJ0NVTTR3JUR", "Overall": "4.0", "Content": "It's my samsung laptop product and so far, I like it. I would recommend it to fellow professionals. It's price is just right", "Date": "January 7, 2014"}, {"Title": "Great laptop...", "Author": "Susie-Q", "ReviewID": "R3JMW9FXGMH1R", "Overall": "5.0", "Content": "I would definitely recommend this computer.  The future is very bright with windows tiles - great concept. It takes some getting use to, however, it you are adventerousome this computer is for you.  Definitely, I am not really computer savy but this computer has it all, speed, looks, and great versitility.  I am going to have to order another one for myself,  the grandkids loved it so much,  and naturally being a grandperson,  I gave it to them for their school projects.  Samsung never disappoints.", "Date": "December 25, 2013"}, {"Title": "Great laptop", "Author": "sgaigle", "ReviewID": "R2ZCKT73UQ5EKV", "Overall": "5.0", "Content": "It probably should have included USB 3.0 and it will have been better,nice color and very light weight for traveling purposes", "Date": "October 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CMXDG54"}}