{"Reviews": [{"Title": "Very Light and Very Nice", "Author": "Gadget Man \"Gadget Man\"", "ReviewID": "R1IG2F2TT4XM8Y", "Overall": "5.0", "Content": "I recently got this Sony Vaio ultrabook and thought in reviewing it I would compare some of is attributes to my Lenovo Yoga 13 since a lot of people will be weighing the plusses and minuses of these two notebooks when making their purchasing decision.First, I found the Sony computer a joy to use, very responsive and easy to carry.The Sony weighs 37.7 oz, while the Lenovo weighs in at 53.6 oz.Although both computers have 13 inch screens (13.3 inches for the Sony), the footprint of the Sony notebook is actually smaller.  It is about 1/2 inches smaller in width and length.  (Keep in mind that I'm talking about the actual external dimensions of the notebook...not the screen size.).My Sony has 128 GB Solid State Drive, while my Lenovo has 256 GB SSD.  You can get the Sony with 256 GB as well if you choose.  If you get the 128 GB keep in mind that you'll have 71.8 GB left over on the C drive when you get the computer.  After you load Microsoft Office and do all the updates, you'll have about 66.9 GB free on C drive.  But you have 2 USB 3.0 slots and an SD slot on the right side of the computer if you need additional hard disk space for photographs, videos and music.I prefer the keyboard on the Lenovo, as I find the Sony has less feel, and is a bit slippery.  But the Sony has a nice lighting if you are going to use it in a poorly lit area.  Lenovo does not have a lit up keyboard.The Windows Experience score on the Sony is 6.2, while the Lenovo is 4.8.  But in real life, I didn't find any appreciable speed difference when using the computers.  Both are able to reboot Windows 8 in about 20-24 seconds. The Sony had a  4 second edge in this regard.Both screens have very nice color rendition and text depiction.  The Sony screen is much more limited in how you view it.  It tilts about 5 degrees back from straight up. That should work for most people, but I found it a bit limiting.  My preference is if it could tilt a bit further back for more comfortable viewing.  The Lenovo Yoga will flip over completely and operate as a tablet, or tilt in a manner where the screen is propped up and the keyboard faces down, or just simply tilt back to any viewing angle you wish.  In this regard, the Lenovo is much more versatile...which is where it gets its \"Yoga\" name.The touchscreen on both computers worked very well.  But keep in mind that some people, including me have reported issues with the Lenovo touchscreen.  I had two separate Lenovo Yogas. In one the touchscreen worked perfectly (I kept that one).  The second had an erratic, sometimes nonfunctioning touch screen that made the computer unusable.  Others have reported similar issues with the Lenovo Yoga.The trackball is nicer on the Lenovo.  It glides much more smoothly than the Sony, and has a better/larger area to click or right click the pad. The Sony trackpad functions decently enough.  But it feels rougher.I removed the Kaspersky internet security that comes with the Sony, because the updates are incredibly slow...watching a snail crawl across a football field would be faster.  This is not a Sony issue, so don't let it detract you from the Sony at all.  I noticed this issue with Kaspersky software I bought two years ago, and was hoping they remedied the problem.  They haven't.  Instead I use Windows Defender that comes with the computer.A couple of issues with the Sony.  The screen sometimes flickers or dims momentarily when you put your hand toward the screen in the center of the computer, or when you touch a link or menu choice.  Not sure why this happens.  You can certainly live with this, as it is quite momentary.  But it is annoying.Second issue is that some people have reported they find the fan to be noisy.  Normally I don't hear it at all.  But once in a while it sounds like the background sound of waves crashing at the beach. Not bad...not an issue for me.  Maybe an issue for others.I intend to make this a rolling review, adding more feedback the more I use the computer in the next few months.========================================Update on December 13, 2013I've been using this laptop a few months now and I must say the more I use it the more I like it.  When I took a recent trip to Hawaii, I decided to take the Sony, and left the Lenovo at home.  The reason is the Sony is lighter and smaller and that made a difference --- even though they are both 13 inch screens. The Sony upgraded to Windows 8.1 very smoothly.  On my Lenovo Yoga, the upgrade to Windows 8.1 was not as smooth as the Store App opens by itself form time to time.  The Sony has no such problems. I might increase the Sony to 4.5 STARS if they had such a rating.=========================================December 28, 2013 Update: I've gotten to the point where I don't use my Lenovo anymore, because I prefer this Sony laptop.  I also recently bought a Microsoft Surface 2.  After trying it for about a week, I returned it because it couldn't do anything that my Sony couldn't do far better.  The Sony doesn't weigh much more than the Surface 2 or the Surface Pro 2.  But it works much better and has a much better keyboard -- you would expect that of course considering the price difference.  But considering the weight difference is so small, the Sony basically negates the need to get anything like the Surface models as a portable computing device. I have now raised the rating of the Sony Ultrabook to 5 STARS - after all, it works great, has a backlit keyboard, replaced the need for my Lenovo Yoga and nixed the Microsoft Surface.  Highly Highly recommended.", "Date": "August 25, 2013"}, {"Title": "Balancing act", "Author": "Nicole Del Sesto", "ReviewID": "R19CZEUZQPW42", "Overall": "3.0", "Content": "There are a LOT of things to love about this laptop.  The most immediate and obvious thing is the weight! This laptop is SO LIGHT.Pros:Super lightGreat keyboardAwesome trackpadNice monitor3 USB's 2 in device, and one in AC adapter for charging of devicesTouchscreen is the only way to go with Windows 8Cons:PRICEHeats up quickly, fan runs oftenHard driveEven though there are more pros than cons, the cons are more important.  This laptop is 105GB, it comes with 65GB available.  So either this can't be your primary laptop or you need to add an external hard drive which adds both cost and weight.The heating issue is really annoying.  I've checked the settings, and called Sony to confirm all is as it should be.  If you are watching a TV program or playing a game, after about 10 minutes the computer starts to heat up and the fan kicks in, and runs until you are done with that activity.  And if it's literally on your lap, it's hot.For the money, I just can't see choosing this as your only laptop.  It's great for travel and light usage, but I don't believe much beyond that.Edited to add:  I don't use this laptop every day, and for some reason, every time I go to use it I have problems with the wireless, and I have to run the troubleshooter.  It works fine once that's done, but it's a step I wish I didn't have to take every time.", "Date": "August 28, 2013"}, {"Title": "Worthy of \"Pro\" billing, despite Windows 8", "Author": "Personal Robot", "ReviewID": "R2XK4JAE8KTLP6", "Overall": "4.0", "Content": "I am a Mac user, let's get that out right up front. I switched to Macs over four years ago, but Windows is an ever-present specter even for hard-core Mac users, I'd guess. I'm not above using a Windows machine as long as it's top-notch, and thankfully, this Sony Vaio lives up to its \"Pro\" billing. It might not be quite as impressive to behold as a Macbook Air, but it's pretty nice indeed.First impressions are everything and my first impression was of how light it was, hefting it out of the box with one hand so quickly that I almost felt like I was going to throw it. It was so light that I was certain the battery couldn't have been installed... but it was. It's that light. I won't say that it makes my four year old 13\" Macbook Pro feel like it needs to go on a diet, but it's about half the weight. Considering the Vaio is largely made of carbon fiber, it makes sense. The outer shell is a very thin brushed aluminum that adds a big touch of class. Again, this isn't quite up to the standards of the Macbook line - there are hints of plastic all over, and an alarming tendency to flex when picked up in certain ways (this, I read on tech sites, is due to the \"give\" in carbon fiber, not an inherent flaw.) For someone used to the rock-solid bodies of Apple devices, it doesn't instill much confidence, and reminds me of lower-quality laptops that creak and groan as you move them. The Vaio may flex a bit, but it's completely free of any bad tendencies to this effect, and I pray it stays this way. It's such a nice machine that I've already grown attached to it.The Vaio Pro is fast. FAST. So fast I had to shut it down and restart it to show my wife how impressively fast it was able to cycle itself. In barely the time of a commercial it was able to shut down and restart back to the log in screen. Extremely impressive. Thank the 128gb SSD on board for this incredible performance. The only downside to this drive that I could see is that Windows 8 and various apps that came installed from Sony already ate into nearly half the available space. You'll want to have external drives or cloud space handy for files; this computer is meant only to handle small files or to be a place to work on larger materials that later get moved somewhere else.It has a fantastic keyboard - quick and light, requiring little action to operate but won't result in false keypresses, either. The keys are slightly springier and lighter than the Mac keyboard, making for very fast typing. They're also backlit - when plugged in, they'll stay lit, when unplugged, they'll be lit when lighting conditions call for it. One nitpick that I've seen others making and I'll make it too: having to use the function key to change various function-row keys is annoying.Once I'd downloaded and installed what felt like a barrage of updates from Sony and Microsoft during the first couple of days, I was truly able to check out the Vaio's battery. And it's as impressive as everything else. In a completely informal test (because I didn't know if I'd get even more updates and need to plug in for power) I can safely say that it easily ran for 6-7 hours without a charge, and perhaps longer.The touchscreen is very responsive, no different than using my iPhone or iPad. We'll get to more about this in a moment.A couple of downsides: the bottom of this laptop gets hot, really hot. The Vaio's design angles the lid so that it lifts the bottom off surface to circulate some air, but when it's resting on your legs, you'll feel that heat very quickly. Then the fan kicks in and it's not something you won't notice. Imagine the sound of someone using a blow dryer in the back of the house. It's not obnoxious, but it's noticeable.I'm not a big fan of the trackpad so far. I love my Macbook's slick glass trackpad. It's extremely responsive. I know when I gesture on it, it will do what I expect. Not so with the Sony trackpad, which frequently ignores motions made on it. Windows 8 has a number of specific gestures and I often have to repeat them to cause the computer to react. Most infuriating so far is unreliable scrolling. The two-finger motion sometimes refuses to work. And then, inexplicably, it works... for a time. And then it doesn't. And then it does, but maybe it selects half of what you just two-finger scrolled over. It can be maddening. I don't know if this is a driver problem, or what, but it needs to be fixed.I can't talk about this laptop without discussing the elephant in the room: Windows 8. I am completely new to this all-new OS. So new, in fact, that I've basically ignored all news about it and only knew the basics about the strange, two-faced nature it had. It seemed like this might be an interesting venture - I like challenges. I jumped in head first here, let me tell you.For starters, there's very little in the way of help provided to new users. I know my way around Windows XP and, to an extent, 7. Dropping into Windows 8, however, was like being dropped into a Bizarro World version of Windows. I was prepared and yet really didn't appreciate what might be coming. And Sony/Microsoft really don't prepare users - there's very little help to get you going. Sure, there are a couple little pointers and a small \"Getting Started\" guide for the laptop itself, but nothing about preparing for life with Windows 8. I'm really rather stunned. My first evening with the Vaio was mostly a night spent searching how to do pretty simple stuff. Where's the control panel? I searched Explorer and found it. Little did I realize that Sony doesn't bother to tell you that it's purposely hidden, and they've provided their own Vaio-approved portal into the control panel with their own customized settings. You're just left to stumble onto these things. This is a tactic Apple has used well, the joy of discovering, but it's not a joy here because I don't find as much making the sense that things make on Apple's OSs.Windows 8 feels as if you are \"strongly encouraged\" to use the touchscreen rather than a mouse. I find myself reaching for the screen and doing what I normally would with a mouth simply because it works better. Some buttons are too small to touch so I have to go back to the touchpad, but the machine feels more responsive and sensible when used mostly touchscreen. I wish the screen tilted further back for this, as it doesn't lean very far and sometimes makes this usage feel a little awkward.That said, I'm not discounting Windows 8 entirely. I think they're onto something that could be really solid once the kinks are worked out. Windows 8.1 is coming soon, so I'm hopeful that this takes care of some of these issues.", "Date": "August 26, 2013"}, {"Title": "A step up from my late Ultrabook.", "Author": "Huang, Chang-wei \"raptornomad\"", "ReviewID": "R3BLPINEOJ71NK", "Overall": "5.0", "Content": "Received the product a week ago, and it's still going strong. I previously had a Samsung series 9, and it had served me extremely well for the past year until it passed away due to some unknown reasons. With windows 8.1 coming out, I figured out rather than troubling me myself to try to repair my laptop, I might as well buy a touch screen, Haswell laptop. Boy, did it not disappoint. Even without the fixes from Windows 8.1, with the touch screen I have become ever more productive in this laptop. Sure, ignoring the touch screen is an option, but with the touch screen I can multitask so fast that I stopped doing productive work from my more powerful desktop. I'm not saying this product isn't powerful at all for multitasking and productive work since it packs a beefy i7-4500U and 8 GB of RAM. One interesting thing is that the RAM's clock is shown as 20,307 Mhz (just a peculiar discovery). After installing all the updates form Sony Vaio care (which I don't recommend to uninstall), all the old problems such as sketchy wifi and fans blaring are gone. Wireless is extremely stable, wide in range and fast and the fan only spins up when streaming 4K and 1080P videos. Sure, I wish the fan noise can be more subtle, but it is nothing one should be worried about in the classroom or library since it never even grunts a noise when I'm there. I do not game on this laptop but I figure y'all can find adequate reviews online. The screen is also an absolute joy to watch videos on, no matter streaming or through a DVD. The color gamut is about 22 percent larger than my series 9 and the blacks are way darker too. The keyboard is way better than my series 9 in terms of the feel though the touchpad is somehow lacking due to the fact that it isn't glass. Overall I am extremely happy with my purchase.Btw, silver, though not as professional looking as black, gives it a premium feel with the keyboard backlight on.", "Date": "September 19, 2013"}, {"Title": "SONY shipping this laptop with known issues", "Author": "LP", "ReviewID": "R1ADX71AMSJ6PE", "Overall": "1.0", "Content": "This laptop has the goods to be one of the best out there but unfortunately a HUGE known issue is with the intel wireless card. Simply does not work properly and there is no fix at this time.Do not purchase this laptop without doing your research.", "Date": "November 7, 2013"}, {"Title": "Sony Viao purchase a big mistake - I hit major wifi issues KNOWN to Sony", "Author": "Explorer", "ReviewID": "RXRLYBDJIVNCZ", "Overall": "1.0", "Content": "After months of trying to get connected, including downloading and installing patches from Sony, Sony admitted that there is a known issue with Windows 8 and some kinds of routers, but will not issue a refund. I have asked Amazon to help, and will report back.Very nice machine to use in every other respect, gorgeous to look at, and weighs almost nothing, but since the wifi doesn't work on mine (as on many of them apparently), it is a dud. After I had bought it, I found that this issue being complained about in many communities, and yet Sony are still selling it.", "Date": "January 1, 2014"}, {"Title": "Does not run smoothly", "Author": "J. Allison", "ReviewID": "R15UY0QXGWHCX2", "Overall": "1.0", "Content": "Originally I wrote a great review for this laptop (the original review is located at the bottom of this one), but after owning it for 2.5 months my opinion has drastically changed.  Windows 8.1 does not work smoothly on this device. Before updating, check the Sony site, as there are specific drivers you have to download before you install the update.  Otherwise you will encounter many problems with the OS.  Also there is a problem with the touchpad.  After installing Windows 8.1, the mouse icon disappears from the screen on occasion.  The Sony tech said that the factory installed anti-virus software is the cause of the issue.  So those are the general issues that I believe plague this product.I have a ton of other issues that I believe are specific to my purchase.  Overall, I think my computer is severely defective.  It is currently at the Sony repair center for the second time since I purchased it.  I've spent hours on the phone with Sony tech support trying to get my computer to run smoothly and am beginning to think that I wasted a lot of money on this purchase.  In addition to the issues mentioned above, I've had problems with random lines/colors showing up on my display, the computer crashing unexpectedly, problems coming out of hibernation.  The list goes on...I really hope the problems I've experienced are due to an isolated incident of a defective product and is not a general problem that other have experienced.Original Review:This is not a comprehensive review, as I'm not a tech expert.  There are other reviews that cover the technical pros and cons of this computer very well.  I just wanted to add a few things...1) I've had this computer for about 3 weeks and I think the software updates have resolved the often reported wireless internet connectivity issues, as I haven't had many problems with it.2) This computer scratches very easily.  I received it in the mail one day prior to receiving my protective sleeve.  It got multiple scratches on it the first day from being placed in my tote bag with my school books.  I'm currently shopping for a skin to cover up the ugly scratches.3) Lastly... I'm amazed at how light it is and how fast it starts up!", "Date": "October 20, 2013"}, {"Title": "Vaio Pro vs Aspire S7 a comparative review.", "Author": "Eliezer Kolatch \"Ez\"", "ReviewID": "R1YURIW1EJE8PR", "Overall": "3.0", "Content": "Comparative review: Haswell Acer Aspire S7, vs. Sony Vaio Pro 13Tech specs:Aspire S7: Core i7, 256gb solid state, 8gb ram, purchased clean (no bloatware) from Microsoft store for 1200 all in.Vaio Pro 13: Core i7, 128gb solid state, 8gb ram, received fee from Amazon vine (1500 on Amazon)I had the S7 for 30 days, I kept the Vaio because free was a better price.I have split this review based on various features so that you can directly compare, I will have some additional info at the end to wrap up.Design: In my opinion the S7 is the clear winner hereThe S7 (4/5)Pros:1) Round edges make it comfortable to put on your lap2) Cover tilts all the way back so that you can show it to somebody across from you, or more importantly adjust it to any viewing angle (and it also means you can hold it open for presentations.3) Not a lot of body flex which means you can click on the trackpad regardless of the surface you are using.4) Just looks nice.5) Stiff hinge allows  you to open it one handed and holds it in place really well (less typing shake)Cons:1) SD cards stick out of the slot a fair amount so you can't just leave them in there indefinitely. (mitigated by the larger HD space)Vaio (2/5)Pros:1) SD card fully inserts so it can be used as permanent file storage for music etc.2) Sturdy: I dropped it (not on purpose) and all it did was dent the corner slightly.3) USB charger on the power cord is a nice touch.4) Looks decentCons:1) Sharp edges dig into your lap (really hurt)2) Cover has limited movement, in fact I couldn't tilt it back far enough to type on my lap with an ideal viewing angle.3) Slight tilt to the screen and keyboard mean that there is a gap when you close it.4) Carbon fiber flexes a lot so sometimes you cannot use the mousepad because the keyboard has flexed.5) Cannot be opened one handed.Keyboard:S7 (1/5):Pros:1) Sufficient key travel (unlike on the earlier S7)Cons:1) Keyboard has some weird organization choices, like no Function keys, not sure why2) My spacebar only registered in the middle or left side, it missed most hits from the right side, this was a big problem.  While this does not appear to be an endemic problem it is also not isolated.  Had I  planned on keeping the computer I would have had them fix it.3) Backlight made it difficult to see the keys when the lights were on.4) No dedicated media controls5) One of the keys, either enter or shift was not full sized I cannot remember which.Vaio (3/5):Pros:1) Decent backlight2) Decent typing feel, full size keys.Cons:1) While decent to type on, it isn't a Lenovo quality keyboard... I wish it was.2) No dedicated PgUP, PgDn, home, end buttons.3) No media controlsGeneral use and other features:S7: (4/5)Vaio: (3/5)", "Date": "October 17, 2013"}, {"Title": "Fantastic Ultrabook!", "Author": "Dmitry P.", "ReviewID": "RIKACMIT283IG", "Overall": "5.0", "Content": "Had this laptop for about a month and so far it's been great. I haven't experienced much problems with WiFi. I had to go really far to get drop in speeds, to nearly the other end of the house. Similar drops were happening for my older laptop. Overall this ultrabook WiFi performed slightly less speedy than my older full sized laptop, but nothing too dramatic. One thing I noticed is that if you hold the laptop with hinges facing down, that is when performance might decrease, but otherwise it was on pair.With that being said this laptop excels above all others in every aspect. It's super light and slim. It's display Triluminos technology is fantastic, watching videos and movies on it is a blast. Speakers also sound very good considering how slim this thing is. Almost no fan noise as long as you have it set either to Normal or Silent operation. Fan vents are located on the left side of the laptop, which is a big plus, allowing great airflow and the use of the laptop in bed or on the lap without the fear of overheating. Speaking of overheating during normal operation it barely even gets warm. Carbon fiber materials are nice to the touch and the design itself is eye catcher.In my opinion all those features in this slim package are a lot more important than a slight WiFi problem that is even hard to replicate. If strong WiFi reception is a big concern for you, and you plan on being far away from a router on regular basis, invest in dual band external adapter, or WiFi extenders around your house.", "Date": "December 29, 2013"}, {"Title": "worst after sale service", "Author": "hazem", "ReviewID": "R33ZU588GYGQ27", "Overall": "1.0", "Content": "I bought this laptop few months ago,and i think it was the worst decision that i had in my life,the screen get cracked spontaneously, and Sony refused to repair it.they have the worst customer service.i am not gonna buy any Sony product again.", "Date": "May 7, 2014"}, {"Title": "No complaints!", "Author": "Nicole Wilson", "ReviewID": "RJVT0JUHMLB22", "Overall": "4.0", "Content": "Got this in December 2013 and so far so good.  After a few annoyances re needing to update drivers, and move to Windows 8.1, it's been smooth sailing.  Every so often I will lose wireless connectivity if I leave it in sleep mode sitting at my house.  But a reboot always restores it.  And the restarts are SO fast.In general I'm an Apple fan.  But for work and travel use, this is terrific.  And I love the option of the touchscreen, though find myself using keyboard/pad way more.It is true that the silver outline on key identifiers are sometimes difficult to see in bright light, but if you're a reasonable typist that isn't a big deal.  Also, as other reviewers say, fan does kick in, but it isn't loud enough to be bothersome, and not frequent when sitting on a hard surface.Overall thrilled with the purchase and it's ongoing use.", "Date": "March 23, 2014"}, {"Title": "Wanted to Love it, ended up Returning it", "Author": "foiegras \"foiegras\"", "ReviewID": "R1N0ZOIT8798S8", "Overall": "3.0", "Content": "This Sony VAIO Pro 13 is a technological marvel, however the whole is much less than the sum of its parts.  Contained within a less-than 2.5lb case is a 1080p IPS screen, an i7 processor, and a solid state disk.  Unfortunately, the thing is simply not a productivity tool unless you can work around its shortcomings (which I could not do).The screen is gorgeous in coloration, however whatever you gain in viewing angles from it being an IPS screen, you lose a lot more due to its reflectivity.  Unless you can position the screen in a way to avoid the reflections, you will have trouble reading what is on it and using it.  And this laptop does not have as much flexibility around the screen hinge as many others I have used, limiting the ways in which you can try to angle the screen to avoid the reflections.  Since it is a touch screen, the glossy screen is a virtual fingerprint magnet, so it will look dirty and smudged in no time after you clean it.The keyboard is extremely mushy with low key travel, and the whole body of the machine flexes as you type due to inadequate torsional rigidity which undoubtedly comes from a decision of the Sony engineers to minimize weight at all cost.  So they do have bragging rights on an unbelievably feature packed system weighing only 2.5 pounds, but the tradeoff is that the system is unusable.When I first got the system it went through a couple of hours of updating itself, and during most of this time the fan was blaring nonstop and quite noticeably.  I expected this to continue in actual use, but for the most part it did not.  I found the installed Windows 8 basic to be a real irritation, however I installed \"Classic Shell\" on top which got rid of many of Windows 8's most annoying \"features.\"  Updating to Windows 8.1 was a bit of a pain, since there are Sony drivers that need to be updated first, per instructions on the Sony website.I kept trying to like or love or even tolerate this machine, however I found myself going back to my heavier Thinkpad X220 purchased 2 years ago.  Even though the Thinkpad has a lower resolution IPS screen, and weighs more, it was hugely more satisfying to work with and I found little preference for the Sony screen once the annoying reflections on the Sony screen were factored in.  And as to the keyboard, it was no contest; the Thinkpad keyboard is nice to type on and the Sony one is horrible in comparison.People have said for a long time that the only two PC-standard machine brands who produce innovative and distinctive laptops are Sony and Lenovo-Thinkpad.  I have never owned a Sony before and wanted to give them a whirl.  Unfortunately, even Lenovo is reducing the quality of the \"computing experience\" in many of their laptops in order to chase the \"Ultrabook Holy Grail.\"  Reviews on the internet I have read of their newest versions of the X1 Carbon and the X240 laptops confirm that you can no longer blindly buy a Thinkpad and expect to get a solid laptop with a responsive and well laid out keyboard and a satisfactory screen.  Unfortunately, many of these \"Ultrabooks\" are in fact little more than useless but svelte looking toys, certainly not anything you could comfortably use for hours, or use to get any serious work done.I am hoping that the computing public that is serious about the business computing experience will reject these glorified toys and force the manufacturers to going back to producing functional product that is enjoyable and comfortable to use.  If you are looking for that kind of a laptop, this Sony Vaio Pro 13 should certainly NOT be on your short list.", "Date": "March 10, 2014"}, {"Title": "Worth the Price", "Author": "Christopher J. Giardina", "ReviewID": "RY8XPJ3NZN703", "Overall": "5.0", "Content": "I'm sorry, but this is honestly the best laptop I've owned. I would like to ensure you that I am no amateur when it comes to computers. The weight to performance ratio is beyond what you would expect from a laptop.Pros:Light (VERY light)touch screenkeyboardperformancecons:battery (barely a con)Bottom line, this computer packs a gigantic punch for the money. I purchased mine through newegg because amazon wouldn't ship it APO. If you are disappointed about the SSD space, buy one with a larger drive. This is perfect for a college student, semi-gamer, engineer, etc.BTW, I dropped it several times (4) from about a meter and the last time I dropped only the touch screen stopped working. I sent it to Sony and within the week I had it back working 100%. Consumer reports rated this ultrabook as #1 and I concur. No other ultrabook I've encountered has come close.", "Date": "December 4, 2013"}, {"Title": "Very good !", "Author": "Adriano Loffredo", "ReviewID": "R2BPHUIS4LV2SE", "Overall": "5.0", "Content": "Very good machine.Nice configuration (i7, 8GB RAM, 128 SSD) for a razoable price. It has good dimensions and is slim.The only thing is that it gets warm sometimes, but's OK.", "Date": "October 2, 2013"}, {"Title": "Light, but very fragile computer", "Author": "won \"wysung\"", "ReviewID": "R2TK5LESXPLI08", "Overall": "1.0", "Content": "This computer is very thin and light, but is very fragile.  Before you purchase this one, you need to consider that this computer should be handled very carefully always.  I bought an SVP1321 model in Korea at about $1800, and have used it for about 8 months.  Actually, I had to change one within one month of purchase because the computer generated electric spark and noise at the main board.  Now I have one very serious problem - the LCD glass is broken by being fallen from a chair.  It would be my fault but the computer itself is not very stable because the main body is too light while the LCD part becomes a little heavier because of touch capability, I guess.  Also, anyone will notice that the hinge of LCD is something loose.  Being fallen from a chair, the LCD has collided with the main part, which breaks the LCD touch glass.  By being fallen, the inside, not the case, is broken.  If this computer is well designed, I believe that the LCD should not be broken.  I have not much problem in looking at the computer screen, but the touch does not work.  I tried to get service through Sony Korea, but have an answer that it costs about $650 to replace the LCD part  (upper cover).  If you have any idea only to change the touch glass at a cheaper price, please give me some advice.  Anyway, it was a wrong decision to buy this computer.", "Date": "May 8, 2014"}, {"Title": "Excellent notebook", "Author": "NDuca", "ReviewID": "R3KFQTSMKWPK0O", "Overall": "5.0", "Content": "Excellent notebook. I recommended. It'veri height and fast. The monitor is excellent. The keyboard excellent. So each fan makes some noise", "Date": "March 30, 2014"}, {"Title": "Best laptop ever!", "Author": "Early Adopter", "ReviewID": "R2VFUW9NUK03YL", "Overall": "5.0", "Content": "Awesome laptop.  This laptop is lighter than a mac book air and has a touchscreen too!  Very fast and responsive.", "Date": "January 24, 2014"}, {"Title": "Product sold with technical issues", "Author": "Jose", "ReviewID": "R3DS8ZFI1SV46X", "Overall": "3.0", "Content": "Product with tecnical issues. When turn on the computer the screen starts with bands and during some time keeps blinking. I had to return this item.", "Date": "January 13, 2014"}, {"Title": "Nice machine", "Author": "Eric W.", "ReviewID": "RJYKCVQI7I2X3", "Overall": "5.0", "Content": "Have only had it a week.Very thin, sleek and light.Wish the screen would fold back a little further.Also, had problems with touchpad not working.  Possibly an update caused the problem.  Had to restore to a previousrestore point to get it working again.Overall, very nice machine.", "Date": "January 10, 2014"}, {"Title": "Light and nice, great battery life but has issues with WIFI", "Author": "Wafa", "ReviewID": "R2UIPZO8Y79E07", "Overall": "4.0", "Content": "I got this laptop for about a month, and I really LOVE it.Cons- Battery life is great, it can stay up to 8 hours,- Keyboard is really good,- Construction is very nice, and it's thin and lite...you will love it, BUT...this laptop has issues with WIFI, it is annoying that you have to manually connect to your network, if you're lucky to have the device functioning.", "Date": "December 31, 2013"}, {"Title": "Can do better for its price", "Author": "Avanthi Koneru", "ReviewID": "R3FLB28NXYFCT7", "Overall": "3.0", "Content": "I like the laptop its sleek, light weight, comfy and fastbut there are two issues..1) its getting over heated every now and then2) this laptop has some serious issues with WiFi, connections drop every now and then and sometime it dont even detect the wifi the bad part is if wifi doesnt connect theres not a way to get the  internet because it dont come with ethernet port.", "Date": "December 21, 2013"}, {"Title": "It is light and fast, with a beautiful screen.", "Author": "Gallileo \"Travellor\"", "ReviewID": "RBETG034DQ6JE", "Overall": "5.0", "Content": "The device works very well - finds and connects with wireless networks with little effort and is very fast in all its functions. Easy to transport.", "Date": "December 15, 2013"}, {"Title": "Beautiful. Light. Brilliant screen. Underpowered. Quirky keyboard. Lousy power attachment. Unreliable Wi-Fi.", "Author": "John Brady", "ReviewID": "R2PKY1PI6Z7OPL", "Overall": "3.0", "Content": "I bought this model at a local superstore. It is wonderfully light. The screen is beautiful in HD. Light and easy to hold. However, it is underpowered: the i5 processor, 8gb memory and 128bg SSD seem very crimped when trying to process videos or photos. Slow to react when pressing keys most of the time. The Shift key, when held down to process a number of items to move, delete, or copy, simply does not work; each item must be individually marked, which takes a long time and decreases the usability of the machine. The power plug is an abomination: it does not fit securely into the power slot, wobbling around and threatening to come unplugged at any time. WI-Fi is a hit or a miss: many times, it does not connect when machine is first turned on; a reboot usually cures the problem. An updated Intel driver did not solve the problem. The ability to use this machine in tablet mode, one of its selling points, was unusable: the device kept showing the screen upside down. I had to uncheck all references to using it in tablet mode. When using this machine with the Microsoft 365 program, it retains only about 80GB of remaining disk space. Thus far, I rate this machine as only adequate. I would not buy it again, regardless of the fact that it is light and looks great. The quality of build that I expected from Sony is simply not there.", "Date": "February 18, 2014"}, {"Title": "Don't buy this !!!", "Author": "ted", "ReviewID": "R2WXO2MDLOMJHU", "Overall": "1.0", "Content": "I bought this laptop when it on sale from Amazon, the delivery is pretty fast, but when I got this laptop. I am more than disappointed, the box is opened and the laptop is a used one with big HEAT/FAN NOISE issues. I used the HD tune to check the disk status and found out its already charged and cycled for 19 times and 47 hours. It is unaccepted and a shame. So I returned it in the 2nd day without hesitate.Anyone who is willing to buy this ultra book, plz be aware of these problems. Hopefully you can get a full refund for it.", "Date": "November 14, 2013"}, {"Title": "Horrible battery performance", "Author": "C. H. Beyer", "ReviewID": "R3JF6KPWLCURY5", "Overall": "1.0", "Content": "My Sony E Series Vaio cost me a grand a year ago.  Overall its an OK laptop but the battery life is abysmal.  After a full charge It shuts off after three hours of use.  Don't reccomend.", "Date": "December 20, 2013"}, {"Title": "Keyboard problem with letter s", "Author": "teresa", "ReviewID": "RT7PGB3A77QIH", "Overall": "1.0", "Content": "Just after some days the letter s of the keyboard is broken. How shoul I proceed to repair it?IT is not aceptable,", "Date": "October 19, 2013"}, {"Title": "Great display, great keyboard, but you'll NEED a usb wifi dongle", "Author": "E. L. Young", "ReviewID": "RW2GF5VR6DBC5", "Overall": "1.0", "Content": "I was liking this laptop a lot until I brought it more than 30 feet away from my home wireless AP.See my blog post:[...]", "Date": "July 30, 2013"}, {"Title": "Completely Wrong about the hard drive space", "Author": "Thomas L Ridenour", "ReviewID": "R3KYQRTRDRCQUZ", "Overall": "1.0", "Content": "The laptop is great except for 1 important feature the size of the SSD hard drive. The claim is 128 GB and it is no where close. The bytes are 112,843,550,720 bytes or 105 GB.I have 2 other 128GB SSD drives and they each are 127,928,365,056 bytes which is 119GB.I understand how the manufacturers cheat by rounding bytes to GB. Sony you are no where close on this.It should really advertise as 112 GB or 105 GB.Completely false advertising.Also the wireless speeds are extremely slow. My other laptop and desktop are getting downloads of around 7 Mbps (both have Windows 8). This laptop is only getting around 1Mbps.Here is a link to the issue.[...]**Update I contacted Sony help desk. The recovery  partition is around 16 GB. After initializing a recovery Windows returns an error can not find recovery partition. So Sony is sending me the 6 DVD disc recovery.I have Windows 8 pro that I installed on a PC it all fits nicely on 4GB. I find it problematic to have only around 60% of the hard drive space available, when you first use it.", "Date": "July 5, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CU65M8M"}}