{"Reviews": [{"Title": "Excellent Value!", "Author": "Gadget Junkie", "ReviewID": "R2LF0SC2XWTIML", "Overall": "5.0", "Content": "This computer should last for a long time since it runs very cool.  I've never had a laptop that ran this cool.  I used to have another brand laptop that ran so hot--and the fans whirred so loud--that you could barely enjoy a movie playing on it even while wearing full-size, noise-cancelling headphones.  Needless to say, that laptop had a very short lifespan--three years, then another 1.5 years after repair.  This Asus, by comparison, is impressively cool-running.  This is a very important feature to have in a laptop if you expect longevity!  Heat kills internal computer components!  I could not believe it the first time I used it.  Its very low-heat operation is very atypical for a laptop computer in my experience.  I've seen some desktop computers that run hotter than this!  I mean, even after many, many hours of use you can barely feel any heat on the surface of this computer even near the fan vents.This computer has a generous-for-the-$449.00-price 2.2GHz i3 Intel dual-core CPU with integrated graphics, 6GB of RAM (upgradeable to 8GB), 500GB hard-drive, one USB 3.0 port, two USB 2.0 ports, a memory card slot, an HDMI 1.4a port to connect to your home theater system, a dual-purpose headphone/microphone jack, CD/DVD drive for accommodating DVD-R/-RW/+R/+RW (including dual-layer discs) as well as CD-R/-RW, a non-touch 720p HD 17.3-inch screen, and keyboard w/numeric keypad.  It lacks an IEEE-1394 (DV-link, also called i-link) port (something I was used to on some other computers I had/still do have), but this is not a deal-breaker since there are obviously tons of ways to import audio/video onto your computer!Oh yeah, this computer is Windows 8 (basic version; not the Pro version, so no Windows Media Center).  As for those who do not like Windows 8; all I can say is I personally have no issues with this operating system.  I upgraded a Sony VAIO all-in-one desktop to Windows 8 Pro from Windows 7 Home Premium and I love it as well.  But for what it's worth, I still have a fondness for Vista (another controversial Windows OS I personally had no issues with) and Windows 7 just as I do for Windows 8.Although this Asus laptop does not have a Blu-ray Disc (BD) drive, I can confirm that its internal hardware will indeed accommodate the playback and recording of BDs if you have an external BD drive/burner.  I have Corel WinDVD Pro 11 installed on this computer for BD and DVD movie playback and it has no issues.  I have Sony Vegas/DVD Architect software installed for editing and burning of DVDs and Blu-ray Discs.  For video editing and burning/recording, it has no issues there either.  There is some Asus software preinstalled on this computer.  The quick boot-up feature Asus has on this computer could be handy for some users, but I personally like to shut down completely after each and every use.  So I have no use for this feature (which does not work when booting up from a complete shutdown).I bought an external Asus BD/DVD/CD drive (read/write) back in 2011.  This was my first Asus product.  It has always served me well.  This is what made me think of purchasing an Asus computer in 2013.  It is proving to be a quality performer.  The plastic that the unit is made of is not as robust as my last (much hotter-running) laptop, but just treat it right and you'll be fine.  Also, go light on the keyboard with your fingers.  It seems like there's a lot of give (fragility) in the keyboard.  Again, as before, just treat it right and you'll be fine.  Alternatively, you could simply use a USB keyboard or a wireless keyboard with this laptop (at least when you're using this laptop at home).The bottom line is this: For the price, this laptop has some power to it and some great hardware and software features.  Once you adjust this computer to your preferred settings and install the software YOU want on this computer, you can truly make it your own!!  For this price, yes, I would recommend it to anyone!  Oh yeah, and definitely double the fun by getting yourself an external Asus Blu-ray Disc drive to use with this computer!!", "Date": "October 7, 2013"}, {"Title": "Awesome Laptop to play World of Warcraft", "Author": "Debbe \"desertdebbe\"", "ReviewID": "RM9UEYV2EAXJS", "Overall": "5.0", "Content": "Great laptop. Look very carefully when looking for a case. It seems to be taller than most 17\".I bought it to play WOW when out of town. It works very well for that.", "Date": "November 17, 2013"}, {"Title": "Nice Laptop, but BAD Battery Connection.", "Author": "Mark Rajchel", "ReviewID": "R1WNG8J8PKSW0T", "Overall": "2.0", "Content": "Received the laptop with Win-\"Doze\" 8. Got it all setup and running. I shut it down for the night, and tried to start it in the morning. No success in doing that. After troubleshooting, I determined that there is a power issue. In addition, the battery was holding a charge. The charger was putting out the proper voltage, but I don't think the motherboard was allowing it to power up. RMA'd it and shipping it back today for a full refund. Amazon states I will also receive my shipping costs as well. We will see. Replacement laptop was a Toshiba. I was to chicken to buy another Asus.Thanks Amazon for the easy return process.", "Date": "December 20, 2013"}, {"Title": "Alright but speakers suck", "Author": "Bekki43", "ReviewID": "R33OLPW37VHPQF", "Overall": "3.0", "Content": "It's a good laptop except for the speakers. They are under the laptop and so the sound is quite muffled.", "Date": "November 25, 2013"}, {"Title": "Great laptop for the money, except for windows 8 garbage software.", "Author": "Swazzie", "ReviewID": "R2A01ZFRSTGHE0", "Overall": "4.0", "Content": "Fast, well built Laptop Computer. Does Not come with any disks. You have to burn a restore disk in case anything goes wrong with the software. Screen is crystal clear, touch pad is good. Not allot of junk software on the computer, well except windows 8. Windows 8 is the worst software ever. I went out and bought win 7 and installed it on this laptop. It is perfect now.", "Date": "November 16, 2013"}, {"Title": "Great Laptop!", "Author": "Becky Smith-Gregg", "ReviewID": "R16UE3OO7UQ190", "Overall": "5.0", "Content": "I enjoy the larger laptop.  The larger screen is so much easier to see the contents.  It is so much easier to do school work on.", "Date": "April 26, 2014"}, {"Title": "Ug", "Author": "Sandra Moore", "ReviewID": "RPJ8TG0ZPW2BB", "Overall": "3.0", "Content": "It is quick.  It is sleak, but my fault I did not realize for the price it did not come loaded with any Word or Office.  My mistake", "Date": "January 31, 2014"}, {"Title": "Good computer but need better power cord", "Author": "Leandra IPina", "ReviewID": "R7HP531XWEJA0", "Overall": "3.0", "Content": "Got this for my brother & since it was given to him in October the power cord has already burned out on this computer. Not sure if it was just faulty or since he games on this computer everyday it was just overused.  I would think the manufacturer would take that into consideration when making this product but maybe not. We found an alternate power cord that fit & he's been using that since. Since then my mom bought him a cooling fan for his laptop to hopefully keep the computer itself from burning out.", "Date": "January 28, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00COQIX9I"}}