{"Reviews": [{"Title": "Awesome computer", "Author": "Orlyn H. Wingert", "ReviewID": "R13JP3DNIIORZ0", "Overall": "5.0", "Content": "Good computer.  I like the number keyboard on the left and the large screen.  I was surprised that it did not come with excel however.  I like the long lasting battery as well.  I would also recommend getting malware and virus protection on the computer from the get go.", "Date": "October 26, 2013"}, {"Title": "Got a lemon", "Author": "Tammy Hamilton", "ReviewID": "RZ8DXC0QBL273", "Overall": "1.0", "Content": "The mother board was bad when I received it.  I have had good luck with Dells but really hate it that customer support is so hard to understand due to their accent.  A product is only as good as their support department.  Maybe Dell should rethink this.", "Date": "November 4, 2013"}, {"Title": "Love the 17\" screen", "Author": "Vic", "ReviewID": "R2CYAU7VA0RG6O", "Overall": "5.0", "Content": "Very satisfied with this laptop.  Had been looking for a laptop with 17\" screen that also had large hard drive for a good price.  This one fit the bill.", "Date": "January 9, 2014"}, {"Title": "Built-in mouse sticking", "Author": "Tom Niedererr", "ReviewID": "R2401SFT42UFJY", "Overall": "4.0", "Content": "I have a small problem with the built-in mouse sticking at times. Hooked up an external mouse to eliminate this. may just be wear-in time. Will keep testing. Mostly happens when playing games.Otherwise, still getting used to windows 8,but not having troubles like some reviews I've read.", "Date": "November 4, 2013"}, {"Title": "Worst operating system ever!", "Author": "P. Roberts \"penroberts\"", "ReviewID": "R360M02KEZF699", "Overall": "1.0", "Content": "This is by far the worst computer I have ever owned! Windows 8 operating system is a nightmare...continual popups, everything is hard to find...can't even watch a movie...The computer is so messed up it won't even let me access the Dell service/help information center. It arrived this way out of the box...I thought it had a virus, still not sure it doesn't! Very disappointed customer...would give it 0 stars if I could.", "Date": "December 22, 2013"}, {"Title": "Love It!!!", "Author": "Melissa D. Shupe", "ReviewID": "RIYYU3PLCZXO5", "Overall": "5.0", "Content": "Love my new computer. Still learning the Windows 8, but otherwise it's perfect! I would recommend this computer. Dell computers are great.", "Date": "October 3, 2013"}, {"Title": "Great computer, crappy packaging", "Author": "Don Means", "ReviewID": "R3BAZTVU4BJU4V", "Overall": "4.0", "Content": "It does everything it should do.  My complaint would not be about my Dell.  It is of the same high quality I have been use to over the years.  The company I bought from is another thing though.  The delivery was a little slow but that wasn't the big complaint but it was the shipping container.  The end was mostly torn away from the box when I received it.  Even the FedEx guy commented on it.  Dell's superior packaging of the internal box saved the day though. It was like they didn't have a real box so they tried to put one together from cardboard scraps.  The computer survived though and I love it.", "Date": "November 25, 2013"}, {"Title": "Dell doesn't know about this system", "Author": "Michael L. Angelastro", "ReviewID": "RIY1NI2W7NX3W", "Overall": "2.0", "Content": "Dell does not know about this system. Didn't know that this would be the case. That should have been clear.", "Date": "March 27, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CRGJENE"}}