{"Reviews": [{"Title": "Computer is fantastic with some drawbacks", "Author": "Justin A. Wells", "ReviewID": "R3FAC1I8P77GKA", "Overall": "4.0", "Content": "Got this laptop for around 500 new. Loving it, gobs of power, room to expand. If you want it to be ninja, get a SSD drive as the main and use the built in drive to hold your \"stuff\" I added 16 gb of ram, a 120gb SSD  hdd, and a bluetooth dongle. Great machine, the screen is gorgeous and hugeCons:great huge screen.Very powerfulbacklit keyboardexpansion room for 2nd hdd and another 24gb of ramgood speakersCons:Heavy... Like really heavy.. if you want portability, this is not the machine you want. look at a Lenovo 14\", they are great portable powerhouses (priced to match)The graphics card will not do the latest games at high levels, but i can play any steam game (Left 4 Dead 1/2, Portal 1/2 etc at full tilt and it rocks)Battery lifeKeyboard and trackpad are obnoxious at first they do get better with time. (i really recommend a nice optical wired mouse. The touch pad is in an odd location making typing difficult, you plug in a mouse and it auto turns off and you can type much better,the dvd drive is cheesy feelingwindows 8", "Date": "October 17, 2013"}, {"Title": "Greatlaptopdestroyedby really badkeyboard  ***UPDATED", "Author": "onlye", "ReviewID": "RNWZ1GS59C7XC", "Overall": "4.0", "Content": "it is fast, really. nice screen.  but the keyboard space bar require you to hit it in theexact middle and EXTRA hard for the space key to work.  so get it repair under warranty?  this is when you find out there is only one option to pack it up and send it into toshiba for service.  no local authorized repair centers available.  will notlet you payfor thepart, repalce and return defective keyboard for credit.  so i have to remove all my data to send itin andthen will have toreinstall.  along with thefactthatiam out ofthelaptop for a couple of weeks.by the way. i tested another of the same model on display at bestbuy and the same crappy space key problem so not sure sendingit in for repairwill improve anything.  it mightjust be abad keyboard design.notice had badthe typing on itis?*****UPDATE********I sent it back to Toshiba for repair.  The turn around was faster than I expected, 1 week.  The repair did fix the issues with the spacebar on the laptop.  Shame on Toshiba though, the laptop came back with a new keyboard but is was no completely installed and just flopping around when I received it back.  Not a big deal for me and I had is properly installed in about 5 minutes.  I am very pleased to have my laptop keyboard functioning and greatly increasing the value of my laptop.  I am changing my rating from 2 to 4 stars.", "Date": "September 27, 2013"}, {"Title": "Wonderful", "Author": "Will", "ReviewID": "R1UPTKS87D2BZH", "Overall": "5.0", "Content": "I love this laptop. It's a nice desktop replacement. The battery life leaves much to be desired but I have it plugged up most of the time. Thanks. Couldn't beat the price either.", "Date": "September 12, 2013"}, {"Title": "Very Good Computer", "Author": "André de Sampaio Bender", "ReviewID": "RF5W02NTJA4EJ", "Overall": "5.0", "Content": "The Laptop is very fast and good. But there are some problems regarding the need of a solid state Hard Drive and the cover that is made of plastic. But the PC is incredible and with an excellent and the Computer Geek has good offers.", "Date": "July 6, 2013"}, {"Title": "Very good", "Author": "dalia", "ReviewID": "RVS7TLTRWJN59", "Overall": "5.0", "Content": "I love this laptop. Amazing 8 processors make it fly. Great sound with a very nice LED screen. All in all I adore it.", "Date": "March 12, 2014"}, {"Title": "Will add fifth star when I figure out how to use this thing.", "Author": "Johnny Tezca", "ReviewID": "R115H7ZKIJKCFE", "Overall": "4.0", "Content": "I am a Mac user from way back. I used a Mac with no hard drive, just the 1.4 mg disks. Why? Because Apple appeals to my lack of engineering abilities. Macs are for lazy people who look forward to a world run by helpful, sexless robots.It is amazing so far, but the distance that remains between Apple and the PC world is less a real distinction of culture than' preventing customers from the ability to make choices as opposed to selections that are standardized and therefore minimize deviance or geNew ius, much less courage.,Screen and keyboard are amazing. Can't wait to write a story on it.", "Date": "November 15, 2013"}, {"Title": "Toshiba? no thanks.", "Author": "Tyler Morrill", "ReviewID": "R1AO0EFQN0PJOK", "Overall": "1.0", "Content": "Got a refurbished Toshiba satellite of a slightly different model. Computer went to sleep automatically despite settings telling it not to go to sleep. After 3 months of sending it in for repairs (4X total), and sloppy repair jobs that ruined the keyboard Toshiba finally agreed to replace the laptop with a satellite P875-S7102. This computer worked fine for about a week, then the same problem appeared (going to sleep randomly). I don't have the time and money (paying for shipping to send the laptop in for repair gets expensive after multiple repairs) to go through this whole process again.Lesson: Toshiba is willing knowingly to sell its customers defective laptops.Total costs for the barely functional defective laptop I have now:Original laptop cost: $590Software lost due to system resets during repairs: $500 (MS Office 2010, MS Office 2013, STATA)Shipping costs: $25Hours spent on the phone with tech support and customer service: 40 hours X 20$/hour - $800Total cost of defective laptop: $1,915Never again Toshiba.", "Date": "January 3, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00D23K2Q4"}}