{"Reviews": [{"Title": "Not for me", "Author": "Treyes & Covert Family", "ReviewID": "R39MNGI33W7U04", "Overall": "2.0", "Content": "I bought this to replace a Toshiba laptop that we'd been using for a few years.  I heard a lot of great things about Asus so I gave it a try.  The preformance of this laptop is great but it's the design that I had problems with.  The keypad is terrible.  The keys are recessed so it makes it very uncomfortable to type.  I constantly had to press keys more than once to get a response.  I ended up returning and purchasing a HP with the same specs and the keyboard is great!", "Date": "October 1, 2013"}, {"Title": "The keyborad does NOT work", "Author": "Randolph O. Sanchez B \"randolph sanchez\"", "ReviewID": "R3B85DJTHUUFSO", "Overall": "2.0", "Content": "Thekeyboard does not workproperlly (specially the space bar). you can not even send an email. you will need to press many times just one key to get success. I thinkthis is a wonderful product (ifyou look its hardware component) but unfortunately thekeyboard just does not work. I payed 17USD for two business days shipment. I really hope a free 2 business days in my next purchase that it would not be a ASUS like this.", "Date": "November 6, 2013"}, {"Title": "Why make such a nice machine with a horrible keyboard? Spacebar barely works", "Author": "Lindsay", "ReviewID": "R1BR49CP1FX21B", "Overall": "2.0", "Content": "This is a very pretty machine. It has everything I needed for the perfect price. HOWEVER, The spacebar does not work 9 out of 10 times that you try to use it. If you are a person like me that has to type a lot, this is a MAJOR problem. The whole keyboard is kind of awkward, but at least the other keys actually worked. Sadly, I had to return it, because who wants a computer without a properly functioning spacebar. It's like a nightmare come true. WTF?!! I would say to take your chances and purchase this if you are the hunt and peck kind of person. Then you might be able to slam the spacebar with all your might perfectly in the middle to get it to work. This doesn't seem to just be a rare defect. I would have to think they are all functioning like this.", "Date": "October 1, 2013"}, {"Title": "Niece loved it", "Author": "Anthony", "ReviewID": "R392LCJ8SDKXD7", "Overall": "5.0", "Content": "I bought this for a graduation present for my niece, and she absolutely loved it. Very powerful machine for the money.", "Date": "August 28, 2013"}, {"Title": "Great computer", "Author": "Matoo", "ReviewID": "RPNBDUAYVQ39F", "Overall": "4.0", "Content": "I just had it and I love it so far! You just need to get used to windows 8 and you're good to go.", "Date": "September 2, 2013"}, {"Title": "grate laptop", "Author": "Rick Wooten", "ReviewID": "R18X5IZQT63V73", "Overall": "5.0", "Content": "this is a grate computer for mostly anything and the touchscreen makes windows 8 so much better! I would total recommend this computer.", "Date": "August 1, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DBSW3BC"}}