{"Reviews": [{"Title": "Overall good but some (annoying) flaws", "Author": "Reh Ka", "ReviewID": "R1VJOB7N8EGPCI", "Overall": "4.0", "Content": "Laptop seems to work good and I can't complain much (yet).But the seller(eGator) kind of tricked me and hid changes in the product in another link away from the main page, because his description says the Laptop should come with Win7 which it did not. I have a Win8 and a Touchscreen (and some other bonuses, some good though still unexpected) but still, had I known it in advance, I wouldn't have bought it.So far I could arrange Win8 to make it seem more like Win7 and that way I manage and like the Laptop.Technically I can't really say much, but all programms work, although one update on the Lenovo Solution Center just won't install for whatever reason.Battery life is about 5 to 6 hours, which is good in my eyes.Keyboard works really good.Touchpad gets really annoying because it sometimes reacts slowly or not the way I want it to.The Trackpoint Thing is too sensitive and uncomfortable in my opinion but maybe if you use it more you'll get used to it.", "Date": "March 4, 2014"}, {"Title": "So far happy with it", "Author": "D:)", "ReviewID": "R1CDKJ8HWMX63R", "Overall": "5.0", "Content": "Just got this laptop a few days ago, was delivered a day earlier than scheduled.  The only minus that I see is the screen, it's not great , but it's not bad by all means, it's clear and sharp enough for everyday copmuting, movies, videos etc. I red the reviews before buying it so I wasn't surprised.  Everything else is excellent: weight,  keyboard, battery life, fast proccesor,  doesn't heat up a lot and I am really happy with the speakers especially. For the price you can't go wrong, higly recommend this product.", "Date": "February 26, 2014"}, {"Title": "Not a pleasant experience", "Author": "Dave Lerro", "ReviewID": "R1LH7IBFEMBE1M", "Overall": "1.0", "Content": "Dead on arrival.  The Lenovo reseller- Antonline- was very difficult to work with in getting them to even respond to my inquiries.  Only after a dispute was placed with the credit card company was I able to get a return authorization.", "Date": "February 9, 2014"}, {"Title": "Excellent laptop for touch typists, with one caveat", "Author": "Darron A. Vanaria", "ReviewID": "R16KR52DZIGPHP", "Overall": "3.0", "Content": "This laptop has the best keyboard of any laptop I've tried. I type (a lot) and so this is one of the most important features for me. I like how this particular laptop has a very basic keyboard (no extra keys on the right side of the RETURN key, like a number pad or useless media keys - these extra keys on the right side make touch typing almost impossible). I really like how it has a full size right-hand shift key (increasingly hard to find on laptops). Also, unique to this computer, it has slightly larger Esc and Delete keys, two keys that I use frequently.Here's the caveat: ThinkPads have the Fn and Ctrl keys reversed, and this particular one also has all the functions keys (F1 to F12) mapped to annoying media functions BY DEFAULT. That means, you have to hold down the Fn key and then press the desired function key (which is in tiny tiny print on the lower corner of each function key) if you want the \"legacy\" function to register.In the BIOS setup, you can reverse the Fn and Ctrl keys (if this option wasn't available, I would have never bought this computer - I use that left hand Ctrl key continuously because I use Vim as a text editor - but there are many other programs that rely on the Ctrl key being in that lowest left-hand corner that you are probably used to).HOWEVER, you CANNOT reverse the function keys (F1 through F12) to default to their legacy functionality. This is shameless on Lenovo's part, not giving its customers that option - especially since previous BIOS versions on older ThinkPads always offered that as an option! Maybe this will be fixed by a later BIOS release by Lenovo, but so far I've seen no response from them online, whatsoever, about this. So buyer beware!", "Date": "March 14, 2014"}, {"Title": "Fast and light laptop", "Author": "Dan", "ReviewID": "R18GCHAWESLFS6", "Overall": "5.0", "Content": "T430 is fast, has good battery life, and has a great looking lcd.  I highly recommend this laptop to all.", "Date": "February 19, 2014"}, {"Title": "Love my laptop", "Author": "Judy OConnor", "ReviewID": "R2V3X55Z8I9LSV", "Overall": "5.0", "Content": "I have always had a desktop but when XP was no longer supported by Microsoft, it was time to get a laptop and I'm happy as can be.  Everything about it is an improvement over the clunky machine I had previously.  Windows 7 is more efficient and has many more features which I appreciate.", "Date": "May 19, 2014"}, {"Title": "Terrible Experience ## Worst customercare ## bad performance overall !", "Author": "Sajith A", "ReviewID": "R1YUM3OAA0GECJ", "Overall": "1.0", "Content": "#Annoying EXPERIENCE#Used fro 5 months - Returned laptop twice for service within warranty period ! Finally getting rid of it !!I purchased E431 going by the brand name and the price, which meet my needs. But after using for 5 months i realized the camera isn't functioning properly. So i got it repaired ((after looonngggg wait of 14days !!! ))) ((Worst experience)). I was promised that laptop would be delivered back in 10 working days ! But it never happened.After somedays i realized \"dead pixel\" in center of screen and also few other small problems . This time i sent it to LENOVO HEADQUARTERS in NC !!! Aftera lonnngggg wait of 12days they finally replied saying IT CANNOT BE REPAIRED. IT WAS THE TIME FOR MY FINAL EXAMS. I AM GRADUATE STUDENT Right now !!! Without laptop i just cannot study !!I was thinking of making legal proceeding against LENOVO for making false promises. # But the laptop came in the evening before my exams ! # I anyways dint care much, Who needs now !.I asked for a upgrade !! Which i feel should be given !! ((Many of my friends using DEll, HP - though had problems, get free upgrades etc and good customer exp !!! ))). IT WAS ALSO NOT GIVEN. I have now asked for return of money - which atleast will be the last hope !!!Please never buy LENOVO # WORST EXPERIENCE # CUSTOMER SERVICE # More than 30days of negotiations !! Worst communication !! and stupid product ! Think twice before you get a think pad!", "Date": "May 14, 2014"}, {"Title": "Touchpad issues", "Author": "SE Justice", "ReviewID": "R1K3QPI7Y8OBEK", "Overall": "2.0", "Content": "I've had the laptop for 4 months and have not gotten used to the touchpad. Even with adjusting the settings on it I still have issues with it either not responding or being hyper-sensitive. Other people in my family won't even use it because of this issue. It is very frustrating.", "Date": "May 11, 2014"}, {"Title": "Good business laptop", "Author": "anon87", "ReviewID": "R346SLT4V5V4UE", "Overall": "4.0", "Content": "I purchased this machine for the Windows 7 Pro operating system because my Windows Home Premium laptops no longer were compatible with my work computers, which switched from XP to Windows 7 Professional. I decline to obtain Windows 8 in any form.I really like the fast log on time. There were no desktop icons to clutter and slow down the system. I'm going to keep it that way.Little to no bloatware is present. I uninstalled the Norton because I have already got a subscription to MacAfee. The Norton was okay, while I had it.I like the finger print scanner. It saves me time typing the log in password, but I know that the fingerprint scanner is hackable with the right simple equipment. For me, the scanner is a time saver. For those interested in better security, type in your complicated password.The Thinkpad came with Adobe Acrobat. I had to install Java because of my workplace requirements. It does not stutter when playing movies, but I don't use much for that.It worked very well, when I had to attend a Webinar. The sound quality was excellent. I did not need my gaming headphones to hear what was going on, although I did plug in the ear phone part to be sure I heard everything. I did listen to part of the meeting without headphones and found it was fine. there was no microphone plug for the headphones. The microphone was elsewhere in the machine and had no problems picking up my voice.There is a webcam that I have not used yet.On the down side, I am having to get used to the track pad, which is very good for scrolling, once I am able to trigger that. When it comes to clicking the track pad, there are no discrete buttons, but if you click the lower corners at the bottom, it serves the same purpose. I just need to get the dexterity right.I like the small red joystick? or what ever it is called. It is a good alternative to moving the arrow around with the track pad.I wish the Fn key and the Ctrl key at the lower right hand side of the keyboard were switched because I am used to them in a switched state, not the way they are in this system. I figure I'll need to get used to it. Also, the F2, F3 keys at the top require pushing the Fn key and the F2 key at the same time to toggle that function. Since I use function keys a lot, it slows me down a tiny bit.I like having a DVD/CD recorder and SD card reader. Those are very useful to me.The ThinkPad is also fairly light for all the things that it does, which I really appreciate because I have to move around sometimes for my work and need a light, powerful machine.All in all, I am very glad that I purchased the Lenovo ThinkPad.", "Date": "April 28, 2014"}, {"Title": "First laptop; this one works for me", "Author": "John Sims", "ReviewID": "R3J2V5EEVWA839", "Overall": "5.0", "Content": "I did a lot of shopping around and decided on this one for price, DVD player, Window 7 (not 8), HDMI port and size. I bought the laptop for travel.", "Date": "April 26, 2014"}, {"Title": "Awesome post sale service", "Author": "Christian Gutierrez", "ReviewID": "RKRFGKTJP053Q", "Overall": "5.0", "Content": "I had problems with OS, but Lenovo deliver the recovery discs very fast (less than 3 days).  OS Win 7", "Date": "April 16, 2014"}, {"Title": "Great economy laptop", "Author": "David Sundquist", "ReviewID": "RU2T0PUOHLS9O", "Overall": "4.0", "Content": "This is a great economy\\budget laptop. I docked once star for the fact that the trackpad takes a lot of getting used to.", "Date": "March 27, 2014"}], "ProductInfo": {"Price": "$778.21", "Features": "Optical Drive: SuperMulti 8X DVD+/-R/RW Dual Layer\nHard Drive: 500GB 7200rpm Hard Disk Drive\nRAM: 4GB (1x4GB) DDR3 1600MHz\nProcessor: Intel Core i5-3230M Dual Core Processor (3M Cache, 2.60GHz - 3.20GHz) 35W", "Name": "ThinkPad Edge 62775AU 14\" LED Notebook - Intel Core i5 i5-3230M 2.60 GHz - Matte Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41J9OwKp%2BpL._SX300_.jpg", "ProductID": "B00D4B2V90"}}