{"Reviews": [{"Title": "Works great!", "Author": "Jday", "ReviewID": "RHIDA2X5C0W3P", "Overall": "5.0", "Content": "Sound quality is great, screen graphics are great.  Really happy with this laptop so far.  In general it feels like this is a quality product that should perform very well for a long, long time!", "Date": "February 9, 2014"}, {"Title": "Not as advertised", "Author": "Dorothy V.", "ReviewID": "R2CZK9L27CV4JG", "Overall": "2.0", "Content": "When I ordered this, the description said it had a touchscreen - but sad to say it doesn't!  I have been trying to get a hold of someone in Amazon customer service but don't seem to get to the right email address.  I want to return it for credit and then find another one to purchase that meets out needs.  I was told to go to the manufacture but there is nothing wrong with the unit it just isn't what Amazon advertised it to be.  The manufacture also said Amazon should take it back and sent them an email accordingly.When I serached for a 17\" laptop w/touchsceen it came up, but now that I've told them, they changed it.  Still waiting for Amazon to do the right thing.", "Date": "December 13, 2013"}], "ProductInfo": {"Price": "$859.00", "Features": "Genuine Windows 8.1 64; 4th Generation Intel Core i7-4700MQ Processor (2.2GHz, 6MB L3 Cache)\n1TB 5400 rpm Hard Drive with HP ProtectSmart Protection; 8GB DDR3 1600MHz RAM (2 Dimm)\n17-inch diagonal HD+ BrightView LED-backlit Display (1600 x 900) Non-Touch, SuperMulti DVD burner; 6 Cell Battery\nIntel HD Graphics 4000 Series; 802.11b/g/n WLAN; 4 SuperSpeed USB 3.0; 1 HDMI; 1 RJ45; HP TrueVision HD Webcam with integrated digital mic\nStandard Keyboard; Beats Audio with 4 Speakers; Fingerprint Reader; 65W AC power adapter; 2 Year HP Warranty", "Name": "HP ENVY 17 17t-j100 17-Inch Laptop (2.2 GHz 4th Gen i7-4700MQ Quad Core processor, 8GB DDR3 RAM, 1TB 5400 rpm Hard Drive, Windows 8.1 64-bit)", "ImgURL": "http://ecx.images-amazon.com/images/I/411Em8CaY1L._SX300_.jpg", "ProductID": "B00D7YSOAE"}}