{"Reviews": [{"Title": "Highly Recommended Laptop", "Author": "Gavin", "ReviewID": "R1HUGJ2SNNKV7S", "Overall": "4.0", "Content": "I haven't seen any reviews for this particular model so I figured I'd write one so nobody feels like they're playing laptop roulette on this purchase.  I've had this laptop for about a week and so far it has exceeded all of my expectations.  This computer is perfect for solid gaming, so far I've have played Bioshock Infinite, Sleeping Dogs, TF2, and Deus Ex HR all on Medium - High settings with almost all graphics features turned on and it runs like a charm.  Slightly older games like Mass Effect (1) on ultra with everything run great too. Multitasking is smooth with the i5 processor and the RAM is great.  I'm planning on upgrading the RAM to 8 GB when I get the chance but i'm in no rush given the performance.Some people may view Windows 8 as a negative side, and I was a non-believer but I have actually been pleasantly surprised.  Plus it doesn't force metro on you as much as I was led to believe, the desktop is as present as ever and easily accessible at all times.  I haven't had any compatibility issues or crashes either which is a plus.Some small cons that i'll list are that the lid tends to gather fingerprints quite rapidly, i've already had the computer for a week and it looks like i've been massaging the lid with bacon grease. Which is surprising since I have clean hands and don't generally massage my belongings with bacon grease. Another slight adjustment is that the windows key is on the right side of the keyboard and the function (fn) key is on the left.  This is a slight annoyance since every keyboard I have ever used is the opposite, but luckily I don't use either button too often. Also, the 4+ blue LED lights on the front of the computer are bright, and I mean like you don't need a light fixture in whatever room your in bright. If you sleep in the same room a your computer (as I do) there's a high chance you'll want to throw something over it or keep under your bed.  When in sleep mode the lights constantly blink, which is really, really, annoying. Lastly, as with most computers there is a little bit of bloatware (or promotional pre-installed programs).  Although all are easy to get rid of.My final thoughts are that if you're a gamer with a relatively tight budget this laptop is perfect.  Or if your just a regular person looking for a computer that can handle anything you can throw at it, this is also a great choice.  The laptop is light weight and has a low profile.  I've already carted it to work a few times and packing it up and carrying it is simple.  Track pad is decent, however I use a mouse anyways, and the keyboard is comfortable and easy to navigate. Also, one last thing is there are 3 USB ports, some might say that's not enough but it's the perfect number for me. All in all this is a perfect mid range computer that is an all rounder that delivers a great computing experience.  I would definitely recommend it.EDIT: Some things I originally forgot to mention: the card reader is really well hidden (it's pretty much under the computer towards the front) this isn't a big deal, just struck me as odd.  The speakers are really loud and the quality is decent as far as laptop speakers go, big ups for that.  Also, MSI has included some interesting features such as ECO (which is apparently different power profiles to conserve battery life) and things like airplane mode to disable bluetooth and such.  The Hard drive is partitioned into two separate partitions, just an FYI if that is pertinent information.  The heat management has so far been satisfactory and the machine hasn't been too hot to handle, although I'm sure that will change over time.  A user has also commented on this review and asked about battery life, which is something I haven't tested yet but will be sure to update with when I do.", "Date": "August 1, 2013"}, {"Title": "Very happy.", "Author": "Deadman", "ReviewID": "RPU4BBIM9TXQJ", "Overall": "5.0", "Content": "I am totally satisfied with the performance and quality of this laptop. I'm especially impressed by its fantastic graphics performance.", "Date": "December 30, 2013"}, {"Title": "its everything i needed", "Author": "Pen Name", "ReviewID": "R1EGW90BJ7NWMP", "Overall": "5.0", "Content": "The computer had no problems it surpassed the expectations i had for itand i love to use it for the university for homework and projects and for art desingi would suggest this computer for people that wish to have a decent laptop to play a few games on your free time.", "Date": "September 1, 2013"}, {"Title": "Everything I wanted and more. For a good price!", "Author": "Christien", "ReviewID": "R1KNN3GZH9JI61", "Overall": "5.0", "Content": "I love this laptop. I have had it for about a month no and no complaints! It is very fast. I would really recommend this to anyone looking for the best for their budget!", "Date": "August 17, 2013"}, {"Title": "a little underpowered", "Author": "aredyak", "ReviewID": "R3HVVM8KB12OYK", "Overall": "3.0", "Content": "The overall design of the computer feels a little dated and the keyboard has the off placed mini right shift key that was hard to adjust to. The GPU is what I felt was underpowered for the price since there are other models available by other companies with i7 processors and much more powerful GPUs. I actually returned this one because of the dramatic price drop of their competitors products. Overall this was a solid PC but the competition just had their price beat by a long shot.", "Date": "August 21, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DERLLB8"}}