{"Reviews": [{"Title": "HP 2000-2C22DX Intel Pentium 2020M 2.4 GHz 4GB 500Gb 15.6\" DVD Burner", "Author": "Gustavo E. Mendoza", "ReviewID": "R3G0OJGUQGI8AE", "Overall": "5.0", "Content": "I find it an excellent buy. Windows 8 is easy to handle. I am happy with the machine. It's fast and I like the look. The keyboard is comfortable and the touchpad is sensitive.", "Date": "September 22, 2013"}, {"Title": "Best Laptop I've ever owned", "Author": "GriffDog", "ReviewID": "R3FFEF8RD6PXOX", "Overall": "5.0", "Content": "I bought this at Best Buy as part of a package deal. I didn't use anything else that came with it, but this laptop is great! It's pretty fast and still has room to upgrade. You can upgrade the ram to 8 gigabytes, and of course you can upgrade the hard drive. HP support is the best support I've ever had to talk to. I will never buy another brand of laptop again!!Memory:  Crucial 8GB Kit (4GBx2) DDR3 1600 MT/s (PC3-12800) CL11 SODIMM 204-Pin 1.35V/1.5V Notebook Memory Modules CT2CP51264BF160BHard Drive:  Seagate 1TB Solid State Hybrid Drive SATA 6Gbps 64MB Cache 2.5-Inch ST1000LM014Transfer Kit:  Apricorn SATA Wire Notebook Hard Drive Upgrade Kit with USB 3.0 Connection ASW-USB3-25 (Grey)", "Date": "August 23, 2013"}, {"Title": "Great laptop, slick, smooth, and works well", "Author": "weaponx", "ReviewID": "R1EA8X3Q3GH5OA", "Overall": "5.0", "Content": "Awesome laptop, good features, and runs well. Windows 8 is not my favorite, but everything else is great for me.", "Date": "October 24, 2013"}, {"Title": "So far, a great deal", "Author": "a reader \"lots of books, little value\"", "ReviewID": "R1VBH8GSVAC43X", "Overall": "5.0", "Content": "For the price I paid, this was a great deal...everything working smooth on the laptop and it's in good-great condition.  If in the future something goes wrong, will update it here, but looks like a very good deal so far.  I give it 5/5 because of quality/price.", "Date": "June 3, 2014"}, {"Title": "5 stars at first", "Author": "J.D.", "ReviewID": "R3MLZBAGDBDA9W", "Overall": "1.0", "Content": "I really liked this pc for the first few months and now it continually loses internet connection. I can get re-connected but its time consuming, happens a few times a day. I have wifi, everything else in my house stays connected and its right by the wifi.", "Date": "April 12, 2014"}, {"Title": "An excellent deal!", "Author": "MrMRD", "ReviewID": "R3F2NHRJKJVC4P", "Overall": "4.0", "Content": "I have owned several HP desktops and laptops, and I love this product. I purchased mine on another site, and the price was extremely reasonable.  This notebook has all of the upgrades that I needed; i.e., bigger hard drive, RAM, etc.  Windows 8 isn't that hard to learn.  I also had an issue with all of the gestures, so I disabled most of them, so that it works like my Windows XP laptop.  This is a super product!  It took a little while to get used to the keyboard, as my previous laptop had a quiet keyboard.  Also, when you close this model, it doesn't lock.", "Date": "October 13, 2013"}, {"Title": "cheap feel...windows 8 awful", "Author": "anthony pasceri", "ReviewID": "R3MVZZVZ7WNN85", "Overall": "2.0", "Content": "brand new and j on keyboard works occasionally,disc drive hard to open,price from vendor too high,my own fault should have done my homework on vendor and computer.", "Date": "October 2, 2013"}, {"Title": "I like Windows Vista better", "Author": "Maureen E. Profera \"jitterbug\"", "ReviewID": "R2LJTMRL42R66Z", "Overall": "3.0", "Content": "I don't really like the shiny cover so I purchased a skin to put on my computer.  I love that I can burn cd's and make photo cd's as well.  I could not for the life of me locate the start button or any of my programs since the bar is hidden on the right.  Somewhere.  It shows up when you don't want it to show up.  This computer should come with an instruction manual.  I am still struggling with how to use this computer.  The touch pad drove me nuts until a friend disabled it for me.  I like my old, dead Windows Vista so much better and it is also user friendly.", "Date": "October 2, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00D735Q1U"}}