{"Reviews": [{"Title": "Great computer", "Author": "kgb", "ReviewID": "R27KCDTXVITHVF", "Overall": "5.0", "Content": "Kind of a long review sorry...The Acer Chromebook is a great computer for someone looking for a computer to do internet browsing, light gaming, and light productivity. You can not download any programs to it, but there are a ton of apps available to fit almost every need (word processing, spreadsheets, photo editing, games,etc.. check google chrome store to see what's available if you have any questions). Think of it like a tablet with an app store in that regard.Way too many bad reviews on Chromebooks from people who do not understand what they are buying and don't understand why windows programs won't work on it. A lot of bad reviews are from people who have never even tried one. Unless you are a hardcore MS office user, or serious gamer who needs a lot of computing power this computer can do almost everything you need.At first I wasn't sure if this would work for me, because it looked like a low end limited use netbook. But it kept getting great reviews and for $200 something bucks, and the option to return it if I didn't like it, I'd give it a shot. There are tons of reviews from people who have moved away from using their much more expensive computers because the Chromebook is just a better online experience for most of their needs. I now know why.Honestly if I need something, I know my Chromebook can be up and have me searching Google quickly in seconds. Long before my other computers can get to my homepage (even from standby). I also know all my plug-ins are always up to date and ready to go. Why even turn the other ones on unless I absolutely have too then? Having to sit through windows load/resume screens gets old really quick once you realize you don't have to. Chromebook quickly became my go to computer for anything online.Due to the fact it doesn't run a bulky OS like windows, it doesn't need that much processor power to breeze through websites very quickly. You would be amazed how fast this little Celeron chip (its actually a stripped down dual core i3 sandy-bridge processor) runs when its not having to support a lot of OS background processes. It is just as fast browsing online as my much more expensive i5 computers.Power off to my internet homepage is under 10 seconds, standby to my homepage is 1 second or less, and total shutdown is under 5 seconds.However I tried it out at best buy (they have it for $199), and due to the fact they have so many machines running on the WiFi at the same time it seemed slow in the store. Trust me it is very fast on a good WiFi. Remember it is cloud based, so it is only as fast as your Wifi is. If you are using a slow connection your whole computer will seem slow. Faster the connection, faster the computer will be.It is cloud based, everything is saved, auto updated and configured on the cloud. Since nothing is saved locally on the computer (unless you want it to be) your files (pics music documents movies etc) are available on any computer with an internet connection if you are away from your Chromebook. If you have to replace or upgrade your Chromebook simply log in and everything is instantly restored from the cloud, including every setting, preference, app, and all your saved data and files.  Plus since nothing is actually on the Chromebook, no one can steal any info or files from it. Try that with a windows machine. No reason to ever do any maintenance on anything ever. No worry about viruses/malware because there is no real operating system to infect, no old files to clean out, no registry to maintain, no updates to manually install, no defrag, no virus scans, no maintenance at all since nothing is actually stored on your computer (except the OS and offline apps).Also, since it is cloud based, no matter how much you download or use it, it does not affect the computers speed. Nothing is stored on the computer to bog it down. It actually just keeps getting faster with every auto update. It is the only computer I have ever used that gets faster as you use it.HD 1080p video streams smooth with no frame rate issues, even in full screen. Aquarium WebGL renders 40 fps on a high setting with 500 objects on screen, and 35 fps with 1,000. The HD webcam is great, and video chat works with no issues. The speakers are a little quiet for my taste, but you can hear everything just fine, just don't expect it to fill a noisy room with sound. HDMI out works perfect with my HDTV.You can download music, pics, files, pretty much anything, you just can not run any exe. files if you download them. The Chromebook only runs internet based apps, and apps from the chrome store. The chrome store has a great selection of apps to meet almost every need and is growing quickly.While it only has a 16gb SSD hard drive, you pretty much only need it to temporarily hold files while you transfer them to the cloud, that is where all your data is stored. The 320GB hard drive is larger but much slower. I opted for the smaller faster 16gb SSD one as I store everything online and it allows the machine to run much faster.Only downsides are1. You can't pin favorite websites to the desktop, you have to start the browser then pull them off favorites. I'm sure that will be addressed soon as it seems to be a common complaint.2. Also you need to have a wireless cloud based printer to print directly from chrome book. Otherwise you need to access your cloud files from a different PC to print. While it has USB ports, it has limited plug and play, they won't work with printers...yet. USB mice, cameras, cell phones, hard drives all seem to work fine though.3. It is limited with Java plugins but then again not much is in Java anymore so it probably doesn't matter.4. Volume a little low for my taste, but still very audible.5. Not the best looking construction, but it is durable.6. Trackpad might take a little getting used to if you're used to separate left and right mouse buttons, but works great once you get it down (Alt key plus left click, or 2 finger click both work for right click).The biggest question is why buy this over a similar priced windows laptop that can do everything?One answer... speed. While a cheap windows unit can do more overall...there is no comparison between this and a cheap laptop. Side by side, its much quicker, smoother, and is just overall more convenient to use. Think of windows like a pickup tuck, and Chromebook like a sports car. You can do more with a pickup, but it's not as fast or fun as a sports car. That combined with the super quick boot up times, zero maintenance, and cloud computing, makes it so quick and easy, that I actually don't use my more expensive computers unless I have too.Acer vs Samsung Chromebook... Acer is somewhat faster and smoother, and is upgradable. While Acer says 4GB ram max...the chrome OS will actually accept and use any amount of RAM you jam into the 2 slots with a few easy tweaks (I've seen these with up to 32GB of ram running). You can also swap out the SSD and battery for better ones if you want. It has a delete key and caps lock key (the Samsung doesn't for some reason). Battery life on Acer isn't great though.  The Samsung has much better battery life, looks a little nicer, and has a nicer feeling keyboard and track pad  but is not upgradable. It is sealed shut and everything is soldered in. Pick what features are more important to you. There are some other minor details but those are the biggest.While it is not for everyone, if you're looking for a computer to just browse the internet, watch videos, app and internet based gaming, do word and spreadsheets, photo editing, video chat, etc... basically what 90% of people do with a computer anyway...this is the one to get. If you want to play games that you need to install to the hard drive, run a serious business, or have a slow or spotty internet connection this is not the one to get.", "Date": "July 8, 2013"}, {"Title": "Small, light, fast, and cheap.", "Author": "T. Herburger \"31B\"", "ReviewID": "R254O6VNBW5SB9", "Overall": "5.0", "Content": "I actually purchased the Acer C7 Chromebook with 16 GB SSD drive from Bestbuy which was selling it for a cheap $199.Without sounding to dramatic, I have to say this is one of my favorite electronic purchases in a long while.I have an amazing MSI gaming laptop, but it's such a power-hungry beast that the battery life sucks and it's heavy, making it impractical for me to lug it around in my backpack. In essence, the C7 is the opposite of my MSI; it's small and light, making for a highly portable machine; the Chrome OS is clean and simple, and although it may take a bit of getting used to, its well worth it- by doing everything off Google Drive (the Google cloud service) I can work away knowing that all the essays I type and homework I do are not saved locally but rather store in the cloud. This means that should my C7 be lost, stolen, or damaged, all my work will be not be lost. Moreover, at $199, the thought of having it lost, stolen, etc, isn't as worrisome compared to a similar situation occurring with my $1600 MSI. Also, the Acer C7 is upgrade-able unlike its Samsung Chromebook counterpart. In fact, I upgraded the RAM already, link follows for those curious:Kingston HyperX Plug n Play 4 GB Kit (2x2GB Modules) 1600MHz DDR3 SODIMM Notebook/Netbook Memory 4 Dual Channel Kit (PC3 12800) 204-Pin KHX1600C9S3P1K2/4GBlah blah blah... who is this for? Someone looking for a quick, simple-to-use, and highly affordable netbook. Who is it not for? Someone who runs high-end, high-spec programs/games or those who need Windows for said programs.My recommendation? This little guy is PERFECT if you mostly use your laptop for internet-based programs (facebook, email, google-docs, youtube, et al) OR if you wish to have a portable netbook to supplement a desktop or high-end laptop you already own.", "Date": "July 18, 2013"}, {"Title": "The only laptop you'll ever need", "Author": "Laura Cantrell", "ReviewID": "R1IZCCEAZMD59X", "Overall": "5.0", "Content": "I've owned a number of desktops and laptops over the years, and this little Chromebook is the best laptop I've ever owned. It's so lightweight and easy to use, I can take it anywhere. There's no chunky charge cable, the lid closes so easily, there's no button that weakens over time causing it to have problems opening. For being a small screen, it's really easy to read, browse and type. There's no Windows to wait for every time you want to use a computer. Want to search for something, anything? No problem... my Chromebook is on, ready to go, and opens up Google Chrome the moment I open the lid, whether it was shut down or just in standby. I can find things faster on this than any other device I own. And pictures and videos? Not a problem, at all!My son is a gamer, has an upgraded PC and the newest XBOX 360, and before my Chromebook he had the fastest systems in the house, but not any more. I tested this theory out the other day. We decided to look up videos on YouTube at the same time on our different systems. My Chromebook searched faster, found the video faster, and started playing the video faster than his systems. I was thoroughly impressed. I still am impressed, every time I use it there's something new I discover it can do. You can't download software on to it, and it's version of Windows Explorer lists external storage devices a little bit different than Microsoft based systems, but what it does have is amazing.The number of apps that are available for the Chromebook is mind-boggling. There's games, utilities, news, weather, entertainment, and more apps. It even comes with a webcam and microphone built in, ready to use. I can chat with any of my friends online using video call through Google Mail. Everything you can do with Chrome on your desktop, you can do with Chromebook... and more! And being Google, everything sync's... want all your bookmarks from your desktop available on your Chromebook? You got it. You want all your contacts on your Chromebook? Not a problem.Everything you do on the Chromebook is stored online through Google's cloud drive, which is accessible anywhere a computer and the internet are available. I haven't started my new semester yet, but I can't wait to see how my Chromebook handles my online classes. I suppose I might need to access my documents on my Chromebook on my desktop if my professors want MS doc files, but I can still use my Chromebook for all the typing and research and lectures. No longer will I have to use my desktop to download documents or videos because it downloads fast but can't play anything, go to my laptop to watch the videos (it's too slow for downloads, but the graphics are better), then try and figure out what system I should use to write my paper because eventually I'll have to go back to my desktop, because it's connected to the internet (my laptop had issues finding it), so I can actually write my paper and submit it. I am so looking forward to using my Chromebook this semester. It already loads Blackboard faster than any other system I've had.My best friend got me the Chromebook for my birthday from Wal-Mart. There was practically no setup. We have wireless internet at home, I took it out of the box, put in the battery, opened the lid, it asked for the internet's password, then my Google account info, and I was online and using my Chromebook. I've never owned any Apple products, but I have seen them and played with my friends. I would consider my Chromebook a cross between an iPad Touch and a smart phone, with an attached keyboard. But it's so much better than that, because it's a laptop that happens to have cloud based storage. In fact one of the offers I got when I first used my Chromebook was an extra 100 GB of cloud storage space.The speakers are pretty darn good for being a little laptop as well. The screen is an HD screen and everything looks so much sharper and cleaner than any other computer I own. Watching Amazon Prime videos or Netflix is a whole lot easier on my Chromebook, as well. And for those of us who like to play computer games now and then, and might have Steam on our desktop, if you purchase a game on the Chromebook, you have access to it through Steam as well, without having to purchase it twice.It took a little while to get used to how the Chromebook functions. There's no Windows, no start button, no desktop icons, but there is a taskbar, and all the apps you want, every single one of them, is located on the taskbar, in it's own icon. I would definitely recommend starting with the \"Get Started\" app when you first get a Chromebook. Not only do you get to see everything the Chromebook has to offer, but it gives you a feel for using it and practice using the touchpad mouse. The Chromebook is a Linux based operating system. Now I've used Linux based computers and been less than impressed, even if they did have fewer problems than Windows, and never have blue screens or black screens. Because it's all online and cloud based, and its Google, there's never viruses to worry about, there's no constant update reminders, and anything you have stored that's supposedly not Google Chrome compatible? There's an app for that.The Chromebook is so much fun to use, easy to use, and it does have the ability to work offline, if any reason you need to be, you can choose what you want access to when you can't be online. It's the most amazing little laptop I've ever owned, and I highly recommend it to anyone who wants a small, easy to use, lightweight laptop. Once my semester starts and see how handy (or not, but I doubt it) my Chromebook is for my homework/classwork, I'll post another review. I'm anxious to see how it will work if there's any outside software I need, or if I choose to use online textbooks.Cheers, Laura :)", "Date": "August 19, 2013"}, {"Title": "This is the right Acer Chromebook to buy, but identical Acer C7 C710-2833 is cheaper", "Author": "R. Tupelo Schneck", "ReviewID": "R1AED9IQ1FG3FH", "Overall": "4.0", "Content": "Update, December 2013: at this point, almost all users should get the Acer C720 Chromebook instead of any of the C710 models.I love Chromebook and I love the Acer C7; see my big review at Acer C710-2833 Chromebook.The Acer C7 version, C710-2856, is identical to the Acer C710-2833 Chromebook, which is currently available for $199.  That's the right price, so get it instead.  (If Amazon raises the price on the C710-2833, look for either version cheaper at Newegg or Best Buy.)", "Date": "August 5, 2013"}, {"Title": "Perfect for what it is designed for!", "Author": "Beverly Tilton \"bjtilt\"", "ReviewID": "R20DJUY503Q5G9", "Overall": "5.0", "Content": "This is not a full featured, maximum capacity, BUSINESS oriented product.  So don't buy it if you absolutely need MS Office to function or if you MUST load the latest version of Mortal Kombat, because this won't work.That said, if you like to browse social media, check your email, and and even use Google+ Hangouts with your knitting friends (it can't just be me who does that), then this compact, lightweight and inexpensive Chromebook might be for you!I love this Chromebook.  I opened the box, popped the battery in and plugged it in.  Bingo, it was running.  Nothing to download, upload or update.  It updates automatically each time you turn it on.I was already a big fan of Google chrome and Google drive so as soon as I had it running and I signed into my gmail, then it synced to all my other devices.  The Chrome OS automatically loaded my bookmarks.  It was like this brand new device had known me all my life. Whatever I have put in the cloud I can access where ever I go and as light as this is, it can go everywhere. It even fits in my purse like a tablet, but has a keyboard.Can you tell that I am impressed?", "Date": "August 17, 2013"}, {"Title": "fantastic device", "Author": "Louis G. Decker", "ReviewID": "R2X2X9VH1MIA7I", "Overall": "5.0", "Content": "This little critter is great, I would give it more stars if I could. I have had it for about a week now and find that it is great for browsing the internet and streaming AcornTv, Amazon Prime, and BlazeTv. It was something I have been looking for without the cost of an expensive laptop. Don't get confused, it will not replace your desktop which you can print from, but is more useful because it is very powerful and portable.  It comes with a HDMI port which is great if you want to stream movies and Tv shows off the internet. To hook it up to a flat screen TV, all you need is an HDMI cable and then turn the brightness of the laptop screen down and the Flat screen come alive. I have invested a lot of money on blue ray players that stream, black table top boxes that stream, and a Roku which is great, but not as good as my acer C710-2856.", "Date": "October 17, 2013"}, {"Title": "Awesome Laptop", "Author": "Leukocyte02 \"Leukocyte02\"", "ReviewID": "R15SOV074P1Z5V", "Overall": "5.0", "Content": "All that I need to say is wow!  I've had several laptops and none of them compare this chromebook.  It is very fast and I can do anything that I would do on another laptop.  There are apps for everything and there is no need to worry about updates or virus protection.... its all taken care of automatically.  My two year old windows based laptop became slow and unenjoyable to use.  I don't use my computer unless I'm online so this chromebook is great.  I'll never have another windows based pc again.  Chromebook fan for life.  Yeah!!", "Date": "September 29, 2013"}, {"Title": "Great Notebook", "Author": "Laurie Horn", "ReviewID": "R11ZY1JPC4SR5I", "Overall": "5.0", "Content": "I bought this Chromebook as a gift for my brother and he absolutely loves it.  It is just what he wanted to pay bills, order off the internet and check mail.  Great for the money!", "Date": "September 26, 2013"}, {"Title": "Broken Charging Port :(", "Author": "Christian M.F.", "ReviewID": "R1APAIX9X0U6WD", "Overall": "3.0", "Content": "After a month and a half my charging port started acting up. This is very upsetting because I love my chromebook....but if the thing can't even charge anymore, it's pointless.", "Date": "December 20, 2013"}, {"Title": "DO NOT BUY!", "Author": "Kaleb D Vickers", "ReviewID": "R1XKWKPY8MZF2T", "Overall": "1.0", "Content": "This computer is okay until you want to watch movies or play facebook games, It freezes every 5 seconds and gets WAY TOO HOT!!!  Do NOT buy this, opt for anything else!  Very dissatisfied older customer!", "Date": "April 6, 2014"}, {"Title": "Fantastic!!!", "Author": "Brandon Moss", "ReviewID": "RR8I290NQNTDX", "Overall": "5.0", "Content": "I love my new Chromebook! It is super light and it does pretty much everything! It also shipped way faster than I thought it would. I love online shopping, but I kinda get nervous right before I buy something just because you never know exactly what you are getting. However this product is fantastic and I have no complaints :) I highly recommend this to anyone!!", "Date": "November 9, 2013"}, {"Title": "One nifty way around a full laptop", "Author": "MsJake", "ReviewID": "R1NH9IVIU1SBN5", "Overall": "5.0", "Content": "I wasn't sure I was going to like a chromebook, but I'm falling in love.  You open the lid and \"boom\" you're ready to go.  It's light (weight-wise), quick, perfect for emailing, playing on facebook, cruising the web, etc, and relatively inexpensive.  I would rather use the chromebook for travel than my ipad because it's just as convenient and the chromebook is less expensive to replace if something happens.  In addition, I prefer using something with a built-in keyboard as I hate tapping out emails.  I'm still playing with the chromebook to figure out the features but it's not that hard to get around if you're somewhat computer savvy and there are tutorials and helpful tips available...all you do is google.", "Date": "November 6, 2013"}, {"Title": "Just what I needed.", "Author": "Ray Mason", "ReviewID": "R3O2AXGYX350D1", "Overall": "4.0", "Content": "Works as advertised.  Small, compact, has all the apps I require, boots up quick. I got one for my wife also.", "Date": "October 31, 2013"}, {"Title": "Open your perspective a little....", "Author": "P. D. Brown", "ReviewID": "R2I47YK7UNH4TN", "Overall": "5.0", "Content": "I was a bit underwhelmed when I first fired up my new Acer Chromebook.  It is strictly a Chrome browser - no apps, no desktop shortcuts, and really ineffective when not connected to the internet.Two days later, I am loving this thing more and more.  With a few customizations, it is a truly useful tool.  It's the right size, the keyboard is comfortable, get a wireless mini mouse and you're in business.  It doesn't get to 120 degrees in your lap, and there is no fan going a million miles an hour when you're watching Netflix.  I wish the charger were different, micro USB would have been ideal.  As it is there is a cumbersome brick that goes into the wall outlet and it takes a lot of space.  Not much of a quibble.I was put off by having all the \"apps\" running in a Chrome tab.  What would traditionally be called the Windows Taskbar is really just that - a collection of shortcuts.  Selecting one opens Chrome, and a tab within the browser goes to that shortcut.  However, RMB on the icon and select \"Open as Window\" as the icon's default and it opens in its own little space, no tabs or Home icon - looks just like a little app.  Very nice.I've been a big Google proponent for years - Picasa, Docs, Gmail, etc.  I pay for extra storage for my 18Gb of photos in Picasaweb so I never worry about losing my hard drive on my desktop.  Using Picasa on the Chromebook is a no-brainer.  Likewise, there is Google Cloud Print that allows you to print from the Chromebook (or any Chrome browser for that matter) to your own printer.Google Remote Desktop lets you access your PC and remotely display it on the Chromebook.  The one program I can't do without is Quicken, and there's no Chrome or online equivalent.  So I use Remote Desktop and get at it that way.MightyText SMS lets you text from Chrome!  No more annoying Swype mis-spells if you have your Chromebook handy and you're in a text conversation.I highly recommend this (or any ) ChromeBook.  Sorry to say, I did get mine elsewhere for $139 (g r o u p o n)....", "Date": "October 12, 2013"}, {"Title": "BUY THE NEWER, BETTER C720 - and consider refurbished", "Author": "Pilgrim", "ReviewID": "R17Z27L7CXUC1P", "Overall": "2.0", "Content": "Check some of the reviews on the fall 2013 model Acer Chromebook, the C720.  It's been called the closest thing to the perfect Chromebook so far, and has a much better processor, better design, better battery life and better build quality than this C710.The Verge says, \"An update to last year's pretty terrible C7, the C720 is sleeker, lighter, and faster than before. And most importantly, it promises more than double the battery life of the previous model while still improving performance.\"So consider skipping this model altogether and going for the C720.  Both the 16GB SSD and 32GB SSD versions have been available on Amazon (going in and out of stock) at around one hundred fifty dollars as of now.Acer C720-2802 Chromebook (11.6\", 2GB RAM, 16GB SSD)Acer C720-2420 Chromebook (11.6\", 2GB RAM, 32GB SSD)", "Date": "April 13, 2014"}, {"Title": "Does What It was Purchased to Do", "Author": "SaltyDawg", "ReviewID": "R1WOP0997K6REK", "Overall": "5.0", "Content": "This is a convenient device for Internet use....It was not really meant for writing a novelor other hard letter formats. It is durableand I find it handy.", "Date": "February 12, 2014"}, {"Title": "Quick and easy", "Author": "theresa cooksey", "ReviewID": "RDCG16GEE8FO2", "Overall": "5.0", "Content": "I don't usually write reviews, but I am so pleased with this purchase. It does everything I need to do on a home computer in a lot less time.  Granted, I don't ask a lot.  It was well worth it's price.", "Date": "February 4, 2014"}, {"Title": "I do not regret buying this!", "Author": "Bill Thibodeau", "ReviewID": "R4PXLU1II26WD", "Overall": "5.0", "Content": "I purchased this for business travel and couch surfing/working at night.  The build quality is surprisingly good considering the $200 cost.  The trackpad works really well.  It's not a Macbook trackpad but it's better than my HP Elitebook that cost much more.  This is no powerhouse but it streams Netflix and Spotify without an issue.  Simplicity is the name of the game here.  It fires up quickly, you log on and you're browsing in under 30 seconds.  I highly recommend this Chromebook.  Too bad it doesn't have Facetime...", "Date": "October 24, 2013"}, {"Title": "Lightweight and compact.", "Author": "Thomas K Johnson", "ReviewID": "RLEVX2YFGALD7", "Overall": "4.0", "Content": "I bought this as a utility notebook to listen to Internet radio, watch you tubes, etc.  its lightweight and compact and the chrome os is very quick and lightweight as well.  But again I use it for very simple stuff.  Still contemplating putting Ubuntu on it.", "Date": "May 21, 2014"}, {"Title": "Chromebook", "Author": "bdschwark", "ReviewID": "R1XS8B2R8K4XAF", "Overall": "5.0", "Content": "It's a very handy device that runs very fast and is so quick to use...no long boot-up times of a traditional computer.", "Date": "April 28, 2014"}, {"Title": "Great product", "Author": "Joseph Revell", "ReviewID": "R1EA1VERD8VLA4", "Overall": "4.0", "Content": "Excellent product for the price I paid. Start up is quick, syncing feature with the rest of my Google products is handy, and provides a great picture. The only reason I give it 4 stars instead of 5 is due to the fact that the speakers are on the bottom of the unit, projecting downward, not out towards the listener.", "Date": "April 26, 2014"}, {"Title": "great for the price", "Author": "brandon jackson", "ReviewID": "R39HEAF4B2SR7A", "Overall": "5.0", "Content": "i bought this to go along with my phone for travel its small but gets the job done, i like it better than a tablet and the battery is replaceable i get 6hrs now , and i have 8gb of ram", "Date": "April 13, 2014"}, {"Title": "chrome is all you need", "Author": "Consumer_Sovereignty", "ReviewID": "R1XUQJJDSP5E4Q", "Overall": "4.0", "Content": "buy cheap. upgrade cheap. a steal. WHy overy pary for apple, windows, etc. when everything you do is browser based.", "Date": "April 1, 2014"}, {"Title": "Quality Chromebook for its Price", "Author": "J.", "ReviewID": "RE0PK3JGDQK1Y", "Overall": "5.0", "Content": "The Acer C710-2856 (or any C710/720 model) is an amazing chrome book worth its money. If you are looking for an inexpensive and easily replaceable laptop this is the one. I own a MacBook Pro at home and was to afraid to actual travel with it and end up breaking it. This Chromebook makes up for that. Also I have found ChromeOS to be more useful than Windows for sure. If your considering this Chromebook I would purchase it for sure.", "Date": "March 12, 2014"}, {"Title": "Easy to use", "Author": "Trisha", "ReviewID": "R1KD28DGQOCWP1", "Overall": "5.0", "Content": "My husband is not tech savvy at all and he simply wanted something to browse the internet with. This is very light so he can use it anywhere he is and very simple to use.", "Date": "March 11, 2014"}, {"Title": "Good price", "Author": "Kindle Customer", "ReviewID": "R39YFGTJBBK6DC", "Overall": "4.0", "Content": "This laptop works well, but arrived with lots of scratches on the case and actual food particles between some of the keys.", "Date": "March 10, 2014"}, {"Title": "Great for everyday use", "Author": "mcjones", "ReviewID": "R20XXKKPFFTRF8", "Overall": "5.0", "Content": "I was looking for something small, lightweight with not a lot of cords. This is it. I use Google for pretty much everything at work, so this is perfect if I need to continue my work at home using Google drive. As a public school speech language pathologist, that happens A LOT more than I would like. It took me a minute to get used to not having Office, but I did and it's all good. Can't beat the price. I really love it. I'm very happy with my choice.", "Date": "March 9, 2014"}, {"Title": "HOW DO t GET THIS THING TO MAKE COFFEE???", "Author": "Gary Vavzycki", "ReviewID": "RZ9292Z21ZRDP", "Overall": "5.0", "Content": "GREAT MACHINE,fits my needs,and good for most people (I was in the buz years ago)Only downside...got no paperwork- but found no instructions needed.", "Date": "February 24, 2014"}, {"Title": "very pleased", "Author": "amanda younger", "ReviewID": "R2M3TM1ALLEGR5", "Overall": "5.0", "Content": "very pleased with the chromebook. my husband is able to access al his school accounts on it and that was why I got it.", "Date": "February 15, 2014"}, {"Title": "Acer 11.6\" Laptop", "Author": "Todd M. Kern \"comoman\"", "ReviewID": "R3OQRERAK8Z59D", "Overall": "5.0", "Content": "Mother-in-law and Father-in-law loves it works good for what they needed.  easy to operate.  Small enough for them to store when not in use.", "Date": "January 19, 2014"}, {"Title": "my laptop is very good", "Author": "jack g.", "ReviewID": "R11FGRFQGVLADI", "Overall": "5.0", "Content": "I really like my laptop I have no problems with it. Its easy to work with.. I give amazon a  very big five on it.", "Date": "January 12, 2014"}, {"Title": "Good buy for the money", "Author": "Carmine R Graziano", "ReviewID": "R3GWHQWAO93PYS", "Overall": "4.0", "Content": "Very nice computer! It powers up super fast. Only warning I would give to someone wanting to buy this is that it does not have windows, so you can't install office on it. However, there are apps you can download that are comparable to Microsoft Excel, word, etc. This is smaller than your average laptop so it can easily be carried in a backpack or bookbag. Very lightweight and the screen display is crystal clear.", "Date": "January 5, 2014"}, {"Title": "Great starter for the 10 yr old", "Author": "dave alexander", "ReviewID": "R3K1SIS46OJYQB", "Overall": "5.0", "Content": "Best Xmas present I could have ever purchased for my 10 yr old daughter . Easy interface and just what she needs to get started and I can pull her out of the house and get her outside", "Date": "December 29, 2013"}, {"Title": "good for me and convenient", "Author": "David L.", "ReviewID": "RLZLD8S8SEBRR", "Overall": "5.0", "Content": "Does everthing i want.  I cant keep it out my ol lady hands.  It is my first lap top.  My daughters is an exspensive hp and she likes the acer", "Date": "December 25, 2013"}, {"Title": "great web surfer", "Author": "dkern7656", "ReviewID": "R1E9HSHAENXW0I", "Overall": "5.0", "Content": "this is the berries for web surfing. very fast. I also watch on line videos with it. works great for that too. got mine at walmart for 199.I have been nothing but pleased with it. however just like others have said, this is not a full service laptop. be sure you know what you are buying first. but for me it is great.", "Date": "December 9, 2013"}, {"Title": "great product", "Author": "Tejpaul S.", "ReviewID": "R2PRXNM525OR9O", "Overall": "5.0", "Content": "works good n left it in a safe placea great compact laptop.and it works just fine.perfect for that price", "Date": "December 7, 2013"}, {"Title": "Love my chromebook.", "Author": "Helena JB", "ReviewID": "RWSR6NP2AUP60", "Overall": "5.0", "Content": "The price was ok.Very easy to use.The mouse pad surprisingly is very user friendly.Only drawback, it gets hot quickly.", "Date": "November 19, 2013"}, {"Title": "Chromebook", "Author": "Vonnie Sue Martin", "ReviewID": "R31570JPWQ69TQ", "Overall": "5.0", "Content": "Love it!!!! Lowest price in store $199 plus 9.25% tax.  It is great for reading and travel. Works great w/ mouse.", "Date": "October 23, 2013"}, {"Title": "Acer C710 Chromebook", "Author": "vanhorn1050", "ReviewID": "R1RKJ7JCW70KQ5", "Overall": "5.0", "Content": "This computer is all I thought it would be. I would have appreciated a better explanation of how to connect to the Internet by Wi-Fi than the included instructions.", "Date": "May 24, 2014"}, {"Title": "Nice", "Author": "Greg Watson", "ReviewID": "R249MT7TB65H3A", "Overall": "5.0", "Content": "This is a great device for the money. If you know what it's capable of and what you're looking for you won't be disappointed", "Date": "April 29, 2014"}, {"Title": "Exceeded what I thought.", "Author": "Joanne Kost", "ReviewID": "R2Y9GSBF3KC8NG", "Overall": "5.0", "Content": "This product exceeded expectations.  It does more that I thought it could.  Speed with WIFI is super. I am learning more all the time. It is so nice to be freed from my PC!", "Date": "April 3, 2014"}, {"Title": "Amazing", "Author": "McKenzie Spencer", "ReviewID": "R334O8A670Z2WV", "Overall": "5.0", "Content": "I love this chrombook. It is perfect for internet surfing, research, and having Google docs on here makes any word processing projects I have super easy. I couldn't be happier with this computer.", "Date": "March 17, 2014"}, {"Title": "Nice", "Author": "For my kids", "ReviewID": "R23JIK89IRQBX6", "Overall": "4.0", "Content": "This was a nice computer. it was bought for my son for Christmas. It is a little to navigate through, but the seller is very responsive", "Date": "March 8, 2014"}, {"Title": "Small but nice", "Author": "Lindsey Dillon", "ReviewID": "R26FWIPN8PA9Z5", "Overall": "4.0", "Content": "It was a great deal. Not to computer smart but am glad I got this 1 it is easy to work. Even my kids can figure everything out on it.", "Date": "February 26, 2014"}, {"Title": "A solid laptop with a very reliable Chrome Op system", "Author": "Michael Sielicki", "ReviewID": "RMOK5VMLJ27J7", "Overall": "4.0", "Content": "It is a small screen at 11 inches, but this is one excellent laptop that is absolutely rock solid with the Chrome operating system.  No more anti-virus software, or all the nonsense of Windows.  It only gives a browser but that's all that I need.  Everything in the browser works great, video, displays, etc.Printing is an issue in that only a wireless printer can be accessed, and Java displays (which I find are few) are not supported.  I rarely ever use my Windows machine but I did get a larger 14 inch Chrome laptop for my older eyes.", "Date": "January 28, 2014"}, {"Title": "its nice", "Author": "Coco", "ReviewID": "R2LFYEJVTJ496M", "Overall": "4.0", "Content": "This is a cute little laptop got it to carry in my pocket book, since I cant do that with my 15¨.  When you get it just make sure the OS is installed properly then you are on your way.  Works nice.", "Date": "January 2, 2014"}, {"Title": "so far so good", "Author": "truck300lb", "ReviewID": "R3SRKUQ2UXL87S", "Overall": "5.0", "Content": "so far so good seems to work alright if it last's it will be a good deal you will need a hard case it scratches easily  good", "Date": "December 25, 2013"}, {"Title": "Read reviews before purchase!", "Author": "c j rock", "ReviewID": "RVE4UQXEZKR53", "Overall": "2.0", "Content": "Can not use skype or download photos from my IPhone . Chrome store too limited! Can't get help with tech questions. Have to put in email and password with every use. Speakers are too weak and distorted. Very disappointed . C  J", "Date": "March 4, 2014"}, {"Title": "...", "Author": "SirTheory", "ReviewID": "RCBVC9AVT0QKC", "Overall": "4.0", "Content": "I've been an Apple guy my entire life. Over the last few months my Macbook Pro from 2006 started spiraling into non-functionality and I'd been looking for some kind of cheap replacement. Because as beautiful as modern Macbooks look these days, I ain't got that kind of dough, right?Despite the more limited nature of Chromebooks, I found the $200 entry point (this model is slightly cheaper in-store at the moment, ymmv) attractive. And most of what I do with computers these days is web-based, anyway, so I was pretty cool with saving money for a more limited product.I was debating my options (laptop, Chromebook, limping by on an increasingly hobbled Macbook Pro) when I read that it was entirely possible to load Ubuntu (a free Linux-based operating system) onto a Chromebook, making it an entirely functional laptop. Well, that was a game changer.Chromebook out of the box:Boots up swiftly. Requests network information (for me it was putting in my wifi password). Enter (or create) Google login info. So essentially if you have a Gmail, Google+, etc, account, you're already 90% of the way setup for a Chromebook. And then it launches.The transfer was creepily seamless. Chrome was my default browser on my Macbook and Google automatically transferred over my plugins/extensions, bookmarks, and even my web address autofill (like when you type in \"amazon.com\" but it already fills it in when you've hit \"am\"? Yeah).I can't specifically compare Acer's version of the Chromebook with other Chromebooks, but despite choosing the cheapest available Chromebook I don't really feel like I'm missing anything. I did a lot of specs comparisons and, at least among the other Chromebooks in the under $400 range, felt like the Acer C7whatever line was the way to go.Part of the specific allure of Acer is their utilization of Intel instead of ARM. I'm not nerdy enough to know what that means on a technological level, or even what ARM stands for, but I do know ARM is what other Chromebook manufacturers use instead of Intel. For me it had implications on being able to load full Ubuntu vs a more stripped down version easier to run on ARM technology. I am not a stripped-down kind of guy. So I highly preferred using an Intel Chromebook. Plus, cheaper.It took me about 50 minutes after launching my new Chromebook to be completely setup with Ubuntu. There are some fantastic guides on the Internet that break the process down into easily understood steps. Most of that timeframe was waiting. Waiting for the download. Waiting for it to install. Waiting. The actual steps were surprisingly easy. Intimidating at first since it requires launching Chromebook's terminal, but the guides say exactly what to type.So within an hour of plugging my Chromebook in, I had a fully functioning operating system loaded on my laptop. Ubuntu has a pleasing GUI that feels relatively comparable to using an Apple or Windows computer. Instead of a bottom-dwelling dock you've got a sidebar. And for anyone who has used the App Store (or, perhaps more closely similar to Cydia) the Ubuntu Software Center will be pretty comfortable to navigate and enabled me to download LibreOffice (a free, open source alternative to MS Office), VLC Media Player, a better web browser, etc. (And there is also Ubuntu versions of Spotify and Minecraft, meaning that it's relatively easy to get set up with some of your old standard applications.)Now, the Acer Chromebook is slightly more limited than a regular laptop would be, even running Ubuntu. And here's why:1. I guess we should be happy that a cloud-based laptop comes with any hard disc space at all, but even so 16 GB is pretty tiny. On the plus side, both ChromeOS and Ubuntu readily accept SD cards and external hard drives. Today I went out and bought a 1TB external for $70. Which still puts me under the price of a regular laptop.2. The trackpad is really bad. Maybe I've been spoiled from using Apple all my life, but this thing is kind of frustrating to use. This, right here, is the main reason I went 4-stars instead of five. Like, I can tolerate it enough most of the time. But when it comes to any kind of drag-and-drop type operation? Uphill battle, my friend. Up. Hill. For typical web browsing-type stuff it's generally acceptable. The one finger drag and tap does the job. But when you have to hard click? It gets janky. And it's all too easy to tap the trackpad with the side of your hand as you type, causing it to register as a click, and all of a sudden your webpage is jumping all over the place. This is easily fixed by plugging in a USB mouse. Luckily I've got an Apple one hanging around that works just fine with both ChromeOS and Ubuntu. But it wouldn't hurt to factor a mouse into your purchase if you don't already have one.3a. As much as Ubuntu transforms a Chromebook into a fully functioning laptop, it's still not the same as running Apple OS or Windows 7 (or 8, or whatever). I do a lot of Googling to figure out how to do things (\"Ubuntu app for instant messaging\", \"Ubuntu app for screenshots\", etc) and to figure out alternatives to the major OS standards (\"Ubuntu alternative to iTunes\"). And typically these programs lack a bit of polish and the aesthetically pleasing quality of their counterparts. However, they're still functional. They do the job.3b. Ubuntu also requires a bit of terminal use. Typically this happens when you do a Google search for program recommendations, and some blog recommends, say, Springseed (a stripped down notepad-type application). Sometimes the program is available on Ubuntu Software Center, but sometimes it isn't. And so the blog (or whatever the info source is) will tell you what to put into the terminal to download the program. You can simply copy-paste the lines, but there is still something about it that feels intermediate, even for how simple it is.TL;DR I really like my Chromebook, especially with Ubuntu installed. For the price, I can't complain with the combo pack of Acer Chromebook + Ubuntu + external hard drive.", "Date": "February 8, 2014"}, {"Title": "Junk", "Author": "Charles H. Heil \"scooterdog\"", "ReviewID": "R32MWTRRJ1N582", "Overall": "1.0", "Content": "I'm not a computer person. I thought it would do what I wanted to do. Basic stuff. I can't even print pictures with my printer unless I pay for the Cloud. So if that info isn't given before you buy it you're screwed.", "Date": "May 27, 2014"}, {"Title": "BIG MISTAKE!", "Author": "sharon morris", "ReviewID": "R15E47W22X0PV6", "Overall": "1.0", "Content": "IT STARTED ACTING STRANGE AFTER WEEK 1, THEN BY WEEK 3 IT COMPLETELY IMPLODED - THE ONLY THING LEFT WAS A GIANT ERROR MESG THAT SAID THE ENTIRE CHROME OS NEEDED TO BE RE-INSTALLED (which obviously only the Seller would be able to do)  and I've not rec'd a single email response from seller regarding returning for refund!  I still have it sitting in original box with no use for it at all :(", "Date": "May 23, 2014"}, {"Title": "The perfect gifts for graduate.", "Author": "jean m walsh", "ReviewID": "R2F5MPPHCIZF1F", "Overall": "4.0", "Content": "I bought two of the Chromebooks and gave them as gifts for our twin granddaughters graduation. Having asked them, they seemed to be very pleased with them. The portability will be perfect for those jaunts between college classes. It is just what they needed.", "Date": "May 6, 2014"}, {"Title": "Pretty Nice Chromebook", "Author": "gds", "ReviewID": "R240ITUFC3AQ4Z", "Overall": "5.0", "Content": "This is my first Chromebook and I am really enjoying it. I enjoy the size. It fits in my purse. It's really fast!  Love the keyboard. Just the right size for my hands. Good battery life.  Yes, it's powered by Google but I knew that before I purchased it. I'm one who read reviews and base my decision as to whether this would be something that would work for me. So far I am happy with my purchase. It's doing everything  I expected it to do. If I could change one thing  on the Chromebook that  would be the light contrast. But it's not a major issue, just more of a personal preference.So if you're looking for a small compact, built for speed Chromebook, I would recommend this one.", "Date": "November 16, 2013"}, {"Title": "could not not do anything.horrible", "Author": "Tyrone L.", "ReviewID": "R1P0JNEE5T0X5O", "Overall": "1.0", "Content": "i hate it with a passion,google already sucks,this chromebook is supposedly always on the latest version and software.i cannot watch my mnetflix,do school or anything,the video and everthing is slow and it never really actually loads a page correctly if at all.i will never buy another chromebook,i will never recommend a chromebook,i do not trust google.i am honestly thinking about deleting all my google accounts and sticking to Microsoft and yahoo.as well as yandex.Google  search is slower than ever google chrome doesn't work its way slower than internet explorer.in my opinion google stock market is going to crash dramaticly.google company needs to shut down there business you guys are all about money and getting as much of the worlds Info.you are taking over everything.you took over youtube,what next stop you have severe privacy issues and a lot of malfunctions in everything you have put out.Give up now please. I hate you google never  again will I ever use any product of yours.u lost a really good customer", "Date": "May 25, 2014"}, {"Title": "I have no idea what happened.", "Author": "Nat", "ReviewID": "R1XHJDMLD9UFK3", "Overall": "3.0", "Content": "Rewriting this review but I'm gonna keep the rating the same. Somehow after I wrote this review, this laptop completely changed. I've barely ever had any freezes, the videos I want to watch always loads, and I can have many different tabs open at a time with it not slowing down at all. When i first had this I would have to restart it again and again just because the whole thing would freeze. I really don't know what happened but it's a lot better now. Although I still wish it could read files and it had a DVD drive, thinking about it, the price I got it for was worth it.", "Date": "February 3, 2014"}, {"Title": "Not suitable for outdoors", "Author": "Ronnie McCurry", "ReviewID": "R34A8HCVR5BXPU", "Overall": "3.0", "Content": "Bib mistake on my part. I wanted to use this in my garage and outside under my carport. Wifi works fine either place. It is really fast and convenient to use but not suitable to use out doors. Unlike my Kindle you cannot see this screen and not much use for me.", "Date": "November 15, 2013"}, {"Title": "Kind Of Disappointed", "Author": "Irenia Taylor", "ReviewID": "RVYZD3NV09TOE", "Overall": "3.0", "Content": "Don't get me wrong the chromebook is great..But It doesn't support Microsoft Office and it's mandatory that I have it.", "Date": "December 21, 2013"}, {"Title": "Eh not bad", "Author": "Eddie Vidal", "ReviewID": "R1C24QN9NQ05JF", "Overall": "3.0", "Content": "I like it. For what you're paying you really can't go wrong. The laptop runs smooth and plays videos in high quality.Now this is what I personally don't like; Literally everything runs through google chrome, Limited apps in the google store, setting up a printer is a B****, most of this laptop runs through google cloud.Honestly it's a fair laptop although you really can't call it a laptop. I would call the chromebook an under-developed tablet. I recommend it to students and people that are not used to handling computers.", "Date": "November 13, 2013"}, {"Title": "Worthless", "Author": "Chaz Scovel", "ReviewID": "R2VQLTSIQ13QJ1", "Overall": "1.0", "Content": "If you are looking for a laptop that can do more than web searches look elsewhere. Don't waste your money.", "Date": "November 27, 2013"}], "ProductInfo": {"Price": "$219.00", "Features": "Screen Size: 11.6\"\nScreen Resolution: 1366 x 768\nProcessor Type: Intel\nProcessor Model: Celeron 847\nProcessor Speed: 1.1GHz", "Name": "Acer C710 Chromebook (11.6\" 2GB) C710-2856", "ImgURL": "http://ecx.images-amazon.com/images/I/512TFnBpmVL._SY300_.jpg", "ProductID": "B00DNGRL82"}}