{"Reviews": [{"Title": "It's worth reviewing what you get with the G750JX-TB71", "Author": "Steeler Nation \"Peter\"", "ReviewID": "R1F7OIFP9ZMB95", "Overall": "5.0", "Content": "I purchased this from TigerDirect after comparing G750JX models and here are my impressions after one week with no regrets.  You save $400 compared to the G750-JX-DB71 and get better components and upgrade options. First, I was willing to sacrifice the 256 GB SSD which wasn't worth the premium price to me considering current prices of SSD drives.  Both models give you 16 GB RAM, but readers report that the JX-DB71 comes with 4X4 GB DDR3 SDRAM with all 4 slots occupied, while for the cheaper JX-TB71 you get 2X8 Gb DDR3 SDRAM with 2 empty memory slots which I immediately upgraded with 2 additional 8 GB sticks to max out 32 Gb RAM.  The G750-DB71 comes with a 5400 RPM 1024 GB HDD, while the G750JX-TB71 comes with a faster slightly smaller 7200 RPM 750 GB HDD but with an empty drive bay which I placed a WD 750 GB Black (5 yr warranty).  I personally like the increased HD space with faster drives on this desktop replacement gaming laptop and reserve the SSD drives for my ultraportable SONY Z3 (another sweet machine that I use for cross country and intercontinental business travel).  Both models also come with the premium 3 GB Nvidia GTX770M card and thunderbolt port and, of course, the 4th generation i7 Haswell Intel processors. I purchased this to replace my 3 year old HP Envy 17 which I enjoyed but recently bit the dust due to the extreme graphics chip heat and poor ventilation design.  The ventilation on the G750 product line is outstanding and it really stays cool despite throwing everything at it (you can see temperature profiles in other online reviews which are real).  Another important feature is the ability to run 3 full HD screens which is why I used the Envy 17.  I use the thunderbolt port to drive an HD DisplayPort monitor and the HDMI port to drive another HD monitor giving me 3 side-side 1920X1080 extended desktops. This was able to handle video editing and Photoshop/Illustrator work easily all at the same time.  I no longer play games seriously, but installed Call of Duty 2 and World at War, and Brother in Arms Hell's Highway and they run beautifully in full HD settings just messing around.  I'm going to try Battlefield 3 next.  Overall, I'm glad I purchased this model over the DB71 model and saved $400 dollars which gives you an SSD drive; larger, but slower HD; and inconveniently uses up all the memory slots forcing you to waste memory cards if you want to max out your RAM. I spent an additional $120 to get 2X8 GB sticks from Crucial and $75 from Amazon to get a WD Scorpio Black 750 GB drive.  For a total of ~ $1700, I have a Haswell G750 laptop with premium graphics and 32 GB RAM, 1.5 TB of fast HD space. Enjoy!I forgot to also mention that this model also includes Bluray combo drive which the $1900 D71 model does not.  Even better, when I checked the device manager, it seems that the drive is a Bluray writer as well, but there's no specific documentation that I could find and I don't burn Bluray disks.  Bluray movies on this non-glare HD screen are a pleasure to watch.  Another big reason I'm glad I chose this model.", "Date": "August 5, 2013"}, {"Title": "Great computer, with some slight annoyances", "Author": "Amitoj S.", "ReviewID": "R1ECVVSQHWLP2B", "Overall": "4.0", "Content": "Most of the other reviews have already done a pretty good job of discussing the great things about this laptop, so I won't waste any time repeating that.  I've owned it for nearly two weeks already and I don't regret my purchase at all. However, there are some cons here and there so I figured it'd be a good idea to post these here for everyone to be aware of before purchasing.Cons:- Aluminum surface around keyboard and mouse is a fingerprint magnet and somewhat difficult to clean. It doesn't take fingerprints in the same sense that a glossy screen would, but when you touch the metal surface your finger will leave a dark mark on it and the only way to clean these marks is by rubbing them pretty hard with some sort of microfiber cloth or rag. Thankfully, ASUS provides a small cloth with the laptop so cleaning isn't a major issue. However, it's still a bit annoying considering how great the laptop looks when clean. This is probably my biggest complaint.- Trackpad isn't great. The mouse buttons, while independent from the tracking pad, are somewhat mushy to press and don't give a very satisfying \"click\". To many people, this won't be much of an issue either since with a machine this big you'll probably be using it on a desk where an external mouse takes care of this. On the bright side, there's a keyboard shortcut for disabling the trackpad so in case your palm brushes against it while typing or gaming it won't affect what you're doing. I'm not sure if this is a standard feature since this is my first Windows computer after using exclusively Macs, but this was a welcome addition for me.- ROG badges are located below the right side of the keyboard and on the back of the display. This is probably just personal preference, but I feel the laptop would look a bit more polished without the ROG insignia everywhere. Really minor complaint.- HDD & RAM bay underneath the laptop does not close completely. Near the top of the door, it refuses to lie flush no matter how I try to push it down. This may be just a problem with the one I got, but it's not big enough of a deal for me to ask for a replacement.UPDATE: I was informed that this is an issue with my specific product, so it should not be a concern for anyone else. Nevertheless, I will leave that up here just as an FYI.- Comes with a lot of bloatware. ASUS tacks on a ton of weird apps that many people would never need, and adds McAfee in addition. I uninstalled McAfee shortly after getting the laptop but haven't yet bothered figuring out what the rest of this software does.- Power cord goes into the right side of the laptop. I find this a little annoying because the cord is pretty short as it is, so I have to run it down the right side instead of wrapping around the back of the laptop and because of this sometimes I brush against the cord with my mouse.- Keyboard backlighting is uneven, especially on keys with larger icons, such as the Windows key.- When using headphones or external speakers, there is some static in the background. It's mostly only audible during quiet audio or when the volume is turned up very loud. May be due to interference with other components inside. A cheap $6 USB sound card fixed this issue completely for me.- When closed, there is nothing attaching the \"lid\" of the laptop to the base. Many laptops have some sort of mechanism that locks the two parts together when the laptop is closed so the lid isn't opening by itself (For example, Macbooks have a magnet that attaches the lid to the base) but with this laptop the lid has the tendency to wiggle open a little bit as there is nothing keeping it together.- Windows 8. Again more personal preference, but I know the OS is a selling point for a lot of people and many prefer Windows 7. I'm not sure how easy it is to downgrade as I haven't tried; for my needs Windows 8 works fine.Despite all these little annoyances, I really love this computer and I'm glad I purchased it. I'd give it a 4.5 but as Amazon does not allow that the review will show up as a 4/5. Most of these cons will only affect some people, and a lot of them should not be deal-breakers but it's good to know ahead of time what to expect. I'll update this review in the future if I come across any other complaints, or if I end up re-evaluating anything. Thanks for taking the time to read this!", "Date": "August 29, 2013"}, {"Title": "Good price for G750JX", "Author": "Daniel Dao", "ReviewID": "RJBA1954IBG22", "Overall": "5.0", "Content": "The G750JX with GTX 770M is a great laptop. But the DB71 model is pretty expensive due to the SSD. I believe many people are willing to buy the G750JX without the SSD since everyone can purchase an SSD with cheaper price and higher speed. So this model is a good choice.This model also comes with 16GB Ram (2x8GB), which means you can upgrade to max 32GB with 2x8GB. This is one of advantages since the other models come with either 2x4GB or 3x4GB or 4x4GB. So this model is great for upgrading to max 32GB without removing the original Ram and buying 2x8GB RAM more.Also, it comes with the bluray drive, which even isn't included in the expensive DB71 model.The only disadvantage is the wireless card. This model comes with the 802.11n wireless card instead of 802.11 ac wireless card. So for anyone who wants to use 802.11ac wifi network will have to buy either a USB adapter or 802.11ac wireless card. I've asked Asus representative about replacing wireless card and they said I could replace the 802.11n wireless card with the 802.11ac without voiding warranty as long as I didn't damage anything during the upgrading process.Generally, this is a great model with reasonable price. It is only $100 higher than the G750JW ($1399) and you can get the GTX 770M with bluray drive also.Good price and great model!", "Date": "August 9, 2013"}, {"Title": "A Sexy Beast", "Author": "Benjamin Kalinosky", "ReviewID": "R2MA6P9EPHLG1C", "Overall": "5.0", "Content": "I've been using this notebook for about two months now.  I can have an enjoyable experience (~30 frames/sec) with Crysis turned up to extreme settings (without anti-aliasing).  Every game that I own, such as SimCity, Bioshock: Infinite, and Guild Wars 2, all run at 30-60 FPS at max settings.  This computer has the second best notebook graphics card available and is very reasonably priced at $1500.  It is a bit bulky, but in return it has a full keyboard and number pad, a large mouse pad, and 4 USB 3.0 ports.  The 7200 RPM primary hard drive was an attractive feature (Gaming laptops should never come with a 5400 RPM hard disk), although it comes with Windows 8 (as do all).  I replaced the primary with a solid state drive and installed Windows 7.With the additional $100 solid state, the Windows 7 Experience Index components are:7.6 - Processor7.9 - Memory7.7 - Graphics7.7 - Gaming graphics7.9 - Primary hard diskI have no regrets.", "Date": "September 21, 2013"}, {"Title": "Just Great!", "Author": "Paulo", "ReviewID": "R3D4C4VT31YIOS", "Overall": "5.0", "Content": "Just adding some info on the specs:My Asus G750JX-TB71 from Tiger Direct (by the way, fast delivery) came with:-Blu-ray optical drive (don't know if it burns, don't care).-Asus Usb Charger Plus port. This means that the first usb port on the right side will charge your phone even if the laptop is off.Well, the rest you already know.Go for it, you will not regret it!", "Date": "August 15, 2013"}, {"Title": "Great Machine", "Author": "MBakir", "ReviewID": "R2MD3NVVI6BHUX", "Overall": "5.0", "Content": "I was on the market to buy a powerful laptop (aka gaming laptop) I kept reading reviews about different laptops and brands (Alienware, MSI, Schenker and Asus) so finally I decided on this laptop because of the balance between specs, design and price.I've had this laptop for a month now and it has been running perfectly and i added a Samsung SSD. here are some points to consider why.Screen:The screen is beautiful and big and non reflective, loved playing league of legends, call of duty and guild wars, watching LOTR blu ray.Size and weight:This is a matter of preference, this laptop is definitely big but compared to other gaming laptops i find it's size and design better, and for the power inside it you have to go to that size (4 memory slots, 2 HDD slots), as for the weight it's heavy 4.8k but for me it's ok.Sound:the sound is good not super however it has a built in headphone amp which is great with my Sennheiser HD 558, but it's ALSO A DOWNFALL FOR SOME REASON ON SMALLER IN EAR HEAD PHONES IT PRODUCES STATIC.Graphics:So far i ran everything on it perfectly you can find the graphic card benchmark on [...]Hard Disk:I added a samsung 840 SSD to boost performance and its great (tested performance in unzipping file, 3x the speed of normal 7200 RPM HD)Cooling:the cooling is great in this laptop i work with the laptop on my lap and it doesn't heat and runs silent barely audible, the only time i started to hear it was when i ran a game on high specs and it's on my lap with airway a little blocked.", "Date": "September 8, 2013"}, {"Title": "Awesome Gaming Laptop!!!", "Author": "Marlon D.", "ReviewID": "RVKBCXK9KNEOI", "Overall": "5.0", "Content": "This is my first gaming laptop I purchased mainly for games and video editing. I had other choices before I bought this laptop at the end the Asus stands out. I added a SSD (crucial) drive I'm was  that Asus included the screws and caddy or enclosure with it. There's an extra slot for the second drive which is ideal for adding my SSD. The challenge for me was the BIOS settings it was a big challenge for me in setting it up as my primary drive (OS) took me 2 days to figure it out. Then finally I was pleased with the results and currently enjoying the speed that delivers as my primary booting time is 25 seconds to get on the windows environment. If you plan to install a SSD drive I advise to back up your files and do a lot of research in the BIOS to utilize the speed. I highly recommend that you buy this laptop have fun.", "Date": "August 18, 2013"}, {"Title": "Incredible Machine", "Author": "Amazon Customer", "ReviewID": "REOGBXF2AEXAF", "Overall": "5.0", "Content": "I own a 5 year old Asus 17\" laptop with 4G memory, two 250G drives and a high res screen (1920 x 1200).  It's been a wonderful performer for me but as I do more, the older technology shows, like when I'm running 5 or 6 programs and a virtual operating system in the background, it starts to labor.  And of course it's always fun to shop for the newest technology.  The laptop is an M70VM-C1 and I've had no issues with it.  The only downside is it's nearly 9 pounds and only gets about 2 hours on a battery charge.I was reading the review by steelernation and my setup is the same; I added another 16G of Crucial Ballistix memory and an additional 750G hard drive.  I don't know that I'll ever really \"need\" 32G of memory, but for under $200, why not?In a nutshell, this machine is a powerhouse; the Haswell series processor benchmarks about 5 times faster than what I had.  Coupled with more memory and 4 cores/8 threads, it's hard to tax it.  I run Ubuntu linux as a dual boot (more on this later) installed on the 2nd drive.  I was running a constant data transfer from my old machine, mail, chrome, several PDF's open AND was running four virtualbox operating systems as well (ubuntu 13.10, centos, mint and windows 7).  The machine was not even breathing hard; NO discernible slowdown, the 8 core/threads pretty much flatlined at 10% and less than 20% of the memory used.I have not run games yet, don't have much time, but I have several that I'll try and report back.So here are the Pro's and Cons:Pros:1. Fast, fast, fast, fast.  Did I mention fast?  When I loaded up all the virtual machines, the fan didn't even increase in speed; very cool.2. Comes stock with 16G of fast memory (which is probably as much as anybody needs)3. High res screen, 1920 x 1080.  On the 17\" form factor, it's very nice on my old eyes.4. Backlit keyboard5. Good quality construction, good screen, Asus production qualtiy and reputation6. Keyboard keys feel good.7. Does \"not\" have a touch screen to go haywire at some time.  It's not a smart phone and I could care less about swiping  (see windows 8 vitriol below...)8. Blueray drive.  I probably won't use it for movies, but it's a nice feature to have.Cons:1. Also heavy, about 9 pounds like may last one, but I don't care too much about that.2. Windows 8.  Sigh.  Enough has been said about this monstrosity, so I won't repeat it here.  However for me, it's just a vehicle to run the occasional Crysis or Call of Duty game, so I elected to just leave it rather than go through the pain of downgrading to windows 7. (see UEFI below). 99% of my time is with Ubuntu linux on the 2nd drive.  When I need to run a windows app like excel or quickbooks, I have win7 running in a VM, faster than it ran native on my previous laptop.I'll add that if you just use windows and are OK with version 8, that's easiest.  But if you want to toss it and downgrade to win7, AND are not pretty fluent with bios and UEFI, be prepared for some frustration.  It's not at all intuitive like the old legacy bios were.  On a desktop I purchased recently, I simply could not run the windows 7 install disk no matter what I did, so I just wiped the whole disk clean and installed linux.Also, if you purchase more memory, make sure you get DDR3L DO-SIMM, PC3-12800 (1600) (204 pin).  The \"L\" designator is for low voltage; you need 1.25V or 1.35V and NOT 1.5V.  16G cost me $170.So, lots of pros and no real cons, at least for me.  This is one powerful laptop and you won't be sorry.EDIT, 12/6/13: Ran some games. Cyrsis is smooth as butter, COD the same.  It lives up to it's ROG moniker.", "Date": "October 9, 2013"}, {"Title": "good laptop except WIRELESS CARD", "Author": "SY", "ReviewID": "R3LTH480VXE5RP", "Overall": "3.0", "Content": "This is a good laptop, I got mine, added 2x8GB extra memory, total 32GB memory.(Yes I need that, I am not a teenager who just run games with it) I also added SSD!I think there is a serious problem with this laptop: Wireless Card!This comes with 1x1 Atheros Wireless N card. Card is said to have low power consumption (oh yeah, very important while you are running GTX 770 hot with 125 Watts) Card is also single band 2.4Ghz only!I have a 5 year old Asus F8 laptop which has single channel Wireless N. So this laptop blows my old laptop with everything except it has same wireless card! THIS SUCKS ASUS! Central storage and cloud are all we use right now. I take backups regularly over wireless and why should I use 5-6 year old technology with a brand new laptop?Decent(Intel) dual band Wireless AC cards are around $30. So Asus didn't have money to use those. I tried to upgrade mine but it's really hard to open this up so I just asked my distributor to do it. Still I have to ship it back, wait with no laptop. I already paid more than $30 to ship this back for an upgrade! All because ASUS decided to put that nonsense wireless and save a few dollars. Good thing is that with this laptop, you won't need to upgrade your existing wireless network, no need 3x3 N or AC. You see, ASUS helps us save money!I would recommend you check for upgrade options on wireless or go with another brand/model that doesn't have 5 year old technology.I also had an issue with touchpad, randomly jumping around when you hold your finger on it. Not many people have it but just saying here. After the upgrade, I have to send it for repair.", "Date": "October 3, 2013"}, {"Title": "The best laptop under 2k", "Author": "John Batcheller \"John\"", "ReviewID": "R2B5TFQC3U05YI", "Overall": "5.0", "Content": "This computer is amazing and an amazing deal.  Like the first review discussed this cheaper is a better pc than its more expensive counterpart with the faster hdd and 2 8gb ram chips.  For anyone who doesn't care about what these things are just remember that this pc is ridiculously fast.  I plan to add a second hdd and more ram but currently am running the stock pc and have yet to have anything lag other than when hit the download cap at the office.  I dont think I own a game that this thing cant take at max settings and it runs aftereffect really well.  The keyboard on it is really nice and is one of the best laptop keyboards that I have ever seen.  Props to asus for not putting a lot of dev software on the pc so it wasn't much work to setup (really only had to uninstall macafee to stop most background processes).  Something i didnt expect was to find a optical jack in the headphone jack like my old sony had.  I plugged in my headset and the asus sound quality was miles ahead of my old sony.  The only gripe about setup is that they partitioned my hdd into 2 drives (a c drive and a d:data drive) which cut my hdd size in half.  This isn't much trouble to fix but im sure that if you are looking at buying this laptop you can (or you know someone that can) repartition a hdd.  I thought windows 8 would be the worst part of this pc but I am actually pleased with its performance figures and the new layout is nice(all the shortcuts take some getting used to).  The computer looks way better than the competing alienware(which looks stupid if you bring it to work) but the rog badges make it kind of hard for me to take it to work.  as for the price comparison to the alienware this pc has mostly same hardware (probably better build quality because alienware is dell) and its about $500-$700 cheeper.  As for shipping the packaging was neat and undamaged and the computer arrived 2 days early (thank you tiger direct).so here is a quick listpros- great graphics card (gtx770 is 2nd best nvidia laptop card) fast hardware (ddr3 ram, 7200rpm hdd, fast 4th gen i7) good quality hardware which is unfortunately very uncommon these days exterior is solidly built and feels sturdy while remaining relatively light light for a 17in powerhouse cooling is done very well alowing for overclocking keyboard is backlit (ooooooooo shiney) good keyboard with alot of cool keyboard shortcuts it has a optical jack in the headphone port so you can use a adapter like this, StarTech.com THINTOSMIN6 6 feet Toslink to Mini Digital Optical SPDIF Audio Cable, to connect a stereo or a nice headset. 4 usb 3.0 (most pc only have like 1 or 2) a hdmi and mini display port (the little things are what make me happy) 12 month mfg warrantycons- came with macafee there are more rog badges on it than m badges on a bmw m series (probably true if you factor in surface aera in an equation like badges/surface aera or badge aera/exterior surface aera * duration of exposure im getting off topic) the brushed metal on the keyboard is a fingerprint magnet the geforce sticker is crooked (see how hard it is to find cons for this thing) it doesn't have a touch screen (this may have been nice for some people but I personally am glad they left it off)so I think that is everything that hasn't been covered by previous reviewsif you are looking for a gaming/powerhouse laptop this really is just the best laptop you can get for under 2k", "Date": "August 14, 2013"}, {"Title": "It's a good!", "Author": "Hyeonho, Shin", "ReviewID": "R3K3H43EQDYCMS", "Overall": "5.0", "Content": "At first, it has a awesome cooling systems much more than my old laptop Asus U80V.And seconds, amazing speed. System boot time is only 3seconds, what i had install Windows 8.1 at G750JX.", "Date": "February 11, 2014"}, {"Title": "Similar asus for best price", "Author": "Daniel M.", "ReviewID": "RYQTD0NQBYUNU", "Overall": "5.0", "Content": "It is a relly good laptop , but for 20dollars more you buy the same with 256 ssd gb, i think they change the prices a lit days after , so i felt cheated... But it is a nice lapgame", "Date": "February 8, 2014"}, {"Title": "All is amazing except ONE thing", "Author": "Orange Jimmy", "ReviewID": "RSFTC50W6AWSE", "Overall": "4.0", "Content": "Great price (it was $1499 when i bought it)Great specs (GTX770, i7, 7200RMP, 1080p display, blue-ray+dvd burner, 16GB RAM, and more awesomeness)Wireless Card, TERRIBLE! Only can receive 2.4Ghz wireless signal. Can't detect 5.0Ghz signal at all.My 6 yrs old DELL XPS 1530 can do 5.0Ghz.I had to purchase an external wireless 5.0Ghz adapter for it.Having said that, i think with the price i paid, it is UNBEATABLE EVERYWHERE ELSE.Trust me, i have compared DELL, HP, SONY, ALIENWARE, SAMSUNG and more,with the same specs, $1500 is unbeatable!", "Date": "January 19, 2014"}, {"Title": "Extremley Powerfull", "Author": "Sleiman El-Khoury", "ReviewID": "RRY4QPR4S83FS", "Overall": "5.0", "Content": "I am using it for Photo & Video editing and I would recommended it. I can work with Lightroom & Photoshop at the same time with no problem at all. I have tested with Video Converter along with CUDA Acceleration where the process took me only 1 hour to convert 3D Blu-ray Disc to 3D MKV with high quality. I would Highly recommended for Photo & Video editing, sorry I can't provide you with my opinion on the gaming because I purchased for Photography & Video.Hope to enjoy it and I am planning later on to expanded to 32 GB RAM for additional power process specially for heavy Video effects and rendering.Sleiman El Khoury", "Date": "September 22, 2013"}, {"Title": "Replacing macbook pro mid 2010", "Author": "Kaied krishan", "ReviewID": "R2RZO3KADHXK9H", "Overall": "5.0", "Content": "After long and deep search i decided to get this laptop for its spec & design, got it from Tigerdirect,  i have it for a month now so far so good, i removed 265gb SSD from my old mac and cloned the os to it, now it boots in 10-17 seconds and runs super fast.love it and its great laptop, and i don't miss the heat from my mac laptop....", "Date": "September 13, 2013"}, {"Title": "Can't slow it down", "Author": "David Korson", "ReviewID": "RGSNJ891PBFXP", "Overall": "5.0", "Content": "Love this desktop replacement. Super fast. Beautiful screen. Never gets hot. Good quality throughout. Only things not happy with are the operating system. Would rather have had win 7 as I am not familiar with 8 at all very frustrating experience at times. Also the touchpad can cause problems in games as it can be accidentally touched when using the keys. Had to get a separate keyboard. Otherwise I am happy.", "Date": "September 1, 2013"}, {"Title": "Asus G750JX-TB71", "Author": "Dan", "ReviewID": "R30ICG7I4J0JP5", "Overall": "5.0", "Content": "This is a great laptop for the price. For just $100 more than the G750JW-DB71 you get a Nvidia GTX 770m over a 765m and a Blu-ray drive over DVD.Here are some questions you might wonder before you buy:-The Blu-ray drive is READ only-Some review websites say that this screen is 120 hertz. That is incorrect, it is only 60 hertz refresh rate.(Meaning the screen is not able to display 3d)-The backlit keyboard is white. It is not changeable.-This laptop has 2 hard drive bays. The 2nd slot is empty and easy to access from the bottom of the laptop.-By removing the back cover you can access 2 out of the 4 RAM slots. The 2 RAM slots are empty so you can easily upgrade to 32gb without having to remove the keyboard.-For some reason they decided to partition the hard drive that it came with into 2.-Try checking how much shipping will cost on Tigerdirect and compare it with Amazon. I live in Hawaii so of course shipping is naturally more expensive, but Amazon wanted to charge me $50 for standard and $100 for expedited shipping. When I compared with Tigerdirect they charge $28 for standard and $33 for 2nd day air!", "Date": "October 5, 2013"}, {"Title": "High expectations and a BIG let down", "Author": "Vicki Ballenger", "ReviewID": "R3HHPPKUFBTTRI", "Overall": "2.0", "Content": "I want to clarify that Computer Upgrade King was first class to work with.  The 2-star rating is strictly regarding the ASUS laptop.  I researched the crap out of this laptop and really felt I was making a great purchase.  I actually still believe this is a great laptop but feel I got a bad one.  The computer was loaded with spam-ware (shame on you ASUS), kept giving fatal errors when trying to run Windows updates, and would not recognize plug and play devices on the USB ports.  I also strongly believe that Windows 8 is causing problems, and all the spam ware bogs down an otherwise fast laptop.  I was so disappointed and considered keeping it and working through the \"bugs\" with Computer Upgrade King.  In the end, however, i decided that a brand-new laptop should not have \"bugs\" and returned it.  In the meantime I purchased a used iMac and am in love.  Maybe I won't return to PC?  We shall see.  ASUS stop loading up your machines with spam ware!", "Date": "March 26, 2014"}, {"Title": "BLOWN AWAY", "Author": "Cio D.", "ReviewID": "R1TB4QZ2V5WMKI", "Overall": "5.0", "Content": "This beauty is a beast... having agonized for a few weeks on what laptop to get (primarily for video and photo editing with an occasional World Of Tanks battle on the side) the choice was between Macbook Pro and Alienware until I chance along this beauty at Amazon. Though it is not as customizable as Alienware with option for a faster CPU but its specs is already amazing with its own upgradability at 20% lesser price for same specs (I got mine for $1513 including shipping from Tech Group Latin America) and much much with the less compared to the lesser spec and smaller Macbook Pro.The form factor is much sleeker  than Alienware. It is quite like a whisper, I could not hear the fan even if my room AC was turned off. The absence of heat sometimes make me forget that I'm using a laptop.It's just blazing thru my softwares (Premiere Pro, Photoshop, Lightroom). I think this laptop will be relevant for at least 4 years with its upgradablity (a larger SSD drive perhaps when the price drops and 2 additional 8GB RAM) or until 4K video becomes mainstream.", "Date": "December 15, 2013"}, {"Title": "that`s gooooood", "Author": "Jeremias S.", "ReviewID": "RV6CTOWEBQ49V", "Overall": "5.0", "Content": "Its a great computer... and now, I can play all games....Recomend for all. I liked this computer. Its wonderful", "Date": "October 30, 2013"}, {"Title": "Asus g750, so far so good.", "Author": "James", "ReviewID": "RTR7RJ4SNUFFX", "Overall": "5.0", "Content": "I have had this computer for a few days now and have to say it has met all my expectations. It is lightning quick, and has taken everything I have thrown at it with ease. Many here bash the 7200 rpm hard drive, and while I agree solid state is a very nice thing to have, from what I have seen its not something I have to have at this point. In the future I will likely buy a solid state drive for it around cyber Monday or black Friday. I mainly use the computer to play mmo's, I play wow, fire fall, and as we speak I am downloading the elder scrolls beta. Over the last few days, I a have multi-tasked with it. It's not uncommon for me to have wow, skype, a video chat room, and at least 5 to 6 webpage tabs open in firefox, I also in many cases have you-tube playing music or Pandora one. Through this my temps stay constant in the 50- 70 Cecilius range and they have topped out at 77 Cecilius. So yes the cooling system does work and quite well I may add. The webcam is amazing (even better than my Hewlett Packard that it replaced), the microphone is very good as well. The audio quality is very very good as well, and I especially like the headphone amp. The backlit keyboard is a very nice touch, I do wish it could change color's but that's my only gripe about it and the other aspects of this machine far outweigh that small point.Now for the con's. MY main issue with this laptop is windows 8, I am giving it about another week to two weeks to see if I can grow used to it. If I cant, the alternative is a windows 7 ultimate disc I have in my house. I would rather not have to do that mainly because I will have to spend a lot of time looking for many of the drivers for win 7 on my own, because Asus's website only has the bio's and a few other drivers for windows 7. This is not Asus's fault thus I am not going to deduct a star from there review for Microsoft's software issues.So all in all if your on the fence about this machine, just buy it, The price is semi high I agree but its far more reasonable than any Msi or Alienware would be. And it functions very very well, and has a very nice well made feel to it. Also for those of you that wonder what kind of bag to get for it I would recommend looking at the Everki Titan.Update- 4-29-2014So I have had this machine for quite some time now. My main gripes about it are as follows. The power cord is very short, My Hewlett Packard easily has a cord that's 2 or 3 feet longer than the Asus. This can be a major pain in my house which is older and the plugs are spaced out father because its a larger house. For example the Hewlett Packard easily has enough cord to stretch from the couch from the wall 4.5- 5 feet away. With the Asus, I end up moving the couch, or sitting in another chair, because the cord it to short. My second gripe about it, is windows 8 and its keyboard interface, Unless I use a external mouse, at least once every 5 minutes, I will end up brushing the touch pad while writing a blog post or even a review on amazon like this, and when that happens, It takes me off the post I am typing and puts me in the windows 8 start menu (super annoying). The only fix I have found, is to check a option under settings where it disables the touch pad when I plug in my naga. I have seen others bash the wifi card here, Long term I have not seen any issues that would make me wish it had a better card. Every game I have thrown at it it has played flawlessly online with no lag on the part of the Asus (other factors such as my xbox one or 360 and crappy internet always contribute to the lag from my experience). Eso online, fire-fall, swtor, World of Warcraft, league of legends, all of these games perform on max settings with no hiccups.  All in all I have been very impressed with this computer long term and in the future, if I needed another desktop replacement, I would not hesitate to buy another Asus ROG.", "Date": "October 11, 2013"}, {"Title": "next gen is already here", "Author": "Akbar S. Muhammad", "ReviewID": "RNH47U7IXGRWO", "Overall": "4.0", "Content": "All I can say is wow ! This is a top notch product for the price that blows away the compitition . All my games are blazing fast and I can even run crysis 3 at max settings what more could u ask for seriously ! Not a big fan of win 8 but its slowly growing on me  .", "Date": "October 10, 2013"}, {"Title": "VERY NICE VERY GOOD", "Author": "bikoff", "ReviewID": "R2XA4LEE8TM5WX", "Overall": "5.0", "Content": "Have to say that got it exact on time!This model from this seller is just outstanding. One thing I've noticed so far is a panel of screen on bottom is not fixed enough and moves. Anyway this machingun has so perfect perfomance as I expected. Try it and Yuo will never regret it)", "Date": "October 9, 2013"}, {"Title": "exellent!!!", "Author": "HyunGon, Kim", "ReviewID": "R2FOLVDJSQMPQD", "Overall": "5.0", "Content": "exactly!!! Very nice!!! I love it forever!!! I introduced to my company, he bought it. I will do it everyday!!! Thank you", "Date": "August 10, 2013"}, {"Title": "good", "Author": "john Sheppard", "ReviewID": "R4H2S6U5N36LK", "Overall": "5.0", "Content": "good,it's very good...............................i don't wanna say anything anymore,it's just not fair,to force me to say all these things oh crap", "Date": "August 23, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DD0FPIQ"}}