{"Reviews": [{"Title": "So far this has met my expectations", "Author": "D. Halfacre \"Dustman\"", "ReviewID": "R2D0KRTNLL758Q", "Overall": "4.0", "Content": "I start only with what I know so far (received 08/21/2013):Delivery and Packaging:  Excellent, it came packaged in four boxes, with tChree of them having padding.  Pretty amazing job by Amazon and CyberpowerPCUpgrading:  Good, upgraded by adding an SSD.  Doing this was a bit tricky because the back panel is plastic, and snaps into place.  So you have to be gentle and firm at the same time to remove it.  The upside is once you are in you get two drive bays.  I did get a BSOD a couple of times, but I believe that was more of a drive issue that an issue with this laptop.  I also plan on upgrading the RAM when I find a good deal.  I'll update this when that occurs.Overall Performance:  Just good, with the components installed.  This thing has a huge bottleneck when booting up with that 5400rpm boot hard drive.  Adding the SSD the boot up goes from close to minute, to about 20 seconds.  So just plan on upgrading this, and this thing is blazing fast.  However, without the upgrade you really aren't getting the performance you paid for.  If you need more storage at least go with a 7200rpm HD.Gaming Performance:  Excellent, here is where you get a great value from this notebook.  You get the most powerful single video card on the market.  It blows my desktop with a 560Ti out of the water.  Now realize with the bleeding edge you might run into a few issues.  For example I couldn't get the latest drivers to install.  However, this isn't a reflection on this notebook.  It is just part of the deal with a high end video card.  Just pop in Skyrim, and realize any issues are totally worth it.Build Quality:  Seems good so far, but time will tell (and I will update accordingly).Support:  Good, the disks packed included a disk with drivers and a Windows 7 disk.  This is more than you get from most companies at this point.  The driver disk came in handy when installing a fresh install of Win 7 on the SSD.  The nice thing is this computer DOES NOT come bloated with crapware.  Hopefully support won't be necessary, but if so I'll update this.Update-09/2013-Got the Beta driver, version 326.80 installed without any issues.  Also I'm blown away even more than I was day one by this things performance.  Borderlands 2 really shines with some of its physx effects.", "Date": "August 23, 2013"}, {"Title": "Horrible cooling solution...same exact problem with other gaming laptops", "Author": "Ninjawithagun", "ReviewID": "R2Y5SCWC8MWJBU", "Overall": "2.0", "Content": "The CyberpowerPC FANGBOOK EVO HFX7-300 looks like a great deal...at first.  Next-gen Intel Haswell quad-core mobile processor gets the job done, next-gen high end mobile NVidia graphics card is the most powerful single card you can buy in a laptop right now and can pretty much play any game with most eye candy maxed @ 1920 x 1080 resolution, 8GB of 1600Mhz DDR3 what is more than enough to handle most work loads, great matte finish 17-.3 inch LED screen, etc, etc.  So, what's not to like.  Well, for starters and ultimately the \"killer\" of this great deal is the cooling solution.  THe HFX7-300 utilizes a SINGLE fan to cool both the GPU and CPU.  As a result, both the GPU and CPU throttle down in clock speeds in order to maintain the proper thermal thresholds they were designed to operate.  The end result is a laptop that will have longevity issues, perform much less than expected, and will need to be used in an environment with an ambient temperature that is below 80F.  THe CPU and GPU will most likely fail over time from continuous exposure to unusually high temperatures.Bottom line - DO NOT BUY THIS LAPTOP!!  Yes, you might save a few hundred dollars, but that will ultimately be your undoing.  This laptop will cause you nothing but heartache with customer support or with having to return it thinking it's defective.  But, it's NOT defective.  It's part of the way it was designed, which is to say that was done very poorly.Don't believe me?  Read this review on a similar MSI GT70 laptop that has the exact same cooling solution as the HFX7-300 - Thanks to Doctor Dave for both links!http://www.amazon.com/review/R2ZG948Q8RZEPV/ref=cm_cr_pr_viewpnt#R2ZG948Q8RZEPV[...]If MSI and CyberpowerPC would have just taken a bit more time to employ a better cooling solution similar to the Asus G750 and Alienware M17X and M18X laptops, they would have had a serious contender on their hands.  Instead, they were more worried about profit instead of quality of product.  NO WAY AM I GOING TO BUY FROM A COMPANY LIKE THAT!!  Maybe next year MSI and CyberpowerPC will get their respective quality control and product engineering teams back on track...maybe...", "Date": "October 28, 2013"}, {"Title": "cpu gpu combo is great.  everything else is upgradeable", "Author": "da fife", "ReviewID": "R1P4HXW1UPPBVT", "Overall": "4.0", "Content": "This laptop is on sale at new egg for 1700 right now (ends today).  I spent forever trying to build the right laptop and came to the conclusion I needed an i7 and either a radeon 8970m or a 780m.  While I plan on adding an ssd and throwing in 2 sticks of 8g ram down the road, (and possibly windows 8) for 1700 i was extremely happy I found the laptop.  Only other option I came up with was building an explorer x6-9600 or the ibuypower equivalent (which is all preference).  I'll update when i receive the laptop.", "Date": "July 31, 2013"}, {"Title": "Customer service experience was abysmal.", "Author": "Bonham", "ReviewID": "R7MP04H8Q8D0E", "Overall": "1.0", "Content": "I was going to buy a laptop from them.  But I was completely blown off by their customer service group.  Couldn't be bothered to give me a very simple answer about docking stations.  It's not that I didn't get an answer at all (I did receive two replies - both beyond apathetic), but rather that they just didn't care to actually provide the answer to a potential customer.  If that's the kind of customer service I'm going to get as a potential customer, imagine how helpful they'd be once they had my money?", "Date": "January 16, 2014"}, {"Title": "Stunning Laptop", "Author": "Garrett", "ReviewID": "R1YQUX26VU86M7", "Overall": "5.0", "Content": "Okay, so I received the laptop today, and it is honestly the best laptop I have ever owned. The looks are great, the red LED lights are a spectacle and the blue LED trim in certain parts of the laptop make this thing look really awesome.two main games I have tried: Diablo 3, and BF4BF4: With a 780m, I managed to maintain about 55fps and higher with the settings selected on HIGH. It honestly looks amazing. I really can't notice major FPS drops unless HUGE explosions come my way (which is expected). UPDATE 5-6-14 I had to select the nvidia GPU through nvidia control panel because the game was running off my intel graphics 4000. A HUGE performance increase now. I am running ultra at around 45-60fps with no AA and no HBAO at 1080p. Love this thing :DDiablo 3: A piece of cake. Everything on ultra. The GPU rapes the game in quality and looks.For heat, I bought a coolermaster laptop cooling pad, so it helps with the extra airflow. I was in the 80's (80c mind you) when measuring temps on BF4 using coretemp. I did not play over an hour btw, I was just testing out the game for about 30 mins.Noise: The fan is ULTRA loud when you click on the fan setting on the keyboard. The noise from the game muffles it out, but not by much. But it's only to be turned on when gaming. Surfing the web and homework don't need extra cooling...Other than that it's very quiet when just idling.overall a nice piece of work cyberpowerpc has put together. Oh, yeah, the camera. It's whatever. It's not the greatest or the worse. It's just an average display. Unless you love seeing only complete clarity on laptop cameras, this will do just fine for your average user.", "Date": "April 30, 2014"}, {"Title": "great!", "Author": "boning", "ReviewID": "R3KUPAB46QHOCN", "Overall": "5.0", "Content": "it is the best gaming laptop I have ever had.but I need to buy some new devices to let it better.", "Date": "January 3, 2014"}, {"Title": "Expensive !!!", "Author": "Hunter", "ReviewID": "R3JAX09H5JLLVQ", "Overall": "3.0", "Content": "This is a machine for gamer but you can not play the hardest games in this machine, with this price, you can choose a stronger machine. For example ASUS G750JX-DB71, which is cheaper and stronger. You can play every games and run every design application or 3D processFANGBOOK EVO HFX7-300 : $1,900.02- 2.4 GHz Intel Core i7-4770 <---- Slower- 8 GB RAM  <----- Slower- NVIDIA GeForce GTX 780M 4Gb- Windows 7 Home Premium 64-bit- Item Weight: 7.9 pounds- Top #### ~ not availableASUS G750JX-DB71 : $1,898.90  ### Cheaper & Stronger- 3.4 GHz Intel Core i7- 16 GB DDR3- Nvidia GTX770M 3G- Windows 8- Item Weight: 5.5 pounds- Top #46 in Best Seller notebook(Amazon)You can look ASUS G750JX-DB71 with special discount here:B00COQIKKADon't forget protect your machine with SquareTrade 3-Year Computer Accident Protection PlanB002I01TZA", "Date": "July 23, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DNGR740"}}