{"Reviews": [{"Title": "Big, powerful laptop with low resolution screen, slow HDD and flakey trackpad.", "Author": "S. E. Rhoads \"WordTipping\"", "ReviewID": "RS0M51HVNJW1O", "Overall": "4.0", "Content": "The ASUS X750JB-DB71 is a really good laptop with a number of curious design decisions that may be deal breakers for some people. On the whole, it is a powerful device that makes for a great desktop replacement. It is large, barely portable, and for such a beastly device, has understandably terrible battery life.The overall construction is a bit hit and miss. The 'concentric circle' finish on the lid is pure marketing speak. It may not attract fingerprints, but it will attract dust and dirt. The keyboard and palm rest are very nice. They feel 'solid' and 'rigid'. I didn't feel the keyboard flex as I type as I have felt on some cheaper laptops. The plastic underside however, feels cheap and has a worrying amount of give.The screen is the first odd design choice. It has a resolution of only 1600 x 900. For a screen this size and for the cost (~$1000) of the device, this is sub-par. Given the high resolution screens on tablets, smartphones, MacBooks, etc, it is increasingly unacceptable to see Windows laptops ship with such low resolution screens. At a minimum this should have been a 1080p screen so that you could at least view HD content natively. That said, it is a nice panel. It is very bright and the color are well saturated. The viewing angles are good, but not great. The vertical viewing angle seems to be smaller than the horizontal. What may be a critical flaw for some is the fact that the panel is not a touch screen. Since this is a traditional laptop and not a 'convertible', I didn't think this was a deal breaker.The keyboard was nice as well. It is a chiclet style keyboard that thankfully avoided being mushy. The keys feel 'crunchy'. Due to the generous size of the laptop, the keyboard is very spacious. The addition of the number pad keys is very useful, especially if you plan on using the laptop as a desktop replacement.Less successful was the trackpad. Although it is advertised as a multi-touch pad, I found the functionality very spotty. As a Windows device, it is pretty par for the course. For anyone who is used to smartphones, tablets, or Apple products...it will be a terrible experience. A particular pain point for me was scrolling sideways. Windows 8 is designed for touch based interfaces. A key design metaphor is the sideways swipe. You navigate the Start menu via a sideways swipe for example. Not being able to perform this input method reliably made for a frustrating experience. I found it easier to attached a mouse and use the scroll wheel.The X750JB-DB71 has all of its bases covered when it comes to ports and connectivity. The only thing missing was Firewire and given its age, I doubt anyone will miss it. The four USB ports (two 2.0 and two 3.0) are welcome and very useful. The left side of the device might get a little busy since the USB 3.0, HDMI, and headphone jack are all on that side. Especially useful is the integrated Bluetooth 4.0. Being able to pair the laptop with your smartphone to transfer files is really convenient. Less convenient but still nice is being able to pair the same keyboard, mouse, wireless speakers, game controller, etc on both devices as well. The only oddity is the lack of a Blu-Ray drive. Given the decline in physical media, I doubt this is a deal breaker for many people.Where the X750JB-DB71 really shines is on its internals. The laptop comes with the top of the line Intel Haswell architecture. It is a beast. Paired with it is a Nvidia 740M with 2GB of RAM. Tying it together is 8GB of RAM. The RAM is expandable but you will need to replace both 4GB sticks already installed with 8GB sticks. Annoying for sure.  All in all, these are very strong internals performance wise. If you intend to use this device as a desktop replacement, it fits the bill perfectly. This laptop will handle any multi-media you throw at it. I had no problem running multiple 1080p YouTube videos and HD Netflix streams at the same time on multiple monitors. The Nivida 740M is also a reasonably competent gaming card.My biggest annoyance with the hardware was the two included 1TB HDDs. They are SLOW 5400 RPM drives. I wish the primary drive at least was a 7200 RPM drive. Ideally, it would have a 100GB SSD for the main drive and the 1TB HDD as the secondary drive. As it stands, the HDD speed makes the whole system feel slower than it should. A MAJOR peeve of mine is how Asus chose to partition the drives. Instead of seeing two 1TB drives, Asus split each drive into a two 500GB partitions. So, you end up with FOUR drives. While this may make some sense regarding the primary drive, it makes no sense on the secondary drive. One of the first things I did was merge these extraneous partitions.To wrap things up, the X750JB-DB71 comes with Windows 8. At the time of this review, Windows 8.1 has been released and will need to be installed. I highly recommend this be done. Unfortunately, it is a lengthy process. On a non-touch device, Windows 8 can be frustrating. This frustration is exacerbated by the sub-par touchpad software. But, this review is not about Windows 8. Suffice to say, it is not a strong point for this device.In summary, I liked this laptop. I think you get a lot of power for the price. As I have mentioned a few times, it would be a great desktop replacement. If you intend to use it as anything else, good luck. There are plenty of better options if that is what you desire. While the laptop is surprisingly light and thin for its huge screen size, its still a 17.3\" laptop. Its heavy and barely 'mobile'. It is tolerable to drag it around the house, but even then, the sub 3 hour batter life will limit what you can do. My biggest gripe are the slow and oddly partitioned HDDs. If you can wait, I am sure the price for the laptop will continue to drop. As of this writing it has already fallen to $909 from the original MSRP of $1200. Given the retail cost of the core internal components, this is not a bad deal.", "Date": "November 20, 2013"}, {"Title": "A solid performer so far", "Author": "N. Krumpe", "ReviewID": "RF6RWQ10IKE2H", "Overall": "4.0", "Content": "This is a solid desktop-replacement laptop with so-so battery life.  After a few weeks of use, I'm still quite happy with it.Some background: I'm not a PC gamer, so I'm not able to comment on things like frames-per-second on various games.  I'm sure other reviewers will touch on the gaming goodness or badness of this laptop.  Rather than gaming, my PC life is focused on business applications...I need Microsoft Office to run quickly.  I need to take frequent screenshots.  I need to collaborate on Google documents.  I also do/teach Java programming, so I need an environment where I can quickly throw together a program, compile it, and run it.This laptop goes way beyond meeting my needs: the 8GB RAM, and 2TB hard drive (2 separate 1TB drives) are more than ample for me (my old desktop was 6GB RAM and a 1TB drive).  And I love the large screen.  I find it highly readable for my 45-year-old eyes.  By contrast, I had been using a Microsoft Surface Pro, and was getting frustrated with the small screen.  Note that this laptop does not have a high-density screen (it's not \"retina\"-density, if you know what I mean).  But, it's great for how I use it.Some specific notes you may care about.  First the positives:* It performs quite well.  For my purposes, I never find myself waiting for anything.  Starting and software, switching among the various Windows 8 screens, and connecting to various network resources have all performed flawlessly...no lag or hesitation.* I'm enjoying Windows 8 (and note that 8.1 is being released shortly after I'm writing this review).  While I miss the touch screen of the Surface Pro, the ASUS touchpad gives me nearly all the swiping/scrolling/pinching/zooming that I need.  I've only had one minor gripe about the touchpad: one day most of its functionality stopped working...a reboot fixed it (to be fair, I think it happened in the middle of a Windows update).  Getting around in Windows 8 takes a little getting used to.  But once you do, it's quite easy.  I also like that once I link to my Microsoft account, this laptop stays synchronized with my Surface Pro.  For example, if I change the background graphic on this laptop, it will also change on the Surface Pro.* It lives up to its promise of a 2-second wake-up.  Close the lid, walk away, and come back later.  When you open the lid, it only takes 2 (sometimes 3) seconds for Windows to be up and running again.  Note that the battery will discharge more quickly if you take advantage of this feature.  Shutting off the feature will extend battery life, but increase the time you have to wait for the computer to wake from its sleep.  Note that I am NOT talking about a cold reboot here.  The 2-second startup is from a sleeping PC...NOT from a PC that has been shut down.* Solid body: From the textured lid to the brushed metal interior, this is put together well.  It is not flimsy in any respect.I do have some complaints that, collectively, lowered my rating from 5 to 4 stars:* Battery life: This is only rated for about 3 hours of use, and that's what I've been finding.  That seems a bit low to me, but I guess I've become spoiled by the 10 or so hours I get from an iPad.* The keyboard: Though the keys are nicely spaced, the layout is frustrating.  I don't like having to \"search\" for the arrow keys on a typical keyboard.  I like to be able to reach for them and know where they are.  Unfortunately, these are put too close to the main keys (the Shift and Ctrl keys), meaning that I typically need to look down at the keyboard to find the key I'm after.  In addition, after just a couple weeks I found that the space bar has developed a squeak each time I press it.* Garbageware that came pre-installed:  When I first booted up the computer, I found it to be a little slow.  I quickly fixed this by deleting a lot of unnecessary apps that had been installed.  This included the virus scanning software.  After deleting it, I found that the computer boots up and runs almost flawlessly.  But it is a frustration to have to \"clean up\" a brand new computer.Should you buy this laptop?  If you are like me...looking for a big laptop that smoothly runs business applications...I expect this will more than meet your needs for several years.  On the other hand, if you are looking for a gaming laptop, you should probably read more reviews.", "Date": "October 15, 2013"}, {"Title": "Nice laptop with a solid design, good spec.", "Author": "TorridlyBoredShopper \"T(to the)B(to the)S\"", "ReviewID": "R2RU9L3FRJ97Y2", "Overall": "5.0", "Content": "Spec and look-wise, I like this laptop. I'm not a big fan of Windows 8 and especially for laptops however, because it isn't designed for easy functionality without a touchscreen in mind. I'm not a big fan of the touchscreen either; maybe stubbornness or it seeming like a gimmick or more cost - I'm not sure. I did recently picked up another laptop before this one and had some time to acclimate to the program, but it is a pain for maneuvering. That seems worth noting since it is the systems OS, but since basically everything comes with it now, it really isn't the device's fault.As far as looks go, I really like the design of this computer, with nothing fancy added to make it more aesthetically-pleasing. The keyboard type, with the spaced keys, is something I always liked. I've got long fingers and bunched keys are a pain, so this design with spacing works out well. They advertise it as being \"cool to the touch,\" and the computer does stay that way. It also vents out toward the side as it heats up, which is important. I had a computer that vented down, and said I'd never buy one without checking again. It is also easy to grip on the outside, which is nice. Other, smoother laptops sometimes give me a scare when I'm holding them and wondering if this time will be that time it slips.As far as doing, it runs media and games well, with no problem juggling multiple requests at the same time. For kicks, I tried running multiple types of media at the same time to see what it could handle, and was pleasantly surprised. Flash games run quickly, and more in-depth games do really well on it. I've been playing some MMORPGs as well as throwback horror survival games on it, and have been impressed. The picture on this thing is great, too. Very crisp, with beautiful details. The sound isn't bad for internal speakers, but I've never considered any laptop's sound great without external add-ons. I  would've liked a BluRay player on this sucker for the price however, to add to that clarity.8GBs of RAM, 2 TBs of storage plus, the 2 second wake time (which it really does), lots of USB slots; it really is a good laptop.", "Date": "October 13, 2013"}, {"Title": "A Good Laptop With Some Drawbacks", "Author": "S. R.", "ReviewID": "R3JIPHZ4M4P46T", "Overall": "4.0", "Content": "Let me start by stating that I am a novice laptop user, thus, this review will be free of the technical jargon that can otherwise be found in more expert reviews.  My initial impression upon unboxing the Asus laptop was that it was very sleek and stylish looking.  The concentric circle finish really does eliminate those annoying smudges and fingerprints.  I was also surprised to see the layout of the keyboard was similar to a standard PC keyboard, with enough spacing between the keys so as to not be a hindrance to those with thicker fingers.  The large size of the screen was also a welcome bonus for a die hard PC user such as myself.  The laptop took longer than expected to start up and there was some slowness initially when browsing the internet or using the various programs.  This was going to cause my rating of the laptop to fall considerably until I read the other reviews that warned of the unnecessary pre-loaded add-ons that were responsible for the undue lag.  I deleted the programs and applications that seemed extraneous, which helped with the slowness considerably.  It is confusing why the manufacturer would add so many seemingly useless applications that only serve to slow down the performance of the unit.  Windows 8 took a lot of getting used to given that it is not the most user-friendly operating system.  But this learning curve is due to my having never used it before and has no bearing on the value of the actual Asus unit.I was, however, extremely disappointed to find that this laptop did not come with a blu-ray player.  My friend has an HP Pavilion which costs considerably less than this Asus but comes with a blu-ray drive.  Given that blu-ray discs have eclipsed DVDs in practically every way, it is frustrating that such a highly priced unit still only allows for DVDs to be played.  While this may not be a deal breaker for some, for those with extensive blu-ray collections, it is a serious drawback.  The battery life is listed as around 3.65 hours but my experience put it at closer to the 2.5 to 3 hour mark.  I am not sure if I was doing anything that might have depleted the battery life at a faster rate but this did seem to be on low end when compared to similarly priced laptops.  Overall, this is a well designed laptop with plenty of RAM and hard drive capacity.  The lingering complaints from this user are the sub par battery life and the lack of a blu-ray drive.  Considering the current high retail price for this unit, it might be best to wait until the price drops some more before deciding to purchase.", "Date": "October 16, 2013"}, {"Title": "Great laptop with some small problems", "Author": "Joan Kling", "ReviewID": "R3TCBEDLWB637B", "Overall": "4.0", "Content": "Pros:- Sleek design- Excellent keyboard- Great image and sound quality- Never gets hot- Incredibly fast CPU- Good graphics card- 8 GB RAM is more than enough for most people- The 2TB HDD has more storage capacity than I could ever hope to fill.Cons:- The touchpad is merged with the left/right mouse buttons, so you can't feel which button you're clicking unless you look at the touchpad. Sometimes I right click when I mean to left click. Not a big problem, but it's a little annoying at times.- The laptop makes some strange \"crackling\" sounds from time to time. I don't know what causes this, but it's very annoying. This is actually the second ASUS X750JB I've received (I had to return the first one due to manufacturing defects), and both of the laptops had this problem.- The HDD is only 5400 RPM. I would prefer 7200, but I'm happy with it nonetheless.Overall, this is a great product. It's not perfect, but the issues are minor in comparison to its excellent performance.", "Date": "November 9, 2013"}, {"Title": "Don't do it.", "Author": "C. E. Barrett", "ReviewID": "R2CYC5ZWJNAFXE", "Overall": "2.0", "Content": "If you care about the quality of images and videos you view on your laptop, don't buy this laptop.  The color balance is way off and the display is also not very bright or clear.  Images that look good on other computers don't look good on this one, even after I tried to adjust the color balance.  This is a huge problem for me since I bought this laptop mainly for photoshoping.  When I watch videos, people's faces look orange.  It's also kind of slow for such an expensive laptop with so much RAM and an i7 processor.  Trying to view image files is particularly frustrating when each image takes about 3 to 10 seconds to load.  My old laptop--which was about $400 cheaper and had an older AMD processor--had a better display and was much faster.  Finally, trying to register on the ASUS website is enough to try the patience of even the Buddha himself. It's very slow and some of the drop down menus don't work so I couldn't actually complete my product registration in order to secure a warranty.", "Date": "January 3, 2014"}, {"Title": "Nice display, good performance, poor battery life", "Author": "M. Erb", "ReviewID": "R3P9JTWWX81SSF", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3J3DYCCMF096TembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3J3DYCCMF096Trefresh_preplay() {\n\ndocument.getElementById(\"cv_mo3J3DYCCMF096TchiDiv\").innerHTML = document.getElementById(\"cv_mo3J3DYCCMF096ThiddenPre\").innerHTML;\n};\ncv_mo3J3DYCCMF096Trefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3J3DYCCMF096Tso;\t   \n\n\nfunction cv_mo3J3DYCCMF096TloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3J3DYCCMF096Tso = new SWFObject(swfLocation, \"cv_mo3J3DYCCMF096TAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3J3DYCCMF096Tso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3J3DYCCMF096Tso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3J3DYCCMF096Tso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3J3DYCCMF096Tso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3J3DYCCMF096Tso.setAttribute(\"height\", swfHeight);\n          cv_mo3J3DYCCMF096Tso.setAttribute(\"width\", swfWidth);\n          cv_mo3J3DYCCMF096Tso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3J3DYCCMF096Tso.write(\"cv_mo3J3DYCCMF096Tflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3J3DYCCMF096T', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3J3DYCCMF096T';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3J3DYCCMF096T', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3J3DYCCMF096TloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3J3DYCCMF096T\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m14L3WKX44GQC5\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m14L3WKX44GQC5\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R3P9JTWWX81SSF\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m14L3WKX44GQC5/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3J3DYCCMF096Tduration')) {\n      document.getElementById('cv_mo3J3DYCCMF096Tduration').style.display='none';\n    }\n    cv_mo3J3DYCCMF096TloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3J3DYCCMF096TloadSwf(movieID, playerVersion) {\n   return _cv_mo3J3DYCCMF096TloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3J3DYCCMF096TnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3J3DYCCMF096T', 0, h);\n}\n\nfunction cv_mo3J3DYCCMF096TresetPlayer(w,h,bw,cc) {\n  cv_mo3J3DYCCMF096TnewHeight(h);\n\n  cv_mo3J3DYCCMF096Tso.addVariable(\"resetBandwidth\", bw);\n  cv_mo3J3DYCCMF096Tso.addVariable(\"cacheCode\", cc);\n  cv_mo3J3DYCCMF096Tso.setAttribute(\"height\", h);\n  cv_mo3J3DYCCMF096Tso.setAttribute(\"width\", w);\n  cv_mo3J3DYCCMF096Tso.write(\"cv_mo3J3DYCCMF096Tflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3J3DYCCMF096TRollOverImg = new Image();\ncv_mo3J3DYCCMF096TRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81T0GSBKOuS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3J3DYCCMF096Tpreplay = document.getElementById('cv_mo3J3DYCCMF096TpreplayImageId');\nif (cv_mo3J3DYCCMF096Tpreplay) {\n  cv_mo3J3DYCCMF096Tpreplay.onmouseover = function() {\n    cv_mo3J3DYCCMF096Tpreplay.src = \"http://ecx.images-amazon.com/images/I/81T0GSBKOuS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3J3DYCCMF096Tpreplay.onmouseout = function() {\n    cv_mo3J3DYCCMF096Tpreplay.src = \"http://ecx.images-amazon.com/images/I/81T0GSBKOuS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3J3DYCCMF096Tpreplay.parentNode;\n\n  var cv_mo3J3DYCCMF096TcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3J3DYCCMF096TcurrentClick) {\n      return cv_mo3J3DYCCMF096TcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 6:36 MinsI'd like to address the elephant in the room right off the bat.Knowing that Windows 8 is designed with touchscreens in mind, why would you choose to purchase a new laptop that does not have a touchscreen if that laptop comes with Windows 8?I am not going to rate this laptop poorly because it does not have a touchscreen but it is something that you really need to consider if you are thinking about buying this laptop. I've struggled for nearly a year with a Lenovo laptop that also came with Windows 8 and also does not have a touchscreen. You may regret getting a Windows 8 laptop that does not have a touchscreen.The ASUS X750JB-DB71 has a really attractive \"concentric circle finish design\" that gives it an understated elegance and resists fingerprints. I suppose you could also make the argunent that the concentic circles also provide a more grippy surface for when you're carrying the laptop making it less prone to slip out of your hand. And slip it might because it is a heavy laptop weighing just a bit under 6 pounds.The left side of the laptop has a headphone/microphone jack, 2-USB3 ports, an Ethernet port, HDMI output, VGA output and a Kensington lock. The front left side of the laptop has an SD card slot. On the right side is the DC input jack, 2-USB 2 ports and the DVD drive.When you flip open the lid you see a full size chiclet style keyboard with numeric pad. On the top left is the on/off button. Below the keyboard is the large touchpad. To the left of the touchpad on the lower front edge is a row of small LED lights indicating: Power status, Charging status, Drive activity, Bluetooth/wierless indicator, Number lock indicator and Capital lock indicator.A great feature of the laptop is the fast wake up from hibernation mode... about 2 seconds.A bad feature of the laptop is all the bloatware that is included which is largely useless or mostly unwanted.Notable features of this laptop:- 8GB of RAM- 2TB hard disk (but only 5400rpm)- Bright and sharp display- 2 second wake from hibernationI think that overall this is a decent laptop. I do wonder whether the value is there though. My Lenovo laptop, which is a 15\" screen cost about half what this costs. Granted the Lenovo only has 1TB drive, 4GB RAM and an overall 4.6 Windows Experience Index compared to a 5.9 Windows Experience Index for the ASUS but for twice the cost it seems like the ASUS should at least have a touchscreen and Blu-Ray. Or how about a backlit keyboard (which it lacks)At a cost of just under $1000, it's not like this is an inexpensive laptop. It seems overpriced for the features it does have.", "Date": "September 25, 2013"}, {"Title": "Excellent for digital photographer and DVD viewing", "Author": "Kippoe \"Kipp Poe Speicher\"", "ReviewID": "R1KDG8HQP01OX9", "Overall": "5.0", "Content": "When I first got the laptop it was a bit of a challenge learning Windows 8 on a non touch screen. Then I also downloaded Google Chrome that made things better.The screen is large and bright, I have a copy of the full blown Power DVD and it brings vibrancy to old tv shows on DVD a great viewing experience. Nice speakers and picture quality. The processor is plenty quick for streaming Hulu, Amazon Prime, and Netflix.I also run Corel Paintshop and Corel Painter X3 that work in 64 bit mode with plenty of ease.After having it a few days Windows released 8.1 which was a real improvement and it was FREE. I also added a scroll mouse, the touch pad was a bit clunky and the buttons didn't work the best.The keyboard feels very fluid.", "Date": "October 27, 2013"}, {"Title": "Make the Next Step if you Can", "Author": "Fraugher", "ReviewID": "R2E460JWUD074D", "Overall": "2.0", "Content": "Only 2 days into ownership so the hard stuff comes up front, 12 hours of Windows 8 updates to 8.1 and the object-throwing rage that Windows 8 creates.  Is it that bad?  Yes. (Exhibit A. who in the entire human population ever asked Microsoft to get rid of the X button, was this trivial little button causing some unknown global problem?  It's removal is a major concern).  OK, so is this ASUS' fault?  Well, yes, they partook in the KoolAid that says you can't offer a mainstream Windows 7 box anymore.  You can and should, ship it with Windows 8 upgrade if necessary.Back to the ASUS.  I had my reservations because what I really wanted was an MSI GE60 or 70, but was constrained by a business budget.  The major differences (beyond an unnecessarily better video card) were 3: the MSI has a backlit keyboard, 7200rpm drive, and Windows 7.  These differences have all produced regrets.  Every fear of a non-backlit keyboard have been realized here and had I seen this laptop live before buying, this alone would have killed the purchase.  The print on the keys is very thin with poor contrast and tiny alternates, thus very difficult to see.  Why ASUS?  See no reason for this simple oversight.  All of the 6 keyboards in my home are readable in low light.  This one, not so much.  The 5400 drive is slow (confirmed with its lagging score on Windows Experience Index), not sure a 7200 is going to make a remarkable difference, but for now, it's a regret.  And of course Windows 8.Still, initially gave 3-stars because this package more or less delivers what it purports too.  Construction feels good, display looks good, the various spec parts seem to behave well together.  The layout is no-nonsense with a good array of connections.  Bloat-ware was manageable.  The video card surely is not worth the $200 premium over the identical ASUS without it.  Get that Asus for productivity, it is a bargain.Overall, cannot escape the feeling that this laptop is no better than one I could buy 3 years ago, not how I want to feel at this mid-price point.UPDATE: after some unsatisfactory graphics output, checked in to things and am finding that the built-in HD Graphics are being used in conjunction with the installed NVIDIA, often taking precedence over the NVIDIA.  You have little to no control over this, it is Intel likely trying to be smarter than you presumably to save battery.  In most cases it will cross over under load, but you will notice the degradation for a few seconds before the transition, and it is aggravating.  In other cases, the fix never happens.  I have one piece of software that will not allow me to even run a certain function because it says I have no graphics card.  I tried to get around that setting by loading the card down before going into that software.  Then it detects the card.  However, on reboot I am back to ground zero with the function disabled.  Considering the NVIDIA graphics cards raises the price of this laptop $200 over the identical ASUS, it goes without saying that I regret this purchase.I have experienced several freeze ups and a complete failure of the graphics card to run a single 1080 monitor with a modest visualizer.  I have decided to return this an upgrade to an MSI with a better graphics card.", "Date": "January 12, 2014"}, {"Title": "powerful laptop", "Author": "chaos", "ReviewID": "RRC5VP6CMFPBA", "Overall": "5.0", "Content": "This is a great laptop.  The intel core i7 processor is powerful.  It comes with 8Gb of memory. HDD is 2x 1TB 5400RPMIt has 4 USB ports in total (2 are USB 2.0 and 2 are USB 3.0)The screen resolution/picture quality is excellent. Audio quality is also great. Watching movies on this laptop is awesome with it's big screen and high quality display.I love the \"Instant On\" technology. This laptop starts up so quickly.The one thing I did not like about this laptop is the keyboard. It is not backlit and it is set too far back (which makes it a bit awkward to use at times, especially for gaming).I like that this laptop comes with 1 year accidental damage protection. (It covers accidental drops, spills, power surges and fire damage.)The case is a nice dark gray color. It is sturdy and seems to be of very good quality.", "Date": "October 16, 2013"}, {"Title": "It's capable by and large, if you are able to overcome some inconveniences.", "Author": "Michael Scosyrev", "ReviewID": "R1ZPCB5395U0I0", "Overall": "4.0", "Content": "This is a review of Asus X750 JB DB71 with InteL's I 7, 7400HQ processor, 8 GB of RAM, two 1TB hard drives and N-Vidia GT 740 M graphics card.I am reviewing the computer as a whole, both hardware and software as they translate into overall experience.I've had this laptop 3 months and in about a week into owning it, I updated from Win 8 to Win 8.1The good:It definitely is a pretty powerful computer in the current time (Feb 2014). The quad core CPU is among the top processors currently on the market. 8 gb of ram is more enough for everyday computing. It does load up really quickly even though it has no solid state drive. Booting it up from being completely off, takes about 20 seconds.It has an optical drive, which was necessary for me as I back up my data permanently on DVDs.It has 4 total usb ports, with two of them being fast 3.0 ports.I have to say that since I use mine as a desktop replacement, I can not comment on the keyboard, screen, and battery life.The bad:Windows has quite a few bugs in this version (random minimization to desktop, random reappearance of annoying groups icon on the desktop, constant optical drive check when playing a video clip, media player always starts in minimized form, microsoft paint's default save as extension is .png). ALSO, the screen had to be calibrated for color every time I start windows as the setting is reset every time the computer restarts. I installed a program that loads windows to the desktop and gives me a traditional windows start button, so that aspect of win 8 experience has been resolved. Windows did reboot on its own once and failed to start another time.So basically, the software has been pretty annoying compared to previous versions of windows while the hardware performed well overall. Hard drive speed is decent but nothing to write home about. When viewing photos quickly, there is a noticeable delay. It's probably unavoidable with large photo files from modern cameras, but a hassle nevertheless.All in all, I am glad I bought this laptop as it was a good combination of features for the price. In fact, it was one of the only computers available with dual hard drives, dedicated graphics card, and the latest Intel processor.The battery is non-replaceable, so in a few years when the battery gets old, the computer will have to be used while plugged in only, unless you are brave enough to open it up and try replace the battery on your own.I think the reason this computer has so few reviews is because it's a niche machine. Not everyone need 2 tb of hard disk space, but for those who do, it's not a bad choice, especially if you are willing to live without a touch screen and are ok with the size of a 17-inch laptop. I expect this computer to be able to keep up with software updates for the next 4-5 yrs.", "Date": "February 22, 2014"}, {"Title": "Great device for price.", "Author": "Dunia Zamora Abarca", "ReviewID": "RGTMXXTB97R50", "Overall": "4.0", "Content": "I've only owned Dell, HP and Toshiba machines, and now that I have this Asus machine I couldn't be more happier.This has been a great purchase, can't regret it. Great processor, turns on immediately, doesn't take anything to boot up.I use it to edit pictures and personal stuff, works great with programs such as lightroom, photoshop, etc, and the image is clear.Also, I've been using it for video editing, and it's great too, awesome sound. Lots and lots of space, which is great for people like me which takes a lot of video and photograph to have a backup locally.The only complaint I have is about the battery, it days very fast and you have to keep it plugged in for it to work.Asides that, great purchase, totally recommendable.", "Date": "January 18, 2014"}, {"Title": "Very beautifully made", "Author": "Tealove", "ReviewID": "R3UPF9UCLAP9G1", "Overall": "5.0", "Content": "I have only utilized this laptop for a couple of days and it is very nice.  It was highly recommended by one of the IT guides at my workplace. I am familiar with ASUS products, as I have owned the Transformer tablet for a little over a year.  I like that the keyboard is standard-sized. I think Windows 8 is awesome.  It takes some getting used to, but I am learning.  I am utilizing this laptop for online courses in my doctoral program. Setup was easy. It is lightweight for its size and it is ergonomically designed well to lift with one hand when closed.  I am very impressed with it.", "Date": "January 10, 2014"}, {"Title": "Great expectations, but", "Author": "Edward Ripperger", "ReviewID": "R3HW36V00DGMZN", "Overall": "3.0", "Content": "after downloading Win 8.1 there seems to be problems.  I am unable to print with my Canon printer (one year old).", "Date": "January 7, 2014"}, {"Title": "Solid offering", "Author": "Jim Bernheimer", "ReviewID": "R16AMAGF4QXIXV", "Overall": "4.0", "Content": "As part of my participation in the Amazon Vines program, I received this product for review.It's a nice looking laptop.  Easy to carry and I'm letting my 11 year old put it through its paces.  So far there was one glitch when it was updating where the laptop froze completely.  We had to unplug it and remove the battery to bring it back up.  Fortunately, we haven experienced that since.You shouldn't judge a laptop by the operating system.  I'm a bit down on Windows 8, especially on a non-touchscreen, but the daughter has no real issues using it and I've recently gotten some self-paced windows 8 training material that should make things a bit easier.  We haven't activated the cloud storage feature yet.  If we do, I'll come back and update the review.  The sound quality, graphics quality and battery life all meet my expectations for a laptop in this price range.  The large hard drive should also add to its effective service life.Overall, this is a good piece of equipment that should service my daughter's entertainment and educational needs for several years to come.", "Date": "November 1, 2013"}, {"Title": "A nice computer for the performance concious user", "Author": "Lill", "ReviewID": "R3AXT41O3JPIBO", "Overall": "4.0", "Content": "FAST.  Mine came with Windows 8.0, so I had to upgrade to 8.1 and then do the 8.1 Update.  I prefer the \"desktop\" mode, but the touchscreen (which I was a little leary about) comes in quite handy when combined with a mouse.  There is \"bloatware\", a negative to anyone, in my opinion; especially to an inexperienced user.  Figuring out Windows 8 and trying to see through all the extraneous programs (separating Microsoft and \"other manufacturer's\" products) was a royal pain.", "Date": "May 29, 2014"}, {"Title": "Almost perfect", "Author": "sparky", "ReviewID": "R2Y4WDSU0UMWO3", "Overall": "4.0", "Content": "There are many laptops out there and it is worth the time to find which one is right for you. I didn't think my needs were all that unique until I started doing some research. This review is written while the unit is fresh out of the box.About me: I use my computer for the usual office stuff, web searches and sometimes some pretty heavy photo editing and web page development. I typically work with multiple programs open and require the ability to see multiple documents side-by-side. Thus, the 17 inch+ screen is a must have. It also impresses some clients when I need to give presentations.What I learned: Anytime data is displayed as a visual format (i.e. pictures and video), a graphics processor is used. The graphics processor seems to be a weak link in most hardware configurations and too quickly succumbs to thermal problems and/or slows down the display. This includes Photoshop and other similar programs. Therefore, it was pretty necessary to get a computer with its own dedicated graphics processor (GPU). No matter what your RAM or CPU, the GPU processes the visual data.This has both a dedicated and integrated graphics processor. Regarding an unfavorable review about the slow refresh rate due to the integrated processor, it only takes a few seconds to change some settings and make the dedicated processor (with its 2GB of RAM) the primary processor.Display resolution: There are other units out there that have a higher display resolution. Most programs, however, default to 1600 X 900. This includes the Office Suite and most software I use. The display is a bit better than my six year old machine and I have not compared higher resolution displays, so I don't have much to contribute on this matter. However, with the HDMI port, I might consider getting a separate monitor that sits safely on my desk when the day comes that I demand something more.Trackpad: It does some funny things sometimes, even when I am not touching it. It will take a little getting used to. The same is true for Windows 8. But it is better than a friend's new Lenovo machine which cost a bit more.Hard drive[s]: This is a funny machine that comes with two 1TB hard drives. Each is partitioned into two units, so at first it looks like there are four hard drives. The first hard drive is partitioned into drive C and is intended to store the operating system and main software. There appears to be custom settings for where information is stored. However, the naming conventions are a little funky, with the first drive being \"0\" (zero, with a smile to software developers) and partitions being A and B. Within the directory tree, these drives are referred to as C, D, E and F. Confused? Me too. But I am looking forward to figuring this out and making the most of it's potential. One reviewer commented that only one drive (0 or C) was easily removable, and from the looks of the case, nothing is easily removable. This cost a half star.Construction: The keyboard is the best I have typed on and I have consistently typed with 0 mistakes (a first for any computer and I have used many). It really fits my hands. Everything is where it should be and I rarely use the backspace (but when I do, it is right where it should be). One fault I noticed is that the \"esc\" key sometimes gets stuck. For a new machine, hours out of the box, this might be a deal breaker. If it were not for the hours I have spent configuring the machine and the thousands of dollars of software installed already, I might return it. This cost the review another half star. Overall, it seems solid enough. My second choice was a gaming machine that cost $200 more, but I was at the top end of my budget with this machine. The machine has a very slim design with 12 screws in the back. No easy access to RAM, HDs, or optical drive. Or the battery. Anything pertaining to the battery needs to be sent back to ASUS.Conclusion: If you want a decent machine that is fairly portable, a joy to use and has a HUGE amount of storage, this machine is great. If you want a machine that has greater upgrade potential, I suggest looking into one of the gaming machines. While I am not a gamer, I appreciate the ability to swap components without sending the machine in for servicing. I secretly wish I had the extra $200 for the extra 6GB of RAM, twice the resolution (when I needed it) and the ability to change the battery myself. I'm referring to the G750JW-NH71 by ASUS, though with an additional trade-off being an additional 4 pounds of weight with a relatively tiny hard drive. What prevented me from purchasing this machine (aside from the additional $200) was the lack of information (glossy or matte screen, optical drive [a must-have] and all the other missing information you might need to make an informed decision) you'll find when purchasing something online. I do LOVE, LOVE, LOVE the keyboard with the space between the keys. <3  So for, the rest is good enough.", "Date": "May 14, 2014"}, {"Title": "Awesome Laptop", "Author": "F RUIZ", "ReviewID": "R1WEP2ZCWSI2PO", "Overall": "5.0", "Content": "The screen size is just what I was looking for in a laptop for the price. All others at this price with this size screen were a couple of hundred dollars more and didn't give me as many features as the ASUS. The speed on this laptop is awesome. It delivers on its 2 second start up time. Definitely recommend it.", "Date": "May 11, 2014"}, {"Title": "great laptop", "Author": "Charles Chapman", "ReviewID": "R1TOUFZARKLAZI", "Overall": "5.0", "Content": "Had fun removing Windows 8 in favour of Windows 7, but all in all amazing laptop; would definitely buy again.", "Date": "May 9, 2014"}, {"Title": "love this laptop!", "Author": "blackberry81", "ReviewID": "R26BB0QJYD3IAI", "Overall": "5.0", "Content": "This is a great laptop. I love love it. it does everything i want it to do. i have no problems with the windows 8 system on the laptop. I would recommend this laptop to everyone", "Date": "April 14, 2014"}, {"Title": "So far so good", "Author": "DaleB63 \"Dale B.\"", "ReviewID": "RNJ03F2483RKZ", "Overall": "5.0", "Content": "Old laptop lost disk drive, and old enough that didn't mind so much buying a whole new laptop. The NVIDIA GeForce graphics are definitely a step up from the on-board graphics; glad I spent the extra money on that. I play Lord of The Rings Online, and the optimizer put the graphics at Very High, which was amazing. I went to max resolution and backed it off to High, which is still way nicer than my old laptop. Wasn't too keen on the new chiclet style keyboards, but in practice it's not so bad. I've only had this about a month, so I can't speak to reliability yet, but, as of right now, I would definitely consider another ASUS laptop in the future.", "Date": "April 10, 2014"}, {"Title": "Good specs, but bad quality screen.", "Author": "William", "ReviewID": "R2Y263RBOY8XDU", "Overall": "2.0", "Content": "This computer has impressive specs for an impressive price. I got it for $800 at Microcenter and bought it for gaming. Everything was looking good...until I saw the actual display come on. The colors are very, very weak and washed out looking. This is a massive problem for me as I bought this computer specifically for gaming. I got into one game, League of Legends and after setting the graphics to maximum was immediately disgusted with the image quality.The darks are incredibly weak and the colors are washed out and not vibrant. I checked my older laptop just to make sure I wasn't going crazy, turns out the colors look much better on my older system. After screwing around with the contrast, brightness, gamma, and the saturation for several hours, I've just about given up and will probably return this system to the store. I would not recommend this computer to anybody who likes a good quality image on the screen.", "Date": "March 29, 2014"}, {"Title": "great product", "Author": "Darrion", "ReviewID": "R1DGMDHBRWOCKX", "Overall": "5.0", "Content": "This laptop worked perfectly for all of my gaming needs, it out performs my expectations. Even tho its a battery hog its well worth it", "Date": "March 24, 2014"}, {"Title": "Great computer, especially for the price.", "Author": "Vicki Rosamond", "ReviewID": "RTBLG5BKYLYS2", "Overall": "5.0", "Content": "My son (12 yrs old) started at a virtual on-line college prep academy and needed a reliable, fast laptop. This one does everything and more.  I read all the reviews and decided on this one. The touch pad takes a little getting used to with the integrated left/right mouse buttons but not difficult.  Still occasionally hit the touchpad when typing which is frustrating, but that is a general problem with most laptops. My son has always used Window 8 so that was not a problem and he has taught me :).  A touch screen would make it easier but didn't want the extra cost.  He plays several games on it (Planetside, Minecraft, etc) with no lagging.  There were several comments about the screen resolution but it looks great.  It never gets hot like my old laptop did. The only thing that is disappointing but I knew going in, is the short battery life - we only get about 3 hours of active use so we always take the power cord. All in all, I highly recommend this laptop.", "Date": "March 19, 2014"}, {"Title": "Good", "Author": "iulian gramada", "ReviewID": "RJVCS1JZV52TT", "Overall": "4.0", "Content": "A good laptop for the money. It moves really fast, the only thing I do not understand is why 2 hdd of 5200 rpm one could have been ssd sor a little extra.", "Date": "March 11, 2014"}, {"Title": "A present for me", "Author": "A. J. Powers", "ReviewID": "R3H5I45H518XPD", "Overall": "5.0", "Content": "I love my new laptop, the main reason I got this one was because i wanted a bigger screen and it is perfect. I have always loved ASUS computers, my last one is an ASUS and my husband is using it now and it is still going strong, no issues with it. This laptop has not been a disappointment to me, it is running great and I did not find it hard at all to adapt to Windows 8.", "Date": "March 7, 2014"}, {"Title": "Very decent computer for the price.", "Author": "Daniel and Joanne Hernandez", "ReviewID": "R14Y9SIOPMZCI2", "Overall": "4.0", "Content": "Bought this laptop because I needed a new laptop to replace my old one from about 2008. This fit the bill perfectly. While I experienced a few software issues with it, all of it was ironed out through Windows updates and the installation of Windows 8.1. When fully started up, the computer is spiffy, fast, and plays a decent handful of games like Team Fortress 2, Portal 2, Borderlands 2 and more at quite decent speeds. I'm really satisfied.", "Date": "February 23, 2014"}, {"Title": "Pros: 2 TB space + 8GB ( 8GB expansion), screen size/quality, premium build, very responsive,  Cons: Internal battery, trackpad", "Author": "Val", "ReviewID": "R2LBJ33OYUCF4Y", "Overall": "5.0", "Content": "Right off the bat, this laptop is enormus in size at 17.3'' is more than enough visual space as a destop replacement.  The build quality is premium in feel and touch.  The full keyboard is spacious with very comfortable typing buttons (as I am writing this review using this latop).  It is suprisingly thin and light considering how big the laptop is.  As mentioned in the reviews before, the trackpad is subpar and even annoying at times.  Ten minutes into using the trackpad, I kept hitting the right click and zoom in functions.  I highly recommend a mouse for long periods of use and avoiding the trackpad.  The screen quality is very bright and clear.  As I will be primarily using this laptop for video editing and a daily driver (and a few games).  The audio is good; the speaker are hidden at the top of the laptop.  The specs of the laptop are spectacular.  There is more than enough space ( and optional RAM expansion) for high quality and strenuous multitasking.  The program and apps are very responsive without any lag whatsoever.  As mentioned in a previous review merging the partitions are recommended.  Also as mentioned Windows 8 and 8.1 does take some time getting used to.  It is a drag without a touchscreen laptop, but that is a weary function that the consumer is aware of when purchasing this latop.  I personally do not care much for the touch screen option, but can see why it would be convienent.  This laptop is very well equiped for being under 1000 dollars.  Some things that I do wish the laptop has are the black light keyboard and optional battery. Otherwise,  I highly recommend it.Pros: 2 TB space + 8GB ( 8GB expansion), screen size/quality, premium build, very responsive, cheaper on Amazon Cons: Internal battery, trackpad, no blacklight keyboard", "Date": "January 31, 2014"}, {"Title": "Sharp Graphics, Great Power, and Plenty of Space", "Author": "DQuin", "ReviewID": "R2QFUG8HBTL1AS", "Overall": "5.0", "Content": "I was a little worried when I first charged the machine as it had a blinking amber light for the battery, but after letting the battery drain all the way down I haven't seen the same thing.I'm not a fan of Windows 8, but installed OpenSuSE and FreeBSD partitions on the 2nd harddrive, and have been happy with the results.I've always enjoyed Asus components and thought I'd give them a try for my first notebook.I must say I would recommend this.", "Date": "January 28, 2014"}, {"Title": "MOUSEDPAD MISSED", "Author": "albertohidalgo", "ReviewID": "R10KKZFXOEUAIN", "Overall": "1.0", "Content": "Everything was perfect when opened box, look  beautiful but on the first day of use, the mousepad stopped working, I have tried to find thousands of ways to make it work but no update serves, touches me assume the failure because I am in ecuador and is very difficult to give it back for warranty.", "Date": "January 25, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DXFF6QC"}}