{"Reviews": [{"Title": "True Quality and Awesome design", "Author": "W.", "ReviewID": "R2IJ44BMW8PP60", "Overall": "5.0", "Content": "This laptop is truly designed with ultimate quality and performance.You can customize the colors from top to bottom with each having the ability to have a different color.Performance is fantastic for anyone wanting to use this for games or use it for multiple virtual machines (which is what i use it for.I easily added another 16 gig ram giving me a total of 24gb.  The laptop supports up to 32 gb.  Coarse I may try pushing the limit one day to see if i can go above the 32gb as I have done with other systems that stated max ram of 8gb.It has 3 drive bays.  2 are 2.5 hard drive bays and the 3rd is a mSata drive bay.  I have always made sure i had 2 hard drives in order to use raid and I was astounded to read you could put in 3 256 SSD drives.This laptop is also a desktop replacement and has a full keyboard.The brushed aluminium that adds the quality all laptops should have and the palm rest is smooth but not glossy and if you do leave a finger print on the palm rest, it is hardly seen and you can easily rub them out by using 2 fingers over themLaptops that have glossy tops and palm rests really look aweful after using them one time.  You won't get that with this laptop.Oh and did i mention the backlit keyboard and the number pad can have a different color backlit than the rest of the keyboard.Almost forgot!  The touchpad will light up to any color you chose.4 usb 3.0 portsLed screen is easy to read.I am very satisfied with this laptop after only using it a few days.It's design is a piece of fine art.Kudo's to the designers and Dell for producing this well made laptop.Note:  the additional hard drives require a special mini sata angle adapter.", "Date": "August 2, 2013"}, {"Title": "Overall fair/good", "Author": "Amazon Customer", "ReviewID": "R2BMOOE2LN3V2I", "Overall": "3.0", "Content": "Overall good laptop just wasn't as fast as I thought it would be. The graphics are awesome and I love the durability and design.  I also love the customizable light feature.", "Date": "March 10, 2014"}, {"Title": "Screams quality, but big and heavy even among gaming laptops", "Author": "John Brown", "ReviewID": "RTPQ78I2JHADG", "Overall": "5.0", "Content": "Let me start by saying I knew I was getting a big heavy brick of a gaming laptop.  I have owned Asus ROG laptops before and I have family who still do.  This laptop is significantly heavier, and makes no attempt at being thin.  For me not an issue I wanted a desktop replacement that will generally only travel from bedroom to living room, but if you need a mobile powerhouse look at the Asus (still big but not nearly as big or heavy), MSI GS series or the Razer Blade.This laptop has good specs but is a little lacking for the price range.  8gb RAM is about half of other gaming laptops at the same price.  2.0 Audio when most laptops in the range will offer 2.1 (have a subwoofer).  750gb HDD other laptops will offer more storage or ssd at similar price range.  That being said I got this on a warehouse deal, so with savings calculated in I got an excellent deal.One of the big positives (for me) I have already found with this computer is that Dell/Alienware is nice enough to include the hard drive caddy so I can add an ssd without buying additional parts (I had to pay $50 to buy this part for an HP I also own).  I was also happy to find that Alienware was nice enough to put the 8gb ram in the harder to reach ram slots, which are under the keyboard requiring a full teardown of the computer.  This makes adding up to 16gb additional ram, for a total of 24gb, a breeze.I love the lighting effects, I had an issue initially where using an \"advanced\" rather than \"basic\" theme would cause the lights not to work on reboot.  The issue was resolved by installing the newest software and haven't had a problem since.  I love that Alienware didn't load the computer down with bloatware my computer came with just their utilities installed.The track pad and Keyboard are both very good, I was surprised to find that the trackpad is very capable (most gaming laptops I have used don't put a lot of quality in the trackpad since the intended user is likely to use a mouse anyway).One Disappointment for me is that Dell went with a cheaper Broadcom Wireless Chip rather than the Killer gaming adapter, though they did include the Killer LAN adapter.  For a gaming computer having the Killer adapter helps reduce lag time, I will admit that the Broadcom has so far performed very well.I am using this primarily for development and I am so far very impressed with the performance.  I love the screen size it's great for snapping 2 applications on each side of the screen for easier multitasking.Lastly I will just say that Alienware quality is second to none.  The build quality on this machine is amazing, no parts feel loose or cheap.  The \"soft touch\" texture they used for all the exposed plastic parts is a nice touch and makes the computer much more pleasant to use.", "Date": "February 14, 2014"}, {"Title": "Cool looks, great ventilation, great expandability, very reasonably priced, but, it's a Dell", "Author": "transcend", "ReviewID": "R31I7GP2BFHV5D", "Overall": "4.0", "Content": "The selling point with this performance laptop is its expandability and well-designed case.Starting with the upgrades, observations, notes:1- Bottom cover removes fairly easily.  Fastened by just two micro screws and a slightly annoying slide technique.2- access to 2 HD bays is straightforward.  Each bay is fastened with 4 screws to the case and 4 screws for each hd enclosure.3- access to memory slots is immediately available once the bottom cover is slid off.  access to the other two slots is tedious, but hard from difficult.  Those two inner slots (1&2) come with the stock 4GBs for a total of 8 gb with 2 slots empty.4- access to battery only by removing the cover, and it's fastened by two screws and a wire based connector.5- the other hd bay is occupied with a dvdr drive.  it's a 4x4 screw deal like the normal hd bays, but it has room for about 2 ssds there, but unfortunately it can only support 1 drive in here, despite there being space for 2 ssds.  motherboard/chipset restrictions i suppose, idk.6- also, to use this (tertiary HD bay)bay for an ssd you'll need a special cable.  I'll mention the exact name when i revisit this review.To achieve the advertised \"quad play ssd config\", you use three ssd's installed inside and an internal msata sad  via a connector which is located under the palm rest, which requires further disassembly into an area that should be more readily available.BIOS:It came with A05 and though I'm still fresh into my research there are modded bioses available that unlock more features.  But, among those in the stock bios were decent over-clocking options.UEFI compat.I'm running it pretty aggressively atm with no problems.  heat is not bad.  fan has never gone into extreme cooling speeds except when I ran a bios run diagnostic that forced it.  and when it did, i was pretty amazed how loud it was.  seemed very strong.  definitely reassuring.So, I will be revisiting this review soon as I've only had this a week and my setup isn't even complete yet (awaiting another ssd for raid stripe) but plan to log some good hours in by christmas.looking like a solid 4.5 now.  hard to come up with any strong negatives, even under a critical eye.  price is high in a sense, very reasonable in another.  the case is well designed in terms of looks and ventilation, as well as space for ssd expandability and room for plenty of quality heatsinks and dissipators.  From a macro view, I think the transition to the even larger screens makes sense.  The 17.3 inch screen definitely feels an inch or so, small.", "Date": "December 9, 2013"}, {"Title": "Amazingly Powerful Laptop", "Author": "Lauren A Castner \"You are braver than you bel...", "ReviewID": "R2P5JUYX88MH5T", "Overall": "5.0", "Content": "Although this review is 5 Stars I am going to point out that there are a few flaws with these laptops, but keep in mind, there are many positives!I'll start with the CONS;1. YOU WILL GET A TON OF C***. From everyone you know and meet, literally everyone. At first people are really excited and impressed that you have one but after the first 10 minutes they start saying things like, \"You could have built one that is a lot better than that and cheaper!\" Okay, that's great and all but they have no idea what they're talking about most of the time. When compared to similar custom built laptops you'll notice that Alienware is only ever no more than $200 more expensive. And that's because Alienware uses high end components and comes with features not available on custom rigs and plus you get the brand name. I wouldn't suggest bringing one of these to class unless you're ready for a battle and you know your specs.2. THEY ARE HEAVY. But that is common with gaming laptops and towers so it's not a big deal.3. IT DOESN'T COME WITH A MANUAL. If you're new to PC gaming like I was you'll wonder why you can't run games on the highest quality setting at first. You need to update your video card (which needs to be done through the manufacturers website), update everything and leave your BIOS alone for now. Mess around with it for a bit, find your ideal settings.4. THE BATTERY LIFE IS SHORT. When you're buying a gaming laptop you have to expect that you'll have a short battery life. Enough said.5. YOU'LL REALIZE HOW WEIRD PEOPLE ARE. I have no idea why but people just love to touch these things! It's really crazy, actually. They run their fingers over the keys and touch the pad and play with the Alien's eyes. It's really funny to watch how weird people get when they see one of these laptops for the first time, but after a while it gets extremely annoying.6. AND MY FAVORITE CON; Your least favorite phrase will now be, \"Is that an Alienware?!\" No, it's just my highly advanced toaster. The moment this question is asked be prepared to answer questions, argue about specs, and RARELY enjoy a nice conversation about mods and game performance.Now for the PROS;1. SO SO SO MUCH FUN! This laptop, this brand, is amazing! It is so powerful and cool and easy to work with. The light up keyboard is easy to program and really cool to mess with.2. IT HAS AMAZING FEATURES. When I got this laptop I did what I do with any of my new laptops, I downloaded Microsoft Security Essentials. When I was done downloading a screen popped up, \"You already have this software on your system.\" What? Yeah, it comes preloaded with a QUALITY, FREE, virus scanner. It has a systems checkup that runs tests on EVERYTHING. It has Steam preloaded, it has an awesome camera, it has everything! If I wasn't getting this for gaming I'd get it for my Grandma because it's so easy to work with.3. GRAPHICS CARD. This graphics card is a Class 1. Which means it's top of the line, fast, amazing, beautiful, you'll want to marry it. I can run 100+ mods on Skyrim with 40 FPS. Which is really, really good. It's a $500 graphics card.4. SO VERY STURDY. This laptop is literally a brick, which isn't a bad thing. It's heavy duty and can withstand the worst temper tantrum out there. Unless you shoot it, drop it in the tub, or drive over it, this thing is going to last.5. BE VEWY QUIET, WE'RE HUNTING RABBITS. Okay, joke on my part, but really. It's so quiet! Everything about this laptop is just stealthy.6. \"MOM! CAN YOU GRAB ME A BLANKET?\" You will literally get no heat from this laptop. Maybe a few degrees hotter than room temperature, but that's only if you're sitting with it on your lap, running it at high power, for hours on end. It's literally cold to the touch.7. IT'S HEAVY! Okay, this one is kind of a joke but it's true! If anyone every tries to steal it from you, just hit them with it. It's sturdy enough to take the impact.8. HUGE HARD DRIVE. Remember when I said I have 100+ mods? You have 750gb worth of space, right? With Skyrim and mods installed that will only take around 25gb. Go crazy!9. WOW, IT'S FAST! Yeah, really fast. In every way shape and form. I have really terrible internet where I live and for some reason, even though I'm at the opposite end of my house from the modem, I get faster internet on this than I do on my other laptop. Obviously with 16gb of RAM/Memory it's going to be fast processing wise, but I think the internet has a magical booster or something.10. YOU'LL FALL IN LOVE! When you get this laptop you need to understand that there is a lot of learning involved. It takes a bit of time and you may hate it at first but it's completely worth it. It's so nice to work with, it feels nice, it looks nice, it runs great. It's a wonderful investment. If you take care of this thing it will last you longer than the average laptop which is only about 5 years. Maybe with one upgrade this laptop will last 10 years and still act brand new.Conclusion: Is it worth it? Yeah, it is. You get what you pay for and so much more.", "Date": "February 18, 2014"}, {"Title": "Nice, but not without flaws.", "Author": "Wren", "ReviewID": "RNA28XZ8TM4M8", "Overall": "4.0", "Content": "Upon receiving this laptop, I was very impressed by everything exterior. From the padded box it arrived in to the sturdiness of the laptop itself. It is rather large and weighty, but I will be using this as a \"mobile desktop PC\", as I did with my previous. The AlienFX lighting adds a nice, if flamboyant, touch when powered on.The system ships with Windows 8, which can be upgraded to Windows 8.1 free of charge. Without getting into what is better, if you prefer a standard desktop environment, I recommend installing Classic Shell. Aside from that, I was surprised at how little bloatware came pre-installed. Just a few Alienware/Dell utilities and Steam, all of which can be easily uninstalled.Performance-wise it feels insignificantly faster than my old Asus G73SW doing common tasks but 3D performance in things like Blender, Radiant, Unreal Editor and games are much better. The installed Nvidia GeForce GTX 765M should fall somewhere between the speed of a desktop GTX 750 and GTX 760. I am impressed with the overall performance of the system.I deducted one star because of a problem exhibited with S3 sleep mode and USB 3.0 devices. When the system goes into sleep mode and is reawakened, USB devices fail to reawaken until unplugged and replugged. My solution was to disable sleep and use hibernate instead. Windows 8/8.1 restores from hibernate quickly, so for me, this is not a major problem.", "Date": "March 11, 2014"}, {"Title": "I like it!", "Author": "Mark M. Magers", "ReviewID": "R2L9O1VKD146YO", "Overall": "4.0", "Content": "Bought this laptop for $1,314 on Cyber Monday 2013. I was looking for a  laptop at the time and just so ran into this computer during a lightning deal. Its a great computer. It runs almost every game I have at ultra settings. To give you an idea, Battlefield 4, The Witcher 2, and Sleeping Doges suffered low frame rate issues while on ultra. It runs these games great on very high settings though. I recommend it for the price I got it for, but I probably wouldn't buy it for the price its going for now, which is around $1,600. Something else to consider is that its very heavy, but I knew that when I bought it.", "Date": "February 4, 2014"}, {"Title": "Perfect gaming computer", "Author": "Shanghaimama", "ReviewID": "RQFOK4NVJDMG3", "Overall": "5.0", "Content": "We bought this for my son for Christmas and it is perfect.  It never slows or lags.  Just what he wanted for game play.", "Date": "January 21, 2014"}, {"Title": "This thing is a monster.", "Author": "Stephen Smith", "ReviewID": "R3AU9MUU1QYCJX", "Overall": "5.0", "Content": "Lightweight?  No like a lead balloon.  But powerful beyond what I'd hoped for.  I am however, going to put a solid state drive in it as that seems to be the only bottleneck that seems to slow it down.  The screen is so clear and video on it is a real pleasure.  The only gripe I have is the touchpad is a bit wonky at times and seems to be a possible driver issue or possibly a support issue when using the Chrome browser,", "Date": "January 7, 2014"}, {"Title": "Alienware,you deserve it!", "Author": "xiaojun lin", "ReviewID": "R1NMDOODW2ZHIO", "Overall": "5.0", "Content": "In Chinese you have to pay more than 20,000rmb (about 3,300 dollers) for the same configurations laptop.So,no more hesitation.It can run all games in this planet perfectly.Cool,powerful,fast……maybe a little bit heavy.Strong like a kryptonian~么么哒，美帝的东西真给力", "Date": "January 6, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DL499LI"}}