{"Reviews": [{"Title": "WiFi Problems Not Fixed", "Author": "Celtic Tiger", "ReviewID": "R1G9VLG5738DRP", "Overall": "1.0", "Content": "I read about all the Dell laptop WiFi problems; but thought they would have them solved by now.  Shame on me for thinking so.  I took my kid to college and when we got to his dorm, his iphone and ipad connected immediately and with fast downloads and functionality.  His new $1,500 plus laptop...painfully slow to the point of being unusable.  He's using ethernet right now to just get some functionality out of it.  He's going to see if the college techs have a solution and if not; it's going back.  Shame on Dell for not fixing a known problem for so long.Do not buy this laptop!", "Date": "August 20, 2013"}, {"Title": "Perfect!", "Author": "Reese", "ReviewID": "R34OP2AHXLHUUO", "Overall": "5.0", "Content": "I don't know what the other review is all about but the wifi works great. If it didn't it would most likely just need a software update. The Hardware is fine.I was surprised to find out that the battery seems to be built into the system and is not removable. I hope that doesn't become an issue later.I got it updated to windows 8.1 and it is running GREAT!I really like the sleek look and the speed. It's perfect.I find the keyboard to be much better than other models I have tried and I haven't had any issues with the track pad either.I am very happy with this purchase!EDIT: I would also like to add that the screen on this laptop is amazing! The resolution is very high and the colors seem perfect!", "Date": "December 9, 2013"}, {"Title": "Nice Laptop!", "Author": "Jason P. Baxter \"Tech Guru\"", "ReviewID": "RW7C71F8BI32H", "Overall": "4.0", "Content": "So far so good. Laptop performs very well and fast. I installed Windows 7 Ultimate in favor over windows 8. The Intel Smart Response Technology using the 32 SSD Cache works very well and has me second guessing replacing the 750GB 7200RPM HDD. It's a lot of work downgrading to Windows 7 with finding the drivers and all but worth it for me considering how I do not care for Windows 8. WIFI works well and the screen is very nice. Fit and finish of the laptop is high quality. I would recommend!", "Date": "December 6, 2013"}, {"Title": "Disappointed - some my fault, some not...", "Author": "Sean J Allburn", "ReviewID": "R26N6Z6T6TQVCH", "Overall": "1.0", "Content": "This laptop is extremely heavy.  I did not notice the listed weight when buying, so it's my fault, but it is ridiculously heavy.  Additionally, though, the second time I used the DVD R/W drive, it malfunctioned - - it will not eject, so the disc is stuck inside!", "Date": "April 28, 2014"}, {"Title": "Great great performance laptop!!", "Author": "Su, Lung-Hsing", "ReviewID": "R1G3MWNBGNMPA", "Overall": "5.0", "Content": "Great quality, great design, great material, great performance, great price to me~It takes me with excellent experience during usual use/ business / entertainment.", "Date": "February 7, 2014"}, {"Title": "Far from perfect, WiFi is definitely very poor", "Author": "Mykhailo", "ReviewID": "R16WJ8GRJ7H9WS", "Overall": "3.0", "Content": "WiFi is definitely very poor. WiFi on my smatfones and laptops of 2009 year of production is much better.Battary weak.and few other things to complaine about", "Date": "January 31, 2014"}, {"Title": "disappointed product", "Author": "Chunyang Bian", "ReviewID": "RF1G11MMJLKLU", "Overall": "1.0", "Content": "Because It  always so hot for its bad radiating. what's more, I playing games, it can have delay when turn to the high performance NVIDIA processor.", "Date": "December 1, 2013"}], "ProductInfo": {"Price": "$1,700.00", "Features": "Intel i7-3632QM 2.2 GHz Processor\n8 GB DIMM RAM\n750 GB 7200 rpm Hard Drive, 32 GB Solid-State Drive\n15.6-Inch Screen\nWindows 8", "Name": "Dell XPS XPS15-7363sLV 15.6-Inch Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/417jRVfCx0L._SY300_.jpg", "ProductID": "B00D6HBVFC"}}