{"Reviews": [{"Title": "A Winner", "Author": "Little T", "ReviewID": "R3VGX64SS836GH", "Overall": "5.0", "Content": "I've never owned a Toshiba, but I must say that it seems like their engineers did a lot of homework and produced a well-thought-out design that is visually appealing, lightweight, user friendly and low-cost.  A sincere thank you to the folks who reviewed this product before I did.  You helped me make the right choice.  I love this laptop (and Windows 7).", "Date": "September 5, 2013"}, {"Title": "For the price, you can't beat this laptop", "Author": "Todd", "ReviewID": "ROCZUR45DGUQB", "Overall": "5.0", "Content": "I received the Toshiba Satellite C55-A5245 yesterday from Amazon.  Ordering process was simple and 1 day delivery time frame was fulfilled on time.As far as the laptop itself, it's pretty dang nice.  Tons of features, sturdy feel and solid OS (WIN7 Home Premium).  Monitor has a glass cover, which only enhances a very crisp and vivid HD viewing experience. Easily installed MS Office Home & Student and Norton Internet Security from available seats I still had.  Initial start up was smooth...with the WIFI installation utility launching automatically and locating my WIFI...so that was nice.  CPU/processor definitely has some muscle and the OS runs clean and efficient. No hogging or bogging down of system resources.  Importing of my favorites to both IE and Firefox was quick and easy. Still  playing around with this laptop, but really liking it so far. My daughter reloaded her MineCraft account/game and it works flawlessly with lightning fast response times. No lagging like she used to experience on our MacBook (sorry Apple).  I have been rather impressed with Toshiba laptops we bought our son one  last year...and I am again very impressed with my newest Toshiba laptop purchase.  IMHO, Toshiba really gets it when it comes to laptops. For $449 from Amazon, this laptop is a steal for all the features and performance it delivers.", "Date": "September 4, 2013"}, {"Title": "Black Beauty", "Author": "Jonathan C. Becker \"jayhawkbookster\"", "ReviewID": "R1DEUEA93Z51D4", "Overall": "4.0", "Content": "Replacement for an old laptop.  Quite an upgrade from Windows XP to Window 7 Home Premium operating system.  Screen works in sunlight.  Large keyboards with a 10-key pad.  Because of the keypad, the Qwerty keyboard and pad are slightly offset to the left and that takes some adjustment.  Has three USB  ports,  one HDMI, one ethernet port and a VGA connection.  Easy to add additional monitor.  Only quibble is the direction arrows on the keyboard are tiny,  Price to value very good,", "Date": "March 25, 2014"}, {"Title": "Horrible Battery Life", "Author": "C. Saunders", "ReviewID": "R367HN8K0VYX0Y", "Overall": "1.0", "Content": "The computer itself works wonders, the battery died 2 months so I am only able to use it while plugged into an outlet.", "Date": "December 11, 2013"}, {"Title": "WHAT CAN I SAY?", "Author": "Daniel B. Rutter \"Book'um Dano\"", "ReviewID": "R3JGC682KMIKYI", "Overall": "5.0", "Content": "This is a great lap top at a great price. It works lovely and the keyboard is surprisingly similar to the keyboard for my desktop...very quick and easy to get used to. I'm lovin' it!", "Date": "May 3, 2014"}, {"Title": "Overall a good computer", "Author": "John C.", "ReviewID": "RYQQJMP7GG1WR", "Overall": "4.0", "Content": "I'm enjoying my Toshiba over my last computer.  It plays all my dvd's, so I don't carry around my portable dvd player.  It's a very fast computer.  The only thing I was disappointed in, was it didn't come with Microsoft office.  For the price I paid, you think Microsoft would be included. Overall I have been impressed with my Toshiba.", "Date": "April 29, 2014"}, {"Title": "Windows 7 sealed the deal.", "Author": "Randy", "ReviewID": "R1J884QIH4IUBK", "Overall": "5.0", "Content": "Just when I thought Windows 7 was gone forever it shows up on this machine. What a nice surprise!  I think I am like al lot of people and not excited about the windows 8 operating system. I already have a Toshiba computer that is working great for me so I had no reservations buying this one for my wife. If you are looking for a Windows 7 machine I would jump on this one while you can.", "Date": "April 29, 2014"}, {"Title": "Poor design a step back from previous models", "Author": "TangSooDo", "ReviewID": "R2VMLDJFFR17JA", "Overall": "3.0", "Content": "This is a review after 2 months of daily use and my final verdict is that it is OK.I purchased this Toshiba because the last Toshiba laptop I had lasted about 6 years, which is significantly more than the industry average.  I have only two main issues with this laptop: the touchpad and the function keys.The touchpad placement makes typing difficult at times.  I'm typing this review on this computer right now, but every once in a while, the cursor will jump to a place further up in a paragraph if my hands come anywhere near the touchpad, I have to angle my hands in an inverted V to stay away.  It is an uncomfortable position.  I didn't have this problem with the last Toshiba, so whatever they changed, it was a bad idea.  The keyboard as a whole feels cramped because of the unnatural angle I have to hold my hands at.The second major draw back are the function keys which are located above the numbers on your standard keyboard.  Normally, these are the keys number F1-F12, but on this lap top, the function keys are replaced by special commands such as a screen dimmer, a help button, a key to disable the mouse, functions to pause or skip a video or song or disable the wireless.  You might not use hotkeys as much, but some of us use those function keys to do things like bring up the toolbar in adobe documents so you can print your pages.  Well, you have to hold down the FN key before doing that.  Also, if you mistype a number and hit a key above it,  whoops, you disable your mouse.This laptop has 3 USB ports, one on the left and two on the right.  It has an HDMI port and VGA adapter on the right, jacks for headphone and mic and an SD card reader port in the front.  HDMI should be standard as VGA is on the way out.I got an additional stick of Ram and installed it myself in about 2 minutes using a fillips head screwdriver.  Funny how you can save yourself $50 by simply doing it yourself.  It's really that easy.  When you unscrew the panel on the bottom of your laptop, you will see the slot for the memory right there.  You put in an additional stick and there you go, a more powerful laptop in 2 minutes.  A ten year old with experience with Lego blocks could do it, so I recommend you do it too.I'm not sure I can recommend this laptop to others.  It makes my wrists sore from typing in a weird position.  It's OK for the price.  I have a neutral sentiment.", "Date": "April 22, 2014"}, {"Title": "Very pleased with this laptop which uses Windows 7", "Author": "Adrienne Baxter", "ReviewID": "R340RJS3E00VO4", "Overall": "5.0", "Content": "I haven't had this laptop very long but, so far, I like it better than any previous laptop I have ever owned, including a Dell Inspiron, a Gateway netbook, a Sony Vaio (which was a total piece of junk), a different Toshiba Satellite which ran Windows 8 software, and even an Apple MacBook Air which had an operating system that I absolutely hated and, including the warranty, cost about FIVE TIMES MORE than this Toshiba Satellite..This laptop runs quickly and smoothly, and it has plenty of memory. I use it primarily for working with photographs, doing research on various topics, writing emails, and typing up notes and/or documents for various purposes.My only complaint is that it does not have Microsoft Word installed on it. Instead, it comes with a trial version of Microsoft Office, a software program which I have never even liked plus it costs extra to actually purchase, activate, and use on a regular basis.I realize this laptop is still pretty new but, so far, the battery holds a charge much longer than any of the above-mentioned laptops. The screen size is just right for whatever I'm doing. One thing which takes some getting used to is the layout of the keyboard which has a touchpad and space bar which really should be placed further to the right. However, it doesn't take too long to get accustomed to the current layout.I have also noticed that all of my friends who own a Toshiba Satellite have fewer problems than other brand on the market. I would definitely recommend this laptop to prospective buyers.", "Date": "April 19, 2014"}, {"Title": "Good Buy", "Author": "Meags561", "ReviewID": "R5X2GH09SM0AP", "Overall": "4.0", "Content": "There was nothing required to start using this laptop. Just open and run. I've been using it for a few months now, mostly for school, and I have had no problems with it.", "Date": "April 18, 2014"}, {"Title": "Just what I ws looking for.", "Author": "N Z of California", "ReviewID": "R1EY86MTGF36MK", "Overall": "5.0", "Content": "Had purchased new computer locally and it had Windows 8.  Just couldn't stand it and went for this on with Windows 7. Am very happy with it.", "Date": "December 7, 2013"}, {"Title": "Toshiba Satellite c55-A5245 15.6 Laptop", "Author": "Philip C. Gerace", "ReviewID": "R37B3BYVIMMGN4", "Overall": "5.0", "Content": "exceeds my expectations. very happy with my purchase. great buy for product and price I paid. Excellent product excellent price.", "Date": "December 6, 2013"}, {"Title": "Second time is the charm!", "Author": "James T. Davenport", "ReviewID": "R2K52O6C3ASOGD", "Overall": "4.0", "Content": "Replacement for an identical computer ordered from a 'Featured Seller.'  Great little laptop, has been very easy to set up and work with.  Now I am very happy.", "Date": "December 4, 2013"}, {"Title": "Relieved and happy", "Author": "Denise S-F", "ReviewID": "RGQ9CRIEMQN2B", "Overall": "5.0", "Content": "While I'm willing to learn new tricks, starting over when my old computer died was not one of them.  This computer behaves just like my old one, only it is lighter in weight (Ya-a-a-h!) and has nice squares for the letters on the keyboard.  It does have one of it's old problems, too: The fonts when writing email jump from size to size at random.  If anyone out there is listening....  Overall, I am very happy and relieved that someone realized that not everyone wants to move on to the so-called next big thing.", "Date": "November 26, 2013"}, {"Title": "Great Quality Low Cost, not Cheap, L:aptop", "Author": "George Friedman", "ReviewID": "R347N4GA1KM7NT", "Overall": "5.0", "Content": "The best of the low cost, but solidly built, 15.6\" laptops with an Intel iCore processor and Windows 7. Great keyboard and clear display.", "Date": "November 26, 2013"}, {"Title": "Horrible Keyboard (not for students)", "Author": "Justin Price", "ReviewID": "R3JNH3XWBFOUNM", "Overall": "3.0", "Content": "The computer is decent, fast enough, and the windows 7 is a huge plus.My main complaint is the keyboard is so bad.  It misses a bunch of keystrokes, I'll be typing a doc only to look up and find several misspelled words because letters didn't register.  I'll try to type a URL, and half the time only ww registers.  It's just flimsy and cheap, you need to be extra deliberate with your keystrokes which obviously isn't conducive to typing quickly (would not recommend for students).  This just looks like an afterthought on Toshiba's part.  The computer is fine, I just wish the keyboard worked like it should.", "Date": "November 20, 2013"}, {"Title": "great product", "Author": "Darrell Moyer", "ReviewID": "R5GCESEGF1XKD", "Overall": "5.0", "Content": "Fast, windows -7 (I gave away a new laptop w/windows 8) design of keyboard with numbers pad, textured non-gloss finish,just seems to be well made.", "Date": "November 20, 2013"}, {"Title": "Nice Easy Computor", "Author": "Henry Lang", "ReviewID": "R27R4TY4KGDRPC", "Overall": "4.0", "Content": "So far this PC has produced what was written. easy to Navigate and work great. I would advise this PC for the simple users.", "Date": "November 20, 2013"}, {"Title": "Wonder why", "Author": "Caroline I. Bosland", "ReviewID": "R2LL6CBLR6IGMZ", "Overall": "3.0", "Content": "It keeps shutting off? Is it supposed to do that?  Haven't used it enough to see if it is really what I really had bargained for.", "Date": "October 23, 2013"}, {"Title": "Windows 7 and light weight", "Author": "Sam Nunn", "ReviewID": "RWW14IPHNV4GV", "Overall": "5.0", "Content": "Looks good, works good out of the box, and dose not have dreaded Windows 8. I wish it had the lit keyboard because I switch from computer to computer often and the black keyboard surface is hard for my tired eyes to read real quick. I added memory right away after I was certain it was working fully. I wish it had a button on the keyboard to open the DVD drive. Otherwise the features and functions are fine. So far, I'm very happy with it.", "Date": "October 16, 2013"}, {"Title": "Good computer.", "Author": "John E. Sullivan", "ReviewID": "R24I7T052OQXDT", "Overall": "4.0", "Content": "I am pleased with the computer - to a point - for the price ($500 +) more ram should have been installed.  I purchased the 8 gig stick  ($79) and installed it - much faster and smoother operation.  My main problem is that the day after I ordered the item, the price was reduced by over $50, so I ended up spending $630 total, which I consider a premium price to pay for a Win 7 computer with an i3 chip.  I should have done more research, and would have saved a considerable amount over what I paid Amazon - satisfied with the machine, dissatisfied with the ultimate cost.", "Date": "March 17, 2014"}, {"Title": "Toshiba satellite", "Author": "Heather L Kries", "ReviewID": "R2O94S19QG254R", "Overall": "5.0", "Content": "i specifically ordered this computer because it is like the one I now have. My husband and I did not want to learn how to use the Windows8, our son said even he had a difficult time and really didn't care for windows8 and he is a computer technician.  This computer does everything I need it to do", "Date": "March 17, 2014"}, {"Title": "Love It!", "Author": "Mariah", "ReviewID": "R16WCXYSSL3FF9", "Overall": "5.0", "Content": "no problems at all. Had it for about 2 months. /very reasonable price for this laptop. Would buy another anytime.", "Date": "March 13, 2014"}, {"Title": "Excellent", "Author": "Dora Leavitt", "ReviewID": "RJPEG8RVQIZR7", "Overall": "5.0", "Content": "Very satisfied.  I had a Toshiba before this one and was satisfied and that is why I purchased a second one.", "Date": "March 3, 2014"}, {"Title": "Runs smooth and fast", "Author": "wesselbug", "ReviewID": "R2BGGUATY4MX7D", "Overall": "5.0", "Content": "This laptop was purchased to replace a brand new one I purchased in December 2013 that crapped out a couple weeks after arriving.  This one has had no problems (yet - don't jinx it!), and is lighter than my previous one of five years.  I like the side number pad and screen size.Only a couple of complaints - the middle of the letter key pad is weird, slightly raised and an entire section of keys will squish down if you press gently on them; not sure what the problem is - it's like a bubble underneath the middle of the keyboard, but it doesn't affect my typing.  And fingerprints show up easily and that frustrates my OCD.Other than that, it's a great machine!", "Date": "March 2, 2014"}, {"Title": "Ove the Toshiba.", "Author": "Sandra D Manger", "ReviewID": "RBEFO12LZ2HQX", "Overall": "5.0", "Content": "Love the computer.  I would recommend this to anyone who asked me about it.  It works great with an HDMI cord for streaming to my television.", "Date": "March 1, 2014"}, {"Title": "Good but bad", "Author": "David Childers", "ReviewID": "R2XTIK4SUJKZ2J", "Overall": "4.0", "Content": "It is a good all around laptop but you do get random sudden lag spikes while gaming, also the graphics card is good but cannot handle BF4 on full graphics", "Date": "February 28, 2014"}, {"Title": "Viable and workable", "Author": "Dire straits", "ReviewID": "R3M1UNJEXUTFSX", "Overall": "4.0", "Content": "I am not a novice, but not into computers like some need to be so I needed one that worked with few handicaps.  This laptop and windows 7 is it!  Really appreciate the small size, light weight unit.  I had a different lap top that did not work so well for me so I do appreciate this.  I also keep my old PC up and running, but for convenience this is excellent for my uses.  Thank you.", "Date": "February 28, 2014"}, {"Title": "Cost and Performance", "Author": "susan amarante", "ReviewID": "R3OIVQFCOILLBG", "Overall": "4.0", "Content": "I've had a Toshiba for laptop for six years and this unit, for the cost and performance, is well worth it. Sue A.", "Date": "February 27, 2014"}, {"Title": "great gift", "Author": "E. Thorpe", "ReviewID": "R2SDKXO5RONMO7", "Overall": "4.0", "Content": "bought it for girlfriend for college to replace her macbook pro(which had overheating issues even with a chill mat)has worked top notch for over a year, great buy for the price. would recommend for college student or casual travel laptop", "Date": "February 15, 2014"}, {"Title": "Awesome for the price!!!!", "Author": "nancy kiernan", "ReviewID": "R14ZBUZLQO829R", "Overall": "5.0", "Content": "Was perfect for my husband, who is not very tecki. Just needed for paying bills and checking emails. Great for searching the web and his sports. He is very happy with this one. Still is capiable of doing much more.", "Date": "November 19, 2013"}, {"Title": "Great Laptop, Highly Recommend It!", "Author": "JoeHollinger", "ReviewID": "R20MTIQW7QQMGM", "Overall": "5.0", "Content": "This laptop computer does the job we need it to do.  Its going nearly 24 hours a day, has a sharp display, and was not problem to learn how it functions.  It runs on Windows 7 so we didn't have to fiddle with Windows 8 which we had on another computer and did not like one little bit.", "Date": "November 19, 2013"}, {"Title": "Good purchase", "Author": "SUMO", "ReviewID": "R1UCYLM1K0JMPI", "Overall": "5.0", "Content": "So far this laptop is great.  I love having the number pad on the keyboard. I did not want a laptop with Windows 8, so I was glad to find this with Windows 7.", "Date": "November 17, 2013"}, {"Title": "A fine utility laptop . . .", "Author": "ooga chaka", "ReviewID": "R2VI3WQTMPKZWY", "Overall": "4.0", "Content": "Nothing spectacular, but does everything a laptop should be able to do, and does so quickly and with no fuss.", "Date": "November 15, 2013"}, {"Title": "Excellent Windows 7 system", "Author": "Sharon Wertz", "ReviewID": "RVXR4WHVYU9RG", "Overall": "5.0", "Content": "Easiest laptop setup I've done in years.  I was so pleased to find a laptop running Win7 instead of Win8.  The system is super fast, light weight for it's size, and doesn't come with a lot of unwanted garbage on it.", "Date": "November 14, 2013"}, {"Title": "Toshiba Satellite C55-A5245", "Author": "Amazon Customer", "ReviewID": "R1J4XN7ID234N2", "Overall": "5.0", "Content": "Good keyboard and fast web browsing.  Excellent image quality.  Would recommend this to all who might be interested in a laptop computer.", "Date": "November 13, 2013"}, {"Title": "GOOD LAPTOP", "Author": "David Lopez", "ReviewID": "R13E40NKK00HBQ", "Overall": "5.0", "Content": "GOOD LAPTOPToshiba Satellite C55-A5245 15.6-Inch Laptop (Satin Black in Trax Horizon),I GET THIS LAPTOP AND WORK OK,EXCELLENT NICE LAPTOP.", "Date": "November 12, 2013"}, {"Title": "Reliable Toshiba", "Author": "Kathryn L. Olson", "ReviewID": "R1FOF5ROBIH7ND", "Overall": "5.0", "Content": "I bought this Toshiba for my husband to replace a 17\" Toshiba laptop that was 4 yrs old and getting very slow (as all laptops do). In the 4 yrs of the old one, we never even called support. Toshiba makes a very reliable laptop. For the price, you get a lot of features. Although the Intel is an i3 (as opposed to the fastest i7) it's still reasonably fast, perfect for the home user. Screen colors are very sharp, keyboard is comfortable, has numeric keypad, very lightweight, gobs of memory. I chose this one particularly because it has Windows 7, which my husband is used to. Loaded all his programs and documents easily (took about 2 hrs). If you are a \"gamer\" this laptop is not for you; buy the faster Toshiba.", "Date": "November 12, 2013"}, {"Title": "Our second Toshiba laptop", "Author": "Linda S.", "ReviewID": "R40W7VRTTCBIJ", "Overall": "5.0", "Content": "The laptop was received very quickly and in excellent condition.  This is our second Toshiba laptop, and we chose this brand due to recommendations from some of our missionary friends.  They told us that Toshiba laptops have been recommended for Africa due to the hardiness and long life of these machines.  I was especially pleased to be able to purchase one with Windows 7.  This will be kept in the kitchen and used predominantly by my kids for their homework.", "Date": "November 7, 2013"}, {"Title": "Perfect for me.", "Author": "swanlake1", "ReviewID": "RSSFKSCFFU9FJ", "Overall": "5.0", "Content": "Fast, decent sound, great keyboard. Used mostly for social networking, shopping and checking various accounts. Didn't want to learn how to use different OS, chose Windows 7. All around, great.", "Date": "November 7, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00D78PZE8"}}