{"Reviews": [{"Title": "Very good", "Author": "Domingo", "ReviewID": "R1RTNJFN2Y8QF", "Overall": "4.0", "Content": "Im so happy with my purchase, it was all i expected and the price is very good to obtain a pc!", "Date": "March 17, 2014"}, {"Title": "Good Product at Fair Price", "Author": "Dhaivat Patel", "ReviewID": "R2Q7ANFOXYZKR", "Overall": "5.0", "Content": "I bought this Laptop for my basic use and it's a Good Product at fair price,and also compatible to play Basic Games and run basic programs", "Date": "March 5, 2014"}, {"Title": "recommend this pc, Price vs performance", "Author": "Javier", "ReviewID": "R3PPFIXNXW5P58", "Overall": "5.0", "Content": "attention is very good staff, their response times are very accurate .Computer with very good performance .. really what I expected,", "Date": "September 20, 2013"}, {"Title": "Really slow", "Author": "Minh Hua", "ReviewID": "R3REDXBYNMF2RU", "Overall": "2.0", "Content": "It is really slow although it has i3. I want to return but time has passed through almost 2 months", "Date": "October 11, 2013"}, {"Title": "Secondipity Sucks!", "Author": "R. Rogers", "ReviewID": "R3NATK0YRVI5T6", "Overall": "2.0", "Content": "Purchased this laptop supposedly \"factory refurbished\" from Secondipity. Took forever to receive it. Poorly packaged/missing packaging and was flopping around inside the box when it was delivered by UPS. Had a \"Liquidation.com\" sticker on it. I believe that the listing said it was \"factory reconditioned,\" which is why I purchased it from them, that claim was a bald-faced lie.Purchased it for a 7 year old disabled boy as a Christmas present, and since the box/packaging is absolute crap, I will have to repackage it. Thanks a lot Secondipity!Hopefully it should work well enough for his needs. Comes with Windows 8, which absolutely-positively sucks, so I will end up purchasing Windows 7 to replace it with. Really haven't used it, just booted it up to make sure it worked, didn't register the software or anything. Will see what happens after Christmas day arrives.Will update then.", "Date": "December 20, 2013"}], "ProductInfo": {"Price": "$419.99", "Features": "Intel Core i3-2370M processor 2.40GHz with 3MB Cache, Windows 8, Waves MaxxAudio Sound\n16-Inch High Definition (720p) LED Display with Truelife, Intel HD graphics 3000 with up to 1696MB total graphics memory\n4GB Shared Single Channel DDR3 at 1600MHz, 3-in-1 memory card reader, Lithium Ion Battery (6-Cell)\n500GB 5400 RPM SATA Hard Drive, 8x DVD+/-RW Drive, Non-Backlit Keyboard\nwebcam with built-in microphone, Bluetooth Technology, 3 x USB 2.0 ports, 1 x headphone jack, 1 x microphone jack, 1 x RJ-45 Ethernet port, 1 x VGA port, 1 x HDMI port", "Name": "Dell Inspiron i15-2255BK 16-Inch Laptop (2.4 GHz Intel i3 2370M Processor, 4GB DDR3 SDRAM, 500GB Hard Drive, Windows 7)", "ImgURL": "http://ecx.images-amazon.com/images/I/41pQNh9HhvL._SX300_.jpg", "ProductID": "B00DA2TMY0"}}