{"Reviews": [{"Title": "Great!", "Author": "Robert Anderson", "ReviewID": "R36XRMOCZ6JFDU", "Overall": "5.0", "Content": "Excellent laptop for the money.  Great features and speed. Good battery life and fast charging. Great video quality and hdmi output.", "Date": "September 12, 2013"}, {"Title": "Toshiba Satellite", "Author": "Karon Harripaul", "ReviewID": "RKE5M1AKU0DI2", "Overall": "5.0", "Content": "The laptop performs well for its specs and was good for the price.It starts fast and connecting wireless is easy. It is good for everyday use and the internet. The quality is good.Windows 8 takes getting used to. However, this is done easily and works well on the laptop.", "Date": "September 12, 2013"}, {"Title": "Stay Away From Toshiba", "Author": "rafisher1", "ReviewID": "R2KV5FEF0JF6N0", "Overall": "1.0", "Content": "I just finished with a nice Toshiba customer support woman who knew her stuff - it seems Toshiba changed their business policy and we can't download the driver package, but for $29.95 you can buy a set of restore and driver disks to get the 3rd disc to reinstall the motherboard drivers.  Or you can pay through the nose for expert help to get those drivers.  They no loger have all of the drivers available for download on their web site. WOW - I guess they don't want any new business!Because of their business policy changes, I am now recommending to all of my clients to stay far away from Toshiba products.", "Date": "September 26, 2013"}, {"Title": "Absolute Piece of JUNK!", "Author": "Deborah Fleishman", "ReviewID": "R2OG0X1WTYG79S", "Overall": "1.0", "Content": "I will never buy another Toshiba product again, and I will never buy another computer from Amazon again.  The computer I bought was supposed to be new, but it appears that Quality Seller sold me a used product.  If not, why has someone previously used a Dell computer with this laptop?  This has been a lemon from the first month, and I am so sorry I tried to contact Toshiba instead of returning it.  I have to restore this piece of crap to factory default every month, and when I do that I have to reset the touchpad functions because it will not scroll. It also has driver issues.  Obviously the first owner never registered this product, and when it was found to be a lemon, returned it forgetting to delete the Dell printer hardware.  I have only had this piece of junk for less than 5 months.", "Date": "April 20, 2014"}, {"Title": "Great laptop, just not happy with Windows 8", "Author": "newdog", "ReviewID": "RQ87V0H8TGC83", "Overall": "3.0", "Content": "Bought this for my spouse and I asked her to rate it on a scale of 1 to 5. She gave it a 3 - not because of the computer, which is working great, but because Windows 8 is such a pain in the tuckus sometimes! Can we get the old desktop back?", "Date": "April 16, 2014"}, {"Title": "Great for general use with no glaring flaws.", "Author": "Alicia", "ReviewID": "R1KG190M7RWNUJ", "Overall": "5.0", "Content": "Computer is very light and runs really well. Aesthetically, it is sleek and classy. Keyboard is functional enough, speakers are a bit tinny but I'm not picky, and it is fast enough to suit my needs. I hate hate hate windows 8, but an operating system is no reason not to buy a computer.", "Date": "April 1, 2014"}, {"Title": "LapTop", "Author": "Chet Wittkin", "ReviewID": "R3A5LXCDVAKMU", "Overall": "5.0", "Content": "The Toshiba has been operating perfectly since I bought it. There's not much else to say other than I love it.", "Date": "January 6, 2014"}, {"Title": "Excellent student in college.", "Author": "D Lew", "ReviewID": "R39BGVTEM92YOF", "Overall": "5.0", "Content": "I found this lap top as well priced and works well for a college student.  Even my younger son can easily use it.", "Date": "January 3, 2014"}, {"Title": "Laptop", "Author": "Slawomir Boblak", "ReviewID": "R1NM2P1CLALJ9V", "Overall": "5.0", "Content": "Purchased this laptop for my wifes aunt. When it arrived it worked right out of the box. Good laptop would buy again", "Date": "October 7, 2013"}, {"Title": "SLOW!!!!", "Author": "doug", "ReviewID": "R2KUQ8YB26GQWF", "Overall": "3.0", "Content": "Roughly 4 years ago I purchased two Toshiba Satellite L505 laptops - these were great...  Good price and functionality.With my kids frequently on the PC, I bought this laptop.  While specs are better than the L505.  It runs VERY slow.  Even my nine year old says its slow and prefers the older laptop.  The sound is also very \"tinny,\" both when using the on-board speakers, as well as when you use the jack and output to external speakers.When I called Toshiba, I got a recorded message saying my warranty expired - even though I just received it ~ 6 days earlier.This laptop works, looks nice, but again is very slow.", "Date": "October 23, 2013"}], "ProductInfo": {"Price": "$499.99", "Features": "Intel Core i3-3120M 2.5 GHz\n4 GB DIMM RAM\n750 GB 5400 rpm Hard Drive\n15.6-Inch Screen, Mobile Intel® HD graphics\nWindows 8", "Name": "Toshiba Satellite C55-A5246NR 15.6-Inch Laptop (Satin Black in Trax Horizon)", "ImgURL": "http://ecx.images-amazon.com/images/I/41O8rtR%2BQWL._SX300_.jpg", "ProductID": "B00D3F7GYM"}}