{"Reviews": [{"Title": "Toshiba is great", "Author": "Richard Perdue \"sage533\"", "ReviewID": "RKGM1WPWAALQ8", "Overall": "5.0", "Content": "I am a low end computer geek, meaning that I know my way around basic functional issues. I build medium end desktops for a hobby. I have had this model for a couple months, and out of the 5 others I have, this is my fave, not too big or small, stable and keeps up with any chore. The display is great. I think the real telling factor of any computer is longevity, so we will see about that a few years down the road. I have an early t satellite (7 yrs old) that is running xp flawlessly to this day.", "Date": "September 10, 2013"}, {"Title": "Great Laptop!", "Author": "Kaylynn", "ReviewID": "RIF5CTGEUBF8X", "Overall": "5.0", "Content": "After having another Toshiba laptop for about six years that has been running great, it was time for a new one. Although my other Toshiba worked, it just started getting old and decrepit. I had no reasons not to get another Toshiba since it had served me well. As a student I needed something lightweight and portable to carry around for school/class and this fit the bill. Set up was easy, and I was up and running within 30 minutes. I was able to sneak a deal only paying $363 during their back to school sale. After adjusting a few settings (battery, brightness, display, etc..) I tailored it right to my needs and it has worked flawlessly. The Windows 8 took a bit getting used to, but I almost prefer it. I just wish it was easier to get to some things. But then again, it's easier to get to email, photos, and weather than previous windows. The only downfall is the word processing. It is not that great, but I don't want to spend the extra $$ right now for the Office Suite. The WordPad is pretty annoying, but it gets the job done. Other than the word processing, it is a great computer that I am excited to work with for years to come!", "Date": "September 16, 2013"}, {"Title": "A nice laptop.", "Author": "Derrick", "ReviewID": "R3Q0QT6CJ6VE40", "Overall": "5.0", "Content": "This laptop is great for everyday use. If web surfing, using word, and playing indie games is what you want to do with your laptop then this one is for you.", "Date": "September 20, 2013"}, {"Title": "this is a capable notebook for a good price", "Author": "JHONNY CUEVAS", "ReviewID": "R2AZ7SRIPE09V4", "Overall": "5.0", "Content": "this is a capable notebook for a good price, comfortable and meets my needs, all you need is great, yes", "Date": "September 11, 2013"}, {"Title": "Good Laptop But...", "Author": "Zerkfitting", "ReviewID": "R1WVNDBGV3OLEX", "Overall": "4.0", "Content": "I bought a Toshiba Satellite C55-A laptop about a month ago because it was the only one that had Windows 7 installed (I choose to avoid Win8) so I didn't have much of a choice to replace my aging laptop (wanted one with the current wifi spec). It is a good value for the features. It didn't have bloatware and I only needed to remove one program.It is a competent computer but it has a few ergonomic issues for me. The keyboard has flat keys with the letters centered in the key, they are not formed like most keyboards keys (shaped for your fingers) and most keyboards have the letters in the upper left corner of the key. The keyboard works fine but I prefer shaped keys. Most of the connections are located at the right front corner - right where I use a mouse (I prefer using a mouse). The Numlock key needs to be set every time you power up. When I open the top the bottom comes with it so you need to hold the base down to open the top.This a secondary computer for my home so I only have a few programs I need to run with it, it is mostly used to access the internet in a another room in my house from my main computer, and it gets taken on some trips; it serves my use very well. It has the same vertical resolution as my old full screen laptop but it is physically shorter. (All laptops have this style wide screen these days). I won't be watching movies with it so I don't really need a wide screen but the width does help when multiple windows are open but it makes forces the use of a mouse further to the side than I would like. I would prefer a taller screen then a wider one bit no one makes that.", "Date": "August 17, 2013"}, {"Title": "Yes, but you can choose another version better !", "Author": "Hunter", "ReviewID": "R25DS486LF48H9", "Overall": "3.0", "Content": "My fiancee bought this one. When I were looking for specs of this laptop, I saw another version of this laptop with higher specs and cheaper.This laptop using CPU Intel Pentium Dual Core 2020M 2.4 GHz  (Old generation CPU, and it has two cores) while the other one is Intel Core i3-3120M 2.5 GHz (4 cores). Beside, the price of this laptop is more expensive. You can follow down to see more specs comparison.THIS LAPTOP:- Intel Pentium Dual Core 2020M 2.4 GHz- Windows 8- 500 GB 5400 RPM Hard Drive*** EXPENSIVEB00D3F7GXSOther Version 1:- Intel Core i3-3120M 2.5 GHz- Windows 8- 750 GB 5400 RPM Hard Drive*** CHEAPERB00D3F7GYMOther Version 2:- Intel Core i3-3110M 2.3 GHz Processor- Windows 7 Home Premium 64-bit- 500 GB 5400 RPM Hard Drive*** CHEAPERB00D78PZE8", "Date": "September 29, 2013"}, {"Title": "College Student Perspective: A good laptop with a good price", "Author": "jkatz904", "ReviewID": "RSMBQZFO57AS8", "Overall": "4.0", "Content": "I've owned this computer for several months and am overall happy with it. The price tag has changed a bit since then; my price tag was $370 and for that price I'd say it is worth it. I use it as a college student and it serves all the functions of a student quite well. (Writing papers, research, surfing the web, facebook, skype) I'm not 100% tech-savvy so I did a lot of research before purchasing my laptop. I owned a Macbook before this (1st and probably last mac of my life). This was also the first laptop that I purchased out of my own pocket so I was cash-sensitive. My actual bill came more towards $470 because I had to drop money on Microsoft Word (college student essential) and anti-virus software.To Gamers: This is not a gaming laptop! It uses the built-in Intel graphics card which can't be changed; and no additional slot exists for a secondary graphics card(to my understanding). I don't play games that demmand incredible graphics cards so this was disappointing but not a deal breaker.", "Date": "May 27, 2014"}, {"Title": "toshiba satellite c55-A5243NR laptop", "Author": "Robert J. Denis \"R. Denis\"", "ReviewID": "R1C3VAQK36K39C", "Overall": "5.0", "Content": "Great laptop if you like Toshiba. The new Windows 8 takes some time to get used to. Item was as described.", "Date": "February 3, 2014"}, {"Title": "We have bought 2 of these", "Author": "Staffymom", "ReviewID": "R39HN32KQECQQN", "Overall": "4.0", "Content": "The first was perfect right out of the box.  No issues, very nice for the price.  The 2nd one for someone else in the family WAS DEFECTIVE.  It is being returned.", "Date": "January 13, 2014"}, {"Title": "The best brand out there", "Author": "Amazon Customer", "ReviewID": "R2E3XID13YLEG4", "Overall": "5.0", "Content": "The Best brand laptop I have ever owned. I think windows 8 is great(once you get used to it.). The shopping for a computer was made simple by Toshiba's information on the computer. It is everything that you said it would be. Finally a company you can believe. Trust me, don't be afraid to take the plunge. The water is fine in here so just do it, you won't be sorry. Great job Toshiba.", "Date": "November 3, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00D3F7GXS"}}