{"Reviews": [{"Title": "Best computer for the money", "Author": "mntnlife", "ReviewID": "R2LYBT4PB8T87G", "Overall": "4.0", "Content": "This is a great laptop for the money. No it does not have a touch screen but if you want a touch screen, I would recommend getting a tablet. I went from Vista to Windows 7 and did not like it so I installed a free program called Classic Shell. It gives you the old look of Vista and XP and this helps to soften the learning curve of the windows 7 and 8.1. It is about the cheapest computer that you can buy and still get a built-in disk drive.", "Date": "December 9, 2013"}, {"Title": "Decent Laptop", "Author": "Dovahkiin", "ReviewID": "R1J9N7H7NDBQ47", "Overall": "4.0", "Content": "I bought this for a coworker. He likes it and has not complained about it so far. I suppose it met his requirements. It isn't something I would buy for myself but on his recommendation I'm giving it four stars.", "Date": "May 12, 2014"}, {"Title": "Do not buy unless you only need it for facebook and email.", "Author": "Jordon Renn", "ReviewID": "R3G5L1PX3APLYD", "Overall": "2.0", "Content": "I have the older version of this computer which treated me very well, but this computer isn't powerful at all and runs slow with windows 8 on it. I've only has it for 2-3 months and I am already looking into buying another new computer.", "Date": "March 4, 2014"}, {"Title": "exactly what I expected!", "Author": "Stacy Thomas", "ReviewID": "RD3ITFF88LIWG", "Overall": "5.0", "Content": "Very happy with my PC. Thanks, I use it every day for business and pleasure! Love it more every day!", "Date": "March 4, 2014"}, {"Title": "Description issues", "Author": "Greg", "ReviewID": "R1MCIZ8G05NI2W", "Overall": "1.0", "Content": "I intended to find a laptop with WIndows 7 to avoid the hassles of Windows 8; however, I thought with a touchscreen, Windows 8 might not be too bad. So, in my search I came across this computer with this sentence within the description:\"Enjoy the ability to pinch, swipe, rotate or scroll through images on the display screen with a simple brush of your fingers.\"Due to the wording of this statement I mistakenly assumed this was a touchscreen. It is not. This statement is about the touchpad, not the screen itself.While there is nothing wrong with this laptop per se, I would not have purchased it had the description been more clear that this is not a touchscreen. I would have looked for another laptop either with Windows 7 or a touchscreen.12/8/13: Update: I have had this a few days and am still trying to get all the Windows 8 updates downloaded to get to Windows 8.1 (so far at 96). At this point, I am strongly considering wiping it and loading my old version of Vista.I also just discovered NO HDMI PORT! I can't believe a new laptop would be sold without HDMI!", "Date": "December 6, 2013"}, {"Title": "toshiba a brand i trust", "Author": "raven", "ReviewID": "R3Q7C9GJ8LJEPB", "Overall": "4.0", "Content": "I don't know about u .but I pretty much grew up with this brand . I've learned to trust it.I've had ,tv,home stereos. It's so much to it I  still haven't got to see all its power", "Date": "January 4, 2014"}], "ProductInfo": {"Price": "$384.99", "Features": "15.6\" widescreen HD TruBrite® LED Backlit display 1366x768 (HD), 16:9 aspect ratio, Supports 720p content\nAMD Dual-Core E1-1200 Accelerated Processor\n4GB DDR3 1600MHz memory\n640GB HDD (5400rpm, Serial ATA)\nAMD RadeonTM HD 7310", "Name": "15.6\" Toshiba Satellite C855D-S5201 AMD Dual-Core E1-1200 4GB RAM 640GB HDD SuperMulti DVD Drive Windows 8 Satin Black Trax", "ImgURL": "http://ecx.images-amazon.com/images/I/41tJmZ6JN7L._SY300_.jpg", "ProductID": "B00EV54BB4"}}