{"Reviews": [{"Title": "A quality product", "Author": "Ryan Mulligan", "ReviewID": "R2I9YZ6OTRESDL", "Overall": "5.0", "Content": "This ultrabook is fantastic.Beautiful, solid, light build.Extremely quick computing.Minimal bloatware.Finally, a GREAT trackpad on a laptop that isn't an Apple product.--The i7 4558U processor (2.8GHz) is worth the extra money, as it's much faster than the i7 4500 (1.8GHz) or i5 4200 (1.6GHz)--The 8GB of DDRL3 RAM really help boost performance over other ultrabooks housing only 4GB, especially when multitaksing.--The integrated Iris 5100 graphics are actually capable of running fairly intense programs, newer games like Skyrim, for example, though only on low graphics settings. Still, it's impressive for an integrated unit.--The SSD's in RAID are incredibly quick, and really help cut down boot time to just about 10 seconds from cold. I'm up and running in no time.--The battery life is actually 8 hours or more on normal use. Way to go Haswell processor. You're not an energy sink.--At just over 3 pounds, this laptop is so light, and remarkably thin.I've had it for a week, and there is nothing I can complain about, and I feel I'm rather picky about my electronics.If you have the money, and are frustrated about how it seems many ultrabooks have to compromise in some area, this is a stellar laptop.--UPDATE--I've had this ultrabook for about four weeks now, and unfortunately, I noticed a small linear scratch on the lid. I bring this up because the GorillaGlass3 covering the lid is reported to be nearly scratch-proof against anything but sand. I've been very careful with this laptop, carrying it in a case whenever I transport it, and I was hoping it would be more scratch resistant than it's shaping up to be. Still, this is an excellent product, and I'm still impressed by its outstanding performance.--Update--After 5 months, I am still extremely satisfied with this ultrabook. I can work through an entire day at school on a single battery charge, and not sacrifice performance. This thing hasn't slowed down at all. And for those of you that care, it'll produce fluent framerates for games like Skyrim (High textures, no antialiasing,) Deus Ex: Human Revolution (High settings,) and Mass Effect 3 on ultra graphics settings. Light, fast, powerful, this is still the laptop I had hoped for five months ago.", "Date": "November 23, 2013"}, {"Title": "A premium ultrabook from every perspective.", "Author": "Doug Colt \"dwcolt\"", "ReviewID": "R22PSWTBUOCER5", "Overall": "5.0", "Content": "After extensive research, I narrowed my ultrabook choice down to the Zenbook UX301 or the Samsung Book 9 Plus.  They both have very similar specs, but ultimately I chose the Asus for the following reasons:1) Better processor and graphics.  You get the 2.8 ghz i7 with Iris graphics.  The Samsung only offers the lower-tier 1.8 Ghz without Iris.2)  Better wi-fi.  The Asus has the newest-generation ac wireless.  Samsung is still a generation behind.3)  Seemingly better build quality, but this is largely a wash.4)  30-day zero dead pixel guarantee.  When you've got screens with as many millions of pixels as these have, that's a nice thing to have!  (My screen was flawless though).5)  Some nice add ons.  The Asus comes with an included ethernet dongle and an included mini display port/VGA dongle.6)  I feel silly saying it, but a bit of cache.  The Asus is generally more difficult to find and there are fewer of them out in the wild.I have been very impressed with this machine so far.  It truly is gorgeous.  The build quality appears to be very good.  I could not identify any manufacturing flaws, and the whole thing feels rock solid.  The keyboard is excellent, as is the trackpad.  Very little bloatware.  Screen was perfect.  I've been impressed with the performance and I'm still testing the battery life.  I'll update my review once I've had a chance to test it further.This is expensive indeed, but it oozes premium ultrabook from all corners.UPDATE:After using this machine for the last two months I remain very satisfied.  The performance has been excellent and the gorilla glass really seems to stand up to scratches.  The exterior continues to look brand new.I haven't experienced any technical issues with any of the hardware. The keyboard remains very pleasant to use and the trackpad is really outstanding.  On par with anything that Apple puts out.I have received many compliments on the quality and clarity of the screen.Battery life has generally been very good.  With typical internet use and medium brightness, I'm getting 7-9 hours on average.  The battery also charges very quickly, which is a nice bonus.One minor annoyance has to do with Windows and not the hardware.  The resolution on the screen is so high that you will want to use the Windows interface to increase font and icon sizes in almost all cases.  This works fine, except when you need to use the machine for remote access (such as through a VPN or using a vmWare client).  The increase in font and icon sizes does not carry through to a remote session, so you will end up with microscopic icons.  The solution is that you have to change your screen resolution before logging into a remote session.  This isn't a huge deal but it's a bit of an annoyance.  Again, however, this is a Windows 8 issue and not an ASUS issue.All in all I am extremely impressed with this ultrabook.", "Date": "November 27, 2013"}, {"Title": "Amazing", "Author": "Nato", "ReviewID": "RLRLL37AP6AJL", "Overall": "5.0", "Content": "It took 3 generations but Asus has finally fixed all the problems and perfected their Zenbook line.-This thing is unbelievably well constructed, everything FEELS as solid as it should given its price.-The touchpad works great-The keyboard is backlit and the keys even register corner presses-The screen, besides being 1440p, is also extremely bright, which somewhat makes up for the glossy screen required by the inclusion of a touch screen-The haswell processor has apparently increased the battery life significantly over the previous generations.In addition to all of the above, this thing is literally the most beautiful device I have ever seen and since everything visible is covered in Gorilla Glass 3, that isn't likely to change as its unlikely that a laptop will encounter sand, which is the only common thing that will scratch GG3.If you have the money, there are no compromises made with this laptop(except for high end gaming due to lack of discrete video card) as long as you are willing to wipe it down with the included giant lens cloth every once in a while to keep it looking pristine.Update: I have noticed recently that the wireless adapter sometimes needs to be reset after the computer sleeps in order to function properly. It has only happened twice so far and I figure this is a driver issue that will be addressed by an update.Update 2: It looks like maybe a windows update fixed the wireless card issue? I haven't experienced it since the first week.", "Date": "October 27, 2013"}, {"Title": "ASUS has a winner on their hands for those willing to pay the premium price to own.", "Author": "Jonathan", "ReviewID": "RNIFM0JECIX3N", "Overall": "5.0", "Content": "I've been waiting for this ultrabook to release since the start of the fall semester. Well, it's definitely been worth the wait. The computer boots up insanely fast due to the RAID 0 SSD configuration. It is not bogged down by a ton of bloatware either. The only changes I've made so far were to uninstall McAfee for Norton 2014 (since I had one license left).One minor gripe I have is the drive partitioning. I would have preferred one partition to how ASUS partitioned the drive into C: (OS) and D: (DATA) in addition to smaller recovery partitions, but I am not taking a star off for that. If it was that big a deal, somebody could (through software) change the partitions however they liked. I was able to merge the C: and D: drive partitions into one C: partition using 3rd party software.The high resolution screen is very nice. The look, feel, and portability of this laptop are second to none. I look forward to using this high quality ultrabook for a long time.", "Date": "December 4, 2013"}, {"Title": "Best ultrabook currently available", "Author": "G.E.", "ReviewID": "R2YVX2LWWJ6V39", "Overall": "5.0", "Content": "I just replaced my original ASUS XenBook UX31 with this laptop.  The keyboard on this one feels much better than the previous version (I haven't noticed anything odd about the spacebar.)  Backlit keys is a plus.  Also, the charging port seems less flimsy.  I like the color but I miss the full aluminum frame of my UX31.Also, it runs openSuse Linux 13.1 without issue, and i haven't found anything that doesn't work yet; touchscreen, touchpad, wireless, USB ethernet all work.  I haven't tried the camera or external video adapter though.Last note is that there is a different model of this, the UX301LA-XH72T, which only differs from this model by having 2x256GB SSD drives instead of the 2x128GB drives in this model.", "Date": "December 4, 2013"}, {"Title": "3 Laptops, 3 Screen Defects", "Author": "Chris", "ReviewID": "RFUDDAJMA0G1G", "Overall": "3.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1BPJWJG26OXACembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1BPJWJG26OXACrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1BPJWJG26OXACchiDiv\").innerHTML = document.getElementById(\"cv_mo1BPJWJG26OXAChiddenPre\").innerHTML;\n};\ncv_mo1BPJWJG26OXACrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1BPJWJG26OXACso;\t   \n\n\nfunction cv_mo1BPJWJG26OXACloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1BPJWJG26OXACso = new SWFObject(swfLocation, \"cv_mo1BPJWJG26OXACAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1BPJWJG26OXACso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1BPJWJG26OXACso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1BPJWJG26OXACso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1BPJWJG26OXACso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1BPJWJG26OXACso.setAttribute(\"height\", swfHeight);\n          cv_mo1BPJWJG26OXACso.setAttribute(\"width\", swfWidth);\n          cv_mo1BPJWJG26OXACso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1BPJWJG26OXACso.write(\"cv_mo1BPJWJG26OXACflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1BPJWJG26OXAC', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1BPJWJG26OXAC';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1BPJWJG26OXAC', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1BPJWJG26OXACloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1BPJWJG26OXAC\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"182-0526639-6434115\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m5OOS9OCZUX91\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m5OOS9OCZUX91\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RFUDDAJMA0G1G\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m5OOS9OCZUX91/182-0526639-6434115\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/182-0526639-6434115\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1BPJWJG26OXACduration')) {\n      document.getElementById('cv_mo1BPJWJG26OXACduration').style.display='none';\n    }\n    cv_mo1BPJWJG26OXACloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1BPJWJG26OXACloadSwf(movieID, playerVersion) {\n   return _cv_mo1BPJWJG26OXACloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1BPJWJG26OXACnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1BPJWJG26OXAC', 0, h);\n}\n\nfunction cv_mo1BPJWJG26OXACresetPlayer(w,h,bw,cc) {\n  cv_mo1BPJWJG26OXACnewHeight(h);\n\n  cv_mo1BPJWJG26OXACso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1BPJWJG26OXACso.addVariable(\"cacheCode\", cc);\n  cv_mo1BPJWJG26OXACso.setAttribute(\"height\", h);\n  cv_mo1BPJWJG26OXACso.setAttribute(\"width\", w);\n  cv_mo1BPJWJG26OXACso.write(\"cv_mo1BPJWJG26OXACflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1BPJWJG26OXACRollOverImg = new Image();\ncv_mo1BPJWJG26OXACRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81kYgwYcWFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1BPJWJG26OXACpreplay = document.getElementById('cv_mo1BPJWJG26OXACpreplayImageId');\nif (cv_mo1BPJWJG26OXACpreplay) {\n  cv_mo1BPJWJG26OXACpreplay.onmouseover = function() {\n    cv_mo1BPJWJG26OXACpreplay.src = \"http://ecx.images-amazon.com/images/I/81kYgwYcWFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1BPJWJG26OXACpreplay.onmouseout = function() {\n    cv_mo1BPJWJG26OXACpreplay.src = \"http://ecx.images-amazon.com/images/I/81kYgwYcWFS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1BPJWJG26OXACpreplay.parentNode;\n\n  var cv_mo1BPJWJG26OXACcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html/ref=cm_ciu_vr_mo1BPJWJG26OXAC/182-0526639-6434115?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1BPJWJG26OXACcurrentClick) {\n      return cv_mo1BPJWJG26OXACcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:12 MinsI had been in the market for a high-end ultrabook for quite a while before purchasing this machine in early December.  Based on performance, this laptop will not let you down.  Boot up time is lightning quick, SSD storage is ample, and the Haswell chip appears to deliver on that elusive extended battery life.However, at this price point you expect perfection, and when my laptop came with that tiny gray spec I couldn't seem to wipe off the screen, I began to feel discouraged. So I eagerly waited a month for Amazon's next shipment to come in, and replaced the laptop as soon as I could.  Unfortunately, when the second laptop also arrived with a similar gray spec in a different location on the screen, I began to feel annoyed. I started to think perhaps this was dust or debris trapped under the glass due to poor assembly, but after examining both laptop screens with a digital microscope it appeared that the affected pixels were in fact \"faded\". Not fully on, but not completely off either.Since I had not seen any other reviews highlighting this issue, I opted for another replacement in hopes of receiving one free of defects.  When the third arrived with a similar tiny dark dot in a third separate location on the screen, I began to feel disappointed.  Under magnification, this one appears to be a completely dead red pixel with faded green.I suspect others have this same issue, but simply have not noticed it.  On a screen resolution of this magnitude, these defects can be considered negligible and unnoticeable.  Unless you examine your screen closely on a solid colored background, you could go the life of your computer without ever seeing it.  But once you do find them, it becomes hard not to notice them.  So again, if you expect perfection at this price point, you may want to look somewhere else.", "Date": "February 4, 2014"}, {"Title": "Finally the perfect laptop", "Author": "Neil E. Fox \"Gadget Phreak\"", "ReviewID": "RXU0193IQUM0P", "Overall": "5.0", "Content": "I was looking for a windows ultrabook to rival the MacBook Air and this is it.On the positive side it is very light and thin, screen is high resolution, the keyboard is amazing, long battery life, fast processor and storage.The only real negative is that the case is a fingerprint magnet.I compared the asus to all leading options and found this to be the best of the lot.", "Date": "October 26, 2013"}, {"Title": "One of the best out there, but tainted with some of the scaling cause by Windows on this great screen.", "Author": "Vincent M.", "ReviewID": "R1C16OF7YWTPBY", "Overall": "4.0", "Content": "---------------------------------------------------------------------------------------------2.5 months laterStill getting wireless adapter issues. I've resorted to just keeping the driver installer on the computer and when the wireless stop works, I just uninstall and reinstall the driver. Takes me about 5 minutes to fix. If anyone else has this issue with the Intel driver, this is the only solution I know of. You can get the driver installer from Intel's somewhat bad website, took me some time to find it.---------------------------------------------------------------------------------------------2 Months LaterMost of the scaling issues that I had talked about in this review have sorted themselves out, and I think Microsoft had some updates that made the scaling alot better on this screen.I've had some issues with the wireless adapter on this computer. Its really fast, but sometimes it does not want to turn on. Usually performing the latest Windows Update fixes this, but I just updated to the latest Intel driver for the Wireless. This can be annoying if you don't have the Ethernet to USB adapter that came with the laptop. I've had wireless adapter issues with other Windows 8 laptops, so I'm not going to deduct any more stars for issue that doesn't take more than a couple minutes to fix, albeit an issue that is annoying.I bought Asus's ASUS External Slim 8X DVD-RW Stylish Cut Design Optical Drive SDRW-08D2S-U/BLK/G/AS External DVD drive b/c I have software on disk that I will need. The USB drives likes to take up two USB ports, which cannot be done on this laptop due to the length of the USB cables on the DVD drive and the locations of the USB ports on the laptop. I didn't find this to be an issue as I was able to use the drive with only 1 USB port plugged for the drive.Another thing, if you have this computer's power port plugged in, you can charge over USB. I like this feature alot as on trips I don't have to worry about bringing 4 different chargers, I can just use their USB cables and plug them into the laptop. (Not sure if they will charge if the computer is turned off, but they will charge if the lid shut.)--------------------------------------------------------------------------------------------4 Days LaterThe boot time (from pressing the power button to Login Screen) is just under 7 seconds. The weight is listed as 2.6lbs but in reality is closer to 3.2lbs. Not sure where they got that number but it is way off.This thing is very quiet and runs very cool and feels cool when doing non-performance intensive tasks. I don't think I've heard the fan run at all or had the bottom heat up. Very good air management by Asus here.The speakers are amazing. I was suprised at how nice they are considering the laptop speakers I've had in the past were not that great.Very little bloat or ad ware installed. The only thing I've had to disable was the Asus Cloud Manager.Some Complaints: The Asus Audio manager is a good piece of software (lots of settings), but without changing any settings, just plugging in the headphones while watching a movie will just keep the sound going to the speakers. You have to leave the netflix app and move back to desktop to say that you are using headphones. I need to do some fiddling with the Audio Manager.Windows8, but that's not really against the laptop, but against Microsoft.I wish the SD card when inserted was more flush with the side of the computer. It kind of hangs out there and I am worried I could break the card/port I/someone was not paying attention.Gaming: I've installed the popular MOBA League of Legends and while I've had yet the time to get specific numbers here are my impressions.1. It can run the game.2. You still get some of the weird scaling issues I discussed before with the 2560x1440 screen. Nothing abnormal, just may look different to a 1920x1080 screen of the same size. Not necessarily bad, I just wouldn't say the experience has been fine-tuned.3. You can play it at the med-lowest setting but the game still feels a little sluggish. I will see if I can push it to the lowest and see if I can get an enjoyable experience out of it.I also plan to put TF2 and L4D2 on it to measure my experience there, but I need to cut out some time to do that.Overall I am still very happy with how this purchase has turned out despite some of the flaws with the scaling.------------------------------------------------------------------------------------------------------Original Out of the Box ReviewPros:This is the best screen I have ever seen on a laptop. Super Crisp, can maintain its brightness, and movies look fantastic in it.The size is incredible. Pretty light, super thin. Going to be able to fit it easily in my bag with books.The battery life out of the box is also good. Able to watch movies for a good amount of time and still have decent battery. I trust the 8 hour figure people have out there.I have nothing against the keyboard and touch-pad. The back lighting is good on the keyboard.The packaging was incredible. It can with a laptop sleeve and a soft cloth and it was a nice touch.This thing is quick. Like super quick. The SSD's make it boot incredibly fast, and the for basic tasks I don't feel slowed down at all.  (I have yet to run any performance intensive tasks, but I will soon, just have the get them running.)This thing is quiet. Despite having such a high quality screen, the i7 Haswell chip is fantastic and it handles most of the basic tasks I've thrown at it with ease.Cons:There is some serious issues with the scaling in Windows 8 and this 2560x1440 screen. The computer came automatically at 150% zoom. And while this is enough for the some of the Windows applications, I have found issues with Google Chrome and using web pages. I had to set Google Chrome to automatically zoom to 175% when viewing web pages. can be annoying when using the touchscreen for more precision tasks, but I have had no issue using the touch-pad. As high resolution in smaller screens for laptops/ultrabooks become more common, I wish Microsoft had anticipated this and I hope they do more for this in the future. I wish I could deduct half a star for this, but it is an issue and I will be removing a full star for this.Windows 8. Not as bad with the touchscreen, but still pretty bad. I look to change the aesthetics with add-ons to make it more like Windows 7.This thing is a fingerprint-magnet. The glass on the top displays them like a work of art. I don't really notice them on the touch screen when it's on, but when it's off you'll see them. The soft cloth will wipe most of them away, but its a losing battle.I am not entirely comfortable with power button right above the backspace key. I feel like you could hit it accidentally. I have not hit it yet on accident, but I am more careful when reaching for the backspace key.Other Thoughts:The charger port is on the left side. Neither a plus or a minus, just pointing it out.The size is pretty small. I have a 2tb external hard drive so not much of an issue for me, but it could be for others out there.The intake/exhaust setup is alittle weird. The intake is on the bottom and the exhaust is almost on the back and points up toward the screen when the laptop is turned on. I haven't had any issue with it, but it is not my most desirable position for the exhaust.Again, I'll be updating this review with more thoughts the longer I have it.", "Date": "January 11, 2014"}, {"Title": "Everything I hoped it would be", "Author": "Joseph", "ReviewID": "R2EQS4CUSE43CV", "Overall": "5.0", "Content": "I did an incredible amount of Ultrabook research before ordering this, and had concerns about some of the negative feedback I saw. I just got the unit today, and am pleased to report I am not seeing those issues. Specifically:- I don't see light bleed or \"smoky grey\" blacks - the black is a good solid black- There are no squeaky keys (including the space bar) and no keys that seem not fitted right- I see absolutely no build quality issues whatsoever, all panels fit seamlessly with each other- Sure, the screen has some torsion if you try to bend it, but that's because it's about 4mm thick, but it's not all bendy-like, it's just if you try to force it to see if you can, it will bend a bit.- I have not tested all the ports, I'm still doing the windows updates right now. I'm looking forward to using Windows 8.1 pro because it should provide better support for home networking, like having my libraries populate from the media server attached to my router.I tested the picture quality by loading The Hobbit in 1080p - gorgeous!! I like to watch movies on my notebook, it was one of the main reasons I bought this machine, and actually already have an MSI GE620 i7 laptop and was not satisfied with the screen quality, so this mattered the most to me, and I definitely made the right call there!The machine is thin but it's built solid. Unlike the Sony Vaio Pro, you can pick it up by a corner while it's open, and there is no flex whatsoever, it stays rock solid. The trackpad is huge and works perfectly. Looks-wise, the machine is absolutely stunning. I like the look better than a MacBook Air, and definitely better than a MacBook Pro.Viewing angles, I've seen people consistently complain about this, but I can turn this machine sideways and peek around the screen and still see the picture. I angled it right, left, up, down, no change, at any angle, always nice and clear.If I had to complain about one thing, it's that having the power button right beside the delete key is pretty scary, what a dumb idea. That's my only complaint. I wanted the best windows ultrabook on the market, Iris graphics were a must, and lots of SSD hard drive space was a must, and I feel that I made the right call. Oh, and I have not heard the fan yet at all, this thing is dead quiet and the base is cold in my lap.", "Date": "December 24, 2013"}, {"Title": "You get what you pay for", "Author": "Andy", "ReviewID": "R2THN99DUUZKF", "Overall": "5.0", "Content": "Amazing Windows 8.1 machine. Asus design features are a nice balance of power vs. performanceThis ultrabook is thin and lightweight but boasts heavyweight performance.4th gen (Haswell) Intel Core i5 processor (dual core with hyperthreading) is power efficient and still quite fast.8 GB DDR3 1600 memory provides plenty of space for running multiple applications.256 GB Sandisk A110 PCIe SSDs (128GB x 2 RAID0) extremely fast. Windows boots in under 10 seconds!Excellent ultra high resolution (2560x1440) touchscreen and responsive back-lit keyboard. Good touch-pad as well.Integrated Intel 802.11AC WiFi controller works well.(2) USB 3.0 ports for storage and peripherals (GbE adapter is included).The beautiful Gorilla Glass enclosure is the perfect package for this hardware.", "Date": "December 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00EPGHE0E"}}