{"Reviews": [{"Title": "ASUS making great laptops! This VivoBook is quite impressive.", "Author": "MHB", "ReviewID": "R219V6CCPJ3MH1", "Overall": "5.0", "Content": "PROS:- THE PRICE! Retail is $799 but you can find it for under $700 now. For what you get, it is a solid deal.- Great style! This laptop just LOOKS great, and lives up to its looks with most of its specs.- i7- Perfectly sized 15.6 inch VivoBook, not too small to strain your eyes but not TOO big to carry around.- It has a 24GB SSD along with the 500GB hard drive that makes starting up and shutting down the computer happen in ~5 seconds! Especially with Windows 8.- Touch screen is lag free and flawless! Finally works great with Windows 8 because they're FINALLY getting plenty of apps ported over.- Plenty of memory, and 8 GB of RAM. This laptop won't run slow at all.- Stays cool where your palms rest and the speakers work well.- HD WebcamCONS:(1366x768) Resolution. On a 15.6 inch screen, this could get frustrating if you're trying to watch super HD videos and such. It's ok, but not excellent.Overall, I think if you can put up with the resolution or you won't be watching too many movies or doing something that requires 1080p, this is a great laptop that is well sized and decently light at 4.8 pounds for the size and price tag. It's fast, starts and shuts down quickly, touch screen is great, and it runs Windows 8 which continues to improve. Good for college students and business professionals who need a laptop, but be wary that the battery life will not go over 4-5 hours.I own 2 of these. One of which is still new. Debating on selling it or giving it to my friend who loved it when he used mine!", "Date": "August 5, 2013"}, {"Title": "portable laptop, everything works great", "Author": "anderomeda linan rico", "ReviewID": "R2YR9MY87D54GB", "Overall": "5.0", "Content": "Im happy with this laptop is thin and light, when I bought it I was worried about some critics about the keyboard, but I feel comfortable with it, so far.The design is very nice and everything is working perfectly, has a i7 intel processor that is maybe more than I need, but is not easy to find a touch laptop like this for the price I paid (~620), so I decided to buy it.I haven't tested the battery life completely, but I can estimate that is about 3.5 hours.", "Date": "September 4, 2013"}, {"Title": "Bad construction", "Author": "t.lee", "ReviewID": "R2UOA8W5906GU2", "Overall": "2.0", "Content": "Lets just say this thing is coming apart. All was well when i first purchased this ultra book but through normal use the screws that hold the bottom on are breaking loose from the plastic due to opening and closing the lid.", "Date": "March 24, 2014"}, {"Title": "Great computer! Strongly recommend", "Author": "Dana", "ReviewID": "R2A1HEPO6AFE1Q", "Overall": "5.0", "Content": "I upgraded from an old Dell Studio. This thing is awesome.Pros:Windows 8--great interface, easy to learn and use, usefulSpeed--i7 processor and expandable RAM are very fastAppearance--sleek, thin, and lightPersonalization--lots of ways to personalize itTouchscreen--useful for Windows 8, really coolAppsPriceFast USBWebcam isn't badBattery life (at least 4 hours depending on what you're doing)Cons:Keys are a little far apart, but I have small handsNo CD/DVD drive, but whatever, just buy an external oneGlad I bought this computer. Would recommend!", "Date": "March 14, 2014"}, {"Title": "As described", "Author": "Hamza Sapi", "ReviewID": "RBTOV92KNOHGG", "Overall": "5.0", "Content": "I bought this and am using it in my the first week. so far everything is OK and i got what i expected. The touch screen is good, speed is perfect, it is standard computer for those who need a good computer with a good price", "Date": "April 22, 2014"}, {"Title": "Upgraded to 8GB, added Plugable expander, very happy", "Author": "Bob Elkind \"eteam\"", "ReviewID": "R6Z0RC1B1ANAI", "Overall": "5.0", "Content": "Bought this laptop on special from Newegg for $579.Added a 4GB SODIMM module (roughly $40) to bring the memory up to 8GB total.  Upgrade was smooth and problem-free, full 8GB recognised by Windows.Added (this week) a Plugable 3900 USB3-connected expander, and I am running now with two external 1080P monitors.  Purchased the Plugable 3900 from Amazon.For road warrior work, this laptop is light, fast, and has good battery life.  These are the most important attributes for a laptop, for me, and the S500CA-US71T does this well.As a desktop replacement, the Plugable add-on is highly recommended (about $100).The only negative is the display.  It is very bright (which is good), but also highly reflective -- and this makes viewability a problem if there are windows or bright lights behind you.  Also, the display's viewing angle is very narrow.  You don't have to tilt the screen up or down very much before the display image colours and brightness go wrong.  The viewing angle is an issue mostly for photos or videos, and is not so much of a problem with business apps (text, business graphics, etc.).This model does not include an internal optical drive.  External USB2 DVD readers/recorders are commonly available for $20-$35, powered from the laptop's USB port.  They work fine.Overall, excellent value for money.", "Date": "April 18, 2014"}, {"Title": "Very Good!", "Author": "Izzet Yaratan", "ReviewID": "R1E2L9QKY8971E", "Overall": "4.0", "Content": "A bit heavy but very fast. Need to get used to the windows. They are everywhere. I would suggest to everyone. So thin!", "Date": "March 4, 2014"}, {"Title": "The only bad thing is the operational system", "Author": "Daniel Shikanai Kerr", "ReviewID": "R2JO9ZQV4PB8EJ", "Overall": "4.0", "Content": "Quite light for its configuration, fast, good size and power. The touchscreen is a big plus since my mother uses this machine and she sometimes have problems with the touchpad.So far the only con I found in this machine is the operational system. Windows 8 tried so hard to be idiot proof that sometimes it makes quite difficult to change simple configurations or traps you in certain programs (after clicking in a \"send a e-mail\" link it opened a white screen with \"e-mail\" written that by some bizarre screen glitch you could not see anything else nor way to get back to the start screen.This rant with windows 8 is because it comes so deeply bound to the machine that I needed to call tech support in order to get the machine to boot from the windows recovery disk.", "Date": "February 13, 2014"}, {"Title": "A very Decent ASUS product", "Author": "Retiree", "ReviewID": "R357LL0VVY6JFR", "Overall": "4.0", "Content": "I travel a lot to include remote areas of Alaska. I've purchased about 9 laptops which I use for presentations throughout the country and use small thumb drives which I provide to customers and friends.  The ASUS VivoBook S500CA is a fairly light unit without a DVD writer.  For those who need a writer, buy an external USB writer. This laptop is great.  It comes with 4Gb internal RAM and a 500 Gb hard drive for storage and a 24Gb SSD for OS/startup. I added a single Black 8Gb DDR memory module and now have 11.9 Gb (usable). With a third generation I7 and touchscreen, this unit is hard to beat. It is reasonably fast with the built-in video being the bottleneck. For the price it's great. The keyboard leaves a lot to be desired, especially the spacebar. This laptop does not deserve a 5 star rating because of the video and keyboard. ASUS makes great mainboards and I've built hundreds of units with their HW. This is my first laptop that I will use personally. Happy with their product so far. I wish shipping had been faster.", "Date": "February 6, 2014"}, {"Title": "Great laptop at a great price !!", "Author": "Miguel Mejia", "ReviewID": "R1ZXZRMDY2K5ZW", "Overall": "5.0", "Content": "Excellent option, very fast, very lightweight, touch screen is flawless. Watched hours of movies and it never got hot. Easy to set up.  Very happy with the purchase. AAA.", "Date": "January 23, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00E9FQIC6"}}