{"Reviews": [{"Title": "Touchscreen issues, bad customer service", "Author": "Julie Vandenboom", "ReviewID": "RLS8UI46YWXLO", "Overall": "1.0", "Content": "After reading several reviews, we determined that any laptop we got with Windows 8 should be a touchscreen. We chose this Gateway based primarily on price, as there were no Amazon reviews up yet when we decided what to get.This computer works well for our modest needs. We take some pictures, surf the internet, watch Youtube, and do some very light gaming. We're not a very high-tech household -- on our last laptop we never even came close to using half of the hard drive space. So size of the hard drive and processor speed weren't big considerations for us. Pretty much anything on the market right now is enough for us.The computer has worked well over the past month. We've had some hiccups getting used to Windows 8, but nothing unexpected. However, yesterday the touchscreen quit working. Everything else seems fine. Gateway Support first had me uninstall the USB drivers and restart the computer. That didn't fix the issue. Next, they had me refresh the operating system. That didn't fix the issue either. They've asked me now to send the computer back so they can service it. It's still under warranty, so they're covering shipping both ways and the cost of the repair. Once they receive it, they'll have it for 7-10 business days, so we'll have the frustration of being without the computer for two or three weeks.In retrospect, I think I would have rather saved $50 - $100 and bought a computer without a touchscreen. As with other forms of technology, the more bells and whistles you put on something that you don't *really* need, the more there is that can go wrong with it...EDITED: We got our laptop back on Friday, after having it gone for three weeks. The touchscreen is fixed; however, now the webcam doesn't work. Customer support believes that the webcam was unplugged while they were repairing it, and they've asked me to send the laptop back again. I don't think I can do without it for another three weeks. They don't have any other options -- won't give me my money back, won't send a new computer. I'm done with Gateway...", "Date": "January 5, 2014"}, {"Title": "Good Entry Level Laptop", "Author": "Michael Trujillo", "ReviewID": "RDDA60OIEKIJA", "Overall": "4.0", "Content": "Got this during the Black Friday Madness.Before this had a chromebook and tried to use it for school, it made life difficultLooking for a entry level laptop for Microsoft Word, goofing off on the web, and watching Netflix. (or Amazon Instant Video, sorry Amazon)Wish it didn't have a DVD burner, might of lighten the weight, also the keyboard is a little different then normal, love that it has a full number pad in the keyboard but it takes some getting used to.Good entry Level Laptop for school and movie watching.", "Date": "December 7, 2013"}, {"Title": "So far its awesome", "Author": "Jen", "ReviewID": "R3DF16SR7JSW9N", "Overall": "5.0", "Content": "Purchased this laptop for school and have been using it for a little over a month. It is not the smallest lightest one out there, but it is very light and thin profiled for 15.6 size. Also, the full keyboard is a major plus when you are writing a lot of papers. I love the option with Win 8 to listen to my music apps at the same time as using Microsoft Word to work etc, again for long study/paper writing sessions its a big plus.  The touch screen is a great fun feature, I am old enough that that I have lived without it long enough it is not necessary, but it is a very fun nice touch.  The  real winner though was the price, for all you get the price could not be beat. It has not let me down.", "Date": "December 31, 2013"}, {"Title": "Dead on Arrival", "Author": "Steven Hord", "ReviewID": "R3990EM4LTUTN6", "Overall": "1.0", "Content": "I plugged it in and the battery LED flashed.  I waited 24 hrs and the LED didn't come back on indicating it charged.  The computer wouldn't start up. Spent an hour w/ Gateway customer support while they made me try everything to make it work (does the electric socket work? yes, I tested it with my christmas tree lights).  They said it was a faulty power supply and shipped me a new one.  I went through the same rig-amoral the second time, but now they acknowledge it isn't the power supply.  They wanted me to pay to ship the computer to them and wait a few weeks to get it fixed. They wouldn't just replace it with a new unit.Who knows what would go wrong next?I'll send it back and go w/ a reputable manufacturer.", "Date": "December 16, 2013"}, {"Title": "Great little laptop!!", "Author": "SS", "ReviewID": "R1WAFB2P078WA5", "Overall": "5.0", "Content": "This laptop was a present for my husband, who wanted the smallest laptop he could get with an optical drive. Now he can watch DVDs and burn photos to a disk without having to hook up an external drive, plus he has he added feature of the touch screen. He loves it!", "Date": "December 9, 2013"}, {"Title": "Great so far!", "Author": "Kathleen B. Mcdade \"skmcdade\"", "ReviewID": "R315XF1CA8G32K", "Overall": "4.0", "Content": "We like this a lot so far (had it about a month). The touchscreen definitely helps you make the most of Windows 8, which behaves more like a tablet or phone OS. We like the screen size, but using the keyboard can be a little wonky, since the main part of the keyboard is offcenter from the screen to make room for the keypad. I just takes a little getting used to. The case doesn't feel as sturdy as my MacBook Pro, but for primarily home use I'm OK with that.", "Date": "January 1, 2014"}, {"Title": "A review from an IT professional", "Author": "David", "ReviewID": "R3GYKDH2JMZE2K", "Overall": "4.0", "Content": "I work in IT for a living, and quite frankly I don't understand the negative reviews on this laptop. Let me preface this review by saying it was on sale at Amazon for $349 when I purchased it, so higher pricing points might tarnish my views a bit. But for $350, let me give you this computer's strong points. First, it packs a lot of features for a low price: touch screen? Yes. Bluetooth built in? Yep. DVD-RW? You got it. USB 3.0 and USB 2.0? It's there. Now, here's the real plus: this laptop is FAST. I'm not a big fan of Windows 8, but it runs flawlessly and is well integrated for this machine. By using the touch screen you can finally experience Windows 8 as it was meant to function.The only negative comment I have is about the casing around the screen. When you go to lift the screen to use the computer, the casing feels weak around the edges. I wish they would have made the \"lid\" more sturdy. That being said, I don't think you can beat the features of this laptop for the price. Would I pay more than $400 for it? No. If you can get it between $350 and $400, then I think you'll be happy with it as I am.", "Date": "February 27, 2014"}, {"Title": "Christmas Gift", "Author": "Carlin", "ReviewID": "R2K4XNOCJ8MSUK", "Overall": "5.0", "Content": "I purchased this laptop as a lightning deal to give to my fiance for Christmas. We really just use our computer to pay bills research wedding details and for social networking. It works very well for everything we need it for. The touch screen was a nice add on and is great to use for gaming purposes. Ours has never had a glitch and works very well. My fiance loves that it has the Xbox smart glass feature and that definitely comes in handy. All in all the computer works great for all that we use it for and I would recommend it to someone looking for a nice priced laptop.", "Date": "December 31, 2013"}, {"Title": "Microsoft Word Starter NOT Included", "Author": "Hogan Aynaris", "ReviewID": "RX74LMQ65VI2G", "Overall": "1.0", "Content": "Purchased this laptop for our son for Jr HS.  He can surf the internet and the WiFi works okay.  However, Microsoft Wrod Starter is NOT included in the software as it is for nearly every other brand of computer.  He is not able to open documents and powerpoints that his teachers email to him.  Useless unless one is willing to dish out $135 per YEAR for a subscription.  Will be returning this Gateway.", "Date": "January 8, 2014"}, {"Title": "Written manual?", "Author": "Mary K. Nichols", "ReviewID": "R16MG1D3ISWSBE", "Overall": "4.0", "Content": "I am complete satisfied except for one thing....would like to have had a written manual.  Being over 75.... I needto see things in front of me and know where to go.  I have had problems  searching...where do I go to find what???I am asking others where I could be looking it up in a manual.", "Date": "May 13, 2014"}, {"Title": "Gateway Laptop", "Author": "Brianna perez", "ReviewID": "R2RTX2E5GYA4BZ", "Overall": "5.0", "Content": "I love this laptop! I'm very happy that I purchased it, I looked everywhere for a laptop that was both touchscreen and had a DVD drive. I am very very very happy that I bought this!", "Date": "December 16, 2013"}, {"Title": "PILL OF GARBAGE", "Author": "kurt harlan", "ReviewID": "R2Z4GPGNUNOALM", "Overall": "1.0", "Content": "PUIRCHASED ON 10-29-13 ON 11-19-13 POWER BUTTON QUIT WORKING AND HAD TO SEND IT BACK TO GATEWAY FOR REPAIR. ON 12-13-13 GOT MY LAPTOP BACK AND NOW IT WILL POWER UP BUT TOUCH SCREEN NO LONGER WORKS. CALLED GATEWAY TECH AND THEY HAD ME DO A FEW THINGS THAT DID NOT FIX THE TOUCH SCREEN PART. ONLY THING THEY CAN DO IS HAVE ME SEND IT BACK FOR REPAIR AGAIN. AT THIS POINT I THOUGHT IT WOULD BETTER TO JUST RETURN FOR REFUND BUT FOUND OUT 12-1-13 WAS THE LAST DAY COMPUTER COULD BE RETURNED FOR REFUND. WOW SUPER DISAPPOINTED IN GATEWAY NOW! THIS WILL BE MY LAST GATEWAY OR ACER PURCHASE.", "Date": "December 13, 2013"}], "ProductInfo": {"Price": "$469.99", "Features": "Intel Pentium 2117U 1.8 GHz (2 MB Cache)\n4 GB DDR3\n500 GB 5400 rpm Hard Drive\n15.6-Inch Touchscreen, Intel HD Graphics\nWindows 8, 4-hour battery life", "Name": "Gateway NV570P04u 15.6-Inch Touchscreen Laptop (Metallic Gray)", "ImgURL": "http://ecx.images-amazon.com/images/I/41evG%2BSb0TL._SX300_.jpg", "ProductID": "B00EY50IV8"}}