{"Reviews": [{"Title": "hidden value", "Author": "Dave Pavement", "ReviewID": "R2FS5ZX5YZOUDL", "Overall": "5.0", "Content": "Ok, I get, everyone is running this thing down in favor of the new HP 11[...]for 80 bucks more...but why? This thing has 4GB ram, very substantial feeling and you will love what the apps can do with your pictures and videos in the cloud...(unless you are paranoid that Google IS the NSA)...I compared it over a week with the Samsung $249 Series 3 XE303C12-A01US model and hands down on video playback the Acer was superior...as was the keyboard feel...I'll go out on a limb and suggest that for a good 90 percent of the population you don't need to spend more than $200!add...I'm surprised to see on Amazon at this price...bought at Staples today for $199.", "Date": "October 8, 2013"}, {"Title": "Excelent Computer", "Author": "Wildone", "ReviewID": "RPI71Y40EAMNM", "Overall": "5.0", "Content": "Great computer.  Fast internet. Easy to use keyboard.  Recommend it to any parent looking to purchase a reasonably priced computer for a high school or college student.", "Date": "December 31, 2013"}, {"Title": "This is the $199 Chromebook with 2GB extra memory", "Author": "R. Tupelo Schneck", "ReviewID": "R2AUQ9JTDLIWIW", "Overall": "3.0", "Content": "Update, December 2013: at this point, almost all users should get the Acer C720 Chromebook instead of any of the C710 models.I love Chromebook and I love the Acer C7; see my big review at Acer C710-2833 Chromebook or Acer C7 C710-2847 Chromebook.However, *this* Acer C7 version is not the Chromebook for most users.  Most users should get the Acer C710-2833 Chromebook for $199 instead.  There is exactly one change in this Acer C710-2457: 2GB extra memory for a total of 4GB.  The extra memory is good, but probably not worth much extra money; and one of the big benefits of the Acer C7 is that it is easy to upgrade yourself!  It will quite likely even be cheaper.", "Date": "August 23, 2013"}, {"Title": "/", "Author": "Erik Osburn", "ReviewID": "R39R91Z37YA4CN", "Overall": "4.0", "Content": "I gave this product as a gift.  As a result, I haven't used it much.  My girlfriend seems happy with it, though.", "Date": "January 12, 2014"}, {"Title": "Nice Laptop but strange Google Chrome OS", "Author": "ernest_chevUSA1", "ReviewID": "R34VGUFU017D5H", "Overall": "3.0", "Content": "I like the computer itself just fine but that Google Chrome OS is for the birds, just plain weird and different and just a pain in the butt!", "Date": "January 27, 2014"}], "ProductInfo": {"Price": "$322.00", "Features": "Screen Size: 11.6\"\nScreen Resolution: 1366 x 768\nProcessor Type: Intel\nProcessor Model: Celeron 847\nProcessor Speed: 1.1GHz", "Name": "Acer 11.6\" Aspire Laptop 4GB 16GB | C710-2457", "ImgURL": "http://ecx.images-amazon.com/images/I/41xYFLlrdjL._SY300_.jpg", "ProductID": "B00EKS33FC"}}