{"Reviews": [{"Title": "The best of the best", "Author": "Luckyone", "ReviewID": "R228FGTOD0HEJ5", "Overall": "5.0", "Content": "I bought mine for $329 at Office max when they had an $100 off sale. It was a deal sealer. They said this model just came out, and it was top of line. Its an very attractive model over ASUS which is two tone with Silver and I hated that. This is my first HP and I love it.This laptop boots up to useable screen in 3 seconds! And I set mine to shut down when the lid is shut.It comes with windows 8 and you can switch to windows desktop with a push of the screen or by pressing window button on the keyboard. I believe windows 8 is far superior to windows 7 and the touch screen is a real nice item! I bought this after looking at a bunch of them and decided I wanted touch screen & windows 8-with desktop like windows 7. The start button is missing but its coming back in the next update. I'm using short cuts  to 'my computer' and 'my documents' to get around it.The screen is very vibrant to look at, has 2 USB 3.0 ports, and one 2.0port that I use for a wireless mouse. it has HDMI hook ups for HD external monitor and it appears to have an express card slot, VGA, and built in Ethernet for connecting to the internet if you don't have access to wireless.It doesn't play DVDs with an external DVD player unless you have a program like cyberlink 8 or better- I just happened to have one laying around, those programs can be expensive.  I bought the LG external player for $20+ and I used it to install software too and its very portable.The computer is pretty fast and I had no problems installing stuff. It has 500 Gb hard drive plenty of space, 4 gigs of ram and I believe its upgradable to 8 gigs.I have to say its the best laptop I have ever purchased.. lightweight, very portable, fast, very attractive,  and you're up and running very quick. Its ideal for on the go internet. But if you want to use it to watch DVD's on your 55 inch screen.. it won't power that. Or using it to power graphic intensive programs...so be realistic in what you want..", "Date": "September 6, 2013"}, {"Title": "A4-1250 is not strong enough but A6 quad is available for cheaper, Tips etc. Thumbs up", "Author": "GC", "ReviewID": "RQVZ6F8VW18BC", "Overall": "3.0", "Content": "A4-1250  is just not enough for any notebook, PERIOD.Avoid all laptops with AMD A4.GET ATLEAST AN A6-1450 OR ABOVE.I was doing my research i found these (for the EQUAL PRICE),thumbs up to help others.(pls thumbs up, I put a lot of hours making compiling this review. ty:-)==CONTENTS==1) Alternative Options2) TOP 3  ($280-$399)-(11.6\"-14\"Touch between (3.7-2.6 lbs)3) TOP 2  ($399 - $499)-(14\"Touch between (4.7lbs-5.6lbs)4) TOP 2  ($500-$800)-(15\"Touch between (4.8 Ibs - 5.6 lbs or higher)5) Windows 8.1 Tips & Computing Safety between==Alternative Options==I was doing my research my goal was to find the value laptop without hurting my wallet,  I continue to update and filter through the entire amazon laptop list! YES indeed!  I've done the hard work of searching for the best performing, best priced, that best fit our needs. This is a list of economical touch-screens Windows8 laptop which also offers excellent performance+battery==TOP 3  ($280-$399)-(11.6\"-14\"Touch between (3.7-2.6 lbs)==Here are the best choices for 11\" functional, portable, light weight, bang for your buck notebooks.<><>Expected Performance Meter<><><>ENTERTAINMENT<>[Average to Poor] PC Gaming or [Average] Facebook Gaming[Excellent] Social Media surfing (Twitter,Facebook,Linkedin)[Excellent] Video Chatting (Skype)[Average] Streaming Shows HD (Netlfix,Youtube,Hulu,iTunes)[Excellent] Music Library (iTunes,Amazon MP3,Lastfm,Spotify)<>PRODUCTIVITY<>[Average] MS Office[Excellent] TurboTax, Quickbooks[Excellent] Education Free Courses (from basic algebra at Udacity to Advanced MIT's Open Courseware)<>EXPRESS YOUR CREATIVITY<>[POOR] Music Creation (create music recodings, Audacity)[Average] Photoshop editing (Photoshop Elements)[POOR] Video Editing (Sony Vegas/MovieStudio, Adobe Premier)[Average] Website development (Adobe Dreamweaver CS3)<> NO.1 +/- $359 Lenovo IdeaPad S210 59387503 11.6-Inch Touchscreen Laptop, 1.9 GHz Intel Pentium 2127U ULV(dualcore,2 MBCache, 3rdgen/Ivy Bridge,July2013chip$134), 4GB RAM, 500GB HD(Black)PROS: Light weight at 3.1lbs,.9\"thick. Great 720p camera for Skype, 1usb 3.0, TouchScreen.[CPU Passmark Score: 1865]CONS:Battery life, No Bluetooth.  not a great deal if prices increase to closer to $400. at +$400 price rage, I'd advise looking into 14\" notebooks options listed below, to get more for your money. Sold by 3rd Party seller, not amazon<> NO.2  +/- $335 HP Pavilion 11-e015nr TouchSmart 11.6\" Touch Screen - AMD Elite Quad-Core A6-1450(06/01/2013) / 4GB DDR3 / 320GB HD / Windows 8 64-bit OSPROS: Quadcore A6-1450  SoC are usually in notebooks at +$450 category but for HPs asking $350ish ? DEAL! but downgraded the Hard Drive , Touch, 4GB, / one of the better CPU/APU options in this category for gaming(Portal 2 and Torchlight 2 on high settings but lag free! /Upgradable to 8GB verified) 3.37lbs[Passmark Score: 1642]CONS: 320GB instead of 500GB, HP build quality is avg compared to ASUS or Lenovo but thats subjective.  Prices fluctuates too much, if sellers increase their prices closer to $400 i would not recommend buying this or any 11.6\" note books. At $400, finding a better  14\"-15\" touch screen size is possible.  I made my Top Notebooks List at $400 tag below, for details. Sold by 3rd Party seller, not amazon<> NO.3 +/- $454  Acer Aspire V5-122P-0637 11.6-Inch Touchscreen Laptop (Chill Silver)(1.0 GHz up to 1.4GHz AMD Elite Mobility Quad-Core A6-1450 Accelerated Processor, 6GB DDR3 SDRAM, 500GB 5400RPM hard drive, Windows 8 64-bitPROS: IPS screen better color and viewing angle(probably best screen on this list), Same CPU/APU as HP Pavilion TouchSmart 11 listed above thus Pros are identical, + 500GB Hard Drive , 6GB RAM! best gaming capable system at the light weight 11.6\" Touch screen category. Enough power in this noteboko to deliver performance that it could act as secondary main PC.[CPU Passmark Score: 1642]CONS: Expensive at $450 but it has 6GB RAM(instead 2GB) and 500GB HD(instead of 340GB) with the AMD A6-1450 Quadcore (instead of poor performance AMD A4-1250 Dualcore AVOID at all cost!)______________________________________________________________________________== TOP 2  ($399 - $499)-(14\"Touch between (4.7lbs-5.6lbs) ==These 14\" touch screen laptops are designed for those who are always on go or need a portable computing device, bigger than 10.1-11\"display without sacrificing performance. These notebooks are powerful enough to act as your secondary main PC machine for school, work and home.WHAT YOU DESERVE AT $400  (Typically an increase in price fallows an increase in quality of parts.  At  this price range expect a 14\" Screen Touch ,  with CPU Intel i3 or AMD's A6 or A8 processors) I favor AMD due to their graphics performance doubling that of Intel variant.<><>EXPECTED PERFORMANCE METER<><><Entertainment>[Average] PC Gaming or [Excellent] Facebook Gaming[Excellent] Social Media surfing (Twitter,Facebook,Linkedin)[Excellent] Video Chatting (Skype)[Average] Streaming Shows HD (Netlfix,Youtube,Hulu,iTunes)[Excellent] Music Library (iTunes,Amazon MP3,Lastfm,Spotify)[Average] MS Office[Excellent] TurboTax, Quickbook[Excellent] Education Free Courses (from basic algebra at Udacity to Advance MIT's Open Courseware)<Express Your Creativity>[POOR] Music Creation (create music recodings, Audacity)[Average] Photoshop editing (Photoshop Elements)[POOR] Video Editing (Sony Vegas/MovieStudio, Adobe Premier)[Average] Website development (Adobe Dreamweaver CS3)<> NO. 1 +/- $448 Lenovo IdeaPad S415 59385549 AMD A6-5200M(May 23, 2013) 2.0 GHz Processor (2 MB  Cache05/23/2013, Kabini), 4 GB DDR3 RAM, 500 GB 5400 rpm Hard Drive,  14-Inch Screen Touchscreen, ATI Radeon HD  8400 Integrated Graphics,Windows 8, 5-hour battery...,PROS: Its an IdeaPad brand+build quaity, 14\" touch, Battery life 5hrs!, 720p HD webcam , Sold by Amazon.comCPU Passmark Score: 2450CONS:<> NO. 2 +/- $479 HP Pavilion 14-f027cl 14\" Touch Laptop, AMD A8-5545M 6GB Memory 640GB Hard DrivePROS: Battery life, +5hrBig 14\" touchscreen, Higher grade AMD Elite Quad-Core A8-5545M Accelerated Processor with 4MB L2 Cache, Bigger 640GB Hard drive, and 6 GB RAM, More USB 3.0 . A8-5545M is higher step APU compared to next 2 laptops below sporting an A4-1450 APU thus this is faster and better choice for gaming.[CPU Passmark Score: 2539]Cons: 1.7lbs heavier than 11.6\" notebooks, Expensive if your budget goal is to get a capable notebook for under $400. don't buy if +$475 asking price.  +$500 price range there are better product selections at 15\" Notebook category. Sold by 3rd Party seller not Amazon.com______________________________________________________________________________== TOP 2  ($500-$800)-(15\"Touch between (4.8lbs - 5.6lbs or higher) ==These touch screen laptop is designed for those who requires performance over portability.<><>EXPECTED PERFORMANCE METER<><><Entertainment>[Excellent] PC Gaming or [Excellent] Facebook Gaming[Excellent] Social Media surfing (Twitter,Facebook,Linkedin)[Excellent] Video Chatting (Skype)[Excellent] Streaming Shows HD (Netlfix,Youtube,Hulu,iTunes)[Excellent] Music Library (iTunes,Amazon MP3,Lastfm,Spotify)[Excellent] MS Office[Excellent] TurboTax, Quickbooks[Excellent] Education Free Courses (from basic algetbra at Udacity to advance MIT's Open Courseware)<Express Your Creativity>[Excellent]Creation (create music recordings, Audacity)[Excellent] Photoshop editing (Photoshop Elements)[Average] Video Editing (Sony Vegas/MovieStudio, Adobe Premier)[Excellent] Website development (Adobe Dreamweaver CS3)<> No.1 $479 Acer Aspire E1-572P-6857 15.6\" Touch,Intel i3-4010U Processor 1.7Ghz,6GB RAM, 750GB HDDPROS: SOLD by Amazon. an Intel i3 touchscreen at 15\" for under $480 is rare. Way under priced for what you're getting.  Could easily be marked up  close to $600 for sure. Battery life is good due to (new)Haswell processor. Great IPS screen. SD card reader , Nice solid Metalic feel unlike most notebooks in this price range made of plastic.[CPU Passmark Score: 2514]CONS: Weight, standard weight 5.6lbs for 15\" notebook. Great for Video chat with 720P HD camera.<> No. 2 Acer Aspire V5-552P-X440,A10-5757M,8GB Ram, 1000GB HDD 15.6-Inch Touchscreen Laptop (Cold Steel)PROS: SOLD by Amazon, 4.8 lbs, Thin .9\" Ultrabook, Powerful A-10 Quadcore processor, 8 GB of RAM, Huge 1000GB Hard drive(1TB), Fastest APU/CPU for gaming. Powerful still managed to be thin+lighter than standard  15\" notebooks. 4.5hrs battery. Back-lit Keyboard, High end non-plasticy shell, Great for HD Video Chats, Acer.com sells this for $700! Great for business, gaming, traveling, home use, main PC, etc. Superb IPS screen. Its the best of both worlds, ease mobility, super thin and ultra light but powerful enough for everything, all premium features without Ultrabook's $1k Premium prices.[CPU Passmark Score: 2922]CONS: Need to manually upgrade from Windows 8 to 8.1(free) via Windows Marketplace,  No Disc drive, At $600 you shouldn't complain.  The power and portability you get from this notebook could easily cost you somewhere near $1000 Ultrabook category.  No cons, its perfect at its price._______________TIPS_________________Bring back the start button: Install Classic Shell (free) or Start8 (Stardock $5)___________________________________________________________________Avoiding damages to your PC if you're infected by malware,virus etc is simply not Administrator Account with your main MS Account.Viruses will likely cause more damage and will be impossible to completely remove if they have dug deep inside your computer. Administrators account is the simplest backdoor route viruses/malware etc uses get in and cause unrecoverable distruction. With Admin rights those malware can easily infect even your \"recovery partitions'! meaning you're royally screwed. Theres a lot of crap that can happen but I think you already get my point.GOAL: Don't Use Administrator Account Type On Your Main MS Account.Account Management: stepsCharms search: \"control panel\" > \"User's Accounts and Family Safety\" > \"Remove User account\" > \" Add a new user in PC settings \" @bottom of window > Bringing you to Metro > click \"add Account\" > \"Sign in without MS accout\" @bottom of page > \"Local Accout\" > create new user name and PWYou have 2 options on Signing IN1) Microsoft account or 2) Local Account1) Create or sign in with your MAIN Microsoft Account. If you already an MS account or uses windows phones/ xbox live or Hotmail/live/MSN email address you can use these as well to link those services to 1 master MS Account.2) Create a Local Account. Thise secondary account will not connect to MS's ecosytem but only in your local computer. I identical to USERS login on Windows 7,Vista,XP etc.Once you've setup these two accounts, you must each account type to: >Change ACCOUNT TYPE for Main MS Account to \"Standard\"Change ACCOUNT TYPE for 2ndary Local Account to \"Administrator\"__________________________________________________________________________Back ups/ EtcAnother tip is to make a recover image.Setup your pc with all the programs you'd use and pretty much do all the necessary custom settings you love to do to personalize your PC. then create a recovery image right after you've set everything up.Sometimes system recovery doesn't solve your problems so having secondary backup plan like recovery image is key.________________________________________________________________________(Install McAfee Antivirus, which is now free starting 2014, per Intel's 2014 Keynote at CES)(Install MalwareBytes/free, scan your pc every month with this program)(Install Superantispyware/free, Scan pc every 2wks)orPaid programs such as Kaspersky Antivirus is the leading software in the market today. $50________________________________________________________________________Another way of avoiding putting out your information out there into the wild is to un-google yourself.yes! google or yahoo especially not yahoo LOL but google is key here.Microsoft sells Primarily Software.Apple sells Primarily HardwareGoogle sells neither, that's why their products are so CHEAP, once they suckered in their backdoor ridden ecosystem, Google Inc. sells Primarily Everything about YOU!_____________________________________________________________________________________________________Steps in upgrading from Windows 8 to Windows 8.1Key here is to ensure your windows 8 is fully updated before upgrading to win8.1Therefore repeatedly \"check of updates\" on windowsInstall those updatesRestart (important) PCRerun \"check for updates\" againRestart PCuntil there's none leftUninstall your Antivirus program (important)Restart PCCheck updates using \"HP Support Assistant\" its a build in client in all HP products.RestartRecheck \"HP Support Assistant\" if no other updates then done.ONLY THEN you should install WIndows 8.1 at the marketplace. Goodluck.(note: steps above removes a lot of failures users experience after 8.1 update)______________________________________________________________________________________________________Not many want to shell out their dollars on Office 360  if all they intend of using is standard word processors.you can use a free web version of office calledMS Office Web Appsjust sign in with the same  MS Account user name used on your PC.", "Date": "February 2, 2014"}, {"Title": "Very Well-thought-out Laptop, at a Value Price", "Author": "Louis Sander", "ReviewID": "RF1EJK38M2FGW", "Overall": "5.0", "Content": "I needed a small laptop with a wired Internet connector (to use in hotels--their wi-fi is often not free, and often isn't very responsive). This unit more than met my needs, and has Windows 8 and a touch screen to boot. There is a LOT of capability here for a VERY reasonable price.The touch screen and Windows 8 work very well together, but of course Windows 8 takes some getting used to if you're not already familiar with it. Having the touch screen makes that a LOT easier.The main thing I notice about this laptop is how nicely it is designed. The connectors, the keyboard, the lights, the case, the screen -- everything just oozes quality and good engineering. HP must have hired some designers away from Apple, because this is a NICE machine, along the lines of Apple's famous hardware. It's not the fastest thing in the world, but after all it's a low-cost laptop.There's no optical drive in the computer, and I haven't yet hooked it up to an external drive and tried to load any software. Based on other reviews, I don't expect any problems. I haven't used the machine on battery power, but it seems to have ample battery life. It gives you battery reports in percent remaining AND an estimate of what that translates to in time. I imagine that this is a Windows 8 feature, but whoever put it in, it's nice to have.", "Date": "September 18, 2013"}, {"Title": "Nexus 5 of 11 inch latpops, Chromebook with windows!", "Author": "Fszeker", "ReviewID": "R3CAA2E684BJN7", "Overall": "5.0", "Content": "If you have less than $400 to spend on a solid laptop/netbook/ultrabook then this is the best choice you can make! This HP is like Nexus 5 in Mobiles - The best in this price range ($200 - $500), you pay not a lot but you can do a lot of stuff!The Touchscreen really improves the User Experience, 11 inch for most portable work is pretty enough and it does perform pretty well when it comes to screen brightnesss. The battery life is one of the best ive ever experienced in such a cheap laptop it achieves more than 5 hours on medium screen brightness! The keyboard and the touchpad are comfortable but when it comes to touchscreen you might get a little disappointed because of not too big screen bending angles. IT IS NOT A HYBRID/TABLAPTOP it's a netbook. You can still get the heck out of it while at starbucks hipstering with instagram or just taking notes in college. It does not come with fireworks and tea in the box, but c'mon Office 365 subscribtion is not that expensive and Google Docs does fine most of the times. I have point out the lack of Bluetooth and the bigger then normal battery (does not fit in moset 11 inch laptop sleeves) as problems but it certeinly fixes that with its price. I will end with saying: It's like chromebook (price, size, performance) but with Windows (functionality) and it is not RT! (Even thought it's ARM CPU).Worth buying!", "Date": "November 5, 2013"}, {"Title": "Nice Touchscreen for the Price", "Author": "Jersey Girl", "ReviewID": "R1IPT0VDY5XRTW", "Overall": "4.0", "Content": "This notebook works exceptionally well and although I was skeptical about the touchscreen, it works great and enables me to use this notebook anywhere without a mouse. The only reason I'm giving it 4 stars is because I'm not a big fan of Windows 8. I hear Windows 8.1 is better (with addition of the much missed \"start\" button) but I haven't been able to download it. The upgrade to Windows 8.1 is free, but whenever I try to download it, I get an error message. Other than that, this notebook preforms really well. I even used it at a party to project a Windows Movie Maker film I created for my daughter's Sweet 16 party. When I told people what I paid for the notebook, they were impressed. Don't hesitate!", "Date": "December 17, 2013"}, {"Title": "extremely slow computer", "Author": "Amazon Customer", "ReviewID": "R12FX9UORBPT54", "Overall": "1.0", "Content": "Feels like the computer is from the 80s - super slow even for basic browsing. I had to return because I could even surf the internet on it - it is THAT slow!", "Date": "January 10, 2014"}, {"Title": "Not Bad", "Author": "Amazon Customer", "ReviewID": "R46ZP97SSVZQV", "Overall": "4.0", "Content": "I just bought this little guy the other day because I needed a laptop to use for school that was light weight, small and cheap, but not one of those mini laptops. I found this at walmart on black Friday for $278. This was perfect and, I didn't realize when I bought it but, it has a pretty responsive touchscreen. I wish it was as responsive as my galaxy s4, but I'm not complaining.", "Date": "December 2, 2013"}, {"Title": "little laptop awesome product", "Author": "Marianne C. Rafferty \"womanoperator.org\"", "ReviewID": "R2DRU9GKKVNXF9", "Overall": "5.0", "Content": "Looking for a laptop to go to Florida that was not as bulky as my 15 inch, or as heavy I picked this up on sale and as of two days it seems a really good buy. It is quick,loads quick has windows 8 which I am getting used to and I am getting used to the key placement although I wush it had a back lit keyboard and as you know it doesn't have a cd dvd drive. Other than that for a little more than 350 I am very satisfied", "Date": "August 31, 2013"}, {"Title": "nice laptop", "Author": "evelyne ringia", "ReviewID": "R2YWRQWKP1VHJX", "Overall": "5.0", "Content": "Its a little slow but works just fine and I like it. Its light to carry the touch screen is good except that sometimes it switches screen when you don't intend to if other programs are open. its good for movies and videos but the sound is a bit low but if you use headphones its perfect. I thought it was black behind the screen but its silver but it is still beautiful.", "Date": "November 17, 2013"}, {"Title": "Too slow", "Author": "2luu", "ReviewID": "R9FVLV813Y5EE", "Overall": "2.0", "Content": "Product is good for browsing but not much else, internet downloads,hardware/software installations and pretty much every other task takes ages to process", "Date": "May 5, 2014"}, {"Title": "Dreck", "Author": "Allan Boress \"aboress\"", "ReviewID": "RKQ87WJ02W6T6", "Overall": "1.0", "Content": "Thought it was a light, inexpensive all purpose laptop when I first got it. Even with Windows 8 - which I hate. After a couple of months the battery went; HP support was kind and very quick and sent another right away.  Then the hard drive went (I am not hard on products; had a pair of Chucks for 20 years); they sent a replacement.  Then the 2nd battery went bad evidently and support (all the while very helpful and responsive) told me to ship it back for a replacement of the system board. Two weeks later it came back with no change as they didnt replace the board but the battery (D'Oh!).  Two months without the computer and it still isnt fixed. They have promised me a replacement and I am still waiting 2 weeks later...  There is a word in a language no longer much spoken called \"dreck.\" This machine was dreck (look it up).", "Date": "April 4, 2014"}, {"Title": "Too slow? Fix it!", "Author": "ED", "ReviewID": "R2LE8S1BVF5VXO", "Overall": "4.0", "Content": "Everyone complains about how slow this pc is--and it is like molasses. But if you can't or don't want to return it, just remove all non-essential programs (bloatware) from the programs in the control panel; leave only Microsoft and some HP, and all others that are essential for the drivers that the devices use. Next, get rid of Norton and get a lighter anti-virus. Also, the touchscreen is frustrating--disable it by going to control panel, device manager, human interface, and disable the first HID device.  Finally, after all the deleting, run a registry cleaner like \"CC\". We did this and the pc now runs 5X faster and is \"normal\" for a little notebook processor.", "Date": "April 2, 2014"}, {"Title": "not a good product", "Author": "Constant Mandza", "ReviewID": "R1NR0QLGO43D7Z", "Overall": "1.0", "Content": "I did not like it, the screen moved by itself all the time.Returned it for a full refund. Look nice but the performance is terrible", "Date": "March 21, 2014"}, {"Title": "Too slow, but for the price im happy", "Author": "angela", "ReviewID": "R2IL1PZ3091LX", "Overall": "4.0", "Content": "I got this little computing device when my hp g7 passed away. although i was still grieving the loss of g7 and knew it was too soon i still went ahead with the purchase of this mini me of the g7. i bought it on sale and for the price i am happy (330 tax included). i love the portability, 7 hour of battery life (even streaming movies), keyboard is great and has all the same ports as my g7. Its been a month and i am still getting used to windows 8, but i can push a button and be on my google desktop. So, now the downside. It is s..........l..........o.......w! One tab at a time! Would i recommend as main computer? No, but for goofing off or light homework its fine.", "Date": "March 21, 2014"}, {"Title": "Tooooo slow!", "Author": "spiritual rose", "ReviewID": "R615RKJOINLJ9", "Overall": "1.0", "Content": "I hate returning things and I don't use it much. Nice but too slow.... If I still have time to return I will.", "Date": "March 20, 2014"}, {"Title": "Do not buy... it will turn you into an angry person", "Author": "ELEANOR LUCKCOCK", "ReviewID": "R35MUF7AMHLOYK", "Overall": "1.0", "Content": "It is SO SLOW I find it hard to believe people still make laptops this bad.... I can barely browse the internet and learnt within a day that if I wanted to watch a video I couldn't do it on this machine. Touch screen sucked so I turned it off. Audio crackles for some unknown reason, and it will also stop and start in a really irritating way if you try to listen to anything whilst doing something at the same time. It updates irrelevant stuff a million times a week but nothing gets any better. Windows 8 does not help the situation. Piece of crap.", "Date": "March 18, 2014"}, {"Title": "Daughters happy with it", "Author": "Will", "ReviewID": "R2KXK1GVJYBBJI", "Overall": "4.0", "Content": "Recommend this. So far no issues. Bought it for my daughter who is in school. No complaints after 3 months. Easy to setup. Lightweight and compact.", "Date": "March 1, 2014"}, {"Title": "Not bad for a budget laptop", "Author": "Joe Skrote \"Joe Skrote\"", "ReviewID": "R1H5EN1C1FVQWZ", "Overall": "4.0", "Content": "Picked this up for $325 at Office Max to replace my old \"couchbook,\" a five year old Acer Aspire 1410 that I still love, but is showing subtle signs that it might fail soon. Like a lot of reviewers on Amazon and elsewhere the dual-core, 1GHz processor was a concern, as was Windows 8. But there just aren't that many options at this size anymore, and using a tablet on the couch was just not acceptable for obvious ergonomic reasons. So I decided to give this one a try.I followed the advice of several reviewers and did a custom installation of W8, which allows you to bypass all of the little Windows \"helpers\" that sit in the background, degrading performance. I also ordered 8 GB of RAM from Crucial and installed it.Then I decided to downgrade to Windows 7. The drivers are all available (although it took some searching), but W7 slowed the computer considerably, and the 130 or so security updates I had to install dragged down performance even more. So, using the recovery disks I made, I went back to W8.The main purpose of this computer is to sit by me on the couch, where I use it to dig deeper into topics I see on TV, send and read e-mail and follow the stock market and English Premier League soccer. For this I'm sure this HP will be fine for most people.The most demanding use for my \"couchbook\" is to hook it up via HDMI to a big-screen TV to watch streaming sports video, say from ESPN3 or NBC Sports Extra. This would be the acid test for AMD's entry level processor. A live tennis match on ESPN looked good, with no buffering and maybe some barely perceptible frame skipping. And this was with a wireless-G connection (not the faster N).Switching to a soccer match replay on ESPN and monitoring the CPU with Task Manager, I was pleasantly surprised. After initially maxing out at 100% for a few seconds it finally settled down to between 50 and 60%, with an occasional spike into the low 80s. Again, absolutely no buffering and no perceptible frame skipping. For me that's perfectly acceptable since I'm usually not multitasking in this use, but it looks like there's enough headroom to open a web page or two. I don't have Netflix so streaming a movie from there may give you different results.The unit looks and feels solid, even the silver exterior (silver plastic usually screams \"CHEAP\" to me). But the flat, hard, chicklet-style keyboard reminds me of my first PC, a Radio Shack Color Computer (the keyboard on the CoCo could be replaced, which I did. Am I giving away my age?)Picture quality is good, though not as bright as other screens I've seen (like my Acer). But it has decent contrast, so I wouldn't call it dull. Audio through the HP's speakers is a little tinny, but I've heard much worse elsewhere.To be honest I haven't messed with the W8 tiles and touchscreen very much, and don't intend to. Apps accessed with the tiles seem to open slowly, but working on the traditional desktop seems fast enough. I suppose the new features are nice options to have and I may use them more as time goes on. Despite all the bad press W8 is not that hard to learn.For about $20 more there's an HP with a quad-core processor, but a smaller hard drive (320 vs. 500GB). I think battery time may be lower as well, due to the bigger processor. I've got a week to return this one if I want to, but at this point I don't think I will _ it does everything I need it to do.As a budget \"couchbook\" this little laptop is well-judged (as the Brits like to say). With the relatively small processor it's not what you'd want for advanced gaming or video editing, but for me it streams big screen video very well. And for most people that should be enough.UPDATE: Finally returned this laptop in favor of a quad-core HP for only a few dollars more. But the new laptop crashes constantly due to a bad video driver which can't be deactivated or updated (yet).", "Date": "February 25, 2014"}, {"Title": "I thought it was going to be better", "Author": "Frank", "ReviewID": "R2MR1R6RBIRRJR", "Overall": "3.0", "Content": "I bought this to use it in my psychology internship and it does work but this is slow as hell, I get desperate trying to open a program and it is the same with the internet. If you don't have patience (just like me) don't get into this. At least I can say that at the end it gets the job done (but way at the end).", "Date": "February 24, 2014"}, {"Title": "SO SLOW AS To BE UNUSABLE", "Author": "C. Wilson \"Thai massage practitioner\"", "ReviewID": "R21HNJWJFDWKXJ", "Overall": "1.0", "Content": "It takes FOREVER to load any page and even a dial-up connection would be faster than this piece of garbage. It is literally so slow it is not even usable. It is new and only two months old and I've only been able to use it twice without giving up and going to my old Mac desktop.GARBAGE GARBAGE SLOW SLOW SLOW GARBAGE. If you are looking for a laptop to make your life more flexible and easier, DO NOT BUY THIS ONE", "Date": "February 17, 2014"}, {"Title": "Slow, slow, and slow", "Author": "michael to", "ReviewID": "R2PX1TQ0D906B8", "Overall": "1.0", "Content": "That sums it up with this computer.  It's not very responsive and slow to process.  I would not ever recommend anyone to buy this laptop.  Asus is much better.", "Date": "February 14, 2014"}, {"Title": "Great", "Author": "RUTH E. HENNE", "ReviewID": "R1UFQ6WLTODDN6", "Overall": "5.0", "Content": "This is the greatest laptop ever, even being remanufactured I sur couldn't tell it. No scratches or anything, it is just like new. It had me online with one click.", "Date": "February 12, 2014"}, {"Title": "5 stars", "Author": "Daniel_23", "ReviewID": "RUWWT7UTOHM7C", "Overall": "5.0", "Content": "I use this laptop everyday because I needed it for work and to go to the university. The price point is low enough to compete with other tech out there and if you need a tool for work this is the way to go. I don't think anybody who buys this laptop is expecting great performance because it is not gonna deliver. The battery life is good (+/- 5 hours), the touch screen is great but not my style, windows 8.1 is a must download update, it's thin enough, light enough and the size is also good enough.I know it doesn't sound like much for a 5 star review, but you should consider that I'm pretty aware of what I bought and still think the product I got for the price I paid is completely worth it!", "Date": "February 7, 2014"}, {"Title": "Nice after a few months", "Author": "UpstateSC", "ReviewID": "R37K65SZVQVUVF", "Overall": "4.0", "Content": "It does everything I need in a modest size package.  I keep forgetting about the touchscreen.  Keyboard is OK sized.Battery life, OK.", "Date": "February 7, 2014"}, {"Title": "Poor quality, died in 3 months", "Author": "AA1971", "ReviewID": "RZM3LVJXSVEEF", "Overall": "1.0", "Content": "We bought this computer for our very responsible daughter to use at school. While at first it seemed easy to use etc, within a month it began to have problems with wavy lines on the screen. At first if you reboot the computer it would then work fine. 3 months in it pretty much died. There are wavy lines and poor color. Apparently this problem is not covered by the warranty so we are simply out our $400. I would not recommend this laptop if you ever plan to bring it anywhere.", "Date": "January 27, 2014"}, {"Title": "HP Pavilion Touchsmart", "Author": "Wazani Zulu", "ReviewID": "R5TJP67PVYH41", "Overall": "4.0", "Content": "Its a perfect package, it only misses Bluetooth i guess.I'm liking every bit of it otherwise. windows8 now makes sense", "Date": "January 2, 2014"}, {"Title": "notebook-good, amazon, grrrr", "Author": "fierfaerie", "ReviewID": "R1U2S0ISXCVM1O", "Overall": "5.0", "Content": "I love the notebook its just the right size to fit into my coach backpack.  however, amazon had it for $100 more than od and they were really not very good about the customer service this time, forcing me to ship it bac and pay for it out of my own pocket after they promised to prepay the label.", "Date": "December 3, 2013"}, {"Title": "1 week old and it died", "Author": "David Beardsley", "ReviewID": "R3FL8OJZV4SM6C", "Overall": "1.0", "Content": "1 week old and the video does not work.windows 8 is horrible, will not buy another HP product after this", "Date": "December 2, 2013"}, {"Title": "real keyboard with touchscreen", "Author": "birchlight", "ReviewID": "R2BXVIANJRUXRY", "Overall": "4.0", "Content": "The little computer is great. after having a little reading pad and being frustrated with its limitation and touchscreen of varying sensitivity I am enjoying the complete function and versatility of the Touchsmart.The touch screen combined with the keyboard is the best way for me to interface with todays computer world.  I am not a fan of the Windows 8 or any of the windows systems so am annoyed by it being a NOT MAC. But that aside it is a light weight fully capable little computer with touch screen addition.", "Date": "December 21, 2013"}, {"Title": "Nice but upgrade to 8 gig", "Author": "Lea C.", "ReviewID": "R1LOEAEZ2N6PJP", "Overall": "4.0", "Content": "It is a good product so far. I only ordered the 4 gig so it is not the fastest. But for the money it is solid. Spend a few extra bucks and get the 8 gig.", "Date": "December 10, 2013"}, {"Title": "Another nice computer from HP", "Author": "Daniel Craft", "ReviewID": "RLS3YZ4JRH6AH", "Overall": "4.0", "Content": "Touch screen works great. Internet is plenty fastNice small computer. Would recommend it to anybody.Nice screen viewing quality", "Date": "December 6, 2013"}, {"Title": "Dont buy at any cost", "Author": "muhand", "ReviewID": "RIN4IB9O01YZ6", "Overall": "1.0", "Content": "I got the horrible machine for around $470 at the time I thought it would be portable long battery life and sufficient for browsing and docsBut quit frankly doesn't so even that its lagging like there's no tomorrow now I would not buy it even for $200 frankly.My advice is to avoid invest little more and get a more decent machine don't be fooled by touch screen coz its useless", "Date": "December 26, 2013"}, {"Title": "The slowest computer I have ever owned!!!", "Author": "DW", "ReviewID": "R1EO76QVXI5D2O", "Overall": "2.0", "Content": "DO NOT BUY THIS NOTEBOOK!!! It is a piece of junk, it is the slowest computer since my first computer in the late 80's.  This was my first and last HP computer.", "Date": "November 15, 2013"}, {"Title": "Very nice!", "Author": "Gabriel Illidge", "ReviewID": "R3DBWTX4XN0Z8D", "Overall": "5.0", "Content": "Very nice! Not too small and not too big. It's just the right size and very easy to handle. I use it for my home and work. I am very pleased! Thank you", "Date": "January 12, 2014"}, {"Title": "replaced same type that had windows 7 but the hinge broke so cannot travel with it......", "Author": "H. Johns", "ReviewID": "R33E0RE9K9B1V5", "Overall": "4.0", "Content": "wish it had windows 7, not 8.  love the size. pretty happy with it.  but i do not like the OS", "Date": "January 2, 2014"}, {"Title": "LOL!", "Author": "Colin", "ReviewID": "R15OE3DNXHTUXF", "Overall": "2.0", "Content": "I just got this laptop today for $270 from Office Depot. I am returning it tomorrow.What a piece of junk! I had no idea the processor was so bad. I told my brother, a computer guy, about the processor, and he couldn't believe that people still made laptops with a 1Ghz processor lol.DO NOT GET THIS LAPTOP. I don't know who these people are that have given it four or five star reviews.Anyway the laptop is super, super slow. It never responds to anything instantaneously. It's always a waiting game. It can't even keep up with your typing, it's that laggy. The audio quality is horrendous. It's weigh too heavy for its compact size. The touchpad is frustrating and uncomfortable and rugged.This laptop is so bad that I just laugh. And I cry. I cry for the ignorant people who don't know any better and stick with this laptop thinking it's actually somehow decent. You people will always be in my heart. I won't forget about you. But you, YOU, the person reading this review. Perhaps I can save you. Run away. PLEASE. These five star reviewers have lost their mind. And the websites that you may find that give it 3 or 3.5 star reviews can't give bad reviews. They know it sucks, but they're tightlipped. You have to find people like me to honestly know if this laptop is a good buy or not (WHICH IT'S NOT).Thank you for your time!!P.S. This is a one star laptop, but I gave it two stars so people will treat my review with respect. People tend to disregard one star reviews. So basically what I'm saying is that there's NOTHING to like about this laptop.", "Date": "November 7, 2013"}, {"Title": "too small", "Author": "onlikepopcorn", "ReviewID": "R3IY1KTV9YGCN6", "Overall": "3.0", "Content": "so much for being easy to use. Windows 8 is frustrating and impossible to navigate, the screen is far too small to read, even with 20/20 vision, and the keys are too small to type comfortablly. This is OK for a kid, but probably not very good for their eyes. It's not a bad little computer, it's just a very little computer.", "Date": "January 8, 2014"}, {"Title": "Another in a long line of worthless HP touchscreens.", "Author": "Albert White", "ReviewID": "R2SS7MA5MS2KVY", "Overall": "1.0", "Content": "Complete garbage. Anyone who has really owned an HP laptop will tell you, HP should not be allowed to sell laptops. Add in that fuster cluck that is Windows 8 and you have something that will make you long for the days of Windows 95 and Gateway computers. This thing has 4GB of ram and you can get better performance out of a 1GB acer netbook.", "Date": "November 20, 2013"}, {"Title": "Cheap touching screen laptop but not best", "Author": "Tim", "ReviewID": "R1JNAXDBFQQAYC", "Overall": "3.0", "Content": "This is a cheap touch screen laptop. With 11\" screen display, this reduce the weight. But the graphic card is not necsessary because with small screen, you should not need as max resolution. The disadvantage here is the processor. This machine has AMD A-Series Dual-Core A4-1250 1.0 GHz (1 MB Cache) ~ I need a faster ~ so i choose Asus as my best demand. SeeB00BKRMMUS", "Date": "October 29, 2013"}, {"Title": "Only 1 aspect that i would change", "Author": "shelbygranny", "ReviewID": "RU3OJAC8SAK80", "Overall": "4.0", "Content": "The only disappointment is that the system is not the best for gaming.  I like to match three and find the experience frustrating due to unstable results with touch and also with mouse.", "Date": "November 1, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00E3KQWIC"}}