{"Reviews": [{"Title": "Exactly the right features for my needs", "Author": "Donald G. Verbocy", "ReviewID": "R3SJTDUO12VDX4", "Overall": "5.0", "Content": "I have to say that I have a problem with this computer.  I want to be on it all the time.  It is way better than my previous laptop whose hard drive died.  (A cautionary tale to remind you to back up your stuff.)  I will use this computer to process photographs (amateur), so I didn't want a shiny touchscreen.  This computer has the anti-glare, non-touch screen.  The screen doesn't act as a mirror for everything around it.  Screen resolution of 1920 x 1080 makes a difference when looking at photos I have taken.I have been asked by my church to produce the parish directory and tomorrow will download Adobe InDesign from the church's copy of this professional design program.  Producing the directory should give the computer a workout since I have already taken large file photos of the congregation and will need to copy and paste them into this program.  We are going on vacation at the end of this week and I want to take some RAW images with my camera to process on the computer.  I may come up with an addition to this review after doing some things that the computer is really designed for.  As of this writing I have only had the computer for 11 days.It is early morning, and the light is dim so I am using the lighted keyboard instead of an overhead light.  It works great.  Another feature I didn't know if I'd use is the fingerprint reader.  It remembers all the passwords and usernames that I need and gets me into these sites by swiping my finger over the reader.  I logged onto my Amazon account this way to write this review.  So it's a great feature, too.Watch for computers that don't have an optical drive.  When I was shopping for a computer, this seemed to be the norm.  This computer has a built-in Blu-ray Player and DVD burner.My wife and I travel in an RV.  We could watch TV shows on this computer if we wanted to, but it also has an HDMI output.  We haven't tried it yet, but I am told we can connect the computer to our flat screen TV and play the show on the big TV.There is nothing wrong with Windows 8.  It is different from Windows 7, but it is easy to get used to.  I like it just fine.", "Date": "November 17, 2013"}, {"Title": "HP is best bang for the buck.", "Author": "PhotogCGJ", "ReviewID": "R14DK1ZSOWCZPW", "Overall": "5.0", "Content": "Needed a power replacement for an older laptop and this was just the ticket, high resolution screen, dedicated graphics card, loads of RAM, Quad-Core Intel and dual hard drives.  Dropped a 750Gig Samsung EVO SSD in this first thing and it boots in less than 8 seconds!  MacBook SmakBook, my Studio manager wants to replace his MacBook Pro with this!  LOLExcellent Choice for great price.", "Date": "December 28, 2013"}, {"Title": "fast and light", "Author": "Amazon Customer", "ReviewID": "R2183ZN54GEGJM", "Overall": "4.0", "Content": "I wish this had a non-matte/anti-glare screen like they used to have. And that the touchpad was centered to the machine and not the 10key layout.Those two things aside this was a sweet little machine and a great addition to my equipment. I'm a videographer so I often have programs for movie making, conversion and photo editing open and working at the same time. iTunes or Netflix is usually running too, so its a lot! but the processor is fast and it hasnt crashed or faltered once. Very happy so far.", "Date": "October 13, 2013"}, {"Title": "Great laptop - very fast", "Author": "-JB- \"MonkeyBoy\"", "ReviewID": "R33XTQBXONC8IG", "Overall": "5.0", "Content": "I'm a software developer and data engineer. I needed to cut down the compile times of a very large project I'm working on. I did 2 things that made this an amazing laptop. #1 I replaced the hard drive with a 512mb SSD drive. #2 I opted to upgrade the 4th gen Intel cpu to 3.7 GHz. It's wicked fast. It's quiet. It's great on battery life. The software shipped with the product installed by HP is not annoying like Dell's software. The screen is beautiful. The beats audio sound system is great. The graphics card runs my 2 monitor setup perfect and is snappy. Whatever cpu you choose, just make sure it's the 4th generation (I'm pretty sure all HP Envy's at the moment are).It's light-weight and easy to carry. Bonus: when I close the laptop it cuts power to my USP Laptop cooling pad.I just love it. It's saving me about 1 hour of productivity a day.", "Date": "September 20, 2013"}, {"Title": "5 months in and I'm loving it", "Author": "C. Johnson", "ReviewID": "R2MW9LFNTBP49Y", "Overall": "4.0", "Content": "So far my envy is everything I hoped for and more minus the sad sad sad battery life, hence the minus of one star.  The battery drains very quickly.  Having all this power and fast processing with a sucky battery life doesn't really make sense to me.  Despite my issues with the battery I really love my lap top.  Windows 8 hasn't really bothered me although I had to adjust to the new layout.  So far I have had no issues but I will update once I start doing more complicated things with the computer.  Also the people at Eluktronics are awesome.  I have contacted them several time with questions and they were very helpful and professional.", "Date": "April 7, 2014"}, {"Title": "Good value for Money unit.", "Author": "Brigadier \"RussDiehl\"", "ReviewID": "R2M0DBO2ZVHJU7", "Overall": "5.0", "Content": "So far so good... Price was best in the Market ... The Unit is terrific. Replaced a Gateway bought in 2009 for $1200. This unit a clear top of the line product with full add-ons,.... was a real value.", "Date": "December 15, 2013"}, {"Title": "Great machine!", "Author": "jpliz", "ReviewID": "R5GDE9WU6R2OD", "Overall": "5.0", "Content": "It's a great laptop. I bought It to watch movies and Tv Shows in High quality and it works wonderfully! The keyborad and design are great too. So far no complaints whatsoever!", "Date": "December 8, 2013"}, {"Title": "Good but I found one issue", "Author": "Vohmeanin Egor", "ReviewID": "R22UP3RRWB9PJY", "Overall": "4.0", "Content": "Got this notebook for a month about. In general it is very cool, fast, beatiful and impressive, BUT yesterday WEB-camera stopped working. I had to read a lot of forums about resolving this issue. Half people says that it's software bug but another one says that it is hardware ill. I tried only one option which look more preferable: Turn off PC - un-plug battery - push power button for 15 seconds - put battery back and turn on PC -> issue resolved. I very hope that it will not happen again - because I feel myself very unpleased when you spend >1200$ and WEBcamera become unavailable.Hope this will help somebody.4 stars", "Date": "October 20, 2013"}, {"Title": "HP not what it used to be.", "Author": "Scott Bell", "ReviewID": "R1Z6Q4A27VO58R", "Overall": "2.0", "Content": "Received this beautiful laptop but it had one major defect...the keyboard.  The left side was raised up and the right side was flat.  When typing with two hands it had an off feeling.  This is not the first time I have had this issue with HP laptops in the last year.  Returned laptop to Amazon.  Very disappointed.", "Date": "September 20, 2013"}, {"Title": "Very good", "Author": "Mohammad Arab", "ReviewID": "R2LCKCDGHI290L", "Overall": "4.0", "Content": "The laptop is amazingI noticed some bad things but it's not very badWhen playing games, like BF4, there's a noticeable heatAlso the keyboard in the left side has a small flexEvery thing else is awesome and working pretty good", "Date": "March 25, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00E395L7Q"}}