{"Reviews": [{"Title": "THIS LAPTOP IS THE S***!", "Author": "Zak \"Diva\"", "ReviewID": "RGMHRK2YYM3A0", "Overall": "5.0", "Content": "This laptop is one of the best laptops I've owned by far. It's amazing for gaming and pretty much anything at the price I bought it at ($598).. The sound on this laptop is amazing, boost with headphones. It's a beast, why spend 1,000 dollars on a gaming computer when you get can get this a low price and pretty much have the same performance.. I don't have one complaint about this laptop and I've been using it for two weeks. It stays cool and the screen is the perfect size battery life is very good. I recommend getting this laptop!", "Date": "September 21, 2013"}, {"Title": "The best desktop replacment for its price (and above), period.", "Author": "Tsahi Livnoni", "ReviewID": "R16HCMNHCPW624", "Overall": "5.0", "Content": "A quad core CPU leading GPU performance, in the future the HD may be replaced with SSD storage turbo charging the already good performance prolonging its life for 5-7 years of good performance.A massage to the kids at heart: this laptop can handle all new games, not a trivial capability for a laptop without a discrete graphic card.", "Date": "October 19, 2013"}, {"Title": "Low Cost Functional Laptop that can run most games", "Author": "Barry L. Beal", "ReviewID": "RLZ8B8K4Z46MF", "Overall": "5.0", "Content": "Good quality laptop for light gaming and general purpose use.  AMD A10 GPU makes running games possible on this low cost laptop - can't run all the latest graphics intensive games like Crisis or Metro Light at the highest resolution and with all the anti-aliasing features turned on but you can run most games at moderate resolution and fairly high refresh rates.  if you have to do that you have to pay twice or three times what this laptop costs and you probably want the ability to run games at 1080p (1920 horizontal x 1024 verticals resolution) instead of 1600x900 resolution that this laptop supports.  You get what you pay for - AMD APU is cheaper than using a Intel version and Intel native graphics are fair less powerful than what the AMD delivers for the same or lower cost.  Intel powered CPU typically require add-on discrete graphics cards that increase the cost of the laptop.This HP is pretty well built - has enough memory and large enough hard drive memory to run Windows 8 (do the free update to 8.1 as soon as you buy this machine - much better operating system with additional features that didn't come with Windows 8).  Windows 8 does take some time to get used to but if you get one of the START Menu replacement apps you can skip right past the Metro Title Interface on log in to the more familiar desktop mode that you are used to with Windows 7, VISTA or XP.  Some of the Metro apps like the new Facebook app for Win 8.1 are pretty functional so jumping back to the Metro Interface is worthwhile but there is not a lot of great Metro interface style apps out yet.  Don't let the new look of Metro scare you aware from buying this laptop - Microsoft is forcing everyone to change by not selling any new operating system other than Windows 8 (still can get other versions from OEM's and retailers) but can't buy Win7 licenses from Microsoft directly any more.  Learning curve is not that bad especially if you only work in Desktop mode.Wireless Networking on the laptop (you can add a USB wireless networking adapter if you want but the onboard interface is fully functional) does not support the 5 Gigahertz frequency for the 803.11 N  networking but the speed of the 2.4 Gigahertz 803.11 n wireless network is sufficient to do most anything you might want to do including playing online games as long as you are close enough to make a good Wireless N connection to your router.  Keyboard and trackpad are decent - back lighting for the keyboard would been nice if you use the laptop in bed or otherwise in situations where there is not a lot of light but that is not included.  Viewing angle on the LCD screen is somewhat limited and the highly reflective screen while great for good color presentation makes use of the laptop in certain conditions awkward at times but that is part of the \"you get what you pay for\".  A higher resolution LCD screen - better quality screen - screen with matte non-reflective coating are all things you can get but you have to pay for.  HP has done decent job in making something that is low cost and functional but there are tradeoffs to keep the cost low you should be aware of.Laptop comes with 1 year warranty - HP Support assistant does pretty good job of checking for and automatically installing updates to drivers for the laptop (and BIOS updates).  You can use it to check for software or hardware technical support - it shows you conveniently the model and serial number of the laptop and the warranty start/end dates.", "Date": "November 26, 2013"}, {"Title": "What a buy!!", "Author": "Timothy L. Slavin", "ReviewID": "R1ZLK4T5IMP57P", "Overall": "5.0", "Content": "I still cannot believe the price I got this for..trust me, the price was so so low, it will make everyone envious.  The Windows Experience index is 5.9..primarily that's due to the hard drive.  All of the other ratings were great..the processor and memory are rated at 7.1 and 7.2..7.2 for the memory.  3D graphics are at a 6.6 and Desktop graphics is 6. something(I don't bother looking at that).  Anyway, this was less than $400 when I purchased it..CRAZY AWESOME!!  I bought this primarily for the screen and memory..both an upgrade from my previous laptop, which was an AMD A10-4500m  tHE BENCHMARKS are similar..but the screen is nice and the keyboard is pleasant to type on.  It always amuses me that people spend 900-1200 for an I7 or even I5 pc, and yet those computers STILL have integrate graphics which cannot even considered gameworthy.  This is totally gameworhy..100% of games listed on the Futuremark website can be played on at least the  High setting.  71% of those games can be maxxed out!!  Not too shabby at $400!! PLAY ON!!", "Date": "October 9, 2013"}, {"Title": "NICE!", "Author": "Mei Lun Mui", "ReviewID": "RGJ2ENL2A1OFB", "Overall": "5.0", "Content": "Got it for 400$ refurbish from secondipity i think.  Like the laptop a lot, but like the rest of the world 'HATE WINDOWS 8'.Microsoft need to get a grip and stop coming out with SH*TTY windows every other version.Overall, love computer for price.", "Date": "February 8, 2014"}, {"Title": "Works Great, has a larger monitor and 10 key", "Author": "Brian Horne \"byhorne\"", "ReviewID": "R1SLDWHB8MMBGF", "Overall": "5.0", "Content": "I'm in accounting and i need a 10-key and I hate small screens. This is fast, runs all my tax and accounting programs, I attach a separate monitor at the office and jump around a lot muti-tasking. This does a great job and I'd buy it again if I needed a second one...Well, my daughter needed one for school. She's at college in accounting, go figure, and this replaced her 14\". She loves it an would never go back.", "Date": "January 14, 2014"}, {"Title": "Awesome", "Author": "Sarah", "ReviewID": "R1S7YQVB33T85S", "Overall": "4.0", "Content": "Amazing all i can say, wasn't a huge fan of windows 8 but after some getting used to ,not too bad. Also i am a avid gamer a use steam for a lot of my games, really good graphics and no lagging :)", "Date": "November 25, 2013"}, {"Title": "No complaints!", "Author": "Casey", "ReviewID": "RYCCPNTUSDALV", "Overall": "5.0", "Content": "Pros:I'm a gamer as well as a student and this meets all of my needs. I can play LoL, WoW, and all my other games with no problem. It won't be the BEST graphics but certainly exceeded my expectations. The display is a perfect size. The weight is just right. Lots of USB ports, HDMI port, built-in webcam, and a number pad. Battery life is strong. It lasts about 2-4 hours depending on what I'm doing. Sleek design and it's an HP and HP products have yet to disappoint me *cough* DELL *cough*Cons:The mouse comes as a bit confusing when you first get it. Lots of extra features are added in that I wasn't used to but after configuring it in control panel, it's normal now.More prone to carpel tunnel -- I am on this thing too much -- okay, but I really ought to install some wrist padding because after a few hours I notice my wrists not feeling so good. But I also have weak wrists so it could be me entirely.Windows 8 -- I HATE WINDOWS 8. I like Windows 7 so much more. But you can easily downgrade -- I just haven't gotten around to it yet.Basically, after having an Acer and multiple Dell computers I must admit this is the best laptop I've had to date.", "Date": "April 10, 2014"}, {"Title": "Great Laptop", "Author": "Krystal", "ReviewID": "R2JV9RFTN0PNER", "Overall": "5.0", "Content": "I bought this last week and it's a great buy!  I researched for weeks leading up to buying this and could not be more happier with my purchase.I've had this laptop now for 2 months and am still very very happy.. I got a refurbished laptop and it came like new.  For the money you are not going to find a better laptop!", "Date": "February 16, 2014"}, {"Title": "Great Job as usual", "Author": "Brendan Quinn", "ReviewID": "R10ZVKILB4AJYZ", "Overall": "5.0", "Content": "Ordered it for my son on Christmas We like HP a lot this one has all the latest features and a 17 inch screen.Shipped very quick Through Amazon. WE love Amazon", "Date": "January 18, 2014"}, {"Title": "laptop", "Author": "lilly brown", "ReviewID": "R259DNRTNUAD5G", "Overall": "5.0", "Content": "On time, great condition as described. Would recommend that shoppers buy product/ items from this individual. Laptop Works well with no problems.", "Date": "June 1, 2014"}, {"Title": "Exactly as Billed", "Author": "Linda Power", "ReviewID": "R3NAWN0TYIOH1O", "Overall": "5.0", "Content": "This computer is everything advertised and more.  I had needed to replace a 2006 HP at 15\".  I am an older person and require not only this size display, but very user friendly operating system.  There are not complete libraries accompanying computer purchases in this day, so it is so very important that instructions are simple, clear, and concise. I would do this again in a heartbeat.", "Date": "May 6, 2014"}, {"Title": "This is a great laptop", "Author": "Thomas E. Dunlap Jr. \"ed dunlap\"", "ReviewID": "R2N632496BXJHL", "Overall": "5.0", "Content": "Didnt take 30 min to set it up-A very fast and stable laptop-The price was super great-I wouldnt want a better one-if one could be found-I checke all of them out before I bought this one and there wasnt any that could come up to this one", "Date": "March 11, 2014"}, {"Title": "Pretty good laptop..", "Author": "Amber Higley", "ReviewID": "R33BZ8C1NA7JA7", "Overall": "4.0", "Content": "So after about 3 weeks with this laptop, I have to say I'm pretty impressed.I didn't buy this laptop from amazon, I bought it from walmart for a cheap 500 bucks, couldn't believe the cost.This laptop does everything you need it to do perfectly besides heavy gaming.I've spent hours trying to configure pcsx2 on this laptop and can only run a handful of games. The amd radeon hd 8650g simply just isn't good enough for it.. Although kingdom hearts and kingdom hearts 2 run pretty good on it, you can get a good 55-60 fps although I didn't fully test it. It does however run nulldc and demu flawlessly and of course your basic playstation and n64 emulators in max settings. Only tried ssf4 ae on steam for a stand alone pc game and it runs like butter. Will test out more games like Skyrim and battlefield 3 when I have more time.I'm poor right now, so I can't buy the parts to build my desktop.This laptop however more than satisfies my needs.", "Date": "March 7, 2014"}, {"Title": "The hard seems fine but window 8 and pad are not fine", "Author": "Kent A Salmond", "ReviewID": "RMXBI7NTQWH2V", "Overall": "4.0", "Content": "I have a lot of problems with windows 8 -- First is compatibility, I have office 2003 and it will not install and operate without errors , yet I have had no problem with vista,  also Visual studio 2005 will not compatible Likewise with SQL 2005.  etc  These are micro soft products and they are not upward compatible with window 8.  The pad using window 8 is almost unusable, it takes me almost 30 % more time to do things because of pad than it did with vista.  I finally had to buy a mouse so I can my work done.  What even more irritating is if you lay the system on a table and you place you palm of your hand on the pad it can do lots of things like enlarge or make smaller, move or scroll, it drive you nuts.  I wish there  was button that allow you to hold for the advance features, instead of getting them all the time when you don't want them.  Out side the learn curve you face when you first start in windows 8 everything else was OK", "Date": "March 4, 2014"}, {"Title": "Amazing laptop", "Author": "Zach", "ReviewID": "R1SJ4PDUYE08GP", "Overall": "5.0", "Content": "I've built desktops for gaming in my late teens, and didn't have faith in laptop gaming, unless you have a grand or so to spend. I picked this thing up for $500 at walmart, thought the specs were great but didn't expect to be gaming, figured the gpu wouldn't be strong enough. Boy was I wrong. I've played Battlefield Bad Company 2, CS GO, Left for Dead 1-2 and they all run buttery smooth on high settings. I hoghly recommend this laptop for every day activities, as well as moderate gaming. Just male sure to keep the laptop cool, overheating is all I see being a potential issue.", "Date": "March 4, 2014"}, {"Title": "Pleased.", "Author": "Richard E. Kaiser", "ReviewID": "RXPI4MR8JPSKN", "Overall": "5.0", "Content": "Positive aspects of this laptop computer are:  screen display is excellent, resolution is precise, processors work as advertised, after doing a great deal of research prior to purchasing this particular laptop, there was still concern that the unit might be less that hoped.  However, after using the unit it works as needed for word processing, building presentations, gaming, browsing, and the other various applications.  Windows 8 is a dramatic change but not insurmountable, upgrading to windows 8.1 is beneficial.  The keyboard takes some getting used to due to the offset required by the number pad, but having the number pad was a must, for me.  The battery time is about what was expected, and a decision will soon be made as to whether an additional battery must be purchased, given the computer is used away from outlets the majority of the time.  Another positive is the price.  Immediately after purchasing the computer for less that $500, the online price increased.  If there are any negatives found for this unit, they'll be added to my review subsequently, but at this point it appears to be exactly what was wanted and needed.", "Date": "December 3, 2013"}, {"Title": "All I wanted was a tabletop TV", "Author": "Mr. Average \"average guy\"", "ReviewID": "R26W07OVPN9818", "Overall": "3.0", "Content": "I've eliminated cable TV from my world, and expense sheet.I wanted a computer to watch baseball while working, and the morning news with my coffee.I should say I'm not sure if it is the computer or Windows 8 that I don't like.Computer seems slow, not sure I chose the best processing option.Video is great, sound good too.I'm not sure if I'd repeat this purchase.", "Date": "May 25, 2014"}, {"Title": "PIG IN A POKE", "Author": "K. Anthony", "ReviewID": "R3TUOQXN9XGZ3U", "Overall": "3.0", "Content": "If you like Windows 8 you might excuse the software issues I had.  The laptop is very fast but, Windows 8 had issues and I was not happy with the 3rd party seller for Amazon.  Up Front, I would advise anyone purchasing a laptop use Amazon \"PRIME\" so you don't have to go through what I had to.  Good news, I took it to a licensed/certified Computer repair and they found out what the issue was with laptop cost $75.00 dollars.  Amazon was good enough to credit the $75 after a host of issues with 3rd party seller who was convinced he was smartest person on earth. Long story short.  DO NOT buy laptops from 3rd party Amazon sellers.  Buy from Amazon Prime and save yourself a lot of trouble.  Don't for your own sake, buy from 3rd party seller, BIG TROUBLE.....Buy only from Amazon Prime.........", "Date": "December 11, 2013"}, {"Title": "Good seller", "Author": "Gene Galat", "ReviewID": "R3VTYYJBSP49LA", "Overall": "4.0", "Content": "The computer is great but windows 8 is JUNK! This is the last review I will ever do, so enjoy it while you can.", "Date": "December 31, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00EP09B4M"}}