{"Reviews": [{"Title": "As expected, and designed for 8.", "Author": "Jem \"Aeterna tenebris abyssi stupefiat et obd...", "ReviewID": "R1HNT3W5H3LDO4", "Overall": "4.0", "Content": "This PC delivers the experience expected by the Pavilion family of laptops. I realized before buying that this model has no optical drive. What I didn't research, however, was how compatible with legacy operating systems it would be, and there's only one way to find that out. I spend over 11 hours straight the day it arrived to find the AMD ATI Radeon HD drivers. To this day, I'm still no exactly sure how I managed to find them and get them to work.Otherwise, I really enjoy this model. It's fast, handles external displays well, and I love the fast USB3. The model even contains the new Bluetooth protocol. The slim design still allows for goo air flow, and it doesn't get all that hot. It has decent battery life, comparable to the thicker models, and a nice screen.Physical upgrades are challenging, as they tend to be with slimmed down PCs. While there are two memory slots, getting access to them to increase memory requires removing the keyboard, top plate and entire motherboard, as there are no access panels on the other side.", "Date": "December 8, 2013"}, {"Title": "A interesting notebook", "Author": "joshua carmichael", "ReviewID": "R1OXT45R1Y8CGK", "Overall": "4.0", "Content": "This laptop here the HP Pavillion Sleekbook is a rather interesting one. On the left side of it it has a usb 2.0 port and a jack in for headphones. On the right it has 2 usb 3.0 ports, a SD card reader, the charger port for your laptop, an ethernet port and a HDMI output meaning you can project the screen of your laptop into stuff like an HDMI Television. But for those who thought they could use the HDMI on the side to hook and play their games like a ps3 or xbox, sorry I tried and it will not work like that, you will need to still buy a capture card for type of thing. It also does not come with a DVD/CD writer/driver so you would need to order a portable one like for example a Samsung portable DVD drive. Also it has a built in mic and a webcam so that is also a plus.This laptop comes with the AMD A8 quad core processor and with what I experienced so far it does a pretty good job with page loading, handling different programs at once and the like. It's video card is the AMD Raedon HD 7600G so its also at a pretty decent quality as well.  The battery life averages at about 3 to 3 and a half hours give or take while watching a movie or two. Can't say much more on that since I only tested on default energy settings unplugged and not it's power saver or high performance settings.Pros:It's able to handle multiple processes.Good ventilation so the processors dont get as hot.Is able to handle MMO's like Phantasy Star Online 2 with pretty good quality. I tested with level 4 graphics with 60fps and it does a pretty good job.Good sound quality, it gets really loud at 40 with headphones on so I don't see any need to turn it all the way up.The performance mostly based on optimizing from hardware rather than software. With the specs on this Windows 8 does seem to fare really decently from it.Cons:One of them would have to be the material casing. Feels like its cheap as when your opening up the laptop the screen feels like it could come apart from the hinges.Another one would have to be the touchpad for this. This may not be commonplace but as far as I experienced it would lock up at a random interval and would either go to the Metro UI start menu or just flat out redirect me to the Metro UI itself and would have to set it back to the desktop UI.The lack of a DVD/CD may be off putting for some. But if your able to shell out a few more for a portable usb one or are no longer interested in the medium it wont be that problematic for you.The Metro UI itself. Since this laptop is not a touch screen type you might not want to deal with it as much. And while yes there are ways to disable the Metro UI like the classic shell or the Skip Metro Suite, it does not really make it stop it completely. Like I said in a previous statement, its possible that while you set it to disable the features of the Metro UI the touchpad itself may glitch out on you and you either find yourself starting up one of the window 8 apps or are brought back to it's default interface. Small annoyance but nothing that offsetting.Overall it's a pretty decent laptop despite the small nuisances.", "Date": "January 6, 2014"}, {"Title": "Great Laptop", "Author": "Eric Z.", "ReviewID": "R2NS2Y21VZREW2", "Overall": "5.0", "Content": "I picked this laptop up at Walmart for $350 (What a Steal!). Its fast and has lots of cool features. This laptop did not have a DVD burner or disk drive, but I knew this before hand. ALWAYS DO YOUR RESEARCH! The speakers were fairly loud at 50%, I couldn't see a need for me to ever need to go to 100% volume, because it gets LOUD. I also like how slim it is. I would recommend this laptop to anyone!", "Date": "October 7, 2013"}, {"Title": "very good", "Author": "Edgar Roca", "ReviewID": "R8UGW65TCSTC9", "Overall": "4.0", "Content": "I like it , its almost like new , good shape , just for a few scrath on the top lid but its almost invisible , very good item", "Date": "April 18, 2014"}, {"Title": "Great for the price", "Author": "calvin burnette", "ReviewID": "R2CGJ6AD794NZ6", "Overall": "5.0", "Content": "Great computer for the price! I love how thin it is, it makes having to carry it around on my deployments a whole lot easier.", "Date": "March 18, 2014"}, {"Title": "Nice", "Author": "TNCounrty \"Mike\"", "ReviewID": "R1Z00PTPHDIUEA", "Overall": "4.0", "Content": "For the price, this is a great little machine.  There where a couple minor issues with this machine connecting  and recognizing my wireless printer otherwise I would have given this a 5 star.  Just NOTE:  if your looking to burn cd's or dvds on this machine... purchase an external burner..I do like the light weight, slim line this machine has...", "Date": "February 18, 2014"}, {"Title": "Buy it", "Author": "Nathan Barta", "ReviewID": "R2F1ZIBWEJK03U", "Overall": "5.0", "Content": "Amazing laptop, theres nothing else to say. An ABSOLUTE STEAL for this price. You will not regret it I promise", "Date": "January 7, 2014"}, {"Title": "excellent", "Author": "RENZO MURILLO", "ReviewID": "R21IJE1YVB6B26", "Overall": "5.0", "Content": "On product excellent and meets expectations, it was delivered on time and very good quality, practical and functional for my daily use and meets many needs", "Date": "December 8, 2013"}, {"Title": "Great laptop!", "Author": "Menzah L. Clay \"Haznem\"", "ReviewID": "RKQCCVSMZ2DG7", "Overall": "5.0", "Content": "Bought it for my husband this Christmas, and he LOVES it. It's extremely fast, sleek and lightweight. Windows 8 is great once you get used to it. All in all, great laptop!", "Date": "December 25, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00EYTDNCU"}}