{"Reviews": [{"Title": "What I expected", "Author": "Rick", "ReviewID": "RV8KPJ86K4OEY", "Overall": "4.0", "Content": "Very nice laptop. It's exactly what I was looking for from the I5 3230m. It handles multiple applications at the same time pretty smoothly. I have two other laptops on my network with similar chipsets(processors are i3 3110m/ i5 4200m) and this one seems be on par with my 4200m. Some features are sub par, but expected. Display is as indicated and with the anti-reflective screen there is always a distortion, but I really don't care about displays that much.. I can see good enough where hd is plenty. Really never understood peoples obsession with having the best displays.. there all pretty decent nowadays. Free-scrolling on the touchpad is kinda choppy. My concerns always lie in the performance area.. and this pc gets an A- in that department. I see a few bad reviews about this laptop out there, the best advice I can give you is to take a whole day and just UPDATE,UPDATE,UPDATE!.. DO NOT PASS  GO, DO NOT COLLECT $200!(monopoly reference). before you do your first search on this laptop update everything from windows to bios and chipset etc. I always do that to my pc's and usually don't have any problems. Bottom-Line.. the specs for the price is pretty much unbeatable.. great bargain.. even for a last generation processor(pretty powerful processor too)", "Date": "May 15, 2014"}, {"Title": "no good", "Author": "erfan-mamedkhanov zaur", "ReviewID": "R30M38VWKTJRYG", "Overall": "1.0", "Content": "after I bought the laptop with him there are different strangeness. all movies online and through fleshkarte began to slow down. not possible to see the film properly!! and most importantly, the screen became much darker and does not respond to the color settings.", "Date": "May 4, 2014"}, {"Title": "Great laptop for price", "Author": "Heidi B.", "ReviewID": "R5RVCL5HR0O5C", "Overall": "5.0", "Content": "Great machine...had to adjust to the way of thinking for Windows 8, other than that, just fine!  Like the pre-programmed tiles, so you can adjust them.", "Date": "March 10, 2014"}, {"Title": "Met Expectations", "Author": "Melvin Breshin", "ReviewID": "R3I045U80GUUX5", "Overall": "4.0", "Content": "Met ExpectationsLike the computer very much for my basic needs,Very fast and accurate.Only downside is confusing aspects of Windows 8I use the desktop version which I am used to.", "Date": "February 13, 2014"}, {"Title": "You have been warned, Do not waste your money", "Author": "D. Collins", "ReviewID": "RERVUY36D4W5S", "Overall": "2.0", "Content": "Price was very good and it came highly recommended from two independent sources.  Even though the processor is an i5 3rd Gen.  Still felt like it was a bit slower than I expected.  locked up on me shortly after I set it up.  I really hope this was a fluke because I want to like this computer.  Besides a horribly clumsy and unintuitive Windows 8 OS, computer itself seems decent.**UPDATE**After two months I've decided to change my review. This computer is HORRIBLE! It is slow, it locks up ALL the time and the battery life is lame. I would not recommend anyone waste their money on this piece of garbage.", "Date": "February 7, 2014"}, {"Title": "Brand new and a defective battery", "Author": "deran", "ReviewID": "R90MFXSYDO9RO", "Overall": "1.0", "Content": "Price may be good but beware. I got a brand new one (well one of the last batches made) and on day two of setting it up the battery stopped working. The laptop would work when plugged in but the battery would not charge and I started getting a warning that if the power was unplugged I would loose all of my work. I looked all over for a replacement battery, since I'm not afraid to take the covers off, but no one has one for sale. I went to the Samsung web site and it says that this laptop model is in \"support only\" mode. They offered to let me send it in as well with a 14-21 day turn around. They would not just ship me a new battery. IMHO ... it's junk.", "Date": "June 4, 2014"}, {"Title": "get it as described", "Author": "Joe", "ReviewID": "R1QBT9BE8CJRVP", "Overall": "5.0", "Content": "easy to use, fast. But I'm getting little problem with the Samsung store. It's a good laptop and I really love it", "Date": "April 8, 2014"}, {"Title": "horrible  computer would not reccommend", "Author": "kathy schill", "ReviewID": "R2WE4EA0Z0XEAF", "Overall": "1.0", "Content": "I have owned this computer three months and the screen jumps bad  would not recommend anyone buying this computer not worth it to have to send back to get fixed", "Date": "April 7, 2014"}, {"Title": "Good for the price- had a few hurdles with Trackpad not working when key is pressed", "Author": "its me", "ReviewID": "R1DQMWR1MEZLML", "Overall": "4.0", "Content": "OK my son got this for Xmas 2013- I bought the i5 instead of the i7 just to see if it could handle Skyrim (heavy graphics) before I paid the extra $$ for the i7.  The i5 plays Skyrim just fine, so pretty much anything else will be good to go (Minecraft, etc)BUT-  he gets on Minecraft for 1 second and says- \"I can't turn my head while running- this isnt going to work.\"and sure enough, this thing has some stupid setting where the trackpad auto-disables when a key is being pressed (you hold down W to run in Minecraft, but then use the trackpad at the same time while running)  ..so it basically screws up Minecraft and all similar games.Long story short, spent the entire Christmas day trying to fix this issue- there are NO adjustable settings for this in the touchpad settings/device mangler/ control panel, etcGoogled it into oblivion- nothing.Finally i just went to the Synaptics website (dont even bother with the Samsung site)  and downloaded what they had as the \"latest\" driver for the laptop model  (it was listed as Windows 7.. hmmm)I was hoping that a different driver would suddenly give me the \"palm check\" or \"smart sense  / touch check\"  options- as this is what is causing the trakpad to stop working when a key is pressed.I try to install that, got some error after a restart and basically, no new setting showed up.So now I'm ticked and going to just take the thing back.On a whime, I then went ahead and uninstalled the driver for the trakpad from device manager.It restarted, and for some miraculous reason, when it returned, you could hold a key down and the trakpad still worked.  Somehow it overrode or disabled this horrible and unadjustable \"feature\".Thanks for the options Samsung.Anyway, other than this, and a somewhat annoying loose/cheap rattle that the buttons on the trakpad make.. it seems to be working fine.Oh, did I mention that windows 8 sucks and is hugely irritating with all the screens on top of screens over your desktop that noone wants? (thats a whole other story, but not really samsung's fault.  Microsoft has officially jumped the shark..)Hope this helps somebody get past the trakpad hurdle..", "Date": "December 25, 2013"}, {"Title": "Bad Bad Bad Laptop", "Author": "Caleb K.", "ReviewID": "R3J6IM7V9U0JKK", "Overall": "1.0", "Content": "Disclaimer* may just be mine and a few other peoples, but I have read a review that was shockingly similar to my story. I Bought this in august 2013 and really liked the look, brushed beautiful metal, operated ok at first. games ran well. But windows crashed repeatedly. sent it in and laptop continually fails and windows has had to be re installed over 6 times and restored over 25 times. Currently running ubuntu which is awesome but i bought a windows running machine. I enjoy learning what is involved with linux but much prefer the simplicity involved with windows. Obviously that wont happen with this laptop though. as it is simply not functioning even after having the hard drive replaced by samsung the windows load would still crash every other reboot.Would not recommend to a friend. aesthetics are great cool looking but non functional.would recommend to any enemy i have.THIS GOES FOR ALL ATIV BOOKSSAMSUNG CUSTOMER SERVICE IS ATROCIOUS", "Date": "March 6, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00ERAIGI2"}}