{"Reviews": [{"Title": "A strong showing for a non-Apple Product!", "Author": "J. Chan", "ReviewID": "R4FO1XEEVRNKQ", "Overall": "5.0", "Content": "EDIT: Included some pointers below!  Also, if you have Samsung devices (such as AllShare on your Samsung TV), you can turn off auto-detection in your laptop by clicking the \"Show hidden icons\" button on the Taskbar and opening the dark grey fan/play icon looking button.  You can disable/enable communications as needed between devices and stop those pesky messages from popping up on your TV/device.As I sit down to write a review of this very machine, I ask myself -- \"Should I review this as a standalone device or should I compare it to other Windows offerings?\"Well, I decided I'll do both since I figure this is a great way to test out the keyboard also. As a standalone device, this blows away my previous HP Pavilion DV6 or something like that.My first impression:Boots up quick from shutdown (like 2 secs?) and on my initial install, since I was already a Win8.1 user, it managed to snag some things off my desktop automatically.Software side:Installing things on this machine is a breeze.  Put on Microsoft Office 2013 Professional on this baby in a few seconds.  Programs run immediately with very little downtime.  There is some bloatware but, after a bit of uninstalling, it's as minimal as I like it.Hardware side:Form factor is a huge improvement over my previous laptop, a HP Pavilion DV6 or something like that. The keys on the keyboard are spaced a bit further out than I'm used to but it's a non-issue since I type just as well.  Also the keys have the right amount of sensitivity, even my corner hits.  There's a satisfying but minimal thud with each key press and the keys can be depressed a fair bit.  Not a lot of extra noise; just enough to give you the feedback.  Some of the keys are very convenient -- I appreciate the use of FN key and the arrows keys.The screen is, as previously mentioned, gorgeous.  No issues with dead pixels or the like. I found no issue with the \"yellow tinge\" that some people are complaining about, though I did tweak it as soon as I could (please see the comments of this review for a complete step-by-step breakdown!).  I also switched off the adaptive brightness, opting to control it myself.  Also, despite being set at max resolution, I don't have any problem where things are too \"small.\"  It's the perfect size for me and what I would want with a notebook for this size.  I haven't used this as a touch screen because, honestly, I don't want to smudge up the screen.  This also has good viewing angles too.Battery is still up in the air for me.  I appreciate that Samsung limits the charge to 85% and I'll keep it that way.  I'm getting estimates of over eight hours, though I've only used this ultrabook minimally.Touchpad is great.  It was a bit sluggish for me so I upped the sensitivity.  Very good response and the left and right click do have dedicated areas on the bottom of the touchpad (despite no indication of such).Fans only kicked up once and that was when I was installing a number of things at the same time.  Even then, it was relatively quiet and did not exceed my TV's volume.  It did become a little warm on my lap but I would not to expect it to stay liquid cool under stress.Build quality feels solid.  My folks were surprised something so thin still had heft to it and there is no bending when I pick it up. It opens fairly easily with one hand and has a good \"set\" hinge range before it loosens to the 180 degree opening.Ultimately, I would recommend this device wholeheartedly to anyone.  As a Windows device, I would argue it's definitely what Intel had in mind and represents that other non-Apple manufacturers can create great products also.Previously, I was dead-set on the ASUS UX301LA-DH71T, which would arguably be the equivalent of this device.  Both devices are great and I can't justify strongly picking one over the other.  The ASUS offering is a bit faster but, for my uses, it meant relatively little since it would run a bit hotter, which I thought would be problematic in the long-term for these thin devices.  Ultimately, it boils down to aesthetics and costs.  If you feel that you can live waiting 0.5 secs longer for your PC to boot or load a program while saving around $200 with a slightly more future-proof screen, this is your choice.I have also tried the MacBook Air 2013 and thought of buying it because it was so affordable.  However, I'm glad I picked this one up instead. Though it costs more, the benefits are, in my eyes, worthwhile -- I have more storage, a better screen, a better CPU, and more software flexibility.", "Date": "December 3, 2013"}, {"Title": "A great ultrabook all round!", "Author": "Malay", "ReviewID": "RJM6RRPD451CR", "Overall": "4.0", "Content": "Just my two cents worth:This is definitely a great laptop, but like all laptops, there are pros and cons to consider. I'll go over the different aspects:1. Cost: this is a premium laptop and it certainly costs as much. You can find the same system specifications in other brands like for at least $300 cheaper.2. Battery Life: the battery life is great (almost 8 hours), but not significantly better than the industry standard, and that too only at brightness levels of 20-30%. If you like working at higher brightness levels, you won't get more than 5-6 hours of battery life.3. Display colour: the colour are bold and brilliant. Some reviewers have mentioned a problem with the display of yellow on the screen. My machine also showed a deep mustard slightly greenish yellow. The problem was fixed through Samsung's firmware updates, but to the discerning eye, the yellow remains slightly off. In case you're finicky about these things, you may want to calibrate the monitor.4. Display resolution: the ultra high resolution of 3200 x 1800 is a bit of a mixed bag. I'm not sure such a high resolution was even required on a 13.3 inch screen, not least since ultra HD media content is still ages away from becoming mainstream. The sharpness of the display is of course astounding. Text appears sharp and crisp, and high resolution photographs are a beauty to behold. However, several people have pointed out that applications designed to run on 1080p resolutions don't show text and alignment correctly on this laptop due to display scaling issues. Microsoft rectified some of these problems in its Windows 8.1 release, but this only addresses Microsoft applications. Third party applications are left to their own devices about whether or not support this resolution. I know from personal experience that Adobe Acrobat and Google Chrome now support it, but smaller software companies may not. To display those properly, you'll have to scale down the resolution of the display, which will sacrifice the clarity of the display. Tough bargain!5. Keyboard: given how thin this laptop is, there isn't much key travel, meaning that the typing experience is rather flat, without much feedback. This doesn't necessarily mean it's bad. Friends of mine enjoy typing on it. However it is a tiny bit uncomfortable for my needs and I sometimes make mistakes on it.6. Heat: do NOT use this laptop on your lap, on the bed, or on any soft surface that could block the heat vents on the bottom. That's generally advised for all laptops, but this one seems to shut down within minutes of its heat vents being blocked. My display switched off, and the laptop needed cooling for 1-2 minutes before coming back on. I guess that's one of the perils of a thin design. Aside from that, the laptop runs very cool and quiet most of the time.7. Trackpad: Windows 8 laptops across different brands have had problems with their trackpads, usually due to drivers. While I don't use the trackpad much (I prefer a portable mouse), so far it has been perfect.8. Wi-fi: some of the newer ultrabooks have reportedly given issues with wi-fi connectvity. Again, no problems here.9. Speakers: the speakers on this laptop are unbelievably good for a laptop this thin. It's a commonplace that laptop speakers are usually crap, and even the reputedly good ones sound very tinny and flat to me. The speakers on this machine manage to be loud and sound deep, which is a very pleasant surprise.10. Design, construction and form factor: let's face it, half the reason you're considering this machine is because of its gorgeous looks. This laptop is every bit as thin, light and beautiful as is advertised, plus the aluminium encasing also gives it a sturdy feel. Also, the design isn't about looks alone, because it's super-thin form factor also makes it very easy to carry in backpacks. I tend to stuff my bag with books, so I need the machine to not occupy too much room. This laptop is perfect for my needs. In fact, you'll have a hard time finding a case thin enough to fit this machine. This is the best fit I could find: http://www.amazon.com/gp/product/B0096PD2Z0/ref=oh_details_o00_s00_i00?ie=UTF8&psc;=1.11. Warranty: no matter how good a gadget is, there is always a chance it might fail. Therefore, one always has to consider the reputation of the brand in providing good after-sales support. Samsung is generally better in that regard than some other brands, so you know you're covered. Alternatively, you may want to get extended third party warranty service.Hope this is helpful!", "Date": "February 5, 2014"}, {"Title": "Excellent machine but not for everyone", "Author": "M. Mendoza", "ReviewID": "R17I27S7OZU45Y", "Overall": "3.0", "Content": "I owned this laptop for a couple of weeks and was highly impressed.  The design and build quality are absolutely stunning.  I've owned the Asus Zenbook, Lenovo Carbon X1, etc and while they are all great, the design of the Samsung is second to none.  Not even the Macbook Air can compete with this model in terms of build quality and design. Speakers are phenomenal for an ultrabook, keyboard is better than I thought it would be, machine is FAST, and wifi and trackpad both worked fine for me.However, I had to return this item due to it not meeting my specific needs.  Specifically, the screen, while gorgeous, was just a bit too much at 3200x1800 for a 13.3\" LCD.  When you have a resolution that high, everything (text, icons, etc) is super tiny (and I mean REALLY small) to the point where its impossible to read the text.  In that case, you simply increase the scaling (font size, icons, etc) and Samsung has the default set at 200%.  The problem with that is by making everything so large (200%) in order to compensate for the super high resolution, you fit less on the screen and end up having to do a lot more scrolling than usual when viewing web pages, etc.I also tried simply decreasing the resolution to 1920x1080 and while that did improve things, it never looked quite as clear/sharp as a LCD with a native 1920x1080 (1080p) resolution.  Besides, if you are going to run the Samsung at 1080p, then what's the point of having/paying for the Sammy's 3200x1800 super high resolution?  You basically paid that extra money for the high res screen but then aren't utilizing it (if you run it at 1080p) so you aren't getting your money's worth.  I can imagine if you are working with 1080p photos and you want to view the entire image natively in Photoshop and still have room for your palettes, it might be useful but otherwise, I believe a native 1080p LCD might have been the more practical choice for Samsung for this ultrabook.  I get it though, Samsung needed a way to differentiate their product and likely got trapped in the higher specs game manufacturers play, and so probably didn't consider what are the real world usage scenarios and consequences are of putting such a high resolution on a relatively small 13.3\" LCD.The final nail in the coffin was when I compared the LCD on the Samsung to my 2 year old 13.3\" Asus Zenbook that has a native 1080p screen.  Running the Samsung at its native resolution with 200% scaling, there was simply no comparison to the Zenbook.  The Zenbook's native 1080p screen simply looked sharper in my opinion and everything fit as it should, no unnecessary scrolling when viewing webpages, etc.  I will admit that I have flawless 20/10 vision so for some with poorer vision, having really large fonts/icons/texts at 200% scaling for the Samsung may be ideal.  However, for me, I just couldn't see paying the extra cash for such a high resolution screen when I wasn't going to be able to make use of it and the end result, when running at 200% scaling or at 1080p, was just going to be oversized or blurry  text/font/icons that didn't look as clear as a native 1080p LCD.However, you shouldn't t take my word for it. I would highly advise going to your local electronics store like Best Buy, etc, and simply checking out the Samsung in person.  Open up a webpage in Chrome or Internet Explorer and see how it looks (pay special attention to the clarity of the text).  Then open up the same webpage on another 13.3\" ultrabook with a native 1080p screen.  Compare the two side-by-side if possible and decide which one looks better to you.  Then make your decision if the Samsung's 3200x1800 screen is right for you.  For me, the Samsung's high res screen sounded great on paper but in real world applications and usage, that resolution just wasn't practical (and was overkill IMO) on a 13.3\" screen for doing normal day-to-day activities like web browsing.", "Date": "March 11, 2014"}, {"Title": "The BEST windows laptop on the market as of Q1 2014 (but not for everyone)", "Author": "Franklin", "ReviewID": "R1FVBPQNIXBBIY", "Overall": "5.0", "Content": "My 2-year old Samsung Series 9 developed a problem that many others also report, a crack developed for no reason at the upper left of the main surface area and as a result the power input can no longer hold the charger plug. So the great IT department of my employer got me the replacement to that laptop, the Samsung ATIV Book 9 Plus. This review is for the top-of-the-line one, with Core i7 processor, 8 GB RAM, and 256 Gig space. Note that this review does not factor in price.CONS (a Windows issue, not a Samsung issue)I only have one caution: the screen resolution is so high, so amazing, that Windows cannot deal with it well and it results in the desktop icons looking too small, and the many Office programs having buttons and writing that is too small. If you don't know how to fix these things on your own, avoid this laptop. In my case, I found ways around most of these issues by re-sizing the icons on the desktop, and in Word and other applications I increased zoom and/or font, and for Outlook email I got an add-in that lets you set a permanent zoom on all window pane viewings. But it took a few hours to get it right, find the third party add-in and the setting buried in Windows to let you re-size stuff more than 200%. But for me it worked and this \"CON\" is not at all a problem for me now.I do wish Microsoft releases updates to all Office products to allow re-sizing of everything (buttons and text) at one click and make it smoother, to account for the ultra-high definition screens coming out.PROS (lots!)--Performance. This thing wakes up in about 2 seconds! AMAZING. It is built specifically for W8, hardware and software work together to give you great performance, smooth, and very nice battery life.--Build. This laptop can withstand a lot of abuse, as it is made of metal unlike almost all non-Apple laptops. This is Apple quality, for Windows. The only laptop I have ever owned that can look as good, actually better, than my wife's Macbooks.--Looks. This thing is drop dead good looking.--Gorgeous Touch Screen. It is the best laptop screen in the world, Apple or Windows. It also goes all the way back to flat. And you can use it as a touch screen, in case you want to use it like a tablet and use Windows Metro instead of the desktop to consume media.--Track pad. As good as an Apple's, it is large and works great. For the first time I have really ditched the mouse.Room for improvement: wish it had a nicer charger (like the Macbooks have, with Mag safe connectors).This laptop is so nice I have, for the first time, started spending less time on the iPad and more time on the laptop to do common work stuff or read/work on emails.", "Date": "March 18, 2014"}, {"Title": "Great, but not perfect", "Author": "K. Munn", "ReviewID": "RIFW10FIO5UQR", "Overall": "4.0", "Content": "Okay, so, I've been using this Ultrabook-class machine for a good week now as a replacement for my LCD-damaged Sony Vaio Z (which, back when it was new, had a comparable higher-than-normal DPI display).Overall, it's a very nice machine. The metal construction gets nice and cold when the machine is in standby, it boot and wakes up quite quickly. This model came with 8.1, however the very first thing I did was wipe it and put on 8.1 Pro (I needed domain-joining capabilities) which was relatively painless. The keyboard is a touch shallow, however I can't imagine it being any better on a machine this thin. It's quite good for what it is! The touchpad is responsive...almost too much so. The touchscreen seems to work as expected, though I'm not the type to really use that a lot.Performance is decent, it matches my previous laptop in all categories (CPU performance, RAM, and even SSD size)...however it does so with a much more power efficient (Haswell) processor and at almost half the thickness. It managed to crunch through some builds in Visual Studio 2013 as well as some Content-Aware Fill in Photoshop CS6...not the fastest laptop, but again, this is an ULV processor.Now, onto the LCD. This is both the reason to get the laptop, but also the reason the laptop only gets 4 stars. I'm not going to get into the not so great scaling in Windows 8.1 with some applications...the applications need to fix that. The high resolution screen is fantastic when viewed from a couple feet away...it's very, very sharp. However, the moment you lean in close (granted, I have extremely great vision) things can look a little wonky...it's clearly not an RGB subpixel arrangement. Doing a little bit of research, it seems to be an RGBW arrangement (the W or Clear lets the display get ridiculously bright for not much power) with shared subpixels amongst pixels. Even with the 3200x1800 pixel count, the subpixels are noticeably not square to me when dealing with things that are straight lines. Now, I'm sure most people out there wouldn't even notice...but my husband and I noticed it within seconds of booting up the machine (granted we both work in the tech industry). If it were an RGB arrangement (even if it was less bright) at the same pixel density, it would get 5-stars easily.A quick aside, and the reason why I didn't return this laptop and see if one of the 2560x1440 pixel devices have a better subpixel arrangement, is that the speakers on this are fantastic.All in all, viewed as a whole package, this is a very nice laptop...especially if you don't mind dealing with such a high resolution display!", "Date": "November 18, 2013"}, {"Title": "Great Laptop for a great price", "Author": "Andrew Schaeffer \"the DRU\"", "ReviewID": "R218L6C2TADIEW", "Overall": "4.0", "Content": "Compare these specs to a MacBook and you will find you are getting great hardware for a very competitive price. The screen is super sharp and the touch screen is as responsive as expected. The gestures on the trackpad take getting used to but after a couple days I love it. The only issue I have is I cannot figure out how to tell the Power Settings not to adjust my screen brightness ever! I will manually adjust if necessary but I am unable to figure that one out. You also get the typical pre-installed crap from Samsung but after an hour of uninstalling you can get to a pretty fresh install.I am very happy with this purchase.", "Date": "January 3, 2014"}, {"Title": "So far so Good", "Author": "Patrick Thomas", "ReviewID": "R2VR8QUMCUMU59", "Overall": "4.0", "Content": "So first of all this is a truly gorgeous product, form factor is tops.It is very firm and sturdily built. I can pick it up by the screen and I feel no give or wobble at all.The adaptive brightness is a bit of a nuisance but as said before by others it can be turned off.The i7 has been snappy so far and load times across the map are very very fast.One thing I have noticed is that sometimes the touchpad will lag? I don't know why this happens exactly but every now and then I will be scrolling and suddenly not be able to anymore, the touch screen still works during these times so I know the computer itself isnt bogging down it seems to just be the touchpad. This problem only lasts about 6 seconds or less when it ahppens so not too big of an issue. Probably fixable with a firmware update or some such.The resolution is amazing and the viewing angles are superb.Ill update after I have been working with it a bit more. Im only 1 1/2 weeks in now.", "Date": "December 21, 2013"}, {"Title": "Great laptop", "Author": "Ben", "ReviewID": "RJGM8QLNM9ANU", "Overall": "4.0", "Content": "This is a quick comparison for Samsung Ativ book 9 plus ultra book, Toshiba kirabook i7s (4th Gen processor) and Asus Zenbook UX3011) Design. Samsung Ativ book 9 looks better. Asus design looks good. Kirabook is okay.2) Keyboard. Ativ book Keyboard is better. Asus zenbook and Kirabook keyboard are good too.3) Speed and performance. Toshiba Kirabook i7s is faster. Tested with several apps and Toshiba kirabook is more responsive than Ativ book and ASUS zenbook. Kirabook Fan is quiet all the time which is a greatly improved from previous Toshiba kirabook i7 (3rd generation). Asus zenbook often crashed and sometimes it is less responsive. Not sure if it is due to its windows 8. Kirabook comes with Windows 8.1 Pro, which is very stable.4) Weight. Both Zenbook and Kirabook are lighter. Less than 3 lb. Samsung Ativ book 9 plus is a little bit over 3lb.5) HDMI and USB ports. Kirabook has one HDMI port with 3 USB ports. Samsung has only one micro HDMI port with 2 USB port. Asus only comes with one micro HDMI port with 2 USB port6) Screen. Samsung Ativ 9 plus is slightly better due to its higher resolution. I like Kirabook screen color better. It looks nicer. Asus screen is good.7) Toshiba Kirabook comes with 2 years' Norton Antivirus service. Samsung Ativ book only comes with 6 months Norton service. Kirabook also comes with Adobe element 11.8)Battery life. Kirabook has a 15% longer battery life than Samsung Ativbook and Asus zenbookOverall, I like kirabook better due to its stronger performance and longer battery life and nicer screen. Although its design is not as attractive as Ativ book and Asus zenbook, I still will give the kirabook 5 stars and Samsung 4.5 stars due to its performance difference. Asus zenbook failed me with often crash windows 8, maybe it is due to its window 8 OS.", "Date": "February 19, 2014"}, {"Title": "A perfect successor to my MacBook Air", "Author": "David Ward \"Dave\"", "ReviewID": "RX6466TUKQ3UR", "Overall": "5.0", "Content": "For the longest time, I've tried to find a Windows-friendly replacement for my MacBook Air. Hardware-wise the Mac was unbeatable, which I why I bought it, but OS X and the Apple ecosystem are not my cup of tea. Unfortunately, every \"Ultrabook\" I tried over the past few years has had a fatal flaw or two that made it an unacceptable replacement for me.The i7/8GB version of the ATIV Book is finally that machine. I find its hardware better than my MacBook Air in every way, and it runs Windows 8.1 like a champ. The display is amazing, the performance is great, and the keyboard and touchpad are both excellent.Tip: Be sure to install all of the firmware and driver updates via \"SW Update\".", "Date": "December 21, 2013"}, {"Title": "Samsung ATIV 9 Plus i7... SUPERB!", "Author": "Michael Schumacher \"MSchu\"", "ReviewID": "R2Q1T90VI11FVU", "Overall": "5.0", "Content": "My i7 ATV finally arrived and it's superb. the best built laptop on the market today. windows 8.1 is fantastic once you get used to it and learn it's nuances and tricks, a very powerful operating system.The Samsung build quality is unmatched, even by apple standards, and the screen is unrivaled. any issues newbies are bringing up about tint can EASILY be rectified by a simple adjustment, everything is customizable. this unit is slightly faster than the i5 version I had before and the extra GB's of the SSD is greatly needed... Boot time in under 5 seconds.this is easily a five star machine.", "Date": "December 3, 2013"}, {"Title": "Simply Awesome!", "Author": "Tuan Tran \"tuanskie\"", "ReviewID": "R2W58XTDU3LK4K", "Overall": "5.0", "Content": "Having spent more than 15 years lugging around many heavy and under-powered laptops for work and travel purposes, I finally got a chance to replace my current laptop, a Dell E6530, which weighs about 5.5 lbs excluding the power adapter and is \"fat\" at 1.3 inches in height, and saw this awesome looking spectacle - the Samsung ATIV Book 9 Plus w/4th Gen Core i7. Bear in mind this is not for the budget-conscious person. If you have $2000 of wiggle room, then quit deliberating. After comparing different 13\" ultrabooks including the MacBook Air 2014, Lenovo IdeaPad Yoga Pro 2 and Dell XPS 13, what sold me to the ATIV were the following:Pros:1. Extremely thin (0.54\") and light (3.06 lbs): Gold standard comparison to the MacBook Air 2014 model is 0.68\" thick and 2.96 lbs.2. Excellent design and color (Mineral Ash Black) - Probably the best looking ultrabook among the other three mentioned, period! You can't stop looking at it!3. Has a touch screen - This wasn't a deal-breaker, but having it was a plus.4. QHD+ (3200 x 1800) Touch Screen Display - Let's face it, it's more resolution than needed but why not?5. Excellent build materials with aluminum chassis.6. Slim and lightweight power adapter.7. Excellent processor - Apps are open up fast and it pumps out the juice, especially with 8GB RAM on board.8. Boot time is fast!9. Ports: HDMI connectivity (via micro HDMI port), USB 3.0 x 2, and SD/SDHC/SDXC slot, RJ45 LAN (via included dongle).Cons:1. No 802.11ac (I can't believe they didn't include this latest wireless tech!) - This wasn't a deal breaker but I did upgrade my home wireless to 802.11ac and had to shell out $ for a USB-based 802.11ac wireless adapter.2. SSD drive capacity is small (256 GB) - I had to shell out $$$ for an external 500GB SSD USB 3.0 just to keep it real. People who say that 256 GB is sufficient are just not tech-savvy and do not understand how files (particularly video) take up space rapidly as you use your laptop over the years.3. Price is steep, especially considering no 802.11ac and the SSD is only 256 GB.Despite the cons, I absolutely love my new laptop! Samsung finally produced a machine that competes with the Apple MacBook Air at all levels and outdoes it on some.", "Date": "May 18, 2014"}, {"Title": "Wonderful Ultrabook", "Author": "Amazon Customer", "ReviewID": "R2BW8FRREQXNZ4", "Overall": "5.0", "Content": "I have used my Samsung ATIV Book 9 Plus ultrbook regularly for two months now and love it.  I choose the Samsung ATIV Book 9 series because Consumer Reports recently rated it the best of the Windows laptops.  Regardless of the additional price, I opted for the ATIV Book 9 Plus compared to the ATIV Book 9 because of the additional 128 GB of memory, the second USB 3.0 port, and preloaded Windows 8.1.  And I am really glad that I did purchase the ATIV Book 9 Plus because after only two months of use I would have nearly maxed out the 128 GB memory of the ATIV Book 9.  This computer is remarkably fast, the screen is really sharp, it is handsome, it is very light, and has been hassle free after I surmounted the Windows 8.1 learning curve.Norm NielsenSeattle, WA", "Date": "May 6, 2014"}, {"Title": "Wow!", "Author": "Danni H.", "ReviewID": "R2GYUR2SFEPYZ8", "Overall": "4.0", "Content": "I was a little concerned that the resolution would be too high for the smaller screen, but it is actually really well done. I had the Acer Aspire s7 and that was a terrible implementation because the resolution was far too high and Acer did not do a good job with scaling so everything looked really tiny.This item:-Screen is gorgeous.-Machine itself is gorgeous.-Weight is really comfortable.-Speed is off the charts.-You can only slightly hear the fan when you're doing your initial setup due to all the updating. Once complete, it's silent.-The keyboard is comfortable to type on and the back lighting is perfectly understated and adjustable.-The speakers are impressive.-Haven't had WiFi issues and based on another reviewer, I'm not going to install the Samsung firmware update.It's a fingerprint magnet and was loaded with bloatware. And I would've liked to see a 15 inch model. Those are my only minor negatives. Also, not sure why people don't mention it more often, but I'd recommend a surge protector. Definitely protect your investment any way you can.Otherwise, I'm in love. This little thing is perfection. Was literally cuddling with it yesterday.***UPDATE 3/15/2014 - The fans have started to be really loud at times. Sounds like a handheld fan with a piece of cardboard clicking through it at a really high speed. Not sure if this is just a fluke on my unit since others haven't mentioned it. Noise started before I installed Samsung's BIOS update. After the updates, it is still present. May be exchanging as the sound is really unacceptable.", "Date": "March 9, 2014"}, {"Title": "Elegance, Performance and Simplicity", "Author": "Thiru", "ReviewID": "R6CJPKP0LU2BC", "Overall": "5.0", "Content": "After much deliberation, I voted to get this model. I love it right out of the box, its functions are fluid and fast. Screen Sharing with my S4 is working totally fine and beautifully. This is really an awesome machine.1. Keyboard is perfect.. shallow but sometimes clicky, doesn't bother me2. trackpad is great3. slim and light4. Screen is OMG !!!5. I do wish they improve the brightness of keyboard lighting but thats prolly cause of such a bright screen.6. Beautiful to look atThe battery is actually really nice as it virtually uses no battery in sleep mode. It is lasting me for more than 15hrs with some hours of sleep and power saver settings.This is incredible and super quiet.Enjoy !!", "Date": "February 19, 2014"}, {"Title": "One of the best ULTRABOOK 2014", "Author": "krlosRD™ \"CJp\"", "ReviewID": "R3DVWLCRQ478MC", "Overall": "5.0", "Content": "- Very expensive.- Does not bring a cover as other ultrabooks in the market.- Keyboard is not excellent.+- WiFi didnt worked well at first but with the updates it now amazing!+- Some Samsung pre-installed apps are tempting me to drop my LG G2 and buy a SGS5 but still have to wait for LG G3 :D+- Camera is SoSo ...+ GREAT screen. Colors and brightness are very accurate. Other Ultrabooks has Resolution/Colors/Brightness issues, go to any store and do a good research first.+ Battery life is amazing.+ Sound is very loud and great :)+ It's very powerful.", "Date": "April 29, 2014"}, {"Title": "If you are willing to pay for beauty and performance, you will not be disappointed.", "Author": "Alex M. Kaczmarek \"Alex\"", "ReviewID": "R1HO2S1TD9MK54", "Overall": "5.0", "Content": "I've had this laptop for a week now.  I read dozens of reviews on this and the other Samsung options.  I've previously purchased and returned 2 other Samsung laptops, thank you Amazon.  I tried both of the Samsung Series 9 laptops. I owned the original non touch screen model for 11 months and was very pleased.  I had only one small issue with that one, the 1600x900 reslution.Many will provide a number of complaints but it is truly a beautiful laptop and did very well.  I used it as a full laptop for almost a year and finally got the urge to find something with a bit more resolution.  I tried the Ativ Book 6 but it was too heavy and the spinning disk was WAY too slow.  I have accepted that I will never own another laptop with a spinning disk.  I purcchased the Samsun Series 9, 15 inch edition and I couldn't accept the difference between that and my 13.3 Series 9.  I finally purchased this laptop, the Ativ Book 9 plus and this will work just fine.Don't let the other reviews persuade you away from this laptop.  Regardless of what they say, if you are willing to pay what it costs and accept that you are paying for beauty, style, resolution that is just crazy, you will not be disappointed.  CPU, memory, disk, screen, keyboard, touchpad, wifi, battery life is all perfect.Just remember to download all patches and updates, including Intel wifi and screen patches and all will work brilliantly.", "Date": "March 30, 2014"}, {"Title": "Great laptop. Where's its big brother?", "Author": "Ace Metrix", "ReviewID": "RMA77D2KPATB3", "Overall": "4.0", "Content": "These laptops pack a lot in a very little space. Samsung does a great job of copying Apple styling, so these will turn a few heads as well. Unfortunately, they also do a good job of copying Apple's requirement to have a special cable to connect to just about everything. Hey, it's the price you pay for fashion. C'est la vie.The reason I give it 4 stars and not 5 is that Samsung has pretty much stopped making the 15\" version of this. I have no idea why, but if you want a hip, light and powerful laptop of this caliber you are forced to suffer with a 13\" screen.  I don't care that you can get a gagillion pixels per inch, that only works when for those who remember to bring their monocle with them. 15\" allows for multitasking. It should be an option for the high end ATIV laptops.Now, if you are an exec and just want to pull up Powerpoint and/or read your email on something that looks as cool as a pad, but has keys that are designed for someone with opposable thumbs, then this is your baby.Those lower down the food chain will want to by the HDMI adapter and get yourself something useful to view you work on.", "Date": "April 22, 2014"}, {"Title": "Beware of the various versions", "Author": "Mike S. \"VTSoundMan\"", "ReviewID": "R1HBI541YDVLHE", "Overall": "4.0", "Content": "I have the K05US version - it has the identical specs to the K04US (except...see below)...and I love the machine.  Great build, fast, light and really a nice piece of equipment.  I use my computers quite hard in my business and intend on using them for several years.There are various versions of this laptop released by SAMSUNG.  I have the K05US- this version is only available for sale in the Microsoft store. MS has removed some of the innovative Samsung software (including SideSync) - and if you want it, you will have to buy it.  The K04US version, comes fully equipped.  I think it is pretty poor customer service that Samsung will not provide the SideSync software to the K05US version - it is the same cost as the K04US unit.  I am thinking about returning it - but then have to deal with the joy of setting up another machine (tedious process).  SideSync is the software that allows you to Sync/control/do cool stuff a Samsung Galaxy phone to a Samsung ATIV Book 9.The screen is outstanding - far better than the Retina. It could use a little help with color tuning, but overall pretty stellar. (Retina is a bit better out of box for color spectrum that I've seen). Some pixelation can be seen in applications, but that is highly software dependent.  Unit runs warmer than my I5 ultrabook, but it not a concern. Typing is a pleasure and the touchpad is quite nice too.So if you looking for the 'fully equipped' Samsung ecosystem experience, be careful which laptop you purchase.Update : Deducting 2-stars Samsung & Microsoft inability to articulate the various differences in the laptops.  I will also mention that the MS prices and those that are offered to 'the wild' vary quite a bit.  Since I was able to get the K05US at a lower price than the K04, I am adding 1 star back. I would still buy this laptop although I am not happy with Samsung's/MS customer service and seemingly bait & switch tactics.", "Date": "January 8, 2014"}, {"Title": "Amazing Ultrabook. A little room for improvement.", "Author": "J. Schneider \"john_jps\"", "ReviewID": "R35R30O81S6CR", "Overall": "5.0", "Content": "This laptop is stunning.  The fit and finish are of the very highest quality and the components are top of the line cutting edge (as of mid-2014). The QHD screen is amazing, the i7 and SSD make for incredibly fast startup times and boot times in general.  The WiFi is advanced enough to take advantage of dual band. The thing is super thin and the narrow bezel around the disply make this the smallest form factor of all the 13.3\" QHD ultrabooks. The Haswell chip is very low power and battery life is several hours.Where it could improve? As mind boggling as the display is, the Lenovo Yoga 2 Pro seemed even better to me: screen fonts seemed even more crisp. (I'm really splitting hairs though.) Also, the keyboard is nice but not as nice is that same Lenovo. The best ultrabook keyboard is on the Dell XPS 12 (which is not QHD or as super-thin, but is fantastic if you don't need those).", "Date": "May 18, 2014"}, {"Title": "Superb computer", "Author": "MarkN", "ReviewID": "RRDEU823IQVNR", "Overall": "5.0", "Content": "I have now had this replacement for a previous Samsung Series 9 for two weeks. By far the best PC I have ever used. Windows 8.1 running on the spec of this machine is superb. Start up is seconds, screen quality excellent and everything I have tried runs flawlessly.", "Date": "May 16, 2014"}, {"Title": "Fast, flat and fun", "Author": "Vincenzo", "ReviewID": "R8XB6LB53KJCH", "Overall": "5.0", "Content": "Love my new laptop. Has already been around the world with me and it's a joy to carry it through airport security. I hardly know its in my bag. It boots up quickly and the resolution is fab. I wish the price were lower, but otherwise, not one complaint.", "Date": "May 11, 2014"}, {"Title": "Laptop is great", "Author": "Daniel Branik", "ReviewID": "R36KHL59IZ2ZEN", "Overall": "5.0", "Content": "Laptop meets all my expectations and once I have removed some of the Samsung bloat-ware, have nothing but praise for this device", "Date": "May 10, 2014"}, {"Title": "Great Ultrabook!", "Author": "G. Spencer", "ReviewID": "RZW2J2B020ZEU", "Overall": "5.0", "Content": "I had tried the Acer S7, Asus UX301LA and this is by far the best. Build quality is better than the others, keyboard is fantastic(accepting the shallow ultrabook typical key travel), speed is excellent and battery life is better than the competition (7-8 hours of excel, web use). While there are still some scaling issues with such a high resolution, this is true with any laptop using a high resolution display and says more about the software developers than Samsung or even Microsoft.", "Date": "April 23, 2014"}, {"Title": "I just love this laptop - now, about learning Windows 8", "Author": "John King", "ReviewID": "R38HXU2CUYREA8", "Overall": "5.0", "Content": "Great laptop. Touch screen and all the bells and whistles. this is the first time that I had encounter Windows 8. Now, that is a whole different ball game. I guess it will take some time to get use to W8. Hello Youtube lessons!", "Date": "April 12, 2014"}, {"Title": "Small, light and fast", "Author": "WHC", "ReviewID": "R11NWG6IH2NBCI", "Overall": "5.0", "Content": "I need to replace my current computer which was an older model 17 inch laptop running Windows 7. I knew I wanted to go smaller for portability and planned to hook it up to an external monitor when I was at my desk. I am very happy with the form size of the ATIV Book 9. The SSD and speed of the computer is quite sweet. Boot up is faster than just getting my coat off in the morning. I have not missed having a disk drive and have yet to purchase  USB drive. Windows 8.1 took some getting use to the newer operating system. I spent a fair amount of time on the internet learning how to do things. No I did not look at a manual. Once I figure out the operating system I have been very happy and it has been very stable without any crashes for me. The touchscreen of the Book 9 really makes the operating system easier to work with. The only down side to the computer may be the native resolution. It puts a lot on a small screen but the type is small at times. The clarity of the screen is great. This is a great computer and I am really happy with it. It you are planning to use an external monitor/keyboard/mouse look a the Anker port replicator.", "Date": "April 4, 2014"}, {"Title": "good", "Author": "laura", "ReviewID": "R1SMI3VE0KOJJO", "Overall": "4.0", "Content": "So first of all this is a truly gorgeous product, form factor is tops.It is very firm and sturdily built. I can pick it up by the screen and I feel no give or wobble at all.The adaptive brightness is a bit of a nuisance but as said before by others it can be turned off.The i7 has been snappy so far and load times across the map are very very fast.One thing I have noticed is that sometimes the touchpad will lag? I don't know why this happens exactly but every now and then I will be scrolling and suddenly not be able to anymore, the touch screen still works during these times so I know the computer itself isnt bogging down it seems to just be the touchpad. This problem only lasts about 6 seconds or less when it ahppens so not too big of an issue. Probably fixable with a firmware update or some such.The resolution is amazing and the viewing angles are superb.Ill update after I have been working with it a bit more. Im only 1 1/2 weeks in now.", "Date": "April 3, 2014"}, {"Title": "Lovve it!", "Author": "nish", "ReviewID": "R33DNQ11AHE171", "Overall": "5.0", "Content": "Bought it for my husband for Christmas. He loves loves loves it!  He is definitely a computer geek, so him being impressed with this laptop is definitely saying something. I just wish they had more covers for them. I was only able to get a sleeve.", "Date": "April 2, 2014"}, {"Title": "Great laptop.", "Author": "Kyle Swenson", "ReviewID": "R3A622VGYWT8EH", "Overall": "5.0", "Content": "I use the touchscreen less than what I though I would. Really powerful for its size. I would definitely recommend this product if you are looking for a pc alternative to a macbook air.", "Date": "March 10, 2014"}, {"Title": "Amazing laptop", "Author": "Federico", "ReviewID": "RY4O6BEMXHM48", "Overall": "5.0", "Content": "Light, beautiful, quick, comfortable. The only thing I would change is Windows 8, not to my liking. I highly recommend it.", "Date": "February 28, 2014"}, {"Title": "An incredible machine", "Author": "Mark T", "ReviewID": "R2LOU2SU62B3HM", "Overall": "5.0", "Content": "Battery life lasts long, keyboard works perfectly and glows beautifully, screen is beautiful, though at full resolution it's just too small to see clearly with my eyes, so I run it at 1080 most of the time and it looks great. It runs most games with decent frame rate, though sometimes you have to run full screen at 720p to get 60 fps. Five stars from me.As for some of the other comments, I personally haven't had any wi-fi problems at all, and while the touchpad seems okay, I rarely use it as I'm a mouse person.  The rest of the time I use the touch screen which is amazing :)I agree with the bloatware, the \"samsung advisor\" pops up all the time, and there's no way I can find to stop it short of just un-installing it all together.  I also agree that at max resolution it doesn't feel as crisp as it should, but it does look amazing at 1080p.", "Date": "February 3, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F6EOB8C"}}