{"Reviews": [{"Title": "This worth money !", "Author": "Hunter", "ReviewID": "R3I6UN3G3921KQ", "Overall": "5.0", "Content": "So I decided I would do a review on here even though I didn't purchase this product from Amazon.Overall, this is a strong machine with low price. 4 Gigs of RAM is a huge plus. CPU is not bad with 1.8 GHz Pentium 2117U (2 cores. Beside that, 500Gb storage is great for music and video in normally.About the battery, the advertiser told 4 hours. I never used one program or just start the laptop to check it, the actual battery of my laptop is over 3 hours. I think, it depends on the way you use the laptop. About the windows 8, windows 8 was designed for touching, but this laptop is untouchable. If you want to experient on touching laptop, you can see this laptopB00EY50ISGThis machine is not include windows 8 VCD, so you have to care full if you want to restore the system. In short, this laptop worth money.", "Date": "October 21, 2013"}, {"Title": "no DVD player", "Author": "Deanna Summers", "ReviewID": "R2PAS7W0K38GJ5", "Overall": "2.0", "Content": "Returned it  no DVD/CD player. This is not obvious when looking at the computer to purchase.  I was not happy,", "Date": "April 21, 2014"}, {"Title": "I will never buy a Gateway product again.", "Author": "Marc", "ReviewID": "R1RQ82Q6M21YRD", "Overall": "1.0", "Content": "Laptop will turn off randomly on start up. Will usually stay on after the 2nd or 3rd time. There's this also weird screen glitch that will happen, and the only way to fix it is to turn the laptop off.", "Date": "January 23, 2014"}, {"Title": "excellent device", "Author": "Yonnys Meza", "ReviewID": "R6P9W0U3CARN", "Overall": "4.0", "Content": "It is a very versatile laptop, I would have liked to bring dvd drive.I love their keyboard and screen size", "Date": "March 19, 2014"}, {"Title": "AWESOME!", "Author": "Robert Nelson", "ReviewID": "R4SF6ETWL9X7G", "Overall": "5.0", "Content": "Super awesome deal, great computer. Definitely worth the money. Runs most new games on medium settings, super fast on web searching.", "Date": "January 28, 2014"}, {"Title": "great for home use", "Author": "joi yeldell", "ReviewID": "R1D5LU5VP1VFVE", "Overall": "5.0", "Content": "works great, fast and perfect for home needs such as homework, internet and word activities.  also use it for small business purposes, works well.", "Date": "May 17, 2014"}, {"Title": "Rather Difficult", "Author": "Jill Menefee", "ReviewID": "R2UPTNN60L0R3D", "Overall": "3.0", "Content": "I have had some difficulty getting this computer to work.  I am not used to Windows 8 so that's part of the problem but it is slow to do anything.", "Date": "December 30, 2013"}, {"Title": "NO DVD DRIVE?! Seriously?!", "Author": "Sarah B.", "ReviewID": "R5L5CC5DBJFZ5", "Overall": "2.0", "Content": "This computer doesn't have a dvd drive! I will take partial blame being that I'm not very techy and assumed that all laptops were equipped with this. Now, my son is stuck with a computer that is only partially functional... so pissed!!", "Date": "January 8, 2014"}, {"Title": "It could be 5 stars if it came with Windows 7 and not 8", "Author": "Amazon Customer", "ReviewID": "R5L4Q3JEQEJRK", "Overall": "3.0", "Content": "Our last Gateway is still kicking strong and we bought it in 2007.  We figured it might be close to the end and the price on this was good.  I absolutely hate Windows 8 so this makes this computer one that I dread.", "Date": "February 7, 2014"}, {"Title": "windows 8 and 8.1 are horrible.", "Author": "Jungle Buy", "ReviewID": "R2TL3YPSOD7W0Y", "Overall": "1.0", "Content": "I don't have an issue with Gateway, however, the OS (windows 8 and 8.1) are horrible.If you want to do tasks other than social media and online shopping I do not know how that can be done.Also, windows 8 & 8.1 seem to track your every breath no matter the settings.Wish I had purchsed a different OS.", "Date": "December 9, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F8AFVCY"}}