{"Reviews": [{"Title": "Fast and Light", "Author": "Andrea Miller", "ReviewID": "R3GC0MCT81SHGE", "Overall": "5.0", "Content": "Thought I wouldn't like Windows 8 and expected to need time to get used to this computer.Was I wrong. Transferring everything from my old Windows 7 computers to this one. Love the weight, the size and the speed. Installed GMail touch screen and having a blast.The keyboard on this computer is very tight which is exactly what I like. So far battery life seems excellent. Been using this for 2 hours now and there is still plenty of battery left.I was told to expect this machine between the 7th and 10th -- it showed up on te 2nd. I'm in computing heaven.This is my 3rd Asus and I think I'm a customer for life.", "Date": "January 6, 2014"}, {"Title": "I do not own but I went to a local retailer for a hands on experience.", "Author": "Karl S", "ReviewID": "RA040NC756W5P", "Overall": "5.0", "Content": "** Update**11/4/13  I just purchased this laptop from Amazon so I will update when I can, but this a gift for my son, so the updated review may take some time since I can't let him know I have it.As I said above, I do not own this but I was able to run it through some hands on testing and this what I came away with in regards to this PC.I am not a tech guru, I have never used a touch screen.  I use my pc's for web-surfing, checking emails and such.  I do not play games on my pc, I have a ps3 for that. I am just your average guy.The screen is a good size, the touch screen works well and this thing is light.  It does have the 3rd gen i5 cpu and 6gb of ram but that should be plenty of power for the average user.  Boot time was about 12 seconds and commands for opening programs were FAST.  If I read correctly the 24gb ssd is for caching and nothing else (i do not think the OS is installed on the ssd).  the software, after continuous usage, moves files that are used a lot to the ssd for faster retrieval times.  it does not have a dvd drive but who uses dvd's anymore?  worst case scenario you can purchase a usb drive for less money than if you were to buy the s550ca version of this pc. (by the way, look for the s550ca on amazon and you will see the reviews are better for that pc.  which is odd because s550ca and the s500ca are the exact same except the s550ca comes with a dvd drive and the s500ca does not.  that is the ONLY difference).The pc I played with had windows 8.0 instead of 8.1.  Listen, I know a lot of people like or dislike the newest version of windows but do not take it out on this pc.The pc did what I asked it to do in a package that is smaller, lighter, faster and less expensive than what I paid for my 3 year old 17\" hp.  its hard to determine if this pc was right for me, so I found it locally in the store that has a blue tag with yellow letters.  Test drive it there and buy it here, the prices were the same.  I will wait and see if amazon does anything price wise for cyber monday before i make the purchase but I will buy this laptop...maybe two.  Happy shopping all and I hope this helps you a little in your search. :)", "Date": "November 2, 2013"}, {"Title": "Outstanding", "Author": "Sharyl Tarantino", "ReviewID": "R1AJB3DFK2CZ6Z", "Overall": "5.0", "Content": "The touchscreen is easy; it's lightweight; easily used on an aiplane; has a keyboard and a touchscreen keyboard; has a right-handed number pad...it's great.", "Date": "December 15, 2013"}, {"Title": "amazing", "Author": "L. Huang \"L. Huang\"", "ReviewID": "R2X6A8GSZ846WN", "Overall": "5.0", "Content": "Simply put, if you're looking for a window computer that has a touchcreen (ultra book), this is where you go. Great processor and picture. It is super light as well.", "Date": "February 6, 2014"}, {"Title": "Excellent", "Author": "Juan Francisco Armenta Castro", "ReviewID": "R3K3J0J2CSZQNS", "Overall": "5.0", "Content": "im very happy with this purchase the laptop for the price is really nice i enjoy this ultrabook very good relationship price cost.", "Date": "January 6, 2014"}, {"Title": "Not sure about this item", "Author": "Student", "ReviewID": "RU1XO8N29NLZQ", "Overall": "1.0", "Content": "It's good looking computer. I like how symmetric it is, and it looks great. But, the touch pad or keys are very hard to use - not well made.", "Date": "April 6, 2014"}, {"Title": "Problems with LCD and defective chips", "Author": "Ricardo Vera", "ReviewID": "R30I8SKTCU9XY2", "Overall": "1.0", "Content": "At 3 months of use, the machine faults present on the screen, putting white at any moment.The send a warranty, which was delayed 8 days, and given the severity of the problems, I did not get a new laptop, I just changed the components, which were I think the screen and some defective chips..", "Date": "March 20, 2014"}, {"Title": "Solid laptop", "Author": "Todd Cox", "ReviewID": "RRU2OZHJS24D2", "Overall": "4.0", "Content": "I needed a new laptop for home and this dit my needs for browsing and work. The WiFi card does seem a little spotty, but it hasn't really been a problem, just an occasional drop here and there. It is a great value.", "Date": "March 13, 2014"}, {"Title": "great hardware, great laptop if you like win8", "Author": "DA", "ReviewID": "R3U4927G4EXL8D", "Overall": "4.0", "Content": "Laptop hardware is great. It is a very fast computer and I love that it has an hdmi port. It makes watching netflix on my tv a breeze. I gave it only 4 stars because of windows 8/8.1. It takes a little while to get used to the new interface. The touch screen capability really helps though. Windows 8 without touch screen is pointless imo. If windows 8.2 corrects microsofts misguided attempts to make a universal os, I would rate the laptop 5 out of 5 stars.", "Date": "January 4, 2014"}, {"Title": "Good computer for study in library", "Author": "davidxue", "ReviewID": "R3LKJ74Z859XUX", "Overall": "5.0", "Content": "The computer is easy to carry for someone need to work outside, i like the number key board, it is very useful", "Date": "December 23, 2013"}, {"Title": "Great product!", "Author": "J. Rivera", "ReviewID": "RPLC0ZN8ABB6H", "Overall": "5.0", "Content": "This item came perfectly wrapped and with no damage to the outside or internal hardware. It runs like a dream and is truly a wonderful PC for the price. I recommend getting a pc screen protector though if smudging is a problem for you. Thanks again!", "Date": "November 18, 2013"}, {"Title": "Out of box mouse touch pad stuck", "Author": "curt h chambers", "ReviewID": "R3E8XKN249NMEZ", "Overall": "2.0", "Content": "The touch pad would get stuck in down position when clicked.  This was an out of box defect.  I sent the unit off to the asus repair center and they fixed it.  It took about a week for the repair.  Asus covered all costs as the unit was under warranty.  Unit is currently working fine.", "Date": "February 4, 2014"}, {"Title": "it took a while to get used windows 8 its good", "Author": "Faisal Ebadi", "ReviewID": "R3K8W4TK5TON8N", "Overall": "5.0", "Content": "it can handle most games like lol and it did take a while to get used to windows 8 but the touch screen kind hand for lazyness", "Date": "January 14, 2014"}, {"Title": "Good atuff", "Author": "dominick andreassi", "ReviewID": "R3SB3MDEIHV922", "Overall": "4.0", "Content": "Response time of processor is very fast.  Touch screen is very good.  Have many Asus products and they are a good company.", "Date": "January 7, 2014"}, {"Title": "Bad Amazon, Bad Asus", "Author": "Chuzz", "ReviewID": "R3DWU4WLH4FZGH", "Overall": "1.0", "Content": "A month ago I bought a Asus S500 because I have heard they are good quality ... however, 2 days and was using the adapter exploded damaging the computer, so I can say that now I have just a little technology makes useless in my hands.I've been buying in this way without any problems, and it is outrageous that now I have this problem in supporting my country, Amazon did not answer calls, much less answered my messages, I always thought was a reputable company over 4 years, but apparently only when things are going well, because now the only thing I want is to make it enforceable.", "Date": "February 6, 2014"}, {"Title": "TERRIBLE Laptop from Asus,", "Author": "HGL", "ReviewID": "R3T6ORIWK4QGOK", "Overall": "1.0", "Content": "The computer is a headache since first moment.  You can be working  for 15 minutes to 2 hours and suddenly the screen goes suddenly to black (with a dotted line on the right side of the screen) and It never comes back.  Reset it in the hard way (by pushing the power button 10 seconds).  Nothing comes out from the event viewer.  Talk to Asus support and response was deceptive (Install Windows again!!!).  Obviously is a hardware problem but they don't take any responsability on that.  I will try to RMA this computer but sincerely next time I will go after some serious support company (Dell, Apple).", "Date": "January 29, 2014"}, {"Title": "Bought for Wifey Xmas Gift", "Author": "Adrian Goins", "ReviewID": "RWINI0BETF863", "Overall": "4.0", "Content": "I was lucky that I was able to find this laptop still available on here after big box stores sold out.  Last year bought a different laptop manufacturer 17.3\" Windows 8 laptop (No touchscreen) and regretted it.  Touchscreen is almost a must for running Windows 8 and this one is a lot easier to move around.  But #1 recommendation WIFEY is HAPPY!  Happy wife...happy life!!", "Date": "January 8, 2014"}, {"Title": "bluetooth", "Author": "femi dasilva", "ReviewID": "R1PESXGLZBG1F3", "Overall": "4.0", "Content": "nice laptop only flaw is dat it does nt have a bluetooth but all in all i recomend for any one who wants a slick wannabe apple air", "Date": "December 30, 2013"}, {"Title": "I can't believe, it does't turn ON!!", "Author": "Suene Rodrigues", "ReviewID": "RG9AJ6D4DU1VJ", "Overall": "1.0", "Content": "Amazon is perfect, it arrived very fast. But the computer doesn't work, it simply doesn't turn on, the fact is that I bring it to Brasil and nobody can help me here, so I send back to USA and I'm still waiting", "Date": "December 27, 2013"}, {"Title": "IT IS A LEMON", "Author": "pasfowler", "ReviewID": "R1GI1D9FYLF8M5", "Overall": "1.0", "Content": "I TRIED TO WORK WITH IT BUT IT HAS FROZEN ON ME OVER AND OVER AGAIN. WHEN I TRIED TO RETURN IT, I FOUND OUT THAT I'D MISSED THE DEADLINE (NOV 2ND) BY A WEEK. IT WILL NOT LET ME PUT IN MY PASSWORD BEYOND THE FIRST CHARACTER. NOW I'M HAVI8NG TROUBLE WITH THE INSURANCE  THAT I TOOK OUT. ALL IN ALL $600 WORTH OF CRAP. I HOPE NOBODY ELSE HAS THIS PROBLEM. CUSTOMER SERVICE AT ASUS ALSO VERY FLIPPANT AND UNHELPFUL.GHASTLY EXPERIENCE ALL WAYS ROUND", "Date": "January 7, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F0RD2H6"}}