{"Reviews": [{"Title": "The Best thing that will Replace my Ipad", "Author": "Rohit Singla", "ReviewID": "R2J0IGWMT5V6UV", "Overall": "5.0", "Content": "This is a sleek full functionality computer . I have a I pad, Surface, Galaxy tablet ,Toshiba laptop and a I mac.This Vaio has replaces my tablets in less than a week. I let the kids play on the tablets now.Cons :Battery life is small when compared to the tablets.Key board is not as friendly as a desktop or a Laptop.No place to store the stylet with the device. I will loose it shortly.Price is high.", "Date": "January 25, 2014"}, {"Title": "Ultrabook for my needs", "Author": "Thiwanka Wickramasooriya", "ReviewID": "R7389R997NOLU", "Overall": "5.0", "Content": "I am really happy with this ultrabook. I did not get any Wi-Fi problem as others mentioned. I am an Engineer and my wife being an Architect the digitizer styles is really useful in our work ( Most of the time this is used by my wife because its capability to free hand sketching).", "Date": "January 31, 2014"}, {"Title": "This will be the first computer I ever return to vendor in my life.", "Author": "M. Albitz", "ReviewID": "R283KWE41D3FRQ", "Overall": "1.0", "Content": "This thing is the sleekest, most beautiful and lightweight piece of useless garbage I have ever seen.It's got this awesome facial recognition feature for login that doesn't know who I am after a month of daily logging in and taking a new snapshot of me for its huge database of one user.It's got a nice little input pen for the touchscreen, since a 13 inch touchscreen in 1080p is too fine for anyone's finger unless they are a newborn baby. So it comes with a nice little stylus that you have to keep track of like a regular bic pen (cause I never ever lose those... I buy several dozen a year just to hoard them) and there is no where to slide it into on the body of the PC for safekeeping.The half size keyboard is exactly half as useful as a real keyboard. The tiny trackpad is just useless enough to make you glad you kept track of the stylus.The screen has exactly one angle when the damn thing isn't in tablet mode. I don't know what that angle is optimal for but so far I haven't found a comfortable sitting position I can view the screen from.So far this thing is next to useless for:MasturbatingEmailingSkypingAccountingSpreadsheetsEven casual web browsing is a pain in the ass since tiny links are near impossible to click.The rear camera is decent though so if you want to take crappy pictures with the world's most awkward camera then I guess it's a good buy.Oh, and the battery life is decent so it will last for all the extra time you spend on simple tasks that would be much faster on a real piece of hardware.If the screen angle was adjustable at all I would dock it to a regular mouse and keyboard but as it is it's just 100% useless for me, props to Amazon for a good return policy, and congrats to Sony for putting a huge amount of effort into a product that misses the mark in almost every meaningful way, creating a high performance machine that is nearly impossible to interact with.", "Date": "January 8, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Intel Intel Core i7 4500U 1.8 GHz\n8 GB\n128 GB Solid-State Drive\n13.3-Inch Screen, Intel HD Graphics 4400\nWindows 8.1", "Name": "Sony VAIO SVD1322DCXW 13.3-Inch Convertible 2 in 1 Touchscreen Ultrabook (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41yOjzLpdRL._SY300_.jpg", "ProductID": "B00FB45WGC"}}