{"Reviews": [{"Title": "Excellent so far", "Author": "Joshua Shrader", "ReviewID": "R1D7QSOD0KPWKJ", "Overall": "4.0", "Content": "I purchased this laptop on the 16th of October. Delivery was prompt. Purchase was fulfilled and shipped by Amazon, so that often helps. All necessary components were in the box, no missing pieces. Both the shipping box and laptop box were pristine so that encouraged me that the product wouldn't be damaged. Opened the box, removed packaging and plugged it in. Setup was really simple. Apps and updates took a half hour the first time turning it on, but since then no issues. Bought as replacement for my wife's older Toshiba Satellite. The lack of issues we had from that led me to purchase this one. Other than standard complaints surrounding Windows 8 usage, we've both been satisfied with the speed, weight and aesthetics of this unit. We'll likely be using this for household use mostly, streaming media and running a Etsy shop my wife started. I'm not sure I'd try to play high end games on it, and I may eventually replace the hard drive with a SSD, this is a great computer for recreational users. I would expect that more serious gamers and tech heavy professionals will need to spend a bit more money. I'll update this if I have any extraordinary issues.", "Date": "October 21, 2013"}, {"Title": "Once again a less then good experienc", "Author": "Robin Clark", "ReviewID": "R2007VFIV95Z5N", "Overall": "2.0", "Content": "This I purchased as a \"New' computor, imagine my surprise when I took it out of the box, plugged it in and it already had someone elses name and password in it.  I had already been through one bad experience, so I'm giving this one more chance with a different computor.  They are very good about returns, but I hate to have to return something agian, I want a computor that is what it says, and works out of the boc, we will see,,,,,", "Date": "October 24, 2013"}, {"Title": "DISAPPOINTED - TOUCHPAD DOES NOT WORK", "Author": "JMar", "ReviewID": "RKCLL5WSZTS4O", "Overall": "1.0", "Content": "I purchased this computer as a new computer.  Upon turning on the computer, the cursor never appeared so I determined that the touchpad does not work.  I completed setup using the tab key to select options.  After setup, I started looking at forums on this model and found to my horror that there are scores of complaints of the touchpad not working.  I went to the Toshiba support page which is not helpful at all.  None of the suggested fixes worked for my laptop. Using a USB mouse,  I tried to enable the touchpad; that did not work.  I reinstalled the driver; that did not work;  The device does not show up in the control panel.  The support page does not list an email address to which I can  send an email about my specific problem to Toshiba and receive a response.  Why are they still selling these defective machines.  It is a grave inconvenience to return this laptop.  I am so disappointed.  I think this will be my last Toshiba computer purchase!", "Date": "December 5, 2013"}, {"Title": "Toshiba Satellite laptop", "Author": "Grammie \"Grammie\"", "ReviewID": "R2HD5OPIMEKGV8", "Overall": "1.0", "Content": "This is, by far, the worst laptop I have ever owned!  I have spent countless hours troubleshooting various issues with this. It is NOT user friendly and I cannot impress upon you just what a total waste of time and money this was. Bottom line, don't but a Toshiba. Lousy products, even worse customer service. There are plenty of other companies out there that stand behind their products, read reviews and choose wisely", "Date": "December 13, 2013"}, {"Title": "Not bad", "Author": "hamed khanpour", "ReviewID": "R2AJXQ0KO380TU", "Overall": "4.0", "Content": "With the money I spent, it works well. However, I'm not comfortable with its \"Touch Pad\" and it's wireless not working well as I get limited connection several times even after re-installation of its driver that leads to a slower connection speed.", "Date": "December 25, 2013"}, {"Title": "Is this computer new?", "Author": "Ruben Hermann", "ReviewID": "R1LT4UF5BBLORX", "Overall": "5.0", "Content": "Is this Computer New? It is hard to believe such a cheap laptop being so good as i see it.", "Date": "November 24, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F9VPH3U"}}