{"Reviews": [{"Title": "Great replacement for an old desktop or laptop", "Author": "L. Craig \"Ur Mamal\"", "ReviewID": "R1XBQ10QC6UVY6", "Overall": "4.0", "Content": "Bought as a gift that will be used for web, email, running Office 365 (which it does NOT come with) and very light gaming or entertainment purposes. For that use, it seems like a great value.Pros:Display - 17.3 inch 1600x900 glossy display high contrast, colors look goodKeyboard - The size of this laptop allows a large (for a laptop) keyboard and it's comfortable to useDVD - Having a DVD drive built in is nice for installing anything not having to deal with a USB DVD driveSpeakers - Played some music through them & they sound great for laptop speakers but max volume is still a bit quietBuild/Packaging - Very happy with the apparent build quality & packaging and with how Amazon shipped itLenovo - The Lenovo web site is easy to navigate and find drivers/updates and I assume if you had a warranty issue between Lenovo and Amazon it'd be handled in a satisfactory mannerServiceability - Easily remove the entire bottom cover with only two screws to upgrade memory, hard drive, wireless, etcCons:Hard drive - The 500gb hard drive included is fairly slow but I replaced it with an SSD and that made a huge difference in boot times. Even with the slower hard drive, once booted, the laptop was perfectly usable but installing updates/rebooting was much slower.Memory - It only comes with 4GB (4GB x 1) so I added another 4GB I had from an old laptop in the second slotWindows 8.0 needs to be upgraded to 8.1 via the MS Store:It comes with Windows 8.0 and you really do want to upgrade to 8.1 first thing. Doing this requires that you create a Microsoft account, get on the store and have the store actually notice that you're eligible for a free 8.1 upgrade. Once you get it done, 8.1 + a start menu replacement (I'm using Classic Star which is free) is just fine. Actually using 8.1 working with this laptop has caused me to upgrade to 8.1 from Windows 7 on my own personal laptop because I do enjoy 8.1.Having to jump through hoops with the MS Store to actually get upgraded is a hassle. Also, if you'll be replacing the hard drive or if you ever want to just format/reinstall the OS, you don't have install media to do that with AND your Windows 8.0 with free 8.1 upgrade has a key buried in the UEFI BIOS. I used RW Everything to extract the key but even with that key, I wasn't able to proceed through a Windows 8.1 setup from scratch with a brand new Windows 8.1 Pro purchased through a discount I'm eligible for. I wound up just using the media & key that came with that new Windows 8.1 Pro - it didn't cost me much but buying a brand new Windows 8.1  so you'll have media/key adds a good bit to the cost under normal circumstances.Bottom line is that, hardware-wise, I'm impressed with what you get for your $ with this laptop. The display, keyboard and Lenovo name/support are great. Adding a little memory and even an SSD doesn't cost much and then the laptop is really great.If you happen to have access to Windows 8.1 media/keys for some reasonable cost then you're not left fiddling with the included 8.0-upgrade to 8.1 software and it becomes a great value. I have no problem with Windows 8.1 coming from Windows 7 and I'm enjoying using 8.1 on this and another laptop now and missing some features of 8.1 on my one remaining Windows 7 system (it'll be upgraded soon too.)", "Date": "December 17, 2013"}, {"Title": "Good value for money", "Author": "maxdaddy00005", "ReviewID": "R2DE8FH0O8V9WG", "Overall": "5.0", "Content": "I bought this item as a gift for my parents. The do not have real high demands for a computer, and this computer easily exceeds all of their requirements. There is a noticeable difference between the i5 processor and the i7 in my computer, but there is also a noticeable difference in the price. All in all, from what I could tell from a very limited time using it (while setting it up) it seems to be a lot of computer for a very reasonable price.", "Date": "December 28, 2013"}, {"Title": "Great value!", "Author": "M. Merrick \"magicuser\"", "ReviewID": "RSR2NV7ZAEFG9", "Overall": "5.0", "Content": "This is an excellent laptop for the price that I paid ($379.)  I bought two of these for my kids to use for school and general use (Internet, light gaming, etc.)  They are very happy with the large screen size and full-size keyboard.  The screen is bright and the viewing angle is fine.  Battery life is several hours; not too bad for a machine with a screen this big.Processor also seems to be adequate, as there have been no issues with lag or long waits.  And I have no quality issues after 3 months of use.Lenovo has a good reputation within my company, we use their machines in our office.Overall, very satisfied!", "Date": "February 10, 2014"}, {"Title": "Excellent computer", "Author": "Fulvia Marcela Salinas", "ReviewID": "R6LGLOT3LPAHT", "Overall": "5.0", "Content": "I was not expecting the quality of this computer.  Love it!!  the size is perfect for me and the price.", "Date": "January 14, 2014"}, {"Title": "love it", "Author": "neil wilson III", "ReviewID": "R1L2UVE1SY3IYV", "Overall": "5.0", "Content": "it exceed my expectations, it is well made and family have asked me about the product, the power cord is unike looks like a usb cable only it is the power cord i would recommend to my friends and family! Great Product", "Date": "December 24, 2013"}, {"Title": "Windows 8 is problem", "Author": "Dorance I.", "ReviewID": "R1SEJJUD0HOCN5", "Overall": "2.0", "Content": "I can not understand leaving thins status quo.Windows 8 is confusing & rambling. I have a newscreen once a month I now cannot get to tools ithas become so confusing.", "Date": "June 3, 2014"}, {"Title": "Not worth it!", "Author": "darren m.", "ReviewID": "R3C070EO1QMHHE", "Overall": "1.0", "Content": "I decided to go against my norm and bought a lenovo. I have previously owned two toshiba laptops and they have performed well over their life spans of three and two years respectively. However, this purchase has left me wondering why i decided to switch brands. The battery will not charge in the laptop at all. Both charger and battery have been placed in a similar unit and no problem, however no luck with it working in mine. The laptop will only run with the charger plugged in or if i charge the battery in another laptop. Numerous calls and e-mails to lenovo will not help. Please stay away, their customer service is almost non-existent. Save yourself the trouble and look for a laptop somewhere else.", "Date": "May 5, 2014"}, {"Title": "Got it!", "Author": "Georgia Njagu \"Georgia B. Njagu\"", "ReviewID": "R1ZOLHWAWRJBUO", "Overall": "5.0", "Content": "Greetings, The Division of Radiologic Sciences at UNC at Chapel Hill seem to be well pleased with their purchase.  Thank you!", "Date": "April 21, 2014"}, {"Title": "Lenovo Computer", "Author": "Sherry L Freund", "ReviewID": "R3RXQTFXWXAEZV", "Overall": "5.0", "Content": "Great computer, very fast delivery of this item, and would recommend this computer brand to anyone looking for a good computer.  Lenovo is rated at the top of computer names for the good quality parts they use.", "Date": "April 9, 2014"}, {"Title": "A gift for my daughter", "Author": "Connie", "ReviewID": "R187ID1NTLVUJK", "Overall": "5.0", "Content": "It was a gift for my daughter and she has been enjoying it . The performance is all that the reviews on youtube said it would be although we have only had it a few months .", "Date": "March 24, 2014"}, {"Title": "Love it", "Author": "Marie Bailey", "ReviewID": "R1IOM81WCBC7OV", "Overall": "5.0", "Content": "I like the large screen and how quiet it is compared to my last.  My first experience with Windows 8.  Still learning", "Date": "February 5, 2014"}, {"Title": "LOUSY KEYBOARD, BIZARRE TOUCHPAD, AVERAGE SCREEN", "Author": "Bob Schatan \"Bob's Adventures\"", "ReviewID": "R2583V0AWMFJCA", "Overall": "1.0", "Content": "Lenovo's reputation for quality comes from its' association with IBM products. That's the reason I bought this laptop. What surprised me was that the keyboard frequently skips letters when typing at speed, many different ones. I type anywhere between 70 and 100 wpm and this going back and correcting everything over and over was very time consuming and surprising. The other thing that surprised me was the touchpad; every time that the heel of my hands touched the thing the cursor would go flying off across the view screen or it would bizarrely highlight various parts of the text or the screen. I don't believe this is a defect but a built in flaw in the design. Both of these problems have never happened with Toshiba, Dell, HP, Compaq, ASUS or other computers I've used in the past.Another very annoying aspect of the touchpad was that the Windows 8.0 side bar would show up without any prompting and stop the cursor until a double tap on the touchpad freed it up stalling the typing process. This too was lousy.The screen for viewing was average, not great and the sound seemed somewhat harsh compared to other laptops I've used.We deleted all the personal data, boxed it up and sent it back to Amazon.com for a refund. I've replaced it with a Dell laptop which is functioning perfectly in all the areas where the Lenovo has failed. In addition, my experience with their customer service over the phone was surprising and excellent. Lenovo's wasn't when I contacted them.Amazon also was helpful, polite and responsive quickly.", "Date": "January 17, 2014"}, {"Title": "windows 8", "Author": "donald  dabb", "ReviewID": "R2AV1I5KMRLVRE", "Overall": "5.0", "Content": "don't like windows 8,would liked to stay with window 7,can I change to windows 7??? let me no , thanks don", "Date": "January 8, 2014"}, {"Title": "Decent Computer but Abysmal Software.", "Author": "S. A. ROBBINS \"shirley_rw\"", "ReviewID": "R262VIQVP0N47V", "Overall": "2.0", "Content": "This is a really nice well equipped Laptop Computer. It even has an HDMI output which at this price was surprising. One problem is that the case is very slippery and I almost dropped the computer. Be very careful when handling it. The screen is large and bright (once you figure out how to turn the brightness back on). I am not sure why the Brightness was turned off in the first place as I'm running on AC power not Battery. I also had to adjust the cursor/mouse pad as it didn't work very good out of the box and was slow and seemed to hangup. After adjusting it (from Control Panel), it seems to work ok now. The computer has excellent graphics, well equipped with 4gb of memory and a 500gb hard drive.Overall a very good value in a Laptop Computer if you can live with Win8.This will be the last Windows computer I ever buy and regret having bought this one. If I could buy a 17\" Android Laptop, I would. I would have bought a Mac but too expensive. Win8 is why Microsoft will go out of business. I have used every version of Windows all the way back to Win3. Win Vista was a mistake but Win7 fixed the mistakes and is a decent OS. It is not administrator friendly as WinXP was but it is stable and rarely crashes. Win8 is Microsoft's attempt to match the success of the Android OS and missed by a country mile.The G700 is a nice reasonably priced computer with decent features but what good is that if it is difficult and time wasting to use? I am really surprised that the PC manufacturers allowed Microsoft to essentially destroy the Windows PC market. My next PC will either be another tablet with a bigger screen attached or a Mac.I have spent the last 5 hours updating and fixing this computer. First problem was that I could not update to Win 8.1, I had to force the G700 to Update Now to the 74 updates waiting for Win8. Then I was finally able to find the Win 8.1 Update App in the Windows store (now that was really intuitive - NOT). It is still setting up Win 8.1.Overall the ridiculousness, time wasting and difficulty of Win8 overrides whatever positive features this computer has. If you are one of the few that likes Win8 then you might really like the G700, it is really good value for the money.To confirm my opinion of Win8, Either Lenovo or HP has announced that you can now buy their computers with Win7 instead of Win8 and it will be $150 cheaper too.", "Date": "December 14, 2013"}, {"Title": "The keyboard has been a problem", "Author": "Buzz  Buzzard", "ReviewID": "R2SXIST16FJAAJ", "Overall": "3.0", "Content": "I'm a really fast typist, given that I've been doing it since I was a child---so, about 30 years. I've used many keyboards and laptops over the years, including two Lenovos, two Dells, and a Mac in the past 10. The keyboards always entail subtle differences that require a couple days of adjustment. Not with this one. It's taken weeks.I don't like having to look at the keyboard to know what I'm typing. With this laptop, I often have to. The arrow keys, backspace, delete, and PgUp and PgDn keys aren't anywhere near where I'm used to having them. And yes, I know that a 17-inch monitor often includes the numeric keypad that smaller ones don't. But I don't need it, so it complicates the tasks required of my apparently simple mind.The system itself is great, very quick, No complaints aside from the inane design of Windows 8.0/8.1, and that's not the fault of Lenovo. But I'm an impatient editor, and I can't abide typos.", "Date": "January 11, 2014"}, {"Title": "Computer has been great but did not come with a battery", "Author": "VTGuy", "ReviewID": "R1442C34BTBKVN", "Overall": "2.0", "Content": "This computer was purchased and sent to an older relative in another state.The computer has worked well, although the new Windows operating system proved difficult for this person to learn.  The only criticism I have is that the computer was shipped to my mother without a battery; seems hard to believe, but that is what happened.  In an age where companies do not keep inventory, but contract directly with manufacturers to ship products to customers, it has proved difficult to get a replacement battery.  I do not blame the company I purchased this computer from, but nevertheless my relative still does not have a battery; the person just keeps the computer plugged in.", "Date": "March 6, 2014"}, {"Title": "Lenovo os 8", "Author": "Rebasweets \"Becky Royals\"", "ReviewID": "R23RC2MDFM1T9W", "Overall": "4.0", "Content": "Great product first time purchasing a Lenovo,, use to dell and Hp products.. adjusting to windows 8 which I do not recommend...", "Date": "January 20, 2014"}, {"Title": "ok", "Author": "FL", "ReviewID": "RLHC34OJ6XX8E", "Overall": "4.0", "Content": "Good price however I was disappointed to find out the product is made in China and put together in US, also when I downloaded the update for windows 8.1 there was a problem which has been fixed by Microsoft", "Date": "November 19, 2013"}], "ProductInfo": {"Price": "$498.99", "Features": "Intel Pentium Dual-Core 2030M 2.5 GHz Processor (2 MB Cache)\n4 GB DDR3 RAM\n500 GB 5400 rpm Hard Drive\nNon-Touchscreen 17.3-Inch Display, Integrated Intel HD Graphics\nWindows 8, 5-hour battery life", "Name": "Lenovo G700 17.3-Inch Laptop (59385692)", "ImgURL": "http://ecx.images-amazon.com/images/I/51qdq1gav%2BL._SX300_.jpg", "ProductID": "B00F0RBYTO"}}