{"Reviews": [{"Title": "Asus X552E delivered all that I wanted and more", "Author": "Susan Long", "ReviewID": "R2QVKCU3FL141", "Overall": "5.0", "Content": "I was looking for a laptop that was both fast and affordable. Asus met both of those needs. The screen is extremely clear and the speakers work great. I often have as many as 10 screens open at a time and the computer still works fine. I don't usually use the webcam but did just to try it out and was told that the picture came out great. It looked good from my end also. My son listened to music while playing a game and said that he did not encounter any problems. If you are looking for a good laptop with lots of memory and good features for less than $500.00, then this is your best bet.", "Date": "January 12, 2014"}, {"Title": "good budget laptop", "Author": "Jason K.", "ReviewID": "RND8AEXFPQM9P", "Overall": "4.0", "Content": "I should disclose that for the last 12 years or so, my primary computer devices have all been Macs.  I do use Windows laptops for work but prefer the Mac for personal use.  I needed to find a budget laptop for a member of the family that could run Office and Quickbooks.  I liked that the ASUS has 8GB of RAM and the touchscreen was not needed so this one fit what we were looking for.I ran all of the updates, installed Office and Quickbooks and all seem to run fine.  If you need a laptop for checking e-mail, social media, You Tube, etc. as well as Office and other productivity Apps, this should be just fine for you.  I did not need a gaming machine, nor would I think these specs would be good for that.The keyboard is easy to type on, the screen has a decent resolution, and the brushed finish is not as fingerprint prone as some other brands in this price point.  I also like the size of the chargers that ASUS uses, very much like the Mac brick, easy to throw in the bag.I think with realistic expectations, this should be a good laptop for the average user.  If you are a marathon gamer or want to do advanced video and photo editing, you are not going to find the performance you are looking for with this ASUS or really any other laptop priced around $500.00.", "Date": "February 8, 2014"}, {"Title": "Very reliable with Asus motherboard quality", "Author": "Frederick E. Schuepfer \"fredsc111\"", "ReviewID": "R22A9J1T1Z5WMF", "Overall": "4.0", "Content": "This machine is reasonably fast, works well and was economical.  Has DVD-R which is a plus.  Nice size screen.  I hate Windows 8 but that's life.", "Date": "May 23, 2014"}, {"Title": "I love it", "Author": "Lynzi Dicus", "ReviewID": "R35SAU6RSZ98B3", "Overall": "5.0", "Content": "My mom had an Asus laptop and she said she loved hers, so I ordered myself this one. It is so incredibly quick, I love the features and everything about it. Its a great purchase! You eon't be disappointed. Screen is huge and clear. My boyfriend has a mac and I would say this one is right there with it.", "Date": "April 21, 2014"}, {"Title": "nice laptop", "Author": "Andrea Repp", "ReviewID": "R37RO1UJWKQCM9", "Overall": "4.0", "Content": "i have not had this too long so i will edit this if i encounter anything more....this is a pretty good laptop, not high end but does the job.  i use it to get my email, surf, and play games when i'm out of town.  at home i use it as a cookbook and to hook our TV up to the internet so we can watch stuff.the only problems i've had so far is that the space bar is either sticking or not as responsive to my fast typing as i would like.  also, you have to watch how you wave your digits around when typing so you don't touch the touchpad.  not really a problem once you are aware of it.  but a little annoying until you get used to it.", "Date": "April 21, 2014"}, {"Title": "New to Windows 8", "Author": "Chuck Boice", "ReviewID": "RJ03X7CPIUE2G", "Overall": "5.0", "Content": "The laptop works well, still adjusting to Windows 8. Fast processor, beautiful graphics. I would recommend to family and friends.", "Date": "February 5, 2014"}, {"Title": "decent machine", "Author": "petey", "ReviewID": "RY7MEARU5DUAV", "Overall": "4.0", "Content": "Bought this to test it out and see if it would run the games I play, does just fine, runs Lord of the rings online just fine,the switch from xp to windows 8 has been allot of learning, but so far like it pretty well.", "Date": "June 8, 2014"}, {"Title": "Great product", "Author": "Amanda Dix", "ReviewID": "R3UG4ATQQ6HSSJ", "Overall": "4.0", "Content": "My laptop was delivered the first day I expected it. The packaging wasn't damaged and everything was accounted for. Though the battery pack tends to get loose every now and then, I have no major problems and am very pleased with this product.", "Date": "June 7, 2014"}, {"Title": "Fast and powerful but a tricky touchpad", "Author": "Matthew Pfluger", "ReviewID": "R1CAFBFFZV3BHK", "Overall": "4.0", "Content": "I like that this model has quality specs from a reliable manufacturer, and the setup out of the box was incredibly simple.  It took about two hours to get all the updates to apps and Windows 8.1, but that is to be expected.My biggest complaint about this model is that the touchpad is difficult to use.  It's harder to click than I'd like it to be, and clicking it usually causes me to move the cursor just prior to clicking.  This movement causes the clicks to not always work without being rather deliberate.  It's something I'm getting used to and can be resolved with the purchase of a quality wireless mouse, but future users should know about it.", "Date": "May 28, 2014"}, {"Title": "Positive First Impression", "Author": "DolphinBlue", "ReviewID": "R2RHUZNUSXOTWC", "Overall": "4.0", "Content": "I had 15\" laptops for years until a year ago, when I tried the Lenovo Twist.  What a costly ($867) mistake that turned out to be.  I wanted the best of both worlds (work productivity and web surfing), but got the worst.  A much better decision would have been to stick with the larger laptop for work and add a smaller tablet, such as the Kindle Fire, which I did ultimately get. Now that I have a separate tablet, the purpose of a laptop for me is primarily work (connecting via a VPN to my work computer, and reviewing large Excel files, Word files, and PDFs).  I went back to a 15\" laptop for the larger screen size and numeric keypad.  Costs less than a tablet as well.  My primary desire was for 8 GB of RAM, and I spent little time comparing processer clock speeds and the like.  I used to do that and you can spend hours and find out little, so this time I just ignored the processor and focused on other features.On to the review.  In comparision to tablets, this machine is of course somewhat heavier (though not as heavy as my prior 15\" laptop), but has a numeric keypad and built-in optical drive, which I found I missed with the Twist.  Positives and negatives below are compared to my prior full-size laptops.POSITIVES:- Fast startup from sleep mode- Runs very cool- Plenty of processor speed- Touchscreen functionality in mouse (scroll, pinch, zoom)NEGATIVES:- Bulky power connection at outlet (which I think provides the benefit of less heat from the laptop)- Two hard drives (c: for OS and d: for data) for no apparent benefitOverall, I'm very pleased so far. especially at $399.  Give it a few months and I'll find the negatives, I'm sure.  My previous 15\" laptop, a Toshiba Satellite, ran very hot and the fan was constantly making noise.  This machine is quiet and cool, and I love how fast it wakes up from sleep.  Wake-up speed was a supposed benefit of the Lenovo Twist, which had a separate solid-state drive, but it was sometimes as slow as a traditional laptop.  I also find I don't miss the touchscreen at all, especially with the functionality in the Asus touchpad. It did take a few minutes to find out where to turn off the dreaded \"charms\" edge scroll (having the vertical menu pop up on the right of the screen), which is so easy to accidentally trip, but I found it in a Google search.  Asus should move that functionality to the \"mouse\" function in the control panel rather than having it accessed from the system tray. Asus also provided 2 hard drives, \"c:\" for the OS and \"d:\" for \"data\".  Yet \"c:\" has ~124 GB open (of the nominal 500 GB total which actually is more like 444 GB). Nevertheless, it still has the traditional Windows Explorer setup, with \"My Documents\" including music and pictures on the c: drive, so it will be interesting when/if I run out of space on c:.  Would be awkward to have music, for example, on both c: and d: instead of all in one folder.  Not sure why Asus did this.I'll update the review if/when warranted.", "Date": "May 13, 2014"}, {"Title": "graet product.", "Author": "reyes", "ReviewID": "R2ZCQS2JZPIL9W", "Overall": "5.0", "Content": "this is a great machine for many years i have purchased hp but this really was what i were looking for, very fast poweron and shut off.great speed when streaming live contents.i am using this for media system with roku 3,i highly recommend this model..", "Date": "April 22, 2014"}, {"Title": "Not as good as I had expected.", "Author": "Susannah W. Shakow", "ReviewID": "R22E3NUCNIXK1V", "Overall": "3.0", "Content": "I thought that this computer would be perfect for me, 8 gigabits of RAM, 15.6 inch screen, AMD processors... but it was not that good. I am typing the report on it now, but I am going to return it later. it is laggy, and games that I want to play don't run fast. the internet is pretty good, but I really wanted it for the gaming.", "Date": "January 4, 2014"}, {"Title": "Do Not Buy This Laptop If You Don't Want Your Money and Time Wasted", "Author": "Ethan", "ReviewID": "R1DKINB1YMALQI", "Overall": "1.0", "Content": "Right out of the box the headphone jack is broken. It works for a little while, unplug and plug back in, sound is coming out of the speakers. This is 3rd laptop I've bought recently that has had problems like this. The other two were not ASUS. Buyer beware.", "Date": "January 22, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F0RD9QA"}}