{"Reviews": [{"Title": "Get Online and Working Almost Immediately", "Author": "kaizenlpi", "ReviewID": "RWX1BLZP3UEDH", "Overall": "5.0", "Content": "As someone who has re-imaged hundreds of Windows computers with their operating systems, I can tell you the Chromebook will give you some peace of mind. You'll never rebuild this computer because it runs Google's Chrome OS. You don't worry about malware and viruses because Google's OS has the protection built in. Google takes care of all the computer administration with the OS and browser, so you don't have to like you would in Windows, Mac, or in Linux, which are all operating systems I've used at one point.Over the past seven years I evolved into working in the Cloud everyday. The Chromebook works for me because I can focus on what I want to work on every day and not waste my time with intermittent IT admin type tasks that arise unexpectedly like defragmenting a disk, fixing a corrupted Windows registry hive, or fixing file permissions on my computer due to some obscure issue. I don't waste time backing up my data with an external HD or in Carbonite because the data is saved in the Cloud. With that said, you should turn on 2 Step Authentication with Google for extra security and to practice good security habits.I love these things about my Chromebook:1. Super fast boot-up time! I love getting to work RIGHT away.2. The Chrome taskbar at the bottom looks like the Windows 7 taskbar, which I customized for my key applications that I use everyday.3. Apps - Kindle Cloud Reader, Google Keep, Drive, Calendar, Google Music, Youtube, Gmail, TechSmith SnagIt.4. Battery life of up to 8.5 hours.5. No more rebuilding the computer, backing up data, fixing crazy windows OS or software issues, fixing file system corruption issues equals less stress and time spent and more time spent doing the things I love on the Chromebook. I have WAY more peace of mind. ( I recently rebuilt my Office Windows 7 Pro computer, backed it up, took an image of the build, and this took about 6 hours total).7. Price. $349 for this is a reasonable deal. I'm happy I didn't go with a Windows 8 ultrabook and spent at least double what I paid for this Chromebook. I have also experienced people losing their laptops, dropping their laptops, or having their laptops stolen while staying at hotels, so if one of these unfortunate things happen to you, at least you know you only lost $349 vs $500-$1000 with a typical Windows laptop!This is the first laptop I've bought in five years, and the Chromebook has convinced me that it's a game changer for my daily work flows.  I highly recommend this Chromebook. Google's mobile computing vision is very progressive and forward thinking, which works perfect for me.", "Date": "November 20, 2013"}, {"Title": "I'm Scroogled & MicroSoft Should be Quaking In Their Boots!", "Author": "Nicholas Winn \"E-Bike Enthusiast\"", "ReviewID": "R2FQ6BHYJDD1RZ", "Overall": "5.0", "Content": "01/20/2014 Update This weekend my daughter asked me for a HDMI Cable. I asked why and she said that she wanted to play some web content on our 55\" Widescreen T.V. She hooked it up and the movies played and looked georgous. I'm going to upgrade to 6 stars.+++++++++++++++++++++++++++++++++++++++++++++++I thoroughly researched Chromebooks before making this purchase but was skeptical of the rave reviews. Seeing is believing.You can go to the HP Spec Page and read all the specs, so my review is about my impressions.I bought this as a Christmas gift for my daughter and I'm absolutely blown away. I just set it up for her, so on Christmas Morning she'll open it up and be up and running. This was the quickest easiest setup ever. The new Logitech Wireless Mouse Logitech Wireless Mouse M325 with Designed-for-Web Scrolling - White Paisleywas instantly recognized.The 64gb Sdxram card B00E83XHXM instantly recognized but would glitch when I tried to name a file. Simply reformatted on chrome machine and the problem went away.Speed:Every low end windows laptop that I've ever tried has been laggy.Not the HP 14 Chromebook, the Intel CPU and the 4gb Ram make the difference. This Laptop is zippy. I tested out Netflix and Hulu and they both ran flawlessly. Had plenty of tabs open without performance degradationErgonomics:The feel. Everything is rubber coated including the keys, even though this Laptop is low price it doesn't feel like it. The Keyboard just felt nice. The Trackpad is amazing, once you learn the Chrome Commands. 2 finger scrolls up and down. Hold 2 fingers down for right click. It is so darned intelligent. The Pearl color is elegant and the laptop looks far more expensive then it's price. I asked a coworker to play with it and she concurred. This definitely doesn't look or feel cheap.Monitor, while not stellar is certainly adequate, I did not feel like I was looking at a low resolution monitor. It was regular. Speakers yes Tinny but hey what do you expect for$340.00Neutral: Having a 14\" Monitor and all the extras like Intel CPU, HDMI Port, USB Ports, SD Card Port and solid construction adds weight. For example the hinge for the screen is one piece going along 3/4 of the width of the screen, if it was not manufactured with weight in mind then they could have made it flimsier and lighter. More components, quality construction will add extra weight. So it is 4 pounds, plenty light for a teenager or me, If you are not looking for a full blown system and desire more of a tablet like device, then this might not be for you. I'm not taking off a star because realistically life is a series of tradeoffs.Turns out that Microsoft's scorch campaign about the Laptop being a brick when not online is BXXXXshxxxtGoogle office runs, the native movie and music player runs, and with a 64gb Sd Ram card with 9 hours of life you can watch movies, listen to music, take notes, write a paper and make a spread sheet. All the basics. OFFLINEThe equivalent performance in a Windows Machine would cost me at least double and Apple Triple.If I was Microsoft I'd be quaking in my boots.", "Date": "December 17, 2013"}, {"Title": "Come on over to the Chrome side of life.", "Author": "Jacks", "ReviewID": "R1AIPBDJSEW0OU", "Overall": "5.0", "Content": "I didn't buy mine here, the reason being at the time Amazon didn't have them. That said, the only word to describe this is WOW. I'm a 56 year old granny and this computer is everything I need with plenty left over. It's fast and it has a good feel to it. I've already send all my files over to my free (at lease for 2 years) Google Drive, which went very smoothly.  I've had no trouble with apps or crashes. Netflix, YouTube and Amazon prime video's play very well. The colors that this Chromebook comes in are a nice bonus (no more black thank you). It seems the Snow white one is most popular followed by the Coral Peach with the Ocean Turquoise coming in last. I wanted the Coral Peach which was sold out so I ended with the Ocean Turquoise being the last one anywhere to be had. The picture on the box looks green, but to my nice surprise turned out to be a very nice sky blue. The T-Moble  4G would be nice if I lived in a area that could pick it up but alas I don't but it wasn't a selling point for me anyway. The selling points being, I have the first HP Chromebook and found how nice life could be without constant updates and which anti virus is going to save me today. With Chromebook turn off, turn on and it's updated. This is a amazing computer that's only going to get better. As I said WOW....Oh Yeah anyone want to buy my other computer that's not a Chrombook?", "Date": "November 4, 2013"}, {"Title": "I love my Chromebook 14.... light and fast, great battery life, screen is only downside", "Author": "Goldengate \"Goldengate\"", "ReviewID": "R2XUDHNGY7OYTB", "Overall": "5.0", "Content": "It appears Amazon has just started selling these this week.  I bought mine a couple of weeks ago when it appears that a big box retailer with the initials WM that rhymes with CART seemed to have the exclusive.  I am typing this on my Chromebook 14 (snow white color) using the free T-mobile 3G internet connection as I'm nowhere near a WIFI spot.  This is a great laptop for checking email, Facebook, listening to Pandora, and of course browsing the web.  If you are looking for a computer to do spreadsheets and video production, this is NOT your computer, but if you want something to sit on the kitchen counter and quickly surf the web, this is a good candidate.  Also a great idea for your parents or those who don't really want to spend ANY time updating or maintaining their computer.  You just turn this thing on and 5 seconds later it's on and working.  It updates itself and you don't have to worry about viruses etc since it's the Chrome operating system.  Here are my pro's and con's:Pro's:- Nice keyboard.  Some have criticized it but I find it has a nice \"spring\" to it and has comfortable spacing.- Battery life:  I charge mine every 2-3 days... my battery seems to last forever, but it's only 8 hours.  That's a lot longer than any other laptop I've owned.- Included GO GO internet (12 sessions) means you can surf the web for free when you fly an airline (like American) that features GOGO service.  Note this is 12 flights, not 12 all-day passes, so if you have two flights in one day you use 2 of your credits.  Extremely easy to use by the way, you just open the Chromebook on the plane and it guides you through the process.- 100 GB Google cloud drive storage, for storing documents photos etc in the Google cloud.  I haven't used this much since I use my other computers for word processing etc.- Google Apps:  Yes, you can use their free version of \"Office\" to build spreadsheets and word processing documents.  It's all cloud based and online.- SUPER FAST- I should have put this as the #1 pro...but literally it \"boots up\" in about 3 seconds... it has a solid state drive (no moving parts) and 4 GB of memory (unlike the non T-mobile version which just has 2 GB of memory) which makes this processor fly.  I have 11 tabs open right now.- Google connected: Once you input your gmail password, it syncs to your desktop and copies over the bookmarks etc.- EASY.  It's like an iPhone.  It just works.  There's no troubleshooting or figuring things out.  The out of the box experience is great - you just turn it on and you're on.Con's:-  THE SCREEN.  This is a big one but not a show stopper for me.  The Chromebook 11 has a GORGEOUS IPS screen with a 176 degree viewing angle.  I think originally this one was supposed to as well because some of the marketing materials indicate the 14 has an IPS screen.  It does not.  The viewing angle is pretty terrible if you're sitting to the side. You have to look at it dead on.  As I'm typing this I tilted to the left and at about the 10 o'clock position of my head you start to not be able to see the screen.  I called HP today and validated with them that the 14 does NOT have the IPS screen.  Having said that, this screen is fine for email web etc but if you are hoping to use it to watch Netflix with friends, forget it, you'd have to sit on each other's laps.  Depending on your friends that might not be such a good idea.- The weight.  I know, it's a cheap laptop, and it has lots of pro's, but it's about half pound heavier than I'd like it to be.  When I put it in my bag I really feel it.  It's not like one of those $1500 apple laptops (though it looks a little like one...) that's razor thin and air light.  But HELLO this is a fraction of the cost.- No keyboard backlight.  Not an issue for me but some might not like that you have to have the lights on to see  the keyboard at night.Chromebooks aren't for everyone, but if you're looking for an easy way to get on the web, this is a great option for you.  I really like mine a lot, despite the aforementioned display weakness.  I imagine they were trying to save $$ and hit a price-point when they chose not to put an IPS display in the 14... that's too bad.  But I still love my Chromebook.Hope this helps.Hope this helps!", "Date": "November 12, 2013"}, {"Title": "Mixed Bag", "Author": "G. Nolan \"Get out there!\"", "ReviewID": "RTLOWDNFO25AM", "Overall": "4.0", "Content": "I think any one who orders this needs to understand this is like a beta product. We the early adopters are really just testers of a new technology. Having said that, I have no doubts this is the way of the future so I guess we may as well get on the train and start learning so we can appreciate new developments as they come.  This month I was re-installing windows which seems to be a yearly ritual as it starts running slow and gets glitchy after a while. I think I have had to re-install windows every year or more on every windows machine I have owned.  While doing my yearly re-install I was pondering how much I loved my android phone; it just works. I was wishing they made an android computer. So I went to my trusty Amazon site and searched android PC; not expecting much. Well Chromebooks popped up and I had looked at them a year or so ago and read a bit but at that time they were all pretty small tablet devices. When I saw they were making a 14 inch laptop that actually had connectivity and some usb ports etc I caved and ordered one.  I am so glad I did I love my Chromebook and certainly see the many benefits as well as some early adopter drawbacks.Pros:*No windows system which means no bloat, no updates, no viruses, no virus protector, no malware protectors, no endless settings, no endless services, and not 1001 things that can go wrong on any given day on a very complex and large operating system sitting on your own computer.*I loved Rhapsody at first blush and have used it for many years since the beginning. What I loved about Rhapsody Is having all my music in the cloud. With Chromebook the concept of cloud is extended to pretty much all of my computing. I don't have to worry about lost documents or my windows computer crashing and taking everything with it.*No endless high priced programs to buy. I loved MS Office I think it is a fine product but each rendition becomes in typical MS fashion more complex and hard to use. Google office is still pretty easy and straight forward. It does take a bit of learning to become comfortable with cloud docs.*Fast. My Chromebook is fast. I typically open about 60 web pages each morning. I think my Chromebook actually does this better than my 8 core AMD processor. I say that because it is just as fast, maybe faster. But the big difference is the fans and system does not start moaning groaning. Chromebook just opens up like a dog being fed a piece of sirloin.*Bluetooth works great and my wireless keyboard and mouse work fine with Chromebook.*Connecting to a bigger screen was not a problem. I was a bit worried I would not like the 14 inch screen after using a 24 inch screen. Really I do not miss it but if I do, it does connect and I can use my big screen without missing a beat. Also by connecting to a bigger screen I can much better HD screen.*Settings. I love the simple settings (listen up Google and MS). I was sick of the MS system of endless settings and services. When I opened up MS controls there were endless icons each with endless settings. MS and Google would both be well advised to read the book The Paradox of Choice. Endless choices are paralyzing and add little to user enjoyment.  At this point Chromebook has a few simple and easy to understand essential settings.Cons:I got what I expected almost.*The screen is not that brilliant compared to a good HD screen. It is totally serviceable and had I had to pay another 50 bucks for a brilliant screen I may not be typing a review for a Chromebook so I am fine with the screen.*Not much HD memory but I can attach a large USB thumb drive if I really need more. Most of my music and photos are on a terabyte drive so I doubt that I will really miss the memory much as I get accustomed to not using it.*I think the biggest surprise and con (listen up Google) is it cannot connect to my wireless printer which is less than two years old. In order to connect to a printer that is not a newer printer that is Google cloud capable a person needs a windows machine or an apple machine to connect the Chromebook to a wireless printer. I thought the idea of a Chromebook was to get away from windows. Common google my printer is wireless. Is it really that hard to figure out how to connect to it without a new printer or a windows machine. I find that totally irritating. I guess I will do all my printing off of my windows machine until my printer craps out.*I do day trading and Chromebook will not run the web based programs because the programs require Oracle services. I kinda figured my Chromebook would not run them  as I knew I could not do a Oracle download to Chromebook. Listen up Google. I would really like to see you partner with OandA and figure out how to run financial programs without Oracle or figure out how to incorporate Oracle in your cloud-base OS.Well that is a quick rundown and my initial impressions after using the Chromebook for a few days. I love being able to go to my easy chair and surf the web. I just wish I could get totally away from windows but the Chromebook or more pointedly, the Chrome OS needs to go through a few more generations before it will be the only computer OS I need.Update March 2014. I still love my Chromebook but the thing I really miss is a lighted keyboard. I have not used a laptop regularly for years until I got my chromebook. Now I am on it all the time in my easy chair. I find myself taking my hands off the keyboard to mouse then never get them indexed right in the dark. Knowing how much I use this little guy and how often I am in the dark while using it I would have gladly paid significantly more for a lit keyboard.", "Date": "December 25, 2013"}, {"Title": "This is an amazing machine; a pleasant experience", "Author": "NEWKINDLEUSER", "ReviewID": "R173Q4GFGF2LIK", "Overall": "5.0", "Content": "I've been a Mac guy since I got my Macbook Pro in the summer of 2011.  And I'm still a Mac guy no doubt.  But after having used many computers from WIndows 8 laptops to the Chromebook, I'm going to say this is my #2 computer.  Nothing will replace my Macbook Pro, but this Chromebook is a very close second.The positives about this are many.  The Tmobile radio built in means you get 4GB of RAM instead of only 2GB of RAM when you buy the non-Tmobile radio version.  That alone makes the $50 seem inconsequential.  Tmobile is giving away 200MB a month of free data, for at least 2 years.  That is really cool for those times you are in a pinch and need to connect for an email or something and aren't near WIFI.  I'd say the battery life at 7 or 8 hours is very reasonable.  The keyboard is a pleasure to type on.  And the trackpad is the only trackpad that actually works great other than the Macbook Pro.  The trackpad cannot be overstated; having tried many, most are unusable and some are okay but not consistent.  This trackpad works great!  The screen is big and bright, and while not the quality of a Macbook Pro, it is good.  Getting the right viewing angle (tilted back like it is supposed to be) makes it as good as it can be.The negatives of this are only a few.  Printing is impossible unless you have a printer plugged into a home computer and setup the Google Cloud Print, or buy a Google Cloud Printer.  It isn't often I print but when I do, it is frustrating.  Some websites don't like Chrome and that can cause frustrations as well.  And really the most important thing I can say is that this is a Chromebook, not a traditional computer.  Everything lives in a browser.  And once you get past that, it is okay.Once you realize the shortcomings (printing for example) there are workarounds.  You can hit CTRL P and package your page into a PDF so it can be emailed to a computer at home that has a printer.  Or that you can do just about everything you can do with a computer with this via a browser or an extension into the browser, makes the idea of a browser based computer okay.  There is an \"offline\" mode so you can review/create/etc. some documents and such when not connected to the web.I'd say that if you want to spend $350 for this vs. $1200 for a Macbook Pro, you'll get most of the good experience you'd get out of something more expensive.  For me, I just browse the web, send some emails, and every once in awhile edit a document or spreadsheet and this computer does the job.There is no onboard email client, again, this is all done through a browser.  I miss my email client, but I can live with this idea of checking emails by signing in on the two different sites that host my email.  I can save the username and password so clicking a link on the browser bar and it loads me right to my inbox.  Google also offers lots of great things, like Gmail, Google Drive for storing documents and pictures, Google Voice so you can take/make phone calls and texts, and there are many more services I don't even use.I tried a Chromebook a year ago or so and it wasn't something I could get into.  The screens were small and weak.  The problem with offline services hadn't been figured out yet.  But all of that is in the past.  I'd say that this is an awesome value and you won't be disappointed.  Funny, someone saw me using this and said \"Hey is that a color hard shell for your Macbook Pro?\"  I had to show them that this wasn't a Macbook Pro.  It looks that good.  And while this is plastic, it feels solid and not cheesy like other laptops that creak and click as you use them.Go ahead, if you are on the fence about this, you won't be disappointed.", "Date": "December 27, 2013"}, {"Title": "Best device in the last 10 years", "Author": "L. Sowder", "ReviewID": "R3RXOKTT8RPY0A", "Overall": "5.0", "Content": "To preface, I have been a very long time user of Windows, in fact I was using Windows before it was Windows (DOS and Word 1.0) and still own the very first Microsoft mouse (very ugly and cheesy).  I used to own a PC repair business.  I am the family PC fixer.  Hopefully you understand I have been around the proverbial Windows block. :-)  That just changed a few weeks ago...I was extremely skeptical purchasing a non-Windows PC and I can honestly say this Chromebook has far and beyond impressed me.The fit and finish of this white HP Chromebook 14 is seriously reminiscent of an Apple product. The operating system used, Chrome OS, is extremely fast and boot up time is 10 seconds (just clocked it).My biggest concern was accessing Microsoft Office Word, Excel and Powerpoint.  With Google Sheets, Docs and Slides that problem was remedied. AND THEY ARE FREE!  The Chrome Remote Desktop also allows me to access Windows machines on my network and set up time was less than 15 minutes.The reasons I went with this model of Chromebook compared to others is:1. It has the T-Mobile mobile connection available and gives me 200mb a month FREE FOR LIFE of the device.  Now 200mb is not a lot but I have found it is enough for the very infrequent times I do not have WiFi access.  When you reach the 200mb limit, T-mobile will text your Chromebook and you can buy 1 gig for $20 (and there are other options).  Remember you only need the T-mobile connection when you DO NOT have WiFi access.  By the way setting up the T-mobile connection took less than 5 minutes and you DO NOT need a T-mobile account.  First time setup - Once connected to the T-Mobile network (should say 3G or H+ next to the time, if it doesn't click the WiFi or no network access icon next to the clock and connect to T-Mobile), open a webpage and try to go to any website, it will redirect to T-mobile and walk you through the setup.  Once you have done the one time setup next time will be a breeze, connect to the T-mobile network and go.  Note: I recommend you uncheck the box \"Automatically connect to this network\" for the T-mobile connection, this will make sure you connect to the T-mobile access when you want to (thwarts accidentally shutting WiFi off and the Chromebook automatically connecting to T-mobile and uses up your data for no reason).2. This model has 4 Gig of RAM, now some people claim the 2 gig RAM model is just fine.  BUT if you open several web pages the extra RAM will come in handy. And it is only a few bucks more than the 2 gig model.  Worth the cost believe me.3. It is $20 cheaper than the same model at Walmart (at the time of this post)Prerequisites:If you are someone who finds yourself using websites for 99% of what you do on a PC, then Chromebook is your ticket.If you find yourself needing Office applications and the rest of the time you use websites, then Chromebook is your ticket.If you find yourself needing some other application which runs on Windows, I would seriously investigate other application options, sometimes the application provider has a Chrome extension which you would use on your Chromebook.ALSO, there are many \"offline\" versions of Chrome OS applications so don't automatically believe someone who tells you if you use a Chromebook YOU HAVE to have a internet connection, in many many cases it is not true.If you get a chance Google “Chromium Project Security” and read the webpage.  Chrome OS is several times more secure than any Windows machine (or Apple, yes I said it!).  Chrome OS was built with security as it's cornerstone.  If anything this alone is a very good reason to use a Chromebook in today's technology age.  FYI you don’t need virus software with a Chromebook in fact it does not exist.  There is a reason for that (reread paragraph).One last thing, this Chromebook is QUIET, and runs EXTREMELY cool.  None of my Windows notebooks or ultrabooks are this quiet and cool (by a long-shot!).fyi: this post was written in Google Docs then copied pasted into the Amazon form.  Did I mention Docs is free?!Well I have babbled enough.  Now throw a Chromebook in your basket and start enjoying this completely awesome technology!!", "Date": "May 13, 2014"}, {"Title": "Awesome laptop", "Author": "Jose Castro", "ReviewID": "RSNKW38P0UN2D", "Overall": "5.0", "Content": "I will start off by saying that I did not buy it through Amazon because when I got it Walmart still had an exclusive on it, however I love everything about this laptop. Be aware that it does run ChromeOS. I like ChromeOS for how it just works, but it is very reliant on the cloud and as such it might not be for everyone. If you need more info on ChromeOS just look up one of the many reviews around the web.Pros:-It's plain fast. It boots in less then 5 seconds and is ready to go right away. It's like night and day from my old windows laptop that I had to turn on about ten minutes before I actually wanted to do anything on it.-Did I mention it's fast? I have about twenty tabs open right now while also streaming a music video in the background, and it doesn't have a single hiccup.-The keyboard is great. Typing just feels so natural on this keyboard with just the right amount of clickiness and texture. Also, since it is a 14 inch screen the keyboard is big and spread out, so I never worry about hitting the wrong key.-The battery life is awesome. I am a student and have been spending close to 12 hours at or around school these days (finals are coming up). I don't ever worry about bringing my charger. It usually last me about 9-10 hours on a single charge, so it can make it through an entire day easily.-The price is awesome. There is no need to buy additional software and for it's price tag I would have a really hard time finding a nicer laptop.-It looks very sleek. It's made out of plastic, but it doesn't look cheap by any means. Around the keyboard it has an aluminum look, while everywhere else it is a matte white material. The other colors are too flashy for me, but I think the white one looks really nice.-It has all the ports I need. Three USB ports, a full sized HDMI port and an SD card slot. I have used an HDMI cable to stream ESPN and Netflix on a TV while doing homework on my laptop and it handles it just fine.-It technically has fans and vents for cooling, but I have yet to hear them actually turn on. Even while streaming video, I couldn't hear any fan noises (unlike my old laptop that sounded like it was a plane taking off).-T-mobile data (200 MB) is free for two years and really easy to set up. No, it's not a tremendous amount of data, but it's nice to have in a pinch.Neutral:-The speakers are about middle of the road for a laptop. They are loud enough and will work in a pinch, but I always have headphones or speakers, so its a non-issue for me.-The trackpad works. Nothing much more to say about it. It is responsive and pretty big, but I have seen nicer ones (for a lot more money).-It has 16 GB of on-board storage. Now, everything that I do on this laptop is saved in the cloud (Google gives you 100 GB free through Drive) so I have had no issues with storage yet. And if I ever want a couple movies to watch over a long trip I can just buy a 16-32 GB SD card for like $20.-14 inch size. This just comes down to what you are looking for. I wanted a nice 14 inch laptop and this is perfect for me. However, the other chromebooks come in at a nice 11 inch size, so those might be better for traveling. And closely related to this....Negative:-The weight. Now it comes in at a solid 4 pounds, which is much lighter than my previous laptop. For me the weight is acceptable, however I wouldn't complain if it was another half pound lighter.-The screen. It has an acceptable screen. It isn't the prettiest screen I have ever seen, but it works fine for general use. Don't expect it to compare with a MB Pro Retina or a Pixel or pretty much any of the high-end tablet screens. But, like I said, it is completely usable for general use and the occasional video. And with the HDMI out, I just hook it up to my TV for any serious video watching.", "Date": "November 19, 2013"}, {"Title": "An outstanding device", "Author": "Krisztian Koncz", "ReviewID": "R1WS5PDI9GJNBS", "Overall": "5.0", "Content": "Although I bought My chromebook 14 in the UK, it is not available on amazon UK yet, I had to buy it direct from HP. Like the T-mobile version here, mine comes with a built in HSPA+ radio that gives me superfast mobile internet in the area of London where I live, on par with wifi speeds pretty much. This is the first product I reviewed that got a 5-star rating although perhaps 4.75 stars would have been more accurate. The tiny flaws that it does have are balanced out by the stupendously low price, basically this is a machine you can easily compare to a macbook or a windows ultrabook that costs 4 times as much an it will still hold its own. Obviously this is a Chrome OS device so one has to do their research if they can live with a cloud-based OS and there is a very small learning curve when switching, but honestly Chrome OS is so easy to learn, almost anyone should be able to do it. I also wrote a detailed and critical review looking at every little aspect of the device, meant for chromies who are already sold on the concept but need comparisons with other chromebooks available on the market. For my money, this particular model is the best chromebook you can get out there, factoring in things like price, battery life, 4g connectivity and screen size. Without further ado here are my initial impressions:Initial Impressions about the HP chromebook 14 UK 3G version and comparison to the Samsung series 3Feel and QualityThis is definitely a laptop, it feels very different from the samsung, the weight is substantial, it is much bigger and the fan is constantly on and very much audible. I suppose I will just have to get used to the noise, but that is definitely a step back from the Samsung. Some reviewers noted they can only hear the fan when they put their ears next to the keyboard, definitely not the case with me, I hear it all the time when I’m in a quiet room. When I take it to the kitchen, where there is a lot of ambient noise from the fridge, it gets cancelled out and I can’t hear a thing. Most people probably won’t even notice the fan unless they use it at night in their bedrooms.KeyboardThe keyboard has a different feel to it than the samsung, it has textured keys and they keys have slightly more travel. Annoyingly, the keyboard is narrower than on the samsung despite the bigger size of the machine itself, so you get narrower enter, backspace and shift keys. The keyboard otherwise feels good and it is quite silent to type on, but not as much as on the samsung, perhaps that will change with time. The keys are not as rounded as on the samsung and I must say I prefer the typing experience on the samsung so far, but maybe I’ll get used to it in a few days. There is more key travel on the HP, that is definitely in its favour.TrackpadThe trackpad is the same width but slightly taller. I feel no difference in practical use, however the HP has a slightly loose trackpad that rattles every time I tap to click, which is annoying, so I find myself preferring to actually click the trackpad. Thankfully the trackpad requires less pressure to click than on the samsung and the noise is more satisfying. The loose trackpad feels cheap, I’m not sure if this is an issue with my machine in particular or if it is more widespread.ScreenThe 14” screen makes a huge difference in comparison to the Samsung, I don’t have to put on my glasses and I don’t have to zoom in or squint to see text properly. The bigger screen is the main reason I bought this machine and overall I’m satisfied. I did not find the lower PPI to be an issue, you tend to sit a bit further away anyways. The lack of an anti-glare coating is preferable in my case, text appears to be clearer and more crisp. The screen does reflect when switched off, I see no reflections when it is switched on, I keep it at about 80 percent brightness. Reflections from the blazing sun is not an issue we have to grapple with here in the UK. Maximum brightness appears to be about 10 percent higher than on the samsung, it is definitely noticeable and a welcome change. On the other hand contrast ratios are worse and colours are more washed out than on the samsung. Next to each other, the same background photo shows truer colours on the samsung, the setting sun is more orangey. The HP seems to struggle with contrast, for instance a light skinned person on a white background looks quite bad. Also, I find that I need to tilt the screen quite a bit back to get decent contrast ratios when writing and reading text on a white background, then when I watch videos I have to tilt the screen a bit forward to get better colour reproduction. It seems that constantly adjusting the screen is just something that comes with TN panels. But like I said, overall this is a pretty good screen for the price.Materials and Build qualityThis is where the HP truly shines compared to the samsung. This is a beautiful machine, well made, sturdy, quality materials, and the heft seems to add to the quality feel. The plastics used are much thicker than on the samsung, there is no creak when you pick it up. Mine is the snow white colour which is just amazingly gorgeous, I’m truly in love with the look and feel of this. This all comes at a price though, the bottom half of the machine is twice as thick as the samsung, the height difference is noticeable when you are typing on the table. As for weight, this is no macbook air, I definitely won’t be carrying this around as much. I plan to keep this for home use and take the samsung with me when I’m out and about.PerformanceI did not get the opportunity to test this extensively, so these are just initial impressions. My Samsung has increased scrolling performance markedly on the beta channel and when I go to google plus or the notoriously heavy Verge I see no difference between the two machines in normal scrolling. The HP seems to drop frames just as much as the samsung. Where I see a real difference is in loading times, pages load in about half the time on the HP and the waiting time to be able to scroll without jerkiness or checkerboarding is also about half of what you get on the samsung. Same goes for switching between tabs. Where the HP 14 really leaves the samsung in the dust is watching HD videos, there is just no comparison. The Samsung can just about handle HD streaming in netflix, but when it comes to youtube or other flash-based streaming sites, it struggles to play videos smoothly, there are missed frames, jumping and jerkiness. Also, I found that with the samsung switching between resolutions or going full window and back is problematic and really taxes the cpu. No such problems here, the HP plays everything beautifully, HD videos are crisp and fluid, they look beautiful on the large, glossy screen. Perhaps the only drawback of the glossy screen is when you watch dark scenes, you can see your own reflection a bit, but not a huge issue overall. The speakers are loud and clear, they are noticeably more powerful than the one on the samsung. Of course there is zero base, but they are still fine speakers for a laptop. Overall, if you like to watch videos and movies on your chromebook, the HP leaves the samsung in the dust, image quality, fluidity, responsiveness and speaker sound are all superior, but that is to be expected from a bigger machine.ConnectivityWifi performance is fine, same as the samsung, picks up signals easily. This model comes with mobile internet included. In the UK, as in the US it is an HSPA+ wireless radio. In the US this is marketed as 4G, in the UK this is considered 3G or 3.5G according to some marketing materials. It is faster than normal 3G, but it won’t be up to LTE speeds. The network provider is Fogg Mobile, a Swedish telecom company who have effectively outsourced the service to Three. I already have a mobile phone contract with Three and mobile internet speeds in my area are relatively fast (Wapping in East London), actually they are usually better than what I get from my BT wired broadband over wifi. Fogg mobile gives you 250 MB data per month free for 2 years, which is only enough to use in an emergency when nothing else is available. I will generally stick to wifi and tethering, but it is a good option to have and the sim is swappable, so you can easily get an unlimited mobile data SIM card from Three for around £15 per month which should give you constant internet coverage without having to use wifi or tethering. The only problem I have with Three is that they don’t always have their own masts, so when you head to central london you have to make do with the very low bandwidth that they manage to rent from other providers and at peak times that is nonexistent in places like the city. Still, you can insert a sim from any provider if they have better service in your area.I tested HSPA+ vs BT broadband speed in Wapping at 5.30 PM with no one else connected to the wifi network. Streaming speeds were 6537 kbps on three’s mobile network, almost twice of what is minimally recommended for HD video streaming. ON BT wifi I got 9837 kbps, which is around 50 percent higher but in real world use both connection speeds are fine.Battery LifeI had no chance to test this yet, at the moment I am at 90 percent charge and the machine estimates 7.5 hours of charge left, which seems to fall in line with what most people get. I’d say 8 hours is a reasonable expectation from this machine, but this will go down steeply if you stream HD videos. As for heat, the bottom of the machine is completely cool to the touch and it seems you don’t get the annoying spinning up of the fans that you get from windows laptops and macbooks when you tax the CPU. The Haswell microarchitecture really shines here.ConclusionOverall I am happy with my purchase, the HP Chromebook 14 is a significant step up from the Samsung series 3. What you gain in screen size, performance, quality and looks you lose in portability and weight, so you have to examine your usage scenarios to see if this is the right machine for you. My feeling is that for the time being this is the Macbook Pro of budget chromebooks. It is heavier and more expensive than the Acer C720 or or the Samsung, but it will serve you better as a desktop replacement and it is more suitable as a workspace. Built in mobile internet is also a huge plus in my eyes as unlimited data plans are becoming more common in the UK, so you could conceivably use this machine without ever needing to connect to wifi, therefore saving yourself a bunch on a wired broadband subscription. I think that the HP14 offers real value for money, particularly in the UK where laptops are significantly more expensive than in the US even if you factor in the 20% VAT. To give you an idea about the value proposition, the 3G model costs £279 whilst the Wifi only model is priced at £250 at the online UK HP store. To find a windows laptop that has comparable specs and build quality, you would have to pay at least twice as much, with apple you will have to pay 3-4 times as much. When it comes to chromebooks, the ACER C720 and the Samsung both cost £180 at PC World if you factor in the £20 cashback offer, but both have only 2 GB of ram. For the added quality and screen size, I think £70 is a reasonable price to pay if portability and weight isn’t paramount. It is also worth keeping an eye on special voucher codes, I managed to buy this model at a 10 percent discount, so I paid only £251 for it, there might be similar offers in the future.", "Date": "December 4, 2013"}, {"Title": "Best Laptop for People Who Live on the Web", "Author": "B. Cole \"bcole\"", "ReviewID": "R1SR0AR4L4D7A6", "Overall": "5.0", "Content": "This is a very good laptop and has a very good screen along with the instant startup time. There was an issue with my wi-fi after I connected an Ooma to my network. I had to change some settings on my router to get it working again. Update 1/28: The Wi-Fi issues were fixed in a later update.The real battery life that I got on this was around nine hours, which is extremely good for the screen. Update 1/28: The screen still pops at me and it is amazing for watching videos online or on a hard drive.I have not used the 3G or 4G as of yet, but in my room I get only EDGE speeds, which aren't very good. I'm surprised I get any signal at all really. Update 1/28: The 4G is really good on the laptop once it is set up. It takes a few minutes to go through the set up process and there are hiccups when restarting the 4G, but it's still very fast.The laptop has a matte finish that Google has on their Nexus line of phones and tablets. It's really nice. I really like the white even though I would prefer it in black.The laptop is extremely thin. It's now getting to the point where I think the laptop may need a case because it looks like it can't take a beating like the other thicker laptops I have had.Do I love this thing? Yes, I definitely do. Chromebooks are really awesome. I love the design and I love the very simple interface.It works with all the bluetooth devices that I have paired with it.If I need Windows (which I haven't unless it's rarely for work), I use a small netbook/tablet and they both accomplish all my tasks.If you don't need a laptop but to save pictures to the web, and view content online, this laptop is definitely for you.I know that when I travel, I will definitely use this laptop over any of my laptops.HP and Google, great job, this laptop is something to be proud of. Great price and great style.", "Date": "November 17, 2013"}, {"Title": "HP Chromebook 14 4G (w/Free T-Mobile)", "Author": "allen", "ReviewID": "RZ654H2H2J4DJ", "Overall": "5.0", "Content": "Purchased 05/06/14. Purchased with: iPearl mCover Hard Shell Case (clear), AmazonBasics 14.1\" Case, AmazonBasics 3-Button Wired Mouse.I absolutely LOVE my new HP Chromebook 14 w/T-Mobile!!! I was somewhat worried about going to a 14\" from a 15\" screen, but I can actually read the HP better, (Settings > Very Large; 100%, which I think helps). As a first time HP consumer, I'm very impressed, they have a winner here! I'm quickly becoming a HP convert, as a long time (15 yr) Dell user, that's a pretty strong statement by me.I really like the iPearl mCover Hard Shell Case because it will keep it nice and clean, maybe even protect it against some hard knocks. I wasn't sure if I'd like the mousepad, so I got the AmazonBasics wired mouse, (just in case). I use one of these with my Chromebox and it works great, no hiccups, burps and/or farts - at least from the mouse! After a couple days of use, the HP mousepad is just fine, (actually, it works great!), although I haven't figured out the left-click, (no switch option in the Mouse Settings that I could find), which is OK, don't really need it too much - and if I have to do a bunch of editing, (copying/pasting or dragging), while on the road, I'll just plug the mouse in, so no big deal.I received it quickly, (thank you Amazon Prime!), and it was well packaged. Thank you HP for not putting any stickers on the screen, I really do appreciate that (a lot)!I'm very familiar with the Chrome OS, I have had a Samsung Series 3 Chromebox since Nov 2012, (LOVE it!), and I'm definitely hooked into the Google ecosystem. I love the Docs and Spreadsheets, love the fast start time and ABSOLUTELY LOVE the NO maintenance!!!!! This also carries over to my new Chromebook. I completely agree with previous Amazon reviewers, \"This is the future of computing!\"I have only had the HP a few days and my first impressions are...are...are...a big fat solid 10 stars! It really has exceeded my expectations! The HP was SO easy to set up! I was online and working including the unboxing (2), reading Quick Start Up Guide, (1), Activation (1 for Google, 5 for T-Mobile = 6), so about 10 minutes total. Sure beats starting up a Windows machine!!!!The T-mobile signal is pretty weak where I live, so I was really surprised when I started the initial HP Chromebook setup, I apparently had access to it. So I thought, I'll go for it, let's see how it goes. It actually went great, Google OS updated quickly with no issues. The T-Mobile activation was VERY easy, I really took my time with it though - to get it right the first time. I've read a few reviews where some were having some problems activating the 4G service, they spent hours on the phone w/support. I don't get it, but maybe they had a unique problem or didn't follow the correct procedures, because, to me, it could not have been any easier. I'm really glad it has a 4G option, to me, it'll be much safer when I'm on the road at unsecured local, hotel or airport hot-spots. If I use the 4G time up, so what, I'll pay for a day pass, it's worth it to me for the security it provides.A previous reviewer complained about Chrome OS not having Java that was causing some issues for certain websites for him, (um, refrain from those porn sites dude!  <g>). I have no such issues with any websites and I also access many shopping, banking and investment account websites, (and I don't go to porn sites! <gg>). Now for one bank that I use, it does require Java for echeck deposits. I need to access my Dell to deposit/process these checks, (or go to my local bank at the nearby shopping center - ugh!). Not a big deal though, I only receive a (very) few checks a year - and eventually I'll be getting an Android device, (Nexus?), when the Dell dies (?), and I'll just use that banks Android app for echeck deposits, so again, no big deal.I find it strange that some people who buy this device, (any Chromebook/box for that matter), and then complain, \"Ew, it's not Windows?!\" or \"Ew, the OS is too confusing or complicated!\". Sure, if you've never used it, it can be a tad overwhelming at first, (not really - maybe, just maybe  *you* are the problem). But once you''e learned it, (within a day), it's so easy to master/navigate and it's not confusing at all. I like it because it's NOT Windows! I know I'll NEVER go back to a bloated, virus prone, update needy, too many repairs Windows machine again. The Chromebox and Chromebooks are top Amazon sellers and the momentum is growing. MS should be VERY worried.As of a few months ago, I'm now finally 100% cloud-centric. Switched from Quicken to Clearcheckbook.com, ($42 yr - Premium, but they do have a free basic version that you can use). We use it to manage our household cash for all of our accounts and I use (very) detailed Google Spreadsheets for the registers (for backup), CB, projected income, YQWD NAV bal/inc stats, (thanks Google!). It's so nice and easy to share and manage our household financials now. Quicken was great while we had it, but is now done and we couldn't be happier! Intuit is missing the cloud boat, Mint isn't going to cut it. Oops, I'm kinda of getting off track here, (sorry), but my point is, Google and Chromebook are the new reality for (cloud) computing and with a little time and effort to make a thin client PC work for you, I think it's definitely worth it.BTW, I added some extensions, (all free), from the Chrome Web Store that I think some people might be interested in: AdBlock Plus, (ABP, it's GREAT!), Chrome New Tab Redirect (use any URL you want for a new tab), Win7 Scroll Bars, and Webpage Snapshot. I also `Pinned to Shelf': G-Mail, G-Drive, G-Calendar, Calculator, Chrome Web Store, Files, Chrome Remote Desktop. Of course, everyone's needs are different, but all of those I mentioned above helps me out a lot...fast and easy, making your Chromebook even better...The only (minor) cons I have are: I was going to say that it would have been nice for it have a backlit keyboard, but I think that's pretty unlikely considering the wonderful price point this HP currently has. At night, the white keys really do help to see the keys better. Backlit keys would be really a nice feature, but to me, not mandatory. But what would really be nice is that if it had a number pad. Oh well, what can you expect for a $329.99 computing device. I just won't crunch numbers when on the road, which is just fine by me...(yay!)It's a GREAT device and I highly recommend it!!!!  5/5-A", "Date": "May 12, 2014"}, {"Title": "How I Stopped Worrying About the PC and Learned to Love Chrome", "Author": "JWP", "ReviewID": "R2NPJ2QXZBD0BG", "Overall": "4.0", "Content": "I am very satisfied with this purchase and I recommend anyone sitting on the fence to stop worrying and get one. Here are specific points:* Great battery life. You can easily exceed 8 hours, pretty good for such a large screen. If you are really trying to stretch the battery it is really easy to lower the monitor brightness right on the keyboard. Another bonus is that there is little or no bleed; when you turn it off it does not consume power (unlike my VAIO). Charge time is fast, approx 2 hours.* Screen is good but not great. If you are using this for gmail and web browsing you will be very happy. If you are massively into movies then you might be dissatisfied. Remember 14 inches is quite large and feels like a luxury when you are on the road. Webpages pop.* Remote Desktop Connection - This chrome feature worked exactly like RDC on my chrome desktop browser. I need to access a server for work and I was worried there would  be glitches but it was no problem.* User accounts: you can add user accounts for family members or set up a generic one for guests. I love this feature. My kids who have macs keep borrowing it!* Slightly on the heavy side. For me it is a trade off for screen size and I am happy.* T-mobile account worked well. Great for layovers at the airport. If you exceed the free usage you can buy accounts based upon volume. They are reasonably priced in my mind. I hate the paid services at the airport or even clicking through on the free ones. You can turn this feature on and off so you don't accidentally use it.* Fingerprints: my white unit does attract fingerprints but it wipes up easily. I would have gotten black if given the option as this is quite flashy in its own ultrawhite way.* Build quality is great!* Mouse pad: While the pad works generally well I had trouble highlighting so I bought the Logitech m305 Wireless Mouse which had no trouble being recognized upon startup and works great. Recommended add on.* I was very happy with the price. By the time you spec out a PC with Haswell i7, solid state drive and AC wireless you are in the big bucks. This book at this price got me off the fence without worrying about obsolescence.", "Date": "March 24, 2014"}, {"Title": "Wow... pleasant surprise...", "Author": "Amazon Customer \"Teamwork is when everyone ru...", "ReviewID": "R2MZVT0BIT6OOS", "Overall": "5.0", "Content": "I have been a power user owner of $7000 desktop and desktop replacement multimedia laptop.  My computer purchases always has been to buy with power to spare in case I need some serious computing power.  As I got older and wiser, I am toning down.  My son needed his first laptop for his homework and research as my old laptops became laggy.  I just got this Chromebook 14 and received it today.  I had time to set it up and test around a bit and must say that I am quire impressed.It's instant on and off feature makes this laptop very usable.  Touch pad works smoothly with the browser and since I'm already using chrome on my other computers, hardly any learning curve at all.  Google Drive can be instantly accessed from the bottom toolbar button.  For my son's use, word processing (school homework), research and web browsing, occasional netflix and lots of music listening (comes with bluetooth, wifi, and hdmi) it works seamlessly.  I went to a video streaming web site with proprietary player and streamed HD movie and played it on my TV via HDMI connection to AV receiver.  Both graphics and sounds were great.  For the price, I can have one for each one of the family.  I just promised my daughter I'd get one for her when she enters middle school.For most users who simply do web browsing mostly, and occasional movies, and word processing, this computer is perfectly balanced.  I'd recommend it for any household... especially one's with kids.  BTW, when I got the laptop today, it was partially charged to 80%.  I tinkered around with it to set up, test the video, and all that which took me a few hours.  Well, my son  had time to eat dinner and watch Ip Man 2 on netflix while I tinkered around.  The juice was still almost full.  So I'm leaning towards 9.5 hour battery life claim being understatement.  With 9.5 hours of battery life, I'd have to borrow this from my son when I go on business trip.  Free 4g would come in handy also.  Nice thing about the 4g is that the sim card was already installed and it worked right out of the box.  I didn't need to set up anything at all.  BTW, at the time of the writing, the Amazon price is higher than other places by quite a bit.  Walmart and HP itself sells this model for $350.", "Date": "December 13, 2013"}, {"Title": "Excellent!! In love, a great buy, full review below", "Author": "Bozzy", "ReviewID": "R1LCB60H6S7MS4", "Overall": "5.0", "Content": "Let me start by saying I am very pleased with this laptop. I have been eyeing up Chromebooks for some time now, but haven't pulled the trigger. Finally I decided to wait for the next gen models aka this one with a haswell processor in it.Appearance:As for the appearance the white is very nice. It looks sleek and is very thin. Once open the interior does not disappoint either, The keyboard layout and track pad are both excellent in my opinion.Screen:The screen is actually pretty good quality and looks bright. It surely won't disappoint you, as it is an upgrade over my previous laptop.Performance:Now to the meat and potatoes that everyone truly questions. How does it perform?? Well the answer is simple, in one word incredible. It is excellent, the boot time is near instant. I chose this model because it has the 4GB of ram. I believe that is an important factor for my performance review. I have had no problem having multiple tabs open. I frequently have over 20 open at a time and experience no lag. I have multiple video tabs open and detail oriented pages and still run smoothly. I attribute that mostly to the 4GB of ram I believe which comfortably allows the resources to do such things.Overall appeal:This laptop has done nothing but impress me. It's light, fast, sleek and sexy. The track pad is big, feels good, and has lots of nice intuitive gestures which make using it simply a breeze.  There are some thoughtful design aspects that I do love. Simple things like the little power light on the side of the laptop. Along with the power light located by the plug which indicates when the laptop is fully charged. When opening the laptop from the closed state it will automatically turn on and within a couple seconds you are in chrome. The USB and HDMI ports are great additions and add connectivity. I also like having an SD card slot, so if you want extra local storage all you need to do is pop one in.Final Thoughts and Recommendations:If you are on the fence and have done the research, but are still apprehensive. Buy this laptop, do yourself the favor. You will not be disappointed. I recommend getting this model due to the 4GB of memory as I previously stated. The added 4G is a bonus on top of that. You can do so much on this laptop with all the google apps, stuff in the chrome store, and 3rd party sites. If you need office it's online now and you can use it free through skydrive anyway. I am in love with this laptop for the price and you will be too. I can't wait to see all the new functions it gets, they keep adding cool stuff all the time.Optional:Pair it with a chromecast to easily stream your laptop content and browser to your tv even netflix!", "Date": "December 10, 2013"}, {"Title": "FIVE STARS", "Author": "Dennis E. Wiessner \"dwiessner\"", "ReviewID": "RAAX2AEM7PL95", "Overall": "5.0", "Content": "Chromebooks set the architecture for the pc of the future.  I shifted to using the Google cloud apps, for Music, Docs, presentations, etc.  I do everything I need from on-line banking, day trading, reading news and informative pages, uploading and sharing photos and, email with and without attachments, etc.  I got a Chromebook for each of my three kids and love the fact you can't download things on to it.  The Chromebook concept calls in to question the need for entire industry segments such as Microsoft Office and the various security software programs  --both unnecessary with Chromebook, which equals a savings of several hundred dollars per laptop.  Way to go GOOGLE and the companies such as HP who are also manufacturing the Chromebooks.  For the past month, I've always been on wi-fi but take comfort in the T-Mobile 4G as a backup.  The price is astonishing.  I don't need to pay almost one thousand dollars for any Apple design that coincidentally comes with Apple's failure at inter-operability between other non-apple devices and services.", "Date": "December 1, 2013"}, {"Title": "Not a laptop replacement, great as an extra", "Author": "M", "ReviewID": "R3HXM9E2METPMJ", "Overall": "4.0", "Content": "Updated:  I started off giving this 3 stars, saying that I would probably give this 3.5 stars, if I could.  I've since decided to increase it to four. It's just really great having this machine.The Chromebook has many pluses but some drawbacks too.  At times I've gotten irritated with them.  I got it from the W mart several months ago.  I think, first of all, that the list price of $350 is a little too much. If it was less, I might have given it four stars because I wouldn't have been expecting as much out of it.  So, yes, price is relevant when rating my satisfaction with an item such as this.I really did my research before purchasing, and knew most of it's limitations.  The thing I was most surprised by was the java issue.  I wasn't fully aware of that part.  It's become increasingly irritating, as over time I've gone to more websites in which things won't display properly or I can't do a simple thing and I see that java error thing on the bottom of the page.  So, to me it is a real wonder how anyone can claim that this has fully replaced their Windows-based or Mac computer- how can those people can access any site no problem, when I can't.  Is there some secret I don't know about??  And when I say I'm encountering these java issues, I'm not talking about just game sites.  I'm speaking of normal sites, stores, businesses, etc.- not trying to do anything fancy or complex.  Before buying it, I had the impression that I wouldn't have any problems with simple things like that.Another smaller but annoying issue is the sound.  It's simply not loud enough- well also a bit tinny.  But it's much lower than my laptops' max volumes.  One reason I wanted this machine was for watching YouTube videos on and listening to music and audio books on YouTube or similar sites.  So there are times when it's not loud enough, and if I'm doing some cleaning or cooking and wanted to listen to videos/music while doing that, it becomes more of an issue as I need it even louder while doing tasks.I don't find any problem with the screen as some have complained about.  No, it's not the best screen you'll ever see, but it's clear and decent enough.  So, people should stop comparing it to the screen of the smaller HP chromebook, the 11, because that Chromebook isn't nearly as good in other ways- doesn't have the same powerful processor.As far as the fan, it does make noise and is noticeable when in a quiet room, but it's not too loud.The keyboard isn't great like I hoped for typing longer emails, reports, etc.  My fingers have actually started to almost hurt at times if typing for a while.  I also make significantly more errors than when typing on my laptop.  The overall feel/texture of the keys could be better too. However, it seems that other Chromebooks have very similar keyboards.A couple of times the Chromebook froze on me. Well, I'm not certain what occurred in some instances.  One time, maybe even twice, I had left it on and came back to find that it had mysteriously restarted on it's own.  I have no idea what happened, if it had frozen, or what. (Has this happened to anyone else?) Another time, I was using it and it froze in the middle of shopping on a website.  It wouldn't turn off at first.  This doesn't happen on my laptops, which are kind of old and not Macs or anything.  For me, a computer completely freezing like that was a thing of the past, something that often happened to my late 90s/early 00's era computers.Some of the best things about this Chromebook are how fast it is, how quickly and easily it turns on, and how portable it is.  Not to mention not having to worry about updates, figuring out which ones it needs or doesn't, the built-in protection. And if I think a website is a little sketchy, I won't go on it on my laptop, but instead can feel comfortable with accessing it on the Chromebook.  It's a great EXTRA computer to have around.  But I still think the price could've been a little lower.  I haven't even tried the 4g connection yet, but I have read that it's a limited amount of data per month, and also that it's not a great connection and T-Mobile is pretty spotty.  The 2GB model without the 4g is probably more worth the price.  Also, from what I'm reading it's still pretty fast even having half the RAM, and so unless you really want the 4g connection, I would probably recommend going with the 2GB model.  It's not like you can do heavy gaming or use Adobe art programs or things like that on it anyway, so it's not like it needs a huge amount of RAM.  Of course I haven't tried the 2GB model, so I can't speak from experience, but from what I've heard and read it's still fast.  While I can't say I regret getting this, I maybe should have gone for either the cheaper model or the Acer C720, which has the same processor though screen is smaller, but MUCH cheaper.Another thing is that the Chrome browser itself is a bit glitchy at times.  I had used it on my laptop before getting the Chromebook, but not as much as I do now.  So now the glitches are more noticeable, and the problem with how the history is set up inefficiently (for someone who has always relied heavily on history) is more annoying.  I wish I could put Firefox on it, but unless I do that Ubuntu trick, I suppose I can't.  And I do think about doing that, but I'd be afraid to mess it up as I've had no experience with Ubuntu/Linux, or messing with computers in that way.  Still, it's a very fast browser whether using it on my Chromebook or my Windows laptop.I will update this if anything changes, and am willing to increase my rating, especially if I find out of any fix for these issues.  But for now, after giving it time, these are my feelings on it.", "Date": "April 25, 2014"}, {"Title": "The computer that most people need or should be using.", "Author": "T. King", "ReviewID": "R1JUZUGJQNVGE1", "Overall": "5.0", "Content": "I didn't by my hp 14 here on Amazon, I got it directly from hp due to price and discounts. This is my second Chromebook with my other being the Samsung 5 550 which is still going strong after 19 months.  This is an upgrade for me due to wanting something bigger.  Even though I looked at 14' computers in the stores prior to buying this and they looked small but after having that 12\" 5 550 for 19 months, this thing looked and felt huge.I'm pretty good with computers and always had an hp Notebook computer but after years of buying 1k+ Notebooks over the years just to turn  on the computer and go straight to the browser, I knew the Chromebook was for me.  If you only use the a computer for social networking, browsing, shopping, emailing, YouTube, occasional documents or anything web related, this is the device for you. With a Chromebook there is no more maintenance, viruses, slow downs and no more Os software to buy because it's always updated for as long as you own it. In fact it will be as fast and up to dated as the day you brought it. If you need Itunes and certain Winblows programs although you can use MS word though Skydrive / Onedrive this is not for you or at least it shouldn't be you only computer.There are some that say that you can just buy an inexpensive windows machine for this price and just add Chrome but I'll tell you the experience is not the same with Winblows added.  I didn't need the added fluff that comes with Winblows which I rarely used if ever,so it was a no brainier for me.With that said, this is a good looking solidly built Chromebook with, good weight, nice smooth rubbery feel to the case and it has a nice keyboard and trackpad.  The screen is a complaint by many reviewers, it's a glossy screen which my other one was matte but it looks good to me except for the glare like all glossy screens have but what did they expect for the price.Pros:AttractiveSuper Fast boot upLong battery lifeChrome OSEase of use and speed:Included T-Mobile WiFiWeight for it's sizeBluetooth 4.0Cons:Fan constantly runningKeeping it clean?There is a reason MS has launched an anti Chromebook campaign, they don't want the masses to know about these great devices because they will realize this is all the computer they need.", "Date": "February 8, 2014"}, {"Title": "Watch out for the Microsoft trolls!", "Author": "Chromie", "ReviewID": "RPET0VA1TCZ39", "Overall": "5.0", "Content": "This is a tremendous piece of machinery. Solid. Beautiful. Fast. Nice large screen - much better than my Samsung Chromebook's 11\" screen. Works on WiFi. Works on 4G. I've had it for a few weeks now and it works flawlessly.Indeed, I have been able to ditch my PC loaded with Windoze and assorted Microsoft bloat and use this Chromebook as my sole computer! Everything I do now for both work and play is on the web: Google Docs, Google Spreadsheets, Google Calendar, Gmail, Multiple Listing Service, Transaction Desk, Pixlr Photo Editor, news, etc. And this beauty allows me to do it all! And print! Plus, many of these Chromebook apps are also available offline (Google Docs, Gmail, Pixlr Photo Editor, etc.), so I can work on them even without an Internet connection! And each day more apps become available for offline usage.Google is way ahead of the curve with these Chromebooks. It is the future of computing, as everything is going online - whether Bill Gates likes it or not!In point of fact, Microsoft is now so afraid of the Chromebook that it has hired the two old fat guys from the show \"Pawn Stars\" (who know diddly about computers) to trash the Chromebook in an ad! It's a pretty sorry ad.Even here on Amazon, you will notice, of late, the sudden appearance of a few negative reviews for the Chromebook 14, where before there were literally none. You can bet these are paid Microsoft trolls. Pay them no heed!", "Date": "December 2, 2013"}, {"Title": "Amazing performance!!", "Author": "William B. Guy", "ReviewID": "R27D4GID608ESE", "Overall": "5.0", "Content": "OK, I have been a Windows user for years. Thought I would try this new HP Chromebook. Glad I did. I am sold. Wonderful sound for a laptop. You would think you are listening to a small stereo system. Several programs, videos, downloading and doing searches and listening to Pandora wont make this jewel even hiccup.Some have complained about the display resolution. I agree its not the best but it sure is better than the average display. I see no problem with movies and general use. Probably would not do high resolution photographic editing. That is not what this computer was designed for anyway. If you do most of your work online using text based programs or standard video you will be pleased.Keyboard and the feel of the keys make me think a lot of the Macbook. Keys feel good and type well. I like it. I got the white model. Quality of construction is first rate. Just feels good in your hands.Spend the extra 50 dollars and get the T-mobile 4G system. It not only comes with 4 GB memory (double the standard memory) but also includes the T-Mobile 4G SIM card and 200 MB per month of free data for as long as you own the system. You can download and upload a lot of standard size text files and Word files and do Google searches with 200 MB. I don't do a lot of video with my system so free is for me.16 GB system storage on a Solid State Drive (SSD) is more than sufficient since all your programs and data can be stored in the cloud. For $347.00 I am sold. May buy another.Boot time is in seconds from power on. Cant believe it. I got use to almost needing a shave before my Widows based system was ready to use.I am a happy camper. I will update this review in a month.", "Date": "April 1, 2014"}, {"Title": "spectacular laptop", "Author": "Christopher Valle", "ReviewID": "R2LGONPQVA3Y8K", "Overall": "5.0", "Content": "This is the first laptop I bought since my 2007 white Macbook. This laptop feels almost the same, only its actually lighter and thinner than my old macbook. I was a little skeptical about chromebooks but now I am completely convinced this is the future of mobile computing. I turned it on and was instantly greeted by a screen to enter my gmail account, at which point all of my settings from the cloud were instantly applied. By using cloud9, nodejitsu, and github I can use this machine to develope my webapps. Unless you need photoshop or wish to play intensive pc games this laptop is amazing. Because you don't need to pay for windows you get a better quality laptop for the same price.", "Date": "November 17, 2013"}, {"Title": "Excellent machine for home use", "Author": "Anonymous", "ReviewID": "RFS4JRCC0XNY3", "Overall": "5.0", "Content": "I bought this as a replacement for a 2009 MacBook, which is my secondary computer.  After a couple of weeks, I think that the Chromebook will do almost everything I need it to for home use.  For more application-intensive tasks, I'll use my MacMini.  But I think that will be infrequent.  For web surfing and email, this is a really good solution.  The free 4G service is icing on the cake.", "Date": "March 29, 2014"}, {"Title": "Love love love", "Author": "Maura A. Tunney \"Maura\"", "ReviewID": "R17TURK8SVEHEA", "Overall": "5.0", "Content": "I cannot tell you how much I love my chromebook.  There is no doubt in my mind that this is absolutely the way of the future.  I hate when I have to power up and use my old laptop (I don't have a printer with cloud printing capability yet)  as I have been so spoiled by my chromebook's speed.At first I was a little weary about not having iTunes to manage my music, however after a while I decided to give google play a try, and I was not disappointed.  It automatically uploaded all of my songs from iTunes for me, and you can store up to 50,000 songs in the cloud for free.While the screen may not be the greatest, the only time I notice is when I've got my old laptop up next to it.  Not to mention the chromebook was about a quarter of the original price of my laptop.The free year of data from T-Mobile is a nice touch, but I have hardly ever used it.  I generally compute at home or other wifi-enabled locations, and T-Mobile doesn't have the greatest coverage in my area.  However, I have heard that AT&T;'s sim cards work as well, and since I have a plan through them already, I will probably get one in the future for this.", "Date": "March 29, 2014"}, {"Title": "I Love This Chromebook", "Author": "Abel", "ReviewID": "R2TQXRK0UX2K6H", "Overall": "5.0", "Content": "I was a little skeptical about Chromebooks considering the other professional reviews I had read and watched. I decided to buy this after analyzing what I really did on the laptop..... about 99% of the time my family uses the computer for media consumption, casual gaming, social media updates, and word processing. This Chromebook performs all of these tasks flawlessly.  The screen is not the best but not bad either (unless you are a perfectionist when it comes to your screen). The size is very good and there are tons of games most of which are free on the Chrome Web Store. I dont have to worry about updating antivirus/malware. I'm thinking I will be buying another one", "Date": "March 21, 2014"}, {"Title": "Pleasantly surprised yet slighty disappointed.", "Author": "Mark A. Mitchell \"Constant researcher\"", "ReviewID": "R3TZBM0F37ZMJ3", "Overall": "4.0", "Content": "My unit arrived in pristine condition(although repackaged). The laptop is easy to set up and get working. I love the fact that it is fast,fluid and exactly what I was looking for. Having said that, I was disappointed in the fact that the Tmobile sim card was missing so there was no way to have access to the 200mb of free data this was supposed to have. I've contacted customer service and for the first time ever they were of no help. I've since purchased a seperate Tmobile sim card from Amazon to see if this works. It seems like such a hassle to return an entire unit just for a sim card.", "Date": "February 1, 2014"}, {"Title": "Very Nice Machine!", "Author": "Charles Spivak \"Charles\"", "ReviewID": "R3TGWEDP1ZIJOD", "Overall": "5.0", "Content": "I'm not going to waste your time listing all the specs, you can look at them in the description. BUT what I will say is that this Chromebook has met and/or exceeded all expectations! Normally I'm a Windoze guy, but needed something for now until I can replace my last laptop that was stolen. Honestly, this Chromebook has made it so that I am not going to have to feel the need to replace it anytime too soon. If you are already wrapped up (or at least used to) and into the Google infrastructure (Google Docs (word processing), Drive (cloud storage), Chrome (browser) among many others) then you'll surely get the most use out of this Chromebook. But even if you're not, if you're simply looking for something thin and portable yet feature filled, very fast and even aesthetically pleasing, to use in between your utilization of (insert operating system of choice), then this will do you well. Plus it costs less than most laptops out there, that are such low specs they aren't really worth it (for a lot of people). I still haven't found (at least for me) anything this can't do, that I want it to do frequently, and it does everything I need for now very well. I don't really have anything bad or overly negative to say about it, but there are some things you should be aware of (if you are not up on what a Chromebook is...I advise you to research a bit just so you are an informed consumer).Any \"cons\" I have are listed below. But it's hard to consider them \"cons\" since I already knew what to expect as far as what this machine could or couldn't do, so for the sake of information here goes:1. Cannot rip or burn DVD's or CD's (but you can upload/play music files and upload data files all day on Google sites like Google Play Music or Google Drive among others).2. Cannot run external non-Google applications like Photoshop (there are Chrome Store apps for photo manipulation), CD/DVD driven games, MS Office (there are SO many web alternatives by Google (Docs) and others), etc.3. In some cases, you cannot do things on a Chromebook without an internet connection (but seriously, when won't you have a connection?) Plus this particular model comes with free 200mb worth of 4G data (TRULY FREE!) and you can upgrade that too if you so choose in order to have access in more locations.Otherwise, if you can live with all that, you have a good chance of being as ecstatically happy with this Chromebook as I am, and so many other people. Boot time in seconds, free upgrade on Google Drive to 100GB of storage, updates automatically any Google/Chrome apps or Chrome OS (minimum of restarting which doesn't take long anyway). The external sound is better than expected (read: louder), USB 3.0, HD web cam, SD card reader, 14in bright screen (not the best but FAR from the worst)...the list of amenities goes on and I can't say enough good things. I was hoping to be pleasantly surprised at least a little bit, and now that I've had this Chromebook for a week, I am truly impressed by HP and Google's little collaboration here.", "Date": "December 8, 2013"}, {"Title": "Way better than I expected for the price!", "Author": "BRYAN BEJAR", "ReviewID": "R2WB72SOAQOPVZ", "Overall": "5.0", "Content": "Such a pretty laptop. Does exactly what I need it to do flawlessly. Very fast browsing. Also the battery life is insane, it literally lasts up to 8 hours for me. Very happy", "Date": "November 11, 2013"}, {"Title": "FANTASTIC LAPTOP AT A GREAT PRICE!!!!", "Author": "Jan", "ReviewID": "R35BNREYBXR01S", "Overall": "5.0", "Content": "I am extremely happy with this laptop.  It is fast and so easy to set up and get started with online browsing. I am so impressed with this laptop that I ordered another one as a gift for my Mother. I see now why it has gotten such great reviews!!!!", "Date": "June 4, 2014"}, {"Title": "More than I expected!", "Author": "NJS", "ReviewID": "R1B2Q8E8TPC78", "Overall": "5.0", "Content": "First let me say on a scale of 1-10 my tech savy is about a 3.  This is the 5 pc I have ever own an even though they were great machines I never fully used them to their capacity,I purchased this item first for portability and second for the lifetime free T-Mobile 4G.  When I opened the laptop I was surprised how completely user friendly it was; there was know setup other than signing in to my google account and connecting to my home network.  Everything was else was very easy from adding apps to uninstalling those I did not want. Connecting to my favorite websites was lightening fast.  The concept of all your files and documents being stored in a cloud was a little difficult for me to grasp, but when I sign into google drive on my kindle all my chrome documents were right there!  Overall I believe this is a extremely user-friendly and very useful improvement over any of the windows or mac versions to meet my needs. Also I purchased an HP Envy printer which paired very nicely with the HP Google Chrome,  I great plus is that my Kindle will print off the machine also.  Two disappointments:  This machine does not support Skype, although they offer there own version \"Hang ?\" the second disappointment is that it does not support Audible.  I'm hoping as the Chrome OS evolves these will be added and supported.  For me this is a keeper,", "Date": "May 26, 2014"}, {"Title": "Purchased in December and still perfect", "Author": "Dovetail65", "ReviewID": "RQWJ7R7YLHJI2", "Overall": "5.0", "Content": "My daughter has used this since Dec 2013 and it is still perfect in every way. Once she got used to chrome doubt she will ever need a regular laptop again.The battery is the same as new, holds a good charge, the screen is just as bright as out of the box, the 4G works great while on them move  in the car and the most important thing is that  unlike all of our traditional laptops and PC's it has never slowed down over time. It's just as responsive as it was new.", "Date": "May 25, 2014"}, {"Title": "Awesome Alternative a Must Have, Great Product!", "Author": "June C. Mcbride \"June McBride\"", "ReviewID": "R14WSLV2LFGN1", "Overall": "5.0", "Content": "The HP 14-q070nr 14-inch Google Chromebook is a beauty!!  This is my first Chromebook and I have them all:  Apple iMac, Macbook Pro, MacBook Air, Dell Desktop, HP Notebooks, Surface 2, so I can easily and quickly compare.  The 14-inch screen has great definition, clear, sharp.  The full keyboard and mouse pad respond quickly and smoothly. I purchased a white/silver and the top white finish is smooth and professional looking making it a very attractive.  Chrome browser responds very quickly. It is very thin and lightweight.  I just love this Chromebook!Before purchasing understand this is a Google Chromebook and is based on a Google Account using the Google Apps, Google Drive, Google Docs, etc.  It has everything needed already to go without any additional costs and without worry of virus protection or updates.  Included with purchase: 100 GB on Google Drive for two years and FREE wifi data 200 MB each month with T-Mobile 4G for life!", "Date": "May 19, 2014"}, {"Title": "Paired with Chromecast: Awesome", "Author": "Anne Gabriel \"My Husband's 'Tool Gal'\"", "ReviewID": "R1E1D6NQQ31SAN", "Overall": "5.0", "Content": "We're Boomers accustomed to paying for cable or satellite - but no more! We purchased this machine specifically to pair with the Chromecast so we could cut the satellite cord. I'm an IT journalist by trade. The machine works great as a laptop (someone complained about \"clacky\" keys but I'm not getting that). It's awesome streaming video onto our 2007 HDTV. We're not using the T-Mobile data plan - we just wanted this model due to the excellent reviews here and elsewhere. We are smitten.", "Date": "March 16, 2014"}, {"Title": "Hp chromebook 14 inch", "Author": "Dori Vogt", "ReviewID": "R2DVF3IKUWRFEI", "Overall": "5.0", "Content": "Best laptop I have owned! loads super fast and light weight. I absolutely love it. The only thing is the key board since it is a 14 inch laptop, i'm having to get use to the smaller keyboard. other than that its wonderful. chrome OS is definitely the way to go.", "Date": "March 13, 2014"}, {"Title": "Amazing laptop", "Author": "N. Sanchez \"ALeX\"", "ReviewID": "REKKYWLVBHI2M", "Overall": "5.0", "Content": "Get this laptop now for people that have used Chromebooks before. This laptop is the best I've ever and I've used apple computers. There is no reason for me to pay so much for an apple computer. I wouldn't even use one if it was given to me because none of them have 4G connectivity and I Apple's OS is NOT as simplistic to use as Chromebooks.I'm pretty sure if you using a computer for Photoshop you probably should know enough that a Chromebook is not for that BUT they are catching up, and I wouldn't be surprised if one day Adobe makes an App. But you don't need adobe to Photoshop on Chromebooks there are a quiet a bit of apps for sale that are decent if you are not taking pictures for sports illustrated.My point is this is the best laptop I've used. The quality is tremendous. Yes the screen isn't the best but its GOOD.The laptop looks like a $1000 dollar one.", "Date": "March 12, 2014"}, {"Title": "Great chromebook, well worth the money", "Author": "Justin G", "ReviewID": "R3FFP7YIPYOSC2", "Overall": "5.0", "Content": "Typing this review from my chromebook. I bought this chromebook because I needed something to bring to classes.  I can say that this is an excellent device.  This thing has terrific battery life (well anything is an upgrade from my 5 year old hp laptop).  The 4g is just an added bonus.  I see really no cons about this chromebook.  If you know what you want from this type of device, then this model can definitely suit your needs.Pros:LightExcellent battery lifeSleek-looking4gb ram helps things run smoothlyDefinitely worth looking into purchasing if you are looking for a nice chromebook!", "Date": "March 12, 2014"}, {"Title": "practical", "Author": "Rex Heck", "ReviewID": "R2JVIVUTROSVGK", "Overall": "5.0", "Content": "This computer does everything I was hoping. chrom os works well for the college setting. Taking notes, doing research, and checking emails; what more do you need with a computer in the classroom. This computer is not going to let you do video or music editing that I know of.. but that's Ok. Don't buy it for that.I installed chrumbuntu. Its really easy to switch between the two operating systems and Ubuntu gives me a little more options that Google. For example I can write and compile code on Ubuntu where I couldn't on chrome. With Linux installed the computer is just that more use full.If you want a sick computer to do basic everyday computing this is a good choice. Your not getting a retina screen but the screen works. Your not getting all the latest and greatest but it all works and for 400$ its quite the deal!", "Date": "March 7, 2014"}, {"Title": "This thing is awesome!!!", "Author": "james aslan", "ReviewID": "R3BE199BCBVF01", "Overall": "4.0", "Content": "Only 2 issues with it:1) The screen is not that great but it is functional2) The RAM is not up-gradable (not really an issue as 4GB of RAM installed is more than sufficient)These issues are MINOR and for the price this is a well designed and lightning fast device.", "Date": "December 30, 2013"}, {"Title": "wasn't sure what to expect", "Author": "Matthew Jones", "ReviewID": "R2UD9DKO7O358T", "Overall": "5.0", "Content": "I was completely surprised with how simple it was to get setup, and was off and running within minutes of opening the box.  The way some things work with the interface and keyboard took a little time to get used to.  The performance, simplicity and usability have all exceeded my expectations, and this has completely replaced my old laptop.", "Date": "December 18, 2013"}, {"Title": "This is the future of computers, PERIOD!", "Author": "Jaxworld", "ReviewID": "RUGHPK5AU5DSX", "Overall": "5.0", "Content": "Wow, is the best word to sum up the new Chromebooks. After using my iPad Retina for one year, I was bored out of my mind with it. That thing is so limited, I have no idea how they sell so many. Probably why I use an Htc One.  I got mine online from Walmart for $349 with two years of free 4G. That alone makes the iPad look bad. The HP with 4 Gigs of Ram is amazing. Fast, Fast, Fast, this thing is so fast. In 5 years I think Windows will probably be obsolete. After using a Chromebook you will never want to use a Windows  machine or a tablet ever. It's actually fun to use a computer again. Real web pages on a 14 inch screen. Not watered down mobile versions with NO FLASH! The screen is great and the touch-pad is perfect. Touch screen machines are so over rated. The HP's touch-pad is so much faster. Everything is already online and Google is the future of everything. I'll spend my money on a company that cares about information and bringing people together, not just the money. Microsoft had its time, and then the fruit thing, but the future is all GOOGLE.", "Date": "December 11, 2013"}, {"Title": "Awesome!!!", "Author": "jim", "ReviewID": "R1IDPVL7T2C45L", "Overall": "5.0", "Content": "Bought this computer for my mother as an early Christmas present, it is absolutely worth every penny. She wanted a computer that was easy to use, simple, and fast, this computer fulfills all that and then some. More can be done on this than most people think with a large google app store. It upgrades automatically and has built in security so no worries about viruses. Perfect for anyone who doesn't need all the extra software and programs.", "Date": "November 23, 2013"}, {"Title": "Already an integral part of my life", "Author": "Jay Ryser", "ReviewID": "R1OU08KNP1APKQ", "Overall": "5.0", "Content": "I've been using this all of a day, but so far, I love it!  I'm very aware of the limitations of a Chromebook vs. a laptop; I have a desktop that I use daily, a notebook that I use rarely, a 10\" tablet that I use several times a week (usually at the gym or other opportunities for reading, IYKWIMAITYD), and a Note II.  I'm already using the desktop less, and the Note II as just a phone.Well constructed, fast to boot, and snappy performance.  I may leave the tablet and notebook at home for vacations from now on.  Limitations?  Probably, but none that I wasn't expecting, but again, I knew the limitations before I bought it.", "Date": "November 17, 2013"}, {"Title": "Great purchase", "Author": "Sally W \"Senior\"", "ReviewID": "R2C8M6Z8ZHHFBZ", "Overall": "5.0", "Content": "Read all the reviews before making this purchase.  Have not been disappointed.  Nice apps, good speed and free T-Mobile 4G is a bonus.", "Date": "April 24, 2014"}, {"Title": "Very pleased with the purchase", "Author": "Janet", "ReviewID": "R1AX7DUXSKH5S1", "Overall": "5.0", "Content": "I had heard all good things about the chrome book. it works very well for me.  My family are enjoying it also", "Date": "April 16, 2014"}, {"Title": "4gb is where it's at", "Author": "Howdy Ho", "ReviewID": "R2KPXYHZXUJVWN", "Overall": "5.0", "Content": "I had an old samsung series 5 chromebook that was very sluggish when loading plus. This chromebook is very snappy. My wife and I are happy with the purchase. We keep it in the front room so it's always accessible when a phone doesn't cut it.", "Date": "April 14, 2014"}, {"Title": "Very fast", "Author": "Matthew Perdue", "ReviewID": "R2TGQPS80Y9PDD", "Overall": "4.0", "Content": "Great product. Not compatible (yet) with a lot of software, but incredibly fast, easy to use, and great for just surfing the web and creating documents.", "Date": "April 14, 2014"}, {"Title": "I bought this model at Walmart and it's great", "Author": "Andy", "ReviewID": "R2IXGAB3VC778B", "Overall": "5.0", "Content": "Very fast and light, plus easy to use.I'm not crazy about the chiclet keyboard, but most laptops have them now.Highly recommend it.", "Date": "March 29, 2014"}, {"Title": "Excellent!", "Author": "E", "ReviewID": "R140FRY79NNDTJ", "Overall": "5.0", "Content": "While not a full laptop replacement, this Chromebook has definitely earned a 5-star in my book while traveling.  It's light, quick to boot and work.  In my last few trips, I've left my Windows laptop at home and I've been able to do everything I need to do with the Chromebook.  Highly recommended.  Free 4G service is a plus too.", "Date": "March 6, 2014"}, {"Title": "Solid Performance as a Nice #2", "Author": "Joeyjoyjoy", "ReviewID": "R4SHZQEX9DUYC", "Overall": "5.0", "Content": "I would, as a starter, agree with one of a previous review that this is probably your best choice looking for a second laptop. The overall build of this model is solid, nice color and response time, which even came in a whole package of T-mobile data of 200MB/month for life. (Yes, it's an on-going promotion, I checked with the hp guys on the phone.) It runs swiftly with most of the projects that you'd probably want a \"normal\" laptop to be able to run and seldom chokes on any function, living up to the claim that had been quite popular ever since the manifestation of chromebook: It's as fast as your network.So, if you're any like me, you'd probably want to understand what's not so good about this particular model at this point, about which I shall be very honest with you:1 Dirt. Despite being a terribly appealing model and my color of dream of a laptop ever since high school, this Chromebook 14 Snow White does cause a serious trouble for neat freaks. One might face the challenge of constantly trying to clean up slight dusts on the outer shell and the glass-like screen. This process, despite not being extremely cumbersome, does pose as a disadvantage of those owning it.2. Screen. It doesn't have the best screen available. In fact, if I am to be completely honest with you, it's not even as good as my 2008 Macbook unibody, which is already entering it's 6th year of service. However, it does appear to be holding up to its job quite well, since the color rendering (being attacked by some reviews that I've seen as 'washed out') is no where terrible as one'd imagine from all online results. I would suggest that if you really are very worried about the screen resolution and color rendering ability, go into an actula store and have a look at it. I would say for most people, this screen should serve them as good as any mainstream laptops from my experience of visiting bestbuy two weeks ago.3. Weight. It's definitely heavier than MBPs, even the 15-inch one. But as I'm comparing this to my previous 13-inch Macbook, I really doesn't raise the red flag for me as a laptop that doesn't fit the job of being carried around. So again, if weight could be an issue for you4. Size. Fits nicely into classic Kanken, but anything that is any smaller could be a huge issue.5. Battery. Never got the advertised 9.5 hours. Maybe 6.5 if constantly watching video and 7.5-8 for browsing and handling documents.6. Stickers. Hate them, one was extremely hard to get rid of.Overall a satisfying buy. DO NOT consider this a viable option if you don't have a workstation available for heavy-task handling since the web app for windows/mac does lack certain important function and doesn't take any extensions. If it's any other case, feel free to give this model a try, especially when you're already a satisfying costumer with T-mobile data access.", "Date": "February 4, 2014"}, {"Title": "Perfect for on the go! Free Wifi on planes & cellular too!", "Author": "Travis", "ReviewID": "R2OAPY8JHJ0B4L", "Overall": "5.0", "Content": "I use this laptop now as my primary.  It is perfect for using the internet or even document creation. Best part is it comes with free cellular data and wifi passes for plane rides!", "Date": "January 1, 2014"}, {"Title": "Excellent, easy to use and reliable, windows will disappear soon", "Author": "Amazon Customer", "ReviewID": "R3PDGCO7ZST5TZ", "Overall": "5.0", "Content": "Super quick, reliable, long battery life, beautiful design... This is the future of laptops.  So far loving it.  It will continue to be updated and improved!", "Date": "January 1, 2014"}, {"Title": "Great but $80 cheaper at walmart.com or frys.com", "Author": "charlie", "ReviewID": "R2SCH7CE5X7LUY", "Overall": "5.0", "Content": "Great but $80 cheaper at walmart.com or frys.com.This is so much better than hassling with the ridiculous windows 8. Nice chrome has parental controls so you can whitelist only the appropriate websites for kids.Now if google would just make parental controls for gmail so kids could send/receive email from only approved contacts and see all emails kids would be safe.", "Date": "December 17, 2013"}, {"Title": "Google has done it again!", "Author": "Ian D. Smith \"ENERDROID\"", "ReviewID": "RSJY78MI7DUYX", "Overall": "5.0", "Content": "This thing is GREAT!  I already live in the Google/Android ecosystem and I'm so glad I can finally start moving completely away from Microsoft and windows nightmare.  After updating to windows 8 and 8.1 I was completely fed up.  The update crashed my laptop and it was unrecoverable.  My desktop has been my stop gap while I figured out finances.  I had been following chromebook since the beta hardware but was never interested because of the stupid tiny screens.  14 is my minimum.  while I still would have preferred a 15.5 I'm completely happy with the 14 inch.  I'm slowly migrating everything to Drive and googles cloud and cant wait until I no longer need to turn on this windows POS anymore.  Also I might ad that at 1/3 of the price of a similarly designed laptop (aesthetically is what I'm referring to not necessarily specs) it's an absolute steal.  In my opinion the look and build is comparable to HP's Envy series or macbook pro.", "Date": "March 9, 2014"}, {"Title": "Love my Chromebook!", "Author": "Amy", "ReviewID": "R31TVK6QA3MVNY", "Overall": "5.0", "Content": "Very happy with my purchase and I really could not beat this deal! The screen is crystal clear, the speakers sound amazing, and it runs extremely quick. I love the touch pad and get around my \"computer\" very quickly with all the shortcuts.", "Date": "June 11, 2014"}, {"Title": "Awesome Chromebook", "Author": "Johnathan Vail", "ReviewID": "R1T148QYONJRA6", "Overall": "5.0", "Content": "Yes it is a Chromebook and this is my second Chromebook so I won't go into why chromebooks are awesome.  I upgraded to this one over a first generation Acer which I loved but was underpowered for video and keeping up with current web requirements.  I was looking for something faster with more RAM.I used my first chromebook pretty much all the time and only powered up the PC for video editing or software development where I needed the tools.  It is so good I haven't been able to justify a tablet yet.So here's some things I love about this one: - The FREE 4G for life is quite handy when you are away from WIFI.  THe 200MB per month has been enough so far except one month when my wifi disconnected and I streamed on it a while.  (Protip: disable the 4g modem until you want to use it so this doesn't happen). - The 14\" screen is quite nice although the screen itself is quite shiny and is exceptional at showing the dust.  It is quite bright and good viewing angles. - FAST (for a chromebook).  I forget the Google Diesel ratings but the Acer was rated slightly lower than my Note 2 phone (I think about 3000 ish).  This one is over 10,000 and you can feel it too.  VIdeo is smooth and it can display 16 megapixel jpegs from my camera quickly where the old one was unusable about 5-10 seconds(!!). - NIce feel.  It feels strong and solid and the external surface has kind of a rubbery feel that I like. - Extended desktop!  If you use an external HDMI  monitor you clonoe or extend the desktop which I find quite handy to get some real work done with this. - HUGE battery life.  Rated 8-10 hours I think?  At least twice what my old one was.  Leave the charger at home, you won't need it. -  Uses phone style headphone and microphone jack instead of the old PC style dual speaker and mic jacks. - Better Bluetooth.  Maybe this is just Chromeos improvements but the old one was a bit flakey with my bt mouse and didn't support audio.  The HP works fine with my way old ebay bt mouse.The Not-So-Good - Built in battery.  I didn't realize this until later but I realized that A) The long battery life I don't need a spare and B) I never bought a spare battery for my old chroomebook in the 2 years I owned it.  Something to think about but probably fine.  And the simplicity of the case not having to remove the battery is a plus. - The \"chiclet\" keyboard.  I didn't like when I saw it but went ahead anyway.  They call it \"island keys\" or something and after my initial distaste it is a non issue.  If I had a choice I might like more travel in the keys but it is a non issue now.  One more note: some HP14s apparently had an option for a lighted keyboard.  That would be awesome and I am looking to see if it can be added with spare parts to this model.  No luck yet. - The white color.  I don't like the white but this model didn't have a choice.  White shows all the smudges.  Other HP14s have some interesting color schemes.  I will probably buy one or more of the \"skins\" you can get 3rd party when it gets too  dirty. - It has a fan.  It is a very very quiet but now that we finally got rid of spinning disks for magic data crystals (flash drive) can we get rid of all mechanical parts?  I know that some chromebooks no longer have fans but they aren't quite there yet with \"high end\" chromebooks.Slightly off topic PRO-tip: Unless you have a new printer that supports Google Cloud print the ability to print was a shortcoming of chromebooks.  You can print to PDF and take a memory stick to the printer but my printer only seems to read about half of them.  Recently I purchased a Synology Diskstation for long term file storage at home and it supports Google Cloud printing and my Canon wireless all-in-one printer.  FInally I can print directly and wirelessly (and from anywhere, I think) to my printer.", "Date": "June 8, 2014"}, {"Title": "free T-Mobile 4G", "Author": "Egoaldetarra", "ReviewID": "R2Y5OK7ROTW65E", "Overall": "1.0", "Content": "The T-Mobile SIM card was already activated by a third party.When I called T-Mobile they told me the embedded SIM needed to be replaced with a new SIM.Amazon gave me two options: keep the Chromebook without 4G and get a discount or return it.I returned it.The machine itself is a beauty. It works flawlessly. It is fast and sleek.The sound is adequate and the screen is nice.However since the 4G functionality was eliminated for whatever reasons, I give this product 1 star.After all, without the 4G it's of no use to me.", "Date": "June 7, 2014"}, {"Title": "Fast", "Author": "Iris Ortega", "ReviewID": "R1GX8YDOO173VJ", "Overall": "4.0", "Content": "Fast and convenient. Big drawback is you cannot plug in your manual printer and have it work. You have to program another computer that already works with your printer and the chrome book will send the print to that one. Instructions are in your chrome book and are easy to follow. But if your replacing a broken computer and haven't gotten a wireless printer you have to keep in mind you won't be able to print from your plug in printer", "Date": "June 3, 2014"}, {"Title": "The product itself is great! But package was missing products Promised", "Author": "Ray Rivera", "ReviewID": "R3VX5361MT9ZBS", "Overall": "4.0", "Content": "My White 14 inch ChromeBook is a dream, and everything I expected it to be. HOWEVER! The package was missing the SIM card promised for the Free TMobile 4G for Life. Upset about that and don't quite know who should take care of this issue, TMobile, Amazon or Seller?", "Date": "June 1, 2014"}, {"Title": "What a bargain.", "Author": "Debby Bond-lorenz", "ReviewID": "R3ONT9I2EF0P92", "Overall": "5.0", "Content": "This Chrome book is more than we expected.  It's fast, the battery doesn't get hot and the battery lasts a long time.  The screen is big and in HD.  For the cost of this chrome book and for what it does, we're thrilled.", "Date": "May 31, 2014"}, {"Title": "Not perfect, but great bang for the buck.", "Author": "Brian P. Adams \"Pastor Brian\"", "ReviewID": "R2E2SB7768H03B", "Overall": "4.0", "Content": "After having just had the computer for a few days, I have two main negatives:1)  The trackpad is very inconsistent; sometimes the cursor moves right where you want it to go the first time, and sometimes you have to stop and try again, when the cursor moves very little or not at all.2)  I can't hook the computer up to my tv, so that I can watch what is on the computer on the big screen.  There is no RGB/comp port, and when the HDMI is hooked up, the tv just shows the computer's background image and not the tv show I am streaming.But there are plenty of other positives:1)  Printing works just fine; not sure why others have problems.2)  Setting up t-mobile was very easy; all of the set-up was very easy.  I think I had everything working in about 5 minutes.3)  My old Acer Chromebook did not have bluetooth; this one does, so that I can project the computer's sound to my bluetooth speaker.4)  I love the Chromebook system - how easy it is to use, how it prevents computer problems because you never download anything.5)  I especially love how you can write a google doc anywhere, even where you can't get a t-mobile connection, like on the metro, and then when you get to an internet connection, what you just wrote is automatically saved online.  I have this continual problem where I want to save all of my documents online, but then I write them somewhere I do not have an internet connection and later forget to change them from a Word document to a google doc.  This is not an issue with the Chromebook!", "Date": "May 30, 2014"}, {"Title": "those chromebooks work", "Author": "larry murdock", "ReviewID": "R1L0PU8I4S995A", "Overall": "4.0", "Content": "after some intense frustrations with MS licenses, i purchased the HP chromebook for personal use.  i'm using it for biz now.  once you get use to google docs or the cloud quickoffice or even ms office in the cloud, the cbook works well.  kinda of like a tablet with a real keyboard, hard drive, usb ports and connectivity.  inexpensive and i received a free t-mobile subscription for their G4 data.  OK, i upped that for $20/mo because of my frequent travel, but i'm finding more and  more internet connections.summary: for $350 the hp-14-1070  is quite a deal.  doesn't take long not to miss windows, antivirus, slow downloading and disk cleaning.", "Date": "May 21, 2014"}, {"Title": "After 2 months it wouldn't power up from battery.", "Author": "Scott", "ReviewID": "RPVLPLCQ22YML", "Overall": "1.0", "Content": "After 2 months my Chromebook wouldn't power up with the battery. It would only power on if plugged into the wall. It was very difficult to find support online. Even more difficult to find a phone number to contact them. The phone call took way too long and they made me redo all the stuff the online support made me do before they gave me a phone number.", "Date": "May 28, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00FGOTBQO"}}