{"Reviews": [{"Title": "The Bigger Brother", "Author": "A. Dent \"Aragorn\"", "ReviewID": "R21TXO8G6H5LP4", "Overall": "4.0", "Content": "HP's Chromebook 14 is our third Chromebook because, after one year with Samsung Chromebook I came to realize that not only a Chromebook does almost everything a laptop or a PC or a tablet would do for me but it does it cheaper, usually faster and better, almost always worry-free and very much in style. We've ordered a nice HP Chromebook 11 since and now, because someone in our household wanted a one that was 'bigger', we went for the '14'.WHY A CHROMEBOOK?There's so much to say here but let me make a quick summary. And never forget that we are talking about an 'under 300' device here because, yes, anything that costs 3-4-5 times as much should do better most of the time.˕ Our Chromebooks are our most used computers excluding work hours and by 'computer' I mean PCs, laptops and tablets.˕ Malware, spyware, adware-free. Since nothing is really 'installed' on the Chromebook, I can't see how one would ever be infected. I am now using my Chromebook to open suspicious emails or click on dubious URLs that I don't dare touch from a laptop.˕ Extremely safe OS. I don't know if this is common knowledge but Google is constantly challenging hackers to crack their OS. As far as I know, Chromium wasn't cracked yet.˕ Easy to share among any number of users without any concerns of compromising privacy. If you have a Google account, you simply sign in and you are going to be within your own, personal environment.˕ Constantly updated and upgraded. Google updates Chromium every few weeks and I found my Chromebook actually getting better all the time rather than slowly fall into obsolescence. HP's Chromebook will not replace Samsung's, it will be used by another family member who really, really wanted one after watching my happy relationship with our first one.˕ Nearly maintenance free. Whenever I don't use a tablet or even a laptop for a while, they tend to get very busy for a while once I turn them back on. Tablets, especially, are almost impossible to use until all those dozens of updates/upgrades process. Not the case for Chromebooks. Whatever upgrades may take place don't hit my Chromebook. Whenever I call up an app, I get it in its latest version.˕ The attached keyboard helps a lot. Yes, you can pair a keyboard and even a mouse to a tablet but the Chromebook's keyboard is always there, it negates the need of a stand or even some protecting case.˕ Chromium is streamlined and efficiently focused where it matters, on the everyday uses most of us need a 'computer' most of the time.˕ Chromium being such a streamlined OS, browsing and running apps on a Chromebook is in fact faster than off a PC/laptop/tablet of equivalent specs.˕ Relatively low prince, 11.6\" display and light weight seem to be just about right for something that typically you'd be using to browse the Web while watching TV or take to and from school.WHY NOT A CHROMEBOOK?Yes, Chromebooks can't do everything. Google's productivity suites notwithstanding, they are mainly and they are best at media consumption rather than production. Nobody should buy a Chromebook and expect to be able to edit video or perform some heavy word processing or do some hard-core gaming. There are other machines and devices for such tasks. My experience is that a Chromebook can't do 'everything'. Tablets are more portable, PCs and laptops are more powerful but, to me, my Chromebook is the most fun to use and it's likely to stay this way. I am not going to call it my 'second' or 'third' or 'first' computer but, objectively, it's the one most use outside business hours if what we measure is 'hours'.HP's CHROMEBOOK 14 vs. Chromebook 11Having owned two other Chromebooks already, from the start, it was a very familiar feeling. HP's 14 is not 'exactly like' Samsung's and this big HP is quite different from HP's Chromebook 11 but it's easily recognizable as a Chromebook.Here are some changes:˕ DISPLAY: HP 11's colors are sharper and brighter and you can view the screen from almost any angle left/right or up/down. HP 14's is not as bright and the larger size doesn't come with better resolution.˕ KEYBOARD. It's a draw. I like both keyboards as they have a good layout and nice travel. As a touch typist I am comfortable with both.˕ DESIGN: HP 11's is more stylish design but they are both Okay as far as I can tell. HP 11 is nicer though.˕ PORTS: This is where the HP 14 wins big time. It comes with USB 3.0 ports vs. HP 11's USB 2.0 and full HDMI.˕ POWER: It's not too obvious but yes, the HP 14 is sometimes faster refreshing screens. Videos play equally smoothly on both.˕ SIZE AND WEIGHT: HP 14 is a lot heavier so if you travel and size and weight matters then HP 11 is the right choice. If your Chromebook is mostly homebound and most of your computing and media playing takes place in a room shielded from direct or indirect sunlight then the HP 14 gives you the bigger display advantage.Overall I like HPs larger Chromebook. It has better ports options than the HP 11, it's faster and you get a bigger screen on a body that's not as light and pretty.RATINGI am not going to compare a 300 dollar HP Chromebook with the Pixel or some top of the line laptop. I noticed that many 'pro' reviewers are complaining because Chromebooks and this particular one are not 'high end' and aren't as nice as the Pixel and such. Well... did anyone check the prices? So, yes, let me make a 'duh' statement: this Chromebook is not as good as devices that sell for 3 times or 4 times as much so anyone who doesn't mind paying more should pay more and get one of those. Even though... look at some reasons above for why one my prefer a Chromebook to a laptop or a tablet, regardless of price.HP's 14 is a four-star to me because it's at least as good and in some way better than my now one year old, often used and much trusted Samsung but I personally prefer the HP 11. As far as performance, they both appear to be up to the task and they both played Netflix movies flawlessly over Wi-Fi and cast them to the big TV through Chromecast.Chromebooks are not for everyone and they are not a universal computing device but, if used for what they are meant to be used, they are as good and as revolutionary as tablets.", "Date": "November 14, 2013"}, {"Title": "Just as nice as expected", "Author": "Just another Music/Web/Technology Lover \"rdf\"", "ReviewID": "RTJWBT025KO5A", "Overall": "5.0", "Content": "I had high hopes for this laptop.  I already knew the differences between a chromebook and a typical PC, so no issues there.I picked up this system from Walm*** a few days ago.  The model I purchased also includes 2 years of Tmobile data.I specifically choose the HP 14\" model because of its quality and size.  Much better size than the competing 11.5\" systems.  Also, true to HP, nice quality.Size, speed, quality, keyboard, trackpad are all great.  If I had one negative it would be the lack of lighted keyboard.  On the plus side, the system I received has 4 GB ram, so an upgrade from the 2 GB listed on Amazon.  This system fits its intended use perfectly.", "Date": "October 19, 2013"}, {"Title": "Really nice machine... feels very \"Apple\" inspired, great second computer", "Author": "Goldengate \"Goldengate\"", "ReviewID": "RDUTXQRIXBLVD", "Overall": "5.0", "Content": "I just bought the 4G version of this for fifty more at the local W-Mart.  The other big difference between that model and this one is that the version with the roaming T-mobile data plan (free for 2 years) also has 2 GB more memory so theoretically the machine should be faster than the wi-fi only version.I'll review the things in common however.Screen:  Good size, easy to adjust brightness with dedicated up and down keys at the top of the keyboard (just like Apple).  I'm reading that the Chromebook 11 version has a nicer display and that the 11 was actually co-created with Google vs. the 14 which was supposedly designed solely by HP.Appearance:  I got the machine in white.  Snow White to be exact.  It looks awesome on the kitchen counter.  The aluminum cover around the keyboard looks great and reminds me of much more expensive Apple machines.  (OK I'll stop mentioning Apple, the whole darn thing reminds me of a $1500 Apple in appearance)Speakers:  I'm listening to Pandora as I type this.  Zero bass response but speakers still sound decent for listening to music, but if you want bass, this is NOT the machine for you.  There is a headset jack.Connections:  Speaking of jacks, there are two USB ports on the left and one on the right. There's also a HDMI output on the left so you can stream video and audio to your TV.Usability:  No, you can't easily run Microsoft Excel and Outlook on this machine.  I've read you can remote into your networked desktop and use them there but I haven't used that.  However Gmail and the Google cloud based equivalents of the Office Suite are fine.  This machine starts up almost instantly... it's like turning on a phone.  You turn it on and moments late you are checking gmail and Facebook and surfing the web.I wouldn't want this as my only computer as I do need a non-cloud based computer as well, but as an inexpensive mobile computer I find this a great alternative to my iPad at half the cost.I asked Amazon if they will be selling the 4G version of this and really didn't get a definitive answer but I'm guessing since WM is already \"live\" with it that they have some sort of an exclusive deal for now.Also, rumor has it that Toshiba and Asus will be coming out with Chrombooks for the holidays so you might want to wait to see what they offer.My biggest concern about this model was the 2 GB of memory in the wifi only version...  the reviews of other Chromebooks I've read (and I've read dozens) indicate to me that Chrome really operates best with 4 GB if you like to have lots of open tabs.A great little machine!!!", "Date": "October 24, 2013"}, {"Title": "An outstanding device", "Author": "Krisztian Koncz", "ReviewID": "R3RSORGOVYG9IA", "Overall": "5.0", "Content": "Although I bought My chromebook 14 in the UK, it is not available on amazon UK yet, I had to buy it direct from HP. Like the T-mobile version here, mine comes with a built in HSPA+ radio that gives me superfast mobile internet in the area of London where I live, on par with wifi speeds pretty much. This is the first product I reviewed that got a 5-star rating although perhaps 4.75 stars would have been more accurate. The tiny flaws that it does have are balanced out by the stupendously low price, basically this is a machine you can easily compare to a macbook or a windows ultrabook that costs 4 times as much an it will still hold its own. Obviously this is a Chrome OS device so one has to do their research if they can live with a cloud-based OS and there is a very small learning curve when switching, but honestly Chrome OS is so easy to learn, almost anyone should be able to do it. I also wrote a detailed and critical review looking at every little aspect of the device, meant for chromies who are already sold on the concept but need comparisons with other chromebooks available on the market. For my money, this particular model is the best chromebook you can get out there, factoring in things like price, battery life, 4g connectivity and screen size. Without further ado here are my initial impressions:Initial Impressions about the HP chromebook 14 UK 3G version and comparison to the Samsung series 3Feel and QualityThis is definitely a laptop, it feels very different from the samsung, the weight is substantial, it is much bigger and the fan is constantly on and very much audible. I suppose I will just have to get used to the noise, but that is definitely a step back from the Samsung. Some reviewers noted they can only hear the fan when they put their ears next to the keyboard, definitely not the case with me, I hear it all the time when I’m in a quiet room. When I take it to the kitchen, where there is a lot of ambient noise from the fridge, it gets cancelled out and I can’t hear a thing. Most people probably won’t even notice the fan unless they use it at night in their bedrooms.KeyboardThe keyboard has a different feel to it than the samsung, it has textured keys and they keys have slightly more travel. Annoyingly, the keyboard is narrower than on the samsung despite the bigger size of the machine itself, so you get narrower enter, backspace and shift keys. The keyboard otherwise feels good and it is quite silent to type on, but not as much as on the samsung, perhaps that will change with time. The keys are not as rounded as on the samsung and I must say I prefer the typing experience on the samsung so far, but maybe I’ll get used to it in a few days. There is more key travel on the HP, that is definitely in its favour.TrackpadThe trackpad is the same width but slightly taller. I feel no difference in practical use, however the HP has a slightly loose trackpad that rattles every time I tap to click, which is annoying, so I find myself preferring to actually click the trackpad. Thankfully the trackpad requires less pressure to click than on the samsung and the noise is more satisfying. The loose trackpad feels cheap, I’m not sure if this is an issue with my machine in particular or if it is more widespread.ScreenThe 14” screen makes a huge difference in comparison to the Samsung, I don’t have to put on my glasses and I don’t have to zoom in or squint to see text properly. The bigger screen is the main reason I bought this machine and overall I’m satisfied. I did not find the lower PPI to be an issue, you tend to sit a bit further away anyways. The lack of an anti-glare coating is preferable in my case, text appears to be clearer and more crisp. The screen does reflect when switched off, I see no reflections when it is switched on, I keep it at about 80 percent brightness. Reflections from the blazing sun is not an issue we have to grapple with here in the UK. Maximum brightness appears to be about 10 percent higher than on the samsung, it is definitely noticeable and a welcome change. On the other hand contrast ratios are worse and colours are more washed out than on the samsung. Next to each other, the same background photo shows truer colours on the samsung, the setting sun is more orangey. The HP seems to struggle with contrast, for instance a light skinned person on a white background looks quite bad. Also, I find that I need to tilt the screen quite a bit back to get decent contrast ratios when writing and reading text on a white background, then when I watch videos I have to tilt the screen a bit forward to get better colour reproduction. It seems that constantly adjusting the screen is just something that comes with TN panels. But like I said, overall this is a pretty good screen for the price.Materials and Build qualityThis is where the HP truly shines compared to the samsung. This is a beautiful machine, well made, sturdy, quality materials, and the heft seems to add to the quality feel. The plastics used are much thicker than on the samsung, there is no creak when you pick it up. Mine is the snow white colour which is just amazingly gorgeous, I’m truly in love with the look and feel of this. This all comes at a price though, the bottom half of the machine is twice as thick as the samsung, the height difference is noticeable when you are typing on the table. As for weight, this is no macbook air, I definitely won’t be carrying this around as much. I plan to keep this for home use and take the samsung with me when I’m out and about.PerformanceI did not get the opportunity to test this extensively, so these are just initial impressions. My Samsung has increased scrolling performance markedly on the beta channel and when I go to google plus or the notoriously heavy Verge I see no difference between the two machines in normal scrolling. The HP seems to drop frames just as much as the samsung. Where I see a real difference is in loading times, pages load in about half the time on the HP and the waiting time to be able to scroll without jerkiness or checkerboarding is also about half of what you get on the samsung. Same goes for switching between tabs. Where the HP 14 really leaves the samsung in the dust is watching HD videos, there is just no comparison. The Samsung can just about handle HD streaming in netflix, but when it comes to youtube or other flash-based streaming sites, it struggles to play videos smoothly, there are missed frames, jumping and jerkiness. Also, I found that with the samsung switching between resolutions or going full window and back is problematic and really taxes the cpu. No such problems here, the HP plays everything beautifully, HD videos are crisp and fluid, they look beautiful on the large, glossy screen. Perhaps the only drawback of the glossy screen is when you watch dark scenes, you can see your own reflection a bit, but not a huge issue overall. The speakers are loud and clear, they are noticeably more powerful than the one on the samsung. Of course there is zero base, but they are still fine speakers for a laptop. Overall, if you like to watch videos and movies on your chromebook, the HP leaves the samsung in the dust, image quality, fluidity, responsiveness and speaker sound are all superior, but that is to be expected from a bigger machine.ConnectivityWifi performance is fine, same as the samsung, picks up signals easily. This model comes with mobile internet included. In the UK, as in the US it is an HSPA+ wireless radio. In the US this is marketed as 4G, in the UK this is considered 3G or 3.5G according to some marketing materials. It is faster than normal 3G, but it won’t be up to LTE speeds. The network provider is Fogg Mobile, a Swedish telecom company who have effectively outsourced the service to Three. I already have a mobile phone contract with Three and mobile internet speeds in my area are relatively fast (Wapping in East London), actually they are usually better than what I get from my BT wired broadband over wifi. Fogg mobile gives you 250 MB data per month free for 2 years, which is only enough to use in an emergency when nothing else is available. I will generally stick to wifi and tethering, but it is a good option to have and the sim is swappable, so you can easily get an unlimited mobile data SIM card from Three for around £15 per month which should give you constant internet coverage without having to use wifi or tethering. The only problem I have with Three is that they don’t always have their own masts, so when you head to central london you have to make do with the very low bandwidth that they manage to rent from other providers and at peak times that is nonexistent in places like the city. Still, you can insert a sim from any provider if they have better service in your area.I tested HSPA+ vs BT broadband speed in Wapping at 5.30 PM with no one else connected to the wifi network. Streaming speeds were 6537 kbps on three’s mobile network, almost twice of what is minimally recommended for HD video streaming. ON BT wifi I got 9837 kbps, which is around 50 percent higher but in real world use both connection speeds are fine.Battery LifeI had no chance to test this yet, at the moment I am at 90 percent charge and the machine estimates 7.5 hours of charge left, which seems to fall in line with what most people get. I’d say 8 hours is a reasonable expectation from this machine, but this will go down steeply if you stream HD videos. As for heat, the bottom of the machine is completely cool to the touch and it seems you don’t get the annoying spinning up of the fans that you get from windows laptops and macbooks when you tax the CPU. The Haswell microarchitecture really shines here.ConclusionOverall I am happy with my purchase, the HP Chromebook 14 is a significant step up from the Samsung series 3. What you gain in screen size, performance, quality and looks you lose in portability and weight, so you have to examine your usage scenarios to see if this is the right machine for you. My feeling is that for the time being this is the Macbook Pro of budget chromebooks. It is heavier and more expensive than the Acer C720 or or the Samsung, but it will serve you better as a desktop replacement and it is more suitable as a workspace. Built in mobile internet is also a huge plus in my eyes as unlimited data plans are becoming more common in the UK, so you could conceivably use this machine without ever needing to connect to wifi, therefore saving yourself a bunch on a wired broadband subscription. I think that the HP14 offers real value for money, particularly in the UK where laptops are significantly more expensive than in the US even if you factor in the 20% VAT. To give you an idea about the value proposition, the 3G model costs £279 whilst the Wifi only model is priced at £250 at the online UK HP store. To find a windows laptop that has comparable specs and build quality, you would have to pay at least twice as much, with apple you will have to pay 3-4 times as much. When it comes to chromebooks, the ACER C720 and the Samsung both cost £180 at PC World if you factor in the £20 cashback offer, but both have only 2 GB of ram. For the added quality and screen size, I think £70 is a reasonable price to pay if portability and weight isn’t paramount. It is also worth keeping an eye on special voucher codes, I managed to buy this model at a 10 percent discount, so I paid only £251 for it, there might be similar offers in the future.", "Date": "December 4, 2013"}, {"Title": "Coral Peach: Because, Damn it!", "Author": "Tiger \"Tigercaron\"", "ReviewID": "R2OGQT0N4Z9XW2", "Overall": "4.0", "Content": "Well yes! I made fun of the new HP Chromebook 14 (in Coral Peach, Turquoise and Snow White) when I first saw it. The new HP Chromebook line comes in pastel colors that they seemed perfect for a child’s bedroom. However when you take this beast for a spin, you may become inclined to paint the walls to match.This isn’t my first Chromebook. I own a slate grey Acer C710 with a 11 inch screen. It was hard on these old eyes of mine and I kept pumping-up the screen size to adjust. This Chromebook’s 14 inch display is just right. HP is known for it’s build quality and the HP Chromebook 14 doesn’t disappoint: excellent quality keyboard, speakers and an array of side port options such as two USB 3.0 and one USB 2.0 an HDMI port and an SD card slot for additional memory - Google take note! I love the Chrome environment. It does more than I ever use. At work I use Windoze computers and all day long I trouble-shoot Internet connection problems, password issues and viruses. Always Windoze, always windoze machines. Chrome is a pleasure to have because there are none of the burden of the Microsoft OS to worry about.There is no Ethernet option so it’s Wifi only, and the display pales compared to others I have seen. There are some trade-offs to a lower price, but I dropped one Star because of this.Yes, I bought the coral peach. Because I’m secure in my masculinity. Wanna make something out of it??!", "Date": "November 23, 2013"}, {"Title": "You wanted the best... you got the best/cheap", "Author": "Enrique Mario Aarón", "ReviewID": "R2VBF4CBD2NN1Q", "Overall": "5.0", "Content": "This is my second chromebookI bought the Chromebook 11 when it came out, and I have to say Chromebooks seem to be a great choice for the future, since people is starting to like more mobile devices, like phones, tablets, ultrabooks, etc.The chromebook 11 was a great experience, but then my mother liked it and I decided to give it to her (since we're on holidays and stuff) and I was looking forward to get another Chromebook 11 for me as well.Then I started to read reviews and watch comparison videos between Chromebook 11 and Chromebook 14. Those I've watched are good enough, and tell you most things you need to know. So I decided to get my second Chromebook, and it was the 14.Guys, this really blew me up, this Laptop is way much faster than the chromebook 11 (and i asume most ARM, 11 chromebooks out there) The sound quality is great too, display is bigger but definetly not better, and connectivity offers plenty of options.So, I know you can read specifications and a lot of opinions about this chromebook. I'll just keep it simple...If you want a great laptop, and you know what Chrome Os does, and what does not, YOU SHOULD GET THIS ONE, it is cheap, it is fast, nice build, solid, easy to use, etc. it does most things you need for daily use, and is really nice (i got the \"red\" one)", "Date": "November 29, 2013"}, {"Title": "This is the One for Senior Citizens!", "Author": "Peter", "ReviewID": "R3M52UBQPVNJH0", "Overall": "5.0", "Content": "I bought this for my 80+ year-old parents and they love it!  So simple for them compared to their aging laptop that was slowing down and having problems.  The Chrome Operating System is much cleaner and user-friendly than Windows.  No more daily calls from them to Tech Support (e.g. me :-) )  Quote from mom:  \"I don't even have to think to figure out how to use it.\"And, I can use Google Hangouts to take control of the machine in the event of any issues.  Worth 3 times the price for the simplicity!UPDATE 1/14/14:  It's been about two months and my parents continue to rave about how much they love it.  They can't believe how it starts up in seconds, it's so simple to use, it's fast (no hard drive chugging along), and they love the sleek look and feel (feels more like Macbook to me) .  Additionally, I haven't received a single \"tech support\" call from them since they've had it.  They don't have to worry about updating software, performing maintenance, and it hasn't frozen on them yet.  In fact, I'm thinking of getting one for myself.  If you can get by with just Google software, I can't see any reason to buy a laptop.  I gotta believe Microsoft is shaking in their boots! ;-)", "Date": "November 25, 2013"}, {"Title": "Love it!", "Author": "Renee Smith", "ReviewID": "R3HBFWP5GVGNHO", "Overall": "5.0", "Content": "I am not a developer nor do I have much knowledge about how computers work.  My old Toshiba was so slow, no matter what clean-up programs, anti-malware programs, etc. I could find. My son recommended that I get a chromebook, explaining that it is different than a regular computer, but will be fast. He was so right!  There is no wait time for booting up, just open it up and the chromebook starts up.  Moving to different websites is so fast!  Rarely is there problem opening any site - once a site was very slow opening and I got a message on the chromebook asking if I wanted to wait or to kill it. I chose kill it, and I got a screen with a sad face and text saying 'It's dead, Jim\".  That cracked me up! I really love seeing personality put into technology!  The only things I'm not up to par with yet are the photos.  You upload them to the computer where they are stored onto the cloud.  If you want to print or send one, you need to download to your chromebook to do so.  It's not hard, it's just that it takes me a little time to figure out how to do that. (I'm a senior citizen so in all fairness many things take me a little time to figure out.) I did upgrade to a cloud-ready printer, so I have no problems printing,  The Google Docs program does everything I need for creating documents.  The ONLY thing I have not been able to do download is iTunes and hook up my ipod to the chromebook. But my ipod has wifi access, so that's not really a problem either. The little time it takes to figure out how things are done on a chromebook is definitely offset by the speed at which it works. My son was right. For what I use a computer to do, this chromebook is fantastic. I am spoiled.", "Date": "February 22, 2014"}, {"Title": "Fantastic!", "Author": "cmck56", "ReviewID": "R30Q0OOPE4NGX3", "Overall": "5.0", "Content": "I didn't even know what a Chromebook was until about 3 months ago. I was perfectly content with my laptop, but I heard about Chromebooks and was intrigued by a smaller, lightweight laptop product that was strictly Chrome. I use Google Chrome ALL the time-and I was so ready to leave Windows behind.  I did a lot of reading on Chromebooks, both product descriptions and reviews-but it was actually seeing it and holding it that swung my decision in the direction of purchasing the HP 14\" Chromebook.  The bigger screen is perfect for my vision-challenged self-a smaller screen just doesn't cut it for me.  The speed is awesome, and I don't miss Windows AT ALL. I couldn't be happier with my purchase! I admit I'm probably barely tapping the potential of Chrome, but I'll get there.  For what I wanted, this was the right choice for me.", "Date": "February 15, 2014"}, {"Title": "Woohoo!", "Author": "Chromie", "ReviewID": "R38OUWSXLOO91C", "Overall": "5.0", "Content": "I picked up a snow white 4GB RAM + 4G T-Mobile model from Walmart for $349 (plus sales tax).Beautiful machine. Solid build. Very fast - much faster than my Samsung 11\" Chromebook. Great keyboard too. And nice large screen.I don't know why some say the screen is not bright enough or sharp enough. It's plenty bright and sharp. It's much better than the Samsung 11\" screen. Granted, this HP 14\" screen is not as tack sharp as some high resolution screens I've had in $2,500+ notebooks in the past, but then this system is not $2,500, or even $1,000. Due to some online comments I had read, I was concerned about the screen before I bought it, but I am VERY happy with it!My only knock on the system was that, initially, it did not appear to support a wireless mouse. When I first booted it, neither of my two Logitech M325 mice would work. On my second boot, however, the system's Chrome OS did an automatic \"update\", and the wireless mouse started to work fine! And it's been working flawlessly ever since! Woohoo!I must say, dollar for dollar, this is the best computer I've ever had. When I think of the $2,500+ I paid for notebooks in the past, I want to cry.More, unlike the smaller Chromebooks, like my 11\" Samsung (which by the way is great and is being used by my daughter for school), this HP 14\" baby can actually serve as a desktop replacement.I'd give it 6 stars if it was an option.UPDATE: Microsoft is now so afraid of the Chromebook that it has hired the two old fat guys from the show \"Pawn Stars\" (who know diddly about computers) to trash the Chromebook in an ad! It's a pretty sorry ad. Even here on Amazon, you will notice, of late, the sudden appearance of a few negative reviews for the Chromebook 14, where before there were literally none. You can bet these are paid Microsoft trolls. Pay them no heed!", "Date": "November 4, 2013"}, {"Title": "Great Chromebook, but not a laptop replacement", "Author": "Kcloos", "ReviewID": "R1ULALZ0LAZS16", "Overall": "4.0", "Content": "Now I know why these are called \"Chomebooks.\" You can't do anything that can't be done within a Chrome web browser. This is definitely not a replacement for a laptop, and I was hoping that it would be. It does boot fast, is incredibly light and attractive and has an amazing battery life - depending on what you're doing, you can get eight hours or more. But you are limited on what types of files you can open, and you can't put any programs on it. You must use the Google equivalents instead; for example, Google Hangouts instead of Skype, Google Docs instead of Word. You can download web apps, but tablet or Android apps from Google Play will not work.All that being said, every Chromebook will have those limitations, not just this one. There are some huge benefits to the idea of a Chromebook, too. I'm coming to this laptop after having a MacBook for five years and refusing to get a PC, and it feels very similar to me. The operating system runs very smoothly and is not clunky in any way, and I love it. It's very easy to set up and figure out how to use. Everything you do is backed up to the Google Cloud, so you can access everything anywhere.If you fully understand what a Chromebook is and that it is NOT an adequate replacement for a laptop if you regularly use anything other than a web browser and word processing, I would highly recommend this one. It's fast, it's light, the screen resolution is great, and it has a much larger screen than many other Chromebooks. The color is really quite pretty, and the soft finish feels great. It also seems to pick up WiFi connections from further away than my old laptop, and I have not had any major issues with pages not loading or videos or video chats lagging. The speakers are on the bottom of the computer, which seems a little strange, but it makes things sound louder when the computer is on a hard surface. I've never felt that it doesn't play loud enough. There is a fan, unlike some other Chromebooks, so it doesn't run silently, but I definitely wouldn't call it loud.Finally, what sold me on this is that it came with two free years of T-Mobile 4g. I'm not sure if Amazon also offers this deal (I bought it in a store), but it's a great deal for the price.TLDR? If you need a full-blown laptop with the ability to install programs, this isn't for you. If all you need is a place for Facebook, reading news, taking notes in Google Docs and watching Hulu and Netflix, this is exactly what you're looking for, and it's a great buy.", "Date": "October 14, 2013"}, {"Title": "Shockingly Good Computer!", "Author": "R. ANDRESCIK", "ReviewID": "R33BA9P9X7PPDQ", "Overall": "5.0", "Content": "Fast! Battery lasts a LONG time between charges, great screen. Wow! One other thing I noticed ... I had it in my lap for several hours, and it never even got warm underneath. I used to have a Macbook Pro and it literally cooked my legs. The Chrome OS is terrific. Most of us spend 99% of our time in a browser anyway. GET ONE OF THESE!", "Date": "November 15, 2013"}, {"Title": "I was skeptical, but now I'm sold", "Author": "Elizabeth K Wylie", "ReviewID": "R1SDJIKI28Y59", "Overall": "5.0", "Content": "I purchased my Chromebook from walm*** because at the time everyone else was sold out, sorry amazon. I'm a coder/application developer in a graduate research program so I have a linux server that I work off of most of the weekdays either from the office or via secure shell (in the chrome store) and I can remote desktop to my old windows and mac machines. I love the chrome app, it's just like terminal but doesn't have all the glitz-y add-ons that macs can get - so much better than powershell, sorry windoze. I was a bit skeptical of the Chromebook, but I have to say - I'm really impressed and I really love having everything (personal) in the cloud. I obviously work from multiple machines frequently and it was always messy to keep track of where which file went depending on which server I was working at or which home machine I grabbed because my husband was using the other one. Now I just throw everything in my 100 GB Google drive and I can access it from anywhere plus it's automatically at my fingertips when I open up my Chromebook. Do I miss word and other proprietary software? A little, but really are the freeware versions all that bad? Or are we absurdly loyal to brand names that continue to fail us? I've learned you can replicate anything Office or most proprietary software can do with open source or cloud programs and a little python scripting.", "Date": "November 24, 2013"}, {"Title": "It is BLAZINGLY FAST!!!! (Additional negative TWO notes added)", "Author": "Knightwind", "ReviewID": "R10HK88EFCFO25", "Overall": "4.0", "Content": "Second negative comment on this product:  It DOES NOT SUPPORT DIRECT PRINTING!!!!  How on earth could somebody create a laptop like computer that CANNOT PRINT!!!  To be fair, when I bought this machine, I had no intention of printing from it.  Rather when I need to do those kind of tasks, I do those on a Windows based PC.  But I had recommended this laptop to somebody, NOT REALIZING that they would need to print from it.  I had lauded only the features I had needed, and didn't even investigate something that ANYBODY in their right mind, would design into a laptop-like computer!  I just assumed it was there.  It's not.  Now Google has a \"work-a-round\" in that you can do \"cloud printing\".  That's assuming that you can make THAT work, because the person who is having this problem with their HP Chromebook is NOT able to get it to work, and so far NONE of the suggestions they have found offer a solution.  The ONLY way I have found to print from a HP Chromebook is to print to a PDF file.  At least they build that ability in.  Then I email the PDF file to a Windows based computer, and then print it.  I tested that, and it worked beautifully.  Considering that the HP Chromebook has an abundance of USB ports on it, surely they could supply at least a basic driver that would work with (hey, you specify which printers).Original review follows this additional update:I tried pairing the HP Chrome-book using it's blue tooth technology with a Bose blue tooth speaker.  First, I tested the Bose speaker using my iPod with a blue tooth transmitter on it.  The sound quality was quite good. The disappointment came when I tried using the blue tooth from the HP Chrome book. The music stored on the Chrome book plays, but at the beginning of each song, there is stuttering, and after a few seconds, it's like the systems finally catch up, and then mostly, it plays okay, but there are hiccups every so often. When I tried the Hangout function, placing a visual/audio call over the internet, the picture is about 1 to 3 seconds before the voice, which is very disconcerting. Yet, when I turn off the blue tooth on the Chrome book, the sound reverts back to the computers speakers, and then there is absolutely no delay. Conclusion for me is that the HP Chrome book has an issue with blue tooth, and it's simply not useable for conversations, and disappointing with music. Distance between the devices made no noticeable difference. It sounded about the same whether it was 3' or 15'. Because the Blue tooth does NOT work PROPERLY with the HP Chrome Book, I had to reduce my star rating from 5 to 4.  It's not a game changer, but it is disappointing that HP apparently did not test this feature properly.  I know my Blue Tooth speaker system is good, because it plays perfectly with an iPod using Blue tooth.  (ADDENDUM:  The Chrome Book and the Bose speaker work PERFECTLY WITH A CABLE.  HP might as not have bothered putting Blue Tooth on this Chrome Book.  It is flawed.)Original Review:I ended up not ordering this from Amazon because Amazon did not directly stock it, and therefore I was worried at the terms and conditions of some of the third party vendors selling through Amazon, which give the distinct impression that if you don't buy the second year of support, that they are not responsible from the moment they ship it, if it gets damaged.  Therefore I bought it from a vendor I like and trust to cover a product if it gets damaged in shipment.That said, this is the best laptop (like) computer I have ever purchased, and I will NEVER, EVER buy a Windows based laptop again.  Period.  Now I can \"get away\" with this decision because I only use a laptop for web access and email, and nothing more.  I don't have the need for Windows compliant software.  Obviously, your needs may be different.Best thing I've experienced with this Chrome-book is the absolute SPEED!  I lift the lid, and the system is READY to go in 2 seconds, or less!  I do NOT have to worry and wait while that clunker Windows operating system takes up to 2-3 minutes to load.  I do NOT have to wait for Anti-virus software to verify it's up to date, and if it's not, wait possibly 10-15 minutes for it to update.  I so NOT have to wait to see Windows patches lining up for about 20 to 40 MINUTES of downloading, installing, re-booting.  All that stuff made me loath even turning on a Windows based laptop (and the one I WAS using had a fast hard drive in it, and had 4 GB of memory in it, along with the second fastest Intel CPU.All the applications on the Chrome-book run flawlessly.  No problems and the \"learning curve\" is very quick.I very highly recommend this device!!!!(a couple of minor points - (1) the USB 3 slots are quite stiff - you may have to push harder than you feel comfortable to get say, a memory stick, in there.  That said, I had no problem inserting a 32Gb mini-stick in there with all my music on it.  The file manager came up immediately, and I was able to use the folders I set up originally in Windows to get to my music.  Once you start playing a song in the folder, the system automatically continues playing other songs in the same folder.  (2) I like using a mouse, but I can see that using the touch pad is definitely smoother, and faster.  I'll probably use both for a while, and see how that shakes out.  The speed of the touch pad is far quicker than the mouse.  (3) Gmail is just like on a Windows based machine.  It works pretty well, once you get it set up the way you like it.  My only reservation was that on my Windows based system, I was using Microsoft Outlook, which can be set up to run with several email boxes (accounts), and automatically downloads all the boxes on a regular basis.  With Gmail,. you can only have one email account.  (4) The screen size - I went with the 14\" because I had experienced the Samsung Chrome book which is 11\" and I didn't like the small screen because my vision isn't that good.  However, even with 14\" screen, I was straining to read web pages.  The solution is to set the display at 125% and that boosts the print of most web pages to be read easily.)", "Date": "December 12, 2013"}, {"Title": "Initial thoughts", "Author": "M. Schmidt", "ReviewID": "RV7M359ANDDIU", "Overall": "5.0", "Content": "This is our 3rd Chrome OS device. Last year we purchased 2 Samsung Chrome OS devices for our daughters. I was drawn in by the concept of an OS that you didn't have to update or worry about virus software and making sure everything was up to date. We also have a mac and a HP laptop running windows 7. So I'm well familiar with the different operating systems and there strengths and weaknesses. I particularly have issues with windows OS. My wife and daughter were always calling me at work with problems or programs asking for permission to update. I'm not an IT wizzard and know enough to be dangerous...lol Anyway I found it frustrating for all of us. I can say thanks to the Chrome OS ALL of those issues have gone away! No calls on having problems booting up, no phone calls on programs asking permission to update. No phone calls on system warnings about viruses and other stuff.I think a good way to approach the Chrome OS is looking at it as a tool. Windows OS is a tool that I use at work. I have applications that I need to do my job. My mac is another tool that I use for recording music in my basement studio and it works great for that.  Chrome OS is a tool for doing pretty much everything you'd do online. Email, banking, social media, Netflixs, Google also has been busy with the help of developers in creating offline apps if you need to do simple photos edits or listen to MP3's type a document. This is where my wife and kids do 100% of their stuff so Chrome is perfect for them. Chrome is perfect for me typing this review in Amazon and I use it exclusively for everything I do outside of my music stuff.Okay enough about Chrome OS and onto the Chromebook 14. Moving to a 14\" screen is nice compared to the Samsung 11.6\" screen. I found the screen to be clear and easy to view. In Chrome style it boots super fast, under 10 seconds and unlike windows even after a years usage it's still just as fast. Compared to my other daughters laptop that takes close to 2 minutes now to boot. My mac has a SSD and boots in about 20 seconds consistently. I love the Chromebooks size. It's small and lightweight at 4 pounds compared to the other windows HP laptop we own. The battery life is really good again compared to the HP laptop running windows. I'd say it's easily double the battery life. It's been an enjoyable experience so far.There are a couple things to be aware of before you invest in a the Chrome operating system. Be aware that you can not connect directly to a printer via a usb cable. This isn't an issue for us because we have a wifi printer connected to our home network and can access the printer via google cloud printing. Works great and I haven't had any issues with this setup. The other issue may be input devices. I personally like using a track ball instead of the touch pad. So this is a drawback currently to Chrome OS. I'm hoping as the Chrome OS gains margins that MFG's will start supporting the OS with some of these input devices. It's not a deal breaker for me just a minor inconvenience. Other then that I've been very please to date with the Chromebook 14.If any major issues come up I'll update my review. To date I've been please with this product. Fast and easy to use, no updates just boot it up and go. Can't ask for anything better then that. Oh, and you'll never see the blue screen of death like in other operating systems... :)", "Date": "December 18, 2013"}, {"Title": "Much love for the Chromebook", "Author": "Ruben Mera \"ruben_mera\"", "ReviewID": "R11D6O1JDMSFKS", "Overall": "5.0", "Content": "All that Microsoft hate towards this product just made me get one right away, and I'm so glad I did.What they attack about this computer is really it's biggest asset.They state: \"Doesn't have Windows\"I say: I only need a robust operating system for my home computer. On the go, I actually prefer a lightweight device with a decent screen to access a website, send a couple of emails, and manage photos, music, or video, without painful loading times. You will be amazed at how fast you can boot up, git-r-done, and shutdown.They state: \"Doesn't have Office\"I say: It has an excellent substitute, Google Drive has all you need for Word Processing, Spreadsheets, Presentations, and more, and it's included in your gmail account for FREE! versus paying Office 365 Home Premium for $99.99 per year or buying the other packages that go from $139.99 all the way to $399.99. Is adapting to a new free alternative really that much of a problem?They state: \"Doesn't work without Internet\"I say: not exactly, it's capabilities are limited without internet, but what else would you expect from a machine specifically built for cloud computing? Have you ever really needed to use a computer without access to the internet lately?They state: \"Google makes money on advertising from your information\"I say: this is just laughable, is this Microsoft talking to me about information privacy from advertising?In the end, I truly believe that...Most users can benefit from this because it is a lightweight, fast, and effective portal to what you need from the net.I currently have:- Macbook Pro 15\" (2.7 Ghz Intel Core i7)- Nexus 4 (Android Smartphone)- HP Chromebook 14", "Date": "January 19, 2014"}, {"Title": "Great MacBook Alternative", "Author": "D. Veracity \"Mac Guy\"", "ReviewID": "RQTJWNXTFKFQ", "Overall": "4.0", "Content": "This review is intended for those who have a Macbook, but who are interested in getting a less expensive mobile machine they can use with ease, like a Mac, but without the worry of an expensive Macbook that could get lost or damaged.  At $349, the HP 14” Chromebook is the perfect solution.The HP 14” Chromebook also comes with 200MB of free 4G T-Mobile Data each month - for two years - not a lot of data, but if you’re not at home or at a hotspot and need to check something out, this is a nice feature.Back to basics - The 4G 14” HP Chromebook feels, looks, and acts a lot like a MacBook. In some respects it’s even easier since the whole OS is the Chrome browser.  There are “settings” but they’re pretty easy to figure out, so it’s really quick to acclimate to the differences.The keyboard is excellent and the keys have a nice rubbery texture feel - a good thing, no complaints.  The trackpad is a bit wacky at times and it can indiscriminately click on something as you guide the cursor across the screen.  It also isn’t perfect at highlighting, but it’s not bad.  There are also some limited gestures - two finger swipe to the next page and two finger drag up and down.  I have also stumbled onto a “CTRL - two finger swipe” that enlarges and minimizes the onscreen display - kinda like the MacBook pinch and expand gesture.  It’s very sensitive, but it works and I use it often.  DIdn’t find any documentation on it btw, but it does work.The outside surface behind the monitor is a white matte finish (white on my machine) and there is a 1” (or so) silver HP logo in the middle.  The matte finish is a bit shiny from the oil on fingertips.  I haven’t tried cleaning it yet because I’m a bit apprehensive on what would work best, but it’s not really too noticeable except at an angle, so I’m waiting.  I also like the white bezel around the screen and it has a small silver logo centered on the bottom edge.  The bezel also has a thin 1.5” rubber bumper on each side and a long 12” rubber bumper along the top with a the web cam mounted in the lid.  Going with the Google pastel colors, I have a high tech yellow bandage over the web cam, so no opinion re it’s quality/use.  The screen itself is good from most angles, but I notice a “negative” type image at extreme angles.  That said, I don’t look at the screen at extreme angles, so it’s not really a big deal unless I’m trying to show someone something.  The area around the keyboard is silver, it looks like metal and feels good so although I can’t imagine why it isn’t white, but it is silver on all the models - wonder why? haha  The bottom of the laptop is a white textured rubbery coating and it still looks like new almost a month later, because there are four rubbery feet that lift it off the desk.The left side (back to front) has a Kingsington lock point, HDMI port, two USB ports, an audio in/out jack and an LED on light. On the right side are (back to front) power port (with a 90 degree angle plug), an SD Card slot, a USB port, and the 4G mini card slot (which came installed and preconfigured).  The bottom has nine screws and four rubbery feet. There are two audio “slots” and two perforated heat screens (molded into the body).Overall the laptop has a great feel, solid, and gives the impression of quality.The 4GB memory, which is only on the 4G model, also handles video/multiple windows without any noticeable impact (unlike the 2GB memory model I had before - an 11” Samsung).When I first got the Chromebook, I was a little bit apprehensive about its capabilities and although it isn’t a powerhorse like a MacBook, it is certainly capable of handling day to day needs and it has become a fast friend that filled a gap in my mobile needs.  My vision is much better suited to the 14” screen and I like the real estate to spread out as well. I also don’t like the portable keyboards used with tablets, so the full size keyboard of the Chromebook is a a big bonus as well.Google Chrome offers a “dock” along the bottom to position your favorite apps (I haven’t figured out how to relocate it to the side or even if it can be).  A couple nice features about the browser are that you can click and drag a “tab” to create a new window and you can also drag a window to the side and it will auto-anchor it.  That last feature however, gets in the way sometimes if you’re trying to set up two windows side by side. But, it’s no big deal.AppsiCloud works well on the Chrome browser and I’m also able to use the beta versions of iWork, although when I open those apps, I get a disclaimer that they may not be fully functional in my browser - none the less, they seem to work well.  iCloud mail, also works without any problems.The Chrome Web Store offers a lot of apps that, like the AppStore allows you to use them for free.  I don’t even know if they have ANY that cost or at least I don’t remember seeing any.  I originally thought the Android apps would work on a Chromebook, but it was just a misunderstanding - they do not.Before I close I also wanted to say that I also considered going to a full feature Windows machine, but I thought going to Chrome would be a lot easier than learning Windows 8 and that was a good decision. Along with the free software, automatic updates, and built in security with everything going through Google, Chrome OS is a great alternative to Windows, Chrome is easy to learn, no drilling down to get to settings, so even if you don’t know where something is, it’s not that far removed.  Overall Chrome OS is great and if you’re looking for a second computer to supplement your Mac, join the Chrome cloud, I seriously doubt you would be disappointed, it’s turned out to be a very nice computer.", "Date": "October 23, 2013"}, {"Title": "Awesome computer for a very cheap price", "Author": "tedhiltonhead", "ReviewID": "R37TK4I0QA9MQI", "Overall": "5.0", "Content": "I bought this computer to replace my aging Macbook Pro.  It's an awesome machine, with very fast bootup, the high level of built-in security from ChromeOS, powerful Intel processors.  I have been touch-typing for my whole life and a good keyboard is a MUST for me -- this one is great to type on.  It doesn't have all the Google-designed subtle features of the HP Chromebook 11, but unfortunately I have to do without those to get the bigger screen, more RAM, SD card reader, and Intel instead of ARM processor.  Note, I purchased the version of this computer with 4 GB RAM instead of 2, and built-in T-Mobile 4G service.", "Date": "October 30, 2013"}, {"Title": "Nearly perfect", "Author": "R. Vail", "ReviewID": "R2ARKPI02B7P5F", "Overall": "4.0", "Content": "I finally received the Amazon version of this HP Chromebook 14. It does have 2Gb of RAM vs. the 4Gb in the Walmart-sold version. It also has no sim card slot.My initial feelings are very positive. The size and weight feel just about perfect. Not too light/cheap feeling, but nicely weighted and portable. The keyboard is excellent. I'm \"upgrading\" from a Sony Vaio laptop and the keyboard feels very similar with just a bit of texture on the keys. Performance seems to be more than adequate, although I haven't tried to stress test it in any way yet. The Intel processor runs cool. I've only heard the fans spin up once for a minute or two, otherwise they run slowly and quietly. Battery life has been excellent. I have had to adjust to using the trackpad , but it seems to work fine. There are some settings you can change to customize it or there are plenty of USB slots if you'd rather use a mouse. Also of note, the laptop has Bluetooth built in.The screen seems to be the weakest feature. The positives are the size and the wide range of brightness settings. The screen can get very bright, but you can all set it very low and even completely off. The HDMI port allows for several display configurations. You can mirror the display, extend the desktop, and set the external monitor to be your primary display. On the not so nice side is the resolution. 1366 x 768 on a 14\" screen is usable, but not ideal. A 1440 x 900 screen would have made me give it that fifth star.My main gripe with the Chromebook, and from what I'm reading it maybe a Chrome OS issue, is the color temperature of the screen. The screen is clearly skewed too far in the \"cool blue\" color spectrum. I did some searching online and have found other people, using other Chromebooks, complaining about this as well. From what I can tell there is currently no fix or adjustments available. If you are into photography, like I am, be warned that the screen does not accurately reproduce colors like an Apple or Sony display.Overall I'm happy with the purchase. It makes a great \"around the house\" laptop or would be great for a high school or college student whose studies don't require special software (engineering, art majors, etc.).", "Date": "November 13, 2013"}, {"Title": "Got it for my mom and now I want one", "Author": "Tehmina", "ReviewID": "R2WA6UTPEO9ZBV", "Overall": "5.0", "Content": "No blips yet! So far so good.Light, fast and super simple to use. Perfect for the technologically impaired, it's *almost* like having an iPad with a laptop interface. It's also great for techies who travel - if you dick around on your smart phone all the time, then there's a good chance you'll find this fun/useful. It's also shiny and nice, you just *want* to use it - my macbook pro is sitting in my backpack right now and will probably stay there until I have to edit my demo reel.Other stuff:The Google cloud situation really comes together nicely in Chromebook. All the usual google apps are now little icons in the \"start\" menu. User accounts are easy to manage and there's something quite lovely about having your preferences being loaded up onto your computer - it's essentially the same as using Chrome anywhere, but on the Chromebook it feels integrated. Also a nice touch - there's a local folder called \"google drive\" which syncs with the online google drive just like Dropbox.So far it's staying cool. I know there's not a lot of heavy lifting, but it's nice to have a laptop I can put on my lap (unlike my macbook pro). Battery also seems to last quite long though the hour estimates are wonking between 8.5 and 10 hrs at the moment.Network jazz is easy to deal with. Finding things like your IP and Mac address is all there in the bottom right of the screen, along with battery juice meter, chrome settings, and other stuff.My mom *loves* the color, the feel and the speeeed. I was expecting her to balk at the cloud - but the chromebook is so simple and pretty, she actually loves the idea (phew!).I couldn't be happier with my purchase. I'll post an update if it craps out.", "Date": "May 15, 2014"}, {"Title": "Good Chromebook That Could Have Been Great - Initial Review", "Author": "Tyson Chaplin", "ReviewID": "R1MYKIM4UJKCKJ", "Overall": "4.0", "Content": "I recently purchased a quantity of these chromebooks for the school I work for to be used by the teachers and staff. I have used my HP Chromebook 14 for almost a week now and I think I am really going to like this notebook the more I use it but there are a couple of things that nag at me ever so slightly.First, the RAM in the computer is not upgradeable. The models I purchased had two gigs of RAM in them and those modules are soldered on to the motherboard. This means no upgrading done by me down the road. I cannot complain a lot because the chromebooks only cost $300 but it was something that I wish I could do in order to increase the lifespan of these guys. On that note, the battery is not replaceable by the user either. Not a deal breaker but something to keep in mind if you are like me and like to be able to maintain your hardware as it ages.On the upside, I really enjoy the bigger screen the HP Chromebook 14 has to offer. So many Chromebooks have tiny screens, which is great on battery life but make it hard to use as your primary computer when you have a lot of tabs open and like to multitask like I do. I am also a huge fan of the keyboard. Again, Chromebooks tend to have rather cheap keyboards but the key presses on this model are crisp and typing is rather enjoyable. Typing isn't quite as enjoyable as it may be on my Macbook Pro or a mechanical keyboard but for the price of this unit, I don't expect it to be. I do enjoy typing on this notebook much more than I thought I would.Lastly, I really like the finish on the outer shell of the Chromebook. The white looks nice and the finish is a little bit grippy. It makes the notebook feel and look like a higher quality build than it most likely is. Obviously, this doesn't impact the utility of this computer but looks never hurt either.Also, while this doesn't apply to the \"snow white\" color scheme, if you are interested in the \"peach corral\" color, be warned it is very pinkish. Obnoxiously so. It looks much more red in pictures but when you see it in person, it is a hard color to look at. The blue-ish color scheme also doesn't look the same in person as it does in pictures. It is more of a turquoise and less of a green. Just thought I would mention this in case potential buyers are looking at the other colors. I bought a few of each color and the white is definitely the more polished and professional looking of the three colors available for this specific model.Like I said, my initial impression of this Chromebook is that it is a nice machine and it is probably the first Chromebook I could see as a viable replacement for a Windows or OS X based machine. Nice screen, nice keyboard, I just wish users could upgrade it themselves a little more.", "Date": "March 24, 2014"}, {"Title": "Amazing for students.", "Author": "akmacadam", "ReviewID": "R3HE8SHB6KVYLR", "Overall": "5.0", "Content": "I am currently a Junior in high school, and with my busy schedule (spending a lot of time at school with rehearsals and such), it was hard to be productive when I was not at my desktop computer, since most of my homework is web or essay related.I had always been interested in the Chromebook line, because I knew that I would need a laptop going into Senior year (with all the college applications that I would need to find time to do in between rehearsals at school).When the Chromebook 14 came out, I was immediately drawn to the size and appearance of the product, as well as the many reviews saying it was \"the perfect laptop for a student\".  I didn't need a fully-loaded Macbook (neither could I afford one), since I could still use iTunes on my desktop when needed.  I had already been working solely off Google Chrome, as well as Google Docs and using Spotify (which, by the way, are the best), so I knew that a Chromebook would be the perfect fit for me.I bought the Chromebook 14 about 4 weeks ago now, and can honestly say it is one of the best purchases I have ever made.  It fits all my needs and more, and is very easy and convenient to take to school and back.  It turns on in seconds and holds a full charge for about 7-8 hours.  The keyboard and trackpad are very high quality, and coming from using a wireless mouse with my desktop, find it quicker and easier to use a trackpad.  This laptop overall has a very chic and sleek appearance, and DEFINITELY feels and looks more than $300.Overall, this is an EXCELLENT product for any student or someone who needs a secondary computer, or even on its own.  I would highly recommend this to anyone who is thinking of purchasing a laptop!!", "Date": "March 18, 2014"}, {"Title": "Solid Laptop", "Author": "Keith Jeter", "ReviewID": "R36H5H4QVE4BT", "Overall": "4.0", "Content": "This is the perfect thing for a kid you don't want downloading crazy stuff when you are not around. It's Great for web surfing, apps and homework.", "Date": "March 17, 2014"}, {"Title": "Perfect laptop replacement for my kids", "Author": "Amazon Customer", "ReviewID": "R3959JW9S3F7BK", "Overall": "5.0", "Content": "My kids (8 and 12) had an older notebook with Windows 7 that was running very slow. I also spent too much time removing programs that should not have been installed, dealing with virus protection, and on a couple of occasions, reinstalling Windows. I was on the hunt for a replacement.I use Windows 8 at home and work and dislike it immensely. I did not want to deal with trying to teach my kids about Windows split personality (Metro side vs. desktop side). At school, the kids use MacBook Airs but these are out of our price range. So, for a replacement, I wanted a reasonably priced solution, good performance, intuitive interface, and something that required minimal maintenance. The HP Chromebook (we bought one with 4GB RAM, 32 GB SSD) has more than met my expectations. The screen size is perfect and the Chromebook meets all of my kids needs. My daughter is thrilled with how fast it boots up. The kids use Google Drive for all their academic needs, listen to music on Pandora/Spotify, have apps for photo and video editing, and found games they like. My son plays Minecraft and this does NOT work on the Chromebook so he uses my Windows 8 machine for this.Overall, our family loves the HP Chromebook 14. As a reminder, you cannot run Windows apps. If you surf the web and do most everything in the Chrome ecosystem, this is a great solution.", "Date": "February 21, 2014"}, {"Title": "Best of all chromebooks", "Author": "Andrew B. Vincent", "ReviewID": "R2H3S9NPMETJVF", "Overall": "5.0", "Content": "I just purchased this Chromebook and i would recommend it to any of my family or friends.  The battery life is better than any high end laptop i have ever had and due to the very streamlined OS it processes things just as fast as most higher end laptops.  The build quality is also very nice equal to laptop around twice the price. If a Chrome OS does what you need than i would recommend this one over all other Chromebooks and most other laptops.", "Date": "October 15, 2013"}, {"Title": "I'm happy with it.", "Author": "William \"Bhagwant Singh\"", "ReviewID": "R1YUCL8JE0K0OY", "Overall": "4.0", "Content": "I've been using this as my only computer for about a week.  I went from using an older Macbook and desktop computer to this because I am going to be taking a job traveling and wanted something simple, quick and light for web browsing, watching netflix, and word processing.  It does all of those things well, I can plug in my external hard drive and watch movies and listen to music for when I don't have internet connectivity.  I'm not a big fan of laptop mousepad so I purchased a usb wireless mouse and it works great.  My only beef is that chromebook cannot play local .wmv files apparently because that kind of file is proprietary to windows.  So in order to watch a .wmv movie you have to upload it to the cloud where it will be converted to a supported format.Pros:  Starts up super quick, no waiting, no load times.Slick and pretty, reminds me of a macbook in its appearance.Feels very light.Nice camera for video calls.Cons:  Can't play local .wmv files.Can't play local android/windows games.That's really about it.  For the most part I knew what this machine could and could not do before I bought it and for the purposes of web browsing and watching movies/netflix/amazon prime, it is a slick, quick reasonably priced notebook.", "Date": "March 8, 2014"}, {"Title": "HP Chromebook 14: Speed, simplicity and value!", "Author": "Bill Yates \"Bill\"", "ReviewID": "R3V61FBIVUVHKI", "Overall": "5.0", "Content": "This is my third Chrome OS computer.  I have two Chromeboxes so I am very familiar with what you get with a Chrome OS device.This Chromebook worked perfectly right out of the box. I was up and running in less than 5 minutes. I was able to plug in a USB mouse without difficulty. With a good internet connection you can be running a dozen tabs with quick speed and no freezes.This version has a webcam. The speakers sound good given the overall low price.The screen is bright and crisp.I really only have two minor complaints. First the keyboard had four stickers affixed that required time to remove. One sticker left a sticky residue that took an alcohol wipe to remove.The other minor complaint is the 4 lb weight.  The device feels solid but I would have liked to see the weight a little lighter.", "Date": "November 17, 2013"}, {"Title": "Perfect for my wife", "Author": "Jay Ryser", "ReviewID": "R2HCUA7HXCBLDL", "Overall": "5.0", "Content": "I bought this for my wife; the desktop she was using at home died, and she didn't like using my spare tablet as a replacement,  99% of what she does on the computer is on the internet - Facebook, Gmail, shopping, more shopping - could be done on a Chromebook, so I pulled the trigger and got her one.I have to say, she found the Touchpad a bit frustrating at first.  It took a little instruction and practice to become proficient with it, but now she's up to speed and loves it.  It's NOT a laptop; be sure you know the limitations of a Chromebook vs. a laptop before you buy one to make sure it's for you.  It fits her needs perfectly!I liked it so much, I bought one for myself the next day.", "Date": "November 17, 2013"}, {"Title": "excellent", "Author": "Richard E. Kast \"rekast\"", "ReviewID": "R1CJXHTZJR5XJY", "Overall": "5.0", "Content": "works great. thin. robust. 9 hours battery life. switching to Chrome system does require some learning but this is done quickly. Google has fabulous telephone support system. phone support staff are easy to understand and quickly fix any problem i've had with transition.", "Date": "May 15, 2014"}, {"Title": "Awesome computer for 90% of people.", "Author": "perm anant", "ReviewID": "RYZB5TVEWOKV1", "Overall": "4.0", "Content": "Chromebooks do NOT limit you to the Google empire, if they did, I would not own one. Chrome browser on a pc does NOT have the same benefits of a chromebook. I've had my HP 14 chromebook for 4 months, coming from similar HP. This is the easy and simple way daily computing should be.  Streamlined and functional, always just works, effortlessly. And it is fast. Yes, there are still things you cannot do with a chromebook, like Skype and itunes, which sucks, but I suspect that very soon companies that don't want to play with Chrome OS based machines will change their tune and let themselves be compatible with Google. Offline usability is limited, but how often are you computing offline? Things like no caps lock button all have options to personalize the machine to your liking, you just have to go in and make the choices in settings. The \"search\" button can be turned into a caps lock if you really feel you need a caps lock button. There is no bloat or complications because the operating system is what you need and no more. Viruses mean nothing because no software gets put on the machine from the outside, so no viruses can get in.  If you HAVE to put software on a laptop for work or some other reason, then chromebooks are not for you, but if what you're looking for is a general use, internet and document laptop that is reliable and easy to use with no problems, this is your computer!", "Date": "April 1, 2014"}, {"Title": "Simple, elegant, fast", "Author": "Brian", "ReviewID": "R2ECB6H3MHM0A5", "Overall": "5.0", "Content": "For the record, I usually dislike HP, as well as anything that looks like a Mac. I wanted another Chromebook, and this was the only current gen model with a 14\" screen. It is important to remember that you have to be willing to buy into the cloud and/or Google apps to get the most out of this. Your music will be streaming, so you'll probably want to make friends with Pandora, Google Play Music, or Spotify. Google docs will take the place of MS Word or Open/Libre Office. Considering that most of us use our computers as internet machines, this is perfect. It fits a niche similar to that of a tablet, but with a bigger screen and a keyboard (and for me, being productive necessitates a keyboard). I love it.", "Date": "March 7, 2014"}, {"Title": "Simple and Elegant", "Author": "Martin Kunsman", "ReviewID": "R19MZCEMLTDV9F", "Overall": "5.0", "Content": "Simple to use, and fast. Google is leading another revolution. Nice to be free from windows and spyware. I do all of my work in the cloud.", "Date": "February 16, 2014"}, {"Title": "Solid build. Great for internet but not much else!", "Author": "Tim Mahaney", "ReviewID": "R2H3D41BSKPCFA", "Overall": "4.0", "Content": "I bought this device mainly because the retail price was very low compared to competitors and the device looked attractive and had a nice feel when playing with a demo model. Plus, I already used some key Google services (Chrome, Gmail and Calendar) so I thought it might be worth a shot to see how they operated on Chrome OS since in my experience software generally runs best on it’s native OS if created by the same developer (i.e. iTunes on Mac OS X and Microsoft Office on Windows). I've had this Chromebook for a week now and have had the opportunity to test it as thoroughly as I can based on the things I use laptops for. Below are the observations I made while using it and I separated everything into categories for quicker viewing depending on your needs. Before I get started I want to emphasize that you should use the Get Started app that Google provides and/or do searches online if you get stumped. If you don’t, then you will get frustrated and just want to get rid of it. A few times I said this OS sucked but after researching it I was able to figure out how to accomplish my task at hand by reading directions, imagine that!Media Files: On day one I tested it by watching numerous mp4 files I had stored on an SD card. I popped the card in (which does not stick out from the side of the machine) and the file browser popped up. I double clicked the m4v file and the media player that is built into the OS started playing the file. I also tried some music files I had stored on a USB drive and it worked the same way with the file browser opening up and the built in player launching upon double clicking the file. I have my music collection encoding using iTunes so they are AAC m4a files, which confirms Google’s claims that these file types are supported. iTunes users should feel comfortable migrating to this environment. See this page for other supported media types: [...]Microsoft Office: It appears that Google is trying to cover all their bases with \"basic\" tasks by including Google Docs, Spreadsheets and Slides as Microsoft Office alternatives and with a little time learning the interfaces you should be able to do all the basic functions in these apps. There is also an offline option to work on your files without an internet connection which worked fine but I quickly found out that documents can be edited but spreadsheets are “view only” when offline. This is something that Google needs to work on ASAP because if I didn’t have a mobile hotspot this alone would be reason enough for me to return/sell it. So, if you don’t always have an internet connection and use spreadsheets a lot then this device and OS is not for you. I also installed SkyDrive which allowed me to edit Microsoft files in their web-apps, which look like the paid software versions but within a web browser. They too have limited functionality like the Google apps but you would be able to find things quicker if you are used to those user interfaces but you do lose the offline editing capabilities that Google provides you through their alternatives (though they aren’t perfect as I already mentioned). Google Keep is also offered and it is like Notes in Mac OS X or Notepad in Windows so you do have something for quick note taking and this works perfectly offline. I don’t use slide presentations so I can’t comment on that program.Apps: I feel a lot of these are unnecessary because most of the ones I've installed simply direct you straight to the homepage of that website just as if you clicked one of your bookmarks in your Bookmarks Bar. One advantage I see to this though as I used it more is that you can pin more of these apps to your Launcher Bar at the bottom of the screen than you could install on the Bookmarks Bar in your Chrome browser window. The apps also allow you to open them in a separate window which is nice if you don't want it to open in another browser tab and/or cluttering up the Chrome browser. Also, hardly any of them are redesigned in any way like you are used to seeing apps on smart phones. The ones that were built differently I felt just didn't work as well as the full site so I just ended up typing the internet address in the Chrome browser and removed the app. One thing that I liked that are present in Google apps on other OS’s that I saw was missing here was the speech input. On iPad I like speaking things I want to search for and that wasn’t an option in the Google Chrome or Google Search apps on this machine. I do see a microphone above the screen so I know it’s capable of hearing my voice, so hopefully this is something they add soon.Hardware: The build quality of this machine is one of the best I've seen at this price point! I find it visually appealing with the selection of colors they used (my model was silver/white) and the keyboard tray reminds me of a Mac wireless keyboard. This color combination also makes it impossible to see fingerprints. The soft touch material being used for the outer body of this laptop feels nice to the hands. It can take a beating too apparently because I already bumped it against something pretty hard by accident and it didn’t show a mark at all! Nice job HP! This device is also very thin and is competing with ultrabooks in terms of size, in fact it looks almost identical to the sleekbook/ultrabook offerings from HP. The device also has a nice selection of ports providing USB 2.0, USB 3.0, full size HDMI, SD card reader, headphone/microphone combo jack, Kensington lock slot and an indicator light for sleep/use.Screen: I did notice while watching videos that I had to adjust the screen angle a couple of times to get the perfect viewing angle (mostly for dark blacks). Clearly this is not an IPS display, but for $300 I guess you can't expect to get a 1080p IPS display. It feels very solid and doesn’t flex very much when I tried to bend the screen from side-to-side. The screen is also very thin and after applying pressure to the back of the panel to see if it would show through I glad to say nothing showed unless you were applying A LOT of pressure, which I’m sure most users won’t. I was a little disappointed to see that the backlit chrome bar present on the lid of HP 11 and Pixel was missing here. I think adding this would make a nice additional design element.Keyboard: It doesn't have much key travel but if you can train yourself to type softer then you should be able to adjust and make it a good typing experience (with devices becoming thinner this is just something we will have to make adjustments for). Also, the keyboard tray is solid and does not flex or trampoline at all. Some back-lit keys would be a nice addition in future models since ambient lighting isn't the greatest in most rooms I’ve used this in but the grey lettering on white keys helps to combat that a little bit. I love most of the shortcuts at the top of the keyboard such as the full screen, volume adjustments and display brightness keys but the back/forward aren't necessary with trackpad gestures and anyone used to using alt+tab to switch through apps won’t use the app switching key. I feel one, if not all, of these could be removed and shift the row left so we can have a dedicated DELETE key (holding alt+backspace isn’t quite as intuitive for people coming from Windows). See this site for keyboard shortcuts: [...]Trackpad: I was shocked at how the trackpad had a silky smooth texture to it which reminded me of a Macbook because my finger rarely skips across the surface. I love the addition of trackpad gestures and use tap-to-click, back/forward and scrolling all the time. The clickpad is only clickable on the bottom half of the trackpad and gets easier to push down the closer to the bottom of the trackpad you get. A full clickpad might be a nice change in future models.Hinge: The hinge to open the lid isn't as stiff as you find on 90% of laptops today which require two hands to pry open, however you still can't open it with one hand. Hopefully with more use the hinge will loosen a little more since one unit I tested in a store before I made the purchase seemed to be a little looser than the one on my unit. I personally love laptops that you don't have to pry open with two hands and this is about halfway there. I think if they put the hinge from the HP Chromebook 11 on this then they would have nailed it. I also decided to grab the laptop by the lid and shook it around to test how strong the hinge was and it didn’t give very much at all so I’m confident that it’s a solid build and won’t break anytime soon if ever.Accessories: I like that the power adapter is smaller than we are used to seeing with traditional laptops but at the same time I feel power bricks have become outdated and need to be more like tablet chargers having folding prongs built in to a cube shaped adapter versus having a cord going in and coming out of a power brick.Performance: So far from my testing the performance has been great. I wouldn’t think that using an Intel Celeron laptop would be something that I would brag about but I haven’t had any issues with things getting hung up or freezing. I’m not even sure why Google made the Pixel with an i5 processor because after using this I really don’t feel like it’s necessary (unless it’s for gaming which is something I don’t do on laptops). Web pages load pretty fast on my home network which is running on an ac router and I don’t experience any lag as I scroll down from loading images. Refreshing the laptop internals to have wireless ac built-in would be a nice addition in future models.Battery: Installed is a 4 cell battery and checking the HP website results in a 9.5 hour claim. After using it for a week and monitoring usage very closely here is what I found. I was able to get 4 days of use out of it before having to plug it in and combined use time was 7 hours. However, 1.75 hours of this was watching videos so battery life could have been better if just used for web browsing and document editing only. In fact, looking at my results and doing some simple math, I’m confident 9.5 hours is an accurate claim. For once HP isn’t exaggerating battery life claims! The Intel Celeron processor doesn’t appear to be built for extended video playback though because after watching 1.75 hours of files from a USB drive I lost 30%! So, doing the math this machine should be able to last close to 6 hours for viewing back-to-back movies if you are on a long car ride or flight. Not that impressive when compared to tablets but having files stored internally might produce better results. All these findings were obtained with active wi-fi and brightness set to 50% the whole time. Using the sleep feature by closing the lid or using the “shut down” feature in the bottom right of the screen or holding the power button seemed to produce the same drainage result. I found that after a combined sleep time of 75 hours I only lost 5% of battery life. I’d say that’s pretty impressive compared to Windows machines and leaves more battery for use! Charging time from 5% took exactly 2 hours to fully charge back to 100% which is great since my cell phone charges about that quick and I consider that to be the industry standard.Conclusion: Overall I am pleased with the device but $300 might still be a little high for something that only serves as an internet browsing machine since the spreadsheet editing isn’t where I’d like it to be for offline use. I will probably let this device go for sale on eBay though because I don’t need a third internet browsing device in my house. It simply doesn’t outperform my iPad because the iWorks suite has more offline functionality on-the-go and the battery life of this machine comes up a little short. For fully functional software I will continue to rely on my home PC. HP should allow add-ons or upgrades on their website for a backlit keyboard, wireless ac, IPS display and a tablet adapter (if they can develop one). As for Chrome OS, add the option of editing spreadsheets offline and I’ll give your OS another shot.", "Date": "January 9, 2014"}, {"Title": "Chomebooks are the way to go", "Author": "Bill Cook", "ReviewID": "R1PBLBNISV0XOD", "Overall": "5.0", "Content": "This is a good solid performing machine.  I have recommended these machines to the rest of my family, easy to use and you don't have to worry about all the extra junk that comes installed on every other computer.  This is the way to go.", "Date": "January 7, 2014"}, {"Title": "hp Chromebook  I LOVE IT!!!", "Author": "Geoffrey Ramsey", "ReviewID": "R1QGNYV5SOSDG5", "Overall": "5.0", "Content": "I hate the color but this chromebook but it is the best on-line experience I have had in several years.  It turns on and you are surfing the web in less than 1 minute literally, it builds web pages in a blink of an eye, and you don't have to worry about virus protection.  I would highly recommend this product to anyone including my mother who has already purchased one on my recommendation.  A GREAT PRODUCT!", "Date": "December 27, 2013"}, {"Title": "LOVE the hp chromebook 14", "Author": "Amazon Customer", "ReviewID": "R2V80AFPUDB11Q", "Overall": "5.0", "Content": "just brought my chromebook home yesterday, totally awesome!! fastest surfing on a laptop I have ever owned. I've owned a dell, toshiba, dell & a sony vaio. So far I don't miss windows one little bit. Love the fact that I don't have to purchase a virus protector or microsoft windows. Yes it has external storage but so what my sony crashed twice in 2 years with a virus protection on it, so I had to buy an external hard drive anyways. I'm not a computer geek just a surfer, shopper & do a little lesson planning on the side. Not too heavy & the battery life is superb. Bought it from Walmart, paid a little extra for 4G, totally LOVE it!", "Date": "December 9, 2013"}, {"Title": "Best laptop alternative out there!", "Author": "S. Cho", "ReviewID": "RZASWJ9KHN8KR", "Overall": "5.0", "Content": "I love how easy it is to use! The web browsing is fast and I can go on the internet easily. I use all my schoolwork on this computer now and it makes me more focused! Thank you HP!!! Couldn't have picked a better laptop alternative for school.", "Date": "November 25, 2013"}, {"Title": "Perfect for every browser based activiety you can imagine.", "Author": "Matthew M Quarneri", "ReviewID": "RV0GJZPIY91MQ", "Overall": "5.0", "Content": "For the money this is the best laptop you can buy today (Circa Q4 2013).  I am very happy with my purchase.  I did go with the 4GB + 4G wireless internet version which is only $50 bucks more and totally worth it in my book.  For browser based tasks it's perfect. And if trend is any indication; pretty all casual/consumer based activities can soon enough be accomplished in a browser with the right online service behind it.  Google got it right; the browser is the universal application framework.  I'm very excited about the Native Client capabilities of Chrome and interested to see how far that can go.", "Date": "November 25, 2013"}, {"Title": "everything about it is great except the color", "Author": "dodo", "ReviewID": "R2VPZGFL1OPJZ3", "Overall": "4.0", "Content": "this chromebook is awesome, its much faster and smother than anticipated, the screen is nice and so is the build materials. the only thing that i actually hated about the hp chromebook 14 was that the color in the picture is deceiving, in the pictures it looks red, but in real life i think its closer to  a salmon pink, whits not not what i was expecting at all.", "Date": "October 16, 2013"}, {"Title": "I absolutely love my HP chromebook 14", "Author": "marytheres pardinek", "ReviewID": "R1WOHFN9G6JD2M", "Overall": "5.0", "Content": "I was first attracted to the size of the screen, price and the fact that it had a word processor.  The Office Depot associate told me not to bother.  I took his suggestion and purchased a HP with Windows 8.1 OS and Microsoft Word 2014.  I am a writer and finishing my second book. I have decades worth of research to compile and incorporate so it made sense that I needed a computer compatible with my Microsoft word files. WRONG!  That machine was a true pain.  It kept crashing.  Knocked me off the internet.  Had to reload data, etc. etc.  After 8 hours of trying to get it to work for me and my needs, I gave up.  I downloaded some word files from Windows XP onto a thumb drive and headed back to Office Depot to return the HP Windows 8.1 machine.  While there I plugged my thumb drive into the display HP Chromebook 14.  It was offline and google docs still opened my XP word files.  Sold!  I couldn't be happier.  I finished 28 chapters in two weeks.  My 2nd book is under editor review.  Even I was surprised I could work so fast.  But, the truth is this Chromebook is a joy.  The keyboard is large enough for my fat fingers so my thoughts just fly onto the screen.  Granted, I miss Microsoft Word, as it is so superior for my needs.  But, I figured out a way to write and then email my google doc files to myself.  I just open those up on my Windows computer, waste many hours reformatting text, but have a finished version to send for publication.  Hopefully, in the future I'll learn how to utilize google doc for those needs.  But, if not, I still have the joy or writing on my Chromebook, searching the internet for pertinent info, and getting my business done really fast because of this laptop.  I love it!", "Date": "May 6, 2014"}, {"Title": "My Chromebook experience!", "Author": "Geo Serban \"geo10029\"", "ReviewID": "R1WNST9WQZCHYY", "Overall": "5.0", "Content": "I bought the Snow White version of the HP Chromebook 14 for my mom because she only needs to check her emails, Google search and Youtube. But before she will receive it I had to see firsthand how is to be on a Chromebook, is it enough for me? And, to my surprise, yes, this is enough for everything I do at home, which is basically leisure/entertainment. So, in the following review I'll put emphasis mostly on the things other people reviews didn't cover well.First, for people complaining about \"ONLY\" 16GB of SSD storage, you have an SD card slot that can accommodate SDHC and SDXC cards. I bought a Sony 64GB SDXC Class 10 UHS-1 R40 Memory Card which is perfectly functional and very fast. SDXC cards can go up to 256GB in storage so you can have plenty of space in case you want to have lots of movies/music/pictures/documents available offline.The screen is very good if you don't want to share the content with other people who may not have the best viewing experience if they see it from sides.You have an HDMI port so you can see the screen on a big monitor (unlike the 11\" version of this Chromebook).Trackpad use is almost the same as the one from the macbook air  (pinching for zooming in and out is missing on the Chromie trackpad).I was very interested to explore the Chromebook concept and see how many things I can do online in the Chrome browser environment (of course you do not need a chromebook for that). The reason I write this is that a Chromebook is as good as the apps which are available for your needs. So here is my conclusion:In Google drive you can create documents, excel spreadsheets and presentations which are available offline. The complexity of the programs doesn't compare with Microsoft Office but can cover 99% of your needs. And this software is developing continuously.Reading ebooks: you can find apps for reading in the ePub format (see Readium, Magic Scroll and others). If you bought a Kindle book then you can use Cloud Reader to open it. But if you have .mobi, .lit and other eBooks in your personal library you'll have to convert them to the ePub format with an online file converter (check online-convert.com, which can convert any kind of file from one format to any other format, this is very important to know when using a Chromebook at this stage).Picture editing: use Pixlr Editing, but for a more professional app you can use Gimp 2.8, the free equivalent of Photoshop, and it runs in a Chrome browser (basically it opens in a new browser window so when it's opened it looks like the installed software on Macs or PCs).You can find sites online that let you edit your videos, same for editing sound if you need that. Chromebook can not open videos in wmv format but you can convert them to .mov, .avi or other compatible formats (see above, converter).Use Google Hangouts instead of Skype (If you want to use Skype (or VLC) you can install Linux in a chroot environment (Crouton), but this defies the purpose of using a Chromebook in terms of security, you have to let go old habits...).Now, can I use a ChromeBook for my professional work? Absolutely not! But as soon as I'm home, after a while, I forget I am on a Chromebook and not on my Macbook air (I didn't reach for this one for 4 days but I like it better because is lighter, well... for a price...).Remember that Chromebook is a concept that evolves in time, it's designed to get better, faster, more comprehensive and more secure as time passes. I am very impressed with what it can do today but you can only imagine what the possibilities are in a not so far away future.PS Does Microsoft have reasons to fear Google Chromebooks and Chrome OS? You bet! See, now you have FREE Microsoft Office available for Android and iOS...", "Date": "March 30, 2014"}, {"Title": "This is a great cheap (price) notebook.", "Author": "J. England", "ReviewID": "R15VUOCGASULBP", "Overall": "5.0", "Content": "The Chromebook is NOT for someone who wants a cheap LAPTOP. --==IT DOES NOT RUN WINDOWS...IT DOES NOT RUN MICROSOFT OFFICE==--  This could be perfect for someone that might not really know a lot about computers and just wants to get on their Facebook, check email, Twitter, Youtube, etc., without having to worry about viruses/malware.It is VERY fast because it is very bare minimum.  HP did a great job with this device.  The picture and sound quality are both great, while watching Netflix and stuff from my PLEX server over WiFi.  I haven't ran into any issues (yet) connecting to different WiFi protocols.For me, I made a recovery thumbdrive for cOS (chrome://imageburner from inside cOS) and wiped it completely, and put Ubuntu 13.10 on it.  With a little configuration (terminal),  it is a great portable Linux machine.  I installed Steam on it and am able to play some of my casual games with my Xbox controller (wireless).UPDATE - I have since restore it with the thumbdrive I created earlier. I found that I was only using it for ChromeRemoteDesktop, General Surfing, GMail, PLEX, Chromecast, etc. I'm sure as more things come out I will try them out and wipe it again. You will never have to open it up to get to dev mode (a big plus). This Chromebook is fun to play around with and see what you can make it do.  I've read about people upgrading the mSATA 16GB SSD to 128GB.  Keep in mind.. this WOULD void your warranty.", "Date": "March 15, 2014"}, {"Title": "Chromebook is really Goldbook!", "Author": "Dr. J", "ReviewID": "R3UDUXHV5DCVWP", "Overall": "5.0", "Content": "I bought the 14\" Chromebook for my tech-challenged wife, but I liked it so much that I use it more than the other two computers Iown.  The best thing about the Chromebook is that it is superquick, responsive and intelligently designed.", "Date": "March 10, 2014"}, {"Title": "Love the Chromebook", "Author": "Dixie", "ReviewID": "R1XWCKKQ6M62B1", "Overall": "5.0", "Content": "Bought this for the hubby for Christmas, it is his second Chromebook, he loves them, and it was a great experience buying it from Amazon, the convenience of not having to fight anyone at the stores - it was shipped very securely, worked perfectly straight out of the box, I'm very happy with my purchase.", "Date": "February 28, 2014"}, {"Title": "love it", "Author": "A. S.", "ReviewID": "R1LORXPC14SCXE", "Overall": "5.0", "Content": "The HP Chromebook 14 does just about everything I need it to do and in a cute package to boot. We all know that looks aren't everything, but this little Chromebook isn't just a pretty face: It is also incredibly useful. While I was initially frustrated at certain limitations (aahhhh! I'm used to writing in Word!), I found fast, easy workarounds (and yeah, Google Docs works just fine and actually is a little better in some ways).Pros: It comes right up. RIGHT UP! My last laptop took 30 minutes to start up, I kid you not, and that was just ridiculous. Battery life is decent at about 8 hours (but ymmv depending on what you're doing). And the OS is intuitive and easy to use.Cons: The trackpad is meh, and I wasn't terribly impressed with the app selection. It's been said that the Chromebook is a search engine in computer form (and I can't credit because I don't remember where I read that), and that's true. But the Chromebook does offer some offline functionality, and I usually work online, so it works out for me.Bottom line: I love my Chromebook, but it may not be right for everyone. Do your homework, read reviews and visit a b&m; store to check it out IRL before making your decision.", "Date": "February 16, 2014"}, {"Title": "Great for personal use", "Author": "Jennifer Booth", "ReviewID": "R14H9BI255QLZ1", "Overall": "4.0", "Content": "I have a HP Windows 7 desktop that I use daily for my home bookkeeping business. My 9 yr old son likes to use the computer for the games. We were constantly at war trying to coordinate my work and his play time. I purchased a HP Windows 8 laptop from Groupon and disliked it so much I ended up selling on Amazon.com. I was reluctant to purchase another Windows 8 (not a fan of Windows 8) but wasn't ready to drop $1200+ on a Mac when all we need was a reliable way to access the Internet if our desktop was in use (by me of course). We definitely needed a secondary computer but without the thrills and frills of a Mac and more user friendly for my two boys. This definitely fit the bill. It was super easy to setup and the speed is equal if not better than our desktop. The one major downfall for us is that you will not be able to play Minecraft which is huge in our house otherwise I would have given it 5 stars. For us it works out great and the price can't be beat. I actually purchased from Walmart.com to take advantage of the FREE 2-yr T-Mobile data plan so if we need to take this with us and there's no available Wifi we now have a backup alternative. I love the feel of the Chromebook rather than the bulky and heavy laptop of our previous HP. This is extremely light in comparison and has the feel of having a Mac but without the hefty price tag. I am extremely ecstatic with this purchase and would urge anyone else who is looking for a laptop with simplicity and ease, this is for sure what you will want. Just keep in mind that it does not support Minecraft though there are blogs with instructions of running Linux but I'm not tech savvy to take that chance. If I'm not working on the desktop, my son can take over and I use the laptop to access the Internet and write product reviews such as this :)", "Date": "February 14, 2014"}, {"Title": "Finally made the jump to Chromebook", "Author": "Mark Osborne", "ReviewID": "R33RON4JN7V3JD", "Overall": "5.0", "Content": "Lets start with the hardware, the HP 14 is very well made for the price, it has a rubber feel plastic on the lid and sides and a great keyboard, strong hinge and looks and feels more like a mid - to high end laptop not a budget machine.Speed - The haswell celeron in this makes it faster to browse the web than anything else I have ever used, including an i7 Windows 7 PC and Macbook Pro, nothing else loads pages faster. I've not noticed any slowdown with lots of tabs open probably thanks to the CPU and 4GB of RAM. It boots from cold in 7 seconds and wakes from sleep instantly.I run 2X client along side the chrome browser to allow me to RDP to my work windows laptop and again all runs very fast. Scrolling is smooth and the track pad is the best I have used aside from the glass one on my old macbook pro, it supports 2 finger gestures for scrolling and going back and 3 fingers to switch chrome tabs.You can do your offline work on google docs and if you prefer to use word you can use office online as well (no offline mode for office though) It will play music and videos off line, I have some media on an SD card and you can just click them to play the videos, no connection needed.Battery life is great, I get a full day on a charge, with screen at 75% it lasts easily 8+ hours.The worse part is the display, it could do with being brighter and the viewing angles are not great, still ok but not great, the whites can also look a bit yellow at lower brightness settings.But Screen aside this is a great machine, very fast, very simple, and once you move all your data to google drive its so easy, I downloaded music manager on my PC and it uploaded all my itunes to google music so can be accessed from any PC, Mac, phone.If it could be improved I would prefer a slightly smaller screen, maybe the new toshiba 13.3, but when I bought this no one had a toshiba to review or had them in stock to look and touch, you had to buy online.Printing is easy you simply download google cloud print on your Windows machine and it adds your local printer as a cloud printer you can then send any docs to it even it the PC is off, it will just print them next time its online.I will need a Windows PC for some apps, such as Photoshop and a few other programs for which there is no alternative, but I often just connect to it remotely from my Chromebook.I sold my Windows 7 laptop and Surface RT and bought this, and I'm not disappointed one bit, i'm actually very impressed.", "Date": "February 12, 2014"}, {"Title": "This is all the computer that most people need.", "Author": "butters", "ReviewID": "R1RPMAQ14AMJRB", "Overall": "5.0", "Content": "We bought this for my mother in law when she moved across the country. She didn't want anything to do with computers, so my son suggested a Chromebook - genius! It's beautiful to look at and simple to use - more reliable than a Microsoft/PC setup that's always asking for attention and WAY more affordable than a Macbook.Actually, this is all most people need for a computer. People break the bank for Macbooks that have capabilities they'll never use. If you're not looking to work in Adobe Photoshop or Illustrator, etc. Get this instead of a Mac! And if you're not into gaming, coding, Linux, dual booting, etc, Get this instead of a PC!Let's see, what else... The solid state drive is great - so you can use it on the move without worrying about the hard drive. Graphics capabilities are pretty good - especially considering the price. I just wish that it could run Skype. We were a little bummed when we realized that we couldn't Skype (this is why we bought it), so we all had to sign up for Google Hangouts so we can video call with my mother in law. Hangouts does work really well, but not everyone wants to have a Google account. But I also understand that the Chromebook isn't a regular computer (entirely different on the inside - it's got a brain more similar to an ATM than a PC - no lie!) But I also know that Google is smart and I guarantee you that they will create a Skype App soon.All in all, we're really happy with it. And my mother in law LOVES it! She was able to use it right away - wasn't intimidated at all and she hasn't had a single problem with it yet. Great!", "Date": "February 2, 2014"}, {"Title": "Exactly What I Needed", "Author": "Randall S. Morin", "ReviewID": "R29526BV2V8LI", "Overall": "5.0", "Content": "When I decided to buy my first laptop I struggled trying to decide between a traditional Windows based laptop or a Chromebook.  I ruled out an Apple product based on cost alone.  While visiting my son one weekend, he's pretty much a computer geek, I asked him his opinion.  He answered by asking me what I spent most of my time doing.  When I answered I realized that everything I do is online; email; web surfing; shopping, etc.  So, I bought the HP Chromebook 14 and couldn't be more pleased.  It does everything I need a laptop to do.  The only complaint I have is the lack of a lighted keyboard.  Overall I would give it 4.9 stars.", "Date": "January 18, 2014"}, {"Title": "Very nice look, gets the job done!", "Author": "Brea Lane", "ReviewID": "R7JNQ30A5BSYJ", "Overall": "4.0", "Content": "I got this chromebook in Snow White , and it's very sleek looking. I love the feel of it, not too heavy not too light. This laptop is such a steal for the price I paid, I love it! My fan doesn't make a lot of noise at all & the battery life is wonderful. The only con is that this laptop doesn't come with a CD drive, but everything else is perfect. Would definitely recommend this to a friend, good for college students too (;", "Date": "January 8, 2014"}, {"Title": "Quick Review of HP Chromebook 14", "Author": "Amazon Customer \"callingyouout\"", "ReviewID": "R2SNCFO8IPDTMW", "Overall": "5.0", "Content": "This is a great machine!  The Chromebook concept is elegant.  This is easy, inexpensive compute for anyone.  Way better than a tablet and way cheaper and better than an ipad or a macbook!  We bought this for our 16 year old who had been chanting “Apple, Apple, Apple” for 2 years.Bottom line, she loves it.My wife sat and studied it for two days over the holiday and couldn’t believe how powerful it is.  She liked it so much we bought a second one for her parents, they should receive it today.  We included a wireless mouse, and a USB drive so they could pull all of the files from their old mac and PC laptops.And today we bought a third one, this time with the 4G connectivity for my wife.  She wanted orange.  In total we now have three of these spread across two households for less than the cost of my older daughters macbook.  I give this device my strongest recommendation.  Here’s a couple videos.[...][...]", "Date": "January 3, 2014"}, {"Title": "Bought from Wal-Mart", "Author": "OPT", "ReviewID": "R1WQ3BSB4C72BE", "Overall": "5.0", "Content": "Found this at Wal-mart for 350$4GB DDR32 years 200mb free data2 years 100gb free google storageI love the feel of this chromebook, it runs very fast without the smugness that comes with buying an apple product.", "Date": "December 30, 2013"}, {"Title": "Very happy with this Chromebook", "Author": "Christopher Mellon", "ReviewID": "R1YDTAG2RMKSPO", "Overall": "5.0", "Content": "My netbook was on its last legs, so I was in the market for an inexpensive laptop.  I was definitely nervous about buying a Chromebook-- I was worried about not being able to install programs like iTunes, Photoshop, or Microsoft Office.After a lot of research, I settled on the HP Chromebook 14. Big caveat here that I went to a brick-and-mortar store to buy the version with 4 GB memory.  The version I bought also came with 24 months of free T-mobile internet (only 200 mb per month free).I have not been disappointed.  This thing is very fast and plays HD video great. The battery life is also superb... I don't even worry about plugging it in most of the time 'cause I think the battery easily lasts for six hours, maybe longer, doing basic web surfing.  I have had no problems with Netflix, Pandora, or watching ESPN, etc.  The free T-mobile internet wasn't much (200 mb per month) but was a nice inclusion, as it didn't require a credit card or contract or any personal info to activate, and I can now surf the web at the airport, coffee shop, etc. if the wi-fi isn't free.  You'll burn through it in no time if you try to watch video, but it's nice for checking your email or light web surfing on the go.  Also, you can purchase additional data from T-Mobile once you use up the monthly allotment.I wouldn't buy this if you absolutely need iTunes or Microsoft Office... I've been doing all right with Google Music and Google Docs.  You get a ton of free Google Drive storage space to stash all your documents.  It's also got a card slot if you really feel the need to carry a ton of files around with you.  I bought a 64 GB card but I haven't really been using it for anything, to be honest.My only complaint so far: When this Chromebook is plugged into several of the power outlets at my girlfriend's apartment, the touchpad stops working.  It'll work fine again once it's unplugged.  This has only happened so far at this one apartment.  If you search online, you'll see that some other people have been having similar issues.That being said, I love this Chromebook.", "Date": "December 29, 2013"}, {"Title": "LOVE,LOVE, LOVE IT!!!", "Author": "Tracia Ballard", "ReviewID": "R30DSMY1C91RG7", "Overall": "5.0", "Content": "This little computer if everything I expected and more!! I do not care about windows, so I do not mind that is it ran by chrome. There are plenty of free apps to add to your desk top, to take care of any needs. If you are like me and just like to google, shop, facebook, check email and surf the web, this is the laptop for you! It also has thousands of apps for games, for writing, spreadsheets and more. The possibilities are endless. It is reasonably priced, beautiful (I have the turquoise), super fast and very portable and the battery life is AWESOME!!! I bought a carrying case, wireless mouse and lap desk to go along with it and I am in internet heaven! Great purchase! You will not be disappointed!", "Date": "December 15, 2013"}, {"Title": "This is an excellent Chromebook, but for $50 more, you can get the 4G version (2 years of free T-Mobile service) with 4 Gb RAM!", "Author": "Amazonian Consumer", "ReviewID": "R3KWS0P8WTX7G6", "Overall": "5.0", "Content": "Do not buy this model; get the one with 4 Gb RAM and 4G capability for only $50 more. Although Chrome OS runs very efficiently and fast, having 4 Gb of RAM is definitely worth the additional $50 investment, which also includes 2 years of T-Mobile 4G service.I often have more than 20 tabs open on the Chrome browser, so the additional memory contributes to the overall smooth and fluid experience in using Chrome OS. As there is no memory expansion slot, You CANNOT add more RAM to the HP Chromebook, whether you buy the 2 Gb or the 4 Gb version. The RAM is soldered onto the circuit board.The suggested retail price of this enhanced model (HP 14-q070nr 14-Inch Chromebook (T-Mobile)) is $349, although many sellers may ask you to pay more than that. If you are not in a hurry, you can choose the one sold directly by Amazon and save money.I can guarantee that once you get used to using Chrome OS, you will not go back to Windows, or even Apple OS X!", "Date": "December 11, 2013"}, {"Title": "Flawless video and audio in an inexpensive package.", "Author": "Timothy Frohlick", "ReviewID": "R12S61BS48AIWI", "Overall": "5.0", "Content": "The HP Chromebook 14 displays rock-solid video and audio with no glitches. Both Amazon Prime video and Netflix video work flawlessly. It also plays a great game of Mahjong and Shredder Chess. Browsing the web is great and the only weak point is the monitor sharpness at off-axis viewing. Don't watch at angles greater than 10 degrees off axis....but then why would you?Well done HP.TJF", "Date": "November 21, 2013"}, {"Title": "Getting closer to perfection", "Author": "Stephen Smith", "ReviewID": "R2EJPCZA91Q4CQ", "Overall": "4.0", "Content": "If you haven't completely given yourself over to the world of Google you may not be ready for a Chromebook.  Since I use Drive, Google Apps and Gmail I decided that I could probably do most of my travel and out of office computing on a Chromebook.There are four things I want in a laptop. First I want it to turn on quickly and let me get working right away.  Second I want a great screen and keyboard.  Third I want it to be light and portable.  And finally I want it to be special.For the price this laptop combined with the ingenious Chrome operating system does the first two points really well.  It boots in three seconds and has a solid six hour battery life.  I just entered my gmail account and it imported my chrome bookmarks and I was literally ready to start using it in seconds.  No need to buy MS Office or virus software, everything comes in the box. Unlike my Samsung Ultrabook which still wants to reboot every week and seems to need half an hour to update the operating system and virus every time I use it, this machine is very functional.  HP did a good job with the hardware.  It is solid and well built.  The screen is bright and the keyboard is very functional.  It also comes with a full sized HDMI port, two USB and a SD card reader and decent built in speakers.So for the other two points. It is not as compact as I would like.  It is neither as thin nor as light as my Samsung Ultrabook (but it did cost about 10x less).  And it uses an old school charger with the brick sized capacitor.  I just hate those things (and they start to negate the portability factor).Is it special or fun?  No.  At least not yet.  It is very functional but so far I don't think I will ever love it but it will give me comfort knowing that if it ever gets lost or run over I only have $350 invested and none of my data will be lost.", "Date": "February 27, 2014"}, {"Title": "Great machine for the price!", "Author": "Andrea Mallea", "ReviewID": "R1IOGOSM8BDGZD", "Overall": "5.0", "Content": "This chromebook is perfect for those who simply want a sleek looking high performance machine for being on the internet. The more I use this computer the more features I find to love about it. Comes with 2 years of cloud storage(100 gb) for free, 2 month trial of googles music service, and a bunch of other really cool freebies. Battery life is very good for me, all in all great purchase!Coral is leaning towards a pink color and that was also a pleasant surprise for me.", "Date": "November 26, 2013"}, {"Title": "Chromebook 14 is the Chrome OS and Google eco-system", "Author": "Thomas M. Kwasny \"USCG Lifer\"", "ReviewID": "R3TXLR44A1CL8Y", "Overall": "4.0", "Content": "This machine is exactly what I wanted for a travel machine. Buyer beware the firmware of this machine, as mentioned in other reviews, is the Chrome Operating System using the Chrome browser. You cannot install executables or apps from outside the Google eco-system just like iPads and iTunes are married with the Apple app store. You cannot later install Windows, or any other OS, or executables outside of the Google eco-system.I cannot get the DishNetwork's DISHANYWHERE.COM sling activeX plugin (extension its called in Chrome) so that's a minor setback. The plugin only exists for the Windows or Mac operating systems, not the Chrome OS. Slingbox has a Facebook app that is supposed to work in the Chrome OS that I haven't finished futzing with to say whether it works or not. The way I made it work is use Chrome remote desktop on a PC in the Chrome browser that's already been set up to work with DISHANYWHERE (Before you try a remote desktop to it). Make sure your audio is set to simple stereo using the control panel or there will be no audio sent to the Chromebook remote desktop. Surround = zero sound.) Establish the remote desktop on the Chromebook to the PC running Chrome and remote desktop. Choppy, but better than no access to the DVR (live or recorded) content.If your machine auto-updates (as they all are firmware set to do) and will suddenly not let you logon ever, CTRL+ALT+SHIFT+R, induces a \"wipeout\" back to firmware Chrome OS as installed at HP. The automatic updating after that worked for me. You will lose EVERYTHING that you put in the machine with this.Audio on the HDMI port can only be heard if your load (HDTV) has audio output. A 720p or 1080p HDMI monitor with NO AUDIO decoding capability means you have no audio at any time. Period.The Chromebook is fast, clean, simple, beautiful display, and configurable within the Google ecosystem (thats a lot for a travel machine).", "Date": "November 4, 2013"}, {"Title": "Problems with the touchpad....bought 2 and am returning 2....disappointed!", "Author": "Jeff St.Cyr", "ReviewID": "R57ZLN56U29OY", "Overall": "1.0", "Content": "Teenage daughter needed her own laptop and really liked the look of the Chromebook.  Got the first one delivered, plugged it in, and attempted to get it set up.  The only problem is that the touchpad wouldn't work.  The little arrow cursor on the screen was unresponsive for the most part, and when it did move, it jumped all over the screen, making it impossible for you to get it where you wanted it to go.  So, I called the HP customer service number, only to get disconnected twice before finally getting someone.  After spending 1 hour on the phone, there was nothing they could do to help.  It would have taken a few weeks for me to get a replacement through HP, so I decided to check with Amazon to see if they could help me with an exchange faster.Amazon was wonderful to work with in the customer service department.  The return process was quick and painless, and they even had another Chromebook overnighted to us, and waived the shipping fee!We were excited to get the 2nd Chromebook, but when we plugged it in, it had the exact same problem as the first!  The touchpad wouldn't work!!!!  The little arrow just darted all over the screen, and sometimes it wouldn't move at all.  What a pain!  So, back to Amazon it is going.  Disappointed that we have had these issues as we were relying on this being a great laptop for our daughter.  Guess we will continue to shop around.", "Date": "January 24, 2014"}, {"Title": "Overall great.", "Author": "Me \"Me\"", "ReviewID": "R2ICAIEJ3R7UER", "Overall": "5.0", "Content": "14\" is an excellent size. Opens fast. Battery life maybe 8 hours. Seems well constructed. It's my first laptop (only had a PC before). What I love most is the ease of access - no waiting for my PC to boot up.  I now use my chromebook 4-6 times a day, just grab it, open the cover and I'm on the web in about 12-15 seconds. Really easy and convenient and comfortable to use. The key board is easy and comfortable to use. It sits in my lap.  Only complaint - no instruction on how to copy and paste using the touch pad. Almost nothing in blogs online, most people say go buy a regular mouse to use. That would be hard on my lap. Finally found one message that explained how - just press with your thumb on the lower end of the touch pad, and with the pad depressed, use the index finger of the same hand to glide the arrow over what you want to copy. Then the CTRL-C keys make the copy, and the CTRL-V keys do the pasting. I'd not used a touch pad before, but it only took awhile to learn.  For anyone who only uses a computer for the few things I do, this is so much better than a PC, sitting in an upright chair for an hour of longer. Highly recommended. Now I can do my frequent research on the web easily. Someone should have thought of this long before now.", "Date": "May 14, 2014"}, {"Title": "Very Happy With Purchase", "Author": "Annette Spitsbergen", "ReviewID": "RPVET7LU3VBO0", "Overall": "5.0", "Content": "I'm using this for business and I'm able to access my computer's desktop with no issues and can work from anywhere.  Very satisfied.", "Date": "May 12, 2014"}, {"Title": "Great Chromebook", "Author": "G. Penn", "ReviewID": "R2WXWCAQM44T4Y", "Overall": "5.0", "Content": "Love this chromebook.  Battery life is as stated.  Charges quickly.  Easy to use.  Keyboard works great.  Love the touchpad also.  It's lightweight and great for doing things online.  I also have my kids use it and it's easy for a 4 and 7 year old to use.About the color.  It's very attractive!  I've had lots of complements on it.  It really stands out.Downsides:  viewing angle is not great.  Straight on it is great, but if you angle the screen in any direction you lose the picture quickly.  It is not great from the sides either.  The volume is decent, but does not go incredibly loud.  Fine as long there are not a lot of other noises around.You also need to understand that you are buying a chromebook, not a traditional laptop.  There is no cd/dvd slot, you can't install programs like photoshop.  This is in essence an internet machine.  You use it to do things online (or in offline mode).  You can install apps and widgets very easily.", "Date": "May 11, 2014"}, {"Title": "Great Laptop!", "Author": "Alyssa Rains", "ReviewID": "R3LIUWH36C4T0T", "Overall": "5.0", "Content": "Was looking for this specific laptop for a while but was waiting for a better price. I bought this laptop refurbished for $284. No tax. I have had it for about 3 weeks now and it is going strong. No issues with it! So glad I made this purchase!!", "Date": "May 5, 2014"}, {"Title": "HP Chromebook", "Author": "Al", "ReviewID": "R1IO7X7H7I9IIL", "Overall": "5.0", "Content": "If you are in the market for a Chromebook, I highly recommend this product.  It is light and compact, but it has a large screen and picture.  The Chromebook is easy to customize and is a great value for the price.", "Date": "May 5, 2014"}, {"Title": "My husband loves this", "Author": "Paula Walla", "ReviewID": "R8MO42D9WO0X9", "Overall": "5.0", "Content": "The Chromebook is great because we can use it around the house,and security updates aren't necessary. Getting used to google appsis a new thing, but we are willing to take on the curve. The clock forthe computer doesn't work, and we aren't sure how to fix that to EST.", "Date": "May 4, 2014"}, {"Title": "Best chromebook yet!! perfect laptop replacement", "Author": "Chris Eberhart", "ReviewID": "R289TAOMJSHNOD", "Overall": "5.0", "Content": "Finally a chrimebook with no lag loading Facebook images no matter how fast you scroll with a nice size screen and no Microsoft windows overhead! Quality construction and light weight! Plenty of USB ports and HDMI and card reader. Just perfect for web and Google! The price is right and this is the perfect laptop for my wife. Finally a chrome book we love that does everything she needs very well at a great price ! Highly recommend!", "Date": "April 30, 2014"}, {"Title": "Excellent but not perfect", "Author": "Adrian Day", "ReviewID": "R1DTPUTIDSVK46", "Overall": "5.0", "Content": "In short, looks and feels expensive and nice.  When it comes to doing stuff, especially the internet, it's strange having a computer that actually works!  (and, it's 2014 -- my other computers  swallowed up in viruses within weeks and become stupid).  The main problem so far is that getting stuff onto \"Google Drive\" or anywhere on the 100gb storage, borders on a trip back to the 1990s.  Nostalgic, yes, but c'mon.  I have figured that it's going to take me weeks upon weeks to upload probably about 40gb of pictures, all with a very difficult user interface.  Today, it took 9 hours to \"upload\" 200 pictures onto Google Pictures (using my external hard drive plugged into the chromebook).  It finally said \"Your pictures have loaded,\" yet they're nowhere to be found.  I've tried multiple pathways, too (e.g. loading them from my desktop straight to the cloud, loading them onto drive versus pictures, etc...).  A google search revealed that, indeed, this is a common and inexcusable problem.  I'm keeping the chromebook, but I'm going to have to have something uploading to the cloud every night while I sleep for, I imagine, about three weeks, just to get my crap onto the cloud.  Boo to that.Addendum: I was hoping I'd be able to write a positive addendum.  Finally, I was able to find the right combo to quickly upload pictures to the cloud.  Basically, I brought the Chromebook and my external hard drive to my office and, for some reason, it's loading super fast and I'm flying through hundreds of old photos.  Also, I showed my college student the chromebook today and she was very impressed.  She said she actually does all her papers on Google Docs and she can e-mail them to anyone as MS Word documents.  Both her college and my other daughter's college use Google Mail and Google services now, so I do feel for once I'm on the good side of things.  So, I'll go ahead and change it from 4 to 5 stars, although really it 4.5 because the interface is still confusing.", "Date": "April 30, 2014"}, {"Title": "Love this Chromebook", "Author": "Mac FL \"Bob Mac\"", "ReviewID": "R22I0GR12V5CTH", "Overall": "5.0", "Content": "Just want to say that is HP Chromebook is fantastic!  I am new to the Chromebook 14 but NOT new to the PC world.  I worked for The Big Blue for 26 years and I was sure nothing would replace the laptop PC world. If you want to web surf, type documents, and just have fun on the web.  FYI  and yes you can PRINT anytime you want to your local printer and its very easy to set that up, This HP Chromebook is the best you can buy.  And I own 3 computers Apple Macbook Pro, a Lenovo and now the Chromebook.", "Date": "April 30, 2014"}, {"Title": "Great for school work and websurfing", "Author": "Jason E. Comeau \"Jason C.\"", "ReviewID": "R2SXZ4FD3SGPGS", "Overall": "5.0", "Content": "I bought this computer for my fiancee for her school work and it has worked out amazingly well.The beauty and downfall of a Chromebook is that it must always be connected to the internet. While this keeps the Chromebook ALWAYS backed up with the user's Google Drive it can also limit portability to areas with WiFi, any prospective buyer needs to keep this in mind.Quick Hardware overview:The keyboard and trackpad are both fairly well built and are easy to use for typing long papers or doing research projects. Unfortunately, I cannot say the same thing about the screen, which, while bright, suffers from horribly poor viewing angles that makes it impossible to share the notebook with a friend or colleague and is only suitable for the direct user. The lid is covered in a pleasing soft touch finish while the bottom is textured plastic, both side make the computer easy to hold. The hold and general transporting are made even easier by the notebook's general light weight. You will not find an optical drive here (Chrome OS does not support CD/DVD/Blu-Ray drives) but there are plenty of full sized USB ports and even a full-sized HDMI out.A Chromebook is designed for two things and two things only: light work such as word processing, making a quick spread sheet, or making a short presentation, and surfing the web. If you live within Google's world and use their products on a daily basis then a Chromebook is a good investment if you need a light and portable solution to a desktop but more power than a smart phone.", "Date": "April 28, 2014"}, {"Title": "New 14\" H-P chromebook", "Author": "Gerald Leventhal", "ReviewID": "RLWML1FPCA74K", "Overall": "5.0", "Content": "I rate my new chromebook a five. It took me about five minutes to set it up, connect to the internet and send my first e-mail.It is fast  and quiet and easy to use.This computer is for the user who just wants to do the basics and it does it very well.I also want to thank Amazon for the way they handled a problem that I had with the purchase of another computer.They took care of my problem at once, and handled it to my complete satisfaction.", "Date": "April 21, 2014"}, {"Title": "So far so good", "Author": "beauvane", "ReviewID": "R20MXIJGP9960E", "Overall": "5.0", "Content": "It has limitations but it is awesome to use at home and surf the web once you get familiar with the OS.", "Date": "April 21, 2014"}, {"Title": "What's not to love?", "Author": "Shelly P. \"petro0\"", "ReviewID": "R35THQNSRI0HKN", "Overall": "5.0", "Content": "I love everything about my Chromebook.  I returned a tablet to get this instead! It starts up as quick or quicker than a tablet.  It has a large screen with great resolution. The battery life is amazing.  Printing was very easy with my ePrint printer.  The colors are fun too.  I would highly recommend this product.  You can't beat the price on Amazon and their customer service is fantastic.", "Date": "April 20, 2014"}, {"Title": "HP Chromebook 14 - Excellent Buy", "Author": "Aegis Ideas & Research", "ReviewID": "R1LMQY7CZ34GZF", "Overall": "5.0", "Content": "REVIEW: Just purchased the HP Chromebook 14 direct from HP (Not from Amazon). I paid $349.99 for the T-Mobile 200 Mb of FREE Data for life. Chromebook setup was super fast and easy. I find it's better sometimes to spend the extra money to buy it new and direct to ensure no hassles or problems.PROS:Start-up time: Roughly 5 secondsShut-down time: Near Instant (1-2 seconds)Feels solidly builtSmooth Transitioning between Chrome Tabs, Chrome Apps, etc. - Chrome runs smoother and quicker than on a Windows machine.Web Browsing seems spiffy and slick.The 14\" inch is just big enough for my HUGE HANDS and still feels comfortable.VERY quiet and does not get hot at all, even when my pants block the ventilation holes.Chromebook has a setup guide that shows you all the tricks and tips as far as shortcuts and utilizing the touch-pad.There is NO RIGHT CLICK BUT you can use TWO fingers on the touch-pad to perform a right click where ever you need to, very convenient and I find it works quicker than right clicking.UPDATES are incredible. Compared to normal Windows updates, the Chromebook will restart to complete updates in nearly 5-6 seconds. So nice not having to wait to \"CONFIGURE WINDOWS UPDATES\" which can take centuries to finish and I've had crash before. This Chromebook is sweet and simple.Before you give Chromebooks a \"bad\" review. Please do your research before hand and understand what you're buying. I did my research as far as replacement apps, determining my usage and examining all the features of a Chromebook. I'm a bigger guy so I purchased the 14\" over the smaller Chromebooks, otherwise it would be too small to type on.CONS: None so far. It's not windows and I knew that before buying it. If there had to be a CON - it would be that it looks like a MAC lolOverall: Very pleased with my purchase. I will definitely look into additional Chromebooks and the Chromebox as well. Thanks Google.", "Date": "April 15, 2014"}, {"Title": "Saved My Life", "Author": "krgregg", "ReviewID": "R1UM9S385UZNLY", "Overall": "5.0", "Content": "As a college student - one that works two jobs - this little thing saved my life. Not only does Chrome OS run so much faster than my three year old laptop that cost twice as much money, it's a very efficient, lightweight, and simple computer. With my crazy schedule, I no longer have to freak out if I forgot that I printed and left my assignment at home or at the office. It auto-saves everything for me so I never lose work, auto-syncs with my account so the same document matches in all the places where it's saved, and I can access it from any computer.If I have anything negative to say, it's that there are still programs out there that are not compatible with the Chrome OS operating system. That means you cant use anything that runs off of Microsoft or some Apple Software. As time goes by, I hope that this will be a decreasing problem.", "Date": "April 11, 2014"}, {"Title": "Perfect!", "Author": "mompie \"mompie\"", "ReviewID": "R2368LJSG1QMRL", "Overall": "5.0", "Content": "I adore my sleek, fast, stable, pretty, affordable Chromebook!  It breezes right through my day-to-day tasks on the web, use of documents, photo editing, socializing, etc.As with any system, you'll want to tweak it to your liking.  I'm only moderately tech-savvy, but it's still been easy with (frequently free) apps and extensions from the chrome store.  So far, I've had no problem finding everything I need.  I've found games, productivity and social apps and extensions of all stripes.  Integration with Chrome on my android phone, tablet and Chromecast has been seamless!  I love being able to move from one device to another without missing a beat.  Want to double check that Google search you did earlier?  Grab your phone with the Chrome browser installed and you can pull that exact search tab right up.  Casting content to the Chromecast is a great bonus, too.  I also love the cloud integration.  I can automatically upload pictures from my phone, documents from the Chromebook, etc. right to my Google drive.  Again, it's all seamless.After using my Chromebook daily for a few weeks, I've only run into one instance where I missed Java - one of the common critiques of Chromebooks.  I tried to print a coupon that I didn't notice was java-based and, of course, couldn't.  Fortunately, fewer and fewer things require Java, so it's really not a big problem.  And since Java is such a security risk, I'm *really* not sorry.The only thing I'm taking a while to adjust to are the keyboard shortcuts you can/must use with Chrome.  Some are just convenient alternatives, but some are the only means to access a feature, like caps lock unless you customize the keyboard settings.  I highly recommend doing that.  Eventually the ol' brain will catch on to the new aspects, but until then, the help app is just a click away.This is the first time I've worked with Chrome as an OS and it's been easy and pleasant.  This is not the only computer in the house, so on the odd chance I need access to something on a disc or really need to use Java, I do have an alternative. Still, I can't recommend this Chromebook enough!", "Date": "April 7, 2014"}, {"Title": "Best Christmas gift this year", "Author": "imawrac", "ReviewID": "R2951MRQ6TX1ZG", "Overall": "5.0", "Content": "Daughter loves the Chromebook.  I find it to be a little odd to figure out since I'm a Windows user but she took to it immediately.  I'm learning.  I think the idea behind it is great though!", "Date": "April 3, 2014"}, {"Title": "Chromebook", "Author": "Shannan E. Fraser \"Thistle\"", "ReviewID": "R95KT2D40CDLN", "Overall": "5.0", "Content": "This item showed up earlier than promised and it makes like easier in that there are no more arguments over who will be using what computer!  Love the peace!!!", "Date": "April 1, 2014"}, {"Title": "stability", "Author": "Robert Ireland", "ReviewID": "R2ACR5IKEEPKCN", "Overall": "5.0", "Content": "I like the system far better than windows.  There is a stability about it I haven't found in other computers.", "Date": "March 31, 2014"}, {"Title": "Happy with purchase", "Author": "Emily Hughes", "ReviewID": "RJ0XQA4EQEDSH", "Overall": "5.0", "Content": "Make sure you do your research first to make sure a Chromebook is for you. As a glorified netbook, the HP Chromebook 14 is one of the best Chromebooks - or netbooks in general - you can get at the price point. This particular model is a bit heftier than other netbooks on the market, so if you're buying for the best portability, you may want to reconsider. Full-sized screen and keyboard makes it a great work/surf device but it is less mobile that other models.", "Date": "March 28, 2014"}, {"Title": "well this was a gift to my son", "Author": "Betty Long", "ReviewID": "R1U5FDV02ROR5N", "Overall": "5.0", "Content": "this was a gift to my son but he loves it stays on it all nite . he just wanted it to be in another color but he like it very much thanks", "Date": "March 10, 2014"}, {"Title": "My Thoughts", "Author": "Flash", "ReviewID": "RBE3D5VON9RNN", "Overall": "4.0", "Content": "I got it for my daughter. To make a long story short. A happy daughter a happy father.Its slick and smooth white .", "Date": "March 3, 2014"}, {"Title": "Excellent Product", "Author": "Emanuel Olivencia", "ReviewID": "R2EHLA8QG5YBJ0", "Overall": "5.0", "Content": "I love this little giant. is not a laptop but its versatility bring a new way to do things in the internet. Great for daily internet surfing.", "Date": "February 25, 2014"}, {"Title": "Excellent", "Author": "JonnyTP", "ReviewID": "R3FZRKAAVVX195", "Overall": "5.0", "Content": "I did extensive research on Chromebooks before I bought my Snow White. I was very surprised that a lot of the negatives touted by naysayers were largely overblown. My Chromebook is well built and designed and I could not be more pleased. I am at last, free of the Windows plutocracy!", "Date": "February 13, 2014"}, {"Title": "HP Chromebook 14", "Author": "Stano", "ReviewID": "R18BS9C9CGYFLT", "Overall": "5.0", "Content": "The HP Chromebook 14 is a fantastic product. It is mainly a web browser, and a very good one for the price. The screen is verysharp. I have goten 8 to 10 hours on a full battery charge, recharge time is about 1 hour. Unlike a tablet, you get fully functioningweb sites, not screens you that don't fully function. There are some key board short cuts you ned to use, and it a bit heavy.It has the feel of a well made product.", "Date": "February 10, 2014"}, {"Title": "Great Computer One problem", "Author": "Ben", "ReviewID": "RZ7EHWLKI64NT", "Overall": "5.0", "Content": "This computer is great, I bought one for myself and i love it. There is one small problem, I can't download the music manager so the google music app doesn't work. However this computer is wifi based so it wouldn't work without wifi, so you can just use grooveshark, spotify, mog, or youtube. Also if you count on microsoft word or any other microsoft office or apple office products, this computer doesn't have those and can't get them. you can use google docs and google drive and they work just as well in my opinion. Also if you play games that need to be downloaded, this computer can't do those. Everything is online.", "Date": "February 10, 2014"}, {"Title": "Great Device", "Author": "S. Rife \"rifes\"", "ReviewID": "R11ZBU38VQKNMS", "Overall": "5.0", "Content": "This device replaced my office desktop PC, macbook air, and iPad. I have simplified my technology while at the same time am getting more out of technology with this device. The integration with g-mail, google drive, google docs, google calendar is great. It's fast, boots instantly, display is good, battery life is amazing, light weight, nice size screen. It is intuitive and it just works. The quality is good, a little less than you would find on a macbook Air, but at a fraction of the price. I like this better than my 11\" macbook air because of the bigger screen and I'm not nervous to throw it in a bag take it out and use it at this price.As a follow up after using the device for a couple months, the white plastic is starting to discolor in places even though I wipe it clean with a cloth daily. It seems to be caused by heat. Chrome remains as fast as the first day I used it and battery life continues to amaze.", "Date": "February 8, 2014"}, {"Title": "Internet cruising par excellence", "Author": "Amazon Buyer", "ReviewID": "R11GCOGY1SYET4", "Overall": "5.0", "Content": "I am an 87 year old who is delighted with my HP Chromebook 14.  My main computer interest is cruising the internet and reading my emails.  The screen resolution is very good - I am able to read it without difficulty after font size adjustments.  I traded this for a Windows 8 computer which was much more than I needed and essentially unusable for my computer-challenged self.  This computer is push button on/off simple with no operating system maintenance or understanding required.  Even my computer literate children and grandchildren enjoy using it.", "Date": "February 4, 2014"}, {"Title": "Great. Just know what you're getting", "Author": "Trystan", "ReviewID": "R1BOFV6F0TRVYP", "Overall": "4.0", "Content": "This is great. I love GChrome and am learning tons of web languages on this little thing. It's fast, REALLY FAST! Ya know that fancy stuff called SSD the $1500 Mac Book pros have? That's what this computer has. Even though this PC only has 16gigs on board storage... Google has you covered with a small operating system so you get the majority of that 16gigs, and Google gives you 2yr of 100gb Google Drive space. (This means you can access Documents as long as you have internet, Keep in mind the 250 free TMobile data)Cons: Stickers are hard to remove and there's one in the middle of the screen out of box... (wtf)  Low memory. (I suggest getting an SD card (Not Micro SD) 64 gigs.  After a while the paint starts to fade off around the edges and looks like the red model of this computer shows a littlePros: Free 250 megs of TMobile 4G/LTE/HSPA+/GSM  Battery  Screen  Everything elseHighly recommend.", "Date": "February 3, 2014"}, {"Title": "Just as good as expected!", "Author": "krazykat83", "ReviewID": "R3JMCUNF2VNCVC", "Overall": "5.0", "Content": "I had been wanting a Google Chromebook for awhile, and did a lot of research on the different models before I chose this model.First, I knew it was not like your typical laptop. I've already got a Windows based desktop computer, and wanted something different. I chose this model because of the price, and had read really good reviews on it. I sometimes feel like I don't make the best buying decisions when it comes to electronics, but I have not once doubted myself for buying this Chromebook!This little laptop is fast! As soon as you open it up, it automatically turns itself on and it only takes a few seconds to do so. It's also really quiet, thanks to the solid state drive that it has. The hard drive space isn't a lot, but when I purchased it I received 2 free years of 100 gb of Google Drive which is great because I can also access the same files from my Android phone, and my desktop computer, or anywhere else I might be. The battery life is surprisingly really good. I watch a lot of videos (Netflix and Hulu) on this machine, and a full battery lasts over 9 hours for me. The screen is also an HD screen, and the quality is good. Movies, and shows look great on it. The only thing I could see that could be a downside for some people would be the lack of a disc drive, however that could be remedied with an external disc drive.All in all, I really like this computer!! I don't ever have to worry about security issues (viruses, malware) because it's safe, and it updates itself so I don't have to worry about that either. I use this computer many times a day, and use it more than my Windows 7 based desktop machine.", "Date": "February 2, 2014"}, {"Title": "14 inch screen is a difference maker.....", "Author": "Lyle W. Gray", "ReviewID": "RROKPR4VFM3NN", "Overall": "4.0", "Content": "Replaced a windows laptop in Kitchen that was used mostly for web searches. The HP is a nice package and the 14 inch screen was a difference maker for us....vs. the smaller units. The \"boot\" time is amazing. The only down side is the keyboard in small caps which, for a non typist, is not the greatest.That said, the \"Chromebook\" concept is a solid one. This unit makes a nice 2nd PC.", "Date": "November 29, 2013"}, {"Title": "fantastic!", "Author": "Brett J. Gazdzinski \"brett\"", "ReviewID": "R1FY067VT36IXC", "Overall": "5.0", "Content": "My old Sony laptop was getting slow, time for an upgrade.New mid range laptops are not cheap!Something nice with an I5 was about $700.00 and running windoze 8 and filled with extra garbage software.I read reviews here and got the 14 in white.I was shocked! I expect to spend many hours getting something working and removing all the extra software, but the chromebook was working in 10 minutes, and working fast, no boot up, no background nonsense, fast, cool, long battery life (10 hours) and fast.Did I mention its fast?Instant on is back baby!My windose laptop has not been turned on for months.Best thing I have bought in a long time, very nicely made, robust, nice looking and feeling.", "Date": "May 10, 2014"}, {"Title": "Chromebook is Great", "Author": "NC - ShoeLover", "ReviewID": "R14EX6ZIVFX3YF", "Overall": "5.0", "Content": "I was told that Chromebook is not the same as your usual laptop computer. Good for surfing and super fast on the screen loads. I'm very happy with it.", "Date": "March 17, 2014"}, {"Title": "love it!", "Author": "CoryO", "ReviewID": "R24NOHXJP2OOFS", "Overall": "5.0", "Content": "I love this thing!  I us it every day, size is right, cool looking, and the price is right!  Good purchase.", "Date": "February 20, 2014"}, {"Title": "hp", "Author": "regine rousseau", "ReviewID": "R3OFGUI4CIQVR", "Overall": "5.0", "Content": "At first I was lost with this laptop.  Then I got used to it. I love it n enjoy it. I like it come eith its own security on it. Just the thing its hard to print. Still figuring it out. The laptop is great once u get used to it. I'm getting used to google drive. I love how it save automatically.  Save me time", "Date": "December 31, 2013"}, {"Title": "Excellent Value, Although GooglePlus needs a LOT of Work.", "Author": "Zzyzx Oh \"Zzyzx Oh\"", "ReviewID": "R2ZDO4UXFZHOTX", "Overall": "5.0", "Content": "I bought two of these 14\" HP Chromebooks for my 13-year old sons to do school homework on instead of the desktops that tempt them to wander off into game sites and forget their assignments.  I was worried that a homework laptop would be a much unappreciated gift.  But I was totally wrong.First, these are very attractive, although somewhat heavy, machines.  Everyone has adopted the Fruit Company sleek look and this 14\" Chromebook is no exception.  It is longer and wider and thicker than other systems, but it is a beautiful 14-inch display.  With the Haswell processor, my sons played much of the day and one used 25% of the battery and the other used 50%.  They had to break for meals, after all.Second, I think they had their systems updated and online in five minutes and said, \"Hey, Dad!  It already has Flash installed!\" and they were obviously on Adventure Quest World and not the Mathletics site that parents hope will draw the kids.  Five minutes later they knew that if they reduced screen resolution the game sped up and was very playable.Third, I had them test the sites that host their homework and all worked fine.  They were able to login and do the homework exercises without incident, get them bookmarked and back to gameplay in short order.  Only once or twice did they go back to their dedicated gaming desktops to do something on Steam or somewhere else.Finally, as they were forced to bed to sleep they rated the Chromebook as their best gift and that it made for a great Christmas.  I highly recommend these to anyone as an alternative to a \"real\" laptop.That said, I'm not sure about the Google Plus environment.  We created accounts for each boy and for me, connected our Family Circle, but I find all the clutter of Hangouts and related Apps you need of iPad or other systems to be totally confusing and unintegrated.  I have yet to get a shot at much time on the Chromebooks, but if things work better there that gives me hope, but for cross-device families I think the experience is a challenge.Oh, my final purchase decision was the under-$300 pricing of this at the time.  Although it was out of stock, I felt I was early enough to get the orders fulfilled by Christmas and they were.  IN spite of my appreciation for this system, it's solid 5GHz Wi-Fi support and its excellent Chrome browsing experience, I think $300 is my current limit for a device with Chromebook limitations.  Yes, I agree with the advantages (light OS maintenance, decent system security, etc) but I still feel this need to have local apps for when the network isn't there.I'll try to update this review over the next three months as we get more experience with these but after one day they are a major hit.One note, the Coral Red color looks like the faded paint on a 1970's import car that was parked in the sun for 40 years.  It also shows where oily hands have touched the case.  The White is much cleaner looking, but both boys like their colors and won't give them up.", "Date": "December 25, 2013"}, {"Title": "HP Chromebook 14 (Ocean Turquoise", "Author": "Benjamin Rolle", "ReviewID": "R2DAT8C2QLE3CX", "Overall": "3.0", "Content": "I Love the Design and color of laptop !The laptop Is okay for browsing the web Can't really do much with it , Everything have to be downloaded from the app store . Almost like a tablet or phone .Recently I tried to power on the laptop but it was not responding . I started to think maybe the battery is very low, I charged the laptop for about two hours and attempt to start it up again only to get nothing . The laptop would not power on for about 2 days . I did some searching on Google and found that am not the only one experiencing this problem. This happened to me about three times now and its now becoming frustrating because It always blank out when I have Important work to do . I had the laptop for about five months now and Its now starting to give problems . I think It have 1year warranty am not sure if I should contact Amazon or HP. I will probably contact the two.  Its looking like the Laptop won't last long, such a shame because its such a nice design and I like it .", "Date": "June 13, 2014"}, {"Title": "Totally awesome!!! HP 14 Chromebook.", "Author": "Sohan", "ReviewID": "R1GIRB7JSOOU95", "Overall": "5.0", "Content": "I honestly bought the thing because it looked cool, and the price was right (I paid $299 at best buy, for the 2Gb hard drive version). I had almost no idea about the Chrome operating system. What a pleasant surprise, this thing is awesome. Windows 8 has got to be the most god awful system ever created, while Chrome is the simplest, most straight forward system ever! No clutter, no crap, just a few simple icons on the lower left hand corner of the desktop. Starts up from a cold start in about 5 seconds! Wakes from sleep in 1 second! If you just surf the net and write (like I do) this is an amazing computer! I've had mine for about 3 weeks now, and love it everyday.", "Date": "June 13, 2014"}, {"Title": "great product!", "Author": "Sonyre Mariany Suarez", "ReviewID": "R2MFANTJGBL8P7", "Overall": "4.0", "Content": "Excellent product, Excellent Store. 100% recommended. I had expectative about this product 'cause is google opearting system and I had doubt about its funtionability.", "Date": "June 13, 2014"}, {"Title": "Good value", "Author": "AMD", "ReviewID": "R3FULTB67B2P9B", "Overall": "4.0", "Content": "I really liked my purchase but didn't fully appreciate how it really worked until I spent time with it. Would have appreciated more guidance or a manual at the beginning. I have since been able to getsome decent guidance and tips so feel more comfortable now that I have invested the research time.", "Date": "June 12, 2014"}, {"Title": "I love my chromebook!", "Author": "natasha friegang", "ReviewID": "R2ZVJ4BGGSQ2J0", "Overall": "5.0", "Content": "First of all the color is fabulous! It took me a little bit of time to figure out some of the different features but now that I have it's awesome!", "Date": "June 12, 2014"}, {"Title": "It's a brave new world baby!", "Author": "NOYFB \"Power Tool\"", "ReviewID": "R3183CSIXR3H99", "Overall": "5.0", "Content": "I can't really add anything new to the review sections about the subject but I can tell you that you can't go wrong here. I got my HP Chromebook @ Costco for the free wifi for life deal but that deal won't last (or might get better). I added a 32gb flash card and 2 X 32gb flush fit USB flash drives. Google drive space is $1.99 per month for 100gb add Dropbox or any one of a hundred cloud storage services so storage space is nothing to be concerned about. The HP is faster than any operating system period. The second you open the lid your on. Connecting to wifi is simple and the signal is strong. If this isn't enough you can have Linux running on your book in less than 5 minutes. These devices have so much untapped potential it's ridiculous. I've also noticed that the prices are going lower instead of higher and they are constantly improving. I have this exact same HP Chromebook and I wouldn't trade it for anything, including a MacBook (which I already own) the battery life is at least 8 hours on the HP depending on what you're doing. You could easily watch 2 full length movies and have enough juice left over for some web browsing or email. It's great for traveling. We were watching Netflix on the hotel tv... but that's just a small picture of the potential. Every school in the country should provide a chromebook to students and faculty. It's a brave new world baby!", "Date": "June 11, 2014"}, {"Title": "2'nd Chromebook and Counting!", "Author": "Ryan Gonzales", "ReviewID": "R32OX9EQRG1P11", "Overall": "5.0", "Content": "I ordered this Chromebook as an upgrade from my Acer C7. I wanted this one due to the processor and the larger screen. I also tried out other Chromebooks and I found that the keyboard and the touchpad on this Chromebook felt much better and more responsive than other ones that I've tried. It didn't feel cheap like some of the others did.I really like the finish on the body of the laptop. I have the \"snow white\" color, and it looks really nice. The finish also feels rugged enough to handle a few scrapes. You're not going to see fresh scratches every time you run dry hands over the lid. The build of the laptop also feels nice and sturdy. It doesn't feel like, or easily bend, like a cheap piece of plastic. The speakers are also greatly better than the last Chromebook I owned. If I have the laptop on a flat surface, like a countertop or table, the speakers really give off a good amount of sound. They're slightly less loud on a lap or bed, but they're still great!This is my second Chromebook, and I really enjoy Chrome OS. I wanted this one due to the larger screen, but my original Acer Chromebook is still running great! That one now belongs to my wife.I use my Chromebook for web surfing mostly. Facebook, Netflix, Youtube, E-mail and stuff like that. I also use it for creating and editing Google Doc files, which can be saved as Word files when you export them! I don't see a reason why you wouldn't purchase a Chromebook and save some money. These things are worth it!", "Date": "June 11, 2014"}, {"Title": "Nice laptop", "Author": "Amanda N.", "ReviewID": "R12FKHINNG2W91", "Overall": "5.0", "Content": "I bought this laptop as a quick replacement when my daughter damaged her old one. Shipped out really fast--I had the machine in maybe 2-4 days after order and has been great for internet. The white is beautiful with the exception of a single pen mark did not come clean off the cover--I tried oil and alcohol with no luck so be careful if with dirt. Size is perfect. Nothing fancy on the keyboard and I do miss the 'delete' button instead of just a backspace button but for a young adult, this works great. Slim, quick, inexpensive.", "Date": "June 8, 2014"}, {"Title": "Google chrome hp", "Author": "Tammi Kay", "ReviewID": "R2CEF1729BLWY1", "Overall": "5.0", "Content": "Love this laptop! It's sleek and the screen is amazingly clear. Doesn't over heat like some others. Definitely will buy another one!", "Date": "June 8, 2014"}, {"Title": "HP Chromebook 14 in Ocean Turquoise", "Author": "Patti puma", "ReviewID": "RY08V02UZLB2Z", "Overall": "5.0", "Content": "I love this computer and I plan to buy another one in a different color for my girls. It is fantastic.", "Date": "June 6, 2014"}, {"Title": "HP delivers value provided you have the 'source'", "Author": "gordy", "ReviewID": "R42QTW2N36F9R", "Overall": "5.0", "Content": "This is a quality product for the price-provided you have a WiFi source. The screen and keyboard are adequate; the features are plentiful. Voice activated search was a bonus feature for me, and works well enough. Response time is quick, and security is built in. I am amazed at what all this packs for the money. It handles all my modest needs nimbly and simply. For entry level, or seniors, this product delivers.  Hats off to HP for providing so much for so little!", "Date": "June 5, 2014"}, {"Title": "MY DAD's THE BEST", "Author": "TAD", "ReviewID": "R2GCZJRIXX6BP7", "Overall": "5.0", "Content": "Need I say more- My daughter loves her birthday gift.  Perfect for my pre-teen and I am actually jealous -- cause it is SUPER-FRESH-FUNKY AND FLY  ;-)  love it.  GREAT shipping and AWESOME packaging.Thanks.", "Date": "June 4, 2014"}, {"Title": "Perfect Fit", "Author": "Donald Lakin", "ReviewID": "R3QI4996VFOBIL", "Overall": "5.0", "Content": "Chromebook came when stated and is in great shape.  The chromebook works great and does the job for me at school.  Glad I went with this item from this seller.  Great experience overall!", "Date": "June 3, 2014"}, {"Title": "Great Device", "Author": "Darlene Fergerstrom", "ReviewID": "RPT2IGT3WCBAH", "Overall": "5.0", "Content": "We like the Chromebook so much, that we bought 2 of them!  We prefer this over our last laptop, which always had issues, and constant malware problems.  Amazon had the best price, as well.", "Date": "June 2, 2014"}, {"Title": "Chromebook", "Author": "Scott K. Curry", "ReviewID": "R1HHGNNRND76L6", "Overall": "5.0", "Content": "Needed the product for a service call and have decided to keep it and give to daughter for graduation. The Linux OS is much faster than the Microsoft and Mac OS's.", "Date": "June 2, 2014"}, {"Title": "Impressed", "Author": "Eliza Jermyn", "ReviewID": "R2PRK9NK2GGTTY", "Overall": "4.0", "Content": "I'm really impressed with this product. It is light, fast and the battery lasts a long time. I wish I can gotten the red or blue cover though, because marks show up very easily on the white. Besides that, it is a great laptop and I recommend it to anyone who is looking for the basics (writing papers, researching, social media, etc.)", "Date": "June 2, 2014"}, {"Title": "Good for general browsing", "Author": "Jennifer Nielsen", "ReviewID": "R3DJST8XZ8RV05", "Overall": "5.0", "Content": "I got this for my dad who only needed a computer to surf the web and check email. It's a great deal for someone who isn't super tech savvy and just needs a basic computer. The larger screen is also a highlight considering other Chromebooks have the 11 inch screen. Highly recommended!", "Date": "May 31, 2014"}, {"Title": "Everything I was hoping for", "Author": "jonathan loft", "ReviewID": "ROTWEHN7OVCR3", "Overall": "5.0", "Content": "I am truly impressed with this computer and so happy I spent a little more to get the one I wanted. DO YOUR RESEARCH PEOPLE. This isn't the computer that has been on the market for the last 10 years this is something completely new. It has done everything I wanted it to and then some. THE BEST BATTERY LIFE IVE EVER SEEN.", "Date": "May 30, 2014"}, {"Title": "Amazing Product!", "Author": "Kaitlyn Jindra", "ReviewID": "RDIZ6L391EQ7T", "Overall": "5.0", "Content": "I had been looking for a new laptop for awhile now since my other one had broke and I came across the Chromebook. I first saw this laptop at my local Best Buy and immediately fell in love with it. I then went home and did a lot of research on this laptop. A few days later I purchased it off of Amazon because it was a little cheaper. After receiving it,  I was very happy with it. It was MUCH more than what I expected it to be. It is very fast, and very easy to use. I would recommend this product to anyone.", "Date": "May 30, 2014"}, {"Title": "HP Chromebook 14\" screen review", "Author": "Jerome Crilley", "ReviewID": "R35J3PJ13DA73E", "Overall": "5.0", "Content": "For all the people that had XP computers fail recently, this is an excellant replacement, even superior to a laptop.  The massive amount of wires that are required with a normal computer are gone, there are no connections to a monitor, printer (using cloud), or external memory needed.  It's light weight and  easier to carry around than a laptop. Great piece of equipment !!!!!!!!!!!!!!!!", "Date": "May 29, 2014"}, {"Title": "Perfect", "Author": "Lisa Calderon", "ReviewID": "R2OZMDY6K3WRUS", "Overall": "5.0", "Content": "I am not a techy. This is perfect for what I needed. It's simple enough for web browsing and watching streaming movies.", "Date": "May 28, 2014"}, {"Title": "LOVE IT!", "Author": "Chelsea", "ReviewID": "R389GY8V4T7M54", "Overall": "5.0", "Content": "I've had this laptop for a few days and so far so great! Lots of really cool features and reminds me a lot of a Mac, except more user friendly. Love it!", "Date": "May 26, 2014"}, {"Title": "so happy with my chromebook", "Author": "Jen&John's", "ReviewID": "R2HNJOIJS8F3LC", "Overall": "5.0", "Content": "so easy to set up and use im glad i got the chromebook 14 and not the 11.6! if your looking for a small laptop look into the chromebook first", "Date": "May 26, 2014"}, {"Title": "Wow!", "Author": "B. QUINTANILLA \"book lover\"", "ReviewID": "R2PWVABUED1SCI", "Overall": "4.0", "Content": "I gave it 4 stars because it does get warm and it started being noisy because of  the fan, I just hope it lasts longer before getting too hot. I love how fast it is and the way it looks, so far so good!", "Date": "May 24, 2014"}, {"Title": "Excellent Computer", "Author": "dunnapothu", "ReviewID": "R1O7PZHSP2SOT5", "Overall": "5.0", "Content": "14 inch is very decent sizeMain features: - Size - Battery Life - Looks - WorksWe need a computer for regular usage which can start quick and with a good battery life.This has everything you needed.5 starts", "Date": "May 23, 2014"}, {"Title": "Lovely Graduation Gift", "Author": "Rosie Bailey", "ReviewID": "R1DTRB3TCRYWP4", "Overall": "5.0", "Content": "This was a gift for a college bound student and so far everything is as described. the book is light so easy for her to carry.Great color as well.", "Date": "May 20, 2014"}, {"Title": "Love it!", "Author": "Susanne Kotch", "ReviewID": "R11UC09TENQ2F7", "Overall": "5.0", "Content": "Love my Chromebook, never had a laptop before, very easy to use, all my friends love the color, only negative: I wish it was lighter (weight)", "Date": "May 14, 2014"}, {"Title": "Chomebook", "Author": "Diane Costa", "ReviewID": "RAQS7ZUV2CCD4", "Overall": "5.0", "Content": "I love it. My daughter and a friend  purchased the same one.  It does everything it is suppose too.I didn't need that huge computer I had.", "Date": "May 12, 2014"}, {"Title": "great device", "Author": "ron", "ReviewID": "R35HIXNCFUIF3M", "Overall": "5.0", "Content": "works for browsing internet with google chrome. have bought at least 10 of these and haven't had any issues. screen size is decent. keys are quiet. connects wirelessly or wired.", "Date": "May 12, 2014"}, {"Title": "am in love with this chromebook", "Author": "Grace Howard", "ReviewID": "R1T9YIP0VI7GFT", "Overall": "5.0", "Content": "I love this chromebook the color is perfect and very portable. I just bought it because I wanted a new laptop with this particular color.  Everything is perfect and easy to use", "Date": "May 12, 2014"}, {"Title": "Great at what it does", "Author": "Kam", "ReviewID": "R261R1431AB0SQ", "Overall": "4.0", "Content": "If you go in knowing what to expect from a Chromebook, this one is exactly what you need.  Great value", "Date": "May 9, 2014"}, {"Title": "Awesome Computer! Great Value!", "Author": "Shauna McFarlane", "ReviewID": "R17Y0Q6EEHVAR8", "Overall": "5.0", "Content": "I love my HP Chromebook! It functions so much faster than any traditional laptop I've ever owned and it's very sleek! My fiance and I have found it meets all of our needs!", "Date": "May 8, 2014"}, {"Title": "love it", "Author": "Robert Brown", "ReviewID": "RTJQLLMPAWL1D", "Overall": "5.0", "Content": "Was present to mom. She loves her new laptop. My wallet loves it's too :)If all you do is chrome - get this one and you wont regret", "Date": "May 7, 2014"}, {"Title": "Love it!", "Author": "Tabatha Noyes \"Noyes'\"", "ReviewID": "R4W3CR2UTUQ6D", "Overall": "5.0", "Content": "No hard drive so it's up and running within seconds. Love the color. Only thing I don't like is that I can't print coupons from it but I have other computers to do that with.", "Date": "May 5, 2014"}, {"Title": "Chromebook 14", "Author": "Andrea", "ReviewID": "R17AGQAZ48FS92", "Overall": "3.0", "Content": "Sound is not great and it freezes on me sometimes. Top is cheap plastic, but overall it's pretty-got it in white.", "Date": "April 18, 2014"}, {"Title": "received it promptly", "Author": "Yvonne Carambot", "ReviewID": "R3KZH511EVRZDX", "Overall": "5.0", "Content": "we enjoy it vary much ,fills our need would recommend it to anyoneeasy to use ,and great servicegreat", "Date": "April 17, 2014"}, {"Title": "Good one", "Author": "Piyush Lakhe", "ReviewID": "RLAH63AE72ESI", "Overall": "4.0", "Content": "Good and cheap. Does the job of a laptop.Windows not required. Light sleek and stylish. White one is better than others.", "Date": "April 17, 2014"}, {"Title": "One of the best computers I used ever", "Author": "Jorge Carrera", "ReviewID": "R14GTQD2HY61WK", "Overall": "5.0", "Content": "This a very good notebook. It is fast and reliable...and of course, I like very much all the google evironment. Much recommended !", "Date": "April 14, 2014"}, {"Title": "very pleased", "Author": "Linda bubby", "ReviewID": "RARTPH9S13CF6", "Overall": "4.0", "Content": "super  beautiful.  little quirky  but I'm sure I will get used to it.  very pleased with my purchase.  can't get all of my apps  that are on my android.  would recommend.", "Date": "April 14, 2014"}, {"Title": "everything it qas supposed to be", "Author": "just g", "ReviewID": "RXTTSRTQ1VGBO", "Overall": "5.0", "Content": "Very useful,easy to use and navigate and I would definitely recommend it for young children.. it is also very lightweight and the price was worth it.", "Date": "April 13, 2014"}, {"Title": "Great Little Computer", "Author": "Tasha R. Dalcher", "ReviewID": "R3DNT0X1L8JM5S", "Overall": "5.0", "Content": "I purchased this for light computing: email and web browsing mostly. I've been a long-time gmail and Chrome user, and this seemed like a good fit.Positives: Quick set-up: logged in with my google account, and everything was ready to go. Easy to customize: I was able to easily find how to customize the touch pad scrolling direction and change the wallpaper. Perfect for light computing!Drawbacks: Color: the color wasn't quite what I hoped; it's a little more greenish than displayed on my other monitor but it's still a nice color. If I'd seen it in person, I probably would have gotten the white instead. And I miss some of the keyboard shortcuts I use frequently; the Ctrl key is in a slightly different spot, which makes it a little awkward. Neither of these are significant problems, though, just little nuances that remind me I'm on a different computer sometimes.", "Date": "April 12, 2014"}, {"Title": "Nice Item", "Author": "mollybee", "ReviewID": "R1CWUHLVJFWH6R", "Overall": "5.0", "Content": "I've had the hp chrome for a couple of weeks now, have really enjoyed the device. works well with my hp wireless printer through E-Print.still does a lot of the same things my laptop does , really like the fact that when you open it starts right up. no waiting. only thing i will find different is you have to be on wi-fi  to use much of the devices capabilities , but over all extremely happy with the device.", "Date": "April 12, 2014"}, {"Title": "Got this on Amazon $20less than retail", "Author": "clowngirl", "ReviewID": "R2RJY4Y17ZTJJ8", "Overall": "4.0", "Content": "As expected. Easy to use. Light weight. Great large screen, keyboard navigation good. Somewhat sturdy.  Some features and method of use are different from what ive noticed, than a pc. For example:copy and paste. Instead of right. Click after highlighting a paragraph, i found in chrome help, that i use alt+e for a window to open with cut, copy ,paste options. Ok strange. But it worked fine. Lots of things to try and learn. Part of the  fun for me. It connected to the Wi-Fi instantly like a tablet. I had to log into my Google account in order to set things up. Pretty unique. I paid $279 and Office D____t wanted 299 plus tax. Saved $50. Thanks amazon", "Date": "April 11, 2014"}, {"Title": "Great for everyday use!", "Author": "C S Merola", "ReviewID": "R32J3794SJ85P", "Overall": "5.0", "Content": "This chromebook is great for the 50+ with limited computer knowledge. Easy to navigate, fast, and light weight. Reasonably priced.", "Date": "April 10, 2014"}, {"Title": "Very good one for an internet user combined with optimal usage of Google products / tools", "Author": "PRABIL K BALASUBRAMANIAN", "ReviewID": "R2JEXKS73ZAVNG", "Overall": "5.0", "Content": "Instant start up and shut down.Decent battery life.Looks great, good quality and light weight.No hanging / crashing.", "Date": "January 26, 2014"}, {"Title": "Perfect for a secure financial portal", "Author": "David M. Cox \"dmcox\"", "ReviewID": "RZTFJOAOUSYV0", "Overall": "5.0", "Content": "This was actually purchased for a friend who want a very secure way to check on his portfolio with a large broker.  Single purpose he could care less about that is on the internet, email or youtube.  He want it to be secure.  I could of bought a generic laptop, loaded a striped down version of linux with just a browser, but then I would of had to maintain it.  The HP Chromebook with a couple of security setting was perfect!", "Date": "January 25, 2014"}, {"Title": "Cheap, inexpensive laptop that's near perfect for web browsing.", "Author": "SeanM", "ReviewID": "R1NVVIHV41GXHE", "Overall": "4.0", "Content": "Bought this on black friday because my wife's sony laptop broke.Pros: Light weight, adequate key feel, good battery life, quiet, chrome is chrome, and wife loves the color.Cons: The screen has a slight bluish tint and the resolution is lacking.Viewing photos from USB can be slow. (wedding pictures ~1500's HQ photos).  Thumbnails may not load at all.No caps lock without using hot keys.Sound is blah so use some headphones.For quick and dirty web browsing this works really well. You can't beat the price.", "Date": "January 20, 2014"}, {"Title": "wonderful!", "Author": "Ebelin Amaya", "ReviewID": "R37MQXQ1YS1OLF", "Overall": "4.0", "Content": "likes: It's fast, and has all the things I need as a student! I already lived in the chrome before making the switch, so the transition was easy. As soon as you open it up, you can get to work. There's no need to wait for it to load anything!dislikes: The wifi gets disconnected a couple of times a day. I'm using the chromebook in the same room as my modem and router and I'm mere inches away from them, but the connection gets lost. This does not happen on my sisters windows laptop, even though she is further away from the router and modem and in a different room...and she has a cheap laptop!However, this is easily fixed. All you have to do is go to network setting, disconnect your wifi, then reconnect it, then it begins to work again. This fix occurs in less than a minute, and the problem does not occur constantly enough for me to rate the chromebook lower.  I guess nothings ever really \"perfect.\"", "Date": "January 15, 2014"}, {"Title": "Perfect for the online basics", "Author": "JVincent", "ReviewID": "R1E1TNJ82P7F5F", "Overall": "5.0", "Content": "I purchased this for my 60+ year old mother as a Christmas gift. Now I want one for the family. For internet browsing, e-mail, streaming and Facebook there is no better choice. Excellent quality and feel - very Apple like - and great performance for what it needs to do. The pics don't do this unit justice.", "Date": "January 13, 2014"}, {"Title": "My daughter loves it!", "Author": "Marvin Franklin", "ReviewID": "R36TPM11OFX0L0", "Overall": "4.0", "Content": "Works well, dose what she needs and more. She is into photography and it works well for photo editing. Sweet.", "Date": "January 13, 2014"}, {"Title": "chrome is great on HP", "Author": "Phillip H. Nadeau \"Fat Max\"", "ReviewID": "R2IKBABKG4CN3W", "Overall": "5.0", "Content": "This unit is great. it boots very quickly, has a nice big screen, it has worked flawlessly since christmas, more that I can say for Dell 660 running windows 8.1 what a pain that Dell is or should I say Windows 8.1.  I have been running google apps on the cload on the other computer, This HP Chrome takes me there  and all my records are there and ready to work on IM LOVING IT  sorry McDees. This  HP Chrome 14 is the best computer I've ever bought in the past 30 years.", "Date": "January 11, 2014"}, {"Title": "Awesome!", "Author": "mii*", "ReviewID": "RDCOZR2QR87SD", "Overall": "5.0", "Content": "I bought my Chromebook 3 days ago and I'm completely satisfied. I'll recomend it to anybody. It looks nice and works fast!", "Date": "January 10, 2014"}, {"Title": "YES!", "Author": "Kristin", "ReviewID": "R1279PBZ0J5XJ9", "Overall": "5.0", "Content": "I absolutely LOVE my Chromebook! It has a fast boot up and log off. I love the Google docs! Only negative... no caps lock button. But other than that, I'd recommend it to anyone! So worth the money!", "Date": "January 10, 2014"}, {"Title": "Great Product", "Author": "S. Gentile \"Sandmantye\"", "ReviewID": "R21ZICMXMFCLH8", "Overall": "5.0", "Content": "I bought this for my son as a Christmas gift and he absolutely loves it.  It looks more red in color than peach so this is good.  He started using it out of the box no problems and he's only 10.  Great price and wonderful item.", "Date": "January 9, 2014"}, {"Title": "Much Better Than He Expected", "Author": "Sandy Eggo", "ReviewID": "R3310FFXQAS8SP", "Overall": "5.0", "Content": "This was a gift for my non-nerd son and he loves it. All he really does is surf and email so it's perfect in every way. If you need heavy weight processing this is not for you but for light cloud based tasks, it should suffice.", "Date": "January 7, 2014"}, {"Title": "A huge step up from the Samsung Chromebook", "Author": "RDG \"Robert\"", "ReviewID": "RUR40S3QGORK3", "Overall": "5.0", "Content": "I have the 11-inch Samsung Chromebook 3, which I love -- and have come to adapt to working almost entirely within ChromeOS and Google apps.  But I had been frustrated from time to time by the underpowered Samsung: often not enough power to play videos cleanly, and certainly not to Chromecast them; and even Google Docs were too much of a stretch for the old Chromebook -- typing was often frustratingly laggy.This new Chromebook is a huge improvement.  The larger screen is very nice -- I really don't share the criticisms I've seen in other reviews about its lack of clarity.  Videos play cleanly (and are crisp in HD); Google docs and other apps are extremely responsive.  The transition from the Samsung to the HP is like the transition from a netbook to a Macbook.  If you've liked the Samsung Chromebook, you certainly won't regret upgrading to this.", "Date": "January 2, 2014"}, {"Title": "!!!", "Author": "Rylie Van Valey", "ReviewID": "RH64XV4GE598U", "Overall": "5.0", "Content": "I'm very impressed with this computer.  It's thin and very sleek looking.  With internet connection it is extremely fast and I have not experienced certain glitches when watching videos that other reviewers have mentioned.  I watch netflix frequently on it and only notice a slight blur every now and then with the picture.I do notice the glossy screen that gives a glare that I read about.  With lights off obviously it is not a problem but depending on the color of the screen I can see myself in the background.Other than that It is great.  I'm a student and not computer savvy so its amazing to just turn a computer on and not have to worry about anything else.  Google docs works just fine so I won't have a problem not using word.Love it!", "Date": "January 2, 2014"}, {"Title": "Fast, good battery life, gentle learning curve", "Author": "Nate Hartmann", "ReviewID": "RRX8JD30S2MNX", "Overall": "5.0", "Content": "Easy enough for a 12 year old to pick up and just use, but with enough easy flexibility for a non-techie to hook up an HDMI cable and watch internet videos on the big TV.The time from powering on to beginning a web search is so short that I often reach for my wife's Chromebook rather than my own laptop.The alternate keyboard layout takes some getting used to, but then you'll see why it's so. The caps lock button has been replaced by \"search\", for example (and how often do most internet users actually need to use caps lock?)", "Date": "January 2, 2014"}, {"Title": "awesome product!!!!", "Author": "bill", "ReviewID": "R1SYBGYE6X7PQX", "Overall": "5.0", "Content": "Hp chromebook rocks!!! It's fast and has great apps. I would recommend to anyone who wants a computer that doesn't't need any updates. The white color is nice too.", "Date": "January 2, 2014"}, {"Title": "Excellent buy!", "Author": "Josh", "ReviewID": "R3VDZX6S93GL8P", "Overall": "5.0", "Content": "Just received my Chromebook yesterday and love it! Switching from an 11 inch Dell Inspirion, the screen is definitely an improvement, and the speed is considerably noticeable as compared to the Dell. While playing Youtube videos, or listening to Pandora, I can switch between 5 different tabs without any lag. I had concerns about switching from Windows, but it is a great buy for the price. The keyboard is also great. Easy and enjoyable to type on. The speakers are pretty loud, but don't have much bass. But if you are debating on getting a Chromebook and can't decide which one to get, I highly recommend the HP Chromebook 14. Money well spent.", "Date": "January 1, 2014"}, {"Title": "what I expected", "Author": "Michelle L. Gralish", "ReviewID": "R1FG3SX5P6VV1P", "Overall": "4.0", "Content": "I researched, the HP Chromebook 14 was the one that seemed the right choice for me.  It was exactly what I expected, so I'm happy.", "Date": "December 29, 2013"}, {"Title": "Great design that needs every day's need", "Author": "Wen Yuan Lin", "ReviewID": "R1FR6AYIPT18W", "Overall": "4.0", "Content": "The laptop is really geared for web browsing.It is of instant start, good spead and sound, together with lower price.The only downside is occasionally i find display is a little blurry and resolution can be higher", "Date": "December 29, 2013"}, {"Title": "Perfect for dad", "Author": "commander keen", "ReviewID": "R2XMUB7T9WC9X4", "Overall": "5.0", "Content": "I bought this to replace my dad's 5-year old Dell which he only used to update his to-do list and check his email. It's perfect for him. The screen is large enough for him to see, and the battery lasts plenty long between charges. Plus it's pretty solid so it can take a little roughness around the house with the dog.", "Date": "December 24, 2013"}, {"Title": "Love this computer!", "Author": "Mummy Gwyn", "ReviewID": "R1IDUIJR2XWKKX", "Overall": "5.0", "Content": "Very good, works great, very fast, powers up in seconds! Really easy to use, I would and have been recommending this product, it is worth it!", "Date": "December 20, 2013"}, {"Title": "Ahhh...loving it", "Author": "D. Banks", "ReviewID": "R1BOTA0JRP6EVM", "Overall": "5.0", "Content": "Like many of you I was apprehensive at first. I even carefully saved the packaging just in case. But from day one I fell in love with my Chromebook. Of course there are some mental adjustments to be made...like routinely saving to the Google Drive instead of the HDD and not installing apps. But I soon realized that most everything I did on a PC was centered around the internet (and the Google ecosystem) anyway! This baby runs so cool (I mean this literally - no more burnt thighs!) and boots up lightning fast! While this may not be perfect for some I recommend it everyone.", "Date": "April 28, 2014"}, {"Title": "Impossible to install a wireless printer on your network.", "Author": "F. Mercado \"frmercado\"", "ReviewID": "R3T8VM2PLNYCII", "Overall": "2.0", "Content": "I got this \"computer\" because I use Google apps a lot, have android phone and use Google drive as well as have web hosting with Google. The one thing it does well is browsing. The battery life is great. As for the rest, I would only use this computer for airplane use (as long as there is wifi in the plane...), other than that even the cheapest computer out there is more practical.Bought a wireless Samsung printer and it turns out that it is impossible to install if you don't have a regular computer. This is a newer printer, not even a year old, yet there is no way to install it because the Chromebook can't communicate with the printer. Wouldn't recommend buying this computer if you want to be connecting to various types of printers at different locations, it would be a nightmare.", "Date": "April 11, 2014"}, {"Title": "Wonderful \"laptop\" with great user appeal!  Cloud-space working is the best!", "Author": "ReelBigFishKicks", "ReviewID": "R3HS03ZD1SR57S", "Overall": "5.0", "Content": "Excellent option vs buying a over priced, under powered Windows laptop.  Spend $300 and get this instead of $700 for something outdated.  Google Chrome OS is smooth clean and makes working off the cloud easy.  Great bootup time, awesome display, and great asthetics make this a choice anyone should make, unless you really edit movies and photos.  This is the future of computing.", "Date": "March 29, 2014"}, {"Title": "Not up to the standards it looked", "Author": "Billie Maas", "ReviewID": "R1ZZ2E0WXFPQ0P", "Overall": "4.0", "Content": "I bought this computer for my mom and set it all up because she has no idea how to do anything on a computer. Overall it is a really nice device but there are two things worth mentioning. One is that you can not set the majority of customizable things that you can with most other computers (for example you can set the track pad in only two modes but can not change individual settings to do what you want like right click with one finger, etc) and the other is that the computer does not support Skype. I have never heard of a computer that does not support Skype, and this seems plain silly to me. Overall a nice device but it will tkae her more getting used to than I'd previously hoped.", "Date": "March 28, 2014"}, {"Title": "We like the Chromebook, BUT...", "Author": "paula jensne", "ReviewID": "R24FA8QF5M6DKE", "Overall": "3.0", "Content": "We like the Chromebook, but have had to send it back to HP twice and have only had it for a month.  The first time the battery needed to be replaced because it would not charge.  When the computer came back the speakers did not work on volume settings over 40%.  HP has been extremely helpful and sent a box to FedEx the machine both times, but I hope that is the end of the problems before the warranty runs out in 252 days.", "Date": "February 27, 2014"}, {"Title": "Chromebook has replaced my Macbook", "Author": "Marina Christina", "ReviewID": "R11T5M94NABWYD", "Overall": "5.0", "Content": "I love this Chromebook, beautiful graphics, lightweight, easy to use.  It is well worth the money.  Highly recommend. It's a bargain.", "Date": "February 19, 2014"}, {"Title": "HP Chromebok 14", "Author": "tiburcio", "ReviewID": "R3RE7X4TCZUDGC", "Overall": "5.0", "Content": "i bought this for my 13 year old daughter as a first computer for her… it is a really good deal for what it does and i don't have to worry about not having anti-virus on it, my son was given one of these from his high school so i figured it must be pretty good. so far no complaints", "Date": "January 21, 2014"}, {"Title": "THE NEW COMPUTER REVOLUTION!!!!", "Author": "KIM SOLI", "ReviewID": "R2X1PCC2SH581N", "Overall": "5.0", "Content": "After my 2 YEAR OLD COMPUTER broke down and became OBSOLETE, and discovered that the LEADING COMPETITIVE CORPORATIONS, ( With their high prices, unexpected breakdowns, and hidden costs, ) WERE VERY CORRUPTIVE in many ways.  I've purchased this GOOGLE CHROMBOOK, with all of the SOFTWARE APPS INCLUDED, ( You can also download more apps from the GOOGLE STORE, ) and was VERY IMPRESSED, that it's performance, was very similar in speed, ingenuity, and dependability of an EXPENSIVE MODEL. :)))  THIS IS A NEW COMPUTER REVOLUTION, WITH NOTHING ELSE TO BUY, ( Except an external DVD/CD DRIVE, ) however, for someone, who's on a FIXED INCOME, like myself, that one time payment of only $359.95 USD ( Plus shipping, ) IS WORTH IT!! :))", "Date": "January 6, 2014"}, {"Title": "Pleased with my purchase", "Author": "Hurstbourne", "ReviewID": "R1X9G9PAJVTHS2", "Overall": "4.0", "Content": "I've had the HP Chromebook 14 for two full days now and overall I am very happy with it.  Since it does not run Windows apps It is not for everyone.  But if you mostly use a browser and email and internet connected apps, then you will be fine.  The only Windows apps that I still depend on are Quicken and Turbo Tax CD --- but I am currently looking at converting to Mint and Turbo Tax Online so that I can use my Chromebook for themPositives --- it is very light and portable (especially compared to my previous Windows laptop).  It is fast!  It has a great keyboard and track pad. The 14 inch screen is really nice. Chromebook does not require all the time consuming anti-virus and application upgrades that you face in Windows. The Chrome App Store has a big library of Chrome apps and extensions. And it has Google Drive and Google Docs which I started using several months ago and love - I'll never go back to MS Office.Negatives --- Although I am impressed with quantity of the third party apps that are available, I am not very impressed with the quality. I am not finding much of use to me. Hopefully that will improve in the future.", "Date": "December 21, 2013"}, {"Title": "Great for the type of target users", "Author": "Norbert M", "ReviewID": "R1ZO13CCQXMQMK", "Overall": "5.0", "Content": "Fast and to the point. I bought this for my mom as a replacement for her Windows 8 laptop which she was super frustrated with. For her style of use, it's a perfect laptop. Plus, once she replaces it in the future (likely with another chromebook), I can always install Ubuntu!One thing that I feel HP should have done is included a white power cord/adapter (comes with a black one), since the laptop is white in my case.", "Date": "December 12, 2013"}, {"Title": "Great little laptop", "Author": "Judy B.", "ReviewID": "R2OGGZIO5IVC6P", "Overall": "5.0", "Content": "I bought this for my mother to replace her ancient (yet classic) eMac. Found it easy to setup and get started. She is adjusting to the mouseless scroll pad and overall I think she likes it. I would definitely consider one for myself if the need arose.", "Date": "February 23, 2014"}, {"Title": "I love this computer", "Author": "JackRussell", "ReviewID": "R1ZVB9W67COIMG", "Overall": "5.0", "Content": "So I needed to get a new laptop for school. I take online classes currently. This has worked excellent on the ANGEL and CANVAS hosts that my classes are on. You can save Google word docs in other formats such as word dox. This computer is fast to start up. The battery has an excellent life. I have it set up to underline misspelled words and found out that you two finger tap the top right corner of the touch pad to bring up the correct spelling. Its a easy computer to use. My young daughter (7) got on it and navigated easily. I did purchase mine from Walmart online because it came with more drive space and 2 years of T-Mobile 4g service (200mb) a month. I will NEVER go back to windows and I am not silly with my money so I wont do Apple either.", "Date": "January 14, 2014"}, {"Title": "Great laptop", "Author": "Keith", "ReviewID": "RJIZJQ7UKD5M9", "Overall": "5.0", "Content": "We bought this for our daughter.  With her school being google doc and drive driven, it was a no-brainer.  The laptop has a very nice, vibrant screen and an excellent touch keyboard.  It did not take us long to catch on to the google specific characteristics.One difficulty is printing.  Need a special printer or adapter which we are still researching.Recommended.  Would maybe suggest more internal memory, but thumb drives and google drive are key.", "Date": "January 14, 2014"}, {"Title": "Only Missing CD Drive For Total Laptop", "Author": "Catherine Johnson", "ReviewID": "R2UKMQ2GQMZ2RS", "Overall": "4.0", "Content": "Super fast,ultra bright screen,with simpler controls ...ONCE you learn the system. And imagine no more windows updating,glitches and hassles. For me,it would be a complete laptop replacement ,if it had a cd drive.So, that is the reason I gave it 4 stars instead of 5.", "Date": "January 11, 2014"}, {"Title": "Better than Hoped for", "Author": "Joe", "ReviewID": "R3DJUYPY9I9ZRM", "Overall": "5.0", "Content": "After watching several TV commercials (probably by Microsoft) denigrating the Chrome-books, I wondered whether these units were actually as good as advertised.  I have been impressed with what was available using my HP-14.", "Date": "January 9, 2014"}, {"Title": "A solid second computer, but I don't see it replacing my windows laptop", "Author": "V. nicholas \"vinnieme\"", "ReviewID": "R1KV1WXLGAV3JA", "Overall": "4.0", "Content": "i like this computer, but i dont see it replacing my windows 7 machine. design, build quality, and price are nice. it does seem a tad heavy for its design but im a real man so its not a big deal to me. i like this chromebook 14, but i dont LOVE it.for me, i dont see it replacing my main windows machine because you can't install utorrent (to, um, download publicly shared science papers on global warming n stuff). and no vlc player. i love vlc! even windows media player, which is, well, mediocre at best, i still miss it. i miss having a separate program to play media files. chrome just plays stuff in a tab. i am not a fan. and what's up with no podcast chrome apps? to me, that's just not acceptable.the 2 most jarring things are probably the lack of caps lock key and there being no \"right click\" (the trackpad has just one big \"click\" button at its bottom). there are workaround solutions you can google for that generally get the job done. but they do take some getting used to.another thing is just getting used to the chrome OS, which is made to be fairly limiting. for the last 2 decades of my life ive just gone to control panel and eventually figured out whatever i was looking for. well on a brand new OS like chrome, its taken a lot of, well, googling, to figure out how to just do basic stuff. kind of a pain. but i dont whine about change, i just deal with it.ive thought about getting a chromebook for my mom, but like i said, it is limiting. case in point: 99.9% of the web is geared towards internet explorer, because it's the most popular browser on the planet. on my windows 7 machine, my favorite browser is firefox, but sometimes a web page doesnt quite look right or work right, and so i have to use ie to view it. well, it seems im having even more of those issues with the chrome browser- web pages that just dont quite work right. now, there is an \"ie view\" chrome extension which is fine, but i cant see my mom actually using that. she would just wonder why the page isnt working correctly. and for myself, going from having ie, firefox, and chrome all on the same machine, to having just chrome, it can kind of be a pain in the rear. ive found chrome to crash more often (which isnt all that often, really) than firefox or ie ever did. i got the \"aw snap!\" crash at least once a day. ie and firefox crash maybe once a week. is it because of the only 2 gb of memory? i have no idea. but with some websites just appearing funky in chrome and then on to the crashes (for me, chrome has always had an issue with flash), i am longing for the days of having 3 different browsers to play with. oh well.like i said, its a fine second computer. im literally going to use this sitting on my couch to surf and play things on my chromecast. and the battery life is excellent! i got like 8 hours on it last night. kudos to hp and google.", "Date": "December 25, 2013"}, {"Title": "Great Chromebook.  Well built with 9 hours of battery life.", "Author": "Rob Mattheu", "ReviewID": "R29G02I5ETM57M", "Overall": "4.0", "Content": "I bought the HP Chromebook 14 on a whim because I was frustrated at Windows 8.  This nicely designed machine is great for anyone who uses a computer primarily for web based work.  It boots up in seconds, has a nicely designed keyboard, a decent touchpad, a great balance in your lap, and was able to run all internet video and applications I could throw at it.  The blue color is more of a teal (according to my wife) but kind of grew on me after awhile.  It includes a small portion of free Internet data each month via t-mobile if you need it.  The display is not an IPS display like on an iPad or the Chromebook 11, but is still quite nice.  While the 14 inch size may be too big for some, it is great for adults whose eyes may be going.  And this thing lasts 9 hours of time without a break on a single charge.My only complaints were that the colors are a bit much, the keyboard was a bit too widely spaced for my fingers, and ultimately I wanted something a bit smaller.  If you use your computer primarily for the Internet, don't mind rather limited options for handling files when offline, and aren't tied down to Windows or Apple programs, I highly recommend a Chromebook as a primary or secondary computer.", "Date": "November 17, 2013"}, {"Title": "DEFECTIVE UNIT REPLACED WITH NEW", "Author": "Just a guy \"Me\"", "ReviewID": "R1RS5TQOTYS7HK", "Overall": "3.0", "Content": "I ordered a USED model from Warehouse Deals. It looks brand new, this could have been a great buy. Problem was the internal speakers do not work - plug in headphones there is sound. Unplug headphones no sound. There is a faint popping sound from the front on the bottom. SO BACK IT GOES.This is my 2nd CHROMEBOOK, so I know how to use a Chromebook. I love the product line and intended use... It's just this one does not work as it should.What a shame. So excited for this to arrive (1 day late thanks to UPS error) and then everything about it was perfect (I AM USING IT NOW FOR THIS REVIEW) But with no internal speakers, I know something is wrong.One thing I did not notice online is the MAGNIFYING glass key on the left in place of the SHIFT LOCK key. Bit confusing, but not a deal breaker.UPDATE: I replaced the defective one with a new one. The new one works great, but has a squared edge along the top of edges the notebook - not comfortable if your hand or wrist rubs over it.", "Date": "March 6, 2014"}, {"Title": "great", "Author": "Masaru Nakamura", "ReviewID": "R2E0ISHJN4KU1Z", "Overall": "5.0", "Content": "I like chromebook than android tablet and iPad.I don't have PC at home.chomebook enough.I  think 14 is better than 11.", "Date": "March 9, 2014"}, {"Title": "Disapointed", "Author": "Rachelle Daugherty", "ReviewID": "R33U6S1XD1KSXF", "Overall": "1.0", "Content": "just opened the box and when I opened up the computer it had exclamation point and said \"chrome os is missing or damaged. Please insert a recovery sub stick or as card\" called HP after .40 they said they were going to send me a box in 2-3 days for me to send them the computer to fix.. they would have it 10 days then ship it 3 day mail back to me....", "Date": "March 26, 2014"}, {"Title": "Hp Chrome notebook", "Author": "Mary Bruce", "ReviewID": "RBJ0WJGCVIVIO", "Overall": "1.0", "Content": "This was the poorest quality of a note book that I had ever purchased.  I had purchased two as Christmas presents for my grand children  returned both.", "Date": "June 2, 2014"}, {"Title": "Not impressed", "Author": "kimbo", "ReviewID": "R2TXXET38PR64Q", "Overall": "2.0", "Content": "I have been using my Chromebook for 2 months now and I find it workable but not lovable.  Everything has to be accessed online,so if the chromebook has lost connect and have to wait till it connect to finish task I am doing. The 3g t-mobile network is not always a reliable back up when a connect is lost.  I also have trouble pulling up my documents. Say I have multiple gmail accounts for friends and professional life. Well if I am working on a document and I am logged on to my professional email and I decide to open up another saved document. Well the document I want is not there because it was saved while I was logged onto my other email account. When logged on it to a certain email google also logs you on into a profile that is associated with that email. The whole google system is a bit disjointed. Though they do make updates every week to improve the google self-sustaining program environment, its just not good enough compared to the programs like Word which is already perfected.", "Date": "April 20, 2014"}, {"Title": "Chromebook well built", "Author": "Robert Carpenter", "ReviewID": "R2QAWMZLLS66ET", "Overall": "4.0", "Content": "The Chromebook very well built it is easy to use I liked the construction of it, I liked the outside cover it did not leave fingerprints but I just did not like the operating system everything is web-based there is no easy way to store anything. web-based operating system was just not for me I had to return it.", "Date": "April 13, 2014"}, {"Title": "HP Chromebook (White)", "Author": "Tommy Proffitt", "ReviewID": "R2HGSD44JW5FLO", "Overall": "5.0", "Content": "I don't like the white keys, but I have a black wireless keyboard with a mouse that I am using and a monitor with a 22 inch screen, so it is my desktop computer. I also have a non-wireless printer connected to a netbook as my wireless adapter so I am good to go. I also have a 700 GB USB harddrive and a 15 GB USB Stick.", "Date": "March 15, 2014"}, {"Title": "A Good Second Computer", "Author": "Jazmyne Williamson", "ReviewID": "RUK44NM5DR37B", "Overall": "3.0", "Content": "I would not get this computer if it will be your main computer. The computer is internet based and you cannot do anything without it. If you are in the government this is a complete no go since you cannot access any government sites.", "Date": "January 2, 2014"}, {"Title": "Google Crome is painful", "Author": "AJF, grade 3", "ReviewID": "RRJQB0AEAZUGA", "Overall": "2.0", "Content": "I thought, how hard could it be to figure out a new OS?  Guess it depends on the OS.  Google Chrome is painful.  The color is great - LOVE it actually - but the computer will go back.", "Date": "April 28, 2014"}, {"Title": "nice computer", "Author": "Jbgator9 \"Avid reader\"", "ReviewID": "R3VEGRBVCURRKA", "Overall": "3.0", "Content": "I actually liked this small laptop very much, but it could not accommodate the table card games that I love to play. It is a great size and lightning fast with beautiful color. Unfortunately it didn't do the thing I wanted most. Other than that it is a really nice inexpensive computer. Basically web based.", "Date": "January 28, 2014"}, {"Title": "a big & limted tablet with a keyboard (use hola for VPN problems)", "Author": "bob smith \"bob smith\"", "ReviewID": "RYD9E0IYTVWW2", "Overall": "3.0", "Content": "big problems with chrome OS, i love chrome browser, i love google, i hate chrome OS, (still way better than miniflacid windows)i use VPNs and their VPN support is still lacking so i used hola vpn (hola.org) for my VPN needs.  I am not sure why linux was not dual booted on these machines, also you cannot boot from USB like most computers,  i tried chrubuntu and crouton to use more linux features and apps but it was eaiser to just give this computer to my wife to use as a limited webbrowser tablet (with a better keyboard).  no java so no netbeans, if you work on java projects like me then you could try the cloud based browsers but i really just want a linux (ubuntu, mint) clean install,  the hardware is great, good keyboard, good speakers, good screen, good battery, good ssd hd, good touch mouse, good usb (2.0 mouse worked, 3.0 external hdd worked) but i look forward to when i can dual boot linux and chrome OS, i am torn between 2 and 3 stars but 2 stars if you really need VPN or Java and 3 stars if you hate microbrain windows as much as i do.i am a little worried about the message from google, \"we use this tool in these ways and you will too because google knows best\", google used to be more of a \"use this tool in anyway you want\" but if they had to avoid linux to keep the hardware cheap then fine,  i am waiting for a 12-14 inch android notebook or android laptop,  i would have loved this item if it could dual boot chromeOS and android, i bought this knowing the limitations of chromeOS because i love google and i hate milimushy windows", "Date": "January 5, 2014"}, {"Title": "Lauri Dallas", "Author": "Lauri Towns", "ReviewID": "R2M63QNFBKPYP8", "Overall": "5.0", "Content": "Exactly what I needed! Fast, powerful, long battery life, great color and distinction, streams a movie well, has DVD drive..everything as I needed for work and play!", "Date": "December 24, 2013"}, {"Title": "Just like a rental apartment in NYC", "Author": "John(Amplify) Stewart", "ReviewID": "R1UW4GMFMSPGOR", "Overall": "3.0", "Content": "Every HP laptop always has some fatal flaw.  Just as an NYC apartment might be located directly over a popular bar, or across from a parking garage, or next to crazy neighbors, or not have heat etc. -- HP laptops are *always* undone by some seemingly arbitrary design error that makes you not like them.  (By comparison, the faults of Apple systems, annoying as they are, are usually interpretable from some marketing perspective.)The HP chromebook 14 goes one better, sporting TWO fatal flaws.  The first is the CPU fan.  It's always on, and emits a maddening high-pitched whine through the bottom speaker grills, which I guess also function as heat vents.  Users whose hearing isn't sensitive to higher registers will find themselves untroubled.  The rest will live in a constant state of irritable tension as they chrome-browse the net.  This could have been so easily fixed early on in prototyping, but no, nobody at HP thought it worth the effort.The second fault is the screen.  Yes, it's 14 inches, awesome.  But it must be the cheapest, crappiest, darkest, most reflective, least visual-angle-y display on the market.Many will say: yes, true, the screen blows and the fan screeches.  But hey, it's $300, what do you expect?  Well, I'm impressed by that argument as far as the screen goes (maybe...).  But I do not believe that HP engineers cannot solve the fan noise problem without serious impact to the cost of the kit.", "Date": "January 18, 2014"}, {"Title": "No privacy", "Author": "Maxwell", "ReviewID": "R2BNQVBTMA97MU", "Overall": "2.0", "Content": "It seemed a nice enough device.  The screen color was excellent.  The touch pad seemed to require hard taps, at times, to get it to work.  (There is no adjustment per HP.)  All work has to be done in the cloud, you cannot even save work to the machine.  (Again, per HP.)  So the device did not suit my needs.As big a problem, at least for me, is that the device--I assume all chromebooks--required establishing an account with Google (gmail, etc.).  I had to log-in to that account every time I wanted to fully utilize the device.  (There is a \"guest\" option but it limits use even more.)  I did not want to pay for the privilege of having Google track every move I make.I returned the device.", "Date": "May 30, 2014"}, {"Title": "Sleek, quick.. but does not really support video...", "Author": "Joe", "ReviewID": "R1SQ2QJ455RPBQ", "Overall": "3.0", "Content": "So the look, the feel and the speed of this chromebook are great.  I love it for the most part.  However, please note... there is no itunes capability... nor does it currently support amazon prime instant video.  It seems amazon is working with google, but google chrome does not currently support silverlight - amazon's video provider... so even though its supported and promoted by amazon, this chromebook cannot play amazon video.It does however play netflix.. but if your looking to stream up to date tv shows and movies, this laptop cannot currently support those needs...some what of a disapointment, as i travel often, and was planning on using the slick, quick machine to stay up to date on television and movies... hopefully there will be an update soon.", "Date": "December 5, 2013"}, {"Title": "OK for techies who want simple laptop", "Author": "Alida Cornelius", "ReviewID": "R16J956LMSTLHD", "Overall": "3.0", "Content": "However, if you are used to windows, this will take some getting used to and you will need a compatible printer. From now on I am buying computers directly from stores for easy returns. My dad doesn't like it. It was a gift. Was not allowed to return to seller if box was opened.", "Date": "February 19, 2014"}, {"Title": "Be careful what you wis for.", "Author": "Robert J. Harbaugh", "ReviewID": "R3TBQC0W5Y9WW8", "Overall": "3.0", "Content": "Although this is a well made product, great that it comes in different colors.  Make sure a chromebook is what you want!  You can't print directly from it, you have to go through another computer that has the printer loaded, because you can't load anything into the chromebook  including drivers.  It may be great for web surfing but not too much else", "Date": "December 23, 2013"}, {"Title": "Speakers stopped working", "Author": "Dora Aceves", "ReviewID": "R1Z3FJAPQQZWJP", "Overall": "1.0", "Content": "I bought this for xmas for my son who is going off to college and it worked for a couple of months and then the speakers stopped working. I cannot return it either. Not worth the money if it is going to start having issues after a couple of months.", "Date": "March 14, 2014"}, {"Title": "It's just not a laptop...", "Author": "Kevin Lam", "ReviewID": "R1BNQ3LDC5WP2P", "Overall": "3.0", "Content": "I have to be honest, I got this for my 6 y/o daughter for home schooling. Simply put... it's just not a laptop. You miss out on a lot of things and you have to find a lot of online activities to do. I should have done more research on it before purchasing. It's ideal just for surfing and doing some basic things online, but that's the limitation. I will have to buy her a laptop in a year or 2 at the latest. She's really bright and fast and we'll need the capabilities of a laptop to handle her needs.", "Date": "May 7, 2014"}, {"Title": "Social Media machine not for everyone", "Author": "Larry Lefkowitz", "ReviewID": "R2HAHM2O34G7NF", "Overall": "2.0", "Content": "Brilliant machine, but the Chrome OS is not for serious computing. It is a social media machine, more like an overgrown smartphone. Just not for me.", "Date": "March 30, 2014"}, {"Title": "Great functionality for internet but heavy", "Author": "Lori W Wills", "ReviewID": "R31QYE8E4D3SZ", "Overall": "3.0", "Content": "I wanted to get my son an inexpensive laptop for Christmas.  He is in the 4th grade so I didn't want to spend a lot of money.  Mainly he will use it to play online games, watch videos, email, etc.  I thought a brand new Chromebook would be the answer.  Great battery live, beautiful display and seems pretty rugged.  However, it seems like you always have to be connected to the internet to use it.  Plus it is fairly heavy for its size.  I don't see him toting this to school at all.  I bought a used Apple Macbook just like his older brother has for the same price.  I think it is a far better buy for our needs.  But I will say for the price, the Chromebook is a nice laptop.", "Date": "December 23, 2013"}, {"Title": "Chrome operating system stinks", "Author": "Michael W. Yacenda", "ReviewID": "R20SS9GA7NTC66", "Overall": "1.0", "Content": "If you have Windows 8 you will hate the Chromebook ... no right click, search stinks, cant turn off the sound effects, no control panel, no java.I am ready to trash it. It pings every time i clcik soething and you cant turn the damn thing off.I cant fix the typos in this review because you cant right click on the word.I hate it.The hardware is great ... I wish I could find the same touch and feel in windows.", "Date": "May 21, 2014"}, {"Title": "hp doesn't want to take responsibility for a defective product.", "Author": "jake", "ReviewID": "R18J1YPRS058T1", "Overall": "1.0", "Content": "it has a glitch where some keys put what other keys are and vice versa.  it now goes completely blank and stays blank for several seconds at a time.  hp wants me to buy some items and then go thru the process of resetting it.  i told them i don't know how and this was before it started going on and off.  no support from hp on taking responsibility for their defective product.", "Date": "December 6, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00FGOTC0Y"}}