{"Reviews": [{"Title": "Very Satisfied", "Author": "Johnfourtytwo", "ReviewID": "REZC6S3IYAO12", "Overall": "4.0", "Content": "This is probably an Amazon Dell because this particular model number isn't available at Dell; other stores like Best Buy, HSN, QVC have similar unique store models from other manufacturers you can only get from that particular store/website but not from the manufacturer.I just bought a similar model from Dell, 17R i7-4500U (5737) which has the same features as this one but with 16 GB RAM.It took a couple days to get upgraded from Windows 8 to 8.1 because the upgrade wouldn't show up at the store but the folks at Microsoft were fabulous by getting it installed remotely since there's a glitch with some computers' ability to see the update at the app store.This purchase was an upgrade from an older Vista platform and I didn't like Windows 8 but there were some very noticeable changes in 8.1 like the Start button was added back after 8 removed it; and the ability to go straight to Desktop instead of Start page which was a Windows 8 default.  I'm still getting used to it and so far I don't have any complaints.The look and feel is quite different from Vista and XP especially but it's not difficult to figure out.  There are plenty of tutorials at Microsoft, You Tube, and installed to help you with Windows 8 and 8.1.You don't get Windows Media Center with 8 or 8.1, you have to upgrade to 8 Pro or 8.1 Pro to get that; but it does come with Power DVD 10 media player which works really well and is upgradeable to Power DVD 13 Ultra from from cyberlink.com.I have my DVD collection backed up on 3TB external hard drives and they play without a problem whereas my older laptop lacked the RAM this one has and I could only play them if I copied a few at a time to a much smaller hard drive so this is indeed a plus.The battery life is great!  So far I'm getting about 6 hours off one charge whereas my old laptop wouldn't last more than three hours when it was new and barely 90 minutes later on.They keyboard is full-sized, comfortable, and easy to use.  I couldn't tell how they would work just by looking online but I was able to operate a similar 15R model in a store which had the same keyboard and it works just fine.  This was a concern because I actually use a keyboard and a full-sized one is a must which is why I only buy full-sized/17 inch laptops.So far I haven't had any problems with video, audio, or anything with this computer and I would strongly recommend it to anyone who's looking to get a new laptop. I also have Office 365 installed and so far that isn't a problem either.  I did some homework this time and made sure it had an Intel processor instead of the cheaper AMD processor which are cheaper than Intel but you they tend to run hotter and kill your battery faster.  Just stay away from AMD if you can afford Intel which really isn't too much more and you'll save yourself a lot of headaches from wishing you would've.Like said at the beginning, this review is for a similar model I got from Dell which isn't available here at Amazon and vice-versa; the only difference is the amount of RAM, everything else is the same.", "Date": "December 11, 2013"}, {"Title": "Intermittent computer user who REALLY likes this laptop  4.5 stars U.", "Author": "AuntiePeg", "ReviewID": "R4IEMEGKKZSRY", "Overall": "4.0", "Content": "UPDATE FOR DELL CUSTOMER SERVICE 10 STARS!!CS IS FABULOUS. Based solely on my recent CS eXperience I am buying another Dell (this one again) for my dear, 84 year old dad. While trying to banish teaser software I got into the wilderness. Dreading the ordeal, I was shocked and pleased at how well online help went. It was prompt. The agent was intuitive, perceptive, and had the ability to remotely repair the problems which included significant  multiple steps processes including regedit..you probably know what that means. Overall time for agent to answer, understand, diagnose and restore--free of charge under the 1year warranty--was about 30 minutes. Had we done the old \"now type this\" I'd still be on the phone. Tho I had purchased a lifetime tech support package I did not have to envoke it,  Dell provided all this service FREE and my computer is functioning flawlessly and minus the freeware. I love the Geek Squad and my private computer guy but they cost right out of the gate and require the use of a vehicleAbout the computer 4.5 stars!!!CONSQuite pleased with this laptop with two exceptions:The keyboard has a great touch but no backlit keys.  (Ever so slightly lowering screen aids in viewing in a very dark room)The touchpad continues to be engaged even when a mouse is being used, (haven't found any correction for this)Pros:The overall build of this machine is very nice, doesn't have that cheap tinny look and feel.Battery lasts approx. 6 hrs surfing (no gaming), and while sitting on my lap sans holder it doesnt get hot.Speakers are fine for everyday use.Screen is bright and crisp and can be seen from odd angles with ease.Computer is quiet.Jury Still Out:I'm an old dos/windows user (anyone remember excel 2.0?) but I'm a win8 novice so haven't yet loaded office or transferred data.Yes, I too to dislike win8 upon initial encounter.My nephew suggests this i7 inspirion is quite acceptable for several medium/fast games he tried (no don't have fps)Finally, haven't yet run dvd/cds  but given the resolution and speakers use so far, I expect it to be just fine!", "Date": "December 14, 2013"}, {"Title": "DELL INSPIRON 17R RATING", "Author": "Donna Stephenson", "ReviewID": "R1ZNRT0AQP3N8R", "Overall": "5.0", "Content": "I THINK ITS GREAT.  IT SURE IS FAST COMPARED TO MY LAST COMPUTER.  THE PROGRAM IS A LOT DIFFERENT BUT I'M SURE I WILL GE USED TO IT.", "Date": "January 9, 2014"}, {"Title": "Dell Inspiron 17R", "Author": "R. Benningfield", "ReviewID": "R2KA4GLKH3ZHTN", "Overall": "5.0", "Content": "This laptop was a replacement for a previous laptop that died on us, this laptop is a great deal. The price was better then I expected and the shipment arrived as advertised!", "Date": "February 28, 2014"}, {"Title": "Dead on Arrival, But Fixed in Time", "Author": "NDruid", "ReviewID": "RGVQTDGRUK8EX", "Overall": "4.0", "Content": "It arrived with a bad hard drive.  I called Dell technical services and they ran a remote diagnostic.  The diagnosis of a bad hard drive was confirmed and a new one was shipped out to me.  It took a little over a week to arrive, but the replacement has been working just fine.  I'd give it five stars were it not for the initial glitch, but the service met the five star level.  Overall, I am pleased.", "Date": "February 28, 2014"}, {"Title": "Nice Machine But.....", "Author": "R Williams", "ReviewID": "R2CJX6K8P6FX95", "Overall": "3.0", "Content": "I am having problems keeping the DVD drive connected... I pulled it and checked the connections and reinstalled it and rebooted and it came back but I have had to reboot several times to use it... there is a problem with the connection the DVD drive just disappears...Not too happy about that... Maybe it needs a new driver I'm not sure... any ideas?", "Date": "December 30, 2013"}, {"Title": "Very nice laptop", "Author": "Rony", "ReviewID": "R2ECHXI1MS9PK2", "Overall": "5.0", "Content": "so far, very good performance, about 3 weeks of using. Nice screen size, very thin. Excellent. I love the keyboard with the numbers at the right", "Date": "March 29, 2014"}, {"Title": "An excellent Laptop", "Author": "Ali Bencomo", "ReviewID": "R20J473RLA4DII", "Overall": "5.0", "Content": "A very powerful machine and look so nice. Excellent cost/benefit ratio BUT, and everything has one \"but\", the SO is MS Windows 8. Because the aluminium finish the laptop is a little more heavy than others but anyway this reduces faster the heat, so is an advantage. I love this Laptop.", "Date": "March 24, 2014"}, {"Title": "Dell Inspiron 17R i7RM-8389sLV Laptop", "Author": "gary j boeser", "ReviewID": "R1VRPPP35HK74V", "Overall": "5.0", "Content": "This is a wonderfully constructed and performing laptop.  It has exceeded all my expectations and is the first Dell I have owned-it will not be the last.  The only thing I that I would change is the OS.  This is not a touch screen device and I would have liked to have had the option to purchase it with windows 7.  I'll get over it.  Windows 8 will come around with updates and use.", "Date": "March 5, 2014"}, {"Title": "Dell Inspiron 17R", "Author": "Enrique De Benedictis", "ReviewID": "R27T0AZX45UGWD", "Overall": "4.0", "Content": "I bought this computer because comparing proceso to Other inspiraos this one has a good processor with a good speed. I recomend this pc for medium gaming experience, The only thing i would change from it it would be The graphics card, the Intel HD graphics card 4400 is not for gaming or creating models at all because itsweak 32MB VRAM Does not help compared to its i7.", "Date": "February 11, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00F3ZNR0M"}}