{"Reviews": [{"Title": "Kicks the butt of my Haswell 15\" MacBook Pro", "Author": "David P. Pollak", "ReviewID": "R2L07LL75JFVB9", "Overall": "5.0", "Content": "I have been a long-time user of Apple laptops. I always thought that Apple made better hardware, but I've never been keen on OS X... I prefer Linux instead.But I bought MacBook Pros by the bucket-full over the years (at least 2 new MBPs per year.)This year, I switched to using a Dell XPS 13 Developer Edition instead of a 13\" MBP Retina. My review of the XPS 13 is here: blog.goodstuff.im/still_liking_xps_deBut the XPS 13 is limited to 8GB of RAM and I do a fair amount of Scala work, so I need more than 8GB. I went looking for the XPS 13's bigger brother.I got an XPS 15, loaded Linux onto it and started using it. It's a really sweet machine.Well... it's almost sweet... the 1TB 5400 rpm drive is slow, slow... so I replaced the drive with an Intel 240GB SSD drive.And now the XPS 15 is faster than my Haswell 15\" MacBook Pro for Scala development.The XPS 15's screen is better than the MBP's Retina display. I can use the XPS 15 without my glasses where I need my glasses with the MBP.And the XPS 15 is $1,500 cheaper than the 15\" MBP Retina... well $1,300 after the purchase of the SSD.If you're doing hardcore software development and need a wicket fast machine with a ton of RAM, this is the machine to buy. Sad they don't have a version with Ubuntu pre-loaded.", "Date": "February 19, 2014"}, {"Title": "Excellent Buy!", "Author": "delsavio", "ReviewID": "R3PIBAVPYDR54I", "Overall": "5.0", "Content": "Very powerful laptop with very high video quality, which I do recommend.It is also a lightweight laptop taking into account their specifications.", "Date": "March 7, 2014"}, {"Title": "great super laptop, bad desktop replacement, horrible screen", "Author": "Ryder", "ReviewID": "RFQZ7W0ALQ5U2", "Overall": "2.0", "Content": "The materials of the Dell XPS 15 9530 (which is what this is) screams premium.When you pull it out of the box it stuns you with its beautiful aluminum/carbon fiber body.The soft touch rubberized palm rest is great for long use, even though the trackpad and backlit keyboard are so/so.This however, is where the magic ends.I bought this laptop as a desktop replacement laptop to replace my Dell XPS 17 L702x, but I made a grievous mistake.Lets start with the display...Its gorgeous and bright and the touch screen is super responsive and fun. I had no problems with the glare that other people mention in reviews, what I did have a problem with was the resolution... who thought it would ever be a good idea to put a 3200x1800 display into a 15\" screen for a laptop running Windows. Windows applications (May 2015) cannot, I repeat CANNOT handle this PPI, they simply were not designed for it. This single spec makes the computer nearly unusable, period.What I found was a partial solution was to lower the resolution to 1080p, and disable scaling on most applications, which was a pain and didnt work all of the time.While the speed was fantastic, running games like Titanfall and Battlefield 4 like a dream at high without a hitch, I found intels \"fast boot\" technology buggy, often causing the machine to take over a minute to wake up from sleep! This of course wasn't a hardware issue, but a problem with the intel drivers and can probably be fixed.Another big issue for me was the battery life, which clocked in at 3.5 hours with LIGHT usage. I put everything on powersaver and wasnt using the laptop half of the time, while the other half was spent doing light web browsing and word processing. This was a huge drawback for me, as many users reported a solid 7 hours, which would have been great,but I have no idea how they achieved this.I ended up returning this laptop 2 days after I got it, because of the reasons listed above, and the fact that I had not realized that this would not suit my needs as a desktop replacement. That is mostly my fault and not the laptop, since it wasnt designed as a desktop replacement machine. In the end though.. I dont know who this laptop was designed for, those people who claim its great for video/photo editing must be bought off because I measured the icons in photoshop as under a half centimeter in width when the resolution was set to the native 3200x1800.", "Date": "May 12, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "2.2 GHz Intel Core i7-4702HQ (Haswell)\n16 GB DDR3L SDRAM\n1024 GB 5400 rpm Hard Drive, 32 GB Solid-State Drive\n15.6-Inch Screen\nWindows 8.1", "Name": "Dell Computer XPS 15 XPS15-6842sLV 15.6-Inch Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/41ngcbWjs2L._SX300_.jpg", "ProductID": "B00FZJF7K4"}}