{"Reviews": [{"Title": "Good value laptop", "Author": "Jim", "ReviewID": "ROD6FFEKFLODA", "Overall": "3.0", "Content": "First off, this thing is currently $298 in Walmart stores (at least in my area). It is likely one of the most inexpensive \"full size\" laptops you can find. We bought one of these for my mother, who is in a nursing home, so that she could do Facebook and Skype, and it is just fine for basic things like that.I can see why others think this laptop is slow, and it is, at certain things. Since it's a Windows computer, it needs gobs of updates out of the box, and those do take a long time to apply. The same goes for the Windows 8.1 upgrade, which is a 2+ hour process. I believe the weakest link in this thing is the low-end microprocessor in it, and has something to do with the slow pace of updates.Once the Windows OS is upgraded and up-to-date, the laptop performs adequately for basic tasks, like web browsing, e-mail, and word processing. Don't expect it to perform well for processor-intensive tasks, such as video encoding or 3D gaming.Lastly, Windows 8[.1] can be hard to deal with on a non-touch device for older people. I highly recommend a 3rd-party start menu application like Start8 to take the sting off...it lets you have the best of both worlds, and lets old dogs learn new tricks at their own pace.", "Date": "December 24, 2013"}, {"Title": "AMD E not enough Windows8, Read to Save Money, Time, Mental Anguish And Emotional Distress", "Author": "GC", "ReviewID": "R2KI6W4DGZUYND", "Overall": "3.0", "Content": "Hello casual notebook users,(pls thumbs up, I put a lot of hours making this review :-)I know why you're reading this review.  I know exactly why you're here and what you need.You're here because you are looking for a great notebook that will not hurt your wallet.You're curious to find out how far your  hard earned $300 investment can get you.NOT VERY FAR  and this particular HP equipped with AMD E series processor it wont get you anywhere at all.Im writing to you because I would like to save you from your own curiosity and hopes in making this laptop work for you only due to its attractive price.  But don't let the price alone blind you from one fact.1) This AMD E series cannot handle even the most basic functions one needs from a computer.  IMO manufacture's should not even consider releasing such a slow Processor, risking their brand's image.PROS:  4 GB,  battery life, price.CONS:  (AMD E) the processor is too slow to run Windows 8, let alone browse or stream internet.  This CON cancels out all the pros above.But there's a good news for us value shoppers.  There are other options near $300-$400 price range that can deliver you the value and uncompromising performance.  There are just a  few pointers I'd like to mention before I completely lose your attention.No matter how much money you are planning to save, this simple advice in parts will save you much headaches.A) Look for noteboooks with an AMD A-6, A-8 or A-10 Processors or  an Intel Pentium Haswell 4thgeneration or Intel i3.B) Look for 4GB RAM to 6GB RAM.  Do not settle for 2GB, unless you are capable of DIY memory upgrade.C) TouchscreenD) Avoid 3rd Party sellers if possible. Buy directly from Amazon.(pls thumbs up, I put a lot of hours making compiling this review. ty:-)==CONTENTS==1) Alternative Options2) TOP 3  ($280-$399)-(11.6\"-14\"Touch between (3.7-2.6 lbs)3) TOP 2  ($399 - $499)-(14\"Touch between (4.7lbs-5.6lbs)4) TOP 2  ($500-$800)-(15\"Touch between (4.8 Ibs - 5.6 lbs or higher)5) Windows 8.1 Tips & Computing Safety between==Alternative Options==I was doing my research my goal was to find the value laptop without hurting my wallet,  I continue to update and filter through the entire amazon laptop list! YES indeed!  I've done the hard work of searching for the best performing, best priced, that best fit our needs. This is a list of economical touch-screens Windows8 laptop which also offers excellent performance+battery==TOP 3  ($280-$399)-(11.6\"-14\"Touch between (3.7-2.6 lbs)==Here are the best choices for 11\" functional, portable, light weight, bang for your buck notebooks.<><>Expected Performance Meter<><><>ENTERTAINMENT<>[Average to Poor] PC Gaming or [Average] Facebook Gaming[Excellent] Social Media surfing (Twitter,Facebook,Linkedin)[Excellent] Video Chatting (Skype)[Average] Streaming Shows HD (Netlfix,Youtube,Hulu,iTunes)[Excellent] Music Library (iTunes,Amazon MP3,Lastfm,Spotify)<>PRODUCTIVITY<>[Average] MS Office[Excellent] TurboTax, Quickbooks[Excellent] Education Free Courses (from basic algebra at Udacity to Advanced MIT's Open Courseware)<>EXPRESS YOUR CREATIVITY<>[POOR] Music Creation (create music recodings, Audacity)[Average] Photoshop editing (Photoshop Elements)[POOR] Video Editing (Sony Vegas/MovieStudio, Adobe Premier)[Average] Website development (Adobe Dreamweaver CS3)<> NO.1 +/- $359 Lenovo IdeaPad S210 59387503 11.6-Inch Touchscreen Laptop, 1.9 GHz Intel Pentium 2127U ULV(dualcore,2 MBCache, 3rdgen/Ivy Bridge,July2013chip$134), 4GB RAM, 500GB HD(Black)PROS: Light weight at 3.1lbs,.9\"thick. Great 720p camera for Skype, 1usb 3.0, TouchScreen.CPU Passmark Score: 1865CONS:Battery life, No Bluetooth.  not a great deal if prices increase to closer to $400. at +$400 price rage, I'd advise looking into 14\" notebooks options listed below, to get more for your money. Sold by 3rd Party seller, not amazon<> NO.2  +/- $335 HP Pavilion 11-e015nr TouchSmart 11.6\" Touch Screen - AMD Elite Quad-Core A6-1450(06/01/2013) / 4GB DDR3 / 320GB HD / Windows 8 64-bit OSPROS: Quadcore A6-1450  SoC are usually in notebooks at +$450 category but for HPs asking $350ish ? DEAL! but downgraded the Hard Drive , Touch, 4GB, / one of the better CPU/APU options in this category for gaming(Portal 2 and Torchlight 2 on high settings but lag free! /Upgradable to 8GB verified) 3.37lbsPassmark Score: 1642CONS: 320GB instead of 500GB, HP build quality is avg compared to ASUS or Lenovo but thats subjective.  Prices fluctuates too much, if sellers increase their prices closer to $400 i would not recommend buying this or any 11.6\" note books. At $400, finding a better  14\"-15\" touch screen size is possible.  I made my Top Notebooks List at $400 tag below, for details. Sold by 3rd Party seller, not amazon<> NO.3 +/- $454  Acer Aspire V5-122P-0637 11.6-Inch Touchscreen Laptop (Chill Silver)(1.0 GHz up to 1.4GHz AMD Elite Mobility Quad-Core A6-1450 Accelerated Processor, 6GB DDR3 SDRAM, 500GB 5400RPM hard drive, Windows 8 64-bitPROS: IPS screen better color and viewing angle(probably best screen on this list), Same CPU/APU as HP Pavilion TouchSmart 11 listed above thus Pros are identical, + 500GB Hard Drive , 6GB RAM! best gaming capable system at the light weight 11.6\" Touch screen category. Enough power in this noteboko to deliver performance that it could act as secondary main PC.CPU Passmark Score: 1642CONS: Expensive at $450 but it has 6GB RAM(instead 2GB) and 500GB HD(instead of 340GB) with the AMD A6-1450 Quadcore (instead of poor performance AMD A4-1250 Dualcore AVOID at all cost!)______________________________________________________________________________== TOP 2  ($399 - $499)-(14\"Touch between (4.7lbs-5.6lbs) ==These 14\" touch screen laptops are designed for those who are always on go or need a portable computing device, bigger than 10.1-11\"display without sacrificing performance. These notebooks are powerful enough to act as your secondary main PC machine for school, work and home.WHAT YOU DESERVE AT $400  (Typically an increase in price fallows an increase in quality of parts.  At  this price range expect a 14\" Screen Touch ,  with CPU Intel i3 or AMD's A6 or A8 processors) I favor AMD due to their graphics performance doubling that of Intel variant.<><>EXPECTED PERFORMANCE METER<><><Entertainment>[Average] PC Gaming or [Excellent] Facebook Gaming[Excellent] Social Media surfing (Twitter,Facebook,Linkedin)[Excellent] Video Chatting (Skype)[Average] Streaming Shows HD (Netlfix,Youtube,Hulu,iTunes)[Excellent] Music Library (iTunes,Amazon MP3,Lastfm,Spotify)[Average] MS Office[Excellent] TurboTax, Quickbook[Excellent] Education Free Courses (from basic algebra at Udacity to Advance MIT's Open Courseware)<Express Your Creativity>[POOR] Music Creation (create music recodings, Audacity)[Average] Photoshop editing (Photoshop Elements)[POOR] Video Editing (Sony Vegas/MovieStudio, Adobe Premier)[Average] Website development (Adobe Dreamweaver CS3)<> NO. 1 +/- $448 Lenovo IdeaPad S415 59385549 AMD A6-5200M(May 23, 2013) 2.0 GHz Processor (2 MB  Cache05/23/2013, Kabini), 4 GB DDR3 RAM, 500 GB 5400 rpm Hard Drive,  14-Inch Screen Touchscreen, ATI Radeon HD  8400 Integrated Graphics,Windows 8, 5-hour battery...,PROS: Its an IdeaPad brand+build quaity, 14\" touch, Battery life 5hrs!, 720p HD webcam , Sold by Amazon.comCPU Passmark Score: 2450CONS:<> NO. 2 +/- $479 HP Pavilion 14-f027cl 14\" Touch Laptop, AMD A8-5545M 6GB Memory 640GB Hard DrivePROS: Battery life, +5hrBig 14\" touchscreen, Higher grade AMD Elite Quad-Core A8-5545M Accelerated Processor with 4MB L2 Cache, Bigger 640GB Hard drive, and 6 GB RAM, More USB 3.0 . A8-5545M is higher step APU compared to next 2 laptops below sporting an A4-1450 APU thus this is faster and better choice for gaming.CPU Passmark Score: 2539Cons: 1.7lbs heavier than 11.6\" notebooks, Expensive if your budget goal is to get a capable notebook for under $400. don't buy if +$475 asking price.  +$500 price range there are better product selections at 15\" Notebook category. Sold by 3rd Party seller not Amazon.com______________________________________________________________________________== TOP 2  ($500-$800)-(15\"Touch between (4.8lbs - 5.6lbs or higher) ==These touch screen laptop is designed for those who requires performance over portability.<><>EXPECTED PERFORMANCE METER<><><Entertainment>[Excellent] PC Gaming or [Excellent] Facebook Gaming[Excellent] Social Media surfing (Twitter,Facebook,Linkedin)[Excellent] Video Chatting (Skype)[Excellent] Streaming Shows HD (Netlfix,Youtube,Hulu,iTunes)[Excellent] Music Library (iTunes,Amazon MP3,Lastfm,Spotify)[Excellent] MS Office[Excellent] TurboTax, Quickbooks[Excellent] Education Free Courses (from basic algetbra at Udacity to advance MIT's Open Courseware)<Express Your Creativity>[Excellent]Creation (create music recordings, Audacity)[Excellent] Photoshop editing (Photoshop Elements)[Average] Video Editing (Sony Vegas/MovieStudio, Adobe Premier)[Excellent] Website development (Adobe Dreamweaver CS3)<> No.1 $479 Acer Aspire E1-572P-6857 15.6\" Touch,Intel i3-4010U Processor 1.7Ghz,6GB RAM, 750GB HDDPROS: SOLD by Amazon. an Intel i3 touchscreen at 15\" for under $480 is rare. Way under priced for what you're getting.  Could easily be marked up  close to $600 for sure. Battery life is good due to (new)Haswell processor. Great IPS screen. SD card reader , Nice solid Metalic feel unlike most notebooks in this price range made of plastic.CPU Passmark Score: 2514CONS: Weight, standard weight 5.6lbs for 15\" notebook. Great for Video chat with 720P HD camera.<> No. 2 Acer Aspire V5-552P-X440,A10-5757M,8GB Ram, 1000GB HDD 15.6-Inch Touchscreen Laptop (Cold Steel)PROS: SOLD by Amazon, 4.8 lbs, Thin .9\" Ultrabook, Powerful A-10 Quadcore processor, 8 GB of RAM, Huge 1000GB Hard drive(1TB), Fastest APU/CPU for gaming. Powerful still managed to be thin+lighter than standard  15\" notebooks. 4.5hrs battery. Back-lit Keyboard, High end non-plasticy shell, Great for HD Video Chats, Acer.com sells this for $700! Great for business, gaming, traveling, home use, main PC, etc. Superb IPS screen. Its the best of both worlds, ease mobility, super thin and ultra light but powerful enough for everything, all premium features without Ultrabook's $1k Premium prices.CPU Passmark Score: 2922CONS: Need to manually upgrade from Windows 8 to 8.1(free) via Windows Marketplace,  No Disc drive, At $600 you shouldn't complain.  The power and portability you get from this notebook could easily cost you somewhere near $1000 Ultrabook category.  No cons, its perfect.==Windows 8.1 Tips & Computing Safety==_______________TIPS Windows8.1_________________Bring back the start button: Installing one of these two software will help new Windows8.1 users to ease into \"Modern\" user interface of windows 8.11) Classic Shell (free) or 2) Start8 (Stardock $5)___________________________________________________________________Avoiding major damages caused by those pesky malware,virus etc by simply not using an \"Administrator Account\" with your main MS Account.Viruses will likely cause more damage and will be impossible to completely remove if they gained Admisitrator's right and  have dug deep inside your computer.  An \"Administrators\" account is a backdoor route viruses/malware uses get in and cause unrecoverable distruction to your data. With Admin rights those malware can easily infect deep within your \"recovery partitions'! meaning, these's not turning back and you're royally screwed. Theres many more problems that can happen but I think you already get my point.GOALS: 1) Don't use your Main MS Account as an\" Adminitrator\" but instead \"standard\"  2) Create a secondary account called \"local account\" and set that up as the Administrator instead.Account Management: steps creating a local account(administrator) and MS Account(standard)Charms search: type\"control panel\" > \"User's Accounts and Family Safety\" > \"Remove User account\" > \" Add a new user in PC settings \" located at bottom of window > Bringing you to Metro > click \"add Account\" > \"Sign in without MS accout\" located at bottom of page > \"Local Accout\" > create new user name and PWYou have 2 options on Signing IN1) Microsoft account or 2) Local Account1) Create or sign in with your MAIN Microsoft Account. If you already an MS account or uses windows phones/ xbox live or Hotmail/live/MSN email address you can use these as well to link those services to 1 master MS Account.2) Create a Local Account. Thise secondary account will not connect to MS's ecosytem but only in your local computer. I identical to USERS login on Windows 7,Vista,XP etc.Once you've setup these two accounts, you must set each account type to: >Change ACCOUNT TYPE for Main MS Account to \"Standard\"Change ACCOUNT TYPE for 2ndary Local Account to \"Administrator\"Please do these steps, it only takes 5minutes.  Its a small price to pay considering, it may  potentially rescue your entire data from a completely erasing your data after sending it for repairs.__________________________________________________________________________Making Back ups/ EtcAnother tip is to make a recovery image.First install Setup all your programs , setup your custom settings, etcAfter personalizing your PC.  > Its time to Create a Recovery Image right after you've set everything up.  This image will allow you to revert back to this pc's state in time, and in perfect working order.Sometimes system recovery doesn't solve your problems so having secondary backup plan like Recovery Image is key.________________________________________________________________________Not optional, must practice these 3 regular computing habits.#1  (Install McAfee Antivirus, which is now free starting 2014, per Intel's 2014 Keynote at CES) or Paid programs such as Kaspersky Internet Security 2014  is the leading software in the market today. $50.  These programs scans your system automatically, so set it and forget it.#2  (Install MalwareBytes/free, scan your pc every month with this program or sooner when you feel like your system is sluggish or seeing webpages poping up that you didnt click)  Because this is a free software, as a user you must manually start the scaning process or by buying retail version you'll unlock the auto scan scheduler feature.#3  (Install Superantispyware/free, Scan pc every 2wks)Because this is a free software, as a user you must manually start the scaning process or by buying retail version you'll unlock the auto scan scheduler feature.Its ok skip a few scans between months, although not advisable, especially if your a heavy web surfing maniac spending 2-3 hrs daily websurfing not just facebooking.  But please dont go without using all 3 programs more than 5-8 Months in between scans.________________________________________________________________________Another way to avoid  spreading your personal information out there into the wild unknowingly is to un-google yourself.yes ladies and gents! google or yahoo especially yahoo LOL..... but google is key here.Microsoft sells Primarily Software.Apple sells Primarily HardwareGoogle sells neither, that's why their products are so CHEAP, once they suckered in their backdoor ridden ecosystem, Google Inc. sells Primarily Everything about YOU!_____________________________________________________________________________________________________Steps in upgrading from Windows 8 to Windows 8.1  (2-3hrs)Key here is to ensure your windows 8 is fully updated before upgrading to win8.1Therefore repeatedly \"check of updates\" on windowsHow to upgrade to windows 8.1 for dummies.Step 1: Go to Metro and not desktopStep 2: Start typing : \"Control Panel\"Step 3: Click \"Windows Update\" > \"Check for Update\"Step 4: install updatesStep 5: restart computerStep 6: Repeat step 1 -5 until result \"no more updates\"Step 7: Run HP Update client, install all updates from HP to ensure all drivers and bugfixes are updated.( or whichever OEM you may have, lenovo,dell, sony etc.)Step 8: Uninstall your Antivirus Software (important) then RESTART PCStep 9: Go to Windows Store and upgrade to 8.1Step 10: leave computer on for 2hrs as it upgrades.Step 11: Repeat Steps 1 - 7Step 12: if you're not a complete fool, 8.1 upgrade should be straight forward. \\After steps 1-8 ONLY THEN you should install WIndows 8.1 at the marketplace. Goodluck.(note: steps above removes a lot of failures users experience after 8.1 update)___________________________________________________________Not many want to shell out their dollars on Office 360  if all they intend of using is standard word processors.you can use a free web version of office calledBing.com search:  \"MS Office Web Apps\"just sign in with the same  MS Account user name used on your PC.", "Date": "February 10, 2014"}, {"Title": "Great PC Solution", "Author": "DW Rockstar", "ReviewID": "REIQ78LMELKJI", "Overall": "5.0", "Content": "This laptop is perfect for multi-tasking, streaming, and I do some gaming on it as well - my kid set up Starcraft on it.  It isn't created for high end programs but it is perfect for everyday use.  It streams videos and internet efficiently.  This laptop is also a good storage solution for pictures and data as it holds 320 GB.  It does also have a webcam for conferences and Skype, etc.  Overall, it is a great laptop for regualr computing needs and the Windows 8 on this runs very fast, unlike what another review had mentioned.  The con is that it does not have bluetooth.", "Date": "December 4, 2013"}, {"Title": "Worst Laptop Ever Own", "Author": "Brit1219 \"Brit S.\"", "ReviewID": "R37KXSB2JRG0KC", "Overall": "1.0", "Content": "Okay I had this laptop for about 6 months now, if I known everything ahead of time in the first month. I would of returned it and used the credit to get a better computer.This computer was just suppose to be a school computer, just get the job done. Because with all the tablets being released I wanted that market to stabilize and get more for the money. However the computer barely functions to do simple task sometimes and I am not bad with computers.con's1. Makes too many system errors where I had to get a program to correct it. I have system pro 7 and have to run it every three days, because if left alone this computer won't be able to run browsers and crashes everything.(-.-)>2. Pre-load programs like the ap store doesn't run. While this can be avoided, you will never be able to upgrade into windows 8.1 for free. I have done the power-shell method and called the company. They requested 100 dollars to fix the laptop while I only spent $238. So this will be ran on Linux or Google if windows 8 becomes completely unbearable.3.The disc drive will start running whenever the hell it wants. Which is a pain in the middle of class lectures, you can press inside shell of the computer which will flex and make the computer a little quieter Or you could wait it out, or just do what I do and press the eject button and leave it slightly open for quiet.4. I can't run very many things, because the AMD processor just simply hates to be worked. God forbid I want to have powerpoint, word, and google open at the same time.5. Absolutely no way auto-cad or inventor is being ran on this model.6. Aps that do work like skype or windows viewer will randomly crash.I wouldn't even bother with this model,  I'm not sure if it was the jump to AMD from Intel  with a 1.3 GHz processor but this computer was not meant to run windows 8.", "Date": "March 1, 2014"}, {"Title": "For all the negative reviewers", "Author": "lisa", "ReviewID": "RIB03TC45FJDM", "Overall": "5.0", "Content": "For all the people on here saying its slow and save your money . I thinks it's ther Internet that's slow because I also bought this laptop at Walmart and it pretty fast no problem loading web pages I actually watch Netflix while surfing and it stil fast", "Date": "January 22, 2014"}, {"Title": "Slow!!", "Author": "Dragon", "ReviewID": "REGYRY9STC9DD", "Overall": "2.0", "Content": "For the price it's to be expected. I bought one at Walmart (for $50 less btw) and returned it less than a week later. Netflix, HBO Go, and Showtime Anytime would barely work despite internet speed. The processor is just too old.That being said I respect HP for putting out an affordable unit, but you will get what you pay for.", "Date": "January 4, 2014"}, {"Title": "my hp 2000", "Author": "Thelma kumwenda", "ReviewID": "R20QQCZ03O79KA", "Overall": "2.0", "Content": "I love my laptop it has meet my expectations  and its working well. Thanks is good doing business with you", "Date": "May 21, 2014"}, {"Title": "Good", "Author": "herlpson phanor", "ReviewID": "R55Q954GQ98NM", "Overall": "4.0", "Content": "As a first impression, that's a good laptop, I don't know how long it will give me when I start to install some programs on", "Date": "May 21, 2014"}, {"Title": "Good price and does what i need for work and play", "Author": "Freddie M.", "ReviewID": "R22KHSW3DTVFVA", "Overall": "5.0", "Content": "I can't complain about anything it was all to my liking i must say when it come's to Amazon Prime it set the mode right for everything to fall in line and for that i am thankful for \"Amazon Prime\" thank you \"Prime\"keep up the Good Stuff", "Date": "May 18, 2014"}, {"Title": "Purchased two", "Author": "Honey", "ReviewID": "R33CBXYNUHZ8JY", "Overall": "5.0", "Content": "One works perfectly while the other cuts on and off like no ones business from time to time that's refurbished for you", "Date": "May 10, 2014"}, {"Title": "....", "Author": "Kevens pierrelouis", "ReviewID": "ROT2H4IIB755H", "Overall": "3.0", "Content": "it is very useful and can run games like assassins creed batman arkham origins and many more but its slow after the first day", "Date": "April 22, 2014"}, {"Title": "Nice Product for \"used\"", "Author": "Nom de plume", "ReviewID": "R3F0U988B8NSI4", "Overall": "4.0", "Content": "Working pretty well...most problems have occurred because I went from XP to Windows 8, then Windows 8.1--so encountered some missing drivers, etc., but I expect this computer will be good long term.  Prompt shipping; well wrapped, etc.  I gave it 4 stars just to leave some 'wiggle room' in case of any unexpected issues, but the merchandise and the seller probably deserve 5 stars.", "Date": "April 18, 2014"}, {"Title": "Just as expected!", "Author": "Lacy", "ReviewID": "R2S1WO9AYBMX3N", "Overall": "5.0", "Content": "I bought this for my mother since her old laptop began giving her problems.  I have this version so I bought her one and she loves it!  So far no problems and the shipping was fast.", "Date": "April 3, 2014"}, {"Title": "HP laptop", "Author": "Trivona Stegman", "ReviewID": "R2HZZKT7YSYGX1", "Overall": "5.0", "Content": "I got this for a daughter, and she just loves it.  She was used to the touch screen with her tablet, so has no trouble navigating around on this.  She had been using an old laptop with XP on it, and likes this one so much better.  I was very pleased with the price and so glad she likes it so much.", "Date": "March 27, 2014"}, {"Title": "great!!", "Author": "Tyme 83", "ReviewID": "R32CJ56XYK1WQN", "Overall": "5.0", "Content": "Awesome service!! I will use it more and more each time the service continues too be beat.thank you very much.Pryme", "Date": "March 22, 2014"}, {"Title": "Good value", "Author": "cyclestu", "ReviewID": "R35CBO5ONWYTO", "Overall": "4.0", "Content": "Works fine, easy set up, fast enough for me.  Bought it in spite of the negative things said about Windows 8.  I find that if I keep the thought that everything I need is there and all I have to do is find it, all works well.  I now enjoy the way it is set up.  One negative for Windows 8 that I have found.  Bought a blue tooth headset to work with my cell phone and hoped it would work with the computer.Windows 8 has a big blue tooth problem and I have not yet been able to fix that.", "Date": "March 19, 2014"}, {"Title": "Windows 8.0", "Author": "Bryce Lampshire", "ReviewID": "R1W394TQDUE3BE", "Overall": "3.0", "Content": "The laptop is just fine.  Windows 8.0/8.1 is a real disappointment.  It is designed for smart phones not laptops.  Should have waited for next windows version.", "Date": "February 8, 2014"}, {"Title": "Slow", "Author": "Kayla Miele", "ReviewID": "R35OV0VR7L8OLT", "Overall": "3.0", "Content": "Its slow and it freezes on me sometimes. I dont know if that requires virus protection but it is annoying", "Date": "January 18, 2014"}, {"Title": "Great laptop for the money!", "Author": "Derek Galen", "ReviewID": "R3M7J6QYYYPWFN", "Overall": "5.0", "Content": "This product is well worth the price.  I was debating between the touch screen and this - but quite honestly I have read too many bad reviews on some of the touch products so I went with this one and it is working well.  I am using it for streaming and music, basic navigation through the web, business email, and to burn and watch DVDs through a separate reader/writer/player drive.  With Windows 8, you may have to download a separate dvd playing software - I downloaded VLC Media Player for this.I am happy with this purchase.", "Date": "December 3, 2013"}, {"Title": "good but dificult", "Author": "Cristiam", "ReviewID": "R2ZZGO1TIPBNVE", "Overall": "4.0", "Content": "The product is good, but i am just getting familiarize with the plattaform of  windows 8, and on general the operative sistem of HP its a bit dificult.", "Date": "December 27, 2013"}, {"Title": "Fast & Safe", "Author": "Michael", "ReviewID": "R368E5LR47J1RI", "Overall": "5.0", "Content": "The computer arrived quickly and safely.  The packaging was incredible, I was able to move it directly from the box to my checked baggage and it arrived in tact after a 20-hour journey through 3 airports.", "Date": "February 6, 2014"}, {"Title": "Great Purchase", "Author": "Timothy Defosses", "ReviewID": "R2R6V6YWZ8UK1P", "Overall": "5.0", "Content": "I was very happy with the price and quality of this Laptop.  It is fast and exactly what I was looking for.", "Date": "January 16, 2014"}, {"Title": "Great for money", "Author": "Pddosmith", "ReviewID": "R2WS1NP9FO0A5H", "Overall": "5.0", "Content": "Works for everything my son wanted to use it for. He wanted something he could play games on and it works", "Date": "January 12, 2014"}, {"Title": "Do Not Buy Unless....", "Author": "Danisha", "ReviewID": "R3J3BVIKXMZN5X", "Overall": "1.0", "Content": "You are very patient!!! This thing is terribly slow! I brought this about a week ago and have had trouble with it from start up. Right out of the box it takes about an hour to get setup(although that could be more of a windows 8 problem than the laptop itself) and surfing the web, or trying to navigate it's features, but once you're done with setting up and try opening a webpage it takes forever load. I purchased this laptop because while I love my Ipad and Sony tablets they do not support adobe flash player and because of this there is certain content that cannot be viewed or played using these devices. however, viewing videos on this thing is near impossible it is so slow that peoples actions in the videos are never insync with their voices or sometimes it looks as if you are watching the matrix with the way peoples bodies move in slow motion. now this might be due largely inpart to the fact that this laptop is missing a whole lot of updates(like about 90) and there are also some features that need to be downloaded straight from the hp website. Updating all of these things help some but not much, also be prepared to give up about half a day updating these things and not doing much else on your computer that day, and if you update this to windows 8.1 add another 2 hours to your wait time.In the past i've had similar systems with similar specs through different companies and never have I been this dissatified with the performance of the machine or software. I will be returing this laptop for the full purchasing price and wait until i can save up enough money to buy something that'll better suit my computing needs. It was only 298.00 and at the time it seemed like a good buy but honestly there are better things I can do with that money than to waste it on something dissappointing.*Side note:  I decided to take this back today and I started the reset to factory settings at noon it is now 2:07 and it's only at about 24% completed, so it'll most likely have to go back tomorrow instead. This is what I mean by slow I've installed new software on systems and it didn't take more than an hour to complete that task so why would resetting it take hours?  at any rate it's going back and I will never buy another hp again.", "Date": "December 1, 2013"}, {"Title": "My husband works in the tech industry and he confirms, this is terrible!", "Author": "BWallace", "ReviewID": "R152I82VOKL3AN", "Overall": "1.0", "Content": "This computer is so impossible to use, that I couldn't even use it to write my review about how impossible it is to use.My first lap top I had (in college, over a decade ago) was an hp. It was a great computer. In fact, it still works! It is just too out of date to serve the functions I need it to anymore. Using this awful laptop, I am convinced, hp does NOT MAKE LAPTOPS OF THE SAME QUALITY ANYMORE. It is either that, or I got a defective one. The mouse is so hard to use to accomplish any and all ends you have in mind. Often, the screen freezes inexplicably and will not allow you to click on anything or move the mouse. Even the up & down arrows stop functioning to scroll up and down the page when this happens! Also, if you stream video, the screen will become a mass of jumbled colors intermittently.I have been using my husband's Mac lap top for so long, that he insisted I get some kind of lap top, tablet, notebook, etc. We also have a Mac desktop. However, I had a really good experience with hp in the past. I don't consider myself a \"Mac girl\" or anything like that, but I will not be buying an hp computer again. Using this one has been such an inconvenience, and unbelievably irritating. I have no idea how anyone who knows the difference between a decent laptop and a terrible one, could leave a positive review of this product.", "Date": "March 7, 2014"}, {"Title": "SO SLOW. TERRIBLE.", "Author": "Ayrial:]<3", "ReviewID": "R38DZIFMUR3MD6", "Overall": "1.0", "Content": "This computer is junk. Save your money, and invest in something better. Honestly, this thing is slowwwwwww. I can't do anything on it without waiting minutes at a time for one page to load. I would absolutley not EVER reccomend this computer to someone. Two thumbs down. :/", "Date": "December 17, 2013"}, {"Title": "Bought this as a birthday gift for my gamer bf", "Author": "mimi plastique", "ReviewID": "R32QILZ7M162HR", "Overall": "5.0", "Content": "my boyfriend is big on seed and memory this computer was PERFECT for gaming and has lots of memory ! i am very happy wight his purchase ! would recommend this computer if you have gaming needs but do not have 1000 to spend on a \"gaming\" computer - i am very happy i bought this !", "Date": "March 2, 2014"}, {"Title": "Love it", "Author": "Norah Kudambo-Mushonga", "ReviewID": "R7UGFPM3GWNDL", "Overall": "5.0", "Content": "There was a delay with fedex, because the package needed a signature , i re-routed to my work place instead of my home.Fedex decided to deliver after working hours and had to spend at least 2 hrs going back and forth with fedex. But afterthe fedex issue i'm having a great time learning windows 8, Love the laptop", "Date": "December 27, 2013"}], "ProductInfo": {"Price": "$389.00", "Features": "Screen Size: 15.6\"\nScreen Resolution: 1366 x 768\nProcessor Type: AMD\nProcessor Model: E-300\nProcessor Speed: 1.3GHz", "Name": "HP 15.6\" Laptop 4GB 320GB | 2000-2d19WM", "ImgURL": "http://ecx.images-amazon.com/images/I/51GVB5mhBRL._SX300_.jpg", "ProductID": "B00FL9ECK4"}}