{"Reviews": [{"Title": "Oh Wow.", "Author": "ARJ", "ReviewID": "R2K62NCGTE3NTV", "Overall": "5.0", "Content": "There are so many great features about this laptop. I was very worried about paying a high price for an ultra book, but after many months of searching i decided on this Dell XPS 13. I was very skeptical but wow, what a great buy. It is so light carrying it around you feel like you are walking into a presentation empty handed without a laptop. Windows 8.1 is not my favorite but using it you realize there are great features and with the Solid State Drive it boots up in 4 secs, honestly in 4 seconds. Not from standby or sleep mode but from complete boot up. The Intel i7 and 8GB Ram is fast. The screen is amazing quality, does not hurt your eyes even though it is just 13.3\". Processing power is wonderful and battery life is even more fantastic, i get around 12 hours of use and even more with wireless and Bluetooth turned off. The keyboard is great with the back light although i normally turn it off during the day.. The build quality is excellent, solid aluminium it feels very strong and sturdy. The touch screen is great, very easy and comfortable to use. It runs absolutely silently. There are two usb 3 ports, a headphone jack and a mini display port. Amazon Basics has the mini display to vga and hdmi dongles and they work perfectly. I love this laptop did not regret it, for the features and convenience well worth it.", "Date": "April 8, 2014"}, {"Title": "DO NOT BUY THIS COMPUTER!! IT WILL NOT WORK AND THEY WILL NOT REPLACE IT!!", "Author": "T. Falk", "ReviewID": "R330HGTX1SQ9AV", "Overall": "1.0", "Content": "I bought this computer for my fiance for school and it has been a complete NIGHTMARE. Google Dell laptop cursor problems or mouse problems. The computer randomly will select things when you dont even touch it! She cannot even use the computer because while using it the computer will select a different window, or tab, or paragraph etc etc. We have told dell of the problem and been through hours and hours of customer service bull crap. Every time its someone who barely speaks english and they have us do that same perfunctory steps that we have already done. Finally they replaced the mousepad and mother board. Guess what?? IT STILL HAS THE SAME EXACT PROBLEM. I then spent 3 hours on the phone trying to get them to replace the laptop.....they wouldnt do it!! I called multiple times to talk to a manage and each time the manager was \"IN A MEETING\" which means they either were lying or do not have managers. Lastly we sent it in to get repaired through dells 3rd party company. They replaced the hard drive and the operating system. YET AGAIN THE SAME PROBLEM PERSISTS!! DELL SELLS CRAP COMPUTERS AND THEY KNOW THEY ARE CRAP!!! HUNDREDS OF PEOPLE HAVE THIS SAME PROBLEM, LOOK ONLINE AT FORUMS!! I WILL NEVER BUY ANOTHER DELL AGAIN, TERRIBLE PRODUCT AND TERRIBLE CUSTOMER SERVICE!! DO NOT BUY THIS COMPUTER IF YOU WANT IT TO BE ANYTHING MORE THAN A PAPER WEIGHT!!EDIT: DELL HAS DISABLED REVIEWS ON THE DELL WEBSITE...AFTER LOG IN AND CLICKING ON THE \"WRITE REVIEW\" BUTTON YOU GET REDIRECTED TO THE COMPUTER SALE PAGE!! IT IT LIKE THIS FOR EVERY LAPTOP!! WHAT DOES THAT TELL YOU ABOUT DELL PRODUCTS??", "Date": "April 15, 2014"}, {"Title": "Waste waste waste", "Author": "Pillu", "ReviewID": "R1EZEXY7AKHL4V", "Overall": "1.0", "Content": "No customer should buy this product once again I have invested 1643$ on this but I missed that item when is was requested for the refund they even not responded for this request waste customer service from amazon", "Date": "May 8, 2014"}, {"Title": "Fishing for the truth", "Author": "Occasional Critic \"skypilot\"", "ReviewID": "R3HGU63KW8ZOWU", "Overall": "3.0", "Content": "Not sure what to believe here. Saw good review other places. This is a test to see if they have really disabled reviews. Hard to believe.", "Date": "May 30, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00G518N7U"}}