{"Reviews": [{"Title": "This was enough to make me give up my Retina Macbook Pro and go back to Windows", "Author": "John S. Dean \"John\"", "ReviewID": "R1N3UNTWEZT8YQ", "Overall": "4.0", "Content": "I switched from Windows to MacBook Pros back in 2009 because I loved the trackpad on the macbooks.  I've been using my 15\" Retina MacBook Pro since they were released in 2012 and loved it, but I had picked up a Surface Pro when they were released in Feb and really liked the experience.  I'm a multiple Microsoft MVP award winner in the Tablet PC group, and had used tablets exclusively from 2004 or so until I switched to the Mac in 2009. So while I couldn't use the Surface Pro as a main machine due to the small 128GB SSD, it did show me that it was time to return to Windows and a tablet computer.I started looking hard a month or so ago when the new Haswell chip systems started showing up.  And I kept coming back to this one as the most bang for the buck.  I went through all sorts of problems getting my hands on one, but finally did a few weeks ago.  I copied everything off my Mac to a USB drive and never touched it again other than to clean it off to sell.The first thing that struck me was the thinness and weight.  I never thought of my MacBook Pro as heavy, but every time I pick this up it still surprises me.  And one of the big things for the Mac was the solid block body, and the fact that I could pick it up by a front corner and not have flex in the body.  I can't see any flex when I pick this one up the same way, and there's no noises like creaking or popping like so many show when picked up that way.The next thing that struck me was the screen.  Just gorgeous, even better than my Retina MacBook Pro was.  In my research I read all about the dirty yellow problem, but in my usage, I never saw anything that really struck me with it being a problem or even noticeable.  One of my groups of photos is from a Mazda Miata special edition I owned, when they made 1000 of them in yellow back in 2002.  And the photos looked just fine to me.  I could pull up a \"test pattern\" and changing between the low power and high power setting see the color difference, but in my normal usage, remote sessions with servers via RDP or web browsing or even photos downloaded from my digital cameras or camcorder, it's not something I notice.  But I don't do things that require a perfect reproduction of color, so I'm far from the best yardstick for this.  All I can say is that I never really cared about it because it never was something I noticed.I was using it for work the very next morning when I didn't have any programs other than Office installed on it, and all my files were in a folder on my desktop called \"FromMac\" in a pile.The QHD resolution is very nice, and some things scale well, but others don't.  I'm using Quicken 2014 and am still participating in the beta, and that is just horrible on this thing.  It's usable, but it's a real pain.  Other things are fine, like IE, or the on board Windows 8 programs, and Office.  And so far the majority of the third party programs I have are scaling just fine with the default settings this ships with.  I'm hopeful that I'll be able to take the time to do some adjusting and testing to find a way to make things like Quicken usable.From a usage standpoint, I just love this.  I've had over half a dozen tablets I've used prior to switching to my Macs, and this one blows those all away.  I've always liked IBM, and Lenovo after they took over the non server side of things, and I've always loved the Lenovo keyboards.  This one works and feels as well if not a little better than my MacBook Pro's keyboard.  The backlighting is nice, but the Mac's backlight could be adjusted brighter and dimmer, whereas this is strictly on and off.  For me, it's not a big deal since I never really touched the brightness of the keyboard.  The sizes are fine, and my touch typing is not hampered by anything, including the slightly smaller right shift key that some people don't like.The convertible aspect works well.  I really don't see myself using it in two of the modes, since I'm pretty much a straight laptop or tablet person.  I use it as a laptop about 90% of the time because with my work and things I do at home, that's the primary use.  But when I flip it into a tablet, it's just a gorgeous tablet.  I have no issues with the touch whatsoever, and about the only complaint I have is that I'm used to playing a few tablet games like Mahjonng and Tap Tiles on the MS Surface where you can easily see everything because of the smaller screen size, so peripheral vision allowed you to easily see the whole board to help get the fastest speeds.  This one I can't encompass the whole screen that way, I have to move my eyes more, so my time has suffered somewhat.  But that's about the only complaint I really have with the screen.The processor runs cool, and the fans almost never came on even when I was using MKVToolnix to remux MKV files or such.  So ultimately it's been more quiet than my MacBook Pro was and more comfortable on my lap than the Mac.The screen is a magnet for fingerprints, and the most annoying thing overall is the trackpad and keyboard just seem to take any bit of oil on your fingers and let it multiply behind your back.  I'm always wiping it all off with a micro fiber cloth.The touchpad works great, is about the smoothest feeling trackpad I've played with on any PC based laptop, but still isn't comparable to the one on the Mac, which was what made me buy it in the first place in 2009.  A frustration with this one here is when I want to press to click something with my thumb, then move it with my finger dragging, such as moving a window or clicking to drag a selection window.  Because of how my hands are positioned usually, my thumb is clicking on the right hand side of the trackpad.  This worked great with the Mac, but on here, I cannot get it to register a single click from the right half of the trackpad.  So I have to always consciously make sure my thumb is far enough to the left to do the initial click.The hinges are solid.  There's very little play in the display and it holds up solidly to being used as a touch device in laptop mode.  It does move a bit under the pressure but it doesn't change position, so it's not like you're tapping something and having to pull it back forward again to keep it in place.The outer casing behind the screen is somewhat textured, almost feels a bit rubbery, which is a nice thing after the aluminum Macbooks I've been using, since when I'm pulling it out of my case, or carrying it closed, it's a solid feeling.  You don't fear it's going to slide out of your hands (which caused me a few skipped heartbeats in Wisconsin winters with my Macbooks).There's only one USB 3 port and one USB 2 port, but for me that's not an issue since I use a USB 3 based docking station to extend to a second monitor and other ports for things I use at the office anyway.  I don't use anything at home other than an occasional USB stick.  There's a full sized SD slot, but the downside with that is that it has the SD card stick out even farther than the MacBook did.  Nearly half the SD card protrudes out the side when you insert one.  I really would've preferred a MicroSD slot simply because that would be totally flush.  I assume they did this to allow for the higher capacity available on SD cards though.  But it's strictly a temporary storage solution since I would never leave something in there all the time to hold a permanent bit of data like my music library or something.Sound is quite decent.  Let's face it, most laptops and especially anything that's ultra portable isn't going to have much booming sound, but this surprised me.  By far not the worst I've heard in a laptop.My i7 model with my normal use and 50 to 60 percent brightness and using things like Office, remote desktops, instant message, web browsing and such, with wifi on the whole time, and I'm hitting 7 hours consistently with 10% or so to go before I start plugging it back in again.  This is using what they call \"daily\" mode which puts performance at \"medium\" since that's all I'd need for those tasks.  And even in a bright office it's more than sufficient to see the screen easily.They released an update for the yellow color yesterday, which consists of a new BIOS version and a new power manager version.  The temp \"fix\" was to change power settings to be high performance and change the brightness.  But from what I've seen and tested, the fixes don't really change anything ultimately, since if I go to a test pattern and change between performance mode and my \"daily\" mode now, I still see a noticeable difference in the yellow.  But again, for me, the yellow issue isn't noticeable in anything I do or even the photos I have, so that's not an issue for me.All told, I am incredibly happy with this.  The QHD screen is frustrating at times because some things like RDP make the remote servers I work on impossible to see, but I've found workarounds for most things.  I may have switched back to another Surface Pro and gotten the new Haswell version of the Pro 2, but my work really needs a usable trackpad, and I just never could stand the one on the Surface's keyboards.  Too small and not very smooth to operate.  If they had done a better trackpad I probably would've gone with the Surface Pro 2 simply because I really loved the first version I had.  But to do that, I'd have to sacrifice some CPU horsepower.  And as much as I absolutely LOVED my Surface Pro and as awesome as the build quality was, when you look at the 1199 pricetag that this ran me, I just can't get past the fact that there's so much you're getting for such a great price tag.  None of the others really compare to this in terms of bang for the buck.All in all, it's a delight, and I don't miss my MacBook even a little.", "Date": "November 16, 2013"}, {"Title": "Best Ultrabook out there at the end of 2013", "Author": "J", "ReviewID": "R32NEE76FKKHFB", "Overall": "5.0", "Content": "Updated 11/27/2013First things first, I got my Y2P at Best Buy for the low price of $1200, I hope Amazon adjust their prices soon.  That aside, this is by far one of the best ultrabooks out there right now, and the only thing that even comes close is the Macbook Air.  I say this because any windows ultrabook that rivals the Y2P in specs and screen resolution, runs at least $200 more.  Now I'll try to summarize a few things that stand out about this laptop, either to me, or in the various reviews I've come across.Screen: speaking of the screen, 3200x1800p is incredible to look at, and after using this for a week, I find it hard to go back and look at the 1080p monitor of my laptop.  That said, it is true that Lenovo has run into some odd problems with yellow reproduction, and any yellow will look a bit green/mustard-ish.  This is particularly noticeable in photos and less noticeable/non-existent in movies.  While Lenovo has issued a BIOS update to attempt to fix this, it is only an improvement, and the problem is not fully fixed.  This, combined with the fact that Adobe has yet to update their software suite to fully support such a high-res screen (all the tool buttons will be tiny), makes this laptop unusable for photo and video editing enthusiasts/professionals.Battery-life: when I got it out of the box, the battery life was a healthy 6-7 hours.  while this is decent, other laptops carrying a similar processor lasts significantly longer, most notable is Samsung's Ativ book 9 with 9 hours or so.  A number of tweaks have been suggested on the internet to attempt to increase battery life, from simple things such as lowering the brightness, minimizing background apps/software, to more drastic things such as undervolting the CPU and GPU, lowering CPU max performance to 80% while on battery, and even heatsink modifications to improve thermal efficiency (the fans will turn on less, saving battery).  Overall, you can tweak it to get up to 9-10 hours, whether or not it's worth your time is up to you.  Lastly, the battery is 'user replaceable' if you're willing to unscrew about 11 T5 Hex screws, carefully remove some motherboard connectors, etc etc.  It is not something doable on the fly to get extra mobile hours of work in, but you can do it if your battery starts breaking down in say 2-years.  I've seen the battery on ebay for $75, maybe it'll get cheaperKeyboard: Lenovo decided to finally give a Yoga a backlit keyboard, which is just great.  in all honesty this keyboard is a joy to type on.  and even when coming from a professional mechanical keyboard that I use for my desktop, I find this keyboard to be great to work with.Trackpad: another great job from Lenovo.  from personal experience, I find it to be a little on the stiffer side, other than that, no complaints what so ever.  only track-pad that beats this is the ones that Apple makes.So in summary, while there are nitpicks here and there, I find this laptop a joy to use overall, and just looking at that screen everytime I turn it on makes me happy.  it's also the cheapest ultrabook you can get for matching specs, which is why I decided to give it five stars.  if you're in the market for a performance ultrabook, this is the one to get (unless you're main use is photoshop related).Update 12/15/2013Just wanted to say that I have come to really appreciate an unexpected aspect of this laptop.  as a byproduct of the 360 degree rotating screen, I can now set the screen at any angle I want while doing stuff either in bed or sitting in a couch.  this is EXTREMELY comfortable and convenient and I can never go back to a traditionally designed laptop after this :D", "Date": "November 21, 2013"}, {"Title": "Gorgeous display, reasonable price, excellent buy!", "Author": "CM", "ReviewID": "R1V9YIOEM0VJ5V", "Overall": "5.0", "Content": "I was first attracted to Yoga 2 Pro by its stunning display.  It uses the same LCD panel as Samsung's Ativ Book 9 Plus.  The 3,200 x 1,800-pixel screen is simply gorgeous, ultra sharp and crisp.  It's at least on par with, if not better than, Macbook Pro 13's Retina Display (2560 x 1600).Just a catch, the LCD panel's Pentile Red-Green-Blue-White (RGBW) pixel matrix is different from the more conventional Red-Green-Blue (RGB) matrix.  It leverages a modified physical layout of the pixels to deliver a brighter display at lower power consumption levels.  This results in lower color luminance, especially when viewing yellows.  So, when I first opened Paint to browse the color palettes, bright yellow appeared as dirty brownish yellow.I investigated online and found that Lenovo had already come up with a remedy.  Supposedly, all I needed to do was to update the BIOS and installed a new version of Lenovo Energy Manager.  I set the power option to \"Daily Mode\" and disabled adaptive brightness in Windows 8.  Then, I checked Yoga 2 Pro's colors against an iMac and a Samsung monitor.  True, its yellow was closer to pure yellow than the other two, but somehow, the colors were still a tad off.  For example, faces would appear paler on Yoga 2 Pro's display.I dug further and read that some people used a colorimeter, such as a ColorMunki or Datacolor Spyder 4, to calibrate the display.  Not wanting to spend more money, I experimented and tried to do color adjustment manually.  After a few rounds of trial and error, I eventually was able to tune the colors to my satisfaction by adjusting the color saturation.  Now, the display just looks perfect.Yoga 2 Pro looks like a no nonsense business laptop rather than a geek type.  Its silver color is rather dull, definitely not shiny like, for example, Sony's Vaio Duo.  It's very thin and light, actually thinner than Macbook Air and just a tad heavier (0.61\" vs 0.68\" and 3.06 lbs vs 2.96 lbs).  It doesn't appear so because of the latter's tapered design.The keyboard is very thin, with low profile (shorter) keys and thus short key travel distance.  It actually feels very good and comfortable typing on it.  The keyboard also has backlighting, which is controlled manually by the Fn + Space bar key combination.  There is no auto sensor, which I think is a plus.  I surely don't want a shadow inadvertently turning backlighting on when I don't need it.With Windows 8.1 and a touch screen, Yoga 2 Pro introduces a whole new user experience.  You could choose to use the touch screen or your mouse/keyboard, depending on the tasks on hand.  Some tasks such as managing folders are better controlled by mouse/keyboard.  Whereas, some like going through a set of pictures are better with the touch screen.Yoga 2 Pro also comes with a motion sensor.  You could use gestures - without touching the screen - to control some simple tasks such as moving to the next pictures.  However, this feature is sometimes quite sluggish; it's more for bragging rights rather than practical use.  It also allows voice commands, for example, you could say \"one, two, three, cheese\" to take a picture.  Or use your voice to dictate an article.  These are really Windows features, not unique to Yoga 2 Pro though.For its relatively lower price as compared to its direct competitors, Yoga 2 Pro does cut some corners or has some drawbacks.  First, its camera's resolution is 1280 x 720 pixels.  The pictures and videos it takes are mediocre in quality, especially when you view them on its own gorgeous 3,200 x 1,800-pixel screen.  Second, it has only one USB 3.0 port, and another USB 2.0 port.  So, it's a little inconvenient when you need to transfer files between two external hard drives.  Third, the screen isn't detachable (like Asus' Taichi), and couldn't swivel (like Dell's XPS 12).  So, when you flip the screen to form a tablet, the keys are actually exposed, though they're disabled.  Fourth, it has a slower SSD as compared to other high end ultrabooks.  However, it's only noticeable when you run benchmarks.  Otherwise, in daily use, you wouldn't notice it at all.My last complaint isn't really Yoga 2 Pro's fault, but Microsoft's.  The offerings on Microsoft App Store are still very pathetic.  My remedy is to install an Android emulator called BlueStacks.  Now, the richness of the Android apps on Google Play is fully available to me.In conclusion, Yoga 2 Pro may have some drawbacks, but with its unrivaled screen and relatively lower price, it's an excellent buy nonetheless.ADDED Dec 13, 2013:  I experimented and changed my power option plan.  Windows 8's adaptive brightness feature was turned on automatically again.  I got a quick one-off fickle on my display occasionally as a result.  With adaptive brightness on, I suppose Windows 8 will try to dim your display to save power.  When Lenovo's energy manager detects this, it'll turn up the brightness level again to compensate for the RGBW panel's lower color luminance.  So, you need to manually turn off Windows 8's adaptive brightness whenever you change your power option plan.ADDED Dec 13, 2013: The Android emulator BlueStacks doesn't work that well and is incompatible with some apps.  Genymotion seems to be a much better alternative.  Or you could try a more comprehensive solution by creating an Android virtual machine yourself.  First, install VirtualBox.  Second, get the latest version of Android x86 and install it as a virtual machine in VirtualBox.ADDED Dec 17, 2013: After playing with them several days, my personal favorite Android emulator is Genymotion, though you'll have to take an extra step to install Google Play Store yourself.Btw, the manual color adjustment steps mentioned above are:1. Right-click on empty space on your desktop and choose \"Graphic Properties\";2. Click \"Display\";3. On the middle pane, click \"Color\" and then \"Advanced\";4. Adjust the \"Saturation\" bar to your satisfaction (my setting is 45) and click \"Apply\" at lower right corner of the window.ADDED Dec 25,2013: I had never experienced dropped Internet connection like others reported, but sometimes, my downloads were painfully slow or even got stuck.  Some suggested updating the WiFi card's driver through Windows Update, but I found that it wouldn't give you the latest driver update.  The WiFi card in Yoga 2 Pro is Intel Wireless-N 7260.  So, I went directly to Intel's website to download and install the latest driver (current version is 16.6.0).  Now, all's well with my wireless connection, with no more slow or stuck downloads.", "Date": "December 11, 2013"}, {"Title": "Disappointed - updated", "Author": "Azlan Tariq", "ReviewID": "R1OHIHG6MRF231", "Overall": "5.0", "Content": "Purchased the laptop a week ago after waiting patiently for its release for more than 4 months and I felt that it was my obligation to warn other early adapter like myself. First of call do yourself a favor and check out [...] There are many issues with this laptop that everyone buying should be aware off. Pros1) Beautiful looking laptop2) Speedy3) No wifi issues.4) Extremely sharp screen. This is actually a disadvantage in windows 8.1. Icons and text can become extremely small and barely visible. Window 8 apps are limited.5) Good battery life but certainly not great. The Samsung ATIV Book 9 plus gives about 8 hours and Mackbook Air about 15 hours. The best I have got so far from the Yoga is 6 hours.6) Good keyboard. Could be better.7) Speakers are very loud and clear8) Great price9) Very versatile with the tablet, tent mode etcCons1) Fan noise: Any time the CPU hits 8% processing or higher the fan goes on. And it is loud. Apparently there is a fix for the first generating Yoga that some developers figured out but Lenovo unfortunately never did. Fan noise when I am just browsing the internet and using 10% CPU is unacceptable2) Inaccurate colors: I use Photoshop for photo editing and I am an avid photographer. Even though the screen is gorgeous but the colors are not true. The yellows look like mustard. That is a deal breaker for me. I don't care if they come out with the software fix. Something like this should be fixed before shipping.No ethernet port: Once in a while I need to use the port when communicating with the router. Could be a deal breaker for some people.I am returning the laptop tomorrow.Update 11/22/2013Over the last few weeks the two qualms I had about the laptop have been addressed. I downloaded Notebook fan control and I set one of the fans on auto and the other at 40%. Now the laptop is mostly quite. Now only when I am really pushing the processor and the CPU temperature hits 60 degrees does the fan get loud.Lenovo listened to customers complaints and released a BIOS update regarding the screen yellow issue. The yellows are much better now and close to normal.After using the laptop for more than 3 weeks now I have fallen in love with it.", "Date": "November 4, 2013"}, {"Title": "Really good machine with one annoying flaw ... maybe one and half.", "Author": "DJ007", "ReviewID": "R10IX7A9HFVE6R", "Overall": "4.0", "Content": "I compared endless laptops from all different manufacturers for months.  I think I read every amazon review of every laptop that had the intel Haswell Core i7 processor with 8gb of ram.  I went to Best Buy, played with all of the laptops, convertibles, and surfaces, and then read some more.  And then I bought this one.It's snappy to say the least.  When it's started from sleep, the welcome screen greets you in about 3-4 seconds.  After password entry, the start screen slides into place in another 3 seconds or so..It's quiet.  You will hear the fan run when it's working; the person next to you will notice it, but in a work/starbucks/airport environment (where all the laptops gather to socialize), I don't think anyone will notice it.  When I can hear myself breathing, I can hear the fan.It's light but sturdy.  It doesn't flex at all when you pick it up.  The body makes no noise whatsoever.  It's coated on the inside with a kind soft, leathery, grippy coating that's pleasant.The screen is wicked shahp (sharp if you're not from New England).  Quad HD in fact.  Once you update the bios (which you need to do, and it's easy), colors are smashing baby.  Lines and details are crisp with no bleed or fuzz.Which brings me to the first gripe.  I didn't buy this for the quad hd screen.  I got it for the processor/ram combo at this price point.  Most of the non-microsoft programs haven't scaled for this resolution so, for instance, pop-up windows are tiny.  I get occasional questions and notifications from my antivirus software - they're a little bigger than a quarter.  With text that I have to read in it.  And checkboxes that I have to check.  It's hard to without picking the whole machine up and holding it against my face.And then there's my second gripe which is a major one.  The track pad on this thing is poor.  It's not bad, it's just poor.  First of all, it's centered on the machine and not the spacebar ... like the rest of the 7584 laptops that are for sale.  So, because I'm adept with a track pad and a creature of habit, my fingers drift to the left on it.  Once your rub up again the left border, Windows gestures kick in and I'm automatically bumped into the last app/program I was running.  This has only happened a few times, but it's the shear ham-headedness in design that leaves you scratching your head asking, out loud, \"Why did they do it this way?\"The other aspect of the track pad is its KY-equivalent slickness.  This thing is probably the smoothest material ever made - probably space shuttle bearing material.  It's a problem because even though you may not be aware of it, you're getting just a hint of feedback from the tips of your fingers from a trackpad.  You can feel the surface moving under your fingertip.Not with this one.On the few occasions I've lost sight of the tiny mouse pointer on a busy screen, you get the weirdest sensation - as if the machine \"hung.\"  (and trust me, it won't.  it's way to fast for that).  It's just a weird feeling when you can't see the pointer and you can feel the track pad.So I gave it a 4/5.  Battery life is great.  I haven't done any 12,000 line vlookups yet, but i'm sure it will blow through that like a wood chipper.  My review keys harshly on the flaws, but it's only because I can't understand why they incorporated them into such a wonderful machine.Enjoy.  Always.", "Date": "January 31, 2014"}, {"Title": "Severely flawed product launch", "Author": "alltheusernamesaretaken", "ReviewID": "R2MNMLTPARRHBZ", "Overall": "3.0", "Content": "Update: Wifi issue appears to be fixed. Potential fix for yellow issue should arrive around 11/18/13 or so, but unsure how effective it is. See this link: [...]I bought this directly from Lenovo.First the good:* Great value for the specs, beating out Acer, Asus, Dell, Samsung, and Microsoft* Amazingly high-res screen* Versatile modes (laptop/tablet/etc)* Good keyboard* Blazing fast* Great touchpad* Light, thin, svelte and seemingly well-built* Great backlight on the displayThen the bad:* HiDPI support in Win 8.1 is improved but still not good enough. The Adobe Suite is completely unusable because everything is too small. Dropbox's sync status is unreadable due to its size. Chrome 30's touchscreen support is broken (though fixed in the next beta). Random application installers will be stretched out and graphically corrupted and unusable.* No ethernet port, only one USB 3.0 port (the other is USB2)* Mediocre battery life (6 to 7 hours)* Lenovo support website hasn't caught up to this product yet so preloaded software and drivers aren't available for redownload. If you uninstall something or want to reinstall Windows, you're SOL.* Some of the preloaded apps don't work. The voice dictation thing doesn't update right and crashes when you try to use it. Several of the other prebundled junk apps also crash on loading. Because there are no updates on the Lenovo website, no way to fix it. Not a big deal though because those apps were just fluff to begin with. If you want speech recognition, Windows 8 already has it built-in.And the terrible:* Can't display the color yellow (looks more like mustard green). This affects every Y2P sold. See the 63 pages(!) of complaints on their forums: [...]* Wireless drops affecting some units. See: [...]* Uncommunicative company unable to provide an answer or ETAI'm returning my unit in a few days because this is too much money to spend on an beautiful ultrabook that can't do something as basic as colors and wireless. That's probably why they were selling it for $200-$300 less than their competitors -- they most likely knew about these issues and wanted to dump these flawed units on early adopters (just my theory, but why else would a premium ultrabook be discounted on its first few weeks of sales?).", "Date": "November 3, 2013"}, {"Title": "A Great, Flawed Computer", "Author": "Forest Finch", "ReviewID": "R14NWHHTWLWFJ0", "Overall": "3.0", "Content": "I'll make this short because I dont have to repeat what everyone else has said... This computer is very thin and light, fast and versatile, and I WOULD love it for all these reasons except for some serious flaws it has. In order of severity:1. There are major issues with the wireless card (long threads can be found on it in the Lenovo forums). What that means for me is that at least once a day the computer will simply stop connecting to the wireless network. The only fix is to reboot the computer - extremely annoying and troubling.2. There arent enough windows programs on the market right now that are made for touch, or very high resolution screens. The Windows app store has an abysmal selection that can be likened to what the Palm Pilot app store had back in 2004. Granted, this issue will be fixed in due time but for now don't expect to be able to use many programs well with your fingers. That being said - the Bing apps are great (albeit kind of gimmicky) !! They give me hope for future software. One thing that confused me is that there are TWO versions of internet explorer, one for touch and one traditional one for mouse + keyboard. In order to use the touch version, you must have Internet Explorer set as your default browser. Kind of a selfish move on Microsoft's part; they know that IE touch is the only one of its kind on the market right now. It's actually pretty darn good but still too glitchy to be called great.3. The speakers are pretty quiet, it's actually kind of a problem sometimes. I compared them to my friends Macbook Pro Retina 13'' and the Mac's blew the Yoga's speakers out of the water in terms of volume. Quality of the sound on the Yoga is pretty good.4. Battery life is meh... I havent timed it but dont expect anywhere near a full day of use on a single charge if you're browsing multimedia content. Apple again here blows Lenovo out of the water on their comparable devices.All in all I really do want to love this computer, it's awesome. I can deal with all the issues I've mentioned except for the wireless one, which is truly a big problem and is unacceptable in my mind. I'm hoping  they will be able to fix it with a driver/software update.", "Date": "January 21, 2014"}, {"Title": "Please do more research before you purchase", "Author": "berthan", "ReviewID": "R3P814UNQ5AQZK", "Overall": "1.0", "Content": "I bought this item after reading some great reviews here. But I am disappointed with this item and looking straight into replacing it after just 2 months of use.I was using Windows notebooks for most of my computing life till 2 years back when I need a light weight notebook of 2.5 Kg or below, minimum of 16GB and a Quad-core i7 notebook (I do development works and my works are mostly out of country). I ended up with Macbook pro (retina) and that is the only machine at that time that met this requirement (shame on Wintel). Fast forward now and I am looking for a same high computing power, touch screen, lighter notebook cum tablet running Win8.1. I ended up with this item after all the great reviews here and elsewhere.At the point of purchase, I accepted the following facts:1. It is only be 8GB,2. It has the yellow display problem,but:1. It is light weight2. It is flexible and able to twist into a tablet3. It is touch screen4. Reasonably price (ps. not low price)However, after just two months of usage. I reverted back to Macbook Pro for most of my usage because this item has too many design faults because Lenovo is using mostly low quality components beyond the aspect of looks.Let me highlight bellow and I these are unlikely to be a one-off problem that you might think.1. Distorted yellow colour display problem remain unresolved with the latest BIOS upgrade - Yes, despite claims from some websites, the problem is here. See it for yourself, just run MS Paint program and look at the yellow in the colour menu and compare it with the next unit in the showroom and you will know what I meant. Gee.. why give you a 3200 x 1800 ultra high resolution when you cannot even display basic colour correctly?2. Only 1 mini-HDMI (faulty) display - my job required frequent presentation. The mini-HDMI port design so poorly that most mini-HDMI cables cannot have a good contact to receive signal. 90% of the time, you are unable to display unless you make some cuttings to the cable and risk damaging them and still not working, I brought 3 cables and followed the instructions most other owners suggested and managed to get one cable to work. And this is after I stacked some objects below the connecting part to cause the connector to tilt upward (It is too complex to explain here without a diagram here but you can surely do a search on the Internet, especially the Lenovo owner forum,  to understand what I mean)3. To mitigate the above, I thought of a “wise” idea to overcome this shortcoming - Invest in a wireless display (Widi) since this unit supposed to support Widi. Widi allow you to connect to a projector remotely via a USB port and that perhaps can solve my problem.  I bought a Netgear PTV3000 Wireless Display Adapter. This adapter works with every of my WIDI compatible devices except Yoga 2 pro. Once again, after searching in the forum, I realise this is a design issue4. Wifi - After wasted many days of testing, I realised that this unit cannot run the dual-band WIFI 802.11n network. it will only accept the 2.4GHz band but not the faster 5GHz band and this was again confirmed by many other owners. Goodness me, when the new Macbook Air release much earlier, it uses the latest 802.11ac and my 4 years old ASUS notebook support dual-band without any problem. Beside this, moving further away from the router, my 1.5 years-old Samsung S4 connected on the same 2.4G wifi router running about 3 times faster that this notebook; I was speechless.So, my experience with this unit has been that the more you use it, the more problems you will uncover, and probably to the extent that you will end up putting it a side as a white-elephant or for my case, using it to play some youtube videos which can be done using my home TV set too.", "Date": "May 1, 2014"}, {"Title": "WEAK SUPPORT CAUSED DOWNGRADED REVIEW--GREAT IDEA THAT WAS DELIVERED WITH PROBLEMS", "Author": "CR", "ReviewID": "R1C243A8SKPQPQ", "Overall": "1.0", "Content": "UPDATE: LENOVO SUPPORT IS WEAK AND WANTS TO CHARGE A FEE TO FIX A PROBLEM THAT EXISTED IN THE NEW COMPUTER, RIGHT OUT OF THE BOX.  FOR DETAILS, SEE UPDATE AT END.The Yoga 2 Pro (Y2P) has a terrific form factor.  It is a thin, lightweight tablet/laptop hybrid with an ample-sized, backlit keyboard.  Audio in laptops has never been great, but in this case, the Y2P audio is slightly better than what I've heard before.  The screen has amazing resolution.  There are many ads and videos that talk about and demonstrate numerous great features of the Yoga 2 Pro, so I won't go into further detail about those here.  What those ads and videos may not reveal is what's not working as it should.  So the problems I've had with my brand new Y2P are listed below in no particular order.1) YELLOW.  THE BIOS AND LENOVO ENERGY MANAGER UPDATES DID NOT FIX THIS IN MY Y2P.  The Y2P does not accurately produce the color yellow.  Yellow is either mustard or yellowish-green.  I bought my Y2P based on having read multiple published announcements that said the yellow issue had been fixed.  DON'T BELIEVE IT.  Some users in online forums have said the fix partially improved the problem and others have said it did not.  Meanwhile, the \"fix\" drains energy efficiency by keeping the screen at its brightest, so after the fix, one should not expect to get nearly the battery life touted.2) SLEEP.  Computer would not wake up from sleep.  After spending almost an entire day troubleshooting and talking with three different support people at Lenovo, the third person recommended turning off a setting which finally appears to have fixed the problem.3) WIFI.  Y2P drops WIFI signal frequently.  Another Ultrabook I tested with the same WIFI card also dropped frequently.  Meanwhile, a $400 Lenovo with a different WIFI card almost never drops.  I have verified that the problem is not with the network equipment and have seen other users complain about this problem online.4) DISPLAY.  While the display produces awesome resolution, some screens or parts of screens load with super-tiny print and images--too tiny to be able to read or to select options (because option boxes are too tiny).  Unfortunately, I have read that software developers haven't caught up with this kind of display.  The options to make displayed items larger (large icons, increased font size, CTRL + (plus key), etc.) don't increase the size of everything.  So some things will just be micro-tiny no matter what.  Also, all these attempts to increase the size of items on the screen at times results in some gawky screens due to larger fonts and icons mixed with disproportionately smaller ones.  Other users have complained about this in online forums.5) BATTERY AND ENERGY EFFICIENCY.  With various fixes in place, energy efficiency and battery life won't be as advertised.  I might get 3-4 hours out of my brand new computer battery without a charge if I am conservative.  In addition to the \"fix\" discussed in number one above, the computer also has an auto-brightness feature, which I assume was intended to save energy, but which causes the screen to constantly get brighter, then dimmer--causing it to flicker--so that feature must also be turned off.Before I decide if I will return it or not, I am going to contact Lenovo one last time.  I like the computer and think that without these problems, it would be an awesome computer.  I tested and returned another Ultrabook before this because it also had many problems.  If you buy any Ultrabook at this time, just know that you may have to spend a chunk of time troubleshooting and fixing your brand new computer--something that never happened to me until I got an Ultrabook.UPDATE: Out of the first five calls, I have three times gotten connected with support reps not sufficiently knowledgeable about the issue.  (And the sixth callee wouldn't help without a fee.)  They seemed to be reading from a script and frequently simply wanted to reset the computer back to factory settings.  After this is done, one must re-enter settings, re-install software and re-load data.  I did the reset one time, but not after that.  It turns out the reset was not the fix.  For item four, I was told to report this to \"Software Support\"--a separate call.  Software support--in  problem call number 6--reviewed the matter and said that to solve the problem, I'd first have to buy an extended warranty or pay a one-time $59 fee for them to fix it.  Keep in mind that in addition to this being a new computer delivered in this condition, the first 3 out of 5 Lenovo calls I made didn't solve other issues.  The tech sounded like a trainee (had someone else helping him) and said they knew what the problem was and that I needed to change a font setting, but would not tell me what the setting was without paying a fee.  As many other users have complained about this same issue, I wasn't certain he really knew if the answer or not.  A retail computer tech looked at it and thought it was a bug.  Lenovo claimed it was a setting that needs to be changed, but wouldn't tell me what it was.  The fact that it came this way and they want a user to pay to fix it seems dishonest.", "Date": "February 15, 2014"}, {"Title": "The most frustrating laptop I have ever bought.", "Author": "BHB", "ReviewID": "R316E1Z9A400X3", "Overall": "1.0", "Content": "The WiFi does not work or at best is constantly dropping connection. Lenovo has done nothing to fix this problem and there are 98 pages on the Lenovo forums of people complaining about this problem going back months.Do not buy this laptop if you need to connect to the internet. To be honest I will no longer be looking at Lenovo computers after this purchase and customer service experience.", "Date": "May 16, 2014"}, {"Title": "Best bang for the buck. Excellent Ultrabook with some wifi problems", "Author": "intellectually_stupid \"iisgenius\"", "ReviewID": "R3SQ537PA3I8UP", "Overall": "5.0", "Content": "Pros:Slim and lightDoesn't get hot even from watching movies for several hoursMovies look really sharp and crispVery fastBack lit keyboard is well litKeyboard has a nice feel to itVivid colorsLong Battery lifeFlexibleCons: Wireless connection keeps dropping but there is a fix!Let me first just say that I am not a techie. I have not used this for heavy gaming or several apps. I purchased this to watch movies and some light word and excel work, and for picture editing.When I first got this laptop, the wifi connection was either slow or kept dropping. It was very frustrate. Luckily, I downloaded the wireless update on the Lenovo website and it runs perfectly now.The picture quality is just awesome especially when watching HD movies - even SD movies look sharp. System start up is lightning fast (3 to 5 seconds). I sometimes have 7 windows open without experiencing hiccups. The battery life is awesome. I can watch 3 movies (90 to 100 minutes each) without having to plug in the power adapter (I keep it plug most of the time to save battery life).Working in word and excel, with couple of windows open, is no problem - there is no lag whatsoever.The form factor is amazing.  It's one of a king but the new DELL XPS have the same form factor. It feels sturdy enough but I don't want to put it on a test - this machine is too expensive for such test, lol.Oh, it also doesn't get hot on prolong use - 92 degrees is the warmest. I was also thinking of getting the new DELL XPS 11 instead but there are no reviews yet but I think this is a keeper. I have the orange one and it looks really cool.Again, I am not a techie so this review is based only on my own user experience. Overall, I love this ultra book and I highly recommend it. Just make sure you download the Wi-Fi update on the Lenovo website.", "Date": "November 25, 2013"}, {"Title": "Great ultrabook for office / home use", "Author": "SATiger \"Electronic Guy\"", "ReviewID": "R2WZRT8QGQVP48", "Overall": "5.0", "Content": "One of the early purchaser at BB and have been using it more than 5 weeks now. I really like its performance, light weight and touch screen. Primary usage is for business and could able to easily connect to VPN. The screen is amazing and love it. I average about 5.5 hours with regular office work.", "Date": "November 19, 2013"}, {"Title": "poor wifi", "Author": "<", "ReviewID": "R3CIGG0720FV4", "Overall": "1.0", "Content": "This laptop's biggest problem is poor WiFi reception. At a place where a MacBook Pro can sustain stable video playback, the Yoga 2 stutters and freezes constantly. The drivers are latest from Windows Updates, and Lenovo's site is horrible at finding what you want. Screen is nice though.", "Date": "May 11, 2014"}, {"Title": "Yoga 2 Pro \"Multimodes\" were a pleasant surprise", "Author": "BrothaTech", "ReviewID": "R3EMCU0OYMFEG1", "Overall": "4.0", "Content": "I must admit, when the first Yoga Ultrabook was released, I really thought the different \"modes\" were a gimmick. When I got my hands on the Yoga 2 Pro, I was surprised how useful the modes were.Before I dive into the multimode usefulness, here is my basic overview of the Ultrabook in general.Design:The look and feel of the Yoga 2 Pro is low-key overall...Which is a good thing. It doesn't scream \"look at me\" but it has enough style to get people to ask you about it if you're working in public. What I like the most about the design is that it doesn't try to emulate the design of the MacBook Air, unlike so many other Ultrabooks after the Air. The Yoga 2 Pro stays away from the aluminum shell and opts for a gray (or orange) shell cover, and an all black for the lower-body, touchpad, and keyboard look. The back-lit keys also add a nice visual in low-light situations.This was my first time using an Ultrabook (previous laptop was a \"thick\" MacBook Pro), so I was taken aback at how slim and svelte the Yoga 2 Pro was. This alone cause me to grab it before I left the house more often than my MacBook. On the flip side, the trade-off with a super-slim laptop is space, specifically storage.  So it’s my strong suggestion that if you’re in the market for an Ultrabook like the Yoga 3 Pro, you might want to pony up for an external Hard Drive, just in case.Functionality:I've used smartphones and tablets with touchscreen capabilities for quite some time. This was my first time using a touchscreen laptop. So I must admit that I couldn't decide between using the on-screen touch capabilities, or the touch pad like your typical laptop. As a result, actions that normally took a millisecond, took longer because I was repeatedly trying to figure out the “best” way to complete a task – touch the screen or use the pad. Once I got used to doing things “my way” as far as input methodologies are concerned, my productivity was back to normal.Additionally, the screen held up to my fingers jabbing at it all day. I assumed the hinges would buckle to my \"gorilla arms\" and I would have to keep readjusting the screen after pushing it backwards with my fingers...Not the case, the hinges held up like a champ.I really like typing on the keyboard, the keys have the just the right amount of texture, and the back-lit keys came in handy on many occasions. The only issue I had with the keyboard was the location of the up/down arrow keys. They are positioned in a more natural location, but the left shift key was shortened to make way for the arrow keys. As a result, my right pinky-finger kept touching the up arrow instead of the shift key.Another issue I have is with the touch pad. I may be a little biased as a long time Mac user, but in my opinion, Apple simply “nailed it” with how you use a track pad while Microsoft is playing catch up. For example, there aren’t too many option. to customize touch pad operation. I couldn’t invert the scrolling, I couldn’t select different “gestures” and other creature-comfort options I took for granted using my MacBook.The display on the Yoga 2 Pro is beautiful. The 3200×1800 display made the 13.1-inch screen look like a 15-inch display. The resolution was so good that I had to increase the zoom on most web pages and applications just to see all the vivid content. I was equally surprised at the quality of the built-in 720p web cam. I joined a video call during the first couple weeks of usage, and while I fully expected to use my own external HD web cam, I quickly nixed that idea and just stuck with the built-in version.Multi-modes:Lenovo wants you to get sold on the idea that this is more than a laptop. In my opinion, they did a good job. In addition to the traditional \"laptop mode\" my favorite is the \"Stand\" mode because it provided the most flexibility for just about all other operations that didn't require typing on a physical keyboard.My kids (ages 6 and 3) enjoyed \"Tent\" mode the most. It's similar in functionality to \"Stand\" mode with the exception of utilizing the rubberized edges surrounding the screen and lower-body as \"stoppers\" to keep the device in place when being used on a hard surface like a tabletop. My kids have even stronger gorilla arms than I do, so tent mode came in handy when they wanted to watch a movie and needed to navigate the touch screen.The mode I used the least was \"Tablet\" mode. At 13.1 inches, holding the Yoga 2 Pro in tablet mode to read a book, magazine, or long-form web article proved to take its toll on my arms during extended use. My kids on the other hand, liked using Tablet mode to draw pictures or play games when placed on a flat surface. At 13 inches, there was a ton of real estate for them to work with.As a MacBook user, I really enjoy using the Lenovo Yoga 2 Pro regularly. It has its quirks (still not sold on the touch pad), but I won't have any problem integrating it into my regular routine.", "Date": "February 17, 2014"}, {"Title": "Better than expected, but the offset trackpad hurts productivity", "Author": "Roger Huston", "ReviewID": "R34HQX1DCBC84H", "Overall": "4.0", "Content": "I bought the Yoga 2 for my wife and my sister. It was the first ultra book available that had a Ultra HD display, i7 Haswell, larger SSD capability, etc. Competitors did not have the high end version of their product available in the US when I got the first one.First of all, let me state that I was a bit dubious of the different modes, but in practice they are all useful.Stand Mode - Bend the keyboard around and screen comes forward - perfect for watching a movie on a plane where you want the screen closer than a normal laptop can offer. For those of you that fly a lot, you know what I mean.Tent mode - at first I didn't see the difference between this and stand mode - but this mode is perfect for a kitchen, where you want to keep as much of the laptop off the surface as possible. even if a little water spills, your laptop is safe.Tablet mode - Perfect for touch interface apps. I was a desktop guy, I thought modern interface is fine for a phone or a small tablet, but not a work device. Then I used the built in mail app vs outlook. In tablet mode, sorting, moving, deleting, categorizing email is blazing fast with just your thumbs.I finally get what Win8 is all about. It took me a while and win 8.1, but I get it. When you have the mail app open and you click a link or a doc and the mail app moves to half screen and your browser or word opens up on the other half - it is sweet. Everything auto adjusts for you. The mail app is not smushed down half screen, it changes its interface around to display well at half or even a quarter screen. No more having to move apps around on the screen to make them fit or see them overlapping. What I realized at this moment was the amount of time I waste just moving stuff around on the screen so I can see it. Win8 looks to make that easier.Anyone worried about construction or durability - don't be. The machine is solid and that hinge will outlive the laptop.Big Con:The notebook is near perfect for me except for one glaring issue. For some reason on the Yoga the touch pad is centered on the machine NOT the keyboard. For touch typists this means that your right palm has to rest on the touch pad in order for you to type which causes lots of other problems. Look at the Thinkpad X1 Carbon and most of the other notebooks and the touchpad is centered to the spacebar. This makes it typing and mousing much easier as you can keep your palms off the trackpad.I don't know why the Yoga team chose not to pay attention to lessons elsewhere in the company - \"Left hand, I'd like to introduce you to Right Hand\" - but for me the trackpad offset really inhibits productivity. Expect to be turning on and off the pad with regularity if you need to use laptop for any real typing work.", "Date": "January 14, 2014"}, {"Title": "If you had a Yoga and want to upgrade, everything is a plus EXCEPT 1!", "Author": "Farshad", "ReviewID": "R3IZ2E53FSOAZT", "Overall": "4.0", "Content": "This is an upgrade from the previous Yoga in every way that I can imagine.  Two USB 3.0 slots, thinner, lighter, more solid, love the way it feels, the buttons are in better places (especially the power button), it feels better (better design), and it doesn't forget to rotate back in Windows 8.1 (I have to turn on and off rotation using the button on my old Yoga to get the screen to turn right side up during boot).The ONE issue I have with it, which is a fairly annoying one, the darn SD card slot is not deep enough to hold a card!!!  What the heck Lenovo??  Why would you do this??  People want to LEAVE their card in the laptop to become another drive (I have a 64gb card that I had in my old Yoga, but can't use it in the new).The be clear, the card reader is basically half as deep as the card, so you insert the card, and it reads/writes to it, but half the card will stick out.  In the previous Yoga, you could permanently leave your SD card in there.", "Date": "December 28, 2013"}, {"Title": "Great laptop. Don't buy it here.", "Author": "Mau", "ReviewID": "R38LJI0IA9PTHR", "Overall": "5.0", "Content": "Hi,I'll make this one short since I just want to send a couple of points across.1. The laptop is amazing! I use the laptop for heavy work, casual gaming, and media consumption. It is amazing for all three activities. It has about 6 hours of battery life with regular use. It runs smoothly in each mode (tablet, stand, and laptop). When in tablet mode, I personally find it a little heavy but comfortable. Some people complain about the exposed keyboard, but the keys are designed in such a way that this hasn't been a problem for me. Windows 8.1 takes a little getting used to but once you do it actually becomes pleasant.2. At the moment of this review this same model can be found in Lenovo's website for $1,299 and in Best Buy for $1,199. I don't know why Amazon allows sellers to sell at such a high mark-up a product you can easily find elsewhere.3. As for the two issues that most people report, mustard instead of yellow in the screen and a defective Wi-Fi, Lenovo released a BIOS update and a WiFi driver update that address these issues.Thanks!UPDATE: I have been using this laptop for about a month now.", "Date": "November 28, 2013"}, {"Title": "Bogus stats", "Author": "Albert F. Spohn", "ReviewID": "R2316OV8BNEAMG", "Overall": "4.0", "Content": "Why do the stats above say the computer is 7 pounds?  It's barely over 3!  That's gotta be a deal breaker for many potential buyers, particularly in this market.", "Date": "January 17, 2014"}, {"Title": "Disappointing.", "Author": "Jonathan", "ReviewID": "R1LA6F7F66LYRO", "Overall": "1.0", "Content": "By now, word of the Y2P's yellow color issues are exposed. There is a \"fix\" that is not really a fix but an adjustment that alters your entire color scheme and drains your battery. Many people (maybe half?) are also reporting the \"fix\" does not fix the problem and even causes more problems in other areas like wifi connectivity. It's sad that this defective product is still being sold with no warning given. Most people will not be aware of this products issues until past the return period with no fix available.", "Date": "April 12, 2014"}, {"Title": "Yoga 2 Pro blems, research before you buy!", "Author": "R Donnell", "ReviewID": "R3J1Y8ERMI4XDW", "Overall": "1.0", "Content": "I bought this high end machine so I wouldn't have issues and I've had nothing but problems, and I'm not alone!  WiFi, audio, bluetooth, both software and hardware issues about a month after purchase this year.Research the Lenovo forum for the various problems, from customers worldwide.Like the people who reviewed these machines, take from the box, and fire it up and it looks/feels great but use it for a while and the design flaws start to appear.  Start interfacing it with your personal devices (WiFi, bluetooth, audio...) and after a while the WiFi drops, Wifi speed test less than 1Mbps while another old 300USD machine is over 6Mbps.  These problems come and go, so you have it working fine and then the machine starts to play up.Research before you buy!", "Date": "June 4, 2014"}, {"Title": "beautiful machine, absurdly light, amazing screen", "Author": "M. O.", "ReviewID": "R2VPPQVWNCMD0X", "Overall": "4.0", "Content": "I love taking this to work and back because it's so light. Even with the small screen size, the huge resolution makes it easy to do side-by-side windows.A few small issues:Very non-standard power adapterBattery life is mehThe only big issue is with the screen. When I'm on webex the resolution doesn't translate well so I have to scale down to a \"normal\" resolution. Unfortunately not everything scales well. IE, for example, ends up with a tool bar at the top that's like an inch tall. All office applications fail here too. I need to hide toolbars to show anything. Not sure if this is Lenovos problem, Microsoft windows issue, or microsoft IE/Office issue, but it's really annoying.Makes me think I should have gone with a Macbook Pro with Retina display instead.", "Date": "January 4, 2014"}, {"Title": "poor reliability and customer service", "Author": "poweruser", "ReviewID": "R2T9VD6UEIVABQ", "Overall": "1.0", "Content": "Was a very happy user until a month ago when the speaker is not working. Checking online forum and found this is a common problem with defect headphone sensor. Sent my in for RMA three weeks ago and still waiting for them to repair. Lenovo claimed they are out of parts. Request for update several times and had not receive any response. I will tell everyone not to buy from Lenovo.", "Date": "January 26, 2014"}, {"Title": "Best Windows portable so far", "Author": "BlogKindle.com", "ReviewID": "RFBEG37GK2A8Q", "Overall": "5.0", "Content": "Best portable Windows machine ever!Had the first generation Yoga for a year and loved it apart from initial WiFi problems (that were somehow addressed (possibly with a driver update)) and lack of backlit keyboard.Personally I consider 13\" to be the perfect portable form factor - large enough to do actual work (including writing code) but not too large to be a nuisance. Touchscreen is handy in all configurations. While the device is too large and heavy to be a real tablet, tablet mode still comes in handy sometimes.Yoga 2 Pro fixed issues with the first gen device - WiFi works great, there is a backlit keyboard. On top of that you get 6 hour battery life (twice tested in long haul flights) and excellent almost 4K display. I really couldn't think of anything I would have liked to add to it.", "Date": "November 14, 2013"}, {"Title": "its good", "Author": "nikolaos chatzidakis", "ReviewID": "R30IKTJFSHBBJ9", "Overall": "5.0", "Content": "no issues yet (1 month ownership now ) so wait for more.. maybe a little 'mirrory' the screen but thats what you get for having touch screen", "Date": "May 12, 2014"}, {"Title": "You'll flip over it!", "Author": "Makobi Scribe", "ReviewID": "RO81643F9AAE5", "Overall": "5.0", "Content": "If you have not seen the Lenovo Yoga Pro 2 in action, you are in for a huge treat. When I say you will flip over it, I am not kidding! It is flexible, thin, lightweight and sassy, comes in Grey or Clementine Orange and will change what you think about computers.I could not believe how super easy it was to go from one mode to the other.I love knowing I have 9 hours of battery life with the Yoga Pro 2. Now when I travel, I am not running around the airport or convention center trying to find an outlet every few hours. A feature I thought was really cool is the Phone Companion, which allows the user to copy text from documents or websites/pages and send it to their phones as a text message. Now if I am online and see something cool I want to share, it is easy to do with the Phone Companion. When in Tablet mode, you can edit or retouch photos with the touch of your fingers on the 10-point multi-touch screen. I edit a lot of pictures, so if I have the ability to do it via touch screen, that makes my life so much easier.", "Date": "April 9, 2014"}, {"Title": "Good ultrabook hybrid, AMAZING if you can get it for $1200!", "Author": "geogeo", "ReviewID": "R2UZA2YTMWJ3NM", "Overall": "4.0", "Content": "Bought mine at Bestbuy for $1198. Had to keep looking for weeks till they had that offer back on.I usually buy a new laptop every 2 years. my old Toshiba I5 (2. generation) was now 3 years old as I was looking for a new ultrabook but could not find anything I liked in the price range up to $1500.This ultrabook sounds amazing on paper. 8GB ram, i7 (4 generation) , 256 GB SSD, amazing video capabilities, touch screen!but when I use it next to my old one (i5, 8 GB RAM, 180GB SSD, win 7 ultima) I don’t  see a huge difference. In the contrary, some things slow down after 2-3 days without a restart. (is this win 8.1?)Interesting things:I have 2 x Dell 24 inch monitors connected, one through the micro HDMI and 1 through a USB3 to HDMI video card.  The USB 3 is amazing!. If needed I can have an external HDD, a printer and the video card all on the same USB and everything is still working fast enough.If I have any video problems they will be with the micro HDMI, which will not initialize, I will have to put the laptop to sleep mode and then try again, usually it will work after that.if the laptop goes to sleep it will leave the monitor that is connected through the USB3 on, it will not go to sleep mode automatically.Battery is not removable, which is sad if you have the laptop on power all the time except when you travel like I do. on my old Toshiba I would just remove the battery so I don't have the yo-yo effect.Touch screen is fun, not usable for serious work though.Sound is very good, very surprised by it.Camera is great! 720p!Keyboard is great, love it.Size is also great. Feels and looks very solid.all in all, you can't find a better laptop for that money at the moment. For alternatives you must spend at least 50% more.", "Date": "January 4, 2014"}, {"Title": "Best Laptop Ever", "Author": "Y. Chen \"cincyxman\"", "ReviewID": "R2A4QZR6RPT6E2", "Overall": "5.0", "Content": "I have changed my Laptop every year. This is by far the best laptop you can ever get in the market. The screen resolution is awesome with 3200 x 1800 pixels. That has made the screen resolution even better than my desktop LED monitor. I was worrying that I may not be able to read tiny characters before I purchase it (from Best Buy), but it turn out there is no problem at all to see the screen.The best value on the lap top is the 360 degree rotation for the screen. I like to use regular size key board a lot and I can place the lap top in a V shape position to make it like a real desktop machine (if I need it). The regular laptop will make you having 2 key boards in front of the screen which make it feel awkward. Also, I can play movies on dinner table without taking too much space on the table. The tablet function is huge advantage. I can use it as tablet when browsing internet and turn it into working PC whenever I want.The keyboard has back led that make it easy to work at dark. The machine is also pretty light and very portable. Anyway, you can find any better ultra book in the market.", "Date": "December 15, 2013"}, {"Title": "Great screen, great performance at a good price", "Author": "mattlezeay", "ReviewID": "R1BH4UVX8VNB41", "Overall": "5.0", "Content": "The screen is great. I'll admit, I bought it because I valued pixels over many other items. But that also means I knew what I was getting myself into, not all the applications work perfectly, some have tiny fonts. For the price, this was a great buy,i7 with 8 GB of RAM and a 256GB SSD, that usually fetches a few hundred dollars more.Pros:- fast processor- plenty of RAM- very thin and light but build feels solid- screen resolution is just amazing- touch screen works really well- price for what you getCons:- Windows 8.1, I fixed that with putting linux on it, works great by the way- The bios needed and update to get some things working properly (standby, colors of the screen, etc.) and it acted like it was bricked after it, I had to play with it for 15 minutes to get it to come back from the dead.- Watch where you hold it when you \"convert\" it, I've already been bitten once in the week I've had it.- touchpad will stick down if you click it while holding it by a corner, I'm nitpicking but trying to be honest, just shows that there is a little more flex in the body than I would prefer- webcam quality isn't on par with other laptops in this price range, but it worksOverall, I would recommend this laptop to anyone looking for pixels at a good price. And it takes linux nicely too which is huge plus for me.", "Date": "December 6, 2013"}, {"Title": "Solid, good value, but not necessarily the best choice.", "Author": "D. Alexander", "ReviewID": "R1UAUAVWBZ72DY", "Overall": "4.0", "Content": "I was considering this system as a Photoshop machine. It's an excellent value, but I wasn't convinced of the utility of the screen for this purpose.BUILD:Build quality is upper middle-class. The chassis is as stiff as plastic and composites can be, but doesn't have the solidity or premium feel of any of the aluminum laptops. There's some hinge-play. A number of pure ultrabooks (particularly from Asus, Samsung, and HP) feel more expensive.The protruding keyboard didn't bother me in tablet mode, though I did prefer Sony's superior hinge with their (rather heavy) Flip series. All of these multiple-use systems feel leviathan compared to a real tablet. People complain that the 1.3 lb 4th-gen iPad was too heavy; this system is two pounds heavier. Still, the 'Metro' side of Windows 8 doesn't really come into its own until the screen is your primary interface, and it's easier here than stretching over a keyboard.SCREEN:I'm back and forth on this. There are two major 'Retina'-class panels available for 13.3\" laptops: 2560x1440 RGB and 3200x1800 RGBW 'Pentile'. The first is used by Toshiba's Kirabook and the HP Spectre 13t. Apple's Macbook Pro 13 has a 2560x1600 variant (16:10 aspect ratio). This Y2P and Samung's Book 9 use the latter.Pentile displays have a grainy look at lower pixel densities. Hard edges look slightly blurred; actual resolution is maybe 2/3 of an equivalent pixel density in RGB. If the pixel density is very high (over 400 PPI), you won't see the grain and the difference disappears.That's not quite the case with this Yoga. Here's what it looks like up close:img.gawkerassets.com/img/197gl7k0r421ajpg/original.jpgLook at the left edge of the Windows Explorer icon. That jagginess is visible, but subtle, at normal viewing distances. Bring it a little closer for tablet mode and it's more apparent. This is still a great screen, but if you're used to how, for example, USM sharpening in Photoshop is supposed to look, the differences will throw you.Color saturation of the demo model I played with was poor, particularly in the yellows. This was fixed with a BIOS update you'll probably need to apply. After that, it'll cover perhaps 3/4 of sRGB gamut. It's debatable whether that's adequate for professional use.Scaling is a problem. Most of the Windows UI is fine. Office is hit or miss. Third-party apps are all over the place. You'll often encounter dialog boxes with buttons or text hidden. MacBooks do better here, but with more stress on the graphics unit. That aside, Windows 8 doesn't feel quite ready for amalgam machines like this one. The switch from 'modern UI' to the standard desktop is jarring and often necessary.For those reasons, I'm not convinced this panel adds much over a standard 1080p RGB IPS LCD. At a 13\" screen size, 1080p is already quite sharp, doesn't cause scaling problems, and tends to offer better brightness for the same power use. This Y2P has only 4-6 hours of battery life.MY TAKE:I like touchscreens. They definitely improve Windows 8. Tapping and scrolling through web pages is nice and you can do a lot of simple productivity work entirely in Metro. The multitasking UI is way ahead of Apple's tablets. Still, the Y2P is ungainly as a tablet and I got the sense I'd only use it as an Ultrabook.A few 'Retina-class' alternatives:Macbook Pro Retina 13- Touchscreen- Flip-hinge- Weight- Cost ($1500)+ MacOS+ Trackpad+ Aluminum+ DepreciationHP Spectre 13t- Flip-hinge- Weight+ Trackpad+ Aluminum+ Price ($1150)ASUS UX301LA- Flip-hinge- Price ($1800)+ Aluminum+ WeightAt this moment, I think the HP is the best non-transforming Retina-class Ultrabook value today, but I'd take a hard look at 1080p ultrabooks like the Asus UX302LA and UX31LA before committing to any of the higher-res options. After trying out every Windows machine, I ultimately settled on the Macbook and I haven't regretted it. Gesture support is a big deal in mobile machines. While the touch side of Windows 8 is very capable, in day to day use, no Windows machine is quite as nice to use in conventional mode.", "Date": "December 1, 2013"}, {"Title": "I love my Y2P!!", "Author": "O. M.", "ReviewID": "R29GW5SUM4VTX7", "Overall": "5.0", "Content": "By far this is the best Ultrabook out there and the best piece of innovation I have ever owned. Worked flawlessly out of the box with no issues. Love Windows 8.1 for all my desktop mode features and love utilizing the Start Tile screen when in tablet mode. A perfect 2-in-1 machine. SD card sticks out but not a deal breaker for me.The 3200x1800 display blows away any MacBook Retina. This machine is fast thanks to its SSD, super light and great quality build.P.S. People are fools to rate this poor on Amazon because of a price difference. Search online for deals and best prices! Not that difficult to do.", "Date": "November 30, 2013"}, {"Title": "Sweet little machine.", "Author": "Melanie", "ReviewID": "R1UH9YDQJ637UZ", "Overall": "5.0", "Content": "After a year of looking on at other people's Ultrabooks with envy, I finally picked up the Yoga 11s.  A week later I discovered the webcam was faulty and returned the item, lamenting the loss of the neat little machine and begging my thicker, heavier, but more powerful laptop (Lenovo Y400) to forgive me for straying.I then learned Lenovo would be releasing the Yoga 2 pro in about a month from my return date.  I believe computer karma was looking out for me as I was then a little glad I had returned the 11s.  The battery on the Yoga 2 is superior to the Yoga 11s.  I'm writing this review under power saver and rated for about 6 hours more at 95%.  I think about 6.5 to 7 hours of life under normal use (web, light applications) would be a fair rating for the battery.  Probably much more if you are in \"typewriter\" mode and have the web off.  Whether or not the screen is different from the 11s, the lines look sharper and crisper.  And the weight feels about the same despite the larger size.  I can easily slip this laptop into my bag (STM Hood)  with my larger Dell work laptop and not feel worried that the pcs will get damaged by being squished.The PC is also surprisingly (or not considering the specs) snappy for an ultrabook.  I've only had it for about a week, so I haven't put it through any paces.  But so far, I'm impressed.It would have been nice if an ethernet dongle for the usb port was included, but the wifi receiver has been consistent in the different environments I've tested.Time will tell how the computer holds up, but first impressions are that it is a very solid piece of equipment.  I'm pleased with the purchase and would recommend it to others.", "Date": "October 25, 2013"}, {"Title": "Idea Pad Yoga 2 kept dropping signal", "Author": "Mary E. LeRoy", "ReviewID": "R2JCMVT16032WT", "Overall": "1.0", "Content": "When I first received this unit, it kept dropping my wi-fi signal. The unit was kicking me off 4 - 5 times a day.  I ordered a new modem and it still kept dropping signal. I tried to return this unit but the supplier colddriver20 and Amazon would not take it back (Amazon's 14 day rule - I was advised there was suppose to be a 30 return policy) even though there was a problem with the computer, not the modem.  After 4 plus days working on this problem, I was advised by Lenovo that the 8.1 was not compatible with this unit's driver.  According to Lenovo, the installed driver was a 16.5.3.6 and it needs a 16.6.08.  If you want ANY customer service, consider purchasing this unit directly from the manufacturer.", "Date": "February 26, 2014"}, {"Title": "Exelletn Windows 8.1 touch netbook.", "Author": "Abused Commuter \"abused_commuter\"", "ReviewID": "R1HCG6JDBNOXPF", "Overall": "4.0", "Content": "Lenovo really nailed it with this tablet.The only reason this is not 5 stars is because of the display.  The resolution is fantastic, the touch response is perfect and it looks great.  Apparently \"pentile\" displays have an issue with rendering the color Yellow.  This is not directly Lenovo's fault and, to me, is not a dealbreaker at all - but to a color purist that needs accurate rendition it could be a problem.Otherwise this is a top-shelf tablet/notebook.  With 8GB ram and a 256 SSD and an i7 - it has power and speed.  The hinge is great and the four positions are very useful.", "Date": "June 7, 2014"}, {"Title": "Got it from Best Buy and it's GOOD.", "Author": "K. Wu", "ReviewID": "R1PMTH84GJ9ZE0", "Overall": "5.0", "Content": "The people who wrote the main reviews said it best, and I completely agree with them. I've used Macbooks/Macbook Airs from friends before, and I'll basically have to say that this is the Windows 8 version of the Macbook Air. Stunning display. Incredible smoothness. A keypad and a screen that seems to be made perfectly for Windows 8, since the dimensions align so perfectly (swiping down from the touchpad effectively closes an app, which sometimes doesn't happen on a larger touchpad).I haven't experienced any of the wifi problems listed yet, and I haven't ran into any of the hardware problems, either. I've only had this for a short period, though, so if anything comes up, I'll throw it up on here.Best Buy sells this for $1,200. I already had MS Office, so I guess that was a pretty big factor in my decision. But overall, I just feel that this is a great option if someone's looking for the build and quality of a Macbook Air, but the interface of Windows 8; Apple products might have an advantage in touchpad functions, but I feel that the touchscreen here more than makes up for that.", "Date": "June 2, 2014"}, {"Title": "best computer ever", "Author": "bob fox", "ReviewID": "R3MDSLB2LJ9P1V", "Overall": "5.0", "Content": "I have to write this review so you will know how wonderful this computer is. I am using it now, and am so grateful for it that I need to tell you about it.The speed is lightning fast.The screen is fantastic (high resolution and excellent color with no problems).The operating is easy to use (after quickly learning about Win 8.1, then the update to 8.1).The boot time (because of SSD that came with the Best Buy version of this computer) is 12 seconds.The battery life is about 7 hours.The size and weight is thin and light, but screen size is good, especially when traveling.Photoshop runs fast.The keyboard feels good.Wifi is good, and fast.I have used this computer for over five months. I love it; it is the best!", "Date": "May 17, 2014"}, {"Title": "Fine product", "Author": "Judy PM", "ReviewID": "RMLAPQH7VIEFA", "Overall": "5.0", "Content": "I am still getting used to windows 8, but am having a good time with this 2-in-1.  I love the speed at startup and the screen display is phenomenal.  It is comfy on my lap as a tablet, and works well with a wireless mouse in laptop mode.  I found the change to touchscreen very intuitive.  Only problems I am having is finding where my programs and documents are and figuring out which apps I need and which I can safely delete.  It comes preloaded with a lot of 30-day trial software which I am gradually reviewing and removing.  No thanks - I do not want to spend hundreds of dollars to convert a doc to PDF, when a free app is available.  Other than bloatware it is a joy to use.  The hinges are ingenious are appear very solid.", "Date": "April 16, 2014"}, {"Title": "Great but far from perfect", "Author": "Gustavo A. Darino \"always learning\"", "ReviewID": "R4MPEP5J4JWDY", "Overall": "4.0", "Content": "This is my first ultra book and I was excited about the Lenovo Yoga 2 Pro.I like everything about this system with one exception. The motherboard lacks a Trusted Platform Module chip. That means that encrypting the hard drive with BitLocker requires additional steps. This is a huge disappointment as I have older laptops with a TPM module built in.I like Windows 8.1 and my overall experience is good. The battery life is not great and you will have to dial down the brightness and power in order to get close to the advertised battery life.I purchased mine directly from Lenovo because they were sold out on Amazon at the time and Lenovo had a discount online.", "Date": "February 12, 2014"}, {"Title": "Upgraded Yoga 2 no longer available", "Author": "BadgerBay", "ReviewID": "R3BBWR5VLGPK5A", "Overall": "3.0", "Content": "I have been visiting the Lenovo site.The upgraded model of the Yoga 2, with 8 GB RAM and a 512 SSD hard drive, is no longer offered.You cannot upgrade the RAM on the Yoga 2, as it is hard-soldered to the motherboard.The bare-bones configuration will not run Adobe CS5 Premier Pro acceptably. According to Adobe, the minimum required RAM is 4 GB (wink*, wink*), which means that you need 8 GB to have it run without major problems.", "Date": "December 28, 2013"}, {"Title": "Very nice machine", "Author": "CheapWhine", "ReviewID": "R2A524KYRS2XY0", "Overall": "5.0", "Content": "This is definitely a lot nicer than the laptops I have at work. It is very fast and quiet.  The display is really sharp but I have noticed that some applications generated micro-print as a result of the unusually high resolution (this is easily fixed). I splurged on the larger SSD and really like it. This is my first Windows 8 system and it takes some getting used to, but the Yoga 2 Pro works as it should.The only thing I have noticed is that the micro-HDMI connector is not solid. I think this has to do with the rubberized case. Others on-line have said that a minor trim on the cable connector solves the problem. I haven't gotten to it yet, but it seems easy enough.I have not run any benchmark utilities but it is definitely much faster than my old computer. I installed Norton 360 and it did the entire system scan in under 9 minutes. On my old (OK, very old) system it took a very long time.I have noticed very slight fan sound only occasionally when really working the system. Otherwise, it is very quiet.The keyboard feels good and I had no problems typing.There is only 1 USB3 port (also a USB2 port), so I bought a 7-port USB3 hub and now have lots of connectivity options when I need them. Everything has worked quickly and easily.The machine is solid without seeming heavy. The aluminum skin is very nice looking and the hinges are solid and hold the screen steady. Changing to the different \"configurations\" has been pretty seamless.", "Date": "January 8, 2014"}, {"Title": "great device", "Author": "Gabriel Tiron", "ReviewID": "RSX7KY77HPTQV", "Overall": "5.0", "Content": "Small fixable issues (yellow) inherent in any new product but in general a piece of jewellery. I definitely recommend the product.", "Date": "December 21, 2013"}, {"Title": "Highly recommended this product and vendor", "Author": "Scott Mattie", "ReviewID": "RYIY2UXDGJX4G", "Overall": "5.0", "Content": "This is one of the best ultrabook laptops out there today. Very well designed and excellent battery life. More importantly, is Eagle direct did an amazing job in taking care of me. #fedexfail ruined my holidays, by not only missing sending me the product within 3 weeks, but then they fedex sent the package back to Eagle direct.Eagle direct was very responsive and cared about my experience. They ensured that I got my laptop and sent it via the USPS (who got it to me in 2 days) so I did not have to deal with Fedex.I can't say enough about how well Eagle direct took care of me, but I hope my appreciation rewards their customer service folks. (Who took care of me and ensured I had a great experience)", "Date": "January 10, 2014"}, {"Title": "Nice!", "Author": "Brian \"reviewer\"", "ReviewID": "R7JUEUSX3M5NR", "Overall": "5.0", "Content": "Well I finally feel like I have the latest technology computer - it's been a while!  This thing is super sleek - yeah with anything new there are bound to be some growing pains.  Other people have mentioned the fact that \"yellows\" don't look quite yellow.  But there's a fix for that if it really bothers you.  This thing is really fast though, and I've received lots of compliments on it.  Seems to be built pretty tough and doesn't feel cheap in any way.  So far has handled everything I've thrown at it with ease.  Very happy with the purchase.", "Date": "November 7, 2013"}, {"Title": "I wanted it to be good, but I just can't recommend this thing.  It's a gimmick, go another direction if you want a real laptop.", "Author": "M. Rodriguez \"Cnyper\"", "ReviewID": "R37SOAG83HJFMS", "Overall": "1.0", "Content": "I purchased the Yoga a year ago online at bestbuy.com.  Pre 8.1, it actually ran quite flawlessly.  There were little hiccups with some applications not doing what they were supposed to, but mostly the thing ran like a champ.  Then came the 8.1 update.  It was buggy at first, programs would randomly close for no reason, sometimes the pointer would just disappear and I would have to restart the pc.  All things minor, but not too bad.  then one day it just shut off while I was using it.  It would not turn on nor would it charge.  Nothing.I contacted Lenovo about this.  It was about 1 month before the warranty expiration so I made a claim.  They replied back stating I was a week past the warranty date, which was a lie.  I showed them proof-of-purchase which was in e-mail form (since I bought it online), and they did not accept it as proof of purchase.  So I went back to Best Buy, to see if they could help me out.  Turns out I bought the GeekSquad protection plan and I had forgot about it, so I was very grateful for that.  They took the laptop in and determined it could not be fixed, so they allowed me to exchange it for whatever I wanted.  More good news, the Yoga 2 had just come out, YAY!  So I'm actually pretty stoked, at no cost I got an upgraded laptop!I brought the Yoga 2 home and it was a quick set-up.  Logging in with my live ID allowed me to sync all my apps and settings from my original Yoga, which was nice.  I liked how the new screen was one large piece of glass without plastic bezel around it, made for a sleeker look.  I also liked that it felt lighter and thinner, almost like a MacBook Air.  I also noticed that the Transition from laptop mode to tablet mode was quicker than the Yoga 1.But I also noticed an overall sluggishness when it came to opening and switching between apps.  The Windows store also shut down on my randomly while searching/downloading apps.  I figured the PC was updating in the background and stuff, so I didn't think much of it.  But it didn't go away.  Furthermore, I noticed there was a weird \"whirring\" sound that I presumed was the internal fan.  It would only go on when the laptop was held a certain way, or on uneven surfaces.  Kind of makes sense considering the case is made of light flimsy plastic, but still not desired nor appropriate for a $1400 laptop.  Strike 1.After a few days of this, I decided to look into some things.  So I looked deeper into the thing and get this: the Yoga 2 PRO does not come with Windows 8.1 PRO!  WTF?  I'm pretty pissed about that, such a load of crap, since I had purchased the Windows Media Center add-on to my previous Yoga, which I now can't use unless I buy the $99 Windows 8.1 PRO upgrade.  Strike 2Finally, one day while playing Where's My Water 2, the PC just freezes.  I wait a while, and nothing happen.  I try to go to the start menu, but i can't.  I can't swipe or anything.  So I perform a hard reset.  I turn the thing back on and it can't find it's boot drive!  I turn it off and wait a while.  Try again and same thing, can't find boot drive.  SMH . . . I've only had the thing 10 days.  Strike 3.Before I take it back to best buy, I give it one more try.  To my surprise, the thing boots up.  It's normal, functioning perfectly.  So I play with it for a day, update my antivirus definitions, and watch a movie on netflix.  Everything's fine until it just decides to freeze again.  I'm hesitant to hard reset it again, so I wait.  And wait.  And wait.  20 mins go by and it's still frozen.  So I hard reset it.  Then, to my dismay, it doesn't even turn back on.  The power light comes on, and so does the keyboard backlight, there is SOME sort of activity, but no screen or indication of anything going on other than the annoying \"whirring\" fan sound I mentioned earlier.  Strike 4.After 14 days of using it, the laptop went dead.  I considered giving the Yoga another chance, but I opted not to.  My wife has has 3 macbooks at home that are 5 years old, 3 years old, and brand new.  All work just fine other than the physical abuse they've taken over the years and I have 3 windows laptops (Dell XPS, Yoga, Yoga 2 Pro) that lasted at MOST a year.  I got my money back, bought an iMac, and now use my wife's old macbook as a primary laptop.I really wanted to like the Yoga 2.  I tried so hard to sell the idea to friends, that it was so cool the way it went from laptop mode to tablet mode, how quick it was, how light it was, etc.  But i couldn't refuse the kool-aid anymore, I joined the dark side.  I went mac, and I'm very happy about it after a disappointing run with the Yoga 2.", "Date": "March 2, 2014"}, {"Title": "Screen dead after 3 days", "Author": "Nicholas Holman", "ReviewID": "R1O50PO1HSDGI5", "Overall": "2.0", "Content": "Great for the 3 days that it worked....then...the screen died randomly while not even touching the computer - a flash of red and green lines ... and then nothing.  Sad, because it was the first PC I've owned in a while that had a somewhat inspiring design.  After reading some other posts this week it appears Lenovo has a pretty serious QC issue with the Yoga 2 Pros being sold right now.  If reliability is important to you, then beware.  If you've got extra time for warranties/troubleshooting/etc, and want to risk it, it is a nice computer if it stays working.", "Date": "December 8, 2013"}, {"Title": "Don't buy it here, it's soooooo overpriced!!!!!!!", "Author": "Edwin", "ReviewID": "R3OSOLAWYZS36O", "Overall": "5.0", "Content": "I will not comment on Y2P but on it's price here at amazon. I was looking for a better deal on the internet hoping that I will get the best price here at amazon but I was shock when I saw the price! it's soooo overpriced! You can buy this spec of Y2P at bestbuy for 1,199, I don't know why amazon allow this seller to overpriced so much.I hope amazon will sell this product with a competitive price before I buy one.but I will give Y2P 5 star here because I like it so much!", "Date": "December 30, 2013"}, {"Title": "yoga 2 pro - good", "Author": "Mahesh  Ramachandran", "ReviewID": "RE19OWE1G5UZV", "Overall": "4.0", "Content": "Good product. Couldn't get orange color. Works as defined. Had to pay customs duty when imported to India. Would like to buy a cover.", "Date": "December 20, 2013"}, {"Title": "Unusable, at Least for Me", "Author": "Mike Cleveland \"Mike\"", "ReviewID": "R3JM6FO7JMMFC3", "Overall": "1.0", "Content": "I wanted very much to like this 2-1 computer/tablet, however, for me it was entirely unusable. Here's why: This computer/tablet is unusable with Google Chrome, a well-documented issue. If you use the forum-suggested solution, of changing the High-Res DPI code inside Chrome to \"Enable\" it does indeed make Chrome readable. However, now all the Chrome extensions are entirely unreadable; they are simply blanked out. I changed every possible setting, both in Chrome and in the computer's screen resolution and absolutely nothing worked. You can either choose lower resolution and use the extensions, but then the rest of Chrome is teency tiny, or you can choose higher resolution and not use your extensions. This is unacceptable. Some people might say this is Chrome's fault, not Lenovo. I disagree. Why would you release a brand new computer on to the market when it will not work with the most popular browser made today? I use extensions for my work, travel and leisure activities, and don't want a computer that will not work to display them correctly. I returned the computer to Best Buy where I bought it.", "Date": "November 30, 2013"}, {"Title": "CyberMon Deal No Deal", "Author": "Barkway \"critique\"", "ReviewID": "R2WKJVI1RQ3PF", "Overall": "4.0", "Content": "Over $1400 for the Yoga 2 Pro,  4th Gen i7 (and not even the orange one) is your CyberMon deal price? Lenovo is selling the orange one for a little over $1100 (and they claim is a $200 savings). Amazon's deal price is sure no deal.", "Date": "December 1, 2013"}, {"Title": "Getting it before Christmas", "Author": "mickey8675", "ReviewID": "RONNGIXMOS8MT", "Overall": "3.0", "Content": "I love the 360 design.  This convertible has the best specs out there, atm.  I knew it was the one I wanted to buy for my daughter.  I really can't rate the machine itself but I can tell you there are better prices out there.  Lenovo's direct price was good but they didn't estimate shipping until after Christmas.  I found it on BB and the price was under $1200.  I ordered it on 12/6 and can pick it up at the store on 12/12.  I could have had it shipped direct for free but I wanted to be able to ask questions when I picked it up.  I do a lot of shopping on Amazon and would have preferred to buy it here but price and delivery left me with no choice.  Better luck next time Amazon.", "Date": "December 7, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00G1PQVPQ"}}