{"Reviews": [{"Title": "Good quality but a few shortcomings", "Author": "jj", "ReviewID": "R3PJBJTA42M6LK", "Overall": "3.0", "Content": "I purchased this on sale from a local retailer for $499. I had been tablet shopping for quite some time and saw this when I had nearly decided on an Android platform. The display was impressive on the store demo and specs looked good on paper. It seemed like a great deal for the features vs. price and I was curious to experience Windows 8 as a user - My background is IT-related but I deal mostly with servers and XP/Win 7 clients. I purchased this primarily as a light work and entertainment device; an email/read on the couch while listening to Pandora or watch movies on a plane kind of thing. The sharp display, Beats Audio, and hybrid architecture seemed to be perfectly suited for this sort of use.After completing the obligatory Windows setup, I immediately jumped into exploring my way around. Aside from the well noted lack of a start button, the desktop was pretty familiar. But when I looked at the C drive properties, I was taken aback to see a measly 15 GB of free space remaining on the highly advertised 64GB SSD that put this device on par with all the other storage specs out there. Seriously, what was HP thinking??? I haven't looked into what preloaded bloatware I can live without and uninstall, but this was really discouraging. I initially planned on making this a dual boot system with Ubuntu but am going to have to get creative to have any kind of usable storage after adding linux and swap partitions to the drive.Overall performance is ok, albeit a bit laggy on occasion. So far I've only installed Firefox, Pandora, and a clock app. There are times when I have nothing but a folder or a couple apps open on the desktop and the thing gets stuck thinking for a few seconds before completing the requested task. Apps run a little smoother, but there is still a noticeable delay when opening even the native ones (mail, music, etc...). After running the HP support assistant and updating a half dozen or so drivers (two of which failed and I had to manually download those from the HP website), plus a BIOS update (again HP's own support utility could not complete this) things seemed to smooth out quite a bit. The BIOS update also includes support for Win 8.1 (although HP warns this particular model has not been tested with the OS upgrade) so I plan to install that as well.I can't really comment on battery life since I've only used it for a few hours at a time, but one thing that I can't figure out is if the display actually has a full auto-brightness control that uses ambient light. The windows power profiles are a joke as far as this is concerned, which probably explains why these are reported to have not the greatest battery life. Another place HP could have really stepped up here with a native power saver app that took advantage of their own hardware to gauge ambient light and adjust display brightness accordingly. One last thing I'll mention along these lines is Bluetooth integration, or rather a total lack thereof. Relying on Microsoft to manage those devices is not a good idea - My Sony/Ericcson HBH-IS800 headphones only connect about 50% of the time, and I've never had an issue using them with any other device.The IPS display is excellent, easy on the eyes, and bright enough to use in near direct sunlight. Colors are vibrant without over-saturation and contrast is very good with sharp lines. Viewing angles are good as well; everything on the screen can be seen easily from 45 degrees in any direction off center.Audio quality is great, except for one annoyance that I have not yet been able to resolve. Any spike or heavy CPU utilization period seems to interfere with the audio stream. There are intermittent pops, crackles, and digital artifacts present when this happens. I set the sample rate and bit depth in the HD audio codec properties to the lowest quality (16-bit/44100Hz) which decreased the interference but it is still very noticeable. This is with the latest audio drivers installed so my next step is to contact HP support. Aside from this, music sounds great even with regular headphones and there is a native Beats Audio app that lets you set custom EQ parameters with presets for music, movie, or voice. The external speakers are decent and fairly loud, but will distort slightly at max volume.** Update 1/1/2014 - I found a fix for the audio issue on the HP forums (it was for an older model laptop, but seems to work). The issue is that Microsoft can install an Intel IDT driver that this computer does not like (thanks to automatic updates, turn them off!). So you have to manually uninstall that and replace it with an HP sanctioned version. Here are step by step instructions copied from the forum:Under Start>Control Panel>Hardware and Sound, underneath the title of \"Devices and Printers\" select \"Device Manager.\"Click \"Sound, video, and game controllers.\"I have 2 systems: IDT High Definition Audio CODEC & Intel(R) Display AudioRight click on the first and select \"Uninstall.\" Be sure to check the box that reads \"Delete the driver software for this device\"Repeat for the second device.  You may be prompted to restart your computer.Go onto the HP Support webpage and locate, download, and install the latest Audio Drivers.  Afterwards, restart your computer.I give the hardware 4.5/5 for quality (the docking mechanism looks solid, great display, and well thought out expansion options on both tablet and keyboard modules), innovation, and layout. But the free disk space out of the box, driver issues, and anything useful from HP specific to the platform gets a 1 at best. So my overall score is a 3, but perhaps a Windows 8.1 upgrade and visit to HP tech support will help improve some of these early impressions. I would not recommend purchasing this PC unless you are prepared to make some tweaks out of the box and have the knowledge and patience to do so.** Update 1/3/2014 - I updated to Windows 8.1 and the computer runs MUCH better now. My only issue now is the screen brightness adjustment controls stopped working after the update. I am sure this is a driver issue but have not had time to investigate further. Not really anything against the PC itself since HP does not list it as compatible with 8.1, just an FYI to anyone else who may be considering the update.", "Date": "December 31, 2013"}, {"Title": "Good value", "Author": "John", "ReviewID": "RUEPMA3JXO2HJ", "Overall": "4.0", "Content": "I haven't seen other laptops at this price with these specs; 11.6\" screen and 4GB of RAM in particular.  I think the resolution is a good fit for the 11.6\" screen.  Between the appropriate sized desktop fonts/buttons/etc. and the keyboard that doesn't feel cramped, it feels like a normal laptop in a small package with the nice option to use it as a tablet.  Didn't have any of the window \"shadows\" issues described in another post, and the Windows start page scrolling has been smooth.  Hopefully the upgrade to Windows 8.1 will go well.  HP does say its compatible and has been tested, but you must visit the HP Support site and follow their instructions when upgrading.It would be nice if this were a little slimmer, especially since there's no additional battery in the keyboard part.  Even with that, I'd give it 5 stars, but I dropped it down to 4 because of the battery life.  Other new \"Bay Trail\" processor machines are getting 8 or 9 hours of battery.  This machine is little bigger than those, but even so, why not a little closer to the typical tablet range of battery life (6.5)?  And, why not Windows 8.1?", "Date": "December 14, 2013"}, {"Title": "Mediocre at best.", "Author": "S. Curcio \"Gator Bay Outdoors\"", "ReviewID": "R1M53YILEKD859", "Overall": "3.0", "Content": "I was interested to see how well the new Bay Trail CPU performed in comparison to last year's processor, the Clover Trail. The x2 is faster, but it does come with a few quirks. The battery life is not on par with other tablets. So far, I have been getting about 5 hours of life from a charge, which puts it into the laptop category. I make sure to plug the x2 in when it is not is use, so it is ready for me.The screen stutters a bit when scrolling horizontally. It is not a smooth experience by any means. It could be the fault of the apps, yet on other Windows tablets, the screen scrolled smoothly in those same applications.The resolution is standard for Windows tablets, so don't expect sharp text and razor-edge graphics for this size display. If the display were a 10\", then it may be better visually.One last thing about the display. The last window that was opened leaves a ghost image after it is closed. This reminds me of the old LCD displays that had the tendency of having images burned into them if a static window were left open for too long. That was one of the reasons for screen savers. In the case of the x2, the windows are not left open long enough to do such damage, yet the ghosting still appears. Luckily, it does disappear after a few minutes.The software loads slower than the Surface 2 I had. Something tells me I should have stuck with that tablet. I just wanted a larger display so I could easily see what I am typing.In the end, the only real positive for the x2 is the price of $529. However, you get what you pay for. The x2 is an example of that.", "Date": "December 5, 2013"}, {"Title": "Love my new computer", "Author": "Danielle Watson", "ReviewID": "RTEDIO34L6ZCK", "Overall": "5.0", "Content": "When i bought this computer there were no reviews at all for it. That made me a little nervous but it looked liked what i wanted and the price was really reasonable. I don't know much about the technical details but this is what i do know: its perfect for me. It works wonderfully for the things i do, internet, email, word processing, Netflix, Itunes, photo viewing and editing. Im self employed and us it for work as well. I love the tablet option, it releases easily and is a good size screen, not to big to hold but not to small to see. It has a kindle app and the new windows 8 which is a little different but nice. its small but easy to type on. It doesn't have a 10key pad on the side but not a deal breaker either. Other computer reviews complained about cord length, it is standard and plenty long. I have not clocked how long the battery lasts but once charged it works all day.I don't game so i can't speak of speed or power in that way. It is not compatible with square which is a bummer and doesn't have a cd/dvd drive. Those are the only two downsides so far. I have had it for three months and no problems. I love it and recommend it to others.", "Date": "January 3, 2014"}, {"Title": "For my wife", "Author": "Louie Kirchen", "ReviewID": "R32LC4Q6CO83DF", "Overall": "4.0", "Content": "Every thing worked out of the box.Startedup and battery life is real good.Was able to upgrade to windows 8.1 .Has good keyboard.", "Date": "January 13, 2014"}, {"Title": "Love this computer!", "Author": "Jenna Anderson", "ReviewID": "R3R05DQ2AJ3W2H", "Overall": "5.0", "Content": "It is pretty much everything I expected it to be.  It works very well for what I need it for, I do online school and I mess a round on Facebook and things.  I am not a tech savvy person but I know this computer gets the job done for what I need it for.  The touch screen and dual screen is so nice to have.  I am pleased with my purchase!", "Date": "January 3, 2014"}, {"Title": "Excellent tablet,", "Author": "ANDREW. M.", "ReviewID": "R30L6NKKK0PKGJ", "Overall": "5.0", "Content": "Excellent tablet, after getting the hang of Windows 8... all the others will fall short of this complete computing package.", "Date": "December 11, 2013"}, {"Title": "Bought for xmas 2013", "Author": "Derrick Gregory", "ReviewID": "R31XUBN6HREKH3", "Overall": "4.0", "Content": "I bought this for my wife for xmas and so far so good.  The new windows took a little more figuring out than I liked so I downloaded an app that allows you to toggle from classic view to new view with the click of a button.  Now all is right in the world!!  Anyway the cool thing with this is it will run apps like a tablet or use like a regular pc/laptop.  It truly is the best of both worlds.  Plus Taking pictures or video from it's camera was pretty good (a little darker than expected, but quality was great).", "Date": "April 2, 2014"}, {"Title": "Great little laptop", "Author": "Michelle L. Smith", "ReviewID": "R5EU3QCTEEQRF", "Overall": "5.0", "Content": "I love being able to access the internet from anywhere in the house.  This laptop is small and very portable.  And so far I have not had any problems with it.", "Date": "March 2, 2014"}, {"Title": "Versatile and easy to use", "Author": "Daniel Galletta", "ReviewID": "R19V80ZH7AFG4O", "Overall": "4.0", "Content": "I like the features and flexibility better than Microsoft Surface Pro. Very durable. The only negative comment is the battery life is a little too short.", "Date": "January 30, 2014"}, {"Title": "Great balance of performance and price", "Author": "Paul", "ReviewID": "R2LQ3GNL4PV7I9", "Overall": "5.0", "Content": "I have been looking for a convertible tablet for a year now. I initially was interested in the ASUS T100 for being lighter, but I was concerned with its quality. As far as the Pavilion X2 it has better performance with a Pentium quad processor and faster SSD than quad Atom, at the compromised of lower battery life. I get about 4 to 5 hours which is fine for my application. I like the fact that I run any windows application without limits, like adobe FLASH apps, and still use it as a tablet when it makes sense. I also needed 4GB of ram. When I saw it at the store, the video scrolling was jerky. That was related to the win8 driver not being compatible with win8.1.  HP has a help assistant utility to find and update drivers. Now the video is fast.It has the High HP quality. Keyboard and trackpad feel great. I am impressed how the tablet releases from its keyboard base. Very solid. I have been using it for a month now.", "Date": "January 27, 2014"}, {"Title": "Xmas Gift to 14 year old son", "Author": "Joanne Demaree", "ReviewID": "R32FEFIVJMQE7A", "Overall": "5.0", "Content": "Our son absolutely loves the x2. We didn't shop early enough to get a Surface Pro, but glad we got the HP!!!", "Date": "January 22, 2014"}, {"Title": "Great deal", "Author": "Charissa Lefik", "ReviewID": "R3U0ZJZ3MCQ7ZW", "Overall": "5.0", "Content": "So happy i chose this and not a competitor at a lower price! PERFECT gift for my son in his 3rd year of college.  Much lighter and versatile to carry from class to class!", "Date": "January 14, 2014"}, {"Title": "Bought as a present", "Author": "Linda Castello", "ReviewID": "R15JVE0A37O1QR", "Overall": "4.0", "Content": "My daughter loves it!  She has been carrying around a regular laptop for college but it gets too heavy. This HP helps take the strain off and gives her the programs she needs for school.", "Date": "January 13, 2014"}, {"Title": "Awesome", "Author": "Brett Lonczak", "ReviewID": "R1CIEZYJ24ZMO6", "Overall": "4.0", "Content": "Like it a lot.  Could not be happier.  Recommend this product to my family and mother bought the same one.", "Date": "January 3, 2014"}, {"Title": "Great little hybrid", "Author": "T. Symons", "ReviewID": "R3U527BFKSKG7", "Overall": "5.0", "Content": "I've been pleasantly surprised by this machine. Everything responds quickly, and I haven't experienced any of the ghosting that was mentioned in another review. Battery life has been good, in my opinion, but it really depends on what you're doing on it. I always take battery complaints with a grain of salt, because I know that people are often using their machines heavily, particularly right after they buy them. My only real complaint is that this is shipping with 8 instead of 8.1 on it.", "Date": "January 2, 2014"}, {"Title": "Fantastic", "Author": "Amazon Customer", "ReviewID": "R28FD1VS3G2K1T", "Overall": "5.0", "Content": "Purchased two for our college age sons for Christmas.  Great laptop and would purchase again.  They like having conveneance of a tab and using windows 8 so can still use for classes.", "Date": "December 25, 2013"}, {"Title": "Great little machine", "Author": "Freak Show for Christ", "ReviewID": "R18FBNBI2UMVHJ", "Overall": "5.0", "Content": "I bought this to replace my 3rd Dell. So far everything is great! The touch screen takes some getting used to because it's sensitive but I love the convenience of it and the ability to split into a tablet. The Beats audio is great. I was wary buying it refurbished but since it was half price I decided to give it a go. The only difference between this and a new machine is that there is a small knick in the varnish on the bottom of the keyboard. Ultimately I'm very pleased! I hope this is the start of a long and wonderful relationship with HP.", "Date": "April 16, 2014"}, {"Title": "The touch pad on the key board did not work", "Author": "James Conley", "ReviewID": "RUMCRLFK6UOKA", "Overall": "1.0", "Content": "I gave this a one as I have yet to use it as the touch pad on the key pad does not work and did not work from the beginning.  The laptop is on its way back to HP to be repaired.  I am not sure I would buy another computer through amazon again as their return policy is they will just refund you not replace computers.", "Date": "January 5, 2014"}, {"Title": "Don't Buy", "Author": "Love My Dash", "ReviewID": "R22PGLPNKDNIB", "Overall": "1.0", "Content": "Can I return this?  Seriously, freezes up constantly. Back to trusty IPad. I wish I hadn't bought it. Good idea but not well executed.", "Date": "January 4, 2014"}, {"Title": "HOW MANY COMPUTERS DONT COME WITH MICROSOFT WORD PRE-INSTALLED?", "Author": "Darcen Morales", "ReviewID": "R2T1CNNWDAG2L4", "Overall": "3.0", "Content": "This computer is very enticing? It has lots of cool and exciting with the convertible to tablet and the touch screen- also very pricy! All of which a 17 year old could want and love right??? You would think with the cost that it would no SHOULD come with Microsoft office- but no it does not and therefore the computer's use to do homework is non-existence- HP got it WRONG!  By not including the program basically renders the computer a game console and internet connection. At the very least there should have been a free or discounted download -SUPER DISAPPOINTED!", "Date": "April 19, 2014"}, {"Title": "Good Value but too small.  11in?", "Author": "K.N Minnesota. \"KNguyen\"", "ReviewID": "R2S4WMYZ7YAHSJ", "Overall": "2.0", "Content": "I ordered and returned immediately upon receiving w/o opening the box.  I didn't realize how 11 in would be like until I went to bestbuy and check out a 11 in laptop.  It's too small. That was the only thing that I can comment since I didn't keep it. I have an HP 12 in swivel and it was too small.", "Date": "April 8, 2014"}], "ProductInfo": {"Price": "$822.00", "Features": "Intel Pentium N3510 (Baytrail Quad Core)\n4 GB DDR3L SDRAM\n64 GB Solid-State Drive\n11.6-Inch Screen, Intel HD graphics\nWindows 8, 5.5-hour battery life", "Name": "HP Pavilion x2 11-h010nr 11.6-Inch Convertible Touchscreen Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/41gqx%2BRrUfL._SX300_.jpg", "ProductID": "B00G8VOX7G"}}