{"Reviews": [{"Title": "Desktop replacement laptop with all the portsj - UPDATED 2/17/14", "Author": "Andrea Polk", "ReviewID": "R3VMU8N6E8ORPT", "Overall": "4.0", "Content": "At the right price, this is a great choice for a desktop replacement laptop. Big 17\" screen, full-size keyboard, 4th Generation Intel Core i3 processor and a huge 750 GB hard drive will make every day users who have no real need for mobility, very happy.I purchased this PC for my Mom for under four hundred.  At that price, it's an excellent deal for those who have basic needs: word processing, Skype, emailing, Facebook, minor photo editing, watching the occasional movie via DVD, or via streaming Netflix.  It's not ideal for gamers who want faster graphics (this has integrated graphics and video), but you can play online games just fine with a high speed wired or wireless  connection.  The LED backlit screen is big and bright, and the DTS sound is good, which adds to the enjoyment of the experience.  NOTE: It's not touchscreen though, which some will want.A full-size keyboard with numeric pad isn't backlit, which would be ideal, but at this price it's not expected. A multi-format media reader is built-in, as is a multi-format DVD Burner. Two USB 3.0 ports, one USB 2.0, one VGA and one HDMI, and an ethernet (wired internet) jack, offer the most complete connectivity I've seen on a laptop in a long time!  A built-in microphone jack isn't really needed as there's an integrated HD webcam with digital microphone what works well.  There's also a headphone jack.What's it missing?  No Bluetooth, but you can easily add it with one of these: ORICO BTA-402 USB Bluetooth 4.0 Micro Adapter Dongle Mini Bluetooth 4.0 Adapter Dongle With CSR8510 Controller and CSR Harmony for Windows XP Vista 2003 2008 7 and 8 32 or 64 Bit.This laptop is upgradeable from 4GB of memory to 8GB, which I wish was more like 16GB, but that's being greedy.  Windows 8 needs 4GB for stability, and if you are using multiple programs at one time, 8GB is ideal.  I guess it really comes down to your usage (like whether you have lots of open programs going on all at the same time...) as to whether or not you're likely to bog down the system if it has 4GB versus 8GB.NOTE: Ravi (another Amazon reviewer...) says he upgraded this laptop to 16GB, even though HP states 8GB is the max.  If you've got the spare 8GB stick laying around or don't mind purchasing one to try it, go for it.  The extra cost probably isn't worth it to most people, and HP indicating it's not supported should be considered.This laptop has nice speed for general use, looks good (glossy finish picks up fingerprints quite easily though), and performs well.  I wish it had a 7200RPM hard drive, but in all honesty, I don't know that this would make an appreciable difference in performance.There's a webcam, with a webcam 'light' that comes on when it's in use. The webcam can take still photos or stream video.  Set-up to work with the included CyberLink YouCam software, it will also work with Skype, Facebook and others.I'll be adding the Bluetooth dongle for pairing with Bluetooth headphones, and since my Mom will use it at her desk I'll add a Sabrent 7 Port Portable USB 3.0 Hub with 4A Power Adapter for Ultra Book, MacBook Air, Windows 8 Tablet PC - Black (HB-B7U3) to connect up external drives and peripherals that are not Wifi connected. Adding a 8GB memory dimm will be done in the future too, but for her uses 4GB should be OK - it's more about my desire to max it out.At 6.39 pounds with about a 3 hour battery life, it's not the lightweight, highly portable laptop that college students will want, however if it's going to be in a home office with no significant travel it's a good choice.SPECS PER HP SITE:Product Name 17-e019dxProduct Number E0J97UAMicroprocessor 2.4GHz 4th generation Intel Core i3-4000M ProcessorMicroprocessor Cache 3MB L3 CacheMemory 4GB DDR3L SDRAM (1 DIMM) - installedMemory Max Maximum supported = 8GBMemory Slots 2 user accessibleVideo Graphics Intel HD graphics 4600Display 17.3-inch diagonal HD+ BrightView LED-backlit display (1600 x 900)Integrated webcam with light indicating connectivityHard Drive 750GB 5400RPM hard drive with HP ProtectSmart Hard Drive ProtectionMultimedia Drive SuperMulti DVD burnerNetwork Card 10/100BASE-T Ethernet LAN (RJ-45 connector)Wireless Connectivity 1x1 802.11b/g/n WLANSound DTS Sound+Keyboard Full-size keyboard with numeric keypadPointing Device Touchpad supporting multi-touch gestures without on/off buttonExternal Ports  Multi-format digital media card reader for Secure Digital cards2 SuperSpeed USB 3.01 Universal Serial Bus (USB) 2.01 HDMI1 VGA (15-pin)1 RJ-45 (LAN)1 Headphone-out/microphone-in combo jackDimensions 1.16 in (min H) / 1.29 in (max H) x 16.5 in (W) x 10.5 in (D)Weight 6.39 lbPower 65W AC adapter6-cell 47WHr 2.2 Ah lithium-ion batteryID Mech Description  Front facing HP TrueVision HD Webcam with integrated digital microphoneUPDATE: 12/27/13TouchPad gestures can be tricky! Becoming proficient using this feature will increase your enjoyment of this laptop.  Refer to the User's Manual (online at HP) for more info on that and the entire system.  It's the best way to get acquainted with this laptop.I also recommend updating to Windows 8.1 (it's free on the Microsoft site) to get the most stable Windows 8 experience and a few new features that make it feel a bit more like Windows 7.UPDATE: 2/17/14My mother reports that the laptop continues to work well for her purposes.  I asked her how she liked the keyboard, as a negative review for the product is focused on that part of the laptop.  She says that all laptops feel different to her compared to an external keyboard with her desktop (I'd have to agree...) and that it has taken some getting used to, but it works fine.UPDATE: 4/23/14I taught my mother how to supplement her free over-the-air TV programming using a Google Chromecast HDMI Streaming Media Player with this PC. If you're not sure what over-the-air programming is, or how to get it, check out my book: Simple Guide to Over-the-Air Free TV.", "Date": "November 28, 2013"}, {"Title": "Keyboard total dog", "Author": "JimOsceola", "ReviewID": "R3776RJW0SAPHW", "Overall": "2.0", "Content": "I've had this laptop since Christmas, and would gladly give it away if it hadn't been a gift.  Great screen, great battery-life, and a big Zero on everything else.  This review is for straight usage, not gaming.  As a middle-aged person with big hands and dwindling eyesight, I found this laptop almost unusable, mostly because of the keyboard (never mind Windows 8).  The glare from the screen shadows the black keyboard.  The fonts and numbers are microscopic and poorly printed on the keys, and barely visible even in a good light pouring over my shoulder.  Per the usual laptop keyboard, the Delete key is not conveniently nearby, but as been reduced to a half-key squeezed beside the Home key and Print Screen.  I do tons of straight copy writing, and find it irritating in the extreme to constantly hit the Home or Print Screen key by accident when trying to edit something.  Someone else mentioned the fingerprints and smears, and the exasperating Touch Pad, which seems to vary hourly on how much pressure to use.  It has features which seem to tie in with a Touch screen but this computer does not have a Touch screen, so those features also operate independently.  A light accidental brush gives you 900X zoom, but it takes four hard taps to open an App.Oh yeah, if you love apps, this comes loaded.  I don't have that kind of time to waste, and uninstalled 97% of them.  The simple act of turning it off, without sleeping or hibernating (which is the default, i.e., the irritating white light that blinks all night long) you have to \"grab\" the right side of the screen, bring up the \"Charms\" (that had to be a twenty year old that came up with that crap), click on Settings, Go down to blah blah blah,...click on blah blah, and you might get the blasted thing shut down before breakfast.  I've owned every brand of laptop since a primitive Atari back in the 80s, and it seems like they are getting more into the glitz factor instead of actual efficient work-horses.  If you're young with 20/20 vision and never use a Delete key, this one may work for you.  If you're middle-aged, find a real one to check out the keyboard first.", "Date": "January 21, 2014"}, {"Title": "This laptop supports 16GB of RAM!", "Author": "Ravi", "ReviewID": "R3L5SZ60MVCGCW", "Overall": "5.0", "Content": "First let me explain that this laptop is not some high end laptop for gaming. The five star is pure for what it offers for the price. You can get this laptop for 400$ at bestbuy and this is the only laptop that you get all the things that it offers in its price range.Also, as per the user manual this laptop can support only 8GB of RAM. But i have actually installed 16GB (2*8GB) of ram and its working fine. I installed this [...] RAM with my laptop.", "Date": "January 18, 2014"}, {"Title": "82- year old Mother very pleased", "Author": "J. Adomako \"asempa\"", "ReviewID": "R3TVLLNYFO9UKP", "Overall": "5.0", "Content": "I got this for my 82-year old mother - she needs a big, clear screen. and uses it for Word processing and email.  It fits the bill and so far, after 8 weeks, she has been very pleased.", "Date": "February 17, 2014"}, {"Title": "Hp 17.3 Notebook", "Author": "Fatima Majzoub", "ReviewID": "R21DDJ7ESC35NV", "Overall": "5.0", "Content": "I absolutely love it! It's just what I wanted and was looking for. Sometimes it gets a bit heavy to move around with me, but I wanted a 17.3\" and I'm very satisfied with it.", "Date": "January 26, 2014"}, {"Title": "Great value", "Author": "Ethan H.", "ReviewID": "R36DJG1XUFPX96", "Overall": "5.0", "Content": "5 star for the value. Great laptop for basic use, we hook it up to the tv through HDMI and it works great. Best laptop under $500 that I could find.", "Date": "February 18, 2014"}, {"Title": "Great deal", "Author": "ghislaine tuekam", "ReviewID": "R1MCN9QKPWZPTJ", "Overall": "5.0", "Content": "Awesome, I was exactly what I was looking for and the price was in my range.Thank you. HP always meet my demands", "Date": "April 24, 2014"}, {"Title": "HP Pavillion", "Author": "Kimberly Cochran", "ReviewID": "R1ZRJ083GCHT7N", "Overall": "5.0", "Content": "Excellent! Best laptop I've ever purchased.  Just love it.  So fast and so easy to use.  Just awesome,  a must.", "Date": "April 12, 2014"}, {"Title": "Best Bang For Your Buck!", "Author": "dkraftyone", "ReviewID": "R1KP09X59BE4V9", "Overall": "4.0", "Content": "Used my rewards points from my credit card that was linked with Amazon, to purchase this laptop at a fraction of its cost. Score! Though the original price of something like $450; to begin with, that is a steal for a 17\" monitor - reason #2 of purchase. Did not need this laptop for any other reasons other than MS Office (not included), music, social media and Netflix. Only downside is no Bluetooth connectivity and Windows 8.1 is a fail.Bottom line, everyone is looking to save here and there and in this economy, bargains and value are key; so again, this was a steal!", "Date": "April 2, 2014"}, {"Title": "good product", "Author": "elizabeth cheenibass", "ReviewID": "R1ES8YG3RKUY1F", "Overall": "4.0", "Content": "I bought this laptop as a gift for my mum and the interface was user friendly, the machine is lightweight and works well.", "Date": "June 8, 2014"}], "ProductInfo": {"Price": "$699.00", "Features": "2.4GHz 4th generation Intel Core i3-4000M Processor, 3MB L3 Cache, Full-size keyboard with numeric keypad\n17-Inch diagonal HD+ BrightView LED-backlit display (1600 x 900), Intel HD graphics 4600, DTS Sound+\n4GB DDR3L SDRAM (1 DIMM), Multi-format digital media card reader for Secure Digital cards\n750GB 5400RPM hard drive with HP ProtectSmart Hard Drive Protection, SuperMulti DVD burner\nFront facing HP TrueVision HD Webcam with integrated digital microphone, HDMI, USB3.0, Windows 8", "Name": "HP Pavilion 17-e019dx 17-Inch Laptop (2.4GHz Intel i3-4000M Processor, 4 GB RAM, 750GB Hard Drive, Windows 8)", "ImgURL": "http://ecx.images-amazon.com/images/I/51jhVLQ-jbL._SY300_.jpg", "ProductID": "B00GYM8WYO"}}