{"Reviews": [{"Title": "a confusing product listing.  Not enough pictures, wrong product info, overall fishy. note: this is not sold by amazon.", "Author": "GC", "ReviewID": "R2R82SCY1NHU7A", "Overall": "2.0", "Content": "this product lacks information.  First the details info is not 100%correct, ex: the CPU description is wrong.  \"apple\"? huh  anyways moving on....Is this the Acer Aspire V5-131-2491?_______________________________________________________________________________________________________IF so this is the description found in acer.com\"Windows 8 - 64-bit version - Intel® Celeron(tm) processor 1017U (1.6GHz) - 4GB DDR3 memory - 500GB hard drive - 11.6\" LED-backlit display (1366 x 768) - Intel® HD Graphics - webcam - Wireless - Bluetooth® 4.0 - HDMI® - USB 3.0 - card reader - 6.5-hour battery - 1-year limited warranty. Color: Glossy silver \"Operating SystemOperating System Windows 8Processor & ChipsetProcessor Manufacturer IntelProcessor Type CeleronProcessor Model 1017UProcessor Speed 1.60 GHzProcessor Core Dual-core (2 Core)MemoryStandard Memory 4 GBMaximum Memory 8 GBMemory Technology DDR3 SDRAMNumber of Total Memory Slots 2Memory Card Reader YesMemory Card Supported Secure Digital (SD) CardStorageHard Drive Capacity 500 GBHard Drive Interface Serial ATAOptical Drive Type NoDisplay & GraphicsScreen Size 11.6\"Screen Mode HDScreen Resolution 1366 x 768Backlight Technology LEDGraphics Controller Manufacturer IntelGraphics Controller Model Graphics Media Accelerator HDGraphics Memory Technology DDR3 SDRAMGraphics Memory Accessibility SharedNetwork & CommunicationWireless LAN Standard IEEE 802.11a/b/g/nEthernet Technology Fast EthernetBluetooth Standard Bluetooth 4.0 + HSBuilt-in DevicesWebcam YesMicrophone YesFinger Print Reader NoInterfaces/PortsHDMI YesTotal Number of USB Ports 3Number of USB 2.0 Ports 3VGA YesNetwork (RJ-45) YesSoftwareOperating System Windows 8Operating System Architecture 64-bitInput DevicesKeyboard YesPointing Device Type TouchPadBattery InformationNumber of Cells 6-cellBattery Chemistry Lithium Ion (Li-Ion)Battery Capacity 5000 mAhMaximum Battery Run Time 6.50 HourPower DescriptionMaximum Power Supply Wattage 65 WPhysical CharacteristicsHeight (Front) 0.82\"Height (Rear) 1.08\"Width 11.2\"Depth 8\"Weight (Approximate) 3.26 lbMiscellaneousPackage Contents *Aspire V5-131-10174G50ass Notebook*Lithium Ion Battery*AC AdapterAdditional InformationWireless LAN: Acer Nplify 802.11a/b/g/nGreen Compliant YesGreen Compliance Certificate/Authority ENERGY STARWarrantyWarranty Limited Warranty agreement applies._____________________________________________________________________________________________________ I hope this helps...pls thumbs up to help other visitors to avoid a potentially confusing buy._____________________________________________________________________________________________________(pls thumbs up, I put a lot of hours making compiling this review. ty:-)==CONTENTS==1) Alternative Options2) TOP 3  ($280-$399)-(11.6\"-14\"Touch between (3.7-2.6 lbs)3) TOP 2  ($399 - $499)-(14\"Touch between (4.7lbs-5.6lbs)4) TOP 2  ($500-$800)-(15\"Touch between (4.8 Ibs - 5.6 lbs or higher)5) Windows 8.1 Tips & Computing Safety between==Alternative Options==I was doing my research my goal was to find the value laptop without hurting my wallet,  I continue to update and filter through the entire amazon laptop list! YES indeed!  I've done the hard work of searching for the best performing, best priced, that best fit our needs. This is a list of economical touch-screens Windows8 laptop which also offers excellent performance+battery==TOP 3  ($280-$399)-(11.6\"-14\"Touch between (3.7-2.6 lbs)==Here are the best choices for 11\" functional, portable, light weight, bang for your buck notebooks.<><>Expected Performance Meter<><><>ENTERTAINMENT<>[Average to Poor] PC Gaming or [Average] Facebook Gaming[Excellent] Social Media surfing (Twitter,Facebook,Linkedin)[Excellent] Video Chatting (Skype)[Average] Streaming Shows HD (Netlfix,Youtube,Hulu,iTunes)[Excellent] Music Library (iTunes,Amazon MP3,Lastfm,Spotify)<>PRODUCTIVITY<>[Average] MS Office[Excellent] TurboTax, Quickbooks[Excellent] Education Free Courses (from basic algebra at Udacity to Advanced MIT's Open Courseware)<>EXPRESS YOUR CREATIVITY<>[POOR] Music Creation (create music recodings, Audacity)[Average] Photoshop editing (Photoshop Elements)[POOR] Video Editing (Sony Vegas/MovieStudio, Adobe Premier)[Average] Website development (Adobe Dreamweaver CS3)<> NO.1 +/- $359 Lenovo IdeaPad S210 59387503 11.6-Inch Touchscreen Laptop, 1.9 GHz Intel Pentium 2127U ULV(dualcore,2 MBCache, 3rdgen/Ivy Bridge,July2013chip$134), 4GB RAM, 500GB HD(Black)PROS: Light weight at 3.1lbs,.9\"thick. Great 720p camera for Skype, 1usb 3.0, TouchScreen.[CPU Passmark Score: 1865]CONS:Battery life, No Bluetooth.  not a great deal if prices increase to closer to $400. at +$400 price rage, I'd advise looking into 14\" notebooks options listed below, to get more for your money. Sold by 3rd Party seller, not amazon<> NO.2  +/- $335 HP Pavilion 11-e015nr TouchSmart 11.6\" Touch Screen - AMD Elite Quad-Core A6-1450(06/01/2013) / 4GB DDR3 / 320GB HD / Windows 8 64-bit OSPROS: Quadcore A6-1450  SoC are usually in notebooks at +$450 category but for HPs asking $350ish ? DEAL! but downgraded the Hard Drive , Touch, 4GB, / one of the better CPU/APU options in this category for gaming(Portal 2 and Torchlight 2 on high settings but lag free! /Upgradable to 8GB verified) 3.37lbs[Passmark Score: 1642]CONS: 320GB instead of 500GB, HP build quality is avg compared to ASUS or Lenovo but thats subjective.  Prices fluctuates too much, if sellers increase their prices closer to $400 i would not recommend buying this or any 11.6\" note books. At $400, finding a better  14\"-15\" touch screen size is possible.  I made my Top Notebooks List at $400 tag below, for details. Sold by 3rd Party seller, not amazon<> NO.3 +/- $454  Acer Aspire V5-122P-0637 11.6-Inch Touchscreen Laptop (Chill Silver)(1.0 GHz up to 1.4GHz AMD Elite Mobility Quad-Core A6-1450 Accelerated Processor, 6GB DDR3 SDRAM, 500GB 5400RPM hard drive, Windows 8 64-bitPROS: IPS screen better color and viewing angle(probably best screen on this list), Same CPU/APU as HP Pavilion TouchSmart 11 listed above thus Pros are identical, + 500GB Hard Drive , 6GB RAM! best gaming capable system at the light weight 11.6\" Touch screen category. Enough power in this noteboko to deliver performance that it could act as secondary main PC.[CPU Passmark Score: 1642]CONS: Expensive at $450 but it has 6GB RAM(instead 2GB) and 500GB HD(instead of 340GB) with the AMD A6-1450 Quadcore (instead of poor performance AMD A4-1250 Dualcore AVOID at all cost!)______________________________________________________________________________== TOP 2  ($399 - $499)-(14\"Touch between (4.7lbs-5.6lbs) ==These 14\" touch screen laptops are designed for those who are always on go or need a portable computing device, bigger than 10.1-11\"display without sacrificing performance. These notebooks are powerful enough to act as your secondary main PC machine for school, work and home.WHAT YOU DESERVE AT $400  (Typically an increase in price fallows an increase in quality of parts.  At  this price range expect a 14\" Screen Touch ,  with CPU Intel i3 or AMD's A6 or A8 processors) I favor AMD due to their graphics performance doubling that of Intel variant.<><>EXPECTED PERFORMANCE METER<><><Entertainment>[Average] PC Gaming or [Excellent] Facebook Gaming[Excellent] Social Media surfing (Twitter,Facebook,Linkedin)[Excellent] Video Chatting (Skype)[Average] Streaming Shows HD (Netlfix,Youtube,Hulu,iTunes)[Excellent] Music Library (iTunes,Amazon MP3,Lastfm,Spotify)[Average] MS Office[Excellent] TurboTax, Quickbook[Excellent] Education Free Courses (from basic algebra at Udacity to Advance MIT's Open Courseware)<Express Your Creativity>[POOR] Music Creation (create music recodings, Audacity)[Average] Photoshop editing (Photoshop Elements)[POOR] Video Editing (Sony Vegas/MovieStudio, Adobe Premier)[Average] Website development (Adobe Dreamweaver CS3)<> NO. 1 +/- $448 Lenovo IdeaPad S415 59385549 AMD A6-5200M(May 23, 2013) 2.0 GHz Processor (2 MB  Cache05/23/2013, Kabini), 4 GB DDR3 RAM, 500 GB 5400 rpm Hard Drive,  14-Inch Screen Touchscreen, ATI Radeon HD  8400 Integrated Graphics,Windows 8, 5-hour battery...,PROS: Its an IdeaPad brand+build quaity, 14\" touch, Battery life 5hrs!, 720p HD webcam , Sold by Amazon.comCPU Passmark Score: 2450CONS:<> NO. 2 +/- $479 HP Pavilion 14-f027cl 14\" Touch Laptop, AMD A8-5545M 6GB Memory 640GB Hard DrivePROS: Battery life, +5hrBig 14\" touchscreen, Higher grade AMD Elite Quad-Core A8-5545M Accelerated Processor with 4MB L2 Cache, Bigger 640GB Hard drive, and 6 GB RAM, More USB 3.0 . A8-5545M is higher step APU compared to next 2 laptops below sporting an A4-1450 APU thus this is faster and better choice for gaming.[CPU Passmark Score: 2539]Cons: 1.7lbs heavier than 11.6\" notebooks, Expensive if your budget goal is to get a capable notebook for under $400. don't buy if +$475 asking price.  +$500 price range there are better product selections at 15\" Notebook category. Sold by 3rd Party seller not Amazon.com______________________________________________________________________________== TOP 2  ($500-$800)-(15\"Touch between (4.8lbs - 5.6lbs or higher) ==These touch screen laptop is designed for those who requires performance over portability.<><>EXPECTED PERFORMANCE METER<><><Entertainment>[Excellent] PC Gaming or [Excellent] Facebook Gaming[Excellent] Social Media surfing (Twitter,Facebook,Linkedin)[Excellent] Video Chatting (Skype)[Excellent] Streaming Shows HD (Netlfix,Youtube,Hulu,iTunes)[Excellent] Music Library (iTunes,Amazon MP3,Lastfm,Spotify)[Excellent] MS Office[Excellent] TurboTax, Quickbooks[Excellent] Education Free Courses (from basic algetbra at Udacity to advance MIT's Open Courseware)<Express Your Creativity>[Excellent]Creation (create music recordings, Audacity)[Excellent] Photoshop editing (Photoshop Elements)[Average] Video Editing (Sony Vegas/MovieStudio, Adobe Premier)[Excellent] Website development (Adobe Dreamweaver CS3)<> No.1 $479 Acer Aspire E1-572P-6857 15.6\" Touch,Intel i3-4010U Processor 1.7Ghz,6GB RAM, 750GB HDDPROS: SOLD by Amazon. an Intel i3 touchscreen at 15\" for under $480 is rare. Way under priced for what you're getting.  Could easily be marked up  close to $600 for sure. Battery life is good due to (new)Haswell processor. Great IPS screen. SD card reader , Nice solid Metalic feel unlike most notebooks in this price range made of plastic.[CPU Passmark Score: 2514]CONS: Weight, standard weight 5.6lbs for 15\" notebook. Great for Video chat with 720P HD camera.<> No. 2 Acer Aspire V5-552P-X440,A10-5757M,8GB Ram, 1000GB HDD 15.6-Inch Touchscreen Laptop (Cold Steel)PROS: SOLD by Amazon, 4.8 lbs, Thin .9\" Ultrabook, Powerful A-10 Quadcore processor, 8 GB of RAM, Huge 1000GB Hard drive(1TB), Fastest APU/CPU for gaming. Powerful still managed to be thin+lighter than standard  15\" notebooks. 4.5hrs battery. Back-lit Keyboard, High end non-plasticy shell, Great for HD Video Chats, Acer.com sells this for $700! Great for business, gaming, traveling, home use, main PC, etc. Superb IPS screen. Its the best of both worlds, ease mobility, super thin and ultra light but powerful enough for everything, all premium features without Ultrabook's $1k Premium prices.[CPU Passmark Score: 2922]CONS: Need to manually upgrade from Windows 8 to 8.1(free) via Windows Marketplace,  No Disc drive, At $600 you shouldn't complain.  The power and portability you get from this notebook could easily cost you somewhere near $1000 Ultrabook category.  No cons, its perfect at its price.==Windows 8.1 Tips & Computing Safety==Bring back the start button: Installing one of these two software will help new Windows8.1 users to ease into \"Modern\" user interface of windows 8.11) Classic Shell (free) or 2) Start8 (Stardock $5)___________________________________________________________________Avoiding major damages caused by those pesky malware,virus etc by simply not using an \"Administrator Account\" with your main MS Account.Viruses will likely cause more damage and will be impossible to completely remove if they gained Admisitrator's right and  have dug deep inside your computer.  An \"Administrators\" account is a backdoor route viruses/malware uses get in and cause unrecoverable distruction to your data. With Admin rights those malware can easily infect deep within your \"recovery partitions'! meaning, these's not turning back and you're royally screwed. Theres many more problems that can happen but I think you already get my point.GOALS: 1) Don't use your Main MS Account as an\" Adminitrator\" but instead \"standard\"  2) Create a secondary account called \"local account\" and set that up as the Administrator instead.Account Management: steps creating a local account(administrator) and MS Account(standard)Charms search: type\"control panel\" > \"User's Accounts and Family Safety\" > \"Remove User account\" > \" Add a new user in PC settings \" located at bottom of window > Bringing you to Metro > click \"add Account\" > \"Sign in without MS accout\" located at bottom of page > \"Local Accout\" > create new user name and PWYou have 2 options on Signing IN1) Microsoft account or 2) Local Account1) Create or sign in with your MAIN Microsoft Account. If you already an MS account or uses windows phones/ xbox live or Hotmail/live/MSN email address you can use these as well to link those services to 1 master MS Account.2) Create a Local Account. Thise secondary account will not connect to MS's ecosytem but only in your local computer. I identical to USERS login on Windows 7,Vista,XP etc.Once you've setup these two accounts, you must set each account type to: >Change ACCOUNT TYPE for Main MS Account to \"Standard\"Change ACCOUNT TYPE for 2ndary Local Account to \"Administrator\"Please do these steps, it only takes 5minutes.  Its a small price to pay considering, it may  potentially rescue your entire data from a completely erasing your data after sending it for repairs.__________________________________________________________________________Making Back ups/ EtcAnother tip is to make a recovery image.First install Setup all your programs , setup your custom settings, etcAfter personalizing your PC.  > Its time to Create a Recovery Image right after you've set everything up.  This image will allow you to revert back to this pc's state in time, and in perfect working order.Sometimes system recovery doesn't solve your problems so having secondary backup plan like Recovery Image is key.________________________________________________________________________Not optional, must practice these 3 regular computing habits.#1  (Install McAfee Antivirus, which is now free starting 2014, per Intel's 2014 Keynote at CES) or Paid programs such as Kaspersky Internet Security 2014  is the leading software in the market today. $50.  These programs scans your system automatically, so set it and forget it.#2  (Install MalwareBytes/free, scan your pc every month with this program or sooner when you feel like your system is sluggish or seeing webpages poping up that you didnt click)  Because this is a free software, as a user you must manually start the scaning process or by buying retail version you'll unlock the auto scan scheduler feature.#3  (Install Superantispyware/free, Scan pc every 2wks)Because this is a free software, as a user you must manually start the scaning process or by buying retail version you'll unlock the auto scan scheduler feature.Its ok skip a few scans between months, although not advisable, especially if your a heavy web surfing maniac spending 2-3 hrs daily websurfing not just facebooking.  But please dont go without using all 3 programs more than 5-8 Months in between scans.________________________________________________________________________Another way to avoid  spreading your personal information out there into the wild unknowingly is to un-google yourself.yes ladies and gents! google or yahoo especially yahoo LOL..... but google is key here.Microsoft sells Primarily Software.Apple sells Primarily HardwareGoogle sells neither, that's why their products are so CHEAP, once they suckered in their backdoor ridden ecosystem, Google Inc. sells Primarily Everything about YOU!_____________________________________________________________________________________________________Steps in upgrading from Windows 8 to Windows 8.1  (2-3hrs)Key here is to ensure your windows 8 is fully updated before upgrading to win8.1Therefore repeatedly \"check of updates\" on windowsHow to upgrade to windows 8.1 for dummies.Step 1: Go to Metro and not desktopStep 2: Start typing : \"Control Panel\"Step 3: Click \"Windows Update\" > \"Check for Update\"Step 4: install updatesStep 5: restart computerStep 6: Repeat step 1 -5 until result \"no more updates\"Step 7: Run HP Update client, install all updates from HP to ensure all drivers and bugfixes are updated.( or whichever OEM you may have, lenovo,dell, sony etc.)Step 8: Uninstall your Antivirus Software (important) then RESTART PCStep 9: Go to Windows Store and upgrade to 8.1Step 10: leave computer on for 2hrs as it upgrades.Step 11: Repeat Steps 1 - 7Step 12: if you're not a complete fool, 8.1 upgrade should be straight forward. \\After steps 1-8 ONLY THEN you should install WIndows 8.1 at the marketplace. Goodluck.(note: steps above removes a lot of failures users experience after 8.1 update)___________________________________________________________Not many want to shell out their dollars on Office 360  if all they intend of using is standard word processors.you can use a free web version of office calledBing.com search:  \"MS Office Web Apps\"just sign in with the same  MS Account user name used on your PC.", "Date": "January 30, 2014"}], "ProductInfo": {"Price": "$436.51", "Features": "Intel Celeron 1017U\n4 GB DDR3\n500 GB 5400 rpm Hard Drive\n11.6-Inch Screen\nWindows 8", "Name": "Acer Aspire NX.M8AAA.004;V5-131-2497 11.6-Inch Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/41DTW6g5p1L._SY300_.jpg", "ProductID": "B00GZB86MW"}}