{"Reviews": [{"Title": "Great notebook for the price", "Author": "Jeremy olmeda", "ReviewID": "RHN6VVWKO6KNT", "Overall": "5.0", "Content": "This is a great laptop for less then $450. It has a backlit keyboard, bluetooth connection, touchscreen, 500 gig hdd and 6 gigs of memory; you won't find another one with all these features at this price. Screen resolution is crisp and clear in different angles. Pretty fast boot up, Windows 8 needs some getting used too but its fairly easy.Only downfall is the battery but i always have it plugged so i doesnt matter.", "Date": "March 4, 2014"}, {"Title": "Acer Aspire is a win-win", "Author": "Susan Ronson", "ReviewID": "R2UBOPA4G3TI5M", "Overall": "5.0", "Content": "I am so happy with this laptop.  It is as fast as I need it to be and very user friendly.", "Date": "June 8, 2014"}, {"Title": "Very good value.", "Author": "Jon Russell", "ReviewID": "R2JSAT7JBS0IQR", "Overall": "5.0", "Content": "Great computer for the price. The lighted keyboard and touch screen are nice. Bought this one for my son and another one for my wife and they are both very happy with it.", "Date": "June 5, 2014"}, {"Title": "Good but Drawbacks", "Author": "Anne", "ReviewID": "R2VCGAGWHH6J3N", "Overall": "3.0", "Content": "Fun to use.  I have had to call Acer's tech service several times in the first month to upload printer drives,  I had to pay $149.00 to have malware removed and have to pay for tech support after 90 days.  This all diminishes the\"fun\" part.", "Date": "May 18, 2014"}, {"Title": "No", "Author": "Kali N Craig", "ReviewID": "RKMDT3MIR2I7E", "Overall": "3.0", "Content": "Sometimes I have to have it plugged in for it to turn on even after I let it charge and it'll stay on unplugged but for it to actually turn in I'll have to plug it in. It tells you to update to windows 8.1 but then says you can't. The java script cuts off. The camera is really bad.", "Date": "May 11, 2014"}, {"Title": "The fan is VERY noisy", "Author": "Ogi", "ReviewID": "R1S1AWGLKIOE0P", "Overall": "2.0", "Content": "I bought this at Microsoft store around December 2013.The fan runs almost all the time and it is very noisy.By comparison, I use 2 other laptops (Lenovo and Sony) regularly and they do not make ANY noise.", "Date": "April 22, 2014"}], "ProductInfo": {"Price": "$699.00", "Features": "windows 8 64-bit;3-cell Li-ion battery\nAMD Quad-Core Processor A6-1450M; card reader\n11.6' multi-touch HD LCDAMD Radeon  HD 8250\n6GB DDR3 Low Voltage Memory   500GB HDD\n802.11b/g/n&BT; Acer Crystal Eye HD webcam", "Name": "Acer Aspire V5-122p-0681 11.6\" Touchscreen Laptop - Quad Core 6gb 500gb Windows 8", "ImgURL": "http://ecx.images-amazon.com/images/I/31ujBIIHlEL._SX300_.jpg", "ProductID": "B00GB9NUXI"}}