{"Reviews": [{"Title": "Awesome Value", "Author": "Bob", "ReviewID": "R7NSZJW6YHU4Z", "Overall": "5.0", "Content": "The tablet-laptop hybrid was great value for its price. It is lightweight, runs Windows 8, and has a very long battery life.", "Date": "December 19, 2013"}, {"Title": "beautiful", "Author": "Alejandro Ahualli", "ReviewID": "R5JXEQJ22V4SC", "Overall": "5.0", "Content": "this Tablet is perfect for my job. And, i can read books, newspaper, and take pictures with his 8mpx camera", "Date": "January 30, 2014"}, {"Title": "Long battery life, slow processer, bad internet connection", "Author": "Jeff", "ReviewID": "R9231DFY4TKJY", "Overall": "2.0", "Content": "I love the battery life and always on technology on this tablet. I can leave it on for about 3-4 days without plugging it in and having it attached to the keyboard dock.The processor seems a little slow when I compare it to my intel core i5 laptop that I have been using for a few years even though they are formatted exactly the same. Opening apps can be time consuming and frustrating if you are used to a faster computer.The speakers are loud but I did notice a small issue with the headphone jack, it would only play if I pulled it out 1 groove on the headphone jack, if I pushed it in too far it would not recognize that the headphones were even plugged in.My biggest issue with the product was that I can only connect to a few networks, other networks can be seen but not have internet connection and worst of all many networks are not even recognized by the device even when set up manually. Even with the most recent drivers installed this was an issue. All other computers/tablets have no problem connecting and this poses a HUGE issue with this product and its limited memory. Most of the apps on the device save to a cloud, including microsoft office. This is needed because after the update to Windows 8.1, updates, and installing a word processor the remaining memory is 10 GB or less. That may be a lot of PDFs but not much as far as media is concerned.", "Date": "January 15, 2014"}, {"Title": "scammer", "Author": "xiaobing zheng", "ReviewID": "R21AJI635IX6K2", "Overall": "1.0", "Content": "take almost two week to receive that mini PC. after i open and used. is not the thing what i want,, and return it to them with priority mail, USPS tracking #9505521348114122000289 as you can see, and  seller respond is didn''t receive the \"item\",  won't refund the money back. .......which mean i lost $300, ....Just Don't Buy It.", "Date": "May 12, 2014"}, {"Title": "soso product maybe a new one", "Author": "rachel mays", "ReviewID": "R2XE0H00IGQHTZ", "Overall": "4.0", "Content": "just wasn't up to par of what I thought it would be.  not the seller who had anything to do with it ..jut my bad luck", "Date": "February 12, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Windows 8; Intel Atom Z2760 Dual Core Processor (1.5GHz/1.8GHz w/ Intel Burst); 2GB DDR2 memory;  32GB internal storage; Micro SD memory slot up to 32GB(SDHC 2.0 compatible) for additional storage.\n10.1\" HD LED-backlit multi-touch display (1366 x 768) resolution w/ wide viewing angle (up to 178°); high-brightness (350-nit): with integrated 5-Point multi-touch screen, supporting finger touch and image auto rotation; Intel Graphics Media Accelerator with 64MB of dedicated system memory\nDual High Definition Cameras - Front-Facing - 2MP HD Camera and Rear-Facing 8MP HD camera; Sensors: Gyroscope, E-Compass, Accelerometer, Ambient light sensor;\nHigh-Definition Audio;  Two Built-in Stereo Speakers; Integrated Digital Microphone;  Wireless: Acer InvilinkTM NplifyTM 802.11a/b/g/n Wi-Fi Certified;  Bluetooth  4.0 + HS; Micro-HDMI; Micro-USB (additional USB 2.0 port on a keyboard Dock); card reader.\nUSB keyboard dock included. Tablet: Up to 9 hours of battery life. Color: Silver", "Name": "Acer Iconia W510-1849 Intel Dual Core Processor w/ Intel Burst Technology 10.1-Inch HD LED Multi-Touch Display Dual HD Cameras HD Audio Wi-Fi Bluetooth 4.0+HS 32 GB Tablet with Keyboard Dock (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/51Zz5vU-a8L._SY300_.jpg", "ProductID": "B00GWP1JQ6"}}