{"Reviews": [{"Title": "A lot of great stuff but a few issues", "Author": "Steve W.", "ReviewID": "RXIIALQ4WVVBK", "Overall": "4.0", "Content": "I found this laptop at an awesome price on another site and just couldn't resist so I pulled the trigger. Apart from a few quirks, I am mostly happy with it.The biggest draw for me was the 3200-by-1800 screen resolution. As someone who loves photography, this resolution was very attractive. And I have not been disappointed. Pictures viewed on this reveal details I have never seen on any other screen, and I happen to have a few above retina smartphone and tablet screens. This screen resolution (3200-by-1800) is way above the retina MacBook screen resolutions (2560-by-1600 on the 13-inch MacBook Pro and 2880-by-1800 on the 15-inch MacBook Pro). Its RGBW pixel arrangement also means the screen is quite bright, though it has one drawback I will mention later. The overall result is that pictures and text are delightfully sharp. You will love reading text on this laptop, and you will find a new appreciation for some of your digital photos.This laptop also has a bunch of other attractive specs: a 4th generation (Haswell) Intel core-i5 processor, 8GB of RAM, and a 500GB hard-drive. After using it for a while, I found myself surprised at how fast it would boot up. I then learned from HP's website that in addition to the 500GB it also has a 24GB solid state drive, hence the zippy boot and shut-down times. At 4.66lb, it is heavier than the 3.77lb HP Touchsmart 11-e015nr ultrabook it is replacing but noticeably lighter than most laptops. It is still very portable, and way more powerful than the 11-e015nr. And then there's the 4G connectivity: with the included T-Mobile SIM I get 200 MB of data free every month for the life of the device, with the option to purchase more data as needed. Overall, this laptop performs very well.Now for the quirks: firstly, the display doesn't display the color yellow very well. It's more like a mustard yellow. However, this is only a problem when I need that perfect yellow, which is rarely. The other colors are displayed well. Secondly, the touch-pad is not the best, especially for right clicking. The touch-pad problems are however mitigated by the fact that the computer has a touchscreen, allowing you to simply touch the screen as contrasted to using the touch-pad. But this does not detract from the fact that HP could and should have done a better job with this. Last is a problem that has little to do with HP or this laptop in particular: some software does not have optimizations for that awesome 3200-by-1800 resolution, the result being that every once in a while you come across text that appears very small. I anticipate this will change as this screen resolution and higher become more common.In conclusion, this laptop isn't perfect but it does have a lot going for it. If you can live with the occasional mustard-yellow in the place of bright yellow, the touch-pad quirks, and the occasional small print, you will find a lot to like about it, especially that high resolution screen.", "Date": "May 19, 2014"}, {"Title": "HP Touchsmmart Envy Rocks", "Author": "Miller", "ReviewID": "R1MSDP0W3QHEUC", "Overall": "5.0", "Content": "Awesome laptop with great screen and power!! A true winner here. Very well made too!! Come with T-Mobile lifetime 4g data and has all the ports you need to connect your life....EXCELLENT 100% HAPPY.", "Date": "May 8, 2014"}, {"Title": "HP ENVY TouchSmart 14-k110nr Sleekbook", "Author": "emily", "ReviewID": "R17QPN24M6NVOJ", "Overall": "1.0", "Content": "Have you ever been on the verge of lobbing something out the window?! That’s sure how I feel about the “laptop” known formally as the “HP ENVY TouchSmart 14-k110nr Sleekbook”. I put the name in quotations because it sounds fancy and highfalutin, but there is nothing sleek or smart about this product. My mother is the one who actually made the mistake of purchasing this piece, from the local Best Buy. She was sold on the Geek squad Insurance guarantee, so that if there are any problems, you can take the laptop into the store and the professionals will fix it. However, I enjoy a more lazy man’s approach with technology; if it is bought there shouldn’t be any problems with it. And I don’t want to have to pack up the laptop and charger and drive all the way down to Best Buy to have some quack delete all my files. Frankly, I don’t trust this “insurance guarantee. “As far as complaints about the physical laptop, first of all, I have broken now three canvas bags over the course of 6 months because this thing is so bulky that it has broken down the seams until they snapped. Its ridiculous size makes this crock very difficult to grip, and if you accidentally drop it, the screen does not hold up. God forbid you accidentally step on it, the screen will get an ugly crack going right down the middle. The computer will still work, but it might get even slower, if that was possible.  And if you’re like me and like to sip coffee while working on your laptop, accidentally spilling even a droplet beside the keyboard will literally melt a hole. This thing does not hold up to anything. It is thick, cumbersome, and heavy in weight, as well as awkward to carry; definitely not portable. I now leave this load in my dorm room because I can’t afford to buy a another new bag, and also I’ll save my shoulder the dire restraint. The cord is also a hassle because that is also extremely thick and burdensome, so if you are trying to stuff it in your bag along with the laptop, it is a tight squeeze and you will risk the bag breaking. Not to mention, the charger is iffy; it only works when it wants to. I need a laptop that is light weight and DURABLE, that won’t break my bags, with a no-nonsense internet connection.Once you actually get the thing to log on, waiting around for twenty minutes to get the internet to start up is arguably more agonizing than waiting in a dentist lobby. Once the internet finally gets going, it only works in fits and bursts. Any time the internet is running smoothly for more than twenty minutes, I feel obligated to binge on internet usage because I don’t know when it’s going to up and running again.  As far as features, I could not believe this sad piece of technology was missing a very crucial and expected addition, that is, a disk player. None. Couldn’t believe it. So that means ya’ can’t burn OR download CDs, and you have to listen to your music via YouTube because the iTunes is iffy as well, especially if you don’t know your apple password. Also, I just remembered that the sound quality is mezza-mezza; the audio does not get loud enough to drown out the sound of me singing along with my music. I like to have the sound of the music playing to be louder than my own voice. I have a beautiful voice, but if I wanted to listen to it I would sing by myself.Overall, I would just flat out say this product does NOT deliver, and would advise any practical person to do themselves a favor and not buy this obscenity. I cannot, in good conscience, recommend this product to anyone.", "Date": "April 23, 2014"}], "ProductInfo": {"Price": "$649.99", "Features": "14-inch Quad HD+ touchscreen 3200 x 1800\nBeats Audio with dual speakers and a subwoofer\nIntel Core i5-4200U 1.60 GHz with Turbo Boost Technology up to 2.60 GHz\n500GB 5400 RPM HDD | 8GB DDR3L 1600 MHz | Intel HD Graphics 4400 with shared graphics memory |\n2 USB 3.0 (1 charge) • 1 USB 2.0 • HDMI • Headphone output/Microphone input combo • SIM card slot for mobile broadband • RJ-45 (10/100/1000)", "Name": "HP ENVY TouchSmart 14-k110nr Sleekbook 4G", "ImgURL": "http://ecx.images-amazon.com/images/I/411f8F8yDkL._SX300_.jpg", "ProductID": "B00GUX2IWO"}}