{"Reviews": [{"Title": "Super Fast, Zero Crapware, Great TouchPad", "Author": "TechGeek", "ReviewID": "R26KCWGM7Z15K", "Overall": "5.0", "Content": "Before landing my hand on Asus, I bought a brand new HP. The Laptop HDD Crashed on Day 2. I window shopped for Sony, Dell, Lenovo but none were satisfying.Than I overheard a BB Tech recommending Asus to someone and as you might be thinking I had a same thought 'Why Asus of all the Laptops?' HERE IS WHY1. Great Keyboard2. 2GB Graphics, 8GB RAM, 1 TB HDD, Bang & Olufsen (WOW)!!3. Super fast with almost no Crapware like HP, Lenovo and DELL4. Has 3.0 USB, HDMI, Cd-ROM, FULL HDYes. THis is not the lightest laptop, but if you looking for a lightweight machine, go buy a Ultrabook with High cost and low specs. This Machine means business.GAMERS - This machine comes with a Woofer which takes the sound to another level.Business Users - Backlit Keyboard, Good Touch Pad, Touch Screen, Small but powerful adapterNormal Users - Fast Surfing, FULL HD and tons of pre-loaded games.Great Work Asus!!", "Date": "February 20, 2014"}, {"Title": "Great computer!!", "Author": "Nicholas Bryson", "ReviewID": "R1GUMOSJEC7UVW", "Overall": "5.0", "Content": "This computer is very fast and works great. The display is amazing and everything is so sharp. The con is ASUS used a 5400 rpm HDD and is slow, but I replaced mine with a SSD anyway. I also took out the DVD drive and put a caddy in so I can have 2 HDD installed.If your looking for a great computer, look no farther!!***UPDATE*** After having the laptop for over 4 months I love the laptop! It is running great and one of the best laptops I think I have ever used. On the other hand ASUS has the worst Product Support known to man. If you have any trouble with your laptop it will have to be sent to them and repaired then shipped back! They offer NO replacement parts they say \"We understand nick but we cannot send any parts to you\". Its just the bezel on the DVD Drive and uses 4 clips to stay in and is about 3 in x 1/2 in. So the computer is great just hope NOTHING goes wrong with it!! This is the part I was asking for [...]. Remember its not always about how great the product, but how great the customer support is also!! I just thought I should let everyone know my experience.", "Date": "May 13, 2014"}, {"Title": "Love this computer", "Author": "Jo", "ReviewID": "R2IWB59YMITALC", "Overall": "5.0", "Content": "After a horrible customer service experience with Dell, I was ready to try something different. Consumer Reports gave the ASUS a high score and I trust their judgement! I love this computer. It has the touch screen, backlit keyboard, and the overall appearance is very nice and speaks quality. They have put a matte finish on this computer so it doesn't show the fingerprints quite so badly as the previous \"shiny\" laptop that I had. For the money, this is an awesome computer and is performing above my expectations.", "Date": "April 24, 2014"}, {"Title": "Does not maintain wireless connection", "Author": "M. Hayden", "ReviewID": "R3I36XHV62ZJ6", "Overall": "1.0", "Content": "I have too many problems with this laptop to list so I'll stick to the worst one: does not maintain wireless connection. I've had problem after problem with this issue. Each time I've called tech support I've gotten a different series of steps to follow to attempt to resolve the problem. Today was the final straw for me when the tech support representative told me to hard connect  to try and get around the issue.In summary, do not buy this laptop unless you enjoy working on wireless connection problems .", "Date": "May 23, 2014"}, {"Title": "Great computer.", "Author": "William Sackett", "ReviewID": "R49JTGS5KF6H3", "Overall": "5.0", "Content": "Very easy to use. Fast. Good functions and relatively easy to navigate. I'd recommend to anyone in the market for a laptop.", "Date": "March 20, 2014"}, {"Title": "SO NICE! PERFECT!", "Author": "Eric Brouse", "ReviewID": "R21T8OK2ODX7RJ", "Overall": "5.0", "Content": "This computer is the bomb dot com. Would recommend it to anyone in the market looking for a nice laptop that has speed and quality!!", "Date": "April 12, 2014"}, {"Title": "Asus Q550LF", "Author": "\"R\"men.", "ReviewID": "R3GXLOZ692FIJR", "Overall": "1.0", "Content": "Purchased a brand new ASUS Q550LF from the Best Buy and paid over $1000 for it. Very disappointed. I  had to return it back to manufacturer for repair of the camera and I got  it back without any changes. Now it's acting up again, switching programs randomly and just frustrated. Called the company and they said I need to return it again for repairs and if they can't repair it they may send me a new one.I don't recommend ASUS at all due to it's price and quality.", "Date": "April 22, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "4th Gen Intel CoreTM i7-4500U mobile processor\nNVIDIA GT 745M graphics 2GB dedicated video Memory\n1TB hard drive\n15.6\" Full HD touch screen 1920 x 1080 Resolution\n3 USB 3.0 ports", "Name": "ASUS Q550LF-BBI7T07 15.6\" Touch Screen 8GB Memory 1TB Hard Drive", "ImgURL": "http://ecx.images-amazon.com/images/I/31vinRZMU4L.jpg", "ProductID": "B00GDHUZYK"}}