{"Reviews": [{"Title": "Great machine but not without it's flaws", "Author": "A. Hammer", "ReviewID": "R4BVQFY01GUL3", "Overall": "4.0", "Content": "I purchased this laptop to replace a 4 year old Samsung R580 (i5 version) because the touchpad had broken.  I wanted a laptop that was thinner and lighter but still has a number pad to take to class.  I also wanted a dedicated graphics card and a 1080p screen for light gaming and more screen real estate for easier debugging in eclipse(it's not easy to do on a 1366x768 screen).Hard Disk Drive:I've had this machine for a little over two weeks now.  It comes with a 500GB Hybrid drive with a 16GB SSD cache.  Other similar acer models some with a standard hard drive and a physically separate 24GB mSata SSD.  I was unsure when buying this laptop on the hard drive setup, as the information about this model on the web is pretty scarce.  I was glad to find both mSata and Sata III drive bays inside the case.I purchased a 240GB Crucial m500 mSata to use as the main drive with Windows installed and re-used a 120GB Crucial m4 Sata drive to replace the 5400rpm Hybrid Drive.  The speed difference was noticeable, especially on reboots. Note: The mSata port is not in use out of the box, so if you add a drive to that port, you will need to find your own screw to hold the drive in place(The screws that come with the Crucial m500 are too small).Screen:Moving to a 1080p screen from a 1366x768 is a huge difference, and the IPS panel looks great from a lot of angles. The touchscreen is nice, but trying to use it on a 15.6 inch screen with 1080p is really difficult.  Sure, navigating the Metro UI is easy, but trying to browse the web and accurately click links is practically impossible.  My biggest issue with the screen: when trying to flip open the screen, my screen is actually separating from the case.  There is a glue that holds the screen to the case, but mine does not hold.  I may super glue it, but it is a definite lapse in build quality.Graphics:I upgraded from a nVidia 310m to a nVidia 750m, this is a huge improvement.  I am able to play Civilization V at 1080p and high settings with little issue.  This laptop uses nVidia's optimus technology which automatically switches between the Intel HD4400 and the 750m when running games.  There is also an option to manually select which graphics processor to use on a per program basis.  The laptop can get pretty warm when under intense load, so make sure it ventilated.Battery:The battery appears to be easily replaceable, should it be necessary.  I haven't done a full battery test yet but after 4 hours of web browsing, the battery was reporting 58% life left.  I have removed the mechanical drive, so my battery life is going to be a little better than what you would get out of the box (the m500 uses 1.15watts at idle, whereas mechanical drives use ~5-9 watts at idle).Pre-installed programs/Bloatware:Acer has provided a lot of extra programs on this laptop, some of them are useful, like the acer backup utility.  Most of them are annoying trials of useless programs and of course McAfee.  I spent about 2.5 hours removing garbage.  I recommend you save yourself the headache and just install a clean version of Windows.Others:There is absolutely no indicators for caps lock, num lock, and scroll lock, no lights, no on screen confirmations, nothing.  Very annoying.The backlit keyboard is nice but is very faint in some spots.Pros:Beautiful IPS screenAluminum-like case shows less fingerprintsBacklit KeyboardDedicated graphics cardLong Power cableBattery looks easily replaceableCons:Insane amount of bloatwareTouchpad is off-center, which makes it really difficult to select text or click and dragNo notifications for caps lock, num lock, scroll lock, or touchpad on/offOnly one RAM slotScreen is easily separated from the case(very weak glue)Overall:3.5 stars.", "Date": "March 4, 2014"}, {"Title": "Best I could find for under $1000", "Author": "David", "ReviewID": "R23X4FT1EHQ331", "Overall": "5.0", "Content": "This laptop is all about having your cake and eating it too.Why I bought it:-1920x1080 resolution screen-Haswell processor (4th Gen I5)-Acer brand, less weird feature implementation (in my opinion), and less unreliable than many other brands according to Consumer Reports.-Price, epic value for what you get.My user experience so far after 2 months:-Touch pad works great now that I'm use to it. I hardly ever press it down as a button since it requires a lot of pressure.  I just swipe around and gently tap to click like if it were a smart phone touch sensor. Do NOT mess with the touchpad drivers.  I tried to install the touchpad drivers on the Acer Support website, and each one ruined the original feel, and I could not recover the original ease of use through changing the settings.  I had to do a system restore.  I hope I remember to backup this driver.-Touch screen works great, though I hardly ever use it.-Keyboard is alright.  I am getting use to it.  It requires tapping each key just a bit harder than on my desktop keyboards, HP and Logitech.  The keys don't like it when you hit them on edge instead of applying downward pressure.  I'm sure I'll adapt to this just fine.-Backlit keyboard works fine.-I have no experience yet with running graphics-intense apps, so I cannot comment on the 750M graphics card or how well auto switching works or whether it has ever switched at all since it doesn't notify you.-Speakers work as well as any laptop is ever going to.  Much better sound than any other laptop I listened to at MicroCenter, even better than the Asus Bang and Olufsen speakers.-Windows 8 works fine once you watch a couple youtube videos on how to use it.  You can download apps that make it look like Windows 7 if you have no interest or capacity in keeping current with the evolution of the MS OS.-Acer bloatware... there are many Acer apps, I'm slowly uninstalling them one by one as I learn what each one does.  They're not really bothersome so I forget they're there most of the time.  It took some time at setup to default to my preferred virus scanner (Windows Defender) and other things, and now it's working fine for me.Summary on ergonomics:A Macbook touchpad and keyboard is going to work better than this or anything else, no question.  But for just $1000 and being able to use Windows, this works well enough.  I don't think keyboard or touchpad function is going to get meaningfully better under the banner of Windows machines.  You might have to buy a Mac to get the best.Other reviews on Acer V5 and V7 laptops cover the other flaws with the machine, such as low profile small power button, no indicators of whether NumLock or CapsLock are on (though it's very easy to figure it out).", "Date": "April 17, 2014"}, {"Title": "A great leap from an old PC to this Ultrabook powerhouse", "Author": "VENANCIA GOMEZ N.", "ReviewID": "R16PFDRWEJZ2GT", "Overall": "4.0", "Content": "I'm happy with this ultrabook, I use it for work, school and mild LoL-GamingI don't like two thinks about it:1) The plastic case of the screen is very flimsy, you could crack it if you're not gentle while open it.2) The insane amount of bloatware that acer installed on the machine is a total lack of respect for their costumers.I would recommend this ultrabook, and I'd have rated it with 5 stars if it wasn't for all that annoying bloatware.A fresh windows install is advised.", "Date": "April 28, 2014"}, {"Title": "Poor customer service & computer", "Author": "Alberto", "ReviewID": "R182DQMNGLKJ2R", "Overall": "1.0", "Content": "After my crappy ASUS (they also suck) broke down after 1.5 years, I had to buy a computer for college.Luckily, after 3 months of normal use I finished school just in time to start having problems. The S****y laptop started having key and touchpad issues; so I called Acer customer service and they told me to ship the computer to their repair center to take a look at it.I didn't want to be without my computer for 2+ weeks so I decided to put up with it. Theeeen, the computer just died and wouldn't charge. I was sooooo mad, but I didn't want to Shell out another $900 for a computer so I decided to drive 2hrs to their repair center in TX.They fixed it in 2 days! Woohoo, right...nope, wrong!I get home and power it on and the computer wont boot, saying that there was not device to boot?????More pissed offness from me, so I decided to call the repair center back and they told me to call customer service again?!!!!!Do not, buy Acer unless you want to risk going through the frustrating issues I went through...I mean, imagine if this had happened during finals, and also I invest online, so thankfully I didn't have any important trades to execute...This could have cost me more tan $900 and gas money...not to mention my timeWould give it 0 stars if I could", "Date": "March 6, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00H7WF21G"}}