{"Reviews": [{"Title": "Disappointing Product.", "Author": "Amazon Customer", "ReviewID": "R2Z9L97WVV7QND", "Overall": "2.0", "Content": "This brand new, newer model laptop seems almost defective. The keys are randomly unresponsive which causes CONSTANT mistyping and subsequent manual correction. This might be due to the keys being way more shallow, if you will, than even other HP Pavilion laptops. In addition to this, after only a few days of normal use it is booting slowly. If you can afford a more expensive machine with this screen size and specs I definitely recommend you get it and avoid this HP Pavilion 17\".Update: I couldn't stand using this laptop so it has been returned for a refund. DO NOT BUY THIS LAPTOP! Or give it a try if you must but be prepared to have to return it (unless mine was just defective).", "Date": "April 10, 2014"}, {"Title": "Top of the line PC", "Author": "John S.", "ReviewID": "R3LT8MVV3TDZAT", "Overall": "5.0", "Content": "12 GB 1TB Hard drive what more could you ask for big screen and to me HP has the best customer service ever.I also have it to where if something does go wrong they will send a tech to my home to make the repair.", "Date": "June 5, 2014"}, {"Title": "Great System.", "Author": "Patrick Westover", "ReviewID": "R3O75B3CARUB86", "Overall": "5.0", "Content": "This is a Great Laptop. Big screen with crisp clear picture. It is very fast and I havnt had any of the problems I saw others have. It works great. The only thing I would have liked to see different is built in Bluetooth. But i bought the usb bluetooth adapter for about 8 bucks and it works great. I would recommend this to anyone wanting a fast every day use laptop.", "Date": "June 3, 2014"}], "ProductInfo": {"Price": "$899.99", "Features": "Genuine Windows 8.1, AMD Quad-Core A10-5750M APU with Radeon HD 8650G Graphics (3.5 GHz, 4 MB cache)\nAMD Radeon HD 8650M/8670M Dual GPU (1 GB DDR3 dedicated)\n12GB DDR3 RAM, 1 TB 5400 rpm SATA hard drive, 802.11b/g/n\n17.3\" diagonal HD+ BrightView LED-backlit (1600 x 900), DTS Sound+\nSuperMulti DVD burner, HP TrueVision HD Webcam (front-facing) with integrated digital microphone", "Name": "HP Pavilion 17-e171nr Notebook Laptop PC AMD Quad-Core A10-5750M, 12GB RAM, 1TB HD", "ImgURL": "http://ecx.images-amazon.com/images/I/41jhVhM%2BeyL._SY300_.jpg", "ProductID": "B00H2SZ468"}}