{"Reviews": [{"Title": "been waiting for this for a long time, thank you Amazon Canada", "Author": "MC Fisher", "ReviewID": "R1RQYOBO737NS5", "Overall": "5.0", "Content": "I had a Transformer TF300 and used it all the time, traveling and at home. Once I heard this was coming out, it piqued my interest. I like Asus and need a new portable Windows computer and use Android like there is no tomorrow, this is a no-brainer. First off, two points:1) I bought this for under $1000 on Amazon.ca (Canada), I live in the US and couldn't wait for the US release so I logged into Amazon.ca only to find that my Amazon.com login worked and it was cheaper. Sold.2) You can make this much faster by installing a SSD in it, it boots up in 7 seconds now compared to 40, I bought a Samsung 840 EVO 250GB, cloned with the Samsung software, and swapped it out. Another reviewer stated you can not upgrade the HDD, he was mistaken.So, on to the review. With the faster SSD installed, the Windows computer works great, not as fast as my desktop, but it does what I want. I even ripped and converted a Blu ray with an external BD drive just to test it, it handled it fine. The keyboard is a small, I bought the bilingual keyboard from Canada, and the key layout is a little odd (shift keys, enter key).The Android tablet is great. I had the TF300 so this is just like a bigger, more solid, faster, higher definition version of it. I like the metal build as compared to my plastic TF300, it is heavier, but not much. I would have liked to have gotten the I7-4500U instead of the I5-4200U, but it is not worth it to pay a lot more. Look at the two CPUs compared online if you are interested, they both have the same integrated graphics and don't differ in many areas.If you are interested in upgrading the HDD, look up Transformer Book Trio SSD online and there are pictures to help out. There are a bunch of torque screws and two under the rear rubber feet. After they are removed, you have to pop the bottom off, prying the back center portion off the computer, mine was a pain to pop off. After that, unscrew the HDD, remove the tray, unscrew the tray, switch drives, and reverse the steps. Oh, backup the HDD to the SSD first using the Samsung software and a USB to Sata connector.Enjoy", "Date": "December 30, 2013"}, {"Title": "ASUS TRIO - Great Concept but the product falls short", "Author": "Brian Williams", "ReviewID": "R1JAYUWMIJGZNB", "Overall": "2.0", "Content": "This computer/concept has so much potential but the product falls short.Start up time was horrific. The screen, when docked, flickered and it would switch from Windows 8 to Android by itself.The computer to \"monitor\" uses micro ports, which required several trips to the computer store to find a correct adapter as it turns out the power port is inaccessible when a conventional connector is used. (Basically, the flaw in the design is the computer/keyboard setup.)The only good part of this set up was the tablet, and it was excellent. If I only had need of a tablet I would have given it five stars. But I needed a reliable system and this wasn't it.I sent it back and would not recommend it until ASUS figures out how to make it less buggy.", "Date": "February 4, 2014"}, {"Title": "So far my all time favority Laptop", "Author": "Amazon Customer", "ReviewID": "RO2UFX2PNG1YY", "Overall": "5.0", "Content": "Fabulous PC/Tablet. I am thrilled with the versatility and performance. I run lots of high end programs that are very system demanding and this I7 handles it fine. I did replace the hard drive with an SSD drive, which I have no idea why Asus would put a hard drive in anything let alone in a 2 in 1 like this.", "Date": "March 29, 2014"}, {"Title": "Finally got it", "Author": "Ryan Morris", "ReviewID": "R29XANHDPW0UV8", "Overall": "5.0", "Content": "I have been watching this item since it Asus announced it. I didn't want to wait for the US release so I saved my money and ordered it from Amazon. When it first arrived I thought it was defective. I couldn't get the screen to turn on and the mouse pad didn't work. Turns out I didn't have the tablet powered on which is why I didn't have a screen in Windows mode. I updated the driver for the mouse pad and now it works amazing. I can easily edit documents on the tablet and save them to the pc base without connecting the two and visa versa. Downloaded an app so I can use the tablet as a mouse and keyboard for the pc base which is hooked up to my tv. I haven't upgraded to an ssd but I don't think it's necceasary. It does take a second to boot up but not too long, unless you are accustomed to the ultra book boot times. The more I use the trio the more I love it. I have noticed some apps are incompatible with the tablet, but hopefully they will fix it in the future. I would definitely recommend the trio to my friends", "Date": "March 14, 2014"}, {"Title": "Efficient", "Author": "Guilherme Sudbrack", "ReviewID": "RUVUJV8UDVRIW", "Overall": "3.0", "Content": "It's a good computer, with a great power processor.However it's thickness added with the normal RAM makes it a just one more notebook.Of course it's ability to change to a tablet, and the dual OS is great, but not worthy to it's weigh and price.", "Date": "May 27, 2014"}, {"Title": "Excellent Device", "Author": "Mike G.", "ReviewID": "RHOW1LS6N2CUI", "Overall": "5.0", "Content": "Best of both worlds.  It's a powerful PC when you need it, and powerful laptop when traveling and a great Android tablet to boot!  Three in one, all at the same time!", "Date": "May 18, 2014"}, {"Title": "doesn't work, can't get it fixed", "Author": "Amazon Customer", "ReviewID": "RQVRE6FGVH3MO", "Overall": "1.0", "Content": "Great idea, but button to switch doesn't work, tablet shorts out screen and bricks it.Sent it back to ASUS twice, they can't fix it, and replaced tablet with someone else's apps on it.  Won't give me a refund.", "Date": "February 7, 2014"}, {"Title": "I love it but ...", "Author": "LA", "ReviewID": "R1JAZP1ECUNQTH", "Overall": "5.0", "Content": "Unfortunately I had to return it due to a manufacturing defect.  Since I was going out of town for a few months I did not have time to order a new one.", "Date": "February 4, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00H7WF6KI"}}