{"Reviews": [{"Title": "This Dell Inspiron has everything you will need from a laptop", "Author": "Christopher J. Cowen", "ReviewID": "R1JKTTHZORGQON", "Overall": "5.0", "Content": "Dell Inspiron i17RV-3640BLK 17.3-Inch Laptop is a great laptop for under $600 and free 2-day shipping for Amazon Prime members. I was in the market for a great laptop and this one definitely fits the bill. This laptop is lightweight and thinner than previous versions of the Dell Inspiron. Once you boot up this device you will notice right away the sharp images this laptop can display. The screen is large (17.3\") and will allow you to do anything you could do on a desktop. The screen displays at 900p (1600 x 900 ) HD. This laptop is filled with many more great features. I have listed a few that I felt were important for you to know before making a purchase. They are as follows:* Processor: 1.7 GHz Core i3-4010U* Display: 17.3 inch LED Backlit Display (The screen is crystal clear, on par with any TV out there)* Memory (RAM): 4 GB DDR3* Storage (hard drive): 500 GB (More than enough space)* Optical Drive: Tray load DVD DriveAgain I think you will love this laptop like I do and I would definitely recommend it.Thank you for reading my review, if you have any questions feel free to email me, I would be happy to help you with any questions you have.", "Date": "February 20, 2014"}, {"Title": "not happy!!!!", "Author": "evelyn  fosdyck", "ReviewID": "R2K8H9I1Z5WE6Y", "Overall": "2.0", "Content": "i would not recommend this computer if you want wifi capabilty. I spend 3 hours on phone with dell only to be told it didn't have WiFi  installed on hard drive. Laptop isn't very useful if you can't connect to WiFi.", "Date": "May 2, 2014"}, {"Title": "Excellent Device", "Author": "kenneth sanders", "ReviewID": "RR37Y6T7T157Y", "Overall": "5.0", "Content": "This a top notch laptop that is nicely sleek and user friendly. It doesn't have unnecessary extras that tends to clutter the hard drive and slow the machine down. I recommend it for students, especially.", "Date": "May 5, 2014"}, {"Title": "Great computer", "Author": "Bookworm2", "ReviewID": "R3BGF3016PFTGH", "Overall": "5.0", "Content": "This is a nice computer that I'm enjoying. Since, I bought it, I've had no problems or complaints at all.", "Date": "May 4, 2014"}, {"Title": "Dell Inspiron 17.3 inch", "Author": "John E Callahan", "ReviewID": "R2R3SR1PLYP60W", "Overall": "5.0", "Content": "Perfect size for me as I like a large keyboard. Hope it lasts as long as my Dell Desktop -14 years.", "Date": "May 2, 2014"}, {"Title": "Sound died at 4 weeks", "Author": "Ms.Donna", "ReviewID": "R2E8DTJZ84FOH4", "Overall": "3.0", "Content": "We liked the display and the processor on this Dell. Windows 8 is workable but not the greatest on this machine because you do not have a touch screen.We exchanged the machine today because the sound quit working and will only play static, otherwise the machine has been fine. Battery life is good. Keyboard is good. Network connection is good.  Great service from Amazon on exchanging the machine. We are very happy that we bought from them instead of Dell direct.", "Date": "May 27, 2014"}, {"Title": "Love my Dell Inspiron 17.3 inche laptop", "Author": "Chris G", "ReviewID": "R1KRFQV3M6TK2T", "Overall": "5.0", "Content": "This is my second Dell Inspiron 17.3 inch laptop. I chose this one because I was very happy with my first one. Windows 8 took a little while to get the hang of it but I'm there.", "Date": "May 26, 2014"}, {"Title": "My firtst Laptop", "Author": "joni swanson", "ReviewID": "R2UUOMDHDGFX3Q", "Overall": "5.0", "Content": "love it.  the size is perfect.  Windows 8 is interesting but i'm learning.  It's everything I wanted it to be and more", "Date": "May 25, 2014"}, {"Title": "Excellent Laptop for the Money", "Author": "BZ001", "ReviewID": "R3J89A4TO28693", "Overall": "5.0", "Content": "This laptop worked perfectly right out of the box. Added the updates and was off and running. The computer is fast compared to my old Windows XP laptop. Got to love the large 17.3 inch display.", "Date": "May 20, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HRLSQYM"}}