{"Reviews": [], "ProductInfo": {"Price": "Unavailable", "Features": "Power Battery Type Lithium Ion  Processor Processor Intel Core i3 380M (2.4 GHz)  Memory Installed Memory 6 GB\nHard Drive Hard Drive 1 TB 5400 RPM Disk Drive Optical Drive Type DVD+RW\nDisplay Display Size 15.6\" Video Card Intel HD  Connections Ports RJ-45 (NIC)  Networking Networking Type Integrated 10/100 Network Card, Integrated Wireless LAN Data Link Protocol Ethernet, Fast Ethernet   ;Dimensions Depth 10.24 in. Height 1.36 in. Width 14.8 in.\nShipping  PayPal payments received by 12:00pm PST on business days will be shipped the same day. Payments received on weekends, holidays or after 12:00pm PST will ship the following business day.  To bid in our auctions, or purchase an item buy it now, we do require you to have a Paypal account.  We do not offer local pick-up.  All packages that are returned to us by USPS as \"unable to  deliverable\" are subject to an additional shipping charge to reship the item.  We only ship to USPS-validated addresses. We do not ship to Freight forwarders.  It is the Buyers responsibility to make sure the address they send with their payment is their current and correct address. We are not responsible for packages shipping to the incorrect address. The shipping feature we use automatically pulls the shipping address information into the system, so please double check that all of your information is correct before sending your payment.\nTo purchase a Buy It Now item, we require you to have a PayPal account or credit card, No other forms of payment will be accepted. Immediate Payment may be required.  Payments are due within 2 days of the end of auction date. If payment is not received, an unpaid item case will be opened. If payment is not submitted by the sixth day, the item will be relisted and an unpaid item claim will be reported. Once this unpaid item claim has closed, the item is no longer available to purchase and we are no longer able to accept payment.  We will not provide cancellations on transactions for any reason. Please be sure to read the entire description and understand what you are bidding on prior to placing a bid or buying an available item.  We do not sell products to resellers; any purchases made by a reseller are subject to cancellation at our discretion.  Residents of WA state will be charged tax according to the state they reside in:  Washington State residents must add 9.5% sales tax to the auction total", "Name": "Dell Inspiron 15-3521 Core i3-3217U 1.8GHz 6GB 1TB DVD+/-RW 15.6\" Win8 64. Black EXCELLENT DELL INSP 15-3521 Ci3 1.8 6GB 1TB WIN8 (black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41QzAGWcRsL._SX300_.jpg", "ProductID": "B00HYR5HL4"}}