{"Reviews": [{"Title": "it is a great laptop for the price", "Author": "Kyle Miller", "ReviewID": "RQL6L6FUVALMC", "Overall": "5.0", "Content": "Pros:an i7 processor that goes up to 3.0ghz.8gb of ram.750gb HDD.Nvidia geforce gt 740m with 2gb of video memory.Cons:Windows 8The only thing that is bad is Windows 8 but you learn to get used to it, but other that it is good laptop. I use it for school and for gaming. This laptop can run steam games, like half-life 2 and garry's mod, pretty well.", "Date": "April 2, 2014"}, {"Title": "$749.00 price with all the hardware I could ask for.", "Author": "Ownleewun", "ReviewID": "R3GFLIODJSOSQS", "Overall": "5.0", "Content": "I an above average pc user , student, and gamer. I want to buy a new laptop due to giving my pc to my mother. So, I was doing research for a few months to see what was out there and found this laptop among a few that caught my eye. I bought a  ASUS X550CA-DB91 15.6-Inch Laptop for my sister in December for Christmas which is the same case with different hardware for $400.00. So, I already knew what I was getting as far as awkward keyboard with sticky spacebar and overly huge track pad with awkwardly placed clickers. But, to be honest those are minor things for me that I can live with.The computer looks like a computer that would cost in the $1500 range. It is aesthetically pleasing the naked eye. But the true beauty lies within with a I7 processor, 2gb 740m ddr3 video card, 8gb ram, and 750 5400rpm hard drive. I would've preferred at least a 7200rpm hard drive but I can't argue at this price for getting everything else right. Also, upgrading to a flash drive in the future and installing windows 7 might be something I do later on. But, I won't until the 1 year accidental warranty runs out a year from the purchase date. Another upgrade I might do is increase total memory to 12gb which is what I am told through crucial is the highest I could upgrade I to would be.Alright, so let me just give you some advice about windows 8 that I found to be useful. One, make sure all of your media files are going to auto play from windows media player, Microsoft photo viewer, etc. Why? to feel more like windows 7 and also so you don't get confused and think you have to purchase an app for that.Another thing I would like to mention is that right of the bat I noticed that the laptop was running on the integrated video card. I needed to install the new drivers in order for it to run on the 740m. And, then I set the card to run every program with the 740m by default. Setting the 740m as your video card will lower your battery life.I have installed World of Warcraft on the computer and have not fully played it yet. But, thus far have experienced 70-90 fps in Stormwind city.I will update I have only been on the laptop for about 10 hours so far.", "Date": "April 26, 2014"}, {"Title": "A pretty good choice", "Author": "Bianca Silva Cordeiro", "ReviewID": "RF46QUH3ZMXG1", "Overall": "5.0", "Content": "I have bought this PC 2 weeks ago and I am really in love with it. It has a beautiful design and also works perfectly for everything I need. I haven't had any problems so far, but still it was a little time ago.", "Date": "April 14, 2014"}, {"Title": "Quite pleased, but.........", "Author": "Linda L. Risinger \"Booklady\"", "ReviewID": "RXMJHPDZNAOA", "Overall": "4.0", "Content": "Overall, I'm quite pleased with this laptop.  Works great, fast, more HD space than I'll ever use, good sound. However, I don't care for the combination headphone/microphone port....with earbuds I can hear myself breathing.....very distracting & annoying. Not so noticeable with my Sony light-weight headphones.  Also I wish the charging port was on the right side rather than the left, but if my outlet was on that side maybe I wouldn't care. Except for those two minor things I would definitely recommend this laptop to a friend.", "Date": "June 8, 2014"}, {"Title": "Performs well for its price range", "Author": "Chris", "ReviewID": "R1CBKPGPKHF2H0", "Overall": "4.0", "Content": "I tested this on Titanfall at 1366x768, but everything had to be on the lowest settings for 30 - 60 fps. The heavy fps fluctuation depended on the map, if it was a firefight, and how many Titans were on screen.5400 rpm hdd is very noticeable. Expect delays when doing certain tasks.When I first did windows update, it needed 100 updates. For me, this took 2 and half hours to download and install—only for it fail to configure which then reverted all 100 of them. Alright, I guess I shouldn’t have tried to shove all 100 at once so I did 65 updates, and that worked. The rest of the updates then managed to through. Honestly, I lost track after 4 hours on how long the entire ordeal took to update. I suspect it was due to Windows 8 or the hdd but I’ll never know for sure. All of that could just be anecdotal.The keyboard feels a little finicky, it seems like I have to press a little bit harder in order for some keys to register, but what annoys me more is that the touchpad sensitivity feels slippery at times and the touchpad clicker is a little obnoxious to press. It is not a deal breaker for me, but it is an annoyance that comes and goes.One star off is due to the 5400 rpm hdd, you will definitely notice its speed.", "Date": "June 6, 2014"}, {"Title": "Great Deal For The Budget", "Author": "Md Tanvir Hossain Bhuiyan", "ReviewID": "R2K24C9GMHVVO6", "Overall": "5.0", "Content": "After I ditched my Sony Vaio, I was looking for a budget laptop which could give me the performance of an i7 CPU and and great graphics for my gaming addiction. However, I always ended up finding high priced products that exceeded my budget. Luckily, I found this amazing machine. The price was marvelous. I play all the latest PC games with it without any complaint. I'm impressed.", "Date": "June 2, 2014"}, {"Title": "Fast shipping", "Author": "Lee", "ReviewID": "R3QERALO6QXP8I", "Overall": "4.0", "Content": "Fast shipping, battery goes up to only 98%. I don't know if the laptop is build like that but other then that, thank you.", "Date": "May 29, 2014"}, {"Title": "Almost a great laptop, but the hard drive is a bit slow", "Author": "Johnathon M. Jones", "ReviewID": "R2YIS44CR7M69Q", "Overall": "4.0", "Content": "I've owned the laptop for one week, and my initial impressions are:1) Great processor and graphics2) Very nice design3) Excellent keyboard (touch typist)4) Slooooow hard drive, only 5400RPM.  Seems like every time I'm waiting a long time on the computer to do something, it's because the hard drive is just not fast enough (constant hard drive blinking light, task manager says hard drive is working a 99%).  The Windows Experience score on the hard drive is 5.9.  All of our basic 4-yr old desktop computers at work with SATA2 hard drives get the same score.  Considering that a solid state drive scores around 8.0 and definitely responds far more quickly, I can't help but feel really disappointed with the hard drive performance of the 750GB SATA2 5400RPM drive that ASUS used for this PC.  I will definitely replace it with an SSD.", "Date": "May 24, 2014"}, {"Title": "Nice computer, lousy operating system.", "Author": "J Charles", "ReviewID": "R1U2EIK8ZPKI36", "Overall": "4.0", "Content": "If the operating system, Windows 8, worked, I would give this computer 5 stars. The computer is sleek and very fast. The features listed in the product description seem to be right on as far as I have been able to tell. The bad: Windows attempted to download and install 99 updates. After waiting for the download and installation Windows 8 had a problem configuring the updates and removed them all. I am still waiting to see if a second attempt during automatic maintenance is successful. Since I haven't been able to update, I can't upgrade to 8.1.I am also unable to connect to my wireless network after configuring my network, passwords, etc. I have 6 other devices running on my network, so I know how to connect to it. Windows 8 recognizes the network but cannot connect. I had to connect via Ethernet to get online and attempt to update, etc.UPDATE After about ten days and a lot of frustration, I was finally able to get all of the updates downloaded and installed and upgraded to 8.1. I also finally got the wireless to work. 8.1 is definitely an improvement, although I still prefer Windows 7 for a desktop or non-touchscreen machine. Microsoft attempted to create an operating system that was good for everything and turned out a product that does neither really well.All in all, this is a nice machine and I now have it configured to navigate Windows 8.1 with minimal problems.", "Date": "May 14, 2014"}, {"Title": "Great computer with some small drawbacks", "Author": "Sixaola", "ReviewID": "R378BKWMPLNFQN", "Overall": "4.0", "Content": "I have a true respect for Asus hardware. Everything I have bought from them is of the highest quality, and this laptop stays true to that tradition.The computer is great for everyday work, internet surfing, video streaming, and in general most type of work. I have played a few games, but nothing truly demanding, so I can't say for sure how good it is for gaming. I have managed to run Steam game streaming through it on a 1080p screen, so that's good.For its price range, i love many aspects of it. Great processor, good amount of RAM, good HDD size, DVD ROM unit (this is something that I still use a lot) and good battery life. Pretty good graphics card, the screen is good as well and the computer is think enough. SD memory slot and HDMI port.In reality it is very little you can complain about.But there are a couple of things I really are missing, or maybe it is just me wishing it had a few more things.1. Wireless only connects to 2.4ghz range, not to 5ghz as many new gadgets do. For me, this was the greatest disappointment for the laptop.2. More USB ports. 2 USB 2.0 and 1 USB 3.0. I was expecting 4 USB ports, and while this is only a minor detail, USB ports are used for so many things these days, that the more you get the better.3. Last, I find the placement of the trackpad a little off. I am used to having the track pad centered in relation with the laptop. I am not sure if all new laptops have this arrangement, I haven't bought one in many years, but I would have loved for the track pad to be a little more centered.These 3 things are important for me, hence the 4 stars. These may not be of relevance to anyone else, and except for that detail, this is an amazing piece of equipment. I use it for almost everything and its performance is fantastic.", "Date": "May 24, 2014"}, {"Title": "Worth It (decent gaming laptop)", "Author": "Ron Liebrum", "ReviewID": "R2ZL68J9YRX4MF", "Overall": "5.0", "Content": "Awesome laptop especially for only $700.  It's probably one of the best laptops in this price range. The fact that it has a dedicated graphics card with 2GB is awesome. Only con is 720p and not 1080p or 1080i. But this can be over looked.", "Date": "May 20, 2014"}, {"Title": "4/5 because no free bacon", "Author": "Leander Orion", "ReviewID": "R1I9NBWR2Y1QDO", "Overall": "4.0", "Content": "Works very well and does everything as advertised. Great for playing fps games like cs:go and Battlefield 4. The only reason I am not giving it 5/5 is windows 8 and no free bacon :'(", "Date": "May 24, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HJSDU3U"}}