{"Reviews": [{"Title": "Acer Aspire S7-392-6807 a good buy!", "Author": "Joseph M. Carrier", "ReviewID": "R29FA88K2IY9PW", "Overall": "5.0", "Content": "The Acer Aspire S7-392-6807 laptop has met all my expectations.  Learning Windows 8.1, however, is not an easy task and requires going online for help.  Once learned it makes working with a touch screen a lot of fun.  The start up of the laptop is super fast.  Amazon delivered the computer in just 3 days.", "Date": "April 12, 2014"}, {"Title": "Mostly OK however...", "Author": "Charles R. Clark", "ReviewID": "R3ANUFK0NDD2NV", "Overall": "3.0", "Content": "This computer is amazingly light and responsive for a PC.  Very fast. It has many of the best features of a tablet, high resolution, gorilla glass, etc. It's working well putting data-files on the External drive. WiDi works very nicely for network entertainment, though a little jerky on action shots; might be a problem for some games.  It doesn't get too hot, battery life good, etc. In the beginning, however it went into repair mode and locked up. I called tech support and they had me send it back for a wipe and re-install.  So I realized i needed to go slow in installing updated drivers, various software etc. Being sure to reboot after making any changes. No problems since then.  Tech support was friendly and polite even though they couldn't do much over chat that I hadn't tried already. The unit came back promptly from repair; no problems since then. I'd say someone needs to get the self repair mode more functional - whoever is responsible for that.  Otherwise a very nice experience so far.", "Date": "April 8, 2014"}, {"Title": "Disappointed", "Author": "Amazon Customer", "ReviewID": "R100CDMQ090TUO", "Overall": "2.0", "Content": "Pros:-Aesthetically pleasing-Lightweight-Same exact width & height as Macbook Air 13'-Contrary to a cnet review, Keyboard is easy to use, has pretty deep keys.Cons:-High pitch noise coming from the center (only audible when really close)-Different charger than my other Acer laptops (V3, M5, and 4810)-Comes with two \"half-sized\" disks instead of one (so two 64GB disks for me)Specifically for Linux:-Wireless doesn't work (wasn't detected by Crunchbang or Debian)-Touchscreen didn't work out of the box (looks like there's resources online to help though)-Fonts are all over the place.  (might have to do with the wqhd)-Two finger scroll doesn't work (probably a way to get this working via synaptics)-Function keys share buttons with the number keys (certain shortcuts are impossible, eg. switching virtual terminals)-Brightness and volume function keys don't work (OS detects them, but they aren't bound)(All of these are things that worked easily on my other Acer laptops)Hopefully you have a better experience.", "Date": "May 15, 2014"}], "ProductInfo": {"Price": "$1,499.99", "Features": "Intel Core i5-4200U 1.6 GHz (3 MB Cache)\n8 GB DDR3L-RS SDRAM\n128 GB Solid-State Drive\n13.3-Inch WQHD Touchscreen, Intel HD Graphics 4400\nWindows 8.1, 7.5-hour battery life", "Name": "Acer Aspire S7-392-6807 13.3-Inch WQHD Touchscreen Ultrabook (Crystal White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41XJz-bYj%2BL._SX300_.jpg", "ProductID": "B00HSYS3LO"}}