{"Reviews": [{"Title": "Great computer for the money", "Author": "Scott Mullet", "ReviewID": "R2GDF274K9U1DC", "Overall": "5.0", "Content": "I wanted a nice laptop for a small business.  I'm very happy I went this route.  Love the touch screen.", "Date": "March 2, 2014"}, {"Title": "Very good complectation, nice price", "Author": "Maria", "ReviewID": "R82E0XRZW9UPD", "Overall": "5.0", "Content": "This Lenovo laptop is great if we consider a complectation and price(it even has DVD).Design is very accurate and everything works properly. Runs very quiet!There are A LOT of preinstalled programs including Windows 8 Pro.A little bit heavy (more then 2 kg), compare with your previos one to understand how it's important for you.On the keyboard disposition of ctrl and Fn is not standart and can be not usable. It can be changed in BIOS.In whole I'm absolutely satisfied.", "Date": "February 27, 2014"}, {"Title": "ThinkPad? Think Again!", "Author": "Denise H. Williams, LMT", "ReviewID": "R2ZJ7J7XMI6KDU", "Overall": "1.0", "Content": "10/2/13: Ordered ThinkPad E431:11/3 ish/ 13: Received Laptop (had to call CDW - I was going to cancel the order)Hate the touchpad but am willing to suffer with it because the specs (hard drive size & clock speed are good)Dec 2013: Sent Laptop for monitor repair. dim pixels area was getting worse. No laptop for 1 week. FixedThe Headache Begins HEREFeb 4 ish: Send Laptop back - it emitted a burnt electrical smell then would not boot up.Lenovo returned a supposedly \"tested\" & \"repaired\" machine - When attempted to power up - same smell & doesn't boot up at all!Mid Feb 2014: Sent it back again.2/24/2014: Lenovo supposedly \"tested\", \"repaired\" and replaced parts machine - Upon plugging in machine - same smell & doesn't boot up. More than 2 weeks later - received machine back - NOTHING HAS CHANGED!!Escalated Issue to supervisor.2/25/2014: Supervisor (Darryl A) says I will be contacted to arrange the receipt of a new unit.2/26/14 to 3/3/14: phone tag. Finally get in touch with Michael S.In the meantime I pay $150 to LapTopMD to retrieve my data from the dead machineMichael S indicated I should receive a new Laptop in 8-10 days (that would be about 3/17ish). He takes my credit card number & tells me how to take out the hard drive (has my personal data on it). I have the dead old laptop at home waiting for a return box.3/14/14: I call Lenovo for a tracking number only to be informed the Laptop won't be shipped until 3/25 with an approx arrival of 3/28 to 4/1/2014. I've been without this machine for 2 months!!3/14/14: I call Darryl A - I want a refund at this point. He says he'll relay the info to Michael S.as of 3/19/14: I haven't heard from Michael S. (So much for responsiveness)3/20/14: Finally speak to Michael S regarding refund. He sent me an email to get the refund process started (sent CDW receipt $807.92 to Michael S).---Will keep you posted --Summary:I've owned it for less than 5 months - Have sent it back for repairs 3 times (1 time dim monitor pixels; 2 times motherboard burnt out). The motherboard issue: they kept claiming they ran all these tests but when they sent it back to me TWICE in the same Dead condition, the machine still didn't work (doesn't boot up).In other words: I have technically owned the laptop for 5 months - I have had approximately 2 month's of trouble free use. NOT A RINGING ENDORSEMENT FOLKS.Lack of BASIC quality control in the repair process (really more like incompetence). All they had to do was plug the machine in and press the start button to know that the machine wasn't fixed!!In the 25+ years that I've owned a computer, I've never dealt with this level of incompetence, misinformation, combined with a poor quality product.FYI: I am a former technology professional (system analyst, quality assurance, tech support supervisor). If this crew were working for me, I assure you, I would have fired several people by now!", "Date": "March 19, 2014"}, {"Title": "Great computer", "Author": "Ethan", "ReviewID": "RTD78ZG2HZMAP", "Overall": "5.0", "Content": "This computer was everything that I could have wanted.  It's smaller but still has a mobile not low voltage processor, DVD drive, touch screen, and a seemingly limitless amount of storage with the 1tb hard drive.  The ssd allows boot times of around 5 seconds and this thing flies.  My only complaint would be the audio quality when listening through headphones.  Even with expensive headphones, the sound quality is muffled and muddy.  I got an audio ehancer, but still, it now just sounds okay.  Overall, i am very satisfied with this product and will most likely be a repeat lenovo buyer.", "Date": "March 8, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HVQVK5U"}}