{"Reviews": [{"Title": "Pretty good for my 4yr old daughter", "Author": "Joysky", "ReviewID": "R3F0Q2JKNOXWON", "Overall": "4.0", "Content": "We had this for almost a week and just now I check the specs...I am glad I did. Found out, Amazon sent me the wrong specs.Descriptions says Intel Celeron N 2815 2.13 GHz but when I checked it is only 1.86 GHZ. Contacted Amazon through chat, I am very pleased that they are sending me the replacement item without charge since they were the one who made the mistake.Oh well for 5days we have this item, I can't say anything bad except for the wrong specs. My daughter is really happy with the touchscreen. We still need to get used to having Windows 8 though but over all it's very user friendly.I guess I want to give 5 stars for amazon's customer's service.", "Date": "April 22, 2014"}, {"Title": "$300 for a one-time notebook?", "Author": "Zhishen Zhang", "ReviewID": "R6J6M8L1H4VSX", "Overall": "1.0", "Content": "Bought this one because I need a light one when I travel this summer. However, the first time I got it it did not work. I thought the battery was out of charge and charged it for an hour but it still didn't turn on. Fortunately enough, after three days of charging I was able to turn it on when I was writing my final paper for the semester. However, that's the ONLY time I could use it. Once I turned it off it never comes alive, and two days before my trip I'm here typing this comment on my smartphone with anger and anxiety. For the only time it works I would say it deverses the price. High resolution, decent reaction speed, and most win8 characteristics available. BUT you have to PRAY that you are FORTUNATE enough to get it turned on for a few more times.", "Date": "May 19, 2014"}, {"Title": "Do NOT buy.", "Author": "Africamom", "ReviewID": "R17DUNHZ3VGKAQ", "Overall": "1.0", "Content": "These things are a piece of junk.  We were given money to buy our sons computers for living and doing school in Africa - decided to go cheap rather than buying just one mac.  Bought them.  Within a month, the first one froze - couldn't do a thing with it.  Got it fixed.  Before a couple weeks passed, it crashed again - this time couldn't go on the internet.  Got it restarted to factory settings...again.  The other two just got updated, and now one of them has the same problem - can't go on the internet - and we didn't even go on the internet!  I will NEVER buy another pc as long as I live.  Total waste of money.  Asus claims that it \"inspires innovation, persistent perfection\" - what a joke.  I might find some innovative ways of demolishing the stupid machines but that's all the innovation that I can come up with.", "Date": "April 28, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HZT1TWW"}}