{"Reviews": [{"Title": "Quality Laptop", "Author": "Dylan Bennett", "ReviewID": "RX8QTB5R3YONY", "Overall": "5.0", "Content": "To be completely honest, I mainly bought this Laptop because of the 'HP' brand. The last 4 desktops I have used have been all HP and I received great customer support for each one. PLUS they have all been long lasting.Everything about this laptop works for me. The integrated graphics bug me a little, but I'm not specifically using it for gaming anyways.I am mainly using this laptop for 2 reasons:-Capturing video/audio (Which is why I went for a 750GB)-And portability for when I'm not at home.If you don't need the extra Hard drive space, go for a cheaper version of the HP 2000. However, definitely go with HP for the quality.", "Date": "April 28, 2014"}, {"Title": "Beware update to 8.1 process", "Author": "Richard E. Fischer", "ReviewID": "RUP0C906P4ICV", "Overall": "1.0", "Content": "I spent several hours trying to get this thing to update to 8.1, including interminable hold time with HP support.  Never could implement.Amazon, though, is terrific with this sort of problem.  I was able to return it conveniently and without any hassle.  I seriously doubt a big box store would be so accommodating.", "Date": "May 18, 2014"}, {"Title": "Great computing speed for the price!", "Author": "Randall L Krause", "ReviewID": "REBP4NIC3JQSO", "Overall": "5.0", "Content": "Great product. Wish it would have came with a word program. Audio is adequate, but overall a great computer for the price!", "Date": "June 2, 2014"}, {"Title": "very good laptop", "Author": "jannie", "ReviewID": "RBGVYRNJKV3E", "Overall": "4.0", "Content": "This laptop is sufficient for my needs.  It does not come with the basic programs of word & excel, I had to pay extra for that and the internet security Norton ends in 30 days.", "Date": "May 17, 2014"}, {"Title": "Give a little!", "Author": "Tien Nguyen \"NKT73\"", "ReviewID": "RPPQT2QGAYSWT", "Overall": "5.0", "Content": "This laptop is great.  I give a little because I ignore the fact that there is no drivers for Microsoft Windows Vista Home Premium.  However, if you are in no need of communication or have a spare computer for basic internet and stuffs, you are good to go.  This laptop is just too new for me with the pre-installed Microsoft Windows 8.  So I downgraded it to Microsoft Windows Vista Home Premium.  Microsoft has been great with downgrades.  This particular Hewlett Packard allows you to downgrade to Microsoft Windows Vista Home Premium as far as I can see.  I believe it is a blessing in disguised since there is no virus.  I recommend downloading tried and true programs on another computer then using that to transfer it over to the laptop.", "Date": "April 23, 2014"}, {"Title": "MY FIRST LAPTOP, LOVE IT SO FAR AFTER ONLY TWO DAYS", "Author": "Lee A. Enloe \"LEE ENLOE\"", "ReviewID": "RG99V60KAP3KN", "Overall": "5.0", "Content": "WE HAVE BEEN USING A DELL XPS DESKTOP FOR MANY YEARS BUT IT IS FINALLY HAVING PROBLEMS AND IS RUNNING THE EXPIRING WINDOWS XP.  SO WE DECIDED TO GET SOMETHING WE CAN TAKE WITH US ON TRIPS AND INTO THE LIVING ROOM WHEN WE FEEL LIKE IT.  IT ONLY HAS 3 USB PORTS BUT WE CAN GET BY WITH THAT.  ON OUR DESK I SET IT UP W/ WIRELESS KEYBOARD & MOUSE AS I AM NOT THRILLED W/ TOUCH PAD.  IT WILL TAKE ME AWHILE TO GET USED TO WINDOWS 8.1.  WE BOUGHT IT AT BEST BUY LOCALLY FOR $309.99.  IT WAS THE LAST ONE THEY HAD BUT IT HAD SOMEOTHER GOODIES BUNDLED W/ IT.  WE FELT THAT IT WAS AN EXCELLENT BARGAIN.  WE WERE NOT VERY IMPRESSED W/ THE SALES PERSON.  I GUESS HE DID NOT REALIZE THAT WE BUY OTHER ELECTRONICS AS WELL...", "Date": "January 21, 2014"}, {"Title": "Great", "Author": "Antoinette Craig", "ReviewID": "R1YKWOIAXH9YA8", "Overall": "5.0", "Content": "got my laptop from amazon  and it is working great, I have no complaints, it really is a good buy, I would recommend it to any one", "Date": "June 8, 2014"}, {"Title": "HP Does it Again", "Author": "Brenda Kirkpatrick", "ReviewID": "R2E6G33RD7ID6H", "Overall": "5.0", "Content": "Great value and great price with more processing speed, memory and disk then I'll ever need and it's a Pentium processor.  This is a great deal and I recommend it to anyone.", "Date": "May 28, 2014"}, {"Title": "One happy customer", "Author": "carolsueheffernan", "ReviewID": "R1YKC6LCVJ3M99", "Overall": "5.0", "Content": "I  bought it for my husband and he has a  very close friend that is Very up to date on all the new products.  Since receiving our unit he is here ALOT  -he loves it  thanks", "Date": "May 22, 2014"}, {"Title": "I love it", "Author": "wiener", "ReviewID": "R1V9NAS0I2L5F1", "Overall": "4.0", "Content": "It runs most light games well such as Minecraft, Team Fortress 2, Portal 2, Garry's Mod and Warframe well at mostly between 20-40fps on medium to low settings. It is also a quick, zippy machine that is great for browsing the web. To make it run games a little better i would recommend to add an additional 4gb of RAM for that extra boost. This allows you to do more things at once and run higher quality settings. Over all, if a kid wants something to play Minecraft on this is a good Machine", "Date": "May 22, 2014"}, {"Title": "Great value for this laptop", "Author": "Latoya Martin", "ReviewID": "R2OEYAB89YZ45F", "Overall": "5.0", "Content": "This item is a great value - very reasonably priced for its functionality. It is good for what I need - using various office software programs and downloading/playing music, and Windows 8 is very good (I just need to become more familiar with it, having used Windows 7 previously, and Windows 8 seem substantially different from Windows7). I don't use it so much for video; so, I can't really comment on that. But I am satisfied with this product.", "Date": "May 17, 2014"}, {"Title": "So far so good", "Author": "Amazon Customer", "ReviewID": "R2QW2D50VMYX09", "Overall": "4.0", "Content": "This laptop works well so far.  Good speed, Good visuals.  Would have given it 5 Star, except the mouse track pad responds just ok, and the shinny finish shows fingerprints and needs to be wiped constantly if you are OCD.....", "Date": "January 1, 2014"}], "ProductInfo": {"Price": "$367.80", "Features": "2.50GHz Intel Pentium 2030M Processor, 2MB L3 Cache\n4GB DDR3L SDRAM, 750GB 5400RPM hard drive\n16-inch diagonal HD BrightView LED-backlit display (1366x768)， Intel HD graphics with up to 1696MB total graphics memory\nSuperMulti DVD burner, front facing HP TrueVision HD Webcam with integrated digital microphone\nMulti-format digital media card reader for Secure Digital cards, 3 Universal Serial Bus (USB) 2.0, 1 HDMI, 1 VGA (15-pin), 1 RJ-45 (LAN), 1 Headphone-out, 1 Microphone-in", "Name": "HP 2000-2d24dx 15.6\" Laptop PC - Intel Pentium 2030M / 4GB Memory / 750GB HD / DVD±RW/CD-RW / HD Webcam / Windows 8", "ImgURL": "http://ecx.images-amazon.com/images/I/41lKvwHthDL._SX300_.jpg", "ProductID": "B00H1K320W"}}