{"Reviews": [{"Title": "great bang for the buck", "Author": "kbc", "ReviewID": "RGHKVB8OWBCDU", "Overall": "5.0", "Content": "Pros: Value, Battery Life, Quality, PerformanceWell worth it for a touch screen laptop!!!! I could not have been happier. The battery can get me through a full day worth of use. I haven't had any touchscreen problems like other purchase laptops.This would serve probably the middle 90% of users. I have not had any problems running multiple programs, up to 10 internet tabs, etc.From a design standpoint it doesn't stack up against an ultra book, though the brushed look works for me. I prefer processing power and pricing over small size. I wan't more storage (1TB) rather than cloud storage with an SSD. Also probably slightly thicker since it comes with a cd/dvd drive. After comparing specs for months I could find anything with the specs of this laptop for the price.", "Date": "April 6, 2014"}, {"Title": "Fits into brief case, fast computer", "Author": "LaurenAhley7", "ReviewID": "R1MP1V43X4ZLOW", "Overall": "4.0", "Content": "Fast machine, great size for the traveler.  Having the disk drive makes it easy to upload or use old apps and files", "Date": "March 21, 2014"}, {"Title": "Amazing Laptop! Great Performance!", "Author": "Piyush", "ReviewID": "R216DS5X613OAC", "Overall": "5.0", "Content": "Writing this review from my new Dell. I am still getting used to Windows 8.1. The touchscreen and battery backup is pretty amazing. Touchpad behaves weird sometimes. This machine operates very silently like my other XPS machine which is pretty amazing for an Inspiron model. It lacks backlit keyboard but then I knew before purchasing this model and I can live with it. Its lightweight and portable.The aluminium finish looks cool. Overall, its a great laptop for its price and I'm happy with this purchase.Pros: Size, Fast, Touchscreen, Battery Backup, Silent Operation, No heating, Build Quality & aluminium finish and finally Price.Cons: Touchpad unstable sometimes, No backlit keyboard", "Date": "May 7, 2014"}, {"Title": "Amazing Value, Incredible Customer Service, and a Solid Computer", "Author": "Jinger Jarrett \"Internet Marketer, Author, Wr...", "ReviewID": "R1NB0OGXRU535C", "Overall": "5.0", "Content": "I ordered this on Wednesday, and I received it on Thursday. It was everything I wanted in a computer, and I just couldn't believe the price. This is an excellent computer. I prefer square monitors over the long ones, and so I finally got the right monitor for me. It's touch screen, and you can zip through all your tasks with it. It's lightweight, runs fast, and is a great computer for all your needs.One more thing: the company that sold this to me processed my order immediately, shipped it fast, and I had it the next day. Excellent customer service. Some of the best I have seen. Highly, highly, recommended.", "Date": "May 7, 2014"}, {"Title": "headline", "Author": "Tino", "ReviewID": "R3NR3GF6TD25LB", "Overall": "4.0", "Content": "Only thing this lacks is the backlit keyboard and the display resolution. Other than that, I highly recommend this laptop!!", "Date": "April 18, 2014"}, {"Title": "great performance and size", "Author": "Luis", "ReviewID": "R33Y37DKUC8HN7", "Overall": "5.0", "Content": "great performance and size, it`s a small computer with a touch screen that allows mw to do my daily job", "Date": "April 12, 2014"}, {"Title": "nice laptop", "Author": "barun prasad", "ReviewID": "RTM5LZXBD9RPH", "Overall": "5.0", "Content": "working good, and its has no disadvantage also with the amount its best one to buy,I am happy with this laptop", "Date": "April 11, 2014"}, {"Title": "Loved the Book", "Author": "Arfat", "ReviewID": "R2V2BPUATZ7UFO", "Overall": "5.0", "Content": "Dell Inspiron 14.1 - Inch Touch screen Ultra book (i14 RMT - 7501 s LV)Is amazing ... and very economical", "Date": "April 10, 2014"}, {"Title": "Exceeded expectations", "Author": "william", "ReviewID": "RAJUVGRKS06Q1", "Overall": "4.0", "Content": "I love this computer.  It is very fast, is the perfect size for moving it back and forth from school.  Plenty of memory for all kinds of music and pictures and documents.  Also the battery is great.  The major flaw to me is the sound.  I went from a beats audio laptop to this and its a major drop off.  Would be nice to have a black light keyboard also.  Overall would highly recommend this.  Would love for dell to comment back to the sound issue though.", "Date": "May 26, 2014"}, {"Title": "Very good", "Author": "Philip Palmiter", "ReviewID": "R3SAT7I3Y6W39C", "Overall": "5.0", "Content": "Everything arrived on time, and the item was in condition exactly as described. Works excellently and no detected. I'm sure I will get many more years of usage from the purchased item.", "Date": "May 22, 2014"}], "ProductInfo": {"Price": "$799.99", "Features": "Intel Core i5-4200U Processor 1.6 GHz\n8 GB DDR3L SDRAM\n1 TB 5400 rpm Hard Drive\n14.1-Inch Touch Screen\nWindows 8", "Name": "Dell Inspiron 14.1-Inch Touchscreen Ultrabook (i14RMT-7501sLV)", "ImgURL": "http://ecx.images-amazon.com/images/I/41AfvtQ1OoL._SY300_.jpg", "ProductID": "B00HRO32J8"}}