{"Reviews": [{"Title": "Touch pad woes... Nice PC otherwise... Plan to buy a mouse!", "Author": "bkengineer", "ReviewID": "R34J9DAHZMJZGO", "Overall": "2.0", "Content": "The old IBM legacy of top end notebook computers is over now that Lenovo has taken the product line.  This machine is not up to IBM standards, and do not expect IBM quality.It is quiet, and has a nice display. However, the most used input device on a notebook PC is the mouse, which in this case is a touch pad. This is the worst touch pad I have ever used!  You will try all the settings and never get it to work correctly.  Just try doing a right click on the background to set display resolution and the background picture. On my Sony Windows 7 notebook this is trivial. On the Lenovo touchpad it is nearly impossible- this thing will not recognize right click! Try to create a short cut on the desk top to your favorite programs- sorry- not possible on this machine!This touch pad does not have true buttons. Instead, it relies on pressing a certain area of the touch pad. I still can not locate where that area is, so good luck with your experiments in trying to get this to work.  It will go back in the box and I will now consider other brands of PC, such as Toshiba. Lenovo has now killed what used to be the BEST notebook brand in the world.I did note that battery life seems to be OK, and the weight is acceptable.  My machine came with a 256 GB solid state hard drive, and this is a nice touch for faster system operation. It should also help the battery last longer, as spinning a hard drive takes a fair amount of energy.The ultimate solution to making this machine useable is to forget about the touch pad interface, and purchase a nice USB / wireless mouse or external touch pad. Now you can use this machine and make some serious progress on all your computer work. It just means when you travel with this PC you must carry along another piece of hardware- a working mouse.", "Date": "February 10, 2014"}, {"Title": "Great Computer", "Author": "V. Hedrick", "ReviewID": "R2FVOCS9DFJ2GY", "Overall": "5.0", "Content": "When I read the horror stories about the trackpad and how worthless it was I considered sending this computer back unopened. I am glad I opened it. It is really an outstanding computer and the negativity about the trackpad is much about nothing. It works really well.", "Date": "April 25, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HK0VQEM"}}