{"Reviews": [{"Title": "This Dell Inspiron has everything you will need from a laptop", "Author": "Christopher J. Cowen", "ReviewID": "RFQNQ77APFBHN", "Overall": "5.0", "Content": "Dell Inspiron (i17RV-8183BLK) 17.3-Inch Laptop is a great laptop for only $449 dollars. I was in the market for a great laptop and this one definitely fits the bill. This laptop is lightweight and thinner than previous versions of the Dell Inspiron. Once you boot up this device you will notice right away the sharp images this laptop can display. The screen is large (17.3\") and will allow you to do anything you could do on a desktop. The screen displays at 900p (1600 x 900 ) HD. This laptop is filled with many more great features. I have listed a few that I felt were important for you to know before making a purchase. They are as follows:• Processor: 1.9 GHz Pentium 2127U• Display: LCD 17.3\" HD Plus WLED AUO• Memory (RAM): 4GB, DDR3L, 1 DIMM, 1600MHz• Storage (hard drive): 500GB 5400 rpm HDD (More than enough space)• Optical Drive: DVDRW +/- 8X TSSTAgain I think you will love this laptop like I do and I would definitely recommend it.Thank you for reading my review, if you have any questions feel free to email me, I would be happy to help you with any questions you have", "Date": "February 23, 2014"}, {"Title": "Nice!", "Author": "John B. Goode \"JBG\"", "ReviewID": "R21X4TR6HPEZRF", "Overall": "5.0", "Content": "Yes, I have actually purchased this laptop. It was used to replace an IBM 14.1\" with XP.Presentation: Very nice. It's relatively thin, big and a bit heavy compared with a MacBook but then the price is a lot better too. I love the carbon-fiber-like dimpled finish and the color. It actually feels like Dell spent some money on the design rather than handing it off to the engineers for the finish.OS: The biggie. I got the Windows 8.1, which is somewhat of an admission that MS screwed up. I've already used Win 8 on my Android phone but still getting used to it on a laptop. Makes more sense on a small mobile device. Everything I want to do, I'm still using the work around to get back to the old style. Just because it's different doesn't mean it's good and why fix something that isn't broken.Speed: Of course, this is much faster than my old IBM, I love the speed, and I love the price, which is even less than I paid for my IBM when new all those years ago. I've got 4GB of RAM but may upgrade later. The laptop is still new so doesn't have a lot of programs hogging and clogging up processing power. And start up and shut down is so fast it's amazing.Functions: The specs are all posted above so I won't list them here. The only port that I miss is for my old VGA monitor but it has an HDMI port so I just need to get a converter. My printer has wifi and it only took a few seconds for this to connect wirelessly.Overall: I love this laptop. It's fast, looks sharp and the price is great.", "Date": "March 31, 2014"}, {"Title": "give yourself a nice gift (not this)", "Author": "Christian De Freitas", "ReviewID": "R2DMFK3CW7FEDQ", "Overall": "3.0", "Content": "I do not own this laptop, but my GF and a coworker have thisto begin, its a big laptop, very nice. oddly it doesnt have a VGA port, but only HDMI, 4 usb ports 3 on 1 side and 1 next to the optical drive.its not slow but its not the fastest, right in the middle.i recommend http://amzn.to/1ejUtt7 this laptop to them, but they preffer dell. if you have never used windows 8 get ready to learn something new, the harddisk is in UEFI format so reinstalling windows 7 is a PITAit has a 2nd gen cpu, and with that price range i would have got a 4th gen core i3 like http://amzn.to/1ejUtt7 or http://amzn.to/1fXsxf9.my recomendation is get yourself another 80 dollars and get at least a core i3 4th gen processor laptop.", "Date": "April 6, 2014"}, {"Title": "Laptop is as advertised.", "Author": "Satisfied Buyer", "ReviewID": "R2UZIZY1U6GTF2", "Overall": "3.0", "Content": "Unit comes preloaded with Windows 8 (which I detest) and software that wasn't ordered or needed. I was looking for laptop with a a 17\" screen and this filled the requirement. The Intel processor is an Intel 2127U dual core and comes with 4gb DDR3 RAM. It is minimal at best and the unit can only be upgraded to 8gb of RAM. Typical Dell product with limited upgrades. Had buyer's remorse as there are better units for a little more money on the market.", "Date": "May 18, 2014"}, {"Title": "Love the Computer, but, hate Windows 8", "Author": "Audiophile \"Audiophile\"", "ReviewID": "RHT3JOZGBQSIE", "Overall": "5.0", "Content": "I have to give the Dell computer 5 stars and the Windows software, if I could, no stars, I hate windows 8. I did upgrade to windows 8.1 that gave me some satisfaction. I certainly hope, when windows 9 is released, it will be a big improvement over this horrible windows 8.Love the computer....", "Date": "May 17, 2014"}, {"Title": "Big enough yo use as a desk top", "Author": "Debra Cox", "ReviewID": "R2BFU80CYZAS9C", "Overall": "5.0", "Content": "It was hard getting used to window 8, but once I did I go threw it like a breeze. The computer is small enough for a lap top and big enough to use as a desk top.", "Date": "April 7, 2014"}, {"Title": "i love it", "Author": "Sue A. LaPage", "ReviewID": "R2DZWF3QEMAG0H", "Overall": "5.0", "Content": "a very great investment..easy to get it all set up..seems awesome having a 17.3inch screen..to me dells are the best...very fast..awesome sound..it's windows 8 which to me is as easy as windows 7", "Date": "June 4, 2014"}, {"Title": "Dell laptop", "Author": "granny", "ReviewID": "R2MBRJNQPC7HZ4", "Overall": "5.0", "Content": "I am pleased with this laptop.  I am still learning new things about it.  I was disappointed to find that there were no written instructions with it.  Some of the things I have learned have come about by my stumbling on them.", "Date": "May 16, 2014"}, {"Title": "Dell Inspiron 17.3 LT OK.", "Author": "James Cox", "ReviewID": "R1POLX2HKIKKBD", "Overall": "4.0", "Content": "It does nearly everything I expected it to do. Getting used to WIN8.1 took only a few days.My one negative is that it's really snooty about connecting to my other PCs on the network with different OSes via WIFI, though it's OK with the one using Ethernet and XP. I still haven't figured out how to get it to talk to my WIN7 WIFI laptop. Fortunately the laptop talks to the XP machine OK, so I can connect to the new LT through the WN7 laptop and the XP desktop for now.It connected to the Xfinity TC8305C modem/router and Internet without a problem.", "Date": "May 12, 2014"}, {"Title": "Excellent Computer", "Author": "Luther H. Moore Jr.", "ReviewID": "R3R1KHEKOLV29J", "Overall": "5.0", "Content": "I chose this computer after reading reviews and finding it met all my expectations. Never any problems with Dell and support is fantastic.", "Date": "May 10, 2014"}, {"Title": "don't buy", "Author": "Donna", "ReviewID": "R2MRYCWSYSU4PA", "Overall": "1.0", "Content": "Very cheaply made, DVD doesn't set in evenly...everything is cheap plastic....I wouldn't recommend this to anyone and would not buy another dell....it remains to be seen how long it lasts", "Date": "April 28, 2014"}, {"Title": "Great item", "Author": "Richard Q", "ReviewID": "R21IJ1RLRTHWV7", "Overall": "5.0", "Content": "the set up on this was amazingly easy.  it's a lightweight unit and the functionality of it seems to be great.  I'll keep you posted.", "Date": "April 14, 2014"}, {"Title": "Dell inspiron 17.3 inch", "Author": "teresa", "ReviewID": "RZ4WAYM9U1MXK", "Overall": "4.0", "Content": "So far I'm liking it, the screen is big and shows very clear , no problems  :-) would tell a friend", "Date": "April 14, 2014"}, {"Title": "Really nice system", "Author": "Roger", "ReviewID": "R18GYLBBWU06MS", "Overall": "4.0", "Content": "Bought this computer for my daughter to replace her dell studio that finally crashed. Really nice display and processor speed.", "Date": "April 9, 2014"}, {"Title": "MY DELL", "Author": "HICSTER \"DANIEL W. HICKS\"", "ReviewID": "RD8VTO88OJ2OE", "Overall": "5.0", "Content": "I love my Dell, its my first pc and its everything I need, thankyou very much you guyz are the best...", "Date": "April 1, 2014"}, {"Title": "this computer sucks no stars", "Author": "Paul jackson", "ReviewID": "RPXX56VPJTVJS", "Overall": "1.0", "Content": "This computer is crap not as advetised hard too use not user friendlyI am thinking about returning it windows 8 is hard to navigate cannot get on lineI am sick of messing with it", "Date": "March 13, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HRLSSDQ"}}