{"Reviews": [{"Title": "Tough decision", "Author": "Christian De Freitas", "ReviewID": "R1OMYTT6JPQ48", "Overall": "5.0", "Content": "i was between this laptop and this other toshiba (same specs)http://amzn.to/1fXsxf9decided for the lenovo because i was troubled that toshiba laptops has hinge problems (becomes weak) and battery that lasts only months (check other toshiba laptops reviews and you will notice that thats a very common problem).since this laptop has the same specs as the toshiba (minus hdd space) i went for the lenovo, havent heard nothing but good things from this brand.Update: 15-05-14This laptop is excellent, keeps running as it should, updated to ssd http://amzn.to/1nobaZP and it boots in seconds, kept the HDD this laptop came with in a USB 3.0 case and i keep there all my documents.", "Date": "March 31, 2014"}, {"Title": "Very Good Value", "Author": "Charles Mclean", "ReviewID": "R3OLCZYUCQSWWM", "Overall": "4.0", "Content": "Processor and memory are very good for general business and remote development. Keyboard has a quality touch. Function keys are backwards (have to [fn]+[F1] to get F1 function. That is reversible in POST settings. Screen is comparatively low-res (1366 x 768) and has a great deal of glare. Win8 is a detractor. Overall pretty good for the price.", "Date": "March 24, 2014"}, {"Title": "Seems Great!", "Author": "Michael Warren", "ReviewID": "R3AT5O7X521RBB", "Overall": "5.0", "Content": "With the cessation of support for Windows XP, we decided it was a good time to replace our clunky ten year old desktop and six year old netbook both of which were running XP.  Was attracted by the Lenovo reputation and the unit's i3 processor and 6GB RAM.  We knew that Windows 8.1 was an improvement over 8 for running off the desktop and the learning curve has been pretty uneventful.  We were able to transfer all of our old folders, bookmarks and even Word 2002 using a CD.  Played around a bit with settings, pictures, etc, but were up and running at speed within a few days.So far the computer seems great and its speed for booting up and displaying folders and websites is a revelation after our old XP netbook.  Display and sound are excellent and the keyboard is standard size with well shaped keys.  Plenty of ports for necessary peripherals and all of them were immediately recognized by the computer and functioned seamlessly.  Might be a teeny bit more than one needs to pay for a basic new laptop, but I think getting one with the specs that this one has will ensure it will be functional for at least as long as Microsoft supports 8.1.", "Date": "April 14, 2014"}, {"Title": "I like it", "Author": "GF", "ReviewID": "RZDL2HOI8KXDR", "Overall": "5.0", "Content": "I bought an Ideapad G550 five years ago and it still works very well for my daily work. One time I dropped it on concrete floor and it survived with only one corner broken. So I bought this one without hesitation. I would say this one is more stylish and more powerful than my previous G550. The Window 8 OS includes some preinstalled softwares, some seemingly good but some seemingly useless to me.", "Date": "April 19, 2014"}, {"Title": "A Real Sports Car", "Author": "Fred Ford \"Golf Guy\"", "ReviewID": "R37VN0O5FGNNA0", "Overall": "5.0", "Content": "Brand recommended to me by my computer service. Very easy to operate. It zooms around like a real sports car!", "Date": "May 8, 2014"}], "ProductInfo": {"Price": "$589.94", "Features": "Intel Core i3-4000M 2.4 GHz Processor\n6 GB DDR3 RAM\n500 GB 5400 rpm Hard Drive\n15.6-Inch Screen\nWindows 8.1; 5-Hour Battery Life", "Name": "Lenovo IdeaPad G510 15.6-Inch Laptop (59406739) Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41a0x8NWmPL._SX300_.jpg", "ProductID": "B00HIYA72M"}}