{"Reviews": [{"Title": "Nice for the price.", "Author": "knicksfan", "ReviewID": "RWX7KBE93Q7G0", "Overall": "5.0", "Content": "This item shipped quickly and arrived completely undamaged from shipping. It works great. It won't completely blow anyone away with its specs but it is very functional for around $310.  If you only need something for web browsing, word processing, music and movies, then this computer will do the job well.", "Date": "February 2, 2014"}, {"Title": "Good choice for the price", "Author": "Troy", "ReviewID": "R3VMNFYRSGHY47", "Overall": "4.0", "Content": "This model is a great buy. You get more than other brands offer at same price range. Can't go wrong with this product.", "Date": "February 22, 2014"}, {"Title": "Not Worth It", "Author": "Kelsey Webb", "ReviewID": "R1T0QF67ZUSN2D", "Overall": "2.0", "Content": "Stay away!! If you want to pay a decent chunk of change for a big \"laptop\" with nothing more than netbook capabilities, this is the computer for you.I previously owned a Gateway laptop, purchased about a year before this one. I loved it and it worked great. When I needed to replace it, I opted to buy this newer model, seemingly exactly the same, and the same price I had paid for the previous one. While relatively lightweight, it is a disappointment. I did not read the specs closely enough when purchasing and am dissatisfied with this product as a result. It is slow, (not internet-wise - if you have a good wifi connection, internet works decently well - processing is awful) the battery dies very quickly even on the lowest brightness and with no other programs running, and it lacks even a basic CD drive. It runs when you need it to, but not well. There are much better laptops for less money - trust me.", "Date": "April 18, 2014"}, {"Title": "Great laptop for the $$$", "Author": "Coolbreeze", "ReviewID": "R1YN5WSWQAVMF1", "Overall": "5.0", "Content": "Needed a laptop for internet browsing,email,and work related online education.This laptop has been perfect and the price was right.Received it in two days(regular shipping).", "Date": "March 20, 2014"}, {"Title": "computer times", "Author": "stever220", "ReviewID": "R32V9L6BF3SY31", "Overall": "4.0", "Content": "I bought this Gateway because I had one in the past and was happy with it. This one is very nice, durable, lightweight and the graphics are nice. The windows 8 sorta sucks , but as I get used to it will be fine.", "Date": "June 2, 2014"}, {"Title": "Gateway Laptop", "Author": "Rolandon S.", "ReviewID": "R13UD3XASNU7PM", "Overall": "5.0", "Content": "This is a very new nice laptop for the money. I'm getting used to using the windows 8.1 because it makes it easier to used with the apps.  I would tell anyone to buy this laptop.", "Date": "April 18, 2014"}, {"Title": "to slow processor for the os", "Author": "chris sanders", "ReviewID": "RFI8U1VUNF999", "Overall": "1.0", "Content": "it is so slow it is no where a i3 intl duel core, and im not sure what gateway was thinking so not a good buy and the windows just stops working  all the time u will not like this processor on this operating system(i beta tested windows 8 so i know how it works)", "Date": "April 5, 2014"}, {"Title": "DO NOT DEAL WITH THIS COMPANY NOT ABOVE BOARD.", "Author": "Thomas Pinder", "ReviewID": "R1BFVL9ZOUD2Y6", "Overall": "1.0", "Content": "could not open to put the cd in to the laptop. Did not come with a manual and I could not get one off the internet from the company. Everything was wrong with this purchase. Warning do not deal this this company.", "Date": "March 29, 2014"}, {"Title": "laptop rating", "Author": "Bernie Seibert", "ReviewID": "R2B7CSWRPEJQ1W", "Overall": "4.0", "Content": "For the price it's ok. I had a problem with the touch pad not responding properly but after downloading a new driver it worked good for a while and then it stopped working for a while but it's ok now", "Date": "March 20, 2014"}, {"Title": "Disappointed with this laptop.", "Author": "Leya Cotten", "ReviewID": "RQB2CCYVS8HXX", "Overall": "1.0", "Content": "When my Sony VAIO died I decided to replace it with the cheapest laptop I could find.  I was able to get this Gateway laptop for $225.  I should have done more research.  This laptop is so slow that I can't play the games I used to play and I can't stream videos.  I hate that it didn't have a manual because I'm not good at figuring out how to use it and it is hard finding info online.I have a big problem using the mouse.  On the second day I had the laptop the mouse froze and I couldn't figure out how to make it work.  This happens a lot and all I can do is restart the computer to make it work.  I checked to make sure the correct driver is installed and it us.  I've searched online for solutions and nothing works.  I didn't have this problem with the VAIO.Now I know the saying \"You get what you pay for\" can be true.  When this laptop dies I will do more research before buying another.", "Date": "February 16, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HQAUY4E"}}