{"Reviews": [{"Title": "Returning Due to Problem with Keyboard", "Author": "Ryan Peterson", "ReviewID": "R2YREBLJAI4BB8", "Overall": "2.0", "Content": "My initial impression taking this laptop out of the box was positive.  I've only owned one other ThinkPad before (a T60) which I was very happy with.  Despite some concern among reviewers with design changes on this new model (W540) I decided to try it anyway as I try to take reviews with a grain of salt and see for myself.  One main concern I kept hearing about was the new off center keyboard and trackpad.  Being a programmer this was concerning for me but knowing that I'd likely be using external monitors, keyboard, and mouse with a docking station most of the time I figured I could live with it.However, as soon as I powered it on and started to type on the keyboard I noticed a crunching feeling and sound on the keyboard as well as an almost hollow sound (I'm sorry, it is hard to describe).  The problem was with random keys and not all of them but the majority seemed situated on the left side of the keyboard.  All of the keys worked, but this issue was causing the keys to sometimes bind when you press on them and would fail to register a press or make for an unpleasant typing experience to say the least.  Granted my plan was to use an external keyboard most of the time, but not all of the time.  I would not be able to stand having to type with an issue like this.I have to believe that I was just unlucky and that it was a defect in the keyboard because for a high end workstation class laptop I can't imagine that this is that way it is supposed to be.I won't comment on other aspects of the laptop yet as I really did not play with it once I discovered this problem.  I will say that if not for the keyboard problem which I wasn't willing to live with I believe I would have really liked it.I am returning this one and thinking of reordering a new one to try it again.  I'm still on the fence at this point though.", "Date": "February 24, 2014"}, {"Title": "Number Keypad. What were they thinking?", "Author": "gadgetguy", "ReviewID": "REHIIKL3DQQLG", "Overall": "2.0", "Content": "I was given this laptop at work.Pros:powerful hardware, runs silent and cool.Cons: IMO, it has one FATAL FLAW: the number keypad (the previous model W530 did not have it) which make the the main keys and the trackpad off-center (shifted left).This is a usability and ergonomic nightmare. Initially I kept hitting the wrong keys and I would right click on the trackpad when I meant to left click. After a while you get used to the odd positioning, but it is very uncomfortable.I gave up using this laptop as a laptop and now I always use it attached to an external monitor/keyboard/mouse.I can't believe that Lenovo would release a laptop in 2014 with such an obvious design flaw. It is inexcusable to have the keyboard/trackpad not centered to the display.Lenovo, I hope you fix this in W540 v2.", "Date": "May 15, 2014"}, {"Title": "Lenovo is going down hill fast", "Author": "Greg G. Gebhardt \"Greg Gebhardt\"", "ReviewID": "R1DY4F9C7753OW", "Overall": "1.0", "Content": "I ordered the top of the line W540 with everything and waited two weeks for delivery. Finally arrived and the key board was horrible. I owned multiple W530 units and several X1 Carbons and the keyboard was the best but not on the W540.The keys actually made a crunching noise like they were scraping on something. The keys actually got stuck around the little red button used for navigation. The keys that did work had a hollow sound like the whole keyboard was loose or unsupported.It gets worst!  This W540 was screwed up as it would not shut down right after the bat. One error message after another, then it would no longer boot up. It was either missing drivers or they were bad. I could not even begin downloading updates, heck I could not even do a restore before I packed it up to send back to Lenovo. This was a $3200 laptop that did not work. If you have to have a Lenovo, save money and get a W530 as it was the last decent model they had.Do not know what I will do not as I have been buying Thinkpads for 20-25 years but not any more.", "Date": "April 17, 2014"}, {"Title": "the wors of lenovo", "Author": "marek niebudek", "ReviewID": "R1QENZ3DWOA7E9", "Overall": "1.0", "Content": "the keyboard is the problem track point  das not have left and right button like the x220 tablet .There  is no single reason for me to buy Lenovo anymore .why spend so much money for computer which is no different then  other laptops  on the marked . The legendary  Lenovo keyboard  was the  main reason to buy Lenovo laptops for many people like for me my self. For this price you can buy much power full laptop  then this one .,another think Lenovo is making with cheap  plastic stinking plastic the body of the laptop stings for the weeks  .this is un healty", "Date": "April 8, 2014"}, {"Title": "Bad Graphics", "Author": "Aisha Tarraf", "ReviewID": "R3KDN81GSB5ZRR", "Overall": "1.0", "Content": "The graphics werent a good as i anticipated. It was such a dissapointment. Not worth the money i paid for at all.", "Date": "March 30, 2014"}], "ProductInfo": {"Price": "$1,949.00", "Features": "Processor: Intel Core i7-4800MQ Quad Core Processor (6M Cache, 2.70GHz - 3.70GHz) 47W\nHard Drive: 256GB Solid State Drive\nRAM: 8GB DDR3 1600MHz 1.35V\nOptical Drive: SuperMulti 8X DVD+/-R/RW Dual Layer", "Name": "ThinkPad W540 20BG0014US 15.6\" LED Notebook - Intel - Core i7 i7-4800MQ 2.7GHz", "ImgURL": "http://ecx.images-amazon.com/images/I/41OxfeVenpL._SX300_.jpg", "ProductID": "B00HD7IX7K"}}