{"Reviews": [{"Title": "Lenovo is really bad", "Author": "Narek", "ReviewID": "RHE8YG9ZY1MBS", "Overall": "1.0", "Content": "I bought this lap top in summer. It's screen started tripping in 2-3 months. I couldn't work on it cause the mouse pointer was running to the same point on the screen. I sent it back to customer service, I had to pay for shipping. Then they told me that it's broken and default warranty doesn't cover it and that I have to pay $180 to fix it. They kept it for a month before telling me that. I was like, f*** that, just fix it and send it back ASAP. Sending it back also took 3-4 weeks.For a while after that it worked ok. But in a month mouse right button stopped working. Then in a week or so the same problem that they took $180 to fix appeared again. That's called \"f***ing up customers\". I tried to get a refund but figured out that hours spending on phone cost me more than just going and buying a good lap top from a good company. Not a crappy Lenovo.", "Date": "March 27, 2014"}, {"Title": "Like my Lenovo", "Author": "Jeanne Bailey", "ReviewID": "R3KKN4YD2YCUTP", "Overall": "4.0", "Content": "perfect for the person who is always on the go.  I am a realtor, which means my workplace is never in one place.it is lightweight, just big enough, and fast.", "Date": "March 21, 2014"}, {"Title": "Lenovo S400 lap top", "Author": "sdgrrl", "ReviewID": "R1FX1TZSOZB7BO", "Overall": "4.0", "Content": "I'm still getting used to Windows 8, but I like this computer so far.  It doesn't have a disc drive, so that's kind of disappointing, as my VHS/DVD player just died on the DVD side, so I'm not able to watch my DVD movies.  The keyboard is just different enough from my last Lenovo that I hit the wrong keys pretty frequently.  But, this computer is fast, user friendly, light weight (no disc!) and has great sound and picture.  Overall I like it really well and am pretty glad I purchased it.  I would give it 5 stars if it had a D drive.", "Date": "May 3, 2014"}, {"Title": "My daughter is very happy with everything except the amount of apps that windows ...", "Author": "Julie Knight", "ReviewID": "R3HA69BTXNIBSV", "Overall": "4.0", "Content": "My daughter is very happy with everything except the amount of apps that windows 8 keeps putting on the computer. Once we figure out how to stop that it will be a 5 star rating.", "Date": "April 22, 2014"}, {"Title": "Convenient size, works very well, extremely good keyboard", "Author": "A. Radu", "ReviewID": "R168I44HEULB7", "Overall": "5.0", "Content": "This is a lower-end laptop, in that the battery isn't particularly long lasting, and the keyboard isn't back-lit. However, for the price is it an exceptionally good laptop. The touch screen works well, the computer is fast and responsive, it is light weight, and feels sturdy.I use it for day-to-day things like browsing, email, printing and scanning, and Skype.", "Date": "April 5, 2014"}, {"Title": "all in all it is a good buy", "Author": "Nikita", "ReviewID": "R3NUDDIRQIZQGD", "Overall": "4.0", "Content": "i gave the lenovo ideapad s400 a 4-star rating because it is a great device especially for this price however it does have its faults.Pros-touch screen works smoothly, making windows 8.1 a great overall experience-very slim design, lightweight making it very portable-accutype keyboard is easy to use but not that much different from any other keyboard-loud speakerscons-short battery life, about 3 hours max-black plastic on the inside shows palm prints and mucky residue-freezes from time to timedefinitely a good buy, not too expensive and great value for money", "Date": "May 27, 2014"}, {"Title": "Good Notebook for its price", "Author": "Jyotheeswar Reddy", "ReviewID": "R3T550892U9W67", "Overall": "4.0", "Content": "I was looking for a laptop with light weight.My usage is manly productive applications like Office and Presentations.Build quality is not that great but considering the price its good.I'm using it daily. No issues so far.", "Date": "May 22, 2014"}, {"Title": "Stay Clear of Lenovo", "Author": "Jack E. Davis \"JED\"", "ReviewID": "RE4UL97IMF5LW", "Overall": "1.0", "Content": "From the moment I brought the computer home, it has crashed, noting a DCP watchdog violation. I have spent three months on the pone with tech people. Hours of attempted solutions have consumed days. No one has a clear understanding of the problem and each new tech reads an instruction manual and guesses at what to do to fix it. Finally, they told me to send it in so engineers can look at it, though Lenovo admits no one knows what to look for. Instead, I persuaded Office Depot to replace the computer. The new one has the identical problem. Lenovo says send it in. But this would mean being without the computer for 7 to 10 days with little expectation that the engineers will return it having fixed the problem. I walked out of the store with a computer that the manufacturer says I need to send across the country before it will work correctly. Makes no sense.", "Date": "March 25, 2014"}], "ProductInfo": {"Price": "$539.99", "Features": "Intel Core i3-3217U 1.8 GHz Processor\n4 GB DDR3 RAM\n500 GB 5400 rpm Hard Drive\n14-Inch Touchcreen Display\nWindows 8.1; 5-Hour Battery Life", "Name": "Lenovo IdeaPad S400 14-Inch Touchscreen Laptop (59408545) Silver", "ImgURL": "http://ecx.images-amazon.com/images/I/51mTc8uG3FL._SX300_.jpg", "ProductID": "B00HIY9HQ4"}}