{"Reviews": [{"Title": "Hardware: Excellent. Windows 8.1? Not so much", "Author": "Doug Hibbard", "ReviewID": "R3EGYJ23VLZOWB", "Overall": "4.0", "Content": "Ok, let me be honest up front: I was reluctantly dragged from Windows 7 onto 8.1 with this laptop. If I had a stand-alone version of Windows 7 instead of pre-installed from a prior laptop, I would revert. Heck, if this thing had a 3.5 floppy, I'd put DOS 6.22 and Windows 3.1 on it. (Yes, these are on floppies in the attic. What are you going to do, call Hoarders?)Hardware: the biggest hardware flaw I find is that 4 GB of RAM just doesn't seem like enough with Bloatware 8.1. I'm waiting on a lost package of RAM to see how much better it gets with 8 GB instead of 4, but that's not happening any time soon.The touch screen interface is helpful. It makes 8.1 actually work like designed, a major improvement over the trouble my wife had with 8.1 and a mouse/keyboard setup. However, now I've got the smudges on the screen.Audio is good, video is good. Are they as awesome as your super-giant-HDTV? No. It's not going to be that good. Thor still looks like he's in a movie, not alive and trapped under glass. It's a computer, meant for multiple things, not just for TV viewing.Outputs are good. The USB ports are basically recessed, which is nice. I like that about the release button on the optical drive as well.It boots fast, and then bogs down as Windows takes over. My Linux dual boot was quite nice, but I can't get the touch screen to talk to it, so that's a drawback for the open-source side.Wireless has good sensitivity. Sony software is okay, but not amazing. Included software is like included software: not bad but not excellent. They want you to buy excellent.In all, a fine mid-grade laptop for general use.", "Date": "March 7, 2014"}, {"Title": "MORE Than Adequate \"Everyday\" Laptop", "Author": "USMC Combat Vet \"Retired!\"", "ReviewID": "R1U1VB3ECMD40F", "Overall": "4.0", "Content": "I scored like never in my life on Vine this week. Tomorrow is my birthday and I will have unbelievably survived to be 65 years old. If you knew my life, you wouldn't believe it possible I am still here....WHAT an amazing present since I got this Sony VAIO SVF1532DCXW 15.5-Inch Touchscreen i5 Laptop AND I got the Sony VAIO SVF1532BCXB 15.5-Inch i3 Laptop as well! THAT my friends is the birthday present of my life. I will start with this I5 model since it is suppose to be the more powerful of the two if you look at specs alone, and come with a touch screen the other does not have. These 2 computers are in the exact same family, this model has the touch screen and the faster I5 over the other I3 processor and a bit more RAM. So it is the winner right?  NOT so fast. Windows 8.1 really made it a pain to get that good old Windows Performance data so I downloaded a nice little FREE program called WINAERO. I ran benchmarks and my assumptions of the touchscreen sucking power were correct. But it sucks FAR more than I ever would have dreamed. See the comparisons below of how the two compared:THIS Model:Windows Experience IndexComponent What is rated Subscore & Base scoreProcessor Calculations per second 7.2Memory (RAM) Memory operations per second 5.9Graphics Desktop graphics performance 4.5Desktop graphics 3D business and gaming graphics performance 4.9Primary hard drive Disk data transfer rate 5.9RESULTS are BASE SCORE=4.5 Overall__________________________________________________________________________________  OK, now the so called LESSER little brother with the I3 with NO touch screen:Component What is rated Subscore & Base scoreProcessor Calculations per second 6.5Memory (RAM) Memory operations per second 7.2Graphics Desktop graphics performance 5.1Desktop graphics 3D business and gaming graphics performance 5.2Primary hard drive Disk data transfer rate 5.9RESULTS are BASE SCORE=5.1 OverallCreated with Winaero WEI tool____________________________________________________________________________________________  So there you go and I have to say the black is FAR easier to see & read the keys in daylight with better contrast. They BOTH are back lit by the way which just makes my day. Never expected that. The keyboards BOTH blow me away with their silky smooth feel and NO glitches or surprises. If you read my recent reviews of my 3 Samsung laptops you will see I have been living in a nightmare with them. I will be selling them now (except my WONDERFUL Samsung Series 7 Gamer Laptop). The others have been NOTHING but trouble and in so many ways I will never again buy ANY Samsung computer. Their gaming laptop had turned me into a Samsung fan boy of sorts but never again....These 2 new Sony laptops feel and look like 3 times the quality of any Samsung or Acer Or Asus I have owned. I feel they are even a touch nicer than my wife's old HP. Tonight, she can pick whichever one of these she wants. The best birthday present to me of all is being able to give HER a new & modern computer I could never have afforded otherwise.  I have an issue with paint however. On the white model (THIS review) I simply set it on end up against the black one. I retrieved it and got 2 BAD scratches where it apparently has such soft paint that just laying against the Vaio logo on the other totally wiped out that pretty white paint...MY fault but no excuse for that on Sony's part wither in my opinion. To date, that is my only gripe with this computer.  The touchscreen....What can I say, DUMBEST idea on earth in MY opinion is any touchscreen on a full sized laptop! And just look at the performance hit you take with it included over it's little brother. Plus, being disabled there is NO way I am reaching way over to that screen, plus who wants any smudges all over such an amazingly HD sceen? If I reach that far for ANY thing at all it will be for a beer. And speaking of these Sony screens. Want amazing resolution? These HAVE IT!  My more expensive Samsung's (here I go again) do NOT. These 2 lower spec Sony laptops outperform my Samsung's for all the everyday use I throw at them, feel better, type better LOOK way better and have a CD/DVD burner that my Samsung's do not? EASY decision for me at least. Then there is the 2 second wake up time from sleep. I would say it is quicker. By the time I pry that lid open I am lit and going. Amazing. Just getting rid of the nightmare password on initial boot up was my only headache since I don't need all that security.  That's about all I can say. I LOVE these computers. Fast, pretty, feature rich and affordable mainstream laptops but with added GORGEOUS screens to boot. And let me not forget sound. LOVE it. They ingeniously placed the stereo speakers in FRONT of the laptop firing directly INTO you. Just keeps coming up with more and more to love. Now all I have to do is find one of my old surfboard or Harley stickers to cover those sad scratches......", "Date": "February 26, 2014"}, {"Title": "It's Too Bad I'm Not Reviewing Windows Instead", "Author": "Dee", "ReviewID": "R3MCGSTQFCV74C", "Overall": "4.0", "Content": "There would probably be not a lot wrong with this computer if it weren't for Windows 8.1After returning a brand new Sony computer last week and purchasing this model instead, I'm frustrated once again with a disappearing mouse pointer (sometimes for an entire minute- or two or three), disappearing webpages, pages freezing for a prolonged period of time, sidebar appearing and taking over for no apparent reason, contending with sudden appearance of the new app screen that comes out of nowhere, and pages that increase and decrease greatly in size unintentionally with the swipe of the mouse (which may actually be a new feature that I've accidentally done about 50 times within a few hour period.) Thinking I'd have to return this also, I then decided to do a search on problems with Windows 8- and there they all were. While it's a frustrating situation with a brand new computer, I feel it unfair to NOT give this laptop at least 4 stars because it would be unfair to Sony not to. It would be more accurate to rate it with Windows 7. Any new computer with Windows 8 installed may present these same problems, so if you buy this laptop and experience these issues, it is not the fault of the laptop.The only other thing is that I assumed this laptop to be a lighter cotton candy pink with a white keyboard; it is not, it is more of a somewhat medium rosy mauve metallic finish with a silver metallic keyboard. The computer I returned last week was white and actually had a nicer appearance, but that's more a matter of esthetics and preference.All this being said, this Sony keyboard (along with its backlit feature) is just such a dream to use, so I'll stick with it with the hope that Microsoft irons out the glitches with Windows.UPDATE: I just found out that Windows 8 was created for touchscreen users. I have no interest in using the touchscreen, which this laptop has; I see zero need for it when the keyboard is closer and easier for me to use. I can't imagine why no one at Microsoft felt it necessary to come up with an upgrade that was user friendly either way.", "Date": "February 24, 2014"}, {"Title": "It's a good laptop, but...", "Author": "Rane E Stark", "ReviewID": "RZJVJESZ5GJ5L", "Overall": "4.0", "Content": "First, let me say that this is a good laptop. It's fast and it has a great screen. I hate Windows 8, but I do not hold that against the laptop. The hardware is fine, though it doesn't feel as sturdy as I would like.All that being said, I don't know that it is a good value. It's a good laptop, but it is not a great laptop. So, here are the things I like and don't like:GOOD* USB 3.0* A USB port that charges devices even when the laptop is powered off.* Full-sized keyboard with 10-key number pad* Very nice screen* ArtRage Studio 3.5* Expandable to 16 GB of RAM* Fast charge/good battery life* TouchscreenBAD* Flimsy keyboard* 4 GB of RAM* Lack of an eSATA port* No Blu-Ray* Left-click area is integrated with the touchpad, which causes the mouse to move when trying to click (annoying!)* Small hard drive* Weak graphics* Vaio CareIn general, I just don't feel like this laptop is a good value. For comparison, the laptop that I bought in September 2010 is an 17.3\" HP Pavillion core i7 1.6 GHZ with 6 GB RAM, 640 GB hard drive, Blu-Ray, and a Nvidia GeForce GT 230M graphics card. That computer cost me $900 3.5 years ago. I've looked around and laptops with similar specs to this one are selling from other manufacturers, including HP, for noticeably less.This is a good laptop, but I don't think it is a good value. Sony tends to over value their products, imo. I don't mind paying more when I am getting better quality, but this is not better quality. The keyboard feels flimsy and gives a little while typing. My HP is solid and feels solid, this laptop does not feel solid and well-made. It doesn't feel like it is worth the extra money.I gave it four stars, but really it is more like 3.5. Since prices are fluid, I didn't really factor in the value in that rating. It's based only on the quality of the hardware. I recommend anyone looking for a laptop shop around and get their own idea on pricing and value.", "Date": "March 2, 2014"}, {"Title": "Great laptop & looks awesome!", "Author": "Amazon Customer", "ReviewID": "R3M8T7LF3KVSU4", "Overall": "5.0", "Content": "It took me a minute to learn windows 8, if this is going to be your first computer with Windows 8 there is definitely a learning curve. But as far as the laptop goes it is working fine no issues. It ran a bit slow for me in the beginning (so slow I was tempted to return it) but I think it may have been because of the updates. After a few days of use, it started running smoothly. Love the touchscreen feature and the suite of additional Sony programs.", "Date": "May 14, 2014"}, {"Title": "Perfect laptop for me", "Author": "iriejamaican", "ReviewID": "RWN24DM9HYABA", "Overall": "5.0", "Content": "bought a white one and after 2 days i have zero complaints. after reading reviews for similar laptops and was totally apprehensive but all fears have vanished. windows 8 took a lot of flak but i personally im content with it...there is a learning curve but its not as grave as some may say. i must say that i'm in the minority that preferred vista (after most of the updates) to xp ~('.')~. mostly because of the start feature. windows 8 will definitely take you out of your comfort zone at first but you'll get the hang of it.all in all its a great laptop. was delivered on time and everything works.Update: 26 Apr 2014still no complaints...however i have to get a new wireless router. The laptop was working perfectly with the router initially but then windows updated this was no longer the case. Apparently there are some routers that are windows 8 compatible and some are not - my router is about 6-7 years old. the router still works with my playstation and phone.I mention this point because a lot a reviews i read had negative things to say about the wireless features of this model laptop.", "Date": "March 5, 2014"}, {"Title": "Love it", "Author": "K. Nordhus", "ReviewID": "R38FCVY5XCXV3X", "Overall": "4.0", "Content": "Love the laptop but really don't care for the new version of windows, unfortunately it looks like I'm stuck with it.The backlit keyboard is pretty handy for using in a dark room and I love the fact that it's so thin light-weight.Overall I would have preferred that it had more than 4 GB of Ram but other than besides not liking windows 8.1 I have very few complaints with this laptop, its fairly fast and more than adequate for any task that you might require of it. My son likes to use it for gaming and so far has had no complaints about it not being up for anything that he has required of it.", "Date": "April 9, 2014"}, {"Title": "Pretty in pink", "Author": "Amazon Customer", "ReviewID": "R3EHAVK4DAIZMS", "Overall": "5.0", "Content": "I just got this pink sony laptop a month ago. I really wanted a pink laptop. This computer has windows 8.1 running on it. I had to adjust to windows 8 but I have come to really like it. The computer came with 4 usb outlets wow. It runs pretty well so far with no complaints. Technical details: 4th Gen Intel® Core(tm) i5 processor; 15.5\" display; 4GB memory; 500GB hard drive. Special features: Bluetooth; touch screen; backlit keyboard; HDMI output. I brought this laptop on Amazon. They shipped it in no time.", "Date": "March 28, 2014"}], "ProductInfo": {"Price": "$779.99", "Features": "Intel Core i5-4200U 1.6 GHz\n4 GB DDR3L SDRAM\n500 GB 5400 rpm Hard Drive\n15.5-Inch Screen, Intel HD Graphics 4400", "Name": "Sony VAIO SVF1532DCXB 15.5-Inch Touchscreen i5 Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/41oA4i5EIeL._SX300_.jpg", "ProductID": "B00HG6W5O0"}}