{"Reviews": [{"Title": "A great laptop", "Author": "S. S. Richards \"S, Steve Richards\"", "ReviewID": "R3BA5S42VZ6XUP", "Overall": "4.0", "Content": "This model Toshiba Laptop is fast and useful for all my needs. I was sorry to leave my familiar old XP desktop, but learning windows 8 isn't the chore i thought it would be. It Comes with Intel Core i7 Processor 8 GB DIMM RAM and 1 TB . Hard Drive. It also comes with a back lighted keyboard, DVD/CD drive and 3 USB slots and a Hdmi slot.  I feel I have the flexibility to do all I need. I'm sure I have a good investment .", "Date": "April 15, 2014"}, {"Title": "Fast processor, uncomfortable framing to rest your hands", "Author": "Gary", "ReviewID": "R35PKRAEYM7TCA", "Overall": "3.0", "Content": "I enjoy the robust speed and quiet sound of the laptop. The speakers are ok, not great, not bad either. The keyboard is smooth and perfectly placed numeric keys, unlike Samsung laptops. However, the plastic framing is rough and kinda annoying. ITs sharp on the ends and you cannot rest your hands very long. Other than that, not bad at all.", "Date": "February 26, 2014"}, {"Title": "Toshiba Satellite S55-A5154 15.6-Inch Laptop", "Author": "Eduardo Quevedo", "ReviewID": "R1OQJZSRM3SYYR", "Overall": "5.0", "Content": "It's a beautiful machine, just like in the pictures. The delivery service is the best, I'm very happy with my new lap top.", "Date": "May 20, 2014"}, {"Title": "Good product", "Author": "Justin Bressette", "ReviewID": "R3EZVTHII2VTWC", "Overall": "5.0", "Content": "This is a great lap top, windows 8 takes some time to get used to. But this product has exceeded my expectation.", "Date": "April 28, 2014"}, {"Title": "Works great so far", "Author": "Gunnar B. Podolec \"Podolec\"", "ReviewID": "R394LQJ76VM6RB", "Overall": "4.0", "Content": "I have only had it about a week and everything is running great. Fast boot time, good screen, reasonable benchmarks (Note this is performance not graphics. Because its integrated graphics it’s almost pointless to benchmark them). The things I dislike are the DVD rom and the plastic chassis are way cheap.", "Date": "March 11, 2014"}, {"Title": "Very nice product", "Author": "Amazon Customer \"Craig H.\"", "ReviewID": "R1RZZPHQ8E6FUU", "Overall": "5.0", "Content": "This is an amazing laptop, it is sleek and has the processing power and ram needed to run software. The keyboard lights up and it looks very nice, not cheesy at all. It's not a touch screen but that is not a big deal. It does have some weight to it, it is not light like a tablet but not big and bulky either.", "Date": "June 3, 2014"}, {"Title": "Excellent!", "Author": "JCgt", "ReviewID": "R3D2OE2LLVQI43", "Overall": "5.0", "Content": "excellent laptop. Due to the processor, the speed is very good. responds very well.The only downside: few USB ports, but it's a detail.points:Design: 10/10Speed: 9/10Size: CompactAudio: very acceptable 8/10", "Date": "May 31, 2014"}], "ProductInfo": {"Price": "$819.99", "Features": "Intel Core i7-4700MQ 2.4 GHz Processor\n8 GB DIMM RAM\n1 TB 5400 rpm Hard Drive\n15.6-Inch Screen, Mobile Intel HD graphics\nWindows 8.1, 3.91-hour battery life", "Name": "Toshiba Satellite S55-A5154 15.6-Inch Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/41Gzj%2BRcZtL._SX300_.jpg", "ProductID": "B00HWM5PMW"}}