{"Reviews": [{"Title": "Microsoft should be afraid", "Author": "A. Jay Hunter \"Nerd\"", "ReviewID": "RL4NWRDCX033G", "Overall": "5.0", "Content": "UPDATE 2! March 6 2014So I bought this model from MacMall for the same price and free shipping.  It came today.  The real question is is this model better than the 2gb model for $30 less money?  And the answer is it depends.Both the 2gb/4gb models are great.  They can handle a lot of open tabs that are running shockwave and streaming video.  And unless you are doing something extreme they will both be more than enough.  So here are the tests:1.  I ran the browser bench mark Peacekeeper [...] and both computers averaged 3050+ in the tests.  So no real performance gain.2.  The next test was I went into the command line (ctrl+alt+t) and ran top.  The interesting thing is that both computers have swap space on.  Swap space adds 150% of the system memory to a swap area on the SSD.  This is interesting because this is turned on by default, and the 4gb version comes with a 16gb drive, yet 6gb can be used for swap space potentially leaving you with only 10gb of useable space.  the 2gb version comes with a 32gb drive, and uses only 3gb of swap space.  This still leaves you with 29gb of swap space.  So for testing I opened up 10 tabs with an hd youtube video playing, both computers handled that just fine. The 4gb had not used any swap but the 2gb was using swap space. I then opened up 20 tabs with the same 1080p youtube video playing, and the 4gb was just starting to use swap space, and the 2gb version had used up all of its swap space.  I continued to open 30 tabs and both units could do it but, the 4gb acer was still going, where as the 2gb unit was killing web pages and posting the \"something went wrong or we ran out of memory\" error.  No issues with the 4gb killing windows, but I am sure if I opend 40 or 50 I would have started getting the same type of out of memory errors.  4gb is definitely better.3.  I disabled swap space and rebooted (swap disable). Both units ran fine at 10 espn windows, but at 20 open espn windows I ran out of memory, with the 2gb version, and started seeing a few out of memory windows.  The 4gb version was fine. What I also noticed is that the 2gb version would close the content of a tab without erroring out, and when I went back to that window it would be blank, and start to reload the page.  I did not experience this with the 4gb version.  The take away here is that you can disable swap on the 4gb version and have all 16gb of your storage.  In regular use I would never use all of the system memory of the 4gb so swap is not needed.  Google enables it by default so you would need to go into the command line and type \"swap disable\" (no quotes) and reboot to get back that extra 6gb of ram.  To be honest I would rather have the 2gb version with the swap enabled and the 32gb ssd if I were going to do this.4.  I turned the swap on again and ran 30 espn tabs and one 1080p movie (less stress on the network cards).  Again the 2gb version of was blanking pages and erroring out as he had ran out of memory.  The 4gb acer was running just fine, although shockwave did crash on the 4gb acer I reloaded all the pages and it was fine.  (When shock wave crashes in one tab it crashes in all of them).  Also with 30 tabs open the 2gb hd video was stuttering while the 4gb was rolling along.  So 4gb of memory with 6gb of swap for a net of 10gb of memory is the way to go.So which one to get, I am a tinkerer so I had to get the 4gb Acer, BUT I am going to add the 128gb ssd to my acer tomorrow so I can have the best chromebook out for only $429.  (This is less than my older samsung which cost $550 and didn't have touch screen, hdmi, USB3 or Bluetooth).  And I can get THREE of these laptops for the price of one google pixel.  The c720p-2625 with the upgraded ssd is going to be the best value in a chromebook.  If you didn't want to spend this much money and don't need the touch screen get the least expensive chromebook with 2gb memory/16gb ssd and no touchscreen.  $199 its a great deal if you like google chrome.=====================================================UPDATE!Sorry I wrote this review for the 2GB version which we already have, I have the 4GB version on order as soon as they come in I will update my original review.  The obvious question will be is the 4GB worth it over the 2GB version?=====================================================Bought this for my kid, and he loves it.  I am actually going to get the 4gb version when it comes out next month.  It does what he wants it to do, youtube, video chat, email, and google docs.  He thought he was getting \"Scroogled\" until he realized he didn't do ANYTHING with Microsoft.When I do need to use a Microsoft computer, I load it with Chrome and use the Chrome Remote Desktop App to use the Microsoft Applications.  Battery life is about 8 hours, sound from the speakers is loud, bluetooth works fine, the ONLY fault I could find is that I couldn't get sound out of my HDMI cable to play through my tv.  Something I will sort out another time.Love it!", "Date": "January 22, 2014"}, {"Title": "Outstanding device in every way - in the sweet spot of price, performance and features.", "Author": "Penn Name", "ReviewID": "RQIA1WUKUU3NT", "Overall": "5.0", "Content": "With my Lenovo laptop, purchased at Circuit City on the last business day, becoming increasingly fragile, I've been keeping an eye on the Chromebook hardware for the past 8 months. There were lots of models but none had a price/performance profile that I found compelling enough to buy. The Acer C720p-2625, with 4 GB of RAM, a speedy, low power processor that provides over 6 hours of use between charges, HDMI and USB 3.0 and a touchscreen at about $330 (on MacMall - Amazon is not stocking this specific model at them moment) can't be beat. I'm lazy when it comes to closing tabs. With 4GB of RAM (2GB more than most of the other C720 models) handles 20 or 30 open tabs with ease. The keyboard, although the key depth is small, is nonetheless quite responsive. Battery life has lived up to published spec.On top of the great hardware, the Chrome OS was even more surprising. It is well organized, polished and remarkably feature rich. If you still have a traditional Windows laptop/desktop around, the Chrome Remote Desktop add on let's you access it effortlessly and securely. At this price point, with robust hardware and a comprehensive OS, Chromebooks will be the device of choice for many buyers and are certain to cut deeply into sales of traditional laptops. This model, as far as I'm concerned, is the best Chromebook available today.", "Date": "April 11, 2014"}, {"Title": "Great little work laptop for travelling", "Author": "S. Lee", "ReviewID": "R133WCK0ES4GV7", "Overall": "5.0", "Content": "It has great battery life and Chrome OS is great for browsing. If you need additional software, you can add on ubuntu via crouton method.", "Date": "May 5, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00HKU68RW"}}