{"Reviews": [{"Title": "Absolute Perfection!", "Author": "Lizzie", "ReviewID": "R26DAOSG6FXJBC", "Overall": "5.0", "Content": "I am beyond impressed with this laptop! This is my first Asus and I've had it for a little over 6 months now and it is truly a delight. Processor is fast and the HDD runs like an SDD. I love the white color and it's really hard to find these out there these days in color. I was hesitant about Windows 8 but I quickly adapted and actually think its one of the best OS on the market today. I definitely recommend this laptop to anyone looking for a strong starter laptop or it definitely would be great for a college student! Cheers!", "Date": "December 29, 2013"}, {"Title": "Absolutely Wonderful!!", "Author": "Brittany", "ReviewID": "R1DSM3JKJGYH60", "Overall": "5.0", "Content": "I got this laptop as a gift to myself for my 20th birthday. Since I am currently paying for student loans I was looking for a laptop on a budget and I have to say the price was an absolute steal for the quality of the product. This laptop was in fact refurbished but you would never guess that it was. It runs great and there were absolutely no cosmetic flaws. I love that it came with Windows 8. I upgraded from a laptop that stil ran on Windows Vista so the change was definitely welcomed. The laptop looks really high end but doesn't cost an arm and a leg. I would recommend this laptop to everyone looking into buying a new one! It is absolutely wonderful!", "Date": "March 20, 2014"}, {"Title": "Love it!", "Author": "Alicia Freeman", "ReviewID": "R16QRQSIQ77XKU", "Overall": "5.0", "Content": "Love my new laptop! Great product, refurbished but looks brand new. The price was also amazing for the quality and I love windows 8.", "Date": "March 20, 2014"}, {"Title": "Great Purchase", "Author": "Kerri Peart", "ReviewID": "R2RV2C7FFKZONE", "Overall": "5.0", "Content": "This was such a great purchase. I needed a new laptop after retiring my 6 year old HP laptop. The ASUS was great for the budget I had at the time and the fact I quickly needed something to continue dealing with school work and working from home tasks. I really enjoy this laptop. Even without a CD drive it is functional, lightweight, quiet while in use, sound is great when listening to music etc, battery saving mode is awesome...all round very very good buy. Thank you ASUS for this practical model :)", "Date": "February 9, 2014"}, {"Title": "Install UBUNTU instead", "Author": "Coder0585", "ReviewID": "R157Q5HLLR45OR", "Overall": "5.0", "Content": "For people that use Windows 8, I would encourage you to install Ubuntu instead as your main OS if you're a computer geek like me. I have had Windows for many years now and after installing Ubuntu on this laptop I never looked back to Windows. This laptop seems like a really expensive one, but for this price, you can't really beat all the nice features it has. I highly recommend this laptop to computer geeks that want Ubuntu installed to replace Windows 8. Thank you for reading.", "Date": "April 26, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00H34863Y"}}