{"Reviews": [{"Title": "A Real Performance Beast to Replace My Desktop", "Author": "Fida Gillani", "ReviewID": "RNRY3YILHOSDM", "Overall": "5.0", "Content": "Sorry for a Lengthy review, I just wanted to share everything with everyone out there who wants to buy this PerfoMonster (Performance Monster :) ).I had bought the customize version of this laptop. My laptop has Core i7 4700MQ rather than 4800MQ 24GB of Memory. I’ve explained the reason of customization below. I am writing this review after 2 weeks of usage. Before this I was using two laptops HP Pavilion dv4t (Core 2 Duo, 14’’) and HP Pro Book (Core i5, 15.6’’) with Crucial SSD as primary hard disk. I am a PhD student in networking field and I’ve to run applications that demands higher performance other than gaming e.g. running multiple virtual machines, formal theory solvers, etc. and above all Microsoft Office . Also, I love playing games and HD media streaming a lot connecting to my 3D HDTV. In this review I’ll write about every aspect of this laptop that I’ve tested and experienced. I am not a professional reviewer, so, this is just an end-user sharing his experience. Why 4700MQ and not 4800MQAccording to performance comparisons, 4800MQ is almost 10-15% better than 4700MQ with a price difference of just 125-150$. My budget was low so I used this money to buy Samsung 840 EVO 250 GB SSD for 130$. And, anyone who is buying this laptop and not considering upgrading with SSD will stay a loser (sorry for harsh wording). You can only unleash the real potential of this perfomonster through an SSD upgrade. But, don’t buy it from any seller but upgrade it yourself, it is much cheaper and better. Dimensions and WeightI could never guess the actual size and dimension feeling from just reading the dimension and weight specifications. In dimension it is just like HP Pro book (15.6’’) but the only difference is in the height from backside of the laptop or its girth. It’s just like holding GRE/GMAT book in your hand. About the weight, it’s just like carrying atleast a Gallon of whole milk, definitely not skimmed , in your laptop bag. For me it’s ok because I have a table in my research lab, where I put this laptop and work the whole day. At home, I sit on my Poang chair, stretch my legs on foot rest, and put this on a wooden shelf (4 ft long, 1ft wide, bought from IKEA), which I then put in my lap. This is my working posture at home and until now I haven’t felt any extra heat or weight because of this laptop. It’s feeling is really sturdy as everyday I put it in my laptop bag and take it out and I haven’t felt any less durable feeling. Gaming PerformanceThis is definitely a perfomonster when it comes to gaming. I’ve played Battlefield 4, Max Payne 3, Batman Arkham Origins, Bioshock Infinite, Crysis 3 and Assassin’s Creed Black Flag on this beast. I didn’t use the Turbo option of the laptop for any of these games and I’ve used FRAPS utility to observe Frames Per Second (FPS) in each game. One interesting observation regarding gameplays, NVidia has introduced this GSync capability with these GPUs which dictates the refresh rate of the screen, especially during low FPS, to enhance smoothness. I really felt its affect when playing Assassin’s creed when FRAPS was showing me just around 23 FPS with ultra-settings but gameplay was so smooth that I didn’t feel any jitter or stutter. This is my logical explanation but this smoothness might be of different reason. Now the benchmarks (Ultra = Highest possible graphics settings):Game = Battlefield 4, Graphics Settings = Ultra, Resolution = 1080P , Average FPS = 35, Comment: Gameplay was really smooth except during high explosion and smoke FPS drops to 25Game = Bioshock Infiniti, Graphics Settings = Ultra, Resolution = 1080P, Average FPS = 60, Comment: Real smooth gameplay throughoutGame = Batman Arkham Origins, Graphics Settings = Ultra, Resolution = 1080P, Average FPS = 40, Comment: Sudden drop of FPS to below 10, it’s because of game problem not the graphics card or somethingGame = Assassin’s Creed Black Flag, Graphics Settings = Ultra, Resolution = 1080P, Average FPS = 23, Comment: Even though FPS was low but real smooth gameplay. I’ll upload a video review as well on Youtube and it’ll be evident thereGame = Crysis 3, Graphics Settings = Ultra, Resolution = 1080P, Average FPS = 19, Comment = The game was very much playable not as smooth as Assassin’s Creed but still not annoying.Game = Max Payne 3, Graphics Settings = Ultra, Resolution = 1080P, Average FPS = 32, Comment = No problem at all, really enjoyed my beloved seriesRegarding other multimedia usage no problem at all (read Heat and Noise for detail) Heat and Noise:The longest I played was almost one and half hour; and during this time fan was on but because of gameplay noise it didn’t bother me. Otherwise, during other usage there was almost no fan noise. Other usage include connecting two other monitors (one 1080P, one 1600 X 900) through matrix technology, playing 1080P streaming video on one (Netflix and Youtube), downloading 25GB of Assassin’s Creed using UPlay and running other browsing and Visual Studio application on the third monitor. All of this was happening at the same time. I also watch 3D movies connecting my 3D Panasonic HD TV and still no fan noise as these tasks are childish for this beast. By the way matrix technology is really so handy, especially if you like opening too much applications at once. About heat, I’ve never felt any heat under my hands while playing games, but sometimes I put my mobile on the left side (this is where heating fins are) and mobile do get mildly hot after sometime. Performance Before and After SSD:I upgraded this beast with SSD and have gone through some bad experience. First let’s talk about benchmarks.Cold Boot Time with HDD = 17 seconds (From button pressed to first glimpse of Home screen)Cold Boot Time with SSD = 8 to 9 secondsBut the real difference is in routine working, opening closing applications, copying data here and there. Another thing, this was not my first SSD as I have used SSDs with my HP Pavilion DV4 (Dual core) and HP pro Book (Core i5) but even then I felt a significant difference in speed.I bought Samsung 840 Evo 250 GB but then switched to Samsung 840 Pro 512 GB. Day to day performance of both SSDs are identical it’s just warranty i.e. EVO 3 years and Pro 5 Years. Crystal Mark benchmarks of SSD before and after RAID optimization and they were almost identical with both.BeforeRead = 500 MBPS,  Write = 492 MBPSAfterRead = 700 MBPS,  Write = 1058 MBPSBut in routine usage I didn’t feel any observable improvement, to be honest. System Up gradation and Challenges:After just first hour, I had upgraded my laptop with Samsung 840 EVO 250GB SSD. Another best thing, buying from XoticPC was that, they didn’t put any warranty sticker outside and therefore I was able to open the back panel without any worry. Instead, warranty sticker is on the heat sink that if somebody tries to play with CPU and GPU then only warranty will be voided. This laptop is built to be upgraded right away. To install SSD into second bay, you’ll find a caddy support and screws inside the laptop box. Don’t through it away otherwise it might cost another 5-10$ to buy a proper caddy. I ran Samsung data migration to clone original hard drive to SSD. It took 5 minutes to clone everything as it was just around 40GB of data. I thought I am good to go but I was so wrong because I didn’t know that, with Windows 8 and higher, Microsoft has enforced such a system that Windows activation is basically not just based upon the Windows key but it’s a combination of BIOS + Hard Disk + Window Key + Some other Encrypted keys. It is called UEFI (Unified Extensible Firmware Interface). After cloning I change the boot order (explained below) to boot from SSD and saw two Windows 8.1 options to boot from. OK. I selected the SSD one, it booted fine, but, when I tried to access windows pc settings or windows store, no luck. I called MSI help line they told me it’s because cloning will not work with Windows 8 or higher . What I did was not the right thing but I end up installing a new windows on SSD. I didn’t find the right solution then but for those who want to do this, there are two options: 1) there is software named “Advanced Tokens Manager v3.5 RC 5”. It generates a backup of all required certificates and then you can restore in the new hard disk. So, after cloning boot from HDD, create a backup of all certificates. Restart and boot from SSD, go to folder and this time do restore. I should solve the problem. 2) This solution was proposed to me by one of MSI technical representative, that, I create a recovery disk using an online MSI utility and then use this to install Windows on new hard disk. I could never test this solution.I’ve had some other experiences as well when I replaced my Samsung 840 EVO with 840 PRO, but it might be irrelevant here. So, please ask me for any issues.For upgrading laptop memory just keep in mind one problem. In the Cooling Booster 2, the heat sink connecting CPU and GPU heat sink is almost passing over the laptop memory slots. Installing one memory module shouldn’t be a problem but if you want to install two memory modules then it’s tricky. Because, you always install module by pushing inward with an angle of 30 Degree and then push downward into the clips. But, due to heat sink there is no 30 Degree angle available for second memory module. So, you just have to push slightly hard straight in from beneath the heat sink rod. Once, you hear the click sound that memory module is properly settled in the slot simply push downward into the clips. But don’t worry, just push slightly harder and as long as you have aligned memory module with the memory slot, nothing will break. Killer Network Cards performance:I am using 15 Mbps Internet connection from TimeWarner Cable in my apartment and I used to wonder why is it not enough to watch 1080P youtube video or Netflix on my laptop through wireless. But, on this killer wireless card I always watch 1080P without any problem. I didn’t upgrade my wireless router or internet connection, so it is definitely this Killer wireless card. In my university, I have 100 Mbps speed and I use wired connection. One day I was downloading Assassin’s Creed (25 GB) and was getting almost 90 Mbps speed but at the same time I was streaming a 1080P youtube video and network was working fine. So, as per my experience it is definitely elite class network cards. Sound:Nothing exceptional but definitely better than all laptops I’ve encountered over the years. It is not very loud but you’ll like the sound as it is more clear, crisp and rich. Plus, you can directly plug in your 5.1 surround system in the sound ports as there are three of them, first for Front speakers (second for Mic), Third for Rear speakers and Fourth for Surround speakers. Another observation, whenever I use HDMI to watch movies on my HD TV, the sound coming through my sound system is much better, which means the graphics card is definitely offering much better audio codecs. DVD ROM:Nothing special but it is so noisy and really annoying, plus it is slow or is it just my feeling. I might in future put something useful inside and take this crap out. Screen Quality:I love it, because every time I watch any HD video it looks great. I’ve also calibrated the screen using native window functionality. So, if you feel it is bit dark then just use that utility (under control panel -> Display) to adjust colors. For me I don’t see a need to go beyond 1080P on this 15.6’’ screen.Whey Amazon because 12 Month financing is available if you buy through Amazon :) using Amazon store card.For all those who couldn’t find MSI download page for drivers, here is the linkwww dot msi dot com / product / nb / GT60_2PC_Dominator dot html # download", "Date": "April 1, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00IMTQ5GY"}}