{"Reviews": [{"Title": "Decent Laptop", "Author": "Shopper", "ReviewID": "RFLD4IIWXUEDN", "Overall": "3.0", "Content": "This laptop replaced a different laptop that failed.Pros:--17-inch screen--Very clear, crisp display--Very quiet.  (Now that I have the new one, I realize how noisy my previous laptop was.)--Runs cool (temperature-wise).  Does not overheat; barely gets warm even with extended use.--Nicely designed; very comfortable to use.--Backlit keyboard; makes it very easy to see the letters/markings on the keys.  This is the first time I've had a backlit keyboard, and I'm really enjoying it.  (Hint:  To turn the backlighting on, simultaneously press these three keys - Cntl, Alt, F5)--Pretty fast machine, except when using the Web.--The built-in microphones are better than I expected.Cons:--Comes with Windows 8.1, which is very different from Windows 7.  It takes time to re-learn and get used to the new O/S.  Additionally, some of my software does not run under 8.1, so I'm having to replace it.  But I think most (all?) new PCs come with Windows 8 or 8.1 now, so this issue is not specific to this machine.--Keyboard touch is on the hard side; I have to press harder than I'm accustomed to when typing.  I'd prefer a lighter touch.--Disappointingly slow when displaying graphic-intensive Web pages, particularly when returning to a previous page via the Back button.  It sometimes takes as long as 10 seconds, and I frequently have to refresh to get such pages to display 100%.--Although the sound quality is fine for my needs, I do wish the volume were higher.  I do not have a hearing loss, but I still have to turn the volume to the highest level to understand Netflix films and DVD videos.  I did not have that issue with my previous laptop, so I don't think it is an issue with the media itself.Overall, I'm satisfied - but not thrilled - with this laptop.June 1, 2014 - I'm downgrading this review from 4 stars to 3 because of the graphics card.  Surfing the Web is frustrating because of how slow it is, and it seems to be getting worse over time.  This is the first machine I've had with a GEForce graphics card.  It's a card I'll avoid in the future.  If you surf the Web a lot, and especially if you do even a fair amount of uploading/downloading, this may not be the laptop for you.", "Date": "May 24, 2014"}], "ProductInfo": {"Price": "$1,105.78", "Features": "Genuine Windows® 8.1 64; Intel® CoreTM i7-4702MQ (2.2 GHz, up to 3.2 GHz, 6 MB cache, 4 cores)\n1TB 5400RPM hard drive with HP ProtectSmart; 24GB solid-state drive SSD with Intel® Rapid Start Technology and Intel® Smart Response Technology; 8GB DDR3L SDRAM (1 DIMM)\n17.3-inch diagonal Full HD Anti-glare LED-backlit display (1920 x 1080) NON-Touch; Blu-Ray Player with Super-Multi DVD Burner\n2GB NVIDIA GeForce GT 750M dedicated video memory and up to 4095MB total graphics memory, HDMI, 4 USB 3.0 Ports; HP Fingerprint Reader\nBacklit Keyboard, Gigabit Ethernet, 802.11b/g/n, Beats Audio quad speakers and two subwoofers, 6 Cell Battery, 120 Watt Adapter", "Name": "HP ENVY 17-j184nr Quad Edition Notebook PC (Full 1080p HD, 2GB graphic, Bluray, Backlit Keyboard) 17t-j100 (8GB RAM)", "ImgURL": "http://ecx.images-amazon.com/images/I/411Em8CaY1L._SX300_.jpg", "ProductID": "B00IM7LD9U"}}