{"Reviews": [{"Title": "Great Laptop", "Author": "Kindle Customer", "ReviewID": "R1MPR2DDTN93U3", "Overall": "5.0", "Content": "This is a great laptop at a great price. Has many features that you would find in more expensive laptop.This laptop comes with AMD A8 Quad Core 1.6GHz with 2.4GHz turbo processor. This processor is great for multi-tasking and gaming. Quad Core processors, to me, are essential when taking the full advantage of all the features Windows 8 has to offer. Hard drive is 750GB with 678GB usable. This is still a good amount of storage space for movies, music, pictures and downloads. Also has DVD/CD drive, not blue ray compatible, for program downloads, movie playback or to burn music/documents. The sound quality I would give a 4 out of 5. DTS sound+ is very clear and crisp, but the overall volume could be slightly louder. For in home use this may not be an issue, but if you use in a busy environment you may need to add external speakers. Graphics are top notch. This laptop uses AMD Radeon 7600 HD. These are true HD graphics and run extremely smooth. From simple video to fast actions scenes the quality does not change. Has multi SD card slot and 3 USB ports. 2 ports are USB 3.0 (which are backwards compatible) and 1 USB 2.0 along with 1 HDMI port. The battery last about 4 hours, depending on type of use, and charges in about the same time. The touch screen is very smooth and responsive. There is a setting to turn the touch screen off if you so choose.Now for the RAM. This laptop comes with 4GB of ram. This is a good amount for ALL entry level computers, meaning you should not get anything less than that. If you do research online you will read that this laptop is \"non-expandable\" in RAM. This is definitely UNTRUE! This laptop is expandable up to 16GB which is compatible with Windows 8 64 bit (the operating system on this laptop). There are 2 DDR3 PC3-12800 slots that are user accessible on the bottom and one is occupied with the factory 4GB. You can upgrade using 2x8GB to give you 16GB. You can even take this laptop to the local \"GEEK\" support and they will do the install for you. With the 4GB ram that this laptop comes with you will not have any performance issues at all. Before I did the upgrade I was able to stream movies, music and do online gaming without any issues. Naturally the more RAM the faster things happen. To do the max RAM upgrade expect to pay between $140-$160 depending on where you buy. Amazon has great price on crucial ddr3 ram and the \"GEEKS\" will charge you $50 to install if you need them.Overall this is a great laptop for all types of user. Windows 8 is very user friendly and only takes about a day or so to master. I have recommended this to many friends that are in the market for new laptop. GREAT BUY!!!", "Date": "March 21, 2014"}, {"Title": "Just what I needed", "Author": "Marcus Aldridge", "ReviewID": "RDKNAUV9OF93", "Overall": "5.0", "Content": "I've been looking for a long time for just the right laptop for my needs. I really like this HP Pavilion 15-n210dx. TouchScreen is very smooth. Sound quality is really nice. Web cam works better than most. Pretty fast performance(faster than I can use). Video playback is awesome! Youtube, and Netflix playback flawless. I really like the new Windows 8. Took a day to get used to. Just call microsoft for help if you need it.", "Date": "March 2, 2014"}, {"Title": "SLEEK", "Author": "Sharon \"Sharon\"", "ReviewID": "R2OTGZBT1P4GV4", "Overall": "4.0", "Content": "I love the  sleek clean lines and the ease of portability. I especially love the lack of clutter on my desk now. Great color, good sound the ease of the touch screen is nice,My only reason for not giving it the fifth star  is the navigation is a bit confusing at times not finding exactly what your looking for immediately. With the windows 8.1program.yes I would recommend it to a friend r give it as a gift.", "Date": "June 9, 2014"}], "ProductInfo": {"Price": "$599.99", "Features": "AMD Quad-Core A8-4555M Accelerated Processor (1.6GHz with Turbo CORE up to 2.4GHz) / AMD Radeon HD 7600G\n15.6\" LED-backlit high-definition touch-screen display\n4GB DDR3L SDRAM / 750GB hard drive\nMultiformat DVD±RW/CD-RW Drive / HP TrueVision high-definition webcam\nWindows 8.1 64-bit / WLAN 802.11b/g/n", "Name": "HP Pavilion TouchSmart 15-n210dx 15.6\" TouchScreen Laptop PC - AMD Quad-Core A8 / 4GB Memory / 750GB HD / DVD±RW/CD-RW / HD Webcam / Windows 8.1 64-bit", "ImgURL": "http://ecx.images-amazon.com/images/I/517I85IgbgL._SX300_.jpg", "ProductID": "B00IL1EISK"}}