{"Reviews": [{"Title": "nice laptop", "Author": "charmaine mustapha", "ReviewID": "R3D5RAYMPWWC0W", "Overall": "5.0", "Content": "Attractive looking, great working ,nice weighing computer.just what i wanted for my daughter. She is just as happy. Delivery was on time. Price was good for the product.We are very satisfied. I  recommend it.", "Date": "May 4, 2014"}, {"Title": "Mediocre Machine at Inexpensive Price", "Author": "A.Trendl HungarianBookstore.com \"What should ...", "ReviewID": "R1ERR0E4Y5XNEA", "Overall": "2.0", "Content": "When I purchased my Asus X550CA, I was experimenting. Could I get a decent laptop without paying a premium price?My needs were simple: I needed a laptop on which I could write.The easy answer is yes. Of course it would support all the related software. What about the rest?The long answer is no. The machine is heavy, prone to freeze and crash, rebooting itself for no known reason. The weight I expected since I bought the laptop in-store.There are reviews which can asses the technically merits of the \"Asus X550CA\" all over the web. Most of us buying at this level don't care about all of that. The only real question is will it help me get my job done? With the unexpected slow speed, the freezing and crashing, the answer is a two-star no. You can work well enough on it if budget is truly an issue, but you'll save money in the long run by investing another $100 or $200 in a better laptop.Oh, and the plug is ungainly, fitting awkwardly into outlets, and sometimes falls out.I'll replace this laptop soon. I don't recommend you buy it.Anthony TrendlAmericanSpeechwriter.com", "Date": "April 20, 2014"}], "ProductInfo": {"Price": "$499.99", "Features": "Intel Core i3-3217U 1.8GHz with Intel HD Graphics 4000\n15.6\" high-definition display\n4GB DDR3 Memory / 500GB hard drive\nDVD±RW/CD-RW drive / Built-in Webcam\nWindows 8 64-bit / 802.11n WLAN", "Name": "Asus X550CA 15.6\" Laptop PC - Intel Core i3, 4GB DDR3, 500GB HD, DVD±RW/CD-RW, Webcam, Windows 8 64-bit (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41mNRakiiHL._SX300_.jpg", "ProductID": "B00IX6C7OU"}}