{"Reviews": [{"Title": "Awesome, Just simply Awesome......", "Author": "Gabe R", "ReviewID": "R1EXQ4JI2PAQO0", "Overall": "5.0", "Content": "I had been looking to replace my current Gaming desktop for something that used less space and was somewhat portable.This fit the bill perfectly.  Performance wise it is very close to my Hasewell 4670K / GTX 680 desktop.  This prompted me to get rid of my Desktop. Everything plays really well Titan Fall, BF4 @ max settings with some AA turned on, this machine just eats right through it. The fan does get a little on the loud side at times.This was also my first purchase from CUK as well. Well they have made a customer for life with me. Their service is top notch.", "Date": "March 31, 2014"}, {"Title": "Wonderful computer", "Author": "Randall Krippner", "ReviewID": "R17WV2SNJ4WD4Z", "Overall": "5.0", "Content": "This is very early to be writing a review because I've had the Dominator for less than 24 hours. I'll add to this review later if necessary. So far first impressions are that this is an outstanding piece of equipment. This particular unit was sold by Computer Upgrade King, and if this is typical of the equipment they upgrade and sell, I'm going to be buying all of my computer equipment from them in the future.It arrived exactly on time, was well packaged. The only assembly necessary was installing the battery and plugging in the charger. The computer itself is one sleek looking machine. One word of warning, it is very big for a laptop. It is, after all, a 17 inch screen with a Blu-Ray optical drive, and it is a gaming machine. You aren't going to squeeze all of that equipment into something the size of a netbook.Computer Upgrade King upgrades many of the systems they sell (hence the name), the the box had been opened, the computer case's seals had been opened, etc. This is still a new computer, however, and comes with a full warranty.Overall build quality is quite good. There is nothing flimsy or cheap about this laptop. The case seems rock solid, the screen hinges are substantial and very sturdy. The keyboard is surprisingly good for a laptop. Touchpad is very responsive, certainly above average. The display is excellent. I noticed no pixel defects, and it is crystal clear.And it is very, very fast. Boot times are a fraction of those of my desktop computer. In fact, it boots up from a cold start almost as quickly as my iCore 7 based Mac with it's SSD. One of the first things I did was drop in a Blu-Ray DVD to test the optical drive, and it works quite well also. The image quality of the video was excellent, and the sound was surprisingly good.I haven't had an opportunity to run software that will put the computer under any real stress yet, but it's done well with everything I've thrown at it so far.Drawbacks? Well, few. It is, alas, loaded with bloatware/crapware as are virtually all PCs being sold these days. I won't launch into a rant about that. It's going to take me some time to get rid of all of the garbage that comes preinstalled on it.It came with Windows 8.1 installed. This is my first experience with Win8, and it is just as horrible as I was told it was.The computer itself is outstanding. Highly recommended at this point.", "Date": "May 24, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00IXQE6JO"}}