{"Reviews": [{"Title": "Just bought it", "Author": "Teragram531", "ReviewID": "R3HPRFCB8MXQ6M", "Overall": "4.0", "Content": "I just turned it on & went through the registration process.  What an improvement over my 2 yr. old HP.  The screen is great by comparison. It has the 4th generation Intel processor for the best battery life. It's an i5, not the faster i7, but that's just fine for my needs. I like the touch pad, which has a separate button bar - MUCH better than those that have the buttons indistinguishable  from the rest of the pad. Everything seems to work as expected.  It feels solid. It's pretty light compared to my old laptops, but not as light as the current crop of much more expensive models. The only significant feature that I would have liked is a backlit keyboard. But for this price, I decided to give it a try. I'd recommend this model for anyone wanting a home computer and can sacrifice a backlit keyboard.", "Date": "March 22, 2014"}, {"Title": "Best Price i5 Processor Touch Screen Laptop", "Author": "T1K0L", "ReviewID": "R2GRTN2H9JVV5B", "Overall": "5.0", "Content": "I've been shopping for a touch screen laptop under $550 dollars for a few weeks looking for a bargain less 30% or more. After reviewing Dell, Acer, and HP. I've decided for Acer as cheaper on price with the same specification - i5 processor 4th Generation, 4GB low voltage RAM, 500GB hard disk, built-in Intel HD 4400 graphics, and big display touch screen 15.6\". Whoa, I've never expected that this laptop is one of the best purchase I've done as it is so fast, touch screen Windows 8.1 with update 1 response is great no hiccup, Dolby Home Theater sound is great, Aluminum keyboard rest pad, Full island keys for keyboard and numeric pad, and with internal DVD writer. I primary used this laptop for basic internet browsing, programming MS Visual Studio 2013, typing documentation, watch movies, and ebook reading.PRO: DOLBY home theater sound is great, Intel HD 4400 integrated built-in graphics touch screen response is great, 4th gen i5 processor, 15.6\" touchscreen display, nice sturdy keyboard full keys, and built-in DVD writer.CONS: I can't find any negative for this sub $550 dollars price? maybe no back-lit keyboard but I don't need that as I always work on a bright lid environment :)After using it for 2 weeks, I go for upgrade and I bought internal SSD Samsung EVO 840 120GB and additional 4GB RAM. Good thing is it is very easy to upgrade this laptop as you need only to remove only 1 screw! Maybe the designer knew that probably most laptop owners will upgrade to SSD and put additional RAM memory. I couldn't be happier now as my 64-bit Windows 8.1 with update 1 boots less than 8 seconds.", "Date": "May 2, 2014"}, {"Title": "Great choice", "Author": "L. LOPEZ-NIEVES", "ReviewID": "RM0D0D4HZW387", "Overall": "5.0", "Content": "I had to get a powerful laptop for my daughter's 15th birthday, she uses it for games. For the price and for its features, this computer is a great choice. Acer is very reliable.", "Date": "May 17, 2014"}, {"Title": "i LOVE MY NEW ACER...... NO MORE HP GARBAGE FOR ME.", "Author": "TIMOTHY W. MCCANN", "ReviewID": "R3K83TXW5O000S", "Overall": "5.0", "Content": "THIS IS A VERY NICE LAPTOP FOR THE PRICE.  I HAD BEEN USING AN HP, THAT WAS SEVERAL YEARS OLD, BUT WAS NEVER HALF THE MACHINE THIS NEW ACER IS.", "Date": "May 5, 2014"}, {"Title": "Nice system but a basic unit", "Author": "Farmer", "ReviewID": "R3ME693DHKJOM8", "Overall": "4.0", "Content": "My last system was an Acer Asprire 5720Z,  still have it with Windows 7 installed. This system seems a little bland compared to my old one. There are no function lights/indicators on the keyboard like; num lock, caps on etc. System responsive, good performance. Compared to Window 7 there are a lot of audio, video function missing and you need to find software to accomplish what Window 7 provides. The 8.1 start menu is just dumb but it gets you to all your applications. The screen is nice but a downgrade for theCrystal Screen on the 5720Z. It does allow me to do what I wanted -- to get into Windows 8 and get experience with system but Windows 7 is still my primary OS used.", "Date": "April 29, 2014"}, {"Title": "Love it", "Author": "Sulewskik", "ReviewID": "RPSKTK4XCW41K", "Overall": "5.0", "Content": "This is exactly what I wanted.  My last laptop was an HP never again.  The dvd drive never worked from the start.  My son is a network technician and swears by acer.", "Date": "May 29, 2014"}, {"Title": "Acer Laptop V5-561P a good Laptop for everyday computering.", "Author": "Anthony G. Conte", "ReviewID": "R1TL38I8H9M79V", "Overall": "5.0", "Content": "Good computer for everyday word processing & online searching. Good price for specifics & good support too. Windows 8 takes some time to master but plenty of options to get it to look more like windows 7, if that's what you want to do. It has a 64bit system so that you can upgrade the memory to the full 16GB of memory. You should also make sure that all your windows updates are current & that your virus program is active.", "Date": "May 11, 2014"}], "ProductInfo": {"Price": "$699.99", "Features": "15.6\" Touch-Screen\n4th Gen Intel Core i5-4200U Processor (up to 2.6 GHz Turbo Boost)\n4 GB  DDR3_SDRAM; 500 GB HDD; DVD±RW/DVD-RAM/DVD±R Double Layer\n1 USB 3.0; 2 USB 2.0; 1 Ethernet; 1 HDMI; 1 VGA 15-pin D-sub\nWindows 8.1 ;High Definition Audio; Dolby audio", "Name": "Acer Aspire V5-561P-6869 Laptop Computer With 15.6\" Touch-Screen & 4th Gen Core i5-4200U processor (Windows 8.1, 4GB RAM, 500GB HDD, Gray)", "ImgURL": "http://ecx.images-amazon.com/images/I/41s-FpopyDL._SY300_.jpg", "ProductID": "B00IJ0SK2S"}}