{"Reviews": [{"Title": "Finally bought an alienware", "Author": "unixman", "ReviewID": "RE4GK5YUQAD3E", "Overall": "4.0", "Content": "I put off buying a new laptop forever.  Finally gave in and purchased this one.  Overall this is a real powerhouse.  The hard drive in this laptop is the slowest of everything in the system - rates a 5.9 Windows speed rating.  It ships with about 990 GB available and for some reason they combined the 5400 RPM 1 TB drive with the 80 GB MSATA drive together to make up the C drive.  Well the speed (or shall I say slowness) of the drive was very noticeable, so the first thing I did was replaced the 1 TB 5400 RPM drive with two 256 GB SATA III SSD drives I already owned - Raid0.  This was a very easy swap to make and once completed this machine FLEW!!  It comes with 8 GB of memory installed in the front memory slots (the ones that are hard to get to) leaving the back memory slots empty - which kudos to Dell for doing that because it means you can add 16 GB very easily without messing with the front slots.  It easily ran The Sims 3, Battlefield 4 and 3, Mass Effect 3 all at the highest settings with ease.  The fans are pretty darn quiet - you can barely hear them even when running the games.  The front loading DVD drive came in handy when rebuilding the system after performing the hard drive slot, so I am glad it had one.  I would purchase this again and I would recommend it as well.  Also, it is my understanding that virtually all the hardware can be upgraded if wanted - the CPU is socketable, so you can put in a newer haswell processor if you choose, the dual SLI Nvidia 770M can also be upgrade to 780M's if you should want to - but as the system is now it is plenty powerful in my opinion for years to come.  I miss the money I spent on this thing, but I am glad I have it - it easily handles all I have thrown at it.", "Date": "May 27, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00IMUAZA0"}}