{"Reviews": [{"Title": "It's OK, but not spectacular", "Author": "John Cannon", "ReviewID": "R2CUZWRNOKGU06", "Overall": "3.0", "Content": "I searched for two weeks for what I thought would be the perfect laptop for me, but this one has disappointed me.  There is a lot to like. but several really irritating things have taken the thrill of a new laptop away. What I like is the beautiful resolution. Very nice. Very nice sound too. The powercord design is a winner! Almost looks like a USB connector, and will be far less likely to cause a loose power jack connection inside.  I read on other reviews that the keyboard was bowed, and pressed down when you type. It does and it is really bothersome to me as it does not feel firm, but flimsy. I also read that the touchpad was off center... I thought that it would not be a problem, but it is. If I am not careful, I keep hitting the right mouse button by accident, since it is so far left. The touchpad is too close to the user also, wheras all my previous ones left room for my wrists. My hands get tired and go to sleep now!  The SD card slot is hard to reach, tucked way under the USB ports, and not simple for me to use without leaning over to see where the slot is. The same for the DVD drive - the button is low, amd must be pressed spot on to open - again, I have to lean over to look for it, I can't just feel for it. Even with 16G RAM, Photoshop hangs several times a day. The screen blacks for a few seconds too. The spacebar is very small. I could find nowhere in the downloadable manual how to turn on the lighted keyboard ( Fn key and Spacebar)  Not a gripe with Lenovo, but I DETEST WIndows 8, and upgrading to Win 8.1 was complicated as I needed to download drivers, and fiddle a lot to get it to download and install. I bought Start8 to get the look and ease of Win7 back. The laptop runs VERY hot, even with a chiller fan. The very worst is the battery, even on power saver mode lasts just over an hour. That is my biggest gripe.  My last laptop, an 17.3\" ASUS, lasted over 5 hours! Right now, I am wishing I had bought another ASUS now. I will adapt, as I can't afford to get a different laptop now, for several years! I spend over 10 hours a day on this laptop, so the poor ergonomics really bothers me. I did recieve this laptop in the promised time.", "Date": "April 21, 2014"}, {"Title": "Would not accept required Windows downloads for 8.1", "Author": "Barry J. Passen", "ReviewID": "RCHS7CB0JJ47C", "Overall": "1.0", "Content": "Everything looked great until I had to update Windows 8.0 to 8.1.  Kept getting download errors. Would not update 13 of 187 required downloads. Contacted Lenovo Support and their answer was for me to purchase a support contract for $189 to correct their issue. Not my standard of customer support. This was not my issue.. it was their's. Purchased another computer and am very happy.", "Date": "April 24, 2014"}, {"Title": "Great Specs, Great Price, Small Problems", "Author": "Daniel Skucas", "ReviewID": "R3EH5YFBSUHMWL", "Overall": "4.0", "Content": "I looked hard to get a powerful computer for my school since I need to use virtual machine and this computer certainly has the power to handle that properly.Some of the comments that others have already said are true though, the screen is very hard to get a good viewing angle on, when you do it is very nice but it is a slight annoyance. In any kind of light area it will also have noticeable glare. Also the keyboard on the laptop does seem a little bit cheap considering the cost of the computer.No regrets though since really this is more for work than play. If someone was looking for laptop to watch movies or play games on though with the screen issues I would not recommend.", "Date": "May 30, 2014"}, {"Title": "Fabulous Machine", "Author": "ElwinVoorheis", "ReviewID": "R127N4R05MX2LS", "Overall": "5.0", "Content": "It was as spec'd and performs exceptionally.  Nice machine, even better than I could find on the Lenovo website and for a better deal.", "Date": "May 12, 2014"}, {"Title": "Great laptop", "Author": "R. Fuller \"amazon again\"", "ReviewID": "R1PWE54JNAVKHT", "Overall": "5.0", "Content": "I am using this laptop extensively and so far it has been flawless. It has good speed awesome ease of use. Windows is also not so bad in 8.1 version.", "Date": "May 2, 2014"}], "ProductInfo": {"Price": "$1,499.00", "Features": "Intel Core i7-4700MQ 2.4 GHz Processor\n16 GB DDR3 RAM\n1 TB 5400 rpm Hard Drive\nFull HD 1920 x 1080 17.3 LED\nNVIDIA GT745M 2GB GPU", "Name": "Lenovo Notebook Z710 17.3\" Intel Core i7 4700MQ (2.40GHz) 1TB HDD 16GB NVIDIA GT745M 2GB", "ImgURL": "http://ecx.images-amazon.com/images/I/51Fv2ZW28DL._SX300_.jpg", "ProductID": "B00IRIJVAC"}}