{"Reviews": [{"Title": "It does what I need", "Author": "Sandra Whitney", "ReviewID": "R22Q4ULQH31MSD", "Overall": "4.0", "Content": "After some frustration with getting started (this is my first Window 8) and some malware and trojans that jumped in before I could load good antivirus and antimalware programs (I'm no computer geek so I really didn't know what I was doing) the computer is doing fine.  Finally had to call a friend for help, and eventually made a visit to our university's IT folks to get the last of the bugs out and the protections \"playing nice\" yet still doing their job.  Waited to do a review until things settled down, since the problems were more software related (and partly my fault in my ignorance) than hardware related.Having the dedicated numbers pad makes it a bit bigger than I expected, but does make numbers entry a lot easier than just having the numbers above the qwerty.  I need the DVD player and the ability to connect to projectors, and the included system seems to work fine.  Wish it was lighter, but those little slim-line computers don't seem to have the connections I need.Overall a very good value for the money since I need the DVD and projector capability, but don't need the highest speed or other bells and whistles.", "Date": "April 4, 2014"}, {"Title": "Awesome", "Author": "erica carson", "ReviewID": "R10D0SSO9E7DPI", "Overall": "5.0", "Content": "This computer has very advanced technology. Wonderful screen resolutio. I love it! Great buy at an unbelievable price. A must buy.", "Date": "March 13, 2014"}, {"Title": "Review", "Author": "Jeffrey Frank", "ReviewID": "R1IMG4GMTZDQ45", "Overall": "5.0", "Content": "Great laptop for a good price. I like Toshiba Satellite Computers. The other Toshiba I had, lasted for ten years.", "Date": "March 28, 2014"}, {"Title": "perfect for college student", "Author": "Kelton Hays", "ReviewID": "RW0ZARDVES4S3", "Overall": "5.0", "Content": "I was needing a good laptop for school. I didn't know if I should go wit the smaller less advance laptops ( notebooks/chromebooks/ect.) Or the bigger more advance laptops.. I decided to go with the slighty big laptop and I came across this one. Iv had it for about 2 months now and it hasn't let me down yet.. it does just wat it say as it should.. I would definitely recommend. Even for everyday use", "Date": "March 27, 2014"}, {"Title": "What a cheap piece of plastic....", "Author": "TLS \"TLS\"", "ReviewID": "R1SZN9P6GGQTHL", "Overall": "1.0", "Content": "I bought this laptop at best buy and it is junk. Plus having win8.1 on it really rubs salt in the wound. Your personal documents movies photos, favorites are all automatically uploaded to the internet for you in onedrive which you can only access if you are online. Plus if onedrive was ever hacked....you get the point. The huge colored blocks for toddlers pops out on the screen every few seconds and you cannot get rid of that. The usb ports on this laptop are loose and this laptop does not recognize micro sd cards on every microsd card converter or reader. This laptop that best buy refused to let me return is junk and I'm going to uninstall windows 8.1 and put linux on it in hopes that the invastion of privacy by onedrive will cease to exist. I used to love Toshiba and now after this train wreck of a laptop with kiddy colored blocks that keep popping out and hiding the desk top (while I am trying to type something) I'm definitely not going to buy toshiba ever again. I would not recommend this laptop to anyone.", "Date": "May 21, 2014"}, {"Title": "Economical Laptop", "Author": "Mitchell Llewellyn \"Gadget Freak NJ\"", "ReviewID": "R1XOGYJEGVYZW0", "Overall": "4.0", "Content": "I like everything about this laptop with the exception of the sound. I paid $279 for it so it didn't dent my wallet like the old HP I had that crapped out after only 2 years!!!", "Date": "March 5, 2014"}, {"Title": "Price is right", "Author": "Ernesto E.", "ReviewID": "R397IVVJW229XK", "Overall": "4.0", "Content": "The computer was right for the price. Everything works almost perfectly except for some of the keys on the keyboard who are stuck down consistently. It is bothersome to keep checking on individual key when typing. Besides this minor problem, I love the computer. In fact this is my fourth Toshiba laptop since I gave to charity my IBM in 2000.", "Date": "May 10, 2014"}, {"Title": "I like it.", "Author": "Alvaro Santos", "ReviewID": "R26BGPNMQVUWQI", "Overall": "5.0", "Content": "It's very nice pc, fast an work very smooth, also that is very easy to carry is not heavy I like it.", "Date": "April 12, 2014"}, {"Title": "Light and Easy to Use", "Author": "Pamela J Parizo", "ReviewID": "R16B93F809NGE8", "Overall": "4.0", "Content": "I really enjoy my new Toshiba Satellite as it is lighterthan my previous laptop, making it easier to carrywith me.  Yet it is full of features and easy to use.This is an excellent model for a student, or recreational user.It has a decent sized hard drive (500 GB) and memory(4 GB) and I really like the built-in webcam and microphone.I would highly recommend this model.", "Date": "April 9, 2014"}, {"Title": "Does not include Word, Works, Powerpoint, Excell, ...", "Author": "Stainless \"Stainless\"", "ReviewID": "R167OSG1F780DF", "Overall": "4.0", "Content": "The hardware is good looking and functional; but the machine does not include what might be considered basic software.  (Actually, the software is on the hard drive; but one must pay to install it).Lack of basic software would be fine, IF it was noted in the product description - which it is not.Initial setup was also a pain with all the advertising and data mining hoops to jump through; but that is probably an unfortunate part of most new computers.Overall; I do believe this is a good choice for basic home use.", "Date": "May 28, 2014"}, {"Title": "burned my leg!", "Author": "susan mills", "ReviewID": "RJVKP2JDKVNZW", "Overall": "2.0", "Content": "Don't buy for kids I think it's a fire hazard! It gets very hot I couldn't use it unless on a table away from me! Blows heat out! Burned me like a bad sunburn!", "Date": "May 5, 2014"}, {"Title": "Toshiba laptop", "Author": "BLU \"big wind\"", "ReviewID": "R1XBDJXPK3GSXF", "Overall": "5.0", "Content": "A good buy! I needed an inexpensive laptop for the little I use a computer. E-mail and Skype along with doing a purchase or two from the Amazon website are the only things with occasional looks at weather and news. This Toshiba fits my need exactly.", "Date": "April 30, 2014"}, {"Title": "No support for windows 7 or Linux", "Author": "David Hand", "ReviewID": "R30M9DL63Z1WZH", "Overall": "2.0", "Content": "I have had my old Toshiba Satellite  laptop for 7 years and its been great,  so I purchased this laptop with confidence.I am disappointed,  Toshiba seems to have given in to Microsoft and this unit has been setup to make running Win 7 or almost any of the hundreds of flavors of Linux extremely difficult.It does not have an touch screen so even windows 8 is somewhat of a struggle.  Its a shame,  it could be a very cost effective unit.I give it 2 stars,  screen looks good and battery life is very good.", "Date": "April 28, 2014"}, {"Title": "Have had it for ! day works good", "Author": "H. Blake \"Homer Blake\"", "ReviewID": "R1RH5QAOP077W1", "Overall": "5.0", "Content": "Have had it for ! day works good trying to get used to the keyboard had an older Dell and was used to it every this is working on this one so far I cheated and bought a windows for dummys book foron how to  windows 8.1 and had a general idea what I was doing before the package got here thats all i got to say for now will up date later if needed", "Date": "March 5, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00I2F5ZTG"}}