{"Reviews": [{"Title": "amazing system", "Author": "barrett paul crowell", "ReviewID": "R3OFMY0SWVZ96S", "Overall": "5.0", "Content": "probably one of the best systems out there for laptops where gaming is a necessity at least at this price the hd quality is amazing as well as speed I am able to play all of my hi detil games with almost no lag put it on medium settings and they will run like its nothing i give it a five for the fact that for its price you really cant get a better computer (I note if u don't ike the rough touch pad then u should look elswear as well as the keybord is a little different than most are used to however if u can make adjustments to ur usual gaming likeing u should be fine)", "Date": "May 23, 2014"}, {"Title": "Amazing Laptop with a Fatal Flaw", "Author": "wstlndgrdnr", "ReviewID": "R5RP8W46N6ETT", "Overall": "3.0", "Content": "This laptop broke my heart. If it weren't for a terrible keyboard and trackpad, it might be the perfect laptop of the moment.I recently needed to upgrade my late-2007 Macbook Pro on which I was running XP a good amount of the time for work. I needed a PC laptop that was going to be my main machine (every day use; grad school + web design and graphics; sometimes 8+ hours/day), and after doing the requisite research I took advantage of a nice web deal on an ENVY 15-j171nr for $779 + warranty and tax. Simply put, keyboard and trackpad aside, this machine was amazing, although I eventually had to send it back.This machine is FAST. 18 seconds from power on to start screen; 15 seconds(!!) from pressing Enter on the password prompt to having a browser window open and loaded with content. This is due I think not so much to the amazing processor (i7-4700MQ), which is about the fastest consumer processor available at the moment, but rather to the 24G SSD, which I think is pretty much a must-have feature from here on out. The 8GB of ram is plenty; I had tons of windows open typically and never experienced a lag. My unit had a 750GB HD which is plenty big.The screen is HD, bright and crisp. I didn't need a touchscreen (still think that is a good decision for a WIN 8 laptop), so the lack of one didn't bother me, and saved me some $$. Although I'm not a gamer, I wanted a machine with better-than-average graphics, and the NVidia GT 740M did the trick nicely. The screen is fairly glossy, but no more so than others I've seen, and is fully in line with the madness of the moment about glossy screens. I think a few years from now designers will look back and ask 'what were we thinking' with these horrid reflective screens. But I digress...The sounds is quite good - I'm a bit of an audio snob, and usually have the laptop plugged in (via the headphone jack) to good external speakers, but for times when I wasn't at my desk the built-in speakers (and especially the built-in subwoofer) deliver loud, balanced sound.There are plenty of jacks; USB, HDMI, etc. Nothing out of the ordinary there, and everything you'd need. The laptop is also quite thin and light, which is very nice. No onboard DVD, which is also quite common these days, but I got an external one on Amazon for $30 and that worked fine.But I eventually sent it back, because I just couldn't stand the keyboard and trackpad. Moving from an older Macbook Pro is tough; those were really nicely built machines. The keyboard on this is really bad IMO. Shallow key travel; clacky and cheap feeling; and the whole keyboard surface bends slightly towards the middle as you use it. I tried getting used to it, but I just wasn't able to. I know they need to save $ and weight somewhere, but this made a very unpleasant experience for me.Likewise, the trackpad is, to say the least, not what I was used to. For starters the surface of it is not smooth, but rather slightly rough, like the rest of the laptop surface where you rest your palms. In fact it's exactly the same surface. This may not bother you, but I'm used to a smooth-surfaced trackpad. But adding to this is the integrated left- and right-click buttons. This is also a common feature on laptops these days, and there's nothing wrong with that per se, but these buttons (or rather, the \"button area\" of the trackpad) were hard to press, and this resulted in lots of errors (things dragging when I simply wanted to click). And, on top of this, the \"coasting\" action of the trackpad (when you flick your fingers to scroll window content down) is absurdly implemented. It has perpetual motion--that means, once you flick, instead of the scrolling slowing down and eventually stopping (like on the mobile devices in use by millions of people around the world), the scroll will keep going until you do something else to stop it (such as click again). This is just baffling, frankly. While some of these issues could be mitigated by using an external mouse, there are times when you can't or don't want to.Because I liked everything else about the laptop, I really tried to get used to the keyboard and trackpad, but I realized I just didn't want to do work on it. Which is bad when this is pretty much what I do 8-12 hours a day. So I returned it. I currently have an ASUS (N550JV), but that has issues of its own ( nowhere near as fast, with erratic wifi. But that's another review).So, in short, this machine is great-pretty much perfect-if you can stand the keyboard and trackpad. If not, you'll need to look elsewhere. As for the overall rating, I think a 3 is only fair. Put a better keyboard & trackpad and it's a 5+.", "Date": "May 7, 2014"}, {"Title": "You'll have difficulty with Linux on this laptop", "Author": "Z. Feuerborn", "ReviewID": "R22EYV5O26T1FU", "Overall": "3.0", "Content": "Sadly, HP did not provide a way to disable the Intel 4000 graphics on this laptop. If you want to run Linux on a laptop it is probably best to pass on this one... unless you are one of the few people who can actually get bumblebee to work.Other than that, I have been very happy with the hardware specs. Please HP, always provide a way to disable the Intel embedded graphics!", "Date": "May 29, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00IJRPE5W"}}