{"Reviews": [{"Title": "Meets all my high expectations!", "Author": "Amber", "ReviewID": "RLC9YL5QQAHXC", "Overall": "5.0", "Content": "I absolutely love this laptop. I'm a big gamer and a Web Developer so I wanted something with enough portable that I can take it to work, friends, and out of town when I need to work remotely but still have the power of a desktop. This definitely fits the criteria. I've had no problems running games (included older games like Bioshock and newer games like Outlast). The graphics actually look better than my desktop.The keyboard feels great. I'm used to working on a Das Keyboard and the \"clicks\" feel similar. It's a little loud for a laptop but not any louder than a regular keyboard. Typing feels natural. Love the LED options and have already switched everything over to a lovely, girly background giving it a more feminine edge.The only con I can think of is that it's a little bit heavy but for all the power behind it it's to be expected. I'm used to working on a 17\" laptop that was a bit lighter but could hardly run Adobe products and definitely not games. I'll put up with a little bit of weight for my dream laptop :)", "Date": "February 15, 2014"}, {"Title": "Wife Loves It", "Author": "fresnosmokey", "ReviewID": "RPCURU2840HC", "Overall": "5.0", "Content": "Got this for my wife to game on. She likes it very much. She doesn't require top of the line, but something that runs games well enough to be enjoyable. If you don't require a super computer gaming rig but want something that is much better than minimally adequate, then you can't go wrong with this rig.", "Date": "April 22, 2014"}], "ProductInfo": {"Price": "$1,199.99", "Features": "AMD A10-5750M 2.5 GHz Processor (4 MB Cache)\n8 GB SO-DIMM RAM\n1 TB 7200 rpm Hard Drive\n15.6-Inch Screen, AMD Radeon R9 M290X\nWindows 8.1", "Name": "MSI Computer Corp. Destroyer GX60 DESTROYER-280;9S7-16FK12-280 15.6-Inch Laptop", "ImgURL": "http://ecx.images-amazon.com/images/I/41B-pRMKz9L._SY300_.jpg", "ProductID": "B00I6ILGHE"}}