{"Reviews": [{"Title": "Great so far!", "Author": "Kelly Ribnick", "ReviewID": "R1Z7Y0TGBW411R", "Overall": "5.0", "Content": "So far, I'm loving it. I have only had it for a few days now and I have no complaints. Windows 8.1 is a learning curve and the two-finger scrolling takes a minute to get the hang of but so far so good!", "Date": "June 2, 2014"}, {"Title": "Less than wonderful", "Author": "Stevenhend", "ReviewID": "R3AH57TVGJAVND", "Overall": "4.0", "Content": "I am comparing setup and use with my Dell Inspiron; I downloaded the drivers for my HP 6500 wireless printer to both.  Dell connected wirelessly right away; Even connecting via USB, Toshiba can't recognize the printer. I have removed 8 or 10 'opportunities' to purchase unwanted services, memberships, etc.  The Toshiba store will not go away.Good thing I don't need a really terrific laptop; oh, yeah! I still have the Dell!", "Date": "May 23, 2014"}, {"Title": "Excellent", "Author": "Stepen Johnson", "ReviewID": "RO2Q9VKGL96C8", "Overall": "5.0", "Content": "Great laptop. I am happy to have it. It is very fast and quite. Touch screen is cool and convenient.", "Date": "May 17, 2014"}, {"Title": "A great laptop!We", "Author": "Bill", "ReviewID": "R38FRH3ILV5NE6", "Overall": "5.0", "Content": "We were XP users and were apprehensive when Microsoft announced they were no longer going to support XP. We researched the market for alternates and selected the Toshiba Satellite E55T-A5320 Ultrabook 15.6\" Touch Screen Laptop - 4th Generation largely due to its high rating in Consumer Reports and to Toshiba's fine reputation. We are most satisfied with its performance and the ease of integrating it into our computer needs. The touch screen is the cherry on top of the whipped cream!", "Date": "May 15, 2014"}, {"Title": "Awesome!", "Author": "Sheldon King", "ReviewID": "R3DVZATFDJPLRU", "Overall": "5.0", "Content": "I had an old Dell that I purchased in 2007. This product is far better and the touch screen works well.", "Date": "May 10, 2014"}, {"Title": "Toshiba E55 - no mouse buttons on touch pad, just a single slab", "Author": "T. Payne \"Multipass\"", "ReviewID": "R3BU0QSILZF769", "Overall": "1.0", "Content": "I bought a Toshiba E55 at Best Buy because I wanted wireless 802.11 AC back in February.  The touch pad looks identical to the touchpad in the E55 photo here - a single slab.All my other 4 laptops in my family have a button for left click, a button for right click and the touchpad.  So three surfaces.This E55 is now going in for service a THIRD time because the computer thinks the left mouse (part of the slab) is clicked.  Point is I can slide the mouse pointer around and the computer thinks there was a click when there wasn't.  Perhaps 20 time per hour.I am not leaning on it. I am not pushing on it.  When you do push down on the bottom left corner of the slab, you hear an audible click. You had the tactile feel of a click. But none of that for these \"ghost\" clicks.  The repair notes say both times that the problem was replicated and that they fixed it.  All I can say is that I take it out of the shipping box and it is not fixed.  I'm beginning to think this single slab is a design flaw.Also, when it came back from service, the backlit keyboard no longer works, the shiny bezel around the screen has vertical scratched lines on both sides, about 4 inches long about 1/2 inch from the outside edge.  There is also some gouging  of the bezel in the bottom right corner.  Also the Intel sticker to the left of the touchpad was first torn off and then left barely hanging.Even more frustrating is the Toshiba repair call center.  For the most part, they got adequate training in our version of English. But try to fathom this.  The computer comes back from service in a box.  I call to get it repaired a 2nd and now 3rd time, but this perfectly good box I have in hand can't be used again, I have to wait 3-5 business days for another box?  We know how Amazon let's us just print a prepaid label immediately to send things back, but Toshiba not only is wasteful, but make us wait that extra time just to send it in.  Because I bought at Best Buy, I couldn't return it after 17 days as a typical buyer.  My fault there.  When sold and shipped by Amazon you get 30 days to exchange.What's also frustrating  about Best Buy is looking at MOST of their 1 or 2 star reviews it is transparent that there are trolls who go through and mark these reviews \"Not Helpful\" simply because they had criticism of the product.Next time I will wait for the features I want to be available on Amazon, and sold by Amazon.", "Date": "May 2, 2014"}, {"Title": "not as good as the comment above", "Author": "Amazon Customer", "ReviewID": "R1TODO3TKCV25A", "Overall": "3.0", "Content": "I bought this book in may.My order is a 2-day shipment,and actually it took me a week to receive this pakage--i don't know who should be blamed,amazon or the seller?anyway, i receive this laptop,and it works just fine,though windows 8 is a little confusing.but the softwares pre-installed in this computer are just too much,and i don't need most of them.I;m not sure they;re from Microsoft or toshiba,but those softwares suck and lag the computer.", "Date": "May 20, 2014"}, {"Title": "Awesome notebook", "Author": "Asad Amin", "ReviewID": "R13TKA6R0SHGTX", "Overall": "4.0", "Content": "Great notebook.  Extremely fast, quiet, amazing battery life.  The mouse pad is great, and I'm getting used to Windows 8.1.  Please note I only use it for surfing, researching, excel and word.  The outside metal finish gives it a great look. I am definitely glad I purchased this notebook.  One thing I would like to add is that I am not totally sure this is an \"ultrabook\" as the manufacturer makes no mention of this anywhere.  Nonetheless, great laptop, and actually performs better than the ultrabook I bought for my sister 8 months ago.  I wish I would have bought this laptop months ago.  Not giving it 5 stars because although I love this product, it totally has to blow me away to give it 5 stars.  Great product, and worth the $550.00 I paid for it.", "Date": "June 4, 2014"}, {"Title": "Battery Problem", "Author": "Mallika", "ReviewID": "R8RBU6O517NJ6", "Overall": "1.0", "Content": "Ordered this a month ago. Used it for about 3 weeks without any issue. Then recently, the battery would not charge unless plugged in. Whenever the cord was unplugged the laptop shutdown and when plugged in showed battery at 11% but did not charge.Luckily Amazon's 30 day return policy was still valid so product return was accepted.", "Date": "May 23, 2014"}, {"Title": "Freakn Wow!", "Author": "Donnie", "ReviewID": "R2R6N4F7WNY2RA", "Overall": "5.0", "Content": "I got this in a bundle at best buy with what looks like a 7-8 in tablet for 899 or something like that. I get home and start playin with it you know....downloading everything and checking browsing speeds.  First of all I was blown away with the ease of use of incorporating a touchscreen laptop. Within a couple minutes I was blazing through Amazon with this crazy swipe of the page thing that made it so much easier to surf. YEAH exactly what I wanted....Don't let those guy fool you i5 is plenty to surf a super high speeds with 8+ sites open classes, and Microsoft word (hint i'm a student).Now to the tablet. Super Cool!  It also worked cohesively as the laptop it was even easy to type on the little virtual screen. (BYW the keys on the laptop are AMAZING).  OK ok the tablet also had all the cool swipe surfing like the laptop and was a quad core as well...I think everything was 4th gen too.  Of course the insurance and protection on both products is where they get ya at an extra 300 bucks  for drops and spills...being s chef I have this problem a lot.  First  time buyer of Toshiba. Lol \"Limits Pushed!\"Donnie", "Date": "March 26, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00I16K4KG"}}