{"Reviews": [{"Title": "Moved from MSI 17\" model to this 3K 15\", LOVE IT!", "Author": "George Lecakes", "ReviewID": "RW7DFVX4NUPEF", "Overall": "5.0", "Content": "Absolutely great product.  When it arrived, it had been shipped in a box, inside was the MSI box, and within that box was all the protective measures necessary to make sure the 3rd box was well protected.Incredibly light and small for the power that it packs ( NVIDIA 870 ).Unlike my previous MSI computer, this doesn't have the easily detachable battery.However, it is very thin and sharp.  The sound isn't as good as the 17\" ( little more tin ) but sounds very good nonetheless.And the 3K screen will make you hate 1080p.Also, the migration from Windows 7 to 8.1 was nothing major.  People blow the change out of proportion.Follow up - The Day AfterMigrated all my data, no issues with the HDD 1 TB drive.  The 128GB drive might feel a little small, but only use it for important app installs.  The SDD really speeds up (by seconds) the loading of applications such as Autodesk Max and Maya. Had a time trial with a friend.3K on a 15\" laptop means crisp text, but you might want to set the size larger than small.  I have good near-sight, but this was a bit too tiny to be comfortable when coding.The keyboard takes a bit to get used to if you are coming from a desktop or 17\". While typing this, I'm missing the space bar about once every other sentence.Make sure you pick up a mini-displayport cable if you want to drive 2 additional monitors ( 1 HDMI, 1 Mini-displayport).And the light-up keyboard is very fun.  Looks different from my previous MSI. Instead of the whole key's border being illuminated, I see the illumination more along the bottom right and left of each key.The NVIDIA 870 is working great on my steam library. No issues yet noted. And I've had no issues coding my own 3D projects with this computer.", "Date": "June 5, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00JSA1PH0"}}