{"Reviews": [{"Title": "I don't do Celerons", "Author": "Christian De Freitas", "ReviewID": "R1NVXDQGDZMSSF", "Overall": "3.0", "Content": "I received this computer because the owner wanted to change to windows 7, so I used this opportunity to do a review on my blog, 123techreview in blogspot.First of all, I have to say, this machine runs slow with the windows 8.1 it comes with, so I downgraded to windows 7 and it runs smooth, I also updated the HDD to SSD, the samsung 840 evo http://amzn.to/1m3DmlI and it runs better, but the things that require processing power, like opening Excel, unzipping/unraring, etc, makes the computer crawl.BTW, if you get this laptop, and beside get a SSD, you will be better off putting that 100 bucks on the new laptop and be getting a better experience overall.I normally don't post benchmarks scores, but these are worth mentioning:This Celeron N2820 has a score of 1040, that is VERY low for cpu processing.I recommend you get a pentium or a Core i3 first or second gen that can handle processing better.I found these alternatives:**ASUS D450CA with a Pentium 2117U, has a score of 1647 http://amzn.to/1s8uUl9 (and exactly the same price, as of this review)**Acer E510 with a Pentium N3520 quad core processor, with a score of 1932 http://amzn.to/1m3FfPc**Dell 954BLK with Pentium 2127U, score of 1868 http://amzn.to/SFPZJfand if you can make it, one of the cheapest core i3 laptop**Dell 1435BLK with a Core i3 3rd gen 3217U, with a score of 2299 http://amzn.to/1s8vyyVAs you can see, for the exact same price you can get a laptop thats 50% faster, and if you can pay 100 dollars more, you get more that 2 times the power.So if you're thinking getting this + SSD to make it faster, get yourself a core i3 laptop, you'll thank me", "Date": "May 8, 2014"}, {"Title": "Best Buy at Best Buy", "Author": "Ogr8ys1", "ReviewID": "R2VDKNK670MNSG", "Overall": "5.0", "Content": "You can't go wrong spending (250 @ Best Buy) for this laptop.  It is perfect for average use, not really a gaming computer but if you need a basic laptop with decent speed at this price point it is as good as it gets.  Not many bells and whistles, but setup is a breeze and it runs smoothly despite the latest incarnation of Windows.  Speakers are the only thing that is brutal, so if that is a main concern you may want to look elsewhere.", "Date": "May 2, 2014"}, {"Title": "Not a bad laptop", "Author": "Warren M.", "ReviewID": "RSC0PY51GM0N3", "Overall": "4.0", "Content": "So I am a computer nerd. I know whats a good buy and whats not. This laptop I would say is a good buy. Just like with everything else there are pros and cons to this laptop.The model I have is the Toshiba C55T A5123 ( 500 GB HDD, 2.13 GHz Processor, 4 GB Ram, Touch screen capabilities )The only difference between the C55T A5123 and the C55 A5105 is that the C55T is touchscreen. The pros on this laptop are...Keyboard is nicely laid out (in my opinion) I really like how it has the number pad and how the keys are shapedI LOVE the mouse pad not to big not to small and the left and right click buttons are big :) way better than a all in one mouse padTouch screen on this laptop is a very nice touch for the priceSpeakers are LOUDThis laptop has pretty decent specs (4 GB Ram, 500 GB Hard drive, duel core processor clocked at 2.13 GHz, Screen is not to bad of a resolution 1366 x 768)Price is awesome $400.00CONSThere is only ONE ram slot which makes it harder to upgrade the ramCan be slow at timesA little bit big not as thin as some laptopsbattery life is only about 4 1/2 hoursSpeakers arnt the best if you have them to loud it distorts the qualityOverall I really do like this laptop:) its not painfully slow or to high priced. This laptop is fast for watching YouTube, going on Amazon, and overall fast on the internet. One thing that really bummed me out on this thing is it only having ONE ram slot. That means at most only 8 GB can be installed on this thing. I really do enjoy the texture on it and the touch screen its very handy when it comes to using windows 8. Honestly if your PC (laptop or desktop) dont have a touch screen I think windows 8 is useless. Without a touch screen it makes it harder to get around in the operating system, just trying to use the \"charms bar\" is a pain with the mouse and keyboard. You can get to the charms bar by pressing the windows key and C but I wouldnt want to do that all the time just to bring up the charms bar. Windows 8 on this laptop functions pretty well. Its snappy when it comes to booting up and loading programs and fun to use for the most part. I think in general windows 7 is better set up, the overall layout is attractive and built more towards using a keyboard and mouse. Windows 7 I think is more organized than Windows 8. In Windows 8 you have to swipe up to see ALL your programs and keep on swiping to the left to get to that one program you want to use whereas in Windows 7 you click the start button to see all your programs and they are all right there in folders. You click on the folder your program is in and its right there. You dont have to swipe 3 or 4 times looking at every single program just to find that one thing you want. In Windows 8 your programs are all categorized either by name, date installed, most used or by category. I also dont like how they try to simplify things like the weather app how its just a circle with lines. It looks childish and unsophisticated. They could of taken the time to make it look better. Windows 8 is a little glitchy sometimes but it has only been out for about a year and a half so that is understandable. It sometimes randomly switches me to different apps when I am on my desktop. I dont hate windows 8 at all I just think Microsoft could of done better. Maybe if Microsoft would of made a desktop version of Windows 8 and a tablet version. Putting back the start button in on the desktop and laptop versions and maybe making Windows 8 more graphical. I really did enjoy the windows being transparent in the Windows 7 operating system.I hope this is at least somewhat helpful and please forgive me for any grammar errors or miss spellings.Spelling is not at all my strong suit LOL", "Date": "May 17, 2014"}, {"Title": "Just purchased this computer today for $249.99 from Best Buy.", "Author": "Patrick F.", "ReviewID": "R2PJF6N85V09DB", "Overall": "5.0", "Content": "Excellent computer!!. This is my second unit. I purchased one (C55A5300) for my wife on Cyber Monday. This unit (C55A5105) which I purchased today from Best Buy is essentially the same specs. It's a great low-mid range computer that handles the basics without any issues. My daughter streams Netflix and Youtube constantly on this machine. It doesn't come with any Microsoft software preloaded, so don't expect any. I downloaded OpenOffice which is a completely free alternative to Microsoft Office. I waited just for Best Buy to have another under $250 computer, and viola here it is!.... but they sell out fast!I should also mention that these Toshiba units are exclusively built for and sold through Best Buy. I find it hilarious when I see the 3rd party sellers selling these Best Buy units for huge mark ups. Get it from Best Buy!...$249.99 all day long.", "Date": "April 21, 2014"}, {"Title": "Stay as far away from this computer as you can!", "Author": "C Joseph", "ReviewID": "RWONOWTM4LUJ0", "Overall": "1.0", "Content": "Horrible is the nicest thing I can say about this computer.  To say it is slow, is putting it mildly.  I downloaded a game,which on my prior Acer Laptop took only two minutes.  With this stupid computer, I literally had time to clean my kitchen, do the dishes and shower before the game finished downloading.  When installing the printer drivers, I had time to go to a restaurant, place an order, and drive back home before it was finished.  On the Acer (three years old), this same installation took less than three minutes.  Even opening Google is time consuming and lengthy.  I cannot figure out why it takes so long.  Videos constantly freeze (if you can see them at all).  DO NOT WASTE YOUR MONEY ON THIS PIECE OF CRAP.  I wish I read the online reviews about the slowness of this piece of crap.  It is not my imagination.  Many others have experienced the same thing.  I have only had this piece of trash for five days and am already looking for a new computer.  HORRIBLE.  TERRIBLE.  SLOW.  WASTE OF MONEY.  PIECE OF CRAP.", "Date": "May 26, 2014"}, {"Title": "good value for money", "Author": "H. Angove", "ReviewID": "R13YIZOZNQ2HXS", "Overall": "4.0", "Content": "it does what the description says it would. I use it for surfing the net and word processing (it will run Microsoft Office fine), and for the money, I doubt you'd get anything better. Biggest problem is the length of time it takes to power up when you turn it on.", "Date": "May 25, 2014"}, {"Title": "Worst. Experience. Ever.", "Author": "Surfboy101", "ReviewID": "R2QLMSGA5XFS2Q", "Overall": "1.0", "Content": "Purchasing this Toshiba laptop was, hands-down, across the board, the worst IT purchase I have ever made in my life.  The computer itself is a piece of junk; out of the box, it takes 7 minutes to boot--literally.  The first time I turned it on, I thought it was broken (literally, not figuratively).  The battery became worthless after 3 months--the laptop wouldn't run unless it was plugged in, so I needed a new battery (more on that later).  The screen is flimsy, and is scratched almost by looking at it (which is not useful, since this is a touch-screen).  The pre-loaded apps are horrible, and it will take you plenty of time to delete them and upload the ones you want.  I could go on-and-on about the keyboard, how bad the touchpad is, etc., but you get the drift.Worse, the customer service was atrocious.  While this is \"no-holds-barred\" review, I'm a very nice person (trust me!).  I go out of my way to be nice and understanding with customer service reps, since they have a challenging job.  However, the Toshiba reps simply hung up on me-TWICE-when I was trying to explain my problem.  The first one hung up because she simply couldn't understand the problem I was trying to explain.  When I called back the next day, the guy hung up on me when he found out his department wasn't the one who could help me.  Instead of transferring me, giving me a different number, whatever--he literally hung up when I was in the middle of my sentence.  How this company plans on staying in this line of business is beyond me, as there are so many superior options to this computer.There's a reason this laptop is selling at $300.  It's awful.  DO NOT waste your hard-earned money on this.", "Date": "May 24, 2014"}, {"Title": "Exactly what my wife needed", "Author": "D. Needham \"\"A nation of sheep will surel...", "ReviewID": "R1TE3RVADIETP3", "Overall": "5.0", "Content": "No, this computer is not blazingly fast. No gaming, no CAD files or large Photoshop or audio-video project creation. BUT, it is _exactly_ what my wife needed to replace her 8-year-old Toshiba Satellite, though. After configuring Windows 8.1 to get rid of the awful \"Modern\" interface and Start Page, she is very pleased with it. This notebook is perfect for someone whose computer use is built around Office app use (I installed a licensed copy of M$Office 2010 for compatibility with her standard work environment), cruising the web, downloading and viewing (and even light manipulation) of video/audio/camera, etc. files, email, social networking and more: just ordinary, everyday use. For her, it's a perfect fit. Little quibbles? Sure, but nothing overwhelming. I didn't like the way the charging cord stuck out in a more than 2\" protrusion (just begging for a damaged charging port), so I added a little right-angle adapter that cut the protrusion down to a safer (in my view) 3/4\". Win 8.1 interface on a non-touchscreen computer, as noted above, is pretty annoying--especially to someone like my wife who really, REALLY will ONLY use desktop apps with the thing. *meh* A couple of minutes configuring Win 8.1 to make the \"Modern\" interface just go away, and the computer now has no flaws in her eyes.KEY: NOT a gaming or audio/video/Photoshopping computer--nothing requiring heavy number-crunching. EXCELLENT for quotidian computing. Her big \"Likes\"? The screen/display; the keyboard (especially since her former Satellite lacked a number pad: helps when she's modding an Excel file from work). Her comment? \"It just works.\"NOTE: She's a school librarian and supervises/teaches at two different schools in our small, rural school district. Her supervisor provided her with a Dell notebook to use, taking her work between schools and for use at home when working on school work--also a Win 8.1 compy. She prefers using her own at home, and much prefers this computer to the Dell, though both are spec'ed about the same. *shrugs* This one just \"feels\" better to her.", "Date": "June 7, 2014"}, {"Title": "no surprises.", "Author": "rottgirl", "ReviewID": "R2QGSCMVQJFZQS", "Overall": "4.0", "Content": "For a basic cheaper priced computer this one is fast enough and good enough.  However it is what it is...do not expect a $700 computer.  It isn't more than it says it is but for my daughter's replacement it is fine.  Windows 8 is a like it or hate it thing so that isn't fair to base it on that.  Overall expect to get what you pay for", "Date": "May 30, 2014"}, {"Title": "Cheap Low Quality and Aggravating Computer", "Author": "Robert", "ReviewID": "R2MAD5SCPZTS9W", "Overall": "1.0", "Content": "This is a very cheaply made piece of junk. It is no exaggeration to claim that a full 50% of the time keystrokes do not register. Buy this low quality product and be prepared to type and re-type over and over again.", "Date": "May 4, 2014"}, {"Title": "Serves it's purpose", "Author": "Stephanie", "ReviewID": "RKR15VHE7O6K8", "Overall": "3.0", "Content": "I like this laptop but the Windows program gets some getting used to, the AC/DC Adapter gets hot real quickly after 20 minutes, I'm reluctant to leave it connected for a long period of time, I don't want it to mess up.  I'll only leave it on to fully charge battery and quickly disconnect to prevent it from over heating.", "Date": "June 9, 2014"}, {"Title": "Great Laptop for the price", "Author": "Chervona Piper", "ReviewID": "R3H2QHFIJACSAQ", "Overall": "4.0", "Content": "This laptop is a very good purchase for the price amazon is selling it for. I love the windows 8!! Very durable and very nice to play around with. The sound from this laptop is amazing and the quality from the screen is also pretty amazing! Just got it and its working fine! i have no problem with this laptop!", "Date": "June 8, 2014"}, {"Title": "Beware", "Author": "sheine", "ReviewID": "RGHK3K7ZFKFL4", "Overall": "1.0", "Content": "At $250 from Best Buy this would be an outstanding value except that it comes with Windows 8.1. When I read the criticisms of Windows 8.1,  I thought that it didn't affect me because I would turn it into a Linux computer. Using every trick that I know and guidance from the internet, I could not do it. The reason was that it does not use the traditional BIOS but a new Microsoft BIOS supposedly to provide greater security but many suspect to exclude competing OSs. With a lot of effort, I got it to boot from a DVD first. Then I downloaded several newer Linux distributions that are supposed to be compatible with the newer BIOS. They started to load but never finished.As for what is wrong with 8.1, the first thing is that it defaults to a Start homepage with a bunch of apps chosen by them, many of which are commercial sites. You can spend time deleting the junk and adding new apps  of your choice. If you read up on 8.1 you can get it to default to a traditional homepage, which is less useful than the usual homepage. As an example to shut down either here or with Start you must move your pointer to the upper right hand corner whereupon so-called charms appear, one of which is settings. When you click it there is a power option which then let's you shut down.No serious computer user could possibly be satisfied with this OS which means that it could only satisfy somebody doing email and other simple tasks. This leaves the question of why such a customer would need such a capable computer.I returned this computer and have ordered a Lenovo from Amazon with about the same specs but with Windows 7 and costing $150 more.", "Date": "May 11, 2014"}, {"Title": "Pure Junk", "Author": "Disenchanted", "ReviewID": "RA8VB0YXGLKHN", "Overall": "1.0", "Content": "Toshiba low-end laptops are pure garbage. Flimsy, cheap, unreliable, and built with the cheapest components available. Save your money and spend a bit more on something else not built by Toshiba. Best case scenario, you might get 6-12 months out of your laptop before things start to fail. Worse case scenario (as I've just experienced), your laptop will last a matter of weeks before the lights go out. And unfortunately for the buyer, Toshiba often refuses to meet their own warranty obligations. Considering how cheap the laptops are, they don't want to help you, or fix the laptop. They would lose money otherwise. So if you send it in for repairs, like they'll inevitably recommend, you'll find yourself being asked to pay elaborate sums of money because the 'scope of work' is not within the boundaries of the original warranty agreement. This of course is not true. Toshiba is simply trying to force the added costs of warranty repairs down the throats of uninformed customers. Their laptops are cheap, but they won't actually save you any money in the long run.Save your money. Don't buy Toshiba. Consider any laptops made by Toshiba as being purely disposable, or built for third word countries with no consumer protection laws.", "Date": "May 23, 2014"}, {"Title": "toshiba c55-a5105 as a linux machine doesn't suck", "Author": "M", "ReviewID": "R2YUDV7AY86LF2", "Overall": "3.0", "Content": "I have no idea how good a Microsoft platform this unit is because after a minimal session exposing myself to the horrors of Windows8 I started looking for a Linux distribution to replace it.  Most of my existing Linux CDs/DVDs would not boot (SysRescueCD being a notable exception) and I think that's due to UEFI problems, but I eventually found that a recent Ubuntu (12.04 LTS?) installer worked after I disabled signatures in the BIOS.Windows seemed slow and so does Linux; worst symptom - Firefox seems to take for frickin` ever to load some pages.  On the other hand, battery life is quite good and it's hard to complain about a 4Gb/x86_64 box for under $250.  It's bad enough that I'll be looking for an excuse to give this machine away, but it does at least boot and run Linux....UPDATE:31 May 2014 - Having reconciled myself to just accepting that this is a crappy machine I nevertheless continued using it from time to time, and along the way Ubuntu and Firefox (I use the Firefox Nightly builds) would periodically request that they be allowed to update themselves, which I permitted as a matter of course. I am now pleased to report that something has drastically improved performance of this machine.  Ubuntu is now up to 14.04 and I'm using the 32.0a1 (2014-05-30) build of Firefox and the system is just amazingly better!  I don't know whether it was an Ubuntu or Firefox update that made the difference but I'm no longer looking for an excuse to give this machine away.  Yay!  I'm happy to now give it at least 3 stars and it may deserve at least fractionally more.  Not bad for a $200 craptop...", "Date": "May 8, 2014"}, {"Title": "poor customer service from Toshiba if anything goes wrong", "Author": "A. Shelton \"ashelton\"", "ReviewID": "R2MGTWN0X87317", "Overall": "1.0", "Content": "I have just spent over an hour with Toshiba customer service over an issue with my Toshiba Satellite laptop. This is the third time that this issue has occurred. Even under warranty, Toshiba expects the customer to pay for shipping to repair at $29 a pop. Even if it's a problem on their end. I would NEVER buy a Toshiba computer again based on their customer service. Today, I called the 1-800 number three times in order to initiate a repair for my laptop. Even though I was repeatedly asked for my telephone numbers (in case we got disconnected), I was disconnected twice, never rec'd a phone call back, and then had to go through the tedious voice mail system in order to speak to someone. Three different people and three times having to reexplain what was wrong. That is only the beginning of my annoyance. I was repeatedly put on hold for 5+ minutes at a time in order to enter the same information into your system, or to check with protocols or whatever. Was repeatedly asked for my phone number and email address. Repeatedly having to explain what was wrong with my computer. Even to the Customer Service case manager who supposedly had all the info entered by the previous people in the computer.This is the third time that this laptop has had an issue with the CD Rom player. This same laptop has had a faulty CD ROM player in 1/13/14 and 7/25/2013 had it completely replaced. There is obviously a problem with the company's CD player manufacturer. A bigger problem is the customer service. If I had known that any time I had an issue with this laptop that I would have to mail it to Toshiba (at my expense) then I would have NEVER chosen this company. I purchased an extended warranty and LoJak but I am expected to pay for shipping (3x) for an issue the COMPANY should have to deal with.It should not take an act of God to get shipping paid on the third time this issue occurred. It took me over an hour and five different personnel people in order to not pay $29.95 for fedex shipping. This is a ridiculous waste of my time and reflects poorly on the company.", "Date": "June 6, 2014"}, {"Title": "Just a mess", "Author": "Jacqueline Landry \"JLLandry\"", "ReviewID": "R2ZQ2Q5YIQ92AE", "Overall": "3.0", "Content": "I'm grateful to have a laptop. However, this one came literally riddled with viruses, trojans, spyware and malware. It has taken days to clean it up enough to be usable. It's still got a Bloodhound.malPE lurking on it that even the Norton removal tool can't get rid of. If I had it to do over again, I would trade up a few ducats to purchase a clean, usable from the box computer instead of this mess.", "Date": "May 27, 2014"}, {"Title": "Crap", "Author": "Rex Logan", "ReviewID": "R259VTIWHD9H0J", "Overall": "1.0", "Content": "Toshiba makes junk! Stay away! You might as well buy cheap Chinese crap on Ebay. Nothing more to say period.", "Date": "May 20, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00JTI4X3E"}}