{"Reviews": [{"Title": "Awesome", "Author": "replayreb", "ReviewID": "R18D3KOEIV75L1", "Overall": "5.0", "Content": "I have been looking for a powerful laptop for my son who is going off to school this fall.  We really liked the Samsung ATIV Book 9 Plus NP940X3G-K04US 13.3-Inch Touchscreen Laptop (Mineral Ash Black) but were concerned about the reviews about various programs not scaling correctly on the 3200 x 1800 QHD+ screen.  A reviewer of that product pointed out that Samsung was releasing this 15.6 inch version with a 1920 x 1080 screen so we pre-ordered it.  Thank you LarryC!  We received it yesterday and it is awesome.  In short, 1920 x 1080 is plenty for a 15-inch notebook.  Scaling is set to 125% by default in Windows display properties but text in Chrome appeared blurry so we had to go into Chrome's settings chrome://settings/ and set web page scaling to 125% by default to match Windows' settings.  That made everything sharp again.  If you set scaling to 100% in Windows display properties to make it match the screen's native resolution, everything is really sharp but icons and text become really tiny on a 15-inch 1920 x 1080 screen.  I can't imagine how tiny they were on a 13-inch 3200 x 1800 screen! There was minimal bloatware to remove; Norton and maybe one or two other items.  My son uses a Ear Force X12 Gaming Headset and Amplified Stereo Sound with a USB cord and separate headphone and microphone cables but the notebook only has a combination headphone/microphone port on the left side.  I bought a Rockit Headphone/Microphone Splitter and that worked perfectly but it blocked the USB port so I had to order a Cellet Slim 3.5mm Pin to 3.5mm Input Mini-Jack Adapter for iPhone - White to extend the Rockit adapter.  If you order a different extension, just make sure it has 4 bands/conductors/contacts/poles on the plug instead of the usual 3.  I also bought my son some Bose Companion 2 Series III Multimedia Speakers to plug into his notebook when he was in his dorm room and an issue that came up was that due to some European Union legislation, Samsung's Realtek audio driver would pop up a Windows volume warning that you had to click on to dismiss every time we turned the volume up past 42% when either the external speakers or headphones were plugged into the headphone jack.  Seems insignificant but just think about how many times you adjust the volume each day and you can see how quickly that can become annoying.  I researched it and if you simply uninstall Samsung's Realtek audio driver in the Control Panel and reboot, Windows will install a standard audio driver and there is absolutely no difference in sound quality or audio options available to you except no more annoying pop-up!  After solving the scaling issues, combo heaphone/microphone jack and volume warning pop-up, we are extremely pleased with this purchase and would buy it again!", "Date": "May 30, 2014"}, {"Title": "Windows 8 + ATIV Book 9 = Surprisingly Good", "Author": "W. Herron", "ReviewID": "R2RPVB3IIIQ1F1", "Overall": "5.0", "Content": "Everybody seems to like to trash Windows 8, and those same people like to complain about anything that is not Apple. Sure, a MacBook Pro or Air will spoil you, Apple gets a lot right.  In the old days, Thinkpads were pretty much the gold standards, for a lot of reasons including IPS screens, keyboard, durability, and a lot more.  Thinkpads now pretty much suck.This ATIV Book 9 2014 edition reminds me of how I felt 10 years ago when I purchased my first Thinkpad.  Screen, keyboard, case texture, graphics: all of it works together beautifully and you just want to use it, touch it, type on it and stare at the screen.  Apple captures pretty much the same feeling, but this is Windows!Hats off to Samsung, this is really good. And congrats to Microsoft, Windows 8.1 is also good (well, I did have to install Startisback, a program to make the old Start menu more accessible, so all is not perfect).Highly recommended.", "Date": "June 6, 2014"}, {"Title": "Generally meets expectations", "Author": "Vincent Chiu", "ReviewID": "R2R4ZMZTI22QD9", "Overall": "3.0", "Content": "I've used PCs all my life, but switched to using a Macbook Air for the past 3 years because I was happy with my other Apple products and it was (and amazingly, still is in a lot of ways) the gold standard for laptops. But I was never able to get completely comfortable with it - the keyboard layout and shortcuts, the Mac OS in general, etc. It seemed like PCs caught up in the ways that I cared about - weight, battery life, screen quality, etc...and even surpassed Mac laptops in a few ways (e.g. touchscreens), so I figured maybe at this point I could have the best of both worlds - the OS I liked and high quality hardware. So, given that context, how is this laptop?I'm a pessimistic guy by nature so I'll start with the negatives:- the trackpad blows. Definitely better than what I remember was the norm 3 years ago, but this is nowhere near as accurate as the trackpad you find on Macs. The glassy surface is similar, but it seems to vacillate between being too sensitive and occasionally completely unresponsive (mostly when scrolling). On top of that, there is no support for gestures. When you go to some hardcore PC forums, people have uncovered why: Samsung somehow just plain forgot to include a driver. And based upon my reading so far, there isn't a way to fix it. Ridiculous.- Windows 8 is pretty unintuitive. The last time I used Windows was Windows 7 so this is new to me. And while I'm sure I'll be able get my head around it eventually, it's definitely a mess right out of the box. I dread the day I have to upgrade my mom to Windows 8. It's as unintuitive as it gets.- I hate bloatware and anyone who has had any Samsung product knows they love to put their crap all over the place. It's annoying.- I thought that you would be able to open up the screen 180 degrees the way you can with the 13-inch ATIV Book 9. Nope.The middling:- The keyboard is ok. The build quality is actually very nice, but I should have heeded what reviews say about shallow keyboards. The Mac keyboard is pretty shallow so I thought, \"how different could it be?\" But the reviews warn that shallow keyboards without a sufficient travel feel harsh to type on. And they're actually right. It's actually a bit tiring to type on for an extended period of time (i.e. this review). I think it'll be fine for my purposes, but nothing more.- The screen quality. I chose this laptop specifically because I didn't want to deal with the scaling issues you get with the new batch of super high resolution laptops. But it turns out you still have to play around with the settings sometimes to get certain apps to look ok. Once you do, it looks great, and the colors are beautiful, but it does take some fiddling.- The battery life. When this laptop was first announced, what really caught my attention was the promise of 14 hour battery life. At some point that went out the window and a few weeks ago Samsung started saying that the battery life would only be 8.8. I don't really understand that. I think that's a respectable number, but not amazing.- Having a touchscreen. I thought it would be cool, but it turns out that on a laptop, it's only marginally useful.The good:- It's light for a 15.6 inch laptop. And thin. If Apple took a Macbook Air and just made it with a bigger screen, this is what it would feel like.- The big screen. A 13.3 inch screen was just a tad too small to do real work on for me, so I was definitely looking for something bigger and this fits the bill.- It doesn't get hot. With the Macbook Air even if I wasn't doing anything that intensive, it would eventually get warm enough that I didn't like it.- It's fast. But I don't play games or do anything too intensive, so I may not be the best judge. My main barometer is how fast it starts up or opens applications, and it's plenty fast.=-All in all, I'm happy with my purchase, but I'm not thrilled with it. The trackpad, Samsung bloatware nonsense, and Windows 8 are enough to make me question whether I really should have switched back. I realize that only 1 of those really has to do with the laptop itself, but that wasn't how I was making my decision, nor how I set up this review. I guess I would say if you're looking for a 15-inch laptop, it's pretty much just between this a Macbook. And this is a perfectly respectable and serviceable competitor.", "Date": "May 31, 2014"}], "ProductInfo": {"Price": null, "Features": "Intel Intel Core i7 4500U 1.8 GHz (4 MB L3 Cache)\n8 GB DDR3L SDRAM\n256 GB Solid-State Drive\n15.6-Inch Capacitive Touchscreen, Intel HD Graphics 4400\nWindows 8.1, Up to 8.8-hour battery life", "Name": "Samsung ATIV Book 9 2014 Edition 15.6-Inch Touchscreen Laptop, Mineral Ash Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41zjjDcqgvL._SX300_.jpg", "ProductID": "B00J49ZH56"}}