{"Reviews": [{"Title": "AWESOME BIRTHDAY GIFT FROM ME :D", "Author": "Princesse", "ReviewID": "RI2AZLGRWZP0G", "Overall": "5.0", "Content": "I love it! it was exactly what i wanted for my birthday :D it does everything i need and its the perfect size 17.3 so i can watch netflix and youtube video and the sound is amazing :D", "Date": "May 4, 2014"}, {"Title": "Excellent laptop for the price!", "Author": "Jose Gregorio Herrera \"Jgreg\"", "ReviewID": "R3RT4K0G5N9W1I", "Overall": "5.0", "Content": "After doubting about the AMD CPU I just bought it. My last laptop was a Core i3 and it was fast but screen got broken and needed a new laptop asap. I just added another memory module and with 8 GB it rocks. Also got rid really quick of Windows 8.1 and installed Windows 7. The drivers are a real issue but after few hours you will find them from lenovo and HP. The screen is huge and really nice. I like the combination color on the body: silver and black which makes it look thinner. I ran 3d mark 2003 on windows 8 and Windows 7 and the results were really different (11k on Win8 and 14k on Win7). It runs everything very well even some light gaming. Good laptop for the price and the video card is really powerfull. If you are looking a laptop for light gaming thisis for you.", "Date": "May 26, 2014"}, {"Title": "EXCELLANT LAPTOP PC", "Author": "Steven A. \"Flatwo\"", "ReviewID": "R17XWCH0WTJEWW", "Overall": "5.0", "Content": "Our household now has three of these. This is by far the best value in a laptop. It has up to date USB 3.0 and HDMI ports. The AMD 8 Quad Core processor is one of the fastest available anywhere in this price range so pages load quickly even when there are multiple advertisements on a web page.", "Date": "June 9, 2014"}, {"Title": "This is my first windows 8 laptop", "Author": "charles runnels", "ReviewID": "R3IHTC6D8K3KI5", "Overall": "4.0", "Content": "Had a terrible time figuring out how to effectively use this device.Too much ingrained with my old PC and windows XP.The whole tile and touch process was brand new. I don't have a smartphone and don't need those kinds of devices.As far as how it works? Can't really make a good judgment at this point. I suppose it works as featured.Very disappointed that it isn't as fast as I thought it would be.Also, annoyed as to how it tries to read my mind and make appropriate choices for me like some overeager parent.As to the timely delivery..very good! Prompt. It was an initially easy setup.", "Date": "June 1, 2014"}, {"Title": "AMD and HP motherboards burn out after one year", "Author": "Jane K.", "ReviewID": "R9V4EM7L0W5D6", "Overall": "1.0", "Content": "Hp laptops work well when they are working, but be forewarned - they do not last.  The motherboards get hot and burn out.  It is not worth the money to fix/replace a motherboard.  There is no response from HP on their support site regarding this issue and HP continues making them.  Before buying any HP, please look at the problems encountered with this issue.  Count on this notebook lasting one year.", "Date": "May 27, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00J6ZEHXQ"}}