{"Reviews": [{"Title": "C55-A5107", "Author": "sam walsh", "ReviewID": "R336OQDFNETZ8Y", "Overall": "4.0", "Content": "i like the computer. its all around pretty speedy and doesn't have any major design problems. its Quad Core processor is nice as well as the 700GB hard drive. only problem is the operating system. WIN 7 is always better than windows 8, simply because its easier to navigate.", "Date": "March 31, 2014"}, {"Title": "Love IT!!!", "Author": "Tink", "ReviewID": "RYI8DQP4K27PI", "Overall": "5.0", "Content": "I purchased this laptop just because of the price and needed to update from XP. Was my first experience using windows 8.1. I don't know what all the fuss is about not that bad. I set it up to always go to the desktop and use my desktop short cuts like I did on XP and on my wife's Windows 7. I had a Lenova  laptop which was pretty good and would have continued to use it had it not been XP. this is much faster than it was and is slightly faster than my wife windows 7 Dell laptop with a Pentium processor. I would definitely buy this laptop again . Hold a charge a very long time and is light weight and the screen clarity is wonderful. the only thing it does not pick up the wifi signal from our router as good as the old Lenova did so I don't venture far.", "Date": "May 22, 2014"}, {"Title": "sturdy and never had a problem with any of them", "Author": "Cathy Armstrong \"gladgirl78\"", "ReviewID": "R3SCYOVEHZW8Z1", "Overall": "5.0", "Content": "3rd Toshiba Satellite 15.6 over the last few years, for various family members. Plenty fast enough for home use, sturdy and never had a problem with any of them. My 13-yr-old plays many video games, and the graphics and processor speed are great. Will keep buying these as long as they make them.", "Date": "May 3, 2014"}, {"Title": "Disappointing", "Author": "nydadx1x", "ReviewID": "RPSJYEWM28EBK", "Overall": "2.0", "Content": "After several years of reliable performance from my Dell Inspiron 15R the motherboard finally failed.  I needed a laptop immediately for work and school so I shopped around and found what I thought was a good deal on this machine.  It has been nothing but a headache for the week I've owned it.  First problem:  The virus commonly know as Windows 8/8.1.  Absolute garbage.  The next problems include, but are not limited to:  The AMD A6 5200 Quad-Core APU is disappointing.  Dual Core i5s are better performers.  I doubled the RAM to 8 gigs and it still runs Win8 like about as fast as a pregnant wiener dog walking backwards on a two foot leash.  The build quality is typical of what you'd expect from a grade school aged assembler on the pacific rim working 16 hour days at bayonet point for a bowl of rice.  Cheap, thin, brittle plastic.  It's out of square so that if you set it down on a flat surface like a table or your desk it rocks on two of it's opposing four corners.  I wonder if the motherboard is similarly twisted inside.  I would return it but I've already wiped the HDD and put Ubuntu on it, thus invalidating the warranty.  $40 to get 'recovery media' from Toshiba.  No thanks, you can keep your virus.  Forget trying to downgrade to Windows 7, toshiba doesn't support windows 7 for this unit and the drivers just aren't available.  In short, find something else.  I am very angry at myself for spending my hard earned money on this laptop.  Hopefully my experience can save other potential buyers similar grief.  Although the laptop isn't aware, it is soon to spend the rest of it's days as a lab rat in my computer dungeon.", "Date": "March 28, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00J1MH1D2"}}