{"Reviews": [{"Title": "Might have just saved our lives", "Author": "Michael Clabough \"M. Clabough\"", "ReviewID": "R3MTRWKXH4ULRR", "Overall": "5.0", "Content": "I bought two of these after another cheaper carbon monoxide detector had alarmed in the middle of the night.  I had read some reviews of the other carbon monoxide detector having false alarms and convinced myself it was probably a false alarm but I opened windows to air out the house.I got these two days ago and they alarmed the first night.  I opened the windows and deduced that it was probably my tankless water heater which was recently installed and failed inspection. It is scheduled to be brought up to code this week.To prove my theory I made sure the central heat was off for a day and we hadn't used the clothes dryer for a few days and I put one of these detectors in the laundry room where the tankless water heater is installed.  We have one of those large jacuzzi style baths in the master bathroom (hence the need to have the tankless) and we took a bath last night.  When we were done the alarm was going off.  I had done some minimal research before doing this test and knew that too high of a level (12,800 ppm) can kill you instantly after just 2 or 3 breaths.  I had read that 400+ can be lethal.  Wikipedia states 800 ppm will cause dizziness, nausea, and convulsions within 45 min and you will be insensible within 2 hours and 1600 ppm can kill you in 2 hours.  So I went downstairs to see what the reading was.I held my breath and went in.  875ppm is what it read.  I called 911 and the firemen came.My wife, 2 year old, and 2 month old were upstairs and in a room with the windows wide open.  They came in and took their readings.  They said they are not allowed to work in an environment where the levels are above 30 ppm without respirators.  The windows had been open for 15 minutes and they were still getting readings over 70.Later, we compared what their professional monitor said to what the my 2nd First Alert Carbon monoxide detector was reading (remember I bought two of these).  Their reading matched exactly what this unit displayed.  So you can trust these devices.Please trust your device.  Thats what you bought it for.  Call 911.  Open windows or get out of there.  The long term affects of Carbon Monoxide exposure can cause heart problems, learning disabilities, and many other terrible things.  I am now worried about what this has been doing to my family over the last 4 months since the water heater was installed.  Like I said I have a 2 month old....I have posted a picture of the unit reading the max value from last night.", "Date": "January 16, 2011"}, {"Title": "Seems OK, but have several concerns...  UPDATED", "Author": "Pierre François André Méchain \"Pete\"", "ReviewID": "R3ABCFNR7NPP9M", "Overall": "3.0", "Content": "Another update.See recent reviews by others (especially Robert Oppenheim) as well... We just got two of the redesigned ones and indeed they have dropped the remote control feature (good thing) and that would make them deserving of 4 stars, however, they also changed the Peak Level recording, automatically deleting it every 24 hours--that's a bad thing for several reasons and leaves my rating at 3 stars:1)  The peak level resetting should be under user control.2) One wants to know if, say, during the past week, there was an excessively high reading.  Given how it now works, you cannot find that out!A 24-hour automatic clearing of a bad reading hides potentially dangerous, even lethal situations.  (Unless one becomes obsessive about checking this every day!)  In this day and age, they really should have a small memory and track days and peak levels!Here are some other updates--and First Alert deserves credit for listening to some of the critiques.1) The manual, well it is really a pamphlet, is more readable now.2) The warranty has been upped to 7 years.3)  They greatly improved the packaging.Alas, the way the unit is designed means it still wobbles on a nightstand or bureau; the battery cover still doesn't work very well; the CO level still shows up only if one presses the button (and that's a tricky press); the battery symbol still suggests that one is on battery power--they really need a dual indicator for that.  In fact, it would be better if you had to press to get the battery level, but that the current CO level would always be displayed.  (It's now the reverse.)Unfortunately, there's another problem.  The darn thing glows in the dark and lights up an entire room.  It makes it nearly impossible to keep it in a bedroom.  We miss the comfortable soft red light 0 of our old Kidde model immensely (but their newer ones seem to have BRIGHT RED lights now).I would have been happy to give this 4 stars, especially given the various improvements, had they not adopted the 24-hour peak level reset.  Oh, well.--------------------------------------------------------------------------PRIOR REVIEW:I have updated my rating and review to include CONSUMER REPORTS' FINDINGS.  It was top rated by them.  That initially improved my rating, upping it to four stars.  Well, we're now DROPPING it back down one.  We discovered that the remote control \"feature\" (which we had viewed as a gimmick in any case) is not one!  Turns out, that if we press the Mute button on our remotes (just press, not even holding them down), the darn CO alarm goes off!  The remote test operation is only supposed to happen if you hold down the volume or channel button for FIVE seconds.--------------------------------------------------------------------------We bought this to supplement our Kidde Nighthawk CO detectors, the 900-0234 curved model with a 7-year warranty (we didn't want to put all our eggs in one basket!).  The First Alert looks to be a fine CO detector.Here are some positives:1)  It has the plug on a wire, so that you can put the detector somewhere other than right in the outlet.  That's helpful as outlets can have other adapters in them making it hard to plug it in or be behind something rendering the CO detection harder.2)  It can be tested or silenced with a remote (hold down the volume or channel button for 5 seconds) (our Tivo remote worked!).  (Some of their other products with the remote features have received critical reviews as regular remote operation has set them off!)3)  Operates on AC with a battery backup (2 AAs)4)  Batteries ARE included!!5)  A biggie!  Consumer Reports rated this much higher than the Kidde brands.  It's better at detecting low levels of CO.Here are several negatives:1)  5-year warranty unlike the Kidde's 7-year.  [This has apparently been upped to 7 now, but check with the company.)2)  A \"manual\" that's a huge, cumbersome, folded sheet, with small print that's blurry and hard to read.  They should supply a magnifying glass with it!  This is a major concern as one needs to refer to the text for installation, for operation, to determine what to do under certain conditions, etc.  [This also supposedly has been improved.]3)  Yes, one can park the detector on a bookshelf (with the cord going to the outlet), but the detector itself wobbles!  The previous Kidde CO detector Nighthawk model--the COPP-3 -- has the plug on a cord feature, along with a nifty slide out stand that makes it stable.  (We had good luck with that model, but many did not.  Plus, it's an older model, with only a 5-year warranty which is why we went for the 900-0234).4)  The CO level only shows up if one presses a button.  It's a cool blue light, but unlike the Nighthawk's red LED that shows you the current CO level at all times (a reassuring 0), this displays a blank screen with a recessed green light.  For some, it could be a plus as it would be less intrusive especially as the Kidde's red LED seems to be much brighter on their latest model.5)  The detector displays a battery icon when it's plugged into AC and the battery is installed!  That's unnerving as it makes it look as if it's running on the battery!  Very odd design choice, as in most of the electronic world, that's an indication that you are running on battery power and no longer on AC (take any laptop, e.g.).6)  The test alarm didn't seem as loud as the Kidde's.7)  Battery cover is the front of the device, which the manual didn't explain or illustrate, and it doesn't shut well--or rather, it's awkward and you feel as if you're about to break the lightweight plastic parts.8)  One other issue, which plagues all the CO detectors and many other products on the market, is the infuriating, hard plastic packaging.  It's hard to open and I even cut myself on it.  There are alternatives that are just as secure but much friendlier to the environment and the customer!In comparing the two (Kidde Nighthawk 900-0234 and the First Alert CO615), the advantage on first glance clearly goes to the Kidde.  It just seems a more professional, better designed, and better thought out product.  Part of that is because we're used to the Kidde design and like the red LED, but it also seems more solid (the First Alert has the seemingly fragile/flimsy cover), and has a higher quality, usable manual--it's a real booklet that's more readable and better organized (it also has a bigger font than FA's, but still could be larger).UPDATE--OTOH, I'm a believer in most of what CR does--and the testing on these--and the user reports here and on the web--suggest that it is the better detector.  And, after all, that's what one buys these things for!  However, we're not going to be able to use this in our bedroom as the Mute button sets off the alarm!", "Date": "June 1, 2009"}, {"Title": "Well thought out design, but nothing special.", "Author": "S. Power", "ReviewID": "R1KNJED89FAW0K", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moDQHJ8YD8P302embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moDQHJ8YD8P302refresh_preplay() {\n\ndocument.getElementById(\"cv_moDQHJ8YD8P302chiDiv\").innerHTML = document.getElementById(\"cv_moDQHJ8YD8P302hiddenPre\").innerHTML;\n};\ncv_moDQHJ8YD8P302refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moDQHJ8YD8P302so;\t   \n\n\nfunction cv_moDQHJ8YD8P302loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moDQHJ8YD8P302so = new SWFObject(swfLocation, \"cv_moDQHJ8YD8P302AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moDQHJ8YD8P302so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moDQHJ8YD8P302so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moDQHJ8YD8P302so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moDQHJ8YD8P302so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moDQHJ8YD8P302so.setAttribute(\"height\", swfHeight);\n          cv_moDQHJ8YD8P302so.setAttribute(\"width\", swfWidth);\n          cv_moDQHJ8YD8P302so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moDQHJ8YD8P302so.write(\"cv_moDQHJ8YD8P302flashcontent\")) {\n          fp_resizePlayerSpace('cv_moDQHJ8YD8P302', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moDQHJ8YD8P302';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moDQHJ8YD8P302', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moDQHJ8YD8P302loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moDQHJ8YD8P302\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1QNTF1S0QZA5I\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1QNTF1S0QZA5I\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1KNJED89FAW0K\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1QNTF1S0QZA5I/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moDQHJ8YD8P302duration')) {\n      document.getElementById('cv_moDQHJ8YD8P302duration').style.display='none';\n    }\n    cv_moDQHJ8YD8P302loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moDQHJ8YD8P302loadSwf(movieID, playerVersion) {\n   return _cv_moDQHJ8YD8P302loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moDQHJ8YD8P302newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moDQHJ8YD8P302', 0, h);\n}\n\nfunction cv_moDQHJ8YD8P302resetPlayer(w,h,bw,cc) {\n  cv_moDQHJ8YD8P302newHeight(h);\n\n  cv_moDQHJ8YD8P302so.addVariable(\"resetBandwidth\", bw);\n  cv_moDQHJ8YD8P302so.addVariable(\"cacheCode\", cc);\n  cv_moDQHJ8YD8P302so.setAttribute(\"height\", h);\n  cv_moDQHJ8YD8P302so.setAttribute(\"width\", w);\n  cv_moDQHJ8YD8P302so.write(\"cv_moDQHJ8YD8P302flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moDQHJ8YD8P302RollOverImg = new Image();\ncv_moDQHJ8YD8P302RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81sjsWm7tSS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moDQHJ8YD8P302preplay = document.getElementById('cv_moDQHJ8YD8P302preplayImageId');\nif (cv_moDQHJ8YD8P302preplay) {\n  cv_moDQHJ8YD8P302preplay.onmouseover = function() {\n    cv_moDQHJ8YD8P302preplay.src = \"http://ecx.images-amazon.com/images/I/81sjsWm7tSS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moDQHJ8YD8P302preplay.onmouseout = function() {\n    cv_moDQHJ8YD8P302preplay.src = \"http://ecx.images-amazon.com/images/I/81sjsWm7tSS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moDQHJ8YD8P302preplay.parentNode;\n\n  var cv_moDQHJ8YD8P302currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moDQHJ8YD8P302currentClick) {\n      return cv_moDQHJ8YD8P302currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:44 MinsA short video to show the detector in use.  I don't subject it to any test fumes in this video.", "Date": "May 3, 2011"}, {"Title": "First Alert CO615 Carbon Monoxide Alarm", "Author": "G. Ewing", "ReviewID": "R2RZII28BOJK76", "Overall": "5.0", "Content": "I ordered and received this item timely from Amazon.  The product was well packaged and the directions for use were easy to follow.  The product is nicely constructed, easy to use, and seems to work well.  I like the fact I can push one of the buttons located on the front of the unit to see if the unit has picked up any CO levels from the area it is located. It is designed to plug into a wall electrical outlet and also has a battery backup. The unit is small and appears out of the way when it is plugged in and being used.  So far, the two units I bought are working well so I give this product a rating of 5 stars.Update: Jan. 14, 2011 - I have now owned two of these devices for over two years and each one is still working just fine. I have had to replace the back up battery on each just once a year, which is fairly standard, so the devices seem to be well built and last.", "Date": "December 30, 2008"}, {"Title": "TC's First Alert C0615", "Author": "T.C.", "ReviewID": "R2QG95ACESB4TU", "Overall": "4.0", "Content": "A previous reviewer stated problems with the back-up battery cover First Alert  CO615 Carbon Monoxide Detector.It is flimsey and does not close easily once the battery is installed - it took me 3 or 4 trys to get a positive lock on the cover without breaking off the plastic latch protruding from the back of the cover.Other than the battery cover, happy with the product to date.  NO false signals, no problems with the back-up battery after a month. Purchased at Amazon.com", "Date": "November 27, 2009"}, {"Title": "Great feature - battery backup", "Author": "CastletonTrader \"Mom\"", "ReviewID": "R1SIM01T5XW1XX", "Overall": "5.0", "Content": "I bought this to replace my older detector. We lost power for 4 days and that's when I realized that without battery backup my carbon monoxide detector was useless.  I needed it because we were using a kerosene heater for some heat and we got a bit ill from it. So next time we lose power and have to use emergency heaters at least we will know if the carbon monoxide levels become unsafe.", "Date": "January 17, 2009"}, {"Title": "Peace of Mind", "Author": "Rudy1150", "ReviewID": "R15HLNQ4FGMXDT", "Overall": "5.0", "Content": "I've owned this product for 3 years.  Simply plug it into the wall, the unit comes with a battery for battery back up.  It is very small and unobtrusive compared to my previous kidde unit and doesnt take up both outlets - nice design.There have been several reports of people getting sick or dieing from carbon monoxide poisoning - this is a small price to pay for a life safety device.It has a digital readout.  This is a nice feature - if you had a problem and called the fire department they would be able to read the display to determine what level of Carbon Monoxide poisioning there way.", "Date": "February 9, 2009"}, {"Title": "Peace of mind for you and your family.", "Author": "Mister Amazon", "ReviewID": "R1PWTII64CYOLV", "Overall": "5.0", "Content": "Here are my first impressions and what I liked about the First Alert C0615 device:1) This unit comes with two Energizer E91 batteries.  Yes, batteries are included with this product).  After inserting the batteries and plugging this into the wall outlet in the bedroom, I saw a battery meter flash.  It showed the battery had full power.2) The battery door is on the front of the unit.  I like this design because you can have access to the battery compartment while leaving the unit plugged into wall.  Also, I was able to open the battery door easily with one finger.3) I like the display button.  When pressed, the unit will show you the highest carbon monoxide level recorded.  This is something I plan to monitor often.4) Green light vs Red light.  When I plugged it in, the light is green.  Should the device ever detect unsafe levels of CO, the light will turn red and the audible alarm will go off.  While I hope to never see the red light, it is reassuring to see the green light and know the room is safe.What you might like to know about this product:1) I recommend that you open the packaging from the bottom.  I could not separate the plastic packaging at the top.  However, it easily opened at the bottom, and continued to open all the way along the sides - up to the top, where I could no longer separate the plastic seal.2) All CO monitors that I've researched intentionally stop functioning after 5-7 years (for your safety).  This is due to the life of the CO sensors.  I've owned KIDDE brand and now this First Alert brand, and they all expire.  Replacing these devices after 7 years is piece of mind to ensure you always have a functioning CO sensor that will accurately detect carbon monixide.3) This unit should be replaced 7 years from the month/year you first installed it. (see the bottom of page six in the owners manual for more information about this).4) This particular brand/model is currently ranked #1 by a leading consumermagazine.For best results:1) Use only Energizer E91 batteries and replace them immediately when the unit tells you to.  Never use rechargeable batteries with this device.2) Install the device away from windows or fans. (Blowing air may prevent CO from reaching the sensors).3) Install the device 10 feet away from a water source (bathroom or laundry room).4) The device is intended for bedroom and living areas.  Do not install this in the kitchen area or in the garage.", "Date": "November 3, 2011"}, {"Title": "Works great. No false alarms.  Get FRESHLY dated!", "Author": "Nancy T", "ReviewID": "RXYFE8W01ZO65", "Overall": "4.0", "Content": "I think the First Alert Co615 carbon monoxide alarm is an excellent product.  I would have given it 5 stars instead of 4, except for the fresh-dating issue.I bought two of these carbon monoxide detectors from Amazon two years ago, in April, 2010.  I like the following features:- It is powered by plugging it in, with a battery backup.  So, it does not use the batteries much, but it will still operate if there is a power failure.  And the batteries are two AA's, so they are not expensive.- No false alarms.  I don't want to lose a night's sleep for no reason!- The batteries are not depleted as long as the unit has AC power.  In two years, there is no noticeable drop in battery voltage.  Therefore, I am not awakened by low-battery warnings, like the purchasers of some other brands.- Digital readout.  You can press the button and see the reading at any time.  Mine have always been zero; if I saw anything else, I would look for furnace, water heater, stove, or other appliance malfunctions.  Some people have complained that it does not display the reading constantly, without pressing a button; I suspect this would drain the batteries more quickly in case of a power outage.- Detachable plug with extension cord.  You can plug in the unit at ground level and install it much higher, so you can read it easily, and also have the unit sense readings higher off the ground.  (Carbon monoxide is just slightly lighter than air.)I decided to purchase a third detector from Amazon.  But when I put in the search criteria \"Co615\" with an \"All Departments\" search, a little note was displayed with a date of \"May 2, 2007\".  I e-mailed Amazon customer service to find out if this was the date of manufacture, and they confirmed it was.  This date is unacceptable.  The detectors have chemical components that deteriorate over time, even if the unit is not turned on, and this date is FIVE YEARS AGO.  I decided to purchase my third unit from First Alert directly in order to get a fresher unit.  If I had received an older unit, it still would have been warranted by First Alert for seven years from date of purchase.  However, I did not want to buy an item that had an increased chance of failing prematurely.I think both First Alert and Amazon can do better on the fresh-dating issue.  First Alert should put the date of manufacture where it can be seen without opening the package.  Right now, it is only on the unit, and you have to open the package and remove the plug to see it.Amazon only displays the mysterious date (which happens to be the manufacture date) on the \"All Departments\" search result screen. It does not appear in the detailed description of the item.  It also does not appear if you search within a particular department, like \"Tools and Home Improvement\".  This date is important, and it should not appear only intermittently and without explanation.", "Date": "March 7, 2012"}, {"Title": "Very high quality for a Carbon Monoxide Alarm!", "Author": "ATierney", "ReviewID": "RMTSUKF4JU26T", "Overall": "5.0", "Content": "People most likely wonder why shop around for some fancy monitor? Well first of all it could save your life in the event of a leak.  This monitor goes over the expectations, it has a constant read out of current levels, which for some reason were somewhat high at house which was the normal, turns out we had a slight leak in our basement (Nothing to serious) but enough that the sensor picked it up, We're grateful that it picked up the slight amount because now we feel much safer knowing that something that went undetected with our previous monitor was picked up by this one.  It works great and is worth the up front cost, You can't put a price on your life, You can however protect it.  A true great product.", "Date": "July 2, 2011"}, {"Title": "lots of small instructions, not much good information", "Author": "Grampie to 3 \"Jim\"", "ReviewID": "R3SBGMOVV5EA38", "Overall": "3.0", "Content": "After looking at consumer reports, etc., I felt as if this would be a good choice; On arrival, the one sheet information page, which was written in very very small print and could have been on 6 pages (yes it had that much typing on it!)never did tell how to tell if it is working ok, except to say a green light would be on once you plugged it in....did not explain easily how to test it or what readings you should expect when you did finally try to test it. Finally, it was heavy and would not stay in many of the outlets, would fall out....home is 26 years old, maybe the outlets need to be replaced. I chose it for the battery back up availability, perhaps a battery only unit would have been lighter. Anyway it is plugged in, I can see a green glow at night (must be working)..not sure I would buy it again. I am surprised consumer reports rated it so high...perhaps it works great as to sounding off at the least amount of carbon monoxide; If I am lucky, I will never hear that.", "Date": "December 23, 2009"}, {"Title": "Non Functional Out of the Box", "Author": "Jessssssss", "ReviewID": "R2JJB7MWZ7GL8J", "Overall": "1.0", "Content": "Ordered this because of the ratings on Amazon and Consumer Reports to replace a Kidde Nighthawk 2000 that when tested still seems to work.  The First Alert CO615 was non functional out of the box, the Test/Silence button did not work.  Cheap construction.  Returning this and looking for something better.", "Date": "October 25, 2010"}, {"Title": "Works well; cover broke", "Author": "D. Newman", "ReviewID": "R138EQDJC3PH4U", "Overall": "3.0", "Content": "Almost as soon as I'd opened this, the cover broke, and doesn't close anymore.  The detector is working, but the door isn't the best quality.  That's my only hesitation.  I bought this because it was highly rated by a well-known consumer review.", "Date": "December 21, 2009"}, {"Title": "Didn't work out of the box; horrible ergonomics; cheap design", "Author": "Aaron Cohen", "ReviewID": "R1X669A34SQ9LA", "Overall": "1.0", "Content": "After receiving this unit, I followed the instructions and installed the batteries, plugged it in to the wall, verified that the \"receiving power\" light was lit, and pressed and held the Test/Silence button.  After holding it for a minute with no sound being emitted, I tried again for a minute.  No dice.Normally I'd request a replacement be sent instead, but for several reasons I decided to opt for a refund instead:- I scratched two fingers on an extremely sharp corner at the top of the battery cover as I uninstalled the batteries in preparation for the return.  Ouch!- Removing the batteries was a pain: I had to use a pen to do it.- The battery cover itself appeared quite fragile: I thought I was going to break it when I attempted to close it and it wouldn't budge without what felt like enough pressure to snap the thing.- The battery cover design (where it is the entire front of the unit) is just plain lame.- The buttons are remarkably cheap - they're at the end of thin plastic posts and swivel from the side.  How hard is it to create a decent button, people?- The \"receiving power\" light is buried deep inside the unit, so it's not clearly visible from a distance during the daytime.So, since my overall feel for this product was \"extremely cheap and poorly designed\", and since my unit didn't even work out of the box, I just couldn't be inspired to entrust my life to a replacement.Not sure what I'll buy instead, since for some reason this is the highest-rated CO detector on Amazon; go figure ...", "Date": "January 5, 2011"}, {"Title": "Digital display misleading", "Author": "Wendy", "ReviewID": "R1J3WFX5KNV3NU", "Overall": "2.0", "Content": "I purchased this particular alarm because it appeared that with the digital display it would give readings of actual carbon monoxide levels. The product information supplied is very unclear about how the display functions, but it does indicate that the device is not meant to measure CO amounts at or below 30 ppm. It is not clear what minimum level of CO it can detect except that it should alarm at 70 ppm if it is exposed for somewhere between 60 and 240 minutes. You can push a button to have it show the maximum amount of CO detected in the current preset 24 hour period (though it is unclear when the 24 hour periods begin and end). Mine has never displayed more than 0 when I tested for that, which I guess means it hasn't reached the minimum detectable amount (not that there has been no CO present). Whether that minimum is 70 ppm, I am not sure. Although it is a plug-in alarm, it must have the batteries inserted or it will beep incessantly. That seems a prudent safety precaution, but somehow I didn't expect it. Happily, batteries are supplied.", "Date": "December 2, 2012"}, {"Title": "It's Easy and it Works!", "Author": "B. Bailey", "ReviewID": "R3AQ3KUJKFGSKR", "Overall": "5.0", "Content": "Recently our neighbors had an incident where a CO detector went off in the middle of the night and perhaps saved their lives. It reminded me that our old detector (Kidde Nighthawk) had eventually got to the end of its life and we had to throw it out and we had not replaced it. So we looked for a replacement that we could put up easily in a good location.How do you judge a CO detector? I searched online and checked out reviews of those that actually test these things with Carbon Monoxide and found that the First Alert was frequently rated better than the other brands. I wanted one that had both AC power and a battery backup and this one fit the bill.Here's what I like: After opening it up and popping in the included batteries, it was ready to go! The attached plug and cord are designed so that you can install it directly into an outlet or hang it somewhere else and run the cord to the outlet. But since Carbon Monoxide sinks, plugging it in at wall outlet height just makes sense (It can also be rotated 90 degrees in the outlet to make more room). You really don't even need to look at the instruction manual because it is so easy!People make a big deal about the lighting, etc. on the digital display, but here is the thing to know: The displays on these CO detectors generally do not display anything until the level reaches 30 ppm (even the ones with the always-on red digital display). Anything under 30 ppm and it simply says 0. So the only reason you need the display is if the alarm actually goes off. At that point the LCD flashes red and the number is displayed so that you can report it. I also like that this unit will keep the number in memory for 24 hours (after all, who of us will remember the number if the alarm is going off at 2:00 AM and you are calling 911?). The rest of the time, all you have to do is look at it and there is a small green led indicating that things are ok. Peace of mind!", "Date": "January 25, 2012"}, {"Title": "It's a way cool CO detector.", "Author": "Thomas (Sherri's husband)", "ReviewID": "R13JTO6GPV7X5Y", "Overall": "5.0", "Content": "Why do I write that?  Because it has an LCD display that with a push of a button, will give you the max reading over the last twenty-four hours.This unit comes with a set of batteries and plugs into to wall.  It also has it's own extension cord should you want to mount the unit higher up on the wall.  If you're a prime member, two day shipping is included.  I ordered a pair of these bad boys and one failed to launch.  Contacted Amazon Customer Support and immediately received return authorization including a link to download a return postage label.  A new unit was sent out next day.  Easier than driving and standing in line so as to deal with the return desk at a Big Box store.  And considering the price of gas these days, the possibility of a return is something one needs to consider.Very happy with the acquisition.  We now have a total of four CO detectors so as to comply with California's CO detector law that goes into effect 01JUL2011.  I have one in the garage, one in the entryway, one in the hallway next to the AC/Heater air return and a Smoke/CO detector installed on the LVRM ceiling.  If something happens to the family, it's not going be because of smoke or carbon monoxide poisoning.Good product, good price, good service.", "Date": "April 23, 2011"}, {"Title": "Broken out of the box", "Author": "Phil", "ReviewID": "R1PESQJ90FGMQR", "Overall": "1.0", "Content": "I ordered three of these units due to the new CA law. Two out of the three were dead on arrival. They read ERR in the LCD which, according to the instruction novel, means there is a malfunction. There is no instruction on how to solve the problem so I returned all three.", "Date": "July 2, 2011"}, {"Title": "Battery door won't stay closed", "Author": "Mom of twins", "ReviewID": "R22BQ4HHNTYTFL", "Overall": "1.0", "Content": "I bought two of these earlier this year.  Luckily, we have not had an occasion for the alarms to sound. However, on one of the units, the battery door doesn't close properly, and there is not a way to repair it.  It stays open slightly most of the time, and occasionally falls open completely.  It has been this way since I received it.  However, it was not  apparent until I opened the product packaging and opened the battery door to insert the batteries. Due to the packaging of this product in hard plastic that had to be completely destroyed to get it out, it wasn't possible to return it once opened.", "Date": "September 16, 2012"}, {"Title": "printed manual different than online", "Author": "Rob Oppenheim", "ReviewID": "R2Y33AA0A1EH3V", "Overall": "4.0", "Content": "I found the manual for the CO615 online at FirstAlert dot com.But it arrived with a newer paper manual, and some significant features have changed.The online manual was rev 10/06 (I guess that is Oct 2006) and my paper one is rev 09/10.The new manual says the Peak CO readout will auto reset after 24 hours (the old manual said it did not reset until you cleared it - which I would prefer - but not as much as Paul prefers it. There are advantages to both ways. Ideally it would show you both).The new manual does not describe using a TV remote control to silence the CO alarm - I do not know if that feature is still in the product or not, but it is not in the manual.Both the warranty and life expectancy are longer - 7 years vs 5 before.There maybe other differences too, I am not sure.Update: I scanned in my paper manual and uploaded it to Google Docs and to ManualsLib dot com.Amazon will not let me post a link to it.Try searching Google for FirstAlert-CO615-v2-user-manual.pdfSee Paul Robinson Review herehttp://www.amazon.com/review/R3ABCFNR7NPP9M/ref=cm_cr_rdp_perm?ie=UTF8&ASIN;=B000Q5VMKG&linkCode;=&nodeID;=&tag;=", "Date": "November 25, 2011"}, {"Title": "Easy to Install", "Author": "K. Wray", "ReviewID": "R30DIO2AWBLNVX", "Overall": "5.0", "Content": "All the local stores in Colorado were out of stock with waiting lists for CO detectors due to media coverage of several deaths in the state.  We got these in less than a week, and they were very easy to just plug into any outlet. They came with the back up batteries, so I didn't even need to supply my own.  Could not have been easier, and have the best of both worlds...an A/C powered unit with back up battery that I could install myself without mounting hardware or an electrician.", "Date": "January 28, 2009"}, {"Title": "First Alert CO alarm  NO /  Kidde CO alarm YES", "Author": "me", "ReviewID": "R3CUCBVM4RV5KS", "Overall": "1.0", "Content": "This FIRST ALERT CO alarm (and presumably others by the same maker) DOES NOT register readings under 30ppm, in terms of the digital highest readings shown. It simply ignores them  ....even though that might have shown a potential CO problem brewing.And you don't discover this point until you read the instructions.HOWEVER- the KIDDE CO Alarms DO measure peak readings below 30ppm...which is why I consider Kidde CO alarms to be a much better buy. I have both...and I am sorry that I purchased the First Alert CO alarm.", "Date": "January 1, 2013"}, {"Title": "Poor Battery Door Design", "Author": "Kevin G. Mathews", "ReviewID": "R3CPH1OY2YEAJW", "Overall": "1.0", "Content": "Good display, detailed directions. We would have used and purchased multiple units for each bedroom in our house but the battery door design is extremely poor. It clicks closed properly when no batteries are installed but with the two AA's installed the door will not close properly. There is a little arm that is attached to the battery compartment door which inserts in two positions, one straight in when there are no batteries, one higher up over the top of the batteries when they are installed to let the unit know batteries are present. The concept does not work well.We are returning the unit. Do not buy.", "Date": "July 7, 2013"}, {"Title": "Broken low battery indicator; batteries very hard to remove", "Author": "Cynthia", "ReviewID": "R16EHY5FRPG030", "Overall": "1.0", "Content": "The detector arrived with a broken low battery detector. Both the batteries it shipped with and a pair of brand new batteries (fresh from the package with an expiration date of 2022) caused the low battery detector chime to sound. Also, the batteries are *very* hard to replace--you have to press very, very hard at just the right angle for them to pop out of the housing. Very frustrating and disappointing for what I hoped would be an easy to use product.", "Date": "November 28, 2012"}, {"Title": "Not the most fun $30", "Author": "A. Clausen", "ReviewID": "R3S5SSKV9EERCK", "Overall": "4.0", "Content": "This device is pretty standard, you plug it into the wall and if there's too much CO, it should alarm.I was expecting the digital display to show a real-time CO level in the room. I thought that would be kind of cool. However, the digital display is blank unless the alarm goes off, in which case it will tell you how much CO is being detected (so you know how severe the CO concentration is, whether you should totally evacuate the house or if you can just open a couple windows).Otherwise it seems like a pretty standard detector.", "Date": "November 11, 2012"}, {"Title": "Bought it based on Consumer reports", "Author": "Amazon Customer", "ReviewID": "R35I63W8ZFKX1C", "Overall": "4.0", "Content": "I have no desire to save a few bucks on a CO detector when it could put your life in danger, and bought it on the recommendation of a consumer reports rating.  It plugs into the wall with a battery backup, was highly rated by consumer reports and gives me the peace of mind that I have a reputable detector in case I need it.  So far I have no compaints.", "Date": "May 28, 2012"}, {"Title": "First Impressions", "Author": "Forest", "ReviewID": "R10EW4BVQ3U4BW", "Overall": "4.0", "Content": "I bought the CO615 after seeing Consumer Reports rate it the best in its class and both CR and consumersearch.com claiming that it picked up low CO levels (~150ppm) faster than the Kidde Nighthawk models.Installation was easy.  I especially like the cord that can be tucked away for direct wall outlet mounting, and that the plug can be rotated 90 degrees.The interface is a bit annoying.  The display remains blank unless I hold in the Peak Level button for a few seconds, and the buttons are hard to press.I like the subdued status light; I don't want this thing lighting up a dark room.The remote control feature seems to have been dropped.  It was not mentioned in the printed manual that came with my unit, though the online manual still mentions it.  Why didn't they change the model number if they changed the feature set?  (Note: I bought mine from ACE Hardware; perhaps Amazon stock differs.)", "Date": "January 30, 2011"}, {"Title": "Junk!", "Author": "Amazon Customer", "ReviewID": "RLLG5R5C6GJ3Y", "Overall": "1.0", "Content": "I ordered two of these units in April 2012. Both units have falsed more than once, usually in the middle of the night. The peak level buttons on both were erratic in function from the start -- the button on one unit recently failed completely. I've junked both and ordered a couple of Pro-Tech units to replace them.", "Date": "September 5, 2012"}, {"Title": "CO detector has nice features", "Author": "The Penguin", "ReviewID": "RT6B9C8PLXU6Q", "Overall": "5.0", "Content": "I bought this unit for my bedroom.  It's the only CO detector in my home.  In the middle of my house is a small closet with an ancient gas furnace.  There doesn't seem to be any date anywhere I can see, but I would bet the furnace is 40 years old.  I like that this CO detector runs on A/C power and has battery backup (I think most CO units these days run on A/C).  Unlike other reviewers, I think the battery indicator makes a lot of sense; IT TELLS YOU THAT THE BATTERY IS WORKING!  How else would you know if the battery died?  As there is controversy concerning the placement of CO detectors, mine is sitting on top of a tv stand (about waist high) behind the tv where it is hidden.  While it might be helpful if the display always showed the CO level, I don't think I would ever look at it.This detector has a great design: the display shows you the highest level ever recorded and lets you reset to zero.  That means you can monitor CO level without have to be present to look at the display.  Also, the test feature requires you to hold the button on your remote for 5 seconds before test mode is triggered.  I've never set off test mode accidentally even though this sits next to my tv.I sleep better at night knowing I have this well designed unit protecting me!", "Date": "May 17, 2011"}, {"Title": "First Alert Carbon Monoxide sensor #00615", "Author": "E. James Fresia", "ReviewID": "RNL5ZL1JM3SZS", "Overall": "4.0", "Content": "Item was just as described. Easy to set up, test button worked, sensor is not bad  looking. Can't test reliabilty of its detection sensitivity, so this is always a question. First Alert has a good reputation so I have to rely on that, and hope that a problem never arises.I would buy again and would recommend it to others.", "Date": "December 7, 2007"}, {"Title": "Bad Warranty!!!!", "Author": "X.S. L", "ReviewID": "R3FCHSAONDEMZP", "Overall": "1.0", "Content": "I bought this alarm at Oct 2009 from Amazon. Only after two years, it broke. I call First Alert Warranty department. They told me that they will send me a new alarm but I need pay $6.5 shipping fee. Then came to most annoying apart, they DO NOT take credit card. I have to mail check to them. Only after receiving my check, they will send me the new one. And their warehouse is in different state with their office. That means that I will not have c/o monitor in my house for almost a month!!! That kind of poor warranty this it is.", "Date": "August 22, 2011"}, {"Title": "I can only assume it's working.", "Author": "L00king4nswers", "ReviewID": "R1DQCNTOH6VGEW", "Overall": "5.0", "Content": "I honestly have no evidence that this thing is working, but I do like the design and the digital controls on it. My favorite part is that I can just plug it into the electrical outlet and never have to change the batteries. It's out of sight and out of mind. I hope it's actually working.", "Date": "November 15, 2012"}, {"Title": "Early Days but good so far", "Author": "Bob", "ReviewID": "R3G4M2HZMXZAKU", "Overall": "5.0", "Content": "I have only opened this today and installed it (plugged it in) but it seems like a lot of well thought-out features, and is a well made product for the price, or for that matter for twice as much. Some I looked at in Lowe's and Home Depot were trash. The content of features in this particular model is unexpectedly good. The warranty is good, too. I have had to install these as a result of a mortgage refinance (I guess I could have just forgot about it as there was no inspection) but I now I wish I had done so long ago. The technology has progressed a long ways in the 3 to 4 years since Consumer Reports tested and reported on them. This unit also got good reviews from purchasers. Early Days but so far so good.", "Date": "November 15, 2012"}, {"Title": "Good Product", "Author": "D. Mackie \"D. Mackie\"", "ReviewID": "R2MN0P24X6VKI", "Overall": "5.0", "Content": "Product arrived in good packaging and included the 2 AA batteries needed for the back-up feature.  I plugged them in, ran the test and they are good to go.  I also took one out into the enclosed garage and it started beeping about 5 seconds after I started my car quickly for a test.Price was better of course at Amazon than I could find locally.  I will also be purchasing another few for a rental property where CO detectors are required by law (WI).I would recommend.", "Date": "October 26, 2012"}, {"Title": "First alert CO615 C/O detector", "Author": "novajoe", "ReviewID": "R1GMFPQQEZ7RRD", "Overall": "5.0", "Content": "It seemed like the most bang for your buck, it installed easy and I like the fact it is a plug in detector and has a battery back up. You can also check the highest CO reading by hitting one button a good feature. It has a 7 year warrantee I hope it will last that long!", "Date": "December 10, 2011"}, {"Title": "Good Product", "Author": "New Bird Watchers", "ReviewID": "R1OCQM16HRR6KH", "Overall": "4.0", "Content": "Bought this to replace a Nighthawk CO2 Detector.  First Alert has a good reputation, it uses AA batteries unlike the 9 volt in our previous model, ( batteries included with this purchase, which I liked) and it is not as big and bulky as our previous Detector.  Soft Green light illuminates it. VERY easy to set up/install.  I would certainly recommend.", "Date": "May 4, 2011"}, {"Title": "get two of these right now", "Author": "Michael Goulish", "ReviewID": "RHYVF9Z9LGNBI", "Overall": "5.0", "Content": "I just plugged in my first one a few hours ago, and I'm going to buy another one now.The cord allows you to place the unit up to several feet away from the outlet where you plug it into.  That's very cool.The alarm is plenty loud enough for me, and I like the other button you can press to see \"what's the max CO level since the last time I cleared this?\"( I assume there's a way to clear it...)!Look! -- here's a feature that is going to save you a night's sleep about  a year from now:Since live batteries are crucial, this unit *always* shows you the state of the batteries, with a little icon on the right side of the display.  If it is actually running on battery power, the icon just flashes every few seconds.  If it's plugged in, the icon is always visible.  And by looking at it, you can tell when the batteries are getting low.  This means, about a year from now, you can replace the batteries *before* it wakes you up at 3 in the morning, complaining about low batteries!Yeah, OK, the manual could be better -- like an actual little booklet instead of one of these stupid big-pieces-of-paper-folded-up things.  But it's clear and understandable, and if the print is too small for you, you need a new prescription.Listen -- you always hear stuff like \"get your furnace checked\" or \"open the flue all the way on your fireplace\" or whatever.  And you think \"well, my house won't have that kind of problem.\"  That is misleading and extremely dangerous.In the last ten years I have now twice heard about people -- people whom I  knew in both cases -- losing children to CO poisoning.  In both cases the CO was generated by smoldering fires inside the walls, caused by old or faulty electrical wiring.  In one case the house was *new*.  By the time the flames actually broke out and became visible -- and by the time the fire started generating enough smoke to set off regular *smoke* alarms -- the victims were already dead.The second of these incidents happened a few days ago.If you use electricity, you need one of these.  No, you need two of these, and you need them right now.", "Date": "February 5, 2011"}, {"Title": "peace of mind", "Author": "Jim R. Zeffield \"Deborah Zeffield\"", "ReviewID": "R1HR7M7MF3OOHV", "Overall": "5.0", "Content": "This unit gives me peace of mind. I don't have to wonder if I'm living on the edge of having a carbon monoxide problem. The display lets me know exactly where I stand. Its well worth the little extra cost.", "Date": "February 22, 2009"}, {"Title": "Junky", "Author": "OB1 \"OB1\"", "ReviewID": "ROGUWKW4DAJIB", "Overall": "2.0", "Content": "Poorly constructed. The test and last high reading buttons hardly ever work. I had 2 Kidde Nighthawks that detected a bad oven with a reading of 14ppm. One in the kitchen and one in the basement, Yet the First Alert read 000. Kidde has excellent warranty service and outstanding customer service.", "Date": "March 7, 2011"}, {"Title": "poor construction", "Author": "Irene \"Irene\"", "ReviewID": "R3NUEB9A1M708L", "Overall": "2.0", "Content": "The battery compartment opens from the front, which is convenient, but the lid did not close properly. Also the batteries had to be positioned just right to work, and it took a good several minutes of fiddling to get them adjusted. The battery backup is required; without the batteries, the unit chirps. (I returned the product and bought a different brand.)", "Date": "April 3, 2010"}, {"Title": "Definitly \"Made in China\"", "Author": "John Mark", "ReviewID": "RWZTM4JH7HG3P", "Overall": "4.0", "Content": "I looked a while on Amazon before I bought this one and got what I figured was the best bang for the buck.  Didn't seem to work exactly right when I was installing the battery and plugging it in, but seems to be OK now.  Always displays zero.  No way of telling if that's CO or number of pink elephants in the room.  I'll just have to trust that First Alert is right.  But I will stay alert for tightness across my forehead- a telltale symptom on a CO hit.", "Date": "February 5, 2014"}, {"Title": "Only one complaint", "Author": "John D Lape Jr", "ReviewID": "ROACFWMDUVYDZ", "Overall": "4.0", "Content": "This is one of those things you buy not to add decor to your home, but to SAVE your family in that wore case scenario. I hope that I'll never hear it go off but if I do, I'll be glad I got a heads up.This carbon monoxide detector has a nice feature where you can choose between mounting simply plugging it into your wall outlet, or mounting the unit a little higher on the wall above an outlet. Either way the power chord easily stows in the back so no cords are showing when it's plugged/mounted directly on an electrical outlet.The only reason that I can not give this product 5 stars is such. Behind the front cover of the display is where you put the batteries. After I placed the batteries into the unit, I went to close the cover and found that it will now not close. The latch that is on the my unit does not allow for enough clearance and in the mean time I have decided to use a small strip of clear tape (not blocking the sensor) to hold it shut.Overall I would still recommend this model to anyone, and I have even bought one for my parents.", "Date": "January 3, 2014"}, {"Title": "Good Device wished took up less space to plug in", "Author": "NickG03", "ReviewID": "R2TV3Y4TEG0IV9", "Overall": "4.0", "Content": "Needed to buy a carbon dioxide detector for my condo unit per HOA. Should be standard on all new construction, but that's another issue. I read reviews to select a model that seemed to be simple, best rated for money. Product was shipped on time and easy to install and test. I would have preferred the unit to be smaller so that I could use both plugs where I have Carbon Monitor device installed. Seems to be working Ok.", "Date": "December 20, 2013"}, {"Title": "Carbon Monoxide alarm with long plug-in cord and Battery backup", "Author": "prosandcons", "ReviewID": "R12CP29P0MROJS", "Overall": "5.0", "Content": "We purchased the First Alert CO615 Carbon Monoxide alarm to install in a bedroom. A nice feature of this alarm is the long plug-in cord that allows the alarm to be placed on a shelf or at least a few feet away from the outlet.Our old alarm that was located at the outlet tended to collect more dust because it is close to the floor and out-of-sight.This alarm has a backup battery which is beneficial if the electricity were to go out as it might happen in an emergency like an earthquake.Since our alarm sits on a shelf, it would have been better if it were designed with a flat bottom instead of a curved bottom.We also purchased the Kidde KN-COSM-B Battery-Operated Combination Carbon Monoxide and Smoke Alarm with Talking Alarm for another room. It also has positive ratings on Amazon. Our reasoning for having two different brands is that there is an additional data point should the alarm sound or in case one of the detectors is defective.PROS:- Long plug-in cable allows the detector to be placed away from the outlet- Battery backup in case the electricity goes outCONS:- Doesn't sit securely on the shelf due to the curved bottom (though it's not a deal breaker)", "Date": "December 14, 2013"}, {"Title": "Seems to be working fine but looks refurbished", "Author": "BD", "ReviewID": "R3PA0VU6WFJM55", "Overall": "3.0", "Content": "I just received the CO Alarm in a sealed package. However the unit itself looks refurbished - has light scuffs & a blue marker on the back.Tested ok, Alarm is loud - I'm just concerned about the life of the product if it is indeed a refurb. I would expect Amazon to make it clear that you're buying a refurb item.", "Date": "March 15, 2013"}, {"Title": "Possibly saved our lives", "Author": "C. Chappelle \"Music fan\"", "ReviewID": "R3E6KLCU138LYR", "Overall": "5.0", "Content": "Our shop was having boiler (furnace) issues...just wasn't running efficiently. It started worrying me and I thought I'd pick up a couple carbon monoxide detectors to be sure we were safe. My brother thought I was being silly. :) Anyway, plugged both in and within an hour I heard an alarm go off! We switched that one out with the other in the front room and the other went off shortly thereafter. I immediately called for service on our furnace and as soon as the serviceman walked in and hit the back production room, his alarm went off. The furnace was shut down (it was about 8 degrees outside) and space heaters kept us warm until the replacement boiler was installed. Granted the carbon monoxide was a very low level, but it had probably been poisoning the air for three-four weeks. My brother (who works in the backroom) was going home with headaches and extreme fatigue...I don't think he'll ever think I'm silly again. Thank you.", "Date": "February 14, 2013"}, {"Title": "Good product...", "Author": "Canuckcrew", "ReviewID": "R10PYE9K7L9WLZ", "Overall": "4.0", "Content": "Have just recently replaced our old CO detectors with three of these First Alert CO615. I must admit, didn't realize they had to be replaced every 5/7 yrs. Our old ones must have been at least 10 yrs. I love the LCD screens on these new ones. The old ones didn't have LCD screens. The features I like on these: 1) Battery backup, doesn't come into affect until there's a power outage, and the battery usage indicator on the LCD. 2) The memory recall of CO levels within the last 24 hrs. Installation was easy, and the initial test was simple. The price on Amazon was much better then what I could find in retail stores. All-in-all a great buy...", "Date": "November 6, 2012"}, {"Title": "CO detector", "Author": "chemist cook", "ReviewID": "R20EM3IN1VWMZM", "Overall": "5.0", "Content": "Item arrive in a timely manner. tested with test button to see if alarm works-it did. If the product does not work in detecting CO after this installation I will not be able to write a review that it did not work. Just a bit of humor by a former chemist.", "Date": "September 1, 2012"}, {"Title": "It Works - So Glad I Bought It", "Author": "Hoyamom \"hoyamom\"", "ReviewID": "R3B1E61DCZ5X39", "Overall": "5.0", "Content": "Bought this for my daughter three weeks ago when she moved into an apartment building that uses gas.  Today the alarm went off and the digital display indicated a level of 60 that went up to 80 within 30 minutes.  She called the gas company (please call 911 not the gas company if your alarm goes off) and because she had the numbers to report they were at her apartment building within minutes.  Their tests confirmed the alarm was right and the CO level was due to a faulty water heater. So glad I bought it the week she moved in and that I didn't procrastinate.", "Date": "August 30, 2012"}, {"Title": "Nice design for flexible use", "Author": "Comdet", "ReviewID": "R16MXRD7HB23R3", "Overall": "5.0", "Content": "I selected this CO2 detector model mainly on the basis of its top-ranking in Consumer Reports for sensitivity. But there are also some great design features that make it even more useful, particularly with where you can position it.You can plug it directly into the wall socket if you want to, but it also comes with an extendable power cord so you can position the unit a few feet away from the wall outlet. I put the unit on my night stand so that the detector is about the same distance off the ground as my head is when sleeping. That's the recommended height according to what I've read.Another handy feature is the battery backup, which keeps the unit operational in case of a power failure. Although some reviews comment on the battery door being fragile, mine worked just fine. It could be that First Alert redesigned it.Very simple to use and, according to CR, is tops in accuracy. Hopefully I'll never hear it sound the alarm, but glad that it's keeping tabs on the CO2 level in the house. Highly recommend.", "Date": "May 25, 2012"}, {"Title": "Does it work?", "Author": "T. Fricke", "ReviewID": "R1IQH3VZUDB1OA", "Overall": "2.0", "Content": "Despite the other reviews describing situations where this detector might have even been life-saving, I am not convinced that the detector I received actually worked.  I never saw my detector register anything other than zero, even during an incident in which we lit a wood fire in an indoor fireplace and forgot to open the flue.  The apartment quickly filled with smoke, and doubtlessly abundant carbon monoxide from the smoldering wood, and yet the detector steadfastly registered 0 and didn't make a peep.", "Date": "March 11, 2012"}, {"Title": "Well made product.", "Author": "MrRich724 \"So it goes\"", "ReviewID": "R2Q6CSGRGKZYJ7", "Overall": "5.0", "Content": "I don't understand the grip about the battery door. I think the product is designed very smart to make a compact, efficient unit.The battery door opened up with no problems, I placed the batteries inside, and it latched closed with equal ease.The unit looks really nice, and when I tested it, it's LOUD!I love that it plugs into the wall, so I don't have to depend on batteries as the primary source of reliable power, and the unit has a generous amount of electric cable, so you aren't too limited to where you can place it once it's plugged in.It COMES WITH TWO ENERGIZER BATTERIES!!!! Kudos for even including the batteries, but Energizer instead of some offbrand? Awesome!It looks nicer than any of the options at Home Depot.All I have to say is I would recommend.", "Date": "October 10, 2011"}, {"Title": "Plug and play protection", "Author": "Magic Jack", "ReviewID": "R3M3SUY7HBXJY2", "Overall": "5.0", "Content": "Install 2 AA batteries, plug it in, and you're done.It leaves one plug still open on a standard wall outlet, and you can test it with your TV remote.Haven't had trouble with false alarms except when the kids are playing with infrared remote controlled toys.", "Date": "July 19, 2010"}, {"Title": "Sleeping Easier in Idaho", "Author": "Prudence", "ReviewID": "RH6P4J7W1A5BH", "Overall": "5.0", "Content": "I have been meaning to buy a carbon monoxide monitor for a year, ever since a family of four I know was overcome by carbon monoxide poisoning.  Luckily, they survived.  When the same thing happened to a friend from my book group on Christmas Day (she spent several days in the ICU), I decided I could put the purchase off no longer.  I am single, and feel that if the same thing happened to me, it would be too late by the time someone found me.  Carbon monoxide kills several people in the US each year.  Even if you don't die, you can have life-long neurological problemsI have had the monitors for about two weeks.  I bought them (I bought two of the same monitor, one for my living room and one for my bedroom) based on their review in Consumer Reports.  I like the fact that they primarily use electricity with a battery back up.  They are easy to set up and use.  I feel safer having them in my home.  Everyone should have at least one in their home.  I have been telling everyone I know to buy them.", "Date": "January 31, 2010"}, {"Title": "False information", "Author": "jO-eLLEN l.", "ReviewID": "RJPSI9J7MOGKH", "Overall": "1.0", "Content": "Could have purchased many different alarms from local businesses at nearly half the cost, however, they were all made in China.  So I paid almost twice as much and waited an extra week for shipment because this First Alert alarm specifically said \"made in USA\" in the product description.Imagine my \"surprise\" when the package arrived and printed on the packaging \"Made in Mexico\"!!  There oughta be a law...oh, I think there is.", "Date": "January 28, 2014"}, {"Title": "Nice form factor. User interface fails.", "Author": "William Hees", "ReviewID": "R3AC880V02A4YM", "Overall": "3.0", "Content": "Pro: Nice compact form factor, with a neat twist: The plug normally is on the back of the unit so you can stick it directly into an outlet and the outlet holds up the unit. However you can also pop out the plug, unroll a small length of cord, and screw the unit directly to the wall within a short distance of the outlet (a couple feet IIRC).Con: The CO2 level is *not* continually displayed; you have to press a button for it to come on. The buttons are hard to push. The unit gives poor feedback that it is working properly -- when you do succeed in pressing the button (test or reset, I forget which), the unit goes through a cryptic startup sequence that frankly looks like it's malfunctioning. It was only by studying the instructions that I could confirm it was actually doing what it was supposed to be doing. This is bad -- you shouldn't need a manual to use a CO2 detector, especially when you spend extra to get one with a digital display.I haven't encountered a real CO2 situation yet so I can't comment about the unit's actual performance.", "Date": "April 17, 2011"}, {"Title": "never worked properly", "Author": "Derek Farren", "ReviewID": "R39XWCP50EA1QK", "Overall": "1.0", "Content": "After seeing so many good reviews about this product I feel I have to say that this is one of the few products I regret having bought at amazon. It never worked properly because its alarm started to sound randomly no matter the CO level. The first few times I got really worried and moved my family outdoors. Then I realized this alarm sounded even when I had left it in the backyard.I bought another one here (the second most popular option) and so far so good.Kidde KN-COPP-LPM Battery-Operated Carbon Monoxide Alarm with Digital Display", "Date": "June 30, 2013"}, {"Title": "Alarm didn't work", "Author": "Gary", "ReviewID": "R2RFNAQCTSWCPI", "Overall": "1.0", "Content": "I had to return this product because the alarm didn't work. I held down the test/silence button, but no sound was made.", "Date": "November 29, 2012"}, {"Title": "Works as advertised.", "Author": "Robert G", "ReviewID": "R3EX2OVMO8W1SQ", "Overall": "3.0", "Content": "Replaced a similar Carbon  Monoxide Alarm that stopped functioning after 7 years from the date of manufacture.  I wish there was some way to penalize companies that schedule their products for obsolescence.", "Date": "April 25, 2014"}, {"Title": "Good for travel", "Author": "M. Cleckner", "ReviewID": "RIR819222534D", "Overall": "4.0", "Content": "After seeing a number of articles concerning carbon monoxide incidents at hotels, we bought these CO/smoke detectors for peace-of-mind.  Quite satisfied.", "Date": "April 14, 2014"}, {"Title": "great product", "Author": "Ada", "ReviewID": "R2W1U1Y74F6BKE", "Overall": "4.0", "Content": "Item was delivered quickly in easy to open packaging. It is low profile so it doesn't get in the way of furniture or walkways. Easy install and several options for placement thanks to the long electrical cord.", "Date": "March 27, 2014"}, {"Title": "co615 carbon monoxide detecter", "Author": "randy rennison", "ReviewID": "R1QCLWI7C62BJW", "Overall": "4.0", "Content": "checked reviews and it was near the top. battery door is a little cheaply done. can't say how good it works as it has not be needed.checked other brands, this one rated better.", "Date": "March 26, 2014"}, {"Title": "First Time", "Author": "(actually my spouse wrote review)", "ReviewID": "RQR4Z1ETTOLQI", "Overall": "4.0", "Content": "First time to use one of these even after learning in the Navy 50 yrs ago that something like this was needed in certain places.  It tested great....now hope it is never needed.", "Date": "March 16, 2014"}, {"Title": "I only give it a four because....", "Author": "bzay9020", "ReviewID": "R12VRLO7H2WPK9", "Overall": "4.0", "Content": "I only give this product a four because there are more sophisticated units available, it's a good product for the price.", "Date": "March 1, 2014"}, {"Title": "As advertised", "Author": "Helpful7", "ReviewID": "R17NQMWOBJL0YS", "Overall": "4.0", "Content": "Works well and is as advertised.  I do have difficulty seeing and reading he display when it is plugged into the wall outlet.  The NightHawk display is much easier to read, but no real complaints.", "Date": "February 28, 2014"}, {"Title": "One of many detectors in the home", "Author": "Odry", "ReviewID": "R1YEU2KM1SB4Y1", "Overall": "4.0", "Content": "Exactly as expected. Works in tandem with a Combustible gas detector and both fit well in the outlet, since it has different ways to install, i was able to install to my liking. Alarm is loud. Happy with the purchase.", "Date": "February 27, 2014"}, {"Title": "We now have 3 CO detectors", "Author": "Scott Richmond \"Glikbach\"", "ReviewID": "RTEETVT9AWPUH", "Overall": "5.0", "Content": "We had our only alarm go off two weeks ago. It told us we had 63 ppm CO. I called the fire department and they came as did our utility company.Turns out it was ice blocking the ventilation on our roof after this ridiculous winter. We opened windows and doors to clear the CO out.I spoke at length with the utility guys and the fire fighter and they all said to put CO detectors in all bedrooms and in all hallways. After this little scare we now have 3 detectors placed where the firefighters recommended.Spend the money! Get CO detectors installed, it might save your loved one lives.I like the plug in units with battery back up. We have this unit in our bedroom and a Kidde unit in our sons bedroom and in the hallway. I like this unit in our bedroom because of the very low light level given off, I like a pitch black bedroom with no lights.I recommend this unit.", "Date": "February 25, 2014"}, {"Title": "Nice design, multiple mounting options", "Author": "J. Schmotzer \"Dr. J\"", "ReviewID": "R3JY0MY4XSCF0N", "Overall": "4.0", "Content": "I like the separate transformer and cord which can be kept inside the detector for mounting over an electrical outlet --or-- pulled out so the detector can be mounted away from the outlet.", "Date": "February 21, 2014"}, {"Title": "good, but kinda annoying.", "Author": "dolfin29", "ReviewID": "RC67UQYTIV8X6", "Overall": "4.0", "Content": "so, i know the unit works.  i had a gas company guy come in a show me his meter and check it against mine.  i had the alarm going off at my office and i called in the fire and gas company.so confirmed my meter was reading 10ppm lower, 31 on mine and 41 on the professional meter.annoying part.  when the alarm goes off, you can turn it off or reset.  it is hard to tell what the sampling time is, but it beeps for ever to me.i wish the unit has a check the level now button.  but the peak like others have said resets every 24 hours.  again that sucks too. but... granted this is a simple machine.  beep on alert.  it did work for me.  i will post a picture of both the unit against the gas company meter.", "Date": "February 3, 2014"}, {"Title": "Could be better", "Author": "Alz", "ReviewID": "R245ROXK77UTJO", "Overall": "4.0", "Content": "The alarm satisfies the new requirement for CO detectors in my home. It is a little difficult to push the button to get a historical reading. I found pushing it gently and holding it seems to work. Pressing too hard may break it.", "Date": "January 29, 2014"}, {"Title": "Reliable, has excellent lifespan", "Author": "M. Hoffman \"melawman\"", "ReviewID": "R35166L3IB3898", "Overall": "4.0", "Content": "Bought the last version, since redesigned with a different chipboard which is not only enhanced for sensitivity but also has extended longevity. The version I purchased had a 5 year warranty, now extended with new design to 7 years, and it was VERY reliable for 6 and a half years. According to manufacturer its lifetime was within the range for design. The plugin feature is very convenient and batteries never had to be replaced. Nice product with US customer service easy to contact by telephone. They make cheaper battery operated versions, but based on my experience the battery cost savings, reliability and longevity justify the price.", "Date": "January 28, 2014"}, {"Title": "Top rated CO Alarm that delivers", "Author": "Bob K.", "ReviewID": "R2RMHUZ4SFQ7SP", "Overall": "5.0", "Content": "I was lead to this model because of a high rating by a top consumer product testing magazine and it has been great so far (only used it a few days so far)Product is well designed and easy to set up even before you read the instructions.  I like the digital readout so you can tell how strong the CO threat really is.  Most of the similar priced alarms have no readout.  It was a good price for a product that has a lot of features.", "Date": "January 12, 2014"}, {"Title": "Seems to work fine, but it resets the peak CO level every 24 hours.", "Author": "Stickman", "ReviewID": "R1V6ZFPW6PH6VW", "Overall": "4.0", "Content": "Surely there must be a reason it clears the memory every 24 hours, but I can't think of what it would be. Otherwise this is a nice CO (Carbon Monoxide) detector. Alarm is very loud. Plugs in easily and extends up to 6' away if that works better for you. (It has a built in extension cord.) Locating it lower in the room is better, CO is heavier than \"air.\"", "Date": "January 6, 2014"}, {"Title": "Easy to use.", "Author": "coloradoscott", "ReviewID": "R30MR4PE5QTPV8", "Overall": "4.0", "Content": "Delivered as requested, easy to set up and does its thing....hope we never need it.  Instructions are LONG and covers mfg butt but do nothing for the product.", "Date": "December 10, 2013"}, {"Title": "Safety First", "Author": "AWGamer11", "ReviewID": "R195RPA4TKLR1L", "Overall": "5.0", "Content": "- First Alert brand name- Easy to read display, and like the plug in with battery backup design.- To me this is a MUST have. I have multiple First Alert detectors and feel that you can't be too safe when it comes to this issue. I had a problem with my boiler and had an (older different model) first alert detector in the basement that alerted me within seconds of turning the boiler on. I was convinced enough to order a few of these, and place them around the house.- Price was right, Amazon delivered quickly.", "Date": "November 11, 2013"}, {"Title": "Very nice unit", "Author": "ROBERT J KNAUER", "ReviewID": "RHZ7VDL1XI9IV", "Overall": "5.0", "Content": "this was very easy to Activate and install for use.  Recommend this product to everyone looking for this type of product.  this a five star item in my book.", "Date": "August 18, 2013"}, {"Title": "Safety First", "Author": "Sandi Shearer", "ReviewID": "R2E3DH3TFI3CLL", "Overall": "5.0", "Content": "Have been advised to use the plug-in type rather than battery only. Seems safe, good price. Not an exciting gift but a great house gift nonetheless.", "Date": "August 15, 2013"}, {"Title": "Lasted less than Two Months", "Author": "SK In CS", "ReviewID": "R1QWCX0WYC7H50", "Overall": "3.0", "Content": "Installed this CO alarm in July. It displayed an error message in August. I would not order this brand again.8/22/13 Replaced under warranty. Good customer service. Hope this one lasts longer.", "Date": "August 12, 2013"}, {"Title": "CO monitor", "Author": "alan frank", "ReviewID": "R17XLBFNBK685Y", "Overall": "5.0", "Content": "I read the reviews on Consumer Reports and bought this one on their recommendation.  Seems to be working fine. The cost for these monitors is a bit higher than the others but we would rather be safe than not have one.  Price @ Amazon beat everyone else and with Prime, shipping is always upgraded and free.Will buy another one for the downstairs unvented fire place when wintertime rolls in.", "Date": "July 21, 2013"}, {"Title": "Great", "Author": "Kc", "ReviewID": "RKP9DUQ5GBUVU", "Overall": "5.0", "Content": "Awesome product. Is compact and plugs in inconspicuously. The back battery percentage is displayed on the screen and it does not needlessly go off.", "Date": "July 1, 2013"}, {"Title": "Easy and affordable way to add CO protection", "Author": "M. Everton \"yakmaster\"", "ReviewID": "R1IRD1SU0MU6HN", "Overall": "5.0", "Content": "We have had this CO alarm for over a year and test it regularly.  It appears to be doing its job.  We like the flexibility of plugging it into a wall socket and can take it with us when we travel.", "Date": "June 5, 2013"}, {"Title": "Not as goood as the others", "Author": "dave", "ReviewID": "RVV75R3JOS0QC", "Overall": "3.0", "Content": "It doesn't seem to register the same as another Carbon monoxide alarm I have.  The readings seem low.  And you have to keep resetting it to find out recent peak readings and what it is doing currently.", "Date": "April 13, 2013"}, {"Title": "I'm not even sure it's workng", "Author": "JeffG.", "ReviewID": "R1YI24FR9AA8E3", "Overall": "2.0", "Content": "It does NOT constantly display the CO level in the room as the article states.  The only thing that makes me think it's even working is the power light, which is not very bright.  I gave this a rating of 2 stars because the main reason I bought this model was because the article says that it displays the CO level all of the time.  It doesn't so what use is it?  Will it work in an emergency?  I don't really know.", "Date": "February 13, 2013"}, {"Title": "Saved our lives.", "Author": "houston08", "ReviewID": "R1JHH7LQUUESJG", "Overall": "5.0", "Content": "I had recently moved into a house that i had purchased and our old Carbon Monoxide detetector kept going off at night but because it wasnt digital i didnt know if it was just a bad battery so we slept with all the windows cracked in the bedrooms so i bought this first alert digital and again the 1st night i had it plugged it in, it went off and gave a reading over 100 i was scared so i called a technician and sure enough the heater had a hole in the heat exchange and the technician said we were lucky we got it fixed before someone died.", "Date": "February 4, 2013"}, {"Title": "First Alert CO615 Carbon Monoxide Alarm", "Author": "Harold G. Turner", "ReviewID": "R1UXEZ9E9K8Z61", "Overall": "4.0", "Content": "We have always used Kidde alarms, but I read reviews on carbon monoxide alarms and this one the First Alert CO615 was top rated.  So, we purchased it to replace our Kidde alarm.  I like it better than the Kidde because of its size and looks.  In testing it, I  am certain it would wake even a deaf and sound sleeper like me.  Very pleased with it so far.  Would recommend this Amazon.com purchase to everybody.", "Date": "January 18, 2013"}, {"Title": "First Alert CO615 Carbon Monoxide Plug-In Alarm with Battery Backup", "Author": "clp", "ReviewID": "R2ZRNYPLLPW867", "Overall": "4.0", "Content": "I had to read the instructions to find out that you can't just press the TEST/SILENCE or CO READING button, you had to press and HOLD the button to receive the desired action. Once I learned this simple trick the device works very well. I've only had it installed for about a week but so far I'm happy.You have to just trust that the standard CO/SMOKE detector installed in your home is working correctly. You can never truly determine whether an alarm is \"real\" or a \"faulty\" detector. I had a faulty detector in the basement furnace room and it took two days to prove that the alarm I occasionally received was a false alarm. In the mean time the wife and dogs were running around \"wild eyed\" at intermittent times. I have since replaced the faulty detector and all is quiet and calm again.I recommend this detector to anyone in need of an alarm or just testing their existing alarms.", "Date": "January 5, 2013"}, {"Title": "Defective", "Author": "JO", "ReviewID": "R1ZK76KI886X1B", "Overall": "2.0", "Content": "It looks nice and maybe it works but i bought 2 of them and after installing the batteries the compartment door would not close and kept popping open.  others may just tape it shut however if I purchase a brand new item, i should not have to jerry-rig it for it to work properly,  I returned them.", "Date": "December 7, 2012"}, {"Title": "Carbon monoxide detector", "Author": "Debbie", "ReviewID": "R3CMYPMH13MV27", "Overall": "5.0", "Content": "Doing wellness at work and carbon monoxide level was high.  Not a smoker and not exposed to 2nd hand smoke regularly.  Was curious about furnace & gas stove.  Bought detector to check this out.  Have 2 small boys also.  Have detector plugged in & everything checked out good!  Now have a piece of mind on a daily basis.", "Date": "September 25, 2012"}, {"Title": "Can this be your life saver?", "Author": "SC buyer 2011", "ReviewID": "RJTBMMVX6DR8E", "Overall": "5.0", "Content": "This is my second purchase of this product, the first having reached the end of it's lifespan.  But before that happened, the first one woke us up in the middle of the night when the furnace exhaust pipe unexpectedly collapsed, and undoubtedly saved our lives. Just follow the simple in-package installation directions, and let this little wonder be your guardian angel. We sleep better knowing it is on the job.", "Date": "September 8, 2012"}, {"Title": "Great product", "Author": "Kris Fleury", "ReviewID": "R3HS5Q97N9AIRY", "Overall": "4.0", "Content": "I like the display and we haven't had a detection yet, and hopefully won't!  I used a tester to see if it would work if an emergency and it detected the gas, so I know mine does work.", "Date": "August 8, 2012"}, {"Title": "Had one, which saved our lives....", "Author": "Mommy Goblin", "ReviewID": "R2R1X3KCXL031", "Overall": "5.0", "Content": "We had an incident with propane, and our CO2 detector saved our lives.  So I purchased this one as a backup.  I cannot emphasize how important it is to have one of these in your house.  This one is the same brand as our other, but has the digital reading.  Never place one in the kitchen if you have gas appliances and also, grease and steam can give false readings.  I recommend 1 for every 1000 sq feet of house.", "Date": "May 1, 2012"}, {"Title": "Best CO detector for the money", "Author": "LARRY REED", "ReviewID": "R2Z1SJM6ZV8OQN", "Overall": "5.0", "Content": "Great reviews from buyers and Consumer Reports. Bought one for each of the three levels of my home. Fool proof installation. Uses low cost AA batteries (included in purchase). Like everyone, I hope I never have to experience an urgent need for these CO detectors, but I now have the peace of mind that my family is protected.", "Date": "April 21, 2012"}, {"Title": "Peace of mind in a box", "Author": "Heather D", "ReviewID": "R2SFB8T8B3O01J", "Overall": "5.0", "Content": "Recently there have been several reports of people dying of carbon monoxide poisoning, so I was becoming more uncomfortable with just a couple cheap detector.  I heard this was highly rated.  I came to amazon and found it very reasonably priced.  Received the package very quickly, within a week from time ordered.  It was packaged very well.I feel much more comfortable with these detectors in our home.  I can push the peak level button to see if any amount of CO has been detected in the last 24 hours.  So far mine has always shown 0 ppm.  However, I have a family member that also bought a few of these, upon my recommendation.  Their detector showed 52 ppm the other day.  So they vented the house and are looking for the source.I have more much peace of mind knowing that it will show me what level is detected.  The battery backup also gives more peace of mind.", "Date": "March 14, 2012"}, {"Title": "First Alert CO615 CarbonMonoxide Alarm", "Author": "mrbarker", "ReviewID": "R17QMX1ZG3G7N8", "Overall": "4.0", "Content": "Product arrived quickly and was easy to setup. Like the battery backup and digital display of carbon monoxide level so you can see if levels are changing.", "Date": "February 16, 2012"}, {"Title": "First Alert.", "Author": "kanipape", "ReviewID": "R10KCO89ICRHVW", "Overall": "5.0", "Content": "Hi:  I bought this product because of the situation we encountered. We have THIS OLD HOUSE and we have been working on it for 6 years. I can tell you that I bought this First alert carbon monoxide along with the First Alert Explosive Gas alarm. Why well, we've been threw a lot with this old house, from natural gas leaks to old fire places.  This product work great.Sincerely,Paul", "Date": "January 30, 2012"}, {"Title": "Probably the best on the market.", "Author": "Wacky Wiccan", "ReviewID": "R996B45IFPRY6", "Overall": "5.0", "Content": "I searched long and hard for a good CO detector.  All the reviews I read pointed towards this First Alert Co615 detector.  It uses two AA batteries for backup, not the 9 volt battery like others do.  This saves you money at replacement time.I've had one detector for three years and am very happy with it.  This one I ordered to replace another brand that reached the end of it's life.Well worth the money.  Cheaper here than anyplace else.", "Date": "January 13, 2012"}, {"Title": "my batteries boiled over 5 minutes after I 1st plugged it in", "Author": "John M.", "ReviewID": "R3K20VJ82I562K", "Overall": "2.0", "Content": "Hopefully mine was a rare lemon but the batteries boiled over right after I plugged it in. I double checked to make sure that they were installed properly so that was not the problem. Amazon took back the unit and refunded my money but I did not buy a replacement. Most of the reviews seem positive so I hope this was a rare occurrence but I'm not taking the chance again. I'll go with a different unit.", "Date": "January 9, 2012"}, {"Title": "Time Will Tell if a Good Value", "Author": "Occasional Buyer", "ReviewID": "R1D9P65L4L51PS", "Overall": "4.0", "Content": "Purchased three (3) of the First Alert CO615 Carbon Monoxide units.  Units were packaged well and were delivered promptly.All units were delivered with all items described, including the batteries.Assembly and installation was straightforward, per the instructions.While the \"test\" button does permit one to determine if the alarm sounds, it does not \"test\" if the unit is capable of correctly detecting carbon monoxide.  Also, there is no apparent method to calibrate the unit.", "Date": "December 6, 2011"}, {"Title": "Easy setup (and great gift!)", "Author": "cramp10", "ReviewID": "R2KC79UA660P7N", "Overall": "5.0", "Content": "Easy setup -- don't have to drill any holes in the wall or get up on a ladder to install it.  This makes it a great gift for the grandparents or anyone older, especially if they live in a state (like CA) that requires CO detectors.  All they have to do is plug it in and put in on a shelf.Cannot vouch for its ability to detect CO, other than it doesn't give false positives (don't use fireplace or gas appliances, have detached garage).", "Date": "December 5, 2011"}, {"Title": "Does what it is supposed to", "Author": "NancyN", "ReviewID": "RY4YSVA8MTSVY", "Overall": "4.0", "Content": "We're expecting a new baby so we decided to change out all our existing CO detectors.  These were delivered quickly, were easy to install and seem to be doing the job.  Unlike some others, we did not have trouble putting the batteries in and replacing the battery cover.", "Date": "December 1, 2011"}, {"Title": "Get a Digital Read CO detector", "Author": "Melissa", "ReviewID": "R1SNJW6QIQUK0H", "Overall": "4.0", "Content": "This is a solid CO detector.  The only thing I didn't like is that it is ac powered (with battery backup).  The ideal installation location is in a hallway outside the sleeping areas per the NFPA.  However, I have no ac outlets in my hallway!  Therefore, I put it inside just one of the bedrooms.  A digital readout is a must since the alarms will sound with about 70 ppm and 60 minutes exposure.  I want to know my CO ppm level even if it doesn't trigger the alarm (mine was 0 ppm).  Other nice features are a peak CO ppm reading in a 24 hr period and unobtrusive dim green readout which turns bright blue for reading.  Unit is set to End of Life itself after 7 years.", "Date": "July 31, 2011"}, {"Title": "Optional Extension to Plug is Best Feature", "Author": "Tiger", "ReviewID": "R1FNZLA9W26VUY", "Overall": "4.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo1UOUK51YTF42OembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo1UOUK51YTF42Orefresh_preplay() {\n\ndocument.getElementById(\"cv_mo1UOUK51YTF42OchiDiv\").innerHTML = document.getElementById(\"cv_mo1UOUK51YTF42OhiddenPre\").innerHTML;\n};\ncv_mo1UOUK51YTF42Orefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo1UOUK51YTF42Oso;\t   \n\n\nfunction cv_mo1UOUK51YTF42OloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo1UOUK51YTF42Oso = new SWFObject(swfLocation, \"cv_mo1UOUK51YTF42OAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo1UOUK51YTF42Oso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo1UOUK51YTF42Oso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo1UOUK51YTF42Oso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo1UOUK51YTF42Oso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo1UOUK51YTF42Oso.setAttribute(\"height\", swfHeight);\n          cv_mo1UOUK51YTF42Oso.setAttribute(\"width\", swfWidth);\n          cv_mo1UOUK51YTF42Oso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo1UOUK51YTF42Oso.write(\"cv_mo1UOUK51YTF42Oflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo1UOUK51YTF42O', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo1UOUK51YTF42O';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo1UOUK51YTF42O', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo1UOUK51YTF42OloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo1UOUK51YTF42O\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m1PO90G5EUMO4L\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m1PO90G5EUMO4L\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1FNZLA9W26VUY\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m1PO90G5EUMO4L/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo1UOUK51YTF42Oduration')) {\n      document.getElementById('cv_mo1UOUK51YTF42Oduration').style.display='none';\n    }\n    cv_mo1UOUK51YTF42OloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo1UOUK51YTF42OloadSwf(movieID, playerVersion) {\n   return _cv_mo1UOUK51YTF42OloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo1UOUK51YTF42OnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo1UOUK51YTF42O', 0, h);\n}\n\nfunction cv_mo1UOUK51YTF42OresetPlayer(w,h,bw,cc) {\n  cv_mo1UOUK51YTF42OnewHeight(h);\n\n  cv_mo1UOUK51YTF42Oso.addVariable(\"resetBandwidth\", bw);\n  cv_mo1UOUK51YTF42Oso.addVariable(\"cacheCode\", cc);\n  cv_mo1UOUK51YTF42Oso.setAttribute(\"height\", h);\n  cv_mo1UOUK51YTF42Oso.setAttribute(\"width\", w);\n  cv_mo1UOUK51YTF42Oso.write(\"cv_mo1UOUK51YTF42Oflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo1UOUK51YTF42ORollOverImg = new Image();\ncv_mo1UOUK51YTF42ORollOverImg.src = \"http://ecx.images-amazon.com/images/I/71sLwlNr8-S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo1UOUK51YTF42Opreplay = document.getElementById('cv_mo1UOUK51YTF42OpreplayImageId');\nif (cv_mo1UOUK51YTF42Opreplay) {\n  cv_mo1UOUK51YTF42Opreplay.onmouseover = function() {\n    cv_mo1UOUK51YTF42Opreplay.src = \"http://ecx.images-amazon.com/images/I/71sLwlNr8-S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo1UOUK51YTF42Opreplay.onmouseout = function() {\n    cv_mo1UOUK51YTF42Opreplay.src = \"http://ecx.images-amazon.com/images/I/71sLwlNr8-S._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo1UOUK51YTF42Opreplay.parentNode;\n\n  var cv_mo1UOUK51YTF42OcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo1UOUK51YTF42OcurrentClick) {\n      return cv_mo1UOUK51YTF42OcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 8:16 MinsThe best feature is the plug in design that lets you either plug directly into an outlet, or locate the unit further from the outlet with the extension & separate plug.  The plug and extension wire is built into the back, but can be pulled out.  The unit is a little bulky and I didn't want it seen in my living room or bedroom prominently in my wall outlets.  So I rather run the plug to a hidden outlet and put it in a dresser or end table out of the way.  However, it sits okay on a table, but I wish it came with a stand to help.  It seems to expect you to mount it on a wall or outlet.  But it looks just fine on a table to the side.The manual has some useful unexpected information that is worth a read through.  It talks to location considerations like not too near your kitchen, and not too near ceiling or corners due to dead space that might not get circulation of CO, or too near ceiling fans or vents in which CO might not reach the sensor, etc.  It was worth a read compared to the usual boredom of manuals.The construction seems fine to me.  I didn't notice any trouble with the battery door.  Just open it from the top, evenly, and focus on where the latch is near the middle of the door that you will see plainly as you open it and look in.  The batteries fit *very* tightly in one of the two units I bought so will be a little more difficult to remove, but still okay.  But don't consider this a batter operated unit.  It only uses batteries as backup.  The button to get the CO peak level over the last 24 hours doesn't seem very responsive, but always works after a few tries.  It always shows 0 for me, but I don't think I should expect more if everything is fine.", "Date": "July 24, 2011"}, {"Title": "Amazon was great to work with", "Author": "Robert Fukai \"dvd lover\"", "ReviewID": "R3PTO1QAJD3ZL8", "Overall": "4.0", "Content": "This was well-rated by a consumers oraganization and we got them for our home.  One was defective and Amazon quickly replaced it.  They sent me a new one faster than I could mail the defective one back to them (no cost to me).  Thanks Amazon.  You deserve 5 stars.", "Date": "June 2, 2011"}, {"Title": "Working as advertised", "Author": "D. White", "ReviewID": "R1V0ILVV24ZCNO", "Overall": "5.0", "Content": "We bought this unit in response to the new Oregon law requiring at least one CO detector.  It arrived from Amazon quickly but with environmentally unfriendly packaging.  But the unit itself works as it is supposed to.  The documentation was easy to understand. The backup battery was easy to install.  The test button is well located on the front panel and the display is easy to read. We have not had any events to cause an alarm but more importantly, there have been no false alarms.  It just works.  So far so good.", "Date": "May 12, 2011"}, {"Title": "Just fine", "Author": "donnyboy", "ReviewID": "R22THK6QCJ59SW", "Overall": "4.0", "Content": "Insertion of batteries was easy and I did not find the door flimsy. It fits in the bottom of an outlet so you have use of the top one. Only negative is,thickness about 2 inches, so it is easily noticed in the outlet.", "Date": "May 7, 2011"}, {"Title": "carbon monoxide alarm", "Author": "Malcolm L. Mac Leod", "ReviewID": "R1SQJV79OTDSS2", "Overall": "5.0", "Content": "The First Alert CO615 is simply plugged into a bedroom outlet after putting in the two AA penlight batteries. It seems to be betterquality than some of the other makes. If you don't have one and you use gas heat, you're taking a risk.", "Date": "April 25, 2011"}, {"Title": "Solid choice for CO protection", "Author": "Eric Ewanco \"Catholic apologist\"", "ReviewID": "R1FBFRASI6J7B5", "Overall": "4.0", "Content": "The online description suggested this was an excellent choice for a CO detector and when I bought it, I wasn't disappointed.  It runs on AC power with battery backup, and has a digital readout.  It can be mounted directly in an outlet, or the plug can be detached so the now-corded unit can be mounted away from the outlet.  I have two complaints.  One, the digital readout can only be read at close range, but I could have guessed this from the photos.  Two, the placement requirements -- which are probably not unique among CO detector products -- are onerous.  Trying to balance minimum distance from potential CO source, proximity to air currents, AC location, and audibility is a mess.  You might be better off with a battery-operated unit.  Or just ignore the requirements as lawyer-induced.", "Date": "February 17, 2011"}, {"Title": "Very compact, well made, simple", "Author": "Brett A. Fishwild \"cz75auto\"", "ReviewID": "R2ZY6VWMG3G8D0", "Overall": "5.0", "Content": "I researched CO detectors pretty thoroughly before buying, as I needed three of them and it was going to run me around $80-$100 according to my first look. After reading through all the Amazon reviews and Consumer Reports, I settled on this one and I am glad I did. I have never owned any other CO detectors, let me say up front, but this model is great for most homes in my opinion. It's compact, just a tad larger than a 12-oz. can of soda. An older nonfunctional one that came with my house was twice that size. The little LED light tells you it's operating but is not garish, way less than a nightlight. And the manufacturer apparently listened to all the previous complaints about the battery compartment because I had no problem at all installing them and I believe the instructions even had a note about that. It does have a lifetime, it stops working at 5 years. But in response to those reviewers who derided this fact - consumer/home safety websites clearly show that that you should replace CO detectors every 5 years. So I think this product item is actually a very good thing.", "Date": "January 29, 2011"}, {"Title": "Just what I expected", "Author": "Buddy L", "ReviewID": "R161ZJZXFTKEPP", "Overall": "5.0", "Content": "This is just what I wanted are old one finally died right when we received this I just started having furnace problems and didn't realize it 2 days after I received this co detector it went off luckily we was home our birds would have died I would highly recommend this co detector it is well worth the money", "Date": "January 15, 2011"}, {"Title": "Simple and easy", "Author": "A. Frederick", "ReviewID": "RR8FD3WUCM64D", "Overall": "5.0", "Content": "Simple and easy. Plug it in, push the test button to make sure it is working, and walk away feeling a little safer.  I have had other models in the past that mounted on the wall, but I like the plug in feature much better.", "Date": "January 12, 2011"}, {"Title": "Works great", "Author": "solmadness", "ReviewID": "R1ALJ03Y8OMOJU", "Overall": "4.0", "Content": "Bought these to replace a Kidde that malfunctioned a couple of months after I bought it. So far these are superior to the old one and the display is good and easy to understand.", "Date": "January 10, 2011"}, {"Title": "Just what I was looking for", "Author": "dabluzfan", "ReviewID": "R191K9C7JCQ9I2", "Overall": "4.0", "Content": "This product came as advertised.  I read several of the reviews on this device and did not have the same trouble as other customers in regards to the battery door.  I was able to open the battery door and install the batteries without a hassle.  One of the main reasons, that I gave it 4 starts instead of 5 is because knock on wood, I technically have not had to use it, in the sense that I have not had a reading for carbon monoxide which is a good thing.  I didn't want to give it 5 stars without knowing it will truly work.  I did like the 5 year alarm it had, to tell you when it was no longer functional.  I also wrote on the device with the date I started to use it as well.  The only other complaint I would give the device would be displaying the current reading on the device.  I don't mind that it does not display automatically, but I don't like how I have to hold the button for several seconds before it displays.  I almost feel like I am resetting the device.Overall I am happy with the device for the price point and going off the other reviews I have read on the device.  Hopefully I will never need to determine if it works as design.", "Date": "November 23, 2010"}, {"Title": "Top rated easy to use product", "Author": "Raising the Bar", "ReviewID": "R2TUAV9NY61OYO", "Overall": "5.0", "Content": "Pro:Its a CR Best Buy.You can plug it into a power outlet without worrying about pre-wiring.It has a battery back-up in case of power out.Con:The display on the unit is not the best but then it has an audible alarm.Since most of the power outlets in homes are at the bottom of the room. Using it with the power outlet means the unit is always at the bottom of a wall.Overall I have had no issues with the unit and I will recommend it for anyone to buy.", "Date": "June 8, 2010"}, {"Title": "GOOD SO FAR!  GREAT PRICE!!", "Author": "HAND OF DOOM", "ReviewID": "R38TQ9V4P47NO7", "Overall": "4.0", "Content": "This is a very simple unit and the alarm/peak CO level tests are working so far.  I'd like the alarm to be a little louder but is probably adequate for most people unless you're a real deep sleeper.  I'm very satisfied especially with the great price on Amazon!!", "Date": "March 5, 2010"}, {"Title": "First Alert CO615 Carbon Monoxide Detector", "Author": "Richard J. Simons", "ReviewID": "R85RQYU3BPG5E", "Overall": "5.0", "Content": "Purchased three of these so I now have one on each floor of our home. We had one on the second floor, where the bedrooms are located, and it was over 10 years old and I just learned they are to be replaced every 5 years. I put a label on each of the new ones indicating the date on which to replace them. I used them by just plugging them,. They come with an extension cord but had no need for it. I guess they are working, I haven't had them sound or register any reading of carbon monoxide. I did use the test button and they sounded, so they say they are working properly. Purchased one more unit to take to our trailer at the vacation park, so we are protected where ever we are staying. The State of Wisconsin just enacted a law requiring these on each floor of a residence, but interestingly there is no penalty for failing to install them. Maybe some people will get them because of the law and it will save someones life. The penalty is if you don't have them and there is a problem you could pay for it with your life.", "Date": "March 4, 2010"}, {"Title": "Random beeps...", "Author": "Bob Smith", "ReviewID": "R22NWMZPDY5BA", "Overall": "1.0", "Content": "We bought two of these. One appears to be fine. The second one beeps randomly for no reason. There are three short beeps that are about as loud as a battery warning beep (not too loud, but enough to be very annoying). It beeps randomly. It might beep two or three times in one day, and than not beep again for a week. CO readings are always zero. Replacing the new battery doesn't help.", "Date": "February 27, 2014"}, {"Title": "Bad display, bad buttons, good detection?", "Author": "Fancypants O'Houlihan", "ReviewID": "RIFDIM3S4B9ZK", "Overall": "4.0", "Content": "**UPDATE** Increasing to 4 stars from 2.  This thing really works!Since the reading always went down to 0 when I pressed the \"stop making noise\" button, shut the furnace off, and opened my bedroom door, I wasn't sure whether it was detecting a real, low-level issue, or just breaking. So to test that, I bought a second CO615 from my local Target (at about twice the price) to see if it would go off too.  And it does.So the alerts were legitimate, and this alarm kept me from harm, which is the whole point!Deducting one star for the display being garbled, the buttons being hard to use, and for it just seeming so broken that I didn't believe it and first & ended up spending 3x the money to figure it out, but the most important thing for this alarm to do is detect dangerous levels of CO, and it did it!******I'm not sure what to think about this.  Consumer Reports gave it a good rating, esp. for low levels of CO.  But the display on mine is now so garbled so that I can't read the numbers, and the buttons are faulty, so I can't get a peak level reading.  I only bought it 4 months ago.I've been using my furnace for about a month with no alarms sounding, but now it consistently goes off 2 hours after I turn my furnace on (aka 2 hours into me being asleep, bummer).  Then the level drops to 0 the moment I open my bedroom door, which seems fishy.I wanted to check what the peak level was following a day at work with the furnace off.  First day I tried it, the level was 35 ppm, higher than I had even seen it at night (~17 ppm). Second day I tried to check, I had to mash the peak level button for such a long time that it ended up clearing the peak level, but I think it read 45 for a split second before it cleared.  That was 2 days ago, and since then I haven't been able to get a reading, peak or otherwise, at all.I guess I'll do some more tests over the weekend...but I hate to waste emergency services by calling 911 if it turns out the unit is just defective.In the meantime, I'm only running the furnace for an hour at a time.  I'll have to hit up my building manager to get a proper reading from it because it's cold in here!", "Date": "November 16, 2012"}, {"Title": "Does Not Show Current CO Levels, Only Peak CO on Request", "Author": "Admiralbrown", "ReviewID": "R18995WIG2XY7C", "Overall": "2.0", "Content": "This product was not what I expected.  There is a digital display on the unit, but the display is always off.  The right hand button is to display \"Peak Level\" not current level of CO.  The CO Memory automatically resets itself back to zero every 24 hours.  I wanted to get a unit to monitor current CO levels in the room, a number displayed constantly and hands free.Very tempted to send this back.  While it probably works well, it is not what I expected.On the plus side the unit plugs into a wall socket or the power adapter comes free from the unit and allows a remote installation.And like other reviewers have noted the owners manual is a joke.", "Date": "January 18, 2012"}, {"Title": "So so.", "Author": "Richard W. Dockett", "ReviewID": "RJ4D9100ZIH2E", "Overall": "3.0", "Content": "Purchased this as a replacement carbon monoxide monitor.  It is \"Made in China\".  Biggest flaw I have noticed thus far is that the back up battery compartment door has a very flimsy, cheap plastic latch to it, which I am quite sure willbreak.  However when it does break, I am sure a piece of Scothc tape will keep the dorr closed.  I have had a different model in the past, and prefer the other model over this one.  This is the one I prefer and would recommend:  Kidde KN-COPP-3 Nighthawk Plug-In Carbon Monoxide Alarm with Battery Backup and Digital Display", "Date": "December 19, 2011"}, {"Title": "Consumer Reports best buy", "Author": "Mary Winch \"Real Celtic Thunder fan\"", "ReviewID": "R3BN6902VB47JG", "Overall": "5.0", "Content": "NYS law for all condos, co-ops and rentals require CO 2 alarms installed.  This is the smartest protection as it has battery back up if there's a power outage. Most stores like Home Depot and Lowes only carry the less reliable and more expensive Kidde alarms. If you're in NY I suggest you purchase through Amazon and save time shopping and money.", "Date": "July 11, 2010"}, {"Title": "Simple to Use, Simple to Test, Great Value!", "Author": "Dan Huse", "ReviewID": "R3C14VZAJMLVCO", "Overall": "5.0", "Content": "My old carbon monoxide detectors were a different brand, and they were due for replacement.  I trusted the First Alert brand and gave these a try.  I bought three of them (one for each level of the house).  They work great, they are simple to test periodically, and I was very satisfied with the value for the money.  I would recommend these detectors to anybody.", "Date": "July 22, 2008"}, {"Title": "What a JOKE!!!!", "Author": "jerrie", "ReviewID": "RJPY2SWRBZUJR", "Overall": "1.0", "Content": "Received this item today it has been used and it does not have batteries as stated.  I ordered a new item and I think they have had so many retunes they just put them in a plastic sandwhich bag and send the used ones out to new customers.  I will not order from them again throwing this away too much trouble to drive 30 miles one way to the PO to return the old used sandwhich bagged item.  WHAT A JOKE!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!!", "Date": "June 27, 2013"}, {"Title": "Works Well, But Irritating Qualities", "Author": "Jack Gadzala \"Jack\"", "ReviewID": "R2RBZ55QMZIAAV", "Overall": "3.0", "Content": "The unit appears to function well (though it hasn't had to detect any CO yet).  However, it has numerous irritating qualities.As mentioned in the manual, it disables itself after a few years (supposedly because it has become less effective at that point - but it's also a way to get you to buy a new one sooner).The CO level only shows up if you press the indicator button. Other units display the current CO level at all times.  The First Alert only displays a blank screen.The display is difficult to read in most lighting conditions.You are forced to use the battery backup (whether you want the feature or not - and it is NOT an important feature).  Once the battery is low, the incessant chirping is unnerving - forcing you to replace the batteries.  It also does not work well with rechargeable batteries:  The lower voltage (1.2 volts) of rechargeable batteries causes the unit to consider them discharged long before they actually are (which means you're getting the incessant chirping - usually at night - every month).You risk damaging the product fighting to get it out of its plastic packaging after purchase. It's hard to open and can cause injury (sharp edges when cutting the hard plastic).", "Date": "December 30, 2010"}, {"Title": "Bad Design!", "Author": "Tennessee Kevin", "ReviewID": "R48KA898GRHH0", "Overall": "1.0", "Content": "After the batteries are installed, the battery door (which is on the front of the unit) does not close.  It just flops open.  The door catch is a horrible design.  Even if you could get it to close, I wouldn't trust that the latch would be durable enough to handle multiple battery changes.  I am returning both of the units I ordered.  Not Amazon's fault, but First Alert's.", "Date": "March 24, 2012"}, {"Title": "Peace of Mind", "Author": "G. Rome", "ReviewID": "RM8I4G0VZ7307", "Overall": "5.0", "Content": "This is very user friendly and easy to use.  Monitors the area and provides information on the level of CO present.  I highly recommend at least one on each level of your home.", "Date": "August 29, 2007"}, {"Title": "No reading or memory", "Author": "ddeff1986", "ReviewID": "R1UZRZK2RRMTAM", "Overall": "1.0", "Content": "I ordered 2 of these and neither one ever showed a reading, nor a peak reading in memory, even when testing it in the garage during and after running my car for 30 minutes! One came used or previously opened and returned as well.", "Date": "January 16, 2014"}, {"Title": "Quit working after a few months - don't waste your money", "Author": "R. Grove", "ReviewID": "RN9PADNHBLIFY", "Overall": "1.0", "Content": "I purchased and installed one of these a few months ago and it's broken already. Don't waste your money on this.", "Date": "January 27, 2014"}, {"Title": "Bare bones.", "Author": "smithcover", "ReviewID": "R2RHXEX7QLSF8U", "Overall": "4.0", "Content": "My old nighthawk showed a constant display of ppm. This has a display window but it's blank. Supposedly if there is a problem with carbon monoxide it will show a display. Hope so.It got a top rating from CU and the price is right. Next time I'll pay more for the constant display on the nighthawk.", "Date": "November 17, 2013"}, {"Title": "Battery issues?", "Author": "Paul Willis", "ReviewID": "RU30JQJ1RKX7W", "Overall": "3.0", "Content": "I doubted the negative reviews I read about batteries dieing quickly.  I bought two of these and it seems that while one behaves properly, the other drains the backup battery even when the unit is plugged into an outlet.  It seems that the \"faulty\" unit is draining the backup battery more slowly this time, so I'm wondering if it's possible that there might be a problem with my outlet.  Either way, I thought I'd share my experience for the benefit of others.  Other than the potential battery issue with one unit, the other one works perfectly fine.  I'm happy that my wife and I are protected against CO1.", "Date": "October 13, 2013"}, {"Title": "Defective", "Author": "M. Moore", "ReviewID": "R3MX1QFD78YSNW", "Overall": "1.0", "Content": "Unit died on me.  very disappointed because this unit was ranked veryly highly on independent sites for carborn monoxide detectors", "Date": "April 21, 2013"}, {"Title": "First Alert CO Monitor", "Author": "RV", "ReviewID": "R1CZWYNSHQQ8YT", "Overall": "4.0", "Content": "So far it works good in 3 months - every few days we test it and works good.  Only thing could be improved is to have the green light that shows that the monitor is on is so deep inside that we can hardly so from a distance and the reading of amount of CO in the room even while testing is so deem that we can hardly read the number. Dial numbers need more light on them and this could be because the green light is too far in. I may talk to the Company for this in few days.", "Date": "May 6, 2011"}, {"Title": "Great value", "Author": "L. Davis \"teom49\"", "ReviewID": "R13MHBYPBTD3MU", "Overall": "5.0", "Content": "I could not find these locally, so I tried Amazon.com. This model got a best review from Consumer Report. Easy to setup and use.", "Date": "January 9, 2010"}, {"Title": "Great Product", "Author": "J. Doedtman \"joe d\"", "ReviewID": "R1UOJII0Y27VQW", "Overall": "5.0", "Content": "I was using an older First Alert battery product and kept having false alarms. This unit is so much better than my old one and was easy to install and very easy to operate.", "Date": "February 23, 2009"}, {"Title": "It does the job", "Author": "Julie Lane \"Writer\"", "ReviewID": "R26YZMTPA2LD2V", "Overall": "5.0", "Content": "We have long had a carbon monoxide plug in on the main floor of the house, but had read that we should have one on the second floor where we have three bedrooms. This does the trick.", "Date": "June 5, 2014"}, {"Title": "great product", "Author": "ndickie", "ReviewID": "R34P99YBD2BVYJ", "Overall": "5.0", "Content": "easy to assemble and install, very compact design, top rated by professional firefighters, battery compartment slides in and out easily.  highly recommend.", "Date": "June 3, 2014"}, {"Title": "Good Product", "Author": "TexasHonda", "ReviewID": "R3OXP9I9ERAMP9", "Overall": "5.0", "Content": "Product was a replacement for a failed unit (age) of same brand. No problems. First Alert has been my choice for smoke/fire/CO2 alarms for 30 yrs. I've been very pleased w/ overall performance, and glad to report no actual fire use.", "Date": "June 1, 2014"}, {"Title": "A CO monitor should be in every house", "Author": "John Ferguson", "ReviewID": "RBAQG06YPNH83", "Overall": "4.0", "Content": "I have a couple of these, one in the garage and one in the house.  Also have a Nest protect, so this is now a bit redundant. Plugs into wall directly, or you can detach the plug unit on a cord for remote positioning.", "Date": "May 29, 2014"}, {"Title": "Works great so far", "Author": "D. S. Gruen \"Coding Apprentice\"", "ReviewID": "R10X9O5MU2ECY3", "Overall": "4.0", "Content": "4-stars because when testing it was a bit confusing. It *simulates* high levels, so it caught me by surprise and I thought it was actually measuring those levels.", "Date": "May 28, 2014"}, {"Title": "Has not gone off yet", "Author": "Barnard Family", "ReviewID": "R2ITYKLK8FP6K1", "Overall": "4.0", "Content": "Hopefully this works. When I press the test button, it does what it is supposed to. It has never shown a Carbon Monoxide reading, but hopefully that is a good thing.", "Date": "May 22, 2014"}, {"Title": "As Advertised and on Time", "Author": "RWT \"Tennessee Photo\"", "ReviewID": "R1JAT64RZQ571T", "Overall": "4.0", "Content": "Product arrived on time and as advertised.  Original alarm which came with our RV failed within 2-years of purchase.  On second unit.  Will see how long this one lasts before it fails.", "Date": "May 21, 2014"}, {"Title": "Security", "Author": "LaVaun A. McMahon", "ReviewID": "R3TOAYSYKE3PPX", "Overall": "5.0", "Content": "Easy to install and gives you a sense of security.  A real life saver and it should be in every home.", "Date": "May 17, 2014"}, {"Title": "Added Security", "Author": "Shannon Lastowski \"Queen of Caffeine\"", "ReviewID": "RHTFKR1077E4Z", "Overall": "5.0", "Content": "After fifteen months, and one battery change, this unit is working just fine. Having a plug in with a back up really gives a comforting sense of security.I originally chose this model because it was highly rated by Consumer Reports, it received an 87 out of 100 points, the highest of similar models tested.It looks as if a number of people have been disappointed in this unit, but at least so far, it's working fine for me.", "Date": "May 14, 2014"}, {"Title": "First Alert CO615 Carbon Monoxide Plug-In Alarm with Battery Backup", "Author": "SS", "ReviewID": "R22ZXF1M0OJBIG", "Overall": "5.0", "Content": "seems to work just fine, wont really know unless you have a carbon monoxide problem, hopefully I will never have to use it.", "Date": "May 14, 2014"}, {"Title": "Great price for a top end product", "Author": "Thomas G. Watkins", "ReviewID": "R37XO3N64JVHGO", "Overall": "5.0", "Content": "Hopefully I will never have to know if it works or not, but feel very comfortable that this is a good product.", "Date": "May 12, 2014"}, {"Title": "Still working", "Author": "Misfit", "ReviewID": "R2Y27D2EV18JFX", "Overall": "5.0", "Content": "Bought this from Amazon 3 years ago and it's still going strong.  We've had the power go out and the battery backup works.  We've never had the alarm go off - which is a good thing.  But we do test it from time to time and the test does activate the alarm.", "Date": "May 12, 2014"}, {"Title": "this is a must have in any household", "Author": "red refus \"red\"", "ReviewID": "RY9JOZDQQ9VLW", "Overall": "5.0", "Content": "CO can come from many different sources in different homes. This was installed close to the return air duct as was recommended by the company that services the heat pump. I like the back-up on it. easy to see-is back lit-I change the battery once a year. It arrived quickly-in very good condition-as described-very happy with purchase.", "Date": "May 10, 2014"}, {"Title": "Wanted UL listed", "Author": "R. Beaton", "ReviewID": "RJRD9MAAXDZCC", "Overall": "5.0", "Content": "That's why I paid more. I also like the level meter telling me just how bad things are...worth the money, and was much cheaper on Amazon.", "Date": "May 10, 2014"}, {"Title": "Basement Necessity", "Author": "Ben Beberg", "ReviewID": "R6A2XI4LZT5FP", "Overall": "4.0", "Content": "It is a necessity to have a Carbon Monoxide detector in the basement. We had a First Alert detector for the last 10 years until I noticed that it had been 10 years and realized that the life span is around 7 so I ordered this up with my prime subscription and bam it was here in 2 day and I feel at ease again.", "Date": "May 1, 2014"}, {"Title": "Good buy", "Author": "ROY", "ReviewID": "R3FNHTBAE24R3Y", "Overall": "5.0", "Content": "Product was as advertised. The only negative is that the power indicator light is a bit hard to see when plugged in to a low wall outlet.", "Date": "April 26, 2014"}, {"Title": "Nice unit...", "Author": "LJR", "ReviewID": "R7YNPEV5IT7LY", "Overall": "5.0", "Content": "This arrived, I put the batteries in place, plugged it into the wall, tested it and have not heard a peep out of it since.  It does have have a nice visual monitor to tell you what your levels are. I actually bought a second unit a few months later for another house.", "Date": "April 23, 2014"}, {"Title": "good price replacements", "Author": "Patricia", "ReviewID": "R1EVL8QAZBO1H4", "Overall": "5.0", "Content": "it was time to replace ones i had for safety reasonand my daughter just got these and recommendedthem.  this is brand we have always used andwe trust", "Date": "April 19, 2014"}, {"Title": "Works great", "Author": "A viewer", "ReviewID": "RWFSKS63AXIJJ", "Overall": "5.0", "Content": "I feel very confident about this item that we will be safe. Tested and it works well. Happy it has a backup battery in the power goes out. Thanks!", "Date": "April 15, 2014"}, {"Title": "Worked well for about 7 years", "Author": "P. Mulloy", "ReviewID": "R24Z6ZLQXCM9AQ", "Overall": "4.0", "Content": "This worked well for about 7 years and then went bonkers and i had to throw it out. I guess 7 years is a pretty good run.", "Date": "April 15, 2014"}, {"Title": "Very Satisfied", "Author": "Christine Baffuto", "ReviewID": "R1073TPUJPXW7W", "Overall": "5.0", "Content": "Pretty much all you have to do is plug it in. We try to remember to test it once a month, and after about a year have not had any problems with it working. This thing is VERY loud and would definitely wake you up if it went off at night.", "Date": "April 13, 2014"}, {"Title": "Meets safety needs", "Author": "Angela Harding-Poll", "ReviewID": "R1EI8OAMRQRO3S", "Overall": "5.0", "Content": "We purchased three of these for our home. So nice to have the digital read out. Feeling much safer with these in the house.", "Date": "April 13, 2014"}, {"Title": "Works very well", "Author": "Bob Keller", "ReviewID": "ROEWXSJW48OXG", "Overall": "5.0", "Content": "Ordered to replace my 7 year old first alert that was beeping.  They are suppose to be replaced every seven years. this will be a big help.", "Date": "April 12, 2014"}, {"Title": "Very satisfied", "Author": "Long Islander", "ReviewID": "R2GG1REV18Q7KH", "Overall": "5.0", "Content": "My old detector passed its \"life\" and it was time for a new one.  Was delivered quickly and right now it is protecting my home again.", "Date": "April 12, 2014"}, {"Title": "perfect", "Author": "Charles Eric Phipps", "ReviewID": "RLZREADR72RNB", "Overall": "5.0", "Content": "dont get one that only uses battery or only uses plug.  I also prefer the screen so I can visual see PPM.  Mine has never seen anything about 0 and that is a good thing.", "Date": "April 9, 2014"}, {"Title": "Delivered as expected.", "Author": "Herbert Otto Homolka", "ReviewID": "R3GYNGJHEQK9LI", "Overall": "5.0", "Content": "This product provides digital information. Its price was excellent compared to similar ones. They are working great.  I am a safety inspector for many houses.", "Date": "April 8, 2014"}, {"Title": "Seems OK", "Author": "L. Heminway", "ReviewID": "R3PK5F31Q5T77T", "Overall": "4.0", "Content": "Well, it seems OK and it has not gone off yet, so what else is there to say?  I hope it works well as I bought it after four people died in a local home due to CM poisoning.  I realized we did not have detectors and felt it was a very good idea for us to have them.  So, not having them go off is probably a good thing?  ; )", "Date": "April 8, 2014"}, {"Title": "Works good for me", "Author": "JOE BAZZINI \"JOE BAZZINI\"", "ReviewID": "R37SNP80TWVVH1", "Overall": "5.0", "Content": "Installed this with no issues. Very simple.It must be working correctly I am still alive to write this review.Good rating in consumers.", "Date": "April 7, 2014"}, {"Title": "A qaulity product", "Author": "Carl L. Weschcke", "ReviewID": "RF4K0LP2DRJD0", "Overall": "5.0", "Content": "It is an excellet product well designed for immediate use, with good instructions. I bought one for myself and three more for our son's home.", "Date": "April 6, 2014"}, {"Title": "Easy set up", "Author": "Namu", "ReviewID": "R36QYXACVNGGZ", "Overall": "4.0", "Content": "Couple of back up batteries included, (Duracell) easy to set up. Hard to see green on light in daytime. Not bad.", "Date": "April 5, 2014"}, {"Title": "Great tester for the money", "Author": "Kelly Haws", "ReviewID": "RA59W84AX2E3Y", "Overall": "4.0", "Content": "I liked the price and design of this tester.  You can put it in the bottom on an outlet and still use the top for other items.  I wish it had a digital readout of '0' if there is no CO present", "Date": "April 3, 2014"}, {"Title": "Ugly but easy to use.", "Author": "J. Jerome", "ReviewID": "RINAWSZVTGSH9", "Overall": "3.0", "Content": "This thing is ugly as a butt.  Not Kate Upton's. More like Danny DeVito's.  It doesn't look that bad in the pictures, but they shot it at just the right angle to conceal how far it sticks out from the wall, and that makes all the difference.  It's a genuine eyesore.That said, setup was easy.  Just pop the batteries in and plug it in.  I can see how some people might have had trouble with the battery door, but I had good luck with mine.  Just be careful so you don't break it.  I assume it works.  It hasn't reported any CO events, but then what am I going to do, flood the house with gas to test it under real world conditions?  I think not, so I'm going to trust the display and the consumer magazines.Still, had I known how unsightly this is, I'd have bought something else.", "Date": "April 2, 2014"}, {"Title": "Great product", "Author": "RC", "ReviewID": "R2FSBU6JP4WPXI", "Overall": "5.0", "Content": "Easy to install, easy to move, readings easy to check.  Shipped quickly.  Affordable price.  I couldn't really ask for more.", "Date": "April 2, 2014"}, {"Title": "bought for self", "Author": "cheri", "ReviewID": "R6V58BEKH7060", "Overall": "5.0", "Content": "I bought this and it was very easy to install the batteries and just plug it in.  No problems at all", "Date": "April 1, 2014"}, {"Title": "Great product!", "Author": "Tami J. Romriell \"busy student\"", "ReviewID": "R2SHY0OYBZLSU", "Overall": "5.0", "Content": "We recently had a local family die from carbon monoxide poisioning, so everyone was eager to make sure they had one in their home.  We didn't, so I researched and found that this alarm included all of the elements I was looking for. It was easy to install and I love that it has a plug-in and back-up batteries.  It makes me feel safe and secure.", "Date": "March 31, 2014"}, {"Title": "Good monitor", "Author": "AW", "ReviewID": "R1D5G6ME0E78C3", "Overall": "5.0", "Content": "This is a very nicely made monitor.  There is remote mounting for the device which is great since CO is lighter than air.", "Date": "March 31, 2014"}, {"Title": "As expected.", "Author": "tballred", "ReviewID": "R26TD4IZFSM18P", "Overall": "5.0", "Content": "Just what I expected. Plugs in and has battery backup. Easy to use and install.  Not too bulky or noticeable.", "Date": "March 30, 2014"}, {"Title": "Piece of mind!", "Author": "Bongo", "ReviewID": "R2CTD5GG7KU166", "Overall": "5.0", "Content": "Great product. Very simple to use. Plugs directly into an outlet or has a cord that gives you freedom to move it around. Very nice digital screen readout. It lights up when the buttons are pressed. It's a must have for a deadly and silent killer like Carbon Monoxide! I highly recommend it.", "Date": "March 30, 2014"}, {"Title": "Alarm", "Author": "LIN", "ReviewID": "RUZIUT9F72W9G", "Overall": "5.0", "Content": "Alarm is exactly as described and works great. It makes me feel secure. I would love a little less on shipping", "Date": "March 28, 2014"}, {"Title": "Carbon Monoxide Alarm", "Author": "Pumper", "ReviewID": "R2EE31EPX77NDL", "Overall": "5.0", "Content": "Installed the unit. Works OK. I like this type that is both a plug in and has a battery backup.", "Date": "March 28, 2014"}, {"Title": "Easy to use", "Author": "David G. \"David\"", "ReviewID": "R3CRUMLGAPCIVI", "Overall": "5.0", "Content": "It is really great, it has a plug on the back for easy wall installation if you have your plug too high.", "Date": "March 27, 2014"}, {"Title": "Easy to set up", "Author": "Ivy Greene", "ReviewID": "R350EXPRS2S0FM", "Overall": "5.0", "Content": "This carbon monoxide alarm is very easy to set up and test.  Everyone should have a carbon monoxide alarm and this is a good one.", "Date": "March 18, 2014"}, {"Title": "Bought three...", "Author": "Thomas E. White", "ReviewID": "R31H2FZ5GPXXOL", "Overall": "5.0", "Content": "Bought 3, as I said; they all work fine.  Test button works as does alarm.  Subdued green light no problem in dark bedroom.  Have not subjected them to actual CO test, but who intentionally does?  Guess I trust Underwriters...", "Date": "March 15, 2014"}, {"Title": "Great protection.", "Author": "James H. Schmoker", "ReviewID": "RC4Q3R353J4TV", "Overall": "5.0", "Content": "I ordered two of these over a year ago and they are doing great. Very flexible in their mounting options.The only downside is the difficult battery compartment access when they are new, but this gets easier after they are opened a few times.", "Date": "March 10, 2014"}, {"Title": "Good Value", "Author": "Michael D. Powell", "ReviewID": "R3LNK32CE5QBYP", "Overall": "5.0", "Content": "The test operation works well.  Hope I never have to figure that the unit works!  But I will be more than glad if it does.", "Date": "March 7, 2014"}, {"Title": "Exactly as advertised", "Author": "Lee F", "ReviewID": "R53SIRN1WEGG6", "Overall": "5.0", "Content": "The unit had a loud alarm, battery back up, and peak indicator. The power plug-in has a cord, so you can set it at the recommended height.", "Date": "March 7, 2014"}, {"Title": "first alert", "Author": "Amazon Customer", "ReviewID": "RXCM9VJ6Y3OZ0", "Overall": "5.0", "Content": "easy installation, just plug and and it lights up and is ready to go.I feel much safer now. no wires required", "Date": "March 4, 2014"}, {"Title": "Safety first", "Author": "By David &Tina Edwards", "ReviewID": "R3DL6E6KQBOUK8", "Overall": "5.0", "Content": "Very easy to set up. Just insert the batteries, plug the unit into an outlet. The display is easily read and appears accurate when I tested it for carbon monoxide.", "Date": "March 3, 2014"}, {"Title": "Easy to uses", "Author": "Jennifer", "ReviewID": "R22DHBKZ20D1AI", "Overall": "3.0", "Content": "Easy to install and can plug in sideways if needed. Mounts to wall also if you need that option. Has warranty. Should replace yearly as my local fire dpt. told me as I had a scare.", "Date": "March 2, 2014"}, {"Title": "Poor design", "Author": "P J Cipriani", "ReviewID": "R1NP98NL26M2Z6", "Overall": "2.0", "Content": "Did not like the flimsy plastic housing, specially  the battery door. Unsightly looks. Preferred a battery unit which I replaced it with.", "Date": "March 1, 2014"}, {"Title": "Nice detector.", "Author": "S. Gardner", "ReviewID": "RJO640P1XY1ZG", "Overall": "5.0", "Content": "I prefer a detector that actually shows the CO2 level rather than just setting off an alarm and this one works great.", "Date": "February 28, 2014"}, {"Title": "It's been a year", "Author": "Will's Mommy", "ReviewID": "R1UW4E7SULTWAP", "Overall": "5.0", "Content": "Bought this a year ago and works as it should. Battery backup is key. Have the first alert and night hawks on every floor. Would buy again", "Date": "February 26, 2014"}, {"Title": "Another Christmas present\\", "Author": "Joan Pittman", "ReviewID": "R2SP9LVFQURMEU", "Overall": "5.0", "Content": "My son feels safe and secure with this one.  It was on his wish list and its his favorite gift.", "Date": "February 25, 2014"}, {"Title": "First Alert CO615 CO detector great", "Author": "Tony K", "ReviewID": "R2SF6UZOED4UUJ", "Overall": "5.0", "Content": "Set up was simple. I had No problems. Everything worked as it was described.Great reviews on consumer reports and other reviewers.I plugged directly in to outlet, but it has an extension cord built in.Highly recommend", "Date": "February 25, 2014"}, {"Title": "Works as described", "Author": "bywater7", "ReviewID": "R3MXNK22EILNFW", "Overall": "5.0", "Content": "This device worked on arrival. We have had no issues and got it only as a precaution. It has not ever randomly beeped or gone off in the middle of the night. Manufacture date was only slightly before the date I received it. Happy with the purchase, would recommend to others.", "Date": "February 25, 2014"}, {"Title": "works well", "Author": "Paul C.", "ReviewID": "R2HYZWFUASRA9X", "Overall": "5.0", "Content": "Works better than expected. Room mate fell asleep with a non stick frying pan \"warming up.\" The device alarmed to the gases given off by the non stick coating!", "Date": "February 24, 2014"}, {"Title": "so far fine", "Author": "etta", "ReviewID": "R9WDKDZAD9EYZ", "Overall": "5.0", "Content": "need to replace my old one bacuase it was giving flase natural gas readings. This one is just carbon monoxide and seems to be OK", "Date": "February 24, 2014"}, {"Title": "This detector saved lives", "Author": "Jay Heavner", "ReviewID": "R2JE3QFNVUEV3B", "Overall": "5.0", "Content": "We bought one of these on Amazon a few months ago and installed it in our basement, where the gas furnace and water heater are located and where we also have an apartment that we rent out.  Last evening I came home from work and heard the alarm sounding.  The CO levels were well over 100, so I called the fire department.  It seems a construction crew in a row house next to ours was using a gas generator that was dumping CO.  The fire department crew found elevated, lethal levels in six adjoining row houses; they explained that in old row houses like ours (100 years), the walls between the houses are not airtight at all, as gas easily passes from one to the other.  And as they told me before they left, if we hadn't installed the CO detector  there would very likely have been casualties.  I'm running to the hardware store this afternoon to buy a more for our house and the neighbors, as I don't want to wait even a day for delivery.  It seems the CO levels were even higher on the top floor of our house, so we need to install more upstairs.", "Date": "February 19, 2014"}, {"Title": "Bought 2", "Author": "Sarah Daniels", "ReviewID": "R8PEM5KJ478IO", "Overall": "5.0", "Content": "I bought 2 of these base on the reviews. They have worked awesome, i have one in an apartment and one in a town house.", "Date": "February 17, 2014"}, {"Title": "works so far", "Author": "Michael Wilson \"against the grain\"", "ReviewID": "RB27RCIJI5NS6", "Overall": "4.0", "Content": "It's hard to write a review on something you hope you will never use, but it was delivered on time and was easy to install.", "Date": "February 16, 2014"}, {"Title": "Solid device for the price", "Author": "Thisguy", "ReviewID": "ROCJNNDXQVM11", "Overall": "4.0", "Content": "Safety is always important and this device gets the job done.  This model contains a built-in extension cord for up to a few feet, i personally do not use it but it may be nice to know it is available.  Brand Name at a reasonable price!", "Date": "February 12, 2014"}, {"Title": "easy to install", "Author": "Tony", "ReviewID": "R828G0SBJFF8K", "Overall": "4.0", "Content": "easy to install. Just wish the display would show constantly to indicate that it is working.  You have to press the test button to make sure its working.  Carbon Monoxide is a silent killer.  Research placement.  Carbon monoxide is heavier than oxygen so plugging it into the wall outlet works perfectly.", "Date": "February 12, 2014"}, {"Title": "Works well", "Author": "R.D. Quick", "ReviewID": "RFFTC0IPVA1EO", "Overall": "5.0", "Content": "I bought a couple of these for my home for the protection. They work well and alarm quickly if there are any issues.", "Date": "February 8, 2014"}, {"Title": "Great replacement", "Author": "CF", "ReviewID": "R2PHRFTUQFRF35", "Overall": "5.0", "Content": "Easy to read. Easy to use. Our other one was 15 years old, so I needed a replacement. This was a good price for a good product.", "Date": "February 8, 2014"}, {"Title": "First Alert CO615 Carbon Monoxide Plug-In Alarm with Battery Backup and...", "Author": "SPARROW \"JLINDY\"", "ReviewID": "R118GUK5HUCFHB", "Overall": "5.0", "Content": "this product was very easy to set-up. insert back-up batteries and plug-in to wall outlet. it is that easy.it is a very popular brand and it got good reviews.", "Date": "February 6, 2014"}, {"Title": "It's working", "Author": "William Hall", "ReviewID": "R370KU5BQ1VSBA", "Overall": "5.0", "Content": "Pretty easy to install. Just plug it in. It's made so that you can plug it directly into an AC socket, or you can unroll the included cord and plug it into a nearby socket.", "Date": "February 5, 2014"}, {"Title": "Great Product!", "Author": "Dan", "ReviewID": "R1H8HRVEL0L8UY", "Overall": "5.0", "Content": "First Alert is a brand you can always trust.  It gives you a strong sense ofsecurity having this detector in your home.", "Date": "February 4, 2014"}, {"Title": "A Must For Every Home With Gas Heating", "Author": "Michael Chiodo", "ReviewID": "R3EJS0QR64XYFM", "Overall": "5.0", "Content": "It was time to replace our old CO detector, and so far this one seems to do work fine.  It's simple with no frills which is exactly what I wanted.  I hope we never need to use it, but it's there quietly protecting us just in case.", "Date": "February 1, 2014"}, {"Title": "simple but great", "Author": "Jay", "ReviewID": "RR9KYJ6PAP5U6", "Overall": "5.0", "Content": "Easy to use, easy to locate with the long power cord and battery back up. Can't beat it. Batteries had \"use by 2024\" so you know it's pretty new.", "Date": "January 31, 2014"}, {"Title": "Confused about price.", "Author": "Wormy", "ReviewID": "R3D5MKQMD6R48K", "Overall": "5.0", "Content": "The product is everything as promised; I have no problems with shipping, quality or performance.  I had older CO detectorsand was not confident with them, especially with the cold weather this season.  Pricing on the product confused me though.One quantity was $30.49, but a two-pack was around $78.00.  Not being a math genius, I made two single orders.", "Date": "January 31, 2014"}, {"Title": "Bought Two", "Author": "Doc Holliday 52", "ReviewID": "R3OGVZOR4875HU", "Overall": "5.0", "Content": "We bought 2 of these. One each for the first and second floor. These work great and the price was excellent.", "Date": "January 22, 2014"}, {"Title": "Battery Door Needs Redesign", "Author": "David", "ReviewID": "R1DN36MF7QMHAP", "Overall": "4.0", "Content": "With the exception of closing the battery door after installing the battery this product was easy to set up.Test mode worked fine - hope I never get to see how it works for real :-)", "Date": "January 22, 2014"}, {"Title": "First Alert CO615 Carbon Monoxide Plug-In Alarm with Battery Backup and... First Alert", "Author": "chuck", "ReviewID": "RGFWOI0FR71UK", "Overall": "5.0", "Content": "This came with great reviews from people that should know, that is the reason I purchased it.  I hope I never hear the sound go off other than testing.", "Date": "January 19, 2014"}, {"Title": "Excellent", "Author": "JR", "ReviewID": "RIEN6WREVD7EQ", "Overall": "5.0", "Content": "This carbon monoxide detector is as advertised and q very quick turnaround and so far I have had no problems with it", "Date": "January 19, 2014"}, {"Title": "So far this is working very well so I give it a five star", "Author": "Elizabeth", "ReviewID": "R2C8LJ8AL7BJM5", "Overall": "5.0", "Content": "I would recommend this product to others.  It works well and gives us peace of mind.  Also, the price is reasonable and in the future I will buy another one...Elizabeth", "Date": "January 18, 2014"}, {"Title": "Digital display is nice, Bulky", "Author": "Scott Styles", "ReviewID": "RIU2W9XPIV0V0", "Overall": "4.0", "Content": "I replaced a detector that had no display, just an led. It had been going off intermittently. Maybe I was going to die...Enter this thing with a digital display. Nope, not gonna die. The old one was just beeping to let me know it was old. Relief.Sticks out from the outlet about 2\", probably ought to be mounted on the wall with the provided screws. Dinging it a star for being so bulky.", "Date": "January 18, 2014"}, {"Title": "Another thing that I do not have to think about.", "Author": "Hiromi Capelle", "ReviewID": "RQ9YI9QA7MD14", "Overall": "5.0", "Content": "I have had others for over 20 years and just wanted to get them replaced.  No complaints!  I bout more than one and paced them Up and downstairs.", "Date": "January 16, 2014"}, {"Title": "Carbon Monoxide Plug-In Alarm", "Author": "Erik", "ReviewID": "R1OJXGMEII5WNE", "Overall": "4.0", "Content": "I have many first alert products (smoke detectors and fire extinguishers).  I am happy with their performance, reliability and ease of use.  Would recommend for the cost and safety of your family.", "Date": "January 10, 2014"}, {"Title": "Alright", "Author": "The Murphy Family \"SM\"", "ReviewID": "R26GVUFSHF96KZ", "Overall": "4.0", "Content": "Seems to be a little flimsy. Just isn't as sturdy as others that we've owned. Sticks out a little bit farther from the wall than I would expect. Small frustrations considering the life saving that this unit could do. Seems to work well and no problems so far.", "Date": "January 5, 2014"}, {"Title": "First Alert CO615 CO2 Plug-in Alarm", "Author": "Armandofly", "ReviewID": "R2RYH2OAL9ORL3", "Overall": "4.0", "Content": "I give four stars because it is too early to say if it is a good or bad product. After about 2 months it is working as advertised, but I would  wait longer before writing some realistic review.", "Date": "January 3, 2014"}, {"Title": "Many models of CO2 detectors, chose the right one for our needs", "Author": "Rick", "ReviewID": "RTS5HBD4M0LL1", "Overall": "5.0", "Content": "This model is exactly what we were looking for, and is functioning perfectly.  The readable window is ideal, and makes monitoring easy.", "Date": "January 3, 2014"}, {"Title": "Really have not had to use it.", "Author": "John B. Pfister", "ReviewID": "R33LNZ3VDJCY88", "Overall": "5.0", "Content": "We have it plugged in and it appears to be doing it's job. It seems to be very well made. Would buy again.", "Date": "January 1, 2014"}, {"Title": "Everybody needs one of these -", "Author": "Philipp2 \"philipp2\"", "ReviewID": "R2DUJSBH72OF7M", "Overall": "5.0", "Content": "Our old CO detector was probably 15 years old as I did not realize that they had a limited useful life span.  After reading several reviews, I ordered this one and as far as I can tell, it is working just like it is supposed to.  Who knows?  It just sits there on the wall looking at us.I like the fact that it does have the battery backup, just one more safety feature.", "Date": "December 27, 2013"}, {"Title": "first alert", "Author": "jilda standish", "ReviewID": "R10PZIMIUWJPRF", "Overall": "5.0", "Content": "This item works great! I have not had to replace the battery in 3 years! Works wherever ther is an outlet.", "Date": "December 22, 2013"}, {"Title": "Safty first", "Author": "Chrisanne", "ReviewID": "R1ZOI70210BOBJ", "Overall": "5.0", "Content": "Did not have a CO detector.  Guess it works.  If it goes off, I'll probably have a heart attack.  Have thought for several years they were a good idea so this is what I got myself for Christmas.", "Date": "December 20, 2013"}, {"Title": "I'm still alive!", "Author": "Paul", "ReviewID": "R3EIMN46QW8XQF", "Overall": "5.0", "Content": "I have had this for over a year, plugged into the wall with no malfunctions or issues at this time.", "Date": "December 19, 2013"}, {"Title": "works well", "Author": "maletone \"maletone\"", "ReviewID": "R1LAOVVDYPB1CX", "Overall": "5.0", "Content": "I bought this for my rental property and its easy to install and works well. The directions are very self explanatory when setting it up and helped my passed the Mn fire home occupancy laws in MN.", "Date": "December 16, 2013"}, {"Title": "Absolutely necessary", "Author": "MARILYN G. DERIGHT \"always reading\"", "ReviewID": "R11HRUGLOH0E2E", "Overall": "4.0", "Content": "This carbon monoxide plug-in alarm was just what we needed for the bedroom level of our house. With its backup battery, it gives a considerable sense of security.", "Date": "December 14, 2013"}, {"Title": "2nd one bought", "Author": "Sally Mc Fadyen \"Smc\"", "ReviewID": "R1HW1X69SBVMW2", "Overall": "5.0", "Content": "We had bought 2 of these  6 or 7 years ago when we installed a stove in our 4 season porch and were having problems with the burner.  This alarmed constantly and the contractor finally called the stove manufacturer and found out that they had sent out 9 bad burners.  Once that was replaced we had no more issues.  We have an attached garage to our house and I have one of these upstairs and one in our 4 season porch.  I feel more secure with these in my home.  They last as long as they say they will.  They are reading your air all the time.  I love the battery back up.  Can't say enough about this item.  Good buy for the money.", "Date": "December 14, 2013"}, {"Title": "CO615 Carbon Monoxide alarm - A good detector, worth the price.", "Author": "A. Wald", "ReviewID": "R26MM9SVSSHX4B", "Overall": "5.0", "Content": "The First Alert CO615 was purchased to replace the previous carbon monoxide detector that had reached the end of its effective usefulness.  The new First Alert has all the features that we needed at a fair price.  Unlike other reviewers of this product, I did NOT find any difficulty in placing the batteries in their compartment.  As with any electronic device requiring batteries, one must take time to understand the operation of the device and take due care when working with the device.  The First Alert has worked as well as its predecessor.  This device was a good buy and well worth the price.", "Date": "December 13, 2013"}, {"Title": "Excellent smoke detector unit", "Author": "Mic", "ReviewID": "R4H8R8L011SAU", "Overall": "5.0", "Content": "Bought this for my brother in laws older trailer.  It can be remotely mounted away from the outlet that is behind his bed.  It currently reads “00” both at my house and his so I am trusting it is accurate.  A very easy unit to set up and read.", "Date": "December 12, 2013"}, {"Title": "works!", "Author": "Julie K. Ladd \"Julie Ladd\"", "ReviewID": "R2NOIMSSRFSX7W", "Overall": "4.0", "Content": "Its good to have one of these in case you are concerned about carbon monoxide. I gave it 4 stars because I hate the high pitch noise(all of these have that noise) but it works and I am thankful for that.", "Date": "December 10, 2013"}, {"Title": "Reliable name", "Author": "AlmostEverything84", "ReviewID": "R2O3VET7EZYASP", "Overall": "5.0", "Content": "I've had this for 2 years. No issues at all with it yet.  I have it in my hallway upstairs and it is always powered and ready to alert.  I do have room to plug another item in.", "Date": "December 10, 2013"}, {"Title": "Much improved in features", "Author": "EPP", "ReviewID": "R1GD7F540VWBBS", "Overall": "5.0", "Content": "Great product, especially when it alerts you when you need a change of batteries.  This is my first combo (fire/Carbon M) and it is very easy to use/learn.", "Date": "December 9, 2013"}, {"Title": "good product at fair price", "Author": "shore times", "ReviewID": "R3UDEACUKZJXX", "Overall": "5.0", "Content": "it's first alert so mostly a winner - does what it says and ample visual options with clear instructions - have bought 3 one for each level of the house", "Date": "December 4, 2013"}, {"Title": "recommend so far", "Author": "bh of chicago \"bh\"", "ReviewID": "R20RBTZU7EBNR9", "Overall": "5.0", "Content": "I like to be able to read the numbers, it has not given me any problems so far, versatile plug is nice", "Date": "December 4, 2013"}, {"Title": "Very Happy So Far!", "Author": "Stube01", "ReviewID": "R1YHG4PG2ZZWB2", "Overall": "5.0", "Content": "I read reviews complaining about battery life. It's been a year and haven't dropped a bar on the meter. No false alarms either. Very pleased with this purchase.", "Date": "December 3, 2013"}, {"Title": "Easy to Install", "Author": "Henk \"shopper\"", "ReviewID": "R2G6DYMPPNNL7O", "Overall": "4.0", "Content": "It is easy to install--just plug it in.  Not sure how well it works--so far we have had no warnings about Carbon Monoxide.", "Date": "November 29, 2013"}, {"Title": "as advertised", "Author": "Amazon Customer", "ReviewID": "R3HUDXFQLVUKI6", "Overall": "5.0", "Content": "Works as adversized, no complaints, easy to set up and install. I used the test feature and the beeping is very loud. I am pleased with the purchase.", "Date": "November 27, 2013"}, {"Title": "Great detector that plugs directly into wall", "Author": "malom", "ReviewID": "R2ILSYYG465C9C", "Overall": "4.0", "Content": "I live in a home with some additions, which were not blessed with their own smoke or Carbon Monoxide detectors.  I used these for carbon monoxide and was pleased to find they plug directly into the wall with no additional installation required.  The price was also about 10% cheaper than lowes.", "Date": "November 24, 2013"}, {"Title": "Gr8", "Author": "J. CHITKARA \"JC\"", "ReviewID": "R3EN7CJNELIP86", "Overall": "5.0", "Content": "Installed in all the bed rooms in a 3 level home. Works perfect. And Its the best out in the  market as per my knowledge.", "Date": "November 17, 2013"}, {"Title": "Alarms", "Author": "Nancy Alley", "ReviewID": "R26EJG2LGVCPHS", "Overall": "4.0", "Content": "Works very well, so far.  Hope it never goes off.  In the bedroom, but it will when it needs batteries.", "Date": "November 15, 2013"}, {"Title": "Looks nice", "Author": "Sandra A. Brejnak", "ReviewID": "RVDF7X2SMQ5MC", "Overall": "5.0", "Content": "We have our furnace in the attached garage, so we didn't think we had to worry about carbon monoxide. We were wrong. We had the furnace maintainence check-up only to find a cracked heat exchange and the repairman shut down the furnace and after a second opinion had to replace our furnace because it was leaking carbon monoxide into the house. We purchase this detector because of the high ratings. The unit looks nice and the test was very loud, so we feel quite safe that it will keep us safe.", "Date": "November 9, 2013"}, {"Title": "Carbon Monoxide Alarm", "Author": "Dakota Dream \"Dakota Dream\"", "ReviewID": "RQQUAITWW0MKA", "Overall": "5.0", "Content": "This is what I was looking for, it's small and easily hangs very tight in the electrical outlet. I am very satisfied.", "Date": "November 5, 2013"}, {"Title": "Unit was easy to install", "Author": "nancy m.", "ReviewID": "R1PS6QHAV4LOK0", "Overall": "4.0", "Content": "I like it because it was easy to install & it has the alternative of mounting on the wall for easier viewing. It comes with a sticker with instructions on what to do if the alarm goes off, which is good but the downside is the print is so small it's hard to read.  all in all I think it's better to be safe than sorry.", "Date": "October 26, 2013"}, {"Title": "First Alert C0615 Carbon Monoxide Plug-In Alarm with Battery Backup", "Author": "Barbara C Strong", "ReviewID": "R2ORNWNKK6TUGK", "Overall": "5.0", "Content": "Great buy.  Have not had any problems with this product.  It was very easy to install.  I highly recommend this product.", "Date": "October 16, 2013"}, {"Title": "seems like a good solid product.", "Author": "Anthony H. \"Big \"A\"\"", "ReviewID": "R2CVTG3HFB92HI", "Overall": "4.0", "Content": "liked how this has a detachable cord, as to not take up and intrude on whole plug. we mounted beside the plug socket using cord and were able to fit another hall night light in other socket with no issues.", "Date": "October 6, 2013"}, {"Title": "Excellent", "Author": "Maineman", "ReviewID": "R30M5IIA6NTO7I", "Overall": "5.0", "Content": "I bought two of these one for each level of the house. Easy to read, Alarm is loud. Plugs in to the wall. Good instructions.", "Date": "October 3, 2013"}, {"Title": "So far my family has not died of carbon monoxide poisoning", "Author": "igen \"igen\"", "ReviewID": "R3H3RA4KVUXYOQ", "Overall": "4.0", "Content": "This CO detector is easy to set up, has battery backup, and has a long cord so you can install it high on the wall but still plug it in. You can also opt to wrap up the cord in the back of the unit and clip the plug in place to mount the unit directly to an outlet. It shows the current CO level on its lighted LCD screen, and has a memory feature so you can see the highest level detected.Unfortunately, I suspect the long thin cord would invite wee ones to pull on it, so this detector might not be the best solution if you have kids, or if anyone with children regularly visits your home. It would be better if the cord was detachable and was able to charge a rechargeable backup battery.", "Date": "September 28, 2013"}, {"Title": "First Alert Plug-in with Battery", "Author": "Mike DAmico", "ReviewID": "R2YBVY3C2T6JRP", "Overall": "5.0", "Content": "This item works like a charm.  Plug it in and it uses your electricity.  If the power goes out, or if you unplug it, it uses the batteries that are included.", "Date": "September 25, 2013"}, {"Title": "Weak beep", "Author": "Fat", "ReviewID": "RRCG4D0FNE7RJ", "Overall": "2.0", "Content": "Not at all what I would expect to hear as a \"warning\" beep!  Rather weak, in my opinion.  Would suggest looking for one with a louder beep.", "Date": "September 22, 2013"}, {"Title": "I haven't heard it yet, so . . .", "Author": "Beatles4ever", "ReviewID": "RYFH7R5ZVOK3", "Overall": "5.0", "Content": "it must be working well!  It is required by my apartment complex to buy a plug-in CO2 detector, and that it should be installed by the oven.  One person told me that if it's too close to the oven, I might get a false-positive reading, because the CO2 rises.  So what the hey, I just bought another CO2 detector and put it up higher closer to the bedroom.", "Date": "September 16, 2013"}, {"Title": "Dual power supply for extra safety", "Author": "H. C. McIntyre", "ReviewID": "R27F6JM1L8LY1J", "Overall": "5.0", "Content": "Low cost insurance to save your life, carbon monoxide is colorless, tasteless, and oderless, take it from someone who learned 35 years ago the hard way. If you use fossel fuel heating, cooking, hot water, cloths drying, etc. this could save your family and your life from a silent killer, cabon monoxide. In most homes you need more then one.", "Date": "September 14, 2013"}, {"Title": "Love it!", "Author": "cathy m strupel", "ReviewID": "R2D9HYGJTOPBVF", "Overall": "5.0", "Content": "Feel very well protected in my house with this co detector. Would recommend to everyone, put it in the basement.", "Date": "August 30, 2013"}, {"Title": "Can't trust it", "Author": "Jon", "ReviewID": "R24HTOFKC257FH", "Overall": "3.0", "Content": "Design is good and alarm is loud...when it works. I test it about every two weeks. Sometimes it doesn't work though. I can hear it's trying to make the beeps but it just makes very quiet chirps. I can test it immediately after and then it works fine. Sometimes it works fine first try. When it does work, it is extremely loud though. I keep this plugged in but I have another meter in the same room. I may have just gotten a bad one but I didn't notice it until it was too late to return. Lesson is always test it when you get it, and always test your home detectors at least once a month. Stay safe.", "Date": "August 26, 2013"}, {"Title": "I love it.", "Author": "ANIELLO Scelzo", "ReviewID": "R3EQMJMY0Y5HDK", "Overall": "5.0", "Content": "Great unit it replaced another brand that I could not get in touch with when I had a problem, after only .two years......", "Date": "August 19, 2013"}, {"Title": "just plug the alert into any outlet", "Author": "LoC", "ReviewID": "RGFPIA6V2EDNB", "Overall": "4.0", "Content": "installation is without a doubt, EASY.  I have to get one for my rental and to make sure it works, i got one for my home where i have a fireplace.  i feel very safe to have it.  i bought another for my rental.", "Date": "August 17, 2013"}, {"Title": "Very good", "Author": "Timmie H Williams", "ReviewID": "R13U9Q3MJVWGWS", "Overall": "5.0", "Content": "This is a very nice item and we feel safer having it in the house. It looks good and seems to perform well.", "Date": "August 14, 2013"}, {"Title": "Good detector", "Author": "Brent J Maranzano", "ReviewID": "R21YQ5LW7O1SXS", "Overall": "4.0", "Content": "This detector replaced an old NightHawk model that started alarming all the time. The Night Hawk seemed to eat through batteries pretty quick even when plugged in, whereas this one doesn't seem to. The detector was easy to use, and appears to be working fine.  Good purchase for peace of mind.", "Date": "August 12, 2013"}, {"Title": "easy installation", "Author": "First contact", "ReviewID": "R2F70SC376T454", "Overall": "4.0", "Content": "Only tested to see if it operates.  Hopefully never have to use at any time now and in the future.", "Date": "August 6, 2013"}, {"Title": "Perfect!", "Author": "diane", "ReviewID": "RO1DQR9ORT2RA", "Overall": "5.0", "Content": "Works great, very convenient.  I liked that it is a plug in unit with a battery back up rather than being hard wired.", "Date": "August 5, 2013"}, {"Title": "Great CO Alarm", "Author": "Gilbert Garcia", "ReviewID": "R3C16W4NIWHT5V", "Overall": "5.0", "Content": "It is easy to test and use.  Small enough that it doesn't take up much space when plugged in.  Good value.", "Date": "August 4, 2013"}, {"Title": "Carbon Monoxide Plug-In Alarm with Battery ... First Alert", "Author": "JEFF SMITH \"Jeff Smith\"", "ReviewID": "R2ER0QI24MRG0P", "Overall": "4.0", "Content": "It was easy to install. It seems to be working and the light is blinking. Guess it will work out. Time will tell.", "Date": "August 3, 2013"}, {"Title": "First Alert CO615 Carbon Monoxide Alarm", "Author": "D. Ives \"Dave_I_WI\"", "ReviewID": "R1KQS5BMA112XQ", "Overall": "3.0", "Content": "Easy set up and installation. \"On light\" can only be seen by looking at it directly from the front. Weak alarm sound.", "Date": "July 27, 2013"}, {"Title": "Old unit was going off at 3 in the morning", "Author": "David Deweese", "ReviewID": "RR1KH358JX7YH", "Overall": "5.0", "Content": "Running well out of the box with no more early A.M. awakenings.  It should be good for years.  Thank you.", "Date": "July 25, 2013"}, {"Title": "Works well so far", "Author": "Dan Pollak", "ReviewID": "R1TRJQ6QSLLVVZ", "Overall": "4.0", "Content": "It was easy to mount in the bedroom hallway, and we have not had a bunch of false alarms.  We purchased after our son was born, and we became more safety concious.", "Date": "July 24, 2013"}, {"Title": "Great product", "Author": "Dave Gabriel, M.D.", "ReviewID": "RMZ2YNJJCG2NG", "Overall": "5.0", "Content": "Price was reasonable. Shipped very quickly. If one is careful there is no problem putting the battery in without breaking the cover. All four setup without difficulty.", "Date": "July 19, 2013"}, {"Title": "Funcational", "Author": "Dan", "ReviewID": "RZMMB34HYCEW9", "Overall": "4.0", "Content": "Given that this is needed when selling a home, and a generally good idea to have regardless, I'd recommend this brand. It does the job and simplicity here is goodness. For the price, value is very good and so is quality.", "Date": "July 17, 2013"}, {"Title": "Piece if mind", "Author": "cHRIS FIKKERT", "ReviewID": "R3KYHTIN4FZQSJ", "Overall": "4.0", "Content": "Not sure if it works or not, but like the fact that I can take it with me from one place to another.", "Date": "July 9, 2013"}, {"Title": "Good Product", "Author": "Josh Goshert", "ReviewID": "R2X4XRFQ921Q5W", "Overall": "5.0", "Content": "It does it's job, and was a good price.  I like the fact that it has a battery back up.", "Date": "July 7, 2013"}, {"Title": "Easy Does It", "Author": "J. Skelton", "ReviewID": "R3PDTMJ032FTH7", "Overall": "4.0", "Content": "Very straightforward to set up and put in service. It is just that simple. Nothing complicated and the importance is well documented", "Date": "July 7, 2013"}, {"Title": "This alarm is great!", "Author": "Barbara J Purkey \"BJP\"", "ReviewID": "R2HCBYJZOT3XMV", "Overall": "5.0", "Content": "I had another brand of alarm that was way more trouble and annoying.  This one is simple to use easy to operate and so far not annoying.", "Date": "July 3, 2013"}, {"Title": "Operates as advertised", "Author": "Rose De Azevedo \"The Rose\"", "ReviewID": "RZDSOF5C1MCIN", "Overall": "4.0", "Content": "I purchased this device on the recommendation of a home appraiser.  Although, it should be mounted high on an internal wall, I have it located centrally in a regular [floor] outlet.  Installing it high would entail having some electrical work done.", "Date": "June 30, 2013"}, {"Title": "Peace of Mind", "Author": "Bloostreakin'", "ReviewID": "RU8H50CRF82ZX", "Overall": "5.0", "Content": "I really like the peak level feature and the battery backup.  We put this in the hallway outside our daughter's rooms since we have gas heat and a gas water heater.  A must have!", "Date": "June 21, 2013"}, {"Title": "First Alert CO Alarm", "Author": "Bob", "ReviewID": "RG4MTLERVQLAP", "Overall": "4.0", "Content": "I wanted a simple device to perform a specific function and am pleased with this alarm.  I hope that I never have to see the full test, but in case I do, I have at least some confidence that the First Alert will respondl", "Date": "June 20, 2013"}, {"Title": "so far so good", "Author": "ira r.", "ReviewID": "R2BN9IDQP4OK5T", "Overall": "5.0", "Content": "no complaints so far as long as it works as it should. came complete and ready to go out of the package.", "Date": "June 20, 2013"}, {"Title": "So far so good!", "Author": "Pete Cappo", "ReviewID": "R2Z1MD3P6YKNSD", "Overall": "5.0", "Content": "I have a backup furnace for heat. The unit has not gone off, but seems to be working fine. Easy to read display. Thank you!!", "Date": "June 18, 2013"}, {"Title": "Great replacement for the NightHawk", "Author": "Herb", "ReviewID": "RBXZ8KPDWIG54", "Overall": "5.0", "Content": "You have to replace CO detectors every 7 years. This is a cheaper but just as capable version as the one it replaced.", "Date": "June 15, 2013"}, {"Title": "We all need one of these", "Author": "jnandidl", "ReviewID": "RPHK7PGK6EVG3", "Overall": "5.0", "Content": "The price was right and now we feel more safe, knowing we will be alerted of any carbon monoxide leaks.", "Date": "June 12, 2013"}, {"Title": "works well", "Author": "JANE", "ReviewID": "R1CJDYJDQVJ0I0", "Overall": "3.0", "Content": "tested out as advertised  hope it never alarms for real If an event occurs I will be very glad we have it installed", "Date": "May 31, 2013"}, {"Title": "This product can save your life!", "Author": "Ronald", "ReviewID": "R1F8MG7BXPF4VQ", "Overall": "5.0", "Content": "The carbon monoxide alarm is an important piece of equipment in any home! This item is especially critical because we just installed a portable generator in our home. The alarm will alert the family in case carbon monoxide enters the house during a black out where the generator will be put into use. The battery backup is important to support it's function during a blackout!", "Date": "May 30, 2013"}, {"Title": "Better Safe Than Sorry", "Author": "Dallas Denny", "ReviewID": "R1NZHZ69SWGJD2", "Overall": "4.0", "Content": "I have an ancient natural gas furnace in my living room. Even the people who are at its company of origin don't know how old it is, as they now make only air conditioners for travel trailers-- but their oldest employee though the 1940s. It works perfectly and combustion is in a seal chamber, but if that chamber is ever breached, I'll sure be glad there's a carbon monoxide detector just above.This unit works on AC power and has a battery backup. It was easy to set up.I would have liked more buttons so working the menus would have been easier, but it's not as if I'll need to mess with it again before it meets the end of its natural life.", "Date": "May 28, 2013"}, {"Title": "Good, low cost CO detector", "Author": "Daniel Koziczkowski", "ReviewID": "R39265N9KGVFW6", "Overall": "4.0", "Content": "This CO detector was very easy to install. You just plug it in. Its good for existing homes that aren't wired for CO detectors. It tells you the highest CO reading in an area on its display. You can reset the maximum reading it logs to see if there really is a CO problem in the area of your home where you have it installed. So far, it has had no false alarms.", "Date": "May 16, 2013"}, {"Title": "Works just fine", "Author": "Gary Stachowiak \"Gary\"", "ReviewID": "R3H257PLOSXG9O", "Overall": "5.0", "Content": "I had a first alert before and finally changed it after 15 years, not because it broke I just figured it was time. Seems to work just fine", "Date": "May 15, 2013"}, {"Title": "First Alert CO615 Carbon Monoxide detector", "Author": "Thomas S. Townsend", "ReviewID": "RKVLELY8A2MTR", "Overall": "5.0", "Content": "I like this unit because it is a plug-in unit with a battery backup.  You just install the backup batter, plug it in, and it quietly works in the background.  It's very simple to use, but it gives peace of mind!", "Date": "May 15, 2013"}, {"Title": "CO detector with battery backup", "Author": "Dale Daughenbaugh", "ReviewID": "R2YREL3R0BZBDB", "Overall": "5.0", "Content": "Very easy to use and check.  Detectors I've used in the past did not have the LED readout.  This is very easy to walk down the hall and see any messages.  I bought 3.", "Date": "May 14, 2013"}, {"Title": "Very Happy with it", "Author": "jbcats", "ReviewID": "R3G1J58S6WYY3V", "Overall": "5.0", "Content": "Easy to set up and get running.  The alarm is extremely loud so no worries about not hearing it.  Green light tells me it is up and running.", "Date": "May 13, 2013"}, {"Title": "Met Expectations", "Author": "Phil Ferber", "ReviewID": "R2K774LLTV2YUE", "Overall": "5.0", "Content": "Packaging easy to remove.  Seems to work well.  Batteries easy to install. Batteries seem to be lasting long.  I especially like the battery life display because, unlike my previous CO2 alarm, with this one I tell if I need to replace batteries when going on vacation.  My previous alarm terrified my cats several times when \"low battery\" went off for days!", "Date": "May 13, 2013"}, {"Title": "seems fine", "Author": "Barb \"person\"", "ReviewID": "R3CJ3K23DF0LZE", "Overall": "4.0", "Content": "It is what it is.  I hope it works properly but don't ever really wanna know if it works properly!!", "Date": "May 11, 2013"}, {"Title": "good choice", "Author": "Roberta Green \"lovesdogs\"", "ReviewID": "R1CZ99XSHP4Q6B", "Overall": "5.0", "Content": "I really wanted on with a digital readout, and that's what I got.  Hope I never need to test it with real carbon monoxide.", "Date": "May 10, 2013"}, {"Title": "You should be aware that finding a place that meets the install guidelines is like trying to find Noah's ark", "Author": "Michael A. McKinney", "ReviewID": "RGYPZRRMPCG2S", "Overall": "3.0", "Content": "A little tricky to find a good mounting location based on all of the guidance and restrictions but seems pretty good. Definitely a good price though. 2X as much at lowe's.", "Date": "May 6, 2013"}, {"Title": "Easy to use - PLUG IN", "Author": "lnyxl", "ReviewID": "R1ALF26MDPEGRD", "Overall": "5.0", "Content": "All you gotta do is open it, plug it in, and done. Perfect for the house - I bought 2 because I realized my home did not have any of these installed.", "Date": "May 6, 2013"}, {"Title": "Wonderful product.", "Author": "Steve", "ReviewID": "R20KIC5ZKKQ1L0", "Overall": "5.0", "Content": "I received this product on time and in good condition.  I needed a new one, so I ordered this one on line.  It works very well.  I would recommend this to my friends.", "Date": "May 6, 2013"}, {"Title": "Good Buy!", "Author": "BusyBeeMommy", "ReviewID": "R269O6TF3V1GKI", "Overall": "5.0", "Content": "Not only was the pricing of this pretty cheap, the display on it is fabulous. It lights up in a very light neon blue display, and the alarm sound on it is LOUD, but that's what you want right? I just ordered a second one of these this morning. I definitely feel safer now with this in my house", "Date": "May 4, 2013"}, {"Title": "A lighted option, if you want one", "Author": "madisontom \"Madisontom\"", "ReviewID": "R779PWNLY7FXF", "Overall": "5.0", "Content": "We purchased both the CO615 and CO605.  Both are excellent.  Buy this one if you want the slight light from the LED screen.", "Date": "May 3, 2013"}, {"Title": "CO2 Alarm", "Author": "tim johnson", "ReviewID": "RS9KDM5NS1C2Z", "Overall": "5.0", "Content": "Plugs right in and works great......now feel safe in my home against deadly odorless gas.Nice feature which measures highest recent CO2 level.", "Date": "May 2, 2013"}, {"Title": "Carbon Monoxide Plug in Alarm", "Author": "Glo", "ReviewID": "R19VMRB89N3OM3", "Overall": "5.0", "Content": "It seems to be very functional.  Plugged into the wall and hoping it does its job.  Has battery back up", "Date": "April 30, 2013"}, {"Title": "So far so good!", "Author": "Gloria", "ReviewID": "R1L8VF1TYQCFRH", "Overall": "5.0", "Content": "It's plugged in and ready to go off if ever needed! I've always wanted one as I have natural gas everything, including dryer.", "Date": "April 28, 2013"}, {"Title": "Works, but a bit ugly", "Author": "R. Jones", "ReviewID": "R36GHJP2YZU1L4", "Overall": "4.0", "Content": "I like this, and it seems to work (although I've not actually had it go off other than when I test it). The only downside is that it is a bit more obtrusive than I thought it would be. Not a huge deal when you consider what could happen without on in the house. I like the fact that it's powered by both electricity and a backup battery.", "Date": "April 25, 2013"}, {"Title": "Easy and Effective", "Author": "P. Gambardella \"ctlady410\"", "ReviewID": "R7PCC58EVRTGW", "Overall": "5.0", "Content": "Replaced 3 CO detectors with these. Very easy to install and I like the features included. This model had all the features I wanted including plug-in with battery backup, LED read out, and a great price. Highly recommend!", "Date": "April 21, 2013"}, {"Title": "GREAT product", "Author": "Belinda", "ReviewID": "R9DIDRY1E78LJ", "Overall": "5.0", "Content": "I love having the peace of mind that this operates on electric and has a battery back up!  It's easy to use and easy to read.  We have two...one upstairs and one downstairs.  When it comes to the safety of my family, I want only the best.", "Date": "April 21, 2013"}, {"Title": "Quality piece", "Author": "TNT", "ReviewID": "R2W8ASMR76OWXT", "Overall": "5.0", "Content": "This is a very nice unit, it is backlit and very sensitive, which with your life is a great thing, battery backup a plus. I even bought an extra to have.", "Date": "April 13, 2013"}, {"Title": "works great.  easy battery access", "Author": "R. D. Edwards \"coupon internet shopper\"", "ReviewID": "R18BMFNX097SGM", "Overall": "5.0", "Content": "I bought this as open box/new slightly cheaper than walmart's price and it was well worth it.  It does have a display though you need to push a button to activate.  It's installed in the bedroom so i don't need to check it daily.  In reading the reviews before purchasing, this first alert and kidde kn-copp-3 were the top models. I also own one of the kidde's, too.  I figure that one checks the other.  The kidde, with the always on display is in the hallway, just outside the bedrooms.  I check the display everytime I walk passed it.  I have owned the kidde for many years. works great, too.  I plan on purchasing another kidde soon as it's been more than 7 years now.  The battery is much harder to replace in the kidde than the first alert.  Time will tell if I have the same false positive problems as the other reviewers  but for now it's A-OK.", "Date": "April 12, 2013"}, {"Title": "so far so good", "Author": "BH", "ReviewID": "R5OX0DC6SN2SM", "Overall": "5.0", "Content": "So far so good.  can say much since its not good news if it goes off :-).  But easy to install and setup.", "Date": "April 12, 2013"}, {"Title": "It's a good product with a minor issue", "Author": "lica", "ReviewID": "R37A0I71AIND6J", "Overall": "4.0", "Content": "I like the design and the fact that it works as a plug-in device, with the battery back-up. The power plug can be separated from the unit which allowed me to install it higher from my outlets, and away from my dogs. The only thing I really don't like is the fact that the CO level is only displayed when you push a button, I would prefer if it was always in display.", "Date": "April 11, 2013"}, {"Title": "very good product", "Author": "Dion D Dodson", "ReviewID": "R3E2ZM6ITK8KZC", "Overall": "5.0", "Content": "easily readable display.  no false readings or alerts.  just plug it into any electrical outlet and you're up and running.", "Date": "April 10, 2013"}, {"Title": "CO Sensor", "Author": "Torcha", "ReviewID": "R16KXMJKSD0902", "Overall": "5.0", "Content": "This is a great unit at a great price.  Works as advertised and arrived quickly.  I highly recommend buying this unit.", "Date": "April 9, 2013"}, {"Title": "Great Product! Peace of mind!", "Author": "Stacey Ann Gentile", "ReviewID": "R60BN1S7RM4EM", "Overall": "5.0", "Content": "Love the product. Perfect for the house! Gives us a peace of mind with the kids and protecting our home.", "Date": "April 8, 2013"}, {"Title": "Carbon monoxide Alarm/plug-in", "Author": "Marie E, Erickson", "ReviewID": "RSXOHAUZ5PG3K", "Overall": "5.0", "Content": "It is easy to install, use and read in the very prominent position we put it in. With winter now over and furnace less used, will  have it there for next furnace season.", "Date": "April 6, 2013"}, {"Title": "carbon monoxide alarm", "Author": "J. Fischer", "ReviewID": "R25JGWVRQS8S4G", "Overall": "5.0", "Content": "Had it for a short time but seems to be working OK. Hope we never have to hear it \"beep\".", "Date": "April 6, 2013"}, {"Title": "works", "Author": "Betty Wan", "ReviewID": "R2JN88QA6U1G0J", "Overall": "5.0", "Content": "it works. easy to install and use. It's a carbon monoxide detector, so as long as it's effective, no complaints.", "Date": "April 6, 2013"}, {"Title": "Great value for the money", "Author": "Cheri", "ReviewID": "R1G0DT7KLLQYOF", "Overall": "4.0", "Content": "After researching many alarm's this seemed to be the best for the price.  After getting it we plugged it in and it is done.  No worries about changing the battery.", "Date": "April 5, 2013"}, {"Title": "CO alarm meets expectations", "Author": "Harold", "ReviewID": "RVZPDZK488G6Q", "Overall": "5.0", "Content": "So far no false alarms and the display reads zero.  False alarms had been a problem with another brand of alarm.", "Date": "April 5, 2013"}, {"Title": "Looks Good", "Author": "Karen L. Wise", "ReviewID": "R8MIKRPM43ZIU", "Overall": "5.0", "Content": "I won't know if it is doing well until there is a problem, then I will find out if it works....", "Date": "April 2, 2013"}, {"Title": "I Feel Safe with it in the House", "Author": "Jen", "ReviewID": "R1Y3NNI2OK3JBH", "Overall": "4.0", "Content": "I bought this product after I had my house insulated with foam spray. I was afraid of carbon monoxide levels reaching too high once my house was sealed up tight. Having this devise in my home gives me piece of mind.", "Date": "April 2, 2013"}, {"Title": "Carbon monoxide detector", "Author": "Amazon Customer", "ReviewID": "R1BLUEN8X2QLVB", "Overall": "5.0", "Content": "I love it. I tested it and it worked. Sound is loud so no one will sleep through alarm. Great  product.", "Date": "April 2, 2013"}, {"Title": "It works", "Author": "Jeff", "ReviewID": "R1ZG4E0NMVMP56", "Overall": "4.0", "Content": "Simple and easy to use.  It works.  So far it has given me peace of mind with no alerts.  I like it.", "Date": "March 27, 2013"}, {"Title": "Great CO monitor", "Author": "Howard W. Chou \"Pass by traveller\"", "ReviewID": "R33ZPQP5E8S4YX", "Overall": "5.0", "Content": "It is rated #1 by Consumer Report, so i brought is based on their recomandation.  Had it for a month, work as aspected.  One positive is this CO monitor uses two AA sise  batteries instead of the 9 volt square batteris of my old CO monitor.", "Date": "March 26, 2013"}, {"Title": "great product and excellent price", "Author": "jnaki", "ReviewID": "R1Y3NIIIN8V4HF", "Overall": "5.0", "Content": "hello,  when a house is put on the market and the \"inspector\" comes in to do his/her thing, these CO alarms must be in the house.  one story houses are easier as bedroom/living rooms are necessary.  a two story house takes a few more to be covered before escrow closes. plug in or simple battery powered it is your choice.  hopefully, they will keep us all out of danger.  first alert makes tons of house safety stuff and it is all excellent.  so, better safe than sorry.", "Date": "March 25, 2013"}, {"Title": "Bought as a replacement", "Author": "John", "ReviewID": "R2NHE9TSEXOICP", "Overall": "4.0", "Content": "I purchased this after my old Kidde was supposedly out of date (after five years).  This one could be difficult to read if it goes off when in a receptacle at floor level but otherwise no way to know anything about it.......I assume and hope it works accurately.", "Date": "March 24, 2013"}, {"Title": "Good detector", "Author": "Randall  Jirsa", "ReviewID": "R1KPD66F8QZM2I", "Overall": "4.0", "Content": "This seems to be a good detector. Just plug it in and you do not have to worry about replacing batteries so often.", "Date": "March 23, 2013"}, {"Title": "Easy to install", "Author": "Geoff", "ReviewID": "R2A0MIX2M5GD9M", "Overall": "4.0", "Content": "The First Alert CO615 is easy to install and operate. However,it would be nice if there were a way to test the CO sensor, aswell as the electronics.", "Date": "March 22, 2013"}, {"Title": "easy peasy", "Author": "B. White", "ReviewID": "R3F02IXRFJEGIR", "Overall": "4.0", "Content": "I had to get this for a home improvement rebate.  It's super simple.  I read the instructions but it's really not neccessary.  Just plug it in right out of the box.", "Date": "March 21, 2013"}, {"Title": "replaced our old one", "Author": "Virginia L. Arana \"ginnie lou\"", "ReviewID": "R3E26CVYR2UNMT", "Overall": "4.0", "Content": "The \"door\" on the front needs to be taped to keep it closed but not worth returning it, it works fine", "Date": "March 20, 2013"}, {"Title": "First Rate Detector", "Author": "B W Holbert", "ReviewID": "R11BBAM4RLQP1U", "Overall": "4.0", "Content": "Nice Carbon Monoxide Detector.  It needs to show current reading at all times, if so my rating would have been a 5.", "Date": "March 19, 2013"}, {"Title": "Good alarm", "Author": "Robb", "ReviewID": "R24X1U4Q98HITH", "Overall": "5.0", "Content": "Haven't has to use it yet. But it works very well. It says I have to write 9 more words.", "Date": "March 18, 2013"}, {"Title": "Plugs right in...", "Author": "Kafka45", "ReviewID": "R19FG2J291PCPO", "Overall": "5.0", "Content": "Easy to install batteries......  seems to be working.If you want a CONSTANT numerical read out on the screen.. don't get this model.The screen ONLY lights up in test mode, or when it is signaling a warning.My last Nighthawk CO reader had a 0 showing constantly....  I kinda liked that feature, but it really isn't necessary.and this one was cheaper, and it rates the highest from what I researched.", "Date": "March 17, 2013"}, {"Title": "carbon monoxide alert", "Author": "raymond wolfrom", "ReviewID": "R2M7Y5FS1LKLRJ", "Overall": "4.0", "Content": "exactly what i was looking for.easy to install,works well.the first alert gives me a feeling of security meets my fire marshals requirements", "Date": "March 16, 2013"}, {"Title": "Seems OK but", "Author": "N. Hyland", "ReviewID": "R18Z2MZJNB1KAF", "Overall": "4.0", "Content": "The battery door on this does not stay closed easily. This is a kind of common problem with First Alert BRK products like smoke and CO alarms.After years of mostly buying First Alert (either because they got high ratings or were cheap), I am now only buying Kidde smoke and CO alarm products, which seem to handle battery doors and other plastic parts better.I have also had a number of First Alert smoke alarms go bad on me at about the mid life point. They usually send a replacement but not after an annoying and long conversation with a customer rep. Kiddes just work and then you replace them at the end of life. 10 years for smoke, 7 years for CO.Write the date when you installed them on the back.", "Date": "March 14, 2013"}, {"Title": "Good replacement", "Author": "Debra L. Humphrey \"oliveoil76\"", "ReviewID": "R1A2SITICIXQFB", "Overall": "4.0", "Content": "Our old CO detectors went out and so we chose these as a replacement.  They are easy to use you just need an outlet.", "Date": "March 12, 2013"}, {"Title": "Easy to install", "Author": "LP", "ReviewID": "R3UZH5BWV8XSPO", "Overall": "5.0", "Content": "Reasonably priced and has worked fine. I have had none of the problems I saw on line. I hope it never goes off!,,", "Date": "March 9, 2013"}, {"Title": "Works as Expected", "Author": "Drac", "ReviewID": "R2LR8L3AOPRMF8", "Overall": "5.0", "Content": "It is a CO2 detector - so there is not much to say about it.  The power cord was barely long enough (there was an inch to spare) to reach from the wall outlet to the place higher up the wall where I mounted it (where my previous CO2 detector was). It sits there and works, I assume.  I do test it from time to time as the instructions suggest.  Other than that there is really not much to report.  They must have changed the \"manual\" and/or the unit itself because I had no issue with putting the batteries in first and having the unit sound an alarm before I could get it plugged in.  There was nothing in the instructions about this, either.  The date on the unit was about 2 months prior to my receiving it so there was no issue of \"old stock\" from Amazon as some reported.", "Date": "March 6, 2013"}, {"Title": "Great product and price", "Author": "BEAR", "ReviewID": "R7OQHTB72NP2E", "Overall": "5.0", "Content": "I received it quickly. It was very easy to set up and works great. Also, it was a great price.", "Date": "March 3, 2013"}, {"Title": "Carbon Mopnoxide protector", "Author": "Steve", "ReviewID": "R3IWQ4NBNC2SII", "Overall": "4.0", "Content": "Seems to be as described- Arrived on time and appears to do the job.  The price is very competitive and I would reccommend it to everyone!", "Date": "February 28, 2013"}, {"Title": "Problem free product", "Author": "Zdenek Krzak", "ReviewID": "R32PQR0P44KGY8", "Overall": "5.0", "Content": "It was easy to test and set up .So far I didn't have any false allarms so it seems to work properly.", "Date": "February 26, 2013"}, {"Title": "Easy to install, great price.", "Author": "suzanne longfellow", "ReviewID": "RW5THD03SPGOI", "Overall": "5.0", "Content": "After comparing pricing and safety features with other similar products, I found the First Alert to be the best value.", "Date": "February 26, 2013"}, {"Title": "Decent product.", "Author": "Betty", "ReviewID": "R2UBGK66RS2ODA", "Overall": "4.0", "Content": "Relatively easy to set up.  Battery door is a little touchy and hard to use, but unit is still in one piece and working fine.", "Date": "February 24, 2013"}, {"Title": "Good product", "Author": "R. F. W \"veiko\"", "ReviewID": "R2LTCQEP8Y9P67", "Overall": "4.0", "Content": "Works good so far, has a screen that shows the levels if any are present...You just plug it in to an outlet near a bedroom so you can hear it in case it goes off. Has battery back-up in case of power failure..Everyone should have a co detector in their home...", "Date": "February 22, 2013"}, {"Title": "Like it", "Author": "Karen Harris", "ReviewID": "RGW9FN3JJ1MVG", "Overall": "4.0", "Content": "Needed one for me and one for my daughtersnew home, we wanted  to be protected.like that is plugs into wall", "Date": "February 20, 2013"}, {"Title": "So far, so good", "Author": "N. Robinson \"Natasha\"", "ReviewID": "R24U5DRV1DOK9P", "Overall": "5.0", "Content": "Very easy to install and seems quite reliable.  We luckily haven't had the alarm go off, but it is very clear once you complete the test what to expect--and it's not a noise one can ignore. I sleep more soundly knowing this is protecting our lives.", "Date": "February 17, 2013"}, {"Title": "Good", "Author": "James H. Redick Jr. \"JR\"", "ReviewID": "R2VQF0KK8EA8GA", "Overall": "4.0", "Content": "It seems to work well,I have no problems with it so for. Hope I don't find out it doesn't work.", "Date": "February 16, 2013"}, {"Title": "Works well so far....", "Author": "Katie Rowland \"pinkmonkey\"", "ReviewID": "R3UC9ERIVI5B53", "Overall": "4.0", "Content": "I have had this item for about one month. I decided on this model due to reviews and consumer reports. The device is easy to use and test . I like the digital reading.", "Date": "February 15, 2013"}, {"Title": "I am pleased with this unit!", "Author": "Robert L. Owens", "ReviewID": "R1TKK8K2H2S3C1", "Overall": "4.0", "Content": "I like this product because: a). It is attractive and compact. b). It is available for use as a plug-in to any wall socket and/or has an available wall socket (extension) cord should the user care to install it in another location. c). It has a loud identifying alarm sound if and when needed. d). This product has been use in my home for the past 60 days, been operating perfectly with no apparent probelms. e). I have installed two of these alarms; one in my homes main floor bedroom and one in my basement family room that I am perfectly satisfied with.", "Date": "February 15, 2013"}, {"Title": "Required by law in California", "Author": "CC", "ReviewID": "R7DYQ9VBX1QS4", "Overall": "4.0", "Content": "I ordered 22 of these for apartments and have no complaints. Hopefully they will never go off but tested out well when installed! I have tried other brands (Kidde) and they misfired and woke people up in the middle of the night.", "Date": "February 15, 2013"}, {"Title": "Just what I wanted", "Author": "G. T. SHIRAISHI", "ReviewID": "R3TRA8BT99POZ6", "Overall": "4.0", "Content": "Working great so far.  Replaced a Kidde alarm because it was acting up.  I like the plug rotation feature in the back which enable you to plug it into a horizontal or vertical outlet.", "Date": "February 13, 2013"}, {"Title": "Highly rated but never know unless a dreaded emergency occurs", "Author": "SIslander \"open roader\"", "ReviewID": "R21TLZ9QL0J1T7", "Overall": "5.0", "Content": "Bought this due to a high rating in Consumer Reports, to relace a 10 year old model.Recommend a good CO2 detector for everyone on at least the bedroom level of your house or apartment!", "Date": "February 9, 2013"}, {"Title": "Great Carbon Monoxide Alarm", "Author": "linda six", "ReviewID": "R1ORULWG0F7ZXP", "Overall": "5.0", "Content": "We have used this plugged in our kitchen.  Works great and easily.  Simple to use.  Great to have it in our home to make sure everything is good.", "Date": "February 6, 2013"}, {"Title": "Peice of mind", "Author": "slow reader", "ReviewID": "R29U4XMQ2584P0", "Overall": "5.0", "Content": "Ordered 3 of them. Have a cabin in the woods with wooden fire stove. Installed all three of them in 5 minutes in each bedroom.", "Date": "February 5, 2013"}, {"Title": "Does the job!", "Author": "E. Lewis \"Book lover\"", "ReviewID": "R1ICZXY6J2DI7A", "Overall": "5.0", "Content": "I  found this very easy to install and I especially liked the design as it doesn't take up the entire outlet..", "Date": "February 5, 2013"}, {"Title": "Good Product", "Author": "Andy", "ReviewID": "R1HJLK3TULQR1R", "Overall": "4.0", "Content": "Very easy to install...you just put the (backup) batteries in the unit, then plug the unit into a wall outlet.  I bought one for each floor of my home.", "Date": "February 5, 2013"}, {"Title": "Easy to Install; Moderately Loud But Piercing Sound; Awkward Testing Button", "Author": "Lynne E. \"Lynne E.\"", "ReviewID": "R1JBJPMW91VKQE", "Overall": "4.0", "Content": "This FIRST ALERT CARBON MONOXIDE PLUG-IN ALARM is easy to set up.  You insert the two AA batteries for backup power during electrical outages, then plug the device into an unswitched electrical outlet.  That's it.A continuous green light tells you the unit is on AC power; a blinking green light tells you it's on backup power. The instruction sheet explains how to test the unit when you first install it, and advises weekly testing after that.  To start the test, you press and hold a half-button on the left (below the display).  This activates the alarm:  the display cycles through the possible CO levels, and the horn sounds a moderately loud but piercing alarm.  To turn the alarm off, you press and hold the left half-button again.  Testing the alarm usually takes me a couple of tries, because the half-button must be pressed quite firmly.There is another half-button on the right (below the display), that you press for a display of the highest CO level recorded by the unit.  My unit is still displaying \"0\" after about five weeks, which I assume is correct, because there's no reason to think the unit isn't functioning properly.  The CO level display also includes an icon that tells how much charge is left in the backup batteries.This seems like a good, inexpensive, no-nonsense CO monitor, and I trust the First Alert brand.  However, because the test button is slightly awkward to use, I rate this product at 4 stars (\"I like it\" on the official Amazon scale).", "Date": "February 4, 2013"}, {"Title": "Works great", "Author": "Mister Roboto \"MrROBOTO\"", "ReviewID": "R12M6QC4IUOX8U", "Overall": "5.0", "Content": "Bought this partly because of the law and my own paranoia.Works great.  Simple setup, batteries included.An slight annoyance with how it's designed. It's more visually and acoustically stimulating when CO2 is near lethal levels, but during normal standby position, the screen just shows the battery level.  I wish the screen would say something reassuring or positive when there is no threat detected as opposed to negative during a threat.", "Date": "February 3, 2013"}, {"Title": "Easy to read", "Author": "Stacy R", "ReviewID": "R2F65ENMX0MSUV", "Overall": "4.0", "Content": "I keep three carbon monoxide detectors in my home at any one time, one where the heat comes into the house (this one saved our lives when the heater had a rusted piece, letting carbon monoxide into the home), one in the bedroom above the garage, and one near (not in) the kitchen/garage.  This is the first time with this particular unit.  I like that it works on electricity, but has a battery backup, and hopefully it will last several years.", "Date": "February 1, 2013"}, {"Title": "works as it should...", "Author": "KJ", "ReviewID": "R3SBJZR6HBKCXB", "Overall": "4.0", "Content": "... I think. It hasn't alerted us though it works when I test it. Reading is always at 0 which I guess is good.", "Date": "January 31, 2013"}, {"Title": "Seems good, but haven't had a CO leak to know", "Author": "Zippy", "ReviewID": "R3AJOY6IUH77S2", "Overall": "5.0", "Content": "The construction and features are good. Hope I never have a CO leak to see if they work, however. They are a little big and boxy for plugging into a receptacle so it may get in the way of furniture. But it shouldn't be too hard for people to find another receptacle with more clearance.", "Date": "January 31, 2013"}, {"Title": "Carbon Monoxide detector", "Author": "Motionjunkie \"Motionjunkie\"", "ReviewID": "R6LJ0HTCABTV", "Overall": "4.0", "Content": "I really can't comment on this product  because I don't know enough about these detectors to give an accurate review. Plus, I have nothing to compare it to. This is a first for me, and hopefully it works as stated in the literature. So I give it a 4 since I love that it plugs into the wall.", "Date": "January 31, 2013"}, {"Title": "It Does The Job", "Author": "Robert A. Lipman", "ReviewID": "R1COR1OHEN2KZU", "Overall": "4.0", "Content": "It's been in operation for several months without a glitch;  I assume that it's working and as such, it does the job.", "Date": "January 31, 2013"}, {"Title": "Hoping for 7 years of silence!", "Author": "dm8711", "ReviewID": "R1XLVGPKR8W3NT", "Overall": "5.0", "Content": "Bought two of these and got them quick. Plugged them in and tested them. Now I hope to never hear them unless I push the test button.  After owning the Kidde combo gas monoxide detectors I have one suggestion.......get yourself a Sharpie and scribble the date you installed it on the back. I had my Kidde detectors 11 years without realizing it !  My how time flies. The CO615 has an end of life warning that should help, but the date will let you know if it goes off way too early, or even way too late.  There is no manufacture date, and the packaging copyright is 2010 (which I know doesn't mean much). The manual says the end of life timer starts upon \"installation\", so we'll see. Time will tell I guess. Anyway, everything works like the manual described. I'm happy.", "Date": "January 30, 2013"}, {"Title": "EXCELLENT RATING", "Author": "CA", "ReviewID": "R29SNM4MRAQ0GX", "Overall": "5.0", "Content": "Shipping was prompt !  Am very happy with the alarm.  It is an excellentproduct and definitely meets my requirements for a carbon monoxidealarm which provides accurate detection of carbon monoxide and iseasily heard.", "Date": "January 30, 2013"}, {"Title": "works fine so far", "Author": "Kathy Lopez", "ReviewID": "R3N83PD4HYDQME", "Overall": "5.0", "Content": "works fine so far, quite when not in use, loud when it is  flush to wall, small, would recommend to a friend", "Date": "January 29, 2013"}, {"Title": "First Alert Carbon Monoxide", "Author": "NC Regular Lady \"politically incorrect rules\"", "ReviewID": "R2MQQ2BMW0WRON", "Overall": "4.0", "Content": "I hope to never put it to the real test but the tester button is very loud.  It seems to do the job fine.", "Date": "January 29, 2013"}, {"Title": "I am resigned to mandatory planned obsolescence.", "Author": "Jeffrey P. Silverstone \"Jeffrey\"", "ReviewID": "R16258QOWS1I2J", "Overall": "4.0", "Content": "I guess all CO alarms are programmed expire after 7 years. First Alert is a bit more up front about it than the competition. I wish we could just replace part of these units rather than the whole thing.", "Date": "January 28, 2013"}, {"Title": "Nice monitor.", "Author": "P. Heitkotter", "ReviewID": "R39W5G9UV2PBLF", "Overall": "5.0", "Content": "I would highly recommend this monitor. The digital readout of co levels is easy to use and is reassuring that it actually gives a number vs an led light.", "Date": "January 27, 2013"}, {"Title": "No complaints", "Author": "Wally", "ReviewID": "R33YFIH93T9E8G", "Overall": "4.0", "Content": "Items came on time in god condition. Easy to install. Display is not lit, its expected to display co level when co is present only. So far no alert. Hopefully it will indicate co level when it is present.I think, it is worth the money I paid. Yes I will recommend it.", "Date": "January 27, 2013"}, {"Title": "First Alert", "Author": "Ronald S", "ReviewID": "R29LILQBY0GK5C", "Overall": "5.0", "Content": "We found that this First Alert Carbon Monoxide Detector/Alarm works as advertised, and is a good backup for a plug-in unit.  The order was delivered early, and we will purchase from the seller again.", "Date": "January 24, 2013"}, {"Title": "Great Product!", "Author": "Cobra79", "ReviewID": "R2U4X06WMS3I4H", "Overall": "5.0", "Content": "Bought two of these for a rental house we own.  It gives us peace of mind and also our tenants having these detectors in the house.  Like that they plug in and also have a battery backup.", "Date": "January 23, 2013"}, {"Title": "The Gift of Life!", "Author": "Cindy Bell", "ReviewID": "R13LEK0EW2VOKE", "Overall": "5.0", "Content": "Bought 6 of these for our home and to give as gifts to our grown children this Christmas, after learning that a local family died of carbon monoxide poisoning. Was very easy to install.", "Date": "January 20, 2013"}, {"Title": "This is great, hope it never has to go off!", "Author": "Dakota Bailey \"Dakota\"", "ReviewID": "R3SYTIIGO6EDEZ", "Overall": "5.0", "Content": "We bought this and put it right outside our bedroom.  Our furnace is now 14 years old and we don't want to become a statistic.  I would recommend that everyone get one of these!", "Date": "January 20, 2013"}, {"Title": "Nice to have", "Author": "matthew t cassity", "ReviewID": "R14BO6TUZVZ88I", "Overall": "5.0", "Content": "We have had some faulty carbon monoxide alarms in our house.  It has been very nice to have this as a back up to a system we don't trust.", "Date": "January 19, 2013"}, {"Title": "easy to hookup and does the job", "Author": "meetha", "ReviewID": "R1VM7HQHS78CCH", "Overall": "5.0", "Content": "there's nothing not to like. its affordable , easy to use and does the job. plug and play straight from the book to the outlet and its good to go.", "Date": "January 16, 2013"}, {"Title": "First Alert C0615 Corbon Monoxide Alert", "Author": "Paul wallimann", "ReviewID": "R3TQORHHC2O77U", "Overall": "5.0", "Content": "This unit is more compact than my old one and I like the battery backup feature.  It even came with batteries and is easy to use.I would buy another one to install in my basement. Great investment for peace of mind.", "Date": "January 16, 2013"}, {"Title": "Excellent", "Author": "Steve", "ReviewID": "R3EKJ5H3AIJRZM", "Overall": "5.0", "Content": "This product shipped quickly and was easy to install. It came with good directions. I would recommend this to anyone.", "Date": "January 14, 2013"}, {"Title": "c.o. monitor", "Author": "Janice M. Beam", "ReviewID": "R19FJNW1Q1AER0", "Overall": "5.0", "Content": "very easy to plug in and your ready to go. mounting is easy on an outlet or remotely. gives a continous readout.", "Date": "January 13, 2013"}, {"Title": "sio far so good", "Author": "Genochick", "ReviewID": "R3GMMCCF6ENI4", "Overall": "5.0", "Content": "bought this becuase our old ones(7 yearsold - same brand) needed to be replaced.  so far they are doing the job!  hopefully these last at least another 7 years if not more", "Date": "January 10, 2013"}, {"Title": "Easy to install and good value", "Author": "sam saran", "ReviewID": "R2EV1ZO1CBNLXS", "Overall": "5.0", "Content": "Took only a minute to install and tests perfectly, without a hitch. I bought 6 of these, for my house and rental properties I own. This is superior to combined smoke/carbon monoxide detectors since carbon monoxide comes from the floor of the room, not the top.", "Date": "January 7, 2013"}, {"Title": "Best buy at best price", "Author": "Mr. J. R. T. Lloyd \"JRTL\"", "ReviewID": "R3JJ7NE8O7H56N", "Overall": "5.0", "Content": "I've installed this in my living room so I can safely use the fireplace during winter. It got best buys on Consumer Reports and that's why I chose it. Amazon's price was better than Home Depot or Lowe's.", "Date": "January 7, 2013"}, {"Title": "Great product easy to use", "Author": "Mark Gossett", "ReviewID": "RBE2WS6U3MSRK", "Overall": "5.0", "Content": "Ease of use, just out of package install battery and plug in, its just that easy, would reccommend to anyone", "Date": "January 6, 2013"}, {"Title": "Carbon Mono alarm", "Author": "J. Bernabe", "ReviewID": "R3BOR1G4G69Z6E", "Overall": "5.0", "Content": "Loo at it daily, with NO issues. A confidence builder when the levels are always the same A great product", "Date": "January 6, 2013"}, {"Title": "So far so good.", "Author": "Tina Oertle", "ReviewID": "R3FTPW4Q8A9DZY", "Overall": "4.0", "Content": "I do wish the cord was about three feet longer. I feel better having this CO615 Carbon Monoxide Plug-In monitor with a battery backup.", "Date": "January 5, 2013"}, {"Title": "very easy to setup.  great value.", "Author": "Joe A \"pap\"", "ReviewID": "RCQF0FHIHNOY6", "Overall": "4.0", "Content": "very easy to install.  i like the battery backup feature.  the rotating feature seems like it would be useful too.", "Date": "January 5, 2013"}, {"Title": "Carbon monoxide review.", "Author": "woodworker", "ReviewID": "R39E7II9XIIK5", "Overall": "4.0", "Content": "I feel much safer with a couple of these in the house, along with several smoke alarms.I think it is a good value.", "Date": "January 3, 2013"}, {"Title": "Easy setup", "Author": "sean", "ReviewID": "R2BK29QU5XXPCN", "Overall": "4.0", "Content": "Only took two minutes to get this from the box to the wall.  Very easy setup and displays.  I really like first alert products.", "Date": "January 2, 2013"}, {"Title": "So Far so Good", "Author": "KB_Albany", "ReviewID": "R1FWFR1O726I4V", "Overall": "4.0", "Content": "Its hard to effectively rate a monitor like this without actually having it detect something correctly.I will say it has been working without any problems for 3+ years. No false alarms and no issues.", "Date": "January 1, 2013"}, {"Title": "Easy install, seems to work well.", "Author": "RimasP", "ReviewID": "RJZYT0VR40ZJ4", "Overall": "5.0", "Content": "Installs easily, seems to work well.  w w w w w w w w w w w w w w w", "Date": "December 28, 2012"}, {"Title": "Has all the features I expected.", "Author": "Underdog", "ReviewID": "RPPSUPP2XPUV4", "Overall": "5.0", "Content": "This has everything as advertised.  Could be improved if offered as a onelink product.  Easily moved from room to room.", "Date": "December 28, 2012"}, {"Title": "hard to rate  - but seems fine", "Author": "fried003", "ReviewID": "RF9MZNE3PVD4B", "Overall": "4.0", "Content": "It doesn't beeep or whistle - I assume it's doing the job.  I don't have any Carbon Monoxide in my house, so I have to trust it.", "Date": "December 27, 2012"}, {"Title": "Long overdue", "Author": "J. Rader", "ReviewID": "R39B6EXHNHCZJH", "Overall": "5.0", "Content": "We were long overdue to get another after our previous carbon monoxide detector failed.  I like the digital display on this one as it lets me check the highest level for the previous 24 hours.", "Date": "December 27, 2012"}, {"Title": "Works very well", "Author": "Butch", "ReviewID": "R1MP8RT8OZBWK9", "Overall": "5.0", "Content": "Bought this product to replace and older unit.  This product was exactly as described and performs perfectly. I would recommend this product.", "Date": "December 26, 2012"}, {"Title": "Fine for smaller places", "Author": "Anthony F. Guglielmi, Jr.", "ReviewID": "R1MJCO7EQNRD98", "Overall": "4.0", "Content": "Purchased 2 new CO615 Carb Monox plug in alarms to pair with new Kidde PI2010 Dual (smoke) sensors. Works well in my 2 bdrm condo. CO level indicator is a nice feature. This combination of (2) sensors makes me feel that I'm well protected. Reco'd by Consumer Reports.", "Date": "December 24, 2012"}, {"Title": "Randomly displays 92-122 PPM but alarm doesn't sound.", "Author": "Hiperf2007", "ReviewID": "R30IWHRZY08US4", "Overall": "3.0", "Content": "CO should be displayed without needing to press a button.  We found after a week of use that this would display 92-122PPM with no alarm.  The next day might display 0.  Pushing the test button gets the alarm firing.  If the unit is not defective we believe it has something to do with an attached garage.  This thing is plugged in about 6 feet away from the garage entry door.  Its possible that after the car is started and we get done closing all the doors that some drifts in and the alarm sounds for awhile.  We might not be home to hear it.  That is my only thought on the topic.", "Date": "December 21, 2012"}, {"Title": "Works Great", "Author": "Marc", "ReviewID": "R1OW4IHV665FD0", "Overall": "5.0", "Content": "This product was a great buy.  It works great, easy to install, and gives you the peace of mind knowing that you and your family is protected.", "Date": "December 20, 2012"}, {"Title": "Don't be without one", "Author": "Juanita", "ReviewID": "R3LPP50LWF2NRG", "Overall": "5.0", "Content": "Simple to install, just plug it in.  The batteries go under the LED in front of the unit.  You open the battery compartment by pulling the cover out and down, from the top front. I recommend this product.  Carbon Monoxide can kill you, you won't see it coming, hear or smell it.", "Date": "December 19, 2012"}, {"Title": "Perfect", "Author": "Jbpage67", "ReviewID": "RPIRXA6W207P1", "Overall": "5.0", "Content": "This is just what I was looking for, with a battery back up you don't have to worry. Easy to set up and now I feel safer.", "Date": "December 18, 2012"}, {"Title": "First Alert Review", "Author": "David Ryan", "ReviewID": "R1KCN15ADMSOE8", "Overall": "4.0", "Content": "Easy to install.  Instructions were clear and easy to understand.  The cost of the product was also a  positive consideration.", "Date": "December 18, 2012"}, {"Title": "Easy to install and works well", "Author": "Mr Fixit", "ReviewID": "R201BX2UEYL8RU", "Overall": "5.0", "Content": "This product was easy to install and seems to be working well so far.It was also rated very high in consumer reports which is why I purchased it.", "Date": "December 18, 2012"}, {"Title": "Very Easy To Use", "Author": "J. White", "ReviewID": "RJ721UI04HJ0R", "Overall": "5.0", "Content": "Yes, it is easy to use.  You just plug it into the wall socket and walk away.  I don't know how effective it will be for alerting me to the presence of carbon monoxide.  I have to assume it works.  I only hope I live to tell about it.Jim", "Date": "December 17, 2012"}, {"Title": "Now I feel more secure", "Author": "NJM45", "ReviewID": "RFFO94CT7697J", "Overall": "5.0", "Content": "After researching the techno,logy for this dtector, It is the right choice for my home.Easy to setup and test.", "Date": "December 14, 2012"}, {"Title": "Good item.", "Author": "ASCipriano", "ReviewID": "R29BKLDKMYBGRC", "Overall": "4.0", "Content": "Picked this up to detect any carbon monoxide within the house.  So far, we're still alive so I guess it's working correctly!", "Date": "December 14, 2012"}, {"Title": "Feel so much safer", "Author": "Hannah Kane", "ReviewID": "R1BFRE943NPQT8", "Overall": "5.0", "Content": "This product is everything I expected, and easy to use. Many CO detectors only plug in, but I sleep easier at night with the battery backup.", "Date": "December 13, 2012"}, {"Title": "necessary purchase", "Author": "Smart shopper", "ReviewID": "R22AHZLNXP7YVV", "Overall": "5.0", "Content": "Own one myself and decided to buy one for each of my children's homes as it is now a Calif. law.", "Date": "December 13, 2012"}, {"Title": "a must have", "Author": "J. Dubberly", "ReviewID": "R2TCXA3ZFS896W", "Overall": "5.0", "Content": "I like how it has a display to let you know what is going on instead of just beeping. Been using it over a month without issues like false alarms or anything like that. Great that it plugs in and has a battery for backup. You can even mount it on the wall if you want but be aware you will have a cord hanging.", "Date": "December 12, 2012"}, {"Title": "So far, no issues.", "Author": "Mark \"Snowy\"", "ReviewID": "R2UNDEMY3SBX9I", "Overall": "5.0", "Content": "I give this unit 5 stars simply based on the fact that it seems to be working properly so far. Easily installed, easy to follow instructions. Of course there is no way to tell how well the unit is actually working until there is a dangerous CO level in our home. So far, thankfully, that has not happened.So... so far, so good.", "Date": "December 6, 2012"}, {"Title": "Consumer Reports Recommended", "Author": "Gbox", "ReviewID": "R3T8607GMYDUNY", "Overall": "5.0", "Content": "Great price and highly recommened by Consumer Reports. Easier to find on line and have it mailed home instead of running around to different stores looking for it and a good price.", "Date": "December 5, 2012"}, {"Title": "Works as advertised!", "Author": "Cheftonio", "ReviewID": "R1JVG8987X0GS8", "Overall": "5.0", "Content": "First, I was able to use it in 220volts. Second, it works pretty well as advertised. There was one time that the car was left running in the garage and the alarm sounded! We immediately ventilated the living room and the levels went down gradually. This device can save lives! I don't know though if it can detect gas leaks. Never tested and don't want to test it myself. lol", "Date": "December 4, 2012"}, {"Title": "Perfect", "Author": "Topnish \"Topnish\"", "ReviewID": "R2ONHB18UWQJ7E", "Overall": "4.0", "Content": "My Refi company required this and I selected the brand and model after consulting several consumer advice sites.  They were right.  It seems to be well built and meets all of my expectations and requirements.  I'd definitely by this again if I were to need it.", "Date": "December 4, 2012"}, {"Title": ". I purchase the  the detectors because they were rated well on amazon.  JD", "Author": "JD", "ReviewID": "R2T2NW0MGQP4HD", "Overall": "5.0", "Content": "This detctor had good reviews on Amazon. I purchased two of them as we have a long ranch style home with a furnace at one end of the house in the basement,  a gas dryer, and gas fireplace at the other end of the home. I really don't know much about these things, but we have had no warnings of carbon monoxide. I purchase the  the detectors because they were rated well on amazon.  JD", "Date": "December 3, 2012"}, {"Title": "Great Product, small and convenient", "Author": "M. Hofkes \"nissanrules\"", "ReviewID": "R2TQF8SRS82V8P", "Overall": "5.0", "Content": "Detector easy to assemble, instructions are easy to follow, and they have some good long term safety recommendations to keep in mind.  Product size and shape are well suited for any location within a home.", "Date": "November 29, 2012"}, {"Title": "More fun than you'd think", "Author": "pdxbrit", "ReviewID": "R3D0I8BOBEP5I8", "Overall": "5.0", "Content": "Ordered two of these carbon monoxide detectors after getting our wood stove installed and working. When the Bright Starts Tummy Time Prop and Play Mat, Tiny Turtle and Friends arrived in its place I was skeptical it would provide the protection against carbon monoxide for my family that I really wanted. I have to say though, that after an afternoon of play on the Bright Starts Tummy Time Prop and Play Mat, Tiny Turtle and Friends, even though it was a little small for my 200lbs, I felt so much more secure and relaxed.", "Date": "November 28, 2012"}, {"Title": "Good so far", "Author": "JDB", "ReviewID": "RKCJSODY57XPE", "Overall": "4.0", "Content": "Very fast shipping and easy to set up. My only complaint is there should be a chart to tell you what levels are high and lo and level should constantly display", "Date": "November 27, 2012"}, {"Title": "first alert", "Author": "Helen Keller", "ReviewID": "R1XBKQSWUFNUD1", "Overall": "5.0", "Content": "this is a great brand CO detector and also has a battery backup included; everyone should have at least one; am giving this to my daughter for her apartment", "Date": "November 27, 2012"}, {"Title": "Carbon Monoxide Alarm", "Author": "Joel Recinos", "ReviewID": "R3OFOQFBEC8S3V", "Overall": "4.0", "Content": "Hard to tell if the product works.  It was easy to set up and working  - green light is always on and make a noise when you press it.", "Date": "November 25, 2012"}, {"Title": "Seems to be working.", "Author": "Darren_RX", "ReviewID": "R3J3SHRGJSGX2K", "Overall": "4.0", "Content": "Bought a couple of these to replace a pair of older units.  Can't really tell if they work or not but they seem to be well made and test correctly when the button is pushed.", "Date": "November 24, 2012"}, {"Title": "Quick and easy to set up", "Author": "Raptor007", "ReviewID": "R2F5SRO53KK5VH", "Overall": "4.0", "Content": "Came with batteries ready to go and you simply plug it in and if you have a power outage the batteries take over.  Carbon monoxide is a silent killer and this is a critical item every home should have.", "Date": "November 23, 2012"}, {"Title": "Your Life is Worth it", "Author": "WCR", "ReviewID": "RMWQQQGEJ9R8T", "Overall": "5.0", "Content": "We have a hard wired Carbon Monoxide unit connected with our security system. Our electrician sujested we should also get this unit for infront of each bedroom. We had him wire in an outlets and we feel much better. It does not take long time for carbon monoxide fumes to effect your thinking. Small price for a childs life or even your own.", "Date": "November 22, 2012"}, {"Title": "Great CO alarm", "Author": "Ann T. Reed", "ReviewID": "R27DAYJMXCV36", "Overall": "5.0", "Content": "This is a great item to have in your home. It not only runs on electricity but has a battery backup. Also has a monitor which is easy to read.", "Date": "November 20, 2012"}, {"Title": "Most recommended", "Author": "Susan", "ReviewID": "RC1KKWZCJ3JVU", "Overall": "4.0", "Content": "Our old alarm went off due to a carbon monoxide from the water heater.  The fire dept. said to replace any alarm that goes off, so we did some research.  This type/style of alarm was most recommended, so now we have 3 plugged in around the house.", "Date": "November 18, 2012"}, {"Title": "life saver", "Author": "O. Ali \"OHA\"", "ReviewID": "R2VWSMC450KPL2", "Overall": "5.0", "Content": "Features - The product is very well packaged and the directions for use were exteremelty easy to follow1) Functions on AC with a battery backup - 2 AAs2) Batteries do come with the package3) Silenced with a remote. - press the volume or channel button for 5 seconds - XINTEX SMOKE & FIRE ALARM FOR BOATS AND RV'S WITH 9V BAT", "Date": "November 6, 2012"}, {"Title": "First Alert Monoxide Alarm", "Author": "J. Powell", "ReviewID": "R385VOQLC14VZM", "Overall": "4.0", "Content": "Bought it because the rating is good. So far, I'm pleased. Very easy to install. And as warned, if it is placed in or  near a kitchen with a gas range, the alarm will go off constantly. Place it in area that is at least 25-30 feet away.", "Date": "September 17, 2012"}, {"Title": "complete satisfaction", "Author": "monga", "ReviewID": "RN50UT8VZKYLQ", "Overall": "5.0", "Content": "We were looking to replace our carbon monoxide tester with something compact and reliable. This product fit the bill. It is plug-in and battery backup and and has an easy to read digital display. Amazon had a good description of the product and delivered it quickly and at no charge.", "Date": "May 30, 2012"}, {"Title": "CO detector very easy to use", "Author": "DadRip \"BookReader from CT\"", "ReviewID": "R2OFCQIR4ZXWOD", "Overall": "5.0", "Content": "The First Alert CO615 Carbon Monoxide detector is very easy to set up. Just insert the included batteries and plug it in. It has a memory that remembers the highest level of CO it detects. Just press a button and read the display. Consumer Reports says this is a \"Best Buy\". Install one near your furnace, attached garage, and sleeping areas. Then rest assured you are being monitored for carbon monoxide concerns.", "Date": "May 11, 2012"}, {"Title": "Doing it's job.....I hope!!", "Author": "BURBERRY GIRL", "ReviewID": "R18QELR530ZXQ0", "Overall": "4.0", "Content": "I bought two of these units. I had a very expensive nighthawk which saw it's last day! I have a total of three co units. I like the option of the corded plug in case one would need that. It also came with name brand batteries. The overall design is fine. The size of the unit is not cumbersome. These are must have items, period.", "Date": "March 31, 2012"}, {"Title": "Great CO monitor and good price point", "Author": "JonathanL", "ReviewID": "R20K576B455EWP", "Overall": "4.0", "Content": "This arrived as promised and was packaged well.  Price point beat the B&M; stores selling this near me, even the big box stores.  This worked out well and the CO monitor has been rock steady in operation.  Replaced an old monitor that started giving me false positive alarms for no reason.", "Date": "March 28, 2012"}, {"Title": "Easy to install", "Author": "Paula Hilton", "ReviewID": "R2EEEYKR9YFHV9", "Overall": "5.0", "Content": "I ordered two of these alarms - one for upstairs and one for downstairs.  They arrived promptly and were easy to install.  After putting in the batteries (that came with the units) all I had to do was decide where to plug them in.  The display is easy to read, with a green indicator light so you know it's activated.  The test siren was loud and easily recognizable as \"something is wrong!\"  Hopefully the alarm will never go off in \"real life\" but if it does, we're ready with these devices in place.", "Date": "March 28, 2012"}, {"Title": "No complaints", "Author": "Gordon Alley", "ReviewID": "R3BHTUYBFSW14I", "Overall": "5.0", "Content": "I receive the alarm within the promised time. It appears to be operating properly.I decided to replace my old CO alarm during my annual furnace inspection, when the technician pointed out that it should be replaced after 5 years of use.", "Date": "March 20, 2012"}, {"Title": "good", "Author": "thick madame", "ReviewID": "R3FBAKW9HJD28V", "Overall": "5.0", "Content": "I have not had any problems with this product.  Works well so far. Plugs in in my hall without problems.", "Date": "March 20, 2012"}, {"Title": "Easy install", "Author": "Jake", "ReviewID": "R2EYNDG0XNNIPO", "Overall": "5.0", "Content": "After realizing that one of my existing carbon detectors was out of date, I selected this First Alert model based on the reviews of previous buyers.  Upon receipt I found it easy to setup and install.  My only (subjective) complaint is that I found the unit somewhat bigger than I would like it to be but other than that, no problem.", "Date": "March 9, 2012"}, {"Title": "Good value and product", "Author": "Terrence Potts \"SJSU Football\"", "ReviewID": "RU3F90ZYBP4KR", "Overall": "5.0", "Content": "Bought 5 of these for rental properties and our primary residence. Easy to install and test.Complies with California new law on rental property CO2 alarms.", "Date": "February 12, 2012"}, {"Title": "appears to be good product", "Author": "charlieb", "ReviewID": "R3HKL0X2Q3JNXZ", "Overall": "5.0", "Content": "fast shipping. product appears to be well made. very easy to set up. Hope it never has to warn me of a problem, but feel safer with it.", "Date": "February 9, 2012"}, {"Title": "First Alert Carbon Monoxide Alarm", "Author": "Zoe", "ReviewID": "R25OMMTDEBOST9", "Overall": "4.0", "Content": "I have not had this item long enough to give an excellent review but so far it appears to be working fine.  It was easy to install and I think it was worth the money spent.", "Date": "February 1, 2012"}, {"Title": "First Alert CO review", "Author": "James O. Eickhorst", "ReviewID": "RQI0ETRHEWIJD", "Overall": "5.0", "Content": "Easy to install and works fine.  Looked up reviews and this was rated the best of the carbon monoxide alarms.  Put in basement snd on first floor.", "Date": "February 1, 2012"}, {"Title": "My Experience", "Author": "Wayne", "ReviewID": "R2WSP73ACJL1FL", "Overall": "4.0", "Content": "The First Alert CO detector with battery backup was easy to set up, however I also noticed as other consumers have, in that the \"door\" of the battery compartment did not stay closed. I fixed the problem with a small piece of Scotch Tape, however perhaps the latching mechanism could be improved somewhat.Other than this minor defect, I consider it to be a good value as well as security, for the money.", "Date": "January 20, 2012"}, {"Title": "Good Compact Unit", "Author": "W. Green", "ReviewID": "R2X60EDGOOT9DY", "Overall": "5.0", "Content": "Especially useful is the end-of-life notification, ( Who really keeps track? ) and battery backup. Overall, does everything you want it to do, including showing battery status, and highest CO level measured.", "Date": "January 5, 2012"}, {"Title": "Great Purchase", "Author": "Virginia", "ReviewID": "R3UMHR958W9MNN", "Overall": "5.0", "Content": "I bought one for each floor of my home and they perform as advertised.  Haven't observed any problems when there is a power outage.  Provides an extra level of safety for my family.", "Date": "January 1, 2012"}, {"Title": "No nuisance alarms", "Author": "Plain Jayne", "ReviewID": "R39P1WJ9GBDRC3", "Overall": "5.0", "Content": "I bought two of these for our new home almost a year ago. These are my first CO detectors, so I don't really have much to compare them to, but so far they work well for us. We have 3 gas appliances (furnace, water heater, dryer) and a wood burning fireplace. We have one detector in the living room (with the fireplace) and one in the hallway outside our bedroom(s). I was worried about nuisance alarms, as I've heard of this being a problem with CO detectors, especially if they are placed too near kitchens, bathrooms, fireplaces or anything else that could produce smoke, gases or vapor. So far we've not had any nuisance alarms. They're a little bulky on the electrical outlet, whether you mount the unit directly or use the cord provided, but that is a small price to pay for peace of mind. Seriously, if you have gas appliances, you need CO detectors. Don't wait!", "Date": "December 7, 2011"}, {"Title": "Great Carbon Monoxide alarm for the $", "Author": "Sarah", "ReviewID": "R2UMDSZBL06BCP", "Overall": "5.0", "Content": "This Carbon Monoxide alarm is exactly as promoted.  Ready to use right out of the box and simple to understand.  Having the capability to instantly check the level of carbon monoxide is a great feature. All alarm sounds are fully explained.  Great product for the money.", "Date": "December 7, 2011"}, {"Title": "CO detector", "Author": "James J. Stark", "ReviewID": "R3IVNR23U7KZJR", "Overall": "5.0", "Content": "This product was easy to set up and plugs into an electric receptacle anywhere.  Doesn't require mounting on wall or ceiling.  As to whether it will work if the CO level rises, I have no idea since it hasn't happened.  Seems solidly made.", "Date": "November 25, 2011"}, {"Title": "Options in placement", "Author": "Billy Tucker \"Perpetual Student\"", "ReviewID": "R3KFXN2Q32YF06", "Overall": "5.0", "Content": "I was pleased to discover that the box can be instantly mounted by simply plugging it into an electric outlet, or the electric cord held inside the box can be unwound and the alarm mounted away from an electric outlet.  The alarm seems sufficiently loud to wake just about anyone (except my teenage sons who could sleep through an atomic blast).", "Date": "October 21, 2011"}, {"Title": "Carbon Monoxide Detector", "Author": "de1293", "ReviewID": "R3JM8NEQSTX4K", "Overall": "5.0", "Content": "Received the First Alert carbon monoxide detector in perfect shape and it works right out of package. It plugs right in the AC wall socket with option to extend the adapter for wall mount. Green display is constantly on with test mode showing any CO detectable level.", "Date": "October 19, 2011"}, {"Title": "current-generation equipment", "Author": "NorthTXguy", "ReviewID": "R29BRXAPJ5E8NX", "Overall": "5.0", "Content": "CO detectors several years old and older, wear out (or something like that) and don't announce the fact.  Newer-generation equipment, such as the Co615, let you know when they're coming to the end of their lives.  Mine is just across the kitchen from my natural-gas range-top.", "Date": "October 14, 2011"}, {"Title": "CO615 Review", "Author": "Nick", "ReviewID": "RAV5RIRN454FN", "Overall": "5.0", "Content": "Product is an excellent CO monitor, and performs exactly as advertised.  It is small, uses a battery backup and plugs in directly or the plug can be detached and plugged in at a distance fron the device.  It works well.", "Date": "October 8, 2011"}, {"Title": "carbon monoxide alarm", "Author": "Robert Misenti", "ReviewID": "R2I6JRNCBHWEDO", "Overall": "5.0", "Content": "Haven't had the need for it yet but I'm sure it will work well in the event of carbon monoxide elevation.", "Date": "October 6, 2011"}, {"Title": "Great Product", "Author": "Tall Flute", "ReviewID": "R26MKEXFVB9JUP", "Overall": "4.0", "Content": "Easy to use, and fairly intuitive. It feels like it's working, though I cannot say for certain as we have not had any CO incidents since the one that prompted me to buy this detector, but I like checking the peak level to be sure that there was no leakage at any point, and I like that it has a cord plug so you can be more flexible with the placement of the device.", "Date": "October 4, 2011"}, {"Title": "Carbon Monoxide detector", "Author": "revie", "ReviewID": "R1D6GO1BUX9AA6", "Overall": "4.0", "Content": "I have only  had this product for a few weeks but so far I have been very pleased with it.  I purchased it because it was recommended by Consumer Reports who I have utmost confidence in.", "Date": "July 11, 2011"}, {"Title": "California requires them", "Author": "Amazon Customer \"epags\"", "ReviewID": "R3DPJMNMH5C4XQ", "Overall": "4.0", "Content": "I live in an open well ventilated home near the beach but California just passed a law requiring all homes to have carbon monoxide detectors that are both AC as well as battery operated.  In order to comply I searched Amazon's customer feedback for a highly satisfactory unit.  First alert CO615 had such a rating and at the price appeared to be a good buy.  I received them (two, one for each floor) in just a few days and since they were slightly over $25 each, shipping was free.My only complaint is that the packaging requires heavy duty sisssors and care not to cut yourself on the plastic as you pry the parts from the packaging.That aside, there were two batteries and clear instructions on assembly.For the record, all CO units presently being sold come with a 'life' of five years and then have to be replaced......hope technology improves on that.", "Date": "July 8, 2011"}, {"Title": "Affordable and Effective", "Author": "W. Jordan \"Low-Key Collector\"", "ReviewID": "R2O3BPLT91Z4AO", "Overall": "4.0", "Content": "Affordable and effective -- isn't that really all you need in a CO detector? It is for me. I don't have a CO leak so I can only assume it would work when it is detected. The battery backup is definitely nice though because the power goes out a lot here from storms, etc.", "Date": "July 6, 2011"}, {"Title": "Seems good, hard to know for sure", "Author": "Rob R.", "ReviewID": "RAFSSPTX34BMD", "Overall": "5.0", "Content": "Plugged in and pushed the test button without any problems. Hard to tell if it will work when I need it to work, there is no way to know.  But certainly I have not had any false alarms or beeps.", "Date": "April 20, 2011"}, {"Title": "Very pleased", "Author": "Dale Robert Vallee", "ReviewID": "R2FW6MU34QBWAE", "Overall": "5.0", "Content": "Very good product. Easy to figure out. Not sure why some found negatives with it.  It's pretty simple and straight forward, and put together well.", "Date": "March 28, 2011"}, {"Title": "Great service", "Author": "LP", "ReviewID": "R2KTOF4L283PBI", "Overall": "4.0", "Content": "We are very happy with the product so far and we saved a considerable amout going through Amazon.  Delivery time was great.  Delivered as promised and possibly sooner.  Would recommend to any one.", "Date": "March 25, 2011"}, {"Title": "First Alert", "Author": "water lover", "ReviewID": "RHRFI1J1CDZ5E", "Overall": "5.0", "Content": "Had this for a couple of years now and still runs like a charm. Love the digital read out. Easy to use and reliable.", "Date": "March 25, 2011"}, {"Title": "Just what I was looking for", "Author": "TNMom", "ReviewID": "R603FZ4QF5D2", "Overall": "5.0", "Content": "I like this carbon monoxide detector because it has the battery backup.  I have had it for a month and it is working fine and I have no complaints.", "Date": "March 21, 2011"}, {"Title": "Excactly what I was looking for!", "Author": "Shani Aisha Rolle", "ReviewID": "RPG74RX08IOER", "Overall": "5.0", "Content": "I am renting a town home that does not have a carbon monoxide detector since they are not mandatory in Virginia.  However, I think that is absurd considering that I have gas heat and a gas stove.  I purchased two..one for upstairs and one for down stairs.  They plug in to any outlet and also come with a battery back up in case you lose power. This product gives me the peace of mind I was looking for.", "Date": "February 3, 2011"}, {"Title": "Good device", "Author": "Tomtom", "ReviewID": "R385D71I7S0FB", "Overall": "4.0", "Content": "My only problem with the device is that it's hard to tell if it is on.  Also when trying to press the buttons their not very user friendly and hard to get a readout.  It feels like it may break with the amount of force needed to press the buttons for the digital display to function and provide a reading.", "Date": "January 27, 2011"}, {"Title": "Just works", "Author": "Sir Force", "ReviewID": "R2WJI2FM4QO31I", "Overall": "5.0", "Content": "Detector comes with many mounting options and hardware in addition to being able to be located in front of a power outlet.  Seems to work but no reason for it to sound an alarm yet thankfully!", "Date": "January 7, 2011"}, {"Title": "If you burn any type of fuel in your home be safe and buy some.", "Author": "Joel Elmer Coldwater III \"Research For The Best\"", "ReviewID": "R3ES8IQ16S0PNL", "Overall": "5.0", "Content": "I wanted an easy to use Carbon monoxide meter.That is exactly what this is.See manufacturer for the recommended place ment and number to get.Just plugs right into outlet or you can use its longer cord to place elswhere.Also has a battery backup.", "Date": "January 6, 2011"}, {"Title": "Save lives for a couple bucks!", "Author": "C. Case \"Corky\"", "ReviewID": "RPMO2O4G2CQUI", "Overall": "5.0", "Content": "We purchased two of these units for Christmas presents for our grown children. A family in town had a close call with carbon monoxide, they all survived.  However, they were fortunate they became sick and called the fire department paramedics.  The paramedics quickly determined that the culprit was carbon monoxide. They were transferred to the local hospital. I would be devastated if any one were harmed because an inexpensive item had not been purchased. Consumer Reports recommends this unit. It is also less expensive than many others. I can rest free. No regrets.", "Date": "January 4, 2011"}, {"Title": "CO2 Detector", "Author": "Michael A. Basso", "ReviewID": "R3DPR0YYDOTHZQ", "Overall": "4.0", "Content": "Good product - Just purchased three units to replace older aging devices.  Works as advertised, no false alerts, and has a battery backup if the power goes out.  I elected to purchase standalone CO2 and Fire detectors.", "Date": "December 28, 2010"}, {"Title": "Prompt Service and Good Product", "Author": "Jenny Adamson \"Jenny\"", "ReviewID": "R305H31H85O8G7", "Overall": "4.0", "Content": "This is a carbon monoxide detector with a battery back-up and a digital read. A friend of mine had a carbon monoxide alarm go off and the response team told her to get a new one that would be better and this one has the features that they recommended. So, I feel safer with this even though we have a new furnace.", "Date": "December 15, 2010"}, {"Title": "\"fit the bill\"", "Author": "mary", "ReviewID": "R2YWHITW6VS4MJ", "Overall": "5.0", "Content": "The Alarm is a great purchase, without spending a lot of money.  Arrived quickly and easy to install...just plug in.  Better than having to replace batteries all the time...highly recommend!", "Date": "December 15, 2010"}, {"Title": "CO2", "Author": "ARETHAROSE", "ReviewID": "RPVIS0O196GHS", "Overall": "5.0", "Content": "I'VE ONLY HAD THIS UNIT FOR A COUPLE OF WEEKS, BUT SO FAR IT'S WORKING AS DESCRIBED.  I PARTICULARLY LIKE THE DISPLAY FEATURE.  IF ANY CO2 PARTICULES ARE DETECTED, THE AMOUNT IS SHOWN.  GOOD BUY.", "Date": "November 21, 2010"}, {"Title": "Highly rated detector, working great", "Author": "Steve S.", "ReviewID": "R1JE96XW1XQVSX", "Overall": "5.0", "Content": "After my previous carbon monoxide detector died, I went to the internet to see what was the best one out there to replace it. According to Consumer Reports, this is highly effective at detecting low and high levels of carbon monoxide, and is not prone to false alarms. That sold it for me.After receiving it, opened the package, installed the batteries, and plugged it in. Works fine, and being able to pull the power plug and place it away from the wall is convenient.", "Date": "November 13, 2010"}, {"Title": "Carbon Monoxide First Alert", "Author": "M. Hawkins", "ReviewID": "R2EGY0CZ1W75JX", "Overall": "4.0", "Content": "This product was easy to set up and arrived as promised. I bought it based on independent rating reviews, so I assume it work as described. I have not exposed it to CM in the home and hope it never will be.", "Date": "May 24, 2010"}, {"Title": "Recommended", "Author": "Jeremy", "ReviewID": "R1DHUCZMGXX3WH", "Overall": "5.0", "Content": "Good instructions, easy to install, green light shows it's working but it's too bright. Recommend, based on magazine reviews and how it's been working for us.", "Date": "May 20, 2010"}, {"Title": "Works Great", "Author": "DJ", "ReviewID": "R3OZ34Z3EFUDCL", "Overall": "5.0", "Content": "We got this to replace our 5 year old CO Detector.  Works great (I think - hasn't gone off, but we hadn't expected it too.  In the past we've had problems with our furnace, so the Gas Company recommended the digital read out.  We don't want to mess with changing batteries and our power doesn't go out very often. This model has everything we were looking for.", "Date": "April 16, 2010"}, {"Title": "Carbon Monoxide monitor", "Author": "John W. Sands \"grandpa\"", "ReviewID": "R30YHSFWZN8YMS", "Overall": "5.0", "Content": "Delivery was prompt. Installation was easy. They seem to be doing their job. Test worked appropriately. So far I am completely satisfied.", "Date": "April 2, 2010"}, {"Title": "First Alert CO615 Carbon Monoxide Plug-In Alarm with Battery Backup and Digital Display", "Author": "Eileen", "ReviewID": "RAMDJNFRAMJLN", "Overall": "5.0", "Content": "Works very well and I like the plug-in advantage, never have to worry about replacing the battery. Like it very much.", "Date": "February 28, 2010"}, {"Title": "Good one!", "Author": "luis \"luis\"", "ReviewID": "R8AYYT11TYKIK", "Overall": "5.0", "Content": "I picked it because Consumer reports, so I guess is good but until goes off I will not know", "Date": "February 12, 2010"}, {"Title": "Great Buy", "Author": "D. Monroe", "ReviewID": "R2UCC6KY1M0YEU", "Overall": "5.0", "Content": "This CO detector is simple to install, just insert batteries and plug into wall socket. Has cord which allows you to locate in area which may not be close to an outlet.", "Date": "February 11, 2010"}, {"Title": "bought as a replacement", "Author": "PG", "ReviewID": "RTKY8U7MIDD87", "Overall": "5.0", "Content": "I bought this to replace my old co2 detector that would constantly discharge it's battery and beep endlessly for a new battery.  Hopefully this unit doesn't end up doing that.  The previous detector was from the same brand but a different model; I will post back if this one goes out on me.It's a nice unit and does provide an ac cord that you can plug in 10+ ft away from the actual unit; or you can keep the cord and ac adapter snugged into the back of the unit and plug the entire thing into an outlet.  Thats a really nice feature about this model; also the LCD display memorizes the last amount of co2 it has detected so you can always check back to see if you had any leaks.", "Date": "February 10, 2010"}, {"Title": "Great Product & Good Price", "Author": "Catholic", "ReviewID": "R30EAVZ0A5DIP", "Overall": "5.0", "Content": "I've always been one to research what type of products I should buy and it was no different for this carbon monoxide alarm.  I found out that it was rated well in Consumer Reports.  I liked the idea that this monitor only needed a battery for backup purposes.  I was afraid we'd bump into it on occasion since it hangs in our hallway and is only a foot or so off the ground, but we haven't as of yet.  After reviewing several other places such as Walmart and other retailers, I believe Amazon came out to be the best price for the product.", "Date": "February 2, 2010"}, {"Title": "Nice Amazon price", "Author": "Mr. David M. Steele \"Tea Lover\"", "ReviewID": "R153N8L584CS5M", "Overall": "5.0", "Content": "Very funtional and accurate detector at a great price with Amazon free shipping!  This is a must for anyone with gas heat or a gas fireplace insert.", "Date": "January 25, 2010"}, {"Title": "As the other reviewers said", "Author": "Edward A. Hamilton \"Cardinal Pilot\"", "ReviewID": "R2YXL9WVRJCZ9", "Overall": "4.0", "Content": "Received ok.  Inspected and found not damaged, plugged it in and everything works as expected.  The only reason I did not give it five starts is that I have only had it for a few weeks and the reading has never left zero so, until it does, one never really knows if it is working.  I suspect so because everything else is as advertised.  Good product.", "Date": "December 26, 2009"}, {"Title": "junebug", "Author": "junebug \"june\"", "ReviewID": "R3748UO9IBK4QF", "Overall": "5.0", "Content": "We are happy with our decision of this product.  Has worked perfectly and have not had any problems with it.", "Date": "December 9, 2009"}, {"Title": "Works fine", "Author": "John J. Hill", "ReviewID": "R3M9QWN15IU9JP", "Overall": "5.0", "Content": "It was a simple plug-in (didn't use the extender).  It beeped for a couple seconds, then has been quiet since (3 weeks or so).  Gotta believe it's doing its job.", "Date": "November 18, 2009"}, {"Title": "So far, so good", "Author": "DC \"Dolores\"", "ReviewID": "R196OYQVO05BJL", "Overall": "5.0", "Content": "This Carbon Monoxide alarm seems to work, of course, Thank God, we haven't had any CO problems for it to go off.", "Date": "August 29, 2009"}, {"Title": "Carbon Monoxide detector", "Author": "WingsWoman", "ReviewID": "R3LNT5CA9X54AX", "Overall": "5.0", "Content": "The delivery was very fast, and I liked the easy to read digital display so much I ordered a second one to replace another detector that I had that lacked this feature (even though there was nothing wrong with the older unit.) The fact that there is a battery back-up also really sets my mind at ease.", "Date": "April 4, 2009"}, {"Title": "Excellent CO detector", "Author": "R. Emerson", "ReviewID": "R2AS97QIICBMYO", "Overall": "5.0", "Content": "This monitor does it all.  The power cord allows for mounting the detector away from an AC outlet.  The display is easy to read and is backlit when activated.", "Date": "March 31, 2009"}, {"Title": "Safety First", "Author": "Love Amazon", "ReviewID": "RQDZA9FEZR9QM", "Overall": "5.0", "Content": "Better safe than sorry is such a great motto.  I love the battery back-up on this alarm.  I bought another one after we received this one.  I would recommend this product.", "Date": "September 17, 2008"}, {"Title": "Plug and play.", "Author": "Baron's Auto Repair \"snkbte\"", "ReviewID": "R5TCNT6MP4NRI", "Overall": "5.0", "Content": "No problems. Appears to be working fine. Great piece of mind having it in the house.", "Date": "January 8, 2008"}, {"Title": "Should have bought a different brand", "Author": "Liz B", "ReviewID": "R1FRAR8BHMJMGU", "Overall": "2.0", "Content": "I had read in some of the other reviews that the battery door was difficult to manage and you can't see the CO levels without hitting a button, but I thought, surely we can figure it out with the help of the manual. No such luck. The battery door closed fine without batteries inside, but both my husband and I unsuccessfully tried multiple times to make it shut after inserting batteries. We even removed and reinstalled the batteries several times to make sure we had them in all the way. It made us wonder if the unit was really working. Our only way of guessing that the CO levels in our house are safe was the fact that no alarm sounded when we plugged it in, but how could we know if the lack of alarm meant the house was safe, or the unit was defective? Never did find the button that I thought we were supposed to be able to push in order to see the full display and find out what exactly the CO level is.Overall, we found this CO alarm confusing and unusable, and sent it back immediately. We have not tried any other CO detectors yet, but this one definitely got itself crossed off the list of possibilities.", "Date": "March 16, 2011"}, {"Title": "Slight Catch To Be Aware Of....", "Author": "J. Palmer", "ReviewID": "R9ERDLMY0BDUC", "Overall": "2.0", "Content": "I bought this particular model because I wanted an AC-powered detector. In my opinion, powering CO and fire detectors by batteries is wasteful. If you follow the \"change the batteries in the spring and fall\" on Daylight Savings time changes or whatever, you end up discarding and wasting batteries that are usually still good. I don't know what your power situation is, but my power is up 99.99% of the time. The chances of a fire or high-CO occurring while the power is off, for me, is... well, I'm better off playing the lottery. So I'm perfectly comfortable with the use of with AC-only units. Oh, and when my power goes off, I wake up instantly. The house going completely silent is not normal. I'll be awake in case of a fire during the power loss, and a lack of power won't increase CO levels.The catch on this model is that while it's powered by AC, it still requires two AA batteries as backup, or the thing will annoyingly beep once a minute to remind you that batteries are dead or not inserted. You cannot silence the alert permanently. So I'm back to wasting batteries AND AC power. It won't run exclusively on batteries either, per the documentation.The packaging is plastic vacuform, wasteful, and hard to open. Shame. The AC adapter cord is generously long, mounting screws and batteries are included.I would buy a different detector next time, one that will satisfy my criteria of AC-only operation, and doesn't require batteries, period.", "Date": "July 26, 2009"}, {"Title": "First Alert CO615 Carbon Monoxide Plug-In Alarm with Battery Backup and Digital Display", "Author": "B. H. Robinson", "ReviewID": "R2RJI5RQ3M9L0T", "Overall": "1.0", "Content": "Digital LED light is green and can't read display during daytime. The number(s) displayed is small and makes it difficult to read. Would only purchase for an area that you just want to hear the alarm if it goes off.  Read good reviews on Amazon and were excited to purchase this product. Could have returned the item but just put it in the laundry area.", "Date": "February 8, 2012"}, {"Title": "didn't work well", "Author": "Richard L Hale", "ReviewID": "R3K9J07IYH51TT", "Overall": "1.0", "Content": "got this thing because it said it would read out the levels, it doesn't. Never could get it to work right or at all for that matter.", "Date": "April 7, 2014"}, {"Title": "Like it but have had some trouble", "Author": "Richard", "ReviewID": "R36GQLKIGDV9DF", "Overall": "4.0", "Content": "The battery back up does not last as long as I hoped.  The little kids have pulled it off the wall several times and maybe this cuts the battery life a lot.  We have it in a hall that we pass many times during the day so I don't think it has been on battery alone very often.  I've had it 10 months and replaced the batteries twice.  I don't think it works with out the batteries even if it is plugged in to the wall outlet.It plugs into the 110Volt wall outlet with a removable plug (with wires back to the housing) held into the housing with two plastic clips.  When the kids pull it off the wall, the electrical plug tends to stay connected to the outlet and the housing drops to the floor (about 11 inches onto tile).  The housing has never been damaged but one of the plastic clips that hold the plug into the housing eventually broke.So after that the housing would not stay in place very well and would tend to drop to the floor on it's own.  I don't fault the manufacture for this since plastic clips are typical for this kind of stuff.  I rigged up a wire zip tie to hold the plug into the housing to keep the housing from falling onto the floor.I have to admit I don't know it it really works since it has never alarmed (or shown any detectable CO on the screen), other than low battery.  We depend on it to protect us from central gas heater and an unvented gas log we often use in the winter.", "Date": "November 17, 2013"}, {"Title": "Have a Ventless Fireplace...You Better Have This", "Author": "Jim Ha", "ReviewID": "R3G8JLIC77RMZA", "Overall": "5.0", "Content": "This device can be a life saver.  Shoddy heating contractors, old heating systems, ventless fireplaces....there are all reasons that carbon dioxide could kill your family.  Carbon dioxide has no smell and is invisible as a gas....you are passed out and then dead with no warning....unless you have this device to alert you.  I no longer use my ventless gas fireplace as a result of this device telling me that carbon dioxide gases are too high every time I use the fireplace.  These ventless gas fireplaces should be outlawed.  The spew sulphur (a by product of burning natural gas) into the room and yellow the white paint on the trim around my fireplace and tarnish all the silver in the house (unless I've sealed it in plastic bags for storage).Every home should have a carbon dioxide detector especially if you are one of those families that has gone to extremes to seal up and insulate your home from the cold winter air.  The more air tight your home the more danger you are in without a carbon dioxide detector.....and NO....I don't sell these devices....I've just had a couple of close calls!", "Date": "September 11, 2013"}, {"Title": "So easy to install", "Author": "JOHN L", "ReviewID": "R2L7MN6WYVOXXQ", "Overall": "5.0", "Content": "Took less than 5 minuite to install.  Just plug in to power outlet after inserting battery.  I'm buying another one.", "Date": "November 15, 2012"}, {"Title": "Looks like it is working", "Author": "R. B. \"R.B.\"", "ReviewID": "R1HH6SI8169VKN", "Overall": "3.0", "Content": "I wont know for sure if it works unless we have issues so I have to assume it is working.  it looks like it works.", "Date": "November 6, 2012"}, {"Title": "John", "Author": "John", "ReviewID": "R33B3X4545KYR5", "Overall": "2.0", "Content": "While this product will serve its purpose the battery case area is cheaply made. I would expect problems with this as battery in the future. I will probably have to use a piece of tape to keep the battery cover from popping open.", "Date": "May 14, 2012"}, {"Title": "Shipped with 2 AA batteries rather a 9V battery as said in the technical specification", "Author": "F612 Scaglietti", "ReviewID": "R2D4XQ3TEGFAJW", "Overall": "3.0", "Content": "Its been only 3 days since I have started using this product. So, I do not intend to review the product at this time. However, the product was shipped with 2 AA batteries rather a 9V battery as noted in the technical details section.", "Date": "October 14, 2011"}, {"Title": "Could be better", "Author": "Mike Wright", "ReviewID": "RQHBVSY4YR52Q", "Overall": "3.0", "Content": "I have two suggestions for improvement. First, the digital readout should be larger so it can be read from further away, but I could have guessed this from the package picture. second,  the employment location requirements , which are probably not unique for detector products are difficult to achieve sometimes. Trying minimize the distance from the CO source, proximity to air currents, AC location, and audibility is a confusing puzzle at best. I think that I would have been  better off with a battery-operated unit. Or just ignore the requirements as  a C,Y,A. legal ease. The  description suggested this was an excellent choice for a CO detector and when I bought it, I was somewhat disappointed. It runs on AC power with battery backup, and has the digital readout. It can be mounted directly in an outlet, or the plug can be detached so the now-corded unit can be mounted away from the outlet so that part is very helpful.", "Date": "June 29, 2011"}, {"Title": "It's a CO Alarm", "Author": "MegaPain", "ReviewID": "RLEOB58WQC3EH", "Overall": "5.0", "Content": "The product appears to work fine.  However, I purchased a Kiddy Nite Hawk CO Detector with Digital readout and for some reason, the peak memory level for this product shows about 16PPM while the First Alert Alarm always shows zero.At this point neither one of the alarms have gone off so I'm hoping that my family is safe.", "Date": "July 9, 2008"}, {"Title": "Product and subsequent support are not worth the price!", "Author": "Rhykor", "ReviewID": "R35EIRZU48HD9E", "Overall": "1.0", "Content": "Unit was defective right out of the packaging like others have indicated in their reviews. Just go with the Kiddie Nighthawk line and save yourself some time and hassle.", "Date": "November 2, 2013"}, {"Title": "So far so good", "Author": "R. Petrisko \"Gardengirl\"", "ReviewID": "R1EDDPFV2203ZB", "Overall": "5.0", "Content": "So far, I'm pretty pleased with the product. In the past, we tried another older generation First Alert plug in with battery backup that seemed to deplete battery life every 2 weeks. Maybe ours was defective, but like other people, getting jolted out of bed with a deafening squeal got old really fast. We have not had any problem like that so far, for the few months we've had it. Hopefully the detector is working! How would one know truly, unless you had a problem and it either did or didn't go off...one way or another you'd or someone would find out. Hopefully not the latter.", "Date": "January 28, 2009"}, {"Title": "Don't know yet", "Author": "Dave Holfeltz", "ReviewID": "R285NMLVMOSR4O", "Overall": "4.0", "Content": "If it works when the time comes I will like it, but if it doesn't work I will not like it?", "Date": "March 21, 2014"}, {"Title": "Life Saver", "Author": "Rick", "ReviewID": "R29DDMD81943C", "Overall": "5.0", "Content": "If you have any carbon monoxide producers in your house-you'll want the assurance that if the levels rise to unsafe levels, you'll be aware.  Recently received positive comments in the Feb. 14, 2014 \"The Week\" magazine, page 28.  Easy to set-up, unobtrusive and by a name you trust-First Alert.  As others have commented:  Read the instructions and follow them on correct placement.  The \"no-brainer\" step would be right next to a fireplace, in the kitchen or next to a gas range/dryer or water heater.  NO-instructions caution you that these items cause a temporary rise in carbon monoxide, your alarm will sound - and you'll be mad about the \"false alarms.\"  Place the alarms near sleeping areas, outside the bedrooms.  Read for other recommendations.", "Date": "February 12, 2014"}, {"Title": "Great comfort", "Author": "Barbara", "ReviewID": "R1KT13OIYBZRDL", "Overall": "5.0", "Content": "Old one \"died\" and this replacement is great and makes us feel safe from the serious danger of carbon momoxide poisoning!", "Date": "February 11, 2014"}, {"Title": "First Alert is always on ALert..", "Author": "dustyrose56", "ReviewID": "RUC4P1Z16OYME", "Overall": "5.0", "Content": "Now that it is law to have Co2 detectors in our homes, we searched for the one with the best ratings, price and most of all one thatwould continue to work in the event of a power outage. First Alert won the selection coming with everything we were looking for. Now I feel safe in my home knowing we are all protected.", "Date": "February 6, 2014"}, {"Title": "Necessary for those with wood stoves.", "Author": "Billiam", "ReviewID": "R1U9CF88WKIRKO", "Overall": "4.0", "Content": "This is a good unit that uses AC power with a battery backup. The only thing to make it a five star rating is if it also acted as a smoke detector. The installation (simple) instructions were clear and informative.", "Date": "December 26, 2013"}, {"Title": "A must have device.", "Author": "Idle Mischief", "ReviewID": "RGASQPTR5I89Q", "Overall": "5.0", "Content": "This product is a good value, and is a well made device.  The price is reasonable, and it arrived well packaged and when promised. Amazon Prime is the BEST,", "Date": "November 27, 2013"}, {"Title": "very good value for the price, would buy again if needed", "Author": "Tom", "ReviewID": "R2ZXMVAQOB5WKA", "Overall": "5.0", "Content": "It is everything I expected and at a great price, good value. why do I have to use a certian amount of words?", "Date": "November 9, 2013"}, {"Title": "Some of my shopping is done on Amazon as its same time and gas.", "Author": "Ann \"Ann\"", "ReviewID": "R3DSBPEZVBR0EF", "Overall": "4.0", "Content": "Selling home and its required. I really don't like to run around and look for some items and this was much easier as need ASAP.", "Date": "November 5, 2013"}, {"Title": "Great product and a great value peace of mind", "Author": "carol eisenhauer", "ReviewID": "R2KHTNQ0A5KUO0", "Overall": "4.0", "Content": "It is easy to use and the best part is that is portable.  Gives me peace of mind since I have gas heat and a gas range.", "Date": "November 3, 2013"}, {"Title": "First Alert CO detector", "Author": "Carol M. Hurwitz \"Gitano\"", "ReviewID": "RQORMZQPG3OLT", "Overall": "5.0", "Content": "It came right away.  No way to know if a CO monitor really works, but it seems to.  I just had to plug it in.", "Date": "November 2, 2013"}, {"Title": "Life Saver", "Author": "Richard Tompkins", "ReviewID": "R172KFTCSL9GLW", "Overall": "4.0", "Content": "It's hard to tell how it is working. Have not had any alarm go off, thus I assume it is OX", "Date": "October 23, 2013"}, {"Title": "I was told to buy one.", "Author": "virginia barclay", "ReviewID": "R3FOWB8BB2O5AK", "Overall": "5.0", "Content": "After researching different ones I decided on this model.I later was told I had made a good decision. I'm very happy with it. I love Amazon!", "Date": "October 22, 2013"}, {"Title": "Great product", "Author": "E. Morris Azbill, Jr. \"Bogeyman\"", "ReviewID": "R2KRI00E119YO3", "Overall": "5.0", "Content": "Had one before.  This is a newer model with extra features from the one I had before.  The only problem I have with these (any brand) is that there is a limited lifetime.  They are not like smoke detectors which are essentially good forever.  These eventually need to be replaced/.", "Date": "August 29, 2013"}, {"Title": "skip", "Author": "Rhonda M Allen", "ReviewID": "R1SN34UTQ48WC6", "Overall": "5.0", "Content": "great detector, like the blue light up display! these can be real life savers and at this price you cant go wrong,", "Date": "August 23, 2013"}, {"Title": "Am I missing something?", "Author": "dc23", "ReviewID": "R3W4KGH603YUE8", "Overall": "3.0", "Content": "It seems that the instruction sheet is pretty complicated. I just plugged it in. It doesn't show anything on the screen other than a full battery sign for the backup battery. Is that it? Please let me know.", "Date": "June 25, 2013"}, {"Title": "not worth it", "Author": "Kim", "ReviewID": "R1I1CSJBIJC12M", "Overall": "2.0", "Content": "could not do what i wanted to do with it. comes with a huge book of DON'Ts that make it almost unusable.", "Date": "June 23, 2013"}, {"Title": "Life Saver", "Author": "Kenneth E. Burchett", "ReviewID": "R3VNU778N6MUB9", "Overall": "5.0", "Content": "My daughter lives in an apartment in a large city on the West Coast.  I bought one of these because of the gas service.  She had it about two years when it sounded an alarm.  It activated exactly at the level it was supposed to, and, according to the gas serviceman, possibly saved her life.  Anyone with gas service should own a carbon monoxide alarm.", "Date": "March 18, 2013"}, {"Title": "CO2 PLUG IN", "Author": "J. Abel \"Stan\"", "ReviewID": "R1CT4BX8GF2M1N", "Overall": "5.0", "Content": "HAD THIS PRODUCT A SHORT TIME.  LIKE THE EASE OF USE AND VERSATILITY OF PRODUCT. FEEL MORE COMFORTABLE WITH A BATTERY BACK UP ALARM.  MY OTHER ONE WAS NOT.", "Date": "March 3, 2013"}, {"Title": "More than meets its description", "Author": "Leo Keukens", "ReviewID": "R19JS3Q5RDN22P", "Overall": "4.0", "Content": "I have not had to use this Alarm and hope I never will. Having examined it thoroughly before installing I must say that it more than meets its description.", "Date": "February 23, 2013"}, {"Title": "So far, so good", "Author": "Anita Jo", "ReviewID": "R2PCZCX0VIUDTP", "Overall": "4.0", "Content": "Very easy to put in place.  I may never know had good it is unless any occasion arises for its use.", "Date": "February 23, 2013"}, {"Title": "Convenient and looks good", "Author": "Thomas Radley \"TomR\"", "ReviewID": "R30GY9WOMJJ7FD", "Overall": "4.0", "Content": "Just hope it works. Had a tough time generating some CO to see if the meter changed. Not sure about TRUSTING something I cannot test if it is really working. Where can I buy a tube of CO?", "Date": "February 16, 2013"}, {"Title": "Great Product", "Author": "R. Yeaman", "ReviewID": "RNFIE6J7R8EPM", "Overall": "5.0", "Content": "The Carbon Monoxide Alarm works as it said and I feel safer after installing it in my home.  I also bought another one to put in our little white church.", "Date": "February 5, 2013"}, {"Title": "Great Product // Battery Backup Feature A+", "Author": "Matt Fisher", "ReviewID": "RKUQB80Y5BS2L", "Overall": "4.0", "Content": "Great product especially for the price.Battery backup is a must. Not sure why other reviewers noted flimsy parts/battery area as I have been unable to locate anything wrong with the unit i received.", "Date": "January 31, 2013"}, {"Title": "Looks good", "Author": "Charles Morrison", "ReviewID": "RM2U28VIO9N5P", "Overall": "3.0", "Content": "The item looks good and hopefully it works just as well. Hope fully it does the trick in the event of Monoxide leaks", "Date": "January 15, 2013"}, {"Title": "like it", "Author": "Ramesh", "ReviewID": "R6FAMBQDYEHXV", "Overall": "5.0", "Content": "It is hard to know whether it is working perfectly.  However, I have plugged in the wall I see a green light ON.", "Date": "December 11, 2012"}, {"Title": "First Alert CO615 Carbon Monoxide Plug-In Alarm with Battery Backup and Digital Display", "Author": "PKN", "ReviewID": "R3ORBKGPSGGTSS", "Overall": "5.0", "Content": "I really can't say much. It was easy to put together and just plugs in. I hope it never turns on except when the battery is low.", "Date": "November 19, 2012"}, {"Title": "Easy to set up and does what it's supposed to", "Author": "Nick L", "ReviewID": "R2R9W95JCKJZJ0", "Overall": "5.0", "Content": "I am pleased with this product.  It was simple to set up and worked out of the box - no complaints whatsoever.", "Date": "November 9, 2012"}, {"Title": "Met my expectations", "Author": "Molly Simpson \"Momsimpson\"", "ReviewID": "R2OW0IKMA6QE1F", "Overall": "5.0", "Content": "Love this alarm.  It plugs right in my outlet and has battery backup.  Also has a digital readout that is great!  Definitely puts my mind at ease having this detector.", "Date": "November 7, 2012"}, {"Title": "Carbon Monoxide Alarm", "Author": "LynC", "ReviewID": "R3NUIVX8PLMK9J", "Overall": "4.0", "Content": "California now requires such alarms in double-wide manufactured homes. This one from Amazon was reasonable in cost, has a cord to be plugged into an outlet and if the power goes off, there is a battery back-up. I told others in our small community about this alarm, as it meets state standards at a reasonable cost.", "Date": "October 14, 2012"}, {"Title": "put a battery in and plugged it in the wall", "Author": "Kev", "ReviewID": "RI22K5VZWIU3W", "Overall": "5.0", "Content": "I'm happy with this so far, it looks okay on the wall and I like that I can check the PPM of carbon monoxide in the air. Hopefully we will never have a gas leak to test this out on, but I sleep better knowing that this will alert me if anything is out of the norm.", "Date": "October 6, 2012"}, {"Title": "Works but I think I got a repackaged one", "Author": "Donald Obara", "ReviewID": "R1UG9TVKEKIAQF", "Overall": "3.0", "Content": "I just plugged it in and it works.  However, I am disappointed in the fact that the item had visual scuff marks and a letter or 2 had been rubbed off on the verbiage on the unit.  Makes be believe that this unit is NOT new but I purchased as new.", "Date": "September 27, 2012"}, {"Title": "price", "Author": "Marylou Buchman", "ReviewID": "R3A13VS7FOYAS6", "Overall": "5.0", "Content": "i bought 3 of these as i thought that the price was great. everything on it seems to work well on it  time will tell", "Date": "September 17, 2012"}, {"Title": "pefect for ourpose", "Author": "Louis Giosia \"giosilo\"", "ReviewID": "R3TU7MEL3E2PZT", "Overall": "5.0", "Content": "this unit was perfect for installation on lower level- has all the readings required for use - happy with product", "Date": "August 31, 2012"}, {"Title": "Seems to do the job.", "Author": "R. Becich", "ReviewID": "RQKOD3T8LY30Q", "Overall": "4.0", "Content": "Looks attractive.  Guess it does the job - haven't had carbon monoxide in my house so I don't know for sure.  Battery cover is flimsy and is hard to keep closed.", "Date": "July 8, 2012"}, {"Title": "Safety comes first", "Author": "Sops \"fsop\"", "ReviewID": "R17ATTJRVPAWRI", "Overall": "5.0", "Content": "Good product, as described.  I feel safer with this CO2 detector sensing the furnace area and connected to AC line with battery backup.", "Date": "May 18, 2012"}, {"Title": "A important gift", "Author": "Lisa L. Clark", "ReviewID": "R169JAW1BA66CJ", "Overall": "3.0", "Content": "I purchased this Carbon monoxide alarm for my elderly parents to use in their home. They have informed me that it was easy to setup and that it was working just fine.", "Date": "January 28, 2012"}, {"Title": "Great buy", "Author": "Lauren", "ReviewID": "R2P4WZ3JMQME2V", "Overall": "5.0", "Content": "This is a great product.  It works great, and we haven't had any issues.  The display is easy to read, and we will probably replace our upstairs detector with this model as well.", "Date": "December 15, 2011"}, {"Title": "Most Reliable CO detector", "Author": "NEPA Lab Lover \"\"lab lover\"\"", "ReviewID": "R68F77DC7D2UZ", "Overall": "5.0", "Content": "Being from Northeast Pa... we burn coal for heating and this product is a must have!  I wouldn't recommend any other Brand than a First Alert and I especially recommend one that has a digital read out display.  I want to know when there is a problem with CO before a signal or screeching sound alerts me!", "Date": "December 8, 2011"}, {"Title": "Ordered 2, 1 was defective", "Author": "Meg from IN \"Meg\"", "ReviewID": "R3SG7936K9V9GB", "Overall": "3.0", "Content": "The tester that I got that does work seems to do its job.  It tested fine and setup was really easy and the package had an easy open back so I didn't have to cut the package apart.  Batteries went in easily.  The other one I ordered, you could hear the blown siren/speakers so we had to return the tester.  We ended up with another brand instead for the second purchase.", "Date": "November 14, 2011"}, {"Title": "co615", "Author": "G. Slack", "ReviewID": "R25FH7BURWRP0D", "Overall": "5.0", "Content": "As far as I can tell it works fine. I still have 0 ppm so no different than the last CO detector. Decent price, fast delivery as usual from Amazon. Now if I can just find someone who smokes cigarettes to exhale on it. LOL NOT!", "Date": "April 3, 2011"}, {"Title": "It works I think", "Author": "D-dot", "ReviewID": "R2T7HOOUEJ2XIR", "Overall": "5.0", "Content": "Since I have not had a carbon monoxide alarm go of with the First Alert CO615, I cannot truly tell if it works (product up and running for 4 months). However, I have the unit plugged in by my bedrooms and at a fairly high level because carbon monoxide rises (giving ample time to react). I like how it has a constant battery symbol showing the strength of the battery and has a green light that shows that it is powered on through the outlet. It is not the prettiest thing in the world, but heck smoke detectors aren't either. Overall I have not had a problem with this product and I will post if I do. Recommended at this time.", "Date": "April 2, 2011"}, {"Title": "We bought this item to replace a carbon monoxide detector which was at least 15 years old.", "Author": "Edith Nelson", "ReviewID": "RW6R35C897HNQ", "Overall": "5.0", "Content": "We had not realized until we read recent articles, that carbon monoxide detectors are only considered effective for five years.  This model was rated highly by Consumer Reports and meets our needs. Our state, now requires such detectors in various locations in all homes.  Hopefully we will never hear the alarm except when testing!", "Date": "February 6, 2011"}, {"Title": "Great Value", "Author": "D. Bowman \"ESMDAVE\"", "ReviewID": "R1BYM3H2UN2ZSL", "Overall": "5.0", "Content": "I converted my gas fireplace to a ventless system from the old vented style. I wanted to be sure that carbon monoxide level was not excessive or presented any health hazard. I wanted a CO detector with a digital readout. I researched many styles/brands and purchased the First Alert based on that research. It has worked very well and the price was very reasonable. I rate it as a very good decision!!", "Date": "December 29, 2010"}, {"Title": "CO Detector", "Author": "James P. Malone", "ReviewID": "R33J8CT5BN4J0W", "Overall": "5.0", "Content": "Does what it says, I think. Won't know for certain until we have CO leak.", "Date": "April 26, 2010"}, {"Title": "co2 detector", "Author": "Larry B. Shower", "ReviewID": "RHNPJG1RBKLPI", "Overall": "5.0", "Content": "works as advertised. easy setup and install. replace OEM unit that had been in place 15 years. I will be happy to get same longevity out of this one. packaging says to replace in 5 years.", "Date": "April 6, 2010"}, {"Title": "Can't even tell if this unit works or not.", "Author": "Johnny \"Johnny\"", "ReviewID": "R250XD5DZCHBQU", "Overall": "1.0", "Content": "The number on the disply never changes/registers anything differently on the screen.  I either have zero carbon monoxide at all times, or this unit is defective.  Either way, I wish I had returned it within the return window.  Now I am stuck with this thing plugged in the wall and hoping that it works when/if it should.", "Date": "June 5, 2013"}, {"Title": "Cheap battery compartment", "Author": "JDMoose", "ReviewID": "R33QV9OOXLHV2K", "Overall": "3.0", "Content": "Bought this unit for the upstairs figuring the LCD display would act as a night light. It doesn't stay lit unless it senses CO or you press the display button. The battery compartment door is very cheaply made and you have to be careful that you don't break it when installing the battery. Unless you think you need the display, you would be better off purchasing the next version down from this one since the LCD screen is the only difference. Since they all are suppose to do the same thing I wouldn't buy the other brands that are more expensive, since they all seem to be made pretty cheap.", "Date": "December 20, 2011"}, {"Title": "A way to test it.", "Author": "M. Bryan \"gavin4eva\"", "ReviewID": "RIAWQOPB5XVI8", "Overall": "5.0", "Content": "I am looking to purchase a carbon monoxide detector for my new home, and after reading these reviews i guess one way to safely test if this product does work is to start your car up and place it by the muffler and see what the readings are. Other than that i guess you will have to just wait until you have a leak or bulidup somewhere to know if it is really working or not", "Date": "April 10, 2010"}, {"Title": "It worked out of the box!", "Author": "Victor", "ReviewID": "R13PLEJMA9PUNP", "Overall": "5.0", "Content": "Very nice product, worked as described. The only negative will be a lock of continues reading on the display - after all it is an LCD display! I guess I liked my old one with red LED always showing last maximum reading on it.", "Date": "December 1, 2008"}, {"Title": "Hopefully we never have to hear it's alarm", "Author": "Richard P. Brodeur \"Woodworker\"", "ReviewID": "R25L8BML6VCMLS", "Overall": "4.0", "Content": "This unit was very easy to install. All we did was plug it in. There is no way for me to give this a full 5 star rating since the alarm has not been needed yet. Hopefully it stay that way.", "Date": "February 13, 2008"}, {"Title": "Hard to evaluate", "Author": "Robert D. Steinberg \"bikerbob\"", "ReviewID": "R28NM01OHV7BOX", "Overall": "3.0", "Content": "I've got this unit plugged in but have no idea if it'll actually work or not - my hope is that I never have to find out!", "Date": "September 16, 2013"}, {"Title": "Simple to set up", "Author": "Jim", "ReviewID": "R3FUQ27RGTSY99", "Overall": "5.0", "Content": "Well, I haven't died from any carbon monoxide so I guess it's working?  If I do die from CO, well....someone please avenge me.", "Date": "January 24, 2013"}, {"Title": "Does the job, I think", "Author": "Steve R. \"Bookie Monster\"", "ReviewID": "R3Q1RVBNKBC4OU", "Overall": "3.0", "Content": "It is hard to get ecited about a CO detector, but ust owning them helps me sleep well at night.", "Date": "January 11, 2013"}, {"Title": "So Far So Good", "Author": "Dan T. L.", "ReviewID": "R2CM7E4M7J2D3H", "Overall": "5.0", "Content": "I plugged it in and it does its sentry thing.  I purchased two, one for my home and the other for our income property.  Update- in service at two locations for the past year with no issues.  Good product.", "Date": "September 14, 2012"}, {"Title": "Broke after 6 months - did it ever work???", "Author": "A. Good", "ReviewID": "REU2TZQ1VKGN5", "Overall": "1.0", "Content": "I bought this because it has better reviews than the others. From the buttons on it, I expected to be able to easily check the carbon monoxide levels in my house at a given time. However, pushing the buttons doesn't always do anything - the only thing I can get it to do consistently is turn on the back light and run a 'test' where it starts beeping super loud.At least it has a battery back-up for emergencies, and its probably loud enough to hear outside.---UPDATE: Broke completely after 6 months - never knew if it worked. :/ Buying the Kidde brand.", "Date": "May 22, 2012"}, {"Title": "EASY!", "Author": "NYer", "ReviewID": "RIE2P42XXHMVP", "Overall": "5.0", "Content": "Just plug it in and it's ready - easy to use; great product at a great price.  Can't be beat.", "Date": "December 12, 2011"}, {"Title": "Co2 Detector", "Author": "W. Wilson", "ReviewID": "RTJCFON70ZB1X", "Overall": "5.0", "Content": "Very easy to install. I have had these in the past and they did not work very well and they detected the slightest amount of Co2 and when they did you just threw them away and bought another unit. That got very expensive because almost anything would set them off and you did not know if it was Co2 or not and had to pay for someone to come out and inspect for you. So I stopped buying them. We have this installed near the bed in our bedroom.", "Date": "August 31, 2011"}, {"Title": "monoxcide detector", "Author": "Ed Hart", "ReviewID": "R1QHD67NLUI43", "Overall": "3.0", "Content": "Easy to use, however, instructions not clear as to insertion of back up battery, and I had to make a phone call to get the answer. But the cost is excellent.", "Date": "November 5, 2009"}, {"Title": "It works.", "Author": "esplendi", "ReviewID": "R3S6L801L9ZJ2", "Overall": "3.0", "Content": "The last one lasts 6 years.  It is worse than most electronics.  The manufacturer should explain why the sensor does not work after several years, how to repair it before the next sensor arrived and how to dispose it.", "Date": "March 8, 2014"}, {"Title": "What The Gas Co. said....", "Author": "Love It! \"Amy\"", "ReviewID": "R17OM3PQG64J2F", "Overall": "1.0", "Content": "I bought this plug in first alert cm detector.  The Gas Co rep told me that it only detects at 70ppm, which means I'd likely already have headaches and be vomiting.  He recommended I throw it out and buy a cm detector that detects at 400ppm.  Also, he said socket plug ins are not effective as most sockets are low on the wall.  The best kind is a battery operated detector (400ppm) that is placed within 2 ft of the ceiling.  The idea is to be notified before you/family gets headaches and start vomiting.", "Date": "March 6, 2012"}, {"Title": "Does not meet the expectation", "Author": "TKC", "ReviewID": "R2HMXPC8VRVQWI", "Overall": "1.0", "Content": "Beferoe buying anything in Amazaon I generally see the review and rating. For this item the review and rating does not meet the quality. Its little heavy, bulky, on the top I got one defective. Its always make some sound. The user manual is really poor.", "Date": "December 23, 2011"}, {"Title": "Gives a false sense of security! Dangerous!", "Author": "Moi \"a mom\"", "ReviewID": "R9A1FZ96M5WX8", "Overall": "1.0", "Content": "Doesn't work. When my 3 young kids started having flu-like symptoms that disappeared when out of the house and returned when we did, I started to wonder if it was working. I lit a match and blew it out right next to the thing. Nothing. HVAC will be here tomorrow, and we will see just how close this thing came to letting us all die when we thought we were protected. Especially dangerous because it gives the impression of working (green light on, alarms when tested).", "Date": "December 5, 2013"}, {"Title": "How am I supposed to turn it on?", "Author": "T-Bag", "ReviewID": "R18R29HL0V0DVB", "Overall": "2.0", "Content": "It's on my wall......doing nothing. Really. I have no idea how to turn it on or how it works. The manual does not help at all. Rather it makes me even more confused. It's practically useless now. Can someone please tell me just how do i turn it on?", "Date": "February 21, 2013"}, {"Title": "It's okay", "Author": "william", "ReviewID": "R3PR006D00G9XQ", "Overall": "3.0", "Content": "I guess it will work.  The test beep sure is loud.  I wonder if the product will work if there is a gas leak.", "Date": "February 7, 2013"}, {"Title": "Talk about Truth in Packaging", "Author": "Timothy Reimers", "ReviewID": "R2A9EFPAVYJ9VE", "Overall": "1.0", "Content": "Whoever wrote up the functions of this unit, they were describing something else, because this did not live up to what is listed on the box it came in.", "Date": "April 12, 2013"}, {"Title": "Pathetic", "Author": "Eric W. Sirko \"Eric\"", "ReviewID": "RHW4AH3O9T4FB", "Overall": "1.0", "Content": "Item arrived in very unfriendly packaging, and failed to function.  (Invoking the TEST function yielded no audible sound.  What a useful alarm!)", "Date": "December 16, 2009"}, {"Title": "So Far, So Good", "Author": "Kasha", "ReviewID": "R29TWQ4A6SXAWI", "Overall": "4.0", "Content": "Purchased this unit for my 83-year old mother who lives alone and has lost her sense of smell.  Installed it in her bedroom.  A different unit is installed in the den off the kitchen.  The gas company told her there was carbon monoxide build-up in the front portion of her ranch-style, single-level house.  The CO2 source was her 50 year-old gas stove and gas water heater.  The gas company tech advised that a hose on the water heater be shortened and that the back door be kept open to dissipate the gas.  Purchasing this unit was a more reasonable way to solve the circulation problem since the temps were below freezing.  It is very easy to install and set.  Instructions are simple.  Plug-in convenient.  All features are simple enough for almost anyone to use.  During my 3 week visit there were no false alarms or malfunctions.  The unit works as described and gives me some peace of mind 600 miles away.  Unfortunately, the only way to know if it functions as designed is when there is a problem, which is why it gets 4 stars for now.  Keeping my fingers crossed.  FYI: There was also a buildup of carbon residue around and under the stove top, which can be raised like the hood of a car. It looks like black soot and also gives off an odor.  Gas company said this is not harmful but should be regularly removed.  Check with your own company.", "Date": "December 14, 2008"}, {"Title": "CO alarm", "Author": "Michael Williams", "ReviewID": "R1OZSYI54Y8KPX", "Overall": "3.0", "Content": "Hope it's working.Plugged it in and forgot it. Meets Ohio new construction building code for hardwired specification.We had a recent MURDER via CO poisoning. See Dateline \"Wangler\".Be safe!", "Date": "November 26, 2012"}, {"Title": "defective", "Author": "DLE", "ReviewID": "R2SK5FZ0A80G99", "Overall": "1.0", "Content": "Alarm won't sound when tested. Had a friend look at it and he confirmed that it was defective. He suggested that I stick with Kidde, not First Alert.", "Date": "November 14, 2012"}, {"Title": "No way to tell if it's really working", "Author": "CTmomma4", "ReviewID": "R1ZAMOT7O6WIK1", "Overall": "1.0", "Content": "This product is kind of a waste. You have no way to tell if it's actually working. There is a button on it to see the last reading or highest reading but it always says 0 for me. I have limited faith in whether this is actually working.. I would Not recommend.", "Date": "April 17, 2012"}, {"Title": "NOT Reliable", "Author": "Dean", "ReviewID": "R3MJYDA6ROOB81", "Overall": "1.0", "Content": "Tested it by putting behind my vehicle's muffler while my car was running.  Tested all 4 I bought and only 1 of the 4 I bought went off.  I tried test it a second time a few hours later and 2nd time none of them went off with no reading. I returned it to Amazon and bought the  another brand. Worked great.", "Date": "June 2, 2012"}, {"Title": "Priced Right", "Author": "arid47", "ReviewID": "RZANGQ2MPAJQP", "Overall": "5.0", "Content": "I ordered an 8GB Kingston flash drive.  The price was right and I had no problems.Excellent performance.", "Date": "February 26, 2010"}, {"Title": "Is it working?", "Author": "Bernard Schmidt", "ReviewID": "R20YFLJPC7YL32", "Overall": "5.0", "Content": "Simple setup with clear instructions but don't have confidence that it is working.  No alarm is OK?", "Date": "December 24, 2008"}, {"Title": "BAD product! Do NOT buy it", "Author": "D. Chen", "ReviewID": "R2FXLQ2OOP5C0P", "Overall": "1.0", "Content": "we bought it in April and didn't open the package until now. Guess what--the cover for the battery is broken. It's not working. Poor product with no quality!  Do Not buy it! I know I can't return or exchange it as it has passed 30 days. I just want to alert everyone that you should not buy this one.  Look for something else. this brand is NO good.", "Date": "August 31, 2013"}, {"Title": "Russell Starner", "Author": "Russell A. Starner", "ReviewID": "R3JPEDQQR0JN6G", "Overall": "3.0", "Content": "After the purchase I didn't realize that the best place for the unit in up high. Unfortuately where I live now won't allow many things to be hanging on the walls. The biggest drawback to the unit is the cord that is used to plug the unit into the wall. I do like the battery backup feature. I got the unit for safty purposes. I had no reason to test the unit yet. I hope that I didn't waste money by buying the unit.", "Date": "November 21, 2007"}, {"Title": "Poor product", "Author": "A. Narayana", "ReviewID": "R1XW6J6DF2C37B", "Overall": "1.0", "Content": "After inserting the batteries, the battery door would not close.  It will be difficult to trust this product to save your life.  Based on another reviews, this company should be ashamed of itself.", "Date": "August 2, 2009"}, {"Title": "EXPIRATION", "Author": "Norm DePlume", "ReviewID": "R27ZEN8JTG680Y", "Overall": "1.0", "Content": "The instructions (inside the sealed package) say that this device has a timer which will cease all functions after five years.  Screw that.  I guess I'm renting this thing.", "Date": "March 10, 2010"}, {"Title": "End of the line", "Author": "David C. Hall", "ReviewID": "R23M3ROCWXJ7U", "Overall": "1.0", "Content": "My last purchase at amazon.com.  I bought two alarms.  One worked, one did not.  Alarm horn did not sound.  Had a previous problem buying a blood pressure machine, grotesquely misdescribed on the website.  I have heard that Amazon has a no-return policy.  Really does not matter.  My time is too valuable to pack, address and go to the post office.  Bye Amazon.  Bye First Alert.", "Date": "January 16, 2011"}], "ProductInfo": {"Price": "$59.99", "Features": "Plug-in carbon monoxide alarm with battery back-up and digital display\nUses electrochemical carbon monoxide sensor--the most accurate technology available\nSimple to use silence/test button\nLow battery warning; end-of-life timer\nIncludes two AA batteries; 7 year limited warranty", "Name": "First Alert CO615 Carbon Monoxide Plug-In Alarm with Battery Backup and Digital Display", "ImgURL": "http://ecx.images-amazon.com/images/I/41uQAsra-XL._SX300_.jpg", "ProductID": "B000Q5VMKG"}}