{"Reviews": [{"Title": "As good as the original!  Simple to program.", "Author": "DanikaCo", "ReviewID": "R1XM5OVO3D36ZR", "Overall": "5.0", "Content": "I purchased this replacement remote with little hope that it would be as good as the original... but it really is!  I can start my car from hundreds of feet away, and it took me about 2 minutes to figure out how to program it to my car specifically.  It does everything the original does, and looks just like it.  The range if fantastic, set-up was easy, and I just couldn't ask for anything more.", "Date": "October 15, 2010"}, {"Title": "Car Starter", "Author": "Holly J Whipple", "ReviewID": "R1REO7330HHM33", "Overall": "5.0", "Content": "I am very pleased with my purchase of the replacement car starter. In  NY winters are cold so I like having the warm car when I go out the door. The only down side is that you really can't program it yourself. We had to go to Best Buy and pay additional money for them to program it for us. There is a computer needed to do it.Love the warm car though so it is worth it!", "Date": "February 15, 2012"}, {"Title": "Great Replacement Car Starter Fob", "Author": "borchavic", "ReviewID": "R2GKXP8NH3NUUO", "Overall": "5.0", "Content": "I had to replace my old fob as I lost the metal piece to connect the battery on the old one. This one is welded in so I shouldn't have to worry about that any more. The instructions are easy to follow and I had it working within just a few minutes.", "Date": "January 11, 2012"}, {"Title": "Great purchase for the price.", "Author": "Nicholas Baker", "ReviewID": "RWKG1EQOCWJ6M", "Overall": "5.0", "Content": "This replacement remote is a great purchase if your car starter remote is not working or you have lost it.  I would recommend this product to anyone.", "Date": "November 5, 2012"}, {"Title": "Valet Remote", "Author": "therealmr815", "ReviewID": "RA0BYVGZWLEJ0", "Overall": "5.0", "Content": "FIND THE RE PROGRAM BUTTON BEFORE YOU BUY!!!! I bought this because the buttons on my old remote weren't responding. I bought batteries and that wasn't it. I guess after 5 years of pressing the same button it retires. This comes with the instructions and works just like the original. Find the button on your vehicle so to can program it and no more waking up to start your ride on those cold days! Aaaah warm truck on cold mornings :D", "Date": "October 7, 2012"}, {"Title": "Works Good!", "Author": "MusicDVDs- 5.1best \"will\"", "ReviewID": "R1Z85MGAXML6VC", "Overall": "5.0", "Content": "Item was as described and less than retail store cost. Took it to Circuit City where I bought my remote start system and had them program it. I found out they never installed the Valet Switch that came with it which is required to program the remote to your car. It only took a few minutes after that to program it. My car does not have an alarm, just remote locks, which is why they probably thought I would never need a Valet Switch...but you do to reprogram a replacement remote.", "Date": "January 25, 2007"}, {"Title": "Works as advertised", "Author": "Gennaro Maffia", "ReviewID": "R1PTJ8QB4N5Q5Q", "Overall": "4.0", "Content": "The remote works as indicated. You need to have it programmed by someone who knows how to do it (i.e. 20 year old in Best Buy) as there are no instructions. Still cheaper than buying it in a retail store.", "Date": "January 30, 2010"}, {"Title": "auxillary remote", "Author": "Diane L Price", "ReviewID": "R1HSJ2W7D6U3QR", "Overall": "5.0", "Content": "We needed a second remote and this is identical to our original programming was easy once I found the remote start module", "Date": "April 29, 2014"}, {"Title": "Works just like the original!", "Author": "Kileywine", "ReviewID": "R2SSXL649C1GOM", "Overall": "5.0", "Content": "Bought this after my original (after market) remote starter broke for my 2003 car. I did not want to spend the $$ on a new remote for such an old car. Luckily for me- the remote was easy to program and works great!! I have had it now for 4 months with no problems! Works the same as the original. I would recommend it to anyone. Just make sure that it is the correct model:-)", "Date": "April 27, 2014"}, {"Title": "AMazingly easy to work with", "Author": "J. Powell", "ReviewID": "RJY3S3YWSBWT7", "Overall": "5.0", "Content": "I bought a remote from them and they were prompt and the information they provided was very easy to use. As it turned out the unit I bought did not work with the model I have and they refunded my money no questions asked. Really went above and beyond. The Best", "Date": "April 22, 2014"}, {"Title": "No Way", "Author": "Max T. Cat \"MaxCat\"", "ReviewID": "R29OQXD5VXWN54", "Overall": "1.0", "Content": "I worked and worked with these things and never got them to work, but I have found this is common with any after marked remote ya pay your money and take your chance, save it! Max", "Date": "February 26, 2014"}, {"Title": "viper", "Author": "Jeanmarie Vollner", "ReviewID": "R2T5F8TQE2XWGD", "Overall": "1.0", "Content": "would not snyc with my starter  best buy tried but i had to search for one that would snyc with my starter", "Date": "February 23, 2014"}, {"Title": "Easy To Set UP Instructions Included", "Author": "D. Baltezore \"dbalt\"", "ReviewID": "R3QL09PPGJT7YZ", "Overall": "5.0", "Content": "Works Great. Easy to program. Fast Shipping. Great Purchase Experience.I got these because the old ones on my son's car were getting warn completely out.", "Date": "January 19, 2014"}, {"Title": "Great deal", "Author": "Bill", "ReviewID": "R2BZLYN9FGJHZX", "Overall": "5.0", "Content": "It was exactly what I was looking for.  I took my truck out to Best Buy with this and he had it programmed in about 1 minute!!!!!!!  Can't beat that! Works perfect too!", "Date": "October 19, 2013"}, {"Title": "All I need was the case.", "Author": "Dwight Williams", "ReviewID": "RFDT9OSCJ6AA4", "Overall": "5.0", "Content": "The remote I had worked very well, all I needed was the case, thanks Amazon, you always come thru for me..", "Date": "August 25, 2013"}, {"Title": "Good stuff", "Author": "jesse r", "ReviewID": "R3O9AMF4VGYCOH", "Overall": "5.0", "Content": "Directed products have always been well built products and I have been using them for years. These are inexpensive and new products.", "Date": "June 8, 2013"}, {"Title": "liked it a lot", "Author": "Aldo", "ReviewID": "R1KOIT4XDJJXV", "Overall": "5.0", "Content": "i liked it alot easy setup and whould recommend to a friend really nothing else to say i need some more words ok iam good", "Date": "March 20, 2013"}, {"Title": "Works great", "Author": "denisea123", "ReviewID": "R30I3J4FF0YMO6", "Overall": "5.0", "Content": "This works exactly like my original key fob that I lost last year. The price was great and my husband, who is not a mechanic, was able to figure out the code and get it working in a couple hours. Love being able to start my car in the morning from inside the house during the cold New England winters.", "Date": "December 15, 2012"}, {"Title": "Great device", "Author": "DaBoss", "ReviewID": "R3149KMXTZL2UA", "Overall": "3.0", "Content": "I brought this device and my recent one was lost this is a great buy it was cheap easy to find online works great", "Date": "August 8, 2011"}, {"Title": "473t works great", "Author": "Ronald G. Baker", "ReviewID": "R29WH0TGNB12ZC", "Overall": "5.0", "Content": "I purchased the 473t for a remote start system in my wife's 2001 Honda Accord that was an add-on. We loved the system and when the old remote just puttered out I went looking for a replacement. Found 473t part number on old remote and ordered. Item arrived. After reading programming instructions realized I had to activate a \"valet switch\". Couldn't find it; went to Best Buy in Watertown, MA. For $20.00 system was programmed and I was out of there in less than 20 minutes. Learned that aftermarket installer never installed valet switch. Even if you don't have the switch, the whole deal was less than fifty bucks, a lot less than a new system. Note:  Your vehicle may have the valet switch installed and then programming is a zip. Check under dash near steering wheel area. Good luck !!", "Date": "December 20, 2013"}], "ProductInfo": {"Price": "$59.99", "Features": "Replacement remotes for newer Directed Electronics products\nMini 3 Buttons Replacement Remote for Directed Alarms\nLock/unlock button\nSiren button", "Name": "Replacement Remotes", "ImgURL": "http://ecx.images-amazon.com/images/I/514GEB7M2KL._SY300_.jpg", "ProductID": "B0009SXOSS"}}