{"Reviews": [{"Title": "Lousy. falls apart in the pocket. Doesn't last long. At all.", "Author": "Kevin Wolf", "ReviewID": "R2POTCM9HDXV5H", "Overall": "1.0", "Content": "The 2-way feature is great on this remote. But just because you're paying 50-100 for this remote, don't expect it to be high-quality. I've owned two in the past, and each one has broken the same way. The first problem- Solder joints. After a couple of months, the solder joints (on both) would break, especially around the battery terminals. Easy fix- Simply resolder the joints. Next, the cosmetic paint and light labels will rub off, and thats when things start to go downhill. If you keep it in your pocket like other car remotes, the plastic case will start to break- Notably at the top right corner. Once that happens, the remote looks awful, and the keyring will fall out because the tabs holding the two halves together have weakened too.On top of all that, the second remote I have sometimes beeps, and sometimes doesn't.If you want the two-way feature, you can get this. But if you want a solid remote, consider buying the compatible 1-way version, P/N 7141V or 7141 P (python and viper remotes are interchangeable). It will not give you audible feedback, but it will save you frustration. They are compatible with the LED 2-way systems, too.I sure hope DEI's new systems use better remotes. Its a mystery to me as to why Viper Alarm systems are as popular as they are- nothing but plastic junk in my opinion.UPDATE:I picked up a less expensive one-way Viper remote that is compatible with my system (I was tired of throwing down so much $$ for a piece of crap). It is about two months old, and is starting to crack as well.", "Date": "January 30, 2009"}, {"Title": "Viper remote start", "Author": "mdoughty", "ReviewID": "RQXDLJS6R4PY6", "Overall": "5.0", "Content": "This is a great value, progamming taks a few seconds if you know where the \"valet button\" is. Turn on the key, push the valet button once, press twice and hold til chirp, then push the lock button on the remote and bingo you're done. If you read the instructions, you'll never figure it out.", "Date": "November 13, 2010"}, {"Title": "Perfect Replacement", "Author": "Dave and Cheryl", "ReviewID": "R2392H15TYBJX0", "Overall": "5.0", "Content": "This was an exact replacement for the remote that came with my Viper 771vx remote start alarm.  The original lasted about 4 1/2 years and was held together with a rubber band for the last two.  The case for the unit is not very well made and will come apart over time.  There are some instructions on the package for syncing the remote with the alarm.  The instructions were a little confusing because it looks like you're suppose to program a different channel if you have the remote start so it didn't work after the first try.  I used the instructions to program it to Channel 1 and it worked.  Other than that, it took a total of < 5 minutes to get it set up.", "Date": "April 19, 2012"}, {"Title": "Great Price !!", "Author": "GB27", "ReviewID": "RYJXGDFUET5DS", "Overall": "5.0", "Content": "I needed to purchase a replacement transmitter for my viper 488v and viper.com wanted a ridiculous price. So i thought about trying this guys out because mainly the price was more reasonable. Not only was the price great, the shipping was pretty quick. It only took 2 days to get it. I definitely recommend these guys, they are the best.", "Date": "February 26, 2011"}, {"Title": "Viper 488V remote", "Author": "Gregory M Cole", "ReviewID": "R2XR63G14OR82H", "Overall": "5.0", "Content": "Worked perfect.  It cost half of what best buy wanted to replace it for.  It was surprisingly easy to program, and I was up and running in 2 minutes.", "Date": "March 18, 2012"}, {"Title": "Works great!!!", "Author": "Love Viper Products", "ReviewID": "RCWY20PVVMSSI", "Overall": "5.0", "Content": "I purchased this replacement remote after my first one died after a whooping 6 years. It was easy to program and it works like new so far. Definitely recommend this remote if you need a replacement.", "Date": "September 19, 2011"}, {"Title": "Just as I expected", "Author": "Thomas C. Evans \"Ironhead3fan\"", "ReviewID": "R1YKLFH7QBO1BW", "Overall": "1.0", "Content": "**UPDATE** I haven't been able to use this remote for about the past year, it too, fell apart.  Very poor quality.I have a Python alarm system in my Honda Del Sol.  That was Circuit City's version of the Viper alarm.  Most remotes will fall apart after only a few years of use, and mine was no exception.  Just got this programmed to my system yesterday, and it works like new.  Hopefully, this will last longer than the last one did, but these things don't have the best track record for longevity.", "Date": "November 2, 2009"}, {"Title": "Dropped old one in water", "Author": "Carol Littleton", "ReviewID": "R3KBFJX53S40WS", "Overall": "5.0", "Content": "Afraid it would be costly to replace. It wasn't. Is very same one for a nice price. Received in a timely manner. Took to technician to program properly. Good experience all around.", "Date": "September 15, 2013"}, {"Title": "It Works!", "Author": "Troy", "ReviewID": "R17O7YR6DK1NCM", "Overall": "5.0", "Content": "Fast delivery, same as the original remote, very easy to install (program) & 1/3 the price of the local shop.", "Date": "July 27, 2013"}, {"Title": "work's like an charm...", "Author": "Antione2k6", "ReviewID": "R33SXXR4O7ERGS", "Overall": "5.0", "Content": "It work like a charm. I took the old brain out of my old remote and put it in the new one.", "Date": "July 4, 2012"}, {"Title": "So far so good", "Author": "Barb", "ReviewID": "R2T23AZ5B2LNTR", "Overall": "5.0", "Content": "We have only had it about a month or so, we took it to best buy & they set it for free & it has worked like a charm so far.", "Date": "September 1, 2011"}, {"Title": "Works just like the original!", "Author": "Richard Schuster", "ReviewID": "R22WMVGX4XBRYV", "Overall": "5.0", "Content": "After super gluing the old remote at least 6 times it finally gave out. This is an exact replacement. Directions are difficult to understand so I took it to the shop I had install the alarm. Found out they originally didn't install the alarm correctly so they made it right. All is well that ends well.", "Date": "January 4, 2014"}, {"Title": "Good product-get the matte black finish", "Author": "Mark5", "ReviewID": "R3GTE68BJBD9K3", "Overall": "5.0", "Content": "Works well.  This is the second remote I've bought for this model alarm, 771XV Viper.  This first remote was from a different vendor and had a glossy finish.  It did not last long.  This item is a matte black finish and seems more durable.  Not sure why there is a difference, but my original remotes were matte black.  Remote came in a sealed bubble pack and definitely was new as bubble pack had to be cut open with the jaws of life.Seller shipped item in a timely manner and item was accurately described.", "Date": "November 25, 2013"}, {"Title": "Satisfied!", "Author": "Chris", "ReviewID": "R3CCRRW1S1GEL2", "Overall": "5.0", "Content": "It shipped in three days as indicated. Took no more then 5 minutes to program. With the help of the previous posts. It's working great. Glad to have a back up considering our second remote broke.", "Date": "November 20, 2013"}, {"Title": "Watch the programming instructions", "Author": "Gary Bruce", "ReviewID": "R1L3F12SFSE9H9", "Overall": "5.0", "Content": "Many instructions on the web say to press the programming button in the car 8 times, holding it on the 8th press.  If that doesn't work, try pressing the programming button only 2 time, holding on the 2nd press.  Different Viper models that work with this remote require different programming procedures..", "Date": "August 23, 2013"}, {"Title": "Awesome!", "Author": "greendayrules", "ReviewID": "RKDSI84CWNWGX", "Overall": "5.0", "Content": "I bought this remote to replace a broken remote. These remotes are great but break easily. Make sure to buy the leather case along with this remote in case you drop your keys your remote is protected.", "Date": "February 19, 2013"}, {"Title": "Quality and savings!", "Author": "FRANCISCO PEREIRA JR", "ReviewID": "R1C4UWNB8UB9WK", "Overall": "5.0", "Content": "This unit works perfect and the price and quality is just right!  I'm planning on purchasing another one for replacing the original.", "Date": "May 2, 2014"}, {"Title": "Works great", "Author": "J. A. Koenig \"JAK\"", "ReviewID": "R2KMVSOYIIIGXN", "Overall": "5.0", "Content": "Very happy to find a replacement remote for our starter and at a really good price.  Ours gets dropped once in a while and breaks so I may have to order another one just to have on hand.", "Date": "April 30, 2014"}, {"Title": "Genuine Alpine Remote", "Author": "BQ \"Allharley\"", "ReviewID": "R1MAD9V3CNKF84", "Overall": "5.0", "Content": "Needed a new remote to replace my 11 year old remote. This was a good price and is the real deal and worked perfect.", "Date": "April 23, 2014"}, {"Title": "Great so far. Paired with a Python system.", "Author": "-Clint-", "ReviewID": "R19LB4SLO12851", "Overall": "4.0", "Content": "Other than being packaged in the clam shell package of doom, this thing is working great, I had no issues pairing it with my Python car alarm.The blue even matches my car almost. This is the exact same remote as my Python, even plays the same tune when you insert a new battery.  only difference is the color and the name on the sticker.", "Date": "April 18, 2014"}, {"Title": "Amazing", "Author": "Great Buy", "ReviewID": "R17LBBRW1XV8GG", "Overall": "5.0", "Content": "Works just fine and at a great price could not have done any better sure meet my expectations. Thank you!!", "Date": "April 4, 2014"}, {"Title": "ups & downs", "Author": "djspookay", "ReviewID": "R3D57X0THN456C", "Overall": "4.0", "Content": "the 1st time i got a viper system was with this 2 way remote.  It a good system the only down fall was that the 2 way remote is kinda crappy.  one day i drop my key and it fell apart.  i had to tape it and before the price on a replacement was like $100, which it wasnt worth it. i would still recommend it to a friend tho. especially now the price is like $50.", "Date": "March 24, 2014"}, {"Title": "Great quality", "Author": "Amazon Customer", "ReviewID": "R2PKIQEZ7S4AH", "Overall": "5.0", "Content": "Works exactly as it should and was not hard to program. Just have to take it to an installer to make my remote start work but the lock/unlock was a breeze.", "Date": "March 10, 2014"}, {"Title": "does not last long", "Author": "DAK", "ReviewID": "R2LPK4FTVEULQ9", "Overall": "3.0", "Content": "I am on my 4th remote in 8 years and this last one lasted less than 2 years, buttons quit working or they come apart in pocket, other than that they work great.", "Date": "February 9, 2014"}, {"Title": "Starter UP", "Author": "ANDREA PHILLIPS", "ReviewID": "R2Y2E6167T1CV6", "Overall": "5.0", "Content": "I bought this for my sister she had one the came with her truck and it was tape together  this product was perfect and easy to use larger buttons and bright colors. When she received it the easy instructions the truck started right up and the distance was a little farther on startup then her original one. Product item also appeared to also be sturdy made. Thank You", "Date": "February 2, 2014"}, {"Title": "It's always warm in my freezer", "Author": "Ben Wolfe", "ReviewID": "R3P8MEPGXKCJZT", "Overall": "5.0", "Content": "I've had four of these in 5 years. Best advise it to take care of it like its an infant child.", "Date": "January 30, 2014"}, {"Title": "Cant figure out how to program it", "Author": "Art Charvat", "ReviewID": "RC5ZOHVBWES3C", "Overall": "1.0", "Content": "Programming instructions vague. Do not recommend this system for do it your self installers. Will probably have to pat a dealer to program.", "Date": "December 23, 2013"}, {"Title": "great alarm with flaws but better then most", "Author": "D. Hardingham \"Magnusfl\"", "ReviewID": "R1YZOBLSX5B8P2", "Overall": "3.0", "Content": "Great alarm with 2 way which in range lets me know when some hit or messing with my car and takes a AAA  batteryThe down side is it eats the AAA battery but at least when it warns you of  a low battery there easy to find.one other reason I gave it 3 stars the quality of it as i had to replace the first as it died and the the second has issues with coming apart just like the first one which helps with tape assist to keep it together.", "Date": "December 15, 2013"}, {"Title": "programming", "Author": "Joseph", "ReviewID": "RESSUMSTTSAME", "Overall": "4.0", "Content": "Little confusing to program as I do not have the original instructions and it was preinstalled on my vehicle. But so far so good.", "Date": "December 8, 2013"}, {"Title": "3rd replacement in 4 years", "Author": "Nicolette", "ReviewID": "R8P6AT57LOTXN", "Overall": "3.0", "Content": "This is my third replacement I started with a python 488p , replaced it with the clifford version about a year ago (of course I can't remember how to program it) these don't hold up well to kids dropping your keys! it busts open and you spend the next 20 mins on the ground trying to find the plastic pieces that cover the lights! if i remember correctly it is Door open turn key to on, press the vale <is that how you spell that? and then press and hold the button. I tried this and my car went into power saver mode and now wont start!", "Date": "November 5, 2013"}, {"Title": "haven't used", "Author": "Sweets", "ReviewID": "R86IHVZQO1P1F", "Overall": "3.0", "Content": "I still haven't used this even though I need it because I can't figure out how to program.  The instructions are obviously written for a technician, not an average person such as myself.", "Date": "October 28, 2013"}, {"Title": "good remote if you are careful with it.", "Author": "Manh Do", "ReviewID": "RCG366TKKY2DI", "Overall": "4.0", "Content": "good remote, however it's about the 4th one I have had over the lifetime of my alarm.  wish it was better constructed so it doesn't break up into the component pieces when dropped. suggestion of a case for it at time of purchase would be in line.", "Date": "September 23, 2013"}, {"Title": "just as described", "Author": "Frank Eates", "ReviewID": "R3VLZH3D1OBK0Q", "Overall": "5.0", "Content": "item mailed on time price was good very happy but not happy about being made to type so many words the fact that i am happy should be good", "Date": "September 15, 2013"}, {"Title": "Good Relacement for the money", "Author": "Heather", "ReviewID": "RLMKTK3V3SPWE", "Overall": "4.0", "Content": "This was easy to program once I had read prior customer reviews for programming. Great value for the price. Received quickly.", "Date": "September 8, 2013"}, {"Title": "starter works great", "Author": "Bruce dockter", "ReviewID": "R3F9FGDH0L85BV", "Overall": "5.0", "Content": "This starter works greats. It tends to burn up AAA batteries rather quickly but so did the origonal. Fortuantely I was able to find a replacement. The place I origonally purhased it from no longer carried it.", "Date": "September 3, 2013"}, {"Title": "Works great for Python 571 XP model remote start", "Author": "BIGGUN", "ReviewID": "R278JOEPSLX5OA", "Overall": "5.0", "Content": "I had to play around with it a couple of times to get it to program properly.  I think the press once and then a second time was the method that worked.  Now it works perfectly!", "Date": "May 10, 2013"}, {"Title": "Python 488P Ask LED 2-Way HHU Remote December 28, 2012  Python 488P (edit)", "Author": "J. Phillips", "ReviewID": "R3DULFEVNA8CG3", "Overall": "5.0", "Content": "2-Way HHU Remote  Python 488P. First on worked so good order one more to put up. Great to have one that work and trash the old one that was broken", "Date": "December 28, 2012"}, {"Title": "Replacement Remote", "Author": "Chris", "ReviewID": "R1YSDA7NP4LSQG", "Overall": "5.0", "Content": "Purchased this device to replace the remote for my remote starter.  The remote seems to break with some frequency as this is the 4th remote I have had in the 10 years I have owned the vehicle.  The device works great, but I would recommend knowing how to program it prior to starting as I messed up and locked down my truck.", "Date": "December 27, 2012"}, {"Title": "Super.", "Author": "Scooby", "ReviewID": "R2PQ7GD04503UN", "Overall": "4.0", "Content": "Received in timely manner and in good working order.  It helps to get a leather case to protect your remote fob.  They tend to disintegrate over time (manufacture design).", "Date": "December 26, 2012"}, {"Title": "Works as expected", "Author": "Brandon", "ReviewID": "R347T9A0CR66PV", "Overall": "4.0", "Content": "Works as expected and like the original did. Other reveiws were helpful in at least knowing to look for the button to program it. After a few attempts and process of elimination I was good to go. Location of mine was underneath the driver side dash, far left. Look for the box and follow to the button. Range is not that impressive, but it still works.", "Date": "December 15, 2012"}, {"Title": "very happy shopper", "Author": "Cathy W", "ReviewID": "R2MLU150KUGS32", "Overall": "5.0", "Content": "my purchase arrived quickly in a well packaged container.  Hope I never need a replacement but at least now I know where to go", "Date": "March 12, 2012"}, {"Title": "Great Item", "Author": "Xica", "ReviewID": "RM196O57FJ1B1", "Overall": "4.0", "Content": "I purchased this as a replacement controller for my original one died after almost 5 years of daily use. It works just like the old, the only exception is that it sounds different, but who cares as long as it sets my alarm properly. I took it into my local Best Buy and they were able to program it to my car, but i probably would have been able to do it myself if i had done some research.  so far i'm satisfied, hope to get another 5 years out of this one.", "Date": "February 6, 2012"}, {"Title": "Replacement Viper 488v 2-Way Remote", "Author": "Jeff", "ReviewID": "RX2YTIIMBRU78", "Overall": "5.0", "Content": "This has been a great remote since new in 2006. However age had taken it's toll on the original units (dropping, etc...). This OEM replacement remote is the exact same unit I received with my alarm / remote start in 2006. It took under 5 minutes & one procedure to program all the features including remote start & trunk release. A Great Value as they have been priced elsewhere at over $100 for some time. I am going to get another!", "Date": "December 11, 2011"}, {"Title": "great, just as described", "Author": "Elijah", "ReviewID": "R4FXA9YK4K6F2", "Overall": "5.0", "Content": "I've been looking and looking for a replacement for my fob that started to break and finally broke. After living with tape, and some glue, I chose to disconnect the Viper system and let it be. I came along this fob and thought I would just be buying the same poor quality as I had in the original. So far I am very pleased! Great price with a greater quality than before. Thanks for making me a believer in Viper once again.", "Date": "December 4, 2011"}, {"Title": "I finally got a new one. Not sure why i took so long to get one.", "Author": "Misslady in Az", "ReviewID": "R2F5G34S31XDC5", "Overall": "5.0", "Content": "This item is exactly what i had from the dealer. I dropped mine i don't know how many times. I Super glued and taped but after 4 years it was time for a new one. Thanks amazon because now i have one that stays together and that works.", "Date": "November 22, 2011"}, {"Title": "FAlls apart", "Author": "Laura", "ReviewID": "R1XE3Y23ZCUI5R", "Overall": "2.0", "Content": "This remote falls apart pretty quickly, not really worth it. Very disappointed with the quality this really mediocre product. Boo", "Date": "October 10, 2011"}, {"Title": "Nice replacement", "Author": "David Franklin", "ReviewID": "R3320QB44ES1K3", "Overall": "4.0", "Content": "Looked new and works just as fine. Wish these were alittle more resistant to breakage and the led light covers stay in sockets if dropped.  Overall I'm cool.", "Date": "October 4, 2011"}, {"Title": "GREAT replacement remote", "Author": "Kiya", "ReviewID": "R2YRH83LGI5LT3", "Overall": "3.0", "Content": "Viper sucks because this is the fourth remote I have purchased in 4 years. They always break even if you handle it carefully. However amazon had it the cheapest because it will run you over $100 if purchased in a store. So I got it within a week and it works fine.", "Date": "March 10, 2011"}, {"Title": "gift", "Author": "sue sue", "ReviewID": "R164V7M1FVCY20", "Overall": "4.0", "Content": "for my son in law i have not heard any complaints therefore it must be working great or he would tell me otherwise", "Date": "January 5, 2011"}, {"Title": "Review Viper 488V Led 2-Way Remote", "Author": "Flescorpio", "ReviewID": "R36EBWQNNHKW0Q", "Overall": "4.0", "Content": "The Viper 488V Remote is a replacement.  The previous was 4 years old.  This remote meets all of my expectations.", "Date": "May 4, 2010"}, {"Title": "Thank you Amazon!", "Author": "K. Tongue", "ReviewID": "RYUSQX65A2ADV", "Overall": "5.0", "Content": "Fast shipping was a plus. The remote is very easy to program. Great for a spare remote or an replacement. Same remote on the viper site is $100 or more!", "Date": "March 17, 2010"}, {"Title": "Falls apart", "Author": "jcatt", "ReviewID": "R1TKTC1JX8EPUK", "Overall": "1.0", "Content": "This is my third replacement remote in two years. The first two were within the first year and were replaced by the company after many phone calls, emails and letters. This one is a good price - stated new, but did not come in package and no directions . I would have replaced the whole sstem but thinking of getting a new car within a year - hope this remote will last that long.Viper 488V Led 2-Way Remote", "Date": "January 21, 2011"}, {"Title": "Biggest Piece of junk!!!", "Author": "mycincinnatidj", "ReviewID": "R1EEKI7RE034J4", "Overall": "2.0", "Content": "This remote is the biggest piece of junk... It breaks within the first month of use.  The keyless entry/remote start system is great but once the remote breaks, you have to shell out a small fortune to replace it to maintain the system's worth.  I would recommend the newer models, even the new iphone app remote starter kit.", "Date": "July 19, 2010"}, {"Title": "Alarmed again", "Author": "Jessie C. Love", "ReviewID": "R3OERTEYL1ZZUL", "Overall": "5.0", "Content": "Thank you for keeping this alarm key in stock. It was brand new and it is working like my old one use to work. Great!", "Date": "June 26, 2010"}, {"Title": "Viper 488V replacement remote review", "Author": "R. Brunz", "ReviewID": "R1GGRD57MA0J84", "Overall": "4.0", "Content": "The remote was good, but it did not come with the necessary pieces to make it actually work. I feel a little gypped.", "Date": "February 15, 2010"}], "ProductInfo": {"Price": "$169.99", "Features": "Led 2-Way Remote", "Name": "Viper 488V Led 2-Way Remote", "ImgURL": "http://ecx.images-amazon.com/images/I/41kUZ2j7VoL._SY300_.jpg", "ProductID": "B000WNP1AY"}}