{"Reviews": [{"Title": "I've bought it three times", "Author": "Diane", "ReviewID": "R2NBYPH0K9FRJH", "Overall": "5.0", "Content": "I have been very pleased with this sensor.  I just bought it for a third office.  You can put the speaker anywhere within 100 feet so it doesn't have to be up front chiming at everyone in the waiting room.  I want to be able to hear it when I am in the back of the office so I can put the speaker there......this is perfect for that.  Plus the two small boxes that go on the door and frame are nice and small.  Works perfect - great price.", "Date": "February 2, 2008"}, {"Title": "Excellent product!", "Author": "izquierdo8", "ReviewID": "R1461N3T9JV2VN", "Overall": "5.0", "Content": "I've had a Heath Wireless Plug-In Chime with Entry-Alert Sensor for over ten years. Just bought another one, for my son, for his mailbox.  I use it for my mail alarm. Placed the sensor and magnet in the box, the bell unit is plugged inside house.... Saves trips to check the mail. Also, used it for a bell for disabled person's bedroom. (use a Heath-Zenith compatible button for this), it rings the same box as when my mailbox is opened.  Never had a problem with the unit. Works great!", "Date": "January 1, 2010"}, {"Title": "Product works as expected", "Author": "Amazon fan \"AF\"", "ReviewID": "R54WVCJIAHF4H", "Overall": "5.0", "Content": "Very easy to install.  I have the chime plugged-in in the basement and the sound is loud and clear.  The volume can be adjusted as well.", "Date": "August 28, 2007"}, {"Title": "Nice chime - but volume doesn't work", "Author": "SuperN \"consumer\"", "ReviewID": "R2PW0XHRZX6TBG", "Overall": "4.0", "Content": "The chime is perfect if you wish to plug-in away from the door - but the volume adjust doesn't work.  Seems to have just a single setting.  But it works fine for our office where we have the sensor on the main door and the chime plugged in the back lab where we can hear it through the back office.", "Date": "December 22, 2008"}, {"Title": "Product Description is misleading!", "Author": "D. Hensley \"maverick\"", "ReviewID": "R1HJVS3X268D1L", "Overall": "3.0", "Content": "Be warned! This item is NOT a doorbell or ringer, where people at your front door push a button to summon you. It is ONLY an entrance alarm/charm, for use in businesses to alert when a customer enters a shop!In the picture, the middle sized item is a sensor/transmitter which you mount on the doorjam and the small one is a magnet, which you mount on the door. When the door opens and they separate, the chime sounds from the large item, which you plug into an outlet.The description used the term \"doorbell\" several times.It seems passable for its intended use, though the chine setup is somewhat complex, you use \"jumpers\" like you'd find on computer hardware to change settings. The volume adjusts well and the chine tone is clear", "Date": "August 2, 2007"}, {"Title": "Would be great if it always worked", "Author": "jack sprat \"swervin\"", "ReviewID": "R2B3TGCP7CPF6L", "Overall": "3.0", "Content": "I use this for a door chime for when customers come into my store.  It is well designed, easy to install, has nice features.  The only problem is, it only chimes about 3/4 of the time.  The transmitter light goes on every time the door is opened, but the receiver only responds 3/4 of the time.  I haven't been able to figure out why.  I haven't measured the distance but it's not excessively far.", "Date": "July 21, 2008"}, {"Title": "Won't work on metal door", "Author": "Patty", "ReviewID": "RLECVQXF28E0P", "Overall": "3.0", "Content": "Bought this for an office door which is mostly glass but with metal trim and this alarm will not work.  Am going to try and work around this but wish it was stated prominently that it wouldn't work on metal.", "Date": "February 28, 2010"}, {"Title": "Customer Alert", "Author": "Daniel J. Morris \"Delish Donuts\"", "ReviewID": "R2J41TPQ1JQ7VX", "Overall": "5.0", "Content": "We needed to have a remote door sensor to alert us when customers came in while we were in the back working. The product works perfect. Set up was easy, but don't use the stick tape, screw it in. Our door jambs are metal and heated up with the sun and down came the sensor.", "Date": "November 30, 2009"}, {"Title": "Sounds like a good idea, only if it worked.", "Author": "Clinton Buhler \"Audio Guy\"", "ReviewID": "RA21T8QNK6QN7", "Overall": "1.0", "Content": "I ordered this unit to replace our broken Radio Shack door chime that served us in a commercial environment for about 10 years and is no longer made. This model was one of the few that had the features that we needed. We needed a door tripped sensor which wirelessly transferrs to the chime back in our offices so we could hear customers comming in to our store. The range is nowhere near the specified number. It works most of the time within about 15ft of the transmitter, but that won't work for our application. Even at 15ft it didn't work every time. We'd have customers standing in the showroom for awhile wondering if there was anybody there. It really sucks pretty bad. I don't recommend it. It's not reliable.", "Date": "September 15, 2009"}, {"Title": "It needs to work 100% of the time!", "Author": "Stefanie", "ReviewID": "R3AOXT6SMY5T1S", "Overall": "1.0", "Content": "Unfortunately, it works when no one opens the door, and does not work 100% of the time when people DO enter. Therefore, it's pretty useless for a business. I would love to return it, but I didn't even keep the box. A waste of money.", "Date": "January 20, 2014"}, {"Title": "range is too small.", "Author": "muni polavaram", "ReviewID": "R2LL9E83XERZ5W", "Overall": "2.0", "Content": "Product spec claims 100ft, but does not chime beyond 25ft if you have racks in its line. If signal can not reach 100ft then why claim it.", "Date": "July 15, 2013"}, {"Title": "Charmed with Chime", "Author": "FishFrank", "ReviewID": "RHIL4G0KITN7J", "Overall": "4.0", "Content": "Bought a couple years ago for our office.  Only had to replace batteries once so far.  Works great.  Only problem is that since we can't mount it with screws and have to use a sticky backing instead then we have had to occassionally reattach it to the door with additional sticky backing.  Other that that, pleased with product.", "Date": "June 12, 2012"}, {"Title": "Needs modifications to work well", "Author": "DrSmile \"RSJ\"", "ReviewID": "R12QBU0RVCGC4", "Overall": "4.0", "Content": "In order for this product to work well, you have to change the frequency using jumpers, and unless the chime and sensor are real close together, you have to relocate the red antenna that's located inside the chime to the outside of the enclosure, which requires some minor handiwork with a screwdriver. I now have it working on my detached garage entry door which is about 100 feet away from the chime, and the chime is inside a bedroom in the house. Without those 2 changes it would not work reliably but once you have it set up its a lot of ding-dong for very little bucks!", "Date": "June 15, 2010"}, {"Title": "Works well even in low temps!", "Author": "EBF", "ReviewID": "R1E2YY30EEABYE", "Overall": "4.0", "Content": "We have a large porch and a couple years ago got tired of visitors \"sneaking up on us\", forcing us to run from upstairs to answer the front door. We had been using a \"As Seen On TV Driveway Patrol Infrared Wireless Alert System\" inside our porch screen door to be alerted to visitors before they got to the front door, however, after 18 months, the bitter cold Mid-west temps caused a series of three \"Driveway Patrols\" to give constant false alarms (often at 2 AM!). I realized we needed a differently designed tool for the job.After a bit of research, I learned that the heat sensing of the patrol device was not reliable and magnets where the solution! I found several different magnet type entry alerts, but chose the \"Heath Zenith Wireless Plug-In Chime with Entry-Alert\"  after reading the other reviews and the reasonable price. We've had this device for about four weeks and it has worked consistently during our very cold weather during that time.I've only have two issues with the \"Heath Zenith Wireless Plug-In Chime with Entry-Alert\". First, one of the two 23A 12v batteries included with the device was dead-- luckily I'd already ordered and extra spare battery (Wireless Doorbell Replacement Battery #SL-6198-B). Second, the chime must be plugged in (it does not have a battery option), so it limited the locations we could place the chime. The nice thing about the \"Driveway Patrol\" was the chime runs on batteries allowing us to place it where it could be easily heard.Shortly after successfully setting up the Heath Zenith Chime system, I realized we needed to get a second chime (due to the first one being poorly located at our only available plug-in receptacle downstairs). Many of the Heath Zenith chime systems share the same signaling and the systems can be joined together to expand your home coverage. As we only needed one door entry alert, I went with a \"Heath Zenith Basic Wireless Plug-In Door Chime with Two Transmitters, White #SL-6142-C\" (a chime with two doorbells). Now we have one chime upstairs and one down as well as a doorbell for both the front and back doors.", "Date": "December 26, 2007"}, {"Title": "Perfect", "Author": "Jen", "ReviewID": "R127U5RZ00M1NB", "Overall": "5.0", "Content": "Perfect for working in the back room while being alerted to custormers coming in the front door. No problems except we dropped it and a plastic thing broke off of the battery case sliding door.  You can change the Westminster chime to a single Ding and its not going to drive everyone crazy. Works thru a glass window. Get the extra battery just in case.", "Date": "April 15, 2008"}, {"Title": "sound sets the alarm off", "Author": "e.c \"busy mom\"", "ReviewID": "R2B2W4PXGY8UWO", "Overall": "1.0", "Content": "I bought this door chime to let me know when the front door has been opened.  Thus allowing me to be aware if my children have opened the door.  The chime works great for this reason, and it is loud for me to hear upstairs.  However, if a movie is on, or music, or when one of my children or I play an instrument it also goes off.  This is very annoying!  Now when I hear the chime I'm pretty sure it is not from the door being opened.  This door chime would only work in a home that is as quiet as a library.  I now have to try and find a different alarm that is not sensitive to sound.", "Date": "April 23, 2008"}, {"Title": "Not worth it", "Author": "JIm Morrison", "ReviewID": "R2641UYJH9XD5T", "Overall": "2.0", "Content": "It is very inconstant. It only rings the bell about half the time the door is opened. When it works it's fine", "Date": "March 25, 2014"}, {"Title": "Works sometimes", "Author": "A. Battaglia \"Andy Battaglia\"", "ReviewID": "R31REHH0MH6RK3", "Overall": "2.0", "Content": "Does not work every time, rendering it useless. It's for a store and has no value if it does not sound every time.Back on Amazon looking for one that is dependable.", "Date": "December 27, 2013"}, {"Title": "Failed product.  Well managed by company!", "Author": "weeddds", "ReviewID": "R3BBSMWWECC49B", "Overall": "1.0", "Content": "We often work in the back of the office and I purchased this alert chime to let us know when a customer enters the front door.  I was happy with the device for about a week but then noticed that it would fail to chime once in a while.  I don't know if the failure to chime had always been happening or if it simply took a week for me to notice it.I tried to test it in different ways to determine the cause and it seemed that if the door was opened fast enough, it wouldn't register.  This is just my suspicion and I certainly didn't measure and record door velocities.About two weeks into operating this device it stopped working altogether.  The part on the door would light every time the door opened indicating that the magnets were working and the signaling device was working.  I think the problem was with the receiver.  It had the typical \"electrical\" smell indicating a possible short circuit and/or failed electrical part.I went through the return process with Amazon and within 30 minutes had received a reply from the company that they were issuing a refund with no return required.  I'm glad things were handled so well and that I'm not on the hook for shipping return costs.  I really wanted this item to work.  At first it seemed there was hope but alas, in the end it failed.  Item = 1 star.  Company and return process = 5 stars.", "Date": "December 3, 2013"}, {"Title": "Great for home or office", "Author": "Kelly", "ReviewID": "R3QBOLNL6Q2G5", "Overall": "5.0", "Content": "I've purchased this item for both home and office use, and it works great!  We use it at home for the back door leading out to the pool area, and it's a great extra line of defense to keep the kids safe.  I've also used it as an alert entry at a medical office to let us know when patients arrive.  Since you can plug the receiver in wherever is most convenient, we are able to keep it in a back area where we can back up the front desk staff in case they are away or busy.  Great instructions, only wish it would come with some double stick tape for mounting, but that's easy enough to find.", "Date": "July 31, 2013"}, {"Title": "Great chime for the office", "Author": "M. Tan", "ReviewID": "R32QUFX8RMES5C", "Overall": "5.0", "Content": "We use this in our office so we can hear clients entering our (blind) front entryway.  You need to change a jumper setting in the door module to get it to do a single chime but it works quite well.  The base (noise maker) must be plugged into a power supply (like a wall socket).  We placed ours at the end of the extension cord inside a file cabinet to dampen the sound (there is a volume control) yet stay close enough (50') to the door transponder.Works great.", "Date": "July 29, 2013"}, {"Title": "Works fine, don't know what everyone is complaining about", "Author": "Hise", "ReviewID": "RIN7YTW48LIRU", "Overall": "5.0", "Content": "Have it for the front door of my office and have the receiver in my personal office, roughly 65 feet away.  Works everytime so far, easy to setup.  Only complaint is the lowest volume setting is still a bit loud for me. Other than that good product.", "Date": "July 22, 2013"}, {"Title": "Works great", "Author": "Heavenly Valley Lodge \"Movie Maven\"", "ReviewID": "RDL6M77RDGAKT", "Overall": "5.0", "Content": "I liked the selection of chimes and the fact it has a volume control. Let's us know every time the door opens.", "Date": "March 28, 2013"}, {"Title": "Works great!", "Author": "Candy", "ReviewID": "RE6HZOKHB3UHJ", "Overall": "5.0", "Content": "Our office is located on the 2nd floor and our main door is located on the 1st floor.  We installed this chime (which was extremely easy) to alert us to people coming and going.  It works great!  Even when I'm not in my office or I'm down the hall running copies, I can still hear it!", "Date": "March 8, 2013"}, {"Title": "Alzheimer's Roaming Solution as Wireless Exit Warning", "Author": "P. Moskaluk", "ReviewID": "RT9YAN2FVA8J1", "Overall": "5.0", "Content": "Our mother has Alzheimer's wakens in the night and roams. This can be very dangerous as she could leave the home and get seriously hurt. We put wireless entry chime on her bedroom door to warn us if she opens her bedroom door at night. It's excellent. The only other alternative was to lock her in at night which would be dangerous.The reliable range is about 50 ft, but that's all we need.  Easy to install and not obvious so as to be threatening to someone suffering from Alzheimer's.It's a perfect product for this.", "Date": "March 7, 2013"}, {"Title": "does not last long when heavily used", "Author": "Tucker", "ReviewID": "R3VTAL4X5WNK2N", "Overall": "1.0", "Content": "used in a restaurant and they die after 6 months and u have to get new batteries. THey do not stick well to a door if it has a lot of temperature changes and are just built cheaply. Range is not what it says it is.", "Date": "December 15, 2012"}, {"Title": "Very loud & does not work at 100 ft", "Author": "SPP", "ReviewID": "R1AIQULVK7XFKP", "Overall": "2.0", "Content": "I should have listened to the other bad reviews for this one, but thought we'd give it a try.  First of all, the 100 ft distance is wrong. It worked at close to that, but only when it wanted to it seemed.  Definitely doesn't register at 100 ft.  The other main issue we had with this was it was way too loud, and the button to adjust volume was broken.  We had bought a 2nd chime, so we tried that one and even at the lowest volume, it was still way too loud.  We wanted this for our office, and there is no way anyone in our office would deal with this loud dinging every time the door opened. Why you couldn't adjust it to a quieter setting is beyond me-but this thing only has a couple settings Extremely Loud and then Moderately Loud!  Even if we had gotten the volume setting somehow worked out or it had a quieter setting, the distance was still a big issue for us.  We couldn't place it in a spot that worked for us since you could only take it maybe 50-70 feet from the door.", "Date": "October 4, 2012"}, {"Title": "Exactly what I expected...", "Author": "Jo", "ReviewID": "R5IYGHQEZ1H6K", "Overall": "5.0", "Content": "Extremely happy with it.  My only complaint is the volume adjuster on the sound box doesn't do anything.  In order to make it a little quieter, I had to tape gauze over it.", "Date": "May 29, 2012"}, {"Title": "Disappointed", "Author": "tommy", "ReviewID": "R2N0LONR6W6LAM", "Overall": "1.0", "Content": "When I got the productr I was really excited.  It worked for about 10 mins then stopped working completly. I am very disappointed with it.", "Date": "April 20, 2012"}, {"Title": "Great product!", "Author": "John", "ReviewID": "R3SPQY6OECE993", "Overall": "5.0", "Content": "Exactly what we need for the entrance of our shop.Replaced our last untit after 2-3 years of usage. Somehow it got less accurate and worked from time to time. I tried a new battery but still the same. A rough estimate of how many times it had to chime is around 40,000 at least! It's an amazing little unit.Just bought 2 extra units, just in case!", "Date": "November 19, 2011"}, {"Title": "wireless door announcer", "Author": "Aaron", "ReviewID": "R13QE17FR3MFV9", "Overall": "5.0", "Content": "This product works perfectly and as described. Ignore the posts by a few that didnt take due care to read the description. I have the chime around 80ft away from the sensor and behind a wall. It sounds every time the door is opened. If you need to know when someone opens a door, buy this product!", "Date": "September 9, 2011"}, {"Title": "Only worked intermittently", "Author": "Store Owner", "ReviewID": "RAOOSIM2OXL2H", "Overall": "2.0", "Content": "We installed this on a metal door of a retail establishment.  Apparently the metal interferes with the radio frequency.  We were told to put small pieces of wood between the door and the unit, but it still only chimed about 90% of the time.", "Date": "May 31, 2011"}, {"Title": "Wonderful product, good range", "Author": "Kimberly Raiser \"Author of critically acclaim...", "ReviewID": "RH1IV23IC4CPM", "Overall": "4.0", "Content": "The only reason I didn't give this a five star is because it's not fun to deal with internally, but the range is terrific.  I've only had it for a day, and the sensor is downstairs on the garage door whereas the chime is upstairs, and I can plug it in in any room!  Now I won't get snuck up on!!!", "Date": "May 14, 2011"}, {"Title": "Works great for my office.", "Author": "Shan", "ReviewID": "R2FJ2305E511TQ", "Overall": "4.0", "Content": "Have an office and a back room that needed some sort of ringer when the customers came in the front. Works just fine. Be sure to follow directions, and it should work just fine. Never had any problems with this unit as of yet, had this for about 6 months now.", "Date": "April 9, 2011"}, {"Title": "set up not as easy as it should be", "Author": "Chris D. Cody", "ReviewID": "R3V4AVF5A088Q3", "Overall": "2.0", "Content": "It took me several hours of trial and error, first moving the sensor location on the door and then changing the location of the chime, to finally find a location where the chime would work, even though every location I tried was not more than 30 feet from the sensor.There are two walls separating the sensor from the chime and once I got the chime located properly, it has worked just fine. It was frustrating and I almost sent it back", "Date": "August 23, 2010"}, {"Title": "It works", "Author": "D. Davis", "ReviewID": "R3GB13A8NPARIV", "Overall": "5.0", "Content": "Very short and to the point easy to install and set up. Use it for my office to alert me when someone enters the front door in case we are in the warehouse area. Very loud and destintive alert. Good product highly recommend it.", "Date": "May 21, 2010"}, {"Title": "Exceeded My Expectation", "Author": "M. Hur", "ReviewID": "RENBRYCNHQTZT", "Overall": "5.0", "Content": "Just installed in a small two story retail boutique setting.  The sensor is on the first floor in the back, the receiver/chime second floor in the front.  Works every time.  The magnet is about 3/4\" from the sensor which exceeds the recommended gap, but it still works.  The instruction says three tone settings are possible: Westminster, Ding-Dong, and Ding.  I'm using Ding-Dong.  I've ordered another one, so that I can install it on the front door as well.  I'll use the Ding tone to distinguish it from the back door.  I'll place the second receiver on the first floor.  So far, this is working great.  An included spacer will come in handy for the glass swing door in front.  I wish they sold the sensor separately so that I don't have to buy another receiver. But, at that price, I don't really mind.  The \"jumpers\" are awkward for adult-sized hands, but I figure they keep the cost down.", "Date": "November 11, 2009"}, {"Title": "Entry chime--NOT A DOORBELL!", "Author": "Deborah Lorraine \"ItzaRoos\"", "ReviewID": "R1YQ6ZUPEDV8JO", "Overall": "3.0", "Content": "I should have paid heed to another warning that this product is NOT a doorbell, and now I am stuck with a entry alert that is worthless to me. I read the comment but for some reason I believed another commenter who claimed it WAS a doorbell; he must have made the same mistake I did: After looking at about a dozen products and having several in my cart at one point, it was hard to keep track of what was a doorbell vs. an entry chime. It is probably a great product if you actually are shopping for a entry-alert sensor (good for those backdoors where you have a pool).  I liked the wireless feature and the fact that you can move the chime around by just plugging into another wall outlet.  I thought about using it anyway, but my husband doesn't want to screw the sensor and transmitter into the door and doorjam.  We will probably donate it to goodwill.", "Date": "September 2, 2009"}, {"Title": "Door Chime", "Author": "C. Howard", "ReviewID": "R2QZKAV6DO8DPN", "Overall": "5.0", "Content": "Great product! Bought it for our candy store, and works great. Loud, Audible, reliable, easy to install. Great when using for a store/ business where you need to detect incoming customers from when you're not on the sales floor. Highly recommend this product to any small business owners.", "Date": "January 17, 2009"}, {"Title": "Good Product", "Author": "K. Tall", "ReviewID": "R350FRBHQ7M87X", "Overall": "4.0", "Content": "Easy to install and works well. Volume control could have a bit more range.  It's still quite loud even on the lowest setting.  Solved that by taping some bubble wrap over the speaker.  Otherwise a great system.", "Date": "May 19, 2008"}, {"Title": "Alarm", "Author": "R. Noyes", "ReviewID": "RT9WRVWXMNBIY", "Overall": "4.0", "Content": "Works OK - but if there is a heavy wall in the way - it does not work - Mine had a stairway in the way and it would not work - but as soon as I moved it to a hallway it worked fine", "Date": "March 11, 2008"}, {"Title": "Door opening signal does the job", "Author": "Paula", "ReviewID": "R274CSTQ7TVW6N", "Overall": "5.0", "Content": "Easy to install (about 1/2 way down btw - it otherwise doesn't chime). Loud enough to hear throughout our 5000 sq ft shop - but not unpleasant.  Makes it far easier to have one person in the shop and still working - not having to check all the time that a noise is or isn't a customer.I think it also lets customers know that the shop is attended even if we're not up in the front.", "Date": "February 10, 2008"}, {"Title": "Awesome product", "Author": "M. Trietsch", "ReviewID": "R1RJZYUZIEVRIP", "Overall": "5.0", "Content": "I work in a secluded suite in my office due to the confidential nature of what I do and have been scared out of my wits, or caught in a confidential conversation, when someone walked in who I didn't hear.  This chime is awesome and works great.  Even at the lowest volumn setting it was a bit loud so I just put a piece of clear packing tape over the speaker, except the upper most section, which muted it perfectly - so the chime wouldn't scare me too.  LOL  I'm really not a scardy cat, just jumpy at times!", "Date": "September 13, 2011"}, {"Title": "Faulty product.  Very, very bad customer service", "Author": "Phillip S. Chun", "ReviewID": "R2RCMX7O6KM2QP", "Overall": "2.0", "Content": "Let me clarify my title by saying that chime and sensors work fine.  If you're going to use this product, you MUST USE THE SCREWS, NOT THE DOUBLE SIDED TAPE.In the morning, I installed the sensor using the included double sided tape to the door and door frame of my business.  I plugged in the chime, and successfully tested the unit, up to 30 feet away from the sensor.  All would have been fine, except that the double sided tape failed.The poor rating comes from the poor customer service that soon followed afterwards.  In less than four hours, I noticed that the double sided tape failed, and one half of the sensor was on the floor.  The other half was gone forever, probably kicked out the door by a customer.  The adhesive on the double sided tape itself was plenty sticky, as evidenced by the residue left on the door frame.  The tape itself separated, causing the sensor to drop.I called customer service to report the problem.  They took my information and tole me a replacement sensor was on it's way.  Four weeks later and two follow-up phone calls, I still don't have a replacement sensor.", "Date": "March 21, 2012"}, {"Title": "Wasted Money", "Author": "Trevor Maximin \"hustlin84\"", "ReviewID": "RKP58ZMUWJDJL", "Overall": "1.0", "Content": "The chime I ordered did not work at all.  I opened the package, followed the simple instructions and nothing! This was a huge waste of my money.  This is an item I would NOT recommend.  I certainly will not be purchasing any more products from this seller.", "Date": "September 16, 2011"}, {"Title": "works great for a day .", "Author": "ParcelRoom", "ReviewID": "R2CI5GLY8DDTXE", "Overall": "1.0", "Content": "Works fine, short distance from door to chime. Max we could go line of sight was @ 60ft. Problem for us is battery life, the battery in the remote lasts less than a day (commercial application) too many customers I guess. Other than that, we liked it.", "Date": "May 5, 2011"}, {"Title": "False claims...hate being lied too.", "Author": "Wilson", "ReviewID": "RFCEU314NGULE", "Overall": "1.0", "Content": "I am very dissatisfied.The range isn't close to what it state it to be, the unit has to be plugged in much closer to the door to work. The battery on the remote unit died in less than a week, and you have to special order the battery as the size is not one you can pick up at a local pharmacy or walmart.", "Date": "September 12, 2010"}, {"Title": "Did not last, un-reliable.", "Author": "Lampauto", "ReviewID": "R2GJZZXGI4JN04", "Overall": "1.0", "Content": "We use this dewvice on the front door of our business to alert us if we are out in the shop of a customer entering the building. The base plugged into the wall is only about 30-35ft from sensor on front door which is well within the advertised range, but the base only makes noise when it wants to. We changed the batteries in the door sensor to find the same problem. This product is 5 months old and will now have to go in the trash because the seller does not take returns after 60 days. I would not recommend this product to any one, this product is a piece of junk.", "Date": "June 5, 2014"}, {"Title": "Doesn't work", "Author": "Amazon Customer \"kchamberl9\"", "ReviewID": "R6TQRA1YI4DKV", "Overall": "1.0", "Content": "We bought this product for our small office to let us know when/if a client comes in the front door and we are away from the front. The contacts have double-sided sticky tape or screws to mount them with. Screws were not an option for us, so we used the tape. The tape separated within 24 hours (as in the sticky stuff stuck to the door and the foam stuff, still on the contact, was on the floor). So I tried super glue and electrical tape which finally worked. The doorbell rang intermittently with no apparent cause. I read on some other reviews to remove the red wire and let it hang out to make it not do that. I tried that and it made it extremely loud with no volume control, and then it just started ringing pretty much every 30 seconds. Now I have a messy, non-returnable product that doesn't work!", "Date": "May 22, 2014"}, {"Title": "WASTE OF MONEY", "Author": "Paul Saunders", "ReviewID": "R2TUFTJ0DGVQPX", "Overall": "1.0", "Content": "This product does not work.  Don't waste your money. I bought this for my business and it simply does not work.", "Date": "May 22, 2014"}, {"Title": "not happy at all", "Author": "tony celentano", "ReviewID": "R19QM64VRK9J2W", "Overall": "1.0", "Content": "its allready broken. very disaapointed  worked for a couple weeks.. now i need to buy another. would not reccomend it", "Date": "May 8, 2014"}, {"Title": "Just what we needed and great customer service", "Author": "strategichr", "ReviewID": "R2OQLEPDFQCNAN", "Overall": "4.0", "Content": "This was exactly what we needed for our office so we know if someone walks in the door. We don't get many visitors so we don't have a reception area. This lets us know someone is here.  We had a little problem with it working after a few weeks and the seller was quick to respond and took good care of us!  Can't be happier!!!", "Date": "May 5, 2014"}, {"Title": "easy to install", "Author": "dawn dennis", "ReviewID": "R28YN8ZI7XIV01", "Overall": "5.0", "Content": "easy works good, very loud long bell though so be prepared you cant change it so it does the bell chime not just a small beep but I need that because I live in the house and need the long sound", "Date": "May 3, 2014"}, {"Title": "Total junk", "Author": "Frequent Traveler \"Rich\"", "ReviewID": "R120HW2HZFHIKS", "Overall": "1.0", "Content": "Total junk. Works sporadically then quits. I've had three separate units, one of them has made it successfully into the second week. Hard to believe a company could continue to produce such an item and put their name in it.", "Date": "April 22, 2014"}, {"Title": "Just hooked it up", "Author": "gonoles194", "ReviewID": "R2AJ6LM6L4BOHS", "Overall": "5.0", "Content": "And it seems to be working as advertised.  Very very easy installation.  Came with 2 sided tape so I didnt even have to use the screws provided.  Chime is loud and has 3 different settings.  I think its going to work well.", "Date": "April 11, 2014"}, {"Title": "Love it!", "Author": "Ykrs", "ReviewID": "R1D7HUR9AR4LW8", "Overall": "4.0", "Content": "This works great for our business.  It is loud enough to hear in the back but not an overwhelming noise.", "Date": "April 11, 2014"}, {"Title": "perfect", "Author": "Dennis Richardson", "ReviewID": "R1JLN0R3OLHG6C", "Overall": "5.0", "Content": "perfect for what I needed as an alert that someone had opened the front door. . . not a doorbell", "Date": "March 31, 2014"}, {"Title": "Worked the first day", "Author": "Kerrith H. King \"Kerry\"", "ReviewID": "R265JLT72GQS4P", "Overall": "2.0", "Content": "I bought this to compliment my Heath door bell. At first it was working when the door was opened but it failed after two days. Too much of a hassle to return/exchange it.", "Date": "March 17, 2014"}, {"Title": "GREAT PRODUCT", "Author": "hardrocker871", "ReviewID": "R15A4B7IE60LS6", "Overall": "5.0", "Content": "THIS WORKS FLAWLESSLY, NOT ONE PROBLEM, EASY TO FOLLOW INSTRUCTIONS AND FAST SETUP. I WAS VERY VERY VERY VERY PLEASED.", "Date": "March 14, 2014"}, {"Title": "Alert Chime", "Author": "N Henry", "ReviewID": "R3TW5UPWD0SXCV", "Overall": "3.0", "Content": "Product was perfect for our office entry door. Liked the different chime options. Only \"negative\" point was not being able to turn the chime volume down enough, without completely turning it off. Had to move the chime box to the copy room, behind reception, and wrap it in bubble wrap!", "Date": "March 14, 2014"}, {"Title": "Works great!", "Author": "Sarah Schindele", "ReviewID": "R1ORX0J15L3QKB", "Overall": "5.0", "Content": "Very easy to install and works very well.  We have 2 glass doors that swing open in an office setting and work in the back.  This does what we got it for - we now know when customers come through the door.", "Date": "March 5, 2014"}, {"Title": "Works good", "Author": "Allen Pullen", "ReviewID": "R2GYBAIRURLTOI", "Overall": "4.0", "Content": "The chime works well.  The range is not as far as it boasts, but works real well at about 20 feet.", "Date": "February 28, 2014"}, {"Title": "Door alarm", "Author": "Bernard Wolf", "ReviewID": "R11TZY8E773IFD", "Overall": "5.0", "Content": "This did the trick to awake our night-duty person to attend to a child without waking everyone else.We're greatly pleased.", "Date": "February 25, 2014"}, {"Title": "Didn't work in our building", "Author": "Mike Aiken", "ReviewID": "R1GRKZA04XQA7P", "Overall": "1.0", "Content": "Didn't work in our building, not sure why. We have wood studs and not any metal anywhere in the building.", "Date": "February 24, 2014"}, {"Title": "Just what I needed", "Author": "Daniel Walker", "ReviewID": "R16I4YGM2PW8KY", "Overall": "5.0", "Content": "I run a body shop and sometimes it gets slow in the office so I try to get out and get some work done only to have people come in without me hearing or seeing them.  With the adjustable volume it works great when running loud equipment.  I do wish it was easier to change the tune like with a switch but for the price it's still really good.", "Date": "February 21, 2014"}, {"Title": "bad", "Author": "Satnam Saini", "ReviewID": "R3DWBFSZMNI3S8", "Overall": "1.0", "Content": "don't buy this item it is really bad.it does not work 75% of time ,i have 2 of them and they are both the same bad bad bad  don't  buy.", "Date": "February 18, 2014"}, {"Title": "Dissatisfied consumer", "Author": "Robert Zava", "ReviewID": "R1W6SFIJXEAO9J", "Overall": "1.0", "Content": "The entry alerter did not operate any further than 10 ft from the sending unit.Called to question not working and was told that that Heathkit was not responsible for units that do not operate as advertised.", "Date": "February 18, 2014"}, {"Title": "Great Product it delivers", "Author": "William Mayer", "ReviewID": "R9EXH0521LLS0", "Overall": "5.0", "Content": "I've tried with other products such as the famous drive way alarm.  This is much better.  No false alarms.  Easy to sutup.", "Date": "February 11, 2014"}, {"Title": "great item", "Author": "Hector Enrique Marin", "ReviewID": "R134NIR7SORJIB", "Overall": "5.0", "Content": "works great, highly recommend it, seems to be pretty long lasting and accurate, canhear it easily and effectively, good purchase", "Date": "February 4, 2014"}, {"Title": "wish the instructions were more clear", "Author": "KARIN LEE WEST", "ReviewID": "R268BIBAOBGBRF", "Overall": "3.0", "Content": "We have had this for a year, still can't work the damn thing. It's functional, but cannot be adjusted for sound.", "Date": "February 3, 2014"}, {"Title": "Sometimes it doesn't work", "Author": "Fu Sun", "ReviewID": "RRC0ATTML9U00", "Overall": "3.0", "Content": "I purchased this item for my business, I installed as the manual stated, I put the wireless chime I the back kitchen, it doesn't work, I plug in a different outlet, it worked, but most of the times it doesn't sound. So, I plug it in the front near the door where I installed the sensor. Again, for the most part, it works, but again sometimes it does not sound. The sensor light every time opens the door, but just the chime doesn't sound sometimes.", "Date": "January 29, 2014"}, {"Title": "DO not waste your time and money", "Author": "jose de leon", "ReviewID": "R1WOIDV6YN856L", "Overall": "2.0", "Content": "Bought one and it started working intermittently after about a week, replaced it and the replacement did the same things.", "Date": "January 28, 2014"}, {"Title": "Did not work", "Author": "Pete Noetzel", "ReviewID": "R7443GIT13ZGB", "Overall": "2.0", "Content": "I probably should not give this unit 2 stars, but I was impressed with the volume of the chime - very loud if you wanted it to be.  Unfortunately, that was moot because I could not get this to work if I was not actually touching the transmitter or the magnet!  No matter what I did, I could not get the receiver to chime if I was not physically touching either the magnet or the transmitter.  I tried moving the receiver unit to numerous different locations, near and far with no blocking walls to no avail.  If I was holding either the magnet or transmitter - no problem.  If both the magnet and transmitter were attached to the entry door - no luck.  The entry door and frame were aluminum, so not sure if that made a difference.  I returned it and am looking for another unit.", "Date": "January 25, 2014"}, {"Title": "Waste", "Author": "Neil", "ReviewID": "R1XGKP1VIV5U02", "Overall": "1.0", "Content": "Thought this would do the trick for letting my employees people we're coming in the store. It didn't always make noise and sometimes it would alert us a full 2 minutes after the person entered. My manager took it down in one store and the other manager took the batteries out if in the other.", "Date": "January 24, 2014"}, {"Title": "It doesnt work", "Author": "Kenneth Petsch", "ReviewID": "R1EH50IHPNN82N", "Overall": "1.0", "Content": "I'm sure it would be fine but it doesn't work we called the supplier and after talking with them it still is not working hope we can send it back and get it replaced soon.", "Date": "January 20, 2014"}, {"Title": "It works", "Author": "S. Lee", "ReviewID": "R17B2656R1CMVI", "Overall": "5.0", "Content": "My old one died after i guess more than 5 yearsand I got the exact same thing and it works great!!", "Date": "January 13, 2014"}, {"Title": "Wireless Door Chime Alert", "Author": "Chris Scher", "ReviewID": "RU3PH46B038CX", "Overall": "4.0", "Content": "At the price I was not sure if this unit would work very well. Have never tried a wireless chime alert so I was not sure what to expect. Purchased the unit for some commercial rental property where the renters asked for a door chime to alert them when someone entered the lobby area. The base unit is located in the hallway behind a secondary door about 35 feet from the door sensors. It has settings for 2-3 different tones and they are quite loud (volume is adjustable). The unit has only been installed for a month now but have been quite pleased with it for my expectations and would recommend the unit. Did not give 5 stars because I have not been able to test the longevity of the unit but no real complaints so far.The only negative I can see so far is that the door sensor unit is a tad big so some folks might not like it on their front door. I think it was maybe 2\"x 3\" because it takes a camera type cylindrical battery while the far end unit plugs into an AC receptacle.", "Date": "January 12, 2014"}, {"Title": "Got Confused", "Author": "Jodie Burgess", "ReviewID": "R31E92OHSHZBTY", "Overall": "1.0", "Content": "This alert had too wide a field to be useful in a mall retail setting. It was over sensitive and picked up shadows walking by in the street and we don't face the street. It lasted about an hour before we took it down. May work for home purposes.", "Date": "January 3, 2014"}, {"Title": "Works well, great chime", "Author": "ItsMe", "ReviewID": "R1NMLK13GPJTOH", "Overall": "5.0", "Content": "The product works as advertised.  The chime is clear, loud (not too loud), and melodious.  We installed it in a 2-bedroom apartment, about 900 sq. ft. about 6 months ago and it has worked reliably every time.  I would buy this product again, and recommend it.", "Date": "December 28, 2013"}, {"Title": "GOOD ENTRY ALERT", "Author": "Richard A. Willems \"maintenance man\"", "ReviewID": "R3QZUDZ9PDO2S3", "Overall": "5.0", "Content": "This was easy to install and works well. The sound is loud and clear. I would recommend this to any who needs an entry alert.", "Date": "December 23, 2013"}, {"Title": "Very good product", "Author": "Treb", "ReviewID": "R3MMCO4HA5QTWI", "Overall": "5.0", "Content": "I ordered it for my restaurant to alert as of incoming customers, but I only want the staff inside the kitchen to hear it and it really is an amazing product except that I forgot that my line is 220 V and the product is only 110 V.", "Date": "December 22, 2013"}, {"Title": "Only works Intermittently, less than 10' from receiver.", "Author": "Ben Contreras", "ReviewID": "R27PJVQQVIX6G", "Overall": "1.0", "Content": "Exactly what we need if it worked. Only works intermittently which is very frustrating so will have to replace it. waste of $20 oh well", "Date": "December 12, 2013"}, {"Title": "Easiest Chime in the World!", "Author": "R. Allison", "ReviewID": "R2UQU5FV52RROI", "Overall": "5.0", "Content": "Absolutely easy to install and comes with a nice variety of chime \"music\".  I had it installed on our store door within minutes and didn't even use a single tool. if the time comes that I need another door chime, this will be the one I get.", "Date": "December 11, 2013"}, {"Title": "Try this if not working.", "Author": "D. O. Smith", "ReviewID": "R3NALEYZ0OBN6E", "Overall": "4.0", "Content": "If the chime stops working try plugging it in very close to the door to \"reeducate\" the receiver.  Then move it further away and it will probably work.  I still like it.", "Date": "December 3, 2013"}, {"Title": "not worth it", "Author": "Tanya Dennis", "ReviewID": "R35VV64DW32GAP", "Overall": "1.0", "Content": "Lasted about 2 weeks before it quit working. I tried replacing batteries and still nothing.  I wouldn't waste my money!", "Date": "December 1, 2013"}, {"Title": "Great product for elderly.", "Author": "dbleagles", "ReviewID": "RCDJ7IWSSPQ99", "Overall": "5.0", "Content": "Arrived and installed primary and remote unit (for second door in about 45 min--most of that was careful reading of the instructions).  It may not be clear to all that the senors and transmitters have to be set individually for unique tones.  Once set though, they work fine.  Used for elderly grandfather with chime in bedroom so he can detect if any entrance doors open at night.  Unit is well made with battery for sensors  (chime uses 110v)..  No complaints (do drill a pilot hole for any wood screws--screw heads easily strip otherwise.  I also split the double surface tape (down length) to better spread load when attached to metal door (no drilling).  Instructions do mention that a wireless doorbell will activate chime so maybe others might try that solution if they are unhappy with the door alarm feature.", "Date": "November 30, 2013"}, {"Title": "Just what I needed.", "Author": "DIY Yard \"DIY Yard\"", "ReviewID": "R19L4XJGJIU3B2", "Overall": "5.0", "Content": "I own a restaurant and I bought this to chime when a customer opens the door.  Works great to notify servers and cooks when a customer arrives.", "Date": "November 29, 2013"}, {"Title": "No problems so far works great good range.", "Author": "2manytoyz \"2manytoyz\"", "ReviewID": "R3V8HGIDEBNRI4", "Overall": "5.0", "Content": "No problems so far works great good range.  We use this for our front door when the receptionist is away to alert the rest of the staff someone has come in.", "Date": "November 24, 2013"}, {"Title": "Chime", "Author": "George", "ReviewID": "R3BGF8CNGELV70", "Overall": "4.0", "Content": "Easy to install.  Has a choice of tones, with a slight modification.  Has adjustable volume, on the rear of the plug in unit.", "Date": "October 29, 2013"}, {"Title": "Garbage", "Author": "Benzal", "ReviewID": "R1CL0470HL4MBD", "Overall": "1.0", "Content": "The range of this unit is maybe 15 feet, and even at that it's completely unreliable. Look elsewhere, this is worthless.", "Date": "October 22, 2013"}, {"Title": "Not usable for me", "Author": "James G.", "ReviewID": "R2OU0A9XPD8IK3", "Overall": "1.0", "Content": "As mentioned in other reviews, operation is intermittent and the range is very low.  I thought at first the included battery might old or weak so I bought another.  No help.  The light on the sensor illuminates as the door is opened indicating it is working but the receiver must be less than 10 feet from the sensor to sound off and then not every time.  As usual you get what you pay for.", "Date": "October 17, 2013"}, {"Title": "Great product!!", "Author": "Big Jim", "ReviewID": "R14XT7QJ2R9WRA", "Overall": "5.0", "Content": "Works great.  As advertised.  Put it to immediate use.  Placed the sensor on the entry door and the chime upstairs.  No problems.  Installed the sensors with the included two sided tape.  So easy and quick.  Thanks!", "Date": "October 12, 2013"}, {"Title": "Wonderful piece of mind !!!", "Author": "L. Russell", "ReviewID": "R1S6GRPKHKI99X", "Overall": "5.0", "Content": "This is the second one of these we have purchased. We have a non-verbal special needs daughter and need to know when she gets up so we can help her go to the bathroom during the night or first thing in the morning.  We have the plug in part in our bedroom and it works great !!!  We have one at our home and just bought another for our vacation cabin in North Carolina. We will never have to worry about her getting up and hurting herself or missing the potty again.", "Date": "October 10, 2013"}, {"Title": "Almost worthless", "Author": "North Carolina Consumers Council", "ReviewID": "RPV3T9D88U8O7", "Overall": "1.0", "Content": "This product worked for about two weeks before it almost stopped completely.  Would ring maybe once in ten tries.  Then it would go off when it wasn't supposed to.  When it DID work, there was such a delay from the time the door opened until the box would ring.  The signal only had to go ten feet and there isn't any interference.", "Date": "October 3, 2013"}, {"Title": "Couldn't be happier", "Author": "J. Herrick \"homebrewer and father of four\"", "ReviewID": "R2C3HQMXLYZK28", "Overall": "5.0", "Content": "We have been in this house for 3 years and 3 months. After about one month, we realized our son - who is on the autism spectrum - enjoyed going for middle-of-the-night walks. After we replaced the door locks with two-way key-entry locks, we looked for an affordable way to be aware every time the doors opened. With three main doors - and our requirement to be easy-to-implement and affordable, this was a challenge. This product is the perfect fit. With a family of six, there's plenty of activity, but we have replaced each of the sensor batteries once in three years.", "Date": "October 2, 2013"}, {"Title": "Poor range. Intermittent.", "Author": "E. Hicaro \"Stonemaster\"", "ReviewID": "R3RMNYBAVOR7ME", "Overall": "3.0", "Content": "I wanted to use this to alert my back office staff in the event someone came in our front entry and the receptionist was away from her desk. The back office is only 30 feet away with only one wall in between. The door sensor could not reach the chime. So, we had to move closer to the front which defeats the whole purpose of buying it. Also, even at the lowest volume setting, it's really loud, especially in our quiet office. We had to cover the speaker with tape so lower the sound. If you're going to use this in a noisy location like a retail store, it might be ok, so long as you keep the chime close to the door sensor and put no walls between the two.", "Date": "October 2, 2013"}, {"Title": "Iffy.", "Author": "Darin Mccoy", "ReviewID": "R26F9XZ2T5P7X4", "Overall": "3.0", "Content": "Sometimes it would work, and sometimes it wouldn't. I ended up chunking it, because I ain't gonna use the thing.", "Date": "September 26, 2013"}, {"Title": "Didn't even work.....", "Author": "Brandon Holland", "ReviewID": "R23S9RJZWFU3IO", "Overall": "1.0", "Content": "Product didn't even work.... Tried multiple time but never got it to work. what a waste of money. i hate it.", "Date": "September 23, 2013"}, {"Title": "junk", "Author": "Pen Name", "ReviewID": "R2HWFNYRZGDXCC", "Overall": "1.0", "Content": "Tried several timea to get this thibg programmed with no luck! I would not order this product again! Unless your great at readibg terribly written directions I wouldnt buy this product", "Date": "September 10, 2013"}, {"Title": "Defective and Very Bad Range", "Author": "David", "ReviewID": "R1RYB2DTT97TSK", "Overall": "1.0", "Content": "We have a warehouse and sometimes no one is in the office area when a customer walks in.  We bought this to avoid having customers wait for us to come by.  At first it was easy to setup.  we used double sided tape to put it onto the door.  When we tried to keep the receiver at an area where we could easily hear it while in the warehouse, it would not work.  We could keep it about 15ft from the door at the most for it to work.  The next day the unit stopped working all together.  The transmitter showed a red light turning on when the door was opened, but the receiver would not chime.  We tried keeping the receiver and transmitter near each other and still no luck.  Buy it at your own risk.  I am returning this and trying another one that will hopefully work the way I want.", "Date": "September 10, 2013"}, {"Title": "works great!!", "Author": "Chris' dad", "ReviewID": "R1NQ5KPJZOK43G", "Overall": "4.0", "Content": "It works very well at our retail location. PLenty loud enough from far away and the installation is easy and fast!!", "Date": "September 5, 2013"}, {"Title": "Works great!", "Author": "Paula Cole", "ReviewID": "R35C240QTVA9GM", "Overall": "5.0", "Content": "Needed to know when someone was entering at work as many times I am in another room. Love Love it!", "Date": "September 1, 2013"}, {"Title": "Doesn't work all the time.", "Author": "Adrian", "ReviewID": "R2R77825VKAT60", "Overall": "1.0", "Content": "We needed this for our shop, however even if the chime speaker is less than 50ft away from the door it is inconsistent. When it comes to notifying us when customers come in, we cannot rely on this. I would not recommend this to anyone.", "Date": "August 28, 2013"}, {"Title": "chimes", "Author": "Dee", "ReviewID": "RNLKT0BPPD498", "Overall": "5.0", "Content": "ordered for work and getting good use out of it.  let's us know when a customer walks in the door.  prices are so good and ships quickly.  thanks!!!!!", "Date": "August 26, 2013"}, {"Title": "Works Great", "Author": "Ricky Matlock", "ReviewID": "R1RG0MSJ9S9SEJ", "Overall": "4.0", "Content": "Although it's a little tricky to set the jumpers in the chime and the remote...it's worth the purchase, works great.", "Date": "August 25, 2013"}, {"Title": "whorthless", "Author": "jeremy carter", "ReviewID": "R3FDNZT3EPTOW", "Overall": "1.0", "Content": "this is the worst thing I have ever bought from amazon I wish I wouldv keep the box and stuff to return it. it does not work at 100 feet like it says in fact it don't even work at 75 feet deff a piece of s*** and not worth the money", "Date": "August 22, 2013"}, {"Title": "worked for a few weeks only", "Author": "dirk buchheit", "ReviewID": "RAN0HNJJHJ4IQ", "Overall": "1.0", "Content": "it broke after a few weeks and amazon can't take it back now what am i supposed to do. guess will have to buy another brand and hope it works longer than a few weeks", "Date": "August 21, 2013"}, {"Title": "Unreliable", "Author": "Carly", "ReviewID": "R31UZDHP6KG4VB", "Overall": "2.0", "Content": "I had to reposition the chime several times before finding a range that would actually chime and even then, it is unreliable.  It chooses when it wants to chime!  It had to be about 15 feet away from the door to work. So much for the 100 foot range as described in the product description!", "Date": "August 19, 2013"}, {"Title": "Inconsistent", "Author": "Michael Betz", "ReviewID": "R2E5WA4NY6STO5", "Overall": "1.0", "Content": "The door chime only works about 80% of the time. That's not good enough when you're using it to let you know people have entered your business. I saw warnings about the range of this unit and wish I had paid attention to them.", "Date": "August 19, 2013"}, {"Title": "Excellent value & quality", "Author": "Robert J Meyers", "ReviewID": "R1V9964ASJ3ORJ", "Overall": "5.0", "Content": "Very easy to install, several different chimes to choose from & very easy to program. Great volume and distance. Would not hesitate to order again.  Have used it over 1 year now and still working on the original battery that it came with.  Very impressed!", "Date": "August 17, 2013"}, {"Title": "they worked about 4 days, i have stopped payment on the credit card.", "Author": "Hundley Group", "ReviewID": "R1WJ0HH579JOU4", "Overall": "1.0", "Content": "absolutely a waste of money, sorry but I feel cheated. I have stopped payment on the charge for bad product.", "Date": "August 8, 2013"}, {"Title": "1 month", "Author": "Simone", "ReviewID": "R1W4RXWN9RJFOV", "Overall": "1.0", "Content": "Works for 1 month, changed battery... still nothing. Very cheap constructed. Very basic electronic. Need to find something else on Amazon", "Date": "July 10, 2013"}, {"Title": "Does the job well...install it and forget it", "Author": "James1seek \"James1seek\"", "ReviewID": "R23HVVO0NRD80F", "Overall": "4.0", "Content": "This is a very good product.  I had better results using duck tape for installation on the front door.  The chime itself is quite loud and can be adjusted for the number of notes played.  I bought an extention switch (  Prime Wire & Cable EC870615 15-Foot 16/2 SPT-2 Remote Switch Cord) in order to turn the chime off when not needed.  They work great together for the past three months. I do recommend you add the extra sensor battery, but have not needed it yet.", "Date": "July 9, 2013"}, {"Title": "Do not buy!", "Author": "M. Miller \"Metroman83\"", "ReviewID": "R295TFD8WFQLT8", "Overall": "1.0", "Content": "Do not buy this. It hardly worked when it worked. It wouldn't always go off so I'd have customers surprise me in the office. The range is also about 10 ft...maybe 15 if you want it to work less than 50% of the time.", "Date": "July 6, 2013"}, {"Title": "Google SUCKS, product image pops up.", "Author": "Bigblu2u", "ReviewID": "R301MLV31GI7M9", "Overall": "1.0", "Content": "I bought this for my business. It does not work. The 1st day, it chimed half the time. The 2nd day, not at all. I replaced the brand new battery, and it didn't work either. I contacted customer support, and they said \"THIS IS A MADE FOR RESIDENCES, SO THEY WILL NOT WARRANTY IT FOR MY BUSINESS!!!!\" DO NOT BUY THIS IF YOU WANT IT TO WORK.", "Date": "July 6, 2013"}, {"Title": "Range of only a few feet", "Author": "Richard C. Katz", "ReviewID": "R3EEJZPCS6TB0E", "Overall": "1.0", "Content": "This looked like what I needed: a sensor I could attach to an outside gate up against the house leading to the backyard. I set up the system with the AC receiver/chime plugged in to a exterior wall under a window about 20 feet from the sensor outside. It worked for a couple of days, then wouldn't \"chime\" even though the red LED on the sensor indicated it was working. I put a fresh battery in the sensor just in case, but it still didn't work. I removed the sensor (magnet and transmitter) and found it worked (triggering the chime to ring) only when it was within about six feet of the chime (still outside the house). Pretty useless as a wireless chime. I would return it if I could or at least exchange it for another to give it another try.", "Date": "June 26, 2013"}, {"Title": "Terrible", "Author": "Dennis Dass", "ReviewID": "REQXCC0D1L7SB", "Overall": "1.0", "Content": "Worst product ever.False chimes all the time, and it is extremely loud.Would not recommend this product to anyone.", "Date": "June 10, 2013"}, {"Title": "Radio trasmitter Distance pretty short", "Author": "K. Nguyen", "ReviewID": "R3SW8V4S4SHEGR", "Overall": "3.0", "Content": "A little disappointed about the distance from the door chime to the receiver -but it works good if you don't mind it being close", "Date": "June 8, 2013"}, {"Title": "it really works", "Author": "George Allan", "ReviewID": "R3JFGBCKE33KO8", "Overall": "5.0", "Content": "This is a rather simple system that sounds a chime whenever the door is opened. It alerts me if someone is leaving the house -- and as a caregiver to a spouse whose dementia means leaving unannounced could have negative results. I didn't want to spend a lot of money on a fancy system, but of course I wanted something of good enough quality that I could trust it to work all the time. And the Heath system does just that!", "Date": "June 2, 2013"}, {"Title": "Great for leaving the back door open at night", "Author": "J. Summer \"Mahalo from the Polynesian Islands...", "ReviewID": "R37J9A7FJCI0LL", "Overall": "5.0", "Content": "I easily installed this item.  The plastic packing is minimal and conservative.  Once opened, there are the main components and a set of screws and a spacer piece.  I didn't need either.  I just plugged in the receiver and double-sided taped the two magnetic pieces to my screen door top.  I tested it twice and it's great!!  As soon as the door is open, the alarm (an 8 chime Westminster note) sounds.  The volume is controllable with a simple screwdriver on the back of the plug unit.Not to worry, the plug can reach far away.  Rooms away without any wires.  That's right: NO WIRES.  Can't beat this.  I tried to find this at a local hardware store and they never heard of such an item.  Strange.  Anyway, this is a great item that I can now sleep peacefully with the back door open to cool the home at night and know if something happens, I'll know about it with a nice \"chime\".  Cheers!!", "Date": "May 24, 2013"}, {"Title": "I have been looking to replace my old system", "Author": "Vicki", "ReviewID": "R3QJNX2OQT3HZB", "Overall": "5.0", "Content": "The last time I bought one on Amazon it was too big and bulky to put on this metal door jam and metal door frame.  This one was nice and small and I taped the bigger side up and superglued the small side to the door.  The chime plugs in so I don't have to buy batteries like the old one.  There are 3 ringtones.  I only wanted din so I had to add a jumper which it did not come with.  I finally have a chime again so people can't come in unbeknownst to me any more.  Also the chime has a volume adjustment.  I am happy.", "Date": "May 14, 2013"}, {"Title": "it's good", "Author": "david", "ReviewID": "R3VXLBU4VMKF41", "Overall": "4.0", "Content": "i like the entry alert, its a good product. It works every time the door opensHave a good range. And you can plug it in where u want.I been using the same company product for the last 6-7 years and never had a problem.I would recommend this product.", "Date": "May 11, 2013"}, {"Title": "The range is not 100 ft", "Author": "I like Amazon", "ReviewID": "R2CDPZPBORP60R", "Overall": "2.0", "Content": "I bought it for my house side gate and I put the Chime in the laundry room about 20 ft away. It doesn't work. So, I moved it to the garage about 15 ft from the sensor and it worked. I am disappointed since I cannot really hear the chime inside the house.", "Date": "May 2, 2013"}, {"Title": "This is used on our entry door for a restaurant, but it sucks with double doors.", "Author": "Licotto", "ReviewID": "R31EHP8MWPEK9B", "Overall": "3.0", "Content": "I had intended to use this on a set of double doors at our restaurant, but only one side makes the chime go off. I tried to offset the placement of the smaller magnet so that the sensor would trip if the sensor-side door would open, but it won't :(So, as it is, only one side of the door will make the chime go off -which is still better than it never going off, but it's not useful to be in back & not hear when people come in on the 'wrong side'", "Date": "May 1, 2013"}, {"Title": "Just Okay", "Author": "E-Truggy", "ReviewID": "R188FI4UJA92Z2", "Overall": "3.0", "Content": "Bought for a retail store so we would know when someone walks in and no one is out front. The chime sounds are ok, all were a tad annoying so we went with the single chime. The problem is range, it's WAY less than the product claims. It can penetrate maybe 1 wall. We ended up hiding the main unit in the same room as the door, it works but we wanted to locate it one or two rooms away from the front. We couldn't put it there because it didn't work reliably even one room away. The range of 100' is likely in open space with no obstructions. Through walls it's maybe 15 feet at most.", "Date": "April 14, 2013"}, {"Title": "Great product", "Author": "Val Southgate", "ReviewID": "R2SDP3DQ87NPBS", "Overall": "4.0", "Content": "I bought this item to warn me about my two year old exiting the house without my knowledge. He grew so tall he can reach the doorknob!  It works like  charm and the only reason I didn't give it 5 stars is that I had to use double sticky foam tape to adhere to it the outside of my door because the application did not work for the interior of my door.  No fault of the company, just my situation.", "Date": "April 3, 2013"}, {"Title": "bad quality", "Author": "jbz", "ReviewID": "R2OLNG89OIIWYF", "Overall": "1.0", "Content": "used in a restaurant. it didn't work every time.it only work about 3/4 of the time.eat alot of battery.this bell are just built cheaply.bad..", "Date": "March 26, 2013"}, {"Title": "It's alright", "Author": "S. Krueger", "ReviewID": "R12R678MI2YPTI", "Overall": "3.0", "Content": "Bought this for my son's room.  He's two and can open doors so I wanted something that will alert us in our bedroom if he leaves his room.  The chime works alright, but the mounting stuff it comes with is terrible.  It's currently sitting in a pile waiting for me to go to the store and buy stuff to get it fixed.", "Date": "March 15, 2013"}, {"Title": "Just Okay", "Author": "Sam", "ReviewID": "R70RLQINNQKQJ", "Overall": "2.0", "Content": "We needed to be alerted when a customer entered our office. Can't always see the door. It was what I was looking for and it worked just fine for about 3 months. Then it just stopped. Changed the battery in the sensor but it still does not work. Door sensor appears to be okay. I would not recommend it.", "Date": "March 14, 2013"}, {"Title": "Battery Hog !!!!", "Author": "Tommy", "ReviewID": "R2FYAWV6AOWKOY", "Overall": "1.0", "Content": "Works good for 1/2 a day then have to replace the batteries, it gets really warm to touch. I've already spent more on batteries than the d%*&m; thing cost. Replaced it with a different manufacture. Now I'm happy ☺", "Date": "March 8, 2013"}, {"Title": "Works rather well", "Author": "Patrice Taurisano", "ReviewID": "R30V42Q9J9TRRI", "Overall": "3.0", "Content": "I really like this. Was having issues with my other door chime. This is for a commercial business and the old 1 went off when it felt like or never stopped ringing.I did have to add a different magnet to this. The one that trips the switch maybe snit powerful enough. One I did I have no issues what so ever. Glad I work in a shop that makes namebadges, because mine are really powerful.", "Date": "March 7, 2013"}, {"Title": "Poor performance at 40 feet", "Author": "David", "ReviewID": "RSN5KKPJN0TPV", "Overall": "1.0", "Content": "We cant use this unit. Placing almost anything between the receiver and transmitter stops the unit from working. We wanted it to ring is an office that can't see the door that is maybe 30-40' away. If the units are close, I suppose it would be ok.", "Date": "February 27, 2013"}, {"Title": "Not worth it", "Author": "New Small Business Owner", "ReviewID": "R354LR44UWWQXB", "Overall": "2.0", "Content": "We have a small retail store and wanted something to alert us when customers entered out store front.  This chime worked well for maybe a week.  We tried replacing batteries and code pins, but no luck.", "Date": "February 23, 2013"}, {"Title": "Sporadic chimes", "Author": "Christen O.", "ReviewID": "R1YMHW7RUIIPUG", "Overall": "2.0", "Content": "We purchased this door chime for our office front door to alert us when someone walks in. We installed it according to the directions. It worked great for the first two weeks. now it's chiming is sporadic and sometimes doesn't go off. The red light still activates when the door opens, but the chime doesn't always go off. I'm not very impressed, but then again, the chime was inexpensive. Needless to say, we are going to take it down and purchase a better one...", "Date": "February 20, 2013"}, {"Title": "Works well", "Author": "Lawrence \"lgaretto\"", "ReviewID": "R3E339YZIZ85ZY", "Overall": "4.0", "Content": "DThe device itself works as advertised. The double sided tape that came with it was junk, but once the sensor had fallen off the door the first time and I replaced it with good tape, it's worked well. I did have to play with the jumpers so as to only have it going off when it should (crosstalk with another device in the area).", "Date": "February 15, 2013"}, {"Title": "Impressive Alarm", "Author": "Walter R. Swift", "ReviewID": "RX2GO6ULPINRG", "Overall": "5.0", "Content": "I Use it as a door bell so I can hear people coming into my shop. I Would recommend it", "Date": "February 5, 2013"}, {"Title": "Buy something else, dont waste your time", "Author": "nic", "ReviewID": "R1SXTR5EA21TOZ", "Overall": "2.0", "Content": "This thing only works at about 20 feet(line of sight)  and doesnt work all the time. I would not suggest this product to anyone", "Date": "January 16, 2013"}, {"Title": "Works as described. Needs better mounting tape", "Author": "Ryan C. Johnson", "ReviewID": "R3KKWHX2C0LKVP", "Overall": "4.0", "Content": "I needed a chime for my office to let us know when someone entered when we were in the warehouse. This little unit fit the bill perfectly. The door part consists of a small transmitter and a separate magnetic reed switch. Mounting the two was easy and quick. However because of the finish on my door, the double-sided tape wasn't strong enough to hold the reed switch so it has fallen off. I will have to devise a better mounting solution. The receiver unit plugs into a standard AC plug and is ready to go. Provides a nice doorbell sound every time the door is opened. Since this is a wireless unit, the setup is fast and the flexibility of this system is great! Just needs better mounting options.", "Date": "January 12, 2013"}, {"Title": "Works great!", "Author": "Kelley", "ReviewID": "R20Z3NCN91N62P", "Overall": "5.0", "Content": "We purchased one of these for our office about five years ago and it works great. The chime is not high pitched which is really nice. We just purchased another one from Amazon.", "Date": "January 8, 2013"}, {"Title": "Works great! No one can come into the shop without me hearing them!", "Author": "Joe Lowell", "ReviewID": "R1J9X3IE0U8P4D", "Overall": "4.0", "Content": "I found the product easy to install. Hope it lasts a few years like the first one I bought did.", "Date": "January 3, 2013"}, {"Title": "Has quirks after a while", "Author": "TCK", "ReviewID": "R29U2PZX0UL2P8", "Overall": "3.0", "Content": "After a while, it starts chiming out of the blue.  Checked both the door unit and the one in the wall, and both are operational.  Still works when someone opens the door, but the \"ghost\" chimes can get annoying,  but overall, worth the price and very handy when we can't see someone walk in the front door of the office.", "Date": "December 30, 2012"}, {"Title": "Perfect for my escape artist", "Author": "Monicaponica", "ReviewID": "R320SQATNVWRQZ", "Overall": "5.0", "Content": "Easy to install and reliable.  we use it on our sons door that we will know if he tries to roam the house in the night. Works fabulous", "Date": "December 23, 2012"}, {"Title": "Range not great.", "Author": "Patrick Anderson \"Patman\"", "ReviewID": "R3AAT97SEB8JOZ", "Overall": "2.0", "Content": "Bought this to replace a cheaper version that had lasted 3 years, but died unexpectedly.  Says the range is 100ft, but we're having problems at about 55 ft that we did not have with the cheaper version.  If I hadn't destroyed the packaging I would consider returning this.  For now, it will do.Edit: Bought basically the same thing at Lowes under the \"Utilitech\" brand.  Works great.", "Date": "December 11, 2012"}, {"Title": "Good for SMALL business.", "Author": "Rick Hillard", "ReviewID": "R1FI7KF2BW54WL", "Overall": "3.0", "Content": "I purchased 2 of these for our seperate stores. I imstalled the first on and noticed that distance might be an issue. I relocated the receiver and it worked for this location.The second location is slightly larger. It would not work at the required distance for me.If you have a metal door and more than 50ft of distance from the transmitter and the receiver this will not work for you.", "Date": "December 1, 2012"}, {"Title": "Works great!", "Author": "Sarah Young", "ReviewID": "R1U1EPK39394G8", "Overall": "5.0", "Content": "This item was purchased to alert us when someone enters our office. The building is 2,000 square feet and were having difficulties with unannounced visitors. Now everyone knows when some enters or exits. It's loud enough to be heard throughout the building without being obnoxious.", "Date": "November 27, 2012"}, {"Title": "Excellent product", "Author": "ALI ABDALLAH", "ReviewID": "R2XG25JMD0XYC4", "Overall": "5.0", "Content": "I have been looking for items like this for a while , I tried several product none of them work", "Date": "November 23, 2012"}, {"Title": "better than a doorbell", "Author": "lorelei rush", "ReviewID": "R3RFLKGJCU8G52", "Overall": "5.0", "Content": "excellent product. our office s in our home. if no one is in the office downstairs i know when someone comes in.", "Date": "November 18, 2012"}, {"Title": "Wireless Motion Sensor", "Author": "Susan", "ReviewID": "R1IQCP85ROQO9A", "Overall": "2.0", "Content": "The company was great - shipped very quickly, good pricing, good follow up. However, the chime uses a LOT of batteries and goes through them within 10-15 chimes. Great company, sub-par product.", "Date": "November 6, 2012"}, {"Title": "DINGDONG", "Author": "WIHO", "ReviewID": "R2N1UDGBEM24Y3", "Overall": "5.0", "Content": "We needed something to notify us when patients came through the door and we where busy in the back office. We love it. We can place the sound anywhere there is an outlet. Easy to install and very efficient.", "Date": "October 16, 2012"}, {"Title": "Buyer beware!", "Author": "Brett", "ReviewID": "R29APVTYYJOJZK", "Overall": "1.0", "Content": "This is the worst entry chime! I bought it for my studio and it only goes off when it wants to. On top of that you are unable to install it more than 10 feet away or it doesn't work at all. I bought this to replace one that gave me false signals when the cars would drive by, but I think I would rather have false signals than none at all. If you are going to use this for a place of business keep looking. This one is terrible!", "Date": "September 6, 2012"}, {"Title": "A Bust: Heath Zenith Wireless Entry Alert Chime SL-6168", "Author": "Dred \"Madmax\"", "ReviewID": "R3K9JEET3VK981", "Overall": "1.0", "Content": "Tried for 20 minutes to get it to work on the door.  Never happened.  Only holding it in the hand would the sensor work.  The distance claimed for sensitivity is not true.  Beyond 30 feet in a straight line of sight it never worked. I do not recommend anything that is so hard to install, even if it were to work.", "Date": "August 31, 2012"}, {"Title": "Great for entrance door.", "Author": "Thepoolman", "ReviewID": "R35AFGD3VF6YVO", "Overall": "5.0", "Content": "We have the transmitter installed about 50' from our warhouse door and this works great.  It was easy to install and it does have some different tones to select from.", "Date": "August 17, 2012"}, {"Title": "Transmitter has grown weaker in strength.", "Author": "Patrick", "ReviewID": "RONKMYZSVWY5", "Overall": "3.0", "Content": "The plug-in part of the alert system was originally plugged in a perfect spot in the office where everyone could hear the chime. A couple months in, we noticed that the chime no longer worked. I checked the battery first, but it was discovered that in order for the alert chime to sound, we had to move the plug-in part to a different part of the office, further away from those who need to hear it. Turning it up just makes it absurdly loud for anyone who happens to be in the room when it goes off.", "Date": "May 27, 2012"}, {"Title": "Zenith Door Alarm - not-so-epic FAIL", "Author": "Margaret Eaton", "ReviewID": "R16QRGZOI595OH", "Overall": "2.0", "Content": "Bought the transmitter and two receiver units. All were very simple to install and worked perfectly for about two weeks, after which they began to work intermittently. Sometimes one receiver will activate, sometimes both and sometimes neither.I haven't decided whether it is better to have them running, working only approximately every third time, or whether I would prefer not to have them at all...http://www.amazon.com/gp/product/B000HE6QXY/ref=cm_cr_rev_prod_title", "Date": "March 11, 2012"}, {"Title": "Exit door monitor", "Author": "P. Catey \"plczoo\"", "ReviewID": "R1LRG236ULHLK9", "Overall": "4.0", "Content": "I had purchased this door monitor because my youngest son kept getting up at night and had the run of the house all night long.  Since we have gotten the monitor, he has never come out of his bedroom at night, even to go to the bathroom.  So it is definitely working as a deterant.  Installing the equipment was easy.  The only issue I have is that there is a 2-3 second delay between the time that the door is open and the time that the chime sounds.  Since the speaker and the door are only about 20 feet apart, I am not sure why this is.  Anyway, my son is finally getting the rest he needs for school and I am not worrying about the house burning down every night.  Much better!", "Date": "May 10, 2010"}, {"Title": "Heath Zenith SL-6168-D", "Author": "D. Pham \"The Tooth Doctor\"", "ReviewID": "R2VSFHUVY52O1X", "Overall": "1.0", "Content": "i do not recomment to buy this item on internet, go to Lowe's so you can return easier. Mine only last 5 hours then it died. I had to go to Lowes to get the new one.", "Date": "April 18, 2010"}, {"Title": "It works, but the battery seems not last very long", "Author": "J. Wang", "ReviewID": "RSDAA4ZQDGV24", "Overall": "3.0", "Content": "It works as I expected, but the sensor's battery seems doesn't last very long. After two days of a brand new installation, it failed to work until I replaced a new sensor battery. So I guess I will need to prepare some more sensor batteries to keep it working.", "Date": "April 3, 2010"}, {"Title": "Don't buy it", "Author": "Gregory E. Rice", "ReviewID": "R1MPT6WK6FHWEM", "Overall": "2.0", "Content": "This is definite;y a case where I got what I payed for. The entry alarm only works reliablly if the receiver is less than 10 feet away. The chime has a pause of 3-4 secounds before sound, which ends up scaring people because they are already in the room. Despite having the volume control turned all the way down, it is still very loud which once again scares people.Don't buy this its a piece of junk.", "Date": "February 10, 2010"}, {"Title": "Works well, but not perfectly", "Author": "Lewis Moseley", "ReviewID": "R3OT17BMVA4S8N", "Overall": "4.0", "Content": "Works as expected most times, with transmitters on 1st floor and receiver on 2nd floor of my home.  Occasionally, doesn't chime when expected.  Occasionally, chimes when door isn't opened.  I may try the tricks here to extend the antenna and to change the frequency with the jumpers.Although not available from Amazon, a second transmitter can be purchased at a decent price.  Google \"Heath SL-6169\"", "Date": "December 23, 2009"}, {"Title": "Good product, works well, sticky backing could use some work.", "Author": "S. jaouen \"Beave\"", "ReviewID": "R3IFT5KFOQN83L", "Overall": "4.0", "Content": "Bought this product for the office. Works really well, has plenty of \"BING\". Transmits 50+ feet through one wall. Only problem I had was with the sticky backing of the transmiter. After 4 months it fell off (only reason it got 4 stars). No big deal, used a 3M command strip and it's working fine. Set up is easy and actually had to put it at a 90 deg angle to each other (transmiter set up) and still works fine. Now nobody sneeks up on us. If you're looking for a simple, easy product that works well for the price you can't beat it.", "Date": "December 15, 2009"}, {"Title": "Functional, but with Very Limited Range", "Author": "Reed White", "ReviewID": "R3UCXROJAVBE08", "Overall": "3.0", "Content": "I downgraded the rating to three stars due to the unit's limited range, which was 30-40 feet in my 3500 sq-ft two-story building.  In order to make it usable, I had to add an external antenna (explained below).This product is designed to sense the opening of a door.  It is easy to install and so far, has functioned reliably.  It comes with only one transmitter device, yet the receiver chime is capable of 2-channels, so that it can be additionally used with a [not-included] Heath Zenith door bell.  The receiver/chime has options for three sounds: ding, ding-dong, and Westminster.  It also has a volume control.  Note that some other Heath Zenith products, such as the Heath Zenith SL-6142-C, have only ding and ding-dong options with no volume control.I have three different Heath Zenith receiver/chime products in my building, and fortunately they are mostly compatible.  All three had to be modified with an external antenna, due to limited range.The simplest modification for increased range is to open the case, drill a hole at the bottom, and pass through the 10\" red antenna wire so that it dangles straight down.  If this doesn't do it, then add a 10\" counterpoise wire.  Drill a small hole in the top.  Solder the wire to ground foil on the PC board near where the red antenna wire is attached.  Pull the counterpoise wire straight up.  This modification (both wires) made the system barely usable in my building.", "Date": "November 29, 2009"}, {"Title": "Chime range", "Author": "M. Blissett", "ReviewID": "R10MNWDR4WVIWG", "Overall": "3.0", "Content": "The range is not very far on this chime.  Works great if you want the chime fairly close to the door, but not if you wanted it in another room.", "Date": "August 7, 2009"}, {"Title": "wireless entry alert", "Author": "Robert C. Stacconi", "ReviewID": "R3MAC6L0DPV2Z7", "Overall": "5.0", "Content": "I purchased this for my daughter's Bake Shop. Heath Zenith SL-6168-C Wireless Plug-In Chime with Entry-Alert Sensor, White  Tried other alerts and this is the best. Recommmend it for others.", "Date": "July 31, 2009"}, {"Title": "Remote Door Chime for Businesses", "Author": "Dr. John", "ReviewID": "RI82VCSG0XIQB", "Overall": "4.0", "Content": "This unit works well once you change the frequency from that which comes factory set. If you leave it like the factory sets it you get quite a few false rings possibly from aberrant signals in the area.  Also, the battery in the remote unit does not insert solidly so you have to be really quick to get the door back on it.  Finally, I don't believe you can set it so that it only has one chime for the entry.  Your choices are either Westminster or ding-dong.  I'd prefer a single ding (or dong).  Otherwise, it is a very nice unit.  I'd recommend it.  Amazon's return is also very hassle-free as I had to replace the first unit I received.  They sent out a return label and a new unit.  Very efficient.", "Date": "April 24, 2009"}, {"Title": "Great item!", "Author": "Geri", "ReviewID": "R10F8TMFRHJ8BP", "Overall": "5.0", "Content": "Works great on the double glass doors of my training center.Was very easy to install and set chime.~Geri", "Date": "March 4, 2009"}, {"Title": "Very Limited Range in Apartment Building", "Author": "Liberty4all \"DMZ\"", "ReviewID": "R9JYAMNHFNV2O", "Overall": "3.0", "Content": "The specifications on this chime claim that it works up to 100 feet. That may be true, but if you are considering using it in building with brick, concrete or steel walls as I was, be aware that the range is far less. To be precise, I could not get the chime to ring at a distance of 25 feet. The mini-manual does state that concrete and steel will limit the effective range, but when it cuts the range down more than 75%, it made it useless for me. As they say, your mileage may vary...", "Date": "December 5, 2008"}, {"Title": "Good product for the price", "Author": "T. Wong", "ReviewID": "R1I1XVOZL0HH6O", "Overall": "4.0", "Content": "I have a 1000 square foot medical office and needed an alarm for when patients entered the front door. The door chime sounds nice and sounds off about 99% of the time. The unit is relatively easy to install, but the volume is rather loud and does not really lower much. Otherwise, it is a great product for the price and I would recommend it.", "Date": "September 4, 2008"}, {"Title": "Works great!", "Author": "Daniel Davis \"Music Geek\"", "ReviewID": "R33LIKRO3YE4WS", "Overall": "4.0", "Content": "Bought this handy little item from another well-known home improvement store, for roughly the same price.  I wanted a chime for the front gate, as it is the only point of entrance around my house that does not have a lock.  After a bit of trial-and-error, it is now working flawlessly.  I wrapped it in kitchen plastic wrap and a little bit of duct tape, and secured it to the gate with zip-ties.  Yeah, it's a little MacGyver'd, but I get a nice chime everytime the gate is opened.A couple of minor cons:The unit needs to be aligned just right for it to properly work.  If the smaller piece is too low or too high, you won't get the chime.  Also, the volume of the receiver is pretty high, even at the lowest setting.One nice thing that the unit features is multiple tones.  One ding, a ding-dong, and that chime that every grandfather clock seems to have (I think it's called \"Westminster\").  You just have to change the jumpers on the back panel.If you are looking for a good chime to give you a heads-up that you have a visitor, you could do a lot worse than this little guy.", "Date": "July 25, 2008"}, {"Title": "Works great", "Author": "Fred Fourby \"Fred\"", "ReviewID": "R1PHCA0QCS638D", "Overall": "5.0", "Content": "Works as they said.  Needed an entry alarm at my new office.  Hung sensor on door in 5 minutes with just a screwdriver.  Actual chime is in another room about 80 feet away and works fine.  Only problem I had was my wireless door bell was on same frequency.  So if someone opened the door my door chime and door bell went off each a little apart.  Almost sounded like a grandfather clock.  Was easy to fix.  Per simple instructions I just had to change the little jumper position.Shipping was mega fast.  I had just printed the receipt after ordering and 5 minutes later the UPS driver showed up (just kidding but it was fast)", "Date": "June 19, 2008"}, {"Title": "great gate announcer", "Author": "F. Loehrer \"Franko\"", "ReviewID": "R15S4EHOT3LY8F", "Overall": "5.0", "Content": "i have had this on my outside gate to announce when someone opens the gate.  been there since 2004.. life saver.. you have to wrap or cover the transmitter to keep it from the weather. but it dosent stop it from transmiting..  very cool thing to have if you want to monitor a door or gate..", "Date": "December 8, 2007"}, {"Title": "Beware this is not a doorbell", "Author": "georgehd \"georgehd\"", "ReviewID": "R1EZ4PCJHZV928", "Overall": "1.0", "Content": "I read the description of this product and ordered it thinking that it was a doorbell and also a sensor.  It is not a doorbell and Amazon should change the written material about this product.  It is not what I wanted at all.  Unfortunately I did not read the customer reviews; if I had I would have noted that another buyer made the same mistake.", "Date": "November 16, 2007"}, {"Title": "Very disappointed!", "Author": "M. Hanshaw", "ReviewID": "R3VHUIX3HBCPM3", "Overall": "1.0", "Content": "This product worked great for about the first 5 times the door was opened, then it stopped. The lights show that the battery is working properly, but will not chime. The company is a pain to deal with. I have called several times this morning and was on hold for 20 minutes at a time until the line goes dead. I call customer service and they put me through again to Tech. support and get the same treatment. Put on hold until their line goes dead. I'm very frustrated. Product is going back.", "Date": "September 29, 2008"}, {"Title": "Only worked within 20ft of door!!", "Author": "Charity", "ReviewID": "R24FWMZZ0BH3CP", "Overall": "1.0", "Content": "After reading all the reviews which talked about the door chime working 75% of the time and only working within 20ft of the door... I still decided to risk it and make the purchase. My experience was exactly the same results. Installed ok on our garage-entry door and it worked perfect using outlet 20ft away in hallway... but when I tried moving it to 3 different outlets at 40ft to 60ft away from the door, I got intermittent results and then next day it stopped working completely. I don't know why the signal was so weak, since we had no \"interference\" problem. We have Wood frame house and no other radio ways in the house or surrounding us. Finally, I moved back to outlet 20ft way and now it works 90% of the time. I'm probably going to send it back to manufacturer with warranty claim?? but it is time for Amazon to \"drop\" this product, since 50% of reviews are 2-star or less.", "Date": "March 18, 2012"}, {"Title": ". It is ONLY an entrance sensor, not a doorbell", "Author": "Ed Galvin", "ReviewID": "RV00TAYJUJ3WR", "Overall": "2.0", "Content": "This item is NOT a doorbell or ringer, where people at your front door push a button to summon you. It is ONLY an entrance alarm/charm, for use in businesses to alert when a customer enters a shop!In the picture, the middle sized item is a sensor/transmitter which you mount on the doorjam and the small one is a magnet, which you mount on the door. When the door opens and they separate, the chime sounds from the large item, which you plug into andescription used the term \"doorbell\" several times, this is not a DoorBell.", "Date": "December 30, 2011"}, {"Title": "Do not purchase!", "Author": "Eva", "ReviewID": "R3T075WAPCA6ZU", "Overall": "1.0", "Content": "I am very disappointed with this product. It should work up to 100-foot range, but it doesn't even work in 50-foot range. Do not buy it, you'll be very disappointed!", "Date": "September 19, 2011"}, {"Title": "Barely Functional", "Author": "kmereno", "ReviewID": "R2Q2IWNQBX6966", "Overall": "1.0", "Content": "The minute you move the receiver unit any distance away from the transmitter it fails to work.  I was barely able to get it to work when placing the chime unit within 10 feet of the door.  (Certainly not even close to the 100 ft range it advertises.)  Very disappointing.  I sent it back.", "Date": "June 11, 2011"}, {"Title": "Buyer BEWARE... A piece of JUNK", "Author": "Lcozy", "ReviewID": "R1PVLDSCF0EH39", "Overall": "1.0", "Content": "This thing has NOT worked correctly since the day we got it... It worked on occasion when we first bought it, but what good is that? NOW, it doesn't work AT ALL!Buyer beware - don't buy it, it's junk.", "Date": "September 23, 2010"}, {"Title": "Works?", "Author": "jb", "ReviewID": "R2FR73CLA7RPOB", "Overall": "1.0", "Content": "The item shipped quickly and worked well for one week then would not sound tone unless receiver was within 25 feet of sender.", "Date": "June 28, 2010"}, {"Title": "wireless door bell", "Author": "J. Cappello \"very unhappy customer\"", "ReviewID": "RHAXKJNP550GE", "Overall": "1.0", "Content": "I purchased a wireless doorbell and had a problem. I called tech support, on my landline phone, for help and they kept me on hold for 45 minutes. While waiting I called on my cell (not to lose my place in line)when I reached customer service they said that the tech people were out to lunch. So I went back to the store and got a refund. This is the first and last time I will buy any of their products.", "Date": "November 15, 2008"}, {"Title": "defective item", "Author": "thordds", "ReviewID": "R23KN6DPWOHPGK", "Overall": "1.0", "Content": "i knew that this wasn't the best item but it wasn't the worse either.  must have to say i was a little disappointed.  the chime unit didn't work at all without any sound.  read thru the owners manual.  played around w/ the jumper settings for about 30 minutes.  called tech support the next morning after 8 minutes on hold.  tech just took about 30 seconds and said that it is probably defective and to return it back to amazon.com.  will see if the new one will fair any better.", "Date": "September 8, 2011"}, {"Title": "NO DOOR ALERT, DOES NOT WORK", "Author": "Nancy Dean", "ReviewID": "R2T1HRB6GOWM0S", "Overall": "1.0", "Content": "This product works great for a few hours and then it works only on intermittently.. Not what you need in a retail environment when you need to be alerted that there are customers.  Not a good purchase.", "Date": "April 4, 2014"}, {"Title": "don't like", "Author": "michael", "ReviewID": "R2BWMAP0C49NF9", "Overall": "1.0", "Content": "Too confusing so much that it is still in the box I didn't even attempt to install and I feel that it was money wasted, I never returned this item out of laziness and now it is probably too late", "Date": "February 14, 2014"}, {"Title": "you get what you pay for", "Author": "Last Man Standing", "ReviewID": "RUGFBSTQYLXZH", "Overall": "1.0", "Content": "NOT FOR COMMERCIAL USE. that is to say, attaching it to an aluminum frame door, as most commercial doors are, renders this POS useless. that is what they're customer service told me was the reason it chimed for no reason, but does not chime when the door is opened. useless!!", "Date": "June 9, 2012"}], "ProductInfo": {"Price": "$43.95", "Features": "Simple styling\n3 tunes with adjustable volume control\nBattery operated\nUp to 100-foot range\nEasily installed\n1 Year Warranty\n8 Note Westminster Or 2 Note Melody For Front Entrance & 1 Note For Rear Entrance\nEntry Alert Chime Activates When Magnetic Sensor Separates\nSl-6168 Entry Alert Door Chime Kit Includes 1 Chime Receiver & 1 Magnetic Sensor (Sensor Battery Included)\nUp To 100-Ft Transmission Range", "Name": "Heath Zenith Wireless Entry Alert Chime SL-6168", "ImgURL": "http://ecx.images-amazon.com/images/I/31NRlp87KHL._SX300_.jpg", "ProductID": "B000HE6QXY"}}