{"Reviews": [{"Title": "Good, but needs work", "Author": "Don Wilkins, Ph.D.", "ReviewID": "R2XSLIED1BZ3B5", "Overall": "3.0", "Content": "This is a nifty idea if you're tired of messing with keys or a touch pad with a load of groceries in your arms. The idea is, you can open your door from a short distance with the press of a button. I installed it on door in the garage that opens to the house. Now we can zap the lock from our car. Installation is about as easy as it could be, given the need to line up the latch carefully.Just a few problems that could be fixed by a little engineering and better management:1. The mechanism is noisy; not that it matters much, since you don't use it often. But it definitely gets your attention.2. The biggest problem is that the key fobs are unnecessarily bulky and a little unreliable. You get two with the unit, and one that I received didn't work. Calling for help was useless (see below). I eventually took it apart and found that a contact was out of alignment. I bent it so that it would work, but discovered that ordinary pressure on the housing when you push a button is enough to misalign it. So I can keep it working only if I use light pressure carefully. You can buy extra fobs for $15 a pop, but why should you have to? I thought of sending it back for replacement, but then I'd have to spend more money on postage and handling, with no assurance that the replacement would work any better, considering the design. As to the general operation, the manufacturer says that it's radio frequency, not infrared, so you don't have to point it at the doorlock. That seems to be true, but I've found that the operation is a little sporadic. Sometimes it fails to respond for no apparent reason. Also, you can't just give the buttons a quick touch. You have to hold them down for a second or two.3. Customer service was good news/bad news. The good is that I got through to someone immediately. I told the guy that the remote didn't work, and that I suspected a weak battery. But his reply was basically, \"Yeah, so what, we don't guarantee batteries. You can probably get them at Radio Shack.\" Since the unit uses two watch batteries, I figured replacing them would be relatively expensive, and I told him that the unit had failed to work right out of the box. No response. After that I opened the unit and eventually discovered the problem with the contact.The problems with the fobs (remotes) are a major drawback because there's no point in having the unit if they don't work well. And the bulkiness is simply bad engineering (key fobs for cars are more complex, yet smaller and more reliable). So if there were other options available, I would recommend them. But it appears that this is the only unit of its kind on the market, and it does work as advertised as long as you're careful with the fob.", "Date": "May 12, 2007"}, {"Title": "Better than other reviewers' posted...", "Author": "B. Singer \"S&W; Winger\"", "ReviewID": "R264V1856MWFZE", "Overall": "5.0", "Content": "...maybe not perfect, but what the heck is? Since I now use a wheelchair for mobility, this remote door lock is a godsend...I could not reach to unlock the door with a key...also, I can lock/unlock from bed...works well, sometimes a little slow if from a distance...but I am extemely happy this exists and works!And since it has been sometime since a review, the remote buttons are recessed, and many other issues appear resolved...I'd buy again!", "Date": "June 2, 2010"}, {"Title": "Ok but not quite right", "Author": "Just a reviewer", "ReviewID": "R720QNMVAIZ0I", "Overall": "2.0", "Content": "Worked well for the first month or so but came to hate the remote buttons which stick out from the remote.  The result of the buttons being raised allowed the buttons to be pushed when in a purse or pocket, draining the batteries very quickly.  The internal gears of the lock seem weak compared to a black and decker one I had several years ago at another location.  Occasionaly they would slip if the door was not perfectly centered resulting in the use of the key to open the door.", "Date": "February 17, 2007"}, {"Title": "Love it except in the winters", "Author": "Auburn Girl \"Allicat\"", "ReviewID": "R2O24AKNXT28HU", "Overall": "4.0", "Content": "I love this remote.  My boyfriend and I fight to see who can lock the door the fastest.  It is fabulous when I get out of the car and don't want to balance keys and items from the car.  It has a great range and I often crank my car and lock the door from the car.My only challenge it not necessarily a problem with the lock, but in the winter, my front door shrinks some which cause the deadbolt to not lock or not open.  Right now, the lock is not completely opening and I had to use a knife to get the lock to move completely out of the way.Update - 1 year later.  The lock broke in the locked position.  I had to break into my house through a window.  The bolt would NOT MOVE. I had to unscrew the lock from the inside once I got in, and had to replace the lock with a regular one.  I ruined the doorframe trying to pry the lock back and open.  I don't regret the lock, but it was a nightmare when it broke.", "Date": "December 5, 2007"}, {"Title": "not what it seems", "Author": "Howard", "ReviewID": "R1KJZ7JRV3X5M5", "Overall": "1.0", "Content": "The picture does not show that there is a hugh box on the back of the door which in my case makes this product worthless.", "Date": "September 6, 2009"}, {"Title": "Handy.....\"IF\"", "Author": "katt", "ReviewID": "R3DBABY8WIFE6H", "Overall": "3.0", "Content": "Purchased for my father who is in a wheelchair and needs the remote option.Well, i do not recall reading anything when we purchased this unit aboutit not perforning if you have s steel (metal) core door.We end up findig this out within the first week of frustration.The CSR told my father that this a a common problem.Well.....if that's the case, why not add that to your item description ????We were told that if we made a \"gasket\" out of thin rubber or cork that would solve the problem. We'll see.....", "Date": "December 19, 2010"}, {"Title": "Misrepresented", "Author": "Sunshyn Vanderheiden \"Sunshyn\"", "ReviewID": "R24569DVHVXW0O", "Overall": "3.0", "Content": "This is a good deadbolt, and the remote has surprising range. However, the write-up is incorrect in their advertisement of an auto-lock function. This deadbolt does NOT have any such function. We have been informed by the manufacturer that that has never been available on their deadbolts.", "Date": "June 20, 2006"}, {"Title": "Electronic Dead Bolt for entry door", "Author": "Dr. Terrance Nordmann \"Wolftwo\"", "ReviewID": "R2SQMUT0GVFT2N", "Overall": "5.0", "Content": "This was a replacement for the old Black and Decker system that is no longer made. Perfect fit, easy instructions, great lock works 100%. Even comes with it's own phillips screw driver that is the correct size.This company have made great improvements on this lock and the technology is current. The key way is an SW1 the best keyway in the US. Locksmith was impressed, as old keyway was KW. It came well packages and very quickly. Would recomend that if you need an electronic entry way and don't want to mess with pushing numbers in the dark, this is the answer. Our entry is on the dark side and you can push the buttom on the key fob transmitter and open or close the lock. The red and green light tells you if the transmitter and reciver connected. Well worth the money with two fob transmitters and two SW-1 keys.The old one had a red led inside to tell when it was locked the new does not.", "Date": "March 16, 2007"}, {"Title": "Great Product and Customer Service", "Author": "Hima Yapa \"Hima\"", "ReviewID": "R2737Y3NLODXWU", "Overall": "5.0", "Content": "I Have been using this RF deadbolt for about 2 months now and it works great.  It was a snap to install and works as advertised.  Remote range is pretty good, about 25ft or so.  The construction is sturdy, and brass has a nice finish.  The instructions were pretty decent and only tricky part is lining up the dead bolt hole to the dead bolt.  If you don't get that accurately it may  not lock, and give you the annoying error beep.  It took me a few tries to get it right.  Make sure you check the little switch in the back and its in the position for left or right hand door otherwise the remote buttons will work in opposite.  I called Morning industries to verify this and their customer service was AWESOME.  Very helpful and knowledgeable.  I ended up ordering two more remotes from them too.  Best part of the system is you can add and remove remotes as you wish.  If you loose one just erase it from the system and add a new one.", "Date": "March 6, 2007"}, {"Title": "Loved it... for about 3 months", "Author": "cowstein", "ReviewID": "RPPRW9I463M9F", "Overall": "2.0", "Content": "Oh you'll love this door lock... for about three months. At first it's really cool: Remote control operation, no more keys... but then you hate it. Because the key fobs break (I've had to replace two). They're cheaply made. The buttons protrude, which leads to accidental unlocking and battery drain. The deadbolt often gets stuck. This thing is the technology of the future, if you're living in 1982. Also, the customer service is terrible. Trust me on this, it's fun for a bit but then you hate it. I'm only on Amazon because I'm shopping for new locks...", "Date": "February 10, 2011"}, {"Title": "Better than advertised", "Author": "sonny", "ReviewID": "R1V3F5X69VXGPG", "Overall": "5.0", "Content": "Morning Industries should display both parts of this product to fully illustrate the appearance of the completed installation.  The lock is sturdy and nice looking.", "Date": "February 16, 2013"}, {"Title": "Awesome gift", "Author": "Skiing79", "ReviewID": "R33XVTEWYJIKUZ", "Overall": "5.0", "Content": "Bought this for my girlfriend for Christmas and she loves it! I was able to use with existing outside hardware(not allowed to change b/c of HOA rules) I highly recommend for people that always have their arms full!", "Date": "January 17, 2013"}, {"Title": "Easy install and you don't even have to replace your current lock!", "Author": "J. Blair", "ReviewID": "R18MUCG23IN2D", "Overall": "5.0", "Content": "Installation is quite easy with this unit and you don't even have to replace the locks you already have in place. Where I live I cannot replace the BEST industrial locks on the doors but I still wanted the remote feature. All I had to do was unscrew the indoor side and replace it with the mechanical unit from this. The existing screws worked all the same and I was able to complete the installation in a few minutes.At first install the range of the remote wasn't that far. I e-mailed tech support and they told me to line the back of the unit with duct tape and that should help. Well I ended up just using some masking tape and the range increased about 5-10 feet. This only seems to be an issue on Metal Doors. But overall I am very satisfied with the lock.The main reason I purchased this unit is because it can work with INSTEON Home Automation Products with the \"MorningLinc\" adapter. We the switches I have around the house I can choose to lock the doors. This comes in handy with the table side switch I have on my nightstand, at night I just press a button and all the doors get locked and I can sleep with that peace of mind.All in all I was very satisfied with this unit and would recommend it to anyone especially if you have INSTEON products in your house.UPDATE: I just purchased and installed another unit and again installation was just as easy. I recommend this to anyone!", "Date": "July 13, 2010"}, {"Title": "Awesome", "Author": "Sashmo", "ReviewID": "R1GBS8F81LQRD9", "Overall": "5.0", "Content": "I had one of these a long time ago.  I wanted to get one for my new condo.  Installed perfectly!No issues.Love it.", "Date": "March 18, 2011"}, {"Title": "Excellent, just what I was looking for.", "Author": "Fred Lutcher", "ReviewID": "R8LCKLM5WND3Q", "Overall": "5.0", "Content": "I had a different brand of remote lock in the past and it was not as well constructed or as nice looking as this Morning Industry model.  The lock installed easily and quickly (just remember if installing on a steel door to put duct tape on the back of the metal bracket on the inside of the door to keep it from touching the door, otherwise there will be interference with the signal).  It has a solid feel and works well thus far.  The bronze is lighter than my Kwikset knob and I wish this company sold a knob with it in matching finish.  Otherwise, it's great!", "Date": "March 14, 2012"}, {"Title": "works well", "Author": "MattG", "ReviewID": "R3JC50KQ8F5FB", "Overall": "4.0", "Content": "Overall this product is working well for me.  Installation is fairly easy (easier if you've put in a door lock before).  However, the directions included in the box I received leave a lot to be desired.  The clear (C) and set (S) buttons were mislabled on the direction sheet.  Go by what's printed on the unit itself.  Also, fyi, the small switch lets you toggle the open/closed directions of the lock depending on how your door is hung.", "Date": "July 15, 2009"}, {"Title": "Works like a charm!", "Author": "DenDen", "ReviewID": "R3KLOU3045C88X", "Overall": "5.0", "Content": "Very good item. I had a minor installation problem, called the company and they gave clear instructions and were very curtious. The lock itself is well made and very convenient. I would recommend this remote deadbolt to everyone. I Always use the remote and haven't used the key since I've had this!", "Date": "January 18, 2009"}, {"Title": "Great Product", "Author": "J. Keesler \"indiana dad\"", "ReviewID": "R1PWSDMQHFZNWE", "Overall": "5.0", "Content": "RF Remote Deadbolt, BrassThis is a GREAT PRODUCT We have used it for over a year and have not had any problems with unit or the remotes. It was super easy to install and has worked flawlessly as described in the product review.  Two thumbs up for a great, easy to use product.", "Date": "December 1, 2007"}, {"Title": "Remote Control Deadbolt Lock", "Author": "Captain Bruce", "ReviewID": "R12NLUVV8DQGGL", "Overall": "5.0", "Content": "THIS REMOTE CONTROL DEADBOLT LOCK IS EVERYTHING THAT I WANTED.  THERE WAS ONE ON MY HOUSE WHEN I BOUGHT IT.  REPLACING IT WAS A PROBLEM.  NONE OF THE BIG BOX STORES CARRY THIS ITEM.  I WAS SO GLAD TO FIND IT ON AMAZON.COM.  I WAS A LITTLE RETICENT THAT IT MIGHT NOT BE GOOD.  IT IS GREAT.  NO REGRETS.  IT'S NOT CLEAR IN THE DESCRIPTION...LET ME TELL YOU...YOU GET TWO KEYS AND TWO REMOTE CONTROLS.  PERFECT.  YOU CAN LOCK YOUR DEADBOLT AS YOU WALK AWAY TOWARD YOUR CAR.  YOU CAN UNLOCK IT AS YOU APPROACH YOUR DOOR WHEN RETURNING.  HIGHLY RECOMMENDED.", "Date": "November 15, 2012"}, {"Title": "Great Product...terrible remotes!", "Author": "Amazon Customer", "ReviewID": "R1J624GYTW4UIT", "Overall": "4.0", "Content": "I received my remote control deadbolt and had it installed and working within an hour. Just follow the directions to the letter and you should have no problem...the instructions are a little sparse but the illustrations are good. Now for the remotes...if they were a little better I would have given 5 stars. They are very cheaply made...now don't get me wrong...they work...just you may have to push the button 2 or 3 times...mostly twice for me. Since I haven't had them too long I can't say how long they will last...but it wouldn't surprise me if they lasted only six months. They are however cheap to replace. Anyway lock performs great...remote has a decent range (30 - 40 feet) just hope the remote lasts longer than it looks.", "Date": "January 18, 2009"}, {"Title": "i wanted this to work sooo badly", "Author": "darlene mccauley", "ReviewID": "R1UGZ3BOR15M2S", "Overall": "1.0", "Content": "this lock worked great for a few months and then became very tempermental.  the dead bolt will not retract completely anymore.  so i have to manually turn the lock on the inside, push the door shut and then turn the deadbolt to lock.  i haven't replaced the lock but am back to using the key....making this lock pointless.  based on past reviews, i never called customer service....save your money and wait for better quality.", "Date": "February 10, 2011"}, {"Title": "Very good product", "Author": "Frank J. Girardi Jr.", "ReviewID": "R3PNTHWYUP1GXD", "Overall": "5.0", "Content": "Perfect for handicapped people who know who's at the door (i.e. nurse, relative, take out food, drug store, other expected people). You can unlock and/or lock the door from approx. 20 feet away without getting up. It beeps once to confirm an unlock and beeps twice to confirm it locked. I installed it myself. It no more difficult than an ordinary dead bolt install. My first lock had a short and drained the battery in a week. They're customer service was very helpful and shipped a replacement out. It's working perfectly now.", "Date": "December 16, 2012"}, {"Title": "Morning Industry RF-01P Radio Frequency Remote Deadbolt, Polished Brass", "Author": "Richard P. Seidel", "ReviewID": "RYFTB5HYEY64E", "Overall": "5.0", "Content": "The hardest part of the installation was getting the old lock set out.Good instructions, but the print is too small.I could recommend to anyone.", "Date": "April 21, 2014"}, {"Title": "Works well and was very easy to install", "Author": "DM near the bay", "ReviewID": "R380IS8NFQL6A", "Overall": "4.0", "Content": "The installation was a breeze and it works as advertised. The Rubbed Bronze finish was an almost exact match to the existing Rubbed Bronze Baldwin hardware and the unit doesn't look cheap on the door. The remote has good range. Only con for me is the remote doesn't appear to be  particularly sturdy but time will tell.", "Date": "April 11, 2014"}, {"Title": "WORKS GREAT111", "Author": "carl allen", "ReviewID": "R2GHODFB6ZFWAY", "Overall": "4.0", "Content": "I came with no instructions. I had to replace the bats in the keyfobs  CRO2016 about $3.50 each.otherwise it is Good To Go", "Date": "April 3, 2014"}, {"Title": "Excellent product!", "Author": "G. Smith", "ReviewID": "RCE1PVNCNO4K9", "Overall": "5.0", "Content": "Purchased for person with mobility issues and confined to wheelchair.  This works wonderfully when entering the house and once in.  You can not only lock the door behind you with the push of a button but also unlock when someone's there once you recognize the voice without having to go to the door.", "Date": "March 27, 2014"}, {"Title": "Lock does what was expected.", "Author": "Richard limerick", "ReviewID": "R3HA4N64KSSE9K", "Overall": "5.0", "Content": "It does what I expected.  I  did not plan on buying a new door because the lock did not match the original hole from the old lock.", "Date": "February 21, 2014"}, {"Title": "Great product for handicap.", "Author": "Steve", "ReviewID": "R3JEA9IU4F6B4D", "Overall": "5.0", "Content": "I am unable to walk very well and have many people coming over to help me during the day. This way I can keep the door locked and hit the remote when my nurse comes over without taking 10 minutes to get to the door. Would also recommend to any lazy individual or busy person that always have their hands full.", "Date": "February 15, 2014"}, {"Title": "This is great--but only when it works!", "Author": "Jack JustJack", "ReviewID": "R151HT80PCR2PD", "Overall": "3.0", "Content": "This was meant to be a solution for someone in my home with low vision and difficulty with keys. Everyone loved it when it worked (3 or 4 months), but it is now just another crap lock that requires a key. Waiting to see if KEVO is a better choice.", "Date": "September 12, 2013"}, {"Title": "love it", "Author": "Boopie", "ReviewID": "R37B6BX9VJ9SPI", "Overall": "5.0", "Content": "bought both this and the knob bolt from this manufacturer and they both work with the same fob. This works reliably, just like on my car no keys to fumble with. I use imedion rechargeable batteries now, i used to use eneloops and duracell hybrids, they work just as well and last about 9-12 months. The fobs die faster, probably 6 months but battery changes are a breeze. Most of the time, even if batteries die the locks usually don't need recode setting.  Battery changes are a breeze. Instructions are left on the inside of the unit so you never forget how to reset codes if needed. one of the locks could be set automatically to lock after several seconds but not the other, i forgot if it was the deadbolt lock or knob lock, since they both didnt have that feature i just  turned that feature off.  Excellent product. Also, i live in a condo, where all door locks look identical, these fit beautifully. Noone can tell these are not the original locks. Very discreet. I intend to purchase another set for my elderly mom. I have had this for three years now, still working. I am not gentle with closing my doors.  The finish looks just like the day they were purchased.", "Date": "August 28, 2013"}, {"Title": "Convenient lock", "Author": "Teresa Norris", "ReviewID": "R3D7L3QZFM0MEC", "Overall": "5.0", "Content": "Easy to install and easy to use.  I love not having to struggle to put the key in the keyhole.  Plus if you get the same brand of knob you can very easily set the remote to work on both at the same time.", "Date": "January 12, 2013"}, {"Title": "Great Product Remotes Suck", "Author": "F. Afshar", "ReviewID": "RGMAZ20D2E7XL", "Overall": "3.0", "Content": "This product is great for me. I live in a condo and my first floor is the garage so when ppl come over and leave and I do not have to go up and down a flight of steps to lock and unlock the door. But if you have to keep the remote in a pocket, like everyone else said the buttons are raised up. So in pocket, purse, or whatever the batteries drain in a day or two.", "Date": "December 4, 2010"}, {"Title": "Remote deadbolt has weak remote", "Author": "C. E. Hodgson", "ReviewID": "R2NB4FVPPUWPRF", "Overall": "4.0", "Content": "The lock looks & works great.  However one remote has failed after 2 months.  I fear the other may as well.  Good lock, weak remote.  If it had a better remote & I would give 5 stars...", "Date": "February 22, 2010"}, {"Title": "Good lock, works well", "Author": "James J. Darby \"Seabiscuit\"", "ReviewID": "R2Z46CM3FLBI7K", "Overall": "5.0", "Content": "Got this for my 90 year old Mom, works well.Beeps for open and close could be louder for the hard of hearing.", "Date": "February 25, 2013"}, {"Title": "hidden pitfall", "Author": "David A. Crossley", "ReviewID": "R12M63F9LE4RU9", "Overall": "1.0", "Content": "This device looked like the solution for my porch access  gate.  The situation does not need high security just controllable privacy.  The product picture shows a conventional deadbolt and says it is just a drop-in replacement.  What they DON'T show is the backside (inside of door). Instead of a conventional key lock (double bolt) or a thumb knob there is a very large box (about 2\" x 5\") that houses the batteries and electronics.  First, it is too large to fit most deadbolt/doorknob installations, and second it is not weatherproof so it must be on an interior side.I really don't know who could use this.  It is suitable for a door with ONLY a deadbolt (no knob) and with one side protected from weather.", "Date": "April 8, 2012"}, {"Title": "Remote Control Deadbolt", "Author": "Amazon Customer", "ReviewID": "R37SOGG1L9ZTTH", "Overall": "1.0", "Content": "Don't waste your time unless your door and old lock is perfect. If you do not line up perfectly, even just a little tight on the bolt going intothe hole and it won't work. I had a lot of trouble with the remote somehow not working at all and had to re-set it up. It was a real cool idea but definately not worth the money or hassle. Just my opinion. Instead I bought one from Home Depot with a kepad and deadbolt latch that would spin unless you put in the code then it would let you manually turn and unlock it. I love this one and so does everyone else that seescit. You can program different codes for different people and delete codes anytime.", "Date": "June 19, 2013"}, {"Title": "Schlage could not do this!", "Author": "Dougie Quick \"Dougie Quick\"", "ReviewID": "RXMH52K400KNP", "Overall": "4.0", "Content": "I have to say it less than perfect but does work the majority of the time.  It is just so frustrating that no one else makes these in a high quality design!  Schlage claims it can't be done for residential stuff due to poor alignment of so many deadbolt installations and the amount of force needed to through the bolt. I say that is hogwash! If this company can make one that pretty much works most of the time and sell it for peanuts then I KNOW it can be designed with a larger housing inside, stronger motor, more battery, and/or more reduction ratio or whatever the term is so that the same amount of force is multiplied only slower ...like 1st gear on a 10 speed bike rather than 5th gear for instance ...yes it already is kinda slow and it would be slower still but have mor ummph!  So a company like Schlage or kwikset or Baldwin or whoever is without excuse! It could be done absolutely and we could also have the keypad and cel phone/ PC interface to provide access to someone even though we are accross the country etc etc.  The big guys have these bells and whistles but they cant even give you a motor like this company did! People that have the Schlage for instance can only go though Schlage web site to allow someone to turn the bolt manually RIGHT NOW THIS SECOND to unlock the door, and then all over again to RELOCK it! That has to be a nightmare! Oh I know if we wanted to shell out thousands of dollars we could have commercial stuff installed but I am talking about real world homeowner two hundred buck maximumish ...this is state of the art, like it or not ...at least they make the effort and it helps some of us.", "Date": "August 26, 2011"}], "ProductInfo": {"Price": "$159.99", "Features": "Remote control your door lock up to 30-feet away\nAccept up to 15 different remote controls\nQuick and secure entry to your door\nRequire 4 AA Alkaline Batteries (not included)\nEasy installation--fits standard door prep with no additional drilling required", "Name": "Morning Industry RF-01P Radio Frequency Remote Deadbolt, Polished Brass", "ImgURL": "http://ecx.images-amazon.com/images/I/41DFW5sUuOL._SX300_.jpg", "ProductID": "B000FBU2KM"}}