{"Reviews": [{"Title": "Did not work for SDI (high definition) Swann camera system.", "Author": "Picky reviewer", "ReviewID": "RZCLLWXB01N59", "Overall": "1.0", "Content": "These would not work for an SDI camera system (purchased 2). I checked continuity of both cables and ohm meter indicated that the cables were okay. I bought these to extend the 60 foot cables that came with the camera, but when connected they would not carry the video at all, even when used by themselves. The cable would carry power, but not video. I gave the cables to a friend that has a standard camera system, but he hasn't tried them out yet. Once he does, I'll update my review.", "Date": "February 26, 2014"}, {"Title": "Great Product", "Author": "Scott Nelson", "ReviewID": "R2XSTC1WG2RXHP", "Overall": "5.0", "Content": "Product works great and a separate power supply a definite when running long distances. Use as a extension to existing installation or initial run.", "Date": "April 29, 2013"}, {"Title": "No complaints.", "Author": "d.d.dudes.dad \"", "ReviewID": "R1801LFJZ1BBFE", "Overall": "5.0", "Content": null, "Date": "February 11, 2013"}, {"Title": "Q-see 50 ft power cable", "Author": "Sammy R. Baugus Jr.", "ReviewID": "ROLE7UKVNSRNJ", "Overall": "5.0", "Content": "Great product and just what I needed to complete my home security system. It is a very well made cable.", "Date": "April 11, 2014"}, {"Title": "Awesome", "Author": "Randall", "ReviewID": "R3FP2JKERB7SHG", "Overall": "5.0", "Content": "Worked like a charm!!! I needed this to extend my camera to the far side of my house, no loss in video quality!!", "Date": "April 4, 2014"}, {"Title": "Excellent product", "Author": "charles william curren", "ReviewID": "R2M8G20D9XK3OE", "Overall": "5.0", "Content": "Expanding my usage of this reliable product. I highly recommend this product  when  upgrading/expanding your system .. or when  installing  initial system.", "Date": "March 3, 2014"}, {"Title": "Junk - I have to wiggle connector to get a picture.", "Author": "Douglas M. Buckley", "ReviewID": "R22SRIGP5CTNNM", "Overall": "1.0", "Content": "I didn't run this cable right away and when I did it was defective - little or NO quality control.", "Date": "February 26, 2014"}, {"Title": "Does the job", "Author": "MissyJay", "ReviewID": "RHM25G1H8HIA0", "Overall": "4.0", "Content": "Needed these cables to complete the installation of my surveillance cameras.  The wires inside are a little fragile, they will bend easily.", "Date": "January 17, 2014"}, {"Title": "Worked great", "Author": "Sam", "ReviewID": "R314M4LM8U5DBB", "Overall": "5.0", "Content": "Worked great to add a couple more cameras. Needed to but only ordered one so I grabbed a second as well.", "Date": "December 27, 2013"}, {"Title": "great price and product", "Author": "Amazon Customer", "ReviewID": "R41K8OPHLS4CQ", "Overall": "5.0", "Content": "Good price for dependable product.Didn't need the adapters this time but thankful they were included.good selection of items as well.", "Date": "December 10, 2013"}, {"Title": "I can watch you now", "Author": "C. Buswell \"tomyboy999\"", "ReviewID": "RS44YBX6TARF8", "Overall": "5.0", "Content": "I bought these cables to replace the damaged ones that I had. They are great. These were genuine Qsee cables.As others have said the connection can be a little loose, it didn't cause me any issues.", "Date": "December 5, 2013"}, {"Title": "Cable worked very well without problems.", "Author": "Gpujic", "ReviewID": "R1ZDC5DSBXPZ21", "Overall": "5.0", "Content": "In my personal experience the cable worked very well without problems. The length made it easy to customize my entire system (I installed this at a local academy school).", "Date": "October 30, 2013"}, {"Title": "Extending my Q-See security camera cable.", "Author": "Melvin E. clemmer", "ReviewID": "R2PQ160IW10PP5", "Overall": "5.0", "Content": "I needed to extend one of my Q-See security cameras. This did the job; no problems!I recommend this cable for Q-See security cables.", "Date": "August 29, 2013"}, {"Title": "good deal", "Author": "Dino F", "ReviewID": "R1HA6YB6XS104Q", "Overall": "5.0", "Content": "Great price, not the same brand as my camera system but completely compatible and much cheaper than the OEM supplier's price. No complaints.", "Date": "July 14, 2013"}, {"Title": "No worries", "Author": "Troy Allison", "ReviewID": "R38C1K1BND5SX6", "Overall": "5.0", "Content": "Cable came very quickly. It had all parts pictured, including the a/c adapter. Used it with existing Swann security cameras and it worked flawlessly, with great picture quality.", "Date": "May 2, 2013"}, {"Title": "Just what I needed", "Author": "RIPPEDHOG", "ReviewID": "R3VVD80U1X366X", "Overall": "5.0", "Content": "These are identical to the ones that come with the system from the factory. Plugged right into the existing wires. Shipped very quickly", "Date": "June 28, 2012"}, {"Title": "Well Built", "Author": "Jack Johnson \"Busy bee\"", "ReviewID": "R39EBG01A1Z3TP", "Overall": "5.0", "Content": "Q-See makes a good product.  I have been very happy with the cameras.  we recently moved and i had to re install everything.  One of my cables was damaged in the move.  this replacement cable came quickly and worked right out of the box.", "Date": "June 27, 2012"}, {"Title": "Dealing directly with Q-See is a TOTAL PITA!!!!", "Author": "William P. Arndt", "ReviewID": "R1D02ZE8WX14H5", "Overall": "3.0", "Content": "The product itself is OK enough, except that the insulation must be made of Soybean as the cables are constantly being chewed by squirrels. Once you spend the money for a Q-See security system, you're stuck wth replacing the cables. My old Radio Shack system was far superior, but didn't have the storage capacity. It's just another example of the \"better\" things get - the worse off I am in too many respects. The more they put on a car, the more there is to go wrong.", "Date": "May 11, 2012"}, {"Title": "Works great.", "Author": "Rich", "ReviewID": "R2SGTUFG43OXVG", "Overall": "5.0", "Content": "I bought a couple of these to extend the cables that came with my Q-See.  The package contains the F-F BNC connectors and M-F power adapter pictured, which makes installing this cable as an extension to an existing cable easy.  No issue with either of the cameras that are connected with this extension cable.", "Date": "May 7, 2012"}, {"Title": "If you need one buy this one", "Author": "Trinilime", "ReviewID": "R10XH5JO8RTWD7", "Overall": "5.0", "Content": "Delivered fast. Works great. Comes with the adapter so you don't have to buy it seperately. If I need more this is the one I will buy.", "Date": "December 23, 2011"}, {"Title": "Missing the A/C coupler", "Author": "Robert G. Green", "ReviewID": "R33D7EZMIX545D", "Overall": "4.0", "Content": "Really only needed the cable and the video connectors, so I didn't return it, but the the little black A/C connector that is pictured with the product and described as being included, was not.", "Date": "March 15, 2013"}, {"Title": "garbage quality", "Author": "electric mower guy", "ReviewID": "R17GTPLH5B70Q2", "Overall": "1.0", "Content": "My feedback: this cable (Q-See 50FT BNC Video & Power Cable with 2 Female Connectors) is a Cheap cr@p product. I wish I had spent 100% more on something else, I would have gotten a product that I can depend on.. This cable has crappy performance for security system cables. Sending my power supply down the cable next to the video cable caused all kinds of terrible video interference too so I have chosen to not use that part of the cable just the bnc video cable which has terrible loose and poor quality ends on it so getting a good connection is a PITA. The ends simply are more frustrating to keep properly connected than the money I spent on it. Buy at your own risk.the Lorex wireless security cameras I also bought work just fine as long as you do not get them wet then they leaked and fog up and now I am in warranty territory, put them under a rain cover and you are A-ok.", "Date": "July 10, 2012"}, {"Title": "50 ft cable", "Author": "kw klaver", "ReviewID": "R35WQVN1I7UH3G", "Overall": "1.0", "Content": "I ordered 3 of these and 1 of the 3 did not work and I was forced to purchase another cable to make the camera work.That means I  was only 66% satisfied with the product.", "Date": "October 12, 2012"}, {"Title": "It's a cable. It works for the most part", "Author": "myootnt", "ReviewID": "R2Z4OX3BW141TE", "Overall": "4.0", "Content": "They finally changed the way they wind the cables so they are not a nightmare to unwind. The BNC connectors are cheap and I've had issues with poor connections on a couple out of a couple dozen I've used. The clamshell packaging is a$$.", "Date": "June 12, 2010"}, {"Title": "BNC CAbles", "Author": "Tim R", "ReviewID": "R2F79R8NPK2N88", "Overall": "5.0", "Content": "I received it in a timely fashion. Thirteen more words were required so I put them here in this sentance.", "Date": "December 16, 2012"}, {"Title": "poor quality contol", "Author": "average joe", "ReviewID": "R1GYWX1JF8XN3A", "Overall": "2.0", "Content": "I ordered three of these Q-See cables because I have a Q-See system.  Two of the cables have connections at the BNC plug that are loose.  I start to loose the picture and I would have to go to the back of the controller and play with the connection to get a clear picture.  Poor QC.  PIA", "Date": "October 15, 2012"}, {"Title": "Pretty nice for the money...", "Author": "Daniel L. Shrider \"WonderDude\"", "ReviewID": "RVT6LPU2WNSB7", "Overall": "4.0", "Content": "The addapters were a little hard to insert into the other wires (not included in this kit).  But everytthing seems to be working fine.", "Date": "August 11, 2012"}], "ProductInfo": {"Price": "$15.99", "Features": "Q-SEE QS50B 50' BNC Male Cable", "Name": "Q-See 50FT BNC Video & Power Cable with 2 Female Connectors", "ImgURL": "http://ecx.images-amazon.com/images/I/41AiUuknweL._SY300_.jpg", "ProductID": "B001CIREDU"}}