{"Reviews": [{"Title": "Excellent Value", "Author": "Jason Bishop", "ReviewID": "R2P6D84L6GW74U", "Overall": "5.0", "Content": "Granted, this is the first video security camera I have owned, but I was very pleased with this purchase.  Our purpose for buying was to use it as a baby monitor.  The combination microphone, IR night vision, and full color (though the colors are a little off) visible light, and price ($25!) was a perfect combination for our purposes.  It provides a secure and interference free (not to mention cheap) option to the wireless systems.  A drawback in comparison to a traditional baby monitor is that it isn't as portable.I purchased a RF modulator in combination with this camera and back fed the video/audio into our home's coax lines so that the feed could be watched on some old NTSC televisions in the master bedroom and the family room. Belkin RF Modulator ( F8V3063 )Be sure that you purchase the AC adapter, this unit doesn't come with one. VideoSecu 12V DC 500MA Regulated CCTV Camera Power Supply AC to DC Power Adapter 1AR", "Date": "December 7, 2010"}, {"Title": "good enough", "Author": "Barry Morrison", "ReviewID": "R25B8PO07W1BSA", "Overall": "3.0", "Content": "The focus is tight (40 degree field of view, which is pretty standard for non wide angle units) and the two I received do have microphones. The night vision is ok with the built in illumination. But as has been said the plastic housing and base are flimsy and it is hard to lock them down with any sort of precision aiming. They will work fine for my needs.", "Date": "January 12, 2011"}, {"Title": "its okay", "Author": "t", "ReviewID": "R3TEAABAP9YJAF", "Overall": "3.0", "Content": "the camera doesnt show in color. but at least i can see it at night with no lights on. so thats a plus. the range is decent. i can see to my back fence line. which by the way is approximately 75 feet away from where camera is posted.", "Date": "April 9, 2012"}, {"Title": "Better at night than during the day", "Author": "HuoXingC \"Ninja MidgetChan\"", "ReviewID": "R185VJC1XRSFTV", "Overall": "3.0", "Content": "The colors look funny during the day, and the details aren't very clear (everything looks rather purple and you can't really see green). However, the details at night are very good. I can actually see the green from my tree, my neighbor's yellow car, and hints of other colors as if you're looking right outside the window. However, I would question the quality of this product. I ordered a total of six of these cameras, with one of them being defective. I would suggest getting this for a small boutique or a convenience store, where it's generally dim and limited to sun exposure. The sun exposure really messes with the clarity of this camera in terms of contrast.To give you some perspective, a burglar broke into my house wearing a dark colored hoodie. Based on these cameras, he was wearing pink/red.", "Date": "January 10, 2012"}, {"Title": "Home Surveillance IR806AS 1N3 Day Night IR Camera", "Author": "Clayton E. Lake", "ReviewID": "R39CT15H7N7OQX", "Overall": "5.0", "Content": "I purchased two of these cameras, and very happy with the initial tests.  They are worth the price having audio, color and IR.  The instructions are weak, but easy to figure out how to connect the cameras.  The audio mic is located in the black housing on the wiring, and not on the camera body.  Don't tape the mic up with too much tape when taking up excess wire.  The audio is actually pretty good.  I had a camera like this earlier and I had it located to close to an outside light with too much tape covering the mic to protect against the rain.  It caused a buzzing noise for the audio.  Took off some of the tape and reloacted the camera a couple feet from the outside light, and that solved the problem.After reading some of the reviews, it appears some are having trouble with color being too blue.  Is this because they are recording in the shadow and not direct sun light?  If so, you may try a Wratten 12 Yellow filter over your lens to see if this will reduce the excess blue.  I will try this soon, as a test.", "Date": "July 6, 2012"}, {"Title": "Own 4 cameras like this", "Author": "Portland Ghosts", "ReviewID": "RU9J7SPBK4NHQ", "Overall": "4.0", "Content": "I have 4 of this general type of IR camera for my paranormal investigations group in Portland, OR which I have connected to a DVR. With this model you get what you pay for. It works but the entire camera body is made of plastic. I paid over $80 for one of my cameras and it is made of all metal.This model also has an extremely flimsy base. If you are mounting it to a wall you may have good results but if using the base alone it's not very sturdy and feels like it would be very easy to strip the threads. The image it displays is also very bright and washed out a little compared to my other cameras. The IR isn't as crisp so if it's detail you are looking for this may not be the camera for you. You will be able to see a person on the camera and if they are relatively close you will be able to ID them but if they are a little ways off you will have a hard time identifying exactly who it is.The depth of field is also zoomed in pretty tight. If I point this camera and my more expensive camera at the same object, the other camera shows the object at a distance and a lot of the surrounding area. This camera will have almost the entire screen filled with the object being viewed.For the price it's a pretty good deal. I may get another one to connect stand-alone to my laptop for a 5th camera to record with.", "Date": "December 23, 2010"}, {"Title": "Great at first", "Author": "Ichelo", "ReviewID": "R28YXYV9M4U4SV", "Overall": "1.0", "Content": "Camera was great at first for what it is, but after a month and a half, its pretty much dead.  During the night it is really fuzzy, during the night its just rapidly cycling colored bars.  Meaning its completely worthless for what it needs to do.  I will be replacing it with another camera, and I would just recommend staying away.", "Date": "August 26, 2012"}, {"Title": "Excellent Value", "Author": "Amazon Addict", "ReviewID": "R3H12T2JO81M97", "Overall": "5.0", "Content": "I was looking for a basic camera to hook up to a monitor. The picture on this camera is not perfect, but it is pretty darn good. For the price, I give it 5 stars. The night vision works surprisingly well. You do need to mount this camera rather far away to get a good view of what's going on. I'd day you need to position the camera at minimum 30 feet away from whatever you are trying to watch. Don't forget to purchase the power adapter and whatever cables you need separately. I might buy a couple of more of these.", "Date": "May 11, 2011"}, {"Title": "No IR Cut filter", "Author": "LT Sharpe", "ReviewID": "R2SLOUJSAW2639", "Overall": "3.0", "Content": "During the day greens look purple.  Better cameras will eliminate infrared reception during the day to fix this.  Otherwise the camera has good IR illumination at night with good night vision and it seems to have a closer natural 'zoom' than other cheap cameras.  Very crisp for a 420vtl camera.", "Date": "October 6, 2012"}, {"Title": "This is an unsatisfactory product.", "Author": "stugacz \"stugacz\"", "ReviewID": "R2FY9GQB2AOYXA", "Overall": "1.0", "Content": "All things considered this was a decent product for one year.  Now, a year later this camera is completely dead. I purchased 4 of these cameras one year ago. Of the 4 cameras 3 died one year later in July 0f 2012. I do not know how much longer the 4th camera will continue to function. Do not purchase this product.When I reported this issue to the vendor this was their response:\"We offer 30 days return, replacement and 90 days repair warranty, since your item was purchased more than 30 days ago, so we are not able to do the return for you any more.Best regardsCustomer service\"", "Date": "August 3, 2012"}, {"Title": "Hmmm, for $30 you get what you pay for", "Author": "Mark", "ReviewID": "R3RZVVTPS76LPX", "Overall": "4.0", "Content": "Truthfully, I guess its worth $30 compared to other cameras that cost $100 - $300 etc. The picture clarity is adequate, and the nite vision works as advertised.  My major complaint is the color never really worked.  Like other reviews have said the mount isn't overly robust, but if you don't plan on constantly moving it and repositioning, it should be okay.  The housing is made of metal which is good, as was expecting something plastic.  Puchased a dome camera at the same time for about $10 more and am better pleased with that ones video performance.  I've added a picture for illustration.", "Date": "May 31, 2012"}, {"Title": "bright at night", "Author": "M. Day", "ReviewID": "RNK99UAFJW72P", "Overall": "5.0", "Content": "I am impressed with the brightness and distance the IR LEDs provide at night.  A great additional feature of this camera is the built-in microphone.  Important info which might be of importance to you is the video output connector of this camera are RCA instead of the typical BNC most surveillance cameras use.  Not a big deal if you need a BNC/RCA adapter as they are available here on Amazon for just over $1/ea with free shipping.  Daytime colors are way off but then I'm not planning on using this camera to take pictures which I will frame and hang on my walls so it's not an issue to me.", "Date": "March 4, 2012"}, {"Title": "lwdixon", "Author": "Larry W. Dixon", "ReviewID": "R2FDZ5YS3VP2ZG", "Overall": "4.0", "Content": "For the price it cannot be beat. Have more expensive cameras but this one has good picture and pretty good night vision.", "Date": "May 18, 2011"}, {"Title": "In general OK, but has some issues for me", "Author": "J. Beams \"JB\"", "ReviewID": "R2OMHHE0V7W9TP", "Overall": "3.0", "Content": "I decided to purchase one of these as I was expanding my network and my previous favorite camera was no longer on sale, plus the numerous good to positive reviews instilled some confidence.  Unfortunately I'm not as impressed as I had hoped I would be.  Here are my observations:1. It's nearly impossible to get the IR LEDs to turn off.  The CDS cell has some sort of lens on it that narrows its range, so the only way to get it to not be in \"night vision\" mode is to shine a light directly onto it.  Strange since none of my other cameras have this lens over the light sensor, and they're so cheap I don't know why they would bother to use a \"nonstandard\" CDS cell on this model.  If it bothers me enough I'll solder a normal one on the board instead.2. When it's truly dark and in night vision mode I get \"glitches\" of color, as if the signal is going bad.  None of my other cameras do this, and another camera using the same connections doesn't have this issue in this location, so it's definitely something the camera is doing.3. The housing (at least the front bezel) is plastic.  I was aware it would have a 6mm lens which was too narrow for me, so I also purchased a replacement 3.6mm lens to get a wider angle.  In removing the front bezel some of the tabs cracked.  All my other cameras have 100% metal housings, so I was kind of surprised to see this.4. In removing the bezel I noticed that the IR ring is kind of haphazardly soldered to the camera board.  Not the best solder job, but it does work.  Could be a source of my color glitches if the IR is temporarily turning off, but I haven't bothered to investigate it any more yet.5.  If your camera sounds like it had a bunch of loose parts in it when you shake it, that's a bag of silica gel in the back of the camera.  I happened to find this in mine.  I guess it's to keep the internal moisture level low.  No real harm in having it in there, just kind of strange in my opinion (as an electrical engineer).6.  The one I got does have the built-in microphone.  The microphone is at the far end of the cable though (closer to the connector than the camera).  This isn't convenient if you want to have the microphone exposed in the room but want to hide most of the cabling.  I wish it was either embedded in the camera housing, or at least closer to the camera on the cable.", "Date": "March 22, 2012"}, {"Title": "Worst night vision ever", "Author": "Chris", "ReviewID": "R2K1T8ZQBBJSDL", "Overall": "1.0", "Content": "This camera i bought is the worse camera i have ever bought. It worked perfectly for the first few weeks then after the first few weeks the night vision got worse and worse now where all it is is a gray screen at night time It might be only 25.00 but it is not worth the money dont buy this product spend some more cash and get a better product", "Date": "August 20, 2011"}, {"Title": "You get what you pay for!", "Author": "Fenton B Slaughter", "ReviewID": "RJEEW62M77WZD", "Overall": "3.0", "Content": "All in all though, not a bad item. The video quality is good, the color of the video is fair at best.The IR is ok too, but the color is a wash out at night. Also, there's no audio. Which is ok for me, I don't need that.During daylight hours, the video is quite good. So, if your needs aren't too drastic, I'd recommend this product.", "Date": "January 3, 2013"}, {"Title": "OK for the price but....", "Author": "Scott Sutton", "ReviewID": "R10X1QY9YDYAO5", "Overall": "3.0", "Content": "I ordered a total of five of these cameras. Two came with an audio Jack and phono RCA plugs the other three were only video and power with BNC connections. All ordered from the same seller? All stated \"Audio\" was part of the deal? I tested them all tonight and the video quality is ok I guess for night vision. I did not see anyway to adjust the levels feeding from the cameras. The LED's seem to be overly bright causing some video distortion.I guess what can I expect for less than $30. per right...", "Date": "March 20, 2012"}, {"Title": "Good Value", "Author": "Noisemaker", "ReviewID": "R3U1FP6KDNKF89", "Overall": "4.0", "Content": "I needed a basic camera to add to my security DVR system. It didn't need to be fancy, since it was just to give a view inside my garage. This camera's low price is what attracted me to ordering it and I am pleasantly surprised at the quality, all things considered. Setup was a breeze and the night vision illumination works very well to view my whole garage in pitch darkness.", "Date": "January 5, 2012"}, {"Title": "Good Quality not to big and bulky and a clear picture", "Author": "Brad", "ReviewID": "R31ZYP23OE8BJ7", "Overall": "5.0", "Content": "Well the CCTV IR Cam is great, price is set good, the IR LED's are just enough for a mid to large room and the camera was easy to mount.  I am still not sure about that adjustment piece, seams like it could break if it gets over tightened but if you don't tighten it enough it might not stay in position.....time will tell.", "Date": "January 3, 2012"}, {"Title": "Eye in the Sky", "Author": "E. Parsons", "ReviewID": "R1038M0DAP3FAQ", "Overall": "4.0", "Content": "Great for basic CCTV needs. This product is easy to install. The day-time color is great and clear. The b/w, IR, mode is kind of fuzzy. Worth the $25 dollars I bought it for. I would recommend this product", "Date": "October 26, 2011"}, {"Title": "Better Quality & Capability than Overpriced Baby Video Monitors!!!", "Author": "Texas Aggie", "ReviewID": "R3CCTRLEXQB85E", "Overall": "5.0", "Content": "We bought this Daytime/Night Camera in order to mount a Baby Monitor Camera that Also had Sound UP where our Twins could not reach it NOR reach the Safer DC 12 Volt Power Supply which is actually plugged in through 100 feet of cable in our Master Bedroom.  We just ran the cable from our TV RCA inupt along with the power supply, 12 Volts DC, 100 mA (6 watts of power) and it runs an entire 100 feet of cable, of course we didn't need the entire length but it's nice to have for later purposes for home security inside and out since it illuminates pitch black darkness into Very Bright Black & White IR Illuminator image.  Good enough to use for recording DVR for outdoor or indoor security purposes or even recording outside through a window.  It's very small, has a built-in sunshade, 30 IR Illuminators for night time illumination, Easy to use mounting and adjusting too!  You can get 50, 100 & 150 feet cables for this camera and the cables, power supply and camera all cost under $40 with free shipping.  We use this for a baby monitor for Twin 2-year olds hooked up to our TV in our Master Bedroom where a Brand Name Video & Audio Monitor with a small 1.5 inch screen costs $130 and HIGHER!  Why buy a A/C outlet plugin Baby Video Monitor that plugs into plugs that are within REACH of your KIDS??  A/C Electricity can kill a grown human, do you want to take a chance for your child to un-plug that power supply partway and then touch those Contacts and then have their hear stop from being electricuted???  Unless you install a 110 Volt A/C Plug Near the Ceiling to plug in your Fisher Price Camera/Audio Transmitter.  Save the money, and keep your kid alive!  Great for catching criminals/watching your driveway/backyard/frontyard without even turning on the lights.  Gain evidence and get the cops on the way before turning on your lights!  Awesome Bargain!", "Date": "April 4, 2011"}, {"Title": "Amazing camera for the price!", "Author": "lucky dice \"k\"", "ReviewID": "R1DACM348Y52CT", "Overall": "5.0", "Content": "I bought this camera to replace an outdoor existing camera that gave out.  The camera I am replacing was made of flimsy plastic including the mounting plate.  I guess that is why it did not last very long.  Immediately I notice this camera was much more sturdier made of metal espcially the mounting plate.  I also like the way it look, very compact and solid.  When I mounted the camera I was taken back immediately how sharp the picture was compared the the old one.  I was not sure when I first connected the camera how well it would perform at night since it was in the afternoon.  But when it got dark that's when the quality of this camera really shines.  I could not belive how clear and defined the piture was.  For the price I don't think you can find a better performing surviellance camera.  I immediately order another one to replace the other camera I have which is as flimsy as the one that broke.  With this camera you can actually make out who the person is at night with detail.", "Date": "December 13, 2011"}, {"Title": "This is a great product, thank you very much.", "Author": "Rolando Gomez Rep. Dom.", "ReviewID": "R1RPBAVCV1WNPN", "Overall": "5.0", "Content": "Thank you for my item, is very good product, nice and strong, for autdoor and indoor, image is good and leds has a good performance for night vision for 30 feet or more. Price is so good vs. quality.", "Date": "May 15, 2014"}, {"Title": "Not all that it's cracked up to be.", "Author": "tlong927", "ReviewID": "R36OXN95KSZVIV", "Overall": "3.0", "Content": "Ehh. For the price it is a great camera. Quality isn't much better than my cheapo Zmodo cameras. But the high amount of LEDs make a for a great Night Visions shot.", "Date": "May 7, 2014"}, {"Title": "A+", "Author": "ALAN DUCHARME", "ReviewID": "R331PD2JJ84SSB", "Overall": "5.0", "Content": "the nite vision work well, and i like the color of the camera is nice.  also the focus is very clear", "Date": "May 3, 2014"}, {"Title": "night vieuw is bad!", "Author": "Luc V.", "ReviewID": "R6UTPVDCMYFH", "Overall": "2.0", "Content": "Day light vieuw and colour selection are great, Small vieuwing angle. Very poor night vieuw. Would not recommend this camera.", "Date": "April 1, 2014"}, {"Title": "Great Camera & System", "Author": "Ronald Freeman", "ReviewID": "RQNG63S6F9NN9", "Overall": "5.0", "Content": "It accomplished my needs just as advertised. I would recommend it to all. It was at a reasonable price and well designed. It solved my problem.", "Date": "March 12, 2014"}, {"Title": "Really good deal", "Author": "Real Buyer", "ReviewID": "R2FP6GTOD1CMFC", "Overall": "4.0", "Content": "Got this to replace older one and it much easier to install and connect. Good price with acceptable appearance. Almost the same cost with a dummy one.", "Date": "March 8, 2014"}, {"Title": "Good camera", "Author": "Pedro Prado", "ReviewID": "R3K8VPR9CQL6VA", "Overall": "4.0", "Content": "Works well in the RV for a back up camera but will have to get a new monitor because the original one is analog and the camera digital, therefore, not compatible.", "Date": "February 7, 2014"}, {"Title": "Good picture and cheap", "Author": "Expecting What I Pay For", "ReviewID": "R2KH3T2567KP5L", "Overall": "5.0", "Content": "It won't connect to a computer monitor or a computer, but the image is surprisingly clear.  I use it to see outside my door that has no window.  The night vision is pretty crisp, too.  I'm really surprised at the quality for the low price.", "Date": "January 23, 2014"}, {"Title": "Plug and play", "Author": "J. Cagnassola", "ReviewID": "R27H68AI0QPZXZ", "Overall": "4.0", "Content": "Needed an upgrade to my stock cameras, hooked up to existing wires, picture is good, Im sure there is better, but I am satisfied with the price and quality and picture. if you compare to my stock camera these cameras are good quality. would buy more if needed.", "Date": "December 27, 2013"}, {"Title": "the mounting assembly is below substandard", "Author": "Norman Cutter \"alyosha10\"", "ReviewID": "R1V83Z5P4OD37R", "Overall": "1.0", "Content": "instead of two mounting screws,..they combined the mounting screw with the adjustment thumb screw,..this CHEAP arrangement makes it super difficult to adjust the aim of the camera, especially if you're up on a ladder. It wouldn't even swivel up to where I wanted to point it, so I had to take a hack saw to the cowling to make room for the thumb screw to rotate! I mounted 5 QSEE cams in the same time it took me to mount this one piece of junk.NOT RECOMMENDED.edit: a week later: OMG, this cam has the worst resolution picture,..my other cams are great in my business, just this one awful picture on my screen from this POS. My car is parked in front of it right now, at nite,..I can only make out the outline of the car,.can't tell if it's a Honda or a HumVee. Will swap out this junk in the morning.", "Date": "November 27, 2013"}, {"Title": "Cannot beat the price - decent quality", "Author": "CK", "ReviewID": "RQ9GFG1XZORHO", "Overall": "4.0", "Content": "I bought 3 of these cameras to replace older sony 6 mm 480 TVL with 48 IR.  First off, the installation was a snap.  Just disconnected old cameras BNC and power cables and plugged these cameras into same.  The daytime viewing quality is excellent, with only slightly \"washed out\" colors that is typical of most IR cameras.  Daytime picture is very clear and crisp.  The reason I went with 4 vs 5 stars was due to night vision quality.  It's a little grainy/fuzzy under 0 light/pitch black conditions, but drastically improves if there is even a small amount of light say from the moon.  Overall this camera is a bargain at under $30 - we'll see how they last through the colder months and how long the IRs last.", "Date": "September 22, 2013"}, {"Title": "excellent", "Author": "kevin", "ReviewID": "R1R6D4F8RJFMOF", "Overall": "5.0", "Content": "great cameras i can see up to about 50 meters with them and about half of that at night time", "Date": "September 3, 2013"}, {"Title": "Not the Connection Indicated", "Author": "Wilson A W", "ReviewID": "R202JAUXW6HSSO", "Overall": "2.0", "Content": "I don't know if this works or not. Despite the description, it came with  the wrong connection, NOT the BNC described. An e-mail to the Mfg. resulted in a broken-English response to get an adapter.", "Date": "July 8, 2013"}, {"Title": "big upgrade to my 420tvl", "Author": "Peter", "ReviewID": "R3U4D507DJIBOA", "Overall": "4.0", "Content": "it works just fine, great color and image quality, however its the first camera to switch to blk and white. night vision is awesome in comparison to my standard 420tvl's. this can see much further in pitch black conditions.", "Date": "June 17, 2013"}, {"Title": "Good", "Author": "Roberto Peralta Francisco", "ReviewID": "R32KZ6DXEVDIED", "Overall": "4.0", "Content": "I like this cameras i' ve have them for a while now, nevertheless it was a little disappointment with the way the package was delivered, it was all smash problably from handeling and traveling cuz i know it cames overseas the front glass of one camera was a little cracket but i try and was working perfect, i guess it has to do with the people that handles the travel cuz it was well wraped otherwise i recommend this product it has fit my needs", "Date": "June 13, 2013"}, {"Title": "Better than average, but not what I wanted", "Author": "John Barbagallo", "ReviewID": "R30K1IP9KFBOKB", "Overall": "3.0", "Content": "The day time color is much better than the zmodo cameras that came with my system.  I was hoping for better night vision performance compared to the 11-led zmodo cameras, and while it's better, it's not good enough.  Also, at night the camera keeps fuzzing out every few seconds then pops back to normal.  Not sure what's going on there.  I won't buy another one of these cameras. I will probably keep it unless it fails completely, but my search will continue for a better camera at a low price!", "Date": "May 16, 2013"}, {"Title": "Decent night vision, daytime everything is green'ish", "Author": "Madashell", "ReviewID": "R1H7P4C5M3SXEK", "Overall": "3.0", "Content": "Got 2 of these to add to our system, works real good in our shop building at night with just a few little 5 watt night lights on in the bays. During the day, everything is green! both cameras, tried on 2 different monitors and DVR's and same results. Nice cameras, but not worth the amount asking.The mount is finicky and hard to keep tightened up. Not nice when you have to keep a ladder around to readjust after any wind. Best thing I can say about them is good night vision, they do see 50 feet in almost total darkness.", "Date": "April 11, 2013"}, {"Title": "VideoSecu Night Vision CCTV IR Home Video Security Camera Weatherproof", "Author": "Steve", "ReviewID": "R2AEDOW1DYZH15", "Overall": "2.0", "Content": "I am very disappointed in this camera. I purchased it no more than a month ago. It has failed completely. I have trouble shot the lines and removed the camera to bench test it inside. There is no video from it at all. While it worked it was okay. This kind of premature failure is unacceptable in my opinion.", "Date": "April 4, 2013"}, {"Title": "Liked it so much I bought more", "Author": "Psoup \"Psoup\"", "ReviewID": "R3FCMXASIQ3JFV", "Overall": "5.0", "Content": "I purchased a Q-S.. 8 Chanel DVR as a replacement for a same brand DVR that was bricked due to bad firmware upgrade. The first DVR cameras were great. However, the second ones were so grainy at night that I constantly got alarms for the motion detection... made the whole thing useless.  After we were robbed and it was not caught on camera I decided to try some new cameras.  The manufacture tried to sell me some very expensive ones... no way was I paying over double for the cameras than what I paid for the whole machine and 4 cameras to start with.  I decided to give these a try.  I bought 4 of them and immediately my DVR came to life. No more false alarms.  I am able to see a great distance at night as well as during the day.  With that being said, I bought 3 more.  These are great... especially for the price... do not let that nor the review that says they are crap because the housing is plastic... so what.  Plastic has advantages. The only complaint that I have is the mounting... they do not secure really well with the thumb screw and the cable does not run inside of the mount like my old ones... but no real deal... I am looking for video quality... especially at night which these deliver 110%.  I really do not think anyone will be disappointed especially at this price (or even double this price).", "Date": "April 1, 2013"}, {"Title": "Blurry video", "Author": "Aris Abeleda", "ReviewID": "R28RSUF31EJRFQ", "Overall": "2.0", "Content": "It's cheap but not worth it.  I have five other video cameras, and I just had to settle with using this on the least critical area for security surveillance.  It works but not as crisp as the more expensive model from the same company.", "Date": "February 24, 2013"}, {"Title": "VideoSecu Day Night Vision", "Author": "Charles W. McLamara", "ReviewID": "R2TGW62S1UY133", "Overall": "5.0", "Content": "I have never had other than good things to say about the camera.It's all easy hook ups and it has real good day and night vision close up and distance.Thank You", "Date": "February 15, 2013"}, {"Title": "Video only but perfect for that purpose", "Author": "Legend \"Legend Eleuthera\"", "ReviewID": "R2UGD9D85493RR", "Overall": "5.0", "Content": "Often sound on security systems is not needed and would be unattached anyway. This does a marvellous job day and night.", "Date": "February 13, 2013"}, {"Title": "a+++++", "Author": "gary jeffcoat", "ReviewID": "RTGGEPBC96JD", "Overall": "5.0", "Content": "Nice camera for any video system. Night vision works well as daytime imaging. well built camera just sitting on the post watching everybody", "Date": "February 8, 2013"}, {"Title": "Simply amazing, and a great price", "Author": "Josh Leger", "ReviewID": "R25TPUOV9TASO9", "Overall": "5.0", "Content": "This camera is just simply amazing. It records in black and white nght-vision via infrared, but it also has a light sensor, so the camea will blend and switch between night-vision and regular. Making it great for areas where lights are changing on and off. The mount is amazing as well and offers a large variety of mounting angles. I used this as a webcam for my computer once I purchased the right cable with an RCA adapter that came with it. Make sure you read the description before you buy. When I bought this camera it didn't come with a cable or a power adapter. But purchasing seperately is very inexpensive anyways.", "Date": "January 4, 2013"}, {"Title": "Replacement camera", "Author": "John R. Lefebvre", "ReviewID": "R16ZIWPK4NHUA8", "Overall": "5.0", "Content": "Purchased this camera for 1 that went bad. Camera works great. The night vision is clear for a 420tvl; and, the day is clear as well. Most of all AWSOME PRICE and fast two day shipping.", "Date": "December 25, 2012"}, {"Title": "dont expect much from these cameras", "Author": "David Duncombe", "ReviewID": "R39A5X60CRJDAV", "Overall": "2.0", "Content": "Dont expect much from these cameras. The color is off. when the ir worked it was washed out looking and the ir bulbs only lasted 3 months.", "Date": "October 23, 2012"}, {"Title": "best for the money", "Author": "reana", "ReviewID": "RQE0WZ6XZ443M", "Overall": "5.0", "Content": "camera is very easy to setup ,, great daylight picture and will zoom if your tv has zoom feature,, night time very impressive lights down my driveway bright enough to see for almost 200 ft,, will order more of these", "Date": "July 31, 2012"}, {"Title": "camera", "Author": "colorado angry", "ReviewID": "R1MTHJU8PJ1OM5", "Overall": "4.0", "Content": "well i must admit these little cams work great  the size of the view is a little small due to looking like its zoomed in but hey if you put it where you look far its great works good at night accept the image is a little blurred  you should probably have a light source in your area for brighter view and recording on dvr", "Date": "July 13, 2012"}, {"Title": "VideoSecu Day Night IR Audio Security Camera", "Author": "wildroses", "ReviewID": "R3BSGKUI2J695M", "Overall": "4.0", "Content": "VideoSecu Day Night IR Audio Security Camera did not have the color quality i was hoping to recieve but other wise it was well worth the purchase. In the day time hours my lawn  looks like it is displayed in black and white and my gravel driveway is displayed as a light green. my purple shirt pickes up as blue so if colors are important, it's great for identifying people you know that come to visit before they get to the door", "Date": "June 28, 2012"}, {"Title": "OUTSTANDING", "Author": "Janet Lyons", "ReviewID": "R3HEQVEDZMESDZ", "Overall": "5.0", "Content": "This is my 2nd camera. It's outstanding for indoor use. I would not use out side unless it was under some type of cover. It has great night time picture. It's like day light or as if someone had left a light on. I am able to watch and record my pups at night when I am not home and at work. I think this would make a great baby cam. Just use your TV or VCR and watch your baby from your room.", "Date": "November 3, 2011"}, {"Title": "Excellent", "Author": "Iliana M. Gonzalez \"Afrodita\"", "ReviewID": "R1XZ2LONZ16RJS", "Overall": "5.0", "Content": "I just bought this surveillance camera for my back yard and the resolution couldnt be better, it is superb. I received the package in very good condition. I highly recommend this product. Thanks, and Enjoy!!", "Date": "August 29, 2011"}, {"Title": "good for the money", "Author": "Name Here", "ReviewID": "R37EKARXL8YDA4", "Overall": "4.0", "Content": "I've had this camera for a month and it does the job we intended it for.  It's a little light in construction, but hey, use a little care in setting it up and don't over torque the screws and it will be fine.I've got it tuned into one of the inputs on my Bravia tv so we can check if we hear a noise in our backyard.  It does fine.", "Date": "August 5, 2011"}, {"Title": "Nice", "Author": "Gunny", "ReviewID": "R8Y9OURJK62NO", "Overall": "4.0", "Content": "Pretty nice little device.  Very easy to hook up, and night vision was impressive.  I have not hooked up to any DVR, but for monitoring it works great.It is an Indoor camera I believe tho, it doesn't look like it would hold up to any type of weather.  And if you try to point out a window, the in-fared lights will reflect off the window, displaying whats behind the camera.Mic works good.  Would be excellent baby monitor, I use it to monitor my dogs when they go into the other room.  I raise pitbulls, and like to know what there doing when they leave the room; works for that.", "Date": "May 22, 2011"}, {"Title": "Great for pitch black, even at 60'!  Not good for road cam...", "Author": "PaulsLaw", "ReviewID": "RD01XY9I7ADEZ", "Overall": "5.0", "Content": "I purchased this cam, as they are 1/2 the cost of Zmodo's w 3x the leds.  Figured why not.  I put it out on one of the road cams... bad idea, it had great picture day & night, but 1/2 the cars headlights would make the dusk/dawn sensor turn on and off very rapidly, this making for poor focus right when the car passed.  There is no time delay that prevents this....The great news!  I removed this cam from the road after 4 days to the wood line.  I know the cabin is 60' from this cam, before you could not see anything until the motion floods kicked in.  This camera shows it all Very Bright and Very Sharp!  Plus, when the flood lights come on, the camera is a split second faster at adjusting, a problem for the road cam, but perfect for what before was honestly pitch black on a 12led Zmodo.  At night, out of 16cams, this is the best.So it's been a few weeks and I approve, for the cost, it's a worthy upgrade to your bullet cams.", "Date": "November 14, 2012"}, {"Title": "Camera they are shipping does not have audio", "Author": "S. Pinto", "ReviewID": "R2S89GRQFH7I7Y", "Overall": "3.0", "Content": "This camera is adequate for the price which is very reasonable.  Performance inside a pitch dark garage where I have it installed is great even though it is lower resolution.  One thing...it is advertised as having audio, but it does not.  There is no connection cable for audio coming from the camera.  Only video and power at least on the one I received.", "Date": "January 24, 2012"}, {"Title": "Excellent Camera at a great price!", "Author": "JRD", "ReviewID": "R3H0M9I6UPVU2I", "Overall": "5.0", "Content": "To start the camera I got is black, metal body housing, mount and sun shade. This is my third camera from this company. The other two cameras I ordered were wide view day/night cameras, worth every penny. I have not hooked up this camera yet, so I cannot state how well it works at night, but if it's anything like the other two cameras I installed from this company, I expect great results. I will update when installed. I gave it five stars already because I like the build quality, and will adjust the rating once installed.12-30-2011Installed camera and the night vision is what I expected...great! Yes, it is in black and white at night, color during the daylight hours. At night I can make out every detail in total darkness for a length of about 30 feet and shows 1/3 more on the screen then the camera it replaced. Best money I ever spent on a camera, keeping the rating at five stars.", "Date": "December 8, 2011"}, {"Title": "Poor quality video but low cost", "Author": "Tech-Guru", "ReviewID": "R1G18OKBGJK9I0", "Overall": "2.0", "Content": "I would give this camera 1 star BUT because of the low, low price I gave it 2 stars (you do get what you pay for). I found the image quality grainey and there were horizontal waves that went through the image. There were no instructions and the mount was of average to \"slightly below average\" quality (I'm not sure how it would stand up being used outdoors).", "Date": "August 3, 2011"}, {"Title": "night vision", "Author": "kjkj", "ReviewID": "R330I45UHJVG94", "Overall": "3.0", "Content": "the night vision is poor quality, but i guess if your  lookin for a cheap camera you get what your money payed  for. the only thing you can make out in the dark on this camera are things that are white.I guess its the  resolution", "Date": "May 8, 2011"}, {"Title": "junk", "Author": "bigbeast", "ReviewID": "R12JQ3E9TG3XH7", "Overall": "1.0", "Content": "this camera is junk, and after only 5 months of use, only 8 of the IR led work, when it is dark, the monitor now flashes light and dark like a strobe light, spend the extra @20 and get a quality camera, and this item has NO WARRANTY, my bad, i will never buy from this company again, what a piece of junk, not to mention it was not the color that was pictured, and another fun fact THE MICROPHONE IS WIRED TO BE ON THE INSIDE OF THE HOUSE, AND THERE IS NO WAY TO AVOID THAT, IT IS AT THE END WHERE THE RCA'S PLUG IN TO THE MONITOR, WHAT THE HECK WOULD I WANT TO RECORD ME TALKING WHILE I WATCH THE FRONT DOOR......", "Date": "September 21, 2012"}, {"Title": "what a waste of money.", "Author": "aombigd", "ReviewID": "R1NDRHCTA7DPS4", "Overall": "1.0", "Content": "if you need more info, please read the title. I have had it for 5 months and the picture went from normal to black & white and lime green. Enough said.....", "Date": "May 13, 2012"}, {"Title": "You get what you pay for", "Author": "AC500Driver", "ReviewID": "R2I2JCDFCYVLLI", "Overall": "2.0", "Content": "For areas with normal lighting this camera is useless as details are washed out. For use in the dark, the best result is a murky image. Many reviewers give the mounting stand poor marks. Yes, it's cheaply constructed, but more than adequate for this camera; assuming you could find a use for it. I'd return it, but it's not worth the time, expense, and, hassle.", "Date": "June 22, 2011"}, {"Title": "says two but only received one", "Author": "michael", "ReviewID": "R16B42VVSR3XFP", "Overall": "2.0", "Content": "I thought this was a steal as I waould get two for the price of one  worng  just came with one and not what was pictured", "Date": "October 19, 2013"}, {"Title": "GOOD", "Author": "JACK", "ReviewID": "R37Z21T2KY0T8G", "Overall": "5.0", "Content": "SAME QUAL AS TIGER DIRERCT , THE STORE W/ COMP CAMERA LOCAL FOR ME. . . . . .", "Date": "April 15, 2013"}, {"Title": "It is a cheap camera.", "Author": "Robert", "ReviewID": "RB444FUQH8YOC", "Overall": "2.0", "Content": "The item was delivered on time. I had some problem with installation. The screw that was supposed to mate the stem of the camera with the body of the camera was too short to mate. I used the part of the old camera to overcome this difficulty. Connecting cables with my security system gave no problem. However, pictures generated by this camera is hardly acceptable. My green lawn looks brown and neighbor's green oak tree looks pink. Besides, the vision is narrower than the camera it replaced. Other reviewers have mentioned that it is not a true outdoor camera. So, I am waiting for it die and then replace with a better one.", "Date": "December 25, 2012"}, {"Title": "I must have got a defect(hopefully)", "Author": "Willis", "ReviewID": "R32XIPJSOHF94K", "Overall": "1.0", "Content": "I bought this camera because I wanted to get a little closer & see folks walking on the sidewalk in front of the house. The field of view is closer like I wanted but this camera turned my pine shrubs instantly from green to purple. Just by installing this camera! Have u ever seen a purple pine tree? So maybe its defective as the greens & the blues are inverted. To make matters worse I have to painstakenly reverse feed all 3 wires back through the tiny hole I have drilled. Its just a real hassle to pay return shipping on a crappy item thats working perfect for everyone else. I guess spotty manufacturing quality will do that!", "Date": "April 9, 2012"}, {"Title": "It's a security camera....", "Author": "customer101", "ReviewID": "R3BHJIMEI616BU", "Overall": "3.0", "Content": "That's about it. Nothing special really. Feels cheaply made, but for the price, it's almost expected to be that way. I didn't try this outside yet, probably never will. If you can afford it, get a better security cam.", "Date": "February 9, 2012"}, {"Title": "Camera works well- Mounting bracket is made of plastic.", "Author": "REP 44 \"REP44\"", "ReviewID": "R2FLBH2JVIBSWV", "Overall": "4.0", "Content": "Camera was delivered quickly and seems to function as advertised.  The lens is 3.6 mm which is a wider view (about 90 degrees)  than most similar camera offerings which have a 6.0mm lens which is a narrower view.Both day color pictures and night IF black and white pictures are acceptable for a video security system. Great camera for the $39.99 price but is priced about right for the product offered.", "Date": "April 5, 2011"}, {"Title": "Bad Product", "Author": "nate", "ReviewID": "R385F9PTZFDPLH", "Overall": "1.0", "Content": "These cameras have decent quality however they have a plastic housing. Unlike others here mine have a solid metal mounting plate, this is best part. The seller is dramatically over charging for shipping as 2 day air was $111, my friend who works at fedex said he actually paid less than $48. I would not buy these, find different ones.", "Date": "November 2, 2011"}, {"Title": "Perfect Camera", "Author": "Eduardo L. Rincon \"Happy buyer\"", "ReviewID": "R3ORPNCNP0SSY0", "Overall": "5.0", "Content": "I loved this camera I used in my private apartment for security check in , out in my apartment, i Recomended,is not  spencil, easy to use and good item.", "Date": "March 31, 2011"}, {"Title": "Keep away from this camera unless it is for indoor use in small room", "Author": "hitesh patel", "ReviewID": "R3RCXN149E1E5H", "Overall": "1.0", "Content": "Camera is listed for outdoors but the microphone is in the cable, outdoor use will destroy the mic in rain etc.Despite the stated 36 LEDs, the view area is only 30ft with point of focus less then 10 feet. Color balance is wrong and can not adjust, trees look blue on monitor instead of green in broad sunny day, my other camera is showing correct colors. I wanted to replace the camera to add audio.", "Date": "May 15, 2012"}, {"Title": "You get what you pay for", "Author": "Fish for Life", "ReviewID": "R2U9JE7DI9BEXB", "Overall": "2.0", "Content": "This is a poor quality camera made of plastic. The lens has a very small viewing angle. I guess you get what you pay for (still, my old, cheap security camera does a better job). The image seems to be out of focus. I would not recommend this product and I sent it back already. I only give two stars because the price seemed right ( now-seems too expensive).", "Date": "March 23, 2012"}, {"Title": "cheepness is not everything. Quolity is!", "Author": "Hubert  P.", "ReviewID": "RQL87SWEJI11V", "Overall": "1.0", "Content": "The finding of these inexpensive camera was a dream come through.  After installing them ,problems after problems with color ,infrared and one of them is not showing what a wast of my money!!.", "Date": "September 9, 2012"}, {"Title": "520 tvl ir  camera", "Author": "Mario Nickner", "ReviewID": "R1P2XFVNFVBKGL", "Overall": "1.0", "Content": "This unit dont have quality control  i don't return because to much trouble  it cheap to scrap  it good one each tree buy onlyi dont B001IB0X8Y", "Date": "October 28, 2013"}, {"Title": "Eh", "Author": "Bob \"Bob.\"", "ReviewID": "R2GYLZW197RV0W", "Overall": "3.0", "Content": "came fast in the mail. the base is plastic, the camera is cheap plastic broke while hanging it. the color comes in purple during the day and if there are items that reflect light like a stop sign, night vision gets blurred out and will look fuzzy at night time... other than that, take the camera out of it mech and design another way to use or hide it", "Date": "December 2, 2012"}, {"Title": "don't buy this camera", "Author": "Felix R.", "ReviewID": "R2C9JXCBWRP1P7", "Overall": "1.0", "Content": "The picture is poor at night time you can't see nothing, and t he colors is  bad.I don't like at all. I wish never got this camera.", "Date": "June 23, 2013"}, {"Title": "this pad", "Author": "MAF", "ReviewID": "RH4KD47NMRQNV", "Overall": "2.0", "Content": "The product is good which is not in conformity with the specifications and you my sincere thanks ... .... ...", "Date": "January 11, 2013"}], "ProductInfo": {"Price": "$125.00", "Features": "Affordable day night vision video security camera. NTSC signal system\nBuilt-in light sensor controls IR activation. 36 IR illuminators for night vision.\nMetal body housing, mount and sun shade. Aluminum housing for indoor outdoor application.\n520 TVL. 6mm Lens. Built-in Mechanical IR-Cut Filter Switch\nPower require 12V DC 500mA or above (sold separately); bonus warning Decal 3\"x2\" included", "Name": "VideoSecu Home Video CCTV Surveillance Security Camera Outdoor Weatherproof Day Night Vision 520TVL High Resolution with IR Cut Filter Switch 36 Infrared LEDs Bonus Bracket for DVR Surveillance System IR807B C1Y", "ImgURL": "http://ecx.images-amazon.com/images/I/41iUpyaUobL._SY300_.jpg", "ProductID": "B001IB0X8Y"}}