{"Reviews": [{"Title": "Good microphone for security use", "Author": "James C. Kelley", "ReviewID": "R2IB3XWX2PGM6X", "Overall": "5.0", "Content": "I use this microphone with other professional mics for bird and wildlife audio as well as general security. Please note - LOUDNESS is determined by the gain (think volume control) of the security unit circuits - not just this microphone. More about that below if you wish to read on. For now I will say that this mic, being \"powered\", has a low noise level and a high sensitivity in a 60 degree cone to the the general direction it is pointing. It is very transparent but does not have (or need) outstanding fidelity. It has AGC (automatic gain control) to even out the loud and soft sounds and that is a good feature. It is ideal for security uses and the price is right! Is it loud enough to capture the elusive noise you WANT to record with your security DVR? It depends on you DVR audio circuits and how quiet of a noise you EXPECT to record. You will just have to try it but I suspect that most \"powered\" security mics will record at about the same loudness. In a nutshell, this one seems to be a very good value.Details - - - My microphones all go through an audio mixer before patching into the security DVR or other recorder. Yes, I have meters to monitor and adjust loudness too. Also, I listen with headphones to avoid any chance of feedback loops. If I want any mic to be louder (more sensitive to faint sounds in the lingo of an audio engineer) I turn up the mixer's gain. In theory the more you amplify a microphone signal the fainter and more distant the sound you can hear - but there are always limits in the real world, huh?Turn any mic way, way up and you may hear the rumble from your home's fridge motor, furnace, AC, cars on distant roads, etc (a general low frequency rumble). Also, the more you turn it up the more \"line noise\" you hear. Line noise sounds like static and can become so loud that it drowns out the distant noise you want to hear. WARNING: Opening a door or speaking anywhere near the mic with the volume cranked up will blow the headphones right off your head and probably ruin your hearing too. Please note that most security DVR systems do NOT have an audio gain control or volume knob. Audio gain in a security system might be useful to folks who complain that a certain mic only recorded things a few feet away!They do make expensive, professional microphones for videographers and film makers that are very sensitive to distant, quiet noises while keeping background static and noise to a minimum (think about recording roaring lions from 500 yards). Some use a parabolic collector (like a satellite dish) and some called shotgun mics are long, skinny things that listen to a very narrow tunnel of sound much like binoculars or a zoom lens that looks far away - but at a very small area. Search Amazon for \"parabolic microphone\" to see such toy and professional microphones.Back to this security mic. Actually this \"powered, active electronics\" mic has less noise and is better for security recording than some professional microphone costing hundreds of dollars. You see, security mics have high gain, low noise and AGC. For any audio geeks out there, this mic is much quieter with MORE gain than any dynamic mic - but with less dynamic range. I would have to use a phantom powered or active electronics professional mic to get as much sheer gain with as low a noise floor as this cheap security mic!In conclusion, for it's intended use this microphone is very good - all that you need. But, can you record a grasshopper burp in the next block? Nope! Once again, your mileage (and mic sensitivity) will vary depending on the security DVR you hook it to but I suspect that most security mics will record at about the same \"loudness\". Try this one and see if it doesn't fill the bill for recording sound around the area your camera covers.", "Date": "June 15, 2010"}, {"Title": "Recommended product", "Author": "Randolph R", "ReviewID": "RGHA9CN4E9NZU", "Overall": "5.0", "Content": "This microphone is my first and I am very happy with the the way it works, the size is good for concealment.", "Date": "July 23, 2010"}, {"Title": "Mic for the price", "Author": "Ti Joe", "ReviewID": "R1HP7AW2WM6Q0O", "Overall": "4.0", "Content": "The procduct is what it was adverised to be and works very well, a great price and great product.", "Date": "May 10, 2010"}, {"Title": "Just what we expected", "Author": "T. Voss", "ReviewID": "R3NHD9BZN6FXLD", "Overall": "5.0", "Content": "We hooked the audio up to the security system we bought for our home.  It works as others said it would. Picks up sound well.", "Date": "September 3, 2010"}, {"Title": "Good microphone for security use", "Author": "shell#2", "ReviewID": "R3KZM7POSWSQ27", "Overall": "5.0", "Content": "This microphone is my first and I am very happy with the the way it works, the size is good for concealment. and i would like to thankamazon for what they have for god customer services.", "Date": "September 20, 2010"}, {"Title": "Works but can be fragile", "Author": "mnoon", "ReviewID": "RIACLQGIGS1Q9", "Overall": "4.0", "Content": "This item worked as expected, but when I put a tie wrap on sensitive microphone part, it somehow caused a short.  Be wary of placing a tie wrap on the end of this microphone as it can cause the item to become defective.", "Date": "September 23, 2010"}, {"Title": "Exactly what I had been looking for", "Author": "Jesse Ratliff", "ReviewID": "R1KY708ZZD3RDD", "Overall": "5.0", "Content": "I have been using video surveillance for about 3 years now and love it. Recently I decided I wanted to increase my surveillance powers by adding audio surveillance to the mix. I searched with the company which I purchased the DVR card (using a pc as a dvr). The audio mic kit offered there was in the range of $90.I decided to search Amazon to see if maybe someone had a used one I could pick up cheaper. What I found was this wonderful brand new, 1/3 of the price audio mic kit. The product works great. Excellent pick up coverage, clear and clean audio to the DVR. Recommend this to anyone who needs a BNC or RCA composite input mic kit!!", "Date": "January 19, 2010"}, {"Title": "The right mic for surveillance", "Author": "Robert A. Staton", "ReviewID": "R2ID97X231SLSD", "Overall": "4.0", "Content": "This mic is the perfect companion for video surveillance systems.  The auto level control ensures that every sound is picked up.  It's also very slender, making it easy to hide.Note that it will pick up wind noise, as any mic would.  But you can use a foam cover to prevent that, or just place it where there is not likely to be wind.", "Date": "March 26, 2010"}, {"Title": "Impressive sound quality", "Author": "W. McLearen", "ReviewID": "R1PTXDQ6Z2X7QX", "Overall": "5.0", "Content": "I'm impressed with the quality of this mike.  I can't say that I would use it for recording music, but it definitely picks up the slightest sounds. The extra cable is an added bonus.", "Date": "November 25, 2010"}, {"Title": "Very impressed", "Author": "Serenity Now \"Michael Serenity\"", "ReviewID": "R3L5LB0D3OZM0H", "Overall": "3.0", "Content": "I needed a seperate Mic to add on to my second security camera, it worked relatively well close up, but it wasn't designed for picking up sounds from very far out. I didn't get to use it where I needed it, but have made other plans for it. If you need an affordable mic set up that's small and easy to disguise for recording in a small area, this works well. It is a neat little Mic, I love it. I recommend it, and it's at an unbelievable price too!Mike F. in Florida", "Date": "January 25, 2010"}, {"Title": "Works... sometimes", "Author": "NJLocoman", "ReviewID": "R2YQ50MG61AZXS", "Overall": "1.0", "Content": "The microphone itself works well and picks up outdoor noise... when it works.  The wire that came with it is broken or the connector is bad, but in any case, the microphone works sometimes.", "Date": "December 12, 2012"}, {"Title": "Junk...", "Author": "William Chenoweth", "ReviewID": "R1SR2CQO7R7RHW", "Overall": "1.0", "Content": "Arrived barely working.  I stripped off the insulation to find the ground wire had no insulation underneath and was frayed.  I repaired it but the microphone is dead anyway.  The construction is very shoddy and weak and it could be very easily damaged during installation.  If you install this treat it like it is very fragile because it is.", "Date": "November 5, 2012"}, {"Title": "My My My \"The Mic's\" and \"Amazon\"", "Author": "\"The Jam\"", "ReviewID": "R12QUB2LWZ9UHN", "Overall": "5.0", "Content": "This mic is all that it is supposed to be in every way,sound ,clarity,sensetivity and overall performance.And my satisfaction with the sellers performance is all that I could want.  Thank you seller.  Thank You Amazon. I am \"The Jam\"", "Date": "April 19, 2012"}, {"Title": "Suits my needs perfectly.", "Author": "James J. Flannery \"K0UNX, Jim Flannery\"", "ReviewID": "R2Q8LJQZP3QHNH", "Overall": "4.0", "Content": "Purchased to monitor outdoor sounds.  This is not a high fidelity microphone, but gives plenty of gain so I can hear when the postman comes or when wildlife is foraging around the yard.  Loud sounds do not overdrive it.", "Date": "December 19, 2011"}, {"Title": "I like it", "Author": "larryhinz", "ReviewID": "R2ZXDOB15PRMK9", "Overall": "5.0", "Content": "I used one to install next to my security camera.Its easy to install, it works good and I am going to buy more.", "Date": "November 20, 2011"}, {"Title": "Awesome mic", "Author": "Paul C.", "ReviewID": "R2WH04K0IBUXEZ", "Overall": "5.0", "Content": "This is an extremely sensitive and high quality microphone, especially for the price.  Most retailers will charge you this price for the wire alone.  Your money is well spent with this high quality product.", "Date": "March 15, 2011"}, {"Title": "Nothing but static", "Author": "Tooth", "ReviewID": "R2JK9PECDE35UC", "Overall": "1.0", "Content": "Poor quality microphone.  Get the Q-See QSPMIC one instead.  All you hear is static and the build quality is very poor.  AC Adaptor lights up sometimes.  Microphone looks like someone made in their own home.  Don't bother trying to return it, you have to pay for the shipping on it yourself even after you pay $10 to have it shipped.", "Date": "April 4, 2011"}, {"Title": "bad product I don't advise anyone to buy it", "Author": "Abe Samhan", "ReviewID": "RJ7B3GMBC0L6L", "Overall": "1.0", "Content": "The voice is very weak and you hardly could hear the recorded voices. I added to my dvr like it should but it didn't work good I don't know if my dvr can't match with it or what.I bought another microphone and it works perfect with my dvr system and it did the job.", "Date": "May 17, 2012"}, {"Title": "bad wire", "Author": "jonathan", "ReviewID": "R23RPS2IKQFCAT", "Overall": "1.0", "Content": "I ran wire for Mic went to check audio .......none. No power to mic.waste of my time and my money.", "Date": "May 20, 2014"}, {"Title": "good unit", "Author": "ZHENG MING MEI", "ReviewID": "R3S7QX2JLC1EQM", "Overall": "5.0", "Content": "received product and it working fine, old security camera doesn't have audio, so buy this one and it work and pickup sound clearly.", "Date": "May 18, 2014"}, {"Title": "Works well enough", "Author": "Dan.", "ReviewID": "R3E64FZCK76D1B", "Overall": "5.0", "Content": "When you buy a microphone for your security system, check your system to find out the proper impedance range that the system requires.  Impedance is the audio (or any AC circuit) resitance that a device has.  If the impedance does not match your system, you get a muffled or dead tone from the system.  Proper impedance means the correct power will come from the device, sort of like the system is in tune.  This is true of any microphone and many other external devices.  After getting the wrong microphone for my Swann system, I realized the problem and checked the system specs.  The microphone works great in my home application with the Swann recorder.", "Date": "May 14, 2014"}, {"Title": "Works for listening to birds at the feeder", "Author": "R. Brook", "ReviewID": "R3SEBM0O0OPWMF", "Overall": "4.0", "Content": "I have feeders outside my dining room window that attract tons of birds. Unfortunately, with my double pane windows I can't hear them. I wanted a remote microphone that was weatherproof and did not require regular battery changes. A baby monitor did not meet either of these criteria. Also, it is too non-directional. The product here met my first two requirements and is at least slightly directional.This is not the greatest microphone for wildlife, but it is the cheapest and it does work. That's why I give it four stars - value to price ratio is important. From my hunt for an outdoor mike to hang under my roof eaves, I found mikes that might have done a better job for hundreds of dollars and not all waterproof. Plus, they were typically designed for specific mounting brackets. This product just gets stapled or duct taped under an eave.Don't expect miracles. There is no wind screen like a professional photographer might have on a boom mike or a mike mounted on a video camera. In a strong wind, I have to turn this off. But in a strong wind it would be hard to hear the birds even with the window open.I had planned on using an old boom-box or computer speaker (amplified) with this mike/preamp. I hadn't realized when I bought this that the RCA plug it uses is pretty rare as an input on boom-boxes or computer speakers. You will almost certainly need an adapter. (I think this should have been in the instructions and Amazon should list them as suggested accessories.) I couldn't find anything suitable in the local hardware stores. I did find them on Amazon, of course.For example, most old computer speakers (I had several in my basement) have a 3.5mm male plug that goes into the speaker output socket on a PC or laptop. You need an adapter with RCA females on one side and a 3.5mm female on the other. Here's one for under $4:  :http://www.amazon.com/dp/B00DJAAFVW/ref=pe_385040_30332190_TE_3p_M3T1_ST1_dp_1Note that the mike is mono, not stereo. You plug it into one of the two RCA sockets on the adapter. If you want stereo, you could do it pretty cheaply. Your old computer speaker will likely be in pairs for stereo. You just need a second one of these VideoSecu mikes.If you don't have any old computer speakers, you can probably find them at a thrift store for a buck or two..", "Date": "May 10, 2014"}, {"Title": "Exceeded expectations", "Author": "Jenny Rose", "ReviewID": "R2C6WKENQRRQU6", "Overall": "5.0", "Content": "This microphone picks up very well. I am very pleased. This product exceeded my expectations. All at a great price too.", "Date": "May 7, 2014"}, {"Title": "Tiny microphone", "Author": "C. Holmes", "ReviewID": "R3FWWRHG5W8293", "Overall": "1.0", "Content": "Could not get to work. Maybe it is defective. I am going to try a different mic to be sure. I plan to get one from Q-See", "Date": "April 1, 2014"}, {"Title": "would recommend", "Author": "Lorry", "ReviewID": "R30U5INMBWF9HT", "Overall": "4.0", "Content": "The mic is good but the cable stoppped working after a heavy rain.we replaced the cable and it has been outside all winter and is still working good.", "Date": "March 10, 2014"}, {"Title": "love it", "Author": "Robin Grant", "ReviewID": "R3P6YQ6KBNHFDY", "Overall": "5.0", "Content": "Great.. got it quick. Will recommend. Very satisfied.  No complaints on anything that I can see. I love it alot", "Date": "March 5, 2014"}, {"Title": "works great", "Author": "Scott Swanson", "ReviewID": "RNRWUVN1EFDDT", "Overall": "5.0", "Content": "for the price you cant beat it if I ever need another I will buy it again!!! worth the price", "Date": "March 2, 2014"}, {"Title": "Great microphone for the price", "Author": "Tina L. Hirsch", "ReviewID": "R2LEZP3YJP6H9S", "Overall": "5.0", "Content": "Very easy to install picks up great sound.  Has a 50 foot cord for long reach.  Would definitely recommend this product", "Date": "February 28, 2014"}, {"Title": "Beware of the RCA Pins", "Author": "Matt R. La Bass", "ReviewID": "R1J7K0OCWAPG0W", "Overall": "3.0", "Content": "The Pins may not all be metal on the 50' extension cable, mine does not work, even tested the Mic with another RCA cable and it worked fine. Now I guess I'll have to find another 50' cable since I don't really want to hassle with sending the kit all back.", "Date": "February 23, 2014"}, {"Title": "Who is checking the chicken coop?", "Author": "Ken", "ReviewID": "R38ADW770FEP62", "Overall": "3.0", "Content": "Not sure yet, having a problem recording the sound.  Probably operator error.  Been too cold and snowy to mess with it", "Date": "February 20, 2014"}, {"Title": "It's the only microphone that works with Swann surveillance DVRs", "Author": "Mary", "ReviewID": "RKHUBZCFP03FE", "Overall": "5.0", "Content": "These tiny microphones have added audio coverage to my Swann DVR's audio capabilities. I can now monitor sound as well as visual with my property's CCTV system. The range and clarity is incredible with these sensitive little powered microphones.", "Date": "February 10, 2014"}, {"Title": "WORTHLESS", "Author": "Lynzi", "ReviewID": "RJSS9Z86F12BP", "Overall": "1.0", "Content": "If I could give this no stars I would. And then it'd be a fair representation of how this external mic actually works, which is NOT AT ALL! The shipment came faster than I had expected, it was undamaged which was good, but there's absolutely NO SOUND.", "Date": "January 13, 2014"}, {"Title": "This mic did not work", "Author": "the note", "ReviewID": "RJIL99C9NJGH8", "Overall": "1.0", "Content": "i have purchased three of these item, but non of them worked. it gave me some sound at the beginning then stopped.", "Date": "January 12, 2014"}, {"Title": "Excellent", "Author": "Franncisco Tamarez", "ReviewID": "R1JKQV602G5SCL", "Overall": "5.0", "Content": "Excellent product, I am very sastifecho with him. I recommend it to anyone interested. It is very use full for every one", "Date": "December 10, 2013"}, {"Title": "VideoSecu High Sensitive Preamp Tiny Spy Microphone Audio Pickup Device Kit", "Author": "J. Phillips", "ReviewID": "R11QET8FGK30P3", "Overall": "5.0", "Content": "VideoSecu High Sensitive Preamp Tiny Spy Microphone Audio Pickup Device KitWorks for  sound on by Swann system. Picks up conversations from 10 ft. away very well.", "Date": "November 14, 2013"}, {"Title": "It does not work", "Author": "MK", "ReviewID": "R1ADK1ZAOPXUW0", "Overall": "1.0", "Content": "Connected the cable as it should be. Quite simple actually.  The mic doesn't pick up any sound.  Checked cable connections and DVR connections multiple times still no audio.  Will return.", "Date": "September 15, 2013"}, {"Title": "Not installed yet.", "Author": "Robert Lewis", "ReviewID": "RXNKXNBUJMEY0", "Overall": "4.0", "Content": "Havent had time to install, but seems well made. hope to find out in a few weeks if it is a great product.", "Date": "September 13, 2013"}, {"Title": "This microphone is super sensitive.", "Author": "John F. Allred", "ReviewID": "R1PC4EEN22Y78D", "Overall": "5.0", "Content": "I am very pleased with the performance of this mic.  The price was very reasonable.  It was a great deal.", "Date": "September 8, 2013"}, {"Title": "fuzzy sounding", "Author": "Daziegrl4", "ReviewID": "RNBXJ22U88G7W", "Overall": "1.0", "Content": "Picks up too much background noise to be useable. Looks like it could have been constructed better. Spend a little more and get something better.", "Date": "September 6, 2013"}, {"Title": "DOES NOT WORK !!!", "Author": "Lisa", "ReviewID": "REZXAIO5ZQUPA", "Overall": "1.0", "Content": "I received this microphone kit and tried to get it to work with my security DVR and it did not. So then tried to get it to work on my brand new LED TV. Still nothing. I then have to call Videosecu and spent 30 minutes trying to understand the garbled speech of someone who cannot speak English and who proceeded to tell me it was our fault it didnt work. CUSTOMER SERVICE SUCKS !!", "Date": "September 5, 2013"}, {"Title": "doesnt work", "Author": "Steve Henry", "ReviewID": "R3KKP68LCATVI2", "Overall": "1.0", "Content": "I cannot get any sound to come thru this mic. I hooked it to two separate boxes that worked with other mic, nothing!", "Date": "July 30, 2013"}, {"Title": "These microphones work great hooked up to a TV.", "Author": "bill schmitz", "ReviewID": "R9GTTKRV2GWYB", "Overall": "5.0", "Content": "I can hear dogs barking over 3/4 of a mile away and conversations at about 200 feet loud and clear. I recommend this product to anyone who wants audio feed with their CCTV security camera's.", "Date": "July 15, 2013"}, {"Title": "CCTV Microphone", "Author": "D. Stevenson", "ReviewID": "R1I5VDGDUZWJ4P", "Overall": "5.0", "Content": "I install CCTV systems every week and I was always looking for a low cost alternative to the $200 commercial microphone we used. I recommend this product even in commercial high end CCTV security systems.  It's simple to connect, you can have it up in a few minutes.  It's very sensitive, picks up sound in entire office spaces.  Very affordable for an entire package, includes long wires and power supply.", "Date": "May 28, 2013"}, {"Title": "Great Microphone!", "Author": "C. Villwock", "ReviewID": "R1EX321GTYSUM8", "Overall": "5.0", "Content": "For the money, this is an amazing deal! The sound quality (for a security set-up) is well above average at any price, the build quality is above average considering the price, the gain on the microphone is high and for me this entire microphone package is perfect!I would buy it again without question.", "Date": "May 24, 2013"}, {"Title": "Satisfied with its sensitivity to sounds.", "Author": "Antonio S. Abayon \"Tony S.\"", "ReviewID": "R1FYS54TW40JVF", "Overall": "4.0", "Content": "Satisfied with its sensitivity to sounds. You just need to turn your volume up or higher when playing a recorded video with the sound.", "Date": "April 1, 2013"}, {"Title": "excellent!", "Author": "Felix Ch", "ReviewID": "RR2ULKI3AXCQC", "Overall": "5.0", "Content": "very good length cables, good consistency of components, functional and I were very fair with what I expected!i recomended!", "Date": "March 17, 2013"}, {"Title": "Not worth the money.", "Author": "Pamela Wingate", "ReviewID": "R5YSC1JEGQ8RM", "Overall": "1.0", "Content": "I do not recommend ordering this product.  i was very disappointed to see that both mics (I ordered 2) were not functional.  I tried them on several different tvs and outlets with no positive outcome.  I contacted the seller wanting a refund and I had to go through 20 questions with them about how I set up the mics and whatnot only to be told I can ship them back to them and they would look into why they didn't work.  When I told them I don't feel that I should have to pay to send them a defective product and that I wanted my money back, they simply quit responding to me.", "Date": "March 14, 2013"}, {"Title": "Excellent.", "Author": "FlickerKing", "ReviewID": "R239D36YNZRW5C", "Overall": "5.0", "Content": "This is a great little gadget that goes along perfectly with my home camera system.  I would recommend this to anyone that needs or wants additional security.", "Date": "March 11, 2013"}, {"Title": "Impressed", "Author": "Zwol \"Zwol\"", "ReviewID": "R10U7G1047BJK4", "Overall": "5.0", "Content": "I bought a few of these and have been very impressed with how well they pick up and the clarity of the sound. I have one outside and one inside after a year of constant use they work flawlessly.", "Date": "February 19, 2013"}, {"Title": "Sensitive Mic", "Author": "GCSandman", "ReviewID": "R3Q8OAXZ52YVSY", "Overall": "5.0", "Content": "This MIC worked really well with Q-See camera system. It is very sensitive and has a radius of about 15-20 feet. A keeper for sure. Shipping was fast and packaging was well.", "Date": "February 4, 2013"}, {"Title": "Works Great", "Author": "jrod", "ReviewID": "R3T3UVY2EG220H", "Overall": "5.0", "Content": "I purchased two of these mics and they work great. The original mic I used before had a lot of background noise and hum. If you get a loud hum when you try this mic make sure to use the included AC adapter. I originally used a dc power splitter and the camera's power supply and I got a loud hum. I used the AC adapter that came with the mic and the hum was gone and the sound is great, I can even hear when people are talking in the front of the house and this mic is installed in the back.", "Date": "December 1, 2012"}, {"Title": "Very impressed!", "Author": "Yvonne C Bailey", "ReviewID": "RB68GBJW2MB7E", "Overall": "5.0", "Content": "Fast shipping and item as described. It works better than we expected it to work. It was an added touch to our security cameras. Thank You Very Much", "Date": "November 27, 2012"}, {"Title": "only for 6 months", "Author": "aircrzr", "ReviewID": "RJGNQ4H1UKPBA", "Overall": "2.0", "Content": "The product was good in the first few months, then it just stopped working. On the shipping slip there was no information in order to get hold of someone to try to return/refund this product. Waste of money in my mind!!", "Date": "September 27, 2012"}, {"Title": "Excellent reproduction of sound", "Author": "JayDubya \"JayDubya\"", "ReviewID": "R2IKNCD1WO8BXX", "Overall": "5.0", "Content": "I purchased this for my DVR surveillance system. I was mistaken in my initial review. This kit was not the device under review in my first review. I am sorry if someone decided against this kit because of that erroneous review.I use this mic in a special situation and it picks up beautifully and clearly.The other microphone I have was part of a combo mic and camera that I placed in a location where it does not pickup well - sorry, I mixed up the two. Both actually worked well as microphones with my Q-See surveillance, the other one does not work well in the location I placed it so is muffled somewhat and unclear. I know it is the location because I relocated it from a place where it too worked well. (But that is another story!)", "Date": "August 19, 2012"}, {"Title": "Nice mic", "Author": "AF", "ReviewID": "R1MGUEA9ZEHF8F", "Overall": "4.0", "Content": "It works well however i wish they would have throw in a smaller RCA cable. Not a big problem and the fact they give two options for power is nice.", "Date": "January 23, 2012"}, {"Title": "Too much static and background noises", "Author": "Eden", "ReviewID": "R33V3ZZ14F52DF", "Overall": "1.0", "Content": "The product arrived as promised. However, the quality of the product was very disappointing. We used this microphone as part of the security system. But its lack of clarity and reliability was a serious problem.  the price was attractive but the product, which was made in China, at first use: noises (static) buried the signal. This made it useless to listen or record any voice or sound. Communication with seller (Videosecu) left me the impression that this outfit was not trustworthy. Though, Amazon customer service was excellent. I would NOT recommend products from Videosecu.", "Date": "December 20, 2011"}, {"Title": "This microphone rocks!", "Author": "moose409", "ReviewID": "R20QNN97AIXVN", "Overall": "5.0", "Content": "I needed an area mike for the video camera I put in our church to feed the service into one of the other rooms.  The built-in mike that came with the camera did not have enough volume or range.  This mike works perfectly and plugged right in to the video transmitter where the other one did. I highly reccomend this product if you need a better mike for a video camera set-up.", "Date": "March 11, 2011"}, {"Title": "Microphone is non-functional", "Author": "Brent Keeth", "ReviewID": "R1AMX1E03PHVNB", "Overall": "1.0", "Content": "I purchased this microphone to use in conjunction with a network CCTV camera. Unfortunately I was unable to get the microphone to function, even when connected to the microphone input on my PC. And yes, I did connect it properly to the power adapter using the supplied cable. I was really hopeful for this product, but remain disappointed.", "Date": "July 23, 2013"}, {"Title": "calidad de microfono", "Author": "victor", "ReviewID": "R3K9L2M7HT5TFS", "Overall": "4.0", "Content": "buen producto , mi puntuacion es que se oyo como un zumbido cuando se aumenta el volumen del tv. puede que tenga que usar algun implemento electronico para disminuir ese ruido , por lo demas excelente distancia en audio.", "Date": "March 12, 2012"}, {"Title": "does not work", "Author": "agility dog", "ReviewID": "RV2MCZWT2OL89", "Overall": "1.0", "Content": "the plugs do not mesh!  50 feet of cable does not have attachment to put the audio attachment on the unit?It does not work!", "Date": "October 22, 2011"}], "ProductInfo": {"Price": "$79.00", "Features": "Super high gain mini microphones capturing audio evidence for security camera system\nPreamplifier used to increase a microphone's low output voltage to a stronger usable level\nBuilt in on board IC preamp, low noise, high gain and auto level adjustment\nPick up every sound with this super high gain micro audio system\nPackage included: 1 x preamp microphone, 1 x 12V DC 500mA power supply and 50ft extension cable", "Name": "VideoSecu High Sensitive Preamp Tiny Spy Microphone Audio Pickup Device Kit for Security Camera Sound Voice Monitoring Recording with 50 Feet Cable and Power Supply WE6", "ImgURL": "http://ecx.images-amazon.com/images/I/51ExSuNaIpL._SY300_.jpg", "ProductID": "B002S4G870"}}