{"Reviews": [{"Title": "12Volt Security Camera Power Supply", "Author": "Kyle 07", "ReviewID": "R39NOBHNZEGHP2", "Overall": "3.0", "Content": "Power supply does save space by being able to power 4 cameras but fails at doing it well, I only currently have 3 cameras and it struggles with them, none of my cameras are very power hungry only 2 have ir illumination and thats where the problem is ,when it gets dark i get interferance on the cameras that wasnt there during the day or when they were powered by separate power supplies.I will have to relace this with a beefier power supply now since i have a 4th camera in the box that I dont want to cause more problems with.", "Date": "March 5, 2012"}, {"Title": "Seems to do the trick", "Author": "A. Ferdinand", "ReviewID": "RFAEICB214JHR", "Overall": "5.0", "Content": "Just like the preivous reviewer, I was also a bit concerned but went ahead with the purchase. When I got the unit, I checked voltage and polarity at all of the plugs, and everything seemed to be in order so I went ahead.  It seems to work just fine for me, powering (at present) two 250 mA  IR cameras with no issues.I really like the fact that the transformer has a normal power cord and is not a \"wall wart\" style, as it saves room on outlets.", "Date": "January 3, 2012"}, {"Title": "Working perfectly fine for about a month now.", "Author": "S. Simmons", "ReviewID": "R14WGLVTLCW4ZD", "Overall": "5.0", "Content": "I have been using this product to power 3 cameras (one plug unused) and this product is working as i expected.  Although I was concerned by the previous review, this was the only choice for a 4-way, so I tried it out.  It does have a higher total output than the adaptor that came with my nightowl dvr's cameras, but the voltage is the same 12v.  Always check your camera specs before choosing a transformer.  Some cameras (some PTZ Cameras for example) need 24v, but they often have the transformer included with camera.  Voltage has to be the same on each camera and transformer, but Amps rating of the transformer needs to be equal to or higher than the total amps required by all the cameras you intend to hook up to the transformer.  One last thing, this product doesn't have a UL logo if that bothers you, however it does have the european CE logo.  I believe the previous unfortunate reviewer had some other problem occur as a coincidence when his equipment failed.", "Date": "February 26, 2011"}, {"Title": "very nice!  Good regulated power supply!", "Author": "dincon2000", "ReviewID": "RFSYZAXXEVGS5", "Overall": "5.0", "Content": "As soon as this came in I pulled all the wall-worts out of the power strip and plugged this in. Plugged in the cameras and Boom! done.", "Date": "March 1, 2012"}, {"Title": "Quality product", "Author": "Richard G. Evansii \"Onlybygrace1\"", "ReviewID": "R3ICFKP8OKDA7G", "Overall": "4.0", "Content": "Running 3 cameras from this unit. Connectors well made, cords perfect length to mount next to DVR. No complaints here. I would gladly buy another if I needed one.", "Date": "May 18, 2013"}, {"Title": "Good for a 4 camera setup", "Author": "BrianHelp", "ReviewID": "R1UFXTFDUKJERF", "Overall": "5.0", "Content": "This is good for a 4 camera setup. Keeping the wires neatly especially if you are running cat5 to each camera for power and for video feed.  Reliable power supply.", "Date": "April 21, 2014"}, {"Title": "awesome pc.", "Author": "Nowin M.", "ReviewID": "RX75MLCYM7HOH", "Overall": "5.0", "Content": "Works real good, have more space due the fact is only one plug .. would recommend to others.  Works very well", "Date": "March 31, 2014"}, {"Title": "Works for LED strips", "Author": "D. Francey \"MtnXf\"", "ReviewID": "RRQAELUXXJAA", "Overall": "5.0", "Content": "I bought this and a pack of female 5.5mm tips to use for light strips above my cabinets.  Its been working for several months without issues so far being on everyday for 4+ hours.", "Date": "February 10, 2013"}, {"Title": "Very Cheap", "Author": "Paul", "ReviewID": "R2V57HJ3Q8UK2S", "Overall": "1.0", "Content": "This device gets really hot, and when it does it cuts off. I was  powering ONE camera that was rated at <750 mA with around 10ft of cat5 cable and it still struggled.", "Date": "September 17, 2012"}, {"Title": "Works without any problems", "Author": "Henry", "ReviewID": "R1R458EQW316A9", "Overall": "5.0", "Content": "Product arrived within a weeks from ordering. Like described, it works with my camera fine, plug and play. The cord is a bit short but for me it is enough. I would recommend it.", "Date": "March 14, 2012"}, {"Title": "great product!", "Author": "Sabrina M.", "ReviewID": "RE0XDNJHRQF8D", "Overall": "5.0", "Content": "As soon as my security system cameras went out I thought I will have to purchase a new one. However my husband suggested we should try the charger first even if we would have wasted some money in case it did not work. When it came the charger fit right in with the system and all my cameras started working. I am very pleased. I will recommend purchasing a charger first if you have issues with your security cameras.", "Date": "January 27, 2012"}, {"Title": "STOPPED WORKING AFTER 2 MONTHS", "Author": "chris", "ReviewID": "R11GTKOWMZOPNU", "Overall": "1.0", "Content": "I purchased one of these for a new Swann 4ch DVR CCTV system. I added two more cameras to the system, and needed a four camera power supply. I install CCTV systems and figured I could try a different supplier this time. Under normal use, it quit on two channels and made the other cameras look fuzzy, which meant it was no longer suppling the proper voltage to the cameras. I'm just glad this piece of crap died instead of the DVR. *SUMMARY*  Keep looking and don't order from this supplier. -Cheap Product-. I tried contacting supplier ( VideoSecu ) with no response. Their loss, as I could have given them alot of buisness through my work. Unless the supplier contacts me to resolve this, it will stay at one star.", "Date": "May 16, 2013"}, {"Title": "Beware: some are 1A not the 2A advertized", "Author": "B. Turner \"Quigath\"", "ReviewID": "R3N55JSMJGO9Y5", "Overall": "1.0", "Content": "I bought two of these for an LED lighting project for the kitchen. I needed a power supply with 2 amps of power but most being sold are less expensive and just provide 1 amp. I was happy to find this one being sold at a good price and rated at 2 amps, so I got it. When delivered though, I was disappointed to see the rating on the plug said it was only 1 amp. I didn't test it myself - pulling more power than rated can cause it to overheat. The power supplies have been returned and my money refunded. I am now looking for a true 2A power supply for my project.Maybe there was a temporary problem with the manufacturer or something, just be sure to carefully inspect what is delivered to you. The plug should be rated at 2 amp.Also, I noticed that the 4-to-1 plug converter was a separate octopus-type wire splitter that plugged into the main power supply. It's not exactly how the picture looks. A single wire comes out of the supply and ends in a 2.1mm male plug. The splitter can then be attached. FYIThis power plug would have been perfect had it been what was advertized. Guess it really was too good of a deal to be real.", "Date": "December 11, 2012"}, {"Title": "I was happy", "Author": "Andtos", "ReviewID": "R2NLV2JYD7K20S", "Overall": "2.0", "Content": "It worked out of the box but only for a month, very disappointed . I used this thing to power two cameras and I don't know what happen that it stopped working, the day it stopped working was raining with a lot of lightning .", "Date": "May 28, 2014"}, {"Title": "so far so good", "Author": "alexander lavin", "ReviewID": "R32OP2R80L8HN3", "Overall": "5.0", "Content": "i am using this power supply for a while,no complaint so far,i will recommend this to anyone who look for one like this", "Date": "May 10, 2014"}, {"Title": "As advertised.", "Author": "tlong927", "ReviewID": "R2743T2PNQDF0K", "Overall": "5.0", "Content": "I added 4 additional cameras to my system. I need more power. Hooked this bad boy up and it worked perfectly. I will post an update if the power supply fails.", "Date": "May 9, 2014"}, {"Title": "Failed after 12 Months", "Author": "KJAG", "ReviewID": "R6REKC7LMX2JS", "Overall": "1.0", "Content": "Device is very light, feels almost hollow.  Cheap plastics.  Made in China with no manufacturer or company logo.  Just stopped working.", "Date": "March 29, 2014"}, {"Title": "Works great", "Author": "Mark Boisvert", "ReviewID": "R3KPMKWENNAOW2", "Overall": "5.0", "Content": "I have purchased another and would recommend this item it works well and has no problems to date. good find", "Date": "March 28, 2014"}, {"Title": "This power supply works fine to power our video camera.", "Author": "Dennis Butzin", "ReviewID": "R2JZ5RX9Y3R2NX", "Overall": "5.0", "Content": "This power supply works fine to power our video camera. It has not failed and this is the third place we use this type of power supply in our hall. They work and are cost effective.", "Date": "March 27, 2014"}, {"Title": "As advertised...", "Author": "Nicholas R.", "ReviewID": "R13KR7HVBRULZE", "Overall": "4.0", "Content": "Not the highest quality item in feel.... But, it powers my cameras with no problem and was a good price... So no complaints,", "Date": "March 25, 2014"}, {"Title": "Great Power Source.", "Author": "Larry Fitt  \"SCC man\"", "ReviewID": "R3AQ7O7J2Q7U8X", "Overall": "5.0", "Content": "I was concerned that this unit would have sufficient power to energize 3 cameras and also whether it would function properly for the long term.  I am happy to report this unit does power 3 cameras with 100-foot wires without any failures for more than 6 months.", "Date": "February 24, 2014"}, {"Title": "power supply adapter", "Author": "vernon mcneil", "ReviewID": "RRZ3FFWI28KK5", "Overall": "5.0", "Content": "item was sent on time .i have no complaints.nice price,hooked  up to four camras and they work fine.for the price a very good item.", "Date": "February 18, 2014"}, {"Title": "Double Whammy", "Author": "Danny U.", "ReviewID": "RCN4MTNV73FXC", "Overall": "5.0", "Content": "I purchased this power supply to clean up the mess I had with four separate power supplies for my cameras. After installing it I realized my picture was so much clearer on my phone and my computer. I always had goofy lines and some blurry spots intermittently when I was viewing the cameras. I thought it was because I bought inexpensive cameras. Not the case. This power supply makes it look like I have all new stuff! I recommend this to anyone who is having wierd things going on when viewing your cameras or if you just want to clean up the mess that individual power supplies make.", "Date": "January 26, 2014"}, {"Title": "works great", "Author": "Joseph A Kantola", "ReviewID": "RU6BKY23NIFDU", "Overall": "5.0", "Content": "1-23-14  - I have purchased two of these and so far they both work as expected.  I will update this review if I have any problems with this product.", "Date": "January 23, 2014"}, {"Title": "Excellent unit for the price.", "Author": "C. L. Akers", "ReviewID": "R17P6OT0DX8LVL", "Overall": "5.0", "Content": "I have ordered these before and they do a great job and meet my expectations. I'm sure will order some more in the future as I keep expanding my home and office security.", "Date": "January 13, 2014"}, {"Title": "Great", "Author": "Robert Faircloth", "ReviewID": "RVBPBH3KQJ0EV", "Overall": "5.0", "Content": "I find no problems with this item..it works very well for me, and each camera is at least 50' away from the DVR.  I detectvery little voltage drop.Yes..I would recommend this to others.", "Date": "December 19, 2013"}, {"Title": "12 v dc cctv security power supply", "Author": "Maria E. Rivera", "ReviewID": "R13P3A70DYTH6I", "Overall": "5.0", "Content": "this videosecu  is worth buying it works just as good as if you buy one of 100 dollars  I would recommend this", "Date": "November 15, 2013"}, {"Title": "VideoSecu 12V DC CCTV Security Camera Power Supply Adapter with 4 (2.1mm)...", "Author": "J. Phillips", "ReviewID": "R18EXF54JSNRKM", "Overall": "5.0", "Content": "VideoSecu 12V DC CCTV Security Camera Power Supply Adapter with 4 (2.1mm)Works to power my other cameras on by swann system.", "Date": "November 14, 2013"}, {"Title": "As promised", "Author": "gmoney", "ReviewID": "RO7CZMNOM8KYT", "Overall": "4.0", "Content": "The product is working as expected. Saved me a lot of power adapter space on my surge protector. Sold at a fair price", "Date": "October 22, 2013"}, {"Title": "Great For Multiple Cameras", "Author": "Charles Michaels", "ReviewID": "R138I01XD2BNR8", "Overall": "5.0", "Content": "I have 4 cameras and each had it's own power supply. With this I was able to use just one power supple and free up 3 electrical outlets. Seems to supply the correct power to each camera.", "Date": "October 14, 2013"}, {"Title": "Great", "Author": "George", "ReviewID": "RRNTDY27K58SB", "Overall": "5.0", "Content": "Works as expected. Powers 4 CCTV cameras from the exterior of the house. Easier to use than a box. No qualms.", "Date": "October 13, 2013"}, {"Title": "Great", "Author": "Danny Clayton Jr", "ReviewID": "R2OX80ROUZFME8", "Overall": "5.0", "Content": "Works great. Not much to say about them other then they work. Better then the power supply that comes with the cameras.", "Date": "September 10, 2013"}, {"Title": "Great Space Saver", "Author": "MICHAEL D.", "ReviewID": "R2ITARE1LY7QHM", "Overall": "5.0", "Content": "This camera power pack allows four cameras to be powered using only one plug which is a great space saver for DVR systems.", "Date": "September 9, 2013"}, {"Title": "practical camera connection", "Author": "Bruce Bondurant", "ReviewID": "R39EBD5D3U6N03", "Overall": "4.0", "Content": "This is the only reasonable way to hook up multiple cameras.  it works great and saves space.I would recommend it to anyone with a multiple camera system", "Date": "September 3, 2013"}, {"Title": "ok", "Author": "kevin", "ReviewID": "RGHJ9VJY5IY9D", "Overall": "3.0", "Content": "well this power supply was suppose to power up to 4 cameras but after i plug camera 3 it went out i had to order another", "Date": "September 3, 2013"}, {"Title": "needed for multi camera additions", "Author": "WildBillV", "ReviewID": "R2LMQF80O01VR5", "Overall": "4.0", "Content": "system only came with a 4 power unit and needed another for my other additional camers.added to my swann 8 camera system.", "Date": "September 2, 2013"}, {"Title": "Nice", "Author": "blurb", "ReviewID": "R1DDLM9TJBMX8J", "Overall": "5.0", "Content": "could to have a central power supply with enough power to drive cameras, no extra cabling lying around, would recommend", "Date": "August 16, 2013"}, {"Title": "Great Power supply", "Author": "Richard S Swift", "ReviewID": "RHNVH405EF24W", "Overall": "5.0", "Content": "Much better item than the one shipped with my Q-See Security system. Easy to install and it works just Great.", "Date": "August 15, 2013"}, {"Title": "Same qaulity that ships with the CCTV Zmodo system", "Author": "R.J.Camera", "ReviewID": "RZ6CWPTUB83P8", "Overall": "4.0", "Content": "It is what you would expect in a economy system but does the job without any problems for the last few months", "Date": "August 13, 2013"}, {"Title": "Did the job", "Author": "gduncan229", "ReviewID": "R3V7JO3OUFYGIG", "Overall": "5.0", "Content": "We had 4 cameras that had different power supplies. Bought this so we could stop using a bunch of different power supplies. Worked great.", "Date": "August 6, 2013"}, {"Title": "Great space saver", "Author": "Greg C.", "ReviewID": "R35OP3JC0IN908", "Overall": "5.0", "Content": "I have had one of these for a year now with no problems. I purchased more of these since another brand failed.", "Date": "August 4, 2013"}, {"Title": "Works As Expected", "Author": "MWCraft", "ReviewID": "R29458VY9WY86O", "Overall": "5.0", "Content": "I bought this adapter to go with the two VideoSecu bullet cameras I purchased and it has done the job.  No problems and no issues.", "Date": "August 1, 2013"}, {"Title": "Great way to cut down on wires!", "Author": "DEFCON1 \"DEFCON1\"", "ReviewID": "R30MRA4ELKFH2C", "Overall": "5.0", "Content": "Easily handles two 12 volt 1amp. cameras and hasn't even gotten warm.  Great way to cut down on wire clutter!  Very glad I bought it.", "Date": "July 7, 2013"}, {"Title": "I like it..", "Author": "rnyproduction", "ReviewID": "R1PIAI4GILSJHJ", "Overall": "4.0", "Content": "My power supply box blow up and stop working.  I bought this and a ups to install its has work for a while not.  Good Product recomended... Enjoy Power Folks", "Date": "July 2, 2013"}, {"Title": "good", "Author": "d1234", "ReviewID": "RV5T3CQCE536Z", "Overall": "4.0", "Content": "works good bought as an substitute but works better than orignal will buy again if needed had it for quite a while let me go check on it", "Date": "June 29, 2013"}, {"Title": "It worked", "Author": "Tap Mat", "ReviewID": "R3VTM455YYTJU3", "Overall": "3.0", "Content": "The item was  as advertised. Brought up image then blank and power supply voltage dropped. Possiblility all wiring needs gone over.", "Date": "June 7, 2013"}, {"Title": "Totally Awesome!", "Author": "Kevin S", "ReviewID": "R16WZEO24GM67F", "Overall": "5.0", "Content": "I have four cameras, and now with this power supply I don't have four power supplies for them plugged in. Just one adapter for all four cameras. Nice. Less wires and crap to deal with.", "Date": "June 2, 2013"}, {"Title": "Worked great", "Author": "Robert payne", "ReviewID": "R38FW4K0NBSW5M", "Overall": "5.0", "Content": "Bought a 8 channel dvr system that came with four cameras. Decided we wanted to add two more cameras so I picked this up, worked great.", "Date": "May 28, 2013"}, {"Title": "Not enough power for even one camera.  Probably defect.  Will return.", "Author": "Bill Schebeck", "ReviewID": "RTD3TDWCYBHQX", "Overall": "3.0", "Content": "Probably defect.  Worked out of box, then failed.  Rewired before substituting power source. Will replace with the same. Handy size and makes installation simple.", "Date": "May 25, 2013"}, {"Title": "4 channel security camera power supply", "Author": "TekGeek", "ReviewID": "R1C78QZW06XZ4F", "Overall": "5.0", "Content": "it allows me to add 4 more cameras to my 16 channel q-see dvr.  good price, did not need 8 more.", "Date": "May 23, 2013"}, {"Title": "It does it's job.", "Author": "jose", "ReviewID": "R2FEPPNJA1CQPV", "Overall": "5.0", "Content": "No need to use a power strip. This eliminates the need to use multiple A/C adapters. Powers all 4 cameras with just one plug outlet.", "Date": "May 12, 2013"}, {"Title": "frustrating lines..", "Author": "L. Sarver \"awaken812\"", "ReviewID": "R2W3XRHFP0OM38", "Overall": "1.0", "Content": "I bought this adapter because it was recommended that I use a 12V..my old camera was not that powerful..but this new one is an amazing camera except for the adapter, it didn't come with one. Amazon had this adapter right next to the camera as a great choice for the camera. At night which is when I really need to record I get nothing but black lines up and down and a patch of color static across the screen. I have captured great stuff but hard to see with the lines moving up and down across the screen. I read from different sources that it could be the adapter. I am now in the process of ordering RG59 Siamese cable which is very expensive or ordering another 12V which has great reviews from customers who have the same experience as me. I will another 12V  first if it doesn't work then I will buy the RG59 Siamese cable and will update the results.Bottom line if you have a good camera powerful like mine I would not recommend this.UPDATE: Today may 24 i received the new adapter OMG is amazing..all this time trying to figure out if it was cables or camera ..slowly and gradually narrowed down to the adapter...but today when I received the new adapter and remove this one they sell Voila! no lines great clear picture ...night vision is amazing..just to be fair my camera is powerful though it was only $70 I got it from Amazon because of the reviews ..the best camera!!! but it needed a powerful adapter..here is the adapter i received today in case someone is suffering like I was ,..and it was less money than this one here..just $10 I am going to order more VideoSecu 12V DC 2A 2000mA 100V - 240V AC Regulated Power Supply Adaptor for CCTV Security Camera Home Surveillance System PW2000R 1LCgood luck for those of you Night Vision aficionados", "Date": "May 6, 2013"}, {"Title": "Power supply works great.", "Author": "R. Iser \"Electronics fan\"", "ReviewID": "R3CFC8ME3V0KCK", "Overall": "5.0", "Content": "Wore out the old power supply, This one is a upgrade to the old one that lasted for a few years. Works great so far.", "Date": "May 2, 2013"}, {"Title": "great power supply", "Author": "Shari F. Lewis", "ReviewID": "R3CKQBB9Z0DNYV", "Overall": "4.0", "Content": "This def. is a great purchase it helped me declutter by allowing you to hook up 4 security cameras to one power source / What a great adapter.. I will definitely purchace more of these in the future.. Way to go...", "Date": "April 22, 2013"}, {"Title": "Power Supply for my Swann Cameras", "Author": "stathis747", "ReviewID": "R2M6E59Z8H4WAJ", "Overall": "5.0", "Content": "Does the job very well, much cleaner then having 4 individual power suppy.  Highly recommend this power supply.  Clean crisp power and shows on a great picture", "Date": "April 20, 2013"}, {"Title": "Got A Charge Out of It.", "Author": "Monsi L'Ggrke", "ReviewID": "R3CYPXZM0XIEXQ", "Overall": "5.0", "Content": "This charger is handy and necessary. I had to order it since it was not disclosed that it would be necessary, but I'm up and running.", "Date": "March 11, 2013"}, {"Title": "Great Power Source", "Author": "J. Chavez", "ReviewID": "R3GDGUFMRYGDS8", "Overall": "5.0", "Content": "Used it to install cameras. Used Video Balun Network Transceiver and needed 1 source. 1 power source to power all 4 cameras fixes this issue. Great power source", "Date": "March 6, 2013"}, {"Title": "Works well with four cameras", "Author": "Aris Abeleda", "ReviewID": "R3Z0MK0LLBEFA", "Overall": "5.0", "Content": "I use this to power three wired video cameras and one receiver for a wireless video camera. It has been on 24/7 for the past eight months and so far so good.", "Date": "February 24, 2013"}, {"Title": "Great solution", "Author": "Jared", "ReviewID": "R1YMZFD3VSSWVI", "Overall": "5.0", "Content": "Great solution to bypass rigging up an actual powerbox. Perfect for the home installation that is on a budget and keeps the already multitude of wires involved in such an endeavor to a minimum.", "Date": "February 19, 2013"}, {"Title": "videosecu 12v dc cctv security camera power supply adapter with 4 camera connection", "Author": "LouieD", "ReviewID": "R3RB06YJHNYW86", "Overall": "4.0", "Content": "very good quality and description was exactly as product received which is nice and assurance that you are getting exactly what website mentions.", "Date": "February 18, 2013"}, {"Title": "Security Camera Power Supply", "Author": "Albert", "ReviewID": "R7DOL8C860GCJ", "Overall": "5.0", "Content": "I have been working on some secure camera installations and need to test the cameras before installing them. This power supply was just what I needed to complete all my testing.", "Date": "February 17, 2013"}, {"Title": "security video power supply", "Author": "Kevin \"€x°¶}u$\"", "ReviewID": "R3W3QLOVYIUWGF", "Overall": "5.0", "Content": "Just received power supply in the mail. Got here before expected due date. Not much to say about a power cord other than it works fine. Reliable seller and would purchase from again.", "Date": "February 15, 2013"}, {"Title": "excelletn", "Author": "anthony smith", "ReviewID": "R3TW3CVWGFJ3H4", "Overall": "5.0", "Content": "I can't say enough about this product.  I will definitely buy more of these  for all of my camera jobs.", "Date": "February 14, 2013"}, {"Title": "CCTV Cameras 12VDC power supply", "Author": "Steve", "ReviewID": "R183Z32IOI39BO", "Overall": "4.0", "Content": "I received the unit on time and in good shape. It functions well and meets the advertising. I have nothing negative to say. I would recommend this to a friend and buy again if I needed it.", "Date": "February 8, 2013"}, {"Title": "Didn't work at all", "Author": "Moondoggy \"Moondoggy\"", "ReviewID": "R2WKH2T4OD3A8A", "Overall": "1.0", "Content": "Mine arrived in not working condition.  I tested it and it had zero volts.So I had to send it back for a refund.  Waste of time.", "Date": "February 5, 2013"}, {"Title": "NOT AS SHOWN", "Author": "Mi2sense", "ReviewID": "R1O6Y04TG6WVE4", "Overall": "1.0", "Content": "Do not buy this item as you will be sent a much cheaper item that is nothing like this one. I will be happy to post pictures of what I received.", "Date": "January 26, 2013"}, {"Title": "Perfect", "Author": "Love2Shop", "ReviewID": "R16NDI18MR7V7U", "Overall": "5.0", "Content": "I use this to power 4 outdoor barn cameras. It eliminates the wads of wires, etc. It works exactly as it should. Money well spent!", "Date": "January 24, 2013"}, {"Title": "Great idea for the money", "Author": "Izz", "ReviewID": "RWHZHLLMTXETK", "Overall": "4.0", "Content": "People who think of ideas like these deserve to be promoted. Instead of 4 separate power supplies, now I only need 1. Great forsight. Haha.", "Date": "January 21, 2013"}, {"Title": "power supply with 4 connectors", "Author": "lcruse", "ReviewID": "R3CS77O33DTFF8", "Overall": "5.0", "Content": "this is the route to go if you want to get rid of all the wire clutter.it works great and helps clear up space.i would recommend this item.", "Date": "January 8, 2013"}, {"Title": "I give this a 5 star for sure", "Author": "SheriffJoe", "ReviewID": "R11ZRK96P7GQNI", "Overall": "5.0", "Content": "Nice high quality product. The BNC fittings are first class and fit tight. The wiring is also of good quality.The only thing they could add to this product is a small red led to let you know all is well, power is on.Not a complaint, just saying.I give this a 5 star for sure, same for the seller.", "Date": "January 4, 2013"}, {"Title": "Works great!", "Author": "Mary and Charles", "ReviewID": "R1BBL163QE9PDK", "Overall": "5.0", "Content": "Been using this for several months, and so far so good.No problems at all.  Great from day one.  Recommended.", "Date": "December 25, 2012"}, {"Title": "Works Fine", "Author": "E. Petter", "ReviewID": "R1SVFJOWYX1H8H", "Overall": "5.0", "Content": "VideoSecu 12V DC CCTV Security Camera Power Supply Adapter with 4 (2.1mm) Channel ConnectorsTraded four outlets for one. Works fine. I'm glad I found this. I will buy another.", "Date": "December 19, 2012"}, {"Title": "works good", "Author": "Andre", "ReviewID": "R2MR3IY8B1PQGW", "Overall": "5.0", "Content": "plug and play real fast works well installed easy powerd all my cams and was as i said simple and easy.", "Date": "December 14, 2012"}, {"Title": "Multiple camera hookup.  Saves additional bricks.", "Author": "Dr. Dave \"Dr. Dave\"", "ReviewID": "R3LK2FUXDP0IHU", "Overall": "5.0", "Content": "This product is well constructed with the best materials and excellent workmanship.This is a recommended product for you to purchase.", "Date": "December 11, 2012"}, {"Title": "Excelent!!!", "Author": "Rony A Simancas F", "ReviewID": "R36AZ6V2UYW1L0", "Overall": "5.0", "Content": "ES UN EXCELENTE PRODUCTO C O N CALIDAD GARANTIZADA LO RECOMIENDO CON LOS OJOS CERRADOS 100 % DESDE VALENCIA, VENEZUELA", "Date": "December 11, 2012"}, {"Title": "Works fine!", "Author": "tman", "ReviewID": "R1II075SIE18RZ", "Overall": "5.0", "Content": "I bought this power adapter so that I can add two more cameras  to my 8 channel DVR that came with four cameras. The adapter felt light so I was afraid it may be an inferior product and would fail rather quickly but I have had it close to a year and it has been working fine.", "Date": "December 9, 2012"}, {"Title": "Did the job for me", "Author": "Nick LeBreaux", "ReviewID": "R6WKWJSB5OFMR", "Overall": "5.0", "Content": "Used this on a three security camera setup and it has worked fine with no problems. I am well pleased with this power supply.", "Date": "December 6, 2012"}, {"Title": "works with my new Zmodo camera", "Author": "Charles B. Firth \"Chuck\"", "ReviewID": "R2IPIE26FWJ72V", "Overall": "5.0", "Content": "Got this for a new Zmodo camera I was adding via a switch to my 4-channel security setup. It leaves me 3 extra feeds if I need them.", "Date": "November 28, 2012"}, {"Title": "security camera power supply adapter", "Author": "William", "ReviewID": "R2AUR52SGXIA5E", "Overall": "5.0", "Content": "very easy to hook up elimated four plugs ins great product i would highly recommend this to everyone with a security camera system.", "Date": "November 5, 2012"}, {"Title": "works very good", "Author": "Desert Creatures", "ReviewID": "RQNUZ3WS9OU9S", "Overall": "4.0", "Content": "I used this power supply with Lorex security cameras to minimize the amount of wiring and transformers. It connected like a factory part and works well. I would've given it 5 stars if the 12volt connector wires were a bit longer.", "Date": "October 26, 2012"}, {"Title": "The only way to go!", "Author": "MPB West Hills", "ReviewID": "RTNVRSWM4HEG4", "Overall": "5.0", "Content": "Before I got this product, I had so many adapters and power strips it was ridiculous. This adapter works perfectly. It powers four cameras without all the clutter. I bought two for my eight cameras. Wow, huge difference in simplifying my security system area.", "Date": "September 20, 2012"}, {"Title": "Good and cheap", "Author": "Jojo", "ReviewID": "R1Q0E3KF37OTP0", "Overall": "5.0", "Content": "This cheap but good power supply is greatfor camerasandother devices using 12v dc industry standard 2.1mm plug. Itis plenty of power for several surveillance devices with 2000ma.", "Date": "September 18, 2012"}, {"Title": "good product", "Author": "RobertJ", "ReviewID": "RU9T7G43D6957", "Overall": "4.0", "Content": "This product works as advertised and powers four cameras well. I would recommend this product to all. And the price is reasonable.", "Date": "August 10, 2012"}, {"Title": "Pretty good for the price, but it should be a 3+amp power supply", "Author": "JD", "ReviewID": "R1OBGDHSSUD8X2", "Overall": "3.0", "Content": "I have several of these systems running and needed the expansion camera power supply adapters. But I find that most of the system struggle with only 2A power supply when using extensions.Q-See OEM -- if you are reading this, I like your product over all, but I would happily pay $1 more if you could bump this up to 3 or 4 or even a 5A supply.Also to note (that I will post in another review), the IR LED's in the cameras are just a tad bit too far into the visible spectrum. I'd rather my sites don't see the red glow coming from the cameras and just have a bit more of the invisible spectrum used.", "Date": "July 24, 2012"}, {"Title": "MUST HAVE", "Author": "James TC-AZ", "ReviewID": "R3CQE7BW94M61K", "Overall": "5.0", "Content": "Ill tell you, you need this device if you want to avoid massive wires and powestrips. Now i see the system that i bought \"CIB\" now sends this with the purchase of the security unit. Now if your like me and bought this before they started sending them out i would definatly buy this. This device has helped me out greatly and i see no difference in the picture or quality. Great little thing if you ask me.", "Date": "July 6, 2012"}, {"Title": "works as advertised", "Author": "M. Spiller", "ReviewID": "R3RSNG3AEZ6VKL", "Overall": "5.0", "Content": "This powers four of my cctv cameras and frees up a lot of outlets.  I have two of them removing a lot of wires from under my desk.", "Date": "May 27, 2012"}, {"Title": "Power adapter for CCTV cameras", "Author": "Lee Jenkinson", "ReviewID": "RTHETMZXY7T4N", "Overall": "5.0", "Content": "Good price, good quality and good service. No complaints from me. I will do business with this vendor any time I need anything else.", "Date": "May 26, 2012"}, {"Title": "Worked perfect", "Author": "Jack", "ReviewID": "R3T1XA98RASPQD", "Overall": "5.0", "Content": "This adapter worked perfect and exactly as it was supposed to.  It's nice to be able to power four cameras using only this one adapter.  It would have been so much more difficult if I would have had to find four separate outlets to power the cameras.  This adapter was just what I needed.", "Date": "January 11, 2012"}, {"Title": "Works great and its the right price", "Author": "Nylox", "ReviewID": "RMMUD9R5MAC1A", "Overall": "5.0", "Content": "After upgrading my surveillance system and purchasing additional cameras, I found that I was overwhelmed with individual power supplies.  These cleaned up the mess of wires I had going on without the need to purchase and install a power distribution cabinet.  They provide the clean power I needed and so far have worked quite well.  There is very little noise and the power appears to be quite clean.This has been a great value so far.", "Date": "November 15, 2011"}, {"Title": "Power adapter  as advertised !", "Author": "Bear402 \"bear402\"", "ReviewID": "R2YUXB7ON3LYXS", "Overall": "4.0", "Content": "Item arrived quickly . Power supply will run up to 4 cameras, depending on  individual camera power requirements. Customer service and satisfaction is obviously a priority at Electrodisc. !", "Date": "October 24, 2011"}, {"Title": "Cheap junk, not UL listed, improper labeling, I won't trust it to run unattended", "Author": "A.", "ReviewID": "R2BT79Y140MQJ3", "Overall": "1.0", "Content": "This power-supply is a cheap knock-off. It does not have proper labeling like most power-supplies sold in the USA (e.g. it does not say what Class powers supply it is, class 2 or class 3 or whatever)  and it is not UL listed. the top cover is loose and feels cheap. This may be nit-picking but consider this: for home security applications this device is going to be plugged-in all the time,  unattended in a cabinet somewhere. Exactly the kind of situation where you cannot afford to have a melt-down or overheat or worse. There's a reason we want UL listed power supplies, for safety.", "Date": "June 30, 2013"}, {"Title": "Works very well", "Author": "Kamran", "ReviewID": "R385H2AIRDCPC4", "Overall": "5.0", "Content": "This plug saved me from buying a outlet strip.  My cameras are working well. I would buy this item again. At a fraction of the cost of four plugs it,s the best deal.", "Date": "January 26, 2012"}, {"Title": "will fry cams...under powered", "Author": "B. Moon", "ReviewID": "R18VNKGMP8FQFN", "Overall": "1.0", "Content": "I thought this was a great idea so I got it.  It promptly fried 2 cams as I was plugging them in. This power supply (PS) puts all the voltage to a single outlet when plugged in, then divides accordingly per camera, in other words, it doesn't regulate the outputs.  Had I plugged in all 4 cams THEN plugged the PS into the 120 volt outlet, I thinks things would have been okay.  A (PS) unit like this should have its power outputs isolated and regulated, period! Units of higher quality will typically do this.  I have many guitar pedals that run off of a single 9 VDC (PS) similar to this one that do in fact isolate and regulate the way it should be done and I've never had an issue using one or two of 8 or so outputs on pedal costing $100's, some of which are connected to PC based recording equipment. Regardless, when all 4 cams are plugged in, the two 100' (16GA solid copper wires) runs are grossly under powered resulting in poor image quality and the IR will not work at night causing the those cams to go offline unless there is a light source in the field of view of the cam.  With individual PS's, this has simply never been an issue for the past 3 years, (I got this 4 in 1 unit to save outlet space).  Last night, 3 of the 4 cams went offline for no apparent reason and an acrid smell of burning electronics was emanating from the dedicated PC that hosts the cams.  Now I have NO security system and a lot of money up in smoke.  For sure, the DVR is toast and until I can get my system back online, I will not know if the cams survived this. This $19 PS (POS!!) may have just cost me a $1,000 in fried equipment!  AVOID AT ALL COSTS!! Buyer beware!Update 01/04/2012:  Someone commented that it is impossible for the host PC to have been damaged by back-feeding current.  While I agree it is highly unlikely and I'm no electrical engineer, but this setup did in fact fry the USB circuits on the motherboard rendering the $1,800 PC useless until costly MoBo is replaced. I have since done away with that entire configuration and went with a dedicated Linux based 4 port CCTV DVR purchased from Amazon and went back to 4 individual power supplies and have not had one second of down time in the past year.  As for the \"old\" PC, it's collecting dust in the garage!", "Date": "January 10, 2011"}, {"Title": "not working for my new camera system", "Author": "Kenny", "ReviewID": "R2O8DWU2AA6VLE", "Overall": "1.0", "Content": "I have an old video camera, and need these to convert to my new digital camera, I connected these to my new system and not working at all, not sure why", "Date": "December 6, 2013"}, {"Title": "The out put wired connections are too short.", "Author": "Rodney A. Watson \"rawdawgy\"", "ReviewID": "R36EVSV1SZRJ3R", "Overall": "2.0", "Content": "The lead from the output is less than 24\" long and the leads are less than 6\" long so you have to put the power supply on the shelf with the DVR instead of on the floor. Some one screwed up by trying to save 5 cents and not adding 6\" of lead wire to the output length.", "Date": "June 30, 2013"}, {"Title": "My dog loves it. You believe that me tell you another", "Author": "redbmw4545", "ReviewID": "R199DM6NCUOFUC", "Overall": "5.0", "Content": "I needed a muzzle to keep my dog from biting self, especially his tail. Come to find out he has an allergic reaction to the dog food. We were feed him. We took him to the vet. They appreciated the muzzle because he does not like people touching his tail. Can't blame him. I don't want no one touching my tale. Either. Ha ha", "Date": "February 3, 2013"}, {"Title": "It's soo nice getting rid of all those wall warts", "Author": "Rich B \"Richb1228\"", "ReviewID": "R1W0WXXEA1DE4M", "Overall": "5.0", "Content": "Very nice power supply this really cleans up a camera installation all u need is one outlet to power 4 cameras highly recommended", "Date": "December 14, 2012"}, {"Title": "WORKS", "Author": "patel123", "ReviewID": "R14V2KXPCNB08A", "Overall": "5.0", "Content": "this product does what it says, these are way better then the original cctv power boxes. i had to replace the old box with these", "Date": "December 11, 2012"}, {"Title": "So far so good...", "Author": "RandyO", "ReviewID": "R21W6DA599A7FS", "Overall": "5.0", "Content": "Running a full compliment of devices (4 cameras, had to use additional for DVR)..I did give 5 stars but it could use a couple tweaks..There are only 4 leads on this thing... DVR plus 4 channels = 5 leads needed.  Still stuck using 2 outlets and if you are on battery backup? well two transformers are a PITA..I think it would be a nice touch to make the leads removable (would allow for different lengths too)", "Date": "October 30, 2012"}, {"Title": "It's a Prank if you buy this", "Author": "Houdini Jr", "ReviewID": "R34DD1PYKHUT2R", "Overall": "1.0", "Content": "The tin can was worth more than contents. Good routines in book but product cheap stuff. As a kid I liked SSAdams much better.", "Date": "December 30, 2013"}, {"Title": "Fuente de alimentación para cámaras de seguridad", "Author": "Wilson Sanchez", "ReviewID": "RTPAZW0KQAPJK", "Overall": "5.0", "Content": "Excelente producto!!!Tengo un sistema Q-See QR414 4 Channel Network DVR, sistema de 4 cámaras de seguridad y vigilancia para mi casa, muy buen dispositivo, pero el problema con las cámaras es que requería un adaptador de poder para cada una. Este adaptador suministra corriente a las 4 cámaras al mismo tiempo. Además del ahorro de energía, solo necesito un conector.Lo recomiendo!!!", "Date": "September 23, 2010"}], "ProductInfo": {"Price": "$94.95", "Features": "12V DC Regulated CCTV Power Supply\nFour 2.1mm DC Output Center Positive\n4 Camera Power Supply 2 Amp Total Output\nSimplifying the Installation Process\nEliminates the Bulky Wall Mounted Power Supplies", "Name": "VideoSecu 12V DC CCTV Security Camera Power Supply Adapter with 4 (2.1mm) Channel Connectors Port PW154 1I0", "ImgURL": "http://ecx.images-amazon.com/images/I/41qcTYo01sL._SX300_.jpg", "ProductID": "B002WM8ZV0"}}