{"Reviews": [{"Title": "And, there was much happiness...", "Author": "Matthew Marlowe", "ReviewID": "R25YUCCT49I5N1", "Overall": "5.0", "Content": "I'm not normally a fan of SATA drives, I've worked extensively with SAS/SCSI drives for servers/etc for the last 20 years and only used ATA/SATA when required.Still, I've had some projects come up recently where the only option was SATA and high capacity was required.After some bad experiences with the WDC Cavier Black 2TB, I gave the RE4 a try.  It's been great.  I've now had 5 of them running for the last six months and the SMART monitoring reports still show the drives as in almost new condition...no errors, no need for sector changes, no unusual increases of load cycle counts, etc.  Performance has also been very good....surprisingly good for a mere 7200rpm device.  Not to mention, the drives seem to work nicely in both software and hardware raid.  I'll probably end up buying another 5 of them soon.I'll be very happy if I can keep the failure rate to under 4%/yr....this historically is a good rate for SATA/ATA.I'm not sure what to think about WDC.....I generally prefer seagate, but the RE4 drives certainly seems to be able to back up its claim as an enterprise SATA drive.", "Date": "March 8, 2011"}, {"Title": "Big Daddy with huge cache", "Author": "K. Heim \"Klaus M. Heim\"", "ReviewID": "RTK5EKGCO8GNH", "Overall": "5.0", "Content": "I was skeptical at first.But I bought two, and put in a RAID1 mirror config, in a 8-drive raid box with 2 x multilane infiniband interfaces and a RocketRaid card.The 64MB cache is noticeable, totally.  It is not hype. On average, I get 100MB/sec copying across a gigabit network in the LAN from one machine to this RAID volume.  In a similar test (using the same source machine, to a volume of 750GB AAKS', I get ~82MB/sec across the wire.  Again, the cache is noticeable in my tests.I am amazed at the quality of this drive.I recommend these drives to anyone who needs to use a RAID config, and needs capacity, and reliability.I only use WD, period.I currently own 46 hard drives, all WD.The only WD hard drive I ever had fail, was a green 750GB one.The older AAKS series was phenomenal, and these are the new ones to get!(I have had drives fail a great deal using other manufacturers)appdevman", "Date": "March 23, 2010"}, {"Title": "Solid Performer at a Fair Price", "Author": "P. Levine", "ReviewID": "R2LT284I3VWQXM", "Overall": "5.0", "Content": "I bought this to replace a Seagate backup drive that lacked enough room for drive images. The WD5003 is quiet and speedy and comes with a 5-year Enterprise warranty. No problems with it at all.Buyers have been complaining about Amazon's poor bare-drive packaging in many of the reviews I've read. However, this drive was packaged properly in a box of its own made by WD, with plastic end caps suspending the drive over the bottom of the box. This package was put in another box with the rest of the items I ordered and a couple of air pillows. Perhaps Amazon has listened to the well-founded complaints and revised their bare-drive shipping accordingly. Then again, it might only apply to this particular hard drive.", "Date": "January 29, 2011"}, {"Title": "Do not buy this drive from XBRdepot on Amazon!", "Author": "Phil", "ReviewID": "R3HBS5R5H0EVHK", "Overall": "1.0", "Content": "Do not buy this drive from XBRdepot. For starters, this is the cheaper WD1502FYPS RE4-GP drive and the drives they sent me were pulled out of an external enclosure, model WDBAAU0015HBK-NESN which is the WD Elements Desktop. That drive carries a 1-year warranty as opposed to the 5-year warranty these drives should carry by the model number this vendor is trying to sell. CHECK YOUR SERIAL NUMBERS ON WD's WEBSITE AS SOON AS YOU GET THE DRIVES!!! This will ensure you have received the proper drives and allow you to fix the problem before you are stuck with them. Don't be a victim of fraud!{...}", "Date": "December 28, 2011"}, {"Title": "fast and reliable but amazon shipped me a non-new disk", "Author": "Gene Fowler", "ReviewID": "R3U6E3YBVZXKLR", "Overall": "4.0", "Content": "I ordered 4 (amazon prime fulfilled) and one of the disks appears to be refurbished, not new. It was not packaged in a WDC factory box and when I try to register it with WDC the page says \"No Limited Warranty\". The other 3 came in an original factory box and I was able to register the 5 year warranty. Whenever you receive a drive you should register the warranty to make sure it is fully covered -- 5 years for RE4s. I own 26 of these drives (12 bought from amazon) and like them. But shame on amazon for pulling a trick like this.Amazon is sending a replacement and it should arrive very shortly. Assuming it is a new drive I will revise this review and update the rating.Update: I received a new replacement drive and was able to register the 5 year warranty.This drives are fast for a SATA II drive. In a 6 drive RAID 6 configuation using a 4805SAS 8CH Sas Raid Ctlr Sgl Pcie 256MB Sas/sata/sataii HD Rohs controller (write-through with battery option) I get 360-380 MB/seconds R/W as measured with the ATTO Bench 32 program.", "Date": "May 2, 2012"}, {"Title": "Test your New HDD before using it", "Author": "R. Lloyd", "ReviewID": "R1SKWQNF7ME3UM", "Overall": "1.0", "Content": "I installed the HDD, initialized it under Win 7/64bit and ran Western Digital's Data LifeGuard (from their website as a free download).  Drive passed SMART test and short test.  I then ran the extended test twice.  Both times, the test aborted due to an excessive number of bad sectors.  I returned drive and asked amazon to send a replacement.The replacement drive was sent with NO protective packaging and their shipping method did NOT meet Western Digital's requirements for shipping hard drives. I posted picture of how drive was shipped.  The drive is on its way back.  A third drive has been ordered.I'll update review when I receive and test third drive.EDIT 27Nov2012:  The third drive passed all WD LifeGuard tests, was installed into the new desktop, and has been operating perfectly.  This third drive has a \"5 star rating\".", "Date": "September 27, 2012"}, {"Title": "WD RE4 Drives Rule", "Author": "J. Kinsey \"ptchfrk\"", "ReviewID": "R27SCPLL7R9SKP", "Overall": "5.0", "Content": "Western Digital RE4 drives are the best bang for your buck regardless of capacity period! When I build a desktop computer, and I have built many, I utilize WD RE4 drives exclusively. Enterprise class drives just can't be beat. The 5 year warranty speaks for itself. The only way I could be made happier would be if Western Digital would make a 6Gb version. These 3Gb drives, when utilized as primary drives, boot quickly with their 64MB of cache and I have yet to receive a DOA unit when bought through Amazon.", "Date": "May 15, 2011"}, {"Title": "Perfect little drives - work out of the box", "Author": "D. Dean", "ReviewID": "R2PE694GVMXYQQ", "Overall": "5.0", "Content": "Purchased these drives for a RAID 1 array paired with a Synology 211 NAS.Synology DiskStation 2-Bay (Diskless) Network Attached Storage DS211 (White)  These drives have the TLER function for running in a RAID array and are listed as compatible and recommended by Synology.  The failure rate of these drives are extremely low because they are < 1TB (larger drives tend to have higher failure rates at the time I am writing this review).  Also, since these are part of the Enterprise line of hard drives, the MTBF is considerably higher than the consumer class drives.  Perfect for a NAS with precious files!!!Consistency/Parity check and S.M.A.R.T. check passed no problem on two drives purchased.  Each drive arrived in a cardboard box (sealed with packaging tape).  Inside each box was a single drive inside of sealed anti-static packaging, with plastic risers encasing the drive so it wouldn't bang around during transit.  I wish every drive shipped this way!  No screws, cables, etc.. didn't need them.  If you do, be sure to order some!", "Date": "June 21, 2011"}, {"Title": "Very reliable so far (6 mo.)", "Author": "Tech Ed \"Tech Ed\"", "ReviewID": "RXC8MRIMM1I6R", "Overall": "5.0", "Content": "I purchased four of these drives for use in a Thecus N4200 NAS. All four of them are working without any problems to date (purchased in December 2010). I chose these drives because of the support for RAID configurations and the 5-year warranty. The NAS is used for backup purposes only but I wanted decent performance and reliability. So far, I have both.", "Date": "June 26, 2011"}, {"Title": "Great drive", "Author": "Bacchus", "ReviewID": "R2Z8T77LDV573P", "Overall": "5.0", "Content": "I got this drive at a bargain price to install on a Mac Pro tower after I shifted the older existing drive for use as an onboard back-up drive. I waited a bit to post this review, to see how it performs. So far it's been awesome.NOTE TO MAC USERS: READ THE INSTRUCTIONS ON WD's WEBSITE CAREFULLY BEFORE INSTALLINGNot having installed an internal drive in a few years and used to Mac's usually simple plug-n'play nature, I hastily (and idiotically) installed the drive without taking the time to read the simple but detailed instructions on WD's website. Consequently, although I formatted it for Mac with disk utility, I neglected to do the critical PARTITIONING required first. This is necessary to eliminate the tiny PC-formatted boot partition on this drive that will confuse your Mac upon start-up. Failure to do so resulted in a nightmare of hang-ups on restart until I figured out how to force a clean boot using an emergency disk, safe mode, etc--a very precise operation--at which point I was able to partition and format it properly. After that it ran perfectly.", "Date": "January 10, 2014"}, {"Title": "Extremely reliable and great price/reliability ratio. The only 7200RPM class drives I purchase, period.", "Author": "Kevin Sipma", "ReviewID": "R2W1YDDSVJ7Q8M", "Overall": "5.0", "Content": "The reliability of these drives are second to none. I have over 20 of these installed in my servers in a datacenter cabinet and they all run great on my Dell PERC6/i. I move lots of data all day long serving up webpages to clients, and cloud hosting applications. So for the price/reliability ratio you're getting with these drives, I can't find a better product.As a matter of fact, I ONLY purchase and use Enterprise class RE3 and RE4 drives from WD, when I'm not needing SSDs or 10-15k RPM drives.", "Date": "December 3, 2013"}, {"Title": "Great drive for server RAID", "Author": "Mathias A Gibbens", "ReviewID": "R1VJB6GVZILQBM", "Overall": "5.0", "Content": "This is a great drive for using in a RAID setup. Runs fairly quiet and plenty fast for my needs. Comes with a five year warranty and enterprise quality from Western Digital.One word of warning: make sure to immediately register your drive with Western Digital when you receive it to make sure you get the full warranty. Some of the sellers in the Amazon marketplace are shipping OEM or previously returned drives, which Western Digital WILL NOT warranty.", "Date": "May 31, 2013"}, {"Title": "Be careful who who purchase from", "Author": "hghroller711", "ReviewID": "R25JLR1B0RUKCY", "Overall": "1.0", "Content": "I purchased a WD5003ABYX through an Amazon third party (by agreement will remain nameless (Sorry)).  The drive I received arrived well packaged and in excellent condition.  I decided that before I open the static guard protection bag that I would register the drive on Western Digital's website.  To my surprise, WD would only cover the supposed 5 yr warranty for 17 months.  Their explanation is that the drive was sold as a \"REPLACEMENT\" drive for another customer and that the warranty would not be covered for the full 5 years.  I brought this to the attention of the reseller and they told me the drive only had a 90 day warranty but he would be willing to cover the drive for three years. I told him that what I purchased was a NEW drive that is advertised with a 5 year warranty and that's not what I was sold.  I demanded my money back in full and a call ticket to return the product.  After a brief negotiation, that resulted in my agreeing to keep them nameless in any reviews, they agreed and waived the 20% restocking fee and paid to have the drive returned.To make a long story short, if you're not purchasing direct from Amazon, look elsewhere.  Stick with a reseller that is reliable and has a stong reputation in the marketplace for service.  Do not buy from a third party reseller.  Save yourself the time and grief.  You may pay a few more bucks but it's worth it.", "Date": "April 29, 2012"}, {"Title": "Out of the Box Functional and Working as Expected", "Author": "W. Moncure", "ReviewID": "R39H320IPGFAIW", "Overall": "4.0", "Content": "I just purchased this WD 500GB Enterprise HDD from Amazon, and had it delivered Amazon Prime. Out of the box, the drive worked excellent and after a full format the drive is serving excellent as a secondary storage drive, running next to my 64GB SSD.Windows 7 64, my motherboard, and my PC had no problems identifying the drive. Like any new HDD install, I had to go into the disk management menu and create a new partition / drive. After that I started transferring my media collection and downloads that I don't run from boot (or on an everyday basis) to the new drive.As a secondary drive this product should be excellent. So far it effortlessly streams my 1080p media and provides me fast and accessible storage for my extensive photo and music collection. Having 64MB in cache, as I understand it, allows the HDD controller to grab information before it's needed based on past actions. Assume you're streaming a high-bitrate video - the extra cache allows the HDD controller to grab and then store or \"cache\" the information that will be needed before it's needed by the video program you are running. I am sure this explanation is rather simple, and certainly the amount of cache is probably overkill for what I do - watching media and running typical Win7 programs - but it's nice to have.Certainly the strongest benefit of owning this drive is its \"Enterprise\" classification. What this means is that you have business-grade or enterprise-class quality and a five year warranty. While others say that this drive is not for standalone, single-drive (non-RAID) configuration, I don't see anything anywhere that indicates it cannot be used for this or does not perform perfectly as a standard workstation drive in a single-drive-access configuration.It's as easy as plug-and-play should be to get this drive going - and the comfort of a five year warranty is a big plus. The 7200 rpm access speeds are perfectly adequate for my needs, and the SATA 3GB/s standard is probably much faster than the actual read/write speeds you'll get with the drive. What I'm saying is that the drive exceeds the standard by its SATA interface, but the actual drive data exchange between the PC and the drive will probably never reach that 3GB/s in normal everyday use. In other words, over-engineering is not overkill but a strong benefit!I anticipate minimal problems with this drive - I have had much success with the WD Green series of 5400 rpm drives in the past. Also all I get from my Lian-Li PC-A04 case is a quiet hum when it's running - pretty quiet considering it is a magnetic drive.In short I see no negatives other than the price premium - which really is offset by the following benefits:1) Five year warranty by directly registering the product with WD.2) SATA 3GB/s interface3) 7200 RPM4) WD reputation for quality5) Enterprise-quality build6) 64MB in cache7) immediate visibility and seamless install in Windows environment", "Date": "August 7, 2012"}, {"Title": "Weapon of choice for whitebox RAID deployments.", "Author": "Joshua G. Feldman \"Technophile\"", "ReviewID": "R3BBS13M4Q5H8S", "Overall": "4.0", "Content": "I have 34 of these WD RE4 2TB drives in production at work, in Promise Vtrak J610 shelves connected via LSI SAS cards, and have another 26 about to go into production in new systems I'm building using SuperMicro cases and motherboards and LSI cards.  In big RAID systems you must use hard drives manufactured to support RAID operation, particularly in regard to error recovery timing.  Desktop hard drives take a long time to perform error recovery - which causes problems in RAID systems leading to data corruption and premature flagging of a drive as bad.  These WD RE4 drives use a feature called \"Time Limited Error Recovery\" to prevent a drive in error recovery from being dropped by the array.  Supposedly enterprise drives are built more vibration tolerant to handle the stresses of being operated in a drive shelf.In any case, over the past year one of the Vtrak shelves loaded with 16 RE4 drives behaved flawlessly and the other one lost 4 drives in a single episode over a 48 hour period about 6 months into deployment.  My experience is, thus, mixed.  However the price per spindle is dramatically better than using branded drives from HP, Dell, or the other major storage vendors.  My advice is to use RAID 6 and designate 2 hot spares per shelf.Other than this single episode with 4 drives dying in short temporal proximity, these drives have been fine.  Their performance is good.  In the large array they provide large storage at a decent price with acceptable performance.  Prices have risen dramatically because WD's Thailand operation was damaged by the Fall 2011 flooding in Thailand.  Prices will probably go up further until production levels are restored sometime in mid 2012 or so.UPDATE - after the subsequent review warned about getting a pulled drive I looked at my last one (purchased 12/11/11).  It is a mint sealed WD2003FYYS-02WB0 RE4 drive.  My recent purchase was legit.", "Date": "December 27, 2011"}, {"Title": "Solid Drive", "Author": "mhs", "ReviewID": "R2YPWT7Z45B79A", "Overall": "5.0", "Content": "Purchased 3 of these for a new RAID enclosure and they have worked flawlessly for the last 12 months. No issues whatsoever. I'm looking to purchase one additional drive to have as a hot backup because, well, we all know these things don't last forever and a little extra redundancy doesn't hurt.", "Date": "March 26, 2014"}, {"Title": "Good Drive but Amazon version fails in RAID 5.", "Author": "Jeff", "ReviewID": "R2G229QIUZ31EB", "Overall": "2.0", "Content": "I have no idea what is up with the Amazon version of this product but the quality is terrible. Sit down and I'll tell you a story about how many versions of this disk I have tried for use in my RAID 5 array.First, I bought a refurbished version of this disk off another site. It eventually failed making me never buy refurb drive again.To replace it, I figured I'd buy this one off of Amazon. The first disk they shipped me was DOA and had a very loud rattling sound when it spun up.I returned that disk and got the current one I have. I spent two days rebuilding my array and then it failed a few days later. It occasionally boots with the other two disks in my RAID 5 array but usually is just dead weight. I haven't decided whether I'm going to try one last time on Amazon or buy it off another site where I got my other two drives.", "Date": "March 8, 2014"}, {"Title": "Great drive for the money", "Author": "David R. Riley", "ReviewID": "R2Y377XTTQ8VOQ", "Overall": "5.0", "Content": "The drive is fast for a mechanical drive.  I like that it is one of the few with a 5 year warranty left out there and if it makes it for 5 years of hard work it will have done a fine job for sure.  I have had good experience with Western Digital drives in the past and trust them.", "Date": "February 25, 2014"}, {"Title": "Good speed, reasonable price", "Author": "S. Stokes \"geek on the road\"", "ReviewID": "R2V37OODLLRBT2", "Overall": "4.0", "Content": "I was looking for a faster drive than the standard Seagate that came with an iMac I recently acquired. This fit the bill nicely, the 64MB cache is certainly faster and the machine is booting and loading programs considerably quicker than before. A couple of tests show higher speeds.This certainly isn't anywhere near SSD speeds, but is an improvement over what comes in the mid-2011 machines. Little warning, if you're buying this for an iMac, changing out the drive requires more work and disassembly than the old PC's, so be forewarned.", "Date": "February 10, 2014"}, {"Title": "tried and true", "Author": "j. lee", "ReviewID": "R2N5JU66KQ6OYW", "Overall": "3.0", "Content": "To the best of my knowledge, the RE4's are end of life in the sense that WD has stopped using the name RE4 for their enterprise drives.  I believe they just call them RE drives now.  Anyway, I've used these for various servers and system builds mainly for environments that require RAID.  They are peppy enough for what I need and their URE ratings are better in my opinion to other enterprise drives with regards to how much you pay.  I've used these mainly for RAID 1, 5, and 10 setups and have never had problems.  They do run a hot if you start stacking them in a chassis without a good amount of airflow so keep a look out for that.  Other than that, haven't had one fail yet!", "Date": "January 15, 2014"}, {"Title": "Dud", "Author": "broken product", "ReviewID": "R36BR9Q0HZCCI5", "Overall": "1.0", "Content": "Hard drive was making noise out of the box.  I returned it and didn't get another one.  Price was cheap.", "Date": "January 5, 2014"}, {"Title": "GREAT SERVICE ,BAD PRODUCT", "Author": "Cody", "ReviewID": "R16M8PUMPZS17B", "Overall": "1.0", "Content": "If you count on your system like my company does don't buy this product!After a great review from or IT tech I decided to purchase these drives to replace our older Seagate hard drives before they started to go bad. Since IT has installed the new RE4 Enterprise drives I have experienced 4 bad or failed hard drives in less than a month. This failure rate is unacceptable in any capacity . The customer service was great though! Amazon was fast to respond and replace with very minimal questions . I have since Returned all WD RE4 Drives and opted for a more reliable Samsung 840 Pro SSD X2 in a Raid 1 format. The cost was a lot higher but compared to loosing critical  Design time from bad drives or worse loosing Customers Engineering data it was a small price to pay....", "Date": "October 2, 2013"}, {"Title": "Great for RAID.", "Author": "Version One", "ReviewID": "R9LIVCMKUFMEN", "Overall": "5.0", "Content": "I have 16 of these drives in various servers in RAID 1 and RAID 5 configurations. They do go to sleep depending on the controller and take a few seconds to wake up, but when running perform as expected.", "Date": "September 30, 2013"}, {"Title": "Enterprize grade", "Author": "3300", "ReviewID": "R20D7RXMZ3AT0L", "Overall": "5.0", "Content": "Ment to be always on and works fine. No failures, no data loss.View tips and guidelines  | 7 more words required.", "Date": "September 30, 2013"}, {"Title": "smooth operator", "Author": "Aldebaran", "ReviewID": "R3HMKO3JKY3E7C", "Overall": "5.0", "Content": "Although it will be years before I know if this is a good drive or not (looking for sturdy longevity), so far this drive is quiet and trouble-free.", "Date": "September 22, 2013"}, {"Title": "WD RE4 Drives Are Awesome!", "Author": "D-Linkster", "ReviewID": "R31ICAKN11H3RU", "Overall": "5.0", "Content": "I purchased two of the drives from Amazon itself through Prime, not from some other reseller on Amazon. The drives came in Amazon's Frustration-Free Packaging and were packaged remarkably well. The drives are incredibly fast. I have them in a RAID1 array on a ServeRAID 8k on vSphere 5.1 Hypervisor. I regularly receive 100 MiB/sec transfers from these drives on my Gigabit network. The relatively large cache (64 MiB) allow the drives to run with amazing speed. The drives cache coupled with the ServeRAID's 256MiB cache allow the server to run incredibly fast.I have used Western Digital drives nearly exclusively since 1997 and will always recommend them. These two drives replaced two IBM 74GB SAS drives . They are very quiet and run cool, albiet at 7200RPM instead of 10000RPM as the SAS drives they replaced ran.", "Date": "June 13, 2013"}, {"Title": "Rip Off...used/repackaged drives", "Author": "Michael J. Fish \"macjacfish\"", "ReviewID": "RTV6BLDMUXFWS", "Overall": "1.0", "Content": "Just received my drive and it is a used/repackaged drive.  The drive is NOT in the original metalized plastic but has been put in another bag.  Also, these drive have a five year warranty...but wait...the manufacturing date on my drive is 2011!  1/3 of the warranty is already gone.Don't get ripped off...stay away from this company.", "Date": "April 24, 2013"}, {"Title": "Duribility and speed", "Author": "Richard Baker", "ReviewID": "RCX8D1N9ZLSZT", "Overall": "5.0", "Content": "I purchased this to replace a primary drive (win 7) on a homebrew quad Asus machine that I use to visually simulate flow dymanics in realtime, this machine runs 24/7.  The drive has plenty of room, I trust WD more than the SG guys.  When you replace the drive use the Free WD image software \"Acronis True Image WD Edition;at the WD site\" and depending on the amount of data to be transferred 15 minutes including setup is reasonable to expect.  I am using it under SATA II and everything is great.", "Date": "July 17, 2013"}, {"Title": "NAS RAID 1 application", "Author": "mbw", "ReviewID": "R2N3DFACDDCA7J", "Overall": "5.0", "Content": "Bought two of these for a D-Link NAS application in which they formated to 914GB each.  They are rated by WD for RAID use so, given their size, I took advantage of the D-Link RAID 1 option. In use it takes a moment for the discs to spin up from sleep mode but then are lightning fast overall in my gigabit network.They registered with WD without problems showing in warranty right out to 5 yrs and one month. I have had zero problems with WD when a warranty replacement is needed which I have had to use in another application.I had no problems with installation and so far have had trouble free service from these drives.  I highly recommend them.", "Date": "June 10, 2012"}, {"Title": "Purchased 2 drives one was DOA", "Author": "Strat", "ReviewID": "R3T07IOYPHRYR", "Overall": "3.0", "Content": "This is the 2nd time in 3days i have had to return a drive back to Amazon and WD.Had a really bad week.Apart from the frustration involved waiting for a return and a refund... the working one a solid and fast drive.Only time will tell if this one dies before i receive my RMAWestern Digital 500 GB RE4 SATA 3 Gb/s 7200 RPM 64 MB Cache Bulk/OEM Enterprise Hard Drive - WD5003ABYX", "Date": "June 10, 2011"}, {"Title": "Failed in 3 months", "Author": "HC", "ReviewID": "RSYK30BL8BYBO", "Overall": "1.0", "Content": "I am furious.I made the switch to enterprise drives 3 months ago, at the same time as I started to go paperless and archive all my paper records digitally. Enterprise drives are supposed to be built to higher tolerances and for 24 x 7 use. Between the Seagate Constellation and Western Digital RE4, I settled on the WD as it still maintained its 5 years warranty. Seagate downed the warranty of their enterprise drives along with their other drives some time ago.Today, my RE4 500GB drive started to make screeching noises as I powered on the PC. The drive could not be detected. This is just after about 3 months of service! It's outrageous. My non-enterprise drives usually last at least 3 years. I am very careful with the drives. My chassis is placed far away from where it could be accidentally bumped against, and I have a HDD cooler and a front 120mm fan blowing on the hard disks to keep them cool.This is ridiculous. I decided to buy the RE4 for its enterprise level of reliability and it turned out to be much less reliable than the consumer grade drives I've used.  Im not going for WD anymore. I will try the Constellation instead.", "Date": "October 21, 2012"}, {"Title": "be careful about 3rd party vendors - warranty is NOT 5 years", "Author": "computerGraphicJunky", "ReviewID": "R3JVBHCVJJ54G5", "Overall": "5.0", "Content": "Bought 4 directly from Amazon.  Each came in a brown box and the serial #s checked out.Looked at buying 2 additional today from Aeon Micro.They replied that although they are new, they only have warranty until 2014, NOT the 5 year warranty that a new drive would have.So ... be careful, as this is very deceptive!!!Be sure to register your drive thru support.wdc.com so that you can insure the serial #s are valid and have full warranty.As for the drive, only use it in RAID as it is designed to NOT heroically correct errors (which is very desirable for RAID).", "Date": "July 24, 2012"}, {"Title": "Good Price, Great Product for server HP Proliant DL180 G6", "Author": "A. Restrepo", "ReviewID": "RK43UFC2F8H0O", "Overall": "5.0", "Content": "I bought two hard drives to add to my company's server, as HP hard drives were over $600 each, i prefered ti get these, WD is a very reliable brand in my experience, and the specs were basically the same.Instalation and setup was no problem, I got them working on a RAID 1 array within 1 hour.I'm really happy with this purchase", "Date": "July 11, 2013"}, {"Title": "So disappointed in Western Digital", "Author": "Mt Airey", "ReviewID": "RV9F4LAYK3LID", "Overall": "1.0", "Content": "The GOOD: In RAID 10, was very fast editing video. Up to this point, I thought Western Digital drives were the best.The BAD: I figured out what RE stands for: REPLACE EVERYDAY. I bought 5 of these for a 4 raid setup for a video editing system, one bought for spare. After about 45 days, one of the drives failed. Ran the WinDlg software and it failed the quick test. RMA'ed and $15 shipping then received replacement from WD. It failed within an hour. Another RMA and $15 more and the next replacement failed. AND another RMA and the replacement lasted two months and a day later one of the other drives failed. You know it takes about a week for the drive to get to WD, then they fool around with it for a couple of days, then send a replacement 3 day air, so about two weeks a drive. Something like 60% fail rate? The big money for five drives and a backplane and time spent setting up this RAID only to have a system that is NOT reliable at all. By the way, the backplane was taken out of the loop and drives connected direct to motherboard for troubleshooting, SATA and power cables also switched out and checked. A good indicator is when drives sound like someone clearing their throat.Conclusion: THIS is ridiculous. LESSON LEARNED: I should have and now will purchase a 500gb SSD which will not only be faster, silent, cooler, a fraction of the space, so much easier to configure and RELIABLE.", "Date": "April 30, 2013"}, {"Title": "Great Buy!", "Author": "Richard Robinson", "ReviewID": "R1J8VUJF2496IA", "Overall": "5.0", "Content": "Screamin' fast drive (thanks to its 64MB cache) at a great price for enterprise performance. I'm using it in a desktop computer.", "Date": "April 11, 2012"}, {"Title": "Good value, good performance", "Author": "ms-waterloo", "ReviewID": "R1ZGU5IM3G1TRS", "Overall": "4.0", "Content": "About a month ago, our small office replaced two green drives in a RAID 1 / NAS arrangment that had been in service for two years with the RE4 drives.  These drives seem faster and I hope they will prove to be more durable.  The cost of the RE4 seems high and at this time, we can only assume it is justfied for \"Enterprise\" reliability.We have six workstations sharing the NAS for CAD file distribution and have had no problems to date.  Set up was easy and our D-Link DNS-323 is again working without incident.", "Date": "February 19, 2012"}, {"Title": "Great Hard Drives!", "Author": "Programming Kat", "ReviewID": "R3MPBVRWMHTLJE", "Overall": "5.0", "Content": "I have 4 of these running in a RAID10 for over a year now with absolutely no problems.  I bought them when they were under $90 and thought that was a steal then...unfortunately I didn't purchase them from Amazon, but it's the same product and I can tell you they are the best.  Not only are they fast and reliable, but they come with a 5 year warranty that you can't beat. I also have a Western Digital 300 GB VelociRaptor SATA 3 Gb/s 10,000 RPM 16 MB Cache Bulk/OEM Enterprise Hard Drive - WD3000HLFS and that puppy is fast [holds 32 bit OSes]...who needs SSD when you can get Readability and 5 year warranties with these RE4s??  And those who seem to have had problems...I'm not sure what the problem is, but contact WD--as I wrote, these puppies come with a 5 YEAR WARRANTY.System:Gigabyte GA-890FXA-UD5 rev34 WD RE4 500GB in RAID 10 using a 3Ware RAID controller1 WD 300GB Raptor [32-bit virtual machines]1 WD 640GB Black [files - audio & video]1 external WD 1TB MyBook [back-ups]AMD 1100T CPUAntec Khuler H2O 920 [CPU cooler]16GB Corsair Vengeance Series 1600 [timing/latency 8]1 XFX Radeon HD 6870 dual fan [video card]Samsung Blu-Ray comboLiteOn DC/DVD writer w/ LiteScribeCreative X-Fi Titanium [w/ Logitech 5.1 speakers]Windows 7 UltimateCooler Master ATCS 840 black case [a work of art!]Corsair Pro Series Gold 850 PSUMy system is stable, fast and data is safe...what more could anyone ask for?  Use it for video & audio editing; programming; listing to music and all at the same time...now that's multitasking!", "Date": "February 11, 2012"}, {"Title": "Nice performance", "Author": "VH", "ReviewID": "R32SX5D6V29JJU", "Overall": "5.0", "Content": "I purchased 6x 1TB hard drives when the price was under $120 per piece. They are now installed in a RAID 10 array and perform nicely.", "Date": "December 20, 2011"}, {"Title": "Fast, Quiet, & Reliable!!!", "Author": "Planettera", "ReviewID": "R1CRL1C25VHPGG", "Overall": "5.0", "Content": "I purchased 3 of these hard drives as an upgrade to the capacity of my older Seagate 500GB 7200RPM 16MB buffer ES2 hard drives. These WD drives run quiet and are causing less heat. To rate the speeds, my PC's boot up time is much faster now compared to the boot up time it took for the Seagates with freshly installed operating system. These WD RE4 drives are booting average 10 seconds faster and are much more responsive such as when accessing large data.I always used Seagate hard drives, and didn't feel the need to try any other. Unfortunately, due to the drop in the quality of the Seagate hard drives, I have decided that it was time give WD a try.  I currenly own 3 WD RE4 1TB, 1 WD 750GB 7200TB 2.5\" hard drives. Using them for about 8 hours a day, I am totally satisfied with the performance of these drives.", "Date": "December 3, 2011"}, {"Title": "2 DOA", "Author": "electrofeline", "ReviewID": "RBMB2N6EPEW12", "Overall": "3.0", "Content": "The specs are nice, but I ordered two for an OS mirror and both were DOA.  Amazon has an excellent return policy, so hopefully the next two work properly.", "Date": "October 21, 2011"}, {"Title": "The best", "Author": "Michael Tiemann", "ReviewID": "RR1DBEAUT8EO0", "Overall": "5.0", "Content": "I bought this drive because I believe it to be the best in terms of reliability and performance.  So far, so good...", "Date": "July 11, 2010"}, {"Title": "Great Hard Drive", "Author": "Steve Hartman", "ReviewID": "R1TQX2X30Y7XII", "Overall": "5.0", "Content": "So far this hard drive has run great and even survived a short in my server.  The customer service from this company was great when I ordered the hard drive.  This is a really solid hard drive for your server needs.", "Date": "June 3, 2014"}, {"Title": "enterprise edition drive, premium price, advertised 5 yr warranty, 1 yr actual warranty w. manufacturer, DIED within 8 months", "Author": "C D", "ReviewID": "R337MS2XYN0WT2", "Overall": "1.0", "Content": "Bought this new in July 2013; by April 2014 it would not access data. In February 2014, it began by throwing strange errors in windows. Windows 7 would not boot at all or it took longer than 5 minutes to boot - previous boot times were about 30 seconds. We tested the mainboard, replaced the RAM, removed all other non-critical components and the machine would still not boot. We eventually downloaded the HDD test tool off of western digital website - the drive would not pass the basic tests.Contacted support (a painful process, it took about 5 hours to create the advance replacement - poor site design giving errors in the interface when attempting to secure the replacement with credit card, emails back and forth with contradictory information).In short, western digital refused to transfer the 5 year warranty to the MANUFACTURER RECONDITIONED drive received as replacement claiming it is the seller's (amazon) responsibility, for carrying old stock.Western Digital should be reported to the appropriate authorities / third parties for false advertising and for misleading the consumer into thinking they received a longer warranty.We will report them in the hope that law is still there - the story they made up that the seller is responsible to fresh stock, that old drives will likely FAIL despite being unused (“new”) and that the consumer should resolve the issue with the seller when it is clearly advertised the unit has a 5 year  warranty with the manufacturer, all create a dangerous precedent, rendering law a useless and ineffective tool.", "Date": "May 31, 2014"}, {"Title": "Great for data center storage", "Author": "Trent Taylor", "ReviewID": "R9RG8Q1Y384LM", "Overall": "4.0", "Content": "When building storage arrays it can get costly going with the SCSI 10K - 15K drives.  We started experimenting with different RAID configurations within our data center and discovered that we can get well above the performance required to meet the demands of our servers requirements without breaking the bank.  These enterprise drives have been extremely reliable.  So far we have purchased more than 50 of these drives and so far things have been great.  The oldest drives are now several years old and still going strong.", "Date": "May 30, 2014"}, {"Title": "It worked good!", "Author": "KEEHYUNG", "ReviewID": "R356PIXGUSGN6O", "Overall": "5.0", "Content": "I inserted this harddisk at HP Microserver Gen8. and installed ubuntu.a noise of harddisk is less than I expected.", "Date": "May 29, 2014"}, {"Title": "We have had no problems...", "Author": "Terrel Pochert", "ReviewID": "RI86DTPTSBMJH", "Overall": "5.0", "Content": "We use the \"Black\" drives throughout our systems including inside our Thecus servers and as second drives on our desktop PCs with no serious problems.  In five years, they just keep going.  We still always don't trust any hard drive.... always keep backups.", "Date": "May 29, 2014"}, {"Title": "5 yr warranty", "Author": "SJP \"PRO\"", "ReviewID": "R6P42ZG8ZZZT", "Overall": "5.0", "Content": "Worked great out the box.A little noisier than most drives I have bought from W.D.Have had it a few months with no issues.", "Date": "May 14, 2014"}, {"Title": "Warranty Issues", "Author": "R. Fernandes", "ReviewID": "R1SUUU2NHCDXA1", "Overall": "1.0", "Content": "This review is not for the drives.  I have 18 WD drives.  They are great.  But I recently purchased 5 drives here at AMAZON and upon registering them with WD find that they are not under warranty for various reasons.  These drives should come with a 5 year warranty.Just following up to add that WD informs me that the drives I purchased were manufactured in 2010.  They only accomodate 1 year of the 4 years of shelf.  More important they informed me one of the drives is an OEM drive that probably shipped with a computer system.  I do not think these should be advertised as new.  Buyer beware.  If you are buying a new drive and want the full five year warranty, make sure it is a year old and sold as a retail drive.  Better yet, buy it from through the Western Digital website and not AMAZON.  This is how I used to buy them and will in the future.", "Date": "May 13, 2014"}, {"Title": "Thought I was buying an OEM WD hard drive...", "Author": "Greg D. Watson", "ReviewID": "R3R1E7E400M3JJ", "Overall": "1.0", "Content": "Bought the drive and seller made a phone call to follow up on the sale.  Sounded great.  When I got the drive, it was a HP OEM stamped WD hard drive with a server mounting bracket.  Checked with WD and there was no warranty on the hard drive.  Tried to save $10 and it wound up costing me $14.00.  Will not make that mistake again...", "Date": "May 10, 2014"}, {"Title": "Great HDD", "Author": "Matthew Daniels", "ReviewID": "R1GM94FBGK9ZF8", "Overall": "5.0", "Content": "This drive is a great product and was perfect for my server build.  It worked exactly as expected.  Thanks... M", "Date": "May 6, 2014"}, {"Title": "Great drives, delivered very well packaged", "Author": "AmznPrimeUsrRvw", "ReviewID": "R2TI7F2E22LK8D", "Overall": "5.0", "Content": "I am no longer a fan of the home and portable blue Western Digital drives,  too many failures.  But the Black Enterprise and Scorpio lines have treated me quite well for longevity and reliability.  I can not speak to the gamer performance benchmarks though, because the aforementioned qualities are the most important features for my use, but they are certainly as fast as the middle of the pack.  PS the drive boxes they arrived in are so damn sturdy and nice, I am keeping them to store my archive drives.", "Date": "April 29, 2014"}, {"Title": "Be aware these drive can not be warrantied through Wester Digital", "Author": "Virginia Jeambert", "ReviewID": "R3PQ6YXN73PANT", "Overall": "2.0", "Content": "These hard drives can not be warrantied by Western Digital if the drive goes bad.  The site only offers a 90 day warranty.  I would recommend looking elseware", "Date": "April 15, 2014"}, {"Title": "Great investment and significant performance increase.", "Author": "Jerry M. Nix \"Travelduck\"", "ReviewID": "R22AHIDEUC4HXQ", "Overall": "5.0", "Content": "I installed the Western Digital Enterprise hard drive in my old Dell Optiplex 320, and it significantly increased the performance of the computer.  It saved me from having to purchase a new computer for a few more years.  Definitely a worthwhile investment!", "Date": "April 15, 2014"}, {"Title": "Good drive, but the recommended cloning software didn't work for my Vista machine", "Author": "Deborah K. Clark \"Loves toys & reading\"", "ReviewID": "R1EWX912KQXIXY", "Overall": "4.0", "Content": "I was planning to clone my system before upgrading from Vista Ultimate to Windows 8 and this drive worked great, after some fairly minor issues.  It has performed well for almost a month, so I will use this drive again or perhaps with a larger capacity.WD recommends Acronis/True Image to clone your drive, but I found that it would not correctly create a boot drive.CNET recommended EaseUS Todo Backup and it did the job for me.  I started with the trial version, but decided to purchase it for another couple of computers that need upgrades.Thanks for the fast delivery from Databug.com too!", "Date": "March 26, 2014"}, {"Title": "WD RE4 drives", "Author": "wmlowe", "ReviewID": "R1NXIQ2UF9Z86B", "Overall": "5.0", "Content": "For my ESXi 5.x server with a Dell PERC 6i RAID card.  Works great in RAID 5 configuration, no problems.", "Date": "March 24, 2014"}, {"Title": "Bullet proof", "Author": "dmizer", "ReviewID": "R2XV5SN35LEEQC", "Overall": "5.0", "Content": "So far so good I bought this to put in my home security system for durability and its been working great", "Date": "March 6, 2014"}, {"Title": "Works", "Author": "Brian McKinstry", "ReviewID": "R3A4RZ4KEITSAV", "Overall": "5.0", "Content": "Have had issues with another vendors disk failing in my SAN. This is second Western Digital I have purchased as a replacement.", "Date": "March 6, 2014"}, {"Title": "hard drive from western digital", "Author": "Josie & David Goerger", "ReviewID": "R2LQC3Z5AEY703", "Overall": "5.0", "Content": "After a lot of research we decided to purchase this hard drive because of the speed we received it when expected and installed it now my computer a lot faster than previous drive completly satisfied", "Date": "February 10, 2014"}, {"Title": "very good drive", "Author": "dennis coburn", "ReviewID": "R9MNTGBTYYAZC", "Overall": "5.0", "Content": "the drive was easy to install and had no problems with it! it is a good drive for older computers.", "Date": "February 10, 2014"}, {"Title": "Working great", "Author": "Wanyan", "ReviewID": "R2RK1YJLB6FFB3", "Overall": "5.0", "Content": "Have owned and operated five of these in a Synology DS 1511+ in a RAID 6 configuration for more than a year now.  Have had no issues so far.", "Date": "February 7, 2014"}, {"Title": "Put your life on it.", "Author": "Nathaniel Bannister", "ReviewID": "R1MFT0T04IVEYG", "Overall": "5.0", "Content": "We have 40+ of these drives in production in varying capacities. I honestly wouldn't trust anything else. WD Black drives have the track record, why waste your time or gamble your data?", "Date": "February 3, 2014"}, {"Title": "Ultra reliable", "Author": "Robert Gammon", "ReviewID": "R3XKJSB7U9YX6", "Overall": "5.0", "Content": "This should still be spinning data on and off if the computer is still in operation 50 years from now", "Date": "February 3, 2014"}, {"Title": "Solid", "Author": "Stephen Colson", "ReviewID": "RLB9QQ9EB1XCW", "Overall": "5.0", "Content": "I use these on a Thunderbolt-driven RAID array connected to a server and their performance has been nothing but solid the entire time.", "Date": "January 30, 2014"}, {"Title": "Perfect...", "Author": "GUILLERMO GOMEZ", "ReviewID": "R1EJ2QWSNQMAYT", "Overall": "5.0", "Content": "Very good hard drive works perfectly, good for Windows, Mac and Linux, Perfect for my project, and came in excellent condition.", "Date": "January 29, 2014"}, {"Title": "Solid Drive", "Author": "Neal Bierbaum", "ReviewID": "R35P93EMCU1EIA", "Overall": "5.0", "Content": "I have used several of these drives in the past 2 years for server systems in schools in several countries. They work well, are wuiet, and should have a long life. I have standardized on this drive as the primary disk for all server builds.", "Date": "January 21, 2014"}, {"Title": "Merged into Raid array without issue", "Author": "Michael Jones", "ReviewID": "RF1OXWKE5PUY3", "Overall": "5.0", "Content": "Put two of these into a Dell Poweredge server alongside older 750GB Seagates in an existing raid array; controller identified them immediately, merged them into the raid array flawlessly, running without issue, no complaints whatsoever. Good solution for us, locating refurb drives from reputable vendor matching the OEM Seagates was getting harder and harder, cost difference between buying refurb and buying new was getting smaller but new drives come with full warranty and, as it turns out, mix and match is a better idea anyway (so long as your controller is compatible with the mix and match combination)", "Date": "January 10, 2014"}, {"Title": "good drives", "Author": "Happy in Ky", "ReviewID": "R1NRELVOFXFJTP", "Overall": "5.0", "Content": "These came package very well. I had not noticeable damage. Installation went well I used the sata power and sata hook up. The drives are working just fine and I would recommend this to a friend.", "Date": "January 10, 2014"}, {"Title": "RE4 are about the best platter drives available", "Author": "Tech Taster \"tt\"", "ReviewID": "R3EO6CJ5E4JJVQ", "Overall": "5.0", "Content": "This drive is fast, and performance-wise has everything you’re likely to want.  But the really impressive part is the amount of work WD has done to ensure reliability both in standalone operation and also in RAID.  These are now tried and tested drives in the market, and the results of WD’s work are clear to see, so you know you can depend on them with your data.  Given the sheer time and expense of recovering from disk failure these days, I don’t see the point of using slap-dash drives from other less careful companies.  Whether desktop workstation or 24x7 enterprise, this is about the best you can get, and I would recommend your data can’t do without it!", "Date": "December 20, 2013"}, {"Title": "WD RE4 1Tb drives", "Author": "Kevin R. Evans \"kevmeist\"", "ReviewID": "RLF6N1S7CFHMA", "Overall": "4.0", "Content": "Seems a little noisier in my server than the previous Seagate 1.5Tb drives (but then again the Seagate drives both crapped out after about 3 years). I hope that these drives last longer than that! Other than the noise (which seems more of a problem for my wife than me) they seem to be excellent drives (I've been running them for almost a year now).", "Date": "December 16, 2013"}, {"Title": "I have four now,  they are all working just fine.", "Author": "Steve", "ReviewID": "R2KN5FSP88V0WX", "Overall": "5.0", "Content": "It works,  passed SMART testing.  I have ended up buying 4 over time and they are still working just fine.", "Date": "December 12, 2013"}, {"Title": "Allow some time for the drive to stabilize!", "Author": "harold satterfield", "ReviewID": "R18FI5XEZU1Z9N", "Overall": "3.0", "Content": "I order two of these drives.  They did arrive on time as I expected.  After installing the drives into my system, one went bad within a couple of days!  After evaluating the drive and moving what few files I had put on it, I tried to overwrite the drive with zeros.  The drive completely failed during that process!  I have learned the hard way that when a drive has sector errors you should move everything off of it ASAP!  I did request an RMA from WD and it was processed quickly.  I have received the replacement drive and am allowing a week for it to \"burn-in\" before closing the drive bays.  The second drive has logged no errors and seems to be working fine!", "Date": "December 10, 2013"}, {"Title": "These arrived in perfect working condition, no problems.", "Author": "Tom", "ReviewID": "R1NVWA8JWVBA6G", "Overall": "5.0", "Content": "Two drives arrived in perfect working condition.  I put them in a Sans Digital RAID.  Because of other reviews warning of others having received units that while new had little warranty left, I immediately registered them with WD.  That was easy, and WD confirmed the 5 year warranty on my units.", "Date": "December 9, 2013"}, {"Title": "Bullet Proof Drive for demanding applications", "Author": "Robert Barkoski \"HighCaliber\"", "ReviewID": "R6BUOOSSB09LP", "Overall": "5.0", "Content": "The RE4's are bullet proof and I always use them in High Quality computer builds.  Stability and longevity are the strengths of this drive.", "Date": "December 9, 2013"}, {"Title": "Great harddrive", "Author": "Duwayne Doner", "ReviewID": "R5UE25WSC3J44", "Overall": "5.0", "Content": "Works great. need it for a back up computer that i use on my TV. It's fast and cheap. Thank you", "Date": "December 7, 2013"}, {"Title": "Failed after 18 month...make noise", "Author": "Mani", "ReviewID": "R1BNQBNRI47VHM", "Overall": "3.0", "Content": "It failed after 18 month use. It says read write error. Also it make lot of noise...I used this in my  QNAP 2-bay NAS server.Luckily it's under warranty (5 yrs). I will ask for replacement hard disk. I'll update once I'll receive my replaced hard disk.I'm planning to switch to Segate ST2000NM0033 SATA III Enterprise Capacity 3.5 HDD V.3 .", "Date": "December 1, 2013"}, {"Title": "Bought as a replacement for a failed drive", "Author": "Justin", "ReviewID": "R169TRRNKP9SUX", "Overall": "4.0", "Content": "Bought this to replace an identical drive in a RAID that went bad after about 18 months. WD took the bad drive back under warranty. Upset that it failed, however WD honored the warranty without question.", "Date": "November 30, 2013"}, {"Title": "Used as cheap extra Hot Spare drives in Dell SATA RAID array. Works OK. Spins off diagnostic errors, but no big deal.", "Author": "MicroAcres", "ReviewID": "R27CDIJD7QFU61", "Overall": "4.0", "Content": "Used to add Hot spares in a client's Dell PowerEdge 2900 SATA RAID server array.Gives error about not being \"certified\" drive, but works fine.Will replace all with SAS soon. Using SATA RAID was a bad idea.", "Date": "November 29, 2013"}, {"Title": "Reliable drives", "Author": "RTG&T", "ReviewID": "RYB050SBAUFJV", "Overall": "5.0", "Content": "I have used many dozens of these drives and have had very good luck. You pay a bit more for the RE4 version, but the failure rate is way lower than the standard Black Series. I build and repair computers for a living and I have to have reliable drives. I have had a fairly high failure rate with the standard Black Series and a huge failure with Seagate drive of all types. The overall quality of hard drives has gone down in the last few years since the flood and therefore the overall failure rate has gone up with it. But so far these drives have not failed me yet and I have been using the RE4 series for about 2 years. I really do think they are worth the extra few bucks.", "Date": "November 28, 2013"}, {"Title": "Better quality drive.", "Author": "Mr. Skullhead", "ReviewID": "RQTSJJKRL2PVN", "Overall": "5.0", "Content": "Enterprise drives are made to a higher standard than regular drives. The last drive I had lasted 5 years before showing signs of starting to fail.", "Date": "November 28, 2013"}, {"Title": "Great hard drive.", "Author": "John", "ReviewID": "R3HMUINR4BR6K8", "Overall": "5.0", "Content": "This drive has been reliable for me.  I think I've had it for about 2 years now.  I'm satisfied with performance and reliability.", "Date": "November 26, 2013"}, {"Title": "Always happy with WD for drives.", "Author": "Jon", "ReviewID": "R24XJ6ZI2TTTNM", "Overall": "5.0", "Content": "I've always been pleased with WD, and this has proven to continue that reputation. I have two of these in a RAID1 configuration using a 3Ware controller. They work perfectly and have not caused one bit of trouble. I even simulated failures by unplugging them to test my raid card, and they are happy to rejoin and rebuild.", "Date": "November 16, 2013"}, {"Title": "solid quality drive", "Author": "Bradley J. Thomas \"CHEMLIGHT\"", "ReviewID": "RO7KAYIGQXTDU", "Overall": "5.0", "Content": "awesome, if you do a lot of data writing and reading get it. (own 8 of them)don't get the home user counter part. you'll only regret it and lose your data. and then end up buying this5yr warranty priced fair.*slight noise but it's a solid performing product.", "Date": "November 15, 2013"}, {"Title": "I found it on AMAZON quickly, the price: REASONABLE, the shipping: FAST, condition: PERFECT, and it arrived when EXPECTED!", "Author": "Ed O'Neil", "ReviewID": "R2TFM1NMWI0OKL", "Overall": "5.0", "Content": "I am an OPO (One Person Operation) IT person and relativly new here at work.  I am responsable for ALL things IT and am really needing things to go well and right.  Last week, I noticed an amber warning light on one of my Dell PowerEdge 2950's.  I checked the logs and diagnostics and found one of the 4 drives had failed.  Then immediatley I cracked open Amazon.com and began searching for a fast replacement drive.  The best price was by a company clear across the USA from me.  I'm in Oregon and the drive was in Florida.  Since it was a three day weekend, I reckoned my order would be timed just right anyways.  The price was very reasonable and so I bought two; one for immediate replacement, and one to keep on hand as a standby.When they arrived, I popped it in to the server and it immediatley activated and restriped as expected.So, what else can someone want from a purchase experience?  I found it on Amazon quickly, the price was reasonable, the shipping was a bit but I needed it NOW, and it arrived when I expected.  The product was new and perfect condition.  I would buy from this seller again in a heart beat.", "Date": "November 12, 2013"}, {"Title": "So far so good!", "Author": "John T. Adams \"johndawg23\"", "ReviewID": "R3VPHBR6X0VUI2", "Overall": "4.0", "Content": "Bought these to put in a  DROBO.  Everything is working great.  I plan to order a few more when I need to.", "Date": "October 30, 2013"}, {"Title": "Love these drives", "Author": "baha", "ReviewID": "R2FIN4CMGVUE1X", "Overall": "5.0", "Content": "I almost bought the consumer rated RED drives but having RE3 drives before I decided to pay more for less capacity than the RED. These are of commercial construction and are meant to operate 24/7. I replaced my two RE3 1TB drives with 2 RE4 2TB drives and have not had a single problem with either model. RE4's I think only come with 3 year warranty whereas the RE3's were 5 year I believe. The bubblewrapping in shipping was very professional.", "Date": "October 28, 2013"}, {"Title": "WD black drive", "Author": "siijiom", "ReviewID": "R3R5I4JPLF5OQO", "Overall": "5.0", "Content": "Delivery took a little longer than I would've liked. Not that that it affect the product itself. The product claims it's designed for enterprise use but I just use it for the computer I built. Nothing to complain about works exactly as you would expect", "Date": "October 25, 2013"}, {"Title": "excellent product", "Author": "John Viemeister", "ReviewID": "R9XD981NYBJL6", "Overall": "5.0", "Content": "The drives were well packaged and arrived on time. They are new and passed testing, before being put into production. I recommend these enterprise quality drives.", "Date": "October 21, 2013"}, {"Title": "WD RE4 Drives are Great", "Author": "Zackdickary", "ReviewID": "RW6ZN1F92G7P8", "Overall": "5.0", "Content": "I have used them in several NAS devices, and have had no failures to date.  Rock solid, fast, and reasonably priced.", "Date": "October 20, 2013"}, {"Title": "still working great in my DJ computer thanks", "Author": "Jay", "ReviewID": "R9ZQYX7HS4ZKG", "Overall": "5.0", "Content": "This item is still working great and I will purchase this item again soon. I think the quality is a good value for the money, thanks", "Date": "October 18, 2013"}, {"Title": "Good drive at a competitive price point.", "Author": "K. Holland \"ThisIsMe\"", "ReviewID": "R2YZUE0GI48EA3", "Overall": "5.0", "Content": "I have a half dozen or so of these drives, plus older models that are basically the same.  They have been very reliable and perform well.", "Date": "September 11, 2013"}, {"Title": "This device is a great Hard Drive", "Author": "RAB", "ReviewID": "R359PLUCIQFSHI", "Overall": "5.0", "Content": "I had no trouble installing this HD. The drive is in excellent condition and I fully anticipate a long service life. The drive measures as faster than the Hitachi it shares a box with, which is always a bonus. The price was also excellent.", "Date": "September 4, 2013"}, {"Title": "will definitely buy again", "Author": "Goin' Goin' Zon", "ReviewID": "RYNTYHI3B882T", "Overall": "4.0", "Content": "A few bad sectors reported, but well within tolerances.  After a few weeks, the drives are as reliable as you would hope for from a Western Digital product.  Great price and well packaged.", "Date": "August 31, 2013"}, {"Title": "Western Digitals \"Black Enterprise\" edition.", "Author": "Roger Simon", "ReviewID": "RP6G22F7R5AYX", "Overall": "5.0", "Content": "I've been using these drives in server applications for many years without failures yet. They are substantially higher quality drives than ANY of WD's other offerings.Pro's: They work, they last!Con's: None!Concerns: 500 and 750 GB drives are getting harder and harder to find! Most current Satellite DVR's will only accept USB2 external drives up to 750 GB. 1 TB and above don't work... The newer satellite DVR's like \"Hopper\" will work with drives up to 1 TB+ but they cannot rename saved programing, therefore impossible to catalog anything! 1000 saved programs all the same name is worthless! So, keep the earlier models and find the smaller drives.WD Black, Enterprise Edition are \"Top of the Line\". Period.I have two servers still running with 8 WD Black drives each. 160GB drives. One drive failed 4 years ago. These two servers went online June 2001.", "Date": "August 29, 2013"}, {"Title": "Got me out of a bind", "Author": "CaptLanny", "ReviewID": "R13CG93UILUNJ9", "Overall": "4.0", "Content": "I ordered this hard drive when mine crashed during tax season, got me out of a bind and has performed perfectly ever since.", "Date": "May 30, 2013"}, {"Title": "Works great", "Author": "Phaser Printer User", "ReviewID": "R1EYLJWSOQK3T1", "Overall": "5.0", "Content": "I have had this drive for quite a while and it runs great, no problems. I would recommend it to anyone.", "Date": "May 14, 2013"}, {"Title": "Great", "Author": "Marcelo T Amaral", "ReviewID": "R1DEDGRE4MZSHY", "Overall": "5.0", "Content": "Great and reliable HD. I bought 4 to use in my 413j Synology NAS to keep my data safe. Worked flawlessly. I'm using them for 4 months now. Everything perfect.", "Date": "May 12, 2013"}, {"Title": "Love these drives & WD", "Author": "TechExec", "ReviewID": "R1UQSOL8UV91UX", "Overall": "5.0", "Content": "Great performance, great warranty, easy process to get service. Across all the brands I've used, WD has overall, performed the best for me.", "Date": "May 4, 2013"}, {"Title": "Things aren't always as bad as they might appear.", "Author": "Dioji", "ReviewID": "R3VTEFA663BFE0", "Overall": "5.0", "Content": "A few years back, I put 4 WD 80G Caviars in a RAID 5 (240GB total) in a box I use for my work (I'm self employed developer). Last week, one of the drives failed, but thankfully I had the RAID 5 which falls back to RAID 0 in this situation. I didn't want to just replace the 1 drive, since they were all getting old, but I couldn't afford to purchase multiple drives for a new RAID setup.  The \"new\" RE4 500GB wasn't sold by Amazon. I'd have to pay extra shipping and I wasn't sure how fast it would get here. So, I settled on this WD RE4 500GB (\"used-like new\") from Amazon Warehouse Deals because my Prime membership never lets me down.The disk arrived in 2 days, as promised, in a plain brown WD box--but much to my surprise it wasn't wrapped in a static guard bag and the drive itself had been marked with a permanent black marker with the number \"1\". And, the manufacture date on it was 6 months old. Hmmm... this doesn't look good--not exactly \"like new\". I downloaded and ran the Western Digital Data LifeGuard Diagnostics test and it passed. I then went to wdc.com to register it. After plugging in the serial number it said \"Limited Warranty\" with 4.5 yrs left (based on the manufacture date). I was afraid of that. But I decided to complete the registration and when I entered the purchase date, it changed the warranty to 5yrs + 1 month (61 months). Sweet! I did a final backup that night of the old RAID OS volume and restored it to the new drive the next morning using Acronis True Image.  I did this instead of \"cloning\" because it can be done within Windows 7--recreating the active/running OS partition--without interacting with it. The restore to the new disk took less than an hour. I adjusted the BIOS settings for the new OS disk and it booted right up. Flawless.The take-home message #1 is: if it's essential to your livelihood, you need redundancy like a RAID 5 or a mirror setup AND a backup system (mine is Acronis True Image setup to backup every night). Now, I feel a little insecure because I don't have the redundancy anymore which means I could lose whatever work I do since the previous evening should the new drive fail. But, I think the RE4 disk is still a good choice if you're using a single disk. I will probably get 1 more when money isn't quite so tight and at least have a mirror.The take-home message #2 is: Don't jump to conclusions. Things aren't always as bad as they might appear. You can still get the full 5 yrs from WD buying from Amazon Warehouse Deals and their packaging is just that: packaging. It might not look good, but it's how the product performs that matters. I got it fast, saved a few bucks, got the full 5 yrs and it works great. I would buy another \"like new\" drive without hesitation.", "Date": "May 3, 2013"}, {"Title": "Excellent", "Author": "E. Shelton", "ReviewID": "RU10DOUSNTNBN", "Overall": "5.0", "Content": "We received this hard drive on time  and exactly what a needed. Cannot not make one complaint, and the price was right.", "Date": "April 28, 2013"}, {"Title": "As advertised.  No issues after 6 weeks.", "Author": "William J. Schirmer", "ReviewID": "R9SOHJTE3T6FD", "Overall": "5.0", "Content": "Using in a Synology device without issues.  Temperatures a bit high, but that is one of the reasons I bought this over the Red.", "Date": "April 23, 2013"}, {"Title": "This drive outlasts other drives I've tried.", "Author": "OrthoWashington", "ReviewID": "R4QMYA4ZT5XCT", "Overall": "5.0", "Content": "I have purchased 40 of these drives so far for our server room and they have clearly outlasted all the other drives with similar spec's. Our air conditioner failed one weekend and the room temp went up to 138 degrees by the time someone responded to the alarm and started the backup cooling manually. We lost 9 drives of different sorts but none of these models went bad. I use them at home now for my personal NAS storage.", "Date": "April 17, 2013"}, {"Title": "high quality hard drive", "Author": "Dave Entermille", "ReviewID": "RY1VKP1BP46LW", "Overall": "5.0", "Content": "WD drives are quality, RE4 series have good specs and warranty. Fast, useful for enteprise/businesses, great for general user.Only used this model a short time, but quiet, cool running. Expect a long lifetime.", "Date": "April 6, 2013"}, {"Title": "Fast and reliable.", "Author": "Ed Sakabu \"stillslippery\"", "ReviewID": "R2VHQDHECNDT3", "Overall": "5.0", "Content": "Fast and reliable (also reasonably prices). Have been using these drives as removable backup with an external dock and rotating them with drives that I keep at work and in my safe.  Keep the foam shipping containers for transport.", "Date": "April 5, 2013"}, {"Title": "Works really well", "Author": "James F Cratty", "ReviewID": "R2LKPZJYXKZS04", "Overall": "5.0", "Content": "Works really well love it. Will recommend to family and friends. Fast speeds and great size. Loads and shutsdown computer at much faster speeds than my IDE surpassed my expectations.", "Date": "March 31, 2013"}, {"Title": "Fast Cool & Quiet", "Author": "sturner", "ReviewID": "R2X6IOJ4OCO7LY", "Overall": "5.0", "Content": "Ordered two of these drives to replace a pair of 150GB Hitachi drives in a RAID 1 configuration. Installation was flawless and the operation is smooth, fast, cool and quiet. This is as good as it gets from a 7200RPM server class drive. If you want faster prepare to spend a lot more money and go with a 10K or better RPM drive.", "Date": "March 18, 2013"}, {"Title": "Runs cool and quiet and got good report from chkdsk on first test.", "Author": "R. Carlisle \"MrTradewell\"", "ReviewID": "R2LGYEVYGSHID6", "Overall": "5.0", "Content": "I have had much bad luck with new retail hard drives.  All brands seem to come with defective sectors right out of the box.  This WD enterprise unit seems to have much higher quality control as the one that worked from an order of two passed chkdsk with no bad sectors.  Unfortunately, the other one just got hot and did not work at all.  However, Amazon was very quick with supplying me with a replacement which works fine.  I intend to order additional units for other new builds in my pipeline.", "Date": "February 27, 2013"}, {"Title": "4 Purchased for RAID 10 -", "Author": "Steve", "ReviewID": "R387MMOT5DNZX1", "Overall": "5.0", "Content": "I was running out of space on my RAID 10 drive which was 4x640gb WD Caviar Blacks so chose these as replacement.  They are running on a 3Ware 9640SE raid card fine.  In my case, they run about 91 degrees F, your results will vary obviously depending on your case set up.  These are a tad noisier than the previous drives, but not enough to be a concern, hard to hear them over the case fans which are not super quiet on my system.All the drives ran when I received them, no DOAs but 1 did fail the WD drive tool test.  I contacted Amazon and was cross shipped a replacement at no cost, received in 2 days.  This is one very good reason to buy drives from Amazon vs other online computer hardware companies which will charge shipping for replacements.  I highly recommend using the WD drives tool on any WD disk you buy prior to setting up on your system.  Use the short and long test.  My drive passed the short test but failed the long test.If you are upsizing an array that will auto rebuild, just replace 1 at a time letting it rebuild before replacing the next drive.  This worked great for the RAID 5 drive on the MB ICH10R.  Using the Intel Raid Management tool (free download) I resized without losing any data after all 4 drives were in place.  The RAID10 on the 3Ware card would not upsize using 3DM2 tool so I contacted LSI who wrote a script to upsize the array.  Ran the script as directed but it only upsized half the array, so it became corrupt and I lost the array.  Fortunately I had just made a System Image on a single disc (2TB WD Red) and was able to quickly restore the image using the Windows 7 disk.  If you have a RAID card, there's a pretty good chance the Win7 installation will not have the RAID drivers included, so make sure you have those available on a USB or floppy before getting into a position that might require you to restore an image after losing an array.", "Date": "February 24, 2013"}, {"Title": "WD RE4 500 GB Enterprise Hard Drive", "Author": "R. Stark \"kidkrats\"", "ReviewID": "R1KXEDATLPI4AH", "Overall": "5.0", "Content": "This Drive works very well and I've had no problems with it after several weeks of use.I think the \"Enterpise\"  designation refers to its suitability for \"server-use\",, but it works fine in my home desk-topcomputer running Windows 7-64 bit and SATA-2 .  It' also super quiet !!", "Date": "February 13, 2013"}, {"Title": "Needed a more robust drive", "Author": "Wierd Beard \"Beardy\"", "ReviewID": "R2MMEPLSX71QHG", "Overall": "5.0", "Content": "I've had 3 1TB drives die on me over 4 years time, so I decided to look into getting an Enterprise drive in the hopes that the motor and heads would be a bit more robust.  So far, so good.  The drives have performed well running CS6 for video editing and don't seem to be running into any of the previous issues.  Fingers crossed!", "Date": "February 4, 2013"}, {"Title": "30 Second Installation Time in my Mac Pro", "Author": "Skyhawk", "ReviewID": "R6HTFMOB5G7I5", "Overall": "5.0", "Content": "This hard drive slid right in to one of the 4 hard drive bays in my Mac Pro.  Total installation time was about 30 seconds.There are no wires inside a Mac Pro for hard drives so installing this unit is like putting bread in a toaster. No tools needed!The Mac OS recognize the drive automatically and formatted it in about 30 seconds.Runs great. No issues.", "Date": "January 27, 2013"}, {"Title": "Great warranty, so far so good....", "Author": "D. Lee", "ReviewID": "R24YLHC16Q4MV7", "Overall": "5.0", "Content": "I was looking for a replacement drive for my aged D-Link DNS-323 NAS. My old 750 GB Seagate Barracuda died. I settled on this drive because of the enterprise reliability, 5 year warranty, prices, and the fact it was very difficult to find good sata2 drives. The DNS-323 apparently doesn't support sata3 which are more abundant and cheaper. The DNS-323 would not sync the data from the other 750 GB disk in a RAID-1 configuration so I ended up having to reformat both drives which gave me 750GB of RAID1 and another volume of 250GB JBOD. I restored the data from another DNS-323 and I'm back up and running. So far so good...", "Date": "January 25, 2013"}, {"Title": "Nice write cache and I/O speeds", "Author": "J. Johnston", "ReviewID": "RG3HUSVTKTC7P", "Overall": "5.0", "Content": "This is a nice sized drive for the money, and the 64MB cache makes write backs very fast.  We use this in one of our workhorse workstations as a \"high speed\" drive and have been very pleased with I/O performance.  No reliability issues or smartdrive errors with heavy use over the first year of service.", "Date": "January 16, 2013"}, {"Title": "Excellent Hard Drive", "Author": "Jeff", "ReviewID": "R3NV9I7XULRZZ6", "Overall": "5.0", "Content": "A very fast 7200 rpm hard drive. Great operating system drive for those who aren't interested in going to SSD. Have installed this drive in 5 different systems with absolutely no problems. Be aware drive is Sata II not Sata III. Only 500 GB but most folks never use a fraction of the space available on the 1TB drives that currently dominate the market.", "Date": "January 11, 2013"}, {"Title": "Excellent hard drives", "Author": "B. Berlinger", "ReviewID": "R13A1JTQRI4Q6A", "Overall": "5.0", "Content": "Best in the biz. You want enterprise grade reliability and performance for a SATA interface? These are you boys. I bought 8 at once, all 8 worked out of the box (no DOA), and work fast at that. If you don't need the performance, however, the WD RED series seems a decent alternative at a much lower price point, but I needed the 5 year warranty and top speed and these delivered!", "Date": "January 9, 2013"}, {"Title": "WD 2TB RE4 is a solid performer", "Author": "Amazon Customer", "ReviewID": "RP50GUV7A4SIL", "Overall": "5.0", "Content": "Got this to complete my RAID5 setup in my QNAP NAS. This combination is a real giant killer with great server type performance in a toaster sized form factor. Recommended but like a lot of good things it costs!", "Date": "January 8, 2013"}, {"Title": "Good price, 5 year warranty", "Author": "charlie_k", "ReviewID": "R1YYQTS2OBHBO8", "Overall": "5.0", "Content": "I have a ReadyNAS NV+ file server that I purchased in 2007. After five years in service I decided to replace the hard drives as a preventative against failure.It's always a risk. Every drive you look at will have a number of 1-star reviews based on drive failures.I decided that the safest approach was to purchase enterprise class drives with 5 year warranties, under the assumption that they are probably better built than consumer class drives.In this case, the 1TB drives are going for $99 so there is really no upcharge for the enterprise class drive.They arrived nicely packed, suspended in a box with end-caps. So far they are working well.", "Date": "January 6, 2013"}, {"Title": "Why would anyone buy anything else?", "Author": "Chris Mathews", "ReviewID": "R3053U6WGD4G61", "Overall": "5.0", "Content": "An awesome drive - I think all my drives going forward will be this one...The results of my 600+ meg robocopy.  The other results were equally impressive:  Total  Copied  Skipped  Mismatch  FAILED  Extras Dirs :  147  146  1  0  0  0Files :  3507  3507  0  0  0  0Bytes :7344455.5 m7344455.5 m  0  0  0  0Times :  0:00.000  1:39:18  0:00.000  -1:-39:-18I'm planning on putting this drive in a RAID, and the NCQ support is critical.  I'm not happy about WD's NCQ support, but am significantly less happy about Seagate's recent reliability.", "Date": "January 4, 2013"}, {"Title": "Solid", "Author": "Philip E. Garrett", "ReviewID": "R2QLQGYT5WTU4A", "Overall": "5.0", "Content": "I chose this drive so that I can upgrade to a RAID later if I so choose. The drive is quite and fast. That is just about all you can ask for out of a 2TB drive. I am using SpinRite 6.0 to maintain the drive and to give me a heads up if it starts degrading.", "Date": "January 2, 2013"}, {"Title": "Good drive. Fast. Quiet.", "Author": "afk", "ReviewID": "R3P54V1C8VPGQI", "Overall": "5.0", "Content": "It installed and worked fine on the first attempt.Whether or not the 64 meg cache will be worth the extra money remains to be seen but it seems to be super fast and very quiet.", "Date": "January 2, 2013"}, {"Title": "Great hard drives for RAID and NAS", "Author": "taxidriver1138", "ReviewID": "R2VQ9VDV7II2W8", "Overall": "5.0", "Content": "These hard drives are enterprise grade and perfect for RAID configurations. I currently have four of them in a RAID 5 array in a Synology NAS server and four of them in a RAID 10 array in my desktop computer. In both configurations they work fine and are fast. A huge plus with these drives is the 5 year warranty which covers drive failures.", "Date": "December 31, 2012"}, {"Title": "HD Review", "Author": "Dom", "ReviewID": "R6VVN4K9EO1CM", "Overall": "5.0", "Content": "Item arrived as described, drive works well.  It is a bit noisier than I expected but that is not really a concern for me, plus it is a server grade drive so I suppose it comes with the territory.", "Date": "December 30, 2012"}, {"Title": "2TB hard drive runs flawlessly", "Author": "dreamer", "ReviewID": "R2J1N1CBDJENYU", "Overall": "5.0", "Content": "I have been very pleased with this unit.  It is the primary drive on my most-used desk top computer.  I wouldn't hesitate to purchase another one.", "Date": "December 28, 2012"}, {"Title": "SATA RE4 writes fast...", "Author": "lowmoor", "ReviewID": "RCTSRCY9C1FEB", "Overall": "5.0", "Content": "I bought this drive to backup data from an old XP system, and it fully meets expectations. Using XP system tools, wrote a disk signature and quick formatted about half of it for starters. Sourced from 100 Gbyte 10000rpm IBM/Hitachi SCSI U320 drive, was able to transfer ~128 Mbits/sec average;  34 Gbyte transfer in 33 minutes.Transfer from a WDC 320 Mb, 7200rpm, 16Mb cache, IDE connected (in the same system with the above SCSI): ~27Mbits/sec, 85 Gbytes transferred in ~6.5 hours. YMMVI particularly liked the five year warranty, low power consumption, and it runs cool and quiet.", "Date": "December 18, 2012"}, {"Title": "Great Server Drives", "Author": "Gary Cooper", "ReviewID": "R3EY7AXKSMDL6", "Overall": "5.0", "Content": "Used to upgrade drives in new HP Proliant server.  Mirrored in new SBS 2011 Essentials installation.  Worked great as expected with WD hard drives.  Great warranty!", "Date": "December 16, 2012"}, {"Title": "like this drive", "Author": "by J in San Diego", "ReviewID": "R1HMEHN3RAAUVO", "Overall": "5.0", "Content": "This is a good drive so far and is rated to handle the duty cycles that I need to put on it.... running vm snapshots on the drive.  Burned out my seagate green drive just a while back because it couldnt handle the constant running, but so far this one is going strong.", "Date": "December 15, 2012"}, {"Title": "The best or never!", "Author": "ANK2", "ReviewID": "R3EWP05IR9XQI5", "Overall": "5.0", "Content": "I'm very impressed with this hard disk, if you have any RAID configuration and want a piece of mind, you MUST get this, works perfectly, not noisy at all, very efficient.... best pricing on Amazon, been buying this from Amazon for quiet time!", "Date": "December 14, 2012"}, {"Title": "So far so good...", "Author": "J. IT", "ReviewID": "RQCT9GXADHGVL", "Overall": "5.0", "Content": "Using these in a file server.  Fast, quiet (for a server drive), and reliable.  This is why I like WD.", "Date": "December 13, 2012"}, {"Title": "Reliable HD - Very quiet", "Author": "598hertan", "ReviewID": "R122D7CPO3NVND", "Overall": "5.0", "Content": "I rated this five stars because this product works as expected. Great brand, great price.I like how big the storage. I like the cost per GB. I like how quiet it is. It was simple to setup with Windows 7.I would recommend this to anyone who knows how to identify a compatible hard-drive for their current PC setup.", "Date": "December 11, 2012"}, {"Title": "Fast. Reliable. Great warranty.", "Author": "Sagar S. Mungekar", "ReviewID": "RGTVWJIIW7O0N", "Overall": "5.0", "Content": "I bought a few of the 1 TB models to use in a RAID in a NAS and have been quite happy with the performance.The \"Enterprise\" line of WD HDD have time-limited error recovery (TLER), which is essential in a RAID. A \"regular\" HD may be dropped from an array if it takes too long to recover an error; I've had this happen in the past. These TLER drives limit the amount of time spent in this process. Of note, this behavior would not be desired in a standalone setup, so these drives are specifically for RAID.I use these drives in a NAS connected to ~6 computers with frequent read/writes and the 64MB cache is definitely obvious. I've used WD for years, and the only one I've had fail was one of the Green models. The customer service has been great in the past, so I highly welcome the 5-year warranty.", "Date": "December 10, 2012"}, {"Title": "Works great.", "Author": "vthomebrewer", "ReviewID": "R16XW3TT14VW56", "Overall": "5.0", "Content": "I love Western Digital drives, this one is no different. It's fast (enough for me anyway), cheap, and quiet.I'll write back later concerning reliability.", "Date": "November 26, 2012"}, {"Title": "RE4 drives are above all others", "Author": "James R. Griffin Sr.", "ReviewID": "RJT56SIK750CQ", "Overall": "5.0", "Content": "They last and have a good record of staying that way. I would recommend them to anyone wanting a harddrive to last.", "Date": "November 24, 2012"}, {"Title": "Excellent Hard Drive...", "Author": "Joan Miller", "ReviewID": "R2WSOKH1TMF851", "Overall": "5.0", "Content": "I am a fan of Western Digital products, I have 3 external hard drives attached to my computer via USB. When I purchased my Gateway FX6860 it came with 2 \"easy swap\" bays and I knew I needed another drive just for backing up my computer. I purchased this WD drive to insert into the easy swap bay. Now I'm not a novices at using a computer but I'm also NOT that experienced at installing anything in the tower. The drive came with no installation instructions, AHHHHHH and neither did my new computer... I went online to Gateway for instructions and finally through \"chat support\" I was directed in the right direction. Pull out the easy swap drive frame and snap the hard drive into it and insert firmly into the bay, turn the computer on and it should be recognized, but it wasn't listed with all my other drives in \"MY Computer\". I looked at the \"Device Manager\" and it was listed there..... Being a novices at installing anything into the tower I turned to my trusty \"Windows 7 Bible\" by Jim Boyce,Windows 7 Bible (any new computer I have ever owned I have gone to Amazon and purchased the \"Windows... Bible\" book). I looked in chapter 46: Installing and Removing Hardware, and it took me step-by-step to the \"Computer Management\" window and to the installation wizard, explaining each step and choice I had to make... The drive is running perfectly!!!The product was shipped in a timely fashion and packed very well. I would definitely purchase this item again if needed.", "Date": "November 4, 2012"}, {"Title": "Western digital RE4 drives are a good buy", "Author": "Jbockhahn", "ReviewID": "R14GBD6N81STQ9", "Overall": "5.0", "Content": "I purchased these drives to use in a synology NAS and I am not disappointed. It is very important to use proper drives in raid arrays, anything less is asking for trouble. These drives are a bit pricey but considering the warranty and performance I think it's well worth it. The drives are a little noisy as well. One of mine has a bit of vibration so it can make a humming noise at times. They also are noisy when they are reading and writing a lot of data, however I don't think that's fair to complain about in an enterprise drive. Overall I'm very happy with the drives", "Date": "October 16, 2012"}, {"Title": "Enterprise performance", "Author": "HugoP", "ReviewID": "RUZQZW913F174", "Overall": "5.0", "Content": "Best enterprise harddrive ever used. Good performance and reliability. Ideal for mission critical services. Been working with this model for a couple of years with no problems.", "Date": "October 9, 2012"}, {"Title": "Enterprise Quality", "Author": "Stephanie Sullivan", "ReviewID": "RPZLVXLS0V6CZ", "Overall": "5.0", "Content": "The WD RE4 has been a solid 7200 RPM enterprise class drive. Support for RAID with Time Limited Error Recovery (TLER) and designed for a 24X7 duty cycle  make this a great reliable drive for use in servers or mission critical applications.As a desktop drive this is comparable from a performance standpoint to a WD black series drive that isn't designed for 24X7 and does not have TLER. Black drives can drop out of a RAID array on a soft error that does not justify it.For my clients and my use the RE4 drives have been a top performer. Now WD has released the RE series (without a numbers) which is the next generation. The RE series will become my source for future generations. With consistently great drives and hassle-free warranty support Western Digital has earned my business.", "Date": "September 6, 2012"}, {"Title": "Outstanding Drive - Successfully Upgraded my 2008 iMac", "Author": "CH-Cincinnati", "ReviewID": "RTGPB74O8ISTX", "Overall": "5.0", "Content": "Bought this outstanding 2TB RE4 drive for its server class reliablity and 5yr warranty.  I just installed it in my wife's 2008 iMac (model code = EMC2211), and the upgrade went flawlessly.  I used the \"Super Duper\" free Mac disk cloning software to clone her original 320GB drive to the 2TB drive and then followed this tutorial to install the drive:  ([...]).  It was easy to do with no issues encountered.  Thanks Amazon for a great hard drive!", "Date": "August 11, 2012"}, {"Title": "good so far...", "Author": "Christopher Valdez", "ReviewID": "R2BA5B36USHBGN", "Overall": "5.0", "Content": "Just got it yesterday, transferred my existing windows installation from a dieing Seagate using EaseUS Partition Master, set new drive as active and its working great, faster transfer speeds than any other drive I have had.I'll update this review after I've had it a while or if it dies on me.", "Date": "August 10, 2012"}, {"Title": "So Far So Good", "Author": "North Jersey Boy", "ReviewID": "RA4TOWR5KMXA2", "Overall": "5.0", "Content": "I purchased 2 of these for use with my NAS Synology DS212.  They have been up and running for about 2 weeks with no problems.  THey arrived on time and in a user friendly packaging.", "Date": "August 10, 2012"}, {"Title": "Fast.  Quiet.", "Author": "bobbyg53", "ReviewID": "R2KZ7RF13NCZ8M", "Overall": "5.0", "Content": "Fast and quiet drive for at-home Synology DS112 NAS for Macbook Air and Pro Retina Time Machine backups and photo sharing/synchronizing.  Quietly efficient.", "Date": "August 5, 2012"}, {"Title": "so far so good.", "Author": "phungt", "ReviewID": "R38BWS3D14KNYS", "Overall": "5.0", "Content": "bought 4 of these for our synology box, seems very fast. been using for only a few months so can't comment on longevity yet.", "Date": "July 10, 2012"}, {"Title": "Good Seller!", "Author": "Floyd B Groves", "ReviewID": "R1WAFCYOTCRR33", "Overall": "5.0", "Content": "The drives were all working and shipping was on time.  I installed them in 2 servers and they all spun up after an immediate power outage.  Thumbs up on this seller!", "Date": "July 3, 2012"}, {"Title": "Satisfied Amazon Verified Purchase", "Author": "Ron", "ReviewID": "R2WAPZ15CEGH4S", "Overall": "5.0", "Content": "SATA, 64 MB cache, 7200 RPM at a reasonable price,more reliable than other brands and especially higher storage capacities. That includes Western Digital. I've gone through a number of hard drives in the past 10-20 years and it seems the sweet spot is 500 GB when it comes to avoiding premature failures. Normal lifespan of mechanical hard drives is 5 years. I've had quite a few 640 GB drives fail after only a year or two of normal use, no RAID, and suggested maintenance like periodic defragmentation. Consumer negative feedback on drives in the higher capacity ranges is much greater. All drives will fail so I see no reason to rely on one huge monstrous drive to store my data. I never use a drive larger than 250 GB for the primary OS boot drive. Monitoring the drive's health from time to time using a free software program like CrystaldiskInfo seems to support my theory. Sometimes more GB for the money doesn't mean better value. Just my two cents.", "Date": "July 1, 2012"}, {"Title": "Everything works great so far.", "Author": "RB", "ReviewID": "R1KRTE5AKXM2I5", "Overall": "5.0", "Content": "I bought two of these to replace two six year old 500 GB RE2 drives used for data storage in our file server. Never had any problem with the RE2 drives until the week I replaced them. Not sure if I was having a drive problem or not, but since we only had 20 GB capacity remaining it seemed a better idea to replace them while they were still working than to wait and see. One drive holds all the data, and is the drive that does all the work through the day, the other is used only for backup each evening, so it's just idling most of the time. The main data drive just disappeared one morning and we lost access to all the data. I was able to get windows to recognize it again, but it took a while and I couldn't rely on it to continue working, so I just set the backup drive to replace the data drive and ordered 2 new drives.Glad to see the prices finally coming back down. Wanted to wait for them to fall a little more, but prices are much better now than they were at the first of the year!No problems cloning the drives, no problems with anything so far. Don't expect any either.The packaging was sufficient and I ordered from Amazon, not from a 3rd party.", "Date": "June 19, 2012"}, {"Title": "Very impressed!", "Author": "Jeff H", "ReviewID": "R1A7EE4UO145X8", "Overall": "5.0", "Content": "After reading many of the online reviews of hard drives I was sceptical to say the least on finding an affordable yet durable well made drive. I wondered if when I installed it if I would be the next reviewer leaving a\" DOA\" review. Fortunately no. I'm not the computer expert but have built a few home systems and was very impressed to say the least at this drive. Fast, quiet, and sturdy drive. Only had it installed a few days and so far not even a hiccup. Will update again in a few months.", "Date": "June 2, 2012"}, {"Title": "I wanted an enterprise drive", "Author": "sbscomm", "ReviewID": "R12KRMKIX8FWJN", "Overall": "5.0", "Content": "This drive was used to replace my existing main drive in my MacPro. I wanted an enterprise drive for that purpose so I cloned it and it works perfectly. The price was great and the drive works flawlessly. I'd do it again.", "Date": "May 31, 2012"}, {"Title": "good deal", "Author": "Glenn physics", "ReviewID": "R7G4H0MOFWFKA", "Overall": "5.0", "Content": "I was pleased when I got this drive, it performed as expected. Arrived on time no trouble. I would do business with them again. This drive is a good drive for your operating system, as at 7200 rpm the indexing is fast, excellent performance.", "Date": "May 4, 2012"}, {"Title": "awesome little hard drive :)", "Author": "dahrahn", "ReviewID": "R3JY6USNPEB27V", "Overall": "5.0", "Content": "What can I say so far so good. I'm using this as my primary hard drive and I have no regrets. Its been awesome so far. Although a little loud when under load but I guess that could be because my computer case is all metal. Get this hard drive you wont be disappointed.", "Date": "April 29, 2012"}, {"Title": "kick a#%", "Author": "jeff c", "ReviewID": "R2DNV9NL27J2SA", "Overall": "5.0", "Content": "WOW!! this hard drive is GREAT! It takes every thing I throw at it. This was a replacement for a seagate 250 gig  7200 rpm 8 mb cache, the difference is like night and day. Glad I UPGRADED.", "Date": "November 5, 2011"}, {"Title": "It was good", "Author": "Ev", "ReviewID": "RXVBFAG95C2U2", "Overall": "5.0", "Content": "I really like the product. it was a good product and I used it to repair my mom's desktop. I would definitely recommend it to more people when they need to purchase one. For sure I will buy another one for my computer again.", "Date": "October 3, 2011"}, {"Title": "Perfect drives for RAID", "Author": "Moto", "ReviewID": "R2IQ9R6MWFVXK9", "Overall": "5.0", "Content": "I have eight of these WD RE4 2TB drives in a RAID3 for my video edit suite, and I've been 100% satisfied with them. Best choice for 2TB enterprise drives today!", "Date": "September 20, 2011"}, {"Title": "Fast WD drive", "Author": "Mike", "ReviewID": "R1JOKNT94109RS", "Overall": "5.0", "Content": "Bought the 500 GB version to replace a 10K Raptor.  So far so good.  The RE4 is near silent and that is a huge contrast to my old Raptor.  I think that is by far the biggest advantage of this drive over the Raptor.  The drive speed is as advertised, getting almost 133 MB/s at the beginning of the drive.  I think the seek time is a bit slower than the old raptor but the overall experience is about the same.  I am running this drive as a standalone unit, not running any RAID.  Hope this drive will hold up as advertised (as a RE4).", "Date": "September 18, 2011"}, {"Title": "Fast, cool, and quiet", "Author": "Milton Austin", "ReviewID": "R6Q01KG0BPMU8", "Overall": "5.0", "Content": "I have these drives in a Synology DS410 NAS.  They run quiet, fast, and cool.  Actually, with the fans on the DS410 set to \"cool\" operation, the temparature even under full load rarely goes above 90F.  They are quite fast, with me getting 40 MB/s over gigabit ethernet.  And they are quiet.  The only gripe I have is when they are put to sleep they take almost as long as the Windows 7 network timeout to wake back up.  I'd buy these drives again in an instant.", "Date": "July 29, 2011"}, {"Title": "Excellence at it's best", "Author": "brUcEg", "ReviewID": "RJCFJA2LN9WYE", "Overall": "5.0", "Content": "UPDATE: I bought the disks on May 2011. Today, 2 years later (June 2013), they're still rocking the house without a single problem in this 2 years.Today they're 100 dollars cheaper. I would buy them again at original price without thinking about it twice---------------I'm using two of this babies with a Linksys NAS200, Mirroring with Journaling.This is a quiet HardDisk, and so far all good and happy---------------", "Date": "June 10, 2011"}, {"Title": "WD RE4 Drives Rock!", "Author": "J. Kinsey \"ptchfrk\"", "ReviewID": "R2G3CQ7SX6WZQB", "Overall": "5.0", "Content": "Western Digital RE4 drives rule the roost. Like the \"Energizer Bunny\" they just keep going. When utilized as a primary drive the 64MB of cache, along with 7200rpm spin make for very quick boot times. The 5 year warranty's not to shabby either. Enterprise class drives are put together with more spit and glue than your average drive. If your going to take the time and spend the money to build a computer, or simply upgrade your current hard drive(s) it's in your best interest to do it right. Buy the best tools for the job. WD RE4's, of any capacity, make the build, or upgrade, worthwhile.", "Date": "May 15, 2011"}, {"Title": "Flawless", "Author": "Oliva \"Olly\"", "ReviewID": "R22EGCUUSGF235", "Overall": "5.0", "Content": "Installed in my Mac Pro 2008. Cloned my boot drive to it an have been using full time for a week. Drive is silent (really I can't hear anything even if I put my ear to the computer case.) It is faster than the WD Blue that came OE with the Mac. It just works flawlessly. Nothing more to say. Anything different happens I will update my review.", "Date": "May 14, 2011"}, {"Title": "Fast and reliability in one", "Author": "Juan A. Pons", "ReviewID": "R1QAJGG7NZ1KGK", "Overall": "5.0", "Content": "If your enterprise data is valuable to you, then these are the drives to get. Much more expensive than the consumer versions, but when reliability is a must, these are the drives to get.", "Date": "April 6, 2011"}, {"Title": "RE4...", "Author": "Dallas Home IT and SB supporter \"Reviews you ...", "ReviewID": "R30F1DSIU09HWP", "Overall": "5.0", "Content": "Personally, I bought this drive simply becuase the client wanted the enterprise 5 year warranty.  I didn't use it in a raid application, but am thouroughly pleased with simple IDE usage.  Not even running AHCI on it.  Just keeps it simpler.", "Date": "February 24, 2011"}, {"Title": "SO LOUD YOU CAN'T EVEN THINK!", "Author": "Tim K", "ReviewID": "R4P1JSH7XEE4F", "Overall": "1.0", "Content": "Awful, extremely loud drive- constant grinding noise on every disk access. Instead of using my new hard drive, I ended up listening to it, wondering when it was going to explode. It was so bad, I returned it after less than an hour's use. Packaging is also poor and doesn't protect against bumps and shocks during shipping. I bought a Samsung for half the price and it performed just as well and is whisper quiet.", "Date": "November 4, 2011"}, {"Title": "failed after 2 months", "Author": "Amazon Customer", "ReviewID": "R1T2ST6DIJLNWN", "Overall": "1.0", "Content": "This drive failed after 2 months. I'm so sick of mechanical hard drive failures. I think I may pay the higher price to go SSD and never look back.", "Date": "November 9, 2011"}, {"Title": "False Advertising - Beware", "Author": "GetYerGoat \"Goat-Link\"", "ReviewID": "RPTTVWP0N0LPQ", "Overall": "1.0", "Content": "Fortunately I contacted this seller (Aeon Micro) regarding the wd re4 1tb harddrive listed for 90.50usd . All over this listing it states this drive comes with a 5yr manufacturers warranty. This is FALSE. After several emails back and forth, Aeon Micro had this to say:\"Hello,Though these are new/ factory sealed drives, There is only about two years manufacturer warranty remaining on them.Regards,Aeon Micro\"This information was brought to my attention 7-23-2013. If you are considering a WD drive with only a 2yr warranty, you may as well save yourself the money and purchase a model such as a WD Caviar Blue which only comes with a 2yr manufacturer warranty. Over half of the warranty for this product (ASIN: B003SANWI6) has passed. I have graciously given this seller 1 star only for the fact they were prompt in replying to my questions. Too bad they weren't more concerned with coming clean up front so buyers knew what they were about to purchase, rather than wasting 2 days emailing back and forth only to get the real story.", "Date": "July 23, 2013"}, {"Title": "Very good hard disk", "Author": "Justin", "ReviewID": "R2U7MS6AMDI34T", "Overall": "5.0", "Content": "I purchase it for replacing my old WD 1TB black, and I think it's a good deal:)good performance and very stable with 5-year warranty, fantastic!Besides, the retailer's service is very good!", "Date": "July 25, 2013"}, {"Title": "Works great", "Author": "Chris Koger", "ReviewID": "R3SOU6BC8LG5XX", "Overall": "5.0", "Content": "W D makes good disks and this proves it.  Hard drive has plenty of space and works great in my computer", "Date": "June 27, 2013"}, {"Title": "Received Disks with Multiple Model Numbers (one of them is being illegally resold)", "Author": "Jonas Bendsen \"i'm trying to help you\"", "ReviewID": "R21ZZ1Q2BJ6SGC", "Overall": "3.0", "Content": "UPDATE:  Even beyond the problems listed below, I did not realize that these are only Sata II drives.  Yes, shame on me for not reading the fine print (the information was NOT in the title when I purchased these), but who in the *%&$# is still selling Sata II drives these days?!  That should not be something I need to pay attention to, especially when the EXACT SAME RE4 SATA III DRIVE IS THE SAME PRICE.  So... DO *NOT* BUY THESE DRIVES.  Buy the faster SATA III for the EXACT SAME PRICE.I'm pretty ticked off.  I was sent a resold drive that has NO WARRANTY.It annoys the heck out of me when I order from Amazon, using the same link, but I get two different products (from two different vendors, especially when one of the products is from a SHADY VENDOR SELLING ITEMS THEY SHOULDN'T BE SELLING).Two weeks ago I ordered a 2TB WD enterprise RE4 disk from Amazon.  It was shipped by SERVERTECH INC and the model number on the drive is WD2003FYYS-02W0B1 (this is a valid product with a proper warranty).Two weeks later I ordered the EXACT same drive from the EXACT same link, but it was shipped by Aeon Micro, Inc., and the model number is WD2003FYYS-18W0B0.Not only did the second drive have a different model number, but it DOES NOT have a Western Digital label.  Instead, the label looks more generic and states \"Enterprise class certified by Dell.\"  When I entered the serial number to register on the WD site, the information showed that this drive is a NO WARRANTY drive.  The exact wording from the WD site is: \"Product was originally sold to a system manufacturer. Please contact the system manufacturer or the place of purchase for warranty service.\" I'm ticked off to say the least.I am still giving four stars because these drives are solid and amazing and I believe these reviews should be about the product, not Amazon's failures, but hopefully Amazon works harder to provide the same item instead of switching vendors for the same link every two weeks or so.  If I am given ANY flack about returning this drive to receive a PROPER one, I am going to be REALLY angry.  I will already be out the time taken to ship (and now ship back and receive a new one), not to mention the effort to repackage, go to the shipping facility, and ship the drive back to Amazon.ALWAYS GO TO THE MANUFACTURER'S SITE TO REGISTER YOUR DRIVES IMMEDIATELY UPON RECEIVING THEM. This is the quickest and easiest way to find out if you have been sold a legitimate drive (I wasn't).***UPDATE: It should be noted that Aeon Micro was extremely quick (less than 12 hours) to remedy the situation.  I was sent an RMA and postage paid shipping label, and they actually over-nighted a brand new drive (manufactured in March of this year) with the appropriate WD label even before I returned the drive that had been manufactured for Dell builds and resale.  I'm still not sure why Aeon would ship out drives sold specifically as \"system build\" drives for Dell (and thus carrying NO warranty from the manufacturer), especially as fulfillment from an Amazon link showing original WD-labeled OEM drives, but they were quick to remedy the problem ONCE I POINTED IT OUT.  I'm not sure every consumer knows to check their drive on the manufacturer's website upon receiving (I only knew because I had read about a similar problem in another Amazon review).  So... the way the problem was handled was *excellent*, but it's still a problem that should never have occurred in the first place.", "Date": "May 9, 2013"}, {"Title": "It's a hard drive.", "Author": "Kevin", "ReviewID": "R23EBM1T5VQPAJ", "Overall": "5.0", "Content": "Lots of space, remembers things. It's a hard drive. 11 more words needed to finish this review. Just three now.", "Date": "April 16, 2013"}, {"Title": "Awesome Drive.", "Author": "Brian", "ReviewID": "R1QUA172AW60AW", "Overall": "5.0", "Content": "I will only use Enterprise drives in my system any more. I have had too many hard drives fail in the past.. not to say these are bullet proof. But there fail rate is a lot better then regular desktop drives. I use these in my Drobo and in any desktop, Also enterprise drives are a must for any Raid setups especially Raid 1 Mirrors.", "Date": "April 15, 2013"}, {"Title": "Room to grow", "Author": "Mitchell A McGinnis", "ReviewID": "R2RF3RS0DGPAI8", "Overall": "4.0", "Content": "Great product. I wasnt looking for SSD speed, so im not dissapointed. I wish the read/write was a bit higher. I never benchmarked it, but for a new HD it doesnt seem a bit faster than my old Samsung.", "Date": "February 26, 2013"}, {"Title": "Great Drive", "Author": "Josh90", "ReviewID": "R1OVNKYYY5JG9I", "Overall": "5.0", "Content": "When my rarely-used gaming desktop's hard drive failed after just three years, I was pretty irritated.  I wanted something that was reliable above all, and I wasn't too concerned about speed or noise or much else.  I decided that an enterprise drive with a 5-year warranty would do the trick, and I bought this one.  It's not as fast as the 256GB solid-state drive in my MacBook, but it shouldn't be.  This is easily the fastest mechanical hard drive I have ever used, despite being handicapped with SATA 2.0.  I see this as a bonus, since I was really just looking for reliability.  I bought the 1TB version for about $110, which I think is a pretty good value considering the drive's five-year warranty and performance ambitions.  If you're looking for negatives, the only one I can come up with is noise.  Most drives today are nearly silent--this one is not.  It's definitely not a bad noise, it just reminds me of the way my old desktop from 2005 sounded; just faster and more refined.  I'm not bothered by it, and it certainly deserves all five stars.  With 6GB of RAM and my 2009 Core i7 Quad processor, Windows 8 Pro boots quickly and runs brilliantly.", "Date": "February 26, 2013"}, {"Title": "So far so good", "Author": "Rayquaza Ja'darious", "ReviewID": "R2KKWDMVVAAUEV", "Overall": "5.0", "Content": "Fast, reliable drive. Has a large cache and comes from a reputable brand in a reputable country. Eat it seagate", "Date": "January 24, 2013"}, {"Title": "Western Digital Enterprise is the best - for a price.", "Author": "larrydd", "ReviewID": "RDPTLWQSZFSY8", "Overall": "5.0", "Content": "We've been upgrading our systems recently, and have found that spending more for a superior product with a serious warranty is easily worth it. These drives are fast, quiet, and reliable. We've never received a DOA and have never had to look for warranty service.", "Date": "November 25, 2012"}, {"Title": "Bought 4, got 4 working", "Author": "Shawn M.", "ReviewID": "R2KKAHHRR8N1QS", "Overall": "5.0", "Content": "Using these with a 3ware 9550SX-12 RAID card, and all 4 are working fine and have been for about a month. The machine is running OpenFiler, and these are acting as storage. No problems here.Note: I learned the hard way that you simply can NOT use WD15EARS drives in RAID or any other non TLER drive from WD anymore. They have gotten wise to us using non enterprise drives and switching TLER through firmware and saving money. Well, not anymore folks... I know that there are reasons behind WD doing this such as the fact that it may be more risky for someone to use a regular hard drive and switch TLER and use it in production and have problems later on.. who knows? Maybe WD is trying to save us from ourselves, haha. I'm sure the increase in enterprise drive sales also doesn't hurt their feelings.No complaints.", "Date": "November 18, 2012"}, {"Title": "So far so good, for Win 7 system.", "Author": "sliprocket", "ReviewID": "R1BWNMVYT9DCDQ", "Overall": "5.0", "Content": "Had this drive for two months with no problems.  I will order 3 more RE4 drives.Pros:Not DOABios had no problemsWin7 install had no problemsWin7 performance rating of 5.9Cons:None that I can detect at this pointConclusion:Win7 works great on a home built system with this drive.  I need three more but will purchase the 1TB instead of 500GB.", "Date": "August 24, 2012"}, {"Title": "Reasonably priced, fast, reliable storage.", "Author": "dave.mack", "ReviewID": "RRYA1S6GKMVP0", "Overall": "4.0", "Content": "I had been using Seagate 500GB drives for new workstation builds but the price on those drives has remained relatively high while the price on the Western Digital Enterprise-Class 500GB drives has dropped to the point that it's the same price or cheaper for enterprise-class drives compared to desktop-class drives.  While we haven't had any failures in the Seagate 500GB drives (several dozen sold), using enterprise-class drives adds some perceived value and reliability to the workstations.  Theoretically these drives are a little faster than the Seagates too, although I doubt any end user could tell the difference.  The 5-year warranty is nice, too.", "Date": "July 27, 2012"}, {"Title": "Good Drive & 5 Year Warranty", "Author": "Snarly", "ReviewID": "RW5TH3RY9LFXX", "Overall": "5.0", "Content": "I bought this through an \"Amazon Fulfilled\" site.  I checked the serial number and it shows a 5 year warranty.  The drive works fine.", "Date": "July 18, 2012"}, {"Title": "(Hopefully) Reliable Storage", "Author": "M. Hutchens", "ReviewID": "R251R320RA0W0Y", "Overall": "5.0", "Content": "It performs as advertised.  I haven't noticed any major issues with heat or noise.  I'm using this in an external enclosure for moving files and backups.  I've had it about 4 weeks and I've got no complaints.", "Date": "July 16, 2012"}, {"Title": "Better than black", "Author": "B. Thorp \"Moo\"", "ReviewID": "R195AEVFSFS5FD", "Overall": "5.0", "Content": "Usuaully I'd be finding myself getting a 320, 640, or 1 or 2TB WD Black drive, however due to the market of drives, this one ended up being the best size for the dollar.  The last time I found myself buying an Enterprise drive was back when they were 80GB -- and that one still runs strong.I was very surprised to how quiet this drive is -- as quiet as a black, however its faster than my preferred drive (WD Black 640GB 64mb SATA6) and doesnt back down under load.This model also has firmware to enhance performance once in a raid, which I plan on doing once its price drops more.", "Date": "April 18, 2012"}, {"Title": "Very good service", "Author": "dps_mike", "ReviewID": "R22TOYF7Z2R2N2", "Overall": "5.0", "Content": "Product arrived promptly and was exactly as described and has performed perfectly since being installed. I'm very happy with this item and the quick shipment.", "Date": "March 25, 2012"}, {"Title": "Very Fast", "Author": "Stelai", "ReviewID": "R1PYSHDXV2PSRQ", "Overall": "5.0", "Content": "I love this drive.  I use it with 3 others in a raid 5 setup.  So far so good.  Runs fast and tsays cool enough they don;t burn my hand.", "Date": "February 26, 2012"}, {"Title": "Great product for the price", "Author": "M. Schwab \"Nomad3\"", "ReviewID": "RN90R810KPOHQ", "Overall": "5.0", "Content": "I bought this hard drive to help troubleshoot my parents' computer problems.  I am very happy with this product.  Other reviewers commented that the hard drive was too loud.  However, I don't think it is loud, especially considering the speed.  I recommend this product.", "Date": "December 13, 2011"}, {"Title": "Review 001", "Author": "Informed Shopper", "ReviewID": "R15687ZZG6I2KH", "Overall": "5.0", "Content": "Great Hard Drive.Start up,Over all system response quicker.Replaced older 500 Gb Western Digital drive with 32 meg cache.Packaging Good,Delivered on time.Buy it,it's a Good Product that works.Thank you.", "Date": "November 19, 2011"}, {"Title": "All good", "Author": "R. Griffen", "ReviewID": "R3UDEW97BRAFX3", "Overall": "5.0", "Content": "I will second P. Levine's positive review on the packaging.  Mine was identically packed and included being in a sealed antistatic bag.  Looks like it's not a fluke.  Online vendor packaging is frequently so bad that I believe the 10% plus DOA or early death rate for drives is due to this issue.  Kudos to Amazon.About the drive.  It's fast and very quiet. No issues.  The RE4 is an Enterprise quality drive and per WD, each is burned-in before shipping.  I'm happy to trade a few more bucks to reduce the chance of HD failure.", "Date": "March 20, 2011"}, {"Title": "Bought 2: One Was Good, One Was Bad", "Author": "Mountain Bill", "ReviewID": "R3U76AJ2W8DRF6", "Overall": "3.0", "Content": "I bought two of these Western Digital RE4 WD2003FYYS 2 TB 64-meg cache drives for use in a quad-processor desktop PC with a Raid 1 configuration, 4-gigs of memory, running Windows 7 (32-bit).  When the drives arrived, one was working and the other one had numerous bad sector errors (according to WD's drive evaluation DOS utility). Both had been well-packed for shipment: each OEM drive was packed in foam in it's own box, and then each of those boxes were surrounded by bubble-wrap and then packed in another carton. Since these were supposed to have been ultra-reliable \"enterprise-class\" drives, a failure rate of 50% wasn't what I had expected. RMAed both of the drives and instead bought two WD1002FBYS RE3 1 TB 32-meg cache drives. The RE3 drives have been working fine since installed.On a more positive note, when tested against my 3-year old Hitachi HDP7250GLA 500 GB drives with a 16-meg cache, the WD2003FYYS drives (in a Raid 1 configuration on my system) had a 90% faster average access time (19.8 for the Hitachi HDP7250GLA vs. 10.4 for the WD2003FYYS).  Most of that difference likely due to the 16-meg vs. 64-meg disk cache -- along with improvements in hard drive technology over a period of 3 years. Comparing the RE4 WD2003FYYS to the RE3 WD1002FBYS drives, the WD1002FBYS drives' average access time is about 18% slower -- although still 56% faster than the two older-model Hitachi's that they replaced.", "Date": "August 22, 2010"}, {"Title": "High Performance , High Quality", "Author": "PoultryLogistics", "ReviewID": "R1R9MD0U62Q32S", "Overall": "5.0", "Content": "29 June, 2011Having hovered on the fringes of 3D CAD long enough, I recently purchased a used Dell Precision T5400 workstation (Xeon quad core 3.16 Ghz, 4GB RAM, 1TB Hitachi, Quadro FX570 video card) to get the best performance I could using AutoCad Revit 2011 and Inventor Pro 2011- both very demanding 3D CAD programs.  I upgraded the T5400 to 12GB RAM, and from Vista Business 64-bit to Windows 7 Ultimate 64-bit, and today I'm adding an NVidia geforce GTX 285 1GB that will configured to emulate a Quadro 5800 CAD oriented card- (and thereby saving about $3,000 on the card). Because I'm not very disciplined with backup and always worried about HD failure- though I've only had 2 failures in 18 years, I decided to set up- eventually -a RAID 1 that would have a pair of HD's that continually mirror each other.Having had good luck with Western Digital drives and read many HD reviews, I chose a Western Digital RE4, 500GB. Another contender was the single platter Samsung 500GB which is also very fast. Early on during research, I was planning to buy a pair of WD Caviar Black 1TB, but WD has arranged that only the Enterprise series can be configured for RAID- some sort of error correction is not present in their other series, so an RE4 it was.  Instead of having to learn how to set up the RAID, for the time being, I decided to take the 1TB Hitachi out of the T5400, mount it in a USB HD enclosure (Sabrent eSATA to SATA aluminum) and for now this external drive would become the backup drive. The external drive will only run when backing up and I'm hoping that will extend it's life substantially.  By the way, the Sabrent aluminum enclosure is brilliant- very nicely made and has a extremely quiet fan which keeps it very cool. The blue lights give it a serious, almost military hardware quality.The Precision T5400 has a wonderfully convenient HD carrier assembly that unclips and swings out and the drives are held in caddies that can be unclipped and draw vertically from the carrier. It's possible to change drives in less than 5 minutes. Having had a disaster while using Paragon Suite 10- during which the 1-year old WD 750BG disk from my XP machine (Dell Dimension 8400) became a door stop, I set the RE4 in the second drive caddy on SATA 1 and cloned the Hitachi (on SATA 0)to the RE4 using Easus ToDo 2.5 which is a free version, and excellent- you can be cloning in minutes. I recommend that anyone contemplating an HD upgrade spend an equal effort in carefully choosing utilities- the software I bought ruined a HD and created many hours of frustration, while the free product sailed through.  When cloning the partitions from the Hitachi to the RE4, the transfer ran initially at 3.87GB/min and at the end, at 3.2GB/sec. In all it copied about 120GB in four partitions in about 29 minutes. I used the Easus to copy a backup of C: to another HD partition in a Dell Optiplex 740 (Athlon 64 dual core 2.4Ghz, Hitachi 500GB) and the transfer rate was about 2.4GB/min- still seeming quite fast.  The 64MB cache of the RE4 is something that improves read/write rates, and that may be a lot of the difference- it really works. Checking at the end of the cloning session, the RE4 was running at 89F and the Hitachi in the enclosure at 110F.  At the moment, the RE4 is at 82F- only 10 degrees above the room.  I was surprised that with the RE4 my Windows Experience index for the T5400 disk remained the same at 5.9, as the startup, application speeds, and transfer times seemed very much improved.The RE4 is very quiet- and the T5400 has a heavy case and cover that probably assists this, and it seems to me to have less vibration than any drive I've had. Looking at it physically, it seems more substantially made, and I can see that the base of the platter spindle is large diameter.  WD touts this extra rotational stability as a reason they can offer a 5- year warranty- and it must be effective. If you are using CAD, a good video card is essential in combination with fast read/write drive speeds. And, if you're on a budget as I am, consider high end gaming cards that use the same GPU as CAD-oriented cards. There are several NVidia geforce cards that can act as extremely expensive Quadros. Wikipedia has a fantastically useful table of quadro cards with notes on which geforce uses the same GPU. You can use a utility to simply rename the card as the CAD version and using the CAD drivers, save, save, save while having very high CAD performance. That's how the GTX285 can emulate a Quadro 5800 costing 10 times as much (note: the 285 is 1GB and the 5800 4GB).  If you use Autodesk products, you can download optimized drivers for their recommended cards. Gaming cards concentrate on fast frame rates- abbreviating shading and rendering while CAD cards shade and render every frame fully. In these applications the combination of fast disk and fast video can transform the 3D CAD use.  Newer software is increasingly taking advantage of multiple cores as well- if you have AutoCad 2007 or newer, type WHIPTHREAD in the command line, choose one of three configurations, and it will optimize core threading.A word about HD size: When contemplating my needs for HD space, I determined that all the files I've created since 1993- excluding many GB's of audio files on my recording computer (HP Elite quad core 3Ghz Q6600, 8GB RAM)- is only about 25GB and that includes 9,000 documents, 600 AutoCad drawings, and 11,000 images. When I set up the Hitachi drive- which was a 1TB,  I created a 100GB partition for the OS and Programs, 100Gb for active files, 100GB for archive files, and the remaining 700GB for a backup copy of C:. Adding it up- 45GB in C:, 22 in D:, 18 in F: and 45 in G:, at this rate I could theoretically use something like a 160GB drive with room for 10 more years of work.  Message- have a look at your real storage needs.  Also, consider a reasonably compact partition for the OS/programs- because the tracking arms then have a shorter distance to travel, the access time is noticeably reduced and of course, partitions are virus resistant.  With the RE4 \"short-shifted\" in this way, except for the huge 3D applications, starting applications like WordPerfect X4 and Corel Photopaint is more like \"snapping\" them on- they just appear instantly. I changed the video card in the Optiplex 740 from onboard shared 1GB ATI Radeon 6150LE to a Quadro FX 570 (256MB) and the Windows Index for gaming graphics went from 3.7 to 4.9 and the important for me graphics index from 3.0 to 4.6- a 60% percent improvement. By the way, over the years, Dell computers seem to have a consistently high synergy with NVidia cards.Overall, the Western Digital RE4 500GB, is a very satisfying product that seems a good step above in quality and performs better than any drive I've had. 3D CAD is very read/write intensive and the 64MB cache of the RE4 is surely helping- and can properly support the speeds of a high performance video card.  The RE4 may be the beautiful swan song of mechanical HD's- and my last mechanical HD purchase. When 320GB SSD's are $100,...Summary: The extra cost for the RE4 is one of the best uses for $20 I can think of! Consider carefull, disk utility software, using compact OS/application partitions, and a video card that in combination can utilize the capabilities of the RE4.  Amazon as usual did very well, and the RE4 was sent in a fitted box with formed plastic end holders.Cheers,PoultryLogistics", "Date": "June 29, 2011"}, {"Title": "As Advertised", "Author": "J. T. Hicks", "ReviewID": "R2TKJ954EYJP1I", "Overall": "5.0", "Content": "Just installed it and check enitre disk for errors -- none found -- just what I would expect from a premium-priced hard drive.  If you don't hear back from my it is safe to assume it is continuing to work well.", "Date": "April 16, 2011"}, {"Title": "Western Digital Hard Drives Have Always Been Reliable In My Computers", "Author": "Welford Hester", "ReviewID": "R1KR68GK3TLZZD", "Overall": "5.0", "Content": "This hard drive has run beautifully so far. It has mate all of my expectations.I would recommend this internal hard drive.", "Date": "June 29, 2013"}, {"Title": "33.3% Failure Rate", "Author": "Gene P. Louie", "ReviewID": "R1F8ED4LVJZLJL", "Overall": "1.0", "Content": "Here are the positives and negatives of this product...ADVANTAGES.1. \"Enterprise\" means durability. The unit is designed with over engineered and quality parts to cope with the requirements of commercial servers..2. The specs look \"state of the art\" for hard drives...DISADVANTAGES.1. The unit runs hot. You can feel the heat on the case..2. It is every expensive - almost double the cost of a standard 2TB hard drive on sale at Frys Electronics..The cheapest price for this model in the U.S. is sold by GoHardDrive, an online store on the Ebay website. I purchased three at $84.95 each. The original asking price was $89.95, but I was able to negotiate a $5 discount..The shipping was free, and there was no sales tax. The package arrived fast - within three days by USPS..3. Western Digital does not provide any software to format and partition the hard drive. The manufacturer website details the necessary procedure using Windows Drive Tools, which is provided in the operating system. Unfortunately they do not work..As an alternative, I went to the Seagate website and downloaded DiscWizard. This free software was essential in setting the MBR format..Afterwards, I downloaded AOMEI Partition Assistant, a free open source product. This software was used to create the necessary partitions on the drive...--------------------------------------------------------------------------------------------------------------------------------------------------------..UPDATE.I purchased six drives. Within three months, two went bad. The first could only hold a portion of its rated storage space - it could not store anything beyond 1.2 TB. The second developed a defect on the MBR track. The drive would not boot; it did not show up as a partition in WINDOWS EXPLORER; reformatting the drive did not correct the problem; and resurrecting an image of the boot partition was unsuccessful. A 33.3% failure rate at these prices is not acceptable.", "Date": "May 7, 2013"}, {"Title": "Works wonderfully, but noisy!", "Author": "Michael D. Donahoe", "ReviewID": "RGV6FWDFBXYDV", "Overall": "4.0", "Content": "I just replaced my Seagate that was failing with this product.  So far I'm happy with the performance, nice response times.  However, I've never heard such a noisy hard drive. This is sort of a pain for me as I do some video / audio recording and editing and this much noise is a problem.All in all, I'd say a great value, and if a chattering hard drive isn't an issue then well worth the purchase.", "Date": "March 29, 2013"}, {"Title": "Sweet Deal", "Author": "DMBlueFox", "ReviewID": "RHFTJ80CKJIZI", "Overall": "5.0", "Content": "Faster than any hard drive I have owned before-I use it for gaming (GTA 4, BF3, SC2, Skyrim, Minesweeper etc)I use it for media- data transfers are a blast- it keeps up pretty good with my SSD that I've got set up for booting.The 1 Terabyte version of the hard drive has been reliable up to now, and it's been about a year- I'm quite pleased with it- felt like leaving mention of it here. Thx, ciao", "Date": "March 4, 2013"}, {"Title": "It works good and it's cheap", "Author": "Kirk", "ReviewID": "RPV3RP8TRBETP", "Overall": "4.0", "Content": "I like Western digital hard drive because they seem to be more reliable, and quieter than other brands. However, in a 24/7 server I only get about 4 years before failure sometimes 5.  But it is cheap for a lot of storage.  Excellent as a backup drive.", "Date": "August 5, 2013"}, {"Title": "work greate for the EMC/Lenovo/Iomega ipx6 nas", "Author": "D. nguyen", "ReviewID": "R3K7M75F0JZWEW", "Overall": "5.0", "Content": "Got 6 of the drives (5 from Amazon -- due to limit / account) and put in a 6 bay NAS storage (also from Amazon) and I have a decent  NAS of 9+TB (raid5).  If the 3TB Red edition was available, I would get that instead -- but, it was not on sale.", "Date": "June 13, 2013"}, {"Title": "Great love it", "Author": "Nathaniel", "ReviewID": "R1U3OE19DB20B7", "Overall": "5.0", "Content": "Runs good and faster then my last hard drive maybe just because windows 7 is freshly installed on it as it is a new hard drive and has nothing really stored on it ... Love the Hard Drive Western Digital makes some of the best hard drives with a lower fail rate then most !", "Date": "June 1, 2013"}, {"Title": "This hard drive is in reality a Western Digital \"Black\" 7200 (64MB of cache) SATA hard drive version SATA II.", "Author": "david j gibson", "ReviewID": "R209AJ5DZUW7YP", "Overall": "5.0", "Content": "For \"older\" motherboards that support SATA II this hard drive is simply superb. It is indeed a Dell hard drive and Dell calls it an \"Enterprise Hard drive\". In reality it is really a Western Digital \"Black\" 7200 hard drive with 64MB of cache, version SATA II. And of course it will work on either SATA I or SATA III motherboards as well. It just happens my new motherboard supported SATA II so this HD is a perfect match.", "Date": "May 31, 2013"}, {"Title": "WD RE4 500 GB Enterprise Hard Drive", "Author": "D. Guaetta \"Guedo1\"", "ReviewID": "RLIVJQHDJOJSK", "Overall": "4.0", "Content": "I had (2) Seagate Hard drives go out on me within a period of 2 months.  I'm hoping that the Western Digital will surely last me a longer period of time than the Seagate.", "Date": "May 18, 2013"}, {"Title": "Excellent", "Author": "Henry Starcher", "ReviewID": "R1UPJT4O6LGFWG", "Overall": "5.0", "Content": "Excellent product. Running fine so far in an old Dell PE1900 server functioning now as a backup domain controller for organization", "Date": "February 8, 2013"}, {"Title": "Hard Drives for NetGear NAS Raid", "Author": "BernardC", "ReviewID": "R32PSDAW34VH5W", "Overall": "4.0", "Content": "So far, so good! The Hardrives appear to be functioning well. The install was a snap and the drives seem to be compatible with the NetGear NAS Raid", "Date": "December 28, 2012"}, {"Title": "2 of 5 failed", "Author": "Jeromy Leugers", "ReviewID": "R182XH9ER63DPO", "Overall": "3.0", "Content": "I purchased five of these in July of 2012.  One failed on me in November 2012, and RMA went successful.  A second one just failed on me this week (March 2013), so I'm going through the RMA process again.", "Date": "November 30, 2012"}, {"Title": "2 PUCHASED 2 WORKING FINE! GREAT DRIVES!!", "Author": "Amazon Customer", "ReviewID": "R1YTC21O8SDP9", "Overall": "5.0", "Content": "I PURCHASED 2 OF THE 500GB RE4 DRIVES. ONE FOR ME, ONE FOR CLIENT. BOTH ARE RUNNING PERFECTLY! 5 YEAR WARRANTY IS A PLUS. THANK YOU AMAZON FOR SELLING @ SUCH A BARGAIN. DRIVES BOTH MADE IN MALAYSIA, WHICH IS IMPORTANT TO ME AS AN ENGINEER!", "Date": "November 15, 2012"}, {"Title": "They works for now.", "Author": "Valeriy Tolkov", "ReviewID": "R1TJZU2TZK9K6C", "Overall": "4.0", "Content": "I've purchased them to replace failing drives. They have saved my data and work fine. Don't know what can I say more.", "Date": "November 13, 2012"}, {"Title": "Good RAID drive", "Author": "Jo Osborne", "ReviewID": "R3QLZQSMTMSH1B", "Overall": "4.0", "Content": "I will be using this drive to fill out a 6 drive RAID 10 configuration on my home file server.  WD product quality is not what it was 10 years ago, but WD is still (in my opinion) the best of the SATA hard drives.  Tests posted below run on a Gigabyte P67 MB with Intel 2600K I7 CPU, 32GB memory.HD Tune benchmarksMinimum: 64.6 MB/sMaximum: 113.3 MB/sAccess time: 16.2 msBurst rate: 94.4 MB/sCPU usage: 7.8%One negative comment on Amazon shipping policy.  If you choose Super Saver (free) shipping, your order will not ship for 3-7 days.  Amazon rep says they hold the order until several free shipping orders are ready to ship and then ship all of them at once.  Other internet retailers (Buy.com, Newegg.com) will ship immediately.  If you need it fast from Amazon, either buy elsewhere or pay for faster shipping.", "Date": "May 31, 2012"}, {"Title": "Disappears from Server System - Requires Newer Controllers", "Author": "MissingNoFingers", "ReviewID": "R1YYLTX3F1I7U", "Overall": "3.0", "Content": "When used with a 34xx/54xx/58xx Adaptec SATA RAID controller, this model of drive may disappear from the system and go offline.  Consistent testing shows this western digital wdc drive will fail and the problem can be replicated at will, however, installing older WDC models (RE3, RE2, RE drives) will not fail, so seems to be an issue with the new RE4 firmware on this new drive.  Tried multiple WD1003FBYX drives - all with the same disappearing act.  A Search for \"wdc drive disappears from system\" will show you numerous people reporting these type of issues. It has been suggested that this is due to firmware of the drive and it's speed control, which western digital has released a fix for others that had a similar issue as this one. I will add that I believe WDC drives are the best on the market though, so this matter is limited to this drive and specific types of systems. You may not experience the problem.Update: 11/07/2012 - As it turns out, this drive is not compatible with some of the older RAID controllers and found several systems this would consistently fail on using Adaptec 3405. As it so happens, replacing this drive with an older model resolved the issue.", "Date": "May 13, 2012"}, {"Title": "Great product; great price", "Author": "Rw Scolari \"navy689\"", "ReviewID": "R2BRPZKKA5CA09", "Overall": "4.0", "Content": "This is a replacement drvie for an older, smaller, slower Western Digital drive.  As prices drop, capacities increase the black series of WD drives leads the pack.", "Date": "October 8, 2011"}, {"Title": "Faaast drive!", "Author": "L. Iacono \"Jungle\"", "ReviewID": "R2KBM1JWTGX7SZ", "Overall": "5.0", "Content": "The fastest drive on the market with a motor. It works great for video projects and music production. This unit is more expensive than all other drives in its class, but for a reason.", "Date": "March 5, 2011"}, {"Title": "great hdd for enterprise service", "Author": "Jesus Gonzalez-Brey", "ReviewID": "R1WB6XFI69FVP0", "Overall": "5.0", "Content": "work as expected very fast for a mechanical drive no cons ask me again when they have been in service for a few years.", "Date": "July 7, 2013"}, {"Title": "Review", "Author": "JMan 31337", "ReviewID": "R2A2DP08W1X319", "Overall": "3.0", "Content": "Had to send the first drive back because had way to many bad sectors. You think they would have better quality tests. Other then that it is a good drive.", "Date": "February 26, 2013"}, {"Title": "As expected", "Author": "William S. Phelps", "ReviewID": "R3R8VVC7GUZ5C2", "Overall": "4.0", "Content": "This hard drive is exactly what I required and expected.  It is fast, quiet and dependable.  It is in no way lacking and in no way exceptional.  The price is right.", "Date": "February 10, 2013"}, {"Title": "Abnoxiously LOUD!", "Author": "Jeffrey Puglisi \"Savgrace\"", "ReviewID": "RB8KZC0VT97X3", "Overall": "2.0", "Content": "I seriously regret not returning this drive within the 30 days.  I ran performance and drive integrity texts in Ubuntu and the drive had no problem passing all tests in the green.However, I would only recommend this drive to anyone who has it isolated within a server room or in a sound proof box! You can't even think straight if you use this as your primary drive as every single access sounds like the ancient MB drives from the 80's!  LOUD LOUD LOUD!  Crunch, Grind!I'd think the think was going to fall apart if it didn't pass all tests!  First and LAST WD drive I'll ever buy! Stick with Seagate or Samsung... or go Solid State!", "Date": "October 9, 2012"}, {"Title": "good appliance for small business without IT dept", "Author": "Michael Robinson", "ReviewID": "RHLOMGOM7QVP2", "Overall": "4.0", "Content": "As a small business owner with pretty good computer skills I found it easy to set up and implement. I bought it as a cost saving measure since all I wanted was good, reliable file sharing, and remote access to my files and desktop computers. I think the WD has filled the need just fine. It got me out of the more complicated domain management business. It will save me thousands of $ over the next few years. I did go ahead and buy an extra drive and power supply to have on hand. I figured it was a small price to pay for that extra layer of dependability and backup.", "Date": "September 6, 2012"}, {"Title": "For a Friend", "Author": "Ramkiller1", "ReviewID": "R1SRIIDV2826Q8", "Overall": "4.0", "Content": "I bought this for my brother. A bit expensive but he never complained. Seems to be working perfectly. Good Product, just a bit expensive. Good Shipping. Thanks amazon.", "Date": "June 20, 2012"}, {"Title": "Fast and reliable so far", "Author": "Andrew", "ReviewID": "RVB8CIZZ6ASCJ", "Overall": "4.0", "Content": "Many people purchase this drive because it implements WD's TLER, which is supposed to reduce the chance of a drive dropping out of a RAID array, however their main motive for purchasing the RE series is the better warranty and higher MTBF.Most NAS manufacturers will actually ignore TLER (and other implementations from different manufacturers) completely, but it's not a bad thing to have more than you need!Great drives from the cost and with RAID, a cheaper and higher capacity alternative to SSD (though still not quite as fast in most cases).", "Date": "August 26, 2011"}, {"Title": "Coffee Pot Loud, but has a 5 Year warranty Good Speed", "Author": "FLY 4 God \"flyingbroker\"", "ReviewID": "RG8JT7K4VT3BI", "Overall": "3.0", "Content": "Coffe Pot Loud as another review says, way to loud for a single office, I mean all I hard was purk LKL  u lkhlhkljh  latting, it drove me crazy, speed and performance was good but for the it wasnt worth the extra $", "Date": "July 22, 2013"}, {"Title": "Works flawlessly so far", "Author": "Mainsil", "ReviewID": "R5G0NLGSL144E", "Overall": "4.0", "Content": "Both drives work fine, but it only gets 4 stars because I have only had them a few weeks.I would buy this again.", "Date": "July 25, 2013"}, {"Title": "Failed in 3 months", "Author": "Curtis Rihn", "ReviewID": "R1VLYXTIGEY0O0", "Overall": "1.0", "Content": "Don't waste your money just get the Seagate Barracuda for a third the price.  Bought 3 for a RAID 5 configuration.  3 months later one already failed.  Enterprise grade my a@$.", "Date": "November 19, 2012"}, {"Title": "Strong and fast .", "Author": "Tom", "ReviewID": "R2S5DQK6C3XM", "Overall": "5.0", "Content": "Not too much to say but the drives were shipped fast and were packet very well. Drives are working great with my Linux OS's ... Make the Linux run even faster ... I don't know how they work on Windows because why pay for a slow OS that freeze up with codes flying all around ...  VictorLinux is my main OS and they made a different...  Ya now the wife wants a Linux OS in her machine with RE-4 HD's.... I told her to pick one out of the FREE Hundred OS's from Linux..RE-4 is as fast as the new Western Digital Bare Drives 250 GB VelociRaptor SATA III 10,000 RPM 64 MB Cache Bulk/OEM Enterprise Hard Drive  I just got... All I can say for the VelocRaptor is that I have one ...", "Date": "August 14, 2012"}, {"Title": "WD RE 500 GB Enterprize Hard Drive", "Author": "robert", "ReviewID": "R2T5BM23CE1GEO", "Overall": "5.0", "Content": "This purchase has been great and years in the making, I only got started in computers in 2007 and never owned one myself that is until the aforementioned year 2007. Sadly I fount out that kids are learning computers and mild programing in grade school 4or 5 years of age. What can tell ya,I was a late bloomer or that I was a working poor person. Now  i am building my own computer it is just great it does take for me proper research and most important staying focused. This hard drive is great exactly what i wanted. Sadly T-Pol did not come with it, it is an ENTERPRIZE hard drive HA HA. I will have to visit her watching the DVD's Enterprize.", "Date": "March 7, 2013"}, {"Title": "Western Digital RE4", "Author": "Grizly8745", "ReviewID": "RKR8NLEOGWJH8", "Overall": "3.0", "Content": "I bought this based on the need to increase speed of data.  After reading the reviews that described this as \"speedy\" and \"fast\" I went ahead and made the purchase.First, it really isn't any faster than the Western Digital hard drive with the same capacity (2 years old) that I have now.  Second, I used the Western Digital version of Acronis to clone the system (Windows 7 Pro) and it did not perform as well as when I used it a couple of years ago with Windows XP when I did a new build. It missed some files and the cloned system was very unstable.  I went to a couple of forums and some people couldn't get Acronis to work with Windows 7 at all.  In the end I reinstalled my old hard drive and will keep this one for a spare.I suppose that as far as the speediness that is mostly my fault - I know better and should of checked the specs closer.  The one saving grace about this is I was going to buy the full version of Acronis, but after this experience I'm going to wait until they get the bugs worked out for Windows 7.", "Date": "August 19, 2012"}, {"Title": "Fial", "Author": "Tom Kelly", "ReviewID": "R1LP1BD2L3KYHI", "Overall": "1.0", "Content": "I've been a fan of WD until this year. I have 10 of these units + 2 10,000 rpm units. This one was dead on arrival. would not spin up. Sent it back. WD also would not fix my webtv unit..even though they knew it was a design flaw.. THEY KNOW THERE IS COMPETITION. But bottom line comes first. It's time to move on..", "Date": "December 9, 2012"}, {"Title": "Not what I needed", "Author": "sally", "ReviewID": "R26LRSV9L66IOT", "Overall": "3.0", "Content": "I ordered the hard drive at the recommendation of my computer guru; but it wasn't exactly what I needed but he could use it and traded with me for one that fit my needs.  Thanks, anyway", "Date": "May 7, 2013"}, {"Title": "good service", "Author": "Deborah", "ReviewID": "R10C2G6N5WHN5F", "Overall": "1.0", "Content": "No Problems and a timely delivery everything seemed ok and i quess that is it as i dont have much more to say", "Date": "June 5, 2013"}, {"Title": "NOT FOR HOUSE COMPUTER", "Author": "MKRD.info", "ReviewID": "R1RE2QL0CZ5SB0", "Overall": "1.0", "Content": "These drives are not for house computers. 2 drives in a row (in several months) show bad sectors and write errors. I had to shift my data two times. I am not buying a HD that claims to be \"super reliable\" again. Go with Caviar Blue and forget about going for \"high performance drives\". All they do is fail.Do not trust your data to this drive in a house environment. Get an external Caviar Green based hard drive to store your files on. Do not place your files with windoza partition.I looked at the PCB of this hard drive, and it looks exactly the same as that of a Caviar Green drive. That \"two processors\" blah blah blah is bs. These drives use almost all of the same parts as the much cheaper Caviar Blue drives. You are overpaying for a drive which is pushed beyond its reliability limits.It is just too bad Caviar Blue or Black HDs for my capacity do not come with 64MB cache. The cache, and the \"super reliable\" claims were the original reasons I bought these expensive pieces of junk.", "Date": "January 12, 2012"}], "ProductInfo": {"Price": "$159.99", "Features": "Ships in Certified Frustration-Free Packaging\nIdeal for servers, video surveillance, and other demanding write-intensive applications,\nDual processor - With double the processing power, WD RE4 boasts the highest performance of any drive in the WD RE family.\nEach drive is put through extended burn-in testing with thermal cycling to ensure reliable operation.\nRAID-specific, time-limited error recovery (TLER) - Prevents drive fallout caused by the extended hard drive error-recovery processes\n5 Year limited warranty.\nWD RE4 7200 RPM Enterprise SATA hard drives offer capacities up to 2 TB, 64 MB cache, and 4th generation vibration tolerance.", "Name": "WD RE4 1 TB Enterprise Hard Drive: 3.5 Inch, 7200 RPM, SATA II, 64 MB Cache - WD1003FBYX", "ImgURL": "http://ecx.images-amazon.com/images/I/41r0IQ3avQL._SY300_.jpg", "ProductID": "B003SANWI6"}}