{"Reviews": [{"Title": "Not for people without network knowledge", "Author": "Robbo", "ReviewID": "R3IM5QN9TNOQN5", "Overall": "5.0", "Content": "These are great cameras for the cost. Pan, tilt, low light, color, wifi, email alerts, screen capture, etc, etc... But, as others have said, all the docs are poorly written for english, but if you have any sort of network knowledge, these things are a snap to get going on your home wifi and manage/view from any internet access point. They are NOT plug and play though. I just ordered another for outside. I'll figure out some sort of weatherproof cover. They work great except the sound and talk suck...", "Date": "August 10, 2011"}, {"Title": "Can Be a HOOT of a DEAL", "Author": "KAREN \"DarnRedhead\"", "ReviewID": "R3S83P0J9XYTDC", "Overall": "4.0", "Content": "This camera was like having a new pet in the house! I plugged it in and the camera starting surveying the area like it was getting to know the place (cute). SOOO Excited I opened the instructions and WOW what are they trying to say here? It is in such broken English that I don't know if it's telling me to do something, not do something or what anything means??? (Mommie)So, broken English is not my specialty, I'm going to have to go off the reservation hooking this up! So let me try to help:Hook camera directly to your router (it comes w/that cable). Load software on computer/laptop. If you ever get to the part where it give you 3 options to log-in, choose the 1st ONE thru IE (internet explorer). It will prompt you for user name/password. Use the default it provides by just hitting (enter). It should detect your camera and a screen that looks like a remote comes on with a window of what your camera is viewing. The bottom button is your options, click that. Go to user options and set up your own userID/password and on wireless setup put in your router info & WEP Key. That should get it done. Now my new little HooToo is set so I can scan my entire area and view my doggies activities. Picture is clear and crisp, very quiet when you movie it too. Once you get this little guy up and running you'll love your HooToo-Too  :)", "Date": "October 4, 2010"}, {"Title": "Superb capabilities for the price", "Author": "Rick", "ReviewID": "RCRUGULJJOH4J", "Overall": "5.0", "Content": "The included software will control and display any number of cameras in a tiled window.  It will constantly monitor and record, or alarm and record on motion detection, among many options.  It will pan at a button push to 15 positions you set.  The panning control is very good, in that you can pan and tilt in tiny increments.The video is color in lighted conditions and black and white at night.  The color video quality is typical for a web cam.  The night vision is better than I expected.  The night vision works in zero light.  It is crisp black and white.  The frame rate drops in night vision mode though.  I'm getting 10 frames per second on average at 640x480 (15 is max) over WiFi G in lighted conditions, and about 4 FPS at night.  The video is equally good indoor and out.  There is an outdoor setting you must use for outside use.The audio input is pretty noisy, but you can understand someone talking.  I have not tried the audio output.The motion detection is a little slow to start recording, so it will miss a car going by, but not a person walking.You can monitor using Firefox (worst) IE with an included DirectX plug (better) or the included software (best).  When you connect with a browser, it has a smartphone option.  It works okay on my Droid X.  My computer is running MS Windows XP SP2.A good quality adjustable wall mount is included, as well as an Ethernet cable and software CD.The documentation is hilariously Engrish.  The software registration code is on a sticker on the last page of the manual.  That took awhile to find.Bottom line:  I paid $57 for mine.  The price keeps going up, as at the time of this writing the price is $68.  It is worth every penny of $57 and probably $68.", "Date": "November 13, 2010"}, {"Title": "Works as advertised", "Author": "T. Smith \"Goodstuff\"", "ReviewID": "R1VMRPVSMWSNVZ", "Overall": "4.0", "Content": "I just recived my camera this afternoon. I connected power and connected the camera to my router so I could setup the wireless configuration. It was all pretty easy using the wizard driven software. I set up port forwarding on my router. I had everything up and running in about 10 minutes. I even dowloaded an app for my  iphone called uCamPro that displays the video from the camera perfectly. I think a lot of people that complain about these cameras are having a hard time dealing with the router settings or are expecting the camera to work out of the box. The only thing that does not work very well is the microphone and internal speaker. I havent tried connecting an external speaker yet. There is a ring around the lens you can turn to tweek the focusing.If your someone that is not used to messing with router settings and such you are going to pull out your hair getting this to work outside of you local (in your house) network. Other wise I think you'll be pretty please with this IP camera :)", "Date": "January 21, 2011"}, {"Title": "Excellent price/feature rea", "Author": "Alvaro A. Bravo Kohler", "ReviewID": "R2KA15HZVKL9L7", "Overall": "4.0", "Content": "Pros:- Very good price- Complete package (inlcudes all needed)- High sensitivity (low light)- Easy of use- Feature rich firmwareCons:- Only works with Java enabled smartphones- No Ipod/Iphone support- Not heavy duty looks", "Date": "July 16, 2010"}, {"Title": "Awesome gadget.. Not for novices.", "Author": "George Robertson \"Victims, aren't we all?\"", "ReviewID": "R3AMBLX8ILKI7", "Overall": "4.0", "Content": "All the docs are wrong, including the ip sticker on the bottom. But it takes awesome shots in pitch dark.  Outperforms cameras costing $300", "Date": "January 11, 2011"}, {"Title": "This camera rocks", "Author": "karl", "ReviewID": "RJ05DWF60YJST", "Overall": "5.0", "Content": "I have tested several camera's that failed to meet the same abilities of this cameraI use this camera to monitor the activity at my barn using a wireless router and ClearWire to access remotely.I have had this running for over a month and it has not let me down.- Easy to setup- Wireless connection is stable.- I have 2 cameras setup with a solar panel.  Placement is limitless!Any one that wants a reliable camera to monitor where you don't want a monster surveillance system this would be the one.", "Date": "August 25, 2010"}, {"Title": "Not Easy to set up and image quality was poor", "Author": "Lizabeth", "ReviewID": "RDTA1A6Z3CXBP", "Overall": "1.0", "Content": "Unless you are experienced in setting up this sort of thing, get ready for some frustration.  Get this kids out of the house  because you are going to be saying some bad words.  The instructions are barely in English.  What should have taken 15 minutes took me two hours and then I didn't even like the quality of the image and returned the product.", "Date": "July 28, 2013"}, {"Title": "Success!!!", "Author": "N. Bolser", "ReviewID": "R1041G978DVC8J", "Overall": "5.0", "Content": "I did a review back in January where I was less than thrilled with this camera.  Some things have changed to convince me to update the review.  I purchased two more camera, identical to this, but a different brand name.  The first had a lens so distorted it was unusable, the second was dead on arrival.  The people at HooToo took my review seriously, I have never seen a company in 50 years of mail ordering that was so interested in customer satisfaction.  I received a call a week or so ago and was asked what they could do to make things better.  I asked for a tech support guy to call me.  Which he did, and in about 10 minutes it was decided the camera (not so much me) was defective.  Picture quality is excellent, customer support could not be better.  I am changing this to a most positive review and would recommend this camera and company.From January 19, 2013:  I don't know how many times I gave up over the past two weeks trying to get this thing to connect wireless.  Only to try one more time.  I just managed to do it, not sure just what setting on the router or camera did the trick.  It sure was stubborn.  If it ever disconnects, I'm probably screwed.  Anyway, it can be done.  It is a nice little camera for the money and probably a bit more.  I have a long network cable, hard wired in, it works fine.  And probably not a big deal, there still needs to be a power supply cable anyway.  But it was the principal - its supposed to be wireless.  A discussion one day of the virtues of Google vs. Bing (I'm a Google fan), led me to try Bing and found much more information.  There is some free software out there called Ispy (Google it), that is amazing for setting up monitoring and actually recognizes and supports this particular camera surveillance purposes.  Much better than the factory software.  My wireless connection was done through the factory software, however.  Would I buy another one?  No way.  But it has been a learning experience.", "Date": "January 19, 2013"}, {"Title": "Nice for the price", "Author": "Amazon Customer \"Furrykids Mom\"", "ReviewID": "R1T04WIXQB3ZTX", "Overall": "4.0", "Content": "It was not too difficult to set up or use.  Makes a fun toy to monitor the dogs with and we love watching our addition being built.", "Date": "July 13, 2010"}, {"Title": "This works great as a baby monitor/camera", "Author": "Raleigh Reviewer", "ReviewID": "R27YYIPMXQAO3", "Overall": "5.0", "Content": "There are similar products out there, but for the price, this can't be beat.  Read on . . .I bought this to be used as a baby monitor/camera.  The video monitors sold at, say Babies R Us are very expensive for what they are and are limited in function.  Here's what I did:  I bought this camera and mounted it towards the top of a 2x2 by 8 foot piece of wood with the included screws.  I went to the hardware store to get a half-dozen 1/3 inch width heavy-duty zip ties.  I strapped the 2\"x2\" to the far corner of the crib.  From there, I dropped down the power cord and also the ethernet cable.  Sure, you can use it in wireless mode, but hard-wire is more stable and I've got a network jack in my infant son's room.What you can do with this now is buy a $4 HooToo app for your iPhone/iTouch/iPad and watch your child from any where you have a connection.  It's awesome.  From work, I can just type in a link in to the *included* dyndns compatible URL and view my child from my desk at work  - when he's in the crib.This is not the high-def HooToo edition, but at 640x480, it's adequate.  In fact, you can double click on the screen and the image will expand to full screen.  I found that out by accident.  The image can get a little grainy, but look at the price.  Most of the time, my child is sleeping in his crib in the dark, so the camera switches to infrared mode and you get a well-lit black and white image.Oh, and another thing, this camera has two-way sound.  I can hear my child cry or other wise make noise by clicking on the headphone button in the web interface.  I can also talk back, by pressing the talk button.  I haven't tried that, though, since I always go to my son when he's fussy.  Note, that the audio only works when using Internet Explorer.  There is no audio when using the HooToo app (sold separately via itunes).This camera functioned properly right out of the box.  To date, I've owned it about six months and am pleased.  It does take some network knowledge to set it up properly.  You've got to know your way around your router in order to set up Upnp.  So, bottom line, if you're a tinkerer, this will bring you much joy.  If not, call your friend who knows how to fix your computer and offer pizza and beer.I did have to contact customer support via e-mail when the FAQ on the website couldn't answer my questions.  However, I was pleasantly surprised that a very knowledgeable person responded within 24 hours and will proper English.Some disappointments:  The owner's manual is printed in what must be 2 point font.  I needed a microscope in order to read it.  It was also very badly translated into English.  This camera does not offer secure https login, so be wary of logging in while you are joined to a non-secure network.  Also, this camera will NOT work with 64-bit Internet Explorer - only 32 bit.As for other positives, this can be used for other things besides a baby monitor once your child grows up.  It's got Wi-Fi.  It can be remotely panned and tilted, but no zoom.  The pan and tilt is easy via web browser or the HooToo app.  You can even set presets so that you can aim the camera at a point and then recall those position with a mouse click.Funny brand name, scattered thoughts, but recommeded!", "Date": "January 22, 2014"}, {"Title": "Terrific customer service", "Author": "spirits3250", "ReviewID": "R3AIB6JTI837Q5", "Overall": "5.0", "Content": "This was the third wifi camera I have tried and  one I am most happy with.  The customer service is excellent.  I got the lan and wireless working very  easily but couldn't get the wan to work.  Raymond from customer service got it  working in no time.  Great.  I'm not very knowledgeable about port forwarding etc. so I think anyone with a basic understanding of it would have no problem setting it up.  The camera itself seems well built.  The picture is very good and the sound is ok.  The ptz works very well.  I'm very happy with this camera and definitely will buy more in the future.  The terrific customer service sold me.", "Date": "November 7, 2013"}, {"Title": "Almost a 5 Star product!", "Author": "James P", "ReviewID": "R2JL20AL4E4V02", "Overall": "4.0", "Content": "If you do the research and see the reviews on this camera you'll quickly realize that the instructions suck unless your a very tech savvy person.Tech support was AWESOME and took care of the issue quickly!. They are real people who work in California and they know their stuff!  This camera is a jewel in the rough so don't be afraid to make the purchase.... I'm going to buy another!FYI Tech Support is", "Date": "November 5, 2013"}, {"Title": "Works better than expected!", "Author": "MrFixIt", "ReviewID": "R2LIENT15JVCKB", "Overall": "5.0", "Content": "This little guy works great! I have been able to get all of the functions except motion sensing \\ alert email to work. For the price I can live with that. I can view and control it via the internet on my Android tablet, my Iphone and my office PC. Downloaded an Android app that works better than the one included. If you want it on the Internet you need an understanding of how to setup port forwarding on your router and dynamic DNS (included). I taught networking in a former life and had it up and running in about 5 minutes since I knew what had to be configured. Its not easy to hide so don't expect to use it as spy cam but if you just want a way to check to see what is going on when you are not at home its great. I have the home position set so the camera does not face forward and freak-out my wife or step-daughter, thinking I'm watching them, and rotate it when I want to make a quick check of the house.I'm amazed by the clarity and the night vision. Demoed it to several friends and they all ordered one. I'll be ordering more.Update: about 5 minutes after writing the first review I got the motion sensing and email alerts working. When someone enters the room it sends me an email with 4 frames of images. Really cool! Upgraded to 5 STARS - can't find anything wrong with it.", "Date": "July 19, 2013"}, {"Title": "Good Pan Tilt Camara", "Author": "Mark", "ReviewID": "R3AK2XCUSWVG2X", "Overall": "5.0", "Content": "This HooToo Camera Works Great. The set up was easy(For Me) This is my third networked camera and one 4 cam DVR system I've installed & configured via Wifi, or Ethernet, all with DNS and Android smartphone App working. I started out clueless and now I'm a Pro. The supplied CD and assorted software made the install and config of the camera much easier than earlier cameras and the DVR system. I also found very helpful the setup videos included on the CD. If I only had them with my first camera!! Thanks HooToo!! If your a first timer with some basic network knowledge, these videos should be a big help with your basic setup and operation. The camera operates as promised without trouble, all features work well. I have had a couple hiccups with Explorer 10 wanting to open the HooToo browser. What's New!! Firefox & Chrome work fine. The picture quality, color, and focus are good and acceptable. Night vision works well, I'm able to see the entire area 30'x30'. The audio also works well my dogs keep running around looking for me when I speak through the cam.I purchased this cam for the low price. I wanted to see what a $60 Plan/Tilt Cam delivered. It delivers all the same features and benefits of higher priced cams in it's class.Pros:PricePan/Tilt angles good, smooth operationEase of setup (included software) & Setup VideosEasy operation- integrates well with other brandsWireless operation or Wired installation (both work well)Good picture quality day or nightAcceptable audio qualityCons:Non-Stop Blinking Very Bright Light below lens (my fix a dab of black paint)This blinking light issue allows me to only give 4 starsUpdate 07-16-2012:The MFG. HooToo contacted me about my concern regarding my blinking light issue. They instructed me to open up the IE browser, go to \"system\" settings, then to \"indicator settings\" and switch off the light. Easy fix and Done! Thank You for taking the initiative to contact me with a quick easy fix. I wasn't expecting to hear from anyone. Company's that make Customer Service a Priority are # 1 in my book!! 4 stars changed to 5 Stars as my issue has been resolved.", "Date": "July 15, 2013"}, {"Title": "Easy Set Up/ Awesome Customer Service", "Author": "Scott Fertig", "ReviewID": "R39WG841GR1Y9L", "Overall": "5.0", "Content": "I bought this camera because we had some bikes stolen and vandalism on our property. I have them in windows directed outside. There is a warning that these are indoor cameras and direct exposure to sunlight can damage them but I'm taking my chances for the price... keeping it north facing in the am. I am a stay at home mom and not a super tech savvy person, but was able to get the camera up and running wirelessly following the included instructions. It did take some googling and toying around before I got the email set up. I ended up creating a free gmx account for it: the server is mail.gmx.com and the port is 587, TLS NONE. The angle isn't as wide as I was expecting so I ordered a second camera so that I could see both sides of the yard at once. I was trying to set it up so that I could see them both at the same time on my PC and ended up bricking one of the cameras... DO NOT mess with firmware/web UI without contacting customer service first as this can void your warranty. I emailed customer service and was responded to promptly. Luckily they took pity on my ignorance and are shipping me a new replacement camera. Also there is an app for iphone/ipad for $4.99 that works great. I will be adding more cameras in the future and will update my experience at that time.", "Date": "June 19, 2013"}, {"Title": "Excellent Camera's at a Great Price!!!", "Author": "LJSTEEL", "ReviewID": "R3NDV3CWC3EPA9", "Overall": "5.0", "Content": "These cameras are just amazing in quality both day and night vision. I will be sure to purchase more as needed and have already suggested them to neighbors for garage security as they can read a license plate from about 22 feet away, and facial recognition is also great. Will definitely continue to recommend this product to others as needed.", "Date": "May 2, 2013"}, {"Title": "Great support", "Author": "patrick", "ReviewID": "R3J17NVFKL3ISE", "Overall": "5.0", "Content": "Foreign made product with poorly written installation instructions. Not a true wireless system. It needs ac power and the cord is not that long. I have found it difficult to set this up to connect with my wifi. It came packaged in a neat box.UpdateSunvalleytek support called me to help setup the wifi on the camera. Both cameras work and for the price cant be beat.", "Date": "March 27, 2013"}, {"Title": "The best of all I have!", "Author": "Taylor", "ReviewID": "R1WAUH2V9U7PY4", "Overall": "5.0", "Content": "I’ve always been intrigued these IP cameras and have owned several different brands in the past . The Hootoo model not only had the lowest price and happens to be the only one offers the IO switching capability (remote-controlled relay on/off, and alarm input). The Image quality (640x480) is also better, and the night vision can see 20 feet away in pitch black. Ironically the sound is more clear than my baby monitor which is kinda funny. I havnt tried speaking to the camera yet, so I can’t provide an accurate assessment on that part.I followed the quick installation guide exactly as stated in the included printed manual and the camera was up running via my wireless network in 15 minutes. Port forwarding was no problem for me as my router set it up automatically (uPnP). I have Win7 PC and Fios Router.Other thoughts: this camera has 6mm lens and it is more suited for large areas or recording an area around 8-10 yards away for business purposes. It would be awesome with its narrower field of view at pointing at doors, or even better a 8-12 yard hall way. Hootoo sells another model ht-ip210f, that has a wider view with 3.6mm lens to capture objects closer to the camera. And that is more suited for home or small room use. Its essentially an upgraded version (e.g. night vision, image quality), compared the hootoo one I’m having right now. I’m planning to buy the upgraded hootoo model for my house shortly.", "Date": "March 15, 2013"}, {"Title": "Decent cheap camera - Works with Synology's NAS'!", "Author": "Peter Brockie", "ReviewID": "R3UN23QX7X7AE5", "Overall": "4.0", "Content": "I picked this up in hopes it was just a Foscam clone. Guess what? It is! The camera works just fine on my Synology DS413j (select a Foscam FI8910W).Pros:Works with Synology's network attached storage devices.Cheap!IR LEDs and filter allow for vision in pitch black and correct colours during the day.Wi-fi and ethernet (though see below).Decent image quality. 640x480 @ 20 FPSHas mic and speaker ports and supposedly internal ones (I haven't tested it).Cons:Wi-fi is limited to 802.11g.Image quality is decent, but not great. Very poor in low light, but due to the IR LEDs you can at least see something.Cannot run at 30 FPS at 640x480.", "Date": "October 4, 2012"}, {"Title": "Inexpensive baby monitor camra", "Author": "Teddy", "ReviewID": "R2QHEFT1679326", "Overall": "5.0", "Content": "Pro: Setup was pretty straightforward and a no-brainer, camera needs NO tweak of the focus ring to adjust the picture because it's so surprisingly clear that I can see my baby and even see him breathe. Night vision is a nice option, the infrared lights automatically turn red in darkness to ensure adequate visibility. Audio monitoring works great when we have the microphone and the speaker to test it out. DDNS is easy to configure, simply port forward to the IP of the camera and you are good to go from anywhere away from home. We even try with the phone to monitor the camera via tinyCam Monitor Pro from Google play store and it proves to be a success, great compatibility! I can now achieve most of the functions of the camera on my android phone.Cons: None so far.---------------------------------------------------------------------I will review on some of its downsides (if any) along the way.", "Date": "August 16, 2012"}, {"Title": "HooToo Camera - choppy video", "Author": "Michael Roe", "ReviewID": "R3A9I82WOCWAY0", "Overall": "1.0", "Content": "Camera and software was easy to set up, but even though I have tons of bandwidth and nothing over taxing my CPU, video was still very choppy and jerky. Tried contacting HooToo, but thye offer no support for their camera. I have a feeling it's made for them by some fly by night company. No luck seraching for any support or firmware updates. Wish I would have invested a little more money in a better name brand camera that offered better support.", "Date": "September 3, 2010"}, {"Title": "good cameras", "Author": "ben", "ReviewID": "R9KHC7UIAW6JG", "Overall": "5.0", "Content": "i've been using cameras for many years i never find any of them as good as theseand the company is so easy to deal with. i had  issue with one and they took care of it.", "Date": "October 11, 2010"}, {"Title": "Works Great Directly Attached to Computer", "Author": "T. Edwards", "ReviewID": "RPCBVBNA2NI8T", "Overall": "3.0", "Content": "I purchased this camera awhile ago and I have had a big issue trying to get the camera to work on wireless with my AT&T; Uverse Modem.  The camera works great when it is directly attached to my computer and I can access the camera via my cell phone when I am away - but I want to set this up to run wireless and will continue working on that functionality,", "Date": "June 5, 2014"}, {"Title": "Great IP Camera..", "Author": "Product Critic", "ReviewID": "R3SVKEJPFVKMXS", "Overall": "5.0", "Content": "Does everything the expensive ones do for a fraction of the price.. I own 2 now..  Probably going to get even more..", "Date": "May 29, 2014"}, {"Title": "It’s a good camera for clear video but not audio. Speakers and microphone didn’t work as expected.", "Author": "Charles Spanky \"Zumina Reviews\"", "ReviewID": "R22BWBZZL6X8PM", "Overall": "4.0", "Content": "Nowadays, security cameras have been essential for both businesses and residential. Having the security of knowing what is happening at all times is a great comfort having. HooToo has made the HooToo® HT-IP206P Wireless IP Network Surveillance Camera as a way to maintain a secure atmosphere.▶ Package Contents• IP Camera• Wi-Fi Antenna• User manual• DC power supply cord• CD Rom• Ethernet cord• Mounting Bracket• 4 mounting screws with drywall inserts▶ Accessories (Needs DC Power cord length and mounting bracket updated)The Ethernet cord is 56 inches with a thick gauged wire. Although the cord is short, this is definitely one of the better built Ethernet cords I own. The Ethernet cord will do what it is intended for and help setup the IP camera.The DC power cord is 57 inches with a 2.75 x 1 x 1.5 inch brick at the end of the cord. I would normally name this a con, because it would block neighboring outlets, but I would expect this cord to be attached to some sort of extension cord and not a surge protector.The mounting bracket has a 2.25 x 2.25 circular platform, with a 20 threaded screw that goes into the center of the bottom of the camera. This platform is guided by a 2 inch arm, which is almost able to maneuver in a little over 90°. On the bottom of the bracket is the 3.25 x 1.5 platform that can screw into a wall. The mounting bracket is very nice if you need to place your camera in a position that is other than up-right.▶ Specifications• Powerful high-speed video protocol processor• High-sensitivity ¼” CMOS sensor• Picture total 300k pixels• Support PT control, Pan 270°, Tilt 120°• Optimized MJPEG video compression for transmission• Multi-level users management and passwords definition• Embedded web server for users to visit by IE• Support wireless network (WI-FI/802.11/b/g)• Supporting Dynamic IP (DDNS) and UPNP LAN and Internet (ADSL, Cable Modem)• Giving Alarm in case of motion detection• Supporting image snapshot• Support multiple protocols: HTTP/TCP/IP/UDP/SMTP/DDNS/SNTP/DHCP/FTP• Support WEP/WPA/WPA2 encryption• Support 3G phone, Smart phone control and surveillance• Support Firefox, Safari, Google Chrome browser▶ HardwareThe camera is a little bigger than today’s webcams (8.5 x 7.8 x 4.9 inches; 1.3 pounds), with a matt black or white plastic design. The front has the 6mm (0.3 megapixels) lens, light sensitive censor, 10 infrared LEDs, network indicator LED, and microphone. The right side has the speaker, and back has the RJ-45 (Ethernet) port, Wi-Fi antenna, 5V power socket, audio output, and alarm I/O pins. The bottom has the specifications and threaded hole for the mounting bracket and the reset button. Overall, this is an all-in-one camera that seems to have everything it should have.▶ Software SetupHooToo provides two pieces of software for this device “IP Camera Tool” and “IPCamClient”. Don’t worry if you are initially confused, because I was. After reading the manual, “IP Camera Tool” is the only tool required. Follow the following directions to install your camera:1. Install the “IP Camera Tool” and then restart your computer.2. Plug your DC power supply into your camera and power your device.3. Wait approximately 30 seconds for your device to be read4. Open the “IP Camera Tool” Program5. You should see “Anonymous” and “Subnet doesn’t match, double click to change!”6. Check the box “Obtain IP from DHCP Server” This will automatically setup your device that is connected to your router. If you want to change the user/password and HTTP Port then feel free to.7. Your device should be connected. Congratulations. Now, you will be redirected to a website that you can view your camera. If you want to make this device wireless then continues to step 8.8. After you are on your website i.e 192.168.0.12/main.htm, enter username “admin” and password blank (nothing here), click the Network tab and then “Wireless Lan Settings”.9. Click the Scan button under “Wireless Network List”10. Choose your network, key, and then click the submit button.11. Congratulations, you should now be able to use your camera wirelessly!▶ SoftwareThe website includes tabs for “Live Video, Multi-Device, Network, Audio Video, System, and Other”.• Live video- Self explanatory• Multi-Device- Upgrade device firmware, restore to factory settings, or reboot device. I would assume this would be used for multi-camera view, but it is instead used for factory settings.• Network- Basic network settings, wireless LAN settings, ADSL settings, UPnP settings, DDNS Service settings• Audio video- Reversal, mirror. This has no audio settings, but may have settings when an audio source is connected.• System- Device settings, alias settings, Date and Time settings, User settings, PT Settings, (LED) indicator settings, backup and restore settings, log, and MSN settings. Nothing really to note here other than it includes “MSN Settings”; an instant massaging program that has been discontinued since 2013.• Other – Mail service settings, FTP server settings, Alarm settings. I like that this includes settings for FTP and mail services so you can always be updated of the images from your work.Under the vertical tabs are options to change “Resolution, Mode, Bright, and Contrast”.• Resolution – 160 x 120, 320 x 240, 640 x 480• Mode – 50 Hz, 60 Hz, Outdoor• Bright – 0 to 15• Contrast – 0 to 6Under that is a circular compass to move the camera whichever direction you want. Under the compass are 8 buttons.• Set preset position• Call preset position• Zoom in• Zoom out• Horizon Patrol• Stop Horizon Patrol• Switch on• Switch offAt the right top is an option to take a “Snapshot” image of the live camera feed. Although the website doesn’t look very appealing, it is very functional for the purpose of the camera. There are other supplemental software choices, such as Blue Iris, which use a very intuitive design, and give audio functionality, which the website doesn’t provide, for compatible devices such as this one, but cost extra money. These supplemental pieces of software, however, do not provide full functionality that the website provides, such as horizontal, vertical patrol, and setting one of the nine preset positions. Whether you like it or not, you will need to use the website at least a few times.▶ TestingI tested this to monitor my kid’s play area for approximately a week straight. During this time, the camera went offline only a couple of times, and during that time, it was only for a minute or two. The picture was a little grainy and blocky, but you could clearly see the any objects or faces. I didn’t end up using the tilt and pan, which I personally thought I’d be using. The biggest issue I had with this camera is the microphone, as it was way too sensitive. If you would attempt to listen, you would hear blaring static noise. Ouch! It hurt my ears. If you are trying to find a similar camera as a two way audio, then I’d suggest getting the HT-IP210. It may be a little more costly, but in the end you are getting better quality product. Overall, this camera completed my tests.▶ Final ThoughtsIf you are needing just video, then this is probably the device for you, but if you want to hear audio then I would suggest getting the HT-IP210. Also, if you plan on using your camera for a long period of time, then I suggest getting a different IP Camera software, to supplement the features from the website. Because of the audio issues, I take off one star, and give this a 4 star rating, but I still recommend this to anyone needing an IP Camera.Pros:+ Able to be used during daytime or nighttime, with or without light.+ Includes several options such as presets, zoom in and out, and horizon patrol. These are great functional settings that optimize the camera’s capabilities.+ Includes options for FTP and mail service so you can monitor your home while you are at work.+ Antenna is able to bend in 360 degree motion to give the best Wi-Fi connection.Cons:- Was not able to achieve two way audio, or even one way audio.- Camera occasionally went offline.- Software design is functional but is frustrating to use and isn’t very aesthetically pleasing; it is preferred to use supplemental software, which can be an additional cost.I was provided a sample in exchange for a thorough and honest review.", "Date": "May 21, 2014"}, {"Title": "Hootoo Ht-IP206P", "Author": "chinadoll", "ReviewID": "R1MDELGDWGYY5", "Overall": "4.0", "Content": "I have to say this camera works better then the outdoor hootoo cameras.  I've had these camera about a year I purchased indoor and outdoor cameras.  The outdoor camera I have to always reset it because it just goes blank.  So I decided to use this indoor camera outside and just cut a milk jug and covered it slightly to my amazement with all the cold weather and snow and rain we had this year with this camera I have only had to reset once (turn off and on).  It has weathered all the storms and temperatures under zero.I like this camera and I only purchased for the price to see if it would live up to the expensive camera and it sure has.  I am going to take down my outdoor cameras this year and replace them with this indoor with a cover.  I also have no problem viewing the cameras from my iphone either works great.  I will be purchasing additional indoor cameras for outdoor use.", "Date": "April 5, 2014"}, {"Title": "Well worth the investment", "Author": "Joshua", "ReviewID": "R2UG6LSYCQWFM7", "Overall": "4.0", "Content": "Works better than I hoped, and has even more features! Only down side is having to use Internet Explorer in order to full utilize them. Things such as Record, Two-way audio, and motion sensory can only be done using IE. Initial setup was pretty easy if you have done anything with a router before. However allowing it to be view over the internet (not home network) was a bit of a chore but nothing you can't figure out by reading some comments here or googling. My wife and I bought this in lieu of a baby monitor and it works great resolution is good day or night in the nursery. I have played around with it in a few locations mainly indoors and the night vision works well above what I thought it would. There isn't a room in my house big enough that the IR mode cant light up, even did a decent job in the back yard though it is not really intended for outdoors. Looking through glass with the IR lights on will not work either as it causes a glare. Over all I think it was a great purchase I can easily look it up on my Windows Phone, Ipad, PC, without any real issues aside from lagging out sometimes during extending viewing times but nothing a quick refresh hasn't taken care of. Well that and having to re install IE for some functions.", "Date": "March 27, 2014"}, {"Title": "it works great!!", "Author": "J85", "ReviewID": "RE82POZS8UPE6", "Overall": "5.0", "Content": "I was expecting something of less in qualify and more complicated to setup but it was all the easy and it works great!!", "Date": "March 7, 2014"}, {"Title": "Better than the Foscam!", "Author": "Derek", "ReviewID": "R1VHZ0TQ1ILFS8", "Overall": "5.0", "Content": "I previously purchased a Foscam IP Camera and have had nothing but problems with it 6 months in.  I decided, after reading many reviews, to try the HooToo camera.  So far so good.  The setup was exactly the same as the Foscam so there was no issue getting this one up and running.  I like the look of this one better than the Foscam as well.  As far as video quality they both seem to be about the same.  What really sold me on this though was the warranty.  I purchased the Foscam off Amazon but Foscam won't service mine since it was bought through a different seller on Amazon...  That is pretty crap customer service...  I've read nothing but good reviews about HooToo's customer service so I know if I ever have a problem they will be there to help me.  I'd highly recommend this camera if you're looking for a good IP Camera with a company that will stand beside their product regardless of where you buy it.Update:Well, bummer.  The IR lights are not working on this one... I'm going to return this one for another and give it a go as well.  I'll update the review once I receive my new one.", "Date": "February 8, 2014"}, {"Title": "Good but has some issues", "Author": "Tia Hughes", "ReviewID": "R1CVVNF0CYXD6S", "Overall": "3.0", "Content": "This is a good camera in that I can monitor my baby from my iPad, phone, or kindle and I can also move the camera from those devices. What I do not like is that, for some reason, the camera just restarts itself randomly. Then I have to wait for it to finish homing so I can put it back in the position I want, it's very annoying.", "Date": "February 7, 2014"}, {"Title": "Lots of features for the price", "Author": "Fred Pickard", "ReviewID": "R2L8Y6GTJIMFSX", "Overall": "5.0", "Content": "Very happy with my first, just bought a second.  Motion detection works well in my house.  You do need to be capable of configuring your router (mine is an ActionTec from Verizon) to get the most out of it.  Only problem I ran into: couldn't get my iPhone to work with the included browser interface (free), so I bought the iPhone app ($4.99) which is pretty full featured (allows email alerts to be turned on/off, etc.).  Image quality isn't superb, but very good for the $.", "Date": "February 3, 2014"}, {"Title": "Be warned--not easy to set up", "Author": "D. Pruden", "ReviewID": "R1LSQBJW6N56HM", "Overall": "2.0", "Content": "The instructions that came with this product were not at all helpful.  I have not been able so far to get this thing up and running --came close a couple of times but ran into wireless issues.", "Date": "January 27, 2014"}, {"Title": "Great Wifi Camera but...", "Author": "Yoyo", "ReviewID": "R11IWD2B56SOXM", "Overall": "5.0", "Content": "Pros:Good Picture QualityEasy to MountWifi connection is very strongSound is amazingly clearMotion Sensor is activated easily however it captures pictures after the person is no longer in range. Defeating the purpose of the motion sensorCons:Good Picture qualitySoftware is not so great. Getting it to work in IE is an absolute nightmare.Works with Chrome, but record play etc features are only available on IE!! What a bummer.Due to IE not working, cannot change path of recording to external drive so it saves on my SSD....another bummer.", "Date": "January 10, 2014"}, {"Title": "Hootoo cameras are the best deal for your money..read the details.....", "Author": "A. R.", "ReviewID": "R1WIF305EAVT2Q", "Overall": "5.0", "Content": "Hootoo cameras require that you do your network homework. If your a novice; get a geekfriend who understands networks to help or email Hootoo support; there Awesome. Whenyou do the first initial setup make sure whatever windows computer your using has anupdated version of Internet Explorer 9.0 or above with all ActiveX controls enabled. Whenyou set up the camera to be recognized by the network its always done with a wired Ethernetconnection. Once you get all the credentials in the Hootoo administration site includingyour wireless parameters, you can go wireless from that point on. I recommend using aDynamic DNS service like DynDns to preset all hosts to one set host plus whatever portthe actual camera is on. I pay for my service, its only $25 a year and its makes DHCP headaches go away permanently. You also have the option of using Hootoos dynamic DNSwhich works fine as well. My cameras are setup to work with motion detection and theyemail images to whatever email service of your choosing. I had one problem with onecamera not performing its motion detection functions properly and hootoo sent me anotherreplacement in two days; these guys at hootoo are awesome. Once these cameras are setupthey work flawlessly as long as your wireless network is up. If you loose power they fireback up once power is restored. To view your cameras remotely use tinyCam Monitor orIP Cam Viewer Pro on android respectively, this where having your dynamic DNS willmake your geek life a lot easier. You can view these on an iPad with CamViewer howeverThat's only from your home network. Check the iTunes app store for hootoos app forIPhone or iPads . These cameras have very good pan and tilt capabilities with very goodnight vision and can be put on schedules to patrol and send programmed messages.They can also be set up with audio two way voice operations; however I have yet to ex-periment that far as of yet. Buy them and take your time to set them up right; you wontbe disappointed.", "Date": "December 30, 2013"}, {"Title": "Works fine for me.", "Author": "Unicast", "ReviewID": "R2M5QQU8EU8XER", "Overall": "5.0", "Content": "Works just fine. The programming in the software is similar to Foscam cameras. It's a good alternative if you're looking for an alternative that's a bit cheaper than Foscam. It also works with BlueIris.", "Date": "November 27, 2013"}, {"Title": "GREAT IP camera for any use!!", "Author": "Chicken-Nugget", "ReviewID": "RZICDIJGNE0TM", "Overall": "5.0", "Content": "If you are looking for a great pan and tilt IP camera, this is perfect. The night vision is excellent and really illuminates the viewing area after dark. The install process is simple and works perfectly once you get it setup. You can even view it outside of your network while you are on vacation or at work. It works better than a more expensive ptz, even though it's not an HD image, it is very clear and impressive. As an IT person I am surprised by the quality and build. I'm going to slowly switch out all of my other cameras to the hootoo ip210 ptz. The audio works both ways really well and there is very little lag. Many options to customize your IP camera and can even backup your settings to clone them to another hootoo ip210 if you buy another. It's well worth the money for this camera. I am not easily impressed but this camera does it for me! I use a third party software for viewing and maintaining my security system. The software is 100% free and it's called ispyconnect, there is even a great free smartphone app.", "Date": "November 12, 2013"}, {"Title": "It works and it works really well.", "Author": "Old_Bull", "ReviewID": "R1LF3DIZPT2TAI", "Overall": "5.0", "Content": "Shipping was very fast.Packaging was secure. Retail box in another shipping box with bubble packing.Setup was a breeze using a Firefox browser. The browser UI is easy to navigate. After setting up a wired connection, the user can set the camera for wireless.All of the manuals are in .pdf files on the install CD. I had to use those, rather than the included hard copy manual due to the print being so small.A (hard copy) quick install guide is also included in the box. The print on it is bigger and far easier to read.The settings for the router are clear and simple and allow the user to quickly set up the camera for remote management\\viewing.Hootoo support shows an app for Apple devices. Hopefully one will come for Android.Since I do not have an Apple device, I used my Nexus 7 to remotely view\\control the camera and it worked great using Chrome.", "Date": "November 5, 2013"}, {"Title": "Hoo Too Wireless IP Cam", "Author": "Jimmy Harsson Sr", "ReviewID": "R2O71PFXQK4454", "Overall": "5.0", "Content": "I looked at many cams like this online and read many reviews and the Hoo Too seemed to be the best overall and I'm not one bit disatisfied; it is as advertised and works perfertly. For those of you that are not computer literate as for downloading software you'll probably need assistance as I did. I contacted Hoo Too and Raymond was extraordinary with his knowledge and williness to help. He guided me through all the steps and help me setup the cam so I could view from my Iphone and wife's Ipad. I'm going to purchase a two more soon to setup around the house and my shop. Do not hesitate to purchase this device you'll not be sorry. The seller shipped quickly and was more help that I've ever received from a MFG. Thanks Hoo TooJim", "Date": "November 3, 2013"}, {"Title": "My Eagle Eyes", "Author": "Rafael Rivera", "ReviewID": "R22GOUOMZUP65L", "Overall": "5.0", "Content": "Easy to setup, nice view from inside the house and via web.  One thing that I would like this camera to have is email of video recording when movements are detected.  Other than that the pictures via email are good, but too many.  May be I call tech support and they could assist in that perspective.", "Date": "October 29, 2013"}, {"Title": "Value", "Author": "Kent", "ReviewID": "R2CLLPP9IP074V", "Overall": "4.0", "Content": "I feel like you get what you pay for in this device. It has the features that a lot of the more expensive devices in this range have, the night vision works well, and there are apps in the Apple app store that support the device too.", "Date": "October 28, 2013"}, {"Title": "Great IPCam", "Author": "My Dalair \"topside\"", "ReviewID": "RDEDIOJQHRQZ7", "Overall": "5.0", "Content": "It only took a half hour to have the camera up and running on my WiFi. The Quick Install Guide was fairly easy to follow but the User manual print is so small you need a microscope to view it. There is plenty of help on the internet HooToo site should it be needed . I use the IPCamClient for viewing on my computers and tinyCam Monitor for my Android phones and Airpad. All the camera functions work as described and has a very clear picture. Volume is a little low but the audio is clear. Well worth the price.", "Date": "October 24, 2013"}, {"Title": "Great customer service", "Author": "K Jat", "ReviewID": "R2JML4XIQARZR0", "Overall": "5.0", "Content": "I bought this product more than a year ago. Had some difficulties setting it up after not being in use for a while.Even though the product was out of warranty, I received great customer service. This product is reasonably priced and has has nice features.I would recommend it to everyone.", "Date": "October 20, 2013"}, {"Title": "Good", "Author": "Logan Bowers", "ReviewID": "R1VKFQG7P1O6HE", "Overall": "5.0", "Content": "Good product for price, easy to install and very clear directions for those who do not have previous experience. I have set these up before, so install was a breeze. Just log into your router and see the IP the device has pulled from DHCP, reserve the IP in the router, set up a port forward, create a ddns with a free ddns service, set up the account info in your router, and instantly access from outside your home network. The camera works better with firefox than IE.I use IP cam viewer lite to monitor form my android and is free.", "Date": "October 2, 2013"}, {"Title": "Product", "Author": "diana k storelli", "ReviewID": "RQ61906W46AR2", "Overall": "5.0", "Content": "This is the second Hootoo IP camera that I use to watch my newborn and it works great!  The night vision works so much better than the $200 baby monitors.  The setup was easy, but because I have an existing / older camera I did have some problems using the wireless feature of which I contact customer service and they had there technican remote into my network and walk me through installation.  As the technican walk-through installation I realized that I wasn't following instructions :)As previously mentioned, the original Hootoo camera I purchased 4.5 years ago, that is always on and recording, is still operating without ever having any issues (knock on wood).  For the price of this camera, I would definitely suggest purchasing.For Hootoo, I would suggest getting in to the baby monitor market because this is soo much better than a baby monitor, not to mention that I am to see my kids through the internet when I'm on business trips.....", "Date": "October 2, 2013"}, {"Title": "HooToo HT-IP206 and HT-IP210 IP camera with Pan and Tilt", "Author": "bobhardester", "ReviewID": "R3KPC38Z0F8AR6", "Overall": "5.0", "Content": "The HooToo HT-IP206 and HT-IP210 IP camera with Pan and Tilt provide one of the best GUI web interfaces I've found. I started working with network based cameras back in 2002 when I owned my own .com... we had cameras in central Florida and Texas in our offices. We paid thousands of dollars for the cameras and interface. The HooToo cameras for the money are very good... I've purchased 5 for my home and office and have installed another 4 for my Son's business. I've has a problem with 1 of the cameras and they sent me a replacement the next day.. very good, love the people and cameras at HOOTOO!", "Date": "September 20, 2013"}, {"Title": "No support for a mac", "Author": "Patrick Poziwilko", "ReviewID": "R286M7BP5LP4FW", "Overall": "2.0", "Content": "The hardware looked good.  The install disk that accompanied the product did not have a mac version of the install software. The product operated quite will wired, but could not get it to operate on the wi-fi.  There is no help on the web site, no telephone number, and the email address given for support did not respond to emails.  Hoo Too appears to be another organization that sell, period.", "Date": "September 8, 2013"}, {"Title": "Very Satisfied with this camera", "Author": "Gio", "ReviewID": "R2X6FSKBXHNHVF", "Overall": "5.0", "Content": "After two years of using this camera, I am very satisfied with the performance and quality of the product, I have not had any problems at all and it works 24/7. I use it to monitor my home from the internet, I've also set up email alerts. It's not that difficult to make the settings if you follow the instructions provided for hootoo support. I considered buying another to cover another part of my house.", "Date": "August 11, 2013"}, {"Title": "Great Wireless Security Camera", "Author": "A. Wolvin", "ReviewID": "R38G0JR95YJT8Z", "Overall": "5.0", "Content": "I purchased the HooToo HT-IP206 as a wireless security camera for my home. As a 1st time buyer I am very impressed with the ease of set-up. I currently have it set-up in the basement as my 1st wireless camera and plan on adding more. So far it works flawlessly. I have it set up so it sends video to my hard drive and pictures to my e-mail address. Even though I currently am using a \"b/g\" wireless router I am sure it would work using a \"n\" router as well. I can not wait till I purchase and use the HooToo HT-IP212 outdoor camera. I would definitely recommend this to anyone just starting out either wired or wireless security cameras. The tilt function as well as the auto pan fuction work great when set-up correctly.  kremkon", "Date": "July 27, 2013"}, {"Title": "LOVE this camera!", "Author": "Diane", "ReviewID": "R10I6XM2M41UAG", "Overall": "5.0", "Content": "I tried 2 different cameras before finding this one and I am very happy with it.  The pan and tilt is perfect for seeing everything that I need to see.  I am considering getting another one just so I can use the multi device tool and put one in another room as well.  I can use it with my desk top, my lap top, and even my iPhone.  The color is good and the night vision is good, we were laughing at the \"creepy\" eyes using the night vision but I am very impressed with everything about it.  I had a question about it and got an email reply instantly, even on a Sunday.", "Date": "July 18, 2013"}, {"Title": "Fine, affordable, reasonable quality camera", "Author": "Connie Chai Scholl \"soymilk\"", "ReviewID": "R2IY8XGFIDO0VS", "Overall": "4.0", "Content": "This is a pretty good camera at an affordable price.  As other commentors have noted, it is *not* plug-and-play, you need to know how to navigate your router. I got a little bit befuddled during the installation myself but customer service contacted me and helped me sort it out.  Would buy another one if I ever needed more surveillance.", "Date": "July 12, 2013"}, {"Title": "Best night vision so far", "Author": "garyznola", "ReviewID": "R2T8MSNZ8JDAWT", "Overall": "4.0", "Content": "I have bought many cameras in the past few years as this has become sort of a hobby of mine.  I have had several types of Airlink 101s, an Agasio, a Loftec knockoff, and another Hootoo.  I actually bought these by mistake as I wanted another of the Hootoo HT-IP210F that I already had.  Got them on sale and thought that I would go ahead and try them out instead of returning them.  I am really into the night vision aspect of things and all my cameras have been night vision, the Airlinks didn't have any range the Agasio and Loftec were ok but had the dreaded halo, the first Hootoo was getting there but also had limited range so I bought an IR lght to augment the range.  So I did the same thing with these, but to my surprise these little cameras didn't need any additional IR they are the best for that by far. I only gave 4 stars however because unlike the 210 these 206s daytime color is washed out and not true color.  If they could only combine them then they would have something great.  I would still recommend these for the price.", "Date": "July 11, 2013"}, {"Title": "Great IP Camera", "Author": "Latino", "ReviewID": "RRBI5ND8G4PLB", "Overall": "4.0", "Content": "This is a great camera for the price, picture quality is good and I setting it up is pretty straight forward. I although had some issues, so I contacted customer service which is amazing and they were able to help me right out. Would definitely recommend this ip camera. I use it to monitor one of mi little ones and love it!", "Date": "July 8, 2013"}, {"Title": "Nice picture. Better audio. Relay works great for me.", "Author": "New father", "ReviewID": "R2VYOZJV7Z0H05", "Overall": "5.0", "Content": "I ordered this Hootoo model and Tenvis JPT3815W, EasyN FS-613A-M136. They all work pretty much the same way. Video qualities are equally good. Motion detection and other functions are all similar. However, Hootoo HT-206 and EasyN  FS-613A-M136 have alarm relay pins on the back. Tenvis JPT3815W does not have any (it's the least expensive among the three models for about $10 cheaper). Hootoo and EasyN have better audio (heard from my Android phone app IP Cam Viewer) that are more understandable to the remote listener. All of them have noises as expected for all such camera even for more expensive ones (e.g., Foscam). All of them can be set up the same way wirelessly or wired with my router. I tried to find a camera to control my Chamberlain garage door opener as discussed on the internet for people using Foscam cameras with relays. EasyN outputs 5 V between pin1 and pin 2 by default after booting. You can set the \"Alarm service settings\" to make it disappear after booting. However, like Foscam, during booting, it will turn on the voltage output for about 2 seconds and then off when the camera head is rotating (initializing). Some people say that this is required for linking to house alarms (I don't have). However, this will trigger the door opener. No good. Hootoo is perfect here. Its factory setting is to close pin 1 and pin 2 after reboot. (No voltage between pin 1 and pin 2.) This means if you check the resistance of the two pins using a multimeter, it reads zero ohm. This triggers door opener. You need to change it. I played with the \"Alarm service settings\" menu. It worked. (By the way, I don't use motion detection.) Now the Hootoo will not close the two pins after post power outage reboot or software hot reboot. Pin 1 and pin 2 now will only close when I use IP Cam Viewer app to do so. Now I can remotely operate my garage door and watch it open and close. In the app, you set \"pulse for garage door.\" Many garage doors are simple to control. Two wires come out of the opener main box to a wall switch. They carry ~16V voltage to power the indicator light (and motion sensor for light in some newer models) on the wall switch. When the two wires are in contact momentarily by pressing the wall switch, door opener is triggered. Wiring from the camera to the door opener is thus extremely simple. Just link two wires between the camera and the door opener box or the wall switch. By the way, for the two Hootoo and EasyN models, pin 3 and pin 4 output constant 5 V (not-controllable by software). Useful if you want to power an external speaker. Hootoo has a Reed relay with a magnet inside. I can hear the clicking sound clearly even with Android app remotely, so I know the relay is activated. EasyN has a solid-state relay without any clicking sound. I prefer the clicking sound. Warning: Remotely operating a garage door is only safe if no one else is around the garage! Don't risk it when you have others living in the home. I use it to open the door when the delivery man has a big package.Advice: After you obtain a perfectly working relay for your door opener, save your camera settings in your web interface as backup. Never activate motion detection in your web interface or Android app. Otherwise, the camera will close (constant close, not pulse close) pin 1 and pin 2 during and after a reboot (due to power flicker, etc). Your door will open during booting. You have to open up (set relay off for) the two pins using Android app or web interface. Otherwise, your wall switch won't work (even its indicator lights will be off). You can restore your backed up settings using your web interface and after this camera will work fine. In essence, never set \"Alarm on\" if you want to control your door. The IP Cam Viewer app's light-bulb icon also controls the same relay. Don't play with it because it does not have the pulse function. By the way, my Device Firmware Version is 17.37.2.41 and Device Embedded Web UI Version 20.8.1.124. Your results may be different if you have different versions. I found that Hootoo HT-IP210F camera will close pin 1 and pin 2 briefly during booting. You may have constant close of pin 1 and pin 2 if you change your alarm service settings. I have  Device Firmware Version 17.37.2.47 for HT-IP210F. It shares the same 17.37.2.41 firmware with HT-IP206. I guess if I downgrade to .41, I will avoid the the problem. Not tried yet because they don't have .47 firmware available for download yet.", "Date": "June 23, 2013"}, {"Title": "great price and tech support", "Author": "Ken D", "ReviewID": "ROQRBJ66KS2D4", "Overall": "5.0", "Content": "Owned for a month and after some set-up help, works flawlessly. Had to tweak alarm settings to avoid over alarming. Would purchase again.", "Date": "June 23, 2013"}, {"Title": "What I was looking for...", "Author": "Crystal  S", "ReviewID": "R152CUOVQ2GYU6", "Overall": "4.0", "Content": "I am pleased with this camera so far. The set up was extremely easy if you follow the directions. The picture is fantastic and it does the same things that other similar more expensive cameras do. I purchased this to use as a baby monitor and well I am glad that I did. The only trouble that I am having at this moment is with internet explorer which is the best to use for this camera, however, it does work nicely on Google chrome. I think that I will purchase a second camera later on just to monitor the house...", "Date": "June 20, 2013"}, {"Title": "great product for a cheap price", "Author": "al", "ReviewID": "R29H9JVDUXPEA8", "Overall": "5.0", "Content": "excellent product for the price. If you understand networking and routers, you can have it up and running in less than 20 minutes. the ucampro app available for android and apple devices is very well thought out and works great with this camera.", "Date": "June 6, 2013"}, {"Title": "Good Investment", "Author": "Lewis A. Brown Jr. \"layspeaker\"", "ReviewID": "R11K0A207IAXUT", "Overall": "4.0", "Content": "I purchased this item and did not realize how good it actually was. It suits my needs and the support i received in connecting it was fantastic. I would recommend this product for those individuals who are looking for a security camera at a nice price with very nice funcitons.", "Date": "May 31, 2013"}, {"Title": "Not bad but challenging to setup", "Author": "MarioInDallas", "ReviewID": "R7XWF84J3L1B5", "Overall": "4.0", "Content": "I purchased this little camera and found it difficult to setup.  Once I did get it working it was OK quality but the panning was very fast and tilt, etc was only OK.  If you can get the camera exactly where you want it, you can set some preset buttons to get back there again.  I liked it OK, but ended up returning because there are better options available.Update - while I did end up returning this camera, I will say HooToo customer service was very pleasant to work with and it was a hassle free experience.", "Date": "May 20, 2013"}, {"Title": "works great, best custmer service", "Author": "Bill", "ReviewID": "R3CTH5M78LO1U4", "Overall": "4.0", "Content": "Thd camera does exactly as what was described. The customer service I needed on a minor configuration was like speaking and dealing with friends.", "Date": "May 20, 2013"}, {"Title": "does the job for a killer price", "Author": "Terrance W. Adolph", "ReviewID": "R3GIW7X5GKYOWX", "Overall": "4.0", "Content": "You need to make sure your modem is bridged. It responds well and the quality of picture is good. This camera is better at over 3' of distance. But you can't beat it for the dollars.", "Date": "May 16, 2013"}, {"Title": "Nice Camera at a good price!", "Author": "MikeW", "ReviewID": "R3VCYVIUF3UZDT", "Overall": "5.0", "Content": "This camera has Wi-Fi as well as RJ-45 cable connection to the Internet.  It is very easy to set up and display the image anywhere using any Internet Explorer application.  I also have it set up so I can view the image on an Android Smart Phone as well as send me emails with images when there is a motion detection trigger.I contacted HooToo customer support with an issue I had a question with and it was handled in a very timely manner.I liked this camera so much that I purchased a second one for another area in my home.", "Date": "May 15, 2013"}, {"Title": "good value but not the easiest to set up", "Author": "Paul Radeke", "ReviewID": "R3F4VGYOJR4AX", "Overall": "4.0", "Content": "good value but not the easiest to set up.  and it should be marketed that way.  but the tools are ok compared to others but it's cheap!!", "Date": "May 15, 2013"}, {"Title": "Wireless indoor camera", "Author": "augustas", "ReviewID": "R112BTHSHKZ0OD", "Overall": "5.0", "Content": "Easy connecting good image from the camera. The software works nicely for setting up motion detection surveillance for home security. Wireless works very nice.", "Date": "May 5, 2013"}, {"Title": "Wasn't expected the overall functionality of the camera very affordable and highly recommended", "Author": "Jim", "ReviewID": "R10TO13C0MGM57", "Overall": "4.0", "Content": "The functionality and the quality of this unit are beyond my expectation, highly recommended, tech support are superb.although the manual is a bit confusing to follow, but in overall it's a very good product and its not pricey.", "Date": "April 16, 2013"}, {"Title": "PTZ IP Cam that works period for cheap", "Author": "brandon estes", "ReviewID": "R1ND7I1704TLF5", "Overall": "5.0", "Content": "I was expecting a chicom pos I figured given the low price little risk little gainthis camera functions exactly as advertisedI bought it to use with ispy open source and it works perfect10min setuphave never had to restart it", "Date": "March 13, 2013"}, {"Title": "Great camera", "Author": "Joshua M Haubold", "ReviewID": "R5ZCV9GU0KZA8", "Overall": "5.0", "Content": "The image quality is a little lacking, especially using the IR night vision, however for the price, this camera cannot be beat.The firmware also lacks a few nice features, like working VLC integration, and variable end-stops for the pan and tilt functions. Again though, for the price this is a fantastic camera. I'm using two of them as baby monitors on my computers and phones.", "Date": "March 8, 2013"}, {"Title": "Home security for under $100", "Author": "dk", "ReviewID": "R208M52C3IDHF7", "Overall": "5.0", "Content": "After tested several different other brands, I decided to give the HooToo model a try based on the reviews and was pleasantly surprised.While the instructions need some improvement, the installation procedure is intuitive and easy enough that someone with very limited tech knowledge can get up and running within 15 minutes. If you can setup a router at your house, you can setup the IP camera.The remote access is nice, but in my opinion the most useful feature is the pictures emailed when motion detection is detected. When the camera senses something moving, it has the ability to snap several images and email the pictures to you. Using this feature, you can setup a reliable security system for under $100. It also has other uses like keeping tabs on when your kids/spouse come home and so forth.Overall I am pleasantly pleased, and will be looking to purchase more in the future.", "Date": "February 28, 2013"}, {"Title": "Cool Cam", "Author": "Stipman \"purchaser of goods\"", "ReviewID": "R1OZAMRW0LVVLN", "Overall": "4.0", "Content": "Installed this to watch my dogs while out.  Yes...that's right, to watch my dogs!  I managed to set the camera up pretty quickly but I'm a technology guy by trade so I knew what I was doing.  If you're a novice home user the configuration may be difficult.  I installed some IP Camera software on my smartphone and it worked like a charm. As HooToo isn't a name brand I chose Foscam as my camera type when I installed the smartphone software and it worked perfectly.", "Date": "February 23, 2013"}, {"Title": "Fairly easy to set up, having problems getting audio to work", "Author": "Tony", "ReviewID": "R2C300U5Y6SQ3F", "Overall": "4.0", "Content": "Camera setup for video took less than 15 minutes.  I'm able to easily access with my iphone, ipad, and multiple web browsers for my PC and Mac.  However, I'm having problems establishing an audio feed.  Any advice?", "Date": "February 12, 2013"}, {"Title": "excellent solution for home security", "Author": "Di", "ReviewID": "R1W8WYV7GYXN3E", "Overall": "5.0", "Content": "quick, good, and is working as described. I can recommend this camera for use at home. The installation manual worries a little bit.", "Date": "February 5, 2013"}, {"Title": "Good cheap IP camera", "Author": "John R", "ReviewID": "R71Y17YH66AZ5", "Overall": "4.0", "Content": "For the money, these are worth it.  Provide good usable video and are easily set up.If you are looking for high resolution or exact color reproduction you may want to look elsewhere.  But for the average person, these are just fine.", "Date": "February 5, 2013"}, {"Title": "Excellent wifi camera!", "Author": "Wildcat Smer", "ReviewID": "R1U9SQXG8I7UUW", "Overall": "4.0", "Content": "This is a great camera for piece of mind while you are out of town. I highly recommend it and am going to get another one. The pan is excellent.Here are some things to be aware of:1) In order to set it up with wifi, you need to have it physically connected first via ethernet. It was a little confusing until I figured that out.2) When dawn rises, the camera makes a loud 'click' sound for about 30 minutes as it continues to switch from night vision to daytime. It is pretty annoying being in the room with the camera.3) The setup of the camera does require some knowledge of wifi networks, especially if you want to send pictures to an FTP site.I also wish they had a native iPhone app just to help with the usability while away.", "Date": "February 2, 2013"}, {"Title": "Disposable web cam", "Author": "R. J. Lowe \"IT, Gamer, Philosopher, Writer\"", "ReviewID": "R38KK06NCVU373", "Overall": "3.0", "Content": "For the price and limited longevity you should really consider this a \"disposable\" web-cam with some great functions not usually found in such low cost units.  I'm giving the unit a 3-star (average) review because of the trade-offs between cost/functionality (5 stars) and longevity (1-star). I've had three of these over the course of a few years.  Most last about a year or so before they die - usually from what seems to be an overheating problem.  If you use the pan/tilt a lot, the unit will die sooner because the motors make the unit get even warmer than usual.Even with the limited lifespan, I recommend the unit for its super low cost and much better than average functionality.  You will need some networking experience to get it working over the web - setting up static IP addresses, knowing how to route a port through your router, etc. So don't expect \"Plug-N-Play\" either.My latest unit just died so I'm planning to try the updated version, again with the expectation that it will only last 6-18 mos. Even with that short lifespan, I think it's worth it.", "Date": "January 9, 2013"}, {"Title": "Good Product", "Author": "Darin Burton", "ReviewID": "R225HXK7NNZ0LW", "Overall": "4.0", "Content": "Easy to install and use.  Good picture quality and nighttime vision.  I will consider purchasing another one for the home.", "Date": "December 28, 2012"}, {"Title": "IT WORK OK", "Author": "Patrick Griffiths", "ReviewID": "R1HUDUT9JB3AN7", "Overall": "4.0", "Content": "THIS CAMERA WORK VERY WELL.JUST AS IT SAID. SETUP IS EASY PICTURE IS NOT THE BEST. MT FOSCOM SHOWS BETTER.", "Date": "December 18, 2012"}, {"Title": "Great camera for the money", "Author": "Christoph W Whitney", "ReviewID": "R3TWFZ1CFVZGH3", "Overall": "5.0", "Content": "Bought the camera to use as a baby monitor. Very happy with the camera. Admittedly, there are no auto-setup wizards, but if you follow the instruction manual, it's pretty easy to set up. (More on the directions in a moment.) The wifi quality is fine, and the IR night vision is very clear. Power cord appears to be just the right length. The motor for pan/tilt the camera is quiet; it only makes a clicking noise when it reaches it's limit.Things that could use improvement: First off, the instruction manual is tiny. TINY. I'm all for saving paper and saving space in the box, and it's nice to have an actual manual in the box as opposed to just a pdf on a cd, but the print of the instruction manual is so small it's almost not worth it. Second, since I'm using the camera as a baby monitor, I don't need it on all the time. It would be nice if there was a power switch on the camera. Finally, the web interface to use the camera is ok. Not great, not terrible, but ok. Since I'm using it as a baby monitor, I'm really just using an app on my iPhone to connect to the camera. If I had to rely on the web interface for more than configuration, I might be a bit more bothered by it.BTW, if you're looking for software (either a NAS or phone app) to use with this camera, this camera is compatible with settings for the Foscam FI8910W.Overall, I think this camera is a great value for the money, considering the quality of the video/audio, the features of the camera, and it's compatibility with software.", "Date": "November 3, 2012"}, {"Title": "Love It :)", "Author": "crystal-m", "ReviewID": "R3DBBB90ZK9RHV", "Overall": "5.0", "Content": "I had some trouble setting up the camera at first but the support team emailed a better set of directions and it is working great :) Thanks!", "Date": "August 18, 2012"}, {"Title": "Great for the price", "Author": "OC Birder Trish", "ReviewID": "R1WTMCYJQKFDMX", "Overall": "5.0", "Content": "I paid a little more than the $69 they are listed at now, and am still happy.Come on, this is a $69 cam. This is a great deal!It was relatively simple to set up.It helps to have just a little knowledge of how to navigate your router, and set a port, and it is pretty easy to set up in the software.I have 3 \"cat cams\" at home, which also nicely let me keep track of the house when I'm away. I just plug in the IP with port, and using (gag) Internet explorer, I even have audio and mic ability. It works. I scared the crap outta my cleaning lady! LOL!If you want high res. hi-def video, this is not the cam for you.Go pay $2k and get an Axis camera.If you're good with low def, low res video, for a low price, this is a great deal.I've had these cams for over a year, and think they are great. I will add a screen shot or 2 of the multi cam display.", "Date": "May 12, 2012"}, {"Title": "Great functionality, zoom is too much", "Author": "Kristin Hilgart", "ReviewID": "RHLI3DB26YUM3", "Overall": "4.0", "Content": "This was not hard to hook up (~20 minutes to go wireless).  Works well with our Android phones and Windows 7 computer.  We use as a baby monitor.  The problem we are having is that even though it is on the ceiling, we still can't see the whole crib without scanning (can't zoom out).  The app is Good-OK, it does have two way sound, but the squelching doesn't work really well and we decided to keep an audio monitor for sound.  We also have problems with the IP address changing once in awhile (might be our internet/router) which is annoying when you have to manually input the IP address into your app for it to find the camera.  Definitely plan to use a computer to install this and troubleshoot IP address issues.", "Date": "November 1, 2013"}, {"Title": "Great value, Great customer service", "Author": "Marino Tavarez", "ReviewID": "RUMGRX2YRI3MG", "Overall": "5.0", "Content": "HooToo - THUMBS up!!. I have had this camera for 7 months and was very impressed with both the price (I own both Foscam and Dlink) and ease of use. Quality about as good as Foscam for almost 50 dollars less. Recently, The camera stopped working and after emailing CUSTOMER SERVICE, without delay, I will be receiving a new one soon! In the past, I have had both Dlink and Foscam cameras malfunction. DLink sent me a new one after weeks of troubleshooting delays, (only after asking for credit card info, in case I did not send the malfunctioning one back). Foscam performed a bit better, but they asked for the old camera first, I am still waiting for replacement a month later.", "Date": "August 20, 2013"}, {"Title": "HooToo How to", "Author": "Russ Brown", "ReviewID": "RD1TXSDCBQ1YQ", "Overall": "4.0", "Content": "The HooToo IP206 camera works very well when connected via an Ethernet cable. The instructions for setting up the camera are about as clear as mud. HooToo markets the camera as wireless; however, they must have forgotten this when putting together the instructions. Discovering the IP address of the camera can be best accomplished by making sure the camera is set on DHCP; then after discovery and setup you can easily set a static IP address. Setting up the camera for wireless use can be an exercise in futility. After I finally threw up my arms in exasperation I contacted tech support, which by the way responded timely and was very helpful. We tried several \"fixes\" to no avail. This is when we finally set the camera to DHCP from the static IP address I had assigned. This avenue also introduced a new MAC address that is not mentioned in the instructions or marked on the unit like the Ethernet MAC address. I strongly suggest you write this wireless MAC address somewhere on the camera. The software that comes with the unit for discovering the camera does an o.k. job of finding the network; after a couple of refreshes. I should also mention that if you're operating system is 64bit then you need to go to the manufacturer's site and download the appropriate software. The software could not automatically set the camera up on the network.  The clarity is very good for a camera in this price range.I use this camera to check on our children while I am on the road. The HooToo IP206 is very easy to setup on a smart phone. The camera integrated very well with the app I have installed for another IP camera. I purchased the app for two way audio, this was somewhat a waste of money, poor sound quality and the audio kills the camera's ability to pan or tilt.  Night vision works very well on this camera. I am able to view a distance of 30' and still receive a decent quality image. The only annoyance is the incessant blinking white light that indicates the camera is receiving a signal. Fortunately there is a control to turn this feature off. For more product reviews please visit our blogs at cherrydealz.comI hope this helps in your purchasing decision.", "Date": "August 5, 2013"}, {"Title": "Very poor quality and will not last 6 months.", "Author": "J. barney \"James\"", "ReviewID": "R3S9XSUL3GCKUP", "Overall": "1.0", "Content": "I purchased 4 of these cameras 4 months ago. After 60-90 days they each began to fail.  Like clock work all had quit working (will not power up) within 30 days of each other.  All are now dead. I believe the problem was over heating.  They all exhibited a very warm spot on the bottom cover.  A real waste of money.", "Date": "April 29, 2011"}, {"Title": "I hate it.", "Author": "Donald  Leak", "ReviewID": "RF77RIRYMQ2QL", "Overall": "1.0", "Content": "Can not get it to work have had it for a while now and still trying to make it work but it just want work.", "Date": "August 30, 2013"}, {"Title": "Caught Our Thief", "Author": "subeesasser", "ReviewID": "REMNDKVOG0J4U", "Overall": "5.0", "Content": "I am NOT any type of computer savvy person, but I was able to get this working the same afternoon it arrived. Worked perfectly and caught our thief the first day. The police detective was impressed with the quality of video, and said she had seen much lower quality videos from much higher priced cameras. I have even dropped this onto our slate floor and it is still working. Super thrilled with this product!", "Date": "August 29, 2013"}, {"Title": "Great product and great service", "Author": "kartik Kris", "ReviewID": "R30AHX8SW3G269", "Overall": "5.0", "Content": "The most important with these products is to have good customer support when needed. Called the toll free number on the leafet and engineer was very knowledgeable and helped me with the issue in minutes.", "Date": "August 20, 2013"}, {"Title": "ht-ip210f camera", "Author": "Nelson", "ReviewID": "ROGI9EVKDFAZ5", "Overall": "5.0", "Content": "this camera has a quick setup, very simple to go without the need of the manual instruction.camera works fine for me so far.great camera with reasonable price", "Date": "June 26, 2012"}, {"Title": "Good basic set up... once you get it working", "Author": "R. Lee", "ReviewID": "R1KBUKC9NB9F92", "Overall": "3.0", "Content": "Everything works well. If you're trying to get this over the internet, make sure you port forward correctly (through modem and router if necessary) also, don't use the default port 80 or 81; use a higher number port to avoid interferences. Took me about 3 weeks to figure that one out. Also speaker quality is quite poor but there is an audio output. Overall well worth the money but some sacrifices to save the $50 over the more expensive brands. Also doesn't come with registered software.", "Date": "November 4, 2010"}, {"Title": "Great Value", "Author": "Torino10", "ReviewID": "R241X297XH67MU", "Overall": "3.0", "Content": "This Camera should get 5 stars, if the directions and installation instructions made any kind of sense. If you don't have a lot of patience and/or a lot of experience with setting up routers and IP devices then find someone who does before you buy this.I bought two of these camera's and after throwing out the Directions that came in the box, I had the first Camera up and running in about 4.5 hours of internet searches and trial and error, setting up the second camera took about 5 minutes. The picture quality is good as long as you remember that there is an adjustable focus lens.The camera has 3 options in the log in screen based on what browser you're logging in with; IE with ActiveX turned on, other browser without ActiveX, and cell phone browsers with JAVA. You get the most functionality out of IE with multiple camera views, record, listen and talk options. Just remember to turn off ActiveX after you get the camera's working, personally I just use IE for my security camera's and Chrome for my web browsing.There are also 3 levels of access accounts for the camera; Administrator, Operator, and Visitor. Administrator accounts allow full access to all the camera functions including setup, Operator accounts allow full access to the camera controls excluding setup, and Visitor accounts allow access only to what the camera sees without any controls.", "Date": "February 7, 2011"}, {"Title": "not a ez set up", "Author": "diesel", "ReviewID": "R1957V2LWNGVCV", "Overall": "2.0", "Content": "the instructions are not easy to follow.  i bought two cameras and one did not work as the other did.  getting support for the products by phone is a joke.  i returned and did get a full refund however.  these cameras are probably ok if you know how to set up ip cameras beyond a intermediate understanding of tech.  otherwise, stay away.", "Date": "November 15, 2010"}, {"Title": "typical Chinese...works mostly", "Author": "Ernman \"Ernman\"", "ReviewID": "R3JBYDYDAV7EEV", "Overall": "3.0", "Content": "One thing I've learned about cheap Chinese merchandise is that it rarely works the way it is promoted. This is a FAIR camera. If i had paid more that the ~$50.00, i'd be disappointed. The panning capability makes it worth the money.Pros:decent video picture. Good lens field of view, awesome panning capability.Cons:crappy ip server in the unit.Unable to get wireless working. I know it is the camera's server since i have multiple other wireless devices working with my setup. I cranked every setting in the camera's setup and my router to try and get it to respond to my routers requests but nada! Fortunately, I can use this as a wired Ethernet camera, where it does work well.Only works with Firefox browser as others have noted.It may be defective since i can't access this camera from any other location (via the browser) except the computer it is attached to???. If i bring up firefox on the connected computer, works fine. From the office, tells me the camera's server isn't responding. Same message i get from the connected computer when i try to do wirelss... this should work from any computer. that is why i suspect the unit's internal server is a piece of junk or is defective.Instructions worthless. if you don't understand how to hook up and configure remote ip devices, don't buy this! The instructions are so poorly written they should left out.Minutia:I've seen these camera's under various brands for up to $150.00. Don't waste that kind of money on it. It is a decent camera with great pan & scan capabilities that works well as a wired IP camera...that's about it and $50.00 is about all it is worth...", "Date": "October 12, 2010"}, {"Title": "To soon for full review", "Author": "F. David Mendlik \"GizmoJunkie\"", "ReviewID": "R34OU49Q489LIA", "Overall": "2.0", "Content": "I received the cameras yesterday; I ordered 2, one for each of the kid's bedroom. I plugged the power into one of them and it whirred, panned up then down, left then right. I thought to myself, this is way cool, much better than I expected. I thought this was going to be a piece of cake getting it all set up. Boy was I wrong.Unless I missed something this camera is no plug and view. First off I installed the software that came with it on my laptop running Windows Vista. To my surprise the software didn't work. So I downloaded, what I thought would be a more recent version. To my frustration that didn't work either.I also thought that with the antenna attached to the camera it would connect to my wireless network. Well it didn't. But this may have been due in part of the crappy software.The instruction manual that came with the cam is a booklet that when opened is about 3\"x4\" with a font size around 5 or 6. Written in what looked to be British. So get ready to use very strong reading glasses.I'm not giving up on it. I'll dedicate a day to getting them up and running. Once I do that I might change my review.Until then....like my Grandfather always said, \"I'm too poor to be cheap.\"", "Date": "October 13, 2010"}, {"Title": "Dont buy it!!!", "Author": "Lee", "ReviewID": "RGDWOI6TD7399", "Overall": "1.0", "Content": "I got this couple days ago. It took me couple nights  to fix them for outside network using. Dont ever try to read this BS manual, you dont even read those tiny broken english. I called for technical support from HooToo, they dont even know what to do with their own camera. So unprofessional tech supports.....so i have to return it immediately. Thanks for Amazon customer service, they cover for returning fee! That is how to do business. I hope Hootoo should learn from it. I wish if they have a HALF Star icon here, so i give them. They deserve for this uggly Star! People please dont buy this China made crap ipcam", "Date": "August 16, 2012"}], "ProductInfo": {"Price": "$89.99", "Features": "High performance camera for professional surveillance and remote monitoring, Pan/Tilt movability with wireless connectivity\nTwo way audio support for easy interaction (Talk through the camera from anywhere in the world. Want to surprise an intruder or remind your teen at home that it's homework time? Just click the 'talk' tab and do it!)\nBuilt-in motion detection and powerful event management, email alerts with up to six snapshots, intruder alarm capabilities\nHigh-performance compression and streaming capabilities, Day/Night functionality with images down to 0.5 lux\nEasy and flexible installation, trouble-free, ideal for securing locations such as small businesses, boutiques, restaurants, hotels or residences", "Name": "[P2P Technology] HooToo® HT-IP206P(Black) Indoor 0.3 Mega Pixel RJ45 Wireless IP Network Surveillance Camera (802.11 b/g, 1/4\" Color CMOS Sensor, f: 6.0mm, F: 2.0, Pan/Tilt: 270°/120°, 10-LED Night Vision, Two-way Audio, Email Alerts)", "ImgURL": "http://ecx.images-amazon.com/images/I/41VdwAYBQnL._SX300_.jpg", "ProductID": "B003NZS37G"}}