{"Reviews": [{"Title": "Great camera for the price. Revised: NOT!", "Author": "Wolf I. Butler", "ReviewID": "R3LIWSUGF1GGUZ", "Overall": "1.0", "Content": "Update 7/26/12:All of these cameras seem to have the same \"flashing\" problem. It isn't clear if it is the \"IR Cut\" filter or some other problem. They also might as well be black-and-white given how terrible the color is. If something happened and video from this camera needed to be submitted to authorities- it would be next to impossible to actually identify anyone in it.The \"flashing\" problem seems to occur at a particular light level (much too bright for the \"IR Cut\" filter if it is working normally), so at least twice a day (or more often in changing weather conditions) the cameras brightness rapidly changes between light and dark for 30 minutes or more. This triggers both the camera's internal \"motion detector\", as well as the motion detection algorithms in security DVR software like Blue Iris or iSpy. In other words- your mailbox, FTP server, or DVR will fill up with completely useless images, very quickly.Technical support via email says a \"Factory Reset\" will fix the problem. Not only doesn't it fix the problem- but you then have to set everything up again from scratch, which is a problem if you are using them via WiFi in a not-easily-accessible location.Also- mounting these cameras outdoors means you pretty much have to cut and splice the 5v power cord, and use a lot of tape or an outdoor box to keep the connectors in. They come with a short cable and a set of connectors that you would have to drill a 1.5\" hole in the wall to route inside. The power supply is only indoor rated, and is too big to put in an \"In-Use\" covered GFCI box. Of course- you can't return them without the factory-provided power supply...Update 6/12/12:I dropped my rating to two stars.While probably still a good value for the money, these cameras have at least one serious issue. I returned one, but the replacement has the same problem. A friend of mine bought two cameras at the same time I did, and has the same issue with hers as-well. The cameras flip randomly between their \"IR CUT\" filter and normal in certain lighting conditions. This causes random light/dark flashing at various times throughout the day. This flashing, besides being extremely annoying, also trips the \"motion alarm\", sending hundreds (or in the case of one of my cameras- thousands) of bogus motion alarm pictures out. If you use their software to record video- you will get many-many hours of nothing but flashing video filling up your HDD.One solution I found online is to either color-over or tape-over the light sensor on the camera. Tried that- doesn't work. I requested support on Wansview's Web site a week ago, and have heard nothing. There also aren't any firmware updates available for these cameras. I guess we can keep returning them for new ones, but since this is happening on 4 out of 4 (actually 5 if I count the one I've already returned) it's pretty clear it is a manufacturing defect. All four came from different vendors (via Amazon) Wansview should just give one the option to turn the stupid filter OFF! They do seem to work quite well at night, but during the day- they are almost useless for hours at a time.Leaving my old review here for reference...I recently bought two of this most-recent version of Wansview outdoor security camera: NC543W. The camera has a solid aluminum housing and appears to be well-sealed from the elements. I bought three similar cameras last year. They are cheap and the picture quality definitely isn't HD, but they are very usable.The camera's I bought last year came with terrible \"Chinelish\" manuals that were almost impossible to read. They also didn't come with any kind of viewing/recording software, forcing me to use marginally-implemented browser-based viewers or 3rd-party software. I'm very happy to say that this has changed for these two most-recent purchases. More effort was clearly put into the user's manual, and the included \"multi-view\" software works very well. The really big bonus with the viewer software is the ability to record video, as opposed to just still images.As another bonus- the cameras will work with uPnP routers (or you can manually set up tunneling) and Wansview provides a DDNS server, making it very easy to set the cameras up for remote viewing. The manual does a decent job of describing the setup for this, but non-geeks may need to get a bit of help configuring their router if necessary.The camera has an \"automatic\" software color filter that is supposed to just kick in when in IR nigh-vision mode. I suspect this may be causing problems for some. I've found the color during the day to be very acceptable. In low-light there is a definite color shift, mostly noticeable at dusk and dawn.I really only have two issues with these cameras, preventing a 5-star rating:I can't get the Internet Explorer version of their Web viewer to work. I've tried it on three computers. The plugin install seems to \"blow up\" and I get nothing but a blank view. It's possible this is due to over-zealous security settings on my part, but I'm not going to lower my standards to install a plugin. I don't get any kind of an error message or pop-up. The other browser version works just fine on Chrome, Safari, and Firefox. It also works great on iPhone and iPad, although there are some great 3rd party camera viewers for them, as well as Android, that work fine with these cameras.It is difficult to accomplish a good outdoor mount of them due to the length of the connector cable and the size of the network jack. If you want an inexpensive \"clean\" install- you pretty much have to drill a 1\" hole to route the cables through to the inside. The power adapter and its cable are not outdoor rated, and it doesn't appear any of the other connectors will last long outdoors without some kind of protection. It's probably possible to cram everything into a water-tight exterior box, which is something I'm going to experiment with. I'd much rather drill a small hole for the power adapter cable (and network cable, if necessary) than a 1\" one. Tacking things up under an eave seems to be the cheapest option, and I don't believe that will make it through winter. Power-over-Ethernet would make things easier, but would likely raise the price of the camera.Like I said- it's a great camera for the price. If you want good color balance and a higher resolution with more features- look at spending 3-10x as much. If you want a reliable (at least in my experience) security camera and don't have a lot of money to spend- this is a great deal.One bit of advice- it is difficult to tweak the motion-sensor sensitivity, especially outdoors where things like trees and shrubs blowing in the wind can set it off. This isn't really the fault of the camera- it's just the nature of such systems. These cameras can generate a LOT of email, so if you use that method of \"alarm\" notifications- get yourself another email account with a lot of space on one of the big providers. That way you won't flood your personal email account. If you use FTP- you will want to frequently audit the server's disk usage, or use an automated process to delete older uploads. If using the multi-view software to record video- be sure to enable the feature that automatically deletes older videos if you are running out of disk space. I recommend using a dedicated partition or external disk.", "Date": "May 30, 2012"}, {"Title": "Updated review (2.26.2014 ) - think it's slowly dying", "Author": "J. Canfield \"John - old geek\"", "ReviewID": "RUJXVJ8O5ES7R", "Overall": "2.0", "Content": "This cam is a Wansview NC543W.UPDATE:  2.26.2014Amazingly the cam is still sort of working, it's been in temperatures from the 10 degree range to maybe 100 degrees.  Recently I've noticed now I can't view a picture with Internet Explorer (ActiveX mode) but it still will stream a picture in Mode 2 view (all other browsers.) Another issue is the motion alarm only works intermittently. I have an old Toshiba pan/tilt cam that would lose time due to NTP not keeping the internal clock synchronized and I could always bring it back to full functionality (for a little while anyway) by reflashing the firmware.So off I go trying to find some updated firmware for this cam, well guess what - there isn't any available.  Wansview has firmware available on-line for their NCM line of cams but that's it, apparently there is ZERO effort going into any cameras except the NCM models.  Thank you for abandoning me - I will be certain to return the favor.I now have about a dozen IP cameras of various makes, models and price ranges running around the place and after years of IP cam experience, believe me when I say you ARE NOT GOING TO BUY A DECENT CAM FOR UNDER $100, actually if you want a good camera, you need to get into the $200-250 range.  Now if you can move up to the $350 range, you have lots of good choices out there.  I've bought several TriVision NC-336PW cams - great build quality, full 1080p and power over ethernet (POE).UPDATE:  2.12.2013Cam is still functional :)  What I thought was wonky color balance is I believe due to no IR cut filter, the IR emitters are always on which screws up the color balance.UPDATE:  3/15/2012The cam still works!  Yea!  The color balance is still awful. Boo!UPDATE: 4/19/2011It took about five days of emailing back and forth to finally get ATC-whatever-LLC of Naperville, IL interested in sending me a new cam.  Customer service after the sale with ATC-whatever-LLC of Naperville, IL is very poor.  I would never buy another product from them ever again.UPDATE: 3/30/2011The cam stopped working about two or three weeks ago.  If I power-cycled the cam, it would work for about five minutes and then become unresponsive.  Wansview emailed me the firmware after I contacted them about the problem, loaded the firmware and then the cam seemed to work okay.  After about an hour of operation, it was broken again.  I'm done with this cam.  I think (not sure though) this cam appears in different permutations - Smarteye for one.  Dealing with Chinese support via email was very cordial and they were responsive, but completely unproductive.After reading the seller's (not Amazon unfortunately - it was ATC-whatever-LLC) return policy, it was a bit convoluted and I'm not sure what the warranty policy is.  After reading ATC's diatribe about returns, I think I'm going to throw the cam away and never buy a product from ATC-whatever-LLC again and probably never buy a Wansview cam or its other variation, the Smarteye (assuming I'm correct about the relationship.)What a shame...--End of update--NOTE:  All features and functions will work in Internet Explorer (like two way sound.) You can view the video in Firefox/Safari/Chrome/etc., but you will not have full features and functionality.I have several webcams keeping an eye on our ranch and I do have a bit of experience with higher-end models (Toshiba/Panasonic) so this review will evaluate this cam relative to my experience.Basically, you shouldn't expect a ~$90 cam to perform like a ~$900 dollar one.  There are a lot of trade-offs with the low-end models - a poor quality manual (in this case written in 'Chinglish') that assumes you already know most of what they are attempting to describe to you (they don't want to spend a penny more on a tech writer than absolutely necessary.)The firmware might not be as fully developed as other higher-priced cams - case in point with this one is there are no real color balance controls.  You get 50 or 60 hertz or outdoor mode.  In lower light conditions, the color balance is really, *really* bad.  The color balance might be really bad in brighter light, but I don't know since that is not my application for this cam.  And the image sensor might not be first quality and size of it makes a huge difference.  This cam will display a max resolution of 640x480, not too bad and a useful size.So what about this cam?For about 90 bucks, it is a pretty good deal.  Here are some caveats and features:- it is a good deal if you do not need detailed step-by-step instructions to set it up- it is a good deal if color balance isn't a big issue- it is a good deal if you can deal with a *very* incomplete manual - it has no explanation about the audio out, audio in, alarm connections, or any API (application programming interface.)  In fact, it is like Wanssview allocated xx dollars (Yen?) to the manual - when that amount was reached, they pulled the plug on the tech writer.  To be blunt, the user manual sucked big-time- the IR (infrared) night view was very good.  I don't know about the range since my objective is to keep an eye on an automatic animal feeder which was only about eight feet away from the cam.  In total darkness, I can plainly see the feeder in all detail.  I was impressed!- it has no built-in microphone or speaker, but has the capability of both.  The microphone feature does work - I tried it!- in lower light the cam is not particularly fast - you will get image blur on an alarm triggerIf you buy this cam, \"OSD\" means On Screen Display - this is not mentioned anywhere in the manual.  For \"Motion Detect Armed\" - Motion Detect Sensibility [sic] - 1 is the least sensitive and 10 is the most - it took an email to China to figure this out.  7 seems to work the best for me.If 90 bucks won't make a difference with your kids eating and having adequate clothing or not, buy this cam and play with it.  If 90 bucks *is* a big deal to you, I would stick with Linksys, Dlink, Panasonic, etc.", "Date": "January 25, 2011"}, {"Title": "Wansview NC543W warranty problem!", "Author": "W. Stubbs \"Computer Burt\"", "ReviewID": "R36Y4MBEQQ6X4J", "Overall": "4.0", "Content": "Review Update of 7/25/11A NEW (replacement) Wansview NC543/W outdoor wireless IP camera arrived today! The seller honored their (3-year) warranty by returning a New camera, not a refurbished unit! Based on this experience, I highly recomment the (Chicago) seller and Wansview camreas!  The other two cameras are still working Great on my wireless network!Review Update of 7/23/11I was just notified that the seller was sending me a new camera to replace the defective camera. If that's true, I'm impressed!  I'll post a final review when it arrives.-------------------------------------------------------------------------Review Update on Wansview Warranty ProblemPerhaps I was too hasty in my first review, so I have changed it. I finally received a RMA & address to return the camera, which was returned on 7/13/2011. I'll post another update when the camera is returned.-------------------------------------------------------------------------This review is about a Wansview NC543W warranty problem.I purchased three of these cameras in a popular auction Website in Nov.- Dec. 2010. They have worked very well since installation (only about 6 - 7 months), until recently when one camera just \"died\". It has no power and you cannot communicate with the camera via a CAT5E cable nor wirelessly. Additionally, the camera does not show up with the \"IP Camera Tool\" that looks for any camera on the LAN, even when it's plugged directly into the router.The problem I have is not so much with the camera, although I'm beginning to be concerned with the quality of Wansview products. My biggest concern and problem is with the Chicago, IL seller - in trying to get warranty repair/replacement/RMA shipping instructions.  At first they were very helpful in trying to understand the details of the problem. Although it took a little time & patience, when all the details were provided, the seller agreed to examine my defective camera, and replace it.", "Date": "July 11, 2011"}, {"Title": "Died within hours, no support", "Author": "nwcoder", "ReviewID": "R1KLCX0S9783F3", "Overall": "1.0", "Content": "Product died within a few hours on being installed. No support by the company, nor will they exchange it under their 'warranty'.Avoid this company and its products.", "Date": "August 2, 2012"}, {"Title": "I amd very disappointed", "Author": "Victor Daniel", "ReviewID": "R135G7V1RGR94L", "Overall": "1.0", "Content": "This camera same as HooToo HT-IP212 Outdoor Wired/Wireless Surveillance Camera. Same problems:I am very disappointed with this camera. In the wireless mode camera works only within 10Ft. This is it.I am Computer and Network Engineer with 17 years of experience.  I am setting up a various PCs and computer based devises all day long. I know how network works very well.  This camera is a POS.Do Not Buy it unless you want to use it as a hard wired camera. You can connect RJ 45 directly to you Router. But if you have to run a wire, than you do not need the wireless component.Software is not too bad, but camera sometimes loses its network settings and you will need to re-set it again.", "Date": "July 24, 2012"}, {"Title": "Wansview Outdoor Waterproof Wifi Wireless", "Author": "brandon tx1", "ReviewID": "R391FMCJOFZO5J", "Overall": "1.0", "Content": "not worth my money after all considerations.runs hot all the time, both cam and power supply feel very hot.can't turn off the nightvision LEDs.crappy software.and before i knew it, warranty already expired.conclusion, won't buy this brand of product again.", "Date": "December 13, 2012"}, {"Title": "Stopped Working after about a month", "Author": "Nullset", "ReviewID": "R2TIKNQO1D03NX", "Overall": "1.0", "Content": "I got this camera, setup was easy. everything was working fine.I upgraded my network to wireless N network, I ensured the wireless router was broadcasting in mixed mode, so that B/G devices could connect to it.After logging into the camera and setting up the wireless to communicate with my new router I hit Save and Apply.From there on out the camera has not worked, I have tried everything power cycled it, held down the hard reset button numerous times to no avail.I definitely do not recommend this cheap piece of garbage, it's totally bricked.BEWARE.", "Date": "December 10, 2012"}, {"Title": "Nice equipment.", "Author": "G. Brockett \"SJ\"", "ReviewID": "R3JYEUHP3872CW", "Overall": "4.0", "Content": "I purchased this as an addition for my home security system after purchasing another PT-IR camera by Wansview.I had no trouble setting up this camera on my secured wireless system. To do so, you MUST use the software on the CD for the first configuration (setting up the initial IP over the wired network.) The software I used was the Windows software and I ran it under WINE on my Linux system with no trouble. That is the only custom software you need, everything else is done through the browser (Chromium works fine.)I have both of my cameras set to upload an image at a set interval (and when motion is detected) to my FTP server (which I make into time lapses for each day automatically.) I have not yet tried to set up the alarm e-mails but it is in the software that you can do so.When mounting, give priority to routing the cable to a secure location, it is a short cable. I also found that a touch of loctite works wonders to secure the ball joint.I have had no issues with wifi on this unit, it is about 20 feet from the router.All in all, a great value. I will upload a couple of images from the camera.Update, 10 Months later: Still working fine.Spider webs and fog (at night) will trip the motion detector, but it is not too much of an issue.One note, I do not use the monitoring software so I cannot respond to issues of that nature. The camera will handle power outages easily reconfiguring itself to your presets and getting time from the internet.Update: I just bought 2 more in February '14. These both HAVE IR cutout filters. The old one did not. The angle of vision is narrower than the old one. One of the new ones died in 2 days. (log in fine, but no image.) So you have to roll the dice with these. Make sure your seller has a return policy that works for you.I will post a couple of images from the new camera.", "Date": "March 25, 2012"}, {"Title": "I can't use it", "Author": "JESUS RUIZ", "ReviewID": "R72UE0Q05RAXE", "Overall": "1.0", "Content": "the 4 cameras that i bought came with an ac adapter that is not for this country, is there any way that I can get the right ones?", "Date": "December 10, 2012"}, {"Title": "lack of product info", "Author": "vipergts_r_92", "ReviewID": "R1JH18DB8HFUS2", "Overall": "2.0", "Content": "bought the camera for outdoor use it works well as long as the tempurature is above freezing. the operating temps would have been help full in looking for the correct equipment for the cold northern climates.the wansview ncb543w works well and fairly simple to set-up and operate. just need to make the product is suited for the outdoor climate of the area.", "Date": "November 18, 2012"}, {"Title": "NC543W Advertisement Warning", "Author": "E. Coleman \"thetoltec\"", "ReviewID": "R2812TREOKCGAD", "Overall": "3.0", "Content": "I purchased 2 of these cams a couple of months ago. Set them up for wireless connection and they have worked fine ever since. Picture quality is fine in the daytime. Night viewing could be better with a few more LED's but ok for the price. Just one bit of caution before ordering. The seller I purchased from has pictures of a different version of this camera that has several more connectors than the actual NC543W. This camera does NOT have sound capabilities as you might think based on the falsely advertised representation!! It has one ethernet & one power connection. It also has a reset switch - nothing more.", "Date": "October 10, 2012"}, {"Title": "Great IP camera for the price", "Author": "B. andersen \"unjustly imprisoned\"", "ReviewID": "RU4I32H6T79Q2", "Overall": "5.0", "Content": "I have setup a few cctv security systems and really wanted to use ip cameras at my new house so I could do more with the streams, the only problem is most ip cameras are prohibitively expensive, these were less than half the price of any other decent ip cameras I could find.The housing is very solid, the lens and ir light setup is very high quality build.  The hood is slightly adjustable but doesn't really need adjustment for me.  I hadn't looked at the specs so let me warn you, this camera is bigger than I expected, not huge, just not the mini bullet I had planned to receive.The main problem I had was finding documentation to get directly to the video feed and bypass their UI, but it is very easy once you figure that part out, I found a nice document written by a user that figured this all out for me:[...] basically the camera provides the stream at .../videostream.asf where you need to include whatever ip or url you give the camera, including custom port if you give it one (default is 80)The video quality is good for a 640x480 camera, not HD but the night vision is more than adequate and the IR lights up quite a bit at night.I also had a problem initially with the WIFI setup, I tried to use their wifi scan to find my network, but multiple tries over a day or so, and the camera wouldn't find any wifi networks.  Not sure why this started working suddenly, but after leaving it plugged in for over 24 hours the scan just started working.  I don't plan on using these WIFI connected, but I did want to see how the performance would be.Even with all these minor issues I give the camera 5 stars because they might be all user error, and because the product is a great value. @ around $70.", "Date": "July 26, 2012"}, {"Title": "Problems", "Author": "Ladislav Nemec", "ReviewID": "R11QRGE6HWTJ5J", "Overall": "1.0", "Content": "I received the item a few days ago and it worked (first) fine when connected to the LAN by ethernet cable. A representative of the seller gave me a hint how to make it work with wifi.Yesterday morning I accessed the camera but the display was useless - no details, just a vague outline. So, I did 'factory reset' (the software asks 'do you really want to do that?') and after that, the camera became isolated from my network, using cable or using wifi. In other words, completely useless.Potential buyers should know that.", "Date": "August 15, 2012"}, {"Title": "Wrong power supply", "Author": "Greg", "ReviewID": "R2QM4W7EPQY1AZ", "Overall": "1.0", "Content": "The seller in Chicago shipped unit with a European power supply to a U.S. address.  The description says nothing about power model.  The barrel connector is not the standard 2.1mm used for most 12V electronics in the U.S., but a much smaller connector.  I might rate it higher if it could be turned on, but will need to cut up its cable and another 12V power supply.", "Date": "July 16, 2012"}, {"Title": "Mixed Blessings", "Author": "Amazon Customer", "ReviewID": "R10H039ASDCYX7", "Overall": "4.0", "Content": "There are a lot of good and bad reviews on the wansview cameras that makes it hard to decide on a purchase. After reading them all, I decided to give it a chance based on below:- Cost: It's one of the cheapest outdoor camera's that you will find- Functionality: It performs the basic functions that you need.- Display: Images are good when they work. night vision view is acceptable.My experience.- I brought 3 cameras knowing that reliability might be an issue.- All 3 worked out of the box and after 1 month, 2 are operating effectively.- The 3rd camera still has connectivity (I can access the admin console) however does not stream a picture. I will take a look at it today,Setup:- I suggest going online and reading the setup information from there. The forums are correct when they say the information out of box is lacking.- When you get the camera, connect it to local lan and perform the setup. I didn't use the built in software and connect via a web browser to configure the settings.- When using wireless, use WPA2 (AES). I noticed that the camera would not connect sometimes or loses connectivity when using TKIP- The button on the cable dongole is the reset button for the camera- The wireless IP and the lan IP will be the same however the mac address is different. If you lock down your access point by mac address, make sure you unlock it first to allow access.- hidden network is sort of flaky. I had to broadcast my access point for the camera to connect.Tips / Suggestions:- You can't disable the makers DDNS. If you do use their service, make sure you route through a different port and use storng passwords.- email alerting wasn't simple to setup. suggest you use a separate account for that if you do set it up.- Micasa vera. did't work out of the box and I am still trying to figure it out. One thing that does work is to use the /snapshot.jpg url to get an image to appear.Overall, given the cost, it is worth it. a bit of a hassle to setup but once it is working, no issues so far. I would recommend this for a low cost monitoring solution for those with some knowledge on how to setup and configure networking and systems..", "Date": "April 17, 2014"}, {"Title": "Wansview Outdoor Waterproof Wifi Wireless/wired Ip Camera with Night Vision, Motion Detection Alarm, FTP and E-mail alarm", "Author": "Kerry Holmes", "ReviewID": "R1OV0FKUSOV89S", "Overall": "1.0", "Content": "Instruction leave a lot out, makes it difficult to setup, wireless IP never worked, I am a computer tech and work in IT. If you do not have experience doing this kind of work find someone that does.", "Date": "December 23, 2012"}, {"Title": "Photos were good but the life of the camera too short", "Author": "Christine M. Henderson", "ReviewID": "R3Q3U77KQ6ZJ8", "Overall": "1.0", "Content": "had this camera for only 3 months and stopped working.  No power to unit.  Photos were good but the life of the camera too short.", "Date": "May 2, 2014"}, {"Title": "Cant be beat for the price", "Author": "Bob \"-Bob K.\"", "ReviewID": "RWBKXQ6XUW2MD", "Overall": "5.0", "Content": "Excellent for the price. Works well. Installed dozens of this brand cameras including the indoor ones. Never had a defect or problem. Even used the indoor models outdoors (under an overhand to prevent from getting wet) year round with no problems.", "Date": "April 23, 2014"}, {"Title": "Great for Visonic", "Author": "D. Schultz", "ReviewID": "R1BOOSFDB3MEPX", "Overall": "4.0", "Content": "This camera is a great, cheap alternative to the factory Visonic PowerMax Pro outdoor camera which is no longer available.  It links up perfectly with the PLink 2 and even shows up as a factory Visonic camera.Works great for this price.", "Date": "April 7, 2014"}, {"Title": "Great camera!", "Author": "trish13", "ReviewID": "R123EJJ1P5TU6Z", "Overall": "5.0", "Content": "Ordered this for the office and WOW what a great camera. The boss had me order a 2nd as he took the first home to use at his house. Video is in color, has night vision, and can be viewed from computer or smart phone in real time. Also has options for recording.", "Date": "January 24, 2014"}, {"Title": "Wansview Outdoor Waterproof Wifi Wireless/wired Ip Camera with Night...", "Author": "moni", "ReviewID": "R29YX3T3AF7YVV", "Overall": "5.0", "Content": "It works just fine,my husband installed it for me before he passed.I don't like that I am forced to write more than I want to write, I said what I had to say.", "Date": "December 15, 2013"}, {"Title": "It's OK, good vision at night", "Author": "Kenneth E. Breland \"KenB\"", "ReviewID": "R38XXUQL34NMAH", "Overall": "3.0", "Content": "the ac adapter died with a year, not easy to find the correct adapter, purchased several that were recommended for this but had to have an adapter in order to work, good vision even at night", "Date": "November 10, 2013"}, {"Title": "Flashing issue, and stopped working.", "Author": "RiCK", "ReviewID": "R3KX1QAIXA0O8G", "Overall": "2.0", "Content": "Has the same \"Flashing\" problem lots of other users have complained about.Stopped working less than a year later, but too late for refund or exchange.", "Date": "November 5, 2013"}, {"Title": "Security for my house", "Author": "David Winslow", "ReviewID": "RJCO0MGC53YTV", "Overall": "3.0", "Content": "I purchased this a few weeks ago and just started playing with it last night.  It's not overly user friendly to set up but then again, it's an advanced camera and not everyone needs one.  I'll figure it out eventually and when I do, I suspect I will upgrade this rating.", "Date": "November 4, 2013"}, {"Title": "Great value, not a high end camera.", "Author": "Amazon Customer", "ReviewID": "R3AEETISTFVLQO", "Overall": "4.0", "Content": "This camera has been a great purchase for me.  I use it in combination with some software that records the video and does motion detector.  The color during daytime isn't very good, and there are regularly glitches and cuts in the video, but not frequent enough to be an issue.  I thoroughly intend to buy another one.", "Date": "November 1, 2013"}, {"Title": "Good product.", "Author": "Carlos Arevalo", "ReviewID": "R33HY4NJSB98PW", "Overall": "2.0", "Content": "I failed to check the contents and ended up short the antenna. Using another antenna from my other two cameras showed me it works as expected. Seller suggested I buy one locally and they would reimburse me.  Unfortunately it's not that easy, it's construction is propriety and I could not find a replacement.  Even the web site (Wansview) doesn't,t offer the antenna", "Date": "April 13, 2013"}, {"Title": "Still trying to get it to work!", "Author": "Mick", "ReviewID": "RHRFWN1UJ6LPB", "Overall": "3.0", "Content": "Still trying to get it to work!Found the set up guidelines difficult especially with a cable ISP.Great build quality and looks. A real deterant.", "Date": "March 3, 2013"}, {"Title": "Does it work", "Author": "scytulip", "ReviewID": "R1AX84NORHNJHT", "Overall": "3.0", "Content": "Pros:1. Low price2. Automatically sending pictures to your Email when motion detected. Very convenient.3. Easy to install4. Water proofCons:1. Color - The color on the picture is strange. Dark blue/green is displayed as pink. I think this is because the infrared light is always on and nearby objects are lit up even in the morning.2. Wireless Setup - This camera doesn't work with WPA2 (TKIP/AES) of my router. My router is Rosewill RNX-GX4. I spent a lot of time in setting the wireless, but it doesn't recognize. Fortunately, my router has dual bands, and I turned on another band with WPA(AES) for this camera and made it work. Furthermore, it seems this model has some problem in DHCP. My router assigned the same IP to my computer and this camera. Of course, both freezed. Finally, I set a fixed IP on the camera and made the router's DHCP skipping its IP. It's OK now.3. Time Setup - If you didn't set \"Sync with NTP Server\" option, it might go back to 1970 after one or two days' use and the system will freeze, not giving any alarm.4. Installation - As a WATERPROOF WIRELESS camera, this product only provides a power cord around 2ft. I think people usually buy this camera for outdoor use, longer power cord is preferred. I had to buy another 6ft power outlet to install this camera.To conclude, this camera is designed for geek but not for household. Anyway, it's doing its work well now.", "Date": "February 24, 2013"}, {"Title": "nice item", "Author": "Awad Al Jahdali", "ReviewID": "R12P7HSE5XU7GQ", "Overall": "4.0", "Content": "it looks nice and it rigidsetting up is a little difficult but will manage with the support of the seller I hope.it was recommended by me to my friend and thats why he bought it.", "Date": "January 17, 2013"}, {"Title": "Good camera", "Author": "R. Miller", "ReviewID": "R2PU16IDUMPZNI", "Overall": "5.0", "Content": "Worked as stated and is good for watching the house.  Easy to use and good intructions to get it going.", "Date": "December 28, 2012"}, {"Title": "Wansview ip Camera - Decent for the price", "Author": "Joe", "ReviewID": "R1TIQHGF05BC26", "Overall": "4.0", "Content": "This is my 3rd Wansview ip camera. For the price the Wansview camera is a decent product. The video is acceptable and I use Blue Iris monitoring software to recordwhich work well together. I would recommend this camera.", "Date": "December 4, 2012"}, {"Title": "awesome camera", "Author": "John P. Melito", "ReviewID": "R3RKQ60FFS7CMT", "Overall": "4.0", "Content": "Great wireless camera, works perfectly, but you need to know some networking skills to get all the functionality out of it.", "Date": "November 14, 2012"}, {"Title": "Needs to be connected to modem", "Author": "RB \"Ron\"", "ReviewID": "R1NIN125ST00XT", "Overall": "2.0", "Content": "This has a nice picture quality. It is not wireless, it needs to be connected to your modem. I ordered another brand that is truly wireless. I was disappointed in the fact it is not wireless.", "Date": "February 26, 2013"}, {"Title": "Impossible to set up. Don't waste your time and money.", "Author": "Michael W. Leister", "ReviewID": "RX0OWSL0MW7BU", "Overall": "1.0", "Content": "Why is Wansview allowed to still be selliung this junk? I have been trying to get two cameras running and have had no succes at all. I even paid a very talented IT pro to give it a try and he gave up as well. Junk, and nothing but junk. Save your money and puchase something that works.", "Date": "May 15, 2014"}, {"Title": "Definitely do not buy!!!", "Author": "Eva Clark", "ReviewID": "RF71HBY106OH9", "Overall": "1.0", "Content": "Item was not as described, was not wireless, big waist of money! Ended up sending it back the same day", "Date": "March 30, 2014"}, {"Title": "Can't connect", "Author": "geovanny rojas", "ReviewID": "R2139DVU12SENG", "Overall": "1.0", "Content": "I did not get the software or disc that is supposed to come with the camera or other cables so is not working I am not using it very disappointed", "Date": "December 15, 2013"}, {"Title": "Good but...", "Author": "CDOtto", "ReviewID": "RFRE6RU1UZ6DA", "Overall": "3.0", "Content": "First, the picture quality is very good for the price but...the translation by the Chinese manufacturer is tough to understand and some guess work is needed.  Once the camera(s) are set up on your network then there is the software on your computer that is ok but...not great.  One great feature is that during programmed recording it does break recorded times into one hour segments so if you need to find a specific time period to review it is quite easy.  The program though will stop working from time to time and needs to be restarted.  The camera can also be set to record 15 second segments based on motion detection.  A significant problem for some novice users might be the fact that some of the recording variables have to be set up in the browser window and some in the software provided.  Another issue is that in the recording schedule the day \"Tuesday\" was shown as \"Thes\".  I was able to dig into the text form that contained this spelling error and fixed it but I suppose that is something one could live with.  I have also found that the programming will sometimes drop days or times of programmed motion detection recording.  It isn't hard to reset but still a problem.Overall they are working well but may present frustrations for some people.", "Date": "October 20, 2012"}, {"Title": "I SEE IT ALL", "Author": "MYTMERLIN", "ReviewID": "RJ7HAV3TUFMHC", "Overall": "5.0", "Content": "AQ GREAT CAMERA FOR SEEING ALL THOSE NAKED WOMEN COMING TO MY DOOR , GREAT CLARITY, WORKS AT NIGHT , A MUST FOR ANYONE WHO LIVES IN THE WOODS....", "Date": "February 3, 2013"}], "ProductInfo": {"Price": "$64.99", "Features": "add-on 9-24pcs IP cameras to the same one PC.\ncan be viewed remotely using smartphone software (not included)\nAlarming record by email, FTP server\nfor wireless set-up up to 10-15m, for night vision up to 30 meters\nWi-Fi compliant with wireless standards IEEE 802.11b/g and supports both WEP & WPA WPA2", "Name": "Wansview Outdoor Waterproof Wifi Wireless/wired Ip Camera with Night Vision, Motion Detection Alarm, FTP and E-mail alarm,with base/bracket", "ImgURL": "http://ecx.images-amazon.com/images/I/41MHEyHOVxL._SX300_.jpg", "ProductID": "B0047CKAN4"}}