{"Reviews": [{"Title": "Every home should have a DUAL sensor smoke detector", "Author": "Firstinlastout", "ReviewID": "R295BDQUKO5XRP", "Overall": "5.0", "Content": "As a professsional firefighter/paramedic for nearly 13 years, I see a lot of fires. I do know that most detectors out there are NOT dual sensor....they are mostly only ionization detectors that detect flame.  Remember it's usually not the fire that will kill you, it's the smoke and it's deadly component carbon monoxide that will end your life.  Photoelectric detectors detect these smoke particles and alert you.......ionization types rarely do if it's a slow smoldering fire. If your sleeping, by the time the ionization sensors detect the actual flames, the smoke and the CO will most likely have already gotten to you and you will be dead. That's why it's so VERY VERY important to have a dual-sensor smoke detector.  This item particular item IS a dual sensor that is designed to alert you to both smoldering low-flame fires and high intensity/ rapid flame fires. This detector will protect you 100% from fire related death/injury if used properly and placed correctly in your home.  Remember to replace the battery every time you switch the clock during daylight savings time or any time the detector chirps.  Always look for  a photoelectric/ionization detector and buy one.  Have one in your hallway, in the main living room at the very least and I always like to put one in each room because I am overly cautious.  Also make sure to have a B-C extinguisher on hand near the kitchen to put out kitchen grease fires....the #1 cause of residential structure fires.  Hopefully you can put a small one out, but if you discharge the entire extinguisher and the fire is not out......evacuate the house immediately and make sure you or someone called 911 prior to exiting your home.  Stay safe !", "Date": "June 12, 2012"}, {"Title": "First Alert Smoke Detector", "Author": "L. Edwards", "ReviewID": "R2A56H16YB9P2C", "Overall": "5.0", "Content": "After my house filled with smoke and my 2 Kiddie smoke detectors did not alarm, I replaced them with this First Alert model. I had already installed a First Alert SA320CN in the basement when the Kiddie I had there unexpectedly fell on the floor and broke (never did figure out why.)After the Kiddie alarms failed to work, I tested the First Alert in the basement by starting a smoky fire in a metal container. The First Alert alarmed as expected.Since my experience with the Kiddie detectors, after installing them, I will test alarms in the future with actual fire & smoke. The little \"test\" button on the Kiddie detector always worked, but that didn't assure that it would work in an emergency.Note: the SA320CN has replaced a prior model, SA302, which has been discontinued.", "Date": "November 4, 2011"}, {"Title": "Straightforward life-saver -- highly recommended", "Author": "V. Black \"alsbookshelf\"", "ReviewID": "R1T4GKHQH4UD3G", "Overall": "5.0", "Content": "I purchased four of these at once to replace my four aging smoke alarms. I like these units because they are inexpensive, compact, easy to install, they have two methods of detecting fire or smoke, and they run on inexpensive, easy-to-replace AA batteries. (I have never liked 9-volt batteries.) If you need a good, well-rated unit in a stand-alone smoke & fire alarm, this is the one for you. If you need a networked unit, I believe First Alert produces such a unit, but that feature will cost you  more. The SA320CN is highly recommended.", "Date": "September 19, 2011"}, {"Title": "Defective product, customer sevice is not very helpful", "Author": "H. Shenoy", "ReviewID": "R2F759HGULKFSX", "Overall": "2.0", "Content": "Bought from amazon in June 2012.Came with brand new Energizer batteries and installed them.Started Chirping in 1 month.Replaced with brand new Duracell batteries.Chirping in 1 month.Replaced again with brand new Duracell batteries.Chirping in 1 month.Called BRK (First Alert) customer service. They said to replace only with Energizer batteries and call back if it chirps - huh?Seems so strange. They are forcing me to buy Energizer batteries and also not willing to replace a defective product (what about the first set that came from Amazon? I told them it was Energizer, but she would not have it. Said I have to buy new ones and do it again).Nowhere is it advertised that only Energizer batteries are to be used.Very suspicious of so many positive amazon reviews.Bad product, Poor customer service.", "Date": "September 7, 2012"}, {"Title": "Battery smoke detector", "Author": "Allan G. Peck \"Prof\"", "ReviewID": "R1K1KZDOENQ8PB", "Overall": "5.0", "Content": "I replaced several battery operated smoke detectors with this model.  They were easy to install and are working perfectly.  I especially like the feature that will allow me to replace the batteries without removing the unit from the ceiling.", "Date": "August 21, 2011"}, {"Title": "Good not great", "Author": "B. Levine \"recycleguy\"", "ReviewID": "R1UGLQWTL71YD2", "Overall": "4.0", "Content": "Have owned prior models of dual First Alert home smoke alarms,using traditional 9v battery.  Bought 1 and liked it so boughtsix more.  2 issues but otherwise seems fine.1) Battery compartment difficult to close.2) One of seven is complaining about battery loweven after changing the battery multiple times. I evenhave a multimeter and tested the batteries, and theyindicated correct voltage.  Called First Alert, and atfirst they blamed the battery saying you can only use 1 of the 2major brands you know.  I explained I have others with samebrand of battery working, and also the same unit worked finefor a long while (had it for 8 months).  My theory is that sincesummer arrived, A/C unit blew some dust into the room which got intothe unit, and now it's not functioning.  Just a guess.First Alert agreed to replace unit after I explained that I hadbought many of them and all but one worked.This is the 2nd time over the years I called them about a defectiveunit. The first time they did replace as per the lengthy warranty,which is why I bought many more of these.", "Date": "June 20, 2012"}, {"Title": "It works but can't really be silenced", "Author": "A. Benenson", "ReviewID": "R2UNDJUQ350BRY", "Overall": "3.0", "Content": "I know it works because it began beeping when we were roasting a chicken and the kitchen started to get a little smoky.But then I found out the one thing I don't like about it - pressing the TEST/SILENCE button only silences it for maybe 10-20 seconds. So of course I had to press it 3 more times, and then I finally had had enough and took the batteries out (temporarily).Note to First Alert: The whole point of a silence button is to PREVENT people from taking out the batteries. So by making the silence last for such a short time, it's pointless. Next time you make a new smoke alarm, make the silence button last for at least a minute or two.", "Date": "April 22, 2013"}, {"Title": "Do Not Buy This Item", "Author": "Techno Junkie", "ReviewID": "R21SEZV54TYSMB", "Overall": "1.0", "Content": "I read many of the reviews for this product.  Many were good and many were poor.  I took a chance.  Bad Idea.  This product arrived timely and it was a good price.  I installed the item with the batteries that arrived with it.  Within less than a couple of weeks it began to chirp. So I replaced the batteries.  Less than a month later it began to chirp again.  Replaced the batteries one more time and it began to chirp within a week or so.  So I called the Mfg to let them know the problem I was having and they honored the warranty on the product. They shipped me another product.  I installed it and it began to chirp within two weeks.  I called the Mfg back and and told them about the problem I was having.  They stated they would send me another unit along with a return label. This was on 1-7-13....  I am still waiting :(.......  One other thing about this.  The unit I originally recv was mfg in Sept 2012.  I had informed the Mfg of this date and had thought it might have been a bad lot number.  But the replacement unit they shipped me was also Mfg in Sept 2012.  When I called back and asked for another warranty replacement I asked them not to send me one with a Sept 2012 Mfg date....  I am still waiting :(......", "Date": "February 16, 2013"}, {"Title": "Odd mounting instructions - Alarm seems good quality", "Author": "Gregor", "ReviewID": "R1BUUFU514UGTY", "Overall": "5.0", "Content": "I purchased two of the First Alert SA320CN smoke and fire alarms because of the double sensor.  The mounting instructions are strange, stating to place the screws at 3 and 9 o'clock.  If you do that, then you can only screw the alarm onto the mounting bracket part way, which makes it seem loose. I would recommend mounting screws at 4 & 10 or 5 & 11, with the mounting bracket's Caution label towards the front. It makes a big difference if the Caution is at the back. There are 3 pairs of holes in the mounting bracket (one pair would have been enough), so be sure to decide on which pair you're going to use. They are close together, and it's easy to mix them up while trying to mark the drilling locations. Experiment before drilling holes. Mounting hardware included (screws and plastic anchors).  The included Energizer batteries were fresh, expiring 2017. The alarm is loud.  I haven't had any false alarms, but I haven't burned anything either. I like the 10 year warranty.  The battery drawer is nice in theory, but is not very easy to use when the alarm is mounted on the ceiling.  It's easier to take the alarm down to change batteries. The device seems sturdy.  I'm happy with them. Purchased Dec. 10, 2011.", "Date": "January 24, 2012"}, {"Title": "Good Alarm but incorrect product information.", "Author": "NY Psychotherapist", "ReviewID": "R1XPI87W5U84F2", "Overall": "3.0", "Content": "I bought 14 of these for our home mainly because there appeared to be a feature that allowed the user to mute the alarm using a tv remote. Nope, not true. Just got off the phone with First Alert, agent states this feature was discontinued. So, if this is an important feature to you, BEWARE!", "Date": "February 9, 2012"}, {"Title": "smoke alarm", "Author": "Brenda M. Urban", "ReviewID": "R1S60P3J5IIHR7", "Overall": "5.0", "Content": "Easy to install, easy to change batteries, and comes with two AA batteries. Highly recommended by Consumer Reports magazine. Detects two kinds of fire in house. Great alarm.", "Date": "March 29, 2012"}, {"Title": "False alarms", "Author": "R. Owen \"rowen\"", "ReviewID": "R2O3TT9XQHLEZ3", "Overall": "1.0", "Content": "Alarm just alerts for no reason. I can't recommend this product. Not sure it's worth the time and effort to return for a new one.", "Date": "December 21, 2012"}, {"Title": "I've had 2. Each lasted about 2 months.", "Author": "The Reader", "ReviewID": "R1PYVC5XJ7BU40", "Overall": "1.0", "Content": "I've had 2 of these units.  Both of them have had to be replaced within about 2 months of receiving.  The first one would just chirp endlessly and was replaced under warranty.  The second one would chirp 3 times really fast every minute. It was also replaced under warranty.", "Date": "August 8, 2013"}, {"Title": "SA320 Does NOT Have TV Remote Silence Feature", "Author": "William Baker", "ReviewID": "R35B9A6S10VGB3", "Overall": "5.0", "Content": "Two First Alert SA320 units(SA320CN - same)received today. Amazon performance extraordinary, as usual. Units were ordered Saturday and received Monday. Thanks Amazon!The First Alert SA302 has a feature to silence the alarm using a TV remote control unit. Several of these units are used in our high ceilings and the ability to silence the horn with the TV remote is useful.The product description for the SA320 on the Amazon site lists the TV remote silence as a feature. Unfortunately, this is not the case. The First Alert manual enclosed with the product makes no mention of the TV remote feature. First Alert Customer Affairs advised that the TV remote feature was never in the SA320 unit. Further, he advised that First Alert does not now offer a smoke alarm with that feature. He did say that a combination CO/Smoke unit does still have the TV remote feature.I'm disappointed that the TV remote feature is no longer available. I am keeping the units and giving them a 5 star rate based on experience with other First Alert smoke alarms. Hopefully Amazon will revise the sales literature to remove the TV remote feature.", "Date": "January 23, 2012"}, {"Title": "The Best Smoke Detector in the World", "Author": "Gene P. Louie", "ReviewID": "RADTAGLYS9VRU", "Overall": "5.0", "Content": "This model has an abundance of professional and consumer awards..1. Consumersearch.com award said that it was the \"Top Rated - Best Around Smoke Detector.\".2. Choice Magazine tested it as the best of 15 models..3. Consumer Magazine rated the device first place among the 18 tested..4. It was Consumer Reports' choice for a dual-sensor alarm..5. U.S.A. Today highly recommended it to its readers..You can not argue with success.", "Date": "January 15, 2013"}, {"Title": "Defective on Arrival", "Author": "sseverus", "ReviewID": "R1M9ARH3T4L4MN", "Overall": "1.0", "Content": "This First Alert smoke alarm was defective on arrival. After battery install (Yes, it was done correctly) there was no sign of life. No blinking green light to indicate it was working properly. Pressing the 'Test' button produced nothing but silence. Not recommended!", "Date": "October 19, 2012"}, {"Title": "No LED light", "Author": "Sparr Heights Mom", "ReviewID": "R2PTQLISA0L60P", "Overall": "1.0", "Content": "The LED light was supposed to come on green if working and red blinking for something else.  The LED light never worked.  So I didn't trust the product.", "Date": "October 12, 2012"}, {"Title": "Inconvenient", "Author": "Kermit", "ReviewID": "R3HDEQ8AT35YBN", "Overall": "4.0", "Content": "The unit seems to be sturdily built, especially when compared to other units I have possessed.  I like the fact that the mounting flange and sensor unit are separate pieces.  With my old detector the mounting flange was flimsy and had to be removed from the wall, along with the attached detector, in order to change batteries.The unit is always displayed in promotions with the sensor grill in the 6 o/c position.  I prefer to mount it with the test button in the 6 o/c position in order to facilitate reaching it above a doorway.  I would have thought I would get such a configuration with the screws inserted at the 6 o/c and 12 o/c positions in the wall.  But it doesn't work that way.  Of course, you could always rotate the unit fully clockwise until fully seated and then back it off CCW until it is positioned the way you want it.  But then it would not be very secure and may be close to coming apart.  I have found a way to position the unit so the button is at the 6 o/c position and it is also securely positioned by rotating it fully CW.  A little inconvenient, though.I get three beeps from the unit when I depress the test button, as advertised.  But a  light does not blink every minute, as referenced in the instructions.  When I mentioned this to Customer Service they didn't seem particularly concerned about it.The instructions are impossible to read.  The text is much too small. I was not able to produce suitable copies with my scanner/ printer.  Customer Service suggested I press the CTRL button on my PC while rotating the wheel on my mouse to enlarge the font.  I used another method by utilizing the Enlarge feature on the PDF file.  Then I was able to crop the individual pages by using the MS Snipping Tool on my PC and printing the result. You'd think the company could splurge a little by printing the manual on 2 or 3 pages so everyone could read it.  More inconvenienceI understand there is some confusion regarding the battery situation.  I received Duracell batteries with my detector and the same batteries were recommended in the manual.  There was no reference to Energizer batteries anywhere.  There is no periodic chirping.So I have no blinking light and no periodic chirping.  The unit just sits on the wall like a painting.  How am I to know if it will work better than a painting under emergency situations?Well, before I contacted Customer Service and before I was able to decipher the instructions, I held a charcoal lighter up to the unit (don't try this at home).  No response. I was later informed by Customer Service that this action could render the unit inoperative.  A fire and smoke detector that does recognize a flame. Hmmmm!I later placed a burning, crumpled piece of paper in a bowl and held in up to the detector (don't try this at home either).  I blew out the fire so the smoke would envelope the detector.  After about 1 minute the alarm finally activated.  But the smoke was only a few inches from the detector.  Now I'm wondering just how sensitive this thing is to smoke. So I appear to have a fire and smoke detector that does not respond to fire and marginally responds to smoke if present a few inches away.  How can I be assured that the unit will sound off should it encounter a real emergency situation?  Faith?  I'm not sure that will cut it.  Do I have to burn my house down (don't try this at home either) to conduct a valid test of the system?  Or perhaps I should just burn the detector and listen for a beep before it turns to ashes.I would like to hear more reviews of the product in action (or inaction) during actual emergency situations.  In the meantime I will not deduct rating stars for performance since I have no evidence on how it will work under real fires.  I am deducting one star, however, for the practically useless manual and for the mounting experience listed (above).", "Date": "September 20, 2013"}, {"Title": "Good design at a reasonable price", "Author": "Macman", "ReviewID": "R3LS7IQG60GJS6", "Overall": "5.0", "Content": "We have a dog that panics at the mere sound of the \"chirps\"  that smoke alarms give off when the battery is low, so the last thing that I need is a smoke alarm that goes off for no good reason. After reading a lot of reviews I finally chose this one. I needed to replace all of our 20-year-old units, so I purchased one to try out for a week. After no false alarms and seeing the intelligent construction of the unit, I purchased 3 more. After several months of use there have been no problems of any kind. A couple of things that I like: With a simple twist you can take the unit off of its base for easy battery replacement or cleaning. And the batteries themselves are in a pop-out drawer and are easy to replace. As for loudness, I don't understand the reviews which complained that they weren't loud enough. I think they're plenty loud - a very nasty, attention-getting sound and level. If I needed another smoke alarm I'd purchase another of these in a heartbeat. The only thing that I can't comment on is how well they would work in a true emergency situation. I guess you've just got to trust the manufacturer for that.", "Date": "December 7, 2012"}, {"Title": "Works great!!!", "Author": "G. Golden", "ReviewID": "R2F18NVTES9JH4", "Overall": "5.0", "Content": "I bought three of these to replace older models that had reached the end of their useful life. I like the fact that they're dual sensor alarms (one for fast flaming fires, and one for slow smoldering fires), and that they take AA batteries instead of 9volt batteries. Installation was very easy!! You mount the base and then just twist on the alarm, couldn't be easier! The batteries (included) go in a little drawer that slides out and are super easy to change, just press down from above the batteries while the drawer is open and they pop right out. There's also an easy to see diagram that show you which direction to put the new batteries in. The twist mount makes it easy to remove the alarm for cleaning (much easier than trying to stand on a ladder with a vacuum cleaner) or changing the batteries if your not comfortable changing them while its mounted to the ceiling. I haven't had a fire, but these alarms went off right away when something in my oven overflowed and started smoking, and the silence feature worked when I pushed it with a broom handle (instructions say it will silence the alarm for 15 minutes). Kept it quiet until I could get the smoke cleared out. I am very happy with these and have already recommended them to my family, friends, and neighbors.", "Date": "April 4, 2013"}, {"Title": "1st one falsed often, 2nd one seems great", "Author": "J. Wagner", "ReviewID": "RB3ZJA6XDPPQ6", "Overall": "4.0", "Content": "The first one was bad and I wrote the review below.  But they sent me a new one and it hasn't falsed once in about 2 months.  I guess it was just a defective detector.  They honored the warranty admirably, so I've changed the rating to 4 stars.Original review said:It likes to alarm in the middle of the night for no reason. Alarms don't follow any of the patterns in the manual, it just beeps for 20 seconds or so, wakes everybody up, then stops. This one's going in the dumpster.", "Date": "February 27, 2012"}, {"Title": "Highly rated - easy to install First Alert SA320CN", "Author": "LARRY REED", "ReviewID": "R133I1421X1LGP", "Overall": "4.0", "Content": "Item rated highest by consumer reports. Purchased eleven of these to install/replace old smoke alarms in various locations in my 3-level home. Amazon price was very good. Easy to install. Uses AA batteries (came with item), a plus for me. No more proprietary or 9V batteries.", "Date": "February 4, 2012"}, {"Title": "blinks a green light frequently", "Author": "Arctic lady", "ReviewID": "R34TMITE77AN9X", "Overall": "3.0", "Content": "I bought because it was highly rated and a reliable company. It was hard to get used to a blinking green light at night in the bedroom but wefinally did.  That's my only complaint.  I suppose its meant to show its working.", "Date": "August 12, 2011"}, {"Title": "Kept going off!", "Author": "J. Cornelius", "ReviewID": "R37ZPSAKB2797Z", "Overall": "2.0", "Content": "So we bought this for our house. Worked great until we had a little stove mishap (no fire, but alarm went off appropriately). However, after that the this unit just would not calm down! At random times it would go off day and night. Battery change did not help. At first we were worried maybe there was a fire issue and we were missing it - we checked - none of the other smoke/CO alarms would go off at the same time, even if we moved others into the same room. Finally when it went off at 2 AM we had enough. Time to buy a different one.", "Date": "October 18, 2012"}, {"Title": "This sensor saved my life today", "Author": "DD", "ReviewID": "RITZHGGGDAM1T", "Overall": "5.0", "Content": "My senile mother in law who lives with us was boiling something on the stove right before she went to bed - something we told her not to do. Of course, she forgot to turn it off and left it boiling all night. Around 2 pm, this alarm alerted making loud beeping sounds bc of the smoke from the empty pot that was still boiling on the stove!I have 2 kids and literally installed this like 2 weeks ago. If I hadn't, we'd all be dead or at least the young ones would have suffered from smoke inhalation.Now the device comes with duracel batteries and not enegizer ones as I saw on some of the reviews. Also, hard for someone like my mother in law to try and remove the batteries to tamper with it since she is always burning incense at home.I'm ordering 2 more today.", "Date": "January 10, 2014"}, {"Title": "Recent Purchase", "Author": "makinboots", "ReviewID": "RGEH5MHYCNWUM", "Overall": "4.0", "Content": "I recently purchased two of the SA320CN First Alert Smoke and Fire Alarms.  I was replacing my old ionization smoke alarms that had recently stopped working and decided to go with the double sensor.  I had recently watched a public safety segment on our local news for fire prevention month and made the decision to go with the double sensor.  Installation was not a problem for either of these and will continue to replace older ones. I did not give the product a five star rating as I had to purchase new batteries for one of the detectors as the ones that came with it were already dead.", "Date": "October 23, 2012"}, {"Title": "Alarm went off at random times", "Author": "T. Mayer", "ReviewID": "R37VCROIOXNWGC", "Overall": "2.0", "Content": "Like another reviewer said this alarm went off once because of something burning in the kitchen (just some chicken tenders in the toaster oven), but then after being silenced, would go of randomly hours and days later. I kept thinking there was smoke in the house and opening all the doors, but when it happened at 5am I had enough. Ended up ordering another product.", "Date": "November 18, 2012"}, {"Title": "Reasonably satisfied", "Author": "Phillip Dobbe", "ReviewID": "RLTUZMTYVMWJB", "Overall": "3.0", "Content": "Bought two of them. One worked and one didn't. Tried everything, including new batteries. CS for First Alert was closed due to holidays. Finally found out the 3-chirp every 5 minutes meant \"malfunction\", too bad that code wasn't on their info. Amazon of course was great with the return. Second time, everything is fine and feel better knowing I'm protected.", "Date": "January 11, 2013"}, {"Title": "Good product but advertised size dimensions wrong", "Author": "BigD", "ReviewID": "R15MHUSNZN3ON2", "Overall": "4.0", "Content": "Just received a bunch of these to replace another brand in my home. The actual size of the product is not what's shown on the Amazon description.  The actual size is 5 inches diameter on the dot and the height just about 2 inches.Oddly, the product page has two sets of sizes, and they're both wrong. The \"product specification\" section says Height:9.06 inches; Length:7.31 inches; Width:7.75 inches (all of these are waaaay off). In the \"product description\" it says the unit measures 5.7x5.7x2.8 inches.  Closer, but still wrong.Reason why it's a big deal to me... my previous alarms were 5.5 inches wide. When I remove them, the paint which was underneath the old base will be slightly brighter in color than the rest of the ceiling (since it was screwed on there for many years). I was happy to think the advertised larger 5.7 inches of the new alarm would cover this up so no one would see a \"ring\" of color difference. But now that I see it's really 5 inches wide a ring will be visible.  Amazon, please correct the specs!Aside from the size issue, the units came at a great price. The batteries are inserted through a small compartment door which slides open on the side of the units. It takes a tiny bit of force to pull it open but nothing excessive.  A neat little feature which is not mentioned in the product description is that it comes with little locking pins (if you choose to use them) for the battery compartment door and base mount. These prevent the door and unit from being manually opened/unscrewed without the use of a screwdriver (to depress the pins). For my one family home, I don't need to use these pins.  The instructions say these are meant as a removal deterence if the alarms are used in a public area (or any area where you don't want someone to easily unscrew the unit or swipe the batteries).", "Date": "June 29, 2012"}, {"Title": "Less then 1 year and 2 of the 5 have malfunctioned", "Author": "starchild", "ReviewID": "R2MVFBNTOEGLRT", "Overall": "1.0", "Content": "We purchased 5 of these last year, loved the idea of having a dual fire alarm in my home. It's been about 10 months since we installed them and 2 of them have already malfunctioned. Doesn't make me feel safe about the others still installed, now i will have to shell out more money to replace them all with a different brand fire alarm. DON'T BUY.", "Date": "July 9, 2013"}, {"Title": "Reduced sensitivity?  Er...noooo", "Author": "C. Clark", "ReviewID": "R3DIA2IQDKZ49J", "Overall": "3.0", "Content": "This is just as sensitive, maybe more, than the one I replaced....so I'm not real happy.  This is mounted on the ceiling near the back door in the kitchen.  It's about as far away from the oven, etc as it could be.  We cannot get gas to our home so only cook with electricity....and always use the hood fan.  Very little smoke is ever generated, yet this alarm goes off at the slightest hint.  I ordered this based on the item's description.  That description is misleading at minimum.", "Date": "July 11, 2013"}, {"Title": "safety x2", "Author": "BXC", "ReviewID": "RKYOG2UZZ9MG3", "Overall": "4.0", "Content": "it has dual sensors which is good but i had to stick a standard alarm in the hallway where i had this one because steam from the shower (you couldn't even see it) was setting it off. it's upstairs in the nursery now.", "Date": "October 17, 2012"}, {"Title": "BEEPS INTERMITTENTLY!", "Author": "Living the Life", "ReviewID": "R22HLGEQWN92XL", "Overall": "1.0", "Content": "Wished we had bothered to read the bad reviews on this thing! USELESS! Not worth the money to send it back. Beeps in the morning for several hours. Checked battery, checked battery orientation. Changed out for brand new battery. Checked EVERYTHING. Beeps intermittently for several hours and then shuts up.NEVER BUY FROM THESE GUYS! Seriously. It's a WASTE of MONEY!", "Date": "July 3, 2013"}, {"Title": "Very easy to install", "Author": "4iab2001", "ReviewID": "R16KINS6PWZA35", "Overall": "5.0", "Content": "I like that I got a trusted brand name at a good price.  The dual sensors are the only way to go.  I certainly feel safer with that feature. The installation was very easy for someone not very handy.  The battery light indicator blinks every minute.  It is inconspicuous and that led to some criticisms in other reviews.  Frankly, I like the less obtrusive nature of the indicator.", "Date": "September 6, 2013"}, {"Title": "Not sure this works the way it's supposed ti", "Author": "Adrienne Baxter", "ReviewID": "RTY0WBOV2KUUF", "Overall": "3.0", "Content": "I bought this after seeing a news story about the importance of having a dual-sensor smoke/fire detector. One night, I accidentally fell asleep after putting a frozen pizza in the oven. When I woke up 2-3 HOURS later,  the smell of smoke was very strong & burned my eyes although there was no visible smoke or fire. The pizza was charred black but this detector never went off.", "Date": "July 26, 2013"}, {"Title": "Hard to Test", "Author": "History Buff", "ReviewID": "R212ZO4FV5JO1U", "Overall": "4.0", "Content": "The test button on these alarms are very hard to push.  One alarm, in particular, took a lot of force before the test alarm would sound.  And that was while holding it.  When it is on the ceiling, one will have trouble.  I called the company and they said it was probably \"tight\".  I can only hope that it will sound the alarm in an emergency.  There was no offer to exchange the alarm.", "Date": "April 12, 2013"}, {"Title": "No Brainer", "Author": "Consumerette", "ReviewID": "RM3ZH2KTWIM7D", "Overall": "5.0", "Content": "I wasn't aware that there was such a thing as dual sensor smoke alarms until I started looking around on the internet to replace some older units I had. After some research I found the dual sensor SA320CN. I bought 7 to replace all the smoke alarms in the house. I chose First Alert because of their reputation and long history of manufacturing smoke alarms. Also because of some less than favorable reviews of competitors products. Yeah I could of bought less expensive alarms but some things you just don't skimp on. I received them in a couple days and installed them the next day. I tested them with a UL listed aerosol spray that doesn't leave a reside and is made for testing smoke alarms. They all function perfectly so far. I take the job of protecting my family seriously and if I'm aware of the latest and greatest technology, then I'm going to put it to use.", "Date": "September 7, 2012"}, {"Title": "2 out of 4 no longer work", "Author": "A. M. Black \"Andy B\"", "ReviewID": "RAUEYKQOLRA3B", "Overall": "2.0", "Content": "I bought 4 of these after watching a TV rpt about the dangers of having only one sensor type.All installed the same day using the batteries supplied. After replacing all batteries annually for 3 years without issue, two of the four have begun to create false alarms, and are useless. I have replaced batteries with freshly bought, long-dated stock - even though the \"bad\" ones showed \"good\" on my battery tester. None have been abused, dropped or painted. The instructions say \"wipe with a damp cloth -  do not vaccuum\"; and \"if the alarm continues to give false alarms it should be disposed of properly and replaced\" (paraphrasing). SO the 10 year warranty doesn't mean anything - these two have lasted less than 5 years.I'm buying a different brand now.", "Date": "November 8, 2013"}, {"Title": "It works, but!", "Author": "Stwpapa", "ReviewID": "R16BOQ3B33IRO2", "Overall": "3.0", "Content": "I'm an elderly person who can't hear very well. I can barely hear this Fire alarm when I'm awake, not at all when asleep. Not a repeat purchase.", "Date": "December 7, 2011"}, {"Title": "Nice dual-detection smoke detector", "Author": "Amazon Customer", "ReviewID": "R1KLBU2B39ZWAF", "Overall": "4.0", "Content": "I recently noticed that all 7 of the smoke detectors in my house were more than 10 years old. So I bought a 7 pack of these guys and have so far been very happy with them.They use AA batteries - NO MORE 9V!! So I can use rechargeables with them (although they came with two duracells already so I won't need to replace them for a while)Replacement of my older detectors was very simple. The plate that attaches to the ceiling is designed to fit multiple hole-widths so in almost every case all I had to do was loosen the screws from the old plate, remove and replace, and then retighten the existing screws. There was only one oddball smoke detector that was different from all the others where I needed to drill a new hole to replace it.Putting the detector into the plate is simple and can be done easily with one hand. It isn't at all hard to line it up and secure it. This is a tremendous advantage over my old detectors where you could never really tell if you were lined up properly and I would often have to fight it for a long time to get it attached correctly.The sound is nice and loud and will definitely get my attention when/if they go off. I haven't had a chance to use it, but the mute switch could be a nice feature to have if our cooking ever sets one off.", "Date": "February 14, 2014"}, {"Title": "Works", "Author": "Guntherman", "ReviewID": "RJNW1T6RAYWMS", "Overall": "4.0", "Content": "I already managed to set one off when cooking in the kitchen. I didn't have the range hood turned on when making eggs and wasn't paying attention to how smokey the room was getting, and the alarm did its job. The last smoke alarms we had were old ionization type and didn't go off at all when our crock pot malfunctioned and overheated, filling our kitchen with venison steam/smoke.Easy install, clear instructions, uses AA batteries so not as expensive as 9-volts. We'll see how long they last!", "Date": "January 8, 2014"}, {"Title": "Great smoke alarm", "Author": "C Ordini", "ReviewID": "RL86ROFIWWOIK", "Overall": "5.0", "Content": "It does NOT go off when you burn toast!!!!  The alarm has sensors in it that detect a true fire from the smoke that does come with burnt toast or lighting a candle.Thank you.", "Date": "November 15, 2013"}, {"Title": "Keep Your Home Safe", "Author": "prisrob \"pris,\"", "ReviewID": "R2RZ7MKM69V228", "Overall": "4.0", "Content": "I read many reviews before choosing this smoke detector. Almost all positives in every venue.I am a woman of a certain age who lives alone, now. I need a safe and secure system, and one that is easy to access and easy to change batteries. The battery came well packaged, easy to remove from box. A real plus is that the two AA batteries were included. I try to keep a supply of batteries, but I do run out at times. This particular smoke and fire alarm is a dual sensor, meaning it can detect smoke/fire in two different methods, which gives me a greater level of security. A fire/smoke detector unit like this are a big plus in establishing trust and a feeling of security. I like the fact that it uses AA batteries and is very easy to install. My smoke/fire alarm was old, still worked, but I did not trust it.  The newer models are much more efficient than older ones.I was able to install this high on my wall near the ceiling and used Monkey Glue as suggested by the first reviewer here on Amazon. You do not need to take the entire alarm down to change the batteries, another big deal for me. I was not aware that I needed an alarm for every level of my home, so have ordered more.Recommended.  prisrob 11-01-13", "Date": "November 1, 2013"}, {"Title": "Easy to install ... easy to replace batteries", "Author": "TulipFever \"Jan\"", "ReviewID": "R1P8OXKDZ7KL9A", "Overall": "5.0", "Content": "I really like the way the unit can be taken down quickly by unscrewing it from the mount.  I haven't had any problems with the batteries.", "Date": "October 13, 2013"}, {"Title": "Easy and works great", "Author": "michelle ethridge", "ReviewID": "R8XNJLUM6TRC2", "Overall": "5.0", "Content": "Bought this as a replacement for an old alarm.  This one was easy to install.  Weekly tests are a breeze.  Recommend to anyone.", "Date": "September 8, 2013"}, {"Title": "Very Audible - Easy to Install", "Author": "Technomed", "ReviewID": "R24HZ829VQHOSB", "Overall": "5.0", "Content": "I used this to replace 5 units by other manufacturers. The dual-sensing feature is a must. Best of all is the clever \"universal\" mounting-hole arrangement. This lets me easily fit the alarm unit onto a variety of differently configured electrical utility boxes. And the alarm beep can be heard many rooms away.", "Date": "August 18, 2013"}, {"Title": "Less false alarms", "Author": "Matt M.", "ReviewID": "R1G3H2B6PIXHDW", "Overall": "5.0", "Content": "Replaced a unit near the kitchen that would go off from cooking constantly. I did a side by side test and this one passed the bacon test when the other failed!", "Date": "August 10, 2013"}, {"Title": "bad buy", "Author": "Wugi", "ReviewID": "R15K3MGJ405HRM", "Overall": "2.0", "Content": "Batteries last about one month.  I have tried every battery manufacture there is...same result.  I have noticed the other reviews and other people are having the same problem.  It's going to the trash can.", "Date": "August 1, 2013"}, {"Title": "Defective alarm on first try", "Author": "Yet another tech guy", "ReviewID": "R3DIN9PTYYQPEE", "Overall": "3.0", "Content": "While I'd seen some of the defective unit reviews, I went ahead and ordered, as this is one of the few battery powered dual sensor models.  After a day and around noon for three days after, I got the dreaded \"three chirps.\"  I called First Alert support and they identified this as the malfunction signal and said to return it to Amazon.  I'll update when I get a replacement.*** Update *** The new alarm arrived and has been fine. Points to Amazon for quick service, not so much for First Alert. Bumping to three stars.", "Date": "July 17, 2013"}, {"Title": "So far so good; minus one star for one false alarm.", "Author": "Mathieu J. Champagne", "ReviewID": "R3LKTRIRCD7KX", "Overall": "4.0", "Content": "A few months ago the neighboring apartment was lit on fire by a crazy ex-tenant and my girlfriend and I woke up at 4am to the smell of smoke and a faint beeping in the distance.  Our entire hardwired smoke alarm had failed, but thanks to my light sleeping girlfriend we were able to make it out right before the firemen arrived to put the blaze out.  We lost quite a lot of our furniture and electronics in the basement to smoke damage.  Before replacing anything, I decided to purchase our own battery operated smoke detector.After some quick research I decided to go with this model, mainly because it has the double sensor...I'll risk a false alarm in order to better be prepared if any fires ever break out again.  I was hesitant at first since so many people mentioned this alarm going off at random times.  I can say that in the few months I have owned this smoke alarm it has had only 1 false alarm.  I decided to deduct a star for this, and I hope it does not happen again.  I can still recommend this product, and hopefully I never have to hear it again.", "Date": "July 8, 2013"}, {"Title": "Blinking light doesn't work-", "Author": "Amazon Lady", "ReviewID": "R3R2Y03NSR83AN", "Overall": "2.0", "Content": "I just received it, and put it up.  I tested it, and the alarm does sound, but the red light is supposed to flash once per minute-  I guess it's not working, because it's not flashing.  The flashing light is important, because it let's you know that it's working properly.  It came with Duracell batteries, that say Dec. 2022.  So, it should work, but it doesn't.Amazon is sending me a new one, and I will update my review then.I am also going to call First Alert myself- to let them know about the problem- Quality Control?", "Date": "May 25, 2013"}, {"Title": "First Alert Fire and Smoke Alarm", "Author": "Edna Ferber \"Pat\"", "ReviewID": "R2PKR9WPQGH6JE", "Overall": "4.0", "Content": "I put 4 of them throughout  the house- bottom of basement stairs, kitchen, front foyer at bottom of stairs, upstairs hallway near bedrms.  All tested fine.  The alarms are REALLY LOUD.  That's a good thing!  I would recommend to anyone.", "Date": "April 27, 2013"}, {"Title": "It's really quick and WORKS!", "Author": "DMT", "ReviewID": "R1FB02GIXUAYM2", "Overall": "5.0", "Content": "Never had the occasion to see if smoke detectors work but my element went on my coffee pot and when the alarm went off (LOUD) I ran to the kitchen and just a small amount of smoke was coming out the back of my coffee maker. I unplugged the coffee pot and took outside. So glad the smoke detector rang out because I wasn't in the kitchen. Take it from me it really works!", "Date": "April 21, 2013"}, {"Title": "3 of 4 worked out of the box", "Author": "Gem Stone-Logan", "ReviewID": "R3S532BKSE5135", "Overall": "3.0", "Content": "I bought 4 of these smoke detectors to put in our bedrooms.  They came yesterday with batteries and 3 seemed to work fine.  However, as soon as I put the batteries in the 4th, it started chirping 3 chips approximately every 2 minutes.  I double checked the batteries were in properly and the door was secured.  I also switched the batteries with one of the other smoke detectors that wasn't having problems.  Nothing worked.  The working smoke detectors had no problems with the batteries that came with the malfunctioning one.  I've requested a replacement from Amazon with the hope that the next one works properly.As an aside, the battery compartment says to only use Energizer batteries.  However, the batteries that come with the product are Duracell brand.", "Date": "February 5, 2013"}, {"Title": "Excellent Smoke Alarms", "Author": "Elizabeth M Spindle", "ReviewID": "R3DSHVVDY0B64G", "Overall": "5.0", "Content": "I found these very easy to install and the price was great.I know they work very well because one went off the dayafter I installed it, A candle dripped into a waste basket andand the smoke in the room set off the alarm right away evenbefore I knew there was a problem..", "Date": "January 4, 2013"}, {"Title": "Good Customer Service", "Author": "T. M. Smith", "ReviewID": "R33UDB6V6EC2MC", "Overall": "4.0", "Content": "Well, I would rate this product and the follow-up service required in my case 5 stars, but that said that I love it, and there's not much I really love, but this product and the company I do like. A lot.The first unit I received did not work, so I called First Alert, did the spot-checks to the unit that was recommended, and then was promptly sent a replacement when those tests didn't work. The replacement unit is now working as expected, even after having tested its sensitivity with a wood-burning fire about 15 feet away from the unit. Its little green light is flashing every minute to show that it's working to secure my residence from smoke and fire. (So, maybe I actually could come to love it after all.)..just my $0.02 worth. Your mileage may vary.  ~~@v@~~", "Date": "January 2, 2013"}, {"Title": "a photo and ion smoke detector.", "Author": "jwa", "ReviewID": "R15M65EBVEAHV4", "Overall": "4.0", "Content": "the product has both the photo and ion dector- the best como avsilable. If the product were interconected where if one alarm were activated the other(s) would also activate then the product would be perfect.", "Date": "December 22, 2012"}, {"Title": "Looks good", "Author": "Sujit Kumar Mahapatra \"Sujit\"", "ReviewID": "R14FQY8BVSD4D9", "Overall": "3.0", "Content": "I received this yesterday. The test alarm works fine and produces enough sound to alert. The look of this is not bad either. I though if they could provide a blinking light, that would have helps us assure that it is working. Otherwise hard to tell if it is really working or not.", "Date": "November 7, 2012"}, {"Title": "Buy Something Else", "Author": "L. Zipeto", "ReviewID": "R2888Z71ZH8LR5", "Overall": "1.0", "Content": "Unfortunately, this Mexican-made junk lasted only 2 months. Considering the price, one would think it would lastlonger than, say, the $7 models. What a disappointment.", "Date": "January 4, 2013"}, {"Title": "They look to be high quality.", "Author": "Bad Grandpa", "ReviewID": "R1U0EWMB44ETJD", "Overall": "4.0", "Content": "It is impossible to rate a fire/smoke alarm accurately unless you are unfortunate enough to have your house catch fire. That said this product looks to be well designed and they are very easy to set up and mount. I did a lot of research before I bought them and the pros all said they worked very well. I hope I never find out. They were shipped quickly and without any problems.", "Date": "October 17, 2011"}, {"Title": "2nd one works", "Author": "Dan", "ReviewID": "R3M6KVGD2Y5WK6", "Overall": "4.0", "Content": "First one was chirping the low battery warning almost right away. I tried new batteries and those didn't help. So I contacted Amazon and they sent me a replacement right away. I just installed it and haven't heard and low battery noises yet. I'll see how long these last. I give 4 starts because the first one was bad and that tells me their quality control is slipping.", "Date": "May 14, 2014"}, {"Title": "easy to install and operate", "Author": "C. Winkler \"Free Spirit\"", "ReviewID": "R2XQ2R38FY3HTE", "Overall": "5.0", "Content": "Had 2 units installed in less than 10 minutes (including getting out the drill and other tools). Didn't have to use the supplied anchors since they were mounting on a wood headliner on my boat. Like the fact that they use AA batteries. Looks like the batteries will be very easy to change. Also like the flashing light to indicate the unit is working. Hopefully I won't find out how well the sensors work :)", "Date": "May 6, 2014"}, {"Title": "Just enough", "Author": "Tina F.", "ReviewID": "R24WGYTV0A8FH4", "Overall": "5.0", "Content": "I bought two - one for each critical doorway.  The kitchen has the stove, and the family room has the fireplace.  Already had to reset the one in the kitchen.  The sensitivity in both units is just enough.", "Date": "May 5, 2014"}, {"Title": "POS - It stopped working after a few months.", "Author": "Yos", "ReviewID": "R1MLY08V93KG65", "Overall": "1.0", "Content": "It looks nice, but stopped working after a few months.When it worked, did it do its job?-  I don know.", "Date": "April 24, 2014"}, {"Title": "Good choice on a smoke detector", "Author": "Terrell W. Stephens", "ReviewID": "R3SLQ9RK0H1YN3", "Overall": "5.0", "Content": "After a conversation with a friend in the firefighting business, I decided to replace all of the units in my house and add a couple as well.  He recommended these.  So far they work as expected.  My inadvertently tested one of the units while cooking.", "Date": "April 14, 2014"}, {"Title": "Got one dud...make sure to check it!", "Author": "pcpeggs", "ReviewID": "RIGPNKBPST2HV", "Overall": "2.0", "Content": "Bought 2 of these...one of them did not function.  The alarm (beeping part) was broken.  Make sure to check before installing.", "Date": "April 7, 2014"}, {"Title": "Product was defective", "Author": "Robert Harkness", "ReviewID": "RY4MYR7UZ6W31", "Overall": "1.0", "Content": "Ordered 2, one was OK, other was defective (could barely hear alarm).  Would have returned but not able to install until after return date so did not know it was defective until it was too late.", "Date": "March 25, 2014"}, {"Title": "no false alarms when cooking", "Author": "grndamgt4", "ReviewID": "R1JW6TGD5X2B9H", "Overall": "5.0", "Content": "I have a cathedral ceiling and my existing smoke alarms are hard wired together so every few times I cook ( and I cook a lot ) the smoke collects in the top of ceiling and it sounds like fire engines are driving from room to room terrorizing my poor dogs. Toast, blackened chicken, browning pork loin, cajun red potatoes, even making pizza all set off my existing smoke detector.I purchased the SA320CN at target for $19 which was the only local store that had it in stock.I went home, installed it, put on a pot of oil and left it till smoke was filling the kitchen, then threw in 4 small pieces of steak from last nights dinner, the entire room filled with smoke in a few seconds. Not one alarm went off and I was happy.However, my lady now wants me to take it down and test it with actual fire this weekend to be sure it works.If I have any problems I'll update this review.p.s. I plan to try out a second one in the garage/shop as the same thing happens when I'm doing a lot of sanding.", "Date": "February 5, 2014"}, {"Title": "Substantially improved over earlier models", "Author": "C. Winton \"cwinton\"", "ReviewID": "RGS3D2MHYWYJX", "Overall": "5.0", "Content": "I have 4 dual sensor smoke alarms distributed at strategic locations around my house, all of which I replaced with these.  The ones I had were from First Alert and GE, all of them over 20 years old.  Well, one died so a replacement was needed.  After installing one of these, I decided to replace all 4 with this model, simply because installation and maintenance is so much easier than it used to be.  There is now only a single button for testing, the unit uses 2 AA cells instead of 9 Volt, the batteries fit into a slide out tray, and the button will silence a false alarm.  Moreover, the mounting bracket makes putting the unit up and taking it down simplicity itself, a huge improvement over my old units.  This unit deserves a 5-start rating for all of these reasons.", "Date": "February 4, 2014"}, {"Title": "Easy to install, double sensor brings peace of mind", "Author": "foofurrah", "ReviewID": "R9MVWG3LWKN3Q", "Overall": "5.0", "Content": "I settled on these alarms after a long search through the confusing world of smoke alarms and carbon monoxide detectors. I really liked the idea of having interconnected alarms, and the new \"Onelink\" system is pretty nifty. However, smoke alarms have a 10 year lifetime max and carbon monoxide detectors last 7 years max, and First Alert doesn't appear to make a double sensor alarm with onelink (someone correct me if I'm wrong). First Alert does make a dual photoelectric smoke and carbon monoxide detector with onelink that sells for $55 for a two pack. However, I just couldn't stomach paying $55 for something I'm going to have to replace in 7 years, and that doesn't include an ionization detector. So, for now I settled on purchasing these alarms along with separate plug-in carbon monoxide detectors (I like the Kidde's that plug in with battery backup), none of which interconnects, but which cost me $28 each for the smoke alarms which are good for 10 years each, and $25 each for the carbon monoxide detectors (there are cheaper battery-only options available) which are good for 7 years each, and am now set for the forseeable future. I'm hoping there will continue to be innovation in this field that will make devices more interconnected and less expensive before my next upgrade, so there will be fewer either/or choices to make.On this smoke alarm, it looks great, was very easy to install, and comes with clear directions and batteries. The mounting bracket includes a number of different screw slot positions, so there's an excellent chance you can fit it onto the old screws if you're replacing a different smoke alarm. Otherwise screws and drywall anchors are included. Can't comment on the battery life or false alarms yet, but I'm very satisfied and happy to know that I have both sensor types working for me. If i had to make one complaint, it would be that the plastic packaging of the alarm is kind of a pain to open, Amazon should look into adding this product to their \"frustration free\" packaging program.", "Date": "January 22, 2014"}, {"Title": "Works well", "Author": "Kiem Trong Nguyen", "ReviewID": "R3B0WO81SDN3XD", "Overall": "5.0", "Content": "After using several months, I confirm it works very well. I already convince some friends and relatives to buy it.", "Date": "January 21, 2014"}, {"Title": "Very nice & cost effective!", "Author": "TEAMreconTX", "ReviewID": "R2TR3KP0HUZV64", "Overall": "5.0", "Content": "One of the most well built smoke alarms I have ever seen & it uses AA batteries. Nice, very nice", "Date": "January 21, 2014"}, {"Title": "i love it", "Author": "Mirella", "ReviewID": "R298XENYOEPJQO", "Overall": "5.0", "Content": "I bought this Double Sensor Battery-Powered Smoke and Fire Alarm because of the price and I love it...It's easy to place in Dining Room or any room in the house. it works perfectly.", "Date": "January 21, 2014"}, {"Title": "No more false alarms", "Author": "Lance C.", "ReviewID": "R1A8XX3LHR8IA3", "Overall": "5.0", "Content": "Installed outside our kitchen, replacing the old alarm that would go off whenever we opened the oven door. This alarm is much better and doesn't false alarm.", "Date": "January 12, 2014"}, {"Title": "Good Idea", "Author": "Dale the builder", "ReviewID": "R1SWOVBOXE7KKT", "Overall": "5.0", "Content": "I needed to upgrade my main floor smoke alarm and found this one. Using two different types of smoke sensors makes sense to me. why not do the best possible detection?  And batteries come with it!", "Date": "January 9, 2014"}, {"Title": "Excellent protection and good price", "Author": "Joe C.", "ReviewID": "R2J9B6W2NYYZW3", "Overall": "5.0", "Content": "Double sensor for both types of fire/smoke alarms. Too bad no one makes a triple alarm, with Co2, it will sell out in minutes when technology catches up. Until then, this is a great buy.", "Date": "January 9, 2014"}, {"Title": "Good smoke alarm", "Author": "puppet master", "ReviewID": "R3DQMA9CSKPO7G", "Overall": "5.0", "Content": "I never knew before ordering these first alerts that you needed to have a double sensor for different types of fires, I figured an alarm is an alarm. But glad I know now. Easy install and easy to check the batteries are still working.", "Date": "January 7, 2014"}, {"Title": "10-yr batteries", "Author": "kevnye", "ReviewID": "R22CFGG7NEXOPT", "Overall": "4.0", "Content": "I appreciate that the \"batteries included\" have a 10 year rated life; the same as the alarm itself.  The product description does not mention that.  Hopefully that means I won't need to replace the batteries until I also need to replace the alarm.", "Date": "January 1, 2014"}, {"Title": "Not loud enough", "Author": "trout slayer", "ReviewID": "R3GHY84XRUD691", "Overall": "2.0", "Content": "Purchase one a few days ago before ChristmasWould of like it if it was a tad bit louder. Instead i`ll have to buy 3-4 more to make it even safe in My houseI should of went to home depot to test them and hear them than have to buy online.", "Date": "December 19, 2013"}, {"Title": "Just ordered 6 more! Peace of mind!", "Author": "Erica Dorsey", "ReviewID": "R38DWJ91D4ACHT", "Overall": "5.0", "Content": "Just oredred six more. They test out just fine and have simple installation. I have never had a false alarm but then again I have never had an alarm at all. Hope it stays that way and I never need them but I feel confident that they will save our lives in the event we do!", "Date": "November 13, 2013"}, {"Title": "Basic - good price", "Author": "TZS", "ReviewID": "R3LZG4BIF87G1P", "Overall": "4.0", "Content": "Replace 10 year old units with this little gem - works great and has less false alarms from cooking - when located near kitchen.", "Date": "October 29, 2013"}, {"Title": "Definitely Senses Smoke", "Author": "Mushuk", "ReviewID": "RUR6PR1D22N2Z", "Overall": "4.0", "Content": "This smoke/fire alarm has been quite effective so far. It goes off every time my husband takes one of his legendary hot showers. :) Hopefully we'll never require it's services.", "Date": "October 17, 2013"}, {"Title": "Tricked by steam", "Author": "Zachary Cardoza", "ReviewID": "RIJ3O5UBDMC01", "Overall": "3.0", "Content": "I placed one in the hall opposite a bathroom and the alarm goes off every time someone steps out of the bathroom after a shower.", "Date": "October 11, 2013"}, {"Title": "Fire Alarm", "Author": "Kimberly J. Reed \"Kim\"", "ReviewID": "R2W14B9DTA8T27", "Overall": "5.0", "Content": "My husband purchased it...and he usually researches products with a fine tooth comb. It is installed and works great. Arrived quickly.", "Date": "August 29, 2013"}, {"Title": "First Alert SA320CN Double Sensor Battery-Powered Smoke and Fire Alarm", "Author": "E. Colaluca", "ReviewID": "RXDL3PE0XUN63", "Overall": "5.0", "Content": "The First Alert SA320CN Double Sensor Smoke and Fire Alarm arrived it was easy to put up. I have co combo smoke alarms in all the bedrooms so I wanted to have a Double Sensor Smoke and Fire Alarm  to cover me for both types of fires also", "Date": "August 22, 2013"}, {"Title": "Easy to Install!", "Author": "B. Honeycutt", "ReviewID": "R3QQXKTLLXFR2Q", "Overall": "5.0", "Content": "I just feel safer having fires in my fireplaces that should something happen my family would be warned.  I have others but this cover s both fire and smoke.", "Date": "August 21, 2013"}, {"Title": "Uses AA batteries; found it hard to spot the blinking LED", "Author": "The Engineer Critic", "ReviewID": "R1E4WNY6EHCC49", "Overall": "4.0", "Content": "Pro's:*  Has dual sensor (ionization & photoelectric) for detecting either flaming or smoldering fires.*  Uses 2 AA batteries (this is a \"pro\" because they're a little cheaper than 9V), but I don't know if battery life is affected.*  Easily detaches from ceiling for battery replacement.Con's:*  Protrudes from the ceiling further than some older models (about 2.1\").*  I found the periodically blinking LED (to tell that the battery is charged) more difficult to spot on this model; look for a very quick green blink every 45 seconds.", "Date": "August 9, 2013"}, {"Title": "Can save your life", "Author": "Stephen M. Charme", "ReviewID": "R161F7J5OWAFWZ", "Overall": "5.0", "Content": "I bought this for my son and daughter to use in their apartments. So far these units are working fine. I specifically bought double sensor because I have read too many tragic stories where someone had smoke detectors, but they didn't go off because the smoke from the type of fire (slow burning versus fast burning) didn't trigger the type of smoke detector that was installed. You can read about this yourself, but the bottom line is that having a smoke detector that is both photoelectric and ionization can save your life.I bought one for each bedroom, the living room and hallway. This is not the time to skimp.Since these do not have a carbon monoxide detector built in, I also bought the Kidde Nighthawk carbon monoxide detector. I have used those for years in my own house to supplement the professionally installed detectors I have from ADT.Bottom line: Double sensor is important, and First Alert has proved reliable for me. Make sure you also buy a carbon monoxide detector and fire extinguisher.", "Date": "July 19, 2013"}, {"Title": "much better than other detectors", "Author": "PC Mountain", "ReviewID": "R1PQCSNZP95E4O", "Overall": "5.0", "Content": "I replaced my old ionization type smoke detectors with this one and it works much better. The ionization type detectors wouldn't go off even with a cloud of smoke around it. They only worked with a lit match placed underneath. This one works either way and I feel a lot safer now.", "Date": "May 31, 2013"}, {"Title": "Double Sensors is the only way to go", "Author": "R. Holden \"ancientprof\"", "ReviewID": "R13SIMKDCX68DS", "Overall": "4.0", "Content": "We have aded these smoke/fire alarms after recent news story about double sensor smoke detectors being far better than just single sensor types.", "Date": "May 29, 2013"}, {"Title": "Reasonably priced quality item", "Author": "Keith Wernimont", "ReviewID": "RD020DAGXF7EB", "Overall": "5.0", "Content": "After purchasing a new home with outdated smoke alarms, I found these on Amazon with quality reviews and an excellent price. I have installed 4 of these throughout my home and feel confident in their ability to work as intended.", "Date": "May 5, 2013"}, {"Title": "good", "Author": "Jamie", "ReviewID": "R13O3SHUD0XR0O", "Overall": "5.0", "Content": "These detect two ways which is nice.  I actually called the company to find out there recommendations for a house that does not have the smoke detectors hard wired in and this was one they recommended.", "Date": "May 3, 2013"}, {"Title": "Seems good", "Author": "justME \"2\"", "ReviewID": "R36M9K12YKU1SF", "Overall": "4.0", "Content": "They seem to do a good job. Does what it says on the Box. I like it takes AA's !!", "Date": "April 29, 2013"}, {"Title": "Met my needs", "Author": "Roberta Allen", "ReviewID": "ROADEPTS6X9DA", "Overall": "5.0", "Content": "I wanted to update our fire alarms with new double sensors. These were easy to install and meet our needs.", "Date": "April 25, 2013"}, {"Title": "So far so good!", "Author": "AvidReader \"AvidReader\"", "ReviewID": "R3AJAIQIPEFLYZ", "Overall": "5.0", "Content": "So far we are happy with this detector. Our old alarms that went off every time we turned on the oven or cooked a hot dog didn't go off when we had an actual fire (smoldering), which is why we replaced them with this one (or photoelectric only in other rooms) after talking with the local fire inspector.  So far no false alarms.  I hope we never have to test whether it goes off for a real fire again.", "Date": "March 12, 2013"}, {"Title": "I am Comfortable", "Author": "Ernest A. Burleson", "ReviewID": "R3SH1NTF9TDOI3", "Overall": "5.0", "Content": "I replaced a First Alert single action smoke detector with this dual action. I felt lucky that this one fit the same holes in ceiling.I tested it outside before installing and was very pleased.", "Date": "February 16, 2013"}, {"Title": "Love it...", "Author": "Martin H. Beringer", "ReviewID": "R1KJ3N21IT2B3Y", "Overall": "5.0", "Content": "Have installed this several moths ago and have not gotten any false alarms on it. Every other detector kept giving me false alarms. Great product.", "Date": "January 19, 2013"}, {"Title": "Replacement", "Author": "Timothy J Rahman", "ReviewID": "R3P4BG2X3ETK4T", "Overall": "5.0", "Content": "Installed easily. Replacement for smoke sensors that were over ten years old.Won't know if it works until I get another smoky fire.", "Date": "January 4, 2013"}, {"Title": "Inexpensive and it works.", "Author": "Fred B. Holbert", "ReviewID": "R2L5VCUME0N37V", "Overall": "5.0", "Content": "Easily installed with understandable instructions for mounting locations. Purchased two -- will consider installing more units for more comprehensive coverage.", "Date": "December 31, 2012"}, {"Title": "Everything needed for smoke and fire detection.", "Author": "Larry", "ReviewID": "R2T7UAABKPV863", "Overall": "5.0", "Content": "I wanted smoke detectors that used both ionization and photoelectric for the best warning of fires.  This item is easy to mount and replace batteries without taking the detector down.", "Date": "December 29, 2012"}, {"Title": "straight forward", "Author": "WJD \"BD\"", "ReviewID": "R3Q759CQ9PKUOP", "Overall": "3.0", "Content": "seems to be working well so far. easy to install the proof will be how long it lasts before you get a false alarm a issue i have had in the past", "Date": "December 28, 2012"}, {"Title": "good deal", "Author": "Richard Calvanese", "ReviewID": "R34XJH189UWTO6", "Overall": "4.0", "Content": "first aleart sa320cn double sensor smoke and fire alarm.the main reasons for purchasing this item was price and quality.", "Date": "December 19, 2012"}, {"Title": "No more 9V batteries!  Very sensitive!", "Author": "Matt Upton", "ReviewID": "R21IAEVU8B8WWK", "Overall": "5.0", "Content": "We are very diligent about changing batteries in our smoke detectors, but we almost always has to make a seperate trip to the hardware store to buy 9V batteries because nothing else uses that battery size anymore.  We buy AA batteries in bulk at our wholesale club so those we always have around so we find this better.  The change process is easy and fast.  We have 5 of these installed around our house now.  The performance of the alarm is more than any other units we have.  The kitchen unit does alarm very quickly if I start to burn anything on the stove or toaster.  Those extra seconds/minutes will be priceless if we ever have a real fire in the house.", "Date": "December 7, 2012"}, {"Title": "Seems to do what it was advertized to do.", "Author": "Ken Deking \"dekss418\"", "ReviewID": "RWNSOYZGJOPVE", "Overall": "4.0", "Content": "After watching a demonstration of a similar smoke and fire alarm that sold for 15 times the price of this unit and being convinced we needed the dual sense type, I bought one of these to test it out. I'm impressed that it's every bit as good as that overpriced one.", "Date": "December 1, 2012"}, {"Title": "Excellent smoke detector.", "Author": "Thule1", "ReviewID": "RBCU3O6ENIWI5", "Overall": "5.0", "Content": "Fire departments strongly recommend the dual-sensor type of detector.  I have both types in my home, but this is the first with both sensors in the same package. Detectors need to be replaced at least every 10 years. I had one that was 20 years old and still worked, but these devices are inexpensive so I now replace all of them as they age. You can't totally prevent ignition sources but getting an early warning cn help prevent needless loss. I will use this type from now on.", "Date": "September 26, 2012"}, {"Title": "Easy to install", "Author": "Peter D. Walchli \"MKEgaffer\"", "ReviewID": "R39633BPPZAZBS", "Overall": "5.0", "Content": "I bought three of these (one for each level of our house). It took all of twenty minutes to install all of them. That being said, the two main reasons that I purchased these were the excellent specs/reviews that the detectors received and the price is fairly low for what you get.", "Date": "September 9, 2012"}, {"Title": "AA  Batteries Included", "Author": "Gary A. Brinkerhoff \"Gary A Brinkerhoff\"", "ReviewID": "R3TGSA2BBXUYNG", "Overall": "5.0", "Content": "First Alert SA320CN Double Sensor Battery-Powered Smoke and Fire Alarm  Product arrived on time. I followed instructions to to put on wall which i chose to install near kitchen and it works beautifully. A small sized screwdriver is all that's needed to install. To test alarm, make sure you press button all the way in or you will think it's not working,,, It does work...", "Date": "September 1, 2012"}, {"Title": "Best of the dual mode smoke/fire alarms", "Author": "MartinJ", "ReviewID": "RR5CK5HWVVV1O", "Overall": "5.0", "Content": "Wanted this dual sensor alarm for my condo. Kiddie, the only other mainstream unit with dual sensors uses a 9 volt battery,(which are expensive), whereas this First Alert uses 2 'AA's'.  No trouble installing it where my old one was. It looks good and tests out fine. I feel good about this unit. I couldn't find it locally and Amazon had a good price and delivered it as promised. I never had a house fire, but feel this unit would offer the best protection available.  It also has all the features it should, and should give you a full 10 years of reliable operation. The alarm is plenty loud, it has a handy test button an led that blinks periodically to tell you the batteries are good and a super easy slide out battery compartment. All smoke detectors recommend replacement after 10 years. This is the way to go!", "Date": "August 14, 2012"}, {"Title": "Good Smoke Detector", "Author": "Nicholas J. Naylor", "ReviewID": "R138Y0XA9HGXET", "Overall": "4.0", "Content": "If you're looking for a low profile smoke alarm, look elsewhere.  This is a fairly bulky unit, but still looks ok.  I'm surprised it runs on 2AA's instead of a 9V.  I've only had it a couple months, so I can't say anything on battery life.  I would recommend this smoke alarm.", "Date": "July 10, 2012"}, {"Title": "Finally a smoke/fire detector happy with something besides a 9 volt battery", "Author": "D. Talbot", "ReviewID": "R3F4UCVP5AZA88", "Overall": "4.0", "Content": "Bought this for my dad to replace a unit having a 9 volt battery. Those batteries are becoming dinosaurs. This uniit uses good old AA batteries.", "Date": "April 2, 2012"}, {"Title": "safety first", "Author": "ted t", "ReviewID": "RIF2N2967E6QM", "Overall": "4.0", "Content": "I replaced 3 old First alert smoke detectors with these since they were 10 years old.  I like the fact that they are double sensor units for added safety. I also like the fact that they use AA batteries compared to the 9 volt used in the older units.  Battery drawer pulls out but can't say if it's any easier to replace the batteries.  However, the unit does unscrew from the base so it can be removed & batteries changed from the ground instead of standing on a ladder.( hope I never need to find out how they work but have confidence in the First Alert brand)", "Date": "February 11, 2012"}, {"Title": "Good Product", "Author": "BenSnookered", "ReviewID": "RAR671A76JPQP", "Overall": "4.0", "Content": "I really do not know how well this first alert alarm will work. This is a product I hope I never have to use. I wanted  one that had both ionization and photoelectric smoke sensors.It uses AA batteries rather than the 9 volt which I considered a plus.The price was very competitive compared to those I looked at in the big box stores.", "Date": "August 24, 2013"}, {"Title": "In two years I've got through three of these.", "Author": "Electrice", "ReviewID": "R2C6OG9II9NX13", "Overall": "2.0", "Content": "When my wife and I purchased our house this was the fire alarm next to the master bedroom. With in six months it started chirping and going off randomly in the middle of the night even after replacing the batteries with Energizers.(don't ask) We figure the alarm was old so bought a new one.  Ten months later the same problem. So checked several review sites, and thought perhaps we just got a defective one because many sites were saying this was the best. So we decided we would give them one more chance. It's been just under a year, but last night 3 AM... Why do they always seem to break in the middle of the night?  Anyhow, I think we're done with First Alert, and am going to give Kidde a try.", "Date": "June 7, 2013"}, {"Title": "rractical testing results", "Author": "David S. James \"Always remember you are uniqu...", "ReviewID": "R387RH87HR66Y6", "Overall": "5.0", "Content": "REASON FOR BUYING: I used to leave my PC turn on whole night. Since it is not designed to work 24 hours nobody know what may happen while I am sleeping. I treat my life more than 20 USD, that's why I decided to buy this fire alarm.EXTERIOR: When you open a box you will definitely notice that product is done from high quality materials. I am absolutely sure nobody wants to trust their life to some cheap Chinese copy that why I paid attention how good small parts are done and well fitted.SENSITIVITY: In the instruction it was strongly recommended not to test it with real fire or smoke but I am not that kind of person who will fallow all stupid instruction. How can I trust device which I personally did not test in real life? :D So I installed the alarm and set peace of paper on fire...1) I was expecting that photo element will notice the flames and start alarm but nothing happened during 30 seconds. The fire was located just 30-40 centimeters away from alarm. The first idea which came to my mind: wtf, does it need half of my root to be on fire for activating alarm? That's not what I was expecting...2) Then I tried to place flaming paper in that way, so the smoke will hit the alarm and in 5 sec I headed long-awaited sound of alarm :)Right now I have a doubt: may be the photo element require dark room to detect flames? Once I will have some more free time, I will defiantly make this kind of test and update my review. Right now as a conclusion - the device have good sensitivity for smoke detection but very bad for flame.SOUND LEVEL: The sound is very loud. You can easily get become deaf if you will stay one meter away from this alarm for a long time.INSTALLATION: The installation of alarm is easy. Instead of using screws I personally used double sided sticky tape, which glued to the wall tightly (later when I decided to move alarm a bit higher, I cannot unmount holder from the wall)FALSE ALARM: It is not much time since I installed it, so I can say nothing about amount of false alarms (I do not have any) but it was written that you can easily fix that by cleaning it with regular vacuum cleaner (once per month).", "Date": "September 12, 2012"}, {"Title": "Not a valid replacement for the sa302", "Author": "boter_99 \"boter_99\"", "ReviewID": "R31EXFGDW6O4YJ", "Overall": "1.0", "Content": "When I bought my house 7 years ago, I smoke detectored every bedroom with the sa302cn models. The Ir remote trigger allowed for easy testing on my high ceilings, and the loud clear alarm never failed to awake (as in the winter occasionally a high setting on our humidifier would trigger a false alarm).Having a recent unit failure I picked up two of these sa320's when informed they were the newer version of the 302. Out of the box I new something was wrong when upon inserting the batteries the alarm that sounded was meek and static filled, more of a \"um excuse me?\" rather than \"HEY FIRE!\". Thinking it was a faulty unit I opened the other package to find the same result. Comparing batch numbers I saw they had completely different expiration dates.  Then I tried mounting it on the old already installed brackets - no luck. Perhaps the screw holes would match? no. Off by just enough that I had to re-drill, anchor and screw in the new mounting bracket. It was only then - much to my dismay - that I noticed there was no IR test function.Over all a poor cheap substitute that has me looking for a new brand of smoke alarm.", "Date": "November 3, 2013"}, {"Title": "Not recomended.see below", "Author": "ted", "ReviewID": "R33ODQD70TZAIW", "Overall": "1.0", "Content": "Put up 2 weeks on ceiling .Had fire in microwave oven.S D was 6 ft from smoke and fire. Never went off.Tested 3 days before.I was20 feet past the s d .I smelled and light haze I could see. Put out fire. Called 1st alert sent another one.Sent back bad unit.Push the button and blow smoke in unit it works.We,ll see how it works.??????", "Date": "August 26, 2013"}, {"Title": "Bought it for a feature its instruction book never mentions!", "Author": "L. Kelly", "ReviewID": "RJ1F2Z3HTPBT5", "Overall": "1.0", "Content": "NAMELY:\"Remote Mute and Easy Battery Access for Safety and ConvenienceTo mute unnecessary alarms instantly, you can simply point almost any household remote control at the detector and click mute--whether the remote is for your TV, stereo, DVD player, or another appliance. The convenience of this feature means that something as simple as burnt toast never tempts you to take the battery out of your smoke detector and create an unsafe situation in your home. The mute button can also be used to test the alarm function, helping you ensure that your home and family are always protected\"NOWHERE IS THIS EVEN MENTIONED IN THE INSTRUCTIONS THAT CAME IN THE PACKAGE!", "Date": "November 6, 2012"}, {"Title": "Poor workmanship", "Author": "Renny", "ReviewID": "RID6PXKJVJ3BA", "Overall": "1.0", "Content": "Everything looks fine except when I pressed the test button, the alarm sounded only half of the time.  I couldn't tell if it is the case of faulty test button or faulty detector.  I didn't bother to return it.  This is the case of poor workmanship for making things off-shore. What happened to the good old American made quality!!!", "Date": "November 5, 2012"}, {"Title": "Dual protection beats more \"advanced\" detectors.", "Author": "foozman", "ReviewID": "R3P1KRG650DJF6", "Overall": "4.0", "Content": "Has both types of detectors: photoelectric and ionization. Beware of fancy detectors without ionization. 4 stars because one failed in one month, but gets 4 because it alerted the failure with a chirp. New battery did not help.May not meet building standards. For example, in 2018, Maryland will require a sealed battery or hard wire. I'll update then. I wish they would also require dual detection. I challenge anyone to find a dual detection sealed battery detector.", "Date": "January 14, 2014"}, {"Title": "Smoke and Fire Alarm", "Author": "JMB \"jb\"", "ReviewID": "R2YPFCYEJIQGFN", "Overall": "5.0", "Content": "Our smoke alarms for over ten years old and we bought the double sensor pursuant to a fireman's recommendation.  We had two defective smoke alarms, but they were exchanged with no issue.", "Date": "September 23, 2013"}, {"Title": "About this product:", "Author": "Shirl", "ReviewID": "R3E119UOHWOCCZ", "Overall": "5.0", "Content": "This product is as described.  Everything about this product has lived up to my expectations so far, both in craftsmanship and durability.", "Date": "September 7, 2013"}, {"Title": "Seemed fine", "Author": "Brian", "ReviewID": "R3C2VV0SUNQWXB", "Overall": "4.0", "Content": "I specifically wanted dual smoke alarm for bedroom and living area. (These are not for kitchens). O ordered 4. They all worked fine out of the box. They are a little high (Maybe 3\"), but I have them on the ceiling and they do not bother me. I need a smoke alarm to be reliable and work correctly when needed. Aesthetics are irrelevant.No issue with these and the price was fine with no shipping cost.I deducted 1 star not because of any issue but because these are brand new and time will tell if they fail. I have had many alarms of various makes over many years and none have so I am perfectly satisfied.People who complain about false alarms are using the wrong type in the wrong place. Do some research and figure out what you need first.", "Date": "September 6, 2012"}, {"Title": "Very pleased", "Author": "G Wayne Ollis", "ReviewID": "R2SO8YUTC4VG24", "Overall": "5.0", "Content": "Very pleased with this product.  Only had it one day and to be honest I've not purchased a detector in many years so pretty old technology is my baseline.  I love how it is designed to be able to replace the batteries without taking it down from the ceiling.  That is a huge advantage to me.  Another huge plus is the use of AA batteries.  The only thing in my home that uses 9V are the smoke detectors we have so I always have to buy those when I need to replace the batteries in my old ones, not so with this one as I almost always have AA's around.  I've not tested it and hope I don't have to officially.", "Date": "March 14, 2012"}, {"Title": "started beeping - broke after 13 months", "Author": "Amazon Customer", "ReviewID": "R3C92RZ1ZX6T0H", "Overall": "1.0", "Content": "Seemed to work fine, but started beeping a 1 AM every 10 seconds a couple weeks back. (bought this in Feb 2013) Put new batteries in at 1 am (yawnnnn) still kept beeping every 10 seconds. read on the unit this can happen after 7 years, (try 14 months) I believe it's a sensor malfunction. I'm glad that it let me know, but very annoying when it happened and more annoying that it happened so soon!", "Date": "June 6, 2014"}, {"Title": "Nice unit", "Author": "Robert McDonough", "ReviewID": "R1WA9U99KATQU4", "Overall": "5.0", "Content": "It installed easily and seems sturdy. The price was very reasonable. I hope it lasts a long time.  Overall i'm satisfied with this purchase.", "Date": "June 6, 2014"}, {"Title": "Easy to  use", "Author": "Beaumont Jedi \"BmtJedi\"", "ReviewID": "R13HLRF3J6SQKO", "Overall": "4.0", "Content": "I like how easy these are to use. The way the batteries are mounted, just slide them in and the device is ready to go. The instructions are on one huge sheet of paper that is a little complicated to navigate through - but not difficult. I rated this item a four because the instructions imply that the LED should blink green occasionally when the device is running. I bought two of these and the test works, but the LED does not blink during normal operations. Makes for a little nervousness. Maybe I should test?", "Date": "June 4, 2014"}, {"Title": "First Alert SA320CN Double Sensor Battery-Powered Smoke and Fire Alarm", "Author": "Dan Zhang", "ReviewID": "R7Y59GV57P0TU", "Overall": "5.0", "Content": "This is my second fire alarm of this model, it works so far so good. I wish it works as it designed. Thanks.", "Date": "June 4, 2014"}, {"Title": "Easy to install", "Author": "JohnE", "ReviewID": "R22EQMKZRQLQSV", "Overall": "4.0", "Content": "I think it would wake us up in case of fire/smoke...hope I never need to find out for sure. Reasonable value.", "Date": "June 3, 2014"}, {"Title": "Not loud enough", "Author": "Rain Man", "ReviewID": "R24D5V31V11PBX", "Overall": "2.0", "Content": "If you have this in a hallway or something open like that then I think it's OK, But if you are going to have it in a room with a closed door you can't hear it from two rooms away. Also the sound is NOT annoying or alarming, so if there are other noises it's very easy that you don't really notice that there is something wrong. I had a guest who didn't know we installed it, and we were testing, it kept beeping for a long time, when we ask him, he said he thought it was somebody's phone or something.", "Date": "June 1, 2014"}, {"Title": "Ok, so far.", "Author": "verizon girl", "ReviewID": "R232Q2HDZQ9A6Z", "Overall": "5.0", "Content": "Only been installed for a month.  No problems so far.  I like that AA batteries are used. Cheaper than 9volts.", "Date": "May 30, 2014"}, {"Title": "Great choice.", "Author": "Aleks", "ReviewID": "R3LRQBN6FA56TQ", "Overall": "5.0", "Content": "I bought this dual sensor smoke/fire alarm along with a separate CO monitor. Best protection and combination in my opinion.", "Date": "May 28, 2014"}, {"Title": "Very simple", "Author": "49erfrank", "ReviewID": "R2N8HJHX43SR3J", "Overall": "5.0", "Content": "All i had to do was activate the batteries. Hope i never have to use it but am gald that i have it.", "Date": "May 26, 2014"}, {"Title": "Where There's Smoke, There's Fire...Maybe", "Author": "sc", "ReviewID": "R124TKLFRHE8JE", "Overall": "5.0", "Content": "We're very pleased with this choice. It has both the visual and thermal sensors, and it appears that that combination really reduces the terribly annoying false alarms that you normally get from steam or smoke in the kitchen. It's unobtrusive in appearance and easy to mount.", "Date": "May 25, 2014"}, {"Title": "Haven't had to use it, knock on wood.", "Author": "W. Loo", "ReviewID": "R2B6UW4WH55FZV", "Overall": "3.0", "Content": "I don't know how well it works to detect smoke but I know it will trigger in high humidity. I use a ultrasonic humidifier in my room and if it's set too high, it will eventually set the alarm off.", "Date": "May 23, 2014"}, {"Title": "8 months?  Really?", "Author": "ECJ \"ericcjack\"", "ReviewID": "R3BUUTIFFIRGPX", "Overall": "1.0", "Content": "Junk...after only 8 months.  I've changed the batteries 2 times and it still goes into alarm mode.  J U N K!", "Date": "May 20, 2014"}, {"Title": "Easy installation", "Author": "Linda B Muncy", "ReviewID": "R10EHL6LR1NTPX", "Overall": "5.0", "Content": "It was easy to install. Liked that it was a dual sensor. Easy battery replacement. Using it in a hallway.", "Date": "May 20, 2014"}, {"Title": "GREAT", "Author": "SheriffJoe", "ReviewID": "R12MS29B2ZB2GH", "Overall": "5.0", "Content": "I consider the quality very good for this item. It is so sensitive to it's environment it went off when I painted the wall around it. For a alarm it is loud, clear and crisp and the price can't be beat. And so sensitive drying paint will cause it to go off. I am serious.", "Date": "May 17, 2014"}, {"Title": "Detects Both Types of Fires Quickly", "Author": "Greg", "ReviewID": "R2D7O9H0WE8J8L", "Overall": "5.0", "Content": "Unlike most smoke detectors this includes not only photoelectric detection but also ionization detection. This means it will react much, much faster to a fast flaming fire than other detectors, which are only particularly sensitive to slow, smoldering fires.", "Date": "May 15, 2014"}, {"Title": "Dual Sensor Detector at a Good Price", "Author": "Christopher Scheld", "ReviewID": "RM36F4R3RAEHD", "Overall": "5.0", "Content": "This First Alert detector is easy to use and has the advantage of detecting both smoke and fire. The alarm, as expected, is very loud and would work well in either a house or smaller apartment. I have not had any issues with the product after 6 months of use. For $20, it's tough to find a dual sensor detector of this quality.", "Date": "May 14, 2014"}, {"Title": "Good features, has some quirks", "Author": "Walter R. Francis", "ReviewID": "R3FZYOXRT4DTM1", "Overall": "4.0", "Content": "I haven't yet tested it in real life yet, lets hope I never have to.  The features are good on this smoke detector, however, it has a common quirk that I've found here and other sites...  I have a small (1050 sqft) single-floor house, so this is located centrally in the house, between kitchen, bedrooms, and near the main bath.  When I'm showering the detector will start doing three quick chirps.  It doesn't do it every day, and it almost always stops within a minute or two after the shower is off.  However, two different days it kept going for 20+ minutes after the shower and I eventually had to get up and take the batteries out, then I put them back in and it was fine.So water vapor sets it off?  That's fair, as long as that's a design to catch smoke and carbon emissions from fire etc.  But having to get out a chair and get up and reset it is annoying.", "Date": "May 10, 2014"}, {"Title": "Smoke detector", "Author": "Newbie", "ReviewID": "R37TLNZJ31ESUU", "Overall": "4.0", "Content": "I ordered this item to replace a worn out older smoke detector. It seems to be of good quality and works great.", "Date": "May 9, 2014"}, {"Title": "Good Value", "Author": "planetmike", "ReviewID": "R13J69GQ579XNP", "Overall": "5.0", "Content": "Inexpensive, easy to install and passed all the test modes. Don't bother using the AA alkaline batteries. For added security and longevity, use AA lithium batteries.", "Date": "May 8, 2014"}, {"Title": "working great", "Author": "gammyd", "ReviewID": "R2LQGVH2U6WET5", "Overall": "5.0", "Content": "Like the first one so well I bought another one. Very please with them. I have always bought First Alert", "Date": "May 3, 2014"}, {"Title": "Easy to install and work great", "Author": "Alex M.", "ReviewID": "R143QS40WMN6X8", "Overall": "5.0", "Content": "I wanted to make sure that I had the best protection so I looked up what was most recommended and everywhere I looked it said to get the dual sensor. It measures two different signs of fire/smoke and will alert you. Even if you don't see any smoke it will tell you that your pan is too hot on the stove! I got distracted and left a pan of butter heating up and it burnt up but didn't smoke up the place and the alarm still went off. It IS kind of sensitive but I would rather have one go off all the time than not go off when i need it!", "Date": "May 2, 2014"}, {"Title": "Beep!", "Author": "Austin Haynes \"Sinitron\"", "ReviewID": "R227HSPZRNUQ8O", "Overall": "5.0", "Content": "Haven't had a fire, thankfully, but the mounting and testing worked well. Instructions were clear and helpful about the correct places to mount a detector.", "Date": "May 1, 2014"}, {"Title": "I think its doing it's job but......", "Author": "Sarah", "ReviewID": "R1EUVEHK2TYSS9", "Overall": "3.0", "Content": "It goes of randomly for no reason at all every couple weeks I'm guessing just a test at least I know it works or the batteries are still good..", "Date": "April 28, 2014"}, {"Title": "Seems ok", "Author": "LJ", "ReviewID": "R21XDXLGF9VXWJ", "Overall": "3.0", "Content": "I liked the fact that the unit is a double sensor model.  It installed easily and I have had no problems with it.However,  the light is so tiny that it cannot be seen.  So unless the unit sounds the alarm or I stand on a ladderto test it,  I cannot really tell what the light might be indicating.  I didn't realize the sensor light would be so tiny as priorsmoke detectors I owned had much more visible lights.", "Date": "April 28, 2014"}, {"Title": "Great", "Author": "LBIgirl", "ReviewID": "R1FQBQTOKMCR4O", "Overall": "5.0", "Content": "I read the reviews and most people, even firemen, felt this was a good smoke detector...It was very easy to install where my previous fire alarm was. I was able to used the same screw holes.", "Date": "April 27, 2014"}, {"Title": "Installed easily where my old one was", "Author": "MPB", "ReviewID": "R11B7JG1ORY3IC", "Overall": "4.0", "Content": "Installed easily where my old one was.  I hope it works if needed, but First Alert has a good record, so I feel confident it will.  I really like that it takes AA instead of a 9V, and the side door access to the batteries is much better than my old one.  I had to take it off to get to the back.", "Date": "April 26, 2014"}, {"Title": "Smoke & Fire alarm", "Author": "Robert D. Keller", "ReviewID": "R1Z1D9Z3XZ5UZ3", "Overall": "3.0", "Content": "Haven't had to use it and hope we never do but it appears to be of good quality and easy to install.", "Date": "April 25, 2014"}, {"Title": "First Alert SA320CN Review", "Author": "Wayne K. Kamiya", "ReviewID": "R2WIXFH6XB0GQ1", "Overall": "5.0", "Content": "This dual sensor fire and smoke detector is great.  I bought it because it was one of the highest rated in the consumer magazines. The installation is very easy and the unit looks nice on the ceiling.  It's easy to remove from the mounting base, just a quarter turn, when it's time to change the batteries.", "Date": "April 21, 2014"}, {"Title": "Good Product", "Author": "TexasHonda", "ReviewID": "RO635TAOI5Y3X", "Overall": "4.0", "Content": "Price was attactive and I was replacing old First Alert smoke detectors (old and suspect). Installation was easy. All checked OK w/ test button and test smoke/fire from butane lighter. I hope I never find out how well they work in practice.", "Date": "April 18, 2014"}, {"Title": "Wish First Alert Would Keep the Same Screw Pattern for Mounting Bracket", "Author": "Michael Craddock", "ReviewID": "RQR7PF6TTXL5R", "Overall": "4.0", "Content": "I have always used First Alert smoke detectors and have never had any complaints about the operation of the detectors themselves. However, I do have a complaint about how the screw pattern for the mounting bracket changes every time I buy one. I purchased this detector and another one at the same time and the mounting brackets were smaller in diameter than the First Alert smoke detectors both were replacing, which meant the mounting screw holes were closer together. In fact, the new brackets were so much smaller than the old ones, that they did not cover the old screw holes, so I had to fill in one of the holes, spackle and paint where one of the screws had been before for each of the detectors.", "Date": "April 16, 2014"}, {"Title": "Great", "Author": "P. Mulloy", "ReviewID": "R2W42XXE83BM4Y", "Overall": "5.0", "Content": "Replaced an older alarm that died. This one has worked for over three years with no problems. It is also easy to install and easy to change the batteries.", "Date": "April 16, 2014"}, {"Title": "Good product!", "Author": "Mike Starling", "ReviewID": "R1GTI34T5N7EHK", "Overall": "5.0", "Content": "No nonsense, well made, but reasonably inexpensive unit.  Checked out and almost bought the \"other\" inexpensive brand that begins with a \"K\".  Glad I researched it first and bought these units.  Well made, and the reset button for smoke from kitchen mishaps is great.  Finally have protection on all floors and in the master bedroom.", "Date": "April 14, 2014"}, {"Title": "First Alert SA320 Smoke and fire alarm", "Author": "Tom Blair", "ReviewID": "RPDIGG5OFDQ3Y", "Overall": "5.0", "Content": "This unit was delivered on time and intact. I am satisfied with my purchase and would recommend it to anyone looking for a smoke and fire detector.", "Date": "April 13, 2014"}, {"Title": "Forst Alert", "Author": "Robert E. Klein", "ReviewID": "R1VUYHF3GTU0ZE", "Overall": "5.0", "Content": "As expected, First Alert offers quality.  The were easy to install and came with batteries.  I only hope to never be awakened by actual need, but they would do the job.", "Date": "April 9, 2014"}, {"Title": "Easy Set up, Easy install", "Author": "Amazon Customer", "ReviewID": "R271XFWBFS1EQF", "Overall": "5.0", "Content": "First Alert has been my choice for a nember of years now. When I moved into my current residence I knew exactly what I needed in the form of Fire/smoke detection. I opened the package, popped in the battery and simply twisted it into the ceiling mount bracket. I am comfortable knowing if there is a fire or smoke condition, I'll be alerted in time", "Date": "April 9, 2014"}, {"Title": "Need for dual element detector", "Author": "Tennessee Dave", "ReviewID": "R2VOVFF9ZJ3ZD3", "Overall": "4.0", "Content": "My previously installed detectors had been First  Alert, but were only of the ionizing variety,  when upgrading, I chose the same brand.", "Date": "April 7, 2014"}, {"Title": "So far so good!", "Author": "H. Salsano", "ReviewID": "RBFX1GG6Z4Q5Q", "Overall": "5.0", "Content": "Our old unit went bad a couple of weeks before we sold our house.  I bought this one and the holes lined right up and so it was installed in 3 minutes.  Hopefully, it will last a long time and protect the new owners of the house.", "Date": "April 6, 2014"}, {"Title": "First Alert SA320CN Double Sensor Battery-Powered Smoke and Fire Alarm", "Author": "Rick H.", "ReviewID": "R5BCCPQS1X1NH", "Overall": "5.0", "Content": "I bought this unit to replace a 10 yr. old First Alert which was only a single sensor. This one should be better protection at a reasonable price! This unit is slightly smaller in diameter than the old one so you have to drill at least one new hole for the bracket to line up!", "Date": "April 4, 2014"}, {"Title": "Good Smoke Alarm", "Author": "Bone Collector", "ReviewID": "R1ST5LDJ1T2IKZ", "Overall": "5.0", "Content": "Happy to say I haven't gotten to see it in action against a fire or serious smoke.  It looks much better than your standard smoke alarm.  It comes with good Duracell batteries too, which is a plus.", "Date": "March 26, 2014"}, {"Title": "No problems to date", "Author": "A. West \"dawdler\"", "ReviewID": "R22UA6GGGR06ZG", "Overall": "4.0", "Content": "These were installed several months ago (3 of them). All are working without problems. One battery change was necessary for each unit.", "Date": "March 24, 2014"}, {"Title": "Batteries are AA !", "Author": "edro@natick", "ReviewID": "RCCQIUZHMFYTD", "Overall": "5.0", "Content": "Escape from the 9-volt treadmill !  This unit uses AA batteries, which can be taken out at the recommended 6-month change-over interval,  and then re-used in a small flashlight or tv remote control.", "Date": "March 21, 2014"}, {"Title": "a dual detector delight", "Author": "pc in georgia", "ReviewID": "R3FQ94FPDTTRU7", "Overall": "4.0", "Content": "A couple of benefits that I appreciate in this unit are the front access to the batteries (included) which obviously means you will not have to remove the unit from the ceiling or wall. This alone is sufficient for you to want this smoke detector. The other benefit is that it has both types of detectors for fast moving fires and smoldering fires. The detectors are the photoionization-type and particulate-type, I believe that is what it is called.  I gave it four stars because of the benefits.  I hope to never give it 5 stars because in my mind, it worked to alert me and my family to a house fire.", "Date": "March 19, 2014"}, {"Title": "Ionization vs photoelectric - this does both. Important!", "Author": "TNT", "ReviewID": "RVD76NQFQWX8D", "Overall": "4.0", "Content": "Google \"Ionization vs photoelectric\" then click on the first link from the National Fire Protection Association. Read about Ionization vs photoelectric before buying any smoke/fire detector.This detector does both, very important.  I've noticed nearly all detectors on this site do one or the other and not both. Some Amazon reviews have stated certain detectors haven't gone off in a room full of smoke as they were the wrong type (scary).Anyway, it arrived today, seems to work fine. Noticed the 'test' button' - you need to push it pretty hard to get a test sound (so 4 stars so far). Not sure if that's normal, will update the review if I have issues or things change.", "Date": "March 18, 2014"}, {"Title": "functional but not perfect", "Author": "James A. Pastore", "ReviewID": "RL7IXX93DZD3H", "Overall": "3.0", "Content": "LED indicating the detector was not functional.  Too much of a pain to send back.  So now I test weekly.  Quality of unit is suspect", "Date": "March 16, 2014"}, {"Title": "Easy install", "Author": "K&J", "ReviewID": "RECC6VUTW1RC5", "Overall": "5.0", "Content": "So far these work great.. We had some smoke it the kitchen due to food in the bottom for the oven. These went off with very little smoke it the room.. I was very happy with that..", "Date": "March 13, 2014"}, {"Title": "Good product.", "Author": "alevp45", "ReviewID": "RJ773J7MPRY8B", "Overall": "4.0", "Content": "very good product, I highly recommend it, protect your family with this smoke detector, worth buying. if a fire occurs and you would not wake sleeping without a detector that alerts.", "Date": "March 12, 2014"}, {"Title": "Met All Expectations", "Author": "Christopher M", "ReviewID": "R3RTXGM3LPGP62", "Overall": "5.0", "Content": "I was a little wary when purchasing this item after seeing some of the negative reviews.  However, I have not experienced anything negative.  The product was easy to install (fit right where my old one was) and everything works correctly out of the package for the one month I have had it.  Very happy with my purchase.", "Date": "March 12, 2014"}, {"Title": "good value", "Author": "Fei", "ReviewID": "R74AZBEQW3I3Q", "Overall": "5.0", "Content": "I bought a bunch for my rental home. It is super sensitive, my tenant tend to take it off the wall when cooking (especially a stake)..", "Date": "March 10, 2014"}, {"Title": "Some pluses and minuses", "Author": "Tom from CT", "ReviewID": "RIWG8658XU7BI", "Overall": "4.0", "Content": "I've only had mine alarms up a week or so, so I can't comment on the reliability issues other posters complained of.Pros:-A huge positive point-these alarms take two AA batteries instead of the 9 volt rectangular ones every other alarm uses.  Easier to put in and a whole lot cheaper than the 9v.-As mentioned by others this is a dual sensor alarm-essential feature IMO.-Good and clear instruction manual.Cons:-This is a prime candidate for Amazon's frustration free packaging-it comes in a nearly impenetrable blister pack. Opening the packaging was the hardest part of installation.-Not a beef with this model as such, but why do smoke detector manufacturers insist on having slightly different bases?  Being able to use the already installed base would be ideal but what really bugs me is that the screw hole patterns are just different enough that you have to drill at least one more hole in the ceiling when switching brands.", "Date": "March 9, 2014"}, {"Title": "dual sensor and AA batteries make this a good choice", "Author": "Peter P. Lilley", "ReviewID": "R2BQPUMAD365N5", "Overall": "5.0", "Content": "I got this model for 2 reasons, it has dual sensor, which every alarm should have and they run on AA batteries.  also the price was good.", "Date": "March 2, 2014"}, {"Title": "Easy to install, easy everything, easy to monitor", "Author": "John Breeding", "ReviewID": "R3JC7NRFLEQGOS", "Overall": "5.0", "Content": "Easy battery replacement, easy to see for testing. We took out hard wired systems that when one battery got low they all went off. These are also duel signal, fire and smoke.", "Date": "March 1, 2014"}, {"Title": "Works well and priced well", "Author": "albert beaulieu", "ReviewID": "R2LJXE0L17PTXR", "Overall": "4.0", "Content": "I would recommend this item to all my friends.  I was able to install them(2) in a matter of 1/2 an hour", "Date": "February 25, 2014"}, {"Title": "Nice Upgrade.", "Author": "William", "ReviewID": "R1OT7TW3W65E7P", "Overall": "5.0", "Content": "It was time to renew and upgrade our Sensors in the house. After doing a bit of research, we decided on these. They are nice solid units.", "Date": "February 24, 2014"}, {"Title": "Works", "Author": "Whozis", "ReviewID": "RBQTTZEHZRL5Z", "Overall": "4.0", "Content": "I did quite a bit of research before buying this alarm. I had a bit of trouble installing it, as the screw holes did not match to the existing box in the ceiling. I drilled a new hole and finished the installation. I tested it, and it worked, but I am not sure how that it would work in a real case of fire or smoke. Our old alarm was very sensitive and went off when sometime was burned on the stove or in the oven, or even when a lot of steam escaped during cooking. This one does not, so I am hoping that it will work well if we need it to do so. I like the fact that it is rated for both smoke and fire.", "Date": "February 22, 2014"}, {"Title": "~~~~  Hope I Never Have to Use It", "Author": "Adam Smith", "ReviewID": "R2UB3EAFFPQUKB", "Overall": "4.0", "Content": "I now have bought 2 units of this product.  So far I'm pleased.  The main selling point was it detected both smoke and fire.  And that it required 2 AA batteries, whereas others I've used took one D battery.  It was hard for me to remove from its clamshell package, but easy to install the (included) batteries.  When I tested it by pressing the button, it took a while, but finally let out those obnoxious shrieks.", "Date": "February 21, 2014"}, {"Title": "Easy to set up", "Author": "Tom", "ReviewID": "R1LFPDY6FZMHCR", "Overall": "5.0", "Content": "A person actually never wants to be able to give this item a full review, but it certainly seems good, and the batteries which come with it are much easier to install  and to remove than in previous models I've used.  In fact, the batteries are already installed.", "Date": "February 20, 2014"}, {"Title": "Alarms", "Author": "Jeffery J. Clark \"Bones\"", "ReviewID": "R2TZ73CUR5Y82E", "Overall": "5.0", "Content": "Bought several of these to replace the ones we've had for several years. I trust they will do their job if needed.", "Date": "February 20, 2014"}, {"Title": "Works", "Author": "me2", "ReviewID": "R5EIBW1M3L1OH", "Overall": "5.0", "Content": "Does the job.  Easy to mount, took 2 mintues at most.  Having AA batteries should be standerd in this type of things, will be easy to replace the batteries, it compartment is on the side so you do not have to take the whole thing down.", "Date": "February 18, 2014"}, {"Title": "Easy install, nice looking, & seems to work", "Author": "Jeremiah L. Olson", "ReviewID": "R3MZB3ZEU0NMV4", "Overall": "4.0", "Content": "This is one of those items I never want to have to write a review about because I actually had to use it.  Unfortunately we had a chimney fire prior to installing these and that is what prompted me to actually by 2 of these.  They were easy to install and I like the way you simply have to turn it to lock it into the ceiling mount.  I also enjoy the fact that it is double A batteries instead of 9 volt.  The instructions were informative and helpful.  I have tested these twice and they work fine in the test.  So far I would recommend.", "Date": "February 17, 2014"}, {"Title": "First Alert Double Sensor Smoke Detector", "Author": "Mitchell", "ReviewID": "R18W6H50WRE7X", "Overall": "5.0", "Content": "I really like the fact that they are double sensor and use AA batteries instead of the 9v.  I always have plenty of AA's on hand and they are cheaper.  Easy to install and change batteries.  No issues!", "Date": "February 12, 2014"}, {"Title": "First Alert Double Sensor Review", "Author": "Donald", "ReviewID": "RV02RQ1LEO271", "Overall": "4.0", "Content": "The smoke alarm met my expectations and I am pleased with it.  I will continue to shop for other First Alert products.", "Date": "February 10, 2014"}, {"Title": "Works perfect", "Author": "R. Armstrong", "ReviewID": "R2KUSO86RPJNIT", "Overall": "5.0", "Content": "I hesitated given some of the negative reviews, but this works perfectly for my in a travel trailer. I burnt some popcorn in the microwave and it went off, not too soon, but when it should when the smoke got bad. The only one that takes AA batteries that I could find. Nice unit!", "Date": "February 9, 2014"}, {"Title": "Cheap and functional", "Author": "James L", "ReviewID": "R82KUDUZZO20A", "Overall": "4.0", "Content": "I chose this sensor as it was a low cost duel-sensor detector. As noted during other reviews; the dual sensors allow the detector to alert on slow smoldering fires as well as high intensity fires.", "Date": "February 9, 2014"}, {"Title": "Appears to work ok, so far so good", "Author": "Doug Olson", "ReviewID": "RH7RJ5ONDOBGP", "Overall": "4.0", "Content": "It was easy to install and I like the use of AA batteries rather than 9v.  Like any safety device, you won't know whether it really works until it's needed the most.  I just put my trust in the First Alert reputation.", "Date": "February 7, 2014"}, {"Title": "Does its job", "Author": "oldseagull", "ReviewID": "R36MEHK6F1LV11", "Overall": "4.0", "Content": "This First Alert Double Sensor Smoke and Fire Alarm replaced a ten year old smoke detector in the hallway outside our bedroom. I had worried that the old detector was just plain worn-out from old age - did not really trust it.  This new and up-to-date alarm from First Alert offers the latest technology.  One plus = it uses AA batteries(included), long lasting and easy to replace when necessary.", "Date": "February 6, 2014"}, {"Title": "Good", "Author": "Granny 3", "ReviewID": "R2O7ZUXARLEKUU", "Overall": "5.0", "Content": "After reading several reviews on different smoke detectors, I decided to go with the smoke and fire alarm.  First Alert had a decent price, so that's what I ordered.  It doesn't go off every time we use the oven, like our old one did, but when it does go off, you are definitely going to hear it.", "Date": "February 5, 2014"}, {"Title": "Another Great Product!", "Author": "Dan", "ReviewID": "R1YTZBRWG6S19F", "Overall": "5.0", "Content": "If you do not have the plug in type with the battery back up, then this is the next best step.", "Date": "February 4, 2014"}, {"Title": "SO far, so good...", "Author": "Barry J. Connolly", "ReviewID": "R30RR4UOFLYA26", "Overall": "4.0", "Content": "Installed easily and so far no false alarms. Of course, unless something sets these devices off you never really know how effective they are. However, I had a similar model and it woke me when my under-the-house oil burner blew a gasket and sprayed steam all through the basement -- so I am hopeful this one will also work when I need it to.", "Date": "January 31, 2014"}, {"Title": "Very short battery life and sensitive to shower steam", "Author": "Scott Sitler", "ReviewID": "R2528G28QACO8H", "Overall": "1.0", "Content": "I bought 6 of these and every single one of them eats batteries alive.  I get only about 3 months per battery set, even when using long life lithium batteries.  Also, these units are sensitive to steam from the shower and will set of an alarm.  I could live with that, but the short battery life is a deal killer.  All 6 of these are going to the municipal waste recycler!", "Date": "January 31, 2014"}, {"Title": "if you can only get 1", "Author": "Karl D. Thompson", "ReviewID": "R1TUAK3TJIAI7N", "Overall": "5.0", "Content": "THis sensor is the only one to buy as is covers slow burning and fast flaming fire. One is big particles and the other small. I would not buy a smoke detector that combines smoke and Co2 which is a gas. When buying always make sure that what you get has battery back up. It the power goes out it will still work. You just have to remember to change the battery. I do mine in the fall when we change the clocks.", "Date": "January 26, 2014"}, {"Title": "Doesn't work", "Author": "D. Drake", "ReviewID": "R2DXPWWYTGQ4G5", "Overall": "1.0", "Content": "This smoke detector is defective. It lasted about 3 days and now just goes off constantly when batteries are in. Poor quality, do not buy!", "Date": "January 26, 2014"}, {"Title": "Good product", "Author": "Robert J. Dalen", "ReviewID": "R3W2Z6LVYCGID8", "Overall": "5.0", "Content": "It is load enough to wake me up, it was easy to mount on the wall, and the batteries are easy to install.", "Date": "January 7, 2014"}, {"Title": "So Far So Good", "Author": "R. Schwenn", "ReviewID": "R267C3HFNP6UQC", "Overall": "5.0", "Content": "It mounts easily and has not given us false alarms.  That is about all you can ask for and hopefully I never have to hear it going off in the middle of the night.", "Date": "January 5, 2014"}, {"Title": "Easy to install - exactly what I wanted", "Author": "Kenneth Zacharovich", "ReviewID": "RR7PRMOC9S3OM", "Overall": "5.0", "Content": "In our house, we have both wired and battery powered smoke alarms. After twenty years, I figured it was time to replace them.For the battery-powered alarms, I chose the First Alert double sensor alarms. I wanted to be protected from both smoke and fire, and this alarm does exactly that.The alarms came with their own battery - an they were AA'a  (yay! no more 9 volts!).The other nice thing about it is that the battery latch door is on the side so you don't have to remove the alarm to replace batteries.As far as installing them - piece of cake!  Couldn't of been any easier.", "Date": "January 4, 2014"}, {"Title": "Exactly what I needed.", "Author": "Alabama Momma", "ReviewID": "R2135B78D0K1F8", "Overall": "5.0", "Content": "Right price and delivered fast.  unfortunately First Alert decided to change the placement of the wall mounts so we could not use the screws from our older First Alert Smoke detector.", "Date": "January 2, 2014"}, {"Title": "Dual sensor smoke and fire alarm! Seems to work good!", "Author": "Tim Morris", "ReviewID": "R3MV0FVD19KVJA", "Overall": "5.0", "Content": "I like the dual sensor smoke and fire alarms! They rated the most reliable when detecting a smoldering or an actual fire!!! This seems to be one of the best units to get!", "Date": "January 2, 2014"}, {"Title": "Found It! A Breeze!", "Author": "Just shop", "ReviewID": "R3QKXA9Y7ZY17D", "Overall": "5.0", "Content": "Tired of going back to stores to learn no longer carry, just a different brand, Amazon made this a breeze, this is a dual excellent for the laundry room area for example, once actually saved us from an electrical fire, dad was so proud of me for having ordered and given to the family unit, gees-yes it's that time of year to remember Loved ones, to take of them, to actuall give a little, heck so glad my family was safe that year GOD BLESS! Merry Christmas,  the smoke alarm alerts you for slow smothering fires like electrical, or for the full blaze like the smoking burning turkey oh oh!", "Date": "December 24, 2013"}, {"Title": "Great product", "Author": "Mickey", "ReviewID": "R3VWLR7KBTAHEM", "Overall": "5.0", "Content": "Product arrived on time with good packaging. Smoke detectors are well made and  came with easy to follow directions.Would recommend this product to friends.", "Date": "December 21, 2013"}, {"Title": "Works", "Author": "Alan Joe", "ReviewID": "R3642BLC1CMAGW", "Overall": "4.0", "Content": "Ease of installation.  With the toaster smoking, alarm went off in timely manner....So it workedPurchased based on ratings also", "Date": "December 19, 2013"}, {"Title": "Works great", "Author": "Robert J Furlin", "ReviewID": "R2D49NHX22EEH6", "Overall": "5.0", "Content": "The Alarm was easy to install and met my expectations.  I plan to purchase a few more and recommend it to others.", "Date": "December 18, 2013"}, {"Title": "Dual technology means sensitivity to real fires, not toasting smoke", "Author": "Teh Arbitrageur \"PM\"", "ReviewID": "R3E8GVFSCI5X3", "Overall": "5.0", "Content": "This is a next-generation alarm, where they've brought together the two common types of detectors: ionization (which detects gasses from fresh burning) and optoelectronic (which detects cloudiness of smoke).  Any genuine fire will produce some of both symptoms, and that's when this will go off.After having countless frustrating false alarms in my old ionization-only unit due to cooking steaks, etc., I'm thrilled at the silence of this one -- the alarm who cries wolf gets ignored, especially by neighbors.  Yet if and when a real fire strikes, I am confident that this will shrill just as early and loudly as any older unit.", "Date": "December 18, 2013"}, {"Title": "It works", "Author": "Dr Mike", "ReviewID": "R9II0SALGY987", "Overall": "5.0", "Content": "I have no issues with this alarm. It is smaller in diameter than the one it replaced, but the height is a little taller. The alarm is nice an loud and would probably wake the dead as the saying goes.", "Date": "December 17, 2013"}, {"Title": "be safe and buy the dual sensor", "Author": "John K", "ReviewID": "R1Z1KSXRDV7CXR", "Overall": "5.0", "Content": "after watching a you -tube video on fire detectors I threw my old ones out and bought these dual sensor ones.  the old single stage fire detectors are crap.", "Date": "December 15, 2013"}, {"Title": "I feel safe.", "Author": "Amoeba", "ReviewID": "R398MVNJ525GYH", "Overall": "5.0", "Content": "Very easy to install, accidentally tested when someone burned some cookies (just smoke, no fire).  It works and silenced when I pushed the button.", "Date": "December 14, 2013"}, {"Title": "It is a must for every level in your house", "Author": "Annette1915 \"Annette\"", "ReviewID": "R13F5QIAK8GJLR", "Overall": "5.0", "Content": "I bought three Smoke and Fire Alarm for each level of my home.  I have not finish putting two in, but the old ones are still working.  I will work on that within a week.  My family needs all the protection that is necessary to keep them safe.  This is something that is simple to do and update the system every five or six years.", "Date": "December 14, 2013"}, {"Title": "nice", "Author": "S. Dupree \"Rockaway Bulldogs\"", "ReviewID": "R1FLNRRKEMU5QY", "Overall": "3.0", "Content": "this seemed perfect until i read that it is not to be installed over an existing fire alarm electrical hole. well darn it all!", "Date": "December 13, 2013"}, {"Title": "Good product", "Author": "daybyday \"atkinsPro\"", "ReviewID": "R3CMQAT9TEH6IT", "Overall": "5.0", "Content": "Does what it is suppose to do. Clear sound heard in all areas of the house. Not so sensitive that a little kitchen odor sets it off. I like that.", "Date": "December 13, 2013"}, {"Title": "First Alert SA320CN Double Sensor Battery-Powered Smoke and Fire Alarm", "Author": "MRGW", "ReviewID": "R2KHUUYOHYHW3T", "Overall": "5.0", "Content": "I ordered this product after researchf and find that it is an excellent product.  I feel I have added security in home by having these alarms installed.", "Date": "December 10, 2013"}, {"Title": "great smoke alarm", "Author": "Lina", "ReviewID": "R2CFTS82BUDEA2", "Overall": "5.0", "Content": "we have ordered several of these in the past ~ we like the first alert ~ reliable smoke and fire alarm!", "Date": "December 5, 2013"}, {"Title": "practical, 2 sensors", "Author": "Benjamin B. Brink \"Benjamin Brink\"", "ReviewID": "R2SJJ1K3PH66IS", "Overall": "5.0", "Content": "This smoke alarm senses smoke via two different sensor types. It's appears to have adequate quality for its purpose ie. hasn't given false alarms, no broken buttons etc. It's inexpensive enough that it's great to get a couple extra to share..", "Date": "December 4, 2013"}, {"Title": "Dual sensors-excellent alarm", "Author": "Jeff", "ReviewID": "R2ZZ1TTW337XD0", "Overall": "5.0", "Content": "Just tried tonight-very sensitive and loud. Has dual sensor which is the only way to go with a smoke detector. They must have both detection systems or are virtually useless", "Date": "December 2, 2013"}, {"Title": "Pleased with these alarms", "Author": "Kathy Bassette", "ReviewID": "R36GC5S4O279BE", "Overall": "5.0", "Content": "Bought this after reading reviews on different smoke alarms, chose this one because it is supposed to do the job for both fire and smoke. Worried a little about some reviews that complained about it going off when cooking, so far no complaints and I cook all the time. Our electric went off the other night and I mistakenly light a candle right underneath it, it went off. That made me feel good, I thought great, how will I shut this off? That's hubby's job, he's sleeping. I picked the candle up and set it in another spot and the alarm ceased.  We're happy with it, can rest at night more peacefully when our woodstove is keeping us warm.", "Date": "November 30, 2013"}, {"Title": "Good budget priced unit", "Author": "R. Myers", "ReviewID": "R154RUZBFNAOVU", "Overall": "5.0", "Content": "Nice looking unit with good basic features.  Seems built well enough compared to other detectors.  Not too big.  Battery easy to get to.  Come off of the ceiling easier than my old unit.  Very pleased so far.", "Date": "November 23, 2013"}, {"Title": "A good nit for a good price", "Author": "James Konefal", "ReviewID": "R2FHPB2IHGBX77", "Overall": "5.0", "Content": "This was to replace one that was placed at the far end of the kitchen/hallway on main floor. Easy to install and convenient to get replacement battery in unit. I chose this one since it had dual sensors and would pick up a fire/smoke a lot quicker,  especially adjacent to the kitchen area. A good price and a good unit.", "Date": "November 23, 2013"}, {"Title": "This is the technology you need to protect your family...", "Author": "G Y \"GY WY\"", "ReviewID": "RJWUM2BZUDEPL", "Overall": "4.0", "Content": "This is a great buy and works well for family protection.  Buy plenty to have throughout the house and be sure to keep the batteries changed.  The double sensor is so much better than the old style...", "Date": "November 22, 2013"}, {"Title": "Another Great First Alert Product", "Author": "William Schatz \"Exval\"", "ReviewID": "R3Q01G5FLMMYST", "Overall": "4.0", "Content": "Works fine. This is exactly what I was looking for. Every home should have a few of these mounted and checked every 6 months", "Date": "November 22, 2013"}, {"Title": "First Alert SA320CN Double Sensor Battery-Powered Smoke and Fire Alarm", "Author": "Neil R Verderber", "ReviewID": "R25M03C3TSX4XJ", "Overall": "4.0", "Content": "Haven't needed it (thank goodness) so I don't know how it performs, but the 'dual' part of it made it a good choice for the second floor hallway outside the bedrooms so I don't need to have two separate units crowding the ceiling.", "Date": "October 29, 2013"}, {"Title": "This Thing Can't Tell Smoke From Cooking Steam", "Author": "Jane Austen \"Gladys\"", "ReviewID": "RKWZTIQSWZV3S", "Overall": "2.0", "Content": "I purchased this item because the old smoke detector went off every time I cooked a meal. The homeowner has it positioned too close to the kitchen. However this detector purports that it will NOT react to a little cooking steam (I can't even see it) but such is not the case. This thing alarms just like the last one did every time I cook even though the steam is invisible to me. The only problem is that this thing just KEEPS alarming. It is driving me crazy! Don't buy if you expect it to be able to distinguish between smoke and a very little steam.", "Date": "October 28, 2013"}, {"Title": "This is good", "Author": "pwsfirewoman", "ReviewID": "R63J047T7I90J", "Overall": "5.0", "Content": "This has been a good product. It's easy to use and works great. Nice to have and I sleep better at night knowing it will detect both smoke and fire. Shipping was reasonable and we received it sooner than expected.", "Date": "August 3, 2013"}, {"Title": "Easy to install", "Author": "Glen W.", "ReviewID": "R3T557LGZ46KVD", "Overall": "5.0", "Content": "Does the job, convenient and well designed.  Loud enough when it goes off and provides me with a secure feeling.", "Date": "July 30, 2013"}, {"Title": "Works fine and the nice thing is it takes AA batteries.", "Author": "EddieE", "ReviewID": "RJ3H1PF7CGCEI", "Overall": "5.0", "Content": "Works fine so far with no false alarms. I am phasing out my single sensor alarms due to the simple fact I feel that a double sensor alarm is the way to go, come on folks you depend on these things with your life...so why go the cheapest ones or most inefficient ones. The fact that it takes just 2 AA batteries is a plus too, gets you away from buying the expensive 9 volts. I have probably too many detectors in my place but I just feel it is a good sound investment to make for your family and self.  To be prepared for things is the key and this dual sensor type of alarm fits that. I recommend this item.", "Date": "July 17, 2013"}, {"Title": "SMOKE ALARM", "Author": "KATHERINE WILSON", "ReviewID": "R26XDQLPRBBXA0", "Overall": "5.0", "Content": "I REALLY FEEL MORE PROTECTED WITH THE DOUBLE SENSOR. I'VE ALWAYS FELT SMOKE ALARMS ARE CHEAPINSURANCE. I LIKE THE FACT THAT IT EVEN COMES WITH BATTERIES. I BOUGHT 1 FOR THE HOMES OF EACHOF MY LOVED ONES.", "Date": "July 13, 2013"}, {"Title": "easy to install and hopefully they will work if or when we need them.", "Author": "Phyllis M Goodroad", "ReviewID": "R3OUXBXKKDO25U", "Overall": "3.0", "Content": "easy to install and they are small and not very noticeable when installed on the ceiling.They were reasonable as far as price and they are nice looking.", "Date": "July 9, 2013"}, {"Title": "Installs Easy", "Author": "Michael Flournoy", "ReviewID": "R2OLPSFIWOZF26", "Overall": "4.0", "Content": "It's installation is quick and easy.  The test works just fine.  Hopefully testing will be the only activity it sees.", "Date": "July 6, 2013"}, {"Title": "Meets most all Home Protection Requirements for Smoke", "Author": "Fred = Southeast Louisiana", "ReviewID": "R1C2ZXT6NX4CB9", "Overall": "5.0", "Content": "This Smoke Alarm seems to be one of the most reliable battery-powered Double Sensor Alarms on the market.It is easy to install and easy to replace batteries.", "Date": "July 3, 2013"}, {"Title": "Very cost effective.", "Author": "Nick Cornett", "ReviewID": "R2IQ6Y55PFFB7P", "Overall": "4.0", "Content": "Installation was a breeze and they function perfectly (tested them out while baking...). About the best value you'll find for a smoke detector.", "Date": "June 30, 2013"}, {"Title": "So far so good.Only time will tell.", "Author": "Jim", "ReviewID": "RYE31HCRIXYJG", "Overall": "5.0", "Content": "I am a duplex landlord and bought several of these for tenant bedrooms. I have installed some and have more to install. I like the concept of a single smoke detector sensing either a fast burning or smoldering type fire which is why I rated this highly. A primary criteria for me will be longevity. The first ones I installed have only been in a month so far. So only time will tell.", "Date": "June 20, 2013"}, {"Title": "Works great", "Author": "Gabriel Giersdorf", "ReviewID": "R11S4Y4ZDHZREU", "Overall": "5.0", "Content": "I got these as well as several other types of smoke/fire detectors to have full coverage through the house for various hazards and these work well.  I would recommend these to anyone looking to protect their home and family.", "Date": "June 10, 2013"}, {"Title": "Love it and...", "Author": "LISA LOU \"LISA MARIE\"", "ReviewID": "R23VBWMM6BUNQW", "Overall": "5.0", "Content": "Love this, after reading reviews I knew I had to have them in our home. I couldn't believe that our regular code alarms wouldn't even alert us if we had a slow smoldering fire that could kill us in no time from the toxic smoke. These should be code...not the other ones. I sleep a lot sounder and know that these could save our lives. I HIGHLY RECOMMEND!!", "Date": "June 8, 2013"}, {"Title": "I Guess It Works; No Problems So Far.", "Author": "Duane R. Price", "ReviewID": "R3LOL5M4ZA8RNO", "Overall": "5.0", "Content": "I installed the alarm and followed the instructions to check if it was working. It was easy to install in upstairs guest bedroom. I have two other alarms in the house (main bedrooms area and basement). They are also First Alert alarms that have been in use for about 10 years without problems. I plan to replace them with this alarm in the near future.", "Date": "June 5, 2013"}, {"Title": "First Alert Smoke and Fire Alarm Rating", "Author": "James A.", "ReviewID": "R1HGF1GYKAGOHZ", "Overall": "5.0", "Content": "It appears well made, looks good, and installed easily where my old alarm was.  It has both smoke and fire protection features, which is what I was shopping for.", "Date": "June 5, 2013"}, {"Title": "Fire Alarms", "Author": "CT", "ReviewID": "R1WHQNTSCYJTZ2", "Overall": "3.0", "Content": "I had purchased the same alarms 10 years ago and I am again replacing them with the same kind , the dual detection alarm is a must. The only problem with these new ones is that the mounting plate is a different shape and the alarm attaches differently. This equates to having to replace the mounting plate on the ceiling and since the newer mounting plates are smaller it means some touch up paint or repainting a wall this is a definite minus to a good and trusted product.", "Date": "June 4, 2013"}, {"Title": "Priced right, easy to install, performs as promised", "Author": "Robert Blake", "ReviewID": "R2CTO5UMMIOQQA", "Overall": "5.0", "Content": "Great alarms.  Not too sensitive that they go off every time you pop a piece of toast up but they absolutely work.  Long battery life.  Easy to install and they can save your life.  Why would you not buy them?", "Date": "June 2, 2013"}, {"Title": "safety firtst", "Author": "Joseph J Pollara", "ReviewID": "R2W4OOM9E2JDL4", "Overall": "5.0", "Content": "I needed to replace my aging smoke detectors. These seem to work fine. Nice to have easy replaceable double A batteries.", "Date": "May 30, 2013"}, {"Title": "Sleep At Night", "Author": "J. Powell \"JP\"", "ReviewID": "R3CHVHFPRVVDNR", "Overall": "5.0", "Content": "These give all the protection we need. I installed five of them in about 15 minutes. They are so easy to install and test. I am not \"handy\" in the home, so I appreciate how seamlessly and easily the installed.", "Date": "May 29, 2013"}, {"Title": "Does everything it is supposed to do.", "Author": "prakthad \"prakthad\"", "ReviewID": "R2PU0Z93MND2XJ", "Overall": "5.0", "Content": "Easy to install. It has a dual alarm and regular AA batteries.Hope I dont need to ever see it work.", "Date": "May 24, 2013"}, {"Title": "Great item!", "Author": "Vicki Williams", "ReviewID": "R2HTYEN7L9GKY1", "Overall": "5.0", "Content": "This is a much better product than the average smoke detector.  Fortunately I haven't had it go off yet but knowing that it detects smoke and fire helps me feel more secure.", "Date": "May 16, 2013"}, {"Title": "Great", "Author": "Mary S. Bowie \"msherier\"", "ReviewID": "R2O8LL8WOILQ29", "Overall": "5.0", "Content": "Bought this to replace existing alarm which did not protect from both types of fire.  Easy to install and very reasonably priced.", "Date": "May 5, 2013"}, {"Title": "Combo First Alert Alarm", "Author": "BILL O'CLOCK \"BOC\"", "ReviewID": "R3SSHXAXPH0D84", "Overall": "4.0", "Content": "I installed three in about half an hour. I wanted to get a combination smoke and fire alarm, rather than what they replaced: a fire alarm only. This product requires two double-A batteries rather than a pair of 9-volts. I haven't had them long enough to see how long the batteries last. I haven't had any false alarms, and thankfully I haven't had any real alarms either.", "Date": "May 5, 2013"}, {"Title": "Good Price", "Author": "Tony Jordan \"Enigma\"", "ReviewID": "R1A0B8B3JC0NTY", "Overall": "4.0", "Content": "This price beats the big box stores and its a dual sensor alert-very easy to install-I hope I never hear it go off except when testing it!!", "Date": "May 2, 2013"}, {"Title": "Easy to set up", "Author": "Gina Bossini", "ReviewID": "R9XNCHPH4ZAK9", "Overall": "5.0", "Content": "Easy to install I like that it is smoke and fire detector and had good ratings. Able to put on ceiling.", "Date": "May 2, 2013"}, {"Title": "It is what it is", "Author": "C. R. Carter", "ReviewID": "RRIYU853KGWMI", "Overall": "5.0", "Content": "Easy to install, no false alarms.  Prior reviews complaining about the flashing light that shows it is working are too picky.  You have to stare at it to see the flashing LED.  Would buy again.", "Date": "April 29, 2013"}, {"Title": "Everything you need...", "Author": "Betty L.", "ReviewID": "R17N68S3CY7DTL", "Overall": "5.0", "Content": "What more can you ask for?  Double sensors, batteries included, easy to install, and priced right.  I bought five of these - three for our house and two for our son's new condo.  I'm very satisfied with this purchase.", "Date": "April 29, 2013"}, {"Title": "Great product", "Author": "Nikki", "ReviewID": "R1V18DTIC81UM6", "Overall": "5.0", "Content": "I chose this b/c it has the double sensor in it. I watched Dateline and they were talking about the one sensor fails a lot of times to warn people until its to late but the other is better. So I figured having both should have us covered if God forbid something happens.", "Date": "April 25, 2013"}, {"Title": "Good alarm", "Author": "ji zhang", "ReviewID": "R3AM8BRHA9U4R6", "Overall": "4.0", "Content": "Everything works great but a little too sensitive. Would be better if the sensitivity can be adjusted. That is all.", "Date": "April 12, 2013"}, {"Title": "nice", "Author": "B", "ReviewID": "R1MXQYS73RTG24", "Overall": "5.0", "Content": "Haven't had a fire yet so not 100% sure but I like the dual element feature and the fact that they use AA  batteries instead of 9 volt.", "Date": "April 10, 2013"}, {"Title": "Safety First", "Author": "Sops \"fsop\"", "ReviewID": "R3S32034777UZK", "Overall": "5.0", "Content": "Good item to keep our family safe from fire and smoke.  Easy to insert battery and install on ceiling. Makes one feel safer.  Will report in a year to determine battery life etc.", "Date": "April 8, 2013"}, {"Title": "Good detector", "Author": "Debbie Farley", "ReviewID": "R23IHN44VK1AI2", "Overall": "5.0", "Content": "Easy install. Goes hand in hand with the Carbon Monoxide alarm. I feel much safer replacing the units that had been in the house for about 12 years. Good price.", "Date": "March 30, 2013"}, {"Title": "Keep your home safer", "Author": "KC Saabway", "ReviewID": "R1Y6KSST0KBZ1O", "Overall": "5.0", "Content": "This combo unit was a very good price, easy to install and works very well. Easy to see their excellent quality", "Date": "March 29, 2013"}, {"Title": "Works great", "Author": "Kris Orange", "ReviewID": "R16TCKCSL8MOL", "Overall": "5.0", "Content": "This smoke alarm is easy to install and does not give false alarms from things such as the slight amount of smoke from blowing out a candle. It can be silenced by pushing a button in case of alarm from kitchen smoke or insense which is a nice feature.", "Date": "March 28, 2013"}, {"Title": "Best Alarm", "Author": "E. Deboraha Pusateri \"Sibelady\"", "ReviewID": "RV73Y1DCZ39XU", "Overall": "5.0", "Content": "This is a great and most reliable type of smoke alarm and well worth the cost. If you are going to buy an alarm- make sure it has BOTH types of sensors.", "Date": "March 24, 2013"}, {"Title": "A little faulty", "Author": "Sean E. Elias", "ReviewID": "R349UQ0DGP2GBN", "Overall": "3.0", "Content": "The package was in great condition and it was real easy to install.  The alarm goes into test mode without issue, blinking red.  However, the flashing green LED for normal operation does not seem to be there.  It must be a bad green LED, because I've tested it several times without issue.  On the plus side, the battery compartment that slides out without needing to remove the alarm from the ceiling mount is real nice.  Let's just hope the trouble chirping will start when the batteries start to dwindle.", "Date": "March 19, 2013"}, {"Title": "Works good", "Author": "Robert P. Wolfe \"foxiewolf\"", "ReviewID": "R3EKI5CLV592GC", "Overall": "5.0", "Content": "I no longer get false alarms when I cook.  Recommend this device for in close apartment living.  Three more words.", "Date": "March 14, 2013"}, {"Title": "I will order more of this item", "Author": "My gift list for 2014 \"Grams\"", "ReviewID": "RIZFV9F712NFE", "Overall": "5.0", "Content": "Everyone needs this type of smoke and fire alarm.  Plan to put one in every bedroom after seeing reviews smoke detectors which don't detect fires, just smoke.", "Date": "March 12, 2013"}, {"Title": "Works well, gives my wife peace of mind", "Author": "SteveMST", "ReviewID": "RJR0L3BWFEQJW", "Overall": "5.0", "Content": "I sent this to Chile so that my mother-in-law could have it installed in her apartment. She has a poor sense of smell and tends to leave the stove on, so this unit is perfect since it lets out a loud alarm if there is any smoke detected.", "Date": "February 18, 2013"}, {"Title": "Easy Install", "Author": "Jason Baker \"Jason Baker\"", "ReviewID": "R3FT129BLT8AS", "Overall": "5.0", "Content": "I bought this to replace out-of-date units. It installed easy and tested like it should.Just install the base; insert the brains; and twist.  You're done.The price on Amazon was cheaper than any box store.  I highly recommend.", "Date": "February 13, 2013"}, {"Title": "We're Safe!", "Author": "jotitdown", "ReviewID": "RIQMB1UGM66I3", "Overall": "5.0", "Content": "The state of Washington now requires a carbon monoxide detector in new homes and when selling any home.  So, off to Amazon I went and found the combo smoke alarm AND carbon monoxide detector.  The alarm looks just as pictured and is fairly unobtrusive on the wall.  It was super easy to install and tested just fine, real loud, but fine - you will not sleep through this alarm.  Hopefully I will never need it ....", "Date": "February 12, 2013"}, {"Title": "Works for Me...", "Author": "J. Bentley \"jimib33\"", "ReviewID": "R3DXS07FG26T9C", "Overall": "4.0", "Content": "Researched it before buying. Got what I wanted.Tested it and all works fine. Good protection ata good price.", "Date": "February 9, 2013"}, {"Title": "Perfect", "Author": "Ofra Sharon \"Shadow's Mom\"", "ReviewID": "R3TBQTVC2J06O9", "Overall": "5.0", "Content": "Thank you very much.  The unit was exactly what I needed for my basement ceiling.  It is a great product.", "Date": "February 4, 2013"}, {"Title": "works great, good value!", "Author": "Teresa M. Kreitzer", "ReviewID": "R1W175KG32NWWK", "Overall": "5.0", "Content": "works great, great value, we bought a 2 pack. easy to install.  still working great after a year. everyone needs this.", "Date": "February 2, 2013"}, {"Title": "Great item.", "Author": "Curtis Bard \"c.bard\"", "ReviewID": "R3H8ZC7MZKTSEG", "Overall": "5.0", "Content": "Great item. Does both types of detection - a must have for proper smoke / fire warning!Does the job well.Nice transaction and great seller.I would recommend this item to anyone who needs one of these.", "Date": "January 21, 2013"}, {"Title": "good smoke alarm", "Author": "CDR", "ReviewID": "RGUA0BGGTJQ1P", "Overall": "5.0", "Content": "I saw some firemen on TV talking about home safety and REALLY recommending dual sensors.  the photoelectric senses smoke much quicker.", "Date": "January 20, 2013"}, {"Title": "Features I wanted--good brand", "Author": "jcrews", "ReviewID": "R2IACMBBKGSON2", "Overall": "4.0", "Content": "Okay price. I  dont know about reliability or battery lifeWill update if have problems. Searched several brandsfound this to be okay price.", "Date": "January 17, 2013"}, {"Title": "Seems to be a nice unit, easy to install", "Author": "H. S. Overman", "ReviewID": "R2Q7U2MDERU0SI", "Overall": "5.0", "Content": "I bought three of these to replace some really old units that I installed in our house 30 years ago.  They were very easy to install.  I had hoped that the holes might match the older units, but they didn't, because these units are slightly smaller in diameter than the older units.  Definitely not a big deal.  Units come with a \"lock pin\" (plastic) that makes them harder to remove once installed (maybe for rental property where theft might be an issue?).  Installing this is not necessary for proper mounting, so i did not bother.  Battery door is easily accessible.", "Date": "January 14, 2013"}, {"Title": "Double-sensor smoke alarms", "Author": "mingjack", "ReviewID": "R2BDX4PY6ACFG5", "Overall": "4.0", "Content": "Bought as replacement for old units. Fortunately, I have not experienced their utility. Units seem to be well-made, and installed easily.", "Date": "January 11, 2013"}, {"Title": "Annoying", "Author": "Jaromir Kovarik", "ReviewID": "R2N6IJ2MKR77G2", "Overall": "2.0", "Content": "Installation and look are OK.  However, the visula  and audi features are confusing.  I ams till not sure if the sytem is signalling that it is alert and functioning properly or that there is a malfunction.  Manual does not help much.  Would not buy this one again.", "Date": "January 2, 2013"}, {"Title": "First alert sa320cn", "Author": "keith van meter", "ReviewID": "RE1QCWQFSOVC4", "Overall": "5.0", "Content": "Ordered 2 of these detector.  No problems installing and have had no false alarms like I had with our old units.  Testing indicates that they are working fine.  Remember to change out every 10 years", "Date": "December 28, 2012"}, {"Title": "good fucntion", "Author": "Satoshi Mochizuki \"TM\"", "ReviewID": "R3QXVCLYPZ6KT", "Overall": "5.0", "Content": "Excellent choice. I do not understand why this type of sensors is not mandatory.  The price difference is minimal and every house hold should have it.  This is also easy to install.", "Date": "December 28, 2012"}, {"Title": "no false alarms yet.", "Author": "Bvus", "ReviewID": "R3U4XN6PYZO0HV", "Overall": "5.0", "Content": "My existing First alert conventional detector was going off all the time.  I switched it with this one and the false alarms have stopped.", "Date": "December 27, 2012"}, {"Title": "Safe & Sound!", "Author": "Nanette", "ReviewID": "R1J8W32K8U12JZ", "Overall": "5.0", "Content": "I needed to replace a smoke detector that did not have the carbon monoxide,and after searching the reviews I decided on this one.  I have not had to useit (which is a good thing!) in a fire, but I feel safe knowing I have a duo detector!", "Date": "December 26, 2012"}, {"Title": "Seems to work.", "Author": "Keleh", "ReviewID": "R2L2BBEF25TF7Q", "Overall": "4.0", "Content": "It is easy to install, and tested out OK. If it ever saves me from a fire, I will give it five stars.", "Date": "December 26, 2012"}, {"Title": "Great ratings from testing labs", "Author": "Over 65 in Texas", "ReviewID": "R2E0ZFFHN7XCXB", "Overall": "5.0", "Content": "I bought these after I saw a news clip about a family dying in a hone with the ionization only smoke detectors.  These detect both smoldering and burning fires.", "Date": "December 21, 2012"}, {"Title": "BOY IT IS LOUD", "Author": "EMILY MA'RY", "ReviewID": "RROPDYQKUJGU5", "Overall": "5.0", "Content": "SAW THIS ADVERTIZED ON TV AS THE BEST THERE IS.  SO I FIGURED I BETTER TRY IT.  IT IS ALL I EXPECTED AND MORE.", "Date": "December 19, 2012"}, {"Title": "Easy to install", "Author": "E. Zalisko", "ReviewID": "RD6L8AHGF5FJS", "Overall": "5.0", "Content": "I bought a household of these. The dual function is good safety. Just price compare to be sure you are getting the best buy.", "Date": "December 18, 2012"}, {"Title": "Double sensor a must!", "Author": "S. E. Weatherby \"weterb\"", "ReviewID": "R32IXC6MVEJ4F6", "Overall": "5.0", "Content": "A double sensor system is a must. Ion and photo give much better protection from fire. Item is easy to hang.", "Date": "December 4, 2012"}, {"Title": "A solid smoke dector", "Author": "Donald L. Wood", "ReviewID": "R1Q2AZO3VI90CM", "Overall": "5.0", "Content": "Easy installation. The battery compartment makes it easy to change batteries. The double sensor makes this alarm the top of line.", "Date": "December 3, 2012"}, {"Title": "A must have two sensor detector for everyone", "Author": "A. Ziolkowski", "ReviewID": "RWGV70AR7CRQO", "Overall": "5.0", "Content": "After hearing news reports of how most smoke detectors do not work to detect many fires, I rushed to replace all our smoke detectors. Even though I just replaced them all when we moved into an older home 18 months ago. I just hope we never need to use them.", "Date": "December 2, 2012"}, {"Title": "First Alert SA320CN Alarm", "Author": "Skeptic", "ReviewID": "R29RPKSCAK7BUP", "Overall": "5.0", "Content": "We put six of these into operation in July. They were easy to install and test. We have not had any false alarms in the 4+ months they have been activated. We are very pleased with these units, and I would definitely purchase this model again.", "Date": "November 29, 2012"}, {"Title": "Bought 4, All Worked Well", "Author": "RightReviewNow", "ReviewID": "R1CWIF18UVQS0F", "Overall": "5.0", "Content": "I bought 4 of these alarms and have had no problems with any so far.  Dual sensor is a must for safety, even though the price is a little high in my opinion, still worth purchasing.", "Date": "November 27, 2012"}, {"Title": "Great Product", "Author": "OhYouKnow", "ReviewID": "RTQFG8PFFATVV", "Overall": "5.0", "Content": "Dual Sensors are othe only way to go!+++ = (At this time) Easy to install and test- - - = Non at this time.", "Date": "November 27, 2012"}, {"Title": "Easy to install", "Author": "M. J. Veteto", "ReviewID": "R2DB0UKN1QD8LY", "Overall": "5.0", "Content": "I had seen news programs about installing dual sensor alarms being much safer. We were due to replace our current alarms so I went looking and found this one.  It was easy to install and tests great.", "Date": "November 27, 2012"}, {"Title": "Bought two", "Author": "Doug \"Douglas Luther Rothenberg\"", "ReviewID": "R1WHVHODL2QE8K", "Overall": "5.0", "Content": "I bought two based on the other reviews. My existing alarms worked when I had a recent problem with my water heater and called 911, but I wanted to make sure that I had both types of smoke detectors on each floor in addition to my CO2 detectors.", "Date": "November 24, 2012"}, {"Title": "First one, DOA. Second works great.", "Author": "Andrew Dejong", "ReviewID": "R1KZ2SHOOWIT6", "Overall": "4.0", "Content": "I ordered one, which was damaged on arrival. The unit sounded three chirps every couple of minutes. Of course, there was nothing in the manual to indicate what that might mean. Finally I saw online that three chirps meant an internal defect in some other first alert alarms. So I filed a return/replacement with amazon. The second device works great (I.e. tests well. Haven't had to use the smoke dection yet.)", "Date": "November 24, 2012"}, {"Title": "First Alert for smoldering fires", "Author": "Gigi", "ReviewID": "R2U350WSSIW7W0", "Overall": "5.0", "Content": "Hopefully we will never need it, but since we recently escaped a smoldering fire by luck, I don't want like to take a chance. I like that this detector has side slide for battery.", "Date": "November 21, 2012"}, {"Title": "Early Days but looking really good", "Author": "Bob", "ReviewID": "R2GXRY0E6D89F6", "Overall": "5.0", "Content": "Just got it and installed it today. Compared with home center products this model is really quality. The directions and lawyereese cautions just go on and on, but the product is there. It weighs twice as much as the el cheapos at Home Depot. Funny detail, the instructions say to use only with Ever Ready AA type E91 batteries, But it comes with a pair of AA Duracells. I have thrown away so many smoke detectors, I hope this one stays around. The cheap detectors I've been using for decades were bought on special at a little over $10 at kMart or some such place, but they start falsing in a year or two, and their replacement 9v batteries don't fit in well. I'm replacing three of those types (which still work when I blow tobacco smoke at them) with three more of this model. Having both technology types in the one detector should be a law. My family's worth it.", "Date": "November 15, 2012"}, {"Title": "perfect for my home", "Author": "M. David \"emsgirl\"", "ReviewID": "R2KUVFTGU8QS9E", "Overall": "5.0", "Content": "After learning more about double sensor fire/smoke alarms, I felt this was the product to fit my needs. Also, First Alert being a trusted Brand name, and I must so far I'm more than pleased knowing I have this protection throughout my home.", "Date": "November 14, 2012"}, {"Title": "Dual sensor smoke alarm", "Author": "J. Lilly", "ReviewID": "RGCUCKQUMVL82", "Overall": "5.0", "Content": "Working as advertized....so far.Arrived quickly, well packed. etc etc etc etc etc etc etc etc etc etc etc etc", "Date": "November 14, 2012"}, {"Title": "Great Alarm", "Author": "William P. Provias", "ReviewID": "R7CWUKZ064EQ2", "Overall": "5.0", "Content": "Tried it out already and works great!! We only had it up 2 days when they came to install a new furnace and it went off from them trying out.", "Date": "November 11, 2012"}, {"Title": "dual alarms", "Author": "ROJAN", "ReviewID": "R21ISZJ58WK46E", "Overall": "5.0", "Content": "we purchased these alarms to replace the singles we have had for quite some time.  These fit in the same footprint requiring no new holes and no touch up required for a great cover-up installation.Product is great with AA batteries instead of the 9 volt in the old ones.", "Date": "November 5, 2012"}, {"Title": "Works as Intended", "Author": "mav", "ReviewID": "R3G7YSQDUMQHEG", "Overall": "5.0", "Content": "Great product that works as intended.  Tested product after installation with several types of smoke, responded quickly and accurately.  Easy installation, ease of access to batteries is a plus.", "Date": "November 5, 2012"}, {"Title": "super simple installation", "Author": "Mary H.", "ReviewID": "R5NJ2HQWB6MN1", "Overall": "5.0", "Content": "I guess I'll give this 5 stars even though I hope to never see if it actually works.  It was so easy to install.  Really well thought out.  And the little battery drawer will make changing the batteries easy also.", "Date": "October 2, 2012"}, {"Title": "Very good product", "Author": "Ricky New", "ReviewID": "RZUDB9U5NT2W3", "Overall": "4.0", "Content": "This appears to be a very good product at a reasonable price.However, it would be even better if the Green indicator light would be brighter since the unit is mounted on the wall fairly high to see easily.", "Date": "August 19, 2012"}, {"Title": "Outstanding Product", "Author": "P. Waxler \"khane9\"", "ReviewID": "R23CXNZLT4KIF9", "Overall": "5.0", "Content": "I bought this for my home, the alarms arrived when promised they all work and came with their own batteries.  Thank you first alert for a great product and the piece of mind", "Date": "May 23, 2012"}, {"Title": "First Alert SA320CN Double Sensor Smoke/Fire Alarm", "Author": "James D.", "ReviewID": "R1ITREAEP7OD1Q", "Overall": "5.0", "Content": "We bought this to supplement our other alarms.  Having both types of sensors (ionization and photocell) provides coverage for both flaming and smoldering type fires.  There have so far been no false triggering on this alarm.", "Date": "April 14, 2012"}, {"Title": "Happy with this purchase..v. easy to do", "Author": "Kathy", "ReviewID": "R1JROLYCCW9M3X", "Overall": "5.0", "Content": "The purchase came through very quickly & was easy to do. Very happy with the product! Would recommend this product as it works very well.", "Date": "March 5, 2012"}, {"Title": "Great product", "Author": "your home", "ReviewID": "R1BXEL4YFOUKPL", "Overall": "5.0", "Content": "this is a great ideal for a smoke and fire alarm all in one,  i love how easy it was to put up, it a great ideal for your home.", "Date": "February 8, 2012"}, {"Title": "Very gooid smoke detector", "Author": "D. Lewis", "ReviewID": "REHZS25T9TDMM", "Overall": "5.0", "Content": "Excellent product and the price was very good.  Shipped on time and arrived in proper condition.  I would buy the item again when I need to.", "Date": "February 8, 2012"}, {"Title": "Replaced two old alarms with two of these", "Author": "Steven J. Sprigler", "ReviewID": "R2Y44JRFL4ZLOL", "Overall": "5.0", "Content": "I've had two of these since around the end of June 2011.  I've yet to have a single issue with them and I've tested them twice since purchase.  The installation was super easy and took maybe 5 minutes total to install both units.  The convenience of being able to use AA batteries too is a huge plus over more expensive 9V batteries.", "Date": "February 6, 2012"}, {"Title": "Easily Set Off By Shower Steam - Broken!", "Author": "PenguinSage", "ReviewID": "RIZZIJBIIMO5C", "Overall": "1.0", "Content": "Double-sensor alarm? Fantastic! I'll be extra safe. Heck, I'll take 2! One for the main floor of my home, and one for the basement! I am awesome for getting such a great piece of safety equipment!Such were my thoughts for the first 3-4 weeks of having this smoke detector installed.And then...One night a very steamy shower sets off the smoke detector, which is in the hallway outside the bathroom. I chide my husband for his ludicrous amount of steam and scoff that it's not possibly the fault of my precious new smoke detectors (did I mention they have dual sensors? DUAL SENSORS! I'm so safe and awesome). Maybe he shouldn't take such prissy showers!Then I took a shower the next morning. And fearing mockage, I kept the shower a little cool, and secretly opened the window to fan out all the steam I could before opening the bathroom door. I was ready to be smug about the perfection of my smoke detector. Door opens, and BEEEEEEEEEEEEP! The thing goes off. Crap. I swear, take the thing down and put it back up later that day.Next morning I shower, cranky, grumbling about the smoke detector, and while I'm still in the shower with the bathroom door closed, it starts going off. BEEEEEEEEEEEEP! Double crap. The thing's broken and getting worse.Husband is kind and insists that it's probably just defective or a spider crapped on the sensor or something. And, look! We have another one still in its package that we can install, tossing out the \"old\" one. Hooray! Safety returns. I even forget about the smoke detector and don't even feel jumpy during my next shower 2 days later. Then just as I'm lathering the shampoo: BEEEEEEEEEEEEEEEEEEEEEP! Holy mother of crap!LESSON: These detectors are VERY sensitive to steam. I'm sure they also do a great job detecting fires, but in a small ranch-style house where there aren't many \"ideal\" places to put one of these things, this just won't work. Now I'm out money and a little freaked out about showering.", "Date": "September 12, 2013"}, {"Title": "Not entirely happy.", "Author": "Dave", "ReviewID": "R2MH8TLI1RC2SK", "Overall": "2.0", "Content": "Bought two of these and one of them crapped out after a year.  It kept going off, so I changed the batteries several times and it still kept going off.  I have no idea what was setting this thing off.  My other one is still going strong so I guess this product is a hit or miss.", "Date": "November 9, 2013"}, {"Title": "smoke detector", "Author": "Mike", "ReviewID": "RXGQ4XD6LZ3GO", "Overall": "5.0", "Content": "Not much to say. It seems to work when I test it. It's loud and works when I test it with the test button. Hopefully I'll never have to find out If it really works. It senses two kinds of smoke particles for better protection. Its a name brand and it was easy enough to install. It came with plastic anchors and mounting screws.", "Date": "January 22, 2014"}, {"Title": "Senses boths types of fire", "Author": "Jf", "ReviewID": "R1DJIQEL4KCQGF", "Overall": "5.0", "Content": "Great smoke detectors. These can detect both smoldering and burst fires. I bought several for my entire house, all are working well.", "Date": "November 3, 2013"}, {"Title": "Maybe I'm wrong THIS SEEMS TO BE A GOOD ALARM", "Author": "of california", "ReviewID": "RMATTC9ZZUX81", "Overall": "5.0", "Content": "I was impressed  when I received this detector looks very well done I hope it works as good as it looks ...", "Date": "October 14, 2013"}, {"Title": "Seems good", "Author": "Arie Ripley", "ReviewID": "R7MBC8WIF9UK2", "Overall": "4.0", "Content": "Easy to set up and to install.  Too early as ye to todetermine how well it operates.  Time will tell", "Date": "September 21, 2013"}, {"Title": "Good news for packaging-challenged!", "Author": "Robert M. Freedman \"Admirer of I.S.\"", "ReviewID": "R2F7VM9PLV0T4L", "Overall": "5.0", "Content": "I am replacing each Kidde alarm in the house with a First Alert SA320CN Double Sensor Battery-Powered Smoke and Fire Alarm.The good news is that I can actually open the secure hard plastic packaging without having to employ a knife or industrial weight shears or a torch of some sort.There is a place into which I can insert my thumb or other digit of choice and pull back the covering sheet of plastic. And then I can just lift out the item; no rivets, no hidden twisties, no molded shapes obstructing the removal of the alarm.  One great victory for the packing-challenged! My deep gratitude goes out to the designer.", "Date": "August 28, 2013"}, {"Title": "Now I feel safer...", "Author": "Florida Pat", "ReviewID": "R2MDFFZJ4QPZ6O", "Overall": "5.0", "Content": "Our hard-wired home smoke/fire alarms are mounted about 12' up which makes them almost impossible to test or change batteries. These First Alert SA320CN Double Sensor Battery-Powered Smoke and Fire Alarms were easy to mount just over the doorways, under the existing alarms. Now I feel safer.Definitely don't hesitate!", "Date": "December 31, 2012"}, {"Title": "Very Good", "Author": "Ken S.", "ReviewID": "R2U58OO445656Y", "Overall": "5.0", "Content": "Received 1 day early. Easily installed (45 minutes for all 4). Tested with smoke,fire, and with button. No holes drilled as they fit right into the old alarm holes. They have been in use for 3 weeks and no false alarms. I am very satisfied (unusual for me). They do not have a carbon dioxide alarm and were not advertised as having such. In my case, it is not needed as I have an all electric home and a detached garage. The price was good too. Having 2AA batteries is a bonus.", "Date": "December 29, 2012"}, {"Title": "Easy installation", "Author": "J. Green", "ReviewID": "R2NIWAAGN4NPLP", "Overall": "4.0", "Content": "There was Kiddle Sensors installed in this house and where old.  Decided to go with the First alert as it has the same warranty, life expectance but at a better price. Also I do not have to have one sensor for fire and another one for Gas", "Date": "May 24, 2014"}, {"Title": "Recommended", "Author": "JR-6", "ReviewID": "R72NZ70ZLBN6T", "Overall": "5.0", "Content": "Smoke detector was easy to install. It is quite sensative. Batteries are easy to replace.The price is reasonable and the packaging was excellent.", "Date": "January 28, 2014"}, {"Title": "First Alert", "Author": "sandra tavela", "ReviewID": "R3508UHDZ8HPIF", "Overall": "5.0", "Content": "We replaced our old first alert smoke and fire alarm with this new first alert smoke and fire alarm.  We like the new one.", "Date": "January 3, 2014"}, {"Title": "It works.", "Author": "BillP", "ReviewID": "R1ZZ80AFVFIHSZ", "Overall": "4.0", "Content": "I put it in the corner of the kitchen and it goes off when something is burning in the toaster.  I had a little trouble with the \"hush\" button but possibly I wasn't holding it down long enough.", "Date": "November 21, 2013"}, {"Title": "Combines photo electric and ionization sensors in one alarm that can be AC powered", "Author": "Ogilvie", "ReviewID": "R1WX5X4SMHO4L2", "Overall": "4.0", "Content": "One of the very few alarms that combine photo electric and ionization sensors in one alarm (one can detect smoke, but not flames, the other can detect flames, but not smoke) that can be AC powered and linked to other household alarms. Will this cause a myriad of false alarms that traumatize the whole family? Only time will tell", "Date": "November 19, 2013"}, {"Title": "False alarms near kitchen, bypass feature unreliable", "Author": "Paul", "ReviewID": "R3L8PC57K798DA", "Overall": "1.0", "Content": "I bought this 4-pack for the whole house and have no issues other than in the hallway to the kitchen.  I selected this one due to good reviews on average and because of its dual sensor and bypass features.My wife cooks frequently.  After I installed one of these units in the hallway off the kitchen my wife would frequently complain that the bypass feature to disable the alarm did not work for her.  I was there one time when this happened and for me it stopped and then I went to another room.  But she swears that it only works this way half the time.My wife has since taken the battery out due to the false alarms and the bypass feature not working for her.  So now I have to seek out and try other brands.  I wish I had not bought a 4-pack in the first place.  I can only hope that ones that I installed in other areas of the house are just as sensitive as this one and that they do what they are supposed to do if there is a fire of any sort.", "Date": "October 27, 2013"}, {"Title": "Easy to install, & no false alarms so far", "Author": "Jose R. Vazquez", "ReviewID": "R1T5G4PGKJD5Z9", "Overall": "5.0", "Content": "Easy to install, & no false alarms.Uses AAA batteries not the expensive 9v typesGreat price compared to local stores.", "Date": "August 1, 2013"}, {"Title": "Well, unless my house catches on fire, how could I have an opinion of this?", "Author": "Arnold Ziffel \"AZ\"", "ReviewID": "RYVWQAZ1QLDIJ", "Overall": "5.0", "Content": "So far, it appears to be working fine.  Again, if it's not working, how would someone know that?  I am replacing one that's 8 years old only due to flaky operation.  It's just not worth $25 to be unsure if you are protected.  I have discovered that drywall dust will ruin the sensors; the alarm goes off and no matter how much cleaning you try to apply, it will never shut up again.  If you are repairing drywall, wrap your smoke alarm in plastic til you are done.", "Date": "June 7, 2013"}, {"Title": "First alert smoke detectors", "Author": "Sharon Carroll", "ReviewID": "R39S1I0BFO71NC", "Overall": "5.0", "Content": "We were looking for new smoke detectors for our motor home and these seemed to fit the bill.  We were pleased at how quickly they arrived.", "Date": "May 9, 2013"}, {"Title": "required headline", "Author": "irish_setter", "ReviewID": "R3W3KZ200F3M8Y", "Overall": "5.0", "Content": "Tests great and I hope I never have to get actual use out of it.  This is the next five words required (six actually, now ten)", "Date": "April 2, 2013"}, {"Title": "Functionally OK", "Author": "XiMiX", "ReviewID": "R1UAAHLXJ3E920", "Overall": "4.0", "Content": "It works fine. It does not look good as other brands, though. It is sticks out more from the ceiling and more noticeable.It could look a little nicer.", "Date": "March 20, 2013"}, {"Title": "Trusted brand", "Author": "Bob", "ReviewID": "R2ARK3ENC018KB", "Overall": "3.0", "Content": "It looks good, Tests ok. No fires or smoke so How do I know if it will work I have to trust the brand", "Date": "March 1, 2013"}, {"Title": "Safety Always", "Author": "AmericanPatrick", "ReviewID": "R2U27ERUB9SY1I", "Overall": "5.0", "Content": "We changed out the household units to dual sensor. When we added another garage this unit only made sense. Be sure & change your battery every year !", "Date": "February 7, 2013"}, {"Title": "Easy to Follow Instructions", "Author": "Henz73", "ReviewID": "R37YAY89BF47Z6", "Overall": "5.0", "Content": "This product installed easily by following the manufacturer's instructions.  It tested successfully and appears to have been fully operational since installation.", "Date": "August 10, 2012"}, {"Title": "Bob G", "Author": "Robert S. Graham", "ReviewID": "R14C8270HEYCAY", "Overall": "5.0", "Content": "Purchased 2 double sensor smoke detectors and successfully tested same before installing. Time will tell how long the units will last but I have been very pleased with First Alert products in the past and don't expect any different results with this purchase.", "Date": "August 2, 2012"}, {"Title": "First quality Fire Sensor", "Author": "Henry Halladay \"Slide show creator\"", "ReviewID": "R24G2PZT9E7RV3", "Overall": "5.0", "Content": "The First Alert arrived promptly and was packed in a box with the original factory bax inside. The product was purchased as replacements for a failed sensor (years of use) and fit my existing fixture mount. The sensor set up was simple and the unit tested perfectly. The dual sensor I feel is important to home safety. I would certainly recommend.", "Date": "July 10, 2012"}, {"Title": "Easy to install", "Author": "joegrammer", "ReviewID": "R1UUAF8MTS9LKS", "Overall": "5.0", "Content": "I got tired of my old detectors going off during high humidity - they were a little over 10 years old.  Swapping these out was very simple and quick.  And no more false alarms.", "Date": "June 30, 2012"}, {"Title": "-Nice And Sensitive-", "Author": "SickLittleBoy", "ReviewID": "R22DPP46PIXNON", "Overall": "4.0", "Content": "Extremely sensitive. These are of good quality and work as advertised. I have 10 of these guys and have had absolutely no problems. Easy to install and are both Ionization/Photoelectric. Highly Recommended!!", "Date": "June 19, 2012"}, {"Title": "Great for it's value", "Author": "Amazon Customer", "ReviewID": "RZJ15RZGGQSF", "Overall": "5.0", "Content": "I purchased this for my Son's room, the install was easy and it looks great.This gives me a peace of mind knowing that if there is a fire in my Son's room I would know about it.I am very happy with this product and would recommend it.", "Date": "May 25, 2012"}, {"Title": "Ugly and impossible to see light", "Author": "Impetigo", "ReviewID": "R3NZERWKQZGZBB", "Overall": "2.0", "Content": "Low rating due to two things.First, this alarm is very unattractive due to it's octagonal type shape (e.g. not purely round) and the fact that it is quite tall.  The Kidde alarms are nice because they are a bit wider but flatter and sleeker.The second issue is the deal breaker for me, and that is the light that flashes every minute or so (to indicate that it's operating) is so tiny and hard to see that I have difficulty seeing it when standing right in front/under it.  Even in the dark it's very difficult to see, and good luck trying to see it from more than a few feet away or at an angle.  None of these issues with the Kidde Model Pi9010 Dual Sensor, Battery Operated Photoelectric / Ionization Smoke Alarm we went with (which is also a dual photoelectric/ionization alarm though).  In the Kidde alarm, the light that flashes is easy to see no matter where you are.I bought four of these First Alert alarms and returned three of them and will probably donate the first one I bought and installed.", "Date": "January 25, 2014"}, {"Title": "First Alert -First Rate", "Author": "Ronald Stiteler \"Ron\"", "ReviewID": "R9QKVJ7LKRJWY", "Overall": "5.0", "Content": "I have been using \"First Alert\" products for years & have always been confident they would do as advertised.They always have & if there was any problem the company was right there to take care of it. What more can you ask for ?", "Date": "December 24, 2011"}, {"Title": "Bad product", "Author": "Fred", "ReviewID": "R1UYIKJ8G5CLMP", "Overall": "1.0", "Content": "After one month the batteries went dead. Put in new batteries, and a week later I was getting low battery signal. The green indicator does not come on, that means it's not active.", "Date": "September 21, 2012"}, {"Title": "great safety item", "Author": "debbie m", "ReviewID": "R29MK0RWRXRQ2P", "Overall": "5.0", "Content": "We just wish that it also contained a carbon monoxide detector and didn't think about that when ordering this item", "Date": "May 17, 2014"}, {"Title": "First Alert", "Author": "D. SMITH", "ReviewID": "RS275H49EN62Y", "Overall": "5.0", "Content": "I have not bought a newer model in a long time and the price of this was really good. Hopefully I won't have to find out how well it will work.", "Date": "April 14, 2014"}, {"Title": "Very good product", "Author": "Brian J", "ReviewID": "R1RS0O2FPZUGB4", "Overall": "5.0", "Content": "They came a a timely fashion...I like the Idea of the double sensor....They came with batteries but after reading other reviews I put the lithium batteries in hoping they last a little longer......easy to install. kept the old smoke detectors in place and put up new ones...very good product....hope I never need to use them......", "Date": "November 19, 2013"}, {"Title": "defective out of the box", "Author": "Andrew", "ReviewID": "R2ZSBUTGJ9INTC", "Overall": "1.0", "Content": "Item went off a few seconds after putting the batteries in. I am not sure if it was a defective test button or if the unit really was sensing smoke when there was none. The red LED light blinked two seconds on, two seconds off.", "Date": "November 5, 2013"}, {"Title": "First Alert Double Sensor Smoke Detector", "Author": "D. Ives \"Dave_I_WI\"", "ReviewID": "R228LN0WHV6AQ0", "Overall": "3.0", "Content": "Installed ok. Haven't tested it. Assume it will work as advertised. Easy to follow instructions. Hard to open plastic package", "Date": "July 27, 2013"}, {"Title": "easy to replace older units", "Author": "J. Labore", "ReviewID": "R3PE74AWHND4GO", "Overall": "5.0", "Content": "No way to review on the performance since we have not had a fire. This review is based on price and ease of installation and ease of battery replacement.  They were very easy to install.  I had to drill one new hole since the patterns did not match the old units but that takes all of 30 seconds. Be sure to wear safety glasses or you will have drywall dust in your eyes.  The main reason I bought them is because they have the dual sensor which is the only type our local fire department recommends.  They came in the hard to open clam shells.  A four pack in basic cardboard packaging would be a great option.  The battery tray slides out which is not good or bad. just don't bend it and break it off. I suppose you could replace the batteries without un-mounting from the ceiling but why bother. They are very easy to unscrew from the ceiling mount so it will be a snap to replace the batteries.", "Date": "September 12, 2012"}, {"Title": "Not as described on line", "Author": "frog309", "ReviewID": "R3QPOI6K8AM4MB", "Overall": "2.0", "Content": "Listed as having a remote mute feature. I did not. That feature was why a purchased. I returned for a refund.", "Date": "December 5, 2012"}, {"Title": "Shop online first!", "Author": "bmw325alex", "ReviewID": "R3G4KRPKQ7UIC8", "Overall": "4.0", "Content": "I purchased this odd item and various other items for less than %50 of list store price. Always shop online first!", "Date": "May 16, 2013"}, {"Title": "What a deal.", "Author": "Jim", "ReviewID": "R1T552TEW1CJ8K", "Overall": "5.0", "Content": "This is amazing. I shopped in my neighborhood first. Then found a super deal on Ebay. I'm now an Ebay fan.", "Date": "January 25, 2014"}, {"Title": "Nice Smoke Alarm - shipped QUICK too!", "Author": "Geno \"Geno\"", "ReviewID": "R1ZCJMX79YCB49", "Overall": "3.0", "Content": "So far so good - the test button works and the alarm is nice and LOUD.  I hope I NEVER have to find out how well it works but hopefully it provides the protection that it advertises.", "Date": "January 4, 2014"}, {"Title": "as expected", "Author": "K from Minnesota", "ReviewID": "R1PT3TQE7FQO78", "Overall": "5.0", "Content": "I received the products as ordered, they arrived when expected and were just what I had ordered.I would order from Amazon again with out any questions.", "Date": "December 7, 2011"}, {"Title": "Not a Carbon Monoxide Detector", "Author": "Language Learner", "ReviewID": "R2KT60O987HMC1", "Overall": "3.0", "Content": "This is not a Carbon Monoxide DetectorI bought it because I thought dual meant smoke and carbon monoxide sensors but it means 2 ways to detect smoke (which may well be a very good thing-but if you want carbon monoxide protection this is not the one).  Also the packaging says “The #1 Most Trusted Brand In Smoke, Fire and Carbon Monoxide Protection.” Key word = brand, so it is misleading.I think more explanation is necessary from somewhere. Do we need both this dual sensor type smoke alarm and carbon monoxide sensors side by side to best protect ourselves?", "Date": "November 30, 2013"}, {"Title": "It works I guess", "Author": "David G. Haddad \"Dave\"", "ReviewID": "R10ZU1SWS83CRX", "Overall": "3.0", "Content": "Seems to work. Installs easily.Need to fill up this box so I can submit. I have not actually tested it beyond the button", "Date": "February 17, 2013"}, {"Title": "I would use another character.", "Author": "Faded", "ReviewID": "R2FTT534NQOPF7", "Overall": "2.0", "Content": "First of all, I have to say that this product is overrated and falls outside the Top 10. When I first opened it from its packaging and finished mounting it to the ceiling, it began shaking and canceling into a drop to the floor. This is very unsafe. Not only can it fall on someone's head, but it can't even block for several frames.When it was finally installed, I admit, I felt safe. Using this product, I felt confident that I could parry any fires, and reset the situation anytime. But then I realized this is just one MU. When the time came to put this product to the test, it failed to deliver. My first match was against the Carbon Monoxide that built up in my apartment. Once it got in, there was nothing I could do except cancel my pokes into a Smoke Away, but my options were too limited, I was pressured to death in the corner, and ultimately sent to Losers Hospital because of CO poisoning, which isn't a surprise due to this mediocre Smoke alarm.I later discovered that it can't detect other conditions that frequently occur in my home either, including the intoxicating fumes of my cat's poop, approaching tornadoes, and Kabal. I can only see it working on Noob-level fumes.Overall, I would only recommend this Smoke alarm for casual play, but not to win majors. It has too many losing MUs against common natural conditions to be considered tournament viable.", "Date": "March 19, 2013"}], "ProductInfo": {"Price": "$59.99", "Features": "Utilizes both ionization and photoelectric smoke sensors for optimal performance\nIntelligent sensing technology reduces non-emergency or nuisance alarms\nOperates on 2 AA batteries (included)\nOptimized sensor performance for the most nuisance-resistant dual sensor alarm on the market", "Name": "First Alert SA320CN Double Sensor Battery-Powered Smoke and Fire Alarm", "ImgURL": "http://ecx.images-amazon.com/images/I/417UXyEN7kL._SY300_.jpg", "ProductID": "B004TSK9TG"}}