{"Reviews": [{"Title": "Awesome system for the price!", "Author": "Josh", "ReviewID": "R25CCOD1O3RT79", "Overall": "5.0", "Content": "So I bought this system based upon price, and a few other reviews. We've been having some vandalism in our area recently, and if something was going to happen to me, I was going to be ready and catch this hoodlum! I installed all 8 cameras and the DVR in just one Saturday. (wires ran down the wall and everything). The color quality isn't perfect, for example, the green's look a little purple; but still do-able. The DVR interface is easy to use, the manual on the other hand wasn't written very well, topics jump all over the book. I had to use YouTube to find out how to do a lot of stuff because the manual just didn't make a lot of sense. Anyway- DVR easy to use, everything, easy to install, video quality- pretty good, Night vision quality- pretty good. NOTE though: for areas like a small deck or patio, small front porch the cameras illuminate these area's very well, you can see fine; however, if you want to see in the dark with these cameras covering your yard, you will need a IR illuminator to light up the area so the cameras can see in the dark.Overall- I highly recommend the product for a small business, or home owner who wants to watch their property. You can't beat the features, quality for the price.", "Date": "September 27, 2011"}, {"Title": "cameras are great...instructions stink", "Author": "remo", "ReviewID": "RQ57ONOBAZ5PZ", "Overall": "3.0", "Content": "the system is pretty awesome.  camera placement was real easy. the mounts are super lightweight and the cameras are easy to install. with a jacket that has a lot of pockets and a drill attachment that slides over the mounting screw heads to hold them in place, being high up on a ladder's a cinch.  the cables are really easy to plug together and if you're using a regular monitor, the dvr is super user friendly.....Now for the cons: you might as well throw out the instructions for internet viewing...they are basically in another language with the horrible English.  I have two words for the ZModo people...SPELL CHECK...Anyway, I went on youtube and found some standard DVR Remote Viewing instructional videos and with a little playing around it was successful.", "Date": "February 2, 2012"}, {"Title": "Good product for its value", "Author": "R.R \"iLuvSeafood\"", "ReviewID": "R3BYLX2YVJLUJO", "Overall": "4.0", "Content": "I Received zmodo 8 channel camera quickly from wennow. Amazon shipping took too long. I did a lot of research around and finally decided on this security camera system because it has 4+ star rating. The previous reviews were positive about this product. The setup is easy and it is ready to be used out of the box. For 8 camera system, 300 dollars are very good price, compare to the same system which will cost around 600 dollars.  I installed this system in my little shop. The camera quality is good, works ok during the day. The camera works best when the object of recording is within 5 to 10 feet range in a bright setting. It is not that clear for anything 20 feet away. Maybe the outline of the object is clear but you will not be able to tell the license plate number more than 20 feet. The night vision works better if a illuminating light source is used at the same time. For the price of this system, the image quality is acceptable. This system can be used as baby monitor. For its value, it can beat other baby monitor products valued at 200 dollars.  I will give is system 5 stars only if the network setup can be easier. The system didn't have detailed network setup instruction. The Manuel contain little information on how to use this system. It is very difficult to setup the network if you just looking at the Manuel and doing tons of research online. For beginners if you like to view your camera from you computer over the same network, you need to install the software from the small disc and do the ip configuration too. There is a more detailed instruction from YouTube which tells you how to setup the network locally. I gave up the wireless network setup because it is beyond the ability of a college graduate. There is no instruction on that anywhere in the package.  Anyway, it is a good system for its value and the network setup instruction sucks!", "Date": "May 12, 2012"}, {"Title": "So Far So Good", "Author": "Jamie", "ReviewID": "R2XLOO89PVYQAX", "Overall": "4.0", "Content": "This product was promptly delivered.  However, there was a problem.  The instructions to unlock the box were not included.  I returned the first one thinking it was a faulty box.  When the second one did not function either, I called Zmodo and was given instructions on how to unlock.  It was easy to set up, the video quality is good, and I'm really impressed with the software that allows me to watch and review over the internet or even my Iphone.  Overall, I would recommend this product but make sure you have the instructions to unlock the DVR.", "Date": "November 8, 2011"}, {"Title": "Decent product", "Author": "L. Ford", "ReviewID": "R1YYFS0VB9EGD9", "Overall": "4.0", "Content": "Received this DVR and cameras last week.  The DVR seems to be ok, but time will tell.  Camera's are a little cheap but surprisingly give decent color after adjusting hue and saturation.Connecting to my network was easy but I'm having problems with the web display.  Internet explorer will not connect consistently, and the downloaded software will not connect at all.I spent over an hour on  chat with tech support in China.  The guy was very patient and helpful and even spoke better English than some of my friends.If you are looking for great quality video, this is not the system for you.  If you want decent video and the peace of mind security, then this will do the trick.Update - After playing with the video format in teh DVR software I was able to get the LIVE feed of the video working.  I just keep getting more and more impressed with this product the more I play with it.", "Date": "March 11, 2012"}, {"Title": "Bad All Around", "Author": "Mark M. \"X111\"", "ReviewID": "R34F2UIINGZPME", "Overall": "2.0", "Content": "The cameras are slightly blurry and there is no way to focus them.The night vision claims to work out to 30 feet. However, this is not true outside.I tested the night vision inside, and it seemed to work pretty well.However, after mounting the cameras high on the sides of the house, the cameras see nothing but black at night. The images are 100% black and no shapes are visible.Note: We live in the country, and there are no \"city\" lights to help with night vision.The plastic thumb screws break off easily, and then you have to use needle nose pliers to tighten the screws in place to mount the camera arm.The DVR only allows one camera to be in D1 recording mode.It only allows one camera in HD2 mode, too.Bottom line... This system is generally bad all around and I will likely be returning it soon.UPDATE 08/12/2012:After returning this system, I purchased a Swann security system. The Swann is a much better system and I highly recommend it over the Zmodo. The Swann system is better in every detail from cameras, to the DVR.", "Date": "July 5, 2012"}, {"Title": "missing parts", "Author": "Liz", "ReviewID": "RNKUB11O60091", "Overall": "2.0", "Content": "looked like a great deal and had some great reviews. i received it within a week of ordering it. couldnt put it together due to all the missing pieces. i called the company and was put on hold for an hour. after the hour i just decided to hang up and return it. this is not the kind of business that want to keep customers.", "Date": "May 12, 2012"}, {"Title": "Beware", "Author": "K. Roberts", "ReviewID": "R2BRRCR1R6SP1W", "Overall": "4.0", "Content": "I should have attempted to find cameras that did not need to be plugged into an outlet. Finding an outlet will be a challenge.", "Date": "April 18, 2013"}, {"Title": "Very Good Product", "Author": "Ognian Ivanov", "ReviewID": "R25HXDJC5ZFDA2", "Overall": "5.0", "Content": "I have been using this for awhile now. Works very well. I installed the client on my Android phone and can monitor the cameras from anywhere.", "Date": "November 6, 2011"}, {"Title": "Missing Hard Drive", "Author": "Sam Hill \"Sam\"", "ReviewID": "R3BOMFX0FNIPTW", "Overall": "2.0", "Content": "I ordered this product for my brother's store as a gift.  He and another worker had it set up and running within 4 hours.  He had a theft a few months after the installation.  The police officer that came in to review the video said there was no hard drive in the unit.  We ended up taking the DVR apart and never found a hard drive.  There was no external hard drive in the packaging either.  Well, needless to say I call Zmodo because I had waited too long to get service through amazon.  The folks with Zmodo support kindly told me that it was not their problem - even thought the SKU I ordered through amazon was the one that said it included the 500GB Hard Drive.  I provided receipts and everything they asked for but never got the issue resolved with Zmodo customer service.  They suggested I return the entire package to amazon.  First of all it was a gift and my brother and a co-worker spent half a day wiring and installing the new system.  I finally had him go out and buy an external hard drive to connect to the system and it is now recording successfully.  Maybe amazon is a little responsible and maybe I am for not following up sooner. Zmodo should provide better customer support.  The quality of the video is pretty good and the system seems fairly easy to navigate.  I was able to set up web and remote viewing without incident but I am not a fan of the customer support at Zmodo as I was cheated out of a hard drive that should have came with the system.", "Date": "August 31, 2012"}, {"Title": "Very disappointed", "Author": "viettq", "ReviewID": "R1P0W4SG46A1AD", "Overall": "2.0", "Content": "I ordered this system to replace for 5 year old system in my business ( but still working). System was install and set up easily. Only have problem with remote viewing. User guide is not clear enough and I have to do research for that set up. At the end everything done. System working OK for about 8 months and suddenly stop working. Power light still on but system can't start up. I try to turn it off and on many times, sometimes it works , sometimes not. I feel this DVR is not reliable for security system and one more thing is in playback mode, you can not view all 8 camera at the same time. I have to order another DVR with other brand name for my security system. Very disappointed for this product.", "Date": "July 25, 2013"}, {"Title": "Excellent value buy.", "Author": "Hari", "ReviewID": "R322PWU6GHGW4T", "Overall": "5.0", "Content": "This is a great kit for beginners as well as advanced users. One tip is to NEVER forget the admin password you set for this thing, because as of date there is barely any help available to unlock this thing. Its Linux based core system, so its very stable as well.Camera quality is pretty good and so is the view on cell phones. Cameras work pretty good in LOW light conditions as well. Overall, very satisfied with the product.Only draw back, TECH support SUCKS. So god forbid you goof up something, then you will need to do some serious research online to get it going.Best part is the ZMODO site is 200% better than their Tech Support.", "Date": "July 6, 2012"}, {"Title": "It's a ok product.", "Author": "Maggie", "ReviewID": "R28VN7HH3TA9OS", "Overall": "3.0", "Content": "It's a good for monitor your kids/dogs @ yard or activities around your house.  I don't think you could use for crime busting face recognition.  They need to update the firmware, I can only set one camera to record in D1 mode.  The \"stop recording\" on both of my unit & remote didn't work.  I don't think you could see anything beyond 15' at night.  But I think it was a good starter kits since it is my first time owned surveillance system.", "Date": "August 10, 2012"}, {"Title": "Cheap Parts and Complex software install", "Author": "Silent T... \"Tony\"", "ReviewID": "RMYKJ0VFUSM06", "Overall": "1.0", "Content": "Bought this system for my business -It was simple to install the hardware and run the wiresthe software and getting it to work on the PC and mobile device was very complicated. If you do not have a computer background don't even bother.The interface of the DVR software is simple enough - allows you to pull up recorded videoit only allows you to playback 4 screens at a time instead of the full 8 so if you want to view all 8 screens to need to do it twice.Once I finally got it dialed in smoothly the hardware started to go out.first the cables ( 2 of the 8 got damaged / worn over time )then over a year later the HDD fried - their website claims they use DVR friendly HDDs to prevent this very thing yet mine broke anyways.Since it has been over a year the manufacture wont warranty the HDD so I'm on my own to try to fix it -I won't spend more money on this junk - moving on to something better", "Date": "December 6, 2013"}, {"Title": "Great for the price", "Author": "MamaHam", "ReviewID": "R16AMWP22YOI1W", "Overall": "5.0", "Content": "We ordered this one over the four camera one and found that using more camera's gives a better view of the area. I bought this because our neighbor down the street home was burglarized about a month ago. I feel much safer now knowing that if something does happen, it is recorded.", "Date": "October 19, 2013"}, {"Title": "Camera System", "Author": "ChrisM", "ReviewID": "R3N5DL0B8AMXAC", "Overall": "5.0", "Content": "Very easy to use and definitely worth the money! Very Pleased with system and quickness of processing. I would revommend for home or business.", "Date": "June 25, 2013"}, {"Title": "Great", "Author": "Sherri", "ReviewID": "R1R1GDZPJ31GLX", "Overall": "5.0", "Content": "Great value and very nice picture that shows so I am very excited, would recommend them to all my friends", "Date": "April 10, 2013"}, {"Title": "Not bad.", "Author": "MKC", "ReviewID": "R3TH7SPUNBGOAQ", "Overall": "4.0", "Content": "For the price and for eight cameras it couldnt be better. I am only sorry that it could not auto restate or flashes through to the different cameras one at a time. That is the only thing missing.", "Date": "February 28, 2013"}, {"Title": "wiring too thin", "Author": "Ronald Washington", "ReviewID": "R2991M8DIEV8OX", "Overall": "2.0", "Content": "wiring too thin bad reception, what can be done about this problem, cameras no good if image can't be seen", "Date": "February 17, 2013"}, {"Title": "Do not buy this product", "Author": "Jerry", "ReviewID": "RDT2HUPNA1NLO", "Overall": "1.0", "Content": "I just got the Zmodo 8 channel  system works great I tried to view it from my smart phone and nothing worked so I called Zmodo good luck with that I have been trying now for 6 days to talk to someone and getting nowhere fast I hope that Amazon stop selling this product as there customer service really sucks and I also post this on there facebook page boy I wish I could get my money back on this junk I would go buy Lorex systemJerry", "Date": "March 19, 2013"}, {"Title": "WORST SECURITY SYSTEM ON THE MARKET--IT IS JUNK", "Author": "Laron Taylor \"laronvonbaron\"", "ReviewID": "R20H0O6N6PBJ5", "Overall": "1.0", "Content": "well spent 400.00 running 8 100 foot wires --mounting cameras 3 hrs only to find the remote will not turn the recorder  on or off and there is not on -off switch on the box its self--so now what spend another 400 paying employees to undo all of the work so i can send this junk back--save your self time and money --not to mention the frustration--and just pass on anything that says ZMODO on the box--i recommend QSEE and i am sorry i did not spend the extra 40.00-----VERY SORRY---getting tired of returning this crap from china --amazon is letting quality take a back seat to service----what service is it when you have to return every third item you buy---going to new egg for any purchase over 50.00 us----AND JUST TO TOP IT OFF THIS IS THE 15 STEP PROCEDURE FOR DOWNLOADING THE FILES FROM YOU 500 GIG hd--------Remove hard drive from the unit, this model has a slide out cartridge containing the hard drive. With other models you may have to take the unit apart.2Break the Warranty stickers and slide cover off the drive housing (note this will void the warranty on the drive).3Unscrew drive from housing and remove drive.4Obtain a USB to SATA converter cable from an electronics store or online.5Q-See systems are based on Linux so in order to read the drive from the DVR you'll need to install drivers for windows for the ext2/3 file system that the drive is formatted with. Sourceforge has an open source free driver. Ext2 IFS For Windows at [...]6Plug Drive into your windows machine7Install PlaybackSetup_2.3.0.4.exe which should be on the setup CD that came with your DVR. In this folder: \"C:\\Program Files\\Playback\\\" you should find the \"NVR Export Tool\" along with other helpful files you may need.8Open the \"NVR Export Tool\" from \"C:\\Program Files\\Playback\\NvrExport.exe\" this program came from the setup CD that came with your DVR.9The drive should show up as a drive on your computer. In my case Drive N: there will also be a drive J: however drive N: is the drive with the goods.10Open the NvrExport tool and select \"Directory\" the directory you select should be labeled as the date you want to backup. In my case N:\\2010-01-2111Create a folder on the drive you want to \"backup\" to. I chose J:\\Q-See Backups\\2010-01-21 you have to create the subfolder so you don't accidentally put the files in the wrong place.12Place the folder you created in the \"destination\" field of the NvrExport tool.13Click the \"Export\" button. Depending on how many recordings there are you may have to wait hours for it to complete.14While it is \"Exporting\" you will start to files appear with names such as ch00000000000001-100121-000000-000000-12p001000000.264 in the destination folder you created on your hard drive.15After your export is complete you can load up the \"Playback Software\" (this software also came on the setup CD that came with your DVR) choose the folder where you exported the files to and you should be able to view and export them again but as *.avi files to send to law enforcement or for other purposes.SEE WHAT I MEAN  this is insane are they for real --the older 4 channel model allowed downloads with a few clicks I sold my 4 channel and bought this ---WOW WAS I SORRY", "Date": "August 16, 2012"}, {"Title": "Very nice system.", "Author": "Rives Connections LLC", "ReviewID": "R30TEB4DTZIFDN", "Overall": "5.0", "Content": "This package is awesome!!! It comes with everything you need. The only thing you would need extra is a (VGA) monitor cable if you want to plug a monitor directly into the DVR. Other than that it comes with all the video cables and the power wires are attached to the video cable so you only have to pull one line to each camera, the power supply powers up all eight cameras with a y-adaptor which is included so you can attach the power to each camera right at the DVR location.By the way this is a very good and stable system I have not had a single problem with it. The cameras are very good day or night and a very clear picture on the monitor.Very good buy you will like it.", "Date": "September 19, 2013"}, {"Title": "Great product", "Author": "Toby", "ReviewID": "R2GJBFNF0TSJOQ", "Overall": "5.0", "Content": "Got these and they work fine. Was easy to install and worked right out the box. Would buy this again.", "Date": "May 21, 2014"}, {"Title": "Zmodo Security Sistem", "Author": "aracelis acevedo", "ReviewID": "R3NJXEO17103JC", "Overall": "5.0", "Content": "I like my system it was easy to install . Just need a lithe help for the configuration, of the hours that they going to be recording, i will like also to  they will included the memory that makes the system complete.", "Date": "May 4, 2014"}, {"Title": "Stop a theft", "Author": "Larry Wade", "ReviewID": "R1JA7YMY5IORT0", "Overall": "4.0", "Content": "With this type security you can see what happen two day ago as well as what is going on right now and you can play back for the police or who ever you want to see what happen  at work or your home and you will fell more secure  at night knowing that it is doing the job that the police can't. L.Wade", "Date": "April 17, 2014"}, {"Title": "Excellent product!!!", "Author": "drum", "ReviewID": "R2LBE6FJ81FWZ1", "Overall": "5.0", "Content": "I bought this surveillance system a few weeks ago.It works great, and the price is extremely reasonable.I had a bit of trouble when trying to install the application to see the cameras in remote mode on my Iphone (to verify what's going on home while away), but the Customer Service rep was super helpful and I had the setup completed and the Iphone application installed in no time.I recommend this Zmodo security system to everyone interested in a reliable and reasonably priced system!", "Date": "February 4, 2014"}, {"Title": "cameras work wonderful...great picture", "Author": "Jessica Turmon", "ReviewID": "R2UQDPUU71CE8", "Overall": "4.0", "Content": "The cameras are wonderful, but the picture when i first saw it had a screen to veiw the cameras  with the package and it does not include it. It is strictly the cameras and recording device you are buying.", "Date": "February 4, 2014"}, {"Title": "Adequate for the job intended...", "Author": "Joe", "ReviewID": "RD3CKNHJ2QK3O", "Overall": "4.0", "Content": "One of the cameras failed to work and the width of coverage of each camera's view could be larger.Overall, good system considering the price.", "Date": "December 28, 2013"}, {"Title": "Great product for the cost", "Author": "Nick Vigil", "ReviewID": "R27C5BSQEH3HS7", "Overall": "4.0", "Content": "Was easy to install and setup. Cameras provide good detail in day and night. I could not adjust the focus as the cameras are auto focus but sometimes I wish the photo was more clear. Overall I am happy with the product and I would purchase it again.", "Date": "December 17, 2013"}, {"Title": "Nice product", "Author": "christine corbello", "ReviewID": "R3NRV7FK53R4B4", "Overall": "4.0", "Content": "Not great instructions, but works really well! Caught my first shoplifter a week after hooking it up! Great for around the house or a small business!", "Date": "December 4, 2013"}, {"Title": "security system", "Author": "joann brase", "ReviewID": "R46KEBSCZKSCP", "Overall": "5.0", "Content": "this system has worked out great for us, we needed some more cameras and these worked out great. we just installed them in  and they cover what we needed them to thanks", "Date": "October 29, 2013"}, {"Title": "Great Product", "Author": "zloupe", "ReviewID": "RLG4ZHIAO0JIF", "Overall": "4.0", "Content": "Great product. Does the job i need it to do around the area. Thanks and keep up the good work!!", "Date": "October 28, 2013"}, {"Title": "Great cameras", "Author": "lea fox", "ReviewID": "R306FRFTXO2DT8", "Overall": "4.0", "Content": "This came very quickly and was just as described the only thing that is wrong  I wish you would've came with directions on how to connect to my iPhone. Trying to find someone for customer service or even online has been hard.", "Date": "October 8, 2013"}, {"Title": "Best system for the price", "Author": "Kozy Dude", "ReviewID": "R2VALO24HQ41QU", "Overall": "4.0", "Content": "I almost didn't buy this product after reading a few reviews and the low price made me skeptic too but after I hooked up the system, I realized that most of the complaints were operator's error.  This little cameras are very clear in the day time.  The night vision is not the best you can still see images and for a better quality I turn on a light near by and problem solved. I love the fact that you can zoom in by just drawing a box around the image and isolate it from everything else. One draw back I found was that you must install them under an eve or make a small shelter for it.  I installed one directly in the open and second guess myself on providing shelter for it relying on the weatherproof wording on the box and it got cloudy after the first shower of rain.  I had to unscrew the front and dried it out then rotate it with one that was inside and made a shelter for the replacement.  I'm about to purchase a second set for our retail store.", "Date": "September 21, 2013"}, {"Title": "love it !", "Author": "Stefanie", "ReviewID": "R399HE1IYBI0D3", "Overall": "5.0", "Content": "Great price .excellent quality. Fast delivery.I would recommend these cameras for anyone.Has great night vision,clear picture.And at that price thats a steal.", "Date": "September 11, 2013"}, {"Title": "great buy", "Author": "ry", "ReviewID": "R176NOMQCKVTAI", "Overall": "5.0", "Content": "Awesome product and easy install good quality. This product is awesome I recommend it. To everyone good quality and features", "Date": "August 9, 2013"}, {"Title": "Good Product", "Author": "Nancy Vang", "ReviewID": "RN4K2V0CLF71M", "Overall": "4.0", "Content": "Camera and DVR unit working fine. Software for viewing on computer and android confusing. Viewing is limited to 4 cameras only. And you have to add each camera individually. Zmodo's Zviewer needs a bit more work to be able to view all 8 cameras.", "Date": "July 6, 2013"}, {"Title": "Hard to install", "Author": "Marcia Beatriz", "ReviewID": "R2B0HEG696JNZ5", "Overall": "3.0", "Content": "I had to call someone, and pay him, to install, and now one of the cameras is off and I cant fix it.", "Date": "June 9, 2013"}, {"Title": "Excellent value for money", "Author": "Vinicio Mckay", "ReviewID": "R2IHW6L7MJ0G8A", "Overall": "5.0", "Content": "The system is easy to configure and cameras are easy to mount.  Just don't trust the instruction manual enclosed, you better find a tutorial on YouTube.  I had the DVR up and running in about 1 hour (installation of the cameras was made by another person before setting up the dvr).", "Date": "May 28, 2013"}, {"Title": "caught the bad guy", "Author": "audg1023", "ReviewID": "R15UA8211TONM8", "Overall": "5.0", "Content": "this system is great! picture quality at night is decent. installation was the only challenge but well worth the trouble!", "Date": "February 13, 2013"}, {"Title": "Nice cameras", "Author": "Beni.p", "ReviewID": "R2DVQ3J464TO4T", "Overall": "5.0", "Content": "Nice cameras they work really nice and the prive is really affordable it has night vision and what more can u ask for", "Date": "January 30, 2013"}, {"Title": "good values", "Author": "ant662", "ReviewID": "R2P6XLBM87WADP", "Overall": "4.0", "Content": "You cant beat the value for these cameras. Installing the cameras is easy. If you want it on your phone though it's a pretty difficult but the costumer service is great and helped us get them on our phones and ipads. another down side is the night vision is pretty dark i would recomend putting motion lights by your cameras", "Date": "December 18, 2012"}, {"Title": "Nice kit awesome price", "Author": "Zmodo", "ReviewID": "R2V7YM9IMJ4YTE", "Overall": "5.0", "Content": "Live this set up it did take me 2 and a half days with the tools i had to mount and run wires and organize it in the house. Easy to use good pic not the great at night but gets the job done i do wish i would have got a 3.6mm lense instead of these 6mm the 3.6 is a bigger less quality pic but i said bigger and thats what i need i recommend this to anyone but put lits out for cameras at nite tho", "Date": "November 2, 2012"}, {"Title": "Great Price..Great product for what you paid for.", "Author": "Will", "ReviewID": "R35XS44XI7VPI", "Overall": "4.0", "Content": "As I wrote in my title.  This product had a great price and it exceeded my expectations.  The instructions were great. Didn't have a problem with the installing it to view via internet either.  Would recommend to any of my friends.", "Date": "July 5, 2012"}, {"Title": "Easy installation, worked well", "Author": "Barry Steele \"Barry\"", "ReviewID": "R3CIIUPATZYE67", "Overall": "4.0", "Content": "Installed this in a friend's new restaurant.  Cameras were easy to install in the drop ceilings. Cables had a tendency to tangle, but if you stretched them out on the floor first, it took care of the problem.  The DVR and all cameras worked right out of the box.  The internet web server in the DVR worked well.  I'd suggest the new installer do some google searches to find articles on Dynamic DNS service.. This is how an internet connection with dynamic IP addressing can be found from the outside world.Anyway, it worked out well.", "Date": "July 4, 2012"}, {"Title": "Cameras are NOT Weather Resistant", "Author": "Chris Hernandez \"Chris H\"", "ReviewID": "R384R46P91SBNI", "Overall": "1.0", "Content": "The cameras are not Weather Resistant. I have 1 camera out and the second day it get full of water inside. image looks glare. This are not outdoor cameras.I don't recommend to use this cameras outside. Simple get damage and doesn't work.", "Date": "September 9, 2012"}, {"Title": "The price is right", "Author": "Mark Twain \"book maven\"", "ReviewID": "R2UUBYK2UXCE58", "Overall": "3.0", "Content": "But the angle is very limited, it capture some, but in different systems I capture a LOT more real estate through wider angle lens.", "Date": "June 22, 2013"}, {"Title": "Not impressed", "Author": "R. Bilderback \"Dudditz\"", "ReviewID": "R22TP5CP7L1UXB", "Overall": "3.0", "Content": "I ordered this particular package due to fairly positive reviews, but I am not at all impressed. The cameras cannot be adjusted in focus or range and quality is not that good. The zoom is set way too far out so close proximity viewing is less than par. The 60 foot cables included with each camera barely reaches, unless you plan to set DVR in the center of your business and spider cameras outwards.", "Date": "January 20, 2013"}, {"Title": "Zmodo 8 channel DVR security system.", "Author": "Pyros0511", "ReviewID": "R17O8RBJGOZ3NO", "Overall": "4.0", "Content": "I did not receive the actual model that I ordered, but I THINK that the dvr box is a newer model then what I originally order. So I am not concerned about it. The cameras all work and was a little time consuming to setup (correctly), they need to have a better manual explaining the features in more dept. Overall I am very happy with it and it is serving its purpose as expected. With all the features and quality of the system, the price was much better then others I compared it to. I would recommend this unit for home or small business use.", "Date": "September 16, 2011"}, {"Title": "The product is not worth a dime.", "Author": "Loc", "ReviewID": "RWPHQZ0V6DQ0U", "Overall": "1.0", "Content": "I bought this product a few months ago, but I did not have a chance to activate it. Until now I found out that it does not work at all. Moreover I did order a 500G hard drive DVR, and received one without the hard drive installed.", "Date": "January 25, 2013"}, {"Title": "Camer work great", "Author": "Steven A Jacoby", "ReviewID": "R2LRN9O1OP2JGN", "Overall": "4.0", "Content": "For the money it works great. the night vision works well also. The search function couild be a little easier to navigate is the only thing I have found so far.", "Date": "November 8, 2013"}, {"Title": "Thank you", "Author": "alnemer", "ReviewID": "R2PEP9CUUYJFTH", "Overall": "5.0", "Content": "Thank youI had the honor to deal with youThank you for the goodsLike what I expectedAnd accept greetings", "Date": "August 25, 2013"}, {"Title": "Great", "Author": "Wilber Wejuli", "ReviewID": "R3MFIEV1HA7BJ1", "Overall": "5.0", "Content": "I orderd the item, it arrived on time and I am loving it. Looks and feels great. I am yet to install and use it in another country but I would certainly recommend especially the seller for the sensitivity to client timing", "Date": "April 3, 2013"}, {"Title": "AWESOME PRODUCT", "Author": "patrick", "ReviewID": "R1KVXWUC2ZL3LJ", "Overall": "5.0", "Content": "WORKS GREAT AND IS EXCEPTIONAL QUALITY EASY TO INSTALL AND SET UP AND IF YOU HAVE ANY PROBLEMS I GOT THROUGH TO TECH AND YES IT WAS ACTUALLY A PERSON VERY HELPFUL", "Date": "January 15, 2013"}, {"Title": "junk", "Author": "robert shurran jr.", "ReviewID": "R1O8VYKZS6T74W", "Overall": "1.0", "Content": "worked for couple months, now doesnt work,never again should have just bought one from walmart or home depot or lowes", "Date": "November 16, 2013"}, {"Title": "have a promble", "Author": "Jesse", "ReviewID": "R1MGWRDXKXX3JZ", "Overall": "2.0", "Content": "it don't show wires I thought thay was wire less camera's & for some reason no way to hock up to a tv", "Date": "September 9, 2013"}, {"Title": "surveillance security  system", "Author": "Matt", "ReviewID": "R2326EPXB9PVEB", "Overall": "3.0", "Content": "This is a good system. DVR works great and easy to use  . ALL cameras or 6 millimeter You may need to buy additional cameras with different angles.[...]", "Date": "October 18, 2012"}, {"Title": "MUY BUENO", "Author": "LUIS YAMA", "ReviewID": "R25SHW5VI87N99", "Overall": "4.0", "Content": "HA RESULTADO TODO UN SISTEMA DE VIDEO VIGILANCIA POR INTERNET QUE ME HA PERMITIDO VIGILAR ATENTAMENTE CUANDO VIAJO, LOS MOVIMIENTOS DE MI PERSONAL EN LA TIENDA Y POR ESO COMPRE OTRO PARA OTRA TIENDA. LO RECOMIENDO AMPLIAMENTE", "Date": "September 22, 2012"}, {"Title": "Very bad service", "Author": "Tony", "ReviewID": "R3R1HKZS1RLLLB", "Overall": "1.0", "Content": "There are no way to got in contact with the seller, want to let the seller  know that it was selling cheaper with other seller and what they can do about that, but can’t all what i got is refund it, did try to do that but they want to charge me $18 ,the different in the price was $20 ,when start to install the system found that the manual instruction very bad and the manual looks like it written in different language, also 3 of the wire was not working , and there are no ways to get in touch with the seller. Now have to order more wire and wait, one of the worst service ever got, this is not the kind of business that want to keep customers.", "Date": "January 30, 2013"}, {"Title": "SO FAR, SO GOOD", "Author": "NCJACK", "ReviewID": "R26HYOZH2BUUKK", "Overall": "5.0", "Content": "FINALIZED THE CABLE RUNS AND THE HOOK UP JUST TODAY.  ALL WORKED JUST FINE CONSIDERING I HAD TO ADD THREE CABLES TO THE SUPPLIED ONES TO GET ENOUGH LENGTH TO REACH THE CENTERAL LOCATION OF THE RECORDER.  ALL CABLES WERE/ARE GOOD, ALL CAMERAS ARE GOOD, RECORDER SEEMS TO BE OK, STILL LEARNING ABOUT IT'S FUNCTIONALITY.  DID HAVE TO CALL CUSTOMER SERVICE ABOUT A CONTROL ISSUE, THEY SENT AN E-MAIL BEFORE I WAS ABLE TO DO ANYTHING ELSE, IT ARRIVED, I FOLLOWED THE INSTRUCTIONS AND EVERYTHING FELL INTO PLACE.  THERE IS AN INDICATION ON THE INSTRUCTIONS THAT SAYS YOU CAN AND SHOULD REGISTER THE PRODUCT, I AGREE, BUT, THERE DOES NOT SEEM TO BE A WAY TO GET TO A REGISTERATION SITE, AND NO HARD COPY FORMS ARE INCLUDES..OTHER THAN THAT, SO FAR, SO GOOD!", "Date": "December 10, 2011"}], "ProductInfo": {"Price": "$499.99", "Features": "Pan/Tilt/Zoom (PTZ) camera control\nNetwork access and USB 2.0 backup\nContinuous, scheduled, and motion recording modes\nPlayback search by time & date, event list\nIncludes eight 1/4\" color CMOS IR night vision outdoor cameras, cables, power supplies, mounting brackets, 500GB hard drive, remote control, mouse", "Name": "Zmodo PKD-DK0855-500GB 8-Channel DVR Security System with 8 CMOS IR Cameras, 500 GB Hard Drive, and Remote Web/Mobile Access", "ImgURL": "http://ecx.images-amazon.com/images/I/51Vrhh7uedL._SY300_.jpg", "ProductID": "B004TS1HH4"}}