{"Reviews": [{"Title": "Does not Sync with ALL Summer Monitors", "Author": "Lara", "ReviewID": "R2C5QGD8JNR3DM", "Overall": "3.0", "Content": "I spent a good amount of time researching this purchase (on amazon) as I bought my summer monitor back in 2009 and with my second baby on the way coming jan 2012 I needed another camera. I found that this camera does not sync with my model which is the 02090. I would strongly recommend you refer to the summer product page to triple check this, like a fool I just relied on the Amazon reviews and that obviously didn't work out for me.[...]", "Date": "October 10, 2011"}, {"Title": "excellent replacement/add on camera", "Author": "Joel S. Perry", "ReviewID": "R1DID6UK4KHU06", "Overall": "5.0", "Content": "I just wanted to leave a review to let others know that this is indeed the correct extra camera for the Summer Infant Secure Sight Video Monitor.  If you have doubts go to the summer infant website and search for your camera, there is an accessories tab and from that tab it will list the model number of the camera that you need.  then check the model number on the item details.", "Date": "June 7, 2012"}, {"Title": "not compatible", "Author": "Edwin Montanez", "ReviewID": "R3DBNCM54K2ZB0", "Overall": "1.0", "Content": "bot it for my summer infant video moniter and it isnt compatiblein the description it seid it was so be sure it fits", "Date": "April 22, 2014"}, {"Title": "Summer Camera", "Author": "RUBEN CAUDLE", "ReviewID": "R2YPZI24X2SFWG", "Overall": "4.0", "Content": "I'm sure this camera was great, but it was the wrong one for me.  It arrived quickly and in the original package with no issues there.  The problem was that it was not compatible with the current Infant Camera I have.  I didn't realize this until we actually received it.  Recommend that model numbers be posted so end users can ensure they order the compatible products.  Other than that, no issues with the order, delivery, or return process at all!", "Date": "April 11, 2014"}, {"Title": "Easy to add as additional camera", "Author": "Maurene", "ReviewID": "R1JCFD1HMGSTL8", "Overall": "4.0", "Content": "Works great in second child's room! Easy to add to one monitor! Simple to install. Clear picture in monitor. Thank you!", "Date": "May 11, 2014"}, {"Title": "Almost perfect for the price.", "Author": "way too literal", "ReviewID": "R2HK59C0T4KXJF", "Overall": "4.0", "Content": "We have a 2 1/2 year old and a newborn so we bought an extra camera. Very easy syncing process, by the way. This set up works well. I especially like the scan feature. My only concern is the volume controls are on the side which make it very easy to adjust the volume, usually down in my case, without knowing when picking up the monitor.", "Date": "April 28, 2014"}, {"Title": "Summer Products", "Author": "Theresa Witham", "ReviewID": "R2OSJXWP60LUQS", "Overall": "3.0", "Content": "The summer camera products are good quality. My problem is with compatibility- be very careful as summers models are not compatible with one another. Check the product number and make sure you do not order an older camera with a newer hand-held device as they will not work together. Also summers customer service is not great- no one answered when I called to discus the compatibility issue. I love being able to see my son when he is napping but I purchased the extra camera to have in the living room and it doesn't work with the original set I purchased.", "Date": "April 23, 2014"}, {"Title": "Works Great", "Author": "Donnyboy", "ReviewID": "RYO26LRCGOBBE", "Overall": "5.0", "Content": "I was worried this camera wouldn't work. I am so glad I bought it. Works great and now I am watching both kids together in different rooms.", "Date": "April 10, 2014"}, {"Title": "happy 1st time customer", "Author": "lacee wallace", "ReviewID": "R1GA3D0AVPC8VB", "Overall": "5.0", "Content": "Ordered as a baby shower hostess gift for a 2nd time mom. Great condition. As far as I know it was the correct camera and works great.", "Date": "March 21, 2014"}, {"Title": "I can't get it to work", "Author": "Ashlynn", "ReviewID": "R3QPL6U8A91NGZ", "Overall": "1.0", "Content": "I got this so I could see both rooms but it won't sync with my monitor. very upset. the only reason I bought it was so I could see my other child but can not do so. should have just gotten a different brand", "Date": "March 11, 2014"}, {"Title": "Easy to add camera.", "Author": "Griffin Thomas Smith", "ReviewID": "R25DEHIKQS3Y7W", "Overall": "5.0", "Content": "Just as expected. Easy to add extra camera. We lost our original camera while on vacation with our first child. Not wanting to buy a new set we just bought this extra camera. Easy to add and works great.", "Date": "March 1, 2014"}, {"Title": "Couldn't live without", "Author": "Lisa Shambarger", "ReviewID": "R1UQSIDDDOKR1", "Overall": "5.0", "Content": "I have twins and a newborn and I have 3 cameras and 1 monitor. I love being able to scan between all 3. This is a huge help for a busy mom.", "Date": "February 23, 2014"}, {"Title": "Works well", "Author": "redslime", "ReviewID": "R1AGLVYSSKI7K6", "Overall": "4.0", "Content": "Synced immediately with original base. Picture is clearer than original (original might be wearing out).  Good purchase. If I had more kids would buy again.", "Date": "February 18, 2014"}, {"Title": "Still works after two years", "Author": "NtOlyy", "ReviewID": "R1KDE6L7JDIR2X", "Overall": "5.0", "Content": "I am currently ordering an extra camera. I ordered the wrong one, but I got smart and referred to the manual that I saved luckily. In that, it says exactly which camera to order. I was going off od what is on the back of the monitor- not sufficient info.This cam", "Date": "February 15, 2014"}, {"Title": "Buyer Beware.....", "Author": "GoPacers", "ReviewID": "R1MM8A00G24CSG", "Overall": "2.0", "Content": "Beware of this system.  We have owned this system for 2 years now.  We are on our 3rd monitor.  The video cameras work just fine, but the monitor is awful.  Our first broke after 15 months.  Because I didn't have a receipt, Summer Infant wouldn't exchange it.  I looked into purchasing a different system, but we already had multiple cameras, so I just decided to do the Secure Sight monitor again and save the Amazon receipt.  (Summer Infant offered a \"discounted\" price to replace the 1st broken one, but it was cheaper to buy a camera + monitor on Amazon.  Thanks for the \"great deal\", Summer Infant!).  We are now 2 years and 4 months later and the 2nd monitor broke a few weeks ago.  I contacted Summer Infant. I had to email them a picture of my Amazon receipt and they sent me a prepaid packing slip to mail the monitor back to them.  The customer service rep said they would send a replacement.  I don't know how long it will take to get it.  Meanwhile, we are without a monitor in for the 2 year old we moved to a \"big boy bed\"!Picture quality is great, sound is great.  It is so frustrating because I am overall very happy with the quality, just not the longevity! I truly think they should last longer than 12-15 months.  If I were starting out completely over again, I would NOT purchase this system.  Because I already have multiple cameras, I just didn't feel like I could change brands, but we may have to if this 3rd one breaks.....when it breaks.....", "Date": "December 10, 2013"}, {"Title": "summer infant", "Author": "Chris", "ReviewID": "RUBJT9RXSE1HG", "Overall": "5.0", "Content": "plugged it in, searched from the handset, and the extra camera appeared. I've been using this model for two years, no issues.", "Date": "November 14, 2013"}, {"Title": "Exactly what I needed", "Author": "yellow77rose", "ReviewID": "RYRENS4Q2XEYX", "Overall": "5.0", "Content": "We had a second child and wanted to buy an extra video camera for the new baby's room.  It easily synched up with the existing monitor and we have had no issues in the month of use thus far.  Very happy with product.", "Date": "September 19, 2013"}, {"Title": "Easy set up", "Author": "Mommy of two", "ReviewID": "R6VE4LA8XDWQW", "Overall": "5.0", "Content": "Easy to set up and use! So happy to have two cameras and send a clear image - very happy with product.", "Date": "September 18, 2013"}, {"Title": "A good buy", "Author": "laura baker", "ReviewID": "R2FJ50PX7RM9E3", "Overall": "4.0", "Content": "Picture clarity is good as is audio, no complaints.  The only aspect I don't like is the difficulty in switching from one monitor to other.  In the older model the touchpad is on the front of hand held camera; in this newer model it's on the side and you have to click up and down several times.  Bought the camera to match the one my son has, but his is easier to switch around.  I didn't really research any other brands so don't know if this is true of others.", "Date": "September 11, 2013"}, {"Title": "IT IS INCOMPATIBLE", "Author": "Silverio G. Fonseca", "ReviewID": "R15BIDVVYR53HY", "Overall": "1.0", "Content": "Do not buy it. The specs available are not enough. It does not work properly. I sent email to summer infant, and they requested a few days to resolve it. It is a shame.", "Date": "August 30, 2013"}, {"Title": "Good but ...", "Author": "Nicolas Illanes Robinson", "ReviewID": "R3B9HBJNVEEFPN", "Overall": "3.0", "Content": "It works fine, good reception and sound, but the built isn't very good and is easy to brake the articulated part of the camera.Handle with care and it will work fine.", "Date": "March 7, 2013"}, {"Title": "Great monitor", "Author": "Michelle D. Graham", "ReviewID": "R1O4RJWTCGBXIA", "Overall": "5.0", "Content": "We have this monitor & camera, but now thatthere is a new addition to the family we neededanother camera so we could see both boys.", "Date": "December 28, 2012"}, {"Title": "No problems", "Author": "sth1716", "ReviewID": "RTUWT2MM27Y42", "Overall": "4.0", "Content": "We've been using this for almost 6 months and have had no trouble with it.  I feel comfortable relying on it each night with my kids upstairs.", "Date": "December 18, 2012"}, {"Title": "Exactly what I needed", "Author": "Michael Young", "ReviewID": "R3CGBYHRM0YM2A", "Overall": "5.0", "Content": "Looked for this camera all over the Internet. Finally found it here and it was exactly what I needed. Very satisfied.", "Date": "December 9, 2012"}, {"Title": "Great", "Author": "Lusche", "ReviewID": "R20Z646WO23HWO", "Overall": "4.0", "Content": "Great video monitor! I have a 20 month old baby and a three month old, I don't think I could live without the monitor, it gives me great peace of mind seeing them and making sure they are ok.  The hand held part broke pretty fast, when my oldest was 5 months and after that it gave me a lot of problems, I got a new one and it has been great so far!Highly recommend getting a video monitor, you will be able to enjoy your lives after you put your babies down and not worry and wonder if they are ok!", "Date": "March 15, 2012"}, {"Title": "good addition", "Author": "s2", "ReviewID": "RIFKXYWB4ROI0", "Overall": "4.0", "Content": "I had no problem syncing it with my camera, but it is a little hard to press the tiny gray button for it to sync.", "Date": "June 20, 2011"}, {"Title": "Not enough information in product description-did not sink with my camera", "Author": "Yuliya Plyaka \"Experienced shopper\"", "ReviewID": "R35FV57ERVCKU4", "Overall": "2.0", "Content": "There's no indication anywhere in the description of this item that would say that it would not work with certain camera models.  So the monitor worked, but I was not able to sink it with my model of the camera (which is only 2 years old).  One suggestion before anyone purchases this item, maybe reach out to the seller and ask if the monitor will work your specific model number. I ended up returning the item.", "Date": "September 6, 2013"}, {"Title": "Peace of mind", "Author": "A. Corey \"Loonete\"", "ReviewID": "R2U5AVBXXC4YRJ", "Overall": "5.0", "Content": "With the arrival of our 2nd child, I had to get a second camera. This camera is amazing. Great quality video and sound. It capture everything. I love that you can alternate up to 4 cameras. It changes every 8 seconds. Fantastic!!", "Date": "June 20, 2011"}, {"Title": "Great Camera!!", "Author": "nana", "ReviewID": "R2IFNSMCQQNCFO", "Overall": "5.0", "Content": "Bought the camera and monitor for my son and daughter in law for their first child a couple of years ago. They loved it! Even accidentally dropped in water. Dried it out in rice and all was good! So I bought the second camera this year for their second child. They still use the same monitor for both children.", "Date": "November 29, 2013"}, {"Title": "Very flexible - great view day or night.", "Author": "J&J;", "ReviewID": "R33RDVUTTET7DL", "Overall": "5.0", "Content": "I have the set with 2 cameras and use it for my granddaughter and an elderly person in our home as needed.  Works well for both!  Great picture - could use a little more range though. Sound is excellent, and if anything is too sensitive.", "Date": "August 19, 2013"}, {"Title": "Havnt used this product for very long, but so far, love it!", "Author": "Andrea", "ReviewID": "R3E13D9XASRO34", "Overall": "5.0", "Content": "I added this extra camera to our existing system which was really easy to do and I love how it scans back and forth between the two cameras at night so I can see and hear both of our children at the same time. The only thing that I dislike about the system in general is that the battery dies unless plugged in quite quickly, but that hasn't bothered us yet because we keep it plugged in at night beside our bed anyways. Would certainly recommend to a friend!", "Date": "July 12, 2013"}, {"Title": "Camera", "Author": "Denise Chesser", "ReviewID": "R1VNUGAH59X1KJ", "Overall": "3.0", "Content": "This camera seems to be the perfect camera. However, it was not the camera that goes with our monitor, so we had to replace it.", "Date": "June 20, 2013"}, {"Title": "Did not sync", "Author": "Shauna Gonzales", "ReviewID": "RLUNIMFE61XPP", "Overall": "1.0", "Content": "This monitor did not sync with my 28270 sleek &secure; monitor. We followed the instructions and it did not work. We had to return it.", "Date": "June 7, 2013"}, {"Title": "Awesome", "Author": "Cindelyn Stranberg", "ReviewID": "R2EWKX8F66D6OB", "Overall": "5.0", "Content": "Very happy with our second video camera, we can now watch both kids and it scans between the two on a timer!! Worth the money.", "Date": "May 29, 2013"}, {"Title": "Great camera", "Author": "Melissa Dawley", "ReviewID": "R2VC7QWZWOBBFE", "Overall": "5.0", "Content": "We bought a the original camera when our first child was born nearly 2 years ago.  I was dreading having to lug around two different baby monitors and discovered I could simply add a camera to my existing system.  It's ideal I set it up so it jumps between both children's rooms every 8-10 seconds.  If only one is napping you can go to just that camera.", "Date": "May 23, 2013"}, {"Title": "Always worked great for us...", "Author": "Shawny", "ReviewID": "R2X4DPEVQ6EA4V", "Overall": "4.0", "Content": "This camera was an extra we ordered to put in little ones playroom so we could watch her in there too. Always worked great for her bedroom and we've used it for well over a year now. Would be nice if the view of the camera was wider- but otherwise it's perfect and works great :)", "Date": "February 25, 2013"}, {"Title": "Check before buying", "Author": "JHohman", "ReviewID": "R2ATZJ1GX88I1U", "Overall": "4.0", "Content": "I thought I was ordering the correct extra video, however, once I received it and could not get it to work with my current monitor, I called summer infant only to find out it does not work with what I have already.  It was packaged great and comes with directions how to link with the monitor, however, it does not say on the packaging or on the product summary what model it works with.  My advice - check carefully first!", "Date": "February 7, 2013"}, {"Title": "Exactly the camera I needed", "Author": "Kkels", "ReviewID": "R2K2S4EHR30DEW", "Overall": "4.0", "Content": "After reading reviews of other Summer Infant cameras I was afraid that I might not find the right camera to go with my existing Secure Sight product. This is the exact camera you'll need if you have the Secure Sight system and need an extra camera. It was so simple to sync with the existing system and it works great. The only reason I didn't give it 5 stars is because I haven't had it long enough to rate its longevity.", "Date": "January 14, 2013"}, {"Title": "Love having two cameras to monitor each child.", "Author": "Rosslyn C. Williams", "ReviewID": "R305PQDRSMDXVA", "Overall": "5.0", "Content": "Love the extra camera for the new baby's room. I love the way the picture switches between both the kids rooms. It gives me peace of mind when the kids are in bed.", "Date": "January 9, 2013"}, {"Title": "Not Compatible with item# 28270", "Author": "KellyB", "ReviewID": "R2NEA3Y3FZ7RU6", "Overall": "1.0", "Content": "This item is not compatible with monitor system 28270 even though it is stated in the description that it is. I opened the camera and tried to sync it to the monitor and no connection was available. I then went to the summer infant website and found the model number extra camera needed is 28310. Why advertise an item as compatible when it clearly is not? So back in the box to return and I will be ordering the correct model from another website.", "Date": "January 7, 2013"}, {"Title": "Very good", "Author": "Amazon Customer", "ReviewID": "RG9U56A6M7UGX", "Overall": "5.0", "Content": "I would highly recommend this camera for all parents. The video is clear and the sounds are clear. Every parent should have this.", "Date": "December 24, 2012"}, {"Title": "Works as advertised", "Author": "S. Islam", "ReviewID": "R3AVL1K3JCFSJL", "Overall": "4.0", "Content": "I ordered this as a replacement for a broken camera that came with the Secure Sight Handheld set Summer Infant Secure Sight Handheld Color Video Monitor.Unit arrived promptly. Installation and pairing with the video monitor was a breeze.Has been in 'production' watching over my baby for a few weeks now without any problems.The only reason I did not give this 5 stars is because the original camera that is included in the set is very very similar (if not the same) and the reason I had to get a replacement was that it was dropped from about 3 feet high onto carpet and the plastic hinge broke.Hopefully this model will last longer.", "Date": "October 17, 2012"}, {"Title": "Works with Summer Infant Secure Sight Video Monitor", "Author": "nowica", "ReviewID": "R1CHJJV22I3KQI", "Overall": "5.0", "Content": "Needed a second camera for Summer Infant Secure Sight Video Monitor. This is the only camera that will work with Summer Infant Secure Sight Video Monitor. The camera was easy to add to monitor and performed as expected.", "Date": "September 19, 2012"}, {"Title": "NO!!! to summer infant products", "Author": "newmom01", "ReviewID": "R2GLAD4A7SRD21", "Overall": "1.0", "Content": "good audio and video quality, but ZERO longevity. I should've taken the advice not to buy this brand. I only had the camera and monitor for 2 months before it gave out.", "Date": "September 11, 2012"}, {"Title": "Be careful of model mismatch", "Author": "Dennis Yeo", "ReviewID": "R2JGP1RUSCBJBD", "Overall": "1.0", "Content": "I was unable to make this camera work due to model mismatch.  I bought this camera for my daughter to monitor her 2nd child.  There is no model compatibility info listed in the description, but it looked identical to her original camera.  It did not work at all with her monitor.  There are not model names on either the camera or the monitor, which was puzzling.  I called Summers, and after reading them some numbers off the back of the camera and the monitor, I was told that the monitor model we have is called a \"Safe Sight\" and the camera is for a different model.  Turns out her monitor was bought at Target, and is not available on Amazon, ONLY at \"Bye-Bye Baby\" or Target, so one can only get a 2nd camera from one of those stores.  Very confusing to have models being sold exclusively at certain retail outlets and without names on them!", "Date": "December 31, 2012"}, {"Title": "Incorrect Info in Product Information", "Author": "Kelsib", "ReviewID": "R2UPUEL9O3SH7Q", "Overall": "1.0", "Content": "I ordered this extra camera for my current Summer Infant Video Monitor I have already.  Based on the product information this extra camera was supposed to be compatible with my existing one.  However, when it arrived it was NOT compatible.  When I called the Summer Infant company directly to find out the model number for the extra camera compatible with my model, I was informed that they stopped making additional cameras for mine two years ago! I ended up having to order a whole new system from Summer Infant (at a discounted rate). I called Amazon Customer Service and complained about the misleading information and they gave me free return shipping with an apology.  BEWARE when buying extra monitors for your existing system--it wouldn't hurt to call Summer Infant directly and ask them what the appropriate model number is you're looking for, and chances are they might give you a discount rate and free shipping to be competitive with Amazon!", "Date": "August 19, 2012"}, {"Title": "Doesn't synch!", "Author": "C. Cole", "ReviewID": "RJNBD4WIN0US7", "Overall": "1.0", "Content": "So irritating that I bought the multiview camera from amazon less than a month ago...love it... Get an additional camera for my playroom and it won't synch! Assuming that they are different models. Have to return...", "Date": "June 26, 2013"}, {"Title": "Very clear", "Author": "capone", "ReviewID": "R2DCOE75LJGX6V", "Overall": "5.0", "Content": "I got this camera to sinc with my camera and monitor that I bought 2 years ago for my 1st born.  I just had twins, so I needed another camera.  It is amazing how much this camera has improved since the last one.  It has a very clear picture and no problems matching it with the other monitor.", "Date": "April 22, 2012"}], "ProductInfo": {"Price": "$89.99", "Features": "Monitor multiple rooms/children with an extra camera, up to 4 total (sold separately),  compatible with Summer Infant Secure Sight Digital Video Monitor (model # 02040Z) only.\nInfrared LEDs enable automatic black and white night vision in Low-light/darkened rooms for continuous and overnight monitoring\nAdditional cameras enable auto-scan feature with 8-second intervals between rooms\nMicrophone focuses on baby's voice while filtering out background, ambient noises\nAdjustable, swivel camera design allows for optimal viewing of baby\nTable top or wall mountable (wall anchor and security clips included)\nPower ON indicator and AC adapter included\nMonitor multiple rooms/children with an extra camera, up to 4 total (sold separately), compatible with Summer Infant Secure Sight Digital Video Monitor (model #'s 02040 and 02040Z) only", "Name": "Summer Infant Extra Camera For Secure Sight 02040", "ImgURL": "http://ecx.images-amazon.com/images/I/41jOc50o7%2BL._SY300_.jpg", "ProductID": "B004LGSXMQ"}}