{"Reviews": [{"Title": "Please DO NOT BUY this camera", "Author": "W. Design", "ReviewID": "R8SGNDIZYITIK", "Overall": "1.0", "Content": "First I have to say I am AMAZED at how this camera has 4 stars. It is the only reason I felt compelled to write a review. I have purchased 9 different cameras in the last 2 months. The only way this camera has such a high rating is that they paid a bunch of their employees or friends to give this camera 4 and 5 stars. This camera was by far the worst out of the 9 cameras I tried. I didn't get a lemon, read the reviews carefully. Skip all of the positive reviews. You can throw a dart against any results for outdoor ip camera on Amazon and you will be doing better than if you pick this camera. This camera is below sub par. The night vision is unusable. The halo created around the image is horrible!!! The image is just barely visible. The camera resets frequently. I thought it was because the camera was on wifi. I purchased the top of the line repeater. I have a $180 router. It still dropped the connection at least once a day. When it resets it goes back to a position that you can not control. I tried direct connecting the camera and guess what??? Yes the camera still dropped connection (even though every other camera has worked flawlessly when direct connected). There are much better options, a well trained pigeon would be a better option. I just purchased the Loftek Sentinel Wireless Pan/tilt 3xzoom Waterproof Outdoor&indoor; Dome Camera and it is a much better camera for $30 less. It does everything this camera does without the night vision. If you have night lights you don't need the night vision. If night vision is such a big option with pan and tilt buy the Foscam FI8910W Wireless/Wired Pan & Tilt IP/Network Camera with IR-Cut Filter for True Color Images - 8 Meter Night Vision and 3.6mm Lens (67° Viewing Angle) - Black NEWEST MODEL and put it in a spot where it wont get wet or build a housing for it. The screws in this camera are horrible, they are small like the ones you find in sunglasses and you will strip them or their inserts when you try and remove the dome to focus this camera. The camera comes completely out of focus. There is no firmare upgrades. The technical support and forum answers on their website are laughable. Loftek Nexus 543 Outdoor Wireless/wired Waterproof Ip Camera is a better camera even though it is a fixed camera and much cheaper but the winner in my opinion is Shark $400 or Trivision (a Shark clone) for about $100 less. Whatever you do, do not buy this camera. You will decide that this is a paper weight that you should have returned weeks ago instead of trying to get it to work. You will check your return period. It will have expired. You will be angry and sad.", "Date": "September 15, 2012"}, {"Title": "Agasio A622W", "Author": "Mr TV", "ReviewID": "R1X5JFNUTVZ7XK", "Overall": "2.0", "Content": "The camera itself isn't bad during daylight hours.The functioning / software of the camera leaves a lot to be desired.The box the camera came in is labeled PTZ. It's only PT!The infra red at night is terrible. You have a circular haze all around the picture and hardly any picture.I would not recommend this camera!!!!I had to write a bad review to get any kind of tech support.I have the Foscam FI8910W for my interior and it is great. I'll probably buy another one.How can the same company screw this up is beyond me.", "Date": "June 12, 2012"}, {"Title": "IR lighting reflections.", "Author": "The D-Man", "ReviewID": "R3BEI6BPZTEA13", "Overall": "3.0", "Content": "This product is decent, and passable so far for the price.  I can't really understand why they're NOT using 802.11n wireless, not only for the range but the speed.  The second issue is that the IR emitters at night actually reflect back into the dome glass and make the view a rather fuzzy, and useless rendition of whatever the camera is pointing at.Setup was actually very easy, but as a network engineer you'd expect that.  I could see an average person struggling with the setup.  We have 6 other IP cameras by various vendors from Trendnet to Zmodo.  This is the first supposed all weather camera we've mounted in the \"elements\" of Minnesota.Any kind of optical zoom would have been nice, but it doesn't have it, and not even the digital zoom works in the Agasio Internet explorer control page, nor from our tablets using Foscam settings.The low light sensitivity is actually pretty nice.  The camera quality is average at best, and oddly, the whole glass dome turns when using 360 pan.  I can't see that holding up in the winter, and it's mind boggling why you'd have a weather enclosed dome camera, but choose to turn the glass dome instead of the camera mounting inside the dome.  Weird.Three stars is generous, and largely just due to price.  BTW - its actually a pretty big unit, so be prepared for that.", "Date": "May 16, 2012"}, {"Title": "Real world results for this camera", "Author": "T. Currie", "ReviewID": "R28H3BMXOLK2GD", "Overall": "3.0", "Content": "This product works well, if you do these things....1. Use the wired connection to configure it if you intend to use it via wireless. Very simple to configure if you have basic skills adding things to your Wireless Network, or can read a manual and guess.2. The built-in web admin page is nearly useless , download Mozilla to configure this cam, skip Internet Explorer, it isn't worth the hassle to bypass the IE security since their Active-x object is unsigned.3. If you have a Synology, you need to choose the Foscam 8910W camera (works great), Agasio is NOT a Mfr. in their list. works great with Surveillance Station/DS Cam4. If you use Android, you will need to get \"IP Camviewer Basic\" (unless you have Synology), free from the store.5. If you use Apple devices, you will want \"Livecams Pro\" from the store (unless you have Synology), this is $1.99 (this product actually does multi-cam view and will take you to cameras all over the globe, bonus!)The above was discovered by fiddling and calling support, nothing in the manual will help you with this important info... which makes no sense at all.  It comes with software that finds the camera on your network, and launches you to the awful admin page.The night vision inside was way cool, outside you do have the halo effect mentioned in other reviews, unless the IR can bounce off of something like your house. This produces an outstanding image at night. Out in the open yard, halo, but you still get great picture in the center and you can see clearly out to 35 feet or so. If you could bounce the IR, it might do better at greater distance (I can't test that). For this price, you have no right to expect the image in daylight to be better than it is, excellent price/performance in my opinion. The P/T works properly, but the device randomly resets itself to \"home posistion\" overnight, no way to change home in the interface and telling it not to in the interface does not stop it. The housing is metal, and seems to be very sturdy. This device uses a wall wart power supply and has an ethernet jack on the power cord that is not small, which presents a problem in the average exterior plug box. I had to get a double gang all weather box and extension cord, the power cord isn't very long, you might want to buy these with the camera.Overall, for the price, the housing is great, the day and night images are great, the tech support was good, called back with correct answers (my request) within an hour I think.  The manual, included software, and the web interface are terrible, the halo thing is dumb but does not bother me.  This cam was easy for me to configure, but it wasn't my first rodeo.  I have a Panasonic BL-C230 PTZ, the 2 products are not equal (nor are the prices or the overall spit and polish).  I have yet to configure the triggers/alarms, but will update this if they do not work.If you think all those reviews with 5 stars are not from the company trying to boost the ratings, you might be too easily impressed by reviews. I would just say that I have no idea what the support guys name was, and cannot imagine why I would care, he got me answers though. I am a technology geek and I don't like crappy electronics.  This is not a \"5 Star\" product, but neither does it have a \"5 Star\" price and I will be keeping it... If you need a hammer, don't go buy a screwdriver.", "Date": "August 13, 2012"}, {"Title": "Very good ip camera", "Author": "Bob", "ReviewID": "R2DVIWABGW8KTJ", "Overall": "4.0", "Content": "This is my third ip/wifi cam, the other two being an Astak Mole, and Sharx, and now this Agasio. It works well, no issues out of the box, setup was just like any other ip cam: get it set up on your network, access it's setup page via a browser on your local lan, and voila. Everything as expected, but the users manual is electronic on the CD provided in the box. I bought this as an outdoor, wifi, nightvision ip cam with pan and tilt. It is working great inside, I have not yet set it up outside to determine how reliable and waterproof it is. I use the Blue Iris software to monitor all my ip cams in one window, set up alerts, and provide web acess to all the feeds. Blue Iris did not have a setting for the A622W, but selecting the A601W worked, just FYI. It seems rugged and well built.The only thing I do not like is the all in one cable that is hard wired to the camera. The reset button, power, and wired netwok all use a single cable that has 3 connectors on one end that is hard wired to the internals of the camera. I will use this over wifi, so I don't need the bulk of the thick cable and wired LAN connector, but it cannot be removed and makes mouting it to the wall difficult as the tangle of cable/connectors doesn't quite fit in the small recess on the mounting plate.", "Date": "February 4, 2012"}, {"Title": "Worked for 10 minutes, then dead, dead, dead...", "Author": "Phil Ciccone", "ReviewID": "R1H5E2B1MF7JA3", "Overall": "1.0", "Content": "As others have posted, similar experiences here. The camera will work for about 10 minutes then completely go offline. If you power cycle it, you get 10 more minutes before failing. The IR at night is completely useless with the reflection back from the dome. I suppose a properly designed outdoor camera that advertises use for nighttime should have the IR lights OUTSIDE the dome!! It appears that Agasio is really Foscam, or has purchased Foscam's software as the interface is *nearly* the same. UPDATE: Second camera arrived. Same problems - just now this one stays up a few hours instead of a few minutes! Serious WiFi firmware flaws I assume. Now I have to climb this tree again and take it down!!", "Date": "September 14, 2012"}, {"Title": "No Support", "Author": "jeff", "ReviewID": "R29XHW5A0VCOJY", "Overall": "2.0", "Content": "I guess I should have known when I went to the website and clicked on Support it said \"Coming soon\" I was getting an inferior brand and product. Stay away.", "Date": "March 18, 2013"}, {"Title": "Agasio A622W", "Author": "Amazon Fan", "ReviewID": "R2T3915IFUBZ2A", "Overall": "2.0", "Content": "This is my 4th camera and like the other 3 Agasio cameras, this camera has a lot of promise.  It looks and feels well made.  The picture both in daylight and a night is satisfactory for all my needs.  On the needs improvement side of the equation, the WebUI is buggy and inconsistent like the other Agasio cameras I have bought.  Two of the cameras had to be returned for replacements because of failing or missing functionality.  The A622W works but it is missing the manufactures DDNS (gipcam).  Instead, the setting is populated with Chinese DDNS sites that don't seem to work from the U.S.  Also, even though the A622W has LEDs for night vision, there is no way to turn them On/Off like on the other Agasio cameras (even though the setting for IR on the A612 I have returns an \"Error Unsupport\" message).  When I contacted support (through email, since I can't get them to answer my phone calls) they gave me a short response with a link to the manual for the product which has NO mention of the LEDs.  The best I can say about the manual is that it is obviously a work in progress.  Most of the figures shown in the manual do not match any of the Agasio cameras I have.  When I've contacted support about other errors in the software, the standard response is to update the WebUI.  However, the latest version of the WebUI is not on the website for many of the products.  You can only tell what version of the WebUI is on the website by downloading and installing it on the camera since they don't bother to publish it on the website.  Twice I have put older versions of the WebUI on cameras that shipped with newer versions of this software.  Neither time did it resolve the issues I was having.UPDATE:  4 out of 5 of the Agasio Cameras that I bought have now failed and had to be returned for replacement (Two of these cameras were replacements for the Agasio cameras I originally bought that failed...now the replacements have failed in a matter of weeks.  Agasio charges the customer shipping (both directions) for a camera that fails outside of 14 days.  Also, you have to pay for shipping a DOA unit directly back to Agasio.  They claim they will reimburse shipping charges for DOA units but they have not.  My recommendation is to avoid Agasio cameras because the quality is bad, really bad.  I've wasted so much time and money putting these cameras up, taking then down, boxing up and continually shipping these cameras back to Agasio (and as I said previously, at my expense!)", "Date": "July 8, 2012"}, {"Title": "Poor night performance", "Author": "Buddy", "ReviewID": "R2APUK7U5DKE0I", "Overall": "2.0", "Content": "This was purchased mainly for night time use.  When the ir lights come on it makes a white halo from the reflection on the glass.  This dramatically decreases the field of view.  This is very disappointing.", "Date": "March 11, 2013"}, {"Title": "Resets and moves by itself a lot. Image at night not good. LEDs stopped working", "Author": "Gamer \"Gamer\"", "ReviewID": "RI4708TNXJE2K", "Overall": "2.0", "Content": "The images in the daytime are okay, but at night they are not clear. It is good enough to know if you had someone in your driveway, but not good enough for the police to identify them (had a person break into the car that is within 5 feet of the camera. Was at 11:00 PM. We could see the guy walk up to the car, break in, even looked at the camera a few times, but the picture was not good enough for the police to use to identify him).  The camera also resets itself several times per day and then pans itself away from where you set it (like into a wall). The interface on the camera only works \"ok\" with Internet Explorer, but even then many functions don't work. It tries to install and ActiveX component, and even if you allow it it will not work.  It is probably better to spend more on a reliable camera than this unless you only need very limited viewing or have good lighting at night. Also note that this camera does not have focus or zoom!", "Date": "March 9, 2013"}, {"Title": "good camera, bad manual/software", "Author": "diydan", "ReviewID": "R2G9WG544JGJ1E", "Overall": "2.0", "Content": "I've had the camera up and running for a couple of weeks now and I am very happy with it.  The picture is good, the pan and tilt work fine and the night vision is excellent.  There was some reflection of the IR LEDs off of the plastic dome but it was negligible in my opinion.  The housing is pretty solid and looks nice, almost like an outside light. Physically and mechanically, this is a great camera for the price.  I would give it 5 stars but for the manual and the software interface which are both abysmal.  The manual I rec'd was not for the camera I bought.  Set up was similar but not the same.  I'm fairly savvy with networking and routers so I was able to get it running after about 30 minutes but someone who was not computer-minded would likely have a very difficult time trying to figure out what's going on.  The interface depicted in the manual and the one that comes with the camera are also completely different and many of the buttons in the software do not work (IR LEDs, etc).  Worse is that, things are described in the manual that you really have to work at to figure out in the interface.  That being said, it is possible to figure it out and now that it's up and running, I've had no problems with it, other than one reboot.  I guess I'd say that if you're tech-savvy and you don't mind the steep learning curve, this is a very good camera for the price.UPDATE:  Well, after using this for the better part of a year, I have to downgrade my recommendation.  While the CCD hardware is still in good shape (bright, well-detailed picture) the wireless hardware and perhaps the power systems have degraded significantly.  Shortly after I posted my initial recommendation, I started having issues with reboots.  For no apparent reason, the camera would shut down and restart.  The restart was immediate so it was kind of like a power cycle but I have no idea as to why this would happen.  It could happen at any time of the day or night and there was nothing obvious to blame it on.  Since it did reboot immediately, it was more of an annoyance than anything else and it seems to have leveled off to happening once or twice a month.  The more important issue is the wireless.  About 2 months after I purchased it, I noticed I wasn't getting a picture.  At first I thought it was another reboot, but after looking at the camera, I could see it was working, I just wasn't getting a signal.  I tried connecting it directly to my ethernet and then I got a picture.  So I fiddled with the antennae, checked all of the connections and rebooted.  Still nothing.  Finally, I went into the software and re-entered all of the info for my local net and rebooted again - it worked!  Since then, this has happened 3 times and each time, the only fix I've found is to re-enter the network data.  Again, this is more of an annoyance than anything else (now that I know what to do) but, with the other issue, it's resulted in a lowering of my recommendation.  Hopefully, with the newer cameras, these issues will be fixed, but until then, I'd have to say - stay away from this model", "Date": "June 5, 2012"}, {"Title": "The Camera sends an email on IP change, very easy to setup.", "Author": "Frank J Liptak", "ReviewID": "RBV8XT7AFRRYJ", "Overall": "5.0", "Content": "Works well in my application which is monitoring a retreat building 800 miles away which has a network connection of course.I do not use the Wifi connection, it is hard wired to a router.The Camera sends an email on IP change and works well since it is not a fixed IP and I do not have a DDNS service setup.", "Date": "November 24, 2013"}, {"Title": "Hard to set up and motion sensor does not work", "Author": "Rockntractor", "ReviewID": "R312C8VXOHETDD", "Overall": "1.0", "Content": "After three weeks of fooling with it we finally got it online but motion sensor does not work. It will send you literaly 100's of false alarm pictures in a day but will not trigger when you jump up and down in front of it.Spent so much time setting up that we are past return time.Very poor choice and will not buy any more Agasio products", "Date": "May 27, 2013"}, {"Title": "Poor man's security camera", "Author": "Not My Real Name", "ReviewID": "R1DAGWFFT4Z8K6", "Overall": "2.0", "Content": "Low resolution. Can't be controlled by some 3rd party foscam-compatible apps. Reflection from glass dome. Servos are shaky. Ir is low power.Update: image is shaky/corrupted - am sending back for a replacement. IR halo is really problematic.", "Date": "November 1, 2012"}, {"Title": "Good camera, if only it would keep working", "Author": "Gary", "ReviewID": "R21LYWBGBURAT7", "Overall": "2.0", "Content": "I really wanted to give this camera a good review, as it worked great when it worked. The glare from the IR LEDs was not too bad...just a faint halo around the edges, and the daylight color was very true to life. But after a couple of days, it kept dropping off my wireless network. The only way to get it back was to disconnect the power, then reconnect it. I replied to the email from Foscam about my purchase, and told them about this. They told me to try changing channels and move the camera closer to the router. This helped for about a day and a half. Then it dropped off the network again. So I ran a temporary network cable out to the camera. The next morning, it was off the network again. I checked the list of attached devices in my router software, and the camera was listed as connected, but It would not show up in the camera software. Also, when I clicked on the \"Audio\" icon, all I would get was a loud buzz. I returned the camera to Amazon for a refund and ordered a new one. The second one worked great the first day. But the next day, it was stuck in the IR mode, with a black & white picture that would constantly flash, as it was getting too much light for IR mode. I tried resetting the camera, which erased all my wireless network programming, and changed everything back to factory default, but it was still stuck in IR mode. Also, I could get no audio out of this one. I may just have gotten a couple of lemons, but I didn't want to chance trying another one, so I just returned the second one for a refund, then I ordered a \"Loftek Sentinel D3 4-9mm 3x Optical Zoom Lens Outdoor Waterproof Wireless Pan/tilt Night Vision Dome Camera with Ir-cut Off Filter, Auto-iris\". This camera looks almost identical to the Agasio, but it has a 3x optical zoom lens, and it is slightly larger. Hopefully, this one will preform better.", "Date": "August 15, 2012"}, {"Title": "Excellent Camera and a great price!", "Author": "Techno Geek Guru \"Dave\"", "ReviewID": "R13YOZLV4TK300", "Overall": "5.0", "Content": "I've owned this camera for 5 months now. Over the past 10 years I've owned more than a dozen network cameras. Today I have eight running at home and my parents place. I have had some bad cameras in the past and some great ones! So far this camera has worked extremely well.Installation:I mounted the camera on the corner of my house in under 30 minutes, ran the Ethernet cable with external power over Ethernet adaptors and had it up and running in under an hour. Although this unit is wifi capable I always run cameras on Ethernet as its much more reliable. In addition, you need to power the unit so why not kill two tasks as the same time and run power over the Ethernet.About the Camera (Physical):  The camera itself is built from solid material. The dome will swivel around to the required spot and by undoing the 3 nuts at the top it will allow you to remove dome enough allowing you to get your drill into place to screw & mount the arm against a wall.  Once installed, the dome can be then screwed back into the elbow at the top. The camera and IR inside the dome are mounted very flush against the glass so there is no reflection of the IR off the glass back into the camera. Many other cameras have this problem! The camera makes very little noise when it's being moved. The IR sensors create a very small red glow in the dark but are very hard to notice. The camera has functioned perfectly since day one. I'm not sure what the specs say but the camera has functioned without a problem down to -20F. The motors that move the camera and the electronics have functioned flawlessly. I have not used or tested the wireless portion of the camera and would suggest which ever camera you purchase to do whatever you can to use a network cable and power over Ethernet if need be.Camera Software:The software is probably the biggest downfall of the camera. When you login it gives you 4 different options to use (IE mode, push or VLC modes for Safari/Firefox/Crome and snap mode for cell phone). In some ways this is good as you can select what kind of view/software you would like to use and you're not using some software that kind of functions as it was designed for another browser. Although it works with all browsers it has a few more functions with IE and a slightly better outlay. The overall software could be given a little sharper look. The buttons have no names but are easy to figure out with 5 minutes of using the camera. As everyone has their own preferences it takes only a few minutes to go through all the available menus to set your preferences. One downfall is the OSD (On Screen Display) of the time and date. You can set this to any color which is fine but as the camera moves the background color changes making the OSD unreadable a lot of the time. They need to enable a black box to appear around the OSD so it's always viewable. The software has many options which really help you overcome any unique problems that come up like flipping the camera, DSL settings, screen rate, dial up, FTP, PR speeds and the list goes on. The camera responds very quickly with all commands. I have accessed the camera from home and away on my laptop, mobile phone and IPAD in the US and overseas and each time the camera worked perfectly. I have some 3rd part software on my IPHONE and IPAD that access all my cameras and the camera is supported by this software. I have never had to reset or reboot the camera to fix any issues. The good thing about any of the minor issues I mentioned, a software update can easily take care of any of these issue.Camera Image:The image is very clear and looks great whether viewing it on my IPHONE, IPAD or laptop. I had it set to full frame rate and can achieve that most times. The night vision works very well with great range on the IRs and no reflections back into the camera. I found the IRs can be just a little bright when the place is covered in snow but it's hardly noticeable.Overview:I would recommend this camera to anyone who would like to monitor outside a home or business. It could be also used in larger inside areas as well such as a garage. With very little network or computer knowledge most people should be able to set one of these cameras up. I would suggest using a static IP address where possible and you must forward ports on your router to make this viewable outside of your home or business.  Unless anything changes I will give this a 5 star rating.", "Date": "January 25, 2013"}, {"Title": "Not Impressed!!", "Author": "J. Kyle Harris \"JK\"", "ReviewID": "RDE6QPC19FTWC", "Overall": "1.0", "Content": "Received the camera and got it on my network and working over the Internet with little difficulty.  I was just ready to get it mounted when I thought I better look at the video one more time.  The video started jumping and going all different colors and only showing on half the screen.  Thank goodness I didn't mount it on the side of the barn and find the defect!!  So, I returned it and will look for a better quality camera.", "Date": "August 26, 2012"}, {"Title": "Great product, bad customer support team....", "Author": "Jeff A Kriezel", "ReviewID": "R3VF1EFVHCBYB7", "Overall": "4.0", "Content": "If you have the courage to set this up yourself then you will be very happy. If you are one that would need help through customer support, you will probably never get them to answer. The camera itself was perfect, but I had never set one up before and I wanted to view it from my android phone. with a little research about ddns servers, I was surprised at how easy it was.  My best advice is to make sure you plug it directly into the router via cat5 to access the menus at first. Once setting up the WiFi is complete you can unplug it and move it to any location with a power source. Once I figured it out, I was so happy with the quality of the video and smoothness of the pan & tilt. I bought one more and set it up in minutes.  BTW this camera does not support zoom, or Microphone.....The infrared night vision is awesome and on the droid phones I recommend using TinyCam monitor pro for about $3.99 also works with the Kindle Fire and is so clear. you won't be disappointed with the picture quality either.  Love it!!", "Date": "April 13, 2012"}, {"Title": "Poor image quality, out of focus", "Author": "J. Canfield \"John - old geek\"", "ReviewID": "R13RXPHO2XQCZ1", "Overall": "2.0", "Content": "Update 9/27/2012:Cam returned and received by Amazon :-) Thank you Amazon - you rock!!  Just ordered the new Panasonic WV-SW175 pan-tilt outdoor cam.  This puppy will do 720P (1280x960) and is rated IP55 outdoor.  I'll be doing a review on this cam in a couple of weeks.  Street price is in the $500-600 range.  I'm very comfortable with Panasonic cams - I have five of them.------------------------------------I *really* wanted to like this camera due to the attractive price and since I needed to replace a very old Toshiba PT outdoor IP cam that isn't working well, but after three weeks of evaluation, this cam is going back to Amazon :-(First off, this cam does not have audio capabilities in spite of the user interface with those available options which leads me to believe that not a penny (yen) more was spent on on software/firmware development than absolutely necessary to get this camera to market.  While talking about the user interface, the cam movement control buttons provide no visual feedback (as in a mouseover action) that the buttons are active and your mouse click actually was received by the cam.The user feature set needs to *much* more robust.  For one example there is no choice about an uploaded file name (the ability to overwrite an uploaded file.)  My Toshiba and Panasonic cams have options that let you upload a file with the same file name for overwrite.  I have a web page which gets a new image uploaded every one to two minutes and the image *must* have the same file name in order for it to be viewed.  Only having timestamping for a file name doesn't work in all situations.I found color balance to be pretty good in an indoor daylight situation, IR night vision worked fairly well, and auto exposure indoors was surprisingly good (but a little slow to respond to changing light conditions.)Colors were somewhat washed out outdoors in bright light but the primary issue is poor image quality, either outdoors or indoors.  Areas of the picture are noticeably out of focus, I'll upload a sample picture and you can decide for yourself.Another problem was the one-shot or save picture feature (take a still picture) worked one time.  Every time I tried to capture a new still image, I always got the first one I snapped.Emails to support were not promptly answered.Lastly, when will the makers of these cheap outdoor cams realize the dongle MUST GO!  I want a cam with PoE capability and no exposed dongles!Final thoughts:I have come to the conclusion that there is NO WAY you are going to buy a quality outdoor PT or PTZ cam for under $500.  If you find one, let me know.  In the meantime, I'm looking closely at the ACTi line of outdoor cams, particularly the KCM-7211 - it's an outdoor HiDef PTZ (optical zoom with auto focus) with PoE - street price seems to be around 700 bucks.EDIT:  Oops.. The KCM-7211 is NOT PTZ - the lens is fixed :-(", "Date": "September 23, 2012"}, {"Title": "Agasio A622W", "Author": "GEDS", "ReviewID": "R1ANL4ZPRMFDLQ", "Overall": "3.0", "Content": "The images from the camera are great, even in darkness due to the IR filter.  Set-up is not too bad if you have setup other cameras before.  The Active X required for the camera is unsigned, so you need to disable some of your desktop security to install it.  Documentation could be improved!  I am using the wireless feature to connect to this camera.I have had this camera now for about a month.  What I have found is that the camera randomly moves to its home position.  This could happen in a few hours or a few days, but it will happen.  I have not found a way to define a new home position on this camera, as can be done with many models of Panasonic PTZ cameras.  The other issue this camera has is that it will stop sending video.  This has happened twice now.  When this happens, you need to log into the camera to restart it or you must unplug it.  I have mine hooked up to a timer now.I use IP Cam Viewer on my smartphone to manage my cameras.  What I have found is that you can control most of the PTZ functions of this camera if you define it as a Foscam FI8904W.I haven't been able to find another wireless PTZ camera with IR in this price range.  For now I will live with a timer and hope that a firmware upgrade will address the issues I have.", "Date": "June 14, 2012"}, {"Title": "Poor quality and unreliable", "Author": "Scimanic", "ReviewID": "R3CULGYUNM5BNI", "Overall": "1.0", "Content": "Although the I like the physical design of this camera (1 star for that), the firmware/software has a lot of issues. After receiving this camera, I tested it for a couple of weeks before installing. after a few days it locked up (could not access using using the \"IP Camera Tool\" supplied with the camera or via the web browser. It seemed to get worse as time went on (locking up daily). In addition, the image would distort (image and color distortion) after changing resolutions. This distortion also showed in video recordings. I suspect there is also a manufacturing quality issue as I observed a piece of metal (possibly a component lead clipping) resting inside the dome. I took a chance with this camera and lost. I had to pay shipping back to FOSCAM. very disappointed.", "Date": "March 7, 2012"}, {"Title": "You get what you pay for - would not recommend", "Author": "RK \"roka\"", "ReviewID": "R25USSA0QRE4EM", "Overall": "2.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3S7A1BUCYFRDEembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3S7A1BUCYFRDErefresh_preplay() {\n\ndocument.getElementById(\"cv_mo3S7A1BUCYFRDEchiDiv\").innerHTML = document.getElementById(\"cv_mo3S7A1BUCYFRDEhiddenPre\").innerHTML;\n};\ncv_mo3S7A1BUCYFRDErefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3S7A1BUCYFRDEso;\t   \n\n\nfunction cv_mo3S7A1BUCYFRDEloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3S7A1BUCYFRDEso = new SWFObject(swfLocation, \"cv_mo3S7A1BUCYFRDEAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3S7A1BUCYFRDEso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3S7A1BUCYFRDEso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3S7A1BUCYFRDEso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3S7A1BUCYFRDEso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3S7A1BUCYFRDEso.setAttribute(\"height\", swfHeight);\n          cv_mo3S7A1BUCYFRDEso.setAttribute(\"width\", swfWidth);\n          cv_mo3S7A1BUCYFRDEso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3S7A1BUCYFRDEso.write(\"cv_mo3S7A1BUCYFRDEflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3S7A1BUCYFRDE', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3S7A1BUCYFRDE';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3S7A1BUCYFRDE', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3S7A1BUCYFRDEloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3S7A1BUCYFRDE\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m37C41GP04Y40T\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m37C41GP04Y40T\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R25USSA0QRE4EM\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m37C41GP04Y40T/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3S7A1BUCYFRDEduration')) {\n      document.getElementById('cv_mo3S7A1BUCYFRDEduration').style.display='none';\n    }\n    cv_mo3S7A1BUCYFRDEloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3S7A1BUCYFRDEloadSwf(movieID, playerVersion) {\n   return _cv_mo3S7A1BUCYFRDEloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3S7A1BUCYFRDEnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3S7A1BUCYFRDE', 0, h);\n}\n\nfunction cv_mo3S7A1BUCYFRDEresetPlayer(w,h,bw,cc) {\n  cv_mo3S7A1BUCYFRDEnewHeight(h);\n\n  cv_mo3S7A1BUCYFRDEso.addVariable(\"resetBandwidth\", bw);\n  cv_mo3S7A1BUCYFRDEso.addVariable(\"cacheCode\", cc);\n  cv_mo3S7A1BUCYFRDEso.setAttribute(\"height\", h);\n  cv_mo3S7A1BUCYFRDEso.setAttribute(\"width\", w);\n  cv_mo3S7A1BUCYFRDEso.write(\"cv_mo3S7A1BUCYFRDEflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3S7A1BUCYFRDERollOverImg = new Image();\ncv_mo3S7A1BUCYFRDERollOverImg.src = \"http://ecx.images-amazon.com/images/I/915GsW0xNOS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3S7A1BUCYFRDEpreplay = document.getElementById('cv_mo3S7A1BUCYFRDEpreplayImageId');\nif (cv_mo3S7A1BUCYFRDEpreplay) {\n  cv_mo3S7A1BUCYFRDEpreplay.onmouseover = function() {\n    cv_mo3S7A1BUCYFRDEpreplay.src = \"http://ecx.images-amazon.com/images/I/915GsW0xNOS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3S7A1BUCYFRDEpreplay.onmouseout = function() {\n    cv_mo3S7A1BUCYFRDEpreplay.src = \"http://ecx.images-amazon.com/images/I/915GsW0xNOS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3S7A1BUCYFRDEpreplay.parentNode;\n\n  var cv_mo3S7A1BUCYFRDEcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3S7A1BUCYFRDEcurrentClick) {\n      return cv_mo3S7A1BUCYFRDEcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:28 MinsI have very similar experience with this camera like other reviewers here.My scenario: Mounted on the front of the house (2nd level) to overview front yard, street and driveway.Main issues:- poor night vision (circular haze)- image quality (it is only a 640x480)- would sometimes just fail and needs to be powered off and on to reactivate- pan/tilt presets are off at times (your preset would not set the camera in the position you thought it would)Seeing how fast the IP camera world is moving today, I would not buy this camera again. There are better cameras available. 2-3 MP PTZs are still expensive though. But if you can live without PTZ, then look for IPC/Dahua or QSee cameras.Note on the provided video: This camera is a little older than one year at this point. It's subject to all weather (Austin, TX) besides snows and anything below 20F.", "Date": "December 26, 2013"}, {"Title": "Buyer beware", "Author": "W. P. Hill", "ReviewID": "R2H5FYZSO67N2U", "Overall": "2.0", "Content": "I recently two of these cameras for use in my home on a Mac OS system with AirPort Extreme. I should have believed the ratings of other buyers of these cameras. There are some positive aspects in fairness which I will point out. The camera is a well made sturdy instrument. Set up on my Mac OS AirPort Extreme router was relatively easy as I am pretty capable in the port forwarding process. Both cameras were wall mounted outside my home. Let me state that if you only want to use these cameras for daytime viewing, the picture is excellent and the camera works very well in it's pan and tilt ability. If you expect to see anything outside at night, forget about this camera. The fact that engineers would allow a product of such poor or non existing night ability to be offered for sale is a poor reflection on the company. All night viewing except under high wattage spotlights is distorted by a halo effect which renders this product useless.", "Date": "June 24, 2013"}, {"Title": "Circular Haze", "Author": "Edwin P. Thomas \"edth\"", "ReviewID": "R39Y0XV2IY94MC", "Overall": "2.0", "Content": "The daytime pictures are fine but at night it's difficult to see anything at all. The ir leds are reflecting off the dome into the camera. If this was fixed I would rate the camera 5 stars.", "Date": "June 8, 2013"}, {"Title": "good front end product with bad supporting features.", "Author": "shadowplyr", "ReviewID": "RCVRDOELMV2ZZ", "Overall": "3.0", "Content": "this is a great product on the front end, the camera is well built and looks really high end one thing that i dont like is the power cord for it, it breaks off halfway down into some..... weird halfway clip off cord....i really dont even understand how to explain it.... set up was relatively simple, plug it in, insert CD and boom you are set (unless you have to manually change the camera's IP address because the pre set one doesnt work with your router but if you are a little tech savvy its not an issue)now that i had my camera on....i wanted to check it out!!! on chrome just enter the IP address...and.... logged in, this is super sweet guys! good quality picture, smooth transition with refresh rate... man this is nice... but whats this?!?! i can log in with I.E and i get more features?!?!!? well that seems silly but let me try it... ***this is where the bad supporting features start....first off to utilize I.E. you have to disable pretty much every security feature imaginable because the certificate that the product uses cant be verified (for some reason) even with doing this, literally removing ALL security features i couldn't get it to work on I.E. so the audio, capture picture, and voice features i guess i will just never get to use (not a huge deal)SECONDLY there is no app for your smart phone, does it work on your smart phone? yes... barely.... you have to figure out what your actual home IP address is and enable port forwarding and then you have to type your IP address into your web browser on your phone... not a huge deal right? should be ok!!! but no, this is the biggest downfall of this product, the load time is crazy long, the picture is a captured picture refreshed every 15 seconds (from what i can tell) i tried to learn how to clean it up but i couldn't figure out a way to do it.TL;DR?pros;good designsleek lookgood pricegood quality picturecons;bad softwareno app for smart phonesmakes you disable security features on your computer to utilize all featuresoverall.... for what i will use it for (letting the GF watch the dogs play outside while she is at work) it will be perfect and fine with no issues (although a zoom would be nice) but if you want something that is VERY easy to use and requires no tech savvy on your part... this probably isnt for you... and if you need to use a security camera on your phone DO NOT GET THIS PRODUCT... maybe they will come out with a app for it and then we can revisit this fact.... i have not used it except for set up since it is a christmas present so i will let you know more after christmas!", "Date": "December 10, 2012"}, {"Title": "Not the best choice for an outdoor Foscam clone", "Author": "Curtis Walker", "ReviewID": "RSQMYXAWFAK7T", "Overall": "2.0", "Content": "I purchased one of these for a home in Las Vegas. It is placed underneath a patio awning to keep all direct sun and moisture off it. The included power supply is similar to that of the Foscam cameras, but mine emitted a noticeable buzzing. The video from the camera even fritzed out and glitched while I watched it, something I'd not seen any of my wireless cameras do before. Fortunately, I had a few spare 12v transformers lying around, so I switched the camera over to a more robust model. That stopped the fritzing out, but the IR lens filter will no longer cycle. It is permanently stuck in \"day\" mode, so that I can't see anything at night.After stating the above to the seller, I was told they would be happy to resolve my issue by issuing a replacement power supply. The camera is junk. Buy a camera without built in IR +a weatherproof IR LED array, and you will have a more useful setup, IMO. If purple grass really annoys you, get a camera with an IR cut filter, but be aware that it might get stuck either open or closed, if you are unlucky as I am, with your purchase.The lack of warranty support is troubling, but not unexpected.", "Date": "November 25, 2012"}, {"Title": "Customer reviews true...", "Author": "Lawrence J. Kindrick", "ReviewID": "R1463CHUWBY672", "Overall": "2.0", "Content": "I bought this camera on a whim. I didn't really need it but it was on sale and I thought I'd take the chance.  I've got a few other fixed web cams around my house/property and I liked the Pan/Tilt. I read several reviews and they mainly said the same things which came true on mine. I set it up inside to check it out and had it running for over a week. I found that it dropped off the network several times which required a power reset to get it talking again. When it did stay on the network for 24 hours it would reset twice a day and go to it's home position. I'm using Blue Iris and all my other cameras stayed up with no problem when this cameras dropped off. Not so good for surveillance when it doesn't look at what you want to see. Since I didn't really need it I'll consider the experiment failed and just return it. Since I never had it mounted outside I can't speak to other performance issues.", "Date": "September 17, 2012"}, {"Title": "BETTER THAN EXPECTATION", "Author": "Henry L. DuPlantier", "ReviewID": "R2S2IF0Z09M980", "Overall": "3.0", "Content": "I received a well packed and manufactured product.  After initial startup I could not get the unit to operate so I contacted TechSupport who had me up and running within 5 minutes of me dialing the tech support number.  I was able to configure the unit via the RJ45 port.  I will say, having some light networking knowledge will help you configure the unit a little faster.  After confirming the unit worked well using the RJ45 I went onto configure the wireless portion which worked great until I installed the unit at the permanent location.  I could no longer control the unit or see it on my network.  Instead of calling tech support I read other reviews to see if other's who purchased may have had similar problems.  The answer is yes.  Here is how I fixed my problem.  First I had to understand that the camera operates in wireless-G frequency, my router is an N.  Simple fix, I put the router in mixed G and N mode.  I then had to figure which channel of the wireless-G worked best for my camera.  After all of that it would work for a few hours and then stop again.  Finally, I figured I would put my software in garage pulse signal mode.  That configuration seems to have fixed the problem.  After installation, weather proofing the RJ45 connection and reset button was needed since the wires are not long enough to be routed in doors.  I am extremely pleased with the video, control, but mostly the sturdy manufacturing of the product.I only give this a 3 star because there is not much information in the manual on how to reset the unit or that it operates in wireless G mode.  Had that been in the manual my set up time may have gone from 5 hours to 1.  Overall, this is a steal of a quality product for the price being offered.  I would recommend it to others.", "Date": "September 14, 2012"}, {"Title": "Decent.  IR leads to washed out haze", "Author": "AndrewCCM \"Andrew - Crystal Clear Media\"", "ReviewID": "RA1P303XGDDCH", "Overall": "2.0", "Content": "I have several (6) IP cams as part of my security setup.  I was excited to get this one.  However, if you plan to rely on it's IR ability, you may be disappointed.  At night, the surrounding area looks like a wash of haze (like inside a cloud).  I can barely make out what's in the picture unless the subject is directly in front of the camera and only a couple of feet away.  I ended up just disabling the IR functionality.  My other cameras do not suffer this problem and blast out IR clean and clear.  I am not certain what is causing this on this particular model, but it's not usable in my opinion.", "Date": "September 13, 2012"}, {"Title": "Great Camera / Poorly Thought Out Design", "Author": "A. Martine", "ReviewID": "RP36OZNTRMU9L", "Overall": "3.0", "Content": "I'm really torn on this review of the Agasio A622W camera because as a pure-play camera it provides really great quality recordings for the price range.  The night time recording is good (a little reflection but mostly okay) and the daytime footage is great.BUT, for some reason the engineers decided to only make 50% of the product ready to be an outdoor camera.  The casing is very robust and it looks like it'll last some time, but they didn't design the power cord to be outside and in the elements, nor did they make this version Power Over Ethernet.  The power cord - simple brick with a thin wire isn't ready to be outside all the time, there's no direct 110V connection and I need a separate injector to push power to it via ethernet.It just leaves me feeling like they hit a long fly ball to deep center field that was subsequently caught on the warning track.  I'd recommend this camera to someone who wants it in a sheltered location or can get creative with injectors, but for folks who need it to be really outdoors, I'd recommend another version.", "Date": "September 6, 2012"}, {"Title": "Wireless Is Unreiiable  - Nightvision Is Worthless - No Firmware Updates Since Release - Poor Support", "Author": "grumpyolman", "ReviewID": "RC8HHW8VGM9BY", "Overall": "1.0", "Content": "Other than that, it looks  nice but you could have bought a dummy cam for $20.  Even with a dedicated wireless access point ten ft. away with no obstructions, it constantly drops out leaving you with no signal for several minutes at a time - usually when you need it most.  No firmware updates is puzzling - page under construction for 2-1/2 years.  They obviously didn't get it right the first time. As stated in other reviews, the LEDs should be outside the dome, not inside where the reflection wipes out the image.Hard wired indoors works fine but there are much better choices for that application.", "Date": "June 12, 2013"}, {"Title": "It works, but it's not a winner.", "Author": "D. Briddle", "ReviewID": "R9THKD7X9GC4C", "Overall": "2.0", "Content": "I am a tech very familiar with IP cameras.  The only reason I gave this two starts (instead of one), is that I did get it to work.The user interface is very difficult.  I had much difficulty getting the software installed in IE.  I followed all the guides on what to do, even tried it in IE on both Win7 and Win 8.  I did get it working a few times but then IE stopped working and would give an error and close.I was able to access the software functions properly in Firefox using the IETab addon.During the daytime, the picture is fabulous.  With IR, it's just ok.When searching for support, I found the company's forum to be full of spam messages and functionally useless.  Even the company's website is sprinkled with obvious signs that they have hurried through a WordPress setup.I'll let you know how this works out.", "Date": "May 31, 2013"}, {"Title": "A622W better than expected", "Author": "Eric", "ReviewID": "R3V0KUXUD4AD2B", "Overall": "5.0", "Content": "I was pleasantly surprised at this unit. I have purchased and used much more expensive units for commercial installation. This one was for home to monitor the pool area. I had low expectations for a $189 PTZ IP device with IR. Setup was quick and mounted under the eves, connected via CAT5e. I have not tested or tried the wireless. I am able to view via web and iphone. Works great day and night. The limitations are:- The device will not go non stop 360 (there is a stop and you have to go the other direction- The resolution is low- No PoEI recommend this device as a low end device with many features.", "Date": "September 18, 2012"}, {"Title": "IT expert", "Author": "Salvador Salgado", "ReviewID": "R2D5JROLBPFWPE", "Overall": "1.0", "Content": "Electric motor that allows for tilt and pan stopped working 5 months after purchase, Product only has 90 Day warranty, will not buy from this manufacturer or seller again", "Date": "March 24, 2014"}, {"Title": "GOOD PRODUCT", "Author": "Jaroslaw R.", "ReviewID": "RFST0FT1733I2", "Overall": "5.0", "Content": "GOOD QUALITY, NOT TOO COMPLICATED SET UP.  GOOD APPS WORKING ON ANDROID. STRONG ALUMINIUM BODY. ONLY WEIRD ALL  CLEAR DOME IS MOVING. RECOMMEND  IT!", "Date": "November 27, 2013"}, {"Title": "Terrible, just plain terrible.", "Author": "Computer Nerd", "ReviewID": "R1TN9B9CBYF6BW", "Overall": "1.0", "Content": "Wow.  I'm literally stunned at the consumers here who offer a 4-Star rating for this camera.  It's 1-Star, at best.  First off, the picture clarity is abysmal.  I have this camera as part of a 6 camera group that I have monitoring my property.  The Agasio A622W is installed in front of my home so that I can log in and check on my property while I'm at work or away for any extended period of time.  The picture quality is pretty bad and the quality is even worse at night.  The glare from the street lights distorts the images and the only utilities offered to tweak this are the Bright and Contrast options in the web interface.  Speaking of web interface, this has to be the clunkiest interface that I've ever used.  First of all, it doesn't (the web interface) work well unless you weaken all of your security in Internet Explorer.  When you do this, Internet Explorer even warns you that your computer is at risk.  Great.  Firefox and Chrome work also, but you will NOT get all of the options that you would ordinarily get using Active X in Internet Explorer.  It gets better.  When this camera reboots, it's not smart enough to go the last position where it was, it goes back to the factory default position.  Terrible, just terrible.  Do Not believe the advertisement for this camera that says it has \"True Color\" Images, that is a 100% lie. When I look out from this camera my grass is gray, not green. I even called Agasio (Foscam) and had them remotely log into my computer and try to adjust the settings, no luck.  Also, the DDNS for this camera is not free, so you will have to pay for a DDNS host if your home environment does not have a static IP address.  The only thing good about this camera is that it's  nice looking, but when it comes to performance, save your money.  Folks, take it from a guy who has 6 cameras, you will NOT be happy with the A622W.  When a product is goo, I'm more than happy to praise it.  But when something is bad, it deserves equal air time.", "Date": "October 2, 2013"}, {"Title": "Fantastic", "Author": "Clifton Cabaness \"Doug\"", "ReviewID": "R2K867SHHMPMDS", "Overall": "5.0", "Content": "Kate at Foscam was great!!! She took control remotely and set up my camera very quickly we are extremely happy with this camera and look forward to continued shopping with Agasio!!", "Date": "August 27, 2013"}, {"Title": "Great Service by Foscam rep on the Agasio A622W Outdoor Wireless Pan/Tilt IP Camera", "Author": "Patrick S.", "ReviewID": "R2UENHTOGE6W21", "Overall": "5.0", "Content": "Agasio A622W Outdoor Wireless Pan/Tilt IP Camera with IR-Cut Off Filter for TRUE COLOR Images (Not Washed Out), Auto-Iris (Auto-Brightness Adjustment), IP66 Waterproof Enclosure, 50ft Nightvision, 4mm lens (72° Viewing Angle), Synology & Blue Iris Compatible, Pan 360° Tilt 90°, White]]mpatible, Pan 360° Tilt 90°, White (Electronics)The camera was easy to setup for viewing but because of the instructions on getting the alerts sent to my email, I had to call Foscam.  I got connected with Allen Smith and then Ralph in no time he had we setup with emails and config for Live Cam pro.  Also Ralph got me setup for remote operation...what a great team!!  It was a pleasure dealing with Ralph...thanks!!", "Date": "August 26, 2013"}, {"Title": "it doesnt work in the darkness", "Author": "alejandro arguelles", "ReviewID": "R23U5SBCY8SDVI", "Overall": "2.0", "Content": "The plastic of the lens forms a halo that obscures well in the dark image. Please not buy this cam! !,", "Date": "August 5, 2013"}, {"Title": "A total loss of $$ absolutely JUNK", "Author": "Carlos A. Barberis", "ReviewID": "RMBDN8GJ0I76N", "Overall": "1.0", "Content": "I purchased this camera almost six months ago to keep an eye over the web on my pool area in my house in Florida. It has been nothing but problems the camera goes into strange modes and resets even when no power failures have ocurred. I have four other wifi cameras in this house and not one has failed or ever given me as many problems as this cam has.  Most of the time I have to send out a neighbor to recycle the power so I can get the camera back on line. It is rare to get five continuos days of normal operation. Finally this camera seems to have gone south and no longer works.  I will be replacing it with another cam, definetely not this model or manufacturer.I strongly advise anyone contemplating the purchase of one of these to look elsewhere unless you want to lose your money. My review shows one star, but it should be negative five stars", "Date": "August 4, 2013"}, {"Title": "Great at daytime", "Author": "Machinematrix", "ReviewID": "R2IZ89GJ8JUHO0", "Overall": "3.0", "Content": "Daytime is great, but getting dome glare from IR's at night.  So much that you are forced to turn off IR's at night for clear picture.  Still working on solutions for this issue.  Also, firmware does not return cam to last position after a power blink.  I don't like to have to check often that it is pointing where my home position needs to be.  Otherwise bot to bad a unit...", "Date": "January 31, 2013"}, {"Title": "Not happy with Wi-Fi", "Author": "Third Rock \"Third Rock\"", "ReviewID": "R1OILY2KR29LAQ", "Overall": "2.0", "Content": "I ordered four of these but returned one because the Wi-Fi would not work out of the box.  I've had the remaining three cameras in operation for about four months.  I'm using a LinkSys 802.11g wireless access point that has been in place for over a year and have had no problems with it.  Two of the cameras are 50 feet from the WAP and one is 30 feet from the WAP.  I have had problems with the signals being lost on all three cameras daily.  I changed my WAP antenna to one that is for longer range and this did not help any.  I've been connecting a laptop to the same WAP just as a reference and have had no problems with signal loss.  I even moved the WAP to about 20 feet from one of the cameras and was still losing signal.I finally ran Cat5e cable to two of the cameras and all is working great now on those cameras.  The third camera that is at 30 feet is still losing Wi-Fi signal daily.  I'll be running Cat5e cable to that camera soon.I purchased this camera for the Wi-Fi capability so I would not have to route any cables.As for the images I have no complaints.  The colors are good.I'll not be buying any more of them.", "Date": "January 21, 2013"}, {"Title": "Technical Support, Great  -  Feature performance, Poor", "Author": "JOSEPH", "ReviewID": "R2YH0U98NSRHBS", "Overall": "1.0", "Content": "Outstanding technical support with regard to helping me interface the IP camera to the internet. They helped me down load Google Crome so that the camera worked. Camera works but have not had the time to check out all of the options.Follow-upAfter learning that that Internet Explorer was not supported I was advised to down load Google Chrome. Once Google chrome was openrd the camera image appeared on my PC. The only problem was that all of the options that were available for IE were not availble for Google Chrome. This made the camera overpriced for the money and as a result is being returned to Amazon. I don't mind the two hours of time spend getting an education but I do mind when the product is not capable of acheiving most of its specified paramaters. Once again the technical supprt personal who help me correct the problem was outstanding and knew exactly what the problem was. The real problem is the manufacturer because they clearly didn't state the limits of the software.", "Date": "January 7, 2013"}, {"Title": "Good", "Author": "nitevision eyes", "ReviewID": "R37OK1PDG53RVP", "Overall": "3.0", "Content": "The product is good apart from that I am yet to figure out how to record images. It has great quality pictures especially during day time and also has a great pan and tilt angle. gave it a 3 coz I have tried everything but it still aint recording. I have called the customer service countless times but they always put me on hold so I am almost giving up.", "Date": "November 23, 2012"}, {"Title": "Borerline Acceptable... sort of....  If I am in a good mood.", "Author": "The real Amazon fan", "ReviewID": "R175S6ZP51XFM0", "Overall": "3.0", "Content": "I use this over my driveway outside and for the most part it 'works.'  I can monitor my vehicles parked outdoors, or watch my kids get on/off their school bus.The images are clean if it's not too bright outside.  The camera flickers during a sunny day.  It appears it cannot auto compensate brighteness and it flickers between dark and light screen modes.  There is on firmware as of 9/20/2012 that fixes this, atleast Agasio doesn't seem to.Night vision image is sort of acceptable.  Not pro-quality sharp images by any means, but it's enough that I can tell if it's a dog or a human walking along the edge of the driveway.  LOL  Yah I know, sounds like a joke but it's not.The Agasio software is rather terrible.  It's a pc-based software and it has no capability to program tilt/pan settings.  I can still see the image and pan/tilt via my mac but again, no programming.I am using my android app called IP CamViwer Pro.  Combined with this app, it's pretty good.Will see how this thing works in the winter with snow...", "Date": "September 20, 2012"}, {"Title": "A622W is a nice product", "Author": "Casual Shopper", "ReviewID": "RJK9CNQHRSW0", "Overall": "4.0", "Content": "The A622W is a nice product. Feels very solid. The API documentation was very helpful. The web interface software needs a bit of work however. I've had only a fair amount of success using the controls to move the camera lens. The automatic sweeps however work just fine. Luckily, I plan to generally leave the camera pointed in one direction. I plan to have this outside in the winter, so I'll find out what happens when the temperature goes below the operational range.", "Date": "September 14, 2012"}, {"Title": "Returned Item to Amazon", "Author": "Amazon Customer", "ReviewID": "RLG4PP63HSJXG", "Overall": "4.0", "Content": "The camera worked fine when tested at short distance, but I returned it because of \"where I needed to install\" it.  It was too far from my Router for a Wi-Fi signal, maybe 30-40 feet from Router to outside Utility Pole.  Only complainr I have it I wish it were possible to use Wi-Fi at a longer distance.", "Date": "September 13, 2012"}, {"Title": "Great image while it lasted.", "Author": "R. Smith", "ReviewID": "R1QS8MVUBV02HE", "Overall": "3.0", "Content": "This camera gave us a great view in daylight, dark & with porch lights on. It was easy to set up & operate.Our Mac/Safari would run most of it's controls but not all. Some may know how to get complete Mac control but we were happy with the basics especially since the image was so clear.We left town for a couple months & the camera went down. When we returned & weren't able to boot it back up, we spent 5 hrs. with Agasio's nice tech team. They finally agreed that the camera was permanently down, probably due to a defective power cord & had us contact Amazon for return instructions. We're currently waiting for those instructions but wouldn't grumble since they'll make it good. When Agasio asked if we wanted another A622W or something different, we agreed to another A622W. They don't make another camera with all of it's abilities & any company can have an occasional malfunctioning unit .We have other Foscams (  indoor & outdoor) that have worked well since last winter/spring.", "Date": "September 11, 2012"}, {"Title": "It's ok for daytime viewing", "Author": "Sparky", "ReviewID": "RXRPZIKGGJY1A", "Overall": "2.0", "Content": "This camera is fine for daytime viewing but forget trying to use the night IR lighting.  When the night IR lights are on, the image gets washed out from the glare reflecting back off the glass.  I had to disable the IR's and buy an external IR floodlight panel to use instead of the built in IR lights.  Other than the poor design of the night time lighting, the camera works ok.  Two stars because I need night time viewing more than daytime and this camera failed at that requirement.", "Date": "March 12, 2013"}, {"Title": "Love Love Love this IP cam", "Author": "Guitars United", "ReviewID": "R33UPBS77HKXGR", "Overall": "4.0", "Content": "The Agasio is SWEEEEEET. I have it mounted up high and it is perfect for that application. The wireless is flawless and works good in about 50ft from the router. I did extend my WiFi with a additional router and made the WiFi stronger. The pan feature is excellent and smooth. The night vision is not that good unless you have a light near it. Sometimes this camera is in full sunlight and the picture is still flawless.", "Date": "September 20, 2012"}, {"Title": "Disappointed", "Author": "The Lieutenant", "ReviewID": "R257GXQ2VOR7U3", "Overall": "2.0", "Content": "I've had my camera for slightly over a week. The initial wireless setup was problematic as the documentation is poor. Once I got past this, everything else about the camera was commendable, especially the video quality, even at night. I was just getting ready to set it up outdoors this weekend....only to find the camera dead; it won't turn on. I can't get hold of support (same problem when I had an issue with connectivity). I have no confidence in this product or the company. It's a shame given the quality of the video is not bad at all.UPDATE:It's been almost a year. I would not recommend this camera in all fairness. I've had to reset it multiple times as it disconnects from my wireless network all the time.And no, problem is not the wireless setup as the setup has been done as per their recommendation, my access point's firmware is updated, the signal is great, no interference...The night vision is great, if the camera is setup indoors, but when setup outdoors (which is what I bought the camera for), the night vision is worthless. I have set it up on my driveway, and I can barely see my cars and the camera is literally 10feet above the cars.For the amount of money I paid for this, camera, this was a loss.", "Date": "July 27, 2012"}, {"Title": "Wireless Camera", "Author": "HJMG", "ReviewID": "R1TA9VT80AP8N3", "Overall": "4.0", "Content": "The camera is a good equipment and will most likely do the job I bought it for. However, making the software run with active x control is a major hassle under Windows 7. Without changing the security settings the sofware will NOT install. It took me about 2 hours to figure out and test the settings to make it work.Both the ethernet connection and the wireless work well and allow a good control of the camera movements up to 100 feet from the router. It is also some hassle to configure the router for the camera. Since I use a reliable business router (MOTOROLA) it takes some time to make it work with the camera. The settings have to be made manually with the ethernet cable connected to the camera. Once it is set up and the router recognizes the camera, the wireless will also work.In cases of placing the camera away from a power source (house), it is recommendable to install a 2 pair power cable for 12 volts, not to exceed 150 feet. This power cable must be equipped with a jack on one end to plug into the power adapter and a plug to go into the camera. The jack and plug are available on E-Bay but ususally come in bundles of 10, when you need only one of each. Jack and plug should come with the camera.Using a small solar panel for the power supply and a night battery is a feasible option to install the camera as a stand alone equipment and make it accesible under an ftp site.Also missing is a camera mount to a flat surface or a pole. I made a flat mount of polycarbonate myself, works well and perfectly fits to a standard DOT street sign pole of 10 feet height.Once the camera is off the floor, there is no way to reach the reset button unless climbing up a ladder. This is a feature that requires improvement such as a remote reset command as used in communication equipment.Conclusion:1. Good camera with high value for the dollar2. The connections need some attention (to the computer and the router)3. The software installation instructions need improvement4. The power jack and plug should be added to the supply5. The operation / installation manual is outdated and does not truly reflect the actual camera but somehow still serves the purpose.Once you have one camera set-up which will not exceed a total cost of $400.00 you can create your own alarm and surveillance system with up to 8 cameras for yourself. Such can also be combined with emergency calling (911) with a pre-recorded message. In any case your company and / or house can be supervised by yourself remotely. No contract or specialized company needed. With a cheap webbook and an external hard drive recording is simple and reliable.", "Date": "June 16, 2012"}, {"Title": "Nice IP Camera", "Author": "Chris", "ReviewID": "R11FFGZB0N1UDM", "Overall": "4.0", "Content": "This is my first security camera and I feel I got pretty lucky in choosing this one.  I've been running it for 2 weeks and although its had some issues, I've been happy with it.First, I learned that this camera falls into a category of cameras that is often called \"Foscam Clones\" or \"Chinese IP Cameras\".  It turns out this is a good thing because it means the camera will work with almost any desktop or smartphone app that works with Foscam cameras.  If your interested in programming your own apps, you can search for \"IPCAM CGI SDK\" for docs on remote interaction with the camera or \"Open IP Cam\" for people that work on free replacement firmware.All the cameras in this class are not the simplest things to set up.  You need to be pretty comfortable with setting up IP devices.  If your not comfortable with that, you might look for a device that claims ease of use as its main feature.Agasio's web page has a help forum and documentation online if you run in to issues.  If they are unable to resolve your issues there, I suggest then moving to Foscam's help forums since they hardware is somehow related.  In fact, it was on their web site I found the solution to the main issue I have with this camera.The video feed will sometimes \"strobe\" from dark to light and this causes false motion detection.  Foscam forums mentioned this is somehow related to data overload.  If your wifi signal is weak and your pushing highest video resolution and frame rate, it can cause this as the data backs up.  Either use an Ethernet cable or lower resolution to resolve this issue.  If it ever gets into this mode, you will be forced to manually reset it (using web interface) to correct it.If you look at cameras in this price range and feature set, they are mostly clones of each other (probably have exact same internal parts) with main difference being either supporting zoom or night vision; but not both.  I prefer the night vision of this camera.  X10 recently announced a $100 more camera that supports both but the verdict is still out on them and their customer service is iffy.The other thing that is different among cameras in this class is the external housing and its quality.  Most look cheap and plasticy. This camera is all metal with nice lines and glass.  The product picture looks like it would be bright white but I was happy to find its an off white which fits in better in most outside colors.I recommend this camera overall but you will have to deal with manually monitoring it and rebooting it.  It will be of most use if you use it in combination with a PC based app such as ZoneMinder or Blue Iris that will give you some additional tools to overcome any design issues.", "Date": "June 15, 2012"}, {"Title": "Performs as expected", "Author": "Joseph Cobb \"Motorhead\"", "ReviewID": "R3BDDVJ7E8ENG9", "Overall": "4.0", "Content": "I installed this product today replacing a Loftek Sentinel D1. The camera itself is the same resolution and nearly identical all around other than the dome on the Sentinel is fixed and the Agasio dome moves with camera.  The Agasio also of course has the night vision which is main reason I bought it. The sentinel is good in day time but is pathetic at night even with a light on outside. Night performance is adequate for .3 megapixel and for the cost it is a viable IP camera. I hard wire my cameras so no review on the wireless portion. I tested the record functions using webcamxp and it worked flawlessly as well. I sold my Sentinel to my neighbor as this person uses the instant on bright security lights which will adequately bathe the Sentinel for better functionality. Also the Apexis app worked perfect with this camera for my iPhone.", "Date": "May 11, 2012"}, {"Title": "Great equipment for my needs!", "Author": "colin", "ReviewID": "R3SU1BBBXCCG0V", "Overall": "4.0", "Content": "Setup was identical to setting up a Foscam camera. The user manual was not as great as Foscam's but if you know how to setup a Foscam then this is no problem. There is a lot of online documentation and forums on how to setup the Foscam camera. This camera basically is an outdoor waterproof pan tilt camera with IR nightvision. Its pretty unique and haven't found anything similar on the market. The other similar cameras would be the Foscam FI8602 but that is $400. There is also the Loftek. However, neither the Loftek nor the Foscam have IR night vision.", "Date": "February 2, 2012"}, {"Title": "Agasio A622W failed out of box!", "Author": "NW8R", "ReviewID": "R1XMOJCJOCKCWD", "Overall": "1.0", "Content": "Brand new Agasio A622W. Failed! Software needed key. Key was not sent in box. Customer support no help! After I managed to get the camera working and configured through web interface, picture quality was crap. Video colors were more like black and white. Picture keeps breaking up! Poor quality!  I read through the reviews, took a gamble, and lost!  Sent it back!Thank you Amazon for your fast return service and refund!Agasio A622W Outdoor Wireless Pan/Tilt IP Camera with IR-Cut Off Filter for TRUE COLOR Images (Not Washed Out), Auto-Iris (Auto-Brightness Adjustment), IP66 Waterproof Enclosure, 50ft Nightvision, 4mm lens (72° Viewing Angle), Synology & Blue Iris Compa...", "Date": "August 16, 2012"}, {"Title": "Failed within 1 hour", "Author": "Kyle", "ReviewID": "R3IFAP6YY6Z99E", "Overall": "1.0", "Content": "I was able to power on the unit and access it via my local PC.  Within the first hour, the unit lost connectivity.  The power light is lit but it cannot establish a connection with the router.  When I called tech support, they walked me through a troubleshooting procedure and determined that the unit had failed and needed to be returned.  I filed a return claim through Amazon and have not received a response.  I just called the Foscam contact number and did not receive an answer or even a recording.", "Date": "June 28, 2012"}, {"Title": "Updated August 2012: Zero documentation", "Author": "David L. Wilson", "ReviewID": "R3N80FINBBSH7Q", "Overall": "1.0", "Content": "No idea if this even works as there was no documentation at all included in the box; visiting the manufacturer's site lets you view some user guides that appear to actually have been created by users. The Mac version advises users to use Google to find some unverified software and install it on your computer to complete the install. I have a better idea: I am, for the first time, sending an item to Amazon for a refund.On the positive side: It looks extremely rugged; it's heavy; nice external antenna. But I've installed a number of cameras at this point and the instructions for this one available on the Web site do not fill me with any confidence that the guys who built this did anything but kludge something together. It's a mess.Oh, and also I think the other review on this camera is bogus._________Update: Refund processed; I had to pay for shipping. In response to a couple of comments: No, didn't do any further research on the camera; as I said, the only instructions available to me advised that I modify my Mac's OS, which I'm not comfortable with.-----------------Next update August 2012: I just randomly checked on this and so am updating based on comments; I reiterate my position that nearly all the five star reviews of this product do not appear to be legitimate; it looks like nearly all of them call out a tech support specialist by name. In response to comments on this review: Yes, as I stated in my original review, I went to the company's Web site; their support documentation was abysmal, as I stated, but it could be better at this point. I did not attempt to contact tech support (as apparently nearly all the five star reviews did; I notice somebody stated they were happy to pay for this service). In response to the declaration in comments that I appear to be somewhat unsophisticated in setup; as I stated, I have a number of cameras operating on my property. In addition, I have a masters degree in information technology and I run a 22-member IT team. I reiterate my position that this camera does not appear to be well designed or properly manufactured. My favorite cameras at this point are from Panasonic, running with power injectors via ethernet cable (but I just ordered a couple of cheap DLink wireless cameras mostly for fun, which is why I went back and checked this camera).", "Date": "January 14, 2012"}, {"Title": "Junk, STAY AWAY!", "Author": "Joe Trigilio", "ReviewID": "R1P9CDGETM9GHF", "Overall": "1.0", "Content": "Broken right out of the box.  When I attempted to remove the camera to further troubleshoot, the graphite neck snapped in half.  I got totally ripped off and would NEVER purchase another product from Agasio......do yourself a favor and read all of issues before you consider this brand.", "Date": "May 6, 2013"}, {"Title": "What a waste!!!!!", "Author": "fred", "ReviewID": "RUQAWX38X4Z69", "Overall": "1.0", "Content": "Should have paid attention to the reviews about this, ummm camera. One day it works well, the next day I am trying to get it to work. What a piece of junk.", "Date": "March 26, 2013"}, {"Title": "not worth the agrivation", "Author": "geo615", "ReviewID": "R32D262YM1BICN", "Overall": "1.0", "Content": "Purchased this camera because of it's description as a easy to set up ip camera.  It was anything but.  I followed the instructions to the letter and still spent 12 plus hours trying to make the camera work!.  It would boot up until I configured it for wireless operation and then it would not work at all.  The camera would move a little then stop but with no picture.  I powered it down for several hours and it would work with a lan cable but as soon as I tried to configure it for wireless it would fail.  The general construction was good and the enclosure was made of heavy aluminum. It was a good outdoor setup. Unfortunately I returned the camera because of the inability to configure for wireless operationAgasio A622W Outdoor Wireless Pan/Tilt IP Camera with IR-Cut Off Filter for TRUE COLOR Images (Not Washed Out), Auto-Iris (Auto-Brightness Adjustment), IP66 Waterproof Enclosure, 50ft Nightvision, 4mm lens (72° Viewing Angle), Synology & Blue Iris Compa...", "Date": "October 7, 2012"}, {"Title": "Nightvision is useless, dark spot in center of picture", "Author": "w.w", "ReviewID": "R3R2YICSCY2PM3", "Overall": "1.0", "Content": "This thing is junk.  First of all, like other reviews mention, the \"nightvision\" doesnt work at all.  The IR just bounces around inside the dome and you cannot actually see anything.  Don't they test these products before they mass produce them?  This is an obvious design flaw that should have been caught.My camera has a dark spot in the center of the picture which I am assuming is from a damaged sensor or something.The Chinese software is junk as well.  It is so clunky and often time changes do not work when you save them.Save your money and get a better camera.", "Date": "August 9, 2013"}, {"Title": "No rating.", "Author": "vicah", "ReviewID": "RZZ4AGG8AXWF9", "Overall": "1.0", "Content": "I shouldn't rate this IP Camera because I wasn't able to install it, but \"no rating\" is not an option, so I just rated one star.  My computer (dell's with windows 7) cannot read the disc that came with the camera.  Online tools-support will take you to sales of indoor cameras.  I finally got into the support page, but it says that support is \"coming soon.\"  I finally got to talk with somebody from Agasio with no result because he doesn't know either why the link doesn't get the support information, or why it says \"coming soon.\"  So, I must have to return it and try another product.", "Date": "July 14, 2013"}, {"Title": "This Item not as advertised", "Author": "VenomTexas", "ReviewID": "R1B834AGAF133L", "Overall": "1.0", "Content": "i will not say what this product is, but i must say,, DISSAPOINTED.camera does not work as intended, disconnects from the surveillance system every few minutes (wifi), probably wired it may work.. camera is most of the time non responsive, my wifi network became an unstable when this is on it, disconnecting devices randomly, i had to set a DIFFERENT wifi device to get this camera to work on my network, and yet it still disconnects itself randomly.recording is good, video is good, night vision is good., camera moves and suddenly stops (not responding) for a while then is back to original prosition.. quite annoying, took me 2 hrs/install a different wifi router, update http gui, and many other hoops to make it work..and after is working you see above, really not worth it.web interface is good in options, if all of them worked as intended.support, is a NO NO... if it exists is very limited and unhelpful, webpage information is click here but click does nothing and no explanation is given.. fail.if you want a challenge and work to make by all means, go for it.. if you want a cam to work, well you know.", "Date": "January 28, 2013"}, {"Title": "Excellent for the price !", "Author": "Ian", "ReviewID": "R3KYSJGD9X2XT4", "Overall": "4.0", "Content": "Purchased 2 of these for a proof of concept project where high quality image was not critical.Both are mounted outside - one  completely exposed to sun with temps above 105f - can cause flicker in direct sun and wash out some views when sun very strong - but for my purpose not an issue. Second one is mounted in shade of a satellite dish temps still get to 100+ but no direct sunlight - works well with the shade helping avoid washing out landscape.Items to note - glass dome needs to be kept clean , desert dust affects it at night and rain drop stains will affect night vision - does NOT affect the daytime views.Set up - well patience helps , once you master the learning curve not too difficult. It appears to be a bit \"browser\" sensitive as regards the setup - I hate IE as a mac user , but ended up using it to configure - safari and firefox didn't seem to work as well on the setup. Once I had basic setup done both safari and firefox have worked.Issue - remotely added a user , unit went to reboot and hung - as I was 1000 miles away could not do a power off reboot - luckily in a couple of days thunderstorm cut the electrical power to the house so when it was restored unit rebooted and has been fine since.I have not used ALL the functions such as alarm or email - so cannot comment on them , for general area view and things like checking patio , gates to my house while away - these units have been good.I plan to order 2 more for testing in another location and then plan to move up to a higher resolution camera for the \"view\" cam looking out to sea where good resolution would be nice.In service time at present about 4 months in extreme conditions with regular use of the motors - I use wifi link but ethernet cable is also there and works well if your installation will allow it.Agasio - a 3 meg version of these would be awesome if you could hit the 400 or less mark !One item I don't like is the exposed reset button on the pigtail - can be too easy for 3rd party to reset in error let alone on purpose !", "Date": "July 22, 2012"}, {"Title": "I'm Happy With It", "Author": "Tom", "ReviewID": "R3PK3RW95BMK8P", "Overall": "4.0", "Content": "I had already purchased an Agasio M1051 IP camera and was so pleased with it that I got this one too.  I can confirm some other reviewer's comments.  The camera box was labeled PTZ but it's not PTZ it's PT only.  It was not misrepresented on Amazon so I got what I expected.  There is a slight halo when it is on infra red (no big deal).  The documentation is not very helpful.  After having installed the M1051, I was expecting this one to be a breeze but it took me for a bit of a ride.  The installation was rather different.  This one does not appear on the router list of devices and I did have to open a port for it.  The M1051 did not need a port opened and was present in the router list.  I initially thought the unit was defective so called tech support.  They got back to me the next day.  By that time, I had got it working but still had some issues with some of the controls not being functional in the browser interface.  Sandra, at tech support, was very helpful in addressing my concerns and screen shared in my PC to get these issues resolved.  Now the interface is fully functional and I can even see my M1051 in the same window.  Not having any experience with other IP cameras, I cannot compare this to others but I am happy with both of these cameras.  They do all they claim.  I even set them up at times to snap photos on motion detect.  The camera emails me with a few samples while uploading a bunch more to a remote FTP site I have. Works very well.  In fact, you could put up a sign that reads \"if you are reading this, it's too late.  Your picture has already been uploaded to a remote server. Have a nice day.\"  Be aware though, that this infrared wavelength is a sexual attractant to moths (who knew?).  So...at night you will get lots of cool moth pictures that look like the stuff on ghost hunters  :-)", "Date": "July 5, 2012"}, {"Title": "Great Camera and Even better for this Price.", "Author": "C. Butcher \"TCB\"", "ReviewID": "R1NDU7X9D0Q7I1", "Overall": "4.0", "Content": "Well I bought one of these as a test to see if I could get a pan/tilt camera for this price. It is an awesome picture compared to other non P/T camera for this price. The colors in high light and med light all show up sharp and clean. At low light you can far enough away for me to focus on the object. I only issue with this camera is the P/T is slow. I understand that I can't like everything about the camera and that is the only complaint. Doesn't effect me to much since I already ordered two more and going to assign them to a group so they can work together.", "Date": "June 28, 2012"}, {"Title": "A+ for customer service", "Author": "Wayne King Jr", "ReviewID": "R2AVVWW4L8ZGP9", "Overall": "5.0", "Content": "I had a problem connecting the camera to a wireless router.  I called the customer service number and within one minute I was on the phone with Eric Hill.  Eric resolved all my probelms and set up my remote access parameters with in five minutes.  Saved me hours.  Highly recommend.", "Date": "April 25, 2014"}, {"Title": "Initially had trouble with Night Vision but was able to fix the problem", "Author": "Sonny", "ReviewID": "R1417UUS9HMAQO", "Overall": "4.0", "Content": "This camera is pretty good during the day but I initially had trouble with the night vision. The direction where the camera was pointing received lots of IR bounce back. However while panning the camera, I noticed that the night vision was very good in spots. At first I thought the dome was dirty so I cleaned it. It turned out to be a slight defect in the dome that was causing the bounce back. I removed the housing and repositioned the dome and it now works great. Now, the dome section giving me trouble is on the back side of the camera which can't be reached.", "Date": "March 26, 2014"}, {"Title": "Could be worse", "Author": "King Of Reviews", "ReviewID": "R1O34N9W9RRWXH", "Overall": "3.0", "Content": "Interface is slow when connected out of home/business network. Was relatively easy to install and forward ports for out of network connection.Pros:1. Super fast movement when pan and tilting (again slows down when out of network and the lag causes multiple direction moves)2. Clean crisp images in the daytime.3. Looks stylish.Cons:1. DOES NOT RECORED VIDEO! REGARDLESS OF WHAT APP YOU USE! The description I saw when ordering stated it had this capability.2. Inferred LEAVES A LOT TO BE DESIRED, even at less than 10 feet, the clarity is shoddy at best.", "Date": "March 22, 2014"}, {"Title": "Great Buy", "Author": "Ewen", "ReviewID": "R3FA1NHW1HG8TA", "Overall": "5.0", "Content": "Love it would recommend it.  Had a little difficulty connecting to Wi Fi, I called Foscam support and they got it connected in less time than I tried.  Was on hold for less than 30 seconds before I got great help,.", "Date": "March 21, 2014"}, {"Title": "Decent camera, bad support", "Author": "Lauren", "ReviewID": "R2335WYSBEMWBX", "Overall": "3.0", "Content": "I'm ok with this camera, but I'd return it if I could.  There are two errors in the owner's manual (one being the 1-10 sensitivity scale) so you have to troubleshoot with apathetic customer support from the start.  There isn't a happy medium between catching every shadow that moves and not catching anything.  Unfortunately, someone broke into my house, walking right by the camera, and it wasn't caught at all.  I'd spend a little more money for something better.Cons:1. It takes a lot of constant movement for the video recording to be triggered2. It catches people walking down my deck but not walking back up (thus catching their face) no matter the time interval3. Must use Internet Explorer or IE extension to record/ stop/ rewindPros:1. The ability to pan at any angle2. Pretty good image quality3. I was able to set it up myself.  Mount it, run cables through the attic, connect IP, and voila.", "Date": "March 19, 2014"}, {"Title": "Perfect For Monitoring The Front Door", "Author": "Social Dave \"Dave\"", "ReviewID": "RP9VC6G9QLMCB", "Overall": "4.0", "Content": "I've incorporated this camera into a MIOS mesh network. I'm satisfied with the functionality of the camera during both day and night. I've already decided to buy another to put in my backyard so I can keep an eye on my dogs when they are outside.  Unless there is a power outage, the camera never resets. As long as you understand how to make the camera's ip adress permanent, you'll have no trouble like some reviews have described. This is a good camera that allows me to keep an eye out on my front door and driveway no matter where I am.", "Date": "March 17, 2014"}, {"Title": "Decent quality camera", "Author": "Mesimo \"messik\"", "ReviewID": "R24M2ZMQKAWS4W", "Overall": "4.0", "Content": "I received the camera about a week ago. When you get it, make sure you do the setup first then leave it close by where you can test it for a couple of days before you install it. The instructions for port forwarding, etc were pretty straight forward, so I was up and running in no time, able to view and move the camera over my iphone. Night vision was also decent, I have a back yard of about 5,000 sq ft, this shows most of it at night with far corners being barely visible, but I'll take it.The rotation is not full 360 deg like it says. It has a stop-turn, so it's 359 degrees. Usually not a problem, unless you have to install the camera backwards, then it's a major annoyance.  I installed mine on roof studs from inside between wall and roof and the antenna got in the way (not bended as is shown in the picture), so I drilled a new hole and brought it out from the side.Overall, I'm pretty happy with the quality of the camera itself, but the resolution could be better. One issue I have is with shadows - when one part is sunny and one part is shady, it shows the shady parts as pitch black, until you move the camera toward the shady part then the contrast adjusts. The difference between light and dark is a bit too extreme. Less of an issue, but still a minor irritant - the wide angle view or the lack of it.Lack of zoom is another issue, but in my case I am happy this doesn't have zoom and audio because it's installed in my back yard and if someone gains control of the camera over the internet I don't want them to look inside my house. However, the other camera that I buy for the front of the house will probably be 720p with zoom and audio.", "Date": "March 13, 2014"}, {"Title": "Unstable/crashes", "Author": "Troy R. Baldwin", "ReviewID": "RM1845REI63NL", "Overall": "1.0", "Content": "Night vision is sub-par.Not a PTZ (no zoom)Wont run full 640/480 without glitching. I have to run at 320/240 which looks like crap.Crashes at least once a week or more. Pretty tough to push the reset button when its 25' up on the side of a barn.No firmware updates available ever since I bought this in 2012.I would NOT recommend this camera at all. I wish I had never bought this piece of junk.", "Date": "March 12, 2014"}, {"Title": "They work okay sometimes", "Author": "Computerized Nurse", "ReviewID": "R8J5CW2WKDV38", "Overall": "1.0", "Content": "But not most of the time. Still, for the price, and that they do work some of the time, they are a great deterrent..", "Date": "February 22, 2014"}, {"Title": "IP Camera", "Author": "Audrey", "ReviewID": "R1RW119WHEYNEN", "Overall": "3.0", "Content": "We bought this as a replacement for a camera in our camera network we have in our calving barn. We use these camera to oversee our cattle when we they are birthing calves. The number on this camera is different from the other cameras and we are having trouble getting this camera to work properly. Not sure what the problem is yet. These cameras need to be sealed better as they get dirty inside and they are cheaply made. We have 4 cameras at our barn, 2 inside and 2 outside and the outside cameras are the ones we have trouble with. We may have to look at purchasing a more expensive camera for the outside pens. Service after the sale is not much help. Thank goodness our son has knowledge to help us.", "Date": "February 13, 2014"}, {"Title": "IP camera support", "Author": "Jerry Dickerson", "ReviewID": "R1U35A3KY4386P", "Overall": "5.0", "Content": "Calvin was very helpful and timely. He was very patient, very professionsl & very willing to answer questions. I appreciate his helpful manner & knowledge.", "Date": "February 9, 2014"}, {"Title": "Great Pan/Tilt on a budget..", "Author": "aj4mq", "ReviewID": "R1X5WG2N1B97WM", "Overall": "3.0", "Content": "Controllable by browser or cellphone, this camera can be reached from anywhere provided you open up your firewall. the picture makes it look like a plastic case, but it is a very nice hard metal shell. As for waterproof, it looks like it could be, but the back is open to the elements, including a network port (for programming), a reset button (nice addition), and a power connector (standard CCTV). The antenna in the picture bends, but the one I received did not.So what are my concerns? Does not record. Slow panning, until you find the speed setting in the control panel, then it moves quite fast. No zoom, CMOS camera. Did not get to see night response, but very decent picture. preprogrammable positions, but I didn't see a way to tell it which one to go to.. Auto pans on power-up in seemingly random, but probably normal directions. clicking the center button on the console returns it to pan mode..For the beginner, this is a confusing camera. however, if you work with it a bit, could be very handy. Recommend caulk on the mounting point to prevent moisture, but remember to leave a hole at the bottom so it can breathe (very important). Not sure what to water-protect the RJ-45 connector with, so be careful.Programmable from Windows 8.1 (may need to add better firewall exception: advanced-> check all 3, allow edge)No command wire (PTZ), no video output (wireless/wired only).Does not need to be wireless...", "Date": "February 6, 2014"}, {"Title": "excellent camera and I am very happy", "Author": "Kirpal Aquézolo", "ReviewID": "R20PVKFF0DV40K", "Overall": "5.0", "Content": "is an excellent camera and I'm very happy with the product.What I want is a place to find some software for managing internet entirely by both local networks and remote networks.Thank you.", "Date": "January 16, 2014"}, {"Title": "Very Frustrated", "Author": "BobbyJinx", "ReviewID": "R192SV93ZQEWIY", "Overall": "1.0", "Content": "I have to say tat this camera looks very nice and may be used as a dummy cam but that's about it. You can set it up for email notifications but it will blow up your email. It will not stay connected to your network even wit a static IP. My loss because I thought there was hope so I held on to it for so long that I can't do anything with it anymore!", "Date": "December 30, 2013"}, {"Title": "Strong concept, but with technical limitations", "Author": "Edward Wright", "ReviewID": "R2VQGW8N85NL38", "Overall": "3.0", "Content": "Night performance and picture resolution (IR) is seriously degraded by a \"light ring\" that surrounds the image. Software is clunky. Camera is not easy to set up and configure for one with limited computer skills. Resolution is average.", "Date": "December 22, 2013"}, {"Title": "Excellent Support", "Author": "Phyllis Riley", "ReviewID": "R2ZU0J5G88VHRB", "Overall": "5.0", "Content": "Technical Support did an excellent job in resolving my wireless connection with my camera.  I am so glad that I purchased a camera that I can call a support number for help.", "Date": "November 14, 2013"}, {"Title": "Thank you Andrew", "Author": "Buyakdog", "ReviewID": "R1P76UNKI5ZWSX", "Overall": "4.0", "Content": "finally after 3 weeks, Andrew at the Tech Support got my cameras; set up and working remotely. I learned more in 20 minutes with him than I did in 3 weeks by myself or with the other techs.  Thank you Andrew", "Date": "November 8, 2013"}, {"Title": "Great day time, OK night, so so on Wireless.", "Author": "Airstreaming Harley \"Michael\"", "ReviewID": "REDLYLSZ9KL9A", "Overall": "4.0", "Content": "Easy to put up and setup, but usage on wireless network takes some effort to get on full wireless network.", "Date": "November 7, 2013"}, {"Title": "tect support was great", "Author": "M. Smith", "ReviewID": "R3HKK204SKV7JN", "Overall": "5.0", "Content": "could not find devise on laptop, had to contact customer support they remotely logged in did the wireless settings and also did the port forwarding , and also guided how to add on to the android phone. My support person was Felix", "Date": "October 29, 2013"}, {"Title": "not that much", "Author": "visitor", "ReviewID": "R32XY8XXMTXIOC", "Overall": "2.0", "Content": "i bout this item and it seems there is no zoom in/out for this productand the night vision out of focus", "Date": "October 27, 2013"}, {"Title": "Would not connect and had HUGE halo when it did work", "Author": "Amazon Customer \"dddeans\"", "ReviewID": "RFCNC30XONPCH", "Overall": "1.0", "Content": "The company asked me to return both of these since they could not make them work.  Go with the Brand name Foscam.  You will get foscam support when you call on this one, but its not the same quality.  Spend the extra 30 and get hassle free performance.", "Date": "October 24, 2013"}, {"Title": "Lasted one year", "Author": "Dude", "ReviewID": "R1YKWJZO94GG0E", "Overall": "2.0", "Content": "I bought this camera in February 2012. It lasted 13 months and was then  out of warranty. It constantly locked up on wireless mode. The software very basic and the menu is confusing. Thanks to my credit card concierge service...I was refunded the purchase price. I would not recommend this item.", "Date": "October 22, 2013"}, {"Title": "OK camera for the price", "Author": "Randall Catalano", "ReviewID": "REF33DNXDUM26", "Overall": "3.0", "Content": "All the reviews complain about the night vision halo that leaves a small circle of visability.  If exterior lights come on the entire view comes back, however.  One out of three cameras was out of focus and I was told by Foscam that there's no way to focus the camera.  After 2 weeks I had to get an RMA.  The customer must pay to return the product and Foscam pays to ship the replacement camera back to you.  Not ideal.  Daytime viewing is OK however if you have any glare from the camera cover, the picture flashs bright to dark every few seconds causing errent triggers.  This especially happens during late afternoons when the sun is low.  I discovered that the wireless range varies and will not work well through exterior walls, hence the CAT6 cables.  These cameras are setup to monitor a remote property and are serviing their purpose.", "Date": "October 22, 2013"}, {"Title": "Its Very Nice", "Author": "Doug Dienelt", "ReviewID": "R2RV1UU8GOS2KG", "Overall": "4.0", "Content": "This camera is my first venture into the IP camera world. Or any surveillance camera for that matter. I wanted something to keep an eye on my back yard and pool. Despite the less than favorable reviews I decided that this camera at least looks like the best one. None of the IP cameras that are P/T are rated very well which I am guessing the reason for that is they are all made fairly cheaply. I was impressed with the camera once I got it. It is an all aluminum housing. The dome is plastic. I wanted night vision capabilities however I am not too picky on how much detail I get. A lot of people seem to complain about the \"Halo\" at night when the IRs are on. No one has uploaded a photo so I could only assume how bad it would be. Much to my surprise, it wasn't toooooo bad. I have attached a photo. If the dome were constructed of glass I would imagine that this really wouldn't be an issue however that may bring on a whole other set of issues. I had a tough time getting it hooked up. I called tech support and they had it up and running in a few minutes. Excellent support there. My HUGE issue is the reliability of the WX connection. The camera has to be hooked up to the ethernet cable to set it up and the WX up. So after tech support got it working, I went and installed it up on a pole. It worked for a few minutes then went kaput. It had power, I saw the LEDs on but it would not work. So up I went to retrieve the camera only to have to hook it back up to the ethernet cable and load the backup settings file I had saved before I unplugged it. It began working again so I put it back up on the pole and so far its working perfect but my trust is pretty low. I hope it was an isolated glitch because hooking it up to the ethernet cable is not an option for me. Overall, excellent camera, the daytime video is pretty good and night time isn't horrible. I would buy another one if I needed it but for reliability I would hook it up with the ethernet cable.", "Date": "October 17, 2013"}, {"Title": "not working at all irregardless if I followed directions step by step", "Author": "en", "ReviewID": "R26534TUM9B0K2", "Overall": "1.0", "Content": "fast delivery but not working at all irregardless if I followed instructions to install step by step; I even put off firewall temporarily as per instructions", "Date": "October 14, 2013"}, {"Title": "Just what I needed", "Author": "emac66 \"emac66\"", "ReviewID": "R2K5OCW8E9PE72", "Overall": "5.0", "Content": "I searched along time for the right IP Wireless Security Camera and I believe I picked a winner. easy to get up and rolling. Only thing, I wish were different  would be the fact they use a mini cd for installing your software on to your laptop or PC. My laptop wouldn't accept the mini cd. They do offer another way to complete this though, just go to foscam.com and you are able to download the software there,as I did. other then that for the price this camera is the answer to what I needed.The  Agasio A622W Outdoor Wireless Pan/Tilt IP Camera is very attractive and fits in well on the front of my house. It is a statement for being a deterrent for anyone wanting to cone to my house with out us being here. I was surprised how well it blended in to the house without making it look like an eyesore or a compound look.Basically, download your software, put in a few screws,power the Camera and you're ready to view. I was lucky and able to go through the wall of my garage. I drilled a 1\" hole to bring the camera cord through and plugged in to the power right there. Easy enough.", "Date": "October 13, 2013"}, {"Title": "decent but hard to setup", "Author": "Navat", "ReviewID": "R3A3CRCI2XG81E", "Overall": "2.0", "Content": "Freezes on the first day but after a power reset.  No problem for 2 weeks now.  The day mode is decent but night is terrible.  There's a glare ring due to the glass.  If you don't have a pc with a DVD to install the software then good luck.  I couldnt find the same program online.", "Date": "October 2, 2013"}, {"Title": "Disappointed", "Author": "Tom Taormina", "ReviewID": "R3NWYKY78P550", "Overall": "2.0", "Content": "Compared to my Tenevis cameras, the quality is poor. The PT function is difficult to use. One camera resets its PT once a day by itself.", "Date": "September 28, 2013"}, {"Title": "settings support", "Author": "Its a great way to gat your mind back on trac...", "ReviewID": "R18Q9FZ9H6YE3D", "Overall": "5.0", "Content": "service was most helpful Calvin set up my camera for the second time, very good results. camera works very good and can be viewed anywhere in the world.Thank you", "Date": "September 26, 2013"}, {"Title": "Easy and convenient", "Author": "David Baker", "ReviewID": "R3F6IN1LL5HI5F", "Overall": "5.0", "Content": "Easy to install and operate.  I would recommend this model to anyone that wants to keep an eye on their neighborhood.", "Date": "September 18, 2013"}, {"Title": "What a waste of time and resources!", "Author": "Felipe", "ReviewID": "R14D6PQKFZPSHJ", "Overall": "1.0", "Content": "I have used IP cameras for almost 8 years already, and this product is the worse I have seen around. The firmware is a joke, and it didn't even work. Foscam had the audacity to put a \"quality check certificate\" inside the box. Returning them immediately. Seriously, do not waste you money on these. You will regret it.Amazon.com as always, send everything in a timely manner and assisted in the return. Thanks Amazon.", "Date": "September 11, 2013"}, {"Title": "be careful.....", "Author": "hac", "ReviewID": "RZDBQI2PEN67U", "Overall": "2.0", "Content": "i have owned this since 1/5/13 and while it is still working, there is absolutely no firmware support. the Agasio webpage is useless unless you want to purchase something, the support page link to the firmware update page that has not changed since i have owned it. Based on post to  forums (search Agasio A622W) there appears to never have been any updates available. i wish i had gone with the near identical Foscam model. That model has b/g/n, too. i email customer support and although i got a timely response, it was \"Unfortunately, there are no firmware updates available at the moment\"i feel stuck. should have researched better b/f i dropped $160.00based on other reviews, i am just glad it still works", "Date": "September 5, 2013"}, {"Title": "It works for me...", "Author": "Dave K.", "ReviewID": "R2EYH0TO40XX89", "Overall": "3.0", "Content": "Yes, it's a bit tricky to set up. And yes, it's a bit tricky to mount. And yes, the IR self-reflection makes it only partially useful at night. But overall, this camera has proven extremely clear and reliable for me. Maybe that's because I have the power supply plugged into an APC UPS, and I am strictly using a wired CAT-5e connection. But in any case, it NEVER gets hung up or self-resets in my installation.I've also got it working great in several mobile apps by setting it up as a Foscam 8918.  It's great fun to be able to view it on your smart phone from anywhere in the world.Considering the price, I rate this camera as 'okay\" (not great, but not terrible either).By the way, if you want a suggestion on how to mount this camera on an outside corner for maximum visibility across 270 horizontal egrees, please see my review for the Vonnic B521  Camera Bracket Corner Mounting For PTZ Cameras Retail. Not for beginners, but it's at least an option.", "Date": "September 4, 2013"}, {"Title": "will need some tech support", "Author": "Jeff Holte", "ReviewID": "R3SPAHLYZNAJFO", "Overall": "4.0", "Content": "had a little trouble out of the box but called Irish with tech support and he had me up and running in 15 min.", "Date": "August 27, 2013"}, {"Title": "A622W Outdoor Wireless", "Author": "Greg Boyd", "ReviewID": "R2594NKQWIL76W", "Overall": "5.0", "Content": "Great Camera and the support is very good as well ! I would recommend this product for outdoor Wireless applications!", "Date": "August 16, 2013"}, {"Title": "Works great in daylight, some reflection issues at night", "Author": "Onepingonly \"onepingonly\"", "ReviewID": "R1AZGWALIZEPQQ", "Overall": "4.0", "Content": "Camera performs well.  If you plan on using IR for night viewing, you will get a halo effect of light bouncing off the dome.  The cure would be to mount IR outside of cover.", "Date": "July 20, 2013"}, {"Title": "Purchased by Saeid maghdouri for my peace of Mind", "Author": "Saeid Maghdouri", "ReviewID": "R10IJIOJS90APF", "Overall": "3.0", "Content": "Easy to install and working good, The only problem that Not all the times you could have a clear images.", "Date": "July 15, 2013"}, {"Title": "Its too sensitive", "Author": "Susie", "ReviewID": "R4DF5YIEPN0BL", "Overall": "3.0", "Content": "The motion detector is too sensitive and sends tons of useless emails that clog up my inbox. The quality of the pictures is good though", "Date": "July 11, 2013"}, {"Title": "cameras a622 Agaso", "Author": "Late night reader", "ReviewID": "RL1KGVTU9EZUK", "Overall": "4.0", "Content": "night ir refection in dome makes it not useable at night otherwise camera is as advertised.  i have 3 foscam cameras and have had problems with remote accesss. foscam support has helped me several times and Calvin said he has the problem corrected. support has helped each time & i would rate sarvice good. time to answer phone has improved.", "Date": "May 15, 2013"}, {"Title": "Agasio A622W Outdoor Wireless IP camera", "Author": "gdsffpm", "ReviewID": "R3RGGSN8B125Y2", "Overall": "4.0", "Content": "So far so good: Easy to install and config for wireless using Blue Iris software. Pan is a bit slow although I'm about 100' from router. Haven't seen IR yet or how that looks at night. Will update after more exposure. Camera looks good for appearance and fits into other fixtures.", "Date": "May 8, 2013"}, {"Title": "Average camera", "Author": "Gbitt.", "ReviewID": "R2RSESYXTH5GCK", "Overall": "3.0", "Content": "This camera did a reasonable job.  I believe the reception to the wireless could use some boost, but the videowas acceptable for the cost of the item.", "Date": "April 12, 2013"}, {"Title": "Foscam/Agasio support", "Author": "kingDavid", "ReviewID": "R26A56NTI8I690", "Overall": "4.0", "Content": "I could not access my Agasio IP cam unless connected to my original setup router.  With all IP cameras, I wanted to access using my iphone or other PC from anywhere.  The customer service rep fixed the problem.  The wait was about 15 minutes on hold, but the service was good.", "Date": "April 5, 2013"}, {"Title": "Technical support", "Author": "Kristin Wiese", "ReviewID": "R2O0B8I17Y8X9C", "Overall": "4.0", "Content": "Quick response to my technical issue with the browser and successfully solved my problem. Thank you Ralph Mendez. I like being able to access this camera remotely through my Iphone and other devices.", "Date": "February 1, 2013"}, {"Title": "Compared to cheaper off-brand and not-so cheap Foscam IP pan-tilt cams, this is a rugged, nice looking unit.", "Author": "Pragmatic", "ReviewID": "R1GOB8XXR9VFMT", "Overall": "4.0", "Content": "The Good: Has a very strong, nicely finished professional looking die cast housing suitable for outdoor use. The IR cut filter is real nice for real-color viewing during daylight hours. We won't buy any cameras in the future without IR cut filters.The Bad: The only significant design issue is the nighttime IR reflections on the interior of the dome. And there is currently NO software control to turn off the IR LEDs. only option would be to opening the dome and doing a field mod inserting a power switch to the LEDS which would void the warranty. Are you listening (again) Agasio? This is the second review on Amazon, stating the IR LED dome reflections on this product are a significant problem? Note that there are no reflections or distortion issues during daytime use.Summary: If outdoor daytime use is your primary application, don't hesitate to get this very well constructed camera. If nighttime IR use is your primary application, we recommend you look elsewhere. We give this one a 3.5 rounded up to a 4 rating.", "Date": "January 9, 2013"}, {"Title": "IP Camera", "Author": "Tom Cove", "ReviewID": "RN5282SNZN1FS", "Overall": "3.0", "Content": "One mounting screw is difficult to get at .Picture is good.Night pictures are ok.Difficult to find other software for camera.", "Date": "January 8, 2013"}, {"Title": "Good ip camera", "Author": "garyznola", "ReviewID": "R1Q8BF8FNTIG4Z", "Overall": "4.0", "Content": "I don't know, I guess maybe I was expecting more with this camera.  Even though I read the description and many of the reviews, I got this camera based on the fact that it faired better in the reviews than the other camera I was looking at.  The other camera had more features such as zoom and audio, but I got this camera instead because it did better review wise.  While this camera is very good at what capabilities it has, I really wish it had zoom and audio capabilities, then it would be perfect.  It does kind of sleep when I am in monitor mode when viewing together with my other cameras, but it readily wakes up when I go strictly to it.  Good camera, installed easily and is working great especially the clear color during the day.  I've got the dreaded halo during night viewing, but that is probably due to the street light within its field because it goes away as I pan away from that area.", "Date": "January 7, 2013"}, {"Title": "Good Camera for the Money", "Author": "Cynthia Allen", "ReviewID": "R2MGNXDSNSCM60", "Overall": "4.0", "Content": "Very good picture during the day.  Night time pic is not that great but for the money I canot complain.", "Date": "January 3, 2013"}, {"Title": "Good camera for the price.", "Author": "Keith S", "ReviewID": "R12C5DM2611K0U", "Overall": "4.0", "Content": "Excellent daytime pictures.  Night vision DOES have a reflection from the IR/Dome, but I find it acceptable and usable.My one complaint is wifi was weak through my block house, so I ran an ethernet cable for a more reliable and faster connection.Overall, I'd buy another one.  Tech support is excellent (Foscam), WHEN you can get through.", "Date": "December 31, 2012"}, {"Title": "Fair at best", "Author": "T. Martin", "ReviewID": "R3NK0VUGR0WXLM", "Overall": "3.0", "Content": "We purchased 2 of these cameras to remote view our home. As in the other reviews the instructions are poor a best. I recommend downloading the manuals online because reading the book with the small letters is a challenge. After 2 hours of testing and setup, I found the first camera to be defective on wireless. A call to the service line resulted in nothing but more frustration. After another hour of trying to understand the accent, she recommended to return it to Amazon. The second camera works as described, had no issues setting up on my network. I have never done any port forwarding, IP work before, but found it easy with some help from YouTube and Google. I was able to set up a DNS server and remote view my camera on all my wireless devices.", "Date": "December 29, 2012"}, {"Title": "Reasonable picture and controls for the price; problematic video, no pre-set on reboot", "Author": "Doug Warner \"Doug\"", "ReviewID": "RG44EVT983UM9", "Overall": "4.0", "Content": "This camera has good pan/tilt controls and picture for the price.  As other reviewers have stated, the focus is a little out when you receive it and needs adjusted.I occasionally have problems with the video after a restart, which this camera seems to do about daily.  Another problem with the restarts is that it doesn't have a setting to return to a pre-set after it boots, so regardless of where you were setting previously, you'll need to re-set the position about every day unless you come up with a workaround (you can script a request to /decoder_control.cgi?command=31 for preset 1, command 33 for preset 2, etc).", "Date": "December 29, 2012"}, {"Title": "Agasio A622", "Author": "Chris", "ReviewID": "RW66L1Q13Z8YV", "Overall": "4.0", "Content": "The camera is great but the software isn't the greatest so I went with blue iris, there is free software but not with the features I want to use. At night the clear cover has a halo effect from the IR lights. I can live with that.", "Date": "December 25, 2012"}, {"Title": "solid", "Author": "desertfox \"desert fox\"", "ReviewID": "RL89FC5Z3D66E", "Overall": "4.0", "Content": "I have purchased many different cameras searching for the best bang for the buck and this unit isn't too bad. Let me start by saying that I only use these for wired Ethernet connections as WiFi on any of these cameras is woefully inadequate, even if the device is sitting in immediate proximity to the WiFi router. The cable is a little difficult to work with as it will not fit through a 1\" hole when installing. Had to drill 1.25\". The exterior is metal, feeling much more solid than most of the other units I have tried. This is the only dome cam I have purchased where the entire dome rotates instead of the cam rotating inside a dome. There is some halo effect from IR since they are inside the dome but it really isn't too bad. Color is nice, range of motion is nice. It recognizes the other Loftek, WansView and Foscam units in MultiDev in the built-in web browser software. Works well in Blue Iris too. Time will tell if it is one I would re-purchase but all signs point to this being a solid value for the money.", "Date": "December 23, 2012"}, {"Title": "Surprising Quality!", "Author": "cruceskeith \"CrucesKeith\"", "ReviewID": "R33YKKAV57AYH2", "Overall": "4.0", "Content": "PRO:I am very impressed with the solid construction of this camera! The camera feed is crisp & clear. Night vision is also clear with no \"halo\" as with other infra red night vision cameras. The PTZ functions perfectly, (drive motors are a little louder than expected), and oddly, the entire dome rotates, not just the internal camera. In spite of that odd quirk, it's still an excellent camera! The wireless connection appears to works flawlessly, once connected.CON:Less than stellar software. Very limited! You 1st need to connect and set up with the Ethernet cable before you can use the wireless function. (This is typical). Good luck finding your IP address. Having to use the web browser to set up the camera properties is awkward at best. A security camera novice or 1st time home owner would get very frustrated very quickly, so try to remain patient. The software is supplied via a mini CD, making it impossible to use on a Mac Mini running Windows or a side load CD/DVD tray.Requiring access to a power supply within 3 feet of the camera placement could require the services of a qualified electrician. Additionally, you will need a weather proof electrical box within one foot to enclose the power connection. All this could get pretty costly, if you're not the \"do-it-yourself\" type.This camera IS NOT PoE!(Power over Ethernet). Meaning you HAVE to use the power supply plug. If you have a power failure, you lose your camera feed.RECOMMENDATIONS:BUY THIS CAMERA! But, don't bother with the supplied limited software. I use iSpy (free, Windows only, no mac) camera software. It's the perfect compliment to the AWESOME camera! Download and install iSpy 1st, 2nd connect the camera, then follow the instructions for setting up your camera. Much easier and more options than the supplies software. This camera packs a BIG BANG for your buck! I highly recommend this camera.", "Date": "December 22, 2012"}, {"Title": "Foscam camera-Pretty good for the money!", "Author": "PJK1954 \"marian3410\"", "ReviewID": "R15WU4JLGUGTFZ", "Overall": "4.0", "Content": "I have several Foscam and Agasio wireless IP outdoor video cameras with night vision and 1 wireless IP Panasonic ($500+) still camera (no night vision).  The Foscams operate pretty well and for the price are worth it.  Not as reliable as the Panasonc, but look at the price differential ! Sometimes they drop the wireless signal, but Kate, from tech support was very helpful ! We'll see if what she changed worked ! I would recommend them.", "Date": "December 6, 2012"}, {"Title": "Item review", "Author": "MW", "ReviewID": "RE00DGWR88LD4", "Overall": "3.0", "Content": "The unit performs well using third party viewer software.  The supplied software is cumbersome and requires that firewalls and security be disabled to access the unit.", "Date": "December 6, 2012"}, {"Title": "Agasio A622W Outdoor Wireless Camera", "Author": "Liz Brazeau", "ReviewID": "RJO50E0P4TPT4", "Overall": "4.0", "Content": "The product appears to be well made and is a nice looking product. The only issue I encountered was connecting it up to my Mac Computer. It is not very clear in the manual. It took me about 3 to 4 tries to get it working properly. Once it connected wirelessly it has been working fine. I was able to download the Foscam app pro to my IPad and it also worked fine,but it is not clearly spelled out in the manual . I have Dlink cameras and they are very easy to configure. I do plan on purchasing another Agasio for my condo in Florida for outdoor use. Hopefully it will be easier this time around.", "Date": "October 9, 2012"}, {"Title": "Right Price", "Author": "Robert", "ReviewID": "R3LXVNHZAEKXQ4", "Overall": "4.0", "Content": "Just what I was waiting for in an outdoor ip camera. Good investment in security for those on a budget and would like a system that covers nighttime recording.", "Date": "September 7, 2012"}, {"Title": "Agasio", "Author": "Paul C. Sider", "ReviewID": "R1AYQC0H2D0GSS", "Overall": "5.0", "Content": "I want to say that I was assisted by a Mr. Calvin and I wasOn 11/18/2013 Mr. Calvin helped me with the most professional assistance one can ask for.  I am saying thanks to him because he made my day very pleasant not to make this a problem.  Thank you Mr. Calvin.", "Date": "August 24, 2012"}, {"Title": "What a hunk of junk", "Author": "chevyssgal \"chevyssgal\"", "ReviewID": "R36LB7G2RSMERE", "Overall": "1.0", "Content": "I am not a computer genius but I did work for a high tech company for more than 18 years.  I can not figure out for the life of me how to get this camera to record which is what the camera was purchased for.The night vision is lame at best.The one thing I can say that is nice about this camera is that it was easy to install.  It's too bad the functionality is so poorly defined that you can't get it to do what it is advertised to do - So SHAME ON AMAZON!", "Date": "June 3, 2013"}, {"Title": "It was junk!", "Author": "K. B. Smith \"poppy\"", "ReviewID": "R1JOCE2XJN7C1V", "Overall": "1.0", "Content": "It did not power up. Phone number to service did not work. The bad camera was sent back for credit.,", "Date": "May 24, 2013"}, {"Title": "Great camera great service", "Author": "Ron Hollenback", "ReviewID": "R11BE3UCSRAX8C", "Overall": "5.0", "Content": "Just hooked this camera up at our lake property.  Great video.... Had a few initial problems getting it setup but the Agasio technician quickly walked me through the final setup. Works great.", "Date": "July 29, 2013"}, {"Title": "great camera for the money", "Author": "Michelle Phillips", "ReviewID": "R4JZZ0S1OSBAF", "Overall": "5.0", "Content": "excellent product and great tech support has great picture quality and excellent range definitely reccomend this camera had it for 2 years now", "Date": "July 22, 2013"}, {"Title": "Great IP PT outdoor camera for the price.", "Author": "Brian J.", "ReviewID": "R18TJ3HHQN3W4I", "Overall": "5.0", "Content": "I've only been using this camera for about one week.  But it is exactly as describe. It has a very good picture for a security camera.  I used it on my laptop, desktop andiPhone with no problems.  Setting up the port forwarding is a little tricky if you have not done it before. The included directions were not enough.  I did find what I neededby searching the web for this model camera.  Also I'm using this as a wired camera and purchased the power over ethernet (POE) adapter sold on amazon.  The POE is a greataddon,  this allows me to run a singe cable and keep the power supply plug back in the house by my router.  The only thing I wish was included was software to runon a Apple laptop, security software for mac is not very common, and I don't want to use windows just for this camera.  I can control and view this camera withsafari on my mac.  But I cannot record videos.  Since this camera can be set to send up to 6 snap shoots as attachments in a email when it senses motion, I will be usingthis feature instead of recording.  The motion sensor is very sensitive.  Unlike a few other reviews I don't see any halo affect when using the infrared lights in the dark.Also the camera is more that sensitive in low light for my needs.", "Date": "July 14, 2013"}, {"Title": "Technical Support", "Author": "Ronald Disanto", "ReviewID": "RVW23J25H4BKN", "Overall": "3.0", "Content": "This is a nice camera but is tricky to set up. Computer skills are a must. If you are really determined it can be figured out. I didn't know anything about \"ip cameras\" & \"port forwarding\" at first but do now. Foscam's tech support is very helpful and will remotely take over your computer and do it for you if you can't. Just pay attention and learn.  This camera however did fall off line twice on me and the night vision was not good. The infra red light bounces off the glass bubble back into the camera and makes a halo. I ended up returning the camera but learned a lot:)", "Date": "June 14, 2013"}, {"Title": "Very good for the price", "Author": "Savannah", "ReviewID": "RU0CBC7UJ7FF8", "Overall": "4.0", "Content": "This IP Camera is by no means top of the line, but with all its features it is a good buy.  At .3 megapixel (640x480) is a bit small but does the job depending on your application.  I bought two of these and everything works as advertised. Video quality is excellent on daylight and at night with IR turned off if outdoor lighting is good.  My only gripe is the IR glare from the dome at night, it is better than no night vision but the halo is a bit too much.The WiFi range is marginal especially since it will be installed outside and depending on the location of the router your signal might drop from time to time.  Maybe with extended range antennas could make it work better, using a wireless repeater, or connecting through ethernet would be even better. Either way I will be improving the signal by some means.I use these cameras with the Blue Iris software running on a PC, 24hr a day.  The software ties everything together nicelly expanding the cam's usability, and the web UI must also be used for parts of the configuration and use as well since Blue Iris doesn't cover every operation or programing of the camera.", "Date": "April 23, 2013"}, {"Title": "Nice Camera and Trouble Free after 5 months", "Author": "Mark", "ReviewID": "R1HGTJC19VUV3K", "Overall": "4.0", "Content": "I installed this camera about 5 months ago with no problems to date. Always on and working via the laptop or my Android phone. When I first installed the camera I used it both hard wired and wireless. I had no problems operating it wireless mode except a second or two of lag time while panning around. In the end It was easy for me to just wire the camera into the network for best operation. The wireless and wired software and network installations were no problem as the manual was very clear on how to install and configure the camera. I had the camera up and  test running in 10 minutes. The browser interface that comes with works best in Explorer (I'm using 9) all the features work. Chrome and Firefox (My Fav) a few of the camera controls are missing or not working and that to bad because IE and I don't get along well. The camera works with many different types of IP Cam Viewers on the Net for download and most are Free if you hunt around. The ones listed on Agasio's site work well  Try them all and pick the one you like. I also tried several different Android viewer apps before I decided on one that worked best for me. Connecting and using DNS was problem free as well. I used dyn dns as my provider. I had never used DNS before. The set up was fairly smooth, the cam manual instructions made all the difference. Note: After  the Camera, router and DNS was set up the camera didn't work right away or worked on and off. After reading The help section on the DNS site it can take up to 72 hours for The IP addresses to work properly in the net.In my opinion the camera is well made, all metal and the clear globe appears to be glass so it's stayed clean on it's own. I have the camera installed out in the open with no protection, so far the camera hasn't leaked or shown any signs of weather damage. I'm in the south and we have had many heavy storms this last winter and spring.Daylight picture quality is good and in focus I able to clearly see anything on my property that the camera is able to pan to. Images and video that the camera takes in daylight hours are acceptable to good quality. I have all settings set to High Quality. Night viewing is fair to poor at best. There is a halo affect while viewing from the night vision lights that reflects back at the camera lens making for poor viewing. You have the ability to turn off the night vision lights and if your lucky like me I have a street light that provides enough light to view my property good enough. I also have a 4 cam system with a DVR. It's a middle of the road system and gets the job done. This Agasio IP Dome cam has much better picture quality and better color than the more expensive DVR cams I have. I would give this camera 5 stars if it wasn't for the halo reflection making for poor viewing quality at night which I believe is a very important time when one would want the best quality viewing and recording should the need arise. I just ordered Agasio's model with the smoked globe and zoom feature for a large area of my property that is out of view. I'm hoping that not having night vision lights and the smoked globe will work better for me at night with the building lights that are on all night in this area. I think these cameras are a good value for what they do,  my trouble free usage for 5 mounts now for under $200. I'll report back any improvements or problems on this new model Agsio camera I have ordered.", "Date": "April 11, 2013"}, {"Title": "Excellent", "Author": "S. LLOYD \"Glastarguy\"", "ReviewID": "R2IVBK8V3WX5LO", "Overall": "5.0", "Content": "This is the second Agasio camera for me.  Both installed at a remote location.  Both work great.  Easy to install.  I connect remotely.  Need to know DDNS.", "Date": "April 9, 2013"}, {"Title": "Survived a Louisiana Hurricane", "Author": "Trevor C.", "ReviewID": "R3GL1EJHE0ZNRC", "Overall": "4.0", "Content": "For the price you will not find an outdoor rated Pan Tilt IP cam with night vision. So far it has survived the Louisiana weather and served our need quite well. My only two wishes would be to make it PoE and have the camera go up to the next resolution to make a 1.3Mp.I would gladly pay more for these two features.", "Date": "March 29, 2013"}, {"Title": "Good camera", "Author": "RDonaldson", "ReviewID": "RRNMRZYBA99G3", "Overall": "4.0", "Content": "First camera wireless failed within 2 weeks. Replacement camera has worked very well. Strengths are very clear, easy to install and set up, good night vision, presets are great to look at multiple areas. Weaknesses, could use better zoom,  Does not reboot well.", "Date": "March 23, 2013"}, {"Title": "Agasio A622W Outdoor security wireless camera", "Author": "A Ma", "ReviewID": "R19R0P78S2J0SY", "Overall": "4.0", "Content": "The camera works well.  I just hope that the photo screen angle is wider.  It needs a computer on 24/7.  I am thinking to investa separate monitor for it.  Overall it is worth the price we paid for!", "Date": "March 13, 2013"}, {"Title": "Excellent camera with Excellent customer !", "Author": "Joyce ~ Massachusetts", "ReviewID": "R1YYSE1R7F77WL", "Overall": "5.0", "Content": "This is my 6th camera, and I am VERY pleased with the camera as well as the customer support. I did have to contact the Foscam customer service, as the Agasio service telephone number was not in service.In less than 30 minutes, my camera was up and running!!!!", "Date": "February 18, 2013"}, {"Title": "Great quality build product for the price", "Author": "Michelle Ge", "ReviewID": "R1YAFGOZFKXCLF", "Overall": "4.0", "Content": "We mounted this unit on the front patio, under cover. The product is solidly build and we use wired setup. The mounting screws supplied is a joke (tool short and small). But this is minor since you always supply your own mounting screws anyway in order to customize it. The only minor issue I have is the picture not as bright and sharp as the open lens camera (which we have). Not sure if this can be adjusted. Otherwise, everything work as advertised", "Date": "February 16, 2013"}, {"Title": "Not bad but expect zero support!", "Author": "James T. Culmone", "ReviewID": "R2HINF459NAS", "Overall": "3.0", "Content": "They want to charge me $12 for a missing bracket that should have been in the sealed box??//I sent this to Agasio support and got the reply below.I purchased an A622w from Amazon.com and did not receive a mounting bracket in the box. I do have a bag of screws and plastic anchors. Also, the included disk is un-usable on slot loading CD drives which includes all Macs and many PC'sPlease switch to full size CDs.Hi James,The camera was not purchased directly through us, we can still send out an paypal invoice for $12 for the replacement bracket and ship it to you asap.Best Regards,AhmedFoscam Digital Technologies LLCSupport Team1-800-930-0949support@foscam.us[...]Let me know how I'm doing! If you have any praises or complaints, please send them to feedback@foscam.us!Best Regards,AhmedAgasio Digital Technologies LLCSupport DepartmentDirect: (+1) 713-893-78661-800-930-0949support@agasio.com[...]", "Date": "January 12, 2013"}, {"Title": "Great unit for the cost", "Author": "J. Rice", "ReviewID": "RWNODOWV9SJ3A", "Overall": "4.0", "Content": "I have two of these units for gate security at work.  They work very well and I am very satisfied.  The only con I have is at night, there is a 'halo' effect of the nightvision lights reflecting on the inside of the plastic dome.  Also, if there are outdoor lights at night, the reflection off the dome makes it difficult to see.  The daytime picture is fantastic.", "Date": "December 8, 2012"}, {"Title": "Decent camera for the price", "Author": "J. Occhipinti", "ReviewID": "R12KAJ5KTV0UXL", "Overall": "4.0", "Content": "Purchased this camera from amazon, and have had it for about 3 weeks.  Let me give you the skinny.  Lets start with the cons first:1. Garbage documentation.  This camera comes with this tiny booklet.  This booklet has text written in what has to be 4 pt type.  It's a chore, and ridiculous to try to read.  The garbage documentation doesn't stop in the printed realm.  I own a mac, and it was kind of funny to see the \"mac documentation\" for this device on the enclosed CD.  The documentation consisted of a plain text file, with 4 lines of content.  Poorly thought out, and poorly made documentation.2. micro-CD with drivers (good luck using the disc w/ a slot loaded dvd drive).3. Garbage software. Comes with browser-based software.  Does what you need it to do, but the creators obviously failed their classes in interface design, or didn't know any better.  Oh well.4. Haloing of infrared light at night around lens.5. Minor learning curve.  To use this, you should have BASIC knowledge of how IP addresses and ports are used.  It's not rocket science, but not something I would be confident having my grandmother, or even parents set up.6. No N connectivity, only G.  boooo.----------Pros:1. Good build quality. This thing is solid.2. Good picture quality. Excellent during the day, OK during the night (despite aforementioned haloing effect.)3. Garbage software negated by free, high quality, open-source alternatives on the internet.  Just do a Google search, or consult your app store.4. So far, operated it in 20 degrees F overnight, so decent temperature operating conditions. Waiting for a -20/-30 evening for the real test!----------So overall, this is a decent product for the price.  Most of my problems were with the crap documentation, and software.  No biggie though.", "Date": "November 19, 2012"}, {"Title": "Agasio customer support", "Author": "terri sanchez", "ReviewID": "R1SQZSAL2M0E6", "Overall": "4.0", "Content": "Wireless connectivity problems. Spoke with Harry Foster and he was very helpful and resolved the issue quite quickly.  We own 2 cameras.", "Date": "September 12, 2012"}, {"Title": "Decent Camera, solid build, features are lacking.", "Author": "James E. Shride", "ReviewID": "R105YS2UP99IEK", "Overall": "3.0", "Content": "recently installed several of these units.Cons:Units cannot seem to take a \"position one\" programing point. Meaning they will occasionally return to factory neutral. I suggest wiring it up and see what it points, then mount the camera so that point is what you want to see the most.Units use unsigned ActiveX, this is a giant PITA for IE usersAll the people who say that IP cams need high technical competence to set up aren't really techy, its as easy as 1. Find the IP your router leased out. 2. stick that IP in a browser 3. enter username and pass 4. config your little heart out. THIS CAMERA greatly complicates that (Active X issues). Once that's figured out though, its good to go.Its not PoE. That would be awesome if these things were PoE!Pros:CHEAP!Easy to set up, if you understand how network devices generally work.Very tough construction!I'm glad I can't see in the IR spectrum cause this sucker would BLIND ME! VERY CLEAR in total darkness! Our installs light up a big parking lot.PTZ is good, Zoom is digital, but ok. Pan and tilt has a very good range of motion.Conclusion:Mount them high up, use the default aim point for your aim point if possible.Remember, this ain't PoE and you will need to provide AC to the mounting area. So that can change your cost profile unless AC is already in place.Worth using for the right people, over a very good camera. Personally some solid firmware revisions would make all the difference.We are using Ispy Connect for DVR software, these cameras work well. NOTE: I am not using any of the audio features.if I can answer any questions for you please email me atjim at jimshride dot comThanks!", "Date": "August 3, 2012"}, {"Title": "Nice outdoor camera", "Author": "Michelle", "ReviewID": "R67UZCF095MZV", "Overall": "5.0", "Content": "This is a nice product, and for me was easy to install. I have installed several cameras previously so if you are familiar with it, that makes it easy.  I get great pictures at night.  I did not have a problem with the cord, it fits nicely coiled into the bracket housing.  The only issue I have is that I would have preferred to mount the camera on the ceiling, but the mounting bracket that comes with the camera is only to mount on the wall.  It's still fine.  It has pretty good range to pick up the wireless because the camera is quite a distance from the Access Point.  I like the fact that this camera works with the other FOSCAM viewers, so if you have another camera you don't have to have two applications to view the image.  You can do multiview on one!", "Date": "October 1, 2012"}, {"Title": "Um, wireless?  So why do I have to hook up wires?", "Author": "Chad Shell", "ReviewID": "R12SY0RBYID4F8", "Overall": "3.0", "Content": "The good- well packed- pretty easy to install- good instructions however make sure to have PC close by cause they a on disc only- lots of embedded features found on more expensive cameras- very inexpensive for PTZ that's outdoor rated with featuresThe bad- requires wires, no battery option so u still gotta run wires for power- using IE browser, which is the only browser that supports all the functions including recording, it locks up the whole computer... Tried on a few computers with same result if using IE 8 or 9 32 bit, if you use 64 bit it doesn't work at all but doesn't cease up PC- using other browsers like chrome & Mozilla, it works okay but only supports live view or snap shots- wireless vs wired connections is way different performance.  (so if you have to run a wire may as well wire it and not bother with wireless)- zoom didn't work out of box (thus defective)- housing screws are simple non secure Philips heads which are easily tampered with.  And since they are a weird metric size, not easy to find to replace at the typical places you'd go.- 1st time configuration for a novice with networking is not intuative in the event you have a problem.  I guessed what my problem was and was right ( the port they want you to use was considered a possible threat so my router blocked its use).- no tech support... So I didnt need it but I'm not a network novice", "Date": "July 18, 2012"}, {"Title": "defective", "Author": "Joseph Salvaggio \"gabbiano\"", "ReviewID": "R31N0OS31UXR0J", "Overall": "5.0", "Content": "camera operates perfectly. easy setup easy internet access. good picture, good color. first rain camera filled up with water. I bought this as it was advertised to be suitable for outdoors. Customer service was quick and I am waiting for a replacement. I hope it was just an exception and that the new camera will not fill up with water because in every other respect it was perfect.Their customer service is excellent. The company is concerned about your satisfaction. I have 2 other cameras from foscam which are both flawless.", "Date": "June 25, 2012"}, {"Title": "Agasio A622W Suck", "Author": "housemouse", "ReviewID": "R268DFSOR8BTWY", "Overall": "1.0", "Content": "The IR Illuminator in this camera can not be used at night. It causes a halo rendering the image unusable. What is the purpose of building a camera with an IR Illuminator if it doesn't work. Over all design of the camera is bad. When panning the entire dome moves, try doing this in the winter time...good luck.DO NOT BUY THIS CAMERA!", "Date": "January 1, 2014"}, {"Title": "Great for the price", "Author": "Roy Brown", "ReviewID": "R346PUTW85XYIQ", "Overall": "4.0", "Content": "Easy set up and installation, Works as good as one that costs much more. recommend to anyone just starting with surveillance.", "Date": "June 30, 2013"}, {"Title": "WIFI CAM", "Author": "Martin K. Myers", "ReviewID": "R1BMU6LG7W1B8Z", "Overall": "4.0", "Content": "I like it but the last one broke down (it was replaced by Amazon which is great) but I will like this even more if it lasts a year.", "Date": "June 25, 2013"}, {"Title": "It's a reasonable low price camera", "Author": "Tom", "ReviewID": "RZTFQ92UKKAFH", "Overall": "4.0", "Content": "The software has no signature, so working with Windows IE is VERY limited or not possible.  I have yet to find a way to use the advanced features with ANY browser, IE, Firefox, Safari.  The camera works, with both wired and WiFi.  The tilt angle could bebetter.", "Date": "June 25, 2013"}, {"Title": "Great enclosure, shaky software", "Author": "Kevin Cossaboon", "ReviewID": "RV5NZ9ULIODG7", "Overall": "3.0", "Content": "- Software for the Mac is non-existant, and the website recommends some shareware app?- Windows software is on a mini-disk that will not go into a iMac slot drive- change ip, reboot (1), change Admin password, reboot (2).. add ssid, reboot (3), each is a minute a bit irritating- EvoCam will see it as a Foscam Network Camera (1), Pan and Tilt, no zoom (see below)- Tried to use Chrom on OSX to control the camera, and left, right up, down (pan and tilt) worked great, no zoom.- Tried to use the Windows IE, and not being a windows guru, being hammered with this is blocked, install this and that, but now that is blocked, and to un RAR something I now have a new tool bar? (How do people deal with windows.) Finally got it working, no Zoom.- no Zoom, oh wait the product is described and sold as NO ZOOM, then why was I trying it? Because the manual that comes with it CLEARLY calls the camera a PTZ, shows how to ZOOM, but it is not there.Net, Net, the housing that this sits in is very nice, and would look good on the outside of a house. After initial setup and reboots, the built in software is OK, and if your using something like EVOCAM to control it you never really deal with the embedded software.", "Date": "May 24, 2013"}, {"Title": "great inexpensive outdoor cam", "Author": "gene", "ReviewID": "RWIDAEYNK0DW1", "Overall": "4.0", "Content": "a lot for the money!  Needs to mount on a deep box to make room for it's cable harness. but well built.  Similar to Foscam pan/tilt models.", "Date": "May 16, 2013"}, {"Title": "review of A603W Wireless Camera", "Author": "denfaro \"denfaro\"", "ReviewID": "R3MOK6N89JVNOV", "Overall": "4.0", "Content": "Sandra Williams  The service has always been very helpfull, and the picture is of very good color. The only negative is the remote operation is very sensitive, it will record a leaf or a bear with the same setting.", "Date": "May 9, 2013"}, {"Title": "Very nice outdoor Pan and Tilt camera for the money", "Author": "Brian", "ReviewID": "R2HJVZDXIY718R", "Overall": "5.0", "Content": "I had stationary cameras from Foscam prior to this purchase.  One went bad and I wanted to get a replacement so picked this one out after looking for some IP outdoor cameras with Pan and Tilt.  This camera has a better lens angle and I can \"see\" a lot more than just my sidewalk and now I can also pan around to take in almost 360 degrees of action.  Picture is good enough for anything I would need and not that difficult to set up a FTP connection to store pictures.  I have it wired and am not using the built in wireless, but would really recommend this for anyone wanting a nice IP camera.", "Date": "February 16, 2013"}, {"Title": "Technical Support", "Author": "Smilch", "ReviewID": "R1D2Y4PZMMGLKH", "Overall": "5.0", "Content": "I purchased the Agasio A622w outdoor camera to keep an eye on my property in Florida.It scans and has infra-red for night vision which is what sold me.I am able to control the camera from my iphone and ipad.After weeks of working great, I could not access the picture remotely today...I called technical support...after 10 minutes on hold, they were able to fix my issue very quickly.The technical support professional, Ralph Mendez was able to access my computer remotely and fixed the problem (static ip address) in seconds.He also showed me the steps so that I can fix it myself if it ever happens again.I also have 2 indoor foscam cameras which work great.Thanks for your service.", "Date": "February 4, 2013"}, {"Title": "Great Product", "Author": "luvit", "ReviewID": "R2UXAY8OK7N43J", "Overall": "5.0", "Content": "I love this, it is very well made. I replaced another night vision FOSCAM that does not move, it was the best I could find at the time. This one can be moved remotely, has a much wider viewing angle, and true colors come through. The old cam without the IR filter would make green things appear pink. This came was a little more expensive but well worth it, it looks better and works better. It was as easy to set up as the others I have. In order to get it to transition from cat5 to wireless you need to unplug the cat5 30 seconds into the restarting countdown on the screen.I did see what others mentioned about the IR lights causing a haze or fuzzy view during night vision. In my opinion big woop. On one corner of the (very clear) picture is a little hazy, it really blocks nothing so bothers me not.I like this and would recommend it.", "Date": "January 26, 2013"}, {"Title": "Good camera", "Author": "Dan Chuey", "ReviewID": "RX7MWHG9KZW5N", "Overall": "5.0", "Content": "I purchased 3 of these along with 3 Loftek CXS2200s.  I love both models.  I use the IPCam FC app on my Apple products which works good for me.  If I could change anything about the A622W it would be 2 things...1 - Allow custom scans.  When you turn on the scan/pan/patrol option, you get a lot of areas I do not want scanned (e.g. great up-close pictures of my house's siding, etc).  If you could program a custom area to scan, that would be great! ...hint, hint2 - Come up with a different transformer.  The one included is a standard wall wart.  Meaning you have a black box with AC prongs sticking out of it.  You either have to drill a hole in your wall (not an option for me since I just built my house) and plug it in a wall socket or you have to plug it in to an outside socket (not too secure from the bad guys).  I intend on installing weatherproof single gang boxes near my outside sockets to better secure the wall warts. However, I am concerned about heat in the summer.  I could install a landscape light power supply but they are big and bulky and also are easy to unhook.The images are great during the day.  There is a little haloing at night, but not terrible.  I wish I had more lighting in my cul de sac to see a longer distances, but the lighting I have on my house allows me good visibility of my driveway, front yard, and front door and windows.  You can't tell who is approaching, but you can see someone is.  Once they get close to the house with the lighting I have, I can make out exactly who it is.Hope this helps.", "Date": "January 21, 2013"}, {"Title": "awesome product", "Author": "Brian Santos", "ReviewID": "RGD6PA3NLWYK1", "Overall": "5.0", "Content": "awesome product set up instructions could be better my wife did google search on set up that was the ticket her being a network administrator did not hurt either, product does everything as advertised when set up properly.", "Date": "January 15, 2013"}, {"Title": "Great Cam For The Price", "Author": "PJ \"Peter\"", "ReviewID": "R3Q0OH6M1ZNFJR", "Overall": "5.0", "Content": "I have 3 Foscam cameras. 2 are indoors. they work very well day and night. Very good picture. I replaced a Foscam outdoor with the Agasio A622W Outdoor Wireless Pan/Tilt IP Camera with IR-Cut. Setup is the same as with other Foscam cams. The picture is excellent during the day and at night quite good. Yes a halo is created by the led lights but within the halo is a pretty clear picture when pitch dark outside. The price is excellent for what it is. I have had this up and running for 2 wks without problems. I live in the northeast and was concerned about how the camera would operate in cold weather. Well it has been down to 0 with 2 snowstorms leaving 14 inches and haven't had a problem. The PTZ works perfectly. I use Blue Iris software and the cam works great with it. Motion detection works great. I give it 5 stars because you get what you pay for and for the price this is an excellent cam. Check it out on my website [...].There is a 24 hour time lapse down my driveway and a link to live video from the cam.", "Date": "January 5, 2013"}, {"Title": "ip camera", "Author": "Amazon Customer", "ReviewID": "R155CM05JDVM63", "Overall": "5.0", "Content": "This camera worked as advertized. There is a small halo with the night vision but for the price you can not beat it", "Date": "January 5, 2013"}, {"Title": "Works great", "Author": "S man", "ReviewID": "R2K6RS6CRUEAWI", "Overall": "5.0", "Content": "Product shipped right away, it was in new condition. I would trust the supplier with future orders of their products.It was easy to setup and it has worked good. Sometimes I have to cut off the power to it and let it restart (reboot)and it comes right back on .", "Date": "January 3, 2013"}, {"Title": "Technical Support", "Author": "Terence McNally", "ReviewID": "R3O1DC0YJO5INE", "Overall": "5.0", "Content": "Contacted support to assist with set up of the camera.  Support technician was extremely helpful and resolved the issue very quickly.", "Date": "January 3, 2013"}, {"Title": "TECH SUPPORT", "Author": "WALTER P CHASE", "ReviewID": "R1RKH5CGWDAI9X", "Overall": "5.0", "Content": "I WAS HAVING A PROBLEM WITH WIRELESS ACCESS.  RALPH MENDEZ HELPED ME WITH THE SET UP.I HAVE CALLED FOSCAM TECH SUPPORT BEFORE AND THEY ARE ALWAYS VERY HELPFUL.", "Date": "January 1, 2013"}, {"Title": "Foscam", "Author": "James Ballard", "ReviewID": "R3UT799FL1X8HO", "Overall": "5.0", "Content": "Changed modem and Sandra was very helpful.  The camera works great and I would recommend it. I also plan to purchase 2 more cameras in the future.", "Date": "January 1, 2013"}, {"Title": "Technical Support", "Author": "Masoum sadeghi", "ReviewID": "R28VEURZVET7VC", "Overall": "5.0", "Content": "Was facing difficulty in having my camera work wireless and also have remote access to mt camera so contacted foscam technical support and spoke to felix and had my issue resolved quickly. I,m very happy with the service.", "Date": "December 28, 2012"}, {"Title": "Outstanding Technical support!", "Author": "Michael Cutter", "ReviewID": "R23NWGQBSC5LP6", "Overall": "5.0", "Content": "I was unable to forward my port for remote viewing.  Felix did a great job fixing my problem.  The camera is working very well.  I am very happy with it and would recommend it and the company.", "Date": "December 24, 2012"}, {"Title": "Technical Support", "Author": "Kai", "ReviewID": "R8PF4OFISM10A", "Overall": "5.0", "Content": "We had so much unknown problems, called cutomer services and, Kate, had it all hooked up within minutes! Woohoo! Now we can monitor our system from the iphone from anywhere!", "Date": "December 21, 2012"}, {"Title": "Not Bad...", "Author": "C. Powell", "ReviewID": "R9B7GB4L90CHA", "Overall": "4.0", "Content": "I ordered the Camera and have it setup on a beach location. It works great. There was only one time during a night mode that you could not see at all. I am not sure what was wrong but other than that incident its worked well.Great camera for the price would recommend to anyone.", "Date": "October 23, 2012"}, {"Title": "super", "Author": "Stacie", "ReviewID": "R1KYIZ3KI6IJNN", "Overall": "5.0", "Content": "very clear picture. very simple to operate. as well as the wireless is super strong. I have the item set up aprox 250' away from cisco ap and have very strong signal. I am testing this product for other clients. also the night vision is very clear as long as no light. I own my own computer company and will recommend this product to my clients who want reliable video screening.", "Date": "July 6, 2013"}, {"Title": "Tech Support", "Author": "Jamiern", "ReviewID": "R23Q7QLEHBYVWZ", "Overall": "5.0", "Content": "This is an awesome camera!  Very affordable and works as stated. Picture quality in daylight and night is awesome!  Was able to use on vacation out of the country in St Lucia to monitor home without any issues. Tech support was fantastic and hooked up the cameras wirelessly via remote access for me. Well worth the minimal cost to have it done for me. Also, needed ongoing tech support to add a wifi booster and Scott at tech support was great!!!  Hooked up the booster without a problem. Would highly recommend this product to anyone wanting real time monitoring for home, office, etc... well worth the price!", "Date": "May 9, 2013"}, {"Title": "Real Rating 3.5 stars", "Author": "B. Wong", "ReviewID": "R10RT6Y0XKLB66", "Overall": "3.0", "Content": "The real rating for this camera is 3.65 stars. I assume all the none verified buyers are fake since they did not buy it from AMZN.So averaged out to be 3.65 with all the verified buyers.I am currently looking for a wireless camera and found out that 3 stars and under are all verified buyers in every camera that I looked so far. with 4 or 5 stars, that's where the none verified buyers are. interesting, check it out yourself, don't be fooled.", "Date": "February 22, 2013"}, {"Title": "Great IP Camera", "Author": "iamyru", "ReviewID": "RJ5PCKJXFYFMO", "Overall": "5.0", "Content": "The camera was very easy to set up and performs all the tasks I want it to. The software is pretty standard among IP cameras and I have no complaints about it. I am using this camera wirelessly and have had no issues. Picture quality is great. The night vision works very well through the dome and the camera itself is fairly attractive outside of my house.", "Date": "November 5, 2012"}, {"Title": "customer support", "Author": "Lisa \"Liz\"", "ReviewID": "RRV7E302HZLEZ", "Overall": "4.0", "Content": "I needed assistance in installing the camera. Spoke with Harry Foster. Harry provided great customer service. He guided me all the way. The camera works great!", "Date": "September 24, 2012"}, {"Title": "customer service", "Author": "Robert M. Hurd III \"Reekout\"", "ReviewID": "RDLZB7PY3HM7A", "Overall": "5.0", "Content": "I had an issue to view the camera on the blue iris software . spoke with harry foster he took the remote acess and was able to make it work quickly and also helped me with the remote acess .... it was great to have harry's help. they are always able to solve and problem quickly.", "Date": "September 20, 2012"}, {"Title": "customer support", "Author": "Douglas", "ReviewID": "R1B31B8W8G6XZ7", "Overall": "4.0", "Content": "i was unable to view my camera on the internet due to active x . spoke with harry foster and he was able to make both my cam work wirelessly  harry's service was excellent!!", "Date": "September 19, 2012"}, {"Title": "Difficult to set up remotely - Agasio A622W", "Author": "homac", "ReviewID": "RGRCXHHWXAVZE", "Overall": "1.0", "Content": "The Agasio A622W Outdoor Wireless Pan/Tilt IP Camera was easy to set up when it was directly connected to a computer, a little more difficult to set up in wireless mode, but so far I have been unable to establish connection remotely. The set up instructions are very poor. Not clear how to access the camera from a remote computer of smart phone.", "Date": "September 26, 2012"}, {"Title": "camera", "Author": "Harold Schur", "ReviewID": "R1PNA5MEQ3K8MN", "Overall": "5.0", "Content": "Excellent camera and technical support. Had a little trouble setting it up but the technical support people are great. They had me up and running in no time. Great value for a wireless remote camera. Wonderful picture quality. Sharp. Highly recommend this camera . Very affordable. Lots of bang for your buck.", "Date": "May 7, 2013"}, {"Title": "great costumer service", "Author": "amazon customer", "ReviewID": "R2KUD9WLE3VWCV", "Overall": "5.0", "Content": "great costumer service. wireless and remote access great. affordable able to watch kids and be at peace.Camera quality is wonderful. I would recommend this camera to be purchased!!!", "Date": "May 3, 2013"}, {"Title": "tech support", "Author": "Tad Espiritu", "ReviewID": "RV55IHYNTLZQW", "Overall": "5.0", "Content": "I am happy with the camera i have. I can view my camea wirelessly and remotely anytime and anywhere I go.Leo fro tech support was very nice and helpful in fixing my problem with the changes in IP addresses", "Date": "April 30, 2013"}, {"Title": "I love it", "Author": "jross2v", "ReviewID": "R2M8MTLYSSPEC4", "Overall": "5.0", "Content": "I have more than one brand of camera. I find the AGASIO Wireless to be the best to work with. It is easy to set-up and get going.", "Date": "April 29, 2013"}, {"Title": "Technical Support", "Author": "Bruno Rauch", "ReviewID": "RUN88WJXBGNOQ", "Overall": "5.0", "Content": "I have purchased 5 cameras from Foscam and I am happy with all the different models. The Tech support is very good especially Sandra who was helping me out today. She was very knowledgable and also very friendly. I certainly will by any additional camera I need from Foscam.Thanks you all. Bruno", "Date": "February 13, 2013"}, {"Title": "That's an improved amazing CAMERA", "Author": "R.D.", "ReviewID": "R26G5HQZS4QXAE", "Overall": "5.0", "Content": "By far it has exceeded our expectation based on quality and compared to it's price. How can you go wrong??Recommended for all amateur and semi-Pro.", "Date": "January 30, 2013"}, {"Title": "Agasio A622W Wireless outdoor camera", "Author": "Daddyo-yo", "ReviewID": "RS4WZ2AHQ1K3N", "Overall": "4.0", "Content": "I do like this camera. It can capture image in complete darkness at least 50'. It did have some haloing in the image but still quite good. I had issues in the setup process but after a very short conversation with Sondra Williams at Foscam (where I purchased the product) she was able to correct my issue. I am very pleased with the support I received from her. Now the camera is working like a champ!", "Date": "January 29, 2013"}, {"Title": "It works great with Fedora 17", "Author": "Hal E Meyer", "ReviewID": "R264V87V63V9UO", "Overall": "5.0", "Content": "It works great. I am using Fedora 17 Linux and found the commands online, so I can program it anyway I want.", "Date": "December 19, 2012"}, {"Title": "TECHNICAL SUPPORT", "Author": "JT BARRY", "ReviewID": "R26SIPSALZVWDC", "Overall": "5.0", "Content": "Kate ..WAS SUPERB....VERY VERY FRIENDLY AND EFFICIENT..WENT ABOVE AND BEYOND TO RESOLVE MY ISSUES...VERY VERY EFFICIENT...VERY HAPPY I BOUGHT THE EXTRA SUPPORT...WORTH EVERY PENNY..A PLUS WORK.", "Date": "December 19, 2012"}, {"Title": "agasio camera tech support", "Author": "chris madpak", "ReviewID": "R1H4K8I6PHO05N", "Overall": "5.0", "Content": "Calvin Harris rocksextremely patient very very knowledgeable ...assisted with everything I asked for. All cameras work perfectly now! I would recommend this product. I am very happy with the service provided by him.", "Date": "September 13, 2012"}, {"Title": "agasio customer  service", "Author": "Rod", "ReviewID": "RPPZWVFPYIY5F", "Overall": "5.0", "Content": "Issue was video flas from blue,yellow, red and fram jumping, we reset camera and now all is working fime, and spoke with Harry Foster, he was great support and patient with me. Good Man!,support said it is defective so we sent it back and order another one,and it works great accept for nightvision it issue is that the IR emitters at night actually reflect back into the dome glass and make the view a rather fuzzy, and useless rendition of whatever the camera is pointing at.", "Date": "September 12, 2012"}, {"Title": "Good Camera NO ZOOM", "Author": "Rich Harmon", "ReviewID": "R305KEJGGXUKLS", "Overall": "4.0", "Content": "Excellent camera for the price, Better picture Quality that my DVR system cameras. The only down side to this camera is no ZOOM", "Date": "June 2, 2012"}, {"Title": "foscam ip", "Author": "andy", "ReviewID": "R289ZHRO5V2Y21", "Overall": "4.0", "Content": "great camera once you get it up and running. the techs at foscam are great, they will work with you to make sure it works properly.", "Date": "May 12, 2012"}, {"Title": "a622w", "Author": "Julie Schillinger", "ReviewID": "REFW2ABH7FZUS", "Overall": "5.0", "Content": "camera works well, good picture quality,support was outstanding, would by another one.would reccomend this product.support was was and simple .", "Date": "June 12, 2013"}, {"Title": "Awesome Value", "Author": "Rob", "ReviewID": "R1BY9AX7UWG6E8", "Overall": "5.0", "Content": "I dont normally write reviews, but this product exceeded my expectations. The camera worked perfectly right out of the box. They included a sticker on the Cam with setup information that made it easy. The image is clear as the camera came pre-focused. The Pan and Tilt work great, but there is no zoom. Not a big deal for me, just a mention. The camera is easily viewed from my iphone using a 3rd party app called LiveCams Pro. This camera looks at my dock on Tampa Bay and the construction looks sturdy enough to last thru some of our storms. I plan on purchasing a couple more for the corners of my home. Don't hesitate to purchase this camera.", "Date": "May 21, 2013"}, {"Title": "Cameras/Support", "Author": "Newt", "ReviewID": "R2BE6FMWEQ57GC", "Overall": "5.0", "Content": "Excellent product and easy to set up wirelessly.  Contacted Calvin @customer support who remotely connected and fixed all issues within 15 minutes.  It works! Could not be happier.", "Date": "October 23, 2012"}, {"Title": "Customer supprot", "Author": "Beng", "ReviewID": "RRY9LAURYTV0O", "Overall": "5.0", "Content": "i had an problm in getting the camera connect remotly. Spoke with Harry Foster he was able to make the camera work with the remote ip address for me . awesome service!! 5 thumbs up!!", "Date": "September 20, 2012"}, {"Title": "customer service", "Author": "Tim in Mass", "ReviewID": "R1DEIQ66YNJA8V", "Overall": "5.0", "Content": "i had an issue in making the cma wrk in my xplorer . spoke with harry foster he was able to make it work in internet and also wirelesslyy .......", "Date": "September 19, 2012"}, {"Title": "Foscam Digital Technologies LLC", "Author": "les", "ReviewID": "RY84TA9K4KMN1", "Overall": "5.0", "Content": "very nice, having a lot of fun with it.when it said true color,it was true color.i just wish it had zoom on it.thank you very much", "Date": "September 6, 2012"}, {"Title": "Agasio IP Pan Tilt Camera", "Author": "Roco101 \"Roco101\"", "ReviewID": "R3U400LCWLGV4P", "Overall": "5.0", "Content": "The camera is working well.  And the tech support I used was very helpful in doing a remote installation for me.  I needed help with the install. It was too complicated for me to do alone. Tech support was only $39.", "Date": "August 28, 2012"}, {"Title": "agasio customer service", "Author": "Michael Chiu \"pro airsofter dude\"", "ReviewID": "RM130SUOW441H", "Overall": "5.0", "Content": "Was unable to set up the Agasio wireless camera to work through IE, and to keep camera connected wirelessly. Harry Foster was exceptionally patient and got my system working effieciently and quickly. I was skeptical of the use of this camera initially, but not am planning to add a second camera to my surveillance system.", "Date": "August 24, 2012"}, {"Title": "Great deal for the money", "Author": "John S \"John S\"", "ReviewID": "R11VNXR1C6TT6U", "Overall": "5.0", "Content": "This is not a vandal-proof camera, but it will work outside and provides a very sharp video.Setup is easy and it works with 3rd party camera software.", "Date": "July 19, 2012"}, {"Title": "Agasio Support for A602W IP Camera", "Author": "Sandra J. Ratliff \"Sanstiger\"", "ReviewID": "R37M8SX2GP1NXZ", "Overall": "4.0", "Content": "I have a new Agasio a602W camera that stopped sending wireless signal.  I was able to speak with harry foster with technical support and he quickly corrected the problem and I am back in business.  Thanks Harry for the help and patience.", "Date": "July 17, 2012"}, {"Title": "Excellent tech support.", "Author": "David E. Long", "ReviewID": "R2FRWH9JSHDMLA", "Overall": "4.0", "Content": "Anzen, did an excellent job walking us through the process.  He took control of the computer and showed us step by step how to install and then use our new cameras and made the experience so worry free.Excellent job.", "Date": "July 7, 2012"}, {"Title": "Agasio camera support", "Author": "Patrick Luit", "ReviewID": "R1FFM16TANV0VK", "Overall": "4.0", "Content": "Calvin did a good job today. Quit a bit of settings had to be changed but most of it is working now.I was really interested in the camera nightview and the resolution.", "Date": "July 2, 2012"}, {"Title": "Confused about installation", "Author": "Beryl Ann Gauthier", "ReviewID": "R2EY6FLM0BT208", "Overall": "3.0", "Content": "I'm not a very technical person, so when I saw the word wireless, I thought no wiring was necessary.  I was wrong.  I still have not been able to get the camera to start working because I am totally confused with the directions.  It will take someone a little more technical than me to figure this one out.  All in all, it is a nice piece of equipment, but not sure how it works just yet.", "Date": "May 14, 2012"}, {"Title": "Awesome customer service!!", "Author": "Frequent buyer", "ReviewID": "R2VKK9HTB54C21", "Overall": "5.0", "Content": "I like this camera its easy to use and the picture quality is excellent!! I would recommend this product to all my friends!!", "Date": "June 3, 2013"}, {"Title": "tech support", "Author": "carlos Escamilla", "ReviewID": "R3RQ83YNQ57VAA", "Overall": "5.0", "Content": "wirelessi like remote access thur my phone.pic quality is excellent.camera is very user friendly.A good buy for the moneyscott was very helpful.", "Date": "April 25, 2013"}, {"Title": "Support", "Author": "E. C. West", "ReviewID": "R32R2RJEO4XOQI", "Overall": "5.0", "Content": "I Like the camera and the support is great I will recumend the camera to friend and others I like the way the camera pan and tilt for good action", "Date": "April 24, 2013"}, {"Title": "Very Nice", "Author": "G. W.", "ReviewID": "R306AD7E38JTFB", "Overall": "5.0", "Content": "Their tech support was super helpful! Had some issues and it was very easy for them to take care of!", "Date": "April 17, 2013"}, {"Title": "Accessible Anywhere!", "Author": "Joonee", "ReviewID": "R3QU3NTHRO87DG", "Overall": "5.0", "Content": "This camera has excellent picture, sound and range of motion. i would highly recommend purchasing Foscam cameras. Very Satisfied and limitless features that are very useful. Easy to use and excellent customer service!", "Date": "March 26, 2013"}, {"Title": "customer service", "Author": "P. Neiman", "ReviewID": "R7NRALSJM17H5", "Overall": "5.0", "Content": "had the issue in making my camer work . spoke with harry foster he was abe to set the camera up wrk wirelessly and also provided me with a remote ip address so i am able to view the camera remotly ....", "Date": "September 18, 2012"}, {"Title": "cannot get the motion detect to work", "Author": "steph", "ReviewID": "R60PJWS80M07C", "Overall": "5.0", "Content": "Camera looks great out of the box but I cannot get the alarm motion detect and email images section to work. It must be the camera since this is the third Camera that I've setup so I have some experience by now. Going to go through the trouble of getting support and see where my many hours already spent on this unit leads me.Today I have been assisted by a Foscam Tech name, Kelvin Harris and unfortunately after spending over an hour the technition determined the Camera to be defective. Arrangement will be made for camera A622w return for replacement.The Tech was very patient courteous and new what he was doing.Thank You FOSCAM.", "Date": "September 18, 2012"}, {"Title": "agasio customer support", "Author": "noel", "ReviewID": "R2BP85L8ZOO45U", "Overall": "5.0", "Content": "the out door camera were not able to configure and were not able to work with 2 wireless routers in the home netwrk'I spoke with Harry Foster who solved the problem q=with aout a glitch. He was very patient with me and walked me throught the process so i will be better informed in the future for problems.", "Date": "September 17, 2012"}, {"Title": "Agasio customer service", "Author": "Jim", "ReviewID": "R2YMQHHDY5Q707", "Overall": "5.0", "Content": "Had trouble with installationharry was very helpful in solving the issue for meand fixing my other foscam cameras also very nice man!Also own 4 outside foscam cameras work very nice !", "Date": "September 17, 2012"}, {"Title": "great customer service", "Author": "Carrie Obrion", "ReviewID": "RU1AHBGEKBI3Y", "Overall": "5.0", "Content": "Agasio IP cam was a great choice, they have great support to go with a great ip cam. Calvin Harris was excellent in aiding my installation and took the worry about my purchase being that this was the first surveillance camera that I have EVER purchased. He was knowledgable and very very patient with me being a first time customer. I", "Date": "September 17, 2012"}, {"Title": "PTZ IP Cam | comes with GREAT customer service!", "Author": "Nick Mazze", "ReviewID": "R1IEE4CNL343OB", "Overall": "4.0", "Content": "The PTZ IP Cam was relatively easy to set up, in terms of the hard install but when I was stuck on a networking issue...  GREAT customer service provided a simple solution where they dialed right in, double checked my wireless settings, and had my camera working in less then 10 minutes!!I would like to thank Jees, in particular for him holding my hand through the process.", "Date": "June 15, 2012"}, {"Title": "Agasio A522", "Author": "Karen L Moore", "ReviewID": "R229YS0TX37CWV", "Overall": "5.0", "Content": "I recently purchased an Agasio A522. I worked with Calvin Harris to resolve an issue and we are back in business. This is a great camera with an unbelievable picture. Thee 720 high def picture realy brings it all in.", "Date": "June 12, 2012"}, {"Title": "agasio camera", "Author": "Joan", "ReviewID": "R6ZWCB29W22PS", "Overall": "5.0", "Content": "Calvin Harris was very good getting the camera to run and very nice to talk to. I like the support you get with this camera. i like the camera view and its a very nice picture on it.", "Date": "June 10, 2012"}, {"Title": "customer support", "Author": "donald mitchell", "ReviewID": "RTRZNGZ6QJ31Y", "Overall": "5.0", "Content": "i was unable to get the picture in my internet xplorer . spoke with Harry Foster he was able to help me in getting the camera work in my internet xplorer and also heleped me to get my camera work wirelessly .  a he was very helpful thank him for me.", "Date": "September 28, 2012"}, {"Title": "customer support", "Author": "Kelly", "ReviewID": "R14D73H6BJQQGO", "Overall": "5.0", "Content": "was unable to make the camera work wireless and port forwarding . spoke with Harry foster and he was able to make it work wirelessly and also helped with port forwarding ...I was very happy with the customer service that I receieved.  I was having a lot of difficutly with the wireless setup and Harry Foster, was able to acccess my computer and fix the problem in only a few minutes.  I will continue to do business with this company.  I would recommend purhcasing the additonal tech support because the guys are VERY HELPFUL!!!!!!!", "Date": "September 19, 2012"}, {"Title": "Ip camera Agasio A602w", "Author": "Sten Seemann", "ReviewID": "R3JR1XDY9FPJXM", "Overall": "5.0", "Content": "The features  which I  like about the camera :higher quality image, wireless, compressionThe reason I made the call to the Tech Support:no live video visableMy Comments on the service provided by the tech agent(Calvin Harris): Excellent fast service. Thanks a lot.", "Date": "July 30, 2012"}, {"Title": "agasio customer service", "Author": "Wesley", "ReviewID": "R3331WP32XNLUW", "Overall": "5.0", "Content": "had a hard time trying to figure out how to set up this camera, but spoke to customer service rep Harry Foster and he helped me get this set up very quickly and explained how to access camera feed from my iphone and other computers remotely. i plan to buy additional cameras in the future.", "Date": "July 26, 2012"}, {"Title": "Agasio Review", "Author": "Scott", "ReviewID": "R3J9LL6TE7XWUW", "Overall": "5.0", "Content": "Tech surport was great had my camera up and running in no time.Calvin Harris was a great help. Thanks. I can recommend this camera for wireless feature.", "Date": "July 20, 2012"}, {"Title": "Foscam IP Camera FI8910W", "Author": "Jason G Volz", "ReviewID": "RYGPKAD5D8DO6", "Overall": "5.0", "Content": "Customer service was excellent - efficient, very helfpul - and was able to fully set me up in less than 15minutees.  Jees was my customer service rep for the setup and he did a wonderful job.Highly recommend this company.", "Date": "July 12, 2012"}, {"Title": "good customer service", "Author": "acder", "ReviewID": "R1IPDVXINGV83E", "Overall": "5.0", "Content": "After buying a new router, my camera would no linger work wirelesly.  I called FOSCAM  support and JEES straightened it out quickly and efficiently.  I give both the camera and the support 5 stars.", "Date": "June 22, 2012"}, {"Title": "Remove from wish list", "Author": "Phuong", "ReviewID": "R2U6JX7USBSZCO", "Overall": "1.0", "Content": "I added this camera to my wish list for few moths waiting for the price dropping to reasonable and take it. But today I read the 1 and 2 star reviews I decide to take it out of my wish list. I trust the low star review though. I am not sure how can I give star for it, since I want to notify people whom just look at star to make decision to buy it so I will give it one star though.", "Date": "June 4, 2013"}, {"Title": "tech support", "Author": "Frenchie", "ReviewID": "R3ID1QPGROUXYA", "Overall": "5.0", "Content": "unable to set up my ip camera for remote control, needed help, very satisfied.will recommend the camera and support help was great.thanks Felix", "Date": "April 16, 2013"}, {"Title": "IP Camera", "Author": "Olaf", "ReviewID": "R2RZXMYXG391DF", "Overall": "5.0", "Content": "Unable to to Iphone and Ipad Called tech service and Sandra William walked me through and and corrected and everything is working. Great service and like the camera.", "Date": "March 5, 2013"}, {"Title": "IP Camera installation", "Author": "Zwi", "ReviewID": "R3GI4UMYN3W83J", "Overall": "5.0", "Content": "I had an excellent experience working with Foscam to install three IP Cameras.  I worked with Kate, who was patient and got through all of the problems we faced.  I highly recommend the service and the IP camera.Wansview Wireless IP Pan/Tilt/ Night Vision Internet Surveillance Camera Built-in Microphone With Phone remote monitoring support(Black)", "Date": "February 18, 2013"}, {"Title": "IP Tech Support", "Author": "Montee", "ReviewID": "RFES8BTD4TZDE", "Overall": "5.0", "Content": "Called several times to get help from Foscam and they were a great help each time I called.  They helped with the port forwarding, and the networking (wireless and wired) to great success.  The instructions within the camera were good and simple I just needed a bit more help which was easy to get with the help line.  Ralph Mendez was particularly helpful and helped me complete the installation and setup.  I am very satisfied with the cameras and the tech support and would recommend Foscam and Agasio Cameras to anyone who is in the market for a ip camera.", "Date": "October 15, 2012"}, {"Title": "Great Camera with great features , wonderful tech support as well", "Author": "Dennis F. Colligan \"Dennis C\"", "ReviewID": "R2DA5V9U5R0XLG", "Overall": "5.0", "Content": "I purchased this camera two weeks ago and while its UI is a little different from older Foscam models it is loaded features. I did experience a minor software iusse during install and needed to call Foscam tech Support which I have never done before or needed to. I have installed over fifty Foscam cameras and generally never needed  help. so, now I needed some help with a few features. I called Foscam tech support and spoke with SANDRA and I was very impressed with her knowledge and speed. she was able to guide me to setup a few features correctly and a pleasure to deal with. love the camera and the support from Foscam...thanks to the Foscam team and SANDRA !", "Date": "October 11, 2012"}, {"Title": "customer support", "Author": "Mitch", "ReviewID": "R2TF1M0T63BRZ5", "Overall": "5.0", "Content": "was unable to make the cam work wireless . spoke with Harry Foster he was able to make the camera work wireless and also helped me with port forwarding so i am able to view the cam remotely with my  static remote ip address .  Service was very helpful", "Date": "October 9, 2012"}, {"Title": "Correction on the product I purchased", "Author": "William M. Mclean \"William McLean\"", "ReviewID": "RIY52692UKCM1", "Overall": "5.0", "Content": "I was unable to make my camera work wireless and also help in making it work remotely . spoke with Harry Foster he was able to make the camera work wireless and remotely also he was the rep was knowledgeable of the camera and how it worked he was excellent The item that I purchased from Amazon was the Wansview model NCB541W night vision wireless indoor camera that the review I wrote was referred to. I do not know why the system changed the item I purchased to the one shown.  I did not buy the Agasio camera. WM", "Date": "October 1, 2012"}, {"Title": "Ip cam", "Author": "hercules", "ReviewID": "R28KTO7D4JXHAM", "Overall": "5.0", "Content": "Issue:Opening up the camera. Problem with active X. It is fixed and the camera is now wireless and it is port forwarded and the camera is working well.Sandra, was super great in her help.", "Date": "August 6, 2012"}, {"Title": "Technical Support", "Author": "jonnieg", "ReviewID": "R16GBJ2TWID2F6", "Overall": "5.0", "Content": "I just purchased Agasio Camera thru Foscam and am very pleased with the product and the support I received from Felix Anderson. I would recommend this camera to others.", "Date": "November 14, 2012"}, {"Title": "CAMERA SETUP", "Author": "Curtis", "ReviewID": "R2GPJC68V0KWG", "Overall": "5.0", "Content": "CALVIN HARRIS WAS VERY HELPFUL SETTING UP MY CAMERA. THIS CAMERA IS On the corner of home and all of the features are working to perfection.", "Date": "November 7, 2012"}, {"Title": "FOSCAM, EXCELLENT", "Author": "Filippo Intile", "ReviewID": "R2R1EL9FL60SZD", "Overall": "5.0", "Content": "FOSCAM AND CALVIN HARRIS, one of the telephone techinacal support that assisted me, on multiple occassions, are the best support that I ever have used in my life.I highly, recomend FOSCAM, but I especially recomend FOSCAM for their telephone superb techinal telephone support.I just wish they would have had techinaca support sooner.Sincerely,Filippo", "Date": "June 18, 2012"}, {"Title": "Very Pleased so far....", "Author": "Rich", "ReviewID": "R1ANTXOUQPBB1E", "Overall": "5.0", "Content": "The instructions for this camera are very limited but I am Happy with the camera so far.Model M166iThank you Calvin Harris from Technical Support for helping with the audio connections", "Date": "June 15, 2012"}, {"Title": "Foscam Camera", "Author": "tonijo", "ReviewID": "RP1VT144A9INS", "Overall": "5.0", "Content": "Calvin Harris is the tech support person I talked to.  He helped me to hook up the camera to my external hard drive and to my I-phone.  He took the time to work with me, and was very understanding about the help I needed. I could not have asked for a better professional to help me with the problems I was having.  He was wonderful.The Foscam Camera model #F18602W has very good day time and nighttime vision.  It is a really great camera at a great price.", "Date": "June 12, 2012"}, {"Title": "A622W", "Author": "sugaAR", "ReviewID": "R1XQ2RD1TD4TA8", "Overall": "5.0", "Content": "Service was good from tech support. I did find out that because I have a older foscam ip camera I would have to update my old software to view my new Agasio A622wwith my old foscam. Thanks for your help Rick", "Date": "June 11, 2012"}, {"Title": "Fantastic product", "Author": "Hamer", "ReviewID": "R1UC4R9F0D1SH2", "Overall": "5.0", "Content": "All I can say the product is fantastic, the delivery is on time, Even If you are an ordinary user, you will be able to install it with no problem, for the price comparing to the options is excellent, I wish if this product also support zooming, I would buy three more, Please let me know, when it is available. Thank you.", "Date": "February 11, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "22 IR LEDS for 50 feet (16 meters) NightVision - Features an IR-Cut Filter for true and accurately colored images (e.g., greens appear green rather than grey or brown); Wi-Fi compliant with wireless standards IEEE 802.11b/g - 640x480 Resolution; 0.3 Megapixel (Synology & Blue Iris Compatible)\nSupports 355° Pan, 80° Tilt - Features an Auto-Iris function which automatically adjusts the lens depending on lighting conditions so images do not appear washed out and do not require manual brightness adjustment; Supports M-JPEG video compression - Supports wireless encryption using WEP, WPA and WPA2 - Motion detection alerts via emailed images and FTP image upload\nFeatures an IP66 hardened outdoor waterproof enclosure; Provides for remote viewing & recording over the local network or the internet through a PC or mobile device (including Iphone, Android & Blackberry); Supports DHCP, fixed/static IP and PPPOE - Multi-level user management and password protection - Allows for remote viewing and recording from anywhere in the world through the internet - Supports DDNS for dynamic IP address stabilization\nSupports smartphones (Iphone & Android) as well as standard browsers (Internet Explorer, Firefox, Safari, Chrome)\nSimple to setup with an easy to use graphical interface; Motion Detection with email image notifications and image upload via FTP", "Name": "Agasio A622W Outdoor Wireless Pan/Tilt IP Camera with IR-Cut Off Filter for TRUE COLOR Images (Not Washed Out), Auto-Iris (Auto-Brightness Adjustment), IP66 Waterproof Enclosure, 50ft Nightvision, 4mm lens (72° Viewing Angle), Synology & Blue Iris Compatible, Pan 360° Tilt 90°, White", "ImgURL": "http://ecx.images-amazon.com/images/I/41ph-yxojTL._SY300_.jpg", "ProductID": "B005QT7ZBC"}}