{"Reviews": [{"Title": "Fantastic", "Author": "Charles D. Martin \"dzldan\"", "ReviewID": "R34T8TZ3RBL9IG", "Overall": "5.0", "Content": "One of the reviews on a Pan tilt zoom camera mentioned using it with Blue Iris. Thought I would give BI a try. Wow I had a lot of trouble with what I was using, said to myself it can't be any worse. Holy gosh, I thought I was buying a gold coin and got a whole gold bar instead. Fantastic, I have it playing all 26 of my security cameras without a hitch, even recording 24/7 and it works with that PTZ cameras. Love this program. I wrote code for 40 years and the thought that went into this is beyond belief. Good job.Update 10/12/13: recently enabled the webcasting feature which allows my customers, I own a RV park, to view the cameras since several of them I have setup as road cams. And locals use it to view road conditions before they come up to their cabins for snow sledding. I was looking at a super PTZ camera from Alibaba from China. The owner of the company put it on line and gave me the parameters to add it to my Blue Iris camera mix. Was cool to be able to PTZ with it from Oregon and the camera was in China. Was like it was inside the park here.I see some bad reviews, well, those are because people do not know what they are doing. Yes, it can be complicated, but then it is really not geared for them.", "Date": "February 28, 2012"}, {"Title": "Blue Iris 2.xxx", "Author": "JD", "ReviewID": "RSL8C8D84Q3T2", "Overall": "5.0", "Content": "I have used Blue Iris for the past 3 years in my business with good results. I performed extensive research and the consensus was that this is a top piece of camera software at any price. Huge library of supported cameras, frequent updates and good configuration flexibility. Not sure why the negative reviewer was blaming Blue Iris for crashing his wireless network - need to make sure you have sufficient wireless bandwidth if running multiple wireless cameras. I run 15 POE cameras and two wireless cameras through Blue Iris and have for quite a while with no network problems. It works great.", "Date": "January 4, 2012"}, {"Title": "Great surveillance software", "Author": "John Wayne Rules", "ReviewID": "R3IW3I1QKX7T0J", "Overall": "5.0", "Content": "I bought this to use with my Foscam home camera system and it works flawlessly...It really includes some nice features like auto recording when motion is detected, great audio, and it all is so all easy to use!!", "Date": "January 11, 2012"}, {"Title": "Love the features.", "Author": "JadedJak", "ReviewID": "R1CXIL7FL780BX", "Overall": "5.0", "Content": "The web server isn't the prettiest but it works great. I have it set to use JPEG push for maximum compatibility (anything with a standard browser works,even my PS4). There are a lot of settings you can configure, so many in fact, it has a bit of a learning curve. But once you get the settings just right you can let it run and forget about it. I have been using it for a a couple months now and it has never crashed or locked up my system. Its hard to believe that they could write this powerful software and sell it for so little.", "Date": "February 2, 2014"}, {"Title": "Software Licence delivered within 2 hours", "Author": "Benraymond", "ReviewID": "R1YPS4HUOLQ5V4", "Overall": "5.0", "Content": "After a lot of frustration of buying directly from the blueiris software website. This seller delivered the licence within 2 hours and works perfectly with upgrades to latest version. Thanks so much.", "Date": "January 28, 2014"}, {"Title": "Easy to use software for my webcams", "Author": "Amazon Customer", "ReviewID": "R1ZR2Q2VRSNALI", "Overall": "5.0", "Content": "I've only had this software for a few weeks, but installation and use so far has been a breeze.  I'm still learning the features, but I'm impressed with what I've been able to accomplish without much effort.Presently I have two cameras on my system.  The more important camera is the one at my front door.  I have motion detection set to alert me when someone approaches the door (with a doorbell sound), but have masking set so that the alert doesn't trigger every time a car drives down the street or someone walks their dog across the sidewalk.  The camera is a good home security feature, but my original intent was to be able to see who is at the door when I'm upstairs in my home office.I've also installed the Blue Iris software on my Android phone, so now I can monitor my home from anywhere.I did have to play with port forwarding on my router to enable web access.  And anyone installing webcams needs to be careful about network security - you don't want strangers hacking into your cameras.  If you're not familiar with setting up networks, I strongly advise getting help from someone who is.I love the fact that I can add more cameras at a later time.  This software seems to be all I'll ever need.", "Date": "January 5, 2014"}, {"Title": "Great Software. EZ and Super Fast Delivery", "Author": "Jeff Bennett \"LogicalMethod .com\"", "ReviewID": "RUB1YNHDPUQQY", "Overall": "5.0", "Content": "Downloaded the 15 day Trial version from [...] and loved it once I understood and tested everything I needed.Ordered the key from Secure4less and got me email (had to move it from my spam folder but that was easy too), plugged in the key, the software became full version and automatically suggested I update.No muss, no fuss and great experience all around. Love it. Getting the Android companion software right now!", "Date": "December 30, 2013"}, {"Title": "Good software", "Author": "Aser \"Aser\"", "ReviewID": "RHTRV7LF09SHJ", "Overall": "5.0", "Content": "I have been using this software for years and really like, i'm recording 4 cameras at the same time 24/7 without no problem.", "Date": "December 24, 2013"}, {"Title": "Great monitoring software at a great price!", "Author": "RSM61 \"Randy\"", "ReviewID": "R1NWFQRAVVQ5TC", "Overall": "5.0", "Content": "Very easy to use. Constantly updated. No conflicts with other software. Great price. I tried some of the free stuff available but it turned out to be a waste of time. Blue Iris is the way to go for The home and small business user.", "Date": "November 12, 2012"}, {"Title": "Need Registration Code", "Author": "Mark Livingston", "ReviewID": "R3VLNQ4IAUCYDZ", "Overall": "4.0", "Content": "When I run this program it says I have 15 days to review this product with 0 days left. I did not receive a registration code in my e-mail so I can't use the program. Please send a registration code.", "Date": "November 21, 2013"}, {"Title": "WOW WOW WOW, THE BEST IP Monitoring Software", "Author": "GT Man \"GTMAN\"", "ReviewID": "R2UVN6BV3ZEJ36", "Overall": "5.0", "Content": "This software is just amazing. Using it with 5 different ip cameras, from foscam, axis, to dahuam, wanswiew and a Kguard dvr, its just handles eveything awesomely. Do yourself a favor, download the demo and see for yourself.FYI there is a forum at cam-it.org where users discuss this software.", "Date": "September 17, 2012"}, {"Title": "Limited", "Author": "Robert R Johnson", "ReviewID": "R3TKJBBBSZKQU1", "Overall": "3.0", "Content": "The IE only, with  server always active environment is just not acceptable to me. A few very inexpensive android and IOS apps give me just as much as this product. It works fine, and I will keep it available but not as the main access when I am away.", "Date": "March 22, 2014"}, {"Title": "STAY AWAY!!!", "Author": "njlax32", "ReviewID": "R33M3CDE3XK0M", "Overall": "1.0", "Content": "Purchased this online expecting an email with my registration code or at least an order confirmation but nothing for 4 days and counting. My credit card was charged immediately. There is no phone number and I have sent three emails to their tech-support but nothing. Doing some research to get a phone number I find out that there domain name blueirissoftware.com is registered as private?? Why would a legitimate business do that? Now I have to contact my bank and dispute the charge. HORRIBLE, HORRIBLE customer service!!!", "Date": "February 12, 2014"}, {"Title": "Security", "Author": "James R Lane", "ReviewID": "R207TX0YHUNADJ", "Overall": "2.0", "Content": "Purchased the above software to go with the camera's that they advised it would work best with. The software was very slow and froze up the computer so I deleted it and went with a different one.", "Date": "April 20, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "NULL", "Name": "Blue Iris Full Version Supports Up to 64 IP Cameras", "ImgURL": "NULL", "ProductID": "B005DMX1OM"}}