{"Reviews": [{"Title": "Good for the price", "Author": "Banjeman", "ReviewID": "R3K4XTPNJ1C2DH", "Overall": "4.0", "Content": "Just received and installed.  Cameras have narrow view, but work good in daylight.  At night you will need to have a light  near by to get any decent video.  I Was able to connect my windows computers, tablets and phones through LAN.  I am still not getting remote access, appears to be because I have an airport extreme.  This product is not Mac friendly (can view using IE, but not safari).  For My IPad, IPad 2, iPhone and Samsung galaxy s2 I used an app to get working on LAN.  If you are installing your own hard drive it must be Sata, installation of hard drive was easy and directions were found in the owners manual.  I will definitely be upgrading cameras over time to get wider views and audio.  For the price I am satisfied.  From what I can tell to get remote access you will need a DDNS name and server, which I am struggling to get working on my airport extreme.  I might try a different router I have laying around just to see if I can get remote access working.  I will update if I have success with remote access (outside of my LAN).", "Date": "March 3, 2012"}, {"Title": "DVR not worth the money, buy another model or brand", "Author": "WHIZ-3", "ReviewID": "R3UHWF78THYRGJ", "Overall": "1.0", "Content": "The model does not hold the correct time, cannot access with software shipped, does not operate with smartphones.I receive a error message when I try and log into the dvr with the included software or through my iPad. No LAN or Wan access.The time keeps changing. The cameras don't display correct colors.In short this is a piece of sh%t.I wasted money on zmodo.Buyer beware......Update; after contacting seller, they say they will gladly refund or exchange my item, I am only looking for an exchange, and happy they are very willing to  work with me.Well, after dealing with the seller who gladly accepted an exchange, only I find it was repaired and not replaced. I was not too happy, considering all the issues I had with the DVR. I could not ask for a refund because, I was too quick to install the cameras before testing out the unit.I still have no access on my iPhone, I own a Mac computer so I can't access the cameras on my computer either.I had to contact the seller to find out which iPhone App is for the unit. I was told Aplayer, I downloaded the App, only to find I still can't login to see my cameras, now I think I am pretty savvy with Electronics, I have a degree in Electronics Technology, I have worked for F.D.O.T. on the Turnpike for five years installing and servicing CCTV cameras, and equipment, and could not get this Zmodo model to come up on the App.Bottom line is I bought a paper weight. I replaced the junk with a CIB brand and got much better results and was online in a matter of minutes.Me personally, I would not recommend this brand or model.", "Date": "October 3, 2012"}, {"Title": "A review more for the company itself...", "Author": "Bryan Lemke", "ReviewID": "R7CRVP26TWBRX", "Overall": "1.0", "Content": "After reading several different reviews, I had a few questions regarding the device itself and decided to contact the company.  I first tried the online chat and was given a rather lengthy SQL/PHP/Service unavailable message on the Live chat link from their home page.  I next tried their phone support, where you give them your number and they call you.  The estimated wait time was supposed to be 23 minutes, but 45 minutes later no phone call meant I'd try their company direct line...and got another 40 minutes of hold time.  After spending close to 90 minutes to get in touch with the company that is supposed to be a global leader in surveillance, I figured an invalid link from their home page, a non-working phone support system, and the URLs they give you on their hold music going to pages that don't exist...I'm going to say I'm nervous about investing money in a global surveillance leader's product. when the web and phone support systems don't work.The bad: They are a manufacturer of web/phone/email-accessible surveillance products and their web & phone systems are having problems?  Isn't that like having a motivational speaker on suicide watch?The good: Their hold music is pretty good.  Not 40 minutes good .Bottom line: Yikes.", "Date": "August 29, 2013"}, {"Title": "Good kit for it's money", "Author": "Dmitry Entin", "ReviewID": "R3VYJ5KAB3Q8ZP", "Overall": "4.0", "Content": "Warning: there are 8CH DVR on the photo. And there are 4CH DVR in the kit. Cameras without mocrophones.It work fine, you can access DVR through LAN or Internet, from Desktop or Tablet PC.", "Date": "June 4, 2013"}, {"Title": "Zmodo Surveillance System", "Author": "Ashley H.", "ReviewID": "RTHBJPPDGYVC8", "Overall": "3.0", "Content": "Overall, the product is decent for the price. The cameras have good quality during the day, but at night you can not see anything unless a light is nearby. The cameras do not have a wide view if that is what you need. The monitor that is shown in the picture does not come with the system. It is not listed in the included part, but does make it a little confusing. The cameras are not audio capable, but you can buy a camera with audio or a microphone and hook it up to the system.The instructions are not clear and have technical terms. I would describe the directions as a brief overview of how to set it up. I recommend calling the company to help assist you to set it up correctly.In order to hook this system up to your computer, you will need to buy two Ethernet cables. One from your router to your computer and one from the router to the DVR. For you to use the mobile app you will at least have the router connected to the DVR with the Ethernet cable. The mobile app is very easy to use, but again you should call the company to set it up.This surveillance system does include a hard drive, which you need to record any video/audio. You can not just use a flash drive to save data. The flash drive can only be used for a back up. The hard drive costs anywhere from $50 and up. Without a hard drive you can only view the cameras on your monitor.I don't know if I would buy another surveillance system from Zmodo because of how difficult it is to set up to the computer and mobile app. I am very good at setting up stuff for the computer and not illiterate in that area at all. I can normally figure it out myself, but I could not figure this system out at all! Other than that it is a pretty good system.", "Date": "March 10, 2013"}, {"Title": "Good Purchase", "Author": "Tim", "ReviewID": "R32MTKLLKD7L38", "Overall": "4.0", "Content": "I purchased a 500G HD to go with the DVR and it recorded for 16 days 24/7 before it started overwriting from the beginning.Perfect color video.  Decent night vision.  Easy to use and install.For the low price I paid it was avove my expectations.", "Date": "March 12, 2013"}, {"Title": "You have to be a network genius", "Author": "Nicole Daley", "ReviewID": "R3LDL89O0RKZM9", "Overall": "1.0", "Content": "in order to configure this to system to work you have to know how networks and ip addresses work - this is NOT easy to use at all, and if want to use online to view on cell or computer.....almost impossible and of course the company is in China so no real support.", "Date": "May 22, 2014"}, {"Title": "Not worth a it", "Author": "Jon", "ReviewID": "R1LHE81FVBPWXQ", "Overall": "1.0", "Content": "I don't like it not worth the money just spend the extra money and get a good set that's what I think", "Date": "January 22, 2014"}, {"Title": "Awesome", "Author": "angel gutierrez", "ReviewID": "R2H7459BT0VOG", "Overall": "4.0", "Content": "It didn't come with a hard drive so that's why I gave it a 4 on rating. Other than that it's ok", "Date": "January 13, 2014"}, {"Title": "No audio", "Author": "Levi Brite", "ReviewID": "R1LVWCU7W5OBM9", "Overall": "1.0", "Content": "Was not what was advertised and the Dvr doesn't work plus it is low quality. It also has no monitor or audio", "Date": "January 11, 2014"}, {"Title": "product is poor", "Author": "robert torch", "ReviewID": "R19N8BWCLXKD1L", "Overall": "1.0", "Content": "unhappy with the product. unable to receive tech. suport, unable to get a telephone #. soft ware needs to be replaced.", "Date": "December 30, 2013"}, {"Title": "i have tried everything", "Author": "Ron", "ReviewID": "R3LK7N86POZLBU", "Overall": "1.0", "Content": "I was unaware that i needed to purchase the HD. so i went to a electronics store with info of requirements and installed and now i get a message illegal hard drive needs formatting i have no idea what to do", "Date": "December 27, 2013"}, {"Title": "Save your money", "Author": "Scott", "ReviewID": "R3MOH3D31YILHF", "Overall": "1.0", "Content": "I am really unhappy with this product.  It has never been fully operational.  The hard drive that I purchased for it wont recognize it has one.  Therefore it has never recorded a single event.  The remote does not perform very well unless you are right on top of the dvr.  The instructions are not user friendly at all so unless you are an electronics guru it may as well be printed in chinese.  The system now 6 weeks into limited operation has all of a sudden stopped displaying all the cameras at once and I have not been able to restore the cameras meaning that i just wasted all the money to purchase, install and I was never happy with the color and quality of the camera images.  Not for a beginner at all.", "Date": "December 17, 2013"}, {"Title": "Every words except remote viewing", "Author": "S. Wan", "ReviewID": "RVKJEA7OABPBU", "Overall": "3.0", "Content": "Difficult to setup remote viewing and difficult to get the recording going.  No finding enough support resources to help you setup.", "Date": "April 20, 2013"}, {"Title": "decent product", "Author": "a computer guy", "ReviewID": "R2YCUCJTPPIUY5", "Overall": "4.0", "Content": "arrived as indicated.  Set up was a snap.  Hardest part is moving cameras into the best angles.  The cameras are not tbe best but upgrading into high quality is easy enough.  Software on dvr is straight forward and i thought was user friendly.  I got the 4 camera model but had i known just how easy this diy project would be id have gone for the 8 camera system.  Up and running two months with no problems.****Edit***  It's been 9 months.  Caught my criminal and many interesting things at night on the property.  Unit/cameras still going strong through all weather conditions from snow to 95 degrees.  Need light at night for decent vid but wasn't a problem getting motion lights installed on outside sources for an easy diy project for pennies.  Well worth the $$$ so far.", "Date": "February 3, 2013"}, {"Title": "Surve illance Camera", "Author": "patricia moore", "ReviewID": "R193JZI33KVGU7", "Overall": "4.0", "Content": "I live in a bad neighborhood,an now that i have my surveillance camera,i fell safer at home ,an when im away.very clear picture too...", "Date": "December 11, 2012"}, {"Title": "so cool! it's a good product!", "Author": "Felix Ch", "ReviewID": "R83OVZEU8IRAA", "Overall": "5.0", "Content": "it's made of good material, the camera size it's good, the vendor it very reliable, all i like of this products, i can use in my adroid cell, in my personal computer and in my work, in everywhere i can see what my baby doing, my home it's small, if you have a big house i recomend eight cameras or six cameras.", "Date": "September 6, 2013"}, {"Title": "Zmodo pkd-dk4216 surveillance camera kit with 4-channer h.264 dvd and 4.....", "Author": "LEONARDO ALMONTE", "ReviewID": "R267820UDL20X4", "Overall": "3.0", "Content": "the picture show a surveillance monitor and i didn't get nothing, so you can checkthat order i will appreciate thank  you.", "Date": "August 30, 2013"}, {"Title": "ok for the cameras", "Author": "jessi", "ReviewID": "R1MQJ2LLX6KZ9I", "Overall": "2.0", "Content": "they should let you know that this item does not include a hard drive and there are several issues with the software, but for the price you at least have a set of cameras", "Date": "February 2, 2012"}, {"Title": "I would not advise Bhama Product", "Author": "MOHAMAD", "ReviewID": "R2J558M6EVM2WX", "Overall": "1.0", "Content": "Not thinking of buying this product because it is bad Broken lose your finances more than 20 days and is now Atlan bad deal, unfortunately, Price understatement trick trick", "Date": "March 2, 2013"}], "ProductInfo": {"Price": "$149.99", "Features": "Network Access and Live View via Smart Phone & 3G Mobile (iPhone & Google Android)\nTV Monitor BNC Output and PC Monitor VGA Output\nH.264 Hardware Compression\nPTZ via RS485 Port\n1/4\" Color CMOS Cameras with 420 TV-Lines, Night Vision up to 30'", "Name": "Zmodo PKD-DK4216 Surveillance Camera Kit with 4-Channel H.264 DVR and 4 Indoor/Outdoor IR Cameras - Hard Drive Not Included", "ImgURL": "http://ecx.images-amazon.com/images/I/41wJTdhzoRL._SY300_.jpg", "ProductID": "B00516829E"}}