{"Reviews": [{"Title": "Terrific IP camera!  (Pan-Tilt-NO Zoom)", "Author": "txtmblweed", "ReviewID": "R44FCB605I52", "Overall": "5.0", "Content": "I bought two of these cameras to monitor my isolated rural home and immediate area.  first of all, I've been installing CCTV cameras and security systems for 30 years, I'm a retired Army colonel.  Yes, the instructions were skimpy, but real men don't need no steenkin' directions!  I had both cameras setup and viewable from anywhere in the world--in just 12 minutes!  Total cost for both cameras was just under $100!  I hardwired them both into my ethernet network, set them for fixed IP address assignments.  I then set the router to port forward their addresses, and presto!  Instant password protected viewing from my smart phone or any web browser anywhere in the world.  Night time IR viewing is terrific out to about 30 feet, B&W; in IR mode of course, excellent color in daylight.Plus, its motion detection automatically sends about five photos, upon the setable alarm, to my gmail account!  Should someone break into my home and steal my computers, the photos of the idiots are safe up on my gmail email account!  I do have one local PC set to accept and store alarm videos (10 second clips in AVI format with sound!).Yes, I have already recommended these cameras to my friends and business associates--and they've bought a half dozen so far!", "Date": "January 29, 2013"}, {"Title": "Great camera, not so great instructions!", "Author": "b. dot", "ReviewID": "R3ISPWXENPWZJ2", "Overall": "4.0", "Content": "The instructions for setting up the camera weren't the clearest. But once when I got the camera up and running 100% it is AMAZING, especially how it can email pics after the camera senses motion.1. I would recommend using the install instructions from FOSCAM.. found here: [...] It just seems to be more clear.2. Set your bookmarks (favorites) on your browser to the external ip after setting up port forwarding and figuring your non-local IP address (not the one that starts with 192..). Thus you can use your laptop/tablet/phone to access the cam outside of your local network.", "Date": "December 24, 2012"}, {"Title": "EasyN Wireless IP Camera", "Author": "Sam S.", "ReviewID": "R4MVMYH2JHEYS", "Overall": "4.0", "Content": "I had been searching for a long time for better options to put in my baby's room to use as a baby monitor besides the audio only gadgets and the highly expensive video monitors which break down after only a few months use. I could've done what my ex SIL did by spending a fortune to have a security system installed in their home with a camera in the baby's room. But who wants to spent that kind of money?I came across the idea of using an IP camera specifically for this purpose. After looking to see what was cheap and available, I settled on the EasyN brand of cameras. I am not a computer novice by any means but neither am I a networking guru. I bought this brand because it was inexpensive, there was a ton of support available on their website and, if I failed at networking the camera myself, I had the option of paying an extra $29.00 for a networking pro to help me.I got the package, opened the box, started hooking up cable and gritted my teeth for what I thought was going to be at least a half day struggle because of all the reviews I had read about this camera. I was very pleasantly surprised. I had it done within the hour. And the only reason it took so long was because I read through all the tutorials on the EasyN website just to make sure I was getting it right the first time.The camera works perfectly! It pans and tilts and there is audio.  But what's not so great is the interference on the audio from my wireless network. I read that can be fixed by using a wired connection. But that wasn't an option for me as my baby's room is way down the hall from mine. The reason I gave it 4 stars and not 5 is because of the GUI.  My opinion is it's just ok.  I've had it for a few weeks and still have not been able to figure out what some of the controls do nor is there documentation anywhere with instructions in english.  Because of that I only use it for administrative purposes now.  Instead, I use the camera wih Baby Monitor Foscam on all my I-devices.I am able to see my baby now from anywhere in the world that has an Internet connection. Not that I would ever use it in Timbuktu, but it's nice to be able to have that option. I am happy, my family is happy, and I even managed to impress the ex in-laws because now they can also see their grandchild from cross country anytime they want to.", "Date": "June 16, 2012"}, {"Title": "simple install", "Author": "Buyer Beware", "ReviewID": "R3DR19R3LVT46S", "Overall": "4.0", "Content": "What the other reviewer missed in his review is that the camera has never been on your network and it needs to be to talk on it. Since you setup the camera through the network it has to have a mechanism to attach. That mechanism is dhcp and a hardwire connection. Once its setup for wifi and knows about your network and any passphrase or key it no longer needs the hardwire. These are easy to setup. Once setup the alarm features can notify you immediately of issues. Mine takes about 60 to 90 secs to email photos to my phone. Very cool. The software is a less than stellar but it works well. I'll take function over beauty on these cameras any day. Bottom line these are inexpensive for what you get and if you take the time they work effectively. Easy n has apps available on the web and they supply a disk.", "Date": "March 23, 2012"}, {"Title": "Great Camera!", "Author": "pendulum32", "ReviewID": "R172FIT9PN75HZ", "Overall": "5.0", "Content": "I say this as someone who's generally regarded in my little world to have some idea of what I'm doing with computers. The user guide is awful, but if you have some basic knowledge of networking, firewalls, and port forwarding, then this is an excellent camera for the price. If you would rather have someone hold your hand through the process, you may want to consider another model. You should also have some tolerance of less than perfect written English.I had no difficulty setting up the device. I used the CD that it came with for a small part of the initial configuration to get it on the local network, but after that, I just configured the device from the web interface because it was so much easier. The camera is still working great to this day.As a quick tip, you can turn off the blinking green light that's always on by default. Just choose \"been extinguished\" from the drop menu under PTZ Settings. I found that constantly blinking light super annoying. Sadly, I haven't found a way to turn off the infrared lights.The speaker and audio features only work in Internet Explorer with the use of an ActiveX control. If this feature is really important to you, please be aware that it does depend on IE. The device provides the following viewing modes then you connect:1. ActiveX Mode (for audio features when using Internet Explorer)2. Server Push Mode (Works well for standard viewing)3. Mobile Phone Mode (Never used this)4. iPod touch / iphone 2G, 3G, 3GS, 4 and iPad dedicated (Self-explanitory)You can even configure separate logins for multiple users with different levels of access permissions, which is definitely a plus.Video quality is fair. It's not very detailed, but it works quite well. It does what I need it to do. It's not bad, but not great either. It satisfies.I would recommend this camera to someone with some networking knowledge and who is in the market for a cheap IP camera.", "Date": "February 18, 2014"}, {"Title": "camera", "Author": "flynoe", "ReviewID": "R3HGAWAFRSDEDS", "Overall": "5.0", "Content": "Awesome product but get help if you arent saavy on computers. As described and great for day and night. Get this cam", "Date": "March 3, 2013"}, {"Title": "It works", "Author": "Amazon Customer", "ReviewID": "R38VNSRH3RVIU", "Overall": "4.0", "Content": "This review will be similar to my Wanscam Outdoor camera review.the only exception is that everything seems to work out of the box for the 2 cameras I brought.There are a lot of good and bad reviews on the Easy N cameras that makes it hard to decide on a purchase. After reading them all, I decided to give it a chance based on below- Cost: It's one of the cheapest pan and tilt camera's with mic and speaker that you will find- Functionality: It performs the functions listed.- Display: Images are good and night vision view is acceptable.My experience.- I brought 2 cameras knowing that reliability might be an issue.- Both cameras worked well and no issues so farSetup:- It was easier than I thought. When you get the camera, connect it to local lan and perform the setup. I didn't use the built in software and connected via a web browser to configure the settings.- The reset button is at the bottom of the camera- Don't make the mistake I did and try to plug the power cord into the speaker jack :-)  - It took me a few minutes before i realized my mistake.- The wireless IP and the lan IP will be the same however the mac address is different. If you lock down your access point by mac address, make sure you unlock it first to allow access.Tips / Suggestions:- You can't disable the makers DDNS. If you do use their service, make sure you route through a different port and use storng passwords.- email alerting wasn't simple to setup. suggest you use a separate account for that if you do set it up.- Micasa vera. did't work out of the box and I am still trying to figure it out. One thing that does work is to use the /snapshot.jpg url to get an image to appear.Other:- the speaker on the camera isn't the best but everything is functionalOverall, given the cost, it is worth it. a bit of a hassle to setup but once it is working, no issues so far. I would recommend this for a low cost monitoring solution for those with some knowledge on how to setup and configure networking and systems..", "Date": "April 17, 2014"}, {"Title": "Surprising quality for the price", "Author": "T. Loposser", "ReviewID": "RY374Q8FHNTOX", "Overall": "5.0", "Content": "I have three different brands of these IP camera clones and this one by far surprised me, very easy to setup with easy to understand settings except for one, the speed control for movement uses a scale of 1-10 with 10 being slowest and 1 being the fastest which goes against most thinking so be aware of that when your trying to figure out why your pan and tilt are on hyper speed. The picture quality actually makes me mad at my Foscam and Tenvis not having as good of quality. The mount on this camera is better then the ones on my Tenvis cameras and even better then the Foscam. The internal mic is amazing I can hear people in other rooms talking at normal volume. The speaker like all cameras of this type just plain out suck and is horrible sound quality to the point as not to bother. The only real con I have is that the power cord is short and I mean really darn short.", "Date": "January 25, 2014"}, {"Title": "Good Camera for the Price", "Author": "Amazon Customer", "ReviewID": "R3OBPY6MLIRT8R", "Overall": "4.0", "Content": "I am a novice in setting up an IP camera and so I bought this one wanting to set up a camera to view the front door of my house from my computer (I work at home and am always wondering who is at the door). The camera works great. The instructions are a little lacking but I figured it all out. There is plenty of help on the web as well. Pictures are clear. Sound, not so great but ok. The software isn't the greatest but I downloaded iSpy for free and it works great. Beeps and brings up the video on my computer when there is movement at my door. It is doing everything I wanted it to.", "Date": "April 4, 2013"}, {"Title": "Great Camera - Average Software - Need some tech savy to install", "Author": "Nick Sweet", "ReviewID": "R3VPBJ3RUSTJ9F", "Overall": "4.0", "Content": "Pros - Great Camera for the priceCons - Software average  - Instructions weak  - Mobile App Horrible  - Web App DecentThis is my first IP cam, so I can't compare to other brands. I am a techie, so it was easy to set up, but the setup software isn't the best. I didn't use their DNS service and used port forwarding on my local router for outside access, so I'm can't speak to how well that works or degree of difficulty to get set up.You will need to hardware via the supplied ethernet cable to do the initial setup. Setting up Wifi was not intative, but worked without issue.The Web application works well via Internet Explorer. Remote Listening works well. I have not tried the 2-way audio. (I recently rearranged my office and have to find my microphone...)The Web app through Google and Firefox is a bit unstable and does not support any audio.The Web App via mobile browser is usable, but has even less features.The android mobile app is useless for external viewing, as it will not save cameras, nor will it allow adding a manual camera. For internal use on your local network, it's annoying but works.There are a lot of other android apps for viewing ip cameras, that will work with this camera. However, I haven't found one that has 2-way capability for this camera and there are no free apps with listen capability.Summary: If you have a little tech experience (or are willing to poke around a bit), use Internet Explorer as your browser and don't mind a slightly clunky interface this is a great camera for the money.UPDATE - Downloaded the app via the QR code on the box. Completely different app then the one in Google Play, with 2-way audio. Works well.  This is a fully open version of one of the other apps that I tried the free version (IP Cam Viewer).", "Date": "April 14, 2013"}, {"Title": "Camera seems to work well, but the company is terrible to work with.", "Author": "K. Weber", "ReviewID": "R1KS4AGRVYK20I", "Overall": "1.0", "Content": "I have had the worst time with this camera and I am sending it back. The actual product appears to be everything you'd hope for, but, the company that sells it is awful. To explain, here is a copy of the email that I sent them:I am extremely disappointed with the service I have received after purchasing this camera. I have tried several times to set it up using the guides that came with the camera and the information that is available on the website with no luck. No one is ever available to help me online, all of your learning materials are outdated or take you to broken website links that only display in Chinese. This is absolutely ridiculous. I will be returning this item, and believe me I will be giving a terrible review. Not that this email will actually go to anyone seeing as there are no actual people that work for this company. You should be ashamed of yourself to sell a product that you cannot stand behind and support. I have a technical background and I was still unable to ever access it remotely. The name of your company is “EasyN”! Let me tell you- it is not easy, everything to do with this company is outdated and uninformative.", "Date": "December 19, 2013"}, {"Title": "Hard to use", "Author": "benibarra23", "ReviewID": "RHWRMDTVTWEPH", "Overall": "1.0", "Content": "The app is not very easy to use and you cant use it on your cell phone unless you have wifi. It wont let you connect if your using data which is dumb because a lot of the time I'm away I dont have access to wifi.", "Date": "May 27, 2014"}, {"Title": "Does not work", "Author": "Jewofk3e[foke[ofk[wefp", "ReviewID": "R3J0XX797ANZE2", "Overall": "1.0", "Content": "This item is fake and does not work. Directions and manuals are in Chinese and there is no help online.", "Date": "May 20, 2014"}, {"Title": "wifi is hard to set up", "Author": "rich jameson", "ReviewID": "R32FL0E9N5ERB0", "Overall": "1.0", "Content": "Wired works great, but wifi is terrible to set up, I'm still playing around with the settings in my router and just haven't had the time to set it up fully as it took much longer than I planned.  Directions are poor.", "Date": "May 19, 2014"}, {"Title": "No EasyN support", "Author": "Rod D. Sherwin", "ReviewID": "R6VJ6KN4Q7IVQ", "Overall": "1.0", "Content": "You better like the firmware that you get with the camera because it is the last one you will get.  If you attempt to go through their circuitous journey to upgrade the firmware it ultimately takes you to the Foscam site with no cross reference to the firmware that you might need.  Guess wrong, as I must have, and you now own a paperweight.In other words, EasyN does not support this camera.  I now own a brick.", "Date": "May 16, 2014"}, {"Title": "Not a wireless camera!", "Author": "Honbo Zhou", "ReviewID": "R1SQIMVVDO8961", "Overall": "1.0", "Content": "The one I received is NOT a Wireless camera, it requires wireline connection.The installation is painful and the instructions are not clear, not recommended.", "Date": "May 16, 2014"}, {"Title": "EasyN FS-613A-M136 Wireless WiFi Pan/Tilt IP Camera", "Author": "Doug Frederick", "ReviewID": "R1EU1OKT1FWKGA", "Overall": "3.0", "Content": "This camera was well worth the cost, and works as advertised.The Wifi aspect is -very- cool, and the physical appearance serves as a burglary deterrent.It would receive a 5 star rating on those points alone.However, this camera is -extremely- difficult to install, and that fact wasn't helped by a blank installation CD that came with the unit.Ports, and IPSs, and other Bill Gatesery (HUMBUG).Also, third party control software seems blatantly superior.If you don't have a friend with advanced computer skills, like I do, I wish you good luck.If you're a Geekmeister, this thing is great.", "Date": "May 8, 2014"}, {"Title": "product failed", "Author": "cindy l horton", "ReviewID": "R3LKODA75JHL9U", "Overall": "1.0", "Content": "This product did not meet my expectations did not work from the stark wouldn't hook up to Wi-Fi like it says and won't work on my windows 8.1 laptop so I am sending it back", "Date": "May 2, 2014"}, {"Title": "Product could not connect to router or computer", "Author": "William Jack", "ReviewID": "R25H4RN83ZU7IA", "Overall": "1.0", "Content": "The product could not connect through the router. I also tried using the eASYn software  on three different computers (one was using windows XP, another Windows 7, and the third used windows 8.1). The ethernet connection to each computer indicated \"limited or no connectivity.\" I tried using a \"known good\" ethernet cable to replace the one supplied and that produced identical results. I tried using the \"support service\" for several days and was not able to reach anyone.  If there was an active support service I suspect that the problem could have been resolved as I have a good tech background. I sent the device back using Amazon's \"easy return service.\" -- I really hate sending stuff back -- no one wins when that happens.", "Date": "April 28, 2014"}, {"Title": "Good camera, Not Plug and Play", "Author": "Eduardo Rivas", "ReviewID": "R18FI7G3PQ7FGW", "Overall": "4.0", "Content": "Really good cameras, customer support ( theres Is no such thing)  Not really plug and play, specially when you try to set it up when you are not using you network, and I consider my sel a person that knows how to use computers and softwares, when you investigate, getting frustrated with customer service and finally you figure it out.... It's ok", "Date": "April 25, 2014"}, {"Title": "Colors all Wrong", "Author": "JoeyJoe", "ReviewID": "R2NDXVM38GHU2J", "Overall": "3.0", "Content": "FREE SHIPPING KaiCong Sip1602 P2P/Pan & Tilt IP Camera/Wifi Plug & Play/Motion Detection/Mobile View/Network Camera with 8 Meter Night Vision and 3.6mm Lens (67° Viewing Angle)let me start off by saying I bought this cam for $50 and I bought a KaiCon one for $30 and its the same damn camera! Only real difference besides the price is the KaiCong is in all Chinese. ha. this camera is good. the daylight colors are off. green turns to purple and reds to green. I don't mind. I really wanted it for my front door at night.The Night Vision works great. you can see everything (in black and white) clear for only being .3 megapixels. the PTZ works great. I get a full 180 all around the room.Easy to set up, but I HAD TO USE their software to find my camera... sucks. but I set it up with port forwarding on my router and uss IP CAM VIEWER (basic) on my android phone to view and to PTZ.the two audio is a little off, it comes in all static, but eh. who cares. the listening comes in pretty clear!hope this helps!look at the KAICONG one for $30 if you want to start off with night vision and not spend a ton of money!", "Date": "April 23, 2014"}, {"Title": "love it", "Author": "Michelle Martel \"mainiax\"", "ReviewID": "R3N2JN5GWO757M", "Overall": "5.0", "Content": "easiest of my three cameras to install and doesnt reset like my others, Bought a second one just in case I need to replace one of the other brands that I own.", "Date": "April 13, 2014"}, {"Title": "Sending them back!", "Author": "2MaineCoons", "ReviewID": "R3PPKFB49IPFW6", "Overall": "2.0", "Content": "Had to be set up on the computer by an IT guy.  Constantly lost WIFI signals.  Operation was just way too inconsistant/sporadic.", "Date": "April 10, 2014"}, {"Title": "Great product once you figure out how to set it up!", "Author": "Andrew Lee Maurer", "ReviewID": "R3V6JFPS9JGSQG", "Overall": "4.0", "Content": "This camera is awesome for the price. The instructions are horrible though. I found a youtube video that walked me through step by step on how to set this thing up. I like it a lot now!", "Date": "April 2, 2014"}, {"Title": "EasyN is great to use", "Author": "James N. Cohee \"store2932\"", "ReviewID": "R3P56KACRX7ZZR", "Overall": "5.0", "Content": "We use the EasyN to watch if customers are coming into our store and if help is needed out front as we can't see from the back area of the business. It works great,", "Date": "March 21, 2014"}, {"Title": "Not satisfied", "Author": "Frank thompson", "ReviewID": "R1HAAV329QEZDZ", "Overall": "2.0", "Content": "I'm not satisfied with this item I was unable to scan either camera to add to app and no physical id # to manually add.", "Date": "March 19, 2014"}, {"Title": "not", "Author": "Paco", "ReviewID": "R1TYLJQ4PR1D3V", "Overall": "1.0", "Content": "this piece did not work and I had a very hard time with this. I tried and tried and to no avail, so therefore I sent it back.", "Date": "February 21, 2014"}, {"Title": "Hard to use", "Author": "Alex K", "ReviewID": "R2CHWEQZA8243S", "Overall": "3.0", "Content": "Couldn't figure out how to set it up to stream from outside the home.  It worked inside on the network and wish I could have gotten the darn thing to work.", "Date": "February 19, 2014"}, {"Title": "ok", "Author": "clive", "ReviewID": "R1V9U4QSK2HUW9", "Overall": "3.0", "Content": "Setup was a pain, not intuitive at all.Audio is on the low side.Once setup it works as expected.", "Date": "February 18, 2014"}, {"Title": "Good little cameras", "Author": "Brook and Mel Williams", "ReviewID": "R2BQTJ7I0YD6F8", "Overall": "4.0", "Content": "Good little camera. Has decent picture, and a reasonable feature set. Wish it supported HTTPS connections though. And I wish they made the wireless MAC easy to find. For the price it does exactly what I want. Decent picture, the 2-way audio is iffy. You can hear through it ok, but the speaker on the camera is pretty timid.", "Date": "February 17, 2014"}, {"Title": "Camera", "Author": "Rose", "ReviewID": "R3TD6M1SCW8E3O", "Overall": "5.0", "Content": "This was given as a Christmas gift so that they could have peace of mind were they are away from home.  This little camera alows them to keep a watch on there home when they are away.", "Date": "January 27, 2014"}, {"Title": "Misleading", "Author": "Thomas", "ReviewID": "R2Z38RGUU3ON3G", "Overall": "2.0", "Content": "Camera os fairly good but instructions are terrible and software just as bad.  You must have extensive wireless knowledge to get this to work wirelessly. It is not plug and play as one would assume.  I still have not been able to get it set wirelessly despite all the outside sources.", "Date": "January 22, 2014"}, {"Title": "not recommended", "Author": "Rachelle Fox \"Rachelle M. Fox\"", "ReviewID": "R1VODFHT6UVUW", "Overall": "1.0", "Content": "Could not get camara software to install on my computer after 7 hours of trying, finally went to the online website for help and parts of it were in Chinese.  To difficult.", "Date": "January 21, 2014"}, {"Title": "EASYN FS-613A-M136", "Author": "LUIS JOSUE CORDON", "ReviewID": "R38SNKUSAVLQHV", "Overall": "4.0", "Content": "IS WORKING GOOD FOR THE PRICE I BUY IT, DO HES WORK GOOD AND DON NOT HAVE ANY PROBLEM AT ALL.", "Date": "January 21, 2014"}, {"Title": "Extremely difficult to install", "Author": "Ralph Reed", "ReviewID": "R33YXN0N1PM3XM", "Overall": "1.0", "Content": "Still have not been able to hook up to wifi. I am still working on the installation.  I have needed to consult the internet because the manual is worthless and the web site does not offer help.", "Date": "January 20, 2014"}, {"Title": "OMG!", "Author": "O. R. Cummings", "ReviewID": "R1SS7FL0E860CX", "Overall": "2.0", "Content": "The instructions are really bad. If they want to sell more of this product they have to work on the what information is placed to get started. It took me half day to get it working. Once it's working, it's ok, but keep in mind that it does not record the videos on a cloud or something like that.", "Date": "January 19, 2014"}, {"Title": "Work Great !", "Author": "CC", "ReviewID": "R26XW38ODZR3P9", "Overall": "5.0", "Content": "Highly Recommended compare to other similar PTZ camera in this price rangeIt also got the additional feature like Position Memory", "Date": "January 17, 2014"}, {"Title": "Defective item", "Author": "Bitwave", "ReviewID": "R138EWI61JSLZ4", "Overall": "1.0", "Content": "Unfortunately the camera was defective. I was very excited to get the package and try out the new camera however when I plugged it in nothing happened. I tried different outlet in the house that I new worked, still nothing. I promptly went into my amazon and filled out the return form and submitted then printed return labels. Unfortunately the vender had no exchange policy so I was forced to return for a full refund.  I was ok with this because Amazon is very good about there refund policy ( I have never been burnt) so I quickly ordered another from another vender. I imagine the quality control on these cheaper camera's made in china are far from Stella! I was will to take another chance with another for the cost savings.  I will write another review when I have had a chance to evaluate one that works.", "Date": "January 15, 2014"}, {"Title": "It works great", "Author": "TH", "ReviewID": "R1YWWWPWDNVQLH", "Overall": "4.0", "Content": "This camera works great.  It is pretty easy to get up and running.  You will have to know a little bit about your router to get it where you can access the camera away from your home network.  I like it.", "Date": "January 11, 2014"}, {"Title": "Nice camera at a good price", "Author": "David", "ReviewID": "R3FQVOXTUF9VGN", "Overall": "5.0", "Content": "The camera was a little tricky to get configured.You need to understand how to open ports on your router.Has been working great and I will probably get a couple more.", "Date": "January 10, 2014"}, {"Title": "Sent me a damage item", "Author": "Carlos Gomez Artavia \"C. Gomez\"", "ReviewID": "R2KH173IWRN4KO", "Overall": "1.0", "Content": "A hour ago, I received a damage item.  It doesn't turn on.  I hope that I can refund my moneyDon't waste your time purchasing here.", "Date": "January 3, 2014"}, {"Title": "Excellent WiFi IPCAM", "Author": "Dave", "ReviewID": "R2V8PXZGCMXYKB", "Overall": "5.0", "Content": "This is my first IPCam. I researched everything on Amazon. Foscam was rated highly, and so was the EasyN for $20 less. I've only used if for a week, but so far I am very pleased. My wife raises chickens, so we wanted to be able to check on them out in the coop to make sure the foxes weren't guarding the henhouse! We can quickly check the status of water, food, and temperature. The wireless distance is about 100 feet. I changed the antenna to a +3dBi gain 8\". And I have a +9 dBi on the router. These are available from Amazon and not too expensive. The camera worked with the original short antennaThe IR lights are great for about 5-8 meters, and they are basically invisible. A slight red glow of the LEDs can be seen. The image quality is good at 640x480 max. Color is decent in daylight and of course B&W; with night vision IR's. Mechanically tracks quickly and accurately. The tracking speed is adjustable and up to to 15 preset locations can be programmed for one-click moving to a location. Setup was pretty straight forward:1) Use supplied CD or download from EasyN, the camera finder and viewer software.2) I first connected camera to router and laptop to router by cables.3) Configured the camera. It self assigned the IP address and saved it as static so its always the same. I did not select DHCP option. Once setup and viewed in the cabled mode, I removed the cable and logged in again with wireless. Worked right away.4) There are a number of options in the admin setup pages after you login using http://192.168.xxx.xxx:port, or whatever your internal network IP's are. Netmask is typically 255.255.255.0 - must match your network. Most setup options can be left unchanged. Note the IP and port number assigned. That's what you will use to login using your web-browser. Don't need the http://, just the IP:port# (81 default)5) Internet Explorer and Firefox both work as IPCam viewers and motion control. The IE software version however, has a couple of extra options: Listen, Talk (add speakers to cam port), and Record.6) Setup Android App. Its actually a decent app. Runs on your internal network. You can also connect anywhere using DDNS. A configuration comes with the software. And you can use any DDNS provider, such as DynDNS.orgI don't know of any cons, really. I noticed a connection loss occasionally after not viewing for several hours (Firefox). Just a refresh of the browser tab seems to bring it back. My wife uses IE and says it never did that for her.I'll update this review if there are any changes in performance or capabilities.", "Date": "January 1, 2014"}, {"Title": "Stopped working in a week.", "Author": "Gregory A. Post", "ReviewID": "RNFGP97X73KBB", "Overall": "2.0", "Content": "I know that any electronic can be defective, but this stopped working in a week.  Returned it and got a Foscam, with really seems to be about the same Chinese quality, but at least it hasn't stopped working.", "Date": "December 28, 2013"}, {"Title": "I couldn't get it to work.", "Author": "Jerri Price-adams \"JLP\"", "ReviewID": "RQFC7O0CWR1VW", "Overall": "1.0", "Content": "The description indicates that it is Mac compatible but the person on the website on-line chat says they only have one camera that works with Mac and this is not it. I tried my husband's pc running Windows 8 and still no luck. The software can't find it. I have an iPhone app that says it is hook to the router but.....Maybe I'm just old and dumb.", "Date": "December 27, 2013"}, {"Title": "I like some of the features of this camera, and I like the price, but it won't do 1st install on Mac", "Author": "jsanti1984", "ReviewID": "R3O5EPKJJDSC9T", "Overall": "3.0", "Content": "This camera states that it is for Mac and PC, but the application to actually assign an IP address only works in Windows, and poorly at that. The user interface is badly translated into multiple languages. I've used it in English Spanish and German, and I bet they translated the badly translated English to the other languages. Aesthetics aside, the user interface is robust in the features that it does provide. The camera will send you e-mail pictures when it senses motion, but you may want to put it about 12 feet back otherwise you'll see pictures and blurred images, That is to say you'll know someone came in the door for example, but they will be a blur unless you put some distance between the camera and the area you want to monitor. During live motion, performance is almost real-time on an uncongested wireless 802.11N network on 802.11 G, performance is passable when the network is uncongested.I can't find any way to record video on my Mac, and I'm not comfortable with buggy web interface Recording in Windows, which still wouldn't be Mac. I can't really endorse this product for Mac users at all unless they're very technical and have a Windows machine handy. I wouldn't recommend it for Windows users either although they at least would have recording functionality.If the manufacturer would release low-level information about the product, it could have a potential called following because of the reasons to come. If one could alter the firmware, or at the very least have a specification to build a different interface application this camera might be great for Hobby robotics.Those shortcomings aside this camera does have its strengths, the price point being the major one. South of 100 bucks, you're not going to be making your next Hollywood production on an IP cam. Nonetheless more expensive models will send you a video clip, or pictures. This camera however provides low-level input output for alarm system integration, in my case this would be useful for an Arduino robot that takes the high signal from this camera to detect motion, and sends a high signal to trigger an e-mail with pictures if some other sensor has deemed it necessary. I have yet to put this use to practical application, but I do intend to try it out and let you guys know. The web interface lets you select between active high and active low. I do intend to test and let you guys know how it works setting off an interrupt on and Arduino.For now, I'll give it three stars––I like some of the features of this camera, and I like the price, but I don't like it as much as I would if the menus were translated into better English (or proper Spanish or proper German for that matter)", "Date": "December 10, 2013"}, {"Title": "Many great features at a low price.", "Author": "Jeffrey A. Barrett", "ReviewID": "R32Y2YG2OXN9XA", "Overall": "4.0", "Content": "Works in low light conditions.  Pan and Tilt is nice for the price.One feature I didn't like was that there wasn't a setting to save the FTP file as the same name.  The camera saves the file with a time based name only.  I have an Airlink camera that has this ability which is much better.", "Date": "December 4, 2013"}, {"Title": "Good features, good price, and lots of bugs!", "Author": "Joshua Hatch", "ReviewID": "R1V8RGOI8UNNVL", "Overall": "3.0", "Content": "If you aren't good enough at computers to setup network devices without assistance, pass on this device. The manual and software contains broken English that leaves you wondering what they meant to say. There is no support at all. There is also numerous bugs in the device itself. That being said, if you can work around these issues, this camera has many attractive features at a very good price. As stated elsewhere, the recording software is also junk. Go download iSpy after you have everything configured and you'll be happy.It's a bit tricky to get this to work wirelessly. The firmware just is pretty buggy. I finally did get it to work wirelessly, through a process of discovering what the bugs are and working around them.1. Log into the device through the web interface. (with the network cable plugged in)2. Set a static IP.3. Enable \"Using Wireless LAN\" and set your network configuration.Sounds simple enough, right? Well, the difficult part comes in because the SSID cannot include a space, number or special character, and you must be using WPA, and NOT WPA2. I usually use statically assigned lease reservations on my network, but I could not get the device to get a DHCP address wirelessly, nor could I make it even connect using WPA2. The EasyN website doesn't have any firmware upgrades either.", "Date": "November 20, 2013"}, {"Title": "Cheap and functional, but you get what you pay for", "Author": "Craig Rhinehart", "ReviewID": "R27NFGQTWMK7M3", "Overall": "2.0", "Content": "It's $50 camera, so I guess I have to take that into consideration.First off, the power adapter doesn't fit snugly into the jack on back of the camera.  When connected it feels as though it will come unplugged easily.  Poor fit and finish.Next, I have it setup and am trying to record for the first time.  I am managing the camera in my Web browser and click the Record button.  I am prompted to specify the location and name of the file.  I accept the defaults (the Documents folder, with a defaulted name).  I let it record for a few minutes and then click the Record button again (presumably to stop the recording process).  When I look for the file, it's just not there.  So I click Record again and it shows me the *previous* file name in the Documents folder -- like that file is there.  I try to right-click and copy that file, then paste it somewhere else, but when I do I get a Windows error saying that the file no longer exists.  Somehow the dialog box things it does.  So I try the recording process again with the same result.  No dice.  Over and over again, in different locations from different computers, no dice.  I have no resolution at the moment.I then tried to update the firmware and cannot find a firmware update file for this camera.  At one point I am redirected to the Foscam support site, and the model numbers and firmware update numbers sent to me in an e-mail (after registering on that site) don't match my camera.  I am still unsure how to obtain a firmware update file, or if that will fix the recording problem.The tech support Chat feature is offline.  It's 2:00 PM ET on a Friday.The documentation is skimpy and has not been any help yet.  There isn't even any instruction on how to perform video recording.It only cost $50, but I am considering returning it and trying something else.  You get what you pay for, I suppose.All in all, I think I would give another brand a try.  I have used a D-Link camera in the past, and at least its stated features worked.  I can't say that for this EasyN model 136.", "Date": "November 8, 2013"}, {"Title": "Pretty good little robo cam !", "Author": "Ron", "ReviewID": "R1Y58T9P8OX6T9", "Overall": "4.0", "Content": "Pretty good little camera and comes with it's own website for streaming video too.. awesome for the price, I think. The overall speed at which it reacts and streams is quite good.", "Date": "November 7, 2013"}, {"Title": "Not Too Pleased..", "Author": "ALEX MERENESS", "ReviewID": "R1E1QYCTZPZ9DK", "Overall": "2.0", "Content": "This product comes with very little instructions, and didn't last long. After only having IP Cam for a month or so the internal speaker is already blown. The internal microphone Hardly picks up any room noise. The web interface that comes with this device is far from intuitive and probably the most frustrating thing of all is the app they tell you to download for your mobile devices. It \"Stops Unexpectedly\" every time you try to view the Ip Cam for your mobile devices. One of the main reasons I wanted this. Anyways with my personal experience, I'd say spend more money or go with a different brand.. This brand was nearly a waists of time!", "Date": "November 4, 2013"}, {"Title": "Never Again.", "Author": "Anonymous", "ReviewID": "R2NHL7P2GJK7OF", "Overall": "2.0", "Content": "Instructions stink.  Have had them for a month and they still are not fully up.  They are not keeping their settings and there is no assistance from the company.  I have tried.  My next purchase will be from the GeekSquad and the extra $20.00...will be well deserved!", "Date": "October 30, 2013"}, {"Title": "Extremely useful camera", "Author": "Ricardo Reyes", "ReviewID": "R25M07PE79XQCV", "Overall": "5.0", "Content": "I was on a trip a little concerned about my house security.Anywhere there was a WIFI I was able to monitor my home from my telephone.  I am happy with this purchase.", "Date": "October 24, 2013"}, {"Title": "Great camera for the price.", "Author": "Sam Kolkman", "ReviewID": "R130Y7ZDE2ZYDU", "Overall": "5.0", "Content": "Great camera and features for the price. Setup was ok. Needed to do a little research on port forwarding to set it up correctly. Didn't like the app on iPhone so got a different one that has more options. Considering getting second camera for other area.", "Date": "October 13, 2013"}, {"Title": "I give it a B...", "Author": "Zestymack", "ReviewID": "R1WZHVW7HNY5Z9", "Overall": "5.0", "Content": "This camera is an excellent indoor model and a fair outdoor model.I have it mounted outdoors on my front porch.Wireless range is about 11' obstructed, fps's are acceptable at medium resolution( 20fps.)Colors are weak at best, but you get what you pay for.Night vision is where it shines, long range, clear..", "Date": "October 4, 2013"}, {"Title": "Nice IP camera", "Author": "Shashi", "ReviewID": "R1H19XIBXB7KZ6", "Overall": "4.0", "Content": "This is a really nice IP camera.  The only challenge you will find is with the documentation and setting it up.  You may need to research a little bit about allowing the camera to be accessible over the internet so that mean your router setting among other things.  But once you figure it out, its a nice product to monitor your place when you are away.", "Date": "September 27, 2013"}, {"Title": "Very good deal", "Author": "n4uxy", "ReviewID": "R24LDHQQWTKJM6", "Overall": "4.0", "Content": "Oh yea this is a good deal.Big bang for the buck.A few years ago this would be a 300~500$ cameraThe only let down is the color is not so good.Due to it being a IR (inferred) see in the dark the color in normal daylight does not look right.", "Date": "September 23, 2013"}, {"Title": "Excellent security camera", "Author": "Amazon Customer \"Jon\"", "ReviewID": "R3NSC1BITEAJOA", "Overall": "5.0", "Content": "This is an excellent camera to monitor areas outside and inside the home. I paid much more for a similar camera but they both do the same thing. I HIGHLY recommend buying this one.", "Date": "September 4, 2013"}, {"Title": "Easyn camera", "Author": "Joe Shetley", "ReviewID": "R2J9SDD5RYDUFT", "Overall": "3.0", "Content": "I was wrong pick easyn no rec. nothing well. I want rec for copy. I can't find rec  broke enter my house who that man or woman.", "Date": "September 3, 2013"}, {"Title": "Two week and still going", "Author": "DaLi D.", "ReviewID": "R1O0HFHRJS2OXO", "Overall": "4.0", "Content": "This are pretty good cameras that you can use with iPhone, fairly easy to put it to work over the home wi-fi. You must connect the cameras to your router firts, do the setting so the router give a IP address and then you can used wireless.", "Date": "September 3, 2013"}, {"Title": "Inexpensive and works well!", "Author": "irunalot \"irunalot\"", "ReviewID": "R2M833ZX4HRPA9", "Overall": "5.0", "Content": "Setup isn't too bad.  There are a couple YouTube videos that show you the easiest way to get this camera to go wireless.  You must connect with the supplied internet cable to establish the connection then remove after the necessary setups to go wireless.  This is my second one and both work very well... I have them send me a text (phonenumber@vtext.com) to my Verizon phone and also get an email with pictures when they see motion.  There are some false alarms but the sensitivity can be controlled.  Overall, very good product.", "Date": "August 18, 2013"}, {"Title": "Love this camera", "Author": "Tammy Bruce", "ReviewID": "R1T8BX4EL6AWVY", "Overall": "5.0", "Content": "We use this camera as a baby monitor. It has a flashing green light that kind of looks like a strobe light in the room. We lightly placed a piece of painters tape over it which lessened the strobe and it doesn't seem to have diminished the quality. To get sound you have to purchase an app.for $2.99. We chose not to purchase it because our condo is small enough to hear our daughter.", "Date": "August 16, 2013"}, {"Title": "Very good camera for its price", "Author": "Luis Claudio Albero \"Luis Albero\"", "ReviewID": "R2KJJ06F82W5SW", "Overall": "5.0", "Content": "I have 5 of this at home. They are easy to install and change their settings if needed. I have published them to the internet so I can see my house even remotely. I also programmed the snapshot feature so when someone passes in front of any of them the pictures are loaded into a NAS that I can play later. You can also use the software that comes with it to record the video.For a few dollars you have apps on the internet or store to play with them.", "Date": "August 5, 2013"}, {"Title": "camera", "Author": "D. Stead \"Manchesterdale\"", "ReviewID": "R1HPDE8MPF42EP", "Overall": "3.0", "Content": "nice for the money, still have not figured out how to use it completely, but seems like its a good deal for the money.. I will fix the rating after I figure out more about it.", "Date": "July 17, 2013"}, {"Title": "Spent hours trying to make it work", "Author": "BobL", "ReviewID": "RWZGE6280PVML", "Overall": "2.0", "Content": "I have to say, all of the scary stories you hear about buying products from China came true for me with this product.  The quick guide did not match the online guide, several of the screens shots were different from the documentation, several times I received error messages that were in Chinese and when I tried to find a way to get help, their \"online\" help was a guy named \"Steve\" who responded in amazingly broken English that if I needed help, I had to email a third party and wait for a response.  While I am fairly technical, I am sure part of the issue was that I had never installed one of these before but there is no way it should have taken the number of hours it did.  I did finally get it working although for some reason, it stopped working when out of site of my router but it seemed like progress.  I went to bed thinking I could live with it but when I woke up, the picture stopped working although I could manipulate the device and make it move (so I know thw wireless was working.  As soon as I am done writing this review, it goes back in the box and will be sent back to Amazon.On a positive note, I had a representative from the company that is reslling the product contact me over the weekend to try and help.  He was great and really tried to make it work but they are new at selling this product and it was clear he was learning as well.Bottom-line, it should have been much easier than it was despite my short-comings working with IP Cameras.  Unless you are real familiar with these types of products, think twice about the ironically named EasyN IP Camera.", "Date": "July 15, 2013"}, {"Title": "Great camera", "Author": "Feanor", "ReviewID": "R632DGCFZLRBY", "Overall": "5.0", "Content": "It is one of many similar units sold online. This one, however, includes the external alarm header (a dry contact input and a relay output). It comes with some software which I didn't test, because the embedded firmware is enough to use it with a WEB browser.The WiFi card included is quite good, detecting not only my access point but several neighboring ones.", "Date": "July 14, 2013"}, {"Title": "Great night vision", "Author": "vj", "ReviewID": "R2SGSUPLBLXEJ7", "Overall": "4.0", "Content": "This cam is easy to setup. I have windows 8 and was able to use the cd that came with cam. Plug the cam to router (wired), use the cd to setup cam and wireless and thats it. i use for baby monitor and the night vision is great. Tilt, pan all worked, i haven't tried zoom yet.Cons:1) Poor audio and noisy, I have to use another device for audio.2) On/off switch on the device would help.", "Date": "July 2, 2013"}, {"Title": "No online", "Author": "David P Russell Jr", "ReviewID": "R1SNX5TNFWDS18", "Overall": "3.0", "Content": "Hard to get it on line for outside use. Was able to to see on local network first try. Great pictures", "Date": "July 2, 2013"}, {"Title": "EasyN FS-613A-M136 Wireless WiFi Pan/Tilt IP Camera", "Author": "Leonard Sanchez", "ReviewID": "R29Z0OQQGV6OEN", "Overall": "5.0", "Content": "Great camera for the price.  Easy to setup and use. Easy to mount.  Will certainly purchase another.  Great little camera.", "Date": "July 1, 2013"}, {"Title": "Great home use unit for the price", "Author": "Dennis John", "ReviewID": "R183GLERPMV4UN", "Overall": "5.0", "Content": "Easy to set up and simple to use.  Had remodel work going on at home.  Set it up and checked in from the office to see how the contractors were doing and when they called with a question, it saved a trip home.  Very happy with the purchase.While unit does not zoom, I really didn't miss it.", "Date": "June 20, 2013"}, {"Title": "great product with the price", "Author": "C. Ho", "ReviewID": "R12IKP582DCZ4Q", "Overall": "4.0", "Content": "It is good enough with the price that you paid for. I am happy with the product. I can see what inside my house by moving the camera remotely. The resolution is not that great and loud noise in the background while 2 ways communication.", "Date": "June 11, 2013"}, {"Title": "Works as advertised", "Author": "Rashad Mustafa", "ReviewID": "R3LU3W7UNUJGUY", "Overall": "5.0", "Content": "It worked as stated in the manual. However , I have not set up alerting.It was on LAN and WAN as well. Setup instruction does not provide enough details for setting up for WAN though.", "Date": "June 10, 2013"}, {"Title": "You can't beat it for the price!", "Author": "D. Folsom", "ReviewID": "RCE76989ZB3Q7", "Overall": "5.0", "Content": "It works exactly as I'd hoped it would.  I can use virtually and IP camera software (I use foscam's ios app). It certainly can't take high quality videos, but they are pretty good.  I am really impressed with the night time pictures.  I get very clear images even in a completely dark room.", "Date": "May 17, 2013"}, {"Title": "Poor Video, No Audio", "Author": "werner45", "ReviewID": "RBS9RCDT7DYP8", "Overall": "2.0", "Content": "For me, this camera was easy to set up because I'm familiar with networking, port forwarding, ddns etc.  The pan/tilt function works fine using the web interface.  The Android app is finicky, but it works.  The 2 way audio has too much interference/noise to hear anything useful.  Video quality is poor, so it's hard to get clear facial images.  The infrared leds won't turn off even though there's an option for it.  I also can't tell any difference between the 10 and 20 fps setting.  My guess is it's limited to 10 fps, very choppy.  The included Central Management software doesn't work with Windows 7 64 bit.  This is stated in the readme file, but not on Amazon.  Ispyconnect worked as a replacement.  This is probably ok for making sure your home in still intact, but I wouldn't use it for serious surveillance.", "Date": "May 11, 2013"}, {"Title": "Better than the more expensive similar cams.", "Author": "Erik Johnson \"EkriirkE\"", "ReviewID": "R4SPLP76M9TGC", "Overall": "4.0", "Content": "While I understand EasyN, WansView and Foscam are all the same company, this cheapest EasyN has the best configurability out of all of them.  Included with optional wired GPIO for the home DIY alarm system.  Video quality seems on-par with its more-expensive bretheren as well.  I particularly like the ability to skip the initial \"select browser type\" screen.  WiFi config was a breeze, I have it set up to log all movement to a local FTP with a snapshot every hour.  Every time movement is detected it calls a local HTTP (PHP) script with the camera's name so I can see a historical log (camera's internal log clears on every reboot/powerdown, all models).  As with other models, VLC can record the video stream.Unfortunately the firmware for this model doesn't appear to be readily accessible, or I would flash my WansView and FosCam with this one's.", "Date": "May 6, 2013"}, {"Title": "Great camera, even greater considering the price", "Author": "ifitaintbrokeitwillbe \"you rush a miracle man...", "ReviewID": "R3GIFAITS52U7H", "Overall": "5.0", "Content": "I've got about 10 Foscam cameras but was getting really tired of Foscam's games.  The last straw was their newest line which require special browser plugins to work and the way they are trying to make you buy their Blue Iris software.  So I bought this thing.  It was a breeze to setup, and I like the relay-out on the back for use with alarm systems.  Foscam doesn't have that.  So far this camera is at least as good as Foscam, and probably better.  Time will tell.  If problems develop, I will update this post.", "Date": "May 4, 2013"}, {"Title": "Love the camera - although hard to set up!", "Author": "Amanda", "ReviewID": "R1IYLRTVH4QW6E", "Overall": "4.0", "Content": "I got this camera today, 8 hours ago. 3 hours of which were spent trying to figure out the darn internet setup! Finally just started guessing for the setup and got it working (I don't know how, I just know that I had the camera plugged into the router via ethernet, and my laptop plugged into the router via ethernet as well). Once I finally got done with the setup, I placed it in my daughter's nursery and was amazed at the quality of night vision! A pitch black 10x10 sqft room is lit up with ease. The green indicator light was annoying, so after fiddling with the settings I finally found the button to turn it off, so that's a plus. The camera is pan/tilt (up down, left right) and can be switched to a ceiling install with the click of a button. There is a record function that records right to your computer, and an email alert (I haven't tried the email alert nor will I ever use it). The speaker and microphone don't work too well so far with me, I get too much interference so I have to figure that out still. The infrared lights are not too bright, so they don't blind my daughter as she sleeps, but again, they light up on camera nicely. Overall 4/5 because of the setup.", "Date": "May 2, 2013"}, {"Title": "EasyN FS-613A-M136 WiFi IP Camera", "Author": "JACK CHANG", "ReviewID": "R2HXC0XNMIOW5I", "Overall": "4.0", "Content": "I have used this camera for about a month now. So far it works as I expected.I was able to check on my house with it when I was traveling overseas.The only two issues I have are:1. Lack of instruction to set it up when you want to access the camera from outside of your home. I needed to google it to learn how to set up my router correctly.2. I still don't know how the two-way audio works. No instruction for this either.", "Date": "May 1, 2013"}, {"Title": "Alright I guess", "Author": "JA", "ReviewID": "R1NVPMVBYXEPMG", "Overall": "3.0", "Content": "This little camera performs OK but wireless setup was a bit of an issue because I had a # in my WiFi password and tech support didnt know how to fix it.  The software to record leaves a lot to be desired.  I downloaded some off the web that works much better.", "Date": "April 23, 2013"}, {"Title": "Good Camera, but poor instruction manual", "Author": "A. K. Mohammed Shameer \"askshameer\"", "ReviewID": "RKBA7K27XM3QK", "Overall": "3.0", "Content": "Though, its a great product, I'm giving a 3 star because of the struggle I faced though being electronic gadget-specialist. The Ethernet IP Camera worked seamlessly. It took nearly 2 days for me to figure out a way to get the Wifi feature working. Here are the steps I'd suggest you to follow to enable your Camera's Wifi feature:1) Download iSpy to get the IP address of the Camera when its connected via Ethernet Cable.2) Use the IP address and port to connect to the camera via a web browser.3) Change the router settings as per this video [Video Link is getting disabled by the amazon administer, please search for  \"EasyN IP Cam wifi setting .avi\"  in youtube uploaded by 'Cam EasyN'...]4) Go to the settings and search for \"Reset to Factory Default\"5) Now your camera will get detected by the IP Camera Search software provided by EasyN after the reboot. Dont touch the power cord.6) Select the Camera's IP address (In advanced mode)7) Go to the others tab and click on Set Wifi.Now the same IP address will be assigned for Wi-fi. Now you can remove the ethernet connection to the camera and your Wifi Camera should work. :)Quality-wise, the camera is good for the price we are paying.", "Date": "April 1, 2013"}, {"Title": "More than you expect", "Author": "Hector M.", "ReviewID": "R2VUQ38FIEXSOE", "Overall": "5.0", "Content": "Easy physical installation, all parts seem robust.Setting up the cam was very easy too, haven't read the instructions yet and it's already sending me emails and everything .. works great! :)", "Date": "March 14, 2013"}, {"Title": "Piece of Junk!!", "Author": "elynn 529", "ReviewID": "RKFUH51Q4B4GH", "Overall": "1.0", "Content": "We purchased this camera to install in our home before we left to go on vacation. Needless to say, it was supposed to be wireless & we were supposed to.be able yo set it up to see from our tablet while we were away. The package made it here just fine but we could not install it because the CD to download the software was bad. Too much money to pay out to get something that doesn't even work properly! I would mot recommend this product to anyone. Save your money and buy something better.", "Date": "April 7, 2014"}, {"Title": "Complex setup w/low quality documentation", "Author": "TimHenn", "ReviewID": "R324QFFZC503R", "Overall": "1.0", "Content": "unnecessarily difficult to setup and configure.  The manual was written with poor english.  Requires advanced routing configuration settings.  I sent it back", "Date": "December 6, 2013"}, {"Title": "Good performance at this price", "Author": "TW", "ReviewID": "RN1CJFUIKXABS", "Overall": "5.0", "Content": "Easy to configure, responds well to popular apps, image quality on par with competitors, best price I could find.  This is my 4th IP camera and it compares well to much more expensive units.  The documentation provided is a little weak, but there is a LOT of documentation online for setup and porting through your router.  It's really great to be able to check up on things while you're away from home over your smart phone.  I would recommend this product to others", "Date": "June 28, 2013"}, {"Title": "10/10", "Author": "Oscar J. M. \"Oscar\"", "ReviewID": "R14SOIC5E74FDU", "Overall": "5.0", "Content": "La conexion es sencilla, no use el servidor  EasyN por motivos de seguridad sino que saque un servicio DNS gratuito aparte con el cual conecte el equipo.Vision nocturna 10Movilidad 10Alcance de señal WI-fi 10Alarma de movimiento 9Envio de imagenes a correo 9 (Pueden ser de mayor calidad)Softwarer para telefono 9 (Es trial)Extras de camara 8 (Problemas con el microfono)", "Date": "April 10, 2013"}, {"Title": "Terrible service", "Author": "DP JR", "ReviewID": "R66ESL6EHF5PF", "Overall": "1.0", "Content": "The directions were in Chinese or Japanese and the website addresses and phone numbers for support were not available, non existant. I tried to install as instructed but the software disc was sent to me BLANK and the website to enable camera did not even exist. Dont buy this from this seller.", "Date": "May 12, 2013"}, {"Title": "Don't buy", "Author": "Joshua", "ReviewID": "R24AYC9R49PZ7N", "Overall": "1.0", "Content": "Audio didn't work at all (1-way or 2-way). Android app didn't work. Iphone app was clunky. Chrome website barely worked. IE was a little better. Junk product, recommend to avoid.", "Date": "May 9, 2013"}, {"Title": "Dead on Arrival", "Author": "Stephanie", "ReviewID": "R3KS86JIU21L4Z", "Overall": "1.0", "Content": "I returned my unit and won't purchase another. When I plugged the small 6V DC power supply into the 110V outlet, I was greated by a nice electrical spark and that was the end of it. I checked it with a DVM and the DC power supply was dead.I would also add that the installation guide is pretty poor. (It is written in Chinese, so if you know how to read Chinese, you'll probably be fine.) Since I don't read Chinese, I found sentences such as \"The camera support to get IP\" and \"the two function needs router supported\" a bit difficult to understand.", "Date": "March 28, 2013"}, {"Title": "Buyer beware...  You get what you pay for.", "Author": "w4mic", "ReviewID": "R2Z0QXCJ8W95XM", "Overall": "2.0", "Content": "I purchased this camera due to it's lower cost for consumer-grade cameras, and partially due to customer service issues with the manufacturer of my previous three cameras.Now, I wish I hadn't.Simply put, you get what you pay for.  This camera is cheaply made, has a very poor user interface, intermittently loses connection with the rest of my system, and occasionally just shuts down and reboots.Cheap, poorly made product.  Not recommended.  Spend the extra $40 and move up to the next level.", "Date": "January 12, 2014"}, {"Title": "cheapest PTZ ipcam available", "Author": "P. Ha", "ReviewID": "R2HR8SCPG3K5LE", "Overall": "4.0", "Content": "I was going to order another Agasio PTZ ipcam but saw this cheaper ipcam and thought to try it.And I glad I did.  This PTZ appears to have same hardware as the chinese-made ipcams.At $41, you can't find a cheaper functional PTZ ipcam.  I would recommend this ipcam for those familar with configuring ipcam. Not recommended for novice.PRO:Cheapest ipcam available (so far)Has the features of other Chinese-made ipcams (ptz, motion-detect, color, audio, night vision, ftp, etc)CON:Audio listening has annoying \"gear\" background noiseCase is plastic, would not recommend for outdoor use", "Date": "December 17, 2013"}, {"Title": "works great as a baby monitor", "Author": "Amazon Customer", "ReviewID": "R1ZLKZ136Y5BSM", "Overall": "5.0", "Content": "We use as a baby monitor for our smart phones and it works great when using laptop you can hear and speak to them.  Just wish it had audio for the phone as that is our primary monitor", "Date": "December 11, 2013"}, {"Title": "Over all good.  The company app stinks.", "Author": "Geoffrey M. Lang \"Geoff\"", "ReviewID": "R174XTPGFVJKAQ", "Overall": "5.0", "Content": "Once I got it to run it worked great.  You'll need the code on the box or on the bottom of the camera.  The screws for the mounting plate don't fit very well, but a 1/4\" - 20 bolt works just as well.  I'm able to look in on the baby from anywhere in the house, and I'm thinking of getting another one or two for security on the doors to the house.  Software is weird, and not very intuitive.  Knowing a little more than the average Joe about networking, I was able to figure it out.Their android app stinks. I use IP CAM Controller, set up two accounts on that for the same camera.  One for when I'm on the home wifi, and one for when I'm out on another wi-fi network.  I do not recommend using it on your cell data network because it uses a lot of data in a small amount of time.", "Date": "November 17, 2013"}, {"Title": "Do not purchase this item it doesn't work and locks up", "Author": "philnext", "ReviewID": "R28LTKZY9RY6TL", "Overall": "1.0", "Content": "Software sucks cannot get recorder to work on xp, Camera stops working on internet and cannot reset it remotely.  Picture is not too bad if it works.  Not reliable enough to set and forget when used on wifi.  Direct plug-in may make it work better but haven't try ed it that way yet.  Company so far has not given me enough help to fix issues and they do need upgraded software which does not seem to work with xp.  They don't support windows 7 yet.  Amazon should take it back but its over the return window and i haven't pressured them to do so.  Anyone with info on this?  I send email to company to return item but no response.Will not buy it again.  If a cam locks up and your not at home what do you do, its useless.", "Date": "November 15, 2013"}, {"Title": "Works well!", "Author": "MrFixIt", "ReviewID": "R2JJL12I2IYS6X", "Overall": "4.0", "Content": "I have 2 EasyN and one HooToo. All three of them work well. I use the motion detection to monitor my home when I am at work or see what the kids are up to. They are pretty obvious so don't expect to hide them, but everyone pretty much forgets they are there after a while. I set the motion detection to send me images and it emails, 6 images with each detection. Image is very good. I would give it 5 stars but I like the interface on the HooToo better. You need to understand how to setup router ports if you intend to view over internet.", "Date": "October 18, 2013"}, {"Title": "darn thing does not work!", "Author": "Joaquin Aguirre", "ReviewID": "R11F1J0NSB8CVO", "Overall": "1.0", "Content": "This supposed easy to use wifi ip camera is a waste of money and time. I do not recommend this piece of junk.", "Date": "September 14, 2013"}, {"Title": "Disappointed", "Author": "Tumbao", "ReviewID": "R2JJLKSHQ3V9KW", "Overall": "1.0", "Content": "I was disappointed to discover that this camera is NOT Mac compatible despite what Amazon says. The software disk shipped with the unit is Windows only. I was actually able to have an online chat with a very nice tech support person at easyn who verified that fact.However, you can use the camera wired to your modem using the easyN F free iPhone app as an in house baby monitor on your wifi network with sound and even take photos and 2 minutes of video,  but I think that's about it for Mac users.Without software (which does not seem to exist) you cannot make it wireless, utilize the motion detection, automatically take photos, turn off the blinking light or any other feature of the camera. If I am wrong, somebody please tell me and post a tutorial showing us Mac users the way. I read all the most current posts and no one has yet  explained a way to get it working. I already spent all day with it and only got it to work wired on my in-house wifi. Port forwarding on a Mac is a mystery (some of you know what i'm talking about). I'm no IT person but I know my way around a Mac and this is no 'easy' at all.I'm going to have to return it.", "Date": "September 10, 2013"}, {"Title": "Chinsey Camera", "Author": "T. Jones \"Meester Coffee\"", "ReviewID": "R1OUIQC8Y7W8BX", "Overall": "1.0", "Content": "The camera was supposed to have audio; it didn't.  Or at least it didn't work.  The software interface was supposed to have icons for said audio but they weren't there.  Setup wasn't horrible but i work in IT.  The really horrible element was the translations to English in the documentaion and the software.  EasyNusa.com woud not offer any support because they said that they did not make the product.OK Amazon vendor - terrible product.", "Date": "August 10, 2013"}, {"Title": "disappointed", "Author": "Svetlana", "ReviewID": "RFYJFYI3725TB", "Overall": "1.0", "Content": "this camera is not wifi neither wireless. to make it work i had to plug the short cable to router. same explanation in manual. so it is fraud, i waisted my money because can not use it and threw away the box to send it back. when i tryed to call to customer service (by the way in china) nobody pick up the skype phone. no back address of seller, no way to complain or ask any questions.", "Date": "May 25, 2013"}, {"Title": "50/50", "Author": "geoff fauver", "ReviewID": "R2G0ZN03MKL76D", "Overall": "2.0", "Content": "I bought 2 of these.  One works just fine, as inteneded and meets my expectations for this type of cam at this price point.  The other - same exact setup - and is DOA on my wireless network.  Wired is fine.  Says it applies the wireless settings. Cycle power (just as I did on its mate - as well as my other 4 similar cams) and it gets stuck during poweron during lens rotation with it looking to the sky.A reset has failed, loading factor defaults - also fails although again, it says settings have been applied and reboots the device.  Out of box it was on port 81 and I had changed it to 80. After the \"factory defaults\" I expected it to be back on 81 and it was not.I'll mess with it a bit more, clarity and responsiveness of the working unit is fine so I'd like to keep them but if I cant get the bad one working - they will both go back and EasyN will no longer be an option.", "Date": "April 25, 2013"}, {"Title": "Very poor setup instructions and little tech support", "Author": "Sunnyvale, CA", "ReviewID": "R2ETEH8SQF2CMA", "Overall": "2.0", "Content": "The unit appears fine except not easy to get it to work.There is no tech support via phone. Only email and messaging with apparently someone in China during eve/night time in US.Yet, on one night while I was text messaging with a tech support at my night in US, h told me to wait for another hour as he needs to go to lunch. that was my midnight and I had to wait !I have spent hours to set it up and still not done yet.I will give another try to get it working (wifi part and voice) or return the unit for refund.", "Date": "April 22, 2013"}, {"Title": "Annoying Flashing Green LED", "Author": "Robert Coleman", "ReviewID": "R37ATKQWWYQ2EK", "Overall": "1.0", "Content": "The unit is easy to install and access; however, it has a bright green flashing LED on the front when it is working that is both conspicuous and highly annoying. Looking elsewhere for my next camera.", "Date": "May 5, 2013"}, {"Title": "won't work over the internet", "Author": "yeen fun chan", "ReviewID": "R2UIF7ONNRD1RN", "Overall": "1.0", "Content": "It work ok in my local network, but not working over the web...don't buy this cam ....the server which handle the web connection won't work...Tech support...Ha Ha. I let them three emails in the last two weeks had not come back anything..Don't buy this cam", "Date": "May 19, 2013"}, {"Title": "the wifi don't work", "Author": "Amazon Customer", "ReviewID": "R2UDM9GQ4XZOKI", "Overall": "1.0", "Content": "well this is not the first wifi camera i have, i got about 6 of the dam thing, this is the 1st new one i got that the wifi has not worked on, i find after about 2 to 3 yrs the wifi gives out on these cheap camera anyway.", "Date": "April 9, 2013"}, {"Title": "Does work as advertised", "Author": "Mark Flolid", "ReviewID": "R2W9O62HHXO25G", "Overall": "1.0", "Content": "I thought this was truly wireless according to the advertising, but its not. Requires wired connection to the router. Worthless", "Date": "February 13, 2014"}, {"Title": "Difficult to install. Poor engineering at best", "Author": "Remi Levinson", "ReviewID": "RJIFTDXRJWK88", "Overall": "1.0", "Content": "First one I received didn't work and was defective.  The replacement worked, but impossible to set up.  Allocate at least 10 hours to get it to work remotely with I phone.  It still doesn't work well.  I would pass on this for something that has better instructions", "Date": "November 16, 2013"}, {"Title": "Cheap Foscam Knockoff", "Author": "GaryD \"GaryD\"", "ReviewID": "R1U9TH83DJEX6H", "Overall": "1.0", "Content": "If cheap is important to you over quality well then here's your product...otherwise go with the real deal.  Returned mine...", "Date": "March 26, 2013"}, {"Title": "Doesn't appear to be wireless to me...  Requires plug in to router", "Author": "WantedWireless", "ReviewID": "R2Y5XDPSLVRINQ", "Overall": "1.0", "Content": "Unsure about this \"wireless\" camera...  The first action item, per the 50 page instruction manual, is \"Plug the network cable into the camera and then into your Cable/DSL router\"... I'll try to check back in a few days, after I've read the rest of the manual...", "Date": "December 28, 2011"}], "ProductInfo": {"Price": "$41.98", "Features": "MJPEG Compressin - 640x480 Resolution; 0.3 Megapixel - Two-way audio communication with built in speaker and mic - Allows remote pan and tilt control (pan 270degrees tilt 120degees)\n10 IR LEDs for night vision up to 10 Meters - Supports wireless encryption using WEP, WPA and WPA2 - Supports DDNS for dynamic IP address stabilization\nMotion detection alerts via emailed images and FTP image upload - Supports DHCP, fixed/static IP and PPPOE\nMulti-level user management and password protection - Allows for remote viewing and recording from anywhere in the world through the internet - Includes free 64 channel surveillance software\nSupports smartphones (Iphone & Android) as well as standard browsers (Internet Explorer, Firefox, Safari, Chrome)", "Name": "EasyN FS-613A-M136 Wireless WiFi Pan/Tilt IP Camera Two-Way Audio, Email FTP Motion Alert, Remote Mobile View, DDNS, UPNP, 64 Channel Software, Windows & Mac Compatible", "ImgURL": "http://ecx.images-amazon.com/images/I/41gmV8DdnfL._SY300_.jpg", "ProductID": "B0054TW1WC"}}