{"Reviews": [{"Title": "Excellent value for the $$", "Author": "kc7gr", "ReviewID": "R15WLC52XPBQ3B", "Overall": "4.0", "Content": "Anyone who's been in the electronics field as long as I have (34 years and counting) is going to be pretty selective (rightly so) about their test gear. I researched at least four similar devices (including Ideal's $700+ unit) before choosing this one, and I am not at all disappointed.The first impression I had upon pulling it out of the box was the build quality. Despite being an import, this is a surprisingly rugged device with a first-class keypad. The display is bright and clear, easily visible in open daylight, and having multimeter plus PTZ test functions in one unit is extremely handy when you're 10 feet up on a ladder, poking around inside a camera's guts.My one and ONLY gripe so far is the multimeter test leads. They're definitely not up to the same standard as the instrument itself, being PVC insulated as opposed to the higher-quality silicone rubber found on better sets.I would not hesitate to recommend this unit to anyone working in the CCTV arena.", "Date": "October 28, 2012"}, {"Title": "A must if you install cams", "Author": "FP Crazy", "ReviewID": "R1F87G0Q37A973", "Overall": "5.0", "Content": "Other companies put their name on this and sell it for a lot more.  This thing works great.  I'm very pleased.  I've used it on a dozen jobs so far, with no problems.  Huge thumbs up.  It's also a VOM.  Battery seems to last forever", "Date": "July 8, 2013"}, {"Title": "Awesome!", "Author": "KdKazaam", "ReviewID": "R244JARMHHZHHE", "Overall": "5.0", "Content": "Wow this has made my work easy.Excellent tech. The company sent them immediately, so I got it in 24hours.Love it", "Date": "January 15, 2014"}, {"Title": "Approve", "Author": "Chris", "ReviewID": "RLZX7X0754RH8", "Overall": "4.0", "Content": "It has everything we needed to get he job done at the right price. Simple to use and the PTZ control is awsome!", "Date": "November 4, 2013"}, {"Title": "Unit works as advertised", "Author": "Justo Morell", "ReviewID": "RGQ4FJLUEQEK1", "Overall": "4.0", "Content": "This unit has been an asset to the installation of the new security cameras and no problems with this unit so far.", "Date": "June 11, 2013"}, {"Title": "good tool", "Author": "dog dad", "ReviewID": "R3L2ZR2WE7F8O6", "Overall": "4.0", "Content": "So far so good. It's got a good picture and the battery life is a plus. Haven't had the chance to try the ptz control, but all other functions are satisfactory. Convenient tool, I'd recommend it. Been in the biz for about 15", "Date": "April 15, 2013"}, {"Title": "great device", "Author": "Alaa", "ReviewID": "R2A3OBZKP1WV99", "Overall": "5.0", "Content": "its really very useful device it was great service i receive it on time and it was as written I work in security camera system field and i used this device this week to test a big camera system with more than 50 CCTV camera the monitor clear is nice and the 12v output is amazing and the charge also very good i used the device to test the 50 cameras and i use it with out needing to charge and don't forget its really in very reasonable price, so if you work with CCTV camera system don't think twice use this device its really helpful.", "Date": "July 17, 2012"}, {"Title": "Couldn't imagine maintaining a system without one of these!", "Author": "Frank Rioux", "ReviewID": "R38IPSSCBHL76W", "Overall": "5.0", "Content": "It met every expectation we had.  Great for taking up a ladder with no hands required.I really like the rechargeable battery.  Wish I had purchased it a year ago: we could have saved a few days labor by now.", "Date": "June 19, 2013"}, {"Title": "Very Handy.", "Author": "Amazon Customer \"raulgvalle\"", "ReviewID": "R6QJYQ210ZVUK", "Overall": "5.0", "Content": "Very handy. Very good not just for setting up cameras, but DVRs also.It does the job. Multimeter comes handy to make sure no short when making cables.", "Date": "May 26, 2014"}, {"Title": "worked good the first time I used it.", "Author": "P. Boulanger \"Regular Guy\"", "ReviewID": "R1QK3C8XNW8UUG", "Overall": "1.0", "Content": "Now some of the buttons dont work or repeat as if I were holding it down.Amazon wont take it back and I have no idea who to contact for warranty repair???", "Date": "May 6, 2014"}, {"Title": "Great test piece for Camera setup.", "Author": "RICHARD E TANNER", "ReviewID": "R3851YD6VP2HLS", "Overall": "5.0", "Content": "This is the coolest piece I now own. I am installing a large number of outdoor cameras and this makes the process so much easier.The screen view is perfect, adjust the can, lock it in place and your done.", "Date": "May 6, 2014"}, {"Title": "CCTV multi-function tester", "Author": "Radeeohh", "ReviewID": "RC02ZGANIQTWQ", "Overall": "5.0", "Content": "Great test set for the money. I have a home camera security system and I've used this tool often for camera set up and trouble shooting. I have not used all the features as yet but the quality of the unit seems very well made for a great value. I am gladI purchased this and will do it again, very handy to have.", "Date": "May 1, 2014"}, {"Title": "not bad just dislike the battery style", "Author": "Ew00kie", "ReviewID": "R2S4I95DD1HSHZ", "Overall": "4.0", "Content": "battery is not a hard plastic battery its those metal foil bag type battery besides that it works as described", "Date": "February 28, 2014"}, {"Title": "Eh, you get what you pay for", "Author": "Enrico DePaolis", "ReviewID": "R3PA4AAV28ZTV2", "Overall": "3.0", "Content": "The battery compartment clip broke the very first time I tried to open it to connect the battery. It feels solid and works as advertised but the thickness of the tap for the battery compartment was way too thin and it just snapped when I put pressure on it to open the compartment.  I'll have to use it for some time before I can give it a better rating.", "Date": "February 10, 2014"}, {"Title": "Great unit for the price", "Author": "ken DeGroff", "ReviewID": "R1NHST8DVX3ZT0", "Overall": "4.0", "Content": "Very nice unit for the price. Highly recommended for anyone needing a multifunction tester at a reasonible cost. I use the unit for testing CCTV camera installations and the display is clear and easy to see out side.", "Date": "February 10, 2014"}, {"Title": "great multifunction tester", "Author": "David Bowerman", "ReviewID": "R10P5T2BPZ1T0X", "Overall": "5.0", "Content": "excellent device for the price. Does multifunctions as advertised. would recommend it to anyone in the CCTV field. long battery life", "Date": "January 10, 2014"}, {"Title": "The best test monitor I have ever used.  Great price and build quality.", "Author": "Corey", "ReviewID": "RLPDU6M93X3YM", "Overall": "5.0", "Content": "The ability to troubleshoot PTZ cameras at the camera saves me allot of time and builds confidence in the customer.  I'm impressed with the build quality other functions.", "Date": "December 4, 2013"}, {"Title": "Great time saver!", "Author": "daveb", "ReviewID": "RKEX5Y2TG7WBK", "Overall": "4.0", "Content": "This works as advertised. However, it needs to be plugged in to the charger to power the camera(s). I have used it many times in the past 3 months and learned to run power to the camera before trying to calibrate the view. For the price, this is a very cost-effective tool!", "Date": "November 29, 2013"}, {"Title": "worth the money", "Author": "I. Colon", "ReviewID": "R2PYO1O1YV23WF", "Overall": "5.0", "Content": "Does Exactly what I needed it to do.  Instead of carrying a bulkier monitor this has multiple functions and light weight.  Have recommended to my coworkers as well.", "Date": "November 26, 2013"}, {"Title": "because it meets my needs", "Author": "Sergio", "ReviewID": "R3DE2PSMM77FMF", "Overall": "5.0", "Content": "very good this product met my needs and is working perfectly it is necessary, return to purchase it again. Grateful.", "Date": "November 16, 2013"}, {"Title": "\"Great for the price\"", "Author": "The Brothers", "ReviewID": "R75YBJBZZKGB7", "Overall": "5.0", "Content": "Excellent meter for this price. All in one network,telephony,and CCTV meter.keep you from running back and forth looking for and using multiple devices.Great construction and quality.", "Date": "October 12, 2013"}, {"Title": "Cctv Multi-function Tester PRO M - Built-in Digital Multimeter - 3.5\" LCD...", "Author": "tsnrunningbare", "ReviewID": "R3MXO540SCEVBB", "Overall": "4.0", "Content": "I really like this CCTV Tester.  It does everything I need it to.  My only complaint is that it is hard to see in the daylight outside. That makes it difficult when working on outdoor security cameras.", "Date": "October 10, 2013"}, {"Title": "Nice", "Author": "Magic \"Sjtkd\"", "ReviewID": "R3W37E873IK7S5", "Overall": "4.0", "Content": "Great price, so far so good. I used it twice now just to adjust camera angles and view. Nice tool", "Date": "September 27, 2013"}, {"Title": "multi tester", "Author": "Gary C. Preston \"Gary\"", "ReviewID": "R16V08QV3MB418", "Overall": "5.0", "Content": "This is an amazing peice of test equipment ;it is the most valuable cctv equipment I ever had,It replace 6 of my old test gear;It functions as described;long lasting battery;clear screen;But the instructions are a little tough to get use to.I give this high marks;", "Date": "September 13, 2013"}, {"Title": "Very handy", "Author": "Toddfrank", "ReviewID": "R1NWKTX9D66DW7", "Overall": "4.0", "Content": "Works very well for what I need. Beats having someone running into the office and look at the monitor every 5 seconds", "Date": "August 17, 2013"}, {"Title": "if you install CCTV, this is a MUST", "Author": "Dr. X \"Dr. X\"", "ReviewID": "R1UL2WGZ8F9M8T", "Overall": "5.0", "Content": "Well was skeptical how good this would work, but let me tell you, I am now buying another for a member of our team, as this was a life saver!  You can finally do installs without having to run back to the DVR to see what you are doing.  Or need a 2nd person to relay where the camera position is.  Works great, battery ran for a 16 hour day / night install.  Obviously you don't keep it on all the time, just when you need to see what you are doing with the camera angles.  Enjoy!", "Date": "August 2, 2013"}, {"Title": "Good functionality for the price", "Author": "PC User", "ReviewID": "R30EGS5ZGUOT9H", "Overall": "4.0", "Content": "The color monitor is good for checking if your CCTV camera is working, in focus and pointed in the right direction. Great for installing CCTV cameras when you work alone or reduce going up and down the ladder. The metal tabs on the RCA cables were weak but for the price you can use your own cables.", "Date": "July 11, 2013"}, {"Title": "Works great", "Author": "Tom \"Tom\"", "ReviewID": "R3GHFZH9OGFL32", "Overall": "5.0", "Content": "Clear picure makes setting up camera real easy only on trip required to aim and focus insteaf of seveal to go back and look at moniter", "Date": "June 7, 2013"}, {"Title": "Works great!!", "Author": "Martin Okulski", "ReviewID": "R29CIUK83VLB6L", "Overall": "5.0", "Content": "It didn't take long to charge - the picture is crisp and clear - light weight and easy to use.  Perfect for what I need.", "Date": "May 28, 2013"}, {"Title": "perfect for installation", "Author": "I M khan", "ReviewID": "R2TMDTX5LCA3FO", "Overall": "5.0", "Content": "Works great. So far no problem.... every thing received as it promised. Good for beginner to any level does camera installation. I approved this.....", "Date": "May 8, 2013"}, {"Title": "works fine", "Author": "Robert E.", "ReviewID": "R2M06E2KFVCHI3", "Overall": "4.0", "Content": "It matched the look as pictured  product works great  as shown  It does need a jumper cable for a direct plug in", "Date": "April 5, 2013"}, {"Title": "cool item", "Author": "Darrell", "ReviewID": "R21DCXKI8WM571", "Overall": "4.0", "Content": "Very very helpful when installing cctv , helps trouble shoot for problems and shows picture angle to limit time later readjusting camera.", "Date": "February 24, 2013"}, {"Title": "This device exceeded my expectations. Thanks!!", "Author": "Adrian Tyndall", "ReviewID": "R3QG5LVVBN3DJT", "Overall": "5.0", "Content": "This is an incredible piece of equipment. It has worked very well and has allowed me to test the cameras I put up as well as make adjustments before connecting them to the system.", "Date": "January 30, 2013"}, {"Title": "Herramienta completa", "Author": "IVAN LASTRA", "ReviewID": "R22IHPSYX6ID5A", "Overall": "4.0", "Content": "Es una excelente herramienta para quienes trabajan en CCTV, buen tamaño de pantalla, fàcil de usar, el maletín y los accesorios facilitan el cuidado del equipo", "Date": "December 27, 2012"}, {"Title": "great meter", "Author": "Jeffrey S. Evans \"jeff_evans63\"", "ReviewID": "R24PB97I71K8EW", "Overall": "5.0", "Content": "This meter works very well and the ability to power the camera from the meter is a bonus.You can install all cameras and have them set up, focused and ready to go even if the master control is not set up yet.", "Date": "December 19, 2012"}, {"Title": "2.5 Inch TFT LCD MONITOR COLOR CCTV CAMERA", "Author": "ivan geerlings", "ReviewID": "R19WHLIQ3WXQ9M", "Overall": "5.0", "Content": "I purchased this item. When i received it i could not use it because i had PAL Cameras.I was given an RMA to return the item. I did not need to return it anymore because i sold the item who was using NTSC cameras.The service was good.", "Date": "November 1, 2012"}, {"Title": "cctv tester", "Author": "Bob", "ReviewID": "R3RPAV9NR39SCL", "Overall": "5.0", "Content": "great product very useful will recomend to anyone installing camera,sable to test cameras before installing them and adjusting osd menu for applicationthat you are installing them.", "Date": "March 20, 2013"}, {"Title": "Excellent", "Author": "Michele D'Amelio", "ReviewID": "R2RUUZIQBZRX2S", "Overall": "5.0", "Content": "excellent product and a smooth delivery .. very satisfied with my purchase! Guaranteed quality product ... fair and accurate for its intended!!!!", "Date": "October 12, 2013"}, {"Title": "Perfect", "Author": "Andres", "ReviewID": "R9LF2FCLTZP7G", "Overall": "5.0", "Content": "This product is very good, all items are useful and complete, thank you very much for this publication is perfect", "Date": "September 22, 2013"}], "ProductInfo": {"Price": "$75.00", "Features": "Display:2.5\"TFT color LCD With 12V output\nSystem Format: NTSC/PAL\nImage resolutin:640*480\nVideo in :Video in *1 (BNC connector )\nPower Source :Built-in rechargeable Lithium battery :3.7V 1500mA", "Name": "RioRand(TM) 2.5 Inch TFT LCD MONITOR COLOR CCTV CAMERA TESTER,12V OUTPUT (RRLC200)", "ImgURL": "http://ecx.images-amazon.com/images/I/411lNKpd2mL._SX300_.jpg", "ProductID": "B005FIX5FE"}}