{"Reviews": [{"Title": "Good value for the price paid, VERY bad wiring information.", "Author": "SAMUEL ON WAH WONG", "ReviewID": "R1G8D8PDA1FL2Q", "Overall": "3.0", "Content": "I give this product a 3-star because I bought this monitor for its low price($35 shipped)and for lack of installation(actually wrong) information. When it arrived, I opened the box and saw the \"installation paper\", it did NOT tell me which colored wire is supposed to go where, it just shows two RCA video inputs can be connected to this monitor, then, one wire goes to the ground, one goes to 12V, and one goes to \"ACC\".So, I took some educated guesses, and connected the black wire to the ground, the blue wire to the ignition wire, and the fused red wire to the battery(always have 12V.)Of course, the back up camera is already connected to this monitor via a RCA yellow plug from the back of the vehicle; I tapped into the reverse light wire for powering the camera itself, and connected the ground wire of the camera to the chassis of the vehicle.With this wiring setup, when I shift to reverse, the monitor shows the back view as intended, BUT, when I shift away from reverse, the monitor will not turn off, just a blue screen. So I thought: this is not right. The monitor should turn itself off when the gear is shifted from Reverse to Drive or Park. It just doesn't make sense to have to manually turned off by the driver. And, when I turned off the monitor manually, it stays OFF, even if I shift to Reverse from Park or Drive. So, something is wrong, obviously.After searching the web for a whole day with no luck solving the problem, I came back to amazon.com, looked through ALL the customer review to no avail, I accidentally and finally found the solution by looking through the Q&A; section at the bottom the page.(I also reconnected the red wire from the monitor to the ignition switch wire, so when I switch off the engine, there will be no power to the monitor, saving the battery in the process.)From a user called MJ, I learned that the blue wire is supposedly connect to the reverse light wire, so I ran the blue wire all the way to the back of the vehicle, and connected to the same wire which I connected the back up camera's power wire into. NOW, the problem's solved.", "Date": "February 21, 2013"}, {"Title": "Amazingly clear, colorful, backup camera system!", "Author": "Florida BigDog", "ReviewID": "R6A74OYXWZTXU", "Overall": "4.0", "Content": "I rated this rearview mirror mount monitor 4 stars, only because there wasn't a 3 1/2 star selection.  First of all, prior to doing any installation work, I thoroughly siliconed, every questionable seam, etc., on the license plate camera, that could possibly allow moisture, to enter into the camera.  After siliconing, I removed the transparent, protective, film covering, off of the camera lens.FIRST, THE CONS: (1) I tried mounting the monitor, to my rearview mirror, but, after doing so, decided that this mirror's reflective properties, were \"too dark,\" and, so, I removed it from my stock mirror, and, mounted it, on my dash, so that I can still use my regular, stock, rearview mirror. (2) To be as nice, as I can be, the installation/wiring instructions for the mirror monitor, are, at best, \"a joke!\" They are extremely lacking, and, did not help me at all.  (3) Mounting the rearview camera on the license plate, and, wiring the harness, to my , left backup light positive (Red), and, negative/ground (Black) wires, was quick, and, easy. The yellow, RCA video jack was easy enough to hookup, to the long harness, that I routed, under my pickup truck, into my truck's cab, where I connected the other end of the yellow video cable, into the monitor's yellow video, incoming connector.  (Remember to tape up the yellow video connectors, under the rear end of the truck, with an ample amount of electrical tape, so that they remain waterproof, and, also, so they do not come apart, due to bouncing around, on bumpy roads, etc.) (4) As of this moment, I still have not figured out a way, to route the yellow video connector, for the camera, into the truck's cab, from underneath the truck, or, through the firewall. - Once I have accomplished this, then I will be finished, with the wiring, of the camera harness, both under the rear of the truck, on, forward, into the truck's cab, to the monitor. (Until I figure out, how to route this video cable, into the truck's cab, I will have the cable entering the truck's cab, through the open door jam, and, closing the door, on it, to keep it secure)  (5) I still have to figure out, how to wire the backup camera's LED lights, so that they function??? (My truck's backup lights, produce more than enough nightime illumination, for the backup camera, to enable me to see any/all, objects, to the rear of my truck, after dark, so, I will forego, trying to get the backup camera LED lights hooked up, for the time being.)NOW, THE PROS: (1) The mirror mount monitor, is \"fantastic!\" During daylight, the monitor, is large, extremely clear, sharp, bright, and, very colorful, and, very easy to adjust, both, with the touch screen monitor buttons, and/or, the remote control device. Even at night, although, not quite as clear, as during daylight hours, the nighttime display, was generally, Black, and, White, ever so slightly \"fuzzy,\" but, still, very discernable, to the eye. (2) Splicing the Red/Black power wires, for the monitor, inside the cab, to a cigarette lighter plug, was quite easy. (Reminder: Use a multitest meter, to ensure that you are connecting the Red/Black monitor wires, to the correct wires, of the cigarette lighter plug, to avoid any shorting of these wires, and, potentially damaging, the monitor. (3) Note: The Green, Amber, and, Red, rectangular areas, depicted on the monitor, are very helpful. In addition, the ability to change the size of the backup display, from a very widescreen view, to a narrower view, literally, and, instantaneously, helped me to better estimate the distance from, and, closeness to, the back of my truck, to viewed objects.In closing, I apologize, for being so lengthy, in my review, but, I do hope, that it is helpful to anyone, who purchases, this rearview mirror-type, monitor, and, the accompanying, Koolertron rearview license plate mount backup camera.  For just a little over $50.00 for the LCD monitor, and, backup camera, (including the standard shipping charges), I am one \"VERY HAPPY CAMPER!\"  Best of luck, to everyone else who purchases these items.....", "Date": "January 7, 2013"}, {"Title": "better than could have expected", "Author": "Bought Crap", "ReviewID": "R2OCAWZPFZSNJO", "Overall": "5.0", "Content": "This is the second time purchasing a back up monitor.This one works great and much better than I would have expected however the installation instructions for the wiring were not included but easy enough to figure out for the most part.one nice feature is that it mounts and unmounts without tools and very little effort.It stays in place and has worked well for more than a month now.", "Date": "November 12, 2011"}, {"Title": "Great screen for a amazing low price", "Author": "Tom", "ReviewID": "R3MWG2OGEX7IXN", "Overall": "5.0", "Content": "I installed this on a 99 Chevy S10. The instal was extremely simple, mounting on the rear view is easy and the plug it has makes it easy to take off if you were going to do that on a regular basis or live in a high crime area and needed to secure it when parking for the night or weekend/etc and stick back on with ease (one plug for power, video, everything into the monitor). I installed it using a \"Cooper Bussmann/ATM fuse tap\" from Autozone (Part number BP-HHH-RP)currently going for about $6. That's for the mini fuse model, there is a model for larger if your vehicle takes those as well. That makes it a easy install and you can put it on something like the radio so it turns on and off when you turn your vehicle on and off if you like. I use mine as a constant with a rear camera with night vision. It takes some getting used to so it's not a distraction but having a digital rear view camera is better than any rear view mirror I have ever owned. Just don't get one with wide angle or fish eye. Those are great for backing up ONLY as objects disappear quite fast when they are still close to you. The only thing I can think of they are referring to with this \"mirror mode\" is using the reflection on the plastic for a mirror... which is kind of silly. Just take the damn thing down and use your regular mirror if your going to do that. It looks like it has some kind of sensor above the buttons (I thought it might have been a camera) but I can't tell and am not going to dissect it to figure it out. Only bad thing, it has that multicolour backup rectangle permanently on your screen. It's a little thing though. Oh, and when you flip the image (it does left right, up and down flipping) it flips the text that way as well, lol.", "Date": "November 19, 2012"}, {"Title": "Good monitor", "Author": "sidm", "ReviewID": "RNOEC293ZDZ2U", "Overall": "4.0", "Content": "Good monitor, bought it with a 9 LED backup camera, also from amazon, seem to work fairly well together. Reflectivity is pretty good with the screen off (mirror mode) and the large size helps as well.", "Date": "February 14, 2012"}, {"Title": "Reviews describe this item well", "Author": "Jake-Minnesota", "ReviewID": "R3040Y1560HWI8", "Overall": "4.0", "Content": "I read many of the reviews and if you read enough and take the best and worse out of the equation, you can get a feel for what the display actually is.My big concern was the \"mirror\" being a mirror or not.  It is not a mirror to me but more of a \"reflection\" that you can see things behind you but  I would not consider it a true mirror.  I kind of knew what I was getting and thought it would be ok and it is just that, ok as far as being a rear view mirror.For a display, I think it is great.  It is large and colors are as accurate as can be expected (when paired with a Pyle PLCM18BC camera).  I have zero complaints in regards to the \"display\".Wiring:  If you read the reviews there are no directions that are of any help.  This is true and I did not really pay any attention to them because of the reviews.  I tried a couple different ways to hook things up I found (for me) the perfect wiring hookup.I hung the display on the existing mirror and fished the wires down to the below dash area on the drivers side.  I then fished 3 wires from the back of the car to the same area under the dash (one red, one blue and then the supplied av cable that came with the camera).Monitor hookup:Red wire (switched power - on with key)Black wire (ground to chassis)Blue wire (hooked up to the blue wire I fished from back of car which was tied to backup light)Camera Hookup:Red wire (connected to red wire I fished to front of car which was connected to the same switched power that the camera was connected to)Black wire (ground to chassis)AV wire (connected to the av wire I fished to front of car that connected to the display unit)I found this to be perfect.  The screen is black until you shift to reverse, the display comes on nearly instantly then off again when you shift out of reverse.  I also found if you want to display the rear camera view while not in reverse, just touch the av button on the display and you can show AV2 all the time which is the rear camera view.  Works just like a factory install when wired like this.", "Date": "August 20, 2013"}, {"Title": "Nice screen", "Author": "fatbird", "ReviewID": "R1OGAMLXEGIKOY", "Overall": "4.0", "Content": "The screen looks very nice and modem, better reflection than the original rear mirror.The installation is simple, just connect and go.If I must put a \"issue\" of this, it could be the power up time, there is a 1.5 seconds delay when you turn on the switch, meaning you need to wait at lease 2 second to backing your car!", "Date": "June 25, 2012"}, {"Title": "Great product!", "Author": "Basso Bill", "ReviewID": "R1IV69Y18KDES6", "Overall": "5.0", "Content": "This mirror system was very easy to install, and works really well with a license plate-mounted rear view camera.  When the camera turns on (powered by the backup lights), the display changes from a smoky mirror to a clear, full-color view of the area behind the car.  The mirror is not permanently mounted; it mounts with firm clips to the existing rear-view mirror, so it could be easliy removed.  Quick delivery when ordered through Amazon.", "Date": "December 13, 2012"}, {"Title": "Great buy for the price", "Author": "Kim", "ReviewID": "R2UHL348EA7BI4", "Overall": "4.0", "Content": "sturdily built.  Clips on to the existing mirror by strong spring clamps and has a little weight to it so occasionally with loud music, you'll see a subtle vibration in the mirror.  the screen and the mirror are the same place so the mirror image is slightly darker than your original stock mirror in day and night ( like a faint tint but brighter than the night mode of your mirror) but this is minor.  It's still clear enough for viewing. The mirror is bigger so your field of view is also larger although the magnification is about the same.  The wiring instruction is deficient.  once you connect the wires, they can be easily tucked and concealed behind the lining of most vehicles across the roof and down the a column on the driver's side of the windscreen.  The power cables need to be connected to a power source under the dashboard (12 v and ground) in your vehicle that preferably is only powered when the ignition is turned to the acc or on position.  Ideally you should have a voltmeter to confirm this although if you're familiar with car electronics, you can find ways around having a 12v gauge.  I installed it by trial and error although I wouldn't recommend it for safety.  The wires don't come with shrink insulation or crimped ends so prepare to have electrical tape/ crimper/ solder iron/ crimps etc available.  I used a solder iron and tape.There is a blue wire that needs to be spliced to the reverse lamp wire (it only serves to sense that the reverse lamp is activated and so automatically power on the monitor if you have a reverse camera connected and automatically power it off after you shift out of reverse ).  This blue wire is short and so you have to find the reverse lamp wire in the front cabin or buy an extension wire to track it to the reverse lamp wire at the back of the vehicle. It does not power the monitor.  Do not power the monitor from the reverse wires unless you only intend to use it during reversing.  If you connect the power from an alternate source as recommended but don't connect the blue wire to the reverse lamp wire you'll have to power on/off the monitor manually while reversing, which is annoying.  If you connect the blue wire as recommended, this is done automatically and it can be overridden by the monitor's power switch when you want to view from another source.I connected the monitor to a reverse camera and the image from the monitor is pretty clear for a low resolution screen and more than good enough for reversing.  It's also bright enough for daytime viewing but better in the night obviously.  NB that the mirror image is still visible when the monitor is on (that's why it's tinted, to allow the monitor image to shine through) so in very bright light, you may not see the monitor image.  there are different aspect ratios, a simple remote and simple menu options.  The camera video input jack is a female but the additional jack to allow the attachment of another video input is a male plug so you may need an adapter with most devices.  It clearly is not a high def. monitor though.NB I installed this in a FORD Ranger pickup.  I had recently used the wireless reverse camera and monitor in another pickup but there was way too much interference during ordinary use causing deterioration of the picture, static lines, loss of the image and it would pick up other random wireless signals from other passing vehicles, security cameras, houses as I drove by.  So I opted for the wired installation and I'm quite happy with the quality and consistency of the image.All in all, a great buy for the price and a DIY job I think. Hope this helped.", "Date": "November 18, 2013"}, {"Title": "Good quality at a great price!!!", "Author": "Milton Bolden", "ReviewID": "R2TUSFXRL68Q77", "Overall": "4.0", "Content": "Shipping speed was excellent. I agree with the general idea that the wiring diagram is terrible and unless you have installed a monitor like this before you will have no idea what goes where other than the video cord. After a brief attempt to install myself, I had it professionally installed with a camera I got off Amazon as well. I am definitely happy with the purchase. LCD came with all necessary install hardware other than helpful instructions. LCD packaging states this screen has Bluetooth and I haven't verified if this is true but I highly doubt it. Screen comes with a remote which, for me, is useless unless you plan on connecting some kind of video device. LCD also appears to have sound option as it produces a tone when the buttons are touched, but this may just be a speakers for the sound of the device and nothing that is connected to it. Again, I just use mine as a rearview camera monitor. I also use it as a rearview mirror as the reflectiveness is good enough for me but it is definitely not comparable to the stock mirror and if someone has bright headlights behind you it loses some of its reflectiveness but if your rear window is tinted it will not effect you that much. Another issue you may have and this may just be an issue with how it is installed in my vehicle but once your vehicle is not in reverse the screen just shows a blue image and if your vehicle is running the power button on the LCD will not turn off monitor. This will make the LCD unusable at night time and you will just be riding around with a LCD attached to your rearview mirror with a bright blue screen. Also, the screen is operable without even having the key in the ignition. My solution to this was to have the installation shop install a power switch in which I can cut the power to the LCD whenever I like, problem solved. All in all, for 35 bucks its a deal if your just wanting to add a monitor for whatever reason and not wanting to spend a bunch of money. I haven't had mine very long, so we will see how it holds up in the various temperatures", "Date": "April 10, 2013"}, {"Title": "Installation trick or Guide to Use on video input as rear view camera and other input to use as DVD from car stereo.", "Author": "REGIL J KOSHY", "ReviewID": "R3I4E6KGP336UG", "Overall": "4.0", "Content": "Hi,1) Product has good picture Quality, little hard to see in bright but thats good because you don't want to mess with that and lower mirror quality as rear view mirror.2) Installation manual is Black & White so you  don't know which wire is which color. Make sure to connect RED and Blue wire together to ACC 12v ( which mean voltage only comes after keys comes on) and black wire to ground or car chasis.3) If you want to screen to come on when put in reverse and turn off when put in any other drive or park mode. Then you should connect Red and blue to the reverse light.4) If you do number 3, you won't be able to use DVD input since only way for you to keep screen on is to keep car in reverse mode for it to stay on. But if you want to connect DVD input with your car stereo and use this as external monitor connect a Red and Blue to active 12 V ACC cable.5) Since I wanted number 3 and number 4, what I did was I connected a SPDT switch (you can get one switch which has three pin on bottom and it should read SPDT swithc, buy this at  radio shack or electronic store). I connected middle pin of switch to Red and Blue cable of monitor, Left pin of SPDT switch, I connected to reverse active reverse light wire of the car and Right pin of SPDT switch to active 12V ACC anywhere in the car (you can use the one from your existing stereo if you don't know which one is that, use the red wire and spit in two one for stereo and one for SPDT right pin switch). Now when I want to watch DVD I toggle SPDT switch to the right and most of the time SPDT switch stays on left and comes on only when I put car on reverse and turns off when switch to drive. And when you put SPDT switch in middle nothing comes on so its like (OFF mode). It took me some time to figure it out but you can do this trick for free thanks to me. Thanks", "Date": "April 11, 2014"}, {"Title": "Great screen for adding a backup camera in an older car, but more wiring instructions needed", "Author": "N. Erath \"nerath\"", "ReviewID": "R12KKAJ96YR5BG", "Overall": "5.0", "Content": "The way this screen clamps on the rear view mirror is great. It solves the problem of where to put a screen in an older car without covering up something useful on the dash. And mounting without having to drill, futz with brackets, etc. makes it a breeze.When the screen is blank it is an adequate mirror, though not like a true mirror. It is somewhat like an automatic dimming mirror when it is dimmed - reflective and quite usable but with a blueish tint.When operating and displaying an image on the screen, it is easily bright enough for daylight use, and the image is sharp and clear. I used the \"Esky EC170-06 World Smallest HD Color CCD Waterproof Vehicle Car Rear View Backup Camera, 170 Degree Viewing Angle Rearview Camera\" and find the combination to be fantastic. I installed this in a 2006 Toyota Sienna. The overhead console with the map lights, electronic compass & door buttons provided power & ground and a great place to stash the bundle of excess wire.As others have noted, the wiring instructions are poor. As you expect, the black wire is ground. Connect the red wire to +12V, and the connect the blue wire to the reverse lights so that it gets +12V at the same time the camera does. The blue wire is the trigger to enable the screen - if you connect the blue wire to a +12V when the camera is not on, you will get the blue screen \"no signal\" message others have mentioned.", "Date": "April 8, 2014"}, {"Title": "great", "Author": "Robert", "ReviewID": "R2HRFO072ODZEV", "Overall": "5.0", "Content": "very good monitor for the grandkids to watch thier cartoon from my dvd player , they have to turn it on everytime in the truck.", "Date": "November 18, 2013"}, {"Title": "Good monitor, perfect for backup camera", "Author": "Foristell", "ReviewID": "R2VRCCNS1SR34M", "Overall": "4.0", "Content": "I paired this with the $14 Koolertron camera figuring that for $45 it was worth it to get a backup camera. Also important is the fact that it has a second video input for another video source, cool. I read the reviews and didn't see anything too obviously wrong with it so I got it.First off, to echo everyone else's sentiments, the install 'manual' (more like 3rd grade flyer) was, mm, thin. No worries, there's only a few cables and they're correctly color coded so it's pretty intuitive. Red for 12v power, black for ground, blue is the trigger wire. Just wire the blue and red together if you want it on constantly. If not, wire the blue to the reverse light wire. I chose to wire it so it is always hot. I put a switch on the dash to use it when I want to, because there will be times when the second input will be used on long trips so my wife can watch what the kids are watching. (Not me, I'll be driving...)I also noted the glare from the sun is pretty pronounced. I guess it's to be expected because, well, it's a mirror. When the monitor is off, the mirror viewing area is about double the area of the stock mirror. The monitor has a pretty decent set of adjustable parameters for the price, like color, tint, contrast, brightness, video flip, plus it has a remote with those functions as well.All in all a good deal, and I recommend it.", "Date": "November 11, 2013"}, {"Title": "Screen works as I needed, second video port dead!", "Author": "James Griffith \"griffithj\"", "ReviewID": "R31L6NWDMMZI9I", "Overall": "3.0", "Content": "This rearview backup monitor is just what I needed for my motorhome no huge monitor sitting on the dash. I have two identical cameras I also purchased at Amazon. Hooked it all up on my bench to test it out before running cable. Video-1, I assume it's (1), worked fine I was quite happy until I found that video-2 does not work. Swapped cameras, second camera worked fine on video-1 also, still no video-2. Tried the remote. Video switching did not work with it, nor did the power on and off button. The monitor buttons all worked except for the V1/v2 button, only the single channel video works. My plan was for two backup cameras, one high, one low. Instructions tell you nothing but how to wire it.P.S.Just found out that video-1 and video-2 are an input and output, not stated anywhere. So I'll leave my three stars because the instructions are so lacking.", "Date": "October 26, 2013"}, {"Title": "Not great", "Author": "Anish Mothakala", "ReviewID": "R3MH9BD19XCL0R", "Overall": "1.0", "Content": "The clips that hold the screen to the rear view mirror broke in a weak.The screen flickers very frequently.Do not recommend this.", "Date": "September 30, 2013"}, {"Title": "Does not work after one week of use", "Author": "vicki sengele", "ReviewID": "REDEXT0KT1MZP", "Overall": "1.0", "Content": "Monitor quit working after one week. Worked fine initially but now will not power on. Checked fuse and all connections and found no issues with them. It also does not work well as a rear view mirror.", "Date": "September 6, 2013"}, {"Title": "Not a Great Monitor", "Author": "Francis Berard", "ReviewID": "R321LQY8CIN8VM", "Overall": "2.0", "Content": "To install this on my 06 Dodge Ram 1500 rearview mirror I had to stretch the clips on the back out to the maximum it would go. After running the RCA cable all the way to the back of my truck, I found that the ACC wire from this unit should be connected to reverse light switch not the ACC circuit in your car. Save yourself some time and run both a reverse light and the RCA wire to the back of the vehicle at the same time. I connected the Power wire to the circuit for my seat heaters, but you can use any circuit that is on only when the car is running.When used as a reverse camera the image is okay but not very bright. The monitor is large and out of the way. There is a lot of glare on the screen and I usually have to take my sunglasses off to see the image. When used as a rearview mirror the mirrored image is very dark, it's like tinting your rearview mirror.Usually the monitor only turns on when I put the car in reverse and turns off when I put the car in drive, which is great.  But, sometimes the monitor will come on when I start the car and shows a bright blue screen. So I have reach up and turn the monitor off before I continue driving and that's a little annoying.And finally, since I had to stretch the clips on the back out to the maximum it would go, it only lasted a couple of months until the springs broke. Now the monitor is dangling in front of my original rearview mirror.", "Date": "June 12, 2013"}, {"Title": "What are the speakers for?", "Author": "VL", "ReviewID": "R2JP5Z6ZZLSVDS", "Overall": "4.0", "Content": "Does anyone know what the speakers for? The product description even states the monitor has Volume Up and Down control. I only hear it Beep when it is powered up. Does anyone have a detail installation guide for this product? The included instruction is a Joke.ThanksUpdate:I opened the case and found that there is no speaker, only 1 little buzzer. This buzzer has become malfunction and constantly beeping each time the car in reverse.I disabled this buzzer by removing the little metal plate. Problem solved!", "Date": "April 14, 2013"}, {"Title": "Love it!", "Author": "Bill", "ReviewID": "R1O3ZFJW3YKE0I", "Overall": "5.0", "Content": "Works as described , It does have a high glareDuring day operations and is very hard to see.But I contribute that to location more than the screen. Maybe also the horrible camera from another vendor. So I say buy! Buy! Buy! I use it as a rear view mirror and not just a backing camera", "Date": "April 5, 2013"}, {"Title": "Mirror way too dark", "Author": "Krys Squires", "ReviewID": "R3UGAN63262FK4", "Overall": "3.0", "Content": "The product seems fine, but the mirror is so dark that it's barely usable. Take a plain piece of glass and put something black behind it. Now look at your reflection in the glass. That's what this mirror is like. Sending it back.", "Date": "March 23, 2013"}, {"Title": "worked until", "Author": "ew", "ReviewID": "R32C9OEY9KXFEY", "Overall": "3.0", "Content": "hook up was easy,ran wire from camera to monitor.on 11/26/12 it fell off my rearview mirror,the mounting clips broke,dissappointing,only had it 4 months", "Date": "November 26, 2012"}, {"Title": "best for the money", "Author": "gerdav", "ReviewID": "R3036H2QS24SVL", "Overall": "4.0", "Content": "for the money this is the best product of it's kind nowhere can you find a rear view mirror and tft color monitor that fits on your exsiting mirror. this is a must have for safty as well as entertainment reasons.", "Date": "October 16, 2012"}, {"Title": "Really Nice...", "Author": "Dan", "ReviewID": "R10P411RZ6D7FO", "Overall": "4.0", "Content": "I really like this mirror/monitor!  Yea, it's not as clear as the stock mirror, but it is fine and besides, my stock mirror was not doubling as a monitor!  The monitor area is nice and big, clear picture and nice color.  The adjustments allow it to be tweaked for the picture quality of your liking.Of course, no need to reiterate the lack of useable instructions.  If you don't feel comfortable wiring it, ask your local car audio place, or a electronics savvy friend. I just used some common sense and the trial and error method!", "Date": "May 23, 2014"}, {"Title": "Working great so far", "Author": "Dustin L.", "ReviewID": "R2QKU95S8GV39M", "Overall": "5.0", "Content": "I was a little wary of this screen because other reviewers claimed it did not work as a mirror.  I forget this is a monitor during the daytime due to the mirror effect.  I have no problem viewing it as a mirror or as a screen.  Turn the brightness all the way up in the settings.  Very bright.  Very clear picture.  My friends are jealous.", "Date": "April 23, 2014"}, {"Title": "Great picture", "Author": "Thomas", "ReviewID": "R22CZZZZXDDC8T", "Overall": "4.0", "Content": "The picture is really nice and clear. Not to hard to install just wish the cabel it comes with was bigger.  When thw camera is off it has a nice refletive mirror, not as good as the regular mirror but very good for this type of rear view monitor.  It is big but makes up for it with the picture quality.", "Date": "April 10, 2014"}, {"Title": "Rearview Mirror Monitor", "Author": "Dale", "ReviewID": "R2AMFZE6849KF7", "Overall": "4.0", "Content": "I have a 1947 Plymouth with a small rear window with limited rear vision and a blind spot on the drivers side.  I added 2 camera's to solve the problem.  The monitor has 2 video inputs and comes with a small remote but it's easier to just press the monitor screen to change from rear to right view camera's.  Both Camera's are on all the time and so far no problems.The monitor manual (if you can call it that) that identifies the blue wire for auxiliary but doesn't explain how to use it.  After some doing some bench testing I found the blue wire can be used to turn the monitor screen on and off or it can be connected with the Red positive so the monitor will come on and off when ever the Monitor power is on or off.  I guess most users will only have the camera and monitor on when in reverse so both the blue and red wire would be wired to the backup lights.  I also turn the rear back up grid on only when in reverse but that is a long story.", "Date": "February 27, 2014"}, {"Title": "was listed as a back up camera", "Author": "Rashid Zamayar", "ReviewID": "R3JYS0WCTZ97TZ", "Overall": "3.0", "Content": "would have been nice if the ad said there was no camera included. the ad makes it looks like its included", "Date": "December 26, 2013"}, {"Title": "I loved this product, it worked perfectly for me once I spend a little time understanding how I should wire it.", "Author": "Ronni Silva", "ReviewID": "R226DS5F7IAEKX", "Overall": "5.0", "Content": "1)I bought two units2)Manual is poorly writen\\designed3)I tested both devices first before spending time and money on Installations.4)During instalation all cables and connections were firmily secured and double taped to avoid poor connectivity or signal interferences.5)Device works perfectly when I reverse gears6)Mirrow is useless at night so I adapted it to my visor by removing the built-in gator clips (by removing 6 screws, velcro the back of the unit and I was done) and I have the option to drop the visor when needed.7)It was well worth the $30", "Date": "September 3, 2013"}, {"Title": "Works And Has A Big Screen", "Author": "Casch \"Chris\"", "ReviewID": "R2N41NLU3YTOY0", "Overall": "4.0", "Content": "I would have rated it 4.5 stars if I could because it isn't perfect but a great solution to my problem. But it installed relatively easily and works nicely. I paired it with a 170 degree camera and am very happy. Throw away the remote. Its worthless.I did install it differently as I have a Honda Insight. The visibility is so poor with the hybrid that I don't know how they can justify selling it without a rear view camera (notice I didn't say backup). The Prius I rented last week on a business trip is just as bad. Well I wanted it always on so that I could use the camera to change lanes and such not just for backing up. Wired the monitor to a keyed circuit (radio) as well as the camera. When the key is on so is the camera. Love it. If there is sun directly behind me and the camera is washed out I just turn the power off. Otherwise it is on.Just run keyed power to BOTH the camera and the monitor. Don't use the blue wire.  Terminate it so it doesn't short out and forget about it.PROS: Works with good resolution. Can use up to two cameras. Screen menus are intuitive (good thing cause there is no documentation for features.CONS: Could be brighter. The user manual is a joke. Just 1/2 of one page with pinout. That is it.These are annoying and not deal breakers. Simple to figure out if you've ever installed a radio you can do this.", "Date": "August 4, 2013"}, {"Title": "7 Inch TFT/LCD Monitor", "Author": "S. Dancer", "ReviewID": "RF4PBZOIIA4NK", "Overall": "4.0", "Content": "Works as advertised.  Grabs on to the rearview mirror and doesn't let go!  When it is off it is just like your normal rearview mirror only much larger, when it comes on with the back up lights, it is a great asset and safety feature that is placed exactly where you need it.You may have to tighten your rearview mirror a bit when you mount this on, because of the added weight.  No big deal just an Allen wrench to snug it up.Highly recommend for large vehicles, motorhomes, vans, etc.I gave it four stars only because the remote did not work out of the box.  I would not use it anyway, but if you pay for it, it should work...", "Date": "August 1, 2013"}, {"Title": "Big mirror", "Author": "cannoneer", "ReviewID": "R3TR88YKO3X9SB", "Overall": "5.0", "Content": "This thing is big. And heavy. Very good image processing and as clear a picture as any of my other monitors. As with others that have a reflective surface there is some glare that can interfere with the image on the screen. I leave it on continuously so it IS the rear view mirror.Touch screen is very sensitive so there is no need to \"punch\" the screen to change values. And, after all, it does have a remote control.7 Inch 16:9 TFT LCD Widescreen Car Rearview Monitor Mirror with Touch Button, 480(W)x 234(H) Screen Resolution, Car /Automobile Rear View Mirror Display Monitor Support Two Ways Of Video Output, V1/V2 Selecting I recommend this highly. A very good product from a terrfic vendor.", "Date": "July 21, 2013"}, {"Title": "bulky for small cars", "Author": "Amazon Customer", "ReviewID": "R1FI5J8HK8B129", "Overall": "3.0", "Content": "The mirror could be more reflective in mirror mode. The screen is good for a rear camera as well for video playing but is kind of bulky and heavy for mirrors bounded to the windshield.", "Date": "May 30, 2013"}, {"Title": "price is right", "Author": "jc", "ReviewID": "R3PL95LKTLN0S3", "Overall": "4.0", "Content": "It bigger than I expected but thats fine with me . I have large vehical the picture is great would recommend for a low cost screen", "Date": "April 14, 2013"}, {"Title": "Great for RV backup camera screen", "Author": "Allison Cummins", "ReviewID": "R2QLJS6KV58ZEU", "Overall": "4.0", "Content": "I don't think it works well clipped to the rear view mirror.  I just mounted it on the dashboard.  It turns on quickly and shows the camera output when I turn on the power.  I like it better than the radio mounted video screen because I don't have to wait for it to open up.", "Date": "February 18, 2013"}, {"Title": "not a great mirror", "Author": "Marlene G", "ReviewID": "R185ED6PQYESOW", "Overall": "2.0", "Content": "This is a terrible replacement for my truck. I was installing a rearview camera and I was going to use this as the monitor for it. The monitor works great displaying the camera image but when you have the monitor off it is terrible. It is basically the equivalent of using your phone screen as a rearview camera. You can barely see anything out of it and at night it is 100% useless.", "Date": "September 6, 2013"}, {"Title": "Too Dark!", "Author": "LRL, Jr \"Photog\"", "ReviewID": "RML2FCFN8A9N6", "Overall": "1.0", "Content": "Poor resolution and too dark for use during the day.  In normal daylight it was only useful as a mirror.", "Date": "November 4, 2013"}, {"Title": "WORTH LESS", "Author": "KYAVA01*", "ReviewID": "R2GNOMHZ7AHZ4Z", "Overall": "1.0", "Content": "The instructions are a joke.The unit is to dark when the screen is not on.I am going to return it,maybe go with another product.", "Date": "June 21, 2013"}, {"Title": "There are better alternatives out there..", "Author": "CL94538", "ReviewID": "R1KFWPFQZYQ14G", "Overall": "2.0", "Content": "Works well as a monitor but not as a rear view mirror. The blueish  LCD screen is annoying and too dark as a mirror.", "Date": "June 9, 2013"}, {"Title": "Easy to install", "Author": "Joe Crump", "ReviewID": "R18QAQ29VP8ON7", "Overall": "3.0", "Content": "Easy to install, good picture, probably not the best unit for a car where you want to keep full use of the rear view mirror. We are using it in large service trucks where the rear view mirror view has been restricted.", "Date": "May 18, 2014"}, {"Title": "big", "Author": "NJ tradesman", "ReviewID": "R3F5NDBYQYJKTI", "Overall": "4.0", "Content": "Installed in a colorado pickup truck for easy parking.  If sunshine glare is strong, it can wash out the screen, making it hard to view.  Does not happen often, sun would have to be at sunrise or dusk level and behind you to shine so hard on screen.  Have used it for almost a year now, and no problems or issues.  Weight does not seem to move oem mirror at all, which was a possible fear I had when buying.", "Date": "May 18, 2014"}, {"Title": "Didn't work.", "Author": "Moe Kobeissi", "ReviewID": "RVX3SWRYWT0SZ", "Overall": "1.0", "Content": "First it used to turn off whenever the car was in reverse and then it stopped completely. I am very tech savvy and I work great with wiring but this item is just crappy.", "Date": "May 17, 2014"}, {"Title": "TOO SMALL FOR MY MIRROR", "Author": "luckyy1", "ReviewID": "R3L9LEHXWWT4VC", "Overall": "2.0", "Content": "It is too short by 1.5 inches which mean either I keep it with it looking really stupid or replace my original mirror!", "Date": "May 16, 2014"}, {"Title": "7 Inch 16:9 Rearview Monitor w/ backup camera", "Author": "Wayne Myers", "ReviewID": "RA5JBKV7ZEJKA", "Overall": "5.0", "Content": "The unit works great once it is installed, However, Installation is something else since they do not have any instructions with the unit for installation and you will need to be Tech savey", "Date": "May 12, 2014"}, {"Title": "bien!", "Author": "Marco", "ReviewID": "R2ACQPCNRETLL6", "Overall": "5.0", "Content": "It is an excellent product, it has very good resolution, vivid colors, clear image and easy installation, I recommend that you stock the reader that comes with Usb and Sd Card.", "Date": "May 9, 2014"}, {"Title": "Excellent", "Author": "Mr . Fathi", "ReviewID": "RMPZPDEDMQAYT", "Overall": "5.0", "Content": "it is vary good to be used for reverse cam on the car clear pic and advice others to buy it .", "Date": "April 30, 2014"}, {"Title": "Nice", "Author": "Felix", "ReviewID": "R2L6VB509CP9LK", "Overall": "4.0", "Content": "I bought this rearview monitor to replace another one that I purchased from Pyle that were a rebuild monitor did not lasted a month. This Monitor  is day and night compare to the rebuild one I purchased, just to be fair this one was purchased new and I have not complain very happy, I do not recommend  rebuilded monitors", "Date": "April 24, 2014"}, {"Title": "the next time ill go to the store so i can get some warranty", "Author": "marvin frazier", "ReviewID": "R2TZ671C9GY6GZ", "Overall": "1.0", "Content": "I didnt have That rear veiw mirror a month yet and it already stop working ,Im sorry i waisted my money on it!", "Date": "April 11, 2014"}, {"Title": "Would not Recommend", "Author": "Randy D.", "ReviewID": "R2J6IFW0LEBEC1", "Overall": "1.0", "Content": "Never Could get the Item to work and then just try to make contact with the companyfor support. Never could, best of luck to you if you are going to buy this you will not geta TECK for help. I just thru it away and had a pro put one in.", "Date": "April 9, 2014"}, {"Title": "everone need to really get them one", "Author": "ton", "ReviewID": "R2S9GEANMRG8QO", "Overall": "5.0", "Content": "The video shows crystal clear and the back up camera is alsome everyone I know wants one and likes it", "Date": "April 2, 2014"}, {"Title": "Screen works great.", "Author": "james", "ReviewID": "R11DKSSK5ERK6W", "Overall": "5.0", "Content": "The screen works great and looks good in the car. The downside with the screen is the low resolution and the reflectiveness of the mirror when the screen is off. The low resolution is to be expected considering the RCA interface and cheap price. The resolution is good enough for my Android computer and great for the backup camera. The amount the mirror reflects is about the same as if you flipped the switch on the bottom of the old rear view mirrors to dim the head lights of cars behind you at night. I would recommend the this to anybody.", "Date": "March 26, 2014"}, {"Title": "love love love it!!!", "Author": "club", "ReviewID": "R2LP4UN5XZYOCL", "Overall": "5.0", "Content": null, "Date": "March 25, 2014"}, {"Title": "Could have better image quality", "Author": "Michael Willey \"Photog101\"", "ReviewID": "R252X72IWRSS5W", "Overall": "2.0", "Content": "I have been fighting to get this hooked up without interference from the electrical system in my \"02 Chevrolet Dually.  I have tried shielding the cables and even put in a filter to the power line.  Still, I have distortion that does not make it unusable, but it is not what I expected.  Also, the remote does not work.  But since I have stuck so much time into the installation, I'll keep it just for safety while I have my Truck Camper on board.", "Date": "December 30, 2013"}, {"Title": "Good Monitor, Bad Mirror Gripper - Automatic on/off Connection", "Author": "W. Chin", "ReviewID": "R190B33LMH0ORS", "Overall": "4.0", "Content": "The monitor produces a nice clear picture. The mirror gripper worked for a few days and then became loose. I opened it up and found the problem. The two strong springs are connected at the bottom of the monitor to metal but the top part of the spring is connected to plastic hooks that are molded into the back casing. The plastic hooks ripped off. It was easy to fix by attaching each spring to a small screw, washer and nut through the hole that was left by the torn off hooks. This little mod gave the mirror gripper much added strength. It should have come this way.Monitor Connections for Automatic on/off functionBlack wire = GroundRed wire = 12 volt Power (use power that turns on with accessory to save your car battery)Blue wire = Detect 12 volt Power through connection to backup camera power or reverse light (used to automatically turn on the monitor when power is detected)V2 RCA cable = Automatic Video-In (use Video 2 cable not Video 1 cable)V1 RCA cable = Did not use. It can be used if you want to manually switch the monitor on and off.", "Date": "December 29, 2013"}, {"Title": "Pretty good display", "Author": "M. VOEKS \"Just a regular person\"", "ReviewID": "R1GJBBUOQAFYU5", "Overall": "4.0", "Content": "It's kinda big to have mounted on your stock mirror, but it works well and functions as a normal rearview mirror when switched off.  All in all a good buy.", "Date": "December 11, 2013"}, {"Title": "Good choice if you're looking for a back up camera", "Author": "Steamer", "ReviewID": "R3M0LCTKMKSUY4", "Overall": "5.0", "Content": "This was an easy application in my 30 foot motorhome except for the audio cable which was way too short and is able to purchase another one off of Amazon.com and 25 foot which give me an extension that I needed to make this mirror works correctly and properly it's clear it's got a good view and it's right over the top of existing mirror and works great thank you bye", "Date": "December 6, 2013"}, {"Title": "Nice screen with dual inputs.", "Author": "Amazon Customer \"hobbyist\"", "ReviewID": "R2CP0JCYHIXGX8", "Overall": "5.0", "Content": "Installs by clipping over the mirror.  Not \"great\" as a mirror replacement...especially at night with tinted windows, but during the day it works just fine.  Easy to install in my '96 Nissan Pathfinder.I used the 2nd input to install a front bumper camera.  :)", "Date": "December 2, 2013"}, {"Title": "Great value.", "Author": "Alex Hechevarria", "ReviewID": "R2I1O821RTVPAG", "Overall": "4.0", "Content": "Nice large, clear picture when backing up. When using the unit as a mirror in the daytime, the slight blue tint is not a big deal. At night though, the tint makes it a little difficult to see things behind you. All in all, a great value.", "Date": "November 25, 2013"}, {"Title": "Works well, comes on automatically", "Author": "Frank J Liptak", "ReviewID": "R2DPN4GWBVZZR5", "Overall": "5.0", "Content": "Works well, comes on automatically if connected to the backup lights circuit. The only issue I have is that sometimes the glare from the back window washes out the view of the screen but I am sure that depends on the vehicle it is installed in.", "Date": "November 14, 2013"}, {"Title": "Live screen", "Author": "Paulo Sarmento", "ReviewID": "R1CG4GV64AA5SC", "Overall": "5.0", "Content": "I have now a bigger rear viewer plus an option to have something running on the windshield, I love it, I mean it, I recommend it, specially if you have a truck.", "Date": "November 13, 2013"}, {"Title": "Can't beat it for the price", "Author": "Robert Mackenzie", "ReviewID": "RBS0TZSRSJCM3", "Overall": "4.0", "Content": "You can't beat this rear monitor for the price. It's a little bit heavy for your rearview mirror. They should have other mounting options.", "Date": "November 2, 2013"}, {"Title": "Works Nice as a monitor, as a mirror it could be better", "Author": "Lucas McDonald", "ReviewID": "R1JGRAX478RZZA", "Overall": "4.0", "Content": "This was my second monitor purchase as my first (bargain) choice was just that. This unit has nice touch sensitive buttons on the face so that you can control  its functions easily. The wiring diagram leaves much to be desired but it is a simple red black power setup, with a blue activator wire that you need to hunt down a reverse light wire for(YouTube did that for me). The monitor beeps when you power it on(switched 12 volt in my case so when i turn the key) and then based on if you had it on when you powered it off last powers up or stays in Mirror mode. when you throw the car in reverse, it kicks in quickly(under 2 seconds).Be aware THIS IS A BIG UNIT. I didn't realize the amount of windshield visibility I'd be giving up. It took me a day to get used to and start looking ahead for what I'd be missing.", "Date": "October 31, 2013"}, {"Title": "It does the job", "Author": "Sunfixer", "ReviewID": "RQFHJSOYAZ22Y", "Overall": "3.0", "Content": "I bought this to replace a non-working older unit. I liked the idea of a rear view mirror mounted display as I did not want another screen cluttering up the dash or windshield.Pros:Nice sized displaySecurely attaches to rear view mirrorCons:Hard to see in bright sunlightWhen using as a mirror, everything is tinted blueI did not need it, but only one of the two video inputs is operationalIncluded directions are practically worthless. Look at other comments here for wiring help", "Date": "October 28, 2013"}, {"Title": "Rearview Monitor", "Author": "Greg Beaty", "ReviewID": "R2X3NCSO365SHL", "Overall": "3.0", "Content": "I bought this to help me hook up my boat trailer. I was very impressed with the quality of the picture. After about 4 months one of the tension clip springs broke and I had to use a rubber band to make repairs. For the price it works very well and I'm glad I bought it and have recommended it to several of my friends. I warn them first of the faulty spring, but it was really cheap and things happen. Overall I'm happy with the purchase.", "Date": "October 8, 2013"}, {"Title": "Screen is clean and simple to use!!!", "Author": "Erick Dupaya", "ReviewID": "R20CW9HVEE2SDQ", "Overall": "5.0", "Content": "This is my second car rearview monitor mirror! The first one was used for my car reverse monitor rearview camera and now the second one will be used for my FPV screen monitor for my dji phantom. it is the best monitor and not to expensive one! i really recommended this one for simple watching! thanks", "Date": "October 8, 2013"}, {"Title": "looks very good", "Author": "Joe Aldrich", "ReviewID": "R3BWJHUTZT8HWE", "Overall": "4.0", "Content": "The picture looks very good and no problem using it as a rear view mirror.. during the day and night", "Date": "September 2, 2013"}, {"Title": "Bad picture", "Author": "Jonathan Lawson \"JONNNNNN\"", "ReviewID": "R1NAAN46714JEN", "Overall": "2.0", "Content": "The greens are brown, the reds are pink and it flickers non stop. Not a very good monitor, but i guess what do i expect for 35$.", "Date": "August 17, 2013"}, {"Title": "Bad instructions but works good...read reviews", "Author": "Douglas Morrill", "ReviewID": "R398MIM2E4IA2Q", "Overall": "5.0", "Content": "I used the wiring instructions from the reviews to wire my back up camera and it works fine, have to fine tune it but it is nice to have.", "Date": "August 15, 2013"}, {"Title": "It works fine at night", "Author": "tv arbanas", "ReviewID": "R1XH03S8MRPNNN", "Overall": "3.0", "Content": "I knew from reviews at Amazon that this is a problem. I do feel safer having it. It is OK.", "Date": "August 11, 2013"}, {"Title": "Unclear display and color", "Author": "HarryB", "ReviewID": "R2OH3DQHWK2KPA", "Overall": "2.0", "Content": "Low resolution  crude image with a bit of fisheye effect.  Poor color.  Menu difficult to use. Positive: easy to install.", "Date": "August 5, 2013"}, {"Title": "Excellent presentation and quality in its 7-inch screen", "Author": "Dr. MaN", "ReviewID": "R2LE0M77C0FX5W", "Overall": "5.0", "Content": "Excellent presentation and quality in its 7-inch screen ... It gives us a new view inside the car, with a touch of elegance and very full of technology provides us with very innovative features, let your friends with the mouth open to give him notice that aspect into your car", "Date": "July 30, 2013"}, {"Title": "widescreen", "Author": "sgaron1955", "ReviewID": "RIJG3BGFADQD3", "Overall": "5.0", "Content": "I bought it to replaced the one I dropped and shattered. nice wide screen for backing up. Really could be used with a dvd player.", "Date": "July 29, 2013"}, {"Title": "LEARN BY DOING, NOT MUCH INSTRUCTIONS", "Author": "Marshall \"in Texas\"", "ReviewID": "R3N6APGLCW10RK", "Overall": "4.0", "Content": "The best instructions are the reviews here by those who figured it out.  I'm coupling this with a \"Night Vision Parking Car Rear View Wide Angle LED Reversing CMOS Camera, item No. 44\", it seemed like the mirror and camera view were competing to the detriment of the camera view.  Then I found by tilting the mirror way down, it has nothing to show and the camera view comes thru beautifully.Still need help.  How do we invoke the brightness, select which input cable to use, etc. controls claimed, where is the \"Touch Button\"?  The touch-screen looking buttons on the right and the remote control seem to do nothing.", "Date": "July 14, 2013"}, {"Title": "Too heavy to hang from the rearview mirror", "Author": "William Winter", "ReviewID": "R1R3XHKPGHZ9OA", "Overall": "4.0", "Content": "I attached this to my rearview mirror per the instructions. After driving with it for a week it pulled my rearview mirror and Its bracket right off of the windshield!! I got the surprise of my life as the whole thing came crashing down while I was driving. I took my vehicle to a tint/accessories shop and they made a bracket for it and installed it from my ceiling console. It's been OK for a year now. I had them wire it such that it is on whenever the ignition is on and I use it as a substitute for the mirror. I wish the manufacturer of this unit had thought the weight issue through and designed a bracket which would REPLACE the rearview mirror/bracket. In all actuality the unit works very well regardless of the temperature inside the vehicle. The remote is useless. It just sits in my console.", "Date": "July 7, 2013"}, {"Title": "Good monitor, so so mirror", "Author": "John of Jax", "ReviewID": "R3RIQXFGVE5KY3", "Overall": "3.0", "Content": "This monitor was easy to install and works ok as a monitor. The instructions are very basic. Thanks to the reviews here, I learned the correct way to connect the blue wire to use with a backup camera. The video is dimmer than I would like, even when the brightness is adjusted to 100%.  During bright sunlight it difficult to see the video.The mirror is like a regular mirror flipped to the nighttime or anti-glare side. There is no way to adjust the mirror that I can find.This monitor/mirror requires some getting use to. When the sunlight is bright, you have to learn to focus your eyes past the mirror to see the video. Overall, for the price and the fact it works, this monitor/mirror is just okay.", "Date": "July 1, 2013"}, {"Title": "Just what I wanted", "Author": "Brian Lee", "ReviewID": "RF8IIMRC1OHLR", "Overall": "4.0", "Content": "item works great except  when using it on a sunny day , can barley see what on the screen because of the sun glare, while backing up.", "Date": "June 14, 2013"}, {"Title": "AV TV", "Author": "QUELI PEREZ", "ReviewID": "R9W5WBJUVK8AN", "Overall": "5.0", "Content": "IT WORK VERY GOOD AND HAS VERY GOOD VISION I TRULY RECOMEND IT FOR SAFETY IT IS A VERY GOOD ELECTRONIC.....THANKS", "Date": "June 11, 2013"}, {"Title": "Hitch", "Author": "Carlos Figarella", "ReviewID": "R3S8B9J1SHOO7V", "Overall": "4.0", "Content": "Now I can hook my boat to the hitch just looking at the mirror. Easy use of technology for helping driver.", "Date": "June 5, 2013"}, {"Title": "It does what it says", "Author": "Joe \"joeelee_2000@yahoo.com\"", "ReviewID": "R2JMJW2C0DKB14", "Overall": "3.0", "Content": "In very bright day light it is hard to see the video as the mirror works very well as a mirror. probably would work better with tinted windows. But I still like it.", "Date": "June 3, 2013"}, {"Title": "7 inch tft mirror", "Author": "haf", "ReviewID": "R39X7AV6VE4DSM", "Overall": "2.0", "Content": "Bad reflecting mirror quality. I added mirror screen protector to enhance mirror. LCD screen OK, not true color. Needed longer wires for connection. Bad instructions.", "Date": "May 28, 2013"}, {"Title": "Nice to see camera without sticking something on the dash ...", "Author": "Ken Ostrye", "ReviewID": "R3TXK5GOJ78ATH", "Overall": "5.0", "Content": "Nice to see camera without sticking something on the dash ... I really hated to rig something up on the dash that would eventually leave sticky marks ... this worked out just right for us ...", "Date": "May 22, 2013"}, {"Title": "Nice to see what is behind me", "Author": "William W.", "ReviewID": "R2FGLZP657N0FZ", "Overall": "5.0", "Content": "very good display for the price. Using it on my old motorhome. Very useful when backing up the boat trailer.", "Date": "May 18, 2013"}, {"Title": "7\" Backup Camera Monitor", "Author": "Daniel Depatie", "ReviewID": "R14QGJ6DBEFD4U", "Overall": "5.0", "Content": "The monitor is very good, the only complaint that I may have is that even in daylight the rear view is a bit darker than I expected,  but otherwise very happy with the performance and the price!", "Date": "May 14, 2013"}, {"Title": "Monitor mirror", "Author": "Daryl Jordan", "ReviewID": "R244DH7ALNRTTN", "Overall": "5.0", "Content": "its works great and it was the right price for the mirror and the instaltion was easy.Thank you Daryl", "Date": "May 13, 2013"}, {"Title": "rear view camera monitor", "Author": "Ralph R. Carlin Sr.", "ReviewID": "RBFHY2Q2XHK9Q", "Overall": "5.0", "Content": "i love it, when not in use as a monitor, it makes a great rear view mirror it also has a connection for a second camera or viedo sorce", "Date": "May 12, 2013"}, {"Title": "Good product .weak build", "Author": "#BB #DD", "ReviewID": "R1E861AKMK70XL", "Overall": "3.0", "Content": "Like the product wen i recirved it.But now the brackets tht hold the screen to my mirror has broke so its not a firm hold on my mirror..", "Date": "May 9, 2013"}, {"Title": "Dope ass tv", "Author": "Rudy", "ReviewID": "R1FQPSAU5TPRPL", "Overall": "5.0", "Content": "Easy install, its the same as an amp just that theres the video wire. To get picture to the monitor from an indash tv i plugged into the female conector. The only thing is that it has a beep noise to it as soon as you turn your car on. I bought 4 of these. 3 as gifts and 1 for me and they all do it. Other than that its a perfect come up for an additional monitor.", "Date": "May 6, 2013"}, {"Title": "It's in my F150 and it'll stay there", "Author": "BF \"0bfk0\"", "ReviewID": "R37KQYEEZQS190", "Overall": "3.0", "Content": "Very good mirror substitute.  I use it with a wide angle camera to give me side to side view behind and to the side of me.  I wish the lines could be altered and/or eliminated.  As it is, the second (green) line aligns with the bed of my truck.  I wish I could customize the others.", "Date": "May 1, 2013"}, {"Title": "Works well", "Author": "charles ewing", "ReviewID": "R2NGLVLVYTOGH1", "Overall": "4.0", "Content": "As advertised. It does have a problem with overcoming ambient light (i.e. seeing what's in the picture in daytime due to too much light). Overall it works well.", "Date": "April 30, 2013"}, {"Title": "great product", "Author": "george scott", "ReviewID": "R2DZXBLL39INDH", "Overall": "5.0", "Content": "looks expensive, well worth the money. works perfect and looks good. i us it as a extra tvin the car. i have 5 tv all 800 or better mega pix, and this one keeps up with them. product stands byits name. high grad for low price. thanks again", "Date": "March 28, 2013"}, {"Title": "works great....", "Author": "Adrian", "ReviewID": "R1WRWBOAR8AU83", "Overall": "5.0", "Content": "When I got it, it was what I was expecting clips right onto my existing mirror and easy to hook up....", "Date": "March 20, 2013"}, {"Title": "Good product , nice screen", "Author": "Carina Callejon \"CC\"", "ReviewID": "R1I2R9D82HN7R6", "Overall": "4.0", "Content": "The monitor works great , nice color and size, the mirror effect does create a lot of glare much more than I expected when the backup camera turns on, going to try anti glare film but that will reduce the rear view mirror effect", "Date": "March 18, 2013"}, {"Title": "Backup Camera system", "Author": "JJay", "ReviewID": "R1ZPZB9MRSAOXQ", "Overall": "4.0", "Content": "The monitor system displayed images with good clarity and resolution. The antglare at night is great. I would like an addition to this unit, and that is, an auto shutdown feature to switch off the monitor display 10s after the camera display is disengaged to allow use of the rearview mirrow.", "Date": "March 4, 2013"}, {"Title": "Works fine", "Author": "Harv \"Bryan\"", "ReviewID": "R19HKWQEGM9OH2", "Overall": "4.0", "Content": "Hooked this up to the tv and it is an acceptable picture so i would say their OK for most backup solutions and yes ive used it with backup camera picture is fine", "Date": "February 21, 2013"}, {"Title": "monitor", "Author": "gerardo", "ReviewID": "R389T451HGS9ZQ", "Overall": "5.0", "Content": "The price I paid for it was everything I expected and more.I will recomend anyone to purchase it if they are looking for something like that, for work or any type of car.", "Date": "February 19, 2013"}, {"Title": "good signal", "Author": "tomas enrique carroll olivera", "ReviewID": "R3R4H3FKXA0LF1", "Overall": "5.0", "Content": "very good image, but can not not notice me close, I think it must be me or even know .", "Date": "February 16, 2013"}, {"Title": "Good as a monitor, but bad as a mirror", "Author": "Oleg Osipov", "ReviewID": "RVNW49SQ682KD", "Overall": "3.0", "Content": "Good as a monitor, but bad as a mirror.Very hard to see in the mirror, if you do not turn on the monitor and camera.", "Date": "January 29, 2013"}, {"Title": "good", "Author": "sami", "ReviewID": "RN655ASLZHJM5", "Overall": "3.0", "Content": "The screen looks nice but it's big  ,  there is a 1.5 seconds delay when you turn on the switch  meaning you need to wait at lease 2 second to backing your car .i think it's good for price", "Date": "December 17, 2012"}, {"Title": "Coll Product", "Author": "Jamie Falconi", "ReviewID": "R326RO9UH42AU5", "Overall": "4.0", "Content": "Nice Product, clips right onto the existing mirror, and then you just run some lines overhead and down to power etc... cool stuff.", "Date": "November 29, 2012"}, {"Title": "too much glare on mirror", "Author": "S. Siu", "ReviewID": "R1D2CY1PE3KILU", "Overall": "1.0", "Content": "Monitor works good.Mirror has too much glare and hard to see the rear view - useless in a sense.", "Date": "February 15, 2013"}, {"Title": "Excellent mirror-monitor combo for the price", "Author": "David W Garland", "ReviewID": "R2LYMDJW9Y3O9", "Overall": "5.0", "Content": "First a little about the installation. The directions are terrible, but with the help of other reviews on here and a little trial and error it was easy to figure out. There are three power wires (red = power, blue = switch, black = ground) and two RCA video inputs. The female video input is for a backup camera (AV2), the male RCA jack is for another input source such as a DVD player (AV1). The red power wire should be connected to vehicle 12v power, the blue should be tied to your reverse light if you want the monitor to come on when you are in reverse. Wired this way, the monitor instantly turns on and switches to the reverse camera input (AV2). Note that when the monitor is in \"backup\" mode you cannot turn the power off nor change the video input. Power to the blue wire forces the monitor into \"backup\" mode. The included remote control is nice for the installation of a backup camera because you can play with the rotation feature and inputs while adjusting the camera at the back of the vehicle.The mirror is fairly dark, however it is not terrible. The screen is large and the colors are vibrant, and it has brightness controls so you can adjust the display to your liking. You do have the option of rotating the display if you want to, however this will have the effect of rotating the onscreen text for the menus. For example, the display of AV2 will become SVA. This is just a minor annoyance, but I preferred to ensure the camera was facing the proper way so I didn't have to deal with it.So, in case it helps anyone else, here's how I wired mine up:1) Red wire to switched vehicle power.2) Blue wire to reverse light power.3) Backup camera red to switched vehicle power.With this setup, I can have the monitor off if I choose and it will automatically come on when I go in reverse. Or, if I choose I can turn the monitor on to AV2 while I'm driving and see the camera display.", "Date": "August 4, 2013"}, {"Title": "Excellent product", "Author": "John C. Bolden", "ReviewID": "R26DVOZ8H6WFQ9", "Overall": "5.0", "Content": "this item is ideal for a replacement rear view mirror in my company vehicle a cargo van rear visability is poor I mated this unit with a rear facing camera and it is better than the installed rear view mirror.", "Date": "April 18, 2013"}, {"Title": "Not much good for a back-up monitor", "Author": "alt", "ReviewID": "R1C4ZDGD5ACN6", "Overall": "2.0", "Content": "I've been searching for a backup monitor that fits on the rearview mirror. This is not it. In about any light, the screen has so much glare that neither the mirror nor the camera view is really useful. Of course, you can fix this by tilting the mirror when you put the car into reverse such that it does not reflect anything from the rear window. Then there is no glare from the ambient light but you have to readjust the mirror before you start driving so you can see out the back window again. In addition, when you try to tilt the rearview mirror via the monitor - which completely covers the mirror so you have little other choice - the monitor's tabs that hold onto the mirror become disconnected instead of the mirror tilting. So then you have to reattach the monitor to the mirror before driving.So overall this monitor is mostly useless except for use in very overcast days, heavy shade, and at night (assuming your backup camera has night vision).", "Date": "January 2, 2013"}, {"Title": "Superburbarific!", "Author": "philthepill", "ReviewID": "R373G3P5BMU3YV", "Overall": "5.0", "Content": "The remote could use some work since over half the time I pressed a button it wouldn't work. But for the price it's hard to complain. I really like how easy the buttons are too push. It feels like hitting a number on a touchscreen phone.", "Date": "November 12, 2012"}, {"Title": "Rear view Monitor Mirror", "Author": "Chris", "ReviewID": "R3H2PB0V0VZC3H", "Overall": "4.0", "Content": "Have got to say,the theory behind these is great,but the one I own(did not buy from Amazon) is the second return,the first one was dead in the water straight out of the box,the second functioned really well for 3 weeks then it seemed to brain fart and stop working......so am waiting for the 3rd one..............in fairness I must say several friends have these and have had no problem with them so maybe I just got a raw deal,the 1st did look like an 'open box'type product and the second looked like FedEx had played football with the package so that likley was a major part of the death rattle of the second,will update after I have had the new one for awhile in the interest of fairness.I like the idea and like the unit the one that worked,the clarity was good and is reasonably well thought out hence the 4 star review.", "Date": "August 13, 2012"}, {"Title": "piece of junk!", "Author": "DaveVann", "ReviewID": "R3Q6OS6B2299OQ", "Overall": "1.0", "Content": "The touch screen did not work at all.  It turns on at the slightest bump in the road, and will not turn off but continues to beep and change it's self from upright view to upside down view, and adjusts the brightness on it's own.  I have never been so disappointed with anything I've ever purchased before!", "Date": "August 16, 2012"}, {"Title": "SO UNPOLITE  SELLER", "Author": "DANIEL IÑIGUEZ VERDIN", "ReviewID": "ROKD3YN76IYIR", "Overall": "1.0", "Content": "I asked a simple question and this guy was so mean.  How can he sell like that.  He must go to a flee market not this international site or at least get some education.", "Date": "December 20, 2013"}, {"Title": "Not so great", "Author": "sasha", "ReviewID": "R25C02L5NPB2P9", "Overall": "2.0", "Content": "It works not so bad, the only annoing things is it is blinking from rear view to bloo screen at nightHow to prevent this phenomena I don't know.That is big minus for device. Does anybody got a suggestion?oR i GOT DEFECTIVE  monitor", "Date": "April 12, 2014"}, {"Title": "china", "Author": "Oganes Ishkhanyan", "ReviewID": "R1446FNPSSBQP8", "Overall": "3.0", "Content": "pros. it's pretty good quality screen. you have two inputs. resolution is kinda low but what do you expect.cons. depeding on your camera, you could have a good or bad experience. get a good quality backup camera.", "Date": "February 19, 2014"}, {"Title": "Dead.", "Author": "David S", "ReviewID": "R92OEISR33FWQ", "Overall": "1.0", "Content": "Was working for about 5 months but now its dead.  All I hear is a high pitch noise coming from the monitor.  I guess I can kiss my $$$ goodbye,", "Date": "December 27, 2013"}, {"Title": "Good product for the price", "Author": "TheGMan", "ReviewID": "R2FYHG35I9HZAH", "Overall": "4.0", "Content": "While not \"stunning\" in operation or function, this monitor rates better than average.  It has a few \"quirks\", such as reversing or rotating the screen also causes the lettering and menus to show up reversed.  It does not have an easy way (like a day/night mode) to tone down the screen brightness for night use, or brighten it for day use, other than going into the menu and manually changing the brightness/contrast settings.  Other than those few, relatively minor, issues.. it's a good little monitor.  It's easy to install and set up, and performs well.  The screen has good clarity and contrast, and the springloaded mounting clips hang on pretty good.  Overall, I gave it a 4 out of 5.", "Date": "September 15, 2013"}, {"Title": "good", "Author": "Milton", "ReviewID": "RP05ONGYWB7S2", "Overall": "4.0", "Content": "Big screen very nice. .. but this is not a real mirror is only a is reflection so in the night  is little hard to look back but is a good product I will recommend...", "Date": "March 31, 2013"}, {"Title": "Very nice product. shipping was fair, quality isnt the best but its the best bang for your buck", "Author": "Terry N", "ReviewID": "R1KX8TAWRGUZOP", "Overall": "3.0", "Content": "I purchased this for my backup camera. the shipping was fair and seller is very strait forward. the quality isn't the best but its the best bang for your buck. i like the second av feature so you can play any player or game from it.", "Date": "February 6, 2013"}, {"Title": "monitor", "Author": "Tank 560", "ReviewID": "R2KCNCWQPD8X5O", "Overall": "5.0", "Content": "TFT LCD Widescreen Car Rearview Monitor Mirror with Touch Button, 480(W)x 234(H) Screen Resolution, Car /Automobile Rear View Mirror Display Monitor Support Two Ways Of Video Output, V1/V2 Selecting is very nice.", "Date": "January 24, 2013"}, {"Title": "Perfect for rear cam, dvd or ham radio", "Author": "scott hilton", "ReviewID": "R39VVAX46S7KWS", "Overall": "5.0", "Content": "Perfect for rear cam, dvd or ham radio.  Clear, huge screen keep your eyes on the road.  Can't beat the price.", "Date": "December 8, 2012"}, {"Title": "I like it but", "Author": "Gokool & Family", "ReviewID": "R361P6X8195QYR", "Overall": "3.0", "Content": "The mirror works well, but I did not receive the manual for operation of the mirror.  I do not understand how the lines work in the reverse motion.", "Date": "October 19, 2012"}, {"Title": "Awkwardly big, and NOT A MIRROR", "Author": "gush", "ReviewID": "RCYIZ4KEB3AB1", "Overall": "1.0", "Content": "This thing is huge. Note the dimentions, make a cardboard mock-up, and hold it in place. It feels like you attached a TV to your rear view mirror. Speaking of which.. that rear view? It won't see behind you any more because this screen is NOT A MIRROR.", "Date": "November 18, 2012"}, {"Title": "Mirror part not large enough, its just Black plastic..", "Author": "Theodor Basch", "ReviewID": "R36P86VQR3B6IE", "Overall": "3.0", "Content": "Mirror part not large enough, its just Black plastic.. The other one with full mirror is much better. Check it out!", "Date": "March 27, 2014"}, {"Title": "Good dash cam", "Author": "Brice", "ReviewID": "RBQUTXXCLD8D", "Overall": "4.0", "Content": "A quick review:I have not been able to get any of my card readers to boot up the 32gb SD card.  I might have to buy a card reader.If you set up the camera to record G shock episodes they can fill up the memory very quickly.It is good to have a spare SD card to swap outThe images are more clear than I expected.  I wish it had a aux jack for a optional monitor.I am still learning about it so I can't put fault with it at this time.  It is smart.", "Date": "April 21, 2013"}, {"Title": "7 inch TFT viewer", "Author": "walnan \"walt\"", "ReviewID": "R2R95AYYAX8D2D", "Overall": "4.0", "Content": "Really like this unit. I use it as small video monitor for my outside cams, and alsoas a video monitor to set up my satellite dish for signal display on the roof..onlycons  are no power connector (for a seperate AC adapter) and not bright enough foroutside use.. Other then that, a GREAT price and small size..Very happy with unit.", "Date": "August 28, 2012"}, {"Title": "Muy grande", "Author": "Amarquez", "ReviewID": "RMVDI1OFYPEGI", "Overall": "3.0", "Content": "No usé el producto porque me parece muy grande y se pierde el espejo como tal, asi que prefiero otro sistema de monitor para camara trasera.", "Date": "February 8, 2013"}, {"Title": "Dead on arrival", "Author": "Rick I", "ReviewID": "R1NW22GP3VHP7U", "Overall": "1.0", "Content": "Looked as if it was repacked on arrival. Seal on box was broken. Connected to power and got a white screen. Nothing worked from there. Returned it.", "Date": "April 19, 2013"}, {"Title": "to much glair can't see no good", "Author": "dumptrucks2000", "ReviewID": "R1S0PHCO9QC5SK", "Overall": "1.0", "Content": "the mirror has way to glair can't see.i guys you get what you pay for no good no good no good ps it cost me $185 to get it wired to work.", "Date": "April 13, 2013"}, {"Title": "the alarm works but nothing else", "Author": "mike", "ReviewID": "R140LHEP4UWGJX", "Overall": "1.0", "Content": "when i connect the red wire to 12 volts the alarm screams.how do i reset the alarm?yes, the ground is connected properly.who do i return this to for an exchange?i'm not happy!!!", "Date": "April 7, 2013"}, {"Title": "Disappointed", "Author": "George Connallie", "ReviewID": "R1ZIOPRR9MYG6V", "Overall": "1.0", "Content": "i received the item and when i tested it only lines came on the screen. Seems like factory fault or it got messed up in the shipping. i was so disappointed.", "Date": "March 31, 2013"}, {"Title": "can i return it ?", "Author": "George Bank", "ReviewID": "RFQPZWUW15NDC", "Overall": "1.0", "Content": "i want a full time monitornot one that shuts off and continually blinks picture / blue.how do you turn that feature offwhy are there no phone numbers to the manufacturer", "Date": "December 28, 2012"}, {"Title": "Have it better nothing", "Author": "dallas", "ReviewID": "R10A5JJM8EDU", "Overall": "3.0", "Content": "You can see the screen when you back up .But the picture not look good , I don't know the monitor or the camera problem . Other thing is the wire too small ,easy broken . If I'm have time ,I will find out why the picture not look good ( even I was adjusted contrast, brighter... )", "Date": "October 20, 2012"}], "ProductInfo": {"Price": "$99.80", "Features": "The Item Is Mainly Used For Car Surveillance, Car Rearview\n7 inch 16:9 TFT LCD Widescreen Rearview Mirror Monitor With 480(W) x    RGB x 234(H)=336960 Pixels, and High Quality NTSC TV System\nSupport Two Ways of Video Output, V1/V2 Selecting. It Will Turn To    Blue Screen When No Video Signal\nRear Watching: Image Can Be Changed Left and Right\nOperate Mode: Touch Keys, Remote Control", "Name": "7 Inch 16:9 TFT LCD Widescreen Car Rearview Monitor Mirror with Touch Button, 480(W)x 234(H) Screen Resolution, Car /Automobile Rear View Mirror Display Monitor Support Two Ways Of Video Output, V1/V2 Selecting", "ImgURL": "http://ecx.images-amazon.com/images/I/416V78ZpQEL._SY300_.jpg", "ProductID": "B005I7UQ4K"}}