{"Reviews": [{"Title": "Very good, inexpensive starter setup.", "Author": "Larry Smith \"LSmith1437\"", "ReviewID": "R2RS6JLHL6YNE1", "Overall": "5.0", "Content": "Pros:-Very inexpensive-Comes with all you need to get started (4 cameras, you can add up to another 4)-flexibly programmable for each channel: Framerate, motion alarms, privacy areas, schedules,more...-Can be accessed on your local network or via internet if you have the network chops to config that.-The DVR is the latest relase from the manufacturer, as of 2/2012-Support is great, was willing to talk me through a few setup questions and workaround one bug I found in their firmware (see below)Cons:-Wires seem to be lacking a bit in shielding, they pick up a little intereference when run at full length through attic where other A/C wires are.-Included cameras are not the sharpest image.  Considering they are practically thrown in for free...-Total supported framerate a bit on the low side, buy forgiveable at the current price point.-Shipping from the manufacturer took a month.  I noticed that after I put the order in, so shame on me, I'm spoiled.For reference, I paid One Hundred and Thirty dollars in January '12.  If you're handy enough to install your own hard drive, this might be one to get.  Recommend a 500gb at least.  Manufacturer told me not to go all the way to 2TB, they've run into problems with stability with that big a drive. Don't forget to make it an AV rated hard drive.  I used a Western Digital Green Power 500gb, which worked fine!Also, ran into one problem: you must use IE to view the box over the network.  And, IE 9 has a glitch with setting up alarm areas per each channel.  IE 8 works fine, or just go to the console to set it up there.  Support is now aware of the problem.So now its set up and running... I already used it to identify who masking-taped a flyer to the front of my house, just for fun.", "Date": "March 1, 2012"}, {"Title": "Horrific Customer Service Bad Quality.", "Author": "Lexus9977", "ReviewID": "R3N31FZQBMWGDA", "Overall": "1.0", "Content": "The DVR is not of the best quality and mine broke after about 6 month.  The hold time for customer service representative is very long and when you get them they are not paying attention to what you are saying.  The company is not cognizant of customers time.  I would rather pay a bit more and get better quality product from a company that provides better customer service. T", "Date": "September 10, 2012"}, {"Title": "Junk", "Author": "Danielle", "ReviewID": "R2YH10QA0HTEAZ", "Overall": "1.0", "Content": "I bought this and it did not work. Will be sending back. Appeared to be made very cheap. Connectors on back of dvr were loose and it affected the picture. The cameras were jummpy and kept trying to come through on channels that weren't even hooked up.", "Date": "March 8, 2013"}, {"Title": "Horrible", "Author": "GAmotherof2", "ReviewID": "R3GEK1JM718U50", "Overall": "1.0", "Content": "Horrible system. Broken right out of the box. Customer service can't keep story straight and doesn't seem to want to work with customers.", "Date": "July 23, 2012"}, {"Title": "This is an excellent system", "Author": "Robo man", "ReviewID": "R2OH2DDNHORUU6", "Overall": "5.0", "Content": "I installed camera systems for over 25 years in banks, saving and loans, etc. Both in the U.S. and for the Mexican government. Reading some of the reviews made me a bit nervous on this system, but I ordered it anyway. Here's the deal. For this price you are getting three of the cameras for free. Someone said there were no screws included for the sun shade on the cameras. That is not a screw hole. It is there in case you want to mount the camera UNDER something. That way the swivel mount can screw into the top. The iris shade is on a well designed pressure slide. It will not move by itself. Someone else said the colors are off. Maybe they had some adjustment issues. I installed mine and the colors are pretty much true to life, at least in my application. If you are new to this, first do what they tell you to do, set it all up and TEST it BEFORE you run all the cables! Second, mark with tape the end of the cable that goes into the dvr, or the camera if you want. DO NOT run the cables and then discover you ran them backwards! I dropped a 2T HD in and of course it has to format. Someone complained it wanted to format the drive. It takes about two minutes and you are ready to record. A sweet little system for this price is hard to find. A huge bonus is you can always add four more cameras later if you want.", "Date": "February 22, 2013"}, {"Title": "Chinese product has just hit whole new low", "Author": "Brian", "ReviewID": "R23CYHXJRJCRSS", "Overall": "2.0", "Content": "I gave two stars because this is truly a miracle come true.  However the miracle lies in how far the Chinese mfg are willing to go in the name of cost saving.  For example, in order to save cost they skip screw to fasten the little \"hood\" that goes over the camera.Just to be fair, DVR does work, and so does the cameras.  Do they work well, no.  One of the camera IR emitter promptly burn out half of its LEDs after only 3 hours of on time.  Now, let's go over a few things.- Camera resolution.  It's so bad that you won't be able to see facial feature of a person standing 15 feet away.  So, for the purpose of security camera to ID the bad guy, this camera will most certainly fail the task.- Camera color.  Brown looks purple.  Green looks gray.  But, it is able to tell colors apart.  Since I only spend $120 for the whole set, I think I can live with it.- DVR resolution and frame rate.  Grossly over estimated on Zmodo's web site.  240fps in CIF mode. with 60fps in D1 mode.  Keep in mind this frame rate is share by all channels.  But when I tried to set 30FPS for channel one and two, the software knock me back to 18fps max.  What gives?!?!For comparison, I also own Foscam FI8918W IP cam.  Although both cameras have similar spec. This unit makes the Foscam FI8918W unit look like HD cam.All in all, this set is good enough if you just want to know if some is snooping around house, or check to see if UPS/Fedex left package at your front door.  For true security camera usage, the resolution of the camera and usable frame rate will need to be much better.", "Date": "December 13, 2012"}, {"Title": "Why I don't like this DVR", "Author": "Wayne L Bolin", "ReviewID": "R2MWKNBMSH5JYJ", "Overall": "2.0", "Content": "This DVR does not have adequate ventilation, nor does it have a fan.  I ran this overnight, opened it, touched the hard drive and almost burned my fingers.  For sure any hard drive won't last long.Also, if you set your system up to do motion detect and record at the same time, this DVR does not break the files up, meaning you cannot view the motion detect files.  The only way to see them is to look in the log file and they are buried deep inside there.  absolutely you cannot possibly view the motion detect files on the pc client software.  The only way to view the motion detect files is to set the schedule to not record continuous and record motion only, then they are available.I have the 4 channel version and I can list both motion and continuous at the same time.I removed this unit and bought their 16 channel and it works great, 2 fans and can record continuous and motion at the same time and review each as I like.I do however love the cameras,  big bang for the buck.  Color is great and the 24 IR LEDs work good at night.", "Date": "May 22, 2013"}, {"Title": "Great for the price!", "Author": "Deborah Texeira", "ReviewID": "R1CNWCNFT8LZ3S", "Overall": "4.0", "Content": "UPDATE 5-26-2012 For Mac users with OS X.  I just found on the app store \"vMEye+\" that allows you to view this model on Mac!  The app is just ok but does work.  For iPad read my notes below!I just got this today.  I don't think you can beat it for the price.  Here is what you need to know.1. It doesn't come with a hard drive.  Thats one reason why the lower price. But I bought a 1T for $100 and put it in myself.  It was simple.  Or they have an option on here to buy this same system with a 500g drive around $250.  More than I paid with a 1T drive.2. The cameras are not good in low light.  Compared to some other cameras I had these are poor. Especially poor for outdoor use.  You could however use them in a small room or position them to be right on a door. With the money you save buy a higher end night camera and you'll be set.3. Customer service for me was awesome!  Seriously, I'm still shocked it was so good.  I called twice and had hardly any wait.  Both times they were great to help out. My previous experience with another security DVR company was not the same...4. I did get my remote viewing to work on iPad 2 and iPod touch using the \"APlayer\" app.  It was free in the app store.  Someone else said it didn't work but seems to be fine for me. The viewable window on the iPad is formatted to the size of my iPod but you can hit the 2x and stretch it.  It works at a low quality.  It would be nice to see an update for the iPad. Still ok though.The instructions are not so easy.  Most DVR security companies seem to have this problem but I would recommend this to a friend without a doubt.  It's by far the biggest bang for the buck!", "Date": "May 23, 2012"}, {"Title": "Not a bad system....", "Author": "Jim L.", "ReviewID": "R39EUW2Q6ZDRJZ", "Overall": "4.0", "Content": "Originally bought it and I was unaware that it had no hdd...a dvr quality sata hdd....so instead of sending it back...because it was already installed, I called Amazon...Luckily they were upfront with the fact that until a few days ago it was unadvertised that the hdd was missing, they sent me a hq primo dvr hdd.....easy setup, easy ui...happy now...always check for reviews", "Date": "June 20, 2012"}, {"Title": "Great for the price.", "Author": "Joseph Palmer", "ReviewID": "R30282AKM9PTDW", "Overall": "4.0", "Content": "They should support linux outside the box if they are going to implement it inside. I use Ubuntu and it is very difficult to control the device using their software via WINE.", "Date": "January 22, 2013"}, {"Title": "You get what you pay for...", "Author": "AUser", "ReviewID": "RB8JZBBCXAJS6", "Overall": "3.0", "Content": "The DVR is OK. The cameras suck. The software is outdated as it's written for Windows XP and will NOT run on Windows 7 x64 no matter what compatibility mode it's set to. If you want updated software you'll have to BUY it from a 3rd party company whom will first offer you a downloadable trial but, you have to request it - meaning that the software is likely very expensive.In a nutshell, if you're looking for a CHEAP system that will simply squeak by and you don't care about the software or camera quality, then this will do fine. If you need something with updated software and decent cameras, keep on looking. I gave this unit a 3 star rating simply because there's no way to do a 1/2 star (I consider it a 2.5 star product).", "Date": "July 3, 2012"}, {"Title": "Do not buy", "Author": "william nieves", "ReviewID": "R3SZSUIDVBMWME", "Overall": "1.0", "Content": "Great price but you get what you pay for. I have had the system for six months and had my dvr replaced twice", "Date": "September 18, 2013"}, {"Title": "good dvr system, not a lot of perks", "Author": "Adam Abdel-Rahman", "ReviewID": "R1H9B3VK2ZZOQM", "Overall": "4.0", "Content": "This is a pretty good DVR system, especially for the price.  The cameras kind of suck, but they were pretty much free so i can't really complain.  Not a lot of the bells and whistles that you get from larger more complex DVR software, but it definitely does the job.", "Date": "February 19, 2013"}, {"Title": "A Very Nice, Low-Budget System!", "Author": "Amazon Customer \"featheredprop\"", "ReviewID": "R2E84Y24H8AK7F", "Overall": "4.0", "Content": "I was considering this unit, when on Black Friday the price fell to an incredible $109.  I bought it and within a few hours the price went back up.  That was cool.In addition to this DVR unit, I also purchased the Western Blue 1 TB Desktop Hard Drive: http://www.amazon.com/gp/product/B0088PUEPK/ref=oh_details_o00_s00_i00  The hard drive was easy to install, and has been working great.  Four cameras at the highest quality records about 3 weeks before it begins to loop.The unit is an 8-channel DVR.  It came with 4 low-end cameras. They work pretty well in daylight, and have a nice wide view.  However, there are many colors that they do not produce very well, and the night vision is extremely limited.  Blue will look like purple, and black looks pink.  Still, for keeping an eye on your porch, doors, deck, and so on - they do pretty well.To improve clarity for night vision you can raise the brightness level via the operating software.  This helps considerably.  However, as it becomes daylight, the brightness level has to be reduced or you would not be able to see anything.  It would be nice if there was a timer built into the operating system that automatically returned levels to normal during daytime hours. NOTE: if an event is recorded in very dark conditions you can NOT adjust the brightness levels to see better with this system.  You must adjust the level before the event is recorded to have the improved view.  So, in the morning I adjust the brightness back, and in the evenings I raise it up.The DVR has a pretty simple and easy to operate interface.  I have it attached to my router, and can view the four cameras from anywhere on my Droid phone, or another computer.  One camera is set to detect motion and will email me photos.  This is working fine.In addition to a computer monitor port, the DVR has a video line-out that allows you to run it to another device, like a TV.  I haven't used this feature yet, but plan on running it to two of my TVs in the near future (via a splitter).So, for around $200 I have a decent security system, which allows me to see who is at the door, and to watch the kids play in the yard.  Because of the low-grade cameras, I think that I would probably have trouble identifying bad guys, especially at night.  Also, because the color representation is so poor, you can't trust telling the police what color car was seen lurking around.I am guessing that some better grade cameras would greatly improve this system.  But, at this point I am very happy with what I have!", "Date": "December 21, 2012"}, {"Title": "Zmodo Surveilance System from Amazon", "Author": "David E Robbins", "ReviewID": "R1IN13WZRMY1MJ", "Overall": "5.0", "Content": "The item arrived on time and was as advertised. For the price it is a good system. It was very easy to get it on the internet and is accesable by computer, android tablet or android phone. It works very well even on slower internet connections. I have had it up and running for about a month and have had no problems with it.", "Date": "September 1, 2012"}, {"Title": "Great product!!", "Author": "Paul", "ReviewID": "R1M6C4A4QW96V7", "Overall": "4.0", "Content": "Hardware was easy to set up, software was a little bit difficult to setup, overall it is nice product to use.", "Date": "April 16, 2012"}, {"Title": "Great function for the price!", "Author": "R.S.", "ReviewID": "RJQ6TEUGETBQ5", "Overall": "5.0", "Content": "I bought this unit w/o the hard drive and then purchased a Western Digital Caviar Blue 500 GB SATA III 7200 RPM 16 MB Cache Bulk/OEM Desktop Hard Drive - WD5000AAKX also on Amazon (provides about 16 hrs of recording I have read)  and it has been doing just what i wanted for a lot less than other products costing a lot more (approx $184 total).  The cameras seem to be OK,I have 2 hooked up so far (I had pre-existing cameras already installed).  To note, you only get one power supply with 4 pigtails to power the 4 cameras -- seems to work OK. I hooked it up to an old PC LCD monitor and can also view via my PCs. The SW has security (PW protection) and allows me to view and record and time and remote view (via Android), so so far so good.I also use IPCamera (downloadable from Google Play) which allow you to view up to 6 cameras for free (and then for a few dollars you can upgrade to the pro version which unlocks the # of cameras you can view -- this way I can see cameras from different locations in one place)If you use IP camera, you need to configure your cameras as \"Night Owl\" Night Owl, FS w/ mobile port,  and use port 15961.", "Date": "December 31, 2012"}, {"Title": "Bad color on all channels", "Author": "Steve Renfrow", "ReviewID": "R3J195EWOULMJ7", "Overall": "3.0", "Content": "The unit seems to function OK, but the color an all channels has a problem.  The trees are purple and the HUE control does not work.  I have seen this problem in the past when the 3.58MHz osc had a problem.  I think I should send the unit back for replacement.  Also, I have not been able to make the motion mask work.  I still think the unit is worth the money and the problems are minor so far, but the color problem makes it look worse than B&W...;The cameras have a very good picture, much better than the cameras I had been using.  The nite vision has a much better range than my old cameras also.PS  I have not been able to make it show up on Firefox.  And some of the settings don't work with Internet Explorer.  Still worth the money.", "Date": "June 16, 2012"}, {"Title": "Buy a newer an better Zmodo System!!", "Author": "Aaron", "ReviewID": "R1CY5OBTDTOC1R", "Overall": "1.0", "Content": "This system cant go online or work on your phone because you cant go on line. Doesnt record in constant unless you use your motion sensor and the settings for that mode sucks to! Basically if you know something happened in that area of you security system and you wanted to watch from a approximate time you CANT! The best you can do is hope the camera cought it on the motion activity and watch from that point on. rewinding and fast forwarding practically makes the video crash and restart! Abosolutly terrible product. Only good for monitoring and not recording because it is not dependable in that degree!", "Date": "February 18, 2013"}, {"Title": "great deal", "Author": "robert young", "ReviewID": "RT0LB73LJZ7A7", "Overall": "5.0", "Content": "no problems only wish more detailed instructions or maybe a video to help explain what all the functions do or terminology key", "Date": "May 6, 2014"}, {"Title": "Good featured but not very intuitive", "Author": "Stretch", "ReviewID": "R34PDN7FYVLYJ3", "Overall": "3.0", "Content": "Has a lot of nice features but using this unit is not very intuitive. I've used it for about a year before replacing it with a nicer unit. Mine stopped working when the hard drive crashed (though the unit itself still works). One nice feature about this one that some units don't have is the ability to record both video and audio. The web interface is a bit clunky and compatibility issues mean it only works with IE. Overall, pretty good starter DVR. The camera's that it comes with are the biggest fault. Their resolution and color accuracy leave much to be desired. The night vision feature works well enough indoors at short distances but anything over 20 feet will be reduced to shadows at best.", "Date": "April 22, 2014"}, {"Title": "Customer Service", "Author": "Chris W.", "ReviewID": "ROOELGXZTS8UD", "Overall": "1.0", "Content": "No customer service at all. On hold for 30 minutes before I had to hang up the phone. Next time I will pay more for a better product.", "Date": "April 18, 2014"}, {"Title": "Serves the purpose", "Author": "Eric Hargrave", "ReviewID": "RSSCU0QEIVUWR", "Overall": "3.0", "Content": "Okay first of all i paid around 120.00 thats a plus second of all found a 1 tb hard-drive for it less that 70.00,  another plus....finally I didnt expect it to be as clear as my thousand dollar camcorder, nor did I expect this to be compatible with the other more expensive systems. So with that being said to all the others that gave this system a bad review, look at what you spent and if you think you can buy another system for that amount of money and expect better then by all means buy it and leave this system to the need no better than entry level people like myself. Thank you I'm done", "Date": "February 10, 2014"}, {"Title": "The DVR is JUNK", "Author": "Joma \"Jose M\"", "ReviewID": "R1X9AZ86RZ8QNQ", "Overall": "1.0", "Content": "I had this system for one year this pass jan 9, and the DVR died! The software for the remote viewing never work. You had to open your modem firewall up to use the software and it was only usable on very old cell phone software like symbiam and windows mobile. Do yourself a solid and spent a little more on a worth while system.", "Date": "February 8, 2014"}, {"Title": "Cameras ok, DVR is useless", "Author": "Dimi", "ReviewID": "R3R5DMTBIK2DIU", "Overall": "1.0", "Content": "Its cheap, its nasty, and it broke. TWICE. Its jut not very well built and the software is very lacking.", "Date": "January 31, 2014"}, {"Title": "I'm Not a Surveillance system expert", "Author": "mario celsi", "ReviewID": "RSU1SQS72VGP7", "Overall": "4.0", "Content": "I'm Not a Surveillance system expert. But this guys does the job.I have installed this system in my office and house, and it works a charm. It does what it tells.I haven't try the internet viewing yet. Image quality is OK, not HD, but works fine", "Date": "October 14, 2013"}, {"Title": "Buy the newer DVR Zmodo offers", "Author": "303 GearGuy", "ReviewID": "R1I052OYD9J1N9", "Overall": "3.0", "Content": "This old recording dvr device is not as nice as the newer all black model. I just installed this at my moms and I like mine way better. I got the model thats all black. The operating systems are different and I like the newer one better. This also has a weird power supply for the cameras that has a plug for each camera. My newer Zmodo system has 1 plug that has a 4 way pigtail thats much better on the power adapter taking only 1 power slot for 4 cameras instead of 1 plug for each camera. Bottom line is I like this but get the newer all black model dvr :)", "Date": "September 14, 2013"}, {"Title": "broke almost  immediately", "Author": "Cam", "ReviewID": "R1Q183CLDYCVGJ", "Overall": "2.0", "Content": "Networking never worked properly. After a few days, the unit began showing lines through the display and a day later stopped working completely. Waiting for RMA, hopefully the next unit I get is of better quality.", "Date": "September 4, 2013"}, {"Title": "Great product for this price!", "Author": "Carl Montgomery", "ReviewID": "R5DQZA399SF2P", "Overall": "4.0", "Content": "Overall, this is a very nice unit, the DVR has a lot of features and honestly, that is what you are paying for here.  The cameras included with this kit are very basic so don't expect an awesome picture from these things.  Night vision is very short, but does work.  Daytime these cameras are ok, color is a little washed out and gray.  I put in some Lorex cameras on this DVR and they are awesome.", "Date": "August 29, 2013"}, {"Title": "Good system, but", "Author": "Big Daddy \"Budha\"", "ReviewID": "R1INTS60M95P9O", "Overall": "4.0", "Content": "The only problem I have with the system is that it's hard to set it up for remote viewing from a computer but other than that it's a great system.", "Date": "July 24, 2013"}, {"Title": "Great security system for the money", "Author": "Qwibqwib", "ReviewID": "R2U6QO3CVFR1WQ", "Overall": "5.0", "Content": "This system came with everything needed and was very simple to set up. The DVR works flawlessly. The cameras are not as good as high dollar cameras, you get what you pay for. That being said, these cameras are a good value. They can identify individuals at a reasonable distance both night and day. The color is pretty good, even if a little washed out. They work pretty good at night. I would recommend this system to others as long as the price is below $200.", "Date": "July 20, 2013"}, {"Title": "English, please!!", "Author": "D. James \"Shhh- don't tell\"", "ReviewID": "R12XUI8QEYRY9T", "Overall": "3.0", "Content": "Have not been able to get it working yet.  As seems to be usual, instructions written by someone not well versed in English AND written for other techies who do not need instructions.  3 stars are for the instructions coupled with what appears to be a nice product.  Why can't tech product manufacturers hire normal people who speak English to write their instructions???", "Date": "May 5, 2013"}, {"Title": "really nice dvr wide field of view cameras", "Author": "B. Hosters \"stickinpoo2\"", "ReviewID": "R2JZN0FYC2T1I4", "Overall": "5.0", "Content": "i got a $700.00 night owl dvr about 3 years ago and this little zmodo compares to it at a fraction of the price. all you gotta do is pop a hard drive and you good to go. all i can say if your thinking about getting one of these is ... do it. at least at the sub $150.00 price tag.", "Date": "March 4, 2013"}, {"Title": "Camera working ok.", "Author": "Tchong", "ReviewID": "RD842RBB5XCRB", "Overall": "4.0", "Content": "The recording work just fine but the cameras have a bad color output, everything look like fading color. - 0", "Date": "January 7, 2013"}, {"Title": "It works well", "Author": "Johnny E Hollifield", "ReviewID": "R1YCSDK24W1SF2", "Overall": "4.0", "Content": "For an economy system it works really well . I like the cameras with this model better than my old system. I put in a 500 gig hd and it does what I need it to do. The instructions are lacking and hard to follow but if you already have a system it does'nt take long to figure the system out.", "Date": "December 28, 2012"}, {"Title": "Bright lights", "Author": "Jim Barnes", "ReviewID": "RF1291ESEMCQR", "Overall": "5.0", "Content": "they work  that alone is and achievement.,,,as they were tested one of these days I'll actually mount them and find out how they really work", "Date": "December 14, 2012"}, {"Title": "Good entry level camera system...", "Author": "James Southard \"JoeCop\"", "ReviewID": "R30PJJ97M3SAHN", "Overall": "4.0", "Content": "I purchase this to install as my first surveillance system at home.  I've mounted these four cameras and installed an additional four.  The system does what its supposed to.  I haven't been able to put the feed on the internet for remote access, but have linked it to all of the computers in my house.  I also purchased a Video Hare Drive and installed it. (Easy installation!!!!)  I only gave it four stars because I haven't been able to get the internet functionality working yet...  It's not bad...", "Date": "December 11, 2012"}, {"Title": "FAVOR NO PUEDO RETIRAR DE LAS ADUANAS DE ECUADOR", "Author": "ROBERTO CARLOS TIPAN LEMA", "ReviewID": "R3B1OY7UC5W1AD", "Overall": "5.0", "Content": "Saludos señores NEcesito la factura legal, en mi país no aceptan guias, favor si me pueden enviar al mail: robcarlostipan@hotmail.com", "Date": "December 4, 2012"}, {"Title": "Nice cost benefit relation", "Author": "Alexandre Barbosa", "ReviewID": "R3ZL7KHB4OYC5", "Overall": "4.0", "Content": "Nice kit. Fit nicely to my needs. The remote access through IP works very well and the product has a very nice set of configuration.", "Date": "November 5, 2012"}, {"Title": "Awesome Dvr Combo", "Author": "Dave", "ReviewID": "R1KQTKOAYK2VA5", "Overall": "5.0", "Content": "Hello. This a great low budget camera surveillance system for the price. It has plenty of features with its easyTo understand instructions almost any one that is tech savvy should not have a problem to install. Tech support is great and unit has a warranty.  What more could you ask for in a low budget system.  I have installed a few of these units and must say for the money. You just can't beat the quality. Has features of most high end dvrs.  The camera arena is where you need to know the business of what you are trying to make the system do. If you expect the cameras that come with this unit to do the job of a 5,000 dollar unit then don't buy these just upgrade cameras to the desired range that you need for the area you trying to cover. If you are not tech savy then get a qualified technician as myself or others to install them to give you the coverage you are looking for.  Many thanks to zmodo and their products. I just love them.  Dave", "Date": "November 4, 2012"}, {"Title": "Don't listen to people who have no clue", "Author": "mongo \"Restore America, deport all liberals\"", "ReviewID": "R32D5ZCOFF27MM", "Overall": "5.0", "Content": "I purchased this a year ago and I love it!  It works perfectly with zero color problems. The person before must have a crappy monitor cause I see everything on mine in perfect color. You will not find anything this cheap. Except in Mac mall they have one on sale similar. No hard drive is ok cause I had plenty sitting around. Threw in a terabyte and it self formats.Haven't figured out the programming as its not very Mac compatible. But it records and the cams that come with it see really good up to 25-30 feet in total darkness. There simply isn't a better deal.It shipped in time.Simple to use pre programmed features such as time stamps, switching views, single cam and or multi cam, audio, can use other cams, Ethernet port, VGA port, USB drive. Comes with a mouse. I mean what more do u want for this price? Similar systems go for over 300$!??? People just want to complain mostly cause they are ignorant.", "Date": "October 1, 2012"}, {"Title": "Great product at a great price", "Author": "intheboonies", "ReviewID": "RH4W128D3FA5J", "Overall": "4.0", "Content": "This is a great entry level security system for anyone that is looking for just a little piece of mind. Cameras set up easily and having the ability to expand to 8 is a real plus. Once you start there are alway more things that you want to cover.If you add cameras go for better quality. These are great for close range however not the best at distance.Overall I recommend this system as an easy to set up plug and play design", "Date": "July 18, 2012"}, {"Title": "Excellent Deal, Great price!", "Author": "Max K", "ReviewID": "R14T0YOOXED66M", "Overall": "5.0", "Content": "This must be the best inexpensive surveillance system out there! Everything is ready out of the box and easy to set up! The smart thing you should do is to buy your own hard drive to save even more! This is a 100% four star item but I give it an extra star for excellent price tag!Pros: No factory Hard Drive(buy/use your own, seriously). Easy to set up DVR with full 30 fps, 704X480 recording. Lots of options to play with and 4 more channels(8 total) to extend your surveillance! At night ZModo cameras are even better and have a bit sharper image and better range than my old security cameras.Cons: First of all you have to understand that you shouldn't expect professional HD quality and video recording from a $100 system. This is affordable home security with decent quality cameras and recorder. These cameras have indeed slight color problem with lots of purple instead of green however the image is sharp and way much better than black&white.; I also have another cameras from my old security system which have more colors but over all image quality is not that far from what you get from Zmodo.Other thoughts: Surveillance system market is big and there are lots of systems ranging from a hundred to thousands of dollars. You can pay more but will you get better quality system? Big question! My previous system was at $500 range with almost same quality 4 channel DVR recorder and only 2 cameras. Bottom line is, if you are looking for affordable home security system that will do its job this is the way to go!", "Date": "October 22, 2012"}, {"Title": "bad cameras", "Author": "HTC mytouch 4G charger", "ReviewID": "R34BEEKIA8MZ46", "Overall": "1.0", "Content": "Bad cameras, bad quality, can't see anything at night.DVR is okay butthere is not Hard Drive so consider spending $150.00 top buy Hard drive.Cameras didn't last more than 3 months.", "Date": "July 3, 2012"}, {"Title": "Don't do it!", "Author": "T. King", "ReviewID": "R225F9BTM9JM5A", "Overall": "4.0", "Content": "This item won't work long without buying a SPECIAL kind of hard drive. \"NHD\" means \"no hard drive\", and the one from your old computer has error checking, which is BAD on a DVR. Being constantly on, and trying to correct every drive error, will burn out a regular computer-type drive. Once you buy the right kind of drive in 3 months, you've paid more. Check the cost of a Western Digital AV-GP or Seagate Pipeline drive. Doubles the cost.", "Date": "May 12, 2012"}, {"Title": "Zmodo", "Author": "Bob pen", "ReviewID": "R1XRCHQU3XW6NU", "Overall": "4.0", "Content": "I'm all about Elvis. I'm 24 and my room is covered in his pictures. I LOVE this movie. I think personally that it's one of his best. I could sit here and watch him sing and move and never get tired of him. My favorite scenes are 1. when he's singing \"The Lady Loves Me\". And 2. when he's on her dance stage singing \"My Baby Loves Me\". Of course also when he performs the title song. I hope all avid Elvis fans have this movie in their collection.", "Date": "October 27, 2013"}, {"Title": "DONT RISC WITH ZMODO", "Author": "Habib", "ReviewID": "R29O4HH4XIY9QS", "Overall": "1.0", "Content": "I bought a package of SURVEILLANCE CAMERA ZMODO with 4 cameras on 15 August 2012 from Amazon, but since I received the product, 2 of the 4 cameras didn't work, immediately report and send the product to the company back.I have tried to communicate with them and I have not had a satisfactory answer.Much time has been spent (almost 3 months) since the day that I bought this product, i still do not have security of a good result.This is not nothing, have made me lose time and money on the cost of shipping by mail, and the company Zmodo is not responsible for your product. I just sent an email each week stating that RIM is in the hands of the technicians from the company and that at any time give me answer to my problem.Please, this company is very irresponsible and it is clear the theft of money that I have done. HE SAID THIS SO THAT YOU DON'T PASS, SO THAT YOU DON'T LET IT STEAL AS IT DOES TO ME.DO NOT BUY THESE CAMERAS MONITORING, OR MUCH LESS OF THIS BRAND, NOR TO ZMODO.Remember that ZMODO IS NOT RESPONSIBLE FOR WHAT YOU SELL, this is a problem, is another Chinese product that only has a beautiful box and the product and its money for the dump and WHO BUY IS METERÁ TO Calvary THAT I AM LIVING.", "Date": "November 6, 2012"}], "ProductInfo": {"Price": "$179.99", "Features": "3G mobile live preview via mobile phone.\nNetwork access, motion detection, VGA video output, and USB2.0 backup\n8 channel DVR H.264 Remote view access with 3G phone support + 4 outdoor cameras", "Name": "Zmodo Surveillance System with 4 Weatherproof IR Cameras PKD-DK0863-NHD (Hard Drive Not Included)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Yzr6tnHwL._SY300_.jpg", "ProductID": "B006PTP7JY"}}