{"Reviews": [{"Title": "Esky  C5900 great camera but somewhat complicated", "Author": "Troizana", "ReviewID": "R1MZBI1WOIRO82", "Overall": "4.0", "Content": "I am a novice to security cameras but decided to give this a try because it had all the features I wanted. The directions for wired setup were good and the camera gives a very clear picture, decent audio and the panning/tilt works good. However, I need to be able to view this remotely and wirelessly. The ability is there,but it has taken me several tries to almost have it working. I have some networking experience but this is a little above me. The net book I wanted to receive the signal does not have a powerful enough adapter to pick up the signal from the router so I had to use a notebook I wasn't planning on tying up. Possibly my lask of experience is the problem, but I would recommend having someone set this up that knew what they were doing.Update: as of 6/20 I still have not been able to remotely access this camera. It does take very nice snapshots of what you can see wired.", "Date": "April 26, 2012"}, {"Title": "Esky C5900 IP Camera", "Author": "G", "ReviewID": "R34R1QE7GU8UQT", "Overall": "3.0", "Content": "The Esky C5900 camera has a lot of potential.Pro:  You can remotely view the camera with your smart phone (I am using a Samsung Galaxy S2) and you can rotate the camera with your phone.  It will also send you emails when motion is detected.  I also put in t 32G sd card and that works well.  I have set the camera up in different locations (using wifi) and it works.Con:  I emailed into Esky for assistance and have never received a reply.  One big problem is about once a day the camera needs to be rebooted i.e. un-plugged and plugged back in, and you can not do this remotely.", "Date": "June 19, 2012"}, {"Title": "Easy setup. Worth buying.", "Author": "T. CHAN", "ReviewID": "R3CV3PEMGUGS3Q", "Overall": "3.0", "Content": "I purchased Generic Brand and Foscam over ebay and amazon, I returned all because it was hard to setup. Generic brand...don't even bother talking. Brought 3 Foscam new, 2 defective, it has better video quality compare to Esky. With Esky C5900, you need to play around with it in order to understand how it works. Make sure you go to youtube and search for installation guide, the manual can be little difficult to understand. For installation part, most likely you will fail when using ip to search for your camera. Here are few hints and hopefully you don't have to spend much time figuring out how to get it to work.For watching video over from you own wifi is easy, just follow wizard, but for \"Outer URL\" their DDNS server may not work all the time, just keep pressing \"Redetect\" until success. Than, make sure your virtual server from your router has starting and ending port \"81\" in port forwarding. After router reboot, everything should work. I sometimes spent lot of time getting DDNS working properly, I think their server either too far or not working.", "Date": "December 11, 2013"}, {"Title": "Could be better.", "Author": "Tom \"Tom M.\"", "ReviewID": "R33ZE6X50TDGG6", "Overall": "1.0", "Content": "Received the camera.  Out of the box it worked fine.  Hard to set up if you're not somewhat computer/network literate.  Never got the device to work on my wireless network.  Stopped receiving video as soon as I updated the firmware.  Wouldn't connect wirelessly at all.  I run MAC level security on my network and could never find the wireless MAC address to allow it to connect to my network.  Video pic was ok but not great but good for what the camera cost.  I think this could be a great product if they can work out the buggy software/firmware.  The product documentation is typical for a product coming from the Communist China.  They would do much better if they got someone that spoke English as their first language to proof read the documentation before they published it.  I'll do it for them for a minimal price!  I have sent this product back to the seller (very smooth process) and have purchased a Tenvis Iprobot3.  About the same cost with some better features.  Hopefully it'll work for more than a couple of hours.  Could be that the Esky camera was just defective out of the box and others may be ok.", "Date": "August 27, 2013"}, {"Title": "Misleading", "Author": "Caduceus", "ReviewID": "R3OFPKSJPNAAAK", "Overall": "2.0", "Content": "Update:  Well it looks like despite, my 5 star review, they didn't send out whichever free gift they were promising.  So I won't be able to share what exactly they were bribing reviews with.  Do yourself a favor and stay away from these H.264 pieces of junk.  Your maximum character limit for a password on one of these devices is 7 characters.  If you enter more than that, you'll have to reset your camera to be able to access it again.>Warning, I'd really rate this cam a 2 star but read comments below to find out why I put 5 stars.Let's see... I guess it depends on how you want to use this.  It works fine in IE and with it's included software.  If you intend to view this on an Android phone, think again.  Ipcam viewer Lite/Pro can't use the send audio feature on this cam, and receiving audio is only in the Pro(paid) version. Worse, if your app can't use the rtsp stream (H.264) than you will be using the HTTP stream which seems to get less that 1/fps. Google it, many people are having this problem (it doesn't matter if it's connected wireless or wired, on the local lan or over the web). TinyCam Monitor Pro can't receive audio or send audio and you will have to find a camera profile that uses a similar HTTP feed. Again, you will get less than 1/fps since these programs cannot access the rtsp stream.Esky does have an android app that is not on the market, you have to download it from their link. I haven't tried it because they force you to register for an account with them and I don't believe there app will work with my other 3 cameras (non-Esky) that I have in the house. I do not want to use 2 different apps on my phone to access all of my cameras.Blue Iris can access the rtsp stream and gets up to 30fps. I was able to use the PTZ functionality of the cam but the commands seemed to lag. The audio functions would not work.Now here is the best part.  In my box, there was a card for a \"rewards\" program.  If I put up a five star review on Amazon or Ebay, they will send me a free gift \"I'm sure to like\".  Bribes?  I googled and could not find out what the \"reward\" is.Also, I have updated the firmware to the latest one available.  The cam seems to reset itself alot and when I have it hooked up wirelessly, the framerates from the the other cams on my network (both wireless and wired) seem to drop very low whenever I access this cam's http stream.  My network is a 1000mbps network with 1 router, 1 x 1 gigabit switch.Bottom line,  most apps are not compatible with the new H.264 cams.  If you want to be a beta tester and wait for this functionality to be implemented in other applications then get this cam.  If you only need one cam in your home and you don't mind using IE to access your cams features, this cam will work for your needs as well.", "Date": "July 14, 2012"}], "ProductInfo": {"Price": "$59.99", "Features": "Esky C5900 H.264 IP Camera,Local Micro SD card storage\nPan/Tilt remote control ,2-way audio,night vision\nInternet WiFi Wireless/Wired\nIR cut,Support Mac/Windows/Linux\nBuild-in DVR ,Motion triggered", "Name": "Esky C5900 White H.264 Wireless DDNS WiFI IR-cut IP Camera Pan/Tilt 2-ways Audio LED night vision CCTV security monitor built-in microphone and speaker Mobile (iPhone Android Symbian OS Windows Phone7) Viewing Support Micro SD Card Slot Store Video", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2BSMMr2CTL._SX300_.jpg", "ProductID": "B006W4X51Y"}}