{"Reviews": [{"Title": "great for 6 months, Good warranty though", "Author": "aman245", "ReviewID": "R3V3W3BMD85ITH", "Overall": "4.0", "Content": "getting the high quality camera is DEFINETLY worth the extra couple bucks. The pictures are so clear, and there arent very many false triggers. Ive caught 8 Bucks on this camera, in the course of a couple of months!Lets just say, i know my hunting spot this year!Absolutely GREAT camers. the batteries last a LONG time. I havent had it long enough for the batteries to die yet. still have the first set of betteries i put in there! and i bought this back in march! (current date 8/21)The other thing i love about this, is that the operation of it is simple. Set the date / time, the format in which youd like the captures (video, 3pic,1pic) then choose high quality or low quality, and youre set! put it in the tree and youre done!I LOVE THIS CAMERA!UPDATE!!! 10/30/13I just pulled down the camera from being in the woods for just another month. ABSOLUTELY DISAPPOINTED. The camera has WATER on the inside! The camera turns on. but will not function at all. The digital display on the inside turns on, and the infared lights are constantly on. No solution. The camera is now a gonner. $100 down the drain.Who would have thought, a camera meant to be in the weather, failed at its one and only job. To keep the weather out.Im going to check with the simmons company, and see if they have some sort of warrenty, or even just pay them to fix it. (assuming its fixable for less than the cost of a new one.)IF YOU BUY, MAKE SURE YOU BUY A SECURITY BOX TO GO AROUND IT. THAT SHOULD KEEP OUT THE MOISTURE.UPDATE 1/22/14After a short phonecall with the \"simmons\" representive, I found that This camera has a Complete 2 Year factory warranty on it from BUSHNELL. All i had to do was ship it to them, plus $10 to ship it back, and they just replaced my camera.Like i said earlier, I did get a security box for it. We will see how that helps.P.S. It is near impossible to find a good fitting box for cameras this size. I wound up getting a box that was too big, and had an open face to it, and modifying it.If anyone on here has found a properly fitting security box, please comment the link. It would be greatly appreciated.", "Date": "August 21, 2013"}, {"Title": "had two of the previous model 6mp and now bought this one", "Author": "Northwoods Huntin Geek", "ReviewID": "R2TVLLEIIVJBRT", "Overall": "5.0", "Content": "I think it takes great pictures night and day.  It does not have a real fast shutter speed so fast moving deer are blurry.  Battery life seems excellent.  I have only had it in the woods for about six weeks.  I posted some pics from then.  It is not the best location, but it is on the edge of a swamp where deer go to bed down.  It is also facing west which is not recommended and it still is doing a great job.  I tested it in the yard this spring as our security cam and it worked without a flaw and took over 4400 pics on same set of batteries (generic) starting in March in Wisconsin so temps were as low as 10 degrees at night.  I really liked the old design, this one is smaller and works perfectly with the Masterlock python lock.  This will at least keep the honest people honest.  I will post more pictures when I check it again.", "Date": "September 7, 2013"}, {"Title": "Caught Ya!!!!", "Author": "Rita Kowalczyk", "ReviewID": "R2RKKKL960GC25", "Overall": "5.0", "Content": "From the first night we set it up it has worked perfectly every time.  We caught sight of 2 raccoons visiting our porch each night!  We were able to trap one of them and relocated him about 15 miles away!  We are still waiting for the second one to return to trap it.  Each night the Simmons Whitetail Trail Camera works perfectly.  You can't even tell unless you are looking at it that it is actually taking a picture.  A grouping of red lights are the only way you can tell it is taking a picture and it isn't enough to notice!!!!  Fantastic product.", "Date": "September 11, 2013"}, {"Title": "Great Device for Rural Enjoyment", "Author": "P. trainor", "ReviewID": "R3GNY07UFW7VKB", "Overall": "4.0", "Content": "Have set this up near our bird feeders at night and I have gotten photos of every night animal in the forest except birds Clarity is great.", "Date": "March 9, 2013"}, {"Title": "What Critters visited your place last night?", "Author": "Stan \"sos57\"", "ReviewID": "R3P09B5E24VKAS", "Overall": "4.0", "Content": "We bought this to get pictures of the deer coming to our yard. Setup was easy and fast. The pictures are very good. Getting the distance and coverage area right was harder. But it gave many pictures of our wildlife, including deer, fawns, raccoons, rabbits, a skunk and even a couple of fox.", "Date": "August 6, 2013"}, {"Title": "Depth of field is excellent", "Author": "Marty  E", "ReviewID": "R2GU3HMKSGPFB", "Overall": "5.0", "Content": "This camera works very good, I set it up on my house looking down the driveway into the street. I set it to take three photos at a time, all of the photos were clear and in focus. The depth of field is excellent, I got an in focus photo from the camera to as far as it could see which is about 400 feet to the house a block away. I am using a 32 gig memory card and never even got close to filling it up. I think it would take about 32,000 photos to fill the card. Each photo is 1 megabyte. I am going to buy another one for the back of my house and use them as a security system to see what is going on when I am asleep or away from home. No one will ever notice them or even think to look for a camera in a tree or some place with a good field of view. I highly recommend this camera.", "Date": "December 26, 2013"}, {"Title": "very small and compact", "Author": "Michael \"michael k.\"", "ReviewID": "R2T79INT1ACHLY", "Overall": "4.0", "Content": "Very small and compact. have only used two weekends and it did much better than my old one.I like the fact that it only takes four double AA batteries. i used enloop rechargeable,", "Date": "September 18, 2013"}, {"Title": "Deer cam", "Author": "Joanne Malott", "ReviewID": "R1QFJWM6IGN2VI", "Overall": "4.0", "Content": "It is exactly what I wanted, and it arrived on time for Christmas...thanks. My hubby was very surprised and excited.", "Date": "January 11, 2013"}, {"Title": "average", "Author": "martin", "ReviewID": "RONHOEI5765G5", "Overall": "3.0", "Content": "so far this camera needs complete dark, any light causes backflash to show on pictures, good pictures if there is no outside light source close by.  I had mine pointed toward my house and we have a light on the porch that we had to turn off at night to get good pictures.", "Date": "April 13, 2014"}, {"Title": "Great camera", "Author": "James C. Showalter", "ReviewID": "R3IBKCZ3YK4126", "Overall": "4.0", "Content": "Very high quality pics and videos.  I did not realize how many bears were visiting my bird feeder.  Great camera.", "Date": "April 13, 2014"}, {"Title": "Good budget unit.", "Author": "Scott The Rock", "ReviewID": "R2MVBEBWID608W", "Overall": "3.0", "Content": "The IR is bright on the picture/video if it's anywhere near the ground. Keep it up at least 3 feet when you secure it. Also I don't like the minimum delay once motion sensor trips is 5 seconds for the video to start.  Racoons easily walk through the range in less then that for example, so you get blank video or just a tail.", "Date": "March 22, 2014"}, {"Title": "Good video and pictures", "Author": "java2", "ReviewID": "RZCFHEGVAIL62", "Overall": "3.0", "Content": "The only thing I did not like was the time delay in the picture and video.  The shortest time delay you can set is 5 seconds.  Why is there a delay at all or why not Zero.", "Date": "March 19, 2014"}, {"Title": "Simmons Whitetail Trail Camera", "Author": "Tiger", "ReviewID": "R182562MVUTPI5", "Overall": "3.0", "Content": "I am somewhat disappointed with this camera.It takes good pictures, when it takes a picture that is.The delay is such that most of the time it takes a nice picture of nothing.Especially small game at night. If you need a camera that will catch small game such as raccoons or foxes at night,this may not be the camera for you. By the time it takes a picture the game is out of the field of view.It will not detect any movement at night from a distance of more than about 8 to 10 feet.In the daytime it seems to work fine, but that is not what i bought it for.", "Date": "March 16, 2014"}, {"Title": "Does a good job", "Author": "Joseph Roberts", "ReviewID": "RW49L122J5TZV", "Overall": "4.0", "Content": "We purchased this unit to catch what dogs are do-doin' on our lawn with out the owner picking it up.It works great. Good quality and clear, zooming pictures. Great survailance", "Date": "March 15, 2014"}, {"Title": "Easy to use", "Author": "JerryA", "ReviewID": "R2CRPGTLYU1EQ8", "Overall": "5.0", "Content": "Works just fine.  Do note however, the low limit operating range is 15 degrees F and this winter many many nights are below 15 F here.", "Date": "March 6, 2014"}, {"Title": "Great purchase.", "Author": "courtney", "ReviewID": "R2QK44LADRCU6", "Overall": "4.0", "Content": "Pictures are clear and precise. We bought this to catch a thief. I'm able to zoom in on the pictures and still get a good idea of what's in a persons hand. The pictures taken at night are just as good as far as being clear. We love these cameras.", "Date": "February 11, 2014"}, {"Title": "Good camera", "Author": "JB", "ReviewID": "R3HZVFNVUAQRWP", "Overall": "4.0", "Content": "This is a good camera for the price you pay.  Day time pics are great.  Night time pics are not great but for the price, I can put up with it.  The only problem is the IR lights are not very bright so unless the game is close to the camera, you will get eyes only.", "Date": "February 9, 2014"}, {"Title": "wildlife camera", "Author": "Ronald A. Cook", "ReviewID": "R2S8AKNHLCH99M", "Overall": "4.0", "Content": "It was stated the batteries would last 6 mos, not true about 2 weeks. This camera does not have and exterior port to plug in an accessory power source.", "Date": "January 28, 2014"}, {"Title": "Poor quality", "Author": "Rob Ruley", "ReviewID": "R3J7XIJ63PQ61L", "Overall": "2.0", "Content": "Quality could be a lot better . Bad picture. Needs more options and maybe a u s b port would be good", "Date": "January 4, 2014"}, {"Title": "As expected at this price point...", "Author": "russell crull", "ReviewID": "RZIVQS4TLQWUK", "Overall": "3.0", "Content": "Not stellar....slow trigger speed and poor picture quality at dawn and dusk hours when between day and night modes.  Adequate for the money, great daylight pics for sure. Good secondary camera.", "Date": "December 30, 2013"}, {"Title": "so much fun", "Author": "Waianaegal", "ReviewID": "R2OPWBMG76GZD", "Overall": "5.0", "Content": "ok... this may be for hunters... however those of us who live out in the country will love this type of camera also.  I have deer, turkey, raccoons, and of course dogs and cats... who roam by my camera. I've just had to figure out what is the best location. I was really amazed at how good the day time pictures are. If I'm only interested in what's out there at night the setting has to be at the higher definition setting.I am really enjoying the surprise of \"what's on the memory card today\"... or I'll go a few days but then depending on location I'll get the family dog in on the action also.It's a great camera, I love seeing the wild life around my property and I'm sure spring will bring more sightings of some great wild life.", "Date": "December 27, 2013"}, {"Title": "Great camera", "Author": "D. Peden", "ReviewID": "R36GIK5B6CDY75", "Overall": "5.0", "Content": "I set this up in my backyard, which borders a wooded area. I've got nice shots of the \"night life\", from big bucks to coyote. The images are much clearer than I'd expected. I've used it continuously for 3 weeks now without changing the batteries. It is sturdy, easy to set up, and works great.", "Date": "December 16, 2013"}, {"Title": "It is very easy to use and picture quality is great", "Author": "Roxie", "ReviewID": "RMIHDZCMAHWNG", "Overall": "5.0", "Content": "This was a birthday present for my husband.  It is very easy to use and picture quality is great.  We are both enjoying the pictures we find on the camera.", "Date": "December 12, 2013"}, {"Title": "Good value.", "Author": "jncts", "ReviewID": "R1CUPIIFZNVYYS", "Overall": "4.0", "Content": "I researched and reviewed many makes and models.  I purchased this because of price-point for function. It works as advertised and takes good pictures.  Night shots are somewhat limited to about 30 feet.  Day shots are excellent.  I consider it to be a good value for the money.", "Date": "October 12, 2013"}, {"Title": "Good for large mameas, hard to get the range for smaller ones", "Author": "B. Daniel", "ReviewID": "R2J3AW9KHMPJ85", "Overall": "4.0", "Content": "It was purchased to monitor feral colonies and nest boxes. It was difficult to get the range on these small animals but for larger mamals it was fine, It did decent vidio clips of nest boxes and other things in daylight and the color was alright. In our situation, it was important to see the ears of the ferals, the infra red did good in the range it was suppose to.", "Date": "April 26, 2014"}, {"Title": "Takes good pictures", "Author": "blkoyle", "ReviewID": "RYOSNK8KLXFY1", "Overall": "4.0", "Content": "It takes good pictures as long as you have it placed properly.  At night, if there is a tree/bush close in proximity to the \"flash\", it has a harder time getting the movement/animal as it focuses on that tree/bush.  Takes great daytime pictures.", "Date": "February 8, 2014"}, {"Title": "He loved it", "Author": "Tweediaflower", "ReviewID": "R1XNAGXZ9PJ12M", "Overall": "5.0", "Content": "My boyfriend wanted a trail cam for his birthday. We researched our choices and decided on this one. It is small enough to be unobtrusive, yet it takes clear shots, even night time shots.", "Date": "January 28, 2014"}, {"Title": "Very good camera for the money (in fact, for me more $ would not have improved my experience)", "Author": "Bob M", "ReviewID": "R3B86WRORTH95G", "Overall": "5.0", "Content": "I've had the camera running for over a month.  It is on its original set of batteries.  It was very easy and straightforward to set up.  The Off/On switch inside makes it easy to turn off during periods when you don't want photos taken (working on the brush in front of the camera for example). The daylight photos have intense color and great detail.  The flash photos are a bit washed out sometimes when subject is within ten feet of camera.  Camera is small and very unobtrusive and light weight. I mounted it using the tripod screw mount on the bottom which seems to be rugged and rigid.  Flash is hardly noticeable.  A great buy, I think.", "Date": "November 23, 2013"}, {"Title": "Captured a Rabbit", "Author": "Curtis A. Schroeder", "ReviewID": "R3JLKJE6HGGFQ2", "Overall": "4.0", "Content": "Camera worked as advertised, no problems. My goal was to catch a photo of a deer eating my flowers; turns out it was a rabbit!", "Date": "November 20, 2013"}, {"Title": "Great camera", "Author": "Gregory Mccarty", "ReviewID": "RMFOROZYO1RC8", "Overall": "5.0", "Content": "I love this camera. The photo quality is great, the range is very good. The night vision works so much better than I would have expected.", "Date": "November 13, 2013"}, {"Title": "Love this trail camera", "Author": "butterfly \"me\"", "ReviewID": "R2QBR9Z1J07HVT", "Overall": "5.0", "Content": "This takes excellent picture, I would highly recommend this trail camera to anyone :) Im very happy with the quality , I havent gotten a night-vision shot so not sure about that yet!Update!!!! This camera is excellent!! Takes great videos at night and is very clear!! Im so happy with this!Pictures are still awesome as well! Buy this camera... You wont regret it!", "Date": "November 11, 2013"}, {"Title": "never got one picture", "Author": "Alicia K. Kearney", "ReviewID": "R3G6K17RENX12Y", "Overall": "2.0", "Content": "The shutter speed on this camera is so slow it would only work with an animal who walked into view and stopped. Might work with a bait station, but I wanted a camera to photograph local wildlife and all I ever got was empty frames.", "Date": "October 31, 2013"}, {"Title": "Excellent photos/movies", "Author": "T. Brogan", "ReviewID": "R28SKMNXDCHYWB", "Overall": "5.0", "Content": "I've only had it up 2 days now and I think I have it in a bad spot, so I haven't caught anything but leaves and birds, but the photo quality is excellent, better than my camera!Haven't caught any night time pics yet.Fairly easy to use once you look at the manual to figure out what the abbreviations means.", "Date": "October 28, 2013"}, {"Title": "Camera has been inconsistant", "Author": "John Hale", "ReviewID": "R3DFV6JNYKCTUG", "Overall": "3.0", "Content": "I like the size and minimum battery requirements of this camera.  It seems like I am only getting a fraction of the videos I had picked up with my previous camera in the same location.  I am still experimenting with the camera settings.", "Date": "October 23, 2013"}, {"Title": "great camera", "Author": "hunterjon1728", "ReviewID": "R3KO51A5FV1MR", "Overall": "5.0", "Content": "blows away my cuddi bac and my recon just ordered 3  more if u hunt,u will love this camera day or night this lil guy is all of that !", "Date": "September 26, 2013"}, {"Title": "Old Texas Gal", "Author": "Royce \"Old Texas Gal\"", "ReviewID": "R17FKCRISF3QJP", "Overall": "5.0", "Content": "It took a bit of trial and error (we aren't very electronically savvy), but we now have great pictures of two raccoons that come by our house regularly to take off the lid to our metal trash can, climb inside, and eat the dog food we keep there for them!We are now experimenting with the timing delay to get a shot of them taking off the lid.  Perhaps even a video?!", "Date": "August 20, 2013"}, {"Title": "Don't waste your money!", "Author": "Russell F.", "ReviewID": "R11L1C39NNHFO5", "Overall": "1.0", "Content": "This is my first game cam purchase and I was not able to find any reviews on this so I took a chance. With the picture settings on high(6mp) you can not make out anything about the subject you are looking at in the picture. It is blurry and the pic is so grainy, you might as well have traced out a picture with a piece of paper and pencil. The manufacturer claims the motion sensor will detect motion out to 40ft, I could not get it to trigger a shot any further out than about 20-25 ft. I am returning this as I write.", "Date": "June 7, 2013"}, {"Title": "one bad one good", "Author": "Todd", "ReviewID": "RCCFCM4D2W7YW", "Overall": "3.0", "Content": "The initial camera I received had to be sent back due to the fact it was taking non stop pictures.  I returned and got new one that seems to be working although with limited trial.", "Date": "December 10, 2012"}], "ProductInfo": {"Price": "$151.95", "Features": "5MP or 6MP high quality full color resolution; 640x480 video day or night\nSuper simple LCD setup screen; date and time stamp on images\nInfrared night vision LEDs that are virtually invisible to game; 18 low glow LEDs -- 40 ft. range\nMotion-activated PIR sensor has a range of up to 30 feet\n6-month battery life; requires 4 AA batteries and a SD card up to 32GB (user supplied)", "Name": "Simmons Whitetail Trail Camera with Night Vision (6MP)", "ImgURL": "http://ecx.images-amazon.com/images/I/41Ws3mh13iL._SY300_.jpg", "ProductID": "B006U0Z76Q"}}