{"Reviews": [{"Title": "junk just junk run away", "Author": "leamy", "ReviewID": "R2EOJCU2OF664O", "Overall": "1.0", "Content": "menus are unusablelocks upvideo SUCKSsomething as simple as playback last nights recording take 11 clicks on remote toget to play the video no time on screen and video is so dark u can not see anything 15 feet outI purchased as a backup to the older unit that works correctly just has to many hours on it.but what should you expect for 90 bucks from chinamaybe I should whack myself each time I buy cheap Chinese electronics and then wonder why theydon't work correctly..QUICK UPDATE JUST INSTALLED THE 199.00 CIB DVRworks great! awesome pic menus are greatCIB J960N08 960H HDMI High Resolution 8 CH Network Security Surveillance DVR", "Date": "August 31, 2013"}, {"Title": "Dead after one year", "Author": "Amazon Customer", "ReviewID": "R3GII1E11P46H5", "Overall": "1.0", "Content": "Upgraded to this model about a year ago from a 4 channel. Seemed to work fine for the year. Would randomly reboot but always came back. Yesterday it quit and won't power back on. Checked power supply voltage which was fine. It has no power switch and the leds on the mainboard come on. Hdd is fine. PCB is toast.  Always kept it on a surge protector and I live in an area that really doesn't have weather so no lightning or moisture. These DVRs never get any firmware updates. UI was cumbersome but that's relatively normal for most of these cheap dvrs. Won't be giving zmodo any more business.", "Date": "August 29, 2013"}, {"Title": "Network setup tricky to get set up and running.", "Author": "Paul R. Lusk", "ReviewID": "R2GK09KUCZXZNP", "Overall": "4.0", "Content": "Can be a little tricky to set it up for network use.  Had to open up ports in my firewall for it to work.", "Date": "November 8, 2013"}, {"Title": "This DVR is horrible!", "Author": "J. C", "ReviewID": "R39ZWHA8YCIQ2B", "Overall": "1.0", "Content": "I recently got the 4 channel CIB DVR and wanted to upgrade to an 8 channel DVR. The ZMODO was lower price so I thought I would give it a try. Connecting the cameras was pretty straight forward but everything else afterwards was a mess. The configuration menu is horrible. You actually need the remote control to set the IP of the DVR. The password for admin and user don't work. Resetting it also doesn't work. The client software doesn't look like you can manage the DVR from a computer. I've setup quite a few surveillance DVRs and this is by far the most frustrating. What a piece of junk. Just pay for the CIB DVR and save yourself a lot of headaches.", "Date": "August 21, 2013"}, {"Title": "Do Not Buy !", "Author": "JS \"Independent Facilitator\"", "ReviewID": "R35O5QK9WW6MZ", "Overall": "1.0", "Content": "This piece of garbage stopped working out of the blue for no reason at all. It, also, fried my router............ Nothing but cheap junk made in China, just like everything else.", "Date": "May 27, 2013"}, {"Title": "JUNK!", "Author": "P. harty", "ReviewID": "R3NQG55BZXAED8", "Overall": "1.0", "Content": "Sorry but this item is absolute junk! The UI is terrible. The unit came without housing screws? the software mini disc is a combination of RAR files and other files? so to open or save them is just stupid? its a very easy setup for the cameras and the hard drive. However when you get to the Network setup It is just plain horrendous! After just a few minutes I realized just how crappy this product was and boxed it back up to return! I am just going back to my Winbook DVR STAY AWAY FROM ZMODO! This is a terrible excuse for a security DVR!", "Date": "August 16, 2013"}, {"Title": "Bad Quality", "Author": "Metuchenreview", "ReviewID": "R1HNNHTQ5O3W70", "Overall": "1.0", "Content": "Very poor quality product. Purchased a DVR unit which never worked and had to replaced with DVR 8114HV, which also stopped sending a signal to the monitor after a year, exactly when the warranty ran out. Tech Support suggested buying a new power adapter when there is no way to tell if even that will help fix the problem", "Date": "February 22, 2014"}, {"Title": "Bad quality control for these units", "Author": "Suburban Pro Studios", "ReviewID": "R3VH98O29UPN5T", "Overall": "1.0", "Content": "I had previously purchased one of these units for use in my business, but ended up having to replace my unit as mine original was taken for evidence in a crime. I immediately purchased a replacement as I was happy with my initial system. Two units later I'm giving up on these as the quality control is terrible.I've just received two units in a row that won't recognize their hard drives consistently. Removing the hard drive shows that it works fine in a computer, but as soon as its back in the DVR its unrecognizable after a restart. I am able to format the drive inside the DVR and it begins recording, but as soon as I power cycle the unit the troubles begin again.Same problem twice leads me to believe that the units aren't well made. Leaving my business security in jeopardy is unacceptable and I'll be moving on to a different company for my needs.", "Date": "February 10, 2014"}, {"Title": "I recommend.", "Author": "griffinhalves", "ReviewID": "R1VOKGDXL4DMCO", "Overall": "5.0", "Content": "My first onw died after 2 years I bought another one without the hard drive and I used  my hard drive. It works great.", "Date": "February 1, 2014"}, {"Title": "surveillance DVR", "Author": "Larry Wade", "ReviewID": "RKWXY2W9XW0N", "Overall": "3.0", "Content": "I like it for the clarity of the picture but I wish they would put a hard drive in the model I order because it is a pain to find the best hard drive for it. my next one will have the h-d or I won't buy it.", "Date": "January 7, 2014"}, {"Title": "Recievied not working", "Author": "frederick h buchler", "ReviewID": "R2VE4U7V9M14B4", "Overall": "1.0", "Content": "I know this happens but being QC tested and sold is not good. I do not know what happened with the building of the unit. but do know it was shipped none functional. I wish they wouls just send a new one and let me ship this one back ASAP. but I have to wait 2 days for lables to return then wait to see if they ship a new unit.", "Date": "January 4, 2014"}, {"Title": "Not user friendly", "Author": "Michael C", "ReviewID": "R3O3UYEI0NHOJ1", "Overall": "1.0", "Content": "Mouse control constantly looses connection.I set it on 4 camera view, and it constantly changes on its on.Will buy a different brand.", "Date": "December 26, 2013"}, {"Title": "POS", "Author": "Clark Dodson", "ReviewID": "R1NHCE166USL8Q", "Overall": "2.0", "Content": "My 2nd dvr...This one has operating issues...hd sometimes doesn't work due to bad board connection...and the viewing software sucks...downloaded several times and it just doesn't work.", "Date": "December 21, 2013"}, {"Title": "mr martin call me for more cameras set up", "Author": "Gregory Martin", "ReviewID": "RON44FP0Y2OM2", "Overall": "5.0", "Content": "I love it, still learning how to use it but its more than what I had expected im going to order more cameras thanks", "Date": "December 20, 2013"}, {"Title": "Good image quality, but lasted only one year.", "Author": "Alessandra", "ReviewID": "RO9MEM0FKETGF", "Overall": "3.0", "Content": "Last year I bought this DVR with 8 Cams and 500Gb HD. It is a very good product, quality images, internet view. But after 1 year it stopped working. I just bought another one but I hope this time i have a more durable product.", "Date": "December 10, 2013"}, {"Title": "Died after a year", "Author": "Jack", "ReviewID": "R1ULL3ZRR082FH", "Overall": "1.0", "Content": "DVR died after a year and two weeks, and Zmodo would not consider fixing under warranty even though it's been only two weeks since the warranty expired. Customer service doesn't give a s*** about their customers. Even though their products are cheaper, I will not buy Zmodo again- better to spend a bit more money and have better quality that will last longer.", "Date": "September 10, 2013"}, {"Title": "Great item top of its class", "Author": "Johnny Christian", "ReviewID": "R5QFO7YLYEPBQ", "Overall": "5.0", "Content": "Great product as always. I will shop again. top quality item, great customer support and friendly tech help. very nice", "Date": "September 6, 2013"}, {"Title": "Great with some quick free fixes", "Author": "andrew \"PFC Brian\"", "ReviewID": "R16YS1ZBSMYCQ5", "Overall": "5.0", "Content": "Great DVR.  I added my own hard drive to it and have had no issues.  Very easy set up.  The mobile software they say to use wouldnt work with my PTZ cameras however i found out APLAYER works great with this DVR.  Computer software has some issue as well.  If you are using any OS past XP (7,8, Vista ) you will notice that the program will  not run right and will not let you log in.  Zmodo customer care said i would have to just use the internet explore to view the cams on a computer.  However if you are good with computers you still can use the software.  After install right click on the desktop icon and click properties then the Compatibility tab and check the box run in windows xp mode and check run as administrator.  That will allow you to use the software however everytime you run it it will ask you for permission to run.  Also your first time log in use the word \"root\" for user name and password will be what ever you set on the dvr itself.  Over all this DVR is great for the price.  If you have a old computer laying around save the Hard drive and use it on this DVR and save yourself some money.", "Date": "June 11, 2013"}, {"Title": "Love it!", "Author": "Kathy Ferguson", "ReviewID": "R3BMM5L6REED8H", "Overall": "5.0", "Content": "Better than I had expected for such a low price.  All information is straight forward to get it up and running.  I had purchased my own DVR hard drive and installed it, went to format and clicked - done!  Up and working in a very short time.", "Date": "September 10, 2013"}, {"Title": "great remote viewing", "Author": "Danny Newport \"......Danny\"", "ReviewID": "R3JOA29ID9A08T", "Overall": "5.0", "Content": "I like this DVR as I can view all my cameras via my phone.  The router needs set for the ports used but I can now view what is going on at home with my phone or computer.  my 1.5tb drive gives me about 3 weeks record time using 4 cameras.", "Date": "June 14, 2013"}, {"Title": "Home security system.", "Author": "GILFOYLE MASON", "ReviewID": "R2F5T9OTSV680X", "Overall": "5.0", "Content": "This DVR I needed to record all movements around the house. I would recommend this to all who have a home.", "Date": "December 20, 2013"}, {"Title": "It is Worth it!!", "Author": "B. O. \"Skinamo\"", "ReviewID": "RG68XBFW68MXX", "Overall": "5.0", "Content": "For the price I paid, this DVR is worth every penny. It does what I wanted and more. I am so pleased with this purchase that I have recommended it to my friends, some of whom have already seen mine and then went and ordered the same thing.You should get it, you'll be very glad you did.", "Date": "July 16, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007B5OZXU"}}