{"Reviews": [{"Title": "Great little DIY security system", "Author": "T. Bernard \"Dogsrule\"", "ReviewID": "R12522R3A2P1LF", "Overall": "5.0", "Content": "Not being a tech girl, I opted to find a wireless security system to allow viewing of outside my home. I didn't want to pay monthly charges for someone to do what I could do. This fits the bill. Plug it in to a power adapter and your set. Mount the camera where you want it, inside or out. I have had mine a little over 2 weeks, and you have the option to record motion only,certain times of day only or opt to record constantly. It does a great job, particularly during the day time. Night time, maybe if I had it installed outdoors it would pick up further, but for now, it is on my patio and picks up about 25-30 ft at night, I think it is due to the infrared reflecting off the screened patio. Daytime is pretty awesome. Can you tell what color someones eyes are, no. But you get the general description of the person or car, and the closer they get the better. I have had no issues like others complaining about the monitor having to be right next to the camera or missed recording. I have moved mine throughout the house and it works fine. Stucco walls. Read some reviews at Best Buy and they have mostly good things to say about it, like picking up from a barn. I picked mine up from HD just in case there was an issue I can look someone in the face or return it if need be. I did opt for a 16gb which I purchased and it records for about 3 days continuous and you can mark it to overwrite day after day as it fills up. I generally go in and view the files on my lap top, erase what I don't need and have 3-4 days of files. I got mine due to recent burglaries in the area, and without some kind of description around here, your case goes to the trash bin. You get a cd/cable to use with SKYPE to monitor from you phone or office computer. I am very pleased with it and will be purchasing a additional camera soon. You do have to place this near a receptacle, hence why mine is indoors on the patio. About 6 ft comes with it, or you can special order a 15ft. No interference from my cordless phone about a foot away. No interference from by cable modem or internet. I constantly get 5 bars for signal strength. With the 2 gb that comes with it, you can record about 4 hrs straight and then it is full or you can set to overwrite and it will keep going. I use the 2gb as a temp while reviewing the files on my 16 gb. You can speak to people via the camera without opening your door to strangers. Just press a button on back of monitor and ask what they want, release for them to speak and then push to talk back. I turned the beeps off that alert for motion detected, but you can leave it to attract your attention. Monitor comes with wall mount or as a picture stand. It has built in photos, 5 of them, that you can set to make it look like a picture frame instead of viewing whats recorded. For the price, you get quite a bang for your buck. At least I think so. Also the price listed on Amazon is one of the best I have seen so far for this unit.", "Date": "October 4, 2012"}, {"Title": "Product & Customer Service are Terrible", "Author": "-pi- \"Patricia Ann Ingram\"", "ReviewID": "R1V8G977LD6X0X", "Overall": "1.0", "Content": "I purchased this Security Camera system 07/21/12. I received the package 07/24/12. I had no problem setting it up as instructions indicated. I liked the Monitor because I could keep an eye on everything out my front door all the way to the street, including my car and front steps and still watch TV. On 07/25/12 I pulled the SD card and watched all the videos that I set up under Motion Detection, but realized it had recorded me putting cat food out at 6:44 am, and an automobile driving by at 7:07 am; however, it did not record me walking down my steps, getting into my car and backing out of my driveway around 7:00 am. As someone had broken the locking gas cap off my car recently I need this camera to pick up anyone walking up to it or approaching my front steps. I called customer service that day (25th) and was 14th in line @ 1:14 pm. 9th in line @ 1:18 pm, 6th in line at 1:22 pm and 3rd in line @ 1:25 pm then a man came on and wanted my phone number and they would call me back. I told the man I wanted to hold because I did not believe they would call me back; he said he had no way of putting me back in the Que so I gave him my name and phone number. At 9:14 pm CST (I was going to bed) I received a return call. After explaining what was wrong the man said he would replace the camera but he would need to send me an email telling me all the information they would need and I would have to send them a copy of my sales receipt. I told him that was no problem. I did not receive an email from him. I called them back the morning of the 26th, left my number for a return call and was called back in approximately 2 hours. I once again explained what was happening with the camera not recording properly and that I had not gotten the email. I received the email while this new man was on the phone. As of today I still have not heard back from the email I sent them on the 26th which means I will have to call them again and wait again for them to call me back and explain everything all over again. I guess I'm expecting too much to be able to call a company and get service or for a product to work as advertised. I do not recommend this company to purchase from.", "Date": "July 30, 2012"}, {"Title": "Doesnt record anything unless within 10ft of camera...", "Author": "Amazon Customer", "ReviewID": "R18HWHKXCQ0MNH", "Overall": "1.0", "Content": "Piece of junk, it wont record anything unless its within 10ft of the camera, did extensive testing over a couple hours.  Within 10ft it records fine, beyond 10ft and any movement, including my wife frantically waving her arms and jumping up an down, never triggered the recording feature, picture quality is poor, but for the price the picture quality wasn't the primary reason why I sent it back.  Really need the motion recording, but if it only records within 10ft of the camera its worthless to our family for any type of protection.Take Care.", "Date": "August 23, 2012"}, {"Title": "Just a Great Product", "Author": "TonyMontana", "ReviewID": "R3I5RV7F0XCQAS", "Overall": "5.0", "Content": "This product is great. The day and night view and very accurate. My camera records when motion is detected from approximately 20 feet, but does not include minor things (such as a bird flying or mosquitoes). Installation was about thirty minutes because I had to drill through concrete to get the camera's cord through my wall to plug in, but other than that it was very easy. The wireless feature is superb because I did not have to run wires through my attic or drill more holes in my house (something big to consider). Overall, I would highly recommend this and have already added a second camera. By the way, the power cord for the camera is about 7 feet, which is something I was hoping someone else would mention to take into consideration for the camera mounting location.", "Date": "October 21, 2012"}, {"Title": "Easy install and set up- but beware it interferes with WiFi", "Author": "Perry", "ReviewID": "R2HWKIL92Y6A1W", "Overall": "3.0", "Content": "The Lorex Digital Wireless Video Monitoring and Recording System is a nice product. It is easy to install, and very easy to set up. However, since I installed it my Wifi on my office computer does not work. I have had to hard wire (cat5) my PC to make it work. The interference is very bad. It cuts out the WiFi on a constant basis. If you have WiFi in your house, you need to be really careful where you locate the camera. Other PC's and tablets in the house are picking up Wifi ok, but their coverage range has been reduced. Lastly, the SKYPE for remote viewing is not easy to install. I have yet to get the USB driver to load; hence my remote viewing is not working at the moment. All in all a good product for the price, but you have to be aware of the pitfalls.", "Date": "October 4, 2012"}, {"Title": "Customer / Tech Service is Horrible", "Author": "Kathi", "ReviewID": "R1349K1LRVIADT", "Overall": "1.0", "Content": "I wish I could give them a negative star rating.  I ordered the wireless monitoring system that records onto an SD card. Set up was fairly easy and it worked fine for 5 months then the monitor quit recording, I can still see the cameras on it but it won't record which was the main reason for the purchase.  After 3 calls to support, with an average of 20 minutes wait each time resulting in 3 promises of a call back from a higher ranked tech person, I'm ready to give up.  I've wasted too much of my time trying to get this sorted.  My unit is still on warranty and they have never called me back, they didn't even try.  I am now stuck with the defective monitor.  I DO NOT RECOMMEND ANY OF THEIR PRODUCTS AND WILL NEVER BUY FROM THEM AGAIN.  I wish I had gone with another brand.  So if you want a monitoring system that works short term, Lorex is for you, just pray that nothing goes wrong because they will do nothing for you.DO NOT BUY FROM LOREX!!!", "Date": "December 6, 2012"}, {"Title": "Junk Product 1 yr Warranty A Joke", "Author": "Things Forgotten", "ReviewID": "R2FLRNWY9E36ED", "Overall": "1.0", "Content": "Purchased Dec 14th 2012. Easy to setup and get working. 40 days later the Auto Record stopped functioning all together. The monitor still alerted of motion but no recording was occurring. Lorex tech support was not able to help and the tech needed to upgrade my ticket to someone smarter. 7 days later they never returned my call with help and are not replying to emails.AMAZON does stand behind what they sell though and issuing a full refund where the manufacturer would not help at all.Stay away from Lorex and their products.", "Date": "February 21, 2013"}, {"Title": "They don't work", "Author": "AZ", "ReviewID": "R1VQVXUFOKLIOS", "Overall": "1.0", "Content": "Since intsalling 4 wireless cameras about a year ago, 3 of them no longer work. I've tried every fix that they recommended and even had an electrician look at them.  Lorex does not have anyone to repair or remedy an issue on site so you're on your own to fix them. I'll be ripping this system out and having it professionally done.", "Date": "December 28, 2012"}, {"Title": "NOT SO GOOD - READ MY UPDATED REVIEW", "Author": "POLICE MILLENIA", "ReviewID": "R2TJ7RU76MCIJA", "Overall": "2.0", "Content": "So far I am really happy with this system. The only I have is that based off one of the product photos it showed two cameras so i thought it came with two. Only comes with one camera and to order 3 more will costs $375.00-$400.00.I BOUGHT MORE CAMERAS AND ANOTHER MONITOR. I HOOKED UP THE MAIN VIEWING CAMERAS TO A 42\" TV AND ITS AWESOME. IF YOU HAVE ONE CAMERA THAT DOESNT HAVE THE 5 BARS SIGNAL, BUT A CHEAP EXTENSION CORD FROM CHINA AND RELOCATE THE ANTENNA FROM THE CAMERA 20 FEET CLOSER. I REALLY LIKE THIS SYSTEM. I KIND OF WISH MORE THAN 4 CAMERAS COULD BE SET UP TO THE MAIN RECEIVER CONTROLLER. I OWN SIX CAMERAS AND TWO MONITORS.-------------------------------------------UPDATED  ***PLEASE READ***AFTER ABOUT 9 MTHS TWO OF MY CAMERAS ARE BAD WITHIN A WEEK PERIOD. ONE DOES NOT GO BACK TO COLOR AND NEEDS TO BE RETURNED AND A SECOND CAMERA IS FUZZY WITH LINES AT NIGHT TIME ONLY, BUT IF YOU TURN A LIGHT ON IT LOOKS PERFECT.SO I AM NOT HAPPY I HAVE TO UNINSTALL TWO CAMERAS AND MAIL THEM BACK AND THEN REINSTALL TWO CAMERAS AND WONDER HOW LONG THESE WILL LAST. MAYBE A LOT OF MONEY WASTED IF THESE CAMERAS DIE WITHIN A YEAR OR LESS SINCE I OWN SIX CAMERAS AND TWO MONITORS. I WOULD NOT RECOMMEND THIS SYSTEM ANYMORE.", "Date": "June 23, 2012"}, {"Title": "Stay away from Lorex!!", "Author": "Jessie \"Carol\"", "ReviewID": "R1UYAC7S8NS7YU", "Overall": "1.0", "Content": "We purchased a wireless camera system from Lorex in January of 2012 and less than a year after purchase the video recorder box is no longer working. The company is not available by phone and tech support is giving us the run around.  After a very long wait on the phone, I talked to a rep who took basic information and told me a tech support person would call me back today.  Later this evening I discovered an e-mail from Lorex support:  Thank you for contacting Lorex Support.  I am actively working to resolve this issue and will keep you apprised via email regarding the progress. If you have any additional information you would like to provide, please contact me via email, using the Incident Number in the subject line. You can also visit our support website for FAQ, manuals and troubleshooting tips under the following URL.[...]Support never even talked to me to find out what the problem is, so I know they are not working on it as indicated in the e-mail and they did not call me as promised. I also noticed on the website that my warranty information had been altered.  I registered our purchase date as 1/28/12 which is correct, but noted that it had been subsequently changed to 1/1/12 which would mean our warranty had expired, which it hasn't. I don't think the company is ethical and would not recommend purchasing anything from Lorex!", "Date": "January 3, 2013"}, {"Title": "A system that can't walk and chew gum at the same time.", "Author": "Khentiamentiu \"khentiamentiu\"", "ReviewID": "R3IJJ8SW8KB423", "Overall": "1.0", "Content": "This system is not acceptable for home security unless you never leave home. You can't view the security images remotely AND record images at the same time. If you view remotely, recording is blocked. If you want to record, you can't view remotely. This is a major flaw that the product information online neglected to mention. On top of that, the quality of the hardware is cheap: thin plastic, poorly conceived mounts, outdoor cameras that look like they couldn't last a year even in California weather.", "Date": "February 28, 2013"}, {"Title": "Works great with one minor issue", "Author": "Kindle Customer", "ReviewID": "R30I435796FAW4", "Overall": "5.0", "Content": "The system works as advertised.  I am happy with the system and would buy it again.  The camera can be hung from the ceiling which was a mandatory requirement for me.  The wireless camera of the competing system (Defender) did not appear to be capable of being hung from the ceiling.  The only minor negative issue I’ve found with the Lorex system is the volume cannot be changed when the motion detector has turned on the recording to the SD card.  The volume control can be changed at other times but not during a motion detection recording.  So if the volume is turned all the way down to silent (very unusual situation) and the motion detector turns on the recording (person is at the front door) then you (LED monitor location) cannot hear the person speaking at the front door (camera location) and you cannot change the volume to hear the person speaking.  You are forced (in this rare circumstance) to open the front door to hear the person speak to you.  One other issue that is really a tip, the microphone of the camera will not work (at all) if the protective film that covers the camera lens during shipping is not removed.  I tested the system before hanging it and thought the microphone in the camera was broken.  I finally took the protective film off and the audio system worked great.  I’ve had no interactions with Lorex technical support so I cannot comment on their support.", "Date": "March 9, 2013"}, {"Title": "GREAT FOR THE MONEY", "Author": "Kurtglo \"K. Michael\"", "ReviewID": "R2W8ZWUQKN6V2N", "Overall": "5.0", "Content": "Not sure as to why the negative reviews. I bought the complete outfit which includes the monitor for $189.00 here on Amazon. Now, I'm back buying a second camera. Works great during the night with good focus, etc. I have to agree with other buyers that the only draw back is  the short power cord but that's an easy fix- Solution: They make these things called y\"extension cords.\" My first camera I mounted it at my front door and the next one is going to be put on my back door. hey- our world is going to get more crazy and dangerous.  Especially if they come and take our second amendment away and we cannot protect ourselves. I want to know WHO's at my door knocking. I also like the idea of having the intercom as well. Could be louder but again, for the money I can't complain. Do yourself a favor and buy one!", "Date": "January 19, 2013"}, {"Title": "What an Amazing Camera!", "Author": "Janet Sanfeliz", "ReviewID": "RZZ75ZMH82HVF", "Overall": "5.0", "Content": "I spent a few months researching a camera to monitor my baby and I gotta say I chose the best one I'm sure in that price range. The quality is amazing without lights, the sensor allows me to know when my baby wakes up without looking at it all the time. The best part is that I'm able to put him to sleep upstairs and not have all the noise in the living room waking up.", "Date": "July 17, 2012"}, {"Title": "OK system overall, easy to set up", "Author": "M. F.", "ReviewID": "R1VO1I05YNT80X", "Overall": "3.0", "Content": "I purchased this system because it had good reviews. It is easy to install - wireless make it easier - and easy to operate. I included a third camera and so far, it works fine. One thing I had no idea was that the remote view - via Skype - only worked for 1 camera.Pros:easy to install and operate; SD makes it easier to watch recording in PCCons:Skype only works with one camera and requires a PC connected full time; if you use it via Skype, recording is not available (either one or the other). When motion detection is on, you have to hide the LCD, since it will active vieweing mode and disable the screen saver...", "Date": "March 5, 2013"}, {"Title": "It's OK.", "Author": "thanksbtg", "ReviewID": "R1V1XQ1WERGY7H", "Overall": "3.0", "Content": "I live in a very rural area, and the road in front of my house is the only one providing access to the few lots and homes adjacent to mine. Although there is very little traffic on the road, my wife and I feel safer when we're able to see what's happening outside when the dogs start barking. I decided on the Lorex system after reading the reviews for various monitoring systems. I wanted the recording capability to capture any road traffic. I positioned the two cameras at the edge of the front yard, expecting to be close enough to the road for the motion sensors to pick up motion caused ny traffic, while at the same time being close enough within range so the wireless signal can reach the monitor inside the house. The cameras must be just on the edge of their motion-sensing capability because sometime they capture the traffic and sometimes they don't. I'm keepng the system because I doubt if any other of these types of wireless systems are any better, but Lorex should work on improving the motion-sensing range.", "Date": "January 6, 2013"}, {"Title": "Not too bad.", "Author": "James A. McDonnell", "ReviewID": "RBS5G9LNP3XPC", "Overall": "3.0", "Content": "The camera and it's functions are great! The infrared is good to about 60 feet. Fast switch-over to IR as well.My problem is there are no extensions to the power cables. You have to custom build them yourself. The wall wart supplied with the unit is approximately 6 feet in length and has a non-standard connection which leaves you very little cable to properly install the unit and no choice of adapters to extend it with.", "Date": "March 6, 2013"}, {"Title": "Product stopped working within a few months of installing.", "Author": "HS", "ReviewID": "R2VNRIACA17EM7", "Overall": "1.0", "Content": "I installed this product at my in-laws house just a few months ago and it has already stopped working.  (Monitor stopped).", "Date": "February 18, 2013"}, {"Title": "KNOW what you are buying - BEFORE purchasing.", "Author": "Jeffrey \"MoleMen, Inc. now a TERMINIX Company\"", "ReviewID": "R1TZXNULCHS8QW", "Overall": "2.0", "Content": "Being a previous LOREX customer, I expected this newer model to be better and easier to operate, but to my surprise is had less features and was more difficult to operate than my \"OLD\"LOREX camera system which is still working at my business location.My problems with this particular model are as follows:  Add-on camera would not pickup even though another camera only several feet away was working fine;  to view recorded motion you have to pull the SD card and view via your computer, but on my old model you could check it on the 7 inch monitor;  the smart phone method to check on your camera has to go through a difficult and technical median with SKYPE.  Combine all these deficiency's and you have a security system not worth the money because with a little more investment you can get a much more advance and simplier system.  LOREX needs to dump these models and improve them even if they cost a little more.", "Date": "February 16, 2013"}, {"Title": "It works fine", "Author": "CLR in DC", "ReviewID": "RV7TQKMDO1YZ3", "Overall": "4.0", "Content": "I installed system using four cameras.  The cameras and receiver work together just fine.  I have worried a little because I was installing them on the outside of construction trailers and was worried about transmission through the metal sides of the trailers.  Three of the cameras came up just fine.The receiver could not see the fourth camera on the far side of the one of the trailers.  However, I was able to solve that problem by getting a 6-meter RP-SMA Extension Cable (typically used to relocated the antenna for wi-fi router)--cheap fix.  Using this cable, I was able to remove the antenna from the fourth camera and drag the cable (and antenna) nearer to the receiver's location.  Once the antenna was relocated, the camera came up with no problem.  I suspect that I could done the same thing with the antenna from the receiver for even moreflexibility/range.  If range is an issue, I would suspect that a \"powered/high gain antenna from the wi-fi world\" might help.My biggest complaint about the system is the documentation.  The documentation did not suggest moving the antenna to help solve transmission problem.  Of course, it did not provide information to help purchase the right cable, etc.  It would really nice if the manufacturer would work to determine if high-gain antenna, etc would help users.The other disappointment has been with the using the output of the system on an external monitor.  The system has a port for an external monitor and the company even provides a short cable (too short).  An extension RCA cables is a quick trip to Radio Shack.  It is even more annoying to have hunt down the note that using the external monitor disables the built-in monitor in buried in the trouble shooting section of the manual (as is the note about a five second delay in transferring to the external monitor, etc).  In order to have to two monitor locations, you will need two external monitors.  I haven't yet set up the two monitor, I worry that I have may to get a video splitter and amplifier to drive two monitors.  Again, the manufacturer could do a little testing provide guidance to customers.The remote control just barely works.  In order for the remote to work, it must be pointed directly at the receiver, not too far away, etc.  The system is really slow to response to the remote (or any commands via the on-board buttons).  However, it works.", "Date": "February 4, 2013"}, {"Title": "Very easy to install and the picture is great!", "Author": "samsmama", "ReviewID": "R2VR8X9QOZV9GB", "Overall": "5.0", "Content": "We got this system and thought it may be too hard for us to install, but my husband had it up in no time.  Once we turned on the monitor we had the pictures right away.  The instructions are very easy to follow.  We have only had for a couple weeks, but it seems great.  The picture is very clear even at night.  Love that you have an intercom so if someone is at the front door you would not have to open the door to speak to them.  The only bad part about that is, that you have to hit the talk button on the side of the monitor, so in our case we have a two story, I might be upstairs and the monitor is downstairs so I would need to carry it upstairs when I am going to work in the office for a little while.  It's not bad just will take some getting used to it.  Very happy with this system.", "Date": "January 8, 2013"}, {"Title": "It helped solve a problem", "Author": "Amazon Customer", "ReviewID": "R1M3WZ0GEU5U77", "Overall": "5.0", "Content": "We had some animals attacked in our back yard and wasn't sure if it was a bearcat or coyote. I purchased the system on line and received it just a day or so later. It was easy to install and set up. Within a week or so, the system recorded a coyote right up to our sliding door. The system's motion detector and recorder did exactly what it said it would do. The night vision was excellent and allowed us to clearly see the animal that it recorded. I would highly recommend this system.", "Date": "January 7, 2013"}, {"Title": "Great features with some Cons to be aware of", "Author": "PDBro", "ReviewID": "R39TV7WBF3NKO8", "Overall": "4.0", "Content": "Great set, camera has good quality and really good reception with the frame. Has all the features i wanted at a very low cost.Cons:- It comes with \"preloaded\" pictures if you want to use this a picture frame - the pictures are \"stock\" photos you can't customize. Go figure.- Camera isn't wide angle. Have in mind that if you use this as a doorbell entry intercom the field of view wont cover enough, unless of course you place it far enough - but then you start compromising the two-way audio.I wish the frame was able to operate on batteries so you can keep it move it the house.", "Date": "September 2, 2012"}, {"Title": "READ THIS BEFORE YOU BUY!!!", "Author": "KBF", "ReviewID": "R1IXZPI8WC81YJ", "Overall": "2.0", "Content": "I DID EXTENSIVE RESEARCH ON THIS PRODUCT AND FINALLY BROKE DOWN AND PURCHASED IT.  I READ OVER 100 REVIEWS AND RESEARCHED MULTIPLE VENDORS TO MAKE SURE IT WOULD WORK FOR MY SITUATION.  NONE OF THE REVIEWS STATED THAT IT WOULD NOT WORK IN A NORMAL HOUSE SETTING THROUGH MULTIPLE WALLS.  BOTTOM LINE IS THIS.........IF YOU WANT TO PLACE THE CAMERAS OUTSIDE AND THE MONITOR INSIDE IT CAN ONLY BE ABOUT 25 FEET APART AND NO MORE.  I HAVE MY TWO CAMERAS MOUNTED OUTSIDE OF THE GARAGE FACING MY DRIVEWAY AND THE MONITOR IS 57 FEET AWAY IN MY BEDROOM AND IT ONLY WORKS INTERMITTANTLY.  I CALLED LOREX TECH SUPPORT AND THE TECH SAID IT WILL NOT WORK VERY WELL UNLESS I HAVE A CLEAR LINE OF SITE BETWEEN THE CAMERAS AND MONITOR, EVEN THOUGH THEY ADVERTISE THAT IT WILL WORK UP TO 150 FEET.  HE BASICALLY TOLD ME TO BUY A WIRED SYSTEM BECAUSE IT WILL NOT WORK FURTHER THAN 25 FEET APART.  I AM EXTREMEMLY DISAPPOINTED BECAUSE IT HAS SOME NICE FEATURES.  DO NOT BUY THIS PRODUCT IF YOU PLAN ON USING IT FOR YOUR HOME AND IT WILL BE MORE THAN 25 FEET APART.", "Date": "March 12, 2013"}, {"Title": "Surprisingly not bad.", "Author": "Snowlion", "ReviewID": "R1D6X55G97L2ZC", "Overall": "4.0", "Content": "Never heard of this brand before, so I was a little bit apprehensive ordering it. But in a nutshell surprisingly good.It's a turn-key system - works out of the box with minimal tech knowledge. I was ordering it for my mother and wanteda simple system. Someone at the door (there's a pleasant beep from the frame) and she can look at the frame to see who it is.Now how could it be improved?1. the power wire from the wall socket to the camera could be longer. There's a connector and I think the total length is about 10ft. But 20-25 feet would be more reasonable and minimal cost to production. Had to go to radio shack and purchased a wire roll and spliced it.2. This product has a feature whereby you can display 1 of 5 pre-canned scenery images when the camera does not detect any motion. Now why not have an option to display personal photographs from the SD card. Or for that matter a blank screen.The image quality is ok. I tested it for about 5-6 ft but not more. The night vision (comes on automatically) is also good.The camera to frame distance was about 20 ft - good reception.Many people have complained about the customer service. I've had no reason to call them, so cannot verify that.In sum, it's a good product that works as advertised. If they address the above 2 issues - it would be a 5 starrer.", "Date": "January 2, 2013"}, {"Title": "Don't buy it!", "Author": "Amazon buyer HR", "ReviewID": "R2VC8R4FBAO42R", "Overall": "1.0", "Content": "Bought this system with high hopes, as it offered everything I was looking for. Sadly, I was disappointed. The recording function would not work. The customer service of Lorex was HORRIBLE! I was on hold for over an hour waiting to get help to figure out what was wrong with the recording. When someone finally came on the line I was placed back on hold three more times and the could not figure out what was wrong with it. He was also very hard to understand and was unwilling to help me with the form he emailed me to fill out to get the monitor replaced after I had been on hold so long. I returned it and do not recommend anyone purchasing this item for the simple fact of bad customer service. The returns process was great...thanks to Amazon, but I will never purchase another Lorex item. Trust me...just don't do it.", "Date": "May 26, 2013"}, {"Title": "Easy to install, work great", "Author": "Bostonsforme", "ReviewID": "R1DIPLPGIY4R3I", "Overall": "5.0", "Content": "Feeling safer already! Just installed two on my house and it was a snap. Simply screw the plate in and put the antennas on/plug them in. It really couldn't be easier. At first, I was getting 'NO SIGNAL' after install -- after reading how to pair them (easy, push a button on the camera!), they both turned on and worked flawlessly.  The image is very clear and I can see very far away.  I also like that they beep whenever someone approaches them.  PERFECTION. I wish the extra cameras were a little cheaper- thinking about expanding to four. Also, I saved myself $100 on the set by buying a LIKE NEW set from AMAZON WAREHOUSE DEALS.. It was PERFECT, and VERY happy to save so much simply because the box may have been opened. Everything was still wrapped up/intact. Just a hint for anyone wanting a 2 cam system but wanting to spend less than $299.", "Date": "April 27, 2013"}, {"Title": "Well worth the money", "Author": "Richard J.", "ReviewID": "R13WMEIG7RRGDO", "Overall": "5.0", "Content": "Great little camera system without spending thousands of dollars. I have no complaints about the motion detection. Some times cars 75ft away set off mine. People set it off at 30ft or so. I bought the four camera system and it's perfect. Don't know about tech support because the system is so easy to set up and operate there is no need for tech support.", "Date": "March 25, 2013"}, {"Title": "Easy install", "Author": "Art Utech", "ReviewID": "R2HT08FKOTG38S", "Overall": "5.0", "Content": "Installation instructions were very clear. The product was packaged well and everything worked as advertized. I am very happy with the product", "Date": "February 26, 2013"}, {"Title": "Works as advertised...", "Author": "Scott", "ReviewID": "R304P3AAXI0Q8S", "Overall": "3.0", "Content": "The system was easy enough to install.  Had to buy a high gain antenna for the cameras farthest outside behind a couple of brick walls.", "Date": "February 26, 2013"}, {"Title": "Customer Service STINKS!", "Author": "leslie Maniglia", "ReviewID": "RSHH4292BSFHT", "Overall": "2.0", "Content": "I purchased this item in November of 2012, after three months the monitor went black, I spent the better part of the day just trying to get through to customer service, when I finally got through an incident report was set up and I was to recieve a call back that day....never happened. I did get an email the next day asking for a copy of the invoice and buyer information which I promptly sent.  I was then sent a return email saying that they were actively working to resolve the issue and that I would be kept informed via email on the progress.  After a week with no further contact I called them back and was told that they had not gotten the information they had requested. The tale goes on from there but you get the picture.  As of this review I have yet to recieve a new monitor, if I were you I would look elswhere for a monitoring system.", "Date": "February 22, 2013"}, {"Title": "Lorex video", "Author": "TjsTreasures", "ReviewID": "R20K2HW7XVJ2LB", "Overall": "5.0", "Content": "Great Product!! The lorex wireless Video monitioring system works great and is very easy to use and a great price.Thank you", "Date": "February 16, 2013"}, {"Title": "Easy to install and works great", "Author": "cheybean", "ReviewID": "R1252Q2ZBNIUW8", "Overall": "4.0", "Content": "Had all four cameras up and positioned in less than 90 minutes, One of the cameras is on the garage about 70 feet from the reciever and had to go through three walls (line of sight), I still have three bars on the signal strength. I have been using it on quad record mode, it is working flawlessly. It is also very easy to play back recordings. I would have rated it a five star if the CD (software) was not broken during shipping. I e-mailed Lorex four days ago and have not heard from them about replacing it. I would and have recommended this product to others.", "Date": "December 19, 2012"}, {"Title": "lorex lw2711ac1", "Author": "Lau Kim Lon", "ReviewID": "R2142822UADTXA", "Overall": "4.0", "Content": "This lorex accessory camera is easily paired with the lorex lw 2311 system. The wireless signal to base  is good , adequate and powerful. The resolution is not high enough for fine detail identification but adequate for normal security monitoring and act as deterrent with motion detection and night vision. . It is easy to instal ( usually under roof eaves). Just make sure that you have power source nearby less than 2 m away otherwise you have to use extension.", "Date": "October 19, 2012"}, {"Title": "Lorex wireless camera system", "Author": "Richard L Wood", "ReviewID": "R2YH1VIIF7C02K", "Overall": "4.0", "Content": "System installed very easy and picture from camera is great.Only draw back is power lines from cameras are too short.who has a power receptacle within 4 to 6 ft away from the outside of your house", "Date": "December 26, 2012"}, {"Title": "Simple, easy to install but has limited range.", "Author": "MMPdel rio", "ReviewID": "R1GW6EY8EU1E32", "Overall": "3.0", "Content": "I purchased this product to use as a front door camera system.  I mounted one camera right over the front door and one under the eve overlooking the driveway.  The idea was to give us a view of who is coming up the sidewalk, record package delivery etc.  For some reason Amazon pairs this unit with a 32 GB San Disk SD card ( you know the section that says people who bought this also bought this) and you can purchase both items with one click.  Not sure why they paired this with a 32 GB as the unit will only support a 16GB so I had to go buy 16 GB.  Other than that the system is pure plug and play, literally!  You just mount the cameras turn on the monitor and it works right out of the box. You do need a 110 volt outlet within 8 feet of the camera as each camera has to be plugged in.  Pretty simple instructions allow you to customize the view and other options for your specific needs.  The audio feature is great.  It is loud and clear and in the motion sensor mode you actually hear the people walking up before you see them.The manufacturer claims that the camera to monitor range is 450 feet with a direct line of sight and 150 feet through walls.  It’s more like 50 feet when you mount the camera outside and view it in the house.  We were not able to place the monitor where we wanted to as the signal would fluctuate and lose the picture.All in all for the money and ease of installation it does the job.  If you are looking for a whole house systems with cameras at each corner of the house I would look at a hard wired system.", "Date": "June 4, 2013"}, {"Title": "Very Good and Easy to set up", "Author": "Amazon Customer", "ReviewID": "RODJHS8IWYKKN", "Overall": "5.0", "Content": "After reading all of the other reviews I was a little sceptically on purchasing this, but for the price, and with the wireless ease, (not much wiring to to do), I went ahead and bought this. It arrived in a plain brown wrapped package, as not to let everyone know you were going to be putting up security cameras, and after reading the instruction book (highly recommended), and testing the range of the wireless signal (also recommended as to not be putting unnecessary holes everywhere) to see where would be best for the monitor and cameras, (cameras went outside in a protected area as to not get too much weather exposure), I set about running the 110 power cables for the cameras, (the power cables could be about 2 or 3 feet longer), then powered up the monitor and I was up and running my small security system, after 30 or 45 min I had the Skype feature going for remote monitoring on my Android phone, (you can only view one camera, that's one part I didn't like), I did went ahead and bought the 32 GB memory card, it comes with a 4 GB one, the larger card lets you record longer and not have to worry about running out space as quickly, but I check all video that has been recorded daily. I say if you want a security monitoring system that's easy to setup and operate then this is the system for you.I plan on getting one or two more cameras later, this only comes with two cameras, four cameras max. Some other people have said that this interferes with their computer wireless systems, but I have had no problems with that what so ever.Very good product.", "Date": "May 24, 2013"}, {"Title": "A few issues so far...", "Author": "Deborah K. Dobbins \"~Triple D~\"", "ReviewID": "R2XLBQHBHMMADY", "Overall": "2.0", "Content": "I've only had this up and running for about a week now but so far there are a few issues I wanted to share with others considering this set.First off, the monitor is cheap and the picture is choppy. It does this with both cameras. My nearest one is only 16 feet away with a glass barrier so there is nothing blocking the antennas, it's just a cheap monitor. The picture quality is NOTHING like what the manufacturer has advertised here. My deciding factor in purchasing this set was because it came with a monitor so it would have been nice to have a nicer quality one for the price I paid.My second complaint is that the housing around the cameras is plastic. Really? Plastic?! This won't last more than 2 years max of outdoor weather (summer heat & winter cold).  Not to mention one hard hit with a rock by a kid or criminal and it will be toast.Finally, the skype feature, while a good idea, is difficult to get set up. You can't watch the monitor if you're in skype mode and you can't skype if you're in monitor mode and you can't access the recording features if you are at another location skyping. Also, there are several other \"you can't do this feature while your doing that\" surprises... such as If you are in quad mode you can't record anything.... which makes no sense at all.I will do a review update in a few more weeks after I've worked out some of the bugs or in this case, found more of the bugs. I cannot believe people are rating this system so high.", "Date": "April 24, 2013"}, {"Title": "Okay", "Author": "Hummingbird", "ReviewID": "R31C5UAEA20V1C", "Overall": "3.0", "Content": "It's okay as long as you don't try to do too much with it. It serves very well as a simple video/audio monitor for the front door so I know who is there and can speak with them. The auto record does not work for me because the breeze moves the shrubs and that keeps it recording constantly. Fortunately that feature can be turned off. Have not tried to use it remotely and probably won't bother.", "Date": "April 12, 2013"}, {"Title": "Almost Great", "Author": "Rdys", "ReviewID": "R27SAQEQPVN6U7", "Overall": "4.0", "Content": "The system sets up easy as pie. It does what it is supposed to do. It cycles thru the 4 cameras and you can see them on the monitor. Picture Quality is exceptable for this price range. I love the idea of the wireless cameras. We use them in a house so I don't know what the max range is. We have no reception issues, period.Now For the bad news !!!If you are going to use a remote view there are issues. The monitor has 2 outputs. 1 is a Combo TV/Video output. The other is a USB computer output. When using either the Lorex monitor does not work. It's not supposed to. I wish it did. Also, using the USB port only access' Camera #1. If you use Skype to Monitor online (Yes that works fine) You are stuck with only Camera #1 or you must install/configure a video card. With the video output you can use the 4 camera feature. You can do this with Skype but it may take a bit of tinkering, depending on your system. I used a couple of refurbished Dell desktops and a PCI video card (all purchased thru Amazon) be sure you have lots of RAM on your computer (Wouldn't hurt to upgrade that while you're doing all this stuff, never can have too much memory). The video quality suffers some via the video card.  The system works and I am able to check on an elderly parent who lives alone several times a day. Gives great piece of mind to the family. (They can all visit with her via video anytime they want from across the USA). If Lorex would do a firmware update to make this thing work 4 camera/USB, It would be a fantastic system. As it is it's only Great. Good bang for the buck ... I'd buy again.", "Date": "March 7, 2013"}, {"Title": "Great System", "Author": "Jar Head", "ReviewID": "R2JC6UQ6XSR6PV", "Overall": "5.0", "Content": "We were able to convert the porch light so that we could plug in, not only the camera, but also a second plug from an independent motion detector outside light.  I was fortunate that the initial installation of the porch light was controlled by a switch inside the house, of course, right next to the door leading outside.  I checked that line and fortunately it was \"an end of line switch,\" which means that the wall switch controlled just the outside porch light and nothing else.  I was able to take the outside porch light completely out and that left just the normal 3 wires - black white and green to which I attached an ordinary house double socket wall receptical.  Everything worked fine.  The outside of our house was structured so the top of the entrance way was shielded from the weather.  You may have to do your's  through the attic but that should not be a problem.  It's very easy to lead the plug-in wires from the camera and/or another outside light through small holes and close them up.2 hints that caused us slight delay:  at one point I put up 2 cameras to get more direction - that was a mistake - cameras need to be a minimum seperation of 15 feet.  The second minor problem was the voice did not work properly until we removed the film on the camera lens.  Both of these were pilot errors and had nothing to do with the quality of the product.  I have no idea why removing the film enhanced the two way communications.Overcoming pilot error, everything worked beautifully.  Buy an additional 16 GB SD Card for the receiver.", "Date": "March 4, 2013"}, {"Title": "Excellent product", "Author": "Ade", "ReviewID": "R21528NFJPMPS5", "Overall": "4.0", "Content": "I received this product on time and everything is as described. The installation was very easy and the pictures (day & night) are crystal clear. Setting up remote monitoring (the feature that prompted my purchase) was surprisingly easy. The product is excellent for it's price. The only draw back for me is the inability to record when connected to a computer for remote monitoring. The other problem is the inability to send email notification-understandable it is not an IP based device.I have been using this product now for nearly a month and it has all been one excitement to another. I have not found anything really wrong with this item. I have added some innovative ideas to better enjoy the product. My main interest of being able to record camera activities spurred me to find a way to accomplish this from my office. After connecting to the camera of my choice, I was able to record events via a shareware program that enables the recording of my computer screen. This shareware is called Camstudio ([...]. So in my perspective, I have achieved all my important objectives of purchasing this product. If you need instruction on how to setup and record camera actions remotely, let me know. Enjoy your product.", "Date": "February 28, 2013"}, {"Title": "Very Pleased", "Author": "TNT", "ReviewID": "RTG95X6NSD8DY", "Overall": "4.0", "Content": "This set is a great! easy to install and very compact! no need for an external DVR or a mountain or wires. the DVR screen is clean and blends in very easily. it can be mounted on the wall or on a tabletop and function as a picture if you wish! the inner com function would be great near a front door or room thats external from the main house. the quality is decent for both day and night, although the IR night vision does lack some clarity. I am very happy with this set, however, there are a few features  that i would have liked to see, such as: better picture quality in both day and night, recorded audio, better range, and reduce the lag when recording is set on motion. the last feature i would have liked to see would be an output from the DRV screen so it could be viewable from a TV. Nonetheless, i love this little set and for the price, its steal!!!", "Date": "February 6, 2013"}, {"Title": "bad refresh rate/fps", "Author": "Nam", "ReviewID": "R1D84LCZ8E07QG", "Overall": "2.0", "Content": "the system is ok with the major disappointment being that the video is very delayed in either quad or single mode.  makes it impossible to clearly see anything in real time motion which is a must for anything the records.  my last system was a security man which did not record but the video was superb.", "Date": "February 4, 2013"}, {"Title": "works great with the lorex lw2702 system", "Author": "MinnieWinnie", "ReviewID": "R2CM4IMHBA7V0G", "Overall": "5.0", "Content": "I needed an extra camera for my lw2702 system... needed 1 more camera to complete the 4 needed for monitor, but could not find this in stores or online.So I found this 1camera system but could not find information to see if the lw2711 would work with 2702.Well I took a chance & bought this.Worked perfect with my existing monitor. Now I can add more camera's to the 2711 monitor.Picks up signals pretty good, just have to make sure you position this where there is not too many obstructions, includingwalls interfering. ( have this monitor as close as possible to camera mounts ).Picks up a pretty decent range during day & night. With systems like this, nothing is 100 percent perfect, but again thissuits my needs. If you want a better system, you will have to dish out much much more money.This picks up in SD mode, but quality would even be better if this was in HD mode.I recommend this product!!!", "Date": "January 25, 2013"}, {"Title": "Lorex Wireless Video Monitoring", "Author": "Time Traveler", "ReviewID": "R1K22XXVJM9BL0", "Overall": "3.0", "Content": "Nice system, but two of the four cameras don't have the two way intercom working. One camera has a bright white halo covering the display at night. For the money, there are better systems on the market.", "Date": "January 18, 2013"}, {"Title": "Lorex Camera", "Author": "Frank", "ReviewID": "R27Y7PEJPNUQ25", "Overall": "5.0", "Content": "I added two cameras to our Lorex security system. The addition completes the coverage of our house. Very happy with this security system", "Date": "December 25, 2012"}, {"Title": "Lorex LW2711 Wireless Video Monitoring System", "Author": "Susan Hunter", "ReviewID": "R3S3Q4JAZ4TUQS", "Overall": "1.0", "Content": "Bad experience- this product worked for 2 hours.- then no picture on the monitor!. Contacted the online technical support, which were no help. Not sure if we got a defective item, but we felt that it was not worth the time or effort to try another one. We actually purchase another monitoring system from Costco & never looked back.", "Date": "December 23, 2012"}, {"Title": "Disappointing", "Author": "Clarke H. McCance \"Clarke\"", "ReviewID": "RC4F3K8QCSDEM", "Overall": "2.0", "Content": "I read the product reviews when searching for a wireless video monitoring system, and this one faired pretty well.  Upon arrival, one of the two cameras was defective right out of the box.  Contact with customer service was less than wonderful...long wait times \"on hold\" and CSRs whose accent makes English a foreign language.  I returned the defective camera (at my expense) and only after it had arrived at Lorex's return facility, was a replacement camera sent.  Once set up (which was easy), system worked well for a little over 1 year; then the motion sensor on the remaining original camera failed.  Once again, contact with customer service was a p.i.t.a.  Since the warranty is but one year (and I had exceeded that time period by about 2 months), the best I was offered involved returning this second defective camera (again, at my expense), and once received at return facility, I would be contacted for credit card info and charged $50.00 for a new camera.  Item mailed USPS on 1/21/14, tracking info revealed delivery on 1/24 at return center.  My call on 1/30 was greeted by \"We haven't 'received' the item\".  Contacted another CSR \"manager\" on 2/3 who explained a very screwed up system of returns/log-in process, and when I complained about the service, offered to replace the camera for $35...best he could do.  By this time, my patience had expired and my otherwise even disposition dissolved into anger and less than kind attitude/language.  Bottom line, OK product, questionable service.  I would request that Amazon discontinue handling such products.", "Date": "February 3, 2014"}, {"Title": "Tried to love it. Could not. Lousy product", "Author": "Emilio Rodriquez \"Allentown, PA USA\"", "ReviewID": "R3CPA2NYYJYL8R", "Overall": "2.0", "Content": "the product makes a good try at being good, but fails miserably.Pros-Wireless-Easy to installCons-To see from remote location you have to see it through Skype (however that works, who knows)-Doesn't record motion from two cameras at a time-Motion detection is very bad-Need all type of codecs to see videos in the computer (Mac in my case)-Suddenly my screen went super dark, can't even see anymore what's in there-Camera not wide enough to record moreJust not worth it. It might do it for you, but definitely nothing to monitor well any place.", "Date": "July 22, 2013"}, {"Title": "nice", "Author": "lharris070", "ReviewID": "R6M0MHTLVIKWI", "Overall": "5.0", "Content": "My preacher need some camras so I was looking into it and cam up with these im here to tell you they are wearth the money.they realy work good", "Date": "June 27, 2013"}, {"Title": "Signal gets interference too easily.", "Author": "Prometheus73", "ReviewID": "R20NQB1DW0AXXH", "Overall": "3.0", "Content": "Good product but the signal gets lost too easily between the camera and the monitor. Good Night vision too. Don't expect top line surv. video but a good start to a system to learn before you commit to a large scale project.", "Date": "June 24, 2013"}, {"Title": "Best security device.", "Author": "Alvaro", "ReviewID": "R1LMLDTXJGBABW", "Overall": "5.0", "Content": "For my home, lorex wireless device is the best on the market. I'm very satisfied with this team. I recommended it", "Date": "June 7, 2013"}, {"Title": "Good Product", "Author": "Moses", "ReviewID": "R12FN40PEDFCL", "Overall": "4.0", "Content": "After some suspected men walked a night around my resident, I ordered Lorex LW2711 Wireless Monitoring System to have my resident secure. Honestly I never try one and was doubting what will work.I received the package, open it and following instructions, I finalized the installation of the four video camera monitors. Everything works well. From the house monitor, I can see my children buses coming from distance, the alert will come on when someone or a car is closer to my yard, also can talk to visitors outdoor from the monitor indoor. The night vision is almost 7/10. The only issue I had is that the monitor has to be almost equal distance with all cameras in order to have good images in all 4 cameras or buy an extended antenna to cover that little issue in case your residence is big. All 4 cameras are placed upper corner of the 3rd level of my resident.", "Date": "June 5, 2013"}, {"Title": "Great system", "Author": "WatchLover", "ReviewID": "R1LWJ9PYEODZTZ", "Overall": "5.0", "Content": "This is a great start-up system for anyone. Easy set-up and no wires to run. The biggest draw back is that if you want to add two (2) more cameras, they cost as much as this system. Overall it works great for my needs and the wireless cameras have great reception through brick and sheetrock. Using the system through Skype is an added bonus, also easy set-up and use. I have recommended the system to others and they have nothing but positive feedback for this system.", "Date": "May 16, 2013"}, {"Title": "Love it", "Author": "Brittney Ott", "ReviewID": "R21PIECS9G1P5G", "Overall": "5.0", "Content": "works great. Definitely made the rest of the neighborhood jealous. It is a great value for the money and I would buy more. Infact, the buyers of my house liked them so much they asked to keep them in the sale.", "Date": "May 14, 2013"}, {"Title": "Lorex Camera", "Author": "Joe", "ReviewID": "R15RJP3QY05X5W", "Overall": "3.0", "Content": "For the price it is a pretty good deal.  The quality of the picture is not that great, and changing the memory cards out can get annoying.  Overall a great value, but would probably pay a little more next time to get a little more.", "Date": "May 13, 2013"}, {"Title": "Great Video Monitoring System", "Author": "PCAMZN101", "ReviewID": "R3TMIJ65ZVN1WD", "Overall": "4.0", "Content": "Bought this one as a gift because we like ours.We have it pointed so that it forewarns us when people are coming up the driveway or walking towards our front door.  It makes a little beep.We get regular Amazon package deliveries so when the delivery guy rings the bell ... I know that I don't have to rush to answer the door.It records for a few seconds so you can review.  Would be great to have a recording if your house was robbed.Quality of the recordings are not 100% like a high quality camera but they are good enough for what we need.", "Date": "May 10, 2013"}, {"Title": "Defective camera", "Author": "verizon girl", "ReviewID": "R1JWNXU9GCYFGL", "Overall": "3.0", "Content": "Installation was easy.  Motion recording was hit and miss.  Did not record motion beyond 15'.  One of the cameras would record constantly without any movement in its view.  After reading other reviews I did not want to deal with customer service.  I sent it back to Amazon for a full refund.", "Date": "May 4, 2013"}, {"Title": "Some initial problems", "Author": "Marty405", "ReviewID": "R2I5N87174IAMW", "Overall": "4.0", "Content": "When I received the system it was very easy to set up; just mount your camera and run power to it and it works.  The display is nice and clear, even at night.  We use it to monitor the front door, so the distance is not that far.  Several nice features are when someone approaches the door/zone the monitor will start chirping to let you know someone is there before they even ring the doorbell.  It also has a microphone so you can talk and hear the person at the door without opening it.  Since it is wireless you can carry the monitor with you no matter where you are in the house.  You can also set it to auto record when motion is detected.  Here is the kicker.....the motion detection stopped working about a month after I had installed it.  I contacted Lorex directly and it was a very simple process to send the components back to them with a turnaround time of a little over a week.  They sent all new components.......so they stand by their products if anything happens.  In fact I'm getting ready to purchase add on cameras to expand my system...it'll hold up to 4 cameras.", "Date": "May 1, 2013"}, {"Title": "These 4 and no more", "Author": "Burto \"Burto\"", "ReviewID": "RSV8E9CJZZE1C", "Overall": "4.0", "Content": "Bought this knowing that it was limited to four cameras, and decided I'd make it work. After strategically installing the four, I realized I had a couple of dead spots. It would be nice if it could handle 2 more.From day one, camera 1 switches to fog when it goes into night mode. I have contacted Lorex and they say they will replace it under the warranty, but its kind of a drag having to pull the ladder out and climb up to get it and then again to install the replacement.Other than that, the cameras are awesome with true to life color in the day and pretty good range at night in b&w.;The receiver picks up all 4 cams very clearly.When we have guests over, I choose one of the pre-loaded pictures and drop the antenna. Nobody's even mentioned it yet.", "Date": "April 27, 2013"}, {"Title": "Lorex Wireless Camera", "Author": "Amazon Customer", "ReviewID": "R3CKZSXSLTQU1W", "Overall": "4.0", "Content": "The camera quality is very good and we have been pleased with the performance.  We have 3 of them and they were easy to install and the screen is a nice size to view the cameras all at one time.  We have hooked it up to our TV so we can view it there as well.  The only draw back is that it has to be hard wired.", "Date": "April 22, 2013"}, {"Title": "it works, not impressively but it works", "Author": "Thor1964", "ReviewID": "R1IMHBK4XY8O1U", "Overall": "3.0", "Content": "Quick and easy to setup but the price is far too high for what ya get and the signal consistently gets lost even with the cams indoors just in separate rooms which was disappointing.. The rooms aren't very far apart either so the signal is weak. I will be purchasing a good olde wired system without the monitor very soon, but if ya need something quick and easy to setup this works.", "Date": "April 17, 2013"}, {"Title": "el producto es bueno", "Author": "carlos mora", "ReviewID": "RTDD10U7P9EPR", "Overall": "4.0", "Content": "el producto es bueno la camaras se ven bien de noche, solo que en skype se ve solo una camara y si colocas muy  lejos las camaras del monitor no vas a tener señalthe product is good the cameras look good at night, only that skype is only a camera and if you put the camera far away from the monitor signal will not have", "Date": "April 16, 2013"}, {"Title": "Waiting on replacement part", "Author": "Gracie Petrowsky", "ReviewID": "R35CVZC1DMU6A6", "Overall": "4.0", "Content": "I had one adapter that would not work; had to try a couple of time to get thru to customer service.Mail bad one back to them haven't got the replacement yet; this has been 3 week ago.So I don't have my system up yet to totally check it out; what I can do so far I am very happy with.Just not to happy with customer service and the long waits.", "Date": "April 12, 2013"}, {"Title": "I liked it so much I got one for a friend!", "Author": "T Coe", "ReviewID": "R59Y27TTCFEWL", "Overall": "5.0", "Content": "This is a great security camera.. I mainly use mine for when I'm in the basement so I can see if some one drives up. Incredibly simple to set up ..you get audio as well as video....I don't use the recording end..but it comes with a 2 gig sd  card.I've had mine for several months and have had no problems at all.  Really good picture at night...also beeps when people or cars come by!  I bought this one for a friend who was very impressed with mine!", "Date": "March 31, 2013"}, {"Title": "Lorex Wireless Video Monitoring System", "Author": "Reader On The Open Range", "ReviewID": "RIZSNETMYVYWV", "Overall": "3.0", "Content": "These  camera's have a quality look and feel and the monitor also has the appearance of being well made.  They are good if you need a monitor in the same room with close camera's. (not sure how that would be beneficial?)  I wanted a monitor in one room with camera's in another. I added two camera's which paired fine.  The features are nice, and it's very user friendly, but the signal was very spotty and so the picture was off and on (or not) for the majority of the time.  I worked with it for 2 weeks repositioning camera's, trying to make it work and finally decided it just wasn't able to transmit strongly enough to connect the signal.  As stated before, it might work fine if you had a big open room and could use your monitor in that room, but as far as for going from one room w/camera about 40' from the monitor and the signal having to pass through a sheetrock wall (even in-line) ... ummm... spotty at best. Outside was definitely a no go.  My friend has a Uniden and lives in a brick house.  Her camera's are outside and she can use her monitor anywhere in the house and gets a constant picture. However, she has only 2 cams on her system, she's in a diff. location, and maybe there are other factors that make a difference...?  I'm thinking probably the best way to go may be a hardwired system.  p.s.  when they say \"wireless\" they really mean... less wire.  All cameras and the monitor must be plugged in to a wall outlet.  Quality, but needs more juice.", "Date": "March 30, 2013"}, {"Title": "Great product for the price", "Author": "Trenton Quick", "ReviewID": "R1KEF4WTPSEIND", "Overall": "4.0", "Content": "I am using this at our commercial space and it makes us feel a lot more secure when we are not at the business. Picture quality is decent.", "Date": "March 25, 2013"}, {"Title": "Similar System", "Author": "Skye", "ReviewID": "R298G50KEUNF9L", "Overall": "2.0", "Content": "Just bought a similar system from Lorex with the touch monitor.  I have had it a week and the touch part of the monitor didn't work from day one. Tech support is a joke and I had the same problem with someone saying they would call me back with level II support when they couldn't solve the problem.  I got no call back so two days later I called again and started all over. We finally got to the point where I now have to return the monitor and wait another two weeks for a replacement. In the meantime one of the cameras simply stopped working...sigh. SO far I have spent 4 hours with tech support.  I will send back the monitor tomorrow then probably have to start all over with the camera...need I say more?Update, The postage for the monitor return was $26.00. The touch screen on the new monitor works 90% of the time, but it is ultra sensitive and the console buttons are very small for a touch screen. I am waiting for the camera replacement.", "Date": "March 24, 2013"}, {"Title": "Easy and worked right out of the box", "Author": "Will Payne", "ReviewID": "RO82YP7TL1LOI", "Overall": "5.0", "Content": "We needed to be able to see who was pulling up in the drive and this was a  breeze to setup and continue monitoring day or night. Great product and thinking about buying three more cameras to watch different angles.", "Date": "March 20, 2013"}, {"Title": "Good, but missing a couple of features", "Author": "MB", "ReviewID": "R264SML4BWGQXT", "Overall": "3.0", "Content": "This is a good product, and worked easily right out of the box.  The image is clear, but the area your monitoring must must be well lit up (the infrared doesn't work unless the camera is in a well lit area).  It says it does not interfere with wi-fi, but he does interfere a little.  There's been several times I had to turn it off to use my ipad for surfing the web.  I was also hoping that the monitor would be portable, but it has to be plugged in al all times.  I will not old a charge to allow you to move from one room to another with it.  I do however, love the Skype feature!  This is great when I go out of town!", "Date": "March 10, 2013"}, {"Title": "Pretty good system", "Author": "John Luther Jones", "ReviewID": "R2BRTNT19E688Z", "Overall": "4.0", "Content": "Very much like the system. Two way comms is great and PIC is fairly clear.  Set up is easy.  Geographic distance is very limited, skype ops is very limited and the monitor has to be switched off to include if you want the display to be sent to to a other monitor or other device. General speaking was as discribed and I would recommend it to others.Dan", "Date": "January 24, 2013"}, {"Title": "pretty good for what i paid", "Author": "Jason Baerg", "ReviewID": "RWKF9W8IHAOAM", "Overall": "4.0", "Content": "This little system works pretty good for a small home or business.  The reach on these cameras are not the greatest and i will probably be ordering the signal booster for one of my cameras.  It is pretty spotty.  Other than that it has worked great for my family and i have recomended it to several people.", "Date": "January 16, 2013"}, {"Title": "good product", "Author": "byoder", "ReviewID": "RY1V5AG68QM5S", "Overall": "4.0", "Content": "wsa easy to install. i set up the camera on my front porch. I buy most of my merchandise online and my packeges are left bythe carriers on the porch. I have heard of people stealing packages just minutes after delivery, so i installed this system to help keep theifs away and for security purposes. The alert goes off when someone approches and is set up ( which you have to do manually) to record for 15 seconds every time movement is detected by an animal or person. It has constangt live streaming of audio and video, so i you live on a busy street, near a highway near dogs, you might want to place the camera a good distance from these noise makers. You can hear people 10 feet away from the camera clear as a bell. Great product,however the installation of the software is a nightmare. not user friendly and yo have to have a skype account and other hassles. Overall i recommend this product.", "Date": "December 5, 2012"}, {"Title": "❺ Star -  AWESOME Product  - ❺ Star", "Author": "Scott", "ReviewID": "R2WM9GZ4GTSW2X", "Overall": "5.0", "Content": "This is a GREAT mid priced home security system.  It was so easy to set up, but PLEASE take the protective plastic off the lens!  LOL, it took me 2 days to figure it out I had left the film on.  The resolution was great with the film on it.......but it was AWESOME without it.I am an experienced carpenter and I intentionally searched for an easy to install wireless system. If you are NOT experienced in home maintenance  I would NOT recommend the DVR Sysytems, which has wires and you have to install in the attic.This is a COMPLETE system and the 9 inch montior is like a PC tablet that sits like a picture frame and it can be moved from room to room like when you go to bed.  Just unplug and then re-plug, the wireless receiver imediately finds the cameras with no dely or messing around.❺ Stars - HIGHLY recommended!", "Date": "March 26, 2013"}, {"Title": "Please Read This First", "Author": "Kimberly A. Moser \"usermomsuper\"", "ReviewID": "RSIF3422ZNLY9", "Overall": "2.0", "Content": "BAD customer service - the sales people don't know the accessories, the tech people don't eitherThey give you 3ft of power cable, then the cameras connect to another inside power cord.  This is only good if you don't need to mount on anything other than a window sill, and then you need to keep the window open to keep the cameras plugged in.Good luck finding a power cord extension...  Went to two Radio Shacks, Best Buy and Staples.  All sell dc power cords for cameras, BUT Lorex has a unique connection, and no one sells adapters.  I am now on hold with tech (and counting) for 27 minutes about a light that is flashing, who knows when I will be off this call. Best Buy said \"we get 20 to 30 people a month with Lorex power cord problems\"....Yes - it is easy to set up, but they give you 2 GB's of memory, you can only go up to 16, so don't try buying a 32 like what comes up on Amazons accessory list, it's wrong.  Oh, there is a card in the Lorex box that sends you to an installation company - HA, I called them and they will not work on the wireless systems.  So - once you buy this thing, you are on your own.  I should have called someone in and paid the money for service and quality.", "Date": "December 10, 2012"}, {"Title": "Esther  in Brooklyn is really enjoying this product.", "Author": "Esther", "ReviewID": "R1WCWXWWVV6QSL", "Overall": "5.0", "Content": "It is very cool!!! It has a clear display, a small size camera & it even has an intercom system.  I love it!!! Most of all it was very simple to install, really do it yourself type of item.", "Date": "August 21, 2012"}, {"Title": "I love it", "Author": "Carlos Ulate U.", "ReviewID": "R3REIVMF9WFDQY", "Overall": "5.0", "Content": "This camera really functionI can see all my yard and be sure that all is fineAmzaing function with the movement sensor", "Date": "April 28, 2014"}, {"Title": "Lorex Wireless video system", "Author": "mammasawnT \"MMO T\"", "ReviewID": "R39AOBI0XAJVJW", "Overall": "4.0", "Content": "This is nice to have in the house.  I have a couple of cameras and if they ever go on sale will consider a couple more to max out at 4 for the one monitor.  These are alleged to be outdoor friendly but you have to plug in each camera and well...why run that extension cord and tell the bad guys exactly where your cameras are?  I'm not drilling through brick and siding to mount this outside of the house.  Just my .02", "Date": "March 3, 2014"}, {"Title": "works great", "Author": "Paul Ricketson", "ReviewID": "R1IY6A01WOUXHA", "Overall": "5.0", "Content": "The camera syncs up nicely to the display. The motion sensor and night vision work well but motion sensor is limited in range. I used the camera to keep an eye on my house because the neighbor kid was causing problems.", "Date": "January 22, 2014"}, {"Title": "Buyers be aware", "Author": "athans bozinos", "ReviewID": "R3I5YZZNJ0IMP0", "Overall": "1.0", "Content": "Lorex is the worst company.Do not buy their products.I bought a system $1,000 cost and it doesnt work.I am a contractor in NJ and can fix pretty much anything.Dont waste your $$$$Their service department doesnt pick up the phone or return callsbig scammers", "Date": "January 19, 2014"}, {"Title": "like this video monitoring system", "Author": "ER", "ReviewID": "R3AIZRE6KTDUOT", "Overall": "4.0", "Content": "it's complicated to install. I didn't know I would need a handyman to help me install it.. That's the only drawback.  But glad I purchased it.", "Date": "January 11, 2014"}, {"Title": "Terrific!", "Author": "Kathy M. Scogna", "ReviewID": "R2QACN8ARHRCKN", "Overall": "5.0", "Content": "My electrician set these up thinking I was concerned about humans lurking around. No, not humans, it is for the animals!Every morning I get my coffee and sit down to review who came to visit the night before. Amazing. Many deer and buck, a nursing fawn and his mother, right on camera! Plus a fox or two, raccoons, lots of turkeys.I've posted the videos online and everyone likes them. Very easy to set up and operate. If i can master this, so can you!", "Date": "December 27, 2013"}, {"Title": "Security", "Author": "Louise Pesce", "ReviewID": "R1O629MIJ5V4XQ", "Overall": "5.0", "Content": "Easy to install, best investment I have made. Currently use 32gb memory card, only draw back is it needs to be erased after only a few days , wish it took a larger video card to record longer.", "Date": "December 13, 2013"}, {"Title": "unhappy review of this product.", "Author": "Amazon Customer", "ReviewID": "R3ILQQXUHFAYFC", "Overall": "1.0", "Content": "this item has never worked and when I called the company they asked me to send a fax with all details. I did and they still have avoided returning my call. I see it as a waste of $500.00 since I could not return the item nor has it ever been replaced.", "Date": "December 8, 2013"}, {"Title": "So far, so good.", "Author": "Human Bean", "ReviewID": "R2F96LOTCTSNZM", "Overall": "4.0", "Content": "Overall, I like this--it allows me to see who's at the door.Pros:1) So long as the monitor stays within the prescribed distance, it seems to work. It appears to be affected by walls, however, so the distance gets shortened...in my case by about half.2) I didn't have any WiFi interference, which I read about in reviews on the Lorex website.3) Has Quad-View, so four cameras visible on monitor at the same time.4) Sensors are sensitive and work well even at night.Neutral:1) Beeps every time the sensor senses motion. Volume can go low, but not completely off. So you probably don't want this in your sleeping area. It detects even cats making their nightly rounds.Cons:1) Installing can be complicated if you're not an electrician or really handy. I ended up hiring one, so the installation cost far exceeded the equipment cost.2) In-use, the Quad View (four cameras) doesn't work once a motion sensor is triggered. It flips to full screen view of that camera, and won't switch to another camera until the timer (5 sec, 15 sec, or 30 sec) is over. So, if you're trying to track movement camera-to-camera, or simply to see who is at the door after they've triggered a walkway camera, you have to wait. If your visitor is standing quietly at the door, the sensor doesn't work & it goes back to Quad View; you have to manually switch to that camera. All of this takes time, and the audio doesn't work on Quad View--so meanwhile your visitor is waiting at the door wondering what's taking so long.It apparently has a Skype function, but I've never used this, so I can't comment on this.", "Date": "December 6, 2013"}, {"Title": "Nice camera", "Author": "David Wells", "ReviewID": "R1543TZRPNYPSP", "Overall": "4.0", "Content": "These are nice units except for the fact you cannot put them where they will get directly weathered. Major downside is Lorex told me they no longer make these models.", "Date": "December 5, 2013"}, {"Title": "Cheesy Junk", "Author": "mike kapinos", "ReviewID": "RISD4D928AKJ4", "Overall": "2.0", "Content": "\"\"cheesy\"\" broke ater 6 months they replaced the cameras but the return was a pain and taking them down and putting back up was a pain,, One camera looks like it is doing the same thing again!!! Wont work in night vision, Its just ok the recordings are not clear and are jumpy, if you need them for legal reasons GOOD LUCK!!!", "Date": "December 4, 2013"}, {"Title": "Great Day/Night Camera System", "Author": "Digital_Man", "ReviewID": "REPXQJDVIZN3E", "Overall": "5.0", "Content": "I needed an outdoor camera system that was easy to setup with night vision, warning system and wireless.  The Lorex exactly met all my needs.  At night the camera easily sees at least 40 feet, while the warning system provides an audio alarm that simultaneously records activity within 20 feet. The only challenges I had was getting power to the cameras and placement of monitor without losing transmission.", "Date": "November 15, 2013"}, {"Title": "Great alternative to peephole viewer", "Author": "LJdeHayward", "ReviewID": "R3RRY4945XVP6A", "Overall": "5.0", "Content": "I originally had bought the Brinno PHV133012 Digital PeepHole Viewer, but found that the view from it was worse than my regular peephole. I wanted to be able to see who was at my door without looking through the tiny peephole. I then decided to look at security camera systems, but wanted one that didn't require hooking up to a computer or DVD player, and that was easy to install and use. The Lorex LW2711 monitor was very easy to set up and automatically comes on when the motion detector is activated. It's also nice that it comes with a memory card so you don't have to buy one. The video camera was a bit harder to set up outside, since we wanted to view our front door and have it out of the way of rain, but my husband managed to do it fairly easily. The one drawback with the video camera is that the AC power cord is too short, unless you have an outlet nearby. My husband found a longer cord online and he ran the cord through to the garage plug. This system has worked well for seeing who is at the door, and it gives off an alert sound when it detects movement on our front porch.", "Date": "November 13, 2013"}, {"Title": "Great for Business", "Author": "Kristen Ballew", "ReviewID": "R273REQV12UQE0", "Overall": "5.0", "Content": "I have a small business and this has worked wonderfully.  I can see who is coming and going and i can record at night.", "Date": "November 13, 2013"}, {"Title": "Preview the instructions for Remote Viewing and 'Port Forwarding' your router !", "Author": "Crista \"cris\"", "ReviewID": "R9T78QFYL382F", "Overall": "3.0", "Content": "Setting up the remote viewing option is very complicated. If you would like a preview of what this entails, go to lorextechnology.com and select support - remote viewing. You will need to: register your product, fill out the warranty forms, download drivers (heaven help you if you have Windows 8 !), setup two different types of Skype accounts (one for you and one for the ONE camera you have selected for remote viewing), add them each to your contacts, verify each account, then find a totally different computer, not the one you have hooked-up to your Lorex system. (Just ask a friend if you can mess with their computer. They won't mind.), test your new remote setup - and you're done ! Allow at least half a day to get this all working correctly.This not impossible to do. However, most people (including most computer engineers) are not familiar with all the steps required for 'port forwarding' a router.", "Date": "November 11, 2013"}, {"Title": "Great way to see who is at your front door", "Author": "J. Deaver", "ReviewID": "R7ERRDG8C28LK", "Overall": "5.0", "Content": "Very easy to use. All you have to do is unbox it and attach the base (with included screws) to any wall surface, inside or out. The infra red works great at night so you can see who is at your door if it's dark. The monitor can be placed quite a distance from the camera. My camera is outside and the wireless monitor is inside. No problem with the signal going through brick!", "Date": "November 7, 2013"}, {"Title": "Be leery about warranty", "Author": "Mary Ellen Austin", "ReviewID": "RA77HKC3FPGPA", "Overall": "1.0", "Content": "service and warranty is mighty slippery and almost non existence.  Just assume if there's a problem, just buy another camera", "Date": "November 5, 2013"}, {"Title": "Decent Camera for the price that for the most post gets the job done", "Author": "Sean", "ReviewID": "RDKPMK3BH490B", "Overall": "3.0", "Content": "The camera does work fine.  The night vision is suprisingly good too. Don't expect high grade camera footage that you see at gas stations or department stores.  Basically I just used them to see if people were at my front door and monitor my dogs outside.  You can't really see people faces or a registration plate on a vehicle that well.  They also made a great deterrent to my neighbors.  My neighbors were so scared of the cameras, they thought they could pick up and see EVERYTHING.  I do like how you can hear and talk using the screen through the cameras.  Also the ease of hooking them up wirelessly was nice.  All you have to do it plug it in and adjust the camera's view.  This is a good camera for a cheapbeginner home surveillance system. Ultimately it gets the job done but i would love to have a better system.", "Date": "October 11, 2013"}, {"Title": "Just not meant to be", "Author": "Big ZEKE", "ReviewID": "RUZD436MS0FCR", "Overall": "1.0", "Content": "After I recieved the wrong camera twice I finally received the right one and it doesn't work properly.....I'm just too aggravated with the whole thing at this point,I just want a camera to watch over my home and family.", "Date": "October 4, 2013"}, {"Title": "Best ever!", "Author": "Kris A. Bales \"Kris\"", "ReviewID": "RBYJUIDKQJL2Y", "Overall": "5.0", "Content": "I purchased this for my a Birthday gift for my spouse last year and it was super simple to connect, and use.  It works on Skype, so we can view the camera from anywhere.  We have a huge piece of property and I was afraid that the signal would dilineate from the extra cameras we purchased and placed by the mailbox, along the driveway, in the back yard, garage, arbor, etc.  This thing is the best!!  You can cycle 4 cameras directly onto the monitor that comes with it.  You can set up the system so you can even view it on your cell phone using Skype.  It comes with a memory card, and the cameras have a microphone/speaker on them, so I can talk to people at our front gate before opening it.  I have recommended this to a number of friends.  A very good purchase...and a GREAT gift!", "Date": "September 20, 2013"}, {"Title": "hi great deal for the price", "Author": "Martin", "ReviewID": "R26K0ZXUS6Y5UM", "Overall": "5.0", "Content": "hi plug it in and go, cot the 4 leg perb right on target first night, well without jock great little system works well at night too, mic could be a little more pick up, other then that for that price super cool, thanks", "Date": "September 8, 2013"}, {"Title": "okay for a low end camera, but not that great", "Author": "S. F. Russell", "ReviewID": "R281EINGASYSEL", "Overall": "3.0", "Content": "This is my second one of these cameras.  My first one (before a year) seemed to have lost its night vision.  The day vision was still good, but I was unable to see anything at night except very dark and blurry images.  Since I already had the receiver, I decided to buy another camera.  It works better and has okay night vision.  Its not great, but you can at least see at night along with the floodlight I have outside.  If you want just the basic low-end camera, this one is okay.", "Date": "September 8, 2013"}, {"Title": "It works okay.", "Author": "NOEEEZY", "ReviewID": "RXV02YDJDBMM6", "Overall": "3.0", "Content": "The video quality is not close to HD and the program features are limited. Overall easy setup. I recommend a larger SD card. I use a 16GB and it continuously records approximately 4 days worth. So I just rotate between SD cards. The night vision is JUNK. Still, I'm somewhat pleased with my purchase. Its definitely worth it for the price, although you're still not getting a high level security system, it still works as described.", "Date": "August 30, 2013"}, {"Title": "Just had electrician finally install outside plug...", "Author": "oaktree1966", "ReviewID": "R3SYIK3DMWU1FK", "Overall": "1.0", "Content": "Not happy at all with resolution... either night or day... worthless at night... during daylight I tested a number of times and there is no way to identify a face or license plate at even 20ft.", "Date": "August 20, 2013"}, {"Title": "Great Camera", "Author": "C. Poulin", "ReviewID": "R101WZIUG384ZQ", "Overall": "5.0", "Content": "I had one camera connected to my security system and found I needed another one for more protection. I ordered this one which works perfectly. It was easy to install and to pair with my Lorex system.", "Date": "August 16, 2013"}, {"Title": "Outdoor Wireless Security Camera is Great!", "Author": "GG's Mama \"TheChiChiMama\"", "ReviewID": "R2OLFN5JK2PFDC", "Overall": "4.0", "Content": "Great Picture, Sound, Microphone and Color too!!  I would recommend this camera as an add on to existing system to all.", "Date": "July 28, 2013"}, {"Title": "Does a fair job", "Author": "C. Fish \"C Fish\"", "ReviewID": "R117T9RBMKZ1EQ", "Overall": "3.0", "Content": "The main problem with this monitoring system is the range of operation between the wireless cameras and the main unit. One camera had to be within 12 feet of the unit. The other camera had to be within 18 feet of the unit. The system also picks up interference.", "Date": "July 22, 2013"}, {"Title": "Good for the price.", "Author": "Todd", "ReviewID": "R3JGC4TPNEQSDK", "Overall": "3.0", "Content": "Good:PriceEasy setupQuality constructionNot so Good:Video quality is just okayMotion sensors are \"hit and miss\"", "Date": "July 16, 2013"}, {"Title": "System ok ,some issues only.", "Author": "antonio", "ReviewID": "R10CNEVHYB368K", "Overall": "3.0", "Content": "The control poor quality hard to use,the screen is ok the cameras are good no complaint  at all, check other options before buy these ones", "Date": "July 13, 2013"}, {"Title": "Does not comunicate with unit", "Author": "ZV", "ReviewID": "R2HW6N0EJQFOSB", "Overall": "2.0", "Content": "Purchased as an addition to my existing system, but the cameras would not pair up with my identical unit.Prices are ok, but lacking the features.Returned back for full refund with no problems at all.", "Date": "July 7, 2013"}, {"Title": "Great entry level security device", "Author": "Gary", "ReviewID": "R1LK5VYG8X5632", "Overall": "4.0", "Content": "Setup was easy, operations and instructions were accurate and easy to follow. Cameras are clear and work well. Very satisfied.", "Date": "July 6, 2013"}, {"Title": "vincecor", "Author": "vincecor1", "ReviewID": "R1FDDEB9MRTTJY", "Overall": "5.0", "Content": "Camera easy to installClarity and resolution of the optics over & than what I expected.Works perfectly at night time", "Date": "July 2, 2013"}, {"Title": "Gets the job done", "Author": "Saunda Cunningham", "ReviewID": "R3M0JRX40RSKIK", "Overall": "4.0", "Content": "I purchased this camera, due to things continually being misplaced around my home. Every time I would leave and come back home , things would look out of sorts, so I purchased this after reading several other reviews prior to my purchase. i must say I was kinda nervous when they were saying you couldn't make out the person. But I think it serves my needs perfectly. You can install it in about an hour after drilling a hole from the outside of your home into inside  so that you will be able to use the outlet to plug it in. make sure to put the cameras under an awning or gutter to shelter from rain and snow a little. It is color during the day but when dawn starts to fall, the color turns black and whiter. Which makes seeing at (night) a bit distorted. The intercom feature works fine and clear inside and out. I love the motion sensor ;).. it beeps to alert you whenever someone crosses the sensor path. Oan it comes with @ cameras  that are already paired , it's literally plug in and watch! No complaints so far and i have had it for 3 weeks now!..through rain and storms, already!", "Date": "June 20, 2013"}, {"Title": "Am very pleased with this product.", "Author": "mary", "ReviewID": "RKLGWT3BK1FWO", "Overall": "5.0", "Content": "A friend recommended this to me who has a two camera system.  I choose the 4 camera system for better coverage.  It was very easy to install and get up and running, and easy to operate.  Would definitely recommend this to anyone looking for a moderately priced security system.", "Date": "June 19, 2013"}, {"Title": "Protection for My Wife And Me", "Author": "Clair Leonard", "ReviewID": "R2PBCFG5XA0N7H", "Overall": "5.0", "Content": "My house was broken into. I was only gone for two hours.so I bought the cameras system so I don't have to worry about when I goout Or when I go to bed. The pictures on the screen are so clear. I am sure that the next time the guy will be sorry they broke into. my house I am 73 yr. old so I will let the police do the hard work mean time your cameras will help them out.  Thank you  Clair Leonard", "Date": "June 10, 2013"}, {"Title": "Good camera with some flaws", "Author": "Amazon Customer", "ReviewID": "R3OD2FDGYFBCHH", "Overall": "3.0", "Content": "Great camera for the price with good video quality.  We wanted to keep this camera inside but looking out into our driveway, but motion isn't detected through glass.  This is okay since I set it up to record at certain times and it works fine through glass.  The remote control kind of sucks though.  I have to hit the buttons several times for it to recognize the command.  Wish they had made the controls on the monitor easier to work with in that case.", "Date": "June 2, 2013"}, {"Title": "Great add on to safe-room", "Author": "Carlos Cabal", "ReviewID": "R385TXZPDHV3ZL", "Overall": "4.0", "Content": "I bought it to ensure proper viewing of critical areas of my home while insida a saferoom. Saferoom walls are 40cm(15.75inch) thick concrete. The two cameras are less than 32 feet of the monitor. Reception is good, but if I buy an add-on camera the signal will not reach  all the way to the main entrance, unless I add a range extender. Please have in mind I am using this system inside a saferoom. Also tried it outside the saferoom and the range was dramatically better.", "Date": "June 1, 2013"}, {"Title": "Works Great!", "Author": "John Q.", "ReviewID": "R3TAF8W34PCCD4", "Overall": "5.0", "Content": "I installed this system in a retail store and it only took me about an hour. The cameras paired with ease and I was a little surprised when considering the distance that the camera's were able to communicate with the monitor. The camera's were about 50 feet from the wireless connection and still working just fine. The skype set up feature is great. I also use a dvr to record motion detection and so far everything works just fine.", "Date": "May 28, 2013"}, {"Title": "It's versatile and compact.", "Author": "Edward Schwartz Jr.", "ReviewID": "R1S4NH5GW0SNL0", "Overall": "4.0", "Content": "It should have a switch for turning off audio portion of recording modes, and a jack for a microphone extension wire.", "Date": "May 25, 2013"}, {"Title": "Lorex LW2711", "Author": "Janet L. Dove \"J.L.D.\"", "ReviewID": "R2KOWYH86EEX9P", "Overall": "3.0", "Content": "It has good day vision but terrible night vision.Easy to set up but slow operation.Wish I had bought larger screen.", "Date": "May 20, 2013"}, {"Title": "Works as expected", "Author": "badudej", "ReviewID": "R2EUE2SXKE7D", "Overall": "5.0", "Content": "The uses are limitless. works as i expected and i definitely would recommend Lorex products to any one interestedin this type of products.", "Date": "May 18, 2013"}, {"Title": "Great product.  Great price.", "Author": "Joan Bachert", "ReviewID": "R3JN9EY9M291JQ", "Overall": "5.0", "Content": "I love this monitoring system, which is very clear and lets me watch my car (which was vandalized twice this year) at night without having to jump up out of bed when I hear a noise.  It's a lifesaver.", "Date": "April 17, 2013"}, {"Title": "No more jumping out of bed", "Author": "John Lundberg", "ReviewID": "R6IILAW5DEXQN", "Overall": "5.0", "Content": "I gave the 7 inch system to my son and purchased the 9 inch one for myself. Same quality just bigger screen.", "Date": "April 9, 2013"}, {"Title": "Good Deal for the dollars", "Author": "George O.", "ReviewID": "R3R9A7FHHA8L4D", "Overall": "4.0", "Content": "I purchased this to replace my older one, got the 9\" one. I tried different models from Lorex and other systems.. Was having problems with the older monitor. Had to buy with two cameras, Wish I could have purchased the monitor only", "Date": "April 5, 2013"}, {"Title": "WORKS NICE IN DAYLIGHT NOT TO WELL FOR DETAILED NIGHT VISION AUDIO VOICE PICK UP WAS QUITE IMPRESSIVE,NOT TO IMPRESSED WITH", "Author": "Randy", "ReviewID": "R2KVQ8KZOM9E29", "Overall": "3.0", "Content": "UNFORTUNATELY DEVICE MONITOR WOULD NOT RECORD WHEN RECEIVED.CONTACTED LOREX AND THEY SENT A NEW OUT AFTER I HAD TO PAY TO SEND BACK TO LOREX WARRENTYAFTER RECIEVING NEW MONITOR SYSTEM HAS BEEN WORKING WITH EXCEPTION TO THE MOTION RECORDING.PICTURE QUALITY IS BETTER GOODWORKS NICE IN DAYLIGHTNOT TO WELL FOR DETAILED NIGHT VISION AUDIO VOICE PICK UP WAS QUITE IMPRESSIVEMOTION DETECTION OPERATION COULD BE A LOT BETTEROVERALL FOR WHAT I NEED IT FOR  I CAN SAY IT WAS MONEY WELL SPENT", "Date": "April 2, 2013"}, {"Title": "Had to return this.", "Author": "mack", "ReviewID": "R2AF1OZ35FT2UG", "Overall": "3.0", "Content": "The idea is great and wanted to use this outside of my home. Wireless, sounds great and it is but you have to have an outlet that is fairly close where you put the camera, not possible at my house, have to go with wired & make sure you purchase cables from other source than Lorex, there price is 250 bucks for an additional 100 feet, it comes with 60 and you can find it for 40 elsewhere.", "Date": "March 30, 2013"}, {"Title": "Lorex Wireless Video Monitoring System (LW292)", "Author": "Amazon Addict \"AA\"", "ReviewID": "R3DE9V4GNV7YK5", "Overall": "5.0", "Content": "Great product for monitor baby. Night mode is a bit blur, but enough for monitoring.  recording is smooth with the remote. reconmended if you don't mind pricy.", "Date": "March 29, 2013"}, {"Title": "Extra camera", "Author": "Jackie C. Stutz \"Tacoma\"", "ReviewID": "R158WASUIWWHU5", "Overall": "4.0", "Content": "Bought this as an extra camera to my security system and it paired up effortlessly.For the price it is a superb purchase", "Date": "March 28, 2013"}, {"Title": "Works GREAT!", "Author": "Bill Nottingham", "ReviewID": "R317F1B1DMKYKH", "Overall": "5.0", "Content": "I had NO problems setting this system up. It took a half hour and everything worked just as described by the seller. I would recommend and I will be ordering additional cameras!Update: I did add another camera and it was simple. Since I've been using it longer I have found one complaint, the remote it pretty bad. But if you are 12 inches away from the monitor when you use it, it'll work fine.", "Date": "February 25, 2013"}, {"Title": "EZ", "Author": "bill selman", "ReviewID": "RB5XTLY1EYAVI", "Overall": "5.0", "Content": "easy to use and works great even though ive never had good luck with wireless products these cameras perform very well.", "Date": "February 19, 2013"}, {"Title": "Last ad on", "Author": "finetrim", "ReviewID": "R25TIECWYAF6J", "Overall": "5.0", "Content": "This is the forth camera for my system, for the money it's a great system being wireless is very nice.", "Date": "February 10, 2013"}, {"Title": "Easy", "Author": "P. Cassidy \"Patricia\"", "ReviewID": "R3OXF1S4JYOGHK", "Overall": "4.0", "Content": "Right out of the box, set up was easy step by step.  The wireless connection full signal strength with the camera mounted on the outside end of my home 89 ft from the receiver. I do have a yard light on that side of the house and able to see 120ft to my back yard fence line much brighter and clearer then the previous bullet cameras without night vision.  The intercom works well as I was able to call for my horses out in the pasture and they came up to the fence looking for me. (felt bad so I went out and got them a little hay for their trouble lol) set the record time and it did exactly as it was set.  The motion alarm works within the 20ft as my dogs keep setting it off so I know it works and grabs my attention.  I have not tried the motion record, needed this set up to record continuously in one area when I drive into town to watch my Hay supply that has been hit several times.Great set up in one package,love the receiver for SD recording, recorded picture is clearer then others I have used not going to get a clear face at a distance, but am happy with the distance I can see in comparison to other cameras I have tried. Easy to view on my computer just popping the sd card in.  If your not tech savvy you will do great setting this system up.consmedium winds dips the signal up and down will Blank the screen a few seconds ( will get the booster you can add to this system see if it helps the wind situation)Concerned that these cameras are not completely weather proof and out here you just can't get away from the weather, outdoor cameras should be outdoor cameras.", "Date": "January 23, 2013"}, {"Title": "Poor quality but it works fine", "Author": "Esteban A. Valle \"--Don't ask what Windows ca...", "ReviewID": "R2ZFKSCFLLVTWH", "Overall": "4.0", "Content": "The product is made from poor quality but you only pay a low price for it. The video is really low resolution and there is about a 2-3 second lag but it works okay. Motion detection is poor at best, and dies off after about 15 feet.", "Date": "January 7, 2013"}, {"Title": "Upgrade Option", "Author": "Kirkacola \"kirkacola\"", "ReviewID": "R1S06HXIIPSX0X", "Overall": "4.0", "Content": "The only thing missing is an upgrade option to another camera or two.  Everything else met my expectations and requirements", "Date": "January 6, 2013"}, {"Title": "Review of product", "Author": "Michael Atkinson", "ReviewID": "R1VP0ZMXTBJZTS", "Overall": "4.0", "Content": "The only problem was that the motion detector failed on one of the cameras after a week or so.  Not sure why, by my son suspects a bird might have pecked it off?  Tha camera still works. just not the motion detector.  Any way we could exchange that ne camera?  Michael", "Date": "January 2, 2013"}, {"Title": "Wide angle", "Author": "Antonio Michel mc 372", "ReviewID": "R24P3X0FKIAP99", "Overall": "4.0", "Content": "The only thing I don't like is that it does not have wide angle capabilities. The camera is great but at close range it only cover a very limited area", "Date": "January 1, 2013"}, {"Title": "Goood", "Author": "edgarortega", "ReviewID": "R1XJWNMFMHWMCK", "Overall": "5.0", "Content": "Good Quality Definition picture perfect and easy to install I love tris brand .the packaging was poor  . ,", "Date": "December 31, 2012"}, {"Title": "Works wonderfully. Forgot I needed to plug in the camera even though it was wireless.", "Author": "Mary White", "ReviewID": "R3S8WPYHU7PW41", "Overall": "5.0", "Content": "I bought the camera the camera because my 90 year old mother said someone was ringing her doorbell in the middle of the night. It was easy to use. I kept it on motion sensor recording to an SR card. Mom could not deal with a computer. It worked beautifully. We noticed she had been putting food out for the animals at night and had a veritable zoo visiting.  It's very sensitive. A wire blowing near the camera would set it off even at night.One day I took the camera down and did not have time to put it up. I duct taped to the post  and it worked for a week like that. I would recommend this camera.  I bought only one camera for the back door. I would buy one for the front if I did it again.", "Date": "December 29, 2012"}, {"Title": "rex Wireless Accessory Camera LW2711AC1", "Author": "Harold Bagwell", "ReviewID": "RCSR175GBJYIE", "Overall": "5.0", "Content": "This camera work great daylight or dark, well worth the money. It works great with the system I already have.", "Date": "December 11, 2012"}, {"Title": "For the price it's a nice system", "Author": "Don Cajone \"CJB\"", "ReviewID": "R2805JNIBBHMUR", "Overall": "4.0", "Content": "I have had this installed for a few months now. The cameras work well and within my expectation. Install was very easy. Signal strength is good, nightvision and alert are good to and within the specs they cite.  All in all this is a good system for the fairly low price. I will probably add cameras to the existing system.", "Date": "December 5, 2012"}, {"Title": "Good product", "Author": "barbarare", "ReviewID": "RAX22IERIYM94", "Overall": "4.0", "Content": "Had to have help to install it but it is good quality so far.  I have not had that much trouble but thought it was necessary to protect my property.", "Date": "November 28, 2012"}, {"Title": "Poor Technical Support", "Author": "Lee Lacy", "ReviewID": "RACGVJX8TYNNU", "Overall": "2.0", "Content": "The 9\" LCD Monitor is cheap and the plastic stand does not keep the LCD upright. In addition, the toggle switch broke off making the LCD non-mission capable. Technical support is in India and the wait times are very long. It took six hours to get a call back and all the technician did was tell me another technician would have to call me, despite the fact the LCD is useless without an operational toggle switch. I have a feeling theya re going to give me a hard time over a cheap LCD and some how this is my fault. Otherwise the cameras work well and the wireless functions as advertised. Won't buy again because of poor tech support.", "Date": "October 12, 2012"}, {"Title": "Amazon Sells Used for New", "Author": "Tom", "ReviewID": "R2U6PZOS3K1ZRZ", "Overall": "2.0", "Content": "Ordered a NEW second Camera for security system got  Used 2 times. First time unit had scratches on back of unit. Camera Picture had problems of fogging up. Returned unit was replaced, with another that has better picture but sensor is defective causing False triggering of monitored pictures. Same and Better products were purchased elsewhere..", "Date": "December 3, 2011"}, {"Title": "Great System Easy setup no hassle warrnty+++++", "Author": "Joni L Papez", "ReviewID": "R27A8212MED7TO", "Overall": "5.0", "Content": "Great System .....had camera die after 3 months use ....filled warranty info online, got no communication from company but to my surprise a new camera arrived just a few days later. no hassle very impressed (except for the no communication part ((was getting kinda mad)) but am now extremely happy  VERY RECOMMENDED", "Date": "June 16, 2013"}, {"Title": "BEWARE of Lorex... missing parts & broken items... won't refund or replace", "Author": "Anthony Selking", "ReviewID": "R79A70H4UIG1S", "Overall": "1.0", "Content": "I purchased a system from Lorex and when I opened the box, it was missing parts, so Lorex said that I had to purchase $50 worth of parts (power cord, remote control & mouse) to make it work. Yes... those items should have been in the box (as stated on the box). After buying the parts and plugging it into an outlet, it did not work. Lorex does not want to replace or refund it. I have been fighting with Lorex for over a year about this. I went to Wal-Mart and purchased a system that I installed and had working in just a few minutes. Save your time & money, go to Wal-Mart and get a different system (not made by Lorex). I wish that someone would have warned me about Lorex and they way they treat customers.Also, if you have a problem with Lorex products, you are told to submit a (claim) ticket on-line. After they can't or better yet \"won't\" help, they cancel your ticket and if you want to continue to fight them, you have to submit another ticket. Like I said, I have been fighting with them for over 1 year (they cancel my tickets)... do you want to do that to?????????????????? Just thought I would help.", "Date": "April 28, 2013"}, {"Title": "Add on cameras are difficult to find", "Author": "Lolita L", "ReviewID": "R3DFXDQ6A05QUK", "Overall": "3.0", "Content": "Additional cameras are difficult to find. The camera system works good otherwise. If you want to add more cameras (holds up to 4) good luck finding matching models of cameras to add on. Does anyone else know what model add on camera is available for this LW2902 system?", "Date": "April 7, 2013"}, {"Title": "No chargeable Monitor", "Author": "Subdiv6gurl", "ReviewID": "R2FB5OEQT01L9I", "Overall": "3.0", "Content": "where's the battery operated monitor? this is 2013.... come on! Other than that it's just ok. Works like it should. Nothing special.", "Date": "April 1, 2013"}, {"Title": "False advertisement", "Author": "vt", "ReviewID": "RMSZL7WJT5VYE", "Overall": "1.0", "Content": "Do not buy this unless you have an iPhone or iPad for remote viewing.  Though the ad says works with your smartphone, upon opening the box and setting everything up, it clearly says it will not work with anything else.  Also, it recommeds you buy a 32 GB SDHC card with it for recording, the instructions in the box says it will not take anything more than a 2 or 4 GB card.  Also, don't get this if you have Windows 8.  Only works up to Windows 7 or Vista.I returned the camera and SDHC card.  Only received refund for the camera, not the SDHC.  Fortunately Amazon quickly honored my return/refund.  Awesome Amazon!  Too bad Amazon chose to work with this shady company.Bait and switch marketing. Beware of Lorex. Shady company.  Definitely will never buy anything from them again.", "Date": "February 18, 2013"}, {"Title": "Great Camera for our barn", "Author": "Kindle Customer", "ReviewID": "R3BDW1IID5OLRU", "Overall": "5.0", "Content": "We bouhgt this camera to go with one we already have and it works fantastic even at night we can see the horses in the barn.", "Date": "November 26, 2012"}, {"Title": "Lorex Wireless Video Monitoring", "Author": "Dale B", "ReviewID": "R2CKA29RFIZ09Z", "Overall": "5.0", "Content": "The unit and cameras were very easy to install. The only drawback is the limited distance, camera to monitor, required to pair and maintain video. Would recommend increasing the wireless transmission strenght to reach through solid objects easier. The price is exceptional. Keep up the good work.", "Date": "October 31, 2012"}, {"Title": "Little camera, Big performance!", "Author": "NC Mike", "ReviewID": "R9S9F25HYWC6Q", "Overall": "4.0", "Content": "I bought the set with a 9\" monitor and 2 cameras.  About 6 months later I had a new building and wanted to keep an \"eye\" on the contents.  This camera is smaller than the other two but provides the same features. Linking the new one was quick and easy and I have a bright view of the inside of the building even in complete darkness. If needed, I now have the ability to provide law enforcement with high quality color video of any intruders.  All without a monthly fee!  The only reason I gave it 4 stars instead of 5 is because it has to be plugged in to work.", "Date": "October 24, 2012"}, {"Title": "Read the fine print very misleading with wireless security because it is not", "Author": "suzannne", "ReviewID": "R983Z5EE5R0FF", "Overall": "1.0", "Content": "Truly disappointed as you must plug the cameras in....clearly not wireless waste of timeWords you see first should not be wireless", "Date": "September 5, 2013"}, {"Title": "im watching you", "Author": "HotaCe", "ReviewID": "R1YSODUZC0ALQM", "Overall": "4.0", "Content": "good stuff. they dont mess up my wifi at home. picture is clear. range is great. sound is clear also. they will not record motion through a screen or glass but when placed outside they work great. sometimes they pick up shadows as motion but its good for 90 % of the time. much cheaper option then the others for what u get. i havent tried to moble set up yet but it seems like it would work easliy.", "Date": "June 18, 2013"}, {"Title": "I like it but........ a few gliches in the product, small screen ect.", "Author": "Stephen C. Handy \"The Phone Dude\"", "ReviewID": "R1WK0VC949O14R", "Overall": "4.0", "Content": "Good cameras but if I hadent needed them so badly I would have waited for the price to go down some. screen goes blask after a week plugged in, stil a fair immage you have to be right there and watching close. but range and cameras at night good.", "Date": "May 24, 2013"}, {"Title": "Lorex Wireless Camera", "Author": "Jane S. Bishop \"ED nurse\"", "ReviewID": "R4CC5HLF7F6TF", "Overall": "4.0", "Content": "Our Volunteer Fire Department purchased these cameras as we have been missing some expensive items from our VFD that we worked hard to come up with the money to purchase.", "Date": "January 4, 2013"}, {"Title": "Adequate", "Author": "Roger J. Buggle \"Roger Jerome Buggle\"", "ReviewID": "R3H4TE29AKB7KY", "Overall": "4.0", "Content": "If the two cameras provided with the receiver are factory programed the day time feature works well.  The night vision is less then expected, but it does give the viewer a security outlook.  I'm thinking of looking for a more aggressive security camera that gives a better visionary output for a different area of my home.If you purchase a separate camera in excess of the two cameras that come preprogramed the output (distance) isn't the same as the original receiver with two cameras!", "Date": "November 29, 2012"}, {"Title": "Night vision & recording issues", "Author": "Lori R. Bustamante", "ReviewID": "RZFSOP22BWB0F", "Overall": "2.0", "Content": "To me this is a great camera with no perks.  It is easy to setup.  Since I live in an apartment I cannot drill holes through the wall to setup outside, so my cameras are sitting on the windowsill looking out.  When the night vision lights come  on at dusk all I can see is the reflection off of the windows (per manufacture - too bad for you as they can not turn the lights off)  It does not pickup any movement even when there is.So pricing, not so good as all the perks do not work properly inside looking out.", "Date": "April 8, 2013"}, {"Title": "Good Camera for Price", "Author": "RONI MYERS", "ReviewID": "R3JY7WCSAPVKVC", "Overall": "4.0", "Content": "Lot better camera than the 2301 model.  Better color.  Do get an occasionalfalse IR alarm on this model that I didn't get on the 2301 model.", "Date": "November 23, 2012"}, {"Title": "Horrible", "Author": "Jason Altman", "ReviewID": "R339IN3H3CGXC1", "Overall": "1.0", "Content": "This was the worst shopping experience I have ever had. The product worked for five minutes and hasn't worked since.  Lorex customer service is horrible.  It has been over a month and I still don't have a working product.  I'm going to dispute the purchase with my credit.  Amazon should not do business with them.  They suck they suck they suck.  I paid $40 to overnight to them.  They said they sent me a ups slip, which they did but  I got it 5 days after I sent it.  I'm out $260 for a $179 product that I can't use.. FU  Lorex. You have no business being in business.", "Date": "October 11, 2012"}, {"Title": "Misleading Information", "Author": "Kapil Agarwal", "ReviewID": "R3SLZ2EXSN9JTR", "Overall": "1.0", "Content": "I was told it is a wireless but it does not mention it requires a power outlet for installation :(", "Date": "April 2, 2013"}, {"Title": "Best Video System  For The Money", "Author": "Jimmy L. Anderson \"huckfinn\"", "ReviewID": "R36KJXHLNK4MSF", "Overall": "5.0", "Content": "This video system is vary good it come's with every thing you need to get started and it has a great picture  on the monitor  i would rec amend  it to any one i give this an A+++++++++++", "Date": "September 27, 2012"}, {"Title": "Fashion and a simple and effective monitoring system", "Author": "Jiang Jun", "ReviewID": "R8ZFD2TPU6YM8", "Overall": "5.0", "Content": "I purchased a set of Lorex LW2912 Wireless Video Monitoring System, contains only two surveillance cameras, LW2711AC1 as additional surveillance cameras.Buy Lorex LW2912 Wireless Video Monitoring System is used to view his son's activities at home in the unit through the network, both installed in the room, two installed outdoors.Advantages: 1) a strong wireless capabilities, an interval of two concrete walls, you can normally receive the signal; 2) around the dimmed display black and white, surrounded by the light to show color, light sensitivity is high; 3) surveillance cameras, and LCD panel exquisite.Disadvantages: 1) Introduction outdoor camera, but not waterproof, can not be installed outdoors rain to; 2) The video can only record a camera, the defect is very rough; 3) preset memory standby picture, fine resolution is not enough; 4) had wanted to buy a 7-inch LCD, feeling the 9-inch LCD will be even greater, the content displayed will be finer, but the fact that the effect should be the same, the camera resolution is not high enough, similar to the analog camerathe first 480 lines.In short, as the monitoring and recording equipment, the Lorex LW2912 belongs to Simple, mounted on the wall, placed in the bedroom, is a very cool, very stylish device.", "Date": "May 24, 2012"}], "ProductInfo": {"Price": "Unavailable", "Features": "Record audio & video\n4.5mm F2.0 lens with 52 degree field of view\nVGA (640X480) resolution\nQuad view option to view 4 cameras at once\nUp to 150ft indoor / 450ft line of sight outdoor range", "Name": "Lorex LW2711 Wireless Video Monitoring System with Remote Viewing", "ImgURL": "http://ecx.images-amazon.com/images/I/51xhKxtr2hL._SY300_.jpg", "ProductID": "B007P7MXTC"}}