{"Reviews": [{"Title": "Not bad for a wireless IP camera", "Author": "CoyoteTeacher", "ReviewID": "R22UG7C91O7DEL", "Overall": "3.0", "Content": "First thing to note is that this is simply a rebranded Foscam FI8918W.  As such, you might want to buy the Foscam FI8910W instead, as the FI8918W is an improved version with a better picture at only $10 more.  (I have both of these cameras.)The following comments are for both of the mentioned cameras:Set up can be a little frustrating--the wireless took several tries before it took.  If you use IE to set this up, you will have to search the forums (maybe the foscam.us forums, too) to resolve an ActiveX plugin problem.  I used Firefox.Audio doesn't really work very well.  I haven't tested in in IE, but after installing VLC (only the Mozilla plugin and \".asf\" files), I got a lot of noise, as did many other reviewers.Finally, for Windows Phone 7 users, the Ip Cam Controller app from Jerry Huang works very well.", "Date": "May 23, 2012"}, {"Title": "A MUCH better solution than Panasonic or Linksys--and an ipone App to boot!", "Author": "LBO", "ReviewID": "R9J3RYKMX6BBG", "Overall": "5.0", "Content": "Tried linksys and panasonic internet cams.  Then one day, email alerts just stopped coming (no changes at home).  Tried these and now have 4!  They have Infra-red, so I can see in the room when the lights are out and nighttime. There is an iphone/ipad app so I can quickly view without having to keep entering UN/PW (there are many apps, so pick your fave). Warranty support is great (one stopped working and they just replaced it through Foscam.com). I have 4 cameras at 2 locations and can easily scan the different ones.  Email alerts are great, can save to FTP site, and setup is easy.", "Date": "December 10, 2012"}, {"Title": "Best wireless camera I know of", "Author": "Gregory G.", "ReviewID": "R25NYXP1HGOB0A", "Overall": "5.0", "Content": "I can watch my cameras from my smart phone. It's super convenient. I also use my Apple (non-pc) computer to watch my warehouse when I'm not there. It makes me feel much safer.", "Date": "September 23, 2013"}, {"Title": "Good when it works", "Author": "James E. Simpson", "ReviewID": "R57PR8WIL72QJ", "Overall": "2.0", "Content": "I have found that the cameras seem to work some of the time and then don't.  I set them up using the Insteon Hub and that may be part of the problem.  The range seems very limited with camera's not picking up signals only about 10 feet from my wireless repeater.  When they work they work fine.  Problem seems to be with wireless signal - they need a really strong signal to work.", "Date": "July 18, 2013"}, {"Title": "A must buy for a new Mom and Dad!", "Author": "Chris", "ReviewID": "R3GPQ1OVJV2YDY", "Overall": "5.0", "Content": "My wife and I were searching for a baby monitor camera with audio for months, but they were all in the $150+ range. We happened to walk by the Insteon Wireless IP Cam in Home Depot, and it was less than $100, and of course it was even cheaper on Amazon. We were somewhat cautious because we thought we might need the Insteon Hub as well, but after reading the product description and other reviews, it appeared that the camera would work on its own without the hub, and it surely did.The wireless camera has far-exceeded our expectations. The quality is surprisingly crisp, and more than adequate as a baby monitor. What was more impressive is the IR mode during night-time still provides an exceptional picture, so that we can see all of our daughter's facial expressions to know when she needs us. The camera was easy to setup using the provided instructions, with the only tricky part figuring out how to get the audio to work. After a quick call to the tech support (he was quick and provided exceptional customer service), I learned that the audio works in two different modes. First, using Internet Explorer, once you install Active X, the audio button is in the top right of the video picture (headphone and microphone). Second, I downloaded an App on my I-Phone called \"IP Cam Viewer.\" The lite version is free and provides video only, but the Pro version that I downloaded only cost $3.99, and it provided video and audio, and I can see it anywhere with a data or Wi-Fi connection. We are extremely please with the Insteon Wireless IP Camera, and fully recommend to others out there.", "Date": "April 29, 2014"}, {"Title": "Not that good", "Author": "Ira N. Botnick", "ReviewID": "RD78XXI8AK52I", "Overall": "2.0", "Content": "i purchased 2 cams - setup was confusing, but the biggest problem is the cam's picture is not that good - color is way off.  The software that you use to see whats on the cams is pretty amateurish.You can only use internet explorer to have multiple cams on the screen.Biggest problem, again, the picture is not that good compared with other cams i have.", "Date": "June 29, 2013"}, {"Title": "Great camera but requires tech knowhow", "Author": "tiktin", "ReviewID": "R2CKNLRR4875J5", "Overall": "4.0", "Content": "This is a superb camera but it is not for the technologically challenged. The hardware, software and manual all originated in China. The English translation of the manual is pretty good but not perfect. The system was designed for Far Eastern conditions so it requires a little adaptation if you are in the U.S. Download and study the manual before you try to install this. Do not rely on the \"quick start guide\". There are two ways to use this camera - with a computer or with a smartphone and HUB (which you have to buy extra). I tried both. The HUB failed on me after a week, but you are much better off using a computer with their control program (free download or CD). Much more control. Be advised you will need a Windows operating system on your computer and while it will work with firefox or other browser, it is really designed for Internet Explorer. Note that you will have to enable UPnP to access this camera remotely. You cannot do it manually (at least so far as I know). Port forwarding you can set on your router. Once installed you can access your camera via the Insteon cloud or directly via camera's program on your computer. The latter gives you much more control.The camera can be connected either by ethernet cable or wireless. I am using wireless and it works really well, but my camera is close to my gateway so I cannot say what the wireless range is. I am using WEP encryption, but it will work with WPA, WPA2 or open system (no ecryption).This camera has more features than you can shake a stick at, too numerous to all mention here. The picture is sharp and clear. The night vision is really amazing. It is fully automatic and the picture it displays from total darkness looks like it is broad daylight. The pan and scan work well locally or remotely and give you a wide field of vision. 300 degrees horizontally and 120 degrees vertically. It has two way audio so you can hear as well as see what is going on and scare intruders by saying something like \"You are under arrest!\". I haven't tried all the other features, which include motion detection, recording (both automatic and manual) automatic alarms, e-mail or messenging notification of intrusions, and a host of other features which you can read about in the manual. An amazing device in a small package.", "Date": "August 7, 2013"}, {"Title": "Security Camera", "Author": "Curtis", "ReviewID": "R2HS270M2EN1YV", "Overall": "1.0", "Content": "Not user friendly, had to call the company download gotomeeting they then did setup on my puter. After that was done it still didn't work right, to this day I don't use it, waste of money, to complicated for the average person.", "Date": "May 25, 2014"}, {"Title": "ip Security camera", "Author": "Harold Davidson", "ReviewID": "R14CUT04AELV85", "Overall": "4.0", "Content": "Easy to set up.  Had to use tech to assist with update but otherwise easy to use.  i love the infrared camera features.  Can use it anywhere you can have / put power plug.", "Date": "May 16, 2014"}, {"Title": "Great camera!", "Author": "Richard Peters", "ReviewID": "R8LT3KXF2SS06", "Overall": "5.0", "Content": "The camera has a good picture and the control from a smartphone and tablet works well.  I am still working to get the system set up but so far the IP camera is great!", "Date": "April 6, 2014"}, {"Title": "LOVE THIS", "Author": "lwilli01", "ReviewID": "R2WEB60EPKILPG", "Overall": "5.0", "Content": "Great product definately need an app to set it up or use.  There is no zoom but inside your house I don't think it's necessary.", "Date": "January 29, 2014"}, {"Title": "Great", "Author": "birddog", "ReviewID": "R1CSQ0OLMK1LRO", "Overall": "5.0", "Content": "Very easy to set up and use especially if you are using the insteon hub and iPhone app. No need to follow all the page 2 info for accessing from outside your home. Can't get sound from iPhone to camera yet but can from camera to iPhone or PC. Great picture and alerts work good. Just wish it would video record on demand. If you have trouble with it make sure you have a good signal or a range extender in the same level.", "Date": "January 25, 2014"}, {"Title": "Impressive little camera", "Author": "Capt Ron \"fairwinds\"", "ReviewID": "R25FJPAADVWHQS", "Overall": "4.0", "Content": "I couldn't get a wireless connection but hardwired, its an impressive camera especially or the price. Good quality picture, pan and tilt", "Date": "January 11, 2014"}, {"Title": "Works great", "Author": "Atefeh Mousavinik", "ReviewID": "R3JCG21DA5N5C4", "Overall": "5.0", "Content": "I bought it to watch my wife's  little dog. It works great. I can see her, from my phone, and work computer.", "Date": "July 5, 2013"}, {"Title": "Would recommend to a friend", "Author": "Ken", "ReviewID": "R26W246L766KYS", "Overall": "4.0", "Content": "Easy setup and works like it says it does. I would recommend this to family and friends, for the price it can't be beat.", "Date": "August 13, 2012"}, {"Title": "Overall I am pleased with this product", "Author": "Nathan", "ReviewID": "R3K5WSXWIIJII2", "Overall": "4.0", "Content": "I purchased this because I have a child that is over active and gets into everything when your not looking.  Sound familiar to anyone?  Anyway, this camera is very clear, I love the picture quality even though it is 640x480 resolution.  I will say that not everything that they advertise seems to work though.  For instance I still have not been able to get the sound to work consistently, I will say that most everything else does work.  It has a lot of settings that you can configure.  I love the email me alerts, which I set for when my child is asleep.  As for the setup, I am very knowledgeable about networks andIP addressing.  That being said, I had no trouble setting this camera up.  If I did not understand networks I may have had some trouble and gotten frustrated with the instructions.  Again, I am pretty good at this type of stuff and I didn't even use the instructions because I understand basic networking. So, if you not so good at networks, take the time and read the instructions, more than once if necessary.  From what I saw, they seem to be pretty good.  Be patient and don't get frustrated.", "Date": "January 25, 2013"}, {"Title": "A Disappointment", "Author": "Jerry M. Nichols", "ReviewID": "R19VBUS4B23E0L", "Overall": "1.0", "Content": "First of all, I'll say that I'm not a computer professional and don't have a lot of motivation to spend hobbyist-like time on getting this kind of stuff working. I just want it to work.Unfortunately, I found it to be a very challenging installation procedure. The directions missed several steps, and wander off into jargon repeatedly (why do programmers always do this?), but you should be able to figure it all out and get it running if you're only going to be using it with a computer. Image quality should be acceptable, depending on your needs, and the controls in the web browser are good. The camera seems well built. So far so good, but with the sloppy directions I would give it a B+ so far.However, if you want to use it with a cell phone app, beware. The sequence of installing the app was ridiculously and needlessly complex. After many wasteful minutes on the phone, though, I had finally got the iPhone app working, at least in the room where I had installed the camera with my laptop. Note however that the mobile app streamed data at several MB per second even though nothing was changing in the scene. I burned through 50 MB in no time while checking out the image as I was on the phone with the help desk, to make sure everything was functioning as it should. If you're paying for data (i.e. not on an unlimited data plan), you'll reach your limit very quickly. I had intended to use this to monitor our dog while we were away. The built in incentive is certainly... don't use it very much.. and hope that nothing happens to the dog between your viewing time!But, pressing on anyway, and finally thinking everything was ready to go, (after accidentally hanging up on the Insteon rep, who didn't call back even though I had given him my number), I then moved the camera to the location where I would be using it to see if, from throughout the house, I could see the camera images on my iPhone. The system failed on the first attempt. The camera and iPhone could not connect. When I brought the camera back down to the room where I had installed it, it was as if nothing had ever been installed. Puzzling new feedback/text/questions/etc appeared on the computer screen and on my iPhone. I was lost and gave up. I will return it, as I don't have the time or motivation to decipher the poor design and implementation of others.Overall, although the Insteon help desk was very helpful and competent (but it took 48 minutes to get a human to answer), this is unfortunately a very poorly designed system if you're looking for cell phone access to a remote camera (note that a cell phone features prominently on the box). Very little thought has been given to simplifying installation, and the range of the camera relative to the wi-fi and/or cell phone seems too limited. My overall impression is that it's an unstable and user hostile system. I would avoid it.", "Date": "December 27, 2013"}, {"Title": "Great home monitoring!", "Author": "Reaper01", "ReviewID": "ROIBMD639YRCY", "Overall": "5.0", "Content": "Have set up in my living room to check both inside and through the windows the front of my house and driveway with motion alerting which sends an email with photos when motion is sensed ! Works GREAT!", "Date": "October 29, 2013"}, {"Title": "Very disappointed", "Author": "R. Mathes \"Coach Mathes\"", "ReviewID": "RC3Z616EVNK0X", "Overall": "1.0", "Content": "The setup was seamless, and the smartphone feature is great. I am giving this a one star because the image looks like the surface from mars. I read the instructions, and switched frequencies from 50hz to 60 hz to outdoor setting, to no avail.", "Date": "August 12, 2013"}, {"Title": "Great value", "Author": "blackling", "ReviewID": "R38KX3MSCCZ1VW", "Overall": "5.0", "Content": "I really like this camera. It is easy to set up and it gets the job done. It does not have the highest quality picture in the industry but it is good enough for what most people need it for. I purchased it to go along with my existing Insteon network with a hub. I already had a camera setup working perfectly so when I connected this camera it integrated into the system without any additional configurations. I was pleased with that because the initial camera took a few tries to get it right. I can't speak highly enough of Insteon's Iphone/Ipad app. I believe it is the best out there at that price point. One other feature that is overlooked is the night vision. It works as advertised.", "Date": "September 13, 2013"}, {"Title": "Great security camera", "Author": "Michael Steelman", "ReviewID": "R3Y1YA8KPV2FW", "Overall": "5.0", "Content": "This camera is great for putting in an apartment or home! It works great for what we use it for. I wish it took and saved video. It takes screenshots and you can get it to send those shots to your email. Pretty cool!I've recommended this to friends and after getting it set up they really like it.", "Date": "February 3, 2013"}, {"Title": "Good little camera", "Author": "Sammy C", "ReviewID": "R2TP4ETMC7NJFB", "Overall": "5.0", "Content": "I purchased two of these cameras from Smarthome for use in my home. Note: setting up the second one only takes a second once the first one is up and running. Camera requires port forwarding, which if you have set up a router you can do. If you are afraid of \"getting your hands dirty\" with regards to getting into your computer's set up, this is not the product for you.", "Date": "July 22, 2012"}, {"Title": "Horrible procuct.  wish i had read more reviews before i bought it.", "Author": "J. W. Berry \"matesjnv\"", "ReviewID": "R1L9MCOWY1ZBM7", "Overall": "1.0", "Content": "I bought this thinking it would be a super way for my daughter to be able to see her daughter while in her crib sleeping.  I NEVER was able to get it to work. And after doing some searching on line, I found out I was not the only one.find something else.  this just does NOT work as advertised.", "Date": "December 23, 2013"}, {"Title": "Cool product, it would have been nice if Wifi works.", "Author": "RANDY MUYARGAS", "ReviewID": "R2MGRUHBVR8017", "Overall": "3.0", "Content": "Product was cool and works well with copper connection.  It doesn't work with Wifi though.  Called OEM technical support and the support level leaves a lot to be desired. I would have given this a 5-star had the WiFi work or at least manufacturer's after-sales support handled the support call properly and got WiFi to work.  Since we can get this on copper connection anyway, I'm giving it a 3 star.", "Date": "March 15, 2013"}, {"Title": "works GREAT!!!!  and Easy to setup!!!", "Author": "D. Montes \"Daniel\"", "ReviewID": "R3OW25PSQ7706X", "Overall": "5.0", "Content": "This is a great product and it was very easy to setup.  I would recommend this to anyone who is looking for a very usable security camera.", "Date": "February 5, 2013"}, {"Title": "Pretty cool.", "Author": "Justin Houtz", "ReviewID": "R5JT2GVJZWJM4", "Overall": "5.0", "Content": "I have average knowledge when it comes to computers and, I would say, this was moderately difficult to set up.  I'm sure the instructions are adequate if you understand all the networking lingo.  I myself did not.  It was easy to get up and running in a local network but, outside of that, it was complicated for me.  However, a quick 10 minute call to the customer service center got me completely up and running.", "Date": "February 26, 2013"}, {"Title": "Horrible instructions and support", "Author": "Dean Moore", "ReviewID": "R2K04C1O37OSU8", "Overall": "2.0", "Content": "Unless you make a living supporting networks this is probably not for you.  Instuctions are poor to useless  Called tech support who was rude and not helpful.. Shows an iPhone app, lots of luck, I checked the first twenty in iTunes and NONE supported this camera.  Avoid this company!", "Date": "January 12, 2013"}, {"Title": "Insteon IP cameras", "Author": "Sergio Blum \"Sergio\"", "ReviewID": "R1BP3CVPFHFUVS", "Overall": "1.0", "Content": "The Customer Support of Insteon is the worst that I ever saw. They do not have any desire to help and try to send youto various manufacturers of the modem, router or laptop for possible answers. They even suggested that I contact Foscamfor assistance since the camera and software is in fact theirs. Of course, Foscam will not service Insteon labeled hardware so here we go. What a sham and what a bad product!", "Date": "May 10, 2013"}, {"Title": "Do not waste your money!", "Author": "kgirl", "ReviewID": "R2HI8ANOK1NZ2Z", "Overall": "1.0", "Content": "This is one of the worst products that i have ever bought.  It takes a genius to try to download and set up and cannot even get the thing working so I will be sending back to Amazon at a huge $$$ loss, but do not care because it is useless.", "Date": "March 14, 2013"}, {"Title": "Now that time has passed", "Author": "Robin", "ReviewID": "RZSSVWTYJUBCD", "Overall": "3.0", "Content": "We have never been able to figure out how to get this thing to work in our wifi so that we can see it when we go on vacation soin the end it is useless. I am sure given time which we don't really have we could get it to work but if u just want to watch another room or your yard while at home its great.", "Date": "February 9, 2013"}, {"Title": "Perfect as expected", "Author": "deepti", "ReviewID": "R20T5SP7KRWA6P", "Overall": "5.0", "Content": "Could use with my broadband connection ADSL (port forwarding setup) and no-ip.org to access over internet. Also camviewer App on iphone works without any problem. Just to be remembered that it can be viewed over internet from the other network not from you own connection. Can be viewed using the lan ip only from inside your home network. Wifi also works perfectly. Audio is little noisy still acceptable.Look and setup is exactly same as Foscam cameras.Overall satisfied fully.", "Date": "September 24, 2012"}, {"Title": "Hard to install", "Author": "Mark T", "ReviewID": "R2WY0UEBA9SWDB", "Overall": "3.0", "Content": "Still haven't installed it,you have to be a genius to use this product,not or a novice like me but I'm not a very smart man", "Date": "August 27, 2013"}], "ProductInfo": {"Price": "$99.99", "Features": "Monitor your home or office from anywhere in the world with an Internet connection\nMotion activated-receive emails with still shots if motion is detected\nCompatible with Smartphone/Internet connected devices (iPhone/iPad, Android and Blackberry)\nExcellent night vision capabilities-IR LEDs can provide vision up to 8 meters (26-Feet)\nRemote pan/tilt functionality-3000-Degree pan, 120-Degree tilt", "Name": "Insteon 75790 Wireless IP Security Camera with Night Vision, Black", "ImgURL": "http://ecx.images-amazon.com/images/I/41zn8GLWAyL._SY300_.jpg", "ProductID": "B00797MF8M"}}