{"Reviews": [{"Title": "Inexpensive yet functional.", "Author": "salmmon", "ReviewID": "R1U26K09V4QYB7", "Overall": "5.0", "Content": "For something this low priced I would always expect to upgrade the HDD right away. The unit is pretty easy to setup and get ddns to work for remote viewing through cell apps.", "Date": "March 30, 2013"}, {"Title": "Awesome!!!!", "Author": "Angel", "ReviewID": "R32FDVYUJCMGL7", "Overall": "5.0", "Content": "Such an awesome piece of equipment. Love the fact that I can connect my tablet and/or phone to check on things.", "Date": "December 12, 2012"}, {"Title": "it works", "Author": "Shad", "ReviewID": "R22V6CSPFK2CS3", "Overall": "4.0", "Content": "setup is easy, basically just plug and play basic common sense which you will need as the manual is writtin in BAD chinglish but once you figure out how to get thru various menus to playback recorded vids etc it does work fine, cameras provide clear vid although obviously not high def, for the price, just above $200 with 4 cameras, I'd buy it again if I had to", "Date": "June 18, 2013"}, {"Title": "Not Satisfied", "Author": "Mario A.", "ReviewID": "R2HUNBLJ7XKF24", "Overall": "2.0", "Content": "I purchased this item with the expectations that i will be able to have some type of security around my home. I dont have that because of the poor quality of the image. One of the cameras has a stripe on the right side of the screen. I finally figured out how to view cameras on laptop (internal) on my wifi network. I have yet to connect remotely on my cell phone. The worst part of this item is the absolutely horendus customer service. I have tried several times to contact the manufacturer by email, Phone and internet (live chat). I cannot get any resolution to my issues with this product. Normally i am not a complainer but after spending over 200 dollars i expect not to have any issues.", "Date": "June 11, 2013"}, {"Title": "Simple Home CCTV Device for Home Use", "Author": "Richard Bell", "ReviewID": "R3AFVGMR6RA2JM", "Overall": "3.0", "Content": "After repeated vandalism of my property, I purchased this device to provide some additional surveillance.  Set up was quick and fairly simple.I am pleased with the recorder.  It seems to perform as advertised.The only complaint I have is that the cameras supplied as part of this package, are just OK.  I was a little disappointed with their low-light performance.In order to improve the low light performance, I opted to purchase additional cameras with a higher resolution.At this point, I am not disappointed with my purchase and consider my need satisfied.", "Date": "May 30, 2013"}, {"Title": "I sleep safe and sound when I am not home!", "Author": "mary elisabeth kline", "ReviewID": "RVLN8SUBK7IG5", "Overall": "5.0", "Content": "If I could give this system a 10 star I would, because of the price and ease of installation.  Currently, I have it networked to my phone, so I can check on my family whenever I am gone for work.  It will record if motion is detected, and alert my phone through email.  The cameras that come with the system do not provide the greatest view at night, but for the price I will not complain.  I have already upgraded two cameras and can't believe the quality of video from the DVR to my phone.  I have had this system for over a year, and Zmodo makes a solid product.  In addition, Zmodo will back their product with a one year warranty and a great customer service hotline.  The only negative thing about their customer service is the amount of time it takes to reach a representative, but once they are on the phone they are very knowledgeable and polite.Good Buy!", "Date": "July 15, 2013"}], "ProductInfo": {"Price": "$399.99", "Features": "Display/Record: 240 fps\nH.264 Hardware Compression\n500GB HD Installed and Configured\nRecording Mode: Continuous/Scheduled/Motion\nSupport Remote View via Smart Phone & 3G Mobile", "Name": "ZMODO 8 CH CCTV Security DVR With 4 Outdoor IR Camera System 500GB Hard Drive", "ImgURL": "http://ecx.images-amazon.com/images/I/41aEhgSxJqL._SY300_.jpg", "ProductID": "B007TN42DW"}}