{"Reviews": [{"Title": "Quality System, some problems with mobile monitoring", "Author": "R. F. Bower \"RBower\"", "ReviewID": "RQ6OVECSV7C9M", "Overall": "4.0", "Content": "This review is for a DVR/camera package, as that's how my cameras came.  The equipment is top-notch, and easy to set up.  There are still some quirks after many revisions of the Android monitoring software, and the Remote Monitoring setup guide is a maze to follow. If you're ok without seeing your house on a smartphone, it's a great deal, otherwise be prepared to spend some hours troubleshooting.  The infrared works well, and you can mask out portions of the view that tend to active the motion sensor needlessly, like shrubbery.  Very customizable to the point of sometimes being confusing, I thought I had set a camera to be on with movement and finally found an overriding higher menu that was preventing it. But it's a very reliable system once it's set up correctly.  Much clearer than other cameras I have purchased, like Bunker Hill.", "Date": "November 28, 2012"}, {"Title": "Grate for the $$ Good quality image day and night.", "Author": "Danny \"video-dan\"", "ReviewID": "RIC0SYLMCFLHJ", "Overall": "5.0", "Content": "Got these to replace the original Qsee1424 that came with a DVR bundle. They (1424)were ok for starters but image quality was poor and night image was not what I expected. These were very good and greate night rang for a large yard and driveway. These were a substitute for QCM5265 that were out of stock.", "Date": "November 9, 2012"}, {"Title": "Awesome cameras.......Great seller!!", "Author": "David", "ReviewID": "RQUYAFLVH1F46", "Overall": "5.0", "Content": "I had a great experience!  I would recommend them to all who are looking to purchase a security system for their home.", "Date": "January 13, 2014"}, {"Title": "Q- see cant see", "Author": "Steven Blanton", "ReviewID": "ROR0ECBVCPY4B", "Overall": "2.0", "Content": "This was another mistake thought they would be the best cams for the money but after about 4 months all have stopped working or have such bad viewing i have taken them down as swapped them out. The dome cams have worked much better.", "Date": "September 26, 2013"}, {"Title": "cameras night vision goes out", "Author": "Michelle Greaux", "ReviewID": "R9MGPG4QX0AOT", "Overall": "2.0", "Content": "After returning one camera shortly after receiving the product because the night vision stopped working.  It was tested and returned to me. After two days it went out again. That was in March this year. Now one of the other cameras night vision suddenly went out. I have16 cameras including these and they are the only ones that the night vision suddenly went out. All other cameras have been working fine for over two years.", "Date": "September 12, 2013"}, {"Title": "Been Dealing with Q-See for Almost Ten Years", "Author": "Amocanes", "ReviewID": "RJBNXSPMWPBD3", "Overall": "5.0", "Content": "Had an out-of-warranty problem a few years back--a short in the wiring-plug connection.  Two destroyed power-supply units, way out of warranty.  Q-See sent me two brand-new ones.  Q-See has my CCTV business forever.  :)", "Date": "August 23, 2013"}, {"Title": "Good camera set.", "Author": "Meister Coolfresh", "ReviewID": "R2KTAG8CP5EDD6", "Overall": "4.0", "Content": "Just make sure you don't have a light bulb on at night in front of the camera (in close proximity) ... or the camera's night vision will keep turning on and off all night long and triggering the motion detection recording. Kind of a waste of time reviewing all the video that was recorded just due to the camera switching back and forth from regular color to night vision. Just keep the lights off ... the night vision works real good.", "Date": "July 26, 2013"}, {"Title": "Outstanding video package from Costco", "Author": "Allan", "ReviewID": "RHJPJJGPVEFG", "Overall": "5.0", "Content": "Bought a 16 channel 8 camera pkg from Costco. Just added 4 more 6006b cameras. Quality is superb especially for this low price. More impressive is the concierge service from Costco, simply awesome. One call and I had mobile capability for monitoring which can be quite complex to setup on your own. Highly recommend", "Date": "June 6, 2013"}, {"Title": "Better quality image than the cameras that came with my DVR", "Author": "Eddiebezzell", "ReviewID": "R22A9WGHDT2DM8", "Overall": "5.0", "Content": "I bought a swann 8 channel system with 4 cameras online which works well but the cameras are not very good at night. Bought these to supplement the 4 cameras that came with that kit and they are so much better picture at night than the swann. They work and fit the Swann DVR perfectly.", "Date": "May 23, 2013"}, {"Title": "Great buy for the money!", "Author": "genveve", "ReviewID": "R3PW4QDSXZMAFF", "Overall": "5.0", "Content": "My husband loves these cameras and found resolution to be outstanding! Again,I don't feel the need to go on and on about a product.", "Date": "March 18, 2013"}, {"Title": "Excellent product", "Author": "G.Lala", "ReviewID": "R1B4ZAJPXVVYD4", "Overall": "5.0", "Content": "Wide angle clear with high detail even when viewed through my iPhone. Would and did by a second time for a second house system. Excellent product and vendor.", "Date": "December 27, 2012"}, {"Title": "awesome", "Author": "sci-fi", "ReviewID": "R5HZ7OGED47DK", "Overall": "5.0", "Content": "Great product, excellent visual clarity. The quality is very good and the night vision range is excellent. I would highly recommend it.", "Date": "December 27, 2012"}, {"Title": "QM6006 4 pack", "Author": "Grandma Judy", "ReviewID": "R22K79D759CHIY", "Overall": "5.0", "Content": "Excellent solution fr adding 4 additional cameras to our existing survellience system.  Good value for the money spent.  Would recommend to anyone wanting to add additonal camera views.", "Date": "December 7, 2012"}, {"Title": "Buyer Beware", "Author": "PB", "ReviewID": "R335BBY6ZIWMEK", "Overall": "2.0", "Content": "I wrote the following review when I received the cameras back in August 2012. \"I just received the cameras, which came in a USPS Priority Mail box and not pre-packaged from the manufacturer. It looks like someone just dumped them a box. There was no protective packaging around the cameras. All of them came with dings and scratches. It looks they were previously used. Very dissappointing! We will be checking to see if they even work.\"The seller sent me a return label and was willing to take the cameras back, but the point was that the cameras should have never been shipped in one of those $5 \"If it fits, it ships\" shipping boxes offered from USPS.My husband decided to keep them anyway (which I highly disagreed with) since his intent was to paint them white. He figured a new coat of paint would hide the damages. Well, 7 months later my husband found someone to install the cameras and decided to finally take the cameras out of the box and paint them before the install. That's when he found one that is broken where it hangs, so it is unusable. The other three are not broken but you can still see the dents and the scratches (these are pretty deep) after painting them.Lesson learned....You are better off paying more and getting the cameras packaged from the manufacturer versus 4 cameras thrown in a box. It's true what they say....\"You get what you pay for.\"", "Date": "February 16, 2013"}], "ProductInfo": {"Price": "$349.99", "Features": "600TV Lines of Resolution\nWeatherproof cameras for indoor or outdoor use\n120 feet of night vision\n1/3\" enhanced infrared cut filters\nCamera comes with power adapter, 60ft BNC cable", "Name": "Q-See QM6006-B4 4 Pack Weatherproof 600TV Line of Resolution 120ft Night Vision", "ImgURL": "http://ecx.images-amazon.com/images/I/41iC42O5%2BCL._SY300_.jpg", "ProductID": "B007Z549YQ"}}