{"Reviews": [{"Title": "Great!", "Author": "Lyanna Benner", "ReviewID": "R2947HZENHY5QE", "Overall": "5.0", "Content": "I bought an extra cable for this camera because the description did not mention that it came with a cable. Thanks :)", "Date": "March 3, 2013"}, {"Title": "Works great", "Author": "User1", "ReviewID": "RLXLLP79IU17O", "Overall": "4.0", "Content": "The camera works great for the cost and easy to install, single wire run.  Durring the day it is real clear, at night (when it counts) it works good.", "Date": "December 14, 2012"}, {"Title": "Great Little Security Camera", "Author": "Colorado Dave", "ReviewID": "R30AXCBVQAOJSQ", "Overall": "5.0", "Content": "I got this to add another outdoor camera to my Revo video security system.  These are great little cameras to place under the eves of your house. They are best during the day when the light is good, but they work pretty well after dark as well.  The IR LEDs really throw a bunch of light out at night.  The IR picture is a bit grainy, but they always are.  I would recommend them.", "Date": "October 13, 2012"}, {"Title": "Great product", "Author": "Steve Bowman", "ReviewID": "R3D30GR5JW9A36", "Overall": "5.0", "Content": "I already owned a Revo system and just needed an additional camera. Revo is probably the best camera system for a home use. The simplicity of set up and the lifetime tech support that you receive when you buy the system is great.", "Date": "January 9, 2014"}, {"Title": "Cannot be set up right out of the box", "Author": "Ed B.", "ReviewID": "RPLJZQBSQ17TM", "Overall": "2.0", "Content": "Good wide-angle daytime picture. Excellent night vision, black and white of course. The round mounting base is sturdy aluminum, but the swivel assembly connecting the camera body to the base is plastic and should be handled carefully.The description says it has a microphone...not true.The description does not tell you what is included. An RJ12 (telephone plug) cable about 80 feet long and an RJ12 coupler is in the package with the camera, there is nothing else. You must obtain your own 12 volt power supply and you must figure out how to connect an RJ12 connector to your system. Revo sells a BNC adapter and power supply separately, if that works for you Revo RRJ12BNCKIT RJ to BNC Coupler with 12V Power Adapter.I knew it had an RJ12 connector when I ordered it, but I didn't realize what a nuisance that would be; the RJ12 coupler at the camera is not weatherproof so I had to devise a weatherproof enclosure for it from an empty tin can.This turns out to be a fairly expensive camera when you add in the cost to actually install it.There are similar cameras on the market for less money and with way less aggravation. Example: VideoSecu Outdoor Day Night Security Camera Infrared Weatherproof CCTV Home 1/3\" CCD 420 TV Lines 28 IR LEDs Wide View Angle Lens with Free Power Supply A71I would never buy this camera again.", "Date": "July 28, 2013"}, {"Title": "Ok camera", "Author": "sk92069", "ReviewID": "RKCQ4E8A24M14", "Overall": "3.0", "Content": "I bought this camera hoping to get a better picture from a long distance. It does not make the picture better but it smooths out some of the pixels. OK improvement but not what I was hoping for.", "Date": "March 25, 2013"}, {"Title": "Great camera! 600 Lines of resolution", "Author": "Peavy", "ReviewID": "R2WIY4HLC5PS9U", "Overall": "5.0", "Content": "Great product, great price. The picture is clear and the night vision capabilities are incredible. Even in total darkness the cameras show a great picture.", "Date": "March 4, 2013"}], "ProductInfo": {"Price": "$99.99", "Features": "Super High Resolution Color Cameras\nPower consumption: max 4 Watts (IR LED on)\nLED lighting distance: max 80-Feet\nAuto exposure, white balance, gain control and day and night\nBuilt in microphone for audio monitoring capability", "Name": "Revo RCBS30-2 Indoor/Outdoor Bullet 600TVL Super High Resolution Camera - RJ12/BNC Type 80-Feet Nightvision", "ImgURL": "http://ecx.images-amazon.com/images/I/41MZ8531rrL._SY300_.jpg", "ProductID": "B007MOLIEE"}}