{"Reviews": [{"Title": "Clean, Clear, and neat...", "Author": "mark  Ess", "ReviewID": "R1JDG02IQIWD8Q", "Overall": "5.0", "Content": "Nice little unit for the price. It is very clear during the day, and pretty good at night, Even better if you use an assist light for night veiwing.", "Date": "July 25, 2013"}, {"Title": "Worked perfect connected no problem and stays connected", "Author": "Dyvirus", "ReviewID": "R3J9T6C3R15V5S", "Overall": "5.0", "Content": "Make sure to double check when buying these cameras that they are compatible with your system.I know the LW2711AC1 camera even though they look identical to the LW2401AC2 don't pair with the LW292 monitoring system.Pros:Other then that this thing is awesome great picture for being wireless better then most cable connections.love the built in intercom system!switches to night vision very easily.Cons:The delay for motion recording is a little slow usually takes a couple seconds before picking up movement which is a little frustrating.", "Date": "May 21, 2013"}, {"Title": "CAMERAS WENT BAD IN LESS THAN 1 YEAR - RESEARCH OTHER SYSTEMS FIRST!", "Author": "POLICE MILLENIA", "ReviewID": "R3SKIBY5T30JEL", "Overall": "1.0", "Content": "AFTER ABOUT 9 MTHS TWO OF MY CAMERAS ARE BAD WITHIN A WEEK PERIOD. ONE DOES NOT GO BACK TO COLOR AND NEEDS TO BE RETURNED AND A SECOND CAMERA IS FUZZY WITH LINES AT NIGHT TIME ONLY, BUT IF YOU TURN A LIGHT ON IT LOOKS PERFECT.SO I AM NOT HAPPY I HAVE TO UNINSTALL TWO CAMERAS AND MAIL THEM BACK AND THEN REINSTALL TWO CAMERAS AND WONDER HOW LONG THESE WILL LAST. MAYBE A LOT OF MONEY WASTED IF THESE CAMERAS DIE WITHIN A YEAR OR LESS SINCE I OWN SIX CAMERAS AND TWO MONITORS. I WOULD NOT RECOMMEND THIS SYSTEM ANYMORE.IF YOU BUY THESE CAMERAS YOU WILL KEEP BUYING REPLACEMENTS BECAUSE THEY QUALITY OF WORKMANSHIP OR DURABILITY IS POOR. THEY LAST MAYBE A YEAR THEN YOUR CAMERA GOES BAD!", "Date": "April 24, 2013"}, {"Title": "Unhappy customer!", "Author": "Frederick P. Wood \"Gone\"", "ReviewID": "R1QSM282XN0WUP", "Overall": "1.0", "Content": "There were no specifications as to which receiver this was compatible with.  I'm now stuck with 3 of these and have no clue how to return them.  I tried to use them with a receiver that I purchased at the same time... these were shown as accessories on Amazon but they won't work with that model receiver... so I guess I'm just out the money.  The receiver I purchased separately and the one camera that came with work great.... but the company appears to have discontinued those cameras which I conjectured when I went to their company website(but they don't tell you that - it just shows out of stock with no date available), so I had to order another complete set that came with the receiver and 4 cameras ($400+).  So I'm stuck with the original receiver and camera and 3 addon cameras that won't talk to that receiver.  UGH!  I'm not a happy camper... and when they ship them to you, there's no invoice or return information in the event you have a problem!  The bottom line?  Buy what you need the first time as much of their stuff isn't cross compatible and the advertising doesn't explain any of that...", "Date": "October 11, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B007IJ7PJ0"}}