{"Reviews": [{"Title": "Good for the price", "Author": "Jonathan Lavoie", "ReviewID": "RKXQPZHELMG7A", "Overall": "3.0", "Content": "Good camera system once it's up and running there are no actual instructions with this unit so you pretty much guess as you go thankfully it's layout was similar to my old dvr system so I was able to get the main things set upGetting the remote viewing up however is a challenge if you don't know much about routers and port forwarding it was very frustrating for a few days but I with give credit to customer service it took a few days to revive a call after I put an email ticket in but once I got the call it got setup and fully working unfortunately if you use an iphone they only have 1 app that works to view on and it's not the best quality app the viewing from a computer is very good and you can fully controll the dvr's settings as well as if you where in front of it not 100 miles away", "Date": "December 25, 2013"}, {"Title": "great sys.", "Author": "dan walton", "ReviewID": "R2LM2Z78OFSEU5", "Overall": "5.0", "Content": "This sys. is more then I would ever need.  It has a very good and clear picture. A good home sys.  Thanks...", "Date": "March 6, 2013"}, {"Title": "defender DVR", "Author": "Frank", "ReviewID": "RO32F4344E1BY", "Overall": "5.0", "Content": "This is an excellent and easy to use system. Set up took less than 30 minutes and at no time was I confused.", "Date": "September 27, 2012"}, {"Title": "Defender 4 channel", "Author": "lmassman", "ReviewID": "RDQGPZVM4CLE5", "Overall": "4.0", "Content": "The menu is a bit hard to travel through to find or review recorded eventsNot friendlyOther than that I would recommend that you get recorder with out camerasBy your ones you need and connect to defender", "Date": "August 15, 2012"}], "ProductInfo": {"Price": "$269.99", "Features": "View anytime, anywhere with remote viewing via internet, smartphone, and tablet\nRecord over 2 years' worth of footage on the included 500 GB hard drive\nChoose motion-activated recording or H.264 compression to maximize storage space", "Name": "DEFENDER 21011 SENTINEL 4-Channel Smart Security DVR", "ImgURL": "http://ecx.images-amazon.com/images/I/316WH7mstLL._SY300_.jpg", "ProductID": "B007ULT3EQ"}}