{"Reviews": [{"Title": "Broke in less than a year - trouble getting it fixed", "Author": "SMXSteve", "ReviewID": "RC5A71H4SJDT", "Overall": "1.0", "Content": "Update: 6/24/13 poor customer service. Only communication is with online chat which takes them literally minutes to respond. RMA requires a copy of receipt which I don't have and you pay shipping. Emails are unanswered. 2 to 4 weeks expected return. And, from my experience, who knows how they will test it and if they don't find anything wrong they just send it back. A security system with no support isn't worth the risk.Update: I've spent a day trying to solve issues. Unfortunately they require you to use an online chat window which would be fine but it can take several minuts for them to even check it. While it's obvious there is a board issue with the DVR they keep having me try things - like Internet providers - and refusing to accept that it's broken. I have a feeling once they get their act together I will have to send it in which means no security setup for probably weeks.Update: 6/18/13 while I could still view the cams from anywhere there was no indication that the unit wasn't recording. However, wanting to do some checking I found it hadn't recorded for several days - and when I needed it! Contacting support (online chat only) they had me reformat the hard drive. I don't know what is going on and they couldn't guarantee it wouldn't happen again and now my warranty is just about over. 8 cameras and no DVR will suck. They did tell me if it failed again in the next week I could send it in. Great, so no unit at all for several weeks if that happens. I should note my Q-See and Panasonic have never had a problem.Update: I needed support recently after trying their online form, which bombed (error message came up) and phone, which the message said to use online form, I finally got someone on their online chat, after about a half hour. But I did get my answer!--------------------------------------------------------------I actually installed and used this system: cables, cameras, DVR, and software.This is my fourth system. The first is a wireless Panasonic Network Cam which has been running 24/7 for about 4 years with absolutely no problems but it's an indoor cam pointing out a window and the DVR is a Windows server - it is my favorite. My second system included 2 cameras, great length of cable for each but it did not include a DVR and could only be used by using an online service - I dumped that one. My third system has been a QSee four camera system which included a 320gb DVR. The system has worked for a few years as well capturing video based on motion detection. I had a couple of blind spots and needed an extra camera or two; the Defender 21029 comes with 8 outdoor cameras and a 500gb DVR.Defender HardwareOut of the box there is no documentation except a little piece of paper showing all of the parts. It comes with one of those little CDs but without auto run. You will find a PDF manual but nothing that talks about installing software or using the software or web version (they are similar yet different) only about the software that is in the DVR itself which is similar to the other two yet different and does not use a keyboard - mouse only which can be a pain in the butt to use - prefer not. No online knowledge base as of this writing.Installation is a real pain in the butt. You have to string cables all over the house to get the right setup. That's what makes these systems less desirable. Even though their example shows a cable running through the wall I prefer to hide my cables so I ran all of them through the attic and most hang under the eve. The included cables weren't long enough for 3 of my locations.The cameras that came with my unit are the worse out of all of my systems. While you can tell what is going on they are washed out and the colors don't come close - green leaves come out purple. Adjustment does not help a great deal.The DVR does provide motion detection for any camera which is the best way to go; it makes it easier to find things because that is all that is recorded.Take note: if someone does break in they could steal the DVR so it too needs to be hidden or locked up.SoftwareHardware manufactures rarely make great software and they don't realize that is what really makes hardware great or what's the use? The Defender software comes in 3 flavors: internal, an app, and web browser - web browser being the best but not great.While better then the QSee, Defender software does malfunction and would sometimes just crash for no reason.It only allows playback up to 8x fast forward where QSee was up to 16x which was nice to have.Playback only allows you to search/view 4 at a time and the only view is a timeline with a slider which is not easy to control and select a specific time or starting point.One other annoyance, which was also with the QSee, PTZ controls are always displayed and take up room on the screen even though you don't get cameras that can be controlled and you probably won't add them to an inexpensive system like this.The software doesn't use the name you gave each camera instead uses CH1 for channel 1, etc so when you need to select the cameras for playback you have to remember which channel has the camera you want to view since you can only view 4 at a time out of the 8. But you can playback all 4 cameras at once.Sometimes I would make changes to the settings and it would save while other times a message pops up and says Failed.Try to set the password for a user and it maxes out at 6 characters but then you try to save it it says you must have MORE than 6 characters. Then sometimes it does work but you must have 6 characters exactly.While it says you can assign different types of users I haven't found that. I prefer to be able to differentiate between a local user and a remote user but you can't.Interesting noteI have to wonder if the Defender and the QSee (and probably other brands) aren't made by the same manufacture and companies buy them up and add software because the hardware is nearly identical (model differences) including mice, remote controls, ports, cabling etc.ConclusionI could probably write a book on these things but that should give you an idea. It would cost a considerable amount to set up 8 wireless cameras and a DVR or server; cable type systems like this are much more affordable. On the Defender website this system lists for $800 but on sale for $550 - way over priced. Amazon sells it for $400 which is about right for an 8 camera system like this. It does work and will record activity going on giving you some peace of mind.", "Date": "July 2, 2012"}, {"Title": "Very Good Wired Security Camera System With DVR - Highly Recommended!", "Author": "C. Hill \"CFH\"", "ReviewID": "R3FKTISDI7L0AF", "Overall": "5.0", "Content": "This Defender Sentinel Surveillance System works well for my needs and is also a very good value. To be perfectly clear, this is not a high-end system with high definition cameras, but it isn't priced like a high-end system either. This is somewhat of a budget system that exceeded my expectations for what you get and how well it works. Here are my observations:Note: We already own a Zmodo Surveillance System (PKD-DK0865-500GB) used to monitor our small business, so it was easy for me to switch out the main DVR unit and cameras to do a side-by-side comparison. The Defender and Zmodo systems have roughly the same specs and features, but the Defender is a little more expensive (at the time of this review), so is it worth it? The answer for us would be \"yes\" since the cameras on this system are clearer and have much better night vision clarity and range. I will be making comparisons as appropriate.Our Use - We recently bought an old but very large building for my wife's business and needed a way to monitor the six exits and the retail shop space.Included:* Main Control Unit - this is a fairly small unit (smaller than most DVD players)* 8-Cameras - these are also fairly small, good physical quality and include mounting hardware* USB Mouse - connects to Control Unit* Remote Control - gives access to all menu functions (batteries included)* Required Cables - 65' Video/Power cables* Power Supplies - one for the Control Unit and two for the cameras (uses splitters to distribute the power between the cameras)* Window Warning Stickers* Software CDFeatures:+ Camera; IR Illumination for night vision+ User configurable Options; Privacy Zones (blackout areas in the display), Motion Zones (areas where motion triggers an alarm)+ Network Access; Can be viewed by a PC on the local network+ Alarm Notification; Audible alert and E-Mail capability (which works very well)+ Display Options; Includes a VGA monitor connection and BNC/video out for TV viewing+ Remote Control; Really makes it easy to quickly access features+ Remote User Access; Can be viewed remotely on PC/MAC, iPhone, and AndroidPros:+ Setup; Basic configuration is very easy+ Image Quality; Good for basic security needs in both bright and dark settings, better than the Zmodo cameras+ Night Vision; Surprisingly good clarity and range, also much better than the Zmodo system+ Value; Lots of cameras and features at a reasonable cost+ Options; Can be made to do everything we need it to do+ No Exposed Camera Wires; Wires can pass though the mounting hardware so are hidden and protected, an advantage over the Zmodo mounts, or you can choose to have the wires run outside the mounts if you don't want to put holes through the wallCons:- Slightly Washed Out Colors; Colors are somewhat muted, but can be individually adjusted in the controls to get the best possible picture for the lighting conditionHints/Notes:* Alarmed Events can be recorded and searched on later* A 500GB Hard Drive can record up to two years of video on this system* Placing a camera too close to a window will cause the IR to reflect and blind the camera when it shifts into night vision mode* Supports PTZ Cameras (not included); we use Zmodo Home Indoor Pan Tilt Surveillance Camera with IR Night Vision for 80 feetThis system covers my needs very well and provides a lot of advanced features that are nice to find on a budget system.Highly Recommended!CFH", "Date": "June 27, 2012"}, {"Title": "Defender USA Customer Support is Horrible", "Author": "Reviewer 1900 \"Reviewer 1900\"", "ReviewID": "R3TATFMGGDZODF", "Overall": "1.0", "Content": "I purchased this item because of the claim of \"DVD quality resolution\". Once installed did I realize that car license plates still could not be read.I already owned the Defender SN502-4CH-001 model and the image quality is almost exactly the same! I also had an issue with one of the cameras and called customer support about getting the defective camera replaced .They required that you send the defective camera back before getting a replacement even though I provided a receipt and was under the warranty.Defender USA also claims that you can record 6 months of footage with the 500 GB hard drive. This claim is a lie. The most you can store is about 4 weeks!I have always been a loyal Amazon customer and feel disappointed that Defender USA was able to sell its items on this website. From past experience, Amazon customer service has been great but it sometimes falls short when third party companies are involved.Buyers beware when looking to buy one of these systems. Don't make them same mistake I made.", "Date": "July 26, 2012"}, {"Title": "Surveillance accessed from home and away, both night and day!", "Author": "Marty Gillis", "ReviewID": "R32YCNVONFKEC4", "Overall": "4.0", "Content": "Operating a home recording studio these days makes owning a home surveillance system a must. Along with an alarm this is a necessity now.  One major theft and I am out of business. While this system can not prevent a theft, it can record it and has all the capabilities to ALERT me that it is happening.f you are at all familiar with surveillance/recording system you will soon be right at home with the Defender.  The Defender system has everything you need to keep an eye on things, whether you are on premises or off. Very easy communication with your system via the web makes this ideal for checking your home or business while away. Once you set things up on software, you can easily review your recordings or watch in real time from remote locations. The email alert feature is really a smart idea and although I have had no breach in security YET, I am sure to appreciate an electronic \"heads up\" if the need arises.The system comes well packaged in two small boxes, one holding cameras and cabling and the other holding the DVR and software.  Everything arrived in perfect condition, ready for installation and use. (you obviously need a PC and Monitor to operate this system)Build quality of the cameras, mounts, and DVR is very good.  Cabling is not the thickest but more than serviceable and shielded . Almost all your cabling will be hidden and not exposed to the elements.  A basic rule of thumb for the DVR portion of this system is to keep the DVR in a COOL place with PLENTY OF ventilation. Since this is the key component of the system, we keep the DVR in our studio computer room which is climate controlled 24/7.Installation is not for the timid. If you have any doubts or are just not mechanically inclined, get someone to help you or HIRE a professional at least for the install of the cameras and running of cables.  There WILL be holes drilled in your exterior/interior walls as this is not a wireless system.The documentation is spotty and almost appears to be written in pidgin English. Basically all the info you need is there on disc and on Defenders website AND Defender offers real time chat for any problems you encounter or instruction you may need. (both web and phone support)  In my case this system replaces a very antiquated VHS based unit so going all digital was a welcome change and something worth the small learning curve to implement.Besides remote accessing of the software and 4 channel video output, the other favorite feature of mine is the ability to record viewable video during the night.Maxwell Smart of CONROL never had anything this sophisticated.Video quality is more than adequate with 480i at 704 x 480 and by using H.264 compression the picture is pretty crisp and artifact free. A MAJOR improvement from my old VHS based system!  Of course accessing your video feeds is very similar to home DVR use as far as random access goes and searching by timer/day.Currently sold for under $400, this system gives you all the tools you need to keep watch on your home or business, an easy way to access the system from a remote location and provides decent usable video quality both during the day and at night. Coupled with the free tech support offered, the Defender Sentinel 4 Channel system will run rings around any older system and should provide years of service as long as you take care of the DVR.If you need to know what's going on at all times, this system will do the job for you. (since this is a hard disc based system you always need to remember ALL hard discs eventually fail so a redundant backup system is recommended for critical applications)  Very cool and I can easily recommend it.", "Date": "July 18, 2012"}, {"Title": "Impressive", "Author": "B.L.", "ReviewID": "R1H8KKPLYZ7GZF", "Overall": "4.0", "Content": "My use of this system so far has admittedly been just a little silly. I'm not ready just yet to fully install it (partly because I wanted to have a sense of how well it works before I start drilling holes in walls that can't be un-drilled as part of installing it), but I decided to hook up a couple of cameras so that I could get on with testing it. I've been having fun using it to monitor a robin's nest on the back of the house.It's been a really good way for me to get a sense of how well I could follow what was happening in front of the camera, how well the night vision works, and to test other features like alarms. I was actually able to go into the system's software and designate the area around the nest itself as being of interest, and had the system beeping to alert me whenever the parents came back to the nest to feed their young without giving me false alarms when things moved elsewhere within the camera's view. (It was way more fun as a way of testing than sending someone else out to walk in front of the cameras for me!)The clarity of the images has really surprised me with how good it is. The colors can be a little off at times, but the clarity is nicer than I expected. You have the option to set the system to different resolutions. It also has the ability to be hooked to a computer monitor, along with 2 connection points designed to use a television as a display.Overall, I'm very impressed with it so far and I think that it's definitely worth the amount they're charging here. There are a few things that I took off a star for that are mainly interface issues. For example, in the menus in the system there are options available to be checked and unchecked that are not supported by this particular model. There's also plenty of room on many pages that they could have offered slightly more explanation in place of what options meant, rather than requiring you to switch back and forth between the system's interface and a PDF of the manual to figure out what you're doing (or whether you're even doing anything, in the case of the options that are meaningless for this particular version).These issues are pretty minor because they don't stop you from actually successfully doing anything with the system that you might want to do. They're just an avoidable annoyance that holds me back a from being entirely comfortable with giving it 5 stars for now.Some Edits for more detail:The network cable that comes with the system is Cat5e. If you're in doubt about whether this is good enough for the speed of your local network, you're almost definitely fine. Only networks where all of the components are very high speed will benefit from a Cat6 cable. Plan to order one if you happen to need that, though.I'm still disappointed in the quality of the documentation. The URL they point you to for networking information sends you to a 'we have reorganized our site, start from our main page' page. It wouldn't have taken much effort for them to move you to at least the support page (where you can easily get to networking information) instead of the main page of the site. There are a lot of little spots like that where things could be more polished.There's good news and bad news on the using-birds-for-testing front. The bad news is that, after I had been watching the babies frequently for more than a week (I got to like glancing over to see what they were up to on the nearby TV while I worked at the computer), they disappeared from their nest a couple of days before they were due to start learning to fly. The good news is that I was able to find out what happened, because the camera captured the entire thing. They were attacked by what appears to have been a rat snake. While it was distressing to lose them and to see the attack transpire on video (it was in the middle of the night, so it was caught on the night-vision mode), I guess that at least proves that you can use this system to find out who's responsible when something bad happens on your property.", "Date": "June 27, 2012"}, {"Title": "Inexpensive, But Unreliable Camera System", "Author": "Patrick R.", "ReviewID": "R3C17SYIWYZMSG", "Overall": "2.0", "Content": "In the most basic sense, the system does what it's supposed to do at a cheap price.  However, here are a few big disappointments, even at this price:1) Camera only comes in black. Wife wanted cameras white to blend with house trim. I carefully taped & spray painted each one taking care not to spray the lens or camera innards.  Problem solved?2) All cameras were plug & play, connecting very easy to DVR & neaby TV monitor. After one day, one camera started saying \"video loss\"  & stopped working.  Guess I'll return for warranty repair.3) Oh, that's right, I painted the camera. Probably can't return it for warranty now.4) I decided I was probably hosed, so bought another 4-pack of cameras thru Amazon. Problem solved.  Wait, the new camera now works on night vision only. Once it becomes daylight, the camera goes snow blind. Guess I'll have to try replacement camera #2 next.5) Now, three weeks later another camera that I'd painted works during the daylight but not so much at night.  Guess I 'll have to use another one from my replacement 4-pack?!?6) Customer Service is a joke unless you can find what you need by way of basic info on their website. If you need a live person, then you have to fill out a request form & they will call you within 3 business days.7) I actually did call Customer Service before my camera issues started for help with Internet set- up.  That's a whole new problem. I waited my 3 business days & someone called to help. They had to end up dialing in to my home Internet. I still can only access via my home Internet but not any other wi-fi. They told me that my call time was up & I'd need to place another call if I needed more service help.So, my advise to you is to buy plenty of extra cameras because you will be changing them regularly like burnt light bulbs.  Also, buyer beware - you are on your own with support.  If you can't get it with what's already posted on their website, then wait 3 days & you may get to speak to someone.  Keep your expectations extremely low here and you probably won't be disappointed.", "Date": "October 12, 2013"}, {"Title": "its not for everyone", "Author": "Eugene A. Bevans", "ReviewID": "R8LZAYUGA70Q0", "Overall": "2.0", "Content": "the price was good but picture quality is very poor. without the filter the grass and trees are gray in color. also it has very poor night vision.", "Date": "September 19, 2013"}, {"Title": "There is so much wrong with this company", "Author": "Rick", "ReviewID": "R39OWX1SYF7QMP", "Overall": "1.0", "Content": "Defender-USA doesn't at all seem professional in the way they handle manuals. First, the disc that comes with this is a mini disc and doesn't work in all optical disc drives (mine wont accept mini discs), so I had to find the manual online. Next, their website said the PDF I downloaded was for this specific unit. However, it's for an earlier model that only accepts four cameras. Also, both their PDF manual and online video tutorial for Networking contradicts the single sheet of paper included in the box. (one says set the HTTP Port to 08080 and other says set it to 00080). Everything contradicts each other.This is definitly an armature \"company\" - there is nothing professional with Defender-USA.", "Date": "July 22, 2013"}, {"Title": "Does a very basic job", "Author": "KL", "ReviewID": "R15EPJ6I5GOUVW", "Overall": "3.0", "Content": "I purchased this at a good sale price, thats about the only reason I have not returned it for something better. The cameras are good for making out bodies , but not really faces . The color of items are completely off. This is a very basic  quality item. The Dvr interface is horrible  and clunky. If you need to see if someone is walking around , you can do that, but the details are pretty  shabby.The night vision  can get kind of weird and White out the face if the camera is not placed in a good spot. I can live with the cameras, but the Dvr and the interface are by far the worst part of this  item.", "Date": "December 24, 2012"}, {"Title": "Not what I was expecting", "Author": "Felix Rios", "ReviewID": "R10VNP5SWSCR8Q", "Overall": "3.0", "Content": "I thought the quality would be better. Is good if you want to say you have a surveillance but the images are not cristal clear. If you need to show a video to a police officer to report a break in or robbery, you won't be able to pick details from the video.", "Date": "March 16, 2014"}, {"Title": "does not work in infra red", "Author": "dan", "ReviewID": "R3R67FTA981FX8", "Overall": "1.0", "Content": "This item does not work at night at all.Was told by defender to reset camera's and camera's do not reset. They have now stopped responding to my emails. I would not recomend these camera's to anyone at all because if you have a problem with them- good luck getting it fixed.", "Date": "August 20, 2013"}, {"Title": "feel safe.", "Author": "Mark Langlois", "ReviewID": "RCHPEJ5TSNDPI", "Overall": "4.0", "Content": "The security system works great,i have a great view of all my property.I can leave the house and know everything is safe.", "Date": "June 17, 2013"}, {"Title": "Couldn't be easier!", "Author": "flying pig", "ReviewID": "R1K4TR37N9BBJD", "Overall": "5.0", "Content": "I read reviews, and read reviews and read some more before purchasing a security system. I am not some super smart computer person so I was a little intimidated about the thought of wiring this and getting it all going. I was totally amazed at how easy it was. It couldn't be simpler, everything is color coded. We decided where we wanted the cameras before we started the install. We were installing all 8 outside. The holes we had to drill are very small and if our attic were full size, man how easy it would have been. Outside of that, it was the easiest thing we have ever installed. Plug and go, it was that simple. People had stated in some reviews that there were no instructions. There is a small disc that has the users manual on it and its also available online, I had looked at it before purchasing.  I haven't gotten into the programming a lot. I got this because I love gadgets and I am hoping to get a discount on my homeowners insurance. Outside of that, its a blast to sit and watch the cameras, as I have almost 5 acres and can view a lot of it.  It doesn't have near the distance at night, because it gets really dark in the country, but I have dogs for that. The daytime distance is very clear, and I can see all the way to three property lines very clearly. It is probably about 100ft to the front and a little less to both sides. The bulk of my property is behind me, but around my house, is very well covered. I don't want to confuse anyone that I am covering the entire 5 acres.  I am thrilled with the quality of the video. The only thing hard about the install was due to our attic being so short you cannot stand up in it. If you have a stand up attic height you have it made!  I have had this installed for a couple of months and I would recommend this system to anyone.Update  august 30/2013 I have seen a few people on here that have had their hard drive fail.. Mine also failed. I guess the company got a bad batch. But I wanted to update my experience with customer service which was totally not like one I read. My system is set to auto overwrite when full.  When it got full, it stopped recording, notifying me of this with an alarm noise. I tried all the trouble shooting ideas in the user guide. Non of them worked. When you go to the defender website it doesn't post a number for customer service. It wants you to fill out a form and have them call you. I wanted to talk to someone soon, so I called the sales number and in the auto bot information there was a choice for customer service. I did have to wait on hold for 20 minutes but the customer service was excellent. The lady I got talked to me about the the trouble shooting and I told her what I had tried but we walked thru them again. She said I needed to send it in and she emailed me a form to include in the box for service. I did have to pay the postage to mail it back, but they paid it when they sent me a new one back. She told me it could be 2 to 4 wks before it was returned, but the turn around was much faster right now, but they are required to tell everyone that. From the day I mailed it back, to the day UPS delivered it back, was only 11 days including weekend days. Sometimes people are upset their item failed and get an attitude with customer service people from the get go, if you have ever worked customer service jobs, you definitely know what I mean. I still love my system and happy with my purchase, except now amazon is selling it 50 dollars cheaper than I paid! lol You can't win them all.", "Date": "May 31, 2013"}, {"Title": "Good Cable Camera System for the money", "Author": "KevinV", "ReviewID": "R2VLPUALTZ2A20", "Overall": "4.0", "Content": "This is a good camera system for someone worried about home security on a budget. The camera system and DVR was very easy to setup and for the most part plug-in then start recording. The DVR interface is user friendly enough for someone with basic computer skills could use.Picture quality- Day time picture is better then I expected. Its about the same as they show in the product description.- Night time picture is a whole other story..... Now I have two cameras mounted about 30ft from the ground over looking my back yard and unless I did something wrong, I can barely make out the difference between my above-ground swimming pool and the actual ground. Now I have another camera just above my back door and I get about 10ft of decent visibility at night but still not enough to make a face or a least like to picture in the product description.For the most part, I am very satisfied with this camera system and works perfect for what I needed it for. I also wish I opted for the 600 TVL cameras.", "Date": "April 16, 2013"}, {"Title": "good", "Author": "hamed yahyah talagi", "ReviewID": "R3PTJXKIJQ9HUF", "Overall": "5.0", "Content": "Good and as describedArticle carefully made and wonderful shape wrapped and priced reasonably well and nice its verey usefull", "Date": "April 14, 2013"}, {"Title": "great system for a good price", "Author": "amer28", "ReviewID": "R4AB53LVC5YYM", "Overall": "5.0", "Content": "This system is economical and I would say compares to systems priced at 2-3 times the cost. Does the job. Not a security or camera expert but well worth the $.", "Date": "March 26, 2013"}, {"Title": "Good System!", "Author": "Clifford", "ReviewID": "RPZ5DK0HHT7CL", "Overall": "4.0", "Content": "System fits my needs completely! All the features work just fine. Really like the remote viewing on my smart phone! Cant beat for the money!!", "Date": "March 5, 2013"}, {"Title": "First security camera system and loving it; customer service issue", "Author": "Steve", "ReviewID": "RPJPQQ5YHH1HU", "Overall": "4.0", "Content": "I bought this camera system for my parents and installed it myself due to the higher number of break ins in the area.  Since these are static cameras, 8 channels is just about right (the DVR box does have a pan tilt zoom option though).  I have been using this for a couple weeks now and love how you can monitor the cameras from virtually anywhere.  Opening up the box and inspecting the product, everything seems to be of high quality.Installation:In the box there is not much physical documentation but it does include a CD with the manual in electronic  form.  This is a must read to figure out some of the features.  Installing  the cameras was pretty straightforward as all you need is a drill, screwdriver, and a staple gun (or wire molding if you want to make it really nice and discreet).  The home I installed it on is single wall construction which I think made it easier. I was able to install everything in two weekends (3 days to be exact) although some of the wires were visible.  With proper planning, the 60ft of included cabling for each camera was enough for our home with a property size of 6000 square feet.  You will want to also take into account what the camera can actually see when planning the mounting points.  Luckily these cameras have a pretty wide angle lens which adds flexibility in the mounting locations.DVR use:The DVR interface is much easier to use than I expected with the included USB mouse.  However, learning some of the features will take time such as the scheduling of recording etc.  Reading the manual definitely helps with this.Video Quality:When viewing the live video from a monitor or TV straight from the DVR, the video quality is a little grainy but very good for making out what you are looking at.  Also, the colors are off for somethings, but not others.  I've tried adjusting the hue/saturation but with no luck.When viewing remotely from computer or mobile device, the quality and frame rate drops quite dramatically.  I believe you can change the quality but I did not see a difference when I tried it (I may have done it incorrectly).  But with that said, it is still useful as you can see what is going on around your home when you are not there.  I sometimes watch my dogs play or dig holes in the yard etc.The nightvision isn't bad at all and can adequately see directly where the camera is pointing at however the edges are still dark if there is no other ambient light.Playback:The video quality is less than what you see when watching the cameras live.  I believe this is due to the video compression to save space on the DVR.  It is less than what I like but still useable.  One very useful feature is the playback search.  If you have the system to record when there is motion, a separate record event is made and can easily be searched for later.Pros:Relatively easy set upWide angle lens (just to to the point to where you can see some fish eye distortion)Cameras viewable (and recordable) remotely via computer or mobile device (internet connection required)Ability to record only when motion is detected (saves on DVR memory and doesn't work it constantly)Ability to send an email to alert you when motion is detectedUseful playback search by motion eventsPTZ capable (I think only for one device though)It's fun playing big brotherCons:Low camera resolution/frame rate when viewing remotelySlightly decreased video quality during playbackColors sometimes offCame with defective power splitter (see below)Regular price is quite high (although cheaper than many systems out there)I must be honest, I did get this at a $200 discount since the company was running a sale, and it does make me feel like I got more bang for my buck.  Still though, this is a DIY system at a DIY price and easily a great buy and weekend project.Edit:  So I mentioned above that the system came with a defective power splitter to power the cameras.  I also noticed one of the cameras weren't properly constructed and wasn't sitting in the housing correctly causing a weird halo effect only at night.  I contacted Defenders customer service and they claimed that because I am in Hawaii, I need to pay for shipping.  I dropped my interest in changing the camera as I can just live with it.  But to replace the faulty splitter, they want me to pay $5 for the splitter plus another $35 for shipping.  Why do I have to pay more for something that came broken?  I have no idea.  Why do I have to pay a ridiculous $35 for shipping for something that is small and weighs a couple ounces at most?  No idea either.  Terrible customer service.  I'm better off fixing it myself.  Still a good system, if you want to buy.  Just dont rely on the customer service if you have a faulty system.  Just return the whole thing to Amazon and keep doing so til you get a system that works 100%.", "Date": "December 19, 2012"}, {"Title": "Security Camera", "Author": "roughtr2", "ReviewID": "R1WULZDW9LQJ3Y", "Overall": "5.0", "Content": "I installed a similar camera for a project at work. I like the concept so much, I just had to buy one for my house. This was the best price, and has excellent cameras. No complaints.", "Date": "December 17, 2012"}, {"Title": "great price good product", "Author": "luis lazo", "ReviewID": "RSW7PCUB460X0", "Overall": "5.0", "Content": "Easy to set-up, the features are more like a professional DVR. Good cameras, pictures are clear even in the night. I like the feature of the software, you can digitally zoom in.", "Date": "December 15, 2012"}, {"Title": "great", "Author": "laughton hartley", "ReviewID": "R8YOI0G3HBXKW", "Overall": "5.0", "Content": "i but this system for a property i have far a way from where i live set it up was easy now it like i am there any one pass there it take the picture it great man", "Date": "December 15, 2012"}, {"Title": "Decent brain, so-so cameras, terrible instructions", "Author": "The Scout", "ReviewID": "R1BL63P35BFRYT", "Overall": "3.0", "Content": "First off, I think it is a good price versus performance product.  Getting a security system up and running for this amount of money is an amazing thing.Not that getting it up and running is that easy. The basic plug and play works, but beyond that, for example the Internet connections, alarms for motion, etc... Well, let's just say the instructions are appalling, the online help is no better, good luck getting through on the phone, and the user friendliness of the remote and mouse driven menu functions leaves something to be desired.  If you're a Mac user, the instructions on port forwarding are several OS versions old and no help if you're using anything recent.It took much longer than it should have, but I got it going.  Some observations:The cable ends will NOT fit through 1/2 inch electrical conduit.The \"brain\" that is, the DVR portion, appears to be a decent piece of equipment.The cameras are not that great.  They fall well short of the advertised night illumination range. WELL short. Daytime is OK, but difficult to achieve a natural and accurate colour representation.One camera was defective and I needed to return it. It costs $10 to send it to them, the camera is only worth $30. As a matter of fact I bought a different replacement camera from a different firm for $30 which has MUCH better picture quality than these cameras, even though it was also only $30.The number of false alarms on the motion detection is so high I can't really use the email warning feature. I get an email every 3 minutes if I turn it on, and there is nothing there. That despite setting the sensitivity down to the lowest setting. That was disappointing.  I don't know if it is flying insects that keep setting it off, but whatever the reason, that function is unusable. Maybe this works better for inside cameras, mine are all outside.It's neat being able to call up the camera pictures on my iPad or phone.  That works like a champ (after you solve the port forwarding problems, eg my ISP blocks port 80).So in sum, decent brain, cameras iffy and certainly not as good as the descriptions, and lots of self-help and googling required after the initial plug in the cameras phase.", "Date": "November 25, 2012"}, {"Title": "outstanding deal", "Author": "George Boyd \"the old guy\"", "ReviewID": "R2Q9TITBN1CD70", "Overall": "4.0", "Content": "This was an outstanding purchase for the price. Just got the system up and running and I am happy with the results. Sepup was very easy and I was able to mount all of the cameras out side.", "Date": "October 12, 2012"}, {"Title": "defender 21028", "Author": "john", "ReviewID": "R13FBYKZVV8VD5", "Overall": "5.0", "Content": "this system works great it took no time to put it up and has work great since day 1 and very easy to operate.", "Date": "September 18, 2012"}, {"Title": "Simple, easy, just what I needed.", "Author": "Anthony W Kennedy", "ReviewID": "R18AVDOLP80HL3", "Overall": "4.0", "Content": "Took less than 4 hours to install all 8 cameras, the brackets on the 21029 are easy to use and allow for ceiling or wall mount options. The cameras work really well inside and allow for monitoring of all entrances in to my home. I put 2 cameras outside to monitor my driveway and my backyard. During the day I can watch my kids play, and see who is messing around on my driveway. The night vision works well inside but not so much outside. You won't see thing in HD, witch isn't the purpose of the system, but you will see people moving around or attempting to enter your home. As a plus I can now determine which one of my children started the last fight, lol. Great for someone who wants a little piece of mind when not home using the internet option this system provides.", "Date": "August 27, 2012"}, {"Title": "Solid Security System with Night Vision Capability", "Author": "Tradecraft \"Live by the Sword\"", "ReviewID": "R22XAX23H52JF3", "Overall": "4.0", "Content": "The DEFENDER 21026 SENTINEL 4-Channel Smart Security DVR with 4 Hi-Resolution Outdoor Security Cameras is a good residential home security system that provides night vision capability. It comes with a DVR that has a 500 GB hard drive.I ended up downloading the instruction manual from the Defender-USA website. The documentation that comes with the security system was very lacking. After going through the instruction manual I decided that I would hire a professional to install the security system to ensure that it is set up correctly and provides the level of coverage that I wanted. I did not want to end up drilling holes in my walls to later find that I did not place the camera correctly. The professional installer was able to quickly assess my needs and placement of the cameras. I also recommend using this system with a couple of imitation security cameras to give the appearance that your system is more robust than it appears. One of the more challenging aspects is setting up the cameras in the most effective location that will not be negatively impacted by sunlight or glare. The cameras should not be directly pointing at a light source. The goal is to have a clear image during both day and night. Using a professional to install the system saved me a lot of time and energy in camera placement. This system works great during the day and night. The video quality is good and would be an asset in identifying an intruder.The cameras are weather resistant and good quality. Each camera comes with 65 feet of cable. Depending on your needs you may need more cable. The DVR is also good quality and should be placed in a room that is temperature controlled with appropriate ventilation. Do not place it in a hot garage or attic.One aspect of this system that I really like is that it allows for remote viewing on the internet or through a smartphone to include the iphone, BlackBerry, and Android. You can also set it up to send you email alerts which is a neat feature especially if you are on vacation. Set up was not too complicated and I am now able to watch the cameras regardless of where I am physically located.For the price range this is a solid security system that I would recommend to others. If you have no experience with installing a security cameras then hiring a professional will be a wise investment.", "Date": "July 26, 2012"}, {"Title": "Defender 8 channel security dvr", "Author": "Raul Landeros Jr \"rlandjr\"", "ReviewID": "RNABWX76GX11K", "Overall": "5.0", "Content": "At first I was skeptical about buying this product.  This was going to replace my 2 year old unit which is only a 4 channel dvr.  The unit is way better than my older unit...plus it works with  8 cameras which is a big plus !!!  Setup was a breeze.  The price I paid for this new unit was the same price I paid for the older unit !!! Although this unit comes with only 4 cameras - wish it came with 8...but I was able to hook up the other 4 cameras I had and it works just fine...", "Date": "July 14, 2012"}, {"Title": "This system does everything it should and then some!!", "Author": "Michael Countryman \"mike the camera man\"", "ReviewID": "R1RTO257NDIZHW", "Overall": "4.0", "Content": "Wow let me start off by saying when I first received security system I was so excited and then I plugged it in and turn on the monitor and saw so many options and features I was very intimidated at first. I had no clue what all these settings were for. I should also mention that I am ADD so that really did not help. I then looked through all the boxes to find instructions and only found a very small quick setup guide and a cd but no in depth setup instructions so I was saying to myself how in the world am I going to figure this out? Well fortunately I went online to there web site and found a PDF download that goes step by step on the setup. I followed the online instructions  and was very clear and accurate so I had my system up and running in no time. I was even able to view all my cameras online and in real time too! That is awesome. I chose the setting to be emailed if a camera experiences a signal loss or if motion is detected and WOW this works like a dream. Very impressed. Ok now that it is setup I should mention that they advertise that it will record 2 years of non stop footage. Well that is true if you choose the lowest setting of 1 frame per second and that is totally useless so that is the reason for one star well that and no real instructions included in box. However this is really not a problem. I have chosen the highest quality video setting and still will get about a month of non stop recording and have it set to automatically overwrite when the hard drive is full so it will never stop recording. I also have the system set to only record when motion is detected so it will take much longer to fill the hard drive. A very nice feature I found about the motion recording is that once motion is detected the system will move back and also record 30 seconds prior to motion to capture the full scene. That is a very nice feature indeed. The schedule settings a very versatile in that you can set certain days to record non stop, motion, or not at all. You also can choose the settings in 1 hour increments. Another feature is a privacy feature so that you can chose to have a camera turned off during a certain time of day for privacy reasons. I should mention that I am using this mainly for my home protection so I will not go into detail about the multiple administers you can can and privacy setting for that but they are all there. The cameras them self are ok and work well. I wish they were a little bit wider angle but not a problem. The clarity is good overall but during the transition of day to night is starts to get a little bit grainy just before it switches to night view. Still no bad at all. I wonder if the Ultra high resolution ones would work better? Another feature is that you can add audio cameras and also PTZ pan tilt zoom cameras and will be fully operational with this system. I have been really impressed with this so far but I do recommend checking the Defender website for price as it is way lower there for some reason. Bottom line is this system is packed with a lot of features and is fully customizable with realtime monitoring, system alerts, email warnings and all. Very comprehensive system.", "Date": "November 29, 2012"}, {"Title": "Good Package with Poor Documentation", "Author": "LA", "ReviewID": "R3QPTC61GHN5MO", "Overall": "3.0", "Content": "This is a nice package for a smaller residence or business. My house is approximately 1700 square feet, so four strategically placed cameras will provide more than adequate coverage. The camera resolution is pretty good and will give you enough detail whether you are live-monitoring the cameras or playing back the recordings.This system is not, alas, wireless. You will need to think long and hard about where you want the cameras placed because you are going to end up with holes in your walls from drilling. I have an attic so I chose to run the wire through there. The product includes 65 feet of cable for each camera. This should be enough for most setups. If it's not, you can buy additional cable.There is a quick set up guide (mainly to show you how to make the connections to your PC, monitor, etc.), but the actual manual is available only on the dvd disk. The manual is mediocre, confusing, and poorly written. I would have preferred a step by step guide because there are lots of features. I would have also preferred a video tutorial.The biggest complaint by people buying this system will undoubtedly be the poor instructions. Here's an example of the writing style:\"According to the functionality and characters of this software, we strongly suggest: All operators should proceed basic operation training to avoid any wrong operationYou should establish user management and grade system to shelter operation authority of lowlevel user.\"Yikes! That is some bad writing.Although the package is feature-packed, it is NOT (despite claims to the contrary by the manufacturer) easy to set up and program. I hope the manufacturer re-thinks the manual and provides video tutorial(s) because I found the setup to be extremely frustrating.", "Date": "July 16, 2012"}, {"Title": "Good for daylight,", "Author": "Pali \"numero 1\"", "ReviewID": "R1QN9KM4YTCR59", "Overall": "3.0", "Content": "This system is good for day viewing. Night vision is only good at about 25ft max -dont expect any color.  One of the cameras did not work.  I only set up the system a week ago after purchasing since Sept.  Not sure if they will replace the camera but I will contact the seller.  Still trying to set up the online viewing. Will update later.", "Date": "January 30, 2013"}], "ProductInfo": {"Price": "$499.99", "Features": "Choose motion-activated recording or H.264 compression to maximize storage space\nHigh-resolution cameras provide crisp and detailed video\nMonitor up to 75 feet away in complete darkness with automatic night vision\nEasily connect to DVR with 65-foot cables to allow greater flexibility in camera situating", "Name": "DEFENDER 21029 SENTINEL 8-Channel Smart Security DVR with 8 Hi-Res Outdoor Security Cameras", "ImgURL": "http://ecx.images-amazon.com/images/I/41T1j1Ay6SL._SY300_.jpg", "ProductID": "B007ULT42W"}}