{"Reviews": [{"Title": "Usable, but questionable seller/packaging.", "Author": "Souljourn Flynn Kane", "ReviewID": "R23B3WL0CL5MZ4", "Overall": "3.0", "Content": "The first product I received was split down the middle of the case, as if it had been pried open, though the company representative I spoke with was accurate and prompt. I had to wait a business week for a replacement (due to a lack of the products, it came from a new shipment) but the replacement is in working order.The specs claim that it will record in 720p, which it does not, but since the instructions are in fragmented english sentences I suspect this is simply a mistake rather than a legitimate falsification of information. 720p is HD, 720x480 is not HD, though 720x480 would be fine in most cases, as it's the average resolution for DVDs.The camera is extremely simple to operate, a two year old wouldn't even have a pause when using this. On top of the ease of use, the \u0010micro SDHC card I purchased alongside this product works in my phone, other (expensive) cameras, and flash drives as well, which makes the saving of the data almost endless.It's fully worth the pocket change, if you can get one that isn't split open or in some other way defective, though the wait for a replacement may be longer than most would desire.*UPDATE*After six months it still works fine, it holds a charge fairly well, and the video/audio has yet to degrade. It apparently records in thirty minute increments until about three-four hours, then it will shut itself down. It takes day-to-day beatings without a fuss, though  wouldn't want to drop it too many times. The title and description claims it can be expanded up to 16gb, but mine works fine with a 32 gig card as well.", "Date": "November 6, 2012"}, {"Title": "Good Item", "Author": "Ronald N.", "ReviewID": "R3QYNB1SGEJN0S", "Overall": "5.0", "Content": "Good product.  Works well with the right light. I get to see who's messing with my desk while I'm out to lunch.  Five stars means I had no issues with shipping or the product. It met my expectations and was as listed.", "Date": "December 29, 2013"}, {"Title": "Watch Out!! Not really \"HD\"", "Author": "Chocaholic", "ReviewID": "R11FZSATN4S5WY", "Overall": "3.0", "Content": "The specs say \"720x480\", which is NOT High Definition HD.Real HD would be at least 1280x720.(NOTE: I don't own one, hence the middle rating. I'm just posting in the interest of Full Disclosure.)", "Date": "October 14, 2012"}], "ProductInfo": {"Price": "$10.39", "Features": "1.3M photo taking and 720p video recording!\nSupports up to 16GB micro SD / SDHC memory cards\nVideo Resolution: 720 x480 28-30FPS\nPhoto Resolution: JPG 1280 x 1024\nEasy to download video and photos to PC/Mac. Plug & Play!", "Name": "Esky® Car Key Keychain Surveillance DVR Camera 720p video recording w/Micro SD Slot Expandable to 16gb", "ImgURL": "http://ecx.images-amazon.com/images/I/41R8kX8dI6L._SX300_.jpg", "ProductID": "B008LQGMTI"}}