{"Reviews": [{"Title": "Great product", "Author": "glo", "ReviewID": "RWZLTC2QYLZ62", "Overall": "5.0", "Content": "I purchased two of these products because I needed to keep an eye on my home when I went on vacation last summer. The quality of the video is outstanding; better than any other video camera out there that I've seen. I liked the fact that I could actually see people's faces in high quality, rather than a blur. The night vision is superb and I was able to view my rooms as if there were lights on, when in fact, it was dark. Just a note, my rooms were no larger than 12' x 18'.  There are demos of this camera on the manufacturer's website. I would recommend anyone who is interested in this product to check them out first.A few items to note: if a room is very dark and has no white objects in it, the night vision will not work as well. What I did to resolve that was to place a piece of white cardboard (about 10\" x 12\") on my couch and then it adjusted the lens to brighten the room a bit. Another thing I noticed is if you mount this device on top of a wall unit, the night vision LEDs will actually reflect off the surface and mess with the quality of the night vision. What I did to resolve this issue was to place a black velvet cloth directly underneath the base of the camera, so the IR LEDs did not reflect off the surface and the night vision worked great.The networking is very easy to setup. I was able to give it a static IP (you can also use DHCP) so I could view it from my smartphone. I was using a Palm Pre 2 at the time and I could not only see live pictures but also stream video to my phone and see it live. It does offer RTSP.Probably one of the best features of this camera is the alerting. You can setup zones in specific areas of the camera's view, so that if motion is detected, it will trigger an email alert and start sending pictures. I set this up and also had my email account text me, when mail came from this device. It was great - I didn't have to babysit the camera all the time and relied on alerts as they happened.Support was responsive. They do not have a number to call, but they do have an email to contact for support. I always received a response within 24 hours of sending them a question and they were very knowledgeable.Definitely a great quality product and I would highly recommend it to anyone.", "Date": "December 18, 2012"}, {"Title": "Do not buy if you have GREEN switches", "Author": "P. Goins", "ReviewID": "R6C09NQAM8CXQ", "Overall": "5.0", "Content": "This is my third Sharx camera and they all work great.  Perfect if you don't want your video stored on some company's server.  Everything is self contained within the camera and my home network.April 2014 edit:I recently upgraded my ethernet switches to gigabit with a power-saving feature to disable unused ports.  The Sharx cameras connected by Ethernet now disappear from the network and can not connect remotely.  After working with Sharx tech support, I learned that it is common for the Sharx cameras to be lost by GREEN switches when the camera is not being actively viewed over the network.  The suggestion from Sharx tech support was to upgrade my gigabit switches to high-end Cisco switches that can turn the power-saving feature off on specific ports.  I have several Foscam cameras that don't have this problem with GREEN switches so I will just buy more of those.  In the end, the Sharx cameras are virtually useless if you have any power-saving GREEN switch.  Otherwise, it is still a very good camera but not suitable for my situation.", "Date": "November 19, 2013"}, {"Title": "Good product- fast technical support", "Author": "Tom", "ReviewID": "R22G3GYBVW79UH", "Overall": "5.0", "Content": "Great product.  I had one issue with setting up this camera and contacted tech support through email.  I received a call very quickly and was offered a replacement camera if my problem could not be solved.  We have other cameras from this company (model SCNC260) and have been very satisfied with the results.  The setup is very quick.", "Date": "January 18, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B008B9HK14"}}