{"Reviews": [], "ProductInfo": {"Price": "Unavailable", "Features": "8GB Digital Spy Pen with Image Capture and Video Recording - DV Camcorder Spy Pen is designed to write and spy in style with this spy surveillance gadget that has both video recording and image capture. Built with the highest quality internal micro-chip components, the CVMV-I36 Digital Spy Pen with Image Capture and Video Recording allows for straight to AVI recording at a higher resolution than most spy pens on the market today.This digital pocket video recorder is beautifully presented.\nPlace it on your desk, on a shelf, or in your shirt pocket.This amazing spy pen can also be used as a standard USB memory stick to conveniently transport your important computer files.This product also records audio, so you don't have to worry about switching between audio and video modes. Takes digital video and still camera images. Windows ME / 2000 / XP / Vista (32 bit version only) / Windows7 / MAC OS X Supports this product for USB transfer. Fun to use.\nThis Spy Pen would be perfect for those working within business, education, HR, security, media, tourism and many other areas. This is a flexible and desirable item that can be used by anybody! It is the perfect covert device.Designed to encompass a massive spacious capacity of 8GB flash memory, that lets you record hours of business meetings or interesting events on the sly. Easy to use and practical, this is an elegant and compact pen designed with portability in mind so it fits anywhere.\nThis model also comes with auto sound detection that records audio and video. With its deceptively normal exterior, this is the perfect blend of modern technology and conventional stationery for all aspiring secret agents.. This Spy Pen would be perfect for those working within business, education, HR, security, media, press relations, tourism and many other areas. This is a truly flexible, durble and desirable item that can be used by anybody, anywhere, anytime! It is the perfect covert device.\nThis Spy Pen is a truly flexible and desirable item that can be used by anybody, anywhere! Place it on your desk, on a shelf, or in your shirt pocket - it is the perfect covert device.Designed to encompass a massive spacious capacity of 8GB flash memory, that lets you record hours of business meetings or interesting events on the sly. This amazing spy pen can also be used as a standard USB memory stick to conveniently transport your important computer files.This product also records audio.", "Name": "Digital Spy Surveillance Pen with Image Capture and Video Recording-Highest Micro-chip HD camrea", "ImgURL": "http://ecx.images-amazon.com/images/I/41KDnYLttEL._SY300_.jpg", "ProductID": "B0086B9UPG"}}