{"Reviews": [{"Title": "Do Not Buy This Camera", "Author": "William Matthew Rideout", "ReviewID": "R3LB5LGPNGQVZW", "Overall": "1.0", "Content": "The camera works fine during well lit conditions, but as soon as it switches to night vision, the video feed is no longer stable. My camera just blacks out at night.", "Date": "September 8, 2013"}, {"Title": "GOOD CAMERA", "Author": "Howard Riley", "ReviewID": "R3GW2DPQWS4F7H", "Overall": "5.0", "Content": "THIS IS JUST WHAT I WAS LOOKING FOR. IT IS NICE TO RECIEVE THE ITEM YOU ORDERED INSTEAD OF SOME ITEMTHAT SOMEONE HAS OVERSTOCKED.", "Date": "June 25, 2013"}, {"Title": "Did not perform well out-of-the-box!", "Author": "Hott Dogg", "ReviewID": "R2F1UESAH9TZQ3", "Overall": "2.0", "Content": "I install security camera systems and have used several makes and models of cameras.  This camera did Not perform well out of the box.  It flashed on and off when in night vision mode and lost detail and resolution.  It takes a while for the night vision to kick in as well.  Since time was critical in getting security coverage, I  didn't bother sending it back and just replaced it all together with Zmodo brands!", "Date": "April 21, 2013"}, {"Title": "exceptionally good camera", "Author": "HandymanJD", "ReviewID": "R399NDG042B9DN", "Overall": "5.0", "Content": "I've got about six different cameras on my system, and this one, hands down, is the best.  The IR is great, illuminates my whole side yard (about 75x100 feet) like daylight.  The daylight colors are better than any other cheap camera I've ever used.  I'm going to be replacing a couple of my others with this model for sure.", "Date": "April 2, 2013"}], "ProductInfo": {"Price": "$69.99", "Features": "Affordable day night CMOS security camera. NTSC signal system\nHigh Resolution: 520 TVL. Built-in 6.0mm Lens. Aluminum housing with metal bracket\n36 IR illuminators for night vision. Easy connection to TV, VCR, quad processor or DVR\nBuilt-in light sensor. Built-in mechanical IR-Cut filter switch\nPackage included: 1x bullet camera, 1 x metal bracket and 1 x security warning sticker", "Name": "VideoSecu CCTV Outdoor Security Camera IR Infrared Day Night Vision Weatherproof 520TVL High Resolution Surveillance Camera WK2", "ImgURL": "http://ecx.images-amazon.com/images/I/51vavo9X62L._SX300_.jpg", "ProductID": "B008LHFTA0"}}