{"Reviews": [{"Title": "Works with all my IP and DVR security systems. iPhone/Andriod app is a must with this setup!!!", "Author": "D. Nguyen", "ReviewID": "R1UJP9315C03RT", "Overall": "5.0", "Content": "I have a total of 16 camera's, a couple of Panasonic BL**, Linksys, Foscam FI8910w and Askak Mole IP cam for indoors  along with a SWAN DVR system for outdoors that i just figured out how to add onto the software. I absolutely love it, and it's been working great over wifi, and the customization is awesome. I mainly bought it for home security and to monitor my newborn. I can setup to record motion for all the camera's and motion + email/sms alerts on specific ones that I would want to know about like front door, drive way and side gate access. I like using the text feature because it's almost instant. I get notifications on my iphone within 6-10 seconds of a trigger. It's awesome, example my text will read \"Alert Motion detected on Side gate\" ...I log in with my iphone Blue Iris app ($10) to see that the PGE guy is in my backyard reading my meter and throwing in lunch away in my trash can. If i miss it, the the iphone app has the ability to watch the DVR'd recording (with audio if your cam supports it). This feature alone is why i bought it. It is invaluable. Since most break in's happen in the day time, and thief's usually ring the door bell to see if anyone is home then go to the backyard where no can see to break in, this alerting system is critical along with the ability to review the alert to determine if it's legitimate or not. With the iphone app along with the PC version, I have reduced my remote viewing iPhone apps from 3 to just 1. Its so cool, i show it off to all my friends and co workers. Since I figured out all the settings, i helped them get it setup up to at their homes. They all love it. I use it all the time, even when I miss place something, it's awesome to have to abiliy to replay past events to find what you lost.The web browser functions works pretty good as well, I have noticed sometimes the image will get frozen and I need to refresh the browser to start up again using Firefox. This could be due to my companies firewall and proxy settings. The fix for this is to download the free add-in Auto Refresh v.1.02. I like this one the best because it has the option for hard refresh or the just a \"soft\" refresh of the view you are on. this is helpful if you have groups setup. I have Outdoor cams,  Indoor Cams / and Kids room cams groups. Doing a hard refresh goes back to the default view which is view All camera's. I do not select this and only do a normal refresh every 1min (adjustable). This way when I only want to watch my kids rooms to make sure they are doing their homework or chores, when the page refreshes it remains on my 3 large camera's views of my kids rooms instead of going to the main \"All camera's\" view like with a \"hard refresh\" which makes them all very small b/c it's showing all 16 cams.I have and monitored ADT security system as well but the Blue Iris application  is like my front line of defense in case thief's try to cut the power or disconnect the phone line. Additonally it has the best user interface and endless features that are not available on any of the other security applications. I have the BI software running on a desktop PC for now recording to an external HD hidden behind some books on my bookshelf with a 15FT usb cable. A laptop would be better since you can hide it more and it has a battery for power outages. Just keep your router and a few camera's on a UPS and you should be fully protected.Another cool feature is the ability to not only send alerts but it can play audio or turn on lights if alerts trigger. I have a profile setup for when I'm on vacation to play a 30min audio track of some action movie with explosions and dialog to simulate someone watching TV. The audio plays on my computer BOSE PC speakers that are turned up pretty loud. I also split the speakers out to they play on the opposite side of the house so that thieves could hear it from whatever entry point they are thinking about going in.I did run into an issue with my Astak mole cam is very flaky on the BI software. I can get to it fine using its own webserver and on the Free IP cam app I have on my iphone, but with the BI software, it's hit or miss, sometimes it working and sometimes its not. This could be the camera though so I'm not going to knock off a star until I do some more research. I submitted a case with the BI support and got a response a few hours later from support.  Ken offered some suggestions and also offered to help work on it if I put it online for him to take a look. Working in IT support myself, I was impressed with the support I received from the BI software developer.Other features that would put this over the top would be the 2 way talk feature for both the remote web view and smart phone app. Some of my cameras (foscam/Astak) have the ability to speak into your phone or computer and with the built in speaker on the camera, it will output  your voice on it. This is a neat feature to communicate to someone in the house when they are not picking up the phone. I purchased the foscam iphone app just for this feature alone, however it is lacking big time in comparison to the BI iphone app.All in all I'm very impressed with both the Blue Iris PC app and the iPhone app. With the rising crime rate across the country because the cities have no money to fund police and investigators, burglar's know this and are taking advantage. As a homeowner, I understand that this will not prevent a break in, but at least it may catch one, or better yet deter one.  I would highly recommend this to anyone wanting the flexibility of remote viewing and alerting for their security camera's.UPDATE 6-21-2013:Stability:  I have had this thing running no stop for almost 4 months. There have been a few updates for BI since then and they have been all very nice enhancements and or fixes. The BI web server is bullet proof; I have not had the webserver crash at all since it's been up. I do restart my computer ever now and then for Windows critical updates  but I have it setup so that when my computer reboots, it auto starts the BI software but minimized and password protected.BI Mobile App:  I have asked for it and now it is here! The ability for two way communication with the foscam camera¡¦s. I can now hear and talk through the foscams via the BI mobile app. It works pretty good, but I do have to admit the quality and responsiveness  is not as good as the native Foscam iphone app perhaps because it is going through the BI desktop webserver first then to your phone, whereas the Foscam app goes directly to your camera. But it is a good feature and probably needs to be optimized a bit to be on par with the Foscam mobile app. But I wouldn't buy the foscam iphone app to make up for it, I just happened to have both already so I'll continue to use the foscam app for now. ***Update 4/1/2014***. BI mobile works with Foscam FI9821 HD with two way audio. The Native Foscam app does not support audio on the HD version..Security: Since I have multiple camera's of all types Foscam's, Panasonic's, etc, it was a lot easier to secure One Blue Iris interface in terms of  accounts, devices, access times and permissions vs. ALL my other 16 camera's own user interfaces. Not to mention if I then had to forward all those ports on my router, making my home network more vulnerable to attacks with all the ports you are exposing to the world. Case in point Foscam had a firmware issue that allowed anyone to login without a password. I had that camera with that bad firmware, but because, the Foscam was not exposed to the internet, only to my local LAN at which point Blue Iris presented that video stream to me, I was not affected by that security risk.Wireless Speeds: Since I have 16 Camera's, 6 of them are foscams and 2 other ones that are wireless, I notice that my wifi speeds for the home have decreased dramatically. My wired speeds are great getting 21mbps down and 3-4mpbs up. But when I run speed tests for my wifi, i'm getting 128-256 kbps transfer speeds on my N wireless network. Turning off the BI software gets me back to almost my wired speeds using the speedtest.net  6000-7000 KB/sec. Looking at the BI logs, I see that my wifi cams at 5 fps (frames per second) are sending about 64-128kbs per sec for each wireless cam (8x) so it¡¦s not that bad, and my wired cams are sending about 400-500kbs per sec at 15 FPS. There is a constant flow of data across my wireless network. I have an Linksys  N router and a Cisco repeater/access point (G). My speed tests are done while connected to the N Linksys router.Now this does not happen all the time which is frustrating, meaning sometimes when BI is on and running, I get normal fast wifi speeds, and sometimes I don't when it's running so I¡¦m thinking there is something else saturating my wifi network like the camera¡¦s internal web server. I need to do more investigation, but it seems like BI has a hand in it since when I do disable it my speeds come back instantly.  I have since moved a lot of the camera's on Ethernet since the picture quality and frame rate is way better anyway, this has helped with intermittent wifi. I run a lot off wifi, TV Netflix, Apple Air Play, iPads, laptop, etc so this was of great concern. I now have only 4 cams on wifi and it seems to be working fine now. Just food for thought if you were running more than 8 wireless camera¡¦s you may see saturation on your wifi network. ***Update 4/1/2014*** So the issue was channel crowding on my wifi network and not BI. Download inSSIDer to view all the channels being used by you and your neighbors. Then setup you wifi router to a channel that is less crowded. This resolved my wifi issues, but nothing beats a wired connection!!!Storage: I bought BI because I wanted to keep an eye on things due to the increased crime rate in our neighborhood, but also because I have a new born and 4 year old in the house and it¡¦s nice to capture those cute diaper changes and funny things kids do that made you wish it you had a camera recording while it happened. I have found myself going through these recordings and not wanting to delete anything º!!!!  Storage is cheap these days, and I picked up a Seagate 3TB backup plus drive for about $130. At the rate I¡¦m capturing videos, I have managed to fill up 400GB over the last 4 months. About 100GB per month, so I figured a 3 TB (275Gb usable) will last me for 2 years of cuteness before I buy another 3-4 TB drive. I¡¦m sure by that time they will be absurdly cheap. The other nice feature of this is that this drive doubles as a SATA drive docking station so I will just need to buy a HD only with no fancy case and slap it on.Final thoughts is that I Still love this App and one of the best purchases I have made all year. I use it everyday not just for security, it has become the number on of my top apps I use on my phone and the live view and alerting feature has been invaluable. With the web security feature, I have allowed my parents to view my baby's room camera's during a specific time period so that they can just pop in and see the new baby sleeping and playing without having to face time me every few hours :-)At first my wife and friends thought I was a little weird to have so much visibility/security camera's at my house, but after I show them the value of what it does for a home owner, parents of kids and dogs, I find them calling me a few weeks later asking how to set a system like that for them. If you have something to hide from your spouse then I would avoid putting camera's inside your home, but for us, we enjoy the sense of security and priceless moments it has allowed us to replay. Next up are some HD Cams :-)Update 4/1/2014:Ok so I've had Blue Iris running for over a year now and still stand by the 5 star rating. The Blue Iris software updates just keeps making it better and better. Here are some of my observations and upgrades since my last review.HD CAM's:  I just upgraded from an older Swann DRV8 analog 480TVL system to an HD NVR Lorex 1080P system from Costco. Had a car break recently in and those cams just did not cut it for recognition of the thief. Did a good job of showing me how they did it though :-). Blue Iris notified me via text (I was sleeping and didn't hear it) and I got the video but it was too dark and grainy and I did not have enough cameras on my driveway to view all the action. Not BI's fault, but helped me pull the trigger on HD Cams!!!So now I run Blue Iris in addition to a LOREX NVR which is recording 24/7 @1080P @30 frames per second on 9 HD cams  :-). The BI is setup to tap into 6 of the 9 HD Lorex cams to record on motion and send me alerts, make noise by triggering .mp3 etc and has been working great, a lot better than the Lorex native NVR app. Like my old Swann DVR system, the Lorex NVR motion detect/alerting system was too sensitive, even on the -1 or 0 setting (lowest possible setting). As a test I setup alerting over the weekend on both BI and Lorex using identical area's for detection. By Monday morning, the Lorex sent me 170 email alerts vs. BI's 56 email alerts. 48 of those email alerts were legitimate, while the rest were of bugs flying in front of camera, tree shadows, etc. The BI's motion detection algorithm while not perfect is way better than the Lorex or Swann systems I've had.Plus blue iris does a better job of H.264 compression it seems because the BI mobile app is much smoother whereas the Mobile Lorex HD iphone app is laggy especially during playback. Blue Iris play back is super smooth, but the Lorex mobile playback is painfully slow. It looks to be playing playback in a full resolution and not the lighter substream  (I'm connected directly to NVR and not using the Lorex Stratus Cloud streaming service)Now this comes at a resource cost to your computer. I have Blue Iris running with now with 16 camera's, tapping into 6 Lorex HD 1080p @15FPS, and 3 Foscam FI9821 720P HD cams @15FPS. Blue Iris is using between 22-30% of my CPU and 1.5 GB of memory. I have a Intel I7 3.40GHz quad core CPU, with 8GB's of memory and SSD Hard Drive. You don't feel it when doing normal email, web browsing, but if this is a shared PC that is used for gaming or picture / video editing, then you should disable BI while doing those things.Now without any HD cams, BI was running at about 5-6% CPU utilization and 256MB of memory. So the moral of this story is you will take a hit with HD!!! But it's so worth it. Just remember you'll need at least a Intel I7 CPU or something comparable if you plan on running a lot of HD IP cams!Blue Iris vs. DVR's NVR's: For those of you who don't know about DVR's and NVR's. They are basically all in one boxes that camera's hook up to. They record, alert, etc just like what Blue Iris would do but with clunkier user interfaces and very little advanced features, but the good thing about them is that's it's basically plug and play. I do have to admin with this NVR system, I'm loving the POE (Power over Ethernet) so running cables was \"easier\" and cleaner. Additionally all the cams can be easily put on a UPS for constant power via the POE switch.With Blue Iris, you run it on a PC and do everything the DVR/NVR would do, but you have endless  configuration possibilities, but it can be more complicated depending on what you are trying to do. There a lot of options!!!I'm using a hybrid approach because it's offers me redundancy. I use Blue Iris with it's almost infinite configurations, and the Lorex NVR for it's 24/7 HD recording also in case the my PC crashes or the burglar steals it I'm still recording :-). It's also a resource issue because if I tried using my PC with Blue Iris for all my HD 1080P cams, it would probably render my PC useless because of the high demands of rendering HD. But most of you are not a security camera freak like me so you may not have to worry about it :-).New Features: Geofencing, basically what this will do is the app will notify the server whenever the device leaves or enters a specified location. For example, You can customize your alerts so you are not notified when you are home but when you leave via a specified distance, they will start to trigger. I personally have alerting on all the time but it seems very cool.Tips and observations: I was noticing that my BI records only about 10-15 seconds of a motion. I wanted a little more because I like to ability to review it later in it's entirety.  If you need to record for longer periods of time, you should adjust the \"Make Time\" to .2 and increase the sensitivity a bit. This is under the Motion/Trigger option of the camera. The \"Break Time\" is the time you specify how long after a trigger to record. Those two options together help me get all the video I need. You will get larger files due to longer record times but it may be very beneficial if you want to review a motion trigger without lapse in the timeline.Get you a good bug poison and spray around the cameras, I have a bad spider problem at my house and these little guys are attracted to the IR lights at night causing false alerts with the web's and crawling in front of the cams etc. I have to spray about once a month to keep the false alerts down.So again, after a year of solid use, I'm very happy and impressed with this piece of software. Not a day goes by when I'm not alerted of the comings and goings of my family members, deliveries (Amazon Prime Junkie), gardener, cleaning service, suspicious door sales men, etc. LOVE LOVE LOVE this APP!!!!Lots more information on this site which is a user forum for Blue Iris and security camera's in general.  [...]", "Date": "March 18, 2013"}, {"Title": "Buyer Beware & Be Patient!", "Author": "Robert145", "ReviewID": "R3L51TWPZ0CLLO", "Overall": "3.0", "Content": "This software is can be quite complicated. It is NOT plug & play. There are many, many configuration options. The software requires extensive knowledge of settings and the language that go with knowing HTTP, FTP Servers, WEB Servers, IP configurations. I have written & currently support multiple web sites & maintain a Windows 2008 R2 network for a company of 35, so Im somewhat familiar with what it takes. If you want to record activity from installed cameras, logic says you need to move or copy those recordings \"off premises\" to be reviewed later, which this software does provide. Why? Because if your property is being stolen or destroyed, so are the recordings if they are only being stored locally, on premises. Its like any good backup. So an FTP off-site or cloud is necessary to protect your files. Read and take your time or you will find yourself being overwhelmed by technology. Update to backing up your files off-site. I discovered that the popular cloud-type backup companies do not support backing up video file types, ie: MOV, AVI or MP4. What you can do is to purchase an ISP account which generally gives you about 10GB to start. Then you need an FTP enabled synchronization type software to copy the jpg & video files to that off-site location. I have it set to copy from the directory every 10 min. These are just things you can never know up front.", "Date": "February 3, 2013"}, {"Title": "Must Have for Foscam", "Author": "J. Johnston", "ReviewID": "ROI0EYQBNXYEW", "Overall": "4.0", "Content": "This is great remote viewing and recording software for the Foscam IP cameras.  It does everything I want it to do.  Email alert functionality works fine for me, and the motion sensing algorithm is easy to adjust and seems to work remarkably well.  The pan, tilt interface for the Foscams works very well also - better than the software that comes with the cameras.  There are a plethora of feature controls, triggers, alert settings, and record options - more than I will probably ever use.  The navigation is well laid-out and things are easy to find.My only criticisms are that it does not seem to provide a control for the IR lamps on the cameras, and the user interface is a bit \"clunky\" looking.  But the latter issue doesn't affect functionality or usability, so who really cares?  Overall, I'm quite pleased.", "Date": "December 19, 2012"}, {"Title": "Excellent display, control, motion activation, communication/notification capabilities, and value", "Author": "Pragmatic", "ReviewID": "R39YHAHH09JK85", "Overall": "5.0", "Content": "Blue Iris (\"BI\") is a significant improvement over painfully basic OEM supplied control/display software. BI is reasonably intuitive and  compatible with most-all IP cameras, and if a camera is not listed specifically in set-up, generally a set-up file for a similar camera will work fine. There are lots of IP camera forums on the Internet that discuss using BI if you run into challenges.Note that the BI software license is for ONE HOST COMPUTER. If you monitor/control your cameras from more than one computer you will need a separate license for each additional host. So be sure to install your software on your primary host.For the price, this is an excellent buy. Full-up professional IP camera control packages typically cost 4X the asking BI price.", "Date": "December 30, 2012"}, {"Title": "Blue Iris makes video security easy", "Author": "Practical Guy", "ReviewID": "R335NROA8LFGKW", "Overall": "5.0", "Content": "As a Z-wave hobbyist, I am accustomed to items that work, but only after lots of fiddling and experimentation (e.g. Vera 2, Vera 3). Setting up cameras on Blue Iris is so much easier than setting up cameras on any Vera. Though you can manually set up a camera by telling Iris what URL to use to get a snapshot from the camera, the software is already set up with a plethora of camera models for which such information is already programmed. Chances are that yours is already on the list. All you really need to know is the camera's IP address. I recommend getting an IP scanner for this purpose. I use an iPhone app that scans my entire network and tells me the IP address of everything on it. Cheap and reliable.For each camera, you can set up separate settings. For example, I have a camera on my front porch that allows me to see when a delivery is made. Whenever this camera or my back door camera senses motion, it sends an email to me with a couple of still shots and sends still shots covering the time of the motion to my free DropBox account. That way, if something happens to the Blue Iris computer (i.e., some jerk steals it), then I still have the pictures of the perp to show the police. I have another camera that faces the street so I can see whether or not the mail man has made his rounds. I don't want to get an email every time a car goes by, so this one just records a video clip to the PC Iris is installed on. Then, I can review the clips to see if the mail man has been by and admire any dogs that might have passed by in the meantime.I have a friend who works at a food pantry in a bad part of town. I am considering using Blue Iris on a cheap PC to provide her with visibility of the front and back doors and to notify her when clients arrive (or someone tries to break in the back door) since she cannot see either door from her work area. Iris can have the PC play a noise whenever motion is detected on a camera. The noise can be different for each camera. I'm thinking the front door camera will play a door bell noise when someone walks in the front door, and the back door camera will play a siren noise when someone attempts entry through the back door. I'll probably set up a DropBox account for her so clips from the back door camera go straight to it. Also, you can set Iris to do different things at different times, so I might try having the front door camera recording clips to DropBox when motion is sensed after hours. You can also set Iris to send emails to you when motion is sensed after hours, so you can know if your business has been broken into.Blue Iris isn't perfect. When set to full motion sensitivity, I get alerts caused by the shadow of a cloud passing in front of the camera. If I reduce the sensitivity, I miss motion events. So, I just leave it turned full sensitivity and deal with the false positives. Also, Foscam cameras will cause trouble (momentarily lost signals) when used on WiFi. I try to put these cameras on Ethernet whenever possible, but I do have two on WiFi that still work reasonably well. Of course, the stronger the WiFi signal is, the less trouble you will have with these cameras.", "Date": "February 21, 2013"}, {"Title": "Wish they had a native MAC version", "Author": "Bill James \"Bill\"", "ReviewID": "R3SNHEDCI7MKTA", "Overall": "5.0", "Content": "I know you can run BootCamp/Parallels/Fusion to make this work on a MAC, but it would be nice to have a native MAC version. I did purchase this via the download from the Blue Iris website and did setup Bootcamp to run it and it works very well. It has all sorts of cameras and covers the many different cameras I use from Foscam, to Q-See to Swann and others.The Blue Iris App works well, but you need to have it connect to the machine running the software. Once that is done, it's a no brainerFor the price, you cannot go wrong if you are running Windows. It works very well and is really easy to setup. The help files are well written and tell you everything you need to know for any setting. Just click the question mark on the page where you are and the help opens up to show you every option on that page and what you can do. You can also open the help from the home page and do all the normal things you can do with a Windows help search", "Date": "December 28, 2012"}, {"Title": "Can't be beat for cost and capabilities!", "Author": "Kevin M Agard", "ReviewID": "R3QYN6EZ9XBWNU", "Overall": "5.0", "Content": "I have been playing with IP cameras around the house for the last 6 months or so and quickly came to the conclusion that the software (browser based UIs) supplied with most of them is pretty much substandard garbage. I therefore set out on my quest to find something better. I spent a couple of weeks researching, comparing and, where available, trailing the various 3rd party solutions out there, and there are quite a few at prices ranging, literally. over to $1000! Then I came upon Blue Iris and downloaded the trial. I honestly could not believe it capabilities at this price point. It pretty much does everything I want in such a package and more. And at under $50 there is not a package with similar capabilities that even come close.With that said, there are some things to be aware of:1. While this item is branded by Foscam, Blue Iris is actually a product of Perspective Software. I think Foscam is a VAR for them. I had already downloaded the most recent version of the software from BI's website. so when this item arrive I did NOT actually reload from the supplied CD. I simply used the serial number to unlock the version I already had installed. That went without a hitch.2. I am an IT geek and actually am a Network Engineer, so setting this setup was a fairly straightforward process for me. And if you are looking to use the BI web interface to view your camera(s) from within your LAN, it will be fairly straightforward for you as well as the default settings pretty much handle this. If, however, you are on a typical home broadband connection with a dynamic IP number through a NAT router, and you what to view the cameras remotely, you will have to be comfortable using alternate port numbers and setting up  port forwarding in your router. So be sure to read up on the subject in your router's user manual before starting and if not comfortable, enlist the help of the neighborhood wiz kid to do it for you.", "Date": "September 14, 2013"}, {"Title": "Works with Logitech Wilife - Gr8 4 Security Cam Control Freaks", "Author": "Kaio", "ReviewID": "R37KPRBH5QWPGG", "Overall": "5.0", "Content": "I'm a longtime Logitech Wilife user, which means I'm used to limited security cam functionality, time delays, and things not working how they should.  But we recently lucked out and got a Foscam FI8910W Pan & Tilt Security Camera for half off at Target.  I'd been coveting these cams for awhile, so I jumped on the opportunity to get one at such a good deal.  The cam was very easy to setup, and I was so impressed with it, that I decided to give Foscam's Blue Iris a whirl as well.  So we downloaded the free trial and it was immediately apparent how limited and wonky Logitech's Wilife setups truly are. And better still, Blue Iris works with my Logitech cams, so there's no looking back; we should have made the switch to Blue Iris long ago.Easy SetupIf you're the type who likes to have a disk and retail box, then order that and wait for it to arrive.  Otherwise, just go to Foscam's website and download the 15 day free trial like I did.  It's a fully functional copy, but has a line of text running through the center of the video stating that it's just a trial version of the Blue Iris software. Within the first hour of installing the trial, I had my new Foscam FI8910W running, AND all 6 of my Wilife cams, and 1 webcam all setup and running on my Blue Iris trial software.>How To Make Logitech Work on Blue IrisWithin Blue Iris, just click:> Add Camera> Video Tab> Configure> Select Camera - in my case, Logitech Wilife> Set BOTH the HTTP/Web Port & HTTP/Video ports to 8080> Set the IP address to the Wilife cam you want to add> Click Ok> Set the Video format to your liking (I chose 640x480 @ 15fps)> Click Ok againVoila - you just added a Wilife cam to Blue Iris.  Repeat the steps above for all your Wilife cams.**Note** - to find the IP address of your Wilife cams, click >Computer >Network and you should see a list of all your Wilife cams there.  Then just >Right Click >Properties to find the IP address for each cam.  Alternatively, you could open your Wilife Command Center, then click >Setup >Advanced >Diagnostics and you'll find info and IP addresses for all your Wilife cams there.Blue Iris Tweaks & SettingsThis software is a control freak's dream.  You can literally tweak most anything and everything on your cams through this software.  Fantastic!  Here's some of my fave features:> Motion Trigger - set the sensitivity and triggers for each cam.  Triggers can be based on contrast fluctuations, and object size.  You can also set the minimum and maximum motions that set the triggers.  Such as, 1 second of movement before recording begins.> Custom Zones - it's MUCH easier to setup trigger zones with Blue Iris than Logitech.  Just use your mouse to paint pixel blocks you want the cam to ignore.  There's a HIGH degree of control over exactly what pixels and areas to mask off.  Very nice.> PTZ (Pan Tilt Zoom Controls) - control most ANY capable camera via Blue Iris -- pan, tilt, zoom -- whatever the cam is capable of doing can be controlled via this software.  You can even set custom motion paths for your PTZ capable camera, so it'll automatically scan the room in any pattern you want.  Try doing that with Logitech.> Event Schedules - trigger custom camera settings and events at specific times of day.  Automatically pan the room and record at specific times and intervals.  Change color settings, brightness, contrast, etc., all on a schedule.  You can even set these triggers to occur daily based on sunrise and sunset times.  Cool!> Alerts - send text messages and email alerts to yourself whenever activity is detected> Remote Viewing - Use your tablet, smartphone or computer to log into your Blue Iris security system directly to view clips, cams or change settings while offsite.***Note*** Apps like TeamViewer for Remote Control and Splashtop Remote Desktop can also be used to access your security cams while offsite using your cell phone, tablet or computer.  It's actually very easy to do it that way, and you have the added benefit of being able to fully control your computer.  So if something goes awry with a security cam, you'll have the ability to fix and reconfigure everything, just like if you were physically sitting in front of the security cam's host computer.  Very nice.Good Deal & Easy TransitionI got my paid copy of Blue Iris online via a security key that was emailed to me by the manufacturer.  Just type the code into the trial software and you're good to go.  All my settings from the trial software were seamlessly carried over into the paid version; no hiccups or re-tweaking.  And the price for the digital key was almost 10 bucks less than the retail boxed version of the software.  No waiting for anything to arrive in the mail.Add Up to 64 Cameras!Blue Iris can handle up to 64 cams at once; recording, triggering and monitoring all of them at the same time. We've already bought more cams and plan to keep adding to our system over time.  We recently added this new Foscam FI8916W - Newest Model) and this Tenvis JPT3815W Ip Camera and also just ordered this Tenvis Mini 319w Wireless Wifi Camera.  That's the cool thing about this software -- it'll work with pretty much Any WiFi IP camera, or most any USB camera too.Networking Know-HowYup, you'll need a little knowledge about networking, IP addresses and maybe even port forwarding.  But it's nothing all that difficult if you have any experience with that sort of thing.  And if you don't, it's not hard to learn; just a few paragraphs of reading and you'll be up and running.Tech SupportGood to know Blue Iris stands behind their product, but I doubt I'll ever have the need to call them.  Everything looks and works great!!Bottom Line - we're really happy with our new Blue Iris software and how it's enhanced our security system.  Love all the custom features.  Love that we can keep adding more cams over time. Love how easy it is to use and tweak.  We took to it right away and found everything very well laid out and straightforward.  Very happy with it and glad we found it.  Fantastic.  Happy! ;oD", "Date": "March 16, 2013"}, {"Title": "Best Video Surveillance Software", "Author": "Mike C.", "ReviewID": "R1W7PCU0ZZIWMG", "Overall": "5.0", "Content": "This is by far the best video surveillance software I have seen free or priced. It's well worth the money. I use it to monitor 6 ip cameras. The android app is $9.99 and works great. If you plan on using this software for remote viewing setting up port forwarding on your router is a necessity. Videos on how to do this are easily found on Youtube. You also have to set up your virus software (like Norton's) and Windows Firewall to allow an exception for the software to access the internet.In order to have the software run in the background and bring itself back up every time the computer reboots or the software crashes you have to add a shortcut to it in the startup folder and set the software up as a service. (instructions for this are included in the online manual)", "Date": "September 11, 2013"}, {"Title": "Awesome software!", "Author": "Robert Beeman", "ReviewID": "R4KTH2G0RUW3M", "Overall": "5.0", "Content": "I just purchased this software (direct from Blue Iris' website), after running the trial version for about a week. I am so impressed with this software's versatility and functionality. For the past two years I was using the Logitech Alert Commander software Logitech Alert 750e Outdoor Master Security Camera System with Night Vision (961-000337) and have always been frustrated by its reliance on Logitech's servers to proxy my video feed. I recently purchased a new Foscam Foscam FI9821W Indoor Pan/Tilt H.264 720p Wireless IP Camera, 1/5\" Color CMOS Sensor, F: 3.6mm F:2.4 (IR Lens), IEEE 802.11b/g/n Wireless Connectivity, White, to use as a baby monitor, and wanted to integrate the two into a single view. My friend told me about this software that he has been using. After trying it myself, I am beyond impressed. I even added my webcam so that I get a third view into my home. It is so fast when viewing remotely (compared to Logitech) since there is no third party in the way.What I like:* Its ability to unify disparate camera hardware into a single monitoring system.* One time cost for full functionality. Logitech charges $80/year for their \"premium\" service in order to just play back recorded video remotely.* Extremely high amount of customization options.* Instant access to video feeds, even when accessing them remotely over cellular. Logitech would take a very long time to connect, and then constantly pause and display \"Loading Video.\"What I don't like:* It is much more difficult to set up than Logitech, but if you know your way around your home networking equipment then it isn't bad.* You must purchase the mobile apps separately for an additional $10. The good news, at least on iOS, is that it is a universal app for both my iPhone and iPad. The bad news is that I had to purchase it twice: once for me, and once for my wife (we have separate Apple IDs). They are worth buying though since they give you full access to your system.* I don't think the software is as aesthetically pleasing as Logitech's. This is very subjective though, and what really matters is how functional Blue Iris is.", "Date": "June 18, 2013"}, {"Title": "Waste o' cash", "Author": "DR Yuk", "ReviewID": "R397X7TB4W0BMQ", "Overall": "3.0", "Content": "I usually do not buy software like this but I went ahead and tried.The software came in a timely manor. I opened the package and found a disk and case.No instructions or Registration code.I installed the software (It took an ungodly amount of time scanning to confirm space) it asked me to enter a code or pay again to use it.After confirming I received no code I tried to call the company (No phone number!) so I sent them an email and got no response.Wont be doing this again through Amazon (or them).", "Date": "May 21, 2013"}, {"Title": "What a Bargain", "Author": "SSufficool", "ReviewID": "R2F1FWQIZ9WTK8", "Overall": "5.0", "Content": "I'm pricing systems for my work and thought \"Why not build one for my home?\". This system has all the features of the $35,000 system quoted by vendors. It works with my junky $50 PTZ cam all the way up to the $5,000 5 megapixel professional cams. Motion detect, alarm triggers, e-mail alerts, Text alerts, interfaces with Arduino, alarm inputs/outputs nd sooo much more that I may never use. Other \"professional\" NVR software gives you 8 cameras and requires a $100 license for each extra cam. This comes with 64 camera support out of the box for $50. Mind blown.", "Date": "February 28, 2014"}, {"Title": "I wish I had written the instructions .....", "Author": "James T. Rook \"Turtleman\"", "ReviewID": "R3IT8X5T4IA1FT", "Overall": "4.0", "Content": "FIRST:  I have no qualms about recommending this software .... BUY IT .... but ...depending on your experience it may be VERY difficult to integrate the THOUSANDS of setting combinations that make this Security Camera software probably the best there is .... I spent two days and two nights figuring out what boxes to check .... and more importantly which ones that came checked I needed to UNCHECK to get certain features to work.Once the light bulb dawned ... the software works flawlessly, and well, really.I have a combination of  Two WIFI IP Cameras, a built in laptop camera, so I can see my smiling face, and a webcam glued to a board on a 25 foot long ACTIVE USB extension cord.However .... Technical support is WORSE THAN USELESS, as the speak highly accelerated unintelligible India accented English, I was on hold several hours at 3AM, they took over my computer to make some fixes ( I trusted them ... ), and after putzing around for 15 minutes accomplished nothing.If Blue Iris wants to send me a box of six  Foscam IP Pan/tilt cameras, I will write a 10 page analysis and troubleshooting guide that will make this software absolutely perfect .... and they can lay off the \"boys from \"Bombay\", which is for standard issue  redneck Americans who speak English slow, and slower, like me .... an anxiety ridden irritant.Tom.Rook@Technik-SA.US.........", "Date": "January 28, 2014"}, {"Title": "Excellent product at any price", "Author": "J. Weaver", "ReviewID": "R1XKCFOEDGNB4H", "Overall": "4.0", "Content": "I went through the 15-day trial period just to verify that I liked this before paying up and after two weeks, I was ready to pay up.  I tested it with three cheap cameras:  a HooToo indoor IP camera, an Agasio outdoor camera, and a Logitech webcam that I have had for years.  All three cameras set up easily and it is compatible with a lot of other cameras as well.From the Blue Iris console, you can view all your video feeds live, or select the camera of interest and zoom in on the action.  Remote access is easy to set up if you understand port forwarding.I am running Blue Iris on Windows 8 Pro, and it works like a charm.  It has its own built-in web server that does *not* rely on Windows IIS.I verified that I was able to set up e-mail alerts for the cameras with motion sensors (which I can do from the cameras themselves, but Blue Iris allows centralized control of this and easy customization).The configuration menus are a bit daunting at first, even for a seasoned computer professional like myself.  However, I was able to figure everything out without the need for the help files or any outside assistance.  Really, the bulk of it is self-explanatory.That stated, I could see this software being a little frustrating for someone with little computer experience or little video surveillance experience.  Your mileage may vary.On a low-end (640 x 480) camera, continuous recording seems to take up about 5GB per day, and that is at a fairly choppy framerate (I think I was getting ~8 frames per second, but don't quote me on that).  I would recommend setting it up and seeing for yourself how much space it takes daily and then plan your HDD space according to the number of cameras and the number of days you intend to keep.You can also tell Blue Iris to only record when there's motion if it is a motion-detecting camera.  You can define the motion zones within Blue Iris, although I did not test that.All in all, this is nice software if you want centralized recording and monitoring of your multiple cameras, and for only fifty bucks.  You can view from anywhere in the world so long as you have a web browser and you setup port forwarding on your router.For free DDNS services, you can use no-ip.com, although they require that you confirm you are still using it once a month.  Blue Iris will periodically check your internet-facing IP at intervals that you can configure right in the Blue Iris settings.I have no qualms about recommending this product to anyone with the need for it.", "Date": "August 3, 2013"}, {"Title": "Loads down a netbook too much", "Author": "Roger B", "ReviewID": "R2HHNCHLX4HAKE", "Overall": "2.0", "Content": "I have been using a netbook running Windows XP and iSpy (open source) to monitor all of my FOSCAM cameras.  I was trying to improve on the iSpy frame rate which is ~4 fps over wireless.  The Blue Iris software completely loaded down the netbook to almost non-response.  If you are going to use this software, you will need a PC that is faster than a 1.6GHz Atom powered netbook with 2G of DRAM.", "Date": "September 2, 2013"}, {"Title": "Old software", "Author": "Rich", "ReviewID": "R39BFMAFQVST17", "Overall": "2.0", "Content": "Purchased this software through Amazon when I also purchased 3 FOSCAM cameras. The cameras work well but although software loaded it would not launch. After contacting FOSCAM tech support was told the software I received was over 3 years old and would not work with OS 7. Returned software because that's the only option I was given.", "Date": "May 27, 2014"}, {"Title": "Blue Iris Software and Foscam cameras Great", "Author": "Wolly yarrow \"Wolly Yarrow\"", "ReviewID": "R2E21UZHCOLJ9S", "Overall": "5.0", "Content": "I have installed Blue Iris on a PC, managing a 4 camera Foscam system(a 9821V2, and three 8904 cameras).  Many Blue Iris software supplied system managementfunctions are being used, along with the configurability and control of thecameras, with great success.  The system has been up and running for a month now, withsolid reliability. The 9821 is wireless, and the three  8904 camerasare connected through ethernet cable to a Lynksys E2500 router.  Blue Iris software updates, along with Foscam firmwareavailability is great.  Thanks for the great Products!", "Date": "March 24, 2014"}, {"Title": "Server", "Author": "Andre Williams", "ReviewID": "RRCZGPI9S0RCH", "Overall": "4.0", "Content": "There are some basics in networking that you must understand before you purchase this software.  To get the most out of this product you have to be willing to dedicate a computer to run this software 24/7 (i.e. your computer becomes a server).  I purchased the iphone app ($9.99).  This way this thing works is that the computer you install the software on must be on your home (or office) LAN.  My computer is ethernet connected to my router (one of the switch ports on the router).  This works best because the IP address of your computer must be known.  If your computer is wireless, you should create a static IP for it. You then configure \"port forwarding on your router.  This establishes the internal and external ports that you want computer to receive the streaming traffic on.  I kept my internal and external ports the same number.  Pick a high number (or learn more about internet ports).  In addition, you need to find out the IP address that your internet service provider has assigned you [...] .  You have to tell the software the internal IP address configuration (your local LAN), and the external IP address configuration (outside your LAN).  What's nice is that the camera has a DDNS that you can use for your external IP address (this is why keep the ports the same number helps because you associate the IP address with the ports).  I suggesst you change all defaul user accounts (both on the camea and software). I created an administrator account and a basic user account.  I only use my administrator account when I need to make configuration changes.  I can't possbily cover all the configuration options, but I hope that someone new to this technology understands that it's not as simple as it might seem; however, this does not mean the software sucks.  The software and camera are excellent.  They work very well.  The app for iphone is also excellent.  Good luck and enjoy your new toy.  Cheers!", "Date": "March 20, 2014"}, {"Title": "Tons of features, however uses 59% of CPU for one 3MP camera on 3.0Ghz Core2Duo 4GB RAM PC", "Author": "YeahSoMaybe? \"computersandmusicperson\"", "ReviewID": "R3W2T0VQT8VSII", "Overall": "5.0", "Content": "Tons of features.  I have a 3MP \"Hikvision\" brand Outdoor IR LED dome camera.  You can spawn cameras in totally separate resizable windows as much as you like.  It started up with motion trigerring already enabled.  It seems to work well.  Someone walks by, the frame of the screen has a momentary thin red frame and it then takes a picture or a video clip.  There seems to be more granular frames per second options although so far I haven't seen that I have gotten them to work.One concern:  Windows 7 Pro task manager reports Blue Iris software is using 59% of my Intel E8400 CPU on my Windows 7 Pro workstation (HP Business class desktop with 4GB of memory).  Yikes!  Those who know about the Intel E8400 CPU will know that -- while it's an older CPU -- it's \"no slouch\".  The E8400 was one of super good price to performance deals that Intel manufactured, not one of their lemons.I became aware of this because one morning the camera was not responsive and the BlueIris \"Help\" notes stated (paraphrased) \"Most of the time, a CPU pegged at 100% will be the culprit\".  So, yeah, I restarted the HikVision camera with the BlueIris \"reset\" utility and voila, CPU usage back to it's %59 average.  (The modern IP cameras have a tiny Linux OS(Operating System) kernel in them and like any OS need to be restarted for various reasons at times.)It is possible  - I'm not sure yet -- that the fact that I am using the older Intel onboard GPU(i.e. Video) chip is what's causing this high CPU usage.  While the older Intel onboard video chips were known to be poor performers, I suspect this is not the root cause.  I'll have to find a half height \"real\" (nVidia or ATI) video card to find out.  However after owning dozens of computers and working in the computer business for years, I frankly suspect the Blue Iris software simply uses a LOT of resources.  It would seem unwise to entertain the idea of running this on an Intel \"Atom\" CPU.  One can hope that as I add other cameras that they will only incrementally add increase of CPU usage overhead.  When the cold snap goes away I will feel like getting up on a ladder and adding a 2nd camera to this Blue Iris/Win7 Pro setup.  Note:  I still have 2GB of RAM (memory) available so that is not my concern.UPDATE 12/15/2013I was on a CCTV forum and they were discussing Blue Iris CPU usage, and experienced people on this forum said that buying a high powered video card will do NOTHING to lower CPU usage.  The video is in 2D and it has to be de-encoded for motion trigger capture, resizing, etc.  The only tips I recall being suggested (on this Blue Iris forum) to mitigate/lower CPU usage is to record DIRECT to disk and also to aggregate the recorded mini-clips into larger/longer recorded blocks of data.  As I am still a beginner with this program and don't fully know all it's features, take this with a grain of salt - it's just stuff I remember reading on a forum.  I * DO * think it's quite possible for two (2) high powered cameras to peg a modern CPU at near 100%.  I basically look at Blue Iris now as a very classy, but resource hog software for surveillance cameras.", "Date": "December 7, 2013"}, {"Title": "You can stop looking, this is the one to buy!!!", "Author": "Amazon Customer \"Itmhq\"", "ReviewID": "R1KX3P0063MOM2", "Overall": "5.0", "Content": "If you are unhappy with your IP camera because of the limited software that came with it, look no further, this will delight you! I do design and project management for commercial installations, and this software is as good, if not better, that the best in class commercial packages costing $1000's. It does almost anything you could want it to do, and the few things it doesn't do (like automatically move a PTZ camera to follow motion) are in the works. Tech support from the developer is fantastic - immediate response and he'll even log into your system and help you configure it. I only wish I had bought this when I bought the cameras instead to trying to struggle along with the \"free\" included software and Web services.", "Date": "November 27, 2013"}, {"Title": "Great little camera", "Author": "John D. Underhill", "ReviewID": "R10E35CK7UWUGI", "Overall": "4.0", "Content": "Easy to set up, does everything advertized.  Set it up with the desktop software in about 10 minutes, works as advertized.  You'll need the desktop software to do any long term recording.", "Date": "September 10, 2013"}, {"Title": "Easy to use", "Author": "Gertraude Warren", "ReviewID": "R3OVAD82S82XHT", "Overall": "5.0", "Content": "I set this up in minutes and now have piece of mind when I'm away from home.  All I needed to get this working was an app on my iPhone \"FoscamPro\" and I can control sound, direction, light,etc.  -couldn't be easier.  Their customer service was easy to reach and helped get me set up with a wifi connection.", "Date": "September 5, 2013"}, {"Title": "Blue Iris Rocks", "Author": "El Pajaro", "ReviewID": "RSCBBSTH5KJFQ", "Overall": "5.0", "Content": "This software is well thought out and does an excellent job of managing a IP camera network. I only have three CAMs so far but will add to the setup as money comes available.The only thing I dislike is the user's manual is a Web Page based book available from within the app. To print out a copy requires a bunch of effort and experimenting.I do recommend this software for use with IP cameras including the FOSCAM's", "Date": "August 28, 2013"}, {"Title": "Great and easy to set up!", "Author": "Jeff Parker \"Jeff Parker\"", "ReviewID": "RRKXW73I1B3EH", "Overall": "5.0", "Content": "I have Blue Iris up and running with several IP cameras from different manufacturers and have had absolutely NO problems in the 6 months I have been using it. There have been many, many updates during that time as well. I never read any sort of documentation and was able to get the whole thing up and running in about 15 minutes. Additionally, the motion detection is great...without lots of fiddling I've been able to ignore the swaying of trees outside while capturing videos of people walking down the sidewalk.For those people complaining about lack of cloud-based solutions, install Dropbox. This gives you cloud upload with a local file path - even if your security system is stolen, your captured images and files are safe. It's a snap to setup.The great thing about Blue Iris is the one-time price. Some other IP camera solutions require you to buy \"packs\" of functionality or charge a monthly fee. Blue Iris only requires that you purchase the software once.It also can integrate with Arduino boards if you're a hardware hacker :D", "Date": "August 19, 2013"}, {"Title": "Pretty good - satisfies my security needs", "Author": "Revconguy \"Revconguy\"", "ReviewID": "R33UD5ZX3G4JZP", "Overall": "3.0", "Content": "Good product that pretty much satisfies my security needs.  The 'use as a service' feature is a little buggy. On my computer it prompts for a administrator password at startup.  This makes it awkward for others to start the software when I'm now around. Otherwise, I love it.", "Date": "August 17, 2013"}, {"Title": "Awesome Product!", "Author": "Gareth J. Hooper \"IT Guy\"", "ReviewID": "RNP2L29GER1UX", "Overall": "5.0", "Content": "I read the reviews here and thought the camera seemed perfect what I needed it for and for a very good price. Camera worked exactly as reviewed here by other people, can easily access the camera via my Droid, my Wife's iPhone, and my Wife's iPad.Couldn't be happier.", "Date": "August 6, 2013"}, {"Title": "Blue Iris Camera control", "Author": "Don C. Brumm", "ReviewID": "R24GIQ2IARM7NS", "Overall": "5.0", "Content": "The software installed easily and performed as described.  Adding my Foscam camera was easy and trouble free.  All controls operated seamlessly.  Setting up surveillance parameters for alarm triggers is very flexible.  Object size and contrast in conjunction with area elimination provided me with all I needed to eliminate false alarms without missing real ones.", "Date": "July 31, 2013"}, {"Title": "Great product... PLEASE READ IF YOUR HAVING STABILITY ISSUES", "Author": "Dustin", "ReviewID": "R35QNHPFRFCVZF", "Overall": "5.0", "Content": "Update:My old review I have left intact at the bottom for your reference. I was having stability issues with Blue Iris, as it was crashing every day or two on my custom built high end PC. A fellow poster read my review and commented that my Antivirus was most likely the culprit. Being that I'm an IT Professional, I felt that I already checked this, as I turned off most un-needed features from my Antivirus. Well, I finally heeded his advice and checked again and sure enough, Avast had several behavior monitors running in the background that processed things such as network traffic. As soon as I turned off these hidden and un-needed features... Blue Iris has been 100% stable.If you are having stability issues, please look at your antivirus and what all it is monitoring.Old Review:Since I've installed this, I've applied every update than has been put on and yet the software typically crashes every day to day in a half of use and has to be restarted. No, the issue is NOT with the computer... I am an IT professional and am running this on a brand new high end machine with a fresh clean copy of Windows 7 professional 64 bit.I hope they fix the reliability of the software, as when it works it is absolutely amazing.", "Date": "July 31, 2013"}, {"Title": "Does not seem to work with Windows 8", "Author": "James M. \"James M.\"", "ReviewID": "RHXGNGL5QEU53", "Overall": "2.0", "Content": "I bought Blue Iris with a Foscam IP camera and it seemed to work fine with my Vista OS. Then I upgraded to Window 8 on a new computer and it won't record well. 7 calls to Foscam who sold it to me didn't help and Blue Iris has been totally missing in action. They say they have 24 hour email suppport but so far they have ignored every email I have sent them.", "Date": "July 22, 2013"}, {"Title": "Worth every cent", "Author": "An old soldier", "ReviewID": "R1PXHINCOX51SG", "Overall": "5.0", "Content": "Think of this software as a the equivalent of a DVR for your security cameras. The cameras will continuously stream their data to a main computer which then interprets the data. You set the software to monitor video, sound or both. You can then set the software to either alert you (at the pc), sound an alarm to the \"intruder\" (camera capable), record the session (either continuously or just a clip), or upload the clips to email, ftp, or just save the clips and/or recordings to a location of your choice, in a variety of formats (mp4 included.)And you can monitor all this with a phone, too, if you so choose (extra.)It DOES have a STEEP LEARNING CURVE as it is quite powerful, and due to the complicated inherent nature of networking, camera hardware, and computers it will be difficult to set up properly, but trust me it can be done, and there are plenty of people \"out there\" who will be willing to help you. Plus the company is constantly adding features to their software (for free.)I own the software, and have no financial interest in the company whatsoever.", "Date": "May 18, 2013"}, {"Title": "Great Software and Tech Support!!!!", "Author": "Venom", "ReviewID": "R3DEVFR6QOY5I", "Overall": "5.0", "Content": "I am using a Agasio A533W Camera. I got this camera to work with basic functions pretty easily using the Blue Iris Software. But I could not get any PTZ functions. This was mainly due to not having this camera in the supported camera list. One call to Foscam and Sandra in Tech Support selected the proper camera settings and did the port forwarding for me. I now have the PTZ functions and the camera is working great. Letting tech support link directly with your computer saves lots of time on the phone. They can just get in there and set it up in minutes. For the price I think it would be hard to find a better camera with these features and service. I am also using IP Cam Pro Viewer on My HTC Amaze 4G Android phone with all PTZ functions. In Blue Iris select 3S H.264 RTSP/HTTP under the Video tab. Then under the PTZ Tab enable PTZ and select 3S H.264. In IP Cam Pro Viewer for Android, Select Make: EasyN, Model: EasyN H7 Series.I would recommend this software and camera.", "Date": "March 28, 2013"}, {"Title": "Outstanding!", "Author": "DanH", "ReviewID": "R319QVGQPLS0D8", "Overall": "5.0", "Content": "Blue Iris is outstanding!  It provides fine tuning for cameras to minimize false alerts along with a great alert system and all the bells and whistles that the other software I have tried did not provide in one package.  I am using it with Foscam cameras and it works great. It will manage multiple cameras, up to 64, all included with the license.  No added fees for additional cameras. It makes streaming simple from remote locations. Blue Iris provides exceptional value for the price.", "Date": "February 21, 2013"}, {"Title": "Once you download the manual and get past the first setup its Good", "Author": "Whatmorecanyousay \"Bob\"", "ReviewID": "RNLEQ4MSU5PYP", "Overall": "5.0", "Content": "Bit more complex to set up than the android or iPhone programs but it works well.All cameras come up fast (if they are active) and gives you the same experience(only quicker frame rates) than using a smartphone.  The smart phoneapplications from Robert Chou, IPCams, has a similar look. I would say theprice is high for the PC version, but the use of one package is worth the fee.Only purchase if you sit in front of a PC all day because I go to the smartphoneview as convenient and smarter.  If you work at home this is great monitoring trafficin the house while on the phone. Your always confident it is someone you know vssomeone with a pillow case looting your house while you are on the conference call.Ideal for UPS delivery and being able to thank the UPS guy (audio only Cameras)", "Date": "January 7, 2013"}, {"Title": "good product", "Author": "William Jackson", "ReviewID": "R1SFOG2K07RJM1", "Overall": "4.0", "Content": "I bought this product in conjunction with 4 ip cameras. To keep an eye on my house while I'm away. It was very easy to set up, had a mediocre instruction guide on setting up the cameras. If you do not have any pre existing knowledge on networking you may have a little bit of a hard time setting up the system. The instructions that they give you to view over the internet are outdated. The company no longer supports or offers the free DNS version so there is a yearly fee for having it accessible over the web. The price is not bad and there are other options out there. There is no info on accessing it over the web either, just how to set it up.", "Date": "January 1, 2013"}, {"Title": "great software for Foscam", "Author": "jowica", "ReviewID": "R3Q48SSDVJ1WXA", "Overall": "4.0", "Content": "glad I got it for under $40, still can't figure out why the price spiked just before Christmas??? Installation was quick. If you can get the camera running in the first place, programming the software with settings should not be too much of a problem.only negative comment is that there is not documentation other than in the help section of the program. a brief owner's instruction manual would be nice and helpful.", "Date": "December 15, 2012"}, {"Title": "Probably the best DVR software I've used", "Author": "Amanda", "ReviewID": "R1NPRUOFTFCHGN", "Overall": "5.0", "Content": "The developers really outdid themselves on this product. I've used a lot of DVRs and DVR software kits. This beats all of them out of the water. This software could be used in countless settings. It's great for in the home, or in a large business environment. This has all the features you're going to need. Some of my favorites are Alerts (sound or motion that triggers a bookmark w/ thumbnail that save you a lot of time when reviewing recordings), archiving and offsite storage, email/sms/app push/serial port notifications, PTZ controls, Joystick input, a JavaScript API, android APP (not included), scheduling, you name it. I'm still discovering cool features in this software. You're going to have to do a little reading to figure out what's what, but I don't see how you could be disappointed with this software.", "Date": "April 22, 2013"}, {"Title": "Waste of money and a lot of time", "Author": "J. Boursier", "ReviewID": "R10S3JVCARVOLY", "Overall": "1.0", "Content": "Never, ever got this software to work. Followed the instructions to the \"t\"; but never was able to do anything more than view real-time video on one computer. Remote viewing never worked. Emailed customer service and eventually got a reply (2 weeks later) that was so lame I didn't even bother to continue to try to contact them. Please save your money.", "Date": "November 21, 2013"}, {"Title": "Try before you buy", "Author": "Mr. N. Edwards \"NiallEd\"", "ReviewID": "R2JNOUI0VN1WW6", "Overall": "2.0", "Content": "I have some Axis cameras monitoring the front of my house for a while now. Unfortunately a recent burglary executed through the back of the house highlighted the deficiency in my setup.I decided to expand the coverage using outdoor cameras at all the rear access points. As buying external Axis cameras was too costly, I decided to try the Foscam FI9805E. This is actually quite a nice camera (especially for the price) but it wasn't supported by my existing Camera software. The Foscam website suggests BlueIris so I bought a copy.The initial setup really wasn't too tricky. It didn't recognise my Axis cameras automatically so I had to choose the models from the dropdown selection and then they worked ok. The initial default resolution setting was set to 640x480 which was far too low but again, that was easy to change.An important requirement for me was to record on motion. Most netcam software (& indeed many cameras) has some sort of motion detection feature. However, I have found that it generally isn't very reliable. Yes it works, but a sudden change in light levels (eg sun behind a cloud or a tree shadow swaying in the wind) can cause a lot of false positives. My solution to this was to use PIR detectors (Bosch do a very good one) and connect them to the digital input port (DIO port) on the Axis Cameras. This gives much more reliable motion detection. The Foscam FI9805E also has a digital input port. As the BlueIris software is supposed to support DIO ports, I thought it was a great match for my cameras. The trouble is, it doesn't work.I emailed BlueIris and initially they told me it did work with my cameras but after a while they (kind of ) admitted that it didn't. They did offer to help try to sort it out, but in spite of my doing everything they asked, they never came back to me or did anything further.I understand that for a lot of people, the use of the DIO ports is probably not something of interest. However, it highlights the poor support if you do get a problem. So, my suggestion is to try the software first.You can download a trial from their website, make sure that it correctly supports all of the features you need and then come back to Amazon to buy it.If it were not for the poor support, I would have given this software 4 or maybe 5 stars. There is a lot of functionality 'under the hood' but as some other reviewers have noted, it can get a little confusing if you are not technically inclined. In the main, it works well.Provided you don't mind opening up a route through your firewall, you can access it from pretty much anywhere which I imagine will be a very attractive feature to many users.Even though it is priced very attractively, I just wish I had tried it before parting with my cash.", "Date": "May 29, 2014"}, {"Title": "Easily worth much more than $50.00", "Author": "Joseph Mumme", "ReviewID": "R10179T6G4RX5O", "Overall": "5.0", "Content": "Good way to keep \"an eye\" on your property. Using it with nine Foscam ip cameras. Some generic ips that I ordered from DX dot com. Nothing but good things to say about Blue Iris. Its a hoot. As well a tool.", "Date": "May 27, 2014"}, {"Title": "Excellent Camera Management Software", "Author": "The Pen", "ReviewID": "R1DM79IHD1FM11", "Overall": "5.0", "Content": "I tried other programs but finally settled on Blue Iris. The controls flexibility and User Interface provide for a great way to manage your cams both locally and via the web. With it's excellent price I highly recommend it!", "Date": "May 26, 2014"}, {"Title": "Excellent security camera software!", "Author": "BuckeyeShopper", "ReviewID": "R1L124PPU75MND", "Overall": "5.0", "Content": "I bought this software based upon the other good reviews, and I am impressed! This works very well, and has a lot of configuration options. But it isn't hard to set up. There is a well written help guide easily accessible from the program screen which walked me through not only getting my cameras up and viewed, but how to put the video feed on our LAN and WiFi and also how to go about having remote access via the internet. They put links to the additional information and things needed right when I needed them as I read their guide. It has a content table, so I did not have to wade through the parts that do not yet interest me to get to the things I needed at the moment.I recommend Blue Iris Pro to anyone wanting a nicely done package to monitor one or many cameras.", "Date": "May 23, 2014"}, {"Title": "good item", "Author": "robert", "ReviewID": "R2MPGIB30XTJ3K", "Overall": "5.0", "Content": "This is one of the most amazing gadgets I have purchased. it comes in handy and is reliable. I would highly recommend this item", "Date": "May 23, 2014"}, {"Title": "Works better than I expected.", "Author": "Mr. Steven D. Demaree", "ReviewID": "RT6K07FM94T1A", "Overall": "5.0", "Content": "I was having issues at first with the software losing connections to cameras. I was able to solve that by plugging the PC into my network, instead of running it wireless. I have also set that laptop up for RDP so I can view it from anywhere. This way I can also monitor my cloud drive and see the \"Alerts\" and \"Cams\" directories growing. I love the alert feature and how it plays the video from the point the alert occurred.", "Date": "May 20, 2014"}, {"Title": "Couldn't get to work  - Horrible, horrible support experience.", "Author": "David Goodnature", "ReviewID": "R1W4CENMP2CTLB", "Overall": "1.0", "Content": "Having trouble getting this software to work with Foscam cameras (which are great, btw).Long term waits between responses to support requests (Days and days).Support folks not helpful. Don't read your email, etc.They stalled me long enough that I can't return the software anymore - it's past the return date.I'm throwing this box of software in the trash and will try to find another solution.Waste of money - don't spend a nickel with these people.", "Date": "May 19, 2014"}, {"Title": "Great camera capture SW", "Author": "Arch Hughes", "ReviewID": "R3BMT9J7W5GAJ9", "Overall": "5.0", "Content": "I use this with my Wansview NCB543W camera and it works great.  The free SW that came with the camera was unreliable.  This works great.  It starts up with my PC, it starts recording, and records 24x7.  The SW also presents a web site that I can access from outside the home instead of accessing the camera feed directly.  That allows me to see multiple camera views feeding into the SW from my WiFi network at the same time when I'm away.  Sweet.", "Date": "May 17, 2014"}, {"Title": "Great surveillance tool to catch badguys!!!", "Author": "Kirk", "ReviewID": "R33H3CPJQ4G4A5", "Overall": "5.0", "Content": "This software does have many features that I have not yet explored but let me just say that I've setup up my 5 cameras with this software and it already does what I want it to do without reading on the additional setup. By default, it will record jpeg and movie  clips with a time stamp when it detects motion and saves all clips to the \"clips\" folder to the right side of the software window. If you want 24 hour surveillance to record on motion with your computer then you will need to leave you computer ON and turn off any \"power save\" modes on your computer so it does not shut down this blue iris software. This software is PERFECT if you own a business and want to record any robberies. You can also manually record with a start/stop button and chose the folder you want it saved to. You can run this software while you do other tasks on your computer and it will still save clips. I use windows 7 and have a 4gb ram, 2.3 ghz processor, this software does not slow down my laptop at all. All clips are automatically stored and will be erased according to the age of the clip to make room for new clips, but it does leave clips stored for a long period of time or you can manually delete clips you no longer need. You do need prior knowledge on setting up security cameras but there are plenty of you tube videos that can show you those steps according to the brand. If you have interest on this, you will learn how to use it, you don't really need to be a totally smart tech savy person.This software has a \"help\" feature that offers plenty of details on setups and using this software. As far as remote viewing, I prefer to use other apps that I already have on my smart phone, but this software does allow you to use remote viewing, just need to read up on that. This software does NOT block out any other apps that you can use to remote view your cameras. I leave my computer running with this software while I am away for work and occasionally use my smart phone apps to remote view and never have any issues with being blocked out. This software is well worth the price!!!", "Date": "May 16, 2014"}, {"Title": "Awesome software", "Author": "Joshua H.", "ReviewID": "R2OZ987ZIXTZHF", "Overall": "5.0", "Content": "This software is awesome it does the job. You do need to take your time setting it up so you get the recording to work like you want it too. but once that is done it's great software.", "Date": "May 15, 2014"}, {"Title": "Nicely Done, Full of Features", "Author": "Wilfred D. Smith", "ReviewID": "R79E58ARASC5H", "Overall": "4.0", "Content": "I've been running this software for several months now, and I haven't been disappointed.  In fact, the only negative thing I can say about it is the fact that the time profiles make no sense at all. Other than that, it works great... never see any errors, and doesn't use much CPU.", "Date": "May 14, 2014"}, {"Title": "Tech support brought down rating!", "Author": "Doris Mathisen", "ReviewID": "RRJQ5GX1PJCII", "Overall": "3.0", "Content": "Program is great but support is phantom like at best. Only email with very long wait for response. Would give app a 5 rating but support is critical as this app is full of bells and whistles!", "Date": "May 14, 2014"}, {"Title": "Great Reliable Software with lots of options and possibilities", "Author": "Ann O'Nym", "ReviewID": "R1NH6E5FF9ZF2V", "Overall": "5.0", "Content": "I have been using this software for a few weeks now.Setting up the cameras (Fsocam cameras) and the alerts (text message to your phone / email address...) was easy and bug-free.Adjusting the motion detection trigger levels took a bit more time (outdoor monitoring is tricky because of plants and tree branches moving in the wind) but the beauty of this software is the impressive control it gives the user: for example, you can map sensitive or irrelevant areas in the camera field of view.The software gives the possibility to monitor your cameras remotely (the companion ios app works great) but this requires setting up a DDNS service through a third party. It would be great if Blue Iris could provide a way to monitor the dynamic IP of the computer where it runs, and send to the ios app an update in case the dynamic IP changed, thereby eliminating the need for a DDNS service.My only regret is that the manual is not available in PDF format on the CD or online - it would help a lot. The microsoft help format for the manual is cumbersome and cannot be read on another device, or offline...Thank you to the wizard who developed this software! (reading the manual really shows he/she is a real pro)I would highly recommend it if you need to make real use of the expensive surveillance cameras you just bought!", "Date": "May 14, 2014"}, {"Title": "Foscam Blue Iris Professional Surveillance Software - Up to 64 Cameras,...", "Author": "John", "ReviewID": "ROND29IQ9JBMD", "Overall": "5.0", "Content": "So far the software appears to be solid and useful.  Setup was easy and all of the cameras (6) registered without a problem.", "Date": "May 7, 2014"}, {"Title": "code did not work !!!", "Author": "truck owner", "ReviewID": "R2YUOM897YLCLF", "Overall": "1.0", "Content": "tried to use program  and keep asking for more money..... code did not worktried to get some C.S.  email only...  could not resolved problem", "Date": "May 7, 2014"}, {"Title": "Learning curve to the software...", "Author": "Cody A. Sharp \"Computer geek\"", "ReviewID": "R3TVY7JC9Z0WOK", "Overall": "4.0", "Content": "I think I like the software.  I've only had it for a day, so I'm not 100% sure what all it does yet. For example, I only have 1 camera setup now, so I'm not sure how well it works with multiple cameras yet.  (I have a second camera, just not had time to set it up, etc).  Using with Foscam FI8906W, on a wired connection, and it's working fine.  Will be adding more cameras, some wirelessly in the future.  Would be nice if there was a \"wizard\" that would help you pick the options that work best for your scenario, and then let you go in and fine-tune things once you were comfortable with them.  But, I'd rather have too much functionality than not enough.  Still trying to mess with the mobile side of things, haven't had much time there either.", "Date": "May 7, 2014"}, {"Title": "For Geeks Only!", "Author": "S K", "ReviewID": "R3MFUHFBEY93FG", "Overall": "1.0", "Content": "This software is quite complicated. It is NOT plug & play. There are many, many configuration options. The software requires extensive knowledge of settings. If you do not have this knowledge, stay away. It should be clear to a potential customer that you need to be a computer-expert to be able to operate this.", "Date": "April 29, 2014"}, {"Title": "A great software", "Author": "Guk Hyun", "ReviewID": "R19N30O5DFOPP2", "Overall": "5.0", "Content": "The item was in perfect condition and delivered promptly. It take a few minutes to camera settings. Autodetect ip camera, Uses less hard disk capacity. The software is economic because it can continue to use after purchase once. And important message: Don't buy item selled by YAZ. Because seller actually do not send a disk, send to the serial number, but even that did not send a serial number.", "Date": "April 24, 2014"}, {"Title": "It does not work - set-up is not easy", "Author": "Amazon Shoper \"Amazon Shopper\"", "ReviewID": "REXA45N4XCWSH", "Overall": "1.0", "Content": "It does not work for me - set-up is not easy . I am returning it and will get another software", "Date": "April 22, 2014"}, {"Title": "Outstanding!", "Author": "Dave in Massachusetts", "ReviewID": "RBEBACE4GKNUF", "Overall": "5.0", "Content": "Has more features than I've been able to figure out yet!  I do not like paying for software but this program is well worth it.", "Date": "April 21, 2014"}, {"Title": "Best Solution to dedicated DLink DNR/DVR", "Author": "BrokeDad", "ReviewID": "R3DEWJP3DPQYCJ", "Overall": "5.0", "Content": "I bought this since the dedicated DLink product was such a miserable failure.  Their cameras work great (but not their current storage devices) and this brought them together for recording etc using an old 3.0GHz dual core P4 hyper threading desktop.  It found and supported all my DLink IP cameras and has a TON of options.  Customer support on the product is quite good if you need help.  Make sure you get a product key sticker inside the box as I've read some did not.  I imagine these may have been returned items and somebody stole the sticker key.  DO NOT SHARE YOUR KEY.With support for multiple brands this seems the best solution for a do it yourself home camera security system at them moment if you want to record them or get alerts.  If you just want to watch then the myDLink free website and apps work just fine.  I will update this review as I explore more features.Update:  For those needing help setting up (I'm using Windows 7):Right click Start buttonClick on Open Windows ExplorerClick on Network on the left sideYour cameras will be under \"Other Devices\"They will have an IP address for each like 192.168.1.XX:80  (XX will vary)Enter that IP when adding a camera to this software (click on the + to add cameras)For the DLink 932L select the option that has 931.  The 5010L is listed properly.  You will need to manually select the camera brand and model.This will also work for other brands of cameras you may have.  Just select appropriately.I hope this helps the non-tech savvy.", "Date": "April 19, 2014"}, {"Title": "Work well with all my different ip cameras", "Author": "PRIYENDU S", "ReviewID": "RZ9ORBVMKBIM0", "Overall": "4.0", "Content": "Works well with a variety of cameras. Unfortunately does not make use of available GPU and also has some processor utilization issues when the processor is Xenon. I contacted the help desk email and i did receive a work around for this. So, the customer support is also really good. However i would have give a 5 star rating if i had a solution instead of workaround . For the money it is certainly worth!", "Date": "April 17, 2014"}, {"Title": "very difficult to figure out", "Author": "John V.", "ReviewID": "RH84X885PDN50", "Overall": "2.0", "Content": "I am only giving this to star rating because it seems very difficult to get started if I figure out how it works then I will update my rating right now I can't recommend this product", "Date": "April 16, 2014"}, {"Title": "i like it", "Author": "ABC", "ReviewID": "RZNNYT611FK9A", "Overall": "4.0", "Content": "Software works fine, I was able to setup 24-7 schedule auto recording with all my cameras.  Not more hassle with the IE issues recording manually or running some 3rd party free java recording program.  The only down side is that it needs UAC turn off to allow the software to auto start, that was a down for me because now I can't restrict my pc with UAC.", "Date": "April 16, 2014"}, {"Title": "problems for me", "Author": "S. Ohab, Jr. \"Making movies\"", "ReviewID": "R2QJQTUSYE8FUM", "Overall": "3.0", "Content": "I don't know if this is appropriate to write a view of the blue iris app here, but I consider it one product in many ways.  I like the pc version of this software, but very disappointed in the app version.  I have an android device and have struggle with connection failure a lot.  There is no comprehensive tutorial that I can find to explain what (if anything I'm doing wrong).  Also, with the app, the layout is not the greatest.  I have 8 cameras and the screen sizes are so very small, even when I go to the individual cameras.  With the pc software, it's ok.  The only thing I that bothers me is the fact that I can't rearrange the monitors the way I want to.  There are preset configurations, but the order in which the cameras are displayed I can't control.  Also, when looking at the recorded clips the order the clips are arranged are random.  It's not camera 1, then 2 then 3, etc.  The software works (expect my problems with the mobile version), but needs improvement.", "Date": "April 8, 2014"}, {"Title": "Very nearly the perfect camera software!", "Author": "Chef Bob \"Cano2\"", "ReviewID": "RRCC55RZIEP8E", "Overall": "5.0", "Content": "Saddled with junky, basic software that came with my AMAZING Trivision 336 cameras, I tried this one, and it didn't let me down! But there are some important things to consider. My cameras are a full 1080P 5.0 Megapixel powerhouses.This product can use a tremendous amount of CPU, mostly due to the 2D composition, and especially when using HD cameras. So keep that in mind, but there are a few tricks.Camera's can override the software. For example my Trivision 336's FPS overrides Blueiris settings, and causes it to default back to 17.5 FPS. Which is too much, and consumes too much CPU. The answer to this is to manually configure the camera via CameraVision software, dropping the FPS to 10 or even 7. This drops off roughly 60% of the CPU use of Blue Iris. My blue iris server is an older 2.5ghz Dual Core, with 4GB of ram. It runs 4 1080P HD cameras with 30% CPU used, and only 265MB of ram used, as long as I keep the cameras on 10FPS. I can probably run up to 4-6 1080P HD cameras on this lower end server without any issues with some tweaks. (always keep the software minimized as well) Overall, this is a 'many hundreds of dollars' software for a mere $50 or less. Which makes it a remarkable package!I have found a few 'must have' free tools to use with Blue Iris Servers. ProcessLasso keeps the CPU spikes in check, and ensures BlueIris is re-launched if it crashes. Basically if BlueIris becomes 'unruly' with CPU use, Processlasso gives it a little kick in the rear, putting it back in its place. You will still get spikes, but they will be very short lived after the process-lasso kicks in (within seconds). Second product is CleanMem, it's free, or very cheap for the pro version. This 'sweeps' the ram every 15 minutes or so keeping fragments, memory leaks, and other nonsense from impacting the server. It's a no brainer product. Install it, and forget about it.Both of these combined result in a HIGHLY stable BlueIris, even on an old Dual Core like I use - using 1080P HD cameras!  I've been able to keep uptimes in the 'weeks' using this system, and highly recommend these additional free products.", "Date": "April 6, 2014"}, {"Title": "I like it But.....", "Author": "Jack2u", "ReviewID": "R1FEKBZZMR00WZ", "Overall": "4.0", "Content": "I like this product very much so far albeit I am still learning how to use the features. I also have this app on my iPad and iphone. The problem I have is that I cannot log in from my ipad or iphone unless the Blue Iris Pro is opened on my desktop computer. I don't know if I am set up incorrectly or if this is a bug. This is the only reason I didn't show 5 stars.....", "Date": "April 4, 2014"}, {"Title": "Should have purchased this a long time ago.", "Author": "NRider", "ReviewID": "R2RNI3C9FUXER7", "Overall": "5.0", "Content": "Really makes your cameras easier to manage.A whole lot better than the software that comes with your foscam.Do yourself a favor and buy it.", "Date": "April 3, 2014"}, {"Title": "Once I learned it, I love it.", "Author": "Geocacher \"PA\"", "ReviewID": "R139UW4B7OSJ4L", "Overall": "4.0", "Content": "It is difficult learning if you've not had any experience with this kind of product and there are many functions I haven't figured how to use yet or what it is for but I have six foscam cameras and Blue Iris records and saves all that video to my external hard drive I have set up. I can call it up on my phone app or iPad app and check on my house and my cats when I'm away. I can fast forward through recorded video remotely to make sure my cats are eating and are safe.I can get emailed when there is motion. I do get a lot of false motion alerts when the sun keeps going under the clouds and back out again, it thinks it is motion. You have to keep the program and your computer running while you are gone or it won't record and you won't be able to check in on anything remotely within the software. To set up my cameras and this software I had to learn to assign permanent ports numbers to each camera and also one for the blue iris software and a DDNS service for the software.  It took some time for me to learn to use the functions I needed but once you do, you will love all it can do. There is a lot of people on the forums that can help you and also YouTube videos that can help. It sure would be nice for a series of videos to be made to show how to use all the functions of this software.", "Date": "April 2, 2014"}, {"Title": "Great Software", "Author": "M.H. \"Mello\"", "ReviewID": "R5DLKHKHLRKZ2", "Overall": "5.0", "Content": "Awesome software with an even better price.  We use this with the foscam ip cameras.  Works great.  Easy to use.", "Date": "April 2, 2014"}, {"Title": "BlueIris software is a winner of four stars, BlueIris software support is a two star rating", "Author": "William Gale", "ReviewID": "R300O8LK905G6X", "Overall": "4.0", "Content": "The software seems to work well and contrary to some of the comments on this product by other reviewers you don't need a PHD in network configuration and design. If you don't understand simple network addressing then you might need a short primer but generally speaking using this software right out of the box is no more complicated then setting up a Foscam camera on your network by following the instructions included with the camera. I have six cameras between two properties and had them all running on the software (BlueIris) in about 30 minutes after the software was loaded.I did not rate this as a 5 simply because I was having trouble with a couple of the cameras after a few days of use.  The technical support consists of sending in email and getting one line comments like make sure you have the correct address configured on the camera. This type of help I didn't need. I wrote back several detailed description of my problem and each time I got a single five to ten word response. No help. Eventually I read a little information on a few blogs and pieced the solution together for myself.The BlueIris software is very nice and offers a lot more functionality and ease of use than the web interface or the free application included with the Foscam cameras. The product is worth the money on Amazon and would recommend it to friends looking for surveillance software. However just beware that you may find yourself spending more time than you think to trouble shoot and fix any problems that may arise!", "Date": "April 1, 2014"}, {"Title": "works great", "Author": "mark laraway", "ReviewID": "RKIDCCTG9RBVO", "Overall": "4.0", "Content": "Software is fantastic, alerts and clips are stored to your harddrive. I have not been able to remote view but that's because of satellite internet connection", "Date": "April 1, 2014"}, {"Title": "Best of the best", "Author": "Ug Nichols \"iphone 3g user\"", "ReviewID": "RZ8SRQX2C0LGS", "Overall": "5.0", "Content": "Works for everything I want/NEED to get done with my cams. Would recommend  to all my friends and family for sure.", "Date": "March 31, 2014"}, {"Title": "Great product easy to use", "Author": "Sfjohnson67", "ReviewID": "R2SE90VMEAY5WL", "Overall": "5.0", "Content": "Great product easy to use; I have 5 cameras setup it was very easy to configure the software to capture video and send emails when camera's are triggered. Lots of great features.", "Date": "March 30, 2014"}, {"Title": "Poop support system", "Author": "Daniel K.", "ReviewID": "R3HHMQTC7ZA48B", "Overall": "3.0", "Content": "This was purchased with some of their cameras. At first I could not get it installed. it does not come with any written instructions. i.e where the serial number to install is, is it case sensitive, etc. i contacted the support email and got no help other than to contact someone else. I now have it working after several days of efforts with two camera. The cameras seem to work well and are well made. but have some problems mixing the H.264 and motion mpg camera. So far appears to be well done. Need a lot more testing to make a complete system. My other software program that should find this IP camera does not find it automatically or manually. This could be the other companies software problem.", "Date": "March 29, 2014"}, {"Title": "Works as advertised", "Author": "CEETechnology", "ReviewID": "R27CW9TYQ5N6SO", "Overall": "4.0", "Content": "Works well with Foscam and many, many other IP cams that I have ( I even have 8 year old Sony's and Pelco's that it works with), the interface is easy to manipulate and customize.Jason  H  owner of  CEETechnology Security", "Date": "March 27, 2014"}, {"Title": "Super Awesome!", "Author": "Chan Sisouvong", "ReviewID": "R3VE7VQNZ3LB2M", "Overall": "5.0", "Content": "I have yet to explore the intricacies of this software.  I had tested it out with three of my Foscam camera and it works great.  Definitely would recommend this if you need an excellent software that supports multiple ip cameras. It does great recordings depending on the quality of your camera also.  The setup and layout was very easy and intuitive.  Better than the Foscam app I got on my Apple iPhone.  Well worth the price for the support of multiple ip cameras.", "Date": "March 24, 2014"}, {"Title": "Foscam Blue Iris Professional", "Author": "Franco Pasquarelli", "ReviewID": "R3I7R1DSICEQRK", "Overall": "4.0", "Content": "Works well, price reasonable.Gave it 4 stars because it seems to turn off at times & I need to restart it? perhaps its my system?Would recommend", "Date": "March 21, 2014"}, {"Title": "LOVE THIS", "Author": "William H Nussman", "ReviewID": "R2UG05JP5I7EZ3", "Overall": "5.0", "Content": "I love this software.  I have it running on a three year old laptop and it has never failed.  I love the supporting IPAD and IPHONE apps.  It's so worth the money.  I'm glad I didn't buy any of the more expensive software options.  This provides all the features of the more expensive software packages at a price you cant beat!", "Date": "March 21, 2014"}, {"Title": "very difficult to set up", "Author": "Jeffrey", "ReviewID": "R2VM2C5YMNCQQT", "Overall": "3.0", "Content": "I had my camera set up and running fairly quickly, and was able to use the Foscam iPhone app to see and control the camera on cellular network. Setting up BlueIris and the corresponding iPhone app was another story. I still haven't figured out why it's not connecting. BlueIris works like a champ within my home network, but I've been unsuccessful in connecting via the phone app. I've tried firewall settings and have so far spent at least an hour figuring this out. I'd give it more stars if it was easier to set up.", "Date": "March 20, 2014"}, {"Title": "Ties together the foscam cameras in a useful way", "Author": "Rex Bibendi", "ReviewID": "R2ZM2LUEQAHFTZ", "Overall": "3.0", "Content": "Good combo with Foscam cameras.  Looses connection with cameras, and the IP addresses sometimes change for no clear reason, though.", "Date": "March 20, 2014"}, {"Title": "Good product for the price", "Author": "Mark_h", "ReviewID": "R12G01J1HT55TI", "Overall": "5.0", "Content": "Software works great.  Easy to setup and use.  Web service simplifies viewing by users on the network.  Found I needed a Quad-Core CPU to handle six cameras with lots of detected motion.  On a Duo Core machine the CPU was running at +90%.  Memory usage is very low considering what the software has to cache and write to the drives.", "Date": "March 17, 2014"}, {"Title": "FosCAM Hardware Software", "Author": "D. Gaffin", "ReviewID": "RQ785X8UTG8L2", "Overall": "2.0", "Content": "FosCAM Hardware/Software seems to work very well however FosCam seem to have a problem with documentation, either there's no documentation, older formatted documentation (chm instead of PDF) or the broken english setup instructions/ipcamera software instructions that comes with the camera. Just passing on some needed FYI.", "Date": "March 16, 2014"}, {"Title": "Could be more user friendly", "Author": "David Wade", "ReviewID": "R2LK27FC9RLXKV", "Overall": "4.0", "Content": "difficult to find and assign cameras.Screens are busy and not intuitive.Once familiar with the basics, it becomes a little easier", "Date": "March 10, 2014"}, {"Title": "Easy to use with my IP cameras", "Author": "Charles R Martin", "ReviewID": "R1JADTCFXNTQB6", "Overall": "5.0", "Content": "I bought this product to work with IP cameras , I have built my own LAN but am not a computor wiz by any means.  I found the Blue Iris software to be extremely easy to use. I had my camera recording motion triggered video in 30 mins from opening the box. It's intuitive and help menues are clear and concise. A great product!", "Date": "March 10, 2014"}, {"Title": "Blue Iris", "Author": "William F. Abraham \"Billy\"", "ReviewID": "R38IICHJXTEFI4", "Overall": "4.0", "Content": "This is not for Dummies un less you have help. what more can I say. it works. if you have a friend who now's how.", "Date": "March 7, 2014"}, {"Title": "One of, if not THE best software solutions for home surveillance", "Author": "JL Rides", "ReviewID": "R3Q7OZNL1HYOKW", "Overall": "5.0", "Content": "I've been using this for 6+ months now and I love it.  Definitely get the remote app if you're on Android... it works flawlessly and offers fantastic peace of mind.  It's great to see if a package was dropped off or see when someone stopped by.The motion tracking is superb.  I have it dialed in so that it starts recording 2 seconds prior to detecting motion (pre-buffer) and keeps going for a few seconds after motion is gone.My only complaint is that one of the updates in December ended up erasing all of my recorded footage up to that point.  This would have been bad if I needed to refer back to something.Do be sure to use a decent cpu in the computer running this as it is a bit of a hog.  My four 3MP cameras keep BI running my I5 2500K at around 45-55% utilization 24-7.  Also, don't forget to use a duty-rated hard drive (I am using WD 3TB Red NAS dive).Be prepared to spend 1-5 hours setting up the settings when you install it.  Also, it's VERY helpful to have a 2nd person and a walkie talkie handy to properly set the motion trigger settings.  There are a LOT of options... I have it sending me emails  to my phone when motion trigger is activated Mon-Fri 8am-5pm.  Coupled with my alarm, i sometimes get the email before the alarmm company calls me when a roommate or girlfriend accident sets off the household alarm.", "Date": "March 5, 2014"}, {"Title": "Works well for monitoring activity", "Author": "E. Tse", "ReviewID": "R3H2NTVQ7QE4W4", "Overall": "4.0", "Content": "This software works well for monitoring activity. I have a slower Internet connection 1 Mbps upload speed and the video records at around 640 x 480.  The software will only record at a quality your internet connection can handle.  I use the software to monitor activity and I also have my camera set to record on motion to an SD card to capture the high quality video.  So I use Blue Iris as an interface to give me alerts to suspicious activity and then I browse my camera's SD card to get a good look at license plates/faces.", "Date": "March 3, 2014"}, {"Title": "ok", "Author": "Mrs. Mama B", "ReviewID": "R1L222Y7FHFJPW", "Overall": "3.0", "Content": "not plug and play, lots of reset, find, reset find, but once installed seems to work without too many issues. Settings are fairly simple and works with/out voice and/or infra which is cool", "Date": "February 28, 2014"}, {"Title": "Easy setup and great remote monitoring with the high price of cloud based recording", "Author": "Mike B.", "ReviewID": "R22OVKW4BRHVXU", "Overall": "5.0", "Content": "After researching various cloud based recording vendors for use with our Foscam cameras, I finally decided to go \"in house\" and tried the Blue Iris system.  I absolutely love the software! Setting up multiple cameras for remote monitoring was a breeze, even with an AT&T; uVerse Residential Gateway.", "Date": "February 27, 2014"}, {"Title": "Awesome software!", "Author": "AmazonBuyer", "ReviewID": "R2X4J0QCY0XD5V", "Overall": "5.0", "Content": "Really easy to install and use...  We added the app to our mobile devices, giving us the comfort of having eyes at home, even when we are away.", "Date": "February 24, 2014"}, {"Title": "Great Camera Software", "Author": "Ronald J Blankman", "ReviewID": "R3C8CMED9LKRH", "Overall": "5.0", "Content": "Does exactly what it claims. I can monitor all my cameras on the same screen from my home or when I am away. Record any camera or any combination or all at the same time. Can just set up capture on motion for those camera I don't want continous recording. I does have a lot of options, but has excellent help screen.", "Date": "February 23, 2014"}, {"Title": "Great package", "Author": "Amazon Customer", "ReviewID": "R1L53AN95YHI9R", "Overall": "5.0", "Content": "Someday I might master this package. Maybe. But until then I'm pleasantly fascinated. I was put off initially due to the complexity,  But as I've worked with it I'm finding a weath of features I didn't expect, very powerful.It didn't hurt that a message sent on a weekend was not only answered on the weekend but the response was useful!Besides the software I have 3 of the low end cameras to experiment with, planning a couple outdoor to add coverage when the world thaws.", "Date": "February 13, 2014"}, {"Title": "Excellent Software for Security Cameras", "Author": "Greg Lawson", "ReviewID": "R1974K7J2ETFWW", "Overall": "5.0", "Content": "I am using Blue Iris software with Windows 8 Pro, Foscam IP Cameras, and the Blue Iris iPhone App with excellent results. Great value when compared to the built-in software that comes with the cameras. Greatly simplifies camera setup, management, recordings, and remote access. No complaints and I would recommend this software to anyone setting up a security camera system.", "Date": "February 8, 2014"}, {"Title": "Great Software", "Author": "Zomp", "ReviewID": "R1NWIG86NCTQT1", "Overall": "4.0", "Content": "This is the best software to monitor your IP cameras. I love the iPhone app that works with it too and the software also acts as a web server so you can view all your cameras with one URL.", "Date": "February 6, 2014"}, {"Title": "It is like the write up says it is!", "Author": "Kathy Ferguson", "ReviewID": "R34AZN8C7ZJF0V", "Overall": "5.0", "Content": "I have various cameras to my DVR and some IP Cams from various vendors but this software pulls it all together into one place and does it nicely with lots of options.  I can't say enough good stuff about it - let's just say it is the best and is very inexpensive.  You will need to know a little about your router and a little about IP address and ports but I'm sure everyone knows a geek they can talk to and get a little help if needed.", "Date": "February 5, 2014"}, {"Title": "Nice software", "Author": "Geebee", "ReviewID": "R2T4VITUT2BJ7D", "Overall": "5.0", "Content": "I use the Blue Iris for all my security cams around the house. If you know a thing or two about computers and operating systems, the program is a no problem! If your a slight computer novice, you will definitely have to read the install and instruction help section. It's no big deal, but just be prepared.PROS....easy installdistribution of cams on screen is excellent (how you can arrange them)optionsCONS....Not much really other than setting up your cams to the software. Know your cams IP address and port and your in business.I do recommend this software to my friends that have cams all over their homes.", "Date": "February 4, 2014"}, {"Title": "Best IP Cam software I've seen.", "Author": "Sport98", "ReviewID": "RZOP4JSHPGBR", "Overall": "5.0", "Content": "I have several brands of wireless IP cams and have been frustrated for a long time having to use either a web browser or the manufacturers software to see each of them. Blue Iris solved that problem very well. It's not cheap but then you get what you pay for.", "Date": "January 29, 2014"}, {"Title": "These cameras are great", "Author": "drez", "ReviewID": "R1MLN75FQZKK5D", "Overall": "5.0", "Content": "I purchased 4 cameras.  The HD outdoor cameras are fantastic.  They are clear and record beautifully.  I highly recommend this product, the HD cameras to everyone.The camera for inside is also great.  I wished it was HD, but, you can move the camera with your smart phone as well as hear or talk through it.  This is great for extra security.  I highly recommend these cameras", "Date": "January 27, 2014"}, {"Title": "It's worth the $50", "Author": "Gadget Guy", "ReviewID": "RTB3DR2284BRH", "Overall": "4.0", "Content": "I had been using iSpy, which works quite well for free software. However with my FosCam and a Wireless G network, the frame rate was never better than 5 - 8 FPS (even with VLC installed), I decided to try Blue Iris, and it works much better, as one would hope it might with their own cameras. The documentation isn't always clear, but if you are technical you'll figure it out. I also found support via email to be pretty responsive when I needed help. I get fewer false motion alerts, better frame rate (5 - 10 fps) on recordings and even more pre-programmed Pan/Tilt settings.", "Date": "January 26, 2014"}, {"Title": "Great Software Controls All My IP Cameras", "Author": "garywah", "ReviewID": "R24DGNSP365450", "Overall": "5.0", "Content": "I own several different IP cameras made by different manufacturers.  Even when the control software disks included appeared to be similar the programs were different an in most cases not compatible with different cameras.  Blue Iris Professional solved the problem, now I can control all of my surveillance cameras from one program.  I'm hoping Foscam offers an App for iPhone and Kindle/iPad soon.  I'd highly recommend this product to friends and anyone else looking for this type of software!", "Date": "January 25, 2014"}, {"Title": "Just what I was looking for!", "Author": "Philip S.", "ReviewID": "R3DFQ604TSLAO8", "Overall": "5.0", "Content": "Very pleased with Blue Iris - only complaint is the amount of CPU power it takes to have the display up, but I don't have the most powerful CPU in this computer. Love the functionality and ease of setup. Recommended!", "Date": "January 24, 2014"}, {"Title": "Fantastic product", "Author": "John D. Staley", "ReviewID": "R36B2GHLV20J33", "Overall": "5.0", "Content": "After reading many positive reviews on Blue Iris , I decided to buy it . It took some time to become acquainted with it , however , it was time well spent . Considering the price of competing software and the quality of BI , this is a perfect choice !", "Date": "January 22, 2014"}, {"Title": "Foscam Blue Iris Software", "Author": "fred", "ReviewID": "R1PSOETBVZZL5L", "Overall": "5.0", "Content": "Try the free version and could not resist buying this item.  This is perhaps yhe best software of its type on the market. You cant beat the price and the product works great. I would highly recommend this too anyone looking for GREAT surveillance Software for a good price. Ihave 8 cameras and 3 different brands, no problems.", "Date": "January 21, 2014"}, {"Title": "Software Works Great - Cameras no", "Author": "Mr. Ken", "ReviewID": "R1JLSGNWJDYYR6", "Overall": "5.0", "Content": "Love the software. Very easy to set up. Took less than 20 min to get three cameras configured. The Foscam cameras are not so great.  I suggest saving and buying better cameras.", "Date": "January 18, 2014"}, {"Title": "best security software i have found", "Author": "Donald E. Garber", "ReviewID": "R1WKENJMJXW5UX", "Overall": "5.0", "Content": "this is the best security software i have found. looked around and this works the best, has a lot of options and is adjustable. also you can try it fo free on their website.", "Date": "January 16, 2014"}, {"Title": "Excellent IP Surveillance Software (nvr)", "Author": "Chris Bunting \"Chris\"", "ReviewID": "R2WNKFZ6NKWDK3", "Overall": "5.0", "Content": "This is really good NVR software. It isn't plug and play, so you must have some knowledge about setting up an NVR and the basic settings, but for $50, this beats $5000 software packages out there easily. It does everything you can think of, really. The android and iphone apps work great on my ipad and android phone. Support is excellent, the author keeps the software updated every few days!", "Date": "January 16, 2014"}, {"Title": "Impressive Software.", "Author": "Past time", "ReviewID": "R1ACSMP8XLJW49", "Overall": "5.0", "Content": "I bought this software to use with a Dahua IPC-HDB3200C/2.8 2MP HD Security Camera. It offers great features and I've been very impressed with how well it works. I've been using it on a Windows 7 (64 bit) computer without problems. You will however need several gigabytes of free space if you're planning to record very much surveillance video. Nice job Foscam.", "Date": "January 15, 2014"}, {"Title": "Amazingly capable software at a very reasonable price", "Author": "D. Gardner", "ReviewID": "R3B28P2XY2QW6", "Overall": "4.0", "Content": "I am using this software to monitor two 1080p video cameras (Swann branded HKVision OEM units purchased as a two-pack from C***co.Only about 25% of the i5 CPU capacity of an intel Haswell NUC is required to monitor these two cameras. I set up the software to record a clip when motion is detected in the defined regions, and to email me a couple of summary photos for each motion event. Works great. The one technical question I had was answered quickly and correctly by customer support. The software has a internal web server for in-network or external camera and clip viewing by browser, and also has a nice android app, and an iphone app which I did not try. Highly recommended.", "Date": "January 14, 2014"}, {"Title": "Software Review", "Author": "Abram Brown", "ReviewID": "RYHWUXD7VIWVW", "Overall": "5.0", "Content": "Excellent product. Did much more than I had expected.Better more complete software than Securview software! I would recommend to others!", "Date": "January 14, 2014"}, {"Title": "no help", "Author": "\"Kat\"", "ReviewID": "R373E609IA04H8", "Overall": "2.0", "Content": "hook up was not as easy as it says..and when I called for help...got some lady that barely spoke english and the back round noise was so loud I could barely hear her...horrible...still not working...very frustrated.", "Date": "January 14, 2014"}, {"Title": "Breathed New Life Into Old Cameras", "Author": "LoveThatRonWhite \"avidreader\"", "ReviewID": "R1FAGYCN7UJIV4", "Overall": "5.0", "Content": "We'd about given up on getting the old bullet cams to straighten up and fly right, but this software has them ticking right along.  For once, it's not brain surgery.  We've read about this product for a while now, and finally took the plunge.  It's everything they say it is.  Home security for everyone!", "Date": "January 13, 2014"}, {"Title": "Software works as described", "Author": "Ivan R Nausley", "ReviewID": "R6D424BIGMQQL", "Overall": "5.0", "Content": "Much better to monitor and record events than using the web interface for camera itself.  Easy to install and setup, was up and running in 10 minutes.  Only have two camera connected at this time, and works great.  Not sure yet what will happen when I add 10 more.  Time will tell.", "Date": "January 10, 2014"}, {"Title": "foscam", "Author": "james wilson", "ReviewID": "R1GHV2D9RPR889", "Overall": "4.0", "Content": "this is a great product to control cameras with.  I find it difficult to use, I am lucky that my son knows a lot about computers and programming, he got my system set up.", "Date": "January 9, 2014"}, {"Title": "Joe from Miami", "Author": "Joe Navarro", "ReviewID": "R1XITIBO3SNNYV", "Overall": "5.0", "Content": "This was so easy to set up and use.  There are options I still haven't used.  I'm recording 4 cameras at the same time. 3 are IP cameras and 1 is from a TV tuner.  Highly recommend it...  Especially for the price!", "Date": "January 7, 2014"}, {"Title": "Blue Iris software Great!", "Author": "Jim Morgando", "ReviewID": "RXZKX4ZTOLHJB", "Overall": "5.0", "Content": "I purchase this software and a FosCam from Amazon and it works great. No issues at all.I would recommend this product.", "Date": "January 1, 2014"}, {"Title": "Awesome program, no need to pay ADT monthly fee for security, great customer service", "Author": "David S.", "ReviewID": "R2MOAR56NPQ6S1", "Overall": "5.0", "Content": "Hello all,Firstly, I want to point out that this is a \"real\" review, not something posted by an employee at Foscam.  While I was personally not able to set-up all of the cameras with this software, an employee named \"Judy Rose\" was able to take my computer over (via Teamviewer) and get everything rocking.  Judy Rose also helped me download an app on my phone that allows me to check on all of the cameras via 3G.  I am very pleased with the purchase.  Don't hesitate to call their customer service!", "Date": "December 23, 2013"}, {"Title": "Took me a while to fgiure out", "Author": "Gamer7 \"seekyr\"", "ReviewID": "RCVG6N2TCR2JR", "Overall": "3.0", "Content": "The alarms settings are very sensitive so even though nothing is there I am still getting alarms for movement....Also instructions were pure heck to figure out.", "Date": "December 19, 2013"}, {"Title": "Great Product", "Author": "Jessi", "ReviewID": "R1K3VM81XZ4FN4", "Overall": "5.0", "Content": "Works perfectly. Easy to set up and use. Does everything I expected and more. Would recommend to family and friends.", "Date": "December 18, 2013"}, {"Title": "Video Surveillance", "Author": "greatyou", "ReviewID": "R2F2VZOQ5EXU24", "Overall": "2.0", "Content": "This software and the hardware is not easy to setup and the documentation is not thorough enough for an average person to use.  It doesn't provide enough installation and troubleshooting procedures when the device is not working as expected.  I was able to get it working, but some of the features/functionalities of it I was not.  Recommend the vendor supply youtube videos on how to configure and use this device along with the software and hardware.", "Date": "December 15, 2013"}, {"Title": "I see you....", "Author": "charles vamos jr", "ReviewID": "R28HL31YGP2TC2", "Overall": "4.0", "Content": "Having never used this type of software it took me a little bit to learn what was going on. Got the camera loaded in and messed with some settings,  and I was in business.They also have blue iris for Android to see your cameras.  That took me a little more messing with songs to get working than the original setup.", "Date": "November 28, 2013"}, {"Title": "Great product", "Author": "Drew", "ReviewID": "R5U1IAYN2O4JZ", "Overall": "5.0", "Content": "Really full featured product.  I have 5 cameras and was able to get it up and running within an hour - there are just so many options that you have to work through the help guide.  I would recomend this with the Foscam cameras.  The nice thing is once you identify the type of camera you have (and they have a lot identified) the different features such as pan/tilt worked great.  You can also set the program up for the web so that you can log into your network remotely and view your cameras.  The IPhone version was a purchase but again works great - cost met $5.00 but worth it.", "Date": "November 25, 2013"}, {"Title": "Foscam Software-Love it", "Author": "SHANNON SNOW", "ReviewID": "R2UC788PWHRD7E", "Overall": "5.0", "Content": "The software does a great job and is simple to install and configure.No Problems so far motion detection and all the value of a very expensive DVR system.", "Date": "November 24, 2013"}, {"Title": "Good DVR software", "Author": "Brian Gray", "ReviewID": "R35ETIZP131GKF", "Overall": "4.0", "Content": "Intuitive, feature rich, reliable, inexpensive.Doesn't always follow settings exactly, like dictating frame rate for cameras, but basically, pretty solid.", "Date": "November 23, 2013"}, {"Title": "great surveillance software for the price", "Author": "W. Lin", "ReviewID": "R2FX95ZFEAMFET", "Overall": "5.0", "Content": "i have been trying to figure it out how to use this software for the past two days. it's a very powerful software that's capable of doing lots of things. once you get used to it, actually it's fairly easy to use. I linked it with my two foscam camera and it worked great. great product for the price", "Date": "November 13, 2013"}, {"Title": "Worth it!", "Author": "Joseph Fox II", "ReviewID": "R1KXXKVNG8BPNL", "Overall": "4.0", "Content": "Was originally just using the software that cam with my FOSCAMs, but quickly came to realize that software didn't hold the mass amounts of features I wanted to utilize.  This software fit the bill perfectly.  Although it wasn't extremely difficult to setup, I did find some of the options a little confusing as to what they were really doing.  I also had to play around with the record on motion features until I could get them where I like.  Otherwise so far it is a great product, and appears to get updated frequently which I appreciate.", "Date": "November 13, 2013"}, {"Title": "Ok for now", "Author": "Wilo", "ReviewID": "R1ZHYE40572845", "Overall": "3.0", "Content": "It's doing what I wanted but it's a bit difficult, also still have to buy the serial for full version although I taught, once you purchase a cd it would of been in the package.", "Date": "November 11, 2013"}, {"Title": "Outstanding, highly capable, incredibly stable, feature righ software all for only $50.", "Author": "Schundg \"Schundg\"", "ReviewID": "R1XYF7DY2CMJHQ", "Overall": "5.0", "Content": "This software is simply the best.  It is unbelievable that this software costs only $50.  The capabilities included in this package is beyond you reasonable expectations.  Have an idea about what you would like to see in the software, no problem, write the developer and it could be included in a future software release.  The software is extremely feature rich and is updated by the developer often.  The support for this product is provided by Ken the developer and I have experienced none better.  Simply Fantastic!", "Date": "November 5, 2013"}, {"Title": "DVD", "Author": "John S Frost", "ReviewID": "R11F9ZV1RYX9WJ", "Overall": "3.0", "Content": "I haven't used the software DVD split while removing from package.  I believe the DVD material was weak causing it to split. My friend who uses the same material speaks highly of the content. Once I receive a replacement DVD I will write another review", "Date": "October 23, 2013"}, {"Title": "Works great!", "Author": "David P.", "ReviewID": "R2WSXW3HM1JJ82", "Overall": "4.0", "Content": "I have nothing to compare it to but it works very good.  Was a bit complicted to initially setup and I have not set it up to get remote access yet but I like the way it works and I seem to get updates often which I think is a good thing as they are always doing improvements.", "Date": "October 20, 2013"}, {"Title": "The software isn't really needed for the cameras.", "Author": "W. Byrd", "ReviewID": "RYPSY0P5WE8ZO", "Overall": "3.0", "Content": "I have the software, but it really isn't needed.  The Foscam cameras allow you to save recordings to a FTP server or an SD card.  If you have some tech know how, you can bypass the software.  I'm running it on a WHS v1 box and it is a little buggy sometimes.", "Date": "September 24, 2013"}, {"Title": "great software", "Author": "Nael", "ReviewID": "R26O8B2G65V0SI", "Overall": "5.0", "Content": "it is doing what it is supposed to do. it updates regularly for free. it saves files of recordings and follows the schedule I set.", "Date": "September 21, 2013"}, {"Title": "BlueIris", "Author": "Amazon Customer", "ReviewID": "R3HAO70D5SAB0W", "Overall": "5.0", "Content": "Excellent program.  Does everything I wanted and more.  Actually E-mails JPG and MP4 video to my assigned email address.  Got to tell you, Ken with BlueIris company, responds rather quickly with solutions to tech questions too.  Love the remote viewing of streaming video from home while on the road traveling; excellent date/time security for numerous cameras.  Enough for now.", "Date": "September 16, 2013"}, {"Title": "Great software", "Author": "Jason Mayer", "ReviewID": "RSIT13CWSOUHS", "Overall": "5.0", "Content": "This product is great.  I use it to record 24 hrs a day, 1080p video, at 30 frames/sec, currently only one camera.  It handles this easily.  However, it does use up a good amount of CPU power.  I originally had this running on my 2k8 server, but it was so resource-intensive, that users weren't able to even log in.  I have this running on its own small micro ITX server, and its working great.  With a little port forwarding, I am able to view my cameras, and the motion triggers, from anywhere.  Also, Its great that it will split the video into a new file when motion is detected.  This saves a lot of time (however, I've had one occurrence when motion didn't set off a trigger).Summary:Pros:Works great, never crashedhandles 1080p video finehas a built in web-servermotion triggers split the video into a new fileCons:A bit resource-intensivemotion almost always is picked up, but not always.", "Date": "September 15, 2013"}, {"Title": "Excellent!!!!", "Author": "Scott", "ReviewID": "R2RT6TXOQUKP06", "Overall": "5.0", "Content": "Excellent Software. Updated regularly and works flawlessly. I have seen software that does not work as it is supposed to but this one is great.", "Date": "August 29, 2013"}, {"Title": "Great value", "Author": "Shawn Drillen", "ReviewID": "R1K0PH5U539WI9", "Overall": "4.0", "Content": "For the money it's a very comprehensive program.  Lots of cameras to choose from.  Able to auto update software no charge.", "Date": "August 29, 2013"}, {"Title": "great for device management", "Author": "Amazon Customer", "ReviewID": "R24ZV1CBVZPVJ8", "Overall": "4.0", "Content": "very configurable and fairly easy to use...if you have a dedicated machine to manage your surviellance this product is a good buy for the money.  it seems to get fairly good support from the developers and supports a wide variety of cameras", "Date": "August 27, 2013"}, {"Title": "Great program", "Author": "Ronald J. Palencia \"Ron Palencia\"", "ReviewID": "R3UEWYNA2W2DE0", "Overall": "4.0", "Content": "I ended up purchasing this from the manufacture's web site because I needed it fast and they offered a download option.Cons: This software is a bit awkward to use for the initial setup and the help system is not as good as it should be.  For example, after clicking the tiny \"+\" button in the main screen you are presented with a multi tabbed screen with options such as General, Video, audio, PTZ, etc.  To add the camera you must select the video tab, then select a radio button called IP then click a configure button to select your camera from the list of manufactures.  After that you can select the various other tabs to set up the camera.  They should really have a wizard to do this.Pros: once added, all my camera's worked perfectly without any extra configuration.  The web service makes remote monitoring easy.The best feature is that it can run as a service in the background.  This means that even after a power failure as long as your PC or server can power back up (Most BIOS's allow for this) you monitoring will continue.Bottom line: I recommend this purchase", "Date": "July 30, 2013"}, {"Title": "Feedback correction", "Author": "Al Cantarini", "ReviewID": "R2DVJYJTIDI46M", "Overall": "4.0", "Content": "i left negative feedback for this company. But after emaiing the seller I stand corrected!I will now see if this software works well as I have found the software key.", "Date": "July 1, 2013"}, {"Title": "Works Well for Me", "Author": "Randy L. Williams", "ReviewID": "R2A1Q2SVVFTXHR", "Overall": "5.0", "Content": "I have a 4 camera home system and it works well.  It does take some computing power to run smoothly especially with the higher resolutions and frame rates that are in use with my setup.  The video processing is processor intensive as others have mentioned.  It ran well on a high end Intel Quad but not well on a medium dual Intel.  Memory usage did not seem to be much of an issue with 4GB or more but the processor pegged on the dual.  A bit of a learning curve on the software but response from email support was fast.  Note - install with virus software disabled!", "Date": "June 28, 2013"}, {"Title": "Great software", "Author": "A. Hastings", "ReviewID": "R2ZAZIZGHO58KQ", "Overall": "5.0", "Content": "I have been using ip cameras for almost 2 years and have tried the software that came with the cameras and some of the freeware software only to find them lacking in features and not always compatible with different brands of cameras. Blue Iris, however works with all my cameras seamlessly. I am able to view and push alerts to my iPhone, iPad, and use my Kindle Fire as a remote viewing device. I would recommend though using this on a dedicated PC. It seems to run much smoother when I do that, plus if you open a port to the public you are only exposing that particular machine. I am very happy with this software and the apps both on the Apple and Amazon app store for mobile devices.I recently ordered a PTZ camera and will update my review with how that works soon.", "Date": "June 26, 2013"}, {"Title": "blue iris", "Author": "Ralphy007 \"Rafael D Ortiz\"", "ReviewID": "RRG2WW0EUCGY0", "Overall": "3.0", "Content": "works great and has great picture quality now I can surveillance my home from any where and that's a plus", "Date": "June 16, 2013"}, {"Title": "Big Learning Curve", "Author": "Cynthia B. Goodwin", "ReviewID": "RXPX8RLTAOM8E", "Overall": "5.0", "Content": "I have been learning this program over a period of the last four weeks.  It is exactly as advertised.  Although it may be a bit difficult to identify what ports and settings to use, the information is out there.  Cam-it, the unofficial Blue Iris web site has been a big help.  What I like about this program is that you can use different cameras with the software.  The program is updated regularly; the developer seems to take an active interest in making sure all of his users are given the information necessary to be successful.  With the new direct to disc recording feature, the CPU is under less stress.  The cost of this software for the non-professional user is very good compared to other software that charge by the camera and is geared towards the professional user with one brand of camera.", "Date": "June 13, 2013"}, {"Title": "Awesome CAM", "Author": "Garron Cotham", "ReviewID": "RJ322UBDG3QV9", "Overall": "5.0", "Content": "For the money, ease of configuration, installation and features, this little CAM  has to be one of the best on the market.  We've just completed installing one at one of our remote offices and it continues to impress especially with the BlueIris software.", "Date": "June 6, 2013"}, {"Title": "Exceeds All Expectations", "Author": "Rodney", "ReviewID": "R29DS8TDJIPYUX", "Overall": "5.0", "Content": "The Foscam camera's have exceeded all of my expectations. Great product for the price and when combined with the Blue Iris software makes a great home security system.", "Date": "May 30, 2013"}, {"Title": "works great and easy to use", "Author": "keith pumilia", "ReviewID": "RKLH3YVLU3LLJ", "Overall": "4.0", "Content": "it works well . I just have to leave computer on for it to work . But no problem. Very easy to use.", "Date": "May 25, 2013"}, {"Title": "Easy To Use", "Author": "G. Madden", "ReviewID": "R14Y7L2SRO2429", "Overall": "5.0", "Content": "This is a very handy little tool to keep an eye on things at remote location. I use it at my second home to check on at random times throughout the week. Don't be afraid of it, very easy to set-up and use.", "Date": "May 23, 2013"}, {"Title": "Excellent software.  lots of functionality.", "Author": "SkincareCEO", "ReviewID": "R3A6L565D0XVYU", "Overall": "5.0", "Content": "Excellent software.  All the instructions are in the help button so go there first.  It took a little bit to become proficient with the software because it has so much functionality.  I'm running a FOSCAM 8910W.  btw, I have the software running on Windows Home Server 2011 since it will run on Server 2003 which is the backbone of WHS 2011. Highly recommend this software.", "Date": "May 18, 2013"}, {"Title": "Foscam Blue Iris software", "Author": "Glen L. Snyder", "ReviewID": "R319P71WTRTUSP", "Overall": "5.0", "Content": "Have used this software before and it is great especially for motion detection recording. Like the way it buffers so you can get frames recorded just prior to the motion being detected.", "Date": "May 14, 2013"}, {"Title": "this software rocks!", "Author": "Colby Hernandez", "ReviewID": "R2LPTJXIDW0VBU", "Overall": "5.0", "Content": "I really love this software!  I have purchased 3 licenses from them already.  The controls and ease of use is fantastic.I havent played with many different companies camera software, but from what I have seen with Blue Iris, I would find it hard to believe that any other software can compare to this software for the price.  For controlling POE PTZ Cameras it is a breeze.  A little learning curve on how to set up the PTZ, AUDIO or IR On Off, but after you understand what is what...its a breeze to add onto.Blue Iris has a massive number of compatible camera companies as well.  There must be over 150 supported cameras.all in all i love this software, and it does everything i could imagine i would ever need it to.", "Date": "May 9, 2013"}, {"Title": "Does everything I need", "Author": "K. Kandell \"kandeka\"", "ReviewID": "R2DW0VNGFR2AQO", "Overall": "4.0", "Content": "The ability to adjust motion sensitivity and size works good for me having cats.  The archiving of videos works good too, which I sent directly to dropbox so they are safe from a thief stealing my computer.  I have 4 cams, 3 of which at one house and one at another. I have all four in Blue Iris which is nice.I really can't complain about the software except that I would like to be able to install it on more that one computer to view the same cameras. One computer at home to record motion and one at work just to view. But the license is only for one install.", "Date": "May 3, 2013"}, {"Title": "Amazing liitle eye.", "Author": "christopher waters", "ReviewID": "RCJI9CY3YEZA", "Overall": "5.0", "Content": "Of all the 1000.00 dollars I have spent for security in my home and business I never knew this reasonably priced IP CAM does the job of all 4 with a dvr.  This is a money safer for those looking to watch while away. I will be ordering a few more of these for sure", "Date": "April 30, 2013"}, {"Title": "IpCam Software", "Author": "4rest", "ReviewID": "RWMJCXNIDP2DU", "Overall": "5.0", "Content": "This software if easy to configure and use. It has a background footprint that doesn't drag your machine down. Good for small to medium applications. I use it on about 6 cameras. Reasonable price.", "Date": "April 29, 2013"}, {"Title": "Does everything", "Author": "J. Loveman \"renaissance man\"", "ReviewID": "RL7DZOWG22CYQ", "Overall": "5.0", "Content": "I got the \"non-foscam\" version from the blueiris website and it is amazing. I have set up multiple cameras with motion detection to capture alert videos and snapshots and it works great.I was even able to hook up an external script to notify my home automation software when the camera detected motion. And there's so many parameters to accept reject motion that it allows you to tune out \"false positives\" and get great detection. I also use the built in web access to observe the cameras remotely.Using my google drive, I was also able to make sure that stills and video were sent to the cloud so that even if the the computer were removed, I would have access to the data.All of this comes at a cost however -- which is complexity! It's pretty tricky and time consuming to get it all set up and tuned up -- depending on how much of the functionality you want to turn on.", "Date": "April 29, 2013"}, {"Title": "Program, large and capable", "Author": "Belyndae Johanningsmeier \"Online Marvel\"", "ReviewID": "R1UQB912JMZY4W", "Overall": "4.0", "Content": "It is larger than what I thought from the picture. It is more than capable of monitoring the inside movement from specific rooms within my home, with it able to do 64 cameras. Well worth the investment", "Date": "April 27, 2013"}, {"Title": "Excellent tool for camera management", "Author": "S. Luinski \"Ravage\"", "ReviewID": "R3QUUR5CEESD2M", "Overall": "5.0", "Content": "The learning curve on this software can be a bit steep but I love all the customizing it allows. Others have had great success using many wireless cameras but I find they are a significant drag on my network. Blue Iris adds to the network load since it is fetching information from the cameras constantly. Running Netflix to my Kindle and a couple users viewing cameras remotely while running Blue Iris will cause things to stop working. This is a limitation of my router (AT&T; 2WIRE). The alerts to my phone and email are such a comfort and work very well. The motion sensor triggered recording works great with high customization potential. I love this software but you should keep in mind the abilities of your personal network for running many cameras through it. I've been running the program non-stop for a week now and it runs without a hitch in recording. That can't be said for some other experiences I've had. I am limited by how I use my cameras and network so I probably can't run more than 4, but am very satisfied with my purchase.", "Date": "April 21, 2013"}, {"Title": "Excellent program DVR", "Author": "carlos salazar", "ReviewID": "R2U5E5EMWKCQPF", "Overall": "4.0", "Content": "A well designed program.Easy and complete handling of the cameras.With many features to manage the cameras.Recommend purchase.", "Date": "April 18, 2013"}, {"Title": "Great Software", "Author": "Thomas E. Mendenhall", "ReviewID": "R3ERDV35UFRU19", "Overall": "5.0", "Content": "Works great. Macros allow you to overlay text of real time weather data. External software can trigger alert. Movie trimming and H.264 video export work great. Posting movies and images  to dropbox or google drive  is handy if you decide not to use included web server.. Have not tried mobile android or iOS apps.", "Date": "April 4, 2013"}, {"Title": "perfect budget home DVR solution", "Author": "quietconundrum", "ReviewID": "R3KE938MRSEPJS", "Overall": "5.0", "Content": "I have a multiple Foscam camera setup and have used Blue Iris on a spare PC to act as my DVR and notification manager. It records to a 1TB NAS on the network and handles all the alerts, scheduling, sensitivity/contrast programming and event monitoring. This was the best additional purchase I could have made to compliment my Foscam cameras. If you want more sophisticated control over your Foscam cameras and features that far exceed what the camera has to offer via its included firmware, stop hesitating: buy Blue Iris.", "Date": "April 2, 2013"}, {"Title": "Awsome", "Author": "R A D", "ReviewID": "R3I40WB7RA5CLO", "Overall": "5.0", "Content": "These cams are excatly what I was needing takes some effort to set up but if u ever set up a wirless router its the same thing. I gwt snapshots and 10 clips to my phone and email while im at work throughout the day when set them to motion senser. Even inside when my dog moves around. Telling me friends", "Date": "March 24, 2013"}, {"Title": "blue iris 3", "Author": "Mike", "ReviewID": "R2L9BWL05DQQTE", "Overall": "4.0", "Content": "it is very good software, it is very flexable to adapt to ones needs. it updates as it goes and commucates in many ways to keep you inform on your status, very expandable it meets my needs.", "Date": "March 19, 2013"}, {"Title": "Some things work others don't", "Author": "BB Indiana", "ReviewID": "R2KKGSKLN3OZJZ", "Overall": "3.0", "Content": "First, this software is complicated and I'm an Electronics Tech.  You need networking experience plus specific camera smarts.I have a mixture of 8 IP cams and one USB cam and got them all to somewhat work on Blue Iris (people in the forum call it BI).  What I like is my older Foscam FI8910's seem to work with all the features I want. I chose NOT to use the webserver and just use it to monitor the cams at home for security, because the Foscams have a built in webserver that I can access and control the cameras from my Smart Phone (Android) or most any other web browser anywhere you have Internet access. So... I don't use the webserver part of BI.The problem I'm having is my new Foscam Fi9821w's 'almost' work but not 100%.  I can't get the preset's to work which is also reported in BI forum.  The presets are important because if you move or pan the camera any masking you have setup will need to be changed unless you have a functing preset button to get you back.  I can activate zones and have it snap pictures or make movies when someone goes into a selected zone in the picture which is pretty nice.  The pan features work in BI and the Image on the computer looks better than the camera's web interface (in both IE10 and Firefox 19)  and allows for software zooming before the pixels visually fall apart, a nice feature.So this software is like my new Foscam camera and is nice but just isn't finished. Hmmm, perhaps they are both.... naw, they couldn't be related.Most of you should just stick with the web Interface that came with the IP camera unless you really want to tackle this riddle.  Perhaps a new update just for the Fi9821w from Blue Iris and also I need one for the 9821w camera from Foscam...", "Date": "March 17, 2013"}, {"Title": "Sometimes it works, sometimes it doesn't.", "Author": "PghDrake \"PghDrake\"", "ReviewID": "R3K1VRVHVCFNUG", "Overall": "3.0", "Content": "This software seems to be fickle. Not sure that it's a flaw in the programming or what, but I've tried over and over to get it working, I've looked through countless form posts, tried several different techniques for configurations, and although generally I can get it to work, it seems to only work for a while before I have to start over. I'm using this with the same model camera pictured on the front of the box, I've tried it with Windows 7 and Windows 8 both.-D", "Date": "March 4, 2013"}, {"Title": "IP Software that works", "Author": "PJDSR", "ReviewID": "R3G4OI2EYHAAWE", "Overall": "4.0", "Content": "It took a couple calls to tech support to get some of my cams figured out, but after they logged into my computer remotely and set one of them up...it was a piece of cake. Very nice software, though you do have to be somewhat 'techy' to get features operating like remote viewing from the internet or a cell phone...tech support will be needed to get you through that!", "Date": "February 27, 2013"}, {"Title": "Nice features", "Author": "Dan Buckley", "ReviewID": "R33B1IIUFUGU39", "Overall": "5.0", "Content": "I bought the software to go along with a couple of Foscam cameras we bought to monitor our home. The software works very well and it's easy to add additional cameras to it when it's time to expand. I only use Foscam cameras so I can't comment on it working with other brands, but I don't doubt that it could.", "Date": "February 19, 2013"}, {"Title": "Great Camera", "Author": "shkrbkr03", "ReviewID": "R6P1UQ49KPXFY", "Overall": "5.0", "Content": "Picked up 2 of these cameras when they were on sale. 1 for the nursery and 1 for the basement. This allowed us to have a baby monitor and keep an eye on the dog while we are away from home. The CD that came with the camera makes set-up a breeze. Recently orderd 2 more. The functionality these cameras have at the price is hard to beat. Highly recommend.", "Date": "February 15, 2013"}, {"Title": "great people and very helpful", "Author": "bridport7", "ReviewID": "R9NTVIDGZVBX9", "Overall": "5.0", "Content": "These people installed cmers and Blue Iris and did a great job. They do it fast and it always seems to work tim morris really did a fantasic job!!!!", "Date": "February 15, 2013"}, {"Title": "Main Screen additionals", "Author": "Surveilzon", "ReviewID": "R2NRHCEMH9WGNZ", "Overall": "3.0", "Content": "Foscam Blue Iris Professional: It would be even better if the IR on/off, audio-in (listen) on/off, audio-out (talk) on/off, gain (video and audio), focus, brightness and contrast controls were easy control buttoned on the main view screen similar to the zoom and directional controls, instead of being a hassle, mouse clicking and searching on a drop down list. There's a lot of room for more buttons on the bottom portion of screen next to the directional, zoom and preset. Quickness (less movements) in utilizing controls is a major factor enjoyable and convenient with surveillance. The zoom button should have the magnification \"x\" number shown so the viewer and recorded screen would know said magnification being viewed. Also buttons for record speeds, play, pause, reverse, slow/frame advance/reverse, fast advance/reverse, a window for playback with all mentioned controls while still showing other windows in real time would make it 5 star plus.", "Date": "February 14, 2013"}, {"Title": "Works Fine & many usefull features", "Author": "R. Ordowich", "ReviewID": "R28RR0HDEPAAPK", "Overall": "4.0", "Content": "The software installation was easy. Configuring the camera took a bit of time to discover where the network connection parameters were. Once those were configured, the connection was made. Setting up the web server took some time to get port forwarding configured but that is not a problem with Blue Iris but with the way routers and firewalls are too convoluted.Recording works fine and the options to delete older recordings to save space is great. Remote access via a PC or IPhone works great, good quality video.The software has been stable so far. Doesn't crash or use up too many resources.", "Date": "February 12, 2013"}, {"Title": "It works great", "Author": "J. Pabst", "ReviewID": "R2BLEA7CO8NNTZ", "Overall": "4.0", "Content": "From what I've used of this it has always done well for me. However, I mostly use the Foscam app on my iPad, so I probably would forego buying this if you plan on using an app. However, this software does allow you to record for extended periods of time - whereas the app does not.", "Date": "February 10, 2013"}, {"Title": "For home, this is FANTASTIC!", "Author": "Bubs", "ReviewID": "R38WHHEA26Y4EC", "Overall": "5.0", "Content": "As a facilities manager with a mix of SD and HD cameras at work, I knew the costs involved in trying to create a home based security camera network. At first, I was a bit leery of going with Foscam, but after reading reviews I decided to take the chance. I am so glad that I did.  This software is really about the best you can get at the price, no more need to be said on that.  Yes, it can be quirky and needs tweaking from the user end but it delivers.  I am so pleased with my Foscam setup and it didn't \"break the bank\" which was my goal. I was able to set up my initial installation, download the app on my phone/iPad, and take a relaxing vacation while checking camera operations when I wanted: while literally a thousand miles from home.  Talk about peace of mind!!!! Now I am saving pennies to purchase some of Foscams HD cameras to add to my personal security network.", "Date": "February 7, 2013"}, {"Title": "Blue Iris", "Author": "Darrill B. Litherland", "ReviewID": "R2VUL699ZL2HHA", "Overall": "5.0", "Content": "We purchased this to go along with our Foscam cameras and it is doing a marvelous job. It allows you more flexibility than the software that comes with the cameras such as recording and scheduling.", "Date": "January 25, 2013"}, {"Title": "software", "Author": "E. Lyda", "ReviewID": "R19R4PK7OG7S97", "Overall": "5.0", "Content": "This software is very versatile and easy to use. It offers things usually not available, such as the ability to make a phone call with an alert rather than just the typical text or email, which it also does.", "Date": "November 25, 2012"}, {"Title": "REVIEW IS FOR VENDOR NOT PRODUCT.", "Author": "FRED CONTRERAS", "ReviewID": "R2DU1Y7WW3C82H", "Overall": "1.0", "Content": "WERE DOES MY VENDOR SAY IT NOT RETAIL BOX?,YET THEY SHOW BOX AND TALK ABOUT DELIVERY DATES.I GAVE THEM MY SIDE OFF STORY ALL THEY COULD OFFER WAS TO CHARGE ME EXTRA FOR CD TO MAIL.I REQUESTED REFUND AND IF NOT FOR AMAZON INTERVENTION I WOULD BE OUT OFF MY MONEY.SORRY ,CAN NOT RECOMMEND TOOK BEST 2 MONTH TO SOLVE ISSUE.READ BELOW ,DOES IT SAY DOWNLOAD ONLY?Want it Tuesday, April 22? Order within 28 hrs 13 mins and choose Two-Day Shipping at checkout. Details  Video Capturing including recording with H.264 Compression. Use up to 64 cameras (webcams, camcorders, network IP cameras, analog cards, or your PC desktop)  Capture JPEG snapshots or capture movies in standard AVI, advanced DVR, or leading-edge Windows Media file formats.  Video Security with IP Cameras, keep an eye on your home, place of business, cars, and valuables; watch your pets or your kids; monitor your nanny, babysitter, or employees.  Use motion detection, audio detection, or even capture continuously. Allows for E-mail and SMS text messaging alerts as well.  Receive alerts via loudspeaker, e-mail, instant messaging, or phone.UPDATE:MY REVIEW IS STRICTLY FOR THE VENDOR I BOUGHT FROM.AMAZON ASKED ME TO REVIEW MY EXPERIENCE AND I DID,DON'T KNOW HOW IT GOT BUNCHED UP IN THE PRODUCT REVIEW.I DO \"NOT\" HAVE PROBLEM WITH THIS SOFTWARE,THE REASON I THOUGHT IT OUT WAS IT CAME HIGHLY RECOMMENDED BY TWO ENGINEER FRIENDS OFF MINE.THIS PRODUCT IS AMONG THE BEST IN ITS CLASS.WITH THAT SAID...I WANTED TO TELL MY FELLOW AMAZON ABOUT MAKING SURE WHAT THEY ADVERTISE IN OUR BELOVED PRIME IS CORRECT.I HAVE READ OTHER MENTION RETURNING THE PRODUCT BECAUSE NOT HAPPY.NETWORKING AND \"IP\" ADDRESSING CAMERAS IS NOT AS EASY AS SOME MIGHT THINK,AT MINIMUM YOU MUST HAVE SOME MID-LEVEL KNOWLEDGE OFFNETWORKING PROTOCOL.BUT THAT WAS NOT MY CASE,I ONLY RECEIVED AN EMAIL WITH A LICENSE NUMBER (I NEVER USED OR ACTIVATED\"LIKE I WAS A TRIAL VERSION USER.IF I WOULD HAVE RECEIVED PRODUCT AS ADVERTISED,I WOULD HAVE NEVER COMPLAINED AT THIS LEVEL:REGARDLESS HOW DIFFICULT SETUP MIGHT BE FOR ME,THEY NEVER TRIED TO HELP ME.THE COMMENT ON DIFFICULTY IS \"STRICTLY ABOUT MY PERSON\" AND NOT OTHERS,BECAUSE I DEAL WITH SOFTWARE AND COMPUTERS AND HAVE VAST KNOWLEDGE ON HOW TO FIGURE THEM OUT.JUST WANTED CLEAR THE AIR.", "Date": "April 19, 2014"}, {"Title": "Non-compatible software", "Author": "Jillian Walker", "ReviewID": "R8CUFBYW49YE6", "Overall": "1.0", "Content": "It just did not work and no one was able to  provide a good solution. It did not worth the effort.  in I am returning the product for refund.", "Date": "April 13, 2014"}, {"Title": "No communication..Zero.", "Author": "ColoradoWildFlower", "ReviewID": "R3T1V2O6F89SLP", "Overall": "1.0", "Content": "I bought this software to monitor my house area outside.  After paying $50 I put in the disk and setup the program.  When I setup the camera to the software I was happy that I could see part of my house.  But what baffled me was that there was a gigantic banner across the whole screen area so you couldn't see much.  This after already paying $50??  I saw that to register you have to give them the numbers etc.  So I put hte numbers in that were given to me and the next button would not light.  The only way to go forward was to either choose the \"one camera\" edition or \"multiple cameras\" edition.  Either one you have to pay another $50 or so.  So I wrote to Foscam per email and thru AMazon to try and get help.  No communication.  Not even thru the original email going directly to the company.  And that was a few days earlier during the work week.  Finally I rec'd an email thru Amazon that was just a man asking what number I had.  So I sent him what he asked for and then again, no communication!  No email at least saying sorry for your problem, or I'll write you back today or whatever.  So bad communication and so the Zero for everything!", "Date": "March 8, 2014"}, {"Title": "Not worth the money", "Author": "anishap", "ReviewID": "R1K3XPU2R3COP3", "Overall": "2.0", "Content": "I was using foscam software and I thought of purchasing this based on some of the reviews. But I made a mistake, it doesn't worth the money.  I guess the advantage is if you have different branded cameras operating at the same time. Foscam software is easy to setup and use.", "Date": "October 24, 2013"}, {"Title": "Great for Cheap IP Cameras", "Author": "J. Williamson \"JBW\"", "ReviewID": "R3TJ0HIE2Y7ZJE", "Overall": "4.0", "Content": "To control cheap IP cameras like Foscam and Wansview this software is great. Even if you have no programming background Google searches can get you the info needed. I have a programming background and had the software up and running in under an hour. I highly recommend you change the default web server port from 80 as any one scanning blocks of IP's could potentially be watching your cameras if not super secure. This $49 software makes cheap cameras better and well worth the expense of an old computer. I run mine on an old throw away dual core machine with 4 gigs ram and push 6 IP cameras with no problems.", "Date": "July 17, 2013"}, {"Title": "This product works great", "Author": "d.c. \"dave of ca\"", "ReviewID": "R353MIB1SVR67X", "Overall": "5.0", "Content": "I've got a few ip cams and had been using free apps like yawcam (which is pretty superb, but couldn't stick with because it's only good for 1 cam) and iSpy (kept cutting off for some reason), so when I ran into limitations with these 2 I checked out Blue Iris, it's great.", "Date": "April 22, 2013"}, {"Title": "Excellent", "Author": "Ney Camargo da Cruz Filho", "ReviewID": "R1ZC0XGK43TZRT", "Overall": "5.0", "Content": "I bought 4 cameras and I didn't want to buy a VCR to store do moves recorded. So I started to looking for a way to do it without buying a new equipment. When I saw the Blue Iris, I thought that it was perfect for me. Now I can manage all the cameras, store the movies, send alerts and more. I would recommend this software.", "Date": "March 22, 2013"}, {"Title": "Blue Iris Take 2", "Author": "Louis G. Baron \"iblouie\"", "ReviewID": "RUF6660KGFFWT", "Overall": "4.0", "Content": "Amazon is doing Great...Ordering is easy, Tracking is a snap, Products are delivered on or Before the delivery date,all that is GREAT!!As for Blue IRIS, I expected that when I paid $49.95 to purchase the product, that I would get the full product.The packaging appears to be the retail box and inside it contains the software and PRODUCT KEYS. Theproblem is that when I load the software and enter the Product Key, I am taken to a screen that wants me toenter my Credit Card Information and apparently BUY IT AGAIN!!!!  What is up with this????I sent a email to the contact folks a Blue Iris but as of this writing have'nt heard back...it has only been a coupleof days so far. This looks like a 15 day Demo item, complete with NAG lines through the screen!!!!!The above is my initial review...after a few hours of trial and error, the ANSWER to the question of \"Did I buy the real thing?\" is yes.Evidently in their dash for the cash, Blue Iris decided that:1. The Product ID you enter MUST be in ALL Caps.2. You MUST put in the dashes between the five sets of characters.3. Either 1 and 2 are correct or else Blue Iris takes a Day to make sure they have  their dough before granting access.All in all, this was not too bad...of course I did have a Backup Piece of software or two that wasworking, but for \"normal\" folk, I am sure they would appreciate just a couple of lines that tell youEXACTLY what is required to activate the software.So far the software is working fine and I am relatively content. Thanks.PS  I still have not gotten a reply to the email sent to the Blue Iris \"support\" folks.", "Date": "February 16, 2013"}, {"Title": "Extends the functionality of my cameras", "Author": "P. Coon", "ReviewID": "RDD5WNDRG6M18", "Overall": "4.0", "Content": "This was a good addition to my Foscam cameras.  Although the cameras come with their own software, this has more flexible scheduling, allows you to choose from 4 different video recording formats, and enabled me to set up a web page on my computer that I can access from work.  Since I'm not video tech savvy, some of the functionality is over my head, but the Help is pretty good.The only reason I didn't give it a 5 was because it's a bit of a resource hog.", "Date": "December 30, 2012"}, {"Title": "Dont waste your $$$$", "Author": "Steve_M", "ReviewID": "R1KFELQGOVNDB0", "Overall": "1.0", "Content": "Purchased this with a foscam camera based on it being recommended by Amazon. It is pretty much useless, The Foscam camera is great, Their app does everything blue iris does but blue iris based on what i read makes it easier and can do more...bull!It was not easy to work with. After following their procedures it worked but when i opened blue iris the next day it only showed a test paatern. The biggest pain is if you want to use it remotely you have to pay $9.99 for the app. The foscam app is Free and works well. You can also get the tiny cam app for FREE and that will let you up load to dropbox. I see blue iris as a useless program and if i ccould i would return this P.O.S!", "Date": "October 2, 2013"}, {"Title": "Blue Iris Professional", "Author": "Dave", "ReviewID": "R2GBUXPDA3MLEN", "Overall": "1.0", "Content": "There no booklet to help you with setting the software up.  I couldn't find but ONE youtube, it wasn't helpful enough.  You really should have a instruction manual, with the software.", "Date": "July 1, 2013"}, {"Title": "Software doesn't work as expected.", "Author": "Kathleen A Johnson", "ReviewID": "R3C5ZDJXMQQ7DX", "Overall": "1.0", "Content": "Difficulty getting the software to work appropriately with our network.  This was a gift and it is very disappointing that it still doesn't work correctly.", "Date": "January 26, 2014"}, {"Title": "No Idea If It Works", "Author": "D. Dahlbeck \"Tappah\"", "ReviewID": "R1OK7W1FBKK4UR", "Overall": "1.0", "Content": "I have no idea how well this works because when i arrived the sticker was stuck to the bottom of the disc, making it impossible to use.I knew something was wrong from the second I picked up the package and could hear the disc loose in there.Seems like some really poorly designed shipping/storage and I will not be giving them a second chance.", "Date": "January 2, 2014"}, {"Title": "One fatal flaw for me...no multi-camera streaming audio", "Author": "mseanmcgee", "ReviewID": "R3RZSHKCDXHRPN", "Overall": "2.0", "Content": "Blue Iris has lots of good features, however, it has one fatal for me... no streaming audio for multiple cameras.  The whole reason I purchased several Foscam cameras and the Blue Iris software is for use as a monitoring tool for multiple kids rooms. I intended to run the iPad client in our room at night so we could see and hear multiple kids rooms. However, Blue Iris only supports audio streaming when you are watching a single camera. As soon as you stream 2+ cameras, audio streaming/monitoring is not supported.  So, I can \"see and hear\" one kid or I can \"see\" multiple kids but I can't \"see and hear\" multiple kids.", "Date": "May 14, 2013"}, {"Title": "camera", "Author": "Debbie Smith", "ReviewID": "R2K9VJPC2F76W8", "Overall": "2.0", "Content": "I did not like it, could not figure it out  so I sent it back what more can I say I don't like it", "Date": "March 17, 2014"}, {"Title": "$50 trial version", "Author": "Jayman", "ReviewID": "RBIP2FL8RX84V", "Overall": "2.0", "Content": "Description mentions nothing of this being a trial version. Very disappointed to say the least. 15 days to try then spend another $50 for a license. No thanks plenty of other third party software out there to try for free.Using security monitor pro and pretty happy with it.", "Date": "January 21, 2014"}, {"Title": "Hard to set up", "Author": "W. Woods \"ww woods\"", "ReviewID": "R27C24DIDYM7KK", "Overall": "2.0", "Content": "Others warned how hard this is to set up as far as remote access.  The tech was great, but it took them at least an half hour of taking over my computer and getting it working.  after a few weeks of working fine it just stopped working remotely.  What a pain!!!!", "Date": "January 11, 2014"}, {"Title": "Does what I want and their customer support is great", "Author": "Gene Waldvogle", "ReviewID": "RNLF7C1O7DCWJ", "Overall": "5.0", "Content": "This is the software that should come with the Foscam cameras, and is probably suitable for other cameras as well.  The interface is well thought out with tons of features that provide control over when and how each camera is recorded.  I have only had it for a month but they have already added a couple of great features - like being able to set different \"hot zone\" masks for each of the PTZ presets on a per-camera basis which allow me to mask out tree movement at each of the settings.  Even if you don't have Foscam cameras, there are lots of other manufacturers supported and it seems very likely that you will be able to find settings for yours.  Don't hesitate to contact their support with a pre-purchase question or 2 - my experience has been that they reply within a day and have always been able to answer my concerns.  If all software was supported like they do it, there would be far fewer bald men in the world.", "Date": "August 31, 2013"}, {"Title": "Sill haven't gotten the wireless to work consistently", "Author": "Me2Be \"Picky Purchaser\"", "ReviewID": "RTQ8MKBXTRM30", "Overall": "3.0", "Content": "I bought the software, 3 outdoor FOSCAM cameras, and one indoor camera with 2-way audio and video.  We were able to set up the cameras while connected to the network using cables.  We then, after considerable time (roughly 3 hours of trial and error), were able to get two of the cameras to show up wirelessly.  We then tried to move the cameras where they would be positioned full time and lost all of our wireless connections and were unable to get them to connect wirelessly again.  Everything is sitting in boxes now until we have several hours to spend trying to troubleshoot and figure how to make them work again.  It's not easy.  :-)", "Date": "August 19, 2013"}, {"Title": "Great Software", "Author": "Sandy H", "ReviewID": "R49RI5T8H2JOW", "Overall": "5.0", "Content": "I just set up several cameras at my house to watch our pets as well as surveil the front door because of some recent incidents in our neighborhood.  I found this software worked right out of the box and there was some setup required.  For a beginner with no network experience, this might take a while.  However, once you learn to set up your cameras and have their network information, this software works great.  In fact, it has so many options that I am still learning how to use them all.  But for basics - detect motion and record, snap a picture, send an alert, etc - this software works great.  For an expert in this field, they may find something missing but for a home user needing this type of software, I think you will have a hard time finding something this powerful for the price.  Yes, I tried some free stuff but they always wanted money to do something more.  So, for this product, I am very happy.", "Date": "August 17, 2013"}, {"Title": "Took many hours to configure", "Author": "Ken Dreger", "ReviewID": "R2A02F7A5VGK4H", "Overall": "3.0", "Content": "This product took many hours of trying different configs to get it to work the way I expected it to.", "Date": "August 8, 2013"}, {"Title": "Great Surveillance Software. Wish it had a few more features", "Author": "JVelvet", "ReviewID": "R1A1DPLYK6FXN2", "Overall": "4.0", "Content": "For the money, this software is fantastic. It supports up to 64 cameras, and is very easy to set up. I have mine running on an old Dell laptop that I just use exclusively as my security camera DVR. It is great.I wish that it had a few additional features though:1) Remote Administration (via web page)2) Support for 2-way audio.3) Ability to download video clips remotely.Other than that, I haven't found anything else that I really need it to do. I am very happy with this software.", "Date": "July 30, 2013"}, {"Title": "Buy It Now!", "Author": "dmbTank", "ReviewID": "R28OAF4K5HIFHO", "Overall": "5.0", "Content": "I have been an IP based camera user since the early days, and have used IP based Camera software since 2003.  I tried the high end software costing tens of thousands, the leaders in the market but could never afford it.Blue Iris fills the gap between non-affordable with a BlueIris feature rich affordable solution at a price you simply do not want to miss out on.BlueIris supports a majority of IP based cameras and have selectable drop down options, My 9 year old camera was listed as a standard config setting - awesome. More importantly, I upgraded to newer technology, and had the pleasure of setting up the camera in BlueIris with no issues for multi stream with ePTZ.BlueIris supports Motion Detection, alerts, email notices, alarms, digital out, Network Drive with playback, timelime and a host of other higher end features.Recommended as a home based IP Camera Monitoring Solution.Go get your demo today and be convinced... TrueToad.com", "Date": "July 25, 2013"}, {"Title": "did not need it with foscam camera, but came in package", "Author": "Wyobabyface", "ReviewID": "R82DQZIPSVEYZ", "Overall": "3.0", "Content": "didn't need this to make camera work, actually tried to use it at first with foscam camera and couldn't get it to work, took it to staples and they tried it also, then tried it without...didn't need it!!!", "Date": "July 20, 2013"}, {"Title": "Marv's cam", "Author": "Aliene Watson \"A\"", "ReviewID": "R1DK23ORP1LSI9", "Overall": "4.0", "Content": "After receiving the product I have to tell you I was a salesman until I retired and never working with my hands the task before me was tough.I followed the instuctions and with the help of a very friendly tech.I have the system up and running.It works great am I am very pleased.  Marvin WatsonFoscam Blue Iris Professional - Supports Many IP Camera Brands Including Foscam and Agasio, Zone Motion Detection, H.264 Compression Recording, E-mail And SMS Text Messaging Alerts!", "Date": "May 2, 2013"}, {"Title": "good value", "Author": "Wade", "ReviewID": "RXIC0NLH6B1FL", "Overall": "4.0", "Content": "The camera works very well, and with the blue iris software makes a very nice inexpensive monitoring system.  I like getting a text pic of UPS dropping off my packages.", "Date": "March 4, 2013"}, {"Title": "excellent", "Author": "Brenda", "ReviewID": "R3TPTETXSOSQOV", "Overall": "5.0", "Content": "The Blue Iris software is everything I expected and more. I have no complaints. It made it very easy to set up all the cameras and view them remotely.", "Date": "March 1, 2013"}, {"Title": "this is great", "Author": "tomcat3", "ReviewID": "R18YX2ZZ7SO5MY", "Overall": "5.0", "Content": "Blue iris was easy to load. not overly difficult to operate, i should have bought this with the first camera instead of the last 2. tech support is great if you need it, did not need on software, but did on a camera, and they are the best! Foscam is producing great quality products. Amazon is doing a great job with fulfilling their orders. you cannot go wrong with this team.", "Date": "January 21, 2013"}, {"Title": "Supports Foscam cameras", "Author": "Ozark Crafter", "ReviewID": "R1A9F6SPVH9W34", "Overall": "4.0", "Content": "I did not give it 5 stars simply because it is not as simple to use as I expected.  It seems a bit too daunting with so many setting options for a novice who just bought their first IP camera.  It does work as far as I know from only using the software a short time.", "Date": "January 6, 2013"}, {"Title": "NO customer Sevice  Blue Iris", "Author": "G. M. Williams", "ReviewID": "RYM9828M4FZRN", "Overall": "1.0", "Content": "Bought this to set up 3 different types of cameras in one place. The help page says contact Ken if you have a problem with IP cameras. I set up two of my cameras OK. But there was no drivers for the IP cameras inside the software. So I sent off an email to Ken at Blue Iris. He blew me off. He said he was only one guy and that I should contact The geek squad at Best Buy. Unless you are a geek then don't try this at home.  Its a shame that the software seems to work , if you know how to set it up. There is also no Apps for Android or I Phone which was promised in the adds on Amazon. Of course I cant send it back as software is not refundable. Buyer beware!!!", "Date": "February 14, 2013"}, {"Title": "active number dont work", "Author": "chun kang", "ReviewID": "R3B8581JPAKIPC", "Overall": "1.0", "Content": "activation code inside the cd but that activation code dont work so i called fascam they say there responsible .....i talk to both company so i pay another 49.95and work okay but not much differance free softwarei think there is not much free software market thats why this company and fascam charge this muchnot worth", "Date": "July 8, 2013"}, {"Title": "Fantastic!", "Author": "T. Meadows \"TM\"", "ReviewID": "R30ODU8W1L5LBX", "Overall": "5.0", "Content": "Fantastic feature rich software, love it!  I have had it running all week with my 5 ip cameras with no issues.  Super easy to set up and works great!", "Date": "December 7, 2012"}, {"Title": "Do not recommend.", "Author": "TekGuy", "ReviewID": "RJFW6GYUSM0QI", "Overall": "2.0", "Content": "In over 20 years working IT, I admit I don't take the time to review much software, but this really annoyed me.I wanted to catch which of my cats is peeing on the rug.Have a decent IP cam and wanted to setup something to catch them.Maybe it's because this is a Demo, but I certainly am not impressed.I tried using motion triggers and it seems promising, but when it counted, the software did not come through. 2 wet rugs, no video. A few video and single stills, but not even close to consistent.Even tried just having it record...good luck with playback.Getting the Free product Zoneminder. My bet is it does the job much better.", "Date": "February 28, 2013"}, {"Title": "Absolutely worthless", "Author": "Animal Doctor", "ReviewID": "R7LA6XLRANI75", "Overall": "1.0", "Content": "Rule #1 in buying software: Don't ever buy from a developer who doesn't list a phone number for support; there's always a reason they do this. Company only has an email address, and have emailed them twice in 5 days without a single response. Set this up using a PC with 2GB memory, Netgear 7000 router, range extenders, signal boosters.  and 21 cameras, 9 of them Foscam. Cameras kept loosing connection to the software daily, finally had Foscam's excellent customer service remotely view my settings on cameras, router, and software. They verified everything was set up correctly and could not provide a reason for the continual loss of connection. I am currently looking at the Blue Iris screen over my LAN which shows 3 cameras working, and the other 9 read \"No Signal\", \"check IP address\", \"I/O error\", \"socket error\", and so on. Simply put, this software is garbage, there is no support available, and it doesn't work. It did, however, convince me to go to a wired system. DO NOT WASTE YOUR MONEY ON THIS.", "Date": "February 14, 2014"}, {"Title": "Very difficult to use", "Author": "Janel Campbell", "ReviewID": "R17VA3XDAB4VCY", "Overall": "1.0", "Content": "I found this camera very difficult to install and I'm not ignorant to technology and computers, etc. I have a degree in computers and still couldn't get this camera to work properly. I did NOT like the fact that you have to do port forwarding, and set up a DNS account ,etc. Thumbs down on this product. I have other IP cameras that are simple to install and use. No thank you..", "Date": "February 12, 2014"}, {"Title": "No support for the updated version", "Author": "Peter", "ReviewID": "R1KAAEXI69RJRT", "Overall": "1.0", "Content": "I installed and in the process it initiated an update.  After the updated install the software stopped working.  I called support department; they said why did you upgrade? (really)  As per instructions they told me to uninstall. which I did, as I re-install the software it goes through steps of installation and reaches the end.... then does an automatic uninstall. (nice)", "Date": "February 5, 2014"}, {"Title": "USELESS and not reliable", "Author": "Scorpion", "ReviewID": "R2K97IIRPUSTCE", "Overall": "1.0", "Content": "CCTV systems are used for critical purposes and sometimes play a major role in crime investigations, so failure is not an option here.I got this one hoping to get the mentioned \"quality\" but was surprised that most of the time, it halts, doesn't record, and you just go away depending on it and once you come back, I just know that you are screwed up!!Totally not a reliable software, be away.", "Date": "January 4, 2014"}, {"Title": "STAY AWAY!!", "Author": "njlax32", "ReviewID": "R1P1DYQPF2GKG4", "Overall": "1.0", "Content": "Purchased this online expecting an email with my registration code or at least an order confirmation but nothing for 4 days and counting. My credit card was charged immediately. There is no phone number and I have sent three emails to their tech-support but nothing. Doing some research to get a phone number I find out that there domain name blueirissoftware.com is registered as private?? Why would a legitimate business do that? Now I have to contact my bank and dispute the charge. HORRIBLE, HORRIBLE customer service!!!", "Date": "February 12, 2014"}, {"Title": "NOT LICENSED AS ADVERTISED", "Author": "Al Arruda", "ReviewID": "R2UA2XBRNIYPK3", "Overall": "1.0", "Content": "DIDN'T GET LICENSE FOR THE $49.95 PRICE. SOFTWARE DEMANDED ADDITIONAL $49.95 FOR A LICENSE WHEN \"TRIAL\" EXPIRED. ASKED FOR CUSTOMER SUPPORT BUT RECEIVED NO SATISFACTION.", "Date": "January 10, 2014"}, {"Title": "No license key after 3 days", "Author": "Juan Osorno", "ReviewID": "RJ7J7GU9HFA1L", "Overall": "1.0", "Content": "I am giving it only one star simply because Amazon and Foscam have failed to provide a license key. I have called Amazon and Foscam and they are giving me the run around. Finally Amazon said they were going to refund the cost and I am to return the software.It has been a total waste of time buying this. How can they ship a DVD case with no license key?Otherwise, software seems to be ok.", "Date": "October 28, 2013"}, {"Title": "Missing digit from key code, software is useless without it.", "Author": "John B", "ReviewID": "R1VRIGDW1RN1GP", "Overall": "5.0", "Content": "Blue Iris software is the best.I have the trial software and bought this for the key code .BUT, The code which was obviously hastily printed is missing the first letter or number , I am not sure as they started the print off of the label.No plastic wrapping.Totally useless without the key code which is what I paid for.", "Date": "December 10, 2012"}, {"Title": "PC Only", "Author": "Lie2me", "ReviewID": "R117S1PDA0X4ES", "Overall": "1.0", "Content": "Blue Iris is PC only.No Apple Mac Version here.EvoCam4 by Evological is Mac based and tested to support the following Foscam cameras:FI8905W, FI8908W, FI8910W, FI8918W, FI8919WFI9820WFI9802W, FI9821WFI9821W V2They say EvoCam may support a zoom feature. However, they have yet to test it on the Fi9826.", "Date": "May 16, 2014"}, {"Title": "It doesn't work well with Windows 8", "Author": "Davion", "ReviewID": "R35A0JLW4P94Z3", "Overall": "2.0", "Content": "This is crap and I should have sent it back after I realize that I didn't buy the actual ip camera. I didn't pay close attention that it was just the software. Here's my problem. The software doesn't support Windows 8.1 and I can seem to find an update for it. It works fine on Windows 7 but there is an update feature that I haven't installed because when I did the last time, it froze the application. What a waste of $50 bucks. Not worth it. The cameras work great. Once you get it working, it does a fairly decent job.", "Date": "April 14, 2014"}, {"Title": "Not user friendly...", "Author": "Designer Amy", "ReviewID": "R7SIKJ319DTB8", "Overall": "3.0", "Content": "It's just not as user friendly as it should be nor does it work as smoothly as I would expect.", "Date": "February 15, 2014"}, {"Title": "NO REMOTE ACCESS", "Author": "Daniel Gardner", "ReviewID": "R1ROS6ZD5FK4UF", "Overall": "2.0", "Content": "No remote access through this program to your cameras unless this program and your computer are left running, which leaves your computer open to hackers and all sorts of other stuff.", "Date": "January 12, 2014"}, {"Title": "Expend weeks to set it up, gut to and expert on puzzless, after 45 days I din't finish undertand all software intent", "Author": "Carlos", "ReviewID": "R2IO919HJLK9M1", "Overall": "2.0", "Content": "I have the impression that if is bought direct from FOSCAN will be treatment will be better, no helpnothing intuitive for setup your wireless camera in to your WI-Fi, have to be connected thru you original camera softwarewas ready to returned, but my curiosity stop me, have some good thing's but not happy with Blue Iris", "Date": "March 3, 2013"}, {"Title": "Standard PC DVR software", "Author": "A. Lovegren", "ReviewID": "R1QHFT3F0K6O7X", "Overall": "3.0", "Content": "I assumed that this software would have the same features to control a FOSCAM FI9821W as the software that came with that IP camera. I was wrong. I like that I can view & record feeds from different cameras and the software is easy to use. I store feeds off site and can setup individually,Other than looking at multiple feeds at once, this software does not offer much for my use.", "Date": "February 7, 2013"}, {"Title": "Love It!", "Author": "Bob Daniels \"Bob\"", "ReviewID": "R2XA9RMB7U4I2X", "Overall": "5.0", "Content": "I absolutely love this cam! for any purpose!I use mine as a caregiver watching and listening to my elderly mother.", "Date": "January 31, 2013"}, {"Title": "Foscam wireless camera", "Author": "D. Howard", "ReviewID": "RWGLU2JRWDA6A", "Overall": "4.0", "Content": "Nice camera with a pretty good picture. It was easy to set up and get connected to my wireless network. This makes it convenient to place anywhere in my home with power nearby. The camera works good with my Android phone and I'm able to check in during the day. Night vision works decent when the lights are off and I can make out enough detail to check on the house when we're out after dark. The camera is good without any added software. It is pretty simply to get it working with my email accounts so I can get email alerts after motion is detected.One downside is after the camera re-boots it goes into a patrol mode and usually pans up and stays locked onto my ceiling. After I adjust the camera aiming it stays put.", "Date": "January 17, 2013"}, {"Title": "Excellent Product and Support", "Author": "foyetog", "ReviewID": "RK9F1DLW5RCF3", "Overall": "4.0", "Content": "*UPDATE* - I am quite impressed wight he product.  Takes a bit of patience and experimenting to get it running smooth but a powerful application.  Have 7 cameras running on it with tons of features.  Updated regularly and few bugs.I bought the software several days ago to work with my new cameras. In order for the software to monitor the cameras, it requires an update. All well and good but their website has been now down for 5 days, the support is unresponsive and basically says they are in vacation. I am about to return it.", "Date": "June 29, 2013"}, {"Title": "It is ok.", "Author": "rodrigo", "ReviewID": "RD0WDJJLLWENF", "Overall": "3.0", "Content": "I think it is not record the tenvis camera. I need more instruction for use the software. thank you. bye.", "Date": "October 29, 2013"}, {"Title": "No remate access", "Author": "C. Lambert", "ReviewID": "R3TS4MNHZQN4SR", "Overall": "3.0", "Content": "I purchased this product and the android app so I could remote view with my phone. It works fine on WiFi, but I have spent two days with no luck following the online instructions for IP forwarding. The email alert will have to work for now. I would give this 5 stars if they had live support.", "Date": "September 11, 2013"}, {"Title": "Not Straight Forward", "Author": "Aaron A. Allen \"AAA\"", "ReviewID": "R2HTBI4LZBSB5J", "Overall": "3.0", "Content": "It would be nice to have installed the software and given it my router info and had it do an auto setup.  This is not the case.", "Date": "January 13, 2013"}, {"Title": "Way way way too complex!", "Author": "E. Solch", "ReviewID": "R2VL20KBBYXSJI", "Overall": "1.0", "Content": "Couldn't get it to work for me. Bad thing is on the trial it took up all my time fiddling with the interface trying to configure my camera's. Now I find I have to buy a license...won't be doing that. Waste of money and time!", "Date": "March 9, 2013"}, {"Title": "Not support for installation", "Author": "Manuel Chavez", "ReviewID": "R1C5B9R833GXKZ", "Overall": "1.0", "Content": "I try to install it I called service support, they did not know much about the program, not helpful at all.When you call for help, you have to wait for them to call you back so you are tied for hours waiting.", "Date": "May 3, 2013"}, {"Title": "Very Basic", "Author": "Brown Trees", "ReviewID": "RTA762JM0N204", "Overall": "2.0", "Content": "Not quite what I was expecting...very limited and then they teased with the \"Professional\" upgrade. Not worth the money spent.", "Date": "January 29, 2013"}, {"Title": "the software requires administrator permission", "Author": "Just-Artifacts \"a-customer\"", "ReviewID": "RC02IZILAXF66", "Overall": "1.0", "Content": "It is ridiculous that only computer administrator can uses the system. We usually do not use administrator account unless it is really necessary.", "Date": "May 24, 2013"}, {"Title": "WARNING!  NOT MAC COMPATIBLE", "Author": "Chris Fisher", "ReviewID": "RW6WEL1ZPHJBJ", "Overall": "1.0", "Content": "Despite reading many reviews I missed the fact that this reportedly excellent product is not MAC compatible. This was not clearly part of the product listing nor did I see it in a review.", "Date": "August 13, 2013"}, {"Title": "Not used", "Author": "Steven L.", "ReviewID": "RG8ED9DVJQH53", "Overall": "1.0", "Content": "Haven't used it....havent been able to get camera to work wireless. No use for it yet.So I have no real experience with it.", "Date": "January 24, 2014"}, {"Title": "Windows 8 driver update", "Author": "Darryl", "ReviewID": "R2ZD6CFGIETKOS", "Overall": "1.0", "Content": "If there were an update to use Blue Iris with Windows 8 I'm sure I would be able to use the software.", "Date": "February 23, 2013"}], "ProductInfo": {"Price": "$49.99", "Features": "Video Capturing including recording with H.264 Compression. Use up to 64 cameras (webcams, camcorders, network IP cameras, analog cards, or your PC desktop)\nCapture JPEG snapshots or capture movies in standard AVI, advanced DVR, or leading-edge Windows Media file formats.\nVideo Security with IP Cameras, keep an eye on your home, place of business, cars, and valuables; watch your pets or your kids; monitor your nanny, babysitter, or employees.\nUse motion detection, audio detection, or even capture continuously. Allows for E-mail and SMS text messaging alerts as well.\nReceive alerts via loudspeaker, e-mail, instant messaging, or phone, licensing the software sold separately", "Name": "Foscam Blue Iris Professional Surveillance Software - Up to 64 Cameras, SMS/Text Message Alerts, H.264 Encoding, Supports most major IP Camera brands and CCTV Systems", "ImgURL": "http://ecx.images-amazon.com/images/I/51%2BXkxv-77L._SY300_.jpg", "ProductID": "B008YD80KC"}}