{"Reviews": [], "ProductInfo": {"Price": "$4,050.00", "Features": "Professional 16 Channel Full D1 H.264DVR. Support iPhone, Andriod, & Blackberry. HDMI & VGA. Real Time Video/Audio Recording, Playback and Network capability. Built In Motion Detection Recording Function with Sensitivity Adjustment.  PTZ Control.\nSupport iPhone, Andriod, Blackberry, Windows Mobile, and Symbian OS. D1, HDMI & VGA support PTZ Protocol: PELCO-P, PELCO-D Built-in motion detection recording function with sensitivity adjustment Manual/schedule/Motion Detection Recording Modes Time & date search easy access Live monitoring through internet from anywhere IP or DDNS, LAN or IE browsing Easy navigation No Audio output for HDMI\nG-706WD: Professional 1/3\" Exview HAD CCD II with Effio-E DSP Devices Camera. 700 TV lines, 2.8~12mm varifocal lens, 42pcs IR LED, 131 ft IR Distance. WDR(Wide Dynamic Range). OSD Menu. Great Image.\nSony Effio-E Camera With Varifocal Lens Features: 2011 New arrival IR CCTV Camera 1/3\" SONY EXview HAD CCD II Enhanced Features and Fine Image Processor OSD/2D-DNR/BLC/Privacy Masking Zoom & focus outside adjusting Suitble for wall installing Auto Gain Control Electronic Shutter Adjustment Great for outdoor security\nCamera Power Box Camera Power Box for Security Cameras. New Technology! PTC fuse protection for Circuit Short, High Voltage, and Over Current. Consolidate all cameras power (12V, 9 port, 10A) to one central location. Heavy duty metal case. LED indicator for each power output. Don't have to replace burned fuses Positive Temperature Coefficient (PTC), Auto Reset Fuse Wall Mount", "Name": "Complete Professional 16 Channel Full D1 HDMI Network DVR (2T Hard Drive) CCTV Surveillance Video Camera System Package with (8) x 700TVL 1/3\" Exview HAD CCD II with Effio-e DSP Devices 2.8~12mm Varifocal Lens, 42pcs IR LED, 131ft IR Distance Outdoor Security Camera (1500ft RG59 Cable)", "ImgURL": "http://ecx.images-amazon.com/images/I/41dUK8ojSeL._SY300_.jpg", "ProductID": "B0081J2CL2"}}