{"Reviews": [{"Title": "Does what I need to do.", "Author": "Meister Coolfresh", "ReviewID": "RDJQ86HQKC41L", "Overall": "4.0", "Content": "I have bought another one of these because it works well for my purposes. But before you go with this product read below:PROS:1. QQDVR Camera server (HYQQDvr_EN7.1.6.3.exe on CD)(runs on PC that has cameras connected) has nice motion detection recording or full time recording settings and scheduling. Nice video file organization (very obvious when a video clip was recorded and by what camera). Couple that with a FTP server and you'll have nice instant access to recorded video clips externally over the internet.2. Camera client (Client_Setup6.3.exe on CD)(runs on all other PCs and speaks to server to get real time camera picture) easy to use and setup. Allows you to see whats going on at home real time, when you are away. Just open up ports 9881 and 9880 on your home firewall and point the client to your home IP address.CONS:1. Product and software is made by some small chinese company (http://www.szecover.com/En/Download.asp) and if you go to their website for software updates or additional info, good luck ... you are going to need it.2. Server software user interface a little amaturish. Takes time to figure out how the window works.3. Video clips are recorded in a proprietary codec (QDMF/QDM/QQDVR) that no one has heard of and will only play back on PC that has server (HYQQDvr_EN7.1.6.3.exe) installed. On other PCs, that have only client (Client_Setup6.3.exe) ... video clips will not play back ... Even if you install a really good codec pack or have VLC player. So here is what you do ... after you install the server software on the server PC, copy (C:\\QQDVR\\plugins) onto a flash drive and then take that flash drive and plug it into the other PC and run the \"regqdm.bat\" off the flash drive. That will install the codec you need. And then the clips will only play in Windows Media Player. This one took me days to figure out because there is no info in the internet about this codec at all.4. I seriously doubt (but am not 100% sure), there exists a smartphone app to interface with the QQDVR server. So you may be limited to a PC when wanting to view the real time camera video.5. Other better aftermarket camera software will not work with this hardware unit, since this unit is not considered a CCTV DVR video card. so if it matters to you and you want to use other CCTV software, you will want to buy a \"cctv dvr pci card\" ... google it. But for me, $40 for this unit ... I'm pretty happy with it.", "Date": "July 26, 2013"}, {"Title": "Great low-budget replacement for expensive DVR's", "Author": "Nacman \"Raylie\"", "ReviewID": "RZEEYQ0BW5EQN", "Overall": "5.0", "Content": "This product even includes audio inputs, Works great with Analog security cameras with BNC connectors. Easy setup with my W7 64 bit computer. Gives individual settings (brightness, contrast, etc.) for each camera. Well worth the cost.", "Date": "April 15, 2013"}, {"Title": "Complete and utter disappointment", "Author": "Vance", "ReviewID": "RET3BNMHFKFGK", "Overall": "1.0", "Content": "I have tried to install this on 3 different laptops (Dell, HP and ACer) ranging with Windows XP to 7....all USB 2.0 ports and a desktop Vista OS..no luck. The CD that supposedly has the drivers and programs on it - I just can't explain it. When you open the disc and you view the main folder, it shows the user manual, FAQs, etc...plus some other programs. The one I'm concerned with is the all important program that makes it do what it is supposed to do. However, when I try to run those app files, it says file/path unknown! Yet when you look at the folder properties and file properties, it clearly states there are KBs of information there. So it's there but not there?! I tried Google and the most viable answer was to swap out one of their original files for a different one which others have took their time to locate! It seems like you would have to be somewhat of a programmer to make THEIR product work. WHAT?! The user manuals are not too helpful and I found a broken English filled youtube instructional that made it work instantly...IN CHINA. Bad news for me here in the USA.I tried to plug and play it, boot the comp while it was plugged, boot while DVR and security cams were already feeding signals..etc etc. No luck. Unless someone has a miracle solution where I'm not reprogramming their software for them, I am returning it as soon as I test out the accompanying item to save me an extra trip to the post office. Any resolutions please, I'll be fair and try if it works. Complete and utter outsourced crap so far...BTW: I came across a site that sells these things bulk, the price per unit was more like 14 bucks ea and they can churn these things out at 1000 units per week. SMH", "Date": "September 24, 2013"}, {"Title": "Worked great, good seller...", "Author": "Barry Alan Porterfield", "ReviewID": "R2T1CJT8FN1UZT", "Overall": "5.0", "Content": "Item worked better than I had thought it would. Read a lot of bad reviews about a lot of bad USB DVR being sold, and software issues and what not. This one loaded easily, tied into my camera system without a hitch, and software was no issue what soever.", "Date": "April 16, 2013"}, {"Title": "Unit is no good", "Author": "Leighton", "ReviewID": "RUP97VRXV9KSJ", "Overall": "2.0", "Content": "Software that comes with the product does not initialize the unit. Software has to be reloaded each time the unit USB is disconnected.", "Date": "June 20, 2013"}, {"Title": "4 Channel Super USB Capture Device", "Author": "JustMe", "ReviewID": "R3O49YBY73TBT0", "Overall": "1.0", "Content": "Received the item quickly and packaged well. Unfortunately, it did not work - DOA - the software disk I received was corrupt (this is based on the install error given on three different computers). Tried to contact vendor for replacement disk with no response. It also appeared tat the item may have be return, repackaged, and resold. Never tried any like devices since (many exact models on the market) so i can't review actual performance.", "Date": "January 17, 2014"}, {"Title": "decent after i downloaded new software.", "Author": "papayamon", "ReviewID": "RAKYVNS149GA", "Overall": "4.0", "Content": "a little advice to those who don't want to struggle with this card.  first, the drivers it shipped with don't work (or didn't for me).  as in i could never get video to display at all.  i tried all sorts of variables with operating systems and hardware ... but always the same result.  no video displayed on screen .  if you go to ebay and find the vendor who is selling this, there is a link to download the qqdvr software on the product description page.  this will do the trick.  when you install, be sure to select the ntsc option rather than the pal option.i wasted a ton of time trying to get this thing to work until i blundered into this solution online.  i went to ebay, found the software, and now every computer that i leave up 24/7 (there are three of them) has 4 cameras attached.  the beauty of this vs. a dedicated dvr is that you can, for instance, transfer/backup files across you network, or (as i do), run mirrored drives.if you step onto my property, i've got it on video.  and you could beat all the computer equipment i have to a pulp, because i have it backed up in a very secure location... you would never find the backup.  you could burn every building i have down, and you'd still never find it.  this is a feature i really like.for the money, this solution is simply unbeatable.", "Date": "December 7, 2013"}, {"Title": "Product does not work", "Author": "Ocean Fresh Vacation Rentals", "ReviewID": "R3A5D6HPM6U6XW", "Overall": "1.0", "Content": "I have used many different usb cctv capture products.  This product does not work.  It uses Super DVR, appears to load, but nothing happens.", "Date": "October 15, 2013"}, {"Title": "4 Channel Super USB DVR Video & Audo Real-time Network CCTV Capture", "Author": "walter loggins", "ReviewID": "R309MQBD9BZZ5X", "Overall": "5.0", "Content": "I rate it five stars as it does what I wanted it to do.  I wanted to be able to receive video and audio from my security cameras to my computer and it does exactly that.", "Date": "July 25, 2013"}, {"Title": "This product actually works with Windows 7 and the software is in English.", "Author": "bill schmitz", "ReviewID": "R27T99MGBP9CX4", "Overall": "3.0", "Content": "The Product's drivers and software were fairly simple to to install and after hooking up the CCTV cameras and rebooting the computer it was easy to configure the video settings for each camera. The video was almost as good as it was on my Television sets. But the audio was scratchy and very week even with the input gain maxed out and the speaker volume on my PC maxed out. The microphones and wiring are good because when plugged into the TV's the audio is very clear  with volume controls adjusted at low and loud and clear with the volume adjusted half way. The video is better than I expected but the audio is poor.", "Date": "July 15, 2013"}, {"Title": "terrific product", "Author": "kspike", "ReviewID": "R1VKKHC7OPVTVU", "Overall": "5.0", "Content": "i use this product to protect my family and property though i only have two cameras at the moment the device has yet to show any issues not directly related to my unreliable computer. Five stars is a shameful insult to the shocking quality and features of this product the software is flawless the hardware all but bullet proof i would and have repeatedly recommended this product to others. I would definitely buy this product again.", "Date": "December 31, 2012"}, {"Title": "Great hardware. Software could use some work", "Author": "Cassanova", "ReviewID": "R12H2PMCB9CZ08", "Overall": "4.0", "Content": "This was incredibly easy to setup. It's exactly what I was looking for as far as hardware went. The software that comes with it looks like it was made in the mid 90s. It is still functional, but it's not pretty or very easy to use. It does get the job done though so for the price it is still a great deal.", "Date": "April 2, 2013"}, {"Title": "Seems Others are Okay with it!", "Author": "Tee Q", "ReviewID": "R1YJTJ7GXL55BD", "Overall": "4.0", "Content": "Although this product just did not work for my purposes, it does seem to have worked well for others.  The company also responded quickly when I contacted them about an issue and hopefully it is resolved just as quickly!", "Date": "June 26, 2013"}], "ProductInfo": {"Price": "$36.37", "Features": "4 Channel Super USB DVR Video & Audio Real-time Network CCTV Capture Card 120FPS\nFeatures 4-channel video input and 4-channel audio input in one card, allows you to watch 4 different video displays on one screen\nCompatible with Windows 2000 / XP / Vista /7 (32 &64Bit) **(NOT SUPPORT WINDOWS 8)\n4 channel video input on one card. Maximum display/recording rate is 25 fps in PAL format; 30 fps in NTSC(US) format per channel\nRecord resolution: D1(PAL: 704 x 576  NTSC 720 x 480)", "Name": "4 Channel Super USB DVR Video & Audio Real-time Network CCTV Capture Card 120FPS", "ImgURL": "http://ecx.images-amazon.com/images/I/413N53iFEDL._SY300_.jpg", "ProductID": "B0081MWVFQ"}}