{"Reviews": [{"Title": "Barely functional", "Author": "cbstevek", "ReviewID": "R1QF1TTC7UWAQ8", "Overall": "1.0", "Content": "The device is easy to install (depending on where the wires need to go in your attic).  It starts recording when you plug it in.  Beyond that, it's a nightmare.  I managed to get it to display on my iphone.  However, it only displays real-time.  There's no way to search stored feeds.  I have been unable to connect to the device on my home network using an internet browser.  It apparently requires installation of 'Acitve X' from an unauthorized site so won't install.  I can't imagine why they didn't build a simple web interface into the device.  The only reliable way I've been able to view the feeds is by uninstalling the device (I put it in a closest) and bringing it to a monitor to plug it in directly.  Of course, while I'm doing that, I don't have my security cameras being recorded.Bottom line:  If you're looking for the cheapest way to put cameras around your property, this system may work for you.  If you'd like to be able to view the feeds, you need to have the box next to a monitor and use a point and click keyboard to control an incomprehensible search interface.  In other words, it's pretty much useless.  Look elsewhere.", "Date": "January 12, 2014"}, {"Title": "Disappointed", "Author": "Robert", "ReviewID": "R133K3K4F3O2GV", "Overall": "2.0", "Content": "People want to do three things with one of these. 1. they want to be able to view it on their network, view it over the internet or view it on a cell phone. 2. people want to be able to save and transmit video files / stills to the police or just save it for themselves and 3. people want the system to have a way of notifying them should someone come around their premises. Allegedly this system will do all three. I have spent so much time trying to figure out how to do the first two that I don't know if it will do the third well at all.Do yourself a favor before you buy any dvr system, go to the factory website, pretend you want to do the three things above and see how much model specific help you can find listed, I could not find an SVAT forum so users could so much as help each other out much less, had I only looked at how little information was available on their support page I would have bought something else. SVAT has a pdf page with instructions but they are inadequate. They do have a button on the web site for live chat and e mail though.These are very simple procedures any DVR owner would want simple solutions for. I have only been able to pull up the cameras using internet explorer and then only with a custom security setting. When I tried to pull up the cameras using my google chrome browser I was prompted to download a plug in for a Apple Safari browser. When I tried to pull it up using my Firefox browser all I got was a blue page. I have found instructions on using supplied software to capture information from a back up file on your computer but not how to access the file on the system for transmitting images.  I have yet to get it to display on my phone. I am no software engineer or network administrator but I do have a good working knowledge of computers and I have not been able to do these three simple tasks. These are things I have been able to do with other systems.Finally the quality of images is not that great but you get what you pay for, also the system is rather limited if you want to record full resolution from all 4 cameras, it can not handle processing that much bandwidth. It appears that if you use the highest resolution you can only do that on one camera, the rest have to be at lower settings.", "Date": "September 23, 2013"}], "ProductInfo": {"Price": "$319.99", "Features": "Easy-to-use system functions just like a computer\nView anytime, anywhere with remote viewing via internet, smartphone, and tablet\nReceive email alerts, with photo, when motion is detected on your property\nRecord over 2 years' worth of footage on the included 500GB hard drive\nChoose motion-activated recording or H.264 compression to maximize storage space.", "Name": "SVAT 8CH Smart Security DVR with 500GB HDD & Smartphone Compatibility (11013)", "ImgURL": "http://ecx.images-amazon.com/images/I/31-dOy-z6CL._SY300_.jpg", "ProductID": "B008IGG2H8"}}