{"Reviews": [{"Title": "PRO-760 Best Home Security Camera yet under $100", "Author": "Steve Hughes", "ReviewID": "R3RI353MKZXC02", "Overall": "5.0", "Content": "I've been putting up security cameras around my home and around my lake house for a few years now and the ones I started with are rarely in use any more. Most security cameras give you a very limited view with at most 50 degree coverage. These wide angle cameras are the way to go and it seems you need to buy $150 cameras to get good enough pictures/video. But you can catch them on sale at Fry's for $40-60 off which makes them a terrific deal.This camera has the best color and the most TV lines (700) of any hardwired camera I have put up yet. It also has a very solid, precise mount/aiming point which is secured by allen wrench making it more vandal proof. I replaced a camera with this one, and it just hooked right up to the cable I already had run. I just put it up today, will add to this review as I have more experience with it.", "Date": "August 25, 2012"}, {"Title": "Love it works great", "Author": "jankie ramsamooj", "ReviewID": "R1KISPU4DO5YX", "Overall": "4.0", "Content": "Just as I expected works very good during the day and much better than I expected during the night I would recommend this Camera,  the only draw back is no ceiling mount I had to fabricate one.", "Date": "May 6, 2013"}, {"Title": "Swann Camera", "Author": "BrianL", "ReviewID": "R2CP287T99ICL7", "Overall": "5.0", "Content": "Nice camera. Wide angle is good. Night vision is fair. Prefer a mount that works from above, but managed to mount on wall.", "Date": "February 22, 2013"}, {"Title": "Looking good", "Author": "S. Berry", "ReviewID": "RTV76AIL9NUI5", "Overall": "4.0", "Content": "Wide angle baby.  What a difference.  Switching all my cameras to wide angles.  Good picture in day and night too.", "Date": "July 18, 2013"}, {"Title": "swann security cameras", "Author": "k9officer33", "ReviewID": "R5JSK3A3FIG9C", "Overall": "5.0", "Content": "I chose this item because swann has good cameras and the graphics are exceptional , I actually see who or what is treading on my property", "Date": "December 24, 2013"}, {"Title": "Meh.  Overrated, I think,", "Author": "George L.", "ReviewID": "R1J5TVYDL48E9P", "Overall": "3.0", "Content": "The resolution isn't all that much better than my older Swann cameras.  Also, the night vision is really not that good.  They work, yes.  Just not all that good...", "Date": "November 30, 2013"}, {"Title": "Great camera", "Author": "J. Fries", "ReviewID": "R3KBKQOWTFFNBT", "Overall": "5.0", "Content": "We bought cameras for our house and the picture was not very clear, this camera has a great picture and the night vision is great. Great product and weather proof.", "Date": "February 18, 2013"}, {"Title": "SWANN 760cam Super wide angel", "Author": "Joe M.", "ReviewID": "REX85T11LCVYS", "Overall": "5.0", "Content": "This is AWESOME!  This  camera ROCKS!  I thought might have to install several more cameras to cover the front of the house, but after I put this up, this ONE covers it all!!  VERY, VERY happy with this product.  Thanks plus had contacted the SWANN company on some questions I had, and they were very helpful, great people to talk to!.  BIG Thanks to AMAZON and SWANN", "Date": "January 11, 2013"}, {"Title": "OK Camera", "Author": "Project Mangler", "ReviewID": "R2GU8HM7LV4CCB", "Overall": "4.0", "Content": "Works, connected the OSD controller, which died after about a week.  I had not even tried to use it yet.  The 'save' button is defective, does not pop up.  Disconnected the OSD and camera works, but I paid for one with OSD.", "Date": "February 10, 2013"}, {"Title": "Good small camera", "Author": "Silicontoad", "ReviewID": "R24YE7TOOAEJGG", "Overall": "4.0", "Content": "First, the camera is smaller than you think but I was not disappointed with the quality. Most cameras you have to run the RF cable and the power line. This camera you have to run the RF, power, and third wire which hooks up to a little on screen hard wired remote which controls the cameras functions.", "Date": "September 23, 2013"}, {"Title": "Really like this camera...", "Author": "IssaquahWA1979", "ReviewID": "R352TJ5C532MK1", "Overall": "5.0", "Content": "I have 3 different types of cameras on my system and this by far is my favorite...  Better wide angle than the others, better color and fantastic night performance.  I wish I had seen this before I bought the others but I will slowly change them over to this unit...", "Date": "January 9, 2014"}, {"Title": "Worked fine, then had problems, then didn't.  Now works fine.", "Author": "Karen Stubblefield", "ReviewID": "RH66GU2SQ50A2", "Overall": "5.0", "Content": "The camera works as advertised, however, after I had it installed for several weeks, the screen on the monitor went white.  I brought it inside and used a shorter wire and it worked fine.  I figured that the 100' wire I also bought from you was bad so I rolled it up and also brought it inside thinking I had to buy a new wire.  I plugged in the wire I thought was bad and it worked fine.  It is now back up with the original wire and works fine.  Go figure.  Craig", "Date": "December 15, 2013"}, {"Title": "SWANN SUPER WIDE-ANGLE CAMERA (WHITE)", "Author": "TAYLOE7", "ReviewID": "R275Q58QRW0Q98", "Overall": "5.0", "Content": "SWANN CAM CAMERA IS PERFECT AND I LOVE THEM ALL.  IT IS WELL WORTH THE PRICE. I AM VERY PLEASED WITH THE ANGLE AND THE LIGHTING ON THE OUTSIDE OF FRONT AND BACK.", "Date": "November 27, 2013"}, {"Title": "Good Camera, works well no real issues. pretty rugged construction", "Author": "BillK", "ReviewID": "R1ZVDTAY9JCJP6", "Overall": "3.0", "Content": "Good Camera, Nice wide angle but don't expect a real clean defined image. Color is nice as well. they don't wash out when too light.", "Date": "November 15, 2013"}, {"Title": "Great view!", "Author": "DiDi Early", "ReviewID": "R3NCTY5JQSKAX5", "Overall": "5.0", "Content": "This camera is great! Allows a wide angle to view yard and driveway and great camera vision! Highly recommend this one. It saves buying a lot of cameras.", "Date": "November 13, 2013"}, {"Title": "Good low cost security camera", "Author": "Paul & Carroll \"Paul\"", "ReviewID": "R1PX92EOKDC9U1", "Overall": "5.0", "Content": "Replaced older camera and it was a huge difference in picture quality. Very happy with the unit and if your looking for a low cost security camera I would recommend this.", "Date": "November 6, 2013"}, {"Title": "Satisfied with purchase", "Author": "Jeanie Jacks \"JJ\"", "ReviewID": "R1JTO6ECL9KV4S", "Overall": "5.0", "Content": "Great quality, feather weight, and cost effective. Better resolution that cameras that came with DVR. Very easy to install. Replay of recordings on Swann DVR are very clear. Wide-angle makes a big difference compared to non-wide angle cameras. Very satisfied with this purchase.", "Date": "November 2, 2013"}, {"Title": "Really sharp definition", "Author": "Master Craftsman", "ReviewID": "R2MI5Y6B6F4EQL", "Overall": "5.0", "Content": "I bought this brand because it is the brand recommended by feedback viewed during research on many brands.The best things I like about the view are the wide angle and clarity from zone to zone.Recommended for anyone wanting to cover a wider area with sharp definition.I will be getting another soon.", "Date": "January 11, 2013"}, {"Title": "Very clear video", "Author": "Edward Maher", "ReviewID": "R1VJVM3BD7J675", "Overall": "5.0", "Content": "This camera has a very clear video, great infrared video also. Wide angle lens picks up a nice view.  Was easy to install, Would buy again.", "Date": "April 4, 2013"}, {"Title": "Lasted 8 months", "Author": "Gaines E. Bruce", "ReviewID": "R2KJ6Q0ATUUDLG", "Overall": "1.0", "Content": "I bought this camera last December. I was very happy with the camera coverage and picture up until today's rain storm when the picture went out. The cheaper cameras that came with the setup are still chugging away. So it seems that spending $150 on this all weather outdoor camera was a total waste of money. Supplemental review: I owe the manufacturer an appology. The camers was not the problem but the extra long video cable that apparently developed a problem. Replacing the cable restored proper camer operation. I am ordeing a second unit to replace the one I bought to replace this one. That cameras as extremely poor compared to this unit whih has good color, definition, and yes I like the wide angle coverage. I just wish a very hig quality cable was available to install these cameras. Because of wher I have some installed, I need to burry the cable for part of the distance.", "Date": "August 21, 2013"}, {"Title": "Good camera as described, but cannot compare to 1920 x 1080. :(", "Author": "DSh", "ReviewID": "R1LS34OPC46PR", "Overall": "5.0", "Content": "I should not compare this camera to my friend's new surveillance system with 1920 x 1980 x 30 fps, because I cannot watch my cameras now. :) But it does its job. To be realistic, I don't expect too much from my system after I saw the advanced system with the BD resolution even after a 264 compression. But it's still good with full D1 and all 16 channels. This camera was added as a new component to my current system and I'm glad I got it. I think I will buy one more to cover another blind spot currently covered with a very old obsolete camera. It came with the cable and remote allowing to correct it's settings. Realistically you will use it only once and then forget, but it's convenient.", "Date": "April 22, 2013"}, {"Title": "fair", "Author": "Matt \"worm007\"", "ReviewID": "RVPBQE1ENE6EO", "Overall": "3.0", "Content": "This camera has a nice viewing angle and a decent picture.  The night vision was very poor and dim at night.  The camera is pretty small in size if you prefer that.", "Date": "April 17, 2013"}, {"Title": "Excellent Camera", "Author": "G. Mark Stewart", "ReviewID": "R2GNHJVPD8NAX8", "Overall": "5.0", "Content": "Easy to set up, great picture, great IR illumination, rugged, much better than comparable units from competition.  Great value and product.", "Date": "April 6, 2013"}, {"Title": "great upgrade", "Author": "Caspian", "ReviewID": "R16XGICHP6WFLQ", "Overall": "5.0", "Content": "I am upgrading my cameras from the stock ones that came with my Zmodo system.  I only bought one to try it out and could compare it directly to the other 3 standard cameras.  It is WAAAAY better.  the wide angle lens is awesome.  It is about 2x as clear as the Zmodo ones.  You would probably have to spend upwards of $400/camera to get better than this.  For a home camera, it is a definite upgrade must.The area it views has a street light in the range, so I can not fairly judge the night vision.  However, I am currently upgrading my outdoor lights with motion sensors around the entire house, so if there is a diminished NV, it won't be an issue.  I think all cameras with the same IR lights will all have the same limitations.  If you are concerned about IR lighting, I would suggest looking at models with extra IR lights.", "Date": "April 29, 2013"}, {"Title": "Distance stated is questionable", "Author": "D. Adamscheck", "ReviewID": "R19DI17QZ9XQBE", "Overall": "3.0", "Content": "Gave it a 3 until performance proves otherwise. Bought it because of the 65ft distance claimed. Reading the included instructions is depressing.From the instruction manual -- \"Anything further than a few meters (ten feet or so) from the camera may appear to be too small for the level of detail you require\" -- That is not encouraging...Instruction manual even says -- \"it can see up to 30m/100ft in the dark.\"I can see stars in the sky in the dark... I want detail...Guess giving it a try is the only way to find out...", "Date": "December 21, 2012"}], "ProductInfo": {"Price": "$149.00", "Features": "Easily Connects To Dvr With Included 60-ft Cable\ncable\nPro-760 Super Wide-angle Camera", "Name": "Swann SWPRO-760CAM-US Pro-760 Super Wide-Angle Camera (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41UqGfcWIwL._SY300_.jpg", "ProductID": "B008B4K7O6"}}