{"Reviews": [{"Title": "More features & better cameras than most budget DVRs", "Author": "ALAN E PENROD", "ReviewID": "R3G64DEPLIHTZD", "Overall": "4.0", "Content": "Bought because our country neighborhood has some of the busiest dead end streets I've ever seen. I'm fairly handy with tools and computers, so installation was straightforward for me (attic crawling was a pain though)--if computers are scary then have your computer nerd friend help out.PROS:-After searching several online reviews, SVAT seems to have higher resolution cameras, which was important to me. Capable of D1 resolution (pretty close to DVD) at 7 fps. CIF resolution didn't seem very useful to identify faces unless they were really close. Night vision works but the light cone of the LEDs is smaller than the camera field of view, so center up what you really want to monitor.-Lots of independent controls for each camera that let you specify privacy areas, record on-off times, motion record on-off times, masks to prevent motion detection, resolutions and frame rate. Check out the manual from the SVAT webste, but you can probably do anything you want.-Email feature is nice (older SVAT reviews had problems, but mine works flawlessly with Gmail if you follow instructions). It typically picks up the UPS truck in the driveway (start of motion) and not the face of the UPS guy. Be ready to get a lot of emails in a day on a windy/rainy/partially cloudy day even on lowest sensitivity settings if you place the cameras outdoors.-iOS app to view remotely works as advertised... recommend you get a DynDNS or similar account if you do not have a static IP address.-Computer interface much faster and easier to use than remote/mouse off the TV -- but you may need your computer nerd friend to help set it up.CONS:-Can only playback 4 channels at a time, but you can go 8x speed which helps make up for this minor inconvenience.-Don't expect to do a ton of reviewing off-site through your internet connection; remember you have 8 cameras possibly recording at DVD video quality at about 1/3 the speed. Your home/business internet has to upload all that data to the remote location, and upload speeds are typically 1/10th your download speed. To put it another way, imagine you are streaming 3 Netflix movies simultaneously but your internet is 10% as fast as you have now. The good news is you can download the video segments using an button on the web interface for later viewing using software available at the SVAT website... I'll be using that a lot overnight. An when connected the the same WiFi as the DVR, speed is not an issue.ISSUES:-One camera did not have the rubber friction piece that secures the adjustable hood, allowing it to slide freely. A $0.35 stick-on furniture pad worked nicely, not a big deal.-DVR hard drive failed quickly on mine (after a few days of continuous recording to test system). Dropped it from 5 to 4 stars because I had to fuss with a return. Some previous reviews had this problem also.-Definitely call the SVAT customer support number during business hours to set up a return--I tried contacting the seller, but they needed me to return all the cameras as well (I was not going to undo all that work) just to act as the middle man. SVAT send me a new DVR and an RMA right away, when they receive old defective unit my card should be reimbursed for the new DVR. Set me back shipping, but I much prefer that to waiting weeks for someone to verify the hard drive was toast.OVERALL:-For the money, and compared to DVRs at the big box stores, I think I got better outdoor-recording value for my $$$ from SVAT than competitors... even with a return.", "Date": "December 13, 2012"}, {"Title": "SVAT 8CH DVD System from Amazon.com", "Author": "Kenneth A. Weimer \"kweimer\"", "ReviewID": "R3ABVAEM6R8TF8", "Overall": "5.0", "Content": "I am still in the process of installing this system...installing cameras on brick is not easy.  Crawling through the attic to pull 8 power/signal cables takes time.  All eight cameras (3 inside and 5 outside are physically installed and four (3 inside and 1 outside) have cables pulled to the DVD and the quality on monitor is great.  I have yet to go to system and do the settings.  I will use a wireless usb system to send wireless video to a hidden 2TB stand alone drive.  A thief steals my exposed DVD, I still have recordings.  Good luck on finding the hidden 2TB HD.", "Date": "October 21, 2012"}], "ProductInfo": {"Price": "$949.99", "Features": "Easy-to-use system functions just like a computer; View anytime, anywhere with remote viewing via internet, smartphone, and tablet\nReceive email alerts, with photo, when motion is detected on your property; Record over 2 years' worth of footage on the included 500GB hard drive\nChoose motion-activated recording or H.264 compression to maximize storage space; 600TVL Ultra Hi-Res cameras provide crisp and detailed video\n36IR LEDs for up to 100ft automatic night vision; Weather-resistant camera housing provides superior functioning through all types of weather\nAnti-vandal mount ensures camera cables cannot be tampered with; Easily connect to DVR with 65-foot cables to allow greater flexibility in camera situating; Lifetime Live Customer Support; 1 Year warranty", "Name": "SVAT 8CH Smart Security DVR with 8 Ultra Hi-Res Outdoor 100ft Night Vision Cameras with IR Cut Filter 500GB HDD & Smartphone Compatibility (11025)", "ImgURL": "http://ecx.images-amazon.com/images/I/41DTNgEzSTL._SY300_.jpg", "ProductID": "B008HDH50K"}}