{"Reviews": [{"Title": "Nice DVR recorder buy !", "Author": "Tom", "ReviewID": "R2E8022YOVCVIE", "Overall": "4.0", "Content": "Easy to set up and work with .. I used a 1 TB HD and worked nice... No way I could ajust the cameras to clear them up like I can on my DVR cards in my computer... Sent it back with out any trouble  ... Very good support .... I have one Pan Tilt Zoom camera from Zmodo and two smaller just Pan N Tilt camera and they all work great... I will buy one again when it come out with camera ajustments for bright and color ajustment ...", "Date": "January 9, 2013"}, {"Title": "more than decent for the price", "Author": "Jambo FTCW \"Tech Special\"", "ReviewID": "R2397ZLK70VKF0", "Overall": "4.0", "Content": "I love my DVR - I have all 16 channels up and running.  I have one problem with it freezing up after viewing remotely via iPhone (occasionally) - working with Zmodo to get it corrected  - I think probably need a firmware update - if that gets fixed it would definitely be a 5 star item.  BE AWARE - you must buy the hardrive seperately not a big deal as I had one from an old computer anyway.UPDATE 08/03/2013 - I had it connected to the router via a sub link switch - connected directly to a router port - per ZMODO suggestion and it works - kind of - it will connect and run video from iphone but it still will stop and start - NOT AS BAD AS BEFORE - but it still does - the app will let you view 4 channels at once - but forget that as it will not keep all 4 running - I guess its just too much data - or the system itself - BUT - with that said for the price I still can view ONE via phone and have been running 24x7 from October 2012 thru August 2013 with no other problem.Just a FYI - I have one camera on a fenced in chicken area with coop and one day there were feathers everywhere (all the chickens were ok) went to the video from the night before and found @3:30 AM a HUGE OWL flew in and was chasing them around the fenced in area!", "Date": "October 27, 2012"}, {"Title": "NO D1 support, no support from Zmodo!", "Author": "baaggii", "ReviewID": "R1MC88Q28CD0IO", "Overall": "2.0", "Content": "I have bought this at the end of the last year from CrazyTalk Electronics. I received them, but it doesn't support D1, It was wrote right in the header of the product, as you see.Contacted the seller, but they told me to contact the website. I wrote an e-mail about that to the [...], but they never answered.Why do you guys still lie? Remove D1 from your product header, this confuses us. Now i will have to buy another one with D1, but not from you, guys!", "Date": "April 17, 2013"}, {"Title": "No D1 support", "Author": "pl", "ReviewID": "R2MG0XHPR18WGC", "Overall": "2.0", "Content": "The unit works fine, everything as expected, except it does NOT support D1!! it only support the lowest CIF resolution, title and description is very misleading.", "Date": "March 4, 2013"}, {"Title": "So Far So Good!!!", "Author": "crobin1", "ReviewID": "R221B3C4LA09QZ", "Overall": "4.0", "Content": "So far so good. When I received this item all but one screw was missing that held the cover on. Other than that it appears to be working fine. I installed a 2 TB drive in mine. I am still playing around with all the features. I had four cameras already but decided to order five more to fill up the screen on the DVR. Only had this for about week so more updates to follow. NOTE: Does not display in D1 but I'm not sure if that because of the resolution of my camera's.", "Date": "December 10, 2013"}, {"Title": "Very easy to config", "Author": "Munir Semhan", "ReviewID": "R1H9V0WCF6YAFR", "Overall": "5.0", "Content": "Bought this to replace an old and expensive system simply because the other one doesnt support mobile viewing. very easy to setup.", "Date": "October 2, 2013"}, {"Title": "Good DVR For The Price", "Author": "PhantomArcher \"Tyler Moore\"", "ReviewID": "RTD2LTYNQH23L", "Overall": "3.0", "Content": "I've worked with a couple different DVR units from half a dozen brands and I have to say, this is a decent unit for a pretty good price. I will admit, the age old idea that you get what you pay for is true here; the unit works but it doesn't have all that many features and the actual interface isn't nearly as friendly as some of the other units I've worked with. If you're looking for a basic DVR at a bargain price, this one will work; if you're looking for a feature rich or highly resilient unit, look elsewhere.", "Date": "May 30, 2013"}, {"Title": "great machine", "Author": "Mel", "ReviewID": "RADPKWCP1FC2W", "Overall": "5.0", "Content": "just make sure you know up front it doesn't have  a hard drive in it, the machine is great runs all camera's hooked to it.  I had a hard drive when I ordered it so it was fine and works awesome. plus hard drives are cheap. the only thing is its on a high shelf and the eye for the remote is toward the top of the unit and from the ground the remote doesn't work for me, but really its on record and that is all i need.", "Date": "May 7, 2013"}, {"Title": "great buy", "Author": "Rafael", "ReviewID": "R3S34FKIRE4AOI", "Overall": "4.0", "Content": "i wish would have bought the harddrivei need to buy a hard drive now  .  .  .  .  .", "Date": "March 30, 2013"}], "ProductInfo": {"Price": "$359.99", "Features": "This great 16 channel surveillance DVR ZMD-DR-SFN6 features advanced technologies including standard H.264 Compression, SATA interface, input/output for video/audio/alarm, network access and mobile view.\nSupport mobile phone based on Windows Mobile, Symbian 3rd 5th, blackberry 4.6, Android 1.5, iphone iOS 3.0\nRecording Mode: Continuous/ Schedule/ Motion Detection/ Sensor Triggered/ Remote Network", "Name": "Zmodo 16 Channel DVR H.264 D1 3G Remove Support No HDD Surveillance Kit  ZMD-DR-SFN6", "ImgURL": "http://ecx.images-amazon.com/images/I/31gDxWD0GnL._SY300_.jpg", "ProductID": "B0083J0L9U"}}