{"Reviews": [{"Title": "Great product", "Author": "howard brown", "ReviewID": "R2H8O22DD1J7L2", "Overall": "5.0", "Content": "This Crimestopper performs better than one i had before [ rarely  a  false detection] .This system is very accurate at finding distance. I like  having both visual and audiblesignals. These sensors have a short cable pigtail which plugs into the longer cableto control module that simplifies troubleshooting or replacing if needed. Be sure toleave enough free cable at the bumper to remove sensor and it's plugin", "Date": "August 9, 2013"}, {"Title": "very cheap electronics", "Author": "lawrence", "ReviewID": "R3BOAYL3QM1TXJ", "Overall": "2.0", "Content": "false alarms, sensors seem erratic, module powers down slowly to a faded beep when taken out of reverse, on test with a 6 inch wide Bord it fails to pick up sometimes, leaving room for costly repairs, i wont trust it so i cannot recommend this product.  i would however recommend the steel mate PTS400T, but it seems amazon stopped selling them, well just my opinion hope it helps", "Date": "December 29, 2013"}, {"Title": "Super Product.  Great Price", "Author": "WalterGA", "ReviewID": "R21BU9XYE7HIZE", "Overall": "5.0", "Content": "I bought the Crimestopper Parking Sensor CA-5010.II, with the intention of installing it on my new 2013 Altima.  The Altima comes equipped with a rear-view camera, but I wanted a beeper system also.  I just couldn't bring myself to drill holes in the bumper of the new Altima, so I installed the system in my '97 Mercury Mountaineer, which has neither back-up sensors nor rear-view camera.Instructions aren't really detailed, but the installation really is pretty simple.  I used the provided holesaw to drill four holes in the vinyl-covered steel bumper.  Ran the wires in through the left taillight assembly.This unit works AS ADVERTISED.  I tested it by backing up close to several different obstacles, a real estate sign, a utility trailer, and a friend's car.I found the distance readouts to be exact.  I'm really pleased with this product!", "Date": "July 15, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0089I65Y0"}}