{"Reviews": [{"Title": "False Advertising", "Author": "Irate Customer", "ReviewID": "RD2P1HTMXCW18", "Overall": "1.0", "Content": "This product picture advertisement is misleading since it shows 6 cameras but it is only 1 that is on sale.", "Date": "June 19, 2013"}], "ProductInfo": {"Price": "$200.00", "Features": "1/3\" SONY EXview HAD CCD II camera\nThird generation light source chip array\n700 TV lines\nOSD Menu\n8mm Lens\nThe 3rd Generation LED Arrays:  The LED Arrays deliver high performance, compact and cost-effective solid-state lighting solutions to serve the high-end lighting market. 3rd Generation LED Array Will Deliver Dramatic Energy Efficiency and Cost Advantages.\nWide LED Angle:Mostly the Led angle is 8 Degrees-30 Degrees, that's why it likes beam of flashlight. The 3rd LED array has angle with 8 Degrees-120 Degrees, providing wider view area.\nHigh Brightness, Long Range:One Led's Optical output is 5-15mW, the brightness of 200pcs normal LED equal to one LED Array, so the LED array has excellent performance with higher brightness and longer IR range.\nLong Life-Span:LED Array's life-span is 5-10 times of conventional led, so calculate it according to 7-8 hours IR ON a day, that is 4-5 years for use.\nHigh quality:LED Array is military grade LED, the quality is higher than the industry level, surely much better than commercial grade LED. Simply speaking, the LED Array will stay in a good condition and not be damaged by normal using.\nHomogeneous light:The 3rd generation LED Array equals a large light source, through a special optical design, it allows lights to exposure the object evenly. The brightness is consistent in the whole monitoring screen.\n25 foot BNC Video & Power Cable\nCamera Specifications: Model G-844WD Pick up Element 1/3\" SONY EXview HAD CCD II Effective Picture Elements (H*V) NTSC: 976(H) x 494(V) Horizontal Resolution 700TV Line Minimum Illumination 0.001 Lux 0Lux (with IR LED ON) S/N Ratio 52dB Scanning System 2:1 interface Synchronous System Internal, negative sync. Auto Electronic Shutter NTSC: 1/60s~1/100,000s Gama Characteristic 0.45 IR Distance 164 feet (with 1 PCS infrared LED) Video Output 1Vpp, 75Ω Auto Gain Control Auto Power/Current DC12V(+/-10%) 600mA Lens CS lens 8mm/F2.0 Dimension (mm) 225(W) x 175(H) x 95(D) Weight (g) 1700 Storage Temperature -30~+60˚C RH95% MAX Operating Temperature -10~+45˚C RH95% MAX", "Name": "1/3\" SONY EXview HAD CCD II 700TVL Outdoor Security Surveillance Camera with 25ft BNC Cable & Power Adapter Kit- 700 TV Lines, 8mm Lens. Third Generation LED Arrays. OSD Menu", "ImgURL": "http://ecx.images-amazon.com/images/I/41OK5lnbfNL._SY300_.jpg", "ProductID": "B008G3SGI6"}}