{"Reviews": [{"Title": "Home security", "Author": "Geek Guy", "ReviewID": "R3E0ID26LBPMWT", "Overall": "4.0", "Content": "I purchased this system to keep an eye on my home while at work or vacation. Some planning before it arrived payed off and in  only one day I had 6 cameras up and running. After a couple of calls to Zmodo the system was sending e-mails to my phone and I was viewing my home on the net. Nothing bad to say about the system. It performs well especially for the price. To say the cameras can see 80 ft. in the dark is a bit optimistic and if you wanted to make a blockbuster movie for the big screen this might not be the best choice but If you want to protect your home and have some peace of mind when you are away you can't do much better. The downs are few but include night vision that makes identifying faces difficult and a noisy fan on the dvr. My dvr is located in my bedroom and the noise is a little irritating. I am thinking about using a timer to only operate the system while we are not at home. This is not a big drawback for me because I purchased the system for when I am gone anyway. I suggest ordering an extra 50 ft. cable or two. Four of the eight cables are only 25ft! I managed to use two of them but compromised on camera location. I have added a couple of dome cameras inside and using one of the furnished outdoor cameras in the garage. The domes and the garage are the ones that trigger an e-mail due to leaves, birds, cars, etc. and so far not one false alarm. I am confident my home is protected and that was my goal. Amazon delivered as promised as they always do and i have no regrets about the purchase. I can truly say this is well worth the cost and time.", "Date": "September 18, 2012"}, {"Title": "hi", "Author": "Ronald a Kaiser", "ReviewID": "R1CZ00KEFAI9CE", "Overall": "5.0", "Content": "i love it but still dont know how to record to retive to set up user manual  dont under stand  i may have to pay someone to teach me not as easy to learn as vcr can someone show me ron twosocks53@yahoo.com", "Date": "April 6, 2013"}, {"Title": "Cheap China Crap", "Author": "David", "ReviewID": "ROE8D36M616WY", "Overall": "1.0", "Content": "Really poor quality, several brackets had screws that were stripped and picture quality really poor.cables are way too short, and the unit gets really hot and makes a lot of noise, that you can hear several rooms away.", "Date": "October 13, 2013"}, {"Title": "Zmodo KDH6-DASFZ8ZN-1TB 16 Channel H.264 DVR system", "Author": "Rick", "ReviewID": "R1W7YRHOGUXAJV", "Overall": "1.0", "Content": "1 star for this DVR system because it sucks! i only bought it because it was on-sale and affordable, and i needed something cheap & quick. Seems like the DVR system has some kind of defect. The bullet cameras that came with it is great. 4 stars for that. The DVR system however, is my real problem! Not user-friendly, very difficult to understand and use the system, the instructions manual is garbage. Needs serious vocabulary improvements. (ENGLISH DAMMIT, ENGLISH!!!). the fan in the DVR box is noisy, and it (the DVR system) runs slow like an old jalopy computer infected with virus. Some of the buttons on the DVR box doesn't funtion, and the remote doesn't work. I have to do everything by using the mouse that came with it. Also, the other issue i have is with the time. i've set it to regular hours and not 24 hours mode, but it still show as 24 hour. For example, when the time is 12:59pm, when it turns 1 O' Clock, instead of displaying \"1:00pm\", it displays \"13:00\". Even with the time & date set to normal. It will take a while for an average joe to figure out how to use this DVR system. Eventually, after having this DVR system for almost a year now and messing around with it, i understand how it operates. Also, Zmodo Customer Service is horrible!!! 1 star for that also. Everytime i have an issue with my DVR system and tried to contact support, i either don't get the help i needed, or, i just don't get help at all! it's like they ignore you while you're waiting on the phone for half an hour already. Same for the 24 hour live support online. They will ignore you and eventually will send you a page telling you to leave your email and questions and they will get back to you, well, in this case, they never returned my email. i do not recommend this DVR system from this brand!", "Date": "May 22, 2013"}], "ProductInfo": {"Price": "$649.99", "Features": "Supports Remote View via smartphone & 3G Mobile using: iPhone & iPad IOS 5; Google Android 2.1~2.3; Blackberry 7; Windows Mobile Pro 5.5 ~ 6.1; Symbian V3 & V5\nDVR Features: H.264 Hardware Compression, Video Input / Output: BNC16/BNC 1, Video Output: VGA, Audio Input / Output: RCA 4/BNC 1, 1TB hard drive installed\nRecording Mode: Manual/ Schedule /Motion Detection and Alarm, Sensor/Alarm: 4-ch Sensor Inputs / 1-ch Alarm Output, IR Remote Control, PTZ via RS-485 Port\nCamera Features: 1/3\" Sony Color CCD Image Sensor, 420 TV Lines, Horizontal, 6mm Lens, Signal: NTSC, Night Vision Min. Light: 0 Lux (IR On), IR Irradiation Distance: 80' (25m), Operation Temperature: -25F~122F, Weatherproof: Indoor and Outdoor, Power: 12V DC, Mount: Ceiling or Wall, Video Connector: BNC, Power Connector: RCA 12V DC\nPackage Includes: 1 x ZMD-DC-SBN6 16 Channel Security DVR with 1TB HD, 8 x CM-S22326BG Sony CCD IR Outdoor Security Camera, (4) W-VP1008 25' AWG-24 CCTV Video + Power Cable, (4) W-VP1015 50' AWG-24 CCTV Video + Power Cable, 1x PA-1059 12V/5A 9 Port Power Adapter for Cameras, IR Remote Control & Mouse, User's Manual", "Name": "ZMODO KDH6-DASFZ8ZN-1TB 16 Channel H.264 Security DVR (1 TB hard drive included) with 8 x 1/3\" Color CCD IR Outdoor/Indoor Weatherproof Camera System - Professional Choice", "ImgURL": "http://ecx.images-amazon.com/images/I/51AMRqbKVJL._SY300_.jpg", "ProductID": "B008GMSLUA"}}