{"Reviews": [{"Title": "Sun Washed Out Print within a Month", "Author": "Dan", "ReviewID": "R39D3PSTXQSGH5", "Overall": "1.0", "Content": "Small labels faded within a month & were unreadableSun washed out print & labels peeled off glassNot suitable for outdoor mountingNot Recommended", "Date": "September 7, 2012"}, {"Title": "Regret buying them. Will not survive outdoor or any temperature variances!", "Author": "JD", "ReviewID": "R2OFDDQB1O1XY8", "Overall": "1.0", "Content": "Such a waste of money. This stickers need to be made out of silicone or some kind of material that can survive temperature and weather variations. I took the time to highly clean my windows before sticking them on, placed them perfectly while the window and sticker was warm so it would adhere properly. They looked very nice for a little while, and then it became apparent that a little sunshine or rain and they begin to unstick. After that, they fade very quickly and of course fall off leaving what seems to be an impossible to remove hardened adhesive film on the window. It's going to take me some serious solvent to clear the spots off. The only stickers I've had last are indoor and in the garage.DO NOT BUY THESE unless you are putting them indoors where the temperature has very little variance and absolutely no direct sun or you'll have about a 2 month lasting sign before they fall off or fade. Now I'm searching for stickers that can last for years and actually stick! Would give this a zero star if I could.", "Date": "December 19, 2012"}], "ProductInfo": {"Price": "$39.99", "Features": "These Decals can be applied to any smooth surface\nEasily posted and removed\nThis is the quick, easy way to warn criminals that they are being watched\nThese signs are your first line of defense against criminals\nPackage included : 16 of 3 x 2 inch and 2 of 11.5\"x8.3\" stickers", "Name": "VideoSecu 18 Home CCTV Surveillance Security Camera Video Stickers Warning Decals Signs 3A4", "ImgURL": "http://ecx.images-amazon.com/images/I/61L9CIW2MrL._SY300_.jpg", "ProductID": "B0088K9TWO"}}