{"Reviews": [{"Title": "No detail", "Author": "Ronald", "ReviewID": "R2RZ3ATFJSU5XF", "Overall": "1.0", "Content": "I purchased two of these to add to my Swann security system. The Swann came with 4 cameras that are 420 TVL and have only 12 LED's and they are crystal clear compared to this camera. It looks like you're looking through a fog.There is no detail and both daytime colors and nightime black & white are washed out. I'm very disappointed and I will be returning them.9/24/2012Well, I just received my return authorization and they want a 15% restocking fee as well as I have to pay to ship them back. What a rip off. Stay away from this product and company. Amazon should investigate and remove them as a vendor.11/7/2012I felt I should update this review since they did eventually refund all of my money and waived the restocking charge after since I threatened to complain to Amazon about them. It's a shame it had to come down to that. If I wasn't persistant, they would have charged me. Most inportantly.....the camera is junk.", "Date": "September 22, 2012"}, {"Title": "Night Vision Problem", "Author": "Zx", "ReviewID": "R1IBDK5COWKQR3", "Overall": "1.0", "Content": "Pros: Good daytime picture for a cmos camera. Good microphone pickup and clarity.Cons:1. Night vision issue:  The camera either stopped working completely when switching to night vision or worked with severely diminished and distorted night vision after numerous camera reboots.2. Absolutely no support from Night Owl. I e-mailed Night Owl tech support with the issue on Sept. 10, 2012 and have yet to receive a response.Other Thoughts: I purchased this camera at a different merchant than Amazon. I could not compare prices at Amazon in that Amazon was not carrying it at the time. I previously purchased a Night Owl 420 TVL CCD camera from a different site in May and it has worked flawlessly since. I purchased this 600 TVL camera expecting a lot better from Night Owl, but was profoundly disappointed. Fortunately, the merchant agreed to pick up the return shipping and provide a refund. Based on the few reviews I have seen up to this point, this night vision issue is a recurring theme. It seems that this product was likely distributed with a pervasive manufacturing defect related to the night vision. I purchased a Swann Pro 640 600 TVL CCD camera and a Defender 21005 600 TVL CMOS camera at roughly the same time. In my opinion, both of these cameras are are a better choice if you are looking for a 600 TVL camera. The Swann has very good color and clarity during the day and decent night vision. I have motion detecting floodlights on my home and found that the intensity of these lights activates the daytime functioning of the Swann. This allows me to capture color images throughout the night. The Defender has very good daytime color and clarity. The night vision on the Defender is excellent. It will not revert to color with my motion sensing lights but I would recommend it especially for areas that remain unlit throughout the night.  The daytime performance of the Night Owl 600 TVL was below that of both the Swann and the Defender. The Swann and Defender each were about $60 on sale when I picked them up. An additional note: The \"Cobalt Blue\" LEDs of the Night Owl look blue when not lit but are red when illuminated.", "Date": "September 29, 2012"}, {"Title": "Mine is great.", "Author": "G. Christie", "ReviewID": "R2J1GH0HR090J2", "Overall": "4.0", "Content": "I've had mine up and running for about a month now. It's primary use is daytime recording of my backyard and alley. Lately there have been problems with some local crackhead neighbors stealing things from garages and yards. I have this camera mounted inside behind my window. This negates the night vision function. It will not work through glass. However I have no need for night vision. The criminals do their thing during the day when everyone is at work. The camera is in plain sight but invisible because of glare on window.This camera gives me clear enough detail to see faces of people from about 70' away down to the alley in daylight also covering most of my backyard and adjoining neighbors yard. The field of view is wide enough to get the crackheads house in frame. So if they steal another bike, mower, whatever I'll catch them returning home with it.I got this camera as an addition to the Night Owl 4 camera system. The smaller cams  that come with the system have the false color and low night vision issues that the other reviewers for this one are complaining about.A thing to consider with day and night viewing through a camera is that day and night will be different. The same settings for both in the DVR will be significantly different for the camera. Night viewing will require a higher brightness setting than with day.You may want to set up one for day and one for night unless you want to adjust the settings constantly.No problems here just takes a little tweaking to get the view you want.", "Date": "September 30, 2012"}, {"Title": "Needs a wide angle lense to be 5 stars.", "Author": "Mike", "ReviewID": "R3TESTOFGXGDT0", "Overall": "3.0", "Content": "Pros: 1. Great sound; it pick up sound clearly and from a distance. 2. The picture is clear as a bell at 600 TVL resolution.Con:  2.  Narrow viewing angle.If this camera had a wide angle it would rate 5 stars.  Night owl does not offer wide angle cameras due to it specific produce niche.  Their produce line is geared toward close up facial recognition not landscape viewing.  It has sound so I wanted it for my front proch.  Because of the narrow viewing angle it has to be set off in the distance to be effective but then you lose the some of the facial details.", "Date": "July 19, 2013"}, {"Title": "Not worth it...", "Author": "ML", "ReviewID": "R2HEC8IRK1X7V7", "Overall": "2.0", "Content": "Purchased two of these cameras, not from Amazon.  Right out of the boxes (brand new) both of them had loud buzzing on the audio line, BOTH of them!  Like the gain was tuned way too high.  Contacted Night Owl, was given return auth right away.  Sent them back.  Weeks go by.  \"New\" ones arrive.  But wait, they're not NEW they're refurbished!  One camera fluttered so badly when switching from day to night vision the image disappeared for several seconds.  The other camera was completely out of focus.  Contacted Night Owl, AGAIN got return auth and prepaid shipping label.  Sent them back, waited weeks.  Received two NEW cameras (so I'm told).  No buzzing, daytime image crisp, clear, sharp; smooth switching between day/night.  Unfortunately the night vision from one camera is so bad it's grainy and picks up radio station interference.  The area is low light only coming from my back door light.  The IR does light up the area on cam but it's so grainy and blurry you can't possibly make out any facial detail unless the person is right in front of the cam.I gave them two stars because their customer service was at least prompt when I talked to them.I would not recommend this product.", "Date": "July 12, 2013"}, {"Title": "Maybe a bad batch???", "Author": "Richard Keller", "ReviewID": "R2AJF8MGVUTXBH", "Overall": "1.0", "Content": "The image from this camera is worse than the image from the same brand of cameras with only 420 lines and this is supposed to have 600 lines.  The night vision and audio also started having a problem after less than a week so its being returned for a refund.I heard good things about this model before so maybe a bad batch or something.", "Date": "February 27, 2013"}, {"Title": "JUST AWEFUL", "Author": "Amazon Shopping Wh0re", "ReviewID": "R1I1H8Z62RHZ7K", "Overall": "1.0", "Content": "I bought a 4 pack of these from Frys, finally tested them this evening. The cheapo SUN cams I got with my 4 cam DVR rig 4 years ago have a much better picture than these do. These are pixelated with square blotches. Comparing 2 of these with 2 of the SUN cheapos is like night and day, with the Night Owls losing. They also make a very pronounced clicking sound when changing from day to IR, and they sometimes get stuck and will not longer stream video. You then have to un plug the pwr to resolve the issue. I'm so tiffed that I have to return these and deal with RMA. Do yourself a favor and DON'T BUY.", "Date": "September 27, 2012"}, {"Title": "Night Owl Security CAM-OV600-365A", "Author": "Camera Man \"johnny1957\"", "ReviewID": "R156I7IWYMJWUG", "Overall": "4.0", "Content": "Have been using this model for over a year. For the price this is a overall good reliable camera.  The Audio has some issues but I found that putting a windscreen (used a WindTech 900 series) on the back side of the camera improves the quality tremendously.", "Date": "June 22, 2013"}, {"Title": "poor quality", "Author": "Doug E. Heyne", "ReviewID": "R1DD1KNQU90UQ5", "Overall": "1.0", "Content": "The video quality from this camera was lacking, I have a cam-cm01-245a camera that has a much better picture in light and dark.  I would not recommend this product.", "Date": "February 21, 2013"}], "ProductInfo": {"Price": "$64.99", "Features": "Hi-Resolution Security Camera\n600 TV Lines Resolution for Clear Crisp Images\nAudio Recording up to 20 Feet Away\n100 Feet Night Vision with 50 Feet of Night Vision\n24/7 Technical Phone Support", "Name": "Night Owl Security CAM-OV600-365A Hi-Resolution 600 TVL Security Camera with Audio, 36 Cobalt Blue LED", "ImgURL": "http://ecx.images-amazon.com/images/I/41TwVGssRkL._SY300_.jpg", "ProductID": "B008VQWYKE"}}