{"Reviews": [{"Title": "Great addition to my system", "Author": "Christopher Fitzgerald \"fitzgerald69\"", "ReviewID": "R18EJSTZU6QSV2", "Overall": "5.0", "Content": "I ordered these two additional REVO cameras to compliment my 16ch system.  These cameras have better night vision than the ones that came with my REVO.  The clarity as always is great and I have full night time view of my pool area thanks to the infrared lights.  I would say I can easily see about 70 feet with these at night.  They even helped me catch my teen pranksters rolling my house with beautiful clarity.If you have a system other than a REVO, be advised they use an RJ12 connection, similar to a phone jack, only with 6 connectors.  The cameras each come with ample connection wire so there's no need to buy any unless you need over 80 feet.  Again, these are NOT BNC cameras, although they do sell adapters for REVOs that will make them work just fine.  I would just remind anyone that purchases these for a REVO system that once you plug it in, you have to go into the menu system and authorize that particular camera port in order for it to start working properly and actually get a picture.  Enjoy!", "Date": "April 17, 2013"}, {"Title": "Good buy", "Author": "Bkind", "ReviewID": "R2GXCN4C46ZX8L", "Overall": "4.0", "Content": "The picture on this camera is very good.  The cables came with the camera which I did not know.  Also the \"quick connect\" cables are the size of a phone cord...NOT a LAN connection.  Soooo...I had to turn around n order adapters to make this camera work with my system.", "Date": "March 24, 2013"}, {"Title": "things you should know first", "Author": "eric", "ReviewID": "R23H9RGS3B07IR", "Overall": "3.0", "Content": "the instructions are useless.  i used these at home connecting to a t.v...... you will need to purchase the bnc connector sold separately.  you can get them here or elsewhere, i got them at home depot. saved 10 dollars on 2.  now you will also need to buy a bnc to rca adapter.  radio shack 8 bucks per.  you will also need to make sure you have 6 pin jacks.  2 per camera unless your camera is within 30 feet or so or your t.v.  there is supposedly a way to use standard 4 pin jack but i was unable to get it to work, maybe you'll have better luck than me.  built in mic for sound??? not for this application.  sound is available if you buy the dvr made for the multiple camera system, sold seperately and its not cheap.  the daytime or lighted picture is truly awesome. the night vision is good but nothing to right home about.  if there is a light near by the picture is better.  wished i'd read this in reviews before i bought them.  hope this helps.", "Date": "May 24, 2013"}, {"Title": "Revo cams", "Author": "Jerry", "ReviewID": "R2XNAPWD5DU4KL", "Overall": "5.0", "Content": "This is an addition to the system and will provide additional coverage to the house.  Great product and high image quality.", "Date": "January 18, 2014"}, {"Title": "Great Cameras", "Author": "Thomas N.", "ReviewID": "RW87PZLMEV4BF", "Overall": "5.0", "Content": "I have a complete system and just added a couple more as they are easy to hook up and very clear images also.", "Date": "January 1, 2014"}, {"Title": "Nice Build. Needs Better Video", "Author": "H", "ReviewID": "R7XV6GWS2FKCG", "Overall": "3.0", "Content": "Cameras do not seem to have the 600 TVL as advertised. Lack the BNC Adaper. No Power Supply. Shop '\"Orange Box\"for the complete kit same price. Seem a little out of focus.... Good Night Vision. It's an OK Camera. Nice Build. Needssharper picture.", "Date": "November 27, 2013"}, {"Title": "Revo bullet camera", "Author": "handywoman", "ReviewID": "R2T4IY0WXPNFK6", "Overall": "5.0", "Content": "Purchased the camera to add to our system and as a back up in case a camera goes out. We had the Revo systems for a few years now and its great. Has held up during rain and extremely hot desert weather. Saw the price drop and the quantity low, so could not pass up on a good thing.", "Date": "November 3, 2013"}, {"Title": "Great buy", "Author": "Craigo", "ReviewID": "R3NVXECPV4JTK", "Overall": "5.0", "Content": "These cameras are truly worth buying, the price is very nice for these cameras, I will be buying two more.", "Date": "October 26, 2013"}, {"Title": "Stands up to the job.", "Author": "James Wheatley", "ReviewID": "RP9JWO1SCH6V", "Overall": "5.0", "Content": "Fast and this is what I needed for more install. I will be ordering more next month. I will also order some indoor cameras.", "Date": "June 21, 2013"}, {"Title": "Great Deal!", "Author": "Lyanna Benner", "ReviewID": "R2TPX1HV7FM7M9", "Overall": "5.0", "Content": "I bought two cables for these cameras because the description did not mention that they came with cables. Thanks :)", "Date": "March 3, 2013"}, {"Title": "Better night vision than what came with the system.", "Author": "Ty", "ReviewID": "RKF9AWE84UX3Y", "Overall": "4.0", "Content": "Good camera and comes with extra cable that wasn't in the notes. I didn't measure it but I think it's around 50-65 feet.", "Date": "February 17, 2013"}, {"Title": "Wrong wireing for system", "Author": "gwe", "ReviewID": "R3W2EL0E7QWNT4", "Overall": "2.0", "Content": "These cameras were returned as they were wired for a Revo system and not a standerd BNC wire system. I must havew missed this in the description.", "Date": "March 29, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009T0O5J4"}}