{"Reviews": [{"Title": "Don't bother.  Pay a few $$$ more for something that actually works and is in English.", "Author": "GuyOnTheAir", "ReviewID": "R2M6U1E9X60K88", "Overall": "1.0", "Content": "I've tried a few of these \"Foscam knockoff\" cameras, and this is by far the worst.I needed an extra camera to cover a part of my house, and was going to mount it to the ceiling to cover a small room.  This camera should have fit the bill.It arrived in a decent box, and properly packed.  Unlike the picture, the front of the camera base was covered with presumably Chinese characters, in addition to the metal \"KaiCong\" label that shown the picture.Upon arrival, the lens was so far out of focus that I thought the camera was broken.  Only upon twisting the lens (inside the LED area) was I able to finally get a recognizable picture.  It never became as clear as my other cameras.  Picture quality definitely gets a 1 star, and is definitely NOT HD, as stated in the title.The WiFi antenna on this unit is permanently attached, unlike some others.  Using typical software that works with other knockoffs could not find this camera on my network when attached via a network cable.  I was able to finally find it through other means, and tried to log into the interface via the Web.  (I did not attempt to load any included software.)  The Web site was in Chinese, but, as I am familiar with similar devices, I clicked around until I finally found a submenu that allowed a change into some sort of English.  But, note that this change is not permanent, only for that use of the Web interface.  Once it was translated into English, I did see a drop-down menu on the first page that allows the change to English, but again, it does not stick, and cannot be saved.  I searched around for any firmware or Web UI updates, but the various KaiCong Web sites I could find were either in horrible English and didn't yield any updates, or in Chinese, and my Web translation services were of no help.The WiFi LAN setup left a bit to be desired, but is similar to other cams.  You first \"scan\" for WiFi networks, and then you'll probably have to refresh the page, or some magic to get the results of the scan.  Then you can choose a network, and, assuming you know it's encryption type, you can choose it, enter the password, and such.  This camera does not seem to pick up the encryption type of the network automatically, which is something we almost expect these days.  You then must reboot the camera, and unplug the network cable to get the camera on the WiFi connection.  Plugging in the ethernet cable disables WiFi again.  I do not find anything to suggest that this camera will act a \"WiFi access point\" as mentioned in another review, but it was able to get on my network without too much effort.The camera Web interface does allow for panning and tilting the camera, and playing with various settings.  You can also set some presets, something I have found not all knockoff cameras allow.  Three different users of the camera are allowed, with 3 different access settings.  However, passwords for these users cannot be complex, as the camera will not allow symbols.  I was not able to find a way to turn of the visible \"infrared\" LEDs that provide low level lighting, so, if attempting to be covert, keep looking.KaiCong has their own DDNS service, so if you let UPnP configure your router, you may be able to access remotely that via their serial#.kaicong.info.Like other cameras of this ilk, the Web interface is heavily reliant upon ActiveX plugins for Internet Explorer for all features, such as audio , and such to work.  Basic viewing and setup does work on a Mac or via other Web browsers, however.The Alarm features allow the device to mail or FTP a pic when it sees movement, and this apparently can be scheduled to only happen during certain hours.  I turned on all hours, and did not test the scheduler.  Email setup was straight-forward with Gmail, and it did send out the emails when triggered.KaiCong claims to have a cloud service, which the Web UI labels \"KaiCong Cloud Platform\" at kaicong.info.  But, I can't read it.KaiCong includes a \"View where I am\" link, but it seems to only take you to a map that pinpoints a small list of cameras in China.Finally, the \"ISeeu\" app is \"free!\"  However, on the Google Play store, it costs money.  However, I was able to find a KaiCong Web site somewhere that allowed a free download and installed it on my Android phone.  The app seems clunky, and only kind of works.  One of the biggest gripes was that I had installed my camera mounted to a ceiling.  In the Web UI of the camera I could set it to flip the picture rightside up, and around so that it looked normal.  This setting was thankfully retained by the camera.  However, EVERY access of the camera via the ISeeu app resulted in those settings getting permanently changed, and the camera flipping around and remaining upside down until set right back via a Web browser.  This was a show stopper for me.All in all, I was very disappointed in this cheapest camera of it's type on Amazon.  To me, English, working interface, easy compatibility with other \"Foscam knockoff\" cameras, and working phone apps were important.  I returned my unit after resetting all settings to factory defaults.  Instead, I purchased the http://www.amazon.com/gp/product/B0079RY5AI/ Wansview unit, which doesn't have presets, but otherwise works MUCH better, and has a clear and easy English system.", "Date": "October 30, 2013"}, {"Title": "IP Camera P2P Plug and Play PNP", "Author": "Glenn A Neidermeier", "ReviewID": "R1TDFWBSV2M96H", "Overall": "3.0", "Content": "This unit is advertised as not requiring a wi-fi router. We could only get it to work with cable Ethernet. We followed all instructions and could not get the camera to operate in wi-fi ad-hoc (similar to AP) or wi-fi infrastructure mode. In ad-hoc mode, the camera appears as a wi-fi access point and my computer can connect to it, but the camera web server cannot be opened. Also tried camera in wi-fi infrastructure mode and looked for its IP address assignment using nmap with no luck. However, it works fine with cable Ethernet. Also, we did not find the pre-assigned wi-fi SSID on the label stuck to the bottom of the unit as was promised in the user manual.", "Date": "October 24, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B009GYSPDA"}}