{"Reviews": [{"Title": "Easy to setup and decent quality", "Author": "briandr", "ReviewID": "R30D4WHRH45CS7", "Overall": "4.0", "Content": "Good little camera. I already had 2 of the older 932L models and this one was easy to setup and add to the other ones in my account. This one does h264 compression so the streaming and storage of the video takes up less space than the older ones even though this one records in 720p and the older ones are 480(i think).My only complaint is that the night time recording quality is not that good, not sure what is going on but the IR is not as strong as the old ones. Considering a standalone IR to go along with this to improve the dark performance.", "Date": "June 5, 2014"}, {"Title": "Not worth the money. Less Features than the Non-HD version 942L", "Author": "Heather A", "ReviewID": "R32F4V7OBB8VPV", "Overall": "2.0", "Content": "I have a D-Link 942L that I've been using since last summer. I was very happy with it so when ready to add a new camera I decided to go for the HD version. Big mistake. The picture quality is not much better, the iOS app only allows me to view at 480p which is the same as my older camera and the \"advanced\" setup controls lack several of the options of my old camera. I'm very disappointed and will be returning this camera for either another 942L or perhaps a DropCam.The only positive for this camera over the 942L is the wider field of vision the lens gives. Not enough to justify the price difference.", "Date": "May 30, 2014"}, {"Title": "much better than Dropcam", "Author": "Observe_the_cat!", "ReviewID": "R13SO8YLKQF42A", "Overall": "4.0", "Content": "I originally purchased a Dropcam, but after many hours attempting that \"60 second setup,\" I sent the darn thing back.  I purchased this camera from a store and just ordered another one online.  I was able to set it up in about 15 minutes without much difficulty.  I've been very pleased so far - I can view the camera from my iphone and ipad as well as online (provided your computer has properly updated Java apps).  There's no lag in the video - it's all live stream, and the quality is good.  I think the night vision/black and white setting is better than the color/daytime, just for clarity (also, I am trying to track my black and white cat).  There were several firmware/Java updates necessary during the install.  Also, you can snap photos and use the microphone to scare guests :)I wish this had a pan feature, and I'm not sure if/how you can record video - the box says you can use an SD card *in* the camera, but I tried that yet.I'm excited to get the second one set up in the bedroom so I can monitor my very naughty kitty while I'm at work!", "Date": "May 27, 2014"}, {"Title": "Would not recommend", "Author": "bman", "ReviewID": "RBNKAB8LZWG83", "Overall": "1.0", "Content": "I have had many dlink products in the past. I also work in businesses everyday and recently \"tried\" to install two of theses and they are really worthless.  both setup ok.  I have them set to record vidoe on the card.  they did that fine too for one day, then the switch to PICs only no video.  tried reseting one of the two and now that unit will not attach to the wireless.  reset them, firmwared them, nothing works.  tech support if you can get through to them must be in India or somewhere cause they all have thick accents with american sounding names like john etc.  the phone line is so poor also.", "Date": "May 19, 2014"}, {"Title": "Love it very good product. I recommended for everyone. Tells a lot of the manufacturer. Nice, good for the price.", "Author": "Ivan E. Espino G. \"IEG\"", "ReviewID": "R29NQ25VMAQRLN", "Overall": "5.0", "Content": "Love it very good product. I recommended for everyone. Tells a lot of the manufacturer. Nice, good for the price.", "Date": "May 13, 2014"}, {"Title": "Quiet good", "Author": "Ricardo Ruggiero", "ReviewID": "R1UUZHFTMFF81F", "Overall": "4.0", "Content": "It is easy to install. Image could be better and so do the áudio. But it helps to see whats is going on in house When i m not there.", "Date": "April 20, 2014"}, {"Title": "Great Value for the Cost", "Author": "Kent Miller", "ReviewID": "R23MW24X3A0LE5", "Overall": "4.0", "Content": "I bought two D-Link cloud cameras and use them to keep an eye on my place when I'm gone.  They were fairly easy to set up - I use a D-Link cloud router so they are very compatible with it.  I also downloaded both the MyDlink app for the iPhone and iPad and those apps work well with the camera - though some features can only be reached when you are connected to it by  computer.  I recommend using the LAN/cat 5 cable to set the camera up - I tried setting up by following the wireless set-up and couldn't make it happen. But the wired set-up works well for the initial set and then you can unplug the camera from the wire and use it in the wireless mode.  There's a slot for a micro SD card and you can save recorded clips on the camera and view them later.  This camera has good HD quality color video and has an auto night mode which gives you pretty good quality back and white video illuminated by a small infrared light on the camera. I have 3 cats and a dog and was able to set the camera so they aren't constantly triggering the camera by their movements. You also have the ability to take still images through your computer or the phone/tablet apps.  Overall, a great little security camera for the price -  I marked it down one-star because I think they could still do better improving the set-up and some of the interfaces and features of the apps.", "Date": "April 18, 2014"}, {"Title": "No Two Way Audio for DCS-2132LB1", "Author": "Le Hoang Anh", "ReviewID": "R80G62IY4KRJF", "Overall": "1.0", "Content": "I bought two DCS-2132LB1 but mydlink Lite Mobile App (both Android and iOS) no display two Way Audio for this modem.[...]", "Date": "April 15, 2014"}, {"Title": "Difficult to install and hard to set up!!!!", "Author": "B. S. Hanne \"BEIKOZ\"", "ReviewID": "R2RKSF1C6JQ83H", "Overall": "2.0", "Content": "Good picture quality and cloud service.After 3 weeks of use and lots of time spend trying to set up the moving sensor and report, still cant activate the moving sensor for certain times and days.If the moving sensor is your base decision I would look for another solution than this.", "Date": "March 24, 2014"}, {"Title": "Terrible does not work with certain routers", "Author": "Chauncey Monk \"college kid\"", "ReviewID": "R32ZE7FVKNZELL", "Overall": "1.0", "Content": "this is a terrible prodcut i would rate it zero stars, it does not find networks, it wont work with certain routers trouble shooting is a bitch and you have to call a support staff who cannot slove problems find something else", "Date": "February 27, 2014"}, {"Title": "Setup was easy and it works perfectly", "Author": "Glenn Faurot", "ReviewID": "RT0NIK2LZ9FM", "Overall": "5.0", "Content": "Simple instructions... I did have to go back and rescan for my home wireless network but it works! It works on our Android and iPhone and PC without any issues.Disconnecting the power and moving the camera is a piece of cake. Just do it.. look for the green light when the camera connects and reconnect via smartphone.The audio is really surprising... our dogs ran into the other room to find us when we were in the room that they were already in!Excellent product.", "Date": "February 24, 2014"}, {"Title": "Poor Configuration", "Author": "Todd", "ReviewID": "R31RJRW5OKNC4E", "Overall": "1.0", "Content": "Terrible configuration screens (of which there are many, some of which can't be controlled remotely), very slow even on direction connection, buggy (can't seem to format SD card even after turning off all events).", "Date": "February 15, 2014"}, {"Title": "drops connection often", "Author": "Aman", "ReviewID": "RRNU8ZXYMWUPA", "Overall": "1.0", "Content": "I have tried this camera over WiFi with multiple brands of routers. And over wired ethernet. On all networks, it drops the connection after a few days.", "Date": "February 12, 2014"}, {"Title": "dont do it, spend a few extra bucks to be happy", "Author": "Honest customer", "ReviewID": "RA3N7E70RZ7Z4", "Overall": "3.0", "Content": "bought camera for my moms apartment, she has alzheihmers , and has a 24 hour home health aid, these people need to be watched, besides the fact its pretty hard to get it  running,  the audio does not work adequately at all, they can hear me but I cant hear them, the return audio is very choppy,  big disappointment,", "Date": "January 19, 2014"}, {"Title": "Works great, tricky to set-up though", "Author": "Edmundo Trigos", "ReviewID": "R2VFB03SCL29C4", "Overall": "4.0", "Content": "Once you pass the downloading and installation hurdles works great. I allready had one simple camera installed, now the two work fine. I think a better work with the installation guide / instructions is possible.", "Date": "December 30, 2013"}, {"Title": "Needs to be restarted every 2 days", "Author": "limitdown", "ReviewID": "R2VGB3B7VT5CRE", "Overall": "1.0", "Content": "Pros :Easy to set upPicture quality not badWrites nicely to SD cardCons:Completely freezes and needs to be restarted every 2 days (ie unplug and re-plug power)This camera would be good if it would work for longer than 2 days without needing to be restarted.", "Date": "December 14, 2013"}, {"Title": "terrible", "Author": "John", "ReviewID": "R17MWZUTN75PMT", "Overall": "1.0", "Content": "If you own a mac, don't bother. Installation process and setup is fine. but once you go into safari to actually view the camera you won't be able to. Ive been dealing with computers for 20 years and have done everything under the sun from configuring, building, programming, everything.. and i can tell you whatever is happening, its because dlink was sloppy on the mac end.. this should've been caught from day one before these even hit the shelves.. hey dlink, at least hire a crew to go to the brick n mortar stores with little stickers that say \"does not work on macosx\"", "Date": "November 28, 2013"}, {"Title": "average job", "Author": "tankgirlz", "ReviewID": "R35EF3NYSRWQEJ", "Overall": "3.0", "Content": "This camera is average. Wish it had a wider view. The speaker is not loud enough...bought this to watch dog from work. Speaker also has big lag. Mobile app and computer website show us video when it feels like it. It only works half of the time. Would not buy a second one.", "Date": "October 22, 2013"}, {"Title": "ok, but has a problem", "Author": "Brain", "ReviewID": "R10X0AOEUOB5XW", "Overall": "3.0", "Content": "The camera works ok.  I can get streaming image on iPad, android, and internet.  Picture quality is good, but I'm not so sure the night image works all that well.  I set up the camera directly wired to the router. I'd be pretty happy with it overall, but for the fact that the camera has to be reset almost daily, sometimes twice a day.  Well, if I'm viewing the image, then I'm probably not at home, so resetting the camera is not an option.  At which point, it becomes useless.", "Date": "October 6, 2013"}, {"Title": "Great Camera", "Author": "Alex", "ReviewID": "R22D9559MQYMR1", "Overall": "4.0", "Content": "Tried 2 or 3 cameras before, this one came by a recommendation by a family member who works in the IT dept. Install was very easy and connectivity is very strong. Wifi restarts it will auto connect. great cam and the iphone app is easy to use. I can monitor my cam on wifi or over cellular network. They advertise this cam as 720p, but thats only if your are using a computer to see it. on iphone its 480p.if they would advertise it differently i would give them 5 stars", "Date": "August 22, 2013"}], "ProductInfo": {"Price": "$139.99", "Features": "HD 720p clarity at up to 30 fps\nRemote viewing and surveillance management with free mydlink mobile app\nView up to 15-Feet in total darkness with IR LEDs\nEnhanced motion detection with PIR sensor\n2-Way audio (built in MIC and speaker)", "Name": "D-Link Wireless HD Day/Night Network Surveillance Camera with mydlink-Enabled, DCS-2132L (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/318TGhvbO0L._SY300_.jpg", "ProductID": "B0092KZ9AA"}}