{"Reviews": [{"Title": "GOOD !!!", "Author": "Adrien", "ReviewID": "R1MI2XZMCEM2LW", "Overall": "5.0", "Content": "i wasnt sure about this purchase, this camera is very good, better that my expensive 600TVL cams, im going to buy 3 more to replace my other 3 cams,,, this camera has a good wide viewing angle and night vision is good as well... i do reccomend these cams! thanks seller!", "Date": "February 6, 2013"}, {"Title": "Small but wide angle and good picture quality.", "Author": "REP 44 \"REP44\"", "ReviewID": "R839ONF9XS115", "Overall": "5.0", "Content": "Arrived quickly, is as described and works well for a small wide angle security camera.  Good value for the money.", "Date": "February 11, 2013"}, {"Title": "Good camera", "Author": "Jr", "ReviewID": "R8TL8F1X23GD0", "Overall": "5.0", "Content": "For the price it is a great camera clear picture day just ok at night I have a Zmodo dvr and would buy this camera again.", "Date": "January 31, 2013"}, {"Title": "Nice camera", "Author": "Cindy Vos", "ReviewID": "R1BSUURRE61FZV", "Overall": "5.0", "Content": "This is a very nice camera especially for the price.  Very clear picture.  Would recommend to anyone.  Would have liked faster shipment", "Date": "January 14, 2013"}, {"Title": "Good replacement", "Author": "p808", "ReviewID": "R3SPURF9NGTUJA", "Overall": "4.0", "Content": "Replacing standard zmodo cameras with a 20 degree viewing angle. These offer a much wider view, clear, night vision is about 65ft as stated. I'm happy.", "Date": "December 31, 2012"}, {"Title": "Great for the home", "Author": "just me", "ReviewID": "RS7RJU6BKF863", "Overall": "5.0", "Content": "Great picture quality and great field of view. The night vision is pretty clear even if there is no light.", "Date": "July 16, 2013"}, {"Title": "Wonderful camera for the price1", "Author": "John L Hooper", "ReviewID": "R3Q372001315G7", "Overall": "5.0", "Content": "Got this camera to replace one I had for seven years...much better picture than the old one...I love it.  Received very quickly", "Date": "June 9, 2013"}, {"Title": "camera Quality", "Author": "don g", "ReviewID": "R37IUKQ8YZ9JWE", "Overall": "3.0", "Content": "Night vision poor unable to see anything in the dark unlessvery close to the camera.  day vision okay for the price", "Date": "February 23, 2013"}, {"Title": "Extremely poor quality item.", "Author": "John Shelton", "ReviewID": "R16I1ONQKKN5XS", "Overall": "1.0", "Content": "Color of image on monitor is unacceptable.  Yellow tinted and not at all the color of the object.  Focus is terrible.  I cannot make out the brand and model of car that is approximately 30 ft. from camera.  (I kinda thought I might be able to read a license number at that distance.)  At night there is no picture whatsoever, just a gray screen.  (this is at the same 30 feet as the rough view in daylight.)  One of the cameras would not tighten up on the adjustment pivot ball.  This will require some kind of fabricated support.  The cameras are all just of unacceptable quality in every respect.  I will buy no more Zmoto junk nor will anybody that trusts my advice.  This was an extremely bad purchase that I will not repeat.  I will wind up having to buy all the replacement cameras from a different manufacturer.  I am appalled that Amazon tolerates this low quality product.  Never again for me!", "Date": "May 29, 2014"}, {"Title": "very poor visibilty in the dark even up close,", "Author": "andy miller", "ReviewID": "R1RLDICZ8SPKT9", "Overall": "2.0", "Content": "only worked about 5 days and quit, was lucky to see  15 feet at night,  I was not at all impressed by this camera", "Date": "May 14, 2014"}, {"Title": "additional cams", "Author": "Ivan Maker", "ReviewID": "R35STL1LMVJUS", "Overall": "5.0", "Content": "cameras work great and look even better. the video is crystal clear and I will be coming back for more in the future.", "Date": "May 9, 2014"}, {"Title": "Better than some, on par though for its price in quality. Good enough is all.", "Author": "Madashell", "ReviewID": "R1E58EESLDJCRP", "Overall": "4.0", "Content": "I bought a few different ones, a Evertech ( see the/my review, avoid it!) and this is MUCH better than it but still not as good as we need and the color is really weird in all lighting. it is barely worth it but it does have a 10% better view than the one it replaced and the night vision is the only really good thing that surprised me for this price range. It is about what they claim, which is a miracle in Chinese made stuff now!", "Date": "April 19, 2014"}, {"Title": "This is a good CCTV Camera", "Author": "Raymond I. Cook \"Hot In Calif\"", "ReviewID": "RTYIFT0PEIJJ3", "Overall": "5.0", "Content": "I am happy to recommend this CCTV Camera.It has a 60 foot cord which I wish was 100 feet but it functions exactly as I want.", "Date": "April 11, 2014"}, {"Title": "Excellent cameras", "Author": "Edgar D.", "ReviewID": "R1TJBTTMHUYTOT", "Overall": "5.0", "Content": "Good range with night vision. Very good resolution. Easy to install.  These cameras hold up very well in exterior use.", "Date": "February 14, 2014"}, {"Title": "Decent camera picture diminishes over time.", "Author": "Chris Jenkins", "ReviewID": "R2V3OPYUBJ077Q", "Overall": "3.0", "Content": "I purchased this as a replacement camera for my DVR system after 3 of my cameras got took out by a lightning strike. Iv'e had two of these for over a year now and purchased one of the Loftek brand at the same time. The Loftek is the only one I've ever had that has kept it's night vision all the others seem to go dark over time as with these. I have these mounted under the eave of my house and the get lots of wind rain and snow they also get hammered by the afternoon sun as it sets. One has gone dead after 6-8 months the other still works fine but has a off-color to the picture and completely dark in the night time the other went dark also before it died. If I was to make my purchase again I would just buy Three Loftek's and skip these as they are $3 cheaper and don't seem to last. Not a bad camera but there are better options for the price.", "Date": "January 5, 2014"}, {"Title": "Works at first, but longevity is not Zmodo's strong suit.", "Author": "D. Dunn", "ReviewID": "R3MHZFUWN9O662", "Overall": "2.0", "Content": "The cameras worked great for 2 months.  Then the screen image became more and more filled with horizontal lines and interference.  The picture looks like a TV with really bad reception.  I originally use RG6 and cat3 for power.  I use a 30A 12 vdc regulated, filtered power supply connected through my ups system.  I switched over to active video and audio BALUN network with cat6 transport.  Every camera I use is crystal clear, some have been in operation for 2 years.  These died too quickly to be of any value.I did extra prep work prior to installation such as applying extra rtv around the cable entry into the housing, double checking the lens bezel and rtv around the threads, and rust proofing paint on all exposed metal surfaces.  The cameras look pristine but electronically the cameras are crap.The price is right, but if you need longevity and you don't want to swap them out every couple months, don't buy them.  Zmodo supplies a good priced product as long as your not worried about longevity.  My Zmodo DVR has died 3 times in the first year as well.I guess it is time to move to a different brand for me.", "Date": "November 18, 2013"}, {"Title": "So So to bad... works but low quality as specified by the manufacturer. if you want a cheap product then you can get thos one. I", "Author": "Andrew Gooding", "ReviewID": "R39VDQKOY6M9IT", "Overall": "1.0", "Content": "So So to bad... works but low quality as specified by the manufacturer. if you want a cheap product then you can get thos one. I", "Date": "November 8, 2013"}, {"Title": "Pay for what you get", "Author": "B. George", "ReviewID": "R2JKOTKEJE0S3E", "Overall": "1.0", "Content": "I wasn't expecting great picture quality but the picture looks like someone ate crayons and threw up all over the screen-the colors are horrible the greens are red the reds are purple, Willy Wonka would have trouble viewing though this camera", "Date": "October 6, 2013"}, {"Title": "Zmodo CM- camera", "Author": "mike", "ReviewID": "R3EGZL4N3C9AO2", "Overall": "5.0", "Content": "its cheap and it came late , but this one , its worth to wait for , its got outstanding night vision that i like very much, so i have no choice but to order another one.i told all my friend about it. thanks", "Date": "October 3, 2013"}, {"Title": "My Cameras", "Author": "GREGORY KENNEDY", "ReviewID": "R1MZXZMH6EN5GH", "Overall": "5.0", "Content": "Cameras are Great, the view I get at night have me sitting there like I'm watching TV. Have 6 cameras love to watch can see everthing up to 65 ft.", "Date": "October 2, 2013"}, {"Title": "Zmodo Company", "Author": "JW Waters", "ReviewID": "R2KL5SPO3X76AY", "Overall": "3.0", "Content": "Bought the package that came with 8 camera's and the Video Recorder for business security.  One of the camera's did not end up working and I tried to call Zmodo for some technical help.  I called them 3 different times and swam thru there phone system for about 15 minutes each time.  I gave up and just purchased a single camera off Amazon.  They have a good product, but do not ever try to get thru to them.  We are adding more camera's to our current ones and I am going to look at other products beside the Zmodo.", "Date": "October 2, 2013"}, {"Title": "Good close up inside but OUTSIDE WAS BLURRY", "Author": "YADA YADA YADA", "ReviewID": "R2PMJKHCIMZ01L", "Overall": "2.0", "Content": "I purchased this for $20.69 on August 16,2013. (In my opinion if you pay more than this you are paying too much.) When I first got it I tested it out indoors in a 10x 15 room.  Quality was good day and night so if this is what you are looking for I would recommend.  Different story outside! Mounted it approximately 30 feet away and 9 feet up facing house. BLURRY and night vision maybe 5 feet. I had to replace it with another camera that was in the same price range that gave better results. Good luck on your camera!", "Date": "September 14, 2013"}, {"Title": "great deal", "Author": "ERIKA SHEAHAN", "ReviewID": "RB22P7ETDKHZ8", "Overall": "5.0", "Content": "happy with product for the price would recommend to anyone gret night time vision very happy with zmodo products would buy again", "Date": "August 9, 2013"}, {"Title": "fair", "Author": "Brian Bolena", "ReviewID": "RPJJHJNB83M64", "Overall": "3.0", "Content": "i was excited when i got this camera to replace the cheaper cameras that come with packages but the quality was lacking great daytime camera high quality but the night vision was way below average its built nice but it boast 65foot night vision you will be lucky to get 30 feet and the picture is poor would i recommend this camera not for night vision", "Date": "August 6, 2013"}, {"Title": "Very good", "Author": "MAF", "ReviewID": "R1KF5VNL4ZQFDI", "Overall": "4.0", "Content": "Very good product which is identical to the specifications and you my sincere thanks ..... .... ... .. .... ..", "Date": "January 11, 2013"}, {"Title": "Needs A Mod To Work Properly And No Green!", "Author": "Steve C", "ReviewID": "R1VSD4XYAHHZ3I", "Overall": "2.0", "Content": "While not HD, these are pretty good cameras for $20 except they can't reproduce green so trees and bushes look brown. The daytime picture looks good except for that and red is red, the sky is blue, etc.  Another problem with this model of camera though is the video output is too high making everything seem too bright and washed out. The standard for video output signals is 1.0 v p-p but this model is putting out 1.2 v p-p.  That means this model can't be used successfully unless your viewing device allows turning down the video input level. A lot of 16 channel multiplexers can do that but the picture will still look washed out. I found a way to fix it by replacing the 0 ohm resistor R15 on the PC board with a 33 ohm resistor. This brings the level down to the standard 1.0 v p-p. Don't try this unless you are comfortable soldering miniature surface mount components though.  Also, this model doesn't have a high gain black and white mode that it switches to at night like other modern security cameras. The daytime and nighttime pictures are not balanced, while the picture is too bright in the daytime it's rather dark at night unless the gain is turned up.  It's sensitive to IR and has a pretty good picture at night, just not very bright. The reason so many are complaining about it not working at night is they didn't turn up the gain! When you do that it looks just fine at night.Also, don't look into the LED lights that are extremely bright or you could damage your eyes!", "Date": "May 18, 2013"}, {"Title": "Zmodo CCTV camera", "Author": "Techpro", "ReviewID": "RK001M03D6G0I", "Overall": "2.0", "Content": "This is an excellent camera for the price, small and compact.  I have had it installed outside for over a month and no problems.  Night vision works well and resolution is good.  Day time color somewhat biased to blue, but not a problem.  I have other more expensive outside cameras and you would need to spend double to improve on this unit.  This cam has 1/4\" sensor.  I have found that the Sony super HAD 1/3\" sensor appears to have a sharper image at the same rated resolution (if that makes sense), but costs twice as much.Update:  After 12 months the LEDs stopped working.  Still have a video signal, but no night vision illumination.", "Date": "December 3, 2012"}, {"Title": "Zmodo CM-C22623BG CCTV 480TV Line", "Author": "Julian", "ReviewID": "R18LJ5UMGUR18T", "Overall": "3.0", "Content": "Works great while the sun is up.Night vision needs help. you will need to run a light if you want to see anything.If you need night vision this is not the can.If you need to see in day light it work perfect!", "Date": "March 22, 2013"}, {"Title": "Good buy", "Author": "Tiger51", "ReviewID": "R3099WZF6E2AXH", "Overall": "3.0", "Content": "Product is average but an excellent buy at under $20 so I'm happy with it. I may use it for a spare camera.  Images are a little washed out.", "Date": "February 24, 2013"}, {"Title": "Another piece of Chinese Junk", "Author": "Gene Thomas \"p jocky\"", "ReviewID": "R1TVYCKE5CUCG3", "Overall": "1.0", "Content": "I DO NOT reccomend you buy these cameras, unless you plan to use them in BRIGHT daylight ONLY. I bought (3) of them, and Their Night video resolution is so bad, it's just like looking thru a \"FOG-BANK\"., even with good indirect light in the area.I contacted the company that Amazon got them from, \"EZoomTek\", and they are willing to take them back, but only \"AT MY SHIPPING EXPENSE\"SAVE YOUR MONEY and try another brand.", "Date": "January 23, 2013"}, {"Title": "SECURITY CAMERAS", "Author": "GERALD J REPPARD SR", "ReviewID": "R31BYN3K9UOODC", "Overall": "5.0", "Content": "WE HAD PURCHASED THESE CAMERAS BECAUSE WE WERE HAVING ALOT OF DAMAGE BEING DOWN TO YOUR HOUSE AND VEHICLES ,SINCE WE HAVE HAD THESE WE HAVE HAD NO PROBLEMS CLEAR PITURE AND THEY WORK EXCELLENT,NIGHT VISION IS GREAT SEEING WE LIVE IN THE COUNTRY AND THERE ARE NO STREET LIGHTS I WOULD HIGHLY RECOMMEND THEM .ONE HAPPY CUSTOMER", "Date": "February 17, 2014"}, {"Title": "Ok for the money............", "Author": "Tim", "ReviewID": "R3V3VMSP7UNPSP", "Overall": "3.0", "Content": "Its not a bad camera for the money. Picture quality is good up close,but after about 10ft. or so,it gets crappy fast. I originally had two of these set up around my house. They were both pointed at my yard. They both showed my grass being a gray or a off red tint. Adjusted the focus and color functions didn't help. I have since replaced them with ZMODO CM-N12613SV camera's. Better camera. I think they would personally be best for a outside door that you wanna keep an eye on that isn't too far away.", "Date": "May 15, 2013"}, {"Title": "not so happy", "Author": "robert", "ReviewID": "R330279RCZZPIM", "Overall": "2.0", "Content": "just got the camera is not bright enought but other than that it's ok wide angle is ok but not bright", "Date": "January 30, 2013"}, {"Title": "Great camera for the price", "Author": "Coolrocketdude", "ReviewID": "RZ2LNL3DVVNY8", "Overall": "5.0", "Content": "Purcheased this camera to tinker around with - part time security in the backyard (track animal movements) and as IR camera for homeschooling - for the money can't beat this camera. Very satisfied", "Date": "January 29, 2013"}, {"Title": "Not bad, but not great...", "Author": "James Southard \"JoeCop\"", "ReviewID": "R24J5GDY2WSOCB", "Overall": "4.0", "Content": "I have been in the process of mounting video cameras around the perimeter of my house.  I have two of these mounted on one side.  They work pretty well.  The infrared is good to about 15 feet out.  They're not the clearest of my cameras, but for the price, they do pretty well.", "Date": "December 11, 2012"}, {"Title": "No night vision", "Author": "Tara Kirwan - Tovar", "ReviewID": "R1RUVHQWPYOAH3", "Overall": "2.0", "Content": "'Great day time vision. However, at night when you need it most, you cannot see anything. I placed it next to a floodlight and I can see under the light but 10 feet out nothing.", "Date": "March 21, 2013"}, {"Title": "ITS NOT AN ACCURATE PHOTO", "Author": "ZIGGYBROSKI", "ReviewID": "R111X6EDBJNTZ2", "Overall": "3.0", "Content": "YEA I ACTUALLY THOUGHT I'D AT LEAST WOULD GET AN ADAPTER OR MAYBE  GET A BRACKET FOR 2 CAMERAS THE PHOTOS SHOW ONE WHAT GIVES ?", "Date": "March 4, 2013"}, {"Title": "NOT QUITE THAT GREAT", "Author": "HMH \"hmichael0330\"", "ReviewID": "R1P62VRYMXEUVJ", "Overall": "3.0", "Content": "I purchased this Zmodo CCTV after reading some favorable comments from some of the users here on Amazon, but I was a bit disappointed when I hooked up the camera.  I bought this cam to replace a cheap $16.00 camera I was using temporarily to cover the front of the house, but when I installed this Zmodo it turned out to be even worse than the \"el cheapo\" one.  The cam itself when you take it out of the package looks nice, small, good material but the video is so lousy, grainy, with lots of color distortion, you can't tell blue from green or red looks brown etc. So, it's going back into the box and I am going to order a new and more expensive cam with CCD sensor considering that this camera is in front of the house.  Would I recommend this camera to a friend?  No.  Because you can find better ones out there if you look around.  *****Also, be CAREFUL with those reviews because someone is being deceptive here.******", "Date": "February 7, 2013"}], "ProductInfo": {"Price": "$59.99", "Features": "480 TV Lines, Horizontal\n1/4\" Color CMOS Image Sensor\nWide Angle 3.6mm Lens\nIR Irradiation Distance: up to 65'\nPackage Includes: (1) CM-C22623BG Outdoor IR Security Camera (no cable no adapter)", "Name": "Zmodo CM-C22623BG CCTV 480TV Line Weatherproof 65ft IR Night Vision Security Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/31kWmaQNeRL._SY300_.jpg", "ProductID": "B0090YOAAI"}}