{"Reviews": [{"Title": "Easily D - Links. Best  IP. Camera", "Author": "Gene Lederer", "ReviewID": "R1TM3XA22CGK3S", "Overall": "4.0", "Content": "I have over 15 D-Link IP Cameras.  Prior to that I ran a Logitech solution with 10 cameras.  Starting with the 930L  through all the recently released models.  I have 3 of the 7010's.  As you can see some folks rate these cameras from D-Link as garbage, and the next review has 5 stars.  I have more than the average persons ability when it comes to networks, computers, software and most importantly tenacity.Let me give you some advise if you are thinking of buying these or any IP cameras and installing your self.1.  If you think this might work for you with the help of \" tech support line \". Don' t buy it.  You need the ability to read and do tis yourself.  Additionally you need to be pretty good at figuring out technical problems by your self. All the documentation will get you about 70% of what you need to install a networked solution with a local cloud for your recordings.  If you are fine with just the My D Link real time access,  computer, iPhone, iPad access then someone with a good working knowledge of systems can make this work.2.  All the Cameras that are \"New\" with release dates within the last 3 - 5 months;  the firmware will not support all the cameras features properly.  It takes them until version 1.03 typically to get it to settle down.  Additionally, as they enhance the browser interface on newer models they don't go back and keep all currently \" being sold models\"  consistent from a firmware prospective, and how you use the options within the firmware.  It is a perpetual learning curve as you add additional newer models to your network.3.  The D View server software; historically it was a joke. It did not even support the models released within the last 24 months, not to mention the bugs.  However, in the last 6 months I have been amazed.  All the new cameras I bought D- View actually supported the model.  Like 7010L , 2230L, 2130L, 942L, 5222L, etc.4.  The iPhone support has gotten a lot better.  By that I mean it supports the resolution, and specific features.  The iPad app has a resolution like a 1962 TV even with HD cameras and a proper network.  It is the app, not your network.5.  The SD option on most of the newer models is a good option and works. However how it works is different with each model and not as a result of different capabilities of the camera from model to model.  Again with the lack of  a consistent approach to firmware user/ feature interface.So if you have the skill, these are great for the money with multiple options on deployment.  None of my cameras, not one over more than 2 years has failed.  Where in the world can you get 720 HD cameras with Ok night  vision IR,  SD local card support,  mic, speaker and POE option in door for $150+ ,  outdoor for. $240 or so.  My D Link at No Charge, D View network server software as well.I don' t want to insult anyone but if you think you can get all of the above plus 24/7 tech support to hold your hand and make this work for you ...... You need to hirer someone to install and troubleshoot your camera network.  I imagine if you keep it simple, like 2 or 3 cameras and are happy with just the My D Link option it can easily be done.Have fun,  \". Creative spelling complements of my Smart Phone \"", "Date": "June 12, 2013"}, {"Title": "Wow-something that works as advertised", "Author": "Brendadog", "ReviewID": "R2RQVO1LS26POQ", "Overall": "4.0", "Content": "I've tried many different surveillance cameras, and it seems none do what they say. No range, crappy picture. I am so pleased with this one that I had to write a review so others who are going through the same thing as me (buy a camera, find it doesn't work, return, repeat) can get an honest opinion. This one was easy to set up, and the picture is amazing (for a surveillance camera) - very sharp, good color, no stuttering. The camera has adjustments for color, brightness, sharpness, etc.The one thing lacking is that I wish it were wireless. I want to install it outside away from the house and can't run ethernet, so I had to get a netgear wifi adapter, but that works fine. ( just more money!)I gave it four stars only because the interface doesn't seem to work as well with Firefox or Safari - it seems to be optimized for Internet Explorer, and I can't find any help on the company website for troubleshooting. (To be fair, I think it is a brand new product, and that might improve.)", "Date": "December 22, 2012"}, {"Title": "Nice Camera", "Author": "A. Wilkins", "ReviewID": "R17Y8U7VPDRJEF", "Overall": "5.0", "Content": "Works well. I plugged mine directly into my POE switch and it came up in short order. Via UPNP presentation I was able to easily get to its built in web page and give it a static address. The ability to control the IR was important to me - would not have bought this if it didn't have the ability to NOT use the IR illuminators. I have it installed now. I intend to buy 3 more to finish out my setup. Smaller in size than it looks in the pictures - another plus for me.", "Date": "June 26, 2013"}, {"Title": "crap", "Author": "alex", "ReviewID": "R3UW4101Z30U0R", "Overall": "1.0", "Content": "camera doesn't work right- connection drops more than 10 times per day weather over poe or plugged in went through 3 ethernet cables thinking they were bad then the nightvision went out and night is the only time I need it  also the recording is glitchy sometimes it records to my sd card some times it doesn't,,, don't buy this camera too many problems", "Date": "March 20, 2014"}, {"Title": "Product is good, but support is non existant", "Author": "Paul Ransted", "ReviewID": "R9CA1XYFK8LS6", "Overall": "2.0", "Content": "I purchased this product having used D-Link cameras before. The setup of the camera is fairly easy and works well. However I received an error connecting it to my D-Link account which says nothing but contact support. I have tried a number of times over the last month to do this with nothing coming from D-Link other that an automated mail saying this is the problem number. Their site does not allow you to look up the status of outstanding problem numbers.I purchased this one to test it before purchasing another 4 or 5 but with the issues with Support I would say KEEP AWAY from this product, which is a shame as it works well if you directly connect to the camera.", "Date": "March 18, 2014"}, {"Title": "Perfect outdoor camera!", "Author": "Mommy & Tyler", "ReviewID": "R2LI45NQHU6SFC", "Overall": "5.0", "Content": "Honestly, I don't know why other people had issues with this camera.... I'm just a young woman with common sense, and a tad bit of technical/networking knowledge; I had this camera out of the box and up and running in less than an hour. The part that takes time is installation.... As it is not a wireless camera like several other cameras in the DLink family. That bothered me at first, but I think it's probably better wired anyways... I feel like the connection speed is better than my other wireless DLink and it's stable (unless there is a power outage, of course). As far as the IR sensor setting, I had to turn it off to get a better night picture because the eave of the house picked up the light and added a glare. I can see the yard just fine with my porch light on.... All in all, easy setup, nice quality, sturdy camera, great picture... Set-up, it can be either as easy or hard as you want to make it.", "Date": "March 11, 2013"}, {"Title": "expensive, slow web interface, network poe narrow view camrera", "Author": "Michael Metsikas", "ReviewID": "R1AQI9XLUI8QD4", "Overall": "3.0", "Content": "I'm a pro cctv camera installer and after installing this camera along with DLinks nvr-202 I have to say I expected much better performance and a wider viewinng angle not to mention the terribly slow web interface when also using the DLink NVR-202 recorder.  The camera quality was good, the live view on the web and on the iphone Dlink lite app was good averaging 15fps but if your trying to make this work via the nvr its painfully slow over the web interface (which is the only way to use it since there's no dedicated software supplied or available to download).For a $ 300 camera I would expect more since this is quite expensive for a color outdoor newtork/ip camera which interestingly enough doesnt have a micro sd slot at all !!!! On the plus side this camera has a very good & squality feeling build/design. Its simple to plug in to power and a network port,  download an iphone app and view the cam with decent realtime speed with very little hassle.  Even though the specs show 30fps I've experienced over a cell phone the connection in 4G or even wifi connected you get about 15fps.  Locally connected to the switch and viewing the camera gets you 20-25fps.  The web connections to this camera are about 1/2 the fps of rated but still decent for a plug and play type network/ip camera.Using the dvr DLink nvr-202 was nothing but buggy & slow again over a web interface, The web connections are slower than connecting right to a network camera and I estimate when the nvr did work you get about 5fps at best. The web interface is VERY slow to startup and slow in operationwith delays between you clicking/selecting something and it responding, Most times you have to re-load & re-load the browser from either a phone or a pc and when you finally get it viewing your camera its about 5fps.  Playing back any recordings is in military time and not so straight forward in use.  The playback feature inconsistently has gaps in its recording streams which is VERY VERY annoying.  I would NOT recommend this DLink nvr-202 device.  If your looking for a nvr/dvr I definitely recommend picking another product that works more consistently this this one which just overall annoys you and in my opinion is not worth using.", "Date": "March 1, 2014"}, {"Title": "Fancy camera design, sleek, but pretty low picture quality", "Author": "Wenge", "ReviewID": "RXAWJXJXAFZIK", "Overall": "2.0", "Content": "pretty much sums up the reason I bought it and the reason I returned it. I loved the functions that were promised on the description, and I was really looking for a camera that would upload images to the cloud upon motion detection. And even though it seemed fairly user friendly, the quality was just not there. Maybe it was the particular one I had (which calls into question QC?), but it had a difficult time focusing on items inside a room. The colors were pretty washed out... overall picture quality was below par. I wonder if one could draw any conclusions about a networking company selling optical products.. enough said.", "Date": "September 16, 2013"}, {"Title": "outdoor camera", "Author": "Flash", "ReviewID": "R3UTRT7K1SH44L", "Overall": "4.0", "Content": "arrived on time, works as advertised.unit could use a new firmware update to fix misspellings and minor functionality issue with IPv6", "Date": "March 25, 2013"}, {"Title": "This ip cam needs more refining...", "Author": "Chris Marshall", "ReviewID": "R1NM3IWDBSXSAF", "Overall": "2.0", "Content": "Decent image quality. User interface could use an upgrade.Recording to sd card and actually viewing recordings is non-intuitive or quirky.Using this cam for h.264 live streaming did not work.I would look at other manufacturers before buying dlink.", "Date": "June 2, 2014"}, {"Title": "Works great", "Author": "Steven S", "ReviewID": "R1K7DYOXHEM7QM", "Overall": "5.0", "Content": "Installed outdoors easy, setup quickly using D-Link install wizard. Good quality video, saves event recordings to my NAS. Everything I was expecting.", "Date": "May 19, 2014"}, {"Title": "Buggy interface, but may work for your needs", "Author": "T. Clark \"TC\"", "ReviewID": "R2CKB5P2O38RAE", "Overall": "3.0", "Content": "I did not find the camera difficult to physically install, but the web configuration interface was buggy. The quality of construction is pretty good for a $300 camera. The picture quality is inconsistent between cameras. I have one camera that is crystal clear and two others that are so so.The viewing web interface is super buggy and sometimes it works, sometimes it doesn't. I use a Mac and the only web browser I can use is Firefox. Forget Safari or Chrome as it won't work.  We use the iPhone app and sometimes it works, sometimes it doesn't. Sometimes one camera comes on, sometimes two will work, and sometimes all three will work. Like everything else, buggy.I have micro sd cards in each camera for constant recording. I also have a hard drive inside my house that I use for constant recording using the optional recorder that is sold separately.I gave this three stars because it sort of works for my situation. It is a half baked solution and you have to be a nerd to make it work. My house came prewired with Cat5 wiring all over so installation was a breeze using the power over ethernet feature it supports. This is where my network switch provides the power to run the camera.While reliable live viewing would be nice, the main reason I got these was to be able to go back and see what occurred at an earlier time and I think this will be fine for that purpose. It is really too bad that D-Link did not try a little a harder they could have had a really nice solution.", "Date": "March 30, 2014"}, {"Title": "Excellent camera to add to Dlink system. Decent night vision", "Author": "Kc", "ReviewID": "RRSOX3YMS7Q0X", "Overall": "4.0", "Content": "Not wireless, you must run Ethernet. And power. Unless you have POE.Great daytime 480 pic. Decent nighttime video. If you have outdoor lighting it will effect the picture, almost better with less light at night.Can see license plate detail during day, at night you can make out types of vehicles or basic profile of people on your property. Best if used with server to record longer periods before rewrite.Would give 5 stars but the night view lacks a little. I might add additional infrared light to see if this helps.Dlink server is good, you might need to reboot camera occasionally by cycling power. Maybe 1-2 times per year? Not sure why but my router drops the camera occasionally.", "Date": "March 28, 2014"}, {"Title": "Nice Outdoor Camera", "Author": "Andres V. Del Castillo", "ReviewID": "RFOJ7OJUZ9M9X", "Overall": "4.0", "Content": "After going plenty of research on outdoor IP PoE cams, I decided on this one.PROS: PoE, local storage, NAS support, Web based config, remote viewingCONS: viewing previous recorded video is only supported on the local storage (sd micro).  It would be nice if I could review video from all the support medias or at least the NAS driveOverall I would recommend this to others and I do plan on buying a couple more.", "Date": "December 21, 2013"}, {"Title": "Pretty good camera", "Author": "hjs", "ReviewID": "R2RFMDCVX94GME", "Overall": "3.0", "Content": "Works with the D-Link Surveillance system (Cloud Storage 4000).  Software needs work.  Must delete files individually..  Cannot just delete an entire folder without deleting the files first.  No automatic deletion of files.  Once the SD card is full the camera stops recording.  Very limited settings for motion detection and recording times. The settings for motion detection yields either everything or very little.  Picks up cloud motion (changes in lighting) but not people standing in my driveway.  Stops recording in the middle of some recordings.  Excellent optics.", "Date": "March 16, 2013"}, {"Title": "Nice camera.  Software so-so.", "Author": "D Mac", "ReviewID": "R1BP97Y1S1HRSI", "Overall": "4.0", "Content": "The camera was pretty easy to set up and get running.  Image quality/color is great.  Night vision is better in complete darkness.  Background light from street lights and landscape lighting limits the night resolution.  D-Link's basic cloud software is super easy to use, but if you use the advanced management software, it is a little difficult to get through.  After an hour with technical support, I found out that I could not set up the software to record to my PC hard drive, only the SD card.  I decided to use Blue Iris software to manage the camera and everything is working great.  Would have been 5 stars if the software was more flexible and intuitive.", "Date": "April 8, 2013"}, {"Title": "Horrible, stay away!", "Author": "Andrew Greenfield", "ReviewID": "R1238DW57J5I5H", "Overall": "1.0", "Content": "I have been a profesional wedding photographer for the last 18 years.  I have been a Network Engineer for the last 15 years.  I also have gone thru many IP cameras for my house and others.  The only good news on this camera is that the build quality and menus are reasonably decent.The bad news is that while the {still} images are good, it is a HORRIBLE motion camera -- and forget using any Mac OS for it, as the codec used for all of the streams is PC based, and thus Mac web browsers are going to be out of luck.The latency and the inability for the camera to do any IR/night images is pretty bad.I would stay very much away from this camera, I just returned mine after a frustrating 2 hours.The only saving grace would be if they fix the above with a HUGE firmware fix, but somehow I think it will need a new cpu/processor, as the latency and video issue are not just from the codec, but the processing itself.--Andrew", "Date": "December 23, 2012"}, {"Title": "Great hardware, poor software.", "Author": "CG", "ReviewID": "R3SIWCN14N5XUB", "Overall": "4.0", "Content": "Cameras are very well made. Software was not included inbox, so I needed to download from their website. No documentation on the software whatsoever.. Going to try out the open source ispyconnect software instead.", "Date": "July 4, 2013"}, {"Title": "Has Issues!  Don't waste your time buying.  Support from DLink Is HORRIBLE!!", "Author": "IPVS", "ReviewID": "R258ZDG1I8TFE0", "Overall": "1.0", "Content": "First off, I work with IP Cameras for a living using them to stream live video for entertainment purposes.  I've messed around with this camera for over 6+ hours.  It has issues big time!  Unfortunately, I am unable to maintain a stream to the camera.  It chokes and the video stalls constantly.  No matter what settings you set within the camera, the metadata reported with the stream doesn't match what it is actually producing.  Tried to call tech support... I was disconnected 7 TIMES!  Don't waste your time.  They have obviously released a product before it was ready or properly tested.", "Date": "April 25, 2013"}], "ProductInfo": {"Price": "$389.99", "Features": "HD resolution (1280 x 720) and up to 1M (1280 x 800)\nRemote viewing and surveillance management with free mydlink mobile apps\nDust proof and protected against mid-pressure water (IP66 certified)\nHD 720p clarity at up to 30 fps\nView up to 30 feet in total darkness with IR LEDs\nVirtual pan, tilt, and zoom functionality\nEnhanced motion detection with PIR sensor\n2-way audio (built in MIC and speaker)\nDigital In/Out control ports to connect door alarms\nLocal video recording with microSD card slot\nEasy installation and flexible placement", "Name": "D-Link HD Day/Night Outdoor Network Surveillance Camera with mydlink-Enabled (DCS-7010L)", "ImgURL": "http://ecx.images-amazon.com/images/I/41jvgp1MbKL._SX300_.jpg", "ProductID": "B009JBFLH8"}}