{"Reviews": [{"Title": "G755, You get what you pay for", "Author": "Audiodave1", "ReviewID": "R1AERM4Q9AIRG1", "Overall": "4.0", "Content": "After reading some of the less than glowing reviews I was a bit apprehensive about purchasing this system but did anyway knowing I could always return it.We live in a nice neighborhood that, lately has been attracting opportunist, petty thief's. I just wanted to know what went on while I was sleeping or away.I am fairly technically inclined so setup worked out without a hitch. I experimented with temporary camera mounting locations outside for about a week to get an idea of the limitations of the system.The system works well. Daylight video quality is good, night time is ok but you are not going to recognize a face on a moving person even with the adequate IR lighting. Also note that the IR lighting is pretty focused and if there is an object lit up closer than what you are trying to see (say, a shrub) the brightness of the background image will be dark @ night. Regardless, you will at least see what is going on. Regarding the video quality, this is not the free flowing video you see from a camcorder/Youtube/cell phone video camera. It is much more coarse. 3-10 images a second depending on signal strength. It is adequate for the purpose.I ended up purchasing 2 systems + an extra camera. 5 cameras total. Note that a camera can only sync to 1 screen.The internet viewing of live video is ok from my galaxy tablet or work PC. No audio is transmitted thru web access.I really like the \"tablet style\" interface. Carry it anywhere within camera range for viewing and makes camera aiming a breeze.  Viewing, sorting (by camera) and deleting video recordings is pretty easy.The motion detection/recording works pretty well. Fast changes in lighting will trigger it as will a bug flying in front within 4' on low setting @ night (snow and rain will trigger it too). Reflections of car headlights on windows or surfaces will trigger it along with moving branches....but so will something like a cat in the dark.I have had 2 screen lockups that required a 3sec pin hold in the reset button.Wish list:Wider range of motion detection, not just hi-lo-off. 5 steps would be nice.An actual alarm that would sound if motion was detected. The thing has an alarm clock built in but no alarm for motion...silly. Maybe a FW update will fix this in the future. The only really stupid omission...Would like to see the same camera on 2 screens.The audio is choppy at best and generally unusable. Oh well, bonus \"non-feature\".As the title says, you get what you pay for.I have about 800 into my system(s) and am happy.You must recognize the limitations of the wifi-ish transmission method.  You need to pay attention to how much structure you are transmitting thru. 3 walls is about the max @ 50', I have ordered a higher gain antenna for 1 camera that is quite obstructed, 2 bars works ok but more gain is needed for a higher frame rate.This is not a $3000 hardwired system with all the bells and whistles but it might just fit your needs like it has mine if you understand the limitations and work within them.Aug-2013 update. Still happy with the system. I have 6 cameras now. The phone app was recently updated and is more stable now. Bought bigger memory cards for both bases. The summer bugs continue to be drawn to the IR @ night. Minor annoyance but I rarely watch every recording for a day unless there is good reason.", "Date": "February 10, 2013"}, {"Title": "Uniden G755, Incompatible with Windows 7 64", "Author": "HenryM", "ReviewID": "R1TPOWA8K2TZYX", "Overall": "1.0", "Content": "Having purchased the Uniden Guardian Camera surveillance system model G 755, I am extremely disappointed with it's performance, or lack therof, together with a lack of support from Uniden Co. Having said that, if you are buying the system to monitor a baby, or maybe if you have a retail store and want to see what is going on from your office at the back, then I think you will be happy.I had intended using this for home security and found it gave a good picture of the 200' driveway leading up to the house. I installed the monitor in my home office and hooked it up to a desktop PC through a router. In addition to the picture on the monitor I was able to get a clear picture on my computer monitor. The software provided for the ability to record from the pc either continually until stopped or momentarily for a snapshot, and to store such images on the computer hard drive.  No matter what I did and how many times I downloaded the software and reinstalled I could not make this feature work at all!  I also installed the software on a laptop but could not get an image of any kind. In fact I tried it on three different laptops without a result.  I also tried installing it onto another desktop pc at my office for remote viewing - again with no success, even though this was hooked up to a differnt isp to that at my house.Uniden's website advised to make sure that the software used was current and to compare the version with the current one. However, there was nowhere on their website showing the version of their software available for download. I came to the conclusion that there was only one version, period! There were no updates in spite of claims to the contrary.Frustrated with the time and effort I had put in, I emailed Uniden with details of my experience with remote viewing. Their site stated that I would receive a response within 3 days. Two weeks later I have not had a response. In desperation I phoned them and was on hold for 40 minutes, I finally got through to someone who did not seem to have a clue and totally unfamiliar with the product. I was put on hold another ten minutes before I had someone who was familiar. Bottom line was that he seemed to think that the problems were because I was using windows 7 64bit. Funny thing I did get an image on my home desktop but not with any of the other laptops, all of which were running the same OS. I was told that they are working on a solution but at that pont cannot give any timeframe, but would email me when they have a solution!Following that useless contact, I tried installing it at my office onto an old pc which was running Windows XP, and yes, I was able to view the image remotely, although the snapshot and record functions did not work. As all of my laptops are running Windows 7 and I have no intention of downgrading those operating systems, I am returning the Uniden System, and will make a point of not buying anything made by that company again, not because I have experienced bugs but because of their deplorable customer service.", "Date": "October 18, 2012"}, {"Title": "Good compact security monitoring/recording system w/basic remoting capabilities", "Author": "Pragmatic", "ReviewID": "R4M4HJJL4W7U8", "Overall": "4.0", "Content": "This is a good, basic, easily set up home/small business security system with basic recording and remoting capability to a smart phone etc. (if connected to a router for web access/communications). The system has good, but not high definition resolution of 480 X 272, 320 x 240 (QVGA). The cameras have B&W; night vision capability out to ~40 feet (20 IR LEDs, low light sensitivity or 1-8 lux) and the picture sensor is a OV7725 1/4' color CMOS technology with a F3.6mm H:55 V:44 lens.Display: The portable 7\" display is very convenient and a great feature but its rechargeable battery is limited to ~ 5 hours before needing to place it in the data/power cradle for recharging - so it will not make it through an full eight-hour or more business day. You need to plan to have the cradle/dock attached to AC power in a central/primary location in your home or business.Range: The system claims an operating range of up to 500 feet (152 meters) in open/line-of-sight situations but depending upon building/wall construction ranges can be as short as 50 to 200 feet. The cameras conveniently have industry-standard SMA RF connectors and you may want to get better rated (dBi) directional antennas (e.g. 5dBi panel) if you are experiencing a reception problem with one particular camera due to interference or attenuation (range, building/wall construction). Auxiliary/higher-performance antennas or amplifiers are available at RF/WiFi electronics vendors or via Amazon. One popular antenna brand is Alfa. Be sure to get the correct SMA gender connector. Foscam antennas, as an example have reverse SMA gender from industry standard, and will not be the correct SMA gender for the Uniden cameras, while the (example) Alfa antennas generally will be correct.Power: While the system is wireless for video/sound, it does need wired 120vAC power for each camera and also the 7\" diagonal (4\" for G455 system)  cordless/portable video display's data/charging cradle. The system cameras and display unit charging/data cradle use (120vAc to 5 vDC 1 amp) \"wall wart\" power supplies. Each power supply has a 6 foot cord and the camera cords include an additional 6 foot extension for a generous total of 12 feet for the cameras. If you don't need the extension for a particular camera, you can use in on the display cradle cord. The display (not cameras) has a rechargeable lithium-polymer battery that recharges when display is in the cradle/docking station. Display battery life is up to ~five (5) hours.Additional Cameras: You will likely want to get two expansion cameras for a total of four cameras. The display can pair to these and display them in a quad (4) camera display. Be sure to get the newer Uniden FHSS cameras specifically compatible with the G455 or G755 systems because they are newer/different than the older less expensive Uniden cameras. The specific expansion cameras are CG45 in black, and CG45W in white available on Amazon or via other vendor. The basic G455 and G755 system comes with two black cameras. The cameras other than outside color are identical in function and appearance. Some reviewers complained of new/additional camera pairing difficulty but we experienced none of that - pairing very easy simple/quick. From the pairing camera screen, tap image 3 or 4 (1& 2 are pre-paired at factory for you), then during the 60 second count down, press the pairing button on the new un-paired camera. Repeat for the fourth camera as applicable.Storage/Recording: The G755 systems includes a 4GB SDHC memory card good for ~60 hour recording and can be upgraded to 32GB SDHC card (currently Jan 2013 ~$22) equating to ~480 hours of recording capacity.Summary: We feel these systems should be also offered with four camera as a value package because at ~$130 each, two expansion cameras boost the total system cost to just over $600 which is not insignificant for a system of these modest capabilities/specifications (and is approaching low-end commercial security systems prices that have full-up DVR capabilities), thus overall 4 stars vice 5 for value.", "Date": "January 11, 2013"}, {"Title": "Uniden Guardian G755 (Camera Good - Support BAD!)", "Author": "Bradley H. Fredrick \"FredrickUSA\"", "ReviewID": "R9SLSYA357GTQ", "Overall": "4.0", "Content": "The cameras set up easily. Only issue I had was a wasted 45 minutes getting the cameras to sync with the unit. I kept thinking to myself, this has got to be easier. I'm a network and computer dude with a Masters degree, and couldn't get these to see the base unit.Then, I simply unplugged the cameras, let them reset, and 20 seconds later they connected. So, if your cameras dont sync with the base unit, unplug them and let them resync.I also added two additional cameras (ordered from Uniden as they shipped immediatly and for same price) Amazon appeared to show a long delay in shipping. These cameras synced perfectly in just about 20 seconds each as described in the included manual.Pro's: Set up is pretty easy; good portable stations. Can zoom in on camera and hear audio.Con's: Not sure yet if audio is recorded when cameras record on motion detect. Customer service is pathetic. had problem getting unit to sync online over Internet. Kept getting errors. Typed up issue to Uniden, 7 DAYS LATER they responded with \"What OS?\" That's it. Thank goodness my house wasn't on fire, really Uniden, 7 days. That was pathetic! Other Con, recorded videos are .mp4 (not that big a deal) but they're only 320x200 sized, and that's a bit small for detail. Also, understand that each time the unit records from a camera, that's s separate video. So each day a folder is created for the date by the unit, and you can literally have hundreds of files in there. Problem is, how to you link them into a contigous file for easy viewing without having to open each video to view them. I sitll have not found a FREE app to do this but am still researching. Would be nice to drag and drop the days videos into an app and have all of the .mp4 files strung together. Lastly, the unit will NOT automatically overwright the SD card. I find this a flaw. You must monitor your card usage. I found 32GB SD cards in the low $20 range, so I bought two.I wish the unit had the capacity to 1. Record to a higher resolution, 2. Record to an unattached data store (NAS drive etc.) 3. Would overwrite the card storage automatically, 4. Give option within own software to string the day's videos into a single viewable stream. IF Uniden could fix these, it'd be the perfect system.Installation was easy enough with a long drill bit. When going through the walls, of say a garage, leave bit through the wall on the inside (drill from outside to inside) then before removing the bit, tape a string to the end of the bit. Pull bit out, and withit comes the string. Next tape end of string to end of the camera connection cord, then pull string back through, thus feeding the power connector into the inside of the garage etc. Remember to use a drill bit big enough to pull through the knunckle of the power connector, so use at least a 1/2\" paddle bit. Get a long paddle bit with at least at 10 to 12\" shaft on it. Then the job is super easy and much faster with two people to tape string and pull back through, or you'll be up and down a ladder a few times for each camera.Bradley", "Date": "November 8, 2012"}, {"Title": "Not a good unit for security", "Author": "Reviewer 1", "ReviewID": "R35TAD079YJC9L", "Overall": "2.0", "Content": "I would suggest that you read other reviews carefully before purchasing.  I purchased this unit at a big box wholesale club (and later an additional camera from Amazon)  after reading some of the reviews assuming that I could overcome some of the issues.  The sad part is this unit could be a really good unit for the price except the manufacture seems to not invest any resources in making the unit better.  I believe this unit was built on the platform that they build for baby monitoring.  As a baby monitor it would be great; but the inability to use any other third party monitoring software is a red flag.  Also the Guardian II app for droid is weak and has only on feature (snapshot the ability to capture an image from the camera to your droid phone.  In summary this unit is in need of a serious software refresh (company has indicated no refresh is coming)Pros1 Very affordable2 Night vision pretty good with some background light3 Easy to install and set up4 Touch screen easy to use5 Good field of visionCons1 Images not very clear (not able to distinguish faces from more than 5-6 feet away)2 Not engineered very well.  My unit has a very random performance  My #2 camera stopped recorded for a period of time with no warning or notice3 The e-mail alert systems STOPS WORKING FOR DAYS at a time4 The software is proprietary and does not work with ANY other monitoring software5 The System does not have the ability to be viewed by a larger monitor6 The e-mail alert (when working) can only be sent to one e-mail address7 No ability to send e-mail alerts to text8 The recording unit does NOT provide time of events (big deal)9 E-mail alert is slow and random10 Motion (even on lowest setting) is triggered by small bugs11Recording does not play back sound12 Customer service takes days to return a phone call or e-mail (in some cases not at all)13 Monitor has poor battery life14 Guardian II  droid app does not load the current image but loads the page with the last image (from the last time you logged in)15 Guardian II drops connection frequently16 Guardian II app is very slow17 App does not allow scanning of all cameras on system( must manually move from camera to camera which takes a while)18 Can not connect to cameras remotely while its recording (kind important if you get an alert and want to see what's going on)", "Date": "July 29, 2013"}, {"Title": "Nice product but kills wifi network", "Author": "josue gutierrez", "ReviewID": "RZKO1VKV5AV0B", "Overall": "2.0", "Content": "I bought the unit 1 week ago and setup was a breeze, but if you have a 2.4 / 5ghz wifi network the unit will cripple you wifi network and cause major interference. snippet from review article that confirmed my suspicion.\"As we mentioned earlier, you won't want to position the cameras too far from the main base unit. The specs say they can do 150m, but we found the range to be much less in our test environment at the office. The cameras run in the 2.4GHz frequency spectrum (using frequency-hopping spread spectrum and encryption), and they can, in some instances, cause interference to your wireless network (unless you are running a 5GHz Wi-Fi network). We noticed this after experiencing very slow file transfers (under 500KBps) to one of our laptops while the Uniden Guardian was on, and faster transfers (up to 10MBps) while the unit was off.\"I will be returning the unit back to the vendor because I simply can't use my wifi network when this unit is operating.Hope this helps.Best regards.", "Date": "November 3, 2012"}, {"Title": "UNIDEN 455 GOOD...but...", "Author": "Edgar Milford", "ReviewID": "R33OI7ZTKHP41R", "Overall": "3.0", "Content": "I purchased the 455, which came with two \"outdoor\" wireless cameras and a small base station with plug-in video monitor/touch screen controller. The base station has ability to connect to your existing internet router by a wire. The monitor acts both as a method for viewing any or all of the cameras linked to the system (you can purchase another two cameras for a maximum of four). While the monitor is docked to the base and connected to the internet, there are no images available on the touch screen... but the assusmption is that when you dock the monitor, you will be accessing the images over the internet. The monitor has batteries, so you can carry it around locally and still view images from the cameras. You can choose to see all four cameras at the same time in quadrants, or touch one of the camera images to just view a full screen image from that individual unit. Can also take advantage of limited \"zoom in\" feature, which enables you to make part of the image fill the whole screen. Image quality is good. The Infrared night vision feature is good. The two outdoor cameras that come with the kit are moderate sized. I bought a third \"indoor\" cam which is much less obvious.Accss with the iPhone and iPad internet apps is good, though the software makes you do two rounds of confirmation of what site you want to view and what camera. Does not appear that the iPhone software allows all of the functionality of the touch screen. The system does not have two-way audio, in fact I did not hear any audio one-way over the internet either! I have not been able to access the video using my desktop Mac or my portable Mac, and woner if access over internet is limited to a smartphone or PC.I have not rigorously tested the motion detection features of the system, and I do not think that the system has noise activation of the audio or video recording, though I might be mistaken. The system does not have a provision for active notification when motion is detected. The system is ok, however some software updates to deal with these problems are warrranted.", "Date": "July 14, 2012"}, {"Title": "Has a major flaw, horrible support from uniden", "Author": "Chris Bunting \"Chris\"", "ReviewID": "RNCS90JPOCVWH", "Overall": "1.0", "Content": "This system has potential, however Uniden doesn't wish to support it properly. A firmware update is needed to allow the sdcard to overwrite when it gets full. any surviellance system has this basic feature, yet this one doesn't. The response I got from support was \"our newer models support this\", when asked why this is their newest model and it doesnt support it, they responded with \"this model does not have this feature\" As far as I'm concerned their support is absolutely worthless", "Date": "June 18, 2013"}, {"Title": "Nice camera but poor software", "Author": "Steve \"linuxisfree\"", "ReviewID": "RJEE1OWPH5Z80", "Overall": "3.0", "Content": "Set up was a snap as the cameras came pre-associated with the base unit.  The image from the cameras is very good even at night.  I have one pointed at the back of a house and from thirty feet away the night image is bright and clear.I am a bit worried that this system will interfere with wifi networks.  If I keep the cameras much longer I will pull out a spectrum analyzer and measure the impact on the wifi frequencies.  Keep in mind that wifi is designed to deal with interference and that current wifi standards support two different frequency bands and these cameras will only impact one of those two bands.  It would be nice if Uniden was a bit more informative about this on the packaging.I've had a large number of software issues with this device:-Their web site, when it is even up, will not accept the DID of our unit.  This makes it impossible to register for the online service and thus far I've not been able to reach the phone support staff, mostly due to my schedule and that they don't have 24 hour support for their camera systems.-The touch screen device is buggy and many menus do not work when the unit is connected to the internet.  I need to disconnect, open the menu, then reconnect the network.-The device will not download software errors, claiming an unspecified error.  This occurs regardless whether I allow DHCP assignment of a network address or manually assign the network addresses.-Speaker function sounds rather scratchy and noisy, not sure if it will be usable.  This is true on both cameras, inside or outside of the house.-Website for registration wants your address, which seems dangerous as once their website is hacked, other folks may end up being able to see your camera output (so change your system password) and know where the cameras are located.  Your camera's IP address may also give away location information too.-Internet Explorer browser support only.  Really?  So I guess those Chromebook and MacOS users are just out of luck.  It may be that standards based programming was beyond the skills of the software engineers, in which case what other parts of the code are sub-par?-SMTP is greate, but why not also support microsoft active exchange sync?The power switch on 4 inch display unit we have is a bit sticky.  Not sure how long it will last.Not sure how well the internet viewing works as our system DID is not accept by the portal website.  The manual says the cameras can be viewed on your local network without an internet connection, so I'm hoping they'll also be visible to the internet via appropriate configuration of DynDNS and firewall rules.Update:The portal site had me download a firmware upgrade and using the SD card sideload it into the display device.  This worked fine, but the DID the portal claimed it would give our device was not seen, the DID remained the same.  Funny thing is that the instructions for the upgrade assume the DID will change and gives no steps for when it doesn't...So first problem is the upgrade and the instructions are a fail.  Second problem, why doesn't this device upgrade itself over the internet like say a Roku does?Update 2:Finally got the portal to work.  Think I had to use a number different than the DID, but now I can see the cameras on the internet so I up'ed the review by one star.One camera failed after a couple of weeks and sending it back was no trouble at all.  After a few more weeks I received a factory refurbished replacement.  Not new, but at least it works.Discovered that the memory card fills up and there is no automated method of deleting older videos.  I had hoped the oldest would be over written by the newest.  Software still feels a bit beta and non-intuitive, including the app.  If the company releases a decent software upgrades I'll revisit this review.Cameras work great at night.  Not sure if I'll buy any more of them or try a different system.", "Date": "May 12, 2013"}, {"Title": "Can't View Recorded Videos", "Author": "Keith Sharp \"Keith\"", "ReviewID": "RJT0P14C83EGZ", "Overall": "3.0", "Content": "Guardian stands watch for me, recording activity in two minute blocks every time motion is detected.  It will record video from up to four cameras simulataneously.  But viewing those videos is problematic!First, on-line access via computer and smart phone is ONLY for live streaming video and it is one camera at a time.  Do you want to see if anyone broke into your home while you are on vacation?  Sorry, you can not access any of the recorded video remotely!  And any decent thief will pull the cameras off their mounts, taking the receiver, including all the videos with him.  Also, if he cuts the AC, there will be no video as cameras have no battery backup.Second, you are supposed to be able to view your recorded videos on the system's receiver.  I am able to see a few of them, but apparently not all of them.  The only way I've been able to check the activity on the videos is by pulling the SD card out of the receiver and putting it in my computer.  Then I can easily sort thru the videos.Don't be miss led by the malarky about an alarm, siren, etc.  It functions as an alarm CLOCK!  That's it. The system will not alarm when motion is detected in the living room at 3 AM!  It will take a nice picture, though.  If the receiver is still there you'll be able to see who messed with what while you were on vacation or sleeping.Set-up went ok after I got through to customer service 1 800 297 1023 for a few minor questions.  The number listed in the manual is not a working number  I just used a generic Uniden number I googled and after 20 minutes they transferred me to a tech who was very helpful.I got everything set up, mounted, connected to the internet, working on my Windows 7 computer and iphone 5 in a couple hours.  But internet access is of almost no value since I can't access the stored videos.Also, while connected to the internet I had no interference issues with my other internet connected stuff, as others have reported.The video quality is OK.  It's not as good as iphone video but better than a jerky webcam and I agree with other reviewers, the camera's night vision is remarkeably good.  The cameras also send audio to the receiver.  Too bad the audio is NOT recorded, though!Got the 755 system for $300 from Costco, after using Costco's $50 coupon.", "Date": "November 26, 2012"}, {"Title": "Uniden Guardian G755 - Excellent!", "Author": "RWallace", "ReviewID": "R348WUICQSSASZ", "Overall": "5.0", "Content": "I was looking at several security cameras and systems - I actually found several that can hook to your PC via web browser and piggyback on your home wifi for connectivity.  I had to return them all.  They all did not work with the latest wifi \"n\" and that means you have to back down your wifi to b and g band only, and then the connectivity on 3 different models were not very dependable (even in the same room as the router!).So I continue to look on line and decided to give this one a try via Amazon - and would return if it didn't work (which I expected it not to - like the others I have tired.)Well it is by far the best system I could imagine - and worked out of the box (including 2 extra cameras) 1000% better than what I even hoped!1.) I love having the 7inch touch screen that is portable - very nice to take with you rather than being tethered to a PC in our kitchen or one of the other PC's in the house as the other cameras that I had were somewhat limited and did not have a portable monitor.2.) Having its own dedicated 2.4ghz wireless built into the monitor - AKA it's own wireless all-in-one system.  Meant that I didn't have to try and tweak my current system of 1 main station and 3 repeaters to make the cameras work.3.) Range is good - we have a 7500 sqft house in which the monitor is primarily at the center of the house in our kitchen work area.  While the range is not 500 foot, it is most likely around 200 if you have a few walls in between.4.) You turn it on, it took 3 minutes to pair the other 2 cameras I bought with the included 2.  This system is up and running in 10 minutes or less - it will take you longer to unpack than to get up and running.5.) I spent 2 more hours setting the cameras up outside at the 4 entries to our residence and it works great as a remote viewing station to see who is at our doors, UPS drop off area by our garage, pool area, etc.  very easy to install on the mounts and 4 screws and were ready to go.  You will have to have power plugs relatively close to the cameras to get power.6.) The clarity is awesome - very clear at day and remarkably clear at night.  I would give it (compared to the others I tested - when they worked) a 8/10.  It is on par with cameras that I tested in the 300 each range - but for much less!  The night vision on these are better than any I have seen and good range of 30 - 40 foot night time visibility.7.) I am please with the handheld unit and the functionality of it, pretty easy to use and configure different settings.If you are looking for a great system with all the needed functions of a very good security system - snag the uniden advance wireless (7 or 4 inch) both are the same product with just a smaller monitor on the G455 unit.  You will be please with your purchase - as I know I am!", "Date": "January 5, 2013"}, {"Title": "No remote access for motion detection clips.  Other issues....", "Author": "Spumanti", "ReviewID": "R1VM0CBR4PV6MJ", "Overall": "2.0", "Content": "I bought the Uniden Guardian G755 at Costco.  My biggest gripe about this product is that there is no way to remotely view the 2 minute motion detection clips that the system records on the SD card.  Yes, I get the e-mail notifications - or in my case, MMS messages to my phone, but they do not include the 2 minute mp4 clip, and there is no way to access these clips remotely.  So, I don't actually know what set off the motion detection alert.  I have the app to view the real time surroundings from my Android phone, and it works fine, but the inability to view the motion detection clips is a deal breaker.Note also that this system does not capture motion detection images, either, so when it sends you motion detection e-mail notification it consists of nothing but a text msg or e-mail that says \"Motion dectected by your Uniden Guardian system.  Camera x\" and a timestamp.  This is all you get - no image, no video, and no remote access to your saved image or video.  So, there's no way to know who or what set it off if you are away from home.  Frustrating.In summary, it seems that the product may have future promise, but the software is currently lacking.  Therefore, I will return this system to Costco.EDITING TO ADD OTHER PROBLEM:  The latest problem I'm having is with the touch screen.  It is often unresponsive or it behaves erratically and starts selecting opposite ends of the screen from where I am touching.  Then, it wants to recalibrate but tells me calibration has failed.  I am having to use a pin to hit the reset button frequently just to get out of calibration mode.  Again, I will probably return this to Costco.Some positives....I have since bought a Foscam IP Camera - I like that I can access motion detection images and video remotely.  However, I must say that the Uniden G755 image quality is better, and the motion detection works way better - it seems to actually capture 2 seconds before the actual trigger where Foscam is always late on the capture.  This is a really nice feature.  It's too bad these Uniden cameras are lacking in other essential features.  The Uniden G755 seems only useful for people who are at home monitoring areas of their house.  It's pretty useless as a security system when you're not at home.", "Date": "December 28, 2012"}, {"Title": "Waste of time Uniden Surveillance G455.", "Author": "anthonyg", "ReviewID": "R2NJWA7AB66Q0S", "Overall": "2.0", "Content": "I wanted to get this one because it's one of a few that record to it's own system w/o requiring a PC to be on all of the time.  Safe and secure.  The small(ish) monitor is ok, but as someone else pointed out, it's flaky and not always responsive.  ( I actually found a small plastic screwdriver I used as a \"pen\" for the screen because it was so unresponsive to my fingers alone.)Overall the system is simple and (should be) easy to use, but I cannot get into the system in a manner I find more convenient and faster to use - through my PC.  (I'm online all day long and use technology and computers for a living, so my desk space is the best place to keep track of/ view a security system.  Or it should be.)  I tried several browsers before I remembered they want you to use Internet Explorer (the most broken, most compromised browser in the history of the world).  Other vendors have products that use almost any popular browser to control and manage their systems, so right now I can't remember why I bought this one...Big issue is that you have to register at Uniden to get a link to an Active X plugin for your browser so you can talk to the damn thing.OCX/ Active X plugins for IE are out of date.  Nobody does that anymore because it's insecure.  No web browsers, but old versions of IE, do this anymore.It's all besides the point because in order to use a PC browser to watch your cameras and control them, you have to get an OCX plugin from Uniden.  But I can't.  Their registration page keeps telling me they cannot find the DID/ UID that is on my brand new Uniden device.Do I want to trust my home security to a company that uses outdated web browser plugins and also can't keep track of it's own inventory IDs for it's own products?  Nah, I don't think so....I wish I had seen some of the other reviews before buying this thing.From the PCMAG review of this sytem:\"There is a Web site through which you can also view the Guardian system on a PC (Uniden Video), which requires you to create an account and register your product on that site. However, it also requires an OCX plug-in and only works with Internet Explorer.We could not get it to display video at all during our tests.We used Uniden's email support to try and get a resolution, and while the responses were relatively fast (24-48 hours for each query) and generally helpful, we still couldn't make the plug-in work for us.\"===========The system has promise, but if I was only able to use the tiny screen to manage several of these, it would get tired really fast.  I have to click things several times to get a response from the handheld.  If you have motion detection on, which works quite well, and you have a few dozen clips to scroll through and watch, it's tedious to do it with the handheld.  I can imagine it would be easier with a full-blown interface like the browser on my PC, but that's all I can do right now - just imagine.What really bothers me is that I've handled tech support for friends and family for years, and even though there is a fair share of user error involved, in this case there is not.  Uniden makes it too difficult just to give you options for handling an otherwise really decent system, so I can see where the frustration for your \"average\" user may come in.  Who has the time?There are plenty of four and five star systems on Amazon that users said are easy to setup and convenient to use.  I'll check out one of them next...", "Date": "February 4, 2013"}, {"Title": "Uniden Gardian G755 System", "Author": "DrDan", "ReviewID": "R1ZMFW6PKHRBNN", "Overall": "4.0", "Content": "Just bought it to set up for my macbook pro, iPad, and iPhone -- and my wife's. It was fairly easy to install the system (had to actually read the quick install directions). Downloaded the correct app (Uniden 2). However, I went online at Uniden and set up the account first. The system does not work with any Mac -- but that was clearly stated online and in most of the paperwork. It is designed to work with Windows system pc's. I'm ok with that. It works perfectly with my iPhone/iPad and my wife's iPhone/iPad anywhere remotely. The monitor that came with the system is very clear and on the iPhone/iPad (s) the picture quality is even better. The wireless function is superb and works as it should from one end of a 3,000 sq ft home to the other (and out in the yards front and back). Hey this is not a $5,000 dollar system, but the picture quality is just as good for a lot less money. Adding cameras is also easy (pairing). So, I truly don't understand the complaints. I've not had to call customer service and by the previous reviews am glad about that. If I didn't have an iPhone 4S or better or an iPad 3 or better, I'd not buy it unless a Windows user. However, this is a truly DYI system and it works just fine for our needs and on a budget as well. v/r dr dan", "Date": "December 21, 2012"}, {"Title": "Surveillance for  simple monitoring solutions, not for remote monitoring", "Author": "Terminator", "ReviewID": "R20AMHNSZ526SX", "Overall": "3.0", "Content": "I have purchased G766 in SAMS club recently and have tried it for few days with all options to ensure it works for me and reading at other reviews, almost all of the reviews are true or accurate because I tried all the features and I know most of the comments are applicable. Before my review comments I would like to mention that I am tech savy and I do understand \"how stuff works\". Before trying this I tried Lorex, Swann Wired systems and also Unidens another wireless model from Fry's.After trying wired and wireless units my recommendation is buy this unit if you are monitoring activity around the house while at home, like kids/wife at home having the comfort of seeing who is at the door, not having to go and peak outside or if you are at home and want to watch maybe pets, kids playing outside, deliveries or solicitors so you can watch a movie with the portable lcd on the side along with your popcorn.If you are planning to use this to watch your home outside of your home, I mean via internet it is a bad idea because of several limitations that makes this great device useless.Features that doesn't work or not there:1. Sends and email with just text and does not send the image when motion is detected.2. Remote viewing via app is frustrating and primitive, cannot view all cameras at once but works well with instant streaming of the activity though.3. Cannot record video on your mobile device, can only take snapshot if you are watching the screen at the timeof the activity.4. Motion sense email alert is hot or a miss and is not reliable.5. Remote monitoring via web browser is a joke. It is very primitive like Windows 95 and as other reviewers mentioned it is clucky, buggy and compatibility issues but when it works it is ok but have to view one camera at a time. I was using Windows 8.1 though.6. Video is recorded in clips of MP4 videos on an SD card and have no option to view remotely or system does not overwrite the old ones if it is full.7. Do not sound alarm when motion is detected so Uniden expects us to sit in front of the monitor and watch it all day maybe night too.... ridiculous. Maybe they shoulkd label these as \"Baby Monitors\" rather than Surveillance system....8. No ability to record on external drive or NAS drives9. Power cable should be through the mounting stand so that it is not exposed outside for easy tampering.10. For the remote monitoring to work the LCD unit must be docked into the base unit.Good Features:1. Simple to install and no wires no mess.2. Portable wireless monitor is a big plus so you can take it around the house.3. Wireless capability is great and have no issue moving around my two bed room 2000 Sft house with walls etc. Didn't notice any interference with my WiFi as other reviewers mentioned.4. Cameras and base unit takes the same adapter and is very small and compact and not ugly bulky adapters.I will update more feedback as I keep using them.", "Date": "December 11, 2013"}, {"Title": "Good - But Not good enough for home security", "Author": "Haoleboy", "ReviewID": "R1CVEJXZ9XS9VX", "Overall": "2.0", "Content": "Starting with the good....easy to setup and the cameras quickly paired with the monitor. The monitor works great and while it was sitting on my desk, the motion detectors in the cameras worked as stated. It does not work off your home wi-fi system. The monitor has its own receiver for the video. If you want to view the video over the internet, you need to plug in a CAT 5 cable to the back of the monitor and to your router.Now, the reason I returned the system....I am a retired detective and forensic video specialist with a good amount of knowledge in the video surveillance arena. The compression on this system is the stand H.264. If you are using this for home security, the compression of the video and the data that is lost in the air is is too much. The video looks great on the screen; however, if you record video and then view it off the disc on your computer, you would not recognize your own mother. While walking under the camera with the monitor in my hand (during daylight hours), the compression of the video was so great that most of my facial features and clothing details in my shirt were not recorded. You could see them on the monitor, but not on the disc when I reviewed the video. The night video was even worse....ghosting and no facial features at all on the video. This will not help law enforcement or a jury identify a suspect that breaks into your home.I returned the system and will keep looking for a wireless system that will meet my needs.", "Date": "October 9, 2013"}, {"Title": "Good?  Maybe...Bad?  Could be...", "Author": "ginomari \"Gadgeteer\"", "ReviewID": "R2PHT7J8COJ2DN", "Overall": "4.0", "Content": "Been browsing around for a surveillance security system, not too expensive, not to cheap.  Coudn't settle on one system as I still want to expand my research to as many samples until I get comfy with which one I want.  Then I happen to be at Sam's Club one day and I saw this Uniden Guardian G766.  Checked the reviews on amazon and found several happy customers and almost equally unhappy customers. What the heck, I'll just pick it up and pretend that the unhappy customers didn't exist.  Paid $349 plus tax.  Connectivity from camera to main unit is awesome. On one camera, its separated by 3 walls and 70-80 feet, no problems, image quality is great. The other camera is closer and just one wall separates.  After I hard-wire the main unit to the router using the included ethernet cable, it forever attempts to connect to the internet. This is where the word \"frustration\" is redefined at its best. It never connected to the internet except for a couple minutes when I power it down and power it back up which it connects to the internet for a couple of minutes and the connection drops and the error message will say \"connecting to the internet, please wait\". Yeah, I wait 2, 3 or 4 days and it never connected to the internet. I'm interested in being able to check these cameras on my iphone when I'm away from home since I work nights.  2 weeks later, I started to gather the packaging so I can re-package the unit and return it to Sam's Club. Image quality is great, everything else is a POS.  Took a nap, when I woke up, I saw the globe icon signifying \"connected to the internet\" (without the running dots).  Wallah!! Checked my PC and ran the OCX software on my Windows 7 starter netbook and yes!!! there's my surveillance camera, can now be seen on the internet.  Ran the iphone app and BINGO!!!  While I was on the freeway on my way to work, I can check the cameras via my iPhone on the go.  Great!! I immediately planned on writing a review on this unit regarding my \"natural high\" experience with how great this unit is.  As soon as got home from work in the morning, I turned the unit off to see if I can turn it back on with no problems.  Pressed the \"connect to the internet\" button and it's been trying to connect to the internet for more than 36 hours now.  Sam's Club here's your Uniden Guardian G766 and give me my money back.  And by the way, how come you don't see G766 model on the Uniden's website?  It only mentions G755.  If you can make this unit connect to the internet using the included ethernet cable, please share it.  Otherwise, this unit is a $350 piece of toy. Find something else. Unless you just want an in-house surveillance camera. Then this is good enough.Update 3/6/13:  I have found the trick (or the right way) to keep the main unit connected to the internet.  So, you can now see 4 stars on my review. I had it with 3 stars on my initial review based on being difficult to connect to the internet. Now that I'm able to see the cameras on my iPad and iPhone, I think this unit is PROBABLY one of the best in this price range. I say probably because I havent tried other units and I'm just basing my wild comparison on negative reviews of others in this price range.  Very good connection between unit and camera (80 feet with 3 walls in between, gives me 1 bar on the signal scale), picture quality is awesome even with 1 bar. I am now recommending this Uniden Guardian G755/G766 to anyone looking for a quality surveillance unit within this price range.  I can also view the cameras with my HP Netbook using Windows 7 starter. I have not yet enabled the video recording mode because there are a couple of palm tree leaves slightly in front of my Camera #1 and I dont want the system to record the video triggered by the constant moving of these leaves. However, I was able to snap a sample picture of my daughter as she was approaching the main door (from the outside) where my Cam #1 is mounted. I told her to stop for a moment so I can take a picture and check the image quality (this was taken at night, and my front door is lighted with a 75 watt incandescent bulb). Picture quality is better than I expected. The reason I'm not giving 5 stars is because the add on cameras I think are a little expensive. I just purchased one camera yesterday directly from Uniden (amazon is out of stock) and it costs $129 plus tax and shipping, comes to $153. I paid $349 plus tax @ Sam's Club, main unit and 2 cameras for mine. The camera is well built, metal casing and feels heavy & strong but the price could be lower.Update 3/7/13:  I'm really frustrated now. While continuing to tweak my Uniden Guardian to connect to the internet, I was looking at the monitor when I saw the Fedex guy drop off a box. Yes, its my third camera which I paid $153. Wasnt excited since its useless for now. Cant connect to the internet.  Box still unopened as I write this update. An hour later, I went to Frys a mile away from my house to buy something for my home theater. Stopped by the security cameras section to see what they have. Well, I saw a heartbreaker: they have the Uniden Guardian G766 (same as mine) for $344 plus tax. No big deal, $5 cheaper from what I paid at Sam's Club. But when I looked at the box next to it, its the GC45 camera, same as the one I just got, price is $110!!! When I saw online that amazon was out of stock, I thought buying it straight from Uniden was the way to go. I have to find out and see if I can return this camera to Uniden, box still unopened.", "Date": "March 2, 2013"}, {"Title": "simple and inexpensive security solution", "Author": "E. Perry \"piper1233\"", "ReviewID": "R1RX1O5QT3C44M", "Overall": "4.0", "Content": "I purchased this system along with two extra cameras to monitor the outside of my home. Amazon gives the best price but you cant count on their estimated shipping time. I cant say that the system was easy to set up because there was absolutely nothing to do. You just plug in the cameras and monitor and its up and running. Pairing the other two cameras was also simple and easy. I drilled through the interior and exterior walls in the desired locations, and fished through the power cables sealing the holes with plastic cable bushings and caulk. There was no need for the long power extension cables that came with the cameras, I plugged the cameras into nearby outlets which i previously installed plug in surge protectors. The cameras cover a large area and the resolution is very good. I have high speed internet so there are very few signal interuptions, but the signal range on the camera is nowhere near whats cited on the package, my furtherest camera is 80 feet from the base staion with only two walls (one interior and one exterior) and the signal is 1 to 2 bars at best. if you have a slow network, the distance from your furtherest camera is over 100 feet, or if your has to penetrate several structural features; this might not be the system for you. The motion detection and email alert works all to well. At the low setting it picks up the slightest movement. between camera adjustments, triming trees and bushes, and discouraging spiders from building webs around the camera at night for warmth; I got the nightly email alerts down from 49 to 8 or 12. The change from night to day and day to night activates the motion detection on all four cameras. The Iphone Camera App works well, but there is a lag time switching between cameras. As stated by just about ever reviewer of this product, its a shame that you cant access the recordings remotely. All my computers are Apple products. What sense did it make to be able to use an apple iphone with this product, but not an Apple computer. So Far I am very satified with my purchase and would recommend this product.", "Date": "January 21, 2013"}, {"Title": "Works as Advertised", "Author": "Elizabeth Vincent", "ReviewID": "R2WSYW2BOL307W", "Overall": "4.0", "Content": "This security system does exactly what it is advertised to do. I have accessed the online images using windows XP, and Windows 8 Professional with no problems. It currently WILL NOT WORK WITH A MAC COMPUTER online. I hope Uniden will add a Mac version so we can view the videos on our Macbook Air!When you go to the [...] to view the cameras, you MUST read the instructions at the bottom of the page regarding downloading and installing files from Microsoft.com so the P2P (peer to peer) will connect the base station with your computer. There is no audio with the computer program or the mobile apps.If you only want to monitor the video at home on a local network (intranet), then make sure you shut off Internet transmission. Also, if you turn on the power saver setting, the Base station LCD will shut off after 2 minutes of not being used, but will automatically turn on for 2 minutes if the system is recording from motion detection.I have also installed the app for my iPad, and it works perfectly. I can access my live camera images from the iPad on the AT&T; or WiFi connections, but like the computer version, there's no audio. The image you see when you open the app is a snapshot of the last image seen on your previous connection to the cameras. You need to swipe the window to the left to bring up the live video screen and give it a few moments to finalize the connection and bring up the live view. You can record video or snap shots from the iPad application.The compression codec (h264) used with the system is efficient as it compresses moving parts of the video, with minimal compression in still sections of the image. This keeps \"blocking\" of the video to a minimum. The audio quality is not very sensitive, and is not one of the system's better attributes.All in all, for its price range, the Guardian G755 is fine for indoor and outdoor use at home and for general business security, but if you need camera resolution to see fine details in the video images and higher frame rates, look elsewhere, but expect to spend much more, and you will likely need a wired system, not wireless.", "Date": "January 5, 2013"}, {"Title": "EXPENSIVE UNIT ONLY GOOD FOR A YEAR!", "Author": "Ralph G. De La Luz", "ReviewID": "R1G23298GCHBI0", "Overall": "1.0", "Content": "This system worked great. Easy setup, wireless, and extremely convenient. Purchased system and other extra cameras for about $600.00 that lasted a whole 1 year 2 days. That is 2 days out of warranty. If you are willing to spend $350 or more for 1 years worth of service, this is the unit for you. When I called customer service, they said oops, your 2 days late.. out of warranty. This faithful Uniden customer with phones, scanners, two way radios, and surveillance system has had it. I would not recommend.", "Date": "November 18, 2013"}, {"Title": "Pretty good...one key feature lacking...", "Author": "John D. Pullen \"I wanna pop some tags....\"", "ReviewID": "R12QMZZF028UC9", "Overall": "3.0", "Content": "I bought this refurbished (from iSave through here) and was surprised at the condition - just about like new with all components/manuals etc.We set it up to test in our kitchen (network jack there) and it instantly connected to the web and the cameras paired instantly as well.  Literally in 5 minutes, the system was up and working.The wireless connectivity seems solid and is super super convenient.I was able to create a Unidenvideo account in a few minutes and downloaded the app to my phone and in 10 minutes total, I had remote viewing enabled.Next, I configured my mail settings (using yahoo not gmail as suggested) and the motion notifications started flowing as well.The cameras have pretty darn clear pictures and the fact they capture sound as well is nice also.My only major gripe:  if you have the cameras set to record when motion is detected, you cannot remotely view.  Big bummer.  I would really like to have the system send me a notification when motion is detected...and then instantly view what is going on while it is recording.  Maybe a firmware fix in the future will change this.I've mounted the cameras on opposite corners of my house.  I do wish Uniden sold additional dc extenstions but I found some here on Amazon that I've ordered and are going to give a try with the two additional cameras I ordered as well.This is a great little system to catch neighborhood kids that are up to no good - what I will be using it for.I recommend it at the $229 price point but wouldn't at say $400...EDIT!!!!!!!!!  - I've chosen to return the product.  Not being able to view remotely while recording is a deal breaker for me.  It really killed it for me while traveling internationally and although I was receiving updates that the motion detection had kicked off recording, not being able to view the cameras or the recordings makes it kind of useless.This product would really only be good for those who are constantly in front of the tablet.", "Date": "October 12, 2013"}, {"Title": "Uniden Guardian(tm) G755 Wireless Video Surveillance System", "Author": "JandA", "ReviewID": "R1LMBGM7NHBBB", "Overall": "2.0", "Content": "Costco has this for $40 off now so it's only $300.  Setup was easy until I tried to view on line.  I created my account, downloaded the Visual C++ S/W and then the OCX S/W but Norton Internet Security detected the OCX download as a threat and removed it.  Norton identified it as a WS.Reputation.1 threat which as near as I can tell just means that Norton doesn't have any information about this.  Strange that nobody else has commented on this.  I emailed Uniden about this.  We'll see how long it takes them to respond.  No rush since I can return to it Costco any time.  This is my first experience with video surveillance equipment but based on the praise I see in the reviews I'm underwhelmed by the video quality but I really have nothing to compare it to.  Like others have mentioned, it would be a big improvement if you could view the recordings remotely.  Has anyone tried viewing from their PC on their home network (with the G755 in the base unit but not connected to the internet)?  If you can view recordings that way I suppose you could just VNC into your home PC when you're away and see the recordings that way.  Also, has anyone found the location for the firmware download?  My unit came with the latest firmware version (V.A0.3.5) so I don't need to download it but if Uniden ever does make an update it would be nice to know where to find it.  While we're on the topic of firmware updates, having to remove the SD card from the unit, insert it into your PC, download the firmware to the SD card and then plug the SD card back into the unit to update the firmware is a joke.  Really?  The unit is already connected to the Internet!  Just press a button and be done with it.  Oh well, more room for improvement.  Hmm, I had this at 3 stars but thinking about the lame firmware update process I dropped it to 2.  My desktop PC doesn't have a card reader and if I didn't have a laptop that did I wouldn't be able to update the firmware, sigh.", "Date": "January 26, 2013"}, {"Title": "Guardian G455", "Author": "G. Gerena", "ReviewID": "R271W6VLEP4QV8", "Overall": "5.0", "Content": "I wont type alot here since i know you going to buy it anyway.  This G455 rocks. Special thanks to Price Pros for taking care of my order since the first one that was sent the craddle was not connectin to the internet but i think its because of the way it was built. The 4 in screen is more than enough to watch any camera. The initial 2 cameras are great and can see about 40 meters in the dark. In the day they can see about 120 feet without blur. You can take the unit and take it anywhere in the house without loosin signal, i have a 1600 sq ft 2 story home and had no problems. Best feature of all is that this system records on both cameras at the same time. This feature is so usefull when plp are walking around your house. the menus are easy to play with, i was up and running in less that 5 min without installing cameras. The cameras screws are a bit flimsy but they do their job just dont overscrew them. You can connect to internet with no problems just make an account at unidenvideo.com and put the system id and you good to go. I was in vegas this week and used and boostmobile samsung prevail and downloaded the Uniden app and worked like a charm. I was watchin my can run around the house with no problem.  The only problem i ran into was when i downloaded the app for my Asus Transformer Prime.It kept crashin to the main menu. i called customer service which was no help because they said \"hmmm ill check it out\" that was 2 weeks ago and havent gotten back to me yet. So now im constantly sendin them emails to see if they will ever fix it.Overall its the best system ive had so far. is it perfect NO but it does alot more that the other wireless systems, wireless connectivity and app friendly to your phone where you can look at the cam from anywhere in the world and you got yourself a great system.", "Date": "August 10, 2012"}, {"Title": "Worst Customer Service on the planet", "Author": "Seattle Reader", "ReviewID": "RQXN8SUHJNKM", "Overall": "1.0", "Content": "The manual tells you to update the firmware on the website. There is no such place on the website.  I tried calling customer service and there is no menu selection for the guardian system so I selected another one and waited 20 minutes. Then the representative says she will transfer me to a guardian representative. When I asked her if the company knew there was no phone menu selection for the guardian system, she said yes that they just transfer any calls for the guardian system. Her attitude was why did I have a problem with the fact that that I could not get directly to a guardian customer support. I waited another 20 minutes and then was told to leave a message for the customer representative who would call me back in 24 hours, but his mailbox was full so no message could be left. Their customer support on the website is a joke.  I tried to email my problem. I filled out everything asked to send the email and then it went to another page asking me to fill out much of the same information, once that was done it directed me back to the first pages, and then back again in a circle.The main reason I bought this system was so I could monitor the cameras from my IPAD while on trips. The IPad and Iphone application will not work. I should have known better I bought their wireless telephone system a few years ago and had the same problems. How does a company with such a terrible disregard for its customers stay in business.  I am returning my unit. I will never buy a Uniden product again and anyone .", "Date": "November 13, 2012"}, {"Title": "Lacks basic functionality, and customer support is garbage", "Author": "Kendall Alvarez Eskew", "ReviewID": "R1VS0R2H4S1RPR", "Overall": "1.0", "Content": "This camera system DOES NOT OVERWRITE OLD DATA. What makes it even worse is that their product manual specifically says that it DOES have this functionality. But customer support tells me that this model does not do it. So basically, they are lying to their customers. I wasted a ton of money on this camera system. Why would I want to have to format the memory every 3 days so I can record new data? It's garbage, eve a $20 dash cam can overwrite old data.Also, the handset turns itself off constantly. It's total garbage, and their customer support is garbage.On the plus side, the video quality is pretty good in day or night.", "Date": "April 29, 2014"}, {"Title": "UPDATE on incompatibility with iOS7 - Finally got an answer!", "Author": "E. D. Van Doren", "ReviewID": "R1FY76ENYFA2BK", "Overall": "3.0", "Content": "UPDATE 4/17/14 - Five stars for Uniden's phone support, Zero or One for their online support.  I called Uniden's support number, and after about 15 minutes I talked to a service rep who knew what she was doing.  The responses from their online Q&A; were completely wrong.  The app has no iOS7 compatibility issue - the problem the online folks were talking about was completely different and not major.  The service rep guided through the app reinstall and setup in about ten minutes.  I suggested they take a hard look at their online support processes and personnel, because they are driving customers away.UPDATE 4/4/14 - Uniden continues to ignore any problem reports related to their iPhone app not working with iOS7 on a 5 model.  I hope prospective buyers take my experience to heart when shopping for a security camera solution - in fact, for any technology that Uniden offers.  They do not support their products.UPDATE 3/22/14 - After another four weeks of frustration over the lack of response from Uniden about this problem, I am ready to take it up with the FTC. The last time I followed up with Uniden via their problem reporting system, I found they have removed the entire problem history from their site, and no longer respond to my problem reports.I think I am being quite reasonable about this issue - their app simply does not work on the iPhone 5, and the system is useless without that function.ORIGINAL REVIEW:  I bought this system and spent nearly as much again to have the power feed installed.  Worked fine until I replaced my iPhone 4 with a 5s.  Uniden has blown me off repeatedly with various messages, always closing the problem report when they do.  Their last message says that Apple updated their security  features on iPhone 5 and 5s, and that I have to contact Apple to resolve my problem with the Uniden app!I hope every prospective Uniden buyer reads this and understands that the company sells products that are not supported.  I bought this because the description said I could check the cameras via my iPhone and the web while I'm away from home.  Now it doesn't work, and Uniden could care less.", "Date": "March 10, 2014"}, {"Title": "3 Weeks and broken", "Author": "CW", "ReviewID": "R1QCVFSD2J1ZON", "Overall": "1.0", "Content": "Even with some negative reviews, I decided to order this system since it was wireless and came with a monitor.  Initial set up was easy and seemed to work great.  I could see the cameras on my iPhone and iPad but never was able to view the camera images on the PC.  Come to find out, their software download (required for viewing) only works with 32 bit systems and mine is 64 bit.  Oh well, I didn't care since I could see in on my portable electronics.  However, 3 weeks after I installed it, the receiver/monitor went out and will not charge or turn on.  I can't return it to Amazon since I bought it an Amazon partner and there is a restocking fee to return it to the vendor and ONLY after Uniden has admitted to faulty merchandise.  Go ahead and try to get a customer rep on the phone at Uniden...won't happen.  If you are lucky enough to finally get a hold of someone at Uniden that doesn't have an attitude, you have to pay to send it back and MAYBE get a refurbished replacement.  So I'm stuck with a $350 piece of junk.  Read the fine print before ordering.  I'm going to search for a new system....lesson learned.", "Date": "February 27, 2014"}, {"Title": "Poorly designed unit with terrible product QA", "Author": "John F", "ReviewID": "R1A8INYIT9GBDE", "Overall": "1.0", "Content": "This was purchased as a gift for my father along with two of the matching accessory cameras that are like the ones included in this kit.  The unit is a complete disappointment.  The software on the tablet style base station is some of the worst I've ever used.  It is littered with obvious bugs in the unit.  The worst example is that from the home screen, you can't interact with the tablet in any way if you are connected to the internet.  Once you unplug the ethernet cable, the device works flawlessly.  If you plug the cable back in once you've gone into the settings screen, you can use it normally.  You just can't use the internet connectivity while you are trying to use anything on the tablet.The cameras are also very poorly made, as are the mounting brackets.  Of the four total cameras we have for the system, two have broken already.  We were very gentle during the installation, but the nut that seals the wire exiting one of the cameras snaped in two.  Another camera has this weird issue where half of the picture is a different colour than the other half.  Tapping the camera changes where the divide happens, and it can be tapped to work properly sometimes.I work in the mobile phone operating system industry.  I know how to use the device, it's just that it's very buggy and doesn't work as it's supposed to.If this wasn't a Christmas gift and I didn't have a full checked bag for my flight back, this would've been returned.", "Date": "January 1, 2014"}, {"Title": "It has A LOT of annoying little handicaps rendering it useless.", "Author": "Rick G.", "ReviewID": "R2KX10QOLMZ71V", "Overall": "1.0", "Content": "ProsOnly pro is the simple setup and fairly long battery life. But why would you want to carry the tablet / receiver around unless you're aiming the cameras?Cons:- no wifi- no mac support,  windows only- cripples nearby 2.4ghz wifi networks- Mobile app is very low quality and shows only one camera, has no controls or options- App video stream always freezes and shows a static image that can be left indefinitely, fooling you into thinking you are watching live video but it has frozen long ago- Very low resolution, cannot make out faces, low frame rate, any motion is extremely blurred or streaky- Ceases to record when the SD card is full, and even worse, it requires that you manually format it daily which requires a deep dig into settings menus.  Let it get full and it loses its reason of being as a security recorder ... by not recording anything!- Motion detection is set off constantly by  almost everything even dust and mist, quickly filling the memory- no way to delete multiple video files from memory without formatting- Multi camera Scan function works for a few minutes then goes back to 4 camera static split view- The unit displays in the wrong aspect ratio, making everything appear severely widened (4:3 is fed from the cameras and stretched to 16:9)- no daily recording ability, but they provide 5 one time single use slots for recording, which is useless because you must completely reschedule it every 5 days if you want make any use of it, requiring intense menu diving and wasted time... You give up on the feature after the 5 slots are finished.- no ability to save files automatically to external drive or PC for archiving- wastes a lot of the users time and becomes completely useless and ceases to function if left unattended for more than two daysIf it wasn't so cold out (-35) I would take the cameras down and return them but I decided to keep them for now, and come springtime I will find another system and dump these because this system is a failure.  It is plain and simply a non-functional product.  A scam, if you will.  I am so depressed I missed the return window because I spent over $600 on these being in Canada, where everything costs double, plus tax", "Date": "December 16, 2013"}, {"Title": "Great system", "Author": "Rep. Glock Owner", "ReviewID": "R2EHA7YGKCTAKZ", "Overall": "4.0", "Content": "I have had my system for a year now, and had no problems. It is easy to set up, I didn't even use the manual. Ended up getting two more cameras to complete it. The only thing I dislike is that every shadow and light from cars sets it off. Spiders making their webs, a web itself across the lens will turn on the record, moths, etc. will set off the motion. So make sure you have a large sd card if you go on vacation. I must note here I purchased a second system (the G955 from costco has the larger 9 inch monitor but has the exact same cameras as G455) and it created interference with my G455 system. I called Uniden and they told me to separate both monitors and don't crisscross the cameras with the existing cameras from my G455 system. It still created minor conflict with both systems. There would be a delay viewing the cameras on the screen when you enlarge or minimize on the monitor ( a white loading circle and black screen that lasts 30 seconds or so) but eventually come on to be viewed. I unplugged the new system and cameras and everything goes back to normal. So I have to return the new system. :( Would like to know if anyone else experienced this issue, and anyway of resolving it?", "Date": "November 5, 2013"}, {"Title": "Fast easy set-up", "Author": "Steve the fan", "ReviewID": "RXRA91KS9FM8R", "Overall": "5.0", "Content": "Arrived well packed (not original package).Easy to follow instructions.Works best in IR mode if not shooting through glass.Camera mounted outside will work in low light without IR.Easy play back and copy.Router install and upgrade easy.", "Date": "August 26, 2013"}, {"Title": "Very Good for the cost", "Author": "Stonington \"Jack\"", "ReviewID": "R2CSIPFJO20J73", "Overall": "5.0", "Content": "Considering the price on this unit I have to say this one stands out very nicely and operates just as it should. I purchased this to replace a Lorex system I had where the remote control was whacked out after a few weeks so this one is hands down much better.  If you think about this system for what it is you have to realize it's a pretty good deal for what it does.Two cameras and small monitor are just fine, for the price there are pretty darn good deal.  As far as Tech Support, that doesn't sway me one way or the other, these days \"NO ONE\" has any tech support worth the powder to blow them out of the water anyway so you cannot rely on them or what they pretend to know. Today if you don't know it yourself you simply should not buy it. Tech support is generally some people hired off the street with manuals divided into Branch Type problem solving, \"Problem \"A\" = Turn To This Page --- Problem \"B\" = Turn To The Other Page, that's it, a pre-printed problem solving manual with no technical savvy behind it.None of them have true technical knowledge, you can't single out Uniden, they are all the same way - crude. I had one exception for a garage door opener provided by Buick (Home-Link) I think was there name, the Tech Support people for HomeLink Tech Support actually knew the product and had the answers (thank you Buick & HomeLink) but they were an exception. * When I bought this my thinking was as follows:(1) STAND ALONE UNIT not tying up my computer - I have too much connected to the computers as it is, this system does not need a computer to operate, thank God for that. Leave my computer alone already and let me use it for other things.(2) SIMPLE OPERATION, it works easily and does not have to be routed through several systems before I can get an image of someone at my door. My wife hates to learn a million new techno pages every time something comes out, cell phones, programmable refrigerator - washers - coffee makers - entertainment systems - i-Tunes (changes every week) - printers - answering machine - copiers - gee wiz man it doesn't end does it, a new techno manual for everything. It was nice to see a straight forward setup easy to use which my wife (or me) can operate without being frustrated for an hour.I am pretty tech savvy and I'm the Go To Guy in the neighborhood for any technical things so getting a break on this was nice to see.(3)  No Wires - (of course the cameras have power wires), nice to know I didn't have to drill and run wires all over the house for an afternoon and then listen to how to dam wires show here and there and blah-blah-blah...., this is a very Big Plus.For house security this is a good basic system that simply does the job, they have better technology coming out all the time but for what it is this is nice with some solid positive features. If you think it through before you tackle the setup it should go easy with little or no frustration.  I have been running mine for a over one year and it's been fine.The newer one they came out with has features I like a lot but I'll stick with this one for now, I could end up buying one every six months the way new technology goes.For under $300 you should not expect HDTV and Surround Sound but for the price this is tough to beat, it has operated just as they say and so far so good.Again - for the money you'll be hard pressed to find one better, maybe the Uniden UDS655 (hahaha, another very nice unit with nice options - maybe nicer - hehehe.... look at that one too.)I just installed the Uniden USD655 for a neighbor and that one is pretty darn nice, pretty darn nice indeed. Uniden UDS655 7-Inch Video Surveillance with 2 Outdoor Cameras and 4GB MicroSD CardYup this one is nice too - sure is.", "Date": "May 26, 2013"}, {"Title": "It works well enough", "Author": "boofay", "ReviewID": "R2WPT5VOC2G4JW", "Overall": "4.0", "Content": "Have found that the base/monitor station needs to be 50' in proximity to cams. Maybe 500' works for users who have no obstructions but that's not the case in real time use for my area. That means that a 150' extension cord and 150' RJ 45 Ethernet cable are used. The monitor/base station are under a secured protective plastic case protected from the elements. I've maxed out the system w/4 cams. The Uniden Guardian 2 app for Android is satisfactory. It doesn't have quad cam view or sound like on the 7\" monitor. If Uniden ever updates their android app version to include quad view/sound it means they've prolly sold enough of these kits to justify listening to their customer base. The S3 has great real time streaming video view when your smart phone is turned in the wide angle mode. This wireless surveillance system is more of a deterrent for on lookers and will be satisfactory for documenting day time use and night time use for larger objects like motor vehicles. Don't expect license plate numbers or fine detail unless your cams are 5' away from the situation in question.", "Date": "May 5, 2013"}, {"Title": "Quit Working", "Author": "R. Ewing", "ReviewID": "R1EWK2PHY1JA8K", "Overall": "2.0", "Content": "Bought this six months ago.  Tried to use it with settings set to start recording using motion detection. Problem is that it is too sensitive to light changes..........a cars lights shine in the yard, the camera starts recording; turn on the lights in the house next to the window, the camera starts recording; snow fall, the camera starts recording; rain drops, the camera starts recording.  Fills up the card with a bunch of useless stuff.  Then, at 6 months old, one of the cameras starts not working intermittently.  Called customer service.  I have to find a box, ship the defective camera back to them at my cost and wait for 2-3 weeks to see if they can fix it.  If not, they send a new one.  This isn't acceptable.  How about they send out a new camera and I return the old one in the box they send.  If I don't return the defective one, they charge me for the new one.  If I do return it, I don't get charged.  That's they way most reputable manufacturer's seem to handle it.  Won't buy anything else from them.", "Date": "April 19, 2013"}, {"Title": "Good Camera", "Author": "Stephanie", "ReviewID": "R10XXWGGT7IB30", "Overall": "4.0", "Content": "These cameras have done the job.  Quality is good, only the night time is a little hard to see details.  Ours are placed at the top of our roof so Im sure if we lowered it we would be able to see more detail.  They were super easy to install as well.  All you need is one outlet to plug the cameras into.  We just drilled a small hole up to the attic and fed the wire throught, attached the camerasl and we were done. One downfall is that you can not have it plugged into the computer and use the hand held at the same time, not the biggest issue for us but if you wanted more than one viewing screen it does not work.  Memory on the SD card is great.  We have gone away for whole weekends and not run out of memory.  It takes some time to go through all the videos since our camera in front picks up every car that drives by.  But this is a peace of mind and security for my family as there seem to be more and more nutty people out there.", "Date": "March 19, 2013"}, {"Title": "An easy to install/operate system for the beginner", "Author": "OhioMoose", "ReviewID": "R3IVZ4LPR9MZ09", "Overall": "4.0", "Content": "Purchased this system through amazon on a special deal after having read reviews and doing a little research on line.The system comes with understandable instructions and the cameras were installed without any problems. What you have to know is there has to be an electrical outlet within about 8' of where you plan to install the cameras. I had to add outlet boxes in both locations I installed my cameras.The set up could not be easier. The two cameras that come with the system are already paired/matched to the monitor, so they come right up after plugging them in.I have one camera on the end of my garage, about 55 feet from the monitor and the reception is not dependable. So the distance quoted by Uniden is not accurate.The other camera is mounted within 20 feet and within site of the monitor so reception for it is perfect.The cameras themselves are nice and the night vision works well too.The set up on the internet and smart phone was easy as well. Just follow the instructions and you will be up and running in no time.I am very happy with the unit except for the reception on the camera on my garage. I added two cameras to the system also.Overall I would recommend this system unless you are mounting the camera further than 50 feet from the monitor.", "Date": "December 22, 2012"}, {"Title": "unable to view via internet", "Author": "video1", "ReviewID": "R3A7LK20SYJ2I6", "Overall": "2.0", "Content": "Worked fine with smart phone. However, could never get it to work by viewing with pc on the internet.Customer service email went unanswered for 3 days and response was to call customer service.You need to download a plug in to use it with Internet Explorer. It will not work with any browser but IE8 or later. So if you use Firefox or Opera, you're out of luck. I even tried it with a desktop running windows XP and IE8 and could not get it to work.The Uniden rep said they had issues with Internet Explorer 8 for Windows 7 64bit and as of yet had not come up with a fix.My primary desire was to view the security cameras while away from home using either computer or smart phone. I was disappointed as I expected it to work right out of the box with no issues.It did work fine with the local monitor. Video quality was fine and the auto recording option functioned well.", "Date": "October 31, 2012"}, {"Title": "Needs masking capability", "Author": "Jeeper \"Jeeper\"", "ReviewID": "R1KIA49LRJ3ZD3", "Overall": "4.0", "Content": "Over all this is a decent homeowner system.  Very easy setup, internet included.  The resolution is not spectacular and really can be hard to make out faces at any distance at night.  I bought it to mostly monitor our vehicles in the driveway, and while it will work I wish the video was larger when transferred to a computer.  I believe this is a limitation of the wireless camera's mostly though.Even on low sensitivity the motion gets set off easily and I cannot get part of the road out of it's view and cars constantly set it off.  Masking in the software like the wired units have would solve this.The other thing I wish it did was overwrite the oldest video, if the card fills up there is no recording until you manually wipe the card.The web app has a poor UI and is clunky as well (Android) but it does work.", "Date": "October 25, 2012"}, {"Title": "Can't Go Wrong!", "Author": "Diana L. Dickerson", "ReviewID": "R2SRVEZ40DLAEH", "Overall": "5.0", "Content": "I really researched reviews and ratings on a wireless surveillance systems and decided to go with the Uniden Guardian G755 2 camera system.  Easy set-up right out of the box.  I like being able to move the monitor to whatever room I'm in.  The monitor delivers a clear picture of my drive with the camera mounted about 40ft away.  We were impressed with how easy this system was to set-up and with the picture/video viewing quality day or night.  The camera power cords seem a bit light-duty even though rated for outdoor use so I'm going add a little extra protection for the cords with some weather-proofing, maybe clear flexable tubing, just to be on the safe side.  We're really pleased with this system.  I don't think you can go wrong for the cost and quality.", "Date": "October 11, 2012"}, {"Title": "Uniden Guardian", "Author": "John B.", "ReviewID": "RGDFNMRPB0DC8", "Overall": "5.0", "Content": "I have had some break-ins in my neighborhood and had started looking into video systems. I wanted something that was inexpensive but not cheap, something that I could view online when away from home like I saw on the news. I started doing some searches and based on price the G755 looked pretty good. I don't mind shopping, but I don't like being sold stuff so I really look at user reviews. Some were good and some were not so much. I saw complaints about range and read in the manual that it would go 500' in an open area. I laughed at that cause I don't live in an open area, but really my property isn't big enough to go that far anyways. The thing that I wasn't surprised to find out was that the cameras need wall power. I though it would be cool if they were battery powered but then I remembered all the times I let my cell die and was glad they weren't. I did have to use an extension cord though to get power to one camera but it was not too bad. Installation still sucked though because I hate getting into my attic then getting out to go outside and running back and forth. Word to wise plan it out and try to use vents or openings that are already in your over hangs to avoid drilling holes for the power wire.The computer stuff I had 0 trouble with at least on my PC (gotta love XP), laptop was a different story. Some people said they had trouble with 64 bit Windows 7 and I had a time finding out what my lap top had. I sent an email through Uniden's web site (I don't do phone support) and after a few days (it was teh weekend) they told me how to check. They also told me that windows has 32 and 64 bit versions of internet explorer? And that I should click on the second one in the start menu. That was more than I want to know but when I did that it started working. On my old XP PC I got a pop up about trusted sites or whatever and told it to add the site and I could record videos to the PC no problem. I had to manually add the video page to the trusted sites on the laptop for it to work.The part of this that I was really excited about was the cell phone viewing. I kind of panicked when I saw 2 apps in the iPhone store but they were free so I downloaded both. The first asked for a UID which I didn't have (mine has a DID) so I deleted it. The gold logo app asked for the DID which I was excited I already had, but then it asked for a password. Long story short come to find out the password is actually listed as a security code. Put it all in and boom it worked. I could view both cameras and take snap shots. I texted my wife a few pics of the front walk, to cool. I tried it on the wife's iPad (it used the same app as the phone) and it worked to.So overall for the price for the price and features this thing rocks. I have gotten into a routine of playing back the stored videos. So far I have only had a few cats and dogs show up in the yard but thats better than a thief any day.", "Date": "February 7, 2013"}, {"Title": "It Really Doesn't Get Much Easier Than This...", "Author": "Gil Laroya", "ReviewID": "RW2LA57WAYLRK", "Overall": "5.0", "Content": "I will call myself a \"pseudo DIY\" person. Not very technical, but able to work through users manuals to get things working.After a LOT of research, I decided to go with the Uniden G755 system.Points:* It was very easy to install and set up* I have had ZERO wi-fi interference* The cameras are incredibly clear, even at night* The Uniden Guardian internet setup was very easyJust remember that you need to use Internet Explorer to view online. Also remember that you have to install the OCX PluigIn software that is pointed out on the webpage in order for your computer to view video.I set up one camera facing the street, and one facing across the front of my home. The cameras reach a fairly long distance with zero blurriness. I was very surprised. I plan on two more cameras.You can record using the SD card (I maxed out my unit with a 32GB SD card) Supposedly, 8gb is enough for 5 days of video, but I haven't had my system long enough to test this yet. Also note that with the PC software interface, you can record to the PC's hard drive (I did not know this!) so you can record to both the SD card AND to a PC. VERY COOL.Note that I am using Windows 7, 32 bit. I have seen a lot of complaints about the software. My opinion is that if you are getting a security system to protect your [potentially] thousands of dollars of valuables, why not spend another $175 for an old 32-bit Window 7 laptop dedicated to your security system? I am using an old laptop with a 1TB USB hard drive attached - plenty of storage space!I installed the \"Uniden Guardian 2\" app to my Android phone from the Google Playstore. After entering the DID number (ID for your system) I was able to view the cameras using my phone, one by one! Once again, no issues and it did what it promised it could do.I am still not sure why so many people hate this product, By being a non-techy, I can say that I found the product relatively perfect in that it does what it says it can do. You just have to go in without preconceived notions, not thinking this system will do everything that YOU want it to. Understand how it works, and adapt it to your needs, it's that simple.", "Date": "May 10, 2014"}, {"Title": "Signal Not What Advertised & Display Does Not Hold Charge Very Long", "Author": "lonnie hill", "ReviewID": "R2TM21USFV8QP5", "Overall": "2.0", "Content": "I really like the system but the signal is very very weak. If you are in the same room as the camera the base/display does not have a problem receiving a picture. If you move to another room the signal went in & out, will not stay steady. When we mounted it outside the signal is in and out. We tried it all over the place outdoors trying to get a steady signal. Even attached a 25' cable to move the base around because I was concerned about Interferance.I called Uniden and they want to sell me a booster antenna for each camera. I was going to order it but they said it was so popular that they didn't have time to even put it on their web site because it sold out. This should tell you something! They wouldn't take a back order they said they are not capable of that and I would have to keep trying back every 2 weeks and try to order it again and again until I catch them in stock. What a waste of time. The signal is not what is advertised.The app for my android phone works very well \"if you have a signal\" from the camera. The app will not work on your phone if the display is not on the base.The display when not on the base does not hold a charge very long, maybe an hour.If Uniden fixed the signal issue without charging me more money & fixed the display charge issue this would be 5 stars.", "Date": "January 27, 2014"}, {"Title": "For the price worth it..... with caveat.", "Author": "Sonny", "ReviewID": "R22QJ19LDREI3N", "Overall": "3.0", "Content": "I installed the cameras supplied outdoors. I have outdoor electrical outlets, so I had to upgrade my outlets to the \" in-use\" style covers. The plug supplied is the space saving type meant to go on a vertical outlet which mines was not. The fit is extremely tight. I also wanted the installation to be look professional so I used conduit to run from the electrical outlet to the camera, this discourages would be thieves from simply cutting the cord. The extensions given are the inline type, the connection from the camera is inline, the connection from the power adapter is the \"L\" shaped type, which means that if you want to install with conduit you need at least a 1\" conduit which is unnecessarily large.The camera range is okay for practical use 75-100 ft with walls. The image quality is not high definition nor would I expect that out of a wireless camera system at this price point. The motion detection I have found doesn't always pickup quickly moving subjects, the record time once they are picked up by the motion detection typically starts 13 seconds prior when it's recorded which is nice.", "Date": "January 15, 2014"}, {"Title": "This suits me fine", "Author": "Erica R. Knepper \"Matthew G. Knepper\"", "ReviewID": "R1YJGVLSSSIZ4N", "Overall": "5.0", "Content": "I owned the 4 inch version with two cameras and wanted to get two more cameras.  I shopped around on Amazon and found a refurbished 7 inch with two cameras for $10 less than just two new cameras.  After thinking about pros and cons for about a week, I ran with the refurbished set.  After receiving the system I put in the two cameras and synced all four with the new receiver.  I LOVE IT.  For the price and ease of set up I don't think you can find a better system.  I had purchased a different system prior to this one and had a camera keep dropping out that was about 75ft away through one exterior cedar siding wall.  Might I add that I am a Licensed electrician and have installed similar systems before.  I have a 160 foot driveway and on high sensitivity motion can have a person set off the camera.  Night vision is not perfect.  A cars direct shot with the headlights will deem it useless but for the price its not bad.  Deer, cats, foxes, and dogs are always showing up using a 0 setting on the motion detection.  It goes from -2 to +2.  I have an Android tablet and I can view when not at home.  Only you lose the recording feature and can only view one camera at a time.  I don't use that ever because there is normally someone hear.  But I love sitting on the couch at night with the monitor next to me while on my laptop watching tv and having the ability to glance over and view my spread.  May not be for everyone, but its great for me.  You will want to register it and get all updates for multi camera recording at once feature.  Enjoy.", "Date": "January 7, 2014"}, {"Title": "many system limitations, but still recommended", "Author": "Jazmin Lugo", "ReviewID": "R1H0XFMTBCH7J6", "Overall": "3.0", "Content": "All limitations described by others are true. You cannot connect to the internet and record at the same time. Only one camera at a time can record audio. Video quality is only so-so. There is one more limitation, when I activate the internet connection, the entire house other than my office, where the router is located, goes dead. The Guardian somehow interferes so badly with the router signal that service is dropped at all other areas of the house. I opted to leave internet connectivity off, can't record anyways while internet connected.So, do I recommend? Yes. What other system is available wireless with OK video quality and outdoor rated, at this price? That was my main reason for selecting this system. I didn't want to run wires and I needed the cameras to be outdoor rated and not spend a boat load of money. Set up was easy and inside of 10 minutes had the system running and recording. Access on my iPhone would be nice but that was not high in my priorities.Another thing. I bought the system from Sams Club. It is the same as the one in Costco and has the 766 model number. Per the Uniden website, the 766 is identical to the 755 but the package includes an 8GB card instead of a 4GB card. If you set up the cameras to record on motion, 8G or even 4G is plenty. Too small for continuous recording if you are going to be away for too long.Too me, the easy installation and setup outweigh the limitations. With that said, there are better options for indoor use that allow internet and local recording and audio at the same time.", "Date": "December 10, 2013"}, {"Title": "Noty what I had expected", "Author": "mike102", "ReviewID": "R1K1WVJ60T5V66", "Overall": "2.0", "Content": "Screen much to small.  Attempted to relieve problem by transmitted images to laptop via modem as instructed by Uniden.  While the images are very clear on laptop I recieved repeated image failure notices & lost transmission (2-3 times per hour).  Attempted to mitigate by purchasing high end modem, no relief.  Contacted Uniden via email for assistance, no reply.  Contacted Uniden for replacement, upgrated screen (7\" model), Uniden replied that they would not sell screen/receiver unit seperately.I bought this unit to replace existed uniden unit that was outdated and had poor image quality. While it was my mistake to purchase the 4.5\" model, I did not realize until I opened package just how small the imaging is. Now I have two Uniden units that are basically worthless", "Date": "October 29, 2013"}, {"Title": "Uniden Guardian G755", "Author": "Gary J. Kuehn", "ReviewID": "R2OCLXV4NR94RN", "Overall": "4.0", "Content": "Very easy to set up, pretty much plug and play.  Can not be used inside a window facing out at night. It will reflect off the window from the lights on the camera.  Infered is good. Really helpful if there is some kind of light outside the area however the light can't be to close.  Bugs flying around will cause the motion detection to activate. Trees blowing in the background also activate it.  Better have a 32gig card.  I have put over 7 gig of recording in 3 days due to the wind blowing here in Kansas and the trees setting it off.  Also have had the small plants set it off also if the wind gets to bad.  Overall, I do recommend this product and plan on buying a second system.  Need to be able to buy a 4 camera system in a package.  $149.00 each additional camera is a little high.  For the price of the 2 camera's you can almost buy another entire system.", "Date": "June 25, 2013"}, {"Title": "Simple Survelliance", "Author": "EARL CREEKMORE", "ReviewID": "RHAVKTQS7FLHJ", "Overall": "4.0", "Content": "A simple, easy way to set up basic surveillence around the home or office. I also use it to identify people at my front door and keep a watch on my pets at play in my back yard.", "Date": "June 11, 2013"}, {"Title": "good security", "Author": "Shanman", "ReviewID": "R1I83ZDP5M5NLZ", "Overall": "5.0", "Content": "This product makes my family feel safer at night or when we are not home our house is ok.  I am happy this camera system was easy to set up and does a accurate enough protection of my home. I do recommend this product to others.", "Date": "June 1, 2013"}, {"Title": "Like this as a kit", "Author": "Patrick Wilkes", "ReviewID": "R4NJZ8W5DHTMU", "Overall": "4.0", "Content": "There may be other technologies out there with better options (like IP systems), but we liked this kit as a stand alone package that did not require much effort for setup.The main downside is the inability to see the cameras remotely (using a smartphone) while they are recording at home. You have to turn off recording mode to allow for remote access. Otherwise, we are happy with the features and price.  We will probably be getting another camera to go with the system.", "Date": "May 31, 2013"}, {"Title": "Local viewing OK - remote viewing extremely unreliable", "Author": "Bruce A Clarke", "ReviewID": "R9US17GF0LT1Y", "Overall": "2.0", "Content": "I will give Uniden credit, the setup and picture quality of these units is very good. The power cable extenders give lots of options to mounting locations and training the panel to connect to the cameras couldn't be easier.Where the product fails is accessing it remotely from either a remote PC or smart phone. 50% of the time the Uniden website (which is REQUIRED to make the connection) is down or unreachable. Even when it is up, the reliability of connecting remotely to your cameras is very poor. Out of the 100 attempts I have made to connect over the last few weeks only 3 have succeeded.And as mentioned, the Uniden customer support on this product (cannot speak about their other communication products) is virtually non-existent by web or email. Can't speak personally about phone contact; I have a real job during their available support hours.Overall, a good hardware product that needs the rest of the solution around it to be completed. I'd wait to purchase to ensure they get their act together on the missing pieces.", "Date": "May 14, 2013"}, {"Title": "uniden udw20005 udw10005 udw155 review", "Author": "WebCamDude \"webcamdude\"", "ReviewID": "R1BK7QEGEAC44M", "Overall": "3.0", "Content": "As title indicates I purchased 3 of these Uniden Security SystemsThe resolution is 640x 480. lt is easy to install but cranky about the software password and user id. Once running it provides a reasonable quality image day and night as long as there are no bright street lights facing it or other bright lights. Bright lights wash out the screen at night.The biggest complaint I have is that the software on all three units refuses to work for more than five day in a row on any of the three computers attached to it. Vista, Win7 and XP. In rare instances the software will record for more than 4 days in a row and extremely rarely will it record for over 10 days on 750 GB dedicated hard drives or the new 500 gb hard drive used for it. It will not do so on any hard drive. It crashes and wants to send data through internet but in the 2 yrs I have had them nothing has been done to make the software work. They are so paranoid with their software protection scheme that  it makes itself crash every 4 days. In that case you have to reboot the computer and relaunch the software. I have complained to Uniden but they answer that they received complaint but dies there. Been waiting 2 yrs for them to fix the problem. Their telephone help desk has no idean of how to solve the problem other than giving you a new pasword.Be aware you need to downloade a codec from Uniden to view the files on  your computer without using the uniden software. It will provide viewing with Windows media player.Good luck. Maybe you can reach their locked heads to clear this software 4 day crash problem.", "Date": "April 18, 2013"}, {"Title": "Great system.  READ the instructions.", "Author": "John O. McCauley", "ReviewID": "R6AL93F4MQ6X2", "Overall": "5.0", "Content": "I bought this system elsewhere, for almost the exact same price.  That said, this is a great little system.  I've had trouble at my mailbox, and decided to get this instead of a Glock.  It installed very easily, mostly because I had AC power close to where the cameras are positioned.  The farther you are from power, the more difficult it might be.  As soon as I turned on the base/video screen, both cameras came right up.  There is a certain amount of readjustment needed, especially at night.  The infrared lighting off of the camera is quite bright, and will cause quite a bit of flare on the screen if any object is near, and in the path of the lens.  No big deal.  I have been pulling my hair out trying to get this system to work with the internet, and especially my iPhone.  Turns out to be a cockpit problem.  If I had actually READ the instructions, i would have known that I was using too many characters in my password.  Also, the system wants Internet Explorer; not Chrome, or Firefox.  So there.  You need to download a Microsoft file (linked from the Uniden site), And READ THE INSTRUCTIONS!!!  Other than that, it works fine.  The pictures are clear and bright.  You are not going to be able to read license plates at a distance, but it does a great job, especially at this price point.  I'm amazed by the iPhone app. It's not as clear as the PC or base unit pictures, but works quite well.  It's pretty neat to be able to eyeball my pool from anyplace in the world!  I would certainly buy this unit again.  Highly recommended!", "Date": "April 18, 2013"}, {"Title": "Better than others - but...", "Author": "Jeffrey \"MoleMen, Inc. now a TERMINIX Company\"", "ReviewID": "R1P9GXSUMLWLLV", "Overall": "3.0", "Content": "Not a bad outfit, but like most of the reviews the range is indeed limited through walls.  Wireless has its limitations and you must realize this upon purchasing.  The biggest drawback is the POOR resolution which is only marginally recognizable and ONLY if you have great reception.This outfit will NOT be my main security cameras, but they do fill a void like front door recognition and around the close quarters of the home.  My wife appreciates the convience of the small (7 inch) screen that she can carry around if she needs to and we can still use our IPhones to check on things too.  Setup was a little difficult and as much as I didn't want to I had to call support to help me.  I did not know the difference between a UID and a DID.  The instructions act as if you should know these things but once that was straightened out and I downloaded the OCX files the online video came on.  DefinItely needs some upgrading, but is OK.", "Date": "February 25, 2013"}, {"Title": "Unidian Guardian G766", "Author": "Paul Atkinson", "ReviewID": "R2MIRBCJDYVZG0", "Overall": "4.0", "Content": "I tried two other home surveillance systems before trying the G766. This system is superior to the top rated Lorex system.I find it odd the G766 is not listed on Unidens website or on Amazon.  It is available at Sam's Club.The system is very easy to set up and use. The SD card storage is simple and convenient. A 16 GB card holds two weeks of Video from four cameras.The video is clear, the motion detection and the night range are excellent. Access by home PC and iphone set up was easy using free software.The customer service tech support did take a long time but they answered my question.Still I highly recommend this system.", "Date": "December 18, 2012"}, {"Title": "Still Unsure.. low frame rate using wirelessly", "Author": "scott covey \"Scott in Colorado\"", "ReviewID": "R3O8WATIBU9SV3", "Overall": "3.0", "Content": "Got my G755 up and running, internet works, cell phone, both Android and iPhone work fine. What I don't like is the low frame rates - like 8-12 fps - and while this may seem OK, I can walk into the picture and the camera takes 10 seconds to update so I can see myself. It's anything but 'real time'. I may have some setting wrong as I've only had the package 5 hours, but I'm not overly impressed at this point. It all works, as advertised - but the frame rate has be very concerned. Even in some of the Uniden videos, pay attention to the frame rate on these, they are slow - very slow. I have another Panasonic stand-alone Wi-Fi camera - works very good - pan and zoom, and much better - close to - real time video. Not sure what to think about this system - at this time.scUpdate: I have returned the Uniden system. Although working fine, I'll wait for a total wireless bundle - battery operated cameras. There is no perfect system out there today. Alarms would be nice (sound) should motion be detected and having to provide AC to the cameras was a bit of a hassle - although could be done. Also, the battery life on the display was very short - this needs to be increased. Uniden should provide one more A/C adapter for the monitor - think about it, you want (need) to leave the monitor base plugged into the internet, so you'll want that AC adapter attached to the base, then you may want to have the monitor taken out of the base and put into the location where you sit -but the battery power is so short, this is not real practical. You need one more AC adapter for this remote location. This system is 'close' to what I'd want, and even with Costco's 'deal' is was not worth it for me. It is easy to set up for the most part. I could not get the record times to work properly - it would detect motion al the time, not during the interval I assigned.. but perhaps I did it wrong?", "Date": "December 5, 2012"}, {"Title": "Simple to use and easy to set up", "Author": "P. NGUYEN \"The truth is temporarily painful\"", "ReviewID": "RY4AU5PY1T052", "Overall": "5.0", "Content": "I just bought this from Costco with the $50 off promotion making the unit a steal at $289.99.  I was hesitant on the claimed \"easy setup\".  After opening the box and glancing briefly at the quickstart guide, I had everything up and running in less than 30 minutes.  I tested the app on my iphone and it worked from my home network.  However, when I switched off the wifi and used my 3G, I couldn't connect.  I went to the main unit/monitor and forgot to allow access to the WAN or Internet.  It was actually my fault for not reading the quickstart carefully.  Once that was activated I was able to see the images from both cameras.  Other than that no problems viewing on my iPad, iPhone, and Windows XP and 7 PCs.  Regarding the PCs, it seems that Uniden's online access won't work with Mozilla's Firefox. It will, however, work with Internet Explorer.  Make sure you download the indicated drivers on their page (there should be 2). The range seems very good and I wanted to test it before actually mounting it up high on the exterior of my home. I plan to get two more cameras.  Great system and not having to do with complicated wiring makes for really a simple set up.I wanted to put the monitor in the master bedroom, however, the unit requires a direct ethernet connection and my house is not wired.  I found a wireless bridging switch from Amped that is a wifi repeater with Gigabit switch and paired with the Uniden allows me to reposition the main monitor/tablet near my nightstand.  Of course you can use your iPad as well but I didn't want to waste such a good unit.  Besides, with the included monitor/tablet, you can always leave the video on versus with switching back and forth between apps on the iPad.Great job, Uniden.", "Date": "December 1, 2012"}, {"Title": "WOW!!! and i even bought a refurbished one for 299$", "Author": "rvg112 \"rvg112\"", "ReviewID": "R3PRL1O58WGH3", "Overall": "5.0", "Content": "seriously wow! this has to be by far the best wireless system out there and i also what to debunk some issues i read,  1} the android app guardian 2 does work with samsung galaxy 3 phone you have to download new software on your pc to get a new did number and your up and running. this alone is freaking awesome  2} windows 7 can run the live feed on your pc!! you have to be smarter than a 1 week old baby, you may need to allow firewall change for this to happen but it does work folks! im a truck driver and i figured it out you can too!  3} i have a brick house and a detached garage about 100ft from where the mointer sets and it fluctuates in signal but always has video feed, brick is hard to transmit good signal but this system is doing a wonderful job  4} go buy this thing!! youll be pleased", "Date": "November 25, 2012"}, {"Title": "Great, really great product!!!", "Author": "Luis Fernando Farto Lahoz", "ReviewID": "RZC39KRA33TN", "Overall": "5.0", "Content": "I read a lot of negative comments before I bought this item. This made me afraid. I received it on time and tested it on the same day. Wonderful connection between cameras and video device. Great, sharp video or image quality - very good. I do not work for Uniden. I bought it for my business and for sure I recommend it to you. Go get it.", "Date": "November 17, 2012"}, {"Title": "A great home system", "Author": "J. Seelye", "ReviewID": "R2QLJNXCNQ3AD3", "Overall": "4.0", "Content": "I have an eariler version of this system that will only record one camera at a time on a computer.  This system records up to 4 camera views on an SD card without the need for a computer.  So far, I like the way it works.  My old system had batteries in the cameras--this model has to have the power cord connected.  Neither this system or my older system records the audio--what gives--this is important in some applications?  Both units have sound transmitted from the cameras to the display, why not record the sound with the video?  I use the cameras outdoors.  The motion sensor is set to low, but still heavy rain or snow activates record.  I haven't tried connection to the internet as that was not my intended use.  If I start using this feature, I will add to my review.  This is a great product overall.  I would definitely buy it again.", "Date": "November 14, 2012"}, {"Title": "Great we love it!!", "Author": "Barry Sr.", "ReviewID": "R3N4640GEEW1ZA", "Overall": "5.0", "Content": "We just bought the Uniden Guardian Advanced Wireless Surveillance System. We opened the box, read the directions, installed the cameras, plugged the base unit into our router, went online and setup an account, downloaded the app for my IPAD, my wife's ACER tablet, her HTC, my Samsung and within minutes we were able to see our cameras online on all of our devices. The system is great! Our only complaint is we had an older Uniden system and we tried to pair the cameras to the new system to no avail. Other than that we are going to buy two more cameras and our system will be complete. Thanks Uniden you made it easy.", "Date": "October 30, 2012"}, {"Title": "great system", "Author": "K. R. Smith", "ReviewID": "RKXHKS5PWLRB5", "Overall": "5.0", "Content": "This system is great.  Clear picture, night vision is clear.  Being able to check from the web is great.  Recording is easy to set.  Overall i recomme d this system to anyone looking for a mid priced solid system", "Date": "October 6, 2012"}, {"Title": "Expensive if free. Look elsewhere.", "Author": "Jorge Ma Trevino Garcia \"Jorge M. Treviño\"", "ReviewID": "R18M3UFXSFEJOF", "Overall": "1.0", "Content": "I didn't buy this at Amazon, since they won't ship epectronics to Mexico (my country of birth & residence). Got this at Costco at a better price but it's going back.Pros:Very easy to setup. Once the cameras were fixed in place, the rest took under 15 minutes.Hardware looks well built and with decent materials.Cons:Worthless for residence vigilance. The cameras resolution makes impossible to recognize people. The power feed can be disabled in seconds.The remote video works only in Windows (I had to set a Virtual Machine in my Linux system).Even with a Windows box, it requires MSIE. Forget using any other browser.The instructions for setting up the portal are wrong and the link is hidden.The Android phone app requires a WiFi connection. Won't work through my 3g data plan. Even when connected, the video feed takes ages to show and works at will (not a frequent disposition).In sum:It's going back.I cannot recommend this to my worst enemies.Search elsewhere. I've heard good things about the better resolution wireless Foscam cameras which I read can be set independently of system.", "Date": "November 22, 2013"}, {"Title": "Woeful, not worth it if free", "Author": "Eric", "ReviewID": "RF8XC86Y7HWX", "Overall": "1.0", "Content": "I did not buy this through Amazon, I bought it through a local wholesale dealer.Pros: Hardware seems to be well built enoughPriced reasonable (if it did what it's supposed to)Cons:Cameras have AWFUL resolution. 320x240. Come on, this isn't 1992.GUI is terrible. Even with the firmware update, it's clunkier than a geocities websiteThe uniden remote viewing link only supports IE and forces you to download one of their own plug-ins.The remote Android app is terrible. Even though I am connected, account set up and everything, my cameras say \"NOT FOUND\" 99% of the time, even though 1% of the time it does work. When it does and does not is a mystery.I could probably live with the remote viewing shortcomings and clunky software, but the image quality is so bad it's useless as an exterior camera. Maybe if it was only being used indoors as a security cam with 20' or less to the target it might be acceptable, but as it is no thanks. This piece of junk is going back to the store. Uniden has no excuses marketing this junk in 2013.", "Date": "November 18, 2013"}, {"Title": "Almost perfect", "Author": "Shipping!!!", "ReviewID": "R2Y1723J0O4ZFY", "Overall": "4.0", "Content": "I want to give this product a 5 star rating, but the app needs some more feature & control. Please design an app with some control setting & I will gladly pay for it.This DIY monitoring system is great if you're looking for portability.If there's nobody home we leave it locked in a cabinet & connected to the Internet so we can watch it using our smart phone.If the kids arrive from school they take the monitor out so they can watch the outside of the house.At night, the monitor is our night light. We have installed a motion sensor outside our house, if it beeps, we just look at the monitor on my side table. I wish there's a dim switch bcos the monitor is a little brighter than a night light.It's great with 4 cameras.Oh don't buy the portable indoor camera. Just buy the regular cams even for your indoor use.Overall it's a great product", "Date": "January 20, 2013"}, {"Title": "Good unit- bad service!", "Author": "James N. Murray", "ReviewID": "R3G8KLDWQJGZNX", "Overall": "2.0", "Content": "System works good.  But one of the cameras quit after 20 days.  The service department for Uniden is the worst I have ever seen.  No one returned e-mail, calls or letters..... After a lot of yelling I finally got a replacement camera..... They need to fix their service department.Jim M", "Date": "November 26, 2012"}, {"Title": "Great product!!", "Author": "Michele L. Norris \"lake girl\"", "ReviewID": "R1SCWW09LNMAJQ", "Overall": "5.0", "Content": "I have the G755 model.  Easy set up!  Once I figured out that I needed to upgrade my wireless router (small expense) so that it had a port to connect the ethernet cable for the cradle, I was up and running with remote access!  I can watch what is going on from my ipad and iphone from anywhere, at any time!!  Amazing!  I ordered an extra camera.  I read some reviews on another site about people having difficulty pairing additional cameras.  I am not expecting an problems because I made sure to order a camera that specifically stated it was compatible to the G755 and G455.  Buy this model!  It is awesome!  (I got mine at Costco in TX for $399!!)10-16-12 Update - I purchased an additional camera...made sure to order the correct one...pairing was easy!  All three cameras work perfectly!  Love this system!!", "Date": "October 8, 2012"}, {"Title": "G455 system works just as expected", "Author": "Dale A.", "ReviewID": "R3CK2CST9GG4UJ", "Overall": "5.0", "Content": "This system does just what is advertised. A little sensitive on the motion sensing, even set on low. But that's okay. Other than crawling around in my garage attic to get power to the cameras, they were a breeze to set up. Have had the system a couple of weeks now and it works great. Intention is to get maybe two more cameras to complete the system. There have been some reviews on here saying that it does not time stamp. It does, to the second when the recording starts. You just have to understand the way it is presented on the mp4 file when you scroll through them. Received the system in perfect order. I would highly recommend this if you are on a budget. Of course it's not a high end system, but what you get for the money is more than worth it. Have not used the internet hook up because I don't feel I need to. I just wanted a system that would record what goes on when nobody is home.", "Date": "August 13, 2013"}, {"Title": "Works Great", "Author": "Nate", "ReviewID": "R1SDFU4CIFQPNW", "Overall": "5.0", "Content": "Very Impressed with this camera system. It is just what I was looking for. I did upgrade the SD card to 32G for longer record time.", "Date": "January 6, 2013"}, {"Title": "Uniden Guardian 755", "Author": "G. Trias \"GodFather\"", "ReviewID": "RQFXPBTQDR48P", "Overall": "3.0", "Content": "This surveillance system rocks for the price. Don't expect a surveillance system that monitors as if it were protecting a nuclear power plant or something like that. Its motion detection is pretty good - starts recording even when my hallway lights get turned on (setting was at low). Internet connection was perfect. I could actually use my iphone while away from home (resolution was waaay better on the iphone).Overall, the Uniden Guardian 755 is an excellent surveillance system and very easy to set up.\"hmmm\" you say \"why 3 stars?\"  Oh yeah, the Customer Service blows chunks.  I ordered a third camera online through Uniden website over 10 days ago and the product still hadn't arrived. So I called Uniden and the customer service person had no idea what I was talking about. After several minutes of explaining and giving her my order number, she finally found it. I asked for a tracking number which she gives me, but because of her very strong accent I could barely understand her. Sooo I asked her to email it to me and she tells me they can't do that because they already emailed me the information. I again tell her that they did not email me and I've checked my spam box. Her response was \"i'm sorry we cannot do that.\"  Okay at least she told me it was FedEx and it should be arriving soon. So i hang up on her and check FedEx with the number she gave me - hmmm, guess what? No such number.  Well, standby for the continuing saga of The Lost Camera. Its probably because of the holiday shipping.Anyway, product was good, service sucked.", "Date": "December 18, 2012"}, {"Title": "Wireless only works up to 30 feet", "Author": "Charles", "ReviewID": "R1ETLRHMMB50GU", "Overall": "1.0", "Content": "Everything works great except signal strength. Product claims that receiver should work up to 500 feet. It only worked up 30 feet!!! The fine print details the line of site is required for 500 feet which is ridiculous since the cameras are for outdoor use and I want to monitor them from inside my house. I returned the product.", "Date": "December 12, 2012"}, {"Title": "Incredibly simple to use!!", "Author": "terryo", "ReviewID": "R3J7RUZCQCS57A", "Overall": "5.0", "Content": "I was skeptical about the \"plug and play\" description...But I opened the package at 1 pm, and by 1:15, I was looking at video on the portable terminal!  Granted, I didn't mount it permanently to where the cameras need to go, but I certainly can attest to the plug and play ease!As for remote monitoring, (I use an iPhone 4s) I downloaded Uniden Guardian 2 from the App Store, did about 5 minutes of setup, and voila, I had video on my phone!  My only gripe is that I wish the descriptions in the app store were clearer.  I used trial and error to figure out that Guardian 2 (not Guardian) is what I needed for this G766 system. Also, be patient, as it takes a couple of seconds for the camera to connect and display on your phone.There is no app for the iPad, but if you sync your ipad on the same computer as your iphone, just transfer the app over and you'll be able to see it on your ipad.  I use the latest iPad3.Thanks for a superb product!  I'm going to order 2 additional cameras!!", "Date": "October 25, 2012"}, {"Title": "Good but could be better if they add more features to firmware or software", "Author": "Tuan S. Tran", "ReviewID": "RON32U5789ZJ", "Overall": "4.0", "Content": "My initial thoughts as of 6/4/2014:It works as advertised for the most part.The good:* Cameras are displaying to main unit just fine.  You should not have too many barriers blocking or it would affect the connection.* The image is clear although it is around 320x240 at around 14 FPS.  The night vision is also decent.* I can stream to android and PC devices.  I'm actually looking at my cameras now at work.The bad or what I wish could be improved:* The scheduled recording is a one-time scheduling.  It does not offer a continuous, periodic recording schedule.  I find this hard to believe given this is for survelance.  They should fix this with a firmware update.* The AC adapter does not fit in a single gang outdoor outlet cover.  I've various types of single gang outdoor covers and it does not fit in any.  I had to install a 2 gang outlet to fit this.* They advertised the following but I cannot find what was mentioned:** Firmware updates can be found from uniden.com or unidenvideo.com.  I cannot find a new rom file to udpate with.** Android apps can view recorded videos from base unit.  There is not feature in the Uniden Guardian 2 app to do this.I still like this product and it still has a lot of potential if Uniden improves the firmware and the Android/PC app functionality.  At the moment it is limited by the SW provided.I'll add more as I have more time to play with this.", "Date": "June 4, 2014"}, {"Title": "Don'e waste your money on this...", "Author": "Xris", "ReviewID": "RH5IC94R3X244", "Overall": "1.0", "Content": "Or any other junk from Uniden. They don't support this if you use anything other then Windows with 32bit. Come on people my cell phone is 64bit... Not able to find the firmware to update this thing either. Just send me your money. Or toss it out a window. Better that then to pound your fingers to the bone on a keyboard looking for help from Uniden...I'm sorry just a little miffed. Can you tell?", "Date": "June 4, 2014"}, {"Title": "Uniden Guardian = awesome", "Author": "Robert Scott Claypoole", "ReviewID": "R1LPH5AOAGRG9F", "Overall": "5.0", "Content": "Excellent ...as expected...wish volume was louder but that is my only complaint  otherwise this is an excellent  piece of equipment", "Date": "June 4, 2014"}, {"Title": "Happy with purchase", "Author": "C. Brown", "ReviewID": "R3QBV8LWDKPL49", "Overall": "5.0", "Content": "I brought this  uniden system refurbished  From a domo electrons  in Texas on amazon. They were very quick with the shipping . Very good  customer service. I brought the system in December 2013 , when we had very  cold weather -45 and the cameras worked with no problem . I have since upgraded to 4 cameras . The only bad point is uniden customer service is very very poor., but the company I brought the camera system from  were very  good.", "Date": "May 21, 2014"}, {"Title": "For the price, a great unit", "Author": "Sandra V. Ohlson", "ReviewID": "R2RP3YP7Y3G6IT", "Overall": "5.0", "Content": "I had this up and running in about 30 minutes.  Didn't bother with the online setup, just downloaded the app, put in my DID and password and bingo, I have display on both iPhone and iPad. I have one camera over 40 feet from the base unit and it is displaying clearly and crisply. We put in adapters to our outdoor lights for the power source which makes it easy to hide the extension cords.  I will update if any problems, but as I said, for the price ($266 at Costco) it's a great unit.  And, I am not experiencing any wi if interference problems.", "Date": "May 11, 2014"}, {"Title": "Defective Camera. And they refuse to replace it.", "Author": "Eli Lambert", "ReviewID": "R1EC7WSXJ3R8EX", "Overall": "1.0", "Content": "To be fair, the one camera that works does a great job, especially at night. Although you should know that you need the monitor unit plugged into the internet hardline to get camera image on your phone. That's minor.One of the cameras did not work at all. I got the return approved and sent it back, and received the same defective camera back in the mail. Now they are not returning emails. Buyer beware.", "Date": "May 1, 2014"}, {"Title": "Amazing Seller/Product", "Author": "W T", "ReviewID": "RYUOCEF2EQ4EB", "Overall": "5.0", "Content": "Customer service provided by vendor was above approach. Item was purchased used, there was concern with the screen once arrived. After contacting the vendor, they immediately provided a replacement next day. Amazing customer service, and would conduct business again. The quality of the cameras performed perfect out of the box, set-up was easy. Loved the ability to set-up wireless without having to install wires around the home. Day operations provide clear visual of cameras view area, during the night ensure that you don't mount within the view of trees or lights. Reason being your cameras if set to record will capture hours of bugs and trees blowing in the wind. With that said, you do have the ability to adjust sensitivity or select not to record. The ability to connect over the internet hasn't been tested as of yet. However, I'm looking forward to the ability to monitor my home on my smart phone. Thanks.", "Date": "May 1, 2014"}, {"Title": "What's Going on at Home", "Author": "Michaela Clooney", "ReviewID": "R29OP2EIID559Y", "Overall": "5.0", "Content": "We are happy with this system. It is great to be able to look at our property when we are away. If you have the camera inside pointing out of a window at night(during daytime it is great) it is useless because all you see is glare from the camera. Mounting it outside under a porch or eave would alleviate the problem or having it indoors pointing toward your door would also work. Pictures are very clear. It is great having the  gmail notification come through my phone when there is movement at home sensed by the cameras.You can select the sensitivity of the cameras to a degree so that you don't get a notification every time a leaf blows across the camera view. You can also check the weather back home when you are away.", "Date": "April 27, 2014"}, {"Title": "Good product", "Author": "Youhaftabekidding", "ReviewID": "RE73H9C1M7MH1", "Overall": "5.0", "Content": "Great system, I couldn't be happier with it. High quality resolution and superb picture even when dark. I mount the two cameras, and a third i added, to my rv when stopped at an rv park. Small but good resolution monitor fits nicely on the nightstand. They let me see what may be going on around the rv when i can't see out.", "Date": "April 25, 2014"}, {"Title": "Short Range Video ** Read Prior to Web Setup**", "Author": "Brent Yatman", "ReviewID": "R22H42HA2QVUEJ", "Overall": "2.0", "Content": "Out of the box my cameras would not authenticate on the web interface.  I knew I was typing in all the information correct so I finally called Uniden (after I was already frustrated).  The tech department was very nice and was evidently aware of this problem.  They ask you to read them the numbers off the cameras then the change things in their system.  Once they make the change you can log on to the web interface.  It would be nice if they fixed the issue before selling the product.  Hopefully they fixed the new models.On to the review....This camera had marginal video quality and did not hook up at the distance that was claimed.  I work at a place that has a fair amount of electrical interference but think that 50' line of sight should have been close enough.  The video capture modes work well.  We set it up for auto record on motion which worked better than I thought it would.  One thing I did not like is that you couldn't have both cameras video pulled up at the same time on a web browser.  It will record both cameras video while on the web interface but you need to open two browser windows.", "Date": "April 24, 2014"}, {"Title": "works with good range but absolutely not outdoor viewable which makes it much less useful for my purposes", "Author": "rmstr", "ReviewID": "R15PUPQ4OGOKMF", "Overall": "4.0", "Content": "works with good range but absolutely not outdoor viewable which makes it much less useful for my purposes.  For indoor use I think it is a simple and effective and very convenient package", "Date": "April 18, 2014"}, {"Title": "Good hardware, so-so software", "Author": "Cut and Run", "ReviewID": "RRIU2ERFENHC0", "Overall": "4.0", "Content": "Configuring this system for local use is very easy and the range of the wireless cameras is pretty good.  It's easy to switch between cameras (the default is a quarter screen of each connected camera).  Any motion causes recording to start automatically.  Image quality is ok, especially considering the price (I bought mine refurbished).  That's the good.On the other side, remote viewing on the internet is clunky and doesn't always work for me.  If the system is set to connect to the internet, almost none of the controls/menus operate.  I tried to set up the e-mail notification system (sends an e-mail when motion is detected) but I can't get it to work.  There is an alarm function, which I thought would sound off when motion is detected, but again, I can't get that to work either (maybe it's just an alarm clock).The Guardian system does what I really need it to do, so I will be keeping it, but if you are looking for an internet connected system, I would look elsewhere.", "Date": "April 8, 2014"}, {"Title": "A MUST BUY!", "Author": "Henry Perez", "ReviewID": "R3H4O3BY9DKWG8", "Overall": "5.0", "Content": "Love it! Works absolutely flawless. Real sense of security.  Very nice view on my iPhone and iPad. Definitely adding 2 more cameras to it.", "Date": "April 7, 2014"}, {"Title": "A little better deterrent than fake cameras.", "Author": "whidbeyben", "ReviewID": "R1J5LJ2YOO8737", "Overall": "2.0", "Content": "Video images are low resolution.  You won't convict on even a direct facial still image from 6'.  No way you'll get license plates either. You'll see what happened, but won't be able to pin it on who dunnit unless they have a unique peg leg and drive a van with a giant bug on the roof.  But the system is easy to set up, and works as advertised.  It does not loop recordings- it stops when the memory card is full, then no more.  So you have to swap out or erase the card on a regular schedule to keep any video evidence of events.  Not good for unattended monitoring. They should fix this in firmware to loop record.  For primary deterrence, I'm hoping it will encourage opportunistic burglars (meth heads) to go to a different neighborhood when they see they have been caught on camera as they approach to ring the doorbell to see if anyone is home.  That is the most common form of burglary now adays in our neck of the woods.  If nobody answers, they go around to the back and smash in the back door.  For the price, this works great for this purpose.  A true megapixel surveillance system would be 4-10x more expensive.  This would also be a good pet cam because the remote access via smart phone lets you view live images, but not recorded images.", "Date": "March 15, 2014"}, {"Title": "I've seen better.", "Author": "Reviewer", "ReviewID": "R2YQF66PBFK92I", "Overall": "3.0", "Content": "For a temporary system - it works.  But, it doesn't work on the Mac, and the online thing that you have to register through before using it with anything except the monitor - predictably, doesn't work.  The battery on the screen is terrible.  It barely holds a charge, thus rendering it almost useless, unless you have a way to plug it in every 10 minutes.Not the best, but in my house im renting, and for the next 5 months, i'll have to do.  I really like that it records once it detects motion, and for a while after the motion stops.Bottom line: as a temporary fix, it's perfect, but it's really expensive, and for the issues i've had - justifying the cost isn't easy.", "Date": "March 12, 2014"}, {"Title": "A full-featured and affordable two-camera security system", "Author": "abitofbs", "ReviewID": "R36U7OG1E4LOVW", "Overall": "5.0", "Content": "I purchased the Uniden Guardian G755 system refurbished from a Marketplace seller in like-new condition for less than half the price of new, and I'm very happy with it. The cameras pair with the display right out of the box. Each camera has a five-foot built-in power cord and an additional five-foot extension.  Installation is simple -- just mount a bracket with a swivel ball end that attaches to the camera. FYI - the cameras have 1/4-inch screw mounts that will work with any standard photo tripod mount. The wireless display makes it easy to review and adjust the camera position during installation. I'm using two cameras within 60 feet of the base station and have never lost a signal.The display charges in the base station and can be used off the charger for about two hours. It has touchscreen controls that are not as sensitive as using your smartphone, but still handy to set up recording modes, view recordings, and manually start and stop recordings from the main screen. If you're using motion detection settings, the unit records two minutes of video each time it's triggered by motion seen by the camera, and you use about 4 MB of memory card space for each two-minute recording.Motion detection can be set to low or high sensitivity, and mine has been triggered by everything from birds flying by, to a squirrel crossing the driveway and precipitation. Snowfall will trigger the motion detection, so you'll have lots of footage to review if you leave the system on overnight during a snow storm. Also, if you mount the camera where it can see traffic on the street, it will trigger with every car that passes.Reviewing the footage is simple -- you get a calendar view showing days when recordings have been made, then touch to view a list of recordings for each camera. You can erase from that list directly, or review and quickly erase anything that's not needed. Because the system starts recording on the first sign of motion, you'll know within the first 10 seconds of footage whether it's something you want to save. The unit uses standard-size SD cards that are very affordable and easy to transfer to your computer for archival storage.The infrared night viewing feature is very good - it looks as bright as day, but in black and white. The camera field of view is good too. I have one camera mounted about 10 feet up on my garage that can view the 25-foot width of driveway and down it toward the street for about 30 feet. Resolution is not super-sharp -- you can't make out license plate numbers or faces unless the camera is a lot closer.The Internet viewing feature requires that you keep the display in the base station and connect the base station to your router via an Ethernet cable. The recording feature is disabled when using the Internet viewing, but you can take snapshots using the smartphone app or when viewing from your computer browser.All in all, it's a great product for what I need -- a few extra pairs of \"eyes\" to keep watch over my property. And the refurbished price of under $200 makes it even better.", "Date": "March 5, 2014"}, {"Title": "Uniden Guarden Video Surveillance System G755", "Author": "John F. Smith", "ReviewID": "R3P07OZCLF90SW", "Overall": "5.0", "Content": "Delivery was right on time easy set up take them out of the box and there ready to go so much better them i expected the picture quality is very good the night time really impressed me so much better then i expected I do recommed it for home use Love it", "Date": "February 14, 2014"}, {"Title": "Great video and easy to install, may require long wait with customer service to register unit.", "Author": "Derf", "ReviewID": "RBRVSZBJI41PK", "Overall": "4.0", "Content": "Pros:  From a technical standpoint I would rate the system 5 stars.  It was very easy to install and no issues at all with cameras connecting to the the display unit.  WIFI reception of the video is perfect in any area of my two story house.  Daylight images are very good and night vision is quite good out to about 40 feet.  Video at night does smear with moving objects but any pause allows good enough image to identify facial features.Cons: Motion detection is quite sensitive so windy days and stray lights result in a lot of recordings that are tedious to scan through.  There is a reasonable buffer, so you get video from a few seconds before the trigger event and this does help to determine interesting or not quickly.  No intercom would make the system a poor choice for interaction with visitors at the door.I read some reviews that complained of not being able to register their units.  This did happen to me and I had to call the customer service number.  The wait was at least 50 minutes, but once the representative answered, she was able to manually input my system id.  With the system id in the database, the rest of the process completed per instructions and I was able to view the camera video at my pc.", "Date": "February 12, 2014"}, {"Title": "Wireless system", "Author": "DARIN COGDELL", "ReviewID": "R2MPZVM21ING98", "Overall": "4.0", "Content": "Excellent product for the price.I would recommend to all who wants to have a wireless system and it's easy to setup", "Date": "January 30, 2014"}, {"Title": "Love it", "Author": "E. Adams", "ReviewID": "RD392V5DPTAH7", "Overall": "5.0", "Content": "We have now had this for over 6 months and love it.  It works just as its suppose to.  We like being able to pull up on our iphones using the app and on our ipads.  We did have some problem trying to pull up on our new computer, but I didn't try real hard to get that fixed since we use our phones & ipad the most.  We can take the SD card out and put into the computer to see everything better. It's neat being on vacation and being able to see whats going on at the house.  When we first got we had a sick dog so we left the camera in the house so we could keep an eye on the dog, that was nice.  Works great....Very pleased.  We did purchase the 2 additional cameras, so now we have 4.", "Date": "January 23, 2014"}, {"Title": "Good Unit and by far easiest setup", "Author": "Skeet", "ReviewID": "RD0JFUJFJ4SWA", "Overall": "4.0", "Content": "I now have three of these units and 8 cameras (total). So far I have had virtually no trouble with any of the units. Picture quality is quite good daytime but less so at a distance at night. I only have three gripes...1) even on the least sensitive setting the camera triggers far too easily. Car lights, street lights, wind blowing shrubbery, etc. will set them off. 2) there is no way to remotely view the recorded camera feed and 3) the cameras are fixed and do not move, limiting the ability to pan/tilt locally or remotely.The above said, I do like the units and have recommended them to friends. The main attraction to me has been the ease in set up. I also own several Panasonic cameras that allow remote pan/tilt and remote access to recordings. However night vision is nonexistent, they are all inside cameras and set up is very cumbersome.", "Date": "January 13, 2014"}, {"Title": "Great Surveillance System", "Author": "Edwena", "ReviewID": "R34PBCKQUZDP5K", "Overall": "5.0", "Content": "I purchased this product for a local non-profit organization and it is great.  Being able to access the facility by iPhone is even greater and from the office area on the monitor.  I have this product in my home and it is great.  The night vision is awesome.", "Date": "January 13, 2014"}, {"Title": "Uniden Guardian Wireless Video Surveillance System", "Author": "Deek", "ReviewID": "R2PUX24WHOHBJS", "Overall": "4.0", "Content": "The wireless video system was easy to install and operated as advertised. I am very satisfied with system and have recommended to my friends.  One of cameras stopped working.  Contacted Uniden customer support and they replaced the camera immediately under warranty.", "Date": "December 29, 2013"}, {"Title": "Good system with easy install and set-up", "Author": "Jason Amoss", "ReviewID": "R383V9KL3BWI02", "Overall": "4.0", "Content": "Ordered this system to keep an eye on home entry points.Wireless setup was very easy.  Installed both outside and have good reception with control unit.Android and iOS apps work as described.  You can view live video and take photos.Set up record function using motion detection.  Even Low setting is pretty sensitive.  Snow flakes blowing into the field of view will trigger recording.Video is not HD but adequate for what it is supposed to do.  Low light and mixed light conditions still produce decent video,.", "Date": "December 27, 2013"}, {"Title": "Up and running in less time than it took to read the manual.", "Author": "joe", "ReviewID": "R9R6V04HNJ55B", "Overall": "5.0", "Content": "Very impressed - plugged it in and we were up and running.  I have not tired to connect it to the web and don't know if I will.  I added a 3rd camera, indoor, and it sync'd right up  I will be adding a fourth camera.", "Date": "December 12, 2013"}, {"Title": "I'm happy with it", "Author": "Consumer", "ReviewID": "R22LTX7VZZR8JA", "Overall": "4.0", "Content": "I read a lot of negative reviews of this product and was wary of buying.And I had a lot of problems getting the system set up,took me several hours of head scratching frustration.Getting connected to the internet You do have to call customer service and give them your DID number, but that was a 5 minute phone call and I'm ok with that.But you have to remember to set your handset  to internet access and follow the internet explorer settings to the letter.Setting up the system was simple getting the internet portal to work was frustrating.I'm happy with the picture quality though,and the range is very good.Even through brick walls 90 feet from the handset I had three bars.The video quality is better than the Logitech system I bought,I just wish Uniden would make there system as easy to setup and convenient as the Logitech system.", "Date": "November 1, 2013"}, {"Title": "Excellent for the average person", "Author": "P. Hradkowsky \"Paleo Dog Lover\"", "ReviewID": "R2JCYJ81TZQKXJ", "Overall": "4.0", "Content": "I wanted a system with its own pad I could take to parts of my house where I cannot see the front.  This system was easy to set up and easy to use so far.", "Date": "October 19, 2013"}, {"Title": "another disappointment", "Author": "taxt", "ReviewID": "RHL9J4NTTYOC0", "Overall": "2.0", "Content": "I'd tried the Defenders and SVAT, but they seemed to have downgraded the strength of the signal, making them almost worthless, tried this more expensive item but was just as disappointed.  The signal was fine when the monitor and camera are in the same room, but the signal wouldn't come in at all after 10 to 15 feet, not at all what I needed.  It wasn't a problem to get credited for the return, though, so I'll plan to try other brands until I find one as good as the original Defender systems I've used so many of.", "Date": "October 7, 2013"}, {"Title": "Pretty good set...", "Author": "Reba", "ReviewID": "RCH3M5UBMHDWQ", "Overall": "3.0", "Content": "The 2 cameras that came with system pkg are perfect for what I needed.  The two I ordered w/the set would not pair so I order two other cameras - different models and still have not achieved pairing!!!!!  If I don't accomplish this feat quite soon everything will be returned.", "Date": "July 23, 2013"}, {"Title": "Not so great", "Author": "Maureen J. Freund", "ReviewID": "RPX212MRQQGQS", "Overall": "2.0", "Content": "It doesn't have a long range.  We had it in the garage to monitor by our gas tanks and the receiver couldn't read it, so we were missing people driving up to the tanks.  We had to put it outside under something to be able to view it.", "Date": "June 19, 2013"}, {"Title": "Not bad", "Author": "Debra Gordon", "ReviewID": "RDBHP0GSSN7S9", "Overall": "3.0", "Content": "I am relatively satisfied with my purchase but I do have an issue one camera doesn't work consistently. It looses signal. To make sure the cause we switched camera locations. Regardless of where this camera is , it still is inconsistent. I think I need another camera.", "Date": "May 16, 2013"}, {"Title": "Amazing and easy setup", "Author": "Carlos", "ReviewID": "R3CLXSYEEL46YF", "Overall": "5.0", "Content": "This is a great product, i've been using with no problems at all; maybe new firmaware will be necesary in roden to get recording with audio. 100% Recommended for all of you.", "Date": "May 16, 2013"}, {"Title": "I really like this video camera", "Author": "abbygirl", "ReviewID": "R1YU6A5X6AUXFS", "Overall": "4.0", "Content": "I really love these video camera & it's really been helpful now to see who is at my door before answering it!! :)", "Date": "May 8, 2013"}, {"Title": "Easy to install and great video", "Author": "Scot Ford \"Instructor\"", "ReviewID": "R308NM59ZQW1KV", "Overall": "5.0", "Content": "For the money you cannot beat this system.  I currently have two cameras and I amattempting to buy to more.  They are currently out of stock and I understand why.  Thissystem is easy to install and use.", "Date": "April 15, 2013"}, {"Title": "Better than what I had", "Author": "Celtic Girl", "ReviewID": "RWOHB3AKL4F5H", "Overall": "3.0", "Content": "What we had before was nothing, but it is definitely not high end. I'm not going to complain about the quality or the fact that the motion is either on or off, because frankly I can see what is going on when I'm not able to physically see what is going on. I do have concerns over the time stamps though. I've set the time and date and when I do playbacks neither are correct. If anyone has any hints they can pass along I would love to fix it. For example, our trash day is Monday. At 6:43 in the morning the trash should still be sitting there, well, the garbage truck - that I KNOW doesn't run that early at our house - was picking up the trash. Then at 6:45 the cans were all gone. I know that didn't happen either. So, I would love some help in getting an accurate date and time. Other than that, I'm happy with the amount of money spent and the coverage I now have", "Date": "April 14, 2013"}, {"Title": "Suveilance cameras", "Author": "Jeff S.", "ReviewID": "R306JPVLY5A11G", "Overall": "3.0", "Content": "The image these cameras produce is excellent, but the range in a house is nowhere near the 500 feet claimed. I can't position this where I needed it most, and that is roughly only 60 feet away from monitor.", "Date": "April 12, 2013"}, {"Title": "Nice unit", "Author": "NJT", "ReviewID": "R2UHU834E9XEWH", "Overall": "5.0", "Content": "For the price it does a nice job. It serves the purpose of my need which is to have eyes outside.", "Date": "March 4, 2013"}, {"Title": "So Far a good system, but company customer Service, no so great", "Author": "J Burch", "ReviewID": "R2AE20QH4SBUQ0", "Overall": "4.0", "Content": "So far the system itself, has been great, added, two additional cameras, and it's been working great.  We have viewed with no problems on both our tablets, iphones and computers.  Unfortunately we do have older operating systems (vista and windows XP) and I believe Uniden does need to upgrade their system to be compatible with the newer verions of operating systems, but so far I am happy with system, well my husband is, it makes him happy.", "Date": "February 7, 2013"}, {"Title": "Remote viewing will not work and customer service almost non existent.", "Author": "Joyce", "ReviewID": "R34FEZ4ONTNTJ9", "Overall": "2.0", "Content": "I bought this product for the remote viewing that it promised.  The set up was not real clear in places for a normal person and the remote viewing never worked.  The automatic settings, obtained via the internet, that was required to make it function would not work.  I had a professional try to set it up to no avail so I know it was not just my ineptness. I needed this in a hurry after Thanksgiving and customer service was closed for almost a week.  If you are going to use this for local viewing it gave a decent picture.  Another drawback is that if the power goes out you have to be there to turn it back on.  Remote viewing means you are not home so who is going to turn it back on?  It needs to reboot itself when power comes back on to be truly useful.", "Date": "December 20, 2012"}, {"Title": "Uniden G766/G755 Survellence - Works well", "Author": "C. Johnson", "ReviewID": "R3CO96PJXRJAXS", "Overall": "4.0", "Content": "I had no problem installing this system, connecting using ethernet cable, getting online with the cameras and watching the camera (one at a time) online using Windows 7, Internet Explorer 8, an iPhone app Uniden Guardian 2 and on the a Galaxy Tablet 10.1. The Android Galaxy Tablet seems to have only one choice, Camera 1. I have not been able to switch to Camera 2 because the option drop down listing in the Android app does not work on my tablet. It DOES work on the Iphone app.I did not have to install anything on my PC to make the video work, I just go to the Unidenvideo.com website, setup an account with my DID number, sign in with user ID and camera password. Only (IE) Internet Explorer works but you must install OCX (download from website) on the computer before you can watch the video live. I cannot use Firefox to watch- only Internet Explorer.The iPhone Uniden Guardian 2 (the old blue/white app does not work for this model) works great. The app for the Android has a problem not being able to connect to Camera 2 because the option drop down list does not work on my tablet.Customer Service by phone, is not too good in my experience- I lost them (by accident or on purpose, I don't know which) on the phone while being placed on hold after trying a few things they told me to do that didn't work- they put me on hold and I got rerouted as if it was a new call. It frustrated me so I hung up. But their ONLINE form request is better but you have to wait one week for reply even though it read 3 days. Their answer was good and solved problems I had such as the app that I downloaded the old version instead of the new \"2\" version which solved the problems. I have send 2 different problem request by Form and they solved both. But I did have to wait a week for an answer.The camera does record on the SD card simultaneously while connected on Internet. The unit's Option to setup a timed record could be better. It is way too time consuming to setup on a date basis. I did not find an option for daily time recording instead of choosing a date for a week. I did not spend a lot of time trying this function.All in all, I think this is a good product for the price. It does what it said it'll do. I am pretty happy with it. I've had it for 8 weeks.", "Date": "November 25, 2012"}, {"Title": "Ok system", "Author": "danny", "ReviewID": "R1O050XEM0ZVGU", "Overall": "2.0", "Content": "Enjoyed it but once I up graded my phones to the iPhone 5s it no longer works. I have contacted Uniden with no luck they just give you the dance and blame Apple. Guess I will have to take it down and upgrade to a Samsung system. Recommend you not buy this unit software was extremely poor now it's useless.", "Date": "December 17, 2013"}, {"Title": "cheap", "Author": "Amazon Customer", "ReviewID": "R1AINAYHQW0NZI", "Overall": "1.0", "Content": "The first time  I plugged in the monitor I smelled elec smoke than stopped working all together..do not buy this its expensive to buy and cheaply made", "Date": "December 4, 2013"}, {"Title": "Thieves Beware", "Author": "TMac", "ReviewID": "R1AUZBODX3FQWG", "Overall": "4.0", "Content": "I love the system, works as intended for the outside perimeter of house. Austin Texas has gangs of Motorcycle thieves that work areas and I have already been a victim.  So far they have stolen 1800 motorcycles. It may not get them but I will have pictures and if I can figure out how to get a message on my IPhone 5 that would be great.", "Date": "September 11, 2013"}, {"Title": "Wow i love it, Easy to use and great video and playback", "Author": "kingtag", "ReviewID": "RC5THB6I8HPD3", "Overall": "5.0", "Content": "I went out to buy a security camera system and a bought a hard wire system which was more money.and realized it didn't satisfied my needs. I wanted something easy to use and image quality was very important. Well here it is good price for what it can do. I wish it came with more cameras but that's the way it goes. I was concerned about distance because of my detached garage but not a problem. The monitor which comes with the unit is great. Now the only question is will the product hold up for years or not?  So far great product  and now getting ready to purchase one more camera!", "Date": "August 30, 2013"}, {"Title": "Excellent Product", "Author": "Security Man", "ReviewID": "RAR1Y2XIOM3NS", "Overall": "5.0", "Content": "This product works as advertised.My particular situation requires that I be very portable and mobile and this product fills the bill.Along with my other portable and mobile, triple redundant motion detection systems, I can easily look, day or night at whatever is activating my security defenses.If it's bear, deer, moose, elk or raccoon, I can see it. If it's vehicles or persons, I can immediately determine it and respond accordingly.The system is great for giving one an eye view of what they want to monitor.I usually live in a home of at least 3000 sq ft with 2 stories at a minimum and have never had a problem whatever!I use 4 cameras and there is no place within the homes that I cannot get a perfect signal.I haven't yet used the WiFi to view from afar via computer, but will do so this winter when I can connect to an internet.Rest assured, Uniden Tech Support, if I need them, will respond appropriately. I have all the faith in the world they will do so...", "Date": "July 20, 2013"}, {"Title": "more hype than function.", "Author": "Subdiv6gurl", "ReviewID": "R3JAW3FEPQOE97", "Overall": "2.0", "Content": "primitive technology. bad interference. lousy microphone. overpriced. sorry Uniden.... I really wanted this to work out. oh well. hello foscam!", "Date": "April 1, 2013"}, {"Title": "awesome", "Author": "DD", "ReviewID": "R2E3W3OZ7U98HY", "Overall": "4.0", "Content": "I purchase these cameras about a week ago, and they work great. I had no problem installing the cameras,but the bad part about them is , if you don't have an outlet close by them or your outlet is more then 10' away you would have to buy extension cables. you can't get them any were alse. Great product.", "Date": "March 4, 2013"}, {"Title": "I LOVE IT!!!", "Author": "CJ", "ReviewID": "R2S7KFEPY6YCG3", "Overall": "5.0", "Content": "So far its awesome, I have my uniden camera inside a camera housing and there is no loss of reception at all! I defiantly recommend this system! its awesome! trust me I have tried others and nothing matches upto the quality of this one, even the resolution kicks butt! I will let you know if anything goes wrong but so far so good. Oh yeah if your going to buy this system defiantly put it in a protective camera housing so it doesn't get vandalized or stolen! Cause if you live in a bad area someone might try to steal the camera's from you if you plan to put them outside I can't stress that enough! But please put them in protective covers!", "Date": "June 14, 2013"}, {"Title": "The Guardian G755", "Author": "M. Sedillo \"Mike in NM\"", "ReviewID": "R3F30NKS193K2Q", "Overall": "5.0", "Content": "I found the The Guardian G755 Advanced Wireless 7-Inch Screen Video Surveillance System with 2 Outdoor Cameras features a 7-Inch color touch screen display at Sam's Club in Albuquerque for $349.99.  I'm not sure if it is available at Sam's Club online website for this price also.  I know the Uniden Guardian cameras for both the G755 and the G455 are also available in White, I just wish you had the option to choose which color you want with each G755 or G455 packet. I think the new Guardian Security camera systems are far superior to the older Uniden UDW20055 Wireless Video Surveillance System.", "Date": "September 22, 2012"}, {"Title": "Limited use", "Author": "Gray Kinney", "ReviewID": "R3LAPGNC5MS5F5", "Overall": "4.0", "Content": "Basically you can stream to the internet OR record locally and review later. If you are OK with recording locally and then reviewing the content if there is an issue then these are fine.If you fill up the memory card, recording stops. This is a bummer and I wish it would over write the oldest files.The cameras work very well and the motion sensors are reliable as well.", "Date": "March 13, 2014"}, {"Title": "uniden security cameras", "Author": "Arlene - Hendersonville, TN", "ReviewID": "R3P2LU0JOD3YHK", "Overall": "5.0", "Content": "So far there great because I just installed them because it was to cold. but I though I purchased a disk along with the units.  Ron", "Date": "February 15, 2014"}, {"Title": "Great!", "Author": "Bec - CPA", "ReviewID": "R97DZTJVHQHSU", "Overall": "5.0", "Content": "So very happy with this system. It is very easy to install and so happy with the pics.we had a very smooth transaction and plan to buy another system! Thank you!", "Date": "October 21, 2013"}, {"Title": "Does not over write the memory like others", "Author": "Barbara Lee", "ReviewID": "R30WQYCCUG78IZ", "Overall": "1.0", "Content": "We have the Uniden UDR 444 systems all over out properties and they work fine and rewrite after a month or so.  I needed another system and found the G455 with the higher resolution cameras.  The cameras are giving a better picture.Complaints areNo over write, so you need to manually erase the video ever day or week depending on how you set up the recording.Cameras have two led lights, one green and one red. This may deter criminals but attracts bugs the set off the motion detector and night.You can't get a hold of anyone in Customer service.Very disappointed that this system has such a lack of for thought it is design.", "Date": "July 15, 2013"}, {"Title": "Good product", "Author": "Oscar", "ReviewID": "R1B9GIE6UXLKGT", "Overall": "4.0", "Content": "I like this product, it is easy to install and good definition. I would like wireless connection for connect to internet.", "Date": "June 17, 2013"}, {"Title": "Renders any 2.4 Wireless Devices Useless - No Support", "Author": "Thanda Admi \"Thanda Admi\"", "ReviewID": "R316S6MIWT2EN5", "Overall": "1.0", "Content": "I was initially real impressed with this product until I tried to use my cordless phone and my wireless speakers. This product does something really bad to your 2.4 wireless devices. As long as the cameras are off, everything works fine. Turn them on and kiss your wireless devices goodbye.I couldn't get the product to connect to the internet to update the firmware and view the cameras from the web. It just sits there forever trying to connect. When I finally got an email from UNIDEN support (after 4 days of emails and phone  calls), they said I couldn't use a router and I had to plug the base unit directly to the cable modem to get it connected to the internet. That directly contradicts the documentation and web pages that discuss plugging it into a router.So if you want this to connect to the internet (forget your LAN) you have to dedicate your modem to it.", "Date": "May 3, 2013"}, {"Title": "Weak signal and crappy iphone app", "Author": "Keith McCabe", "ReviewID": "R1TP51HCKQLQE2", "Overall": "1.0", "Content": "I installed both cameras at each corner of my house.  Base unit is about 20 feet from one camera and 40 feet from the other.  The camera that is 40 feet away frequently loses signal.  There is not chance this camera works 500 feet from the base.  The user interface is decent and easy to set up.  The iPhone app works great as long as my iphone is connected to the same network that my system is installed.  Once I leave my driveway all I get on my iPhone is \"Disconnected\".  The concept is good but the software is garbage.  Save your money or buy a different product.", "Date": "April 2, 2013"}, {"Title": "Feel Secure", "Author": "Joyce C. Kocsis \"pinkribbon03\"", "ReviewID": "R1946WYVFBF0ZE", "Overall": "5.0", "Content": "Works great. Gives you a real sense of safety and security. User friendly  and easy to install. An excellent deal.", "Date": "August 5, 2013"}, {"Title": "Awesome System", "Author": "Jean", "ReviewID": "R1B5PG3I4Y6D41", "Overall": "5.0", "Content": "I pick up this system from my local Sam's club. Took my shirt, got it setup that was simple it was. remote viewing, PC viewing all worked well. But you must follow the instructions carefully. its not for dam people you mast read carefully. someone gave that system a one because He or she can not have the the remote or mobile devices setup. that's not true. I got windows 7 just Bing the system works like a charm.the picture quality is good same like my expansive wireless router where i put the second camera, I got the same amount bars on my devices. let say the picture is perfect period.It can be challenging for some people but that wireless thing is on the beginning stage be patient more easy system to may be at the corner. The reason why I paid for my $349.88 and I add replacement for 29.99 to guaranty upgrade when more sophisticated items become available.Update: I got a full bars on both cameras because at the beginning I didn't raise the antenna on the LCD. The night vision is working very well i can see small item at my doors steps very clear. remember you need to set the camera how to display the picture. Day light picture is excellent.", "Date": "October 21, 2012"}, {"Title": "Uniden Customer Support", "Author": "Ronald D. Handke \"Ron Handke\"", "ReviewID": "R1C9JPF99RJSQ4", "Overall": "3.0", "Content": "System does not work as described by Uniden.  Customer support is very slow to respond.  (5 more words required) duh", "Date": "February 16, 2013"}, {"Title": "great", "Author": "LUCIANA GREFE", "ReviewID": "R1YKENJ5QZ0EKH", "Overall": "4.0", "Content": "This is exact what i need, good product and delivered on time without delays. I recommend for everyone who needs good system of security without spend a lot", "Date": "August 24, 2013"}, {"Title": "Terrible Service from Uniden", "Author": "zooma", "ReviewID": "R3CMOVJPDSRSZM", "Overall": "1.0", "Content": "When I tried to set up my Uniden Surveillance System, one of the cameras was missing an insert that would allow it to screw onto the stand. I waited until a work day to phone them, as per the manual, which was the only time I could reach them. I called the number for service, and I was greeted by a person inviting me to enter for a $25,000 prize giving them the right to call me. So that number didn't help. Went online and found a different phone number. Dialed it and waited about forty-five minutes. Finally, I hung up. I haven't even been able to set up the system, so I am unable to judge whether or not it even works. The one star is for Uniden's non-existant service.", "Date": "July 15, 2013"}, {"Title": "Motion sensor too sensitive", "Author": "Mr. B \"Mr. B\"", "ReviewID": "R2W0ABYPOZ9QVK", "Overall": "2.0", "Content": "The main reason this system didn't work for me was the motion sensor. Even on low sensitivity a slight breeze that would move tree limbs would activate the recording to disk. Even a snow flurry with tiny flakes would set it off. Not very practical.The picture quality is not that great in the day or night. Motion in the video is not nature. It seems it is like slow motion at times.  I have ordered a trail camera and hope it will work better.", "Date": "November 22, 2012"}, {"Title": "Uniden Crap", "Author": "Scarecrow", "ReviewID": "R22G8D3UA9I9AC", "Overall": "1.0", "Content": "Do not buy.  Sound does not work.  Will not transmit more than 50 feet.  Useless.  I bought the original UnidenCamera system 3 years ago and it has been in use continuesly since with no problems.  I live close to the drive upsAt a local bank.  I can hear conversations at th drive ups 150 feet away.This new system is Chinese crap.  Don't but....you have been warned.", "Date": "April 19, 2013"}, {"Title": "Do not buy this item from Amazon", "Author": "Leroy Carlson \"Private\"", "ReviewID": "R2GI9XY3Y8QH0G", "Overall": "1.0", "Content": "I bought this item and everything worked fine . . . except for the internet connection.  So I contacted Uniden support and have been working with them to resolve the problem.  Finally they agreed, today Nov 16th, to have me return the defective receiver.  But here's the catch I bought it from Amazon.  So I have to sent it back to Amazon . . . BUT Amazon won't honor the return because I had to have returned the entire item before November 10, The Order was placed on September 30.  It took time to install the product, I did not keep the packaging, and it took time to get resolution from Uniden.  I will have to pay for shipping back to Uniden and hope they return the unit to me.  If you buy this unit buy directly from Uniden not Amazon.", "Date": "November 16, 2012"}, {"Title": "Uniden Surveillance System", "Author": "Bill", "ReviewID": "R2JS09O0CRTSBO", "Overall": "2.0", "Content": "I am disturbed that the price on your site has dropped since my recent purchase, and infuriated to find the exact same product at my local Sam's club for $299.00. I feel violated.", "Date": "November 19, 2012"}], "ProductInfo": {"Price": "$499.99", "Features": "Simultaneous multi-camera recording\n2 outdoor night vision cameras\nTransmit up to 500-Feet\nExpandable up to 4 cameras\nSimple plug 'n' play and remote view via Internet option (PC or Smart Phone)", "Name": "Uniden Guardian Advanced Wireless 7-Inch Screen Video Surveillance System with 2 Outdoor Cameras - Black (G755)", "ImgURL": "http://ecx.images-amazon.com/images/I/41iNBEsiY8L._SY300_.jpg", "ProductID": "B0091DR2NK"}}