{"Reviews": [{"Title": "MOTION DETECT RENDERS DEVICE INOPERABLE - FALSE ALARMS - SOUND DETECT RENDERS DEVICE INOPERABLE", "Author": "charleslriddle", "ReviewID": "R1SKTBX47NYD5I", "Overall": "1.0", "Content": "QUite simply, the sound detect and motion detect do not work as one would expect it to work.  The device constantly gives false alarms (on both motion detect only, and on sound detect only).  I spend hours and days looking for the right device that had infra red, motion detection, and email alert.  The product info said that this device had those functions, so after long deliberation, I bought the 2 pack.  I set them up, and then began the constant parade of false alarm emails to check.  Yes, I know there is a sensitivity slider that can be used, but it does not work to fix the problem.  You end up making the settings too insensitive, and you are essentially not getting any alarms when you should be.  HERE IS WHY SOUND DETECT DOES NOT WORK - The IR led's come on and off to compensate for ambient lighting.  When the IR led's change state, there must be by a mechanical switch, because you hear a click in the device.  The sound detect hears the click and sends an alarm email.  So, if you have windows, every time a cloud passes over and darkens, the ambient light, you get a click, a sound detect, and an alarm email in your inbox.  HUNDREDS OF FALSE ALARMS PER WEEK.  HERE IS WHY MOTION DETECT DOES NOT WORK - a change in light intensity triggers the motion alarm.  So, if you have windows, every time a cloud passes over and darkens, the motion detect is triggered and you get a false alarm email.  ABOUT A HUNDRED FALSE ALARMS PER DAY.", "Date": "November 10, 2013"}, {"Title": "Some model REQUIRE sending back for update", "Author": "FPChris", "ReviewID": "R2CWXT1L9UAUG4", "Overall": "4.0", "Content": "After FINALLY getting mine up and running I find out that there is an issue with the camera and bright light. This bug causes and crash reboot loop. You can find many complaints about this on the web. Foscam says this is a DSP issue and I have send both mine back for an update. They NEED to fix this. I am not buying more until it is fixed. It is an issue with their indoor and outdoor MJPEG cameras. Other than that these are GREAT cameras.", "Date": "December 17, 2013"}, {"Title": "I have 4 of these now!!  They are awesome.", "Author": "S. Porter \"AmazingVoiceMail.com\"", "ReviewID": "R1ZEOBAUV9UVP4", "Overall": "5.0", "Content": "I got tired of \"wired\" with  my Q-SEE DVR security video system that was always failing.  So, about a year ago - on a whim - I bought two of these.  They are mounted outside (under awnings/patio) - and the weather hasn't killed them yet.  You have to keep them dry - but I've ran them in temps in the NW from as low as -5 up to 100 degrees over the past year.  Since they've passed the test of time - I bought two more.  The other nice thing is they are easy to set up, have a great app to use with them, you can hear and talk through them, move the camera around remotely - and set them up to send you e-mail pictures of motion events that are better quality than my QSEE DVR sent.  The only downside to these:  They do not record video unless you've got the software on your computer at that location running.HOWEVER, Foscam does have more expensive units that DO have a micro SD card for recording video.  There are also new options that Foscam offers (cloud style upload) for a monthly fee.", "Date": "April 19, 2014"}, {"Title": "worth the money", "Author": "bbennett", "ReviewID": "RU5WE77W5IKG4", "Overall": "4.0", "Content": "Set up for remote access, outside my homes wifi, was a bit of a pain. But after an hour I got it working without tech support. I was able to watch my kids from Australia. Camera works as it should.", "Date": "June 2, 2014"}, {"Title": "Good camera,  ok interface", "Author": "R. Iyer \"CPA Don\"", "ReviewID": "RDK2YZ9K2QNVU", "Overall": "4.0", "Content": "If you are planning to enable remote monitoring,  make sure that the port you are assigning is a large number,  Say,50000+.  Lower port number does not work. The setup is a bit involved,  but not too difficult.  The interface could have been better.", "Date": "May 21, 2014"}, {"Title": "IP Camera for home security", "Author": "Berhanu K Wondimu", "ReviewID": "R2R07C75HAED8J", "Overall": "4.0", "Content": "I got good deal on two Foscam cameras and loved the performance. Easy to setup and easy to get support if you need help on installation and troubleshoot. Here's affordable camera bundles if you are interested ... :)", "Date": "May 13, 2014"}, {"Title": "Foscam Support is Great.", "Author": "David Chamberlain \"4329908\"", "ReviewID": "R114TUJ6WDFXDT", "Overall": "5.0", "Content": "Calvin (Foscam Tech Support)  was very professional reminding me how to reconfigure my cameras after switching my ISP. Thanks Calvin!", "Date": "April 29, 2014"}, {"Title": "One OK the other Not OK", "Author": "Jackie E. Rooks \"Jackie\"", "ReviewID": "R2LG74J3HWLW27", "Overall": "3.0", "Content": "The cameras arrived in good shape and on time. I already had one that worked fine. One of these worked fine but the other one cycles through all vewing areas every few minutes and the only way I can stop it is to unplug it! I contacted Foscam several days ago about it but no resolution yet. The box says to return it to the seller but there was no paper work with it listing their possible contact information.", "Date": "April 28, 2014"}, {"Title": "Foscam works as intended", "Author": "bostonmama", "ReviewID": "R1VKIZIF926DLK", "Overall": "4.0", "Content": "Good system and support is there when you need it to configure wireless routers, port forwarding etc. May order more for outside.", "Date": "March 18, 2014"}, {"Title": "Great for baby monitors", "Author": "Sunny", "ReviewID": "R1IO2BB6JO2LXY", "Overall": "4.0", "Content": "Although this is meant for a security camera we use them for baby monitors.  I was hesitant at first because I'm not tech savvy however, their technical assistance over the phone set everything up for me remotely.  It was very easy with their help.  I would buy this product again.", "Date": "March 16, 2014"}, {"Title": "No contract security for your home", "Author": "Micah Charles Cheng", "ReviewID": "R2V8ICZB43V1XD", "Overall": "5.0", "Content": "The images are unbelivable and Foscam technical support was great in assisting with the setup. I highly recommend this product if you don't want the more expensive HD Foscam", "Date": "March 13, 2014"}, {"Title": "Solid buy on a budget, but there are better options (read my edits)", "Author": "Brandon B. Jozsa", "ReviewID": "R3MFX3P0PA2WD6", "Overall": "3.0", "Content": "These cameras are great! Use them for indoor, as they have a good, wide angle and can record sound as well. Now, the video quality isn't the best...and there is better, but be careful and READ REVIEWS! The next model up, while the video is better, is not a great camera. There is a more narrow field of view (making it hard to use in smaller rooms around the house), it will use more bandwidth and the audio is very choppy and delayed. You've been warned! These camera's get the job done. Now, I will be buying better cameras for outdoor around the access points for my house (looking at 2-3 720p zoom, pan, tilt outdoor cameras), but these are great indoors to save wireless bandwidth, and honestly you can see as much detail as you need. I am using a Synology Diskstation for my surveillance software, and it has been great!Edit: Unfortunately, one of the cameras died shortly after my original review. Because I have something else to compare with; the Sharx Security indoor 2900 camera with 1080p, local DVR MicroSD recording and local NAS Synology storage/recording at the same time with MUCH better night vision, I'm going to have to edit my original rating. The Sharx cameras just really feature so much more, they have a better viewing angle, less of a footprint (more stealthy) and the video stream is extremely smooth even for the 1080p stream...but then again, they're also much more expensive. The Foscams, when working, are great cameras on a budget and have a decent field of view (angle). Plus, the pan/tilt features are great features to have in an indoor security/monitoring camera.", "Date": "March 8, 2014"}, {"Title": "great", "Author": "Itsdarock", "ReviewID": "R5CRAM6UYPFYR", "Overall": "4.0", "Content": "I can rest now that I have these. I have to very active children 3 and under.  I can watch them on my computer while I accomplish other things. I gave it four stars because I wish the software was better and the microphone isn't loud enough. It also echoes. Nothing that would keep me from bying it though. Easy to set up as well.", "Date": "February 8, 2014"}, {"Title": "Nice customer service", "Author": "Sean", "ReviewID": "R37CUCEO65MN3T", "Overall": "5.0", "Content": "Called in to get the help to set up the camera wirelessly. The wait time was short and the tech, Chris, helped me promptly.Picture was clear, and it comes with mounting gear.", "Date": "February 4, 2014"}, {"Title": "Excellant Camera.", "Author": "Bill Wood", "ReviewID": "R164VWOQMTF3A8", "Overall": "5.0", "Content": "I bought these cameras to watch my Dogs while we are away from home. The Clarity of the Cameras,  both in daylight and in total darlness is Excellant. I like the fact that you can Pan and Tilt the cameras from both our phones and our PC's.I used the additional Brackets that were or are available to mount the cameras to the wall, the ones supplies with thw camera is flimsy and limited  I would like these even better if they had a zoom but for the Price, I am WELL satisfied.When I tried to hook them up I had a heck of a time, my WIFI Router was an older version, so I had to update to a new one. With the new Router installation was a piece of Cake.My highly recommend these cameras for home us, Very satified.", "Date": "February 1, 2014"}, {"Title": "Rating Foscam F18910W - drj", "Author": "Dr. J", "ReviewID": "R3OR07SB3BL80F", "Overall": "4.0", "Content": "Foscams work well using a \"dyn\" hosting.  Setup was fairly straight forward.  Would recommend use of Foscam ip cameras for monitoring household or for monitoring safety of children.", "Date": "January 31, 2014"}, {"Title": "Perfect", "Author": "L. Campbell", "ReviewID": "R46BWFIVCB9QQ", "Overall": "5.0", "Content": "The high gain antenna is 'very' long.  It's pretty ugly but fine for locations that you won't look at often.  The mounting kit is pretty cheap but effective.  I had to return one of the cameras because the night-vision portion of the camera stopped working.  Foscam replaced with a brand new one.  No problems with the other 4 cameras after about 4-months now.  Foscam has good documentation to help you get them connected to the internet.", "Date": "January 19, 2014"}, {"Title": "Foscam IP Camera", "Author": "William M Campbell", "ReviewID": "RX2IOOGFONFQ0", "Overall": "4.0", "Content": "Great Product. Excellent Customer Support From Irish!Picture clarity is great, Setup is somewhat difficult, but support can walk you through it or take remote access over your machine and do it for you.Hold times are long, but I guess the product is in demand.", "Date": "January 7, 2014"}, {"Title": "Great Camera", "Author": "Barry Turner", "ReviewID": "R18C4ID6Q6NF6D", "Overall": "5.0", "Content": "Pros: Great picture. Great nightvision.Cons: Must have some compter knowhow.  It's best to follow the video provided on the CD step by step for an easy setup.", "Date": "December 17, 2013"}, {"Title": "Amazing Product", "Author": "Alaina Bean", "ReviewID": "R355EJUN1W38QN", "Overall": "5.0", "Content": "These cameras work great! A little difficult to set up everything but totally worth it once you figure it out. Also good if you have dogs because you can check in on them anytime. The email notifications of motion are also reassuring.", "Date": "November 27, 2013"}, {"Title": "very nice colors even though it's a CMOS cam.. Audio from client to cam is bad", "Author": "Geric", "ReviewID": "RUD8F779W5JNA", "Overall": "4.0", "Content": "Very nice product, good resolution and very nice colors for a CMOS camera.. the IRCUT filter gives amazing results. Audio from Camera to client is OK.. but from client to Camera, is bad, almost unusable even if the client is on the same network. Have not tried with an external mic or speakers, but I doubt it'll make a difference.", "Date": "November 22, 2013"}, {"Title": "dont buy this", "Author": "S. Brown \"hunter36\"", "ReviewID": "R3UVMTI4WG7EX0", "Overall": "1.0", "Content": "when i received the product i opened it up and the antennas were both broke i could not use them the extra pieces to mount the camera were even broke.  the one camera was were blurry couldn't even see there faces in daylight.  I purchased the single cameras and had good luck, but these are a waste of the extra money.", "Date": "October 14, 2013"}, {"Title": "INCREDIBLE!!!", "Author": "Brennan Barnett", "ReviewID": "R3R9H59EYNPRDB", "Overall": "5.0", "Content": "I bought one camera about a month ago and had some struggles getting it to work, but if you call the customer service they'll help you get it running within minutes! I bought the 2-pack and called customer support. Michelle helped me, it was the best customer support I've EVER dealt with. She logged into my computer and did EVERYTHING for me. I just watched as she did everything through my computer! It was amazing! I HIGHLY recommend this product AND company overall. I cant express enough how impressed I am by the whole thing. I rarely leave reviews unless I'm either very disappointed or extremely satisfied.", "Date": "October 5, 2013"}, {"Title": "Foscam support", "Author": "Matt", "ReviewID": "R30P85S52IU7T9", "Overall": "4.0", "Content": "Good support via the telephone...they'll remote in and set everything up for free!  Andrew was helpful.  Don't waste time trying to set this camera up yourself, too complicated.", "Date": "September 13, 2013"}, {"Title": "product works as intended", "Author": "cj", "ReviewID": "R2MF07WBGS0ID", "Overall": "4.0", "Content": "The camera works as expected. I don't use windows, but I believe their software works for windows only. The built-in software works with any web browser, but the software to see multiple cameras at once I believe is windows only. Other than that, it tends to work smooth. I have not extensively tried the android app either.", "Date": "August 17, 2013"}, {"Title": "great customer service", "Author": "Lisa W.", "ReviewID": "R17TFXIUHKPCA3", "Overall": "5.0", "Content": "I had trouble installing camera to my wifi.  I called tech support and was on hold for a few minutes but not too long. Harry Foster logged via remote access and hooked both cameras right up.  Very helpful!", "Date": "August 15, 2013"}, {"Title": "Decent and customizable but not for the average consumer", "Author": "EB", "ReviewID": "R2ZHQUDFWGD3VP", "Overall": "3.0", "Content": "It works well once it's setup. However, the setup can be tricky. If you want access outside your home, you'll need to setup DDNS via a third party service. There are several YouTube videos to help with setup but you still need to be somewhat technically inclined.", "Date": "June 17, 2013"}, {"Title": "Good product", "Author": "Diane", "ReviewID": "R1CB8GAPL6PXC9", "Overall": "5.0", "Content": "Not very easy to camouflage, but works great.I had to call customer service to set up my phone for remote access.Allen Smits was very helpful once I got used to his accent. He was very patient with me.I recommend this product.", "Date": "June 7, 2013"}, {"Title": "Excellent cameras", "Author": "K. McCall \"kdogg24\"", "ReviewID": "R35FRTL95TXYXT", "Overall": "5.0", "Content": "Love the cameras, easy to use and quick to setup. I haven't used the additional bracket or antennas yet because the cameras work just fine in my house without them.", "Date": "April 19, 2013"}, {"Title": "Setup is a Snap", "Author": "Billy C. Power \"kosmickuntryboy\"", "ReviewID": "R3J6ZOS392HRYU", "Overall": "5.0", "Content": "Once you do a setup and get one or two up and running you will be an expert like me. LOL They are well made and will last years. I would highly recommend.", "Date": "April 18, 2013"}, {"Title": "Foscam FI8910", "Author": "Marg", "ReviewID": "RSJSKA17LDBJV", "Overall": "5.0", "Content": "Foscam FI8910W Pan & Tilt IP/Network Camera with Two-Way Audio and Night Vision (Black)Wow, these cameras surprise me a lot. Nice, very nice cameras. Very easy to set up (20 minutes both cameras). Beautiful pictures. Night vision is excellent.  The best is the pan and tilt. I can see everything around the house. They came with two extra long antennas but the cameras connect so good and easy to internet that I didn't need them. I love the cameras, and I love the price!!. I surely recommend these cameras.", "Date": "March 28, 2013"}, {"Title": "Great camera and tech assist", "Author": "Joe", "ReviewID": "R2RMA66JQE5KE9", "Overall": "5.0", "Content": "We use it for our twins and it works great, foscam support helped me port forward ( sandra williams) Has great quality,and I would recommend  this for any baby monitor or security.", "Date": "March 4, 2013"}, {"Title": "Technical support was truly outstanding and i couldn't have done it without her.", "Author": "peter-1010", "ReviewID": "R5IYBQ8FRE1VE", "Overall": "5.0", "Content": "I am completely satisfied with the expertise of the technical support analyst and i will definitely buy again.  I would definitely buy another foscam especially because of the support I got.", "Date": "February 22, 2013"}, {"Title": "buena", "Author": "kendall rodriguez", "ReviewID": "R3LWTP055JH33Q", "Overall": "5.0", "Content": "lo esperado exactamente por lo que pague, muy buena decisión, lista y trabajando en perfectas condiciones, todo indica que es una buena compra y inversión de dinero", "Date": "February 20, 2013"}, {"Title": "OK", "Author": "Aaron A. Allen \"AAA\"", "ReviewID": "R1JRVZQQO0UKKL", "Overall": "3.0", "Content": "The video quality is poor or not what I expected them to be.  Setup is not straight forward.  You may want to go straight to youtube for how to videos.  The cameras have been shutting down around 2am and I can't get to them online.  People robbing houses generally break in around 2-3 am.  Maybe they'll work as a visible warning.", "Date": "January 13, 2013"}, {"Title": "Great cameras for home security (Indoor)", "Author": "AC", "ReviewID": "R2R4WMA5KZ213Y", "Overall": "4.0", "Content": "Decent cameras, get what you pay for. The camera disconnects sometimes but rarely. The motion alarm detector is some what decent. I find that it cant really catch fast moving  objects or the person has to be at a certain range of the camera for it to activate. Example. I have one camera facing on the side of my house that can see the neighbors driveway. The camera will start recording but after the car has passed and the car would be going 5 mph or less. These cameras are decent for its price. If someone was to break in the house, the burglars would probally see the camera and bail or they will stay long enough for the camera to record. So far I just find the motion detector a bit delayed about 1-2 secs. Also if you do not purchase another software such as IRIS to control the cameras, the IR would turn on at night from time to time even if you set it off, this don't bug me, it works just not what I expected.", "Date": "January 3, 2013"}, {"Title": "Perfect DIY security cameras", "Author": "Brian Worthington", "ReviewID": "R2VJDFQD8W1FDO", "Overall": "5.0", "Content": "You get a lot of bang for the buck with these cams. These do everything I expected. You need to be a little technical savvy to configure these to their maximum potential. If you have to hire a tech to get these setup right it will be money well spent.I plan to buy two more.", "Date": "December 13, 2012"}, {"Title": "Great value and excellent camera", "Author": "Wolfgang Stiller", "ReviewID": "R33R4W7GOEHX38", "Overall": "5.0", "Content": "I now own three of the Foscam FI8910W Pan & Tilt IP/Network Cameras. I ordered the first two as this package with the 9dbi antenna. I found the longer antenna really helped when I put one camera really far from my router (with about four walls and two floors in between)  I did a considerable amount of research prior to purchasing this and found it provided capabilities better than cameras costing hundreds more.My criteria was I needed something 100% reliable that I could access from anywhere in the world with a web browser. (I have had no issues with the cameras dropping off line due to network issues. They have excellent reliability so I can be gone for an extended period of time and still monitor my home.)I needed a camera that did not use much internet bandwidth (this camera achieves that by only using bandwidth when you actually are asking it to send video plus you can record video locally without using outside bandwidth.)Good night vision.I needed something that could sense motion and/or sound and send me photos of the activity.I didn't want to upgrade my home network. I have a 12 year old wireless router. All three cameras work quite well and even work with my old G wireless router even when all three are sending video at once and someone else is using our network as well.  I have a lot of wireless devices so I was really pleased that these cameras still worked flawlessly and I noticed no problems with the other devices or the cameras.The last nice thing is the setup was easy. I set it up using the CD (no issue there) and with DDNS but found I didn't really need to use that at all. The fact the camera will send me an email if my IP should change covers that. So far my Comcast based IP has never changed (in two years).", "Date": "August 9, 2013"}, {"Title": "GREAT SERVICE from Thomas", "Author": "Emily", "ReviewID": "R2O5J0JKOUAXI8", "Overall": "5.0", "Content": "He was able to help me and was able to take me step by step to give outstanding service. He was very professional and now I am able to use the Foscam to the best of its abilities! Thomas is the BEST!!!!!!I would also suggest others get this camera and you will be happy", "Date": "February 28, 2014"}, {"Title": "Foscam Tec Support", "Author": "Priceless29", "ReviewID": "RWXJ6DP6AAHNU", "Overall": "5.0", "Content": "Great support from tec at Foscam, Calvin was very helpful and sure knew what he was doing, Thank You very much!", "Date": "January 14, 2014"}, {"Title": "Tech Support", "Author": "Jaime Garcia", "ReviewID": "REC3WEVD8WA9I", "Overall": "4.0", "Content": "Tech support was very helpful. They remotely helped which made it very simple.The camera work well, however if you have the abilitity to get the HD I think that makes it a perfect package. I do think the cameras work very well. I love the way you can pan/tilt the camera and view it from anywhere on the internet ( if you have the password credentials ).", "Date": "May 17, 2013"}, {"Title": "Very Good Cameras", "Author": "Doug Boreland", "ReviewID": "R2XAVZVY1MQBJX", "Overall": "4.0", "Content": "Overall, I am quite happy with these.  A lot of features, good price, decent to good quality.  Night IR has purple tinting to it, but it does the job, has about 30' IR range.  I run mine wireless and occasionally they lose connection and reboot.  That is why the 4 stars rather than 5.  This is my second set of two.  This set will be hardwired - will follow back with any reboot issues in that configuration.", "Date": "February 8, 2013"}, {"Title": "Home Security for a fraction of the cost", "Author": "Boone Helm \"Reality is just an illusion albei...", "ReviewID": "RUVENTO4VKMQ6", "Overall": "4.0", "Content": "I bought these cameras because I live in an apartment and cannot have a monitored home security system installed. I love getting notified via e-mail and text message when someone enters my home. If the dog walker, maintenance man or exterminator walk through my front door, I am immediately notified with a picture of who entered. Following e-mails show me what they are doing and continue until they leave. That is the least of the features of these cameras. If I am at my desk, I can log in and watch the cameras, listen to what's going on at home and, if someone is there, I can speak to them through the built in speaker on the camera.Great home security for a fraction of what I would have paid for a monitored security.", "Date": "February 18, 2013"}], "ProductInfo": {"Price": "$154.99", "Features": "Building on the success of the Foscam FI8918W, the FI8910W is the latest camera from Foscam Digital Technologies LLC.It features high quality video & audio, pan/tilt, remote internet viewing, motion detection, night-vision, embedded IR-Cut filter, built in network video recording system as well as free telephone technical support available from Foscam Digital Technologies LLC.\nThe distinguishing features of the FI8910W are the embedded IR-Cut off filter, upgraded external housing, wider horizontal panning range and 2 year Warranty. 9dbi antennas give 3x wireless signal strength\nThe IR-cut filter provides true & accurately images fixing the problems related to washed out and discolored images. In addition, the cut off filter also allows the camera to properly automatically adjust to changing lighting conditions so the user does not manually have to do this.\nAlso includes, two-way audio monitoring, remote pan/tilt control (pan:300° & tilt:120°), freely control IR-LED on/off for night vision (up to 8 meters)\nRemote viewing via local network or internet, record from anywhere anytime, motion detection alert via email or upload image to FTP, Blue Iris compatible; Supports all standard browsers, Iphone, Ipad, Ipod, Android & BlackBerry, Wi-Fi compliant (IEEE 802.11b/g), supports WEP & WPA WPA2 Encryption", "Name": "Foscam FI8910W 2-Pack Bundle (Black) with 9dbi Antennas and 7-Piece Adjustable Bracket", "ImgURL": "http://ecx.images-amazon.com/images/I/51%2BFhlgPeNL._SY300_.jpg", "ProductID": "B009OMSUCK"}}