{"Reviews": [{"Title": "Really coudn't ask for more", "Author": "Danobegood \"Danobegood\"", "ReviewID": "R2IG0BIPJG7S14", "Overall": "5.0", "Content": "This is an exceptional deal.  The cameras are of decent quality, the DVR is ready for you to install your SATA drive (up to 2TB) and the remote does everything necessary.  Adding a $79 1TB drive provided plenty of hours of video recording space.  Can access video monitoring via web browser, Android, iPhone, external VGA monitor or composite video input on a standard television set.  One question I had was whether the camera mount could be attached at the top, allowing for an under the eve installation, to which it can.  Simply remove the rain hood screw at the top of the camera and attach the mounting bracket screw to the camera through the hole in the rain hood.  Best part of this deal is that there are four remaining camera inputs for future cameras.", "Date": "January 2, 2013"}, {"Title": "beware!!", "Author": "max", "ReviewID": "R2E5Y4PXZ18AW1", "Overall": "1.0", "Content": "this system is not good and not buy  this system is not good and not buy this system is not good and not buy", "Date": "February 28, 2013"}], "ProductInfo": {"Price": "$159.99", "Features": "View Video Online with No Service Fees - View your DVR's live or recorded video footage on any PC.\nLong time recording: - Base on the H.264 Compression, maximize the hard drive's recording time, as well as transfer video for viewing over the internet.\nNetwork Remote Access - Access live video footage directly from your mobile phone or PC anytime anywhere\nAdvanced Motion Detection Recording - This allows you record only when motion is detected.\nInstant Email Alerts if Activity Detected - This system is designed to send an email alert, complete with photo of the activity, if any motion is detected, or if any camera experiences video loss.", "Name": "Zmodo Complete 8 Channel 4 Outdoor Security CCTV Surveillance Cameras System with No Hard Drive", "ImgURL": "http://ecx.images-amazon.com/images/I/51k70VxAvgL._SY300_.jpg", "ProductID": "B009QX7KFA"}}