{"Reviews": [{"Title": "BEWARE FAKE REVIEWS - This Product is Garbage.", "Author": "Arjuna", "ReviewID": "RHBDGEV73OG57", "Overall": "1.0", "Content": "First let me say I have a fair amount of experience using many different IP Cameras, but I am not a snobbish user.  I tend to use simple, reliable IP cameras and then manage them through a good software product such as Blue Iris.  I have a mishmash of IP cameras setup for  my home surveillance system of varying quality.  Today I saw these cameras on sale in a two-pack at a common shopper's club. When I saw the two-way audio feature listed on the box I had to try it out as this is something I was wanting.I got home and quickly hooked one of them to my network and followed the installation process.  I was immediately concerned when I was forced to go through the Samsung website to setup my camera.  Every other IP camera I have seen allows you to setup the camera on your home network, but this camera absolutely requires an Internet connection and that you FIRST register your camera with Samsung AND give them total access to your camera.This means that:1. Samsung Has total access to your video streams AT ALL TIMES.2. You cannot access your camera UNLESS you go through the Samsung website.... FOREVER.3. Third party Camera management software cannot access this camera in any way, shape, or form. Every other IP camera on the planet allows direct access by a web browser or camera application software.4. When setting up your camera you are divulging very sensitive data to Samsung, such as your WiFi router's password. There is no way around this.Here are some other failures of this camera.1. The packaging claims this camera has 2-way audio. in the IP camera world this means you can listen to audio from the camera as well as communicate back to the cameras speaker from your monitoring application.  This is not the case with this camera. Using the Samsung website or phone app you can hear the audio from the camera, but the 2-way feature is an intercom that only works if you use the Android Smartphone app.  Again, since all traffic in these cameras MUST go through the Samsung website the 4-5 second delay I experienced just for the one-way audio was maddening. The two-way delay must be excruciatingly slow.I was unable to configure my camera for a static IP address.  I tried to do it using both the Firefox plugin and the Internet Explorer plugin, both of them failed when I tried to apply the settings.  I am a networking expert, so I know the settings were spot on.The YouTube configuration as described in the manual was non-existent on the Samsung website. I believe this is because YouTube may have recently turned off the ability to auto-upload videos to them.  This pretty much removes the only video save feature this camera had.  There is no way to capture and/or save video from the camera to your PC.On the video quality, this unit has a fair to poor quality picture. The night vision image is OK at best. With only 6 Infrared LED's, as opposed to some of my cameras which have 48 LED's, the illumination at night is very limited. The stated range of 15 feet is a stretch.  My Sharx SCNC2700xx cameras produce a sharper, brighter image at 60 feet than this one does at 15 feet. The nighttime contrast is poor too. Unlike my other cameras at night, which have sharp, high contrast night time images, this camera's image appears somewhat washed out and gray rather than black and white.I am terribly disappointed. To me this camera has no redeeming quality. For some people it may prove to be useful for one reason. It is fairly simple to setup and use as long as you are willing to put up with the very restrictive access to the camera. If you don't mind Samsung having access to your private life, and if you don't mind not being able to use any of the many great camera monitoring applications out there, then it is not the worse camera you can buy. Like I said, I use a couple applications that are capable of viewing almost any IP camera on the planet. I have 5 different manufacturer's cameras on my home surveillance system and I use many different applications to view all of them in one consolidated view, but this camera is unavailable to any of them.  If you buy this camera and one day the Samsung website to view them goes away then you will be left with totally useless cameras.I did not do much testing using WiFi with this camera, so I have no idea how reliable it is or what the useful range is.  I will say from experience that using Wifi to control more than one or two cameras in your home network in not advisable. (see note below)BEWARE FAKE REVIEWSI went through every single 5-star review listed under this product. With only one exception, they were all written by users who have never reviewed any other products on Amazon.  This is a strong indication that these reviews are completely bogus.  This is becoming a huge problem on Amazon.com.  I am sure if you removed these bogus reviews this product would rate in the range of two stars.Note:This is not part of the review, but I thought I would add this information based on my experiences setting up and trying many different types of home surveillance systems.  A standard resolution IP camera running at 15 or 30 frames per second uses a lot of bandwidth--something WiFi does not have much of. Even when I was running only 4 cameras at 640x480 15 FPS on a 100 mbps switch I was rarely able to achieve full FPS on all cameras even though the cameras were all rated at 10/100mbps capable.  It was not until I put all cameras into a gigabit (1000mbps) switch that I was able to get all frames to process through to my computer.  There are very good technical reasons why this is so, but for those who don't understand how switvhes work just take my word for it, you need a gigabit Ethernet switch and a gigabit Ethernet card in your PC (which most have today) to build a reliable home surveillance network with IP cameras. Alternately, you can buy a Network Video Recorder with built in ports for each camera.  For me, the best setup is a piece of software called Blue Iris ($50) and the Gigabit Ethernet switch along with a mishmash of IP cameras.  THis is by far the most reliable and robust I have seen and the cost can be quite reasonable as all you need are the cameras, the $50 software and a PC.  Blue Iris also has an iPhone and Android app that integrates all the cameras into one system.  It works like a champ.  I am running 7 cameras, 4 of them 640x480 at 15fps, one USB at 10fps, and two 1080p at 15fps, all of them wired into a Gigabit Ethernet switch. The streams are fed into my PC running Blue Iris version 3.  Blue Iris is recording all the cameras 24 hours a day onto one USB 3 hard drive.  The 3TB drive can hold weeks of video.  Blue Iris is also creating alerts every time someone walks in front of a camera so I can have alert thumbnails which take me right to the relevant video portion I want to see.  I continue to be stunned at the capabilities of the Blue Iris system. It is the best $50 I ever spent on software. While it may sound like I work for Blue Iris, I can assure you I do not. I just like it that much. For less than half the cost of a similar turnkey system from one of the big companies like Q-See and Lorex, etc. I can build a system that is better in almost every way, and you can too.  Just stay away from this camera.", "Date": "August 24, 2013"}, {"Title": "Do not waste your money.", "Author": "James_kindle \"kindle748\"", "ReviewID": "R2V9CGMZCCNRSW", "Overall": "1.0", "Content": "Do not waste your money.I'm sorry to say that I am surprisingly disappointed. Samsung somehow really failed with these cameras.I have seen a number of negative comments with regards to setting this camera up, but I had no such problems. The cameras were very easy to set up and they show an image of whatever they are pointing at reasonably well.They claim to automatically update to Youtube. Nope. Doesn't work, and all I got from a Samsung rep is that they know there is a problem and 'they are working on it'. So without the ability to record video, the only utility for the camera is to use it to observe.Oh, the motion detection? Sure, you can turn on the motion detection and it sends a neat little alarm to your phone. The problem is that the motion sensitivity is either so sensitive that it goes off all the time for nothing, or it doesn't go on unless something big is right in front of the camera.And the really dirty little secret ...... \"Relay mode\". Unless you are at home and connected to Wifi, you will go into 'relay mode'.That means if you are at work and would like to check on the camera, it takes forever to connect (when it will) and the video image is terribly slow.No, don't be taken in by the apparently good price, These things are worthless.", "Date": "November 7, 2013"}, {"Title": "easy to set up, but what Samsung does not tell you", "Author": "Tman", "ReviewID": "R1Q0MNHV40DXS4", "Overall": "2.0", "Content": "First of all, I agree this camera is very easy to setup, literally in about a minute or two, you can have the camera up and running.  I bought it because it was a Samsung and I have had great success with their products.  I also bought it because, it optionally uses a wired setup to the router and since I intended on placing the camera in the room with the router, I might as well have a wired access for faster more reliable use.If you intend on using this as a baby room monitor or other room in the house that you occupy within the wireless router then, it is a great camera.However, if you want to use this camera as remote monitoring, using Samsung's website then I say beware.  If you want to view the camera with the website, then you are stuck in \"relay mode\".This means that you are limited to 3 minutes of use and very slow, grainy response since your video is passing thru Samsung's servers.  I called the toll free number that was included in the package.  The explanation given was that I am using 2 devices prior to the camera.  Namely a cable modem and a router!!  Samsung support indicates that they do not support live remote monitoring unless you are connected directly to the modem, not the router!!  What's the point of having a wireless camera then?Samsung clearly missed the mark on this productupdate May 23, 2013Apparently last night Samsung did an update on their website for monitoring this camera.  In the process, the deleted all the registration information and I have to re-register with the serial number from my camera.  Well, I'm not sitting next to my camera, that's the whole point.  Customer service cannot give you your serial number over the phone and they don't know why camera registration's got deletedStay away from this camera-", "Date": "May 6, 2013"}, {"Title": "Only negative point is resolution...", "Author": "hookworm", "ReviewID": "RYIQ3U5M85ICQ", "Overall": "2.0", "Content": "Update: a few months after I purchased these, one of the camera's infrared stopped working making that camera almost useless.I just bought two of these and set them up in my lake house which is 2 hours away. There is a bundle pack of 2 for $200 at some stores, such as BJ's wholesale. It's a steal at that price, if you ask me. I ran them all weekend and tested the motion detection, alerts and other optional features. I tried the samsung app (on my iphone) and used Samsung's PC app too, very EASY to use. I also tried the private youtube (it uploads 30 second clips, not 50 as some advertise), picasa (still photos) and twitter options...individually and together. All of the features worked well and the cameras work well over wifi or cat5. In fact, the wifi stayed up 100%, which is a constant source of pain with other wifi cameras. It should be noted I updated the latest firmware too (which was a 1 click action item, real easy). The resolution is not the best, these cameras are very much like webcams but they are not awful. The night vision works OK. If you aim the camera through a window to view outside, at night, it will not work if there is no light or street lights. The audio is not great but I don't intend on using these for two-way communication. All in all, they are rock solid and work well. One other thing to note, when it switches from normal view to night vision (and vice versa) you will receive a motion detection alert, don't let that scare you ;). In fact, I consider it a twice a day reminder that everything is still working!", "Date": "June 10, 2013"}, {"Title": "Terrible product - the plug-in, app, and site are all awful.", "Author": "Tom", "ReviewID": "R1QQHSQYEKDD5T", "Overall": "1.0", "Content": "I thought this product sounded great, and I managed to get it on sale, so I was disappointed to have to return it - but it is a really awful.(I was particularly interested in the Youtube feature and would be interested if anyone can recommend another product with that feature.)To start using this product you create an account on their site and install a browser plug-in.  I'm using a very ordinary Windows 7 computer and I tried multiple browsers, but that plug-in always crashes before you can do anything.  I guess that's one of the problems with depending on a proprietary plug-in.But that's OK as I will probably mostly use the Android app.  There is no app which lists this product (1011N) as supported, but it appears that they intend you to use this app which is for a similar Samsung product (1010N):[...]Unfortunately, there are serious problems with this app.  For starters, the reviews suggest that the product and the app are really bad.  As well, the app requires permission to read and modify my contacts.  That is the most important permission on Android and there is no reason for this app to require it.Next I decided to check out some of their other features that can be configured via the web site.  To do any camera configuration you must start with the viewer, which is silly because it means that you can't use the product at all if you decide not to install their plug-in.  In my case I had to go through the restart browser and crash the plug-in sequence just to get to the other options.It turns out that  the other options are as poorly implemented as the plug-in and the Android app.Setting up e-mail notifications should be super simple, but they have managed to ruin that too.  Instead of simply using their own e-mail server, they expect you to provide your own so you must enter the technical info for an SMTP server including your account password.And they mangled the Youtube and Picassa features with inept implementations as well.  Instead of using the normal and secure method of uploading videos to your account without your password, they force you to provide your password.These days, only scam sites still force you to provide your password when their is no need to.  Of course, I'm not saying that the creators of this product are scammers, I'm saying that they should stop acting like they are.Ultimately, this is not a big deal - you can just create another, 'throw-away' Google account to use with this product - but it is remarkable that with the plug-in, the Android app, and the online services they can not meet the most basic level of competence, usability, or security.", "Date": "January 3, 2013"}, {"Title": "Does not work with iOS7", "Author": "JDawg", "ReviewID": "RJEELW67GDOUC", "Overall": "1.0", "Content": "Complete waste of time. Setup is a series of repeating the same step and hoping it will work this time. Seriously, I repeated the same steps changing nothing in between and it finally worked without explanation. Finally, I attempted to use the iPhone app and I got to the step where it asks for the 'Camera Password' with no discernible way to enter it. It just asks with an 'OK' button and doesn't allow you to enter anything. This might be because they haven't updated the app for iOS7? I don't know. But I am taking this crap back. I also don't like how it forces you to utilize Samsung servers. The fact that they can watch your cam at any time just creeps me out.", "Date": "September 27, 2013"}, {"Title": "Great IP Camera for home security and other use!", "Author": "ben chae", "ReviewID": "R1OZVC1CY3KWMG", "Overall": "5.0", "Content": "Let me tell you this. Previously, my home was burglarized, and burglars destroyed my security DVR by smashing it with sledge hammer. How outrageous.. Since then, I was looking for security devices that secure from those violent acts. That is the reason why I choose an IP camera. I researched through Internet and saw all the comments about how horrible IP camera is. So, I didn’t have a high hope on IP cameras but decided to give a try. I ordered each IP camera that available on Amazon, and end up with this SNH-1011. Here is my review for Samsung SNH-1011.Great picture quality and transmitting speed:I saw couple of complaints about choppy and lagging video, but I guess Samsung step up with this problem. There are three type of option for bandwidth speeds; High, Medium, Low. I tested all these setting with my Verizon Fios and guess what? With highest setting, there is no delay at all! Medium 0.3 sec delay and low 0.8 sec delay. Not a big deal.(I just confirmed with Samsung’s representative that Samsung will expand their data server within US)Set up is easy and simple:The manual that Samsung provides is quite straight forward. You just have to follow their instruction. The downside is there are so many features that need more time set up such as YouTube, Picasa, E-mail notification, and etc. It took me around 35 minute to set whole thing up including other features. Once I set it up, it was working flawlessly.Web Browsers:I tested it with several web browsers such as Internet Explorer, Firefox, Chrome, and Safari.  As a result, each browser has different installation time and transmitting speed. My preference is Chrome > Internet explorer > Firefox > Safari. Also, Safari does not support bandwidth option somehow. I tried to adjust it, but browser wouldn’t let me. It was no big deal to me since I probably use SNH-1011 with either Chrome or Internet explorer.Android and iPhone App:SNH-1011 has free app called “SmartCam Mobile”. Available on both Android and iPhone App store, but if you such through iPad, it will not show up. You need to switch your setting to see iPhone App compatibility apps. I do not know why Samsung does not list this app to iPad store, but they need to create an app for iPad since iPhone SmartCam Mobile app is does not work efficiently with iPad (stretched image just bothers me).Slick looking with heavy base: I love the exterior design of SNH-1011. Looks slick and has bright white color. LED Status light is also big plus (Red, Blue, and Purple). On the bottom of unit, there is a heavy weight component to prevent SNH-1011 to fall down. The weight is just about the right and can be removed.I believe that Samsung is trying hard to make this SNH-1011 right. Only downside is it does not support cloud storage. To me, 30 sec record through YouTube is not enough. Also, I agreed that there should be way to protect our user ID and password. I’m not quite comfortable with this. If you are not going to use features like Picasa and Youtube, it does not really matter. But asking e-mail address and password seems lack of security feature. I contacted Samsung to ask about this, and they mentioned that they will fix this problem, and also, they will provide cloud service around March. Overall, I’m quite satisfied with my purchase and hoping Samsung will follow up these known issues and make it better.", "Date": "January 30, 2013"}, {"Title": "Please do not buy!!!", "Author": "Kevin C.", "ReviewID": "R8CMW9LNRXV3N", "Overall": "1.0", "Content": "Brought this camera from costco. 2 camera pack for ~194.00. The camera looks really nice. The software that comes with the camera sucks!!! It rarely works and rarely the developer provide any update to fix the bugs or problem with the camera. Looks like I'll returning this very soon!!!", "Date": "September 21, 2013"}, {"Title": "Perfect to keep an eye on my family", "Author": "Dinh Van", "ReviewID": "R3THN6DKEIRWVZ", "Overall": "4.0", "Content": "First of all, I travel a lot for work, so I wanted to have a camera for home to see what's going on at home.Samsung camera is perfect!!  It looks nice and fits well with the aesthetic of my home.the product itself was easy to setup.  All I had to do was press a buttin on the camera and the router and go through the camera registration from my iPhone.It took me literally less than 5 mins.  The video quality was nice.  It was large video, unlike some of the other cameras that was small.  On the phone, it had a high quality mode like how Youtube has it to stream better video.  Overall it was a good camera for the price I paid.  I do like to 30 second recording option to YouTube.  the video is recorded at full frame rate and looks very smooth.  No I just need to catch some funny video my kids are doing.Con:It does take a long time for the camera to start.  I almost thought the camera was dead.It asked me to update the firmware, the the firmware download was really long too.", "Date": "February 6, 2013"}, {"Title": "Stay away from Samsung SNH-1011N", "Author": "SR", "ReviewID": "R1RMET41E51PHN", "Overall": "1.0", "Content": "I bought this at BJs for $149 after a $50 discount. Totally worthless... This is a twinpack and \"BOTH\" of them will not go past the red LED boot-up. I have other IP cameras working without any issues. Quick search on samsungsv.com states that it is a hardware issue and the unit needs to be replaced.Will be returning this at BJs for a refund.Folks - stay away from Samsung SNH-1011N.", "Date": "November 23, 2013"}, {"Title": "Do not buy this product.", "Author": "Judy Boylan", "ReviewID": "R24XHIBVMHEOKR", "Overall": "1.0", "Content": "Do not buy this product.  It says the set up is quick and easy.  It was not.  After 2  1/2 hours, 45 minutes of which were on the phone with tech support, I was told by \"Brandon\" that my wireless router was not working, even though I was using it while talking to him.  The pair of cameras will be returned.  Waste of time and money...frustrating.", "Date": "November 21, 2013"}, {"Title": "Will wait for something better", "Author": "kathryn m gay", "ReviewID": "R177ZCJ92JUNUS", "Overall": "1.0", "Content": "Bought these from Costco. We had been wanting something like this for awhile to use as a \"doggy cam\" while we are away. From the advertising on the box they seemed like the perfect thing. We spent hours trying to get them set up. After reading 5 star reviews that raved about how quick and easy it was to use them we were pretty frustrated. We walked away and went back to it on 4 different days thinking we were just overthinking the whole process and making it too hard. We actually got a camera to work for a brief 5 minutes but not through our wireless. Since then we have been unable to log back into Samsung's smartphone app or website. Neither give any indication if we are typing a user name or password incorrectly (we are not). I just spent 35 minutes on hold for technical help with Samsung and after asking the rep that finally answered if there was some sort of problem with their server when I explained our problem logging in he hung up on me. Taking these back to the store. I can get my money back but not the hours wasted trying to get these to work.", "Date": "September 24, 2013"}, {"Title": "Good camera with a major fault.", "Author": "amazon man", "ReviewID": "R1E604LLWN6YJL", "Overall": "2.0", "Content": "I've had this camera for three weeks now and find it has a major fault. If you're just stream video it works fine. If you want it to email you an alarm event it's awful. Here's why. The motion detector gives off false alarms constantly. I now have it on its lowest sensitivity because anything thing above that will trip false alarms with no movement or even light in a room. I have noi animals or any flying insects.The audio alert is overly sensitive too and i now have that on the lowest settings. This is my second camera so its not the hardware. I have an alarm in my apartment and might have to just use the audio alert and turn off the motion detector. The app notifications work well and the uploading to youtube is great but I have dozens of false alarm videos uploaded to it. I have a Mace Home Security Alarm and will use it in conjunction with the Smartcam to view my apartment if the Mace trips for some reason, though it seems rock solid and doesn't false alarm. If the motion and audio detector worked great this would be an awesome camera. Now it's just ok if streaming video is all you need. BTW Samsung customer support was useless but they can help you set it up. As for it not working properly like every other company with a bad product they act as if this is the first time they've ever heard a problem. Maybe a firmware fix will turn this into a usable alarm but for now it will just drive you crazy.", "Date": "March 14, 2013"}, {"Title": "useless waste of time", "Author": "Charles T. Loveridge \"Daunting Terrible\"", "ReviewID": "R2QH5I8J9AR0QH", "Overall": "1.0", "Content": "Bought this at a box store yesterday.  Tried to set it up through the samsung web site and pop up told me I had to download a plug-in, which I did.  Tried to sign in after downloading the plug-in and the pop up returned telling me to download the plug-in.  I found no way to continue the set up because I was always blocked by this pop up.  Looked for help on the support page, nothing.  Found a phone number on the instruction sheet, called the number, and was on hold for over a half an hour as they counted down how many callers were ahead of me.  When it got to 4 callers ahead of me I was disconnected.  This is going right back to the store.  Useless waste of time", "Date": "January 16, 2014"}, {"Title": "SmartCam software not working", "Author": "Ray Computer Geek", "ReviewID": "RVF27TZYWS9IK", "Overall": "1.0", "Content": "Just opened the SmartCam package I bought from Costco last week. With 2 cameras for a total of about $180, I figured this would be a great way to keep an eye on our home while away. The packaging is nice but the supposed website at [...]  does not open. I did get it to open once and downloaded the plug-in for my Mac, but it wouldn't load. The system said it was damaged and trashed it. Tried this 4 times and got the same results. The iPhone app could not connect to a server. Returning this ASAP. Surprising from Samsung. Also has crappy reviews. Save your time and money and do not buy this.", "Date": "December 7, 2013"}, {"Title": "YouTube for Security - Are you kidding me?", "Author": "IDPA", "ReviewID": "RQ79WV46GK35N", "Overall": "2.0", "Content": "Samsung/Amazon need to do a better job of informing the buyer that these cameras ONLY work via an external website link to YouTube.  They do not work stand-alone on your internal, behind the firewall, home network.Cameras are nice and small and appear to be of good quality.  Don't know if they work because unfortunately, you cannot even turn the camera on without first agreeing to provide Samsung freedom to record and use your pesonal information.  It is so bad they won't even let you watch the installation video without giving them your personal information.  Secondly, you cannot hook these cameras up to your internal WIFI network; no, you can only access the video security feed via YouTube and Twitter!  Are you freeking kidding me, you want me to broadcast video of the personal comings/goings of my household to YouTube and Twitter!  You also expect me to provide Samsung, a foreign company, with a permanent tunnel through my firewall; now that is security!Sure, the Samsung server records my streamed video to a supposedly \"secure\" portion of YouTube.  If you believe anything in the public domain is SECURE you're nuts.I've tried two other WIFI cameras and neither of them would stay connected on the network.  So, I'm off trying yet another brand to see if someone can acutally make a home-security camera that works over secure WIFI.", "Date": "March 27, 2013"}, {"Title": "Many bugs and problems with Samsung software and website", "Author": "Anthony Kempka", "ReviewID": "R3VTO0E0ZEPJ8D", "Overall": "1.0", "Content": "After having the Samsung SmartCam for over 6 months I can summarize the problems. First and foremost is that the Samsung web portal for this product is very buggy and almost never works. Getting the motion detection to work and send email alerts is touchy at best and works poorly (always triggering or never triggering). The smartphone app is kludgy and amateur. It is extremely difficult to use the smartphone app. The device itself runs very hot and eats a huge amount of power. Finally, the video quality is OK and it has good night vision, but not enough to outweigh the crappy Samsung website and poor smartphone app.", "Date": "January 4, 2014"}, {"Title": "SmartCam Scam-will not record event", "Author": "sargon alkhas", "ReviewID": "R3O16ZKJNXMO0C", "Overall": "1.0", "Content": "Purchased from Costco. Easy and fast setup with home WiFi. Advertised to notify if an event and download to Youtube. Called customer service and was told Youtube download capability is down. Do not purchase as a security camera! False advertizement with no answer from manufacturer when camera will be able to record an event.", "Date": "January 3, 2014"}, {"Title": "Dont waste your time or $$", "Author": "John Deerman \"Accesseqc\"", "ReviewID": "R19NURPMPCNH5Z", "Overall": "1.0", "Content": "I tried BOTH cams on 3 different  pcs. The Registration is NOT easy, and when you get it registered the Samsung site errors. I am re-boxing mine and sending it back,save yourself the headache DONT buy this item!!!!", "Date": "December 15, 2013"}, {"Title": "Limited view", "Author": "John A. Stayn", "ReviewID": "R2O5V7ZBOSTTGL", "Overall": "2.0", "Content": "This product has a very limited range of view.  The software is fussy so it is hard to set up.", "Date": "April 3, 2013"}, {"Title": "Great monitoring device.", "Author": "Sophia", "ReviewID": "R1YRS51KW4FXX8", "Overall": "5.0", "Content": "I have this camera setup by our front window looking out to the front porch.  I work at home so I stay in my studyroom most of the time, and this camera lets me monitor outside to see who’s out there, if the delivery guys is here, etc.  Very convenient and picture quality is pretty good.", "Date": "March 25, 2013"}, {"Title": "Not a Security Camera", "Author": "Bud", "ReviewID": "R2E3B8OCFLIMUC", "Overall": "2.0", "Content": "I purchased the SAMSUNG Smart Cam SHN-1011N SmartCam Wifi Home Security Camera.  The primary purpose for the purchase was for Home Security.  The setup was very easy and the concept was what I was looking for, in fact I was considering purchasing more of these cameras for other areas in my home.  Unfortunately, I receive at least two false alarms per day from one camera in an empty house, the files saved to YouTube do not indicate a reason for the false alarms, and questions to SAMSUNG remain unanswered.  My recommendation is DO NOT purchase for Home Security because it doesn't work.", "Date": "June 3, 2013"}, {"Title": "No need to wake up my wife", "Author": "hunki paek", "ReviewID": "R3MVL3XQZYUJHR", "Overall": "5.0", "Content": "I’m a recent father of twin girls.  As much as I wanna spend more time with them, I can’t because of my job and frequent international travelling.  With all the new technology out there I know I can use things like skype to call home and see my girls, however with time differences and hazards to make phone calls its not always an easy access.  After doing some research, I was able to find this IP camera.  It connects to internet and lets you view wherever the camera is pointed at 24/7, as long as you have internet connection.  I have this setup in the baby room, where I can see them inside their crib.  Most of the time its night time at home (the camera has pretty good nightvision too) and they are just laying there sleeping, but as long as I get to see their faces, I am more than happy.  Another great thing is that I don’t have to wake up my wife every time I want to see them, which is definitely a plus.", "Date": "February 25, 2013"}, {"Title": "Great camera for watching doorways and rooms.", "Author": "Ryan", "ReviewID": "R14P4J0KBEKPD6", "Overall": "5.0", "Content": "Whole set up took me less than 30 minutes and now it’s working flawlessly. I set up every feature in this camera can offer. Picasa, YouTube, my iPhone app (smartCam), and such. The setup was straight forward, but only thing that really bugged me was login menu. It was keep popping up when I tried to see my cameras. Other than that, the picture quality and speed is great. YouTube feature is also big plus to me since I can post my dog’s “normal” behavior to public. Right now, I have 4 units installed in my house and love it. Highly recommend for anyone. Only thing that you have to do is follow the step-by-step guide line.", "Date": "February 22, 2013"}, {"Title": "Peace of Mind", "Author": "MommaB", "ReviewID": "R1TU187CVWAG14", "Overall": "5.0", "Content": "With all these horror stories about hackers getting into your home security cameras, it's nice to have a camera that has a 2-3 password screening system before it will actually let you access the video. Makes us feel safer. Would recommend this camera for all uses: general indoor surveillance, baby's room, etc.", "Date": "May 9, 2014"}, {"Title": "Worst possible webcam to buy, spyware, captive data, user hostile,", "Author": "S. Rider \"not religious\"", "ReviewID": "R1JHQK016GIWLY", "Overall": "1.0", "Content": "As a matter of design, all of your video and images must be routed through a webserver in Korea, accessed using a Korean DNS server, and you have no control or access to this horrible, awful, nearly criminal product unless you tell their website the login details.DO NOT BUY THIS HORRIBLE PRODUCT!", "Date": "March 24, 2014"}, {"Title": "no night vision", "Author": "J. Rose", "ReviewID": "RAM020BZD6OQX", "Overall": "3.0", "Content": "The night vision does not work. Can't see anything once the lights are out. I'm not very pleased with it.  Works fine in daylight, not sure if its worth returning, could have bought a new one by the time I pay freight & ins.", "Date": "February 24, 2014"}, {"Title": "Not sure what happened with the people above but mine works fine.", "Author": "Jody", "ReviewID": "R1B9NAUS31O9PK", "Overall": "3.0", "Content": "I've been able to auto send video to youtube, and email on events. I've also had good luck using the cameras with [...]. The video isn't great if using samsungsmartcam.com if it does use relay mode but mine only did about 1/3 of the time. Setup is easy for the camera and iwatchlife.", "Date": "February 22, 2014"}, {"Title": "Meets expectations.", "Author": "joel mann", "ReviewID": "R1F9LRH9VZJPGI", "Overall": "4.0", "Content": "Works great. Easy setup, smart phone works great on both my android and I phone.  Had to get a wps router and it's a bit sensitive to motion activation.  Sunlight through window activates it.", "Date": "February 3, 2014"}, {"Title": "Excellent overall performance", "Author": "Ghengiz \"ghengiz\"", "ReviewID": "R3NNRF4UHE9P74", "Overall": "5.0", "Content": "I have a tried different IP Cameras especially D-Link and Lorex, before settling on this one. I want, reliable IP cameras, easy to install and manage via PC, smartphone and tablets. I saw these cameras on sale at Costco during Thanksgiving. I bought hoping I could return them if not satisfied. But, after 3 months of use, that never happened.Installation is a breeze. You do need to register with Samsung and download software. During installation it is connected via Ethernet. I am not concerned about giving my router password to Samsung (What they gonna do?)Now this means that:1. Samsung Has total access to your video streams AT ALL TIMES. No big deal. Samsung does not have time to watch your videos.2. You can access your camera via Samsung mobile app or PC software or directly via web browser and view your video from anywhere. I have installed on all my devices without any glitch.3. Camera management software is by Techwin, a Samsung affiliate..4. When setting up your camera you are divulging very sensitive data to Samsung, such as your WiFi router's password. Okay so what's the big deal in this? If you want my router password just email me and I will be glad to provide if it makes you happy.Here are some highlights of this camera.1. The camera has 2-way audio which is very crisp and loud enough. The speaker is located at the back of camera. You can talk while you watch, like a walkie-talkie. You can control the volume.2. The camera switches resolution from 640x480 downwards depending on WiFi signal.  If there is a glitch in WiFi, it reconnects. I never had to unplug this device for this purpose.3. The night vision is awesome.4. It uploads videos to YouTube, Picasa and emails you video/image link of any motion detection activity. Even if you entire house is cleaned out by burglars, the video is safe on YouTube. You can download your video from Google+.5. You can control at what times to detect motion.6. This is excellent device for baby monitoring because of excellent night vision and 2 way talk feature.7. All you need is a smartphone or tablet with WiFi to monitor your house anytime.I am writing this after 3 months extensive use and have explored it thoroughly and I am impressed![...]", "Date": "January 21, 2014"}, {"Title": "Password Impossible to use", "Author": "raymond g carle", "ReviewID": "R2M95XYT1PJB34", "Overall": "2.0", "Content": "This thing seems to have no driver to operate it on my PC.  I don't know how to record video frm it; I assume I need other software.  I can't seem to get it to work wirelessly.", "Date": "October 14, 2013"}, {"Title": "Average video quality...", "Author": "James B. Williams", "ReviewID": "RZWZF4EBQMU72", "Overall": "3.0", "Content": "not top notch photo quality but at the price I would recommend, depends on what you are trying to see....", "Date": "September 22, 2013"}, {"Title": "Poor Quality", "Author": "Trey", "ReviewID": "R2PMESHIQJNEY0", "Overall": "3.0", "Content": "This is an ok camera DO NOT RECOMMEND for apple users. The video quality is poor and very choppy on a high speed cable connection!  Drop Cam is a much better alternative. Returned the Samsung.", "Date": "April 18, 2013"}, {"Title": "Fair for basic user, but not as good as dropcam", "Author": "Vic", "ReviewID": "R1T5BILPWR69MG", "Overall": "3.0", "Content": "I just bought the 2pack package from Costco for $194.99.  Becasue of the low price, I decided to give it a try even thought I already want to get the dropcam from amazon.  I really like the DVR feature for dropcam (such as turn off the dropcam when you are home automatically).  The SmartCam is now supported by iWatchLife.com as the cloud based DVR for \"Extra\" plan at $9.99/mth; however, it only stores 75hours(3.1days).  The \"Plus\" plan costs $12.99/mth for 200hours(8.3days) DVR storage.  Theoretically, you can store weeks of video footage for either plan becasue it's an \"Event-Based Recording\".  The cloud based DVR support unlimited SmartCam with no addition charge!  The only limitation is your Internet bandwidth.In short, if you are the basic home user who only cares to view the garage door down from iPhone, this is the product for you!  This product is also good for administrator who wants to put the SmartCam in the datacenter or colo via CAT5 intead of WiFi![Pro]- easy setup via mobile phone, don't need a PC to setup- free Apps for Android / iOS- cloud based DVR supports unlimited SmartCam without extra fee[Con]- video slow, not like full-motion picture - big letdown!!!- no PoE support on wired connection- need AC power adapter for 5V-2.2A output (cannot power by regular USB2.0 5V-500mA)If you have time, read the full review from PCMAG by Eric Griffith on 2/14/2013.", "Date": "June 17, 2013"}, {"Title": "Super easy setup and nice quality", "Author": "Rajan V. Arora \"ARO\"", "ReviewID": "R31B3NID3MH7QQ", "Overall": "4.0", "Content": "Pros:1. Extremely easy to setup. No need to to go to the browser and type IP address. No port forwarding or any kind of technical knowledge required. A simple registration of serial number on Samsung website is all you need. Dedicated iPhone app (SmartCam) by Samsung is great and free.2. The audio/video quality is great. Two way audio is supported by the free iPhone app. Motion detection uploads a 30 second excellent quality video to your private YouTube channel and pictures to your Picasa account. Again, the setup is very easy and all you need is your login information.3. Night mode is wonderful. It's not color but works great.4. Motion detection push notification through the phone app is wonderful. Sometimes I can't get the app to work on a slow 3G connection but I am not worried because I know that I can instantly go on my YouTube channel and see what's going on.Cons:1. I feel that the biggest drawback in terms of features is lack of remote pan/tilt. It's almost double the price of other IP cameras on the market but provides fixed view only.2. The camera is a bit unstable due to the cord connections being at the top. It's hard to position the camera on a flat surface even with just the power cord connected. I didn't even try the Ethernet cord. I don't think this will be an issue if you are mounting it.", "Date": "March 13, 2013"}, {"Title": "Shop with confidence", "Author": "John", "ReviewID": "R1Z2K5LHUB72J8", "Overall": "5.0", "Content": "At first I was skeptical of purchasing this product because of the bad reviews. But I decided to try it out because I am a fan of Samsung products and they never let me down. Plus I liked the design and the upload to youtube was very interesting to me.I received the product very quickly and smoothly without any problems with free shipping. So that was the first positive sign. I remember I really liked the look of it when I first saw it. Good looking camera and I can tell it was not made with cheap materials.Other things that I liked were the quality of the video, audio, and night vision. The white noise is kept to the bare minimum and does not bother me at all. The video during the day and the night vision is great as well.The youtube feature on this product is innovative. Others have complained and were worried that strangers can view your recordings; however, you can relax because it will be uploaded as private. I made a new youtube account just for this camera which was very simple.In sum, I guess this review is for all that is a little skeptical about this camera. But I own it and it works great for me. You can be confident that this will perform what it advertises it to be.", "Date": "February 11, 2013"}, {"Title": "Great product for pet! Highly recommended!", "Author": "Hwa Jin Jung", "ReviewID": "RWRPF2877RA65", "Overall": "5.0", "Content": "I purchased this camera to checking on my cat while I’m at work or leave my house for business trips. I got to say the camera works great. It is not HD quality but by having this, I do not have to worry about my cat all the time. It was pretty easy set up with guide. I’m not quite tech savy but I was able to connect this camera with my wireless router. The picture is very clear and easy to navigate on cell phone. I highly recommend this camera to anyone who wants to use iPhone to check their beloved pets.", "Date": "February 11, 2013"}, {"Title": "PLEASE DON'T BUY ONE!!!", "Author": "Golden Hands", "ReviewID": "R1I7AANNU2F257", "Overall": "1.0", "Content": "Found these in a two pack at my local Costco and $25 OFF.Took them home and unpacked just one to see how things went.I worked on trying to get the this camera hooked up to my Wifi for 30mins and was on hold with customer service that long too.  Their C.S. line kept saying at the beginning I was 12th in line and then eventually 6th after 30 mins.  I didn't want a call back I wanted results now.I Finally got a view from the camera.  Once I took the network wire off and pressed the Wifi button on the back the light was green and my computer said the \"Camera was unstable... unable to connect. \"  I did this three times and got the same message.I then dug out the second camera in the two pack and programmed that one the same way.  Same problem and error message.I use a MAC and thought it might be a MAC issue so I dug out my old PC and it made no difference.Both cameras would say... \"Camera was unstable... unable to connect. \"It sat on a counter top the entire time never moved it except to get it to work!I finally gave up and placed them both in the packing to take back to Costco for a full refund.I was excited when these went on sale for a package of two and thought these would work great.  Not!I have a Dropcam that I bought last year and will be buying another one again soon!  They take 5mins max to hookup PC or MAC!They do NOT require a network cable to program or find your Network or Wifi!I often turn the Dropcam OFF when home and turn it ON remotely with any of my devices (iPhone, iPad, MacBook... etc).They come on in an instant!I hope they come out with an all weather version someday.  Would be nice to have one outdoors as well.The best price on the Dropcam is from them directly and they cover the shipping it's FREE.  Their Customer Service the two times I called about simple inquiries was fast and top notch.  They were very kind people too! They are state side and all speak English perfectly!!!", "Date": "January 31, 2014"}, {"Title": "Returned", "Author": "DRY EYES", "ReviewID": "R3I39XB9LB0AMJ", "Overall": "1.0", "Content": "Found it on Costcos site for half the price.  Dd not work when I tried to use it so I returned. If it had worked I would have kept it.  I bought a different one", "Date": "September 10, 2013"}, {"Title": "Cannot Connect Wirelessly", "Author": "Michael Flores", "ReviewID": "R1B0DOM7AE0Y26", "Overall": "1.0", "Content": "They advertise and heavily tout on their website that you can have wireless connectivity.  They're technical support is also extremely horrible, and simply just reference the instructions....then once it doesn't work, they say, \"well it should\".  They offer to technical manual updates because they don't know how.  Extremely disappointing overall.", "Date": "July 25, 2013"}, {"Title": "Very Nice product!", "Author": "Ricky Sexton", "ReviewID": "RU5IOG9F3LO2Y", "Overall": "5.0", "Content": "I purchased three of these last week. Very simple to install and they function accordingly. The first two were easy to install the third had a software issue. I discovered this after a call to Samsung. Easy return through amazon. UPS picked up the day after I scheduled the return. Credit was issued the day after that. Today I ordered two more. I use them to check in on the dogs throughout the day. Kepping an eye on the kids is an added bonus....;)", "Date": "April 24, 2013"}, {"Title": "Poor Quality", "Author": "HOMER", "ReviewID": "R2O5I0DQGCEXO1", "Overall": "1.0", "Content": "The picture on this camera is horrible.  The field of vision is horrible.  EVERYTHING about this camera is HORRIBLE.  I would not  recomend this camera.", "Date": "June 6, 2014"}, {"Title": "Great product!", "Author": "Patricia M.", "ReviewID": "R3CG6V7JV84DEJ", "Overall": "4.0", "Content": "Great product, great price! Got these a few weeks ago to keep an eye on our house and dogs while vacationing.  Even though dog sitters came twice a day, it was very reassuring to check in on them to see that they were fine and so was the house.Only hitch-and it's probably my problem- activating the camera app on our phones and synching with the house wi-fi. We stumbled through it, but more detailed instructions  accompanying the product would have helped.", "Date": "May 25, 2014"}, {"Title": "Great picture and sound but...", "Author": "Hailey Jordan", "ReviewID": "R2AZ7AUFDIZN34", "Overall": "1.0", "Content": "The whole reason I purchased this camera was to be able to go back and look at my babysitters. It gives you absolutely no option to record. It says you can upload onto youtube, I have yet to find out how. If you would like to buy this camera just to observe than its GREAT! But I do NOT recommend this to anyone that would like to be able to go back on stuff.", "Date": "May 20, 2014"}, {"Title": "Works really well", "Author": "Jarrod D Johnson", "ReviewID": "R22FP9ELU2S6RY", "Overall": "3.0", "Content": "Easy setup, decent price. I like being able to see and chat with my family while traveling. I recommend it!", "Date": "May 19, 2014"}, {"Title": "It works well and solid!", "Author": "Tech User", "ReviewID": "R1SKBKY0DMZ879", "Overall": "4.0", "Content": "I liked it!product works based on what they mentioned in their technical specification.It's very easy to install and use!", "Date": "May 15, 2014"}, {"Title": "Worth the money", "Author": "Luxe", "ReviewID": "R1SRW7LPVUGPB5", "Overall": "5.0", "Content": "I love this camera! The set up is easy but you do have to be patient for the wifi to connect to the camera otherwise you have to start the process all over again.  I use it to watch my dogs while I'm work and I can even talk to them. Pretty good smartcam for the price!", "Date": "April 19, 2014"}, {"Title": "This is a camera...nothing more", "Author": "richmondvamom", "ReviewID": "R1ZD5S2CWETJD9", "Overall": "2.0", "Content": "My dad got us these from Costco because he felt my old Lorex system was not suitable to view his grand kids. ( but that little system has been great for nearly 4 years) I put up with nearly three hours of set up only because I can view this on my iPhone.  If the set up would just tell you WHY it did not connect it would be soooo much faster. Samsung can tell you if it is the password or the WiFi, it just doesn't . But I am NOT going to watch cameras in the kids bedrooms via YouTube!!!!!! So I have no clue about how well it records or motion detection problems. I use these to see who is getting a time out and because I can still use the two way talk to remind them of what sharing means.", "Date": "April 3, 2014"}, {"Title": "worth the money", "Author": "ben", "ReviewID": "R3K6YYOS2DHL88", "Overall": "5.0", "Content": "I ordered 2 of the wansviews security cameras both went bad in 2 weeks I tried to call the company and wansview is out of business and as a fake website that is only in Chinese ,had this camera set up in 30 min it uses Samsung's cloud but better than trying to port forward your wireless router that's impossible unless you are a It tech, just download the Samsung app from the playstore and works great with any android phone create a YouTube account and it will upload up to 30 motion detected 30 second clips", "Date": "March 23, 2014"}, {"Title": "Absolutely dreadful.", "Author": "rob", "ReviewID": "R3ECN8HS7FJCG1", "Overall": "1.0", "Content": "Samsung requires the device to be registered before configuration. Further, a browser plugin is needed before the video can be accessed. A Samsung customer service supervisor informed me, somewhat rudely, that no, I could not access the video stream directly, that would be altering the programming of the device and isn't supported. They don't care to provide adequate instructions for connecting to the device. Either use their cloud services and accept the limitations of that or use the browser plugin ( which I cannot) or return the device. I purchased this at a big box store, and it's going right back. It looks like I can buy two Foscam FI8910W cameras for the price of this p.o.s., and I'm told they work just fine without all the stupid.", "Date": "March 22, 2014"}, {"Title": "Really like BUT,,", "Author": "Patsy21", "ReviewID": "R22ZIVYWLFIGFW", "Overall": "4.0", "Content": "I bought this recently for $69.00 and just saw it's been raised to $89.00?! Why was the price raised so soon?", "Date": "March 13, 2014"}, {"Title": "Great!", "Author": "NamVetReader", "ReviewID": "R9HR5K65ON12M", "Overall": "5.0", "Content": "Using it to watch my dogs during the day, it is great!It does exactly what I want it to do.", "Date": "March 3, 2014"}, {"Title": "Good little IP camera for the price!", "Author": "meow", "ReviewID": "R1AZO1IHJA3V0T", "Overall": "5.0", "Content": "As many of the reviewers, I was recently burglarized.  As a result, I was looking for an inexpensive way to supplement my current alarm system.  I purchased this at Costco, and they came two in a pack, so the price was right.Until recently, I was just using it as basically a kitty cam and would log in using my Android app.  However, I am getting a security door installed tomorrow, and thought that I might like to try some of the motion/sound detection features so that I may mount it between my security door and the front door to see who is coming up the walkway.YouTube upload:At first, I could not get this to work for the life of me.  I kept getting the error message, \"Check your ID and password.\"  Finally, I logged into my YouTube account first, then went to the settings tab on the samsungsmartcam.com tab and was able to save my information.  Then, I selected both sound and motion, and set the settings for sensitivity high.I walked in front of my camera.  Nothing.  Again.  Nothing.  Thinking it didn't work, I went to bed.  When I got to work, I had 38 email alerts from YouTube for motion (the camera is in my bedroom!)  :)  It is unclear to me if sound is detected or not.  So, for those of you who have not been getting the YouTube function to work, I was able to do so.Sound detection:Doesn't appear to work.  :(  Maybe I'm doing something wrong...Optional iwatchlife.com service:The only benefit I can see to this is that you can set \"zones\" that make false alarms less likely.  Also, the length of the video matches that of the movement, so if you want more than the 30 sec. of video that the YouTube service offers, this would be for you.  However, I wish they offered monthly plans.  The cheapest plan is $59 a year.  I am still evaluating this service, though, and will update more later.Overall:It's not cutting-edge technology, and the website interface leaves something to be desired, but overall this is a good purchase if you want a either a doggie/kitty cam or a supplement to your home security system.  I think this will work perfectly mounted in the door frame of my front door to monitor \"visitors.\"  Will add more feedback after I install at my front door.Update 2/8/14:Audio detection works!  Too well...I shut it off.  I think the iwatchlife.com is necessary, unfortunately.  It has you create a \"watch zone\" that eliminates unwanted detections.  I had 40 of them without the iwatchlife.com help.  Sigh.Mounting this thing to my doorjam was HELL.  Hell.  I finally gave up and just used the sticker that is enclosed in the box.  Anyone else want to throw this thing while trying to use the mounting bracket???Update 3/15/14:I have to say that I really like this camera!  It DOES give me lots of false alarm motion detections from the iwatchlife.com service due to sunshine shadows and bushes blowing in the wind, but, that's okay.  I like that you can set recording schedules, or record on demand for a set period of time (with the iwatchlife service).  I might be taking a vacation in July, and I would set a recording schedule for the time period that the cat sitter would come.  This gives me piece of mind, which is priceless.  This doesn't take the place of a home security system, but I have to say that it comes pretty close.  Overall, I recommend this purchase. I updated my rating from four to five stars.", "Date": "February 3, 2014"}, {"Title": "Not best in class", "Author": "Amazon Customer", "ReviewID": "R1L14NYYG2KLWH", "Overall": "2.0", "Content": "This camera is the type that connects to the Vendor's Service Bureau and then you access the camera by connecting to the Vendor.  This is a \"consumer product\" service design idea with fairly poor performance and not very secure for your home network.Some other cameras that used this user-connection model, allow you turn this remote access feature OFF and use conventional port forwarding and DNS to access the camera.  This camera does not let you turn off the 24/7 connection to Samsung, so Samsung has a nat/mapping connection back into your house 24/7 . . (no thanks).This camera can be used with port forwarding, but its complicated by the fact it cannot be configured with a Static Address on WiFi.  Static is OK on Ethernet, but doesn't carry over to the WiFi for some reason.In most ways this camera is sub-par. I will mention only  1 of many additional issues . .  if you already have some cameras that save video clips to an ftp or smb server, who wants to add a camera that only saves clips to Youtube etc ?Its been around for a long time, but from my testing the Cisco WiFi N camera is still among the best of the all $100 cameras.  It doesn't get good ratings, because the setup CD is useless making it impossible to setup if you aren't an IT type.  Like with most networking products, you don't need the CD to setup the Cisco and the the built in Admin web site works fine.  I have 18 of these Cisco cameras and they even work at 30 below zero outside (under roof overhangs). I have had some of these for up to 3 years and never had a problem. This Camera is on Amazon for $95. Its listed as \"Linksys Wireless-N Internet Home Monitoring Camera\"  You have to know networking to get access to this camera from outside the house.Back to the Samsung, I thought it was strange the Box says \"Access the camera from any PC . . no software needed\"  That's not true; you have to install the SmartCam plugin for it to work, even if you force the Port forwarding connection option (which is not mentioned in the User Guide).", "Date": "February 2, 2014"}, {"Title": "Too many false alarms!", "Author": "Chris", "ReviewID": "R3711D6ARK44N6", "Overall": "1.0", "Content": "Even at the lowest sensitivity settings, the Samsung SNH-1011 SmartCam IP Camera triggers false alarms especially during the daylight to night transitions and back.  Even with the motion detection disabled and only using the noise detection feature, you will get false alarms.Little wonder Samsung is dumping these units as fast as they can to Costco and BJ's.Don't waste your money!", "Date": "January 30, 2014"}, {"Title": "A decent little wi-fi camera", "Author": "Acey", "ReviewID": "R27MHQ23TX0HOL", "Overall": "4.0", "Content": "I bought two of these puppies off of Ebay a few weeks ago - one used and one brand new, sealed in the box. For the life of me I cannot figure out why there is so much hate towards this camera.  I'll admit that I had some frustrations setting up the camera because it turns out that you cannot connect the camera's wi-fi to an Apple Airport Extreme, but once I connected an old D-Link into my Airport and connected the two cameras to the old wireless router, I was in business.  I then downloaded the Samsung App onto my iPhone 4S and set up the camera via the app.  I don't recall \"signing my life away\" as one reviewer stated - who knows, maybe I did.  I'll live with it (think, The Lives of Others). The app is great in my humble opinion (granted this is my first experience with a wireless camera).  You can view live events (about a 2-3 second delay), review audio or motion events automatically sent to a (private) Youtube account and adjust the camera's features via the app.  I primarily use my two camera to watch my dogs while away at work and to ensure the dog sitter actually comes to the house during the day.  The image quality isn't bad, but isn't great.  You can make out my facial features and recognize me at 10-12', beyond that you can tell what are you looking at, but without great detail.  I've seen bank robbery images that are much poorer quality than what you get with this camera. The night vision is absolutely fine in my opinion, allowing me to see my entire living room at night (18x25' or so).  The best part of this camera - once you buy it, you don't have to pay any ridiculous fees or keep a subscription.  This is the main reason I bought the camera. Two last thoughts. I paid $75.00 for one camera on Ebay which seems a bit more fair than Amazon's listed price of $100.00.  And finally, Samsung recently announced they will be releasing a new HD interior AND (awesome) HD outdoor camera.  Search Google for the article.  If you can wait three more months and don't mind spending twice as much, I'd forgo purchasing this camera, but if you're looking for a decent wi-fi camera, I wouldn't hesitate buying the Samsung SNH-1011.PS I'm real. Please see my other reviews as proof!", "Date": "January 29, 2014"}, {"Title": "Does NOT work with Apple AirPort / Time Capsule ??? There is a work around!", "Author": "Dan's Review \"Dan\"", "ReviewID": "R1SN78RBVO750H", "Overall": "3.0", "Content": "Your Wi-Fi router/hub MUST support WPS (Wi-Fi Protected Setup) to set the cameras up on a Wi-Fi network. You can NOT connect any other way except through a WPS button on your Wi-Fi router/hub. Crazy you can't change the settings via a web browser, etc. I was on hold for 34 minutes before a tech support person came on to tell me these cameras are NOT compatible with Apple AirPort / Time Capsule. The documentation does not say that anywhere.....argh.However, a quick search on the Internet and I found that there is a procedure for connecting a WPS printer to an Apple AirPort / Time Capsule. So, I followed that and it worked! Will have to see if it is a stable connection though....See this video [...] and follow the part until the 1:15 mark. First disconnect the Ethernet cable. Remember when you hit \"Continue\" on your computer screen to then press the WPS button on the back of your camera. Then you will see it blink blue, then steady blue, then steady green. Then go to the web page and it will show up. I hope this ends the frustration. Or time for another simple DropCam!", "Date": "January 22, 2014"}, {"Title": "Great Camera", "Author": "OE", "ReviewID": "R3A0GTRBITZGT1", "Overall": "5.0", "Content": "I bought these for my house, I had a little trouble setting them up but I called Samsung and the guy walked me through it. I have two cameras and I can see them live on my app from work. I recieve all alerts and can access my events videos on you tube. The two way is a little low probably not understandable. I like the night vision since one is in my garage pointed at my safe. For the money I think its a good choice, now its not a $600 cctv system but for the price and teamed up with my alarm I think its the perfect combination.", "Date": "January 15, 2014"}, {"Title": "Good for limited uses", "Author": "Cat & Dan", "ReviewID": "R3BUYV2VQ9QPJE", "Overall": "3.0", "Content": "We got a set of these at Costco to see what our dogs were doing when we were away. They were great for peace of mind, but little else. What we learned is that they slept all day. Good to know, but not terribly helpful. I gave it a 3 because they did what we wanted, but that is such a limited use and I would recommend for people who want more detail.The video is pretty crappy, if viewable. If you want to monitor a baby or aged relative, get something vastly better. It took us forever to know how to speak from smartphone to the dogs, but it's so quiet as to be useless. Plus, unless you just happen to be watching when they're ripping up your down comforter (yes, and we weren't) then it's not possible to use the mic to tell them \"no\". More importantly, if you want this tool to communicate with, say, an aging relative, forgetaboutit.I hear it can record, but I see no such functionality. That's important if you want as a security camera. Frankly, I don't see this useful at all for security unless you want to monitor your back door from the bedroom. Still, choose another even so.The resolution is seriously not good enough as a baby monitor.So if you want an inexpensive, easy-to-use virtual toy to know that your pet isn't unhappy (or is, I guess) then this is just fine.", "Date": "January 1, 2014"}, {"Title": "Loses the connection a lot. Hard to see up close.", "Author": "Amazon Customer", "ReviewID": "R2CGJUX8TMAJ2B", "Overall": "2.0", "Content": "Loses the connection a lot. Hard to see up close. Thought it would be good since it is a Samsung.", "Date": "December 24, 2013"}, {"Title": "Samsung Smartcam WIFI 1011", "Author": "Dan", "ReviewID": "R2GWB1PTSKUNJY", "Overall": "2.0", "Content": "Very poor instructions (this is my biggest coaling with most manufactures. If they spent more time with good instructions, manufactures would spend less time with support activities.) on how to set up the cameras and link to applications. I link MY iPhone to it with YouTube since it appeared to be the easiest. It took hours to figure this out even though I have decades of experience with computer HW/SW. I bought this because we were burglarized two months ago. It appeared to be an inexpensive solution for we working stiffs. Like most of us we want to feel safe in our homes. This isn't a good solution. The cameras do not always alert and most of the time send false alerts. Moreover when it sends an alert it rarely uploads to YouTube. The alerts won't wake me up and I'm a light sleeper. There's an event Icon but don't ask me what it's for. There's never anything in it. In summary, the instructions are too little to help even experienced application users. I'm a big fan of Samsung products but this product failed to meet my expectations.", "Date": "December 15, 2013"}, {"Title": "Decent Good Camera for Low Price", "Author": "ERIC", "ReviewID": "R1HLIQHF8G5MP", "Overall": "3.0", "Content": "Pros:1. Records video and audio2. (Currently) unlimited recording storage viewable by a private and secure YouTube account and other social media outlets.3. You can view live video and recorded files via smartphone, tablet, PC. (Download the Samsung SmartCam App)4. Audio and motion detection recording.5. Accessing recordings is easy and secure. No need for a physical dvr or a hard drive that can be stolen by criminals.6. Connect with Ethernet or wireless connection.Cons:1. SmartCam app does not have a logout option (You must restart your phone to stop receiving audio and motion notifications after logging into the app)2. A few weeks after installing I did have a couple of weeks where the camera was receiving motion and audio detection but would not record the events. Contacted Samsung customer service. It appears all is working well now, but it took a good week for it work properly.3. Not the best or clearest picture, but for the price it's not bad for it's intended purpose.4. The Samsung SmartCam website used for viewing the camera, settings and options could use an overhaul to the interface.", "Date": "December 5, 2013"}, {"Title": "Finally, now we'll know if the garage door is closed or not.", "Author": "Happy r/c", "ReviewID": "R2JY0QFWNWLD5L", "Overall": "4.0", "Content": "PROS:- easy setup in about 15 minutes per camera- in daylight, picture is sharp- night vision- motion and audio sensors- save  footage to youtube but only 30 seconds clip per triggered by motion or audio- free iphone and android apps- can access via web but a plugin must be installed.- On 1 pc, the web plugin worked with Internet Explorer 10 and Windows 7.- small size- easy to mount with screws or the attached 2-sided tape providedCONS:- On a 2nd pc, the web plugin didn't work with Internet Explorer 11 and Windows 7. So I used Firefox and it worked.- resolution is 640x480- only 5 frames per second which is not real-life 30 frames per second", "Date": "November 20, 2013"}, {"Title": "Easy to set up, reliable, offsite storage is great.  Some issues...", "Author": "S. J. Luke", "ReviewID": "R23LAS2HPGLGB2", "Overall": "4.0", "Content": "Setup:Pretty darn quick.  Plugged the power cable in, plugged the Ethernet cable in.  Went to the website and registered the camera.  On Chromium I had to download an install a plugin to get the video, but in all, it probably took 15 minutes from unboxing to having it connected to the WiFi (you setup the WiFi from the web page).  I have a few Belkin cameras, and setting them up is much tougher (my third Belkin took 1:20 minutes, partly because it is complex and partly because the cameras will crash multiple times when you change settings) - setup is actually the reason I chose not to use Belkin this time.Features:Key features for me, that set this camera from others are the remote storage and the night vision.Having the ability to upload the video to YouTube when a trigger occurs is great for peace of mind.  The other cameras I use have to use FTP or SMB to store images, and that just isn't available for remote storage without paying yearly fees.  They can send email alerts, like this camera does, but they don't support SSL, and almost no email service worth using allows non-SSL connection nowadays (and if they did I wouldn't use it).  So I end up relying on home computers to host image storage, shuttle the data off to network, and as an SSL tunnel to an email service.  Since they rely on local computers they are (more) susceptible to outages or being interrupted by intruders.  The fact that this camera can send images directly to the internet without relying on local computers makes it harder to interfere with and less likely to fail (OS updates and all...).The night vision is surprisingly good.  I purchased it with night monitoring in mind, but honestly had low expectations, but the camera works as good at night as during the day for me.Resolution and Speed:When viewing live remotely, the video starts at pretty poor resolution, but as you watch the resolution increases.  I have never had any resolution issues with the videos uploaded to YouTube.  Speed and delay is also spotty.  Sometimes I see the video with a second or so lag, other times it is much worse.  If you are on the same network, or allow port-forwarding, you can actually view the camera without the Samsung site intermediate.  This could allow faster remote monitoring, though i haven't tried it out yet.Issues:This has been talked about before, but there are a number of false positives.  This seems par for the course: I am pretty sure a few of them each day are related to switching between night and day modes, because there is a severe shift in light intensities.  I also know the sound trigger is pretty sensitive.  I can deal with false positives, though.  Better than not being sensitive enough.  But these cameras do seem to trigger more false positives than my other cameras.There are limited configuration options, turning triggering on and off requires configuring a triggering schedule, which means changing from a routine could lead to lack of protection.I have a third party smartphone app that I use to monitor my other cameras, but it doesn't seem to work with the Samsung, you need their app to monitor.  This isn't the end of the world but I would prefer a more open/standard approach so I could use one app for all the cameras.", "Date": "August 23, 2013"}, {"Title": "Not bad!", "Author": "Shayne Pilon", "ReviewID": "R1B2M11SOV40JP", "Overall": "4.0", "Content": "So far so good. Not sure about all the talk of you tube but I'm using this camera for baby and security. There is a delay at times.", "Date": "June 23, 2013"}, {"Title": "I love it!", "Author": "Hyun Soo Kim", "ReviewID": "R3AX8GPVX7SU8U", "Overall": "5.0", "Content": "I needed a camera to check up on my grandmother.  As she is elderly, I wanted something that I can rely on to view her room, to see if everything is alright.  She has hard time speaking on the phone, so this camera also helps in great deal communicating with her since I can see her face in real time.  I have also considered using the baby monitors, however most of the baby monitors doesn’t have the remote viewing feature and this was perfect replacement with the feature I want.  I can view her room through my smartphone or anywhere with a computer where there is an internet connection.  Love its sleek design too, and you can mount the camera on walls or other surfaces with a bracket. It’ simple and stylish.", "Date": "February 18, 2013"}, {"Title": "Should be a $99 camera.", "Author": "P. Cox", "ReviewID": "R1QV8O0N548AVH", "Overall": "3.0", "Content": "The first reviewer posted a couple of the same complaints I have with the product, and a couple I don't.  So here goes:Complaints:(1) The website is slowish, but that's forgivable. Just a minor nuisance.(2) The email function (sends captured video - noise and motion - to your email) is too complicated to set up.  It requires your email address and password, along with other information that I cannot find and really just don't know what it is.  Thus, my videos are uploaded to YouTube as private. Which works too, but I would like e-mail notifications and not just phone notifications.(3) The YouTube upload also requires your username and password.  As the other reviewer said, why are we giving out our passwords to strangers???(4) If the camera detects motion/sound, it captures a 30 seconds clip about 1-2 minutes apart.  You cannot view more than 30 seconds of previously recorded video or combine multiple 30 second clips to view one continuous video. There is no function in which you can go back in time to view continuous video beyond motion/sound detected in 30 second intervals, 1-2 minutes apart.(5) The camera should be $99. Just my opinion.Pros:(1) The website is easy to navigate, except for setting up your e-mail notification as I mentioned in (2) above. Otherwise, the site is fairly simple.(2) For the price, the video quality is good. It has good color and night vision.(3) The phone app is handy and works for me (Motorola Droid Bionic). Motion and sound notification are sent to your phone. Again, see (2) in complaints regarding email notifications.(4) The YouTube function is handy and the videos are uploaded as private.(5) You can log on to the Samsung website or the phone app and view live video.  (This is the only way to view video beyond 30 second intervals.)", "Date": "January 4, 2013"}, {"Title": "Great IP Camera!", "Author": "lalala", "ReviewID": "R2CK2RQJK6XU5X", "Overall": "5.0", "Content": "Let me start off by saying that I am most definitely NOT a tech person.  Never really been up to date with all the latest gadgets and what not, and when I first received this camera as a gift I was a bit hesitant.  My first thought was, \"an IP camera?? What is an IP?  How am I supposed to set it up?? It's going to be such a pain....\"  With all the confusion and skeptical thoughts going through my mind I just thought might as well give it a try, it was a free gift anyway.  To make the long story short, this is an IP camera that ANYONE can use and setup.  Even I was able to set it up, which means pretty much anyone can do it.  All I did was followed the instruction in the manual step by step, and I had no trouble setting up the network.  You first plug the ethernet cable into the camera, so all the online signing up stuff and register the camera, then you follow further instructions to setup the wireless network.  Once that is done, you can pretty much move the camera and place it anywhere in your home.  I had mine setup in the living room and I can view my home anywhere as long as I have my phone.  I know some people use this camera as a baby monitor to monitor their babies, but it's a great pet monitor as well.  While I'm away, this thing makes sure that my dog Copper isn't making any more mess than he should  This thing also has a talk back feature, meaning I can yell at my dog and make an interception before the crime is done.  I will admit, although it was a gift I couldn't help but check the price and it's not at all as expensive as I had imagined it would be.  It's definitely worth its priced value and I think it makes a great gift for anyone, not just those who have babies or pets to monitor.  Just setting it up will allow you to view your home or office anywhere, so you will have assurance that everything is well and put even though you're not there.  I am actually thinking about purchasing another one for my store, to check up on the warehouse time to time.  I definitely recommend this product, so easy to use and practical.  Buy it!", "Date": "February 8, 2013"}, {"Title": "crap", "Author": "D. OBrien \"DOB\"", "ReviewID": "R14545ZD1DSC1X", "Overall": "1.0", "Content": "I tested these out from Costco and they are crap. I'm not some home security elitist either. I use the lorex 104 PING and it is lightyears ahead of these poor quality cameras. I was not able to get the camera workingon my mac, but was able to get it on my iPhone. Still, the picture quality is horrid and choppy as heck. Definitely not worth purchasing. If you want a good product, use the Lorex PING. Exact same price at Costco )if you can find it) and it works 100% all the time for me. I've never not been able to connect within 5 seconds from anywhere I go. But, these samsung smartcams are terribly unreliable and I would not recommend them.", "Date": "August 6, 2013"}, {"Title": "security camera with all the features.", "Author": "Nicole", "ReviewID": "R36YGB766FGEVI", "Overall": "5.0", "Content": "Smooth image and easy installation. Works great with my internet connection. I purchased this unit to monitor my store counter and hear the sound. I hired IT guys to install these cameras so I do not know how to install these things, but it meets my expectation and working great on my iphone. Downside is it cannot record video, but it is not big deal to me. I recommend this item to someone who looking for low budget security system.", "Date": "February 22, 2013"}, {"Title": "Thank you for the convenience in mind", "Author": "applepia", "ReviewID": "R2OQU4B04V705N", "Overall": "5.0", "Content": "I really appreciate Samsung for making this camera so easy to use. This is my third IP camera and the other ones were very hard to use for no reason. Most of the IP cameras nowadays require a complicated set up which really ticks me off. I am a busy guy and I do not want to get extra stress setting a camera up which I paid good money for. I want something that is simple and quick.This camera took less than 10 minutes to set up and most importantly without any stress. The other two needed a good amount of technical knowledge, needed my ip address etc. I am not that technically savvy as I am just a regular guy. So I am thankful that I found one that was easy to set up and easy to use as all it needed was one click on the camera and one click on the router.", "Date": "February 12, 2013"}, {"Title": "Perfect camera for my needs", "Author": "joseph jin", "ReviewID": "R3AS8R71AZMS3Y", "Overall": "5.0", "Content": "Overall, this camera is suitable to my needs. I bought this item to see my grandchildren who live in Asia. I send it to my son, and he said it was not that hard to set it up. Now, I can see my grandchildren on my iphone and say hi to them. The technology of this item is fascinating. I’m planning to purchase more to install it in my house as well. If Samsung is able to add moving function of camera, it will be super.", "Date": "February 11, 2013"}, {"Title": "Useless - I bought it at Costco, did not realize Amazon had it.  Just as well, returned it.", "Author": "Charles W. Arnold", "ReviewID": "R1YH3Z45X8ZDU4", "Overall": "1.0", "Content": "I cannot comment on the actual product, I think the other reviews pretty well nail that, however.  My issue was with the setup.  After wasting my time downloading the iPhone app, I found EVERY user name I picked was \"in use\", given the variety and obscurity, along with random combinations, that is not realistically possible.  So, I went to the suggested website for setup.  The good news is that it exists, the bad news is that while it exists, it is just a page that tells you that you are not in the right place.  What a piece of garbage.It will be a long time until I forget this fine Samsung experience and waste time and money on a Samsung electronic item.  Refrigerators they seem to have in hand, though their ice maker sucks in said refrigerator.  Oh, well.  Lessons learned!", "Date": "January 1, 2014"}, {"Title": "Cannot get past setup stage", "Author": "ggmm", "ReviewID": "R1RLC1EF4GR6U7", "Overall": "1.0", "Content": "I, too, cannot get these to setup, either via wifi or ethernet.  I've actually been trying off and on for weeks and have scoured the online reviews and help.  No success.", "Date": "December 28, 2013"}, {"Title": "My first review ever because I strongly believe this product sucks!", "Author": "callred2425", "ReviewID": "R1LX9K7UFHJH0Y", "Overall": "1.0", "Content": "These cameras suck. The setup in theory should only take a few minutes as the steps are very simple but it wasn't. My husband and I could never get past the last step, which is actually connecting to our wifi. It always failed. And all you can do is start over and repeat the steps again. I timed it, every try took about 5 mins to find out it failed YET AGAIN, and we tried for a couple hours. We finally got lucky and got them both connected. But then we discovered once unplugged you have to start ALL OVER AGAIN and spend another big chunk of time getting them to connect. So have them plugged into the outlet you want them to be plugged into before setting them up!We are completely frustrated with this product and after reading many reviews stating similar problems and seeing it's low rating, we are trying a better product. We are returning these and trying the Dropcam.", "Date": "December 27, 2013"}, {"Title": "Easiest Setup of All Cameras on Market", "Author": "mecdatlanta", "ReviewID": "R1R66CDN61RY1X", "Overall": "5.0", "Content": "Greetings,I didn't buy these via Amazon. I bought a 2-pack at Costco for about $30 more than a single unit here in Amazon.These cameras work great -- period. But most importantly, they are super easy to set up. What a hassle port forwarding and using Dyndns (or others) is! Not to mention sending email alerts -- try connecting to a server that is other than your ISPs' smtp server! And even if you are able to figure it all out, why would you spend the time? With these units, you literally plug them in, and the software sets everything up for you. I had instant access via the internet (thanks to Samsung's servers), instant email alerts (again, thanks Samsung servers!), and zero frustrations!Save yourself time and frustration with the other cameras out there. There are some that will offer a better picture/tilting/panning/etc. offering.  But this one has a good picture, good sound, it's actually quite inexpensive (when you factor in not having to pay the dyndns yearly fee, it's an even better deal), and it JUST WORKS!I was so happy to be able to set this up at my mother's home so that she can keep an eye on things when she is away. And now I know that if she has to change something to her computer setup, she can easily set this up again on her own. It's that easy.", "Date": "July 27, 2013"}, {"Title": "No more waiting!", "Author": "KyeRyoung Lee", "ReviewID": "R63NE4RPKAM7", "Overall": "5.0", "Content": "I live at a fret house with 14 other girls.  With all the high-maintenance estrogen-rich girls running around, you can probably imagine how crazy it can get.  I got this camera mainly for our laundry room downstairs, as its always a battle to get an open washer and dryers.  With 15 girls living in the house, its nearly impossible to avoid at least an hour wait to get your laundry done especially during finals time.  Then I saw one of this setup in my brothers room back at home and decided to try it out at our laundry room (with other ladies' permission of course J) And low and behold, the problem has resolved!  The camera lets me view and monitor the laundry room with my phone and allows me to time my schedule, avoiding the busy times. (it also lets me view few others things that goes on in there, if you know what I mean..) The setup was pretty painless, just hook it up to your wireless network and then set your camera up wherever you want in the house. Resolution is pretty good too and so far it hasn't had any spontaneous disconnection issues or anything.  No more time wasted waiting around for clean clothes!", "Date": "February 26, 2013"}, {"Title": "I love this camera! It was so easy!!!", "Author": "Alma Rodenas", "ReviewID": "R2641ROOZGAWV8", "Overall": "5.0", "Content": "Five stars!I love this camera.  I bought this camera with 2 of my best friends.  We often coordinate different outings and events together and these cameras come in real handy visualizing and sharing our ideas together.  We are no technical wizards but these were easy to setup and simple to use.  Yay!", "Date": "March 19, 2013"}, {"Title": "Not As Easy As They Say", "Author": "Carol Kirkley", "ReviewID": "RNFPDI879VICS", "Overall": "2.0", "Content": "I purchased this item and spent several hours trying to get it to connect with my wireless router.  I have several wireless items in my house that had no problem connecting.  I have a strong wireless signal too.  It looked like a good deal but the item never would connect with my router....Sent back item.....Will try a different brand next", "Date": "March 28, 2014"}, {"Title": "Read this before you buy.", "Author": "Yash Dubal", "ReviewID": "R3MNWJ0XQRNX7B", "Overall": "4.0", "Content": "This camera has not received a fair review so far, partly because it is Samsung brand and Android technology which Apple users love to flog. They also compare this with professional grade IP Cams which cost several hundred more.Here are the facts about features:1. Works in WiFi or Wired mode2. Uploads private video to YouTube and images via Picasa to Google+This is good as no disk space is used, no CPU hogging and from safety perspective. (What if your PC is stolen along with the camera?)Many people have raised security questions about this. However, these postings are private, in fact people have made them public and are proudly sharing. Just search Motion Detection on YouTube.3. Your router password is stored by Samsung. (Is that a big deal?)4. Two way talking works like walkie-talkie. The voice quality is very clear from the speakers at the back of camera. You need to press an icon to speak and release to listen. But, cannot do both at the same time.5. Requires Samsung Techwin plug-in. You may have trouble watching in your own web browser. Try to update to latest dot NET for Microsoft PC's. Despite that I still cannot see video on my PC but on Laptop I can. That does not preclude you from managing the camera.6. WiFI connection drops.It does if WiFi or Camera has a glitch but usually reconnects in an hour or so.7. Video quality640x480 at 30fps under ideal conditions, frame rate drops but video quality is still very good compared to competitors.See my video at:[...]7. Night visonThis is awesome. I have not seen any camera coming close to this.8. InstallationSamsung could have made this simpler. Installation is not intuitive and frustrating. Requires 3 passwords: to log in, manage camera, manage camera remotely.9. Pan & ScanNot available.9. Over allGood bang for your buck. You may want to consider D-Link DCS-932L or Lorex especially dome shaped with Pan&Scan; and antenna. Be prepared to shell-out extra bucks for these features.", "Date": "January 25, 2014"}, {"Title": "Easy to Install and setup, work great!", "Author": "net2dave", "ReviewID": "R20L3NBZEEGHE9", "Overall": "5.0", "Content": "I bought the 2 Pack Samsung Cameras, it was much easier to set up than the Linksys Cisco Camera I had that always had issues. They also work really well and are easy to access from my Android tablet and Phone remotely.I am going to purchase a couple more for my House now that I know they work so well.", "Date": "December 9, 2013"}, {"Title": "Love it!", "Author": "Golfmanbil", "ReviewID": "R9EXCTCNSLWCK", "Overall": "4.0", "Content": "My sole reason for buying this was to have a way to watch my home from my cell phone.I have a Samsung Smart phone and several Samsung TV.s  All have been outstanding products.I bought my cameras from Costco, and plugged them in. Setup on my cell phone was incredibly easy and within minutes I was viewing my home from two cameras. Nothing fancy, just a solid video feed to my phone. I love the fact that I am notified by email if any motion activity is detected. It will also do this for sound. Plus, you can click a button on the camera while watching the picture and capture the image.I'm not sure why this product is getting all these poor reviews, but for what it cost I am very satisfied.", "Date": "November 25, 2013"}, {"Title": "Great Monitoring Device", "Author": "Jessica Murphy", "ReviewID": "R154FK267VPK1J", "Overall": "5.0", "Content": "I know Samsung makes other security products with DVR’s and weatherproof cameras.  My brother in law actually owns one of those DVR systems and its great, however I didn’t quite want to invest as much because I didn’t need to record the footages.  All I wanted was the ability to monitor live view of my office while I’m away on business trips, to just make sure everything is where its suppose to be and check up on other workers.  The device is perfect for just that purpose, for casual monitoring and viewing the live-feed of a location.  Setup is super easy, I think it literally took me 5 minutes.  So far, no interference issues.  For what its worth, I think it’s a bargain, I would recommend.", "Date": "February 17, 2013"}], "ProductInfo": {"Price": "$169.99", "Features": "Built-in Mic and Speaker for Two way talk\nBuilt-in IR LED Lamps for Night vision WiFi: 802.11 b/g/n Frame rate: 30fps\nMonitor on PC, Mac, and Smartphones\nAudio and Motion detection and notification\nFree and easy recording on YouTube", "Name": "Samsung SNH-1011N SmartCam WiFi Home Security Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41aqF4pcxwL._SY300_.jpg", "ProductID": "B009XP1HS2"}}