{"Reviews": [{"Title": "Excellent product for the price", "Author": "Bryan S. Zielinski", "ReviewID": "R3JVO55WLVR3HR", "Overall": "5.0", "Content": "My Father was looking for a DVR system for many years.  He had a camera and it was only to see when visitors were at his Garage door. He always felt that capturing the video would be useful as well.  We realized that he needed a DVR system. After months of looking I decided to do a search on my own and discovered this system on Amazon.  The system had many useful features like remote monitoring, Motion activated record, night vision to 30 Feet, and a total of 4 cameras for the rest of the house.  I told him about the price and he had me order it right away.  It came quickly and I had it out of the box on arrival.  After setting up the system we had instant access to the system from any PC in his house. Also after a helpful tutorial from the ZMODO website I was able to configure his router and we were accessible from the internet in about 10 minutes. There is no audio and the video is far from HD which you only get with systems that are twice as much as this one. It has PTZ ability for one camera but this is not shipped with one. Be careful because other DVR systems are not shipped with a hard drive. It will not record without one but this one has a 500GB drive installed.  Upon boot up it was not formatted but a little common sense or the ability to read instructions will help you through that part of the install. For the price this system is awesome.  I love the ability to name the channels, search for video by time and date, and you can do all of this remotely as well. Overall a great purchase.***Update***About a month after purchasing this item I noticed that the time was resetting to some other time Zone.  I called support and they worked quickly to create an RMA but I had to ask several times for them to send it VIA E-mail.  After receiving the e-mail I sent the device as they suggested without the remote and power adater.  A day or so went by and a new Device was sent to me however they sent it without a hard drive.  Now I had two of every accessory but did not have my 500GB hard drive. Also my dad had packed up the Camera power supply instead of the DVR power supply so I was short a Camera power supply too. After mumerous attempts I finally got the security system back but it could have been done more efficiently. THey should have just sent a new device to me and had me pack up my device and ship it back.  Still in all it is a good device and is working fine now however a repair should not have been necessary so soon. Also since it needed service so soon they should have sent me a new one the day I called. That way there would have not been any loss of security coverage while waiting for the device to get up and running again. I also needed video from the device recently and I was able to retrieve it but I could not play it on any device in my house. I have every Windows OS at my disposal and video converters did not work either. If it was more important video I may have tried harder to get it to work but I was able to watch it on the DVR.", "Date": "September 28, 2012"}, {"Title": "Great Buy for the price", "Author": "C.C.", "ReviewID": "R2234679K8XGRT", "Overall": "5.0", "Content": "If you are looking for a simple DVR camera system, then this is it....Its very simple and easy to set up and when in doubt,c all support and they will assist you the rest of the way. The hardest part of the installation was installing the cameras themselves...Great Buy!", "Date": "December 31, 2012"}, {"Title": "fast shipping", "Author": "raymond", "ReviewID": "R1BR2DW1R33VUC", "Overall": "5.0", "Content": "product was easy to hook up and seems to work well. have not permanently installed yet but looks like it will work good cameras have good picture not hd but thats not what they claimed either. i am happy with the product and would recommend to others.", "Date": "December 15, 2012"}, {"Title": "Low quality night vision - but good price", "Author": "Heather", "ReviewID": "R18AXQBOS84ULV", "Overall": "3.0", "Content": "Night vision clarity needs some work.  These are a great price, but the image quality & clarity is less than desirable.", "Date": "January 15, 2014"}, {"Title": "Zmodo security system", "Author": "I. Bhsffo", "ReviewID": "R1OU03S15AP4Y9", "Overall": "4.0", "Content": "I wasn't sure what I was going to get when I purchased this product for my store.  I had looked at the same item in retail stores for more than double the price, and they didn't come with a hard drive.  This unit came with a 500gig HD and 4 great cameras.  Set up was easy and installation was straight forward.  I've had no problems with the system and the price was less than $180.00!  Setting up the system to view over the internet is a little confusing, but Zmodo has a website that explains in more detail.  If you are going to buy one of these systems, Amazon has the best price around, shipping was ultra fast.", "Date": "November 20, 2012"}, {"Title": "DVR", "Author": "Rommel", "ReviewID": "R2JWX2HUTBT03A", "Overall": "3.0", "Content": "muy buena atencion, las sandalias son exactas como dice la imagen, muy satisfecho por la respuesta del vendedor recomendado 100%", "Date": "December 28, 2012"}, {"Title": "I DO NOT RECOMMEND ZMODO", "Author": "Habib", "ReviewID": "R3P9J5MOK30TED", "Overall": "1.0", "Content": "On 6 November 2012 07:41, Mahmod haghiran <haghiran@gmail.com > wrote:I bought a package of SURVEILLANCE CAMERA ZMODO with 4 cameras on 15 August 2012 from Amazon, but since I received the product, 2 of the 4 cameras didn't work, immediately report and send the product to the company back.I have tried to communicate with them and I have not had a satisfactory answer.Much time has been spent (almost 3 months) since the day that I bought this product, i still do not have security of a good result.This is not nothing, have made me lose time and money on the cost of shipping by mail, and the company Zmodo is not responsible for your product. I just sent an email each week stating that RIM is in the hands of the technicians from the company and that at any time give me answer to my problem.Please, this company is very irresponsible and it is clear the theft of money that I have done. HE SAID THIS SO THAT YOU DON'T PASS, SO THAT YOU DON'T LET IT STEAL AS IT DOES TO ME.DO NOT BUY THESE CAMERAS MONITORING, OR MUCH LESS OF THIS BRAND, NOR TO ZMODO.", "Date": "November 6, 2012"}], "ProductInfo": {"Price": "$219.99", "Features": "View Video Online with No Service Fees - View your DVR's live or recorded video footage on any PC.\nLong time recording: - Base on the H.264 Compression, maximize the hard drive's recording time, as well as transfer video for viewing over the internet.\nNetwork Remote Access - Access live video footage directly from your mobile phone or PC anytime anywhere\nAdvanced Motion Detection Recording - This allows you record only when motion is detected.\n4 Professional Grade Weather Resistant  - See in the Dark with Automatic Night Vision", "Name": "Zmodo 4CH H.264 Security DVR System & 4 Outdoor Night Vision Weatherproof Cameras with 500GB HD", "ImgURL": "http://ecx.images-amazon.com/images/I/51oRho0pNZL._SY300_.jpg", "ProductID": "B00933BPRC"}}