{"Reviews": [{"Title": "Good camera -- obsolete WiFi security", "Author": "David W. Knoble", "ReviewID": "R1FIVICJ9JN3O4", "Overall": "4.0", "Content": "I have two of these cameras monitored by alarm.com (through a local security company).  The functions of the camera are simple -- HD or less picture quality.  Saved video can be 1280x800, 640x400, or 320x200.  Mine is at the middle resolution, and can have a frame rate of 1-5 per sec.  Image quality (compression) can be Highest, Standard, Reduced.  It has a 1280x600 1/4\" CMOS image sensor, f1.8 lens, with a 77 deg (horiz) x 54 deg (vert) field.  Night vision IR is specified to 6M, but mine goes much further.  Night vision, with the IR LEDs illuminating, is non-color.  The brightness, etc. may be adjusted.Network:  The camera may be hard wired to an Ethernet router, or configured for WiFi.  The other reviewer was correct -- the WPA2 password may have only alpha-numeric characters.  No commas, ampersands, etc.  That takes at least 1 star away, and might take away more for others.  I have configured a virtual access point on my router with a small network configured only for these cameras, with nothing else on this subnet.  In that way, I can provide bandwidth limiting and not permit the cameras to hog my network.  I was able to get a long random alpha-num passcode.  My bandwidth limiting is set to 20%, which does not seem to affect the camera performance.  This will be lowered gradually in the future.  The viewing of the video, however, is not available by accessing the camera.Performance is fully adequate, noting the low frame rate, but good resolution.  Note that the viewing and camera control are not from the local network, but rather from a (WAN) website to which the camera is connected via the local network.Note -- this is NOT a general consumer camera -- it requires a security company to configure it, and a separate (WAN) web site to view live, to record, and to set camera parameters.  This requires an ongoing contract with the security co.  By connecting it to a monitored security system, it can be set to record when the system is alarmed.  That said, if your security system is able to send these recorded clips to your local police, you must trust them to keep your video private when there is no alarm.  That is, to send recorded videos to your local police, the security company must be able to log into the specific portion of the web site that has your camera recordings.  You must trust them not commit an unauthorized logon.  You must also both have sufficiently strong passwords that a casual hacker doesn't view your live video.  In my case, I am able to view the history of logins to that web site, which, after the fact, tells me of any unauthorized access.  Thus, as with any video camera, there can be privacy concerns.  I believe that, with a reputable security company, those concerns may be minimized.", "Date": "January 29, 2014"}, {"Title": "Doesn't support \"special characters\" in the wireless password. Are you kidding me???", "Author": "Michael Grant", "ReviewID": "R2BA659KFG4ANJ", "Overall": "1.0", "Content": "To be fair, this device DOES function pretty much as intended. I bought it for use with my Vivint home security system. It works through alarm . com. The picture quality and resolution is pretty good, no complaints there. However, when I went to setup wifi I got an error that the camera doesn't support \"special characters\" in the wireless password. Are you kidding me? 2013? This is such a ridiculous limitation that I don't even have words to describe. This pretty much renders the wireless capabilities of this camera useless. There is no way I'll be compromising my digital security for this stupid camera, so now I have to run a Cat5 cable wherever I want this stupid thing to go.", "Date": "September 17, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B0099FHO1K"}}