{"Reviews": [{"Title": "Great for the $$", "Author": "Brandon C", "ReviewID": "R2EBPJZB7WBQHS", "Overall": "4.0", "Content": "I was very satisfied with this system. I don't believe you will find a better product in this price range for CCD Camera kit. The free Zviewer app works great so I can see my cameras at home when I'm away. Would recommend to anyone looking for home security cameras for peace of mind. Excellent for the money.The network set up is bit of rough... Average Joe will probably need to use Zmodo's interactive online tutorial for help. ([...])", "Date": "March 21, 2013"}, {"Title": "Nice camera system - but what a nightmare setting up remote viewing!", "Author": "V. Iyer", "ReviewID": "R12FK353MZ7M2I", "Overall": "4.0", "Content": "May 23, 2013:  Got the Netgear Wireless adapter and now I am able to connect this equipment wirelessly to my home internet.  This Netgear device required a little configuration (1.5 hours effort to figure it all out.)May 21, 2013:  Upgrading to a 4-star rating as I got a call back from tech support which resolved issues.  Turns out one additional parameter was not correctly set - which was not in the help video / files.Now, I can view video on my home PC, my iPhone and also get email alerts when motion is sensed.  Beautiful!The Zmodo guys now need to work on simplifying the usability of a great product.Nice package with fairly easy to follow instructions to set up the camera and DVR.  These worked with no problem.Next is where the nightmare starts.  I am a fairly technical guy and I am baffled how freakin' complicated the set up is for remote viewing (both through my home computer on the home network and through my cell phone.)  There is a new help guide on the zmodo website, but, it is still not helpful.  Few gotchas not mentioned in Zmodo's marketing or support:1.  The Zmodo DVR can only talk to your PC or Laptop if it is connected by Ethernet Cable to your DSL modem.  It can't communicate through your home wireless network (unless you buy another Netgear device they recommend!)2.  You will need to tinker with your home DSL modem firewall settings to get the Zmodo DVR to talk to your home PC / laptop.  I tried following instructions but it did not work.  Had to call my DSL provider - and am still only partially successful3.  Zmodo's instructions say you need ports 80, 9000 and 18004 open on the DSL modem.  Catch is that for my (and most) home DSL services, the carrier AT&T; will only allow opening of ALL ports or no ports.  If you want specific ports open (as Zmodo requires), you need to upgrade AT&Ts; service to Business DSL to purchase static IPs - lot more expensive!4.  So, here I am after 4 hours of experimentation and on the phone with AT&T;, still can't get it to work5.  Called Zmodo tech support and they are apparently swamped and asked me to leave a message.So, beware, this is not for the faint hearted!  If  you are content sitting in front of the DVR and watching videos, this is simple and nice.  For anything more, no idea still what it is going to take!", "Date": "May 20, 2013"}, {"Title": "Not the greatest..", "Author": "superminignome", "ReviewID": "R2RLRSLRQ1T8Y2", "Overall": "3.0", "Content": "The cameras work fine in all weather, how ever the monitor and control unit are extremely slow responding and cause frustration.I have yet to find out how to record on my dvr or live stream from my portable device that is why this gets a 3 star rating.", "Date": "December 8, 2013"}, {"Title": "Nice for the price", "Author": "anthony", "ReviewID": "R2S66B3D5G0VDD", "Overall": "4.0", "Content": "For the price you can't beat it.  The instructions are worthless.  Good news is the system is easy to setup and use.", "Date": "December 3, 2013"}, {"Title": "not that great.", "Author": "Brenda Stary", "ReviewID": "R181U0UWV9SAQD", "Overall": "3.0", "Content": "Cameras are great however we CANNOT hook up to internet and go wireless. Followed all the steps. Had a \"successfel\" message and nothing. Called for help. Cannot understand the barely english speaking person. No luck. Paid an tech to look at it. No luck.", "Date": "October 21, 2013"}, {"Title": "Zmodo", "Author": "technewb", "ReviewID": "R2G95R22VWJO7A", "Overall": "5.0", "Content": "works perfectly outside during the night and day time. wish cameras would pick up farther during the night but its good enough.", "Date": "November 14, 2013"}], "ProductInfo": {"Price": "$299.99", "Features": "Support Remote View: PC & 3G/4G Mobile\n500GB Hard Drive Installed - Supports up to 2TB HD\nBNC & VGA output\nZmodo cameras use Sony image sensor chips", "Name": "Zmodo 8CH Surveillance DVR Security Camera System with 8 Outdoor Security CCD IR Night Vision CCTV Black Cameras - 500GB HD", "ImgURL": "http://ecx.images-amazon.com/images/I/41Em2ReTE6L._SX300_.jpg", "ProductID": "B009EO49IW"}}