{"Reviews": [{"Title": "Expected More...", "Author": "Jase", "ReviewID": "R21STMW9K4OZ5O", "Overall": "3.0", "Content": "Setup was a pretty big pain. Save yourself the headache and take my word for it, You MUST use IE in order to access \"full features\", which is most of the features. I assumed there would be an iPhone app to access the live feed, there is not. You are limited to typing in the IP address via Safari.The video quality isn't fantastic, but it's not that bad IF they lighting is decent. Another annoyance is that there is no battery option, the only way to power the camera is via DC/power outlet - and the cord is not very long.The hardware feels cheap, hard plastic. The back of the unit has two slots, one labeled \"SD\" -- DO NOT attempt to put an SD Card into either slot - they do not go anywhere... I made this mistake and had to disassemble the unit in order to retrieve my memory card...So far, I have not found a way to actually record video. I have configured it to send images via e-mail when motion is detected, which is nice - but an actual video would be much better... (I'll update this if I figure out how to do it...)Overall, for the price ($99 at the time of writing, prime eligible) it's not what I had in mind, but IF I can get it to record actual video - I would probably buy another unit... For now, 3 stars because it is more peace of mind, but disappointing.", "Date": "January 2, 2013"}, {"Title": "A good choice of IP camera .", "Author": "Duong Thanh Liem", "ReviewID": "RHNCNGGJ0LARN", "Overall": "4.0", "Content": "Good image, simple interface, clear instruction, smooth operation. This will be my choice for next purchase of an IP camera.", "Date": "October 30, 2013"}, {"Title": "great so far", "Author": "loveflorida", "ReviewID": "R7G1HPXQ050WY", "Overall": "5.0", "Content": "this was super simple to set up. Almost plug and play. They work nicely with various third party application for monitoring and control via smartphone or tablet. Once you figure out port forwarding on your router you will have access to these from any internet connection.Great Camera", "Date": "September 12, 2013"}, {"Title": "No tech support", "Author": "terry j plaxton", "ReviewID": "R4VQH3HDGEB5M", "Overall": "2.0", "Content": "Tech support is nonexistent for this product.  I have tried for a week calling the two support phone numbers. Only to get a recording saying to call back in business hours –not even an auto menu. I called during business hours!! The web site for the product (Polaroid IP300B) says  \"To ensure smooth installation and operation, Polaroid IP security cameras are backed by one of the best trained customer call centers in the industry so that even the non techno-savvy consumers can finally enjoy the benefits—and savings of IP security.\" When I emailed support this is the response “We are in receipt of your e-mail request for support with your Polaroid product. A ticket #*** has been created to better serve you and provide you with the best possible solution and assistance. To serve you in the most efficient and fastest way possible, please include this [Ticket #***] in the subject line of all correspondence.”  I replied as to what to do with the number and how that would help me when I needed to talk with a human.  –no response, they fell off the earth! This may be good product but without tech support to get over a couple hurdles it’s useless.", "Date": "January 14, 2014"}, {"Title": "Good Wireless Security Camera - Recommended", "Author": "C. Hill \"CFH\"", "ReviewID": "R184M7EALG5GW", "Overall": "4.0", "Content": "This Wireless Security Camera works very well once it is in place and setup on the wireless network. We have a small business and have both wired and wireless cameras in our system. Here are my observations:Pros -+ Quality; physically quality is excellent, I dropped this from 5' and it continued to operate just fine+ Image; on the best setting, it is very crisp and clear+ Features; able to send grabs on alarm to email or FTP servers, set time of day alerts+ Range; covers most of building+ Night Vision; quite clear even is complete darkness+ Audio Support; a very nice featureCons -- Clunky Interface; a little hard to navigate but once configured it is just fineOverall, this is a very good choice for an controllable wireless security camera.Recommended!CFHNote; sample unit provided for review", "Date": "November 24, 2013"}, {"Title": "Setup and Installation", "Author": "pambeach", "ReviewID": "R2VHFYZD2RHH69", "Overall": "1.0", "Content": "I got Polaroid IP300W camera 2 day ago. I am struggling to setup and install the software since then. No luck yet. When ever I click on any option a pop up appears on screen asking for ID and Password. Even I fill it repeatedly nothing happens. So frustrating. I have not been able to see video yet.", "Date": "October 9, 2013"}, {"Title": "Working/ limitations/ setup sucks.", "Author": "DATABASE00", "ReviewID": "R2BLG9XZN6AVDB", "Overall": "3.0", "Content": "Camera works, Im a computer tech took me 3 hrs to setup camera.Only way to access not from home is to setup port forwarding and a static ip or no-Ip.com account and have service running on workstation to update a dns name to your ip address at home.Only way to record live video is leaving a computer running with application viewer running.The iphone app is here https://itunes.apple.com/us/app/polaroid-ip-cam-viewer/id626226987?mt=8still need port forwarding and static ip or dns name that is synced.No cloud linkage setup, not for average user wanting to use from outside source( work, Trips)phone support does not let the audio work.Must use an additional mic as feedback from the speaker makes the mic and speaker get feedback making it louder and louder till its impossible to talk or listen. I was using mic or speaker one at a time turning on and off to have conversation with g/f who was down stairs.Night vision is decent, movment is good.Dont expect to plug it in and access from outside of house.possible? Yes, pain to setup, directions suck. I don't think the average consumer can get this working.I new what to do before I read full instructions that do not come with unithttp://www.google.com/url?sa=t&rct;=j&q;=&esrc;=s&frm;=1&source;=web&cd;=2&cad;=rja&ved;=0CDUQFjAB&url;=http%3A%2F%2Fwww.polaroidstore.com%2Fstore%2Fimages%2Fpdf%2Fip300-polaroid-wireless-network-surveillance-camera-manual.pdf&ei;=ViRDUvuoEcWuqAGUwYGwCQ&usg;=AFQjCNGyq-4vcVCrmSZh7InqALpXHlrIog&sig2;=rU_lj5nlspwOERXZKiYnQAthey do help a little in setting it up.conclusion:worth it on sale for 59.00 but would probly not buy again for a new setup,", "Date": "September 25, 2013"}, {"Title": "For those approaching paranoia, relax with Polaroid", "Author": "Grady Harp", "ReviewID": "R3EHBYN2F38P4N", "Overall": "5.0", "Content": "With all the wild movies and television shows focusing on surveillance systems many people are feeling as though without constant surveillance of their home or office means not being informed. So, if constant camera visualization of your goods is important to you, this little device is excellent. It is based on Internet Protocol so once installed (and unlike many other who have commented here, installation is actually very simple if you have the right direction for the end product you seek) this device provides top of the line real-time audio and visual streaming, multimedia recording, image capture (be just like those agents on TV’s Person of Interest, Homeland, etc), have it connected to your alarm system, and secure over-the-air connectivity for complete access to remote control, video window and intercom system.This well designed device makes you feel safe and it is reliable – just check your area of surveillance form anywhere you happen to be and rule out snoopers or thieves or discover who is using your computer equipment etc in your absence. And remember if you need any assistance with any aspect of the device it is supported by Internet Explorer, Firefox, Safari, Google Chrome and all other popular browsers and mobile devices. What price peace of mind? Not very high in this affordable instance! Grady Harp, November 13", "Date": "November 21, 2013"}, {"Title": "Don't buy it", "Author": "Larry Crowder", "ReviewID": "R10WVFG91K3ZJI", "Overall": "1.0", "Content": "It worked for 3 days and then stopped working what a piece of work. I also bought 2 IP200's one of those work for a week and stopped working, so far I have 1 of the original 3 that is still working, but for how long is any bodies guess.", "Date": "May 5, 2013"}], "ProductInfo": {"Price": "$169.99", "Features": "Incredible 320° digital panning; 120° tilt\nTwo-way audio intercom fully integrated\nPatrol Mode and email alerts with snapshot\nInfrared sensor with auto dusk/dawn on/off\nRemote access over the Internet or Polaroid apps", "Name": "Polaroid IP300W Wireless Network Surveillance Indoor IP Camera with Remote Control Pan/Tilt, Audio/Video Recording & IR Cut Filter - White", "ImgURL": "http://ecx.images-amazon.com/images/I/31YmAgjMeUL._SY300_.jpg", "ProductID": "B009AY07DM"}}