{"Reviews": [{"Title": "Great price for a surveillance system, but the cameras are the worst I've used", "Author": "MarioV73", "ReviewID": "R24ONBAF8HEX94", "Overall": "2.0", "Content": "Although the price of around $230 is great for a nearly complete 8-channel surveillance system, one which only lacks a hard drive, the cameras included in this package are the worst I've used or seen in action. The cameras are claimed to be CCD, but if they are, the video captured through those CCD's is worse than through my 10 year old cheapo CMOS's. I only compared capturing video during daylight and indoors, yet I had problem recognizing my own son who was less than 10 feet from the camera. The main problem with these cameras is the extreme pixelation in the videos. I understand that pixelation may be observed when colors change from one object to another, but it is inexcusable to see pixelation over a large area with uniform color. How is that possible, you ask? Well, these cameras can't generate a pixel with uniform color throughout the entire pixel, and while one side of the pixel is one shade of a color, the other side is of different shade. This causes a grid-like pattern on large areas of the same color. Another issue I observed with these cameras was that my black couch had a yellowish outline. There is something obviously wrong with these cameras' pixels, and when it comes to capturing a crime on one's surveillance system, these cameras are not up to the task.Since I already have a recorder, I did not bother testing the one in this package. I left it in its bag and sent the complete system back. Too bad, because I was excited to replace my old CMOS cameras with these and use the DVR as a backup recorder. I guess I'll need to spend a bit more for a more competent system.BTW, I notice the remote control and the mouse included in this package differed from the ones pictured. Although the remote in the picture seemed basic and cheap, unbelievably the included remote was even cheaper. The mouse seemed of the same caliber as the one pictured.", "Date": "January 27, 2013"}, {"Title": "Camera show appear to be less quality CMOS not listed CCD,", "Author": "johnglot", "ReviewID": "R10K6YLBEIZBW4", "Overall": "2.0", "Content": "Camera show appear to be less quality CMOS not listed CCD, have asked but no response as of date.Big difference", "Date": "January 19, 2013"}], "ProductInfo": {"Price": "$229.99", "Features": "Support Remote View: PC & 3G/4G Mobile\nNo Hard Drive is Installed - Supports up to 2TB HD\nBNC & VGA output", "Name": "Zmodo 8CH H.264 DVR Security Surveillance Camera System with 8 Sony CCD CCTV IR Security Black Cameras - No Hard Drive", "ImgURL": "http://ecx.images-amazon.com/images/I/51gCbx3XRjL._SY300_.jpg", "ProductID": "B009EOFX2I"}}