{"Reviews": [{"Title": "Easy setup and great features", "Author": "Nick L", "ReviewID": "R9BIAE4Z1MTTN", "Overall": "4.0", "Content": "This system sets up easy and has fantastic camera battery life. I get over 18 months on a set of batteries. I also like the low cost of monitoring with extra features. I get emails when there's motion at my front door and a link to the video clip. I always know as soon as there's a delivery from UPS and FedEx. I also enjoy how easy wireless updates on camera and base station firmware done wirelessly without touching the cameras. }", "Date": "January 14, 2014"}, {"Title": "Customer Service", "Author": "Daniel", "ReviewID": "RC2QP1IA3EKUW", "Overall": "4.0", "Content": "The customer service is based in India which need serious improvement. After many attempts, I have received a call from their US based tech support and the issuses were resolved within a few minutes.", "Date": "January 9, 2014"}, {"Title": "I will have a total of 15 of these cameras when the last one arrives next week. Thats the limit for the system. I like them.", "Author": "John Faircloth", "ReviewID": "R224A09JYDN2U4", "Overall": "5.0", "Content": "I guess that with this many cameras in use it goes without saying that it like them. I live on a farm and have some of them several hundred feet from my base stations, most of the time I get a full signal from that far out. They are functioning down to at least -10 F, it is suppost to be even colder tonight. I have found that non rechargeable Lithiun batteries don't last very long in cold weather but The Terergy green/silver rechargables seem to work very well. I have had the 1st set of batteries I tried, in for about 6 weeks and they are still showing green \"good\" on the charge indicator. I only have 1 camera that is non motion detecting typeand it does not work as well as the other two kinds. The android smart phone aap still seem to have some bugs in it, turning motion on//off with it doesen't seem to work all of the time, and trying to delete a recording will hang my phone up.", "Date": "December 29, 2013"}, {"Title": "About time", "Author": "David Hoffman", "ReviewID": "R2CU3O4PW8SLHD", "Overall": "5.0", "Content": "About time a product does everything it says it will and morel. Very simple setup. A great little system.Would recommend this product,,,", "Date": "December 20, 2013"}, {"Title": "Easy Install", "Author": "William Daily", "ReviewID": "RTG1X7L6OX9YT", "Overall": "4.0", "Content": "I have had these Cameras for almost a year, batteries are still going, the cameras work good. I have them set for motion right now and they capture just about everything. They do miss some things once in a while, that is why I could not rate them with five stars. Good product overall.", "Date": "December 18, 2013"}, {"Title": "Excellent product", "Author": "Juan Estrada \"Juane\"", "ReviewID": "R3IG2MBVNRZRK6", "Overall": "5.0", "Content": "I am very pleased with the entire set up. It is very simple and yet it's functionality is as good as other expensive systems. It is very easy to install. Remote access with my iPhone/iPad is very reliable.. I highly recommend it", "Date": "December 18, 2013"}, {"Title": "Great Home video monitoring system", "Author": "MJM", "ReviewID": "RJCW726Y4RDMG", "Overall": "5.0", "Content": "I've owned other camera systems with a dedicated DVR that allowed viewing on my phone. This product is far easier, cheaper and flexible.", "Date": "November 24, 2013"}, {"Title": "Awesome!", "Author": "John Dannunzio", "ReviewID": "R3SBPO9RUGIHQN", "Overall": "5.0", "Content": "These cameras were setup in my home within 1 hour. The very first day we used them we caught our babysitter not doing what she was supposed to. Sitting there watching her phone while our son just occupied himself. That alone is worth the money. They are the cheapest and best option for economically watching your home or loved ones. I would highly recommend them! Hide them wherever you can without wires...what could be better.", "Date": "November 22, 2013"}, {"Title": "Effortless Security!", "Author": "J Tapp", "ReviewID": "R1JZGD1L61APB2", "Overall": "5.0", "Content": "I have had my Vuezone system for almost 2 years and have been very satisfied.I started with 2 cameras and I now have 5.  They enable me to easily monitor my apartment from my iPhone instantly 24/7...except in low light conditions.I definatley recommend getting at least one of the new Night Vision Cameras so that you can \"See\" even in the dark!", "Date": "November 14, 2013"}, {"Title": "Love it.", "Author": "Jeff Kozol", "ReviewID": "R2JENM13JMZSG7", "Overall": "4.0", "Content": "I'm a big fan of the system.  The main thing to keep in mind is that you shouldn't watch more than a couple of minutes a day or you willl eat the camera battery.  Motion detection is excellent.  The night camera in conjunction with the I/R Lamp works great.  Plus you can view it from anywear.  I like that it sends emails to any address you want if you set it for motion detection.", "Date": "October 25, 2013"}, {"Title": "Good camera system for the price", "Author": "Paul", "ReviewID": "R11EAI0IKIU0ED", "Overall": "3.0", "Content": "This system is good for the price.  I've been able to use them as I wanted too.Pros:Good PriceEasy to installAble to adjust the angle of the camera on the mountCons:Camera picture isn't that great. Even when you zoom the picture is fuzzyOnline storage is limited for recording unless you pay a steep priceNo night vision unless you buy a separate IR light which has to be plugged in. This adds a wire into a wireless system.Again solid system, I would buy it agin because of the price.", "Date": "May 14, 2014"}, {"Title": "Problems getting product support", "Author": "German Girl", "ReviewID": "R2L7ZS01ID9KN8", "Overall": "2.0", "Content": "Had problems with registration process and getting tech support. Spent a long time on hold over several days, first rep did not resolve issue, finally second  rep resolved it after a long time on hold. Not happy... Wish they had provided info on browser issues beforehand. Don't have time to spend hours on hold.", "Date": "May 13, 2014"}, {"Title": "The are just ok.", "Author": "Antonio L. Patton", "ReviewID": "R11GU950GS74PD", "Overall": "2.0", "Content": "I needed some cams to keep an eye on my condo so I thought these would be perfect, however they are best viewed live. The cam is not motion sensitive through a window and I cannot mount the cam outside so it's just ok. The motion sensor snaps a series of pics and it's very burry at best.", "Date": "May 13, 2014"}, {"Title": "Barnyard Brother", "Author": "Kathy Gates", "ReviewID": "R1G8QAE5VST69P", "Overall": "4.0", "Content": "I use the cams to monitor my donkeys & horses.easy to install and works great. No wires or cables to mess with.", "Date": "May 9, 2014"}, {"Title": "Great cameras", "Author": "Wayne Thomas", "ReviewID": "R1YRNGEQX4PBVZ", "Overall": "4.0", "Content": "I needed a camera that was easy to connect without wires that I could keep an eye on my 99 year old Mother as she was prone to falling.  I tried the NetGear camera and was impressed with it I purchased two more units to put on other properties I have.  So far they work great. I have had them about 3 months and the batteries are still fully charged.  I love the fact that there are no wires showing and you can place them anywhere.", "Date": "May 7, 2014"}, {"Title": "Excellent product for the price", "Author": "Alvin Davis", "ReviewID": "R23211U98RYQP1", "Overall": "4.0", "Content": "No objections to the system.  I purchased a separate camera from Netgear so I have three locations now.I would have given it five stars if it was a rotating type camera rather then viewing in one location.All in all, very satisfied.A. Davis", "Date": "May 6, 2014"}, {"Title": "Good with limitations", "Author": "L. M. Crane", "ReviewID": "RHZR8QQEP93Q4", "Overall": "4.0", "Content": "I like this system, but please read the specifications and other owner comments carefully so you know what you're getting.Prices vary, as even Amazon had this same base station and two daytime camera deal for a much better price recently.  Bought mine at Costco when it went on sale for $140 for the package of base and 2 cameras, including a free year of Elite monitoring storage.This is a wireless system, with the base plugging into your router.  Set-up of base and cameras was easy.  Since cameras are wireless, there are no wires to link, just stick them up wherever you want.  This allows tremendous flexibility in placement  Communication by browser or app (phone, iPad) easily established, allowing real time viewing through camera.  Each camera can be set individually to sense motion and then record either still or video images of your choice of quality and speed.  I enable the cameras when I leave the house using my smartphone.  If they detect motion, an email will be sent to you (you name each camera, so you will know which detected the motion).High def still images take time to record and will be blurred, so by trial and error, I found that using the video images provided more recognizable photos of anyone tripping the camera.  These are saved on-line and are retrievable if the police require them at a later time.  The motion sensors worked well for me, but need to be positioned just right so as not to be triggered by pets walking into the view zone (which has limited adjustment).  The video/still image quality is only adequate, but you can buy higher definition security camera systems if you want to pay a much higher price.  These higher definition systems all require hard wiring (easy to do if you have raised ceilings in a business, but difficult at home).Please note that these are available light (daytime) cameras.  If you wish coverage for dark areas, then you will need to purchase the night vision cameras which come with their own infrared light source (the source needs to be plugged into an outlet).  If you will be placing the camera in an unprotected outdoor location, you will need to invest in a weather cover.Note that these cameras don't fit in with your existing security system, but will run parallel to it.  That's fine with me and saves considerable money.  My existing security has portal, motion, and heat detectors that will trigger a monitored alarm and call authorities.  The NetGear wireless system just allows me to monitor the house and provide image identification for the police later.  The monitoring company does not have access to my video feeds for privacy.Because I looked for these items on sale, my overall outlay for the base, two daytime and two night vision cameras came to just over $300, far cheaper than any competing system and performs adequately for my needs.  If your needs are different, then consider the more expensive systems with expensive live monitoring.", "Date": "May 3, 2014"}, {"Title": "Simple and easy surveillance system", "Author": "chris moorhead", "ReviewID": "R2R0BX2ZDCR0S7", "Overall": "4.0", "Content": "Simple and easy to install.  Good Wifi range.  I would recommend this to anyone looking for an easy-to-use system. Inexpensive for what you get.", "Date": "April 30, 2014"}, {"Title": "Best product ever for very specific use", "Author": "David", "ReviewID": "R19SIOQJNS0AFS", "Overall": "3.0", "Content": "It can't pretend to replace even simple monitoring system - any wired or IP cameras always will be better solution as long as you can apply them.But there are needs - where are no better solutions. I needed any kind of monitoring for my storage space. There is no power unless lights are on and I'm not allowed to add any electrical line there.This is only one solution existing on the market possible to be applied for me. One thing to remember - don't trust distance provided in product description. With two concrete walls between, base unit needs to be no farer than 60 ft from camera.", "Date": "April 11, 2014"}, {"Title": "Cameras and pictures are okay not the best", "Author": "James Watkins", "ReviewID": "R3VFIV0MRY10CW", "Overall": "4.0", "Content": "For the money I guess these cameras are okay. I have had them for almost a year now. Once a month they seem to loose the connection to the base station and it takes a few times of turning them off unplugging the base station and resetting all the items for it to connect together again. The pictures it sends to the cloud are not that excellent, most are usually blury so I think they need to work on the picture quality a lot more.", "Date": "April 5, 2014"}, {"Title": "Easy and reliable.", "Author": "evk1916", "ReviewID": "RE24FUG3EBKR9", "Overall": "5.0", "Content": "Reliable and easy to set up and use. Very pleased. Have another higher resolution camera that is out of commission half the time due to internet complexities.", "Date": "April 2, 2014"}, {"Title": "Great Solution", "Author": "jkca1", "ReviewID": "R32607LJDQEIP2", "Overall": "5.0", "Content": "I was skeptical but purchased the base system and 2 cameras. Setup was very easy. The quality of the pictures is good. We were so pleased with the system we purchased 3 more cameras and upgraded our monitoring package. If you are looking for a easy to use well designed system this is it.", "Date": "March 25, 2014"}, {"Title": "convenient", "Author": "etofbaok", "ReviewID": "RLJQD2RNVPRW7", "Overall": "3.0", "Content": "Like the camera, wish it had audio. like that it can be moved to monitor a different area. Batteries last a long time if not using motion activated.", "Date": "March 17, 2014"}, {"Title": "Good and Inexpensive System", "Author": "Cazamatic \"Caz\"", "ReviewID": "R1ZV2QZL0XZ7G8", "Overall": "4.0", "Content": "I've had my system since August 2011 and it has been working fine however, I had an issue where my motion camera was not \"seen\" by the gateway.  I put new Rayovac batteries in it and within 1.5 months I got a weak battery read.  Although my battery tester showed the batteries as good, the camera wasn't buying it.  Long story short Netgear support jumped in to help well after my warranty period and worked with me.  Bottom line, make sure you get a good quality battery in there like Energizer or Duracell.  That was the problem.  Netgear's support and concern is 5 star.", "Date": "March 17, 2014"}, {"Title": "Grat", "Author": "mom217", "ReviewID": "R2T9EFSEJF65H3", "Overall": "5.0", "Content": "Great great great great excellent excellent many many times good good goods can't say enough about the product very good", "Date": "March 10, 2014"}, {"Title": "VueZone", "Author": "Jim C So Cal \"Go Kings\"", "ReviewID": "RGCGFHP9UXS97", "Overall": "5.0", "Content": "I was a little skeptical about the system since I have a higher end security cameras already installed in my residence. Using the portability of the VueZone cameras is incredible. I can move them to exactly where I need them. Looking to purchase a couple more cameras in the future so I can cover even more area.", "Date": "February 28, 2014"}, {"Title": "Vuezone", "Author": "aailaw", "ReviewID": "RCWA9V7GR7GE7", "Overall": "4.0", "Content": "Very easy to install and connect to the internet. Takes picture and sends it to you via email if any motion is dedected. Overall good product. I probably will add more cameras.", "Date": "February 17, 2014"}, {"Title": "wonderful", "Author": "Jody Milburn", "ReviewID": "R3O1JNBON846UR", "Overall": "5.0", "Content": "Easy setup,easy access,nice picture, and best of all the battery life is unreal. I've gone as long as 3 mo before I needed to replace them. Good thing as they are expensive batteries. Can't wait to get more cameras.", "Date": "February 9, 2014"}, {"Title": "Cameras", "Author": "amy gorback hull", "ReviewID": "R2LM56KHPFWGC", "Overall": "5.0", "Content": "Works really well. The cameras were very easy to install. The images are very clear, with easy access to login.", "Date": "January 29, 2014"}, {"Title": "Better than I expected", "Author": "Holden", "ReviewID": "R14LKKY3N8422D", "Overall": "4.0", "Content": "I have one aimed at my front door and one aimed at my back door.  Both are outside but under the porch, so protected from weather.  Set up was pretty easy.  Both are set up for motion detection.  The video is fuzzy at times due to lighting or speed of movement, but I'm satisfied.", "Date": "January 26, 2014"}, {"Title": "It just works.", "Author": "cccdavi01", "ReviewID": "R39IHZUOU5S8L6", "Overall": "5.0", "Content": "Complaints abound...There is lag between an alert and the image capture.THIS SHOULD BE EXPECTED.The unit takes a few seconds to warm up and capture an image.  It works for my use case.  Don't expect HD images or video, and you shouldn't because that isn't and advertised feature, and you will be happy.", "Date": "January 24, 2014"}, {"Title": "Best part is ease of setup and use", "Author": "Mr. Ellery H. Kurtz \"Art Appraiser\"", "ReviewID": "R1IONL3RDH7NK6", "Overall": "3.0", "Content": "This is an easy system to set up and just as easy to use.  It was up and running within 15 minutes of opening the box.The image quality is better on an iPad and/or iPhone than it is on a pc laptop screen, but it is acceptable.The one big con of this system is that the batteries will not provide a 24/7 monitoring system.  In the company's website under the FAQ section it states:\"A new battery should last 6 months with normal usage. Normal usage is defined as 5 minutes of viewing or recording a day. Depending on your specific usage battery life can vary widely. The VueZone personal video network is not intended to capture video 24/7 for later review. The cameras only operate when you are looking at them, or if you have a schedule video recording running. VueZone is meant to quickly check in on what's most important to you when you are not there!\"So you will need to remember to stop the camera and log out when you are done viewing your home/pet/child, etc.", "Date": "January 22, 2014"}, {"Title": "Good", "Author": "Bill", "ReviewID": "R3LELSXWMF7VEZ", "Overall": "5.0", "Content": "Works better then I expected. Great product, easy to set up just minutes, no voice just video, money spend wisely", "Date": "January 20, 2014"}, {"Title": "Excellent product for the price", "Author": "Lrritchie", "ReviewID": "R37F5ENLKAO753", "Overall": "5.0", "Content": "This is a great product and simple to use. Keep in mind that this is not a 24 security system that records constantly, but with the motion detection cameras it does not have to be. It took me all of fifteen minutes to get everything out of the box and have the entire setup complete with cameras installed and sending me email alerts if one of them detected motion. The pictures are quite clear and the infrared exceeded my expectations after reading some reviews. I am very happy with the quality of the product and may even purchase a few more of the cameras and cover other areas of the house. I use the monitoring app on my Android phone, Ipad and the website from a computer and could not be happier with any of them.", "Date": "January 15, 2014"}, {"Title": "Versatile and indepenent of any other service.", "Author": "JB", "ReviewID": "R1CB0D634XUCV7", "Overall": "4.0", "Content": "The picture/video quality is good. I have five cameras.  I can engaged or disengage any one remotely - form my phone of computer.  Timers can be set for a specific time as well.  I can put the cameras anywhere I want and set for time, quality, lighting.  I can monitor from the office or another state when traveling.  I am not dependent on a contract with my TV/internet provider so if i choose to change providers, it does not affect my system.  I have recommended them to others.", "Date": "January 9, 2014"}, {"Title": "Does what I wanted", "Author": "Allen L. Herman \"Big Al MD\"", "ReviewID": "R1QYQI50S1QX91", "Overall": "4.0", "Content": "I bought this to use as a fundamental net cam to use on my grandson's model trains.  Transmit/receive and picture quality is very good.  Battery life is short not making for a very good security device.  Remote cameras need long term power", "Date": "January 4, 2014"}, {"Title": "Home security and record family fun time", "Author": "mack gray", "ReviewID": "R13JRID1W97URS", "Overall": "5.0", "Content": "This is a good product to record fun with friends, family and at the same time have some security for you family and home.", "Date": "January 1, 2014"}, {"Title": "Excellent Product without the Hassel of Wires!!", "Author": "Gregory Daniels", "ReviewID": "R26GHO80ISW0Y8", "Overall": "5.0", "Content": "This is exactly what I was looking for a true wireless system.  Although I wished that the cameras had built in infrared night vision that were truly wireless. That is the downsize of the the night vision but the way around it is to leave the light on.  lol.  Overall I am pleased with this product and would highly recommend it for anyone wanting to monitor their home or office remotely.  The inital setup was super easy!!", "Date": "January 1, 2014"}, {"Title": "eye in the sky", "Author": "TIFFINEE", "ReviewID": "R3LQ22S22UK218", "Overall": "5.0", "Content": "awesome product. great for when you are not at home. A must for working ppl ,with loved ones at home", "Date": "December 30, 2013"}, {"Title": "NETGEAR VueZone Two Camera System", "Author": "guiang", "ReviewID": "R3442ZJJXJU3S3", "Overall": "5.0", "Content": "Purchased early Dec' 2013 and I have the model 2800.  I have to say this is one of the best security monitoring system your money can buy.  It's easy to setup, no wires needed (well accept for the base station and night vision light).  Just setup the base station via website vuezone.com and pop the batteries then sync the cameras and your good to go (you may have to update the firmware of the cameras via website).  The video quality and features of the camera is good for the price your paying.  Yet, gives me peace of mind when I'm out and about and be able to watch from anywhere in the world (as long you have wireless service or Wi-Fi connection).  It so easy and seamless I added 5 more cameras. Although, the drawback requires you to purchase annual membership to view more than 5 cameras, up to 15 cameras (I selected the elite package $99/year via website), but I think it's still worth it.", "Date": "December 28, 2013"}, {"Title": "Affordable and Simple Home Security", "Author": "Kevin", "ReviewID": "RLLKA22LHDUJH", "Overall": "4.0", "Content": "These cameras are great!  Easy to install, small and attractive design. The software and set up was a breeze.  These are not high end commercial cameras, but rather affordable home security option for general monitoring needs.  I have two night vision and two standard view cameras.  The night vision work good.  The only challenge is the infared light that is separate and requires a power plug and placement to get the camera to function at night.  It's unfortunate this infared would not be built into the cameras themselves.  I believe you can add up to 15 cameras.  Image quality if a bit jittery, but that's understandable given it's a wireless system in my opinion.  Overall, i would rate the ease, convenience and quality of product as a 9 out of 10 and highly recommend.", "Date": "August 25, 2013"}, {"Title": "One of the purchases I have ever made", "Author": "night reader", "ReviewID": "R15G3K4FV3QK2C", "Overall": "5.0", "Content": "This system does everything they advertise it will.  Set up is easy, cost is affordable and the whole think works great.  I have had it for almost 2 years now and I have never had a problem.  I love VUEZONE!", "Date": "August 25, 2013"}, {"Title": "Peace of Mind", "Author": "Akita Fan", "ReviewID": "R3NZMRUE32WEJD", "Overall": "5.0", "Content": "These cameras provide great peace of mind.  I purchased these to keep an eye on my dogs when I travel.  I have a fantastic pet sitter, but sometimes just wanted to check on my boys to know they are doing well at home.  It is so worth it to be able to look in on them.  They do not do that well in low light and the picture is certainly not hi-def, but it still works well for the price.  I have been pleasently surprised by the battery life of the cameras.  After 3 months of use, the cameras work fine and the batteries indicate they are still at 75%.  Would definitely buy again.", "Date": "August 25, 2013"}, {"Title": "Simple and easy monitoring system with recording capabilities", "Author": "Ismael Paredes", "ReviewID": "R37JMK2AS3T1I7", "Overall": "5.0", "Content": "Easy to install, expandable, motion detection e-mail alerts, snapshots and recording.Within 3 minutes your system is up and running!", "Date": "August 25, 2013"}, {"Title": "Easy set-up", "Author": "John", "ReviewID": "RAXEFVWY6V1SI", "Overall": "5.0", "Content": "Very surprised at how simple and quick this system was to set up. Out of the box, up & running in 15 minutes including setting up my iphone.  The system is functioning as per vuezone's description. Wish all electronics were this easy to use.So far I give this product 5 Stars!", "Date": "August 21, 2013"}, {"Title": "PRETTY GOOD", "Author": "J. Wu", "ReviewID": "R9TFO3R9D5BHB", "Overall": "4.0", "Content": "Setting up these wireless & cable-less camera is so easy. There's NO cable because I don't have the experience of installing something with cables and having to find an outlet to hook it up. These run on batteries and completely wireless. If you don't have any internet, these won't work. In addition, these cameras send me instant picture/video of what's going on outside. No voice either but thats ok. Overall these are great security basic cameras. Doesn't work when its dark. I called customer service early at 7 am to help me fix something and I got a good guy helping me out!", "Date": "August 20, 2013"}, {"Title": "Fantastic Product", "Author": "PD", "ReviewID": "R1IKFNDH7MN0XB", "Overall": "5.0", "Content": "We have owned our cameras for over a year and the service you receive and the ease of use is FANTASTIC.  If you are thinking about purchasing, just go for it, you will not be disappointed. The convenience using the app and email notifications works perfect.  Camera views are clear and the live view option is great.", "Date": "August 14, 2013"}, {"Title": "vue Zone system", "Author": "bcp florida", "ReviewID": "R1UAI06L78UY87", "Overall": "4.0", "Content": "I have 4 cameras now and they all function well with good color.  Great for my needs to check on dogs and view certain areas of the home when I am gone.  Picture quality is not 1080 as I was informed from other reviews and it is not intended to do super surveillance .  But very adequate to observe house keepers and grand children. With more then 2 cameras you will need to buy a service plan I will do that after my 30 day trial period is over . Its about $ 5 per month and gives you storage when and if you need to take a picture or video.  Motion sensors work well enough to alert me or others via text  or e mail", "Date": "August 13, 2013"}, {"Title": "A good, basic home camera system", "Author": "M. Wiltse \"MWiltse\"", "ReviewID": "R1Q4PWA7TZKXV0", "Overall": "5.0", "Content": "I wanted a camera system for my condo that would provide basic camera protection, in addition to an alarm. These little cameras fit the bill exactly- easy to setup & install, most of the configuration is online. You just pair them with the base station and stick 'em to he wall. You log on to Netgear's service to view 'em from anywhere. Computer or smartphone. Pretty neat.The picture can be a little grainy from a distance (15'), so mount them near where you want them to be monitoring. the \"Night Vision Camera\" ( a 2 piece setup, a IR lamp and a separate camera) work especially well- you can place the lamp up near where it is needed, and have the camera back a ways. I'm going to install 2 exterior cameras in the optional shells and I cannot say how well that will go until I do it, but so far, I'm impressed.PROS:InexpensiveEasy to configureEasy to viewSurprisingly good color image when properly locatedNo DVR to futz withYou can view data saved from Netgear's website (easy playback, too)You can configure \"alarms\" when a camera senses aciviyCONS:Do not expect 1080p dynamic picturesKind of an odd thing for guests to see hanging from an entryway corner", "Date": "August 11, 2013"}, {"Title": "Amazing...and easy to install", "Author": "Amazon Customer", "ReviewID": "R1DNJ6XBW2K7PU", "Overall": "5.0", "Content": "I have been receiving quotes for home surveillance systems for the past few months.  All have been very expensive, require a 3 year commitment, and hard wiring installation.  I came across the VueZone Home Video Monitoring System and based on the reviews I decided to give it a try.  2 days later my new system arrived (thanks Prime).  I was very skeptical about installation but it was quite possibly one of the easiest \"technology\" set-ups that I have ever done.  It probably took 10 minutes total and that includes signing up for the 1 year service online as well as downloading the Android and iOS apps to my devices.  I ordered 2 add-on cameras and might order another 2.  Mounting is a breeze and the cameras attach by magnet which allows easy adjustment and moving around the house.Amazing product - I highly recommend!", "Date": "August 10, 2013"}, {"Title": "Best Simple Wireless Solution for Discrete Monitoring Needs", "Author": "TDC", "ReviewID": "R13GDPM48D27QW", "Overall": "5.0", "Content": "I leased a home for my family, and only six months later my landlord put the home on the market with no advance notice. I did not trust that real estate agent or the landlord would consistently notify me when entering the premises since they were aware the home was empty during the day. I hid the wireless camera in a crate on the floor, and set the motion detector to record video when someone entered the front door. The device worked perfectly. I also set up the device so that I would receive SMS text notifications whenever the camera detected movement. I accomplished this by entering my cell phone number as an email address, which most cell phone providers allow you to do. I have Verizon, and the email address looks like [10-digit phone number]@vtext.com. Excellent product for the price, highly recommended.", "Date": "August 9, 2013"}, {"Title": "Everything It Promises", "Author": "Scenic Designer", "ReviewID": "RGKEE4KS89TW3", "Overall": "5.0", "Content": "This product delivers everything it promises. I travel a lot and it gives me great peace of mind to know what going on at home.  Good quality pictures. Very easy to install.", "Date": "August 8, 2013"}, {"Title": "Senior Assist", "Author": "Spencer", "ReviewID": "R2PS25D8MTYSZL", "Overall": "5.0", "Content": "My elderly father wanted to be able to stay in his home and with net gear vuezone he has be able to do just that.  Thank you.  It has given the family piece of mind.", "Date": "August 4, 2013"}, {"Title": "Perfect for us!...but I may soon expand to Elite", "Author": "Ray", "ReviewID": "R3T5D711Q6PGJ9", "Overall": "5.0", "Content": "Love the system. Works on my iPhone. We travel a fair amount and have been able to easily view home while away. We had one alarm situation I was able to monitor from a thousand miles away. I like the new infrared cameras and will soon upgrade.", "Date": "July 30, 2013"}, {"Title": "Not bad", "Author": "Nigar", "ReviewID": "RDOR8HF5VDOG4", "Overall": "4.0", "Content": "I thought it will be totally working without wifi as it is mentioned in the description of the product, however it does need to be connected in order to operate. For those who will have a proper e- connection it will be very useful.", "Date": "July 29, 2013"}, {"Title": "My 3rd Eye...blind", "Author": "Lou", "ReviewID": "R1QG69WMIO5CJT", "Overall": "4.0", "Content": "I love my VueZone camera system. I can click into my home at anytime. It amazes me how some big name camera companies camera systems require more work to access remote viewing from your smartphone, tablet or pc. NetGear takes care of the hard work for you. Just connect the hub to your router, sync cameras & you're done! Image quality is good. Again, I've paid hundreds for dome cameras that produce the same image quality. Why pay more? I normally don't participate in surveys & sound like a product groupie, but VueZone works perfect for me. I gave this review a 4 out of 5 only because the cameras are battery operated. That is a convenience for indoor use, but if you have outdoor camera install outside your home, it's a bit of a pain to claim a ladder & change them out. This would be the ultimate system (to me) if the cameras had an option to be connected to a power source.Thanks", "Date": "July 26, 2013"}, {"Title": "Safe and secure", "Author": "jerseyjeno", "ReviewID": "R27XCYGLPF4NUJ", "Overall": "5.0", "Content": "I can view various areas of my home and property from inside my home or when I am away from home. Its nice to view your cameras when you are on vacation, or just at work or shopping.Vehicles and people on my property are caught on the video cameras, and are available to me until I remove them from my files.  I presently have 5 cameras, which cover both inside and outside the house. Installation was easy and requires no assistance.", "Date": "July 23, 2013"}, {"Title": "Works grear for my needs", "Author": "Ronald", "ReviewID": "RKKRC0SVDWJ15", "Overall": "5.0", "Content": "Good quality and easy setup. Can see my baby from anywhere on my iPhone or desk top.  Set-up in 5 minutes.", "Date": "July 23, 2013"}, {"Title": "can watch my dogs from anywhere", "Author": "cheryl lakes", "ReviewID": "R3PORKD4N2GX77", "Overall": "5.0", "Content": "I love this product because I can watch my dogs when I have to leave for a day and know that I can still see them", "Date": "July 23, 2013"}, {"Title": "Security", "Author": "Grdrod1", "ReviewID": "R2FGSO3CFB8CC", "Overall": "5.0", "Content": "I have been having trouble with a couple of my neighbors which is a shame. We live in a very nice area. Adds to my home security system. I like to be able to see the outside of my house. I would like to get one more motion camera and a night vision camera.", "Date": "July 21, 2013"}, {"Title": "Quick and Easy", "Author": "Sue", "ReviewID": "R1UN4M46JVI958", "Overall": "5.0", "Content": "NETGEAR VueZone Home Video Monitoring System  - 2 Camera KitThis was the quickest and easiest system to install and start using.  I recommend this system to anyone who wants to watch what's going on in the room or rooms where the cameras are located.  You can use it as a nanny cam, a security system or if you just want to watch your dog run around the house.  Very effective.  I absolutely recommend this system.  My soon-to-be daughter-in-law and I have already recommended this to shoppers and employees in the store and sure they are happy with the product as well.  Go for it and have fun!", "Date": "July 10, 2013"}, {"Title": "Awesome Product!", "Author": "A. Gomes", "ReviewID": "R1EBPF3MEP7JNF", "Overall": "4.0", "Content": "I really love it! I have 5 cameras now, and I use it to keep track of my dog when I'm not at home. I have a good coverage of the common areas of my home, and I intend to get even more cameras when I have kids!The batteries last a lot, the range the cameras can be used is really far! The quality of the image are really good too!I was looking for a true wireless surveillance camera, and this is the one!I just wish they had a Windows Phone and Windows 8 app, and a timer feature to the movement sensors, so that I would get an e-mail when a movement is detected, but another one only X minutes later.", "Date": "July 10, 2013"}, {"Title": "easiest camera system", "Author": "WJL", "ReviewID": "R3S9KPB36441E2", "Overall": "5.0", "Content": "easy to installworks at a distance- i have one outside in the drivewaycan get on from any computer - unlike dlink cameras that dont work on apple half the timemotion also seems to have the right program- it picks up real motion all the time", "Date": "July 10, 2013"}, {"Title": "home monitoring finally simplified and wireless", "Author": "Charlie Brown \"CB\"", "ReviewID": "R2NLIXD2N0KW0H", "Overall": "5.0", "Content": "Easy to install, set up, move from room to room, log in and check, etc.  Very straightforward.  The one change I would make would be to get a text message when the system detects motion in a room where I know there shouldn't be any, instead of having to log in and check email frequently for activity.  That would make the alerts much more valuable and \"real-time\" - motion detection notifications would go straight to my cell-phone instead of my email.  Otherwise a very handy reasonably priced system.", "Date": "July 9, 2013"}, {"Title": "NetGear VueZone Home Video Monitoring System", "Author": "chatovue", "ReviewID": "R2T5KKFJI8GIV", "Overall": "5.0", "Content": "I can monitor activities at my house at any time of the day. It works very well for me. I would recommend this system to all who want to keep an eye at their houses when they are away. It takes picture with built in  motion sensors. I just love having VueZone Two camera at my house and I am glad I chose Netgear.", "Date": "July 9, 2013"}, {"Title": "Great product", "Author": "Mike C.", "ReviewID": "R1H8LCRE2LPYXF", "Overall": "4.0", "Content": "Great product for the price. Love that i can access from anywhere. I have the app on my iPhone.ipad, iPod and my wifes android phone.", "Date": "July 9, 2013"}, {"Title": "You have to have one of these..", "Author": "golfteam8 \"golfteam8\"", "ReviewID": "R1NNJ7ISOVKUK5", "Overall": "5.0", "Content": "We LOVE our new Vuzone system.  It was SUPER easy to install.  We had to delay our installation until we got U-Verse installed.  We were accessing the internet via a broadband modem and the Vuzone requires an actual ethernet connect to work.  The App for the phone is very slick, you can view the cameras from anywhere simply by logging onto the App.  Photo quality is excellent.  The camera can either take a snap shot, video, or just view real time.  Just installed so I will send an update after we have played with them awhile, but as of now, it couldn't have been easier and we love them.  Already want to add an additional camera!", "Date": "June 27, 2013"}, {"Title": "Exactly what I was looking for.", "Author": "ddvan001", "ReviewID": "R3GK0XEVX8A3U1", "Overall": "5.0", "Content": "I did some research about various brands but actually found this system when I went to the store to buy another system. It was easy to set up and worked as soon as I turned it on. In fact, I went back and bought two more cameras.", "Date": "June 27, 2013"}, {"Title": "Great product, no wires on cameras", "Author": "sandradee", "ReviewID": "R3ANSOMW2RG8BL", "Overall": "5.0", "Content": "This is a truly wireless product (except for the night vision light). Easy to connect and easy to install straight out of the box. The picture resolution could be better, but for wireless, is a great system. Overall I have had a great experience with the VueZone system.", "Date": "June 27, 2013"}, {"Title": "Security made easy!", "Author": "Grillhappy", "ReviewID": "R2KI3JLIFVUMH0", "Overall": "5.0", "Content": "I purchased nine cameras for the inside of my home.  Setup was so easy and the monitoring info is online, so if an intruder steals my computer, they're toast anyway.  I'm very happy with this setup.  I wish though, that I could find IP wireless outdoor surveillance cameras that tie into this system.  The VueZone cameras can go outside, with the weather jackets they make to go around the cameras, but I really would like cameras that are specifically dedicated for outside, with night vision.  VueZone has a night vision camera, but it needs to be paired up with a separate infrared light.  I have this camera and light inside my dining room, but I would like my four future outdoor IP wireless surveillance  cameras to all have built in IR lights. Other than that, I'm more than pleased with these small cameras.  They work for me!", "Date": "June 26, 2013"}, {"Title": "Simple and Portable", "Author": "Stephen G. Southerland", "ReviewID": "R2MB02RGDOOD7M", "Overall": "5.0", "Content": "I wish I had this system the 8 years I was in Iraq and Afghanistan! Extremely easy to complete the foolproof setup. Wireless and night camera capability is outstanding. The camera base is ingenious and so simple to adjust. I have four cameras now and plan to double that number. I could  have used this for security in Afghanistan and it would fit right in my hand carry bag. The price is reasonable and the expandability outstanding.", "Date": "June 26, 2013"}, {"Title": "Fun when gone", "Author": "blkmamba", "ReviewID": "R2TLC719KVH5JQ", "Overall": "5.0", "Content": "I bought this unit and added 2 more cameras--I do a lot of traveling so is fun to check-up on what my cats are doing. Very easy to set up and have shown this to friends on my I-pad and phone and know that a few want to get this to do the same thing.", "Date": "June 26, 2013"}, {"Title": "Easy Setup and Great Viewing", "Author": "toriski8", "ReviewID": "RIHBHUQ12R8IK", "Overall": "5.0", "Content": "My cat had recently become ill and I was concerned about how he was doing while I was gone at work all day.  Setup took me 20 minutes - it was so easy!  I've done things before that were supposed to be \"easy\" but this truly was!  I now log in whenever I please and have live viewing, as well as recorded video of motion detected scenes from earlier in the day.  I LOVE IT!  Love the zoom feature and the exposure settings.  Great price for the value and sense of security.  Thank you NetGear!  PS - Cat is fine!", "Date": "June 20, 2013"}, {"Title": "Nice product, but image quality is only OK!", "Author": "José Eduardo Temporão", "ReviewID": "RHW8DPV7QVLXU", "Overall": "4.0", "Content": "I set up the system in about 4 minutes. Very very easy.The cams are very small and good looking. The supports are genious!But, the cons:- Image is only OK and passable.- The app for iPhone is not good, the image is stuck.Overall, if you want something only to check your dog, kid, closet or garage is good!For home security, invest in something more expensive.", "Date": "June 20, 2013"}, {"Title": "Good Camera System", "Author": "whowantstoknow", "ReviewID": "R2CR5M0QMHWW3H", "Overall": "4.0", "Content": "I currently own the 2 motion camera system and have had it for several years. This is a good totally wireless system and works best in areas that have a lot of light. Cameras are not very effective in dim lighting but give excellent results in areas that are well lit. Have not tried the IR camera that has recently been made available. Battery life in the cameras is totally awsome and I do recommend using Tenergy rechargables because they hold a good charge and fit well in the cameras. My upgrade on the monitoring has expired but I will renew it because of the features for alerts and video capabilities.", "Date": "June 20, 2013"}, {"Title": "LOVE IT!!! NO WIRES!!!", "Author": "TRACY", "ReviewID": "R211IK9EQ1G0SP", "Overall": "5.0", "Content": "I HAVE A SLOW SMART PHONE AND IT WORKS GREAT ON IT! NO WIRES IS WHAT I HAVE BEEN LOOKING FOR AND I HAVE FOUND IT IN THIS SYSTEM! I WILL BUY MORE CAMERAS AND SEE ALL THAT IS GOING ON WHEN I AM AWAY! I LOVE IT!!! A+++ SUPER EAZY INSTALL 10 MIN TOPS!", "Date": "June 19, 2013"}, {"Title": "VueZone", "Author": "Cynthia", "ReviewID": "R3GHKKR3D687FM", "Overall": "5.0", "Content": "Definitely worth the money.  Gives you peace of mind.  Can use any smartphone to check the cameras or even your iPad.  Great product.", "Date": "June 19, 2013"}, {"Title": "Simple and helpful", "Author": "T. Brennan \"Tim\"", "ReviewID": "RTUM7CSQ2NR7R", "Overall": "5.0", "Content": "This is not a high definition system where you see everything - like on some cop TV show. It's perfect for what it is. I like that the cameras are easy to move around, so I can change my monitoring patterns. I now have three properties and will upgrade the service to look at all three - and record movements - once I finish installing the third unit.", "Date": "June 18, 2013"}, {"Title": "good deal", "Author": "oPaulo", "ReviewID": "R3S4ZGWVACIHX1", "Overall": "4.0", "Content": "Good cameras, easy to install and the service plan is cheap.We bought the 2 cam set, and were so pleased that we bought 2 more cameras for the first unit and bought a second 2-cam unit for my workplace.", "Date": "June 17, 2013"}, {"Title": "Dog & Cat Cam", "Author": "Kat's Book Nook LLC", "ReviewID": "R84M5S7XFJE8J", "Overall": "5.0", "Content": "I have 4 motion cameras and 1 standard camera.These are wonderful!I am able to place them where I need them to monitor who is doing what, when, and where - as far as the dogs & cats are concerned.I have also positioned them to monitor contractor work areas & access doors during times workers are at the house and I cannot be present.Peace of mind.", "Date": "June 17, 2013"}, {"Title": "Excellent & Easy to Implement", "Author": "Chas", "ReviewID": "R37VYU7S8CCST9", "Overall": "5.0", "Content": "One of my favorite technology additions to my home network.  Provide great peace of mind when travelling, and iPhone/iPad/Windows apps work seamlessly.", "Date": "May 26, 2013"}, {"Title": "Great design, but DOA - a glitchy paperweight at best.  Iffy support to boot", "Author": "Colorado \"CO\"", "ReviewID": "RHR9NJI9W2PJD", "Overall": "2.0", "Content": "Nifty looking little things, very clever design, love the magnetic mounts, the battery-powered cameras - opening up the box it looked like just what I wanted.These cameras are so small & light - really could put them anywhere.  I was stoked to see it in action.Instructions followed, base station connected, lights are blinking properly, wants a firmware upgrade - can't view the cameras until it upgrades. OK, whatever, upgrade - oops! can't upgrade until you log out, fine, whatever, log out.  Won't upgrade while you're logged out - what the??  log back in, still won't upgrade...  forget this - I'm calling support.What? No free phone support (fees for phone-based support start at $39.99? thanks netgear), and \"chat with support live\" was useless.  10-minute wait for instant chat?  Looks like I'm not the only one struggling with this.  Well, back in the box you go.  The era of devoting hours to tech support for malfunctioning consumer electronics is over.  I need it to work right out of the box.I dug around on Amazon for a week, looking at every wi-fi cam in my price range that doesn't require a Phd to install - I bought the Netgear system and two dropcams.An hour after it arrives, the Netgear is ready to go back to Amazon.10 minutes after that, both dropcams are up & running - no problems, super easy.The VueZone would be awesome - very awesome - if it worked.  Great idea, great design - just a shame the software was DOA & support was nonexistent.UPDATE:  Netgear support DOES exist - in fact, a very, very nice tech called me the day after I sent the system back.  So, they do have nice support people, they do have phone support.  My bad -well, not really.If netgear wishes to avoid confusion in the future, they really should dump the front-page ad that says \"Need tech support - Options starting at $39.99\".  The phone call was appreciated, but bottom the line was VueZone vs. Dropcam - and we have a clear winner.If a 100% wireless camera is key for you - and you have a little time on your hands, this system might work for you.  Best of luck.", "Date": "May 21, 2013"}, {"Title": "Wonderful product! Get one or two now!", "Author": "1skigal", "ReviewID": "R34WF5BXDIVFG9", "Overall": "5.0", "Content": "These cameras are so very easy to set up and to use! The motion detection camera is awesome. It alerts you when it senses motion and then you can view the activity on your computer or smart phone. So reassuring when away from home. I know when a package has been delivered so I can ask a neighbor to pick it up for me, rather than letting it sit on the porch until I return home. I use 2 motion detection cameras and they work seamlessly!", "Date": "May 21, 2013"}, {"Title": "security system", "Author": "Keith 746", "ReviewID": "R22POL5XT15UOM", "Overall": "5.0", "Content": "Though this system was developed for monitoring, My wife and I selected it to use for security purposes.  This was attractive because of the ease of installation (no wiring) and the email notification of motion detection.  We have already received plaudits from police for calling them when an unknown person was seen by us remotely at two different doors.  Since our purchase, Netgear has enhanced the security application of the system.", "Date": "May 21, 2013"}, {"Title": "Mother Knows Best!!!", "Author": "Lanie", "ReviewID": "R38XQNJRIYXR27", "Overall": "5.0", "Content": "I have a mother who is approaching her 95 birthday..  I am lost without my vuezone as the company well knows.. I had a lot of difficulty the first year of owning it. the camera was lost several times and software wasn't working correctly.. I feel that without this system I cannot keep an eye on mom who is legally blind but fights to keep her independance.  The next best thing for me is checking in on her while she is watching tv, or going into her bedroom and bath. Without taking away her privacy or independance I can see what I need to see and know with a restful mind... she is okay!!", "Date": "May 20, 2013"}, {"Title": "Great low cost solution.", "Author": "Mike", "ReviewID": "R12QXMKL56WTIT", "Overall": "5.0", "Content": "We have been using VueZone for over a year with two systems, one at home and one at our business.  We have both outside and inside cameras that give us the piece of mind to \"check on things\".  They are very reliable and cost effective solution for us.  We use the iPhone app as well with great results.", "Date": "May 20, 2013"}, {"Title": "Easy but video quality mediocre", "Author": "NCMacs", "ReviewID": "RT9AKSX5KPWIL", "Overall": "3.0", "Content": "Well, I've made numerous attempts at setting up internet cameras with many pitfalls related to my low tech IQ.  This system was exactly what I needed in terms of setup - quick and easy!  However, the images are not nearly as clear as the manufacturer's images.  I would gladly pay more for better video quality, though.  OK for short range (one room) monitoring but when I point it outside the images are not great.  Other reviewers mentioned the battery life and suggested turning off the camera, but as far as I can tell you have to do so physically not from the web, which is not great for monitoring remotely.  Just had it a day so maybe I'll warm up to it.  Plan to keep as it is definitely the easiest internet camera system for the price.  Hey, Netgear - how about offering higher quality cameras for more $$$?", "Date": "May 16, 2013"}, {"Title": "Remote Security Viewing", "Author": "Mimudbrazil", "ReviewID": "R22S4HZ9JSUB3J", "Overall": "4.0", "Content": "I use the VueZone system to remotely monitor my house.  I travel extensively and use the system often.  Set up was a snap and the price in line for the system.", "Date": "May 14, 2013"}, {"Title": "What a great idea", "Author": "Phil Schilke", "ReviewID": "RTR88DRZJCMSU", "Overall": "5.0", "Content": "This is the system I have been waiting for someone to develop.  Wireless is the only thing that would work with a southwest style house where there is no way to easily wire a security system in the house.  This system answers my wish to have a security system for my house.", "Date": "May 14, 2013"}, {"Title": "Love to use it", "Author": "Robert E. Levine", "ReviewID": "R2YN9XFREN0W2C", "Overall": "5.0", "Content": "We have it set up in our vacation beach house.  One camera is inside the house, and functions as an intrusion alarm.  Should anyone enter the house, we immediately get an email with a photo.  The second is in an outside unit facing the beach.  We can check in any time to see the weather and beautiful view of the sand and ocean!  Set up is simple and the cameras function flawlessly.  There are software updates periodically, which download and install quickly.", "Date": "May 14, 2013"}, {"Title": "Feel Safer", "Author": "DEG", "ReviewID": "R2S5L3K7US7ORW", "Overall": "5.0", "Content": "I have 8 cameras in my system. I feel safer at home even though I have an alarm system.I wish the motion sensor camera worked through glass.", "Date": "April 23, 2013"}, {"Title": "Easy and QUick", "Author": "Blair Taylor", "ReviewID": "R3IGO15HPQV01S", "Overall": "5.0", "Content": "Vuezone is a simple to install home security camera system.  Set up takes just a few minutes and it is very easy add or move cameras.  Video quality is surprisingly good for the cost of this system.", "Date": "April 23, 2013"}, {"Title": "Terrific Camera System", "Author": "kfrankk", "ReviewID": "R2M66XORW0H3GO", "Overall": "5.0", "Content": "The tiny cameras provide good picture quality, remote operations, changeable settings.  iPhone and iPad applications provide constant viewing opportunities while away from home or office.  I operate 6 cameras.  Major negative is that there is not yet an exterior camera, only an enclosure.", "Date": "April 22, 2013"}, {"Title": "It's Simply Awesome !", "Author": "Thomas Kennedy", "ReviewID": "R9CTDAW5BO8NG", "Overall": "5.0", "Content": "The System works as good as promised. So for peace of mind it's well worth it, The  batteries work for a really long time and its super simple to use. I would highly recommend it -", "Date": "April 22, 2013"}, {"Title": "VueZone as a tool", "Author": "Dave", "ReviewID": "R1S200MDF5MMCK", "Overall": "4.0", "Content": "The VueZone 2 camera system was very easy to install and is a breeze to use.  I use the system along with my home alarm system, for security.  If motion is detected, it records for 90 seconds and sends an email to my BlackBerry, alerting me to activity.  I wish it were a bit higher quality in capturing motion.  And sometimes in mid-day the system cannot recognize one of the camera's for about 10 minutes.  These are my only complaints.  Other than that it works great.", "Date": "April 12, 2013"}, {"Title": "Excellent quality, reasonable cost, and easy to use security cameras", "Author": "T.A.", "ReviewID": "R11M6HZWD4N7ND", "Overall": "5.0", "Content": "Netgear VZSM2700-100NAs VueZone Wire-Free Video Monitoring System (Black/Gray)Our neighborhood recently has had some break ins and I wanted to protect my home without installing alot of hardware or paying too much for monitoring.  The Netgear VueZone system looks good, is highly customizable, reasonably priced, and very easy for me to monitor.  I have 3 motion activated cameras and one that isn't.  They are positioned to automatically record any intrusion while I'm away and email me, allowing me to decide if I want to call the police.  I have had it active for a couple of weeks now and it works like a charm.", "Date": "April 11, 2013"}, {"Title": "peace of mind...", "Author": "JOHN STRICKLAND", "ReviewID": "R2IFTPILIIWWCI", "Overall": "5.0", "Content": "I can log in and check my home from anywhere in the world.  Easy to set-up and no complicated router configurations.  Fully functional within minutes right out of the box.", "Date": "April 10, 2013"}, {"Title": "Both gateways work great", "Author": "Paul Speck", "ReviewID": "R2QS1MK4R6PW8U", "Overall": "5.0", "Content": "Purchased two systems-one for boat at marina and one for beachouse.Toughest part about install is getting ladder out for aiming cameras.Recommended to coworker who's placing an order today actually.", "Date": "April 8, 2013"}, {"Title": "Personal Security", "Author": "Archie L. Amos Jr", "ReviewID": "R2SNVM4KKY1KGK", "Overall": "5.0", "Content": "I installed this camera system several years ago and since have added additional cameras. Having this system has provided me and my family with a sense of security that can not be put into words. The ability to monitor your environment at any given time or have video clips sent to you of movement provides a unique level of control over your dwelling and other properties. Additionally, the reduction in homeowners insurance is truly appreciated.", "Date": "April 5, 2013"}, {"Title": "Fantastic Product!", "Author": "Andy G.", "ReviewID": "R2KBMZH386ZDKO", "Overall": "5.0", "Content": "I purchased one of the original VueZone systems for my home shortly after the product was released and since then purchased anther for my rental. Installation was extremely easy and did not require any support. Since then I've purchased several motion detection cameras which work great. The fact that I can receive emails and/or text messages notifying me of any movement in and around my home is comforting. Absolutely a great product with the flexibility of no wires and at a decent price!", "Date": "April 4, 2013"}, {"Title": "so far so good", "Author": "R. Bramble \"amazon lover\"", "ReviewID": "R3VDYBHN7ZJZEB", "Overall": "5.0", "Content": "purchased so didn't have to run wires thru walls, battery works fine, just wanted a little extra security with my home monitoring system, so far so good.", "Date": "April 25, 2014"}, {"Title": "Easy setup is this camera's biggest draw", "Author": "Steve", "ReviewID": "R3PDE1M1NV3FFT", "Overall": "3.0", "Content": "Pros:  It truly can be set up in minutes.  It does work within certain parameters (see cons).Cons:  The motion detection is very slow to set off the camera recording.  More often than not, you get a VERY brief view what triggered the camera.  A BIG downside for security purposes.Quality is passable, but if they upped the quality, battery life would most likely suffer.  Ok for me for now, but will probably look for something better down the road.", "Date": "March 7, 2014"}, {"Title": "loved it", "Author": "Howard Joseph Wong", "ReviewID": "R1MDIBLJ4BHPS9", "Overall": "4.0", "Content": "the cameras are small and easy to place out in the open among other things without it being too noticable to others. (I noticed it easily though.)the capture quality is somewhat small on the video. but what can you expect for this small camera.the instructions do not show you how to connect this directly to your computer to save the data. it only shows you how you can subscribe to a rather pricy online plan that stores maybe 2 days of data online for you. wish i would have known about the self storage option instead of having to sign up for their online service.", "Date": "February 24, 2014"}, {"Title": "Best Solution For My Needs", "Author": "Amazon Customer", "ReviewID": "R3HPJKTL4MEX4O", "Overall": "5.0", "Content": "So I had a need for a wireless video camera.  What would be a bonus would be ease of use and a way to view the video from a portable device without a lot of configuration.  In comes the Netgear Vuezone camera system.  First you get a wireless base station that you plug into your router with a standard ethernet cable and plug into an AC/DC adapter.  That's the extent of cords for this setup, just the base station.  The camera's are battery powered and mounted on a magnetic base with a sticker on the back.  If where you want to put the camera on a non-sticky-helpful surface, a simple screw into a drywall anchor easily solves this problem.  Then you make a vuezone account, and download the vuezone app to your android and iOS devices, and you have a quick and easy to setup video camera solution.  After two days of use, I'm sold, it does exactly what it says it does and has saved the day at least one time in the last 3 days since it's been installed.  The best part, when I'm done using it where it's at now, I can simply just move it.  They also make a night-vision camera and a outdoor version of the camera as well.  The free plan I'm using for netgear gives me access to two cameras anywhere on the internet.  It's a great little product, the only addition I'm making to the setup is rechargeable batteries for the camera as I like rechargeable batteries more than anything in the world.﻿", "Date": "January 7, 2014"}, {"Title": "Love them", "Author": "Misty", "ReviewID": "R24V0K1XTRH9NR", "Overall": "5.0", "Content": "I love these cameras I can see what my teenagers are doing while i'm away and feel safe knowing if someone brakes in I can catch them on camera", "Date": "November 5, 2013"}, {"Title": "Great system for the price.........", "Author": "Al Callender", "ReviewID": "R3KZZV8YMFOXN8", "Overall": "5.0", "Content": "This camera system is absolutely perfect for the price. It does everything that I expected it to do and more! I'd buy it again.", "Date": "November 3, 2013"}, {"Title": "Excellent Home Monitoring System", "Author": "Bonifacio Maldonado", "ReviewID": "R2B1307NN2R23X", "Overall": "5.0", "Content": "My family and I were looking for a home video monitoring system and after coming across Netgear's Vuezone, we didn't have to look any further!", "Date": "October 26, 2013"}, {"Title": "Florida views", "Author": "Dr. Dennis Jones", "ReviewID": "R3EO41F4DY1JHN", "Overall": "5.0", "Content": "NETGEAR VueZone Home Video Monitoring System  - 2 Camera KitB009SPUYP4Very easy to install, works perfectly, only thing to remember is to turn motion detection off when you are in the house otherwise you get lots of e-mails.  Absolutely love the camera mounts, so easy, and with the spare mounts cameras can be moved to another location in seconds.", "Date": "October 22, 2013"}, {"Title": "Perfect!", "Author": "Kelly C. Shoffner", "ReviewID": "R2ITJO25LH2JPS", "Overall": "5.0", "Content": "Exactly what we needed for keeping an eye on our elderly parent.  The entire family has access, which gives us peace of mind.  Cameras are small and discreet.  Easy set up.  I highly recommend", "Date": "October 19, 2013"}, {"Title": "Junk.  Don't waste your money", "Author": "Kevin", "ReviewID": "R3IPL9NI1SINTK", "Overall": "1.0", "Content": "I bought this today at best buy (sorry). I really feel all the reviews are written by the company.  The pic quality is sub par . The delay is ridicules. Images look like a ghost. If you plan on catching a burglar, post a sign for him to stand I front of the camera still for 5 minutes. Looks a a civil war pic when the subject moves. Alert does not work on aol, so they told me to create a g mail account. After wasting more time, it still does not alertThe customer service is in some 3rd world nation. The operator sounded like he was at a windy bar on a cell phone.  He had no idea what I was talking about.  Spend the money and get a real system", "Date": "October 1, 2013"}, {"Title": "Vacation Home Must Have", "Author": "mcpowderman", "ReviewID": "RZWT7R30YIUP3", "Overall": "5.0", "Content": "Got one of these for my vacation house and I use it to check the weather before we go.  I get to see how much snow we're getting before we leave.  Fun to have.", "Date": "May 9, 2013"}, {"Title": "Perfect and a great price", "Author": "Charles M. Stewart", "ReviewID": "R2BMKTE7AFDTBT", "Overall": "5.0", "Content": "I looked at several systems and Net Gear Vue Zone was the best with easy set up. Works great every time.", "Date": "May 9, 2013"}, {"Title": "Great Camera System", "Author": "Kathy Woodall", "ReviewID": "R1HD6N6VRTI59Q", "Overall": "5.0", "Content": "This is a great camera system at a reasonable price.  I like the versatile way that the camera's can be moved around and additional cameras added to the system.  The fact that you can download an app to your smart phone is a big plus!  You can monitor activity from your smart phone.  We can also review pics that have been taken and stored in the online library.  I would definitely recommend this system.", "Date": "May 9, 2013"}, {"Title": "Wireless cameras!", "Author": "Manuel Selles", "ReviewID": "R3O2V8MW385D6I", "Overall": "5.0", "Content": "I did a lot of research in seeking a video monitoring system.  What I found in vuezone and in no other was that it was wireless, and by that I don't mean the wifi, I mean the cameras.  I did not want ugly cables running all over the house.  I love the iphone app and the motion sensor.  I also like that is independent of my security monitoring system.  I did not want them also giving me the access to the video part. I like that they are independent systems.", "Date": "May 9, 2013"}, {"Title": "Great Investment", "Author": "Kitty L Edwards", "ReviewID": "RNTCAYLRD2B6N", "Overall": "5.0", "Content": "These little cameras are effective and easy to use.  Set up was easy and I never have any problems with them.  I have both styles and now I am thinking about getting an addition one for outdoors.  You can monitor daily, but especially nice for when your on vacation or away from home for any length of time.  LOVE THEM", "Date": "May 9, 2013"}, {"Title": "love it!", "Author": "wxdavid", "ReviewID": "R2WZJLLR2ALMST", "Overall": "5.0", "Content": "I was looking for a system without a bunch of wires to monitor my home. This was perfect. I'm well over a year on the first set of batteries and they are still running strong. The camera quality is great and have had no technical issues at all! I love the system.", "Date": "May 8, 2013"}, {"Title": "Great Camera", "Author": "Bill Alexander", "ReviewID": "R3QTBH19LC4G6", "Overall": "5.0", "Content": "I am amazed that Costco now sale them, the battery life is 6 to 9 months taking lots and lots of pictures. Nice to see what is going on while away from home.Get to see if that UPS or FED EX package came or not.", "Date": "May 8, 2013"}, {"Title": "Assurance", "Author": "JULIA A JONES", "ReviewID": "R30JF9U6HFUKXL", "Overall": "5.0", "Content": "It took me all of thirty minutes to connect, sync, mount and aim my camera system.  I am very pleased with the quality of the video and am going to be adding three more cameras so that I can have even more assurance that things are happening at home as they should be while I am travelling, recreating or just out of the house. The mobile app is simple to use and extremely convenient.", "Date": "May 7, 2013"}, {"Title": "WOWZERS ! ! !", "Author": "dj kirk state", "ReviewID": "R2JHZ20SG3CPC9", "Overall": "5.0", "Content": "This product is a certified beast. works very well ! I recieved it fast and prompt as promised. Once i opened it and hooked it to my router and synced the camera i was astonished at clarity of live feed. For the price this is the best its going to get so for all the cry babies looking for better resolution i hear c.i.a. wants to sell a few old cameras. anywayzzz it took no time to set up from box opening to account set up and Andriod app download it took hardly 25mins top. Now with all that being said i have Verizon FiOS QUANTUM speeds and an Samsung S3 Android phone. So if you are attempting to use this with dial-up and a flip phone fuggeddaboutit ! The zoo is not all that great but this is great for entry spaces such as front and back doors or garages and refridgerators. The APP is awesome i showed friends of mine and it was a jaw dropping contest. But beware you may find out some things going on in your home you really didnt want to know. #MUSTHAVE product.", "Date": "May 7, 2013"}, {"Title": "Pet watcher", "Author": "Ernest E. Parker III \"eclassy\"", "ReviewID": "R3EWIDUZ92WI9F", "Overall": "4.0", "Content": "I can monitor my dog and my car in the driveway when I'm out of town. This is the best that i have used.", "Date": "May 7, 2013"}, {"Title": "Great Product, but...", "Author": "LambDM", "ReviewID": "R22N9ZZTCNA75F", "Overall": "4.0", "Content": "The installation was very easy and fast. The product performed just as stated. The only thing that I was surprised by was that the motion dectection feature does not work through glass and I had purschased the glass mount separately to look out onto the patio area. I was wondering what is the difference between glass and the outdoor cover? The outdoor cover with stand  picks up motion with no problem.  lf that was not an issue I would have given it 5 stars. The web interface is very responsive and easy to use. I am up to 3 cameras and will be purchasing 2 more in the near future. Thank for making such a excellent product..", "Date": "May 7, 2013"}, {"Title": "Not Complicated!", "Author": "valerie wheeler meredith \"vw meredith\"", "ReviewID": "R1H7BY4XX61FOY", "Overall": "5.0", "Content": "I had purchased another system that required me to create IP address and do several compliated tasks.  I consider myself pretty computer savvy but this was ridiculous.  Have since disconnected that system and am planning on selling it to add more cameras to my Vuezone system.  I love it.", "Date": "May 6, 2013"}, {"Title": "Cost Effective", "Author": "Ranger Ron", "ReviewID": "R1CLFYXZAL2VPT", "Overall": "5.0", "Content": "Easy to use, easy to set up.  I have used this system for two years now.  I use the cameras to monitor my Florida condo while I am away; in particular during the hurricane system.  I have four cameras pointed at each of my most vulnerable windows that could be impacted.  I also view a digital, battery operated temperature & Humidity gauge to monitor for possible water and air conditioner problems. This way I can check on the status of my condo 24/7 vs having someone check in once a week.", "Date": "May 6, 2013"}, {"Title": "It's a practical and very easy to install and use system", "Author": "MRT", "ReviewID": "R2M7EJF26N167D", "Overall": "4.0", "Content": "This camera system works well, I have three sensor camera and one normal camera for 2 years, the system worked flawlessly and the batteries last well despite daily use recording sensor.", "Date": "May 2, 2013"}, {"Title": "VueZone System", "Author": "Caps", "ReviewID": "R1KCHBE7JWCSW3", "Overall": "5.0", "Content": "I first tried out the 2 camera motion detection system, and found it to exceed my expectations.I now have 10 cameras and 3 base stations (as I have a concrete home here in Bermuda) and the range is good but wifi typically has interference from the concrete walls.Quality of pictures and ease of use and installation have been the key deciders for me to keep and expand this system.  There are so many practical applications.I hope they eventually have a \"pro\" online monitoring system whereby you can add more than 3 base stations (for vacation homes etc.) as well as businesses etc.  15 cameras is also good, but still a limitation they can overcome.", "Date": "May 1, 2013"}, {"Title": "Keepin' an eye on things!", "Author": "Patrick", "ReviewID": "R1POXDAV76FAS9", "Overall": "5.0", "Content": "This is a great product. We used the VueZone system to keep an \"eye\" on our pup when we went out and our home when we were gone on extended trips. Great feeling of security. We could even see what was going on when we were in Europe. We had two go to numbers in case of trouble and I had arranged with the PD for me to call them if I suspected something wasn't right. We had one of the cameras in line with a special lamp that would go on if the furnace went out and another on a lamp that would go out if the electricity went out. The person taking care of the house also knew what to do if our internet needed resetting. It was fun to watch it snow and blow when were in warmer climes! Get this system! No wires, no monthly bills, and a reasonable level of security...you'll love it.", "Date": "April 30, 2013"}, {"Title": "Two systems", "Author": "Beach Boy", "ReviewID": "R1FSX8GP3FUMLB", "Overall": "5.0", "Content": "We have a second home.  In each place, we have the motion detecting camera.  There is a note on the door: ALARM SYSTEM ARMED to remind repair people to call me before they go in.  I also have a \"birdhouse\" cam outside giving a view of most of the structure.  Be aware, when booted up the hub gets the IPaddress and sends it to a \"connection server\" so to log in you go the VueZone site and it reroutes to your cams - unless COMCAST reboots the modem and gets a new IP address.  The hub doesn't get the new IP, connection server is'nt updated and no logging in - unless you put the hub on a timer that reboots it around 3am.  Only have this issue with one system, both Comcast.  BTW, I've had my systems for 4 years now.  I have a 4 cam and a 3 cam system (one cam is motion detecting each system.) I use 900ma Tenergy recharegable RCR Li-ion 123A battery for 90 days between recharge, checking in 3 minutes daily.  I thought the setup was easy.  Never had a issue with any cams.", "Date": "April 29, 2013"}, {"Title": "Excellent Wireless System", "Author": "Nash Crawford", "ReviewID": "R916SN0DVQECZ", "Overall": "5.0", "Content": "I've had my system for a couple of years now. I've used it to watch over family when they were ill and I had to leave them alone for short periods of time. Most of my cameras now watch the exterior of my home from sever different view points.", "Date": "April 18, 2013"}, {"Title": "Perfect system for our small condo building", "Author": "William Bliss", "ReviewID": "R27VSSUX56DATY", "Overall": "5.0", "Content": "I'm the resident geek of our small condo building, and we've looked at installing video security systems for a few years now. They are expensive, and all of them required running costly and unsightly wires.When I read about VueZone, I thought we might finally have the answer.I've installed four cameras so far, and we'll be buying more.Most importantly, it could not be simpler to install and configure.", "Date": "April 17, 2013"}, {"Title": "Great Cameras", "Author": "c. lucero", "ReviewID": "R3GK90BW2KHBKS", "Overall": "5.0", "Content": "My instructor is a retired Cpt with the Police Dept and he has this in his house. He highly recommended this product. I love it!", "Date": "April 17, 2013"}, {"Title": "PEACE OF MIND.....PRICELESS", "Author": "Edmode", "ReviewID": "R1PHBXLYDCZ9TQ", "Overall": "5.0", "Content": "Have had the vuezone system for about 2 years now and the peace of mind it brings is priceless. Vuezone cameras compliment my home alarm. With 4 cameras and one being a motion sensor is priceless.", "Date": "April 17, 2013"}, {"Title": "Great cameras, need good internet conection.", "Author": "Catalina J. \"Cata\"", "ReviewID": "R17V08NZ4CCRUV", "Overall": "4.0", "Content": "Really amazing, I have them all around my home so when I go out I can check on my kids. Really easy to install and setup", "Date": "April 16, 2013"}, {"Title": "Great for the price", "Author": "Russ \"Russ\"", "ReviewID": "RMHMZC3O112XO", "Overall": "5.0", "Content": "I bought this system on special and I can say you can't beat it for the price. No real problems but the batteries are fairly expensive. Do wish they had a higher definition version.", "Date": "April 16, 2013"}, {"Title": "NETGEAR VueZone camera system rocks", "Author": "Bob (SD Birdman)", "ReviewID": "R2M7NCLTFJ7IM2", "Overall": "5.0", "Content": "I opted in to be a BETA tester for this product when it was first intoduced several years ago. I am now on Generation 2 with a total of 4 cameras. It allows me to keep track of my pets when at work and the house and property when traveling. Installation is so simple it's hard to believe. I sure hope I get to test out new product maybe with sound. You won't be disapointed.", "Date": "April 16, 2013"}, {"Title": "Love My VueZone", "Author": "R. Nelson", "ReviewID": "R30PK2BEZJODW7", "Overall": "5.0", "Content": "I started with a two camera motion detection system primarily as a second security system along with my central station monitored door and window contacts. I added two cameras within a year to monitor more areas while on vacation. Two of the cameras are located outside in protected locations here in Minnesota and my experience is the cameras operate reliably down to zero degrees Fahrenheit. If it gets colder than that the cameras may stop operating for a day or two until the temperature warms up and the cameras resume operating. I plan to add a motion detection camera outside my front door this year.I have been very happy with my VueZone system and the extra security it provides. I have recommended VueZone to my security system technician and he has several of his customers who have bought it.", "Date": "April 16, 2013"}, {"Title": "VueZone system was an essential part of our mother's ability to remain in her home.", "Author": "Nathaniel Dahl", "ReviewID": "R2Z5G7IATP3503", "Overall": "4.0", "Content": "Our mother is in assisted living now, due to dementia.  However, she was able to spend probably an extra 9 months in her beloved home due to the Netgear Vuezone system.  We could keep an eye on her - make sure she was OK any time day or night.  We even had a camera pointed toward the kitchen stove, so we could make sure she hadn't left the gas on.  The setup and administration was simple, and the web interface allowed us - her three adult children, all in different locations - to do our bit in monitoring her safety.  The only reason I rated it 4 instead of 5 stars was that, particularly in the beginning, cameras would go offline quite often, and so there were frequent times when we couldn't check on mom, and often camera batteries would go dead without the system giving us any warning.  Plus, two of the six cameras we used eventually failed entirely and had to be replaced.  However, that improved a lot as time went on and new releases of the camera and hub firmware were released.  Also, the newer version of the cameras seemed to work a lot better, with fewer connection failures and improved picture/video quality.  Once or twice we contacted Vuezone technical support and it was excellent.", "Date": "April 16, 2013"}, {"Title": "VueZone Cameras monitor without any wires!", "Author": "ROBERT BERNARD", "ReviewID": "R1U5BWE282S6NA", "Overall": "5.0", "Content": "Netgear VZSM2700-100NAs VueZone Wire-Free Video Monitoring System (Black/Gray)The VueZone camera system is easy to install, operates with no network or power cables, and allows easy addition of other cameras with motion detection or night capabilites.  The user can remotely update and reboot the gateway.  The camera batteries last up to six months when used for 5 minutes per day.", "Date": "April 16, 2013"}, {"Title": "Excellent product", "Author": "Wayne", "ReviewID": "RN2U2UKH91UZX", "Overall": "5.0", "Content": "Works great for monitoring my mother from afar.  With two night vision cameras and three others, I can see who is coming and going and that she is alright. Super easy set-up.", "Date": "April 15, 2013"}, {"Title": "Easy and very effective Video monitoring", "Author": "David Pena", "ReviewID": "RKJU2A9RKHDOF", "Overall": "4.0", "Content": "If you are looking for an in-expensive video monitoring solution, this is it. For the price that you are paying you have a system that you can rely on to keep track of your home or business when you are away. The ability to install this system with out wires is a plus and with the abilty to monitor your cameras from a iphone or ipad is the major selling point for this system. the only downfall is that you have to change the batteries so then you have to re-adjust your cameras, but this is a little inconvience for what you get for this system. All in all a great little system that is just right for the homeowner or small business.", "Date": "April 14, 2013"}, {"Title": "great system", "Author": "Raymond F. Brennan", "ReviewID": "R1LC9Y2Z15TXD", "Overall": "4.0", "Content": "as long as you understand what this system is and what it is not you will be happy with it.  i read up on many different system before i bought this one and i knew what i was getting.  i am very happy with it!  the setup is so easy you wont believe it.", "Date": "April 14, 2013"}, {"Title": "Don't waste your money", "Author": "Dominick Amendolaro", "ReviewID": "R2H5E7VJBOEZV0", "Overall": "1.0", "Content": "Don't waste your time or money with this system, you will just be returning it anyway. This system stinks and doesn't work!", "Date": "July 27, 2013"}, {"Title": "Great to watch the cabin.....", "Author": "Tahoe Traveler", "ReviewID": "R19K1YCHPSCVP3", "Overall": "5.0", "Content": "I've placed several Vuezone cameras in my cabin at Lake Tahoe so I can watch the weather, the inside tempeture, and the front door (motion camera).  Having the motion camera upload to an offsite server allows me to identify any Unwanted guests, who may attempt to distroy the cameras after a breakin, to be caught.  It also allows me to make sure any service people that have keys don't enter the property uninvited.The system is inexpensive and reliable if power is maintained...but it also reboots when power returns after a failure.Great system...Highly recommendedNow if Netgear could add online thermostat, electronic door lock, and light controls, WOW, this would be a Great home watchdog!!!", "Date": "April 30, 2013"}, {"Title": "Outstanding", "Author": "George", "ReviewID": "R186ZTW1NFUP4T", "Overall": "5.0", "Content": "Never had a better experience with a new product. Vuezone got it right, the interaction between hardware and software is outstanding. My daughter took me to the local Apple store in New York to show me something exiting about surveying the babysitter at home during her absence. I ended up reviewing all similar products available in the market before selecting Netgear Vuezone. I don't know if it is the cameras or the software but at high resolution the pics are a little fuzzy. I am sure with time it will improve. If new hardware  with sound becomes available I will buy immediately. This has been a very exiting experience, 3 cameras so far and I am going for 15. I am using it for security purposes, I have no babysitter to spy on.", "Date": "April 21, 2013"}, {"Title": "Piece-of-Mind Remote/Mobile Viewing Systsem", "Author": "Tech Evaluator Houston", "ReviewID": "R38WU3MF75W4YA", "Overall": "5.0", "Content": "I am very impressed with the VueZone system and the technology! The camera system was very easy to install and very easy to access (view) via the web. The variable operational options are easy to tweak and view the settings. Also the purchase price is very affordable.", "Date": "April 9, 2013"}, {"Title": "Pretty good", "Author": "Sdtoumbs", "ReviewID": "R6V8LJ9T0L8KV", "Overall": "4.0", "Content": "Cameras are crystal clear and as long as you have access to a desk top they are great but most of the time tha app on my iPhone does not work.", "Date": "April 6, 2013"}], "ProductInfo": {"Price": "$334.47", "Features": "Motion Detection Email Alerts - Sent directly to your email with an image or short video clip\nAccess live video anytime, anywhere - Supports iPhone, iPad and Android mobile devices\nVueZone Mobile Apps - Free!\n100% Wire-free for hassle-free placement anywhere\nVueZone cameras install in minutes - Just click, stick and view\nEasily expand your system - Add up to 15 cameras", "Name": "NETGEAR VueZone Home Video Monitoring System - 1 Motion Detection Camera (VZSM2200)", "ImgURL": "http://ecx.images-amazon.com/images/I/41TCLqft8UL._SY300_.jpg", "ProductID": "B009SPUY5O"}}