{"Reviews": [{"Title": "Fun to use; lots of attachment options. Some faults, but a good value cam", "Author": "Comdet", "ReviewID": "R37K0J79MXQNRN", "Overall": "5.0", "Content": "This has been a lot of fun! There's a lot to be impressed with given the price point, and only a few misses.The kit comes with a variety of attachment/usage options. I'm going to cover those first given that this is a cam that will be used while engaged in some type of activity. Thus, the attachment option quality an important part of the product performance.The options are:1. Waterproof enclosure - this is very nicely made. It claims it is waterproof to 30 meters. I can't verify that, but it didn't have a problem dealing with depths of about 10 feet. The latch is plastic but appears sturdy and is big enough to be able to be engaged/opened with thin gloves on. The gaskets appear sturdy, and the case is sufficiently optically clear so as to not cause a notable decrease in video resolution. The top has a sliding mechanism that allows you to turn on the cam without removing it from the case.2. Car mount - a basic suction cup mount. This is probably the weakest link in the attachment line. The suction cup material is not as pliable as others I've used, and does not grip as well as I would have liked. Cleaning the mount surface with alcohol is critical to achieve a decent grip.3. Bike mount - nicely done, and holds the cam very securely. I found it to be the best of the attachment options.4. Helmet mount - decent, but a bit fiddly to get it to sit correctly. Holds the cam pretty securely when you do get the straps properly tightened.For all the attachment options, the adjustment screws are large and encased in plastic for very easy grip even with gloves on. The cam mount post has a plastic wheel that makes it easy to turn the attachment screw. While all the attachments are made of plastic (with some metal reinforcement), the build quality appears solid and better than expected for the price.It includes a small remote that provides basic functionality (on/off, photo, record). It has nice large, non-slip buttons, but the edges of the remote are sharp and uncomfortable.Overall fit and finish of the cam is decent. It's not high-end, but then again, it is not a high-end price either. The buttons have a positive click so you know you pressed it, but are (as expected) very small, and it's easy to hit the wrong one if you have anything other than really thin fingers. The little icons on screen that illustrate format, mode, etc. are really hard to see.The battery is rated at 1050mAh with a claimed recording time of 2.5 hours. In actual usage it was less than 2 hours. There is no dedicated charger for the battery - you have to charge it when it is in the cam. There is an AC adapter to plug in a USB cable for charging. That's a miss for me since I would have liked to have a separate charger for the battery without having to tether it to the wall when charging.The battery door hinge is a weak point - you'll want to take care when opening that to replace the battery or mini SD card since it won't withstand punishment. You also have to open the battery door to access the HDMI port, so you'll want to be careful that the HDMI cable doesn't lasso the battery door and pop it off.Usage is pretty straightforward once you get familiar with the menus, which takes a bit of trial and error since the included manual is sparse at best. Video quality is decent. There's a lot of distortion at the edges due to the wide angle of the lens, but that's unavoidable unless you go way up the price scale for better quality optics. Photo quality is pretty much the same - OK, but not stellar.Sound quality is relatively poor using the built-in mic. It has limited sensitivity and is easily overwhelmed with wind noise. I didn't try it with an external mike.Even though I've pointed out several faults, I'm going to give this 4.5 stars (rounded to 5) since none of the faults are true deal-breakers. The cam provides a lot of functionality for a very reasonable price. This is a great way to try out using an action cam without breaking the bank. While the performance is not going to be at a pro or even \"prosumer\" level, it is more than good enough for fun use. The variety of attachments means you can try out a wide range of uses as well.[Sample provided for review]", "Date": "August 30, 2013"}, {"Title": "tcl svc -200", "Author": "Wendell Austria", "ReviewID": "R1B8UYTA39TUW8", "Overall": "4.0", "Content": "great camera .. works great.. only thing it shakes in waterproof housing so you'll hear it rattelling in playback .. could use a filter in sunlight.", "Date": "January 14, 2014"}, {"Title": "good product", "Author": "WildMan", "ReviewID": "R1PZYXK7BMG9TD", "Overall": "4.0", "Content": "Works great!!! Great product for the money. Fairly easy to use.  Comes with good accessories, case is durable. Have not tried under water yet. Mounted on the handle bar of my chainsaw and shot a logging video, the vibration of the saw did not effect the video quality. Would give 5 star however instruction manual is not the greatest and I like a good service website. Could not find anything about this product on TCL website.", "Date": "September 25, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "Super slim designing, perfect for outdoor sport (bicycle/driving/skiing/surfing/climbing ect)\n170 degree view angle, 1.5\" high definition LCD\n5mega CMOS sensor, output pixel 5mega, 12mega, 16mega. Full HD video resolution, excellent video quality\nWater proof 30meters (with the casing), With senior chipset, excellent video quality especially in night environment\nHD:1280X720(60fps) (default), FHD:1920X1080(30fps)", "Name": "TCL® SVC-200 Mini HD Sport DV Digital Camera Camcorder Car DVR for Outdoor Action Surveillance", "ImgURL": "http://ecx.images-amazon.com/images/I/41q9ymLC36L._SY300_.jpg", "ProductID": "B009YY850A"}}