{"Reviews": [{"Title": "decent item worth the value", "Author": "Greg Tollefson", "ReviewID": "R2GRCF6NYWCUTC", "Overall": "3.0", "Content": "this item is what to be expected for the price. Install a camera can be challenging do too hard wiring. I would suggest to take the extra time and route wires as cleaning and as far away from other electrical wires as possible. Take some time as well to insure proper loca locations of cameras before you install. The DVR setup is straightforward the directions however are very technical and a hard to follow the mouse is the most irritating thing there is no way to adjust it setting. Having a little trouble with internet Ewing from either PC for phone. Most likely do to my fault", "Date": "May 21, 2013"}, {"Title": "Good system for parrot Breeder", "Author": "Ahmed Soliman", "ReviewID": "R3D5UZ3YCMT0KN", "Overall": "4.0", "Content": "The system is excellent for my purpose i am breeding parrots so i install the system in the parrot cages and nest boxes and it did good for now to me", "Date": "March 3, 2013"}], "ProductInfo": {"Price": "$299.99", "Features": "View Video Online with No Service Fees - View your DVR's live or recorded video footage on any PC.\nLong time recording: - Base on the H.264 Compression, maximize the hard drive's recording time, as well as transfer video for viewing over the internet.\nNetwork Remote Access - Access live video footage directly from your mobile phone or PC anytime anywhere\nAdvanced Motion Detection Recording - This allows you record only when motion is detected.\nInstant Email Alerts if Activity Detected - This system is designed to send an email alert, complete with photo of the activity, if any motion is detected, or if any camera experiences video loss.", "Name": "Zmodo CCTV 8 Channel DVR Video Security Surveillance Camera System 4 Sony CCD Security Cameras with 65ft Night Vision No Hard Drive", "ImgURL": "http://ecx.images-amazon.com/images/I/51OdFu8n--L._SY300_.jpg", "ProductID": "B009QWCQTQ"}}