{"Reviews": [{"Title": "It's actually pretty awesome, once you get it all setup.", "Author": "David L. \"D\"", "ReviewID": "R4O5E5WC4ADT7", "Overall": "4.0", "Content": "I'll begin my review by saying, this unit is worth the money, affordable and does a great job with nice features, but it can be complicated to set up, so it'll require a little effort and patience, but well worth it!It does what you might expect, but the instructions can require a masters degree in technology to understand at times. The manual is also not current with the actual menu. Thank goodness I am tech savvy. I had some problems right out of the box, but it does work like expected.I tried online chat support several times only to get the message; \"department closed\". But support by email was very responsive and helpful. Although if you dig deep enough, you usually find the info you need in the Zmodo websites Knowledge Base.It's a nice looking unit, nice compact size, design and quality construction. The motion record is a cool feature. It has some great options. I couldn't find a firmware update online but support sent me a link. Some improvements on the user interface would be nice. You can do more with the mouse than the remote and in some case you must use the mouse, especially if you want to playback video (to select and search for a time block for reviewing).It did not come with the HDD, but I bought a good used one cheap online (you know that *bay place) and installation was a breeze. I had to run the format utility to make the HDD compatible, not difficult, just look for the HDD option in the menu. I'd recommend the Western Digital Blue 1 TB 3.5\" SATA Hard Drive - WD10EZEXI finally setup the remote/internet viewing. You almost need a basic understanding of networking and IP's but the included network setup page covers the basics. You'll need to access your modems settings to open 5 specific internet ports or you will not be able to view remotely. Zmodo has a good helper page to guide you through the process (http://kb.zmodo.com/NetworkTutorial/landingpage.html).Most home internet service provider uses dynamic IP addresses, so you'll need to setup the DDNS (Dynamic Domain Name Service)feature in the DVR. This also can be a challenge. I used myq-see.com to set up a free account then programmed the DVR with the DDNS settings. Now when my ISP changes my IP address, the change is sent to myq-see.com account and I use a domain name to access my DVR remotely from anywhere on the internet.The Zviewer APP for the iphone/ipod/ipad or andriod is great. Zviewer also lacks instructions but it's not hard to figure out. To view remotely on the PC, you can only use Internet Explorer and you'll need to allow a Active X Control, which may require a change in your browsers security settings. But Zmodo offers online directions for that.I almost paid $40 for a single channel SD Card DVR but this was totally worth the extra $30 +HDD cost. For my use, the 4 channel was plenty and I will soon be buying the Zmodo Weatherproof Pan/Tilt/Zoom (PTZ) Camera to add pan/tilt/zoom features to my system.This DVR offers lots of high D1 quality storage capacity with your selection of HDD size and the multiple cameras option is a great feature for monitoring my home's surroundings, from a number of different locations.Although you can buy a Zmodo full security kit, which includes cameras and HDD, I found it more beneficial to buy each piece to fit my needs (DVR, HDD, Cameras, Cables).", "Date": "July 25, 2013"}, {"Title": "great dvr at a low cost", "Author": "pl", "ReviewID": "R248A3ZU5ZHVQ5", "Overall": "4.0", "Content": "The DVR is pretty good, does everything it states. However, unlike another Zmodo dvr i have, it requires you to open 4 ports on the firewall for connecting thru the internet (web, command, media streaming, mobile), and I have hard time finding a Windows Phone 8 mobile app to connect to the dvr. I have no problem using an app to connect to the other DVR, but not this one.", "Date": "March 11, 2013"}, {"Title": "An expensive switch", "Author": "Gary", "ReviewID": "RWDQHM7W5RDC8", "Overall": "1.0", "Content": "Works great as an expensive switch. Could not get it to work over my network. The company was very poor in support. Online chat came up as unavailable after several minutes. Email was not answered after 48 hours.", "Date": "August 23, 2013"}, {"Title": "Happy With This Product", "Author": "Paul", "ReviewID": "R2X9837ORUHEPA", "Overall": "4.0", "Content": "First time am using Zmodo. Liked everything and after a few weeks or months might upgrade  to 9 channel or more. One small detail, the event search criteria can be improved a bit better.The rest, I recommend same, especially since it has low noise operation.RegardsPaul", "Date": "July 20, 2013"}, {"Title": "Only works with Windows and Internet Explorer!", "Author": "C. Jolls", "ReviewID": "R2G1IRAKFT5H3T", "Overall": "4.0", "Content": "I got this DVR to replace an older Zmodo DVR I had in which the network port died.  The old one supported Firefox and Chrome.  This model ONLY supports Internet Explorer.  This is a step backwards and likely very bad news for Mac users.The hard drive can only be screwed in from the bottom (up into the bottom of the drive.)  This is fine unless you're using a 2.5\" drive, and then the holes don't line up, nor do they line up with a 3.5\" adapter since it expects the screws to come in from the sides, too.There's no setting for the LAN bandwidth, and viewing it in IE looks like about 5 FPS.  On the older model you could select the bandwidth and get very fluid video in a browser.One nice feature the old one didn't have, is that you can adjust the brightness and contrast of the video while viewing it in IE.Update:I discovered a program on the CD that I can't find any mention of in the documentation, called VMS-Video Monitoring Client.  It's a Windows application for managing the DVR and I have to say, it's a lot better than trying to use the web interface, even compared to the older model DVR.  Something I particularly like is that it will play all motion triggered events sequentially, rather than having to pick each one and hit play.  And it will apparently allow you to monitor multiple DVRs.  I'm giving it 4 stars instead of 3 now.", "Date": "August 14, 2013"}, {"Title": "Im happy", "Author": "J. Cagnassola", "ReviewID": "R2FAZSHYPUT1JB", "Overall": "5.0", "Content": "My older Nightowl conked out, so I decided to try this one based on reviews, price was great, it was easy to add my own sata hard drive and configuration although not super easy was easy. I say its not super easy because there is allot of settings to go through but the instructions were easy to understand and I am able to see my cameras locally and on my smart phone with the sofware and apps.My old cameras worked fine, I decided to get a couple of better cameras as well and its working good.I was a bit hestitant but would recomend to anyone who is just starting out or needs addtional cameras.", "Date": "December 27, 2013"}, {"Title": "One of the rare times I've called a product junk", "Author": "D. Canfield", "ReviewID": "R2BLPHSBOCM6NY", "Overall": "1.0", "Content": "I understand that this is a budget DVR, but as of 10/2013, the device is useless for network access.  I mention the timeframe in case firmware updates improve the situation, and because some positive reviews may have used it with an older version of Windows/IE/Android.For reference, I am a systems admin... well versed in network technologies.  The device connects to the network and pings.  That's about all that it does.It does connect to cameras, and can format a hard drive.  I suppose if you want this for standalone DVR purposes, it might work for that.If you attempt to access this device from IE10, you will get nothing.  If you go to Zmodo's web site, you will see instructions for bypassing security checks so that it will run in IE9.  Following those steps will get the logon screen to load.  That's as far as you will get with a web browser (and yes, it's IE compatible only).So, maybe you want to try the Android app.  Among the things you'll be asked for, is the port number.  The device has 4 internet ports configured in the software.  Go ahead and guess at which one you have to put in.  None of them will actually work.  At best, you will get the helpful message \"not supported the channel number.\"  Looking on Zmodo's site will get you info stating that you need to update your firmware if you get this message.  Aften formatting a USB drive a number of times trying to guess the right format and USB port (only a FAT-formatted drive in the top rear USB port seems to be recognized), the firmware will update and nothing will change.On to the windows software.  The automatic camera finder won't find anything.  Configure a device manually (once again taking guesses at what port number it wants), and you will only ever get an invalid username/password error.  Go ahead and reset the box to factory defaults, and try both admin and user and the ultra secure 111111 default passwords.  It will do you no good.Unfortunately, I did only basic tests with my unit and then let it sit a month or two before I got around to installing the cameras, so I can't return this absolute piece of garbage.", "Date": "October 14, 2013"}, {"Title": "Great product, easy setup", "Author": "William Covington", "ReviewID": "R3E80OVAJHFDUG", "Overall": "5.0", "Content": "Be sure to use DVR rated hard disk drives for long life. Limited to 1 PTZ controller.A great product for the price!", "Date": "October 2, 2013"}, {"Title": "Not what it's advertised as", "Author": "BAT guy", "ReviewID": "R3KQLZDUOWH0KG", "Overall": "3.0", "Content": "Standalone, somewhere, means NO HARD DRIVE. That's what it is. My old security DVR had a bad circuit card and good hard drive. I was able to transfer the old hard drive into this new partial rig and it miraculously works. The electronics look brand new in it, but I wish theyd been more clear that there is no hard drive inside. If you can handle that it's OK for the 84 bucks. Standalone. Sheesh!!!!Well I found out what I think standalone is. Installing the device into my camera circuits I found the power supply unlike my original. It has only one output, for the DVR. Not like the original DVR which had a power supply with 5 outputs for the DVR and 4 cameras. Voila le standalone. Sheesh.", "Date": "July 6, 2013"}, {"Title": "Low level quality DVR, waste of money", "Author": "Zaur Aghamoghlanov", "ReviewID": "R1GZPDX7HM54ZU", "Overall": "1.0", "Content": "1) DVR periodically is not recognising HDD (WD Blue 1 TB WD10EZEX) while restarting DVR. The HDD  was also purchased from Amazon on the same day.2) It is not possible to turn on DVR neither by pressing Power button on the front panel nor by pressing Power button on a remote controller. In order to turn on the DVR I had to switch off/on Power switch on the rear side of the DVR.3) Video setting was set up as PAL. After restarting DVR it comes back to NTSC form So, Zmodo DVR is absolutely useless, don't purchase.", "Date": "September 27, 2013"}], "ProductInfo": {"Price": "$79.99", "Features": "Plug-n-Play\nRecording Modes: Continuous, scheduled, and motion\nDisplay and Records 120 fps\nPlayback Search: Time & Date\nRemote Access", "Name": "Zmodo ZMD-DD-SBN4 4 CH D1-30FPS Real-time H.264 Security DVR - No Hard Drive", "ImgURL": "http://ecx.images-amazon.com/images/I/31dBVulsmbL._SY300_.jpg", "ProductID": "B0095OK69M"}}