{"Reviews": [{"Title": "Poorly designed prodcut without adequate service.", "Author": "Ryan Huang \"Ryan\"", "ReviewID": "R10H1F5V6TZES5", "Overall": "1.0", "Content": "Item was purchased to surveillance my beach home. It was the \"cloud recording\" that caught my eyes because any local surveillance system is never 100%$ safe because the criminal (or the likes) can always temper / destroy your recorded footage. However, this camera has been a huge disappointment.The recording was OK at best showing mostly unclear images at night. The setup is certainly idiotic. You are required to have an Android or iPhone app in order to configure this thing -- THERE'S NO WAY TO DO IT ON A PC. Why doesn't Swann allow the user to manage the device through a web browser? The app on the iPhone is very buggy. I was able to connect to my first router, but when I replaced my router, it doesn't connect anymore no matter what I do.So I contacted Swann's customer service - here comes the worst. I spoke to three individuals from their \"tech support hotline\" and ALL of them appear to be reading off a script. To my utter surprise, they DID NOT understand what is IP address, what is an open port or what is a firewall. I asked ALL of them whether it is necessary to open a port from my router to allow the camera protocol to go through, they didn't understand this. All the \"tech support\" did was repeating what was on the 2 page manual the size of your credit card. And yes, I've read this very unhelpful manual many times. As a last resort they said they'll send me additional documents to help me set it up -- it was something the tech support team supposedly \"created themselves\" to help lost customers like me.OK, so I waited, and the documents arrived in my inbox the following day, and guess what, it was the SAME thing as the 2 page manual that came in the box, with a few more arrows and a few extra \"pictorial presentation\". Having exhausted my patience with their third-world country tech support team, I tried to look up Swann's headquarter office located in Long Beach, CA. I called them and finally someone cared to apologize first. Then I was told a real \"expert\" will call me within 24 hours to resolve my concern. It's been a month..... No one has called yet.The so called \"Cloud Recording\" service is provided by a third party, Seekdon. Their service is a joke -- your video footage is only stored for 30 days after which it's permanently deleted. There isn't an option to download the images for local archiving whatsoever. So basically they are saying if I need to use the footage for evidence in a legal dispute, I better complete the case in 30 days or the evidence will disappear?So bottom line: STAY AWAY FROM THIS PRODUCT.", "Date": "April 29, 2013"}, {"Title": "Good camera, but without local access", "Author": "Amazon Customer \"Randy\"", "ReviewID": "RJB17TQURDY57", "Overall": "3.0", "Content": "I bought this camera to hook up at a mountain home to monitor snow levels and temps (with a thermostat in the view).  It also points at the driveway so when we're there we can see activity (snowplow, visitors, etc.).  My son tried it out to monitor their 2 year old at nap time.Overall a good camera with a picture as good as I need.Pros: It's very easy to set up and the smartphone app makes it easy to see what's happening.  Audio seems to work well, although at times with dropouts.  Nice, small package and a very good price for wifi connectivity.  Mounting hardware is great, allowing flexible mounting in almost any space.Cons:  So far, and after asking the company twice with only a \"we got your message response\", I have been unable to get this to work without an active internet connection.  Everything apparently has to go through the cloud server.  Since we have internet outages at the mountain, this means we can't use it since there is no documented local access.  I'd love to know the back door into the system to allow local monitoring when necessary without the cloud server.Would normally get 4 stars for picture quality, ease of setup, etc., but the requirement of a cloud server drops it to 3.", "Date": "January 26, 2013"}, {"Title": "First security camera, pretty good", "Author": "OnlineShopper \"-S\"", "ReviewID": "R3LDDSHLT764IH", "Overall": "4.0", "Content": "I'm using this for only monitoring a room. Had this for a few weeks now; and besides the initial setup mishap I had with this, it works great now.During my initial setup, I made the mistake of downloading the incorrect Android app; even though it clearly stated the SwannSmart app. I had just entered Swann and downloaded the first app that came up (which was the wrong one), since I was very eager to test the unit out. Having gone through this, I ended up contacting the technical support phone number. That was painful, so hopefully things go well with this so I don't have to call back again. Could be just the person I spoke with but first time impressions leave an expectation on future contacts, so....I'm trying out the motion sensor and this is great. The motion sensor is so sensitive that it was picking up shadow movement (from what I could tell from the notifications I received); so I've turned down the sensitivity level. Hopefully, this will stop the frequent alerts due to shadow movement in the room.I would recommend this product for room observation...Don't forget to download the right app!", "Date": "May 30, 2013"}, {"Title": "Deceptive Packaging", "Author": "Annette McGrew", "ReviewID": "R1IIVBHTREN9IZ", "Overall": "1.0", "Content": "I purchased this for security reasons and to have recordings to use, if necessary, in litigation with neighbors. The only way to record with this system is to press record in an app from a mobile device. In order to record events, you must constantly monitor the camera and anticipate events that need to be recorded.Swann sells access to cloud storage BUT ONLY for pictures taken based upon the cameras motion detector. These images provide an incomplete record at best and only events that trigger the motion detector are recorded. Given that the package advertises both the video recording capability and the Cloud storage, I assumed that I could use Cloud storage for video recordings. The packaging does NOT mention that the Cloud storage is an additional $59 per year, per camera. This is a good toy and would be a good way to monitor a sleeping child, but is worthless as a security system. I bought two cameras and was considering purchasing the Cloud storage until I realized this limitation. Instead, I will put the money toward products that meet my needs and try to recoup as much as I can from someone who wants a toy.", "Date": "June 21, 2013"}, {"Title": "Swann-450 Rip off not a security product.", "Author": "Jberks", "ReviewID": "RYQ0VB673A028", "Overall": "2.0", "Content": "I spent 2 hours setting this device up.  After I got it to work on the phone and ipad as well as installing the app for the computer i recognized that all you could do was video servalliance.  In otherwords, you cold sign in and see the camera and tell it to record and you could turn on the sound and hear which is great if you want to use it as a nanny cam or see realtime video.  However, in order to get the auto record based on movement or store large sets of data on the cloud you have to then sign up for the cloud service which they take you through the whole sign up process before telling you the cost.  So after you wasted 2 hours setting this poor image quality device up you then are told $59 dollars a year for each camera you want to set up.  If this is their cloud/SaaS plan they have it backwords the cost of the product is supposed to be a loss and the gain is in the recurring revenue model.  Your a bunch of Fools and I guarentee you this product will fail within a year.  Hopefully you get enough up front to cover your development but in the meantime you have just trashed your companies reputation since I will never buy another Swann product at least for the forseable future.  Next time clearly define what the product is offering including the fact that you have to pay extra for the cloud services that matter for most folks buying these products.", "Date": "May 19, 2013"}, {"Title": "Good video complement to an existing home security system", "Author": "Dirleton", "ReviewID": "R2OB5VCD7YSTWC", "Overall": "3.0", "Content": "My objective in buying the Swann product was to add video capability to my existing home security system.  Previously I had tried Netgear's Vuezone system, a potentially excellent product but currently with inferior cameras.PROS:* Very easy set-up* Excellent wireless camera with very good color clarity and adjustable frames per second* Product appears to be well built* Good night visibility* Motion detection range is good.  Captured images are uploaded to the cloud  (optional fee).  Provides a free 30-day trial of cloud support for each camera that is added.* Audio can be switched on or off* Mobile access* The iPhone SwannSmart application is pretty good and allows the user to control all functions of a camera remotely; however, you must have a strong wireless connection.  Cellular connections, even with a strong signal on Verizon's LTE, may not always allow remote changes.CONS:* Cameras require AC power which limits their placement.  If Netgear's VueZone improves its camera, which is completely wireless, they will become a very strong competitor to Swann* Each camera is completely independent.  If multiple cameras are installed, each one must be controlled separately.* If you want to utilize motion detection you must have cloud support.  Cloud support is priced at $59 per year PER CAMERA.  This fact is NOT CLEAR in their marketing material.  I have 3 Swann Cameras and would have bought more if Swann offered some type of volume pricing or a flat fee for cloud support.* I'm uncertain as to the quality of technical support.  I called once and was put on hold and told I was number 2 in the queue. However, after waiting for approximately 10-minutes, a recording came on and told me to leave a message and a number and my call would be returned.  I thought this was pretty bad support.* The motion detection is super sensitive and, even when on low settings, is activated for no apparent reason.  The result of this will be a large number of \"events\" (instances when the camera thinks it detects motion).  For this reason you will likely not want to use \"e-mail alerts\".  They will drive you crazy.  Additionally, the delete procedure for \"events\" is cumbersome and time consuming.  The best approach may be to not manually delete \"events\" as Swann says it automatically deletes events which are 30-days old.OVERALL:I've now had the product for several months.  I am generally happy with the quality of the product and it's ability to meet my objective as a complement to my existing security system.  I would recommend this product.", "Date": "April 2, 2013"}, {"Title": "Decent product not great...", "Author": "Steve A. Balsamo", "ReviewID": "R2Y9KVVLFCK4NE", "Overall": "3.0", "Content": "Bought three they work okay, not great, but they do work. A fast and easy wireless solution, easy to set up and use. I'd rate a 7 of 10...", "Date": "December 15, 2013"}, {"Title": "So Far So Good", "Author": "Donald R.", "ReviewID": "R2DB3TLMOIV31D", "Overall": "4.0", "Content": "After a rough start all went well during installation and it is performing as expected.  Acceptable video and viewing from my android smart phone is easy.  Would recommend.", "Date": "October 4, 2013"}, {"Title": "Not very stable", "Author": "Jackie Taylor", "ReviewID": "R272TF655H32VC", "Overall": "2.0", "Content": "Setup was fairly easy with an iPad. Could not figure out to set it up with a PC. The directions show setup with iPhone/iPad only. Once setup was complete, it works pretty good on the iPad. Viewing the video on a PC through the SwannSmart website is sporadic at best. First it recommends loading the iSecurity player or use the existing player. Sometimes it locks the browser, sometime it gets a fatal error, and sometimes it works however I have yet to get audio to work on the website. It works on the iPad but not the PC.", "Date": "September 3, 2013"}], "ProductInfo": {"Price": "$99.99", "Features": "Easy plug-&-play setup with free app download from the App Store or Google Play for mobile live viewing & in-app video recording to your 3G/4G device\nWi-Fi Internet camera packed with safeguard features for home & business security\nMount the camera on any flat surface, upside down, on the ceiling, or on a wall\nBuilt for life on the go with SwannSmart app by iSecurity+ for viewing on PC, Mac, tablets & Smartphones including iPhone, iPad & Android devices*", "Name": "Swann SWADS-450IPC-US Ads-450 LP Cloud Camera (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/41TWa3GtUeL._SY300_.jpg", "ProductID": "B009JTZLTS"}}