{"Reviews": [{"Title": "Zmodo 8 channel security  cameras", "Author": "Brian R. Kelley", "ReviewID": "R211U4DKTTVQB5", "Overall": "5.0", "Content": "I love this system but it is not too easy to install by yourself.  I am a high-tech savvy guy and the instructions they give you are not enough.  I had to go onto youtube and watched some videos on step by step instructions.  Also, when you put your information into the dvr make sure that you restart it, to save the info.  The dvr will usually ask you if you want to restart to save info. but while inputting the mobile info, I had to force a restart that saved the passwords.  The night vision is very cool and the cameras just plug right into the dvr.  They give you a lot of cord to be able to put a camera anywhere in your home...unless you own a mansion.  If you are wanting to record audio, then you will need to buy additional rca cable to do so.  It is a great system and well worth the price for the results you get.  Just understand that a little time might be required for installation.", "Date": "February 26, 2013"}, {"Title": "It's okay( get ready to work)", "Author": "GB", "ReviewID": "R8F1CMN9N5L12", "Overall": "3.0", "Content": "Night vision, is horrible. Customer service good when you finally get them on the phone, network set up is a nightmare,If you have a large home definitely get the longer camera cables..oh and if you want to monitor the cameras from say your iPhone or iPad, remember this...you need a static IP address! If you have one your in good shape, most cable Internet service providers have static IP addresses. DSL does not and you will have to pay your internet provider extra to insure that your IP address doesn't change because it will and at that point you will not be able to connect until you change it in your devices...they fail to tell you this anywhere in the process, it's something you will find out for yourself....with that said it does what it does and for the price it provides peace of mind.. If you are going to install this yourself get ready to work..I found out first hand why security companies charge what they do to install these systems....", "Date": "July 8, 2013"}, {"Title": "purchased for work; was satisfactory", "Author": "M. Houlihan", "ReviewID": "R1OD26TFK9527P", "Overall": "4.0", "Content": "For the price, this did what it was supposed to do.  The quality wasn't perfect, but I knew that might be the case before I bought it, based on the price.", "Date": "April 16, 2013"}, {"Title": "Zmodo 8 channel camera system", "Author": "JB", "ReviewID": "R2FOWECGDBV0DN", "Overall": "4.0", "Content": "I gave this system a 4 star. It works great. Just got this in, we set it all up, got it all going and so far so good. Networking is a bit trick to work with if you are a tech person if not find someone who is otherwise you will get lost. The biggest hassle was the cords and the wing screws they do break easily. I would have bought wireless but of course cost is the issue. Although later on you can make the dvr into a wireless camera system. It has good range, good quality, not the best but decent. It is weather proof, i know because it rained the day after i set it up and held up to a bad wind storm also. The back of dvr is a bit cramp and you might need to buy extra cords. The cords are not very good quality, they are thing and very easy to pull apart or tear. Email, alarm, and motion detection works awesome. Don't set up alarm for it all, it will keep you up at night if you do. Zmodo application doesn't work well for some phones i had to use ip cam viewer and its works great for this dvr. Overall im very happy w my purchase, but if i find a flaw i will be the first to spot it and let the company know.  One other thing i will point out is, the cameras do not have a mic.  If you want audio you need to purchase the audio, video, and power cables.  Those are the cables that have 3 connectors on them on both sides.  Otherwise use a stand alone mic and connect it to the dvr.  That is the only way the audio will work for now.", "Date": "June 29, 2013"}, {"Title": "Great system!", "Author": "Dianne", "ReviewID": "R2DU9K2ICYMTCM", "Overall": "5.0", "Content": "I give this 5star!  Why, the system works great, and the seller was prompt, and corrected any issues I had in a very prompt and courteous manner!  Now, my husband feels a more sense of security!  Great buy!  I will purchase from this seller in he near future again! I can watch the cameras from my laptop, via wifii , from any room at any time!  THANKS", "Date": "April 20, 2013"}, {"Title": "I should have read more reviews.", "Author": "rjb77", "ReviewID": "RI155A1XJGMRR", "Overall": "1.0", "Content": "I purchased this system based on reviews posted in Amazon and what the seller had to say about the system.  Posted info was VERY misleading as it says they are CCTV cameras and the box says CMOS. Cameras looked great for for three days and then the color started to fade.  Night vision is a complete fail.  It's advertized that it will email me if the unit starts to record any movement.  I will do that BUT only on one camera (very misleading).  Camera mounts are a complete waste as they slip easy and very easy to strip out the thumb screw.  When that happens, it's useless.  The hard drive erases everything at midnight.  The DVR resets at least twice a day and sometimes will not restart without turning it off and or unplugging the unit.  I've been trying to fix this on my own for the past week before I request a return and refund.  We'll see how that works out.", "Date": "June 20, 2013"}, {"Title": "Product is great, will recommend this product to friends.", "Author": "Cid L.", "ReviewID": "R2P0BW7M46ACFF", "Overall": "5.0", "Content": "Great product, works perfect. Easy to install. Make our home feel safer. I would recommend this product to any home owner or business owner, great investment.", "Date": "September 25, 2013"}, {"Title": "I like it", "Author": "Jose Ballesteros", "ReviewID": "R2R7Y9WM7OUBK1", "Overall": "4.0", "Content": "Its easy set up and user friendly.Love the motion detection feature.Keep;s my kids in check.I would recommend it to anyone.", "Date": "September 7, 2013"}], "ProductInfo": {"Price": "$469.99", "Features": "Instand email alert with photo if activity detected\nWhen everyone else is asleep, our cameras are watching closely\n24IR LEDs allow for 65ft automatic night vision\nThe metal housing is designed for indoors & outdoors use\n1TB hard drive allows for 24/7 recording over 16 days", "Name": "Zmodo 8CH CCTV H.264 DVR Security Surveillance Camera System & 8 Color Outdoor IR Security Camera System with 1TB Hard Drive", "ImgURL": "http://ecx.images-amazon.com/images/I/514GuAxSkcL._SY300_.jpg", "ProductID": "B009PJI03G"}}