{"Reviews": [{"Title": "good for easy short runs", "Author": "Aaron L. Dunphy", "ReviewID": "RODCEMYIV9KRR", "Overall": "5.0", "Content": "The cables are good for low quality cctv systems. If you are looking to cable up cameras over 420 tvl, I'd recommend RG6 coax or Cat6 with Baluns", "Date": "January 7, 2013"}, {"Title": "Works great", "Author": "Gadgets & Gizmos", "ReviewID": "R23VGMM0MP0U1N", "Overall": "4.0", "Content": "Like the 150Ft versions of this cable, the shielding for the wiring is minimal at best. But the product works as expected and when you're running it through an office with raised ceilings then you'll have no problems at all", "Date": "November 18, 2013"}, {"Title": "Exactly as Described", "Author": "Chris S", "ReviewID": "R3U6IP6QQ7R4FN", "Overall": "5.0", "Content": "I used these to hook up a few cameras on a Samsung security system (the included cables were 60', and two cameras were too far away). These worked perfectly. Only gripe is that they don't combine shipping. Worked perfectly otherwise.", "Date": "September 24, 2013"}, {"Title": "Decent Buy", "Author": "eric", "ReviewID": "R14PD5Y61SPE0J", "Overall": "4.0", "Content": "I have purchased two of these now.  The first one no issue.  The second one the BCN connector broke after I ran the cable through the wall.  I was left with connecting a new end.  I'd give the first one a 5star but the second one pulled it down a star due to end issue.", "Date": "June 19, 2013"}, {"Title": "Poor quality cable", "Author": "DR", "ReviewID": "R1UBO30PRHIZCE", "Overall": "2.0", "Content": "I bought this cable because the cables that came in my camera system weren't long enough for one camera.  This cable did reach, however, the picture from the camera is very poor compared to the other cameras.  I've swapped cameras and the issue did not follow the camera.  I would not recommend buying this.  Spend a few more bucks on a quality cable.", "Date": "April 1, 2013"}, {"Title": "monetk", "Author": "bruce", "ReviewID": "RFMT3VPPCQW4C", "Overall": "5.0", "Content": "verry pleased heavy wire verry good connectors verry strong at ends 100 &2 ' moor than i needed rubber tough", "Date": "February 19, 2013"}], "ProductInfo": {"Price": "$10.99", "Features": "100FT Black Cable for both video and power cable\nWorks with cameras that have DC power only\nIncluded: BNC/Power Cable and 2 BNC/RCA adapters", "Name": "Menotek 100FT Video Power BNC RCA Cable for CCTV Security Cameras", "ImgURL": "http://ecx.images-amazon.com/images/I/51AEVEyjJPL._SY300_.jpg", "ProductID": "B009ACBAKS"}}