{"Reviews": [{"Title": "Cheap IP Cam, Outdated WebUI, Drops WiFi, Locks up, JUNK!", "Author": "FerociousTek", "ReviewID": "R2VD7OWS077429", "Overall": "1.0", "Content": "Cheap IP Cam, Outdated WebUI, Drops WiFi, Locks up, 2 way audio does not work. Set it up as Wansview NBC521W using IPCamView Pro for Android which lets you control the PTZ (Pan & Tilt) and one way audio (listening). This IP Cam works best connected to Ethernet. Too many issues with WiFi. DON'T WASTE YOUR MONEY. Get a WansView or a Foscam.GOODIR works good and the PTZ motion (Pan & Tilt) when it doesn't lock up.", "Date": "November 28, 2013"}, {"Title": "a Real Owner Review", "Author": "Chris Swiontek", "ReviewID": "R302S453LQM21D", "Overall": "2.0", "Content": "well, first off. this IS NOT compatable with ANY other I.P. camera system except KaiCong cameras{MEANING you CAN'T add this to an existing Foscam,loftek,coolcam,wanscam,..or any other of the 17 different ip camera brands i tried this model with. {p.s. I Own and Run the Swan Technologies Corp. U.s.}  also it IS NOT compatable with Blue Iris AT ALL! or any other NVR software,except the one that comes with it on cd.it Does funtion on its own and with other KaiCong I.P. cameras of this model, tho.  The \"plastic shell\" that houses this camera is an exact molding of a Foscam 18w series, but inside, it is a generic knockoff of a Foscam O8w.  What makes this camera BAD isnt the build quality {cheap plastic,but lines are straight and looks solid},its the AWFULL FIRMWARE installed in the camera itself!  WORST FIRMWARE OF ANY CAMERA IN THE PAST 10 YEARS!(it looks like a 4year old wrote it}now,if you are going to build an entire system using nothing but this model camera, it would be fine. the IPCmonitor NVR software that comes with it is very good actually, but only works with KaiCong cameras.The wireless range on this model is \"hit n miss\" ,i first tested it with a Bountiful WiFi BWRG1000 {most powerful router you can buy without a FCC license}and the camera had a wifi range of 38feet line of site{no obstructions}.  i then tested it with a Linksys WRT54GL {running DDWRT firmware/ the second most powerfull router you can buy},and the camera had a range of 36feet line of site{no obstructions}.  the highest frame rate you will get on wifi with this model is 10.3 fps {thats it}. on Lan cable ,you will get 15-17 fps in VGA mode {640x480}. [side note- the wifi was always unstable-dropping connection every 10-15min.] was quite stable when on a Lan Line tho. the Night Vision and Low Light view is VERY GOOD ACTUALLY! =) NICE Bright Images in a NO LIGHT room.in a lit room however..the video quality is dreadful =( even adjusting the brightness controls,it looks like a really bad webcam extreamly pixelated and over sharpened.  but hey...for $36.99 what do you expect. its worth the price,but not much more tho.if you want an i.p. cam to try out and learn from,get one of these. but for any real surveilance system, stay away from this one.  p.s.  its is pretty easy to set up, and to configure for remote view buy the way.", "Date": "July 11, 2013"}, {"Title": "Less than worthless!", "Author": "Brad M. Wilmot", "ReviewID": "R2QW62QO8FIV1O", "Overall": "1.0", "Content": "This thing is cheap chinese junk.  It's not even a good knockoff (the wansview one is...)  Locks up constantly, has a user interface that looks like a 5 year old on acid wrote it, and its \"instructions\" aren't worth the paper they're printed on.  I do networking, system design, industrial controls, and other various high-tech custom work for a living, and I know what I'm doing, so trust me when I say go spend your money on something else.  If you want a cheap camera without a lot of frills (or cost), get the Wansview one.  It's very poorly documented as well, but its' a much better bet.  This piece of shit goes to the range with me next time I go... I wonder what it will think of a .308...", "Date": "June 28, 2013"}, {"Title": "Works great.............", "Author": "William D. Hunt", "ReviewID": "R3NUSNTT88EE90", "Overall": "4.0", "Content": "Very good product, I have it at a doorway intrance and it emails me pictures of anyone intering my facility.  I have not set up the video function.....", "Date": "December 18, 2013"}, {"Title": "OK, minor issue", "Author": "JG", "ReviewID": "R3OIP562SC4IR9", "Overall": "3.0", "Content": "It works OK. The camera takes two IP addresses when connected wirelessly, apparently the wired ethernet adapter advertises it IP address on the wireless network in addition to the wireless IP address.", "Date": "November 28, 2013"}, {"Title": "Fantastic", "Author": "Platehead", "ReviewID": "R3RL7TKXXORVQQ", "Overall": "5.0", "Content": "Great product for the price and the night vision is awesome!!  Product support will even remote connect to your computer and assist you step by step through the setup and any problems.", "Date": "October 31, 2013"}, {"Title": "Very good !", "Author": "jeff", "ReviewID": "R388V3E90TD2F5", "Overall": "5.0", "Content": "Easy to install with detect IP software + TPlink router. Very good for this price, and wifi works good up to 30 meters! (detection 35%)", "Date": "July 11, 2013"}], "ProductInfo": {"Price": "$42.99", "Features": "Key Specifications: Built-in microphone, mobile viewing, Pan & tilt, WiFi wireless\nFTP mail alarm, motion detection, infrared night vision, multi-channel display\nSupport Wifi; Support mobile phone watching, external microphone.\n11 IR LEDs(850nm) realize powerful infrared function, automatically turn on in low light, effective distance is 5 meters\nNet Weight: 750g [included in the weight of the power cable accessories]", "Name": "Wireless Hd Kaicong Sip1016 Network Camera Surveillance ip Camera Pan/tilt/ Night Vision Internet Built-in Microphone with Phone Remote monitoring Support Lens 4mm", "ImgURL": "http://ecx.images-amazon.com/images/I/41ZHFE9C57L._SY300_.jpg", "ProductID": "B009GYSYLI"}}