{"Reviews": [{"Title": "Great Value, Works Great, Easy to install!", "Author": "Chuck Guldin", "ReviewID": "RB1AXRLT8TNDA", "Overall": "5.0", "Content": "I would reccomend this unit to anyone that needs a low cost surveillance system. The cameras have metal housings and the IRs are adequate for distances up to about 20 feet. The DVR doesn't look cheesy and actually looks good. The users manual is a little bit sketchy with some chi-english and grossly mispellled or out of context words, but you can understand what they were trying to convey. There is plenty of help on you tube if you get hung up on some of its very trival nuances. Overall, easy to assemble and install, good (not great) resolution from the cameras (but, hey...you can always upgrade to better cameras and remember....you get what you pay for!) Nobody can sneak up on my house ever again!", "Date": "April 5, 2013"}, {"Title": "Great product for the price.", "Author": "Hernaalm", "ReviewID": "R18B4SJXLT4K8Q", "Overall": "4.0", "Content": "Advice is to get the upgraded cameras, but, its pretty good overall. You may not be able to get license plates from the front of your house to the street.", "Date": "March 7, 2013"}, {"Title": "good product, great price!", "Author": "wilna veloz", "ReviewID": "R1EVMR191VHNH7", "Overall": "5.0", "Content": "The camera is just great for the price, it is visible at night, the colors are perfect I just love the product!", "Date": "December 26, 2013"}, {"Title": "Very happy this dvr", "Author": "duke tran", "ReviewID": "R1LXTS74H6UG2M", "Overall": "5.0", "Content": "Excellent products for the price can't be better you will be surprised  when the machine up and running have good colors.", "Date": "December 19, 2013"}, {"Title": "Manual is a mess", "Author": "IncognitoJedi \"Your hero\"", "ReviewID": "R41GDXPNHTIKQ", "Overall": "4.0", "Content": "Could use better instructions online and on the manual since it took me forever to instal them. They work just fine", "Date": "December 11, 2013"}, {"Title": "Great", "Author": "AXID22", "ReviewID": "RNTEAVNSUDWB5", "Overall": "5.0", "Content": "I have alwasy loved these guys solutions. O have them at evryone of my locations plugged into a battery back up.", "Date": "November 1, 2013"}, {"Title": "Great price..", "Author": "Gina", "ReviewID": "R2Z5K0PEDVLRF1", "Overall": "5.0", "Content": "Very clear picture during the day. The night mode isn't the best, however, for the price it's a great little package. No complaints whatsoever.", "Date": "October 26, 2013"}, {"Title": "Good cameras", "Author": "Jose M.", "ReviewID": "RYJUEZ1P06QCP", "Overall": "5.0", "Content": "Cameras work good although the instructions are very confusing but that wasnt a big problem, they were easy to connect, and affordable.", "Date": "October 12, 2013"}, {"Title": "My experience", "Author": "Tad Kinahan", "ReviewID": "R33HV3NZLGMCU6", "Overall": "4.0", "Content": "one camera has lines that shows up on the screen The directions arent easy to understand unless you have a backround with electronics But a good system for the price.", "Date": "August 27, 2013"}, {"Title": "surveillance camera system (good purchase)", "Author": "Denise \"denise\"", "ReviewID": "R23W8Y2TSCDOR5", "Overall": "5.0", "Content": "It was easy set up, clear pictures.  Good purchase for home use.  Not sure yet about audio still working on it.", "Date": "August 19, 2013"}, {"Title": "Zmodo 4CH H.264 DVR Security Surveillance Camera System", "Author": "Gloria", "ReviewID": "R1B3UJQZFFA0EG", "Overall": "4.0", "Content": "The item works very good. It would be nice if it came with a monitor. otherwise it is very nice.", "Date": "August 13, 2013"}, {"Title": "Buy it u will love it", "Author": "manny", "ReviewID": "R23MOHB86VTKZF", "Overall": "5.0", "Content": "To every one this is the easiest product to use  so  if I was u buy it I did good luck", "Date": "July 11, 2013"}, {"Title": "Best deal for 4 cameras with a DVR!", "Author": "Alan Toaca", "ReviewID": "R2R7YNP11A1MXQ", "Overall": "5.0", "Content": "Best deal for 4 cameras with a DVR! They are wired so installation isn't quite as easy as wireless of course; however the wires are pretty long! I ran them through my attic it was a PITA but now my wire's are not exposed to any of the elements.The picture quality is average ish as expected from a unit of this level. I have a Uniden 2 camera wireless system that I bought for $100 more and it has no DVR and the picture quality is about the same as that one.Wireless camera's have disadvantages as people (mainly crooks) can look at your wireless camera if they have the same or a similar receiver! That being said they can know where to find the 'blind spots.'This is why I purchased this wired setup. More security, no one peaking into it besides me and for the value you can't beat 4 camera's!If you are wanting to watch the feed on your TV you will need a TV with VGA inputs. Also the VGA cord is not included you may want to pick that up.I haven't set up the iPhone viewing yet but I will soon. For the price I'm happy I can see all around my house with my 4 camera'sVery good buy!", "Date": "October 7, 2013"}, {"Title": "Surveilance Camera", "Author": "CarolBrown", "ReviewID": "R316DELB72F6W0", "Overall": "4.0", "Content": "I chose the I like it rating because I like the product and it is doing what I bought it for", "Date": "April 22, 2013"}], "ProductInfo": {"Price": "$277.50", "Features": "Instand email alert with photo if activity detected\n24IR LEDs allow for 80ft automatic night vision.\nWhen everyone else is asleep, our cameras are watching closely\nThe metal housing is designed for indoors & outdoors use\n500GB hard drive allows for 24/7 recording over 16 days", "Name": "Zmodo Complete 4CH H.264 DVR Security Surveillance Camera System With 4 Outdoor Night Vision IR Security Camera 500GB Hard Drive", "ImgURL": "http://ecx.images-amazon.com/images/I/41l2tfbD6hL._SY300_.jpg", "ProductID": "B00A20M7W2"}}