{"Reviews": [{"Title": "Great for carport surveillance!", "Author": "Petite1", "ReviewID": "R1X7L89LPXZTO", "Overall": "5.0", "Content": "I purchased this product because I was looking for a relatively low cost surveillance system to keep an eye on my downstairs carport in my condo complex.  The challenge was that the condo rules do note allow me to mount anything on the out side of the building.  With a little creativity on the application side, this product worked out perfectly.  The camera is relatively small in size which was perfect.  I was able to mount it on the window sill of my upstairs bedroom and leave the window cracked open so the night video recording was not distorted.  I removed a small piece of the window screen so the camera had a clear view, and the system works like a champ!  Very easy to set up with the wireless application.  I had the remote viewing feature via Skype working in a matter of minutes from my IPAD and iPhone.  I am a single female with intermediate tech skills and this system was very easy to install.  I strongly recommend this product to anyone who is looking for a low cost high quality surveillance system.", "Date": "June 9, 2013"}, {"Title": "Wow, this is so much better than I expected...", "Author": "Matt Anderson", "ReviewID": "R2MZT9ERNOUCM6", "Overall": "5.0", "Content": "I read some not-so-great reviews of this on Amazon and was a bit worried even though it received overall good ratings and reviews. Here is what you need to know...1. The range isn't great if you are going through several walls in your house. I can put 5-6 walls between the camera and receiver (the LCD screen) and it will stretch from one end of my house to the other (camera outside, TV inside), so about 60+ feet, and it works fine and I'll see 2-3 out of 5 signal bars (which indicate the signal strength). But, I will see some interference with the receiver within a few feet of other electronics at this distance, under that 60 foot span and interference doesn't seem to be an issue. Take a bunch of walls out of the equation and the range seems to go 100+ feet with ease.2. It's a digital signal so rather than getting a bad picture when the signal goes week you'll either lose the picture or it would appear that the framerate drops. This is actually a good thing since you still capture video (and audio) even without a perfect signal. Overall, the framerate isn't spectacular. It's way better than most \"caught on film\" type surveillance footage we've all seen (I'm looking at you Pentagon 9/11 footage) but I'd guess we're talking about 10-15 FPS at best? If the signal drops it goes down to just a few FPS (roughly).3. You get a 2Gb SD card but you can use up to a 32Gb card to get up to (their claim) 60 or so hours of recording, at which point you can set it to overwrite the card and start over.4. The cameras capture audio VERY well. I could hear (while I watched) people walking 50-75+ feet away, you can hear cars coming long before they appear on your street, you can hear anyone walking or talking anywhere around the camera (50-75+ feet easily). You can push a button and talk back so that the camera outputs your voice to them as well, great for a front door camera!5. The recording functions work well, but once recording you can't do certain things like change the volume or change cameras. So if you set it to record you are stuck on whatever screen it is one (which will be 1 camera at a time or the 4 camera split screen). It's easy enough to stop/start recording if you needed to change something but seems odd not to let me adjust the volume while recording. If you set it to use the motion record then this isn't likely to be an issue for you.6. The motion sensor does have some limits so it would be fine for anyone close to your house/camera but things across a street (for example) don't seem to trip it. This makes sense, it's really the same technology as a motion sensing security light so until you are relatively close it doesn't trip the sensor.7. The night vision works great and it seems to light up a decent area. It normally shows up in color but night vision will be black and white as usual. In all cases, the picture is very good, very clear. On that note, it's a 640x480 image the cameras send back. Not exactly HD, but pretty good for what it is.8. Setting it up couldn't be easier and this is one of the few items that truly is plug and play. Plug in the camera power. Plug in the TV power, flip the TV to on. You're done. It's all paired and just works.Overall, this thing is awesome and for the price you can't beat it. I'd highly recommend this for casual surveillance of your house, like watching front door, checking for package deliveries, keeping an eye on a normal sized front yard area, etc.", "Date": "July 6, 2013"}, {"Title": "Excellent Product", "Author": "Donette C. Considine", "ReviewID": "R1TSVBQ4G4IPBB", "Overall": "5.0", "Content": "I researched so many surveillance/systems that I had myself doubting that any system would perform well. I finally, out of desperation, purchased the Lorex LW2731 because I couldn't handle reading anymore reviews and just needed to be done. I am so glad that I purchased this system-it is awesome for my needs. I have a small business and want to know when someone enters the building. The motion detector works perfectly for me. It detects quickly and the monitor gives an audible alert. The monitor is excellent because it's always visible from my desk. You can also control the volume of the audible alert-several volume options which is very nice.I was concerned about setting up the system, so imagine my surprise when I connected the camera to power; then the monitor, turned on the monitor and done. It was the easiest set-up I've ever done for an electronic item. I am very pleased and plan to add an additional camera to watch over the store showroom soon.", "Date": "July 23, 2013"}, {"Title": "Great picture quality but questionable security", "Author": "Colin Brown \"Colin Brown Microsoft MVP\"", "ReviewID": "RBP7P3EXRHNG8", "Overall": "3.0", "Content": "The Lorex LW2731 package comes with a 7 inch full colour LCD monitor and one security camera.  The monitor is a bit on the small side coming in at 7 inches but supports up to 4 video feeds. The camera is also a tad on the largish side measuring around 4 inches (much larger than a webcam) but has built in LED lights for illumination.When I received this unit I thought I would set up the camera at the front of my house on the porch overhang pointing at my front door.  This proved to be a bit of a pain in that both the camera and the monitor require mains power (no battery option).  The power adapter for the camera, although it has a fairly generous amount of chord, was not enough to put the camera where I wanted so I had to rethink.  Another problem with this is that you end up having to drill a hole through your wall in which to put the power cable, so not a quick easy solution.This leads me to another point. If a thief or whomever is determined to break into your house, then its a very simple case of just having to snip the wire and the camera won't work.  It would have been much better for the camera at least to run off batteries.The wireless part of this unit is the video feed from the camera to the monitor, not the monitor to your home network.  You have the ability to view the camera feed over skype (a good option) so that you can see your video feeds from anyplace, however in order to do this you must hook the monitor into your computer (cable supplied) and leave your computer running all the time (you must also remember to turn off power saving features on your computer).The video quality that the camera transmits is excellent. Better than some of the security camera footage you see on the news and the camera works very well whether in bright light or with the aid of the built in LEDs and sensor at night.The range of the wireless feed seems to be good.  I couldn't find anyplace in my 3 story house where I couldn't pick up the video feed, even when I placed the camera in the top corner of a bedroom on the top floor and took the monitor down to the opposite corner of my bottom floor, so it was travelling a fair distance and through a lot of wood and concrete.If you are thinking of buying this unit to monitor the outside of your house (which I think most people would), then be prepared to have to do some work and drill holes in your walls to do this.  Also be prepared to have to rethink where you wish to put the camera due to the power cables length. This is a major shortcoming of this unit in my opinion.If you are just looking to monitor the inside of your house or small business then this unit will work great, with the addition of some extra cameras.Overall then, a good security system once setup but has some fairly big flaws.", "Date": "February 21, 2013"}, {"Title": "very cool product", "Author": "jason", "ReviewID": "R3UYE86VE2SSJA", "Overall": "4.0", "Content": "I have been having trouble with stuff getting stolen over the past few weeks.  So I started looking at cameras to try and see if I could figure out who was behind it.  I wanted a wireless system cause I didn't want to have to run wires.  This system you still have to run the power wire to an outlet so it is not 100% wireless but still good enough.  The system is very easy to set up.  I will probably not use the Skype feature cause when its hooked up the system will stop recording.  The night vision is really good.  The motion sensor is pretty sensitive. I have mine turned down and at night bugs flying by set it off.  Overall I'm pleased with the product and I hope I can catch the thief.", "Date": "September 13, 2013"}, {"Title": "Great security, a little sensitive", "Author": "Bill", "ReviewID": "R2RO1UBBYDHZS0", "Overall": "4.0", "Content": "I purchased this system to supplement my layered home security. The night vision is unreal , mind you I only have a 100x100 ft lot. The only problem I`m having is the cameras seem to record at will sometimes. I have them set at the lowest sensitivity settings. I was hoping for a little better \"real motion\" recording as it seems to record in 2 second intervals. I purchased a 32g card and its on over rite set to a 15 second record time so I figure Ill get about a month before it starts over. The signal strength also jump from 4 bars to nothing as it cycles but I haven`t lost the picture. The false detects make reviewing a little tiresome as do with the false alarms. I do think if they could get the motion/heat recording a little more accurate ,it would be a perfect system. The sound recording is also top notch.  Overall I`m pleased with the system and it adds a little more piece of mind to my overall security.Bill", "Date": "July 28, 2013"}, {"Title": "Waste of Money - Glad Amazon is on my side!", "Author": "PW", "ReviewID": "RXN3QK3CUYYYR", "Overall": "1.0", "Content": "This is not a good product. The first thing I read in the user's manual was the indoor/outdoor cameras were not weatherproof. I did not see this information in any of the information on their product page.They were weather-resistant. You can not place them outside in direct rain. What good is a home security system that cannot be used inside and outside?I decided I would try to use them in protected areas so I would move forward. Then more fun happened. I paired the 3rd & 4th camera to the receiver pretty easily. Checked out the system and it looked pretty good. Then I turned the system off and moved the cameras around the house to see how it looked. When I turned the system back on it didn't work. The receiver had locked up with a black screen and the menu touch key would not work. Nothing worked it was locked up.The manual said they had 24/7 tech support. I called the Lorex tech support number and got a recorded message - they work Monday thru Friday 8 to 8 Eastern time. Unfortunately it was Friday evening just after 8pm eastern - actually 6pm where I live. Tried their e-mail same run around. Fill out a ticket and we will get back to you.NO TECH SUPPORT!I packed this up and sent it back - thank you Amazon for this service. I will continue to research home security systems, but I will stay away from Lorex. With no tech support, I don't care if they have the best product in the world - they are not customer oriented.", "Date": "December 7, 2013"}, {"Title": "Monitor is Great Feature, One Camera not Enough", "Author": "Scott Bright \"scottypotty\"", "ReviewID": "R186VL0Y152Z0J", "Overall": "4.0", "Content": "I also have the Lorex LNC104 LIVE Ping Wireless Network Camera camera from Lorex so I can't help but compare it to that. I really like the LNC104. It is wifi and comes with easy to use software for the PC and Android. Extra cameras can be viewed all at once within that software. The LW2731 system uses Skype instead, so I can't add it to my camera network. That would have been really cool.The coolest feature of the LW2731 system is the monitor it comes with. It was also very easy to set up. I had the system up and was watching my front door in minutes. You can move the monitor around with you but it needs to be plugged into AC power. It will need to be plugged into the PC via USB to use the Skype remote viewing software. This means the PC must stay on as well. Unlike the LNC104 which is a WiFi device that only needs an internet connection to broadcast.This system is very nice for a self contained camera system due to the nice monitor. It is nice not to have to launch software to monitor the camera since you can mount the monitor anywhere you want.Notes:- System only comes with one camera. Extras are not cheap.- Would be nice if it used the same remote monitoring software as the LNC104 so that they could work together.- Camera is indoor/outdoor which is really nice.", "Date": "April 18, 2013"}, {"Title": "Not related to seller but about the product", "Author": "Cathy", "ReviewID": "RT2UADQDO9YRR", "Overall": "3.0", "Content": "I purchased this product from Best buy. It had it all. I hooked it up and was excited to view it on my Ipad.. Turns out as of today and as of the update of mac 10.0 OSX update, the program to use on Ipad, Iphone, etc, no longer works and today I literally had to wait on hold for technical service for 54 minutes (as the recording told me) Then we went through the trouble shooting guide, with a thick accent Asain guy and he told me that they are aware of the problem and it is posted on their website.. I replied, \"Yes, but not posted under your product t Best Buy warning the buyers, saving them a trip back to the store, hours researching the problem, hour on hold waiting to talk to him and now holes in my home where the cameras use to be.\" At the end of the day, they are aware of the problem but have NO IDEA when they are going to be able to have that part of the cameras back on line for wireless devices. I wasn't going to wait around for an update with a unknown time frame. Buyer for this product BEWARE.. This is not against the seller just advising about the product and what I learned today. Call tech support before buying this to ensure you are getting what you paid for.", "Date": "November 12, 2013"}, {"Title": "A great (limited) product", "Author": "Joe \"Fan man\"", "ReviewID": "R2W2EHGEKELJFZ", "Overall": "4.0", "Content": "I've only been using these cameras for about 3 weeks but they are EXACTLY like the ones that came with my LW2930 set up.  From what I figured out, these will only work with the Lorex LW2730 and LW2930 systems.  The difference between these 2 systems is the screen size.  NO OTHER CAMERAS will work.  Here's something to know on the Lorex LW2930 system:  It took a few days to get the cameras working like they should.  The motion detector settings are trial and error.  The clarity of a still frame is great but functional video is something else.  The recorded video will but more choppy then you'd want and the responsiveness of the motion detector is going to be slower then you like.  For example, when my wife pulls into the driveway in her car, the camera will click on (motion sensor) when the car is almost past the camera.  Also, sometimes when the camera's motion clicks on, there's a white-out screen for about 1 second.  It doesn't sound like much but that first second is crucial to catch someone's face that's walking up to the front door.  On a plus, the 2 way audio is MUCH better than you would think.  You get used to it and love it!  I sit at my desk and listen to the sounds at each one of the cameras and it's pretty cool.  Zoom:  it's not REALLY a zoom.  It's more like a screen expansion with crappy pixilation.  In summary, the cameras are pretty cool but this is not a high powered system.  It's for CASUAL home use.  If you live in a high crime area and are nuts about watching your car then get a WIRED system.  The hard wired systems are more real-time, responsive and clear whereas the wireless systems show quick movements to be MAJORLY blurred.  Let me put it like this, if I sprinted from the beginning of my driveway to the end, a wired system could CLEARLY show my face and body where a wireless (read:  Lorex LW2730 and LW2930 systems)would display a useless blur.  Also, the motion detectors give a ton of false readings.  I have one of my cameras near a light and the bugs set off a bunch of false motions (or, should I saw, useless recordings).  Plan on upgrading the memory to a 32 MB card.  I'll probably be able to get 6 weeks of 30 second video clips from 4 different cameras.  Are you going to monitor your new awesome home camera  system with a smart phone?  Not unless you leave the Lorex LW2930 plugged into your computer and your computer stays powered on 24 hours a day.  Does anyone REALLY not turn off their computer?  In summary, Do I regret spending the $500+ on the whole system?  Well, no. . .it's a fun toy and much better than what I had before (which was nothing).  If something happens then it's good to have something to review.", "Date": "August 25, 2013"}, {"Title": "Horrible customer service", "Author": "DrKei \"K Style\"", "ReviewID": "R1W9WQG6918YW4", "Overall": "1.0", "Content": "I bought this set on FEB 10 and was very excited and had it wired up and install.  The setup isn't easy and I have to cut the power cord plug to get power from inside the house.After the hard part is done.  HERE is the PROBLEM.I am 20ft away from the camera behind a drywall.  My bluetooth get better range then this.  I got no signal.  Moved 1ft closer I will get 2-3 bars.  In order to work I will need to hold it in mid air.Bad just got worst!!!!  I called the customer support and my support was transferred to three different departments than back to sales.  Who wanted additional $70 an antenna to TRY and see if this Might solve the problem.  I told them this is unfair then I was transfer to an answering machine.  As you may guess, NO response!Then I get an email for a RMA.  After hours of cutting and wiring, I need to return the whole system over a signal and leaving holes all over my house.  Which they could of just sent an antenna.I gave them over 4 chances to help me and all I got here paid more money for a unfinished product.  The unit is easy to use only need. 1ft boost of signal.Bad customer service, bad company model.  $ 1st and customer 2nd.  I was even planning on getting another set for inside the house but now I need to research all over again.", "Date": "March 6, 2014"}, {"Title": "The ups and downs of a good, reasonable cost security system.", "Author": "J. Lee \"imajeel\"", "ReviewID": "R3RKGLJ77SD4M", "Overall": "4.0", "Content": "Security systems are one of those things that you really need to consider your objectives before investing in them.  Do you want a babysitter or dog cam? Do you want to be able to see who's at the door? Or if someone is sneaking up to a window?  Do you need multiple viewpoints, motion sensitive recording?In my case, I simply wanted a system I could mount by the front door, so I could see who it was there and whether I wanted to respond.  For me this works perfectly for that.  I can sit in my office and see (and talk with, if I choose) the person at the front door without having to open it.For me, here are the ups and considerations of this system:- Easy plug and play: It's as simple to use as they say.- Does what its supposed to with good quality: the motion sensor and record works as stated, reception is always clear- Reasonable cost for a security system, even if I want to add a camera for the back door (both as a monitor and to see when the dog wants in:-)) It's only another $150 or so, and I can monitor it off the same screen.Really considering before buying:- How you want to use the system: Do you need the ability to interact with the person which this one has?- Do you want it to record? This one does, and I find it a useful feature for when I'm out.- Where you want to place the camera, and if there's a nearby electrical socket near it.  The camera does require one, and is probably one of it's biggest downsides.  I wish it had a battery option.- Do you want to send a clear \"security\" message, which this one does - or is the use you have in mind more for a hidden cam - which I have a tough time imagining this one being.All in all: An affordable security system that does what it promises.  Like all security systems - consider what your true objectives are and what you are willing to pay to accomplish them.  I think this is a great starter security system, if you have the electrical sockets to accomodate the camera(s) and/or a convenience to be relied upon for monitor and record traffic coming in or through your home or store entrance.", "Date": "May 22, 2013"}, {"Title": "Review of Lorex LW2731 Live LCD SD Recording Monitor and Wireless Cameras", "Author": "Steven Rosch", "ReviewID": "R2ACGY0YS56OXT", "Overall": "4.0", "Content": "Our normally placid neighborhood recently experienced some jerk who went around stealing packages from people's mailboxes during the Christmas season.  We decided to purchase a home security system.  According to various reports, the LOREX system provided the best picture quality.  Since the package only came with one camera we ordered a second camera and a 32gb card.  The packages arrived on time and everything seemed to be there.  However, one word of caution....the cameras need to be plugged into a wall receptacle.  For most of us that means running the powered wire through the exterior wall of your house.  For a stucco cladded house like ours, a spade drill bit 5/8\" needed to be purchased along with a six inch carbide drill bit.  Get some spray foam insulation and a small tube of silicone as you will need to fill up the new hole in your house.  LOREX's directions don't state that..it's not a big deal.  Also, the camera's are not weather-proof, they are weather-resistant.  That means you need to place them in a sheltered area like under an eave or make a 'hood' for them.  Another thing that we did was to buy a wire organizer to place the powered wire in since it will be outside and we figured it needs to be protected from the elements. The home stores have flexible aluminum to run the wire through, if you prefer.  So, if you don't have a pair of snips in your tool box, that's another thing to purchase.  Another thing to consider is how far is the wall receptacle from the wire?  The power cable is in two parts - one part which runs from the camera and the other part connects to the transformer. Its about six feet in length.There is a weatherproof connection (male/female) between the two wires.  You may need to run an extension cord or a power strip.  Once you got all that figured out you can mark the holes for the cameras mounting plate, attach the camera to the plate, hammer in the plastic anchors, then screw in the three screws to hold the camera to the wall, then cut through the wall to connect your power source. Run your hand over the front of the camera.  You should hear a clicking noise as the camera switches to infrared and back.  Now the fun stuff...if you buy a second camera you have to pair it first with the monitor.  Don't try this if your outside hanging onto a ladder - trust me...When you get the packages, take them out, plug them in, and make sure that the cameras are working.  While the instruction booklet passes the plop test, a few more pictures for those of us who are more visual than verbal would've been helpful.  I managed to hose up the monitor and cameras on Christmas eve...LOREX appears to want its users to open technical support cases through the Internet as the phone number just rang and rang... I opened a ticket online and they eventually got back to me (as the announcer on SpongeBob says - Three days later )...by that time I figured out that the monitor is connecting to our WIFI therefore it must have a reset button.  It does, an extremely tiny hole in the back of the monitor which you can access with a pencil point.  Once I did that I was able to get the cameras back online and paired.  We were impressed with the visual clarity of the cameras.  Make sure you have the monitor with you when you decide where you want to put the camera.  The field of view is wide and quite large.  We use the motion detector feature.  Any movement causes the monitor to record a 15 second burst.  At this time we are using the monitor in a standalone mode.  You can connect the monitor to a PC as there is a USB cable.  There is a DVD which will load the drivers onto your PC (Windows).  The DVD comes with a bunch of videos to help with the setup.  As of now, I haven't used the PC to record.  There is a feature which allows you to use SKYPE to view your cameras from any remote location, say from your smart phone or another PC....I haven't tried this out yet and I was leery since SKYPE was hacked recently.. Overall, the LOREX product does what its supposed to do...provide the homeowner with a low cost security platform and act as a deterrent to neer-do-wells.", "Date": "January 7, 2014"}, {"Title": "Great cameras for wireless Lorex systems", "Author": "Matt Anderson", "ReviewID": "RPMH1GVMW8RBK", "Overall": "5.0", "Content": "If you have a wireless Lorex security system and need an extra camera like this then you probably can't find a better deal than this one. Works great, fair range, completely wireless (excepter for power of course) and super easy to pair up with the receiver.", "Date": "July 15, 2013"}, {"Title": "Great Camera!", "Author": "Rick", "ReviewID": "RXVL84QJDZOGJ", "Overall": "5.0", "Content": "Works like a champ! Glad I got a good one that works this time. First one would not pair up!", "Date": "May 4, 2013"}, {"Title": "Good system with some drawbacks.", "Author": "R. Stalnaker", "ReviewID": "R2ZX0WLWX638JA", "Overall": "4.0", "Content": "Bought this for $449 and extended warranty for $49.  It comes with two cameras already paired to wireless receiver.  The other two cameras must be manually paired, but this is as simple as plugging them in, setting them within a foot of the receiver and pressing a few buttons.  Installation wise, if going through walls or brick, you will need as a minimum an 3/8 inch drill bit.  An 1/2 will make things a bit easier.  The mounting brackets are ok, they  would be better if they brace was adjustable both horizontal and vertical.It is \"wireless\" as far as audio and video but you still have to run a power cord.  The 3/8 drill bit is the size of the power connector. I used one for the front porch, one for back porch and one above the garage.  The motion detector is very sensitive.  The front porch camera  picks up cars driving down the street  (driveway is long enough for two vehicles) even on the lowest setting.  The daytime picture is very good.  At night it switches to a black and white picture which is still quite good.A big negative I found which wasn't mentioned in the ad was this, I decided to install the last camera on the inside of the house looking out thru a window.  Daytime was fine, however when it got dark and the infrared kicked in, the camera showed a reflection off the glass and showed me my miniblinds.  I put up the blinds and it still showed the curtains.All in all not a bad system, maybe a bit too sensitive on motion detection and disappointed that I can not mount inside a window to look outside.", "Date": "November 10, 2013"}, {"Title": "Don't buy used Lorex cameras", "Author": "Tina L. Harlow", "ReviewID": "R27LHOSO3FAFKQ", "Overall": "1.0", "Content": "I had to return these.  It was obvious they were used and not new.  I was unable to pair them with my existing system.  Evidently, once they've been paired they have to be factory reset and that must not have happened.", "Date": "October 10, 2013"}, {"Title": "Junk! Don't waste your time!!!!", "Author": "M. Horton", "ReviewID": "R2G10BXIQLVSQS", "Overall": "1.0", "Content": "I purchased the Lorex Live SD LW2932 system and had it set up in less than 10 minutes....including the addition of two Add-On Wireless Accessory Cameras...unfortunately, the system only worked for less than 10 minutes, went into a continual reboot sequence and all camera feeds were lost. I spent another 10 minutes packaging this piece of junk back up and promptly returned it. Good luck with Lorex customer service...I never did get a human to talk to...so I gave up...not worth it to give Lorex anymore of my time spent dealing with their garbage. This was my second attempt with a Lorex security system....there will never be a third.", "Date": "August 8, 2013"}, {"Title": "Simple to use. Works well, even as a baby monitor", "Author": "Jesse D. Walker", "ReviewID": "RNN6OT029KHB3", "Overall": "4.0", "Content": "Which is the use I've put it to so far. I've only used the basic features, but here are a few comments that might be helpful:It's incredibly easy to set up and get working. Basically, you plug the camera and viewing tablet into power sources, and turn them on. Your image from the camera comes right up.Each device must be powered full-time. No battery option on either end (baby monitors are normally more portable, but this thing isn't really designed for that specific purpose; it's more for permanent installation in a security setting).I like the large viewing screen. Dedicated baby monitors almost always have tiny screens, and many security systems don't include their own screen by default at all. If you want to view the signal with those, a computer or television hookup is required. You can still connect to and display on those devices with this monitor, but it isn't required.The intercom feature is handy. You have two way audio communication between the monitor and the camera, by holding down a button on the monitor to broadcast out the camera's speaker. Actually works fairly well.There is a slight time delay from the camera to the screen. Probably about a half-second or so most of the time.For security purposes, you're likely going to want to purchase additional cameras for more coverage. Up to four feeds can be conveniently displayed at once on the monitor. This set only comes with one camera, so keep that in mind when buying, or purchase a set that includes more cameras.Anyway, the set works fairly well. Plan to read the manual (included in print form, and seems fairly thorough) if you're planning to use any of the more advanced features.", "Date": "April 7, 2013"}, {"Title": "Decent design, but limited wireless range", "Author": "Amazon Customer \"Marty B\"", "ReviewID": "R22EXDTGFNS8UM", "Overall": "2.0", "Content": "I live in a nice neighborhood, but there have been some recent, strange disappearances of package deliveries. I'm well protected with an alarm system and a more persuasive physical deterrent if someone makes it through the door, but I want to be able to see who approaches my home when I'm not around. The Lorex wireless system seemed to make sense, mostly because of the architecture of my home. I don't have a basement or an attic, so laying video cable from cameras to a DVR won't easily work for me.So, I got the Lorex system and was immediately impressed with the quality look and feel of the camera and the receiver/display. To test the unit before permanently installing it, I plugged the camera into an outside socket near my front door and then turned on the receiver in my house about 35-40 feet away. Between the outside camera and the receiver was, of course, one exterior wall and one interior wall. No significant amount of metal or electrical wiring is in this interior wall, however, at this 40 foot distance, I had to hold the receiver up to get a signal from the camera. I moved the receiver to about 30 feet and the signal was good, but would occasionally, momentarily tell me that it couldn't receive a signal from the camera. When I moved the receiver to the room where my computer is located, (where I really want to place the receiver) approximately 65 feet from the camera and the addition of one more interior wall, no camera signal could be received at all.So in its initial test, the system won't work for me. According to Lorex, the wireless range might reach up to 180 feet indoors, but I couldn't make it one third that distance. I can't very well use this system. With such a limited wireless range, I would have to place the receiver so close to the front door of my house that anyone forcing their way into my house could simply remove the SD card from the receiver. In order to connect the receiver to SKYPE, it needs to be hard wired to a PC, and that wouldn't really solve the problem anyway.Other issues with the system:- The receiver settings are a bit non-intuitive, but once you get the hang of moving around the screen, things seem to fall into place.- The motion detection recording has a slight delay in kicking in. I recorded my wife returning home and all I saw on the replay was her moving past the last 30% of the screen. Had she been a burgler, I wouldn't have been able to identify her. There is a setting to increase/decrease the sensitivity of the motion detection, and I had the daytime sensitivity set to Medium. The only setting for the nighttime motion detection is Low, so it is questionable how well this would work when the sun goes down.Lorex is known for consumer friendly monitoring systems, and their setup manual is well organized and easy to follow. Yes, the onscreen controls are a bit odd, but once you get your system setup correctly, you won't have to mess with that often. The display panel is clear and bright, but don't expect studio quality recording from the camera.... it is a security camera and nothing more - slightly better than what you see on liquor store holdup videos recorded in 1998 and played back on cops and robbers programs.Other users report getting good range from their systems. I could possibly have a lemon, as my house is pretty wifi signal friendly. But based on my 30 minute test, this dog won't hunt.", "Date": "January 24, 2013"}, {"Title": "Pro do it yourself home surveillance system", "Author": "Scott", "ReviewID": "R4DGX203HWTGH", "Overall": "4.0", "Content": "This is a pretty impressive setup and is so simple to get up and working. It has tons of features and extras, more than you'd expect. Upon opening the box you will have everything you need to get up and running fast. Depending if you are mounting it indoors or outdoors will add to the time it takes to be running. I had my system working in 10 minutes literally. I didn't mount the cam to anything but have it in a windowsill. The only thing I needed to hook up was the mounting swivel base, the power adapter for both the cam and the LCD. Everything was paired and already configured so for me it was plug and play.The instructions are well done in both explanations and descriptions/photos/troubleshooting. They included a fast setup guide which was simple too. They did show that you need to attach the antenna's but they were already done so those steps weren't needed. Less to worry about, although i made sure they were tightened.When you turn on the unit, there are lots of touch screen buttons including: menu, recording, volume, split screen and intercom. There are way more features than expected like the 2 way audio intercom. So there is a speaker and mic in both the cam and the lcd base unit. You hit a little button on the lcd screen and you can talk to someone close to the cam. This feature is great if you have it setup outside as a door monitor.There's an SD slot in the back to put memory cards in to record video weather manually or if you setup a specific time to record as well as setting it to record any motion. A 2gb card is included which will record about 3:52 of footage. You can use up to a 32gb card which will record around 63 hours. This is for a single camera only, if you add more then of course it lessens the more cams you have hooked up.There's a screen saver mode which also lets you use it as a digital frame but your images are stored on the same card for recording so be aware that it will use memory and lessen your record time. When in screen saver mode you can have it activate back to the regular live screen when the cam senses motion (to upload photos you have to use a pc, mac isn't compatible with the software but there may be a work around, I haven't tried it). You can also set it to just go blank (which I do) and it will turn back on if there is motion detected. There's also a beep feature to alert you with audio if you aren't looking at the cam to see that it has detected motion.If you have 4 cams you can have the screen split so you can see all 4 live cams at once or you can set it to rotate each cam in full screen. One thing I read in the instructions and makes sense is that the motion detection might be less accurate when the surrounding temperature of the cam is more than 98.7 (body heat temp) as it detects heat, so if its super hot where you have the cam mounted like outside, then it may not register movement as well but, it also mentions that it tracks motion with another sensor so to me this is a backup if the heat is too much. There is a way to increase and decrease sensitivity settings which i'm sure would fix any issues.You can view your recordings right on the LCD screen (7inch) in addition to having picture-in-picture of the live cam feed. Or you can just remove the SD card and put it in your computer and watch them that way. There are two setting for video quality high and low one is 640x480 and 360x240.To view the camera online from a smartphone or computer, you have to setup/create a Skype account. It has to be separate from your personal one and then you have to add the cam as a contact, its a little involved and you WILL meed the step by step guide to get it all working. In addition, you need to use the enclosed cd software as well as have the base screen unit hooked up to a usb port to configure it and to keep the connection of the cam to Skype. So you need to keep your computer on to have the link stay.It of course has all the settings for adjusting the brightness on the lcd/cams etc, audio volume, and the date/time. The range of the wireless system varies depending on line of sight. They claim up to 650 feet unobstructed but that's probably not gonna be what anyone gets. The system from what I can tell is a 2.4gtz so its good but your range will be limited most likely. There is a signal strength meter on the lcd screen so that will help you know when your getting out of range. You'll also get choppy live video if your too far away. But don't worry, Lorex sells accessories to extend the range with wither a panel antenna or an omni directional antenna.If this system had a true wireless cam (battery powered, I would have rated it 5 stars and would be great. If they ever release a cam compatible with this system that is battery powered i'm for sure buying it. I so wanted to mount the cam outside but i have no place to plug the cam into outside. I'd have to run an extension cord to it which would defeat the purpose of surveillance where anyone could simply unplug it.Its a super great system that can be expanded and has many of the bells and whistles you would hope for and more.", "Date": "January 23, 2013"}, {"Title": "Works well.", "Author": "Eddie J. Garrett", "ReviewID": "R8HVALCD3Y49X", "Overall": "5.0", "Content": "Have had no problem with it. It works better than expected. The outside audio is helpful in letting me know what is going on.", "Date": "March 7, 2014"}, {"Title": "Returned product after a week!", "Author": "Gabriel J. Pratts", "ReviewID": "R234JG8STDBAOQ", "Overall": "1.0", "Content": "I bought this to put around my house. I was excited because it looked easy to install and it looked nice. I got it right away thanks to Amazon, put it all together and then I had a minor set back. I tried calling the company directly and I was on hold for over an hour and no one answer. I check their time zones and I was calling the right one. I went to Facebook and send them an message, all I got was if I has a problem contact them directly in the phone number that I was on hold for over an hour. After many times of calling I just decided to return the product.Overall the product looks cheap, and the memory card only records up to one day. You will need a bigger one.", "Date": "March 2, 2014"}, {"Title": "worked for 30 mins and locked up", "Author": "Mark Kelley \"Mark\"", "ReviewID": "R2H4KF78QCFMN7", "Overall": "1.0", "Content": "Do not  waste your money!Bought this for my dad for X-mas it worked for a very short time and locked up.Tried everything to reset called tech support , etc.Sent it back and bought a different system.", "Date": "February 6, 2014"}, {"Title": "Just what we needed", "Author": "Sabine", "ReviewID": "R3LLMIK26G4XM8", "Overall": "5.0", "Content": "After a potential threat to ourselves and our property we installed the camera's (super easy) and have had peace of mind since.  The only thing that was frustrating was trying to contact the support number, since it was a holiday weekend.  We finally figured out that if you want to re-locate the monitor, the SD card needs to be removed before turn-on, until all the cameras come back on-line. Then re-insert and good to go.", "Date": "January 4, 2014"}, {"Title": "camera failures ( wireless )", "Author": "Donald Welch", "ReviewID": "R3BHJI7TWU2LFJ", "Overall": "1.0", "Content": "I can only give it a 1 star because the 4 cameras faild to work  after 8 days in my home for set up & check out.", "Date": "December 25, 2013"}, {"Title": "Nice system, but can't seem to add extra cameras.", "Author": "J. Green", "ReviewID": "R2BLB123UHQWOE", "Overall": "3.0", "Content": "First of all, this system cannot be expanded - I discovered this after purchasing the listed add-on camera (LW2731AC1) and attempting to sync it.  The LW2731AC1 camera would not connect at all, and I'm not sure what camera will - the Lorex web site does not even acknowledge my monitor's model number (\"WL2730\" instead of \"LW2731\") on their accessory compatability page, and attempts to contact tech support about the issue have been in vain (finally wound up returning the add-on camera to Amazon for a refund).  I am not prepared to purchase every single camera Lorex sells to try to find the one that can sync!With that said, this is a nice camera system.  Good day and night visibility - can see clearly to the end of my driveway (about 60' from the camera).  Good color during the day, and the night vision is very clear.  Features multiple sensitivity and recording settings, though it is almost too sensitive - it turns on in response to leaves blowing across the driveway, changing shadows from the trees, or even moths flying in front of the camera at night.  Reviewing 100+ five-second clips that were captured throughout the day can be tedious at times!  The video files are stored as .avi files, and both Windows Media Player (version 11.0.6002) and RealPlayer (Version 16.0.0.282) can play the files. Real time video is smooth, but playback can be jerky.This system would benefit from a touch screen to help navigate through the menus as the buttons below the display are not very responsive.  Also, viewing the images remotely requires a connection to a PC and an active internet connection, so checking the cameras while you're away on vacation requires your computer to stay on the whole time as well.  Remember the camera needs to be plugged in (and a longer cord would be helpful).  Running an extension cord through the attic & routing the camera power cord through the eaves wasn't too difficult, and since it's wireless, I don't need to run a signal cable all the way back to the monitor.  I have had no connectivity problems between the monitor and the camera.  My monitor is approximately 40-50' from the camera, & the wireless signal passes through two interior and one exterior wall (wood frame construction/vinyl siding - you may have different results through brick/stucco walls).Installation of the camera was easy - three screws secured the base to the house, and the camera screws onto the base.  It was very convenient having the monitor screen with me while making those final camera adjustments for the proper field of view - imagine having to come inside to view a TV or computer monitor after every adjustment!  Syncing additional cameras is supposed to be simple - select sync from the menu, select an unused channel, then press the button on the back of the camera within 30 seconds.Overall, I'm pleased with the camera.  This whole camera sync problem is just making it difficult to expand the system like I wanted to.  If I had to do it again, I would have simply purchased the one that already included the additional cameras!", "Date": "November 4, 2013"}, {"Title": "Range is Poor", "Author": "Amazon Customer", "ReviewID": "R3GILBB1DSF9PO", "Overall": "2.0", "Content": "Set up was easy.  I placed the Camera(s) in my front driveway and by my front porch.  I then set-up the monitor about 200 feet away in my back patio.  The monitor read \"out of range\".  It had to go through one front door (wooden) and back door (glass) but did not register connection.  I then moved the monitor on a table by the front door before I got reception from the cameras.  (Only about 15 and 40 feet from the cameras).  Not the range it professes to have.", "Date": "October 25, 2013"}, {"Title": "Lorex Wireless Cameras Work Fabulously !", "Author": "Gerald M.", "ReviewID": "R1MXRZQZQN14RY", "Overall": "5.0", "Content": "The camera launched on my video screen as soon as I plugged it into the wall.  Reception range is excellent and the image is clear with absolutely solid stability.  I want to purchase additional cameras as they work so well.  Great product. GM", "Date": "September 23, 2013"}, {"Title": "Digital picture sucks", "Author": "g. chary", "ReviewID": "R3GEKW2LCTOVRA", "Overall": "3.0", "Content": "I have the camera about 120 ft. from the monitor and it only shows a picture part time. When there is a picture, it is good, but at least 50% of the time it is showing out of range on the screen. The camera is not moving so why isn't it on all the time if it can be on part of the time. I have moved it around and at 90 ft it still does the same thing. It is better than nothing, but not much.", "Date": "August 17, 2013"}, {"Title": "Easy setup, but camera kept falling out of brackets", "Author": "redhedhs", "ReviewID": "RN12KSZRRDI7B", "Overall": "4.0", "Content": "I like that this camera set was really easy to setup - just turn on, get electricity running, and you've got a nice system.  However, I have a few gripes.  I think people need to be aware that you need electrical power to this camera, so if you have an older house without electricity outside, you'll need to set something up.  This is noted here on the product page, but I don't think people understand what a pain that can actually be, or how much an electrician will cost if you need to set that up.  So something to keep in mind.Luckily, we had already installed electrical wiring outside when we had a motion-activated security light put up, so installing this WAS relatively easy.  We noticed, though, that the camera kept moving in its positions, and that it had a tendency to fall out of position a lot - kind of like it got \"tired,\" and drooped down at the end of the day.  Not a big deal for us, but if you want precise monitoring of a certain spot, it seems like the brackets/joints of the mount are not made precisely enough for this.That being said, the monitoring capabilities of this thing are really cool, and if you have a dog or a child at home that you'd like to keep an eye on remotely, it's pretty nice.  But I don't see why a web camera system wouldn't be just as easy for a smaller task like that indoors.  If you really want to have monitoring in several outdoor and indoor areas of your house and want an expandable system, I think this is a nice system.  But if you just need indoor monitoring, go for something cheaper, and if you need outdoor precise targeting, go for something more expensive :)", "Date": "May 16, 2013"}, {"Title": "Failed with extended file retrieval", "Author": "Stacie Oehlerich", "ReviewID": "R3F15LX19GG1SZ", "Overall": "1.0", "Content": "We installed a lorex system in our retail store.  The monitor failed after a few months and it was replaced.  This should have been a warning, but we installed the replacement.  We were pulling video and saving to a thumb drive for a police investigation and after several hours the entire unit locked up.  When attempting to reboot, it failed completely.  Lorex was NO help whatsoever.  Our model was out of warranty so they would offer no suggestions on retrieving the data other than to tell us that it was encoded (which we didn't know) and no, they would not provide any information to help someone retrieve the data by another means.If all you need is real  time monitoring you might like this brand.  If you might want to save your data for any reason, look elsewhere as the software is unstable and this company will not provide any information on how to access your data if the unit fails.  They wouldn't even tell us if the hard drive could be read by any current models.  No, it's out of warranty.  No we won't help you.  Not even for a fee.Buyer beware.", "Date": "May 28, 2014"}, {"Title": "Lorex LW27334B and Memory card", "Author": "Thomas  M.  Shea", "ReviewID": "R1LB8ZJ6H1NS8K", "Overall": "1.0", "Content": "I product didn't work, I returned the video system and the Flash memory card.  I got a refund for the video system, I didn't receive a refund for the memory card.  I taped the memory card to the top of the box of the video system.  I couldn't get a new system because  I was told it was out of stock.Tom Shea", "Date": "May 14, 2014"}, {"Title": "Spend more and get it right", "Author": "al", "ReviewID": "R1DVZXUV055ZHX", "Overall": "1.0", "Content": "At first this was ok. I purchased additional cameras for more viewing. Night vision is ok.  After 1 week one of the cameras was recording on Motion mode with no movement constantly. They replaced a Camera. Now the Unit itself wont pair or record. They are going to replace the unit. This all after the 30 days amazon reurn. So im dealing with Lorex. Tech support is ok, but very hard to understand them.  Not recomended", "Date": "May 9, 2014"}, {"Title": "horrible", "Author": "Bill hoke", "ReviewID": "R164KN4WO32UZ6", "Overall": "1.0", "Content": "horrible resolution, worked for 3 days then went out. Save your money and invest in something better, this product should go directly to the wastebasket", "Date": "May 8, 2014"}, {"Title": "Great camera", "Author": "Clint", "ReviewID": "R2OC778NQ8NVHP", "Overall": "5.0", "Content": "While some may be skeptical at buying this camera because of the price, don't be!  Both the daytime and nighttime visions are very clear and just as described.  The camera's wireless capabilities allow it to be placed almost anywhere too.  This add-on camera was purchased for an elderly couple and they love the intercom feature: having the ability to talk to individuals at the front door without having to physically answer the door.", "Date": "May 8, 2014"}, {"Title": "Be secure with Lorax", "Author": "Charles Louis White", "ReviewID": "R20OK02P7WPFTQ", "Overall": "5.0", "Content": "The product is exactly what I needed. It's simple to setup and by me being a handicapped veteran, I feel more secure seeing what's going on outside especially at night.", "Date": "March 11, 2014"}, {"Title": "Great Camera System", "Author": "DannyO", "ReviewID": "R3L9VE7UW2OZA1", "Overall": "5.0", "Content": "Great camera system for the price. Works great and is exactly as described. It is simple and very easy to monitor. Hope I can monitor it on my cell phone.", "Date": "March 11, 2014"}, {"Title": "Monitor not working", "Author": "William J.", "ReviewID": "R2GCAZ0APE97HA", "Overall": "3.0", "Content": "Had the system for about 2 weeks, was working great, but, the monitor had quite working, trying to send it back to Lorex", "Date": "March 10, 2014"}, {"Title": "only few hours of recording time", "Author": "napaguy", "ReviewID": "R32N5MOGHGWFE", "Overall": "3.0", "Content": "The cameras are nice but the main reason i was getting video camera was for my work where I need to see footage going back 4 days are more. It stated that the chip can hold up to 24 hrs of data. I guess you can get another chip one with more memory but that would only extend it to 2 days...maybe 3 at max if you don't have too much activity.I think for home it is nice if you just want to see who is at the door or what your kids are doing or wife/husband ;)", "Date": "March 5, 2014"}, {"Title": "what i expected", "Author": "Grover Daniels", "ReviewID": "ROBSA5M5X6X9I", "Overall": "4.0", "Content": "it would be better if it would be battery operated also .I will  find out if battery pack is offered", "Date": "March 3, 2014"}, {"Title": "Doesn't Work With Mac", "Author": "Greg Davis \"Greg\"", "ReviewID": "RB5A2UMG8ATXO", "Overall": "2.0", "Content": "The description says this works with Mac, but that isn't accurate, at least not yet.  After setting up the system, I couldn't monitor on the Mac.  After several calls to support, it was determined that the is a problem with a driver that prevents it.  There was no estimated time to fix the problem.  So I had to return the system.", "Date": "February 18, 2014"}, {"Title": "careful who's house you snoop around.", "Author": "Michael Coats", "ReviewID": "R3VH5K74EK3480", "Overall": "5.0", "Content": "Already had 2 cameras and they work well day and night, already had screen set up bought from best buy.", "Date": "December 31, 2013"}, {"Title": "Works for me", "Author": "Steve", "ReviewID": "R23B2R48B4TRXV", "Overall": "5.0", "Content": "Love this setup.  I live in a less than stellar neighborhood so I needed to do something for security.  Intercom feature was a plus, if I'm upstairs I can talk to people at the front door, was great at Halloween, easy set up, the outside plug in was a hassle but just plan it out.  Easy to add more camera as we'll.", "Date": "November 23, 2013"}, {"Title": "As described", "Author": "John", "ReviewID": "R11T70HYH63F5G", "Overall": "5.0", "Content": "This is a great unit for the money. Cameras have great range.  With the 32 BG card I should get about 30 days worth of recording", "Date": "October 28, 2013"}, {"Title": "ONCE AGAIN A QUALITY PRODUCT", "Author": "ARMEDBUG", "ReviewID": "R399W34CN7BWS4", "Overall": "5.0", "Content": "THIS CAMERA HAS TRUE NIGHT VISION NO OUTSIDE LIGHTS NEEDED, MOTION DETECTION AND VISION - GREATWHEN I DECIDE TO ADD MORE SECURITY, MY FIRST CHOICE IS LOREX.", "Date": "October 21, 2013"}, {"Title": "Very good product for the price", "Author": "CChaparro", "ReviewID": "R14M5OGTJGD5XR", "Overall": "4.0", "Content": "This product lets you see what the camera is showing very clearly and sharp. I wouls recommend it to family and friends!", "Date": "October 16, 2013"}, {"Title": "Decent to good for the money", "Author": "Sean Marrelli", "ReviewID": "RYN77TPYEJ5J1", "Overall": "4.0", "Content": "I got this system after my trees got TP'd twice in one month. It installed pretty easily with the exception of getting the power cord connected in the attic crawl space. As someone else noted, a longer power cable would be a HUGE help in getting this thing run. I ended up splicing the cable and creating my own extension.The image resolution is okay. It reminds me a little of the typical security footage you see on the news after a convenience store robbery. You won't be making out any fine details on the image and if something is moving it will be a blur. At night, it switches to an IR lit image and shows up in black and white. You can tell if it is a person, but unless they stick their face up to the camera you will have to know them to identify them.One nice feature is the motion detection-activated recording. It can also beep when it detects activity -- so you can use it as an alarm system as well.", "Date": "September 10, 2013"}, {"Title": "Works Great", "Author": "garinder", "ReviewID": "R2PO69LKRPKOYV", "Overall": "4.0", "Content": "I got the wireless Lorex and installed three cameras.  It works great with a clear picture and easy to operate.  But I have a couple critiques.  First, when I went online to purchase a third camera (there were only two with the unit) There was no clear indication as to which camera went  with which unit and i ended up buying the wrong one initially.  Also, the sensitive adjustment on the unit for motion detection is difficult to fine tune.  It is either too strong with too many hours of unnecessary video or too weak with less than adequate pick up.  Otherwise I really liked this unit and would recommend it to anyone that is looking for an easy to install video surveillance system.", "Date": "September 3, 2013"}, {"Title": "Awesome little system", "Author": "Timothy Lovett", "ReviewID": "R3CPFTU3VBVXZK", "Overall": "5.0", "Content": "I've been using the Lorex LW2731 camera and monitor for the past few weeks as a security camera for watching my dogs when I'm out and away from my apartment. My dogs have a tendency to destroy things when they get bored but since I have two of them it's hard to really tell who is doing the behavior so we can train them to stop. So far they haven't done anything yet but we'll keep monitoring to see if anything happens!It's a cool little device and wasn't hard to get up and running. I definitely think it's worth getting if you have the money to invest and have something worth watching. The device feels a bit pricey and additional cameras would likely add up so you may end up paying quite a bit to get full coverage.", "Date": "March 17, 2013"}, {"Title": "Really Cool Device", "Author": "The Writing Chef \"Dan\"", "ReviewID": "RPOGJX8AGTM31", "Overall": "5.0", "Content": "I tried this wireless camera security system, even though I didn't have a specific need for a security camera. But sometimes I am in the back of my house and someone rings the bell, and I would like to know who it is without running half a football field. Also, when we go out, it would be nice to know who came to the door in our absence. So I decided to try it. Initial setup was easy, making the wireless connection was not too difficult, and having the compact flatscreen monitor as part of the package is great. So that's the good news. The bad is that it will take some effort to permanently mount the camera on the outside. Yes, they provide the mounting bracket which is wonderful, but the camera requires AC power, and that means figuring out a good place in which to drill a hole through the outside of my house, to a point inside, then to an AC outlet. I wish the camera was battery powered! But other than that, it's a pretty good system. And from what I can tell (in other words, what the instructions say) 4 cameras can be hooked up at one time. (I will only use the 1 for now, however.) So if you need a security system, it seems really good.", "Date": "January 31, 2013"}, {"Title": "Does what it says it does", "Author": "jaypath", "ReviewID": "R1NYPT29J5LCKT", "Overall": "5.0", "Content": "Writing this review in response to other reviews. Someone wrote that you cannot use video surveillance in court. That may or may not be true (depends on your jurisdiction). Audio recording (which this does quite well) also may or may not be legal. However, there are plenty of cases where home video surveillance is admissible. But the bigger problem - so what if you record a masked intruder or a grainy burglar - remains true.Nevertheless, this does do video surveillance very well (for this price range). Don't expect spectacular resolution where you can zoom in on a license plate. But you'll get slightly better then old school TV quality. If you want specific coverage (like surveillance of your amazon package drop zone) then you'll get perfectly fine quality when the camera is within 15 feet. Better yet is the audio and speaker. This picks up footsteps at 10 feet. And when you talk through the camera it's loud.So prior reviewers are right... It may not be the best for mission critical security (though I would say it's best in price class). But it is excellent for... a \"Wireless\" front door intercom/video link... video baby monitor... surveillance of otherwise obscured areas... figuring out if your amazon packages were stolen or not delivered.Other thoughts...wireless link - very good (at about 50 feet, with many walls between). Additional antennae are also available (must be purchased separately).night vision - very good (has built in IR lights that seem to work to about 20 ft)Motion sensing - excellent. LCD monitor beeps loudly (volume adjustable) whenever motion is detected by a dedicated motion sensor.Video motion sensing - fair. You can additionally sense when the video image is changing and trigger the motion alarm. This is weaker (triggers for moving branches, shadows, distant cars, etc). Fortunately you can turn this off and leave the hardware motion sensor on.No battery - yes, you need to provide AC power to both the camera and the LCD panel. If you thought otherwise you are an idiot. Did I mention the high power IR lights, motion sensor, good resolution wireless video feed... What the hell battery did you think was going to power this? The back of a prius??? This is \"wireless\" because you don't need to run a video wire to the monitor, which otherwise would mean a lot of wall fishing. You'll still need to drill a hole someplace... for a POWER WIRE (though a clean install could easily conceal most of the power cord).AC power cord is short. Yes, another reviewer mentioned this as well. I too had to splice my power line. Works fine, but this does require some fine motor skills (the wires are tiny, possibly 20 or 22 g).Range - I'm having no problems at 25 feet and many walls between. That said, I run between 50-100% signal strength, so I doubt you'd be able to extend to 100s of feet without a boost.Internet connection - a poor afterthought, really nonexistent. If you connect the system to the internet that really means that the camera behaves like a Skype web cam. Then you can call into the camera to get the feed. But the local video monitor stupidly shuts down in this scenario. Also, you can't remotely switch multiple cameras. All in all the remote viewing option is poor.Intercom function - Works INCREDIBLY WELL. I love that I can be sitting at my desk and I get alerted when someone approaches (even before they ring the bell) . Then I push a button and ask them what they want all without ever getting up. Oh, you're selling vacuums? Please re-read the no solicitation sign that I just saw you ignore...", "Date": "December 22, 2013"}, {"Title": "Motion detector", "Author": "Alan Branch", "ReviewID": "R32DL0QWIBYKU6", "Overall": "3.0", "Content": "This security would be fine at close area but the motion detector will only pick up about 8' to 10 ' and you will not get a recording unless the motion detector picks up movement. It would video bugs, bats are anything close. You can see about 25'.", "Date": "October 13, 2013"}, {"Title": "Nice works good", "Author": "Samantha s.", "ReviewID": "RP2IRMGVUTKAT", "Overall": "4.0", "Content": "Good nice greatest so amazing how clear the pic is it's like mine blowing ya I like it so so much", "Date": "October 2, 2013"}, {"Title": "So Far So Good", "Author": "D Gibson \"D Gibson\"", "ReviewID": "RAR8Y1OQ8H2JS", "Overall": "5.0", "Content": "Sure the Extension Cord may be a little short but, if you know what your doing you can either get a longer one,Or splice it yourself and run the wire behind the wall.Either way its easy to set up and Perfect way for me to watch the ups man on his way :)i gotta get a few more cams for this SystemIt has a 2 way Intercom built in as well which is cool.If someone comes unannounced you can ask them to identify them self.i wont bother putting the sticker outside it will only make people think you have something valuable to hide and lock up right?.", "Date": "June 19, 2013"}, {"Title": "Customer service", "Author": "Linda Wescott", "ReviewID": "R1KQ0UJ14RVU0", "Overall": "1.0", "Content": "This company is terrible!!! I have been trying to reach someone for 2 MONTHS I was put on hold for 3 hours and then hung on then I have left numerous emails and no one has reached me!!! I have not been able to use skype on theses cameras with my mac because skype said theses cameras are no longer compatible!! Ugg I just want to return these cameras and I can't even talk to someone to do that!! Oh by the way the company is in canada!!!", "Date": "January 29, 2014"}, {"Title": "Crap", "Author": "Wes", "ReviewID": "R2RCAXGDDAC0L6", "Overall": "1.0", "Content": "product never worked. Lorex wont back the product unless its registered and then they only back it for a year. Swan backs there cameras for life", "Date": "September 8, 2013"}, {"Title": "Problem setting the Skype camera connection", "Author": "TJ \"tj\"", "ReviewID": "R3TK24ZAOVN4AI", "Overall": "2.0", "Content": "I purchased this system a couple of weeks ago. The camera pairing with the monitor went fine, the motion detection allowed the recording to be as set and I can review all the recording while I was away from home. It worked in the day light and at night the night light  but not with top quality picture. It a medium to low resolution. The major problem I have is getting the camera to be connected with Skype account I set up for the system. I tried both the Mac version drive and the PC drive withe respective computers and none of them allowed me to connect the picture to Skype account I set up for the camera. You can hear the sound from the camera through the Skype account but the picture never worked. I am disappointed to have this problem and I can't find help to resolve it.", "Date": "August 10, 2013"}, {"Title": "Good place to start", "Author": "Bradley J. Brisco \"Brad Brisco\"", "ReviewID": "R1BMF23WUUUU21", "Overall": "4.0", "Content": "Thus security system is very east to use, if you have an electrical outlet where you want to install the camera. There is no battery option for the camera, you must have electricity to the camera. Otherwise, you simply plug in the camera, plug in the monitor, turn it on and you are set to go. As described in the product information there is only one camera with this purchase which of course limits the range of use, but it will take up to four cameras, but be prepared to spend another $100 to $150 per for additional cameras. I am using it to see who comes to the front door. The most helpful use is to keep an \"eye\" on the many deliveries that are left at our front door throughout the week. While we haven't lost a package yet, there have been several reports in the neighborhood of people talking packages that have been dropped off at the front door. With this camera we will have a good view of anyone attempting to take anything off our front porch.Overall I think this is a good first step in home security, it is reasonably priced and has good night vision quality. There are three recording modes: manual, motion, or schedule. The digital video recorder supports up to 32GB SD. The recording is also stamped with both time and date. If you would benefit from a single camera perspective from around your home or business this product would be a good place to start.", "Date": "February 21, 2013"}, {"Title": "Good & bad...", "Author": "Miks", "ReviewID": "R2HZ4986W4GDWO", "Overall": "4.0", "Content": "3 out of 4 cameras work properly.  1 camera constantly sees motion & engages recording 24/7 vs only on motion.  Disabled that one and system is normal", "Date": "June 7, 2014"}, {"Title": "Lorex LW2731 works great!", "Author": "Tracy Dixon", "ReviewID": "R10NL93MFBN37I", "Overall": "5.0", "Content": "Easy set up and installation.  This unit was purchased to view and record activity at my front door.  I love the 7\" monitor and its built-in options.  I did a lot of research and this one was well worth it.  No maintenance required!  I would highly recommend for those who need a simple solution without spending lots of money.", "Date": "May 22, 2014"}, {"Title": "super easy install", "Author": "DR Austin M Senters, MD", "ReviewID": "RMALM82K6LLXH", "Overall": "5.0", "Content": "these cameras were super easy to install, and they work great outside. i didn't try them inside but i installed them on all of the exterior doors and they work great in the day and night. The two way talk function also works great!", "Date": "May 17, 2014"}, {"Title": "It's ok", "Author": "Krystahl \"Krys\"", "ReviewID": "R2FCX4TFEZQ36U", "Overall": "3.0", "Content": "I couldn't put this outside as I can't get anyone to put it up for me. I am electronically challenged but it sits next to my bed and the camera is in my window I can see my driveway but because of the glass it doesn't set off the alarm except when my cat's are in the window looking out. Since the IR reflects of the window at night I leave it on for a nightlight next to my bed. by morning I have a crystal clear picture of my driveway though. I don't know how to set it up to record on skype but that's my fault I imagine it would do ok if I knew how to do this.", "Date": "May 16, 2014"}, {"Title": "great product", "Author": "Alfonzo Wyatt", "ReviewID": "R3SL8JDE2CPM6X", "Overall": "4.0", "Content": "I'm more than satisfied with this product. It took some installing the system because I wanted to hide all the wires, but it was easy to set up and you get a clear picture.", "Date": "May 14, 2014"}, {"Title": "Great Product set", "Author": "Jeffrey D. Freeman", "ReviewID": "R1UARHEYCAQL90", "Overall": "4.0", "Content": "Likes: Overall, we love this product. Wireless cameras make it easy to have them installed anywhere (just need power outlet- plug and play). No wiring to a home station or fancy installation of cable cords (hint- you can use outside flood lights [or any light socket] as a power source with a cheap $2 plug adapter from Walmart, Lowes, etc) . Have one facing down our driveway, one facing our doorway, etc all overlapping each other. Like the ability to plug into our tv and see our 4-split screen cameras with the click of the remote. Haven't tried the Skype feature yet, but like the option. Night time viewing is great, plenty of infrared lighting power to view 20+ feet which is more than enough for human size objects (or our neighbors dog at our door) and no problem seeing vehicles 50+ ft (FedEx) down the driveway, etc.  Lastly, can also make a good baby-monitor camera with sound, talk back capability, and motion activated option.Dislikes: Small lag in active picture/video, but that is typical for most camera systems (unless you pay $$$), not a deal breaker. Why 4-stars?? Only thing I want improved on this particular system is for the monitor to have battery/back-up battery/rechargeable capability--ie: portability. Monitor must be plugged in, which is a pain if you want to take room-to-room (like in a 2-story house). Would be nice to charge it in a docking station, set it on the coffee table (without cords) to view/monitor while doing other stuff.I would buy this again, recommended.", "Date": "May 13, 2014"}, {"Title": "Its clear", "Author": "tsige Woledemariam", "ReviewID": "R13W6AHD11AKXO", "Overall": "4.0", "Content": "I like this monitor its clear wireless its user friendly if I can use it any body can use this priceless expect the cord is a little short if you have a bigger place love it I definitely recommend this its worth it for the price.", "Date": "May 13, 2014"}, {"Title": "Wasted of my time", "Author": "alfredo", "ReviewID": "R1IMAN3NCYFMQM", "Overall": "1.0", "Content": "3 of 4 camaras borke after the 2nd day of use. I just wasted my time istalling these camaras, I'm buying a different brand", "Date": "May 11, 2014"}, {"Title": "not very good and the support is not there", "Author": "michael", "ReviewID": "R3JN5DNT7ES5OQ", "Overall": "1.0", "Content": "all sound nice until i got it and i have problems with it, one time the work the other not, is not trusted", "Date": "May 10, 2014"}, {"Title": "Works better than expected!", "Author": "Frustrated Mom", "ReviewID": "R2DIEIFE8HUSI0", "Overall": "5.0", "Content": "The monitor/camera is great for monitoring our front door!  It allows us to see who comes to the door in daylight and dark - very clear pictures and you can add the sound if you choose!  Awesome item for the price.  Easy to install.  Easy to move the monitor from room to room.  Perfect solution for us to be able to see when our feral cat comes to eat!!!  If we are not monitoring the camera, there is a soft sound that alerts us to check the camera - couldn't be happier!", "Date": "May 10, 2014"}, {"Title": "works like a charm", "Author": "delale", "ReviewID": "RFA10E8AIZY4O", "Overall": "4.0", "Content": "easy set up for cameras mounted under eaves. night vision is good. set it to motion and forget it. perfect for added home security.", "Date": "May 1, 2014"}, {"Title": "Perfect operation", "Author": "Walter J. Boyne \"Walt Boyne\"", "ReviewID": "R2NW91NMPV1BA6", "Overall": "5.0", "Content": "One of the greatest buys on the market. Installs easily, works perfectly, good instruction manual, and a great security device.", "Date": "April 29, 2014"}, {"Title": "Lorex Wireless Camara", "Author": "George Bartlett \"1 GB man\"", "ReviewID": "R2ZR0986CWL619", "Overall": "5.0", "Content": "This camera was and addition to the security system that I installed in my home work grate, the only thing is I preferred a White color", "Date": "April 26, 2014"}, {"Title": "Lorex wireless video monitoring system", "Author": "Jay", "ReviewID": "R1CJ3XAGI0YJV7", "Overall": "4.0", "Content": "I like this system because it is very easy to set up and is wireless,This is the second one I've bought,the only issue i have is trying to link it to my iPhone,it says to go through Skype,but when I try to get connected to Lorex,it never accepts? not a big deal now, I'll figure it out?", "Date": "April 24, 2014"}, {"Title": "Lorex LW2734B with 4 cameras", "Author": "Steve", "ReviewID": "R6M0WINAH2WQU", "Overall": "4.0", "Content": "I purchased this unit with 4 cameras. It's very easy to set up. I had to install the cameras behind the fascia of my house because they are not waterproof. That is one reason I gave it a 4 out of 5. The other reason I gave it a 4 was camera #3 would just stop working. The only way to get it connected back to the display was to power it down and on.I called Amazon to have it replaced. So instead of just sending me 1 camera they sent me the entire system including a new monitor and display.The new camera has been working fine for the last 4 days. The intercom function works very well. I mounted one close to my front door. We can clearly see and hear who is at the door. I would recommend this set up for basic security. It's too bad you can't hook it up to your Wireless Router and view it on your smartphone from anywhere. You can do this if you want to hard wire the display to a computer and have SKYPE running 24 hours a day. That option was not for me. I am not sure of the true maximum range of these cameras. The furtherest camera we have is about 25 feet going through 2 walls.", "Date": "April 23, 2014"}, {"Title": "Lorex system including 4 paired cameras", "Author": "Nursing Educator", "ReviewID": "R16W9RLK4MMWY7", "Overall": "1.0", "Content": "I ordered unit and 4 cameras so they would be electronically paired. Amazon sent 2 separate cameras that were difficult to pair.otherswise system is great", "Date": "April 23, 2014"}, {"Title": "This is Great", "Author": "Cliff Kennedy", "ReviewID": "R2V4LJRO1I3IVR", "Overall": "5.0", "Content": "Product was shipped promptly. Item was better than expected. It was exactly as described. Simply a breeze to install. Works great. Couldn't have been more pleased. Would have no problem recommending it at all.", "Date": "April 15, 2014"}, {"Title": "Good Start up system", "Author": "simmons", "ReviewID": "RDP249D6SCYZ", "Overall": "5.0", "Content": "Easy and quick to install.Pros:  low cost, easy to setupCons: picture qualityOverall the system is worth what one pays for it.  If one needs a very clear image a higher quality camera will be needed.", "Date": "April 11, 2014"}, {"Title": "Awesome product", "Author": "Andy Winkler", "ReviewID": "RFW0T1AWF3OKU", "Overall": "4.0", "Content": "Awesome product. I have two cameras outside and live in minnesota. They've stood the test of time even in -40 days. Couldn't believe it. They get perfect signal even through a brick house", "Date": "April 10, 2014"}, {"Title": "I spy . . .", "Author": "Tobe Cassie", "ReviewID": "RTMBG39WCY3FK", "Overall": "5.0", "Content": "I got these as 2 additional ones to the system I already had and they were a simple plug and go.  I recommend this system to anyone looking to keep an eye on things.", "Date": "April 8, 2014"}, {"Title": "Worth every penny", "Author": "K. Bailey", "ReviewID": "RAAE8F5NLESN1", "Overall": "5.0", "Content": "Just received this yesterday and am very impressed, set up is fairly simple.It has tons of features, manual, motion, timer mode. also picture slide show and also can be used with Skype.Also intercom between cameras and base station. USB, and avi cables included and a bracket for mounting the base station on a wall.Cables are plenty long enough for camera placement.The only problem I had was the included memory card was defective.Picture quality is good, and night mode (black and white) is great.For a small business or home use, it's ideal.", "Date": "April 4, 2014"}, {"Title": "We love Lorex Wireless Camera", "Author": "EMI H", "ReviewID": "R3KND6CSM6FM4G", "Overall": "5.0", "Content": "The most loved electronic equipment we have ever purchased.  Its well worth the amount spent on this system.  After my sons truck was burglarized, of a toolbox weighing about 400 lbs, with $$ of electric tools and supplies and his expensive fishing rods, he installed the camera, recorder, video.  Whoever it was, we're looking at you!!I also can't comment enough about Amazon.com and their service in errors and returns.  I made a mistake when I ordered the add on cameras. I ordered one instead of the needed two. I had problems, when I went back in again, I ordered two, and I received 3 camera.  \"The return was so easy and effortless.  Thank you Amazon!!", "Date": "December 13, 2013"}, {"Title": "Good Value", "Author": "kenotek", "ReviewID": "RBPEC3SWAVTN9", "Overall": "5.0", "Content": "I received my new accessory camera today. I had no problems pairing it as channel 3 on my existing system. The image quality is good, IR LEDs work fine. I tested the microphone and speaker, they work well. Package included the camera,mount, antenna and power adaptor. Overall, the Lorex SD+ system is a good value. I have been using it for about 7 months.", "Date": "December 10, 2013"}, {"Title": "Good Deal", "Author": "Paulo", "ReviewID": "R3V0W721Z273JY", "Overall": "5.0", "Content": "I already have other 2 cameras bought through Amazon. This one is to complete the surveylance system at home.Very good product for a cheap price", "Date": "December 8, 2013"}, {"Title": "DO NOT BUY THIS BRAND!!!!!!!!!!!!!!!!", "Author": "Dale Weaver", "ReviewID": "R309VLLAC76XZ9", "Overall": "1.0", "Content": "Do not buy this brand!  I have shipped back 3 camera and the main unit so far. No telling what will happen in the future. Spend your money else where.", "Date": "November 26, 2013"}, {"Title": "Great add on", "Author": "Steve", "ReviewID": "R2ZR1E5JKLXD0N", "Overall": "5.0", "Content": "Great add on to system, easy and works great.  Color is awesome and night viewing is surprisingly clear.. Recommend it for adding to your system", "Date": "November 23, 2013"}, {"Title": "Lorex add-on wireless cameras were okay", "Author": "Jo-Ann Laboy", "ReviewID": "R1IP2LXNV5U9WZ", "Overall": "3.0", "Content": "I purchased two of these cameras and I was pretty excited about adding this to my new Lorex LW2932 LIVE SD Video Monitoring System.  I am returning them because I experienced difficulty pairing them.", "Date": "November 15, 2013"}, {"Title": "Great score", "Author": "Norman Resnick", "ReviewID": "R2FMZFZ0RVLTWI", "Overall": "5.0", "Content": "Works great love it would recommend to a friend. Works better then expected. Fast shipping and easy install made this a great dal", "Date": "November 13, 2013"}, {"Title": "Great camera", "Author": "Virgil R.", "ReviewID": "R3A3FJL0V7K7B3", "Overall": "5.0", "Content": "Worked perfectly. Paired immediately with no need for additional antenae. Clear picture in total darkness. Excellent color during the day. Motion detection is excellent.", "Date": "November 4, 2013"}, {"Title": "Lowex Camera LW2731AC1", "Author": "Jerry Greenlee", "ReviewID": "R18FBFDD1FL7TJ", "Overall": "3.0", "Content": "Had a hard time getting a signal from one of the cameras. Was only 150 feet away. Had to add another antenna and still had trouble. The signal still comes and goes. Have did every thing I was told to do. To get a clear line of view.", "Date": "October 21, 2013"}, {"Title": "Great Wireless Camera", "Author": "Kycse", "ReviewID": "R3U6FJ0PKQQYEL", "Overall": "5.0", "Content": "I gave this camera 5 stars, the quality of the video is good for the price, the camera was easy to set up just power on and go.  I would recommend it.", "Date": "October 2, 2013"}, {"Title": "excellence", "Author": "anh do", "ReviewID": "R2INKLOADDHF9M", "Overall": "5.0", "Content": "it's easy install.i love it.this is useful when you away from home.maybe i need some wireless camera more.thanks very much .", "Date": "September 9, 2013"}, {"Title": "GREAT BUY", "Author": "ARMEDBUG", "ReviewID": "R28AQIOX97YB06", "Overall": "5.0", "Content": "PERFECT PICTURE. GOOD RANGE, MOTION RECORDING EXCELLENT.  I AM NOT FOND OF WIRELESS PRODUCTS, BUT THIS UNIT MAY CHANGE MY MIND.  WILL BE BUYING MORE UNITS AND CAMERAS", "Date": "August 23, 2013"}, {"Title": "Pricing", "Author": "Leo E Stevens", "ReviewID": "R2KVBOT8Z10PFV", "Overall": "4.0", "Content": "I saw the add for the system with one camera, bought it to try and when it got here they had the same system with two camera's at Lorex site cheaper than what I paid for one camera system. Very disappointed, should have been given that option to start with. System works great even tho I had to buy the second camera.", "Date": "August 18, 2013"}, {"Title": "Easy to install", "Author": "V Hall", "ReviewID": "R20D1OIN3X2VE1", "Overall": "5.0", "Content": "I have had this unit long enough to have 100 degree + temps where it is located.  So far the system is working well and I plan to add additional cameras if I have no problems.  Have used it with unknown visitors and the communication without opening the door is good.  It has met my hopes for usage.", "Date": "July 27, 2013"}, {"Title": "excellent product for remote operatio", "Author": "virginia taras", "ReviewID": "R373KUFE3MNBAS", "Overall": "4.0", "Content": "i like the things i can do with the system.i use it to monitor an area i can view &hear; remotely.the system has a lot of things you could do record display 4 areas at the same time.i may expand the use with time.", "Date": "July 24, 2013"}, {"Title": "A good start", "Author": "Henri Savin", "ReviewID": "R3U3M8IS3I8HON", "Overall": "4.0", "Content": "The Lorex LW2731 security system is very simple to use.Plug the camera, plug the monitor, turn on the monitor and the camera gets detected if it is within range.This is true for up to 4 cameras. If it does not work right away, pairing is explained and it is very easy too.This kit was delivered with one camera only. I checked for the price of additional cameras and it is around $145 for each additional one. In turn, the quality is pretty good. The camera does a very good job at filming at night. Identification of potential burglars should be made easy with this.What I like:- Reasonably priced- Good quality night vision camera- Very easy to set up.- Good detection speed.- 2GB SD card provided. Sufficient for a while.- Intercom between monitor and camera.What I do not like:- Monitor and camera need to be plugged to power to function. No battery solution as far as I am aware of.- Monitor needs to be plugged to a computer plugged to Internet to work with Skype. The computer has to be permanently on.Conclusion:It is a very good starting kit for home security but it falls just short because of the need of a computer to be permanently on. In case of a burglary, I would not be surprized if the thief stole my computer and maybe the monitor in the same time. In such circumstance, the system would prove completely useless.As another reviewer suggested, the monitor should be hidden close enough to the cameras (to function) and close enough to a computer connected to internet to get skype. Not an easy install to do this as thiefs are usually good at finding valuables.So I would say forget about skype and hide your monitor as best as you can.I still give it 4 stars for the overall quality of the system.", "Date": "February 20, 2013"}, {"Title": "Excellent Systems Concept Limited Utility With One Camera", "Author": "Ira Laefsky \"Ira Laefsky\"", "ReviewID": "R1XRZ82UXP4XPU", "Overall": "4.0", "Content": "This home/small business security system is a brilliant systems engineering concept and it is well executed.  Setup with the enclosed instructions is simple, and the video is viewable on the wireless screen unit or remotely via Skype (from anywhere in the world).  There are two caveats that the purchaser of this fine and well executed system should be aware of first as packaged with a single camera the system can only monitor a relatively small area. Secondly, unlike conventional burglar/intrusion alarm systems there is no easy provision for having someone else do the monitoring for you--you bear the ultimate responsibility of monitoring your own property.I see two principal use cases for the system as configured:  1. Frequent travelers will be able to look in on their property via Skype from wherever they are situated in the world (excellent for a consultant, or salesperson).  2.  With the single camera as provided those who have a small single entrance such as a row home, professional office, or store front can monitor their property.  Otherwise users of this system will finda real need to expand their purchase to additional cameras and accesories.", "Date": "January 23, 2013"}, {"Title": "Great pic", "Author": "Juliet Hibbs", "ReviewID": "R3A6NL5IN1T6K1", "Overall": "3.0", "Content": "This is easy to use...but we must have someone come to install them properly outside. I was hoping to go through the window but the night vision doesn't work well", "Date": "September 14, 2013"}, {"Title": "I work in the cam industry and this system is great", "Author": "Heather J Troglauer", "ReviewID": "R16A5VA2QV5YJT", "Overall": "5.0", "Content": "I own a company hosting cams and my customers always ask me what to buy.  I had a couple customer buy this system and we had issues getting the four cam view online.  So, I bought the system for myself to figure this out and once I learned how to push the video to the TV I was set.  Now I highly recommend this to my customers for a quick, easy system that has a great feed.", "Date": "March 2, 2014"}, {"Title": "Baby monitor", "Author": "Timothy P. Reilly", "ReviewID": "R2P9BW83CWAF85", "Overall": "4.0", "Content": "We are using this for a baby monitor and is works very well. No complaints and the are happy with the product after the first couple weeks.", "Date": "October 13, 2013"}, {"Title": "Baby monitor", "Author": "Timothy P. Reilly", "ReviewID": "RW3L6HV8KVENA", "Overall": "4.0", "Content": "We are using this for a baby monitor and is works very well. No complaints and the are happy with the product after the first couple weeks.", "Date": "October 13, 2013"}, {"Title": "the mystery pooper remains at large", "Author": "Neurasthenic \"neurasthenic\"", "ReviewID": "R235V4Q6V5AGBW", "Overall": "3.0", "Content": "Somebody has recently started walking a dog around our block and not cleaning up after it. Every morning I exit my house to find a new, steaming landmine of dog feces. What to do? The Lorex LW2731 lets me film out the front of my house and, in theory, catch the culprit in action.My first effort was with the device's automatic motion detection system. No luck; too much routine activity triggered it. For the last several days I've had it in scheduled recording mode, whereby it will record about four hours of material at the time you specify until it fills up. The evil hound has plotted his pooping around my schedule, and thus far avoided detection.I think the intended use of this device is either (1) internal, where motion detection can be used without false triggers, or (2) as a live video feed, not recorded, for use as part of an intercom. I've pretty much given up on project poopcatcher, but I may rewire the device for one of these other purposes, and will report here if it proves more useful.", "Date": "February 4, 2013"}, {"Title": "Lorex sucks", "Author": "HARLEY-VETTE \"HARLEY-VETTE\"", "ReviewID": "R34TYCM34UTJ4X", "Overall": "1.0", "Content": "The first one broke within three weeks.  We returned it for a new one and that one broke within two weeks.  We gave up and returned it to Amazon for a credit.  With the credit they charged a $35 restocking fee.  If you have a defective item, just return it.  Don't ask for a second one - it'll cost you money.", "Date": "August 29, 2013"}, {"Title": "very good staff but", "Author": "SAMI H SH AL ONAZI", "ReviewID": "RKTLLNC1P2DOX", "Overall": "4.0", "Content": "i like it , it works well but the wireless range is very low .i hope you take care of my notes", "Date": "August 22, 2013"}, {"Title": "Impossible to track video on Skype", "Author": "Mauricio", "ReviewID": "R99TSYHDFI0NE", "Overall": "2.0", "Content": "Poor range angle, you can't track many cams on Skype,only one,and you need leave the screen connected to the computer to track on live one camera,plus you can't record video on this way, only work like a fake cameras to the bad guys, to expensive to this goal. I don't see any other utilities to the system.", "Date": "August 15, 2013"}, {"Title": "4 stars", "Author": "Peter Kwong", "ReviewID": "R36IOPXNWZTNV1", "Overall": "5.0", "Content": "I would give it 5 stars except that the furthest camera which in only 100 ft away doesn't always work.. System said it was good for 250 ft. Otherwise the system works great.", "Date": "May 7, 2014"}, {"Title": "Lorex LW2734B LIVE Wireless Video Monitoring...", "Author": "wink n cat", "ReviewID": "R2RVHR5FLHRZZ2", "Overall": "4.0", "Content": "work good give a very clear picture and we love that we can watch all 4 stations at once I would buy this again", "Date": "April 21, 2014"}, {"Title": "Power surge failure", "Author": "Mountainman", "ReviewID": "R2HAW92M4H6ZBA", "Overall": "1.0", "Content": "I have had three of these units since DEC 2013.... seemed an easy and economical way to monitor my house from within or from remote (Cell phone via skype)The units plug and play easily- havent mastered the Skype thing yet...  Had a power outage in JAN and when the power came back on- the unit failed to reboot. I tried powering down as in a PC to no avail.Returned to store and got a replacement.Another power outage occurs and the same thing happened.Returned to store and with alot of strongarming-- got a third unit.A third power outage (yes I live in the sticks) and a third failure....Cannot return now and am faced with buying another monitor as the cameras are up and mounted and it would be the easiest fix as opposed to an entire new system.I am thinking now to use a power surge strip (not recommended or mentioned in the owners manual)I cant believe a $1500 LED tv would NOT be susceptible to power surges and a $200 camera system is?And I cant believe I am the only customer in the country that this happened to....", "Date": "April 13, 2014"}, {"Title": "great little system!", "Author": "Rockme", "ReviewID": "R2GVSGLG94SORH", "Overall": "5.0", "Content": "I checked out a lot of different camera systems. I wanted security without being required to hook to the internet. I didn't like to think someone else could possibly watch me. I can't complain, it works as expected. I knew I wouldn't be able to read license plates, but audio and intercom works great and video quality is good enough. Cameras must be under cover, and you will most likely need to buy dc power cord extensions because the system only comes with 8' power cords to cameras. Easy set up with little need to read directions. Me likey! I would recommend this to a friend looking for a simple system.", "Date": "April 4, 2014"}, {"Title": "Great", "Author": "Blake", "ReviewID": "R3VM9T2Z0D1ZIH", "Overall": "5.0", "Content": "Great product and easy to install, from out the box took about 2hours. Linking the other cameras was also easy", "Date": "March 18, 2014"}, {"Title": "Lorex LW2731 Live LCD SD Recording Monitor with Wireless Camera", "Author": "John B.", "ReviewID": "R25J53XA1UY3AH", "Overall": "3.0", "Content": "This is easy to setup.  You will be able to have it up and running easily.  Cameras MUST be protected from the weather.Transmitter has a good distance, unit gives acceptable picture but cameras do not do well in bad weather.  Use a protective camera case.", "Date": "January 11, 2014"}, {"Title": "make sure to have this and all electronics shipped by Fed Ex", "Author": "Tim Roxbury", "ReviewID": "R3GG87L2NK4MHW", "Overall": "5.0", "Content": "its the best camera survailence system I own.....had to return the 1st one I got cause it was opened by UPS and the install cd, the manual was missing, and it was not working properly. So if u purchase this item ask them to send it Fed Ex because the package was sealed like it was supposed to be!!", "Date": "November 21, 2013"}, {"Title": "I love it love it love it love it!", "Author": "Sonia V. Hunt \"svhecjb\"", "ReviewID": "R213PC3JF1QZOO", "Overall": "5.0", "Content": "Easy to set up. I can hear anyone approaching my home As well as people talking dog barking birds singing etc.", "Date": "October 29, 2013"}, {"Title": "camera not compatible", "Author": "jc", "ReviewID": "R3ASV6VRJCTHXV", "Overall": "1.0", "Content": "2 extr cameras did not operate with basic system---I sent the whole set backalso---flimsy camera stand -plastic knobsI will never buy anything as expensive from amazon again.If I bought it locally, then I could have returnrd it for a refund rather than having to call UPS and wait for my refund.NEVER AGAIN", "Date": "November 13, 2013"}, {"Title": "Lorex Recording Monitor", "Author": "C. A. Boswell", "ReviewID": "R29M72L5WQWL9C", "Overall": "4.0", "Content": "I deducted one star because there is a typo in the Amazon product listing: it should be Recording Monitor, not \"Recoring\". Sorry, I am picky about grammar, and this simply typo actually does make it difficult for one to find this product in the search engine. Now, onto the product itself. Taking it out of the box, it was possible for me to confirm that the product was working in less than 5 minutes! That is my definition of user-friendly. You simply plug it in, turn it on, and the picture appears. Pretty decent quality, too. Overall, I would recommend this product for anyone who wants, for instance, to find out whose dog is pooping on their yard, for parents who want to keep an eye on a sleeping infant, or even for suspicious individuals who want to know what happens in their absence.", "Date": "April 14, 2013"}, {"Title": "Didn't work", "Author": "Kirkacola \"kirkacola\"", "ReviewID": "R3ILGFLXDK1E75", "Overall": "1.0", "Content": "This was not found by my monitor so I was unable to configure it on my security network.  After I returned it the other one started working.  Must have been a short where my installer spliced the wire to extend the power line.  I will have to purchase this again, maybe in HD and yes I would purchase the product again.", "Date": "March 9, 2014"}, {"Title": "THIS SYSTEM IS NOT WIRELESS", "Author": "jeffrey", "ReviewID": "R1RZ8VA12JNC9E", "Overall": "3.0", "Content": "NO!  It did not because, it is suppose to be wireless but it isn't.  These cameras are to be plugged into a A/C outlet, when in use, at all times, thus not making them wireless if power cables make them operate.", "Date": "January 3, 2014"}, {"Title": "missing camera missing", "Author": "Manuel Perez", "ReviewID": "RVBBZNOE3DDRQ", "Overall": "1.0", "Content": "I am not pleased I was missing 1 of the cameras! All that money for that! Should give a refund or discount", "Date": "October 21, 2013"}], "ProductInfo": {"Price": "$139.95", "Features": "Add on camera for the Lorex LW2731, LW2732, & LW2734B\n2-Way Audio for Intercom usage with 40ft night viewing range\nMount wall, ceiling or counter with included hardware\n52 degree view angle\n9V DC power supply included", "Name": "Lorex LW2731AC1 Live Add-On Wireless Accessory Camera for for LW2731, LW2732, & LW2734B\\", "ImgURL": "http://ecx.images-amazon.com/images/I/41uSQ52bNqL._SY300_.jpg", "ProductID": "B00AW4CQO2"}}