{"Reviews": [{"Title": "Only if you are ethernet network literate...", "Author": "Scott (Technogeek)", "ReviewID": "RO1FPLA7EONLT", "Overall": "3.0", "Content": "I have helped install 2 of these Q-see systems. They use Ethernet to connect the cameras to the recording device, which is called an NVR (Network Video Recorder). I have had problems with both systems because of networking issues to the remote cameras. The system works decent once correctly networked (and if your network is robust), but in my opinion it took way to much work to get them installed reliably. I was also shocked at how little the Q-see support staff knew about Ethernet protocols. I much prefer conventionally wired systems with HD resolution for their simplicity and high performance.To try and simplify a complicated and confusing topic, almost all DVR's and NVR's can connect to Ethernet (which is the network that the Internet/World Wide Web/Web run on). This feature allows you to view the cameras on your cell phone or remote computer. I call this the back end. The front end of the DVR or NVR is where the cameras attach. With DVR's the wires between the cameras and DVR front end are direct connected via cables with a very simple point to point connection.NVR's on the other hand use Ethernet on the front end to attach the cameras. This means the cameras are networked individually, and can be viewed individually without the NVR. While this has huge advantages in a large facility with dozens of cameras at long distances, in my opinion it is overly complicated for a average home or smaller retail shop with little networking knowledge. If you don't know how to configure a router and firewall, and don't understand IP addressing or have a friend that does, stick with the DVR systems.Below I have written up some non-brand specific tips that I hope you find helpful in your quest... Happy Shopping!Surveillance Camera SystemsThe following is my security camera experiences in our 2500 sqft. retail shop.So you want a good camera surveillance system, but can't afford the high prices that professional installers charge? Let me give you some details so you don't make the same mistakes we did over our 2.5 year experiment. Had we known these tid-bits in the beginning it would have saved us a lot of time and money. At first we thought that buying a camera surveillance system would be a piece of cake; just buy one of the many cheap boxed systems and install it. Turns out that was wishful thinking! But in the end we built a high performance system that any \"do it yourselfer\" can install and maintain, and for much less than professionally installed systems.Most importantly, remember this; police and courts need clear detailed pictures or videos to identify criminals and defend against frivolous lawsuits! If your system can't do that, it is a waste of money!1) What video security systems am I writing about?The systems discussed here consist of a Security DVR, Cameras, and the cable to connect them. (I have also included a few notes on NVR's)2) What is a DVR?A DVR (Digital Video Recorder. Also called a NVR if the cameras are attached via a Ethernet network) is basically a small single purpose computer that stores your surveillance videos on a internal hard drive. Most all have a connector to plug in a standard computer display or HD TV for viewing your videos. Some retail boxed systems actually look like a monitor, but have all the computer parts and disk drive built inside and are very compact.Note: There are also DVR \"cards\" that can be installed in a desktop PC computer. They are more expensive, and require hours of monkey-ing with computer hardware and software. Unfortunately, the reliability of PC DVR's is based on your computer knowledge and skill. Leave it to the pros.3) What about these DVR Surveillance Camera Systems in a box I see for sale at electronic stores?We purchased several lower cost retail boxed systems (and seriously 15+ different cameras and recorders). They all had such mediocre grainy video, we returned them all! Digital zooming to see more detail with lower resolution systems creates an unacceptable grainy image. You need as high a resolution system as you can afford so digital zoom can produce clear videos and snapshots. We learned this the hard way when a burglar was caught on video with our first analog 420TVL system. When we tried to zoom in to get a good image of his face, it was too grainy to recognize. Even our last analog 660TVL system did a \"just barely acceptable\" job in my opinion. Although it did help police convict the burglars in our third and last break-in, the zoomed videos and pics were grainy at best.4) Ok then, what is a good system with decent video for zooming?The cheapest way to get ok zoomed images are with 600TVL to 700TVL analog cameras and DVR's (surprisingly, these are called high resolution, a hold-over from days past). But for really useful quality video, I highly recommend the newer \"Digital HD\" (high definition) 720p cameras and DVR's, or the top of the line 1080p models. While a 660TVL analog system is only about 1/3 of a megapixel, the new digital HD systems deliver an astounding 1 megapixel video for 720p models and 2 megapixels video for 1080p. This is substantially better for digital zooming so you can view details, like a criminals face. HD has been around in TV's for years... not sure why the retail security market has been so far behind. But it is finally here.5) What about these convenient wireless systems I see at electronic stores?None of the reasonably priced `wireless' systems we tried worked acceptably.We tried three, and after our own experience and researching opinions online, is seems none of the lower cost wireless systems available in 2011-2012 work satisfactorily. And unfortunately with wireless, your video can be viewed or jammed with a transceiver available to anyone. Reasonably priced secure wireless security cameras are still a dream.6) What about these PTZ cameras I see for sale?PTZ (Pan/Tilt/Zoom) are remotely steerable and optically zoomable cameras. Unfortunately someone has to be at the controls 24/7 to steer them. And wow, the good ones are super expensive! Leave them to the mall and casino security teams. Besides, one wide angle HD camera can usually take a PTZ's place if positioned correctly, though admittedly with less zoom capability.7) Can I take a boxed Surveillance Camera System home and install it quickly?Camera positioning takes a lot of thought! Don't just slap them up, think about what the cops will need to see. When we got broken into the second time, we couldn't see the guy's face on video because of a baseball cap. We then remounted some cameras lower. Surprisingly, floor mounting some cameras gave us the best video coverage. Also, different cameras are available in normal, wide angle or telephoto models for special video coverage needs. We have a floor mounted telephoto pointing at the front door to catch facial detail, another window mounted telephoto to see license plates in the parking lot, and four ceiling mounted wide angles to see shoplifting activity. Because our suite has two rooms, one of which is non-square and full of camera blocking racks, I wish we had more cameras...8) How many cameras should my DVR handle?For a small retail store, buy a 600TVL to 700TVL analog high resolution or preferably a HD Security DVR, that can handle 8+ cameras! If budgeting, buy a few cameras now, and then add additional cameras later as your budget allows. Over time you will ALWAYS want more cameras. A 4 or 6 camera DVR will need to be completely replaced (more $$$) if you want more than 4 or 6 cameras in the future!9) How much is this going to cost me?In mid 2012, a decent quality 8 camera analog 600TVL to 700TVL analog high resolution system costs between $1500 and $2200, and a HD system between $2400 and $3000. You can cut the cost of entry by buying a 8 camera capable DVR and a few cameras now, then adding more cameras later as you can afford them. Many sites are predicting that HD will displace analog as quickly as it did in TV's, but who knows? I just know that buying old technology never works out for me. Bottom line: We found out the costly and time consuming way that less expensive systems were inadequate for protecting our assets and defend against frivolous lawsuits.10) What about LED day/night cameras?Rule of thumb: day/night IR (Infra-Red ... IR light is invisible) LED cameras work fine, but only up to about 2/3's the advertised illumination range. No matter what brand we tried they came up short. So buy cameras with an IR range that is about 1/3 more than you need. Also, don't go crazy with the IR range either. We tried a day/night camera with a 50 foot range in a small room, and the picture was greatly overexposed. Note: All day/night cameras with LED's produce black and white pictures when it is dark. That's ok, as long as it's high resolution or preferably HD.11) Are there cameras that can see in near darkness without IR LED's?Yes. They are called low lux cameras. Good ones are expensive and need at least a slight amount of well positioned light to work satisfactorily. The two we tried worked, but if the small amount of available lighting was coming from behind or above (moonlight), all we saw was a silhouette of the criminal. IR LED cameras work easier and are better to identify night time crooks for us.12) What about power for the camera(s)?Two options: You either need a power outlet near every camera, or power the cameras with siamese type video/power cable. Siamese video/power cable carries video AND power to the cameras from the DVR location, so the cameras don't need a power outlet locally. This is important to get the optimum camera viewing angles needed. Remember that the cable isn't cheap, so budget it in. This same remote power option is available also with Ethernet NVR systems, and is called POE (Power Over Ethernet).13) Have you watched some security videos on the news, and noticed they were jumpy. Why?It is simplest to explain video the same as film, as actually pictures (frames) that are swapped at a fast rate. 24 to 30fps (frames per second, also sometimes called ips or images per second) is similar to what your TV and theater movies display. This is visually pleasing, but consumes too much disk space for 24 hour security camera videos. DVR's allow you to select the fps, thereby reducing the video storage disk space needed. For our use, 7.5fps missed some action and blurred fast moving people/objects and therefore was unacceptable. 15fps (frames per second) is a good compromise for us, giving fairly smooth more natural looking movement on our videos without eating up too much disk storage space.14) What other limitations do DVR's have besides total number of camera's?DVR's have a limit of how many total fps they can process at one time from all cameras.Example: If the DVR is rated at 60fps total, and has 8 camera ports, the available fps per camera is 7.5fps (60 / 8 = 7.5), too few in my opinion. I would opt for an 8 camera DVR with 120 total fps (15fps per camera), or a 16 camera DVR with 240 total fps (again, 15fps per camera). Both of these would allow each camera 15fps for video capture. (Note that some manufacturers refer to fps as ips.)So my final recommendation for the small business owner is spend your hard earned money on a 8 or 16 camera (also called channels or ports) HD 720p DVR system (or a HD 1080p 8 or 16 camera if you've got the budget). They are relatively easy to install and operate even for smart non-techies. With proper camera positioning, these will give you great video with good digital zoom to nail the criminals.", "Date": "April 8, 2013"}, {"Title": "Professional-level surveillance at a reasonable price that you can install yourself", "Author": "Jerry Saperstein", "ReviewID": "R2NVRQWFHS895D", "Overall": "5.0", "Content": "As a computer forensics expert, I've seen surveillance systems up close and personal. Most of the readily affordable systems don't deliver useful quality: my assignments have always been to enhance the images so faces and actions were recognizable. The standalone systems were all based on Linux motherboards that were typically underpowered, contributing to the poor results. The Q-See QC808-461 is both noteworthy and remarkable for a number of reasons. First, the images produced by the 720p cameras are usable. While not comparable to the output of a higher-end Nikon or Canon DSLR, facial details in good lighting were recognizable at a reasonable distance. Obviously, results will deteriorate along with lighting conditions and the use of the IR (InfraRed) illuminators. Overall, the imagery produced by the QC808-461 is, based on my experience with other systems, a couple of notches better than the norm. Next, this system is designed for DIY (Do It Yourself) installation - and I am inclined to describe Q-See's efforts in this regard in superlatives. I am one of these people whose first piece of advice is almost always \"Read The Manual. (Experienced IT people will notice the absence, for review purposes only, of a certain expletive.) The folks at Q-See have very clearly read the manual on creating manuals: the Quick-Start guides and User Manual are literal masterpieces of clarity, which as most tech consumers know, is a rarity. A patient person reading the directions in the Quick Start guide will be up and running with the Q-See QC808-461 within a very short time. What is particularly interesting is that Q-See provides separate instructions for using the system with AT&T; U-Verse installations using their 2Wire routers, which are very different than more common routers. To me, this indicates Q-See's desire to 1) make the installation process painless for the user, 2) cut down on tech support calls from angry, confused users who can't make their system work. For most, the Quick Start guides will be all that is needed to get the NVR (Network Video Recorder), the cameras connected and operational, the NVR set-up for access via the internet. Q-See provides a PC application as well as apps for Android and Apple devices. I had no problem with the PC and Android software. Q-See also provides a free DNS service so you can view your surveillance cameras from anywhere via the internet. Power-Over-Ethernet (POE) is a clever idea: you don't need separate AC power supplies for each camera. Lighting, motion alarm detection and other features are all available on the NVR itself or through the software. By the way, the NVR is powered by a dual core CPU on a Linux motherboard - not that any average user will ever get near it. The 1 Terabyte drive provides more recording capacity than anyone if likely to use, although you can substitute hard drives of up to 3 TB capacity. Additional cameras may be added via an Ethernet connection. There is also a user manual which is extremely well designed, well written and thorough. It contains instructions on how to do everything with this system in clear English, with lots of informative illustrations. Overall, I think the QC808-461 is a very user-friendly, well-engineered system for providing high-quality surveillance imagery. I think it is darned near perfect for homes and small businesses. There are less expensive alternatives available, but take it from someone who gets paid well to enhance images from those lower-cost systems, saving a penny in acquisition costs may cost you a pound of flesh later when you need clear images. If you're shopping for surveillance equipment, I strongly urge considering the QC808-461. In particular, spend some time with their Quick Start and User Manuals which are available on their website. You'll be impressed.Jerry", "Date": "March 27, 2013"}, {"Title": "The jury is still out on this one", "Author": "Hugh W. Cox Jr.", "ReviewID": "REDD45Y16P3JB", "Overall": "4.0", "Content": "First let me say that everything came in on time and very well packed.  No issues at all there.  I am still in the process of installing the cameras so I can't speak to their quality at the moment, but some limited testing inside, makes me suspect of their range and quality.  Time will tell.  Let me qualify the rest of this with a few statements.  I have a more complex network than the average small business or home user.  I have worked in the IT field as a system admin, Network admin, telecom and developer for over 20 years.  That's not to say I know everything, but it's to say that I know enough to be dangerous and get frustrated with first level support people reading from a script fairly quickly.  I did not try hooking the cameras up to the POE ports integrated into the server.  Given the placement of my cameras I was not going to be able to use them anyway.Pros:1. Packaged very nicely and neatly.  It comes with 4 100ft cables already terminated.2. The cameras seem to be well made.3. The included software even just the web page is very functional, and offers a lot of features and customizations.  it seems to be very powerful.4. Initial setup of the cameras was very easy.  The search functionality found them on the various switches I had them plugged into.Cons:1. Like someone else said in one of their reviews.  Cameras are a bandwidth hog.  I have gigabit through most of my network all the way out to the endpoint.  Even so, I can tell when I have the cameras on. (8/22/2013 update - if you know what you are doing and are willing to spend a little time, you can setup a VLAN with your switches and isolate the cameras and NVR to a subnet all their own.  This way it doesn't impact the network for everyone else in the family.  Q-SEE doesn't know how to do this, and I really wouldn't expect them to, but if you know what you are doing, you can do this fairly easily if your switching equipment supports it.)2. It would be nice if the NVR came rack mountable.3. It might be the KVM switch I tried to use, but the NVR would not recognize the mouse attached to my KVM.4. My relatively new (year or so old) Vizio TV would not recognize the HDMI video signal produced by the system.5. I understand that you would not normally want a keyboard attached to the device and that having one there is kind of like lipstick on a pig, but it would make things easier during setup.  The popup keyboard is nice, but real keyboard support would have been nicer.Support: (This is where I started deducting stars)1. Like I said earlier, I'm not normal.  Support was great as long as I stuck with the standard kind of setup questions.  But as soon as I got somewhat outside the box, they stopped responding to my questions.2. I had one camera that I believe was probably a refurbished camera.  I believe this because instead of being setup for DHCP like the others it had a static IP address assigned for a subnet other than mine which made connecting to it a pain.  When I opened a ticket asking how to do a factory reset, I was told I needed to install new firmware on the camera.  Well, maybe so, but how do you install new firmware on a camera you can't access.I will update this as I get farther into the installation.  The scores may go up if they start responding to my tickets again.  All in all the system is good for the money, and the support is good for the normal home or small business user.8/22/2013 update - Well, I installed the cameras outside today.  Got an electrician to come out and help with running the wire.  I've run enough wire in my time and crawling through the attic was just not on my list of things to do today.  I have 4 cameras hooked up.  They all went up easily and have a good clear picture.  The one gotcha I have at this moment is that I can't figure out how to tighten the camera so it stays in position.  I know it has to be something easy, I just can't see it.I will give their tech support this. They are persistent.  They have worked through and answered all of the questions I had and on the one question they could not answer, they gave me the contact information for the manufacturer of the NVR so I could contact them.  It's refreshing to have a vendor say \"I don't know, but here is where you can find out\", rather than give half baked answers that don't really answer your question.I'm getting more and more satisfied with these units.  I'm even going to give them a star back for staying after the support issues I had and working them through with me.", "Date": "August 8, 2013"}, {"Title": "Happy with Image Quality, Difficult with Installation", "Author": "Constantine G. Caracostis", "ReviewID": "R3GMP5WFF729Y0", "Overall": "3.0", "Content": "I am first time buyer of such equipment but I wanted a system using network cables and POE to avoid having to provide power to the cameras and the BNC connections.Positive Comments. I like the image quality of the cameras. The 6mm focal point has a narrow field of view (around 45 deg) which is somewhat smaller that I wanted. But cameras look sturdy and well made. I have also been quite happy with the technical support by phone and e-mail. They were quite knowledgeable and responsive and helped me with my frustrations in setting up the system and accomplish remote viewing. The manuals were very well written and instructive but there were a few critical details that were missing that I managed to resolve them the hard way.Negative Comments: The setting up of the system proved to be quite a burden. Not being familiar with all the intricacies of setting up networks and also having a U-verse (AT&T;) router (for which they provide separate instructions) I had quite a task, which resulted in several times locking my system and asking for a password reset (All these after I had an \"expert\" making quite a few correct settings but also not being familiar with Q-see equipment making a few errors as well. I also found that the screws for supporting the cameras under par, and I needed to find more appropriate screws for a sturdy support. I also purchased a fifth dome camera (QCN7002D) that claimed to have date/night vision that shows no image with no light at night since it has no IR leds. Also the NVR makes some noise (as other DVRs of this type) that I had to move it to a location away from my work area.Overall, I learned quite a few things from this experience and although I am not totally happy with my choice I am also not totally disappointed. I may have to add a few more cameras for more complete surveillance but at the moment I am hesitant to add cameras to the system from other manufacturers. I may add to these comments at a later time as I gain familiarity and experience in the use of the system. I do not how the software from other companies work but the Q-see seem to work quite well when everything is set up correctly but it was quite an effort on my part to make the correct settings. However, the iphone and ipad connections worked much better than other remote connections.", "Date": "June 21, 2013"}, {"Title": "Smoke and Mirrors", "Author": "JEFF GERLING", "ReviewID": "R65DLZ2KRGN5E", "Overall": "1.0", "Content": "I bought this system expecting to have a fabulous security system that would do all these wonderful things advertized.  So far after two weeks with technical support, I have only two cameras operating properly with a third going between black and white and color and a 4th that was DOA.  In order to remote view, I had to convert my current IP address to a static versus dynamic, which added another $15 a month to my internet bill. I have yet to get the email alerts to work properly. It still randomly sends me pictures stating a motion alert and when I view the picture there is nothing there, then I can stand in front of the camera jumping up and down and it won't send me a motion alert. Forget about technical support.  I am two weeks into the email technical support and I know I am still going through their standard checklist of questions they ask.  It takes about 36 hours for them to respond to your question, if they even understand your question in the first place. The latest was the model number of the camera.  Really, you sold me the system and you don't know the model number of the camera?!! The kicker is that if you want to return the system, you have to have it like new in sell-able condition along with all the parts.  Well, if you've strung 400' of cat 5 cable in a professional manner, using over 300 wire staples, it's quite time consuming to go back and undo all of that and make the unit look new.  By the way, you can buy these at Sams Club. Wish I had know that prior to buying here on Amazon because then the return would have been very simple.", "Date": "September 2, 2013"}, {"Title": "Q-See 808", "Author": "Warren Smith", "ReviewID": "R3K2M2CNHAFLPY", "Overall": "4.0", "Content": "I have to say took some time to get it setup but well worth it.The video quality is great for a low $$ system.Can see cameras from my HTC EVO LTE with no trouble.Just read read read. then read some more.The night IR works great I can see everything within 75 to 100 feet.", "Date": "February 5, 2013"}, {"Title": "nothing but problems, cameras inconsistent color, poor reliability", "Author": "mark m", "ReviewID": "R2FZR7XN4NWGT9", "Overall": "2.0", "Content": "Initially 1 camera started acting up in the terms of color; seemed to have difficulty determining if it was night or day...eventually all the cams started the same symptoms..Support online was sloooowwww in return and all the inquires from the Q-See trouble shooting staff revolved around \"where did I buy my cameras\" or \"did I purchase the system through Costco\"!I..Possibly to determine ease of return or replacement... in fact I switched cams to other ports, rebooted, changed poe cables, rerouted cables, swapped cams and locations via ports and every time I returned this information in a response email I was asked the same questions and told to do the same thing of which I said I did, as if nobody had read any of my return emails which is a pain to communicate through to begin with making a unpleasant scenario worse!!!  Finally after expressing my disappointment with the q-see trouble shooting team which was useless to contact by \"email\" in my opinion I was emailed a link to receive a RMA # for a return of the troubled cams only!!Great!! so I would have to wait to see if the cams were at fault or if it was the system or just setup issues and be left without surveillance at the mercy of a turn around time not disclosed...I decided to keep the cams and deal with the color changes due to the fact they still had a clear image..Even though the 808-461 knowingly has only 4 cams and is advertised as a 8 cam system it only has 4 poe ports, why would I buy a 8 cam system with 4 ports? because if it were \"advertised\" as a 8 cam system with only 4 POE ports needing an additional $150 POE switch to turn it into a 8 cam system I would not have purchased it also, statistically sales would probably be lower as consumers would expect a lower price tag..Why it is so difficult to supply a system with eight POE ports is a mystery to me....However,  there is still a minor statement in the add in order to add cams use a POE switch , so read adds completely ( another $150) and there is absolutely no info on these upgrades consequently its all a mystery on how to do any upgrades or just basic setup unless one has extensive knowledge on this matter..Finally I purchased the additional POE switch and 4 more 1080p cams with a 3TB HDD to add... Adding the HDD was a straight forward procedure of course as was the POE switch..However, having problems configuring the system to add the 4 cams I once again contacted Q-See tech support but, this time by phone and I am still in the process of configuring the system to view the addition 4 cams with progress and should have them up and configured asap thanks to speaking directly to a member of tech support which I highly advise opposed to email contact..Bottom line is ; You must download the entire manual and study it as you perform tedious tweaking and numerous configurations to the systems internal on screen adjustments to time frames, camera settings etc...\"internal settings and configuration of FPS, recording options, Kb/S etc..can and do have a effect on performance and live view which is expected of you to know first hand!..This system has so many optional scenarios for one to taylor it can be difficult to decide how you'll want to configure everything as the adjustments can seem endless but the many options allow for serious fine tuning and tailoring..\"Do\" as much research on home/business surveillance systems as possible unless you are a network engineer or It can be a nightmare if you have equipment problems, additional equipment needs (POE switches, HDD drives etc..) or set up issues which will consequently have to be researched extensively...Truthfully; the answers are all there in the online manual and with the help of a live voice it is manageable but, It is a relatively advanced system which allows for upgrades with no indication or additional hardware to do so consequently I believe it is still a good alternative to a mega big bucks system or forking out a couple K for an install...The start up literature is a joke which is to say all it does is \"start you up and thrust you into a realm of the unknown configuration\" you'll get a crash course in \"ADVANCED SURVEILLANCE SYSTEMS 101\"...I believe most of the reviews here are from those who have some basic knowledge of IP cams and surveillance units to start with...It is not a simple up and running system for the novice....Although the q-See 1080 cams I purchased are more costly and should be clearer than the 720 cams they do not project as much IR light for night vision as the 720 cams...Additionally, I truthfully cannot tell the difference in terms of detail, color or clarity between the 1080p and 720p cams BUT in fact I can indecisively say I have had too many problems, erratic non consistent  color and constant FOGGING up with SEVERAL of the 720p cams and a few 1080p cams also..Additionally, the q-see 1080p cams have a much wider angle or panoramic view making them more suited for close up wide angle surveillance as opposed to any kind of distance...CONSEQUENTLY AFTER ALL THIS I HAVE SENT THE UNIT BACK TO THE MERCHANT FOR A REFUND AS I DID WHAT I COULD TO RETIFY ALL THESE PROBLEMS AT NO RESOLVE...I WILL UPDATE ON THE RETURN STATUS SOON...", "Date": "October 29, 2013"}, {"Title": "great system, clear pictures", "Author": "Laura B", "ReviewID": "R134NG2TBI4WUV", "Overall": "4.0", "Content": "After my in-law's home was broken into (while they were on vacation) and none of the neighbors saw anything, I became nervous about not having any surveillance system in my home.  Although it might not prevent burglars from breaking in, at least there is some evidence available to help find them (as long as the NVR is not stolen as well).This system has everything you need in the box.  Four HD cameras and all the cords needed to setup.  I love the POE cords since you don't need to find a power source for each camera (they are all powered through the Ethernet to the NVR).Setup was fairly uncomplicated following all the directions.  I did have issues with the port assignments, though, since I already have IP cameras in my house (used as baby monitors).  I was using port 85 for one of the other cameras and when I went through setup, it overwrote the other camera in port 85 so I had to go in and change the port setting of my other camera.  I could not see a way to change the port setting for the NVR as I was doing the setup and that was not in the directions.To me the most complicated part is finding the right location for the NVR.  Instructions say that it needs to be plugged directly into the wireless router (I actually went through a hub and had no problems, though), so you need room for it wherever that is.  I do not have a TV or monitor where my router is, so this caused a little problem (hence why I went through an electrical outlet hub to the other room).  Also, since all the cameras need to be wired, I need to be able to get all the wires through the house and to the NVR.  That is more complicated as it requires going through the walls.I setup viewing on both my computer and the iPad with no issues.  The iPad app is a little complicated, but overall very nice.I'm very happy with this setup and feel more secure with it.", "Date": "April 17, 2013"}, {"Title": "Great for Monitoring--Not So Great To Setup--and Not Mac or iPad Friendly", "Author": "Jeffrey N. Fritz \"Nikon Jeff\"", "ReviewID": "R1ZQ06601C3PSG", "Overall": "3.0", "Content": "The Q-See QC808-461-1 8 Channel HD Digital NVR with 1TB Hard Drive and 4 HD 720p IP Cameras allows the simultaneous monitoring of up to eight video cameras. You can view them on a directly connected monitor, a TV, an iPhone and iPad or an Android device. It sounded like something that we needed to keep an eye on our outside doors that were hidden from the main street.Q-See doesn't forget a thing in terms of what you need to run this device. The NVR, the cameras, the Ethernet cables, connectors, remote control, batteries and even a mouse is provided in the box. I was excited and couldn't wait to set the NVR up in our home. I should have been more patient.I first attempted to use the setup menu with the remote control--and this was a big mistake. Although the system allows you to do this, the setup menu is very hard to operate with the remote. You are far better off using the mouse--especially because the setup menu comes up the first time the unit is started but can not be recalled again with the remote. And, to make matters worse, it's far too easy to hit the wrong key on the remote and dismiss the setup dialog entirely. Once I got it in my head to use the mouse, things went a bit easier.I was able to configure and install the NVR unit in the network rack in our machine room. (The NVR has audible fan noise so you will not want to put it with your home theater gear.) It was relatively easy to access the unit remotely from a Window 7 PC with Internet Explorer. However, Q-See neglected in their documentation to tell the user to input both the NVR IP address and the port in Internet Explorer's address bar. Suppose that your NVR has an IP address of 192.168.1.10. You enter \"192.168.1.10\" as the documentation suggests, that won't work. You need to enter \"192.168.1.10:85\" (assuming 85 is the port number.) The IP address and the port number are available from the Netwok Icon on the setup screen.The same ease of setup, unfortunately, can't be said for access from a Mac or an iPad. The problem is that, for the Mac, there are two different monitoring applications that can be used. Sadly, the information available from the Q-See web site does a rather poor job of helping you decide which Mac application to use. Both use a version of PSS (Pro Surveillance System.) However, while the Q-See web site does mention that PSS can't be used with Mountain Lion (OS 10.8.) (PSS Mini needs to be use with Mountain Lion,) it neglects to mention that PSS (not the Mini version) will not run with Lion either (OS 10.7.) (Is your head spinning yet?) That led to many hours of trying to figure out what I was doing wrong before I broke down and contacted Q-See support for help.(Q-See support, BTW, runs on Pacific time, so you must wait until after 1 PM to contact them if you are on the East Coast of the U.S. That is rather poor support hours on Q-See's part.)The iPad is even more of a conundrum. There are at least three different apps for the iPad for Q-See devices and it isn't always clear which app works with what Q-See NVR. I thought that I had downloaded the correct iPad app, but it kept giving me \"connection failed\" messages without much more of an explanation as to what was wrong. After contacting support, they told me that Q-See QC View HD was the correct app for my unit and an iPad. Q-See has more work to do in order to make these app suggestions clear to users.Sadly, setting the iPad app doesn't end the issues. I continually get \"out of memory\" errors from the Q-See QC View HD app. Oh BTW, did I mention that my iPad has 64 GBs of memory and that Q-See QC View HD is the only app running?  The iPad app is clearly not ready for prime time yet. Because I plan to use my iPad at home and remotely to monitor my Q-See NVR, I had to deduct a star from my rating. Because the Mac situation isn't more transparent to the user--in fact every single OS application operates differently and has a different user interface from the others--I deducted another star.Although I did not deduct a star for this, be aware that all communications with the cameras and the NVR are via IP, and thus there is an impact on your home network. You have network packets traveling back and forth from each camera to the NVR and packets traveling back and forth between the NVR and the network devices that you use to watch the camera feeds (PC, Mac, etc.) This can create quite a bit of network traffic slowing down even Gigabit networks--so please be aware of this. For it's part, Q-See is absolutely silent in warning you about the impact on your network.My last disappointment was that, according to Q-See support you can not use a wireless IP camera with this NVR. Why is this important? Because I have multiple locations that I would prefer to monitor from the outside of the house. Running an Ethernet cable from inside of the house through a window, a door or a hole drilled in the house is not very attractive. Therefore, the inability to use a wireless IP camera with the system is a major disappointment.My complaints and concerns as expressed in this review are important especially if you are considering this as a security monitoring system for your home. On the other hand, if you can get passed it quirks (or hire a professional installer who trains you on the system) you will find this a very capable security system. It's too new in my home to speak to its reliability, but the build quality is quite good. Mostly metal is used especially in the NVR and the cameras where this counts. Just give us an easier, more transparent setup and a better integration of the monitoring applications, and an iPad app that doesn't constantly complain about memory issues, and I might just give you those two stars back, Q-See folks.", "Date": "February 28, 2013"}, {"Title": "Works as advertised when properly setup", "Author": "J. Bellizzi Jr. \"Gonzo\"", "ReviewID": "R1G175PQ1DXO1H", "Overall": "5.0", "Content": "Ok, some people that purchase this system (qc-804 with 4 720 high def cameras), may have problems getting it setup with remote viewing.  I know I did!! BE PATIENT!!  Learn the proper way of setting it up!! talk to customer service!!!  I was on the line with them for over an hour one time.  After a week, I finally got it tweaked the way I wanted it.  The nice thing is the backup system.  You can use whats called Config backup, for backing up your settings alone, this assists when the unit itself needs to be replaced with another.  Case in point, I had to return my NVR (qc-804) just last month, since the cooling fan was making noises (it didn't fail, but wanted to be proactive before it did).  The process was very smooth!! They sent an advanced replacement nvr, I in turn backed up my settings I had on the older unit to a usb drive, then replaced the unit with the new one, and imported the settings back to the new unit.  SMOOOTH AS A BABIES BUTTT!! LOL LOL.  All my settings were restored so I didn't have to spend another hour on the phone with tech support!!!  That's what makes Q-see the best out their, if something fails (and believe me, with this type of equipment, sometimes it does!!!), they are quick to get you a replacement unit, and friendly customer service with the RMA process!!  As for the performace, well, its astounding!! the recording is excellent when viewed from a smart phone, or remotely on any pc, after setting up remote viewing properly.  I feel much more secure now around my home with this monitoring system.  I installed it myself, since their is only one wire to hook up, the Ethernet cord!! So off to the attic I went, and carefully threaded the line to where I wanted it, and drilled through to the outside of the home, making sure it was not in direct rain or precipitation. I live in Iowa, so the winters can get below 0 deg sometimes, but the unit still functions great!! I have had this 4 camera system for over a year now, and had one camera replaced and the nvr replaced, but since the process was easy, I would definitely buy from this magnificent company again!!", "Date": "September 12, 2013"}, {"Title": "High Quality video", "Author": "Dale \"DaleDJ\"", "ReviewID": "R1XJ3OC5IO9D0G", "Overall": "4.0", "Content": "This system works very well and produces high quality video, both live and in recorded form. The web interface works as do the Q-See iPhone, iPad and Android applications. Setting it up can be a bit tricky as the user interface is somewhat cumbersome. It took me a while, for example, to discover that I needed to record the low definition video stream if I wanted to view the recorded videos on the iPhone or Android phones.The price for this unit seems to have been going up on amazon lately. It was $849 at one point and now seems to be almost $1000.", "Date": "August 24, 2013"}, {"Title": "Complete garbage", "Author": "Luke Chavers \"- Luke\"", "ReviewID": "RH3PC01VEVC6E", "Overall": "1.0", "Content": "Don't waste your money on this, its really, really bad.The user interface is about as bad as you could hope for.  Well, maybe one notch up from as bad as you could hope for.  Navigating around is like pulling teeth and every little thing you have to do eats up an hour of your day.Q-See has made, as best as I can tell, exactly ZERO strides towards being compatible with non-QC cameras.  I hoped the included cameras could be paired with a few other specialty cameras I bought, but I was let down in a big way.  This NVR is compatible with the cameras it ships with, and as far as I can tell, nothing else.Every part of the setup on this device was taxing, every little part, and the web interface may as well not exist as far as I'm concerned.  After 8 or 10 hours I finally got it working, if you want to call it that.I'm a nerd myself, with years of experience with IT, and I still had to call my systems admin buddy from work to finish this install.I read the reviews before I bought it and I saw positives and negatives... pretty well balanced.  But, trust me, the negative reviews are far, far, far closer to the truth here.The camera quality is good, though, but that's literally the only nice thing I can say.Save your money.. move on.. you'll regret every minute if you buy this set.", "Date": "October 16, 2013"}, {"Title": "Awesome Setup", "Author": "Jerry Palmerino Jr", "ReviewID": "RCVY4PWBZ8E9A", "Overall": "5.0", "Content": "I live in a townhome community and my truck has been keyed twice.  This is the perfect solution for security monitoring and is much better than other options, such as webcams, since it has a DVR box.It comes with 4 HD cameras and the cables to hook them up.  These are ethernet cables and it supports POE (power over ethernet).  This saves you from having to have an outlet near where you want to place the cameras.  The DVR simply pushes the electricity over the unused pairs inside the ethernet cable.  That said, I really wish the cameras were wireless.  It is 2013 afterall.  But if you do you homework, you'd know that before purchasing this system, so I cannot fault it for that.  The hardest (both mentally and physically) part of setting this up was camera placement.  I was really reluctant to drill through interior walls to get to the exterior to mount the cameras.  I ended up locating where my cable TV wires come into the house and peeling away the caulk so that I could push the ethernet cable through.  I wonder if this device would work with flat ethernet cables. I suppose it would, but I haven't tried.The infrared works pretty well at night.  I can see maybe 50 feet or so.  If you mount your cameras indoors and point them out the windows, you might get some infrared glare in the video.  It is best to mount these \"weatherproof\" cameras outside.  Keep in mind that weatherproof doesn't mean waterproof.I hooked this up to a small tv for viewing. Now I can see packages being delivered!  Hopefully my truck never gets keyed again, but if it does, I will have video footage for the police.", "Date": "May 15, 2013"}, {"Title": "Great security system, PoE is extremely useful", "Author": "XNOR", "ReviewID": "R2D6ELGO0F96M2", "Overall": "5.0", "Content": "This is the fourth security system which I using and the best of the lot which I have used.The primary difference between the ones which I have used earlier to this one is that this is a complete system compared to the earlier ones (Dlink, Netgear ...).Dlink and Netgear both are wireless cameras which can beam videos, view them on iPhone/Android/Web and can send alerts whenever there is a movement.  So, if there is a intruder or a cat which passes in the view of the camera, it will instantly send you an email.  What the Dlink and Netgear does not do is to record it, neither does it have PoE (more on it later).I have had my eyes on Q-See for a long time, but always deferred my decision if such a full fledged unit was needed for my home.  After getting it and installing it, I feel that this should be a part of every home.Power over Ethernet is a technology where you can use your home wiring as network cables - the advantage is the speed and reliability.The biggest challenge in setting up this security unit was placement of the cameras since I had to identify the right locations without intruding into our own privacy.", "Date": "May 14, 2013"}, {"Title": "Can't give full review yet", "Author": "Eric", "ReviewID": "RI3P9YVO2HYHK", "Overall": "3.0", "Content": "Seems to only hold 2 weeks of data and not simple to view remotely. I'm so busy I haven't had time to call and see about those two things though. Hopefully I find some time to call their customer service.", "Date": "October 24, 2013"}], "ProductInfo": {"Price": "$1,599.99", "Features": "Full HD Recording Resolution (HD 1080p: 1920×1080/HD 720p: 1280×720)\n4 High Definition 720p IP Cameras with 100 Feet Night Vision Range\nFour Built-in POE Ports that eliminate the need for extra cables\nOffsite Remote Recording on IP Cameras\nPre-installed 1 TB A/V Rated SATA Hard Drive", "Name": "Q-See QC808-461-1 8 Channel HD Digital NVR with 1TB Hard Drive and 4 HD 720p IP Cameras (Black/White)", "ImgURL": "http://ecx.images-amazon.com/images/I/410UBLeNqiL._SX300_.jpg", "ProductID": "B00ANII768"}}