{"Reviews": [{"Title": "Worth the money", "Author": "Rob", "ReviewID": "R16U3VOEXS5PEH", "Overall": "4.0", "Content": "I bought this from another vendor, but I thought I should post my comments to help others looking to buy from Amazon to decide. So far the system is working as expected. The only problem I ran into was that the DID number was not in Uniden's database when I went to setup the online account. That was easily fixed with a phone call asking customer service to manually entered the units DID number into their system. Now I can see the video nice and clear on my android phone and on other computers over the internet. All it took was a phone call and a few minutes waiting and the video system is working as advertised. People must remember that if they want a high end system with HD video you have to pay high end prices. This is definitely not a high end system, but it works great for what it costs.", "Date": "October 22, 2013"}, {"Title": "A good upgrade from UDW system, but...", "Author": "bptexas", "ReviewID": "R1KKA0Z247M7OA", "Overall": "2.0", "Content": "I purchased 2 of these units plus 4 extra cameras as an upgrade to my existing UDW2055. I purchased this unit over the G555/G755/G955 units because, per their manuals, the UDS655 allows for wall mounting with a USB network connectivity to a computer (must use cradle on other unit and no USB) and it has an overwrite option once the SD card fills (other units must be manually deleted once filled).Pros:1) Screen resolution is good. Really like this upgrade vs the UDW unit.2) Unlike some of the reviews, I think Uniden support is very good. I've called 2x and got immediate US based support. Kind of sad that I had to give them both DID numbers to add to their server for remote access.3) Pretty easy to setup, but took some tinkering to get the iPhone/iPad remote access to work4) Per another review it does not significantly slow down wifi. I have a Lynksys W2000 dual band. I turned off the 5 ghz channel and did bandwidth tests with all 8 cameras on and both units networked. Nearly no drop. If you are concerned, get a dual band and run your home wifi on the 5 ghz channel.5) There is no firmware upgrade needed on this unit, so I think the previous reviewer is mixing up units.6) Unbelievably I discovered that my bluetooth mouse was blocking networking of the cameras. I have the units hooked up each to a laptop that is wireless on my home wifi. To my amazement it was not working at all until I took out the USB bluetooth adapter for the microsoft mouse on one of the laptops, then whoala, both worked fine.Cons:1) Signal strength is much weaker that UDW units. I put cameras and monitors in the exact same locations and 6 of them do not stay linked. I've purchased more powerful antennas to remedy this. If it doesn't work I'm returning everything!2) 2 of the 8 cameras were faulty. One had a loose internal camera. The other had a large dark spot3) The 2 base monitors interfere with each other. I get better, but still not satisfactory, reception to cameras when I turn off one of the screens. A few of the cameras are at about 25' with 2-3 sheatrocked and wood framed walls, and still no consistent 2+ bar reception!4) Cannot network 2 units with 1 computer via USB's. Each monitor must have it's own computer for networking. There needs to be a software update for this. Just silly!5) Motion detection is not per individual camera. What I mean by this is if any camera detects motion, it records in split screen mode and records all 4 cameras. This gives you a single image recording of all for cameras which is just horrible resolution. Again these needs to be fixed via a firmware update!6) Can only view recorded footage with Uniden software player. Come on! I absolutely hate this mediocre player. I can't zoom in on footage. I can't even make the player viewing window bigger. I hope to find something else that will play these files.So, I've spent ~$900 to upgrade. Really questioning if the remote access is worth it, as this is really the only significant upgrade I'm getting over the UDW systems...that is if I can get the camera signal intensity issue fixed.12-7-13 update;So after tinkering with antenna positioning, all kinds of new antennas and extension cables, including 7 Dbi directional, I finally determined the signal issue was with the base units. I had 2 units wall mounted with 6\" apart. The units interfere with each other! Allowing about 10 ft of separation solved most of the signal issues. So I now have a unit at either end of the house. Unfortunately the signal strength is still not strong enough to completely roam around my house and pick up all cameras, but I've paired each unit to the 4 closest cameras and this will have to do.", "Date": "November 20, 2013"}, {"Title": "disc not any use", "Author": "mindin my stomach", "ReviewID": "R1GCABNKBAS50L", "Overall": "4.0", "Content": "One bad thing  about the program for the computer it is rejected by Windows 8  the unit works well that's why we didn't return it", "Date": "May 9, 2013"}, {"Title": "Don't buy", "Author": "MichelleRodri", "ReviewID": "R2YQZ523AJSS4U", "Overall": "1.0", "Content": "I would recommend you do not buy this product.  For a company selling technology there website seems like you stepped back in time. It took a while but finally through online got it to register, but couldn't get the software on my computer to work.  Somehow over the next couple days my father in law did with his own computer but left with it.  When using my computer at home ran into the same problem, it acts like each time you go online like you never setup your camera before and tells you your DID code is wrong.  then the software on the computer tells you to choose a USB source, when it's blank.  Customer Service?  Your ok if you don't work, but if you have a job, your screwed, because there customer service is only open when your at work, and you need to be home to be hooked up to the system to go through the support you need.  Super frustrating for something that should be plug and play.", "Date": "February 16, 2014"}, {"Title": "Camera Issues", "Author": "Robert E.", "ReviewID": "R14RHAFH71MLHO", "Overall": "2.0", "Content": "Got the equipment fairly quick. Put it into operation and after the 2nd night, the \"night-vision\" went out on 1 camera. 2 days later, the other camera went dark at night also. Contacted Uniden and they're resolving the issue. BUT, it cost me an additional $38.00 to have the cameras shipped to them for warranty work....  NOT A GOOD EXPERIENCE!!!!", "Date": "January 11, 2014"}, {"Title": "Ok system, if you do not have monitor issues", "Author": "Ronnie J.", "ReviewID": "R3PQX9JBCTYE84", "Overall": "3.0", "Content": "It started out ok, but then it had trouble pairing with the second camera...and when it did, you could not switch back and forth on the monitor to watch one or the other............sent it back.....the camera picture quality was pretty good, night and day...but issues with the monitor", "Date": "December 4, 2013"}, {"Title": "Does Not Work With Windows7/IE9", "Author": "Michael A Haluski", "ReviewID": "R1IQPPG4OQWP7S", "Overall": "1.0", "Content": "Be warned that the camera will not work when combined with Windows 7 and IE9.  Uniden customer support is no help, their suggestion is return it to the store where I bought it and to buy a more expensive outfit.  You cannot monitor the system remotely through your iPhone application.  It'd be a great system if it worked with the latest software but that just isn't the case.  Uniden will not replace it nor will they refund your money, so if you buy it and install it do so at your own risk.  Many stores will not accept a return if the items has been installed and used.", "Date": "February 18, 2014"}, {"Title": "Great product", "Author": "Clarence Jimenez", "ReviewID": "R1U9T5HMVVVUK0", "Overall": "4.0", "Content": "I love these cameras.  They have great features and the best one is that you are able to view the camera from your smart phone.  I can be at work and see what is going on at my house.  The only reason it gets four stars instead of five is because the motion sensor is painfully sensitive.  I turned down the sensitivity and it didn't seem to change anything at all.  I delete at least twenty videos a day of a bug flying in front of the cameras.", "Date": "April 11, 2014"}, {"Title": "Good idea but...", "Author": "Kevin B.", "ReviewID": "R212IH8E90AFOD", "Overall": "2.0", "Content": "this system uses the 2.4 Ghz band that is horribly polluted from everything from microwaves,phones and routers. Mine constantly looses signal in one of the outdoor cameras less than 100' away. While the idea of wireless cameras sounds great they still need a power wire run to it through walls and to a (heh) nearby outlet to power them. I'm probably going to swap these out for a hardwired setup.", "Date": "February 6, 2014"}, {"Title": "Warning: This is not an Internet protocol (IP) surveillance system.", "Author": "N. Lin \"newmanklin\"", "ReviewID": "R35WX7A98VF02A", "Overall": "2.0", "Content": "This is not an Internet protocol (IP) surveillance system.It cannot connect to internet without a PC.Uniden advertises it to be like an IP surveillance system.It tries to fool customers.", "Date": "February 25, 2014"}, {"Title": "just a closed circuit video cam system, \"no more\"...", "Author": "Robert Carlton", "ReviewID": "R2UP0O0KCLZ1CF", "Overall": "2.0", "Content": "This unit does not connect to the intent as advertised, the software doesn't work. And not even Uniden can help get the unit to work because the programming doesn't exist. The sad part is they'll keep you on the phone with support for hours with no idea how to get it to work. In the end with me, support just said \"go to our download page and download the software from there, OK, got it? Bye\". (Yea really)... And that didn't work either.Its truly false advertising. Sorry, but remote access is what I needed it to do, and it does not, I'm returning it.", "Date": "August 9, 2013"}, {"Title": "Uniden UDS655 7-Inch Video Surveillance with 2 Outdoor Cameras and 4GB card", "Author": "Amazon User", "ReviewID": "RRIVWCXCFTQ8A", "Overall": "2.0", "Content": "It does not perform as described, e.g. the quality of the image was minimally passable, zoom was useless at this resolution since so pixelated, will not remote connect without some specific firmware update that does not exist where stated (PDF, or website), the ID number \"DID\" on mine was not \"in their database\", \"yet\"? call or email for further you are told (M-F certain times for Telco Automated system). I've worked as 3rd tier tech support within IT R&D; and knew quickly where this was going, especially w/o immediate access to required software and config files, etc. Mine did not do what it said it would no matter the direction source, PDF, Uniden.com web site, other 3rd party \"help\" which was simply a review. Moreover, since many folks might start a project endo of week/\"weekend\", non-24-live support for \"stuff\" simply not online to download is \"bad\", as far as I am concerned.Other, in no particular order of issue: - Start up instruction says to,----peel the protective plastic from the Monitor Screen. I could not. It appeared as being under the Frame (the pull tab came off w/o the plastic). Now, this is assuming the plastic is there (?) since hard to tell. Otherwise, the Monitor screen was significantly scratched/appeared used (?). - The infrared override it is supposed to have, if there, is not a function you can control. I wanted to so could put the camera behind glass and use exterior light only. How is it overridden? (Bright direct light? Does not work in my experience). - The overall appearance is as \"good\", good quality. However, with so many warnings about being Outdoor certified but don't, defeats the purpose for 50% of it's use in my need ----I was OK w/it if Infrared override functioned which did not. Inside use is perfectly suitable quality, however, well, within normal room distances. For me, over 30 feet and you might not be able to recognize a stranger a second time (someone you know, no problem, unknown not likely for me). - The Motion detection, sensitivity settings appeared to be functional and without issue (blocking off grid, and w/3 levels of sensitivity -- \"good\"). But, a little \"gltichy\" which seemed to settle down. That disturbed me since no \"logic\" is involved which means unpredictable for Motion Detection then -- so, for me, \"not good\". - Moreover, the record feature could really be made functional at 15sec - 30sec or customer timer settings, then 1min . . . since \"Motion\" initiation would simply continue. So, why then, continue beyond 10, 15 or 30secs after motion stops (2mins was minimum)? It does have a continuous over-right which was \"good\". But, 40hrs would fill up fast per the supplied card \"size\".Since I spent a day giving this a fair shot, e.g. trying to find this \"firmware\" update for remote access, and retrying the \"DID\" number configuration, and finding out the Infrared could not be overridden ----I returned it. For 3 \"C\" notes more or less (price), it was still to much money for a kid-yard-monitor. ----However, great (!) for,----that since the Receiver is wireless with battery.If you have a very light security need this is good. If you need a quality image, with immediate function upon install as I did -- well, it did not work for me for how I define these elements. And, if \"something bad\" did happen, I would be royally annoyed/jammed-up, if I had useless video which just shows \"something\" happened and nothing more. I would be fully aware of the event without \"more\" than that.So again, for inside, close image use, e.g. Cash Register over the shoulder -- this works for \"me\", otherwise, it does not, for me, and not as described, or \"implied\" description as I read it. I saw all the printed material and \"video\" and feel mislead a bit. I guess the next jump is to hard-wire and a lot more money. It's truly unfortunate since I believe this \"could\"/should work if made to do so at this price point. (My cell phones pic/video/audio camera is at least 5x's better and I have an older phone too. That \"5x's\" is a deliberate attempt to be in the \"feel\", accurate. I considered that something like this could not be less than an old Blackberry ----but was wrong.)", "Date": "June 1, 2013"}, {"Title": "Uniden UDS655 7-Inch Video Surveillance with 2 Outdoor Cameras review", "Author": "Shakar Bridglalsingh", "ReviewID": "RCA3738TEAFTJ", "Overall": "4.0", "Content": "the product is not as described apparently 200 ft it the maximum distance between camera and receiverbut how ever it is doing exactly what i want it to do where i want it", "Date": "June 2, 2014"}, {"Title": "Excellent product for the price", "Author": "T. Hafner", "ReviewID": "RCUPDRUIR152H", "Overall": "5.0", "Content": "For the price of these cameras, it was a great deal! Good clear picture on screen. We upgraded to a 32gb card and it will run for days and days! Would highly recommend!", "Date": "May 27, 2014"}, {"Title": "Not good for remote viewing", "Author": "JeremeyMT", "ReviewID": "R28MLIL9DJDSSG", "Overall": "2.0", "Content": "I bought this system without realizing it's limitations. You MUST have the monitor constantly connected to a computer in order to be able to view the cameras remotely. Even then they disconnect constantly and don't always reconnect. Their website is absolutely useless and impossible to register the cameras on.", "Date": "May 23, 2014"}, {"Title": "Very good", "Author": "Jarrett O. Crawford \"JO\"", "ReviewID": "R108TRE2O5TUI", "Overall": "4.0", "Content": "It was a little difficult to mount it where I wanted it as there was no readily available power source but after a very long power cord was purchased it was workable.", "Date": "March 27, 2014"}, {"Title": "Fit our needs like a glove", "Author": "Greg Sandidge", "ReviewID": "R34K48D0VWIG2X", "Overall": "4.0", "Content": "Clients liked all the features. Will probably order another camera to expand viewing. Good product. I would recommend to a friend.", "Date": "March 24, 2014"}, {"Title": "love it", "Author": "michael clark", "ReviewID": "RT36UO9U5JD0A", "Overall": "5.0", "Content": "this was a good price. I love the unit it works great and no problems.works well for my needs, grate buy.", "Date": "March 18, 2014"}, {"Title": "worth the money", "Author": "William Witkowski", "ReviewID": "R3D68117CEDZ2N", "Overall": "5.0", "Content": "this unit does everything it said it will do. plus much more then I expected for the price. worked so well. I ordered two extra camera's to go with it. set up is a snap. yes their s somthings I wish were better. but all in all for what I paid for it . it don't get any better then this. Im well satisfied and glad I bought it. has a lot of different ways t set up. only time will tell how long it will last. love the battery back up for the screen. can work off enternal power for about eight hrs. or continious when plugged in. so far so good. if your looking for a reasonalbey priced. security camera. with no wires to run this is it.. it really does more then it says it does. you get your hard earned dollors worth here.", "Date": "February 22, 2014"}, {"Title": "Cheap plastic junk", "Author": "Disappointed", "ReviewID": "R3P1D6H94JHBCA", "Overall": "1.0", "Content": "At first this looks like a great product and we were overall happy with it.  There could be better volume control and picture quality, but what really makes this a one star product is how cheaply made the monitor is.  Cheaply made plastic and screws that are too short to hold it together properly.  Less then a month after getting it, it no longer works.  A very short tumble off a bedside table onto carpet, it busted in half and no longer works.  Such a minor bump and it's totally useless.I would not recommend this product.  Find a different brand with better quality.", "Date": "March 10, 2014"}, {"Title": "would not recommend", "Author": "sondra", "ReviewID": "R33TDY3EQ1NS4H", "Overall": "1.0", "Content": "Freezes,blanks out,loses signal,too many false alarms,picture goes in and out,blk and white. The pic.is sometimes so distorted....you can't even make out what you are looking at. Terrible investment~I will be returning both units immediately!", "Date": "December 8, 2013"}, {"Title": "Better than nothing I guess", "Author": "J. Fillman", "ReviewID": "RT9YTGYRM3J5L", "Overall": "2.0", "Content": "The motion sensitivity is practically triggered by a light breeze even on the lowest setting.  Meaning you have to scan through hours of footage for no reason.  This is the case both day and night, with block out zones set appropriately.  Yes, there is an iPhone app but the software needed to make the connection is PC only so that feature is useless to a Mac user.  I would not recommend this product.", "Date": "May 18, 2013"}, {"Title": "NOT WHAT I EXPECTED", "Author": "JOANNESKINDLE", "ReviewID": "R2A6UYXD1LP4YW", "Overall": "3.0", "Content": "CAMERAS DO REQUIRE POWER,  HORIZONTAL VIEW OF CAMERA IS LIMITED , THEREFORE NOT EFFECTIVE. INSTALLATION OF CAMERA IS NOT SECURE, CAMERAS CAN BE REMOVED WITH ONLY A SCREW DRIVER IN LESS THAN FIVE MINUTES. NO WAY TO REALLY SECURE CAMERA TO HOUSE TO PREVENT THEFT OF CAMERAS. INSTRUCTIONS ON SET UP OF CAMERAS AND SEEING RESULTS ON MONITOR ARE UNCLEAR AND CONFUSING. WOULD NOT PURCHASE THIS SECURITY CAMERA PACKAGE AGAIN. NOT THRILLED WITH SYSTEM .", "Date": "January 7, 2014"}, {"Title": "Good product", "Author": "Maria R", "ReviewID": "R14OREBE543DOR", "Overall": "4.0", "Content": "The product works very good.It is good quality and does the job. This is the new model of this type of cameras and is bettter.", "Date": "April 13, 2013"}], "ProductInfo": {"Price": "$299.99", "Features": "Portable, Rechargeable\n3.5 Hours Use on Battery Power\nExpandable up to 4 cameras\nTransmission up to 500'\nRecords all 4 cameras at same time", "Name": "Uniden UDS655 7-Inch Video Surveillance with 2 Outdoor Cameras and 4GB MicroSD Card", "ImgURL": "http://ecx.images-amazon.com/images/I/41KNhvfzRYL._SY300_.jpg", "ProductID": "B00AZUFYXS"}}