{"Reviews": [{"Title": "Looking for a basic wireless surveillance camera, this works well", "Author": "Grady Harp", "ReviewID": "R31J70T67WRRHE", "Overall": "4.0", "Content": "For the money and for the ease of installation and interface with the computer and accessible from computer, laptop, android, iPhone, iPad from virtually anyplace, this device is affordable and basic and does what it is asked to do.It provides real-time audio/visual streaming, is able to capture still images, understands the difference between day and night (light source alterations), and actually for as simple a system as this it can be set to instantly alarm, offers email alert and connects to your home network and the Internet by Wi-Fi or Network Cable. Though I haven’t tired all of these variations it apparently works with Internet Explorer, Firefox, Safari, Google Chrome and all other popular browsers and mobile devices.This Camera is more the basic Polaroid device and for the price it is a good introduction to the use of security surveillance systems. Get to know how to work with this device and you will likely soon upgrade to some of the many other options Polaroid offers. For starters or for apartment dwellers, this is a very usable reliable device. Grady Harp, November 13", "Date": "November 21, 2013"}, {"Title": "Good Wireless Security Camera - Recommended", "Author": "C. Hill \"CFH\"", "ReviewID": "R1PNHZPDOOWN7Q", "Overall": "4.0", "Content": "This Wireless Security Camera works very well once it is in place and setup on the wireless network. We have a small business and have both wired and wireless cameras in our system. Here are my observations:Pros -+ Quality; physically quality is excellent, I dropped this from 5' and it continued to operate just fine+ Image; on the best setting, it is very crisp and clear+ Features; able to send grabs on alarm to email or FTP servers, set time of day alerts+ Range; covers most of building+ Night Vision; quite clear even is complete darknessCons -- Clunky Web Interface; a little hard to navigate but once configured it is just fineMisc -* Size; unit is somewhat larger than expected, certainly not unobtrusiveOverall, this is a very good choice for an wireless security camera.Highly Recommended!CFHNote; sample unit provided for review", "Date": "November 24, 2013"}, {"Title": "Focus is way off", "Author": "Bryn Nealis", "ReviewID": "R3VQKO4AKK4MGA", "Overall": "2.0", "Content": "This camera is clearly a rebranded FOSCAM as the firmware has identical menu structure (and typos). The focus on the camera is way off and you are unable to make out a face clearly from 3 feet, even at 640x480 (I assume this resolution is real... it's what it says on the web interface at least) you could tell FedEx from UPS, but that's only due to the uniform color. Night vision is poor, too, as the center of the image is very bright and that further degrades the resolution where you want it. Was very excited to put this near my front door, but it's going back instead...", "Date": "December 30, 2013"}, {"Title": "Use your wireless network to easily view this security camera with clarity in night and day vision and recording", "Author": "Chandler", "ReviewID": "R2VSARJCRI2NUF", "Overall": "5.0", "Content": "I like the Polaroid security cameras and find that their systems provide nice clear images.  Fortunately this one ensures you get them whether night or day.I have had other systems that didn't provide instructions that made the clarity of set up easy and this ensures that even the novice, like myself, can get it up and going with full instructions and ease of use.This was set up easily after reading how to do it and it worked from the get-go.Unlike other systems I've seen where you have wires going to your PC, this was enables you to work wirelessly for far more easy set up.It could be used in either office or home environment for security or to see if someone is coming in the door at a retail location etc...Because it is used with your PC, it makes your imaging easy to access from a variety of locations.Camera provided by Polaroid; review is my honest and unbiased opinion.", "Date": "November 29, 2013"}, {"Title": "Not great", "Author": "Jason", "ReviewID": "RC5P7112MOJU9", "Overall": "3.0", "Content": "Had trouble viewing from outside network.  There is not Pan Tilt .  Also not great in low light.  having to try another brand", "Date": "December 6, 2013"}, {"Title": "It works, but the video quality is not that great", "Author": "JR \"Mr. Gadget\"", "ReviewID": "R3UNDEFDEOG0E9", "Overall": "4.0", "Content": "I was able to get it working without much trouble.  It is OK for basic video monitoring, but the video quality is lacking compared to other similar priced cameras.  This happens to be the only domed camera in this price range that I could find.  The camera is fixed position, no PTZ, which is not anywhere on the description either at Amazon or at Polaroid's website.  It is a good, very basic camera for security.", "Date": "October 8, 2013"}, {"Title": "Good product for its price", "Author": "Florian", "ReviewID": "R3PFX6TEEF6G2Z", "Overall": "4.0", "Content": "It was really easy and fast to set up. Luckily, if you don't want to use IE and ActiveX you don't have to, as there is a separate interface for other browsers. The image quality is not great, but for the price absolutely acceptable", "Date": "December 13, 2013"}, {"Title": "Works good, setup is a bit of a nightmare.", "Author": "Daveey", "ReviewID": "RV49H460AHBQO", "Overall": "4.0", "Content": "So I like the quality of the camera, the price and the quality of the video. For the price you cant go wrong. The negative would be the instructions (even online) were slightly helpful at best. To set this up to monitor was simple enough, however if you you want to get alerts to e-mail etc. not so easy.", "Date": "January 10, 2014"}, {"Title": "polaroid is not good at implementing open source software", "Author": "Yakoob A.", "ReviewID": "R3Q4H9HQA1KHT7", "Overall": "1.0", "Content": "do not buy this camera if you would like to control its movement.polaroid doesn't not have new web-ui or cam firmware on their site.So dated that modern browsers will not work for controlling movement.", "Date": "January 10, 2014"}, {"Title": "Not wireless, at all", "Author": "Benjamin Gonzalez", "ReviewID": "R2WQXBWTJY96ZQ", "Overall": "1.0", "Content": "I don't understand what part of this product is wireless?  There are a number of wires, power and Ethernet, and two others, sticking out of the camera.  I guess if I just happened to have a power source and either net sticking out of the ceiling of my house in the places I need to plug this thing in, it would work.  You can't even conceal the wires into the ceiling if you did, because its not designed that way.  I opened it, looked at it, read the complicated manual, and returned it.  Go with a Dropcam.  Much better and much easier to operate, although they do need power sources.", "Date": "November 16, 2013"}, {"Title": "Decen't Camera", "Author": "Richard Anderson", "ReviewID": "R3BWUQQ7605YQN", "Overall": "3.0", "Content": "Decent camera, set up was hard to figure out and the user interface is hard to work around unless you know what you are doing on computers.", "Date": "June 5, 2013"}], "ProductInfo": {"Price": "$129.99", "Features": "The Polaroid IP100 is an excellent and affordable choice for monitoring your home or office while you are away. It is easy to set up, simple to use, and is very accessible and secure.\nYou can access it anytime, from anywhere in the world, via any computer, laptop, iPad, iPhone or Android device.\nThe Polaroid IP100 is a standalone unit that features an easy to use one-click recording interface with no need for a DVR or other recording device.\nIt features a Motion Detection option which makes for efficient and effective security monitoring. This feature has 10 motion sensitivity settings to eliminate false alarms.\nPeace of mind and safety are among the many benefits the IP100 provides.", "Name": "Polaroid IP-100W Indoor Wireless Network Surveillance Camera with Night Vision - White", "ImgURL": "http://ecx.images-amazon.com/images/I/31qT1O3X5eL._SY300_.jpg", "ProductID": "B00AQ4ER2W"}}