{"Reviews": [{"Title": "ugh", "Author": "ns", "ReviewID": "RDZ8M8XN8DMP4", "Overall": "2.0", "Content": "Decent camera through the web interface. The bundled recording software is junk. This camera requires a different version of recording software from all TPLINK's older cameras. DO NOT BUY THIS if you already have other TPLINK cameras. It runs extremely slow on windows 7. The setup fails a lot, resorting to default parameters, and lots of text that is poorly translated and unhelpful. Some of the older camera models are also not supported.", "Date": "May 3, 2013"}, {"Title": "Powerful and Budget Priced", "Author": "nerd4life", "ReviewID": "RYP0EGVPTBXLW", "Overall": "4.0", "Content": "I hesitated before buying this camera. Since I had such good luck with a gigabit smart switch manufactured by this company, I decided to give it a chance. I was also emboldened by the fact that I had several months experience with another manufacturers IP camera. This is a high quality camera for a bargain basement price. The image is razor sharp. This camera has much more dynamic range than my other camera so I can see details like birds flying in a bright sky at the same time I see the details of a delivery man's backlight shadowy face. It requires technical knowledge. It does not have infrared lights to see in the dark. It does not have a website to automatically allow you to access the camera through the internet. Those so called limitations are easily overcome if you know how to setup port forwarding and have motion activated lights outside. I can have different rules for different areas of motion. Motion at my front door triggers a recording and sends me an email while motion in the street just triggers a recording. Lastly I want to speak about compatibility with other programs. Most programs won't list this as a compatible camera. That is misleading. This camera supports the ONVIF standard so any software that supports that standard should support this camera.Update 1 - The 720P mode is a crop of the 1080P mode not a down sample. When you switch to the 720P mode the field of view is reduced accordingly.Update 2 - The 720P mode does come in handy if your android phone is like mine. My phone won't play 1080P video. My phone WILL play 720P video. Luckily for me I am due for an upgrade. The only real limitation I have run in to is that I have not found a way to configure a motion event to write a 1080P video clip to the SD card PLUS email me a 640 X 480 clip. From what I can find, all event based recordings have to be the same resolution. You can have different resolutions for continuous and event recordings but the resolution of all event recordings must be the same.", "Date": "September 28, 2013"}, {"Title": "wireless doesn't work at all", "Author": "Panini", "ReviewID": "R1THKFD72V2S5C", "Overall": "1.0", "Content": "the camera worked when wired to ethernet, but didn't work at all over wifi, despite claiming that it does. I tried many different combinations of settings, made sure I downloaded the latest updates, but still could not get it to work.", "Date": "June 9, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00AWRKMB8"}}