{"Reviews": [{"Title": "Decent gets the job done", "Author": "Don Uno", "ReviewID": "R23CSFI7I94YMU", "Overall": "4.0", "Content": "I have no complaints. I bought it and it has worked for me fine. I just had to buy 32gb sd for it and that's about it. Its not hard to use. I haven't use the CD that it came with yet, I'll get around to it. I don't know what other people are talking about that it stop working. It did that for me too, but I realized it needed to be charged. It's like a cell phone you just charge it and its ready. You know when its not filming and more than likely its not charged. Plus it was great for the price.", "Date": "June 5, 2013"}, {"Title": "delivered on time", "Author": "Karl Huoppi", "ReviewID": "R1OWKMED1IA334", "Overall": "3.0", "Content": "when recording, you see the bright blue flashing light. not very hidden. picture is of good quality. motion detection is good other than light on activation.the clock tells time at push of button. recordings do have sound.", "Date": "September 13, 2013"}, {"Title": "Motion ratings", "Author": "Cecelia Harrison", "ReviewID": "R3M493GNMNR7HF", "Overall": "4.0", "Content": "This product does exactly what I wanted motion,video, and sound. No one has an idea the clock is video taping them.", "Date": "July 26, 2013"}, {"Title": "Good buy", "Author": "D.T.", "ReviewID": "R3GO0DHHJTHJNM", "Overall": "4.0", "Content": "Great camera for the price! I was really surprised at the resolution and clarity. The down side... it tends to lose battery power quickly and has to be charged frequently.", "Date": "April 7, 2013"}, {"Title": "One for the money, two for the show", "Author": "C. Schmidt", "ReviewID": "R3ODKPHJ8MYWL", "Overall": "2.0", "Content": "Ok then.  I've gotten two of these, the original and a second replacement from Amazon.  Having had experience with both of them, I cast my Spock eyebrow on the \"DON'T BE FOOLED BY CHEAP IMITATIONS THAT BARELY WORK!\" part of the ad.  First off, neither one of them matched the description here.  Neither shoot 1280x960 video, instead using the lower 640x480.  The packing and manual included with them (both different) doesn't even list it as possible to shoot at the claimed 1280x960.  One of the images used indicates that an AC adapter is included, which only one of them came with.  According to the text, it doesn't come with one.  One unit was red instead of black, the other came with a different remote.  The red one needed drives and to be powered on (both the side switch and activation with the remote) in order to view recordings from it or access the files, while the other was true to the \"No Drivers Needed\" claim.  The first one didn't keep time (like hours off daily), and didn't include working drivers for the webcam function.  Good luck finding those, by the way.  Neither had working software to sync the time displayed in the videos.So how about the rest of it?  Well, assuming you get one that will actually function like as a clock, that part if pretty nifty. Alarms, chimes, speaking time, etc.  Too bad that, unless you're at just the right angle, you can't read the time.  Both 12hr and 24hr modes are supported, if you prefer one over the other.  The backlight works nicely, but it's not an on/off function.  It turns on for a few seconds and then turns off again.On the recording functions, it's ok.  It does work, yes.  As other reviewers have mentioned, yes, it flashes a blue light when in full recording mode.  In motion mode, only when it's triggered and then briefly.  In all honestly, unless you're looking for it or in the dark, it's very easy to miss.  Most of the time when testing them out, I wasn't sure they were even triggering.  Speaking of triggering, it's not instant.  Expect to lose a few seconds.  The unit as a whole is a bit slow with it comes anything where you need to power the unit on (side switch plus activation with the remote).  3-5 second minimum is needed to get it to understand what you want.  In low light, expect very grainy video.  The unit doesn't shoot with IR or any other lighting source.In the end, yeah, it works, and it's cheap.  If you can deal with unit's quirks, you should be ok.  Really though, unless it's super important that it be portable and disguised, there are a lot of better choices out there.  Yes, they cost about double, but they will likely work better and have extra features like night vision.  Indeed, it wouldn't be too hard to disguise something like an IP camera.", "Date": "December 12, 2013"}, {"Title": "Waste your money to buy this device", "Author": "jason", "ReviewID": "R36P40Q9F63IN0", "Overall": "1.0", "Content": "The quality of this device is so bad, even damage my SD card (cost me $20). Strongly recommend no to buy this product.", "Date": "August 23, 2013"}, {"Title": "what a waste", "Author": "joy D", "ReviewID": "R6YFXQSP7ZNZL", "Overall": "1.0", "Content": "pls dont buy this product. it is a total waste of money. the picture is not clear and after a few months it went off and never worked again. i dont recommend this product at all.", "Date": "April 4, 2013"}, {"Title": "very bad", "Author": "Archil Kavtaradze \"Archechiko\"", "ReviewID": "R2UX8QHNGS8YOL", "Overall": "1.0", "Content": "it is fake and does not work. do not buy this item! battery is dead, camera does not work. NO!", "Date": "January 27, 2014"}, {"Title": "dead dead dead", "Author": "chris", "ReviewID": "R8TO3ZZSW6CYL", "Overall": "1.0", "Content": "opened it up charged it completely worked 1 time and 1 time only replaced batteries in remote and still nothing", "Date": "March 26, 2013"}, {"Title": "Spy alarm clock", "Author": "Nicholas", "ReviewID": "R1FFRTI1DXXFIU", "Overall": "1.0", "Content": "Don't buy this product, it is not worth the money. The light stays on while filming and if you have to film using a hidden alarm clock camera, then that's your issue. I threw mine away and will never buy anything like this again.", "Date": "April 6, 2013"}, {"Title": "all good great price", "Author": "michelle ovadia", "ReviewID": "R3J4K3AI3NZY18", "Overall": "5.0", "Content": "I bought it and it has worked for me fine. it came with a 8gb micro sd card and that's great it. Its not hard to use. I haven't use the CD that it came with yet, I'll get around to it. I don't know what other people are talking about that it stop working. It did that for me too, but I realized it needed to be charged. It's like a cell phone you just charge it and its ready. You know when its not filming and more than likely its not charged. Plus it was great for the price.", "Date": "April 17, 2014"}, {"Title": "NOT happy", "Author": "Pam Scott", "ReviewID": "R32W3ZT96QQL6L", "Overall": "1.0", "Content": "I would rate this a zero!  I was upset I did not get the product, I understand it was returned because it has a built in battery?  We'll they knew this hen advertising, so they should not have been selling it to the USA!", "Date": "February 18, 2014"}, {"Title": "Practical security.", "Author": "Annette", "ReviewID": "RWUO8PC4QXRBP", "Overall": "3.0", "Content": "It is functional but the directions are very, very basic! I had a hard time getting this to work properly. I recommend using the movement sensor mode. Once you get it set (wait for 3 confirmation flashes!) , it works well. It's a steal for security.", "Date": "November 23, 2013"}, {"Title": "Works as advertised but very flimsy", "Author": "Stalwaty \"csmudricks\"", "ReviewID": "R3A1W0O2739R3X", "Overall": "3.0", "Content": "This item works as required. The instrcutions are almost non existant, but it is pretty simple to figure out. the real problem is that the clock is flimsy at best. I like these things, but they don't last very long if you move them around a lot. Also, be sure to shop around as the prices on a unit like this vary widely. Some sell it for as low as 30 dollars up to a high of $120 at another place.", "Date": "November 8, 2013"}, {"Title": "Not so fabulous.", "Author": "Dave", "ReviewID": "R3HJUZ5T8653QC", "Overall": "2.0", "Content": "I got this same camera from a different source but it's the same.The pros are that it works and is pretty consistent.The cons are that it's not very bright or clear and the viewing angel is fairly narrow.  I want to say it's close to 50 degrees or so.  The other drawback is that while it's self contained - meaning you can put it anywhere with it having it's own batteries - The battery life is somewhere around five hours.  It will not record or act like a security camera if it's plugged in.Plugging it in makes it want to be a web cam which is something I don't need.", "Date": "January 25, 2014"}, {"Title": "product sucks", "Author": "Lori I", "ReviewID": "R2ZCBQHHU223CL", "Overall": "1.0", "Content": "Product sucks No customer service. its supposed to be an alarm clock. it announces the time every hour. no button to shut it off. dont waste your money", "Date": "January 9, 2014"}, {"Title": "It does the job.", "Author": "Francis J. Schirck III", "ReviewID": "RYJIWCMFP6Y42", "Overall": "3.0", "Content": "I leave it plugged in which means you need to leave the side cover open, no one seems to notice.  It does have a blue light that flashes when the camera is in standby or videoing.  But no one seems to really notice that either.  I bought this to watch my home when I am away to see if anyone enters.  I like the motion detector feature for this.  It came with a rather short cord plug. that could have been longer.  The remote is tiny but rectangular not round as shown in the photo but the features are the same.  The instructions were written by someone in China who's first language is obviously not english.  But after reading them a couple times and practicing you can get how to work it.  It's worth 20 bucks.  I record for days on a 16 or 32 gig card.", "Date": "June 5, 2014"}, {"Title": "Returned immediately", "Author": "PinterPaws", "ReviewID": "R2LEIXFACHD2C2", "Overall": "1.0", "Content": "Purchased this as an advent gift for my son.  I thought he would love it, but it never did work.", "Date": "May 29, 2014"}, {"Title": "Waste of money don't buy", "Author": "Stacy", "ReviewID": "RV3FBRQ7DXV8M", "Overall": "1.0", "Content": "If u try and find any support you can't even find the company name anywhere on the product or materials.  Gives a mini disk to download software which is not compatible with macs and can't find a place online to download software.", "Date": "May 28, 2014"}, {"Title": "not a happy customer", "Author": "fortz", "ReviewID": "R2ZEHXVLTWMCI9", "Overall": "3.0", "Content": "Never work I even change the battery on the remote and still it did not work I did not like it", "Date": "May 1, 2014"}, {"Title": "Not working", "Author": "Elvis Fred Mulimba", "ReviewID": "R3OK4MHS9XVTEX", "Overall": "2.0", "Content": "I bought two of these but they have not worked, one of them has to be kept in power all the time, the other can hold power, however I have failed to insert the TF card in neither of them, could someone help! It is now 6 months since I bought them but every time I try inserting the card I feel like I am going to break something, or can someone recommend a particular card to be used.Disappointed customer.uE", "Date": "May 1, 2014"}, {"Title": "Wished it worked", "Author": "Leo", "ReviewID": "R2RJ1RJDKKY1BA", "Overall": "1.0", "Content": "Well it give good time as far as anything else nada, first off it didn't come with the charger like said the software didn't work right and were the tran flash memory chip goes well it won't stay in place , just came out , it won't record anything at all , was gonna send it back , not happy with it at ALL", "Date": "April 29, 2014"}, {"Title": "Not worth your money", "Author": "D. Abeln", "ReviewID": "R2LAS1IB5AL5YO", "Overall": "1.0", "Content": "It is okay as an alarm clock but beyond that it stinks just to say the least... I wouldn't recommend it to anyone", "Date": "April 27, 2014"}, {"Title": "No worth the money", "Author": "Marcia R.", "ReviewID": "R2F8X4TDJPL9XD", "Overall": "1.0", "Content": "Unfortuanately when I bought this is was not available from Amazon.  Therefore, I bought it from Spy-Trionx for $100.00 I have not been able to get it to work at all.  I contatcted the company and they stated that everyone they send out is tested before it leaves their warehouse.  I also broke the remote open where it holds the battery.  They did send me a new remote, however I still have not been able to get it to work.  I wish I had bought it here as then I could return it and only be out $30 some intead of $100.00 .  I do not recommend buying this product.", "Date": "April 24, 2014"}, {"Title": "good", "Author": "Medici Olaso Vittorio", "ReviewID": "R89HXRQTHJJ3B", "Overall": "3.0", "Content": "Good price but for me and my partner ,I bought 2  , isn't easy to put it in function , it is like obsolete tecnology", "Date": "April 9, 2014"}, {"Title": "horrible product, waste of time and money", "Author": "Robert H. Shanahan", "ReviewID": "R2GUBXNR04CBHE", "Overall": "1.0", "Content": "The TF card does not stay put and requires leaving the side cover partially closed with the edge over the TF card... until the side cover breaks off, then a heavy duty rubber band or small c-clamp is necessary.The motion detector was defective rendering this fecal matter useless as a nanny cam. Even if it did work, an led flashes while it awaits motion before starting the dvr. Nice tip off for the nanny.", "Date": "April 7, 2014"}, {"Title": "the charger is bad !", "Author": "Sherri Degler", "ReviewID": "R2NM640VDZXFT8", "Overall": "2.0", "Content": "The charger doesn't work well, sometimes the clock doesn't record like I need it to, because it shuts off, it'll be alright if charger worked better.", "Date": "March 31, 2014"}, {"Title": "Pretty bad", "Author": "ANGEL E SANTOS", "ReviewID": "R1EMMYVSGHTCB8", "Overall": "1.0", "Content": "Not user friendly. Poor quality. At least the clock works ok. And for the price, can't ask for more. You get what you pay for.", "Date": "March 18, 2014"}, {"Title": "It was horrible", "Author": "Joyous", "ReviewID": "R24HCRKRJARF0D", "Overall": "1.0", "Content": "They don't tell you that it announces the time every hour, the remote control didn't work and the directions were awful", "Date": "February 16, 2014"}, {"Title": "does not funccion", "Author": "ZAREM1", "ReviewID": "R1SHJMVQJPG47L", "Overall": "2.0", "Content": "it arrives on time but till now I cant use because it does not charge the baterry.It works only when it plugs to electricity.And as I am now in Peru I dont know wat to do.Please advese me because my next treep to USA is in may or june.", "Date": "February 14, 2014"}, {"Title": "The wrong clock", "Author": "sparkspower1", "ReviewID": "R20EX94ARK96QI", "Overall": "1.0", "Content": "will not buy from him again the wrong clock, pay $30.00 for a $ 20.00 clock, stay clear of this one!!!!", "Date": "February 13, 2014"}, {"Title": "junk don't waste your money", "Author": "Robert Coletti", "ReviewID": "R122SAERWBHDW8", "Overall": "1.0", "Content": "got it, put the 16 gig chip in, my computer  running win 7 did even see it.  i loaded  the driver off the cd  and still nothing. i let the battery charge fully still nothing tossed it in the garbage  felt  a bit of satisfaction that i didn't wate any more time with it. good luck if you want to waste your money  buying it.", "Date": "February 6, 2014"}, {"Title": "Didnt work", "Author": "Lindsey Asmus \"lynza7\"", "ReviewID": "R2TB9ZQNL3KBRD", "Overall": "1.0", "Content": "It was missing a TF card- I can not get it to work and I do not recommend buying it.", "Date": "February 4, 2014"}, {"Title": "It is not what you expect.", "Author": "Marian Toma", "ReviewID": "RUWSNXTZ6F2VE", "Overall": "1.0", "Content": "First it came without Power Adapter. Second, the internal battery's capacity is quite low and you cannot relay on the DVR. Third, the procedure to start the DVR is complicated and is not responding every time to your need.In the end you can not use it.", "Date": "January 29, 2014"}, {"Title": "Doesn't work", "Author": "Debbie Shoup", "ReviewID": "R3ADFRVMQLGSKQ", "Overall": "1.0", "Content": "Camera doesn't work, could not get it to record. I would recommend spending a little more money for a better product.", "Date": "January 26, 2014"}, {"Title": "CHEAP CHEAP CHEAP JUNK", "Author": "Bryan A Clark", "ReviewID": "R2A4R6N9JPOWV1", "Overall": "1.0", "Content": "Video quality is blurred. It keeps flickering from video to a blue screen back and forth. I guess for the money its not THAT bad, but I would not recommend it. Save your money, get a better quality product. Its an overseas crappy clock that makes terrible noises and announces the time really loudly... also plays HORRIBLE music/tune when you first turn it on... so LOUD.I don't care too much for the same stuff, I just need decent video imaging... this camera does NOT provide. You get what you pay for with this product.Oh, and I've had it for 4 months... it no longer records anything. Its CRAP.", "Date": "January 25, 2014"}, {"Title": "Don't waste you money on this.", "Author": "timothy j hand", "ReviewID": "REWH6JM3HBKV2", "Overall": "1.0", "Content": "This product is garbage.  If I could give it negative stars I would.  waste of money.  Has Never worked at all.", "Date": "December 19, 2013"}, {"Title": "Piece of junk!!!", "Author": "Joe A", "ReviewID": "R1WY4D9FJ5M711", "Overall": "1.0", "Content": "From the moment out of the box the LCD display was messed up. Charged for a full day, still not recording properly. Thing is very cheaply made. Would not recommend to anyone.", "Date": "December 12, 2013"}, {"Title": "junk", "Author": "george rivers", "ReviewID": "R8M02XPNR5L7I", "Overall": "1.0", "Content": "This thing is absolutely junk, first it didn't come with power cord. then after I could not even get it to work not one time....It's cheap for a reason!", "Date": "November 22, 2013"}, {"Title": "Garbage recorder", "Author": "James D. Whitaker", "ReviewID": "R2M33548L16NO8", "Overall": "1.0", "Content": "Remote has no indicator to let you know it's working when in motion recording you see blue light blinking so you think it's set to record by motion when you check recordings later you discover it never recorded anything. Nice pic quality but it is not dependable to do as advertised after many hours trying to record by motion it recorded nothing by motion. Don't buy", "Date": "November 7, 2013"}, {"Title": "awesom light", "Author": "Janice", "ReviewID": "R3OZCKVGGMX56", "Overall": "5.0", "Content": "Works great thank you my kids dont like it but now i can watch them when im not home :)", "Date": "October 27, 2013"}, {"Title": "Efficient Company deserves 5 stars", "Author": "jose garcia", "ReviewID": "R1P2GGV2W1M53E", "Overall": "5.0", "Content": "I will give this company 5 stars. I had an issue when i purchased my 2 clocks and without any hesitation they were able to solve my problem. staff are very nice. I will definitely shop from them again and would recomend them to my friends", "Date": "April 17, 2014"}, {"Title": "old & untrusted", "Author": "Max", "ReviewID": "R2MS209OERBHEA", "Overall": "1.0", "Content": "the software to support or run it was on a mini-disk, so I had to get an old computer out of storage & cut-n-paste the directions to a jump drive and the directions are convoluted and poorly punctuated.  And then it would only record long AFTER the motion (triggered) was long gone, so if security and surveillance is on your list of priorities, this will only lead to disappointment despite your computer savvy.  Plus, the one I purchased didn't come with a power adapter like it was supposed to or a memory card, so there was added expense there.", "Date": "December 23, 2013"}, {"Title": "spy alarm clock", "Author": "jj", "ReviewID": "R123N1QIWJ3V9T", "Overall": "1.0", "Content": "don't waste your money.  Piece of JUNK.... did not work at all and I can't turn off the talking mechanism.  so annoying.returning!", "Date": "August 14, 2013"}, {"Title": "delivery time way too long.", "Author": "sydney humphreys", "ReviewID": "RZZ42MM0O1ASU", "Overall": "1.0", "Content": "i live in chicago,and this product says Lily Chicago,it's simply ridiculous how long this has taken to be shipped,i'll never make that same choice again,i could have driven to a store and had this,or a matching item,long ago.very displeased.", "Date": "October 7, 2013"}, {"Title": "Decent, but not worth it.", "Author": "Lokana", "ReviewID": "R35YUSUDPKIKSU", "Overall": "2.0", "Content": "Pros:For the price it has decent video quality.If you leave it on record and not Motion Sensor, it's pretty discrete.Cons:Short battery lifeMotion Sensor blinks when it records, NOT DISCRETE whatsoeverMakes a very prominent noise when you accidentally hit the topThe swing side is very breakableThe top is very sensitive, and it is VERY LOUDAll in all, I will not purchase again.", "Date": "July 13, 2013"}, {"Title": "Piece of junk", "Author": "Sonomacats \"Sonomacats\"", "ReviewID": "R3NHF05JQJ9O5O", "Overall": "1.0", "Content": "Like someone else here, mine worked once and then that was it.PLUS, the entire top is touch sensitive and announces the date and time in a SUPER loud voice.  And if you try to set the time, it announces every button push:  \"6:09 am, 6:10 am, 6:11 am\" etc.  HARDLY discrete.The instructions are in tiny print and hard to read even with super glasses.  And they are not clear or easy to follow.  (And I'm a techy person!.Don't buy it!!!Wish I had checked the reviews here first!", "Date": "June 3, 2013"}, {"Title": "Purchased this Item and the remote control never operated", "Author": "deanallen", "ReviewID": "ROXO8WDUYSQHR", "Overall": "1.0", "Content": "The items all had failure and operations problemsThe 120 v to USB charger had intermittent problemThe DVD software Application provided was freeware junkThe Clock never entered remote setup modeThe SyncTime software never engagedThe Video and Audio  formats were screwed in errorThe TF card set a folder and never recorded data.The USB mode and TF card mode are never differential discussedThe Preview worked as a snapshotThe remote control never workedThe Software had video and snapshot problemsThe MIcrophone was never discussed", "Date": "April 24, 2014"}, {"Title": "Disappointed", "Author": "Barbara Yarbrough", "ReviewID": "R2AFI7NEYZUYX", "Overall": "1.0", "Content": "the item needed a card in order to make it work.  I have to find one and still have not been able to use it or find the card yet. We are taking it to Best Buy but this in a big inconvenience having to track down another part in order to use it! It may sit in the closet forever at this point!", "Date": "April 3, 2014"}, {"Title": "Portable Spy Clock Not Recommended", "Author": "Mitra Latifi", "ReviewID": "RSD03EYWYAKSO", "Overall": "1.0", "Content": "missing items in the package, its software does not load, the item does not work.very disappointed at this Chinese made product.", "Date": "March 13, 2014"}, {"Title": "Could not get to work", "Author": "M. Machover", "ReviewID": "RZEHJQ870NPHQ", "Overall": "1.0", "Content": "Could not get it to work. Directions where awful, tried many timesthis was a piece of garbage. Find something else, no support.", "Date": "February 10, 2014"}, {"Title": "the product is great", "Author": "Brittany", "ReviewID": "R67YWO3A4RVSR", "Overall": "5.0", "Content": "the product is great and I love it. its great for the job and the price. :). Couldn't ask for a better product", "Date": "January 20, 2014"}, {"Title": "Piece of junk!", "Author": "zpka2410", "ReviewID": "R3TH1DVD3KFAOD", "Overall": "1.0", "Content": "The clock stopped working the 2nd day I bought it. Im not sure if the sensor ever worked either because it only recorded a few minutes after turning on the power then it stopped. I'm trowing this junk away.", "Date": "September 2, 2013"}, {"Title": "Im one of the lucky ones.", "Author": "O. Arias", "ReviewID": "R20MQJUUA3JHZY", "Overall": "5.0", "Content": "im one of the lucky ones to get a working clock it has bean 24 hours since i baught the clock and it still has a charge and i used the controler a couple times and it still works the fist thing i did was look up some information about the clock and after reading about the instructions i was ready to go.", "Date": "April 6, 2013"}, {"Title": "IT's TRASH IT's TRASH ,MONEY WASTE, DON'T BUY IT,NEVER WORK", "Author": "HECTOR G", "ReviewID": "R3NC4VZ650UZ1S", "Overall": "1.0", "Content": "IT's TRASH ,MONEY WASTE, DON'T BUY IT,NEVER WORK ,DON'T LOSE YOUR MONEY ,NO GOOD ,NO GOOD ,TRASH..!!!! DON'T LOSE MONEY", "Date": "October 14, 2013"}], "ProductInfo": {"Price": "$99.99", "Features": "PLEASE NOTE: NO TF MEMORY IS INCLUDED\nSupports Up to 16Gb TF card", "Name": "TechTonic Portable Alarm Clock Spy Camera DVR with Motion Detection", "ImgURL": "http://ecx.images-amazon.com/images/I/41ifeG5QFpL._SY300_.jpg", "ProductID": "B00AY571XA"}}