{"Reviews": [{"Title": "Great outdoor camera for my Lowes IRIS system", "Author": "GMac", "ReviewID": "R3ONFNFFNXLTCJ", "Overall": "5.0", "Content": "Yes, you need the Lowes IRIS hub to make this work, but then you get so many more options and features that go with it.  Pushing this camera beyond your stanard wireless IP camera.  Amazon should be getting this seller to describe this in the details.  Looks like one shopper was easily mislead already.  Anyway, this camera shows and records in HD.  Easily can be viewed from your smart phone, iPad, or computer.  Also with the the Lowes IRIS hub system you can get alerts or record when motion is sensed.  Have all the lights in your house (or outside) turn on when it's motion sensor is activated.  Activate your house security alarm is a nice feature (especially if someone breaks through your window, bypassing the magnetic window sensor that would normally raise the alarm).  It also has a good range of view for night vision.  I have had this camera when it first came out.  It had endured many of strong storms and high heat with humidity here in Houston Texas; and it shows no signs of damage and works great like the first day It started to record.  I recommend this product to my family and friends...ONLY IF you have the Lowes IRIS hub.", "Date": "December 7, 2013"}, {"Title": "The product is good but you should know....", "Author": "Thomas Woodruff", "ReviewID": "R25RMLHACDESH4", "Overall": "1.0", "Content": "This is a good basic DIY wireless system... However, the product description here is misleading.... This item is only a wireless camera... IT IS NOT A SYSTEM. You still have to buy the wireless hub which is another $99 from Lowes. With the wireless hub, the camera unit and any other wireless components you will have a system and this camera is available through Lowes for only a $129.00. Just thought everyone should know all the details....", "Date": "October 11, 2013"}], "ProductInfo": {"Price": "$199.00", "Features": "Wireless camera supports IEEE 802.11 b/g/n or can be wired via Ethernet cable\nRecords in high definition 720p\nDay or night vision capable\nRecords automatically when activated by motion or when any alarms are triggered\nRemotely monitor from your Smartphone, Tablet or computer", "Name": "IRIS Digital IP Wireless Security Video Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/51YYVhwl2uL._SX300_.jpg", "ProductID": "B00BTEY95S"}}