{"Reviews": [{"Title": "Good Surveillance System But Does Not Live Up To Advertised Specs", "Author": "Subir Singh \"Gadget Geek\"", "ReviewID": "R1NG9W76X6C9C0", "Overall": "3.0", "Content": "3.5 STARSI presume that majority of users looking into a camera/DVR product are looking for a home surveillance system. A wired surveillance system, such as this Lorex, is impractical for large or multi-story homes. The 60ft cable included cables or even optional 120ft cables will not stretch/install easily around the average multi-story home. With the 60ft cables, I decided to install 2 cameras on the top level of my home to monitor the front of my home.The setup is very simple. Each camera has a BNC male connector and a power male connector. The supplied cables have a BNC and Power cable coupled together. You connect the BNC cable to the desired port on the DVR and the other side to the camera. The power to all 4 cameras is supplied through a single power adapter that connects to a splitter. You connect the DVR to a monitor (not included) with a VGA adapter.The power adapters for the DVR and the Camera are designed to be close to the location of the DVR.Once the physical setup is complete, turn on the power and the split screen video comes on.The video quality is good and bright. The colors, however, do not have the right color saturation - even after adjustment. The claimed 50ft vision range in pitch black is really about 25ft. The 480 TVL resolution cameras do not capture sufficient detail for useful surveillance past ~25ft. The range does improve in daylight (50-75ft) but the resolution is not sufficient for surveillance detail past ~50 feet. With my cameras being mounted at the top level of my home, my effective range was till about half my driveway. This is not sufficient for me! I do like the seamless transition from daylight to pitch-black - I did not have any dead/black spots in my recording. The cameras handled it well.The menu is a little archaic, but functional. It took a few attempts, but I figured out the setup and network connections within a matter of minutes. The wi-fi connected instantly without issues (though it did pull an IP without my network password???) The mobile setup was a little more involved and I did not attempt any remote connectivity.I will be looking into a wireless camera system like the Lorex Wireless Video Monitoring System (LW292). It provides the ability to setup cameras at your desired locations without ugly wiring running all over the place.Would recommend for apartments or single-story homes.PROS:* Affordable surveillance system* Picture quality is bright in low light or darkness* Easy hardware setup* Vandal resistant cameras* Compact DVR* Ability to output video on 3 monitors* DVR can send notifications with optional motion sensor cameras* Free mobile iOS, Android & Windows Mobile apps to access/control the DVR remotely* Free mobile iOS, Android & Windows Mobile apps to get a live-view remotely* Software supports Hard Disks upto 2TB - User upgradable* Lots of accessories optionsCONS:* Wired camera system* Camera range is not sufficient to identify subject past 50ft in daylight and 25ft at night* Archaic, slightly difficult to use software* Color reproduction not accurate", "Date": "June 12, 2013"}, {"Title": "You get what you pay for...", "Author": "Sandor Nemethy", "ReviewID": "R2B71VS5RK9C06", "Overall": "3.0", "Content": "This is my 2nd Lorex system, the first one just flat out died about 6 years of owning it.  I figured it ran it's course and thought I'd buy another system, also by Lorex, in hopes of having extra cameras.  Unfortunately, they decided to change the connectors, so I had to dump the entire old system.  I let that one go, in hopes that the \"new\" technology would be better - I was wrong.  I installed the new cameras, setup the system and found many things that would cause me to return the whole system, but it's too much of a headache to breakdown, so I'm settling...1. Per Amazon advertising: \"Connects to 3G/4G or WiFi Network\"... I call B.S. on this.  This was the main reason I got it because I thought the unit had capability to connect to the house WIFI, since my system is in the garage and I didn't have to route a cable to it.  The truth is that it only connects via a cable and what they are referring to is that once you connect the box to the router, you can then download an app to your phone to view your monitors on 3g/4g... I would have immediately crossing this system off my list had I known that going into it.  Again this is something I can get past, but it's more of a headache than anything.2. Nighttime vision:  This is where the cameras have gone backwards in development!!!  The cameras of 6 years ago had such strong IR LEDs that they cameras literally had an ominous red glow to them at night and the nighvision was pretty good.  These do NOT glow red and they barely have any capability to see at night unless there's something directly in front of the camera at 10-20 ft.  I realize IR is not supposed to glow, but whatever type of LEDs they had in those old cameras, the red glow doubled as a great deterrent to anyone looking at the house at night (while they were being filmed).3. Playback capability:  This is BY FAR the worst feature of this system.  The last system I had (again - by the SAME company), had a very simple timeline to highlight all the recorded events of the day.  You just clicked on the event and played it.  On this system, it displays some calendar on the screen and you have to make a request to for which day you want to search the DVR.  Then, it breaks it down into only half hour increments saying that an event (even if it was a minute long) was recorded during that half hour.  Then to watch it, you have to browse thru the whole half hour.  It's horrible... I can only hope that once I have the unit hooked up to the internet, the web browsing capability is where the company spent it's resources rather than the user interface directly on the DVR itself.Would I recommend this unit to a friend?  No, I'd point them to other companies at this point.Would I return this unit if I wouldn't have to remove all of the cameras and remove all of the cables?  Absolutely.", "Date": "November 4, 2013"}, {"Title": "Might be a great product if you can get it to work", "Author": "FPSJunkie", "ReviewID": "R29KX3KB7BFQP4", "Overall": "2.0", "Content": "UPDATE 20 Dec 2013.  After nearly two weeks of frustration I was finally able to talk to a tech support technician. To make a long story short and to summarize, he basically agreed that the product documentation/manual information on how to set the system up for remote viewing was garbage. Turns out I had managed to forward my ports which he was able to confirm from his end so that was not the issue. Fixing my problem was actually simple. If you are sitting at your house with your WiFi up and running you first look at your DVR settings and make sure you know what IP address your DVR is using. For example say your DVR IP is set to 192.168.2.5. It is important to note that your local IP address is your private non-routable IP address you use for your home network which is not to be confused with your public IP address that is assigned by your ISP that allows you to connect to the Internet. Type your DVR's IP address into the URL window in your browser such as: [...] for example. when you click the return button you will most likely get a blank page which was what was holding me up.  Then in your browser menu click on Tools and look for \"Compatibility View Settings\" and click on that. This will open up another  small window. You should see your IP address in the small box that says \"Add this website\". If not type in your DVR IP address and click add. Once you do that you will be prompted to enter your login info. If you have not changed your default login settings just click the login button. If you have changed your default settings (which you should eventually after you get things up and running correctly) then enter your username and password and then login. You should be able to see your cameras.Note: if you are trying to connect from a remote site away from your home such as from your work computer you will need to type in your public IP address -- the one your ISP has assigned you that I mentioned earlier.  Keep in mind this is a dynamic address which may change. A simple quick way to find out your public IP address while you are at home is to go to Google and search for What is my IP. Click an appropriate link from the search possibilities and you'll see your public IP address (you can also use a command prompt and type ipconfig /all).  You will use this address in your browser to view your cameras from your work computer at the office or whatever.I've raised my opinion of the product to two stars but no more because regardless how good the hardware may be the product is useless if the documentation does not provide the information needed to set it up. NONE of the information the customer support technician told me and/or used to get this thing working correctly was documented in the manual.I purchased a Lorex system directly from Lorex because the 8 channel unit with wireless cameras was not available through Amazon.  Although my Lorex model is not the exact system as the one available at this Amazon location, Lorex uses the same tools to setup and configure this product as the one I have so my review from that perspective is relevant.  I apologize for the length and will update if I eventually figure this thing out before I get so frustrated that I send it back. Meanwhile I wanted to warn customers of potential problems if you choose to buy this product.The main reason I wanted a camera surveillance system was the capability to log in from a remote location such as while I'm on vacation to ensure everything is ok back at home. On paper, the system seems really great. However, the reality of getting it to work can be somewhat challenging which may be an understatement.The hardware, including cameras, seem to be of good quality and work great.  But, in order to view your cameras via a remote pc or mobile device you have to first configure port forwarding using the provided configuration tool.  If you are lucky it may work great and you are on your way. If not so lucky you may be faced with an ordeal similar to mine as follows: (keep in mind I'm giving you more details than perhaps necessary just to show you a true picture of the frustrations you may be faced with.)I unpacked everything and noted that it comes with all cables you will need to connect everything.  Initial setting up of the cameras and DVR is easy. Screw the base to the camera, attach the antenna, and plug it in to an 110v outlet (the wireless camera still needs power to work. The wireless part means you don't need to run cables from the DVR to the camera.)  Next, connect the DVR to the router your Internet Service Provider gave  you via the provided Cat 5 Ethernet cable. After that attach the antenna to the receiver (each camera needs a receiver to pick up the wireless signal from the camera), plug in the ac adapter to a 110v power source, and plug in the RCA jack to the channel of your choice on the DVR. The cameras and receivers come pre-paired with each other from the factory which is a nice touch. No need to do any pairing unless for some reason they lose the pairing.  There are instructions in the troubleshooting guide on how to fix that by re-pairing the camera/receiver if needed.  Lastly, connect the DVR to a monitor or TV of your choice via the supplied HDMI cable, DVI, or RCA jacks. Once the cameras and receivers are all plugged in and connected to the DVR which is connected to your TV/monitor you can power the DVR and you should see the view from your cameras nicely displayed on your monitor.Next, you wade through the 138 page manual you got from the Lorex DVD that came with your system to configure all the recommended settings such as the time, etc.  Again, this is fairly straightforward. Now comes the hard part --setting up the DVR for remote connectivity.First, the manual said to make sure I can view the DVR via the LAN or client software for the pc which is on the enclosed DVD. I followed the instructions closely to make sure I was doing everything right. After ensuring my DVR was connected via the Ethernet cable to my router, they said to browse through the DVR settings (remember, this thing is already up and running for viewing on my TV) and note the DVR IP address and http port. Next open a browser - make sure you use the 32 bit version of IE because it doesn't support the 64bit version - and enter the ip address and port like this: [...] for example. You're supposed to then get a prompt to install ActiveX plug-in which did not happen.  I try going to that socket (an IP address plus a port is a socket) anyway for grins and got nothing. Blank page. Maybe that's a good thing since Active X is dangerous security-wise.  So, no luck with this part. Next, I tried the other method of installing the Lorex Client 11. That did work and I can see my DVR and camera views on my PC. Hurray!I'm encouraged so now I go on to the next phase of setting this thing up so I can see it over the Internet. The instructions say in bold print, \"To set up remote connectivity with your DVR, you must: 1) Port forward the HTTP, Client, and Mobile ports (default 80, 9000, and 1025) on your router to your DVR's IP address. 2) Create a DDNS account. 3) Enable DDNS on the DVR. 4) Test the remote connection by entering your DDNS address in a web browser. \" Phew!It doesn't tell you at this point but you have to set up DDNS first which is fairly easy. Had no problems with that.  Basically they want you to register for your warranty and they provide a link to set up DDNS when you do that.Now for the show stopper - port forwarding which if you can't get it to work, you're hosed.You install and run the \"Lorex Easy Connect Auto Port Forwarding Wizard\" which is very ironic in that it would actually be easy if it actually worked. In a nutshell It's supposed to run a diagnostic to find your routers; you select the correct version from a dropdown box if it's not already there; input your DVR IP and ports you want to forward; click the button to update the router; and finally click another button to test it. Good luck getting that far without errors.  Note: the product seems to favor Linksys routers in that it may recognize and configure that brand automatically without issue. (I'm supposed to trash my Belkin and buy a Linksys?)Backtracking a bit for more details of my ordeal. You install the wizard from the DVD. Ensure you have the most current version and update if needed.  Clicking the Start button sends you on your way. It first does a diagnostic to find your router or routers if you have more than one -- or it thinks you do.  Therein lies the first problem. If it thinks you have more than one router you have to fix that problem if you can actually figure out how.  I have my ISP provided ARRIS brand router and I also have a Belkin router I use for my WiFi.  The port forwarding wizard noted I had two routers and said I had to configure one of them in a DMZ before I could continue. Keep in mind that as detailed as this is I'm actually skipping a lot of stuff.  I danced around that issue all day Saturday trying this and that to get it to work without success.Adding insult to injury. The configuration wizard is actually an application from a 3rd party called pcwintech.com which has a hot link on the wizard tool that invited me to go to the pcwintech website for more information. I did, was really tired by then, and while browsing the forums there managed to fast click on a link that immediately downloaded and installed a tool bar I did not want and hijacked my browser to a search engine I did not want either.  Now I had to spend time uninstalling that and run scans to see what malware may have come with it because I assumed I most likely managed to pick up a Trojan. Great.  Fortunately, I was able to uninstall the toolbar and my anti-virus tools did not pick up anything else.  Nevertheless, what a great way to anger and frustrate someone trying to find help using a provided link embedded in the product.Next morning on Sunday I called my ISP tech support to see why I was getting an invalid IP address error when I tried putting my number 2 router in the DMZ. I mean we're talking about a standard private class C 192.168.x.x IP address. After remoting into it he discovered there were some errors in the default configuration from the factory that should have been changed before it was issued to me. He fixed that and the next time I ran the port forwarding wizard I was optimistic things would finally work. Not so. The wizard now found only one router which is my Belkin but low and behold my specific Belkin model is not listed in the available choices from the drop down list.  I tried selecting one just one version number off from mine but it would not configure with the wizard. Guess it's got to be the exact one because the router update would not complete without errors. Or, I've overlooked or misconfigured something else.So now I'm at a stalemate. I very cautiously go back to Pcwintech.com out of pure desperation and the webmaster invites me to send screenshots of every single page of my router configuration via a very complicated method for him to add my router to a future updated list but do you think I'm going to trust this guy with screenshots of my network configuration via an insecure link (http vs https) especially after a link on his website installed that toolbar and hijacked my browser?  No. I think not. Even if I did, I wonder how long before the configuration tool would be updated so I could find my router in the list?  Days? Weeks? Months?Last resort is to call Lorex tech support which is the first thing I would have done if they were open on Sat or Sun. (Plus I'm 5 time zones away from them.)  I will try and hopefully perhaps a technician there can get me through this. Otherwise everything goes back into the box and back to them for a refund. I'm tired of messing with something that should be fairly simple to configure with adequate instructions. I mean, c'mon I was able to configure my Cisco Pix 515 firewall after a few minutes reading a book I have on Cisco firewalls from Cisco Press.  How hard can it be to set up a surveillance system? Apparently very.In summary, it may be a great product for anyone able to get it to work. However, the documentation regarding the most crucial part of the setup required for viewing the product over the Internet just plain stinks as a few other's have also said.", "Date": "December 15, 2013"}, {"Title": "Installation Instructions Lacking but Overall System Good for Price", "Author": "Kim Cantrell \"Soap Box Bandit\"", "ReviewID": "R3F6T702FFMKT9", "Overall": "4.0", "Content": "My husband and I have been considering a security system for some time and when offered the Lorex Vantage 4-Channel DVR with 4 Cameras, I was very excited.I left the installation up to my husband. He's a perfectionist with a engineer's mind so he read the instruction manual thoroughly, twice - making sure he understood the precise steps he was to follow.  And, yet, still he became frustrated.  To put it in his words, \"A chimpanzee could have written clearer instructions!\"  But, in the end, he figured it out and the system was installed about about five hours (give or take).So next in line was actually using the system.  Beginning with daylight hours, the picture was extremely clear and crisp - very high quality.  But as dusk turned to dark, the quality of the picture became less quality; not horrible but definitely not as clear as that with sun aiding it.  Let me put it this way:  daytime pic, you could identify the someone or \"something\" you're view; nighttime, you'd just know \"it\" was there.As to viewing via smartphone... just fine.  Picture quality as I described above but app works beautifully with the system.Lorex is a good system for the price paid but don't expect to get the same quality as you do from higher priced systems.  It's still more than good enough to make a person feel secure in knowing what is going on \"out there\" especially in comparison to having nothing at all.", "Date": "June 24, 2013"}, {"Title": "Just OK", "Author": "Vonny \"vonny\"", "ReviewID": "R10JRWK8AS7W3R", "Overall": "3.0", "Content": "Have had this installed for about 3 weeks now. Had to call technical support to get set up. Once you go through the 1/2 hour of pushing buttons on the phone and getting ahold of someone, they are knowledgeable and helpful. The camera quality is just ok, and installing is as you would expect...wire and hook up. My ability to see the cameras on my smartphone stopped, and after 4 attempts to call someone to get it fixed..I was cut off. It takes a VERY long time to get ahold of someone for tech support. SO..if you like me and would need help configuring it...beware...not very happy with their customer support. Good luck", "Date": "August 16, 2013"}, {"Title": "Software is COMPLETE JUNK", "Author": "Bay Area buyer", "ReviewID": "R3IJEA0YRC696S", "Overall": "1.0", "Content": "This has to be one of the worst products I have ever purchased.  The hardware works very well but the software to run the cameras and the DVR is complete crap.  The application for remote viewing on the mobile device would stop working every other hour.  You would have to keep logging back in and inputting the configurations.  That is when the app is working. NOW for the web access using the installed application which is provided in the package.  The first few days it worked fine.  After I had called the customer service 6 times to configure as the instructions were not clear.  NOW, the application would not let log back in.  No idea what is wrong and neither does the customer care.  What a complete piece of crap.  DO NOT BUY.", "Date": "August 1, 2013"}, {"Title": "Great for the money.", "Author": "Kevin Hangman", "ReviewID": "RVVS4RS9LPKCM", "Overall": "4.0", "Content": "Everything plugged in and hooked up just as promised. I have a big attic and running the wires was not a problem.  Camera quality is okay but not great (you can't read a license plate).  You WILL need to contact tech support in order to view your cameras over the internet (unless you either 1. work as an IT person or 2. are an 12 year old gamer.)", "Date": "August 19, 2013"}, {"Title": "FAIR IMAGE -- bad LOREX tech customer service", "Author": "WWCO", "ReviewID": "R3VVDSC2MACGI8", "Overall": "2.0", "Content": "We were able to get the camera's to work fairly easy process.IMAGE QUALITY: I would say they have good/color day and fair to OKAY (black and white) night vision.TECH SUPPORT: I was unable to get the Android set up, I read the directions from box, watched LOREX YOU-TUBE VIDEOS but it simply would not work. Even got a second person to try - but they were unsuccessful!==> Called LOREX TECH SUPPORTI waited on hold for a very long time. Tech (level one( said he would have Tech (level 2) person call me right back, I asked tech 1 are you sure you can't help me get it done now, he assured me tech 2 would call me right back -- but he didn't.I should have insisted he help me right then, because I work and may miss the call tomorrow or whenever they decide to call. I waited and waited for the call back, NOTHING!Never make a promise, you are not intending to keep!-------------------I would have to say -- there must be a better product and much better customer service.Very disappointed.FINAL GRADE C-More than likely I will return it, the run around tainted the overall experience.", "Date": "August 19, 2013"}, {"Title": "VERY MIXED feelings on the review", "Author": "Kipchak", "ReviewID": "RQ22L2CQY9GKR", "Overall": "4.0", "Content": "Value?  Outstanding.  The functionality of what you get for the (sale) price is outstanding.  Four wired cameras 60+ feet in length, tons of settings including alarm with definable frame setting (e.g. just highlighting the door in the picture and not the entire view of a single camera) that trips when movement is detected and takes a still photograph that can be emailed anywhere, the ability to access on your local network via computer or phone or remotely via DDNS, high quality images as far as color and contrast that see better in the dark in color (until very dark then switches to black and white) than the human eye, everything you need in the box safely shipped.BUT . . . there goes four days of my life I'll never get back.  The incredibly difficult networking setup (not the camera installs but the networking settings) make it accessible when THE SCRIPT THAT CAME WITH THE SOFTWARE DIDN'T WORK AS DESCRIBED/PROGRAMMED brought me enormous frustration.  Add to that the fact that all the cords are double-wrapped in plastic so they are easy to cut by accident even when being careful and that the box (most likely done by marketing) shows an incorrect camera orientation so after they were all installed I had to reorient every one of them 180 degrees.So, 5 star value and functionality with 2 star networking problems (even though the instructions were fairly good the software was not) brought this down a notch to 4 stars.", "Date": "August 1, 2013"}, {"Title": "Buying for your business?  Think twice.", "Author": "Jon", "ReviewID": "R2JVNZTBHTJJYC", "Overall": "1.0", "Content": "I bought this system 3 years ago.  My philosophy was always \"rather have one and not need one, than need one and not have one.\"  3 years sailed by, no issues or injuries, no possible lawsuits.... until a few weeks ago.  Sometimes a lawsuit can live or die by what is shown on security footage, and when I needed it most, the files were corrupted and lost!  The customer support had me on the phone for over 2.5 hours trying EVERY troubleshooting technique under the sun, with no results.  Said they would kick it up to their next level of tech support and get back to me.  A few days later I got an email saying that my \"ticket\" was going to close and the issue had been resolved.  NOPE!  I called again, very upset but still more than willing to be civil and figure out the answer to this problem.  They told me to take it to a third party data recovery company (not a specific one, just in general) and that is all they could do.  They told me that my data was likely gone and that they were very sorry... fantastic.My advice?  Spend the extra money on something that WILL WORK, because you might have to risk your entire business on it.", "Date": "April 25, 2014"}, {"Title": "half way worth it", "Author": "A. Inman \"MotherofOne\"", "ReviewID": "R2SWNNWZGSONEQ", "Overall": "2.0", "Content": "cameras are GREAT; beautiful image; night vision is outstanding for small yards; actually worked better with no lights on in the yard even; BUT BUT BUT the DVR stinks! It would not record constantly; would keep resetting itself; every time we needed it - it wasn't recording; the menu is like from the stone ages like Windows DOS and takes more time to review your footage than needed; you might as well carry around a mini camcorder from the 80-90's; we even called and talked to customer service for the company and twice they reset the DVR and STILL it kept malfunctioning; we eventually just returned it because it was pointless to have cameras with no consistent recordings; we ended up purchasing commercial services from Koorsen Fire and Protection and are SOOOO much happier.", "Date": "August 27, 2013"}, {"Title": "DOES THE JOB", "Author": "ALBERT C", "ReviewID": "R2MUGHV51US476", "Overall": "5.0", "Content": "I PURCHASE THE PRODUCT LOOKING FOR ENHANCE SECURITY. INSTALL WENT WELL A LITTLE KNOW HOW IS A BIGPLUS. YOUTUBE IS SOME HELP THE BIG THING IS TO HAVE A VERY CLEAR INSTALL PICTURE. KNOW WHERE EVERYTHING IS GOING AND HOW TO GET THERE. THE AVERAGE PERSON SHOULD BE ABLE TO HANDLE THIS WITH NOHELP JUST TAKE YOUR TIME.  AC", "Date": "May 27, 2014"}, {"Title": "Do Not Buy Anything From Lorex", "Author": "C. A. Neal", "ReviewID": "R30YBYHLCDBXBY", "Overall": "1.0", "Content": "I bought this system and immediately had problems with it. The cameras and dvr did not work properly. I called customer support and was told the wait time would be 15 minutes. So, I turned on the speaker on my phone and waited. The wait was 45 minutes long. The technical support person did not know much about the system. She kept referring to her computer and gave me information that was in the installation booklet. I will never buy a Lorex product again. Don't waste your money or your time with this company. The customer support is horrible. I called two times and had to wait long periods of time just to get a technician how knew nothing. If you decide to buy from Lorex, all I can say is good-luck.", "Date": "May 22, 2014"}, {"Title": "Great system, bad customer support", "Author": "A.Right \"Nothing is what I seems. So check tw...", "ReviewID": "R1CCPA4C61GTSP", "Overall": "5.0", "Content": "I bought these and love the visual system though I would prefer a bigger storage capability. I guess one could have the DVR for a bigger capacity one, though for family use, this could be enough once you remember how much video storage timewise you can hold.  As is, it only records for 6-7 days and then it overwrites from the beginning, so I would go for a bigger HD if I could have a choice. I am doing an update to this review since I have been given very detailed customer support from the team in Lorex regarding a problem that I reported to their ticket system. As It turned out, I had changed some settings that badly affected the system's ability to make backups and I couldn't make a backup. I had a great response from their  customer service after I got their attention. My thanks and deep appreciation for their special attention to the problem I was experiencing. One thing that I still don't like is that they close the tickets without verifying that the problem had a solution. I say this because I am used to other systems,  TechSmith for example, maker of  several computer programs  that i have used in the past and present and all their tickets are closed once the user tells them that they implemented a solution and it solved the problem. i think they should wait for this to happen or investigate more.What can I say about the hardware? I am very satisfied with the quality of the video and the capabilities of the software to personalize the experience. An  8 camera system like this gets a big area covered with sharp and detailed LIVE video with the ability to review past recordings and make backups to USB. It also has the capability to set alarms, set motion detection, black out some areas so they don't appear on the monitor (though they are recorded) .  There are so  many features that I cannot remember now, so it is  very comprehensive system to have. So far it is a solid 5.", "Date": "May 6, 2014"}, {"Title": "Great system", "Author": "Richard F. Ginaitt", "ReviewID": "R3AQ68KAPEKFIN", "Overall": "4.0", "Content": "Easy to set up only issue I have is occasionally my phone cannot connect until I reset the system otherwise it's great", "Date": "April 20, 2014"}, {"Title": "not recommend", "Author": "J", "ReviewID": "RCHDH26QALLYG", "Overall": "2.0", "Content": "I would not recommend this product because two of the cameras were not working had to replace them with diffrent brand but it works now oh and also an out put in the recorder didnt work and it was way of a hassel trying to do it yourself after much help from lorex tec suport we figure out the instalation not as easy as it reads on the box after all set and done with much time wasted i had to give you a two star (:-(", "Date": "April 10, 2014"}, {"Title": "not full color", "Author": "jeremy miller", "ReviewID": "R2ME6YTI6OOS4X", "Overall": "2.0", "Content": "Said they was color and sound but there is No sound and 2 cams are black n white. . .", "Date": "March 20, 2014"}, {"Title": "Could be better", "Author": "J", "ReviewID": "R3E4J3O58ILMV9", "Overall": "2.0", "Content": "I bought the Lorex camera system after ADT quoted me a very much higher price for only two cameras. The installation really depends on your knowledge of how to run wires through your house and hide them.  I am knowledgeable with that aspect so to me the installation of the system into my home was easy and fun.  Once I had it installed I moved onto the technical stuff with setting it up to my router and port forwarding it so I could view the cameras with my Android phone.  This is where Lorex really needs to improve.  The instructions are not user friendly.  You need to know something about computers to understand the instructions.  It took me literally two weeks after install to view my cameras on my Android phone and it was only by complete accident.  I was so exhausted with interpretations of the instructions and trying everything, I accidentally clicked a few buttons and my camera's were on. FAIL from the instructions!  The server that supports the cameras seems to go down about two times a month.  It is very annoying.  I emailed the support team at the email the app provides but they take weeks to respond.  I had three correspondences with them and they always have an excuse why they cannot respond in a timely manner.  The camera's provided are garbage, I already replaced all of them.  It is a camera system that could be a better system if it was more user friendly!!", "Date": "March 7, 2014"}, {"Title": "You get what you pay for", "Author": "Christopher DeYoung", "ReviewID": "R1MRACKMVAFCBF", "Overall": "2.0", "Content": "I had this system for just over a year. Some interference, but cameras worked pretty well. It was kind of complicated to set up, but called Lorex and received great help.First, Camera One died after 6 months, then 7 months later the Hard drive died (post warranty). Lorex recommended we send it in, but at minimum the cost of repairing it would have been almost equal to the original cost. I Could still view the two remaining camera's remotely (just not  record), but then another camera died.Today, my guess is the last camera died, that or the entire unit caught fire and burned my house down, because I cannot see anything remotely anymore.  I recommend that you invest a little bit more money to buy a more reliable video surveillance system, unless you only plan on having it for about 13 - 14 months.", "Date": "March 5, 2014"}, {"Title": "Watch your property anywhere in the world with the free smartphone apps.", "Author": "Rolando Pascual", "ReviewID": "R36L08HEIIZV2B", "Overall": "4.0", "Content": "It was a good thing we checked the system before installation. One camera is not working, found out that the video cable is shorted internally.  Just so happen that I only need 10 feet on one of them, so we decided to cut and by chance found the short near the molded Y junction.  Cut/resoldered/insulated/shielded and tested - ok this time.  Took 6 hours to install the camera and hide the cable.  After that, takes only 2 minutes to install the smart phone apps.  Instruction sheet is well designed.  Even a novice can follow the procedure.  Picture quality not bad for the price of this model.  Of course a more expensive camera is also available.  For a novice or just starting a business -  This is a great investment.", "Date": "February 20, 2014"}, {"Title": "do not waste your money", "Author": "Monica Harmon", "ReviewID": "RUG2GF73BJA60", "Overall": "2.0", "Content": "picture quality is adequate at best and customer NO service at lorex is a head ache.  do .not buy Lorex product if you want any type of service", "Date": "February 12, 2014"}, {"Title": "BT", "Author": "byron scally", "ReviewID": "R1OTJGBGDYRMRQ", "Overall": "2.0", "Content": "These cameras are just fair at best.. but the customer service at Lorex is Terrible... Frustrating...and be prepared for many hours of being on hold..When I actually got to talk to person it took 2 12 days... to resolve the problem and they tell me their Iphone app does not work.. ??? What??? Go elsewhere... :)", "Date": "February 6, 2014"}, {"Title": "rating review", "Author": "Jackie Ficele", "ReviewID": "R10VSNF6E0DHN0", "Overall": "4.0", "Content": "Good product. Clear picture during day but at night unless there is some lighting you cannot see anything. Choose a 4 rating because the night vision is the only downfall and it can be improved with better yard light.", "Date": "September 20, 2013"}, {"Title": "great for remote viewing", "Author": "K. merrill \"mechman76\"", "ReviewID": "R3HDS6IZE1QWQ", "Overall": "5.0", "Content": "This is a very good setup for the price. and the software is very well thought out. I had some issue getting mine set up because of a firewall I had but the customer support was great and got it all working for me. I love that I can check on my building from anywhere.", "Date": "September 4, 2013"}, {"Title": "Does the job for a reasonable price", "Author": "Richard M. Vazquez \"The Gadget Guy\"", "ReviewID": "R2O5V9FT1ZXHBB", "Overall": "4.0", "Content": "Product relatively easy to set up with good documentation. Good tech support and good trouble shooting information on the product web site.", "Date": "August 26, 2013"}, {"Title": "Works very well in many different applications", "Author": "jay", "ReviewID": "RMQSDV45DULN6", "Overall": "5.0", "Content": "Purchased this to montior my rooms at work. VERY easy installation. Literally plug and play. I didn't network so I could use remote viewing but if you have a monitor and a PC, it will do the trick. I plan on networking at a later date if needed but right now, we're just saving the video and reviewing daily.", "Date": "August 16, 2013"}, {"Title": "great product", "Author": "A. Fontenot", "ReviewID": "RA43T7IX6IUL0", "Overall": "4.0", "Content": "great product I would have given this product 5 star but it is a little challageing to operate and setup. I am a tech nerd and very good with computers and tech stuff. I did figure most everything out with this setup with a little help from a network friend i had a hard time port forwarding my cams. but other wise a good product for the money. oh packageing was great. cams a little blury but they are just 720p", "Date": "August 11, 2013"}, {"Title": "Exceptional deal at an extraordinary price", "Author": "Andrew Lynch", "ReviewID": "R3HTQQ8TYOZLWJ", "Overall": "5.0", "Content": "I love the Lorex products. I was so enthusiastic when I was able to purchase this system at a fraction of the cost of the manufacturer itself. I will remain a loyal customer because of this exceptional deal at an extraordinary price.", "Date": "March 31, 2014"}, {"Title": "Lorex Security System", "Author": "PA", "ReviewID": "R3KBZAG0IFVKK8", "Overall": "5.0", "Content": "Great product. Very easy to set up. Instructions were easy to follow.  U can set it up to your iphone also.", "Date": "August 18, 2013"}, {"Title": "No-frills visual monitoring with some nice features for the price point", "Author": "Sam M. Tannenbaum \"Sam\"", "ReviewID": "R2MLXXE7KQIMIE", "Overall": "4.0", "Content": "The Lorex Vantage package is a good option for people who need to be able to monitor several locations or subjects simultaneously without making a major investment or commitment to a security service.You get four cams that perform solidly if unexceptionally. Lorex overstates the low-light performance of the cameras a bit, but it's serviceable (the user will probably want to experiment a bit to find the 'sweet spot' of low-light performance).Setup isn't as intuitive as it could have been, due primarily to unclear literature and software that isn't terribly user-friendly. However, once it's up and running, it DOES actually work as advertised. The mobile monitoring is pretty cool, and although the motion detection is hit-or-miss, email notification works as advertised. I've not had to deal with Lorex customer service or technical support, so I can't speak to that aspect of the product.In my estimation, prospective buyers need to consider two things:1.) The cameras are NOT wireless, so you WILL need to consider the logistics of running cable from the cameras to the control box2.) This is not a high-end security system- it's a low-end monitoring system. That means that things like software-side maintenance, etc., are the user's responsibility. Don't set this up, forget about it for six months, then get upset because it didn't automatically retain and catalog all your footage for the previous six months.Having said all that, it's a reasonably priced monitoring system that, for the most part, works and performs as promised.", "Date": "June 26, 2013"}, {"Title": "Exccelent", "Author": "Fernando A. Duran Zamud", "ReviewID": "RUCEX2CXKKU9", "Overall": "5.0", "Content": "I have not installed yet but already the funcionanado saw in the house of a friend. They work well d day and night", "Date": "November 9, 2013"}, {"Title": "Adequate video system for a good price", "Author": "Mysti", "ReviewID": "R5H4TT1B2FLMZ", "Overall": "4.0", "Content": "When this system arrived, my husband who worked as a security and satellite technician volunteered to install for our home so I will split my review in to two parts.First the installer's(my husband's) thoughts:Camera casings are solid and weighty which is right for an outdoor camera. Wire ports in the back center of the brackets allow for the wire to be completely inside the camera and casing body which is good for low mounts where a wire could be easily damaged or cut. Wire provided was 'fine' but a little short for one long run to the back door. The DVR casing was sturdy and because of remote viewing is great to hide in rafters or under a cupboard. Daytime video is great, and for a system of this price the IR works surprisingly well.Now my thoughts:I really like the remote viewing capability on this system. From work or in my car I can use my android phone to see who is in the driveway, whether my husband is home or not, or what time my Amazon.com delivery came. I also like that if anything is ever out of place outside we can have video to help figure out what happened. It is kind of strange to see my own house at night on security camera footage but so far all we have recorded is a family of deer and countless racoons. Hopefully that is exciting as our security footage will get.Overall: Solid sturdy hardware, great video recording, low end price.", "Date": "June 27, 2013"}, {"Title": "Many different prices to choose from...", "Author": "slim \"57psalm\"", "ReviewID": "R38M0518406O7F", "Overall": "3.0", "Content": "You know that saying \"You get what you pay for\"? It appears that the more you are willing to spend on this product and its many variations, the more features and the better quality you get.I have the 4-camera model.  We thought it would be nice to hook it up to our TV so we can simply flip to it during commercials while watching TV.  Here are some things to know:It does NOT come with RCA cables. We had to buy connectors so we could use the existing cables with our RCA inputs and then it worked fine.Each camera has about 50 feet of cord.The navigation menu(s) are rather confusing. Some don't work constistently like the other menus, making things worse.  Eventually we figured out how to get from choice to choice, and select certain choices, but there were still some quirks that made it quite frustrating.The camera quality is ok at best. Colors are often faded and not like what the human eye sees, or it goes to black and white with IR mode.It switches automatically between color and IR mode, which is fantastic.  It seems to use IR mode in relatively light conditions.We were able to use the DVR in motion detector-mode. We pointed a camera at a nesting bird, and set it to record just when motion was detected.  It worked great, from what we can tell!  We were able to see the bird sit on its nest, fly out, fly in, feed, and cough up leftover pellets.  At close range (a few feet) the resolution was pretty good, but not crystal clear.The video format isn't compatible with any of our other video programs (like Corel) though.  Have to use the software that comes with it to view the video.", "Date": "June 1, 2013"}, {"Title": "Affordable surveillance system, great hardware so-so software", "Author": "Techie", "ReviewID": "R2NXET24N9KYI4", "Overall": "4.0", "Content": "Like I said in the title, the Lorex LH014501C4F hardware is great, sadly the same can't be said about the software that comes with it. I tested it in a few computers and different operating system. Well, the only two OS supported by it, Windows and Mac.At the end, I uninstalled it and settled for using a direct connection to the DVR with a monitor and the included mouse. For remote access, I recommend using the ActiveX controls application that installs directly into Internet Explorer or Safari when one tries to access the DVR using a local network. That is in my opinion the best way to manage this DVR from a distance. I like the options of no having the DVR recording all the time, but being able to start to record with single click. Also, it's great the feature of taking snapshots and store them into the hard drive of the computer that is accessing the DVR from a distance.An administrator account is set by default, it doesn't come with a password, but I suggest that the first thing you do is setting one. Also, a few users can be created with different level access to the cameras and DVR remotely. The only setback to this, is that even if the users are forbidden from using all the features, they can still see those features available. Like I said, the software needs to be improved. I hope it does, because this company is offering a great hardware product at an affordable price.In the box it comes almost everything needed to set the surveillance, from plastic screw holders for the cameras to a USB mouse.The 60' feet long wires included with each camera are good enough for the average business or home size. But the black wires are an announcement of where to cut in order to disable the cameras, so those wires must be hidden. Putting them thru a wall is a good solution, but a truly hard task. In the end, I settled and placed them inside 1/2 inch PVC pipes, all along the ceiling, right where the wall and the ceiling meet. Since the pipes are the same color of the walls, they blend well, and it would take someone really perceptive to guess what they are for, at a simple glance.The cameras work great both during the day and night. Indeed, I was surprised of how well the night vision works. I think that this system is a good option for a small business, and/or a big household. If one has a home business, this is perfect, two cameras can be used to watch the business and the rest to surveil the house.Finally, I noticed that the DVR gets hot after a few hours of operation, in spite of the case having many tiny slots carved in for air circulation. This heating is a bad thing in the long run, because circuits and heat don't mix. Eventually the heat will destroy the circuits and shorten the life of the machine. The only way to prevent that outcome is pointing a desktop fan at the DVR to cool it down. I know it sounds unsophisticated, but it works, and it's a economical solutions that would extend the life of the product. The DVR comes with two USB ports, 5 Volts DC each, so even a USB powered desk fan might work without adding an extra energy cost.", "Date": "June 14, 2013"}, {"Title": "entry-level security camera system adequate for its target audience", "Author": "fatmav", "ReviewID": "R2PWMDL7B4HT1E", "Overall": "5.0", "Content": "Courtesy the Amazon Vine program, I received this Lorex Vantage 4-channel DVR with 4 cameras pack for review. Think of this as a digital video recorder shipped with a 500GB harddrive (user upgradable), plus four wired, reasonably good quality integrated color (day vision) & IR (night vision) wall-mountable camera that you can hook up to the DVR for recording.We installed this in a friend's house. The setup was uneventful, other than the fact that we must find a good location for the DVR to work around the length of the cables, which are about 60 feet in length. Do not underestimate how much cable you need---to neatly route the cables around the walls, you need extra. (Otherwise you end up with wires in the air... not exactly a good idea.) After we settled on the location of the DVR, the mounting was extremely quick, and so is the software installation. It took less than two hours for the two of us to get everything running, and then the slightly disappointing realization comes when we turned on the system.This is an entry-level system. While we certainly did not expect cinema quality footage, the color video is quite washed out and blurry by any modern standard. In our opinion, it literally is worse than the cameras on our iPhone during broad daylight. We double checked to see if we left some oil/dirt on the camera. No. I think this is a case of you get what you paid for.Once the night comes the cameras automatically switched to IR mode. The specification states a 50 feet range in pitch black. I really have no idea how they got that number unless they mean objects that are specifically designed to reflect IR. We live in a city, and so we never reach really pitch black. Still, other than the head & tail lights and the surprisingly bright car plates, you would not be able to tell that there were cars driving down the road once the sun has completely set.The software in the DVR system is, in our opinion, easy to use even though admittedly very ugly. As for the major selling point of the system, namely the ability to monitor and review footage on a mobile device, we found it to be functional but the vanity wears off very quickly on us.Overall, I have to agree that this is a working system for entry-level surveillance needs. The only thing I wish is wireless connection. I see that Lorex does make a wireless model, but it is over twice the price of this one... (and it is not clear the night vision would improve on that model.) At its intended price point, this system deserves a solid five star rating.", "Date": "June 27, 2013"}, {"Title": "a bit harder setup than others but good monitoring choice", "Author": "AIROLF", "ReviewID": "R2K0YYRTB0SWFR", "Overall": "4.0", "Content": "I decided to use this system to monitor the inside of my home, really a few rooms since you only get 4 cameras in the kit. I am really curious to see what my dog does throughout the day, and to make sure bulgar, etc. don't go in on the walk-out-portion of the basement.I found the set up a little bit harder than DEFENDER SENTINEL 8CH Smart Security System, 500GB DVR and 4 Dome/4 Bullet Cameras with 600TVL, IR Cut Filter and Night Vision, but then this is more inexpensive than that one.The value is in your ability to monitor via tablets/phone/computer. I think for the price, the time required to set up the cameras and the monitoring software is realyl worth it. All-in-all, i find this a decent product for the price.", "Date": "June 24, 2013"}, {"Title": "Great value and product", "Author": "W. Miller", "ReviewID": "R1NTSR44X27EYR", "Overall": "5.0", "Content": "We're using these to monitor the basement for my brother who is disabled and needs full time care. Now we don't have to constantly check on him as we can monitor him via the computers, tablets, or even iPhones.Pictures are sharp. And the apps work consistently. We can even leave him alone for a few hours and know we can check in on him remotely.Excellent product.", "Date": "June 20, 2013"}, {"Title": "Very good system for the price", "Author": "t.g. randini", "ReviewID": "R22TMC6I29BEGH", "Overall": "4.0", "Content": "The Lorex package includes the following:· 4 Ch DVR with 500GB HDD· Remote Control· Power Adapter· Mouse· Ethernet Cable· 4 x Cameras· 4 x Camera Stands· 4 x 60ft BNC/DC Extension Cables· 1 x 4 in 1 Camera Power Adaptor· CD, Quick Start Guide, and Instruction ManualThe installation took four hours and went fairly easily as I had gained experience in a prior installation (which I'll call Brand X for comparison to this unit).Observations:  The instruction manual wasn't as well written as Brand X but with my experience I managed pretty well.  Someone without experience may need some help in the installation process.The daytime image was almost as clear as the pricier Brand X (I used the same monitor for comparison).  I was pretty happy with it.  The nighttime image wasn't as defined as Brand X and the range was about 20% lower, but still very good.  I could pick out the neighbor's dog across the street pretty well, but lost visibility once I looked down the street.The images via smart phone were also good, but not great.Recommendation:  There are systems with better cameras and greater range on the market but these systems are more expensive.  I felt Lorex had very good performance for a less expensive system and would recommend purchase if your budget is in the $300 or below price range.", "Date": "May 29, 2013"}, {"Title": "CCTV at it's finest", "Author": "Tod Morrow", "ReviewID": "RUYYD9JSP68VM", "Overall": "5.0", "Content": "Best name in CCTV! Lorex systems are the only ones for me. They will provide this company the security we need.", "Date": "October 8, 2013"}, {"Title": "Works fine, but room for improvement", "Author": "M. Fulkerson", "ReviewID": "R1ZV7WCQ7DQFKK", "Overall": "4.0", "Content": "The basic functionality of this product is great and it performs all of its duties the way its advertised to do.  I connected my Mac to the Dynamic Domain Network Service, and once I got the unit hooked up and ready to go it has been chugging away like a champ.  If it weren't for a cumbersome software setup process and the lack of wireless connectivity, this would be a five star product.This unit contains all the cords you will need for setup.  All four of the cameras are easy to hook up to the unit which is routed through your monitor.  I didn't have any issues hooking up the hardware to my computer and monitor, and can't imagine many others will either.  The cords might be a bit small for some with a very large home, so look into what you need before purchasing.Once I got the cameras up and running through my monitor, I found that pictures were bright and colorful, but the stated range might be a bit lacking.  It states you have a 50 foot range in the dark, but it my experience it was closer to 30 feet.  Still, the pictures in both light and dark were sufficient up to this range, and luckily for me I don't need much more with my home.The coolest features for me is its remote routing feature which allows you to work the unit with a wireless device.  I use an iPhone 4 to work my cameras, and everything functions with no lags or problems at all.As I mentioned before, this unit requires cords to work which in this day and age baffles me to no end.  This was the biggest issue I had in setting this unti up, as well.  Once you start coiling up wires around your house (which will probably be too short for most), you're going to start wondering if you really need this model that badly.  This needs to be wireless, pure and simple.  The ethernet cord is also extremely short, like a couple of feet and that's it.  You can always use your own, but why should you have to?  Lorex needs to include much longer connectivity cords with this package.  Also, the software is badly conceived and cumbersome to navigate.  I understand this is a small company and designing software may not be the top of their to-do list, but it's pretty antiquated and annoying to use.Having said this, the unit performs as advertised, and I haven't experienced any technical difficulties yet.  If it were a wireless device with better software, this would be very close to a five star product.", "Date": "June 23, 2013"}, {"Title": "Excellent value for the reaassurance of the home owner", "Author": "Greg Ehrbar \"'MouseTracksOnline'\"", "ReviewID": "R3F4F5ZDLIY07J", "Overall": "4.0", "Content": "This is quite nice for the price.  It is fairly easy to install and get set up.  Depending on the design of your home, you might wish there were more cameras.  We could have used one more for full coverage but overall it is a good buy.", "Date": "June 18, 2013"}, {"Title": "Would I get this again?  Only if it came with a person to install it!", "Author": "Steph \"booklover\"", "ReviewID": "R31V7NEZSAIF2R", "Overall": "3.0", "Content": "The Lorax security system seemed like a great price for what you get.  And it works!But.... putting it together is not as easy as advertised.  I will admit, I am not very technically minded.  First of all, there are items that are not included in the set that will be needed such as a 15 pin VGA cable or a BNC terminated cable.  Another annoyance was that all the chords are very short!  The 2 power chords (one for the cameras and the other for the digital recorder) are only ~ 3 feet long.  Plus the head of each power chord is a large rectangle size that does not easily fit on a strip.  Also, the Ethernet Cable a mere 3 feet, too!  Realistically, most people will need much longer chords.  Once I got the cameras working the color was off -everything had a faint green tinge that would not go away no matter the settings I changed.  My last quibble is that for some reason I thought this system was wireless.  As in the cameras were wireless but this is not the case so you will need to find a way to snake the wires that connect the cameras to the digital recorder in between walls etc. to hide them -need I say how much work this is?!ProsGood priceIncludes mouseInternet remote monitoring- need broadband router and computerConsShort chords - 2 power and Ethernet ~ 3 feet eachInstructions that skip multiple stepsCameras not true colors, poor image quality?Does not include VGA or BNC cablesSnaking the wires from the camera is difficultMust find/have a monitor that works well with this system.This is not an easy set up, especially with all the issues of chords that are too short, missing cables and figuring out getting the right placement of all the wires and snaking them.  The computer set up was relatively simple in comparison. You can do it but it would be easier to hire someone and I am not sure if the quality of the camera images are that great.  But the price is right for someone who wants security and is on a budget.Would I get this again?  Only if it came with a person to install it!", "Date": "June 2, 2013"}, {"Title": "Don't Bother", "Author": "nitsa", "ReviewID": "R2KW77AQX9S2VD", "Overall": "1.0", "Content": "When I saw this item on Amazon I thought what a great idea. My mother in law just got diagnosed with Alzheimer's . We bought this to put it in her apartment to watch her through out the day. It was a nightmare to set up and when we finally did there was no sound and the picture would come on then go black I hated this product Please do not waste your money it is pure garbage and that is exactly where I put it.", "Date": "June 23, 2013"}, {"Title": "Awesomeness!!", "Author": "Suzuki646", "ReviewID": "R1YWFPB68EBB1", "Overall": "5.0", "Content": "It is a great product! Will definitely recommend it to everyone I know! Love Amazon it's the best. And the price was great!", "Date": "June 29, 2013"}], "ProductInfo": {"Price": "$799.95", "Features": "960H (960x480) recording resolution capable\n480TVL camera resolution; 4.6mm F2.0 fixed lens with 55 degree field of view & up to 75ft. IR Night Vision\nInstant email alerts with snap shot attachment\nHDMI, VGA & composite outputs\nIncludes 16-Channel 1TB Pentaplex DVR, Multi-Voltage 110-240V 50/60Hz DVR power supply, IR remote, two 4-in-1 power adapters for the 8 surveillance cameras, mouse & Ethernet Cable", "Name": "Lorex LH0161001C8F 16-Channel 1 TB Digital Video Recorder with 8-Camera (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41rEhQU9StL._SY300_.jpg", "ProductID": "B00B8I23O4"}}