{"Reviews": [{"Title": "Product Description is a lie Update**", "Author": "Nouriefamily", "ReviewID": "R38QM7C56UV6ML", "Overall": "4.0", "Content": "*After leaving my review down below, the company promptly contacted me and offered to send me one of their cameras with night vision for free. They were very helpful, and this is a good daytime or indoor camera. The picture quality is amazing compared to my old Q-See 480TVL cameras.The only part of the product description that is the truth is that it is a 700 TVL camera. It is not a day/night camera. It has no LED lights to make it work in the dark. It is not white, but beige. It is plastic, and not an outdoor camera either. The only reason for the two stars is the picture quality, otherwise I would have only given it one star. There were exposed wires that caused the camera to short, but my husband covered with electrical tape. Although it says is it an indoor/outdoor camera it is not. The instructions state  to prevent electrical shock keep camera away from moisture or rain. I contacted the seller about the misrepresentation of the product, and they told me that the department who sells products on Amazon edit descriptions in order to make their products sell. Do NOT buy this camera, it is crap!", "Date": "July 29, 2013"}], "ProductInfo": {"Price": "$110.87", "Features": "COLOR 1/3\" Sony Effio-E High Resolution CCD support chronous System.\nThe color camera can get high definition picture in low Lux condition.\nIt own the characters of high definition and stability, strong anti-jamming, rich and real color.\nFixing and using this model are convenient too. The color cameras AES speed can reach 1/100,000s.\nIt is very good for you to apply to yours CCTV system, come with OSD menu.", "Name": "ePathChina® 700TVL 1/3\" Sony Effio-E Color CCD Plastic 2.5 inch Dome High Resolution & High Definition and Stability Color CCTV Camera With 12V Input,3.6mm Fixed Lens,2:1 Interlace Internal Synchronization System,PAL /Clock Frequency(MHZ),Built-in Auto Electronic Shutter Function,Support OSD Menu CCTV System Security Camera For Indoor / Home / Business Security Video Surveillance", "ImgURL": "http://ecx.images-amazon.com/images/I/414iemopG6L._SY300_.jpg", "ProductID": "B00B58KNBW"}}