{"Reviews": [{"Title": "I love it", "Author": "Jon Bollenbach", "ReviewID": "R1DDA90SJIRBEU", "Overall": "4.0", "Content": "I recently bought this camera to record underwater.  Before I continue I will put two links to youtube videos that I recorded with the Monoprice. Be sure to turn on HD!!!http://www.youtube.com/watch?v=Sxb2Z5uZgtohttp://www.youtube.com/watch?v=p-oJ_6C2zC0Now onto the review.First off, the other review on this page is pathetic.  He obviously does not know anything about a good waterproof camera that is only $90.The wide frame is perfect and you cant expect anything better even compared to gopro it is just as good.The HD is amazing and underwater is fantastic!One challenge with this camera is that there is no view finder, now I do realize that all cameras like this don't, but still its a down side.So explaining why I gave 4 stars instead of 5.The Mic on this camera is TERRIBLE! its muffled and when it goes underwater it constantly is popping Even regular talking this mic is awful so if you are wanting to record anything with sound pretty much don't plan on using its mic...other than that I love this camera its easy to use and small with a great resolutionGet it! Go pros are not worth it unless you go for the white.", "Date": "July 8, 2013"}, {"Title": "OK for the price , but left me wanting more...", "Author": "UNIX Guru \"UNIX Guru\"", "ReviewID": "R3HBJDZZC3WFV4", "Overall": "3.0", "Content": "Pros:* The low price.* Quality of construction.Cons:* Limited to 120 degrees field of view compared to 170 degrees offered by other action camera competitors.* Limited camera mounting options.* Grainy Low light capture.* Limited after market accessories like waterproof housing for submersed activity greater than the rated 30 feet.* cannot charge unit while in use.Because of the low entry price the camera is good introduction to Action Camera's but in my opinion it is not as good as the comparable offerings made by Contour or GoPro or Sony Action camera.It looks similar to design to a Polaroid XS100HD HD action camera.The biggest negative for me is the limited field of view of 120 degrees. I tested it on a bike ride, car dash camera and on AR15 rifle and the narrower field of view kept me wanting more...!!!Color is not corrected and can prove drab, flat and subdued in certain light conditions. In bright day light the colors are great.Configuration is minimal and requires connection to a PC or TV via HDMI port. There are instructions on how to do it without using a video monitor by clicking on the power button but that would be hard to do for the uninitiated.The auto orientation only works only 2 ways. 0 degrees and 180 ( upside down) . It does not correct at 90 degrees or 270 degrees like the Polaroid.I had trouble hearing the sound using Windows Media player and I thought I had a bad camera, but after searching the web and emailing MonoPrice tech support I downloaded another free video player called MPC-HC and the sound problem went away.As opposed to the other reviews sound capture is acceptable. It definitely does not cancel wind noise though.I initially planned to use to scuba diving at shallow depth less than the rated 30 feet ( 1 atmosphere) but I see no noticeable O-ring at the cap covering the rear outputs that I don't think I will even attempt it. I would only do it with a underwater housing.For my needs, I would have preferred it to have wider field of view and an available underwater housing option.I honestly cannot give this unit a 5 star rating even for it price point. It would be between 3-4 stars.", "Date": "May 5, 2013"}, {"Title": "Great Purchase", "Author": "Matthew E. Pawelski", "ReviewID": "R2ZSV919SMCO5D", "Overall": "5.0", "Content": "Arrived promptly and intact; a very reasonably priced HD Action Camera.  Have only done some basic testing, but I can tell it's going to fit my multirotor FPV need perfectly for now.", "Date": "January 25, 2014"}, {"Title": "Great Camera", "Author": "Osvaldo Berrios Rodriguez", "ReviewID": "R3L87WBRXA2IC2", "Overall": "5.0", "Content": "Received a better product for the buck, some people are expecting a go pro quality you will have to buy Go pro, but for the money this product is perfect and tested already underwater and on the mountains and so far it is my best cam!", "Date": "December 27, 2013"}, {"Title": "not bad", "Author": "Greg Glass", "ReviewID": "R13AZA66FPSZQG", "Overall": "4.0", "Content": "Tried out the new camera on a helmet. It was drizzling and my visor was covered and could hardly see. I figured the MHD would have a poor picture. I had sprayed rain ex on the lens before I tried it. The video was great for the conditions.", "Date": "October 30, 2013"}, {"Title": "Worst camera ever!", "Author": "Jason", "ReviewID": "R30N19VYLQWFQV", "Overall": "1.0", "Content": "This is the worst camera I have ever used.For starters, it is advertised to record for 3 hours.  My current record is 32 minutes.  The battery usually dies between 20-25 minutes of recording.Yes, it records in HD, but HD still looks terrible if its out of focus and shaky.  For an 'action camera', this camera really does not like to moved around while recording.  If you hold it still or use a tripod, it does OK, but any significant movement of the camera, and it goes out of focus and gets shaky.  There is NO anti-shake feature in this camera, which seems like a necessary function for a real 'action camera'The camera does not do well with changing light conditions either.  I'm NOT talking about extremes here, like going from bright sun into darkness, I mean that the camera has trouble adjusting from being in slight shade into normal daylight and vice versa.  When going into more light the video is washed out and very over saturated for 10-30 seconds, and when going into shade the video is nearly all black for a few seconds as well.The 'auto rotation' feature is terrible (if mounted upside down, the video is supposed to still come out right side up).  On paper, this seems great.  With the camera mounted right side up on my motorcycle handlebars, revving the engine or hitting a bump in the road 'confuses' the camera and causes it to flip the image, creating an upside down video.  Not only does this feature not work properly, but it ruins most of my videos be flipping them upside down.Yes, its cheaper than a GoPro by nearly $200.  There is a reason for that.  Terrible video quality, VERY short battery life, and upside down videos.  I expected this camera to be not so great, based on the price.  Even with my low expectations, I was extremely disappointed.Honestly, I take better quality videos by taping my 5 year old cell phone to my helmet or handlebars.  I'm not kidding, my 5 year old cell phone taped to my handlebars or helmet does a MUCH better job.  I wanted this camera so I could stop taping my phone to my helmet... but this camera is so bad that I'm continuing to use my phone.I received this as a gift, so I can't return it, but if I could I would have sent it back already.Save your $100, this camera is total jumk.  I contacted Monoprice technical support with my issues of short battery life and flipping image and they were completely unhelpful.  I feel like both of these issues SHOULD be covered under warranty... but they are not.My cousin has the same camera and he has the same problems as me... which makes me think that its not just my unit that's bad.", "Date": "July 28, 2013"}], "ProductInfo": {"Price": "$199.99", "Features": "Capture all the action with this MHD Action Camera from Monoprice!\nThis camera boasts a full high-definition 1920x1080p display with 24-bit color depth at 30 frames per second\nIt can also be set to capture at the lower 1280x720p 24-bit resolution with 30 fps", "Name": "Monoprice 110159 MHD Action Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41QqE9ZWJHL._SX300_.jpg", "ProductID": "B00BZWOHKQ"}}