{"Reviews": [{"Title": "Is no stars an option?", "Author": "Chris", "ReviewID": "R2G28UZ1I7BX00", "Overall": "1.0", "Content": "I am figuring out that almost all of these nanny cams have similar problems - impossible or no instructions whatsoever. Granted, if you are electronics savvy you might be able to make heads or tails of this thing, but I couldn't. The software wouldn't install, I couldn't get it to record, and even though it claims to be up to 32 GB, it only fits a 4 GB card. I thought if we went for the more expensive item we would get quality and ease of use but no such luck. Don't even bother.", "Date": "March 27, 2013"}, {"Title": "Great Design, Good Quality", "Author": "KF8107", "ReviewID": "RZ0FHVACYZYBW", "Overall": "5.0", "Content": "Contrary to the other reviewers statements I found this product to be good quality with a great design. Many of the smoke detectors I looked at had to be plugged into the wall. That didn't seem like a good design so I went with the Xtreme Life Smoke Detector because it is battery operated. The instructions made sense and the video quality was right on the money. I also am a big fan of the night vision capabilities, actually help me capture video at night when my teenager was sneaking back into the house past curfew. The Smoke Detector comes with a 4GB SD card to start you out, cables to charge the battery and connect to my TV, and a convenient SD Card Reader that allowed me to transfer to video easily on to my PC. I upgraded to a 32GB Card(max size for this product) and received 50 of video when the card was full. Couldn't ask for more, product worked as advertised and better than I expected.", "Date": "September 20, 2013"}], "ProductInfo": {"Price": "$399.00", "Features": "Install included software and watch video remotely via an easy access weblink.\nRecord locally to an SD card.\nConnect via USB to your PC then watch and record.\nConnect via RCA to your TV, DVR or VCR then watch and record.Unlike other covert models you can:\nConnect 1-4 cameras to one receiver.", "Name": "Xtreme Life IR Bottom View Smoke Detector Spy Camera & DVR", "ImgURL": "http://ecx.images-amazon.com/images/I/41WEad5xVrL._SY300_.jpg", "ProductID": "B00BRN8GBY"}}