{"Reviews": [{"Title": "Superior quality and tough enough to hold up for years of use!", "Author": "jjceo", "ReviewID": "RBPGU15CREGN3", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_mo3PTMXGVTP6IBKembeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_mo3PTMXGVTP6IBKrefresh_preplay() {\n\ndocument.getElementById(\"cv_mo3PTMXGVTP6IBKchiDiv\").innerHTML = document.getElementById(\"cv_mo3PTMXGVTP6IBKhiddenPre\").innerHTML;\n};\ncv_mo3PTMXGVTP6IBKrefresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_mo3PTMXGVTP6IBKso;\t   \n\n\nfunction cv_mo3PTMXGVTP6IBKloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_mo3PTMXGVTP6IBKso = new SWFObject(swfLocation, \"cv_mo3PTMXGVTP6IBKAMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_mo3PTMXGVTP6IBKso.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_mo3PTMXGVTP6IBKso.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_mo3PTMXGVTP6IBKso.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_mo3PTMXGVTP6IBKso.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_mo3PTMXGVTP6IBKso.setAttribute(\"height\", swfHeight);\n          cv_mo3PTMXGVTP6IBKso.setAttribute(\"width\", swfWidth);\n          cv_mo3PTMXGVTP6IBKso.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_mo3PTMXGVTP6IBKso.write(\"cv_mo3PTMXGVTP6IBKflashcontent\")) {\n          fp_resizePlayerSpace('cv_mo3PTMXGVTP6IBK', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_mo3PTMXGVTP6IBK';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_mo3PTMXGVTP6IBK', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_mo3PTMXGVTP6IBKloadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_mo3PTMXGVTP6IBK\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m39NJY4FEYGJ7N\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m39NJY4FEYGJ7N\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"RBPGU15CREGN3\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m39NJY4FEYGJ7N/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_mo3PTMXGVTP6IBKduration')) {\n      document.getElementById('cv_mo3PTMXGVTP6IBKduration').style.display='none';\n    }\n    cv_mo3PTMXGVTP6IBKloadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_mo3PTMXGVTP6IBKloadSwf(movieID, playerVersion) {\n   return _cv_mo3PTMXGVTP6IBKloadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_mo3PTMXGVTP6IBKnewHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_mo3PTMXGVTP6IBK', 0, h);\n}\n\nfunction cv_mo3PTMXGVTP6IBKresetPlayer(w,h,bw,cc) {\n  cv_mo3PTMXGVTP6IBKnewHeight(h);\n\n  cv_mo3PTMXGVTP6IBKso.addVariable(\"resetBandwidth\", bw);\n  cv_mo3PTMXGVTP6IBKso.addVariable(\"cacheCode\", cc);\n  cv_mo3PTMXGVTP6IBKso.setAttribute(\"height\", h);\n  cv_mo3PTMXGVTP6IBKso.setAttribute(\"width\", w);\n  cv_mo3PTMXGVTP6IBKso.write(\"cv_mo3PTMXGVTP6IBKflashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_mo3PTMXGVTP6IBKRollOverImg = new Image();\ncv_mo3PTMXGVTP6IBKRollOverImg.src = \"http://ecx.images-amazon.com/images/I/81hciasSBAS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_mo3PTMXGVTP6IBKpreplay = document.getElementById('cv_mo3PTMXGVTP6IBKpreplayImageId');\nif (cv_mo3PTMXGVTP6IBKpreplay) {\n  cv_mo3PTMXGVTP6IBKpreplay.onmouseover = function() {\n    cv_mo3PTMXGVTP6IBKpreplay.src = \"http://ecx.images-amazon.com/images/I/81hciasSBAS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_mo3PTMXGVTP6IBKpreplay.onmouseout = function() {\n    cv_mo3PTMXGVTP6IBKpreplay.src = \"http://ecx.images-amazon.com/images/I/81hciasSBAS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_mo3PTMXGVTP6IBKpreplay.parentNode;\n\n  var cv_mo3PTMXGVTP6IBKcurrentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_mo3PTMXGVTP6IBKcurrentClick) {\n      return cv_mo3PTMXGVTP6IBKcurrentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 2:38 MinsThis license plate camera is made to last. It is made of cast zinc and painted with a nice thick coating of black paint. I was shocked at how heavy and rugged this license plate bracket is. This is what you need on your car or truck so it will hold up in bad weather. The camera features 8 IR LEDs to help light your way even in the darkest night so you can see in the daytime or nighttime. Don't forget you also have your backup lights and taillights to help push away the darkness.The camera is a color camera and it has a 170 degree side to side viewing angle which is very good and it also has a 120 degree vertical viewing angle. Two set screws hold the camera in place and if you loosen them you can adjust the camera height to get the best viewing angle for the height of your vehicle. There is a supplied Allen wrench to loosen and tighten these screws. The video image has an electronic grid image on the video you see. It is made up of lines that are drawn in a trapezoid shape that indicates the distance to objects behind your car. Each grid line represents about 3 feet.The license plate camera is rated to IP67 which means it is submersible to 1 meter (3 feet of water) for about one hour without damaging the unit. The unit comes with a wiring harness that allows you to connect it to the rear back up light power wiring so the camera is only on when you are backing up. It also has an RCA type video jack cable (20 feet long) and after you wire the harness to your monitor wiring then wrap the jack with electrical tape to securely hold it plugged in and to keep the connection dry.The unit comes with a brief instruction manual and it shows the basic wiring to wire this up. It is nice that the cables that plug into the license plate holder already have connectors installed and they are color coded. (Please see my video) I rate this item as a 5 star product. There are less expensive backup cameras out there but they do not compare to the quality of this one!I was supplied a sample for test and evaluation and I promised to provide a fair and honest review.", "Date": "October 3, 2013"}, {"Title": "TaoTronics TT-CC17 Camera", "Author": "Robb", "ReviewID": "R3998I30Q8VZ89", "Overall": "5.0", "Content": "So I have to say that I'm surprised with the quality of this item. I could have gotten a cheaper costing cam for my rear plate but wanted a solid metal plate ring. It blends in well with the truck and works great so far. I would recommend this and already have. Waterproof, night vision, solid, looks good and reasonable price. I paired it with a 4.3\" monitor and a 25' high quality video cable and created a very solid and stable backup camera system for less then $75. I do have to say that I soldered the reverse light connection and ground connection and took my time following the factory harness up to the front of the truck. I also drilled thru the plate with a 3/4\" bit and put a rubber grommet on the plate to protect the wires. I then drilled thru the plastic under the plate with a 3/4\" bit. This lets the video and power connection go straight out the back of the camera. No wires are visible when you look at the camera and plate ring. I installed this on a 2012 Ford F150 XLT Screw. I have been using it for about a week now in FL and it has been rained on like I can't even tell you. No ill effects yet...........Time will tell. Good luck and I hope this helps.Robb", "Date": "October 17, 2012"}, {"Title": "Decent picture but could be better overall", "Author": "Cohiba", "ReviewID": "R3LKTNPRM69JFA", "Overall": "3.0", "Content": "The picture this license plate camera provides is decent, not great. It didn't include any hex head bolts; the license plate frame has hex head provisions in it so as to make it more secure.  Also, the wires from your splice point to the camera were so tiny as to be difficult to work with.  The connection they provide from the license plate to the monitor was good quality and decent length.  I've used the Boyo License plate camera in the past and it included all good quality components, had better picture quality, included black hex head bolts but it was three times the price.  So, for the money this isn't that bad.", "Date": "May 8, 2013"}, {"Title": "Integration of TaoTronics TT-CC17 with Magellan 1700LM GPS", "Author": "Shadow", "ReviewID": "R3CI32S7NDW2HK", "Overall": "5.0", "Content": "To start off with this review is actually of two products, the Magellan 1700LM with back up camera and TaoTronics TT-CL17 back-up Camera.I have a 2010 F150 and because of it's size I decided to get a back up camera.  As I was in need of a new GPS I looked around for combination units.  These are pretty much limited to Garmin, Magellan and 4UCAM (Generic Model).  The Garmin is significantly more expensive than the Magellan but does have some additional features such as Bluetooth (Which I had no need for)Pros on the 1700Very nice big screen with good resolutionGood mounting system with integration of the wireless receiver for the back up cameraSimple menus, thought limited features, for GPS functionSimple to use PC software for system and map updatesAll cables etc. are includedVery good wireless transmitter and receiver.Switches automatically to camera mode when you put vehicle in reverse.Lifetime Map updatesCons with 1700The downloaded manual does not reflect the latest version of the software, some screens are differentThe back up camera is not very good, no grid lines and it is not infrared so it is useless at night.This brings me to the TaoTronics ($49.99) camera.  After doing some additional research I decided to try a different camera to see if I could improve the night visibility.  Even thought the TaoTronincs is designed for a hard wired use it works flawlessly with the Magellan wireless transmitter and receiver.  The only \"custom\" things you need to do is hard wire the 12 Volt directly to the camera and obtain a female/female RCA connecter for the video feed. You may want to purchase a shorter video cable as the supplied one is very long.Pros on TaoTronicsGood gridlinesVery good resolutionHas built in infrared LED bulbs for night vision.Looks pretty good for a license plate cameraAppears to be of excellent quality.Cons on TaoTronicsNone I can think ofInstallation on the F150 was very easy and involved no more than removing the taillight assembly (outlined in the Ford owners manual), running the camera wires from the camera to the video transmitter, wiring  the 12 volt to you back up lights, securing the wiring beneath the vehicle with some tie wraps, and reassembling.  It took me 30 minutes including adjusting the camera.  I also built a mount for the GPS screen out of PVC pipe fittings which mounts in the center console cup holder.  The total cost for this was ~ $10  at Home Depot.A couple of suggestionsWhile you have the tail light out install an LED back up bulb (921) they are way brighter than the stock bulb.  Instead of taping over the cable connections use heat shrink as it is more durable and water resistant.In summary the 1700 with the TaTronics camera is a pretty nice solution for a reasonable priced GPS/Back up camera combo.", "Date": "November 22, 2013"}, {"Title": "TaoTronics® TT-CC17 Waterproof", "Author": "adi", "ReviewID": "R22JUK4P1406Y6", "Overall": "5.0", "Content": "Camera is OK, definitely not a great image. I could barely recognize my own driveway. I guess you can't expect more for the money. Manufacturer had contacted me after I posted my review in November and promised to replace their product, once updated. Update is expected to happen in December. My review will follow.Review update 1: It is almost end of January and image quality worsened after the three month of use, I am still waiting to be contacted by manufacturer.Review update 2: I received the camera replacement, it is not updated version but manufacturer is trying to resolve the issue. Image quality improved substantially.Good customer service!", "Date": "November 4, 2013"}, {"Title": "very pleased, much better than expected", "Author": "A Holmes", "ReviewID": "R2JC8ZDB8GX8O8", "Overall": "4.0", "Content": "Has held up very well so far.  Seems very sturdy, the frame is actually made from steel! Only 2 complaints.  All green colors are pink, not a big deal.  Also, like everyone else has mentioned, the ground and power wires are ridiculously small, and difficult to splice.  I think mine yanked free 4 times before i got it good.  Its been installed 3 months for far, i've used its almost daily on my F150, bouncing up and down back roads, the camera has held up fine.  Unparalleled customer service.  I was called 2 months after my purchase, following up to see if i was happy with the product.  The lady was pleasant, and even reminded me of the one year warranty, in case I wanted to return it based on the green-pink thing.  I wired mine hot when the key is on, wasn't easy running a wire all the way up into the cab through the current wiring harness, but i managed.", "Date": "October 16, 2013"}, {"Title": "It works.", "Author": "Paul Tsotsos", "ReviewID": "R222INBD9P1A2Y", "Overall": "4.0", "Content": "I used with the TaoTronics 4\" monitor I  mounted in a Honda 20002 CRV. My only complaint is that the power and ground wires are too small a gauge and difficult to make a secure connection with the power and ground in the car. I put a pin male connector on the ends and matted with a female connected (soldered) to a 18 gauge wire that runs to the backup lights. Because the licence plate is offset the guidelines do not give an accurate idea of where the sides of the car are.  I contacted their support and got a quick response that the grid lines are set in cmos so can not be changed. My solution to the problem as to  print  side guide lines on a overhead projector media and tapped to the monitor to give an idea where the sides of the car are.The night vision works ok at night. I have only had for a few weeks but it works fine so far.", "Date": "July 5, 2013"}, {"Title": "I Luv This Camera !!", "Author": "Tech Guy \"mossbackman2\"", "ReviewID": "R2RN9F1P24QU5K", "Overall": "5.0", "Content": "It mounts easily in place of my old license plate frame and friends are amazed when I point out thats its a camera. It's been thru a couple of heavy downpours and still works fine.The supplied wiring was more than long enough to make it to the front of my Chevy Colorado Crew Cab.The image is stable even when I'm driving( I wired mine to stay on all of the time unless I turn it off with the monitor switch)It delivers a nice color image to the monitor in daylight and a black and white image in dim light. It was more work to istall a hard wired camera than a wireless one but I think the image is better with a hard wired camera. Since I have a shell and carpet on my truck bed I simply ran the wire along the truck bed and up to thru the sliding window. I then put duct tape on top for the entire length to protect it. I then ran it behind and under the rear seat to about 5 inches before you could see it from above, cut a hole in the carpet and used a fish tape to run it under the carpet to the front. No drilling required and a nice looking install.", "Date": "November 20, 2012"}, {"Title": "works good", "Author": "Rick", "ReviewID": "RRED5HG4J72XN", "Overall": "5.0", "Content": "I installed it on my truck with a Magellan 9955 Lm wireless due to the old one craped out on me after a year (from Magellan) took the chance and it worked fine the IR lights for night no difference looks nice it is metal nice and heavy", "Date": "February 8, 2013"}, {"Title": "Solid Build", "Author": "Michael Peterson", "ReviewID": "R9U0CIXRY5K09", "Overall": "5.0", "Content": "1) this has a very solid build quality! and 2) yes, it works well at night! It is a pretty heavy frame, the picture quality is pretty nice if you're not expecting Blue Ray images. The integrated green to red lines in the picture help when estimating distance, and after a while will have you parking an inch away from the garage door without a problem. The picture at night is great and it's almost a bright as day. I adjusted my camera so I can see the top of my bumper at the bottom of the picture.The viewing area is very large and you can see everything behind you for a long way!  It's about the best balance of quality and price that I saw when researching add-on cameras. I have it coming through my Pioneer touch screen and It is powered by my reverse lights, so it only turns on when I through it in reverse.  Alternatively, you can wire it to a switch in order to turn it on while driving if you want to monitor your trailer, etc. Very happy!", "Date": "February 21, 2014"}, {"Title": "Stealth back up camera produces fine image", "Author": "R. P. Sanford", "ReviewID": "R3D4KYNICOXVY6", "Overall": "5.0", "Content": "The camera is really nice and produces a very good image to more than 50 feet behind the car. Unobtrusive and doesn't require drilling any holes. I did put some extra silicon around the edges of the unit just to make sure it stayed waterproof.", "Date": "October 11, 2013"}, {"Title": "Buy this!", "Author": "Her$H", "ReviewID": "R1WYBR58VBFF84", "Overall": "5.0", "Content": "This is a awesome back up camera I thought the license plate might look cheesy but it fit my 2004 Toyota 4runner perfectly, the quality of the video is great I am very very pleased!!!!!!!!!!!!!!! for this price you will not find a better camera!", "Date": "April 1, 2013"}, {"Title": "Best camera for the money", "Author": "Jonathan Hernandez \"Jonathan\"", "ReviewID": "R2ARB5ZYUEGB3W", "Overall": "5.0", "Content": "When I ordered this camera/plate combo I thought it would be plastic  I was happy when I found out that it was in fact metal the quality of the camera is very clear in day/night in the night camera resorts to black and white while in the daytime it is in color  the lens is adjustable if you need to adjust it. I have amazon prime ordered this item on a sat morning and was suprised to see my package a day early on mon will order again from seller", "Date": "February 19, 2013"}, {"Title": "Nice", "Author": "Moe betta DMV", "ReviewID": "R24GT8XMQR2N42", "Overall": "5.0", "Content": "Simple installation, It works day and nite, solid construction, sturdy, well worth the money, priceless for those with large trucks or vehicles where parallel or back in parking may be difficult...", "Date": "January 7, 2013"}, {"Title": "good product.", "Author": "josh", "ReviewID": "RT901307RRWDA", "Overall": "4.0", "Content": "Worked as advertised. I am happy with it so far. Only reason I didn't give it 5 stars is because video cable wasn't long enough for my truck.", "Date": "February 21, 2013"}, {"Title": "Very good camera vision", "Author": "JUAN", "ReviewID": "R6GKGENT5NEYO", "Overall": "4.0", "Content": "very nice vision and the display is very good. the plate is strong. I like the rear view camera. I recomend it", "Date": "December 26, 2012"}, {"Title": "Great Camera! I can see everything", "Author": "djluski", "ReviewID": "R1HW5FCVFVKN4P", "Overall": "5.0", "Content": "I bought this for my monster truck. This camera provides an excellent view, about 170 degrees. The best part is the lines it projects so you can tell your proximity with whats behind you.", "Date": "April 17, 2013"}, {"Title": "Very cool quality product !", "Author": "Jeremy O'Brien", "ReviewID": "R1YH48C1UDPQXV", "Overall": "5.0", "Content": "<!--\n\nfunction fp_resizePlayerSpace(nsPrefix,w,h)\n{\t\n  try {\t\n    var ifrm = parent.document.getElementById(nsPrefix + \"movieFrameID\");\n    if (ifrm) {\t\n        var h2 = h + 35;\n        ifrm.style.height = h2;\n      }\n    } catch(err) {\n \n    } \n\n\n  if (h > 0) {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=h+\"px\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=h+\"px\";\n  }\n  else {\n      document.getElementById(nsPrefix + \"clipDiv\").style.height=\"\";\n      document.getElementById(nsPrefix + \"videoPlaceholder\").style.height=\"\";\n  }\n  document.getElementById(nsPrefix + \"flashcontent\").style.height=\"100%\";\n}\n\nfunction fp_rewriteDiv(nsPrefix,divName,html)\n{\t\n    document.getElementById(nsPrefix + divName).innerHTML=html;\n}\n\nfunction embeddingPopup(nsPrefix)\n{\n  alert(\"placeholder function for embedding code\");\n}\n-->\n\n\n<!--\n\nfunction cv_moO7BZ2RW5BVI3embeddingPopup(){\t\nalert(\"Embedding code will be displayed here.\");\n}\n\n-->\n\n\n\n\n\n\n\n\n\n<!--\nfunction cv_moO7BZ2RW5BVI3refresh_preplay() {\n\ndocument.getElementById(\"cv_moO7BZ2RW5BVI3chiDiv\").innerHTML = document.getElementById(\"cv_moO7BZ2RW5BVI3hiddenPre\").innerHTML;\n};\ncv_moO7BZ2RW5BVI3refresh_preplay();\n\n-->\n\n\n\n\n\n\n        // <![CDATA[\n\nvar cv_moO7BZ2RW5BVI3so;\t   \n\n\nfunction cv_moO7BZ2RW5BVI3loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes) {\n\n  try {\n      cv_moO7BZ2RW5BVI3so = new SWFObject(swfLocation, \"cv_moO7BZ2RW5BVI3AMPlayerProd\", swfWidth, swfHeight, flashVersion, bgColor);\t   \n\n      for (var v in swfParams) {\n        cv_moO7BZ2RW5BVI3so.addVariable(v, encodeURIComponent(swfParams[v]));\n      }\n      for (var v in flashParams) {\n        cv_moO7BZ2RW5BVI3so.addParam(v, flashParams[v]);\n      }\n      for (var v in embedAttributes) {\n        cv_moO7BZ2RW5BVI3so.setAttribute(v, embedAttributes[v]);\n      }\n\n      cv_moO7BZ2RW5BVI3so.addVariable(\"swfEmbedTime\", new Date().getTime());\n\n      var agt = navigator.userAgent;\n       \n      var reFirefox = new RegExp(\"firefox/\", \"i\");\n      var regx = agt.split(reFirefox);\n      var ffVersion = 8;\n      if (regx[1]) {\n          var pts = regx[1].split(/[.]/);\n          ffVersion = parseFloat(pts[0] + \".\" + pts[1]);\n      }\n      var minorVersion = parseFloat(navigator.ap);\n      if ((navigator.appVersion.indexOf(\"Mac\")!=-1) || (ffVersion < 1.5)) {\n          cv_moO7BZ2RW5BVI3so.setAttribute(\"height\", swfHeight);\n          cv_moO7BZ2RW5BVI3so.setAttribute(\"width\", swfWidth);\n          cv_moO7BZ2RW5BVI3so.addVariable(\"oldFirefox\", \"1\");\t     \n      }\n\n      if (cv_moO7BZ2RW5BVI3so.write(\"cv_moO7BZ2RW5BVI3flashcontent\")) {\n          fp_resizePlayerSpace('cv_moO7BZ2RW5BVI3', \n                               320, \n                               283);\n      }\n      else {\n          var nsPrefix = 'cv_moO7BZ2RW5BVI3';\n\n          fp_resizePlayerSpace(nsPrefix, 0, 0);\n          fp_rewriteDiv(nsPrefix, \"flashcontent\", '<br/>To view this video download <a target=\"_blank\" href=\"http://www.macromedia.com/go/getflashplayer\" target=\"_top\">Flash Player</a> (version 9.0.115 or higher)');\n      }\n  } catch(err) {\n      fp_resizePlayerSpace('cv_moO7BZ2RW5BVI3', 0, 0);\n  }\n  return false;\n}\n\n\n\nfunction _cv_moO7BZ2RW5BVI3loadSwf(movieID, playerVersion) {\n    var swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n    var swfWidth = \"320\";\n    var swfHeight = \"100%\";\n    var flashVersion = \"9.0.115\";\n    var bgColor = \"#FFFFFF\";\n\n    var swfParams = {};\n    var flashParams = {};\n    var embedAttributes = {};\n    swfParams.amazonPort = \"80\";\n    swfParams.allowFullScreen = \"true\";\n    swfParams.telemetrySubPageType = \"VideoReview\";\n    swfParams.nsPrefix = \"cv_moO7BZ2RW5BVI3\";\n    swfParams.locale = \"en_US\";\n    swfParams.logUrl = \"gp/mpd/l\";\n    swfParams.canResize = \"1\";\n    swfParams.autoPlay = \"1\";\n    swfParams.sessionId = \"000-0000000-0000000\";\n    swfParams.marketplaceID = \"ATVPDKIKX0DER\";\n    swfParams.salign = \"LT\";\n    swfParams.preset = \"detail\";\n    swfParams.mediaObjectId = \"m35FHV1706QLVJ\";\n    swfParams.autoPlayTimer = \"\";\n    swfParams.mediaObjectIDList = \"m35FHV1706QLVJ\";\n    swfParams.playIsUserGenerated = \"1\";\n    swfParams.enableShare = \"0\";\n    swfParams.permUrl = \"gp/mpd/permalink\";\n    swfParams.telemetryPageTypeID = \"R1YH48C1UDPQXV\";\n    swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/m35FHV1706QLVJ/000-0000000-0000000\";\n    swfParams.amazonServer = \"www.amazon.com\";\n    swfParams.scale = \"noscale\";\n    flashParams.allowFullScreen = \"true\";\n    flashParams.salign = \"LT\";\n    flashParams.bgcolor = \"#FFFFFF\";\n    flashParams.allowScriptAccess = \"always\";\n    flashParams.quality = \"high\";\n    flashParams.wmode = \"transparent\";\n    embedAttributes.title = \"Flash Player\";\n\n    if (movieID){\n      if (playerVersion == '3'){\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/20120510035744301/AMPlayer._V148501545_.swf\";\n        swfParams.mediaObjectIDList = movieID;\n      } else {\n        swfLocation = \"http://g-ecx.images-amazon.com/images/G/01/am3/legacy/20101014901/AMPlayerProd._V197491872_.swf\";\n      }\n      swfParams.xmlUrl = \"http://www.amazon.com/gp/mpd/getplaylist-v2/\" + movieID + \"/000-0000000-0000000\";\n      flashParams.wmode = \"transparent\";\n      swfParams.autoPlay = \"1\";\n    }\n\n    if (document.getElementById('cv_moO7BZ2RW5BVI3duration')) {\n      document.getElementById('cv_moO7BZ2RW5BVI3duration').style.display='none';\n    }\n    cv_moO7BZ2RW5BVI3loadSwf_Core(swfLocation, swfWidth, swfHeight, flashVersion, bgColor, swfParams, flashParams, embedAttributes);\n\n  return false;\n}\n\nfunction cv_moO7BZ2RW5BVI3loadSwf(movieID, playerVersion) {\n   return _cv_moO7BZ2RW5BVI3loadSwf(movieID, playerVersion);\n}\n\n\n\t\n\t\t// ]]>\n\t\n\n<!--\n\nfunction cv_moO7BZ2RW5BVI3newHeight(h)\n{\t\n    fp_resizePlayerSpace('cv_moO7BZ2RW5BVI3', 0, h);\n}\n\nfunction cv_moO7BZ2RW5BVI3resetPlayer(w,h,bw,cc) {\n  cv_moO7BZ2RW5BVI3newHeight(h);\n\n  cv_moO7BZ2RW5BVI3so.addVariable(\"resetBandwidth\", bw);\n  cv_moO7BZ2RW5BVI3so.addVariable(\"cacheCode\", cc);\n  cv_moO7BZ2RW5BVI3so.setAttribute(\"height\", h);\n  cv_moO7BZ2RW5BVI3so.setAttribute(\"width\", w);\n  cv_moO7BZ2RW5BVI3so.write(\"cv_moO7BZ2RW5BVI3flashcontent\");\n}\n\n-->\n\n\n\n\n\n\n\n\nvar cv_moO7BZ2RW5BVI3RollOverImg = new Image();\ncv_moO7BZ2RW5BVI3RollOverImg.src = \"http://ecx.images-amazon.com/images/I/81pdWMT%2BihS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n\nvar cv_moO7BZ2RW5BVI3preplay = document.getElementById('cv_moO7BZ2RW5BVI3preplayImageId');\nif (cv_moO7BZ2RW5BVI3preplay) {\n  cv_moO7BZ2RW5BVI3preplay.onmouseover = function() {\n    cv_moO7BZ2RW5BVI3preplay.src = \"http://ecx.images-amazon.com/images/I/81pdWMT%2BihS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play-active,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  cv_moO7BZ2RW5BVI3preplay.onmouseout = function() {\n    cv_moO7BZ2RW5BVI3preplay.src = \"http://ecx.images-amazon.com/images/I/81pdWMT%2BihS._SX320_PHcustomer-video-vignette_PIvideo-reviews-bottom,BottomLeft,0,43_OU01_PIcustomer-video-play,BottomLeft,130,-12_CR0,0,0,0_.png\";\n  }\n  \n  \n  var node = cv_moO7BZ2RW5BVI3preplay.parentNode;\n\n  var cv_moO7BZ2RW5BVI3currentClick = node.onclick;\n  node.onclick = function () {\n    var head = document.getElementsByTagName(\"head\");\n    if (head[0]) { \n      var logTag = document.createElement('script');\n      logTag.type = \"text/javascript\";\n      logTag.src = \"/gp/customer-media/du/log.html?ie=UTF8&p=CustomerImage&s=CustomerVideoPlay\";\n      head[0].appendChild(logTag);\n    }\n\n    if (cv_moO7BZ2RW5BVI3currentClick) {\n      return cv_moO7BZ2RW5BVI3currentClick();\n    }\n  }\n}\n\n\n\n\n Length:: 0:42 MinsThis is a really great product I went back and forth looking at all the overwhelming options for back up camera's on amazon and I finally decided this item was the best choice for my need's I wanted night vision / quality pictire, built in plate frame, distance lines, classy looking chrome and I have to say this met all my needs ! It really does give a great picture at night that was the big test for me and it passed with flying colors! I would suggest this to anyone looking for a great price and study unit!J", "Date": "April 29, 2014"}, {"Title": "Love it!!", "Author": "Stucktruckin", "ReviewID": "R3K6WTFUIEYQOD", "Overall": "5.0", "Content": "I paired this with a mirror-mounted monitor but was unable to see it in bright daylight. I replaced the monitor with a 5\" dash mounted monitor and the picture is absolutely perfect. There is NO delay in activation when shifting into reverse and the warning lines really help. With the camera angled at its lowest setting I can see things only a foot or two behind my car and yet still see the horizon as well.", "Date": "February 22, 2014"}, {"Title": "solid, quality camera", "Author": "Amazon Customer", "ReviewID": "R2IBM5XQJ1ZGOD", "Overall": "5.0", "Content": "This a nice heavy metal frame that mounted easily on my license plate and still allowed month/ year registration stickers to be seen. I have it hooked up with a wireless setup as it is on a pickup truck, but it has done well in recent snow, icing, road salts, heavy rain and mud. I would definitely buy again.", "Date": "February 10, 2014"}, {"Title": "Awesome Product", "Author": "MKov", "ReviewID": "R3SBW9I5NNCUKW", "Overall": "5.0", "Content": "I ordered this based on the numerous positive reviews.  I haven't installed it yet, but it is solid metal construction.  I can't wait to hook it up to my Garmin.  The screw holes are designed for a recessed hex head.  You will need 6M bolts and access to the rear to use recessed bolts & nuts on the backside.  If you don't have access to the back side of the bolts, you will need smaller screws that will rotate within the recess.  Home Depot or Lowes will have the hardware you need.I read one review that said the supplied video cable was too short.  My kit came with 20', so that should be long enough for my '05 Dodge 2500 longbed truck.", "Date": "October 12, 2013"}, {"Title": "Great for the price!", "Author": "Justin", "ReviewID": "RODNWULKVPO0H", "Overall": "5.0", "Content": "This camera works great, especially for the price. The picture is mostly clear and it seems to hold up very well. The night vision works pretty well too. Much better quality than the cheaper versions out there. I've been in a few bad storms, including snow and hail, and it still works just fine. The only thing that could make it better would be a little clearer picture but, overall the picture is much better than the cheap ones i have purchased within the last year. Other than that it's perfect. Definitely recommend to buy this item.", "Date": "March 25, 2013"}, {"Title": "It works", "Author": "Ryan", "ReviewID": "R2S2IYJGJC9F5H", "Overall": "4.0", "Content": "Nice sturdy product, clear picture, would have been nice if the video cord was a little longer to accommodate full-size trucks.", "Date": "March 11, 2013"}, {"Title": "Best for un $50", "Author": "Jamrs", "ReviewID": "R100JWENVFAAD7", "Overall": "5.0", "Content": "I purchase a number of cameras for fleet vehicle and I gave this a try. I worked perfect. I love the heavy duty construction. I will be ordering more in the future.", "Date": "April 9, 2013"}, {"Title": "Cheap, IR Backup Camera", "Author": "Russell Lekberg \"R. Lekberg\"", "ReviewID": "R373WQT23Q0PFS", "Overall": "5.0", "Content": "I read the reviews on many different backup cameras, from dirt cheap to high-end.  What I wanted was a camera that worked well in day and night and would allow me to position the camera centered on my hitch so I could hook up my trailers on my own with ease.  Job done.  Installed this in late fall and I haven't had a problem in cold, wet, snowy weather yet.  Wipe the snow off the bumper and go.  The IR works great and gives good distance and a nice wide view as well.  For this price, even if this thing goes out in a couple of years, I'll probably buy the same one again.", "Date": "March 10, 2013"}, {"Title": "good picture!", "Author": "Joseph Zanni \"Joe\"", "ReviewID": "R1HI2Y7OP6471M", "Overall": "5.0", "Content": "I bought this for one of my plowing trucks since there are so many variables when plowing the blind spots are horrible to my surprise it was of great quality so if your looking for that fix for a backup camera this one will work! dont forget no monitor comes with it so either buy one separate or if you have a large display on your radio it will work.", "Date": "March 4, 2013"}, {"Title": "Awesome, awesome, awesome!", "Author": "Billy Nubz", "ReviewID": "R1Z2ER2SZX4FEZ", "Overall": "5.0", "Content": "I installed this on my 2014 Scion FR-S Monogram Edition, using the BCSU3 wiring harness from Beat-Sonic and the picture is so clear and the grid-lines are really useful.", "Date": "May 20, 2014"}, {"Title": "Great price and good product..", "Author": "VellsMaster", "ReviewID": "RIOCTFJWVUK7S", "Overall": "4.0", "Content": "Bought it for my F150 with a camper shell since it had a huge blind spot for backing up.  Bought this along with the Tao Tronics CM04 7 inch LCD screen.Got it installed in Best Buy for $100 (well worth the money).You can either set it up to be on all the time or turn on only when you switch the gear to Reverse (While not in reverse, the display powers off, which is a nice feature).  It has two video inputs, apparently 2nd input could be connected to a DVD player or a second video camera.I have a Tesla Model S and a Nissan Leaf.  The camera in Tesla is of course top notch, with great day time picture quality.  Leaf is a bit mediocre.  But the night vision in Tao tronics camera is great compared to both my other cars.  But daylight camera quality is so so.. not sure if it is the display or the camera, but the colors seem to be off a bit.  But for purposes of backing up, it is quite functional and adequate.I'm happy with the purchase overall and will recommend this!", "Date": "May 14, 2014"}, {"Title": "Good Product", "Author": "usmc9196", "ReviewID": "RJ0SINTD1HC8", "Overall": "4.0", "Content": "Shipping: Received quickly and well packed.Installation: The instructions were kind of poor, so I got the information I needed online. The included cables were long enough for my car (2007 Dodge Charger). Since the camera housing blocked out my license plate light, I unscrewed the camera housing, turned the frame (not the camera) upside down and then re-attached the camera to the license plate frame and then put it on the car. So the camera is at the bottom of the license plate and my license plate is still illuminated at night.Quality: In the past week since it was installed, it has rained hard, hail storm and snow. My car was outside for all of it and I haven't had any problems with water or condensation in the camera yet.Picture: It is a decent picture that allows you to see behind you. It is not an HD TV and I did not expect it to be. The colors are normal except that black on clothing looks purple.All in all, it went in easy and does as advertised. I was not counting on flipping the frame upside down but it still functions like it is supposed to and looks \"normal.\"I would buy this again if one were needed.", "Date": "May 12, 2014"}, {"Title": "Fire Truck Approved", "Author": "John M.", "ReviewID": "R3033X9PIUW73B", "Overall": "5.0", "Content": "I installed these cameras on three of our brush truck units, and they work impeccably. The tough construction holds up to the demand of our rough country wild fires, and the picture quality is excellent! I like the fact that you can angle the len so that you get the best angle. Works great at night too, plenty bright for viewing behind you. Safety is our number one priority, and we use these cameras in our trucks because they work!", "Date": "April 29, 2014"}, {"Title": "Great backup camera for the money!", "Author": "rotwiler", "ReviewID": "R1IKYD2F294X1N", "Overall": "5.0", "Content": "Overall for the price this is a nice backup camera, I installed this camera in my 2010 camaro ss and works great. I  have a kenwood ddx896 and works perfect. In daylight the camera is color and at night black and white like all night cameras are, the night infrared less work great and can see as far as anyone would need to on a camera. I put 5 stars but If I had the option 4.5 would be my rating due to the backup lines on the screen are not as wide as I would like and video is a little distorted in shape, but this is a excellent camera for the money and the frame is well built. You may need a little extra wire to reach, I used a rca connector to add on some length, but smaller vehicles would be fine(I was 3 foot short).", "Date": "April 8, 2014"}, {"Title": "Great camera", "Author": "MICHAEL L", "ReviewID": "R256SHF8YG4IUU", "Overall": "5.0", "Content": "I installed mine on a 2006 Toyota Tacoma, using a Pioneer 3600 head unit (screen).  Instead of using the head units reverse camera option, I soldered a cigerette lighter plug on the cab end and will be plugging and unplugging via my cigertte power/aux power in the cab and of course the video cable to the back of the head unit.  After installing everything yesterday this option works flawless, I wanted to use the camera when I wanted not just when in reverse and I didn't want to tap into the factory wiring.  The clearity of the camera is better then what I was expecting, even in the DARK!  I am extreamly happy with the way this project came out, the quality of the frame and camera is second to none.  If your looking at a back up camera system and you already have a screen, this is the one to buy.", "Date": "April 3, 2014"}, {"Title": "Pretty nice.", "Author": "Leedogg", "ReviewID": "R2E2Q429CKGTI6", "Overall": "4.0", "Content": "Just installed this on my 07 Avalanche with a Pioneer AVH-X5600.  Works as advertised(Havent used at night yet).  Seems to be pretty well built.  For the money- I think it is hard to beat.", "Date": "March 29, 2014"}, {"Title": "Love It!", "Author": "Shawna Brown", "ReviewID": "R1SF5MBHI4RITQ", "Overall": "5.0", "Content": "It was a few days late getting to me, but I ordered it right before some bad weather hit. It is working great! My boyfriend has and F350, so he had to find some more cord to make it long enough to reach. It fit right over the licence plate, he bought some bolts and nuts so it is flush against the frame.", "Date": "March 26, 2014"}, {"Title": "Happy indeed!!!!", "Author": "arnice", "ReviewID": "R13CJTHM0KF9XR", "Overall": "5.0", "Content": "I highly recommend this product to anyone it is a great product the color display is great the camera is accurate it rain the second day after I had it installed and there is no water standing in the camera like some cameras have I'm happy with my purchase", "Date": "March 19, 2014"}, {"Title": "Heavy Duty Looks Good", "Author": "Warsign", "ReviewID": "R1ZHHDNLJZMRBP", "Overall": "4.0", "Content": "This is a very solid product.  It mounted perfectly and the video display is very clear day or night.  Well worth the price if you are in need of a backup camera.  Video cable was 3 Ft too short for my double cab tundra, so plan on an extension if you have extended cab truck.", "Date": "March 13, 2014"}, {"Title": "Automatically display when in reverse.", "Author": "Gary Snodgrass", "ReviewID": "R142UCOFZE3ZUM", "Overall": "4.0", "Content": "The camera  feels solid and looks very nice. I hooked the wire up to the reverse lamp on  the tailgate assembly on the driver side then the video cable to the cd player. The only problem I had was the rear camera did not automatically display on my monitor when in reverse like the instructions said it would. I had to buy an extra wire 16 gauge stranded wire to hook up on my cd player reverse line to my reverse lamp on my taillight assembly on the passenger side. The wire was not included or mention in the instructions or product details.", "Date": "March 13, 2014"}, {"Title": "This is the one you want", "Author": "gisboro", "ReviewID": "R30EBXEXM6QWLN", "Overall": "5.0", "Content": "This installed in about 30 minutes, with no problems at all. It has a crisp and clear picture, guide lines to help you judge the distance and the waterproofing really works, I have been through a few high pressure car washes and everything is still working as it should. Well worth the money.", "Date": "March 11, 2014"}, {"Title": "Great Camera for the Lifted Truck", "Author": "DEERHUNTER30", "ReviewID": "R2Y1JY10LY7Q6X", "Overall": "5.0", "Content": "I searched for several days looking for the best camera system for my F150. I read several reviews and studied each aspect of every camera system on the market.  Let me begin by saying I have had this camera system for three months and continue to be very satisfied.  I have a lifted 2012 F150 with 35\" tires and this camera performs perfectly.As far as the durability,  I have not one complaint.  It has had snow, ice, rain, mud, and other things (I'm a hunter) on it.  It has performed to perfection without one flaw.  The image is very clear and comes with distance bars installed within the image.I have bought 2 more cameras since my initial purchase and gave them as birthday gifts.The install took about an hour simply because it was my first time working with electronics like this.  My next one took 30-45 min.For a camera at a price listed ...I'm 100% satisfied I made the right decision.  So continue to read other reviews and study like I did....or stop wasting your time and take it from me....This camera system is awesome.", "Date": "February 15, 2014"}, {"Title": "Works pretty well", "Author": "N. Suarez-skeen", "ReviewID": "R3CUYCQIARN6NY", "Overall": "5.0", "Content": "This camera gets the job done.  There are times when it rains that it is hard to see, but im sure other cameras are the same way.  I would buy again if needed.", "Date": "February 11, 2014"}, {"Title": "Great product!!", "Author": "Ethan", "ReviewID": "RUIA1NR5UJWET", "Overall": "5.0", "Content": "I purchased this to install to my daughter's vehicle.  It works great....the camera is high quality and puts out a good picture....even at night.  I would highly recommend this item.", "Date": "February 8, 2014"}, {"Title": "good purchase", "Author": "Julie Gerace", "ReviewID": "R2TJZSVRA20LWR", "Overall": "5.0", "Content": "This is a solid unit with good clarity.  The housing is sturdy, adjustment of the camera is simple with a supplied allen wrench.  I installed this in a 2006 Mazda 5 with JVC head unit.  Night vision is good, daytime is very clear.  The camera does have a tendency to get dirty quickly, but that's expected in the Northeast during winter.  The picture does get a bit washed out when there is TOO much light behind you, but not a show stopper by any means.  I would highly recommend this product.", "Date": "February 4, 2014"}, {"Title": "Great camera for the price", "Author": "Nick", "ReviewID": "R1LO1GAIWXII1E", "Overall": "4.0", "Content": "You cannot beat the price for this backup camera.Installation was fairly easy and required running the video cable all the way back. Another wire was run back so that my deck would automatically switch to the camera when it was placed in reverse. (only con as this was not provided)I'm happy with the image quality that it produces, even at night.", "Date": "February 4, 2014"}, {"Title": "Love it!", "Author": "Mario Flores", "ReviewID": "R3STALM347RTW3", "Overall": "5.0", "Content": "I purchased this for my 2004 Ford F150 which has a 6\" lift because we have kids and so my wife can now safely back up with confidence. I saved about $140 purchasing this from Amazon and by doing the install myself. the running of the wires from the back of the truck took some time because you need to route two wires (AV & Remote) all the way to the stereo carefully as not to interfere with any moving/cinch parts or points that may cut or stress the wires, and then zip tie everything into place. You also need to wire it into the reverse lamp on the tail light. I used solder and heat shrink tubes to make sure it would not short out if it touched any metal and would by waterproof. After I ran the AV cord to the stereo and the other wire to the reverse tail light, I had to run a third wire to the reverse signal wire coming from the stereo to the reverse light in my other tail light to make the camera picture come on when putting it into reverse. I could have tried to find the wire in the cab to make the connection however since I already ran and hooked up the other wire (from the plate camera) to the tail light, and I had already routed and figured out how to make the connection it was easy to hook up the wire to the other reverse light. All in all the camera has a better picture than my wife's 2009 Chrysler Town and Country Limited minivan and works great.", "Date": "January 30, 2014"}, {"Title": "Great but for the money.", "Author": "rick crist", "ReviewID": "R2B0N3Q4F9XUYR", "Overall": "5.0", "Content": "This is a really good product, i would recommend it to anyone. Easy to install only took about a hour with finding power and ground and hooking it to the car deck. The camera itself has really good picture and is easy to adjust. Seems like its pretty rigid and made well. My wife drives a SUV and didn't think she needed it(hasn't seen herself backing up) and now she loves it.Great buy!!", "Date": "January 30, 2014"}, {"Title": "Nice Camera", "Author": "P. Gutierrez \"copcar340\"", "ReviewID": "R14A2QK5UNCE1C", "Overall": "5.0", "Content": "Hooked it up to Pioneer Head unit and it works great so far. Clean, Clear picture. RCA cord is kinda thin but long enough to reach the licence plate from my dash.", "Date": "January 29, 2014"}, {"Title": "It works, it's adjustable and it's sturdy.", "Author": "Ughmahedhurtz", "ReviewID": "R19L7LVD3NERHJ", "Overall": "3.0", "Content": "Aside from that, it is low resolution and has a FOV of about 100 degrees. Whoever said 170 was on crack or meth when they wrote the description. I'm not returning it as it does actually work at night and accomplishes what I wanted but 170 degrees? Really, y'all?", "Date": "January 16, 2014"}, {"Title": "Good product, but I need more parts for my car", "Author": "V. Rosu", "ReviewID": "RG5JTGU1U9PM2", "Overall": "4.0", "Content": "Sturdy construction, good picture, good angle, I like the grid lines.Cons:-The wire that goes from the camera to the inside of the trunk/trunk lid, has connectors that are too large; this requires drilling a 1/2\" hole; they should provide smaller jacks for the video and power wires.-for my car (Audi A4 2006) the power supplied by the reverse light *when the engine is running* is noisy and renders the picture distorted or completely black. If the engine is off, the picture is perfect. I read up on Audi and WV forums and apparently is because of the power to the reverse light. I'll need some power smoothing component or wiring it up to some other source.-The size if the camera is good, but again for my car I needed a bit more work as the button for trunk release is right above the license plate and the camera was in the way. I ended up ripping the plate support from where it was and installing it about an inch lower to clear the trunk release.", "Date": "November 10, 2013"}, {"Title": "PERFECT!!", "Author": "BionicRain \"Buddha\"", "ReviewID": "R22RPIAN20R3II", "Overall": "5.0", "Content": "This is seriously all that you need for you reverse camera. Thee exact same similar product would cost you at least $150 + $150 installation elsewhere.", "Date": "October 17, 2013"}, {"Title": "Perfect mounting solution, but picture not as good as an OEM camera", "Author": "Katy Katie", "ReviewID": "R2QN6VU69E2TF7", "Overall": "4.0", "Content": "I used this on a 2006 F150 and Kenwood DNX6190HD.  It looks good, and mounting is nice and neat and tidy.  The picture however, is not quite as clear as you would find on OEM cameras.  I would buy again though.", "Date": "October 14, 2013"}, {"Title": "sturdy", "Author": "David W Fitzgerald", "ReviewID": "R3A6CRSBTL8LCQ", "Overall": "5.0", "Content": "Much more substantial than expected all metal thick non bending frame.  All the wiring was included.  The bolts are not included", "Date": "October 6, 2013"}, {"Title": "Excellent bang for the buck", "Author": "J. Cupit \"Gadget Leet\"", "ReviewID": "R744AAPSCC02G", "Overall": "4.0", "Content": "I installed this camera along with the $20 3.5inch LCD monitor(also on Amazon) on my 2011 Ford F150.  Took about three hours and the results are fantastic.  I wired the power connectors into the reverse taillight and ran the video cable up to the engine compartment and then into the interior of truck.  I did have to put in a small video cable extension to join the monitor video IN cable but that was an easy pickup at local WalMart.  The camera wires where of a decent gauge and I had no issue stripping or soldering the wires to the truck wires.The video is clear enough and the grid lines help gauge distance (yellow is about 1ft. away on my truck).  Has helped immensely with parking my largish truck on a busy street where parallel parking is a normal daily routine.  The whole system for less than $90 where I easily see other systems for $300-$800.", "Date": "October 2, 2013"}, {"Title": "Extremely good value.", "Author": "H. Smith", "ReviewID": "RM47W3ZKYKSPR", "Overall": "5.0", "Content": "This camera was easy to install and the night vision is better than a $200 camera I had on another vehicle. The daytime vision lacks sharp color and appears a little over exposed, but for $49 this is a great deal.", "Date": "September 10, 2013"}, {"Title": "Great Picture with Infrared", "Author": "Robert M.", "ReviewID": "R14ESG1PJLN2B", "Overall": "5.0", "Content": "I chose this camera because of its waterproof capability and the infrared feature.  The infrared feature turns night into daylight.  The picture is clear.  The camera came with 17 ft of RCA cable which was long enough to reach all the way to the dash in my Ford F250 supercab.  Very pleased with the camera so far.", "Date": "August 22, 2013"}, {"Title": "Solid. Nice image! Good night operation!", "Author": "T. Neimi", "ReviewID": "R1Z8FET2SIALUV", "Overall": "5.0", "Content": "This is the first backup camera I've used.  I'm completely happy with the sturdiness of the frame of this model and the signal cable length was just right for an 01 Durango. I went ahead and wrapped all the exposed length with electrical tape to add protection from the elements and abrasion where I tie wrapped it to the frame.  Yes, it took a whole ten minutes to do.  I wrapped and protected the power and signal connections at the mount, too, and put a bead of silicone sealant around the wire coming from the camera as that seemed like it could be vulnerable over time.I'll update this if it fails to meet my expectations over the next year here in the Rocky Mountains.So far, highly recommended!", "Date": "August 15, 2013"}, {"Title": "Looks great and works well", "Author": "David C", "ReviewID": "R2VRNIGYEYLDI5", "Overall": "4.0", "Content": "I really like the quality and look of this product especially on my LX470 since it has chrome trim around the back anyways and this matches it perfectly.  Installation was very easy to do myself, but like others stated the wires you use to hook up to the rear backup light are way too thin.  I bought a titanium cone shaped drill bit from Pepboys to drill the hole for the wires and it worked great without chipping or messing up the surrounding paint.  Install didn't take long and the SVideo cable was long enough for my large SUV.  Hardest part was finding the right wire near the head unit to splice to trigger the head unit to know when the car was in reverse.  Finally found a posting that described the correct wire which was right behind the glove box.  Used my multimeter and found it on the second try.  Spliced it easily enough and it worked as advertised.  Other than the super tiny wires mentioned above I was a little disappointed with the angle of viewing as the Lexus LX470 has an inset area for the License plate and therefore makes you adjust the camera angle a little lower than I would have liked.  Regardless, I like that it lets you angle it to your desired setting with a small allen wrench included to loosen/tighten the angle.  Looks factory installed though once in place.  If you are looking at the $15 backup camera's like I was and you have a high end car that already has chrome trim around the rear of the car you def should cough up the $50 bucks.  I did see it cheaper on another site so could have saved a few bucks if I wanted too, but I like/trust Amazon so just got it here.  Def worth the extra $$$!", "Date": "August 10, 2013"}, {"Title": "Great for the Price", "Author": "greg", "ReviewID": "R1PZNE2HJR4AES", "Overall": "4.0", "Content": "PROs- Price is nice and cheap yet- it gives a color video feed- IR for night-time vision- guidance lines, to include distance markers so you can get nice and close to the vehicles in a parking lot- Wide field of view, Not 180 degrees but it is better than a 3x4 standard pic tube view of whats behind youCons- Cheap cheap wires, so thin and fragile you'll have to solder the wires to your power source or it will not work.  Trust me, Just solder the 5 itty bitty strains of wire to your reverse light wire or which ever you decide to tap into to get your power from. (crimp wire will not work)- video will flicker from time to time while reversing but overall, what can you expect from an IR camera under $40.00", "Date": "August 9, 2013"}, {"Title": "Best decision I've made", "Author": "Kendrick Lomax", "ReviewID": "RVBJWPUUUIQFG", "Overall": "5.0", "Content": "I must say, this reverse camera has not only changed and improved my way of parallel parking in Chicago but it is also very VERY clear even at night. I paired it up with that screen they show with it in the photos and it works marvelously! I mounted the screen to c-pillar on the back of my 93 escort hatch (highly recommended) so when I turn around to back up I can see both my surroundings and a detailed view of exactly where my back bumper will touch. Everything turns on as soon as I put the car in reverse and I have never seen it skip or jump. Very clear even at night. Haven't tried it in the brutal winter yet but the brutal summer has been just fine! I highly recommend this camera. Oh and incase anyone is wondering (because I know I was) yes the camera lense is adjustable for up and down. My escort rear license mount has a slight tilt upwards so if the camera were fixed I would have a serious problem. But the camera comes with an Allen wrench so you can loosen it to manually adjust the camera how you want it then without disturbance of your choice tighten it so it doesn't move, BRILLIANT! And if anyone is worried about quality, this plate frame is very heavy metal and so is the camera casing. It is built very tough. Mine got wet once, blurred the camera a bit, I got out and wiped it off, it was fine after that. Just that simple and seems very, very durable. The only thing that makes me nervous is that the wire running behind the camera, unless you plan to drill a hole or have a hole just behind the frame itself, the wire will get squished between the frame and your mounting surface. Leaving me wondering if that will eventually eat through the wire and short out. Other wise I freaking love it!", "Date": "July 21, 2013"}, {"Title": "Impressive Image - Some configuration required", "Author": "Majo2469", "ReviewID": "R3MKMVTX6Q77G9", "Overall": "5.0", "Content": "What I love about this camera most is that it says in the manual \"do not attempt to install this if you are not experienced with this kind of installation\". As soon as you ignore that, it's pretty straight forward. It gives a good grid that you can configure by adjusting the angle of the camera. Does well in low light, and in water. Not bad at all.", "Date": "June 25, 2013"}, {"Title": "Well Priced, nice looking, backup camera!", "Author": "Andrew D. Keener", "ReviewID": "RTH4CS0NLIWOU", "Overall": "5.0", "Content": "I had ordered a wireless backup camera first, thinking it was going to be easy. Well it turned out bad with so much interference that I couldn't even use it. I ordered this one for 50 bucks and its working great so far. I ended up hooking this to a second relay switch so I could control the camera with a remote. Running the power wires and video cable to the back of the truck took the longest time. I used either black electrical tape or shrink tubing on all exposed wires including the video connectors and power connector. I also used exterior, clear silicone sealant around all cracks and open sections of the camera housing to ensure no water could creep into the camera. This camera also really looks great on my truck. Its extra work but you save cash and get a great picture.", "Date": "June 23, 2013"}, {"Title": "pretty cool", "Author": "jose ramirez", "ReviewID": "R22KUU9KWOLJI3", "Overall": "5.0", "Content": "works fine. great buy. and if you have a good indash to go along with it, then you will really like it", "Date": "March 19, 2013"}, {"Title": "Great Product", "Author": "T. Neeley", "ReviewID": "R3DU0X8GH7KQJK", "Overall": "5.0", "Content": "Looks good on the truck.  Heavy duty frame; solid construction. Extra long cable, reached from the plate to the front of my 2010 Chevy Traverse.CCD performs well in sunlight, a little less so using the night IR illuminated functions.", "Date": "March 11, 2013"}, {"Title": "Worth the money", "Author": "Rocky Polster", "ReviewID": "R3U4251OWBHNGR", "Overall": "5.0", "Content": "connection wires are VERY thin, which makes a good connection slightly more difficult, but the camera works well. No problems with moisture oranything yet, even after multiple washes.", "Date": "March 1, 2013"}, {"Title": "Works great.", "Author": "Jacob C. Fletcher \"SFC Fletcher\"", "ReviewID": "R1B9RMFWPS7I5O", "Overall": "4.0", "Content": "Can't beat the price works great.  Only issue I noticed was the other night when it was like 15 degrees but the next day it worked just fine when it warmed up.", "Date": "February 18, 2013"}, {"Title": "Rear view plate camera", "Author": "Tony", "ReviewID": "R6QLRF2PEEF3P", "Overall": "5.0", "Content": "I was not happy that the product did not show up as expected but it is in the process of being installed, the plate frame the camera is mounted on seems to be made out of quailty material.", "Date": "February 18, 2013"}, {"Title": "Rearview License Plate Camera", "Author": "Take my Word on it.", "ReviewID": "R24GVFZNPNF5F9", "Overall": "5.0", "Content": "This camera is installed on my classic showcar, and I absolutely love this unit. I have the unit wired in so it's constantly hot, and i can monitor was happening at anypoint instead of using it as a reverse camera only. Hope this note helps", "Date": "September 29, 2013"}, {"Title": "Quality camerae", "Author": "JCB \"JCB\"", "ReviewID": "R3CAW400VXZZ76", "Overall": "4.0", "Content": "A quality camera and smart integrated design. I'm happy I went with this option versus a separate camera you add to a license plate. Also, less likely to be stolen or torn off.", "Date": "April 3, 2013"}, {"Title": "Awesome", "Author": "EK Cali Girl", "ReviewID": "RFTMN32603N18", "Overall": "5.0", "Content": "This camera works seamlessly with your current vehicle old or new. Love being able to see in color what's behind me.", "Date": "March 28, 2013"}, {"Title": "Why not", "Author": "Crzywhtby", "ReviewID": "R39DKESS9S3CX4", "Overall": "4.0", "Content": "I like the camera it works well and comes in handy. Don't be a cheap a** and buy the cheapest one you can get. Get this one well worth it. Only reason for four stars is the RCA cable came up short. But I have a ex cab long box truck so I just bought a connector and 3 ft  RCA cable problem solved.", "Date": "March 7, 2013"}, {"Title": "So far so good.", "Author": "J. Nguyen", "ReviewID": "R2TDWU681Z5N19", "Overall": "5.0", "Content": "Product is ok imo. The construction of both the frame and camera is sturdy. This is my first car back up camera so I don't really know what other model are like, but the view from my Pioneer AVH-P3400BH is ok (I can see the image clearly in the day and a good 15ft+ or so at night). There is always room for improvement such as resolution but that also mean I have to upgrade my car stereo. We'll see how long this will last. I work in the telecom wireless field and I drive alot (dirt road, pavement, cold and hot weather). I'll update my review if it will hold up.Edit: 4/2/13I install this on a Suzuki Kizashi 2012 and I drive it off road alot and my car has dark tint windows all around so I needed a camera system that I can see where I backed up to. This camera delivered in total darkness (with a tail lights on obviously). It helped me navigate backing up through hard corners, around brushes, rocks, and trees. No water have gotten through the lens yet and manage well in foggy weather. I don't I should do off road on a sedan, but that's what I got and that's what I drive.Whatever you do, don't trust any backup camera as your main eyes because they're not calibrate to be 100% on every vehicle. For the price and quality, I think it's totally worth with.", "Date": "November 17, 2012"}, {"Title": "High quality camera kit", "Author": "350z", "ReviewID": "ROP0GPIUAB9O4", "Overall": "5.0", "Content": "Camera works great both day & night. You can position the camera right where you need it. I have used the power sprayer at the car wash several times, and I have sprayed it lightly each time. I never see any water leakage or misting of the camera. In rain it obviously has no problems staying clear. As a CMOS camera, typically they are only meant to be wired into the reverse light circuit. They usually get hot after to long of being powered on and start to get cloudy from heat build up. This CMOS camera actually holds up rather well under continued usage. I installed security bolts from the local auto parts store and there is no way you can get this thing off without ripping out your license plate bolt retainers & half of your bumper. Overall the best camera kit on amazon I have came across.", "Date": "April 11, 2013"}, {"Title": "A great addition to my truck", "Author": "E.C. Hamilton", "ReviewID": "RLL35IEVHUL48", "Overall": "5.0", "Content": "This is a great option for your backup camera needs.  The housing and frame are metal, and feel very sturdy.  The image is clear even at night.  It also looks very nice on my truck.  It doesn't stick out visually.  Blends right into my bumper.  I had to contact the company for a customer service need, and was happy with our exchanges.", "Date": "March 28, 2013"}, {"Title": "Great camera!", "Author": "Ryan", "ReviewID": "R14E1TW0GU4NWM", "Overall": "5.0", "Content": "This is a great camera! It costs a little more than others, but it is solid and has been through many heavy rains and car washes without a single problem.  The guide lines shown on the screen are just that, GUIDE lines. I use this on my crew cab f350, and they are a little narrow for the width of my truck, but thats to be expected with a universal fit product.  They do, however, aid when hooking up to my camper, helping me to see where the exact center of the screen is. Its nice that the camera can be adjusted up or down to get just the right angle. At night the camera does a decent job with the built in infrared.  I live outside the city so night time is pitch black and the infrared allows me to see about 20-30 feet max, which i feel is acceptable.  The directions it comes with aren't the best, but that's okay, It's not rocket science putting one of these things in. I soldered the wires from the camera to my reverse lights for a more permanent and professional installation which was harder than expected due to the tiny guage wires from the camera.  The video cable that comes with the camera is BARELY long enough to be used on my f350 crew cab with an 8 ft bed. An extra foot or two would have made the install much easier. The cable seems to be of decent quality though.  Overall, I am very happy with this camera.  It costs more than others, but you get what you pay for in this case. I would definitely buy another if i ever needed to.", "Date": "November 2, 2013"}, {"Title": "love the back up camera", "Author": "Sergiy Titarchuk", "ReviewID": "R37KG4U4UN8QN9", "Overall": "5.0", "Content": "Bought it half year ago. Has no issues at all. Have other car with original installed back up camera and this one has better picture.", "Date": "September 26, 2013"}, {"Title": "Awesome!", "Author": "Kevin Carlson", "ReviewID": "R18W8U94LE3DS5", "Overall": "5.0", "Content": "This thing is awesome. Great during the day and even better at night. The built in grid lines are a nice touch. The only bad thing is that the power wires are pretty small and hard to work with. Also I put this in a crew cab F250 and the supplied video cable was not long enough but I was expecting that.", "Date": "September 16, 2013"}, {"Title": "poor quality product", "Author": "Jeff Newton", "ReviewID": "RHJN02NCW0L07", "Overall": "2.0", "Content": "I purchased this camera as a low cost alternative to the $200 Pioneer camera sold with my new Pioneer receiver.  Installed this at the same time that I was installing the new receiver. Ultimately spent half the weekend trying to figure out why I had such a poor image and ended up bringing out a TV from the house to connect directly to this camera to be sure that it wasn't the monitor on the new receiver. The image was so dim as to be unusable.  The  original product was a camera integrated into the license plate frame which was definitely more attractive than the camera that I ended up purchasing (for twice the price). At the time that I checked on an exchange or a refund, the refund was the only option. Since I had my vehicle torn apart, I purchased a new camera locally to finish the job.  The seller contacted me later, apologized and offered to make an exchange to make it right, too late in my case.  While I was unhappy with the product in this instance, I appreciated the follow up, and I would be willing to do business with this seller again.", "Date": "July 11, 2013"}, {"Title": "Looked good, but didn't fit!", "Author": "James T. Davenport", "ReviewID": "R1EL41NHFKMJV0", "Overall": "4.0", "Content": "Product appeared well made etc but simply was about 1/2\" oversize to fit into the recess provided for the license plate on my car.", "Date": "April 9, 2013"}, {"Title": "since october 2012", "Author": "Gee 35", "ReviewID": "R3VFGGYPC728J", "Overall": "5.0", "Content": "This fit perfectly on ny 04 g35 coupe c; , with aftermarket radio system of course .(I have pinoeer radio app 2)You can c what's behind you at night + +", "Date": "April 3, 2013"}, {"Title": "camera", "Author": "tks", "ReviewID": "R2Q55U9D9IAVC1", "Overall": "4.0", "Content": "It is very good has good picture & nice angle Just wish a monitor was included  no big deal bought one thatthat is 4x3''", "Date": "March 29, 2013"}, {"Title": "Rear-view", "Author": "Steven Bryant", "ReviewID": "R1C6BXH9SUWESG", "Overall": "4.0", "Content": "This is a nice, and functional camera.  Very clear picture in the daylight. At night the picture becomes black & white and the picture is still a good quality.  Instructions are very vague and should be re-written but still well worth the money.  Wise buy!", "Date": "March 25, 2013"}, {"Title": "Just perfect!", "Author": "witchyhour", "ReviewID": "R68DNVIYU6CHO", "Overall": "5.0", "Content": "I got this camera when I purchased a Chevy Equinox and was worried about running into things behind it, since it's a taller vehicle. I was surprised with the price, it was much cheaper than I expected this sort of thing to be. And I loved the fact that it fits around the license plate, so there was no need to try to find a spot for it.The camera was installed in conjunction with the Pioneer AVH-P3400BH 2-DIN Multimedia DVD Receiver with 5.8\" Widescreen Touch Panel Display, Built-In Bluetooth®, and HD Radio stereo and it is fantastic. The image is very clear, day or night. This camera was exactly what I wanted, and I am very happy with it.Enjoy!", "Date": "February 20, 2013"}, {"Title": "Works and is very well made", "Author": "Larry S. Holtzen \"sblardog\"", "ReviewID": "R2S1Q6FD7BLHH9", "Overall": "4.0", "Content": "I am impressed with the quality, all metal construction. Had professionals at Best Buy install it and they did a great job! Could be a little wider view, and the distance scale accuracy needs to be a little more accurate, i.e. when you hot the RED danger zone I still had about 20+ inches to spare, which may NOT be a bad thing. There is no manual adjustments for this available, at least that I could find. I would test it yourself to become familiar with how the REAL scale works for your vehicle. Great camera quality, great price and well built. Definitely a good buy!", "Date": "February 18, 2013"}, {"Title": "Can't go wrong!!", "Author": "Jcompo", "ReviewID": "R39Z7PNXCWCTKD", "Overall": "5.0", "Content": "This is amazing especially for the money. The only thing I would reccomend is buying a higher quality video cable. however I did use the cable it comes with and so far no complaints. It's quality heavy metal construction far exceeded what I was expecting for the price. The video quality is as good as any vehicle that comes with a rear camera from the factory. I notice a lot of people mention the power and ground wires are too small but it's not a problem I think they may be using the wrong connectors or not know how to solder and shrink wrap.", "Date": "June 7, 2014"}, {"Title": "Works But !!!!!", "Author": "Wayne J. Valzania \"HouseWhispererCT\"", "ReviewID": "R2BLFY93WVLTBO", "Overall": "1.0", "Content": "This will be a fairly brief review because all this camera needs to do is to mount well and provide a clear image to the monitor. As mentioned in other reviews, the frame is quite rugged and mounts easily. Connection is also straightforward with the provided 25' RCA cable. I have this camera plugged in to a Rear View Safety Inc.7\" LCD Color Backup Camera System with Audiowhich I also bought through Amazon. The camera that came with the Rear View Safety unit is quite clear and is therefor my point of comparison. The TaoTronics camera on the other hand, is noticeably out of focus for the entire center of the image. In fairness, I'm not sure if it's just my unit but I'm not looking forward to the process of replacing it and just wanted to toss this review out there for your consideration.", "Date": "June 5, 2014"}, {"Title": "Sunvalleytech TaoTronics Tt-Cc17.", "Author": "Clifton  P  Harper  Jr", "ReviewID": "R34Z9K6K279QJ1", "Overall": "5.0", "Content": "Perfect fit.  Works great, although color is not as deep as my other audiovox camera that lasted about 2 years.  Great seller service and follow up.", "Date": "June 4, 2014"}, {"Title": "Works great!", "Author": "Timkc", "ReviewID": "R2KQK147LHZ9US", "Overall": "5.0", "Content": "Works great easy to install. Camera images are very clear and the grid gives good visiual reference .I am very pleased with the purchase.", "Date": "May 28, 2014"}, {"Title": "Perfect for my Xterra 2012.  Build Quality is Perfect", "Author": "Pete from Cali", "ReviewID": "RKTRG236B8V8T", "Overall": "5.0", "Content": "I can't tell you enough how pleased I am to have this great addition added to my 2012 Xterra Pro.  This was a very easy install 2 wires (Red, Black and and Yellow RCA).  Very easy hookup to my AppRadio 3.  The indicator sticks are perfect.  Great night vision on this camera. I would put these in all of my vehicles.", "Date": "May 26, 2014"}, {"Title": "Great Product", "Author": "Geoff Brooks", "ReviewID": "RXYVGLCASWSWG", "Overall": "5.0", "Content": "Installs in a great central position and gives a perfect picture with the line guidesDon't know how it could be any better!", "Date": "May 25, 2014"}, {"Title": "Good camera, easy to install", "Author": "Jeffrey J Seedman", "ReviewID": "R3EYK4UV8KJ58S", "Overall": "5.0", "Content": "This camera has a nice color picture and was easy to install on a 2003 F150. I did need to purchase a longer RCA video cable for a few dollars but no big deal. I'm using it with a Kenwood DNX690 and no issues at all. Should make hitching a boat much easier and it's great to have in general.", "Date": "May 25, 2014"}, {"Title": "Outstanding backup camera", "Author": "Big Lou", "ReviewID": "R1A1ZEKB1DL5PC", "Overall": "5.0", "Content": "I am very please with this product. I would recommend it to anybody for a backup camera. Outstanding and easy to install.", "Date": "May 22, 2014"}, {"Title": "works great", "Author": "Marty Glazebrook \"Marty-1\"", "ReviewID": "R19UDF3TZOGU6Y", "Overall": "5.0", "Content": "My pick up came with a back up camera.  My dad liked how easy it made it to hook up to my different trailers.  He has a small dump truck and trailer that he is always having to hook up to.  With this, he can get it on the first try without having to keep getting out to check.", "Date": "May 21, 2014"}, {"Title": "top quality", "Author": "David Smith", "ReviewID": "R362UFW9P0C7UC", "Overall": "5.0", "Content": "Built solid, works great. .I will definitely recommend this product... very impressive detail during day and at night..so far so good", "Date": "May 21, 2014"}, {"Title": "Fantastic rear-view camera", "Author": "carolg \"carolg\"", "ReviewID": "R1L2QF55LYVRET", "Overall": "5.0", "Content": "I love this camera.  It works very well both during the day and at night; images are bright and clear even in dark areas.  Definitely recommend.", "Date": "May 21, 2014"}, {"Title": "Excellent product", "Author": "Edward A. Rosiak", "ReviewID": "R1NGQZP3K3V53F", "Overall": "5.0", "Content": "Well packaged and documented. Excellent clear picture. You can see and feel the quality. I did have a question on installation that was responded to the following day. I'll probably buy another one for my wife's car too.", "Date": "May 20, 2014"}, {"Title": "Great camera", "Author": "Xinuo Zhao", "ReviewID": "R2OLTBM9NLMT22", "Overall": "5.0", "Content": "The quality is great. I have been using this camera for a couple months and it is working with no problem. The camera has a very wide range and it looks very clear at night time. Rain would not hurt it.", "Date": "May 20, 2014"}, {"Title": "Great for the money.", "Author": "JKDJose", "ReviewID": "R1HWUVUMWSFVB4", "Overall": "5.0", "Content": "Easy installation into my Ford Escape 2013. The picture quality is good and the lines that come up on the screen are very accurate. Remember to use the Allen key that is supplied to loosen the two screws so that you can tilt the camera.", "Date": "May 18, 2014"}, {"Title": "works", "Author": "customer in fountain valley", "ReviewID": "R2OYKI00YHNP6R", "Overall": "4.0", "Content": "easy to install, video is ok. remeber video is backwards as if you are looiking at a mirror. good price and sturdy construction.", "Date": "May 17, 2014"}, {"Title": "Works very well.", "Author": "Johnny", "ReviewID": "R3FOA6RCY4HGNV", "Overall": "5.0", "Content": "Attached it to PIONEER AVHX5600BHS In-Dash DVD Player. I can see very well for my back up. Adds value to my car...", "Date": "May 15, 2014"}, {"Title": "Great Backup Camera", "Author": "Patty O'Furniture", "ReviewID": "RJDZLLN99GU5I", "Overall": "5.0", "Content": "I love how sturdy the license plate frame is (metal), and the picture quality is quite clear. Hopefully it will last for years, but only time will tell.", "Date": "May 14, 2014"}, {"Title": "Bad Cable", "Author": "Johnny Wa", "ReviewID": "R3122IYG0KKIUS", "Overall": "1.0", "Content": "Installed professionally, didn't used the cable included, it's not working. Rearview camera works good, but the angle of the camera is not that wide. They should send me another cable.", "Date": "May 12, 2014"}, {"Title": "holds up to the weather and washing of the vehicle,", "Author": "wolvern", "ReviewID": "R3HD1B1ZRVQJJD", "Overall": "4.0", "Content": "ihave used it for a while now and i wash my vehicle every weekend and so far it has held up to all of the weather. The only thing that so far has it only getting four stars is the low pixels of graphics.", "Date": "May 8, 2014"}, {"Title": "Great view.", "Author": "Ian", "ReviewID": "R2W50WOAO04328", "Overall": "5.0", "Content": "So far been working for quite a while with no issues.  Night vision is very good.  Sometimes daylight washes it out a little, but never been a issue for me.  Would recommend as no one has ever known what it was until I told them.  And to me stealth is key as anyone who recognizes a backup camera will assume you have a nice headunit to rip off.", "Date": "May 5, 2014"}, {"Title": "Product of very good quality!!!", "Author": "Luis", "ReviewID": "R3H0PHXX9VHIDD", "Overall": "5.0", "Content": "Installed this product in a Pionner AVH-X8550 BT, and video image is excellent. It's working perfect  and resolutions image is good.The structure is strong and very resistent.I recommend it.", "Date": "May 5, 2014"}, {"Title": "Great Customer Support", "Author": "Dee", "ReviewID": "R217QMXNWUEMD", "Overall": "5.0", "Content": "Camera  works great for the money. I don't know if the more expensive cameras will do much better. My first camera had problems with the adjusting screws and after contacting Sunvalleytek the quickly sent a replacement. Great customer support for me.", "Date": "May 3, 2014"}, {"Title": "Nice product", "Author": "Chang X. Li", "ReviewID": "RTQFOOU1E1UF4", "Overall": "5.0", "Content": "solid product, can easily adjust the angle with the wrench it gives you. look nice on the day and night time.", "Date": "May 3, 2014"}, {"Title": "No hardware??? update", "Author": "J.Q. Public", "ReviewID": "R1X53YJGHVY35L", "Overall": "3.0", "Content": "I was so looking forward to installing this but no hardware came with it. One I get the hardware I will update this review, until then...So i grabbed 4x1/2\" in length 10mm hex nuts and bolts. They are stainless so I will paint the heads black. So far so good, except-my old 15$ ebay cheapie seems to have a better picture than this unit.I will say the unit is solid, and comes with all the necessary wiring.", "Date": "May 2, 2014"}, {"Title": "Awesome", "Author": "kaEfbaMl \"kaEfbaMl\"", "ReviewID": "R3PF8WBK6QKX4C", "Overall": "5.0", "Content": "What more could you want?This camera works great during the day and at night.I have been using it for a few months now and it is awesome, I have always wanted one of these.Does everything I expected.Want a sweet backup camera? Buy this one its good.2011 Malibu", "Date": "May 2, 2014"}, {"Title": "Tough, very well made!", "Author": "Jeremy M Boney", "ReviewID": "RGW9BIKH5FVRB", "Overall": "5.0", "Content": "This is a very nice rear camera for those seeking a cheaper way. I run this through a Clarion 401 head unit and it works great, IR and night vision are excellent as well as the warning bars. Installation was a breeze!", "Date": "May 1, 2014"}, {"Title": "great looking frame ok picture", "Author": "Shackleton \"Absouteshambles\"", "ReviewID": "R1ZJCGP5XQ8RWJ", "Overall": "4.0", "Content": "great looking frame ok picture nice powder coated frame good but not great picture  no hardware would have been nice with black screws", "Date": "April 30, 2014"}, {"Title": "Nice Addition to the Truck", "Author": "Sven Rafferty \"SvenOnTech.com\"", "ReviewID": "R1W4IESH73TZWB", "Overall": "4.0", "Content": "The video dimensions on the screen are a bit off on my Pioneer screen which makes backing up through the screen exclusively dangerous.  I still rely on my mirrors but this is helpful for those directly behind you objects.  Color is accurate and the night vision very clear.  Direct sun light or vehicles headlights do distort your image for both night and day.", "Date": "April 29, 2014"}, {"Title": "High Quality Product", "Author": "William Miller", "ReviewID": "R1I2J0GUUSPAPO", "Overall": "5.0", "Content": "This product is exactly as advertised! Quality materials and construction. I would highly recommend this to anyone looking for an attractive well designed rear view camera frame.", "Date": "April 28, 2014"}, {"Title": "Speedy shipping", "Author": "steven scott clary", "ReviewID": "RRVPQZPDOKT2H", "Overall": "5.0", "Content": "Use it daily night vision feature is better than expected I will order another one in the future honda civic", "Date": "April 23, 2014"}, {"Title": "License Plate Frame Rear View Camera", "Author": "petlove", "ReviewID": "RVTEQS41VANJY", "Overall": "4.0", "Content": "It looked very nice & also worked pretty well.  It was brighter in the dark than the one that I had before without IR LED.  Very good product & recommend to get itl", "Date": "April 22, 2014"}, {"Title": "Excellent product but poor directions", "Author": "Old Norm", "ReviewID": "R220HF5WZYXZNF", "Overall": "4.0", "Content": "I'll start with the negative: the installation instructions were poorly written.  Not that they were wrong but very brief and obviously translated from another language. For example there were no instructions on how to change the viewing angle of the camera in the vertical plane (FYI, you loosen the set screws on top of the plate to rotate the camera up or down).  The item itself in well made and and performs perfectly.  If you are familiar with automotive wiring and have basic mechanical skills you can install this item without too much trouble.  Conclusion, camera and frame 5 stars directions 3 stars.", "Date": "April 22, 2014"}, {"Title": "Great Camera, Needs Some Minor Design Improvements", "Author": "Mike \"I Run, I Bike, I Wrench\"", "ReviewID": "R2AODYRI540NE8", "Overall": "4.0", "Content": "Recently installed this camera.  The wiring was straightforward as was the mounting.  The camera quality and view angle are great for the price.  The frame is very rugged and the camera easy to adjust.I think the recessed parts for the mounting screws should be round, not hex.  That would allow most plate mounting screw heads to fall into the recess and eliminate the need for longer screws.  There also needs to be a better way to route the wire from the camera.  The license plate can cut into the wire if you are not careful.  I needed to cut a notch into the back of the frame for the wire.  Cutting the notch allowed the frame to sit flush against the body of the car.  The frame is aluminum so filing a notch was easy.Overall, a good product that needs some minor tweaks for the next design iteration.", "Date": "April 21, 2014"}, {"Title": "finished my wish list now", "Author": "Raffi Kandoyan", "ReviewID": "R3P9SS764KPBTR", "Overall": "4.0", "Content": "great product, didn't take to long to hook up. it just going to take a little time to trust my eyes", "Date": "April 21, 2014"}, {"Title": "Great product!", "Author": "Margaret Bagdon", "ReviewID": "R3MZ9SDDQQ4YQO", "Overall": "5.0", "Content": "I found that the license plate frame was made of very strong material and looked awesome. The camera ia very good and adjustable vertically. I will recommend this guy to my friends.", "Date": "April 21, 2014"}, {"Title": "I like it!", "Author": "Kris", "ReviewID": "R3HANVTFHSKU6G", "Overall": "4.0", "Content": "The camera works well, Install was easy, just wish the wiring was longer for the trucks out there since it was about 4 feet short..... Overall working well so far!", "Date": "April 21, 2014"}, {"Title": "Camera Tao tronic", "Author": "M. Veras \"Mike\"", "ReviewID": "R2MRG6RNQ8BCXF", "Overall": "5.0", "Content": "I bought this camera for a pioneer 1500x dvd and i have to say this camera is great in all angles possible. Recommend you buy this product.", "Date": "April 20, 2014"}, {"Title": "Junk", "Author": "Eric", "ReviewID": "R2BMRJZN2HFGOH", "Overall": "1.0", "Content": "I bought this to install in my G8 but it displays no image.  I left it in place and connected it to an old CRT TV and it output a black and white image only so I know the wiring was correct.  Replaced this with another brand (TView) backup camera and the replacement works without issue.  The stats for the camera sound great, but it's meaningless when it doesn't work.  Avoid this one.", "Date": "April 19, 2014"}, {"Title": "TaoTronics Waterproof Color CMOS Car License Plate Frame Mount Rear View Backup Camera", "Author": "Michael Petty", "ReviewID": "R3IPXB6ZEZMJZX", "Overall": "5.0", "Content": "Installed it on my truck. Very heavy duty and simple to install. Toughest part was running a video cable from the plate to the dash. Works great, simple to adjust the view angle. Just be careful where and how you run your video cable. Great product.", "Date": "April 18, 2014"}, {"Title": "Great product and seller!", "Author": "John E. Lynch", "ReviewID": "R1PSG7VEWLVSIH", "Overall": "5.0", "Content": "I use this camera on a 4500 Chevrolet where it is impossible to see trailers when backing up. It's hooked to a Pioneer AVH-x2600BT and works perfectly.", "Date": "April 14, 2014"}, {"Title": "Great Backup Camera", "Author": "Deb", "ReviewID": "R2DHGAIMUF2PPD", "Overall": "5.0", "Content": "We purchased this camera to replace a wireless backup camera we had previously.  This camera is amazing!!  It functions exactly like the backup cameras newer vehicles have installed.  The viewing area is large, colored monitor is awesome, and the range and picture you see are very clear.", "Date": "April 14, 2014"}, {"Title": "great camera", "Author": "Joseph", "ReviewID": "R2XPKN29UNEOQ9", "Overall": "5.0", "Content": "The license plate camera is fantastic and the clarity is unbelievable.The installation was simple but running all wires took some time.", "Date": "April 14, 2014"}, {"Title": "Backup camera frame", "Author": "g", "ReviewID": "R1O603DB0BSWSY", "Overall": "5.0", "Content": "Have not had a chance to install yet but built very good and sturdy like the powder black finish.snd good price", "Date": "April 13, 2014"}, {"Title": "works great", "Author": "Ahmed S.", "ReviewID": "RM8183G20Z5LA", "Overall": "5.0", "Content": "works great even in low low light. and wide view angle. I recommend this product to anyone looking for a quality back up camera", "Date": "April 12, 2014"}, {"Title": "Pretty good camera and looks pretty decent", "Author": "Gos2Slo \"Chris\"", "ReviewID": "R3VGK489VUHK0R", "Overall": "4.0", "Content": "I got this camera to install with a Boyo rearview mirror dealie, but it should work with anything that has a composite video input (yellow RCA cable) Installed pretty easily, had a good long video cable and it reached up to the drivers side underdash on a 2007 Dodge RAM Megacab/short bed.  Pretty long truck.  Spliced into the trailer hitch wiring for Reverse 12v+ and Ground - witch ScotchLok wire taps. and strung the video cable in along the drivers framerail.  Only took about an hour overall.  Picture quality is pretty good, though some of this depends on your monitor/display.  Not sure how much the red \"nightvision\" LED's help at night since the reverse lights of most vehicles would be far brighter.  The picture at night is pretty decent actually, I was not disappointed.The instructions are really bad, they don't mention that the camera angle is adjustable, it looks like there are two small allen screws on the top of the camera cylinder that look they will provide the pivot I need.  The image is NOT reversed like some of the crappy cameras I've tried.Overall, pretty happy, ordering another one for the front of my truck.", "Date": "April 11, 2014"}, {"Title": "Works exactly as I wanted it to", "Author": "Justin Broadbent", "ReviewID": "RAT995DLJZHP1", "Overall": "4.0", "Content": "It works just as expected.  A good review camera.  I bought it to be used with the P-81ACRD / F-81ACRD source unit.", "Date": "April 10, 2014"}, {"Title": "Excellent value", "Author": "Dr. David J. Shuman", "ReviewID": "R1QZZRP62SCQUS", "Overall": "5.0", "Content": "I purchased and installed this cameral along with the company's 4.3\" monitor to mount on my 2005 Chevy Silverado Crew Cab.  Works extremely well.  The monitor is a little odd with the colors but I can easily see what's behind me.  Installation was reasonable.  I had some issues with getting power to the monitor and I had to put an extension on the video cable connecting the camera to the monitor but I think those issues were more my own rather than a comment on the product.  I know there are more expensive setups out there but I'm not sure what they would bring to the table that this combination doesn't.  I have no regrets on my purchase and I would do so again.", "Date": "April 10, 2014"}, {"Title": "back up vision is great", "Author": "Michael Crews", "ReviewID": "R2VN8L63APWYH4", "Overall": "4.0", "Content": "I love seeing what's behind me as I'm backing up. The camera has performed as advertised. installation was a breeze.", "Date": "April 9, 2014"}, {"Title": "Very clear picture, colors could be better", "Author": "Jason Barker", "ReviewID": "R3F4IZ44CETJ42", "Overall": "5.0", "Content": "This unit has a very clear picture when in use! The colors could be a LITTLE better, but for the price you're not going to beat this! Very satisfied!", "Date": "April 7, 2014"}, {"Title": "it's excellent", "Author": "Man Kit Thomas Wong", "ReviewID": "R2PCYZAKLNEJ99", "Overall": "5.0", "Content": "i have it for a year, it has no problem at all. The waterproof works very well as advertised. Good for night time too", "Date": "April 5, 2014"}, {"Title": "very sturdy", "Author": "C. Bose", "ReviewID": "R2ZU35RLK8WYI2", "Overall": "5.0", "Content": "the metal frame is super sturdy and the camera quality is great. This was the best and most stock backup camera I could find.", "Date": "April 4, 2014"}, {"Title": "great quality", "Author": "Miatch33", "ReviewID": "R2Y8NIKYX28PL0", "Overall": "5.0", "Content": "I was sceptical when I received the product about how this would look on my 2012 f150 because the other trucks have the bumper back up cameras.  But this seems sturdy and you don't notice it after installed and seems to have a great picture.", "Date": "April 3, 2014"}, {"Title": "Quality Built with quality picture resolution", "Author": "Michael Tzeo", "ReviewID": "R1D422VRXBOMH0", "Overall": "5.0", "Content": "Title says it all.  Built to last.  Running the wires took a bit but overall install wasn't complicated.  The picture quality to my in dash screen looks great!", "Date": "April 2, 2014"}, {"Title": "Works Well On My 04 Jeep Grand Cherokee", "Author": "Ryan Zahler", "ReviewID": "RFIXHDE9TH63D", "Overall": "4.0", "Content": "I bought this camera to attach with a head unit that has a 5 inch screen and backup camera input. it was basically plug and play. It only took me about 3 hours to pull the Jeep apart, run the wires, and put it all back together. It looks good and works well.", "Date": "April 2, 2014"}, {"Title": "Nice Backup Camera!", "Author": "DocT65", "ReviewID": "R2S3Q9VMHN4AY1", "Overall": "5.0", "Content": "Really nice back up camera; I've had it installed now about 2 months.  Picture is crisp.  The IR feature is really helpful at night.", "Date": "April 2, 2014"}, {"Title": "Not perfect for 2003 VW Passat Wagon", "Author": "Steve Danke", "ReviewID": "RQFZLFVNE4M5Y", "Overall": "3.0", "Content": "Can't say I love this one.While it may be good for a regular installation (as pictured), I had to mount it up-side down since my release handle for the hatch was blocked by the camera. I have a VW 2003 Passat Wagon.So I did have to install the frame with the camera on the bottom.As a positive side-effect, I now see the bumper line, which would be impossible to see if you mount the camera at the top of the frame.Due to the angle I had to turn the camera, the color lines are pretty much useless but I think all of this very much depends on your specific application.I'll keep it but I had higher expectations based on reviews from others", "Date": "April 1, 2014"}, {"Title": "great camera", "Author": "kattya", "ReviewID": "RBWXYV1JPRKHO", "Overall": "4.0", "Content": "Very clear image. Well made. Would recommend to othersI removed 1 star for not supplying matching black mounting screws.", "Date": "April 1, 2014"}, {"Title": "Awesomene", "Author": "Roberto Feliciano", "ReviewID": "RZEUVIF1O60W4", "Overall": "5.0", "Content": "So far awesome products, fast shipping. Very lucky to find this camera. I did the installation and save a lot of money.", "Date": "April 1, 2014"}, {"Title": "Backup camera", "Author": "P&P;", "ReviewID": "R19QNZINBB92OU", "Overall": "4.0", "Content": "Great picture. The only drawback is I had to buy additional RCA cable. The one it comes with was not long enough for my F250. Also in the product description I could not find what was included. Only installed this week and have yet to try it out for the purpose I intended - aligning trailer hitch to the ball. More to come after.", "Date": "March 30, 2014"}, {"Title": "A good backup cam.", "Author": "Kaelan \"frontier_ranger\"", "ReviewID": "RHO3I90OHFRQC", "Overall": "5.0", "Content": "I own two of these, one in silver and one in black. They work very well. I installed them with pioneer dvd headunits and the picture is very clear.I wasnt expecting them to be as good in low light as they are. At night, the reverse lights mixed with the built in infrared leds make one bright picture. I compared my rear view mirror to this camera out in the country where I live on a pitch black night. No street lights, nothing. The camera view was nearly twice as bright as using the mirror through a clear back window. I even saw my dog standing about 15 feet behind the car plain as day.This will be my go-to camera for any future installs.", "Date": "March 29, 2014"}, {"Title": "like it it so far", "Author": "Shawn James", "ReviewID": "R2JK4GB5PSLZ6D", "Overall": "4.0", "Content": "i have it installed now for 3 weeks,great little camera, like the night vision and the fact that it has the license plate holder.  i have an SUV so the wires were a bit short to run with the factory wiring, however an RCA barrel connector and additional RCA cable with electric tape fixed that fast.The only con was that the screws to move the camera stripped out immediately, however i was able to pull it out of the bracket and put it back in, and now its perfectly movable but stays in place during normal driving.would buy again.", "Date": "March 28, 2014"}, {"Title": "A#1 camera!", "Author": "Mark Riley", "ReviewID": "R32KSHORFB1CJZ", "Overall": "5.0", "Content": "Works great,just what I was looking for! Great pic day or night!And a great price! Has been very useful tool.", "Date": "March 28, 2014"}, {"Title": "Nice and clear", "Author": "Wageh Farag", "ReviewID": "R18A9DA4HYL60N", "Overall": "5.0", "Content": "Nice and clear. Easy to install and good view. I should buy another one for my other car. thank you", "Date": "March 28, 2014"}, {"Title": "Best quility for the price", "Author": "Calvin Parker", "ReviewID": "R149ECQ0SY9RFB", "Overall": "5.0", "Content": "I'm more then satisfied with my purchase I even got a couple friends interested in buying one for themselves. It's only right you get the rear view camera with the frame.", "Date": "March 27, 2014"}, {"Title": "Works like a champ", "Author": "Matt P.", "ReviewID": "R31GQ4SVUASAE0", "Overall": "5.0", "Content": "Works perfect! clear picture and the gridlines work great. This is a replacement camera for one I had that was a different brand and claimed to be waterproof. It wasn't and as of now this one is holding up to lots of rain here in south Texas.", "Date": "March 27, 2014"}, {"Title": "Great Item, works Fantastic, Love it.", "Author": "manofstature", "ReviewID": "R2ZVHK9HGA7HFQ", "Overall": "5.0", "Content": "I am extremely pleased with this item. it was easy to install (but then again I have experience in electronics and automotive installations). The unit also did everything it was supposed to do and it did it well.The  Metal Frame was extremely sturdy and the Camera and UV lights are also well mounted in the metal Frame. It also looks quite professional and unobtrusive. I would recommend it to everyone. I could not be more pleased with this item. If you want one that looks great and works perfectly, then get yourself one.", "Date": "March 26, 2014"}, {"Title": "review car camra", "Author": "ANDREW GRAZIANI", "ReviewID": "R33Y283ZSKC56P", "Overall": "5.0", "Content": "it woks perfect, I had I had it installed and the person did not need a thing extra. it is great when you have a van", "Date": "March 25, 2014"}, {"Title": "you get what you pay for..", "Author": "Robert Brooks", "ReviewID": "RA0141AAEA21A", "Overall": "3.0", "Content": "Proseasy installnot too noticible on the vehicleconsdoesnt give that great of a picturenight time viewing isnt greatit WORKS but isnt close to a factory camera.", "Date": "March 25, 2014"}, {"Title": "good", "Author": "Bill squires", "ReviewID": "R2H5YMH6UFEQW3", "Overall": "5.0", "Content": "I love it !I works so good its like having an oem cam in ford truck like fatc. install!! good stuff", "Date": "March 23, 2014"}, {"Title": "great product for the $", "Author": "Cory Potterf", "ReviewID": "RMD3OSMK5OSE0", "Overall": "5.0", "Content": "Worked great with my system clean crisp video.clear view of all areas. Easy to install & great design. Well made and durable.", "Date": "March 20, 2014"}, {"Title": "Great Product for the price", "Author": "SFIDC", "ReviewID": "R1QXNCVVHCLZCW", "Overall": "5.0", "Content": "Camera is Mounted on a 08 Dodge Ram 1500.  Much needed for tight areas and serves the purpose well.  Picture is clear in both color and the IR mode.  Thought my backup lights would white out the picture but it did not.  Only issue I have is the lens tends to get dirty quite often I'm sure because it sits just above the towing hitch, but I am in the North and it is winter.  A quick thumb cleaning and it's good as new.  I don't have it set up to run constantly if I choose, but the connection only took about 45 minutes and that was in a 12 degree garage.", "Date": "March 19, 2014"}, {"Title": "Does the job, nicely made", "Author": "Perry", "ReviewID": "R3CUYE8SWY9BVM", "Overall": "4.0", "Content": "I bought this as an add-on for a car stereo upgrade and it works great. Nice metallic frame, decent video from the camera and the IR LED's actually do a good job of illuminating my pitch-black driveway when I back the truck in at night. The guy installing it at Fry's noted that it was better than anything they sold in the store.", "Date": "March 11, 2014"}, {"Title": "Products was as described", "Author": "Edward", "ReviewID": "R2ZD5T07Z5Q2L8", "Overall": "5.0", "Content": "Great experience all around.  Product was good quality... seemed crazy cheap for a back up camera.  I had one previously installed with cut wires so i just ran the video cable under my truck and pulled it up through to the back of the stereo. It was labeled so i plugged it in and Voila! it worked!  Very happy", "Date": "March 5, 2014"}, {"Title": "Love It", "Author": "Rashond Edwards", "ReviewID": "R1NDLW3L9JQ8Q6", "Overall": "5.0", "Content": "It is a great CameraVery AffordableOnly complaint is when it rains its not very UsefulFast Shipping thru amazon PrimeI give this my Stamp of Approval !!!", "Date": "March 5, 2014"}, {"Title": "Great camera", "Author": "Marc Claiborne", "ReviewID": "RWT5GYD54O74K", "Overall": "5.0", "Content": "Everything is good with this product I'm going to get another one for my wife car when she is ready", "Date": "March 5, 2014"}, {"Title": "Great backup camera", "Author": "fishki", "ReviewID": "RTSRMEWEPRDT9", "Overall": "5.0", "Content": "Purchased this camera solely for hooking up to trailers. Works great, I tilted it down so I can see my ball hitch, the guide lines help tremendously and lets me know exactly when to stop. Very well built, not a cheap piece of plastic, all metal and heavy. It does somewhat cover the state name on my tag, but that does not bother me at all.", "Date": "March 4, 2014"}, {"Title": "good camera.", "Author": "Aaron Smith", "ReviewID": "R3P152XZG45MIW", "Overall": "5.0", "Content": "Beautiful picture. Nice wide viewing. Easy Installation. Very solid frame. Need a VERY small metric allen wrench, 1.5mm, to adjust vertical.", "Date": "March 4, 2014"}, {"Title": "Back up Camera", "Author": "Chris H.", "ReviewID": "R1VE5K36O66JSG", "Overall": "4.0", "Content": "Pros: Sturdy construction, nice packaging, easy to installCons: Picture quality isn't the bestI purchased this for my Chevrolet Colorado. It was very easy to install. I pulled power and ground from the trailer plug which is right next to the license plate. The yellow wire I put in wire loom and zip tied to the frame rails. There was plenty of yellow wire to spare (approximately 2 feet extra). I have this hooked up to my Kenwood DDX470 radio and it works just fine. The picture quality isn't the best compared to what OEM vehicles have, but for the price I am happy.", "Date": "March 4, 2014"}, {"Title": "Great backup camera", "Author": "steve m", "ReviewID": "RVSJOVCWCDZYU", "Overall": "5.0", "Content": "Well made camera, has gone through rain, snow, ice so far and zero problems. Didn't even have to adjust camera after install! Recommend.", "Date": "March 2, 2014"}, {"Title": "Perfect", "Author": "Jarvis Bourgeois", "ReviewID": "R2OZKQKHI14L2A", "Overall": "5.0", "Content": "This was exactly what I was looking for. It fits my car and u wouldn't even notice it if your not focused on it", "Date": "February 28, 2014"}, {"Title": "Good value for the money.", "Author": "M. Sproull", "ReviewID": "R10CQJZ98ZA3HW", "Overall": "5.0", "Content": "I had this camera installed with my Kenwood receiver at a car stereo installation dealer. I'm very happy with the video quality both at day and night. The pricing was very competitive and all the required parts where included.", "Date": "February 27, 2014"}, {"Title": "Good picture", "Author": "Erick L Tibeau", "ReviewID": "RM3B4PISP6LQI", "Overall": "5.0", "Content": "Bought it for a pioneer app radio 2 install, clean look just take off license plate connect power and ground with backup light wires and run video line. Day or night works great!  highly recommend!", "Date": "February 27, 2014"}, {"Title": "Worked like a charm", "Author": "Scott Singer", "ReviewID": "R3FXA9JCR187MZ", "Overall": "4.0", "Content": "This is a fantastic product. Works as advertised and for the price you can't beat it. I definitely do recommend.", "Date": "February 26, 2014"}, {"Title": "Very Happy", "Author": "Richard W Hamburg", "ReviewID": "R202UNENQ3UUQE", "Overall": "5.0", "Content": "This product  works very well, arrived quickly, and was installed easily with minimal mechanical skills. I did purchase a light kit to increase performance.", "Date": "February 24, 2014"}, {"Title": "Worth it", "Author": "chris smith", "ReviewID": "R2TDBXDI5T2TWW", "Overall": "4.0", "Content": "I purchased and installed a new head unit and decided to buy a back up camera as well.  This one made sense and I had a friend with experience install both.  I live in New England and it's been cold all winter, so at times the exhaust does make it difficult to see.  But, this thing has worked great so far.", "Date": "February 21, 2014"}, {"Title": "love it", "Author": "jodie r hintz", "ReviewID": "RWYCQU5SPEZEB", "Overall": "5.0", "Content": "Works perfect in my 2000 excursion. And was easy to install. pictures clearer even at night. Hard to see when rain is on it though", "Date": "February 19, 2014"}, {"Title": "License plate camera", "Author": "Steve \"Steve\"", "ReviewID": "RFEYDC2PCPYOL", "Overall": "5.0", "Content": "Very nice camera works great in day or night and it looks very nice.  You hardly can notice this is a camera.  Picture looks very nice and visibility is exceptional.  Camera adjusts up and down and the frame is built very sturdy and looks fantastic.Worth the extra amount than the ugly stand alone cameras.", "Date": "February 18, 2014"}, {"Title": "Rear View Camera", "Author": "Ricky Young", "ReviewID": "R3JB3K9ECAWHO5", "Overall": "5.0", "Content": "I researched this product on line and found it on amazon the product was delivered on time and It installed on my daughters SUV .I have a chance to review it after I came from work and it is amazing .Great product great price and easy to install .Ricky", "Date": "February 16, 2014"}, {"Title": "by franco", "Author": "Francisco A. Doce", "ReviewID": "R1JQQKWK02LYZL", "Overall": "5.0", "Content": "I bought this for my suv. This camera has an exellent view, about 170 degrees and the best part is it made up of line that indicate the distance to object behind you.", "Date": "February 13, 2014"}, {"Title": "Great camera.", "Author": "Chris", "ReviewID": "RCTDGUC9E1YUG", "Overall": "4.0", "Content": "Bought this for a backup camera on my 2013 f150.Tapped into the reverse light for power, ran the wire up the frame, in through a drain plug under the driver’s door to a 4.5\"TFT screen. Easy install, great clarity on a 4.5” screen. Easy to adjust.I am very impressed with the IR illumination at night.Subtracted one star because there was no notch in the frame to let the wire out. I didn't want to drill my bumper to run the wire to it, so the wire is currently pinched a little between the bumper and the frame. I cut a small notch in the frame which helped.I am planning on buying another for the front of the truck.", "Date": "February 7, 2014"}, {"Title": "Nice Product.", "Author": "NiK", "ReviewID": "R2QQM963J3HW1P", "Overall": "5.0", "Content": "This is a Nice Product. This product is, as described in adv and does as it is said in adv.", "Date": "February 3, 2014"}, {"Title": "great buy!", "Author": "Bill Q.", "ReviewID": "R15L1LMPLMPBFX", "Overall": "5.0", "Content": "Really great picture quality and heavy duty frame. Can see good in very low light settings. I would buy again", "Date": "January 30, 2014"}, {"Title": "Great rear view camra.", "Author": "cody hultquist", "ReviewID": "R1XQUDTL09P32A", "Overall": "5.0", "Content": "This camra met all of my expectations for my truck. It works great at night time to. The reception is a little wavy but not horrible. You can still see everything very clearly. Would buy again.", "Date": "January 29, 2014"}, {"Title": "LICENSE PLATE FRAME BACKUP CAMERA", "Author": "rowland hall", "ReviewID": "R2NCWW2NTY9WOF", "Overall": "5.0", "Content": "I installed this on my 2006 Toyota Tacoma pickup.  The camera works well, but the power wires are very fine.  I used 22-18 AWG \"Tap Splice\" connectors.  I to replaced the plug and power wires to get larger wires.  The Camera to Monitor wire is very fine also, I pulled it in half trying to fish it through a grommet.  I repaired the wire and it works fine.  Very good picture.  Thinking about buying one for the front.", "Date": "January 20, 2014"}, {"Title": "Great Camera for the Price", "Author": "Bryan S. Butler \"B Butler\"", "ReviewID": "R2QBZFB5894IMD", "Overall": "4.0", "Content": "Bought this camera to go along with my Pioneer AVH-X3500BHS deck in my 2005 GMC Yukon XL SLT.I looked and shopped around for a while before I took a chance on this one. And I am glad I did. Picture is for the most part clear both day and night (even in the rain). No condensation build up at all.Frame is a very well built. Not plastic junk but solid aluminum construction.Well worth the cost.", "Date": "January 20, 2014"}, {"Title": "Very good", "Author": "H. F. Sawatzky", "ReviewID": "R1V05G73PDBN4U", "Overall": "4.0", "Content": "Image is clear, night vision is very good. I also have a Rear View Safety system and this is almost as good a picture. Heavy and well made. Camera can be flipped if you want the camera on the lower end of the frame. I needed to do this since it covered my Provincial ID on the plate if I had the camera on the top. An extra 10 - 15 feet of video RCA cable would be nice. Would have bumped this up to 5 stars.", "Date": "January 19, 2014"}, {"Title": "awesome", "Author": "aynsley howard", "ReviewID": "R13IUP9ZQDMBSB", "Overall": "5.0", "Content": "awesome camera, the wire was short for an expedition so I rigged to make it to the front. Excellent camera and arrived quick, Installation may require drilling thru metal and all.", "Date": "January 17, 2014"}, {"Title": "Keeping my fingers crosses", "Author": "E. Allegretti", "ReviewID": "R2CG9SQRYBFY4R", "Overall": "3.0", "Content": "Night vision appears completely washed out in the rain or snow. Dry daytime picture is great. I bought this to replace a cheaper version (same brand) which lasted 3 months on my plow truck before it showed \"no video signal\" on my ogm1 head unit, spent 2 hours redoing wiring and cables to determine the camera broke. Ugh. This one is the same build quality as the $15 one I'm hoping it will last a couple years. The RCA cable is not long enough for a crew cab longbed hd3500 I needed to buy a 6' extension cable at radio shack for $8 but that's not taotronics fault. Installation was simple.", "Date": "January 11, 2014"}, {"Title": "Good to use, but I would rather get a better one.", "Author": "Peter Gao", "ReviewID": "RB37MYFY8CI3J", "Overall": "3.0", "Content": "I bought this a year ago, and got it installed by expert along with the navigation unit INE-S920HD. When the guy installed it, he said the view angle sucks. I had no idea what is GOOD, the only thing I care was I got a rear view. Until recently I found the viedeo of alpine HCE-C157D, which has 190 degree horizontal and 167 degree vertical angles, I am amazed. So I measure the real view angle of this camera even though I am not professional, the result scared me, its only less than 100 degree both horizontal and vertical, far less then it said. I know the alpine one is 170 bucks, more than three times than this one, but, comparing to the car value, navigation unit, and the most important thing, safty, its worthy.PRO1, Good quality frame with anti-theft scaws.2, It does have night view under IR,comparing to some the 170 bucks one, it seems better.3, Water proof for sure, I use high pressure hose aim at it for a few minuses from different angle, no water inside at all.4, Cheap for a rear view camera and a aluminum frame.CON,1,Really bad view angle, its impossible to use to backup out of a parking place because the only thing you can see is whats behind you, maybe a little bit more area beside it.2,Those guidelines are useless, at less to me, would be better if it's optional, like some other cameras do.If you really really dont care about the view angle, buy it. Otherwise, go with some better ones, your and your car's safety are more expensive.I will update my review after installing the HCE-C157D.", "Date": "January 11, 2014"}, {"Title": "Very high quality product.", "Author": "Troy Hester", "ReviewID": "R2DK6DV50RS6QY", "Overall": "5.0", "Content": "One piece construction makes the difference between an add on, and built in look. The only thing missing are the correct bolts to fit into the octagonal mounting holes. 6mm bolts and nuts available at a hardware store. Painted black.", "Date": "January 9, 2014"}, {"Title": "Love it by day hate it at night", "Author": "Me", "ReviewID": "R3VXB45LVH1J8J", "Overall": "2.0", "Content": "Everything about this camera is awesome but the night vision feature  it's not clear enough but besides that it's great", "Date": "January 9, 2014"}, {"Title": "Very nice, subtle", "Author": "The Internet", "ReviewID": "R29AVA8MW0RWQQ", "Overall": "4.0", "Content": "This is a pretty good camera, I am able to see clearly at night. The image quality could be better, and it is strange to use during the daytime since the IR sensitivity causes green trees to show up pink.", "Date": "January 7, 2014"}, {"Title": "Works pretty well, great for the money!", "Author": "Mike", "ReviewID": "R3RK9T0SSMAWGF", "Overall": "4.0", "Content": "This really takes the stress out of hooking up my travel trailer.  For some reason the Wife and I would always have a communication break down, and I would end up finally just doing it myself, after some \"discussion\".  With this camera hooked up to my Edge Insight on my F250 Powerstroke, I can back right up to the tongue, and all my wife has to do is tell me how far I need to go.  She does this to the camera, not to my mirrors.  Works well.  The only gig that I can give it is that it will occasionally go out while I am backing up.  I do not know if this is from the camera or my install, but it does go out.  I go back to park and back to reverse and it comes back on.  Not a huge deal, but an annoyance.  For the money, its well worth it.", "Date": "January 6, 2014"}, {"Title": "Amazing", "Author": "Michael Robinson", "ReviewID": "R3G0ITD0HMG9KR", "Overall": "5.0", "Content": "Great picture and night vision. Easy install and setup. Has made it through some weather here too. would buy again.", "Date": "January 5, 2014"}, {"Title": "Works Great!", "Author": "Terry A. Campbell", "ReviewID": "R1CC7EPQEMH7P3", "Overall": "5.0", "Content": "I bought  this to replace a cheaper one that I had ordered.  It works really well and the picture is very clear.  I already had wired my vehicle for the previous camera, so installation was really simple.", "Date": "January 4, 2014"}, {"Title": "So far so good!", "Author": "Justin Hurley", "ReviewID": "R3BTQ63C9DFGAS", "Overall": "4.0", "Content": "Camera provides good picture and guidelines are helpful. Mine is mounted pretty low on my car so I could still hit things if I wasn't paying good attention but is helpful when pulling straight back into a space or driveway. The actually camera and LED's are kinda bulky and I'm afraid someone will be tempted to steal it. I recommend using Torx or hex bolts to secure it to help thwart a potentially easy theft.", "Date": "January 4, 2014"}, {"Title": "More Than I Expected", "Author": "Crimsonsunrise", "ReviewID": "R19SHL6QTJ6BZ", "Overall": "5.0", "Content": "I'm impressed with the performance of this backup camera. The low light feature is nice when backing up in the dark. It's unobtrusive and inconspicuous.", "Date": "January 3, 2014"}, {"Title": "A little pricey, but you can see at night!", "Author": "B. C.", "ReviewID": "R5M4NOXR1872J", "Overall": "5.0", "Content": "This is my third backup camera and this one is great. You can actually see at night with this thing. Added bonus is that it looks like it came stock on the vehicle.", "Date": "January 1, 2014"}, {"Title": "Well built", "Author": "Greg G.", "ReviewID": "R3ISGFIQJPWXZD", "Overall": "4.0", "Content": "The build quality is great (all metal) and it fits perfectly. Camera can also be tilted up down by accessing two screws that lock it in place.", "Date": "January 1, 2014"}, {"Title": "Rear view camera", "Author": "KEVIN H KIM", "ReviewID": "R1O6FP8MAAYJTD", "Overall": "5.0", "Content": "Installed to my Nissan Titan truck, and it Works great.  A good value.  Love it and would recommend to friend.", "Date": "December 31, 2013"}, {"Title": "nice item", "Author": "Mario", "ReviewID": "R1CWLSNC97BULB", "Overall": "3.0", "Content": "this item does not come with the monitor you need to buy it seperately and can be a bit confusing on which one works with the license plate unit. other than that it looks good and it does work for the price.", "Date": "December 31, 2013"}, {"Title": "This is great for cars that don't come with rear cameras", "Author": "Al", "ReviewID": "R2WGKE8LITGDNM", "Overall": "5.0", "Content": "Specially if you combine it with Abco Tech 4.3 Inch TFT Car Auto LCD Screen Rear Monitor View Rearview this thing rocks. Let me say first though that if you're not electrically and mechanically inclined and don't have a good set of tools and understanding of car's electrical systems you will hate the install... But if you're up for it it's not bad. I had to drill a hole in the car's body to pass the cables (because I didn't want any cables to show) although you don't need to and combines with the aftermarket rearview mirror the pair works great. I did not hook it up to the backup light circuit as I primarily wanted it to \"see\" my trailer as I drive to make sure the cargo is OK or to back up into the hitch or drive in reverse with it without a helper. So I hooked it using a manual \"push button switch\" I located on the dash. I love the look of it and the camera has the \"green-yellow-red- and alignment\" bars superimposed in the image so my camera shows like it came from factory. Would be buying a seconds set for the wife's car soon.", "Date": "December 30, 2013"}, {"Title": "Excellent Camera", "Author": "Sandan", "ReviewID": "R2WTZEOJLP7JMG", "Overall": "5.0", "Content": "Excellent camera with good picture both day and night works very well and very easy to install.  Good field of view.", "Date": "December 29, 2013"}, {"Title": "Sturdy", "Author": "Mike Olson", "ReviewID": "R1R3B9618QSDHR", "Overall": "4.0", "Content": "Its sturdy frame and sleek looks is what interested me. The camara looks fine, but the Nightvision seems to get interference in the signal from the Head unit. Don't know whose faul but its pretty minor. Also i had to drill a hole through my license plate and bumper to run the wire without pinching it at the plate. Does as advertised at least.", "Date": "December 27, 2013"}, {"Title": "Back up camera and monitor", "Author": "Thorbjorn Finnbogason", "ReviewID": "R27NKIVQSA2HV6", "Overall": "4.0", "Content": "I had it installed by a professional, and it's working great. The color is a little off, but I don't know if it's the camera, or the monitor. But that does not matter that much, and I'm happy with this camera setup.", "Date": "December 23, 2013"}, {"Title": "Excellent product for the piece", "Author": "J. Benjamin \"JB\"", "ReviewID": "RKF692AA4GL06", "Overall": "5.0", "Content": "This is an excellent product for the price,  Excellent visibility day and night,  easy to install, would buy again.  User comments convenience me to buy it.", "Date": "December 21, 2013"}, {"Title": "license plate camera", "Author": "Ray c", "ReviewID": "R2V4RF28B0YBIL", "Overall": "5.0", "Content": "I was looking for a back up camera for my wifes jeep because she always says she can't see things behind her. I didn't want a camera that looked like an after thought, oddly hanging/attatched to the trunk. I came across this license plate camera and after reading the specs, decided to give it a try. It has a good build, very sturdy, no cheap thin plastic. At a glance it looks like it's just a tag frame.The picture quality is good and i just purchased another for my car. If you have a good head unit, you can adjust the colors on your screen.You can't beat this deal at $49.99!!!", "Date": "December 18, 2013"}, {"Title": "Great Camera!", "Author": "hearthstone", "ReviewID": "R26JNLBPAKP6Y6", "Overall": "5.0", "Content": "This is a really good product for the price.  Sure, picture quality does not compete with a high definition TV, but it sure beats not having any view at all when backing up.  Installation was simple, and the green, yellow, and red lines sure helps when you need to back up as close as possible to something like parallel parking.  The camera works great in the dark too!", "Date": "December 14, 2013"}, {"Title": "It works, but image is not that good compared to other inexpensive aftermarket systems I've seen", "Author": "Patrick R. McGuirk", "ReviewID": "RAUXKZJKFSZQ", "Overall": "3.0", "Content": "I love the ability to have a backup camera in my car now.  This was pretty easy to install and adjust.  Only real problem is the image quality is rather poor.  Based on previous reviews I expected a clearer image.  But since I had nothing before this, I can't complain too much I guess!?!?", "Date": "December 11, 2013"}, {"Title": "I don't know how I ever lived without one of these.", "Author": "S. Rogers", "ReviewID": "R2TTB5LVDQ14KN", "Overall": "5.0", "Content": "Bought this to use with my F150, which has a shell on the bed and so it's almost impossible to see out the back when reversing.  I don't know how I ever lived without one of these.  Installation was relatively simple.", "Date": "December 10, 2013"}, {"Title": "Looks like a very solid product.", "Author": "Alexander V. Smirnov", "ReviewID": "R1VIK3KCJNPVWP", "Overall": "5.0", "Content": "Used this with my Asteroid. I must admit - the quality of the picture is good. The frame is very solid. I can not speculate on how long will it work, but it is a good addition for now.", "Date": "December 10, 2013"}, {"Title": "Works great", "Author": "High-Tech Redneck", "ReviewID": "R3EUDSOCMXIGUM", "Overall": "5.0", "Content": "Good, sturdy camera and plate frame.  Vertical adjustment is a great feature and works well.  Zero issues in four months of ownership.  Good visibility day and night.", "Date": "December 7, 2013"}, {"Title": "Lovely camera!", "Author": "Jordan Cartwright", "ReviewID": "R2J9Y5WXYYGDMS", "Overall": "4.0", "Content": "Amazing Camera! I've never had a Backup Camera before, but i am truly wow'ed by this! Fantastic image quality on my JVC touch screen Head Unit and the Night Vision is wonderful! Not washed out or grainy. 4 stars because the wires that came with it were too short to connect inside my Taurus X SUV (Plate on Hatch)", "Date": "December 6, 2013"}, {"Title": "great frame", "Author": "Leo Duclos", "ReviewID": "R3VCUDFIIFI8OV", "Overall": "4.0", "Content": "the quality is good, but the camera lens should be shaded from direct sunlight. When backing toward the sun it washes out too much.", "Date": "December 2, 2013"}, {"Title": "very solid", "Author": "JayB", "ReviewID": "R29KDSI7HQWI5H", "Overall": "5.0", "Content": "Very solid, requires purchasing hex head bolts to secure to auto.  Good picture, no issues with rain or water blurring video.", "Date": "November 25, 2013"}, {"Title": "Excelent rear view camera", "Author": "Enrique Roca", "ReviewID": "R347XFXQRNCWO3", "Overall": "5.0", "Content": "Excelent rear view camera with clear image and easy installation. Works great with my Pioneer head unit AVH-X5500BHS. I recommend it", "Date": "November 20, 2013"}, {"Title": "Good camera / value overall", "Author": "adam2s", "ReviewID": "RCEO3ZWR46GV", "Overall": "4.0", "Content": "The camera works well and license place frame simplifies installation.  I would have left five stars except the design has the camera wire coming out where the sharp edge of license plate meets the frame - can be taped, but that part could have been better.  Nice amount of up/down adjustability - I have it set so that my red line is approx 1 ft at my bumper level which is pretty nice.  Happy for now - hoping the unit lasts a while w/o problems.", "Date": "November 17, 2013"}, {"Title": "great camera", "Author": "aaron walrod", "ReviewID": "RB2PRI8X5ICCY", "Overall": "4.0", "Content": "great back up camera. the only reason i did not give it a 5 star ratting is due to the video cord was to short for my truck. i have a 2005 F250 and i had to re route the video line three different ways to try and get it to reach the license plate. other than that it is a great camera. i would recomened this product to any one who is looking for a back up camera", "Date": "November 15, 2013"}, {"Title": "You should have it.", "Author": "Doc", "ReviewID": "R58WHGMHGT8B3", "Overall": "5.0", "Content": "I like this camera. It works perfectly. A night vision also well. The quality of video very good. I recomend to buy it.", "Date": "November 15, 2013"}, {"Title": "This is a AWSOME product, I give it 5-stars ;-)", "Author": "Sabrina Bradley", "ReviewID": "R24AXJQ6KEGNPB", "Overall": "5.0", "Content": "I give this product 5-stars, it works very very well as described, The picture is clear and because the camera is mounted on the license plate it doesn't stand out.  This is a AWSOME product.", "Date": "November 14, 2013"}, {"Title": "TaoTronics License Plate Backup Camera", "Author": "Allen G", "ReviewID": "R2960OEZWI9S98", "Overall": "5.0", "Content": "Looks high quality with very sturdy construction. Chinese to English instructions will give you a chuckle. Should hold up well.", "Date": "November 13, 2013"}, {"Title": "Awesome, but small installation annoyance", "Author": "Bryan Rose", "ReviewID": "RPT4ENHSKC2V", "Overall": "4.0", "Content": "Feels super heavy duty and solid.  Clear image, even at night.  Looks great on a 7-inch portable GPS (I'm using Magellan RoadMate 1700LM).  The only annoyance was on installation...  the hole you need to drill into the body for the tiny cable needs to be at least 1/2\" in order for the RCA connector to fit through.  A smaller hole would have been desirable, but not enough for me to cut and re-splice the cable.  The larger hole was kind of a pain to seal up.  Other than that small annoyance, it's a very high quality item.", "Date": "November 12, 2013"}, {"Title": "Best back up camera!", "Author": "BFREY18", "ReviewID": "R6H0BZECBQAG5", "Overall": "5.0", "Content": "I couldn't believe the quality of the image. I hooked this up to my keenwood excelon radio. Easy install, just plugged the aux course from the camera into my radio and ran a separate cord from the back up cord on the back of my radio and tied it into the back up light along with the power source for my camera. For the price I and 100% happy. It even has the colored grid on the camera which I measured to see distance but doesn't have a beeper notification to let you know when your getting close. Another cool thing was at night the camera goes from color to black and white and makes it so much easier to see at night.", "Date": "October 31, 2013"}, {"Title": "Decent.", "Author": "Swany", "ReviewID": "RMF74Q1TF4LT8", "Overall": "4.0", "Content": "Pretty nice. Only two things I don't like, both design issues. There are holes in the top with allen screws for adjusting angle. Their location makes them perfect water and dirt collectors. Also, the hex shaped holes for bolts are too small. Image quality is nice, seems pretty sturdy.", "Date": "October 28, 2013"}, {"Title": "Great Value Product", "Author": "Nick Approved", "ReviewID": "RY6P3GRT1TCUQ", "Overall": "5.0", "Content": "I looked over a few other products and liked that this one consisted of a black metal frame and the camera was built in.  The device was fairly easy to install once I was able to run the wires to the head unit and the appropriate connection points. So far it seems like it's a great value for the money.  The image quality is great and the IR seems to illuminate rather well in the night hours.  Will see how it holds up through snow, but seems to handle rain without issue.", "Date": "October 18, 2013"}, {"Title": "Best back up camera for the money", "Author": "jbr23", "ReviewID": "RDFVZ8KKVLZB8", "Overall": "5.0", "Content": "I bought this camera based on the customer reviews primarily, and the affordable price.  I have had it installed on my truck for a few weeks now and I have been really happy with it.  I hooked it up to a pioneer deck and wired it to a switch so I can turn the camera on and off manually as I wanted to be able to have it on while plowing snow without the truck being in reverse.  The night vision is also good.  I would highly recommend this camera, solid construction and easy to install.", "Date": "October 16, 2013"}, {"Title": "Received quickly & is as advertised. Works very well.", "Author": "Warren Edwards", "ReviewID": "R14OPLXDBJKDYE", "Overall": "4.0", "Content": "I WOULD RATE IT AT 5 STARS IF THE WIRING INSTRUCTIONS HAD BEEN BETTER.THE WIRE COLORS AND PIN LOCATIONS GIVEN FOR INSTALLATION IN THE 2008 AVALON WERE VERY DIFFERENT FROM THOSE ACTUALLY IN THE CAR.  THUS, SOME EXTRA TIME REQUIRED TO MAKE THE PROPER CONNECTIONS WHICH LED TO FRUSTRATION.", "Date": "October 9, 2013"}, {"Title": "would recommend", "Author": "john", "ReviewID": "RL8JVBF6KQKSW", "Overall": "5.0", "Content": "THIS IS A VERY GOOD PRODUCT VERY EASY TO INSTALL AND WORKS GREAT.  I RECEIVED THIS ITEM VERY QUICKLY. WOULD RECOMMEND AGAIN.", "Date": "October 8, 2013"}, {"Title": "Dead on Arrival", "Author": "Boston Bill \"Bill\"", "ReviewID": "R38HHIN6JITAVR", "Overall": "2.0", "Content": "I ordered a new backup camera so I could replace my old one (a Boyo from 2008) so I could get better details, ir lights and guide lines. When I received the product, it looked very well made. The license plate bracket was metal and very well built and cables were high quality. However, when I hooked it up, the video camera was dead (should have tested before I did all the wiring!). Troubleshooting included direct connection to head unit and a monitor. My old camera worked with both of these units so I knew the camera was dead. The unit was getting power (IR lights worked in dark) but no video signal. If the camera would not have been DOA, it would have rated a  4 or 5. I would have given a 1 but for its quality I gave it a 2. I have returned it and when I get credit, I may order a new one to see if it was just bad luck. If I do and it works I will update my comments..", "Date": "October 2, 2013"}, {"Title": "Very good camera!", "Author": "Harry K", "ReviewID": "R434E3VTUJR1Z", "Overall": "5.0", "Content": "I was surprised at how good the clarity was on this camera.  I mainly use it to hook up my trailer.  I can easily see my trailer ball and stop in time so all I have to do is lower the jack.", "Date": "September 24, 2013"}, {"Title": "Good Buy", "Author": "Dashae Mariano", "ReviewID": "R6ZSVE9K13DH2", "Overall": "5.0", "Content": "i bought the 15$ license plate camera and it lasted til the first rain storm the taotronics camera has not given me any problems its a great product", "Date": "September 21, 2013"}, {"Title": "back up camera initial rewiev", "Author": "Sookram Ramsaroop", "ReviewID": "R25CZQZ6I6RKAI", "Overall": "3.0", "Content": "Camera picture quality is decent,grid lines are not accurate at all,lots of glare when raining from others headlights,night vision is decent,no hardware supplied to mount frame,only mounted a few weeks so don't have any feedback on reliability as of yet.", "Date": "September 15, 2013"}, {"Title": "As advertized", "Author": "erik hamilton", "ReviewID": "R1CW2UKPCWGT2S", "Overall": "4.0", "Content": "Easy install, just enough cable for a full size extended cab truck.  Picture quality is pretty good. The frame is quality.", "Date": "September 9, 2013"}, {"Title": "Very good image, very useful!", "Author": "Marshall Taylor", "ReviewID": "R1CPO2IWRFTS1W", "Overall": "4.0", "Content": "This has made backing up my 2005 Toyota Sienna much easier and less stressful.  It would earn five stars if I could pivot the camera vertically through, say, 90 degrees.  However, it is still an excellent device!  As others have mentioned, the frame is really nice cast aluminum with a clean paint job.  Mounting it was a cinch.  It has been running reliably since I bought it ~4 months ago.  FWIW, I park my car outside, so it's hit pretty hard by the elements.  This was a great purchase, especially for living in the big city (SF, CA).", "Date": "September 5, 2013"}, {"Title": "IT ROCKS", "Author": "mhg", "ReviewID": "RZUMKA4IPE2F7", "Overall": "5.0", "Content": "Finally got it installed buy car audio  place where i live and i just love it great product for the price", "Date": "August 30, 2013"}, {"Title": "AMAZING!!", "Author": "Leslie Mayeux", "ReviewID": "R1B1P4ZH6XCAR8", "Overall": "5.0", "Content": "As the person always having to direct the driver; this equipment is amazing!! Saves a lot of time and very easy to install.", "Date": "August 29, 2013"}, {"Title": "Great width of view", "Author": "Josh Holmes", "ReviewID": "R3HYPC8H6COOQA", "Overall": "5.0", "Content": "Looks almost OEM and can see the ground a few inches behind my bumper. I wish it also had radar but as a camera, it's outstanding.", "Date": "August 29, 2013"}, {"Title": "good for the cost", "Author": "Kerry Adams", "ReviewID": "RFHKR4SAL3409", "Overall": "4.0", "Content": "For the $ it is awesome. Wish it had a little better connections and cable quality.I like the quality of the build materials.", "Date": "August 27, 2013"}, {"Title": "Works great", "Author": "J. Monroe \"Fusion\"", "ReviewID": "R1C11F05OSYCD9", "Overall": "5.0", "Content": "This works great on my car.  The night time LEDs make the image show up well when it is pitch black, This is definitely worth the money and was remarkably easy to install.  The green, yellow and red lines give a good reference of distance when backing up.", "Date": "August 26, 2013"}, {"Title": "Great camera", "Author": "David Biemer", "ReviewID": "R36IOC2VFBPZG", "Overall": "5.0", "Content": "I have installed this camera and frame on my 2006 Jeep Commander. I like the solid metal and it seems well built... Time will tell, but it does not look flimsy. I like that you can adjust the viewing angle of the camera to account for different vehicle heights. On the commander, the frame sits very close to the hatch handle and I will need to make a lowering bracket to get more space for fingers.All in all, it does not look cheap and took less that 1 hour to set up in my vehicle.Disclaimer... I already had a head unit which accepts a rear view camera.", "Date": "August 25, 2013"}, {"Title": "Good Value", "Author": "Steven Ford", "ReviewID": "R28M518XQEYI6Q", "Overall": "5.0", "Content": "Not as good as factory units, but a great way to add-on to vehicle at a good price and easy hookup.", "Date": "August 17, 2013"}, {"Title": "Colors and brightness leave something to be desired.", "Author": "Slyder", "ReviewID": "R2CMW1HNK8RF24", "Overall": "3.0", "Content": "Have this unit hooked up to a high end Video Pioneer Receiver, I have tried altering the appearance of the video in every way possible, but, it still seems a bit to dark to use well.  For a Camera that was supposed to be infrared capable, I'm not so sure thats true.", "Date": "August 6, 2013"}, {"Title": "Great aftermarket reverse camera", "Author": "AMP", "ReviewID": "R2J5XSRTD0JBB5", "Overall": "5.0", "Content": "Amazing value for the price (I bought mine on sale, admittedly).  I was so impressed with this unit that I installed a second one on a friend's car.  The camera is very clear and the angle is adjustable up and down.  The frame itself looks sharp, and is extremely sturdy.Installed on a 2006 Subaru WRX wagon by routing above the bumper frame and drilling through the rubber spare tire well drain plug, and in a 2009 Dodge Challenger by routing through the hidden trunk vents with zero cutting whatsoever.  Wiring/trim disassembly will take some guts if you are not used to doing stereos, but that's true of any camera install.  Feds a crystal clear video signal to both my Pioneer, and her Alpine video head units without issue.Only possible areas of improvement for the kit:-Perhaps include black screw caps/covers to blend in with frame; I bought a 3rd party locking screw kit that came with caps, and it looks great.-Lead wires for power and ground could stand to be longer, and thicker gauge.  Stripping and splicing were very delicate operations to make sure they didn't snap.Again, amazing value overall.  I'd recommend this again in heartbeat.", "Date": "July 30, 2013"}, {"Title": "works great, really waterproof", "Author": "M. Tucker \"mtucker\"", "ReviewID": "RAJ0A3M5C40BI", "Overall": "5.0", "Content": "I bought this license plate/ backup camera based on others reviews of really being waterproof.  Some of the reviewers of the cheaper backup cameras complained about water getting in the lens.It bolted right on and works great.  I have only had it for a few weeks, but it has been through the car wash twice and there was no sign of moisture in the lens.The supplied composite video cable and reverse trigger wire were both plenty long to reach my radio (1st gen double cab Tacoma truck).  The license plate frame seems sturdy and strong.", "Date": "July 30, 2013"}, {"Title": "works great!", "Author": "richard bailey", "ReviewID": "RFTMFRFW1LONW", "Overall": "5.0", "Content": "works great! pic is clear even after rain and dirt and sitting in the heat no probs. great back up cam", "Date": "July 27, 2013"}, {"Title": "rearview camera", "Author": "Robert A Hingle", "ReviewID": "RAN5JEQK3O1TO", "Overall": "5.0", "Content": "this is a great rearview camera, I have used it for several months with no issues of water leakage, friends have bought the cheaper 15 dollar cameras and they all leak water into the camera rendering them useless, so far so good with this one", "Date": "July 22, 2013"}, {"Title": "Great Product", "Author": "Jose Pinochet", "ReviewID": "RCPETDL238O5E", "Overall": "5.0", "Content": "Good resolution and perfect night visión. when used the camera i feel comfortable. I recommend it 100%, from chile!! !", "Date": "July 19, 2013"}, {"Title": "TaoTronics rearview camera", "Author": "JM", "ReviewID": "R1AL9SP79J8C7Y", "Overall": "4.0", "Content": "Installed on a Ford F150 last summer. so far so good, used in sub freezing and +90 degree  weather. even on rainy day it still gives a clear picture with no fogging. night vision is good.Install is pretty straight forward, hook up power to your reverse lights and run video cable to back ofindash dvd receiver.  mounting hardware could be a little better", "Date": "July 16, 2013"}, {"Title": "love it", "Author": "Drew", "ReviewID": "R1V48DL41P275T", "Overall": "5.0", "Content": "this is a very good product.  My wife has a fully loaded honda with  nav and back up camera and to be honest mines look better than hers.  very easy to install.", "Date": "July 15, 2013"}, {"Title": "Very useful.  Works great.", "Author": "Nuknuk", "ReviewID": "R3P7VKTDLWEJEU", "Overall": "4.0", "Content": "I have the black version of this, it replaced my stock license plate that came with the car.  The frame is soid heavy metal frame.  It doesn't come with screws but you just use the screws on your old license plate and it fits perfectly.  My DMV plate only has two holes on top so I have the choice to drill the extra two holes or not.The camera is waterproof and has night vision.  It can be directed up and down if you want to see more of the ground or more of the horizon.  Once you are satisfied with the angle of view,  use the small Allen key (included in the box - taped on the foam cushion) to tighten it permanently.There is a very short manual which gives you the specs and short description of the product, not a lot on installation procedure as it vary from car to car. Professional installer is recommended.  Powering it up and connecting the camera is the easy part, the more challenging part is removing the panels of your car's trunk or lid and fishing the wires.  By the way, this is a wired camera as opposed to a wireless camera setup.  My radio installer is recommending a wired system as it is more reliable.Camera gives you zones (guide) on the bottom of your monitor.  The red zone which is closer to the bottom of the screen is about a foot away from my bumper so I know when I am about to bump.  The green zone is still about three to five feet away. The zones are very helpful indeed.  Night vision works pretty well too,  you can see enough not the hit objects in the dark.Overall, very satisfied with the performance and quality of this backup camera.Sample item provided by the distributor for evaluation review.", "Date": "July 13, 2013"}, {"Title": "Very useful -  works great!", "Author": "Nuknuk", "ReviewID": "RTU3YS1288SF8", "Overall": "4.0", "Content": "This replaced my stock license plate that came with the car.  The frame is solid black heavy metal frame.  It doesn't come with screws but you just use the screws on your old license plate and it fits perfectly.  My DMV plate only has two holes on top so I have the choice to drill the extra two holes or not.The camera is waterproof and has night vision.  It can be directed up and down if you want to see more of the ground or more of the horizon.  Once you are satisfied with the angle of view,  use the small Allen key (included in the box - taped on the foam cushion) to tighten it permanently.There is a very short manual which gives you the specs and short description of the product, not a lot on installation procedure as it vary from car to car. Professional installer is recommended.  Powering it up and connecting the camera is the easy part, the more challenging part is removing the panels of your car's trunk or lid and fishing the wires.  By the way, this is a wired camera as opposed to a wireless camera setup.  My radio installer is recommending a wired system as it is more reliable.Camera gives you zones (guide) on the bottom of your monitor.  The red zone which is closer to the bottom of the screen is about a foot away from my bumper so I know when I am about to bump.  The green zone is still about three to five feet away. The zones are very helpful indeed.  Night vision works pretty well too,  you can see enough not the hit objects in the dark.Overall, very satisfied with the performance and quality of this backup camera.Sample item provided by the distributor for evaluation review.", "Date": "July 13, 2013"}, {"Title": "Camera installed on 2004 Pilot", "Author": "Kindle Customer", "ReviewID": "R1IWOD6UWJ6W0M", "Overall": "4.0", "Content": "The price was very good for this camera.  Installation was not very difficult.  I had to remove side panels to run the video cable from my alpine in dash dvd to the rear lift gate.  The cable was long enough.  I had to splice into reverse lights wire to connect power wire.  The picture quality was good, not great, during daylight.  The night vision was excellent with limited lighting.  However, for the price, it was more than worth it.", "Date": "July 11, 2013"}, {"Title": "Really nice-- totally does the job", "Author": "Darin", "ReviewID": "R2AIJFRA6EYM96", "Overall": "5.0", "Content": "Great job on a device that fits in with the truck.  I operate a service company, and purchased this so the techs who drive this truck could be safer.  It's been a week so far -- but geez, I want this on my own car.  Works really well.", "Date": "June 22, 2013"}, {"Title": "5 stars if power wires were better!", "Author": "Michael Zarek", "ReviewID": "RK6IXEK9LTWEA", "Overall": "4.0", "Content": "Good cam, well built, all metal.  Only gripe is that the power wires are a very small gauge and will not easily buddy clip to existing car wiring.  Had to splice a larger gauge wire to the end of them before I could make a good connection.  Other than that, good cam at a good price.", "Date": "June 16, 2013"}, {"Title": "Well Constructed", "Author": "Joseph D. Orndorff", "ReviewID": "R1U49OXH0I1I54", "Overall": "4.0", "Content": "Very nicely made camera and frame. Camera video quality is pretty good. Considering the price... I'm very pleased with the product overall.A couple of thinks I didn't like:1) The video cable was too short for my Crew Cab F150.2) Cables are very small gauge with small diameter jackets. You will need to be careful and provide strain relief as necessary.3) The cable can get pinched behind where the frame mounts to the car. I added some washers between the frame and my bumper so as not to squish my cables.", "Date": "June 13, 2013"}, {"Title": "Exceeded expectations", "Author": "dhamp", "ReviewID": "R3MSJGI0359PJS", "Overall": "5.0", "Content": "Worked as expected and is hardly noticeable.  The image on the head unit is as clear as my smartphone.  I wish the backup cam on my other car (factory) was this good.  Don't hesitate if you're on the fence.", "Date": "June 11, 2013"}, {"Title": "Great!!", "Author": "kimmarc723", "ReviewID": "R3UW27TI6BHDDQ", "Overall": "4.0", "Content": "Very nice license plate camera! I hooked it up with relative ease.  No instructions come with the camera, I had to figure out that you have to wire the the power cord to the left and right side backup lights for my 08 328i Coupe.  After that everything worked like a charm. Nice camera with a nice color view in the daytime and nightime view was very good with infrared.  I am totally happy with the camera.  Backup lines are very helpful when trying to back into tight spaces.  Definitely a good buy and worth the money.", "Date": "June 6, 2013"}, {"Title": "Awesome", "Author": "BT \"BT\"", "ReviewID": "R3GQVTH47QIQKM", "Overall": "5.0", "Content": "Product is awesome so far! Pretty easy install. Hardest part is finding a way to route the wires inside the car.Product came with sufficient RCA Video wire to fit a Ford Expedition. Even mounted monitor (bought separately) on windshield, on top of rear view mirror. Used the red remote wire that came pre-connected with the RCA cable as the power wire for both camera and monitor.  Spliced them to the rear reverse light. Worked like a charm! Hope it lasts...", "Date": "June 1, 2013"}, {"Title": "Excellent Camera", "Author": "amazonuser", "ReviewID": "RBAJAV4CD92FX", "Overall": "5.0", "Content": "This is an excellent product and easy to install.  This is my 2nd camera, first one bought a week ago and damaged the wire during installation.  It was purely my mistake, but learnt the process.  Please take your time to think through, before modifying anything in the product itself.", "Date": "June 1, 2013"}, {"Title": "came up just a inch short.on the with of the view angle need a little bit wider", "Author": "M. H. jones \"TEAM(SOLO)\"", "ReviewID": "R36B3DL9C9E4Y4", "Overall": "4.0", "Content": "The camera works well its nice and bright in dark areas the distence lines do help the actual closest line to your car or suv is like 5ft away from your bumper..over all its worth what you pay.i would do it again.thanx.bouncehousepartyrentalsdmv.com", "Date": "May 30, 2013"}, {"Title": "best bang for your buck", "Author": "txbest1980", "ReviewID": "RRSQGQX7BCSCU", "Overall": "5.0", "Content": "camera and mounting fits perfectly.  camera is extremely clear, even on a cheap head unit...definitely the best bang for your buck", "Date": "May 30, 2013"}, {"Title": "It works fine", "Author": "Amazon Customer", "ReviewID": "R2AXHAW6UV30LI", "Overall": "5.0", "Content": "It works fine. I have no complaints. I have it connected to my Pioneer AVH-X3500BHS 2-DIN Multimedia DVD Receiver with 6.1 WVGA", "Date": "May 25, 2013"}, {"Title": "Too cool!", "Author": "Jesus", "ReviewID": "RNI06F3TDP6G0", "Overall": "5.0", "Content": "Installed this to work with my pioneer avh 5500 bus double din looks real nice. Very solid And nice camera", "Date": "May 15, 2013"}, {"Title": "Best back up camera for the money", "Author": "Van Balam", "ReviewID": "R28D3UMJGIYO39", "Overall": "5.0", "Content": "I've had a few back up cameras and this one is by far the best I've had. Installation was simple and the frame looks great on my truck. Very durable.", "Date": "May 15, 2013"}, {"Title": "Great Backup Carmera", "Author": "MSwale", "ReviewID": "R19NP9ZE079L58", "Overall": "4.0", "Content": "I purchased this for 03 Toyota Celica -It works great the color looks good and it had done wonders while backing up to know I'm not going to hit something. However, when it rains it is useless - but at least it's waterproof to not break!", "Date": "May 12, 2013"}, {"Title": "Solid Backup Camera- especially for the cost!", "Author": "Travis Stetzel", "ReviewID": "R2V34SM4WGESGJ", "Overall": "5.0", "Content": "Just had this installed and it has a nice picture, the green & yellow lines are helpful and the picture is even decent at night. Connected it to a Pioneer AVHP-4400BH and the picture is nice, I can even turn the camera on when driving! Cool, but a little disorienting. Would purchase this again. Good seller too- my initial order was out of stock and their was some initial confusion but the seller had good lines of communication, responded quickly and handled the situation well and left me, the customer, happy. Why spend $100+ on a backup camera when this is a great solution for  $50!", "Date": "May 10, 2013"}, {"Title": "poor quality", "Author": "Patricia Belmont", "ReviewID": "R36IM7QQR105W2", "Overall": "1.0", "Content": "Had a poor picture and the adjusting screws striped out very first time, it was hard to adjust.I wouldn't by again", "Date": "May 18, 2013"}, {"Title": "Broken on arrival", "Author": "Piper", "ReviewID": "R15ETZT7UUPCZ3", "Overall": "1.0", "Content": "The camera I received could not produce a useable image.  The picture was washed out and gray, with no color except the alignment overlay.  Screws that hold camera in position broke while diagnosing picture.", "Date": "June 20, 2013"}, {"Title": "Differant opinion", "Author": "rick", "ReviewID": "R38IDQV5GKCX8", "Overall": "3.0", "Content": "Camera works good, color is good , installs easy. BUT the view is smaller than they say can't see ends of your bumper. This was the reason I paid this much but didn't get what I wanted or what was advertised", "Date": "April 5, 2013"}, {"Title": "Worth the price", "Author": "Carl Bowman", "ReviewID": "R33VSA5OF2LLKG", "Overall": "5.0", "Content": "This camera works exactly as expected. For the price, it's a great bargain. The colored lines superimposed on the display are handy. It is pretty light sensitive, even when my eyes are seeing that it's dusk and almost getting dark, the image looks almost like daylight. Even the camera's \"night vision\" is semi-decent with the IR LED's. Although the angles of the LED's themselves should be adjustable. They cast their light in a fairly narrow band. It would be nice to be able to adjust them to a specific need BUT, I'm still very satisfied with the results.Installation on pickups can be a challenge unless your a seasoned DIY'er. You bave to thread the cable along the frame up to the cab somewhere. Newer trucks don't provide nice places to thread the video feed cable through. You might need to drill a hole. I went through a plastic plug where a clutch peddle would have been on  the firewall AND the supplied cable isn't long enough for full sized trucks. You will have to extend it.", "Date": "April 21, 2014"}, {"Title": "Trouble with Hookup to Rand McNally RVND 7720 GPS", "Author": "Amazon Customer", "ReviewID": "R2RM0D1RVFXEDC", "Overall": "4.0", "Content": "The camera works great but I had to order a \"RCA female to 2.5mm video wire\" from DieselBoss.com in order to hook it up to my Rand McNally RVND 7720 GPS.  It cost me another $15.00 to order and ship it.  It would have been nice had they included this item in the package.", "Date": "February 13, 2014"}, {"Title": "Pretty good", "Author": "Dom", "ReviewID": "R4AAXEAYVUD6H", "Overall": "3.0", "Content": "UPDATE 2/28/14.After using this product for a few more weeks, the chrome/metal of the license plate frame and the camera's housing unit has these blotches which I am guessing is a result of the salt that they spread on the highways for snow/ice. I take my gf's car for a car wash routinely to prevent salt eating into her car's paint (and I would imagine this item too), but they are there! I tried rubbing them off with wet towels and windex, but did not improve much. Does not look great.I am not dropping to two stars because the camera is still very capable and works fine (see my earlier review). But I will drop it to 3 stars.=========================================Only had for a few weeks on my gf's car. Looks great so far. Gone through snow and a car wash without a problem. It does what it's supposed to to do -- give a fairly clear picture when I back up. It turns on quickly on her 2007 Acura TSX. Not a fan of the lines (green, green, yellow, red), but I am not going to take off a star for that since that's personal taste. I have no problems backing up at night; although I did adjust the settings on my navigation/GPS screen to make it more visible.", "Date": "January 28, 2014"}, {"Title": "Nice Unit", "Author": "Barry Creighton", "ReviewID": "R14FQBCFRNCIIG", "Overall": "4.0", "Content": "This is a nice unit that after a month or so with rain and freezing weather seems to be holding up nicely.The positives:You can see in the dark and rain.Pretty decent view (about 170 degrees) panoramaThe negatives:The camera sticks out and is bulky enough on my 4 runner that it makes it difficult to squeeze my fingers between it and the door release.If you are backing up into a sunrise, it washes it out a tad, but you still can see.  This is a very minor gripe.", "Date": "January 25, 2014"}, {"Title": "Works great", "Author": "Ralph Wood", "ReviewID": "R1O93Q9M8TFVGY", "Overall": "5.0", "Content": "I bought this at Amazon. Shipped promptly. Upon receiving it I discovered the set screws for the swivel camera were missing. Contacted them and the sent the replacements quickly. Installed easily and working fine.", "Date": "January 24, 2014"}, {"Title": "As good as you would expect for price, not better.", "Author": "Deryl B", "ReviewID": "RBXJCTCE9H4K4", "Overall": "3.0", "Content": "I actually got what I expected for the price, but not what I expected per the review and ratings. Installation was simple since all you have to mount is the license plate frame which the camera is attached. The wiring provided was not long enough for a pickup, so you will need an extension. But that was not much additional cost or effort. The frame and camera are sturdy material. Picture quality is average if not slightly below. Don't need HD quality to backup so really no reason to spend more.", "Date": "October 7, 2013"}, {"Title": "excellent customer service", "Author": "Brice", "ReviewID": "R219AHLPARQIZ6", "Overall": "5.0", "Content": "update:This company has excellent customer service even after the sale.  I get disappointed these days when a company does not stand behind their products.  Fortunately there are businesses like this one which goes beyond what is expected.  I will look for more products from this seller.  Thank you.The company has sent a replacement.I hooked it up and it works but the resolution is terrible.  The picture has a washed out faded and near black and white appearance.  Hopefully I will be able to correct the issue by installing a shielded video cable.  As far as just being able to use it as a safety measure while backing up I suppose it is borderline acceptable.I have installed many cameras so I know a little about the subject.  I hope that I will be able to post an update saying that the problem has been corrected.  As of right now I am not too happy with the purchase. If I had paid half the price I might have expected this but that is not the case.Stay tuned.", "Date": "May 13, 2013"}, {"Title": "Great Product", "Author": "Elton Pettaway", "ReviewID": "R1FYHKCB73QV5D", "Overall": "4.0", "Content": "This product turned out to be better than I thought. It works great. I haven't had any problems and it has been through rain and snow storms. I would recommend it to a friend.", "Date": "May 6, 2013"}, {"Title": "Nice camera", "Author": "Marlins Fan", "ReviewID": "R2GPND1QJMZ3AP", "Overall": "5.0", "Content": "What a nice camera for $50. The installation was easy. The product description says to connect one wire to Positive, the other to Negative. The printed instructions says to connect the other to Ground.... I connected to Negative and worked great.Just find the reverse light bulb in the back of your car, and tap into those wires to power the unit.The RCA cable is long enough. I cut the head off so I could snake it thru the rubber between the rear cargo door of my 2007 FJ Cruiser and the main body, then I patched the head back in. The wires inside are very thin, but they are holding for now.The camera has nice clear picture both in day and night. The gridlines for me are worthless because I have this aimed down enough so I can see the edge of my bumper, so the gridliness are pointing into the pavement behind my truck. I didn't buy this camera to see 50 feet behind me, I bought to see right behind my car so I don't back into my kids!I bought these bolts to go along with it so nobody can steal this camera from my car:http://www.amazon.com/gp/product/B00032KC2G/?tag=5336116720-20", "Date": "May 3, 2013"}, {"Title": "Great back up camera", "Author": "Cheeta-eh", "ReviewID": "R1NPIRMAR7SJ5T", "Overall": "5.0", "Content": "I had mine installed 4 months ago in my 2006 Highlander and this thing works really well. I opted for Taotronics because of the price compared to Pioneer that would cost me $199. I took a gamble because I never heard of this product but so far I have no complains about it. I would definitely recommend this product.", "Date": "April 2, 2013"}, {"Title": "Tao Tronics Backup Camera", "Author": "walleye", "ReviewID": "R1Y4ZX1R99ORYZ", "Overall": "4.0", "Content": "The camera has worked fine so far. The only thing I can say is the picture is not all that great it is good enough for backing up and stuff but it also could be me not setting up my setting right on my radio.  For the money you cant go wrong.", "Date": "February 25, 2013"}, {"Title": "It works as advertised!", "Author": "Al Del Vecchio \"Al Flyer\"", "ReviewID": "R144A00RJV18Z1", "Overall": "4.0", "Content": "Very waterproof. I live in the northwest and it rains everyday. Never had a problem with water. Also, very easy installation.  Only cons would be that the video quality could be a little higher, and it is still hard to determine how close you are to an object.", "Date": "January 28, 2013"}, {"Title": "great camera for the money.", "Author": "dmo", "ReviewID": "R3LIZNEDFT2PQP", "Overall": "4.0", "Content": "I installed this on my 2002 ford excursion and it works very well.  I like the gridlines in the video image that lets you know how close you are getting.  I drove it through a car wash and it had no problems with water getting in it.  I gave it 4 stars because I wish the wires were a little thicker gauge.  I wired the power wire to the reverse power wire located in my factory tow hitch.  It works really well with my pioneer appradio2.  Video automatically turns on when i put it in reverse.", "Date": "February 3, 2013"}, {"Title": "REVERSE", "Author": "Eric Grigsby", "ReviewID": "R2KI7FF944QMS7", "Overall": "5.0", "Content": "If you played UNO you know about REVERSE!If you upgrade the radio you don't have to upgrade the car!Reverse camera's are the easiest and coolest way to makeyour car brand new.Now the question is: to DVR or NOT DVR?", "Date": "March 31, 2014"}, {"Title": "So far, so good", "Author": "D. Hall \"bgpicker\"", "ReviewID": "R2KR44VPHOIVTR", "Overall": "4.0", "Content": "I purchased this to go with a Kenwood DDX371 2-din DVD player. Added to a 2005 Silverado Crew Cab. There was actually enough wiring to reach all the way to the indash unit, but not enough to extend if removing the unit, so I had to connect an additional length of wire to accomplish this (but less than 10\" of wire). It's a CMOS camera lens so the view is not as clear as what I imagine a CCD lens would be. Construction is fairly sturdy and was easy to connect to rear lighting. I like the grid lines and I think it will be helpful when I'm hooking up my trailer to the hitch ball. Overall at this time I'm satisified, but I've only had the product for less than a month, so only time will tell. But for the present time I've given it 4 stars.", "Date": "March 1, 2014"}, {"Title": "Great product", "Author": "Shelle Belle", "ReviewID": "R36LKVSIEXBH4L", "Overall": "5.0", "Content": "Bought for boyfriend's birthday and he is so happy with it. Works great and hooked right into his head unit on his stereo. Makes backing up so much more convenient.", "Date": "February 23, 2014"}, {"Title": "Better than most but flickers and overpriced.", "Author": "Pioneer", "ReviewID": "R13BGO4Q1CJTA1", "Overall": "3.0", "Content": "Connecting it to my screen was easy. I was expecting it to be of superior quality considering the price but it wasn't that impressive after all.The camera flickers a lot and that over shadows its decent sensor for colors during daytime. It's terrible during nighttime but again, almost all cameras are.The manufacturer should fix the flickering problem or lower their prices.", "Date": "February 8, 2014"}, {"Title": "Built Well, does the job", "Author": "Blake", "ReviewID": "R3J0H918T2CQFV", "Overall": "4.0", "Content": "This works pretty well, this is the only rear cam i have had so i cant compare quality. I will say that mine is constantly powered on and hasn't died yet. (it is winter though so in the hot summer it may not be able to handle it).I will update if it dies.", "Date": "January 23, 2014"}, {"Title": "Not worth the money", "Author": "Woodrow W.", "ReviewID": "R3PZQBYGC3JOR9", "Overall": "3.0", "Content": "It was good while it worked I went through the car was twice and it has never worked again not worth the money", "Date": "January 17, 2014"}, {"Title": "poor instructions", "Author": "Sandra", "ReviewID": "R1A6UAQ633ZQ7H", "Overall": "2.0", "Content": "Tested camara to battery picture came on screen. Hooked up to back up lights and didn't work. Ran cable to hook up to battery still wont work.", "Date": "January 1, 2014"}, {"Title": "Beware of license plate light location!", "Author": "Kevin Rickard", "ReviewID": "R14V2F08QR7G2N", "Overall": "2.0", "Content": "I installed this product without a problem and it does work, but since my license plate light is directly above the camera, it causes severe glare at night making it pretty much unusable.", "Date": "December 30, 2013"}, {"Title": "Much better than the $15 one it replaced.", "Author": "C. Dissmore", "ReviewID": "R2XLJ6SRRAFOD0", "Overall": "4.0", "Content": "Much better build quality. The $15 one I got here on Amazon worked okay at first, but had an issue with getting fogged from moisture from car washes. I see others have reported that as well. It just quit working completely one day about 11 months into ownership. Got this one to replace it. Really crisp, better picture, better night performance, quite a lot better build quality. No issues with fogging or leakage at car wash. Trusting it will last longer, but it's only been installed a month so time will tell on that.", "Date": "December 19, 2013"}, {"Title": "Big camera module", "Author": "Eric", "ReviewID": "R286FRNL070TF9", "Overall": "3.0", "Content": "I thought the camera would be smaller... it is quite large and looks obviously aftermarket. Also, the viewing angle is only about 120 degrees or so. The night vision does work quite well, though, and installation is easy since it only has to mounted on your license plate.", "Date": "November 14, 2013"}, {"Title": "Grid lines disappeared after a month!", "Author": "B. Steineckert \"B\"", "ReviewID": "R1G7NZWVJPP0JN", "Overall": "2.0", "Content": "Was loving this little camera until the grid lines crapped out on me for no apparent reason.  One day, they were there, next day, gone (right about the time I was getting used to them).  I tried unplugging the car battery to \"reset\" it and no go.  It's connected to a pioneer AVH-X3500BHS.  I keep hoping they'll magically come back the way they magically disappeared...", "Date": "October 1, 2013"}, {"Title": "Pioneer Avic-920BT rear camera addition", "Author": "Leo", "ReviewID": "RZGUDR00IBK2L", "Overall": "4.0", "Content": "The unit was a relatively easy install onto a Lexus LS400. Once I determined how to unsnap moldings, the installation went well with one exception. The supplied wire that come with the unit, is at an unreasonable gauge to properly connect it mechanically.  I used a squeeze connector to join reverse gear lamp wire and the camera wire which I can only estimate is a 30/32 gauge wire (which is extremely smaller than the 24awg wire that came on the car) made this project unnecessarily difficult. My connections were intermittent because the wire is too small to make a proper connection. Nevertheless, once this obsticle was overcome, the unit provided an excellent view of the rear surroundings.  I am satisfied with its performance and rear view clarity.", "Date": "June 20, 2013"}, {"Title": "Works great. Put it on my F150 helped me out backing up and hooking up to my trailer.Color is good also night vision is great.", "Author": "Gary", "ReviewID": "R4CH426Z4JB1Y", "Overall": "5.0", "Content": "Works great. Put it on my F150 helped me out backing up and hooking up to my trailer.Color is good also night vision is great.", "Date": "June 8, 2013"}, {"Title": "Not what I expected", "Author": "jj", "ReviewID": "R20PGALCRY6TC6", "Overall": "1.0", "Content": "I had this professionally put on my Jeep wrangler. However the installer told me that the product is a defective product and that I need to send it back and either get a different one or my money back. He then showed me how everything was getting power and showed me why he feels it is in the camera part of the product that is defective. The wires and lines all have power however the camera itself does not work, he told me that the wires I so thin inside the cameras that they sometimes malfunction. I am returning this item depending on how that goes and the new one I get if I change y feelings and experience with this product. right now I am highly unsatisfied. I had to pay the professional for the work even though the product I bought did not work. inside the instructions and the company that supplies this product made sure to add to get a professional to do this. so I paid for a product and I paid for a professional to tell me that this product does not work.", "Date": "September 11, 2013"}, {"Title": "reverse camera", "Author": "Lynda B.", "ReviewID": "R2PH8ULZ777REO", "Overall": "1.0", "Content": "Can't get it to work ,it gets power but doesn't come on. I've hooked DVD players before its three wires ,should work but doesn't", "Date": "April 25, 2014"}, {"Title": "Nice", "Author": "Lindsey C Hollins", "ReviewID": "RC30L3HDER0OG", "Overall": "3.0", "Content": "I like the design over the license plate, and it blends in with my vechile. Really don't like the cloudiness within the camera when in reverse. I have a nine inch radio display/faceplate.", "Date": "April 11, 2013"}, {"Title": "JUNK", "Author": "BoatSurgeon/Richard Kurthy", "ReviewID": "R2VUH2APV0L7N6", "Overall": "1.0", "Content": "I received this camera and it dident work from the day I opened it up out of the package... I wouldent get this again", "Date": "May 27, 2013"}, {"Title": "License plate camera", "Author": "Byron S.", "ReviewID": "R36NMOGVY44RAH", "Overall": "1.0", "Content": "The trunk on the 2003 BMW has a release button in the handle and the camera is positioned right under the trunk release and is causing the camera to be used to lift the trunk which is not good for the product.", "Date": "March 27, 2014"}, {"Title": "does not intergrate with 2000 ford", "Author": "Fred Oven", "ReviewID": "R2K1RIEU2WEZOQ", "Overall": "1.0", "Content": "Does not work with back-up mirror as stated.It comes with wrong ends cannot connect.I wish THE PEOPLE WHO WRITE THE DESCRIPTIONS would know something  about what they are writing about.", "Date": "March 18, 2014"}, {"Title": "False advertising", "Author": "Mike", "ReviewID": "R2TJ39QBQM33K5", "Overall": "1.0", "Content": "I will never give you my business again.  I purchased this only to find out items pictured were not included.  It should have been a holiday gift for someone and instead it was a waste of my time and money.", "Date": "January 6, 2014"}, {"Title": "misleading", "Author": "Cheryl Carroll \"truckerbabe\"", "ReviewID": "R3CQVFWQD6QPSA", "Overall": "3.0", "Content": "was a gift but due to the info was misinforming. there is no monitor so this was really not a good buy", "Date": "February 22, 2014"}, {"Title": "Chevy Sonic's mylink monitor does not support this backup camera", "Author": "K. POON", "ReviewID": "R260WIAV1EXZJ7", "Overall": "1.0", "Content": "I took this product to Best buy store to be installed, and was told that it can't connect to Mylink monitor in my Sonic, I just spoke to a tech rep at Chevy and according to him, my Sonic's mylink does not support backup camera display.", "Date": "April 4, 2014"}, {"Title": "didn't include a needed part", "Author": "MommyC", "ReviewID": "R1O0R02R5PVTO8", "Overall": "2.0", "Content": "I wanted a back up camera on my 2013 Pathfinder that didn't come with it.  It's the back up camera but you ALSO NEEDsomething to see it on from inside the car.  This was misleading because I thought it included it.  Piece of junk sittingaround in my house. Traded in the Pathfinder with no bells and whistles for an Altima with a backup camera so I don'tneed it any more.  Junk.", "Date": "March 24, 2014"}, {"Title": "Monitor not included!", "Author": "Michael Dietz", "ReviewID": "R32KNXMMQZ76B1", "Overall": "2.0", "Content": "Note that while many rear-view camera systems come with some kind of monitor, this one doesn't and must be purchased separately.", "Date": "February 26, 2014"}], "ProductInfo": {"Price": "$89.99", "Features": "Quality zinc metal license mount camera frame with IP-67 grade waterproof & dustproof, works well in atrocious weather;\nHD Color CMOS (PC1030, 656*492) imager, with 8 infared LEDs, excellent night vision performance, provides safety reversing both in day & night;\nMacro camera lens with 170-Deg diagonal wide viewing, 120-Deg up and down tiltable, allows you to adjust it to best shooting angle;\nBuilt-in grid lines as a trapezoid electronic ruler, 3ft measured by every interval, keeps you much more secure while reversing;\nMounts easily on the license plate with the existing screws, ideal for most vehicles that use a standard U.S. or Canada license plate.", "Name": "TaoTronics Waterproof Color CMOS Car License Plate Frame Mount Rear View Backup Camera with 8 IR LED Night Vision (Silver)", "ImgURL": "http://ecx.images-amazon.com/images/I/41u0uUH%2BE3L._SX300_.jpg", "ProductID": "B00BV09428"}}