{"Reviews": [{"Title": "Pretty nice, but the image quality isn't fantastic.", "Author": "N. Glenn \"Glenn.\"", "ReviewID": "RBVFXOR3PR7PN", "Overall": "4.0", "Content": "Starting at the installation this Plug 'n View camera is simple to get started, we put ours in the corner of our children's room, then you simply search for the Plug 'n view app on the google play store or scan the QR code on the box. We also added the program to our PC by visiting the Diamond Multimedia site and downloading though the link they provide. The camera turns on when you open the app, the video quality is fair to good, it is grainy so if you were using this to get a description of someone there might be things you would be unable to distinguish. It works great for keeping an eye on the far side of our house, we busted more broken rules in one sleepover than you could ever imagine. The night vision is a neat feature that comes in handy, and I like that you can add more cameras and see them all on one screen in a grid pattern. These cameras can also be recorded and files saved on your devices.", "Date": "July 4, 2013"}, {"Title": "Okay, but expected a bit better based on description", "Author": "Careful shopper", "ReviewID": "R9ABO4QK0UL87", "Overall": "3.0", "Content": "Three Amazon stars for \"It's OK\" as I wasn't overly impressed with performance and resolution.  Price?  We all have our opinions on what is good, but if you intend on adding more cameras to this, be sure to check final costs involved first.Called a \"PLC\" powerline communications technologyThis little system works through your house wiring to connect to the camera and then sends signal to your router via Ethernet cable so you can view from WiFi linked phones, tablets or even computer.I mainly wanted this for viewing camera on 64bit Windows7 notebook and only had to download the Windows app from the Diamond web site to get it up and running.I'm sure it will be handy to be able to view the camera(s) when away from home if the need arises.The other phone apps for Android and iPad/phones are available on their site,  as well as PDF manual and user guide.  You might want to look at the PDF info for yourself.  You can also download the phone apps from Google Play and the App store at no charge.It's so hard to look at lower resolution picutres now that we are used to so much more video quality these days..The highest for this setup is 640 x 280 with two other resolution choices of 320 x 240 and 160 x 120.You can also assign settings of fine, better & best video quality to each size in order to tune it to what you need or like.At 640 x 280 and \"best\" quality picture setting the maximum frames per second I could get was about 12, reducing to \"fine\" setting gave me a max of 14 fPS  A bit choppy at about half of full motion frames, but okay.Lesser settings were not so good on my tests,  more FPS at lower quality settings and smaller picture but much harder to see details.320 x 240 set to \"best\" gave max of 19.23 frames per second / set to lowest \"fine\" gave pretty much the same160 x 120 set to \"best gave max of 23.50 frames per second / set to \"fine\" 24.25 fpsI'm guessing most people will not be able to pick up much detail in a scene at anything but the highest settings and then it might be tough to know what is going on without closer inspection of the actual area.  The very small display of most smartphones also limits what details you can actually see in the area viewed.Connection to the camera depends on the house circuit you plug the camera into it seems....  I had it from one end of the house to the other and in various outlets on different lines to test...  many you could not tell the difference, but some refused to even connect or were flawed connection.If you read the PDF info you'll see that it does matter what else is on that electrical outlet/line that you plug into.  You have to be careful and not just plug it in any and all outlets.  Since the video signal is sent over the 115v house wiring you don't want anything running on same that can cause electrical noise etc.You can add up to 7 camera units to the one power line adapter that comes with it and view one or all on screen at the same time.  Additional camera units retail for about $80 as of this date (not yet avail on Amazon).  Additional PLC adapters are priced about $50 Diamond Multimedia 500Mbps AV Powerline Ethernet Adapter Kit (HP500AV)Only wide angle lens setting and the IR night vision LEDs built in give a narrow 16 ft reach but it does make a very dark scene more viewable in limited light area.I've tested it various ways for about four hours now and have been up and down in my opinion of it's operation... It worked from the far end of the house plugged into an extension cord, but wouldn't work across the room plugged into a power strip etc. I don't hate it, but I don't love it either.  Has to only get the \"It's okay\" rating from me as it does work and does do what it's intended to do.If used to keep tabs on a baby or elderly person, you might want to use it in conjunction with a separate audio monitor also so you are alerted more to possible trouble that you'd need to see by full time viewing otherwise.I'll be happy to return with more info if it makes itself known to me with more use over time.", "Date": "June 25, 2013"}, {"Title": "Definitely useful, but not perfect.", "Author": "Fuzzbean", "ReviewID": "R2A2FD4GWEIJ86", "Overall": "3.0", "Content": "I got this camera, plus a D-Link DCS-933L at about the same time. These 2 products currently cost about the same, and generally fill the same role, so I'll compare them a bit in this review.This Diamond unit communicates with your router by means of your house's power wiring. It seems like an odd system in this age of wifi and Bluetooth, but it does work well enough. However you are not supposed to use extension cords or surge protectors... which are all I have available in my old house. It worked for me off a standard extension cord. The D-Link works by wifi, once you get it set up. Of course you need to plug the D-Link in too, but power strips are OK.This Diamond unit has no sound capability as far as I can determine. The D-Link does have sound.This Diamond offers recording capability if you download the software for Windows onto a desktop computer. I think for the D-Link you need to purchase a recorder or something.It appears that if you got a bunch of these Diamond cameras, you can view them all at once in a mosaic type view, making you feel important like a professional security guard. I'm not sure about the D-Link.Both cameras offer impressive infra-red night vision capabilities at indoor distances.One the plus side, this unit had far better video quality (though still pretty poor) when viewed over the internet from my PC at work. That mosaic view would be pretty awesome, assuming I had cameras to fill all those empty squares. The night vision was fine.On the negative side, the lack of sound, the need for extra outlets (which are lacking in my old house), and the lack of adequate instructions are big strikes. Without proper instructions, it was not clear to me if this camera was supposed to have sound or not, or if it even offered viewing over the internet from away from your home. Also it would be nice if they told folks you can adjust the focus by turning the lens, which is not marked or knurled in any way to indicate that function. Then when I went to download the software at work, I had assumed I'd be able to find the correct link on the Diamond website. Wrong! Their website was totally unhelpful, and I had to bring in the correct address on paper the next day. I'm not sure, but I'm suspicious the software slowed down my PC a bit.", "Date": "August 9, 2013"}, {"Title": "Better for night vision", "Author": "K. Swanson", "ReviewID": "RGG28FEB439C1", "Overall": "4.0", "Content": "This puppy is relatively easy to set up, needing two outlets and one or two app dls or a GR scan. The image is fair in the day and better at night, compared to similar cameras. It seems pretty well made of decent plastic, and the design is rather futuristic.If you need a simple monitor to watch your stuff or your kids or your teenagers, at night especially, and you've got a smartphone, this is a fairly-priced unit that will do what you need. We take stuff like this for granted now, but in the '80s or even '90s if someone said you could watch your kids playing or sleeping at home, or check that your pets are safe, etc, from a screen on your phone in a restaurant or hotel ten or even ten thousand miles away, you'd be looked at funny, and it would cost a fortune. But now we can do it for less than a c-note, in decent video quality, with little set-up. Pretty cool, all in all.", "Date": "July 27, 2013"}, {"Title": "Not as versatile as I'd like, but works okay", "Author": "Jennifer L. Rinehart", "ReviewID": "R3KZ28ZSO5SESZ", "Overall": "3.0", "Content": "Most people are raving about this camera because they are using it with their iPhones.But if you don't have an iPhone, keep looking, there are other kits that will be more to your liking.  Because of my lack of an iPhone (oddly, I just got one two days ago, so I may give this another try and then update the review if I like the camera more) I had to use the included link to the executable Windows program.  The program is outdated (like from the days of VCR's and answering machines) and has no documentation.By documentation, I mean there are minimal instructions and no built in help files.  I was able to get it to work by running the software with a lot of finagling and figuring it out by means of hunting around through my past experiences hooking up cameras.All in all, a bit of a disappointment, I was hoping to catch the wankers who keep spraypainting my carport.Update - Still using this with the PC, just a note, you have to leave the PC software running to report. This camera works through an extension cord but not a surge protector.  Not sure of what the range is and at least in our house, it needed to be on the same circuit breaker as the base, but this could just be weird wiring in our house.A nice feature of the camera is a motion detection feature, so you don't end up with hours of blank unmoving street view for example.  For the recording, pretty much continuously, it takes about 2GB per night (this is with camera on from about 9pm to 8am).  There is a way to look at the recorded footage in super fast motion, so it takes about five minutes to watch the entire night's events (use VLC);'oh, hello again, curious kitty who keeps hanging out on my porch.'This is not an outdoor camera, but we are using it outdoors anyways (tried placing it near a window, but glare of light on the window blinded the camera).  I don't have any need to record stuff indoors.  Because of the camera we caught a strange creepy person coming up to our house while we were out yesterday, they also visited the houses of two of our neighbors.  If not for the camera we wouldn't have known about this.  There are a lot of strange characters in our neighborhood and there have been a few incidents; nothing major, a crazy woman tried to break in while we were eating dinner, a man with dementia was wandering around our bridge, kids stealing wood from our woodpile, you know, ordinary disturbances, so this person was exactly what we wanted to see while we weren't home.The software allows for up to nine cameras to be in use, I can't even imagine that, but it might be cool to have another to watch our backyard, we might be able to catch the raccoons or the river otter who we've only gotten fleeting glimpses of.", "Date": "July 23, 2013"}, {"Title": "Difficult", "Author": "Ivy", "ReviewID": "R1ZGFSK29RQOEJ", "Overall": "3.0", "Content": "This did not impress me much.It gets an okay image in the dark, and a nice one in the light, but it is a bear to set up.You need two outlets, one where you want the device to be and the other by the router.  There is no wifi.  If you want the device right next to your router, you still need two outlets.  Neither one can be an extension cord, surge protector, whatever, they both must go directly into the wall.The software was a bit tricky to set up, and had a nasty tendency to crash my iPad until I got it working okay.It does a good job, but be aware of the setup troubles.", "Date": "July 12, 2013"}, {"Title": "Plug'n View : Guarding your assets", "Author": "J.E. Ocean \"The SilverPen Reviewer\"", "ReviewID": "ROLY9YRY0ZZFP", "Overall": "5.0", "Content": "Diamond Multimedia HP500CK Plug'n View Remote Home Monitoring Internet Night Vision Security Camera Kit for iPhone, iPad and Android Tablets was so easy to install: Literally plug it in, scan the code and add passwords and you are up and running in less than five minutes.The camera is not high definition, but images within 16 feet are clear. The shutter seems to click every five seconds so the quality is typical of this sort of camera. The major advantage to the Plug'n View is that you can see very clearly at night on your iPhone. That's great if you are traveling, just want to check in while you are out and about or if you are in your room and worried about activity around your home. You can literally check it any time of day or night from your smart phone. The casing is hard plastic and very sturdy. It has mounts so you can install it from the ceiling, on a wall or just about anywhere.Another feature of this device is that you can set it up to record through a computer. But a PC is not required for the Plug'n View to work. It's a good value for the money I give it five stars for ease of use, night vision ability. I would recommend this to anyone who wants to monitor the activity in their home.", "Date": "July 8, 2013"}, {"Title": "Performs well in even lighting, poorly in uneven lighting.", "Author": "Amy S.", "ReviewID": "RZNYRW4NTRM2U", "Overall": "3.0", "Content": "The good and the bad:GOOD* Setup is incredibly easy. It took me all of ten minutes to get the camera up and running. (Note: It says not to plug the adapter into a powerstrip, but I did and it works fine.)* iPhone app is so simple, a child could use it. Of course, this also means it's lacking some features.* Remote monitoring. I love being able to monitor the camera while I'm away from my home. Great feature.BAD* Camera quality is poor. I was hoping to put this in the foyer to get an image of people at my front door, but the quality isn't good enough to pick up faces through the front door glass.* Camera is thrown off by uneven lighting. I found the best place to locate the camera is in my front window, facing the door. I can essentially make out who is at the door (if it's someone I know). However, in the evenings when the porch light is on, the camera's optics don't know how to adjust and the image quality is poor.* Advanced features require a PC. These should be available via the iPhone app.OVERALLI think this is a great little tool, just don't expect too much from it. I'm merely using it to monitor who is at my front door when the doorbell rings (i.e., whether it's a neighbor or a solicitor). Because it requires even lighting to produce a good image, the camera is not  optimal for every space. Make sure your use case fits the camera's limitations.", "Date": "July 7, 2013"}, {"Title": "Camera actually works! Poor video, somewhat easy set-up.", "Author": "G. Matot \"GMS\"", "ReviewID": "R161FOII41D8E8", "Overall": "3.0", "Content": "It actually works. Yes, like most of the other reviews, the video picture quality is poor, almost blurry looking. It took about two hours to get it to work on my andriod phone, my IOS ipad, and my new Win-8 desktop but it does work.I was able to scan the QR-code on the bottom without ever having installed any code scanning software previously. All this does is rapidly input the cameras specific network address and name into the software, or you gotta do it by hand. This worked on both the LG android phone and the ipad. The Win8.0 desktop found the camera without any codes being scanned.And the weirdest part was that the local express delivery company, which rarely delivers on time or to the correct address, did deliver early and to the right place (On-Trac) which was the real show-stopper!This is not, repeat: NOT plug-n-play.There is no manual included and the ethernet cable supplied is rather short, so I used my own. Yes, like the instructions say, the receiver part, which plugs into your router should be plugged in the wall, not an outlet strip. I'm going to test mine next plugged into the UPS to see if it works.", "Date": "December 7, 2013"}], "ProductInfo": {"Price": "$99.99", "Features": "Access and monitor live video anytime, anywhere through your iPad, iPhone and Android smartphones or tablets Also Windows Notebooks & Desktops\nIR night vision up to 16 feet.\nEasy two step installation.\nNo PC required for installation.\nWall and ceiling mount accessories included", "Name": "Diamond Multimedia HP500CK Plug'n View Remote Home Monitoring Internet Night Vision Security Camera Kit for iPhone, iPad and Android Tablets (White)", "ImgURL": "http://ecx.images-amazon.com/images/I/31H2khRUhRL._SX300_.jpg", "ProductID": "B00C8FDKRU"}}