{"Reviews": [{"Title": "Great analog video security camera", "Author": "Art K. \"Art K.\"", "ReviewID": "R186HUHABBUS2X", "Overall": "5.0", "Content": "Excellent low-light, night-mode, good color, low noise. Don't believe the specs in certain places that say it has OSD - it doesn't. But doesn't need it, either. Field-of-view is wide, with typical fish-eye lens warping of straight lines near the edge of the field-of-view. Standard NTSC works with cheapo video-capture USB sticks (see my other reviews), and iSpy freeware on Windows.", "Date": "November 23, 2013"}, {"Title": "Great CCTV Cam", "Author": "Scott McPartland", "ReviewID": "R1RDR3IKO75KLJ", "Overall": "5.0", "Content": "I purchased two of these back in October and have one positioned out in front, and one in the back of my house. Both have been exposed to several heavy rain and snow events already, and both continue to work almost 3 months later. No issues with water getting inside the lens or the housing.", "Date": "December 25, 2013"}, {"Title": "Image Flicker", "Author": "Newcrow", "ReviewID": "R334HBPTVHIV92", "Overall": "3.0", "Content": "This is a good low-light/night vision camera for its price. It appears to be somewhat near the 700 lines resolution; close enough, I'd say. There are severe problems with fluorescent light sources that are not present in my other cameras. The cameras are set-up to utilise motion detection through the DVR. Unfortunately, I was forced to disable this camera's participation due to its fluorescent flickering. There is also SEVERE flickering and image instability just before daylight. By the way, there is NO sunlight directed on to this camera. Appears to flicker as the lighting changes quickly; same said for when dark clouds come about on a sunny day. On the plus side; the camera is white and practically disappears when mounted on white fascia. The night-vision is phenomenal. The wide-angle lens is a plus but also count on the dependency of a narrow view telephoto camera supplement to capture more close-up facial details. When all is said and done, for the price, you score a 700 line camera (or almost; close enough), I would recommend this camera and would probably purchase additional units until I upgrade to HD over coax. After all, for the price, this is a good day and night vision camera if you can deal with a few unfortunate details.", "Date": "January 14, 2014"}, {"Title": "Excellent product. Wide Angle. Good Night Vision", "Author": "Elvin Ayala", "ReviewID": "R1DFT14AKZKHMH", "Overall": "5.0", "Content": "Excellent product. Wide Angle. Good Night Vision. I bought this camera to replace the ones that came with my dvr. It is amazing the wide angle view for this camera. You might  replace two old cameras and use only one to cover a large area.", "Date": "December 16, 2013"}, {"Title": "ad on to a two cam. system.", "Author": "ROGER RAYMO", "ReviewID": "R2TDKEGQEJGNY5", "Overall": "5.0", "Content": "I added it to my Q.SEE security system a great help 2 day shipping was helpful and out preforms previous cameras, thanks.", "Date": "July 19, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00COAPZ2W"}}