{"Reviews": [{"Title": "Lowest quality of workmanship", "Author": "Syed M.", "ReviewID": "R247AV0ETV0DVO", "Overall": "1.0", "Content": "Please don't make the same mistake as I did. Do not buy this product. This company designed a product which shouldn't be out in the market, instead it should go through many many many more phases of redesigning and engineering, definitely more testing. The camera comes with a cheap wall mount, which can easily snap and drop the camera.  The NVR system itself is the worst made product out there. And one note to the  developers that worked on their softwares \"You should be fired\".Cons:Product is not designed for usability. The NVR system, doesn't have an HDMI output. Three out of four POE ports in the back stop functioning after 2 weeks. Playback video software is designed horribly. No software for Mac users, must have windows and top of that only Internet Explorer is the only browser that will allow local or remote viewing. Using the PC software, you cannot rewind, fast forward, or slow video recordings. Navigating through recorded video is a nightmare.Pros:Price is cheap, and affordable. Thats it!!!", "Date": "September 13, 2013"}, {"Title": "dont waste your money!!!", "Author": "Brent", "ReviewID": "R2OFG1FEENH9S8", "Overall": "1.0", "Content": "Had this for 6 months.  been out of service 3 times already.  more time at Zomdo repair than working. repair shop receives DVR, then sends back unrepaired-- more time lost.  Have a friend at work that bought the same item.  His has failed 3 times already also. Lost dvr twice, lost all cameras once- so far.  They apparently have no quality control other than the public testing the units for them.  Just talked to Zmodo, they may have to issue credit, as replacements may be out of stock--My lucky day!!  Wish me luck.", "Date": "January 14, 2014"}], "ProductInfo": {"Price": "$682.14", "Features": "4 Channel 720P Network Video Recorder w/PoE Power Switch &4 Indoor Outdoor HD Network IP Cameras\nThis system allows you to view your footage, no matter the time or location. Access your DVR's footage over the internet, or directly from your AndroidTM, or iPhone® smartphone. or your PC.\nWeatherproof Housing Cameras：These IP66-rated cameras can withstand extreme wind, dust, and rain. These cameras are suitable for outdoor use, even in rugged climates.\n720P and QVGA Dual Stream Video Quality Selectable: Dual Stream Network Transmission allows the Cameras to transmit steady fluid image and higher resolution video.\nPackage included: 1) 4 Channel Security NVR With No HD(ZMD-NH-SAE4); 4)720p Bullet IP Network Camera(ZMD-ISS-BVS23EM);  1)12V 3A Power Adapter for NVR;  1) 48V 1A Power Adapter for NVR to Provide Power to IPC;  4) 18M(60ft) Network Cables; 1) 1M Network Cable; 1) IR Remote Controller & Mouse; 1) Software CD; 1) Quick User Guide", "Name": "Zmodo Wireless 4CH Security Surveillance Network DVR w/PoE Power Switch 4 x720P Indoor/Outdoor Day/Night IP Cameras No Hard Drive", "ImgURL": "http://ecx.images-amazon.com/images/I/41JE8p3TzQL._SY300_.jpg", "ProductID": "B00CQ0RQLS"}}