{"Reviews": [{"Title": "I'll bet it would have been great if it ever worked.", "Author": "wtmh", "ReviewID": "RUSR7CMA6I9LG", "Overall": "2.0", "Content": "It's been a couple months since I purchased this camera system and ooooh boy. Talk about a lesson in \"You get what you pay for.\"I'm a sysadmin by day and have always had an affinity for troubleshooting and working with electronics. I have had my fingers in everything from car cassette players to several Raspberry Pi's around my home that I have programmed to run my sprinklers, garage door, and my movie projector. The point I'm trying to make is that I fancy myself a very capable person when it comes to most all things electronic -- and never in my entire life have I felt so defeated by a piece of gadgetry.Right out of the gate I had massive issues with configuring the devices. There are three difference places you can (try to) program theses cameras: Through the DVR, through the Active X controller in IE (and only IE), or through ZViewer in Windows. All of which are laid out different, all of which never reflected settings changed in another medium, and all of which are very clearly built on hurried, shoddy programming. I would hazard they were about 65% done with the actual software engineering when they decided to put these cameras in a box to start selling them to people.The biggest issue by far was just the complete failure of three of the cameras to accept configuration changes.Want to change the password? \"Operation failed.\"Want to turn on motion detection? \"Operation failed.\"Want to change the IP Address? \"Operation failed.\"Even when one camera inexplicably decided to start accepting configuration, it never took. Motion detection never actually worked. Pretty much my only option for recording was to have them run 24/7 and eat up my hard disk.After FIVE hours on the phone with tech support across three days (Because they failed to call me back twice.) I had to RMA three of the four cameras I initially received. Today, I finally got the replacement cameras, I have just now plugged them cameras in and went to configure them... \"Operation failed.\" on two cameras. One of the new ones is now \"working\". I can change the password on it, but it's probably going to take the an alignment of the stars to have motion detection work. Not that I really care about that because about a week ago one of the PoE switchports on the back of the DVR has went out and now I'm going to have to RMA that too!Pros:- Three different ways to program the cameras.- Remote viewing on smart phones.- Cheap.- Lots of features.- Tech Support rep was excellent. It was not pleasant but we both put out heads down and did what we could for several hours.- 720p video.Cons:- Three different ways to program the cameras... that were obviously rushed and ultimately don't work.- Remote viewing on smart phones... That uses the bafflingly insecure witchcraft of UPnP to work. Anyone with the know-how and motivation could view these cameras from anywhere in the world.- Cheap... and it shows.- Lots of features... That with a lot of luck and an animal sacrifice, you just might get two of them working... But probably not.- Tech Support logistics were just awful. They never answered live chats. Emails weren't answered. When I finally broke down and called them, it was a 45 minutes wait time on hold and then multiple failures to call me back when we had to pick up where we left off the next day.- 720p video... complete with significant fisheye blur, auto focus issues, and image ghosting. My flip phone from 2006 took clearer video.Final word or tl;dr: These cameras could have been amazing. This particular Zmodo product, with the combination of PoE and 720p sounded perfect for me, but in use the whole package just stank of being the \"next gen\" Zmodo product that was rushed through development. I've literally wasted more of my time trying to make these cameras work than they are even worth.", "Date": "July 15, 2013"}, {"Title": "Poor quaility", "Author": "Norman K. Hirako", "ReviewID": "R1C5A9TAVQKM6I", "Overall": "1.0", "Content": "48 volt power supply was bad, no output voltage for cameras.  I had to build a replacement to actually use the system.  Cameras have different infrared sensitivity levels so some cameras switch back and forth between night and day modes even while testing in the same room on a test bench.", "Date": "September 29, 2013"}, {"Title": "Pretty decent ip camera security system...", "Author": "JAMES HART", "ReviewID": "R2ZDJS0P8MY9QI", "Overall": "3.0", "Content": "UPDATE 12/9/2013:Well, had these up and running since end of August, and the device stopped powering the cameras.  They wanted to send me the 48v power supply first instead of sending out a new NVR.  the power supply didn't do it, so they sent me a new NVR.  new NVR up and running, and had to pay return shipping, but they did cross-ship so I got to hold on to the old one until the new one arrived.  only took about 4 days... not bad, but then it shouldn't have failed in the first place.Deducted 1 star becaus of warranty needed inside of 6 months.Original Review Below:This NVR camera system arrived well packaged.  I removed the product, and it already had the screws removed from the cover to install a hard drive into.  I installed a 2TB hard drive into the device and then connected the cables and tested it.The primary issue I had with the setup was that the cameras come with static IP addressess and seem to lack the ability to use DHCP, however, the PC software allowed me to change the IP addressing scheme away from the 192.168.1.x that it comes out of the box set to and use the scheme I use on my home network.Picture quality is good, however it is not set to max resolution and quality out of the box.  the night vision IR LED's emit a faint reddish light when on, and seem to be variable.  the camera's quality looks good and auto-adjusts the exposure to the light conditions.  I do not yet have them installed in their permanent locations, but expect to soon.The software for the PC is sluggish, but interacting with the NVR or the web interface was quick.  I was able to connect to each camera and access it while it was streaming to the NVR simultaneously which is an added bonus.  Since I do not use UPNP on my network, I will have to manually open ports as I determine what I want to allow outside my home network, and documentation for this appears lacking at this time.The cameras are pretty small, and should be able to be installed in an unobtrusive location.so far I am happy with the purchase.", "Date": "August 22, 2013"}, {"Title": "Weak!", "Author": "Mike", "ReviewID": "R3UH09VXBKHK45", "Overall": "2.0", "Content": "I started out looking at higher end POE cameras but have a friend with a Zmodo analog system who suggested I try this.  Will say that the POE cameras are nice and after 6 weeks they seem to be holding up fine.  However, the NVR and the documentation with both the cameras and NVR are pathetic.  Even on the Zmodo boards forum it seems to be the blind leading the blind and there are far more questions than there are answers about this system.  The motion detection in the cameras seems to work OK and emailing snapshots directly from the cameras works great.  With 4 cameras on high setting using the adjustable grids in the camera setting I received 200+ emails in one day from all of the cameras.  I bought a WD AV 1TB AV drive for the NVR and the recording however is hit and miss.  It seems that if I reboot the NVR it will record momentarily then stop or record at random times.  The settings in the NVR are very confusing and here are some of the questions that I am trying to find answers too:The NVR has a \"video plan\" that allows you to set start and stop times for scheduling, motion, etc however it doesn't seem to work or interface with the cameras so I am wondering if the camera settings overide the NVR or does the NVR setting override the camera settings. In ZViewer you can't adjust the individual channels beneath the NVR so how does the system interpret the camera settings?  You can right click on the individual cameras and adjust all of the settings but it still doesn't record motion.  A reasonably thorough description of the NVR/camera interface process would answer many of the questions that most people would have.  Some of my unanswered questions after 6 weeks are:The NVR has a motion detection under the motion alarm configuration tab but have tried all combinations of the 4 different channels with the little checkbox both checked and unchecked and still doesn't record motion.What is the \"loop video\" checkbox do?  Does it record one motion detections session right after another or does it replay it over and over?Frequently I get a \"core dump\" message in ZViewer that asks me if I want to save the log file. Ignore it and I can still see the cameras, click no and it closes the application. (ZViewer has a lot more problems that I will not mention here)Can see recorded video (when it decides to record) from ZViewer but when I log into the web interface and search for the file why does the video not show up?  Can select the day and time down to the second but do you have to select the very second that the video starts being recorded to find it?  Why not select the day and time then show all video recorded after that time for that day?  Never have been able to find a recorded file via the web interface despite it showing up in ZViewer.I have a lot more questions that could be answered by some decent documentation.  For all the settings that show up both in ZViewer and the web interface I would give the completeness of the documentation that comes with the system an F.  It is almost as though they tell you to plug this in here and there and once you can see the picture you are left to try to figure the rest out yourself.  If they would just spend some time making sure that the documentation is excellent and that the NVR to camera process actually works it might be a good system.  I do like the cameras but as far as I know you cannot order the cameras individually.  I called Zmodo and asked if I could order the 1080p system listed on their website but was told that it isn't available for sale yet. That makes me wonder if the other high end cameras listed in the professional section of their website aren't just there for window dressing.I've dealt with computers and networks for a long time and while I can easily sit in my living room and see what is happening outside via ZSight or an IP address, the lack of documentation and seemingly poor NVR operation would prevent me from purchasing another of these.", "Date": "October 6, 2013"}], "ProductInfo": {"Price": "$499.99", "Features": "4 Channel 720P Network Video Recorder with PoE Power Switch &4 Indoor Outdoor HD Network IP Cameras^This system allows you to view your footage, no matter the time or location. Access your DVR's footage over the internet, or directly from your Android, or iPhone smartphone. or your PC^Easy QR Code Scan Setup^Weatherproof Housing Cameras  These IP66-rated cameras can withstand extreme wind, dust, and rain. These cameras are suitable for outdoor use, even in rugged climates\n4 Channel 720P Network Video Recorder w/PoE Power Switch &4 Indoor Outdoor HD Network IP Cameras\nThis system allows you to view your footage, no matter the time or location. Access your DVR's footage over the internet, or directly from your Android, or iPhone smartphone. or your PC\nEasy QR Code Scan Setup\nWeatherproof Housing Cameras These IP66-rated cameras can withstand extreme wind, dust, and rain. These cameras are suitable for outdoor use, even in rugged climates", "Name": "Zmodo 4CH 720P Network Video Recorder w/PoE Security Surveillance System With 4 Indoor/Outdoor Day/Night HD IP Cameras No Hard Drive", "ImgURL": "http://ecx.images-amazon.com/images/I/41jS%2BBrcHpL._SY300_.jpg", "ProductID": "B00CFF0M7O"}}