{"Reviews": [{"Title": "Good once you get working", "Author": "Architek", "ReviewID": "R14R0VXQ6P32CT", "Overall": "4.0", "Content": "I have this device and at the moment am pleased. If I wasn't a tech person I could understand some frustration for sure. The web UI they provide is very browser sensitive. the active x control features seem to be okay although I wished it would have some of the varied screen splitting layouts like when connected directly to the DVR.Pros:- Image quality is actually really good for both night and day.- cable length is adequate for a smaller home.- DDNS Service you do not have to use the Samsung resource which was scaring me when configuring at first.- Mounts and solid so far, metal unlike some other cameras I found were all plastic and feared would turn brittle on some intense sunlight areas.- Motion sensor features are cool, and able to decline certain portions of the image capture range such as windows it might point at that would catch movement inside the home etc.- Use of paired Balun network transceiver modules allows longer extension over cat5e.Cons:- Web browser support for remote access does not like anything over IE7. If you have a browser version which most do over IE7 you need to hit F12 and change mode from like edge view to IE7 document mode.- Challenging remote access configuration. Note: port range specified if you do port forwarding the port at the end of the range seems to be the port you would want to enter in as a port value for the iphone apps etc.- Default screen resolution on the DVR is greater than 1024x768, I was using a small old LCD and was pissed I had to unplug everything to move to a different display because it threw an out of range error.- Terrible, Terrible, one more time... Terrible power connection dongle in the back of the DVR... like seriously retarded.- End Connections for Power and Video on the camera device cabling is pretty thick. Had to create a pretty large hole to feed through house walls.- Wished the box came with at least two 100 foot cables.overall I am pleased.", "Date": "December 20, 2013"}, {"Title": "Terrible tech support and terrible documention", "Author": "H. Clark", "ReviewID": "RN3PBGS7TRWSV", "Overall": "1.0", "Content": "The camera cable ends are too large to pass through walls with the double connectors. I worked for two days attempting to program the sdr5100 for remote viewing according to the documentation with no success. I finally called tech support that the documentation provided that indicated it was available from 9 AM to 9 PM EST. After waiting 45 minutes (#21 in line) the tech informed me that they were in California (PCT). The tech took control of my computer, reprogrammed the SDR changing almost everything that the instructions provided, Moreover, the tech hung up on me after he completed the programming that prevented me from asking question that I had. Additionally, the instructions indicated that it supported all browsers, but only IE is supported and even some versions of IE is not supported. The only version of IE that would work for me was the 32 bit version. I would advise anyone purchasing this system to call tech support immediately when installing and let them make the installation, be prepared to spend a couple of hours on the phone and only M-F.I would advise anyone needing a video surveillance system to pass this one up. I own a REVO system for a little over a year and their quality is much superior to the Samsung. There tech support is much superior as well.", "Date": "December 31, 2013"}, {"Title": "Terrible Customer Support", "Author": "Dushant", "ReviewID": "RYK7QOLKVR8RZ", "Overall": "1.0", "Content": "Terrible Terrible Tech Support, whenever I have called, I am caller no >11. It takes 35 to 45 mins to get hold of tech. We are asked to leave ph. no for call back, Call is returned after two to three days and at that time they expect you to be right next to the DVR. I will make another attempt to call or will rip off all cameras and return them.", "Date": "December 19, 2013"}], "ProductInfo": {"Price": "$1,199.99", "Features": "16 channel real-time DVR, HDMI ready\n2 TB surveillance class HDD installed, Quick connect auto port forwarding for simple remote viewing setup\n10 high resolution 600 TV Line IP66 rated weatherproof cameras\nCameras night vision up to 82 feet, True day/night IR cut filter removal for superior image quality\n72 degree viewing angle cameras", "Name": "Samsung SDS-P5100N 16 Channel DVR Security System 2 TB HDD 10 Box Cameras", "ImgURL": "http://ecx.images-amazon.com/images/I/41Ihn51zG7L._SY300_.jpg", "ProductID": "B00CTUU0E0"}}