{"Reviews": [{"Title": "excellent for someone who doesn't have a tv in their room", "Author": "Nathan Grose", "ReviewID": "RTVNPI5K5GIRZ", "Overall": "5.0", "Content": "It works perfectly, along with 0 lagging. I hooked my playstation 2 up to it, and it is slightly blurry in full screen. I can't wait to see how the ps3 looks on my laptop.", "Date": "January 1, 2014"}, {"Title": "Nice", "Author": "Dave", "ReviewID": "R2NY52LPE8XUIF", "Overall": "5.0", "Content": "Arrive on time as was promised.  We are very happy with the quality of this purchase. It is a gift for someone - hope it works for them!", "Date": "December 24, 2013"}, {"Title": "Meh", "Author": "Harrison Nation", "ReviewID": "RPR1K5YHJT3TH", "Overall": "4.0", "Content": "It's ok but for Mac you have to search up the installation guide on YouTube. It works great I just with it was compatible with HDMI cables. The graphics for the Wii recording are ok and so is the PS3 thanks to the S-Video cable but for Xbox they suck.", "Date": "December 17, 2013"}, {"Title": "run away ...", "Author": "Tabitha", "ReviewID": "R3A39A1Q5MTBX0", "Overall": "1.0", "Content": "Waste of time and money! Didn't even come with the proper equipment... once we got it working the audio sounded like we were recording a ransom call.", "Date": "November 6, 2013"}, {"Title": "Doesn't work with Mac .", "Author": "Turik burgess", "ReviewID": "R2Q77VZOQY4ZNB", "Overall": "1.0", "Content": "I doesn't work with Mac so it's useless to me on the web it says compatible with Mac and PC not true...", "Date": "October 2, 2013"}, {"Title": "so so item", "Author": "lester", "ReviewID": "R3FP07QAA4GJV9", "Overall": "1.0", "Content": "Could not get the item to work properly. Very vague instructions came with it.Would not buy this item again. money poorly spent.", "Date": "February 24, 2014"}, {"Title": "Its Ok", "Author": "Jim Smidt", "ReviewID": "R1LVSZIG68MWTM", "Overall": "4.0", "Content": "Its not the best but it gets the job done...the quality isnt that great and the audio is the same....", "Date": "September 21, 2013"}, {"Title": "Do not buy", "Author": "Tyler Lancaster", "ReviewID": "R1V24W61RYOFVX", "Overall": "2.0", "Content": "I literally just opened the box to find that the wrong type of splitters were sent.  I haven't even been able to test the product yet and I'm already a bit concerned.", "Date": "July 1, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CDGVWUQ"}}