{"Reviews": [{"Title": "Great product for the price", "Author": "Keith", "ReviewID": "R3OFIUWYOJD2XW", "Overall": "4.0", "Content": "I recently received my shipment of this product and have been very satisfied with it ever since.  The setup and configuration was very easy!  Their software even automatically configures port forwarding and DDNS for you and provides internal and external links to access your camera.  I have yet to configure the automatic alerts and notifications, but for $40, I now have a Pan-tilt camera that can be placed anywhere in the house and accesses through almost any device I own.  If you are venturing into baby/pet/house monitoring for the first time and want an inexpensive solution, I highly recommend this product.", "Date": "August 2, 2013"}, {"Title": "Great picture and easy setup!", "Author": "Clifton Mulanax", "ReviewID": "R31IG5XH8BNXK", "Overall": "5.0", "Content": "What a great camera!  It's very easy to set up and use.  I can watch my kids as they get home from school while I'm @ work!For reference: the setup wizard on the CD does a good job with basic setup, however it wasn't very helpful for setting up the camera for working over my wifi.  You do need to have it plugged in to the router (or work group switch) initially to be able to configure the Wifi IP settings.  Fortunately I am an IT professional so was able to figure it out.  Also, the communication feature is very cool (you can hear what is going on AND speak to those you are observing), unfortunately, it only seems to work while on the local network, and only through Internet Explorer.  You can view with other browsers and even control the camera, but the sound features will only work with IE.  Lastly, if you plan to use over WiFi, be sure to use a strong password.I am very happy with this camera and plan to buy another soon.", "Date": "August 28, 2013"}, {"Title": "You get what you pay for", "Author": "Amazon Customer \"kiwi2012\"", "ReviewID": "R2JVV9N9T9OGQW", "Overall": "3.0", "Content": "This camera can't help but be compared to the Foscam 89xx series, which seem to be among the most popular IP cameras around.  This Veevocam competes with it mainly only price, although it also looks similar.  The similarity is not complete.  It's not a Foscam in any respect, but it is good for the price which is about 2/3 of what a Foscam costs.Good:Cheaper than Foscam.Works better than some other IP cameras.Port forwarding and remote viewing work perfectly.Two-way audio actually works better than Foscam -the people you talk to can actually hear you.PTZ speed is configurable (slow, normal, faster).  Fast is no joke.  Much faster than Foscam.Fits standard IP cam mounts.Can work outdoors if mounted in a dry area, for example on a porch out of the weather.  Unknown how it handles temp extremes.Bad:The image quality is always in a quasi monochrome IR-type image.  It seems to go into color mode only when the subject is right in front of the camera and there is a lot of ambient light.  In a fully lit yard, it's always in IR gray even in full sun.  Some cameras have an \"IR Cut\" feature to fix this.  Veevo does not.The lack of real color interferes with motion detection software which looks for color+brightness changes.  This means the camera doesn't trigger motion alerts as often as it should.The audio function does not work with Blue Iris at all.  No sound can be heard or recorded.  The same audio does work with other camera apps.The PTZ on \"fastest\" can easily overshoot whatever you are looking at and send the PTZ dome skewing wildly.  It can be comical.Wifi seems to drop all the time.  It comes back but the loss of signal triggers camera alarms for me.  Annoying.Conclusion:These would make good cameras for indoors where high quality is not needed. Hallways in a house, maybe a kitchen or as baby cameras.  They would not be recommended by me for use outdoors or where you need a reasonably good forensic image with sound, in the event something happens, such as entryways, porches, etc.  Veevocams are very affordable and would be a good choice for a tight budget, or to fill in around other better cameras.  But you will probably have to spend more to get a really decent camera.I'll be using Veevocams to replace some indoor \"Winbook\" IP cameras and also placing Veevocams where vandals might destroy them.  It will less loss for me.  But where it counts and where I need a solid image and recording with sound, I will be buying Foscams.", "Date": "October 12, 2013"}, {"Title": "great camera at a great price", "Author": "mama donuts", "ReviewID": "R1EZPJOQMSG2F6", "Overall": "5.0", "Content": "i have been looking for an inexpensive wireless camera like this to beable to check on my house when I am not there. the camera arrived quickly and waseasy to set up by following the instruction booklet and using theincluded software. i wasn't expecting much based on the price, but thequality has really impressed me. highly recommend!", "Date": "August 24, 2013"}, {"Title": "I like it! does what it says!", "Author": "Melynny", "ReviewID": "REBM8EE5BKW8J", "Overall": "4.0", "Content": "I like this.. it works just as I expected.  Works with my Galaxy S3, my Galaxy Tab10.1 and my pc. Pretty easy to set up.  I am not a networking wizard, and I used the easy set up option from the CD and I had the whole thing set up in 15 minutes.  You get the most functionality when viewing the camera thru an IE browser (record, speaker and microphone, but you can still view using chrome, etc.  Apps from the play store don't work at all.  I use the browser on both Samsung devices.  Night vision is very clear black and white, more than 15 feet as I had read in another review; I'd say about 20 feet. Microphone and speaker are marginally functional, but I was able to carry on a conversation.  Make sure you set up a password to lock out other viewers.  Pan and tilt work well and you do have the ability to flip the image/camera for upside down mounting, as there is more movement up, than down, if you are mounting higher- I wanted to have a better view of my floor.  I am having trouble using the alarming functions.  it emails perfectly, but seems to send the alarm alerts,from nothing or from my cats, even when I change the sensitivity.  There are several (5, I think) levels of alarm sensitivity.  The television also sets it off.  When you get an email, it also sends a snapshot picture to view.  I am considering getting another one!", "Date": "November 3, 2013"}, {"Title": "It is ok for the price", "Author": "DMA \"dmaboyer\"", "ReviewID": "R3T71JGHVM3S63", "Overall": "3.0", "Content": "It has a good picture. It pans and tilts nicely. Easy to set up since it has its own dedicated website address. There is no Veevo software. It is made by Tenvis and you have to use there software. It has very short range for WIFI signal. I change the antenna to a 7DB antenna and that helped some. Worst problem it that it drops out frequently and I have to unplug it and plug it back in to get it back on the network. I would say it drops out at least one or twice a day. There is a green flashing light on the front that makes it noticeable to anyone near it unless you cover up the light. I have it in a front window to watch for guests coming to the door and the infared lights glare on the glass so they are worse than usless. I cannot find a way to turn them off so I had to cover them with tape so I could see outside at night. For half the price of Foscam it is a nice toy to play with but not for serious security use.", "Date": "January 13, 2014"}, {"Title": "good product", "Author": "Hong XU", "ReviewID": "RB957XIP0AZ2O", "Overall": "3.0", "Content": "it is a good product but it is not easy to set up, after I used it few weeks I found it is very difficult to set up it correctly and operate it.", "Date": "October 6, 2013"}, {"Title": "Reboots all the time. Died after 6 months", "Author": "Arash P", "ReviewID": "R20OKXJN4BDC7N", "Overall": "1.0", "Content": "Image quality was grainy. Only showed color when there was a lot of light around. Often times the video would have lines running through it and would require a frequency change to fix.", "Date": "February 17, 2014"}, {"Title": "This is just a toy not a real camera", "Author": "Great tool", "ReviewID": "RC44LEB5SIJU0", "Overall": "1.0", "Content": "This camera is just a toy it can not be use as a real surveillance camera it has problem staying contented to the wifi", "Date": "February 2, 2014"}, {"Title": "Didn't Last Long", "Author": "Kevin Jimenez", "ReviewID": "R2C6OY9N0H3BEA", "Overall": "1.0", "Content": "Only last a week this item is worth crap... Try to use and trobleshoot it but costumer service is korea so imagine that. I got the next week the foscam which it had last me more then a month.", "Date": "January 4, 2014"}, {"Title": "Great price, great camera, some flaws", "Author": "Kathy Czech", "ReviewID": "RQ57U5IVJSU4T", "Overall": "4.0", "Content": "We purchased this as a baby monitor camera with the option of viewing over the web. It was a breeze to setup, although you need to be able to adjust your router settings for online viewing. The picture is good but the color looks off a bit. Since i am just using it to make sure our baby is ok and spy on the dogs, it isn't an issue. The night vision works great, i can see very far in total darkness. Please note that night vision is ALWAYS black and white, no matter what night vision camera you get. The camera is capable of sending and receiving audio, which in order to do on an iPhone, the feature is not free. I did not buy the app, so i have not tested it. I do know that the audio was choppy when using Internet explorer to listen online. This could be due to Internet bandwidth. Do not expect a great picture and sound with slower speed DSL Internet. All in all, I am very happy with the purchase and would purchase Again. Minus one star for the free app not really being free and choppy sound over decent bandwidth. PS, CHANGE YOUR DEFAULT PASSWORD TO KEEP OUTSIDE ACCESS!!!!!!", "Date": "August 31, 2013"}, {"Title": "VeevoCam Review--it's great", "Author": "Kara", "ReviewID": "RLUL9IWSTESIN", "Overall": "5.0", "Content": "First off, I want to say I am not very tech savvy, but I was able toget this set up and working in under 20 minutes by following theincluded instructions. You do have to connect it to your wirelessrouter during set up, and the ethernet cable to do this is notincluded. But that was really not a big deal as I have quite a few onhand from other computer accessories. So far, I am loving it!Definitely surpassed my expectations of a $40 camera. Will probablyorder a couple more to add extra coverage around the house.", "Date": "August 25, 2013"}, {"Title": "Poor quality audio and color", "Author": "Mark Johnston", "ReviewID": "R1RCPOIGVFQCG7", "Overall": "1.0", "Content": "I understand that this cam is cheap, but it should still work properly. Brown's and greens come through as purple! (I will upload a picture). Also, there is terrible noise coming through the audio that makes it nearly impossible to hear anything else. The two-way audio does work but again, you can't here the audio. I thought this may be due to interference so I tried it in different locations but the problem persisted and didn't get better or worse which leads me to believe it was not interference. I downloaded the app that the instructions recommended (it was a third party app) and installed it on my iPhone 5. Unless I missed it, I did not see anywhere in the listing of the product that the two-way audio required an in-app purchase! ($3 I think). I was also disappointed to find that the only way I could listen to audio was through an app and not through the browser. I paid ~$40 for this thing. I think I will pay 2x as much and get something that works. I sent this item back.", "Date": "August 28, 2013"}, {"Title": "No recording outlet", "Author": "Kevin S", "ReviewID": "R38XK3IMA7PIXV", "Overall": "3.0", "Content": "All you get is visual through the computer. No video output on the camera itself. How hard would have it been for them to put that video output on this camera. No very. Go figure.", "Date": "March 20, 2014"}, {"Title": "I do not recommend this camera.", "Author": "RM NJ", "ReviewID": "R34Y0XA5B0V5QV", "Overall": "1.0", "Content": "The web based interface is terrible. Yes, it can do its job but not very well. I also have a real tough time positioning the camera remotely through the interface. Also, although the camera never claimed to do it, I cannot record the video feed. Based only on what is provided with the box you are provided a camera you need to monitor with your eyes.The night vision works surprisingly well.", "Date": "March 16, 2014"}, {"Title": "Different Product Sent then Ordered", "Author": "Robert Krizansky", "ReviewID": "R2DAASMDM4AXE2", "Overall": "2.0", "Content": "1.  I ordered this Neewer Cam as listed BUT was sent a different camera with no explaintion. I have an inquiry pending for explaination.2.  Moreso, No where does it say on the listing or documentation that the camera does NOT work with all features and functions dependent upon which browser and version you use.Pending receipt of a reasonable explanation to my inquiry and questions I have no choice at this time then to rate this product low.", "Date": "March 12, 2014"}, {"Title": "Good WiFi camera but loses sync", "Author": "Tariq", "ReviewID": "R33MWPBL1W0XJE", "Overall": "3.0", "Content": "Its a good wifi camera but unfortunately it resets a lot, after spending time to configure it for accessing from the internet it worked. I could see my home while sitting at work, but if it reboots then it loses connection with internet and you have to access it locally and troubleshoot again to make it accessible from outside again.", "Date": "February 11, 2014"}, {"Title": "FPS FAIL", "Author": "Roland \"~R.T.F.\"", "ReviewID": "R4K5O2FDG2XW0", "Overall": "2.0", "Content": "20-25 FPS nuff said. im going to end up gutting the camera out and replacing it with a 30 dollar one from walmart so i can have actual live feed images instead of crappy 1998 tech.  Really good innovation on what it was intended to do but the hard ware (the camera) is worthless.", "Date": "February 5, 2014"}, {"Title": "Need to be IT to install this...", "Author": "Michael", "ReviewID": "RV6A4ZUVXLALY", "Overall": "2.0", "Content": "Works great when your in network.  It's hard  to setup the port forward to allow access from outside the network.  Maybe I'm not as savy as I thought I was,  however thus should not be this hard to do.  Instructions a little out dated and not so great.", "Date": "February 1, 2014"}, {"Title": "Difficult to use.", "Author": "Gregory Shenton", "ReviewID": "R1Q7U9BNQ9PLHY", "Overall": "1.0", "Content": "I bought this item to use as a cam for the baby's room.  There is no monitor, but it boasts that it can be used with an iPhone.  The app is terrible and cuts in and out. The resolution is terrible.  Total waste of money.", "Date": "January 30, 2014"}, {"Title": "Faulty software, Poor support", "Author": "Thomas Francl", "ReviewID": "R2591Q1N5DH6S9", "Overall": "1.0", "Content": "Spent 20 hours and 15 tech support emails attempting to get the WiFi to work.  Support instructions are half baked and it still doesn't work.  I've been programming computers & fixing hardware for 40 years, and this product just doesn't work.  It's been over a month so Amazon won't even take it back.", "Date": "January 23, 2014"}, {"Title": "Poor Audio and Frustrating Experience with App", "Author": "Timothy J. Flynn \"TFlynn\"", "ReviewID": "R2IMQH2O86GUBC", "Overall": "1.0", "Content": "Setting this up was pretty confusing.  The app they recommend isn't even created by them but a 3rd party on Google Play.  We could never get the crackly audio to clear up and you can't even hear what is going on in the room.  Pretty important since we planned to use temporarily for a baby monitor.  Returning.  Don't recommend.", "Date": "January 17, 2014"}, {"Title": "Poor", "Author": "Cody Devon Pearson", "ReviewID": "R2W5YDKSTXFGUL", "Overall": "1.0", "Content": "I have bought this device and have not been able to use it. It did not connect to my router and it messed up my houses entire internet connection.", "Date": "January 16, 2014"}, {"Title": "This is a great product for the price", "Author": "Chuck M \"Geekster\"", "ReviewID": "R2VFRGSSS6Y47O", "Overall": "3.0", "Content": "Burglaries in the neighborhood prompted me to seek a quick monitoring solution.  I set this up in about 20 minutes and now I get alerts via cell phone when someone pulls into my driveway when I am not home.  Good peace of mind to know kids arrived home safely from school too.  Can access and view anytime from my Nook color, PC, or cell phone.Only drawbacks are that no sound unless wired connection is made, color is a little washed out and no way to turn off infrared lights which cause reflection off of inside of window it is set up in, at night.  Support said it could be set up outside but that will require external power source/outlet in weather protected location like under eves.", "Date": "January 12, 2014"}, {"Title": "RUINED CHRISTMAS", "Author": "Amber", "ReviewID": "R1T0EH1OMFO7NV", "Overall": "1.0", "Content": "The \" customer service\" is ONLY by email from Beijing so you can expect at minimum 12 hrs between replies for trouble shooting. The reply emails, minimum of 12 hrs later, were diagrams from the manual which obviously didn't work and had ridiculous instructions to attempt to achieve the end state of a functioning product, didn't work! It all came to conclusion when they told me, by mail, they had to access my computer and then wait until they open in Beijing for \"customer support\".  I attempted every possible router they had listed and none worked. The setup didn't work nor the \" customer service\". Don't waste hours of your life with this purchase!", "Date": "December 25, 2013"}, {"Title": "Installation CD a blank", "Author": "Zwei", "ReviewID": "R2GZDSASWWN4JZ", "Overall": "1.0", "Content": "The installation cd came in as a blank. The computer started to format the cd instead. The website where the installation software was supposed to be able to download appeared to be hacked. There was nowhere to find the technical support.", "Date": "December 10, 2013"}, {"Title": "Works for what I need it for, good for the price...", "Author": "Thecrazyone1", "ReviewID": "R571Z2S3DPL83", "Overall": "3.0", "Content": "I can check in on my apartment from my phone while I'm out, and it emails my gmail account a picture when something moves. Decent firmware, allows WPA encryption. Audio sucks can't hear anything from mic and the speaker is very distorted. The mounting bracket could use improvement, it doesn't allow enough room for the antenna and power cord to not touch the wall.", "Date": "December 4, 2013"}, {"Title": "Warning: does not work with AT&T; UVERSE", "Author": "Joseph Bonds", "ReviewID": "R3PH4BUFCLAE12", "Overall": "1.0", "Content": "will not work with AT&T; UVERSE. Support website \"404 not found\". Sucks. This is really Tenvis camera which it looks just like.  The Tenvis camera also does not work with AT&T; UVERSE.", "Date": "December 2, 2013"}, {"Title": "Can't setup", "Author": "Karen A. VanDenBusch", "ReviewID": "R3CFGFG1VPHKZV", "Overall": "1.0", "Content": "Can't get it to work online.  Have over 10 hours into trying to set it up.  Will probably send it back.", "Date": "November 16, 2013"}, {"Title": "OK for the price, but hard to configure if you don't know what you doing.", "Author": "H. Galdamez", "ReviewID": "R1U4Z9EOHF1AHT", "Overall": "3.0", "Content": "This product works great if is connected to a physical LAN network, wireless range sucks......awful.the camera has good resolution and for the price i got it I can deal with it's short comings.This cameras are not plug and play and they are not easy to configure if you have no idea of simple Networking or if your network settings are configured in a different IP range as this product comes defaulted with.the Software that comes with  is mediocre, it's interface could be better (cheesy)  and does not work with its all features in Chrome, Firefox, however Internet Explorer works fineeven if you are well versed in IP networking, it will take you a good little while configuring them the way you want.If you reading this review and said \"WTH is he talking about?....don't buy them....", "Date": "November 11, 2013"}, {"Title": "doesnt record", "Author": "lord g", "ReviewID": "R3DAPHYZHKSONY", "Overall": "3.0", "Content": "its cool for taking pics but since you cant record its kinda useless as a surveillance camera unless you are watching it at the time", "Date": "November 6, 2013"}, {"Title": "Good camera for a good price", "Author": "Romeo", "ReviewID": "R2GVCR1E5378ZR", "Overall": "4.0", "Content": "The camera received was as it was described.  the camera was easy to set up despite me not being too tech savvy.  For the port forwarding I used a program named easy connect wizard by Lorex, which made the port forwarding so easy.", "Date": "November 6, 2013"}, {"Title": "Great Value.", "Author": "Barry Krugliak", "ReviewID": "RT5WS2CF9S0NM", "Overall": "4.0", "Content": "Definitely great value. What more can you expect.  Set-up was a pain as I had to do a lot of \"googling\" to figure out port forwarding and other networking things.", "Date": "November 4, 2013"}, {"Title": "Great camera", "Author": "Vladi Nocar", "ReviewID": "REY6SCTGSPA8V", "Overall": "3.0", "Content": "I ordered two of these. One was DOA, hence 3 stars for the product. If both were working, i would give it 4 even 4 1/2 stars for simple setup and easy remote viewing. It is good for the price range.", "Date": "November 1, 2013"}, {"Title": "Didnt work for me", "Author": "Antonio Mallah", "ReviewID": "RB7339ANV631D", "Overall": "2.0", "Content": "When this camera was connected to my router via Ethernet the router would start to reboot and get stuck. So I unplugged this and connected the camera via the wifi and the same thing happened. Looked like this was going to be a good camera from the internet reviews but I never got to step 2. Returned successfully.", "Date": "November 1, 2013"}, {"Title": "Home use only", "Author": "Tommy Dillard", "ReviewID": "R1K7WQ75MXUWJJ", "Overall": "3.0", "Content": "I bought this because it says you can check on your house from anywhere with your smart phone. To this day I have not been able to get it to hook up unless you are hooked to the same wifi.", "Date": "October 26, 2013"}, {"Title": "Great price - good camera", "Author": "Laura K. Schilling", "ReviewID": "R2AE5XO75SPEPH", "Overall": "5.0", "Content": "easy to set up - did have a technical issue, but request for help answered quickly and correctly very pleased with purchase", "Date": "September 29, 2013"}, {"Title": "tracking my lost mail", "Author": "redrumsport \"redrumsport26\"", "ReviewID": "R2B3UW53LIY0OA", "Overall": "5.0", "Content": "i got this security camera it work good the only thing the not have extra rca for tv or monitor but it is berry nice i like", "Date": "September 14, 2013"}, {"Title": "Wifi is extremely poor / Wired is OK", "Author": "Jon (JAC73)", "ReviewID": "R3F2I7FFP221QH", "Overall": "2.0", "Content": "If you are purchasing this for wifi connectivity you will be greatly disappointed.  I purchased it as a baby / security monitor to be placed in various locations in my home leveraging wifi.  Using both the built in webserver access and 3rd party software to access the camera (iSpy) the camera would continually drop the connection and lose video.  The audio function never worked through either access method.To confirm it was not my wifi I moved it to a near location to the access point and experienced the same poor quality.The wired connection works ok although the PT function are slow or non-responsive at times.Overall I cannot recommend this and ultimately returned it.  I will spend a little more money for a better quality camera.", "Date": "August 31, 2013"}, {"Title": "It's okay, maybe.", "Author": "S. Stewart", "ReviewID": "R21XXEZ5FRGUJA", "Overall": "3.0", "Content": "At first glance it appears to be a clone of a popular pan & tilt camera. As soon as you pick it up you will know that it is a cheaper imitation. Made from a lighter and cheaper plastic there is nothing about it that inspires confidence. It lacks the alarm functions of the original but retains the mold marks in the back were the plug would go.This is not a plug and play product. Part of the setup requires the computer and the camera to be hard wired into the router at the same time. After I move my computer to the routers location I may be able to get this camera to operate.It appears to be an example of false economy. A more expensive camera, such as one I bought previously, would have been up and running in a few minutes.Veevo earns a razzie.", "Date": "September 8, 2013"}, {"Title": "Forget the camera can't get that far", "Author": "Phil j", "ReviewID": "R30HPZBUVY14XT", "Overall": "1.0", "Content": "Forget the camera can't get that far with the software on the Mac.  The company support none. Just a answering machine. Telling u to email them  after 37 days. The relay was Tell us  ever step u have made to hook up are camera.  Steps. Forget about that software does not do what it should or that is give in in the quick start guide. (Please) there has been no start. No help or return replay  63 days now No web site  this Hong Kong company is just laughing at us after the have been payed. After 20 days u put them back on eBay.  Got a email from them then. They told me the where going to Get there lawyers on me if I did not take them down after I own the 4 cameras.  I ha e hade 4 people look at this product and software.  No anyone could get them wireless and working.  Funny thing is the brothers I work with are all hollywood camera men  that what hurts the most  if anyone should know  think that we would.  Jokes in me.  Please don't let it be on you", "Date": "August 29, 2013"}, {"Title": "Bad idea", "Author": "scott beatty", "ReviewID": "RV5JGV7HZZD6Q", "Overall": "1.0", "Content": "Not worth the money. it offers free adds at the top of the screen for such things as dating etc.", "Date": "October 9, 2013"}, {"Title": "unstoppable false alarm emails", "Author": "Craig Downs", "ReviewID": "R2DQSAVWWO4MRY", "Overall": "1.0", "Content": "Setup motion detection alert and got tons of emails coming to my inbox within 2 hours.  Guess what, It turns out to be all false alarms?!  This totally defeats the purpose of mine having this camera.  The factory does not do a good QA job before shipping the product.  Photo sensor too sensitive or buggy software? I don't know.", "Date": "August 28, 2013"}, {"Title": "Not worth the money I paid for.", "Author": "Jason Hall", "ReviewID": "R1PWI6R5F68DUA", "Overall": "1.0", "Content": "I spent a few hours try to get this camera to work and I wasn't able to.  The image looks washed not which is totally not cool.  I myself am an IT person and I couldn't figure out how to get it work wireless. ---You need to hard wired the camera to the router to setup wireless,  but my router doesn't come with the Ethernet socket.The instruction was written by someone whose English is obviously his/her second language.The biggest problem I had with this camera is that it frequently resets itself and pointed to a unwanted direction.  I am send this back tomorrow!", "Date": "August 15, 2013"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00CZ7K3N0"}}