{"Reviews": [{"Title": "Got the job done.", "Author": "Amazon Customer", "ReviewID": "RKMM4NR9S7NL3", "Overall": "5.0", "Content": "Good price and did the job. Fully compatible and no issues at all. Would buy them again if needed. Happy buyer.", "Date": "March 2, 2014"}, {"Title": "Better than expected", "Author": "L. F. Burris \"Mike from Mexico\"", "ReviewID": "R36LYTH7SXGVFM", "Overall": "5.0", "Content": "I liked how this cable felt, that may be a strange way to judge a cable, but it felt like a good heavy duty cable. The others I was replacing were lighter and felt like they could be pulled apart and these don't, even dragging them around the yard while setting up the cameras I didn't worry about them, because I just felt they could take abuse. Good price too", "Date": "May 19, 2014"}, {"Title": "Great cable at a Great Price", "Author": "P. Velez \"pr18velez\"", "ReviewID": "R2DQD8UHNLIG4Q", "Overall": "5.0", "Content": "Good Buy  and Work's Great. Would Buy Again. Good Length and it Thicker Coated  Cable. Which is Nice because hopeful it will make Harder for Damn Animal to Chew through my Outdoor Camera Cables Again.", "Date": "May 16, 2014"}, {"Title": "Wires", "Author": "Katie Orland", "ReviewID": "R29O8FMDS779AN", "Overall": "5.0", "Content": "Worked perfectly for our needs! Easy to install and we were able to use our cameras that day. Very good buy!", "Date": "April 24, 2014"}, {"Title": "camera cable", "Author": "R. Burd", "ReviewID": "RKIPPD25OX0F4", "Overall": "5.0", "Content": "This cable was used to extend an existing cable so I could move a camera. no loss of picture quality", "Date": "March 30, 2014"}, {"Title": "absolutely perfect", "Author": "robert", "ReviewID": "R3CZGOEEMGQUMT", "Overall": "5.0", "Content": "Works like a charm,  great price and quality. I worried about the quality until I got it. Its easy to think more expensive means better, but can't see a difference between this cable and one I spent 3 times as much for.", "Date": "March 30, 2014"}, {"Title": "Great", "Author": "Lance A Matson", "ReviewID": "R3IXKSGTEJ853H", "Overall": "5.0", "Content": "Exactly as expected.  Cabling was good quality, nicely wrapped and flattened out nicely for installation (didn't stay in a curled up ball).", "Date": "February 27, 2014"}, {"Title": "Great price", "Author": "D. S. Johnston \"\"The Bargain Hunter\"\"", "ReviewID": "RT9Q1HZXSWNWR", "Overall": "5.0", "Content": "These came in handy when I need to extend the length of my cables that were included with my camera package.  Good size for extensions, just need to buy female -female BNC connectors to connect one of these to another cable.  Great product, great price!", "Date": "January 12, 2014"}, {"Title": "Video cable", "Author": "Durwood D. Woodall \"Durwood\"", "ReviewID": "R3H3MXAK2M821K", "Overall": "4.0", "Content": "Good experience with the SainSonic 2 Pack 33 Feet 10M Digital Video Power Security Camera Cable for CCTV Surveillance. Service was prompt and accurate.", "Date": "January 7, 2014"}, {"Title": "Great product", "Author": "Sam V \"Sam V\"", "ReviewID": "R39HSTYUYN1B0R", "Overall": "5.0", "Content": "The product I received matched to the specifications listed in the website. The product works as expected. I buy this product again, if required.", "Date": "December 28, 2013"}], "ProductInfo": {"Price": "$28.99", "Features": "100% Copper made; quality Assured.\nTwo pieces of BNC to RCA converters are provided for each cable to connect to a camera with RCA connection.\nThe video power cable will allow you to transmit video signal and supply DC power for all kind of security cameras.\nReady for Plug and play. Each cable comes with BNC video connector and 2.1 mm center positive power plug at each end.\n33 and 132 feet are ready for your choice.", "Name": "SainSonic Digital Video Power Security Camera Cable for CCTV Surveillance, DVR Camera Power & BNC Video Cable with FREE BNC to RCA Connectors (132 Feet/40M)", "ImgURL": "http://ecx.images-amazon.com/images/I/51X5gCyNP-L._SY300_.jpg", "ProductID": "B00COGL8KO"}}