{"Reviews": [{"Title": "DVR is excellent. Camera picture is good, mount is flimsy. Good cables.", "Author": "Jason Cox", "ReviewID": "R24CCN55BUBCAM", "Overall": "4.0", "Content": "I professionally install DVR Camera systems and was tasked with installing this system in a SAWMILL. I had to mount the DVR in a central room, and run cameras to several indoor and outdoor locations. The DVR box is great, and is easy to install and setup. There are a plethora of options to choose from and I no problem setting up even the most advanced features. The power adapter for the cameras is very sturdy, requires mounting a box, and has a key to prevent access. The 1TB hard drive was excellent and already set up for use.The cables were long enough to reach most locations needed from the central control room, and I had to purchase a couple of 150 ft cables and connectors to reach long distances. The cables are BNC on both end, with power jacks, and the cameras are also BNC.The camera mounts are small and very easy to install. The joint requires a 2mm allen wrench to adjust and is easy to damage the screw head. This is the BIGGEST DRAWBACK for these cameras. They are flimsy and if you don't tighten the screws very tight, the camera will move. They are capable of hiding the cable under the mount and are vandal proof. This makes it impossible for someone to just grab the cable and unplug the power, disabling the camera. That part of the mount is great.The camera signal is ok during the day, but at night under poor lighting you wont be able to see much unless the camera is close enough to it to illuminate it with IR. That's about 15-20 feet. Anything beyond that under poor lighting will not be able to be seen, which is normal with IR illuminated night vision cameras.The system menus were very intuitive and easy to set up. Networking for internet and web browser usage was very easy also.Overall the install was easy, except for the flimsy mounts. This kit was purchased on Amazon by the company, and was a great value.", "Date": "November 13, 2013"}], "ProductInfo": {"Price": "$859.99", "Features": "H.264 Video Compression\nRemote Surveillance with Browsers and CMS\n700TVL Sony CCD High Resulation Bullet Camera\nHexaplex operation - simultaneous record, live, playback, backup, control, & remote access\nSupport mobile phone including iPhone, iPad, Blackberry, Android, Windows Mobile and Symbian", "Name": "Evertech 8CH H.264 Standalone DVR CCTV Surveillance System with 8 Sony Bullet CCD Security Cameras-1TB HDD-LCD Monitor", "ImgURL": "http://ecx.images-amazon.com/images/I/514iEEJpmtL._SY300_.jpg", "ProductID": "B00D6KPQVY"}}