{"Reviews": [{"Title": "It works well, when it works.", "Author": "Crusader", "ReviewID": "R36BILZQI14X4L", "Overall": "2.0", "Content": "Bought this camera to for basic monitoring of my home.  The camera set up easily and linked to the Android app with no issues.  It inexplicably drops WiFi signal even though it registers a 78% strength signal and won't reconnect unless you connect it physically to router again.  I gave the benefit of the doubt and tried a different signal setting with the same issues.  If you want a camera only 60% of the time and a dummy the other 40% this is the product for you.  To much work and constant maintenance to maintain.", "Date": "March 10, 2014"}, {"Title": "Good but not great", "Author": "SafeT \"Troy\"", "ReviewID": "R114DYDEVW50JB", "Overall": "4.0", "Content": "This is a great idea for a camera but it still lacks perfection.  Setup was easy and fast.  Only difficulty with install was finding a hidden power source.  The camera resolution and sound are good (not great) and is suitable for my purposes. After speaking with Uniden, they stated that the push notification was a problem with the iPhone 5 & 5S after the recent iOS updates. They should have a solution in a few weeks. If this is corrected I would give it 5 stars.I would highly recommend this for a one or two camera residential system. The other systems are harder to install and set-up. Most wireless systems have to be connected to a computer in some fashion and have to be viewed via internet.  This does not require DVR, computer, video cords or hundreds to thousands of dollars.  It does require a good wifi router with a strong signal.", "Date": "April 9, 2014"}, {"Title": "Great Product All Around", "Author": "Michael Gibson", "ReviewID": "R2MVPTR3MU34D2", "Overall": "5.0", "Content": "I tried all of the competitors and this is the best out there. Set up from the app couldn't be easier. Video quality is great. Only problem I had is that I didn't buy enough to go throughout my house!", "Date": "April 7, 2014"}, {"Title": "This is a great camera", "Author": "Joselito Q. Tongson", "ReviewID": "R1SLCPPBO8GHXS", "Overall": "5.0", "Content": "I have (2) belkin netcam HD cameras, (6) Linksys IP cameras and (4) Uniden Guardian Cameras.  This one I like the best and here's why:The iPhone access to the video clips anywhere I have a good cellular signal is fantastic.  There is no website server like the belkin.  It connects really fast even though it's 802.11  b/g.The night vision is really good too.  I use 320 by 240 and typically get 15fps which is great for watching live video.My camera never disconnects, once in a while, if I'm configuring my wireless router and restart it several times it may  disconnect but I have it in the backyard on my shed.  All I do is power it down and back up again and it finds the wifi signal every time.  But that's it.  Otherwise, it's connected.  I'm not sure why the other reviewer is having problems, there could be many factors not necessarily related to the camera.  I utilize DHCP reservations which essentially makes the camera a fixed IP address.  I find that my wireless devices are more reliable when you configure your router that way.  It eliminates IP Address conflicts and IMO increases reliability.If they upgrade the wifi to N or A/C I'd get another one.This is the best combination of outdoor capable, good resolution, video clip access via iPhone and night vision.I wish they would allow you to schedule the motion detection but I put in a 32GB micro SD card and it takes a long time to fill", "Date": "March 22, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DGEY18O"}}