{"Reviews": [{"Title": "Great Camera For The Price", "Author": "Kristen Isch \"blondi\"", "ReviewID": "R1KIHWX55QXZJ", "Overall": "5.0", "Content": "Camera looks good. Set up requires a little bit of networking knowledge, (especially if you want to view from the internet), but that is true for any IP camera. I would recommend this camera, it looks just as good as any other 640x480 camera i have seen.", "Date": "November 22, 2013"}, {"Title": "Great value, surprisingly solid construction!", "Author": "Amazon Customer", "ReviewID": "R3QVYGB6PAP4LO", "Overall": "4.0", "Content": "I like the Avacom a lot.  It's the standard IP wifi camera, but the materials are quite decent and the picture is very good for it's budget class.  I have it alongside some generic Foscam clones, some Belkin and DLink cams, and some actual Foscams and I'd say it's probably my best camera so far.", "Date": "December 30, 2013"}, {"Title": "Great value camera", "Author": "Pen15", "ReviewID": "R18NHXKC80CSQX", "Overall": "5.0", "Content": "Camera works great for the price, the picture is nice for Standard def.  The IR cut filter works great.  I like the fact that my foscam software integrates with this camera.  The mounting hardware is decent but the locking collar did require pliers to be tight enough for my confidence .  When you mount the camera make sure you remove the ball from the socket and attach it to the camera first.The low light video on this camera is very good, almost don't need IR if you have a bit of ambient light.As with all cameras of this caliber there are some annoyances like the power/cat5 whip that would require a very large entrance hole (at least 1.5-2\" in my estimation) diameter into a wall for it to pass through and it is too short.The web gui for the camera is basic but functional.  I'm a networking professional so setting up this camera was easy for me.", "Date": "December 24, 2013"}, {"Title": "Works well", "Author": "JAS", "ReviewID": "R8A7URHW6E3NQ", "Overall": "4.0", "Content": "Works great for the price.  Just wish there was an easier way for the motion to detect snow and rain verses people.", "Date": "February 4, 2014"}, {"Title": "great for the money", "Author": "Matthew Headley", "ReviewID": "R3BPJQYCFQO6SV", "Overall": "4.0", "Content": "I was really surprised with everything that I could do with this camera considering the price.  It is wireless so no need for running an ethernet cable all the way to my router which is a good distance away let alone the hastle of drilling through a basement sill or somethign to get INTO the house.  So for the price to have a WIRELESS camera is huge.  Yes you still have to plug in the power for it, but MOST homes anymore have outside outlets available and its easy enough to run an extension cord over to wherever you need to plug in.Now for picture quality... Daytime video and stills are EXCELLENT!  could not ask for better!  Nighttime IR pictures (like ALL cameras of this type I have ever seen) are sometimes blurry and you do not always get a clear picture of a person that may be triggering the event.  I will mention however that the feed at night actually will incorporate some color into it depending on lighting conditions etc... it is not just purely black and white like some that I have seen and that I like.  This is the area that really keeps me from a 5 star rating however.  Because with a surveillance camera, chances are that you will want it at night to detect unwanted people doing unwanted things.  In this regard I have to say that I would not be able to detect really well an intruder or otherwise undesirable persons face in a crowd based upon the pictures you will get from this at least at a distance from being mounted along the soffits on my porch. But like I mentioned I have yet to see one that has this ability in the IR camera.As far as triggering goes, the sensitivity is adjustable in the interface hosted on the camera for this.  I actually had a problem with it being too sensitive at times, but I would rather it record too much than too little.  Things like when it snows the snowflakes/snowstorm sill trigger false triggers.  And yes as the other reviewer stated light changes will trigger events.  This has not really caused me much headache personally and have not gotten mine resetting hundred times a day however.  But I will say that this camera being on my network adds enough traffic that it bogs down a bit sometimes.As far as the red glow at night in concerned, I think of it as a plus... an added bit of security... in the sense of being a preventative measure.  If someone sees the camera they just may not do whatever bad thing they were going to do.  If the problem is like professional thieves or well experienced criminals that are used to beating surveillance equipment then this will not work well (nor will most solutions for that matter)  If the red light is desired to be deactivated and thus deactivating the IR functionality, you can follow steps outlined on AVACOM's website.All of the recording and sending alerts etc can easily be accomplished via 3rd party software as well.  iSpy is a good freeware one that has the ability to upgrade for some of the premium features for a cost.  I found that using that to record videos is a little more stable because the webpage that controls the recording and such will occasionally crash every other week or so maybe.,.. but that is with a dedicated PC being connected to it 24-7.  So I still have my email and text alarms setup on the camera's interface which will work even when you are not running the webpage on your PC or other device.  It will send 6 still photos spaced a sec apart of so to the specified addressees.They also offer free DDNS service.  This has come in very handy.  This is a feature that is best experienced because of the free third party app for my iPhone that AVACOM had worked with to be made.  It gives me such easy access to my camera feed WHEREVER I go (assuming I don't go anywhere in the stone age that doesn't have cellular reception)A general note is that the networking stuff to get this camera to play on my home network and to work from my iPhone on the mobile app all take a good amount of networking knowledge and understanding.  I am an electrical engineer so this stuff was all a snap for me, but Joe average may struggle a bit setting it up and there isnt really a good wizard kind of thing to get you all going and running.  One could probably get all the info they need from googling the specific questions I assume.  Also it seems that the AVACOM tech support should be real good however I have not had a need to call them myself.  Again I liked how they have some technicla stuff on the website and a guide to add an IR cut switch by taking hte thing apart and removing connectors from the PCBs inside etc.  Most companies will say if you touch a single screw on this thing you lose ALL warranty coverage.  These guys seem to encourage it and say that they are available for tech support on whatever you need, which I though was awesome and I hope those who need it find it useful.In summary, apart from better nighttime shots, I could not ask for a better camera and feature set CERTAINLY FOR THE COST!", "Date": "January 16, 2014"}, {"Title": "Very nice camera, great price, works perfect.", "Author": "Joe M \"Colsar\"", "ReviewID": "R2WO1L9887HQ8P", "Overall": "5.0", "Content": "I like this better than my Foscam FI8906W.  I initially placed it right next to the Foscam and watched both for several days.  I would say the Avacom's picture isn't quite as sharp as the Foscam but I could barely notice.  The color on the Foscam is a little 'warmer' but again not much difference.  I have had this running for over a month now and it has been a champ.  The Foscam seems to drop signal often but this Avacom hasn't had a bit of trouble.  For reference, I use Blue Iris  3 software to monitor the camera's so I don't have much to comment on either companies embedded browser.", "Date": "January 16, 2014"}, {"Title": "Great Picture", "Author": "Ken Bloomquist", "ReviewID": "R30E1YK8ZK4NBU", "Overall": "4.0", "Content": "I like this camera a lot but setting it up took a little bit and some tech support which was excellent! It seems to have a little trouble sensing small critters like my cat but no problem with bigger things. I caught five raccoons attacking our fish pond and was able to go chase them away, thanks to the camera. I have a second one on order.", "Date": "January 13, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00DPVCN4C"}}