{"Reviews": [{"Title": "Might be worth it for low quality applications", "Author": "J. Brady", "ReviewID": "R1X2DKVEGXNNYW", "Overall": "2.0", "Content": "This camera is a little difficult to setup on wifi but easy with the network cable. This item might be right for some people but I am used to better quality video and a normal 30fps video speed. Here are the specs. This will help most people decide if they are worth the trouble. This information is impossible to find on the Internet before purchase...Low res mode=320x240 with a frame rate of 20fpsHigh res mode = 640x480 write a frame relate of 10fps", "Date": "November 30, 2013"}, {"Title": "Bad product and poor installation", "Author": "judy tran \"JUDYSFFB\"", "ReviewID": "R2L3OX2SQMBDHG", "Overall": "1.0", "Content": "I just received the pair, I could not even get the system and running even though I am a scientist. Instruction is so poorly written and I realize that user needs to connect the Ethernet cable from camera to router and run the setup. Despite it is called as smartcam, it is not smart at all. I am going to return the system.", "Date": "December 14, 2013"}, {"Title": "SAMSUNG HOME SMARTCAM SURVEILANCE CAMERA SECURITY SNH-1011ND With TWO WIFI SECURITY CAMERAS", "Author": "Jack Carter", "ReviewID": "R1IH0Z6RH52UTO", "Overall": "1.0", "Content": "Spent about a day getting the first camera running and picture quality was good.The next day it would not run at all. I could not even re-install it.I tried Firefox and Internet Explorer with the same result.The second camera I never got it to run at all except for it's colorful lights when I plugged it in to the network and the power outlet. It NEVER worked at all.Neither camera ran on the second day after I shut the computer down.Poor or incomplete instructions even though there were two sets of instructions. Samsung expects everyone to already know how to install these. Well I didn't!Drove me up the wall!Badly organized sheets of installation instructions.I did read that some people had no problem installing these cameras but I was not one of the lucky ones.I should also point out that I am no stranger to PC cameras nor computers.", "Date": "August 25, 2013"}], "ProductInfo": {"Price": "$399.99", "Features": "TWO SNH-1011N value pack\nOne Push Setup in 30 seconds Built-in Mic and Speaker for Two way talk\nBuilt-in IR LED Lamps for Night vision Monitor on PC, MAC, and smartphones\nAudio and Motion detection and notification Free and easy recording on YouTube", "Name": "Samsung SNH-1011ND SmartCam WiFi Security camera, 2-Pack", "ImgURL": "http://ecx.images-amazon.com/images/I/41Bw7zLhWzL._SX300_.jpg", "ProductID": "B00DHOMFD6"}}