{"Reviews": [{"Title": "So far not loving it", "Author": "Ana", "ReviewID": "R1ZVTX2XRZB3GV", "Overall": "3.0", "Content": "It's been only a week installed, just couple of days with smart phone access, so I may get over the aggravation of the initial BS and give it another star or two in the future.First the good-  system appears to work as intended. I connected 4 cameras for now, because everything is too darn expensive, but all 4 work good, day and night.Now the BS-1-The DVR makes stupid loud noise, maybe I got a defective box?, but either the fan or whatever hamster may be inside doing its thing, is very loud. So much for keeping things hiding from the bad guys, unless I place it underground or in a sound proof box, the sound will show where it is.2-the user can control things from a windows or mac device, you download the application from their website, go through a less than friendly set up, and get it done. Ok, so it is 2013, what about an app for the phone and/or tablet? Sure they have an app for that...  IT COST $30 from an app store!!!  so $30 on iTunes and $30 for the android app, oh yes and if your ipad or 2nd iphone, is not register under the same name as your first iPhone, then it is another $30, haven't look if the app for the android phone will transfer to a samsung table...  but WTH? An arm and a leg for the system then nickle and dimmed you to death with the phone apps?  I'm really annoyed at this, the money I'll have to throw in repeated charges for the app would've been almost the cost of a very good camera.  Obviously they are getting away with it, but stinks, why send YOUR customer to different places to get the software needed for YOUR system, even if you have to send them to iTunes and Google store or whoever is the parent company of the Android apps, don't charge that much, it should be free but if you can't get over the greed at least make it that even if a customer needs half a dozen downloads it remains a nominal charge....  as in NOT hundreds", "Date": "August 22, 2013"}], "ProductInfo": {"Price": "$1,798.00", "Features": "IC Realtime DVR-MAX8 Max Surveillance DVR, 8 Channels, 500GB Storage (Up to 12 TeraBytes (12,000G) Internal Storage)\n1.5U Rack Mount Case Specification, H.264E Compression with dual stream encoding, Embedded High-Performance Microprocessor & Linux OS, Pentaflex operation, 240 FPS Realtime Recording\nSynchronized Audio/Video Recording on 4 selected channels, Up-to D1(4CIF) recording/playback quality, All Channel Playback, Smart Search, Loop back video output for every channel\nMatrix video output for Spot monitor applications, HDMI Interface for high resolution video output, USB 2.0 Mouse Interface for super easy operation, Email Notification of Events\nSupport two way audio, SmartPhone Access (iPhone/iPad, Android, Blackberry), Direct network access using IE Browser, Central management software for viewing/managing multiple DVRs, Up to 12 TeraBytes Internal Storage", "Name": "IC Realtime DVR-MAX8 Max Surveillance DVR, 8 Channels, 1.5U Case Specification, 500GB Storage, H.264E Compression, High-Speed Microprocessor & Linux OS, Pentaflex Operation, 100/200/400FPS Realtime Recording, Up to D1 Recording Resolution, Real-time Synchronized AV Recording on 4 selected channels, All channel playback, HDMI, VGA & BNC Video Outputs, Loop back video output for every channel, Option for DVD Burner, 1 Port Matrix video output for Spot monitor applications, 2 x USB 2.0 & 1 x eSATA Port, RS-485 for 3D PTZ Control, Central management software for viewing/managing multiple DVRs, Compatible with modern licensed Alarm Receiving Centres - ARC, Mobile Phone Surveillance - iPhone, iTouch, Blackberry, Nokia, Android, Up to 12 TeraBytes (12,000G) Internal Storage", "ImgURL": "http://ecx.images-amazon.com/images/I/31ho17PDu0L._SX300_.jpg", "ProductID": "B00DUNNAT2"}}