{"Reviews": [], "ProductInfo": {"Price": "$360.00", "Features": "4 channel surveillance DVR features advanced technologies including standard H.264 Compression, SATA interface, input/output for video/audio/alarm, network access and mobile view.\nSupport mobile phone based on Windows Mobile, Symbian 3rd 5th, blackberry 4.6, Android 1.5, iphone iOS 3.0\nRecording Mode: Continuous/ Schedule/ Motion Detection/ Sensor Triggered/ Remote Network\n4 Dome cameras 1/3\" Color CMOS Cameras with 600 TV-Lines Night Vision 3.6mm 24pcs IR LED\nDVR Main Functions: REAL-TIME: surveillance: analog interface and VGA interface, surveillance function through monitor or display. STORAGE: non-working hard disk dormancy processing witch is convenient to radiate heat, reduce the power and extend the life-span. Special storage format which insures the data safety. COMPRESSION: real-time compression by individual hard disk which insures  the audio and video signal stable synchronization. BACKUP: through SATA interface and USB interface such as USB equipment, removable hard disk and so on. through net download the files in the hard disk. PLAYBACK: individual real-time video recording as well as searching playback, network surveillance,recording check, multi-channel playback mode, zoom at arbitrary region. NET OPERATIVE: through net tele-surveillance in the real time, remote PTZ, remote check the recording and real-time playback ALARM LINKAGE: only one channel relay alarm output which is convenient for the alarm linkage and ligth control at the spot. protecting circuits at the alarm imput and output interface which protects the main machine from damage. COMMUNICATION INTERFACE: RS845 interface which fulfills alarm input and PTZ control. Standard Ethernet network interface which fulfills the telecommuting function. INTELLIGENT OPERATING: mouse action function. Fast copy and paste operating for the same setting.", "Name": "4CH Full-D1 Stand-Alone DVR H.264 Security CCTV Surveillance Camera System + 4 x 600TVL CMOS 3.6mm Domo Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41Pzf0qfLnL._SX300_.jpg", "ProductID": "B00E289AHU"}}