{"Reviews": [], "ProductInfo": {"Price": "$6,500.00", "Features": "3 Year Warranty for DVR NVR- FREE US Based Lifetime Technical Support from Our Industry Best DVR Professionals (Installers and Network Engineers)\nFREE Shipping (Continental US) FREE Remote Viewing Apps\n1 TB (Terabyte) HDD (Hard Disk Drive) & DVD-RW Burner\n1080p Resolution - ONVIF Compliant - Remote viewing via Smart Phone Access / IE Windows Access / MAC, iOS Access /Blackberry\nOur Security Surveillance Cameras and DVRs are used by many Federal Institutions. A few examples that demand high quality equipment from us are Courthouses, Police, Fire Stations, Prisons, Federal Buildings and Schools along with National Chains. Quality equipment with strong US based support and some of the industries longest warranties for electronics. Our DVRs / NVRs come with an unheard of 3 year warranty. We can only offer these types of warranties because we know the quality of our products.  Besides Security Camera King's extensive Warranties (3 years) and FREE Lifetime Technical Support (Installation Specialist & Network Engineers) on our staff always ready to help. We offer an extensive online CCTV Learning center that is packed with hundreds of videos of our products and support forums which are manned around the clock. \"But wait there's more\"! Our APPs and Client software are completely 100% FREE. While our competition relishes in getting an acquisition cost up front and then holds you hostage for prolonged periods of time with licensing FEES. These innovative APPS are updated regularly to meet the demands of these newfangled Smart Phones and Devices. They can always be downloaded at our site FREE of charge.", "Name": "Security Camera System Complete Ultimate CSS Hybrid Combo Digital Video Recorder / Network Video Recorder Surveillance Package 1 TB (Terabyte) HDD (Hard Disk Drive) DVD-RW Burner 16 700TVL Cameras 16 Channel Power Distribution Box Three 500 foot boxes of High Grade Siamese Copper Cable 32 BNC Connectors 200 Foot Cat5 Cable for Controlling the PTZ Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/51MAd0gKehL._SY300_.jpg", "ProductID": "B00FK1SJ7K"}}