{"Reviews": [], "ProductInfo": {"Price": "$2,198.00", "Features": "IC Realtime DVR-MAX516D Max Series 16-Channel D1 1.5U Standalone Surveillance DVR with 500 GB Hard Drive; Up to 12 TeraBytes (12,000GB) Internal Storage, Internal HDD: 4 SATA ports(4HDDs or 2HDDs + 1CD/DVD-RW); Up to 16 TeraBytes (16,000GB) External Storage, External HDD: 1 eSATA port (Max 4 SATA HDDs)\nEmbedded Processor; Embedded LINUX Operating System; Resolution: 1920x1080, 1280x1024, 1280x720, 1024x768; Image Resolution: D1/4CIF(704x576/704x480) / HD1(352x576/352x480) / 2CIF(704x288/704x240) / CIF(352x288/352x240) / QCIF(176x144/176x120); Record Rate - Main Stream: D1/HD1/2CIF/CIF(1~25/30fps); Extra Stream: CIF/QCIF(1~25/30fps); Bit Rate: 48~4096Kb/s\nVIDEO DETECTION & ALARM - Trigger Events: Recording, PTZ, Tour, Alarm, Video Push, Email, FTP, Spot, Buzzer & Screen tips; Video Detection: Motion Detection, MD Zones: 396(22x18), Video Loss & Camera Blank; Alarm Input: 8 channel; Relay Output: 3 channel. VIDEO - Input: 8 channel, BNC; Standard: NTSC (525Line, 60f/s), PAL (625Line, 50f/s). AUDIO - Input: 4 channel, BNC; Output: 1 channel, BNC; Two-way Talk: 1 channel Input, 1 channel Output (reuse the audio output channel)\nPLAYBACK & BACKUP - Sync Playback: 1/4/9; Search Mode: Time/Date, Alarm, MD & Exact search (accurate to second), Smart search; Playback Functions: Play, Pause, Stop, Rewind, Fast play, Slow play, Next file, Previous file, Next camera, Previous camera, Full screen, Repeat, Shuffle, Backup selection, Digital zoom; Backup Mode: USB Device / Network\nNETWORK - Ethernet: RJ-45 port (10/100M/1000M); Network Functions: HTTP, IPv4/IPv6, TCP/IP, UPNP, RTSP, UDP, SMTP, NTP, DHCP, DNS, PPPOE, DDNS, FTP, IP Filter, Alarm Server; Max. User Access: 20 users; Smart Phone: iPhone, iPad, Android, Windows Phone. AUXILIARY INTERFACE - USB Interface: 2ports (1 Rear), USB2.0; RS232: 1 port, For PC communication & Keyboard; RS485: 1 port, For PTZ control", "Name": "IC Realtime DVR-MAX516D Max Series 16-Channel D1 1.5U Standalone DVR; Embedded LINUX Operating System; 16 channel video inputs; 4 channel audio in/1 channel out; All channel D1(4CIF) realtime recording; HDMI, VGA output up to 1080p, 1 TV, 1 spot; 16 channel alarm in & 3ch relay out, RS485; 20 Max. User Access; 16 channel sync realtime playback; 4 SATA, 1eSATA, 2 USB, RJ45 (1000M); Resolution 1920x1080, 1280x1024, 1280x720 and 1024x768; Bit Rate 48~4096Kb/s; Record Interval 1~120 min (default: 60 min), Pre-record: 1~30 sec, Post-record: 10~300 sec; Recording, PTZ, Tour, Alarm, Video Push, Email, FTP, Spot, Buzzer & Screen tips; Mobile Phone Surveillance - iPhone, iTouch, Blackberry, Nokia, Android; Up to 12 TeraBytes (12,000GB) Internal Storage, Internal HDD: 4 SATA ports(4HDDs or 2HDDs + 1CD/DVD-RW); Up to 16 TeraBytes (16,000GB) External Storage, External HDD: 1 eSATA port (Max 4 SATA HDDs)", "ImgURL": "http://ecx.images-amazon.com/images/I/31wrR6KE57L._SX300_.jpg", "ProductID": "B00FERP91O"}}