{"Reviews": [{"Title": "Great system!", "Author": "Richard Cranium", "ReviewID": "R3PUMDF3WVXS0J", "Overall": "5.0", "Content": "This is very easy to setup. Nothing but a power cord to deal with. There a couple of things that would make this system better but for the money it's ideal for me. The I/F night viewing is much better than I thought it would be too. If you're looking for a system that's easy to set up and has great video, this is the system. I'm very satisfied with this set up enough to buy the other two cameras that will complete the system.  A side note: this area has had below freezing temperatures...down into the mid 20's for four days with snow, freezing fog, and freezing rain...and now rain and the cameras have not faltered. Except for a couple of raccoons that unplugged one of the cameras when they were chasing each other {I had it on video} ...the cameras worked through it all.", "Date": "December 13, 2013"}, {"Title": "Good hardware, very poor software", "Author": "F. Carothers", "ReviewID": "R1LVVLRMPCJIIE", "Overall": "3.0", "Content": "The cameras are very good.  Unlike another reviewer, we find the low light performance to be surprisingly good.  The motion sensors also seem to be very good.  The set up was simple and the cameras connected with the control panel automatically.  The primary problem is with the software.  The windows PC software will provide access to live video, but not recorded events.  The motion detector does a good job of initiating 2 minute video recordings, but PC's do not have access to the recordings!!After some initial issues with the iPhone and iPad apps, these now seem to be working well.  Comments at the Apple app store indicate other users have experienced similar problems.When we go to the Uniden web site for support, there is no recognition of the G955 model!!  The G755 model is listed, but not the G955.  This will probably change at some point, but for now we must conclude that software and product support are just afterthoughts for Uniden.Again, we want to state that the hardware seems to be very good.  It is only the PC software that is poorly implemented.One additional note:  When the G955 is connected to the internet, the system control screen is disabled.  As a result, none of the touch screen controls are available on the touch screen when connected to the Internet.  If you want to look at recorded video or select any other function on the touch screen, you must first disconnect from the Internet.  Not a major issue, but another example of the poor software implementation.", "Date": "January 5, 2014"}, {"Title": "Low expectations not met", "Author": "Jx", "ReviewID": "R1N320ETT7O01L", "Overall": "2.0", "Content": "At the time of this post, the overall rating of this system was 3.5 stars. I don't think that's low enough so I'm going to give a quick review. I bought this through Costco so I could return it at the store if I needed to, and I will.Pros:-Camera and monitor communicate without setup (plug and play).-Android app does work. I'd also give it 2 stars, but it does technically work.Cons:-Video quality is really bad.-Monitor touch screen only responds about 40% of the time.-You cannot do full screen on one camera while connected to the internet.-You cannot upgrade the firmware while connecting to the internet; however, you must be connected to the internet to get a firmware upgrade. Definitely a major bug. As others have mentioned, connecting the monitor to the internet prevents you from doing anything else on the monitor.-No wireless option for the video monitor to connect to the internet.-The monitor needs to remain on for it to be connected to the internet and your smartphone cannot connect to the cameras unless your monitor is on.If the video quality wasn't awful, I might be keeping the system despite its awful user interface. I'm going to try getting a 720p outdoor wireless camera.", "Date": "February 9, 2014"}, {"Title": "Unbelievably Poor Software.", "Author": "Dale in Tenn \"Dale\"", "ReviewID": "R1OU9B0TMO5KXP", "Overall": "1.0", "Content": "From a functionality standpoint, this system appears to fit our needs.  I had a similar setup from Uniden for over 3 1/2 years and it worked very well.  However, I wanted the new remote and email functions, so I plunged in and purchased this unit.  Wow, was I ever surprised and disappointed.  I've been purchasing technology for a very long time and this has to be the worst software environment I've seen created in a very long time.  It borders on juvenile.  As others have noted, it is unreliable, very touchy in how it is setup.  What I found disconcerting was that they omitted functions that were in my previous system; specifically, local network storage.  The only way to retain images is to pull a microSD card out of the unit and insert it in your computer and copy the files down to your local system.  You can't hook this system up to a USB drive, nor connect it to your internal home network and save files to your NAS server, etc.  You can only browse prestored files that were placed on your system.This software was fully engineered with little regard for actual usage of the product.  I would not recommend this unit, only because of the poor software.  the hardware is as advertised.", "Date": "March 25, 2014"}, {"Title": "Remote Viewing", "Author": "Peter A. Ruscitto \"Pete\"", "ReviewID": "R2Y1DTLO77PNFM", "Overall": "1.0", "Content": "Can't view on a 64-bit notebook, only 32-bit. Additionally, can only be remotely viewed on Internet Explorer (version 7, not 8). The App available for iPad is not worth the download. Others may have found a way to make it work. I have not.I suggest if looking for a security system, do your research first. Had I known before hand what I know now, there is no way I would have bought this system. Not even worth a single \"star.\"Incidentally, Uniden doesn't answer their email. The customer service submission form on their web site is worthless. Prompts for answers to questions not asked. I do web sites daily. There is no excuse for this.", "Date": "February 13, 2014"}, {"Title": "didn't meet expectations...going back", "Author": "Jeetu Mirchandani \"J & S\"", "ReviewID": "R3VAO9MEI3R3MF", "Overall": "2.0", "Content": "Streams video: YesQuality: Okay, not great.Night vision: crappy - you can see movement, but that's it.Software & monitoring interface: PoorEmail alerts: Text only - no picure/video attachmentiOS app: crappyWeb access - almost impossible. Requires IE + some plugins to see video. I gave up.Recurring charge: NoLocal storage: Yes - on a micro-SD card, provided 8GBLots of bugs in the software make it unusable - for example, you cannot use the menu interface on the touch screen monitor when its \"connected to the internet\" (which you have to manually enable). How useless. I have to disconnect from internet before I can browse any recorded videos.This would have been a good buy 10 years back. Not in the competing world which has dropcam and others like it (which have some shortcomings too btw).  Overall, I plan to return this. Didn't buy it on Amazon", "Date": "December 8, 2013"}, {"Title": "Easy install", "Author": "moody", "ReviewID": "R1W4HNTEXIOP56", "Overall": "4.0", "Content": "Nice 9 inch touchscreen monitor. Its wireless so its easy to install. You just need to be creative on hiding the camera power wire. The only thing is the motion is really sensitive. It'l record (for 2 mins) when a insect or bird flies by. You can adjust this setting< but its still very sensitive. Oh< the night vision is AWESOME!!!!!", "Date": "February 6, 2014"}, {"Title": "G955 system", "Author": "Gerald W  Sharp", "ReviewID": "RC48U1SYIWW0I", "Overall": "5.0", "Content": "The G955 is great, however a still larger monitor would be better.  Ill keep watch should that happen  thanks for asking", "Date": "January 14, 2014"}, {"Title": "Just don't expect too much and you won't be dissapointed.", "Author": "George M. Harris \"MistrMyke\"", "ReviewID": "R1J5RG5WKY5ZZ9", "Overall": "3.0", "Content": "It's an under $300 system on sale.  The cameras and monitor are decent for the price.  You are not going to get night vision past about 20 feet without additional lighting.  You are not going to get telephoto HD quality and Dolby sound.The system has many shortcomings, but none that I view as fatal if you just want a relatively inexpensive system.  You have to, maybe, delete and reload one program and download another, an OCX program which allows you to view the camera videos online.  Nothing difficult, but the instructions are vague about whether the downloads even apply to you.  They do.Online features are very limited.  Pretty much limited to viewing and starting recording or taking a picture and recording to the monitor's included SD chip..  You can not view online what has been recorded by the cameras.You need a P.C running Internet Explorer 32 bit to make the online viewing work.  This system will not work with any other browsers.  If you are not a little tech savvy and willing to invest at least a couple hours setting up this system, you will probably never get it to work.  It's not hard, but if you don't have some minimal tech skills by now, you will probably just end up frustrated with this system.If you are not interested in online viewing, the setup is actually very simple.  Pretty much plug and play. You don't even need a computer.  But, what fun is that?", "Date": "April 13, 2014"}, {"Title": "Uniden g955 guardian wireless security camera", "Author": "Putt", "ReviewID": "R3U6AIA6DYZCAH", "Overall": "5.0", "Content": "Well it is time for a review. I have had this system for a couple of months now. When I began my search I was naturally taken by the quality of a wired system. Wireless systems cannot compare to wired systems. Better resolution and better night quality, BUT to say that in my situation where I wanted to use the system having a hardwired system to a DVR was not practical. I also needed a robust camera that would hold up in outdoor weather, which wired systems have, but not too much on the wireless side. They have them, but not in numbers like wired systems. You can get small panning type cloud camera's for indoors that actually have better video quality then the g955. I compared the Lorex wireless systems to this one and they were/are essentially the same. Like comparing a Ford to a Chevy in todays world. Same same. People are passionate for one or the other and say that one is better then the other, but they are almost identical.I bought this camera for a real good deal and for what it is and knowing the video quality of a wireless camera system ahead of time couldn't be more pleased. It does everything as advertised. After really running it through the paces for the last couple of months I bought two more cameras for it through Amazon as they were the cheapest.The screen that comes with it is of course more then just a screen, it is a little computer which you can record live motion as detected by the unit to a simple SD card. Also you can remotely watch your video both LIVE and Pre-recorded on either a laptop, Tablet or smart phone as I have all three and watch them continually when away. I have read some people comment that you cannot watch 'live' video and only pre-recorded video. That is not correct. You can watch live and have the ability to record what you are watching or take a snapshot of what you are watching live, OR you can watch video that was previously recorded. You can also get email alerts when the camera detects motion and starts to record.The video quality is like most if not all outdoor weather proof type cameras at 320x240. Not great, but not bad either. I can see my Raccoons doing their thing in my yard at night or the neighbors cat racing through the yard at night with no problems. Daylight hours a very good and couldn't be more pleased CONSIDERING that I do not have to have a parked DVR and wires running into the house to the cameras etc. IF I was to build a new house I would run wires internally and then would buy a wired system, but this wireless makes it real easy. Not only do I not have to have the monitor in a stationed place at night for instance I can unplug the system and take it up to the bedroom and have it at night there if I want to do that. Totally portable.I have the cameras at all four corners of my house mounted in the eves and have had NO problems with connecting to the monitor whatsoever. No issues there.So considering all of the above there is NO WAY I could not give this thing 5 stars. It has been flawless in operation. I called Uniden one time on camera setup as the camera was new they didn't have the number yet logged in their system to get on line with it.So I hope this might help someone buying a wireless system whether this one or a Lorex or a whatever. DO YOUR HOMEWORK FIRST.", "Date": "April 12, 2014"}, {"Title": "Does not provide the alarm feature provided in older units although thier sales reps said it did by", "Author": "Ronald Campbell", "ReviewID": "R1T3A3BHDMMR3Q", "Overall": "2.0", "Content": "Bought units with the understanding that they gave an alarm when the camera picked up motion and the screen came on. They do not!! Even though the sound feature is still built in the units they apparently didnt know what to do with the sound feature so they turned it into an alarm clock. what a waste of a feature!!  I have suggested that uniden do a software update to allow the unit to give an alarm when the camera detects motion. This would be a great feature for the unit but uniden does not seem interested in making the units more useful to the coustimer so I must return the three uniden units i purchaced from costco and look for a unit that does what the user wants!!  I suggest that anyone NOT purchace this model unless uniden comes up with a software update to improve the detection monitoring feature (unless you want to purchace the unit as an alarm clock which most of us already have). Both uniden and other manufacturers have units that have a motion detecting alarm feature. I suggest you shop around for a unit that does this. it is a valuable feature that you or your wife will appreciate!! I hope uniden wakes up and improves this unit by adding this feature, if it does I would change my do not buy recomendation!!!!", "Date": "March 23, 2014"}, {"Title": "Two cameras were actually stolen from the front of my house...poor video", "Author": "Patrick LoSasso", "ReviewID": "R22AJO27N6YS2U", "Overall": "3.0", "Content": "Today I walked past the camera screen and there was no live feed so I went to check the units and they had been stolen! I reviewed the take and sure enough at 2:30 a.m. two criminals pulled up in a car, climbed on top of my trash cans and cut the wires and ripped them down. PROBLEM: The video is blurry and you can't make out the license plate. So, what's the point? There should be a way to improve the resolution of the video but as it is, anything captured is pretty much unusable for identification. Maybe a good deterrent, but that's all.", "Date": "May 18, 2014"}, {"Title": "Poor Quality", "Author": "T.H.P.", "ReviewID": "R1L4SACO2KR3BK", "Overall": "2.0", "Content": "We installed 4 cameras around the  permieter of our house. The quality is low, footages are blurry. As for remote viewing...what a farce! In order to view on an app, the viewer must be directly plugged into a router or modem (and when it's plugged, you can't really do anything on it). Also, app's device must be on the same network. As for remote viewing via website...there are so many plug-ins and requirements that it's almost impossible to get it to work. We follwed the instructions and downloaded and installed everything, still didn't work. I would advise people from buying this system.", "Date": "April 14, 2014"}, {"Title": "Its okay", "Author": "david torres", "ReviewID": "R2J7JY2R7XGJXC", "Overall": "3.0", "Content": "U still need to hook it up to a power source. If it was actually wireless meaning no chords. that would be awsome.", "Date": "March 11, 2014"}, {"Title": "Poor Support", "Author": "monte horn", "ReviewID": "R3UEAXKF3FKOVG", "Overall": "3.0", "Content": "I'm just starting to set my cameras up and am having trouble selecting my system because I can't list my product which is the G955. No where do I see this addressed. The only support is to go to the FAQ or ask another question and wait for somebody to get back to you. There is no 1-800 support number to call. So, I'm stuck.", "Date": "January 19, 2014"}, {"Title": "First 30 days experience", "Author": "Huel Young", "ReviewID": "R1L4KAQ650EUNF", "Overall": "2.0", "Content": "Pros: 1.wireless2. works nicely inside.Cons: 1.Night use almost useless as it triggers on bugs.2. Night vision (IR) can't be turned off.3. Sensitivity of motion not adjustable; even triggers on tree limbs moving, birds, bugs...4. Won't record while you are viewing stored images.5. Record Time is not adjustable; fixed at 2 minutes.", "Date": "April 13, 2014"}, {"Title": "Always a serious defect in Uniden camera systems.", "Author": "Scarecrow", "ReviewID": "R3P7OBS8YKGAPA", "Overall": "1.0", "Content": "Did not work properly right out of the box.  Loud AC hum...defective circuitry in monitor. Sent back immediately.Last Uniden I will buy.", "Date": "February 5, 2014"}, {"Title": "Must Have Internet Explorer to view on WWW", "Author": "vortexass", "ReviewID": "R1QMHX1B24SL1N", "Overall": "3.0", "Content": "didn't get tis on amazon but this is a decent system had for around $300. you HAVE to have internet explorer to view on web. I use it on the motion trigger mode, records 2min each time it is triggered to a micro SD card (included). cameras start to get mediocre reception at 50' or so. great view angle and quality video though. ONLY real negative is not being able to see it on your mobile device w/o internet explorer. they do advertise FOR USE w iOS or ANDROID on the box. not always true.", "Date": "April 5, 2014"}, {"Title": "Absolutely wonderful", "Author": "VH1817", "ReviewID": "RZJGFQR7OBFZ5", "Overall": "5.0", "Content": "This system is easy to install, easy to set up and easy to use the application on your IPhone. Great picture quality.", "Date": "March 1, 2014"}], "ProductInfo": {"Price": "$499.99", "Features": "9\" Color Touchscreen\nPortable 800 X 480 Hi Res Screen\nRechargeable Li-poly Battery\n3.5 Hours Use On Battery Power\n2 Weatherproof Outdoor Cameras", "Name": "Uniden G955 Wireless 9\" Video Surveillance Monitor with 2 Outdoor/Indoor Cameras (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/417boRrnFzL._SY300_.jpg", "ProductID": "B00FQJEJNY"}}