{"Reviews": [{"Title": "Simple and easy setup", "Author": "Bitsmith", "ReviewID": "RIW09SX6RQ2W8", "Overall": "5.0", "Content": "Although there are cheaper alternatives out there, I find this Swann system to be a great value.  It includes everything you need to install a fully functioning DVR camera system, including the wires.  In addition, I appreciate the value that this particular vendor provides, especially free DDNS (Dynamic DNS) hosting so that you can provide a fixed hostname to access your DVR remotely.Let me run down some of the details (and you'll understand why I went with Swann):-First off, the hardware is pretty generic -- you can find a no-name brand with equivalent specs.  I do think the Swann UI is a bit nicer than some of the no-names AND you can get vendor support very easily (in case you have trouble connecting the iPad/Android apps).  The SwannView apps DO work with some of the knock-off imitation hardware, but you won't be able to call Swann for support.  For this particular model, you use SwannView Plus+ (there are several SwannView variants in the marketplace).-The kit includes everything you need to get started, including the Siamese video/power cables and the AC adapters.  For this kit, there are 3 wall warts:  1 for the Unit and 2 for the cameras.  The camera warts have an optional 4 way splitter.  The cables themselves are thinner than RG56 (thin coax), but seem to function well.  Length is about 60ft per cable and it has a BNC and 2.1mm power connector on each end of the cable.  The camera's themselves have about an 18\" lead that connects to the cables.  I had no problems fishing the cables through walls and I only needed to drill 3/4\" holes to fit them through.-The unit is extremely lightweight, but doesn't come with any mechanism to attach it to a wall.  I was hoping for some screw hangars, but ended up building a small shelf for it in my mechanical room.  The unit comes with 2 video out options -- a VGA and a BNC connector.  Even though they supplied a BNC-to-component-video lead wire, I used a spare RG6 cable to run this to an upstairs TV.  I ended up using a BNC-to-F-connector on the DVR end, and an F-connector-to-RCA adapter on the other.  The unit does have mono audio IN and OUT ports, but I did not use them.  If using the SwannView apps, you don't necessarily need the video out at all -- your IP network does a fine job streaming this to PC's and tablets.-Regarding setup, the unit works well.  It has a pretty good interface for enabling motion detection.  The SwannView apps have timeline feature that shows you little tickers where motion is detected and you can easily skip through just like using a Tivo.  You can control the detection area for each cam individually as well as setup \"privacy guards\" to mask a certain area.  You also have options on what to do when motion is detected.  Swann recommends creating a Gmail account to send messages upon any event.  I have it send me an email with thumbnails of the motion to my mobile phone address.-The unit is accessible either through an HTTP interface or the SwannView apps.  Swann hosts their own DDNS network -- this allows you to make a hostname like \"myhome.swanndvr.net\" and the unit will call back to Swann's servers every couple of minutes to broadcast the IP address.  If you don't have a static IP address from your ISP, this is invaluable for being able to access the unit remotely.  I heard from a professional security guy that Swann does a decent job of keeping the DDNS up.  Anecdotally he mentioned that some of the high-end equipment buyers have had trouble with IP addresses and network outages, but that his Swann customers almost never call.I do have a couple of complaints though -- 1) The unit does not offer an SSL HTTP interface.  Swann has you open up a particular port on your router, but it is regular old unencrypted HTTP.  I don't really like exposing that to the internet, so I leave the config in my router, but not enabled full time.  This means that I need to first login to my router and enable the port forwarding before I can access the DVR admin interface.  It also means that your access information is going across in clear text.  I solved the problem by creating a \"read-only\" account and using that for the SwannView apps.  I am considering putting some sort of reverse proxy in-between to offer SSL support.  2) The other complaint is with the SwannView \"media\" port.  Again, this seems to be unencrypted as well.  A network snooper could technically see my phones connecting to the DVR and grab my \"readonly\" password.  Then he could theoretically see my Live cams.  Since I am mostly accessing via my home Wifi, I feel relatively safe, but this is a huge product omission.All in all, I am happy with the purchase.  I would deduct a half star for the lack of Security, but it seems I am the first rater.  If more people jump in, I might drop it down to 4 stars.", "Date": "January 8, 2014"}], "ProductInfo": {"Price": "$369.99", "Features": "Swann DVR8-1500 8 CH Compact D1 DVR 8x Cameras", "Name": "Swann DVR8-1500 8 CH Compact D1 DVR 8x Cameras", "ImgURL": "http://ecx.images-amazon.com/images/I/51nf1wqaWOL._SY300_.jpg", "ProductID": "B00GMMZ4E2"}}