{"Reviews": [{"Title": "Great Security Camera System", "Author": "SgtDeLand", "ReviewID": "R2GNIRP81C3VDX", "Overall": "5.0", "Content": "The LaView Security System is easy to setup and operate.  The kit came with 2 cameras, cables, DVR with remote control and a mouse.  The cables were long enough for me to run a camera from the corner of my house to the room that I have the DVR setup in.  Installation was easy.  Took me less than 2 hours to setup the cameras and start viewing.  The system has different recording options that are easy to configure, as well as notifications for different alarm settings that you can set for each camera.  An audible alarm as well as email messages make this great for those times when you are away from home. The LaView cameras have a clear picture in daylight and the night vision works good too.  The DVR has a 500 GB hard drive that provides ample room for storage of captured video.  Also, I love the playback features that are incorporated into the DVR.  I would recommend this product for anyone thinking about home security cameras.", "Date": "April 15, 2014"}, {"Title": "Excellent all-in-one package that allows for easy upgrades in the future.", "Author": "Victor R. Reyes", "ReviewID": "R2H8WXC4YOBHQW", "Overall": "5.0", "Content": "I have recently upgraded this system with additional cameras and opted for a stand alone power supply system for all the cameras.  The user interface is graphics based, and is easy to use and understand.  It also works without having to connect it to a computer.", "Date": "January 11, 2014"}, {"Title": "The Best Security System EVER", "Author": "JC", "ReviewID": "R7GHYN84IKRTV", "Overall": "5.0", "Content": "LaView Camera security system is worth money. When I received this system, it only took me 10 minutes to setup. At first, I plugged in 1 camera, then the the picture was very clear. I was surprised at the quality of the DVR because I never hear this brand before. The cameras are affordable, but for the price you it is really good.", "Date": "December 29, 2013"}, {"Title": "Great Security System", "Author": "JRH", "ReviewID": "R3M82IFVIOU2XC", "Overall": "5.0", "Content": "This system is top notch.  I am able to use my iPad and android phone to view cameras remotely with live view.  I can take snap shoots from each device and store the images to it.  I also have my pcs steaming the cameras so I do not need to be watching the DVR directly in order to see live feed.  The interface is simple to use and also adjustable through my pcs.  I love this set up!", "Date": "April 24, 2014"}, {"Title": "Easy to set up", "Author": "BIG MONKEY", "ReviewID": "R2LDOH6EBTC19S", "Overall": "5.0", "Content": "I purchased this item for my home, and I'm very satisfied. Set-up was easy and straightforward, and now I have a capable security system. There is a free app available for mobile monitoring as well.", "Date": "April 19, 2014"}, {"Title": "Great System", "Author": "Lawrence Shorter", "ReviewID": "R3SX4M7JJGWUCD", "Overall": "5.0", "Content": "Bought this system, installed it and it has worked great!Good pictures, easy setup. Pictures on all 4 cams have good clearpictures. I recommend this camera system.", "Date": "April 15, 2014"}, {"Title": "I can see you clearly now!", "Author": "PIRO WIL \"Keepin the fire down below!\"", "ReviewID": "R1E6I5Q3IHETF7", "Overall": "5.0", "Content": "Pros- great cameras, great support by phone, quality of product, engineering of product.Cons- You need to watch youtube videos or know this exact system in order to know which ports to open, how to change aspect ratio of screen, cables could be a little longer.Review- I will start our by saying that I am not a beginner in this and it took some tinkering to get it to work properly. Laview has a great support team and they are very willing to help you out. The product itself is very well engineered including the boxing of the items, and all the installation parts that are needed. The technical information is lacking and therefore needed to place a couple phone calls with laview to get it straightened out. The cables are high quality but could be longer (my house is 1700 sq feet and I did not have much to spare) and are easily brought through all the mounting hardware. This camera system is well thought out but the documentation needs some work to get it to be easily installed. Ports to be open are port 80, 8000, and 8554 which all youtube videos show are the 80, and 8000. Thank you Laview for a wonderful product!", "Date": "May 15, 2014"}, {"Title": "Good value", "Author": "Frank H Blount", "ReviewID": "R6XHA79Z0NY7L", "Overall": "4.0", "Content": "Good value but network set up was not simple. Instructions were not helpful. I have fios and their router is different than instructions. Had to spend a lot of time looking for answers on net.", "Date": "May 9, 2014"}, {"Title": "Not an easy set up.", "Author": "Erica Smith \"Erica\"", "ReviewID": "R3JPZ4DBYWC24A", "Overall": "3.0", "Content": "I bought this system because of the great reviews and the price.  I have hooked up a lot of electronics. The instructions were awful. It took me 5 hours to get one camera up and running remotely sort of. Apparently the remote part only works at my house. I'm not sure I did the port forwarding correctly. Customer service recommends you watch you tube videos on how to set up the system. Of course everything works in the you tube video. They don't explain what to do if it doesn't work. I will have to make a 4th phone call to tech support today since the app is not working 3 miles from my house.  If I can get the app working this system may get 1/2 a star more. The only thing I'm happy with is it didn't cost me more. REVISION: I was finally able to get the app and remote viewing working. I had to call customer service. Jesus was very helpful. However this still was not easy. There are a lot of steps to get the remote viewing working. The instructions need to be more clear. If I buy a product it shouldn't take me multiple phone calls to tech support to get it up and running.", "Date": "May 23, 2014"}, {"Title": "Bad customer service", "Author": "Bobby", "ReviewID": "R2QZVH2S5CSLBW", "Overall": "2.0", "Content": "picture quality was poor on play back and remote viewing...I try to call customer support several time and only was able to get a hold of someone twice and was promise on the first call that technical support would call at the end of the day \"no call\" next day someone try but i was at  work. I think it could been a bug in the system. but because i was trying to fix this problem  for days i ask amazon to refund my money", "Date": "May 9, 2014"}, {"Title": "LaView security system", "Author": "Pen Name", "ReviewID": "R2MJ6JLKQ45GZB", "Overall": "5.0", "Content": "Very simple installation. Camera view is great in daylight and dark. I would recomend this product to everyone I know!", "Date": "April 22, 2014"}], "ProductInfo": {"Price": "$599.00", "Features": "Includes 8 high resolution 600TVL cameras with superior night vision up to 65ft for indoor or outdoor use\nPlug and forget by continuous recording up to 16 cameras up to 30 days on a 500GB surveillance grade hard drive, extend longer with motion detection triggered recording\nSave time and energy to feel secure with easy view and store incident videos to external USB back up storage\nView all cameras live or playback in high resolution on your monitor through VGA, BNC, or HDMI connection\nControl at your fingertips with live view and playback surveillance in your palms via 3G/4G enabled Smartphones, tablets, PCs, Macs, and set email notifications", "Name": "LaView 16 Channel Complete 960H Security System w/Remote Viewing, 1TB HDD, 8 x 600TVL Bullet Cameras, LV-KDV1608B6BP-1TB", "ImgURL": "http://ecx.images-amazon.com/images/I/51YYja4%2BmkL._SY300_.jpg", "ProductID": "B00GNK7BPI"}}