{"Reviews": [{"Title": "Good system for a good price.", "Author": "Tedy D. Anderson \"Go Utes!\"", "ReviewID": "R1EBI0D8ZX7XCQ", "Overall": "3.0", "Content": "Packaged rather well.  First impression is good picture quality (when put together on the floor, in the living room),Setting up for simple life viewing is easy, but then comes the rest ...Best thing to do is read the manual umpteen times, and then going to the LAVIEW website.Find your product there and view ALL instructional videos.You WILL need some more help from your internet provider to figure out how to adapt your router in order to view what is going on *at home* from some other place via an internet connection.  It is NOT real time, but a few seconds delayed.You should e able to live with that.In essence a good bargain, for the price paid for with Amazon.Customer help from *LAVIEW* is good.Cameras are a bit better resolution than other offers.  These are 600 TVL, vs. 500 or less from other vendors.This is just the initial experience, and I will update in a few weeks when it is all installed in the right places.", "Date": "December 12, 2013"}, {"Title": "BANG FOR THE BUCK", "Author": "Karl Sajdera", "ReviewID": "R1NR6YKYT96529", "Overall": "5.0", "Content": "I'm just going to preface this with a note.  If you know nothing about technology, don't pretend you do, then get frustrated when the installation process goes horribly wrong, leading you to write a bad review blaming the product because of your lack of technological skill.  That being said, this system was so easy to install and configure it was ridiculous.  The price was too good NOT to purchase this system, given what you get and the quality of the cameras.  The most difficult and time consuming part was figuring out the wiring path and running the conduit.  The system has the capability of transmitting remotely and if you choose to utilize this, please don't attempt unless you are comfortable accessing and changing your router's settings.The first thing I did was set the system up on the counter to make sure everything was functioning properly.Next I figured out the path I wanted the wiring to take from the camera locations I had chosen.I then installed the cameras, ran some electrical conduit from my camera locations to the entry point on the home and put the wiring through the conduit.Next....and this is really a few steps...place the unit in your desired location, connect the power, mouse, monitor (I had a spare) and run the wiring from the cameras to the DVR.  A tip here is to use electrical tape on the power (RED) side of the wiring as it can become disconnected while running it through the conduit and you won't know until you turn on the system, only to see at least one of your cameras not working.Just follow the instructions.  There aren't hard to understand, but do seem to be written with the assumption that the person reading them has some basic understanding of computers, routers and mobile devices. Programming was simple enough and now I can view the cameras from my phone, tablet, computer and the DVR itself!  Camera quality is more than adequate for what was needed.  Don't expect to pay for a Ferrari at the Chevy price, however if your expectation is an adequate system, decent camera quality and more than enough functionality, then get this one.", "Date": "February 9, 2014"}, {"Title": "Rtech system", "Author": "Marvin Morris", "ReviewID": "RRAE0KM5EN47K", "Overall": "4.0", "Content": "Very good value . Handles my needs perfectly. Very easy to use and a quality picture. I would recommend it", "Date": "May 21, 2014"}, {"Title": "Up for debate. Waiting for solution.", "Author": "Lauren Corder", "ReviewID": "RVQ3R9SUERENJ", "Overall": "1.0", "Content": "Had to turn over control of my pc to a stranger to aquire port info only to be told the dvr required a firmwarr update. And then was told the dvr will not work to please send it back. Still waiting. Hope it gets replaced quick.The only good part was R-Tech is in the U.S. 25.00 ish later.", "Date": "May 18, 2014"}, {"Title": "Good Quality Item", "Author": "justin crawford", "ReviewID": "RDHX67A9W8IB0", "Overall": "4.0", "Content": "If you're looking for a wireless system, this isn't it.  I tried a cheap wireless system and it didn't work.  Unless you want to spend $2k, your not going to get anything that's good.  That said, this system is awesome.  If you know basic computer skills and how to run wires, you'll have no problem with this system.  I did have to purchase additional wires because the enclosed 60' of wire per camera wasn't enough.  It is easy to install.  The quality of the cameras is surprising for the price.  The default setting for the camera recording quality is low, so you should change that to highest in the settings and it is crystal clear.  I haven't even read the manual and I have it working in a satisfactory manner.  There are so many more options I haven't even explored yet.  If your looking for a good quality home security surveillance system for a cheap price, this is the one to get. $238.00 for the entire package!  That's around $50 a camera, not counting the DVR and the remote monitoring capabilities. The DVR works like a separate computer with it's own operating system.Good luck!  If you buy this system, I don't think you will be disappointed", "Date": "May 18, 2014"}, {"Title": "Good high quality cameras. Poor manuals and absolutely no tech support.", "Author": "Paul L Smith", "ReviewID": "R1QWHCOBO8IOYB", "Overall": "3.0", "Content": "Good high quality cameras.  Poor manuals and absolutely no tech support.  The manuals on the mini CD cannot be played in most modern computer disc drives.", "Date": "April 6, 2014"}, {"Title": "Great Product", "Author": "Beverly Pearson", "ReviewID": "R26BP87ZGFRQO6", "Overall": "5.0", "Content": "This is the second surveillance system I have bought the first one was no good but this product I absolutely love it was easy to set up and install.  Easy to function.  I have very clear images that are sharp.  The play back is easy to figure out even for someone who knows nothing about it.  Lots of help from the support if needed.", "Date": "April 8, 2014"}, {"Title": "no remote", "Author": "Tim Snow \"snowman59\"", "ReviewID": "R35AZ6USC4H4UW", "Overall": "3.0", "Content": "Remote doesnt work on the unit. They sent me another remote control but the problem is the unit itself. Didn't feel like going through the hassle of returning it", "Date": "February 22, 2014"}], "ProductInfo": {"Price": "$419.99", "Features": "8 CH Realtime Recording and Playback\nH.264 Dual-Stream Video Compression\n500GB HDD Included\nLive View & Playback Available on Internet Browser and Mobile Phones\n4x 500TVL Outdoor Cameras with 3.6mm Fixed Lens and 50ft IR Range", "Name": "R-TECH Surveillance System with 8 Channel 1080p 500GB H.264 DVR with 4 500TVL IR Outdoor CCTV Security Cameras - 3G Android, iphone, ipad and Tablet Compatible", "ImgURL": "http://ecx.images-amazon.com/images/I/51f%2BOAewjJL._SY300_.jpg", "ProductID": "B00G3EOU58"}}