{"Reviews": [{"Title": "It works, but definitely not ideal", "Author": "H-Bar", "ReviewID": "R1NQWX45XQIM7J", "Overall": "4.0", "Content": "See update below ** Feb 5 2014 **Purchased a week ago.  Setup was fairly simply.  Viewing live feed on web app works great.  Alarm notifications to Android app appear to be reliable. I can make out sound on the Android app feed.  It's not ideal, but for the price I can live with it. Now the problems.1.  The camera is supposed to (I believe) save a picture to go along with the alarm.  On the web site, and Android app, all I see is a broken link icon where a picture is supposed to be.  Yes, I know there was an alarm triggered, but I have no way of determining what caused it.2.  Connecting my camera to Google account does not work.  Same goes for my Twitter account (for alert notification only).  So I have no way of seeing what the camera saw in the past.3.  The interior daytime picture has a purple hue.  Not sure why.  It's clear and reasonably sharp, but the color is really strange.4.  The interior nighttime picture isn't bad (considering the room is completely dark). When the camera IR lights are on, I am wondering if some of them are burnt out.  Not sure how many there are supposed to be, but they don't completely circle the camera.  There appear to be only 6 lights, but it seems there should be 8.  Hopefully Tech Support can clarify.Based on the above, I give it 3 stars.  If I can get some of these items corrected, I will change my rating appropriately.I plan to call tech support about the problems.  They are only open during the week, and I installed the camera, and wrote this summary, on the weekend.  Check back for an update later this week.** Update Feb 5 2014 to numeric items above1.  See note #2 below.  Once my camera made friends with Google, there is now an icon for both You Tube and Picasa (that I can click on to get a picture/video of what triggered the alarm), as well as the alarm time.2.  This past Monday I received an email out of the blue from You-Tube stating that I have successfully uploaded a video!  It was from my camera.  Apparently an alarm was triggered, and it uploaded a pic and video to Google.  I have NO IDEA why the connection to my Google account started working, but it did.  The last feedback I received from the camera software was that it was unable to connect to my account.  Well, it was a nice but unexpected surprise.3.  This has not changed.  Picture clarity is still good (both daytime and nighttime with IR).  Color is just off.4.  I called the Samsung tech support line about the IR lights.  I only had to wait a few minutes to speak with a fairly knowledgeable person who spoke great english.  I mentioned that there was not a complete ring of IR lights circling the camera eye - just an incomplete or \"C\" shaped circle of 6 red IR lights. I told him I was concerned some were burnt out (to make it a complete or \"O\" shaped circle).  He at first quickly stated the IR lights should make a complete circle, but after checking with (I guess) some of his associates in the room, he came back to say there should be only 6 lights making a \"C\" shaped circle.  I still wonder if he is right.  I'll have to do some searching on the internet to see if I can get independent confirmation.Additional notes:a) The motion detection seems to be either too sensitive, or not sensitive enough.  On the web-based setup screen, there is a slider bar to adjust the sensitivity setting, but it appears there are only a few pre-set marks that you can move the slider to between the farmost left and farmost right positions - it's not infinitely adjustable between the leftmost and rightmost setting.  So if you need completely reliable motion detection, this may not be the item for you.b)  I recently had power outages due to winter weather storms.  Every time the power came back on, the camera quickly reconnected to the Wi-Fi network.c) The Android app is nice, and you can quickly pull up your camera (it can handle multiple cameras), and see AND HEAR what the camera is seeing and hearing.d)  It also has a sound detection alarm setting that I have not used.  I guess it would be good for detecting a window breaking, etc.  I have not used it because I have dogs, and they would be setting the alarm off all day with their barking every time a deer or squirrel walked by.Since the whole Google thing is now working, I'm increasing my rating to 4-stars. It's not AT ALL a perfect camera, but you can't beat the features FOR THE PRICE.", "Date": "February 2, 2014"}, {"Title": "Don't want to share, just monitor", "Author": "Lariatbob", "ReviewID": "R3PIPFA9HSLCTE", "Overall": "1.0", "Content": "I was surprised to find out that you must register with Samsung, agree to allow access to your images, in order to use the camera.Returned it.", "Date": "February 23, 2014"}, {"Title": "Good Product", "Author": "Stevo", "ReviewID": "R2EUJFL75UOTCQ", "Overall": "5.0", "Content": "I use this product to monitor my pets when I'm away. The cam does everything it's advertised to do well. It is easy to set up, easy to access the live feed, and the price is right. Hard argue against the value here.Ordered on Saturday 12/21 and arrived in time for Christmas!", "Date": "January 6, 2014"}, {"Title": "Easy to use/set up and pretty cheap", "Author": "P. Chung \"PC\"", "ReviewID": "R1FPEM3FLI7I8Y", "Overall": "5.0", "Content": "This camera was very simple to set up and came with an instruction sheet just in case you couldn't figure it out. I used the app on the smart phone and it took less than 10 minutes to set up. I am happy with the product especially since this device can be used as a wireless device needing only a plug for power. For the price, the image quality is really good and the product is not bulky so it is perfect. I would recommend this product to my friends.", "Date": "December 30, 2013"}, {"Title": "Great for Apartments", "Author": "Patsy21", "ReviewID": "R2OCATSKX55JZW", "Overall": "5.0", "Content": "Got this for my son and girlfriend so that they could see their dog while at work. Works great and he says image is crystal clear! Buying one for myself right now:)", "Date": "January 31, 2014"}, {"Title": "Fast shipping and does exactly as described", "Author": "Rich N", "ReviewID": "R2I1CNA56CWE5G", "Overall": "5.0", "Content": "Giving it 5/5 because it's does exactly as described plus fast shipping. There's clear instructions on how to setup the camera properly. Within 10 minutes, it was up and running. Straightforward and easy. Recommended if you are looking for a no hassle product and added security to your home.", "Date": "December 26, 2013"}, {"Title": "Love It!!", "Author": "Julie Rush", "ReviewID": "R17WJACTYJXKPM", "Overall": "5.0", "Content": "I'm very impressed with this camera and how easy it was to set up.  From the moment I took it out of the box, it took maybe 15 minutes max.  Within that time, I was already viewing the camera from my iPhone.  The picture quality is very good and the 2 way audio worked great.  The lag was only milliseconds.  For the price, I doubt anything can beat this. I highly recommend this product!", "Date": "February 7, 2014"}, {"Title": "Exactly what I wanted", "Author": "Maxiboy813", "ReviewID": "R1WOCUMQ1AG0OC", "Overall": "4.0", "Content": "I am not a techie, but it was exactly what the reviews stated-easy to set up and easy to use.  Clearly, it has given me peace of mind when I go out for several hours and leave my puppy in his kennel.", "Date": "March 7, 2014"}, {"Title": "Less than 1 star DO NOT BUY!", "Author": "Old MUC Friend...", "ReviewID": "RBUOW8S6MFYUQ", "Overall": "1.0", "Content": "Absolute garbage.  Samsung and its retailers should be ashamed selling this.  Balky software; took eons to set up only to freeze up and not work.  Resetting camera did no good other than to not be able to see it ever again online!  If I could give this camera negative stars, I would give it  minus 5 or even 10.  Thanks for wasting my time Samsung.", "Date": "April 12, 2014"}, {"Title": "Great product, great price...", "Author": "Lou G", "ReviewID": "R3B4Z4VKCCDY6L", "Overall": "4.0", "Content": "The camera works great and is easy to setup if you have average computer skills.  The \"refurbished\" label that applies to this is irrelevant.  The unit I received was flawless in terms of physical condition (complete with the little plastic sticky protective covers like you'd find on a brand new cell phone) and performance.From what I read, the only reason these units were refurbished was because of a piece of hardware that they determined needed to be upgraded.  I could be wrong, but that's what I remember reading.In terms of setup, I would just advise everyone to FOLLOW THE INSTRUCTIONS.  I know this is difficult for some of us who like to just plug it in and then start \"problem solving\" until it works.  But if you follow the steps in the instructions, I would think it shouldn't take more than ten minutes tops to get it up and running.The only reason I didn't give the product 5 stars is because of the storage capability.  This product does not have an external storage slot for an SD card.  I knew that going in, but I thought I'd be able to use youtube (a paid account with upgraded storage) to store a week or two's worth of video from the business where I use this camera.  I was disappointed to see that only 30 second clips are uploaded to youtube.  So I looked into a 3rd party cloud storage solution.  Samsung has partnered with iWatchlife to offer a cloud storage solution.  Although the price is very reasonable and it does work, I'm not thrilled with the iWatchlife at all.For a petcam, baby monitor, intruder monitor, etc, this camera is awesome and a great value.  If you need to be able to store a video feed for a business or for other reasons, I'd do some research about 3rd party storage solutions and make you can get what you need.", "Date": "March 15, 2014"}, {"Title": "Great, Well-built Camera...Did not work well with my security system", "Author": "Larry Fitt  \"SCC man\"", "ReviewID": "R1KA2023IJ61ON", "Overall": "3.0", "Content": "The camera was delivered quickly and well packed.  The software, however, did not work well with the rest of my security system.  I am one customer who does not want my security images on \"the cloud\".  I prefer direct connection to my DVR by wire or wirelessly.The supplier was exceptional in refunding my purchase funds.", "Date": "February 24, 2014"}, {"Title": "Where do I even begin....", "Author": "P.", "ReviewID": "R39E1XTGNUAOZ3", "Overall": "1.0", "Content": "So I thought an expensive product from a company that makes pretty good phones would make a good security camera right? No. Not at all.  First off if they wanted to enter the whole security space thing why is there no option for storing events on the phone (I have a 32 gig card lots of space) or a PRIVATE account. Instead it only can only be uploaded to youtube or picaso (real lazy work there Samsung). Now I don't have anything embarrassing, its just my room with my ferret so I'm not upset about it being uploaded for everyone to see.  There is one advantage of this, a smart thief that robs a house will also ROB your dvr leaving you with no footage of the said robbery, these videos go straight to youtube servers so they can't get rid of the footage.  Samsung should have started their own servers for these security cameras with more options but they were too lazy to do that. As for the motion detection and audio detection it depends on how you positioned the camera and the sensitivity level, all cameras that I've ever used have this issue, its either too much detection or no detection to little at all. You gotta find the sweet spot.  This device does something though that I have never seen with another device, when the sun is rising or setting, the light is changing you will hear really loud clicks, really really loud as if its slowly turning itself into night vision and will begin recording an event because of this. Did Samsung test this camera at all? Is there no dawn and dusk in Korea, how did that get past testing? How was that not corrected? I've never seen another security camera do that.  After awhile it stops detecting at all, I figured (have an android phone with app killer) that maybe I should let run in the background, stop closing it but no it still won't record, sometimes it would only record if I turned the lights on during THE DAYTIME. I don't even.... Serious light issues. Sometimes it would only work if I walked up to it and tapped the hell out of it, oh now your awake and recording? Is that what the thief will do when he robs me?  I've now got to the sweet spot that I was talking about, kept it turned away from the window, the sensitivity level is right and it does work. Sometimes it doesn't, it can be frustrating but for the most part it does work. I just wish they had made servers where every new video will privately be recorded and erase the oldest video when it gets full, then let you store the important ones.  The set up process is simple but what they forget to tell you is YOU HAVE TO LOG IN ON THE SAMSUNG WEBSITE ON AN ACTUAL COMPUTER TO MAKE IT UPLOAD VIDEOS TO YOUTUBE. For a awhile it wouldn't upload and I had set up the account in the app but you have to go online to the actual website and that was never stated in the directions . (you could probably do that too from a smart phone).  The camera and app do have a lot of cool features and yes you can zoom in, you can put the camera upside down and they have options to flip the video so thats great, the night vision is good too, I'm not recording a massive fort Knox, just my room. The night vision sensors are in a C which looks alarming as if maybe a sensor is out but thats normal, night vision works fine.  I got this at a very cheap price so I'm gonna keep it and there are some advantages but there are a ton of cheaper ip cameras out there with much better recording storage options (that part is huge Samsung, indirect protected youtube servers are a good start but thats amateur stuff come on) and serious light detection issues, falling asleep on the job but \"suddenly\" waking up when I turn the lights on in board daylight Or smack the camera....", "Date": "April 4, 2014"}, {"Title": "Works well", "Author": "Michaela Muranova", "ReviewID": "R15YFXRW2ZRMGT", "Overall": "4.0", "Content": "Works really well but the setup was a nightmare. Had to call the support line twice and had to do the wired setup.", "Date": "March 29, 2014"}, {"Title": "Terrible", "Author": "Shawna", "ReviewID": "R5T1N88NZ8EJ3", "Overall": "1.0", "Content": "I'm so mad at this thing I can't even take a moment to wrap it up and return it.It worked for 1 day, then the cameras went offline and I cannot get them back online. I've reset them, swapped them, and everything else a number of times. It's a total bust. I don't recommend this product.", "Date": "March 28, 2014"}, {"Title": "great little web cam", "Author": "P. Menard", "ReviewID": "R152D61S3AD1Y3", "Overall": "5.0", "Content": "First impressions:Easy enough to setupSome of the steps were ambiguous but it seemed intuitive, took maybe about 25 minutes this is my first camera so i don't have anything to compare it to.I didn't care that much about resolution, this is just for checking in on the dogs and the house from work. for the price i'm impressedFollow up:I liked it so much I just bought another oneEasy to set up and the picture is reasonably goodI check mine through my smart phone from workYou will need to set up an account to have a portal to view themThis done through Samsung and there is no charge", "Date": "March 14, 2014"}, {"Title": "Works exactly as described and is very functional!", "Author": "Jonathan S.", "ReviewID": "R194DZVFC7KV9P", "Overall": "5.0", "Content": "I ordered this camera for home security without having to pay the monthly fees. I did a lot of research and came across this camera. The camera is 'remanufactured' but it arrived looking like new, in plastic, the Samsung box, and with all pamphlets or brochures. It was really simple to install (only four small screws) and it took me about 2 minutes to program. When I say program I mean: 1) download the app on your phone or go the website on your computer; 2) plug it in the wall; 3) type in one page of information, name your camera, and wait for the light to turn to the designated color (I think it's green). This camera does not turn from side to side, but it does zoom in. The wide angle lens does offer a very vast view of the room your trying to watch. The night vision is awesome. The daytime vision is even better and very clear. There is a motion sensor which you can turn on or off via the app or your computer. I will say that it's a little sensitive. I have a camera in my living room and with my blinds open, if the sun changes directions or a bird's shadow graces the room, it will alert you. Of course, you can shut it off if it becomes an issue. I believe there's a function when you can save a voice recording on it. I think you have to be standing in front of the camera while recording and it is probably just an added deturrent against intruders. The camera DOES NOT alert authorities if a break-in occurs. It ONLY alerts you on your phone or via email. Take note on this part if you purchase one: When the night vision comes on, you will see red lights in the front of the camera. They do not go around the whole lens! They only form a 'C' shape. This is how it is supposed to be, so don't freak out.I purchased the camera to watch my home while I'm gone and keep an eye on my dog while he's locked up. It's kind of nice to have a camera that I can record my voice on, so if he does get into mischief, I can play the recording and typically he'll be at ease. The camera works great, there are no monthly fees, and Samsung is a trusted brand in my eyes.", "Date": "March 14, 2014"}, {"Title": "Works as described.", "Author": "Chummly", "ReviewID": "R3STBISG3BH3UY", "Overall": "5.0", "Content": "I was concerned because this item was refurbished. It worked right out of the box. Easy set up. One thing to consider is the infrared. You cant face it out a window because you get a reflection from the IR lights. Works quickly from my Iphone. I can view the camera image in about 10 seconds after I open the app. You can change views and photo capture images.", "Date": "February 21, 2014"}, {"Title": "Great Camera with App and downloads videos to YouTube Automatically", "Author": "vwbugman", "ReviewID": "R313SV1U4O4K37", "Overall": "4.0", "Content": "The best way to manage the camera is download the Samsung Smartcam App. It will walk you step by step through the process and it's great to have when you want to keep a check on things. I have it in my cabin in Ellijay, I can beam in live and look at if you camera detects any motion or audio, I am alerted on my phone. Night vision is not the best because any bright light (like a street light) can mess viewing up. Overall, it's a great little camera and has a microphone and speaker so that's a huge plus. As soon as it detects motion, it will automatically start recording and will be downloaded into your YouTube account and you can also watch on the App.", "Date": "March 3, 2014"}, {"Title": "Good Buy for the Money", "Author": "Pamela H.", "ReviewID": "R2WD6Q6ILYHC1F", "Overall": "4.0", "Content": "I've ended up purchasing 3 of these.  They are easy to set-up and access.  Sometimes the resolutions isn' t the sharpest but still good.", "Date": "June 2, 2014"}, {"Title": "Perfect for what I wanted", "Author": "Gary", "ReviewID": "R1AZS2SLIXAM32", "Overall": "5.0", "Content": "Wanted to start out small, and see how well this would perform. It was a blast to set up, and use. At first I used it to monitor our new puppy at home. Ultimate goal was to put it in our boat for when we weren't there. It has surpassed all expectations in both cases. Reliable, easy to use, and provides a pretty darn good image too. The two way sound capability is a plus, especially with a pet!I would highly recommend this camera to anyone who just wanted an easy to set up camera, that they can connect to from iPhone or iPad anywhere!", "Date": "May 27, 2014"}, {"Title": "Beagle Cam", "Author": "Julie S.", "ReviewID": "R1EE9SSTJ6S6CN", "Overall": "4.0", "Content": "We purchased several of these cameras to keep an eye on our senior and ill dogs when we are unable to be home with them. You can see what is going on in the room/area well and we had no problems with set up - it was very easy. Now we can check in on our dogs at any time during the work day and have the peace of mind of knowing that they are ok, and the house is secure. I do wish that the resolution was a lot better and that you could move them around to see more, but perhaps in a newer model that will be available. In one of the cameras we purchased, we discovered that the power supply was DOA right out of the box. We contacted the company and there is a rather extensive process to exchange it, so we just purchased a new power supply here on Amazon. I really like that you can hear what is going on through the cameras and that they have a feature where you can speak through them, as well. The quality of sound from us via the phone app to the house isn't great, but it is clear enough to understand. In addition, if we forget to leave a light on (we work evening shifts), the night vision is good enough for us to still get an idea of what is going on and count doggy heads. A great buy for the money, but we are still hoping for some improvements in newer models. Would be fabulous baby/kid/nanny monitors.", "Date": "May 2, 2014"}, {"Title": "Good camera", "Author": "Raj91", "ReviewID": "RW73A5U35GHIG", "Overall": "3.0", "Content": "Very easy to install with android and iPhone, but not easy to do it with laptops, especially with Vista it doesn't work. With iphone you cannot save the camera password and every time you want to watch the video, you will need to enter the password. Android works just fine", "Date": "May 1, 2014"}, {"Title": "Works very well", "Author": "nichole", "ReviewID": "R2EUWDWGS0BDA2", "Overall": "5.0", "Content": "Very Easy to set up. Picture is good.  The motion detector works great and the event log can be viewed at any time. I would definitely recommend.", "Date": "April 16, 2014"}, {"Title": "Camera does not operate on Clear wifi modem", "Author": "bobdelduca", "ReviewID": "R19MJZ7UIVA4QV", "Overall": "1.0", "Content": "Camera will not operate without specific wifi modem. Support from Samsung was intentionally difficult. There were not specific directions to setup.", "Date": "April 16, 2014"}, {"Title": "Excellent item. Highly recommended!!", "Author": "Maria C Mundo", "ReviewID": "R1NFYDHOYQM5DZ", "Overall": "5.0", "Content": "Love this camera. I've had this for at least 3 months and no complain about it. I use this to monitor my doggy while home alone.", "Date": "April 15, 2014"}, {"Title": "Love! So worth it!", "Author": "Krystle Machac", "ReviewID": "R8V74R4QON3F8", "Overall": "5.0", "Content": "Wonderful product! Was worried but a refurbished product but it works wonderfully! And for the price compared to other products who can complain! My husband set it up within 20 min! We both have the app and are able to see what's going on! No problems so far, we've had it 2 months!", "Date": "April 13, 2014"}, {"Title": "PLEASE read this before setup. Update.", "Author": "brewster lewster \"brewsterlewster\"", "ReviewID": "R2S0GTQ2H7TRS6", "Overall": "2.0", "Content": "In short this is a really good gadget for the price.  But FIRST, do NOT install the third party software in the big color pamphlet unless you want to pay for extra services!  Go right to the smaller, duller Samsung instruction sheet for the free service which really is quite inclusive.  Yes, you have to give Samsung your gmail address (which includes youtube or course) and password, but just set up a dummy account for it and you dont have to worry about security.  It may take a day or three for the youtube videos to finally work, for some odd reason, but eventually you should be notified that they are indeed being uploaded to your PRIVATE youtube channel.Everything seems to work so far, two weeks into owning it:  wireless connection, android app for all still and live viewing/sound, HQ picture, B&W; night vision, two way communication sound (my dog was really puzzled by this one).  I get still pics in my gmail and video clips in my youtube.  I took one star off since it is not always consistent taking the pic at the time of motion or sound activation.  The only thing that concerns me is it gets a bit warm.Update:  OK it was great until the latest update when they converted Youtube vid clips to Google Drive.  I set it up just like before and saved to G-drive just once and no more!  Also the camera now takes pics every minute or so until I shut off the audio setting entirely.  And the motion detector does not work anymore.  So all it is good for is a live view camera which is nice but not what I paid for (you can still see live vid with app but an extra step says that my camera password does not match which I just click through and it is fine).", "Date": "April 8, 2014"}, {"Title": "bry-ant", "Author": "N. bethke \"dreamchaser\"", "ReviewID": "R8ION0Z7F0DPY", "Overall": "4.0", "Content": "excellent device, so far meets all needs..can check house any time of day or night..recommend for anyone\" s home or business", "Date": "April 7, 2014"}, {"Title": "Setup Easy, Picture Okay. Pictures only and no video with subscritpion", "Author": "Amazon Customer", "ReviewID": "R278TMOCQOVD86", "Overall": "2.0", "Content": "Setup was pretty easy with this product.  The picture quality seems a little lower than I expected in comparison to a basic Swann system I already have.  I like the wireless capability.  I thought you can have this automatically upload to Youtube etc for the audio or motion alerts but you have to pay a monthly service for that.  Otherwise the motion and audio alerts do work well on my Android phone but essentially nothing is recorded unless I take a picture manually.  Also you can only take snapshots without the service.  No video, without that subscription service.  That was disappointing.", "Date": "April 3, 2014"}, {"Title": "no Apple router???", "Author": "Kristin Kitterman", "ReviewID": "R23HQ8M8QS21M2", "Overall": "1.0", "Content": "Where oh where do you mention that this is not compatible with an Apple router??? Would have been nice to know that before I purchased it!", "Date": "March 29, 2014"}, {"Title": "great camera wrong plug", "Author": "Raleigh Moreno", "ReviewID": "R1MXF3UZSR4D2G", "Overall": "4.0", "Content": "great camera works great once I got the proper plug they sent a german end plug instead of a us end plug", "Date": "March 29, 2014"}, {"Title": "Good camera for price", "Author": "Vinh", "ReviewID": "R13MD88MJXC9I9", "Overall": "4.0", "Content": "Refurbished camera. Easy to set up, easy to use.One thing to note, the IR lights does not go completey around the lens. It'll form like a C. Weird design.", "Date": "March 25, 2014"}, {"Title": "Unable to remotely view camera", "Author": "Trenice Edwards", "ReviewID": "R27DIKM6Q83073", "Overall": "2.0", "Content": "Unable to remotely view camera thru the Web...although the Web does see the camera, after installing required plugIn, the Camera still does not display...no Error is thrown...", "Date": "March 24, 2014"}, {"Title": "Doesn't work with any Mac Router", "Author": "Dustin Z Sinkey", "ReviewID": "R1ANB0CTBLJHHN", "Overall": "2.0", "Content": "I thought this would be great and it would be if it worked with an Apple router wirelessly.  You can hook it up to an Apple router either net cable, but not through the wifi.  I thought I was doing something wrong or entering in my password wrong, but I called tech support and they told me they're incompatible.It's a shame because I really like that it will post a video to your YouTube account if it detects motion.  I\"d give it four stars if or more if it worked with my Time Machine.", "Date": "March 20, 2014"}, {"Title": "smartcam", "Author": "Nancy King", "ReviewID": "R3L5FB50ZYZ4GF", "Overall": "5.0", "Content": "I needed a camera so I could monitor  the kid downstairs and be with mom upstairs,,tried another and couldn't get it to work,,ordered this one and had it going in no time,,would recommend this to everyone.", "Date": "March 19, 2014"}, {"Title": "Worthless!!!", "Author": "Martha Edgley", "ReviewID": "R1166KDJZJ7OI0", "Overall": "1.0", "Content": "I bought this camera because of the size and the easy set up.  However, this camera does not record events!", "Date": "March 17, 2014"}, {"Title": "This is a good little camera for the money", "Author": "Andrea DeCou", "ReviewID": "R3VB2CCSKX3Y7F", "Overall": "4.0", "Content": "The camera was very easy to set up and very easy to use on both my computer and smart phone.  The drawback was I found out my wireless at one house was not up to snuff and it went off-line.  I have a feeling it has something to do with the strength of the signal.  The one that is working in the other house has never given me any trouble.  It helps make me feel very secure about both places.", "Date": "March 16, 2014"}, {"Title": "Great product", "Author": "Robert L. Robbins \"Old Movie Lover\"", "ReviewID": "RWOTX4MG2ZHM0", "Overall": "5.0", "Content": "Works just as described. Excellent night vision. Audio feature is great. Works with my iPhone and iPad . Would buy again..", "Date": "March 16, 2014"}, {"Title": "good price", "Author": "Jose Oscar Medina", "ReviewID": "R9U9A26IEOFHU", "Overall": "4.0", "Content": "That's very easy set up camera.also even refurbish its good to check u house o your pets in u work", "Date": "March 15, 2014"}, {"Title": "Overall great camera.", "Author": "johnnycapezio", "ReviewID": "R359FPH42SIK39", "Overall": "5.0", "Content": "Great quality for the price. Good picture/sound whether day or night.They don't warn you that after set up, if you unplug it, it takes several minutes to boot up again.  This is only a small issue though. I would recommend this to anyone needing a quality wifi camera on a budget.", "Date": "March 14, 2014"}, {"Title": "Disappointed unfortunately", "Author": "Carla Parisi", "ReviewID": "R3S2CFP2TGHWG", "Overall": "1.0", "Content": "Really wanted this to work. We couldn't get it set up easily. Returned it. We will try something else instead", "Date": "March 9, 2014"}, {"Title": "Smartcam", "Author": "Cindy", "ReviewID": "R39OKDA4U87ONA", "Overall": "5.0", "Content": "I am giving the smartcam 5 stars because not only was it incredibly simple to get up and running-(I was worried about not having the skills to connect it!)  The picture is super sharp!I love it and have recommended it to so many friends!", "Date": "March 5, 2014"}, {"Title": "I LIKE IT", "Author": "SANDRA FORERO", "ReviewID": "R3DS0HL1BCK8WY", "Overall": "4.0", "Content": "I REALLY RECOMMEND THIS PRODUCT IT HAS A GOOD PRICE ITS SIZE IS EXCELLENT AND WORK PERFECT IN ANY AREA", "Date": "February 17, 2014"}, {"Title": "great product for the price", "Author": "Albert Kang", "ReviewID": "R20NMV5G5RE0SH", "Overall": "5.0", "Content": "was worried about it being refurbished, but looks and works like brand new; also much cheaper than other retailers. easy setup and pretty good field of view.", "Date": "December 31, 2013"}, {"Title": "Great camera for the price.", "Author": "Sandy", "ReviewID": "R30MDKUVFRCMJ7", "Overall": "4.0", "Content": "Bought one of these and liked it so much that bought three more. Have been using these for almost two months, without complain. Picture quality is great. Setting these up is a snap. App is perfect. Nightvision is clear. Only suggestion to manufacturer is, once setup correctly over wi-fi, if these can be re-set remotely.I have three in my kids'place and I had to physically go there to reset when they reset their router.Will buy again!", "Date": "March 9, 2014"}, {"Title": "Couldn't have been easier", "Author": "Jim CT", "ReviewID": "R7Q3VV4QOP6RT", "Overall": "5.0", "Content": "If you follow the simple directions you will be up and running in 15 minutes. The Samsung website works like you wish all websites would, quickly and accurately. The camera itself is great, I will now order another.", "Date": "February 10, 2014"}, {"Title": "Wonderful Camera", "Author": "Laura", "ReviewID": "R2IRGOYZL4APK9", "Overall": "5.0", "Content": "Very pleased with the Samsung SmartCam! It is very simple to set up and the application for your smart phone is free and it also having no monthly subscription plan is a PLUS! The night vision works perfect, crystal clear. Don't hesitate about it being refurbished it comes to your home like brand new. The picture is very clear day or night and so as your voice. I highly recommend this camera for the price.", "Date": "March 6, 2014"}, {"Title": "A steal for the price", "Author": "jabin", "ReviewID": "R3OLJWSXTPHVUX", "Overall": "5.0", "Content": "I was a little hesitant to buy this one since it is refurbished, but after setting it up I have no gripes with it. Setup was pretty easy. I got stuck at one part but I just followed the tutorial video they have up on youtube and was done in about 10 to 15 minutes. Don’t expect HD quality pictures because that’s not what it is, but for the price, it’s pretty much a steal.", "Date": "January 24, 2014"}, {"Title": "works on wired", "Author": "Donald G. Hattier Dc", "ReviewID": "R3LTEY1LSEATAW", "Overall": "1.0", "Content": "after several hours with tech support to get it wireless I gave up. Also this is totally web based some one could easily hack into this.A real shame.", "Date": "February 17, 2014"}], "ProductInfo": {"Price": "Unavailable", "Features": "Refurbished by Samsung, Updated with new firmware version 2.0, Improved Wi-Fi Direct Connection (Direct Setup via Smartphone or PC platform)\nBuilt-in Mic and Speaker for Two way talk, Built-in IR LED Lamps for Powerful Night Vision (5m/850nm)\nClearer color imaging (Applied ICR), Monitor on PC, Mac, and Smartphones, Audio and Motion detection and notification via Youtube, Picasa or Twitter\nFree and easy 30 second clip recording on YouTube, Multi-Streaming Up to 10 cameras\n90 Days Manufacturer's Warranty, iWatchLife Option for Clouding Storage/Monitoring; Currently not Compatible with Apple Routers", "Name": "Samsung SmartCam Wireless Day/Night Video Monitoring IP Camera with Wi-Fi Direct Setting - New Updated Version 2.0 / Manufacture Refurbished", "ImgURL": "http://ecx.images-amazon.com/images/I/31Vlts3TWmL._SY300_.jpg", "ProductID": "B00H8TAM8Q"}}