{"Reviews": [], "ProductInfo": {"Price": "Unavailable", "Features": "Be Connected At All Times You can monitor any of the cameras at anytime from anywhere in the world on your PC or smartphone. You can also change and set any functions on your DVR remotely from your PC. You can even set the SD04E to send you alerts via email when programmed events such as motion detection or loss of video signal\nDurable and Easy Setup Cameras: All of the cameras are IP66 compliant which means that they are both waterproof and dust proof and can be placed inside or outdoors in the harshest conditions. They been tested and retested to ensure they are built to last.  All of the cameras are weatherproof and can be placed inside or outdoors in the harshest conditions. They been tested and retested to ensure they are built to last.\nLarge Storage Capacity and Easy to Review: The SD04E comes with a 500 GB Seagate® hard drive. The hard drive is dependable and provides a large capacity to store your video. The DVR also utilizes H.264 compression technology which allows you to record even longer. Searching and reviewing your records is made easy with the option of searching by time or by event.\namsung Quick Connect: Networking Your DVR Made Easy: Setting up remote viewing is a snap. Simply plug your internet connection to the Samsung SD04E DVR, load the Quick Connect software onto your PC and your router will be located automatically. Using your PC, follow the three easy configuration steps and then you're ready to go.\nBest Image Available: Samsung security systems are known for their high quality recordings. All the cameras for the SD04E capture video with 480 television lines of resolution for a clear, crisp picture.  In addition, SD04E records up to 120 frames per second, making your recordings smooth. Lastly, all our cameras are also night vision capable and can detect and show objects as far as 50 feet even in complete darkness. Each camera can be set to record constantly or customized to record based on motion activation or a scheduled times.", "Name": "Samsung SD04E Samsung Security System with 4 Weatherproof IR Cameras, 4 Channel DVR with 500GB, Remote Monitoring, Free IPhone, IPad, and Android Apps", "ImgURL": "http://ecx.images-amazon.com/images/I/31MKD-ey1JL._SY300_.jpg", "ProductID": "B00HS7FCZQ"}}