{"Reviews": [{"Title": "These cameras have great reliability, image quaity and customer service!!!", "Author": "Alice C. Selfridge", "ReviewID": "R2OHHQI5JBB511", "Overall": "5.0", "Content": "The Home Owner’s Association (HOA), of the complex where I live, requested that I install security cameras at our pool to help enforce the posted pool rules.  The reason they requested my help is that  I had previous experience installing security cameras in our home in the mountains about five years ago. The cameras in the mountains have never caused me a single problem since they’ve been installed.  Also, I received such exceptional help from Sharx during that time, I immediately thought of them when the HOA decided to proceed with installing security cameras.This time, however, unlike my experience during the installation of mountain cameras, where I used a router without Universal plug and play (Upnp) capability, the new router I got from Verizon had Upnp capability, as do the cameras, so no assistance was needed to set up the cameras. These new Sharx cameras have improved not only the lens quality but its configuration capabilities. I needed to decide among the several recording choices offered by Sharx.  The choices I considered were using the microSD card provided with outdoor cameras or using File Transfer Protocol (FTP) to upload to the HOA’s server. I also wanted to prevent false recordings, to limit the number of recorded files that would be necessary to download/play while looking for offenders of the pool rules.  Setting up the “Record on Alarm” using the cameras’ motion detection sensors led to false recordings due to flying insects during the night and the shadows of the palm trees that move with the wind during the day.Sharx technicians expertly helped with recommending solutions for these issues.  The former issue was helped by using an inexpensive solar-powered warm white light which attracts the insects at night, and setting up the sensitivity and threshold sensors helped the second issue. Both of these camera locations, at my mountain home and at the HOA complex, can be accessed from anywhere there is an Internet connection, as long as you have the proper user name and password.  For anyone who is thinking about adding security cameras at their home or homes or for an application described here, you couldn't choose a better company than Sharx.", "Date": "April 17, 2014"}, {"Title": "The best customer service I have ever seen!", "Author": "Lowansa", "ReviewID": "R1W6DY78H2UIH3", "Overall": "5.0", "Content": "This works great! Customer service is above any product I have ever purchased! The only thing to be aware of is the night vision is limited to around 40 feet.", "Date": "April 7, 2014"}, {"Title": "Heavy duty, easy to setup and it has tons of features.  Couldn't be more pleased.", "Author": "Josh H.", "ReviewID": "R2KS14DJ3WOPK", "Overall": "5.0", "Content": null, "Date": "April 4, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00IAYHM9K"}}