{"Reviews": [{"Title": "Impressive Camera; Note About IR Range Listed", "Author": "Denise Hunter", "ReviewID": "R3QA09KNJJJNLD", "Overall": "5.0", "Content": "I live in a relatively quiet community, but that doesn't mean I am immune to crime because of it. After being here for a little over a year (purchased a home) and having a few odd things happen around the house, I think it's time to setup the surveillance system I have always wanted. As an IT engineer, I already had an idea of what I wanted. The plan is to have 2 indoor cameras, one on each floor, and 5 outside cameras that cover the front entrance, the garage and yard, the sides of the house, and the backyard/pool area. With all these cameras in-place, everything will be covered. It's especially important that I do this because I am about to start a business out of my home and if something happens, I have the most honest and accurate witness around. The setup will consist of a switch, PoE injectors, an 8 CH NVR, 7 cameras, and everything on fail-over power. This camera will be an indoor camera and will run off of the power supply included in the box. The camera has been running for over 48 hours now and works consistently. No jumps, bumps, jitters, or other issues in the transmission back to my laptop. The motion recorded is not skipping or jumping, and the software is just fantastic. You can adjust many settings on the fly including the image quality, frame rate, time stamp format, and even the motion detection sensitivity. I have it setup over wireless and it's just as impressive as it is over Ethernet. I am using it with a high performance wireless N router. Anyone who purchases this camera will find it very easy to setup and will enjoy the logical layout of the software and the many features including the app so you can remotely view your cameras away from home. I plan to buy another one from this seller.NOTE: There seems to be conflicting information about the IR range of the camera. The box that it came in says (in 2 different places) that it has 24 LEDs and offering a range up to 65' in total darkness. This ad and ZMODOs web site lists this model (ZP-IBH13-W) as 80' as well. The web site says up to 25 meters (82 feet and 1/4 inches). So by all accounts, it appears I received the right model number of the product, but the box and the manufacturers web site has different information about the IR distance. So please note that this is not the sellers fault. The manufacturer has it listed as both 80' and 25M (82' 1/4\") on their site and 65' in 2 places on the box. It could be a printing mistake on the material. I did not call their customer service to question it. From all my testing, the range is definitely more than 70' in near total darkness. I hope that info at least helps with your buying decision.NOTE 2: The paperwork does show that the web interface should only work in IE 7 or higher, and with testing in both the browsers I use, it is definitely not working in Google Chrome. No big deal . . . just use IE.Thanks!", "Date": "March 22, 2014"}, {"Title": "ZP-IBH13-W Zmodo", "Author": "Franco Pasquarelli", "ReviewID": "R2YA8NLT6TMRVE", "Overall": "4.0", "Content": "Received today, time will tell how reliable it is.Pros:1. 720p Good Day/Night picture - much better than the foscams,+ 300k cameras for around the same price.2. Small only 1/3 size to most similar outdoor cameras.3. wi-fi seems to work at good range.4. includes multiple camera software, (need to download from website)5. Easy setup for smart phones with apps. ( I have only tried Android)6. Works with Blue Iris, software.Cons:1. No software disc included in packaging. Need to go to website to download.2. No sound.3. Does not work well with Internet explorer, chrome, fox, web browsers. (need to use their software to setup)I would recommend to a friend.", "Date": "March 21, 2014"}, {"Title": "Nice Camera, but support sucks and software does not work properly", "Author": "amazingspiderman", "ReviewID": "R2B8Y02B1JRSFJ", "Overall": "1.0", "Content": "I have not contacted the seller yet BUT the Zmodo company that makes the camera SUCKS.  There customer service is horrible.  I asked a simple question and needed help setting up the software.  I got an off the wall answer that was as if they didn't even read my question.  You cannot chat online as it just logs you out and says unavailable when they were available.  The software does not work properly as described by this seller or the Zmodo web site.  If a reviewer could help me that would work with me.  I cannot capture motion recording under alarm settings.  It does not work and like I said, Zmodo support sucks as well.  I will most likely take this back within the next week for another camera.", "Date": "April 18, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00ITKZTH2"}}