{"Reviews": [{"Title": "Fantastic piece of tech", "Author": "Jacob A Irving", "ReviewID": "R2BVO0W7DT6CAB", "Overall": "5.0", "Content": "This device was the first addition to my surveillance setup. I wanted something flexible, something that could work as a stand alone unit or as part of a camera array. After reading the positive feedback for the previous generation's wifi model (SCNC2700) I chose to go with Sharx. Luckily they had just released this 1080p model weeks before my purchase.Setup was simple. The instruction are written in a very casual and direct tone. They made sure to address all common \"gotchas\" in an easy to digest narrative.The main reason I purchased this unit was the FTP upload functionality. This worked flawlessly. I was concerned about the file size for 1080p recordings. Turns out they're not unmanageable, ranging from 20-30mb per 30 second recording. Paired with a 32 gig SD can essentially set it and forget it for over a month with an appropriate task/schedule setup.In browser HTTP based streaming works great. If you want RTP streaming you can use 3rd party applications like VLC or quicktime. I have not used the included software since I don't have a multi camera setup at this time..JPG Snapshot email alarms are very cool. You may want to take a little time to adjust the sensitivity on the motion detector if you have pets.The true test will be how this unit works as part of an array (including multiple indoor and outdoor units) but as a standalone device, i'm pretty impressed.", "Date": "March 3, 2014"}, {"Title": "Very Impressive!", "Author": "Scott Peterson", "ReviewID": "R8MTX8ZLF4BTB", "Overall": "5.0", "Content": "I've tried a number of this kind of camera over the last few years.  Most have not worked out because of reliability problems, networking issues, image quality, etc.When I looked around to see what was new, I found the Sharx camera.  It was expensive but promised a lot.It arrived about 4 hours ago and I immediately unboxed it and set it up.  The instructions were clear, practical and well written.  Especially considering they were writing a generic document to help people install this on any router.  The PC instructions worked like a champ.  Plugged in the power and network cables and it was immediately visible to their setup utility.  After using that to get the IP address it was a simple matter to use that to get into the cameras monitoring/setup program.  The options that needed to be set were straight forward.The quality of the recordings are great.  It does true HD and saves them as .mov files that almost anything can handle.The only remaining step is to set up external monitoring so I can monitor things when I'm away from home.So far I would highly recommend this unit.", "Date": "March 23, 2014"}, {"Title": "This camera deserves 10 stars!", "Author": "Linda S \"Linda S\"", "ReviewID": "R2M1J4TUDAQ19F", "Overall": "5.0", "Content": "I had the Dlink DCS-932L and it was awful! The picture was always grainy, it jumped and was always in back & white. After a while they did an update and it started timing out after five minutes so you'd have to restart it. It was a piece of garbage!  And sometimes it just didn't work at all.  And forget about customer service. If you emailed them, they'd take two months to get back to you. If you called them, you were on hold for an hour and a half and you would get nowhere. Not to mention you could never even understand the person you were talking to.So I was looking up reviews on another camera and someone recommended the Sharx camera .  Well...let me tell you that this camera is awesome! I wasn't sure about some of the settings, so I emailed them on a Sunday. They got back to me immediately and said the didn't have hours on Sunday, but they answered my questions anyway.  Then they said they'd have someone contact me the next day to set up an appointment to have someone call me.  We'll not only did they email me, but since I didn't see that email right away, they called me an hour later.  We set it up for the next say at 3:00 pm and they called at 3:10.  I was so impressed!The rep was extremely nice and went trough each step to make sure all my settings were right.  He was so patient with me and, he wasn't from another country so there was no communication barrier.  It was a pleasure talking with him.  I was use to hanging up with Dlink and feeling like I needed a drink!As for the camera, it's awesome! I use it to watch my dog from work. You log on and it's up.  Clean, clear, crisp picture that stays on all day.  In color, not Jumpy.  It's perfect! I highly recommend this camera. I would give it a 10 star rating if it was allowed!  Really great quality camera!", "Date": "March 22, 2014"}, {"Title": "Great Camera System with great support from SHARX!!", "Author": "vettelover84", "ReviewID": "R2BGEX97JF67UU", "Overall": "5.0", "Content": "I was not knowledgeable about networking but the book explains all you need to know.  My live LAN picture was no problem but I did have a problem viewing live stream on my smart phone.  SHARX came to the rescue and called with a review of what I had done with a fix.  Second problem I had was with my smart phone alerts.  After viewing my settings it turned out to be a \"not allowed\" password on my sending email server.  They spent an hour on the phone with me until they found the problem.  I can not say enough good things about the support.  They were friendly, knowledgeable about their product and willing to go the extra mile to make sure I was happy.  They even gave me their feeling about what brand of NAS server to buy.  I love the picture clarity (HD), the remote access and the infrared night vision.  Will be buying two more for the rest of the house.", "Date": "April 10, 2014"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00IGFK7X6"}}