{"Reviews": [{"Title": "Night Vision Junk", "Author": "Tech Dude \"TD\"", "ReviewID": "RB48XFD1NI4YV", "Overall": "1.0", "Content": "This is the worst camera of any kind I have ever tried, even for the money it's not a bargain. I ended up buying an AgCam from a local dealer, it's a lot more money but it was worth every penny. This is junk and I wouldn't recommend it to anybody, but the one I have is the best I have ever seen, go to agcam.net and see what is available in real hardware.", "Date": "October 16, 2004"}, {"Title": "not even adequate", "Author": "A. LANE", "ReviewID": "R389PJKEANLN5D", "Overall": "2.0", "Content": "I bought this camera to enhance the audio baby monitor we already have. This camera started out OK, we then noticed that the signal would fade in and out at times as well as flicker on the monitor screen. In all fairness to the product, the infrared/nightvision part of the camera works well, the hardware in package was a little shabby for installing the camera on a wall, was forced to purchase my own hardware. As if the flickering was not enough we also noticed that there were times when the entire picture would vanish for a long while. After some slight detective work we figured out that the camera transmits on 2.4 Ghz band and so does the cordless phone in our house, which interfered with the signal. I also get a lot of interference when the microwave is running as well. For what I paid for this camera I will live with the inconveniences that this thing offers. I also looked into purchasing an agcam, but its quite pricey. If you can deal with the flickering from time to time this is not a bad purchase, otherwise KEEP LOOKING!!!!", "Date": "January 8, 2008"}, {"Title": "Camera been for a ride?", "Author": "PairofNoids", "ReviewID": "RRX87NI6WQIEA", "Overall": "1.0", "Content": "This product was \"open box\" and obviously \"used\", not new as stated. The camera was defective and broken as if it had been for a ride on a dirt bike. However, I needed the receiver unit and that part was OK. I was offered a free return and decided to keep this anyway.", "Date": "January 28, 2014"}, {"Title": "All Depends", "Author": "Nozama \"Emirp\"", "ReviewID": "RB7AB3Z07TW2X", "Overall": "3.0", "Content": "This product can perform well, IF there is no signal interference present. In fact the quality of picture this system can provide actually surpasses that of more expensive systems, IF they are set up well & conditions are conducive to good signal travel. And by quality, i mean color & image presentation,. Simply put....what you can see through these analog transeivers looks better than a digital camera....my digital cameras have less true color & produce a somewhat choppy framerate.....whereas the Astek image moves at a true to life frame speed.Now their night vision capabilities are not too impressive....my digital cameras have an advantage in this aspect....yet they DO work.I have used these cameras for almost 10 years now... and while a few cameras & recievers have passed away.... the very 1st one i bought is still in service & works well.These make excellent day surveilence cameras, yes they are a bit unstable in the sense that they are sensitive to the electromagnetic enviornment....but when they work.....they are great!I use these for my day survielence system & a digital set up for night....the reason i do not run them simultaineously is that the digital signal over rides the analog to the point that the Astek picture becomes unwatchable.The REAL problem with these cameras is in how they are sold.... in that the reciever can employ 4 cameras & the cameras are numbered 1-4 respectively....the way they are sold there is NO WAY to select which # camera you need....so if you are sent a number you already have....you are out of luck because you cannot use two of the same number....one will overide the other [ usually the one closet to the reciever] so you will only get one picture out of two cameras....in other words.....one of them will be useless to you.They need to set up this page so that we can select which camera # we wish to purchase....it is pretty simple simon stuff....i mean if we can select which shoe size we want....then why not a camera # ??No these cameras are not total junk.....If you work within their inherent limitations they perform very well.....although some people's locations might be subject to signal interference sources that they have no control over....which could make thingns rather difficult to deal with.So.... it all depends.....on your location & ability to work with what you got that will determine whether or not these cameras will work for you.", "Date": "August 30, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00030EFEE"}}