{"Reviews": [{"Title": "Great camera.", "Author": "PJ", "ReviewID": "R1D17I283KYD2T", "Overall": "5.0", "Content": "I purchased this camera as a replacement for a stolen Canon SD300.  The camera is very light and only slightly less compact than the SD300 (while having a much better grip).  The 2\" screen is bright with very high refresh rate.  Similarly to the SD300, the user interface is easy to navigate and the camera rips through images very quickly.  I actually prefer the interface and the number of manual settings of this Nikon.  The lens is fantastic and provides very nice and crisp photos with little noise.  I am very happy with its picture quality and plethora of manual settings.  The auto-focus is, in my opinion, not as fast and robust as the Canon's 9-point AiAF.  However, I still need to experiment with it more.  Pictures taken in the macro mode are exceptional.  In my opionion, this is currently the best compact camera in the $350 range.  Highly recommended.", "Date": "March 12, 2005"}, {"Title": "Excellent quality:price ratio!", "Author": "R. Ryan Dacca", "ReviewID": "RTTTWL28RBO45", "Overall": "5.0", "Content": "This is my first digital camera. Before this I owned a Pentax and a Canon SLR and a Canon ELPH APS camera. I was pretty set on getting a Canon, but after doing a lot of online research and visiting many camera stores, I decided on the Nikon CoolPix 5900 - and I'm glad I did.As far as I can tell this camera beats every other in its price range on advanced features. I won't go over them here, you can look at the product description for a list of them, then go to the page for the Canon SD300 (or any other brand) and compair. Also note that the SD400, Canon's 5MP camera, is actually priced at $399 and the 4MP SD300 is at $349, though you can currently get discounts on both. More importantly, the standard image quality is on-par with Canon and Sony (the only real competition in this range if you ask me), and when you throw in in-camera red-eye removal and D-Lighting it goes a step beyond. I know there are many other quality companies making cameras in this price range, but after reviewing actual prints from just about every one, it became aparent that Canon and Nikon in particular always looked noticably better in my opinion.Also of note are the quality Nikkor ED optics, sturdy and light aluminum body, 2\" LCD with a stunningly (really) high refresh rate and an excellen user interface, 640x480 movie mode at 30FPS with sound and surprisingly long battery life.I highly recommend this product to anyone looking into getting a digital camera or looking to replace their aging one.", "Date": "March 21, 2005"}, {"Title": "Great camera, except...........red-eye problem (indoor)", "Author": "H. Do", "ReviewID": "R2A3RD1U6NA7TS", "Overall": "4.0", "Content": "As an amateur photographer, I did a lot of research before I decided that it is time to join the 21st century and buy a digital camera--Nikon Coolpix 5900.  Why this camera and not the best selling Canon A95?  Because Nikon Coolpix 5900 has the best reviews I've read, and I've read plenty in the past two weeks.  Ultimately, it came down to three important specifications that every buyer wants and this camera has: durability, quality, and price.Coolpix 5900 has several good qualities: nighttime photography, auto focus, and zoom/macro features. I have tried these features many times and the images turn out sharp. If there is any blurred image, then the camera will alert you and ask if you want to keep the image. Be aware that when the battery is low, the camera takes its time between takes.I've had my camera for a week now and I play with it often.  All the points noted by other owners in the reviews below about the Coolpix 5900 are quite valid.My one gripe about the Nikon Coolpix 5900 is the red-eye problem indoor with poor lighting.  I attended a friend's wedding and the pictures that I took of the bride and groom inside the church constantly had red-eye. (I didn't think that the church was poorly lit, but in retrospect it could be.) I stood in one place and tried all the flash settings and none of them remedied the problem. Nikon boasts, \"Coolpix cameras can automatically detect and remove red-eye directly within the camera.\"  My Coolpix did not deliver on that promise.  That disappointed me and the manual was no help. Luckily for me though, I have a picture software that can fix the red-eye problem easily; however, it was a pain having to go through all the wedding pictures to fix them.Update: I recently took pictures on the 4th of July at a friend's rooftop party from sunset to almost midnight. The pictures turned out well and the red-eye problem was not present even though the lighting was even worse at this event than my friend's wedding. I kept the camera on automatic flash the entire time. So, quite honestly, I'm not sure why there was a red-eye problem at my friend's wedding and not at this party.Nikon Coolpix 5900 is a good camera overall despite the red-eye problem I experienced.  For now, I'll give this camera a 4-star rating because it has more good qualities than bad.", "Date": "June 29, 2005"}, {"Title": "Pleased, but not entirely thrilled. sample photos link here", "Author": "Digitaltim \"Digitaltim\"", "ReviewID": "R72K7N0DUWEQQ", "Overall": "4.0", "Content": "Here's a link to some 3MP and 1 5MP random pics I took.  Click on the dog to view more.[...]Overall I'm very happy with this camera.I'm not crazy about the lack of sharpness, but I think it might be from motion blur. Some shots are fairly clear, but I'm often deleting fuzzy pics. I have a couple digital olympus cameras that are 2X the size, but much clearer. The 640 X 480 30fps videos w/ sound are great, especially considering its a compact camera - no complaints in the videos. The sound in the video is better than I expected, not perfect -->adequate. (my latest camcorder is a canon zr-85, which I'm weighing my opinions against in the video department) The cam lightens videos when needed. It's useful for candle or dimly lit rooms.The camera feels solid, its fun to use, and easy. For me its a nice point and shoot.Its tough to say whether or not I'd buy this again. The pics are good, not excellent. I think alot of the sharpness problems would be fixed with a tripod.  I'm really happy with the video quality from this camera, but I'd look at other cams before deciding.", "Date": "April 30, 2005"}, {"Title": "Impressed so far", "Author": "Attention To Detail", "ReviewID": "RH1B3ACC2QSZA", "Overall": "5.0", "Content": "I have been researching/shopping for my first digital camera for a little while now. My first camera was Nikon 6006 and after 14 years is still producing amazing pictures. That probabaly played a role in my leaning towards Coolpix. I have been using 5900 for 4 days now. So far this is what I know-Easy to shoot (without a tripod)-I don't like reading manuals and so far didn't have to-Bought a 1 GB Ultra 2 SD card from Costco(89), easy to install and format (not as fast as I thought it would be)-Good quality movie capture (not the audio part), although that is not what I intend to use it for-Not overly impressed with digital zoom, optical works as it is suppose toHaven't decided on a printer yet. If you plan to buy one of the Epson printer, buy it with the camera or else you would not be able to use the advertised rebate. (Read the fine print on back page of rebate form.) From what little I have read so far, I am not leaning towards Epson. I will report back in a few weeks after I have used the photo software and made some prints.", "Date": "May 10, 2005"}, {"Title": "What else can be said? This is an excellent camera.", "Author": "A. Womack", "ReviewID": "R27SXSZWD3D3H2", "Overall": "5.0", "Content": "I just recently purchased the 5900 a couple of weeks ago, and have been extremely pleased with the quality, features and ease of use that this camera brings. I used to own a Coolpix 4300 and it too gave me great shots. But one thing that the 5900 improves on besides the in-camera red-eye sensor, is the fact that I no longer have to contend with a camera lens cover. When you hold this camera, you know you have a sophisticated piece of equipment. It doesn't feel like some cheap toy you picked up from the toy store. For it's size, it has nice balance. Quite simply the best camera for the buck. If there was one thing I would improve on, it would be to add better photo editing software.", "Date": "May 22, 2005"}, {"Title": "Wonderful Camera", "Author": "newgdolyn \"newgdolyn\"", "ReviewID": "R27HKC2F9L2X4A", "Overall": "5.0", "Content": "I purchased this camera after being disappointed with the Pentax 5Si. This camera is the best camera I have ever owned and far cheaper than some of the other models out there for the same megapixel. The pictures came out extremely crisp even though the setting was for the middle-level quality; it came out better than if you were to take the picture with a regular film camera. The color was vibrant as opposed to too dark due to underexposure. The flash is also strong given the size of the camera. The indoor shots were not severely dark due to the lack of flash power as would be the case for most ultracompact cameras. While this is not an ultracompact camera, it is fairly small and portable. I think the quality of the pictures makes up for the slightly larger size. Perhaps the best part about the camera is that there is an alert should your picture be blurry. This comes in handy because it is not always possible to judge picture clarity with a small LCD. The \"blur warning\" will save you the frustration of discovering upon development that you took a blurry picture.Update: I used this camera extensively on a two week trip and here's what I have to add/change. My opinion for the quality and color of pictures this camera takes hasn't changed. I have had difficulties taking pictures in lowlight (e.g. museums, churches). The blur warning comes on no matter what if you force the flash off. As a result, some pictures which are noted as \"blurry\" end up being perfectly fine and vice versa. It gets annoying but my way around the problem being that I have lots of memory is to keep all the photos and wait until I see them on the computer before I delete. Overall, I still love the camera.", "Date": "June 24, 2005"}, {"Title": "Excellent camera-compact", "Author": "T. McFadden", "ReviewID": "R3HML5HG9JTSPJ", "Overall": "5.0", "Content": "Likely the best bang for the buck (=value) of all the portable digital cameras out there.  I have a Nikon 8700 as a primary camera at work and got the 5900 as a backup and for travel.  This is an excellent choice.  Resolution is great once autofocus locks in.  Went on a trip to Ireland with my father who has a Minolta Dimage A1 and my sister who has a Canon A95.  Resolution is just as good and the 5900 is easier to tote than both.  Zoom is better on the A1.  Only mimimal complaint is that it autofocus is a bit more fussy than than other two (as well as my 8700) but once done, picture is just as good.  Love the various scene modes-makes photography tons of fun experimenting with them on the same shot.  Took 750+ pictures in Ireland!  Try that with a conventional camera!  Battery charge was excellent-lasted one week while using camera in \"on\" several hours per day.", "Date": "July 30, 2005"}, {"Title": "Very Good... but...", "Author": "C. Des", "ReviewID": "R3U4EZKH2O2PRU", "Overall": "3.0", "Content": "I've had this camera for about 3 months now.  Quality of pictures is very good, as well as its video.Problems I've encountered: (1) very difficult to capture an image at low light even if i play with the different preset modes - I always get a double-image picture, shutter is SO SLOW (2) my camera has this flaw - when the \"blurred picture\" warning is ON, it does the opposite; saves blurry pictures and gives 'blurry warning' on clear pictures.UPDATE:  8/20/05 - I mentioned that it is difficult to capture an image at low light; I have just read one review for nikon 7900 regarding this - to use the BACKLIGHT MODE (I probably missed this one).  I tried the mode and took a picture of an object in total darkness and it worked!  I was amazed at how clear the picture appeared.  NOW, I RATE THIS CAMERA 4 STARS.", "Date": "July 24, 2005"}, {"Title": "Excellent", "Author": "J. Cheek", "ReviewID": "R3OMMLIL3B3ZS8", "Overall": "5.0", "Content": "I researched several cameras on amazon and after reading reviews, i decieded to take a chance on this camera.  It definitely matched up to its other reviews.  Beautiful pictures ... I use it at work for architectural projects every day.  I was also worried that this camera would end up looking like a toy.. but it definitely does not and its small size makes it extremely easy to carry around.  Anyways.. for this price (and then some) you can not ask for a better camera.", "Date": "July 7, 2005"}, {"Title": "One of the best compact point and shoot digicams out there", "Author": "Sundog", "ReviewID": "R3QT35BR8HLTNX", "Overall": "5.0", "Content": "I did EXTENSIVE research on compact point and shoot digital cameras before I finally took the plunge and bought this one.  I'm glad I did.  I'm a total amateur and know very little about cameras so here's my review with that in mind.Size/BuildVery solid build.  Mostly metal with some plastic components.  Nice grip built in, although it assumes right-handedness.  Menu and GUI is very intuitive and needs very little explanation.  Just play with it and you'll be able to operate it.  Read the manual and it will make sense.  Not as lightweight as others out there, especially the Canon Elph line.  LCD screen is crisp and clear and when you disable the animation starts up very quickly.  Viewfinder shows 70% and is recommended for burst or continuous shooting.Features16 Scene modes - very cool.  The backlight mode is especially helpful in low light indoors.  Also, the D-lighting feature really lightens up the pic as well.  The only thing I don't like about this is that it writes a copy of the pic to your card and it's sometimes hard to tell which is the original and which is the one with d-lighting.  Minor gripe about a great feature.  AF is, as others have noted, a bit slow, but not insurmountable.  I like the best shot selector (BSS), which takes 10 consecutive shots in burst mode and then selects the best one.  Haven't played with all the scenes yet but can't wait to try.  To be honest, the regular old automatic setting takes great shots on its own.Image QualityVery vibrant images, color is well saturated and even.  The images are not as sharp as I'd like but this can be addressed with the sharpness setting in the set up mode.  Some difficulty with lowlight pictures but again the backlight and d-light does compensate for this.Camera software - PictureProject.  This is not so great.  It doesn't scroll through the images well - you have to use the back button to get to the list of images.  When you click on the arrow all it does is make the image bigger.  Seems a bit unintuitive.  Also when I \"enhanced\" the image, it didn't really look too different.  I intend to use iPhoto instead and will probably dispense with the Nikon software.Overall impression/valueRightly so this little camera has received rave reviews. Ease of operation, solid build, very good images.  No camera is perfect.  The Canon line has good qualities, as does Sony, Panasonic, and Fuji (all of which I looked at).  There seemed to be other major problems with some of these makers (most notably the Canon LCD screens and memory card issues, which kept me away from their cameras).  All compact digicams will have trouble with low light so with that being a reality (like death and taxes), this is a good camera.  If you are looking at the Coolpix 4600 (like I was), I suggest you bypass it and upgrade to the 5900 (it's not that much more and it's definitely worth it in terms of MP and additional features).  Nikon suggests using SanDisk or Panasonic SD memory cards as those have been tested and work in their cameras (I bought a high speed 512 Panasonic card and it's working fine).  Finally, the write speed to the memory card is average, even with a high speed card.  That would probably be another of my minor gripes about this camera.Buy this camera while you can.  I was told that Nikon is replacing this model with the S series (who knows if this is true - the guy in the camera store told me this).  If it is true, it's too bad because this is a really good product that seems to be getting more difficult to find.", "Date": "September 26, 2005"}, {"Title": "First Digital Camera", "Author": "boscolax \"boscolax\"", "ReviewID": "R3DMWD27ESNEQK", "Overall": "5.0", "Content": "So after a weekend Cinco de Mayo party where everyone attending owned and was operating a digital camera, I figured it was time to join the revolution.  After some research, I decided to go with this camera for the price, and the reviews that I had read in digital camera forums across the net.  I am not an expert on digital cameras, nor will I even attempt to elaborate on shutter speed or anything of the sort.  What I do know is that this 5.1MP camera captures incredibly vivid pictures, which when viewed on my camera for the first time last night solidified my decision to purchase this fine piece of electronics ingenuity.  The video capture mode is also amazing, except I'm going to have to figure how to run them smoothly on my comp, but that could just take some simple editing.  Size of the camera is amazing, and it literally fits in your back pocket( it may be slightly larger in construction vs. the canon SD series, but for the prices its unbeatable).  I recommend this camera highly, and I'm pleased to add another 5 star rating to this wonderful camera.", "Date": "May 13, 2005"}, {"Title": "nikon coolpix 5900", "Author": "L. Trussler", "ReviewID": "RYLLEFDCG4DYC", "Overall": "5.0", "Content": "seems like a great camera. Much better than the olympus c-765 we had purchased previously. Takes pictures quickly, and takes multiple pictures easily. Does not require a real steady hand to get a good shot. Mega pixels allow for enlarging and cropping easily.", "Date": "August 3, 2005"}, {"Title": "One Powerful Mini", "Author": "Charles R. Ortt", "ReviewID": "RX91GSP5UKS86", "Overall": "5.0", "Content": "This review is for the Coolpix 5900 with 5MP.You will not be displeased with this camera if you are in themarket for a compact digital camera. This little baby liescomfortably in your pocket until you want it and rarely failsto deliver, no matter what lighting obstacles you throw in it'spath. The footprint is amazingly small for a 5MP and you'll beamazed at the functionality. I found the video/movie feature tobe a real useful tool that surprises most people with the greatclarity and utterly blown-away at night shots in poor light.Think of Las Vegas lights on the strip, or a crowd of peoplein thin night light. This camera handled it all. The SD cardis easy to access, and I recommend a 1GB size so you can takeyour time with movies. Otherwise a 512MB card will give youabout 300 photos. But I warn you, you will be bitten by themovie bug and want to use this more and more (provided you havedisk space or burn the excess to DVDs). I also recommend theSan Disk Ultra II SD cards for fast recovery speeds, so youdon't have to wait for each shot to record before going to thenext shot (this is 5 MP and that's a lot of pixals to store).The roll on the side of the body enables you to keep a tightgrip on it with one hand shots- a feature many small cameraslacked. The battery life is exceptional, but as always, buy abackup for travel. The hit of one star was for the frustratingly small on/off button. I know they designed it so that it won't accidentally turn on in your pocket, but my fat finger is not the best tool.... The 2 inch LCD is not protected like others too, but so far seems pretty tough, rolling around in my pocket with sunglasses and other things that so far have not scratched it.", "Date": "March 9, 2006"}, {"Title": "An excellent starter camera, but I personally would wait for Nikon's new models coming out soon.", "Author": "R. Hiranaka", "ReviewID": "R3QF4S75P0GM6S", "Overall": "3.0", "Content": "I bought this camera for an international trip.  It did its job well, except in cases of low lighting and in museums.  When it is unable to use its flash (in lower light than daylight) the picture quality tends to deteriorate substantially.  Also I wish it had more than 3X optical zoom when it came to landscapes.  Overall though I enjoyed this camera, and it worked well for me.  However I do believe Nikon will be releasing their new models soon, and there is a better version of this camera in the new batch I believe.", "Date": "September 29, 2005"}, {"Title": "I like this camera very much", "Author": "WANG Hua", "ReviewID": "R1WUYI82S2KD06", "Overall": "4.0", "Content": "The camera is small and light with big preview window;The battery is very good can stay for 2 days.And the picture taken is very clear with good quality.But 3x optical zoom is a little limited", "Date": "August 8, 2005"}, {"Title": "coolpix 5900", "Author": "Julia Maunsell", "ReviewID": "R2G4ZJM6RU1NMP", "Overall": "5.0", "Content": "this is an excellent product. the metal case and ed lens is well worth the extra cost above the 5600 model. the camera is very easy to use, has long battery lastability and records excellent quality stills and movies. since buying the camera i have continued to check other cameras out there and have not been anle to find one better for the price.", "Date": "August 5, 2005"}, {"Title": "Focus slow", "Author": "Mauro Torres Ribeiro", "ReviewID": "R2M6JURSY1AAVC", "Overall": "4.0", "Content": "It a great camera, but the only problem is that it focus is a little bit slow. So you can loose some pictures becouse it.", "Date": "July 7, 2005"}, {"Title": "Good compromise of features & ease of use", "Author": "S. Michael", "ReviewID": "RTA24U3ZNC6XF", "Overall": "5.0", "Content": "I have a Canon EOS Rebel which takes fantastic pictures.  I use it around home and when I am setting up static shots such as family portraits.  The only problem is...who wants to lug it around to take snapshots.Despite some of the above opinions about lack of sharpness, I have had no such problems.  The 5900 is great for \"grab\" shots and it's not too shabby for setting up a planned shot using it's advanced controls.Be sure that you buy a FAST memory card.  This will reduce the time between shots.  As in most cameras, a memory card is not supplied with the camera.  Mr. Goyal's review about not being able to take pictures without a memory card is not true.  You can take a LIMITED number of shots with the internal memeory.The only real problem I have is the red-eye reduction feature.  I usually turn it off as the delay between the \"red-eye\" flash and the main flash is too long.  The subjects often think the shot is over and start to move.  Anyway it is easy enough to remove it later, either with photo-software or with the photo kisok in the drug store.", "Date": "November 11, 2005"}, {"Title": "Good only in very bright sunshine", "Author": "L.Qu", "ReviewID": "R253IKUGCRWW2V", "Overall": "3.0", "Content": "Pros: Takes great picture in very bright light. Small.  Good video. Date imprint.cons: Too Small and light, making it impossible to hold the camera still. For this reason, most of your photos are blurry. No manual control. Propriet battery. It is a guess work of those scenes. Noise level is high.", "Date": "August 19, 2005"}, {"Title": "Coolpix 5900", "Author": "D. Brinkley", "ReviewID": "R98NJT0EUUIE2", "Overall": "5.0", "Content": "This is my 3rd coolpix over the last 10 years.  This one I highly recomend.  Nice camera for under $300 range.I recommend a 1Gb or higher memory card and a back-up battery.", "Date": "August 12, 2005"}, {"Title": "Nikon 5900", "Author": "W. Madison", "ReviewID": "REB3XIF3QSRLV", "Overall": "5.0", "Content": "Great camera.  Very easy to get started, easy to understand dials and settings.  Included software is best I've seen with a new camera.  Very happy with picture quality and ease of use.", "Date": "August 10, 2005"}, {"Title": "Pretty darn good digital camera", "Author": "C. Tang \"P7M13 User\"", "ReviewID": "R313R9VAIKMK8L", "Overall": "5.0", "Content": "This is my third digital camera after a Ricoh very early model that is less than 1 mega pixels and Nikon D1 SLR. I bought this one mainly because it's almost impossible to use the D1 on every occasion we like to take pictures of our little boy who is only 2. The D1 with a zoom lens is way too bulky, heavy and sometimes hard to use for my wife. She loves this Coolpix camera. With 5.1 mega pixels, the picture quality is very good for family photo albums. The battery lasts surprisingly long than I expected and I use the monitor all the time. I always try to avoid using the monitor on my D1 in order to save the battery. We carry it alot more than we would with the D1 now since it's so small and light. I never had any problems with the camera. It works with the Nikon View software I had for the D1 with some updates, of course. The only \"complaint\" I have is that there is a delay bwteen you push the button and it actually actuates the shutter. I am used to my SLR cameras (I also have Nikon film SLR camera) that the picture is taken the same micro-second I press the shutter release button. Also the AF is much slower than the SLR which is expected. Overall, it's very well made and can produce good quality pictures for family and daily use.", "Date": "January 7, 2006"}, {"Title": "Great all around compact", "Author": "JCB,HIFIGUY", "ReviewID": "R1IFVRMXXBJ5II", "Overall": "5.0", "Content": "Camera is very nicely made, and is comfortable to hold , even for its small size.Battery usage is exemplary,and I would recommend it to anyone looking for a nice carry around camera.Identical in features and looks to the 7 mp 7900, only finised in a nice satin silver instead of the 7900's black.Both look quite nice.I believe the 5900 has been discontinued already for a plastic bodied model with no optical viewfinder.For its price, you will be pleased, very pleased.", "Date": "November 2, 2005"}, {"Title": "Fantastic Digicam!", "Author": "Tina", "ReviewID": "R2UX0573EMQQ0M", "Overall": "5.0", "Content": "This camera is well worth the money.  It takes crisp, clear pictures and has a very long battery life.  It is loaded with extra features and is quite user friendly.  If you want a high quality digicam and don't want to spend too much, then this is the camera for you.", "Date": "October 2, 2005"}, {"Title": "Great Product at the Best Price", "Author": "dj", "ReviewID": "R1BMM5E5YILCUE", "Overall": "5.0", "Content": "Recently bought Nikon Coolpix 5900 on Amazon.com.  The product is easy to use and is simply great.  Amazon's price was the best price (given the fact that they didn't charge me S&H;).  Several other vendors did offer a lower price, but it was higher than Amazon's because of S&H; charges.  The product was shipped promptly.", "Date": "July 12, 2005"}, {"Title": "Great images.....poor warranty", "Author": "S. Meyer", "ReviewID": "R7WN534H9IU7T", "Overall": "1.0", "Content": "I bought this camera just under 12 months ago and recently the battery cover door would not stay closed.  I sent it into Nikon along with my proof of purchase and about a week later got a letter saying it would not be covered under warranty. The repair charge with shipping and tax would be $115.22.I am the only person that uses this camera and it was never dropped or abused.  Battery was only taken in and out maybe 4 or 6 times over the time I had it.For this reason I would never buy another Nikon product again.  Next digital camera will charge without removing battery.Camera takes GREAT pictures, but can't do business with a firm that is very difficult to get ahold of and does not honor their warranty.Bye Bye Nikon.", "Date": "August 10, 2006"}, {"Title": "If it breaks, it's your fault!", "Author": "J. Schneider", "ReviewID": "R1PHG3SH0CK7IP", "Overall": "1.0", "Content": "I was very disappointed in Nikon's service.  This camera has a 2in LCD display that apparently is very fragile.  When I returned for service, Nikon claimed I dropped it... which I didn't!  I was very careful in handling this camera, but the fragile LCD still broke.  To be blamed by the manufacturer was really disappointing.  They offered to repair it for $210, nearly the price of a new camera.I will NEVER by a Nikon product again.  If they are going to sell such a fragile product, they should at least include a hard case for it.", "Date": "March 7, 2006"}, {"Title": "great, easy camera", "Author": "K. Carfang", "ReviewID": "R2HG5MASGTU93M", "Overall": "5.0", "Content": "this camera was pretty much what i needed.  i wanted something that had good features, a viewfinder but also a large lcd screen, and took quality photos.  i'm a freelance photographer, and i just wanted to have a little point and shoot for when i am out with my friends, and this was exactly what i wanted.  nikon is great quality!", "Date": "September 2, 2005"}, {"Title": "Awful at Night", "Author": "Ahmed A. Alhakbani", "ReviewID": "R1C0ZI0JWZ6M3N", "Overall": "3.0", "Content": "Day light pictures are superb! but a big (-ve) is at night, you wont be able to take pictures with the flash, and if you dont use the flash you'll need the tripod.It could have been better ..", "Date": "December 11, 2005"}, {"Title": "Just awesome!", "Author": "Debbie Laney", "ReviewID": "R2YSK5PWP4V45G", "Overall": "5.0", "Content": "This camera is just awesome! It takes great pictures, is easy to use, small enough to carry just about any place I go, and the customer service that came with it, is beyond wonderful.  The guy has gone out of his way to make sure I was happy.  And I am.  Very happy!!!", "Date": "September 10, 2013"}, {"Title": "I lve my Coolpis 5900", "Author": "Trung Nguyen", "ReviewID": "R3MY29D0TGADR2", "Overall": "5.0", "Content": "It is practical (ready to use in any event, no hassle of setting) Photo good enough for keepsake as well as sharing ,", "Date": "December 5, 2012"}, {"Title": "Frustrated owner needing service", "Author": "MarkeTwaine \"Coomancoo\"", "ReviewID": "R3S97JTW9OP6CX", "Overall": "2.0", "Content": "I love my Nikon Coolpix 5900 however, the lens failed in less than one year. Service took 6 weeks to repair. The lens failed again after less than 10 days after repair. Why is the lens failing to open again? I absolutely hate the inconvenience of returning this item again for service although I do have a paid plan for it. Why can't warranty be fast, local and competent?", "Date": "February 15, 2007"}, {"Title": "Mixed feeling", "Author": "Marke R. Weeks \"Marke\"", "ReviewID": "R2ZMB9DQYROMA3", "Overall": "3.0", "Content": "Takes great pics ...BUT with a tripod and BRIGHT light...not too handy really....", "Date": "December 12, 2006"}, {"Title": "I love it", "Author": "Luna Zee \"Luna\"", "ReviewID": "R3Q5BCITQ4CGGG", "Overall": "5.0", "Content": "I have a Kodak EasyShare and this camera.  I really love this camera.  The smaller size is a real bonus and photo quality is fine for a casual photographer.", "Date": "December 26, 2005"}, {"Title": "Wonderful", "Author": "shaun", "ReviewID": "R13JTVBXHLXT07", "Overall": "5.0", "Content": "Really good camera. I own the sd400 in canon too but Nikon's quality is the best. No red eye as in the sd400.", "Date": "August 18, 2005"}, {"Title": "USB Port not working", "Author": "Tanweer A. Khan \"tanweer100\"", "ReviewID": "R3EI59S4HIFTVY", "Overall": "3.0", "Content": "I purchased this camera in June 2005 but suddently, its USB port develped fault and computer does not recogize it as USB device.  I am sending it back to Nikon for repairs/replacement as it is still under warranty.  Hope they fix/return to me promptly.Addition:  I shipped the camera to Nikon and they fixed and returned it to me without charge.  I am happy with Nikon's support.", "Date": "January 3, 2006"}, {"Title": "Great Product", "Author": "Kartik Anand \"K.A\"", "ReviewID": "R215PFKPY95AGN", "Overall": "5.0", "Content": "It is a very good camera. I upgraded from a coolpix 2500. This camera offers great value for the money.", "Date": "September 2, 2005"}, {"Title": "Nikon 5900 5MP, NIce camera in a reasonbly small size", "Author": "Todbiker", "ReviewID": "R1O7QDS2BFGOTG", "Overall": "4.0", "Content": "Was wanting a camera that shot quality pics in a compact size. This camera delivers sharp clarity with good color, nice short video's too. Simple to use. I can put it in my pocket, the start-up time is quick and the selection dial easy to read. I did notice the 7900 for $20-30 more after purchasing this one, but decided the 5MP this camera has and the quality pics it delivers are quite sufficient for me. The camera didn't come with a memory card, which is a first for me and I've purchased three prior to this one. It would be nice to have even a small card included to test the camera out in case something is awry.", "Date": "September 19, 2005"}, {"Title": "Good camera with a major flaw", "Author": "Jason D. Harrier", "ReviewID": "R1IHXLDR9YK439", "Overall": "3.0", "Content": "I researched several cameras before deciding on the Nikon Coolpix 5900 and ultimately decided that the 5900 was the best camera for the price. The first 5900 I received from Amazon took great photos and lived up to all expectations. However, the LCD screen was crooked, which is very annoying considering you are always looking at it. They sent me a replacement which also had a crooked LCD screen. I am now awaiting my third replacement and am considering getting a Casio Exilim EX-Z50 to replace the 5900 if the third LCD is crooked as well.", "Date": "July 15, 2005"}, {"Title": "Very Unacceptable packaging", "Author": "Donald M. Andersen", "ReviewID": "R2CDQQM665X603", "Overall": "4.0", "Content": "Camera was improperly packaged.  There was no shock absorbent material in manufacturer's 3 X 5 X 8 inch unsealed box to protect camera and the \"polyair\" pillow packaging material within the 6 9 X 12 inch outer box was defective--the air chambers within the pillow were all deflated.  This deflation allowed the inside box to bang around freely within the outer box during shipping.  Recommend all electronic/photographic shipments untilizing this packaging approach be halted immediately!  The probable internal damage to the camera has as yet been determined. However, you can be assured that I will advise Amazon.com of all problems detected in the near future.  Donald Andersen", "Date": "July 26, 2005"}, {"Title": "Total Junk", "Author": "Muy Man \"muyy\"", "ReviewID": "R1UYYOBAAKUBID", "Overall": "1.0", "Content": "The picture quality stinks. I am buying another camera. Easy to use, but slow, and batteries need frequent charging. I went with nikon because of the reputation, but my 5 year old HP 315 2.1 MP takes picture 10x  better than this piece of JUNK!!!", "Date": "October 29, 2005"}, {"Title": "Memory Card missing", "Author": "Brij B. Goyal", "ReviewID": "R3U2YW9BEBZNY3", "Overall": "3.0", "Content": "The camera was delivered this afternoon.  However, memory card is missing.  Without the memory card the camera can't be used.", "Date": "July 20, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.0-megapixel CCD captures enough detail for for photo-quality 13 x 17-inch prints\n3x optical zoom through a quality Zoom-Nikkor lens (zoom is equivalent to 38-114mm in a 35mm camera)\n2.0-inch LCD display; exclusive Nikon In-Camera Red-Eye Fix\nMacro shooting as close as 1.6 inches\nPowered by a Lithium-ion battery (included); stores images on SD memory cards", "Name": "Nikon Coolpix 5900 5MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51VBRNQ71WL._SX300_.jpg", "ProductID": "B0007KQWEG"}}