{"Reviews": [{"Title": "Great entry level camera. Affordable not cheap.", "Author": "mcenut", "ReviewID": "R3RFJJ18B3W9YN", "Overall": "5.0", "Content": "The Canon Photoshot A430 is the replacement for their entry level digital camera the A410.  Canon upped the megapixels to 4.0 from 3.2, enlarged the LCD to 1.8\" from 1.5\" and added more zoom (now is 4X optical and 14X combined.)  Even though this is the lowest priced Canon digital camera you can buy it is in no way cheap.  The camera feels solid when you use it and yet the plastic body keeps the overall weight down.Like all the A series digitals from Canon this model still uses standard AA batteries (2 to be exact.)  So when you are at the amusement park with the family and your batteries go dead, stop off at the gift shop and pickup a couple of alkalines to get you through the day.  I highly recommend investing in a set of good quality NiMH rechargeable AA batteries though; they last about 4 times longer than their alkaline counterparts.Like the A410 the A430 also has the DiG!C II processor.  This fabulous processor allows the camera to power up and shoot its first picture in less than 2 seconds and keeps shooting the next pictures approximately 1 second each.  There is a burst mode too but I haven't had time to play with that feature yet.  The DiG!C II processor also uses less battery power than older digital cameras so your are able to shoot more photos, and view them on the LCD, before you need to swap them for a fresh pair.  I took about 150 pictures, with the LCD on, on a set of alkaline AA batteries before they needed a change. That was a \"WOW\" for sure.Having owned two previous digital point and shoot cameras and one digital SLR model, I can say that I am most impressed with the A430.  Some online reviewers have noted that the camera lacks independent zoom buttons.  What Canon did on this camera was make one set of buttons do multiple things.  The same toggle button you use to move up and down in the menus is the zoom in and out control when taking photos.  I applaud Canon on this design.  Why include more buttons that you need.  You aren't using the menu buttons when taking photos, so why not use them for the zoom control.  They aren't confusing to use and actually simplifies the design of the camera.This camera is great for grandparents, young kids and someone on the go.  It's is simple to use and takes great photos.  I'd recommend it for anyone who wants a digital camera that plain and simple just works.  I may just buy two of them so I don't have to share this one with my wife.Warning: Personal rant follows!  Before I bought this camera I read several online reviews.  The most deceiving was one from a noted electronics review website.  Their resident computer geek stated that there was nothing special about this camera and it was larger than most.  Having owned and used this camera I suggest their reviewer stop playing online video games and get out in the sun more, because there is something wrong with his head.  True, this camera isn't the smallest model around, but it is very small. And to buy a camera that is smaller you must pay two to three times the cost of this model.  \"Nothing special?\" gamer boy?  I'd really like him to qualify that statement.  The A430 comes loaded with over 14 shooting modes, an impressive 0.4\" Macro mode and the best photo quality in its class.  If that is nothing special I'd like to know what is special.  I don't expect a sub $200 camera to out perform my $1400 digital SLR.  Perhaps gamer boy needs to RTFM.", "Date": "April 21, 2006"}, {"Title": "Great mix of value and quality", "Author": "Jon \"Jon\"", "ReviewID": "R19VPUU1HLP8BN", "Overall": "5.0", "Content": "I bought this camera a few months ago - my first digital camera and as a college student it has been great.  The pictures come out great, the videos are high quality, and the various modes let you choose how complicated you want to make it. The software is simple to use if you can work a computer at all. The zoom is powerful and plenty for most people. I like the shape of the camera because it is easy to put into pockets than more square cameras and if you want a better size be prepared to pay up.Make sure you get rechargable NiMH high power batteries - I bought sony models and they have amazingly long life - I have only had to change them once! I got the canon soft case for the a430 too - it is pretty compact so it still fits in my pocket.  Overall its a great value camera that I am glad I bought.  As a college student, I wanted cheap but I didn't want to get the cheapest camera I could find, so this seemed like a good balance of quality and price and will last for a long time.  Enjoy.", "Date": "May 14, 2006"}, {"Title": "Excellent Value", "Author": "G. Clarkson", "ReviewID": "R24JV3NGFJVNEK", "Overall": "5.0", "Content": "I bought this camera to replace my old Canon A40 2 megapixel model, which served me very well. I think the Canons are a cut above the rest of the competition in terms of both quality and value.This camera is quite a bit smaller and lighter than my A40 and uses two batteries instead of four. But it is not too small. The smaller S series can be a bit too small for large hands, as another reviewer has already pointed outThe Digic II processor is very capable and much faster than my older model. Image quality is really superb, especially for a camera this inexpensive. I have made excellent 8x10 prints from this camera. 4 megapixels is fine when you have a good lens and processor. The image quality beats my friend's 6 megapixel Sony hands down. The only negatives I can see are that the resolution of the LCD is merely O.K. when compared to more expensive models and that the flash takes a good 5-6 seconds to recharge between shots.In sum, this camera is an outstanding value for an entry level shooter who wants to take great digital photos without too much cost or fuss.", "Date": "June 16, 2006"}, {"Title": "best buy for the money", "Author": "Eric Beich \"be kind.\"", "ReviewID": "RHQH1Y3ERF5HS", "Overall": "5.0", "Content": "This is my third digital camera in 10 years and my first canon. I shpped around and read several reviews and made this choice and I am very happy. as others have noted its a great quality camera for the price. I have gotten several comments about the size of the camera already, and the great pictures it takes. Amazon had the best price and I trust them but I purchased a 1 gig SD card for a price I cant really list, suffice to say.. shop around for  an SD card unless you just want to buy everything at the same time, then get a 512 card at least. They are so cheap these days. Another bonus for me turned out that my Bonzai USB drive uses SD cards and I am now able to take my card right from the camera and plug it into any computer to access my photo's quickly. I'm not sure if any other brands of USB drives use a removal SD card, but its something you may want to look into. oh ya, even though I'm pretty \"geeky\" the camera was easy to pick up and use right out of the box with minimal manual reading, so it seems to be very user-friendly. and the size is perfect! I actually expected it to be bigger. rock on Canon!", "Date": "June 1, 2006"}, {"Title": "Excellent Battery Life!", "Author": "Nicholas B. Nelson", "ReviewID": "R1JX5PI2IT4Z50", "Overall": "5.0", "Content": "This sleek model is excellent for its low price. I was able to take 250+ pictures with two 2500 MA-h NiMH batteries. It's very reliable, and it's always a relief when you can have your picture taken by someone else, and not have to worry about batteries dying, modes not being set right, having to push special buttons, etc. The camera allows the simple option of point and shoot for those spontaneous moments, but also has complex options to choose from like saturation, exposure, etc. for when you're feeling artistic. Indeed, the pictures don't turn out blurry, and the processor has gotten fast enough for you to be able to take larger-sized pictures every two seconds. The delay between pushing the button and taking the picture is a miniscule 0.1 seconds.This camera is great for most recreational photographers. The 4MP quality is adequate, and this camera doesn't leave me begging for higher resolution. The important thing is that the pictures turn out clear. I also encourage people to purchase rechargeable NiMH batteries; they're better than NiCad, and you'll save money in the long run.", "Date": "August 6, 2006"}, {"Title": "Great Product from Canon", "Author": "Tarun K. Gangadhar \"Kumar\"", "ReviewID": "RD60OBA854NVO", "Overall": "5.0", "Content": "This camera is the best. It has lot of features. If you compare this camera with other brands this gives 4X optical zoom for a low end Camera at the same time it comes for a cheap price. It also has a ton of features. I think 4 mega pixel is a lot for the digital image clarity. Last year i brought a Nikon 7.1 mega pixel, though it gives good quality pictures but the problem was it has delay in the shutter time which is so irritating so it not really good posing in front of the camera waiting for the flash to come. If you are looking for point and shoot camera for a cheap price this is the one and leave the rest to canon.", "Date": "July 8, 2006"}, {"Title": "Better than my all the other cameras I've owned!", "Author": "Surfseventy8", "ReviewID": "R1DBEAXZJA0AYV", "Overall": "5.0", "Content": "I got two of these cameras for my boys on their seventh birthday.  I'm so impressed with all the functions and features and the quality of them.  This actually takes almost the same quality of picture as my Fuji S3.  I was very reluctant to give them to my kids because of the compactness and the quality.Pros: Small, big LCD, lots of fun features like color swap, super-macro is beyond compare, amazing picture quality for a 4mp, runs on 2 double A's, perfect as a first digital camera for kids or adults.Cons: A little on the heavy side, flash takes a little longer to recharge than most other cameras, menus can be a bit confusing at first, memory card is in the same compartment as batteries.Bottom-line: For the price, you really can't go wrong.  I love this camera and i'm seriously considering trading in my Fuji E510 for this one.", "Date": "September 2, 2006"}, {"Title": "Better than expected!", "Author": "Sally", "ReviewID": "R1NW9EYJ8YH04X", "Overall": "5.0", "Content": "The moment i received this camera i started taking pictures, which might i add are very crisp and clean in quality.  They are by far some of the best images that i have seen yet to be produced by a digital camera and i am extremely impressed. At christmas last year, i received a Polaroid digital camera, and was very dissapointed at the picture quality. The pictures were grainy, and discolored, and i was not pleased at all. So, the Canon Powershot A430 is a very large step up!When i opened the camera package, i actually expected to find a much larger camera, but to my suprise, found a very nice sized one. It fits snugly into the palm of your hand, and has no rough edges. The design has a nicely finished look to it, and is very presentable.The on button is very easy to find, and when pushed, instantly turns the camera on. Compared to the Polariod camera i had before [ which, for the on and off button, you had to push down for 5 seconds ] this was very pleasing.I didn't find the Canon Powershot to be a terribly hard camera to use. After i took it out of the package, i started to use it right away. There are images on the camera that may need a little research [ looking into the users guide ] but they are not hard to get used to.I especially like the different modes on this camera. They are a very nice feature. One that i really like is the one that makes a certain object stay its certain color, while everything else around gets set to black and white.There are loads of feeatures on this camera, and i would HIGHLY reccommend it to anyone. It was definitely worth the price.One thing i would suggest is buying a higher Megabite memory card if you are planning on taking a lot of pictures. This camera only comes with a 16 Megabite, but it can still hold enogh images to satisfy.Overall, this camera is great.", "Date": "June 10, 2006"}, {"Title": "First time Digital Camera Shopper", "Author": "cbl", "ReviewID": "R3B6KRV3W6KSJO", "Overall": "4.0", "Content": "I just want to start off by saying I know nothing about pixels or Mega whatevers, i just wanted a camera.  I wanted something I could use to take great candid shots of my friends, and also be able to take beautiful artsy pictures.  This camera is great!  I used it right out of the box, and I was surprised at how big the view screen was on the back...it is very crisp and clean picture. I am very happy with my purchase, the small size is great, and the pictures came out great.  The only negatives I have are1. the battery life ends quickly, so I had to invest in rechargable batteries, they are the way to go2. the on/off button is right next to the \"take a picture button\" I have gotten those confused a couple of times, but the buttons are right next to one another!I love this camera, if I lose it, who the hell cares it was only $130, if it around for the rest of my life, Great! It's a great little camera!", "Date": "June 16, 2006"}, {"Title": "Awesome pictures- one minor problem", "Author": "Kathryn", "ReviewID": "R2VOCGTHCCD8XF", "Overall": "5.0", "Content": "I bought this camera as a \"temp\" before I invested in the SD550 or SD700. I actually love it! I dont even want the other one anymore! I orginally wanted them for the small size. This one is really small though. Everyone that sees photos taken with this camera comments on the crisp pictures. They are so good that friends with no understanding of photography are even amazed. It is also very easy to use.The only minor problem is the manual mode. All pictures are easily taken without using this mode at all however. I just wanted to use the features such as color swap. This can get very confusing. It is the same with other Canons too. This is such a minor issue though.Overall, awesome camera!!!", "Date": "June 15, 2006"}, {"Title": "Excellent Picture Quality", "Author": "peter lane \"rugby2017\"", "ReviewID": "R33CXKXKQPZC6J", "Overall": "5.0", "Content": "I owned, and loved, a powershot A400 so it was an easy decision to upgrade to the 430 when I wanted to move to a higher resolution camera.  I actually purchased 4 (yes I was that impressed with my old A400) with the other 3 being Christmas gifts for my family.The bottom line here is simple; it takes great pictures.  You can read all you want about features and specifications, but this is really all that matters. The pictures are remarkably flawless with faultless focusing and excellent lighting, it is hard to describe how important this is to me after previous experiences with digital cameras.Most of the time all I need is something I can take out, turn on and snap a memory of a moment which may disappear if I need to fuss with settings.  This camera does just that time and time again.  Believe me, with 4 family users and a brand new grandchild this thing has been put through its paces.  Yet, it also has a number of advanced features, a good range of modes, and the video feature works well.  My only complaint is that the `point and shoot' mode works so well that I hardly ever use the others so tend to forget how to!Between the 4 of us we have technical ability ranging from Barbie to Geek but all of us love this camera.  It isn't the sexiest one around but it does what you need it to do.", "Date": "October 1, 2006"}, {"Title": "best deal going", "Author": "S. Junkin \"canon junkie\"", "ReviewID": "R3JRD9AS6NY987", "Overall": "5.0", "Content": "after a month of research, i purchased this camera and am very satisfied. absolutely the best value for the money! you can't go wrong with a canon, and for less than 150 bucks, you just can't do any better! the capabilities of this camera are basically the same as the more expensive canon digital elph models, just not as compact, and the lcd screen is smaller, but hey, who cares?  not to mention the video capabilities- plays back video on the camera itself with audio!! fantastic! for anyone who is undecided, go ahead and make your decision- this is the best camera in its price class, by far!", "Date": "August 28, 2006"}, {"Title": "Great little camera", "Author": "Becky Loomis \"BeckLoo\"", "ReviewID": "R27H5ARTI1CX0L", "Overall": "4.0", "Content": "I bought this camera for my daughter to travel to Australia with, she had no problems, took great pictures and movie videos. She thought the sound didn't work on the videos, however when you play them back on the camera there is no sound, but once they are downloaded then the sound has great clarity. The menus are very easy to navigate through, great startup time, and buttons on the back are easy to navigate. This will be a great camera to pack anywhere because of its size, and it take great pictures too !!", "Date": "July 12, 2006"}, {"Title": "Fantastic deal!", "Author": "Janette Wright", "ReviewID": "R2B0J06ESPB4L9", "Overall": "5.0", "Content": "After doing alot of research it came down to a choice between the Canon and the Nikon.  Both cameras are good, but I was looking for something straightforward, no hassle for my nephew.  The price on Amazon was the best I found and using the Amazon card for the first time gave me an additional $30 off.  Can't beat that.  I have compared the pictures with my husbands $500 + camera and they really do stack up!  This is an excellent beginner camera.  Very easy to use and transfer to the computer etc.  Perfect gift.", "Date": "September 2, 2006"}, {"Title": "Ok Camera to use for the price, excellent service", "Author": "F. Ding", "ReviewID": "R3S3ZYBOT7UNYQ", "Overall": "3.0", "Content": "With the price I paid, I can't complain much but can't turn on the lense after nearly 30 days.Call Amazon serive dept, they processed so fast and gave me a new one. 2nd one working well more than 2 months already.Incredible after service experience!!!", "Date": "November 9, 2006"}, {"Title": "Near Perfect for a first-timer", "Author": "J. Comeau \"Ref7\"", "ReviewID": "R33ROWV89R0YAZ", "Overall": "5.0", "Content": "This my first camera ever, let alone a digital one. While it is a little complex for my random, recreational picture needs, it is definitely a great camera. It's small enough to throw in my purse, and it takes marvelous pictures. I am completely satisfied with it, but I wasn't too fond of the batteries that were supplied with the camera--they died within 20 minutes of loading them into the camera.", "Date": "August 14, 2006"}, {"Title": "Outstanding Camera at Reasonable Price", "Author": "TheWaldo \"W.\"", "ReviewID": "RRSQJUPYD3ZB3", "Overall": "5.0", "Content": "I actually have the A410 model but the cameras are basically the same. In simple terms the A410 is simply one of the best cameras in its price range and even to 2X its price I have seen. The pictures are sharp and clear, with excellent color. The flash seems to be right on; pictures are not washed out as I have seen with some cameras.Battery life is excellent and I have just now changed to my second set of Alkalines.....imagine what battery life would be if I splurged for the NiMH........Overall controls are well laid out and work smoothly.In a nutshell.........you cannot go wrong with this camera. It does all you could ask for its price range and much more.Enjoy yourself.", "Date": "June 6, 2006"}, {"Title": "Unbelievable Value for Money", "Author": "Grant Watt", "ReviewID": "RYKV1YPHSRGH", "Overall": "5.0", "Content": "I only got this A430 a few days ago so I haven't used it extensively yet.Tonight I compared flash photos of my book case from about 1 metre using my Pentax ist DS 6Megapixel SLR and the A430.  I took a number of pictures and the difference was pretty well zero using my 17inch monitor.  I have to say I was impressed as I was expecting more of a difference in favour of my SLR.The autofocus on the A430 is excellent and very reliable.  I tried a few shots in complete darkness and the IR beam made short work of focussing and firing the flash giving a perfect image.I am also very impressed with the video images with the picture being very sharp and clear with good sound.It does lack the manual featurs of an SLR and there is no information in the actual viewfinder.It is hard to criticise this camera.  It doesn't even look or feel cheap even though it only cost $159AUD.  It feels lovely in the hand and is a camera you can be proud to own.The batteries have been lasting well too even though I have been snapping away with it for several days.  I am using the 512M SD card from my SLR in the camera at the moment as the 16M supplied one is pretty inadequate.All in all a great camera at a great price.", "Date": "January 25, 2007"}, {"Title": "A Great Little Camera", "Author": "dlcook2 \"Muncie grandma\"", "ReviewID": "R3NV3EEY59ZLUN", "Overall": "5.0", "Content": "This is my first digital camera and I am so impressed! The pictures are very clear and sharp. It is easy to use, even for someone who is electronically challenged like myself. My son(who is a camera buff) recommended this camera to me because of the Canon reputation and it definitely delivers. I was looking for something with more megapixels, but he told me that this camera would be more than enough for someone like me who takes pictures mostly at family events and he was right. I would definitely recommend this camera to anyone like me who is looking for an easy to use and great quality camera.", "Date": "January 3, 2007"}, {"Title": "Great mid range camera", "Author": "R. Ochs", "ReviewID": "R17QGZUZROFTVC", "Overall": "5.0", "Content": "If you are looking for a point and shoot that will turn out some great photos with little effort, go no further.  This camera has a 4x zoom, which is hard to find in this price range, plus enough megapixels for good looking 8x10's.  There are also some neat artsy features like a color swap and a color accent (everything is black and white except one specified color....very fun to fool around with).  I am very satisfied with this product, and use it almost daily.  Give it a try, and it will not dissapoint.", "Date": "November 11, 2006"}, {"Title": "nice camera", "Author": "Patricia A. Valentine", "ReviewID": "R2GQF7OZLHU3W0", "Overall": "5.0", "Content": "i am very happy with this camera.  i wanted a camera that gave me more shots with less drain on the battery. this one is doing the job.", "Date": "November 6, 2006"}, {"Title": "Great Camera-God Awful softaware!", "Author": "Guy", "ReviewID": "R17CR2EGEGHUC5", "Overall": "4.0", "Content": "This camera itself is awesome.  For the money, it's worth every penny.  The video quality is great, the contorls-once you get the hang of them-are very intuitive and navigable, and pretty good video too.However the bundled software with this camera is complete crap.  My main issue with it? The software doesn't allow you to print multiple pictures (or multiple copies of pictures) on the same piece of paper.  That means that if you want a bunch of wallet sized photos to give to people, you CANNOT print them on the same page, but would have to print each individual picture on its own individual piece of paper.  And since photo paper is already pricey as it is, this is not an economical feature.  I have checked every manual, every online source and found nothing to suggest otherwise.  Do yourself a favor, if you buy this camera (which I still recommend), make sure you get decent editing and printing software with it.", "Date": "June 22, 2006"}, {"Title": "Great for an inexpensive camera", "Author": "Lorenzo St. Dubois \"Jersey City Mods\"", "ReviewID": "R1IJ1Y00Y5HJTX", "Overall": "4.0", "Content": "This is my first digital camera so I can't compare to others. However, I'm not someone who needs a top of the line model, and I thought the price could not be beat. I found the controls fairly easy to learn with the \"quickstart\" guide that came with the camera.  Downloading to a computer is also simple.  I did not try the software which came with the camera as I did not deem it necessary to transfer the photos to my computer.  If you use Windows XP it will automatically detect the camera. (Other reviewers believe the software is not up to par however).I took many photos on the highest megapixel setting (average picture is about 1.4 MB) so that they could be printed out (no larger than 4X6 prints recommended).  If larger prints are important, a higher Mexapixel camera might be in order. For viewing online-only, the lowest setting looks very good. It's compact size means it fits comfortably in a small bag and weighs nothing.Recommended that you purchase the camera case separately as well as an NiMH battery charger.  Also, purchased a 1G Memory card separately.  Flash does take a while to recharge between shots, but this is not a problem for me.", "Date": "November 10, 2006"}, {"Title": "I love it", "Author": "W. Danser", "ReviewID": "R24CKQ3QQT2IWD", "Overall": "5.0", "Content": "The camera is light and compact and simple to use to the limited extent that I've used it so far.  The camera has so many options and capabilities that I haven't begun to explore.  I bought this after reading many more detailed and enlightening reviews and I'm not disappointed.  The documentation for this camera is quite comprehensive--almost overwhelmingly so--and logically presented in seperate manuals based on specific application.  I especially like the video feature and the ability to connect the camera directly to the TV to display what you've shot--still or video.  I've rated this 5 stars because, neophyte that I am, I have no basis to criticize it for any reason.", "Date": "August 28, 2006"}, {"Title": "Excellent Camera, easy to use", "Author": "J. J. Amaya \"JJ\"", "ReviewID": "R34ABWN0JW6AUV", "Overall": "5.0", "Content": "This camera is really good, easy to use, and has Macro mode, I like to take pictures of collectibles watches, and is really awesome the images you can get. I also have a Canon Digital XT, with 100 mm Macro Lens, and a light box; well some pictures I took with this A430 Camera, are almost the same quality as the ones I got with the more expensive equipment.", "Date": "January 10, 2007"}, {"Title": "Great Camera", "Author": "J. Chaplin", "ReviewID": "R2X11TCRWA176M", "Overall": "5.0", "Content": "I had this one before and it was stolen so I replaced it with the same thing because it was just what I needed. Great clear shots, user friendly, downloads without problems, feels good in the hand, small and light. If I lose this one I'll buy the same one again.", "Date": "January 9, 2007"}, {"Title": "Canon PowerShot A430", "Author": "Joann K. Maloney \"I Love my Mac\"", "ReviewID": "R22QFCN2OURGZC", "Overall": "5.0", "Content": "An easy to use digital camera with good features for someone wanting to venture into digital photography.  Canon does not disappoint here.  Ergonomically well designed.", "Date": "January 9, 2007"}, {"Title": "Good camera for the price", "Author": "R. Batista \"blink56k\"", "ReviewID": "RENR4L3EN3KM", "Overall": "3.0", "Content": "Good camera for the price I got it for.Pros:-High resolution and quality for its price-Good picture quality even at lower resolutions and extensive other features (flash-type, picture fineness, decent zoom, short video clip feature)-Cheap-Works with Windows, Linux and Mac (then again most USB cameras these days do, but I've known others which have been nightmares)Cons-You have to buy rechargeable batteries or you're not going to go too far with this camera-The included memory card doesn't save too many pictures at higher resolutions-Slow shutter speedI got this about a year ago and it's still in excellent condition.  I'm not sure how much the price has gone down but if you want to get a good yet cheap camera, Canon's a good bet.", "Date": "January 20, 2007"}, {"Title": "When your DSLR is too heavy...........Its fantastic.", "Author": "James M. Campbell", "ReviewID": "R7IYTYH6U6US4", "Overall": "5.0", "Content": "I just wish I could upload a few of my photos. This camera has a great lens and a viewfinder - a rare item.", "Date": "May 28, 2012"}, {"Title": "Buyer beware: you get what you pay for", "Author": "C. Cheung", "ReviewID": "R2GDABDJEL3DU2", "Overall": "1.0", "Content": "I got this camera in September 2006, and it died around June 2007 (a useful life of approx. 9 months).  Out of the blue one day it said \"low battery\", and would shut off when I tried to take pictures.  It was no help to change the batteries.  I sent it in for warranty repair, but the factory found a dent in the lense ring (which to my knowledge has no relation to the batteries) and because I had \"damaged\" the camera, they were going to charge me $94.29 to repair the whole thing.  After I told them lense repair was not wanted or necessary, they told me any damage anywhere voids the entire warranty.  I have heard of similar  battery issues from at least one other person.  You are better off buying a more expense and better quality camera, rather than buying one of these every nine months.", "Date": "August 22, 2007"}, {"Title": "Excelente Producto para el precio", "Author": "Jonas Pichardo", "ReviewID": "R2JMYTXEAXU23T", "Overall": "5.0", "Content": "La calidad de la fotos son excelentes y bajo consumo de batería. Muy buena camara.", "Date": "November 3, 2006"}, {"Title": "Bought this here at Amazon, and returned it after a week", "Author": "Cowboys \"Cowboys\"", "ReviewID": "R2DK37PSXSDVAW", "Overall": "3.0", "Content": "Believe it or not the Canon A430 4MP superfine mode is worse than my old Nikon Coolpix 2500 2MP...Wait at least 5 seconds for the flash between shot, and you know the little ones don't sit still.  Kodak moments are gone before the camera cooperated.Color is not quite accurate either...Other than that, has lots of extra features...but that is not the reason I buy a camera.I'm going to give Canon another try with the SD600 model...", "Date": "May 30, 2006"}, {"Title": "OK, but not impressed.", "Author": "JEP", "ReviewID": "R3FMBB5LYNQ18N", "Overall": "3.0", "Content": "Expectations were low, but this was a satisfactory point-and-shoot camera for a few years.  Eventually the zoom stopped focusing, and it has become badly scratched over time.  Also very hard to keep clean.", "Date": "December 7, 2013"}, {"Title": "Camera", "Author": "ALW", "ReviewID": "R3LVG14J7LTJO9", "Overall": "5.0", "Content": "It was represented well.  Great delivey time and all was included and the camera was like new as they said.", "Date": "May 27, 2012"}, {"Title": "Great budget cam", "Author": "S. messer \"S.M.\"", "ReviewID": "RQ237J8XP122C", "Overall": "5.0", "Content": "I am not a fan of the A series budet cameras but this one seems wortht he price.", "Date": "November 21, 2008"}, {"Title": "amazing...", "Author": "Edward M. Kaczka \"gondy\"", "ReviewID": "R1KK9ITYLUP8BH", "Overall": "5.0", "Content": "I bought my canon a430 from amazon over a year and am very impressed with the quality, crispness, speed between pics, especially in kids and pet setting (as some users seem to be unaware of) Also Great mic and video. I accidently left it in the rain and soaked it... four days later it was as great as ever...If lost I would replace it with the exact same item. Battery life is also impressive on this camera.", "Date": "March 29, 2008"}, {"Title": "Outstanding little camera", "Author": "Jan in NC", "ReviewID": "R3PLQJSSZRRA7A", "Overall": "5.0", "Content": "I bought this a year ago refurbished for $100. It's now been all over the world, taken thousands of luscious images, and is light to carry, doesn't eat batteries, and has a boatload of features if you take time to work through the manual. They've tried, but the menus onscreen are not completely intuitive so a few hours with the manual are vital. When this guy dies, I'll be buying exactly the same model.", "Date": "December 28, 2007"}, {"Title": "Good While it Lasted", "Author": "Chip \"chipzbball\"", "ReviewID": "R1UPCPJQ0SHAVW", "Overall": "2.0", "Content": "Bought this little gem last August for my son's birthday. 13 months later the LED screen is frozen with god knows what on it's screen. Will cost $50 just to open it up. Won't buy Canon again.", "Date": "September 15, 2007"}, {"Title": "Can not power up", "Author": "S. Lew \"Susan\"", "ReviewID": "R1S6T4C1BP8K6Q", "Overall": "1.0", "Content": "I bought this camera last year. Only used it for few times. Now I can not turn it on! It looks like new but it is dead. I was told to cost $89 plus $9 shipping if I want to fix it because it is over 12 months old.", "Date": "August 21, 2007"}, {"Title": "For the price, it's great!", "Author": "D. Nguyen", "ReviewID": "R166ERVBJCE14X", "Overall": "5.0", "Content": "I've been using this camera for a few months now, and so far I'm very happy with my purchase. The main factor for me in deciding on a camera is the quality of the pictures. The A430 delivers 4MP. To an amateur like me, this does not seem like much. Actually it seems outdated compared to other cameras out there. But once the photos were taken, I was amazed at the clarity and resolution. The resolution is more than enough for amateurs/hobbyists(?). The colors are vibrant and sharp, although there are some noise/grains with blacks. Plus, you can record movies...with sound! The quality of videos isn't spectacular but gets the job done (rather grainy in 640 mode [largest]); it's not something you'd make a movie with, but perfect for places like youtube. I believe you can get ~15 minutes with 1GB in 640x480. So for someone who takes pictures just for fun, it has nearly everything you'd want.pros:great pictures: high-res, vibrant, and clear; good flashgood body constructioneasy to use (low-med learning curve)awesome battery life (with rechargeables)good video feature for a cameracons:bulky (much more than it seems) (I suggest A500 series when it's on sale [slimmer profile])small screenslowdowns when zooming in and movingThings to note: I suggest at least 512MB of memory. With that much, you can take as many pictures as you want without feeling constricted. Memory is really cheap now. Brands such as SanDisk are too costly - there are MUCH cheaper alternative for the same size card, same quality (buy online).", "Date": "February 22, 2007"}, {"Title": "Excellent Cam for it's bracket", "Author": "L. Adkins", "ReviewID": "R15WDEXV1F7NHL", "Overall": "5.0", "Content": "I did a lot of research before buying this Cam.  The mix of features and quality have supported my purchase, and if I needed another Cam I would buy this one again.", "Date": "January 5, 2007"}, {"Title": "A lot of camera for the money", "Author": "PassatDoc", "ReviewID": "R1200LXV683JKO", "Overall": "5.0", "Content": "I recently purchased the A430 (from a non-Amazon source, for the same price as Amazon currently sells this camera as of 6-10-2006) for a friend in Eastern Europe. He is computer literate and mostly uses the camera to save images to his computer and to share in e-mail.The factors that led me to chose this camera:1. Canon reputation for good quality. I had previously purchased two of the Canon Powershot S series cameras and have been delighted with them.2. Combination of good optical zoom (4x) and reasonable megapixels (4 MP...my friend doesn't print any photos, so 4 MP is more than enough for someone who shares pictures by e-mail and views them on a monitor).3. Use of AA batteries in this camera: the purchase of disposable AA batteries would be a financial hardship for the friend who received this camera. I was able to buy a $20 Li-MH battery set and charger (which accepts 240V European electric current) at Costco so that he can have a virtually unlimited (and cost-free) source of batteries and take all the photos he wants.4. Subcompact size was not an issue, as he has very large hands and would have trouble using the small buttons on most subcompact cameras. While a larger video screen would have been nice, most cameras that offer large screens also crowd the buttons so close together that they can be difficult to use for those with large hands or arthritis. He does not travel much and mostly uses the camera at home, so the ability to fit neatly in a small pocket was not an issue for him, and the larger size (vs. a subcompact such as the Canon S series) was actually a plus for him.I also bought a 512 MB SD card (PQI brand, about $15) to upgrade the camera, as well as an USB card reader (also PQI, $8) in case there was a conflict between the English language drivers and his Eastern European version of Windows (there was a conflict but the card reader solved this); no drivers were available in his language.Photo quality has been excellent, as least as good as my \"S\" series camera. Manual mode allows control of some functions such as flash and ISO speed. So far he hasn't made use of the pre-set \"scene\" modes, but you can take excellent photos without using the pre-sets.For $128, the best value I have ever seen in a digital camera. The only reason I would not buy one for myself, should my current camera break down, is because I travel frequently and it is important for me to have a camera that is truly pocket-sized (if not ultracompact).", "Date": "June 11, 2006"}, {"Title": "Great little point and shoot", "Author": "M. Spiess", "ReviewID": "R1OKBDES2Y38BZ", "Overall": "5.0", "Content": "Takes good pictures, doesn't chew through batteries too fast.  Nothing fancy, but it gets the job done at a great price.", "Date": "July 3, 2007"}, {"Title": "Great Camera", "Author": "Valencia \"Likes Books\"", "ReviewID": "R1FE1H0B7SJODM", "Overall": "5.0", "Content": "This camera is perfect and exactly what we need for our office. Easy to use and no messy software.", "Date": "July 12, 2006"}, {"Title": "Nice, Average Camera", "Author": "Tiger Girl", "ReviewID": "R178D8E9EJ99LF", "Overall": "3.0", "Content": "I bought this camera for my boyfriend for Christmas because it was affordable and it was a Canon!  It takes great pics and videos (though I still can't figure out how to add sound).  It has a defect though I'm afraid.  It won't turn on until we flip the batteries.  I'm sure its a minor thing and it really doesn't affect anything.  It runs batteries down pretty quickly, but it's small, compact, and takes amazing pics!", "Date": "September 26, 2006"}, {"Title": "nice camera", "Author": "B. DeBoe", "ReviewID": "R2T9F4MU0Y2AQC", "Overall": "4.0", "Content": "Nice camera for the price, although within one week of buying it Circuit City had it cheaper.  Anyway, easy to use and fits nicely into a purse.  A larger SD card is a must.", "Date": "July 10, 2006"}, {"Title": "fragile", "Author": "The Sultry South", "ReviewID": "R1GPPCZ9WP1O4L", "Overall": "1.0", "Content": "Bought this for my 14 yr old son. He dropped it on carpet last weekend with the telephoto lens out (taking video) and that was it. It may be inexpensive to buy, but it sure wasn't inexpensive to fix (warranty doesn't cover it). We were hoping for a little more than 4 months use. I am afraid of the lens problem Canon seems to have, but it took really nice pics and was easy for a kid (and non-digital parent) to use. Wish Canon wouldn't use cheapo plastic on otherwise great camera.", "Date": "September 12, 2006"}, {"Title": "Ugh!", "Author": "FireBloom", "ReviewID": "R3NZEOXFKVDEDC", "Overall": "1.0", "Content": "I just got this today as a replacement for a kodak I had for several years.  This camera is not user friendly.  Instead of words for a menu, Canon has decided to put little meaningless pictures on the camera and in the menu. If you just want to take a few pictures and upload it to a few friends without the technobabble or without having to learn an alien picture language - this isn't the camera for you.", "Date": "June 8, 2006"}, {"Title": "camera", "Author": "S. Garg \"hjkj\"", "ReviewID": "R2UT4AFW1F7DKZ", "Overall": "3.0", "Content": "its not a great camera..but for the price i guess its ok.it takes 2 much of batteries and teh photos are just okay. they not great.", "Date": "July 10, 2006"}, {"Title": "All that and a dime sack", "Author": "Robert J. Kubiak Jr. \"kubiak jr.\"", "ReviewID": "R5CX5BTHL5XJ9", "Overall": "4.0", "Content": "The new Canon PowerShot A430 digital camera is all that and a dime sack....where the auto focus at????", "Date": "June 26, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "4.0-megapixel CCD captures enough detail for photo-quality 11 x 15-inch prints\n4x optical zoom; 1.8-inch LCD display\n0.4 inch Super Macro mode; VGA (640 x 480) Movie Mode with sound\nISO range of 64 to 400; 16:9 Widescreen for full-screen viewing on widescreen TVs and computer monitors\nPowered by 2 AA-size batteries (2 alkaline batteries included); stores images on SD or MMC memory cards (16 MB MMC card included)", "Name": "Canon PowerShot A430 4MP Digital Camera with 4x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41GZV05H3NL._SX300_.jpg", "ProductID": "B000EMPPBS"}}