{"Reviews": [{"Title": "Great Cables At A Great Price", "Author": "Nylox", "ReviewID": "RFDOTBEXLDVXX", "Overall": "5.0", "Content": "The cable came promptly and was exactly as described.  At first I was concerned that it may not be of good quality due to it's rather small diameter.  This was not an issue however.  The cable works flawlessly with absolutely no interference or squiggly lines. The picture is absolutely perfect.  I even snagged the cable upon installation and thought for sure I damaged it, but it works flawlessly even after a pretty good tug.  In this particular installation, it was unavoidable to run this cable across and next to power wires.  Still the picture is perfect.One thing to note however:  If you need to split the power lead, you will need to make/buy your own power extension.  This is NOT a typical Siamese cable where you can strip the power wire away from the rest of the cable and run your power from distribution box.  The wires run 3 into 1 single cable and are not separable.I will be buying more of these cables in the future as I replace cameras and original cables in the process.  I wish they also came with a gender changing adapter so they could be used as extension cables also.", "Date": "October 6, 2011"}, {"Title": "Low quality", "Author": "Bill Jaffe", "ReviewID": "R1RAMR5K55J294", "Overall": "1.0", "Content": "Not a fan. The slightest bend and the signal is lost. Tangles very easily. Go for the thick high quality stuff instead.", "Date": "June 23, 2013"}, {"Title": "Works as expected.", "Author": "Jun", "ReviewID": "R2NQY52IXJT8PE", "Overall": "5.0", "Content": "RCA male to RCA male (audio or video).BNC male to BNC male (with BCN to RCA male adapters provided).DC 2.1mm male to female.The extension cable works as expected, was a low-cost solution, and shipped faster than cables I ordered from other places.This cable is part of a 155' (100'  ext. cable + 55' camera cable) camera setup to watch my fish pond. Signal is as clear as if the camera were plugged directly into the dvr.The bnc-rca adapters provided were a nice bonus, but I had to purchase rca female-female adapters (I knew before I ordered).Overall, works well, just do your homework before clicking the \"order\" button.", "Date": "April 4, 2012"}, {"Title": "Cable audio y video", "Author": "Alfredo Garcia", "ReviewID": "R1VPOAFLDD5ARG", "Overall": "5.0", "Content": "vaya que si es bueno este cable, realmente vale la pena, el audio es muy claro y el video muy bueno dependiendo de la camara que tengas, no duden en comprarlo.", "Date": "April 17, 2012"}, {"Title": "Works as expected", "Author": "fender-bender", "ReviewID": "R1MU9KCZS5UBGX", "Overall": "5.0", "Content": "We have had these in service for over a year now with no issues at all in four seasons. would purchase again.", "Date": "January 5, 2014"}, {"Title": "Good price and quality", "Author": "tman", "ReviewID": "R2NPGL2EKGPRUS", "Overall": "5.0", "Content": "I was able to  run this cable along one side of my house to connect a camera for my backyard and it worked as it should - no problems what so ever.", "Date": "November 30, 2013"}, {"Title": "VideoSecu 100ft Video Audio Power Cable BNC RCA CCTV Security Surveillance", "Author": "pescador2004", "ReviewID": "R1LTM0RFTY9UG7", "Overall": "4.0", "Content": "I am satisfied is a cable medium quality but for the price is good.I am satisfied is a cable medium quality but for the price is good.", "Date": "November 22, 2013"}, {"Title": "work good", "Author": "Neng Vang \"Neng2012\"", "ReviewID": "R23IE51V7Y546A", "Overall": "4.0", "Content": "Every things working just fine and very long so if you need 100FT this great for you and the price is cheap!", "Date": "August 23, 2013"}, {"Title": "VideoSecu 100' audio cable", "Author": "Lola M. Villalobos \"Lola\"", "ReviewID": "R2H8NWG4ZNWBXZ", "Overall": "5.0", "Content": "There were better than expected after reading some of the reviews.  In fact, they were perfect 4 our job. They r strong/sturdy. Great reception..no interference. We just didn't all those little plugs. Great item & would recommend.  The price was unbelievable. The best price I found.", "Date": "May 11, 2013"}, {"Title": "Great Cable for the Money!", "Author": "dwpetersen", "ReviewID": "R75YMOIPTXDEE", "Overall": "5.0", "Content": "Cable works great.I liked the BNC connectors for the video.I just used this with my video camera.Fast shipping and came just as described.", "Date": "May 6, 2013"}, {"Title": "I like it.  like It.", "Author": "George Larsen", "ReviewID": "R1ZO1Q5EV6OHME", "Overall": "5.0", "Content": "It was exactly what I needed to run vedio from outside, boththe 100ft and the150ft worked as expected. And you can't beat the price. thank you George", "Date": "March 19, 2013"}, {"Title": "Great deal", "Author": "Judith A. Walter \"Junie B\"", "ReviewID": "R1AXZEM5IB7NNP", "Overall": "5.0", "Content": "This cable works flawlessly 24/7.  I use it outdoors to indoors with no weather issues at all. Would buy again.", "Date": "March 3, 2013"}, {"Title": "BNC cable for Video cameras", "Author": "Carolynn's Amazon", "ReviewID": "R11X4KF6P4IYOU", "Overall": "5.0", "Content": "Product was as described.  Works perfectly. Product was brand new .  Shipped very fast. Best price I could find on the internet.", "Date": "December 3, 2012"}, {"Title": "Video Power Cable", "Author": "Black Eyes \"Frosed\"", "ReviewID": "RTENNF6NKWMI4", "Overall": "5.0", "Content": "I bought two and installed one so far.I like the size for easy handling.The video signal has been stable.I have a microphone to add later.", "Date": "October 18, 2012"}, {"Title": "OK", "Author": "Brian DeMaris", "ReviewID": "R2OFH65LUR50AT", "Overall": "3.0", "Content": "Not real heavy duty.  Not commercial that I would have liked.  Kinda cheap, but OK  Here are five more words, how dumb you guys.", "Date": "March 26, 2013"}], "ProductInfo": {"Price": "$74.95", "Features": "Comes with 2 RCA Male to BNC Female adaptors\nAll-in-one audio, video and power cable; Plug and Play ready\n100 feet audio/video/power cable\nOutput type: BNC video, RCA audio & 2.1mm power connectors\nFor camera with DC power only", "Name": "VideoSecu 100ft Video Audio Power Cable BNC RCA CCTV Security Surveillance DVR Camera Cable Wire A27", "ImgURL": "http://ecx.images-amazon.com/images/I/41xXl9Dk-XL._SY300_.jpg", "ProductID": "B000X1ZMW2"}}