{"Reviews": [{"Title": "Proof Canon listens to customer feedback!", "Author": "Andrew Hamada", "ReviewID": "RVWM345Y9YYWO", "Overall": "4.0", "Content": "Canon's newer, higher end SD models (SD200/SD300) are fantastic little cameras for point-n-shooters like myself.What's new compared to SD110/S410/S500:-2.0\" LCD as opposed to 1.5\" on other canon models-Low-light focus system dramatically improved over previous canon ultracompacts-Built in scene modes, making it much easier for those illiterate in manual functions (white balance?  huh?) to get better looking pictures.Pros (aside from new features mentioned above):-Canon's image sensor is consistently one of the (if not THE) best when it comes to ultracompact digital cameras.  Compare pictures taken by a Canon ultracompact to any other brand of ultracompact at the same resolution and the difference is remarkable.-All metal body feels sturdy.-Controls are mapped very efficiently (zoom and shutter operatable with one hand).  Menus can be navigated easily.-Numerous shooting options are enough to satisfy amateur photographers as well as snapshooters.  Auto-mode is efficient and usually does a good job.-About 2/3 the thickness of the S-series of Canon cameras, which are already about the size of a pack of cigarettes.-3.2 Megapixel sensor is exactly enough for snapshooters, which ultimately makes this camera cost far less.-Automatic lens cover prevents dust, etc., from marring lens.-Canon switched from Compact Flash memory to SD memory, which reads and writes much faster.-Fast start-up time (although not as fast as Casio's Exilim line).-Sleek design makes the camera a fashion statement.  You can and WILL get \"oooh\"s and \"ahhh\"s from people when you pull this thing out.Cons:-Canon switched from Compact Flash memory to SD memory, which costs more.-3.2 megapixel resolution, while enough to print 5x7s, usually isn't enough to print 8x10 images with anything resembling decent resolution.  Luckily, 90% of home users will never need more.-This camera is clearly not for anyone other than casual snapshooters: lacking in the manual functions more experienced photographers demand.-No RAW file mode for experienced digital photographers.-Basically, experienced photographers will hate this camera.  But thankfully, it's not geared toward them, but rather at home-users.  If you are an experienced photographer, don't look at ultra compact snapshooter cameras.  Go for digital SLR cameras, like Canon's EOS or Digital Rebel series'.", "Date": "October 27, 2004"}, {"Title": "Great bang for the buck", "Author": "WVU1776", "ReviewID": "R1HOILM1A2OD0Y", "Overall": "5.0", "Content": "I've had this camera for over a year now and couldn't be happier with it.  Obviously it's very small, which works out great for those that travel a lot or generally like taking a camera wherever they go.Picture quality isn't amazing, but very good.  And at 3.2MP, there's enough resolution to print out an 8x10 photo...why would you need anything bigger?I purchased the underwater camera case accesory.  It's a bit pricey (around $100), but well worth it for the money if you know you're going to use it a lot.  I took it to Florida during vacation and took hundreds of photos that turned out brilliant.  I HIGHLY recommend using the \"underwater\" setting available.  I took a few without it just to see the difference.  They were very blue-saturated.  The \"underwater\" setting eliminated all of that, leaving a clear image.  With the attached strap, it wasn't a hassle to carry around either, even underwater.  We did lots of snorkling (sp?) and diving with no problems.On the con side:- There's no battery life indicator!  The only time you know the state of the battery is when it's very low.- The lcd scratches easily, but that's to be expected.  I haven't had any problems with the case itself scratching.- The included SD card won't hold that many photos.  Just spend the extra money and get more memory.  They're fairly cheap these days.  I bought the 256mb, and it holds plenty (hundreds).Overall, great camera for the price, size, and ease of use.  I did a lot of research on compact cameras before I bought, and this one has met all my expectations.", "Date": "November 11, 2005"}, {"Title": "Great camera for the money", "Author": "Tom M \"ciagw\"", "ReviewID": "R2ZX3B85EWY7C0", "Overall": "5.0", "Content": "Zero complaints about this camera for what I paid.  Yes, you can get a better camera in terms of resolution or functions, but you probably won't need more than you get with the SD200.  I've had mine for just over a year now.  It consistantly takes sharp, well balanced photos, the shutter lag is negligible, the battery life is reasonable and the included charger is slim and charges the battery quickly.I bought this camera after extensively researching the options in this price range.  You will not be disappointed for the price.", "Date": "October 30, 2005"}, {"Title": "Great Battlefield Camera for Iraq or Disney World", "Author": "RICH A", "ReviewID": "R3IMWIBMF92KLK", "Overall": "5.0", "Content": "This is a great little camera.  I've carried it for the last 6 months in my sleeve cargo pocket while in Iraq--without a case, and haven't had any problems w/ the screen.  It's handy, lightening fast, and takes crystal clear photos.  Everyone who's seen it or taken pictures with it wants one.  And the ability to recharge on 110/220 V is great for traveling.  The battery will usually last at least a week or more while taking a few snap shots a day.  I highly recommend it as an alternative to a big--slow--expensive camera.  Get a 512 SD card and you'll be set for anything.  3.2 mega does the trick for most users.  For under $200 nothing else compares, buy it!  Or if you insist on spending more, buy the newer SD400.", "Date": "December 5, 2005"}, {"Title": "Ideal camera for specific goals", "Author": "A. Carey \"adamarket\"", "ReviewID": "R3TA7LK1DWDLXG", "Overall": "4.0", "Content": "I own a Digital Rebel and absolutely adore the photos I get from it. I've invested in a range of lenses, a decent external flash, remote control, etc. but the camera is so damn bulky I will only take it on my \"photo excursions\" into the real world.I've found I increasingly miss great shots and parties where carting a huge Digital SLR just isn't practical. To this end, I purchased an SD 200 prior to going down to Disneyland with my family. I didn't want to go on all the rides worrying about my camera and accompanying backpack.Pros: The SD200 is a tiny, tiny camera. It has the feel of a \"spy\" camera, the one I dreamed about when I was 10 years old. The shots in regular daylight are pretty accurate in color, sharp in detail and generally up to par with what you'd expect from a film point-and-shoot camera. In other words, I got exactly what I expected from the camera in its shots. On top of that, there is a fairly decent camcorder function. I'll be getting a larger 1 Gig SD card to take advantage of it, but the feature is so flexible and the video so good, it's worth leaving my Canon Elura at home (hardly a giant camcorder, but not pocket-sized either). The video is rendered as large as 30 fps and 640x480. I wish it was 720x480 but oh well.Cons: Almost a pro, this camera makes me appreciate just how gorgeous the Digital Rebel's photos are. There's no comparison in color, saturation, sharpness and above all, depth. The SD200 feels and shoots like a toy compared to the Rebel. But for my purposes, that's just what it is. I'll be carrying it with me everywhere now and getting all those shots I'd otherwise miss.Final con and this one is the largest - the flash on the SD200 is way too powerful. It literally blinds people and generates red eye EVERY time, even with red eye reduction deployed. The ironic thing is, when I take off the flash, the low-light pictures often come out well. My only real complaint is that I wish Canon allowed you to control the amount of flash generated. Maybe there's a firmware update. I'm looking now.", "Date": "September 17, 2005"}, {"Title": "Amazing little Camera", "Author": "Ryan B. Newman", "ReviewID": "RS57CKVZK54N2", "Overall": "5.0", "Content": "I just got this camera today and it's great!  I needed a smaller one just to take around college.  My other camera was too big to just slip in my pocket and I found myself just never taking pictures.  But now I can just take the sd200 anywhere.  The camera is also loaded with options and takes awesome pictures.So you know how big it is, the camera is about the size of an altoids box.  It also is very, very light.All around great camera!", "Date": "December 7, 2005"}, {"Title": "almost perfect?  (for me anyway)", "Author": "P. Falstad", "ReviewID": "RHC4THZ1X0X7U", "Overall": "5.0", "Content": "For me, this is almost the perfect camera.  It takes great pictures, and has a pretty good optical zoom.  Any better than 3x might be unusable for such a small camera, because the lens would shake too much without a tripod.  I think the small size and light weight makes it more vulnerable to camera shake.  But that's OK, because I love the small size; it makes it possible/practical to take the camera wherever I go.This camera has a great continuous shooting mode, which I almost always use to take pictures of my daughter (who's 3 and always moving, so it takes a lot of tries to get a perfect shot).  The continous mode is fast enough, although not as fast as some more expensive (and larger) cameras I've tried.  I wish the continuous mode would stay on my default, so I don't have to turn it on manually every time I turn on the camera.  I bought the SD200 instead of the 300 because the I don't need the 300's extra pixels, and the 200 has a faster continuous mode.It also has video mode which has made my video camera nearly obsolete.  It takes DV-quality movies of unlimited length (until your SD card is full).  I wish it had stereo sound though.  And, you can't zoom or change focus while taking a movie.  Once in a while I get a video that is out of focus.  But this is still not a good enough reason to lug my video camera around.  There are some great videos of my daughter which I only got because the camera happened to be in my pocket.I do have problems with redeye when using the flash, but I rarely use the flash.", "Date": "December 2, 2005"}, {"Title": "Which of the SDxxx Series is right for you?", "Author": "diljs", "ReviewID": "R35FA9884NHIKT", "Overall": "5.0", "Content": "Let me begin by saying that Canon makes exceptional digital cameras; the best in the market right now. This is because they have always used high quality components since they began manufacturing digital cameras. This one is no exception.Now that I've sold you on a Canon, which one should you choose?First off, let's see if you really need an SDxxx camera, or would be better suited with a cheaper non ultraportable camera.The SDxxx Series offers several key advantages over less portable models:-Beautiful, sleek design and metallic body will wow anyone who sees it.-Gorgeous 2 inch LCD screens-The excellent Dig!c 2 processor (other Canons only have dig!c 1)-Much better movie mode than previous Canons-Small light, easy pocketabilityOn the other hand, there are some significant drawbacks due to the components Canon had to use to get the camera so small:-Few manual controls.-Pictures are not as sharp as those of similar non ultraportable cameras.-The flash is very close to the lens (lots of redeye problems)-More purple fringing issues than other Canons-Proprietary batteries that are expensive to replace-The LCD is very fragile. Read the SD200 and SD300 reviews to see lots of unhappy people whose LCDs broke. Canon's warranty does NOT cover this either. My suggestion? Buy using a credit card that offers a warranty in addition to the manufacturer's. If your lcd breaks, many CC companies will replace the camera no questions asked!If you don't need the ultra portability and flashy looks of the SD cameras, a slightly larger camera with more features might be right for you. I would highly suggest Canon's A510 or A520 if you don't need an SD model.If you still want an SD model, which one should you choose? The SD200 with 3.2mp, the SD300 with 4mp, the SD400 with 5mp, or the SD500 at a whopping 7.1mp?Your first instinct may be that more megapixels is better. Today, however megapixel ratings are similar to Ghz ratings in the computer world: They used to mean a lot, but they don't mean as much anymore. More megapixels do NOT mean a better image. They mean a larger printable image. Unless you have to have huge prints, you simply do not more megapixels. In fact, the 3.2mp of the SD200 is enough for anyone who doesn't plan on printing pictures larger than a standard 8.5x11 sheet of paper.That having been said, there are some differences between each SDxxx model. In order to get the larger 7.1mp sensor in the SD500, Canon had to make the camera larger. Thus, it is around a quarter inch thicker and 30% heavier than the other 3 models. The larger size did enable Canon to pack more features into it, however:Features unique to the SD500:-1/4 inch thicker-30% heavier-50% longer flash range-14% more battery lifeThe SD400 and SD500 also share these benefits over the SD200/SD300:-New \"Night Display\" feature which brightens the LCD in low light-My Colors feature lets you highlight or swap colors right on the camera-USB 2.0 High Speed supportThe following are shared by all the SDxxx Cameras:Pros:-Beautiful, eye catching design-Great image quality, though not as good as non ultraportable models-New Dig!c 2 image processor-Excellent Movie Mode-3x optical zoom is adequate for most people-Excellent, intuitive manual controls-Huge 2.0 inch lcd that looks great under various lighting conditions-Uses widely available and cheap SD cardsCons (most of these are minor quirks):-Some purple fringing problems-Proprietary batteries are expensive to replace and inconvenient at times-Lots of issues with fragile LCDs-No RAW support-Few manual controlsIf you do choose this product, the first thing you should buy is a larger SD memory card. The camera comes with a 16mb card (32 in the SD500), which is pretty much useless.You should also immediately purchase a case and some screen protectors to protect the LCD.", "Date": "April 18, 2005"}, {"Title": "Well done Canon", "Author": "Ozgur", "ReviewID": "RH13NIGJ5DORF", "Overall": "4.0", "Content": "Everything that a non-professional can ask for has been packed into this little miracle.I ve been on the hunt for a digital camera for the past 4 months and have been researching the SD200 for the past 2 months. I considered a lot of factors, such as price, electronics, optics, digital noise, video capabilities and size.This camera has satisfied all the items on my checklist.There are many shooting modes and also functions that allow you to modify light, shutter speed , etc... Hence you end up with many combinations that is sure to give you the quality of shooting  most likely any situation demands.Canon has been able to bring together the optics and electronics in digital cams very well. SD 200 is a result of this progress.One major improvement is that this thing can record AVI movies as long as memory remains. There are 3 video shooting modes and unlike other cams where there is a time limit, one of the video modes (the standart one) has no time limit.The body feels solid, and dont worry about carrying it in your side pocket. As long as there are no other items in the same pocket, dont worry about the 2\" screen being damaged either.Battery life is good. It lasts for all-day-long trips. For longer periods a second battery would help. It takes 2 hours to charge.Things I did not like :The switch for shifting between movie , pic and review modes is plastic and is not \"flush\" with the body of the camera. It protrudes and it becomes a bit shaky, which is not the kind of thing you want to see on a camera of this quality.The software is cumbersome. I'd rather have a direct plug and play version, where i can transfer my images like from any other storage device. Having to go through a software is not appreciated.SD200 vs. SD300 , i'd say go for SD200 .There is about $120 price difference. So spent that money on things that matter such a larger memory card (definite need) and an extra battery.", "Date": "November 9, 2004"}, {"Title": "Super small camera with good features at a great price", "Author": "Zubin Sukheswalla", "ReviewID": "R2FKQ2RQ1PNCJT", "Overall": "5.0", "Content": "I recently bought the Canon SD200 and boy is it SMALL!!! Take an Altoids box and this camera will fit right in it. It is ultra light and compact and absolutely handsome because of its steel body (mind you though that all metal bodied cameras get scratched easily...so I recommend buying a small pouch for it..samsonite has a really neat one with a hook and belt strap that fits this camera perfectly for around 4$). This camera will fit in your pant pockets and you will not feel its presence at all (kind of bad because you tend to forget you have a camera at your disposal for those picture perfect moments).The performance of the camera kind of took a second priority in my selection of the camera. However after saying that, the Canon SD200 is the best in its class when it comes to pictures. It won't be as good as the bigger bulkier cameras with wider apertures. I kind of figured that I am no photography connoisseur and after researching a lot I concluded that for amateurs like me this camera is superior by all picture standards in its class. After using this camera I feel that it does a great job and that my research sources prior to buying the camera were accurate in that.Before I go into details something I must mention is the 2\" LCD screen. It is absolutely gorgeous and has around 200,000 pixels giving you one of the best LCD pictures you will see on any digital camera. As for the features you can read up all the other reviews and also look online. My favorite feature though is the movie mode. It records video with sound until your memory card fills up. That means that unlike all the Canon predecessors this one has no video clip time limit. That is a good move by Canon and it pays off especially when you can take fast frame rate movies (60 frames per second) for fast moving action like from a moving car or a pet moving fast. No other ultra-compact camera and maybe even most of the compact cameras come even close to the quality of the video taken by this camera. So get yourself a 512Mb SD card and you can take approximately 6 minutes and 11 seconds of great video. Ofcourse, you can go to the 30fps mode and take double the amount of video time though quality is good but not something to rave about.This camera does a good job for night shots and also against glares, for example where there is a window behind the subject to be photographed and it is sunny outside. The camera has many features that you can manually control. Of course experts would like more control of the camera than the ones offered but hey if you want a manual camera get a film SLR. Those are much cheaper and much better than modern day digital cameras. Good luck to those experts hanging them around their necks while people like me stroll with the small digital ones in our pockets. It is a trade-off and this review is not ment for experts because they obviously know much more than what information this review can provide. This review is meant for people like me who until a month back was completely overwhelmed by the choices around and did not know which one is the best to suit my needs.So here are the kinds of people I think should buy this camera:1. People who care about mobility2. People who don't care that their pictures are perfect (by perfect I mean something that will make photography experts rewrite their will to the camera, had it been a person)3. People who want a bang for their buck (most of us fall in this category), and lastly4. People who have a good 250$ to invest in a great cameraThe only con of this camera is the rechargeable battery which is around 45$ when the one provided runs out. The good thing though is that the battery lasts 300 recharges and 140 pictures with flash for each charge as per Canon. That being said this camera is the best in its class when it comes to the picture quality taken for its size and weight.A couple of things to be aware of though before buying this camera.1. This camera has a very flimsy battery/SD card cover. Be careful while using it.2. This camera has a tripod mount screw hole right besides the battery/SD card cover so you cannot open the cover with the camera mounted on a tripod.3. This camera will get scratched easily like all metal case cameras do.4. This camera has its flash positioned at a place where it is easy to block it with one of your fingers.5. This camera is so light that it is easy to forget it in your pocket.6. The battery in this camera is meant for 300 recharges. So if you recharge it when it is partly empty then you loose one of your 300 recharges. So only recharge when the low battery light comes on.The 6 points above in my mind are all very minor and can be worked around very easily with a little caution and planning. So I would definitely recommend this camera to any \"novice\" but also advise users about the few things that they have to look out for after buying it.", "Date": "December 29, 2004"}, {"Title": "Latest in the Elph series", "Author": "superman2k3 \"superman2k3\"", "ReviewID": "RD6RPLCFQ6Y1", "Overall": "4.0", "Content": "SD200 is the latest Elph from Canon. It is slimmer and loaded with more features than ever before.Pro's,1. Good picture quality for a super-compact camera.2. Priced right.3. Excellent feature set.4. Large LCD screen.5. Cool metallic body.6. Excellent package including a smart world charger.7. Uses industry standard SD cards, not propreitary memory sticks or xD.8. 3MP and 3x zoom is the right combination for most people. Any more MP would a waste of money.9. Intuitive interface and solid build quality.Con's,1. No manual controls yet on Elph.2. Awkward to hold compared to older Elph's (No place put your right thumb when taking pics).3. Battery life is below average.4. Another costly & propreitary battery from Canon.Its hard to get very exicted about the latest Elph if you already own one, there isn't much new. However if you are looking for your first, the SD200 is an excellent choice.", "Date": "December 2, 2004"}, {"Title": "Excellent camera!", "Author": "Karyn", "ReviewID": "R1O0JEHQGQ1FNJ", "Overall": "5.0", "Content": "After reading many complaints about the \"fragile\" LCD screen and worrying (needlessly) about purchasing this camera, I went ahead and bought it. This camera is a bargain! Lots of great features! Long lasting battery, perfect crisp macro pictures, continuous shooting mode, b&w; or sepia pictures or movies.As for the LCD screen, if you read the instruction manual, it does say to prevent damage to the screen from condensation, to keep the camera in a resealable plastic bag when going from hot to cold or cold to hot temps and letting it come to room temperature before using!The movies from this camera are the BOMB! No need for a camcorder if you have a 1G SD card!I also love the girly features such as colors for the clock screen, wallpaper, sounds (dog barking, wolf howling, bird chirping), etc.Anyone interested in the Canon hard case for this should go to Best Buy-they have a similar generic, genuine leather, hard case for only $7 and carry it in black, brown, red, or croc embossed!I'm having a blast with this camera and find it well worth the price!", "Date": "December 17, 2005"}, {"Title": "Don't Let The Size Fool You! This Canon Elf Is Stuffed Full Of The Best Of Digital Camera Technology! You Can't Go Wrong!", "Author": "Peter V. Cannice \"Peter Vincent Cannice of Sc...", "ReviewID": "RV7MZ220NF5AE", "Overall": "4.0", "Content": "You really can't go wrong if you're thinking about buying this great camera-the Canon Powershot SD200 3.2MP Digital Elph Camera with 3v Optical Zoom. With so many brands on the market and so many choices, where does one begin to find the right camera for their personal needs? Where does one begin to isolate the camera that they want to buy for themselves or as a gift?I hope that this personal and honest review will help you to narrow your search and help you develop more faith in what you're buying. So if you're looking for an outstanding digital camera, you've found it with this great one from Canon. This is a VERY dependable camera, probably in the top of the review listings and don't let its smaller size fool you at all! It's a camera that will always take color-rich and great photos for you-even if you make a slight mistake or move your hands just a tiny bit when photographing. It actually has a great deal of technology that is built-in and designed to compensate for anyone who might be in a poor lighting situation or someone who forgets to focus well before shooting the picture.Canon Powershot Digital Cameras are hard to compare with others in the this arena. I've had a Powershot for a long time and I've taken over five thousand photos with it-it stands up against me dropping it or taking photographs in the rain. Aside for requiring powerful alkaline batteries that use a good amount of power, there is no downside to this incredible digital camera from a great digital camera maker. Canon was in the camera business decades before digital cameras were even on the market.If you're looking for a gift for someone, you've found it in the Powershot SD200. If you are an avid photographer, like myself, and wish to have a camera for digital shots-this is the baby you'll want to buy or one you'll want as backup.There is a great deal of information that you can read about this camera  on the Canon website and other review sites online. You can compare the camera with others in the same category. You might find some slightly better deals with other brands that might offer increased amounts of Megapixels. That is NOT what you should be looking for. You will never need a 7 Megapixel camera unless you plan on blowing up your photos into poster-sized photos, so don't think that your Canon is less-than or not up to the standards of cameras with much higher Megapixels. Often the number of Megapixels is only possible with the use of special software to inerpolate the photographs. You don't want to have to worry about all of that. You are set with the Canon!Canon puts together an entire Kit or Package when you buy the Digital Elph. I wanted to also let you know that the software that's included with the camera package is fantastic and is literally worth the price of the camera in itself. However, you're getting a super package with this deal and a camera that can depend on for as long as you want to own the camera. I've  exposed it mine to rain about 10 different times, and I've not EVER had any even a small incidental problem. It's like the Energizer Bunny of Digital Cameras-It just keeps on Going and Going and Going and never stops!I hope that this honest review was of some help to you as it was a pleasure to write it for you.Pete CanniceScottsdale, Arizona", "Date": "November 22, 2005"}, {"Title": "Excellent camera", "Author": "S. Nilakanta \"Sree\"", "ReviewID": "R171BT0K5JYS2H", "Overall": "5.0", "Content": "This is the third digital camera I have bought. The first was a Sony, then a Nikon. The Nikon Coolpix 3200 failed to live upto the Nikon quality. Its main failing is the battery. AA batteries, whatever the type and make, does not cut it when it comes to digital cameras. The Canon SD200 has a rechargable Lithium battery. The camera's night time photography features are excellent. So are the other modes. Another thing I like is the larger display. It is also brighter. Auto focusing is great. The little squares come out to help quickly in the view. The MPEG feature is also very good. Overall, I love this camera. I was planning on buying the Sony L1 but it never came out on time. Now I do not regret buying the Canon. I liked this camera so much that I bought a Canon Digital Camcorder too. The Optura 40. I had a Sony 8mm that has stopped working. I was going to buy the HC85.I recommend Canon cameras to all.", "Date": "December 8, 2004"}, {"Title": "A fantastic little camera, great for people with kids.", "Author": "twofruits \"twofruits\"", "ReviewID": "RG6YLELZISZNK", "Overall": "5.0", "Content": "I had an older digital elph I bought in 2000. Its been a good camera (and still is) but didn't have the ability to take videos, something I really wanted now we have a kid.I like photography, so I was initially looking for something that had manual controls, plus took vidoes. I was looking at the Canon G6 and the Sony DSCV3. Both great cameras, but what changed my mind was the portability factor. The SD200 will slip in your shirt pocket, the other two won't.Sure, I've not got full manual control, but the portability factor won me over. Also the SD200 has a far better movie mode than the G6. (It used Canon's new DIGIC2 processor, only seen so far on its really expensive cameras)Image quality is *great* as is the battery life. Quality may not be like the G6, but you won't notice if your only printing 6x4 or looking at them on your screenDon't let the 3.2 megapixel worry you, its fine for 6x4. If your looking at this or the more expensive sd300, get this one. the slightly higher res is not worth $120., for the extra $120, buy a *really* big memory card and a extra battery.Can't seem to get your kids smiling ?, with this camera, just set it in continious mode and hold the button down. over 2 shots per second! until you fill the memory card ! Your bound to get at least one with your kids smiling.Thinking about the Sony T1 ? Its great too, but this is far cheaper, just as small and the memory cards are cheaper also, and remember 3.2 megapixels are ample for 6x4 prints.", "Date": "November 17, 2004"}, {"Title": "Not good enough... for Canon", "Author": "Vladimir Ratner \"vratner\"", "ReviewID": "R13R4XCGJ97CLF", "Overall": "3.0", "Content": "I consider myself somewhat of a semi-professional photographer.  I used to work for Kodak in Professional Digital Photography department for a couple of years, so I do know a bit about photography in general, and digital photography in particular.  I do think, however, that my review will not only be useful to those who already know what digital photography is, and just looking for a new camera to replace/upgrade the old one, but also those who are completely new to the world of digital photography as well.  I'll go straight to pros and cons, since I think that's what most of people want to see in reviews, especially electronics' reviews.  So, here it goes...PROS:Compact - this is probably my favorite feature, if you can really call it a feature.  It's small.  It's very small, and thus portable.  You can put it in the pocket of your pants and/or shirt, although I wouldn't recommend doing it as it still has some weight to it.Aluminum case - another nice feature.  Most of the cameras on the market are made of plastic.  What happens to cameras when they get dropped on the floor?  They brake.  They brake easily.  Aluminum case on this camera does not, of course, make it indestructible, but it does add that extra layer of protection that most of us need.Decent picture quality - for a small camera, with only 3.2 MP, the picture quality is quite good.  I suggest you look for a different camera though if you are too \"picky\", because it's not perfect.Movie mode - I've been quite happy with it.  Shoots nice little video clips, which you can watch right away on your TV, by hooking the camera up using provided cables.Overall Ease of Use - another thing I like about this camera is that you don't have to be a rocket scientist to figure out how to use it.  Yes, it comes with a nice little manual, but you can start using it right from the box.CONS:Price - for this range of cameras it's quite expensive comparing to other brands.  You might want to consider a Nikon, Olympus, or maybe even a Kodak if you want to save yourself a \"few\" bucks.Battery life - in one word - horrible!  The battery lasts maybe an hour.  I strongly recommend you have a backup.  A couple of tips also: LCD takes up a lot of battery life, so minimize the use of it to a minimum.  Movies also tend to take more \"juice\" out of a battery.Virtually non-existent red-eye reduction - why do they have a red-eye reduction mode on this camera is beyond me.  The pictures of people and animals come out having red-eyes no matter which mode you are shooting in.  I use digital editing software to fix it.Flash - the flash is not very \"powerful\", if you know what I mean.  I guess, for this particular camera, since it's so compact, it's not bad, but for someone who's shooting a lot in the night mode, this could be a problem.Digital zoom is practically useless - just what it says - if you use it, you \"loose\" it.  If you use a digital zoom while making a picture, it will come out blurry.Shooting of moving/night objects - if you shoot a lot of moving objects and/or night objects, I suggest you look some place else.  This camera doesn't do a good job in either case.  It takes a lot of time tweaking between different modes/parameters for a picture of a moving car for example to come out right when using this camera.Not good enough of picture quality for Canon - I know I said that the picture quality of this camera is not bad, but... Canon is the world's leading manufacturer of digital photography equipment.  I think they can do better, especially considering the price.Summary:  This is not a bad camera by all means.  It's a good \"starting\" camera.  It's a Canon.  That means reliability.  If that's what you're looking for, go for it.  But if you don't care which brand it is, want to save yourself some money and still have a decent picture quality after all, I suggest you look some place else and read some more reviews on Amazon.", "Date": "September 14, 2005"}, {"Title": "I MADE THE RIGHT CHOICE!", "Author": "Helen \"lotsofkids12345\"", "ReviewID": "R27VPNGE6KH86K", "Overall": "5.0", "Content": "I have been reviewing and comparing all the ultra-compacts and \"finally\" decided on the Canon SD series.....(it had the best reviews in the video mode as well as continuous shooting, great macro and 1-15 slow shutter speed.)  I was then torn between getting the older SD200 or going for the SD 400 with 5MP of resolution. Well, I called Canon asking multiple specific questions and found that the SD200 and the SD400 have the very same features and technology in almost everything...including the same video exactly. I found the 3.2 resolution produced terrific shots and were better than I had expected. The digital macro zoom was amazing. And don't miss the continuous shooting mode....it's impressive. If you don't need the \"color swap\" mode, the increased resolution or USB2 upload (SD200 has USB1)....then save a lot of money and get the same little camera for a LOT LESS MONEY! Do buy a 1GB memory card and a sturdy case. I also bought a screen protector...after reading all the problems w/LCD's. I occasionally had some red eye...but not too much. Photos taken in low lighting conditions w/o a flash turned out great. The SD200 comes with Arcsoft software that (most reviewers) feel is better than the software coming with the newer SD models.Negative...might be the flimsy plastic door hinges.Positives....the metal tripod attachment on base..NO silly docking stations. A \"real\" viewfinder .... easy & small battery charger that plugs right to your wall outlet...continuous shooting...great video clips....easy to navigate interfacing.After extensively searching for tiny cases.....I was VERY happy with a HARD case I found at Ritz Camera...the Quantaray Hard Shell Camera bag (AMAZON search it) in Navy or blk @ $14.95......it is an ultra compact case that has NO BULK, lightwieght and great protection (if you're like me and bought a small camera & want to keep things small..This is wonderful)....It opens along the top and sides by zipper, it then folds open accordion style (I'll upload a photo)..so it is soooo easy to put your camera in and out. It also has a detachable, adjustable neck strap and a belt slip on the back and an internal webbed pocket that fits my extra battery very comfortably. It should fit all the SD models.This is my perfect case....I don't attach the neck strap....so it fits seamlessly in my purse. Do check it out...I really think you'll like it.IN FOLLOW-UP: 6 months later..I STILL LOVE MY CAMERA..although the prices have come down on this model considerably...at least $50...I actually saw this going for $170 on amazon! (I Paid $230) so with that in mind you can either save more on this great little camera...or splurge up to the SD400 model...of which prices have also come down a bit! Either way....you will have a super little camera. I do a lot of macro closeups...and I'm very happy with what I get for the price!", "Date": "August 22, 2005"}, {"Title": "Canon Powershot SD200 Elph-3.2 MP-The best of the best", "Author": "M. Kane", "ReviewID": "R266XS5ETC1FAF", "Overall": "5.0", "Content": "I have watched many people such as friends, family, and others purchase and use different digital cameras.  One day I was at my best friends house in Tacoma, WA, and her daughter stopped by.  She wanted everyone to see her digital camera pictures she had taken while fighting fires in Idaho.  It just so happened that she had a Canon Powershot SD200 Elph.  She seemed to know her way around the camera quite well and she began to show us all the pictures and video clips that she was so proud of.  I have to say that I was absolutly amazed with the steller quality of the pictures and videos taken with the Canon Powershot SD200 Elph.  The colors were perfect as well as the overall picture quality.  However, what really captured my attention was the quality of the videos/movies the camera had taken.  She plugged the camera into a 27 inch television and the quality was close to that of a DVD.  Heck, I was sold already.  Coupled with the excellent sound quality I said to myself that I was going to get that exact camera some day.  Well, I just purchased the camera and it is everything I expected and more. I am having a blast  taking pictures for once in my life. I am absolutely certain that the Canon Elph Powershot Digital Camera is the finest on the market today.  I say this because I have seen many other digital cameras perform, and none that I have seen come close to the performance, qaulity, workmanship, and dependability of the Canon SD Elph series.  One other remark if you don't mind.  I have an older Canon AE1 35mm camera.  I thought that it provided me with extreamly good pictures and dependability over the years always using the automatic setting, but the Canon Elph SD200 actually takes better quality pictures than the Canon AE1.  Now that is saying something.  If I was you, I would not hesitate to purchase a digital camera because they are so easy to use in our computer driven society.  Get a Canon Powershot SD Elph and you won't be sorry in any way, shape, or form.  I can say with 99% certainty that the purchase will be one of the best investments you will ever make. Hey, it's a very cool camera!-M.Kane", "Date": "June 9, 2005"}, {"Title": "LCD is big but fragile", "Author": "John B. Mudd", "ReviewID": "R2ZTPDFS9MVV6O", "Overall": "1.0", "Content": "Think twice before buying the Canon SD 200, SD 300 or any SD series camera.  The LCD displays are large but extremely fragile.  Mine was cracked on the second day. It was NOT dropped or abused.I also have a Canon S110 and have taken just over 5,000 photos with it since Christmas 2001 without any problems.  Apparently, in an attempt to make the new models light and the displays large, Canon sacrificed durability.In some cases Canon will \"waive\" the LCD repair cost.  In others they demand $165 for the repair.Canon repaired mine as a favor.  And I've since purchased a 'da Protector Model 104 - LCD protector.  A thin plastic shield that fits well over the LCD window and is stiff enough to shield the LCD from any contact.", "Date": "April 21, 2005"}, {"Title": "Takes better pics than my larger Canon S30", "Author": "Andante51", "ReviewID": "RD4A8PFDBZ89H", "Overall": "5.0", "Content": "After doing considerable research, I bought one of these for my 77 year old Dad for Christmas, loved it so much I had to have one of my own.Here are some of the thoughts I would like to add to those that have already been covered:1)  EASE OF USE!  I teach classes on digital photography and using the internet at a local library, which attract a lot of seniors, and even though this baby is small I think it is VERY user-friendly for non-techies to use.  The screen is large and very crisp, the control buttons are intuitive and not teensy, and MUCH easier to use than those on my bigger Canon S30.2)  I don't care if you are a real digi photo nut, and absolutely have to have some feature laden 12x optical zoom camera with digital image stabilization (I currently am swooning over the Panasonic DMC-FZ20K) - you still need a small camera that goes with you EVERYWHERE.  Guys have it real easy, the case fits beautifully on a belt, it also doesn't weigh down the purse I'm cursed to lug around.  I have solved the big powerful, smaller capable camera debate:  you need both.3)  This camera simply takes BETTER PICTURES than my S30 (which cost $500 two years ago).  People's faces just plain look better.  The contrasts aren't so drastic, which caused me no end of problems before.  Before my Mexican son-in-law looked so incorrectly dark, I'd have to lighten him to where my daughter looked like a ghost - but not with this camera.  Skin tones are more realistic and flattering.  My S30 seemed to bring out every flaw on faces like a laser, and I had to spend hours photo editing folks to make them not want to wince when they saw their pictures.4) The camera is FAST - a speed demon compared to my S30.  Fast turning on, fast switching between pictures, fast everything - and that is with a 1 gigabyte ATP high-speed memory card I got so I could take plenty of movies (only cost $92).  I have two fast moving grandsons - in the past the shot would be lost by the time my S30 got cranked up and ready to go.  You turn this one on, and it's ready to shoot instantly.  Grandsons don't stand around waiting for my taken pics to display (\"can I see it, can I see it??\")5) This SD200 matches and even exceeds the incredible performance in low lighting of my S30.  You will NOT find another camera in this size or price range that does better.  A week before buying the SD200, I tried out a $200 Samsung camera - god it was sad.  A picture in my family room with even outside midday light coming in through a doorwall turned out to be nothing but a dark ugly mish-mash.  The Samsung was returned in a jiffy.  You can take this camera into a pitch black room, punch the button, and have a picture that looks like it was taken in FULL room light.  This is what messes up most amateurs' snapshots, dark gloomy pictures.  The autofocus beam kicks, and the flash is very powerful.6) The movie feature makes the camera even more incredibly wonderful.  My S30 had an imposed limit of like 2 minutes - boom, right before the end of my grandson's song, it stopped.  This one can go as long as you have memory - spend the extra for a big fast memory card (I got the ATP 1 gig) because you're gonna want to take lots of movies.  No more dragging a video camera and camera around.  Just beware - you are gonna need a lot more light for videos.In conclusion, I think this is one hot camera that will meet most people's needs wonderfully.  Can't wait to show it off to my classes (too bad I can't earn commission on them!)  Remember on a bigger camera, you will still have to carry it in a camera case, you will still not take it with you unless you plan ahead to drag it along, and then have to worry about who the heck is going to carry it.  Hence, I missed a lot of pictures.  And at a mere $269, you can have a cadillac for a small chunk of bucks.", "Date": "December 28, 2004"}, {"Title": "The Best Camera Ever For a College or High School Student", "Author": "College Kid", "ReviewID": "RQ0YF5PUQ43MW", "Overall": "5.0", "Content": "When this camera first came and I opened the box it was smaller than I expected it to be.The basic reason I wanted a camera was to click prictures when I am out partying which means that the camera is not handled with care. But this camera was so sturdy that during Halloween the button to click the pictures fell off but it was easily reattached.Another reason I had heard was that higher mega pixel cameras require a lot of stabilty in your hands which is not usually the case during partying or just chilling when you actually need the pictures to be clicked to preserve the moment. This camera clicks pictures which are very good. I mean you dont need detailed functions which take time to understand and use as special moments do not last for ever.This fits in easily anywhere and the battery lasts for ever. Its definitely worth the price you pay for it.", "Date": "November 18, 2005"}, {"Title": "Broken Screen, Broken Heart", "Author": "K. Ackermann", "ReviewID": "R1J434D9HK9QJ0", "Overall": "2.0", "Content": "Camera is fun to use and takes great pics for its size.  But if you're looking for something pocketable and take-anywhere this isn't necessarily it. The screen breaks way too easily.  I had it in the front pocket of my jeans and it cracked while I was tying my shoes!  Cost to repair is 2/3 the cost of a new camera. I've had a few other cameras, bunch of cellphones, and PDAs, put them through much worse and never had problems with the screen.  Canon wants me to pay for the repairs but instead I'm gonna put the money towards something that can survive a few shoe-tyings.", "Date": "January 20, 2005"}, {"Title": "Another cracked screen here", "Author": "H. CHEN", "ReviewID": "R2VF4UDNDN6LUQ", "Overall": "3.0", "Content": "I had it for less than 2 months and the screen was cracked. I've owned an S200 for years without any problems and I switched to SD200 for the movie mode. Many people have the same experience with the LCD screen and it seems to have something to do with the cold weather. I was told that Canon refused to repair them, so I don't know if a class action lawsuit is on the way. I loved this camera when it lasted. Movie mode was fantastic.", "Date": "March 22, 2005"}, {"Title": "Canon SD300 - Cracked LCD", "Author": "Healthiest \"Healthiest\"", "ReviewID": "R1TBVSLK3XYT7C", "Overall": "3.0", "Content": "I am very happy with this camera due to it's small size and several different shooting modes. However I noticed that in low light conditions if you do not use the flash the pictures are somewhat blurry, even if you change the settings around. It appears that the camera needs the flash to focus properly. Red-eye is a major problem with this camera even with the red-eye reduction shooting mode. So be prepared to fix a lot of red-eyes out of your pictures.Also my LCD cracked for no apparent reason. I took the camera out of it's case to take a picture and the LCD was white with a purple blob in the center. I was unable to view anything on the LCD or even change the settings. I mailed the camera back to Canon for repairs, which takes about 3 weeks and as you can imagine it is not covered under warranty. The cost for the repair is close to $200. I did some research on the internet and found that this is a common problem. I really like the SD300 but am rather unhappy with the LCD repair costs and problems.", "Date": "February 7, 2005"}, {"Title": "My LCD died too. Cracks/lines after 10 days", "Author": "DB", "ReviewID": "RICFZN4RKOQ4C", "Overall": "2.0", "Content": "I bought this camera because I saw nothing but good review upon good review. When I received it, it had what appeared to be one dead pixel - white or very light blue, it only showed up on dark backgrounds. I let it slide because it is a common problem with LCD's.Then, only 10 days after having the camera and without dropping it or banging it, or submitting it to extreme cold or heat (it cost me $220, so I was obviously careful with it) I turned the camera on only to find that the LCD had what appeared to be cracks running through it. The cracks are NOT on the LCD, but appear to be in the picture itself. This is topped off with some strange colors. Basically, the thing is dead, and I hope I can refund it since I've learned that many other people have had the same problems. Imagine if I went a month and couldn't return it at all! That's $220 plus $150 to get it fixed by Canon, who I have been told take no responsibility when these lines or \"cracks\" appear. I won't be buying it again, no matter how cool it was when it was working.", "Date": "April 13, 2005"}, {"Title": "Great Camera - excellent value", "Author": "Andrew Sun", "ReviewID": "R250VX34NBEN3A", "Overall": "5.0", "Content": "I lugged a Kodak DC4800 around for several years and decided it was time to upgrade.Pros:+ Picture quality is great.+ indoor/flash pictures are MUCH better than my old DC4800.+ with fast SD card, you can take pictures over and over and over and over... without stopping (at a little more than 2 pictures a second.)+ ditto for movie mode.  you can take as long a movie as you have SD card space (@ 15, 30 fps)  this is the big strike against the S410/S500 for me.  i can get ~4.25 minutes on 512MB card @ 30 fps, 640x480.  (get bigger SD cards!!!)+ tri-pod mount is centered on the lens, not the camera body.  (though it does look ridiculous putting such a small camera on a tripod :-)+ you can view 9 pictures at once in review mode+ you can't beat the ELPH's styling.  :-)  very solid construction.Bleh:+/- you can argue over the resolution if you print 8x10s.  i think 2MP is fine for viewing on computer screens and printing 4x6 photos.  so 3MP should be fine for most folks.+/- Camera will rotate pictures 90 degrees automatically.  HOWEVER, you have to use Canon software to preserve the rotation.  When I transfer via PTP in Windows, I lose the rotation.+/- you can use the zoom to take videos.  however, you can't change the zoom while you are recording video.  for example, if you use 3x zoom to take a video, the whole clip stays @ 3x.+/- you can edit the video on the camera, but i haven't completely figured out the interface yet...Negative:- Manual controls limited.  Can't choose aperture, or short exposure time.  You can select long exposure times (1-15 seconds)- Noticeable lag between hitting the shoot button to when the camera actually takes the picture.  Not recommended for \"action\" shots.- Video mode does not rotate 90 degrees.  If you rotate your camera while taking videos, be prepared to rotate your head when viewing it on your monitor!- gotta get another canon battery for those long backpacking trips.--- updateFor $170, this is a great camera for the money.", "Date": "December 31, 2004"}, {"Title": "LCD Screen is too fragile.", "Author": "Richard M. Shaner", "ReviewID": "R2MQ1U9HSTYDYL", "Overall": "1.0", "Content": "I have to be honest the Camera is the perfect size, takes OK pictures, but not great, would be great for casual pictures, and home shot.  The main drawback is that the LCD screen is WAY too fragile.  It literally takes nothing to crack it, and Canon will not cover it under warranty.  My LCD broke in a case with a plastic lcd screen protector on it, I have been very careful because I was aware of this problem.  Canon built a pocket camera that is too fragile to carry in a pocket.  I highly suggest you find and buy something else.", "Date": "November 29, 2005"}, {"Title": "It seemed like a great little camera...", "Author": "T. Trow", "ReviewID": "R1PN7KA42P9B58", "Overall": "1.0", "Content": "I bought this camera for my twenty year old son for Christmas.  The LCD screen broke within two weeks.  He sent it to Canon and they said it was caused by impact/pressure, and he would have to pay $150 to have it repaired.  When I bought the camera there were no negative reviews on this site; now there are at least seven regarding cracked LCD's.  I think this is a defect that Canon should make right.  Until then, I would not recommend this camera or any of the same line.", "Date": "April 20, 2005"}, {"Title": "has it's ups and downs.", "Author": "GatorGirl", "ReviewID": "R2S3LHO90RWECE", "Overall": "3.0", "Content": "What encouraged me to write about this camera was my own camera messing up.  I've owned it for a mere 2 months and there's already an internal error (E18, something with the shutter, so Canon tells me..because the lens will not retract back into the camera anymore) that I have to have Canon fix, after I pay money to have it sent in, of course.  I read this happening in a review for the camera when I was doing research on the camera, but only one customer complained about it.  So I kind of assumed it rarely happened.  I have yet to send in the camera, but they better fix it when I send it in, and it better never happen again.But on another note. Prior to this malfunction, the camera was fairly decent.1) I love the movie mode.  The sound is great when I play a movie on my computer.  It's necessary to buy a high speed memory card if you're going to record movies at the camera's maximum potential.  I have a regular speed memory card, and it only let's me record ~20 seconds of the top quality video before it automatically stops.  So that sucks, but something CAN be done about it.  You don't REALLY need that top quality anyway, I feel that the next one down, I think it's 15 fps, works just fine.  If I'd do it again, I'd buy a high speed card just so you have that option.2) Night snapshot.  I don't think it works too well.  The lighting usually ends up being blurred, like I moved the camera mid-take - although that is definitely not the case.3)Red eye.  It's inevitable and regardless of whether you have the red eye reduction setting on or not, it doesn't work.  If anything, it just takes longer to take the picture with red eye.4)I don't like the way you take a picture.  I feel like it takes so much longer to take the actual picture.  First you have to let the camera focus (pressing it halfway down) and THEN it will take the picture.  It seems like I have to hold the button down for a few seconds.  I have some people take pics for me, and sometimes they think the camera took the picture, but it was merely the beep of the focusing.  It's not the best for taking spur of the moment pics.  If my friends happen to be doing something funny, sometimes I miss it because the whole focus, then shoot.  I usually find myself holding it halfway down all the time, just so it'll actually take the pic the second I want to take a pic.5) It is a short time between taking the actual pictures though, so that's a plus.  As soon as you take one, the camera is ready to take another.  Definitely a change from my older Fuji FinePix2650, that took at least a few seconds to get ready again.6) It fits well in a jean pocket.  FABULOUS!7) The picture quality is pretty good.  I'm not a professional or anything, so I don't notice purple fringe and stuff. (Heck, I don't even know what that looks like, hah)  The only issues I have about image quality is what I've said in 2, 8 and 13.8) This is kind of a universal thing with cameras, but I don't like the fact that the pictures are usually blurry if you don't use the flash.  I guess it's because the shutter speed or the fact that you have to watch how much you shake when the picture takes.  But I'm sorry, it's hard to NOT move the camera when you have to push down a button.9) Someone mentioned having an issue with not having a place to put their thumb while taking pictures.  I, a 19 yr old female, don't seem to have that problem.10) The LCD does seem to be semi-fragile.  I think I'm noticing a small scratch on mine. :(11) The battery life is decent.  The only thing I wish that the camera had was a battery meter.  Just so I knew when I was halfway through, etc.  Instead, a low battery symbol flashes about 5-10 pics before it's dead.  A second battery pack is prob a good idea.12) I think they should use a different form of power.  The battery supposedly only will recharge for so many times.  Then you have to buy a new one, which will set you back about 40 bucks.  Not my idea of fun time.  My first digicam, the Fuji FinePix2650 was good at that.  It used 2 AA's (I used rechargeable) and lasted a good while.13) Distant pictures seem to be semi-blurry.  I just read the other day about an Infinity setting that supposedly is for stuff like that, but because my camera is messed up, I haven't been able to test that out yet.14) I love that it comes with cords to connect to your TV.  I think that's so cool that you can run a slideshow of the pics on your tv.15) The AF-assist beam is a great thing.  I can take pics in the dark because it shines a light at the center of the pic, so I can quickly aim in the right direction.SOrry about this review being so long.  I was just trying to evenly get the positives and negatives, and I know that if I were you, I would want to know everything and anything about something I'm about to put a good amount of money towards.", "Date": "February 19, 2005"}, {"Title": "Horrible service", "Author": "Emily M. Satterlee", "ReviewID": "RS00SP36H5O8U", "Overall": "1.0", "Content": "After having this camera for only 5 months, the infamous E18 message showed up on my camera (something having to do with the lens) and the manufacturer refused to fix this problem without me first paying a $108 fee when the camera itself cost me just under $200. That's like paying for half the camera again. I definitely do not recommend buying ANY canon powershot products.", "Date": "October 11, 2005"}, {"Title": "Great camera for an amateur", "Author": "M. Lam \"i love God\"", "ReviewID": "R2BDUSKSNR2FNS", "Overall": "5.0", "Content": "I bought this camera when the SD300 4.0 MP came out. I was debating between the two and found more reasons to buy this one over the other.1.)Larger LCD screen (trust me, it's MUCH better to be able to see your pictures more clearly without squinting)2.)It was much slimmer and lighter3.)It costed $100 lessSo why settle for something more when all you want is to take nice, decent pictures? If you're going professional you should look at the S series. But if you want a camera you could carry around (in your shirt pocket!)just to hang out with friends or go on a vacation without having to lugg all this equipment with you, this is the perfect camera. I've had it for about 6 months now (I even dropped it once =I) and it's working perfectly.The only drawback is the little flash circles it makes whenever I take a picture while others are flashing. I don't know if that should be a problem.Otherwise, it's the darnest thing!", "Date": "May 6, 2005"}, {"Title": "Outstanding Camera!", "Author": "DFXL72", "ReviewID": "R3E9JJ2P7YR1TB", "Overall": "5.0", "Content": "I would highly recommend this camera to anyone who wants a point and shoot type camera.  Very easy to use and adjust settings.  This camera takes outstanding photos!  I am highly impressed very satisfied with the overall quality of this camera!", "Date": "October 28, 2005"}, {"Title": "Good camera but another cracked LCD", "Author": "Southernwayfarer", "ReviewID": "R27A1IAYG7KUZ4", "Overall": "1.0", "Content": "Same story as many other people here, I love the camera but the screen cracked.  I've owned several other cameras that I've treated the same way and never had this problem.  This is clearly an issue that Canon must address.", "Date": "August 18, 2005"}, {"Title": "Happy Customer.  From Disposables to Digital", "Author": "n8tang \"The winners lose more than the losers...", "ReviewID": "R3HMV3B1NLQYN8", "Overall": "5.0", "Content": "I have had this camera for over 2 weeks and I am very happy with it.Aside from disposables, this is the first camera I have purchased.  I also bought the SD200 Accessory Kit--Which contains the the PSC-90 Deluxe Leather Case and the NB-4L Lithium-ion battery pack--and a 512mb Sandisk Ultra II card.Before buying this camera I was worried about its \"fragile\" two-inch screen.  So I went to Best Buy to test its durability myself.  After a couple of hard wacks with my finger and other random tests I was satisfied.  (I ended up purchasing this camera online very cheaply from a company listed on pricegrabber.)I carry this camera in my pants pocket everyday and haven't had a problem.  The key factor is keeping it in the PSC-90 case since its stiff back is designed to protect the LCD screen.  I suspect if you use a softcase from another company (i.e. Case Logic) then there's the potential of damaging the screen.  Aside from rattling in my pocket with my cell phone this camera has been  leaned on while reaching over a counter and hit it against with a bag I was carrying.  The screen is still in perfect condition.I take pictures for business purposes: store prices, the inside of a car I was interested in purchasing, and eBay.  Its speed also makes it a good social camera.  The DIGIC II processor matched with a Sandisk Ultra II is unbelievably fast and well worth the extra dollars.Battery life is exceptional.  In one day I took over 150 pics w/flash and the battery is still running.  A good trick to prolong its life is to change the Power Saving setting so that the LCD display turns off after 10 or 20 seconds after not being in use.  When you are ready to take another picture press the shutter button half way down.  The LCD will pop back on with your subject in focus.  I also turn the brightness level to the minimum--which is still bright--to save power.The last thing I would like to impress upon is its intuitive button layout. Everything can be managed with one hand unlike older Canon cameras where many of the function buttons reside under the LCD screen.  Here, all the buttons are on the right side making it a breeze to navigate.I can go on raving about photo quality, the easy user interface, and its compactness, but I'll leave that to other reviewers.  Coming from someone who was using disposables this camera is the ultimate point and shoot.  Other cameras I considered were the Sony W1 and V1, Fuji FinePix, Casio Elixim, and Canon A95, S500, SD110, S410.  The SD200 does what is advertised at a great cost.  I am very satisfied with this product.", "Date": "February 7, 2005"}, {"Title": "My 1st. Digital Camera", "Author": "Gary Ruseling", "ReviewID": "R3W036W0IGKO70", "Overall": "5.0", "Content": "Totally impressed with this camera!  As a \"starter\" for me, I couldn't have asked for more: print quality and ease of operation.  Big criteria for me was that my \"non-techie\" wife be able to operate it successfully most of the time...She did!!!  Great value for the money.  Only thing that would've made it better (but probably more expensive) would've been to be able to rotate the viewer when aiming at something, while holding the camera in an awkward position.  If you're new to digital cameras this is a good one to start with!", "Date": "September 1, 2005"}, {"Title": "Great little camera!", "Author": "ducrab \"Steve\"", "ReviewID": "R3LAGBMTKUITN6", "Overall": "5.0", "Content": "I purchased the Canon SD200 back in June and have taken hundreds of photos with it. With a 1GB memory card, the camera will hold over 600 shots taken in the highest resolution! Images are generally good to outstanding! And the movie mode is a great feature... you'll never miss that special moment with this little camera because you'll probably have it with you all the time (my wife keeps it in her purse!)If you want excellent quality digital snapshots, then this camera is for you. Don't waste your money on higher pixel models since 3.2 megapixels is more than enough for printing 4 x 6 snaphots (and more than adequate for web sharing.) You'll only need higher resolution if you're planning to crop/enlarge the photos or make big prints.I read lots of reports here on Amazon about cracked LCD screens. I'm not sure what's up with that, but my camera has gone from a cold (airconditioned) house to a hot beach many times, has been in my wife's purse (in the optional leather carrying case), and in my pocket many times. I've cleaned the LCD numerous times (gently, of course), and have had no problems. Go figure!I give this camera a big \"thumbs up\" for quality and workmanship... and for size! My only word of caution is this: Make SURE that you use the wrist strap!! This camera is so small that it's easy to drop! And, I highly recommend the optional leather carrying case with magnetic clasp available from Canon.", "Date": "August 18, 2005"}, {"Title": "great price, great performance for a compact size camera", "Author": "wenwayne", "ReviewID": "R2R5FQHO80YMGQ", "Overall": "4.0", "Content": "I have this camera for 6 month now. It has been working great. I now leave my Olympus \"almost full size\" 4 MP Digital camera (forgot the model name) at home and use this little one. The Olympus does have better picture quality (my opinion), but the SD200 is not too far from that. The reason I bought the SD200 is the size and acceptable picture quality. You can find a few detail reviews on the Internet.The movie capture function is great. If you are going to use this feature a lot, I suggest using a 1GB memory card.I did find that I was not able to put date/time stamp on the picture, but realized that this feature is only available when the resolution is set to \"postcard\" (1600x1200). Another inconvenient thing is that I was not able to force the \"flash\" in auto-mode, but switching between auto and manual mode is easy, so I will live with that.", "Date": "July 21, 2005"}, {"Title": "Good but fragile", "Author": "Digital Dad", "ReviewID": "R3IS2QXJAC64KL", "Overall": "3.0", "Content": "Bought two of these for my daughters. Pros: Takes excellent pictures; convenient size; easy to use; many feautures for the money; excellent value.Cons: LCD cracked, not from dropping or abuse. A little research shows this is not uncommon for the SD200 or SD300.  Sounds like defect to me.  Will try to get it repaired because we like the camera, but I'm a bit wary now.", "Date": "February 5, 2006"}, {"Title": "What a great camera!", "Author": "Whoozifritz", "ReviewID": "R59BY3M3XXIIH", "Overall": "5.0", "Content": "Wow. Where do I start?Well first off, I got this as a X mas present. I popped in the included 16 mb card to start shooting. That small of a card goes into the \"why even bother\" department. It holds about eight high resolution jpeg images.I got a kingston 512mb card as another present.Have no doubts about buying this camera. Dont let the small megapixel count fool you into thinking its low grade.Tips:1. Unless you are totally new to cameras, shoot in manual mode. It gives you a lot more options.2. Use a custom white balance. The auto white balance is okay, but not always correct.3. Press the shutter halfway. The focusing will be done. Then push the button the rest of the way, and it will be faster. Better pictures!4. DONT USE DIGITAL ZOOM! It may sound good, but it makes your pictures extremely fuzzy and awful.5.For movies, shoot in Fast Frame Rate. 60 frames per second! The quality is unbelievable.6. If you turn off the flash you may find that your pictures get fuzzy. Try turning up the ISO. If its still fuzzy get a tripod.All in all this is the best compact digital I've used.", "Date": "January 29, 2006"}, {"Title": "Incredible sound...incredible LCD....", "Author": "M. Perez", "ReviewID": "R35DT5X5OIZEE1", "Overall": "5.0", "Content": "This is my first digital camera, and I did ALOT of research before buying. I knew exactly what I wanted: 3x optical zoom, unlimited continous recording WITH SOUND (you wouldn't believe how dificult it is to find this feature) all in a sleek compact body. And I wanted all this with a brand I could trust. The camera was smaller than I expected, but once I became familiar with it, I was completely comfortable handling it. The software was easy to install and the directions were easy to follow. All in all I LOVE THIS CAMERA. I love this video clips I've taken, the sound is incredible. The pictures are wonderful! The battery life is good (but I wouldn't know what to compare it to), but I would say it lasted me about a 1.5-2 days of shooting pics throught the day (I'm not sure what it should last, but 1.5-2 days batt life is pretty good to me). Last but not least, the most wonderful feature is the LCD screen 2\"!!!!! Wow! I love it. I'm spoiled (I can't tolerate the small 1.5 LCD screens on my friends' cameras.)I'm not an expert, but the pics and videos are wonderful, the sound is incredible, the batt life is good, and its an easy to manage camera. And for those who need more, it has many shooting modes and functions (I'm still getting to know them myself and I've had the camera for 3 mos now). If you just want a really good quality camera, with exceptional features in a sleek compact body, I say, invest in this one. I'm more than happy with it.", "Date": "February 18, 2005"}, {"Title": "Once Again - Good Things Come In Small Packages", "Author": "Dom Miliano", "ReviewID": "RGGHZGX99FANE", "Overall": "4.0", "Content": "Canon seems to be light years ahead of their competition when it comes to important things like the look and feel of their products. The SD200 is no different. This is your basic slip-it-in-your-pocket (or purse) point and shoot camera. Perfect for making 4X6 prints or for e-mailing pictures to your buds. The 3.2 MP chip seems small these days but Canon installed the new DIGIC II chip and to my eyes, the new hardware and software deliver crisp, clear prints and on-monitor images. Despite the small size of the camera, the screen is big and clear. (That's what first caught my attention).  The 3X zoom is another surprise in such a compact package. (That's what sold me on this camera.) I have big hands but I found the camera simple to operate. In fact, since I am very familiar with Canon products, I did not have to crack the manual to get started making pictures.  I wasn't happy that none of my Compact Flash cards and other Canon batteries work in this smaller camera. I guess that's the price of progress.I have not experienced any purple color fringe effects but a friend with another Canon showed me examples so I know it can happen. Since I'm not making Ansel Adams images with this small camera, I'm not worried. That may not be true for you so make sure wherever you buy, you can return it if you are not pleased with the results. For me, mine is a keeper - it's been a reliable and fun addition to the camera collection.", "Date": "February 1, 2005"}, {"Title": "My 2nd Digital Elph...", "Author": "B. Bielby \"Hello\"", "ReviewID": "R2XHVKTOVW447O", "Overall": "5.0", "Content": "Ok, a little backstory. In January 2004 I purchased a Canon SD100, it was a fantastic Camera. One night I was using that Camera, and I dropped it on a wine bottle and cracked the LCD(bad luck). It was still under warranty, so I called Canon and I was going to send it in for repair. My father offered to make a copy of the receipt for me, but he lost the original receipt(even worse luck). So the camera was beyond repair, and pretty much unusable......The point of all this is that I was willing to fork over the amount of Dough this Christmas to buy yet another Elph. I am not the least bit dissapointed in the SD200, it is very similar to my SD100, and superior in many ways as well. Here is a list of the SD200's best assets...1)The 2\" LCD is quite large and it has a very crisp resolution, perfect for veiwing images.2)Unlike most cameras, the SD200 comes with a Li-ion batt, which provides hours of use, most cameras eat AAs like Krispie Kremes.3)The camera is capable of doing 640x480 resolution movies w/ sound, and can do 30 or 60 fps on different resolutions.4) A 3x optical zoom is decent, enough for my needs.5)3.2 Megapixels is enough for up to 8x10's at 35mm quality.Basically you should go buy this Camera. I used my previous Elph all the time, and I have the same intentions for this one. Its small enough it can go anywhere youd take a cell phone or a wallet. Its very capable for its size. Buy it. Stop reading and go.", "Date": "December 26, 2004"}, {"Title": "This is an awesome camera... until it breaks.", "Author": "L. nuccio \"liquidigloo\"", "ReviewID": "R2CTJS7TGP72WB", "Overall": "1.0", "Content": "I too experienced the dreaded E18 error.  This camera was never dropped and always traveled in a hard case.I was told that I can send the camera to some place in IL for repair, but I need to find the warranty card.I find it incredibly annoying that a consumer products company with the tenure of Canon would refuse to acknowledge an obvious bug in their camera, and force everyone to dig the warranty card out of the junk drawer.  Nothing is more irritating than a company putting the burden of repair on a consumer when the defect is in the engineering.It's not like I dropped the damn thing into a pitcher of beer (oh, memories of my old cellphone - *sniff*) or got thrown into a pool with it in my pocket (farewell, old camera).In any case, I wouldn't buy this camera again due to the sheer number of people experiencing the E18 error.For that matter, I may just avoid Canon entirely in the future.", "Date": "September 20, 2006"}, {"Title": "Fantastic Camera", "Author": "Saurabh Bohra", "ReviewID": "R3E6IA1MVCEM9", "Overall": "5.0", "Content": "I brought this camera for my presonal use and now after using it for a month now I think its worth investment I have made. The photos come out really very good, even when the light is low (ofcourse i had enabled auto flash). Outdoor snaps turned out to be excelllent.The best part is its so handy that it can be carried anywhere anytime.", "Date": "January 5, 2006"}, {"Title": "Awesome Slim Camera, LCD problem easily remedied", "Author": "Topher", "ReviewID": "REQOPXECFBXXY", "Overall": "5.0", "Content": "I was at first hesitant to buy the canon sd200 because of apparent problems with the lcd screen.  Then i heard about the da oly protector from daproducts.com.  It fit perfectly on the camera and keeps the lcd free from scratches or cracks.  If you buy this camera you should definitely consider purchasing the protector.  Without it I wouldn't have peace of mind about putting the slim camera in my pocket for easy storage.  Overall Great Picture quality and extremely long battery life.", "Date": "January 2, 2006"}, {"Title": "Excellent camera for the price", "Author": "Arun Mehta \"aaron59\"", "ReviewID": "R213VS8EWEWOPX", "Overall": "4.0", "Content": "After reading several reviews of different digital cameras on the Web, I chose the SD200 for its price/value point, and I am not disappointed.This camera is definitely worth it.", "Date": "December 10, 2005"}, {"Title": "Great things come in small packages!", "Author": "American Sweetheart", "ReviewID": "R385NYZR3NGVK3", "Overall": "5.0", "Content": "I bought this camera just over a week ago, and am dually impressed. I apologize in advance- it's my first digital camera I've owned or dealt with so I can't compare to any others out there.That said, here's a break down of the pros and cons:Pros: small, pocket size. Lithium battery is fully recharged in 90 minutes. Lasts for a couple hours on full battery charge which I think is a lot. It has a 2 inch LCD display which is great if you don't have the best vision in the world (I don't). It also is fairly simple to figure out how to use - just pick up the camera and after fiddling for 5 minutes, you've pretty much got a thorough understanding on how to work it. It also has a nice zoom feature and comes with great software. Oh, and it's ability to pick up small detail is amazing!Cons: Doesn't come with a camera bag. The camera itself is made out of metal but there is a cheap plastic cover where the usb cable goes and also where the auxillary cables plug into that I am fairly sure if I am not super careful might  break in time. The pictures also have a lot of red eye but it's my understanding that is common with digital cameras so maybe that's not such a big deal.Overall: highly recommend this snazzy little camera! It's great for a beginner such as myself!", "Date": "March 20, 2005"}, {"Title": "Best movie mode available!", "Author": "Richard Carr", "ReviewID": "RIGM34XI0CS2E", "Overall": "5.0", "Content": "I've had the Canon SD-200 for 3 weeks so far and I love it!  Especially the 640x480 movie mode at 30 frames per second.  It's movie mode is the best out there.  The quality is very good, especially in good light.  In good light, it's almost as good as an inexpensive DV camcorder.In the past, I've missed taking so many pictures and movies because one gets tired of dragging along a big digital camera and/or a big camcorder.  But now, since the SD-200 is SO SMALL I am much more likely to have it with me and therefore have pictures and movies I would never have.  I already have some priceless videos.For those who have never seen digital camera's movies, it's just as easy as the pictures.  You connect your camera to the computer and the movies are transfered over just like the pictures are.  Then you double click on the movie thumbnail and watch the movie.  You can't get any easier than that.The nice thing about the canon cameras is their movie mode is AVI (as opposed to MPEG-4 or MPEG) and my movie software, Pinnacle Studio has no trouble importing it, editing it, and then making DVDs with it.The downside to having the best quality movie mode is that the movies are huge.  Around 115 meg a minute.  I got a 1 gig card on sale for $70 yet it holds only 8.5 minutes.  BUT, for me, I'm very glad Canon choose this way because I would MUCH rather have this great quality with it's large file size than the other choice of poorer quality movies.  I'm also discovering a side benefit to having only 8.5 minutes, I'm shooting shorter video segments.  Which means I'm more likely to watch them.The big difference between a camcorder and the vast majority of digital cameras (including the SD-200) is that you can NOT zoom while shooting a movie.  You can zoom before you start the movie, but NOT during shotting the movie.  Again, this is a trade off I can live with, since I'll at least have the movie, as opposed to not having the movie because I didn't take my camcorder because it's too big.Canon told me I only need to get the ordinary SD cards, I don't need the more expensive high speed ones and my normal speed SD memory card is working fine.I got the cheapest SD model, the SD-200, because I believe there will continue to be rapid improvements in the movie mode and therefore will probably get a new one in 2 years.  Also, I THINK the movie quality is the same between all of the SD models.", "Date": "March 19, 2005"}, {"Title": "Don't plan on Canon honoring the warranty", "Author": "Rajuncat", "ReviewID": "R4DJD6FL3YJV2", "Overall": "1.0", "Content": "Loved the camera for about 5 months. Great pictures, wonderful size, would have rated it a 5 star until the flash quit working. Canon is charging $100 for repairs because there was a tiny dent in the flimsy housing so that voids the warranty. I won't buy another Canon but I can understand why those who don't have problems with it would love this camera.", "Date": "June 2, 2005"}, {"Title": "yet aother LCD problem", "Author": "Redmond Frank", "ReviewID": "RAWL7E1Y30VAK", "Overall": "2.0", "Content": "Couldn't resist the free Coach bag promotion and got this for my daughter.  Took 3 pictures on Christmas and two yesterday as it was carefully carried in its Coach bag.Upon next turning on, the LCD is locked with a frozen batwing that is also visible when it is turned off.First Canon CSR gave instructions on sending it back without mentioning the possibility that LCD is not warranteed.  Second CSR said it's a judgement call by the tech as to possible camera abuse and to send a clear note about camera history.It's on its way to repair depot.  I saw previous 1-star LCD comments and hoped to be lucky.  Sigh.", "Date": "December 29, 2005"}, {"Title": "LCD screen broke", "Author": "John C. Leopold \"JL\"", "ReviewID": "R2KHIBDB22N6ZY", "Overall": "2.0", "Content": "We had our SD200 for about 6 months and kept it in a small camera case. Had lots of fun with it. Somehow the LCD screen (see other reports) broke with just minimal pressure to the camera. When turned on the LCD screen is grey with a purple splotch down the middle. It still takes stills and the movie mode works but you can't adjust the settings without the screen. Frustrated, we just sent it in to Canon. If they charge us to fix it will not pay it, just get another camera that won't break like this.", "Date": "July 19, 2005"}, {"Title": "great value and quality", "Author": "E. Lopez", "ReviewID": "RAMPFXVABGSFH", "Overall": "5.0", "Content": "This camera is perfect for anyone who is looking for a user-friendly device.  It gives enough options (speed adjustment, light adjustment, video) for everyday use.  The rechargable battery alone makes it a great buy.  You save tons of money on batteries and the charger is easy to use and quick.", "Date": "November 7, 2005"}, {"Title": "great choice", "Author": "Vivian Rodriguez", "ReviewID": "R181AHLPONWQQK", "Overall": "4.0", "Content": "I love this camera. It's my first digital camera and it's great. The monitor is clear and it's relatively easy to use. It's lightweight and captures great pictures.", "Date": "October 12, 2005"}, {"Title": "My LCD cracked too! And this was a replacement! Total JUNK!", "Author": "Chris B", "ReviewID": "R1MWG2C3O65S2I", "Overall": "1.0", "Content": "I bought this camera before a trip to Hawaii. When I got there, as soon as I went to take my first picture I got the dreaded \"E18\" error. If you don't know what this is, just Google \"Canon E18\" and see all the thousands of hits. Basically the camera lens stops communicating with the body, which makes the camera a paperweight. Luckily I was able to return it and get a replacement while I was out there. Fast forward two months, I turn the camera on one day and the LCD is white with a black blob in the corner, with what look like cracks going across the LCD. The plastic isn't cracked or scratched, this is a problem with the how the LCD was manufactured. Now I am screwed. I have a wedding to go to this weekend with no camera.If there is any kind of a class action lawsuit, count me in.", "Date": "May 4, 2005"}, {"Title": "Another broken screen", "Author": "John", "ReviewID": "R16T9TUPTIQ88J", "Overall": "3.0", "Content": "This review was written only to tell everyone that the screen is very fragile.I am an extremely careful person and have gone to great lengths to protect the camera. Unfortunately just last week, I became another one of the many disappointed customers to find a broken LCD screen on their SD200.Be careful when buying.", "Date": "September 5, 2006"}, {"Title": "Great camera right up until it failed", "Author": "Ms Opera", "ReviewID": "R2Q5FNTHEW9T3U", "Overall": "1.0", "Content": "The LCD display failed after only 6 months.  Up until then it was a great camera, but I am really disgusted with the poor quality that it would fail so soon.", "Date": "April 8, 2006"}, {"Title": "Fragile LCD", "Author": "M. Miller", "ReviewID": "R1U82Y7G70GNME", "Overall": "2.0", "Content": "LCD screen cracked.  I would steer clear of this camera but if you do buy one, make sure you get a really good case.  The problem is that having a decent case makes the camera too big for your pocket.", "Date": "August 10, 2005"}, {"Title": "Canon Powershot Sd200 Digital Elph Camera", "Author": "TennisTom \"TennisTom\"", "ReviewID": "R1Y9ZACPE81HOY", "Overall": "4.0", "Content": "I ordered the used Canon PowerShot SD200 Digital Camera @ $50.  It arrived promptly and was like new as described.  I bought a SDHC (High Capacity) memory card and got a \"memory card error.\"  I then installed a 2GB SD which worked fine.  I bought a generic battery charged which worked well.  I used / tested the camera on two beach trips.  The color reproduction was brilliant and exceeded my expectations.  Autofocus worked well but of course was not up to today's (2012) standards.  Shots using the zoom of tennis players from a distance of 50 feet was disappointing upon medium enlargement (considerably inferior to my ancient Konica Minolta Dimage Z10).  All in all an excellent purchase for the money (total investment $95).  4 stars.", "Date": "October 12, 2012"}, {"Title": "This camera rocks", "Author": "Travis A. Solin \"Travis\"", "ReviewID": "REV73IX37RV9K", "Overall": "5.0", "Content": "I love this camera. It is small, has all of the features I want, and has worked flawlessly. I liked it so much, I got it for my sister as a gift and she loves it as well. Hers has received A LOT more use and the switch that goes between playback/video/camera mode is getting a bit of wear (sometimes, the camera is confused what mode it is in), but that's the only issue -- and she sort of abuses her camera (no case, etc.), so I think that kind of result might be expected. Otherwise, this camera is great. If this camera died today, I'd buy it again but unfortunately I can't because they don't make 3.2mp models anymore :(", "Date": "February 12, 2007"}, {"Title": "LCD Broken", "Author": "John S. Warr \"swarr\"", "ReviewID": "R1GK7ECMEOS301", "Overall": "2.0", "Content": "The camera takes wonderful pictures.  I purchased two for my adult sons in December 2005.  As of right now, both have broken view screens.  This seems to be a major design problem for this camera.", "Date": "November 8, 2006"}, {"Title": "Excellent for daylight, night shots, and macro mode but flash shots cause terrible red eye.", "Author": "Eric Ellen", "ReviewID": "R2Z4H1Q90V1TPA", "Overall": "3.0", "Content": "Since the top reviewers on this product covered the camera fairly well I'll only add some points they didnt mention that I think should be addressed.For almost two years now I have had my photos listed in the Customer Image section above to give people an idea of the quality of the pics.The issues that I have had with the top reviewer are listed in the comment section nder his review.Pros:- Macro feature is pretty good for this type of camera. Snapshots of flowers provide exceptionally well detail.- Vivid feature enables the colors to come out much more richer. This is great for taking some floral pics or especially when taking sunset shots.- Night mode enables you to take some really cool pictures of a variety of things; fireworks, Las Vegas night life. Make sure to have a tripod and modify the shutter speed for some photos.- Manual mode can allow you to control the shutter speed, color (b/w, vivid, sepia) and more.- Video mode really comes in handy when you either left the video camera at home or decided to just use this as your video camera. It has built in sound as well. Different quality and sizes of video are available depending on the space on your SD card and if you plan to email the videos.Cons:- Red eye as a result of the bright flash is terrible. Almost every indoor flash picture comes out with too much red eye. The red eye feature simply doesnt work well enough. This is the main reason why I reduced the rating by two stars. My wife is so annoyed with the red eye results that she wants to get a new camera. So this is something to reall consider.- No battery meter. You wont know that the camera is running low on battery until its about to die. You would have to remember to charge it after a lot of usage or bring a spare charged battery in case.", "Date": "November 7, 2006"}, {"Title": "E18 renders camera useless", "Author": "N. Shields \"Didj dogg\"", "ReviewID": "R3PGY81DOLFGOI", "Overall": "2.0", "Content": "The camera itself works very well, and I would recommend if it weren't for the notorious E18 error (search Google for it) - which occurred at a particularly unfortunate time for me.  Canon charges $250 to fix the problem if it's out of warranty, and denies that there is a design flaw in the camera (which there is - thousands of people are experiencing it).", "Date": "July 25, 2006"}, {"Title": "Great little camera...except for Red Eye", "Author": "R. Sheth", "ReviewID": "R3NMONUT5GYFDT", "Overall": "4.0", "Content": "I love this camera.  I've owned several point and shoot digital cameras, and this is the best of the bunch.  Everything about it is top notch except for it's red eye reduction.  Red eye is almost always present.  It's not that big of a deal for me as I can remove that with software fairly easily, but it's worth mentioning because it is a major problem.  Other than that, this camera out performs every other mini digital camera I've owned.", "Date": "January 20, 2006"}, {"Title": "Easy to use with good results", "Author": "E. Wu", "ReviewID": "R3DSA3TZOVQQLZ", "Overall": "5.0", "Content": "Very small and easy to use snapshot camera.I like the LCD screen and lots of manual functions, too.The automatic controls are a bit off when taking pictures in the dark and also in moving vehicles, but once you switch it to manual, then you can take nice pictures in all conditions.For some reason, it does eat up battery.  I find myself using up a battery with one days picture taking.  Maybe turning it on and off drains power because I didn't even come close to the number of pictures taken for a full battery.  More like half.I brought it on my Peru trip and went backpacking with it.  It was awesome!", "Date": "January 17, 2006"}, {"Title": "Good start-up camera", "Author": "Andy", "ReviewID": "R1TEFMELCVL566", "Overall": "4.0", "Content": "If you are looking for your first digital camera, the SD 200 is the one to go for.I got mine for $175 in November 2005. At that price its a steal.The main advantage is the small form factor, which means you can carry the camera easily in your jeans or shirt pocket rather than buy a special camera pouch or bag.", "Date": "January 15, 2006"}, {"Title": "Great little camera", "Author": "Amazon Customer \"Author of Gypsy Dreamer\"", "ReviewID": "R1D6N426ELUBSQ", "Overall": "5.0", "Content": "I have a Rebel XT but have always been in the need of a decent small camera to carry around because of the ease of doing it. I bought this for my wife and it was the best purchase of Christmas.It is rugged, the pics are high quality, and perfect, especially for a woman's small hands. The card it comes with is small so buy at last a 256mb card and you can take about 200 High qual pics or 1000 standard. The flash is also much brighter than I thought and the quality of the built in video is great as well.", "Date": "December 29, 2005"}, {"Title": "Highly recommended travel camera", "Author": "Sam", "ReviewID": "R3JITMWYBRGO56", "Overall": "4.0", "Content": "I wanted a small digital camera to take travel pictures.  This is a great small camera - the automatic settings are easy to use.  I especially like the one-touch download feature and the automatic settings for night pictures.  A friend liked the pictures from my camera so much he bought one on vacation.", "Date": "December 28, 2005"}, {"Title": "Great macro, color. Tough little camera.", "Author": "Jill C.", "ReviewID": "RQP8NDMIB0E5W", "Overall": "4.0", "Content": "I like this camera so much I bought a second one after my first one got stolen. I have other SLR/pro cameras, but take the most shots on this as it's TINY and with me always. It takes great macro shots and has terrific color. The 'night' setting has been fun too. Am surprised to read about others' problems with the LCD -- my cam is always getting thrown around in bags and pockets and never gets a scratch. The only con would be this camera has a few more red-eye issues than others around this size.", "Date": "May 24, 2005"}, {"Title": "I LOVE my camera", "Author": "Wendy Nelson", "ReviewID": "R2HL2QFXZZPEL4", "Overall": "5.0", "Content": "I just needed a camera that was small, easy to use, and took good pictures.  This camera fit the bill perfectly.  I have had my camera now for 8 months and cannot find anything that I don't like about it.I would recommend this camera to anyone!!", "Date": "August 2, 2005"}, {"Title": "Good camera for amateur use", "Author": "A. Bergant", "ReviewID": "R1PGRYRX7E5SRT", "Overall": "4.0", "Content": "I have 2 kids and wanted a camera that I could carry with me that wouldn't be bulky, eat up batteries and had a fast shutter speed. I have had mine a week and have been playing around with it and am so far pleased with my purchase. The camera is small, easy to use, and the larger LCD screen is really nice. I want to mention that I did not purchase this camera with the intent to print my own pictures, I just upload them to my computer and make CD albums and/or sometimes I e-mail them to friends. I did notice one thing that I am not thrilled about - unless there is a lot of lighting the pics are sometimes blurry. For example: OUTDOOR pics when the sun is out turn out GREAT, no blurs or anything and that is with my kids running, but if it's not really sunny you might need to use the flash. INDOOR pics turn out good if there is a LOT of light otherwise you have to use the flash, I took a piture of my ceiling fan on high and w/out the flash it was a tan blur, with the flash on there was absolutely no blur at all - you could see each individual fan blade prefectly. So the flash makes a big difference! I have been leaving it on auto so the camera will use it when it feels it needs to and that seems to be working. Overall it is a good camera for the average user, and for the money its a good deal!!", "Date": "May 9, 2005"}, {"Title": "It works", "Author": "T.W.", "ReviewID": "R3RJC3GVB00O9H", "Overall": "4.0", "Content": "The camera is okay.  It's not like new, a few things are sketchy, but it works and that's what I needed.", "Date": "November 20, 2013"}, {"Title": "Great little camera!  Takes great pictures!", "Author": "Janet", "ReviewID": "R1GD97FXWWA4GH", "Overall": "5.0", "Content": "This is a really nice little camera.  Compact, but you get a lot for your money.It is easy to use and durable.Anyone without too much experience can use this camera and take great pictures.Not recommended for an advanced camera person.", "Date": "August 17, 2013"}, {"Title": "8 years and still snapping", "Author": "Jane L. Wheeler", "ReviewID": "R12M17OJ3LLZXE", "Overall": "4.0", "Content": "My first digital camera. I purchased it when it was still current back in January of 2005. I've been documenting life with it ever since. What great photos for a tiny camera! Why only 4 stars? The flash is and always has been insufficient for a large area and too much for a close up. I rarely use it. But in natural light or even in bright artificial light, it takes great photos. I love the macro setting and use it often when photographing flowers and food. The slide that switches between photo, movie and view mode has begun to fail (it wants to take movies all the time!) so I am looking at the newer model digital elphs now.", "Date": "February 28, 2013"}, {"Title": "Good deal for the money.", "Author": "stepisin2 \"stepisin2\"", "ReviewID": "R14D33N4WQP7E7", "Overall": "4.0", "Content": "It was a used camera and we purchased it for a nine year old who loves taking pictures of the world around him.  He loves it and it is a perfect first camera for him.", "Date": "January 12, 2013"}, {"Title": "I still use this camera!", "Author": "Terry", "ReviewID": "R1L5SY5VG4NVQY", "Overall": "5.0", "Content": "I have cameras with more pixels, but I still use this camera more often.  Over the years I have had to purchase another battery, but this camera is just so easy and nice to use.  If you can pick up a good used one, or even a new one at a great price, do it!", "Date": "January 11, 2013"}, {"Title": "Can't go wrong with Cannon", "Author": "Steve", "ReviewID": "R631TOF07QUWO", "Overall": "5.0", "Content": "I bought this camera almost 10 years ago.  It's still going strong.  Picture quality is good.  I paid $160 for it back then and will buy it again in a heartbeat.", "Date": "July 15, 2012"}, {"Title": "Durable and lightweight", "Author": "Janet-in-Oregon", "ReviewID": "R3TKSIQC2S4OL2", "Overall": "5.0", "Content": "I bought my SD200 Elph in Summer 2005, took it to Europe for two weeks, and have carried it on every vacation since. It works great, no cracked screen or other issues. Just ordered a backup battery and more memory cards for it. Very happy with 3.2 megapixel quality.", "Date": "December 7, 2011"}, {"Title": "old, but gold.", "Author": "randy castell", "ReviewID": "R19EHZOA8CL1IQ", "Overall": "5.0", "Content": "Great image quality due to a fantastic image processor. Tiny screen, 3.2 MP, but who really cares: the pictures are great quality on a machine or printed to 5x7. No image stabilization, smile finder, or other special features, but a very fine macro setting. It's a great camera to travel with and does fine work. All stainless steel body is very rugged and quite tiny, but heavy. Very satisfying to own and use.", "Date": "April 29, 2011"}, {"Title": "Great camera", "Author": "Howard \"Winker\"", "ReviewID": "R3M2XXDB8NK0IB", "Overall": "5.0", "Content": "Even tho this camera is an older model, the features found on one of these older higher priced models are really good.  A very good buy with almost all of the orginal acessories.", "Date": "December 24, 2010"}, {"Title": "Great Camera", "Author": "Sally Mae", "ReviewID": "R3UIC5PAE715IM", "Overall": "5.0", "Content": "I carried this camera in my purse for three years. Great pictures and easy to keep with me. If my cell phone was not equiped with a camera it would still be in my purse. LOVE it!", "Date": "April 2, 2010"}, {"Title": "It's good for the price", "Author": "Danielle Bloom", "ReviewID": "R281EX8GHW9GWQ", "Overall": "3.0", "Content": "It came with nothing I order a charger and got canon to send me the software so basically i'm happy it works and takes decent pictures.", "Date": "February 17, 2009"}, {"Title": "Good camera", "Author": "Michael Knight", "ReviewID": "R35OS313EJH8IU", "Overall": "5.0", "Content": "I bought it for my sister. She carries it everywhere she goes. Takes good quality pictures. Recommend it.", "Date": "September 12, 2008"}, {"Title": "Great Camera", "Author": "Kristin Williams", "ReviewID": "R104LYSAEMH9N6", "Overall": "5.0", "Content": "I love this camera! It is small enough to carry in your purse! It takes fantastic pictures and is so simple to use. I love the battery it uses! No more charging and buying batteries!", "Date": "November 27, 2007"}, {"Title": "canon SD200", "Author": "W. Cooper", "ReviewID": "R3A1VZMWTYJEZK", "Overall": "4.0", "Content": "this was a great camera for my kids...had one problem with an \"E18\" error so we sent it in for repairs and its been great....", "Date": "June 1, 2007"}, {"Title": "Great bang for the buck", "Author": "C. Long", "ReviewID": "R1E9YGA8Z2WSZN", "Overall": "5.0", "Content": "I wanted a small camera which took good pictures and good video. the size on this camera is great which allows for me to take it anywhere.The picture and color quality are very good, not great, but very good. For the size, I can't complain.The video quality was pretty good at the time I bought it (17 months ago) and the camera has taken a few knocks over the time I have owned it. Be sure to have a large SD card for the videos.For the price and all around qualities, I am really happy with this purchase.", "Date": "May 30, 2007"}, {"Title": "Perfect Little Camera", "Author": "K. Smith", "ReviewID": "R5YKB09VIDQI6", "Overall": "5.0", "Content": "I honestly don't know much about cameras, but I love this one.  This camera has literally been all over the world with me and perfectly captures every moment.  I've had it for about 2 1/2 years and it hasn't failed me yet.  The pictures are phenomenal and unbelievably clear.  The video sound is a little soft though.  Unfortunately I've broken the screen twice.  The first time Canon fixed it for free.  I'm just ready for an upgrade and am awaiting the arival of my SD800.", "Date": "May 4, 2007"}, {"Title": "It Realllly Rocks!", "Author": "TiagoBR", "ReviewID": "R397WJSSMCM1BH", "Overall": "5.0", "Content": "I'm just gonna say that , \"that is the camera\"!!!I have never seen anything near like it.I had a Sony before and was a total garbage, most of the pictures were fuzzy ! I tought it was my camera that was defective, after seen some friend's sony cameras and after reading a lot of reviews, \" I \" (myself) think sony's cameras are really garbage, even the 2007 new ones.( just search for reveiews). And will never buy a sony again.With this canon over 100 to 200 pictures I take during some parties, I get 1 or 2 fuzzy, while with the sony it was usually 80%. I caouldnt believe.I have droped this camera thousand times on the floor AAAAAANNNNDDDD the most impossible I was pushed into a swimming pool with this camera in my pocket, and after opeing and drying it, still works perfect after more than one year. it's like a rock!I have token more than 12000 pics during last 2 years, and I have just one thing to say... \"I 'm glad having bought this Canon! \"I just love it! Now I am searching for a new camera to my sister, and, it will be a Canon! Don';t know witch one yet, but I already know the brand!!!Hope everyone have a great experience with their cameras like I had!", "Date": "April 12, 2007"}, {"Title": "Very happy with this camera", "Author": "eddyreddy", "ReviewID": "RB2BOHIJBI2IS", "Overall": "5.0", "Content": "Yes it is a great camera. I use it mostly to sell on line with, from little rings to furniture and the photos are great. On the plus side, this was a great camera to take on vaction. My daughter took over 300 photos one day at the lake. I did buy a bigger memory card which seems to never get full when the daughter takes it out for the day. The size is great, fits in most pockets esp. jeans. I love the fact that when with family at big gatherings, my camera lasts out the others as far as keeping power. I use it daily and only have to charge it about once a week, depending on how often I use it. Downloading photos to computer is very simple. If you want an easy pick and shoot camera with out having to think, this is it. I would love to get a second or third one for my daughter and boyfriend so they quit grabbing mine...", "Date": "March 30, 2007"}, {"Title": "Great product por a nice price", "Author": "Eduardo Wallach", "ReviewID": "R2Y7EBVDXLYD4B", "Overall": "5.0", "Content": "This product is great. I've compared it with much expensiver cameras, and the desing, material and pictures are really good, besides the price is very afordable.I trully recomend it.", "Date": "January 9, 2007"}, {"Title": "Great point and shoot camera", "Author": "T. Neal", "ReviewID": "R1NCMPAP3QR0DV", "Overall": "5.0", "Content": "I've had several small digital cameras in the past, but none compare to the Canon Powershot series in picture quality. This camera is perfect to carry in your pocket all the time.", "Date": "August 3, 2006"}, {"Title": "Great camera, but LCD screen is fragile", "Author": "junior 5", "ReviewID": "R2PRAM114O7RX4", "Overall": "3.0", "Content": "I had previous experience with canon digital cameras and after my old powershot S50's screen cracked, I thought, no big deal just buy another canon. Anyway, bought this camera (actually bought 2 - the other one I gave as a gift to my sister)and over past 6 months use here are my impressions:Pros:>great portable shooter for first timers>intuitive controls, including easy video function>great basic camera for getting 4x6 picsCons:>LCD screen again cracked without explanationThe screen cracking again on this camera together with what happened to my SD50 leads me to believe that the LCD's on Canons are very fragile and you probably have to buy a hard case to enclose this camera to protect from possible damage. Given that cracked lcd's on digitals render them almost useless, a future improvement from Canon should include reinforcement of these screens or possibly use a sliding cover to protect them when not in use.", "Date": "July 24, 2006"}, {"Title": "great compact camera", "Author": "Balu", "ReviewID": "RH7BVFR44OZRI", "Overall": "5.0", "Content": "it is a great camera for1. it's size2. performace3. priceIt takes crisp pictures. I took lots of shots so far both in out door as well as indoor, it never disappointed me. Camera size never compromised with quality of pictures. Pictures always turned great. Thanks to canon Digic processor. This camera is very compact, in fact all this series of cameras, you can carry anywhere just like a cell phone. It fits in your shirt pocket as well. It comes with rechargeble battery, so saved little money for batteries. If one does not want long zooms, this would be the best buy.", "Date": "July 14, 2006"}, {"Title": "Good camera - lots of \"issues\"", "Author": "Christopher W. Allen \"lightning bolt\"", "ReviewID": "R1VL1DENR0SM02", "Overall": "3.0", "Content": "I bought this camera for my girlfriend, and she's had it for about 4 months now. We had an issue with the actual button you press to take a picture falling off. We sent it back to Cannon and they repaired it for free under warantee. Since then the camera has been fine, until....a couple of days ago. Now the lens will not extend and makes a grinding sound when turned on. Needless to say the camera will be going back and hopefully repaired under warantee but this is just plain getting annoying. When the camera works its PERFECT - but all these little issues are really starting to make me wish I bought one of the higher end SD's like the 450.", "Date": "June 15, 2006"}, {"Title": "Excellent Value for Money", "Author": "Destination Infinity", "ReviewID": "RUZHSM8EYWN9W", "Overall": "5.0", "Content": "I have owned SD200 for six months now and I am very happy with it. It is great value for money. It has all the features I wanted - small size, cheap, low pixelage (yes low pixelage!). The camera is very sleek and fits into any pocket (even a tight jeans pocket). That's a major plus point about it. It is 3.2 MP which is all I needed as I never take prints larger than postcard size. High MP cameras are recommended only if you plan to print large posters, if you are not going to do that, don't waste your money on 6+ MP cameras. It's photo quality is excellent for its price. Soon I am going to buy a digital SLR but that's not because I am not happy with this one. I am 100% satisfied with this camera. Small point and shoot cameras and bulky DSLRs have their own utilities and one can't be subsituted for the other.One thing I like is that I can switch of the LCD screen and take photos using viewfinder, that saves a lot of battery! You can take a lot more photos with LCD switched off. Don't go for a camera that doesn't have a viewfinder or doesn't allow you to switch off LCD. Battery life is average, but when on trips I generally switch off LCD while taking dayshots. Then battery can last for the whole 3-4 day trip with 400+ photos without recharging the battery.Pros --Very sleek-Excellent picture quality for it's price-Very low flash charging time-Unlimited video shooting at decent resolution-CheapCons--Does not have bulb setting so you can't keep the shutter open for unlimited time for night shots.-Doesn't use AA or AAA batteries (but that's not a biggie as long as you remember to charge it before heading on to your trip and take the charger with you).", "Date": "June 4, 2006"}, {"Title": "Great Simple Camera", "Author": "RGPaudio", "ReviewID": "R2IJ4TS04TTQFD", "Overall": "5.0", "Content": "The Canon SD200 goes everywhere in my wife's purse.It takes great pictures, indoors and out.  The only setting my wife messes with is flash.  This camera is perfect for her.The viewfinder is a plus as it enables her to steady the camera by holder her camera hand against her face.  Using the viewfinder, rather than the LCD, extends battery life.This camera is great for short videos of our granddaughter.  With a little care, it is suitable for natural-light photos.  It focuses in low light.  Shutter response is good.  Digital \"Noise\" is a bit better than what one should expect.This is our 4th digital camera, and our favorite for casual use.  It just works.", "Date": "May 31, 2006"}, {"Title": "My go everywhere camera", "Author": "D. Mahoney", "ReviewID": "R1AIWBDKFN7ASF", "Overall": "5.0", "Content": "One of my best gifts for myself last Christmas!A perfectly sized camera that goes everywhere, captures great images, and is priced well enough that you will take into all situations.Only downside is the tradeoff of size versus handling.  The smaller camera does require more dexterity to hold...a small price to pay to take anywhere.View screen has not been a issue, as others have noted.  I have dropped once while in Canon case.  No adverse impact.", "Date": "May 27, 2006"}, {"Title": "I COULD NOT BE HAPPIER!!!", "Author": "S. Bendo \"Non-fiction fan\"", "ReviewID": "RXPKO6NUECO13", "Overall": "5.0", "Content": "I hate to sound glowing and non-objective in a review, but I absolutely love this camera. I was hesitant to buy a Canon after my last Elph showed poor battery life and mediocre picture quality. Nonetheless, it was good ENOUGH to keep me in the family. This camera, however, is everything I could ever want in a camera. It is gorgeous, tiny, tough (I've dropped it a couple times accidentally), was easy to set up, and has all the features I could imagine wanting. I am a student, and I take pictures of charts and graphs in text books that look amazingly sharp (make sure to push the \"close-up\" button, it makes all the difference). The manual features are great for getting just the right look anywhere (another tip: I highly suggest taking many photos with the ISO set to 400 without a flash). The Photostitch software is really fun to play with if you enjoy photography at all (lets you piece pictures together to make a panarama). I can't comment on the main software program, because I plug my memory card straight into my computer without the camera, and I use Picassa software from Google (free, good program).This camera is one of the best purchases I've ever made. I can't imagine needing another camera for a long, long time.", "Date": "May 23, 2006"}, {"Title": "Love It", "Author": "Warren Besore \"Recent college graduate\"", "ReviewID": "R1VP9KH5GZSZBV", "Overall": "5.0", "Content": "This was the first digital camera I ever owned- my dad bought it for my 21st birthday last year.This camera was perfect for me, someone who just wanted a camera to take pictures of my friends and events in college. Unfortunately, the camera was dropped and the screen was cracked. The camera, however, continued to operate although I couldn't change any features. I used it right up until it got stolen recently.Nevertheless, I love this camera and I am definitely planning on buying another one as soon as funds provide. But for those who just want a camera to take decent pictures and who want features that are easy to use and understand, this is the one to get!", "Date": "May 21, 2006"}, {"Title": "Great camera and Great Canon Service", "Author": "Tcubed \"1geek\"", "ReviewID": "R13J6U12OWWGY6", "Overall": "5.0", "Content": "I've had the camera for 11 months taken hundreds of wonderful pictures. Then one day the camera was in my daughters purse and the LCD suddently appeard broken (no physical sign of abuse) but it had turned white with purple feathering on the screen (internal damage of some sort).  I read about others having difficulties with service of LCD's from Canon so I thought I share mine recent experience.First I want to say that Canon was EXCELLENT about handling the return/repair. I called their service center and they told me where to send it, never was a cost mentioned. Sent camera w/store receipt and warranty card; 7 days later had letter from Canon stating camera had been received and their diagnosis was a cracked LCD (caused by pressure). The very next day I had camera delivered at my door by Fed-Ex, only 8 days after I'd sent it to them. I could not be happier with their service. Maybe they've heard and recognize a screen problem and that are now dealing with it in the professional manner the should have originally.In any case, have my wonderful little camera back, good as new.  Happy with Canon and their service/support.  Now wanting the sweet SD550.", "Date": "January 23, 2006"}, {"Title": "the coolest camera ever", "Author": null, "ReviewID": "R14SMOAQT11747", "Overall": "5.0", "Content": "my mom has a s400 elph. she convinced me to get this at about 200 with a memory card. i jus got it today. i have been playing with da features like slo motion video. its quite fun to take pics. there are alot of options to use. its also so light compared to a s400, it is also very small with a nice bright screen for viewing crisp pics. a must have if u want something cheap. i reccomend a lexar memory card.", "Date": "December 17, 2005"}, {"Title": "User friendly", "Author": "Ariella Vaccarino- creator of \"Voice Lessons ...", "ReviewID": "R13U5MTXZZXU7Y", "Overall": "5.0", "Content": "This camera is great and really easy to use and understand.  The amount of pictures you can take is awesome and the quality is excellent.  And its great because you can snap an image as much as you want and then erase what doesn't work to find that special picture.  All my friends have the elf as well.", "Date": "November 9, 2005"}, {"Title": "Good quality pictures in a pocket sized camera", "Author": "Diego", "ReviewID": "R10Y0GYPUZ6SVS", "Overall": "4.0", "Content": "For a ultra-compact camera the SD200 takes very clear pictures, and is targeted for low end users who take mostly point-and-shoot images to be printed in 4x6 or 5x7.While in Auto-mode, the camera will take care of everything, evaluating light, contrast and focus in 9 zones. It will decide the best possible settings and take the picture.It is a fast camera. It turns on and is ready to take pictures in only 1.4 seconds and takes about 0.5 seconds to focus and shoot. It can also take 2.8 pictures per second if you use the correct SD memory (Sandisk Ultra II will do).Talking about speed, this little camera can shoot 60fps video. So, when you reproduce it at 30fps you can see a smooth low-motion video (limited to 1 minute). If you shoot video at 30 fps (normal rate) the camera will record until the memory is full, which is about 10 minutes of video with a 1GB memory in 640x480 and 20 minutes in 320x200. Not many cameras can do any of that. The negative point is that you cannot change the zoom while recording video.Even when the flash is powerful for a ultra-compact camera, it will generate dark corners for shoots at 2 or 3 meters.Due to its high density lenses the camera will generate little blur in the corners as well, but you can hardly see that at first view. You need to zoom in the image with the computer to see the effect, so it's not big deal.The camera also has a manual mode, that allows you to change several settings, like ISO speed, white balance, exposure and a few picture effects. It allows you to change the shooter speed to large values (from 1 second up to 15 seconds) great for night shots with tripod; however, it will not allow you to change the shooter for high speed values (too bad). Most you can do is to use the \"pets and kids\" mode to go up to 1/1500 for fast action shoots, but you cannot adjust it in other modes.Tha camera also has a \"digital macro\" mode. Which is basically the \"macro focus\" that you could use in Auto-mode but it turns on the digital zoom as well (even if it is disabled). I don't think I'll ever use this mode since I hate digital zooms, they just make the pictures look bad.The low-battery indicator only appears when you are really out of battery. Perhaps 10 shoots before it dies. There is no way to know if you have, let's say, 50% of battery power.It has some hard to reach features like Focus-Lock, Exposure-Lock and Flash-Lock that need two button combination to enable them, but I guess not that many people uses them anyway.The stitch-assist mode will help you to take panoramic views. It will set a reference with the end of the previous picture so you can know where was your last shot. Once you download the pictures to the computer, the camera's software will take care of the combination.And finally, the battery and memory cover is made of plastic. It looks cheap to me and seems that you need to be careful with it, otherwise you'll break it.So, as I said at the beginning, this is a camera for the casual point-and-shoot user who does not need (or want) manual settings. Pictures are clear and sharp. It weights little and it very easy to carry on, specially if you buy it with the PSC-90 leather case that fits like a glove.", "Date": "June 28, 2005"}, {"Title": "LCD Broken", "Author": "L. Chambers", "ReviewID": "R1VLLCBU3KG941", "Overall": "1.0", "Content": "Had the camera for 2 weeks and the LCD is already broken....Great job Canon!", "Date": "January 18, 2006"}, {"Title": "Small, attractive, and efficient", "Author": "Miles", "ReviewID": "RIMK23MXRD5CL", "Overall": "5.0", "Content": "Bought this from another retailer in another color.  It's biggest obvious drawback is the lack of digital zoom.  Other than that, for an amateur, the pictures can be taken at very high quality.  I replaced the 32 mb SD card with a 256 mb card and have an amazing amount of picture storage inherent in the camera.  The battery charger is also nearly as compact as the camera itself.  The cameria comes with a neat carrying case that can protect it as it jostles about in your purse.It's features are very easy to use, and it is quick to turn on and off.  It's size makes it a little difficult for those of us with shakey hands, so you need to pay attention to how you are holding it in order to keep your pictures from being blurred.  However, the size can be advantage as pulling it out, turning the flash off, and taking a few quick pictures without being noticed.  Had a few problems with others unfamiliar with it trying to quickly push the picture button rather than press and hold it and therefore some pictures did not got taken, but it is very nice as a small, compact, and fairly high quality camera even for those amateurs exploring the world of more serious photography.", "Date": "August 15, 2005"}, {"Title": "great for travel...", "Author": "Jennifer M. Zanni", "ReviewID": "RUQZBPRWX1LV0", "Overall": "4.0", "Content": "I have been using this camera for over a year now and have taken it with me on many travels to other countries.  I have been very happy with the picture quality and really like this camera.  The battery life is excellent and this is an easy camera to travel with (I had no problems with international adaptors, etc).  There is some difficulty shooting in bright light settings and the red eye function doesn't work well (although easily correctable with the software).  I would definitely recommend this as I great point and shoot camera.", "Date": "January 25, 2006"}, {"Title": "great little camera", "Author": "hawaiiboy", "ReviewID": "RM6JSGHFQ7RVH", "Overall": "5.0", "Content": "this is the best value out there.  the canon sd200 takes great pictures, and for 169 dollars it was the best snapshot camera ive purchased yet!  lightweight, compact, and rechargeable (very important).", "Date": "January 3, 2006"}, {"Title": "Even ONE star is too much for this camera...", "Author": "Pamela J. Statz", "ReviewID": "R3DEQ54KLTHW73", "Overall": "1.0", "Content": "I've had my SD200 for about three months. Yesterday during a site-seeing trip the LCD cracked leaving a white screen with a purple blob. Horrified, I looked online to see if this was a common problem and found HUNDREDS of reports of broken LCDs. I can't believe Canon is not taking responsibility for their poorly constructed product and doesn't order a recall or at least cover the LCD under warranty. The camera works fine otherwise, but is essentially useless without the menu.", "Date": "May 3, 2005"}, {"Title": "small, good pictures, good menu", "Author": "M. Reuter", "ReviewID": "R3AAGUJUALSQYF", "Overall": "4.0", "Content": "i like this camera really much. it is so tiny and light. but the pictures are really good. i take it always with me.the could be more options. but the things it has are awesome.i woluld buy it again.", "Date": "October 4, 2005"}, {"Title": "wonderful!", "Author": "Lambent \"hoppyba\"", "ReviewID": "R32XH9GYM4M4EH", "Overall": "5.0", "Content": "I love this camera.  It is tiny, fantastic, takes great photos, movies with sound, etc.  I am very satisfied with this elph.", "Date": "February 6, 2005"}, {"Title": "Ol Camera", "Author": "William C. Ayer", "ReviewID": "R279B89BA2EXI5", "Overall": "3.0", "Content": "Was a great camera for a few yrs. It ultimatly turned on in a bag and since the lense comes out its gears that operate the lense focus got messed up. It took great pics when it worked. I will by another canon powershot soon. 3.2 megapixels was barely enough for photos. Plenty for web only but not for print. I dont think you can even buy any new cameras with much under 5 megapixels now anyway. Bottom line Canon makes great cameras buy one you wont be disappointed.", "Date": "September 23, 2008"}, {"Title": "Canon sd200", "Author": "Nichols R. Scalzi", "ReviewID": "R2V54PG1PCA1CV", "Overall": "1.0", "Content": "Flash stopped working less than a month after buying, camera was sent to be  repaired and fixed. A couple of months later the zoom stopped working again had to pay shipping to get repaired. Now a little over a year camera will not power on at all and is out of warr. My niece has same camera and the shutter button came off and was lost, Canon wants over a hundred dollars to replace it (10 cent part) her camera is now useless also and was used for less than a year.", "Date": "April 2, 2007"}, {"Title": "Red Eye and Now an \"E 18\" Error", "Author": "Mark in VT", "ReviewID": "RLDPK82DMX3P1", "Overall": "1.0", "Content": "I own a digital Elph, which I purchased from Amazon 5 years ago. It has worked well and I was happy with it. My satisfaction with my older Elph prompted me to upgrade to the newer Canon Powershot SD200 Digital Elph in December of 2005. I figured that Canon would have made modest improvements over time. I do like the size and weight of the unit.Unfortunately, that's not the case. Using the flash, the red eye is worse with this version, even with red eye reduction on. Sure you can slightly clean up the red eye image using software; however, that's a major hassle and most photos will leave the eye looking black.The second issue is after owning this camera for 13 months, an E 18 error appeared on the digital screen. The screen remains black and the camera will not work. I thought I'd try a new battery but that did nothing.I do not recommend this camera. Keep searching. I now see that other owners have had the E 18 problem. I'll research my options as this PowerShot SD200 Digital Elph is now out of warranty.", "Date": "March 13, 2007"}, {"Title": "Canon Powershot", "Author": "Annette L. Palo \"Makayla's Mom\"", "ReviewID": "R1BI6DQTIHEOT", "Overall": "5.0", "Content": "Great camera, takes wonderful shots of your memories without requiring a great detail of experience.", "Date": "January 11, 2007"}, {"Title": "Hmm. . . my LCD cracked as well", "Author": "Dragos", "ReviewID": "R3KT4AG2EX4RWZ", "Overall": "4.0", "Content": "Love this little camera but the LCD cracked after less then 6 months of use as well.  I thought one of my friends dropped it but it looks like a pretty common occurence.  Maybe I'll get it serviced.Either way, the quality of the pics is excellent and honestly, who needs 8 Megapixels anyway.", "Date": "April 17, 2006"}, {"Title": "Great camera for the money", "Author": "T. Rynard", "ReviewID": "R1PWKLFDNLS805", "Overall": "5.0", "Content": "I am really enjoying the camera.  It's easy to use and I like that it is small but has a large viewing screen.  Great camera for the price.", "Date": "February 21, 2006"}, {"Title": "Great camera, great price", "Author": "M. Rashkin", "ReviewID": "R2YMTZ2FU1STV0", "Overall": "4.0", "Content": "Excellent camera from the price.  Highly recommended for a bargain priced camera, but it has all the features of its more expensive brethen.", "Date": "January 16, 2006"}, {"Title": "Canon Elph SD200", "Author": "Robert Wint", "ReviewID": "R2A8OE7RGWF6LU", "Overall": "5.0", "Content": "Takes clear photos even in low light situations. I like the compact size. Works great for my use.", "Date": "January 15, 2006"}, {"Title": "excellent little guy", "Author": "G. Fan \"blue-apple\"", "ReviewID": "R3JD27SHZYC293", "Overall": "5.0", "Content": "I bought this compact guy about 3 months back. the photo is sharp and the resolution ability is powerful. the only con is that this is not so cool as the sample picture.", "Date": "January 14, 2006"}, {"Title": "Good camera - But Breaks Easily", "Author": "Tian Wang", "ReviewID": "R19P1ZF1S86PZX", "Overall": "3.0", "Content": "I have bought this camera for my girlfriend. I am very satisfied with its function and slick design, the picture quality is good, the menu are also easy to operate........There is only one problem: it BREAKS EASILY. I fell it on the ground carelessly (only from 1 foot high) and I got a dent near the arrow button area. All arrow buttons screwed up after that: RIGHT key lost its fuction sometimes, DOWN becomes LEFT, while LEFT becomes DOWN sometimes (totally unpredictable), DELETE key also become irresponsive, although it's far from the dent. I admit I am a dropper, but I have never seen an electronic device screwed up so easily....Now I can only use it in a weird way, no picture review, no deletion, other functions related to LEFT, DOWN, RIGHT are also hard to use or totally lost....", "Date": "July 9, 2005"}, {"Title": "Canon Camera", "Author": "Taylor V. Boswell", "ReviewID": "R18Y21JN7T361D", "Overall": "5.0", "Content": "My daughter absolutely loves this camera.  It is much smaller than my wifes canon we bought a few years ago.  (She likes the new one better).  It is intuitive and takes great pics!", "Date": "October 2, 2005"}, {"Title": "great camera", "Author": "E. delao", "ReviewID": "RZ9T01HS56LOV", "Overall": "4.0", "Content": "Great camera for a 3 pixel and the price.  Very easy to those not tech friendly.", "Date": "September 20, 2005"}, {"Title": "Great warranty service after sale", "Author": "K. Branchal \"USNA '08 mom\"", "ReviewID": "RYBG2B6CX4N8L", "Overall": "5.0", "Content": "This camera was purchased as a gift for my son last November.  He had an error message that displayed when the camera lens would not close.  I provided him with the purchase information and warranty card (which he left at home when he headed back to college)and he contacted Canon for service.  By the time I spoke to him again, he had already shipped off the camera for service and received it back in 'good as new' condition.  Total cost to him was less than $7 shipping.I'm thinking that I might need to purchase the 2 year service plan Amazon offers with these.  :-)", "Date": "April 18, 2006"}, {"Title": "A great little camera", "Author": "chicoer2003 \"chicoer2003\"", "ReviewID": "R3KXBU82KCDI9M", "Overall": "5.0", "Content": "Canon has made a handy camera. It's small, compact and most of all, it's easy to use. Another good thing is the view screen. It's big compared to other camera. It's easy to upload the pictures and it's easy to shoot. A great camera for the casual photo taker.", "Date": "January 9, 2005"}, {"Title": "Fragile LCD", "Author": "B. Scott", "ReviewID": "R2HFUNQQK0YNDK", "Overall": "1.0", "Content": "I just want to add my voice to the chorus of complaints about this camera.  My daughter turned the camera on after owning it for two months and the LCD was broken.  Canon refuses to cover this under the warranty.  I wouldn't buy another Canon product after this episode.", "Date": "December 4, 2005"}, {"Title": "good littel camera", "Author": "John Ereno", "ReviewID": "RRY0P96UTJVKO", "Overall": "4.0", "Content": "I purchased this Camera for work. I use it to document damage or lack of damage to rental equipment. For my application this unit performs great. I have several people that use this camera and have not had any of them asking how to use it.", "Date": "September 15, 2005"}, {"Title": "Well made great options", "Author": "S. swanson \"Keyhonay\"", "ReviewID": "R1P36PVSHV16RZ", "Overall": "5.0", "Content": "This little camera has every thing you need, from the high quality pictures to great video ability.", "Date": "August 18, 2005"}, {"Title": "Best little digital camera on the market", "Author": "T. Brothers", "ReviewID": "R32FAVMF2YZZA3", "Overall": "5.0", "Content": "This camera takes nice pictures and has a lot of features.  For the price its much better than the Sony.  The 2inch display in the back looks awesome and is very useful for adjusting the light meter and some of the more subtle imaging options.", "Date": "January 3, 2005"}, {"Title": "great camera! fits in an ALTOIDS TIN?", "Author": "Lee-Roy", "ReviewID": "R2LRS7E1K39XTK", "Overall": "5.0", "Content": "I'm loving this camera. Some great reviews listed here. Though, someone said you could fit it inside of an Altoids tin. I have tried, but it just won't fit. Even after some modifications to the tin with some needle-nose plyers. I could possibly force it in, but not sure if I'd ever get it out and would most probably scratch the thing up in the process. So, no go. This is kind of a bummer because it really looks like it should fit, and would be really great if it did. Durable, incognito, cheap. A great and easy case for your SD200. If somebody knows how to get this to work, please share.", "Date": "January 9, 2005"}, {"Title": "Memory Card Error - Card locked", "Author": "Juniper", "ReviewID": "R2PS643JVMYZVM", "Overall": "1.0", "Content": "I just got my SD200 camera 2 days ago.  Took pictures, viewed them, and then the battery died.  When the battery recharged and I tried to view the pictures again the next day, when I turned the camera on, it said \"Memory card error\" and it occassionally said \"Memory card error Card locked\".  I first thought there was something wrong with my memory card, but then I looked it up online and all these Amazon reviews came up that it's their Canon, not the memory card.  Fortunately, the pictures I took were still on the memory card when I brought them to a photo store and they were able to burn them onto a cd for me.  I'm really not sure what to do now...", "Date": "November 22, 2004"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00064O1P0"}}