{"Reviews": [{"Title": "Great camera once you get rechargable batteries", "Author": "Momo", "ReviewID": "R3V7CYEHIVNR1U", "Overall": "5.0", "Content": "The camera takes very clear photos.  It is very simple to use and takes no time to learn.  However, the battery life with alkaline batteries is the worst I've ever seen, only about 15 - 20 photos when you use the flash.  However, once I changed to Sony 2500 MaH rechargable NiMH batteries, I can take over 80 photos!  Make sure to spend the extra money and purchase the 2500 MaH batteries and charger.  It charges in 15 minutes as opposed to hours.", "Date": "December 21, 2005"}, {"Title": "Watch out for the red eye!", "Author": "Mully4235 \"April\"", "ReviewID": "R2ZDUEETMRUMYG", "Overall": "2.0", "Content": "This is an ok camera, definetly a good deal money wise.  The only problem I have with it is that the red eye in the pictures is HORRIBLE.  It cannot be removed on half of the pictures.  It does have a red eye reduction built into the camera, but I find that it takes to long to take the picture that way, and the multiple flashes for it is confusing, most people turn away thinking the picture is over before it actually is.  I find it easier to just take the picture normally and fix the red eye on the computer.  However, on more that half of the pictures I have taken with this camera, I cannot fix the red eye.  The eyes either stay red, turn yellow/green, or turn a weird mixture of grey and who knows what else.  It is the same no matter which program I try and I have tried about 6 or 7 different ones.  I have never had this problem with any other digital camera.Watch out for the red eye with this camera!  If it doesn't bother you than buy this camera.", "Date": "January 1, 2006"}, {"Title": "Love It!", "Author": "Lynn", "ReviewID": "RFCX38TDE32Q9", "Overall": "5.0", "Content": "I got this camera as a gift and I love it. It cost under $100 and is by-far worth it. As stated by a previous rewiew, the image does move around a lot when trying to focus, however every single pic i have taken has been crystal clear...even if the image on the screen was not at the time i took the pic. I am going to have to invest in some rechargable batteries, becuase it eats through them, but that is the only drawback i have foud yet. Deffinately reccomend. I also picked up a 256mb memory card, and reccomend that as well, i can get nearly 300 pics on it. Love it!", "Date": "December 27, 2005"}, {"Title": "Decent for the price", "Author": "mr_vodka \"quadmajor\"", "ReviewID": "R5GUCMZD0BJJ9", "Overall": "4.0", "Content": "This camera is a great one for the price. The only drawback is that it uses AA batteries rather than a LI one. But that problem can be solved with getting rechargable high end batteries.The interface is extremely user friendly. My mother who knows nothing about electronics can work it. Very easy to scroll through pictures and delete unwanted ones.Definately worth the $98.00 I paid for it.", "Date": "December 20, 2005"}, {"Title": "A must have.", "Author": "Bret Taylor \"bret@cableone.net\"", "ReviewID": "R1AWLUEYOFDYGH", "Overall": "5.0", "Content": "My wife has had a digital camera for years now, will never go back to the old film type.  We wanted to get one for my Mom and saw this one.  We thought for the price it should be fine.  I have to say we were greatly impressed.  Simple to use, durable and packed with features.  I know sometimes we are tempted to go with off-brands to save a little but with this you not only get a great camera at a great price you also get the HP name.  You cannot go wrong with this one.", "Date": "November 26, 2005"}, {"Title": "Not working after a short time use", "Author": "K. Cooper \"ktcooper\"", "ReviewID": "RXT0T5RMGPR1O", "Overall": "1.0", "Content": "We bought 3 of these cameras for christmas presents at the Walmart after Thanksgiving sale and thought they would be great gifts. 2 of the 3 are completely dead, they will not even turn on when you add brand new batteries. The third one will turn on with brand new batteries but the battery idicator slowly runs down to nothing and then the camera shuts off. It doesn't matter what type of batteries we put in the camera. DO NOT BUY!!! You will be very disappointed. We thought they were great when they worked asside from the red eye issue which could be photoshopped out. Now they are unusable. The 30 day warrenty is over for walmart so we are hunting for new cameras.", "Date": "March 14, 2006"}, {"Title": "Good but a pain", "Author": "S. Johnson", "ReviewID": "R2GB7NOK7N9EY9", "Overall": "3.0", "Content": "I got this camera as a gift for Christmas last year and I was happy that i got it. the only thing that i have to complain about about this camera is the fact that it eats the battery up like there is no tomorrow. i can't tell you how many batteries i went through so that I can use the camera. and also the flash takes a long time to charge up and that really mad the people i was trying to take a picture of very irritated. Though it has its flaws, the camera is overall a good camera. it takes very good pictures and they are as clear as day. But I just feel this isn't the camera for me and that's why I'm about to buy another one.", "Date": "May 24, 2008"}, {"Title": "this camera is a pain", "Author": "Kirachan", "ReviewID": "R3AHKZ68EEEPS5", "Overall": "2.0", "Content": "My mother gave me this camera on a trip we took out of the country, this camera ate through batteries like nobodies business, also half my pictures would come out very grainy looking.  then, if you don't use a case for this camera and just slip it in your purse the cover on the front will slide open in your bag and start eating batteries.  and finally without me touching any of the settings the camera would decide to have a very long exposure time making it nearly impossible not to take blurry photos. in short save yourself a lot of trouble and find another camera.", "Date": "March 29, 2009"}, {"Title": "Decent pics, good price", "Author": "J. Stehno", "ReviewID": "R2CM9Y072E994Y", "Overall": "3.0", "Content": "I've had this HP Photosmart E317 for almost two years. Use it for taking still pictures of items I auction online. For this and for distance shots, it's alright. For close-ups, not so great...just can't get the nitty-gritty details. Like others have said, alkaline battery life is lousy though double when you're not using the flash. Display is clear; it's easy to use; settings are adequate; downloading easy; price was right. Don't expect professional grade pics from this. As a backup or for a camera you won't have to worry about, this will work.", "Date": "September 13, 2008"}, {"Title": "don't waste your money", "Author": "Angela", "ReviewID": "R1ZVS24183GLEB", "Overall": "1.0", "Content": "Within a month of using this camera it went completely dead as previous posters have said.  No matter what kind of battery you use, it just shuts off.  I was still in warranty when this happened so HP sent me a replacement and a few months later the same thing happens.  It really didn't last long at all and I was disappointed with the quality of the photos.  Don't waste your time on this one.", "Date": "November 1, 2006"}, {"Title": "Dissapointed", "Author": "M. Joseph", "ReviewID": "R3ODVDF26HYUIJ", "Overall": "1.0", "Content": "Ok, I bought this for $103 for Christmas at the end of 2005. The second day I experienced problems, like it shutting off by itself. It also ate up all the batteries. Then I got rechargeable batteries, but those were \"killed\" by the camera within a few months. The camera's pictures can be good, ok, or HORRIBLE. The pictures are easily shaken and the video \"sucks.\" You can't see a thing in a video unless you literally have a flashlight shining light behind you. It is also quite fat and may even loose pictures from the memory on its own. In October 2006 I also experienced a new problem: When taking pictures outdoors the pictures come out completely white. Now it is December 25, 2006, exactly one year after I opened the package, and the LCD screen turns black by itself after some while. The picture quality is horrible and so is everything else. You could say that it \"literally\" lasted me a year, but it lost all the pleasures (if there were any to begin with) within the first two months, or so. Please don't waste your money...this completely ruins my opinion on HP...get a nice Kodak or Nikon or anything else than the HPE317.", "Date": "December 25, 2006"}, {"Title": "Great for novice", "Author": "E. Smith", "ReviewID": "RKFJQEZF6IWPV", "Overall": "5.0", "Content": "I needed a small,simple and inexpensive digital immediately!With just a skim over the manual, I was able to take wonderful pictures of my friend's wedding. The point and shoot feature was great and just what I needed! ES", "Date": "July 25, 2006"}, {"Title": "HP Photosmart E317 - stunningly easy to use", "Author": "Linda", "ReviewID": "R22YEMUUJHJ2ZI", "Overall": "5.0", "Content": "I am a novice in photography, but needed this for a work project. It has been extremely easy to use and the photo quality is fantastic. I am considering getting one to replace my own 35 mm.", "Date": "June 8, 2012"}, {"Title": "Flimsy but easy to use", "Author": "JJ", "ReviewID": "R1FI6FNDDJZACO", "Overall": "3.0", "Content": "The \"HP PhotoSmart E317 - Digital Camera\" is a very cheap digital camera with mediocre quality; however, it is extremely easy to use, making it not too bad a camera.First of all, the camera is extremely flimsy.  Just the slightest touch will turn it off once it is on which can be extremely annoying when you need it for that split second to snap a really quick picture.  Also, some of the little minor parts, such as the battery cover, break off extremely easily, and you have to go to extreme measures to make it stay on once it has broken.  In addition to these two faults, the picture quality isn't the best.  It is slightly blurry, and it gives people and animals a really bad red eye even with the special feature on that is supposed to get rid of red eye.  Also, after you take a video and get it onto a computer to view, the words and actions are severely out of sync, causing some confusion in the video.  Another con is that the camera destroys batteries very quickly, and unless you invest in some rechargeable batteries, you will be using about 2 batteries every 30-60 minutes with this camera.Even though there are some major cons to this camera, it still manages to have some pros to it.  For instance, the camera is extremely easy to use.  There isn't much that you have to learn how to operate causing even the most mechanically challenged to be able to use the camera.  Another positive feature of the camera would be that it has a relative decent memory storage.  You probably still want to pick up a memory card to be able to take many photos/videos, but the memory on the camera will suffice for quite a few pictures or about an hour of video.So, overall, it's not necessarily a BAD camera for the price, but there are many cameras out there that are much better for just a little bit more money.  I would have to say I recommend getting one of those and giving this camera a pass.", "Date": "November 26, 2010"}, {"Title": "bad camera, bad cust service from HP", "Author": "Suzanne MN Fisher", "ReviewID": "RW143VVH8DS53", "Overall": "1.0", "Content": "I used this camera while studying abroad.  It lasted until the last day of my trip, then the memory card wouldn't stay in the slot.  I'm careful with my equipment and never dropped the camera or anything like that.However, I disliked the camera prior to it completely not working, as the view screen (there is no view finder) jerks around so that you cannot see what you're aiming at unless your hand is completely still.  Also, the battery cover does not like to stay closed.As I'm still under the mfr warranty, I faxed the receipt, model and serial nbrs, and my contact info several times and am still experiencing unresolved customer service issues with HP tech support.  If you want to avoid the possibility of problems like the above and do not want to deal with a cust service headache, go with a decent camera for a little more money.  Sony Cybershots have worked well for other people I know.I should also add that I bought this camera even after reading all the reviews on Amazon about it, because it was the cheapest thing (about eighty bucks) available in the little town I'm from.  I thought the worst reviews were maybe overrated, but just on the basis of the horrible customer service I've received so far I would not buy another HP camera again and likely will never buy another HP printer, either.", "Date": "March 11, 2007"}, {"Title": "Returned this!", "Author": "M. Nelson", "ReviewID": "R3F6SVEHC4XRO4", "Overall": "4.0", "Content": "Just wanted to say my earlier review of this was dead wrong. The camera stopped working a couple weeks after I got it. Luckily I had 30 days to return it and that's what I did. Poor camera, went with Kodak instead.", "Date": "January 11, 2006"}, {"Title": "You pay for what you get", "Author": "May", "ReviewID": "R18EKRXE2SXQ70", "Overall": "2.0", "Content": "First of all, I have use a digital camera for a while now and I have a Sony P-71 and love it.  I was thinking to get a simple one for my mom and went crazy on the Black Friday shopping and got this camera from Walmart for $88. I was thinking wow! for 5 mega pixel, this is a really good price.  Well..you really get what you pay for. I tried it and I just can't seem to get it to stable while trying to take a picture.  The LCD make me dizzy looking at it while trying to take picture.  It move like a boat and I can't really tell when I take the picture whether it is in focus or not.Here are some of my findings and I have to say I may take it back and get my mom a sony for a little more moneyPro: compact, light weight, good resolution, internal memory (16MB), under $100, can take video with audio.Cons:  Not a lot of functions build in.  The LCD don't focus very well (move around like a slow motion movie..make me dizzy!)All in all, it is probably a good camera for a starter.", "Date": "November 28, 2005"}, {"Title": "Great, reliable, little camera", "Author": "rtncrft \"rtncrft\"", "ReviewID": "R3JB9SW9PUSV22", "Overall": "5.0", "Content": "I'm surprised to see low reviews for this camera!  I purchased one a little over 3 years ago, my first digital camera!  It was great, easy to use, never any problems and I used it for my first photography class and was taking better pictures than most of the more expensive models!  After about a year, I purchased a larger more expensive camera and gave this one to my daughter to \"use\".  Two years later and I still haven't gotten it back...she loves it, hasn't had any problems with it either; and has no intention of returning it!  I'm thinking about getting another one to carry with me for those unexpected photo ops.", "Date": "July 16, 2008"}], "ProductInfo": {"Price": "$297.99", "Features": "5 MP effective resolution\n2332 x 1740 effective pixel count\n16 MB internal Flash memory\n1.5-inch Color LCD\nSlot for memory card Secure Digital (SD) or MultiMedia Card (MMC) memory card", "Name": "HP Hewlett Packard Photosmart E317 5MP 4x Digital Zoom Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/31GE64cITIL.jpg", "ProductID": "B000CF0OX6"}}