{"Reviews": [{"Title": "Great images for online and web, beautiful camera design", "Author": "C. Song", "ReviewID": "R28MM991O33XID", "Overall": "4.0", "Content": "Samsung NV 15 reviewNovember 2007Images:PROS-takes great images for the web. Automatically saves in sRGB jpeg mode.-Still can't get over how beautiful and functional it looks, everyone has admired it- awesome that it charges through USB port.  Less wires.-macro features works pretty well if held completely still-special effects features are pretty fun to use and cuts out the \"middle man\" like photoshop-has a manual feature but can only chose from two different aperturesCON-At 100% view images looks very pixellated at 200 ISO and above.-flash seems pretty bright for indoors and at night in auto mode, images sometimes become blown out-even at 80 ISO there's noticeable noise and I wouldn't want to print from those images. Need to have really good light for less noticeable noise.Video:PROS-Can shoot up to 3 hours with a 4 GB SDHC card- can zoom during shooting but stops recording sound while in process of zooming-pause feature is wonderful and really convenient on the videoCONS-Lots of distracting flare in night videoSo FAR:Decent point and shoot for grabbing snippets of life .  Coming from the Canon 20D SLR it's easy to be hard on the point and shoot.  I wouldn't print from these images, but that's what the dSLR is for.  Portable, easy to use and neato \"vacationer's\" features.  The design is brilliant, because it is beautiful, unique and functional.  Image quality is good but not great, even compared to my old canon point and shoots.  The video feature is a definite plus and would be okay to use for visuals with sound overdubbed.  Before buying any digital camera, it's best to know what you'll be using it for.  If you're intending to do a lot of printing with it then this might not be the best camera.  If you want to capture images to easily post on the web then this is a great camera.  If you want a camera that is small, portable, and absolutely beautiful, then the nv15 is a good choice and great value for the money.", "Date": "November 10, 2007"}, {"Title": "Fantastic Pocket Camera", "Author": "Kevin Barthelemy \"Tech Fiend\"", "ReviewID": "R12TACXO6PSNWY", "Overall": "5.0", "Content": "I have had this camera for four days now, and I couldn't be happier.  Got it for $160 - I looked and looked, but there just ISN'T a better deal.It looks great, fits into a pocket (but I use a small belt pouch), gets up and running very quickly, and takes great pictures!  Before I bought it, I ran across several reviews claiming poor picture quality...including blurry photos.  Believe me, it isn't the camera's fault.  The Schneider Kreutznach lens was one of the features that helped to sell me on this camera...nice.The 640x480 video at 30 fps is better than I'd expected, now I may just put off getting a DV camera a bit longer.The very clever user interface is incredibly easy to use, the stainless steel body is beautiful, and how can you go wrong with SS, anyway?  Even as solid as this thing is, it is very light (151.7 g w/o battery or memory card)....and it feels VERY solid.", "Date": "February 26, 2008"}, {"Title": "Disappointed", "Author": "C. Gohlke", "ReviewID": "R2VRJNST1YOV80", "Overall": "2.0", "Content": "First, I'll say that there are some things I really liked about this camera after using it for the past six months. The retro design makes it unique among digital cameras, and is very attractive if that's your style. The low price for a 10 megapixel camera is unrivaled as well, and was one of the main draws for me for this camera. It holds battery well, so I didn't have to recharge as often as some other cameras I've had. (It has an internal battery, so requires computer connection and cable to charge.)Now, the downsides. It is very, very slow to take and process pictures: Expect to wait several seconds after snapping a shot before you're able to preview the picture. That doesn't sound like a lot, but for a camera that has problematic settings and needs more attention than the average point-and-shoot (see below), I found I was missing shots that even a disposable film camera could have snapped more easily and quickly.In automatic mode, I rarely came out with focused pictures; it usually required playing around with various scenes and settings, even in full daylight. The on-screen functions are confusing, which may reflect my own personal preference, but I never really got used to them. I don't consider this camera a simple point-and-shoot, so because it requires heavy adjustments on the settings, I would have hoped them to be a little more user friendly. There are a series of buttons along the bottom and right side of the screen to scroll through the functions, which I found complicated to navigate -- I was always clicking the wrong functions because it was not clear which button matched up to what.One of my major complaints is that the structure of the camera itself was, in my opinion, shoddy. I took very good care of the camera, always stored it in a case and never abused it. However, after less than two months of use, the pop-up flash started acting up. The flash would go off but not pop up sometimes, causing ruined, black pictures when flash was necessary. Not much later it broke completely -- the flash device is up 100% of the time and won't go down unless held there, so while I don't have dark pictures anymore, the flash risks snapping off.In the end, I gave the camera away and just bought a Nikon S210 to replace it. The price on the new camera is about the same, and although the Nikon is 8 megapixels, it has consistently taken better pictures faster than the Samsung, and thrives in automatic mode.For a nice looking, attractive camera, go for the Samsung NV15. For quality pictures, steer clear.", "Date": "September 24, 2008"}, {"Title": "Amazing little camera", "Author": "Danny J. Page \"Danny J Page\"", "ReviewID": "R2TJF7QR1JJC2", "Overall": "5.0", "Content": "Let me start off by stating I am a professional photographer, so I do have plenty of experience with REAL cameras. :) But, real cameras cost a lot and are bulky and aren't easy to carry around. This little guy fits perfectly in my pocket, in pants that aren't very baggy, and still take great pictures.So, the picture quality is not fantastic, but I'm probably biased. They're not always tact sharp, and the lens isn't one of my $2,000 lenses, but it's much better than my camera phone. The face recognition is nice and the touch sensitive controls are really easy to use. The features are exactly what you need with nothing too over the top (some of the \"frames\" are a little pointless, but they don't get in the way.) Overall, you can just hit the power button and start using the camera without a problem.The only problem I've experienced is that after having it in my pocket, the mode dial gets moved so when I pull it out, I have to double check to make sure it's still on the right setting.", "Date": "March 4, 2008"}, {"Title": "Great camera, great price, great service", "Author": "Rabel Roberts \"R. Roberts\"", "ReviewID": "R2790353W8HI8J", "Overall": "5.0", "Content": "Everything I expected and more.  This camera is sexy.  Easy to use, fast from power to click, long battery life.", "Date": "August 28, 2008"}, {"Title": "Great Camera", "Author": "Zip Seven", "ReviewID": "R24RBTT9SWV6Q6", "Overall": "5.0", "Content": "I have enjoyed using this camera, the interface with the multiple buttons around the screen makes changing the settings a breeze.  It does a pretty good job cleaning up the picture when you use the doubler as well and I think it looks pretty cool.", "Date": "June 13, 2008"}, {"Title": "Very Good, Many Features", "Author": "A. Watson", "ReviewID": "R1IKHLN6G9VZRL", "Overall": "5.0", "Content": "If your worried about it being durable, don't be. I work as an engineer at a steel mill and I use it to document projects.  I've dropped it a couple times from waist height, covered it in metal dust, and overall have generally used it in hot, sweaty, and dirty conditions. I've even had some water splashed on it. Sure it may have a couple small scratches on the frame, but that's to be expected.  The display on the back is even fine.  The only issues I have had is that the lens guard wouldn't open all the way once after I dropped with the lens was extended. However, it only took a few \"on-off\" cycles and then it opened perfectly fine.  Also, the flip up flash seems a little flimsy for my liking, but I haven't really had a problem with it.I would have so say the best feature is that it is rechargeable just like an iPod. You can plug it into the computer to charge it, or plug the same cord into the USB-to-AC Power adapter that it comes with.  It's worth buying just so you don't have to buy batteries every other time you use it. I've even used it in a pinch as a portable hard drive to transport files since it appears as one on your computer when not using the provided software.I was initially looking for a camera with a 10x zoom, but the 10.1 megapixels make up for what the 3x zoom lacks (you really don't need more than 7 MP otherwise).  As for the shake reduction, I've taken it on a very fast roller coaster, although I'd advise not to, and ended up with some surprisingly clear pictures.The psudo-touch screen buttons along the sides of the display is a pretty sexy feature.  I'll admit though, even for a engineer, it took me a while of tinkering before I got the hang of navigating the controls. On the upside, they allow for a larger screen on a smaller camera.All in all, it's a really great camera for the price.  I've used it in many different environments for many different types of pictures, and I haven't even used half of the features that it provides. I bought the NV15 on Amazon over the summer for around $150. For that price, or anything under $200, you definitely can't pass it up.", "Date": "August 27, 2008"}, {"Title": "great little camera for the money", "Author": "morning fog", "ReviewID": "R1V23583XDC2ES", "Overall": "5.0", "Content": "reasonably priced, easy to use, photos are good.this is a great little compact camera.", "Date": "April 9, 2008"}, {"Title": "Very pleased!", "Author": "Lisa Betts", "ReviewID": "R3PG8JBU97SR9", "Overall": "5.0", "Content": "So this is the second time I've owned a digital camera.  My first one was a cannon, and I was seriously disappointed in it, but since I didn't shop around for a new one until recently, I suffered with it.I did some research, looked around, asked friend who were professional photographers as to what I should use for a basic digital camera.  When I brought up the Samsung NV models, they all had wonderful responses.  One of my friends even said, \"It's a pro camera without the price.\"After I looked around and came accross some reviews that were mostly positive, I decided I would get it.I'm definately not disappointed.  This camera takes AMAZING photos and without the flash, they're still clear, crisp and have great natural lighting.I would reccomend this camera to anyone I know, knowing I would not be letting them down!!!", "Date": "March 6, 2008"}, {"Title": "Fun little camera, that's about it", "Author": "sam i am", "ReviewID": "R1HDV7W82Y8BB", "Overall": "3.0", "Content": "I have had this camera for about a year now, and can say I do enjoy using it.  The menu system is intuitive, smart, and quick--exactly what I expect from a solid maker like Samsung.  This menu system is a great example of what a relatively new (and tech-friendly) company to the photo game brings to the camera market.  The design is beautiful and the vintage rangefinder-esque, slim body is what drew me to this and ultimately led me to purchasing it.Now lets get to arguably the most important part: picturetaking.  If all you do is shoot simple portraits and landscapes, then you probably will be happy with this.  If you want a little more picturetaking \"chops\", you should probably look elsewhere.  I am fine with its limited capabilities, due to the fact that I use it 90% of the time simply for snapshots.  And I have since bought a Nikon D300--so I don't need a big-performing point-and-shoot.I have tried using the NV15 on active subjects, with mixed results at best.  It's AF (autofocus) is slow, and optical quality in low light without flash (@ higher ISO) is pretty poor.  Its image stabilization is also so-so, compared to offerings by the established camera makers.  And to boot, I dropped the camera from a very small height, and the topline of the camera shows a large crease through it.  The stainless steel that comprises the top piece is, in my opinion, too thin and a poor choice of material.  Samsung could remedy this by employing a piece of lighter and thicker material that has less malleability, i.e. aluminum or magnesium.  I don't expect that camera makers design this class of camera for particularly rugged durability (unless they are going specifically after this niche, like Olympus has) so I'm not too bummed about the dent.All in all, I like the camera fine and I suppose from an aesthetics perspective, the design and the menu selection system alone make it worth the purchase--barely.  If I had to do it over again a year ago, knowing what I know now, I would have bought something like the Canon sd750.  On the market now are at least a dozen cameras that would be great alternatives and are feature-packed.  In the past year, I hope that Samsung has improved their picturetaking features from the NV15 such as AF, higher ISO image quality and image stabilization.  Because if those qualities are paired with Samsung's current innovative features, they could become an elite player in the market.", "Date": "January 29, 2009"}, {"Title": "Excellent camera, loads of features!!", "Author": "Gary E. Ullrich \"bigdog417\"", "ReviewID": "R2U2W2XAV2QIHY", "Overall": "5.0", "Content": "This is my third camera like this. I bought one for each of my children and was always envious of the them, especially the close up capabillities. I wanted a camera to photograph close up pictures of some coins I want to catalog and this camera does a wonderful job. Using the higher resolutions allows me to zoom in on a particular feature of the coin to better show detail and/or mint errors. Great camera, easy to use and very easy to carry around. The one drawback is that the flash tends to pop open so if you carry it around much use a well fitted case so you don't damage the flash should it pop up.", "Date": "January 26, 2009"}, {"Title": "great camera", "Author": "L. Rivers", "ReviewID": "R2JGPHWECXVA6I", "Overall": "5.0", "Content": "great camera. can be a little tricky at times. very stylish and have received tons of compliments...the pictures are not too shabby either", "Date": "March 25, 2008"}, {"Title": "Generally happy, but with some concern.", "Author": "F. Baur \"FB in D\"", "ReviewID": "R2KW2O9BMQWV8X", "Overall": "4.0", "Content": "Picture quality is very good, but not excellent. I don't like the pop-up flash. When someone else uses the camera, they tend to think it can be opened manually -- a logical conclusion. Fortunately, I've been able to give them advanced warning. If that isn't possible in the future, someone may innocently break the camera by opening the flash. Also, dust seems to be collecting under the LCD cover. That would be OK, if there were a way the user could clean it out.", "Date": "September 17, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "10.1 megapixels\nAward-winning Schneider-Kreuznach lens\n3x optical zoom and 5x digital zoom\nAuto Contrast Balance (ACB) function\nAuto Shake Reduction (ASR) function", "Name": "Samsung Digimax NV15 10.1MP Digital Camera with 3x Advanced Shake Reduction Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41WlCY4wLUL._SX300_.jpg", "ProductID": "B000VE77TC"}}