{"Reviews": [{"Title": "So much more than just a digital camera.", "Author": "Nicole D. Cook \"Quickwe\"", "ReviewID": "R3O2J7XOW6I7HH", "Overall": "5.0", "Content": "I just got this camera for Christmas.  I hate reading directions, so I popped the battery and memory card in and I was off!  Very user friendly, and has all the right options. Plus, its about the size of the average cell phone. The coolest thing about the powershot is that it knows which way you're holding the camera, so if you hold it vertical to get a tall shot, the viewer turns all by itself.  I also love that you can edit video on the camera and set up slide shows.  Its very easy to load pics onto my computer with the USB connection - or to set up a slide show for the TV.  It even holds voice memos and has cute sound effects when I take pictures.  This is really a great camera.", "Date": "January 14, 2007"}, {"Title": "Great Quality, Size & convienience", "Author": "Maria Mejia \"Pitahia\"", "ReviewID": "R2UHN8DS7II2UH", "Overall": "4.0", "Content": "I really enjoy this small, high quality camara. I purchased a 2.0 GB memory disk so I could take advantage of the 7.1 mega pixel.And I get great pix everytime.  I have lots of fun with it. Since its so small, it's easy to take everywhere with me. I also get lots of compliments on it's \"Fashionable\" sleek design.  I highly recomend his camera.", "Date": "February 21, 2007"}, {"Title": "Fantastic!", "Author": "Nicole Mitton \"fragrantelephant\"", "ReviewID": "RY2CROXL64M6G", "Overall": "4.0", "Content": "PROS: Small; user friendly; takes excellent outdoor pictures.CONS: Limited zoom; flash in low light conditions washes out colors.The Canon SD40 is small, sleek, and takes excellent pictures when it's sunny out. I'm especially pleased with the super-simple slider that lets me switch between picture-taking, video-capturing, and viewing modes. This camera is a winner!", "Date": "November 15, 2007"}, {"Title": "Great Camera, but be aware of color", "Author": "Samuel O'Connor", "ReviewID": "RFYV8XRRKTVMY", "Overall": "4.0", "Content": "I owned the SD10 for 4 years.  It takes nice pictures (notably not THE best) and is easy to use, but the best feature was always the size.  It's so compact - perfect for a guy like me that wants to shove his camera into a pocket.  It was smaller than even my cell phone.  So, when it was time to upgrade, the SD40 was the natural choice.  I love the new features and updates that the SD40 offers.  I was, however, surprised to see the Twilight Sepia version, as when it arrived, the metal trim was gold, not silver like the picture looks or like the other color choices for this model have.  I can live with it, but it was not what I was expecting.", "Date": "March 17, 2008"}, {"Title": "For Great Snapshots on the Go...", "Author": "Daniel Bargen", "ReviewID": "R3DS9FICUMQU9G", "Overall": "4.0", "Content": "I bought this as a gift for my fiancée, and she loves it. With very little need (or capability) for manual adjustments, this little guy takes excellent photos. Features like facial recognition and good flash/aperture auto-adjust make this easy to point and shoot while looking at the surprisingly large LCD display on the back.This model doesn't come with a viewfinder, and it doesn't need one for the group it appeals to. The LCD is plenty big. In fact, it has a decently dense resolution for its size, unlike the large-pixel size seen on screens of many other cameras. Facial recognition is very accurate and can pick up a dozen or so people at a glance. Only rarely have I seen it think inanimate objects are people worthy of bringing into sharp focus.It's small size her carry it around with her everywhere in an extra coinpurse. That little bit of protection keeps the recessed display safe enough, and lets her photograph everything and anything. I might start to regret how handy that is for her with the massive number of pictures she takes now.The included dock is a great accessory as the camera can just sit there charge and upload photos or output to a TV or similar display.At 7.1 MPs, it's a good camera for 4x6's or even larger photos. The lens is nice and sharp in most every situation. A few post-processing steps can even fix the usual problem of the on-board flash (you'll see than in any non-DSLR). Little white balance adjustment is ever needed, and the lens picks up a lot of detail near and far. Just don't count on getting many fine art portraits with this model.If you have fast-moving little ones, or an active nightlife, this model is pretty much ready to go most anytime you want to photo document what's going on around you. Not to mention that the current drop in price on Amazon makes it an easy decision for a first digital camera or even an upgrade to your current point-and-shoot. While it's not exactly what I'd want in a camera for what I do, it's great for the laymen or if you just want to record a few moments of your life without much hassle.", "Date": "February 16, 2008"}, {"Title": "Great little camera", "Author": "G. Monroy", "ReviewID": "R12ZWYUBOPC6AE", "Overall": "4.0", "Content": "Features galore. This little thing is great for taking pics in all conditions. My only \"complaint\" is battery life is diminished in exteme cold (less than 20F). But my skiing pics/videos are awesome.", "Date": "February 25, 2008"}, {"Title": "Great little camera", "Author": "MouseLegend", "ReviewID": "R1PWZY4XPHR2FJ", "Overall": "5.0", "Content": "I bought last years model and absolutely LOVE IT so I bought my daughter this years model.  It is simple to use and simple to download pictures in computer.  It's small and cute and fits in your pocket.  I take it everywhere I go!  Mine is Rock Star Red and her's is Twilight Sepia.  We both get lot's of nice comments about them.  Easy to recharge.  Hope this review helps you.", "Date": "August 7, 2007"}, {"Title": "Easy, sleek and durable...A quality company", "Author": "Ronald L. Greene", "ReviewID": "R53RSQRLOHJXN", "Overall": "5.0", "Content": "I bought this one for my daughter...She was careless and dropped it.  Canon replaced it for no more than shipping and handling charges.  Their customer service is just great.The pictures are crisp and clear and so is the company.A class act all the way.Ron Greenergreene@stellarcarehealth.com", "Date": "February 25, 2014"}, {"Title": "Great camera", "Author": "James Felan", "ReviewID": "R3VG59ET7Y9CS3", "Overall": "5.0", "Content": "very rugged camera, small, great pics.  It was missing a battery and i may have over read that it did not come with one.", "Date": "June 21, 2013"}, {"Title": "Great little camera!", "Author": "ELM79", "ReviewID": "R2S5SG3WC1UZOT", "Overall": "4.0", "Content": "We already had a Canon Rebel Digital but wanted something smaller to use for just fun stuff.  This camera is perfect.", "Date": "October 15, 2010"}, {"Title": "Love this camera", "Author": "Sam Betesh", "ReviewID": "RYK0EW7G25FD6", "Overall": "5.0", "Content": "This is the only camera that does it all in such a small package. Slips in and out of my pocket. It's the perfect portable camera.", "Date": "May 6, 2010"}, {"Title": "Great pocket point and shoot camera.", "Author": "dazzler11", "ReviewID": "ROYPLAY6N7X65", "Overall": "5.0", "Content": "I have had this camera for over a year now and I have to say it's a very capable little point and shoot. My main camera is a Nikon SLR, but I wanted something that I could keep in my pocket and snap away without all the bulk of the SLR. The SD40 is small enough to keep in your pocket, it produces great pictures and the on camera editing feature is very nice to change color hue, I particularly like the vivid setting. The video is also very capable, battery life is good and a 2gb card holds enough storage for the pixel count of the camera, the flash is very small so don't expect great results with it. The LCD is a bit small and hard to see in daylight but that is a trade off for the overall size. I also like the blue lighted button on the back that lets you shoot in a vertical position. Overall I am very pleased with this little wonder and usually take it with me wherever I go and always throw it in my backpack when on shoots.", "Date": "February 22, 2010"}, {"Title": "camera", "Author": "H Marra", "ReviewID": "R2HZKFMVFFORT3", "Overall": "5.0", "Content": "i love this camera, it is light weight and perfect size.  Pictures are clear, and i love the color accent option.  i would highly recommend this item and the matching case. perfect combo.", "Date": "June 9, 2008"}, {"Title": "Definetly worth it for the price.......", "Author": "J. D. Arce", "ReviewID": "R12XRJYJGQTD9I", "Overall": "4.0", "Content": "What a neat little camera. I bought it only a month ago, so far so good. I turned it on and began taking pictures immediately. I hate reading instructions and this camera was very user friendly and very compact. I got it for my wife for Valentines day and she adores the color too. I guess the only negative thing I would have to say so far is that the memory card it came with was very small 16mb. I can not take videos for long or save many pics. But, that is a feature you can upgrade. I saw a 4GB on sale at Office Depot for $49.99. I am definetly going to upgrade it so I could take long videos and save hundreds of pics while on vacation. One other thing I notice is that when looking at an image through the LCD sceen, it looks fuzzy. But the picture comes out fine. Maybe I just don't know how to use all the features yet.Oh and finally, it should come with a carring case. Just my opinion.I really like it, good buy........", "Date": "March 15, 2008"}, {"Title": "Wow, really bad pics", "Author": "Sandy \"Sandy\"", "ReviewID": "R11QV78MUQUWV8", "Overall": "2.0", "Content": "Having owned way to many point and shoots, bought this one and waited a week for it to come.....the out door pics are nice,,,,very nice color but the Macros and indoor pictures really struggle to even look ok, my iPhone tahes much better pictures, it was between this and the SD1000, and now i know I made the wrong choice for a camera...Just ordered the sd1000 and moving away from this camera. Not worth the Hassle.", "Date": "March 12, 2008"}, {"Title": "Love this camera....", "Author": "Brownie \"Brownie\"", "ReviewID": "R1IPMPSJVRXVT3", "Overall": "5.0", "Content": "I absolutely love this camera. I bought it last May and got the greeeeat special that only cost around $200 for the camera and accessories set. The battery last such a long time. I rarely ever charge the battery at all honestly. The color is great. Everyone compliments it. The camera is so small and easy to carry around. Strap it on your wrist and go. Yes, this camera is not the latest, but I absolutely love it. Pictures come out great. There's a variety of settings and the pictures come out greeeeeeat.If you can afford it, get the weather case too. I took this camera to the beach and got sand in it and the camera was ruined. So, I bought the same exact camera again and don't. I couldn't help it; I loved it too much", "Date": "October 16, 2009"}, {"Title": "Great Camera", "Author": "Danielle Cardoz", "ReviewID": "R3DKIYA3YT4XKU", "Overall": "5.0", "Content": "I bought this camera last year after I used my friends and I love it.  Everytime I pull it from my purse I have people asking me about it.  It is so easy to use and perfect to carry everywhere especially small purses.", "Date": "January 13, 2009"}, {"Title": "very nice camera", "Author": "Jun Wang \"jeff cincin\"", "ReviewID": "RZAS375CFMPPR", "Overall": "5.0", "Content": "This is a great camera with a lot of features.  It is easy to learn the functions and it is compatible with a lot more memory chips.  This is in distinct contrast to the Sony camera I had, which cost me a lot to buy the memory card (only Sony unique card can be used).  Overall, this is a very good camera that is a lot better than the sony I had.", "Date": "July 8, 2008"}, {"Title": "Great Teen Camera", "Author": "Mac \"Nancy\"", "ReviewID": "R3OOOKT9CJMU7M", "Overall": "5.0", "Content": "I bought this camera for my teen daughter.  She loves it and finds it very easy to use.", "Date": "May 2, 2008"}, {"Title": "Perfect in pink", "Author": "Michelle D. Warren \"femmevazaha\"", "ReviewID": "R21W4MHLPUEMXJ", "Overall": "5.0", "Content": "Super camera for taking along on trips and parties and my kids won't steal it.", "Date": "May 2, 2008"}, {"Title": "Great camera, great price!", "Author": "Brendon Kapinos", "ReviewID": "R75P0617NW44Y", "Overall": "4.0", "Content": "A great point and shoot camera! Literally pick it up and begin to take beautiful pictures quickly and efficiently! It's small size lets you throw it in your pocket and head out the door, and it's quick processing ensures nobody gets bored. The SD40 even has advanced settings to fool around with such as manual ISO adjustment and color accent for more creative users. My girlfriend loved this gift!", "Date": "January 1, 2008"}, {"Title": "Am i doing something wrong?", "Author": "frazipe \"frazipe\"", "ReviewID": "RT1SS29N0X0JB", "Overall": "2.0", "Content": "I've read good reviews of this camera on this and other sites but I am not having the same experience. The quality of the photos are horrible so I started thinking it was me and I tried it with different settings, tried being very, very still etc but, I only get one good shot out of about ten. I have a Fuji 4mp that I bought about 6 years ago and it takes way better pictures than this. I bought this so I could give my old one to my daughter but I'm gonna end up giving this one to my daughter and and keeping my Fuji. We recently had snow here in Tucson so I took pictures with mu Fuji and compares them to the Canon and the 6 year old Fuji Finepix beat it hands down. I don't get it, did I get a defective camera or am I doing something wrong or does this camera just suck?", "Date": "January 25, 2007"}, {"Title": "Love It!!!!", "Author": "Patricia E. Benavides \"TnG5702\"", "ReviewID": "RBACDQVDPXOQ8", "Overall": "5.0", "Content": "It was exactly what I have been looking for... I LOVE my new camera, it's PERFECT!!!!! :o)", "Date": "December 24, 2007"}, {"Title": "Nicholas M Williams", "Author": "Nicholas M. Williams \"consumer\"", "ReviewID": "R1R4DWTWTYFD5E", "Overall": "2.0", "Content": "I received this camera (in Tuxedo Black) several years ago as a Christmas present, after having made my special interest in the camera known after reading a number of reviews about compact digital cameras. I especially focused on Canon products because I have owned two (2) 35mm single reflex cameras in the past, all of which we great quality cameras. This was my first try at camera digital technology. At that time (2004) the retail price was pretty high (over $400.00). The purchase was made through Amazon and I no problems with it out of the box. I, too, do not like to read a whole lot of instructions when trying out something new (except when it is obviously very difficult to use or understand it's operation). In this case, after a minimum of reading in the \"short\" manual, I was able to take very nice, clear and detailed pictures without much difficulty.However, after several weeks of use, I had occasion to take a special set of photographs that I wanted to archive and keep for my family. At the time the pictures that were taken when many memorable poses were struck, the lighting was completely right, and the occasion was a once in a lifetime thing. I had gone as far as to purchase a large capacity Scandisk Memory card (2.0 GB) to insure I would be able to memorialize the occasion. I took just over 80 photos, well within the limits of the card.When I tried to download the pics to my computer, review them, and eventually print out some of the photos, I noticed an error message on the camera (memory error). I even tired to recover the photos using \"so-called\" recovery software, both by Scandisk and following instructions from Canon. All to no avail. I soon learned that the photos were lost forever. Needless to say I was very upset. How could a name-brand product(s)malfunction in this manner at THIS time (barring any operator error)?After I calmed down I began to work the problem and conducted a little research. What I learned was that the Scandisk brand (that particular model/item) had a history of malfunctioning. What I also learned was that the Canon is not very sturdy and can succumb to error when handled roughly.Ever since that time the camera consistently displays an error message (Image Error or Memory Error) when after turning the camera on to take photos you either hold it at an angle, move it suddenly, or just on \"general principle\" it decides not display the subject of the picture (black screen with error message), and will not take a picture until you turn it OFF, shake it gently, and then turn it ON again. Sometimes that method will not work, so you have to remove and re-insert the battery (whether it reads fully charged or not), or you have to remove and re-insert the memory card. There is no way to determine how this makes the camera work again, or which is the offending item between the battery or the memory card. Sometimes this method does not work either. You may also find that the zoom function on the camera stops working and only zooms to two zones, not three.Additionally, the camera does not work with certain \"low\" capacity memory chips. Make/brand and capacity vary.What I did, since the problem is difficult to explain to Canon for the purpose of getting it repaired, is to purchase a memory chip with \"Backup/Recovery Software\". In the event that you ever encounter another \"incident\" like I did, you may be able to save those special memories. Also, get used to the idea of having to shake the camera, turn it on and off before it will again start ot work \"properly\".Otherwise, the camera is generally great, compact, light-weight, fair to good auto-focus, internal flash is weak/inadequate, zoom is nice (when it works). However, sometimes there is a \"hesitation\" for the camera to fire when it it auto-focusing (sort of slow). You will find a LOT of red-eye situations with this camera (you will eventually get tired to having to retouch your pictures with Red-Eye software.)The Canon photo software is effective, but there are better packages on the market. The software can be confusing and gives few options (compared to other types), but depending on your needs, it might work for you.Buyer - be aware. Hopefully your purchase will result in a perfectly constructed or modified unit that will give you years of good service. If you don't like to gamble, then you might consider another model or manufacturer.Good Luck.", "Date": "February 15, 2008"}, {"Title": "Pictures are awful", "Author": "A. husain \"amylaw\"", "ReviewID": "R3FK5I63IK49VC", "Overall": "1.0", "Content": "I bought this camera 3 months ago and have used it a few times. Last week all of a sudden the pictures look out of focus and over-exposed. I haven't changed anything or done anything. I have no idea what's wrong with the camera, but given the price I'm pretty annoyed and Amazon.com will not refund my money because it has been over 30 days.", "Date": "March 25, 2007"}, {"Title": "\"Change the battery pack\"", "Author": "Donald D. Steffy \"dsteffy510\"", "ReviewID": "R1V8HRVHFXPL0Y", "Overall": "1.0", "Content": "I have had this camera for less than a week.  I really liked it up until now.  However, it's now unusable.  Despite leaving the camera in the charging cradle for hours, I can only use the camera for 1 minute at a time before the camera shuts itself off with the message \"Change the battery pack.\"  Defective battery?  Defective charger?  Who knows...  Sure has sucked the pleasure out of this purchase though.  Going to have to send it back probably - $300+ is a lot to pay to have to deal with problems like this 1 week into ownership.UPDATE: If I could, I would increase my rating to 4 stars now.  Turns out, I was using the charger incorrectly.  As simple as you'd think a charger would be, I still managed to screw everything up (I think I was setting the camera on it while the camera was on, or some nonsense, and the battery was not charging - I think I read the manual and figured out the orange vs. green led light situation).Also, a few month later, the lens stopped powering in and out, and Canon did indeed fix it for me with no hassles.  I'd give their service dept 5 stars.  On the whole, I'm very satisfied with Canon and this particular camera.", "Date": "October 15, 2007"}, {"Title": "happy faces", "Author": "Donna Olsen", "ReviewID": "R112ODN2R46TCB", "Overall": "5.0", "Content": "i bought this for my teen age daughter for xmas, and she loves it. it's easy to use and takes super great pictures. thanks for helping my make her happy.", "Date": "January 11, 2007"}, {"Title": "my old camera", "Author": "Norma garcia", "ReviewID": "R36E7DR63W2GPA", "Overall": "3.0", "Content": "I liked everything except I could not get rid of the red eye in all my pictures, I gave the camera away and purchased an sd630 which I love", "Date": "January 12, 2007"}], "ProductInfo": {"Price": "$449.99", "Features": "7.1-megapixel CCD captures enough detail for photo-quality 15 x 20-inch prints\n2.4x optical zoom; 1.8-inch LCD display\n9-point AiAF, single point AF, and Face-priority AF, which detects faces and focuses on them\nStores images on SD cards; powered by Lithium-ion rechargeable battery NB-4L\nNow supports SDHC cards (Secure Digital cards with over 2 GB capacity)", "Name": "Canon PowerShot SD40 7.1MP Digital Elph Camera with 2.4x Optical Zoom (Olive Gray)", "ImgURL": "http://ecx.images-amazon.com/images/I/41MK036H6QL._SX300_.jpg", "ProductID": "B000HAOVEE"}}