{"Reviews": [{"Title": "I love this camera!", "Author": "J. Hewell", "ReviewID": "R13PE0BWPCCY67", "Overall": "5.0", "Content": "I just bought this camera and I absolutely love it!! It is easy to use and takes incredible pictures. I own a Macbook Pro, and downloading pictures to IPhoto and videos to IMovie could not be any easier. Video quality is good for short videos, but can be grainy when you zoom in. There is also some background noise when using the zoom feature in videos. Since I bought the camera for still pictures and not video, though, I am extremely pleased with this camera and the quality of the pictures that it produces.", "Date": "December 24, 2007"}, {"Title": "Excellent", "Author": "William R. Turgeon \"IT Guru\"", "ReviewID": "R2X947EBSV40KS", "Overall": "5.0", "Content": "Bought this for my 16 year-old daughter.  She's a Myspace and Youtube junkie.  The camera is an excellent value, very easy to shoot for Internet sites with a simple setting.  No more resizing pictures before uploading.  With face detection that works and image stabilization, a real nice camera at a very resonable price.  Also allows for rapid-fire shots!!", "Date": "December 26, 2007"}, {"Title": "Great camera", "Author": "Antonio J. Bisogno G \"Antonio J. Bisogno G.\"", "ReviewID": "R1WABW6WOMTRNN", "Overall": "5.0", "Content": "i just bought this camera for a gift and now i want to have one. I really recommend this article it works perfectly if you are not professional (like me) you will not have any complaints.", "Date": "December 24, 2007"}, {"Title": "Just not good.", "Author": "Mr. A", "ReviewID": "RFRDMQX9FH8GE", "Overall": "1.0", "Content": "I'm a photographer, but I bought this camera for my girlfriend (who wanted it because it was pink), and even though I normally recommend Canons, especially for point-and-shoots, I succumbed to the color for her.It was a mistake. The camera's pictures are just OK, but it's strange, on the LCD screen all the pictures look blurry, so you just have to trust that they are sharp in the file.Its night settings are not great, but it does OK during the day (but honestly, how hard is that?).Also, the battery died in about 6 months, which seems to be a common problem, but Casio was quick to replace it for free.I also don't like how it's a proprietary cable to upload photos, instead of the standard USB cable. That means you have to search for that exact one each time you want to upload.Would recommend a canon elf/powershot instead, they have always done well for me.", "Date": "January 30, 2009"}, {"Title": "More then I expected", "Author": "Marie M. Christen", "ReviewID": "R27QF8VRHCXX2X", "Overall": "5.0", "Content": "I bought this camera for my daughter who is 9. I got a great deal on it due to someone returning it. At first I was weary of the fact that someone retured it. But I have fallen in love with this camera. Its extremely easy to navigate very light and takes great pictures. I have pretty much claimed the camera for my own now.. I have choosen it over my way more expensive camera. Now planning on buying another one for my mom for mothers day. I highly recomment it.", "Date": "May 3, 2008"}, {"Title": "A GREAT CAMERA !!!!", "Author": "Pratz", "ReviewID": "RWKWD7VF9D8G1", "Overall": "5.0", "Content": "I was given this camera as a gift some 2-3 years ago and I think this is such a nice, portable and cool camera and stylish as well. It takes amazing pictures, If you know how to shoot pictures...the only feature missing is the panorama but still everything is perfect in this camera.Check some of my images.", "Date": "June 15, 2011"}, {"Title": "Blurry, dull, grainy photos", "Author": "A reader/listener/watcher", "ReviewID": "R2QWEOSOGXKHQY", "Overall": "1.0", "Content": "I got this camera a while ago to have a small, slim camera I could fit into my pocket, prom bag, wherever and I could just use as a point and shoot. Well, it fits in my pocket, but that's just about it. I've only gotten a few good pictures out of this camera - the rest all turn out with dull colors, blurry, or grainy. Even if I was standing perfectly still with my subject not moving, it'd still be slightly blurry. (I have a shaky hand, but the other digital cameras I've had with anti-shake functions have fixed that - not this one). I am VERY disappointed in this camera...I'd suggest looking elsewhere.", "Date": "December 22, 2008"}, {"Title": "Great little camera!", "Author": "Katherine P. Caughran", "ReviewID": "R21W4JS0EICZE6", "Overall": "5.0", "Content": "I bought this camera after much research.  I have had it for 7 months and suddenly it wouldn't turn on the other day.  I called and they said they would send out a battery at no charge easy as can be.  So very happy with camers and customer service!  Takes GREAT pics and is very user friendly!", "Date": "December 3, 2008"}, {"Title": "Excellent!!", "Author": "Nicole Leboeuf", "ReviewID": "RQAA34B6RDVHX", "Overall": "5.0", "Content": "I bought this camera a few months ago, and I love it! I was looking for something that was simple to use, but still great quality, and this was perfect. The camera is lightweight and doesn't take up much space. The pictures come out clear, even zoomed in. Video quality is great as well. Overall, this is just my favorite camera.", "Date": "July 2, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000UX0DR2"}}