{"Reviews": [{"Title": "Too, too small", "Author": "Legallyblonde Legallyblonde \"QView32\"", "ReviewID": "R2HNPUZF1589BR", "Overall": "2.0", "Content": "This camera fits in the palm of my hand.  My fault: I didn't check the dimensions before ordering.  This camera is way too small to even be seen.  I pointed it out to my neighbor and he said \"Where? Where is it? I don't see it.\"  I was shocked at how small it is as the photos of it make it look like it's about 12\" long when it's really about 4 or 5 inches long.  Disappointed!", "Date": "December 8, 2009"}, {"Title": "Realistic camera", "Author": "C. Connolly", "ReviewID": "R1LW2QIUQWBMN0", "Overall": "5.0", "Content": "These are small cameras that do the trick!  They look real, and withthe small flashing light would fool any questionable characters around the outside of the house.  These are worth the small investment they require.", "Date": "January 14, 2009"}, {"Title": "Best Service !!!!", "Author": "NICOLE ABBOTT \"N.A.\"", "ReviewID": "RH07O9HGQKFSZ", "Overall": "5.0", "Content": "Ordered 2 Cameras. Product is excellent and well worth the small amount of money. When order shipped, they forgot to send 1 camera. Contacted them and it was the best service and quickest fix I have ever had. Could not say enough nice things about this company. Thank you for your excellent product and service. Nice to know there are great companies out there like you.", "Date": "August 17, 2008"}, {"Title": "It's a fake camera-it should be bigger", "Author": "T. Farkas", "ReviewID": "RJWI8KFORYKVT", "Overall": "3.0", "Content": "Even though the description does state the size of this (fake) camera, you have no idea how tiny it is until you mount it on a 10 foot ceiling in a parking garage. Fake cameras are a deterrent only if they are seen; and the flashing light is so dim it's hardly worth the effort. Would not buy again.", "Date": "October 13, 2011"}, {"Title": "Blinkety blink blink blink", "Author": "S. Kelley \"Oblate spheroid-shaped head and torso\"", "ReviewID": "R2FW6IWYAM7VPC", "Overall": "4.0", "Content": "Bought this item a few years ago. Believe it was at a garage sale. Same manufacturer and model number.I use high-quality AA batteries and obtain around 10 months of effective red light blinking before the light begins to slowly fade.The unit has a professional appearance, seemingly real and of high quality.You will need additional cable to make it appear to actually be hooked up unless you can mount it where the attached short cable can be shoved into a hole drilled into a wall or something.I use my fake camera inside, sitting on a shelf where an intruder, especially at night, is likely to notice the flashing red LED light.I rigged up an indoor AM radio antennae to make it appear attached to the \"camera's\" cable output, thus conceivably transferred to a monitor or recording device elsewhere... well, at least conceivably so.  Just to add to the illusion an intruder is either under observation or is being recorded.In a dark room at night the blinking red light sticks out akin to the proverbial sore toe. Or is it a sore thumb? Or that pesky third eye in the middle of the forehead I have seen in those Hairy Krishna books.How effective would this faux unit be at deterring a no-good-nik intent upon larceny? Who knows. I can envision the unit making an amateur run off upon seeing what appears to be an active camera in operation.I doubt a professional criminal believing there is real wealth within the invaded area would be deterred but if you have real wealth you likely can afford a real deterrent!!!The unit does not need to be attached to a wall to convey the illusion of or reality. Sitting upon a shelf or a desk can also be effective in creating the illusion of reality.", "Date": "March 5, 2009"}, {"Title": "GOOD CAMERA", "Author": "Batavia Machinery, Inc \"Batavia Machinery\"", "ReviewID": "RIROQSMRRZ9Y5", "Overall": "4.0", "Content": "LOOKS SO REAL THAT IT WILL KEEP PEOPLE AWAY FROM YOUR PROPERTY. EASY TO INSTALL AND BATERY LIFE IS GOOD UP TO 2 YEARS. KEEPS MY BROTHER FROM USEING OUR HOT TUB... AS HE THINKS WE HAVE SECURITY.", "Date": "April 19, 2007"}, {"Title": "sk review", "Author": "blueviolet \"SK\"", "ReviewID": "R2HLNO91DR0GC8", "Overall": "4.0", "Content": "The item looks very authentic and easily believable as the real thing!  The cameras look like the expensive ones I have seen in my bank and outside some local homes.  A good value for the money!!", "Date": "September 29, 2009"}, {"Title": "Fools people", "Author": "Scott E. Franklin \"ScottF589\"", "ReviewID": "R3V1EDXW9BAVSK", "Overall": "5.0", "Content": "I bought this because of the drug dealing neighbors. They think this is real and have taken their business somewhere else. The trouble making kids also stay out of our yard. Good dummy camera", "Date": "February 18, 2011"}, {"Title": "Battery Powered Fake Security Camera w / flashing red light", "Author": "Karin", "ReviewID": "R364UNXNCIQROQ", "Overall": "5.0", "Content": "I personally like the size of this Fake Security Camera.  It is small, yet visible, perfect for my needs!  The flashing red light, makes it so real.  I recommend[[ASIN:B00008US79 Control Products FSC-01 Battery-Powered Fake Security Camera] this product ... Karin", "Date": "January 23, 2010"}, {"Title": "Looks real!", "Author": "Complex Nurse", "ReviewID": "R2W4BEE7FJYPRY", "Overall": "5.0", "Content": "This is a great little \"fake\" security camera. Looks real and even has a blinking LED light. The battery compartment is completely hidden so it looks like it is wired. Very easy to install.", "Date": "November 11, 2009"}, {"Title": "As Advertised, good product", "Author": "L. Muzzin \"Lmarco62\"", "ReviewID": "R3UX4YOGJ8X48W", "Overall": "4.0", "Content": "Installed quickly and looks very real. The blinking LED could be a bit brighter but overall should be a good deterrent.", "Date": "February 26, 2009"}, {"Title": "HIgh quality fake camera, the shell is not from a real camera", "Author": "Stan Lam \"Stan Lam\"", "ReviewID": "R2Z99R15A4SCFL", "Overall": "3.0", "Content": "I purchased 4 different types of fake video camera with blinking LED's.  I have to admit the blinking LED on this one is made the best by far.  The LED light is controlled by a circuit board inside the camera.  Therefore, if somebody took this fake camera apart, they might think it's real.  Somebody stated the battery life on this camera is 2 years.  I don't believe 2 years, but 1 year is believable.  The reason I think the battery life on this camera will last a whole year is because the LED is not that bright. You cannot see it in the daytime.The camera shell is made of metal, so it's very high quality.  The biggest compliant I have about this camera is the shell does NOT represent a real camera shell.  If you look around, there are other fake cameras that have a shell from a real camera.  The other complaint is it is really small.  I would recommend this camera if you are going to place it a few feet high, because if it's to high, you can't see it.  Even from 3 feet away, I think this camera looks real.  Last thing..... I'm 99% sure this camera is NOT rain proof.", "Date": "August 21, 2010"}, {"Title": "Too small", "Author": "Charles \"Charles\"", "ReviewID": "R1TEM61G1VP98E", "Overall": "2.0", "Content": "Does not look like a real one. Make sure you know the size before you order it.", "Date": "April 17, 2009"}, {"Title": "Look so real, NOBODY can tell!!!!!!!!!!!!!!", "Author": "kellyann", "ReviewID": "RMF48M51LUXH", "Overall": "5.0", "Content": "I purchased the last ones for friends,our town has been having a LOT of breakins. And I told my friends to use these, that I have them and I love it!  And the batteries have already lasted 11 months and going strong. I may be buying more very soon!!!!!", "Date": "April 3, 2013"}, {"Title": "ITS OK BUT TOO SMALL!", "Author": "larry", "ReviewID": "RGRYAZED3YGKS", "Overall": "3.0", "Content": "This is a very NICE camera,BUT it is way too SMALL it would be nice if they were bigger so you could see it better!", "Date": "December 30, 2011"}, {"Title": "Pseudo Video Camera", "Author": "Herc", "ReviewID": "R2ECX48Q4Z0KMU", "Overall": "5.0", "Content": "They worked well right out of the box, LED has been blinking ever since, it really does the job for me, no problems.", "Date": "December 1, 2010"}], "ProductInfo": {"Price": "$34.99", "Features": "Realistic looking camera keeps intruders away\nFlashing LED makes intruders believe camera is \"operating\"\nWeatherproof, annodized aluminum housing means years of rust-free operation\nPan and tilt adjustment with mounting bracket and hardware included makes for easy installation\nIncludes a security decal to warn trespassers \"area is under video surveilance\"\nLow Maintenance\nPan & Tilt Adjustment; Security Stickers Included;\nDummy Camera With Led", "Name": "Control Products FSC-01 Battery-Powered Fake Security Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41BNfqf1qOL._SY300_.jpg", "ProductID": "B00008US79"}}