{"Reviews": [{"Title": "Great camera, just be aware of its pros/cons", "Author": "Tarrant \"Neocount of Merentha\"", "ReviewID": "R1Y60K81QCYP1I", "Overall": "4.0", "Content": "This is a great ultracompact camera. You just have to be sure it's right for you.PROS:1. It's optical image stabilization feature really does work, and works well. 2. Flash range is acceptable for a camera this size. 3. Boot-up time is very fast, shot-to-shot time is quick for a subcompact. 4. The 2.5 inch LCD screen is gorgeous. 5. Camera can take 6 megapixel 3:2 format pictures (great for 4x6 prints). Compare that to C_n_n's line of cameras, where their 3:2 \"postcard\" format is limited to a resolution of 1600x1200, which isn't even truly 3:2.CONS:1. Noise in pictures is noticeable at higher ISOs. It seems to be a problem common to all Panasonic Lumix cameras. This is only a problem and noticeable if pictures are shot at higher ISOs (400 or more), or if you print pictures out at larger sizes (8x10 or more). It's not a problem at 4x6 picture sizes. 2. There's also no optical viewfinder (only an LCD). 3. To recharge the proprietary battery, it must be removed from the camera and placed in its battery charger. 4. Finally, no date imprint picture (ie. you don't get a date stamp on actual picture, but you can tell it to print one when printing directly to a DPOF printer).", "Date": "November 23, 2006"}, {"Title": "Delighted with my new camera!", "Author": "Cynthia L. Lotz \"digital camera novice\"", "ReviewID": "R2Z1WZFXZE5UAS", "Overall": "5.0", "Content": "I've spent 3 years shopping for a digital camera.  I had a hard time committing, because I couldn't decide which features were most important to me - would compact size be more important (so I could carry it with me anywhere)?, or would I be happier with a larger camera (with a better optical zoom)?  And, I really wanted to spend less than $300, but the cameras I was considering were often $350 or more.Canon has a good reputation, so I borrowed a friend's Canon SD600.  I was disappointed in the quality of some sunrise shots - you could really tell this model had no image stabilization.  Next, I borrowed another friend's Canon SD700.  This seemed to be a nice camera, which offered the optical image stabilization.  This model had a few more bells and whistles than I needed, but the biggest cons were that it was only available online, and it was a bit cashy.  So, when it came time to make my final decision, this Panasonic had it all.  Pros include: 7 megapixels means I can take a shot and then \"zoom\" and crop it on the computer without sacrificing quality; the optical image stabilization works great; it slips easily into a pocket; battery life seems to be great; picture quality has been OUTSTANDING; 2.5\" screen is a great size.  Another plus:  a \"simple\" mode, which limits the number of settings you can change(which is great for a novice user), or a standard mode which gives the user more control over manual settings.  The camera is VERY user friendly, with an on-screen description available for the 19 different scene modes that helps the user understand the best use of each mode.  I've printed an 8x10 shot of our family from Christmas, and the colors and cripsness of the photo are unbelievable.  Sunrise and sunset shots are both great quality, with clarity and coloring that are unbelievable.  AND, I really love the burnished red finish on the camera too!The only con I've found so far is that the flash does not seem as effective as Canon's models - but, in the few shots I've taken where that's been an issue, I've been able to correct the problem with photo editing software.I highly recommend this camera, and can say without hesitation that it has surpassed my expectations.  Accessories that I'd recommend would include a 1 gig SD card, and a spare battery so you'll always have one charged and ready to go.Update - bought this camera in December 2006, and 2 years later I'm still thrilled with it.  The compact size means I can carry it everywhere - it fits in the cell phone pocket of most of the purses I own.  Battery life is still great.  I continue to think this is a great camera, especially for novice users - especially with the price down so low.", "Date": "January 5, 2007"}, {"Title": "Great camera for price", "Author": "TC \"Westcoast\"", "ReviewID": "R2HFUTP7XTCPV8", "Overall": "5.0", "Content": "I had reservations about buying this camera after reading the few negative reviews citing excessive 'noise' with low light situations and certain ISO settings.  Knowing I would mostly be using the more simplified features the majority of the time, and given all the generally positive reviews by others, I decided to give it a try. I must say I am very satisfied with the camera.  Granted, I generally use the normal or simple mode for most shots, but have used all modes several times since purchasing the camera and it takes wonderful shots, indoors and out, low light and bright sunshine.  The user manual is very easy to understand and gives setting suggestions to correct some of these noise problems. I have not had any negative experiences with it.  I bought it as a replacement for an Olympus Stylus that I damaged on a ski trip and although that camera was a great point and shoot and took nice pictures, this Panasonic is far better.  Combine that with compact size, sturdy build and good looks and you have a great camera.  I bought the leather Lumex case that Amazon sold with it as a bundle and it is very good quality leather and snug fitting so as not to add bulk to the compact size.  Nice item.", "Date": "March 30, 2007"}, {"Title": "One of the best", "Author": "Pink Panther", "ReviewID": "RVM4KAGX3H0X5", "Overall": "5.0", "Content": "This camera is one of the best of its kind: ultra compact, great quality of construction, friendly menu, excellent lens (thanks to Leica) and a very attractive price.It peforms according to the Leica reputation, extremelly well.  The image stabilization boosts the end results.  However do not expect results similar to more expensive srls as you will be disappointed especially in cases of 8x10 or even larger images as noise becames a factor- for smaller images you should have no problems and you will be able to capture your moments with ease.Again this is one of the best choices for a compact digital camera in a market segmant that there are plenty of options.", "Date": "March 27, 2007"}, {"Title": "Pictures seem really dark to me...", "Author": "Zebulon5", "ReviewID": "R2HDLAC5KTIVUL", "Overall": "3.0", "Content": "I just got this camera, was upgrading from my 4-year-old Canon Powershot S400 digital Elph, looking for the image stabilization feature and more megapixels. What I don't understand is why all my indoor photos are so dark. I prefer to shoot without flash, and with the Canon, the room could be very dimly lit and I'd still get a photo. With this camera, even changing the exposure doesn't help. I took close-ups of the lights on my Christmas tree--with the Canon I got photos with a lovely glow to them, and with the Panasonic I got a lot of black. I tried the \"candelight\" setting and the \"party\" setting, and neither helped. Not sure how to fix this.Everything else seems to work fine.", "Date": "December 26, 2006"}, {"Title": "My second Panasonic digital with Leica lens", "Author": "STL Daffodil \"Jacki\"", "ReviewID": "R2T4ZZUOER78VR", "Overall": "4.0", "Content": "The Leica lens was a great bonus for my decision to add another camera.  I love the size.  My other Panasonic/Leica camera took several falls on a long trip and never stopped performing.  It is discontinued, so it is now held together with duct tape.  This DMC-FX07 is a wonderful replacement.ps.  I bought a cell phone belt case that is leather with magnetic closure for a perfect camera case.  ($[...])", "Date": "March 9, 2007"}, {"Title": "Panasonic DMC-FX07R 7.2MP Digital Camera", "Author": "David A. Weinstein \"as seen through eyes of p...", "ReviewID": "R2S5EYVX5FEU1K", "Overall": "5.0", "Content": "This camera is the best point and shoot cameras for the money. Just think of what you are getting. Not just a 7.2MP camera, but a LICA lens and technology. Not a bad deal. The images are not bad when printed. On a scale of 0-10, 10 beining the best, I give this camera an 8.David the photogIn Chicago", "Date": "February 22, 2007"}, {"Title": "Unacceptable noise in any environment", "Author": "X. Sorin", "ReviewID": "R24O0VV1F0JSA0", "Overall": "1.0", "Content": "I was extremely dissapointed with this camera, and I'm by no means a pro photographer. My previous camera is a Canon A40 2 MP purchased over 3 years ago. Comparing the two was surprising. Despite the Canon being 2 MP vs. The Panasonic's 7 MP, The Canon takes sharper pictures with less noise. I tested this both indoors with and without flash, and at even a 100 ISO setting on the Panasonic. Also comparing outdoor shots in full daylight, there is very noticable noise in the Panasonic's pictures, even in a 4x6 print. The photos it takes are just hopelessly noisy. Even resizing them down to 2 MP, the pictures from the 3 year old Canon are still sharper and more detailed. I really wanted to like this camera. It's 1/3rd the size of the Canon, but so are a lot of new digital cameras. The control layout is well considered, and I could even operate it with a ski glove on. The terrible picture quality is simply a non-starter.Pros:- Nice controls and interface, good build quality.- Best in class movie mode (848x480, or 480p widescreen)Cons:- Terrible noise in any environment, even outdoors in full light.- Takes worse photos than my 3 year old Canon A40 2 MP.", "Date": "December 26, 2006"}, {"Title": "Like Night and Day", "Author": "N. S.", "ReviewID": "R1WR9WSYFERZTJ", "Overall": "4.0", "Content": "Like many of the reviews before mine, I had terrible amounts of noise in most lighting conditions and some of the pictures came out so dark they were practically illegible.  It was so bad that I was convinced that the camera was defective so I sent it back to Amazon for a replacement.  There is just no way that a manufacturer can produce a product this bad with all the choice we have... it must be broken!Sure enough, the replacement they sent me takes decent pictures.  Its not going to give you pictures as clear as many larger (compact) cameras, but for the average photographer who wants an ultra-compact camera it works just fine.  The menus are intuitive and easy to master.  The image stabilization works great.  The best feature is the wide angle lens.  Everyone always is concerned with zoom.  I have a 2 year old Casio Exilim and a 4 year old Canon Elph and I never realized how much of the pictures were being cut off.  This lens allows you to frame pictures much more easily, especially up close.  The movie mode works great and the 16:9 format is nice for playback on your TV.I'm not sure whether recommend this camera or not.  Everyone that sees it thinks its great.  Its fun to use, solidly built, fits well in your hand and takes nice pictures.  If you're willing to take a chance, it really is a very nice camera.  Seems like Panasonic has some quality control issues to work on.  For now, no complaints.", "Date": "January 4, 2007"}, {"Title": "Panasonic DMC-FX07K", "Author": "TravelPro747", "ReviewID": "RAVS4UG75WXXH", "Overall": "5.0", "Content": "This camera is a pleasure to use. The size is perfect for travelers who prefer unobstrusive and bulky SLRs. Not to mention the fact that it takes great pictures.  The 28mm wide angle lense is unique in the price range of the FX07. It is a little noisy in the higher ISO speeds but if you want something better (perfect in higher ISOs) you'll have to dish out hundreds more and step up to the digital SLRs. If you're looking for a great camera at a bargin price, then the Panasonic is for you.", "Date": "January 19, 2007"}, {"Title": "FX07 Red 7.2MP Digital camera from Panasonic", "Author": "L. Ellzey", "ReviewID": "R2SRLNBQFVXFQQ", "Overall": "5.0", "Content": "In any color, this is a great little camera for the money.  I just wish a larger optical image stabilized zoom would be available on such a tiny camera--maybe one day.  I have taken quite a lot of pictures since I received this camera and it has done a great job under most circumstances except extreme low light.  There are times when I had to change from auto flash to no flash to maximize picture quality. There are several choices to use. I am still learning how to use some of the advanced features.  I would say this is a great little lightweight camera that fits in a purse or pocket with ease.  I got lots of compliments on it on a recent trip to Europe.", "Date": "January 9, 2007"}, {"Title": "Really a 5 megapixel camera, no matter what it says...", "Author": "Kazuaki Shimazaki", "ReviewID": "R3F5ZHIB7VKVUX", "Overall": "2.0", "Content": "I know that almost every critical review on this camera talks about the noise. I don't have a FX07 myself, but my boss has one that I used for office work after my Canon A85's CCD crapped out after 3 years of rigorous service.There is normal noise and then there is FX07 noise. Normal noise (at low ISO anyway) is manageable - throw image into Noise Ninja noise reduction program, Auto-Profile, set Chrominance filtering to Max, fiddle around with Luminance filtering, process, save. Rinse and repeat.At low ISOs, the FX07's noise is coarse and non-uniform. Which blows the Auto-Profiling - the Luma and Chroma noise level readings come out low - the noise is too coarse to be recognized. Even with maximum filtering in Chroma and Luma, you see lots of huge individual noise specks. So you run up the \"Smoothness\" to squelch them (like the program recommends) and lose half the detail in an photo. That's at ISO 100.At higher ISOs, say oh 200 or 400, the noise is even coarser and more uniform. Luma and Chroma estimates remains low (for the ISOs), but the noise covers up the image in huge coarse grains. Any attempt to recover detail from said grains is futile. The image details don't just turn \"plasticy\", they are obliterated.Results at ISO800 or 1250 are unusable, but since that's true of even a Powershot G9 I guess I shouldn't complain about that - it's the poor low-ISO results that are the killer.After some painful lessons, I came to the conclusion that this is at best a 5MP camera (even at low ISO), not a 7MP. By admitting this fact and setting your camera to 5MP, the noise grains become small enough that Noise Ninja actually recognizes them as noise (the measured noise levels actually rise) and you can squelch them without destroying the image. If the image was taken in 7MP, the only real chance for usability is to scale it to 50% - that is turning it into a ~1.8MP image before putting it into Noise Ninja (Noise Ninja NR is theoretically done before downsizing but theory obviously did not factor in the Lumix FX07).On the positive, it is a OK 2-5MP camera. It is small, colors are good, optical stabilizer works - just read the 4/5 star reviews. But do you want to pay the listed price for a 5MP (at best) camera? As for me, after 4 months of the above torture I went to buy a Canon G9 camera for use at work and home.", "Date": "December 3, 2007"}, {"Title": "Good compact camera", "Author": "Himanshu Virkar", "ReviewID": "R1Y4H3VXZHMAK9", "Overall": "5.0", "Content": "This is an amazing compact camera, with all the wanted features. I was looking for a camera that is compact and has good optical zoom as well as takes gr8 pictures. I was stunned by how much this little thing can deliver. It's just too amazing...I would definitely recommend it.PS: There are lots of better camera available with similar or better features, but they come at a large price.", "Date": "February 22, 2007"}, {"Title": "Great Camera With Enough Light", "Author": "Binghamton Bookworm", "ReviewID": "R1NNLA9DD5U1O5", "Overall": "3.0", "Content": "Outstanding camera that takes great photos when there is enough light, or when flash is used. In low light without flash, such as indoors with ISO 400 or 800 set, or outdoors at twilight, the photos contain too much noise. Can't seem to find a setting that works well for low-light photography. My old Canon A70 does better, though it's much bulkier. The lens stabilization on the Panasonic is a great benefit and works well.", "Date": "February 21, 2007"}, {"Title": "Good with 2 Major Flaws!!!", "Author": "ShadyG", "ReviewID": "RXUJ4HFG7K5ZT", "Overall": "3.0", "Content": "First let me say that this is a great P&S; camera, but.....1. There is a MAJOR problem with noise on these LUMIX cameras above ISO 200. On your screen they look great but they have a terrible noise reduction system that makes the pictures have a \"paint splatter\" effect. Who cares about I.S. lenses if the noise, not the blur, destroys the images.2. There is a serious lack of manual controls for a camera of this quality and price.I own this camera and DO like it but wish it didn't have these problems.It DOES take great video(which oddly has LESS noise than photos in low light).You can find articles about the noise issues online if you look.Thanks", "Date": "February 17, 2007"}, {"Title": "Does what they say it does.  Too well", "Author": "J. Kirlin", "ReviewID": "R3KDTXK5TISCH7", "Overall": "3.0", "Content": "I really wish camera manfacturers tried to like me as much as I try to like them.  I bought this after needing to replace the Panasonic FX01 (Saint FX01) which was the perfect camera.  Light, easy to handle, very sharp images, low noise.So someone at the Panasonic Staff meeting stands up and says, \"Let's take the perfect FX01 and add a noise reduction feature to make every photo look like an oil painting at 100% even at 100 iso!\" and no one stops him?They have ruined this camera and possibly this FX (0 through 1000) line of cameras if they all have that same noise reduction feature.The plus side?  It processes images faster than the new Panasonic TZ3 which is so slow it must run on vacuum tubes.", "Date": "June 27, 2007"}, {"Title": "Must have got the defective product.", "Author": "Travis rose", "ReviewID": "R17EB1L0YMVB8L", "Overall": "2.0", "Content": "Well. I was convinced the FX07 was a bad product after using it for 6 months. Like a lot of other reviews have pointed out, the noise level in low-light condition is annoying, and give you a watercolor-like effect. Some pictures I took during a visit to Monterey Bay Aquarium turned out completely dark (to prevent this beforehand, I even took photos of the same objects using several different settings, only to get the results of bad, worse, and worst). The picture quality is nowhere close to my old old old Sony cybershot T7. I was totally disappointed. If not for my T7 was broken, I wouldn't even wanna use this camera. Even re-sell it to other people, I would feel it's like a crime.After revisiting this webpage and read more user reviews, I realized I must have got the defective item from Amazon. Well. What can I say? It's been 6 months.Bottom line: Just be careful when you received this item. Do some test shots. If anything looks suspicious, ask for a replacement. After all, all the high praise here can't be all wrong.", "Date": "April 25, 2007"}, {"Title": "Not great quality,", "Author": "Zuri", "ReviewID": "R163FCDKA9SXEN", "Overall": "2.0", "Content": "I just bought this camera and I regret it because now I have to pack everything up and return it. The pictures are not crisp and clear and there is too much noise. I have compared the pictures with pictures taken with a Sony CyberShot and the Sony pictures are much clearer.This is a good camera if you don't really care to have the BEST quality. The pictures are nice but not clear. You're better off with Canon, Nikon or Sony.", "Date": "February 13, 2007"}, {"Title": "Can be noisy - but can also be great.", "Author": "Brad B", "ReviewID": "R1B8J314WYFCMC", "Overall": "5.0", "Content": "Reading the reviews of this camera reminds me that cameras are tools.  An imperfect tool in the hands of a master is much better than a perfect tool in the hands of a amatuer.  I am not a master, but I do appreciate this camera for what it can do and what its limitations are.  When you use ISO settings higher than 200 you will see increased noise.  I think it is a great little camera and I have used it a lot on my latest photo project.  Keep in mind one of the assets of this camera is its small physical size.  This also means small optical lens = less light gathering ability.  There is no way to compensate for this in the camera - so know this is a limitation and deal with it.", "Date": "February 22, 2007"}, {"Title": "Perfect until....", "Author": "R. Mora", "ReviewID": "R1U7LZCY9BVP3Y", "Overall": "4.0", "Content": "I wanted something with a decent optical zoom that fit into the 'micro' category to take on a vacation.  It fit the bill perfectly until it stopped working halfway through the trip.  No explanation on what happend.  I took it back for servicing at the store where I purchased it and have not had a response back.  Therefore, I cannot comment on what the fault may have been.I can, however say that while the camera was functional, it performed very well.  The camera does not have a view finder, but that does not stop you from getting accurately framed photos.  The lcd screen is large for the overall size of the camera.  The special picture modes that were used gave good results when used for the appropriate situations, e.g. scenery, night time portrait, party, night time scenery.The photos themselves turned out to be of very good color balance and detail.  No complaints there.  In fact, the only reason that I deducted a star is because of the unexplained breakdown.  If there is a problem with the replacement, I will come back and deduct more.In summation,  excellent camera for size, zoom capability for size, and piture quality.", "Date": "July 29, 2006"}, {"Title": "Lasted 2 years", "Author": "Ann Hawthorne \"Ann\"", "ReviewID": "R2E2WI8SV8HI5S", "Overall": "2.0", "Content": "I was hoping to have a good quality, very portable digital camera to capture the precious moments of my babies' early years.  After 3 months it was dropped and I sent it in for repair (covered under warranty) and it was returned good as new.  We've used it a lot.  Now I charge the battery, insert it into the camera, and the camera turns on for a second, then turns back off.  Unresponsive.  Dead.  Tried new battery.  Nothing.  Repair costs more than what I paid. It was a great camera...  I was just hoping it would last more than 2 years.", "Date": "August 8, 2009"}, {"Title": "I wasn't very impressed", "Author": "Lindsy", "ReviewID": "R25W2IH7TMHGP1", "Overall": "2.0", "Content": "This died on me at just about the 3 month mark. I was taking pictures with it one morning and then hours later went to turn it on and nothing.Even before that I was kind of upset with myself for giving in and buying it because for the price, it's not really great quality. The noise is far above what is acceptable to me. I understand most cameras will have noise troubles in low light settings, but even in bright sunlight my pictures were not crisp.One feature I loved was the relatively sharp and clear and large-sized videos (though unfortunately the large viewing size also means a large file size).Unfortunately since my camera killed itself inexplicably after so short a time (and conveniently right after the warranty ran out) I cannot say I was pleased.I've much preferred the Sony cameras I have used and I love my Nikon SLR. But I love really clear pictures with beautiful color. And this camera--doesn't have that.", "Date": "September 4, 2007"}, {"Title": "easiest, cutest camera Ive ever used!", "Author": "Danielle Pelletier \"garden girl\"", "ReviewID": "R1SLISMZF3VUPZ", "Overall": "5.0", "Content": "I found these reviews that customers wrote to be very helpful in my pursuit of buying a digital camera. I was looking for something that was small, so that I could bring it with me wherever I went, and something that was going to be easy to use. I also love to color options that are available becuase I like to be different. This camera is very user friendly, weather you are making your way through the buttons yourself or are reading the manual, which is actually very easy to understand. I haven't used all the options on the camera yet, I basically bought the camera in order to take some snap photos of my friends and to post items on ebay. So far, everything has been a success and I would recommend this camera to anyone who is looking for a camera that is going to be user friendly, and take a great picture without having to be an expert.", "Date": "March 8, 2007"}, {"Title": "Well built, good for older technology", "Author": "J. Capobianco", "ReviewID": "R24TEZLPAPUAXF", "Overall": "4.0", "Content": "Got one of these on Ebay that was frozen up for $7 with battery!It was well used, but by taking off the top, re-assembling and hitting reset in the menu it was good to go. This camera focuses quickly and has a good lens. Shots taken at full telephoto remain sharp unlike the fx500 or fx37 which are soft at their tele settings. Video in wide format is Very good and keeps 28mm without cropping.. It is grainy at iso200 and above, but thats to be expected with a 4 year old design and processor. The iso200 images look better from this camera than the brand new zs8 anyway. Very well built, wish panasonic still made them this sturdy-they don't anymore.", "Date": "December 13, 2011"}, {"Title": "Great little camera", "Author": "J. Kirkpatrick", "ReviewID": "RQYJBBCO4IX23", "Overall": "5.0", "Content": "Great little camera.Its a little point and shoot.Does great. Had it for 3 years now.", "Date": "March 6, 2011"}, {"Title": "One of the best!", "Author": "CollegeProf", "ReviewID": "RZEGIV5JYEDHX", "Overall": "4.0", "Content": "I am a Realtor and needed a camera that would allow me to take full wide shots within and outside the home. This camera does that and more. The picture quality is great and it allows other Realtors and home buyer viewers to see larger areas of the home and found within the MLS. There are many great features in this camera that I have only begun to use. If there is one con, it is the fact this is a small camera, and I am sure that I will lose it before too long.", "Date": "January 9, 2010"}, {"Title": "Yayaa", "Author": "P. guardado", "ReviewID": "R1PYNSZLFG8RMQ", "Overall": "5.0", "Content": "Honestly, I thought it was going to be a piece of crap.But surprisingly it wasn't. :)I lost mine like before December..The very same model... so, I had tobuy a new one... :] i LOVE IT.", "Date": "May 27, 2009"}, {"Title": "Great pictures and very sexy", "Author": "J. A. Thompson", "ReviewID": "R3OO68MSPNOSDB", "Overall": "5.0", "Content": "I love this camera!  It has a simple mode which takes great pictures for times when you don't have time to pose and it has customizable features for those times when you can play around with the settings (and/or you are an expert).  Excellent color quality, no fuzziness so far, no complaints that I can think of.  Well, I am having trouble having the camera recognized using Linux but that is just me probably.  This camera is well worth the modest price.", "Date": "March 25, 2009"}, {"Title": "Impresses everyone", "Author": "Claudia", "ReviewID": "R1K3H1NG7FLC8W", "Overall": "5.0", "Content": "I've been using this camera for 2-years now, and I have never had any problems.  Everyone who borrows it is impressed!  Panasonic is not the leading name in digital cameras, but this is a really great, simple to-use camera.", "Date": "March 22, 2009"}, {"Title": "What a piece of Junk", "Author": "Electronics lover \"Picky techie guy\"", "ReviewID": "R2KKYL326YNM1C", "Overall": "1.0", "Content": "I must have gotten a defective product from Panasonic but I would never believe Panasonic Quality was so poor on cameras.After 9 months of owning it (and less than 20 times of use, approx 600 shots) the camera started to become non responsive to teh on-off switch. I sent it to Panasonic for repair under warranty and it came back working well. It stayed in a drawr for another 6 months, then I used it for another 50 shots and the problem is back again, the camera is death. Unfortunately warranty expired so I have a nice paper stand for my desk.", "Date": "February 22, 2009"}, {"Title": "Panasonic Lumix DMC FX07", "Author": "E. DESIMONE", "ReviewID": "R3SA1FRM9O5KD4", "Overall": "5.0", "Content": "this is my second Lumix - LOVE the ease of use, portability, multiple options for taking photos, ease of download to pc, long battery life - Highly recommended.  Still learning the many functions!", "Date": "February 2, 2009"}, {"Title": "Not as good as a sony (or is it?)", "Author": "Mr. P. M. Tasker \"pmtask\"", "ReviewID": "R2RSKHIIWTOBN2", "Overall": "4.0", "Content": "When I got this I took a series of pictures inside with flash/no flash and compared to my old sony cybershot P150.When I looked at images on camera screens I was suprised. The sony's looked better when I zoomed it in. Sharper, less noise.However when I uploaded them to PC I found sony's may have less noise and were slightly better with flash. But without flash the Fx07 was the best. All shots in focus and sony's were blurry. Image stabilisation is great for when you can't use a flash inside.Also, after experimenting with a few settings (switch slow shutter speed to 1/4 or 1/2 (not 1/8) and images were no longer dark in low light. Better still is intelligent ISO which does all this for you. Most of the time it will pick something sensible that results in a reasonably quick shutter speed to prevent shake and acceptable ISO so not too much noise. Hint avoid ISO 800/1250 if possible. Photo's are very noisy at these settings. 400 is OK, 200 better, 100 brilliant but only really can be used outside.Seems good so far, gonna have to take it somewhere nice and try it outside.", "Date": "April 3, 2008"}, {"Title": "over-rated", "Author": "Lynn \"Lynferd\"", "ReviewID": "RVFEZ95ZPQ20F", "Overall": "3.0", "Content": "I must say this camera has been a huge disappointment.  The noise is terrible as has already been mentioned.  Ease of use is very simple though.  I'm going to have to save this for just video.  Does a decent job of that. I bought it because the wide angle is a very nice a feature & when I was looking  at point & shoots a year a so ago there wasn't a whole lot out there.  That has changed a bit.If picture quality doesn't matter to you, than go ahead & buy this camera.", "Date": "April 2, 2008"}, {"Title": "Wonderful little camera", "Author": "Nana \"Gloworm\"", "ReviewID": "R1X7DP20PYU86C", "Overall": "5.0", "Content": "Panasonic DMC-FX07R 7.2MP Digital Camera with 3.6x Optical Image Stabilized Zoom (Red)I have own this fabulous little camera for over a year now and I just love how well all of my pictures have turned out. I read in some other reviews how it doesn't seem to do well when it comes to places with limited light. I beg to differ...in Feb. 2008, I went to the rodeo to enjoy the show and and concert. For those of you who have gone before to a concert at the rodeo, you know just how much light is displayed and usually if you try to pictures and/ or record it, the quality is very poor. However, with this little camera, not only were my pictures clear and well-lit, the two video clips I did at the concert came out awesome! I just couldn't believe how clear the bnd looked from where I was sitting and later when I uploaded it to my computer, you could clearly hear all the words of the song being sung. This had been my first time using this option and I just wish I had started using it sooner.So for those of you who are interested in purchasing this camera, you will not regret it. For being such a tiny camera, the outcomes of pictures and video will leave you pleased.", "Date": "March 11, 2008"}, {"Title": "love it..", "Author": "julia", "ReviewID": "RIN1EAQDGSQB2", "Overall": "5.0", "Content": "I am very happy with this camera, it's way better than any of my friends cameras (besides my brother who has a $1000 dig slr!)...I used this camera to take photos for album art for a band and it looks very professional.  I got it because it takes such great close ups.  Sometimes I'm annoyed at the \"glowing eyes\" my dog gets when taking a picture of her...but otherwise it's great.", "Date": "December 1, 2007"}, {"Title": "PANASONIC DMC FX07 BROWN.", "Author": "Jeffery B. Vu \"kool100vr4\"", "ReviewID": "R1LLG4ZFW8P8GB", "Overall": "4.0", "Content": "I got 4 DSLRs, so i need a small camera to beat around and pocket spy cam, so i've study a lot of diff models, there are a lot of choices out there on tiny cams.I want a tiny , thin, small, and a must have wide angle, which i use more than tele, i ended up with FX07 in brown color, its made in Japan, metal body, very nicely built, good quality, got Leica lens with OIS, lens is 28-102mm and video mode, plus a metal mount for tripod, i must have shot over 300 shot by now, im very please with the sharpness and colors, its got built-in noise reduction, its really helps the noise, but a bit smeared in shadow end, colors are great, but on a bit pinkish, i use normal color set up, its very easy to use, just point and shoot, got auto iso, battery life is very good, i use a 2gb sd card in it which can shoot up to 535 shots in 7mp mode.In all im very happy with the FX07, i paid 124$ plus shipping, therefore i have no complains at all, a great buy for any one..Now i can put it in my pocket and go any where and shoot..I bought this for my bow elk hunting trip, i can also video my hunt, and not to worry about my big dslr in the backpack..buy it...", "Date": "November 2, 2007"}, {"Title": "Amazing!", "Author": "S. BOWER", "ReviewID": "R34Q8WA2LS3L7H", "Overall": "5.0", "Content": "This camera is absolutely amazing. In the 3 months I had it, I got some amazing shots with it!! My original unit was stolen but I'm definately getting a replacement in the same model!", "Date": "October 12, 2007"}, {"Title": "great camera", "Author": "leica lens liker", "ReviewID": "R3MFCIPFNFYLWC", "Overall": "5.0", "Content": "easy to understand this camera - took one night to go through manual. Great pictures, long battery life and 150$ cheaper to buy in US than Canada!It's been a couple of years since I last upgraded digital cameras and the quality is leaps and bounds beyond my old canon A75.", "Date": "September 19, 2007"}, {"Title": "Fantastic Point and Shoot", "Author": "David Flaiz", "ReviewID": "R3TPRIX9FF2U7G", "Overall": "5.0", "Content": "I bought this camera after reading a positive review by Cory Doctorow and I have to say it was a great camera.  I say \"was\" because about two months after my purchase it was stepped on by a cow.  That aside, I intend to buy this camera, or another in the same line again soon.", "Date": "August 21, 2007"}, {"Title": "Not good for video/audio", "Author": "Francis Force", "ReviewID": "R37U850VRWMKHT", "Overall": "2.0", "Content": "I bought this camera a while ago mostly because I heard it was decent for recording video.  What I found was that the video picture is fine but the audio has major noise problems.  The microphone has so much noise that it is basically worthless as a video recorder.  I didn't expect anything fantastic, but I have a fairly old/cheap casio exilim that records much better audio.  The camera takes decent still shots but don't plan on recording any kind of audio.  If I knew how bad the audio was I would not have purchased this camera.", "Date": "August 15, 2007"}, {"Title": "Panasonic Digital Camera", "Author": "Mary L. Clark", "ReviewID": "RQJF2T6PZVT7V", "Overall": "5.0", "Content": "I Love this camera. Takes perfect pictures even in bright sunshine or in shadows.It is compact and great for purse or pocket. I ordered a matching case on  ebay and it is exactly what i have been searching for. I couldnt be more pleased.", "Date": "August 6, 2007"}, {"Title": "Great Camera", "Author": "Ashley Chadwick", "ReviewID": "R1PPGUA1YDW8ZS", "Overall": "5.0", "Content": "Was a little apprehensive to purchase after reading negative reviews about the noise but found it to be nothing but a great camera.  it takes amazing shots and can avoid noise in automatic mode.  sturdy build, great size, long battery life.  I'm pleased!", "Date": "July 27, 2007"}, {"Title": "Excellent & Inexpensive", "Author": "M. J. Muller \"MJ Muller\"", "ReviewID": "R1WBLQQ0UAUYDA", "Overall": "5.0", "Content": "I should preface this by saying I love my film camera and I have been dragged into the digital world kicking and screaming.  However, I'm a photographer that can appreaciate good equipment, be it digital or traditional.I really love this camera.  The Leica lens is tack sharp (with the exception of low-light) and the color saturation is very accurate (sometimes almost too intense).  For a point and shoot, this camera is a great investment for the money.The only drawback: I don't like the fact that you have to hit an image stabilization button prior to use.  I would rather it be a constant setting.", "Date": "July 12, 2007"}, {"Title": "Noisy but cool...", "Author": "Evan Jacobs", "ReviewID": "R3FPX45S0YGMWZ", "Overall": "3.0", "Content": "I read the reviews and decided to throw $200 at this one and see how it looked!  Well, it's a pretty camera.  The red is nicer than I'd expected.  The wide lens is nice.  The field of view is just great.  My first impression upon looking at some pictures at high res...well, there's a TON of noise even at 100 ASA.  Yow, that's a lot of noise!  Way beyond what I would have expected.  I definately wouldn't want to use this as my only camera.  For an inexpensive point and shoot, it may be fine though.  When I have time, I'll shoot some comparisons with a few of my cameras so y'all can see what I'm talking about.It definately doesn't even remotely compare to my Canon 5D, but come on, why should it?  The bummer is, I don't think it's even going to hold up to my Olympus Stylus 700.  I'll test it and see.Still, it's a slick little camera and you can't beat the price.", "Date": "May 25, 2007"}, {"Title": "This is such a hot camrea and it takes out of this world pics", "Author": "ADF \"ADF\"", "ReviewID": "R3N024HVXU5BID", "Overall": "4.0", "Content": "i just got this camrea from amazon it is soo good the only flaw is and i wouldnt even call it a flw is there is no view finder it only has a huge lcd screen and im sure if u turn down the brightness on the screen u can get great battery life so far i love this little thing and it is little it not 2 small its just right and the other problem it doesent come with a cloth case which i would have like but overall good job panasonic another great proudct.another thing is that there is no plasic on it all all metal what else would u want.", "Date": "February 16, 2007"}, {"Title": "Excellent shop", "Author": "Fabio S. Carvalho \"fabao\"", "ReviewID": "RK62819GQ676Y", "Overall": "5.0", "Content": "The Digital Camera Panasonic has an excellent image and a good Stabilized zoom .Excellent shop and I am very satisfied.", "Date": "January 14, 2007"}, {"Title": "Bad faulty camera - Many reported problems", "Author": "Vijay Ilavarasan \"Vijay\"", "ReviewID": "R1IPS0PDKJ5BCE", "Overall": "1.0", "Content": "All of a sudden, this camera turns on, but no buttons work. If you search on google you will find that several have reported this issue. Panasonic must recall this model. I'm never buying a panasonic again. The picture quality, like many reported are very dark and makes everyone look oily ... THE WORST DIGITAL CAMERA I HAVE EVER OWNED. The only reason I got this was because I could put the SD card directly into my panasonic TV. What a bad mistake. I should have just stuck with Sony cybershots which gave great pictures and lasted atleast 3 yrs.", "Date": "November 27, 2008"}, {"Title": "Noisy and fake looking color in low light;", "Author": "J. Samuel", "ReviewID": "R2CTHN3IBZMXRX", "Overall": "1.0", "Content": "If you are looking for a camera that works indoors in low light then pass on  this one. I am comparing this with my 4 year old Fujifilm 3800. The Fuji has no image stabilization so a tripod is needed to get low-light shots;  but the shots have outstanding true-to-life colors without a flash. The Lumix on the other hand has excellent stabilization; no need for a tripod; but the colors appear fake and noisy without a flash. Is this the best that 4 years of technology can do?I did not test in daylight, or with a flash; it is probably a very good camera in those applications, but I wanted a camera that works indoors and this ain't it.", "Date": "December 12, 2006"}, {"Title": "The best camera....better than Sony", "Author": "T. H. Au-yeung", "ReviewID": "RH7BU23KYKSWZ", "Overall": "5.0", "Content": "This is the best camera I never had. It takes the sharp picture and easy to use my co-worker saw the quality they love it. Believed me better than sony.", "Date": "January 3, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "7.2-megapixel CCD captures enough detail for photo-quality 15 x 20-inch prints\n3.6x image-stabilized optical zoom; 2.5-inch LCD display\nIntelligent ISO Control (I.I.C.) reduces image blur from subject movement and low light\nRecords full-size movies in wide-aspect VGA (848 x 480) at 30 frames per second\nStores images on SD memory cards (16MB card included); powered by li-ion battery pack (battery and charger included)", "Name": "Panasonic DMC-FX07K 7.2MP Digital Camera with 3.6x Optical Image Stabilized Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/413E6SYVTHL._SX300_.jpg", "ProductID": "B000GHVZOM"}}