{"Reviews": [{"Title": "Beautiful Pictures at a Great Price", "Author": "D. Spina", "ReviewID": "R1FEG3G39UK4Z6", "Overall": "5.0", "Content": "This is an excellent camera and I heartily recommend it. I have been an avid photographer for over 40 years and my standards are very high. I have used everything from fully manual large format cameras to ultra small point and shoot APS film cameras.This is my first digital camera and I did a lot of research before I bought one. I read up on dozens of models, tried a few of my friends cameras and handled quite a few in stores before deciding on this one. This is the best camera I could find in this price range. I could not be more pleased with it.The pictures are very sharp, with no digital noise or artifacts. Colors are perfect. There are no unpleasant color casts and the colors are rich and vibrant without being oversaturated. I ran a number of my test pictures through Photoshop and I found that grays are neutral and blacks and whites are pure.The camera itself is small and light enough to fit into a cargo pocket or to wear with a small belt pouch. It fits comfortably in your hands and all the controls are well placed. The LCD screen on the back is huge and is very bright and clear. It was one of the camera's strongest selling points.The lens is excellent. The 4X zoom is a bit wider than most at the wide end and a bit longer than most on the tele end. It has a great range and really shines when used for portraits within the telephoto range. It is much better than the standard 3X zoom found on most cameras of this size and price. It was the deciding factor for me.The 5 megapixel resolution is outstanding and it really shines when you want to crop or blow up just a portion of a picture.The camera has numerous scene modes and a full range of auto exposure and manual controls. I suspect that most users, myself included, will just set it on Auto and forget it, but it is nice to know that more sophisticated options are available. All the other options are easily accessed through a very simple menu system that seems much easier to use than those on most other digital cameras. All buttons and controls are well placed and easy to use.I especially appreciate the fake sound of a shutter clicking when you take a photo. I don't know how many times I've used friends cameras and couldn't figure out if I had taken a picture or not. The sound can be turned off if you don't like it, but I find it very helpful.There is virtually no shutter lag. You take the picture the moment you press the shutter button. This was crucial for me. Most digital cameras have a slight lag and it can be maddening when it causes you to miss that perfect moment. I have a film camera that suffers from a slight lag and even after 7 years of use, I still find it annoying.Battery life seems good but I will probably purchase an extra battery and keep a fully charged spare on hand. The external charger is very compact and it is a real advantage to be able to charge the battery outside of the camera.The 32MB of internal memory is a bit more than most but you'll want to purchase an extra SD card. I bought a 256MB card and it is more than enough for me. Interestingly, Kodak notes in the documentation that the camera works best with regular SD cards, not the ultra fast ones, so save your money and buy just a standard card. The camera writes to the card almost instantaneously, so you will never lose a shot waiting for the camera.The flash is quite good. Exposure and color are very accurate. There is no ugly blue cast and it does not overexpose like so many others do. Like most other small cameras with the flash near the lens, red eye can be a problem. It is no worse than any other camera and is easly corrected with almost any software.The auto white balace works very well. I doubt that I will ever have to set it manually but you can if you need to.The burst modes and auto bracketing are nice features but I probably won't need them all that much. Still, it is nice to have them when you need them.The Easyshare software that comes with the camera is very good but not outstanding. It will do everything you need with ease but Mac users will probably prefer iPhoto or the $100 Photoshop Elements. Since I use the full version of Photoshop everyday, the software was not an issue for me.The camera has a good movie mode but I really don't care about that at all, so it was not a factor in my decision. I have a Mini DV movie camera for when I want movies.I strongly urge you to handle any camera you are considering. Go to a store and actually pick it up and use it. I have used Canon cameras for over 30 years and was all set to buy a Canon digital camera in this price range. It was an excellent camera but when I held it and used it, I realized it was not for me. I almost bought it sight unseen just because I have always gotten such good use out of my Canons. I would have been disappointed with it. I made sure to try out this Kodak Z730 before I ordered it. It suits me perfectly, but you may find something that bothers you. Try it before you buy it!There are a few minor quibbles. For $300 it should come with a case. I did not like having to run out and spend another $10 just so I could take the camera with me. I've noticed that almost no other cameras in this price range come with a case, so I guess Kodak is not alone in this cost cutting.I would have also appreciated an AC adapter to run it without batteries when it is attached to the computer, but I guess Kodak wants to sell those docks. Again, almost no other camera companies include this accessory anymore, so this should not be a deal breaker.I'm one of the few people who still prefer to hold the camera up to my eye and use the optical viewfinder instead of the LCD. This camera has a good optical viewfinder and you can even set the diopter adjustment. I wish the optical viewfinder was a bit larger and had a bit more information in it but that would probably make this camera more costly. Since most people use the LCD screen to compose their photos, this is probably not an issue for most buyers.In conclusion, this is a great camera for quick snapshots of friends and family. Use it for vacations, parties, candid photos and just about everything else. It is easy to use and gives excellent results. You can just set it and forget it or you can use its more advanced features to do more sophsticated photography. In the end, it is all about the pictures and with this camera, the pictures are beautiful. You will not find a better camera in this price range.", "Date": "July 5, 2005"}, {"Title": "A great camera", "Author": "dantheman", "ReviewID": "R27OT8TXDSMDUU", "Overall": "4.0", "Content": "I have used this camera for about two months now. I am very pleased with it. It is my first digital camera. After reading about all the different ones on the market I ended up buying the Z730 and I'm glad I did.  I got the dock with it which it makes it a little nicer, but I wouldn't say it is a necessity. It takes great quality photos, its easy to use and all in all a good choice. I have found though, the complete auto setting is not as good as my 35 mm slr. In very bright light or low light conditions the exposure is sometimes uneven, bright faces and dark back grounds. But using the scene settings ie \"beach\" in very bright conditions does the trick. The large view screen is really nice. Overall its a great buy for the money.", "Date": "August 7, 2005"}, {"Title": "Just what I was looking for", "Author": "SaturnEyes", "ReviewID": "R3JDDVRHLOA2WX", "Overall": "5.0", "Content": "I am very pleased with this camera, Originally, I bought a Casio Exilim, but found the picture quality was so poor that I returned it in favor of this camera. I'm glad I did, because the quality of the pictures that this camera produces is far superior (especially in low light and indoor settings).Even though this camera is thicker than the smaller Exilims and Elphs on the market, don't be discouraged. It's still small enough to throw in your purse or bag, and because it has the lithium battery, it's much lighter than you would expect it to be (especially if you're used to a similarly sized camera that takes 4 AAs).", "Date": "October 15, 2005"}, {"Title": "i l-o-v-e this camera!", "Author": "nellyks", "ReviewID": "R17UHMOMX27R5V", "Overall": "5.0", "Content": "i have searched high and low for a good digital camera to replace our out-dated one.  my #1 criteria was for QUICK SHUTTER SPEED!  so many digital cameras have a delay which causes me to miss the wonderful smiles on my baby's face.  this camera rocks when it comes to shutter speed and it has a great grip that allows me to take pictures with 1 hand while zooming so that my other hand can be used to wave a toy in the air or whatever it takes to get the baby to look my way.  as a bonus, there are many great features on this camera that i've read about in the manual as well.  i just hope to use them and not get lazy with the auto settings.  we'll see.  in the end, i highly recommend this camera...especially before they run out of them as most places are not carrying it anymore since it's last year's model and has been replaced.  not sure why kodak is replacing it as it's wonderful as is.  enjoy!", "Date": "November 23, 2005"}, {"Title": "Good Camera, Bad Software", "Author": "Amazon Customer", "ReviewID": "R3ROZEZDL57E2P", "Overall": "5.0", "Content": "I dropped my beloved little Minolta G530 into my coffee one morning (yes, I did) and I had to get another camera.  I bought the Minolta for under 200 dollars at 199 and thought I could find another deal on the same model, but I couldn't find one at the same price or cheaper (I live in Germany).  So, I started researching.  Of course any good research on buying a digital camera should start at the Amazon reviews, so I started reading them.  For under 200 dollars/euros, I could purchase the Z730.  I ordered it and was a little disappointed in its look and feel.  The Minolta was metal-cased, or at least felt as solid as metal.  The Kodak is plastic-cased.  The Minolta was thin and elegant.  The Kodak is not quite elegant, though it is handsome, however it is not thin and I thought I would miss the portability of the Minolta.But the pictures!  And the control functions!  And the viewscreen!  All positives that far override the plastic case and size of the Kodak.  I loved the quality of the pictures from the Minolta, but the Kodak is in a higher class of image creation.  I'm not sure this is due to the science chip that they say is in the camera or not, but the colors are more vivid and the sharpness and clearness are more pronounced.  There is a greater range of presets at 16.  I think the Minolta only had maybe 5 or 6.  The controls are definitely easier to use.  Almost too easy, since I feel like I am being spoon fed information on how to take pictures.If you want or need to be spoon fed information about how to take good photographs, then this camera has the presets to take pictures for you in 95 percent of situations you may encounter.  But the manual mode of the camera gives the photographer complete control. It can be set to adjust shutter speed or aperture along with full manual control, so if you are a professional photographer, this camera might be an option, since it is threaded for additional wide angle or telescopic lenses.With the Kodak I have the same control as I did with the Minolta, but with 4X zoom and better depth of field capabilities. The features I miss from the Minolta are its abilities to set RGB balances and its 3 manual options for manual settings that could be preset for situations that you may commonly shoot in. But those were options that I don't really need that much, so it isn't a great loss.Both the Kodak and the Minolta can run from a wall outlet, but the Kodak can use an adapter that you could buy for a few dollars at any Radio Shack.  The Minolta had a custom adaptor for this purpose, so that's extra money.So far, the only con I have against this camera isn't the camera itself, but the stupid, poorly developed software that is included with the unit.  If you want to use it, fine, but it isn't needed at all, and I think it is just a gimmik to sell the docking stations, etc.  You don't need any of that to quickly email or store images.  If you use Picasa to upload to your blog, this software is a royal pain to bypass.  Do yourself a favor and buy a card reader. The Kodak uses standard SD cards and you can buy a card reader that reads just about any kind of card imaginable for 10 bucks. The pictures will download just fine and a lot quicker. I know the instructions say to download the sofware first, but I have uninstalled the EasyShare NightMare and there are no problems with my camera or computer caused by uninstalling it.The video quality is good and there is cable included to connect to your television, if you want.  I haven't used it that much so I can't comment on it more than that.I'm going to end this on a positive note, though, since the Z730 really is a fine piece of photographic equipment. That positive would be that the Li Ion battery is cheap.  They have an OK charge, and I've taken quite a few pictures on one charge, but the electronics that give the fine pictures must be the reason. At 10 bucks apiece, you can buy a couple more and keep at least one fully charged in the charger while you take the other two along.", "Date": "February 20, 2006"}, {"Title": "Versatile and Simplistic Camera", "Author": null, "ReviewID": "RPERNCCX6HM4", "Overall": "5.0", "Content": "I recently got the KodakEasyShare Z730 Digital Camera for Christmas, and I am more than happy with my new tech toy. After much research, I had requested this particular camera for Christmas and my relatives all chipped in and had bought it. I have never been more satisfied with a decision.First of all, the camera itself is quite an engineering feat. It may not be as small and ultra-slim as other digital cameras, but it sure packs a huge array of features in its casing. The buttons are placed in very convenient locations and I have no trouble accessing them when taking pictures. The viewfinder gives you a large image like a regular camera, unlike some other digital cameras which have tiny viewfinders that can be a pain on the eyes. The 2.2 inch LCD is large and can be viewed from 150 degrees in both indoor and outdoor settings. I left the screen protector that came with the camera on my LCD to prevent scratching. I highly recommend this, as the screen protector does not detract from the colors of the screen, but still gives you ample protection.The USB port and A/V Out (yes, you can view your pics on a T.V screen with an included A/V cable) are located beneath a rubber piece that irritates me because you have to bend it back when plugging in the USB cable. I suppose it is a good defense against the elements, but I wished that the rubber door was a plastic door with hinges so you could just slide it open. The camera has a tripod mount and a special docking port on the bottom. Unfortunately, the camera only comes with a special cradle for fitting into the Kodak printing dock; you'll have to buy the dock separately, but DO NOT throw away the plastic cradle. You need it for the camera to fit the dock properly.For the pros out there, this camera is quite versatile, as it lets you alter exposure metering, white balance, exposure compensation, shutter speed, aperture, focus, and more. There are 16 different modes that let you take beautiful pictures in settings like snow, beach, indoor, night, subject, close up, landscape, and more. I found these to be particularly handy because the modes automatically set flash, shutter, and focus depending on what situation you are in. The 4x optical zoom and 4x digital zoom were big deciding factors for me choosing this camera, as I continually need to use them in various situations. The 16x total zoom was a big improvement over my older 9x total zoom 3.2 megapixel Minolta camera.The video mode on the camera, capable of capturing QuickTime videos of 12 fps at 640 x 480 or 30 fps at 320 x240. The videos are quite nice, and are acceptable when played on the computer screen. Audio playback was fairly accurate. Of course, I do not use the video option much, but it is good to know that the camera has that option. The camera also has a first burst and last burst option that fires the shutter quicker and saves either the first five images or the last five images, depending on what you select. This comes in handy when I take pictures of sports action or other objects in quick motion.There's a jog dial on the camera that allows you to adjust shutter speed and exposure compensation quickly. The camera is turned on and off by pressing a lock button and turning a main dial that rotates, giving you the different features of the camera like Auto mode, Video mode, Program, Aperture Priority, Shutter Priority, and more. In my view, this dial is ingenious because it prevents the camera from accidentally turning on in your bag. Other digital cameras have a power button on the top of the camera that can be easily triggered accidentally. I bought a surprisingly high quality $8 camera bag from Wal-Mart to protect my camera and got a slightly larger size so I could carry around my spare 256 MB SD card and spare lithium ion battery that I will get in a couple of weeks.There are no directional arrow buttons on the camera, but rather yet a joystick that you can toggle with while flipping through photos on the camera. A nice green light surrounds the joystick, telling you that your batteries have good power and turn red when the batteries are low. The camera is powered by a 1500 mAH lithium ion battery that can be charged on an included outlet charger. While it is handy to have an external charger, I found it annoying that if you charge the battery outside of the camera for a long time, you have to reset the time on the camera's clock because there is no battery to keep it going. But in any case, the battery has never died on me once when I was taking pictures. The camera is very good at conserving energy; I use the LCD screen in almost every one of my shots, and I love to flip through my photos on the LCD, but the battery has always held strong. ( I took over 150 pictures at a pool party, and the battery light was still green). I ordered a 1700 mAH lithium ion battery from amazon.com for back up when I go to long parties or events and do not have time to charge my battery.The shutter button is easy to press down and the camera makes a fake shutter noise when you press the button (there are other sound themes you can select, like classical, jazz, or sci-fi to personalize your camera). This is a high plus because I know when the picture is taken. On my old camera, I had no idea when the camera took the picture because there were no audible sounds. Another huge plus of this camera was its shutter speed; there is practically no lag, so when you press the button, the image is instantaneously captured. However, since I use an old Sandisk 256 MB SD card, the writing time takes about 7 seconds. This can be irritating, but Kodak doesn't advise you to use the Ultra 2 and XD cards that operate at blazing speeds. To quote a section of this camera manual: \"We cannot guarantee the compatibility with \"high speed\" SD cards such as xSD or Ultra-2\" (page 5). The camera has a 32 MB internal memory, but I never use it because I want to be able to swap my memory cards out without running into any problems. The camera gives you the option of what kind of megapixel resolution you want to use; 5 MP, 4.4 MP, 4.0 MP, 3.1 MP, and 1.8 MP. I use the 4 MP because I do not need to print 20 x 30 pictures and the 4.0 MP saves memory.The EasyShare Software that came with the camera is good, but not the best. It takes a while for the camera to upload the images to the computer, and can take several minutes when you have like 100+ images stored on the camera. You can select and transfer, or transfer all the images. The colors that the camera produces are nothing short of amazing, and are far more accurate than my other camera, thanks to the unique Kodak color science chip inside the camera. You're supposed to be able to share your pics with friends and family by sending them your pics, but I have yet to figure out how to do this. The software lets you make some changes to your photos, but I am going to stick with Photoshop. When I printed out about 80 photos taken by my new camera from Costco's online photo store, the 4 x 6 prints (even though were expensive at 17 cents a print) were incredibly detailed and colorful. There is a noticeable difference between the pictures of my old and new camera. The colors on my old camera photos look a little grainy, and some of the colors are off. On the other hand, my new camera photos have amazingly accurate and vivid colors and show no hint whatsoever of grainy pixels.Overall, this camera has served me well since I got it; I have no regrets on getting it, and hope that it will continue to churn out beautiful pictures. I hope that this review helped!", "Date": "January 15, 2006"}, {"Title": "Stick with the Industry Standard", "Author": "John C", "ReviewID": "R32941ZZYUXPCY", "Overall": "5.0", "Content": "I bought this in July just got around to writing a review.Have taken it traveling and found is as compact as I wanted those cameras that are too small are not practical.I added a 512mb sd card have found I cannot fill the card easily fits 350 pictures the battery is great even when using the flash The pictures are clear and crisp I recommend this to anyone novice or pro", "Date": "October 21, 2005"}, {"Title": "Kodak Z730", "Author": "C. W. Lonning", "ReviewID": "RWDTMG3TYCTQK", "Overall": "4.0", "Content": "Works great, easy to figure out and use, enough pixels to make enlargements up to 11 X 14, plenty for web sites.Make sure to buy the docking station for easy charging and photo transfer.", "Date": "August 24, 2005"}, {"Title": "great point and shoot", "Author": "skshutterbug \"sandy\"", "ReviewID": "R1Y2ZP69DTAXEX", "Overall": "4.0", "Content": "I've been using this camera for a month, and love the quality of the pictures.  I even took pictures at dusk with no flash and I was able to lighten them up enough to make a decent print.  What I don't like is that I can not e-mail the videos.  Seems that the recipient of the videos has to have the kodak softwear installed in their computer. Bummer.", "Date": "October 3, 2005"}, {"Title": "Great Camera", "Author": "Crimson Canuck", "ReviewID": "RXCJJ5OT7QPYA", "Overall": "5.0", "Content": "This is an all-around good camera. Other than being a bit larger than the newer, small digital cameras, this one has it all. Here are some of the highlights:- large LCD 2.2\"- clear, large video with good sound (no time limit either)- 4x zoom- good picture quality (sharp with no color distortion)- easy to use- good price for a 5MP camera", "Date": "August 17, 2005"}, {"Title": "This is an EXCELLENT camera.", "Author": "Gary in Sun City, AZ", "ReviewID": "RW3HFJHFIFGW6", "Overall": "5.0", "Content": "Purchased this recently from Amazon.com and very happy with it so far. Superior picture quality. The very large (2.2\") and bright screen is great. 5.0 MP produces great images that can be cropped. This is my second Kodak digital camera. My last Kodak was a DC3400 (4 years old) which I gave to my daughter and it still takes great pictures, just less megapixels & features. I do think the instruction booklet could have more details, the Kodak website PDF file as well. But a new user should have few problems. I did add a small metal key ring to the hook hole on the camera, and put a lanyard on it for more secure carrying. That allows it to hang securely from your neck. I don't fully trust these wrist straps they use these days. Kodak makes excellent cameras. I also have a Canon digital Rebel 6.3MP SLR, and of course that does more things, but this one is great for a nice point-and-shoot which can be used automatically, but also offers lots of modes and choices if selected.", "Date": "December 9, 2005"}, {"Title": "Fantastic camera", "Author": "Nabz", "ReviewID": "RKLAS7QZX9FYQ", "Overall": "5.0", "Content": "I was looking for a digital camera and didn't know which one to buy. I was hearing all sorts of different opinions about different brands which made me totally confused. I could not make up my mind and at that point my fiance told me to buy a Kodak camera. Then I came across this Kodak z730 camera which I thought was very much affordable. 4X zoom, 5 MP with so many features in it, and the price is amazing. Finally I bought it and it's just awesome! Easy to use, picture quality is just like I wanted, very good battery life, zoom is very very powerful. I am TOTALLY satisfied and I would definitely recommend this camera to anyone. I just love my digital camera!", "Date": "June 9, 2006"}, {"Title": "Good price, great pictures", "Author": "Jill Zimmer", "ReviewID": "RTI566L49BHL6", "Overall": "5.0", "Content": "This camera is at a great price and offers incredible pictures. It has a good number of manual features, good auto settings, and many scene selections. The 4X optical zoom is more than most cameras at its price, and all features of this camera really work perfectly. I have one complaint and warning about it, though. I give this camera 5 stars easily, but the software is another story. It works very well and is very easy to use, but is incredibly hard to get it to work, especially on Windows. It works fine on Macs, but on my Windows it gave me tons of trouble. It recently started working just a few days ago, for no apparent reason. That was more than a month after I first tried to install it.I think if you have a Mac and want a camera, there is no excuse to not get this camera. If you have Windows, though, be warned that the software will most likely give oyu problems.", "Date": "January 26, 2006"}, {"Title": "Great camera, just a few little issues", "Author": "PHL1365", "ReviewID": "R3IO8BVSV2H826", "Overall": "5.0", "Content": "I generally agree with everything D. Spina posted in his/her review. Just wanted to add a couple of minor issues.This camera, like all of Kodak's new-for-2005 models, use a new USB cable. For most people, this is not a problem, but if you want to use this camera with multiple computers, or if you want a second cable to hook up to a pictbridge printer, you may have trouble finding a cable. Kodak sells one for $15 + $5 shipping, but you'll probably never find one at your local Circuit City. This could be a frustrating situation if your cable gets damaged. Eventually, I suppose, this cable will become commonplace, but it might be a while.Also, be aware that this camera is not compatible with older Kodak camera docks, unless you get an adapter. Again, not a serious issue, but if you've already got a Kodak dock, you'll probably have to shell out for a new one, or at least for an adapter.", "Date": "July 21, 2005"}, {"Title": "Not Really a Nighttime Camera", "Author": "D. Lucas", "ReviewID": "R3R1887ANIEXP8", "Overall": "4.0", "Content": "But otherwise excellent for the price. The full-auto mode is decent but not great (tho it never really is). The scene modes are useful and there are plenty to choose from. The camera has a bit of trouble with backlit subjects, even using the backlight scene mode.Battery life is excellent (if you're not an idiot and remember to charge it first!). Fully manual mode is a bit confusing at first, but you can save your own manual presets, so once you figure it out, that is also excellent.It is a quality product for a great price, good for some amateur photojournalism, but not really for anything professional.A tip: they suggest you buy the Kodak SD cards to go with this. Don't bother. They are double the price of other SD cards and don't make that much of a difference.", "Date": "May 21, 2006"}, {"Title": "Good camera for the money", "Author": "Fast Gun Fife", "ReviewID": "R367OIK5S6VFH4", "Overall": "4.0", "Content": "This is a good camera for someone who wants a lot more than the budget cameras provide but are not ready for the big budget cameras. It can go from a point and shoot to fully manual settings and everything in between. It takes great pictures and video is a breeze. But there are some drawbacks. One, the little rubber cover over the USB access port has to be held open while you put in the usb cable - a real pain when connecting to your computer. Also the battery is difficult to remove from the charger - my wife couldn't do it. And you have no choice except rechargable batteries and to get a spare one will cost you $24 or more, but this is true of most mid range and up cameras. It does have a big 2.2\" LCD display which is quite handy. It also has 32mb of internal memory which is more than a lot of cameras have. Another very handy feature is that it has a speaker so you can actually hear your videos when played back on the LCD. I have not seen another camera in this price range that has this.(Mine cost $200 on sale and I have seen them  at different places for even less). This is my first digital camera and except for the little nuisances, I am very happy with it and I shopped long and hard before deciding on it. I even bought another model that I was lucky enough to be able to return. After shopping long and hard I finally figured out that no camera in this price range is perfect in every way but this one is close. I have heard they are replacing this with a new model so you need to get it while it's still available.  ****Update --- I am thinking about taking this camera back because I just read about the Kodak V530 and the V550 which have some features not on this camera such as TV quality Video(30 fps with 640 x 480 resolution, the Z730 only has about 13 fps and is not very clear and jumps when someone is moving around fast- forget taking video of your golf swing.). You you can zoom while shooting and you can't with the Z730. And they are selling the V530 at a certain chain that starts with an S for $228 and the V550 for $298 including a camera dock that has a battery charger and a camera case. I got no case and no dock with the Z730. The V550 is the one they are advertising on TV right now. Oh well, here we go agian.", "Date": "December 14, 2005"}, {"Title": "Great Camera", "Author": "Lori", "ReviewID": "R1VK06C8KHN69R", "Overall": "5.0", "Content": "I was looking for a camera for Christmas and I couldn't find anything that I was very happy with. My mom kept telling me about this one, I didn't really want to try it mainly because of the looks but I tried it anyway. I was really glad I did! This camera does great indoor shot on certain settings, there are a lot of scene settings for nearly anything you could think of. The ONLY thing I do not like about this camera is that is zooms in steps, instead of being able to stop were you want to, you have to kind of jump. I was able to over come this on the kodak website and also shutterfly. This is a great camera and I would recommend it to any person looking for a small camera that does great pictures.", "Date": "May 11, 2006"}, {"Title": "Firmware update available 3/06", "Author": "D. Hentze", "ReviewID": "R1TNJP0XZPC6QU", "Overall": "5.0", "Content": "Just wanted to let everyone know there is now a firmware update for Z730 available on the Kodak web site. It fixes some exposure issues.As for my review of the camera. It's a great camera with great battery life. The only possible negative is it's a little bit on the large side.", "Date": "March 5, 2006"}, {"Title": "Kodak does it again - Nice pictures, good value, and a little camera that delivers!", "Author": "Roy Chan", "ReviewID": "R3N78WU13WOJVC", "Overall": "5.0", "Content": "Pros: Light weight, large LCD, many extras, fast focus and negligible shutter lag, wonderful picture quality, auto-lens-cover, SCHNEIDER-KREUZNACH VARIOGON lens, fabulous color, excellent detail, price, built in memory,video, sound, great low light photos.Cons: NO neck strap, NO image stabilization, NO web cam features, would be great if it had a manual zoom in lensSummary: I must admit that the Kidak EasyShare Z730 is really designed for \"zoom seeking\" picture takers. With the advance features and outstanding performance, I have been able to get in-depth close up shots that is mind-blowing and impressive. The professional quality Schneider-Kreuznach Variogon 4X optical zoom lens (33-132 mm equivalent) allows me to have a greater photography experimentation than with a comparable 3X optical zoom. In additional, I really enjoyed the 2.2-inch high-resolution LCD screen that can be used to preview and instantly review shots. The auto-focus also delivers a rapid click-to-capture that precisely freezes action at a desired moment. The best part is how quickly I can print a Kodak 4 x 6-inch picture with just one touch in less than 90 seconds using my new Kodak EasyShare Printer Dock Series 3. This version is the first to support the new IMAGELINK print system that allows any cameras to print pictures. Other than that, this is HIGHLY RECOMMENDED FOR FIRST TIME USERS!!!", "Date": "December 14, 2005"}, {"Title": "An excellent all-around camera", "Author": "lslofcal \"pictaker\"", "ReviewID": "R9M5WZT7FGL2L", "Overall": "5.0", "Content": "If you want only one camera, this is the one to buy. It gives you everything you ever want and need and at a very attractive price. I have 3 film cameras (all in working order), this is my second digital camera, I have been taking photographs for many years and I did a lot of research before I bought the Z730. Price was not the major consideration but features were. The Z730 has an optical view finder which is very handy in bright daylight when the LCD becomes useless. It has good lenses that takes sharp pictures, it has adequate optical zoom of 4X, it has excellent range for the flash to take group pictures, it has manual controls, lots of preset scenic modes, and above all it reproduces colors beautifully - not to mention it is easy to use. I have no problem with the software but it would have been nicer if it gave a more complete record about each picture taken. I am sure you will be as happy as I am with this camera and cannot help wanting to tell the world how happy you are.", "Date": "June 4, 2006"}, {"Title": "Keep your fingers crossed.", "Author": "Wilma Louis \"Louis\"", "ReviewID": "R8IM6OP91L6NO", "Overall": "1.0", "Content": "4 months after purchasing this camera it stopped working. As it was purchase at Amazon my only return option was Kodak. You have to jump through hoops with Kodak repair center. Sent it away to a 3rd party repairer, power board, and battery latch and lens assembly was replaced. One month later same problem. Two months later all the buttons froze, the camera has been sitting at the repair center waiting for new power boards to come in. Kodak is not interested in replacing the camera, though I have had it for less than 8 months. Kodaks customer service is unresponsive and uninterested. A letter to corporate has gone unanswered.  It's a nice camera if you are lucky to get one that works.", "Date": "July 27, 2006"}, {"Title": "Excellent value for money", "Author": "Looking in Awe", "ReviewID": "R3QOJ367VMT3TK", "Overall": "5.0", "Content": "This camera was my first step away from years of amateur photography with a professional quality SLR.  I have been, and continue to be, completely delighted with this camera.  I chose it based on my experience with a friend's earlier version of the easyshare and an exhaustive review of products in the same price range.  I have not been disappointed.  Indeed, it has exceeded my expectations on picture quality, responsiveness, and video capability.  The flash is somewhat weak, but I am finding work arounds for that.  The rotary button feels a little sticky but works nevertheless.  This is excellent value and should satisfy most amateur photographers.", "Date": "June 25, 2006"}, {"Title": "Kodak Z730 Digital Camera", "Author": "John E. Camillo Sr.", "ReviewID": "R2P3N49V6UA8TZ", "Overall": "5.0", "Content": "Camera is very easy to use. The instructions or easy to read and apply. It is reasonablely priced and well worth the price. I would recommend it to anyone who is looking for a good quality easy to use, inexpensive digital camera to be used at home taking personal; type pictures of family and friends.", "Date": "March 15, 2006"}, {"Title": "great pictures", "Author": "Jill Zimmer", "ReviewID": "R3NSOBJU3TDCJD", "Overall": "5.0", "Content": "This camera takes great pictures and has all the features you need and more. Its 4X zoom is above average, it has a large LCD screen, easy interface, quick startup time, many manual modes, and for a price less than almost all 5MP cameras. I've heard the softwre is great (but i cant get it to work yet). If you're looking for a 5Mp camera, this is one of the best.", "Date": "December 25, 2005"}, {"Title": "Great Camera.....Great Price!", "Author": "Art and Soul \"ACottageArtist\"", "ReviewID": "R3P7SPKE923H8Q", "Overall": "5.0", "Content": "I've owned this camera for over a year now, and I continually find myself reaching for this one whenever I need to know I will get the shot I want. I love the quality and color of Kodak prints, as well as the ease of use for those of us who are closer to the \"point and shoot\" type consumers. If I had to make numerous adjustments to a camera before shooting, I would never get the pictures I want...as I'm usually taking pictures of kids or animals, or scenery, or in concerts and I love being able to snap several photos and be done while others are still busy composing one shot. It is consistent and I can rely on the end product being very good, and it is overall better about redeye than my 4 MP Olympus.(yes I have a lot of cameras!) For many years I used 35 mm Canon AE1 for everything and still love the quality you get with those, but digital is addictive. Being able to delete and retake pictures is just invaluable. I have to disagree with the other reviewer about the video clips. I inadvertently shot some video in a concert (it was dark and I turned the wheel to the wrong setting) and it simply showed up as a photo on the software and downloaded as easily as the pictures. I click on it and it plays. I find the software simple and it could have more features, but it is adequate, especially considering the price of this camera, and I don't rely solely on the Kodak software for editing, etc. I find the battery life amazing....I buy the 1800 lithium batteries and always carry an extra, but rarely have to change one on a vacation. I just returned from Ireland, shooting about 350 pix and only changed it at the end of the trip....awesome.I think one of my favorite things about this camera is the shutter lag (or lack of shutter lag), this baby is ready to go for the next shot by the time I am...it's one of the reasons I can capture so many shots and be done quickly, then sit back and enjoy the scenery and not be waiting for the camera to be ready again. My Olympus is terrible is this regard.I have to say I can't recommend the Kodak Z7590 in the same way (I've owned it over a year also), but that is another review for another time. My first digital camera was a 2 mp Kodak DX3440 and still takes awesome pictures after being dropped several times.This little camera is portable and goes into a purse easily and is lightweight, perfect for vacations or going to concerts. I think it's a little gem. There are lots of more technically qualified reviewers here to give you the specifications and details, but from a person who just likes to grab a camera and use the Auto settings....and print up to about 8 x 10 on my Canon photo printer, it is perfect. Most of my pictures turn out great, photo lab quality. (I have a i860 Canon printer)I did have one incident with this camera in Ireland when it was misting rain and the shutter failed to open all the way...I got about 3 beautiful but strange pictures with the edges of the shutter framing a gorgeous green landscape, but it was only momentary and the camera soon returned to performing perfectly, I simply dried the shutter, and got out of the rain....:)  I hope this review helps someone. If you are a pro, or advanced photographer, you will already have something a lot more sophisticated, but for the average person who just likes to take good pictures, you can't beat this camera!  Good luck!", "Date": "January 5, 2007"}, {"Title": "No Regrets.", "Author": "Name Withheld", "ReviewID": "R1J4YDA3AFYG5A", "Overall": "5.0", "Content": "I've done extensive studying to find a good camera within my price range, and this one is it. Months later, I have no regrets whatsoever.I have seen the slightly newer moder, the z760, and I honestly think this one is a better deal. The z760 has one more Megapixel, but that doesn't matter to me. I have to zoom in as far as photoshop will go to see a differance, and there really isn't much of one. This odel does have a superior zoom, which is why I picked it.This one also has an automatic lens-cover, whereas the z760 and many other high zoom cameras have lens covers that you have to put on yourself, which is also easier to get lost.This one doesn't have all of the mickey-mouse options like fancy frames, but it does have the alternations that fit my needs. It has B+W, Sepia Tone, as well as the options of Low, Natural, or High color, and other options like light balance.I found out that I don't like the presets, but that's just like me. I prefer to use the manual settings, which are much easier to access than most other cameras I've used.If I had to think of a couple bad sides, I'd say that it's the image size and the need to take the battery out to charge it. This camera can only do 8x10 shots, which isn't very useful if you intend to do more professional work. The battery has to be recharged by taking it out and putting on the charger, however this problem can be solved by simply getting a dock for it. Also, like most other cameras, this one isn't very smooth with my computer. The software is a little bit confusing, but this is no problem either as long as you have an SD card reader.", "Date": "October 30, 2006"}, {"Title": "pretty good", "Author": "RF \"RF\"", "ReviewID": "R2D290B08G93N8", "Overall": "4.0", "Content": "Pros:  Good value for the money.  Good quality photos.  Preset settings such as \"museum\" are handy.  Good quality LCD.  I like the Date Stamp feature, my Canon's was limited.Cons:  Size, it's kind of bulky.  Uses USB mini instead of the standard size, can be a pain when managing all of your cords on your desktop.  I've charged the battery twice and when placing it back in the camera I had to reset my date/time, my Canon did not need to do this.  Does not have a \"panoramic\" feature that lets you combine several photos together that Canon has.  The Kodak \"small\" camera bag is not so small.", "Date": "August 5, 2006"}, {"Title": "Very Happy With My Selection", "Author": "J. Fuller", "ReviewID": "R2NQO2WRZA6L9F", "Overall": "5.0", "Content": "I bought this camera for my Mom (aged 73) for Christmas!  It took me exactly 1 hour to teach her how to use most of the features!  The book was very easy to follow.  She uses the camera frequently, so she will get used to the features.  The pictures are great!", "Date": "January 25, 2006"}, {"Title": "USB?", "Author": "J. Apon \"MDRIV3R\"", "ReviewID": "R1PD0KIKJRDKT", "Overall": "3.0", "Content": "The USB mini-B port is not the industry standard size for the camera.  This becomes apparent if you decide to use the USB cable with other digital cameras.  Keep that in mind if you decide to purcahse this camera.  If the cable breaks you will probably have to buy some proprietary USB cable from kodak to replace it.  Otherwise this camera is great for first time users.", "Date": "July 5, 2006"}, {"Title": "I have already recommended this camera to others", "Author": "Michele Fleming", "ReviewID": "REO1A0Q9BKH71", "Overall": "5.0", "Content": "This camera is the last camera that I will buy for a long while.  The small battery is lightweight yet lasts for an unbelievably long time.  The viewscreen is huge and bright.  The part I love the best is that the picture is taken when you actually press the button.  Then it makes a little shutter noise.  No Waiting for focusing. This camera is perfect for me, one who doesn't care for technology.  The camera is large enough to hold on to, while being a lightweight.  This camera takes great shots.", "Date": "January 16, 2006"}, {"Title": "Good camera, not perfect", "Author": "Jose", "ReviewID": "R2JIZUJJKS2UBS", "Overall": "3.0", "Content": "PROS: 1. Unbeatable Price, 2. Very good sharpness (not excellent), 3.Intuitive and easy-to use. 4.good performance un AUTO, better in other functions. 5.Good video quality, adequate in poor lighting. 6. adequate digital zoom (if you have a very steady hand). 7. performs well in low light (using manual). 8.Very flexible for the \"family/vacation shooter\".CONS: 1. Mediocre software, 2.Poor macro/close-up fuction (closest focusing = 9cm. aprox.), 3.Diopter diffcult to manipulate, 4.Strange and very light violet cast/hue on certain pix (still don't know why). 5. Need two batteries so as to not lose info on camera. 6.Some focusing difficulties. 7. No spot-metering in manual mode(doesn't say this in the manual).Bottom line: for a camera its price and its class, it's very hard to beat. Built for the very advanced \"familiy/vacation shooter\", not quite flexible enough for the avid amateur. Has some quirks I can live with.", "Date": "September 13, 2006"}, {"Title": "Great camera, software be dammed!", "Author": "Tech101", "ReviewID": "R3OANQR0335WX4", "Overall": "5.0", "Content": "Everything that has been said is accurate. However, the software CAN be bypassed. With Windows XP Professional there is default camera software that works with the z730 (even on Windows 64 bit edition!)I have mine configured to create a folder (that has an autoname of the date) and download all the pictures whenever I plug in the camera. I don't even have to click anything. Plug, download, erase from camera, unplug. Highly reccomended.", "Date": "March 20, 2006"}, {"Title": "Best Camera Kodak Ever Made", "Author": "Matthew D. Ruffell", "ReviewID": "RGVA0LV66O2H3", "Overall": "5.0", "Content": "Been using the camera for 4 years now. Even by 2011 standards, this camera is awesome. Wonder why? - because it has an f2.8 lens!  I have come to realize that its the lens that truly matters. Most of the image sensors are identical between cameras, the jpeg processing differs only slightly between cameras, its the lens that matters.  Cheap lens only work well outdoors in good lighting. The Kodak z730 works indoors/outdoors and almost anywhere you want to use it. The camera refuses to take bad pictures.  I will take the 5MP pics from this Kodak camera over any 14MP pics from cheap junk f4.0 point and shoot cameras on the market today.  What I dont understand is why Kodak discontinued this camera / lens, and started making cheap junk.  Too bad because the z730 was (and still is) phenomenal!", "Date": "March 11, 2011"}, {"Title": "It's too bad", "Author": "Ange", "ReviewID": "R1ZEN2DZAFVCOB", "Overall": "1.0", "Content": "I recently got this camera and LOVED it!  It was easy to use, the quality of pictures was amazing, and there was practically no delay.  It's a little on the bulky side, but I can handle that.Then, after less than 2 months, it stopped working.  The zoom went crazy, the pictures were all fuzzy.  I returned it to United Camera (per Kodak's instructions) and they wanted to charge me $142 to fix it!  That's what I paid for the camera in the first place!  I could either pay to have it fixed, or pay $35 for inspection plus s/h to have it returned to me.  They are, essentially holding my camera hostage unless I pay up.They say there was damage to the lens that's not covered by the warranty.  But I never dropped the camera and it was working fine one minute and not the next.  It was brand new!  Apparently, it's not such a quality camera and obviously their customer service stinks.It's too bad because I loved the camera.  Not sure I'll ever give Kodak another dime.", "Date": "November 3, 2006"}, {"Title": "Kodak Easyshare Software", "Author": "S. Hicks", "ReviewID": "RFTKEY0VCHAM1", "Overall": "5.0", "Content": "This is directed to a previous review stating that the Kodak software is faulty on Windows XP. The Easyshare(TM) software is one of the best out there that seamlessly works with the Kodak cameras.The older version of Kodak Easyshare did have problems and IF YOU TRIED TO INSTALL AN UPDATED VERSION FROM KODAK, AND THEN UNINSTALL IT FOR SOME APPARENT REASON, AND THEN RUN THE APPLICATION A POP-UP WOULD APPEAR SAYING THAT ERROR:CODE:xxxxx (I don't remember exactly but it's a long number) THE EASYSHARE PROGRAM COULD NOT INITIALIZE PROPERLY (something like that). It gave you an option to \"cancel\" or \"Search the Web for a solution\". Click the internet option. Most of the time Kodak has a definite answer on their page. It states clearly how to fix it.I have a DX6440. It is a wonderful camera - a little big, but it does a lot, including an infinite amount of video recording. The only problem is that you cannot zoom in while shooting. I ran into this problem a day after I got it for Christmas. I do believe all new Kodak cameras come with the newest and greates Easyshare software. I trust Kodak and their quality in products and services. Good luck and have fun!", "Date": "June 3, 2006"}, {"Title": "WOW!", "Author": null, "ReviewID": "R1JHEGO35VPZMP", "Overall": "5.0", "Content": "This camera has great quality!  The photos have unbelievable color and detail.  It is a great camera for the price.  Software is fine, but not AMAZING, but great for enhansing, color effects, cropping, and fun effects.", "Date": "November 8, 2006"}, {"Title": "Great Camera After Seven Years!", "Author": "J. M. Taylor", "ReviewID": "R1QT9PQ9AARQXW", "Overall": "4.0", "Content": "I received this camera in 2005 when I graduated from college. I mainly used it as a point and shoot camera, since I'm not familiar with the multiple settings that it has on it. It was my first digital camera, and I was just thrilled I could use it to check the quality of my pics on the spot (the previous year I had gone to Europe, and a great deal of my 35mm shots were junk and I didn't know it until I returned).This camera, as of this writing, is probably considered 'old'. It's only 5mp, and the back LCD screen is smallish compared to what is out there today. It is slightly bulky, but I've come to appreciate that; the new point-and-shoots are quite slim, but this Kodak affords your hands some purchase. The battery lasts a good long while, and it comes with a wall adapter that you use to charge it with. I believe you can buy a dock for the entire camera as well to load to your computer directly, but I have just been using an SD card to transfer photos.Another nice feature that I haven't seen much of recently is the old-style viewfinder in addition to the screen. This is nice when outdoors and the sun is washing out the screen to the point of it being virtually unusable.What I really like about this camera is the lens. It is a Schneider-Kreuznach lens, which apparently has made a tremendous difference with the quality of the pictures I've been taking. Let me explain:Last year I was to go on a trip, and I thought a newer point and shoot camera might be easier to travel with. I bought a Samsung SL605 on clearance without checking specs or reviews (dumb, I know). The trip was cancelled, but upon messing with the camera, many pics came out blurry or grainy, especially at a higher ISO (when I would mess with the settings). The low light images were poor with little definition and a lot of 'noise'.Now, that may have just been that camera. And it also might have had to do with some internal limitations on its part. But the Samsung lens was simply labeled 'Samsung lens'. I am assuming (perhaps erroneously) that it is of a poorer quality than the Kodak. Many of the same pics repeated with the Kodak yielded much better results.In all, it is an older camera, and some features aren't as good as they could be (the macro setting has never been very good for up-close pics, for example). But I still love it. It takes great pics, especially when I sell items on eBay, and I hope it keeps ticking!", "Date": "August 17, 2012"}, {"Title": "fabulous product, horrid company", "Author": "T. Newton", "ReviewID": "R3OY0JSU9R3FV6", "Overall": "3.0", "Content": "I have enjoyed this camera very much.  You have the flexibility of letting the \"auto\" function take over, so it becomes a very nice point-and-shoot camera.  Alternately, you can select a pre-designed setting such as Museum, Landscape, Snow Scene, etc. in which several settings are preset, making a quick adjustment to changing circumstances very easy.  Finally, if you are a total fussbudget, you can set up your own fstops and stuff.  You can screw it onto a tripod and set up your own shutter and \"film speed\" setting and get very artsy-fartsy.  The only major drawback to the quality of the pictures is endemic to most digital cameras of this calibre - no depth of field.  Very flat photos.  Which, by the way, works great with large landscape photos and somewhat intimate people photos, like parties.HOWEVER, and this is a biggie, as soon as I experienced a MINOR mechanical issue (the retractable lens cover is not fully retracting any more) I hit the repair wall - NO ONE will touch this with a 10-foot pole.  I can send it to Kodak, or even a few online professional services, for a prohibitive charge. It would be cheaper to discard this one and buy another.  The environmentalist in me is horrified that in order to be cost effective, I have to throw away this perfectly fine camera simply due to a very minor mechanical issue.Bottom line - look at your repair options BEFORE committing to this or any other brand.", "Date": "April 21, 2008"}, {"Title": "Great Camera", "Author": "AuggieSociety \"AuggieSociety\"", "ReviewID": "R1D34LQQJ89VDR", "Overall": "5.0", "Content": "I got this camera last Christmas and love it.  It's not too big but it's not too small that I'm afraid I'll easily lose it or drop it.  The shaped grip on the side of the camera is a great feature for those times where I just want to keep the camera out of the case, in hand, and wait for the perfect picture opportunity.  The pictures look awesome once you put them on the computer. They're crisp and bright.  Many people have commented on the picture quality it produces.  Outside ones turn out the best in my opinion; some of my indoor ones create red eye but I'm sure if I took the time to change the setting it would come out better and there's always ways to edit that stuff on the computer.  There is no delay which is AWESOME.  I've used other people's camera's that have a delay and it's the most irritating thing in the world.  And the rechargeable lithium battery is an enormous plus too, otherwise these camera's just eat up the battery is no time.  Usage of the camera is pretty simple.  If you want to try all the different settings to fit the scenary and light balance you can, otherwise it just adjusts itself.  I would highly recommend this camera.The Kodak program that comes with the camera is okay.  It provides the basic cropping of pictures and a few extra fun things to do the picture like fish-eye and black and white.", "Date": "December 24, 2007"}, {"Title": "Great Camera! Perfect for Beginners.", "Author": null, "ReviewID": "R3THJIAI39T7VS", "Overall": "5.0", "Content": "This Camera is GREAT for beginners!  It has on-screen scene changing, on-screen Descriptions for all the settings and options, Sound themes, Etc.It takes great clear and Sharp photos, and as auto focus options, and multifocus options (for if you are capturing two subjects in one photo).  Zoom is good, and the Digital zoom does not the least bit distort the picture (another one of Kodaks Specialtys, I guess!).It is also a very strong camera. It has been dropped, Sat-on, Thrown, etc.  And it is still in perfect condition.The Only minus:  The flash is not good for Out-door Night-time Pictures.", "Date": "August 1, 2006"}, {"Title": "WOW!", "Author": "R. Carrillo", "ReviewID": "R3FLMW1AZUS4I7", "Overall": "5.0", "Content": "Our first digital camera broke several weeks ago and since then I had been shopping for a new one. I didn't want to spend a great deal of money.  I just a wanted an affordable camera that was easy to use and that took amazing photos.  After all my research I decided to purchase the Kodak EasyShare Z730.  I am thrilled with my purchase.  The camera is great.  Easy to hold, easy to use and the pictures are beautiful.  The colors are so crisp.  The shutter speed is great.  I had read about the menu and how it was a little difficult to get used to, but I didn't find that to be a problem at all.  It is very easy to navigate the camera.  I highly recommend this camera.", "Date": "June 21, 2006"}, {"Title": "Recommended", "Author": "Hystria", "ReviewID": "R3CISW2BAXOF4Z", "Overall": "4.0", "Content": "Easy to keep in the hand but poor ergonomics : buttons are difficult to operate, especially the one used to change manual settings.  The startup button is hard to turn from off to on, I used a drop of glue to fix the small pin in the \"on\" position, and now the button turns more easily.  Pictures on very close capture not to my expectations.  Excellent pictures with little to quasi inexistent light on manual settings : the exposure can be set as long as 60 seconds!  Video mode has almost no settings available, only a small zoom.  Poor video quality with low light.  Battery life could be better, especially when using LCD screen.  The wide screen is very useful.  I've never installed the software, only the driver (choose custom install), files transfer is fast enough.  Use this camera as any other external device, drag & drop files, that's all.  You will need a SD card and an extra battery when traveling without the charger.  All in all, a good buy with some limitations.", "Date": "April 5, 2006"}, {"Title": "Great camera!!", "Author": "Dana M. Sweeney \"dmarie636\"", "ReviewID": "R3TO3XH4AC68GZ", "Overall": "5.0", "Content": "I LOVE this camera!!!  I have recently bought my 3rd one.  I sell online & need crisp, clear pictures that are easy to take.  This easyshare is very easy to use & one of the features I absolutely love about any kodak easyshare is the orientation sensor because if you take a picture vertically with the camera, it will automatically switch it right side up (no more fooling with it after you download).  One note...if you take video vertically, it will not switch it & your video will have to be watched sideways...learned the hard way.I like the z730 easyshare because of the larger grip section it has...great for online picture taking.  I found that with other cameras, I just couldn't seem to hold onto them (& was dropping them often).Same menu/selections as most easyshares, so if you've had one before, it's easy to adapt.One suggestion & something I do with all of my cameras now is buy a lense adapter for them.  One drop of these cameras can bust the lense & basically make the camera useless (that's what happened to my first one).  The lense adapter works to protect the lense in case it is dropped.", "Date": "December 7, 2011"}, {"Title": "Love it, well worth the price.", "Author": "A. Lyons", "ReviewID": "R2FWSGY62K8GMV", "Overall": "5.0", "Content": "I've had this camera for almost 2 years now, and have never regretted it.  I paid about $300 for it from Staples in late 2005.  I bought a 512MB card, and recently I bought a 1GB card, and I have never had it lag at all even when recording long videos...and the cards aren't even 'high speed' cards.The only drawback I can think of it that this Z730 does not take very good low-light pictures without flash.  I know, that seems like an obvious thing to say, but it has a scene mode for \"Distant scenery at night\", which does not use the flash, but it still gives blurry, grainy photos.  Night pictures WITH flash turn out great, you can't even tell it's night in most cases.I usually use the \"Auto\" setting. After MUCH experimenting, I find that this setting seems to be the best for me,  though it will sometimes under-expose some shots (darker than they should be), but that's easily corrected with most computers' photo software...I happen to use Windows Vista's stock photo viewer, which has nice \"fixing\" tools.  In most cases, you do not need to doctor the photos at all, the Auto setting really takes the guess work out of it.  Using the scene mode \"Beach\" on extremely bright days works wonders too, it allows the camera to keep a high exposure setting, without automatically reducing light like it would on Auto.The pictures have very lifelike color, and when you know how to use the flower (close-up) and mountain (distant landscape) buttons on the top of the camera, you can create excellent photos like the pros. It has a self-timer, to take a family shot with you in it too. It even has a feature that takes several quick pictures in one second, for things like fireworks, lightning, or the bat hitting the baseball.  Scenarios where you don't know the exact moment you're looking for.The camera is VERY user-friendly.  You can be a total electronics novice and still understand this camera's features.  It actually explains on-screen what each icon (symbol) stands for, so there's no guessing.You can customize every avenue of this camera too.  For instance -you can turn the display screen off, in case you're hunting or something and want to remain incognito...it has an old-fashioned optical viewfinder for just such scenarios too. You can set the color mode to b&w;, sepia, low color, natural color, or high color for creating special pictures.  You can set the date to display on your pictures or not, you can have the camera make a couple different sounds when you take the shot, or have it be silent.  Best of all, the camera lets you know BEFORE you take the picture if it's correctly in focus with a steady green light near the optical viewfinder for OK, or a flashing red light for when something's not quite right.  And the focus brackets on the screen allow you to see what the camera will be focusing on in the picture, so you don't find out later your wife's face is blurry yet the tree 30 yards behind her is crisp and clear!All in all, this camera is a powerful little bundle that wants to be your friend.  You may be able to luck out and find a new one on eBay for around $100-150, if so snag it up before it's too late.  Put it this way, if mine breaks or gets stolen, I will without fail buy this exact same camera for a replacement without thinking twice.  You will not be disappointed.", "Date": "October 15, 2007"}, {"Title": "ok expensive and nothing special", "Author": "P. Cofrancesco \"PaulC\"", "ReviewID": "R29B7AGZBLGNL9", "Overall": "3.0", "Content": "I use this for a number of years took good pictures with it have the memories and now it's in the dustbin of history.", "Date": "January 3, 2014"}, {"Title": "Worth the money", "Author": "sdbob1949", "ReviewID": "R1YBGVPZFODDOE", "Overall": "5.0", "Content": "I do a lot of inspections and I have other of this model of camera and I wanted another one. I took it out on the first trip I went on and it worked like a charm. Great buy at a great price. It was everything that it said it would be.", "Date": "October 13, 2013"}, {"Title": "My purchase of a used Kodak Easyshare Z730  5 MP Digital Camera with 4xOptical Zoom", "Author": "Florence D. Pierson", "ReviewID": "RMF53UBBKNU1K", "Overall": "4.0", "Content": "I'm really glad to have a replacement for my original camera Z730.  The only thing I could fault about it is the difficulty in opening the lens.....that was also a problem on my first camera.  I can live with it !!!  The price was RIGHT.", "Date": "September 1, 2013"}, {"Title": "Beautiful Photos, Love this camera - So sad it is no longer working after 5 years!", "Author": "J. Bonsted", "ReviewID": "R24TWIWGFZPSJ1", "Overall": "5.0", "Content": "I am writing this simply in case anyone out there is looking at purchasing an older model camera either new or used.  It is now 5 years since I bought this camera.  From what others have told me, not many digital cameras last that long.  I have loved all the features of this camera and am constantly getting compliments on the photos I take.  I don't think it is just my photo taking ability, but also the quality of the camera. Unfortunately, as someone else mentioned in a review, I am now having lens issues and it will no longer turn on because the retractable lens is not functioning properly.  For a while I could force it to stay in place and still take some photos, but now it won't at all.  I am distraught over choosing another camera because I am worried I won't have photos with the same great quality.  As the other reviewer said, it isn't cost effective to repair this camera, but I will probably have my hubby tinker with it to see if we can get lucky.  A little more than a year ago I dropped the camera on my tile floor.  I had the same lens issue then, hubby took it apart - despite having no knowledge of camera repair - and got it working again!  I'm not sure what made it stop working this time.  It was working fine and later that day, wouldn't anymore.  But it has really held up to a lot over the years and I hate to see it go!", "Date": "August 15, 2010"}, {"Title": "Best camera for people who blink a lot during pictures", "Author": "Sean Munnings \"Raga-Lover\"", "ReviewID": "RCNI7QLBPLA9N", "Overall": "5.0", "Content": "This camera has been my saving grace.  Other cameras always show me blinking due to the delay between the flash and the image capture.  This camera does not have that problem and I look normal in the photos.  The Kodak software enhances the pictures beautifully.  It is a shame that this product has been discontinued but I bought two second hand cameras because I don't want to go back to having pictures with my eyes closed to commemorate my events/parties. The video function works well.  I have many videos on youtube thanks to this camera.", "Date": "January 30, 2009"}, {"Title": "An Amazing Camera", "Author": "Skybreaker", "ReviewID": "R3K2BTSLRUF3Y8", "Overall": "5.0", "Content": "Ok. All I'm going to say is this:At the time I'm writing this, I've had this camera for over two years. and it's still performing just as it did when I first got it.Picture quality is greatgreat \"scenes\" modesTake good care of this thing and it will last you for practically as long as you want it.", "Date": "January 13, 2009"}, {"Title": "Best digital camera", "Author": "Kathleen W Moses", "ReviewID": "R2YPILW6OZ182Y", "Overall": "5.0", "Content": "I just love this camera! As a matter of fact, my first digital was the previous model of this one and I dropped it in the parking lot where I work. I didn't realize that the camera was missing until the next morning when I pulled into my spot! OH NO!!!! Knowing how pleased I was with this camera, I didn't hesitate to get the same one as my new one! It is an easy camera to work with when taking pictures, loading them on my computer and just over all the best camera! I love it.", "Date": "December 16, 2008"}, {"Title": "A wonderful camera for a budding photographer or just the average joe...", "Author": "Christina D. Bell", "ReviewID": "R2MYEI9VTL1O5R", "Overall": "5.0", "Content": "I bought this camera in 2005. It was the first digital camera I ever bought, or had really even used up to that point. I'm still using it to this day, matter of fact. It takes beautiful, rich colored pictures with no delay or lag. The settings are easy to use, and though most will find the auto feature to be more than enough for great shots, having all the day, night, beach, snow and other scene features has been awesome for adding a little something extra to my pics.I take it with me everywhere. It may be a little thicker and heavier than most new modeled cameras, but it's still easy to tuck away in a purse. The camera has been used primary for taking pics and videos of my youth students...and has gone through everything from the grimy hands of 14-year olds grabbing it constantly, to being dropped in sand and the ocean. Never once has it stopped working! It takes great videos with great sound quality, and unlike some digitals, it takes as much video as you have the memory for...no 30-second time cap!I highly recommend this for anyone who wants high-quality in a simplistic package. Especially when you look at the cheap prices you can find this camera for these days, it's definitely a top contender in my book.", "Date": "October 8, 2008"}, {"Title": "Nice, but too large for my hand", "Author": "C. Burton", "ReviewID": "R33G9ADXFP7CFM", "Overall": "4.0", "Content": "This camera was nice and took great pictures, but it was simply too large for my hand.  I have arthritis and the size and weight were too much for me.  The seller was terrific and refunded my purchase price and shipping costs immediately.", "Date": "June 16, 2008"}, {"Title": "great value!", "Author": "Jonathan G. Shay", "ReviewID": "R18ZTQOBMCA4GW", "Overall": "4.0", "Content": "It's been great--nice resolution on both pictures and movies.  Very versatile and adjusts well to may different conditions.  Cuts down on red-eye very well--not 100%, of course, but pretty close.  Sound quality on (quicktime format) movies is good.  Simple enough that our 4-year old can operate it, but advanced enough to permit me to create video presentations for my high school students (after uploading movies to a Mac and using iMovie to edit...).Good shutter speed and reaction time as well.", "Date": "May 18, 2008"}, {"Title": "Great camera for the price", "Author": "kenneth W. Shaw \"ken shaw\"", "ReviewID": "RDP276EMMKNT2", "Overall": "4.0", "Content": "This an excellent all-around camera with many different settings.  It has 5 megapixels which is enough for most anyone....and an optical zoom of 4.  For most people, this is enough, however my next camera will have 10 or 12 for the optical zoom for pictures I take at Yosemite.", "Date": "February 4, 2008"}, {"Title": "A very nice digital camera", "Author": "L. Callahan", "ReviewID": "R1NBZUFEINBPBY", "Overall": "4.0", "Content": "I've had my camera for about two years.  It holds about 20 pictures a 5 MP/ea without an extra memory card.  The pictures are nice an clear.  I can't imagine needing anything more than 5 MP.I have had some trouble with strange light spots appearing on the pictures in flourescent lighting, but I haven't been able to figure out why.  Indoor group pictures can also be a little difficult if lighting isn't adequate.  Usually, I can edit the photo on the computer to \"turn on the lights\" later.", "Date": "January 8, 2008"}, {"Title": "Great . . . until it BROKE", "Author": "Richard L. Elias", "ReviewID": "R12COOHIPWF9VP", "Overall": "4.0", "Content": "This is -- WAS -- a terrific camera.  Great features, easy to use , versatile.  The optical viewfinder is getting to be a rarity these days, so that's an attractive feature.  The modes range from night fireworks to beach pix . . . whatever you want to photograph, there's a mode for it.  The burst shoot mode -- steps up exposure each frame -- is VERY useful for folks who want to Photoshop the best picture possible by taking parts from each frame and putting'em together.  Another plus (for me): the camera is small enough to put in your pocket but not so small that you'll lose it! This may sound like a stupid reason, but believe me, it isn't!Now the bad news:  Two months after the warranty lapsed the lens shutter won't open.  This is the shutter that covers the lens when the camera is off; power on should cause it to retract.  Mine no longer does.  EVERYTHING ELSE WORKS!  If I hold the shutter open, I can take and review a picture.Kodak wants $125 to repair it.  Or else can I turn it in and get a 15% credit on a cameras purchased on their website . . . and a refurbished Z730 costs $129 (less a 15% discount if I send my broken one in).I'm really bummed out about this because I LOVED this camera . . . my 4th digital. (My first was a Kodak DC220 I bought in Singapore in the stone age of digital photography.)  I don't see much point spending almost as much as I paid for the camera to repair it . . . and I'm annoyed that NOTHING electronic seems to last much over a year ANY more!", "Date": "July 21, 2007"}, {"Title": "Durable - Affordable - Capable", "Author": "R. Scott \"macfanboy\"", "ReviewID": "R23ZERQNEWAZ1O", "Overall": "4.0", "Content": "I purchased this camera brand new for a fraction of the price of my first digital camera.  This is my second point and shoot digital camera since I have abandoned film.It is a very solid and durable and it takes beautiful pictures.  It has almost no shutter lag time and the battery has never run out on me.  I have used it on an entire week long vacation without re-charging it.Kodak keeps making these cameras better and more reliable for less.", "Date": "February 27, 2007"}, {"Title": "awesome camera", "Author": "Heather M. Robertson", "ReviewID": "R1562P7PMUX7ZB", "Overall": "5.0", "Content": "I had some gift cards so I went to buy my first digital camera. I went to a local electronics store and I had a certain financial cap. I wasn't thrilled with my choices but this camera caught my eye and I just fell in love with it. I spend more than I had planned but it was 100% worth it. the camera is very easy to hold, its not too small, and its not too big. It fits easily into my purse. the pictures are beautiful, the battery life is great and I have yet to exceed the amount of pictures I can store. I have over 300 now on the extended battery. The only gripe I have is having to reset the time every time I put the battery back in. its a minor inconvenience. The screen on the back is larger than a lot of them out now. that was a major deciding factor.. that and a good zoom. It has a very nice silver color too.for my first digital camera, this was a perfect choice.", "Date": "February 7, 2007"}, {"Title": "Easy to use.", "Author": "KIP", "ReviewID": "R2368SA0TT13WB", "Overall": "5.0", "Content": "I purchased this camera for my son.  He is a doctoral student and needed to photograph items for his research.  He was able to learn to use it quickly.  The battery life is phenomenal.", "Date": "December 15, 2006"}, {"Title": "Its worth the money you spend", "Author": "Muralimohan Yepuru \"murali\"", "ReviewID": "R13FH5K563IWHD", "Overall": "5.0", "Content": "It is more than I expected, in one word I rated this camera a 5 star", "Date": "January 17, 2006"}, {"Title": "mixed review", "Author": "Rad63", "ReviewID": "R143OU4HUX9F0Q", "Overall": "4.0", "Content": "I have owned the Z730 a couple of months.  It has strengths and weaknesses. The instruction manual is extensive but often does not answer the question that I have. This is annoying and asking questions on the Kodak.com Z730 web site is difficult as I often get answers not pertaining to the question. The image quality is mixed and somewhat disappointing though this may be my fault and perhaps with further experience the quality will improve. I tend to spend a lot of time on my photo program correcting underexposure.  On the positive side, the camera is easy to handle and many of the settings are easy to change. The screen and view finder are good., Review and delete are easy. The overall quality and finish of the camera appear good. I would suggest a spare battery but battery life is not a major problem. The nicest and probably an outstanding feature is the absence of lag when you push the shutter. Unlike all the other digital cameras I have used, photo opportunities are not missed with the object (particularly a child) exiting the frame while I am  waiting for the shutter to eventually fire.. This camera does not have any more shutter lag than a film camera and has a nice shutter noise like a film camera.", "Date": "December 30, 2005"}, {"Title": "I must have gotten a dud...", "Author": "C. Dyer \"Alyssasmommy\"", "ReviewID": "R12MU5KDNOZ7X9", "Overall": "2.0", "Content": "I bought this camera a few days ago and none of the pictures that I have taken have come out right.  The LCD screen appears dark and blurry.  95% of the pictures that I have taken have come out blurry.  The color quality is dull, not what I usually see with Kodak cameras. The software is useless.  A friend on mine owns the Kodak DX7440 (which is the exact same camera but 4 megs instead of 5) takes beautiful pictures with vibrant colors.", "Date": "December 30, 2005"}, {"Title": "Superb!!!", "Author": "Nic", "ReviewID": "RAYJJE5WW9WF3", "Overall": "5.0", "Content": "I loooove this camera. It is easy to use and the pictures come out natural, unlike most other digital cameras I've used. High-end quality product at an affordable price. What more can you ask for...", "Date": "January 10, 2006"}, {"Title": "Showstoppers for Purchasing this Camera", "Author": "Brian Mathason", "ReviewID": "R1XRBSLJXVUWFS", "Overall": "2.0", "Content": "This is the first digital camera that I have owned.  Overall I am generally satisfied with the quality of the pictures it produces.  However, there are a few things that, if I had known beforehand, would have prevented me from purchasing this camera.1) Camera is not plug-and-play (even if they say it is).  You have to install the Kodak EasyShare Software to download pictures.  This is a HUGE negative.  In the future, I will only buy cameras that show up as removable storage drives when plugged into a computer.2) Video is stored in Apple Quicktime format (*.mov).  The is also a huge negative.  The codecs for this format are not widely available for application integration.  You have to download and use Apple Quicktime to view them.  You can not view the videos in Windows Media Player.  It is also not compatible with some photo-album software.  I would only buy cameras in the future that have an option to store video in a non-proprietary format.Update:  After review, I have found that WinXP and Vista plug-n-play with the camera when it is plugged into the USB port.  It does not work on Win2k.  Thanks for the comment that made me double-check.", "Date": "December 22, 2006"}, {"Title": "Not so happy", "Author": "Jonn of Mars", "ReviewID": "R317YEYKINNWOS", "Overall": "2.0", "Content": "I am no photo expert, I count on the camera to be smarter than me and take great shots on the fly. The Kodak EasyShare Z730 does not do that for me. Almost always slightly fuzzy, touchy in room light and almost useless in darker settings. I bow to those other reviewers whose knowledge of cameras makes this a great choice for them. I would suggest that if you, like me, lack the skills and knowledge but would still like to score the occasional decent photo then this camera is not for you.", "Date": "March 2, 2011"}, {"Title": "kodak easy share camera", "Author": "J. O'BRIEN \"voice of experience\"", "ReviewID": "RRPKEQQ3UK8V4", "Overall": "2.0", "Content": "Disappointed in condition.  No memory stick or manual or instructions came with camera.  Had to print owner's operating manual, all 46 pages, to learn how to use camera.  Have had no success taking photos.  Will not buy another electronic device from Amazon.Kodak EasyShare C340 5MP Digital Camera with 3x Optical Zoom", "Date": "April 7, 2008"}, {"Title": "unreliable!!!", "Author": "Benay Edens", "ReviewID": "R3RSMTU831NEFG", "Overall": "1.0", "Content": "from purchase the flash only worked on \"special\" settings!!  had to send in for repair. within 3 months the lens worked only intermitently. within 2yrs it was dead!!!", "Date": "January 5, 2008"}, {"Title": "Good little camera!", "Author": "bookgeek", "ReviewID": "R12TGJ0A4VNPGQ", "Overall": "5.0", "Content": "This is a great little camera for the money spent.  Also, since I'm no technology nerd I need a camera VERY easy to use and this is it.  You won't get a much better camera for this price.", "Date": "September 24, 2005"}, {"Title": "MY LOSS!!!!", "Author": "MAXWAY 625", "ReviewID": "R1JU8CSP53S98Q", "Overall": "3.0", "Content": "I FOUND THE CAMERA TO BE OKAY BUT THE BUTTONS ARE TO HARD TO TURN AND I TURNED THE BUTTON ALL THE WAY AROUND BREAKING IT AFTER HAVING IT FOR 2 MONTHS .", "Date": "February 4, 2007"}, {"Title": "Windows XP problem", "Author": "A Customer \"acustomer2\"", "ReviewID": "R2FXXQV4LOKXEW", "Overall": "1.0", "Content": "I have a different model Kodak camera, however they all use the same EasyShare software. Running Windows XP, I could not get the software to work properly. After several hours on the phone with Kodak tech support, they couldn't get it working either. They said they are aware of the problem on some computers running Windows XP. It is now several weeks later and they still don't have a fix. They don't really seem to care either.It might not be a bad idea to consider other brands, instead of Kodak. Since, if the software won't work properly, then what good is the camera?", "Date": "April 19, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "New continuous shooting and bracketing modes\nProfessional-quality Schneider-Kreuznach Variogon 4x optical zoom lens\n5.0-megapixel CCD captures enough detail for photo-quality prints up to 13 x 17 inches\nKodak Color Science image processing chip\n2.2-inch high-resolution indoor/outdoor display", "Name": "Kodak Easyshare Z730 5 MP Digital Camera with 4xOptical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/512EKGGBMTL._SX300_.jpg", "ProductID": "B0007RALGO"}}