{"Reviews": [{"Title": "nifty little camera, good value", "Author": "learjeff \"learjeff\"", "ReviewID": "RTEQ25BV43OMZ", "Overall": "4.0", "Content": "This is a neat little camera if you want an inexpensive digital camera and don't need high quality pictures.Picture sizes are 640x480 or 1280x960.  It holds 53 pictures regardless of size.  Each image takes 2 to 6 seconds to download on my 700 mHz machine; it varies with picture size and complexity.  The 1280x960 pictures do indeed have better resolution than 640x480.It's the size of a credit card, but about 3/8\" thick so it won't fit in a wallet.  At the lens, it's about 1/2\" or 5/8\" thick.  It's light enough that I forget I have it in my pocket.  I plan to keep one in my laptop briefcase, to take pictures of whiteboards before they get erased.  (I won't be able to read all of what's written; the image quality isn't quite good enough.)Very easy to install and use.  Once the software is installed, just plug the camera in.  If there are any pictures in the camera a popup appears.  Just click OK or hit space to move them to your computer (or click Browse to navigate).  Fine for even techno-challenged folks, if they can find the USB port.  The unreplacable battery recharges through the USB cable.The biggest limitation is no flash.  Takes OK pics in a typical well-lit office setting, but you have to hold it very still.  Fine outdoors even on cloudy days.Optics are not great (what do you expect from such a tiny lens?)  There is very noticeable radial lens distortion (straight lines near the picture edge bow outward).  Resolution problems are noticeable when you display the images at full size, but images are fine up to a print size of 4x6\" -- like an Instamatic or a disposable.Of course, it doesn't have any of the nice features we expect from bigger or more expensive cameras.  No zoom, no image display.For example shots, see ...\".  The first image is 640x480, the second is 1280x960.It's a great novelty or convenience, and it's very affordable.", "Date": "October 18, 2002"}, {"Title": "1.3  MEGAPIXELS  IS  VERY  MISLEADING...BEWARE!...", "Author": "logitechcam.10...", "ReviewID": "RY9E0SGJ2184I", "Overall": "2.0", "Content": "This item is advertised as 1.3 MP. Very misleading. When you measure pixels the TRUE measurement is the CMOS sensor resolution. For this camera, the CMOS sensor resolution is ONLY .35 MP. Yes, that is right -- .35 --. The 1.3 MP this camera markets on the outside of the box is INTERPOLATED pixelization -- this is an algorithimic method of \"blowing up\" or \"magnifying\" the image -- often making the image look very pixelated. For a small pocket sized inexpensive digital camera with TRUE CMOS sensor resolution, look to the Aiptek PenCam SD 1.3-Megapixel Digital Camera. This is actually cheaper priced, allows you to take video, and has a memory expansion slot. By the way, if your batteries run out, you can replace them -- unlike with the Logitech which comes with rechargeables BUILT IN -- guess you have to throw the camera away when it stops holding a charge?!", "Date": "November 25, 2002"}, {"Title": "One of the better mini cameras", "Author": "Chris Lee \"chrslee3\"", "ReviewID": "R2QE0X9MK9B5QG", "Overall": "4.0", "Content": "Let's face it, mini cameras like the Logitech Pocket Digital are not intended to give you top quality pictures.  They are intended to be small enough (and cheap enough) to be taken to places where full size cameras would not normally be taken.  People need to stop comparing them to cameras that cost hundreds of dollars more or cameras thatare 3 times its' size!  That said, this a good mini camera, compared to other cams I've used- I compare the Logitech Pocket Digital to the Sipix Blink, and Spypen Luxo.  Under day light conditions-- Colour balance: a little off, slightly worse than Spypen Luxo, much better than Sipix Blink; visual lens distortion - slightly better than the Luxo, much better than the Blink (bad distortion); White balance - same as Luxo, better than Blink; battery life/ battery circuitry- far better than either the Luxo or Blink.  The The Pocket digital does lack the Web cam and contiuous mode that the Luxo and Blink both have, and has a slower shutter, but more than makes up for it with a solid housing, twice the memory, flawless WinXP connectivity and Big name support.  Ranking low light performance from best to worst: Blink, Spypen, Logitech Pocket Digital.  The Pocket digital is the worst performing low light camera with the most underexposed and dark shots.  Under poor lighting conditions- all the cameras perform exhibit chromatic aberration, colour balance, exposure and white balance problems. Just make sure there is plenty of ambient light if you want your pictures to turn out.  Especially in lower light you need to be very STEADY as you press the shutter, otherwise you'll have a blurry picture.  Go [online] to check out sample pics.", "Date": "October 18, 2003"}, {"Title": "Not really 1.3 megapixels, but simple and convenient", "Author": "Joe", "ReviewID": "R2207JOS2TVUT0", "Overall": "3.0", "Content": "If you want a camera to take VGA quality pictures that you can carry easily in your pocket, this is a good choice.  I had researched this camera long before it came out, and was excited that it purported to have 1.3 megapixel resolution, but after I bought it and read some more reviews I found the fine print saying the 1.3 megapixel resolution is \"interpolated\" from native VGA resolution (VGA is 640x480 pixels, or about .31 megapixels).  All that means is that the camera \"dithers\" or basically breaks up the captured pixels into more pixels, which doesn't really do much to improve picture quality.  Despite that disappointment and my view that the advertised quality is very misleading, I kept this camera because it does what I wanted -- it lets me very easily carry around a camera that takes pictures in daylight that are good enough to e-mail.  If that's all you want, and the price is acceptable, you'll be happy with this camera.", "Date": "August 14, 2002"}, {"Title": "1.3  MEGAPIXELS  IS  VERY  MISLEADING...BEWARE!!!", "Author": "logitechcam.10...", "ReviewID": "R2GUGW69ALP2WN", "Overall": "2.0", "Content": "This item is advertised as 1.3 MP. Very misleading. When you measure pixels the TRUE measurement is the CMOS sensor resolution. For this camera, the CMOS sensor resolution is ONLY .35 MP. Yes, that is right -- .35 --. The 1.3 MP this camera markets on the outside of the box is INTERPOLATED pixelization -- this is an algorithimic method of \"blowing up\" or \"magnifying\" the image -- often making the image look very pixelated. For a small pocket sized inexpensive digital camera with TRUE CMOS sensor resolution, look to the Aiptek PenCam SD 1.3-Megapixel Digital Camera. This is actually cheaper priced, allows you to take video, and has a memory expansion slot. By the way, if your batteries run out, you can replace them -- unlike with the Logitech which comes with rechargeables BUILT IN -- guess you have to throw the camera away when it stops holding a charge?!", "Date": "November 25, 2002"}, {"Title": "i thought long and hard if i should buy this....", "Author": "\"mctak\"", "ReviewID": "R1FFPQMIZ062L6", "Overall": "5.0", "Content": "After reading so many reviews from different sites not to mention all the personal reviews, I decided to purchase the camera.  I received it today and took 40 pics: indoor and outdoor, during different times of the day, being very still and just casually holding it.  Only 5 out of the 40 pics came out bad b/c they were taken indoors in the early evening.  All my other pics came out great!  I guess I was expecting so little I can't get over how cool this camera is.  If your considering buying this camera you have to know what it is for and that you can't compare the picture quality to a Nikon 3 megapixel.  Everyone who complains about the camera didn't do their homework before purchasing it and was expecting something its not. - It's not for indoor use although with decent lighting pics come out fine- It's not for printing out pics on your inkjet- It's not for someone who can't take the time to be relatively still...really you don't have to be THAT still!- It's for FUN! Carry it to the park or baseball game... Email the pics you take (use the lower setting)", "Date": "June 12, 2003"}, {"Title": "Photo Quality", "Author": "W.J.  Hull", "ReviewID": "R3T5VQZGSQDAIJ", "Overall": "3.0", "Content": "I am happy with this Logitech Pocket Camera because:  It's simple to use.  It's light, small and it looks good.  It's easy to load to PC with it's software.  It takes excellent shots outdoors in sun light.I am unhappy with it because:  It needs a flash or real bright light for indoor shots.For the price, as you see, I have only one dislike. If you want better quality, you have to pay for it. 1.3 megapixels is  minimal. 4\"X 6\" prints should be the largest for the best clarity and sharpness. All in all, it's a great camera for the price.", "Date": "February 11, 2003"}, {"Title": "Great Camera for the size and cost", "Author": "Lynn", "ReviewID": "R1MKI6AWCTUV2N", "Overall": "4.0", "Content": "I have found this camera to be very easy to use and the pictures are good enough to share with friends.  I have not missed the lack of an LCD viewer, which can drain a battery faster than one can fill the memory with pictures.  This camera battery is recharged automatically every time pictures are downloaded into the computer, and the battery has the capacity to take all 53 pictures that the memory holds.While the camera CMOS only has a 640 by 480 resolution, you have an option for the pictures to have a 1,280 by 960 image size.  I am not sure how the camera does it, but the larger image size does have a higher resolution.  To test this, I started with a 640 by 480 picture that I had taken with the camera and doubled the pixels using Adobe Photo Deluxe; I could not achieve the resolution of the Logitech camera when used in the 1280 by 960 mode.  While the pictures may not be up to the standards of a true 1.3 megapixel camera, they are good enough, considering the convenience of this easy to carry camera.", "Date": "August 27, 2002"}, {"Title": "Handyness makes up for everything (just about)", "Author": "Bradley D. Hall", "ReviewID": "R3CPV1P431VJC", "Overall": "4.0", "Content": "Most of the negatives of this camera have already been discussed -- photos have a greater tendency to blur than with other cameras. Not a lot of pixels. No flash and so-so performance in low light.BUTThis camera is small enough to keep with you anywhere, any time. It is so small and light it will fit in a shirt or jacket pocket and you will forget it's there.One problem I had though -- and I haven't seen it mentioned in other reviews so maybe it's just my camera -- the viewfinder is not very reliable. Photos that seem well framed in the viewfinder sometimes have the top or side (depending on orientation) crowded when downloaded.", "Date": "September 3, 2003"}, {"Title": "Not a bad camera after you learn it...", "Author": "D. Ho", "ReviewID": "R3NNLIQI6YLT91", "Overall": "4.0", "Content": "It's not a bad camera after you get the hang of it. When you first use it, pictures might turn out blurry or jagged indoors or outdoors, but after a lil practice you'll get it. Main thing is holding the camera steady. Don't jiggle the camera when pushing the picture capture button and all the jaggedness will go away =)Not too bad of a quality either. 640x480 resolution but it's quite handy =)", "Date": "August 20, 2003"}, {"Title": "no brainer camera", "Author": null, "ReviewID": "R1QZX76AZTOBA9", "Overall": "3.0", "Content": "this is a cute little fun camera. it is great for taking those quick shots. perfect for catching those \"gee i wish i had a camea moments\". my only problem with the camera is the lack of flash. if it had a flash for indoor photos it would be even better.", "Date": "June 23, 2003"}, {"Title": "Good camera for the price", "Author": null, "ReviewID": "R3FNY81EF1Q0X7", "Overall": "3.0", "Content": "I purchased the camera last xmas and took few pics indoor and outdoor. The pics outdoor came out fine, some of the indoor ones came out very dark. You need a very bright setting for indoor pics to come out good. Overall the camera is fine for the price I paid, I can take it every where I go because of the light weight and small size, and it looks very neat. I also like that battery charges automatically while you download pics to the PC instead of having to replace batteries. Downloading pics is very easy, just plug in the USB cable to the computer. But again if quality is your main goal, this is not the camera for you.", "Date": "January 8, 2003"}, {"Title": "A great NOVELTY camera.", "Author": "Schadenfreude", "ReviewID": "RMSEZAP8D4AE5", "Overall": "4.0", "Content": "I bought this camera knowing that it was for pure NOVELTY.  If you are thinking of making this your primary digital camera, you should think again.  This is a good camera for those who already have a good 2-3 MP camera, and just want a camera for those quick-moment times.  I primarily bought this for hiking, because I don't want to lug around a bigger camera.  It's working fairly well outdoors, but forget about taking pictures indoors in dim rooms.  I'd definitely pick this camera over the Creative CardCam (why pay the same price for less memory?).", "Date": "June 27, 2003"}, {"Title": "good but no cigar", "Author": "\"slewis88\"", "ReviewID": "R1G8BGX927OVHB", "Overall": "4.0", "Content": "I love this camera; it is small(I mean small),lightweight, fun and takes good pictures with the price and size in mind.  There were some MAJOR bad things though. First their is no LCD, no zoom, and noremovable memory medium.  The idea is great and it does look great, plus I was able to get it for $$$.  The major thing that you have to keep in mind is that you shouldn't compare this $$$ camera with a $$$ camera becuase that what this camera is all about; ...and small.  While others are sure much nicer, none compare with this one when you factor in looks, price, size, and straight-forward design.  And oh yeah, I am not a Logitech Sales Rep.", "Date": "August 29, 2002"}, {"Title": "Terrible Picture Quality", "Author": null, "ReviewID": "R8K6ON5XBN2SM", "Overall": "1.0", "Content": "If you plan on taking pictures indoors with this camera, save yourself the hassle of returning it and run away now. This camera has no flash, and therefore all indoor pictures are dark, blurry and terribly out of focus. Stay away.", "Date": "January 1, 2003"}, {"Title": "Great for what it is.", "Author": "Dave in Connecticut", "ReviewID": "R3J07FL2HDIQ6Y", "Overall": "4.0", "Content": "Anyone who doesn't like this camera doesn't understand what it's intended to do; it's not a $700 digital. The pictures are not perfect, but it's a fun little camera that takes fun pictures (excellent for parties if there's enough light) and, yes, they do come out pretty well. The MGI software is ok, but I still prefer my Photoshop.", "Date": "March 28, 2003"}, {"Title": "Small, Sleek Cool.", "Author": "Randy Johnston, http://rblog.vze.com", "ReviewID": "RZG9XQPH8SPY0", "Overall": "4.0", "Content": "This small Logitech Pocket Digital Camera is perfect for uploading and sneding images in email, or putting images on your webstie.  Its small size can fit almost anywhere.  There is no LCD display, which means you cannot see the image until you upload it to your PC.  This camera is perfect for what I do, upload images to my website.  Do not expect to get high-quality prints from this digital camera.  If you want printed images that look nice, look elsewhere.  But, if its small prints you want, or a camera that uploads pictures to the web, this is the camera for you.", "Date": "May 18, 2003"}, {"Title": "logitech cam", "Author": "Adrian Garcia", "ReviewID": "R2KMU3UV5PJ5XS", "Overall": "4.0", "Content": "its a good digicam.. i love it.. except the bad part is the pictures at dawn or night. or inside a housearent really brightbut other than that. take pics in the sunlight and they come out really really nice.... i love this camera.. many people ask me what it is.. and they cant believe its a digital camera...", "Date": "July 16, 2003"}, {"Title": "Disappointing Digital Camera", "Author": null, "ReviewID": "R16G22QWWOO43R", "Overall": "1.0", "Content": "I recently purchased this camera and was very disappointed. I am hoping to return it. The photos come out with a greenish haze and are not very focused. I tried photos inside, outside and in my office and they all turned out the same. I also had difficulty installing the camera on my HP tower. I contacted Logitech support and it took 2 days for the first reply which was that i needed to call in from 7am to 5pm PST. Those are my work hours. When I responded this was not satisfactory, I got an email with instructions that I finally was able to get the camera installed.You get what you pay for. A disposable camera with 35mm film takes way better photos.", "Date": "October 2, 2002"}, {"Title": "As kid friendly as it can get", "Author": null, "ReviewID": "R3C4EH7LTCPHG1", "Overall": "3.0", "Content": "This camera is perfect for kids.  With only three buttons (shutter, hi/low resolution, sound on/off+self-timer) it is very easy to use.  The Windows-XP software is also easy to use: plug in camera to USB port, press download button and pictures are transfered and deleted from the camera.  The camera uses the USB port to charge the battery.  My 6 year old daughter can take pictures and download them without any help.  It was also a big hit at show-and-tell.Daylight photos are good enough for kids.", "Date": "February 4, 2004"}, {"Title": "Sleek, Compact, Cool.", "Author": "Randy Johnston, http://rblog.vze.com", "ReviewID": "RO3EIZRO0JSLU", "Overall": "4.0", "Content": "The Logitech Pocket Digital USB PC Camera is a very small sleek camera.  It easily can fit into a pocket.  The price is very low, which is a good thing.  There is no LCD display screen, which means you are not going to be able to see the pictures until you upload them onto your PC.  Now about the  quality.  The quality of the pictures is poor, but what I am using them for does not require a high quality photo.  The main purpose of this camera is to upload pictures onto my website. Do not expect to get high quality printed photographs from this camera.  This camera is perfect for capturing images for sending emails, and for putting on your website.", "Date": "May 18, 2003"}, {"Title": "Poor Picture Quality", "Author": "\"ericrose62\"", "ReviewID": "R1AB9EW6KUSFD4", "Overall": "1.0", "Content": "This is a very cool gadget, but unfortunately the picture quality is poor at best, and horrendous at worst.  Indoor shots under good lighting (at work, for instance) are just awful.  I was going to post some shots on my webshots page, but it's not worth the bytes it takes up.  Take my word for it:  terrible.  My workmates thought it was so cool, then I uploaded the pictures and they all laughed in my face.  The outdoor shots, under ideal lighting, were also bad, but at least you could recognize what I took a picture of.  A dazzling display of flowering daffadils and tulips looked vaguely like dull, washed out flowers of some sort.  A beatiful sky, complete with mountain enshrouded with clouds, broken clouds in the sky, a real beatuiful Vermont scene, looked like a dull, washed out overcast day.This was not what I was expecting (even after reading some other bad reviews), but I learned my ...lesson the hard way.  This thing is way cool in your pocket, and completely useless out of it.  Do yourself a favor:  keep searching.", "Date": "May 13, 2003"}, {"Title": "I bought one used", "Author": "Gregory Parkinson \"Sometimes I'm Quite Practical\"", "ReviewID": "RNR5SNL40IWQH", "Overall": "3.0", "Content": "and I think I paid the right amount of money.  It's NOT a 1.3MP camera, it's a .3MP camera that will mindlessly duplicate pixels until you have larger image.  Not a worthwhile function, and a big fat lie in the context of how it's advertized.If you leave it at the smaller size, you get pictures which vary in quality but can be fun.", "Date": "November 21, 2002"}, {"Title": "A-Mayzing!", "Author": "Stephen Quinn \"Unclezeebie\"", "ReviewID": "R39BCCLSAK1YHY", "Overall": "5.0", "Content": "I bought this camera before Amazon had it (sorry, folks) and was really astonished at the quality of the images.  I printed them at 5x7 size with a standard HP printer (not photo, or anything special), and was more than just pleased.No problems with camera shake -- a real consideration with very light cameras -- and extremely easy to pocket, with no worries about dust on the lens or viewfinder, they're both covered when the shell is closed.It's worth the money, I'm pretty sure you'll enjoy this.", "Date": "November 1, 2002"}, {"Title": "sweet camera", "Author": null, "ReviewID": "R1HTAELBMRMKB6", "Overall": "4.0", "Content": "This camera has its good qualities along with its bad.  First of all it can fit in your pocket or even in your wallet.  Second of all it has a sliding cover for the lense. It also has a sweet silver look.  When you go to download pictures to your computer you only have to click and your pictures are downloaded.  The product even charges while it is plugged into the usb port.  The camera also comes with a cd of drivers and programs to make it possible to dwnload your pictures.  Along with these good features are the bad ones.  The camera regretfully does not have a flash, but wat can you expect from a credit card sized camera.  It also does not have a zoom.  Overall this camera is a great camera if you want a small camera that will be with you wherever you go this is for you.", "Date": "July 1, 2002"}, {"Title": "It's good for what it's good for....", "Author": "CPUsports", "ReviewID": "R1UF825MFU7I1J", "Overall": "4.0", "Content": "This camera is all about portability. Don't expect much more than a cool little camera you can slip into a shirt pocket & you won't be disappointed.Installation is easy and the camera is a snap (no pun intended) to use.Great gift for a kid....", "Date": "April 8, 2004"}, {"Title": "when size matters", "Author": null, "ReviewID": "R2IZ4YU1CRNRU7", "Overall": "4.0", "Content": "ok guys,  if  you want to be  ahead of trend this is for you, it has tiny problems to match its tiny size,. not great indoors because it loves light. but outdoors. this is a delight.. you drop in in your purse, or slip in in a back pocket.  noone even knows you taking a picture because noone would ever know it is a camera in your hand.  how cool is that. everyone will ask you where did you get it? lol  you feel like you are  james bond at every event. i have a mac and it does not download but my husband has a pc he just forwards  them to me..  for the money and the size this camera is tops.  it is the camera you will never forget whereever you go. if you are  taking along  your credit card then you can fit this.  i just love it...", "Date": "July 5, 2003"}, {"Title": "What a disappointment", "Author": "Mat", "ReviewID": "R1G9PV219U641Z", "Overall": "1.0", "Content": "I got this camera to enable me to take quick pictures for use on websites. I was not looking for amazing quality, but the images produced by this camera were absoulutey atrocious. I think it is one of the coolest looking of my toys, but other than a conversation piece, it is worthless. 1.3 megapixels... the quality was  so very disappointing. And i was SO EXCITED TOO!!", "Date": "July 12, 2002"}, {"Title": "bogus", "Author": "Sandra Wright", "ReviewID": "RGZ58KNBOUSIX", "Overall": "1.0", "Content": "I bought three of these cameras. The first one was lost when it fell out of my husband's pocket while he was trail riding. The second was lost when it fell out of my husbands truck while he was on a trip. The last one had a problem with the battery not charging. This is when we found out that the camera had an internal battery that was not replacable. I e-mailed the company and they told me to call the company. I called and called and was never able to get through. I then called the sales branch of the company and he told me that the best time to call was 7:00 am my time before the rush. While this was quite awhile ago. I never did get through to anyone. And I have a worthless camera that was used for less than 6 month. My advice to anyone looking at this camera is to run the other way.", "Date": "January 21, 2007"}, {"Title": "Dead battery", "Author": "Ralph L. Webb \"Ralph L. Webb\"", "ReviewID": "RO4CS48FST5LR", "Overall": "1.0", "Content": "I can no longer charge the battery.  And there is no apparent way to change the battery.  This is a piece of junk!  Logitech should take it off the market.", "Date": "October 26, 2006"}, {"Title": "Logitech Pocket Digital Camera", "Author": null, "ReviewID": "R1V9D0E2ANQY2A", "Overall": "1.0", "Content": "This is a nice little unit, but I have had two of them and they don't last very long.  Also, Logitech seems very reluctant to fulfill their warranty obligations.", "Date": "April 27, 2003"}, {"Title": "Terrible camera", "Author": null, "ReviewID": "R1GN8TE114GQ72", "Overall": "1.0", "Content": "It looks cool, but it is terrible. It is definetely not 1.3 megapixels. Pictures look VERY PIXELATED even in a tiny format.", "Date": "December 7, 2002"}, {"Title": "pocket digital", "Author": "Andrew Lee", "ReviewID": "RYJ3Y3AQZE5CW", "Overall": "1.0", "Content": "the camera is extremely small and light.  how ever the shutter time is extremely slow so every picture is blurred.  also the level of noise in the pictures is unacceptable.  i am very dissapointed.  i would recommend putting down money on a better camera.", "Date": "March 1, 2003"}, {"Title": "darkness of the world!!!", "Author": "jakrin buranapansri", "ReviewID": "R2JUZ41KGSB75M", "Overall": "1.0", "Content": "i strongly do not recommend this item. it may looked sleek& stylish, and etc.. but it has one problem. no flash!!i took about 52 pictures during my thx giving break.. with it's flash disability. 90% of all my pictures were like black!!!!  do not be lured by it's \"Auto Brite\" utility.. it's doesn't help at all.... pay ...more and get...cameras with flash!!!", "Date": "December 11, 2002"}, {"Title": "Useless", "Author": null, "ReviewID": "RK0W6A5ZSD5E9", "Overall": "1.0", "Content": "Sure, it looks sleek and pretty, and weighs nothing, but this camera can BARELY take a picture.  Unless you have near perfect lighting conditions for professional circumstances, the most you will get is a couple of dark blotches. Even then, your're lucky if the pictures look like they've been ripped off of a security camera. I purchased one for the casual snapshot with friends, thinking I didn't want anything big or expensive, just to carry around. It's not even capable of fulfilling that duty poorly.", "Date": "August 13, 2002"}, {"Title": "Poor poor little camara", "Author": "t", "ReviewID": "R2OP8TFZY6IKXK", "Overall": "1.0", "Content": "The Logitech Pocket Digital has very bad picture quality even for a 1.3 megapixeldigital camara. The pictures that I took in very bright light turned out ok, but if there was any shade around it would not turn out worth crab. Don't buy this camara unless you plan on carrying a spotlight around.", "Date": "February 15, 2004"}, {"Title": "Logitech pocket digital", "Author": null, "ReviewID": "R1ERTHDDJ48BMQ", "Overall": "1.0", "Content": "the Logitech pocket digital has horrible picture quality. It is the worst 1.3 megapixel digital camara i have ever seen. Don't buy this camara unless you plan on carrying a spotlight around with you.", "Date": "February 15, 2004"}, {"Title": "Best cheap pocket digital!", "Author": "Deepo \"Deepo\"", "ReviewID": "R1BY4YJRSNBU94", "Overall": "5.0", "Content": "My family of 3 each has one of these for 3 years now and they are great.  Our \"good\" camera died the night we were packing for Ecuador and the Galapagos Islands.  We took our Logitech cameras and got fantastic pictures.  We always have them in our pockets for city (we live in NYC) walks - you never know when you'll see something neat.  If they get lost (hasn't happened yet), no worries.  The usb charge is fast too.  Oh by the way, a full charge lasted on our cameras past the 2 week vacation with hundreds of pictures taken.", "Date": "September 16, 2007"}, {"Title": "Rubber duckie I love you.", "Author": "Sesquepedalia", "ReviewID": "R7N903BIC0Q0V", "Overall": "5.0", "Content": "I thought my score for this camera was one lost, two killed.  then I found No. 3 wedged in the car seat and it works!!!!! It was wedged for two years. and the last two pictures were still good!!. How did I kill those two ??  One got stuck in an escalator and was bent when the guy got it out. The other was hiking with me in freezing weather and was in my rear pocket , could be it got frozen, could be it didn't like that sliding down slopes.These days I own a Nikon D70. It does every thing a camera should. But it doesn't fit in my pocket. It requires forethought and careful setting up and, gasp, reading the manual to get better pictures. Im even afraid to carry it while riding a bike. I'm medically insured but it is not. I bought all three Logitechs for considerably less than the current price and was intending to use my phonecam  instead of the Logicam, but now I have my Logicam  back I am happy and promise to be more careful with it. `", "Date": "March 24, 2007"}, {"Title": "Great gift for a child's first camera!", "Author": "C. S. Biddle", "ReviewID": "RZHWJ63DKYZSV", "Overall": "4.0", "Content": "My ex bought this camera for my daughter who is 13 and promised if she could take care of it he would buy her a higher end camera.  She's had it for a year now and it goes everywhere with her.  It's great to take to school outings with her friends, to the beach, or anywhere else she wants to go.  You have to be in very bright light for it to work, but you can't beat the portability.  The quality is good enough for her and she posts pics on her MySpace all day long!  LOL  If you don't want to spend tons of money the first time out for your kids, this is a great option!  It holds up to around 50 pics at a time!", "Date": "November 13, 2006"}, {"Title": "Handy pocket cam.", "Author": "Catherine E. Wetzler", "ReviewID": "R2E2BK45BIC9RA", "Overall": "3.0", "Content": "I bought mine because I can keep it in a tiny side pocket of my purse, and it is virtually weightless.  I have dropped it (lots), SAT on it, forgot and left it in the hot car, and had it banging around in the bottom of a pack.  It always survives and takes beautiful scenic pics.  Not much on action (no surprise), but when you wish you had something for that great sunset, there it is.  Lower your expectations a little, and it's a nice little cam for the money.  And never a dead battery!", "Date": "June 2, 2006"}, {"Title": "Size matters, and small is a good thing", "Author": null, "ReviewID": "R137WIT8ANJVRT", "Overall": "3.0", "Content": "So you're thinking about buying a new digital camera, something to take pictures of the family and friends...maybe print them out to look at later...well then the Logitech Pocket Digital is NOT for you!  It really is a pretty cool little camera (emphysis on little...2\"x3.25\"x0.4\" or 5.7x8.8x 1.2cm for you metric folks). It's a great little camera for taking pictures of all those wacky things you just wish you had a camera for...however, don't expect it to be taking award-winning pictures for the family photo album. It may have a small and large picture setting, but the camera really only takes pics in 640x480 format (the larger setting only expands the 640x480 into a larger, blurrier picture). One hint: get it on sale (like I did), its not worth the $99 Logitech would have you pay.", "Date": "November 15, 2003"}, {"Title": "Quality not included", "Author": "P. Lee \"jino74\"", "ReviewID": "R14CUPQHRPJCDF", "Overall": "2.0", "Content": "Great in portability and looks, but severely lacking in Image quality. What good is a camera that fails in its primary role of capturing the precious moments of your life? It's a cool looking gadget, but albeit a useless one. I've owned 5 digital cameras and this one wins the WORST BANG for the BUCK award. If, however, the price came down... it would be an entirely different matter...", "Date": "August 9, 2002"}, {"Title": "very nice for its size", "Author": "jorge zuniga", "ReviewID": "R11RZW90R13A0Z", "Overall": "5.0", "Content": "This camera is an awesome toy for those of you that want pictures fast and without a hassle.  Obviously you cannot expect the quality of a professional's camera....but come one dude...it's credit card size...it rocks!  The autobrite helps, but I wouldn't recommend pics in the dark....  I had no problems as far as quality and resolution goes...it was enough for me....All in all, good product.", "Date": "July 18, 2002"}, {"Title": "exelent camera", "Author": null, "ReviewID": "R3FKFHKZWXHTCS", "Overall": "5.0", "Content": "it's a very good camera but is small and very portable and your resolution is very good....", "Date": "May 25, 2003"}, {"Title": "What a waste of money!", "Author": null, "ReviewID": "R1Q8C7FWYOQHY1", "Overall": "1.0", "Content": "This logitech camera does not seem to live its reputation of 1.3 megapixels. I took many pictures and found out that this camera is best used for scenery pictures, not close-ups... i.d faces of people. Overall, pictures of this logitech camera produces mediocre results. Results making the eye strain just trying to figure it out. Save the money and buy a better name brand digital camera.", "Date": "January 2, 2004"}, {"Title": "Worthless Pictures", "Author": "A Bennett", "ReviewID": "R22J8R67BW4AAN", "Overall": "1.0", "Content": "I got this camera and tried it out a couple times, in varying light conditions, and every time the pictures were worthless--you could hardly tell what they were of!  When the object of the picture was a person you could barely tell who they were, and everything was terribly blurry.  I was so disappointed with this camera and had to return it--save yourself the frustration and get a better camera!", "Date": "December 28, 2003"}, {"Title": "cute looks, very bad image quality", "Author": "Margaret Turnbull", "ReviewID": "RPAILEMAUJA27", "Overall": "1.0", "Content": "I usually think of Logitech as making reliable products, and I thought this camera was really cool idea, as I wasn't looking for professional quality.  In fact, disposable camera quality would have been perfectly fine.  However, I wish I could attach some of the pictures that I took, because they are shockingly bad.  It doesn't seem to be totally a camera shake problem (although the images *are* blurry), because even the coloring is very wierd, too.  Finally, note that you are not really getting 1.3 Mpixels, as several other posts also mention.  That Logitech would have such misleading advertising makes me wonder about dealing with this company in the future....clearly they were doing a pre-holiday \"fast market\"--and I fell for it, even sending one to my brother as a (lame) gift.", "Date": "December 19, 2003"}, {"Title": "Terrible Camera", "Author": "Marlowe", "ReviewID": "R2DXOQ9P4WHUJJ", "Overall": "1.0", "Content": "This camera takes horrendous pictures.In low light, almost everything is blacked out, and in good light, everything is grainy and blurry.  I have a cell phone that takes bad pics that look good compared to this Logitech.Logitech touts their \"Lumibright\" technology, but their tech support says, the camera isn't supposed to function indoors -- doesn't say that on the box.The camera was a gift, and was mailed to me, so I couldn't return it to the retailer.  Logitech told me the camera was out of warranty and they wouldn't replace it -- nevermind that I called them one day after opening the brand new boxed camera.All I can say is, Save Your Money.  I'm angry that they even sold this misleading item, not to mention refuse to stand behind it.", "Date": "February 15, 2005"}, {"Title": "HELP!  here's the E9 error again!", "Author": "Amsterdam", "ReviewID": "R1UYULPFAZKKVZ", "Overall": "1.0", "Content": "Like many of you I was very happy when I received this camera.However, I have the same E9 error some of you mentioned.Does anyone have a solution?I've tried linking to the USB while pressing the 'shoot' button, which was recommended somewhere.However, this doesn't work for me.Someone else?Dutch Customer (that's perhaps why I bought this ...)", "Date": "January 13, 2005"}, {"Title": "Poor picture quality", "Author": null, "ReviewID": "REMSAVKKJRP0U", "Overall": "1.0", "Content": "i bought this pocket logitec camera for £50 and at first i loved it. the sleek slim credit card designe meant i could take it anywhere unlike a big camera is recognisable. anyway i took pictures and some came out well and few came out reaaly awful. after a few hundred shots, on the camera screen it displayed \"e9\" message and it wont work any more. i pressed all the available buttons, read the manual and it still said the same message. the camera froze out of the blue and it just would not work any more. i think it was a waste of money for me to buy this. a few extra money would've bought me a better reliable and lasting camera. if you can help my problem please email me at: ...", "Date": "January 20, 2004"}, {"Title": "Cute, but not Competent", "Author": "Sian", "ReviewID": "RGPKA500SQ007", "Overall": "2.0", "Content": "First of all, any mention of 1.3 megapixel on the box is effective lying. Sure, the camera can produce 1.3 mp images, but only by internally transforming 640x480 to 1280x960. lemme repeat this, this camera only takes 640x480 (350kpixel) pictures. I was not satisfied with the quality of the upsampled pictures. Also forget about using this indoors. The slow shutter speed and lack of a flash will make every picture a dark, blurry mess. On the good side, the Pocket Digital is truly slim and light, and  easily rides in any pocket. The aluminum case protects the lens and electronics well. After deciding I didn't want to deal with the poor performance of this camera, I returned it and bought a Pocket digital 130.", "Date": "August 11, 2005"}, {"Title": "I want a refund", "Author": "sohel", "ReviewID": "R29E4G451EAL7M", "Overall": "1.0", "Content": "What a waste of money.  1.3 megapixels, true -- the pictures come out at 1280x1024 resolution.  quality however, so insanely bad, cant believe I spent $56 on this camera.  $56 is a lot of money, this camera isnt even worth $10.  The pictures are so bad you cant even make out what anything is.  its blurry and grainy.  Please, dotn buy this camera, the advertisements makes it look so cool because of its sleek design.  dont be fooled, save your money.", "Date": "December 31, 2003"}, {"Title": "Do not buy", "Author": null, "ReviewID": "R281TOF376CUUE", "Overall": "1.0", "Content": "Do not buy this camera.  Pictures are fuzzy, and since there is not a flash, you need really good lighting.  This is not worth $1.  Don't waste your time or money", "Date": "December 25, 2002"}, {"Title": "no not quite good as it seems", "Author": null, "ReviewID": "RUOMTQ5ZVSMOW", "Overall": "2.0", "Content": "its very portable but its just too dang blurry when u take the pictures. and the camera feels like it wont last more than 6 months of use with it", "Date": "June 4, 2003"}, {"Title": "Its not up to the Logitech name", "Author": "Colin Finlay", "ReviewID": "R2HJDN3L18QB5L", "Overall": "1.0", "Content": "I bought it and am returning it todayCome-on Logitech you can do better. Poor picture quality is inexcusable", "Date": "January 6, 2003"}, {"Title": "Camrassss", "Author": "dan", "ReviewID": "R1IUJW08EAGPRP", "Overall": "5.0", "Content": "i like da camra it seems cool i like the size of it its perfect for spying :P", "Date": "October 13, 2002"}], "ProductInfo": {"Price": "Unavailable", "Features": "Shoot up to 52 photos at a time with 1.3-megapixel resolution\nSee both bright lights and dim details with Autobrite technology\nDownload the images to your PC with a single click\nEnough battery life to power hundreds of pictures between full recharges\nUSB-compatibility for easy PC connectivity", "Name": "Logitech Pocket Digital USB PC Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41XDD8HDZNL._SX300_.jpg", "ProductID": "B000066SAM"}}