{"Reviews": [{"Title": "Kodak means photography", "Author": "teddymills \"teddymills\"", "ReviewID": "R106METTM1G1EI", "Overall": "5.0", "Content": "I just want to take nice decent pictures.At this time I did not want to learn the scienceof photography. We are busy people, right?I used a friends 1.3M pixel Kodak Digital camera.And I was hooked. It took nice pictures and was so easyto use. So I figure I will buy a current model Kodak.I was leaning towards a Kodak because of the logical userinterface the camera uses.I chose the Kodak C330 with Printer Dock.I figure it this way. I currently have 1600+ digitalpictures I have taken with the Kodak C330 on my websiteright now. With 50 to 150 more arriving every day.If I had chosen a more expensive model, I would not havethose 1600 pictures now.I would probably have zero good pictures.Would still be learning the science of photography.And getting very upset no doubt, having spent twice that I did.Am I glad I bought my Kodak C330?One of the best purchases I have EVER made.", "Date": "October 16, 2005"}, {"Title": "I LOVE THIS CAMERA!!!!!!", "Author": "Mrs. Forte'", "ReviewID": "RQZ6HQNMGUM9D", "Overall": "5.0", "Content": "My husband bought this camera with the printer dock from Walmart for my birthday because I hated our polaroid digital camera.  I love it!  The camera and the printer are so easy to use.  I pretty much figured the camera and the printer out the first day without reading the instruction manual.  The prints are amazing, whether you print directly from the camera or from your PC.  I just ordered a 256MB memory card because I just can't take enough pictures.  The 16MB internal memory was okay in the beginning but I find myself transferring pictures to my computer way too often.  I would recommend buying the Camera w/the printer dock because not only will it save you about $50 when you buy the bundle but think about how much you would spend having someone else develop kodak quality prints for you.  The prints look like they came straight out of a photo processing center.", "Date": "March 21, 2006"}, {"Title": "good camera", "Author": "andrew lewis", "ReviewID": "R7893CCK5GHIK", "Overall": "4.0", "Content": "the c330 is a wonderful camera and  i would advice anyone to buy it ,so far ive taken some good pics and if ur using xp you dont even need the cd that it comes with.the one draw back is the screen could have been bigger its only 1.5 inches", "Date": "September 20, 2005"}, {"Title": "Easy w/ User Friendly Software", "Author": "C. Calouro", "ReviewID": "R3R4VLG0IX3KAE", "Overall": "5.0", "Content": "I recently purchased the Kodak Easyshare C330 camera and Series 3 Dock. I was hesitant to purchase a digital camera because I didn't need one more piece of technology to learn. Nothing is as easy as it use to be. However, this camera is just that. It is very user friendly and easy to use.The docking station is nice, but if you have large numbers of photos to print ordering them is still best. The dock prints beautifully and is also very easy. However I can't see using it for more than a photo here or there. It would be too time consuming and costly. Ordering them online through Kodak is only .10 cents per photo with quality Kodak paper and printing.The software that comes with the camera is easy as can be. Insert the disc, follow the prompts and your loaded. I was emailing photos within an hour, it was that easy. Honesty, I purchased the dock because I thought the software wouldn't be user friendly. We have all purchased software that says it is but is anything but easy. Kodak's however was very easy. This is a great camera for beginners or people who want the digital quality and the ease of use, not to mention the ability to email photos to family and friends.", "Date": "June 9, 2006"}, {"Title": "Kodak Easyshare Camera and Printer dock", "Author": "Ethelann", "ReviewID": "R3FPQ3DZ7D1PHK", "Overall": "5.0", "Content": "I have had this for a number of years, still works great and I don't have to go somewhere to have my film developed.  My son, just asked about it, because they are looking for something like this where he works.  I told him it would work good for the purpose they wanted.", "Date": "November 11, 2013"}], "ProductInfo": {"Price": "Unavailable", "Features": "4.0-megapixel digital camera produces amazing-quality prints up to 11 x 15 inches\n3x optical zoom, 5x advanced digital zoom\n13 easy-to-access scene modes and three color modes\nContinuous QVGA video featuring audio capture\nIncludes EasyShare Printer Dock Series 3 for durable, waterproof, full-color prints", "Name": "Kodak Easyshare C330 4 MP Digital Camera with 3xOptical Zoom and Kodak Easyshare Printer Dock (Series 3)", "ImgURL": "http://ecx.images-amazon.com/images/I/41G5KY1TK5L._SX300_.jpg", "ProductID": "B0009XQPIE"}}