{"Reviews": [{"Title": "prettiest camera in the shop", "Author": "Cocolaco", "ReviewID": "R29GHEXASV4UUU", "Overall": "5.0", "Content": "it's so difficult buying a new thing, comparing all the products and features and prices and really not wanting to be disappointed with your final choice and so on. anyhow, i had a 2MP camera and so i wanted to get a better one, but also i am a girl with tiny pockets so i needed a small camera, and i wanted to be able to zoom and use macro. i compared lots of cameras and looked at lots of sample photos on review sites, and overall the sample photos from canon cameras seemed to be the best ones - olympus camera photos were good quality too, but only from 5MP cameras and above.in the end, i narrowed the search down to the canon ixus range and the olympus stylus range. i was concerned about the fragility of the ixus cameras' LCD screens after reading lots of negative comments about them, so i decided to go with the olympus stylus 5MP. but then this IR-300 came out fresh on the market, $100 cheaper! so maybe i will find out something bad about it in the future, but it looks better than the stylus, and it's smaller, and so far it takes great photos.pros:+ huge preview screen on the back, which is sturdy and can be seen from any angle+ scratch-resistant camera body+ really easy to navigate/use+ very useful & easy to use pre-set settings for types of photos e.g. portrait, night-time, landscape+ camera recharges in dock+ very easy to transfer photos to computer via dock (i didn't even install the olympus software, i just use the windows transfer wizard)+ smallcons:- none so far!update, 6 months later:i'm still really happy with this camera. no complaints. to address two concerns i've just seen in other reviews - i've found the soft camera case that it came with is quite sufficient for everyday use - and regarding pictures at night, if you use the flash or any of the presets like \"night scene\", that also use the flash, then you won't get shaky photos like someone else mentioned... it's only if you turn flash off, or change to a preset that doesn't have a flash (like \"available light portrait\" or \"candle\"), where you will get blurring or shakiness. so you have to steady the camera by using your elbows as a tripod.. or just set the camera down to take the photo.. or stay still while you take the photo. i've taken heaps of great night photos, both with & without flash.", "Date": "September 7, 2005"}, {"Title": "Simple to use but very good results", "Author": "J. Insley", "ReviewID": "R1WLEXP62YY54O", "Overall": "4.0", "Content": "I knew I had bought the right camera when all my friends started suffering camera envy. It's very gorgeous, with sleek white casing - ipods addicts will love it. It was very simple to start using the camera, although I haven't explored all the settings yet. V easy to download pics onto computer, with straightforward software (a first in my experience!). The screen on the back is large and has great colour depth, and the sound quality for the movie clip function is surpringly good for something this size. And because it is so small and slim, you end up taking the IR300 everywhere with you, and take loads more photos.", "Date": "August 13, 2005"}, {"Title": "All In One Camera", "Author": "Bogda", "ReviewID": "R2XAW2MV2Y9JSX", "Overall": "4.0", "Content": "I got this camera because I wanted to upgrade from my super old 1 mega pixel camera.  Cameras have come a long way and this camera is really all you need.  I bought this because I found it on sale for what I thought was a great deal.  After I brought it home and discovered all its features, I feel like it was a steal for the price!This camera has 5 mega pixels.  It's incredibly small and pretty easy to use.  There are so many ways to take pictures with this little gem.  You can take a split screen, like a before and after in one shot, you have a macro zoom and can get in as close as two inches from your subject, you can change your pictures to black and white or brown and white, you can take pictures with special frames like a heart or traveling images which would be fun for a scrapbook.  What I absolutely love about this camera is that you can even record digital movies with sound on this!  I had no idea it could do this when I bought it, imagine my surprise!  The movies typically range from 30 seconds to two minutes, but if you get a large memory card, I think you are able to expand on the video recording time.There are a couple of cons.  I wish they would have included a card with the camera.  So if you get this, buy a card or you'll be stuck with just a few pictures.  There is no User Manual included which is a major pain.  You do get a CD with the manual in a PDF format, but I prefer to flip through a little pocket sized book and not waste my own time and paper printing out a manual that's over 100 pages.  There are so many features that the menus are a little hard to remember where everything lives, but with practice, I'll get the hang of it which is why I would have liked a pocket sized manual instead of the PDF.  It also doesn't come with a little carrying case which would have been nice.I would highly recommend this camera if you are planning a trip or are a new parent (especially with the video feature), or are just looking for a new small camera that's fully loaded.", "Date": "October 15, 2005"}, {"Title": "Awesome camera", "Author": "J. Murrell", "ReviewID": "R1QH01QN94VXHP", "Overall": "5.0", "Content": "I was a little weary buying this camera after reading that guys review below, but I bought the camera anyways just because I figured if it was that bad I could return it.  When I opened the package, the camera was WAY smaller than I expected it's very compact and pretty.  As far as blurry images go, I think there are some people who just take bad pictures- because I tested out a picture while shaking the camera and it still came out clear as any of my other pictures-no blurring.  I don't believe this Olympus suffers from \"shutter lag\" it's top speed 1/2000 is just as fast as any other camera on the market of comparable value.  I think this camera is a great deal.Pros:1.Wide variety of picture taking options- Panoramic view included2.Docking station to recharge battery- never have to take out AA batteries and recharge(i find a hassle)3.extremely easy to transfer photos to comp- just plug usb in and device is recognized4.great for an unexperienced camera user or someone who wants more depth and can navigate the features (i did all without even looking at manual once)5.awesome camera at great price-and it looks really sweetCons:1.Does not come with memory card-however most cameras don't.  i bought a 128 mb xd pretty cheap and holds 100+ photos2.Doesn't have a carrying case included, but those are pretty available and inexpensive as wellOverall I got this camera because I was sick of buying disposables and getting the film developed, over time the cost adds up, and this camera is not only very portable but takes great pics.  I recommend it to others!", "Date": "January 7, 2006"}, {"Title": "Just OK", "Author": "T. Kranz", "ReviewID": "R1RDMRZLY796EE", "Overall": "3.0", "Content": "The camera is small and attractive. The daylight pictures are great, as they are with all Olympus cameras. Flash pictures are lame unless you are within 8 feet of the subject. It comes with many pre-settings but most are useless without a tripod. The built-in lithium ion battery lasts FOREVER, which helps offset the fact you have to charge it in its own little cradle. Downloading pictures to your computer is a little annoying-- it wants you to use the Olympus Master software that comes with the camera. But, once you attach it using the USB cable, the computer treats it like another external drive and you can just pluck the pix off that way. Finally, shutter lag is a major downside for me. It feels like a full 2 seconds. There's also a \"movie\" option-- it takes low-res movie, a feature I personally could do without. But overall, no complaints about picture quality, which is the bottom line, isn't it?", "Date": "November 22, 2006"}, {"Title": "Excellent camera, would buy again.", "Author": "D. Grantham \"Bianca\"", "ReviewID": "R5F10MNNHUJ33", "Overall": "5.0", "Content": "This is the second time I have bought this camera. I bought the first time for me about 2 years ago.Found it to be perfect. Not one single complaint. Everyone notices how nice it looks and even better how easy it is to use. So, I bought my mother one. The fact that she can use it and love it is a blessing.", "Date": "April 1, 2007"}, {"Title": "Pretty Good.", "Author": "Alena K. \"Alena\"", "ReviewID": "R2LROPJ9JOY0JV", "Overall": "4.0", "Content": "I think it's a nice little camera for the price. Takes pretty good pictures both indoor and outdoor. Movies are good only if recorded outdoors in the sunlight, also high quality sound recording. My only concern is the plastic body of the camera which I didn't realize it was plastic untill I received it, which makes the camera kind of fragile and not very practical -  gotta be very careful with it especially if it's in your pocket. But so far I've been happy with it as my party going or taking around everyday camera.", "Date": "December 25, 2006"}, {"Title": "the good the bad and the IR-300", "Author": "Desean Lowe-zoll", "ReviewID": "R1TE500GGSQCT9", "Overall": "4.0", "Content": "SHUTTER LAG TO SOME CAN BE A TURN OFF BUT TO ME THE SHUTTER PROBLEM IS SOMETHING I ACCTUALLY ENJOY ITS THE PICTURES MY FREINDS GO WOW THATS A COOL PICTURE I LIVE A NOW BIG CITY CALLED SEATTLE YOU MAY HAVE HEARD OF IT BY NOW ANYWAY CITY SHOTS WITH SHUTTER LAG (WITH OR WITHOUT THE JITTERS) CAN LOOK WAY COOL AND THIS TAKES SOME GREAT PICTURES MOST OF THE TIME WITH VIDEO AND A BUILT IN SPEAKER THIS KEPT ON MAKIN IT MAKE LIKE IT MORE TO NOW IM IN LOVE I CARRY IT EVERYWHERE AS FOR PEOPLE BUMMED BY IT NOT COMING WITH A MEMEORY CARD I SAY SO WHAT GO BUY ONE ON SALE SOMEWHERE I GOT 1 GB FOR 40.00 AT A LOCAL STORE AND WITH ITS SMALL SIZE YOU CAN USE A CIGAREETE BOX TO TIDE YOU OVER TILL YOU FIND SOME THING MORE PERMANENT AS FOR ME I USE A 99 CENT BELT HOOK AND DONT EVEN HAVE A SCRATCH ON THE SCREEN AND IM SURE ITS RUBBED UP AGAINST THAT NIPPLE ON THE LEVIS JEANS BY THE POCKET HUNDREDS OF TIMES I USE IT MORE THAN MY 500 DOLLAR DVD CAM CORDER. A I GB MEMORY CARD GIVES YOU 50 MINUTES OF VIDEO 35 PLUS HOURS OF VOICE RECORDING 833;  5.0 MEGAPIXELS PICTURES BUT I WILL TELL YOU THE BATTERY THEY GIVE YOU CANT HANG WITH THE 1 GB MEMORY CARD SO YOULL NEED TWO AND I WOULDNT BOTHER TRYING TO BY ONE FROM THE OLYMPUS WEB SITE CAUSE THEY HAVE BEEN OUT OF STOCK FOR MONTHS THEY DO HAVE EM IF YOU COMBINE YOURE ORDER WITH ANOTHER ITEM SO I DONT KNOW WHAT THERE PROBLEM IS THERE ALSO THEY SENT ME A  E MAIL FOR MY  BIRTHDAY IT WAS FOR  A MEMORY CARD USB READER FOR 20 BUCKS I FIGURED IT WAS MY BIRTHDAY SO ILL GET ONE BUT THEY DIDNT HAVE ANY IN STOCK WITH NO CHANCE OF PAYING FOR ONE TO GET ON BACK ORDER. I SCOFFED AND COUNTINUED ON WITH LIFE AND MY LIL IR-300 STRAPPED TO ME AT ALL TIMES. YOU CAN BUY A REMOTE FOR IT ON THERE WEB SITE THOUGH AND THOSE ARE STILL AVAILABLE SOMEHOW ANYWAY ITS A GREAT CAMERA WITH A SMALL PRICE AND SIZE THAT IM SURE YOULL BE HAPPY WITH GUARENTEED.", "Date": "July 6, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.0-megapixel CCD captures enough detail for photo-quality 13 x 17-inch prints\n3x optical zoom; 2.0-inch LCD monitor\nIncludes docking station that acts as a battery charging unit and camera stand\n19 selectable shooting modes (includes QuickTime Movie Mode with audio)\nPowere by a Lithium-ion rechargeable battery; stores images on xD-Picture Cards", "Name": "Olympus IR-300 5MP Digital Solutions Camera with 3x Optical Zoom (Includes Docking Station)", "ImgURL": "http://ecx.images-amazon.com/images/I/416A4NK1JJL._SY300_.jpg", "ProductID": "B0007CZ3BW"}}