{"Reviews": [{"Title": "totally outstanding digital camera", "Author": "Maddi Hausmann Sojourner \"madhaus\"", "ReviewID": "R2JG4N1XE2H99W", "Overall": "5.0", "Content": "I went digital 5 years ago.  My first was one of the very old Olypus digitals; no removable storage, just a cable to the computer, 120 low resolution or 30 medium resolution shots and then the memory was full.  The colors were always off, there was no zoom, and it was amazing that it worked at all.  No wonder I also bought a pocket 35mm camera to take \"real\" pictures since the Olympus' were so small, grainy, and colorless.  At least the 35mm had a datestamp option.  3 years later I bought the Canon PowerShot S30, then when I lost it (or had it stolen?) I replaced it with the S40.  The PowerShot S50 sold today is the same body style with more pixels and a couple of annoyances fixed.This camera is NOTHING like those cameras.  I had plenty of complaints about the S30 & S40.  My biggest gripe was missing the shot.  I take pictures of children, especially at school functions.  I would line up a wonderful shot, push the button... and they would move!  They'd get up and walk away, they'd turn around, they'd crowd into the subject, I was missing 80% of my shots.  About a year later, the shutter would finally click.  So my hard drive is filled with so-so shots that would have been winners if that annoying delay hadn't gotten me... again!No problem with the Digital Rebel.  Press the button, focus is lightning-fast, then click goes the shutter.  You look through the viewfinder to frame your shot, not at the back on those hard-to-read LCD screens.  Several modes allow multiple pictures, just in case, such as in Sports mode. I am seeing such an improvement in my pictures since I got this camera a few weeks ago.  First of all, they are always framed properly, because I'm not dealing with sudden motion after shutter release, nor am I dealing with an LCD for a viewfinder, or a \"viewfinder\" that makes me correct for parallax.  Next, the colors are amazing.  Third, 6.3 megapixels... when would I ever want that much?  When I want to crop 80% of the picture and still print what's left!It is great to have a camera with some heft that still doesn't feel like a brick.  As everyone else says, get the kit lens.  It is 18 to 55mm, so a nice wide-angle lens for group shots, etc.  I find 55mm not close enough for shooting children; the S30/S40 I mention above has an 11-55mm range which I already knew to be insufficient for shooting kids. Thus I bought the Canon 28-200mm zoom lens and keep that one on the camera, only switching to the kit lens when I do big groups or a lot of similar portraits (that big zoom lens weighs four times as much as the body!) Yes, it is an amazing camera for \"under\" $1000.  Truth be told, I spent more than that on accessories; the 28-200mm lens was almost $500, with 6.3 megapixels you might as well buy the biggest flashcard you can, and that's 2 GB these days; you'll need a case, you really ought to buy skylight filters to protect those lenses from getting scratched, an extra battery is a really good idea... well, you see what I mean.Still an amazing camera, especially after dealing with those tiny toys for all these years.", "Date": "November 10, 2003"}, {"Title": "Thinking about a move from 35mm EOS?  Buy This!!", "Author": "mister_t42", "ReviewID": "RADYW26V17WA6", "Overall": "5.0", "Content": "I've owned three digital cameras before this (a very small Sony, a Canon G1, and an older Kodak), and have been impressed with instant feedback received by viewing your photo 2 seconds after you took it, but was always left with the feeling that I needed to be able to change lenses and have more control over the process.What I really wanted was my old Canon EOS 650 (35mm) camera to work with a digital camara back so that I could make use of my existing investment in lenses.  Well guess what, that is exactly what the Digital Rebel provides!Much to my surprise, all of my old EOS EF lenses work very well with this camera and I am getting much better results than I expected.  This is a huge improvement over my other digicams - better resolution, color, overall quality, and I am in awe of what I get with my long telephoto lens.A few notes.  First, buy the kit lens (18-55mm EF-S); for $100 you'll use the lense and it is an incredible value (certinaly worth 2 to 3 times the cost).  Second, if you take many indoor photos you'll want an external flash; I went with Canon's 420EX unti as it provides E-TTL exposure (essentially, the amount of flash is controlled by what the camera meters through the lens - a pretty amazing capability).  Third, get a good amount of memory, like 2 512K card; its relatively inexpensive and by taking lots of photos you'll learn more about the camera's abilities sooner.I am getting very long battery life (well into many hundreds of photos per charge), so unless you are headed off into the woods you may be able to hold off on purchasing a spare battery.  In summary, if you are an old 35mm EOS photographer, this is a complete no brainer since you get to use your lens investment.  If you aren't, I'd highly recommend this camera anyway (and look into the Canon 70-200mm/f4 telephoto lense - its extremely high quality and a reasonable price).  Now smile and say \"Canon\".", "Date": "December 17, 2003"}, {"Title": "amazing camera, incredible price!  canon has outdone itself.", "Author": "jemaerca", "ReviewID": "R3313UWW4J8BY2", "Overall": "5.0", "Content": "canon's competitors must be scratching their collective heads wondering how canon has managed to deliver a true interchangeable-lens digital SLR for less than a thousand bucks.  this is nothing short of a revolution in the d-SLRs world and it's hard not to get excited!pros:- can't stress this enough: value, value, value - a formidable d-SLR has landed south of the thousand dollar barrier.- 6MP CMOS sensor.- excellent resolution matches canon's own EOS 10D.- seven manually selectable AF points - fast and reliable.- 2.5fps continuous shooting speed up to four images regardless of resolution.- accurate color reproduction.- images virtually noise free at ISO 800 and below.- very little redeye occurrence.- good metering, although no direct control of metering mode.- good manual preset white balance.- shooting priority play mode - simply half-press the shutter during playback and you're ready to shoot.- supports RAW format.- excellent AF speeds, with virtually no shutter lag.- impressive shot to shot times - basically you can shoot as fast as you can compose your shot.- good selection of exposure modes.- orientation sensor for automatic image rotation.- playback magnification up to 10x.- allows computer controlled shooting with included software.- feels solidly built despite the plastic body.- easy to use, integrated controls and displays.- bright, high resolution LCD.- fully compatible with canon extensive lens line.- excellent battery life (but i still recommend getting a spare).- excellent printed manual and supplied software bundle.cons:- to minimize cannibalization of 10D sales, the 300D has been pre-programmed to have less flexibility (forced AI focus, forced evaluative metering, etc).- no spot metering.- low noise levels at ISO 1600.- no flash exposure compensation.- cannot fine-tune white balance.- make sure you don't open the memory door while the camera is writing into the flash memory or else you will lose everything that's left in the internal memory buffer.- plastic body with compartment doors that should be meatier.- LCD has no anti-reflective coating.- reduced continuous shooting rate and buffer size (2.5 fps for max 4 images) vs the 10D.- ISO sensitivity not displayed on viewfinder status bar while being changed.- no flash memory provided so add a few $$ to your budget to get at least 128MB.- proprietary battery - again, a few more bucks for a spare.there's nothing in the market that can touch this camera today.  if you're shopping for a camera in the thousand dollar range, make sure you take a close look at the 300D.  i hope this helps you with your buying decision.  peace.", "Date": "September 26, 2003"}, {"Title": "Awesome camera -- very few \"cons\"", "Author": "Jeff Chrisope", "ReviewID": "R1FSIX4OX6ZWUX", "Overall": "5.0", "Content": "I've had the Rebel for about a month now, and it's been an amazing blast up the photography learning curve for me. It is my first SLR, though fortunately my third digicam, and ... well, wow, what a great camera to learn on.I'd like to just run down the \"cons\" listed by a different reviewer below (or above? how do they order these things? ;-):- \"to minimize cannibalization of 10D sales, the 300D has been pre-programmed to have less flexibility (forced AI focus, forced evaluative metering, etc)\"  * This general point is true, but it is rarely an issue for me, at least. You can override evaluative metering, you can fool it into Servo AF mode (and the \"sports mode\" pushes it into Servo AF mode as well), etc. The only thing I miss is mirror lock-up, for long-exposure dusk shots ... but hey, that just isn't worth the $600 and .75 pound tax I'd pay for the 10D.- no spot metering.  * Not true. Locking exposure (holding the '*' button) yields spot metering in most modes, though the \"spot\" is about 9% of the FoV. - low noise levels at ISO 1600.  * The Rebel has the same sensor and image processing goo as the 10D, and the 10D reputatedly has some of the lowest noise at any given ISO. ISO 1600 is pretty darn fast, some noise is inevitable.- no flash exposure compensation.  * Yeah, this stinks a bit -- but at least you can get it with one of the EX flashes.- cannot fine-tune white balance.  * Not sure what \"fine tune\" means here -- you can set it to \"Custom white balance\" and read off of a white source (e.g. white card, paper), and it retains that custom setting (even through on/off cycles of the camera). - make sure you don't open the memory door while the camera is writing into the flash memory or else you will lose everything that's left in the internal memory buffer.  * Never have run into this being an issue -- opening the memory door is quite an unnatural action, I can't really see it ever happening accidentally, and the big red flashing light would be a reminder not to do it intentionally.- plastic body with compartment doors that should be meatier.  * Metal (zinc) would be heavier, and the Rebel is plenty durable -- I crashed my mountain bike at 20mph with this sucker on my hip. I rolled onto it and cracked the filter, bent the lens, but the body was only scratched a little, and continues to work perfectly.- LCD has no anti-reflective coating.  * My theory has always been that you can't see diddly on the LCD anyway. The real benefit on the 300D is that you can set the pic review mode to show the \"info\" screen, which includes the histogram -- this is VERY useful for checking to see if you have the exposure right without having to squint at a tiny LCD screen and guessing. - reduced continuous shooting rate and buffer size (2.5 fps for max 4 images) vs the 10D.  * Again, another thing you get with the additional $600 ... but compared to the other digicams I've owned, this one feels like a rocket!- ISO sensitivity not displayed on viewfinder status bar while being changed.  * It is displayed on the external LCD, however. I do wish that it was always visible on the LCD (not just when changing), as it's a little too easy to set it to, say, 400 in some low light situation, and then forget it's there and only remember when you note, several days later, that \"wow, that shutter speed sure is short ...\"- no flash memory provided so add a few $$ to your budget to get at least 128MB.  * Included flash cards are virtually always too small and basically get tossed.- proprietary battery - again, a few more bucks for a spare.  * Are there any \"large\" cameras that take, say, AA's? Not many ... the BP-512 that the Rebel uses is a SWEET battery, too, in terms of life.", "Date": "October 23, 2003"}, {"Title": "C'mon, join the revolution... it'll feel real good!", "Author": "R. Shumskis \"highlandbob\"", "ReviewID": "RKQZDW6KUGQ0", "Overall": "5.0", "Content": "I have been intrigued by this camera since its release.  My old camera is a Canon PowerShot S30 (3.2MP).  I wanted to buy an SLR to advance my photography skills and capabilities.  When this beauty came along bearing a price tag under $1,000 and received prestigious acclaim I knew I wanted one.  But I decided to delay for a few months, waiting to see what competition would arise, and how quickly the price would drop.  That competition presented itself as the Nikon D70.  Ultimately, I decided to get the D-Rebel because the price-to-quality ratio is exceptional; the ~$300+ more for the Nikon doesn't seem justifiable for what I think are negligible factors.  Besides, my PowerShot has served me well and I'm used to the Canon system.I've played with mine in the field for two days.  Last weekend was my introduction day and I made a lot of mistakes -- camera shake, off-focus, underexposure.  Today I went back to the same spots [in similar weather] and received much better results by using my tripod, setting the exposure compensation to +1/3 (most of the time) and sometimes forcing a longer shutter than 'auto' suggested.  My photos went from dull to incredible with a few easy adjustments.  If your photos come out poorly always exhaust the manual solutions before blaming faulty camera construction.If you're moving up from a [Canon] SLR, many of the characteristics of the D-Rebel will be familiar.  If, on the other hand, you're used to a P&S like myself some things will be awkward.  For example, using the viewfinder instead of the LCD monitor to compose shots; using the Main Dial and LCD panel to implement settings; and manual focusing.  My PowerShot allows manual tweaking, but it is usually easier to let the processor handle certain functions.  The SLR is different -- it invites you to play.I have read complaints about the camera's construction.  Indeed, it is an all-plastic body, whereas the D-Rebel's big brother, the 10D, is magnesium alloy.  But I think this will be an insignificant point for most people; the plastic body is sturdy enough to handle a day's work.  It has a nice firm rubber grip on the right side.  A friend has an EOS Elan 7 (n or ne) and the weight is approximately the same.I also know some people don't like the fact that the D-Rebel uses the flash as an AF-assist lamp -- particularly because once the flash pops it will take a flash exposure.  But the solution is simple enough:  push the flash back down.  The camera automatically re-evaluates the shutter speed, maintains focus and takes the shot.  You will need to have it on a tripod for the shot to be successful, though.After a lot of reading and searching for components to make up a great system, I ended up buying:  Rebel with 18-55mm lens; EF 55-200mm II USM lens; 1 Gb Sandisk Ultra II CompactFlash; 420EX Speedlite flash; Sto-fen Omni-Bounce diffuser (for 420EX); Tiffen 58mm Deluxe Enhancing Filter Kit; Samsonite Worldproof 3.2 Download SLR bag; Tamrac Small Lens Case.  (I wrote a review for the Samsonite bag.  I think it's fantastic for carrying all my gear.  I use the Tamrac bag when I want to travel light.)Here's a stupid mistake I made that I'd like to enlighten others to, so that they may avoid doing the same.  When I first tested the camera most of my shots were indoors and required the flash.  In many of those shots I noticed a black blob.  I thought maybe my flash was defective.  The manual says there are certain conditions where the flash may be obstructed.  My solution was simple enough:  two of my fingers were in the way.  With my PowerShot, I had become used to lifting my ring and pinky fingers away from the flash and lens so they would be out of the way... now doing it put them in the way of the flash.  Sometimes the simplest answer is the right one.Here are two things I feel quite fortunate to have learned (i.e., stumbled upon), as I did not read this in any review.  (1) When using a [Canon] digital SLR you need a \"Type II\" lens.  Lenses have always induced aberrations of light, which would create 'ghosts' and other weird things.  But 35mm film is produced with a coating that prevents them.  When you use a D-SLR, however, that coating is not on your sensor, so those light artifacts appear again.  So Canon created the \"Type II\" lens, where the aforementioned coating is on the glass.  The only problem is that there are only a handful of these lenses at this point.  Unfortunately, this dramatically weakens Canon's claim that you can use \"over 50 lenses\" on your D-Rebel.  While technically true, you probably wouldn't like the results.  (Popular Photography magazine ran an article about this, which is on their site.)  (2) Don't fall for tricky CompactFlash advertising.  I bought several Viking Components CF cards for my PowerShot.  They always worked well and I almost bought a big one for my D-Rebel.  Then I considered the Lexar \"40x\" because they have a good reputation. \"40x\" sounds good, eh?  The Sandisk Ultra II works at 60x!  At the Large-Fine setting, this will save you one-third second of write-time.  That is big when you think about action photography.  The Sandisk card can write 3 images when the Lexar can only do 2.  The Vikings are worse; they can't even write one image/second!I am exceptionally pleased with my purchase -- not with just the D-Rebel, but the whole system.  It pays to do your research and decide what's right for you.  Personally, I think I put together an excellent 'amateur SLR' package that will allow me to grow and explore for a long time.  Hopefully you will feel the same with a D-Rebel over your shoulder.", "Date": "June 27, 2004"}, {"Title": "Superlative camera", "Author": "R. GollobinLightstruck Images \"Ron Gollobin/L...", "ReviewID": "R2YOJXOW59ZNY9", "Overall": "5.0", "Content": "I am a semi-pro photographer and have used high-end Canon film cameras for years.  I bought the Digital Rebel about four months ago and have been absolutely delighted with it.  One of the most amazing things about it is the number of shots on a battery charge (Li-ion) with the flash.  I use two 512 MB Compact Flash cards and I can fill one of them up in a session on a single charge and can start on the second flash card.One proviso:  The 18-55mm lens that comes with the kit is excellent--it is light and versatile.  However, most of my shooting is done with the Canon 28-70mm 'L' lens which is a professional, high quality, very fast lens with incredible resolution.  This lens is also much heavier and the large lens barrel partially blocks the little pop-up flash.I have set up my film cameras on a tripod and side by side, shot Velvia film using the same lenses and subject, along with the Digital Rebel.  While the saturation of the digital images is not as pronounced as with Velvia film, the detail is quite similar.  Very few editors could spot which image was Velvia, except for the color saturation.  Otherwise quality is comparable.For demanding pro work, photographers will probably want more than the 6.3 MP of the Rebel.  For me, it is absolute heaven.  My marketable shots are heavily composed and lit. Getting instant feedback, even on the small monitor is just heaven.I see no drawbacks for the Digital Rebel.  If  you are a casual snap shooter, or more advanced, prepare to be wowed.One additional note:  I made a great shot--good enough for a poster--so I had Kinko's make a 2' x 3' poster from this shot.  The poster was only 200% of the original and there was absolutely no discernable pixelation.  Simply incredible!I am a tough judge of photographic equipment, but Canon got nearly all of this camera right.  The sensor, metering, auto white balance,bracketing,lack of shutter lag, auto power shut-off are so consumer friendly and common sense right out of the box, I was bowled over.  The more sophisticated controls are available too, when I want them.This is one tremendous product.  My biggest complaint is the interface is USB 1.0 and downloading to a computer is slow.  Zoom Browser Ex, a supplied software that comes with it is adequate, but there are better programs out there.Ron Gollobin/New England", "Date": "November 22, 2004"}, {"Title": "break trough digital slr camera", "Author": null, "ReviewID": "RC24JFUT9CLRA", "Overall": "5.0", "Content": "Have had the camera for 3 weeks. I already owned canon lenses and a flash.  for those complaining or concerned about money that has to be spent on lenses,well thats the fundamental question of is a camera with interchangalbe lens right for you.Pros:  No delay in taking pics.  2.5 fps. 6.3 MP.  Interchangable lens.  I found focusing to be perfectly accurate and fast. recomend disabling the 7 point focusing, and switch to center, with recomposing picture. as for those complaining that pictures arenot Sharp or lively, that is a function of two things.  First the lens being used.  the stock lens is good, but not great.  A little slow. I took a lot of pictures with an 80 dollar 50 mm, f 1.8 lens,  including in candle light, and bright day light, and the results are amazing.  second thing is processing of the pictures.  the camera has 3 preset processings for \"sharpness\" and saturation and contrast, as well as 3 custom ones, so you can make your pics as sharp,  saturated, and contrasty as you desire. learn to use to camera. I found the camera to be excellent up to iso setting of 800, ,with minimal noise, with better quality than film camer.  I also like the palstic construction.  its lighter, and nicer to carry.  You cant use the lcd as a viewfinder, which I never used, cause it eats your battery and never works well in bright light.Cons:  Auto white ballance is useless in low light, and indoor ligt situations.  that needs to be manually set.", "Date": "October 18, 2003"}, {"Title": "a great intro into digital SLR ownership", "Author": "Shelley Gammon \"Geek\"", "ReviewID": "R2OLAXH8NJFBXV", "Overall": "4.0", "Content": "I had an Olympus 5MP point-n-shoot Camedia camera I was pretty happy with for portraits. I was annoyed w/ the fixed lens that prevented me from taking good photos of wildlife. I have hummingbird feeders in my backyard and unless you've had the opportunity to work with hummingbird families for years, the sweet, tiny animals are skittish and don't often pose for you when you get too close. When my point-n-shoot stopped focusing, I took advantage of this situation by rationalizing this bigger purchase.What a joy it has been to use this camera. The 6.3MP is a significant improvement over 5 and the ability to take photos in manual mode cannot be understated. With the fixed point-n-shoot, the camera refused to shoot if it didn't \"feel\" that it was in focus... so it was impossible to shoot sunsets, lightning or other natural beauties in the \"infinity\" range of the focal length.The Rebel makes use of Compact Flash - the oldest, yet still the best technology for taking fast, high-quality photos in digital cameras.My less than perfect rating is due to the small memory buffer. You can take up to 3fps very easily, but if you click-click-click the shutter, it doesn't matter if Bigfoot, the Loch Ness Monster and Elvis start doing a little soft-shoe right in front of you, by the time the Rebel finishes writing the recent 3 quick shots to the CF card, the shot of the century has already slithered back into the swamp by the time the camera is ready to be used again.If you're taking portraits, not a problem. A click here and there and you'll never notice the lack of memory buffer... but if you're shooting at a ball game or other quick moving objects, you're going to get frustrated very quickly.The flash is decent, but you really need a good flash like the 580 in the hot-shoe if you want a better even spread and avoidance of red-eye. A lot of folks shrug about red-eye since most affordable or free programs like iPhoto or Photoshop Elements have built-in correction for red-eye - but red-eye correction by one click is only available for humans. If you're shooting wildlife, forget about any software that has a one-click (or a million clicks!) solution for blue-eye in dogs, yellow-eye in cats, flaming-demon eye in bunnies or the variety of odd reflections you will get bouncing off retinas of various species. The best way to circumvent this problem is to avoid bouncing flash directly into the retinas of your subjects from the get-go. No more glare or odd reflections when you use a better flash.The ability to upgrade to better lenses is the crux of SLR ownership. The sky is the limit. Get a good wide-angle and a good, fast telephoto and you've got yourself set for some great shots.  This camera isn't going to take advantage of CF cards faster than 40x, so you can save money by buying the slightly slower CF cards, but I invested in the 80x cards so I can use them when I upgrade cameras.This Rebel has gotten me back into photography after a decade-long hiatus. The camera automatically detects vertical shots and turns them 90 degrees for you in the LCD window. It is quick and easy to adjust the ISO to \"push\" the film (so to speak) to take advantage of low-light situations, but you get the same grainy effects as you do when you push real film.With an ISO of 100 and using a 512MB CF card, you have 157 photos at your disposal - if you push it all the way to 1600, 104 shots on the same card. At 400, your shots are already compromized regarding print quality... but if Sasquatch comes-a-knockin' in the wee hours, you'll still get decent proof if you shoot at 1600.Having a background in film photography spanning 2 decades, I didn't even have to consult the manual for this camera to use it fresh out of the box. It handles in many ways like a professional film SLR, and unlike the point-n-shoots, there aren't cryptic settings that have no film parallel.For sunny days and outdoor shots, this camera is a sheer joy to use.", "Date": "July 27, 2005"}, {"Title": "Sweet digital camera", "Author": null, "ReviewID": "R1NQCO1IEK8R6J", "Overall": "5.0", "Content": "First of all this camera's price point marks a first in the digital SLR field.  I would recommend this camera for someone that is tired of missing shots waiting for your CCD based digital camera to recycle.  The cycle time with flash is at the most 1.8 seconds unless you have 4 or more pictures waiting to be spooled to the flash card.  This is slower than other more expensive digital SLR's, but is FASTER than every non-SLR digital camera I have seen.The battery life is remarkable to say the least of any other digital camera I have seen.  The proprietary battery caused me a little concern, but it has such a rich history with Canon's other digital SLR's and PowerShot models, I felt comfortable.  The battery just keeps on going and going too.  I hope this battery can continue to perform like thes for several years down the road.  When the advertisement states that you can get 300-400 pictures out of one battery, BELIEVE IT..  I intentionally ran the battery down one day and I would swear that I took somewhere around 500 pictures (90% of them using the flash) before the battery finally gave up.  I have a 512mb flash card and it filled it up more than twice on the SAME battery..The fit and finish left a little to be desired at first with the plastic body.  I have come accustomed to using it and even though it's made out of plastic, I would like to see someone do a drop test to see how the case holds up against another digital SLR with a metal body.  My money's on the injection molded Digital Rebel (if there is such a thing as SOLID plastic, this is it)..If purchasing this camera, be sure to get Canon's SLR accessory pack for 69.95 and BestBuy (and others maybe).  This pack contains an extra battery and a 58mm Canon UV lens.  I use it on my lens as a permanent protector.  The battery alone costs around 60 bucks and you get a bag and a filter to boot..Some folks have complained that indoor photography sucks with this camera.  DON'T believe everything you read!!  I thought this at first, but when I set the camera in the P mode it allowed me to adjust the ISO level and indoor photography improved instantly.  I will agree that the full auto mode should be used sparingly indoors.  Now I have to worry about having pictures that are overexposed inside.  No need for a mini studio as someone mentioned..  Just play with the camera for a while and you will learn so much.  Besides this is digital..  You can see your mistakes before paying for processing..Also, plan to purchase some other lenses (that's why you purchased a digital SLR to begin with, right).  I purchased a 75-300 from BestBuy off their clearance rack (for a ridiciulous price for a Canon EF lens) and the lens works great.  If you're good with the ISO settings and the program mode, you can take indoor shots with the zoom at full tilt!  And speaking of zoom capability..  The focal point of the 75-300 lens actually has to go through the 1.6 magnification factor..  So to the camera the effective focal length of the 75-300 lens is actually 120 - 480 zoom.  Sweet..I haven't taken the camera to any sporting events and it gets dark so early now, I only have time to do daytime photography on the weekends.  The amount of correction in the automatic mode works good for daytime photography.The software on the PC for the camera was a little different at first.  My last camera just hooked up to the computer and presented a file folder of images for download/review.  The Canon software provides far more information about the camera, and all of the elements that went into making the picture.  This has been very helpful for me to determine exactly which light balances to use for the best shots.  I have also tried the direct capture to the computer and it rocks!!  It told me I had like 11,000 shots left to take using the hard drive of the computer to transfer images..  I will say the USB connection between the software and the camera is a little slow.  I wish this camera had a USB2.0 connection for faster speed, but hey no other digital-SLR offers that for ANY price (as far as I know)..  I would certainly leave some money in the budget for a CF reader that works on USB 2.0..  About $45..In closing, I find this camera to be a very good value for the money and look forward to other times I can do some creative photography.  Availability for this camera may be a little scarce, but if you have to wait, I feel it will be well worth it.  I have a friend that has a full EOS 35mm outfit complete with a few lenses, flashes, etc..  It may be time to play Lets Make A Deal since all of his components are (1) authentic Canon accessories, and (2) the Digital Rebel can use some older accessories..Happy hunting..", "Date": "December 4, 2003"}, {"Title": "Excellent Digital SLR for Canon Lens owners", "Author": "P. Jackson", "ReviewID": "R1YRQC3TOPX9T1", "Overall": "5.0", "Content": "This is the first affordable (i.e. <$1000) slr digital camera and although there are some compromises, it produces excellent pictures. Some care is needed to familiarise yourself with exposure modes and focusing. The default settings tend to produce slightly underexposed pcitures, but this is easily corrected.The lack of spot metering in Program and Auto mode is irritating and can cause issues. Also note that the so called spot metering mode used in the \"creative\" settings is not as a good as that in, say, the Elan. Indoor photography is tricky due to the lack of true wide angle lenses. Your 35mm lenses end up with an equivalent focal length x 1.6 which effectively means the resolution (after cropping and enlargement) is reduced. Not too bad for smaller prints but a compromise nevertheless.The camera is very fast and shutter lag is minimal, a major issue with point and shoot cameras (from my point of view this is a primary reason - along with the interchangeable lenses -for buying a SLR digital)Despite its slightly \"cheesy\" appearance, it is well built and operates with a good quality feel.If you are Canon lens user/owner this is a no brainer at the price. If you do not have any lenses, look at the Nikon 100D and new Pentax before you make your choice.", "Date": "November 21, 2003"}, {"Title": "Don't have one? What are you waiting for ?!?!", "Author": null, "ReviewID": "R26MP9IV1MQ04H", "Overall": "5.0", "Content": "This is an excellent value, especially if you already have a set of EF lenses, in which case it's a \"no-brainer.\" 6.3MP means that 8x10's taken with this camera are indistinguishable from film when printed. The 10D was already a bargain, this camera is $600 less with 99% of the features. Don't let the plastic exterior fool you, the interior frame is all metal, and just as durable as the 10D.I've taken thousands of photos since getting this camera for Christmas, and it has done everything I've wanted it to do. As an old film SLR shooter, I'm happy to have an actual TTL viewfinder again. This has been my biggest gripe with digital cameras with \"Electronic View Finders\"--having to deal with parallax, poor viewfinder image (manual focus becomes a guessing game), slow shutter response, etc. Have all kept me away from digital cameras.  All of these are non-issues with the D. Rebel, it's just like using a film SLR, and at under $1000, what's not to like?A camera is no better than its lens, so we come to the one \"down side\" of buying this camera: to make proper use of it, you must spend even more money on good optics. This is something to keep in mind when making a purchasing decision: you'll probably spend at least as much on optics as you did on the camera body.I suspect many of the poor reviews from this camera are the result of using the kit EF-S 18-55 lens (or some other cheap, similarly poor-performing lens). There are probably worse lenses out there, but you'd have to search far and wide to find one. The camera performs way better than this lens does.Still, The EF-S 18-55 that comes with the kit is worth holding on to. I would recommend keeping the kit lens in your bag for those occasions where you need a wide-angle lens, like group shots. Otherwise, keep it off your camera! If you find yourself taking lots of wide-angle shots, you should seriously consider investing in a good wide-angle lens like the EF 17-40 f/4 L USM. Sell the kit 18-55 lens on Ebay--you'll get about $75-$100 for it--to help defray the cost.An EF 50 f/1.8 USM is a must-have. For $70-$80, you get an excellent lens for portraits and indoor shooting. Don't let the cheap plastic construction fool you, this is one of the better 50mm lenses out there. Remember that the camera has 1.6x cropping, so the 50mm lens produces the same image size as an 80mm lens on a 35mm film camera, which is a good focal length for portraits.A good every-day lens is the EF 28-135 f/3.5-5.6 IS USM, for about $450. A good second choice would be the EF 28-105 /f3.5-4.5 (NOT the f/4-5.6, which is junk, in my opinion), for about $250. You'll find yourself taking 60% to 80% of your pictures with this mid-range zoom lens, so don't skimp. You should really get the better quality 28-135 if you can manage it.If you'll be taking lots of telephoto shots, the EF 70-200 f/4L USM is a bargain at about $550-one of the lowest-priced \"L\" lenses. If that's out of your price range, go with the EF 100-300 f/4.5-5.6 USM, for about $275, which is superior to any of the EF 75-300 f/4-5.6 offerings, unless you really need IS, which is not offered on the 100-300. Stay away from the EF 55-200 f/4.5-5.6 USM, it's no better than the kit lens, in my opinion.Getting good images requires good optics, making the camera more expensive than the initial $999 purchase price.  But the results are worth every penny spent.", "Date": "June 14, 2004"}, {"Title": "Awesome Camera!", "Author": null, "ReviewID": "R2RU754V12KVJZ", "Overall": "5.0", "Content": "I was initially attracted to the Canon because of the 6.3MP, and I am extremely impressed at the improvement in print resolution over my former 3.3MP digital.  But what really thrilled me was the ease of use.  I pulled the camera out of the box, and after charging the battery, I shot pictures for a couple of weeks before I could find the time to read the manual.  To my delight, I found that the manual had nothing to teach me about using the camera that I hadn't already learned by using the menu displayed on the LCD screen.  I found the buttons to be very intuitive, especially since I have owned several digital cameras.  The first accessory I purchased was a 512 mb ultra-fast CF card, so that the camera would not be hindered by a slow transfer to media.  This has paid off well, as I do alot of sports photography in burst mode.  The camera does an amazing job of capturing fast action with crystal clear continuous focusing.  (I should mention that the lens I am using is a 28-200mm)  Battery life is great, and if you keep your LCD review time to a minimum, you should get hundreds of pictures on one charge.  The flash also seems to be very strong, I have not been disappointed yet, but an accessory flash can be added if necessary.  The camera is definitely weightier than any digital I have owned, but I was not looking for something to slip into my pocket.  What I really wanted was professional looking prints, and I have found them.  The print quality so far is better than any SLR I have ever owned.  I couldn't be more pleased!", "Date": "November 18, 2003"}, {"Title": "Best entry-level digital SLR", "Author": "Matthew Davidson", "ReviewID": "R37DTMK26UWW2X", "Overall": "5.0", "Content": "This camera is my fourth digital. The single most annoying artifact of many digital cameras is shutter latency. Press the button, wait... Wait...snip! A second can be an eternity for many shots and sometimes the moment will never return, especially if you have children. You can't put a price tag on shots lost due to shutter latency.The Canon Digital Rebel has no perceptible shutter latency. Plus, the shutter is an electromagnetic release so something tangible, physical happens when you press the shutter button. This would be true for any SLR. The camera makes a satisfying 'kerchunk' sound when you take a picture, and that sound is real, not a sample or beep coming out of a speaker. With some digital cameras, there is little or no feedback indicating you took a picture at all.There are other aspects to this camera that make it ideal for capturing shots that may not last:1) a real power switch - not a soft switch that you have to hold down for several seconds before the unit powers on. Some cameras you also have to wait for the lens to pop out. Gah!2) EF lens zoom - quick, direct hand-held zoom adjustment - not a small lever that drives a motor that changes the zoom - almost worthless under many situations. ...and of course the shutter. All of this means you can reach for the camera, flick it on and snap a photo in seconds. Obviously, this is not a pocket camera. There are many good models that provide this functionality, I own one myself, but the features inherent to the 300D are mutually exclusive to that of a pocket camera. It is pretty hefty, too - it weighs more than my 35mm Rebel SLR. I've read some people bring the durability of the plastic body into question. Modern composites offer durability at a fraction of the weight of metal. And, there has to be something about this camera that feels less pro than Canon's high end offerings or else it would seriously cannibalize their sales.  PDF manuals of Canon products are available at their web site. Go check it out before you buy. A 512MB CF card provides well over 120 pictures at large/fine mode (the top level before RAW) The battery pack provides hundreds of flash pictures before recharging.", "Date": "March 12, 2004"}, {"Title": "deceptive cousin!", "Author": "Martin Veilleux \"melkior\"", "ReviewID": "R1PYXPL44QP4RQ", "Overall": "5.0", "Content": "I remember some 30 years (+/- 1978) ago when I purchased The Canon AE-1 wich was the first quality SLR to reach the mass and it sold more than 6 millions units around the world! Soon after, the competition came. And now that I have this baby it really feels the same! My cousin bought the very good Nikon D70 the same day (he is a Nikon fan and I am a Canon's...). We compared the two models and we found these things:1)The Nikon has a lot more options for the advanced photographer.2) The Nikon feels a little bit more sturdy than the Canon even tough they both are made with plastic on a metal layer.3) The Nikon is a little bit less noisy than the Canon.4) The Canon fits well in the hands.5) The Canon is +/- $500 less expansive than the Nikon.6) and.... the canon has definitely a better image quality than the Nikon wich has a very annoying greenish tints.What is a good camera about? The brand name or the image quality?My cousin will bring back the camera to the store because he choosed the second option.....", "Date": "August 27, 2004"}, {"Title": "Simply an Amazing Camera", "Author": "Kenaz Filan", "ReviewID": "R3DOM5VV0BBEIF", "Overall": "5.0", "Content": "If you've been using a digital point-and-shoot for a while and you want to upgrade, you couldn't do any better than this camera.  If you can operate a high-end P&S; camera, you can operate the Digital Rebel.  Simply choose your shooting mode (i.e. closeup, landscape, portrait, sports, etc.), press the shutter button halfway down to autofocus, then press the button all the way down.  First you'll notice how fast the autofocus function is: you won't have to worry about missing shots.  Then you'll see the photos, and you'll be amazed.  If you use the \"Large/Fine\" setting, you'll have files which easily be printed at 16\"x20\" without any discernible loss of quality ... try doing THAT with the photos from your 3MP point compact.  But wait, there's more.  You CAN use this camera as a fancy point-and-shoot... or, if you invest a little time and study, you can get creative.  The Digital Rebel allows you to control aperature, shutter speed, ISO  settings, white balance, autofocus points, etc.  It also allows you to use any Canon EF (autofocus) lens -- over sixty at last count.  Telephoto lenses, wide-angle lenses, macro lenses which allow extreme closeups ... you're limited only by your imagination, and your accessory budget.  If you already own a film SLR and want to go digital, you're going to love this baby... especially if you own a Canon autofocus SLR.  You'll be able to use your old lenses, flashes, and filters, and you'll be saving money on film and developing.  Professionals may want to spend the extra $600 or so for the Canon 60D; it allows a bit more flexibility with light metering and has a more sturdy magnesium body which will better withstand the rigors of photojournalism ... but this is more than enough camera for anybody who isn't going to be using it to earn their daily bread.  One last bit of advice: get this one fast.  Based on the buzz it's generated in various photo magazines, I'm guessing that the Digital Rebel will be flying off the shelves.  Buy now before you get stuck in backorder purgatory.", "Date": "December 5, 2003"}, {"Title": "If You're A Canon 35mm Fan, Time To Make The Move To Digital", "Author": "K. Palmer", "ReviewID": "R1CQVVUC4FE9H0", "Overall": "5.0", "Content": "I bought a Canon 35mm Rebel SLR 8 years ago and loved it so much, I eventually bought two more Canon film cameras over the years, including lots of lenses and goodies.  But a couple of years ago, I wanted to make the switch to digital.  The Canon digital SLRs were out of my price range ($3K to start), so I purchased a Powershot G2 digital point and shoot, which I loved, but my lenses sat unused in my closet.Well, I fret no more as Canon came out with the much more affordable Digital Rebel for under $1,000 and I finally took the plunge.  A great decision.  Now I can use my lenses.  I have a 50mm 1.8 (word of advice - if you don't have it yet, get this lens - the best $80 you'll spend on your hobby), 28-135mm Image stabilizer and a 75-300mm zoom along with the 18-55mm kit lens that came with the Digital Rebel.  This along with the 380EX flash that I have had for 5+ years give me the arsenal to take good shots in most conditions.  You can set ISO to 800 or 1600 to get clear indoor shots or sports action, and the noise associated with these settings is much more acceptable to me than the 400 ISO setting provided on my G2.  And as far as portraits go, combine the 50mm lens with the flash and I've taken some of the best face shots in my life.Also making me happy is that Rebel takes the same battery as the G2, so I use my G2 battery plus the Rebel battery along with the two extras I bought), meaning I should never run out of power (what helps with battery life is that unlike the G2, you can't use the display monitor to frame the picture, you must use the viewfinder).  Plus the camera takes Compact Flash cards, again like the G2, so I don't have to spend on new memory.If I have a gripe, is that some pictures come out a tad underexposed even with the flash, but this is generally remedied in image software.  And I miss the movie mode in the G2, but certainly can live with it. After 4 months, all is well with the Rebel and I can't wait to upgrade in the future.", "Date": "April 21, 2004"}, {"Title": "It's good, I'm not, make my pictures beautiful!", "Author": "oHPaQue", "ReviewID": "R298ELQRFHTORM", "Overall": "5.0", "Content": "I've had this camera for about 2 months now, but from the day I got it, I was off and taking some stunning pictures!  Even with all the features, I find this camera to be easier to use than most DC's I've played with and have owned (see below for list).  The size and price might be a bit much for some, but I really don't mind either.  I have HP R507 as my \"pocket camera\", but I always find excuses to take the canon with me every where I go!Picture quality:  EXCELLENT.  I'm a novice photographer, but with the benefit of this being digital, it's helping me learn a lot about photography that I didn't have the patience to wait for developing the film.  With the digital rebel, I don't have to wait to see how my \"experimental\" shots come out.  I've taken some cool over exposure shots of traffic at night, and it was VERY easy to do!  Other pictures I've taken come out as good as (if not better than) my Canon 35mm Rebel 2000.  I don't foresee needing/wanting to enlarge my pictures more than 8x10, and with the canon 80-200mm zoom (which becomes 128-320mm on the digital rebel wich 1.6x factor), I should be able to accomplish pretty much any shots I'd ever want.Features:  EXCELLENT (still camera only).  I don't believe in Video feature in DC's to be something useful, at least not until MPEG4 or other higher compression becomes more widely used.  Right now, you can only cram 20 minutes of 320x240 video into 256MB card (less if you go 640x480), so to me, that's not useful.  If you want to take videos, you really should get a video camera.  I especially like that digital rebel goes to ISO 1600 which makes taking night shots much easier!Battery life:  EXCELLENT.  As a test, I took enough pictures to fill a 512MB CF card, about 150 pictures, mostly with flash, some without.  Battery was still barely 1/2 down.  Included fast charger is a nice touch, it has an LED indicator to let you known that the battery is 1/4, 1/2, 3/4 and fully charged.  So in a pinch you could charge just till 1/2 charged (15-30 minutes charge time) and then keep shooting.  But I don't think I'll be taking more than 150 pictures in a day, so I'm opting to not get the backup battery.Cost:  EXCELLENT (for me).  \"It's soooo choice!  If you have the means, I'd highly recommend you get one of those\" - Ferris Bueller.  For some, the price maybe a bit of a shock.  Personally, I don't believe in paying more than $200 for digital point and shoot cameras not when you can buy a nice 35mm SLR for $250.  But for a digital SLR, $799 I paid after MIR was worth it!Film cameras I've owned:  Couple of 110's, late 70's Ricoh 35mm - which I've forgotten how to use, Canon 35mm Powershot Waterproof, Canon point and shoot 35mm, Kodak APS point and shoot, Canon Rebel 2000 35mm.Digital cameras I own:  HP 318, HP R507 - good backup for Digital Rebel!Digital cameras I have experiences with:  Kodak 3.1MP, HP 635", "Date": "March 22, 2005"}, {"Title": "A great camera for its intended audience", "Author": "Paul Kurtz", "ReviewID": "R1OYD4EV2HB8JS", "Overall": "4.0", "Content": "This really is a great camera and to really appreciate it you have to understand its target audience.  It seems clear that Canon has aimed this camera primarily at novices.  Its point and shoot are as simple as you will find on any consumer compact digicam.  Its creative setting should offer enough control and flexibility to keep most intermediate and advance photographers happy.  First though lets go over some of the complaints people are writing about the camera.1).  I can't set up my photo through the LCD-----No you surely can't.  SLR's are designed specifically to direct the light and image from the lens to the view finder.  To the best of my knowledge, there is not a true digital SLR which allows you to do this.  And there shouldn't be.  You can keep the camera a lot more steady and get a much better view of what your image will look like through the view finder then you ever could looking at an LCD six to eight inches from your body.2).  Complaint number two is just as silly.  Canon does not include a CF card with the camera.  I've yet to see a digital SLR manufacturer that includes any media with the camera.  Also when you consider that about the only card they could include without affecting the price much is a 128mb card with is next to useless in a camera like this.Now to some more reasonable complaints1).  This camera is slow to start up (compared to many current DSLR's by Canon and Nikon).  There really was not much that Canon could have done about that.  It uses the same first generation DIGIC processing chip and same 6.3mp CMOS as the Canon D10.  The D10 has similar short comings.  If you can't live with this (about 3 seconds from power up till you can take a photo) you might want to consider the new Rebel XT or D20.  You'll also have to decide if the extra responsiveness is worth an extra 200-300.00 bucks.2).  For continuous shooting you only get 2.5PFS and 4 frame bursts.  Much of this is also do to the DIGIC.  The D10 isn't much faster (though it does have a larger buffer (the images are stored in the buffer before they can be written to your media) which does allow it to continue shooting while the dRebel is catching its breath.  I was very much aware of this \"Shortcoming\" before I bought the camera and understand it as a cost cutting method (larger buffers cost more money) and decided to accept this short coming rather then pay an extra 200-300. bucks.3).  Canon has crippled the camera by removing many manual control features(through software-The camera is physically able to carry out many of these functions but Canon removed the ability by programing the DIGIC chip (the firmware) to disallow these features.  Clearly a business decision and one that make some sense.  You really would not want to release a low cost camera with all the same features as your higher end camera.  On the other hand, I really wished they would have kept some of the features they removed (like the ability for the user to adust the flash settings).4).  I can't shoot RAW images in the automatic settings.  I can understand this.  Most of the people using the fully automatic settings are probably novices.  RAW images cannot be printed from the camera directly to a printer.  RAW images require quite a bit of post shooting work before they're usable.  If some one that really does not know much about photography were to shoot a couple of hundred RAW images they would be pretty upset when they found out they could not print their images and didn't know how to change that.5).  The Nikon D70 supports higher ISO's then the Canon.  The ISO adjusts the camera's sensitivity to light (on film cameras it's the film speed).  My answer to that is that the D70 does not support an ISO of 100 and the dRebel does.  Personally, I would much rather have an ISO range of 100-1600 like the dRebel then an ISO range of 200-3200.  The higher the ISO setting the more digital noise you're likely to get and an ISO of 3200 would seem to affect you're quality considerably.  On the other hand, Canon's 100 ISO is perfect for bright sunny days.I'm sure I missed some other complaints though I'm not sure what they are.  To sum it up, this is a very easy camera to use even for a novice.  The controls to adjust your camera settings and image quality are very easy to use and very intuitive.  If you do understand photo editing are really want to shoot RAW images but don't want to have to manually set all the camera settings (aperture, shutter speed etc.), the P-AE mode only requires that you set the ISO which is  very simple (keep it as low as light conditions allow while retaining a high shutter speed).  My main complaint is lack of documentation for include software (particularly the File viewer App which is required for converting RAW images).  Granted downloading the PDF's from Canon's web site is not a problem but it should not be necessary.Overall, an excellent camera for its intended consumer.  The camera has all the image quality that the pros have come to expect from Canon's digital SLR's.  The auto focus is very fast and accurate (especially compare to compact point and shoot cameras).  The shutter lag is virtually non existent so when you press the shutter release it pretty much instantly shoots so you won't miss the shot (again unlike the vast majority of compact P&S; which seem to take forever from the time you depress the shutter from the time it actually goes.  One quick piece of advise whether you get this camera or the Rebel XT.  Get the 18-55mm lens.  For the money this is an excellent wide a angle lens, and it is only available with the camera.Edit to review.  I wanted to add that I was incorrect concerning lack of documentation for the software suite included with the camera.  The camera does indeed come with full and complete documentation.  In addition, for those interested in shooting RAW, Canon's File Viewer which is included with the camera is less then stellar.  If, like me, you can't afford or justify the cost for Photoshop CS or the any number of RAW converters out there (most that cost over 100.00) you can head over to Canon's website and download Canon's new Digital Photo Professional.  This is the RAW converter included with Canon's high-end cameras (and the dRebel XT).  It is a free download and is vastly superior to File Viewer.  It is much more intuitive, has a far better interface, is much faster and most importantly (at least to me) it allows you to perform corrections in real time so you can make changes on the fly.  It has much better white balance control, and allows you to easily adjust hue and saturation, and lightness and contrast all while the file is in a RAW format.  The only down side is that you cannot download the images to Digital Photo Professional directly from the camera as you can with File Viewer.  You must either download from a card reader, or download using another application (such as Image Browser (included with the camera.", "Date": "April 4, 2005"}, {"Title": "Great features at a great price", "Author": null, "ReviewID": "R25691N2R0WPSW", "Overall": "5.0", "Content": "This is my first digital camera.  After using a Canon rebel 35mm for years, I was pleased to see this camera incorporates the same functionality and ease of use. Pros: No delay when you snap the pictures, use same lens from 35mm rebel, auto set or program features, price below $1000, quality of photosCons: Photo viewer is below SLR viewer - I keep getting nose prints on it.  Camera is not small / compactSummary: if you are looking for a take-anywhere camera, this is not it. If you are looking for professional grade digital camara at consumer price, this hits the mark.", "Date": "October 20, 2003"}, {"Title": "Right for amateur moving to SLR; good enough for prosumer", "Author": "scott_from_dallas", "ReviewID": "RVEDYEJRQ94YP", "Overall": "5.0", "Content": "This review will be really two parts: one for the amateur who has been using point and shoots, or has experience with film based SLRs; the other one for the prosumer or advanced amateur who is either going to digital from film Canon EOS bodies or is getting into pro-level digital shooting on the low end. For the former, the camera is pretty much all you need; for the latter, it is lacking key functionality, but IS workable.I'm in the latter category. I've done freelance photo work in the past, but not since the digital age began to take off in the late '90s. I've been shooting EOS cameras since the early '90s, and added medium format in the late '90s for wedding and portrait work. I'll be honest: I didn't like the idea of digital at first. Sure, the workflow improvements over film sounded great, but I wasn't seeing the quality of digital vs. film. I still am very much a believer that, at least for prints, especially big prints, film delivers a better overall picture quality. But the quality of digital SLRs since the release of the Digital Rebel is so good, the workflow advantages trump film in all but rare situations. I'll still use my medium format equipment for landscape and outdoor pics I'll print large and frame, but other than a pocket 35mm, I can't see using film much at all in that category, after seeing what I can do with the DReb.If you are primarily an amateur who is either used to using a Point and Shoot (film or digital) or who has used a consumer film SLR, you'll find this camera easy to operate and use to the extent you used your other cameras. I bought this without the lens, as I have other lenses and the packaged one didn't offer me anything, but for those without Canon glass, you get a surprisingly good lens with the kit. Remember, though, that the lens will only fit on the Digital Rebel, its successors, and possibly the 10/20D line of Canon EOS bodies.Shooting is pretty simple. Charge the battery, which is easy -- the charger blinks depending upon its charge. You can look at the charger with the battery on there and see where you are, charge wise. It doesn't take very long to charge the battery fully. Once you have the battery in the camera, you'll need a Compact Flash card. I recommend SanDisk Ultra II cards. You won't experience any write time problems over an above this camera's natural limitations. Then, set the ISO value (100-1600), set either the pre-programed mode on one side of the dial, or the traditional Program/Shutter Priority/Apeture Priority settings on the other side, and you are ready to rock. Remember that unlike many digital cameras, the LED on the back of the camers DOES NOT function as a viewfinder. Aside from displaying various camera options, it shows what you shot after shooting.If you want to use this as an advanced amateur/pro setup, you can, but know its limitations. I bought this in March and have been shooting all sports with it. I'm using a Canon L USM lens, and have gotten some terrific shots. But I've also missed some that have led me to decide to sell this camera and pick up a 20D. The problem I get into is focusing speed and zones. The 2.5 fps with only a 4 frame burst isn't as big a problem as it sounds. I can still get good action in the burst mode, but admittedly 5 fps with 22 or 25 (20D) bursts is much better. If you want to use this to shoot something like concerts or indoor events, you won't have the same focusing issues. You will have to deal with any flash limitations, but for that information, you will have to read another review. I'm not a camera flash guy under any definition.The only real problem I've had with this camera is that my shots are consistently underexposed by about .5-.7 of a stop. I shoot exclusively RAW mode (never shot JPG on this one other than first dozen or so shots) and it has been correctable when I convert the images. This is more of a minor irritation, and may not be noticable in JPEG shots. I've seen others using this camera complain of it as well.This camera is as good of a consumer camera as you will find. If a pro, or semi-pro, can make something function for his or her needs, you know the consumer can get everything they need out of this. I've been shooting since I was 8 or so, have owned umpteen cameras, and this one fills its market niche as good as any of them.", "Date": "June 19, 2005"}, {"Title": "Great Camera-Buy Sigma Lens", "Author": "Dan Eppinger", "ReviewID": "RAAR5RNZA5UHH", "Overall": "5.0", "Content": "As I wrote in my review of the Canon s60, I planned to purchase the digital rebel...Well, I did and the camera is all that other reviewers say it is....super easy to use, superb photos, decent price considering the competition...The fact that I am shooting through the lens and seeing what I am capturing is well worth the extra money for an SLR.The main reason that I am posting this review (which really seems redundant to most of the other reviews of this camera) is to recommend two additional accessory purchases which I found invaluable:(1) The Sigma 55-200 lens specifically made for digital SLR.s. I bought this lens at B&H; for $139. It is very sharp, very light and compact and gives me a total shooting range (combined with the Canon included lens) of 18-200, taking me to over 300 in the  35mm format equivalent.(2) The Pelican 1400 Case: also at B&H; for about $61....The case protects the equipment far better than any case at anywhere near the price....It nicely holds the camera body with either the kit lens or the Sigma 55-200 attached...In addition it perfectly holds the lens that you are not using at the time, as well as the Canon external flash..I have the 420EX..This is about it...not a lot of wasted space..the case is now full and easy to toss in the compartment above my seat on the plane.. ..knowing my equipment is fully protected....The case also is easy to operate from when in my car.", "Date": "January 20, 2005"}, {"Title": "Prosumer or P&S - it does it..", "Author": "Shiprekd", "ReviewID": "RYHU79VLPO2FH", "Overall": "5.0", "Content": "After reading the couple poor/inexperienced reviews of the camera, I had to write. The Dreb is an EXCELLENT camera for both indoors and outdoor photography from the beginner all the way to even the pro ranks. The Dreb has one of the cleanest images in the high ISO ranges (extremely low noise) of all the cameras. ANY digital image should be post processed, and canon intentionally uses softer raw image processing (which you can change the parameters and even a free third party program called FEC set) than the rest.  Their software does a nice job of post processing for being a bundled software. Almost ALL of the other manufacturers oversharpen the images and Canon gives you room to adjust the images. Basically, the Dreb is a Canon 10D  except for a lack of a few advanced features and has a tough composite body compared to the 10D's magnesium body (I have both the Dreb and the 10D - so take it from someone who knows first hand). The Dreb does do much better with a 420EX shoemount Flash ($180)and with a Sto-Fen Omni-bounce ($20)on it. You get photos rivaling the pros. Again, I know, I take portraits to high speed motorsports with it.  The kit lens 18-55s is an excellent lens and if you complement it with a sigma 70-300 DL super macro ($150+/-) lens, you've got a decent priced setup. I also have the both IS USM lenses and can tell you the cheaper SIGMA focuses faster than the 70-300 IS USM lens (compared them following a RC controlled car!) and even full length focal in macro is better than the $600 IS lens; which by the way, doesn't have macro feature.  Overall the camera is worth more than what you pay. If you get a defective camera, then exchange it, don't bash one of the best cameras/price out there.. Don't shy away from this camera, as you grow/learn, it'll do whatever you point it at.... want examples? go to Pbase or any other photo review site and you'll see that the Dreb is more than respectable.", "Date": "March 9, 2004"}, {"Title": "WOW!", "Author": "Evelyn Rosado \"Evelyn\"", "ReviewID": "RPI9C380KF9W6", "Overall": "5.0", "Content": "I read every available review before purchasing this camera. I knew it was good, but didn't know how good until I got it in my hands.  All I can say is wow!!  I've been using Olympus digitals for about 5 years and have been very happy with their cameras.  My most recent was the C-50. I did own a Rebel GII, which took great pictures using film.  This Digital Rebel goes beyond that.  I was amazed at the colors & the sharpness of the pictures.  I'm not the best photographer in the world, but this camera makes me feel like one.  I haven't taken a bad shot yet. The camera does have some weight to it, but it works to your advantage because there is less shaking when taking pictures.  Also, you HAVE to look through the viewfinder to compose your shot-not the LCD screen.  You can take 4 consecutive pictures w/o any delay, love that for action shots.  The first time the flash popped up scared me, but you get used to it.  I have yet to find anything wrong with this camera.  The controls are easy to navigate, menu is easy to see.  It even rotates your pictures for you.", "Date": "November 29, 2003"}, {"Title": "Finally!!  Prints that look as good as film prints!!", "Author": null, "ReviewID": "RWUI1TCL4GI32", "Overall": "4.0", "Content": "It finally happened!  3 megapixel, 4 megapixel, 5 ... Now 6.3 and I can finally stop buying digital cameras.  With the combination of this camera and my Epson Stylus Photo 960 printer, I'll never have to go the local \"photomat\" any more.  That's not to say my most recent digital camera (Canon S50) didn't take great pictures, but they still needed a bit of a touch up and lightening to make them look OK for a final print.  This camera changes all of that.  I've taken a number of pictures with this camera and with the PIM plug-in in my Adobe Photoshop Elements software, I just print them out without the need to touch them up at all.  I'm a beginner when it comes to photography and I can't give you all of the technical mumbo-jumbo about all the features of the camera, all I can say is that it takes fantastic pictures!  However, there were a few things that kept me from giving it 5 stars which I think I need to share, especially if you're a beginner (like me), or even a novice...** It's a rather large camera.  If it's going to be a camera that you're going to take to a party or even a sporting event, it will be a bit bulky to carry around.** Unlike most other digital cameras today, the screen on back is only for reviewing the pictures.  You can't use it as a viewfinder to take a picture.  You have to look through the eyepiece.** The built in flash is pretty much of a waste.  It's not strong enough get a good picture in a dimly lit room, and it blows out your subject in a close up of a small item.  You really need to get a speedlite for this camera.** There is a bit of a learning curve.  Not all pictures come out top notch with the \"Auto\" setting.  I'm still getting some pictures that are sharp in the front, and blurry in the rear.  It's been tricky to figure out how to position the 7 auto-focus \"points\" that are in the viewfinder.  I'm sure it's just something I need to learn but by no means is this just a \"point and shoot\" camera.** This sub-$1000 dollar camera can easily turn into a \"thousands of dollars\" camera.  There are a seemingly endless amount of lenses that are available for different things such as macro lenses for extreme close-ups (there is no macro mode on the camera, you need to buy a \"macro lens\" for macro shots), or wide angle and telescopic lenses.  Some of these lenses cost more than the camera itself.  A good quality speedlite will be another couple hundred bucks, at least.  Then you'll need a good case to carry it in, some extra memory cards, and an extra battery or two.  Of course, all of these things are optional, but to get the most out of the camera, you will need to spend some additional money.  All of that aside, I'm still keeping my Canon S50 for it's small size, point and shoot features, and excellent picture quality.  But for the times that I want unsurpassed fantastic picture quality, I'll never need to use another film camera again.  I don't care if they come out with a 50 megapixel camera tomorrow, there is simply NO WAY the naked eye is going to see better picture quality than what this camera puts out.  Now if I can just figure out all the features ... :)", "Date": "November 20, 2003"}, {"Title": "Incredible Camera", "Author": null, "ReviewID": "R2YVGYAN4VO1YB", "Overall": "5.0", "Content": "I had been holding out for a digital camera for years (...)Then I decided to visit my local camera store and they had the Digital Rebel. After the first few shots I was hooked.I decided to purchase the Rebel and am so happy I did. The pictures are amazing. Even if you don't know anything about photography, your pictures will turn out amazing. The camera just performs well. The other neat thing is that they optimize the output for digital printing--so you don't have to spend a lot of time tweaking your photo in Photoshop like the pros. I only shoot JPEG Fine and everybody I show the photos to are absolutely amazed with the results. The stock lens is a great match for the camera. It will shoot macro for objects about 5\" away. In fact, I took a picture of my computer screen from about 5\" away and when I zoom in, I can see each individual red, green, and blue pixel.Outdoor shots turn out great and people shots are just awesome. I can not say enough good things about this camera.The autofocus is also incredibly fast. Make sure you get a fast memory card. I purchased the Sandisk Ultra II 512MB and it performs very well.Write time for largest format JPG:Canon 32MB CF card ~ 10 secondsSandisk Ultra II ~ 1-2 secondsImage browsing on the camera is also a lot faster with the Ultra II card.(...) You will love it.", "Date": "October 14, 2003"}, {"Title": "Great value for a great camera", "Author": "Joel", "ReviewID": "R374KOQHCKNR7O", "Overall": "5.0", "Content": "This is my first \"Pro-Sumer\" digital camera and I couldn't be happier.  I'd made a decision to step up to this level of camera earlier this summer.  After researching what was available, I was 99% sold on the Canon EOS 10-D.  While searching for the best deal on a 10-D, I found out that Canon would be releasing the Digital Rebel in a little over a month.  I read all the technical specs and the estimated price and was sold.  This camera has the same sensor and most of the features of the 10-D but is over $500 cheaper.  Yes, the body is made of \"plastic\" and not the spiffy Magnesium Alloy body the 10-D has.  I for one am thankful for the lighter weight plastic body.  If you are like me and this is your first Digital SLR camera, it will take some time getting used to the weight of these cameras.  The Digital Rebel, while not as rugged as the 10-D, is built very sturdy.  Now, onto my favorite part... the pictures.  I could not believe the quality of the pictures I was taking.  The color and textures that I was able to capture blew me away.  And the ability to shoot fully auto all the way to fully manual and several \"creative zones\" in between made exploring this camera's abilities fun and easy.  If you had been considering jumping up to the Digital SLR family, the Digital Rebel has made it much more affordable to do so with results that will leave you very happy.", "Date": "September 23, 2003"}, {"Title": "Great SLR with only one feature I miss...", "Author": "Mark A. Foster", "ReviewID": "R1ESXTVKCJFFBA", "Overall": "5.0", "Content": "I have been using this camera for nearly a year now and have since purchased additional lens for it.  It takes very sharp pictures and I don't feel like I am limited by the feature set in anyway except for lack of being able to shoot RAW in some of the user modes.  The lens that it comes with is a good starter lens and takes good pictures but once you get addicted you might end up purchasing a Canon L and or Prime like I did. :)  This camera is great for learning photography with because you get to see your results very quickly!  This camera just takes great pictures and gives you all the control you need to get creative with exposure, focus, etc.  The plastic body is relatively durable although I wouldn't want to drop it but then would you want to drop a metal body camera either?!  Do not fear, even with a plastic body it has that solid SLR feel.  All my hard copy prints from the online digital photo lab look very sharp.  I even had a poster print done and it came out great.  Many people claimed that 6 Megapixal camera is not enough to make a good poster print.  After seeing the results I say hogwash.  The poster print I got back from the online photolab(Ofoto in this case) was a better quality print than any poster print I have seen at the mall poster store.  8x10 prints are simply stunning.  Take the time to go through the manual and learn all the features of the camera.  I can not really comment on the software that comes with the camera because I never mess software that they bundle with cameras.  I use a good card reader, Windows XP for my OS, Irfanview (which is free) for viewing and mild editing, and Photoshop(not so free) for any major editing.  I found the Sandisk Ultra II Compact Flash cards work very well and are worth the extra dough for the faster performance.  I wish I had RAW in all the user modes but I guess Canon had cripple something like this to convince people to shell out the extra dough for the higher end stuff.  Happy picture taking!", "Date": "January 10, 2005"}, {"Title": "Rebel EOS,  A GREAT digital camera, if just a bit expensive.", "Author": "ThirdJEM", "ReviewID": "R2PX3WIZPG3ORZ", "Overall": "5.0", "Content": "HIGHLY RECOMMENDEDFor everyone from the novice point and shoot type photographer interested in getting a picture of their daughters first birthday, to the professional photographer working weddings; This camera can do it all, and does it all very very well.GOOD USAGE POINTS:-General Digital points-First, if you're a true amateur and you never really know how your pictures are going to come out, the screen in back is large enough (and fast enough) that you can see (within reason) how your image came out.  Thus you can decide if you need to retake your picture.If you're an amateur artist, that is you are looking to get just the right shot of the water dripping off an icicle, then the screen helps you the same way, rather than waiting till you get images back from the lab, or develop them your self you can download them to your computer or laptop and check them out right away, and if you're not the purist, you can even edit them =)-Rebel Specific Points-I used a Rebel EOS before getting my hands on a digital Rebel EOS, and I'll tell you besides not needing to load film, the experience taking pictures is exactly the same.  The only differences are bonus' (i.e. being able to see your image right away)THE PIXLES are so high that you will have no problems getting large prints, and being digital images, you can sign up with a company like Ofoto.com and get your prints made into calendars, or even photo books (which I'm going to make full use of this Christmas)MEMORY is entirely in your hands, unlike some cameras which contain their memory on board, this loads memory sticks in the side.  I have a ½ gig stick, and took 80 photos on there once, though I also took 50 photos on there once maxing it out.  But if you have another stick... you can always pop that one in there and keep on shooting, and these sticks are much easier to carry around than real film. -side note about memory sticks... they are very sturdy... a group at MIT I believe wanted to see how tough these things really were, tried things from the soft, like dropping one on the floor, to the rather morbid, like nailing one to a tree.... All but a few survived (including the one nailed to a tree.... No joke... they could hardly kill these things)  So don't feel like you need to baby your memory sticks, they are pretty tough...  (though I'm unsure how memory sticks react to metal detectors incase you're a photographer who travels a lot)IT IS QUITE FAST!  As I said before the experience taking a photo with this camera was the same as with my film loaded EOS.  Unlike many digital cameras I've been photographed with where the user pushes a button and a good 3 seconds later it flashes and takes a picture, the Rebel snaps to attention and BAM! Takes your picture directly on command no delays.CONTOLS, again just like the old EOS, and like poker, can be picked up by the complete novice but can take a lifetime to master.  The automatic setting allows the user to simply point and shot, the camera will take the best most clear image possible.  Even some of the extra settings could be fun for the novice.  Yet the manual settings allow for the professional to experiment to the fullest extent of their talent.COMPATIBILITY, it's fully compatible with rebel lenses, flashes and equipment of the Rebel EOS era.  Just like all other Canon gear.DRAWBACK POINTS:I feel the viewfinder could be extended back a bit, you kind of press your face against the screen to take a picture which was fine when it was just the film door, but now if it's hot or your face is otherwise dirty you're always wiping the screen off... not a huge deal but it's something I can put up as a negative...Then there is the expense, it is rather expensive.It is also fairly big, it's a good 10-15% bigger and heavier than my film loaded EOS.It's computer related.... Which means it's likely it will be outclassed in maybe 3 years... maybe video capability, sound capturing, size reduction.... Who knows what will come next. CONCLUSION:  It's a great camera for any type of user, and it produces quality images in a format you can do a lot more than just get prints with. It's compatible with EOS compatible equipment.  It's fast, accurate, and just an all around excellent camera.  The only issue is it's price, I do admit that at 1k this camera is a bit expensive for what is just an amazing camera after all... Little side story, I took my Digital Rebel out with me for an early morning canoe ride trying to catch the sunrise... I came in with 8 keepers and a new background for my laptop.  How many film loaded cameras can do that?? =)", "Date": "October 1, 2004"}, {"Title": "Outstanding Camera", "Author": "Jeff Diaz", "ReviewID": "RFY05BPTUN2YC", "Overall": "5.0", "Content": "This is the most outstanding digital camera I've ever owned.  While it is lacking in some features of the professional digital cameras, they most likely won't be missed by the average consumer.  For those moving up from a standard point and shoot, the biggest benefit will simply be speed, (aside from it being SLR).  No more delay in taking your picture, when you push the shutter release, the picture is taken.  But if you want full control of your exposure, f/stops, and shutter speeds, you've got that too.  The lens that comes with the Kit has a nice wide range that will give you a good wide angle, zoom, and macro, well worth the extra $[$$].  The pictures are crisp and clear and the color is the best I've seen in a digital photo.  Well worth the price.  Thank you Canon for finally making an affordable digital SLR.", "Date": "September 22, 2003"}, {"Title": "Great for a REAL Amateur", "Author": null, "ReviewID": "R2OAV2RZU3ZU9R", "Overall": "5.0", "Content": "I have always wanted to get into SLR photography, but never wanted to deal with the expense of camera and lenses then film processing to see how badly I messed up the photos.  With this digital camera I can now experiment all I want and see the results as soon as I download the pictures to my computer.I bought an additional lens, the Canon 100mm-300mm 3.5-5.6 zoom lens. This lens was affordable and good for outdoor sports shots. The lens 18-55mm lens that comes with the camera is great for indoor, across the room kind of shots. I have discovered, though, that I need another lens in the 24mm-105mm range for across a larger room shot. I cannot say enough positive things about this camera. If you have waited to get into SLR photography, wait no longer. This is the best option for you. The photography magazines have given this camera great reviews.", "Date": "December 14, 2003"}, {"Title": "Absolutely the best digital camera for the price", "Author": "Mark", "ReviewID": "R83XU90SJR9SL", "Overall": "5.0", "Content": "Had this camera now almost 2 months, took over 1200 pictures. I had some enlarged to 12\"x18\" and there is no graininess in the pictures. I showed them to people and they thought they were absolutely beautiful. In order to get a \"crystal clear\" picture (like regular 35mm SLRs), you should always use a tripod, even if the shutter speed seems fast as I can tell the difference between using the tripod and not using it. Only that way will the pics look very sharp. I'm sure lots of these reviews say you see a soft look but if you use the tripod you will see sharp lines, etc. My 3 second waterfall pics look as good as any I've ever seen. I'm sure that the graininess will start to show larger than 12\"x18\". By the way, use the timer to get pics so you don't wiggle the camera when you push the button or buy the corded remote which works great as a timed \"bulb\" timer.As for the flash, well its not the best but for everyday snapshots it works fine. I suggest the 420EX by canon for a great flash.Plastic body isn't as good as the more expensive cameras but it is very hard plastic and feels extremely solid.The camera's lens that comes with it is good, not great but very capable for the extra cost of the camera.One of the drawbacks is the mirror instead of a prism in the more expensive cameras and also the mirror 'slap' seems louder and may cause more vibration, which could lead to less sharp pics. But I would say that is it. The camera is very formidible and I seriously recommend it to anyone.", "Date": "March 10, 2004"}, {"Title": "Beginners only my ...!", "Author": "DuoArtDude \"DuoArtDude\"", "ReviewID": "R4GY7ERY078J", "Overall": "5.0", "Content": "The one dissenting opinion in these reviews was obviously written by an \"uninformed person\".  This is far from a \"Just for beginners\" camera.  I've been shooting 35MM SLRs for over 30 years and digital for over 5 years.  This is the first affordable digital SLR... ever!... While it certainly lacks features compared to it's brothers the 1D and 1Ds and 10D, it is a worthy SLR digicam which is light years beyond anything in it's price class. Buy this camera with confidence.  It will be a classic.  Ignore the reviewer who gives no supporting evidence for his assertions.  Sure you can pay 2 to 10 times as much and get a DSLR that is better, but do you really need it?  This camera is perfect for 90% of DSLR users. Many of us are NOT beginners by a long shot!!  There are plenty of professional photographers using older and less feature packed film cameras and probably shooting better pics than that reviewer!", "Date": "November 20, 2003"}, {"Title": "absolutely sweet prosumer digital camera", "Author": "J. Moore \"Zombie Prep Network\"", "ReviewID": "R1Q919DEAO1JTS", "Overall": "5.0", "Content": "I just got my digital rebel and I don't want to put it down.First, of all the camera is pretty hefty. I actually like heft to my camera as the weight helps reduce camera shake.Second, the thing is so quiet it's scary. The noisiest thing is the flash popping up - followed by the mirror moving for the shutter.Third - image quality is a killer, and I love the ability to change white balance, iso speed etc.And like other EOS models this camera lets me have as much or as little control over the exposure as I want. I can go all point and shoot automatic if I just want to pop off a few shots of friends at a party, or I can go fully manual to give Ansel Adams a run for his money.6.3 megapixels - holy crap dude! There isn't much I currently do where I woudl ever need more than that, and if I do, I'll go rent a Hassie with a digital back or something.Auto-Focus is fast and sharp, and of course you can go manual as well. Transferring the image onto the card is a sub-second operation - nice auto drive feature.This camera has set a new bar for the digital camera market!", "Date": "October 31, 2003"}, {"Title": "outstanding piece of equipment", "Author": null, "ReviewID": "R1FBLCJ882VROV", "Overall": "5.0", "Content": "I upgraded from my 4-yr old Kodak DC-260 digital to the Canon Digital Rebel in October, 2003 and am glad I convinced myself to do so dispite the $1000 price tag.  This is an absolutely outstanding, high-quality camera that can be used by any novice in fully automatic point-and-shoot mode as well as in several other user-selectable priority modes that provide the advanced user with professional level control capabilities.  Picture quality is outstanding, and the auto-focus and auto-exposure are the best I have experienced.  Although it has a thousand buttons and controls, I found even the advanced features relatively easy to learn and use after reading the detailed owners manual.  It also comes with a lot of great software; I especially like Adobe Photoshop Elements 2.0 which costs over $80 when purchased separately.  Definately order the camera with the optional Canon 18-55MM zoom lens which is perfectly suited to the camera, and a type-II compact flash card of at least 256 MB (I have a very fast 512 MB SimpleTech type-II CF card that works perfectly with this camera and holds over 150 shots at max resolution).  After two months of use I have no negative comments about this camera -- its fantastic.", "Date": "December 6, 2003"}, {"Title": "Great value, great results", "Author": "Daniel Wild", "ReviewID": "RVVB659EZRCMJ", "Overall": "5.0", "Content": "I purchased my 300D in May 2005, when the XT was released and this 6.3 MP model's price began falling. I'd have to really pick this camera apart to tell you the downsides of it; disregard reviews by those who think this camera is not up to par -- of course it's not comparable to the EOS 1-Series or a 5D, so don't expect the same features or capabilities. The right user, however, can get similar results.That said, unless you are a professional photographer, I cannot imagine how the Digital Rebel could be inadequate for any amateur or semi-pro shooter. It's speed and megapixels have since been passed by, but it's still, especially now, a great buy.The kit lens will perform for you just fine, although most of my shots with the kit lens are at 18mm, landscape or just wide-angle shots. The flash works very well in most situations, even in extremely dark rooms. One guy complained his AF hunted in low light situations, even with flash...of course, what do you expect in a dark room? Use manual focus and grow up.Quality is great from ISO 100-400, although 800 can be somewhat ugly at times, and 1600 is basically unusable, especially if you're not shooting at f/2.8 or bigger.My main complaints: slow start-up time compared to the newer models (XT, 20D, etc) ... camera seems to be out of breath after continuous shooting; take 8 shots quickly and you may notice the camera needs to process info before it can shoot again. 2.5 frames/second is not very fast if you're shooting any sports.Overall, this camera has been incredibly reliable for me; it's gotten me front page shots on newspapers, magazine covers, calendars and websites. I used it so much that I blew out the shutter in 10 months; Canon fixed it at no charge and it works fine since. One minor problem: very rarely, it won't turn on unless I remove the battery and re-insert it.I've found the battery life to be fantastic. I can use it all day, even with flash, and still have some life at the end of the day. A backup battery in your bag should give you more than enough insurance for a day.I've printed at 11x17 with excellent results.With some practice, it's very easy to navigate. Menus and options are simple; changing the ISO or aperture is very easy despite what some have complained about. It's very reliable in fully-auto mode as well, especially if you're shooting with flash. A memory card reader is a must when uploading images.Overall: it's old news in the world of digital SLRs, but right now, a new or used model at such a good price is really is great value.", "Date": "November 20, 2006"}, {"Title": "The Best DSLR Value Around!", "Author": "P. Pattison", "ReviewID": "R1K1IB62DH1XEA", "Overall": "5.0", "Content": "You can't beat this camera for the money. it accepts all Canon EF lenses and lenses from other manufacturers like Sigma and Tamron. it uses the same battery pack as the Canon G3 and also the same Compact Flash memory cards.It is very easy to use but will take some time to master if you are just used to shooting with your average digicam. but you will be very satisfied with your results once you get on to how to use it and the Adobe Photoshop Elements program that comes with it.the best part of this camera is the very fast autofocus. you will be shocked by how fast it is compared to regular digicams!you do all of your shooting using the optical viewfinder where you will find most of the important info like exposure, shutter speed, and aperture. the LCD screen is only used after a picture is taken for review. the LCD is not used for picture taking like with a standard digicam.another one of the high points of this camera is that you can use high ISO values without sacrificing image quality. this is very handy when you need to up the shutter speed for action shots or when shooting in low light.the camera has all the basic modes you need so you can start shooting right away and also the experimental modes so once you get the hang of it you can take more control of your shots.and with a DSLR you are never limited by a standard lens like you are with all other digicams. if you want to go out and buy very high quality Canon \"L\" glass then you can do it and use it! or if you can only afford \"standard\" lenses then you can just buy what you need. the bottom line is that you can build the camera system that meets YOUR needs! there are no limitations.and one last thing!!BUY THE KIT LENS!!!BUY THE KIT LENS!!!for one hundred dollars it is the cheapest and best option for a wide angle zoom you will find! so make sure you buy the camera with the kit lens.", "Date": "November 3, 2003"}, {"Title": "Lenses and download speed", "Author": "Timothy Takemoto", "ReviewID": "R3AAVQ9LEOD0Y3", "Overall": "5.0", "Content": "The reviews below pretty much say it all. This is a high quality camera at a very reasonable price. A few points to note from my experience.LensesI had a film EOS so I thought I did not need the kit lense and did not buy it. Lenses for film cameras do work with the digital kiss but there are two problems. Due to the size difference between the digital sensor and a 35mm film, the stated focal length of the film lens becomes about 1.4 longer when used with the digital camera. I.e. a 28 mm film lens becomes a 40mm lens when used on the digital Kiss. This means that I lack a wide angle lens for use with the digital. Secondly, while humans can accomodate for the fact that what it says on the lens is not the correct focal length, when using with a canon flash (I have a 380EX) the lens communicates its focal length to the flash gun based on the numbers on the lens not on the adjusted focal length. This means that the flash gun inturn adjusts its flash dispersion width to meet the incorrect focal length and so the exposures is out. One can adjust the exposure manually but the size of the adjustment does not seem to be consistent over the range for my \"28\" to \"70\" Canon zoom. So be wary when hoping to use your film EOS eqipment on your digital EOS camera. Buy the kit lens.Download SpeedA lot of people point out that the camera is a little to download. However it only costs a about 30 dollars (or less?) for a USB 2.0 adapter for the compact flash. I never download directly from the camera. I just change the compact flash and download from that. Using this method, download times are as fast as any other camera, or as fast as the media will allow.PixelsWhile 6.3 is a lot for any amature use. If you want to sell your photos then it is about the minimum. If you plan to turn pro then get the next version up if you can afford it.", "Date": "January 22, 2005"}, {"Title": "Holy Smokes", "Author": null, "ReviewID": "R3MDE3GUWO7FYY", "Overall": "5.0", "Content": "I just bought the rebel and canon i960 printer today.  Holy smokes, within thirty minutes I was able to take several fully auto shots and print them out on 4x6 paper.  They look incredible, as good or better than film.I had been delaying buying digital because of the annoying lag between pushing the button and taking the picture.  There is none of that with the rebel.  Point and shoot and say WOW!!I can't wait to get into the manual and find out what this camera is capable of.  I highly recommend this camera.The printer works great as well.  I was able to connect directly from camera to printer, select and crop image, print out to either 4x6 or 8x10 without difficulty.  Photo quality.", "Date": "December 9, 2003"}, {"Title": "Digital Rebel Takes Wonderful Advantage of Canon \"Primes\"", "Author": null, "ReviewID": "R3TWOO3XXD0PJ3", "Overall": "5.0", "Content": "I won't sing the praises of this camera; I could never be as eloquent as the others who have weighed in and I don't use (or even fully understand) most of the fancy features of the camera, preferring to shoot mostly in program mode. However, I've noticed that the other reviewers seem to miss what for me is the most exciting feature of this camera -- the ability to use high quality Canon EF lenses. Put an inexpensive Canon EF 50 mm f/1.8 lens on the Digital Rebel and you will be astonished at the quality of your photos. (This lens can be had for about $70. new.) For example, you'll obtain near professional quality portraits with gorgeous backround blur using a wide aperture. If you are truly interested in photography as a hobby, there is no other way to go -- you must have a camera that can accept interchangable lenses. Primes (fixed focal length) lenses are the least expensive and of superb optical quality. Comparable quality telephoto lenses are far more expensive and they won't be as fast (have as wide an aperture) or as light weight and compact. Photography is completely different with a camera like the Rebel. Once you try it, there is no turning back. It will become apparent that the decision on which camera back to purchase is least important decision you make. Choosing the right lens is the really critical choice. Of course, along with the pleasure comes the pain: you'll soon find yourself lusting after Canon L (professional quality) glass that will set you back thousands at a pop. Enjoy!", "Date": "March 30, 2004"}, {"Title": "Digital SLRs change how you think about photography", "Author": null, "ReviewID": "RL1KRSQE7XTG7", "Overall": "5.0", "Content": "I have had this camera (with kit lens) for several months now, but within hours I realised it would totally change the way I think about photography.This camera is my first Digital SLR, prior to which I interchanged between small digital cameras and 35mm film Canon SLRs.The first time I used the Digital Rebele was at a swim meet and I took literally hundreds of shots over the weekend (including using the great 4fps continual shooting feature), whereas with a film camera I would ration my use due to the cost of film and development.With a 256 or 512mb card in the camera and a USB (hi speed) card reader attached to my laptop, it was easy to dump off the shots for later sorting, deletion, editing, uploading to Ofoto to get prints etc.Next up is the ease of changing film speed, brilliant but simple, as one minute I can be outdoors in bright sunlight, the next inside under dim fluorescent bulbs with flash photography banned, so changing ISO speed on the fly is amazing.Finally, whilst the kits lens is well worthwhile, it is the 1.6x magnifier effect of a Digital SLR that is a positive for me, as my old 28-90 EF lens is now effectively a 45-145 lens, which is ideal for outdoor sporting events... and if I need real telephoto, the 80-210 works a charm :)The camera and kit is about $900, but you will save that back in reduced film costs very quickly. Also buy a large memory card, USB card reader, and choose your long term storage method (I chose an extra 120gb hard drive in my desktop for backup).Time to move to a Digital SLR, people !", "Date": "June 18, 2004"}, {"Title": "I Love the Rebel!", "Author": "Kelly Theodor", "ReviewID": "R3TDTC8I8C65CG", "Overall": "5.0", "Content": "I had purchased the EOS Rebel Ti film camera one year ago and LOVED it. Everyone asked if it was digital and I said, \"no, digital isn't up to my standards yet.\" Well, now it is! When I saw the Rebel Digital 6.3 megapixel I just *knew* the time had come to go digital. I am so happy with it! I bought it while on vacation this past week so I got to use it for vacation pictures. I bought a 128 MB memory card to go with it (it doesn't come with any memory card at all) and at the \"Large/Fine\" setting was able to take about 48 pictures before running out of room. At smaller settings I'd have gotten many more pictures out of the 128. But the camera comes with a cable and software to connect seamlessly with your computer, so since I brought my laptop along I was able to download my pictures and re-use the card. By trip's end I did buy a 512 MB card, but only in preparation for my trip to London next month, because I don't want to have to lug my laptop on my walks around the city. I also experimented with switching the lens from my Rebel Film camera to my new Rebel Digital. The digital Rebel comes with an 18-55mm, while the film Rebel comes with a 28-90mm lens.The lens from the film Rebel fit just fine on the digital Rebel, but I was unable to switch the other way and put the 18-55 on my film Rebel. Both lenses worked great on the digital. The battery that the Rebel Digital uses is the same battery I use on my Canon ZR45 MC mini Digital Video Camcorder. I would say it lasted 3-4 days of moderate use on my Rebel, which is much better than the 3 hours I get from it on the camcorder. Many of the controls on the digital Rebel are the same as on the film Rebel, which is to say, EASY and intuitive. What I like best about the Rebel is that it grows with you: you can use the auto controls to basically \"point and shoot\", or you can use the manual controls when you know what you're doing. The auto controls cover most circumstances you'll ever need: action, night, closeup, landscape, portrait, no flash, or fully automatic. The manual side gives you auto depth of field, aperture control, shutter speed control, exposure control, or fully manual. I've been extremely happy with the auto controls. Some day I'll graduate over to the manual side and try to dredge up from my memory what I learned 20 years ago in school. What I love about digital is that you can instantly critique your photos and delete the ones that don't turn out as well as you'd thought. But what sold me on going digital at this point is that with the 6.3MP the quality is such that I can enlarge my photos to poster size without losing quality. You just don't have that in a 35 mm camera except under the most optimum conditions. I wanted the flexibility to be able to take pictures under all lighting conditions and be able to use the ones that turn out great in any way I want. I love taking night shots and these cameras handle them BEAUTIFULLY. I'm expecting to be able to make posters and frame and sell them.I haven't yet printed out my pictures but they look absolutely fantastic on screen. I'm excited again about my photographic skills. This camera is everything I'd hoped a digital camera would be. It's also a very hot item right now so get yours when you can!If you purchase, I recommend getting a UV lens right away, as well as a memory stick.", "Date": "November 30, 2003"}, {"Title": "Great camera, houses great Canon lenses.", "Author": "amelia \"amelia\"", "ReviewID": "R17YMMXT7CEMLX", "Overall": "5.0", "Content": "For its time and price (at the time), a fantastic camera.  6.3 MP is more than sufficient for most amateur and semi-pro (non-studio) work, and this camera works very well with what really matters:  Canon's fantastic lenses.  Battery life on this camera is very good.  The \"shutter lag\" (between when you depress the button and when the camera actually takes a photo) is fairly well non-existent, and the only real lag I have is when I am shooting multiple photos in RAW format.  As most photographers know, the lens is almost more important than the body, and outside of Leica lenses, I don't think anything really competes with Canon's line.  The 18-55 lens that comes with this camera is sufficient for casual work...I used it at the beach, and on hikes with my dog, when I don't want to lug around my bigger, more expensive, higher-quality lenses.  But for $75 or so, you can have a 50mm 1.8 EOS lens, which will supplement the 18-55 nicely, particularly for night photography.My one complaint about this camera is its ability to meter light adequately in dark settings.  When I shoot RAW this isn't such a big problem, because I can fix it in Photoshop, but most everything I shoot inside, unless I manually mess with the white balance every time, has an orange tint that is interesting for the first 200 shots, and then is annoying after.  I think the more advanced EOS models that have come out since 2004 or so fix this color problem, and also help a bit with the lag between the RAW shots...but for the money, this camera is excellent, and far, far superior to, for example, Olympus' digital exquivalent (for a similar price).  The difference, as far as I'm concerned, is in the absolute advantage Canon has in lens quality.  You can use a high-end consumer body like this one, use a professional piece of Canon glass (lens) and take excellent photos.  I wouldn't invest in a system that doesn't also boast excellent lens quality.", "Date": "August 20, 2006"}, {"Title": "An awesome camera!", "Author": "N. Moulton \"norm1968\"", "ReviewID": "R1OAUR7D1F8P6E", "Overall": "5.0", "Content": "I own a film rebel, so looking at the digital rebel was a natural choice to take advantage of my collection of lenses and accesories.  I have used the camera for about a month now, and it's simply great!It is similar to the film Rebel in many respects, as far as picture taking modes, and many creative adjustments.  It just has more controls for the digital-specific aspects of photography.  If you are comfortable using a film SLR, you will know how to use this camera right away.Also, unlike cheaper digital cameras, you have virtually no shutter lag or waiting between shots.  (Yes, the camera does need time to store the photos to the CF card, but it can buffer up four and wait for a pause to store them, and for my amatuer shooting, I never notice this delay.)I have not seen any red-eye defects in pictures when using the pop up flash with this camera.  I believe it pops up higher than my old film rebel, and higher than most cameras, so this is a big plus.There is only one thing I can fault this camera on. Transfering the pictures to a computer is very slow because it only has a USB 1.1 port.  So you might want to plan on getting a USB 2.0 CF card reader for your computer.I'm having a lot of fun with this camera!", "Date": "December 16, 2004"}, {"Title": "New Years Resolution #135 ~ Take better pictures", "Author": "Rose M. Swinson", "ReviewID": "R3PKV9KCHUBCJW", "Overall": "5.0", "Content": "Let me just tell you.. this is one Christmas present that will get more use than anything else that I've ever received!  The Drebel takes fantastic pictures.  If you want to see for yourself? Go to [...]  and see for yourself.  It's not my site,  it's a compliation of differnet sites that specifically used the Drebel.  What better way is there to judge for yourself.. as to what this camera can do?Even though this camera is a bit pricy for the \"normal\" person, I believe it's well worth it.. especially if you want to take better pictures.  The battery life is excellent, and can last you an entire day shooting.  Be sure to pick yourself up a high capacity CF card though.. because with 6.5 MP, this camera takes some large pictures.  But the pictures are rich with color and life! You get the one lens, with this particular 'kit', but you can pick up a variety of lenses that can go with it... so you can shoot closeup shots.. to telephoto.  You're not stuck using the EF lenses, strictly from Canon, you can use any lense, from any manufacturer, as long as they will fit the Canon EOS body.  When in doubt, be sure to ask from wherever you're buying the lense from!  If you buy online, call and ask!  (only deal with reputable online retailers or make sure you do your research first).. and if you're buying locally.. you can always bring your camera into the store with you to make sure.  Because of this versitility in who's lenses you can use, you don't have to spend high $$$$ on a lense.  It's ability to take either type I or type II CF card is very good, and because it's not limited to the size of the card, you can even go with higher capacity things, such as a microdrive, if you want to.  (that saves some $ there .. as microdrives are a bit less expensive than CF cards).The weight of the camera, itself, is very comfortable.  It's not too heavy and Canon provides a good strap for around your neck. Of course, you start adding on telephoto lenses, and the weight is going to increase.. but it's doable.. besides.. that's what tripods are for ;)  It fits well into my hand and the buttons are in an easy reach position.  The only thing really \"lacking\" on this camera.. is .. well.. if anything I would have a better instruction booklet.  Not that theirs is bad.. but for the average consumer, who wants to learn photography ...  what is aperature, etc....... the instruction booklet is a bit lacking.  Maybe it's suppose to be that way, but IMO, it'd be nice if it covered a little bit about that sort of stuff........... or maybe an additional insert.  Of course, that's why there's otherphotography books available too.  All in all, I love this camera.  I've had a variety of digital cameras over the years, and this, by far, is my favorite.  So my New Years Resolution for 2004 is to learn this camera a bit better (not so hard to do), and take better pictures. I think I'm well on my way!", "Date": "January 4, 2004"}, {"Title": "An affordable entry level digital SLR for the masses", "Author": "S. J McCartin", "ReviewID": "R1WRD11DJRKKZR", "Overall": "4.0", "Content": "I've been \"getting along\" with a canon powershot G2 and a HP photosmart 850 digital cameras for several years. By and large those are both good digitals but they have the common problem of being \"slooooowwwww\" between shots, just not really fit for fast action. The Rebel can take 2.5 frames per second in full quality mode and 4 frames per second if you drop the quality down one notch (to about 4 megapixels instead of the full 6+).I've been waiting for a digital SLR to come into the affordable range and Canon has finally done that with the Rebel. For about the same price as something like a G6, the Rebel offers quick performance and interchangeable lenses. The Rebel can use any genuine canon EF lens made in the last several years. (Non-canon EF compatible lenses are a gamble on newer bodies due to command set differences in the firmware of the camera and the lenses--no third party has licensed the Canon EF mount, they're all reverse-engineered.) (Yes it shares the same lens mount as the film version of the Rebel.) The digital Rebel can also use the newer Canon EFS lenses (I don't really understand the difference but they're somehow superior to the older EF lenses). The Rebel includes both a built-in flash and a hotshoe that accepts Canon EX speedlights or compatibles. I've shot about 250 pictures with my Rebel, it's fast (really fast compared to my other digitals)and so far competent although I have to comment that my 380EX flash doesn't seem to be exposing far shots properly in shutter priority mode--this may be one of those incompatibility things because it's an older flash unit (but it works perfectly on my G2). The Rebel offers a fair amount of exposure control and a full manual mode as well as manual focusing if you so desire. I like the viewfinder a lot, it's sharp enough for correct manual focusing--even in somewhat low light. I also like the way the AF points are mapped out and will briefly illuminate so you know where the camera is focusing (you can choose AF points with a button available under your right thumb). Also inside the viewfinder you get shutter and aperature info at the bottom.There are several pre-programmed modes for portrait, landscape, depth of field mode, and sports mode. I haven't really had much chance to try these out yet. The only slight disappointment is that the Rebel doesn't have separate exposure controls for the flash (my G2 has this). I think this just might not be available on the Rebel as the firmware seems to have accounted for this setting (i.e. it might be available on the more expensive EOS bodies). Some common controls are set with buttons while others are on menus.  There is a dual readout on the back. A black and white screen shows things like shooting mode, pictures remaining on the card, flash mode etc.  While the generously sized LCD directly below it is used for accessing camera setup menus and playing back pictures.  The Rebel does have a after-shot display mode but it's not really useful because you have your face up to the camera to use the optical viewfinder--just turn it off to save battery power.  Interestingly, unlike my G2, the camera is not useless while your last shot is being displayed, it can do two things at once and pressing the shutter button cancels the aftershot image display.The Rebel is not like point and shoot digitals in that it lacks a few functions that you may have become attached to: there is no panorama (stitch mode) function, no preview (because of the SLR like shutter system on the Rebel a preview mode is impossible), and no digital zoom (since you can't have a preview mode digital zoom just won't work because there is no electronic viewfinder either). The Rebel line uses a CMOS digital sensor as opposed to the CCD sensor used in most cameras.  The Canon CMOS sensors are supposedly much superior to the CCD even at higher ISO (lower light) settings and there have been reports of acceptable prints even at iso 1600.If you purchase a Rebel I would suggest that you also buy the 75-300mm EF to give yourself a good selection of focal lengths for a variety of shooting needs.  Until January 2005, Canon is running a fairly good rebate. If you buy a Rebel body (no extra rebate if you get this kit) and a second EF lens the rebate will be over $200.00.  I bought this kit and the 75-300MM EF and pre- registered the rebate online (using the UPC barcodes), my rebate will be $220.00 (even though the coupon seems to say $230.00 but it may be a slightly different model lens).Overall, so far I like this camera.  As someone used to a decent Pentax film SLR it is missing a few functions that I wish were there but for a Digital SLR with replaceable lenses at this price point it has it all over any point and shoot digital available at the same price.", "Date": "November 2, 2004"}, {"Title": "Excellent Camera...not much RAW support", "Author": "Eric Nelson \"alipius\"", "ReviewID": "R1S0MVHK8BYLMR", "Overall": "4.0", "Content": "First off, I love this camera. Many reviewers have said all the stuff they like about it and I whole-heartedly agree with most of them. One thing I'd like to add is to note Canon's online digital learning center (photoworkshop) is a great resource for amateur photgraphers like me who are new to the digital world. There are over 20 great lessons to go through. You can access the site from Canon's main EOS webpage. I have had a 35mm Canon Rebel SLR for several years now and have been very happy with it. I bought this camera primarily because I can use the EF lenses I purchased over the years for my 35mm Rebel with this camera as well. And I'm glad I did. This camera works well with my other lenses. The only thing that's kinda a bummer is there is a 1.6 multiplying factor on the lens's focal length, so my 35-80 functions like a 56-128 on the Digial Rebel. It's nice to have the extra zoom, but it can be difficult to get all the subjects into a shot that is composed a couple feet away. The standard lens that comes with this camera was designed to compensate for this, but given our cash flow I'm perfectly content without it...maybe someday we'll get a wide-angle lens. In the meanwhile I'm excited about the fact that my old telephoto lense now functions with a maximum focal length of 480!!My only real complaint is that the only RAW support that comes with this camera is Canon's File Viewer Utility. The Adobe Photoshop Elements 2.0 cannot work with RAW files taken with this camera. Instead you would need the full Photoshop CS version to have that functionality and in order to buy Photoshop CS with this camera you would have to multiply your final cost by about a factor of 1.6. That's a bit pricey. To further frustrate me, Adobe's Photoshop Album, which is a great little program, also doesn't recognize the Digital Rebel's RAW files. So either I have to take pictures in JPG mode or I have to individually convert all my RAW photos using Canon's utility, which is powerful, but clunky and slow.But, if that's the only thing I really have to complain about, I must have a great camera...which I do. I highly recommend this camera. Maybe Elements 3.0 will work with the Digital Rebel's RAW files and then I'll have nothing to complain about.", "Date": "May 21, 2004"}, {"Title": "Buy this camera...you won't be sorry!", "Author": "J. Morrison \"Your average consumer\"", "ReviewID": "R2LR3WQQRVHMR9", "Overall": "5.0", "Content": "I promised myself that as soon as SLR digitals got below $1000, I'd get one.  I saw this at Best Buy and bought it on the spot.  (Should have waited and bought on Amazon cheaper).  This camera rocks.  I've used several so called \"point and shoot\" digital cameras by Olympus and Nikon and this one is much easier to use.  Auto focus is amzingly fast and accurate.  Auto flash detection.  Swapable lenes with my older film Rebel.  Battery lasts me well over 150 shots on one charge.  Amazing picture quality.Do not spend $500-$600 on some lower end digital camera with a fixed lens.  This is the real deal.  Look at the reviews...perfect!  This will be the last digital you'll ever need unless you go pro.  Buy it, Buy it, Buy it.", "Date": "November 21, 2003"}, {"Title": "The best entry level DSLR? It could be better.", "Author": "H. Wang", "ReviewID": "RNP6MJWUWL511", "Overall": "4.0", "Content": "I just bought and used this camera for about three weeks (without the kit lens since I have several other Canon lenes already, which are better than the kit lens in terms of image quality). Canon recently throws a lot of rebates on this model (up to $300 rebate if you buy two other Canon lenses). This is an incredible deal. Is this the best entry level DSLR? My answer is \"probably yes, but with some reservation on its features\". Marketed as an entry level DSLR, it is reasonable to expect some tradeoff due to cost cutting. But some of Canon's design decisions are puzzling at best, which compromises its quality and functionality, without reducing overall cost (in other words, it could be done better without incurring additional cost). Here is my exprience.On the up side:The camera feels solid with the right weight. Originally I though it may feel flimsy and overly light since it is made of plastic (the feeling you get of Canon Rebel film camera), but as soon as I took that out of the package, I started to like its weight (not too heavy as you feel for metal-bodied SLR, not too light). Of course, it is still heavier (with lens attached) than consumer grade digital cameras.The camera's operation is much like other Canon SLRs. It has same lens mount (EF mount) as all other modern Canon SLRs which also means you can use all your Canon EF lens (or other third party lenses which conform to EF standard, I use a Tamron lens on this camera without problem). It can also use new EF-S mount lens which is what the kit lens uses. But since EF-S lens is relatively new and can be only used on this camera (and D20 which newly comes out), be aware of Canon's commitment to this lens format in the long term and prepare to throw away EF-S lenses after several years. The controls on the back side of the camera is different than most Canon's consumer grade digital cameras and film SLRs. So if you come from these worlds, there is something to learn, but not too much though.Image quality is superb. Not only it has 6Mpixel resolution, but the overall noise level of image is very low. At ISO 100, image is silk smooth. At ISO 800, noise is visible but pretty controlled. At ISO 1600, noise is much bigger, but still usable, especially you use some noise reduction tools to post processing such image. It surely beats ALL consumer and prosumer level digital cameras on the noise front. And the reason is it uses large CMOS sensor, much bigger than smaller CCD sensor used in consumer digital cameras. So if you are looking at low light performance, you have to use a DSLR like Canon digital rebel. Of course, the image quality of a DSLR also depends on what lens you use. Most of Canon's lenses should deliver better results than most consumer digital cameras.The builtin flash pops up high, which is good. Unlike the flash on film rebel, which pops up low and its light may be obstructed by some large lenses, this flash should work well for most lenses. However, see my comments below, it does have some shortcomings.Focusing is adequate as you can expect from a SLR. The seven point auto focus sometimes does the wrong focusing, and you can select focus point to overcome this. It is not superb, but not bad either.Now comes the down side:Compact flash write speed is quite slow. Even use a high speed CF card (I use Lexar 80X), it still appears slow and not utilizes the full potential of these fast CF cards. When you shoot 4 photos at once, you have to wait the camera buffer to be emptied to CF to continue. This takes somewhere from 10 seconds to 20 seconds depending on your CF card.No LCD display of image you are trying to shoot. Almost all consumer digital cameras allow you view objects in the LCD screen. You have to look closely though the small viewfinder window to track objects. This is a very convenient feature to have so I am wondering why Canon does not do this if it is targeting non-professional photographers.There is no flash compensation. Again you can find this feature on many Canon's consumer level digital cameras. Another disappointment.Metering is odd. You have to use the standard evaluative mode most of the times without any other choices. I'd like to see different metering modes available under all shooting modes. Occasionally, I feel some images are underexposed.Downloading images to your computer is absolutely painfully slow. It uses a USB 1.1 interface - why not USB 2.0 or firewire? The download speed feels slower than the old Canon G2 I have. If you shoot a full 2GB of images, expect several hours of downloading.Why a seperate battery charger? Old Canon G2 has builtin battery charger so you don't need to pull out the bettary to charge. Moving battery in and out every time it runs out is a hassel.So overall, I think it is a great camera, but if Canon can do more to fix/enhance these issues, that would make this camera an absolute hit. Also at this price range (I paid $750 before rebate) it is the lowest priced DSLR on the market.", "Date": "November 19, 2004"}, {"Title": "Great camera!", "Author": "Gary in Sun City, AZ", "ReviewID": "R3N6WVCQL5YOI4", "Overall": "5.0", "Content": "I have owned a Canon EOS Digital Rebel 6.3mp for several weeks now and love it. Fantastic pictures & features. I worked with SLR's for many years. Figured it was time to \"move up\" to the digital SLR and glad I did. This camera has plenty of features available, or you can just set it for \"auto\" and that works fine, too. Though an optional flash is not needed for most photography I wanted one for far shots and such. Canon makes several models dedicated to this camera, but I find them weak (220EX) or costly.  Shop carefully in trying to find a compatible flash. It needs to be \"dedicated\" to the digital Rebels. One that will work with AF (auto focus) or the SLR (film) Rebel may not work right.  I also received conflicting information from Ritz Camera, both on-line and in the stores. Bottom line, if you need a flash, shop carefully and ask all the right questions. Personally I have held off buying one hoping more models at a lower price come out. The camera does already have a small pop-up flash. BTW, the Tamron AF 70-300 Macro 1:2 zoom is a nice lens to buy with it, and priced nicely at Beach Camera. UPDATE 1/2010: Here it is nearly 5 years later, and my Rebel is still working great! It has never gone in for service and nothing has ever gone wrong with it. Of course, I take care of things. I carried a Mack 5-year extended warranty and have never needed to use it. I just purchased my second Canon dSLR, the XSi with 12.2mp.", "Date": "July 17, 2005"}, {"Title": "Great entry level digital SLR for the masses", "Author": "S. J McCartin", "ReviewID": "R17KYSW1VCXIRV", "Overall": "4.0", "Content": "I got this camera about a month ago.  I have two other digitals that are great cameras but are so slowwwwwwww you just can't shoot action with them very effectively.  This camera, for the price point, is a good deal. For those used to film SLRs you won't feel like a fish out of water and if you've already got canon EF lenses they should all work perfectly with this camera body (it can also take the newer EFS lenses).  Because of the SLR like shutter system and TTL focusing this camera lacks some of the functions available on traditional point and shoot digitals--there is no preview mode, no movie mode, no digital zoom and no panorama/stitch mode; keep your old point and shoot (or buy one) for those functions.  <br /><br />This camera is fast! The responsiveness is nearly up to a film camera (I should know I've shot with film cameras for years).  This camera offers 2.5 fps (in full quality mode) or 4 fps (in lower quality mode) continuous shooting--no point and shoot that I know of can match that--this is truly a low end professional digital slr body. The 17-55mm lens that comes with it is great for nearby shots such as at parties or when your subject is no more than 20 feet away.  <br /><br />I suggest two other lenses for this camera that you won't want to be without.  The Canon 28-135 IS USM III zoom and the 75-300 USM zoom (also available with IS if you want to spend the extra money).  IS is a wonderful invention and gives you clear handheld shots at some amazingly slow shutter speeds (IS is a gyroscopic system in the lens that accounts for camera shake during the shot--really amazing what it can do).  The 28-135 lense is widely considered the best \"walk around\" lense for just about anything. The IS system does suck batteries so I'd suggest you get a couple of extra batteries right away (ebay has the best price for them).  If you can't afford a 20D this is the next best thing.  The Rebel is really a striped down 10D, so if you're waffling between this and the 10D--I've heard the differences aren't really worth the extra money.  The other big purchase you want with this camera is a 550EX or 580EX speedlight.  The Rebel lacks IR focus assist but if you have one of these speedlights the camera can use the IR assist on the flash unit!!!!!  <br /><br />I use my rebel to shoot Karate demos, lots of fast action, usually indoors.  I think the 20D would be a better choice for this (because of the bigger buffers while writing to the CF card) but the Rebel can hold its own fairly well if you think out your shots a bit more.  I'm really happy with this camera and I'd recommend it to anyone that wants to move up to a digital slr but doesn't want to spend ten grand doing it.  The camera has a few foibles and professionals might complain that some of the pre programmed modes are far too limited--but that's because it's cheap--the 20D will be more satifying if you've got the money for it.  Canon's running a pretty fantastic rebate until mid January, if you buy a Rebel and two lenses you get about $300 back just on the camera and around 50 bucks for each lens.  Yep I spent about $1600.00 on the camera and two lenses but that's quite a deal for all I got.<br /><br />I recommend this if you don't have the money for a 20D, if you do, or are close to having it, wait and get the 20D.", "Date": "December 3, 2004"}, {"Title": "Consider 10d body, buy quality cf cards", "Author": "Glenn \"Glenn\"", "ReviewID": "R3AGWXXJ2702XY", "Overall": "5.0", "Content": "Finally upgraded from the trusty EOS1000. Every cent is worth it. Instead of learning about your mistakes 2 weeks later, you see them straight away and correct them, all while using your trusted prime and zoom lenses.Gripes:Silver body scratches easily, 10D body (despite extra weight) is much better to hold / operate and should last longer. CANON - Why make this awesome camera Silver?? The black Asian version so much nicer!!!!Bought a cheap 256mb card and it's cr@p. Takes ages to write, even effecting review times. Buy a Sandisk or similiar 512mb+ I recomend.Last Gripe (often an advantage though) - 1.6x magnification. The supplied lense is fantastic, but wide angle lenses are expensive due to the conversion factor of 1.6x. Standard 18-55mm becomes a 28-90mm.But apart from that, the Rebel (EOS 300d) is excellent. Battery life is excellent, photos great, ergonomics much better than any other digital camera under $1000.", "Date": "July 27, 2004"}, {"Title": "Fantastic pictures that equal or exceed film", "Author": null, "ReviewID": "R8GL8L9CY58IP", "Overall": "5.0", "Content": "This is our second digital camera. We shot about 10,000 pictures with a Nikon CoolPix 950 in the couple of years before getting the Digital Rebel.This camera does several things for you.The noise is extremely low. If you have sufficient light to shoot ISO-100 then the results are marvelous.  Even at ISO-400 the results are better than that of our previous camera.Because the noise is so low in dim light you can push the ISO too 400 or 800 and still take really good pictures. Even at ISO-1600 the results are very acceptable. My biggest gripe with the Nikon was the low sensitivity. I would line up a good shot but the camera wanted to set the shutter to something like 1/2 second making it impossible to get a good picture without a tripod. The camera operates very quickly. The total time for sensing light, auto-focus and shutter operation is a fraction of a second. Combined with the low noise of the sensor this means you can take pictures that would have been missed otherwise.Battery life is very good. You can take something like 400 pictures (without flash) on one charge. You'll run out of storage before running out of battery life.The auto white balance is sometimes not perfect in various indoor lighting situations. However, the manual white balance works beautifully. Just shoot a pure white piece of paper as a reference then all subsequent pictures come out perfect.My one complaint is that the interface is only USB. It should have been Firewire. It is a shame they released this camera without Firewire.", "Date": "April 17, 2004"}, {"Title": "Great first digital SLR", "Author": "Spencer M. Hall", "ReviewID": "R2XUI5O4CVSB3V", "Overall": "5.0", "Content": "There are already tons of reviews on the EOS 300d (Digital Rebel) but I do want to share my experience with the camera, so I will keep this short. I bought this camera about 5 months ago and I am in love with. I was not new to photography or to SLR's, but new to the world of digital SLR. I had previously used an ancient Minolta x-570, a \"pro-sumer\" 35mm film slr with a Vivitar 35-105 standard zoom lens. First and foremost this camera takes excellent pictures, very high quality and no distortion that I have seen. This camera is particularly good as a beginner's dSLR because there are so many options to use and learn. But until you are ready to take advantage of all the featues, you can use this just like a point and shoot. Battery life has been excellent so far: thought I would suggest getting an extra to have as  a backup for long days of taking photos.  I have also been quite happy with the kit lens, which I wasn't sure I would like since it is not as versatile as the lens I had been using on my Minolta. But the kit lens has proved to be a great learning tool: I have been able to take some great shots, while also learning what kinds of other, better lenses I would like to add to my setup.**The only issue I have had was a problem with a Sandisk 2gb CF card. After about 300 shots, the camera froze and stopped responding to that card. I was able to salvage most of the photos after the fact, but don't risk it. If you're serious enough to spend this kind of money on a camera, spend a little extra money on the Sandisk Ultra II line of high-speed cards.", "Date": "June 15, 2005"}, {"Title": "A no brainer  !!!  The perfect Camera", "Author": "Mark S. Zemanek", "ReviewID": "R1Z99G9RNCQ604", "Overall": "5.0", "Content": "You have to get a $200 to $300 good quality digital camera, or buy this one!!  We had 2 digital camera's (Sony, Canon), until I received this one as a gift.  You don't understand the difference in quality until you compare the photos.  The \"idiot\" mode is great. You do NOT have to be a photo hobbiest to use this camera.  It came be used as point and click with great results.  There are also manual mode if you want to start learning.  The documentation is simple and makes using the other modes simple.  I use the Auto \"idiot\" mode all the time.The perfect Camera.", "Date": "December 23, 2004"}, {"Title": "It's the best for less than $1,000!!!", "Author": "paparazzi83", "ReviewID": "R1GS4K4KXPA80U", "Overall": "5.0", "Content": "As with any digital camera on the market, there is no \"perfect\" price/perfomance ratio. The DRebel however at the time it was released was arguably a excellent camera for the cost! The pictures (if taken correctly) can be amazing. And the manual control of the camera gives you a lot of artistic freedom I have yet to see in other cameras. Even though all my friends are dissapointed that one cannot look at the LCD there's assurance in the viewfinder because what you see is really what you get. Oh, and that wide angle lens... wow! You have no clue what a difference that makes in a small room! This camera is a great value! The only problem I had is that after 18,000 shots in 90 days the auto-focus went out, something that could be easily repaired by Canon but since the store I bought it from has a 90-day return policy I opted to return the camera and buy a Canon 10D. Some small annoyances I wish Canon will fix since Nikon is hot on their tail- The slap of the mirror is in excess. Really. Trying to take pictures in a quiet room can be very unnerving.- The Compact-Flash Read/Write borders on pitiful sometimes. Yeah I know the files are large but it really takes just too long.- You learn easily that the 4 image buffer isn't enough if you photograph action.- Uh, why on earth are the Aperature and LCD Light buttons about an inch away from my thumb? They need to be moved closer.- When ISO or WB are adjusted it would be nice to have that information in the viewfinder- it's annoying having to hold the camera down to adjust these two paramaters (no real excuse about the ISO!)I think that's about it. If you have NO investment in lenses I may suggest a Nikon D70 if you can afford it, should you think you will become a serious photographer. If you have any Canon EF lenses the D-Rebel is a great choice, especially if you cannot afford a 10D or a new investment in Nikon and the D70. If you barely have the cash for a D-Rebel buy the D-Rebel. Or if you want to be a casual user.I would buy a D70, however bought an extra 28-200mm Tamron Canon Lens so I will end up purchasing a Canon 10D. :)Hope any of this helps!", "Date": "May 7, 2004"}, {"Title": "Terrific camera to learn photography with", "Author": "Jon", "ReviewID": "R30O3VJMA078B", "Overall": "5.0", "Content": "I was doing very heavy research for a ~$400 digital camera last Summer when Canon announced this baby out of the blue. The prospect of getting a 6.3MP digital SLR for a little more than double what I was prepared to spend on a camera was a no-brainer for me. I received my Digital Rebel w/ kit lens at the end of September, so I've been using it for almost 4 months. I'm no photographer; I'm still learning even the basics of photography.First of all, I recommend the kit lens. It's great for wide-angle interior shots, especially parties and get-togethers. I was wanting for something with zoom, so I picked up a 28-200mm zoom lens, but I consider the kit lens to be my \"interior\" lens and use it as such.Adjusting to shooting through only the viewfinder was more of an adjustment than I expected, having used a point-and-shoot digital for 3 years prior. I'm getting used to it more quickly than I expected, though. I expect that, eventually, I'll consider it unprofessional to shoot with an LCD. On the other hand, there are situations where shooting from the LCD would be advantageous and helpful.Recommendations: 1) learn to use exposure lock to get proper exposure, especially in scenes with light and dark. 2) Always shoot in RAW mode for special shots, such as family portraits. Nothing is worst than assembling the troops, shooting what seems to be a good pic, getting it on the computer, realizing that it'll need a lot of touching up and noticing that your JPEG image loses detail and quality with every touch-up.Most sub-$1000 cameras teach you simply how to snap photos. The Digital Rebel teaches you *photography*. If you're a novice like me and this sounds intimidating, then sticking with a cheaper point-and-shoot sounds up you're alley; however, if you welcome the challenge, then this is the camera for you.", "Date": "January 18, 2004"}, {"Title": "Great Camera for the Price, but could stand some improvement", "Author": "Jason Johnston \"readingrookie dot com\"", "ReviewID": "R1UABDM2YMOIOQ", "Overall": "4.0", "Content": "Ok, first off I have to say that I bought my camera about 3 days ago.  I have used it for several personal events, but I have not used it yet to do the main thing I bought it for, which is sports and action photos.I have read some great reviews about this camera, and overall I am very pleased with it.  But I do think that there are 2-3 items that I should address that annoy me about this camera, which I did not realize before buying.First, I came from a Canon EOS A2, which had most features that I ever needed.  About my only complaint on this camera was that the flash-synche wasn't quite fast enough for me.  But that was minimal.Now, with the Digital Rebel, I realize I am taking a step down in the EOS \"family line\" but I was hoping the Rebel would be upgraded as such with the features that it's predecessors lacked.  Some were, and some weren't.The first lacking feature is the inability to change metering modes.  The camera has preset metering modes in the different \"creative\" and \"preset\" settings.  I cannot change from center-weighted metering to full-frame metering in Tv (shutter priority) Av (aperature priority) or full program (P)  The camera presets the metering for each of these modes and does not give me the option to change.The same is true for Single Shot and AI Servo focussing.  I cannot tell the camera to focus on a moving subject, unless in the \"Sports\" mode, and then in this mode, I cannot set the shutter speed manually.  In Tv, the camera \"senses\" whether you are following a subjext or not, and focuses either single-shot or AI Servo, depending on the movement of the subject.  But I have noticed that it takes a small amount of time to detect the subject moving.  After this, the lightning-fast EOS focussing system kicks in and all is well.These may be minor features to most, but they are features I became accustomed to with the EOS A2, and that camera is several years old.  I was hoping this new and improved rebel would be more munipulative, but it is not.Overall I would still rate this camera at 4 stars.  The photo quality is outstanding and the ease of use is great.  The focusing still screams and I can use my former lenses.  I just wish I would have known about these other features before-hand.", "Date": "April 11, 2004"}, {"Title": "Great review but list price is ***BOGUS***", "Author": null, "ReviewID": "R3QPBYWSD12MUZ", "Overall": "5.0", "Content": "This is a great camera and a great deal.  But Amazon is full of it.  They try to fool you into thinking you are getting 35% off the list price.  In fact, Canon advertises the list price at $999, the same price that Amazon sells it for.  They improperly show the list price at well above this to fool you into thinking you are getting a discount.Dont get me wrong, the camera is worth $999, but you are not saving a single penny from ordering from this site!", "Date": "November 15, 2003"}, {"Title": "A great value and excellent technology.  Film is dead!", "Author": "Roger J. Buffington", "ReviewID": "R3NKJWWYRC9I0S", "Overall": "4.0", "Content": "The Digital Rebel is an excellent digital camera that proves, to me at least, that 35mm film is rapidly dying as the medium of choice even for rather casual amateurs.  At under $1000, the Digital Rebel allows the amateur photographer to use the fine Canon autofocus lenses on a 6.3 Megapixel camera that can take superb pictures that are indistinguishable from film.  As of Spring 2004 six megapixels is more or less the standard for the best digital SLR cameras.  The advantages of digital images are many.  First of all, the digital camera allows the user to check the images as they are being taken, and even delete the \"dogs\" on the fly, freeing up storage space for another try.  No more suspense, as was the case with film, about how, or whether, the pictures turned out. The CF cards that the camera uses will hold several hundred images depending on the type of file format that the user selects.  After a shooting session, the user can examine the shots in detail on a personal computer and determine which ones are worthy of printing.  Then we can either print out professional-quality photos on a PC printer (photo-quality printers are not at all expensive these days, although the ink is not cheap) or email the image files to any of several printing companies that will mail back prints in a day or two.  The convenience is incomparably better than film.The results are better than film as well.  Using any of several inexpensive computer programs, even a casual amateur can modify, crop, and make other changes to the digital images that surpass what could once only be done in a $20,000 chemical darkroom.  The \"digital darkroom\" has arrived!The Digital Rebel is positioned well below Canon's excellent flagship camera, the Canon 10D.  It lacks certain features of the 10D including certain metering options.  It is not built as sturdily as the all-metal 10D.  But build quality is not at all bad on the Digital Rebel, and I liked the ergonomics of the camera and the layout of the menus.  And the price is truly competitive, around $500 less than the 10D--a significant difference.For a 35mm photographer looking to make the jump to digital, the Rebel is definitely one to consider.  If one has an investment in Canon autofocus lenses, the Rebel may very well be the way to go.  Users who do not have an investment in lenses will also want to compare the Rebel to the Nikon D70.  The two cameras are priced roughly the same, and the feature set is somewhat different--the D70 provides for different metering options that may (or may not) make a difference to the buyer.Overall, the Digital Rebel is a hot seller for good reason--it can take stunning digital images, it uses the same lenses as Canon's more expensive 10D, and is priced for the serious amateur market rather than the semi-pro market.", "Date": "April 15, 2004"}, {"Title": "Canon EOS Digital Rebel is tres fantastique!", "Author": "Amanda Miles \"French lady\"", "ReviewID": "R3NNJ2TH9XFG69", "Overall": "5.0", "Content": "I had been drooling over this camera for months, and recently I was able to purchase it.  In the area that I live the camera hadn't come in, and I was going to have to special order it.  Luckily Best Buy saved the day and thus...this review.  I have a great Pentax ZX-60 SLR that I have been using for quite some time (I love this camera as well) and had had a cheapo digital camera, so I was a little skeptical at how the digital rebel would perform.  This camera has given me some awesome pictures in the few weeks that I have had it.  Prior to owning this camera, I was considering becoming a professional photographer, and now I am truly hoping to become that.  The only thing that bother's me about the camera, is that it didn't come with ANY internal memory.  But, I talked my husband into getting the 1 gigabite compact flash card, so I am set.  It would be disappointing to recieve and then have to go and buy a compactflash card just to see if the camera works. Another great feature of the camera is the rechargable ion battery.  My prior digital camera took 2 AA batteries and sucked the juice out of them as quick as I put them in.  I took 92 pictures the other day with the rebel, and the battery hasn't run down at all.  One thing that I would recommend a buyer do would be to buy the camera bag that Canon has made to fit the digital rebel.  It's sixty dollars, but it comes with a UV filter (which is great to protect the lens) and an extra rechargable battery!  I could take a gazillion pictures with both of these batteries!  Anyhow, I completely recommend this camera to anyone who has some knowledge of how to use a 35mm SLR camera.  If you don't have the knowledge, the camera does have a point and shoot type mode, but why waste your money if you aren't going to use any of the super cool features that you are going to pay for???  J'adore le Canon Digital Rebel!!!", "Date": "March 1, 2004"}, {"Title": "Improved my pictures 100%", "Author": "Chris Lee Mullins", "ReviewID": "R2VJ1V20KVQNKJ", "Overall": "5.0", "Content": "Giving the number of stellar reviews this camera has received, I guess the Digital Rebel can do no wrong.I switched from a Canon Powershot G2, a camera with which I took over 14,000 pictures. I loved my G2 but it had seen way too much action. Plus, I wanted the luxury of interchangable lenses. My wife had a normal film Rebel SLR, so for sake of compatibility, I figured I'd stick with Canon again.One Digital Rebel and $2000 in lenses later, I'm happy to say that I'm very pleased. The quality over your average Point & Shoot cameras is significant. The Rebel opened a whole new door for me when it came to post-processing. I found myself encouranged to use Photoshop, putting some spin on otherwise poor photographs. Yes, the Rebel does have a significant learning curve, especially if you move away from the Point and Shoot settings. I had to learn nomenclature and settings, but figured it out eventually. The manual was fairly helpful in this regard.If you are worried about moving from a PnS camera system to the Prosumer side, don't be. The Rebel does have those PnS settings. The only thing you'll be sacrificing is Movie Mode, as the mirror occludes the sensor. Well...you might be sacrificing some cash as you discover the multitude of EF and EF-S lenses that Canon has to offer.If you do purchase the kit with the 18-55mm EF-S lens, be prepared to exchange it for something else. For the record, I purchased three lenses with this camera - a 17-40mm 4.0/L for outdoor photography, a 50mm 1.4f lens for indoor portrait work, and a 75-300mm USM IS for aircraft and wildlife photography. Just like the camera, each of those lenses has served me well.", "Date": "February 23, 2005"}, {"Title": "An excellent camera!", "Author": "paparazzi83", "ReviewID": "R1LTE23MAVZEYM", "Overall": "5.0", "Content": "I am not going to get very technical, because I don't have the time. But this camera has got to be the best for it's price at this time! I have used a Canon S300 (Compact Digital) and a Fuji S602Zoom (SLR-like digital), Of coure bad comparison but this camera does blow both of them away! The picture quality is amazing, and the autofocus, although not perfect and super-fast, is the best I have experienced, and at this price range, probably the best around. The flash is great (since it's in-camera) but don't use it for anything more than in a small room!The best things about this camera are:- Picture quality is excellent- Autofocus is very responsive and 95% of the time super-accurate- Manual functions are well-placed, and Automatic settings are very well designed.- Interchangeable lens design gives this camera a creative advantage (it does take Canon EF lenses without a problem and will use Tamron lenses too, I bought a 28-200mm Tamron and it works like a charm)- Internal flash is very good for PnS stuff but if you want to get serious buy an external flash- The Included 18-55mm lens is GREAT for small rooms or tight spaces, a real asset for anyone. I really recommend getting the camera with the lens because it's worth it. Be warned: it's the equiv of a 3x... to get Sony DSC-F828 performance, you will need to buy a 28-200mm lens.- THE BATTERY: IT LASTS FOREVER. One camera where you don't HAVE to get an extra! Unless you do a LOT of flash photography in one day!Some cons though (hey, when they make a perfect camera I'll tell you!)- THIS IS AN INVESTMENT: The price you pay now is not going to be the final tag. So far I have paid an extra $400 for the forementioned lens and $70 for a 256MB card. I would like to buy a external flash but I don't have the cash. It's gonna cost you a lot more, and the price tag might give some of you a stroke, but if you think INVESTMENT (like that all the extra equipment will be useable later), the dollar ammount will not look so big.- The camera rattles if shaken hard, but according to some reviewers/insiders, that's the flash release mechanism, and so far it seems true (when the flash is deployed it does not rattle).- Camera build is plastic, because of the cheaper price. Some things feel very fragile, like the lids to the CF and Camera compartments, but I have seen this in most of my camera equipment, and they seem to hold with care.- It's an underperformer (shutter speed/slap noise/write speed/customizability, etc.) compared to the EOS 10D, but what can you expect? Canon still want's to sell both! And this is ENTRY LEVEL (at $1,000?) so I can understand the cheapening.I want to say one thing: If your camera does not Autofocus correctly or in a speedy fashion, return your camera for an exchange! Many of the problems discussed are probably manufacturing defects, which happens with ANY product. Just make sure to take it back so there are no problems and say it's defective. The short: THIS CAMERA ROCKS!!! If you have $1,000+ to spend on it...", "Date": "February 25, 2004"}, {"Title": "for amateurs and pros alike!", "Author": "F. Ehorn", "ReviewID": "R1C3BJBPSQ4Q8B", "Overall": "5.0", "Content": "I couldn't be more pleased with my Canon Digital Rebel.  I purchased it along with the 28-135mm image stabilized USM lens and the 50mm 1.4 USM lens.  I have found that the 28-135 is a real workhorse for Arizona scenics.  Not especially fast, but it does the job in 95% of my applications.  If you have ever used any of the Canon EOS or T90 SLR cameras, you will quickly figure out the controls on the Rebel.  It shoots either JPG or uncompressed RAW images, and I have found that the RAW format is easy to utilize with the File Viewer Utility (FVU) software provided.  I basically download to FVU, adjust exposure or white balance if necessary, create a TIFF file and do any final adjustments on the TIFF images with the Photoshop Elements 2.0 software that was also included in the package.I recommend acquiring a cable release for longer exposures and also getting the reasonably priced 420EX E-TTL flash, which makes indoor shots a snap.  In five minutes you are up and running.  The camera is remarkably easy on the supplied battery, since I have run a couple hundred pictures and the associated downloads without it breaking a sweat on one charge.  This camera is aimed at the reasonably skilled amateur who wants 16\" x 20\" blow-ups he can be proud to hang on his wall.  Now, if I could only afford some of those \"L\" lenses....!", "Date": "December 5, 2004"}, {"Title": "Excellent Camera - Buy it Now!", "Author": "S. Antonio", "ReviewID": "R2ZFOHQQ12GQVW", "Overall": "5.0", "Content": "This is my third digital camera I have owned (previous cameras: Canon Powershot S100 and Canon Powershot G1). I have used the Digital Rebel for over a year now and have had excellent results. In addition, with the introduction of the Canon D20 and now the Rebel XT, the original Digital Rebel has fallen in price and thus making this camera even a better deal. I would recommend you buy the body only and get a good quality Canon lens (i.e. 17-40L or the 28-135 IS) as a starter.Some people have said the Nikon D70 is a better camera to go with. My friend has one and I have used it on some occasions - and I do agree it is a good camera, but the Canon is superior in that fact that Canon offers a better range and quality of lenses than Nikon.For a sample of photos taken with the Digital Rebel take a look at my site:[...]Scroll down to the Oahu, Hawaii 2004 and the Wild West Road Trip 2004 albums. All photos were taken with the Digital Rebel and with the 18-55 and 28-135 IS lens (I have upgraded and now have the 17-40L).Buy the Digital Rebel and you will not be disappointed!", "Date": "March 18, 2005"}, {"Title": "Oustanding value", "Author": "L. D. Shaw", "ReviewID": "R1EIAJ2LIA29S5", "Overall": "5.0", "Content": "I purchased my Digital Rebel several months ago, and I am very pleased with the performance. Picture quality is the best I have seen from a digital camera. Colors are accurate, resolution is excellent.The only real drawback is the camera (as equipped) does not work well in low light settings. I suggest purchasing the Canon 50mm f1.8 lens for approx $70 for indoor use without flash.Also, I recommend a Canon telephoto with \"image stabiliztion\". As far as I can tell, only Canon has this technology available for the average user. It works exceptionally well - especially if taking pictures of moving subjects. I have used mine at several airshows, and can follow an object flying across the airfield at 300-500 MPH - yet still get perfect photos.There are several good options in digital SLR cameras, but considering the lens technology, Canon is the best choice for me.", "Date": "November 17, 2004"}, {"Title": "Highly Responsive and Easy to Use", "Author": null, "ReviewID": "REUUHCREKBDEH", "Overall": "5.0", "Content": "After owning a Canon G1 and G2, and thinking about moving up to the G5 or new Powershot Pro1, I decided to switch gears and go with the SLR route and get this new Canon Rebel with lens kit.My main gripe with the G1 & G2 was the slow startup time coupled with slow and poor autofocus, both of which are solved in this camera.  Turn it on and start shooting - no more waiting for the little lens to extend and slow autofocus with this camera!It actually looks bulkier than it feels in your hands, it feels very natual and comfortable to take pictures with.And the picture quality from what I saw so far has been fantastic - very close to film quality, without the \"video camera\" look that happens sometimes with the G1 & G2.I also really like the wide 28mm equivelent lens that comes with the kit, it seems like a very good starter lens.  And the fact that I can mount my Speedlight 420EX flash on it to help out the built-in flash is really a plus.From somebody who owns 3 other digital cameras (Canon A50, G1, G2), this is my favorite one by far - very highly recommended.(Only thing I really miss is the lack of sound recording in movie mode - the camera has no microphone so you get video only)", "Date": "June 12, 2004"}, {"Title": "What an Awesome Camera", "Author": "Gerald W. Williams \"Geedub\"", "ReviewID": "R1LSI1LVUGUZCY", "Overall": "5.0", "Content": "I purchased this camera after studying several similar cameras and reading every review.  After comparing all the pros and cons of the many cameras that I was reviewing, I decided on this one.  I am extremely happy with the decision.This camera is a full size SLR camera, which is exactly what I was looking for.  I have big hands and the compact cameras just didn't fit well.  I wanted a digital camera that does everything the SLR cameras do.  This camera is the ticket.  I can practice all day long using all the different settings to get used to the camera, and I don't have to worry about wasting film.  It has six settings for file size of the .jpg photos.  The highest quality (6.3) mega pixel is about 3 megs.  The smallest is about a 4/10 to 3/10s of a meg, which is a very good quality picture, even at the smallest setting.  I recommend getting the high-speed compact flash card for the camera, it's only about ten dollars more and you can take high-speed photos with it.  I take about 2-3 a second (1-2 a second using the flash), which is outstanding for a digital camera.I haven't experienced some of the problems I have read in other reviews, such as under exposed photos indoors; in fact I've experienced great indoor shots.  I had a few unfocused shots, but that was me, not the camera.I could go on and on about this camera, the most important thing, it's easy to learn, even for a beginner and is just about everything you will want in a camera (except for being tiny).  It's a great buy.", "Date": "February 3, 2004"}, {"Title": "EOS Digital Rebel - Worth Every Penny!", "Author": "bcreigh@bobcreigh.com", "ReviewID": "R2KUHCL3I7XARC", "Overall": "5.0", "Content": "I have been an amateur photographer for over 25 years and started out with a Pentax K1000 SLR. Things have changed a lot in that time and the Digital Rebel (300D) was a welcome addition to my photography arsenal. My last film camera was a EOS Rebel XS and I have two lenses (35-80 and 75-300). I was seriously considering the 10D, but at $...without a lens, it was a little more than I was willing to spend. I must say I was elated when I saw the Digital Rebel had been released and for $1000 with a lens. I did quite a bit of comparing between the 10D and the Rebel and there just wasn't enough difference to warrant the extra $...for me. If you are a professional, I would go with the 10D for the added control, but for the rest of us, the Rebel can do everything the former does it just requires a little more work to get there. The image quality is outstanding. I also have an Olympus C-2020 point and shoot and I would say in the Full Auto mode, the Rebel is just as easy to use as the 2020. Getting the desired results in the Program and Manual modes has a little learning curve to get the desired result but it's in there and after playing with it I have been able to get what I want.", "Date": "October 16, 2003"}, {"Title": "Excellent choice for novice or advanced photographers", "Author": "Arthur P. Haviland Jr. \"AirshowFan\"", "ReviewID": "R3RZAVNMQU5B8Y", "Overall": "5.0", "Content": "I've had the camera for two weeks and it has taken fantastic shots indoors and outdoors in various lighting conditions. Novices should consider this camera. It is easy to use with settings for auto, portrait, landscape, macro, sport and more. When you gain knowledge, you have full manual control. Unless you already have Canon EF lenses, buy the camera with the 18-55mm lens. It is a good choice and will get you started at a fantastic price. The portrait mode is great. It will focus on your subject with a wide aperture that will blur the background. The landscape mode does just the opposite. My foliage shots this year taken with this camera are the best I have ever captured. I have shot over 200 images without needing to change batteries, but I keep a spare with me. There is no compact flash card provided with the camera. You will want to get a large one, 512mb or more. If you take a few pictures while on vacation, this is not the camera for you. If photography is your hobby, then get this camera now. You will not regret it.Update: 1/4/2007After two years of heavy use, the shutter failed on my Digital Rebel. Fortunately, I had purchased the camera at Best Buy with their extended warranty. I brought the camera back and they replaced it with a Digital Rebel XT that I now use as a backup to my Canon 20D. If you are buying one of these cameras used, you should know that shutter failure is a potential defect. Try it before you buy it if at all possible.", "Date": "October 19, 2003"}, {"Title": "Excellent first DSLR", "Author": "Mark Fellows \"Gadget Guy\"", "ReviewID": "R1FLO7P6CAMSN8", "Overall": "5.0", "Content": "I am pleased with this camera.  I understand that the Rebel XT is clearly better but for the difference in price I thought I could make due with the original rebel.  I was right.  The rebel takes great pictures, the color saturation is perfect, there is virtually no shutter lag at all, as compared to my other digital compacts.  The continuous shooting modes work much better than any of the cameras I have used so far.  The battery life is excellent, and the  auto focus is usually right on.  For those instances when I want to focus on a specific thing, other than what the camera does, the manual focus couldn't be eisier! I have a website page with the pictures I have taken with this camera and the others mentioned below.[...]Previous camera experience:  Olympus C-765, Kodak DX7630, Fujifilm 550, Olympus D-580, and Casio Z4U", "Date": "May 30, 2005"}, {"Title": "A Real Pleasure", "Author": "Randy Ardie Davis \"Dulcimer Maker\"", "ReviewID": "R3ORE8H2DWTGKI", "Overall": "5.0", "Content": "I've had my Digital Rebel EOS for over a year now and I couldn't be happier with its performance. I've added a battery grip, which provides heft and vertical picture taking functions, and the camera feels like a pro. I've also added a Canon 100-400mm USM lense that provides great close ups.I've used the camera on everything from weddings to wildlife to portraiture to product photos and am extremely happy with the results. Wonderfully clear pictures.To get optimum color, brightness and contrast for prints, however, you will need to use photo-enhancing software to take the place of corrections normally done by development labs for film photos.If I were to make a digital purchase today, however, I would probably opt for the Rebel Digital XT model which increases the resolution to 8MB and provides some updated light metering technology.Highly recommended!", "Date": "March 22, 2005"}, {"Title": "Great performance...Great price...who cares about the cosmet", "Author": "Michaeleen R. Munrow \"zefyr\"", "ReviewID": "R2LFD23U0W5TZB", "Overall": "5.0", "Content": "First of all this is a great performing camera. I got mine for a volleyball tournament and it was so fast. It capture action shots easily without that annoying delay time that happens with lower MP digital cameras. My photos came out SHARP...you really can see a difference between the superior quality taken with this camera compared to my film SLR (using the same lenses). I bought the Sandisk Ultra II 512Mb compact flash and use high resolution on the camera and had plenty of available shots to take. Plus with the option for deleting the pictures that you don't want, you can't go wrong. I also like the option of having the LCD screen off during shooting that way it saved on the battery...which lasted all day on a single charge!My only complaint was that b/c I was using the camera in the sun for two days during the tournament the paint where you grip the camera blistered then peeled. It got everywhere. I'm also concerned about the plastic cover for the connection ports for downloading. It seems a bit flimsy. But for the price of the camera (and the amazing quality of photos it produced) I'm okay with these cuts on the cosmetics end.Buy this camera. You'll be happy with its results.", "Date": "September 17, 2004"}, {"Title": "Canon Digital Rebel_Excellent Camera", "Author": "Robert Dickerson", "ReviewID": "R1E54IZ1JKQKA2", "Overall": "5.0", "Content": "I've owned two different Digital Rebel bodies, both the 18-55 and the 55-200mm lenses.  In my view, the D300 is the camera for anyone's entry into DSLR based photography. The images generated by this camera and either of the afore mentioned lenses are simply amazing.  When proper effort is put into learning the functionality and capability of this piece of equipment, you can expect images that are the equal of any 6 megapixtel camera on the market.  The lenses are not the equal of the top of the line canon glass, nor are they intended to be. They are entry level lenses that will allow you to get a feel for DSLR photography without investing thousands of dollars. A top of the line Canon lens on the D300 and on the higher end D10 generates images that are indistinguishable from one other.  I know this because I have both cameras, some of canon's finer lenses, and I've tested.  The D300 is an exceptional value and the addition of the $100 18-55mm lens is unbeatable by any manufacturer.", "Date": "April 19, 2004"}, {"Title": "Fast and Fun", "Author": "Michael Preiss", "ReviewID": "R18LPBKRATN5A7", "Overall": "5.0", "Content": "My wife and I recently decided to take the plunge into the \"digital\" photography world, but we were really concerned with losing the functionality for special shots that we had with our old Canon AE.  The Digital Rebel was exactly what we were looking for!  Talk about functionality.  This camera does more than we could have ever hoped for in a digital unit.  It's easy to manipulate, and is lightning fast.  No waiting for the shutter and missing that important candid shot.  The images are clear and crisp and download to the PC (or straight to the printer) in seconds.  The ability to cary one camera that does it all from close ups, to portraits, to landscapes and sports shots is wonderful.  With a 512MB CF card, you can hold over 150 high quality photos at once (over 200 at reduced levels).  No worries with having to sort the good from the bad now.  Just snap away and sort them out later.Now we are simply waiting for a telephoto zoom lens and we will have all the still photo capablility we need in one handy little bag.  Yes, it's a bit pricey, but well worth every penny!", "Date": "February 23, 2004"}, {"Title": "Worth the Wait", "Author": "J. RANDELL TIONGSON \"Randell\"", "ReviewID": "R380LPZDHWSKHS", "Overall": "5.0", "Content": "I have long been a Canon SLR user (since 1982)... owned the AE-1 Program then later the EOS.  When the digital age came, I still stuck to my old Canon's , I felt that the digital cameras just don't have the same magic as my old ones.  I've always wanted a digital camera but only if its an SLR... I couldn't afford the earlier models so I patiently waited for Canon to come up with a camera that I can afford.... I was glad that I waited... the Digital Rebel was really worth the wait.  Great resolution, easy to use (well not as easy as the old slr's)... a great camera from a great brand.  I saw the slr like digitals like the Nikon 5700 and the Sony... it costs as much as the rebel but it's nothing like a real SLR.  It's still a bit expensive, was hoping for a $700 price but I couldn't wait any longer so I got this one.  22 years of using Canon SLRs, I think I made the right choice.", "Date": "February 4, 2004"}, {"Title": "This camera is god.", "Author": "David Zweben", "ReviewID": "RWODU0X8HQ8LY", "Overall": "5.0", "Content": "This camera has one flaw and one flaw only. The auto white balance tends to make some image yellowish with the flash off. Everything else about the camera is amazingly good.The white balance with flash on is perfect. The batteries don't seem to die at all.  The auto focus is extremely fast. I tried (forgetting I had manual focus) to get something out of focus by moving the camera rapidly. Didn't work.The lens is high quality had has a pretty good zoom (3x BTW- took me a while to find that info) It has a switch on the side to go between manual and auto focus.The modes work as they say they do. All 12 are useful for different shots. Go into the auto mode and the camera becomes a point-and-shoot. Go into full manual and it becomes the camera that takes photos you find in magazines. Remarkably, it even takes perfect photos of people who always say they aren't photogenic (and aren't with any other camera).  People who blink when the flash goes off don't with this camera.It took me a few weeks to learn how to use the manual modes. The manual is extremely good, considering I used it. (I usually hate using manuals) The macro mode is so good, pictures often come out badly because the camera shows dust and dirt on the objects that you can't even see with the naked eye. I consider this good.The camera seems to be designed for right handed people, but I am left handed, and it doesn't feel awkward at all. I also wear glasses, and find taking pictures comfortable with or without them. (The adjustment just barely corrects for my poor vision, however)The controls are well laid out and make sense. The menus are easy to navigate, and deleting pictures is fast. The design of the camera is also great. Even though the body is plastic, it looks and feels more like metal. Not cheap at all. It looks great.And its pictures are just amazing. Amazing. If you are looking for a camera in this price range, get this camera.If you have any questions, feel free to email me at dzweben@mac.com, and I will try to answer them.", "Date": "January 25, 2004"}, {"Title": "Outstanding Camera!", "Author": "Amy \"Amy\"", "ReviewID": "R2NM0CTT9NA482", "Overall": "5.0", "Content": "Guys this is a great camera. My only suggestion is to buy the body only rather than the package with the lens. All Canon lens fit on it. So buy the one(s) you want rather than the less than top quality one they include in the package.Great purchase that I use for work and play :-)Amy", "Date": "December 24, 2004"}, {"Title": "Pretty darn good camera", "Author": "\"forbes120\"", "ReviewID": "R1RN5SV4126X5J", "Overall": "5.0", "Content": "Previous digital camera is a Olympus Camedia 4.1 - it takes some very good pix and is quite rugged.Before purchasing the Canon Rebel-D I read over a dozen editorial reviews, many dozen(s) customer reviews and hundreds of newsgroup postings related to it. I read the manual, cover to cover, three times and reviewed specific pages many times.  I visited three different retail outlets and handled the camera many times.I've now shot a few hundred test pix of a myriad of subjects using every camera setting available. Most were shot using the Canon EF 28-135 f/3.5-5.6 IS USM lens.A lot of the 'con' comments about the camera - white balance problems, dark flash problems, focus issues, etc - I have found to be user user specific.  Don't blame the camera.I've printed differing sizes of prints on two different HP photo printers and have taken the files to four different retail print sources. With one exception the printed photos have been quite acceptable.  (Kit's Camera at our local mall had a focus problem with their Dye-Sub printer. They assured me the tech would be called)If I could add just two missing features they would be the LCD preview and the flash exposure adjustment.The camera gets a thumbs-up here!", "Date": "March 6, 2004"}, {"Title": "Almost idiot proof", "Author": "M. H. Bayliss \"book queen\"", "ReviewID": "RQWAJ4N1GP8NC", "Overall": "5.0", "Content": "I had an Olympus digital camera for several years but it started to frustrate me.  The two HUGE advantages the Canon has is that 1 -- there is NO shutter delay that makes you miss the shot:  the shot is taken as soon as you press the button and 2 -- you can buy high quality lenses that make the camera even more amazing.  Let me say I'm not a pro photographer or anything, but I figured out how to use all the features of this camera within a day or so.  It's very intuitive and fun.  Don't be afraid to step up from your non SLR camera.  Besides, you can still \"point and shoot\" in automatic modes, but it's awesome to be able to control just the aperature or just the shutter speed.  The pictures this camera takes are incredible!!!  I have to admit I've gotten gadget fever.  I'll make some recommendations based on my two weeks with the camera.1 -- buy a 1GB or bigger compact flash card with fast download speed.  At big megastores they are very much discounted.  Also, don't forget to REFORMAT the card every time you put it back -- my old cards always got \"corrupted\" and the way to avoid that is to reformat every time (just takes 2 seconds -- use the \"format card\" option on the camera menu).2 -- buy an external flash.  You'll notice that the internal flash tends to overexpose yoru subjects -- I bought the Canon 420 (or something like that) and it's amazing. My pics are TWICE as good3 -- I'd recommend NOT buying the kit lens and putting that money towards the exact Canon EF lens you'll need.  I bought one zoom and one prime lens and the quality is 10 times better. Plus, a 1000 camera deserves high quality lenses.4 -- don't forget the crop factor when you buy lenses!  It's hard to find this out on your own, but because of where the sensor is on Digital SLRS, you have to multiply the focal length of the lens by 1.6.  So, a 35 mm lens if you put it on this camera is equivalent to a 55mm lens, and so on.  Plus, if you have other non-digital cameras, be sure to be EF lenses only, not EF S which only fit on digital cameras.My only complaint (and this is nitpicking) on this camera is that I wish the finish were tougher looking and not quite so plasticky.  I like the Nikon cameras and upper level canon camera materials, but I understand that this is how Canon can sell a camera which is optically as good as the 10D for a lot less. On the plus side, it's nice and light.These are my thoughts after the first few weeks -- I LOVE the camera overall and now that I have two great lens, my pics look almost professional, not bad for a mom who doesn't know much about photography.", "Date": "February 5, 2005"}, {"Title": "Great 35MM SLR upgrade", "Author": "Reuben Gathright \"rgathright\"", "ReviewID": "R3AMO6H6WUTM9Z", "Overall": "5.0", "Content": "Pros:Comes with battery and battery charger!I was able to use an aftermarket Canon zoom lens on this camera that fit my old Canon 35MM SLR!There is a popular BIOS upgrade on the net that will let you activate certian features found in the Canon 10D!Cons:Camera driver in Windows XP does not allow you to upload files.After I made certain complicated shots in the advanced shot modes, the camera locked up with error codes.  Turning it off and on fixed the problem though.The lens that came with the camera has a cheap plastic mount.  I am worried it will break with repeated lens switching.", "Date": "December 28, 2004"}, {"Title": "Even beginners will enjoy", "Author": "Jamey Key", "ReviewID": "R372S0SFCEIIAG", "Overall": "5.0", "Content": "I consider myself an aggressive beginner digital photographer.  Maybe I'm up to mid-level by now since this is my fourth digital camera, but since I don't use any of the manual controls and dont know a white balance from an f-stop, Im far from a pro user.With that said, man I have taken some pretty good shots with this camera!  I love it.  I carry it with me just about everywhere I go.  I look pretty nerdy carrying this camera bag around with me all the time, but you never know when you will need it and I am trying to make up for not taking very many pictures the first half of my life.  Ive had this camera for about a year, and Ive taken at least 2,000 pictures with it.  It's great, i enjoy it, thank you baby for getting it for me!If you have any kind of photo software on your computer, the Digital Rebel will work with it.  If you have some advanced software like Photoshop and iPhoto, it will sing!  Most of the photos, I simply import into iPhoto and from there, I can print to the Epson Stylus Photo 960 and get great results.  The 6.3 MP Digital Rebel takes such GREAT BIG pictures, that you can blow them up a little and not lose any detail.  You probably won't need to blow them up though because they are so big to start with.  At 100%, they are bigger than the largest computer screens.The difference in this and a smaller 4.0 MP camera (like my Canon S-40) is that you don't have to be so close to the subject to get a good picture.  From across a room, you can take a good shot, then zoom in when you crop.  It leaves a lot of room to zoom.I use a 256MB Compact Flash card and the camera shows to hold 71 shots at full resolution, though you may be able to get a couple more than that out of it.  So, if you get a 1GB card, it should easily hold a couple of hundred shots.  I would recommend an additional battery, a bag, and if you are really industrious, a larger lens.  I have a 30-200 (I think) and it only cost about $150.About the only thing I had trouble with, is that you cannot hold it out in front of you at arms length and see  your subject on the monitor before you take your shot like you do with smaller digital cameras.  It is because this is an SLR camera and you have to hold it up close and look thru the lens.  Dont buy this camera if this is a concern.  It does have a color monitor, but that is for reviewing the pictures after you have taken them and configuring the camera only.  Im used to it now and its not a big deal.", "Date": "March 9, 2005"}, {"Title": "It's all about image quality", "Author": "Richard E. Goedeken \"R. Goedeken\"", "ReviewID": "R1M3VTYLEP021T", "Overall": "5.0", "Content": "As an engineer, I put my faith in controlled scientific experiments and objective data. In all the reviews that I've seen on the web with similar images from the Rebel and other cameras, in my eyes the Rebel wins. But you don't have to believe me, because numbers aren't subjective. On dpreview.com there is a comparison of SNR noise levels from the Rebel versus the Sony DSC-F828 at various ISO levels, and Rebel stomps the Sony. It makes sense: because of its larger sensor, the rebel gathers more light per pixel and thus has higher SNR. The noise level of the Rebel at ISO 1600 was less than that of the F828 at ISO 200. On DigitalCameraInfo.com there are very technical reviews of both cameras. They used an ISO resolution chart and Imatest software to measure the true effective resolution of the camera. The Rebel came up with 5.65 megapixels, while the F828 with it's higher resolution sensor could only muster 5.43 meapixels. Bottom line is that if you know what you are doing, you will be able to capture better images with the EOS-300D than with the DSC-F828. If you want to be able to grab excellent shots without a lot of fiddling and mental exercise, the Sony is for you.", "Date": "August 27, 2004"}, {"Title": "Pretty dang good", "Author": "Peter Boysen \"LoPez\"", "ReviewID": "R3J9AUUI96YDTK", "Overall": "4.0", "Content": "This is a quality starter camera for DSLR use. I bought mine approx. 8 months ago, and since then have moved up to almost 9,000 photos taken. The image quality still competes with newer models, but noise is definitely a weakness. Also unfortunate is the buffer size of 4 pics in either JPEG or RAW mode. Even without shooting in rapid-fire mode, it's pretty easy to fill it up, and leave you stuck waiting for pictures to write to the card. Other than that, it works just fine.", "Date": "June 10, 2005"}, {"Title": "Great results, easy to use", "Author": "E. Orgon", "ReviewID": "R1LG0KVP8WXMIR", "Overall": "5.0", "Content": "I've been both a serious SLR amateur photog for more than 30 years (still have my multiple Minolta SRT-101s) and into digital for about 4 years.  Frankly, I can't understand some of the low ratings for picture/color quality. This camera will function as a simple point and shoot right out of the box with stunning results.  Take a photo in fine setting, crop out just one third of that and you can make a stunning, lab quality 8X10, with perfect lighting (indoor-flash) and perfect color.  Add to that the flexiblity of using ALL Canon lenses on it and you have a real winner.", "Date": "March 3, 2004"}, {"Title": "Can it really be this easy!!", "Author": "Evelyn Rosado \"Evelyn\"", "ReviewID": "R185DFX40JWO8", "Overall": "5.0", "Content": "For about a month now, I've been reading all the reviews for the Digital Rebel.  I was finding hard to believe that a camera can be that easy to use.  I have a Rebel GII that was pretty easy and I got excellent shots with.  I took the plunge and purchased the DRebel and all I can say is WOW!!!The camera is quick and relatively quiet.  The first time the flash popped up I jumped, but you get used to it.  I am replacing an Olympus C-50, which is an excellent camera.  The camera does have some weight to it, but to me that's a good thing.  I like using the viewfinder to take the picture and of course you get to see the results afterwards. The firmware in the camera is very easy to upgrade (which I already did).  The software the camera ships with is pretty easy to use.  My only complaint is that it doesn't come with a CF card.  It should at least come with a small one to get you started immediately.", "Date": "November 14, 2003"}, {"Title": "don't forget the lenses", "Author": "Beav", "ReviewID": "R1CFYNUF2ZMMMY", "Overall": "5.0", "Content": "while the kit lens is great i highly recommend buying some higher quality lenses once you start to get used to using an SLR (Single Lens Reflex).  don't forget that one of the biggest advantages of this moving to SLRs is being able to take the picture you want, even if it means taking 3 minutes to set it up.  a point and shoot digital SLR can still take better pictures.the images that come off of this camera are mind blowing, you can print up to 16x20, with careful post processing.The photographer is more important then the equipment. But this camera can make you a much better photographer", "Date": "October 30, 2004"}, {"Title": "A camera worthy of attention!", "Author": "QueenManuela \"Love is never rude... Love neve...", "ReviewID": "R34EQ1ZH9LEP8O", "Overall": "4.0", "Content": "I bought this camera several months ago.  I love the features and I love the pictures the camera takes.  It has various settings and it is easy to use.  However, the flash is lacking!  The built in flash does not spread enough light on the subject matter.", "Date": "October 28, 2004"}, {"Title": "Groundbreaking camera!", "Author": "\"btdmd2\"", "ReviewID": "R24FB33BD68RUJ", "Overall": "5.0", "Content": "This is my second digital camera, replacing my Nikon Coolpix 995.The digital Rebel has been fantastic.  I have used it with the the Canon 18-55MM lens and a 75-300MM Canon lens with image stabilazation.Here are my random thoughts - quick power up, excellent autofocus, fast continuous shooting - used when I was bracketing shoots which is set up in the menu.  Easy navigation through the menus.  Easy playback.  Fast camera - image to card, etc. Very good flash. Comfortable ergonomics.  Fast out of box experience.  Fantastic battery in kit with long life and quick recharge.I would have paid $2500 for this camera and still felt like it was a bargain.  Finally a camera that makes not just digital photography, but all photography, fun and exciting.  I am now able to do so much more and experiment so much more with apertures etc.Fantastic.  Fantastic.  Fantastic.", "Date": "January 4, 2004"}, {"Title": "Set the dSLR standard", "Author": "Michael Horn \"mikie\"", "ReviewID": "R1ZA3RBJ3SY63T", "Overall": "4.0", "Content": "One of the first to purchase this camera - I've used it over 22 months and really LIKE my decision. Purchased as a 35mm replacement - I was wary of this - my first Digital Camera. The stock \"kit lens\" is a more than an adequate performer. Coupled with a Canon \"L\" series telephoto, a battery grip and a 420EX and 580EX Speedlight that couples nicely with the dRebel - I was in absolute photo heaven!Rich color - astoundingly sharp pictures and manual controls to handle almost every situation - I've taken this camera around the world two times as a defense contractor. This camera exceeded my expectations in every department except the built in flash - which should be supplanted with the one of the previously mentioned Canon speedlights. These flash units couple seamlessly thru E-TTL on the Canon hotshoe or hotshoe extender cord for stunning flash pictures.With the purchase of a speedlight bracket - and diffuser hood - I've taken over 3,000 portraits at charity events and have had nary an unsatisfied customer. The BG-1 battery grip allows a second battery to couple with the first - never - never had I had or have to worry about camera power.Things I'd like to see improve:1) Tighter sealing on the internals - middle east dust has had to be taken out of portions of the camera I did not know existed. A more expensive and tightly sealed metal framed camera would probably prevent this.2) A much better pop-up flash unit.3) A 2.0 USB port - instead of 1.1 for faster computer up and down loading from the camera.4. Apparently - there is a shutter life limit (determined by picture count) that is NOT covered under warranty - shorter than the more expensive professional series Canon Cameras. May be cause for concern...My experience with this early model dRebel has been overwhelmingly positive. Have upgraded camera software from the Canon website and avoided problem operations others have experienced. Many improvements have been made in the Rebel XT an 8.0 MP camera - which also deserves a close look. If you want to make the leap from high level 35 SLR to Digital - come and join the fun!", "Date": "June 9, 2005"}, {"Title": "Fun Fun Fun", "Author": "Bartek Kunowski", "ReviewID": "RSH4DUVRLOO7X", "Overall": "5.0", "Content": "After a lengthy mental debate, I finally purchased this camera instead of the Canon 10D.  What a great a choice.  This camera is light, focuses really fast and the picture quality is supurb.  I take most of my pics with a Canon 50mm 1.4 lense using one of manual-shoot settings in RAW format.  I have not experienced any underexposures shooting indoor (even at night with only a few lights on).  Highly recommended.", "Date": "June 7, 2004"}, {"Title": "Can't say enough good things", "Author": "Shane G. Todd", "ReviewID": "R22O644UZOYLGK", "Overall": "5.0", "Content": "When I first read the reports about this camera, I was a little bit dismayed that Canon left off features like user-selectable auto-focus modes, flash exposure compensation, and selectable metering modes.  After some due reflection though, I can only remember a handful of times when I've used those features on my film cameras.  In the end, a six-megapixel digital SLR that can use the same lenses as my beloved Elan II, for under $1000 was an irresistable combination.I haven't been disappointed.  I picked up my Digital Rebel at the end of February.  Since then, I've shot nearly 1000 frames, and I don't think I can be happier.  The pictures are crisp, with excellent color representation, and the camera is responsive and acts exactly the way I expect an EOS to act.  I've used it so far for landscapes, portrait, casual snapshots, and sports, and all of the pictures have been excellent.  I've had a number of them printed, including one at 20\"x30\".  Battery life is good, and I've yet to lose power during an outing.  Ergonomics are excellent and the camera is light and easy to carry all day.My suggestions for anyone buying this camera is to get a large memory card, (The pictures will take up about 3MB a-piece.) a USB 2.0 reader for downloads, and lots of ink and paper for your printer.", "Date": "April 12, 2004"}, {"Title": "It;s time to make the jump to digital", "Author": "Justarasta", "ReviewID": "R368NN5GOOYP8E", "Overall": "5.0", "Content": "I've been looking at digital cameras for over a year now and I have been holding off.  When this camera came out it got my attention.  I finally bought one three weeks ago when I was on a trip and I forgot my film point and shoot.  Had I known what this camera could do I would have bought it three months ago when I could have.  The camera functions great in fully automatic mode.  The automatic \"creative\" settings and the \"manual\" modes also work very well.  The only thing you have to watch for are the focus points which will vary so keeping clicking half way until they are on the important points.  The camera with the stock lens is plenty sharp - and this is coming from a long time Nikkor lens guy shooting on F2's and F3's.  Get a 1gig flash card and you will not believe how many large files you can get on a card.  Battery life is good for around 350 large photos with alot of flash shots, but you need a spare battery.  The 512 battery is less expensive and works as well if not better than the 511.  Do not bother to get a card reader - you do not need it.  It took this camera to get a dedicated 35mm shooter to make the jump.  The only problem is that now I have a whole different series of lens to buy.  I got a great deal on the 75-300 USM III lens and I have been happy with it.  You can and will shoot more photos than you ever did with a 35mm - and I generally shoot with a motor drive - and you will be amazed with the results.  Do not rely on the LCD to decide if you want to keep the shot - wait unitl you get home.  You get a video out cord to show the photos on a television.  My only question about the camera is its long term durability as it is not heavily built - but then again I'm used to shooting with a camera that is known to be a real tank.  I looked at the Sony 828 but it is not a SLR and the feature set is harder to access - aside from the numerous problems that we have heard about that camera. Did I say that I was very happy with this camera?", "Date": "January 27, 2004"}, {"Title": "Amazing!!", "Author": null, "ReviewID": "R3QMSIYN882B6A", "Overall": "5.0", "Content": "I sold my Nikon 5700 camera and bought the rebel. Although I am new to digital photography, I have taken some wonderful shots with this camera. I am dying to purchase another lens, but have been very satisfied with the kit lens. The smoothness and the clarity of the photos far outweighs that of the Nikon!!", "Date": "January 9, 2004"}, {"Title": "A Pioneer Digital SLR", "Author": "Ken", "ReviewID": "RU5XZX38FKQ7R", "Overall": "4.0", "Content": "Pros: great pictures outdoors, great price, real SLR power and flexiblityCons: 2 stops underexposure indoors; 24 bit color depth;soft bodyIt can be fairly said that Canon is in a pioneer position in the digital SLR space. Not to mention that the Canon 1Ds is the real revolutionary Pioneer camera. Then six months later, the Canon 10D came out, almost shocked the professionals and the amatuers alike with the quality, power and price. Now comes the Digital Rebel, with the same 6.3 megapixel as the 10D, but mounted on a Rebel body. In terms of the specifications, the Digital Rebel is only different from the 10D in two aspects, one is the 24 bit color depth vs. 36 bit in 10D, the other is the 2.5 frame per second of continous shooting for 4 frames, vs. 3 fps of 9 shoots in total in 10D. All other functions are all the same, including 30 to 1/4000 second shutter speed, 7 sensor focus screen and the same Canon new DIGIC image processor. But to my surprise, the Digital Rebel is at least two stops underexposure when shooting indoors. Espeicially, when shooting dark colored subjects, the exposure is extremely difficult to set right. I tried to use a 550EX external flash, and set the flash compensation to 1 2/3 overexposure when shooting my mahogany piano made by Hallet Davis Inc of Boston, and the exposure compensation is 1 stop overexposure, shutter speed was 1/60, aperture F 3.5. The result is still quite dark.Other than this, when shooting outdoors the pictures are truely great.", "Date": "September 27, 2003"}, {"Title": "Awesome Camera", "Author": "J. Foor \"Volunteer FF\"", "ReviewID": "R3CZMTL57FDGIO", "Overall": "5.0", "Content": "Having played with numerous digital cameras in the work place I came to the conclusion I wanted a digital that would compare with my 35mm cameras. I've been using the digital rebel for aproximately 6 months and haven't touched the 35mm in the last 5 months. I would recommend though that you get an extra battery if you plan on using for a couple of days without the ability to recharge the battery. Also reveiwing the pictures taken uses up the battery faster than taking pictures.This camera works well in both light and dark situations. I have not tried it in extreme cold yet, but it works get inside of burning buildings. The shuuter button is easy to find even with gloves on. With a 512mb card set to the highest resolution you still get approximately 77 pictures. For the serious amatuer I recommend at least a 512mb card and an extra battery.", "Date": "September 25, 2004"}, {"Title": "Owned for three months", "Author": "R. Stoer", "ReviewID": "R32WYEOJM4FVNN", "Overall": "5.0", "Content": "This is an excellent D-SLR but it's not a point-and-shoot. If that's what you're expecting, you'll be disappointed. Although I saw immediately that this camera was capable of taking great pictures my initial results were admittedly inconsistent. Some of the problems others had complained of (underexposures, focusing on the wrong object, etc) were happening to me. However, I now get very consistent results. The camera didn't change of course; I've just learned to use it properly. It lacks a few features found on some more expensive models but the picture quality can't be bettered at twice the price. Read the manual, use it, read the manual again, use it some more, etc. If you're willing to learn it's idiosyncrasies it will reward you with beautifully sharp and detailed photos. By the way, if you don't like to post-process your photos (I don't mind) you can turn up the sharpness, contrast, etc quite a bit above the default settings right in the camera. The built-in flash works as well as any (and better than many) with little red-eye. Several external flash units will also work very nicely with this camera. The kit lens feels cheap but produces good pictures. Even so, I've added a few more lenses to my arsenal. The one I use most is a Canon 28-135mm, image stabilized. Image stabilization (IS) is a great feature for low light photography at telephoto focal lengths. To sum up, if image quality is your top priority and your budget is in the thousand-dollar range you cannot do better than this camera.", "Date": "April 2, 2004"}, {"Title": "breakthru in digital camera technology", "Author": "Denis J. EVANS", "ReviewID": "R2NTRQ2JPHJIXO", "Overall": "5.0", "Content": "After all the press hype & the tech reviews, I bought one.  AND yes it is really true. This IS an SLR but it is digital.  It combines just about all the advantages of both, with very few of the disadvantages of either.  It is hard to believe (after owning 2 digitals and 3 chemical slrs!), that this is really true.  I will not go into details - ... What is soo great compared to the usual digital cams: enormous low noise sensitivity - even to ISO 800; enormous exposure flexibility and composure accuracy; fantastic lens choice; and a BRIGHT non digital SLR exposure composition screen- works in sunlight - its an SLR! There is NOTHING on the market that compares for the price. Buy one!16/10/03:  Just did a comparison between poster size enlargements of images from my Canon EOS 500 (chemical SLR) and my new EOS 300d. Very similar quality at poster size!!  There is a difference between graininess (chemical) and pixellation (digital). Overall the subjective quality of fine details at hi res is amazing similar. But all the digital advantages rest with the 300d!! The chemical SLR (35mm) is now dead!1/12/04:  There is a serious issue with all DSLRs: dust!  You WILL have to manage dust on the sensor of this DSLR - same for (almost) all other DSLRs!! Damm!!! Once every 6 months you WILL need a sensor clean. Until Canon et al find a technical solution.", "Date": "October 12, 2003"}, {"Title": "Awsome Camera", "Author": "\"kriscartwright\"", "ReviewID": "R1LUHTOTFUHKM3", "Overall": "5.0", "Content": "I am sold on this camera!  It is by far the best digital camera on the market for the price!  Canon has put together a profesional quality digital camera for under 1000 dollars and this includes a great lense!  Many of the complaints I have read about this camera are simply because the user doesn't know how to read his operating manuel.  Gary stated he wanted more flexibility with this camera and that it took out of focus indoor photos.  This is not true at all!  The Rebel was designe to be very flexible and very automatic.  It has a scroll bar that is at finger tip that allows you to adjust the apeture or shutter speed.  It is fully manual or fully automatic.  It allows you to swap lenses from other EOS cameras giving it even more flexability.  Indoor shots are great if you know how to use the 7 focus points in the viewfinder.  It is hard for me to shoot a bad shot.  The download time from the camera to computer is slow, but I solved this with a 10 dollar memory card reader from Best Buy.  It's great.  Plug the memory card into the reader and attach it to any Windows XP USB port and it transfers even the large photos at a much faster speed.  Then you don't have to worry about carrying around a cable.  If your looking at spending around $1000 on a camera this is the one you need.  Like all cameras you have to take time to get to know the camera, and understand some basic photographic principles.", "Date": "May 12, 2004"}, {"Title": "Great camera, especially for the price!", "Author": "A. McGuire", "ReviewID": "RFR7TA9E6D944", "Overall": "5.0", "Content": "This camera takes great pictures. I'm glad I didn't spend five times the money for a new one. I'm not a professional, just a mom who knows a moderate amount about photography and wants to stop paying portrait studio prices! Last time we went to have our pictures professionally done, they turned out so-so and cost us $90. At that rate this camera will pay for itself within a year or two. I have taken several pictures with this camera that look great. One picture of my boys I had blown up to 11x14 and it looks professional. I definitely recommend this camera!! You will have to buy a new battery though. The original battery lasted me about 10-15 pictures. I bought one for real cheap online and after 100 pictures it still shows a full charge.By the way, some older cameras like this one cannot handle a memory card (compact flash card) that has more than 2GB of memory. I am using a 4GB compact flash card with this camera and it works fine. It did not work with the Canon EOS D60.", "Date": "December 11, 2010"}, {"Title": "Super fast AF", "Author": "Joseph Fitzgerald \"JEF\"", "ReviewID": "R5G7OGHTJWUGY", "Overall": "5.0", "Content": "I upgraded from a G5 to the Drebel and am very happy. There is virtually no shutter lag as you would experience with a P&S; camera and I love having a manual zoom on the lens. The camera is actually easier to use than my G5. The only reservation I had was the size compared to the smaller P&S; and I am happy to say that after a week or so the larger size has not been problematic. In fact, it adds a good deal of shot stability when shooting at slower speeds. It is very nice to be able to change lenses for different situations. There is a great Dreb 300D forum site at D.P. preview.com where members posts pictures and give tips. Check out the quality of the photos taken by amateurs and judge for yourself.", "Date": "October 27, 2004"}, {"Title": "Software Included!", "Author": "J. Mims \"jmims9\"", "ReviewID": "R2BHXJWFKB7GGM", "Overall": "5.0", "Content": "Awesome camera. Works flawlessly with Mac OS X, iPhoto. Also has full version of Photoshop Elements 2.0 inlcuded. Well worth it...", "Date": "January 8, 2004"}, {"Title": "Great DSLR with few drawbacks", "Author": "John Abbey", "ReviewID": "R2S9DXGXQRF88N", "Overall": "4.0", "Content": "This is a great camera.  Before I purchased the Rebel, I had only used mid range point and shoot cameras, such as the PowerShot S410.  I didn't know what I was missing until I used this camera.My favorite thing about this camera is that you can quickly take shots with virtually no shutter lag.  You push the shutter, and almost instantly you have your image.I also love the ability to quickly and easily change lenses, as well add other accessories, such as external flash units.The only thing that I don't like about this camera is the plastic body.  Even though it is durable, I would prefer a metal body.  However, in order for Canon to sell this camera at such a low price, they had to choose plastic.  It is well made, nonetheless.The included lens in the kit also feels very cheap.  The included lens takes decent pictures, but I recommend that you upgrade.  It provides decent results for a $100 dollar lens, however.  You get what you pay for.Aside from those minor flaws, this is a great camera that produces life like photos.  I highly recommend this camera to anyone.", "Date": "January 10, 2005"}, {"Title": "Pro camera - not a snapshot camera", "Author": null, "ReviewID": "R2EB16WPLIDVE6", "Overall": "4.0", "Content": "This is a sophisticated camera despite being below $1000.  Ittakes photos that can be brillant colorwise and detailwise, but you have to work for them sometimes.  The AF can be a bit tricky. For quick shots, though, it's very useful.The AE has allowed me to take quick snaps of things I never thought would be properly exposed.  It seems to be able toexpose correctly so that the photos are a true depictionof conditions when the photo was taken.  And you can alwaysoverride the automatic settings for manual work.", "Date": "October 30, 2003"}, {"Title": "Great Camera for the Price", "Author": "V. Orlov", "ReviewID": "R2B9AGEY3EDZ9A", "Overall": "5.0", "Content": "If you are a photographer looking for a low priced SLR camera that takes quality pictures, this camera is for you. Its fast, easy to use, and an extremely long batterry life. I bought this camera 3 weeks ago and already shot about 500 pics with it. The quality is great!!! The best thing about the camera is the ability to take action shots. I had some of my friends jump and the camera was able to focus on them and shot pictures while they were in the air and the pictures came out great. Macro shots were perfect, with or with out the flash, I could not be happier, all the pictures were sharp and in focus. I wanted to edit some of the pictures I took with photoshop, but even the photoshop told me the pictures were perfect and did not need to be edited.There are a few problems with the camera and most of them can be solved with a few accessories. One of the biggest problems is pictures shot indoor are underexposed, the built in flash is not powerfull enough. But all I had to do was buy a flash (420EX works great) and the problem is solved. Second problem is that the camera is very selective as far as lenses. I have a Rebel2000 with a Sigma 200mm lens and the lens did not work with my new camera. (I kept getting ERR99 on the screen) So I guess I have to buy a new lens for it. Camera is also have a plastic body, but i guess for the price its ok. (If you want a metal body get Canon 20D and pay $500 more)Overall the camera has some minor problems with it, but for the price I am willing to live with it. (if want them fixed either buy Canon 20D or get some accessories) Personally changing from G5 to Rebel was great. This is my first digital SLR and I am very happy. Canon did a very good job with it.", "Date": "February 11, 2005"}, {"Title": "SLR Photography at its best", "Author": "B. Kirmish", "ReviewID": "R3CWN5VJG2644G", "Overall": "5.0", "Content": "I have been using this camera for just about a month now and all i have is good comments on the camera. Every time i use it i learn something new, and come out with more interesting photos each time. I have been into my digital photography since the start. (Started with a Casio w/ no removable memory, no flash, or zoom) In the past i have prefered the Sony cameras, i went from the casio to the digital mavica with a floppy disk, then the cyber shot. Both of whiuch took wonderful photos, but were limited in their manual modes. I had been skeptical to the digital slr, but i got to use one and loved the control that was available. The 18-55mm lens that comes with it is ok, but if you want to do more sophisticated photos, then i would recomend stepping up to at least a 28-135mm lens. The write speed is fast with the Sandisk Ultra II 512 mb card (about 2 seconds) But the camera has a small internal memory and will allow you to take up to 5 shots sequentially before it writes to the card.Overall very satisfied, and highly recommend", "Date": "January 9, 2005"}, {"Title": "Great Camera....High End Fun.", "Author": null, "ReviewID": "R1GDV76E3M64CV", "Overall": "4.0", "Content": "I purchased this camera about 6 months ago, it's a great camera and I haven't had 1 problem with it. I bought a few accessories..EX420 Flash, Canon 75-300 lens (there least expensive one, USM & IS wasn't an issue for me)lt's fast in auto focus. Purchased the battery grip also. Camera looks good, the grip helps with vert. shots and you have a slot for a second battery. Bought after market battery for $9.99 instead of $49.99 for OEM (look @ EBAY for batteries). If you purchase this camera you'll be very satisfied!", "Date": "July 11, 2004"}, {"Title": "Simply Amazing!", "Author": "Camikazee", "ReviewID": "R1O0WV5OOGXAP6", "Overall": "5.0", "Content": "The quality of the images of this camera its outstanding! Its a bit heavy but it doesnt matter at all, its absolutely worth it carrying it! You can get the 1GB Memory card and it can handle almost 300 images or so. I am trully amazed of the quality of the images this camera can take. Its a beauty.", "Date": "December 12, 2003"}, {"Title": "Great DSLR even in 2008!", "Author": "A. F. Butchart \"Consumer\"", "ReviewID": "R175OBX42EU9F9", "Overall": "4.0", "Content": "This camera has served me well in professional as well as hobbyist capacity. The ability to shoot in RAW format, shoot at a burst rate with no lag is awesome. Lens is same as Canon releases today on the XTi. I've used telephoto lens from Canon and it works great on this camera. I have noticed that compared to my friend's XTi, the DR requires more work from the user to get the same quality, specifically in full auto mode there is a difference. The small view finder and small metering display, as well as the flash are all a let down when comparing to newer DSLRs. But, if you find one of these it will be much cheaper and still very useful. I've used this camera to place images into large 11X17 and larger movie posters and the images look superb. If you have 300 bucks dont hesitate, this camera is one of the best deals for the money. And the lens will still work for you when you upgrade to a pro model.", "Date": "July 10, 2008"}, {"Title": "Great Camera and Great Price", "Author": "Paul Rooney \"Paul Rooney\"", "ReviewID": "ROFPIK1D5UKKO", "Overall": "5.0", "Content": "When looking at a camera like this, it can be unfair to compare it to a film SLR and say \"hey, for this much money I can get a great film SLR camera\". While that may be true, you will end up spending a considerable amount of money on film for a camera ($500+ per year easily if you take a lot of pictures), you won't know if a shot didn't come out correctly until you develop the film (a bit late for those once-in-a-lifetime moments), and there's no simple/free way of getting your film shots onto your computer to do touch-up or post processing work. So with a camera full of such great features like the Canon Digital Rebel, the ability to take more shots quicker, the ability to transfer images to your computer, and the ability to preview/review your shots  right when you take them, you're really in full control. The camera is expensive (at least it is for me), but it was well worth the price. This camera is relatively beginner friendly (with some help from Canon documentation), but its real strength is the ability to let users grow in their photography skills and provide the level of creative freedom to take some great shots at any level of experience.", "Date": "June 14, 2004"}, {"Title": "Best Buy", "Author": "Marcos K. Matsunaga \"Marcos\"", "ReviewID": "R2BM1NERH7MOSI", "Overall": "5.0", "Content": "I have just received my rebel (got it on Friday) and already took more than 800 pictures with it. I have been using Digital Cameras for 4 years and can't believe the difference from my previous ones. It is as if you were shooting with a film SLR, but being able to see the results faster. In fact I am enjoying this one a lot more than the film SLRs.About the plastic body, if you are not a professional journalistic photografer struggling in the crowd to find a good spot to take pictures and risking damaging it, you'll be happy that you are carrying a lighter camera.I recommend this camera for all amateur phtographers as you can take high quality pics in full auto and wonderful pics with manual or creative modes when you learn how to use them, as it is not rocket science. Once you learn how to manually set the parameters, I recommend getting better lenses. The kit lenses are perfect for beginners. the only con I see is the 1.6X factor that makes you lose some pics where you need wide angles. I hope they come with a solution for this problem in the future as zooming is good but sometimes we need wide angle as well.", "Date": "February 9, 2004"}, {"Title": "Excelent camera... with a microdrive!", "Author": "AGUSTIN IRIGOYEN SANCHEZ", "ReviewID": "RV3ETTZBIOEF0", "Overall": "5.0", "Content": "This is my third digital camera after an Olympus C5050 and a Canon G3, and with some editing limitations, this Canon EOS digital Rebel is the best.C5050 is richer in features like b&w pictures, sepia finish, two pics in one, different settings for flash, etc., but Canons goes further in aspects like writing speed. I can shoot 10 continuous pictures using the same Micro drive card with the Canon EOS Digital, and none of my other cameras could do that.Also the exchangeable lenses are excellent!, no more 3X and 4X limitations!. I got a 70-300 mm ultrasonic zoom lens at retailer in San Antonio Texas for only 234 dollars.Battery life is more than good, the best on the three cameras I have.CONS: Weight and volume. Yes, forget about the light camera for your day walk at the park for shooting the mountains or anything you can get on the way, this canon is bulkier and heavier, so we're traveling with at least two cameras, the canon and one of the smaller.Buy a Micro drive card and get no less than 240 pictures on the highest resolution per card.I'm positive on this purchase and hope with this my cravings for mega pixels will rest for at least 1.5 to 2 years", "Date": "January 14, 2004"}, {"Title": "LOVE, LOVE, LOVE  this camera", "Author": "Mrs. Goodie", "ReviewID": "R3M95JNJRAD1NG", "Overall": "5.0", "Content": "I have had this camera a little over a year and I still can't put it down. It is wonderful. I have two little boys on the move and this camera takes their picture with hardly any delay. Just snap and go. I bought my dad the XP in March and he loves it too.", "Date": "April 11, 2006"}, {"Title": "Amazing Digital Camera", "Author": "Lesa Browning \"writer/mother\"", "ReviewID": "R27NWSTQKXTE3Q", "Overall": "5.0", "Content": "Being a long time loyal Canan userI was happily on my third Canon digital point and shoot camera when my dear husband presented me with this Canon Digital Rebel for Christmas. I am absolutely in love with this camera.  I have not picked up my old SLR film camera once since discovering that I can do so much more with this Canon.  Perfect for the amateur photographer or mom and the kids, this camera allows the freedom to choose how much automation you want.  Takes fabulous pictures and a snap to use. This really is the best of both worlds.", "Date": "February 26, 2005"}, {"Title": "Excellent", "Author": "Khz2 \"Kevin\"", "ReviewID": "R1YN0U59UOO63C", "Overall": "5.0", "Content": "Highly recommend this camera.  The Sony DSC828 inspired me to take a fresh look at digicams.  I'm glad I didn't wait for it to become available.  What makes the quality of the D100 shots so much better than digicams?  I believe the #1 reason is the size of the sensor (the digital \"film\").  For example, the sensor in the Digital Rebel is 22.7mm by 15.1 mm.  The sensor in the up and coming Sony is only 8.8mm by 6.6mm.  That means that they have to pack all of the sensors in that much smaller of an area.  The result of the much smaller sensors is noise- random colored dots in darker areas of the picture.I've owned the camera for two weeks and on top of the nice lens that comes with it I purchased the Sigma 70-300mm F4-5.6 Macro Super II lens (Sigma # 507101).  This is one heck of a combination and I am so happy I've spent the extra money for this camera and lens.My wife even loves the pictures.  She suggested we skip going to that portrait studio at the mall for Christmas cards this year and do it ourselves.  Taking the $60 out of those people's hands was worth the purchase price alone! :)Some people claim the plastic body feels cheap.  I think it does feel plastic, but does not feel cheap.  I've never owned a metal bodied camera so I guess I can't claim I like one or the other better.  But the body is certainly light.If I had one negative, I don't much care for the built in flash.  It tends to be on the dark side and cause red-eye since it's too close to the lens.  I bought a cheap Vivitar 2000 flash from wal-mart for $20 and I have to say it does a very good job.  In the future I'll get a canon TTL flash.", "Date": "November 11, 2003"}, {"Title": "Absolutely Amazing!", "Author": "John Connick", "ReviewID": "R2ITWQVGVEFRWH", "Overall": "5.0", "Content": "I've owned 3 previous digital camera's, all of them EVF \"Electronic View Finder\" models.  My previous camera, a Nikon 5000 took admirable pictures, but nothing and I mean nothing compared to what this little baby puts out!The autofocus is superb, the 4 frame image buffer really comes in handy when taking those quick action shots, plus you just can't beat the feel of a SLR.Printing from an old HP 952C an 8x10 shot comes out looking exactly like a studio portrait.  You already know all the reasons to pic this up, sub $1000 price range, compatible with all of your EF lenses, the sheer joy of taking great photos.  Pick this little baby up, you will not be disappointed with this camera.", "Date": "June 19, 2004"}, {"Title": "Digital SLR at a consumer price", "Author": "R. L. Lewis", "ReviewID": "R3CXLGTGM1XWY7", "Overall": "5.0", "Content": "Bottom line: THIS IS A GREAT CAMERA. It is a 6.3 megapixel CMOS digital single lens reflex. Canon's Rebel line of affordable SLRs is well known and very popular. This is an extension of that line. The camera is available with a new EF-S 18-55 zoom lens and also accepts any of the dozens of Canon EF lenses. It also accepts nearly all Canon EOS accessories, so the Digital Rebel can grow with your skills and become as versatile as you would like. As with Canon's higher end Powershot digitals, you can let the camera choose all the settings or you can make some or all of those adjustments yourselves. The Digital Rebel does not allow the fullest measure of creative freedom available in more expensive digital SLR's, but it doesn't need to. This camera is aimed at digital camera owners wanting the flexibility of an SLR and consumer level SLR owners wanting to move to digital. The camera is well made, light weight and well equipped with a battery and battery charger (Canon's great BP-511 lithium ion, which should last for hundreds of shots), neck strap, eyecup, lens and body caps, driver software and a full version of Adobe's Photoshop Elements 2.0.", "Date": "September 22, 2003"}, {"Title": "Amazing!", "Author": null, "ReviewID": "R1ZY5HL5ONX9F2", "Overall": "5.0", "Content": "I have been a longtime Canon SLR user.  When this camera came out I decided to make the shift to digital.  Have been using the Rebel for two months now and am more impressed with it every time I use it.  I can only echo all the praise that the other reviewers are heaping on this amazing camera.  I find myself looking for opportunities to take pictures... the instant gratification is fantastic and puts big-time fun into picture taking.  I have always preferred shooting in manual and this camera gives me the feedback to be confident in what I am doing.  I can't believe some of the pictures that I am taking!  The results have been nothing short of amazing! I have been stopped on the street three times by people asking me about the camera and specifically about its durability.  Several of the other reviews have raised the same issue.  It was also my concern prior to buying it.  But I am sold on it now.  The second day I had the camera I stopped at the grocery store after being out in the field shooting. I slid the camera into my holster bag and put it in the trunk.  When I returned, I grabbed the holster out of the trunk, forgetting that in my haste I had not zipped it shut.  You can only imagine my reaction as I watched my brand new camera literally bouncing end over end down the parking lot macadam (luckily it bounced over the lens).  I held my breath, turned it on and took a few shots.  I still can't believe it worked.  And despite a few dings in the plastic, the camera has performed flawlessly since.  Forget about the durability concerns.  Buy this camera!  You will not regret it!", "Date": "February 2, 2004"}, {"Title": "best camera yet", "Author": "Jeffery Jordan", "ReviewID": "R1V4YP904YFSXE", "Overall": "5.0", "Content": "I have had 5 digital point and shoot cameras all a little bigger and better than the last. This is my first SLR and I am not in the least disappointed. This camera meets or exceeded everything I expected from it. Very easy to learn, read the manual and use the web site tuturial and when the battery is charged your ready to go take pictures. I highly recommend this camera.", "Date": "June 15, 2005"}, {"Title": "Great Value - Excellent rebates", "Author": "G. Taylor", "ReviewID": "R3EZWD3SYHSK5F", "Overall": "4.0", "Content": "As most reviews say, this is a great digital SLR. The 420EX flash makes a huge difference in photo quality. With the 28-135 and the 420ex flash unit the camera is very heavy and I cannot see lugging it to Disney, you would want a smalller digital camera for that.[...]", "Date": "December 22, 2004"}, {"Title": "Photos as good as my 35mm Rebel!", "Author": "Tera Leigh \"Author & Professional Photographer\"", "ReviewID": "R57G0CBHZ1EGV", "Overall": "5.0", "Content": "We chose this camera due to the price point at 6.3 megapixel, and because we owned the 35mm Rebel - and love it. The 35mm lenses can be used on the digital, making the two a powerful combination. What I didn't expect is the incredible quality of the photos. I had a Sony 3.3 megapixel digital prior to this -so the jump in quality is substantial. However, comparing prints side by side from the digital (with my HP Photosmart 230 printer) and prints from my 35mm developed by a lab - the quality is substantially similar. I thought it would be a while before I could afford a digital camera with sufficient clarity to replace my 35 mm for most uses. This camera is changing my mind. The flexibility of digital (print only what you like, for example) and the quality of the images, makes this camera an excellent value for the price!", "Date": "September 26, 2003"}, {"Title": "As all the others say, YOU WILL BE HAPPY WITH IT", "Author": "Dr. Szenes Andrea \"happyqueeni\"", "ReviewID": "RVWLCHT86TH0A", "Overall": "5.0", "Content": "well , i did not want to buy a digital SLR since ia m not a professional photoghrapher and use only automatic modes . Some sellers were pushing me towards the REBEL and i let them win. Adn i have it for 5 moths and i am very happy with it .This is fast , and all the pics are simply good with it . I have Canon G5 and some othere cameras but whenever i take photos i take only this . Since i have it , i only use this one.Not small but it worth it .I can catch the moments . I like to shoot faces , and i shoot when i shoot. No more closed eyes .ANd to be honest i was hesitating to get an 8MP point and shoot digital , but i am more happy with this . I got an eytra longer lense to it with image stablizator and that is even more fun. I feel like i am professional photographer , though i am not .I think if you wanna spend this much money this is the best choice. THough i also like my Vanon Powershot G5.", "Date": "December 10, 2004"}, {"Title": "Upgrade your old Canon SLR", "Author": "Steve E Drake", "ReviewID": "R1D8PXUHYC26TP", "Overall": "4.0", "Content": "My dilemma: I bought a T3i for vacation, but my son will try to lay claim to it.  My solution was to buy this body (with battery and charger) and use my existing lenses from my old film SLR.  The old EF lenses are compatible with this camera!  I really like it as well, but it's quite the upgrade from my old SLR and the string of point-and-shoots I've had since then.Pros:Super cheap for a DSLRIt takes better pics at 6.3MP than my 12MP point-and-shoot that cost me 3x more.It's a DSLR... it is very configurable.Cons:It's old technology -- 6.3MPThe LCD doesn't display the pic until you've taken it, meaning I have nose grease all over the back.It uses CompactFlash memory -- typical for its era.Would like it to have the option to take a string of 3-5 pics via timer.If you're considering using older SLR accessories, here are some pointers:Old EF lenses are compatible, though it is designed for use with the newer EF-S lenses.EF lenses increase the effective zoom by about 1.6x.  That means my old 80-200mm lens turns out to be 128-320mm!!!  It also means my old 35-80 lens is 55-128mm, meaning I'm always zoomed in some.  To do macro shots, get a 18-55mm EF-S lens.EF lenses don't have image stabilization.  That's a sweet feature, especially when zoomed in to 320mm. Consider a tripod when zooming in closeMy old external flash was not compatible. Some are supposed to be compatible but mine was an \"EZ\" model that wasn't.  Your mileage may vary.", "Date": "June 11, 2013"}, {"Title": "Great Value!", "Author": "Buster Brown", "ReviewID": "RYHUPHS4LDBEC", "Overall": "5.0", "Content": "Bought this used camera for my son because he's taking up photography class and it's been used quiet a bit. It's an older model, but has gave him the experience he needed to become a great photographer! He's now good enough to sell this one and get a newer model -", "Date": "March 4, 2013"}, {"Title": "Exactly as described.", "Author": "Sandi Arnold", "ReviewID": "RJUKJ9EEPEX1H", "Overall": "5.0", "Content": "I bought this not real sure of what I would get since it was used. But I figured I would take a chance. Im glad I did. It does have some signs of wear but that was stated when I bought it. It works wonderfully and takes excellent pictures with excellent quality! Good, easy, camera for beginners.", "Date": "December 18, 2012"}, {"Title": "Happy with new camera", "Author": "tedi doychi", "ReviewID": "R6WNJ2QGNZ59M", "Overall": "5.0", "Content": "Seller knew how excited I was to have camera and made sure to delivery in a speedy transaction. I've used the camera a couple times now , so far so good.", "Date": "May 7, 2011"}, {"Title": "Great except a few occasions", "Author": "C. Chan", "ReviewID": "R1N85V6R7STX2B", "Overall": "4.0", "Content": "I purchased this camera January 2005, my first digital SLR.  This camera works great most of the time, does everything it is suppose to for the price I paid for.  The few times it didn't work is in focusing.  Even though I know the camera is in focus, but the Digital Rebel just wouldn't take the photo kept zooming in and out of focus.  So I either 1) switch to manual mode or 2) turn the camera off and turn it back on again.  Either way, then it would immediately work like the camera it is suppose to.  The battery does drain quite a bit if you leave it on or on a cold day.  I shot a lot in darker, high speed sports related events.  And this camera has performed pretty well considering it is a beginner digital SLR.", "Date": "January 12, 2008"}, {"Title": "Great Camera! Especially for those starting with Digital SLR", "Author": null, "ReviewID": "RA8HMU90QVP82", "Overall": "5.0", "Content": "I purchased this camera back in april from amazon. So far, i love it.  It takes extremely clear pictures and most of the time i don't even have to edit the levels or contrast in Photoshop.  I am very satisfied with this camera!! I have a Sandisk 256mb Compact Flash card w/ it. It is a bit slow when veiwing the pictures, but it works just fine when shooting.  I did order a 512 Ultra II Sandisk card back in april (from amazon,) but i recently had to cancel the order because it said i wasn't going to recieve it until July. I bought the 256 to hold me over until i recieved the 512 but i guess i have to look somewhere else for a 512 now, since i won't be getting one from amazon.  I highly recommened this camera, and a 256mb Flash Card works great (i think i get a little over 80 pics in reg mode,) but i am still planning on purchasing a 512, but not from amazon.  That is my only negative advice, don't purchase your flash card from here, because they kept delying the delivery date until i finally had to cancel. Originally it said the item was in stock and then it said it wasn't, etc. It was just a pain. Otherwise, i don't think you will be dissapointed with this camera, especially if  don't have much experience like myself!", "Date": "June 14, 2004"}, {"Title": "What a Camera !!!", "Author": "Dyann Corrao", "ReviewID": "RM9AADGGQGHLK", "Overall": "5.0", "Content": "I own 4 other digital cameras and was so excited to hear about this model because we owned the 35mm Rebel and absolutely loved it. I was certainly NOT disappointed. The Rebel does everything for the serious (and not so technical) photographer. The color and clarity are outstanding (the autofocus is so fast and awesome). Just about every effect can be created with this camera and buying a telephoto lens just adds to the excitement. All features are easy to use and the \"full auto\" mode can make a 5 year old take excellent pictures, because of the fast autofocus.", "Date": "December 26, 2003"}, {"Title": "A great DigiCam at a great price.", "Author": "Stephen P. Weaver \"clerkman\"", "ReviewID": "R1RLRXTQSKV81X", "Overall": "5.0", "Content": "I immediately put my Rebel through it's paces when I got it. I have to say, it's a dang good camera that takes dang good pictures. I work for a newspaper and submit photos to other papers, so I take alot of images. I have been surprised at the clarity and quality of the images I get out of this camera. I was photographing a swimmer today, which takes a certain amount of quickness to get a good image. I was blown away by a couple of the images I got. The autofocus hunts a bit sometimes, but you can turn it to manual so no problem. The exposure control is the only thing I would recommend they work on, even though I haven't had a problem with it. The EFS lens you get with the camera is not to shabby. I paired mine up with 420ex flash with a wireless transmitter and the vertical battery grip for more shooting time. The transmitter worked well for spooky shots at Halloween. I also recommend at least a couple 256mb flash cards. They will hold around 130 large normal images, which is decent. Anyhow I highly recommend this camera. I love shooting with it. It's a great main or backup camera.", "Date": "November 13, 2003"}, {"Title": "Awesome camera!", "Author": "Lisa D", "ReviewID": "RPO2MVA6ATEDU", "Overall": "5.0", "Content": "I've had this camera for a little over a month now.  It is my third digital (following a Fuji FinePix 1400 and the FinePix S602Z - which I still take along for size and the super macro abilities) and my 3rd Canon (having started with an AE-1 and then the EOS A2).  Having a nice arsenal of EOS lenses, the introduction of this camera made this purchase a no-brainer.  I love, love, love it!  Do spend the extra $ and get the SanDisk Ultra II 512 Mb memory card.  Once you use this speedy memory, there will be no going back!", "Date": "November 1, 2003"}, {"Title": "Underexposure Problem", "Author": null, "ReviewID": "R1YOAFF32BTGRJ", "Overall": "2.0", "Content": "I owned the original D30 prior to this camera and wanted to upgrade so I could keep my lenses.  While the Digital Rebel has much faster auto focus and a better pixel count, it has a significant underexposure problem.  I've taken about 1000 shots so far and the majority are underexposed, especially those taken indoors with ambient light and even many taken with flash.  On some lenses, such as the 28-135 IS USM lens, it underexposes at maximum zoom while indoors - even with the exposure compensation control at the highest level!  Too bad - otherwise a terrific SLR, but I wouldn't use it for any important shots.  I expected more from this camera given the experience Canon has with digital SLRs.  My small S400 does better! Hopefully Canon fixes this issue, but until then I'm looking elsewhere for a digital SLR.", "Date": "November 22, 2003"}, {"Title": "Amazing Pictures, Amazing Value", "Author": "Michael J. Palmer", "ReviewID": "R1CXVMPB3K70WW", "Overall": "5.0", "Content": "Been into photography since I was 14 years old. Went from film SLR to digital P&S 4 years ago, have owned two casio digital cameras (1997-1999) and a prosumer Kodak DC4800. I finally decided to jump into the DSLR market and did a months worth of reading reviews and comments. Finally bought one and I love it. Amazing Picture, great features, and definately more affordable than the higher up models (10D and 1D).Worth every penny.", "Date": "October 9, 2003"}, {"Title": "Da Bomb", "Author": "Don Eriquez", "ReviewID": "R372GABUXYEHBG", "Overall": "5.0", "Content": "I've had my digital rebel for 2 weeks I can't put it down!!I love this camera, this is my first canon, right out of box I was takin great shots. You'll need the BG-E1 batterygrip (1000 shots no flash) . This is my forth digital camerathis year, I think I got A keeper........", "Date": "October 15, 2003"}, {"Title": "Anything Less than 5 stars and You Must be a Professional  Photographer, Serious Camera Geek or you got a Lemon.", "Author": "Denise Bell", "ReviewID": "R3BN87RW0JM8E0", "Overall": "5.0", "Content": "I am a hard core Technology Driven kind of guy.  I am the type who people come to for technical answers, Computers, Laptops, Printers, and even Digital Cameras.  My first exposure (no pun intended) with this camera happened when my estranged father came back in to my life, and to overcompensate for being out of my life for many many years, he gave me this digital camera.  After saying no for too many times, and I felt that I began to offend him, I took the camera.  Let me sum this camera up in three little letters..... WOW! I can not believe how easy this camera is to operate.  This camera will do two things for you.  #1 it will draw you into the hobby of photography, and #2 it will make you feel like you missed your calling, and that you should have been a professional photographer.  You will most likely find yourself entering photo contests!  I have been blown away at the photos I have taken.  I think to myself... \"Did I really take that photo?\"  If you get the camera, make sure to get two batteries and multiple memory cards you will need them as you will find yourself taking so many pictures with this camera.  I have used so many digital cameras, bit the bullet and get this one!", "Date": "October 8, 2007"}, {"Title": "great camera at an awesome price", "Author": "KELLYb \"READforFUN\"", "ReviewID": "R1AG1DUOSR3HFA", "Overall": "5.0", "Content": "its not the most advanced digital out there but  it gets the job done and economically to boot -count me satisfied", "Date": "January 23, 2014"}, {"Title": "Great quality for such a great price!", "Author": "Shawn", "ReviewID": "R2U9R4LQIN9D8T", "Overall": "5.0", "Content": "I ended up purchasing this camera for about $55, was the best deal I have ever made. Had a little wear n' Tear, but that doesn't stop my satisfaction with the quality of my images!I recommend this to someone who is wanting to get into photography, because I know this camera has already done that for me!I love Canon and look forward in using their camera products throughout the years!", "Date": "December 19, 2013"}, {"Title": "Awesome Camera", "Author": "Shannon Chastain", "ReviewID": "R1KR4NYEYND5NB", "Overall": "5.0", "Content": "We got a lot to learn but so far we love this camera, it takes great pictures we are looking forward to summer camping trips", "Date": "December 13, 2013"}, {"Title": "DSLR great starter camera if you can't afford a Better one!", "Author": "William Hartsock", "ReviewID": "R3ANI5YR9FGNDH", "Overall": "4.0", "Content": "Replaced one I had. I have since upgraded to a 5D MKIII. This was a great camera and still is I use it in foul weather and such. I want to keep my 5D working in tip top shape as long as I can!", "Date": "November 20, 2013"}, {"Title": "Good camera", "Author": "aida", "ReviewID": "R1Q7C8LNMP0IAH", "Overall": "3.0", "Content": "The camera was very good for the price I payed, the pictures have a very good quality and this camera is very easy to use if you know a few things of this type of cameras. It is a little bit heavy, though, compare with the new ones, but its is because it has its years. The only thing that I did not like is that the three batteries don't last very long, and although it came with a lot of memory cards, the room in them is very limited, so it is better to buy one with a lot more GB.", "Date": "September 16, 2013"}, {"Title": "Canon EOS 6.3MP Camera Body", "Author": "Richard S. Sobieski", "ReviewID": "R37TN5TOQHY447", "Overall": "5.0", "Content": "The camera arrived in its original box, and its condition was like new. Very pleased with that. I bought it for my grandson who is just starting  the hobby. A very good \"starter\" camera that will take a long time to ourgrow.", "Date": "March 16, 2013"}, {"Title": "First mint condition Rebel EOS Digital 300D foundation to an excellent series of cameras exceeding other Japan manufacturers.", "Author": "Kevin Michael Callihan Sr Esq [Retired/Disabl...", "ReviewID": "R2SDGEZK7F6JKR", "Overall": "5.0", "Content": "I simply wish to say that being a Sony owner while not being professional, I have been a follower of all MAVICA series cameras and when a dear friend, who is a professional photographer, asked me to try the first in the Rebel series, I was reluctant.  Now, I love the fact that his suggestion has played out for the best for me and my goals of becoming a professional photographer while trying different manufacturers and models within a reasonable price range.  You get them all when you participate with Canon with emphasis on their superior \"Camera Museum\" and the top drawer service in America for Canon being in Virginia with the very best in technical support and questions of all ten Rebel Canons that I am collecting.  Thank you for allowing a nonprofessional photography who is indeed a passionate enthusiast at this time be on the right track with Canon Rebel digital cameras.", "Date": "March 2, 2013"}, {"Title": "Good Deal", "Author": "Robert Galindo", "ReviewID": "R1QKL81M1AA54N", "Overall": "4.0", "Content": "Seller is awesome, Camera is a little heavy but durable, great starter for a youngster. My daughter loves it, she is able to use my telephoto lens in her camera. She is still learning how to use all the functions and settings but in time she will move to a more advanced model.Seller was very helpful and product was exactly what was described.", "Date": "November 23, 2012"}, {"Title": "So In Love", "Author": "nikkicolericecakes", "ReviewID": "R31K66XPFVL8NS", "Overall": "5.0", "Content": "I'm so in love with this camera I would not trade it for the world. I would recommend this camera to everyone and its so great I do not even want to go back to a small digital camera.", "Date": "October 16, 2012"}, {"Title": "In 2013, buy something else", "Author": "D. Alexander", "ReviewID": "R2V4064ZN3R0BW", "Overall": "2.0", "Content": "Don't buy this camera. If your budget is limited, buy a point-and-shoot. The modern ones have nearly the same high-ISO performance. Or save for a 20D or better.Reasons to buy this camera:* It's cheap. $100 used.* It has fine image quality from ISO 100 to ISO 400, capable of prints up to 15\"x20\"* It's an EOS DSLR, so you can use Canon's lenses and accessories* It has a good gripReasons not to buy this camera:* Vastly superior cameras (e.g., 20D) are available for not much more* Automatic AF point selection is slow and doesn't work in low light* Automatic flash exposure is terrible* The screen is small, low-resolution, and not color accurate* The interface is antiquated and difficult to navigate* It's missing a lot of useful features like mirror lockup* It's a godawful slow body for continuous shooting or for raw* It has a lot of shutter lag* It's not capable of motion tracking with any consistency* It's slow in general for picture review, card formatting, and so on* It's not water resistant in any way; repair costs for water damage are over $200* The kit lens is garbage below f/8The only reason I'd buy this body would be to digitize slides, or for some other project that didn't require actually using it as a camera.", "Date": "September 27, 2012"}, {"Title": "Excellent Product", "Author": "Brittany", "ReviewID": "R1JK87GN8QTMJL", "Overall": "5.0", "Content": "I was very impressed with this camera. It seems to basically be brand new. It works great and I received it very quickly. I'm still excited about it.", "Date": "November 5, 2010"}, {"Title": "Very Happy", "Author": "Erica", "ReviewID": "R1MDOTYN5AETE7", "Overall": "5.0", "Content": "This product came very quickly and in very good condition. It works well and the sender even included an extra battery and battery charger!", "Date": "September 10, 2010"}, {"Title": "Great Camra!", "Author": "KingsHeart", "ReviewID": "R2A530J75DX177", "Overall": "4.0", "Content": "For a simi-pro camra this is the best I have came across.  Good photos, symple to use and good over all except battery life when taking mass emounts of photos, but that is why I have an extra one.If you can't afford the newest version this one is a good choice!", "Date": "June 25, 2010"}, {"Title": "Great starter camera", "Author": "Brian Clifton", "ReviewID": "R3N1CXQPGXV3JS", "Overall": "5.0", "Content": "I'm a photography novice and this is my first SLR.  It's been a great camera since I bought it 2 years ago; very easy to use and very powerful.  I can't see wanting a better camera when you're starting out like I am.  There are many better cameras but I can't justify the cost with how little I know about photography.The software isn't great but it does the job.  The only thing that's bad about the camera is that it makes you want to go out and start spending too much money on lenses and other equipment.  I'd say photography is a pretty healthy hobby though.. who doesn't want to go out and take great sunset pictures?", "Date": "August 26, 2007"}, {"Title": "Superb Picture Quality", "Author": "Steve \"Steve\"", "ReviewID": "R12LL0YQG59IFN", "Overall": "5.0", "Content": "This camera contines to amaze me with its crytal clear photos - even when enlarged to 8 X 10.", "Date": "March 17, 2005"}, {"Title": "Awesome Camera!", "Author": "rwduenke \"rwduenke\"", "ReviewID": "R164YEW3AA2DOQ", "Overall": "5.0", "Content": "I have been shooting with a Nikon F100 for a couple of years and  have always owned Nikon equipment.  So far I have shot about 700 pictures with the Digital Rebel and I am loving this camera!  I am using the $100.00 lens and the pop-up flash so far.  I have been printing to a Canon 9000 printer and people are flipping over the quality of my pictures.  On an 8 x 10 glossy, I can see the tiny hairs on my 3 month old little girls face and her blue eyes jump off the print!  I went back to the camera store where I bought the camera and shot several indoor test shots with my standard $100.00 zoom lens and the new $800.00 Canon 17-40mm Zoom Lens.  I was pretty darn surprised by the quality of the \"cheapy\" lens.  The pictures were Very, Very similar.  About the only place I could see any difference was black type on a white backgroud or white type on a black background.  In these situations, the standand lens had slight glowing edges and was not quite as sharp as the expensive lens.  For me and most people, I cannot see where the $800.00 lens is really worth it unless your loaded with money.  The $100.00 lens really is quite good.  I have not had quite as good exposer with the pop-up as I did with my SB-28 on my Nikon, but that is really apples and oranges.  I would like some input from users that wave used a larger Canon Flash on the hot shoe.  The battery life on this camera is AWESOME!  Overall, I am very happy.", "Date": "November 26, 2003"}, {"Title": "Yup,...one more good review.", "Author": "L.Sea \"Elsee\"", "ReviewID": "RDH9N94YZ2192", "Overall": "5.0", "Content": "I haven't owned a camera since 1989 or 99.  And it was a polaroid.Hey... don't smirk.... it took instant pictures of.... \"what-ever\".One day, I loaned it to a friend. (big mistake!)Her \"spoiled brat\" kids broke it....and she never offered to replaced it.(yea... I need more crappy friends like this in my life ).The next day, as I was driving to a wedding... I stopped at a Store 24and bought a disposible camera. Somehow....purchasing disposale camera's for special events became the \"norm\" for me.(But, I still missed my Polaroid's instant gratification).When I got married in 91, my husband brought his huge, heavy, Canon T70 SLR.I was terrified to use it.I thought for sure I would break it .... (just like my girlfriends rotten kids broke my camera).When my new hubby saw my apprehension... he shrugged and said to me......\"just point and shoot\".So, I did.I was amazed at the clarity of the lens and how easy it was to focus. (i was instantly hooked).I ran around the house and yard... and shot the entire roll of film.When we got the film back (about a week later), I saw that I had taken several really lousy shots....but 70% of the pictures (I took) came out really good!!!!  I was very impressed by the picture clarity and colors of an SLR.(But, I still missed the instant gratification of my old polaroid).Two years later....My husband and I became \"Master Gardeners\".(Some people call us...Tree hugging, bug kissing, nuts).I heard about a contest that \"Ortho\" and \"WalMart\" were sponsoring.It was called :  \"THE BEST GARDEN IN AMERICA\".I grabed my husbands Canon SLR (film) camera and his camera books .and I studied them. Then I took about  200 pictures of our garden.And after a couple of days, I picked up the pictures..... choose the best picture and entered it in the contest.A lot of work....but it paid off.Yup!.... We won best garden in the North East!!!Since then, my husband and I have taken about a trillion pictures of our garden.10% are awful !!!, 20% are lousy!! .... 30% good!....and  40% fantastic!This January I sat down and looked at all our garden pictures.I always do  this in the dead of  winter .....cause the beauty of the flowers always makes me smile. But this winter.....I didn't smile! All I thought about was:...\"Wow, I probably spent well over a thousand dollars in developing fee's for all the yucky pictures!\"I have a dual G5, over 10,000.00 in software and hardware ....and I just bought (in my opinion) One of the best small buisness printers anyone can own. (It's the Canon I9900 printer).Then I asked myself....\"Why don't I own a digital camera\"?!?!After (literally) weeks of research on the web and reading consumer reports and going to large camera stores to ask a million questions......I finally decided on the Canon Rebel.All I can say is.....WOW !!!!!!!!This camera combined with this printer ..... is nothing less than amazing!(Not to mention the instant gratification I felt, after seeing pictures instantly appearing on the LCD screen)I am astonished that a complete novice (me) can put this camera in AF mode and take 95% Fantastic pictures!And it's great that I can simply delete lousy pictures.I can't wait to read about how to use \"manual focus\"!I bet my pictures will blow the cardboard off my album covers!I Hope this (long winded) review helps all you other novice people out there.[...]", "Date": "February 12, 2005"}, {"Title": "Good quality, easy to use, decent features", "Author": "Nicolas S. Martin", "ReviewID": "ROIE003KDZT4F", "Overall": "4.0", "Content": "I'm enjoying this camera. It certainly offers great value for the dollar. It probably offers the right number of features and full user controllability. I've never used a camera in which ISO and exposure are so easily and quickly modified for each shot.Considerably smaller cameras do have larger LCD displays, though you don't need the LCD to view your subject. I wonder why, since many camcorders offer a \"night shot\" option, Canon could not also include that on this camera. I also miss the high speed connection that is standard on many camcorders. (Firewire, and now new Firewire 800, are faster than USB 1/2.) I recommend buying one of Canon's better accessory flash units.You can purchase many Canon EF lenses very inexpensively that work fine with this camera, especially the telephotos since they don't suffer from the edge clarity drop off that older lenses can produce on digital cameras. Perhaps it is better to wait for the newer wide angles. The lens that comes with the Rebel is fine.For years Consumers Reports has surveyed readers and found that Canon camcorders are among the worst in reliability. Since technology has moved both cameras and camcorders to digital, one hopes that the same problem doesn't afflict Canon cameras like this one.", "Date": "November 13, 2003"}, {"Title": "Behooves Me", "Author": null, "ReviewID": "R3BLNATFL9AJD6", "Overall": "5.0", "Content": "I got this amazing camera for my husband.  I have yet to touch it or take a picture with it- maybe in a couple of months I will be able to see it.  But what I can say is, these are the most amazing pictures I have ever seen!  We have had many digital cameras, all around $300- what a waste of money.  I didn't want to spend this much money, but when I first saw the pictures of my kids it was just incredible picture quality.  I do not know anything about cameras, but I do know when my kids look good.  And we printed the pics out from an inkjet and they looked fabulous- I couldn't believe it.  It is a lot of money but it is better than buying a new digital camera each year and getting memory, etc.  A super camera- we also have the rebel camera and the lens works with the rebel digital.", "Date": "November 2, 2003"}, {"Title": "Unimaginably Good", "Author": "Aaron G. Peabody \"careful shopper\"", "ReviewID": "R31R787ELXLPTP", "Overall": "5.0", "Content": "This is an amazing camera.  The quality of the pictures and the performance cannot be beat at this price or even for hundreds of dollars more.  Other reviewers have gone to great length describing the many features and benefits of this camera, so I won't do so here.  I just want to add my voice to the many saying that you *must* consider this camera if you are a serious, digital photographer.", "Date": "May 27, 2004"}, {"Title": "The Best Camera Out There!!!", "Author": "Mario S. Jimenez Jr.", "ReviewID": "R8ZARZ9HMYKBX", "Overall": "5.0", "Content": "I really don't understand the negative reviews that this camera is getting. I think some people need to read the instruction manual before using it. This camera is the best investment I have ever made. It takes beautiful indoor/outdoor shots. The settings are easy to use so you can take any picture with accuracy and awsome results. The lenses that Canon has to offer are the best. Wether your an ametuer or pro, this camera has everything you need. I must point out that if your a beginner, play around with all the different settings to get use to the feel of it. I am confident that everyone will enjoy this camera, and the many things that it can do whatever the situation.(...)", "Date": "March 23, 2004"}, {"Title": "Canon EOS 300D Digital Rebel", "Author": "M. Amagna \"Suzie_Place\"", "ReviewID": "R2KSSTGSDV2YJI", "Overall": "5.0", "Content": "Godfathers of La PunkThe Canon EOS 300D Digital Rebel is low-priced and easy to use.  Within moments after turning it on I was taking fantastic photos.  The flash is strong.  The image is what you'd expect from an SLR (see photos).  One of the best deals out there.", "Date": "February 3, 2009"}, {"Title": "A real Camera", "Author": "Andrew B. Thompson", "ReviewID": "R3IPT433BMKJX4", "Overall": "5.0", "Content": "After owning 6 different digital cameras including the Sony F717It seems that this finally takes the place of my existing Eos 35mm.Very impressive.", "Date": "June 10, 2004"}, {"Title": "Best bang for the buck - all purpose and Astrophotography", "Author": "Max Leiva", "ReviewID": "R1S013FXM9X53T", "Overall": "5.0", "Content": "I did quite some extensive research before commiting to the Digital Rebel. I wanted a digital SLR mostly for family photos but also for Astrophotography. I signed in a lot of forums were this camera was the most recommended in digital astrophotography (non-CCD) as well as the best cost-benefit as all purpose camera.I have intentions to modify this camera to take best advantage in astrophography. This means that I will carefully remove the included IR-filter in order to get better astrophotos. This means I won't be able to take terrestrial (all purpose) pictures as the photos will result redish looking without the IR-filter. As a consequence, I will probably get the Digital Rebel XT for family pictures.", "Date": "April 25, 2005"}, {"Title": "Outstanding", "Author": null, "ReviewID": "R3MYAOYR9BHJL", "Overall": "5.0", "Content": "This is just a great camera. Excellent features and picture quality. The battery life is good. The 18-55 mm lens is light weight and very good. For the price this is the best digital SLR deal around. I have used the camea for over two months and my experience has been nothing but great. Make sure to get a large memory card to be able to fully utilize the camera's high resolution options.For a telephoto lens I would recommend the new Canon 55-200 mm lens made specifically for this camera. It is lightweight, only 10+ oz., compact and fast. I am diappointed it is not yet offered by Amazon", "Date": "December 30, 2003"}, {"Title": "Budget Digital SLR Makes BIG Impact!", "Author": "Jeffrey Brown", "ReviewID": "R18YSNEC15WDXV", "Overall": "5.0", "Content": "For anyone with a creative bone in their body, an SLR camera is the way to go.  And if you like snapping, and not developing, then digital is the only way to go.  I recently got this camera and it has the feel and capabilities of many professional digital SLR cameras, but without some of the less necessary features, like color temperature control (you can select several settings for this feature, but it is not fully customizable as some other digital SLRs are).  For the creative, semi-pro photographer, this is the camera of choice.  Kudos to Canon for making a very fine product!", "Date": "October 24, 2003"}, {"Title": "Happy camper", "Author": null, "ReviewID": "R2APAZ558F7DTJ", "Overall": "5.0", "Content": "I can't speak from a professional level, but I can tell you that I am really happy with everything about this camera.  It takes beautiful shots, great color, has great features, and also allows me to fully customize my shots.  I can only imagine how many rolls of film I would have ruined experimenting with different settings.  With the Rebel, I take the picture, and can immediately see if I'm over or under exposed etc.  It's kinda like cheating.  I also picked up the 75-300 USM lens.  Quick and accurate focus.  A must have with this camera.  I actually started with the Canon G5, but quickly returned it after using it.  Focus was way too slow.  I shoot mainly action shots, and this camera has held up to all the reviews.  My next add on is the flash.", "Date": "November 10, 2003"}, {"Title": "LOVE IT!!!", "Author": "Christopher Goeson", "ReviewID": "R358QV6QTXUWSD", "Overall": "5.0", "Content": "Love this camera!  You would have had to pay double this amount 6 months ago to get these capabilities.  It is easy to use and takes great photos.  Get it today!  They'll be gone by Christmas.", "Date": "October 27, 2003"}, {"Title": "camera", "Author": "Natalia V.", "ReviewID": "R1ZEXYBBVQACJZ", "Overall": "5.0", "Content": "I love it just wish could take better pictures. i just need more time .but i think i got the hang of it.", "Date": "June 14, 2013"}, {"Title": "This is a very nice and easy canon camera to use going from film to digital.", "Author": "David J. White", "ReviewID": "R17FQN50BDWFDD", "Overall": "5.0", "Content": "I love Canon Digital Camera's!!!!! They are easy to use,and the added features make it one of the Top Rated Camera's in the world!", "Date": "November 18, 2010"}, {"Title": "good practice camera", "Author": "Benjie Urbina", "ReviewID": "R3FI3HCSNJ6FU4", "Overall": "4.0", "Content": "I'm hoping for a Digic III chip before buying a new one, but for anyone looking for a camera they can learn and experiment at a cheaper price, the 300D is your best choice.It offers the same basic usage as the newer canons; the 350 and 400D's without the \"fancy; seldom used\" features. If you're looking for a cheap DSLR for point and shot, this is it.If you can find a slightly used one, this will be a good choice to start before buying the more expensive ones. :)Me, i've upgrade to a used D60. same 6MP sensor but more of a MID-Pro camera. I might buy a 30D some day, if you have the money and is seriously looking forward to photography as a hobby, the 30D will be your choice.Just remember, the camera body is only half the equation, you need good quality lenses too, case in point, my lense collection is 3 times as much as i spend on my camera body.", "Date": "May 19, 2007"}, {"Title": "Underwhelmed-buy the Nikon D70 instead", "Author": "Brad White", "ReviewID": "R15B1OJTF0KA6G", "Overall": "3.0", "Content": "I purchased the EOS 300 Digital \"Rebel\" mostly because of my positive experience with a Canon A80 digital. I absolutely love the A80 and Canon quality and customer service is first rate and wanted to upgrade resolution, FPS, and shooting flexibility. I was disappointed that even though I experienced a slight improvement in picture resolution, i found the EOS 300 Rebel just underwhelming in terms of design, function and ease of use. It felt heavy and awkward, and didn't seem a significant improvement over the A80. I also had a problem with the lens(an upgrade from the lens kit). The auto focus servo malfunctioned, only worked in one direction and the camera could not focus at all in low light. I returned the EOS camera and lens and bought the Nikon D70 and 18-70 lens kit, the other option for serious prosumer gear. WOW, what a difference and what a beautiful camera! Amazing image/color quality, fast auto focus, with low-light beam assist. The metering is dead-on precise, i can even get an accurate exposure with 30 second shutter speeds! Changing film speed, white balance, apeture, shutter speed is one touch controlled with dials at thumb and forefinger.  The menu works like windows with very easy to access and use.  The lens is a wider focal range and better quality than the Rebel kit. The D70 feels great in the hand: solid, lighweight with natural ergonomics. It was intelligently designed by people who use cameras, know digital photography, and not just an adaptation from an older model film camera.  Spend the extra few $'s for the D70, and especially now with the $200 rebate on the camera and lens kit.", "Date": "March 4, 2005"}, {"Title": "Excellent Pro-sumer camera but...", "Author": "Pierce", "ReviewID": "RR0ENZUMFHEQ", "Overall": "4.0", "Content": "When I saw a digital SLR below $1k for the body I knew I was going to buy one.  A friend of mine has the 10D and loves it (he's a pro) so I bought the Rebel.  I'm very happy with the camera.  It works exactly as advertised, but most of the time I use it as a point and shoot type camera.  That being said it's not the best point in shoot camera.  I always seem to be adjusting something to get the picture the way I want it.  Maybe that's the way SLR's are?  My Kodak DC265 is a much better point in shoot type camera (remember back when the DC265 use to be a pro-sumer camera?).  However, the ease of use and speed of the camera I believe makes up for it's short comings as a point and shoot camera (which it's not intended to be anyway).BTW I have the Canon 28-105mm II USM lens on mine.  I find myself wanting a wide angle lens and occasionally a macro lens.", "Date": "February 17, 2004"}, {"Title": "I love it!", "Author": "Wendy Mc Call", "ReviewID": "RSR0EW3YY0T5D", "Overall": "5.0", "Content": "We have a smaller digital camera, and an SLR camera.  how wonderful to combine the two!  this camera may have a few exra perks that we may not use, but we have already seen a huge difference in the quality of our pictures!  we've only had this camera for 10 days!", "Date": "October 22, 2003"}, {"Title": "Not bad for first time DSLR buyers but seriously lacking in several areas", "Author": "windriver12", "ReviewID": "RAFXE79VJ18MT", "Overall": "2.0", "Content": "I have had this camera since Jan '05 and have so far taken approximately 10,000 shots while on trips and at weddings.Don't expect much from it and you will be happy. As an entry level DSLR it does what it's supposed to do in ideal conditions. I find it's strength is in taking people photographs in bright light, provided that they are not moving.Cons:In landscape photography this camera is lacking - both due to inadequate megapixels and it's inability to capture the natural blues and greens very well.Battery dies FAST. The battery I got with it hardly lasts a whole day of shooting, especially when shooting in RAW mode. I have yet to fill up a 1Gig card when shooting in RAW mode(Approx 150 shots) before the battery dies. Surprisingly when shooting jpegs, I get more shots per charge(Over 300) but hardly enough to last a day. I cannot tell you the number of times the battery has died on me while I was out on a hike. So I always carry a backup film camera (my trusty Elan 7).The viewfinder is very dim. When I look through my Elan 7 and then through the 300D, it is painfully obvious how dark the image is through the 300D's viewfinder. In indoor situations with low light this becomes a handicap, especially when having to resort to manual focus.Autofocus in low light for the 300d is terrible. When shooting indoors, the autofocus hunts and ends up focusing on something behind your intended subject. I have lots of beautiful photos of walls and sconces in the background in sharp focus while the people standing in front in the middle of the frame are an out of focus blur. This is despite having a 420Ex Flash on my camera that uses an infrared beam to assist with the focus.The 420EX flash is supposed to \"talk\" to the camera and adjust the power in order to ensure the subjects are not over or under exposed. However, with the 300d, this is a crap shoot at best and many of my indoor shots are over/under exposed.After about five months, the shutter button started sticking. I would click it and then it would remain depressed. The shutter button would only pop back up after I jiggled it a little.Another annoying thing about the camera is that the settings are displayed on the rear of the camera and not on the top beside the shutter button. And since there is only one thumbwheel, it is not easy to change aperature and shutter speed. For example, if you use the thumbwheel to change the aperature, then to change the shutter speed you would have to press another button while at the same time turning the thumbwheel. When you take thousands of shots over the life of the camera, this is a real annoyance.So would I recommend this camera:If you are a casual point and shoot person, it's an affordable entry into DSLRs that produces decent photos. But if you plan on shooting a lot indoors or want to take landscape photographs that can actually convey the colors accurately, look elsewhere.", "Date": "December 10, 2005"}, {"Title": "I love this camera.", "Author": "Happy Parent", "ReviewID": "R3DLKQVRNPJMGF", "Overall": "5.0", "Content": "Great camera.  Excellent picture quality, ability to use filters and lense from Canon and others.  I am very happy with this camera.", "Date": "October 25, 2004"}, {"Title": "Better be a pro", "Author": null, "ReviewID": "R3A0F2OY7M4WOX", "Overall": "2.0", "Content": "This camera takes great outdoor pics, but indoor pics are consistantly underexposed. I am experimenting with all the controls and modes, since most of my pics are indoors of my children (during the winter). When you start using the manual settings, they are not consistant. It's a hit or miss deal (trying to set the right exposure for indoors). I exchanged my rebel for another, only to have the same results. It is not a point and shoot camera for indoors. My advice is if you're an amateur photobug, wait and see what Canon's competition does or wait till canon fixes the problem with underexposure on these cameras. I gave it only 2 stars because of the underexposure and having an \"auto\" position on the mode dial that doesn't create good photos automatically.", "Date": "December 29, 2003"}, {"Title": "could be better", "Author": "Manuel Abarca Ferro \"Manuel\"", "ReviewID": "R3NPNNKGNDB3VW", "Overall": "4.0", "Content": "Definitely it is an excellent camera but I sincerely recommend even more the Nikon's CCD than Canon's CMOS sensor. CCD It gives you better contrast, lower noise at long exposures (more than 20\") but an important cost difference. This Digital Rebel is the ideal camera if you feel the need to begin into the digital reflex world. You should try to replace the lense (18-55) for a more generous MTF dotted one to get better results.", "Date": "August 19, 2004"}, {"Title": "Loved it, but it's starting to fail me now...", "Author": "R. D'Alessandro III \"rudydale\"", "ReviewID": "R3POE4PMMYZAHK", "Overall": "3.0", "Content": "I bought my DigiReb in Feb. 2005 and have shot literally thousands of photos with it since then, with few problems.  I added a Canon EF 28-105mm ultrasonic lens last year and have enjoyed the results, although I found early on that the new lens no longer allowed me the luxury of shooting on autofocus.  Okay, so, necessity forced me to learn to love manual operation of the DigiReb.Media cards - Generally, I've used and sworn by SanDisk 512MB CF cards.  They've never failed me, and have allowed me to reuse them many times over.  About a year ago I bought a Hitachi 4GB Microdrive media card and while I loved the storage space, I found that the processing time was far slower than a simple 1GB SanDisk CF card I also purchased.  Not so infrequently, when shooting with the Microdrive, I found that the card didn't record an image, but instead I'd see the dreaded \"Corrupted data\" message on the LCD where I'd hope to see an image.Let's also talk batteries.  I've noticed on cold days that the proprietary Canon lithium batteries for the Digital Rebel drain down quickly in cold temps - today's temps in DC were in the high-20's to low-30's.  And I do think that you are hardpressed to get through one day of serious shutterbugging (say, traveling through Tuscany, where you could easily snap off 300 shots) without going through one lithium battery and half of another.  Let's face it - when you're shooting on manual and trying to adjust for the light with a bright sky but a less than bright street scene, you want to check the LCD to see whether you need to adjust and take another shot.  And that means you're going to go thru batteries.Earlier today I went out for a hike at Great Falls Park, taking the camera along, with those frosty temps ready to drain the lone battery I took along.  I was able to capture a few early shots, and while the battery power quickly went from reading full to less than half full, the camera continued to work...except that it simply took blank images - all black...!  Battery was present, microdrive was loaded, lens cap was off, shutter depressed, photo seemed to have been taken, but nothing showed up on the LCD.  Not even a \"Corrupt Data\" message.  Only a dark screen.So, this afternoon I've purchased a SanDisk Extreme III 2GB CF card, have recharged my batteries and am indoors, with an ambient room temp in the low 70's.  Fired up the DigiReb, shot a handful of images, and...I'm still getting the black screen of death.  The DigiReb and it's flash are snapping away, but something's missing. (Downloaded the images to my laptop - no dice, nothing, but black screens.)If anyone else has encountered this problem, please let me know what you found out about the issue.It would really reflect poorly on Canon for this product to give up the ghost after just two years of service...That's why I'm giving this product only 3 stars.", "Date": "March 17, 2007"}, {"Title": "AWESOME MACHINE", "Author": "B. GILLING", "ReviewID": "R2PQTRCXIO3A53", "Overall": "5.0", "Content": "Well we were all waiting the tech is here at last a  SLR digital  that is  less than $1000 !it takes beautiful pictures and you can use your old lens timesX 1.5 for digital conversionCANON ROCKS WITH THIS MACHINE!", "Date": "October 27, 2003"}, {"Title": "Ignore the Sony fanboys, this is the best around", "Author": null, "ReviewID": "RF3CRYWZOVW4C", "Overall": "5.0", "Content": "Until the sony fanboys showed up, the Digital Rebel was 5 stars. They're jealous of the quality Canon has delivered with the Digital Rebel at a great low price. Get this camera, you will not be let down. Can Sony compete? Nope. Perhaps that's why their fanboys are running so scared. Good job, Canon.", "Date": "January 21, 2004"}, {"Title": "An amazing camera for the $$", "Author": "T.E.B", "ReviewID": "R28EJV7D2JTGKQ", "Overall": "5.0", "Content": "Having worked my way up through the digital camera point & shoots, to this camera, it is great to be back using an SLR again. The images are absolutely wonderful, great color, low noise, nice saturation. All in all I'm very satisfied with this peice of marvelous technology...", "Date": "September 27, 2003"}, {"Title": "Buggy software", "Author": "Kevin", "ReviewID": "RZUYFG2H02CG3", "Overall": "1.0", "Content": "In addition to the kit lens, I bought a Canon 50mm f/1.8 macro lens. The third or fourth time I attached it to my camera, it stopped working and displayed the message 'Err 99'. Checking my manual, Err 99 is described as \"other error. Please contact tech support\". Doing so, they revealed to me that this error message is \"usually a result of attaching a non-Canon lens.\" Nevermind the fact that my lens was a Canon lens. The error is debilitating; my camera is fully non-functional and I'm going to have to pay to send it in for repair. The maddening thing is that the error is in the software. The camera operates perfectly fine for the most part; auto-focusing, selecting the aperature and shutter speed are just fine, it's only after it takes a picture and it tries to process it that the error pops up. Nominally a great camera at a great price, but it looks like they haven't developed very good software for it yet. Even when I get it fixed, do I dare attach my alternate lens again? Do I even want to own a camera where the mere act of attaching a lens can cripple it? Either my lens is junk or my camera is junk. wtf?Even more fun is the fact that I bought this camera shortly before moving overseas, and Canon has informed me that my warranty is only good in the country I purchased the camera in. So I have to wait until I head home in 3 months to get my camera fixed, which will be just after I finish my travels to the many corners of the world I bought the camera to photograph. This fills me with an inchoate rage that I do not feel words can suitably express.BOTTOM LINEThis error does not seem to be common, so you can weigh your chances.Otherwise, this camera is beautiful. Part of my rage is due to the fact that I covet it so, and to have it torn from my grasp is like losing a lover!", "Date": "June 14, 2004"}, {"Title": "Great SLR digital camera", "Author": null, "ReviewID": "RUDMF83GXJQFO", "Overall": "5.0", "Content": "This camera is easy to use and it is great that I can use my other Canon lenses with it.  I have printed out quite a fw pictures that I have taken and they look great.  I am very happy with this camera.", "Date": "March 11, 2004"}, {"Title": "Very Disappointed", "Author": "K. Thomas \"KPJ\"", "ReviewID": "R1PXXW92I83VO", "Overall": "3.0", "Content": "I am a 35 mm Rebel user and thought that I was ready to make the jump to SLR digital. The price of the Rebel digital was also great incentive. I have also had a ton of fun with my mother's Nikon D100. I was hoping that the picture quality of the Rebel would be comparable to the Nikon without the cost.I purchased the Rebel Digital a couple of weeks ago and it is already in the shop - re: back to back pictures of the same subject /same distance using on camera flash and also 420 EX flash resulted in very different exposures. First very light, next very dark, etc etc.Made no sense to me at first or to the guy at the camera shop. I was first sent home with the directions to wait longer in between shots to allow the flash more time to 're-energize'. This didn't sit well with me but I tried it - still no cure. After taking it back the second time they sent it to the shop. The camera guy took 2 of his own photos back to back and WOW I am not an idiot after all and away the camera went to Canon. Haven't heard back yet.After e-mailing Canon myself this is what they had to say:Please remember that metering is linked to the active AF point. If youfocus (meter) on a very light area of the subject, the camera willexpose for that area. As a result, darker areas of the same subject mayappear underexposed. Using the camera's AE Lock (or FE Lock, for flashimages) function should improve your results. Alternatively, you canmeter on a more moderately toned area of the image.Anyway, after kicking myself in the butt, I went back to the camera shop and requested a new camera body as I am not comfortable with having a camera less than a week and having it in the shop already. So they agreed and gave me another. Much to my surprise this one did the same thing (not as bad though). The guy told me that I needed the 10D his reasons were not quite clear. My guess is a combination of speed and exposure setting differences as well as autofocus ability? (If anyone cares check out the 9 point autofocus of the new 20D - Very Impressive!)Bottom line if you are not a SLR user you may not even notice these slight but to me very irritating differences in exposure so spend the money and have fun. For me, I am going to save for the 20D and hope for much better luck!!!!!Besides sometimes newbies, amateurs, even professionals just want to point and shoot and this camera just doesn't cut it. You decide if this is something that you want to deal with or not.Thanks for the time and good luck.", "Date": "September 8, 2004"}, {"Title": "Great Value", "Author": "Patricia Yam", "ReviewID": "R2QZQZUN7MFDMI", "Overall": "5.0", "Content": "Finally, a digital SLR that is affordable.  Great Value... great resolution... ease of use... fast auto focus... reputable maker.  Why buy a Sony 'SLR like' that costs as much when you can get a real SLR like the Rebel?", "Date": "February 4, 2004"}, {"Title": "The first of many to be sure!", "Author": "John J. Schilling", "ReviewID": "R226RGP7PP9GRP", "Overall": "5.0", "Content": "The Canon digital Rebel is an extraordinary camera. The camera is not for everyone, but a serious amateur like myself, is exactly the segment this camera was designed for.I have never owned a Canon before, so the location of buttons from the other rebels means nothing to me. The camera works incredible. It was worth every penny. It's fun to use, and gets admiring glances wherever I take it.", "Date": "February 4, 2004"}, {"Title": "awesome.", "Author": null, "ReviewID": "R5SIYGVM0JBU1", "Overall": "5.0", "Content": "Best camera ever. Battery life is superb. Macro shots are just beyond heaven. The lens are seem cheap, but they're actually quite worth the extra $100 because it's so wide (buying an additional lens with similar focal length would cost over 400 bucks).The canon EF 28-135MM f/3.5-5.6 IS USM is a great overall lens for this camera. Since I'm not allowed to post URL's go to google and search for \"digital rebel tricks\" hosted on [...] for it has many tips.", "Date": "May 13, 2004"}, {"Title": "Great Camera", "Author": null, "ReviewID": "R19KCGFYPUX3UW", "Overall": "5.0", "Content": "A great camera that is affordable.  An SLR that many can now afford. Nice resolution, good quality, right price.  How can you go wrong?  Canon got a winner here.", "Date": "February 4, 2004"}, {"Title": "Excellent - but wait a bit if you can", "Author": "Andrius Uzkalnis", "ReviewID": "R1TMAVNG00YFKT", "Overall": "5.0", "Content": "Yes, Canon was the first to make a digital SLR which is bordering on affordable, and yes, the product is very good (there are already plenty of good reviews as to what it can do; yes, it does a lot).But good value for money? PLEASE. You gotta be joking. Take that thousand bucks and see what it will buy you in film SLR department. Exactly: for thousand dollars, you will be the King of the Hill, you will have something awesome - like Nikon N100. The point I am trying to make that by buying this Canon today you are shelling out half of your money for its novelty value. Digital SLRs of the same class will be half the price in a year or 18 months, and you know it. I am not campaigning against digital - yes, it is the technology to which we will all move one day, but now it is simply too expensive for the quality that it offers. Rememember how the first DVD players used to cost like a second-hand car? And how they're now - only a few years later - retailing for the price of, like, lunch for three at a pizza joint?If you agree to pay a lot of money for novelty, this camera will not disappoint you. I will try to wait a little bit.", "Date": "May 16, 2004"}, {"Title": "Canon cannot fix my Shutter Problem.", "Author": "B. C. Moseley", "ReviewID": "R1X60IWYOKABBR", "Overall": "1.0", "Content": "The Digital Rebel seemed to be a wonderful camera, with the exception of one MAJOR problem. Using available light (no flash) with shutter speeds of 1/1600 or higher, parts of my images are blacked out (like the mirror is not moving quickly enough). The black area grows with faster shutter speeds. This occurs in any mode (AV, TV, M) you can shoot at these speeds. Does it on multiple Canon lenses (85/1.8, 70-200 2.8L). Dealer had no clue. Canon support returned camera saying they had fixed it and if the problem persisted to \"send the camera back with a lens.\" (did they have no lens handy to try on the camera?). Major frustration + cost of sending camera in + cost of being without camera. Canon Reps: I'll gladly change this to a much higher rating if & when you fix the problem.", "Date": "February 14, 2004"}, {"Title": "Great camera, but difficult to use pc interface", "Author": "Liam Scanlan", "ReviewID": "ROPQG30I9J6X", "Overall": "4.0", "Content": "I would have given the camera 5 stars but for the fact that I have found it difficult to extract the photos from the camera. I have a $150 digital Olympus that is So Easy to get the photos onto my pc from.Both of my PCs (one Win2k, the other WinXP) gave me different problems with the Rebel. With the latter, I cannot thus far get the photos off. The PC recognises the camera (after all software installed, rebooted etc) but show nothing when I dbl-click into it.", "Date": "April 22, 2004"}, {"Title": "Excellent camera for amateurs and \"professionals\"", "Author": "Bill Helf \"Bill Helf\"", "ReviewID": "R67SV2RNNBVBF", "Overall": "5.0", "Content": "An incredible piece of equipment at an almost give away price.  I have no complaints and this camera surpasses what I expected.", "Date": "August 14, 2005"}, {"Title": "Broken after 2 days of shooting", "Author": null, "ReviewID": "R3JALJOXFTOXJ", "Overall": "3.0", "Content": "Camera would mysteriously stop working for periods of 15 minutes. Pictures taken were grainy when shot with green or sport. On review of the photos, I found the built in algorithms refused to shoot the camera faster than f5; instead the ISO was always shifted to 400 and 800.(don't they have confidence in their lens?) Also noted a powerful tendency to underexpose; even a balanced subject illumination did not seem to prevent this problem. Auto exposure button is hard to use. Best part is camera's simplicity, SLR, and light weight. But my canon A80 photos are better by every measure. Too bad; bottom line of a camera is output. A simple, cheaper rangefinder easily beats it.", "Date": "June 15, 2004"}, {"Title": "Semi-Professional Camera at great price", "Author": "Nathan Allan \"NetBloke\"", "ReviewID": "R35GXDNE3EMCDB", "Overall": "5.0", "Content": "I was lucky enough to score one of these of a friend. It was but two months old and was as new.It is easy to use as a point and shoot, but also gives you all the capabilities to take your time over a shot and really take a truely beautiful picture.Canon products seem to have an extra quality to them that makes them robust and intuitive to use.", "Date": "February 6, 2005"}, {"Title": "Great deal: Good price, excellent features", "Author": "Sexto Acto", "ReviewID": "R15YUHBB66G0R9", "Overall": "4.0", "Content": "The EOS Rebel digital gives very good features for a very low price comapared to other similar cameras.If you're used to shoot with a traditional manual SLR you wont feel the difference.But if you're used to shoot with a digital camera with an LCD viewfinder you may feel unconfortable with the tiny 3/4\" viewfinder eyepice.Pictures are very clean even in low light conditions.The built in flash like in many  digital cameras isn't really good.Is possible to take pictures without compact flash card connecting directly to a PC with the USB cable (a little bit short)The box comes with Adobe Elements 2.0 and another Canon useful software for managing images.", "Date": "November 22, 2004"}, {"Title": "AWESOME!", "Author": "Keith Nicoll", "ReviewID": "R1A3IHK508IDQB", "Overall": "5.0", "Content": "Having stupidly broken my PowerShot G5, I decided I would take a step up to a digital SLR, just wasn't sure who I would buy from (Canon or Nikon). Decided on the Digital Rebel, with a Sigma zoom and telephoto lens. Even though I only received last night, I am very pleased with it already. I can only imagine the shots I will get and look forward to learning everything that this camera can do. Only one little minor thing I didn't like when I pulled it out of the box and that was a sound like something was loose, turned out to be the flash but this is not a big deal (other than trying to figure out how to turn the flash off LOL). Anyway, being an very limited digital user it seems a great camera for a beginner, but at the same time I can see that it can benefit an experienced photographer at the same time. Glad I decided to go with the Digital Rebel and getting some wonderful shots!!", "Date": "December 9, 2004"}, {"Title": "the best SLR digital", "Author": "Bradley Hale \"Braley M Hale\"", "ReviewID": "R2HM0JWQULEXI9", "Overall": "5.0", "Content": "The Cannon rebel digital Slr is  the best! I searched all over the net and found nothing that compared to the price of this camera.I have a Rebel film SLR and a Cannon digital Video mini DV Z65. So yes I am loyal to Cannon because they make great products.", "Date": "November 2, 2004"}, {"Title": "Excelent Camera", "Author": "Nelson Villarroel \"Nelson Villarroel\"", "ReviewID": "R2S4EPS6EYH4ZJ", "Overall": "5.0", "Content": "I'm not an expert but it seems to be an outrageous camera.It should come wiht a case....", "Date": "January 11, 2007"}, {"Title": "The competition is better", "Author": "joethebassplayer", "ReviewID": "R2G815TJYT9WZJ", "Overall": "3.0", "Content": "I returned the one I bought. The D70 takes better pictures and the new Pentax *IstDS blows it out of the water in size, build quality and mostly in superior photo quality. The 300D is faster and better than a point and shoot, but the photos have much more of a fake/processed look than the *IstDS.", "Date": "December 1, 2004"}, {"Title": "An OK camera", "Author": "Gary Cox", "ReviewID": "R17EFKT43VOHV7", "Overall": "3.0", "Content": "If you are looking for a point and shoot camera this isn't it!  If you are looking for a camera for outdoors this takes great pictures in good lighting.  If you are taking pictures indoors expect a good number of your pictures to be blurred and out of focus.  I even purchased the most powerful flash Canon sells and I still do not get good results.  It appears the camera often sets exposure incorrectly by metering incorrectly but this is just a guess... In compairison a $200 point and shoot digital camera beat the pictures I took with the digital rebel.  Perhaps if I could customize some of the settings more that would help but then if I have to set everything all the time then it sure isn't a point and shoot as the automatic mode, I found, doesn't do very well figuring out lighting.", "Date": "May 10, 2004"}, {"Title": "Canon SLR Vs Sony Prosumer", "Author": "Timothy Callen", "ReviewID": "R1WHLR4CXYJTWT", "Overall": "2.0", "Content": "Was considering buying the Sony DSC 838 but decided on the Canon after a couple of weeks with the Canon I wish I would have stuck with the Sony. I have a Sony DSC f-707V and it produces very sharp pictures with nice contrast from the Zeiss lens on it. The lens on the canon cannot produce a photo that comes near the quality of the Sony. I have not found a lens at a reasonable price to replace it as of yet perhaps a better quality lens will improve the image I've been getting. I'm glad I didn't sell the Sony I have.", "Date": "February 28, 2004"}, {"Title": "Nothing But Headaches", "Author": "camellia", "ReviewID": "R25EPHMA6WYXXL", "Overall": "1.0", "Content": "I have owned my Rebel for less  than a year (since October 2003) and it has given me nothing but headaches.  The shutter failed within 6 months (which I had to send out for repair) and now the autofocus has failed as well.  I use this camera for shooting weddings and I hate it.  The low light focus stinks and anything higher than 400 ISO is noisier than sin.  Never again will I buy another Canon camera.  Once this thing is fixed, it goes up for autcion on EBay.  Buyer beware!", "Date": "July 25, 2004"}, {"Title": "Disappointing dynamic range", "Author": null, "ReviewID": "R1H1JRNBML1N6K", "Overall": "3.0", "Content": "I am disappointed by the poor dynamic range of the digital rebel. If the light on the subject is not uniform pictures are ruined by washout. Fujitsu models offer better dynamic range.", "Date": "March 6, 2004"}, {"Title": "Dont put one control on the camera when 8 will do.", "Author": "P. Reese \"muncie-birder\"", "ReviewID": "R2UVVYSUCRWJD4", "Overall": "3.0", "Content": "This camera is worse than a VCR.  I think the guys at Canon stayed awake at night trying to figure out where to add another control.  Quite frankly, I don't like the camera, yet.  Maybe it will grow on me.  In automatic mode it takes good pictures occationally.  About half of the shots are under exposed especially if the subject has light colored clothes on or against a light background. It does ok on panaramics.  The flash pops up in bright sun light and goes off sometimes.  Sometimes it pops up but does not go off. Figure that out. I have not yet figured out how to get the thing to use a fast shutter speed even at asa 1600.  I guess the lens is just too slow. Some of the shutter speeds that it selects on automatic mode are as slow as 1/4 sec. I no longer even consider automatic mode except when taking shots of panaramics. Some of the inside shots are way under exposed even with the flash poping. That has got to be hard to do. I wonder how they managed that.I sure wish Miranda was still in business.", "Date": "October 27, 2004"}, {"Title": "Stay With the Sony", "Author": "Timothy Callen", "ReviewID": "R155WXE5DH2WYD", "Overall": "2.0", "Content": "Purchased a 300D to be able to change lenses and add a pro strobe. I haven't as of yet been able to get the manual mode to expose correctly (always underexposed) Even using the 550EX flash. To date I have yet to get a lens that compares to the sharpness of the zeiss on my sony 707. I wish I would have bought the Sony 838. Spent a bundle on lenses and what I've ended up with is basicly a range of 28 - 300 (35mm equivelant)with none giving comparable sharpness to my 707.You get that range stock on the sony for the same $1000 bucks or so you get the cannon and its 18-55 (29-88 35mm equivelant) cheap plastic lens for. I like to use aperature priority with a bounce flash for portraits. Nixed on the cannon by its metering background lighting in A mode with flash. This would be Ok if the manual mode flash metering was acceptable but its not. I feel I've been trapped in a money pit buying lenses and strobes tyrying to get this camera to peform to my expectations. I probabally would have been perfectly satisfied if I had not owned the 707 and known what a sharp lens was capable of producing. I see that most of the lower reviews are from former sony owners. I guess we have been spoiled.", "Date": "March 20, 2004"}, {"Title": "Pictures are soft", "Author": null, "ReviewID": "R2HT3FGIIW1RO2", "Overall": "3.0", "Content": "This camera is not as good as I was lead to believe.  The pictures are too sofor slightly out of focus no matter what I do.  The focus system is difficult to use and it doesn't work well.  Operation is pretty slow too, picture to picture and start up times are not very impressive, I was hoping for a faster camera with my upgrade to a DSLR.  I wish I had kept my F717, which was made of metal, this camera seems very cheaply made.  The included lens is a little bit distorted in the corners, and also seems cheaply made, already rattling.  The Sony is overall better.", "Date": "January 19, 2004"}, {"Title": "Cheapo, low quality aka \"pro\" rebel.", "Author": "Alex Vox", "ReviewID": "R2J57LOGKWI3QJ", "Overall": "2.0", "Content": "Camera quality is disaster. It badly fits in the hands, it unsteady and cumbersome to operate. The image quality is so-so. Mid-tones are very poor, color rendering as a cartoon film like. All colors are \"pop up\", it is not a photography tool to my view. I have tried it against 5M Sony f717 and it blew it out of water in every aspect. Moreover, the \"stretched\" to 6M images from Sony are looking better. The 18-50 \"lens\" is so embarrassing that Canon should be ashamed to market such khe-khe, lens (with failing front element and unsteady focus). Some one has be really inspired by Canon's advertising movies to pay $1000 for such \"camera\".  It new feels like came out of trash box.Before review it, I would recommend take it in to the hands and try along with something else.", "Date": "December 17, 2003"}, {"Title": "Buyers Beware! Defects and voided warranty", "Author": null, "ReviewID": "R1453QR3VPRTYJ", "Overall": "1.0", "Content": "I got my Canon G5 on August through Amazon. In December the LCD has stopped working, and a few days later the Camera completely stopped functioning.At the time I was travelling with my wife to Europe and Canon refused to service the Camera. Apparently you can only get US local service to it (they even don't allow shipping back to the States) and get this - I took this to Amazon customer service which warned me that by taking this Camera outside the United States, \"you void the manufacturer's warranty on this item. This could make any future servicing of the item difficult and costly.\"Since we are due to get back to the States only in 3 months, and I need a WORKING camera to shoot while on vacation, not when I am home, I had to pay today $350 to fix it and replace the \"Optical Unit\".I will never buy a Canon product again.Sony gives you worldwide walk-in warranty, no matter where you are you in the world you go or call a local Sony service center and get your Camera fixed.Now, that Sony offers CF and not just MemoryStick and with the excellent reviews it gets from the user community, there is really no reason to take the risk with Canon. Their Cameras ship with defects and the service is the worst I came across so far", "Date": "January 14, 2004"}, {"Title": "NOT RECOMMENDED FOR WINDOWS 98 USERS", "Author": "Gil Gamis \"Gil\"", "ReviewID": "R3861LDEF5TDAI", "Overall": "1.0", "Content": "I bought this camera with great expectations, only to find out that downloading pictures is cumbersome and slow.I have several other digital cameras. When I hook them up to my computer, camera's flash card appears as the E: drive in the windows explorer. This makes file manipulation easy, fast and transparent.With Digital Rebel, one has to go through the TWAIN driver which is cumbersome and slow. I called 1-800-OK-CANON. Tech support person told me that this problem exists for Windows 98 SE, and earlier operating systems. Canon does not intend to develop a fix because most of their customers use Windows Millenium or XP.Using the camera I also found out the lens that came with the camera allows only 3X zoom which is inadequate for a substantial number of applications. I have to buy another lens if I keep this camera. I wish I had spent the few extra bucks and had bought the Nikon D2.", "Date": "December 8, 2004"}, {"Title": "For beginners only", "Author": "ning", "ReviewID": "RBAS9OBNX12AU", "Overall": "2.0", "Content": "I bought this camera 2 weeks ago.It's kind of fun,but just for beginners only! If you are a serious photogrpher, don't waste your money on it!", "Date": "November 7, 2003"}, {"Title": "Wow, wow, wow", "Author": "Rose Reyes", "ReviewID": "R29F04PSA782AI", "Overall": "5.0", "Content": "This is an amazing camera and the first d-SLR to be priced below $1000.  Wow.", "Date": "October 2, 2003"}, {"Title": "Could not find sharpness", "Author": null, "ReviewID": "R13J84XPQ11EP6", "Overall": "2.0", "Content": "I tried. I really tried. Circuit City has a pretty poor return-to-exchange program for cameras, 14 days!??! and it took me longer than that to find out that my camera has AF problems.You don't have to look very far on the net to see that a *significant* fraction of Canon 300D and 10D camera buyers are finding that the cameras do not always produce sharp pictures. For those so stricken, it is a toss up whether the picture they are about to take will have focus at the right spot, or the wrong spot, or be overall much too soft (\"soft\" is too kind - shot through a vaseline coated lens is almost a better description). Such a life is miserable. If you can't trust your camera, then photography becomes torture.The camera and lenses are clearly capable of sharp pictures, I have a number that came out, but I could not rely on it. Buying more lenses in an effort to get around or test the problem just sunk me into a black hole of expenditure and confounded me further as the camera refused to obey any consistent pattern of misbehavior.User error you say? I'm not some point and shooter who has never seen an SLR before, nor someone from film who is pleased with 4x6\" prints that look sharp. I've used an F707 for a year and bad digitals before that, and good SLRs before that as well. I know an out of focus picture when I see one! I know canon tends to slightly blur even perfectly focused pictures to achieve a \"naturalistic\" look, but that is not the problem I saw. I saw that AF point of focus was not repeatable, that AF strips were much too big, that spot AF was if anything less accurate that auto-AF, and on top of that, if the camera did the right thing, then Canon zoom glass was a pretty poor show at 6 megapixels unless you worried constantly about aperture and extreme zooms.On top of all this I read (but do not care) that the camera has exposure issues when using the flash, and have the white balance on \"auto\" is worse than useless unless it is a sunny day. Lastly, the camera went through a phase when its firmware ate entire sub-folders of pictures on my 1gb CF card.Unfortunately, after reading about others with focus and softness issues with the Canon 10D (which shares basically the same sensor and system as the 300D) I had no confidence that Canon would acknowledge there was a problem with my example or a problem with the model, and no interest in waiting weeks in the hope they might be nice. So I sold the lot, at a ridiculous loss, and am retiring to lick my wounds and wait until Canon sorts out its production line quality control problems or is exposed for making a camera that does not have tolerances up to its megapixels.It is obscene for Canon to suggest that anyone who wants to see accurate focus down the pixel level at a mere 6mp spend thousands on \"L\" series lenses, or thousands on the 1D.Good luck on your purchase, maybe you'll get one that can AI focus correctly and does not suffer the problems I saw. Or perhaps if you're coming from cheap digitals or from basic film you won't notice the problems, and are the ideal customer for Canon! I'm missing my F707 badly and waiting for the next round of those types of cameras before getting back. Or perhaps I'll pickup a second-hand F717 while people trade up to the F828.A digital SLR is nice for action shots, the mirror slap sound is cool (although does it add to camera shake?), but the cost of glass and the amount of equipment necessary for decent shots is extraordinary.", "Date": "February 15, 2004"}, {"Title": "Great When It Works", "Author": "Pecan Bob", "ReviewID": "R37XF1IO6YSOZD", "Overall": "2.0", "Content": "When I received this from Amazon and went thru several test shots I was amazed at how good it really was.", "Date": "December 25, 2003"}, {"Title": "no show on  product - a week after ordered, store cancelled.", "Author": "\"sherrilange\"", "ReviewID": "R14BQKDT8LVG2D", "Overall": "1.0", "Content": "disappointed that i waited for a week before i was informed product was not available. had received email confirms that order was to be shipped and then no word, then i emailed for status and was informed it was a cancelled order. i bought it somewhere else the day i found out and paid extra to ensure it shipped in time for xmas. a very unprofessional transaction. the camera is fantastic. my boyfriend can't stop taking photos. but i wont buy from this place again - too risky, poor communication.", "Date": "January 9, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "Dazzling resolution: the 6.3 megapixel CMOS sensor\nThe speed to capture the shots that won't wait\nPerfect white balance for clear, true color\nReproducing and sharing your images is as exciting as creating them", "Name": "Canon EOS 6.3MP Digital Rebel Camera (Body Only)", "ImgURL": "http://ecx.images-amazon.com/images/I/61X2wYxuxKL._SX300_.jpg", "ProductID": "B0000C8VU8"}}