{"Reviews": [{"Title": "Cam", "Author": "Stuff", "ReviewID": "R2MENO1DM42N0E", "Overall": "3.0", "Content": "Purchased this camera for my grandchildren...........I wouldhave liked to know that it really is not a kid's camera.  Itwould be good for adults only. Camera too complicated forkids to operate. I was under the impression that the squeezablepoly body would make it ok for kids because of roughness.  When Ireceived the product, it says do not drop. Perhaps it should belabeled that it is not for young children?Otherwise everything okay.", "Date": "December 31, 2011"}, {"Title": "it is what it is", "Author": "Sarah Plain \"Chewys Mom\"", "ReviewID": "R33PYKCPN0F47Z", "Overall": "2.0", "Content": "You get what you pay for. My 4yr nephew was a little disappointed in this camera. The screen doesn't show the photo he took only a tally of photos taken.", "Date": "January 18, 2014"}, {"Title": "iffy", "Author": "McCarthy's", "ReviewID": "R9U1M5TB3P55Q", "Overall": "1.0", "Content": "We bought this for our daughter b/c she loves to take pictures with our cameras. The camera seems to beep twice too often (signaling that the picture-take was not successful). it also went back to reading zero before we uploaded them to the computer... Therefore, we feel disappointed and \"iffy\" about this purchase.", "Date": "January 2, 2014"}, {"Title": "PERFECT CHILDS CAMERA", "Author": "jshearer", "ReviewID": "R1WU2OFHG485X6", "Overall": "5.0", "Content": "I bought this camera for my granddaughter, not the most graceful child ever born, she is constantly dropping things or falling. hopefully she will not break this too soon is seems very durable.", "Date": "December 23, 2013"}, {"Title": "Great Purchase", "Author": "Linda T. Jones", "ReviewID": "R1QNUY7ZVB4PEF", "Overall": "5.0", "Content": "This camera is sturdy for your little one its cute and I think its a great purchase,and I like it a lot because the price is great too.", "Date": "December 24, 2011"}], "ProductInfo": {"Price": "$19.99", "Features": "1.3 megapixel resolution\nf2.8 aperture\nLCD menu on back of camera\n3-in-1 Mode: Digital Camera, Web Camera and Video Camera\nFile Formats: JPEG and AVI", "Name": "Cobra Digital Squeezable Kids Camera, Red DC150-RD", "ImgURL": "http://ecx.images-amazon.com/images/I/41%2BzCm9VyfL._SY300_.jpg", "ProductID": "B000P6R3E0"}}