{"Reviews": [{"Title": "A very good choice for lots of people - easy to carry, easy to use", "Author": "Snap, Crackle and Pop", "ReviewID": "R1Y7E65ZBJDCVQ", "Overall": "4.0", "Content": "The Sony W55 is the followup to the successful and popular W50. It's a very good compact camera, easy to carry and easy to use, and reasonably priced - so most people will be happy with it.Not much has changed from the W50, which in this case is a good thing!One change is that the W55 is a 7 MP camera, rather than the W50's 6MP. Honestly, that's not a big plus, as they haven't made the sensor that catches the light any larger.  Same (good) lenses, same size sensor = the same (good) pictures, but not better.  (Though it might help a little on features like Smart Zoom.)The obvious change is of course the colors.  Don't make too much fun of that!  There are 4 DSC-W series cameras in our family, colors would have kept my mother-in-law from taking my sister's camera home with her.  A little personalization is a good thing.The internal memory has been expanded (to 56MB), but I've never used the internal memory on the cameras that have had it, so I'm not sure that matters much.  It might be worth knowing how to use as a backup, for another dozen or two shots if your card is full, or you have some other problem.The controls, menus and interface on the W55 are reasonably easy to use.  For example, the W55 has easy access to the various scene modes (twilight, etc), with some explanation on the screen of what those mysterious little icons mean (so you might actually use them, since it tells you what they do!). If you're new to digital photography, there will be a learning curve.  But if you've used other cameras much, especially Sonys, you can pick this up and use many of the features right away.Read the short introductory guide that comes with the camera, though!The rechargeable battery should easily last you for a full day of shooting - hundreds of shots - with no problem. (Be a little wise about turning it off when you're not using it!) So you probably don't need a second battery, unless you're going into the woods for a while.  It's nice not to have to mess with bulky AA rechargeables. Also, lithium ion batteries don't have a memory effect, so don't worry about partial recharging. Just charge the battery each night. So - before getting a second battery, try it for a while and see if you need it.But get a case - something to protect the screen, at least.  A fully closed one might help resist rain and splashes a little, too.You'll also want to get a Memory Stick Pro Duo card - Pro cards are faster, and you need the smaller Duo size with this camera. Get a 1-2GB card so you don't have to think about running out of memory too much - if you shop carefully, you can find them for so little these days that it's well worth avoiding running out of memory.  You might want a spare card if you plan to travel for more than a week, or use the video mode often - which is surprisingly good (though a bit dark) if set to fine, but uses enormous amounts of storage at that setting.You can stretch your memory, and your hard drive space, by using one of the lower-resolution settings to take snapshots.  You don't really need 7MP for all your photos!The W55 will take better photos than those credit-card type cameras that have a tiny lens system - optics will always make a difference in a camera.  Any reasonable person will be very happy with the pictures from the W55, given the size of it.The camera will be a little slow and often take disappointing pictures in low light and dark situations.  Try the High ISO mode in low light no-flash situations - the picture quality suffers some, but most people will find it useful. Realistically, no ultra-compact camera will work really well in that situation - if you need that often, think about something with a bigger lens and bigger sensor. Good light always gives the best pictures with any camera. There are limits to what you can currently expect from any ultracompact camera.The W55 offers enough controls (through the scene modes and the Program mode) to allow a fair amount of control over the pictures, for an automatic camera.The charger is fairly compact and rated 100-240V, so while you'll need a plug adapter overseas you won't need a voltage converter. The battery charger is a little slow, though probably OK.Keep this camera charged and handy, and you'll find you take a lot of pictures because it's easy to carry and easy to use!", "Date": "March 24, 2007"}, {"Title": "Perfect for baby/toddler pictures", "Author": "J & A", "ReviewID": "R107Q6E34OCRPS", "Overall": "5.0", "Content": "This is our third digital camera since we had a baby, but it is the first one that allows us to take nearly perfect pictures of our son (15 months old). The reason is simple: a very small shutter lag. All digital cameras (except the very expensive SRL ones) have a noticeable shutter lag (the time it takes from pressing the button to actually taking a picture). Our previous Minolta and Pentax were wonderful for still/nature pictures, but their 1+ sec shutter lag made it impossible to take pictures of a moving baby or to capture a nice smile. Now, this Sony has a shutter lag that is almost inexistent (without flash), and we can finally capture nice pictures of our son. We don't care about MP, but the 7.2MP is also a plus. The camera is also very fast to turn on, taking about 1+ sec, a very important feature for capturing those special moments. Overall, an excellent camera for our main purpose: to take family pictures.Pros: very short shutter lag, fast turn on/off, good picture quality, easy to use intuitive interface, easy to carry, very high resolution, good bang for the bucks.Cons: uses memory sticks (pricier than SD cards), proprietary (and more expensive to replace) cables, very noisy in very low light conditions.Bottom line: wonderful for family pictures.", "Date": "May 15, 2007"}, {"Title": "Stirred not Shaken", "Author": "Dennis Doverspike \"hrlitehouse\"", "ReviewID": "R2WZ6YD3LO1IL7", "Overall": "4.0", "Content": "I am just an average guy when it comes to using a camera. Probably below average. I started trying to use 100% Sony electronic products because my computer was a Sony and Sony-Sony linkages make for easy use. Given that, here is what I think of the product:1. It is amazing how much camera you can get for the money. Compared to just 6 months ago, or a year ago, this is a lot of camera for the money. It is very small, fits easily in your pocket, but takes great pictures. Also, it is very easy to use and recharge.2. A visit to the Sony website, suggests that Sony has new cameras coming out constantly -- new cameras that are very similar.  This makes it hard to compare cameras, even within the Sony brand, and makes you feel as if your camera is obsolete the minute you buy it.3. A problem with this camera, given it is so small -- do not shake. Your pictures will be blurry. I am a typical guy, with very little fine motor control. My hands have trouble holding small objects. Holding this camera in one hand and taking a picture -- well the results are not pleasant.4. I tend to be disappointed by the telephoto capabilities of these small cameras. I guess if you really want to zoom in, then you have to go to a big camera. But it still seems like the small cameras could offer more.5. Having said all of that, in the end, this camera is small and easy to carry, light weight, durable, and it is also easy to use. When you look at it, it looks well made. I ended up giving the camera to my in-laws, because they lost theirs. My in-laws tend to be technologically challenged. I said to them, just leave the dial set to the little green camera, and snap away. I have to say - they love this camera.Overall. For the money, a great purchase, technology is amazing. Just grab it with two hands or develop a steadier aim than I have.", "Date": "March 31, 2007"}, {"Title": "Sony Hits The Sweet Spot", "Author": "R. Chumsae \"the_chums\"", "ReviewID": "R2ZV1WXBC4Q967", "Overall": "5.0", "Content": "At under $250 for the camera, a 1 GB Meory Stick Duo, a good case, and an LCD protector, this is one fine camera.  The base price is less than $200, the 1 GB Memory Stick Duo (stores about 370 hi-def shots) is about $33.  There is a 56MB internal memory which would hold about 7 hi-def shots or 17 low-def, emailable images).  Duos come in up to 8GB sizes.The camera is not backward compatable with the Memory Stick or Memory Stick Pro.  To get to the small size of this camera, both the battery and the memory card needed to be much smaller than earlier models. So, each Memory Stick Duo (about half the size of the Memory Stick Pro) comes with an adaptor which allows the Duo to be plugged into the Pro slot on your PC or printer.The function selection wheel has always been a nice Sony design feature and it gets even better with the W55.  There are now 10 picture taking modes.  As you turn the selector, a short guide pops up on the LCD screen to let you know what this mode does....very, very nice feature since most shots are done in standard mode, and only once in while do you need the other modes, and now you can recall what they do!The larger LCD is very nice but does seem vulnerable to being damaged.  I recommend a good case and a quality screen protector.  I bought both from Asian suppliers for less than $30 delivered (my case, alone, retails at $35).The turn wheel ISO position allows low light/no flash by cranking the ASA to 1000 (very fast).  I tested this at a play where I was about 25' out from the stage.  Even in low light I was able to get good shots and good color.  In the worst conditions the photos did blur, but that's life.  I mention this because all my life I see people taking flash photos when the subject is many feet away - this simply does not work because small camera flash is timed with the shutter out to only 10 or 15 feet.  With the W55 in ISO mode you at least have a chance of a decent photo under these conditions.Camera recovery time and turn on time have been tremendously improved over past generation cameras.  This camera turns on in about 1 second and recovery after non-flash shots is instant, flash shots recover in about 1 second.  This is a big, big, win over many other cameras.  This camera also has two burst modes for taking multiple photos of moving action scenes.In the battle of cost versus quality and features, Sony really hits the sweet spot with the W55. In my view thare are some close competitors but all fall short in some way.For more serious work, Sony offers a Lens Adaptor ($25) plus 2.7X telephoto lens ($139) plus a wide angle lens ($49) plus an underwater case ($150).Another fun feature are the two macro modes; one for 7/16\" and up, and the other for 11\" and up.  I haven't used these yet so cannot comment on the quality, but I expect they work fine.Step up to the nearly identical Sony DSC W80 for about $50 more if you need image stabilization electronics.  If you tend to blur your photos, or do more low light shots, then the W80 is worth the extra money.", "Date": "July 2, 2007"}, {"Title": "Sony 7.2", "Author": "Edmund W. Vizinas", "ReviewID": "R202UM2SGZ275T", "Overall": "5.0", "Content": "I bought this as a present for my wife.  I was looking for something that she could carry in her purse.  the automatic functions are easy and functional.  It is not an enthusiasts camera:  too hard to get into the menus.  The screen is easy to turn off(this sucks battery power).  and it even has an optical viewfinder(a rare finding lately)  the optical viewfinder helps to get steady pictures for those of us with the shakes.  The pictures are clear and the colors are excellent.  The drawback is the that sony batteries cost an arm and a leg.  The wire for downloading pix is multifunctional and very proprietary(read that as expensive if you lose it)", "Date": "March 30, 2007"}, {"Title": "Great Camera", "Author": "Rena", "ReviewID": "RTZC4QMW4M478", "Overall": "5.0", "Content": "I have been to the store to test out a few Sony Digital Cameras. This is the new model that just came out a month ago. I picked one up last night and it is terrific. The images are extremely clear. I was playing around last night, turned off the lights and only using my flash, I took a picture of my kitten and the picture came out as clear as day. The camera also has many settings to meet all your needs, from taking pictures outside, in the snow, or at the beach. I highly reccomend this camera and it is very easy to use.", "Date": "March 14, 2007"}, {"Title": "A handy feature not to be overlooked...", "Author": "P. Sherman", "ReviewID": "R29NJ9SLOIQA6I", "Overall": "5.0", "Content": "I see there are many positive reviews for this camera, which I have had for a year or so. I am adding my own because I see no mention in the first few reviews of a feature I really like about this camera--it takes video. And decent video, at that. I bought the underwater housing for it that is available from Sony and have had a lot of fun taking underwater photos and videos with this little camera. So not only can you get good photos at the family reunion or graduation or vacation, you can get videos that can be uploaded to share! My only complaint is that the zoom is so minimal, at 3x, but I take this camera along with a powerful DSLR with a zoom lens, so I don't need zoom capability. Also, one note--you cannot zoom the videos, they will all be taken from the same perspective.  But this little camera offers so much at this price!", "Date": "August 26, 2007"}, {"Title": "I love This Camera is the best", "Author": "Elle  Pece", "ReviewID": "R2ZA72FUE8AVDQ", "Overall": "5.0", "Content": "This is my first digital camera, i did a lot of search and finaly i decide for the DSC-W55 in black, and is what i was looking for, small enough to have it in my purse, have a lot of functions, and is very easy to import pictures to my computer, you only connect the camera with the USB cable and you don't need to install the software that came with the camera, I have windows vista and i didn't have any problems transfering the pictures, is the best camera and the price is great, and you can choose the super saver shipping and save more.you will love this camera too, is small, very pretty, have lots of options, and take great pictures.Some one wrote in a review that this camera feels like plastic, and that's not true, looks very durable to me and I think is a good product and worth every single dollar you spend.Is easy to shoot pictures in the Auto adjustment mode, to start taking pictures the sooner you charge the battery, because this camera have an internal memory you can buy a memory card later.Well hope you have lots of fun taking pictures, Good luck..!", "Date": "April 2, 2007"}, {"Title": "1st digital camera", "Author": "Tenetrice Johnson", "ReviewID": "R2MCI160BMNPGG", "Overall": "5.0", "Content": "I really love my first digital camera! I searched and I searched and I finally found what I wanted.  The pictures are crystal clear, the movie playback is exceptional - you only hear what you're supposed to, no loud background noise or static, no muffled noise.  The pictures come out so clear that after you take the picture you can zoom in 5X and count the pores on your face! I love it! I don't think I could ask for a better camera.  I hope this camera will last me atleast 4 years or more or until I graduate from college.  If one is in the market and can afford it, get this camera! There are cheaper cameras but if you want to get a camera, get a good one, that doesn't mean it has to be expensive, but in my opinion you get what you pay for. Thanks for reading. Happy buying.", "Date": "March 22, 2007"}, {"Title": "Nice sleek looking package", "Author": "A. Benedicto \"Cool Moe Tech\"", "ReviewID": "R2FI4UENI2BKLN", "Overall": "4.0", "Content": "I've had this camera for a few days, I can say that I'm really satisfied with the pictures taken. I've had to play around with the settings to get the right shots indoors. Outdoors and Macro shots are great, crystal clear shots. My last camera was the bulkier Canon s450 5mp, and I really like this camera better with the exception that I had more manual controls on my canon. Overall it's a great value for those of us who just want to capture family gatherings and vacations. Oh, I almost forgot, Sony has there own cable connection you need to use, don't like that either", "Date": "March 5, 2007"}, {"Title": "Great Camera!!!  Highly recommend!", "Author": "Adamandia Karakantas \"Dia\"", "ReviewID": "R2FFSO8KU30A4P", "Overall": "4.0", "Content": "I love this camera.  The color is great, so fun and makes me feel unique.  The screen is a great size, and it takes great pictures.  Good with the red eye issue.  The menu is great too, when you scroll thru things, it tells you what it does so you don't have to memorize it all.  Takes fast pictures, but not one after another, like I was hoping.  But it does open fast.  Don't be fooled by the big memory, you will still need a larger card.  Depending on the size pic you want, you can take about 30 to 50 pics on the memory alone.  But all in all I love this camera and it was a great buy!", "Date": "April 10, 2007"}, {"Title": "Mixed Feelings", "Author": "Sophia T", "ReviewID": "R261T5020WBBMY", "Overall": "4.0", "Content": "I have mixed feelings about this camera.The build is great, looks elegant and almost has a jewelery feel to it.The user interface is well designed and logical.The power and playback buttons can be a bit small and flat, but they are very responsive.Battery life is amazing.Image wise, I like how this camera captures color - rich without being overly saturated.With that said, comparing this camera to, say, Lumix FX or Powershot, one notices that images produced by this camera is not as sharp, especially when pixel peeps at 100%. However, most people probably won't notice if you don't have a couple different cameras' outputs laying side by side.My biggest problem is that when the lighting condition is not optimal, you really need a steady hand to get a non-blurry picture. I have an old Fuji F10 which does not have IS either, it is easier to obtain non-blurry pics from the Fuji (granted, the Fuji F series are known for taken low light pictures).On the plus side, when you do get a good picture, this camera has less noise at ISO200-400 comparing to Lumix or Powershot.All in all, this is a decent camera for taking everyday shots. It is easy to operate, a delight to carry around, and given proper lighting, produces very nice pictures. But if you want a camera for a particular environment such as indoor lowlight or fast moving objects, I believe there are better options out there.", "Date": "December 6, 2007"}, {"Title": "Liked the camera until the LCD screen inexplicably stopped working", "Author": "Joe", "ReviewID": "RJCYLWPU1G1VV", "Overall": "1.0", "Content": "I actually enjoyed the camera and thought it took pretty good photos. That was for the seven months that it worked. During a trip to Europe, I took some pictures, turned the camera off and then turned it on again a few minutes later to find the LCD not working. It was a bummer, but I thought not a big deal as I would have it taken care of under warranty when I got back to the states.I contacted Sony customer support, who directed me to mail the camera to a repair shop in Connecticut -- Precision Camera. They said I would have my camera back in seven to 10 days. Two weeks later, I received a letter from Precision Camera stating they concluded the LCD was broken due to impact damage, which wasn't covered under the warranty. I could pay $111 to have it fixed or I could have it shipped back unrepaired.I called Sony customer service again and explained to their first and second levels of customer relations personnel that the camera had not been dropped, hit or otherwise impacted. If it was impact damage that broke the LCD screen, it must have been the most subtle of impacts. They said they could do nothing for me and directed me to call the repair company.So I did, knowing what they would say. And they did. They told me their hands were tied and that the LCD was broken and the warranty voided. Even though I disputed the camera was damaged through any negligence on my part, they said they could do nothing. So I'm being shipped a broken camera.I'll simply shop around for another one, certainly not a Sony. I'll never buy another Sony product again.", "Date": "October 19, 2007"}, {"Title": "Does its job!", "Author": "Amy Jensen", "ReviewID": "R39D8PHJ7NK0O2", "Overall": "5.0", "Content": "I LOVE this camera! I've had it for a year now. It does everything I need plus its super light and small enough to put in my bag/purse for all my in the moment capturing needs =) I haven't had a problem at all with this camera only because I try and take the best care of it.Takes nice pictures, prints nice pictures as well. I love how I can record for as long as I want. The bigger the memory card the longer the video. I recommend a tripod if you take long videos only because if you hold it in your hand for a long period of time light movements can make the picture out of focus while recording. If you have a pretty steady hand you're in good shape. The different settings are like every other camera but easier to use. Thats all I have to say.", "Date": "July 11, 2007"}, {"Title": "Sleek, easy to use -- a good buy!", "Author": "Sketchy Bibler", "ReviewID": "R34LEY7DC9GR6Y", "Overall": "5.0", "Content": "When I first started looking at buying a digital camera, I'll admit it: I was shaking in my wee little boots. I mean, cameras are scary! They have all these... words and abbreviations and little buttons, oh the buttons!But, I finally managed to calm myself, to breathe deeply, and to break out my handy Amazon searching skills. When I came across the Cybershot W55, I was mainly intrigued by the reviews. It had consistent, decent reviews, and the price wasn't so bad. (I myself bought a refurbished one from Amazon.)So, I bought it. Bit the bullet. Bought a case and a memory card. When I finally got the camera, I was amazed at how light and flimsy it felt. Surely, I got over this, and now think of our very old, outdated camera as clunky and overweight.This camera has a very nice design, is pleasing the eye, small enough to carry in a somewhat large pocket, but big enough to feel like you're actually holding a camera.And the best part? It's pretty easy to use. I was really intimidated by the buttons, and hey, I'm a child of technology. But I'd never played with a camera before. But after a day or two of taking an obscene amount of pictures of flowers and family members, I got used to it. Didn't even have to refer to the manual; I was pretty pleased with myself.I was further content with my purchase when I loaned it to my mother. Mind you, she's the type who when a pop up window appears on the computer, she squirms and calls for the nearest person to help her. So when she easily learned how to change the colour setting, turn the flash on and off, and use the zoom, I was content. She took some great pictures, and is now currently convincing her husband to buy her one!And just today, my little sister (she's 3) decided she needed to take pictures. While she was very responsible, and took some strangely decent ones, I do now have a very massive collection of pictures of the mall floor. But it was fun, and she greatly enjoyed it.All in all, this is a good choice. The picture quality is good, it's easy to use, the LCD screen is a good size, the battery system is okay (though the charge is nifty, it's kind of large), and overall, I'm very happy that I finally bought one!Enjoy, and good picture hunting for you!(As another note, if you're short on cash, my friend got the other sony cybershot -- the one that's about 130 -- and he's very pleased with it as well!)", "Date": "June 14, 2007"}, {"Title": "Great little camera", "Author": "Billman", "ReviewID": "R9D74SOWRO9TJ", "Overall": "5.0", "Content": "I was looking for a small digital camera that would take movies with sound, and I am very glad that I chose this one. The picture clarity and depth of field are very, very good. For such a small lens, it's really amazing. You have to download the pics to your computer to see the image quality, which is generally extremely well exposed, with details in the darks and letting some of the highlights burn out just like you used a spot meter to set the exposure. The only challenge is that it doesn't always focus well in the bar when you're half drunk taking pictures of your friends. Not sure if that's the camera or the beer. But this thing is really smart, about the size of a pack of cigarettes, and doesn't weigh much more. The battery absolutely lasts forever if you're only taking photos. If you take video, the sound is a bit challenged if you are, again, drunk in the bar recording the band. Oh well. Works great just about anywhere else.", "Date": "July 6, 2007"}, {"Title": "I love this camera!", "Author": "Oma's Treasures \"Oma\"", "ReviewID": "R2JZ7LZDKC73TG", "Overall": "5.0", "Content": "Okay, I will be honest, I picked this camera because it was PINK and I loved the color. It is my first digital camera and Iam shocked how easy and beautiful the photos are! I have never seen pictures more clear and the instructions are clear and easy and Iam not very literate with this type of item. Highly Recommend +++", "Date": "June 11, 2007"}, {"Title": "amazing camera, low price!", "Author": "S. B. Smith \"S\"", "ReviewID": "R2XUUQWMDZYT01", "Overall": "5.0", "Content": "I spent several months determining which camera to purchase. This one has amazing features, such as changing to black/white mode, sepia mode, etc, and the other features such as Twilight mode, etc. Compared to other cameras, this one was about the same or cheaper. It's small and compact, easy to carry.", "Date": "September 11, 2007"}, {"Title": "Solid, but I recommend the 80 for a bit extra cash...", "Author": "DPK", "ReviewID": "RNYLYB749GR2B", "Overall": "5.0", "Content": "Based on the more polished Sony W80 version of this camera, I recommend spending the extra few bucks and going that route.  These cameras usually last a good 3 to 5 years (or longer), and given that 5MP is more than enough from a quality perspective for 99% of the population, the higher MP values are a scam for people to buy a new camera.First, on the battery, it's good but measuring by number of shots is very deceiving because some people can take 150 shots in 10 minutes -- so keep that in mind.  Also, \"snapcrackle\" mentioned that Lithium Ion batteries don't have \"memory\" -- that's not true, here's more info on that (and can save you lots of $ by maintaining your batteries!):Although lithium-ion is memory-free in terms of performance deterioration, batteries with fuel gauges exhibit what engineers refer to as \"digital memory\". Here is the reason: Short discharges with subsequent recharges do not provide the periodic calibration needed to synchronize the fuel gauge with the battery's state-of-charge. A deliberate full discharge and recharge every 30 charges corrects this problem. Letting the battery run down to the cut-off point in the equipment will do this. If ignored, the fuel gauge will become increasingly less accurate. (Read more in 'Choosing the right battery for portable computing', Part Two.)Aging of lithium-ion is an issue that is often ignored. A lithium-ion battery in use typically lasts between 2-3 years. The capacity loss manifests itself in increased internal resistance caused by oxidation. Eventually, the cell resistance reaches a point where the pack can no longer deliver the stored energy although the battery may still have ample charge. For this reason, an aged battery can be kept longer in applications that draw low current as opposed to a function that demands heavy loads. Increasing internal resistance with cycle life and age is typical for cobalt-based lithium-ion, a system that is used for cell phones, cameras and laptops because of high energy density. The lower energy dense manganese-based lithium-ion, also known as spinel, maintains the internal resistance through its life but loses capacity due to chemical decompositions. Spinel is primarily used for power tools.So let those batteries run down all the way!  Remember that for notebook computers as well -- don't just plug it in and let it charge -- you'll kill the battery over time.  Cell phones as well -- sometimes the batteries cost more than you paid for the phones!Okay, sorry -- back to the camera -- please note that Memory Stick media, although showing up on TV's, etc. for reading -- are Sony-only -- so if you already have SD media then buying Sony gets more expensive immediately.  Some people aren't aware of that fact, and there are some great SD-based cameras on the market, so save your money there.Hope that helps!", "Date": "September 1, 2007"}, {"Title": "I LOVE IT!", "Author": "Beth F. Jarrett \"BJ\"", "ReviewID": "R8DNHPDD0BQOF", "Overall": "5.0", "Content": "EASY - TAKES GREAT PICTURES EVEN IF YOU HAVE SHAKEY HANDS! NICE PACKAGE FITS IN MY PURSE AND I CARRY IT AROUND ALL THE TIME.  YOU CAN SET UP SEPERATE FOLDERS RIGHT FROM THE CAMERA AND ALSO CROP PICTURES WITHOUT CHANGING THE ORIGNAL.  TOOK IT TO ARUBA AND USED THE BEACH MODE AND THE PICTURES OF THE BLUE WATER ARE AWESOME.  GET YOURSELF ONE! Sony Cybershot DSCW55 7.2MP Digital Camera with 3x Optical Zoom (Pink)", "Date": "June 8, 2007"}, {"Title": "Great Digital Camera", "Author": "Jonathan Providence", "ReviewID": "R3EXFMWIDLTA1R", "Overall": "5.0", "Content": "This is why sony is hot! This sexy little (yes its really small the size of a pack of cards) it takes perfect clear and crisp pictures and the battery life is a long 320mins perfect for a vacation, make sure to get a memory stick with it though, because w/o it it only holds about 15 pics. This is my first digital camera and I would definitely buy sony again.", "Date": "April 14, 2007"}, {"Title": "Great Little Camera", "Author": "Regular Joe", "ReviewID": "R292BY1CYT7RCQ", "Overall": "5.0", "Content": "Got this as a gift for my teenage daughter and she loves it (both how it works and the color <g>).  While there are always newer/better/cheaper products coming along, this model provides a great combination of size, features, and price.  Highly recommended.", "Date": "September 8, 2007"}, {"Title": "Lots of BANG for your buck", "Author": "Luv2Read", "ReviewID": "RYQNHF6A260AM", "Overall": "5.0", "Content": "Prior to owning this camera, I didn't have a digital camera.  I was a little worried about how well I was going to be able to use it, and whether or not it would take as good of a picture as I was hoping.  I was BLOWN away with how simple it is to use it, and how beautiful the picture turns out. This camera gets my vote for Best Bang for your buck!!", "Date": "September 9, 2007"}, {"Title": "Great camera for everyday use", "Author": "Ty the fashion guy", "ReviewID": "R1I25DVF37FHYL", "Overall": "5.0", "Content": "This is a very fine camera and is ver resonable in cost. It is 7.2 mega pixels and is very easy to use. This is my 3rd digital camera in 4 years ( I keep droping them) But this is by far the best one and it has a great night option which is wonderful. I suggest this to anyone who needs a wonderful camera.", "Date": "June 23, 2007"}, {"Title": "Great camera", "Author": "D. Parris", "ReviewID": "R4X35J3HGYNHO", "Overall": "5.0", "Content": "I've taken several hundred pics already and love it.  Its pretty sinmple to use and switching from auto to the multiple preset modes is easy.  I love the fact that you can see the speed and f.stop when the shutter button is partially depressed.  This tells me what sort of focusing (f.stop function) I can expect and I can decide if the f.stop need to be adjusted a little.  The battery life is great too.  It survived several road trips.  I haven't taken very many flash pics, so not sure what to expect here, but so far, great camera.  Big screen is nice too, pics are sharp on it.", "Date": "June 9, 2007"}, {"Title": "So far the camera is great", "Author": "J. Scally", "ReviewID": "RLBQ842O44RP4", "Overall": "5.0", "Content": "we have only had this camera for a week or so but it has done really well so far.  we are upgrading from an earlier version of the sony cybershot and love the new size and options.  it does take pictures a little different than our old one so learning which options (low light, landscape, twilight etc) work best is a little different.  seems to have great battery life like all other cypershots.  sony has now come out with digitals that have an anti shake feature that would probably be very nice since it is easy to move the camera when taking a picture now that the cameras are so small.", "Date": "May 16, 2007"}, {"Title": "No as cool as it looks", "Author": "Jennifer L. Richman \"Jen R\"", "ReviewID": "R23T81DSNAPZM6", "Overall": "2.0", "Content": "I enjoy taking pictures.  I had a Cannon Elph for years and it recently started to go so I went with the cybershot from Sony.  I lved how small and sleek it was alot lighter than the elph, but after using it at a close friends wedding I wasn't happy.  Alot of \"ghosts\" in pictures, everyone had redeye, the zoom wasn't good at all. If you didn't hold the camera completley still the image didn't come out well at all and after a few cocktails at a wedding it's hard to do, the delay between pressing the button and the picture taking is alot longer than any camera I have ever used, I missed alot of the events at the wedding due to this, walking down the isle, cutting the cake.  Needless to say I'm sending this camera back and ordering another Cannon.", "Date": "November 12, 2007"}, {"Title": "excellent", "Author": "Sheldon K. Thomas \"skthomas7\"", "ReviewID": "R27CN2ZR7AKFCH", "Overall": "5.0", "Content": "excellent Image,built and storage quatily, Lots of features as expected with a SONY , I highly recommend it. but buy the memory,extra battery and carrying case when you ordering it, I crack my LCD display before the carrying case reached", "Date": "May 6, 2007"}, {"Title": "Great camera!", "Author": "Maureen A. Dixon", "ReviewID": "R1JSKDM1067EU4", "Overall": "5.0", "Content": "I just got this & its a great camera, nice & small to just throw in my bag & go. Takes clear, nice pictures. I take alot of pictures of my kids & this camera takes great action pictures of the kids.Great camera at a great price !!", "Date": "March 11, 2007"}, {"Title": "Awesome Camera!", "Author": "Geneen K. Parker", "ReviewID": "R22YTY2JUVZEAV", "Overall": "5.0", "Content": "I love my blue sony cybershot! With a 7 megapixel, but I take all of my pictures in a 5 megapixel - so you may say 7 is too much if you only need good quality pictures to print out at the local walgreen's - otherwise splurge on the 7 for nice movie-taking quality!", "Date": "July 16, 2007"}, {"Title": "Lacks important features", "Author": "Mother of two", "ReviewID": "R1LYQR98GP9E5T", "Overall": "3.0", "Content": "This camera does take good pictures at times.HOWEVER, there is no option to add a date stamp, which is very important to me.  I have two kids and won't remember when pictures were taken otherwise.It also has this annoying flash that flashes several times before the 'big' flash when it actually takes the photo.  This causes whoever to have a squinty face from being blinded from the flashes.  I think this was because it was set to red eye reduction but I'm pretty sure it did it even when I turned it off.I've since gotten a Polaroid i733 for $85.00 which works just as good and has more features.  Save your money.", "Date": "November 18, 2007"}, {"Title": "This Sony cameras is in my opinion worth the money", "Author": "Raymond R. Rivet \"Ray Rivet\"", "ReviewID": "R32F2CUA3QSZGI", "Overall": "5.0", "Content": "I found this camera to be easy to learn the features and i'm near 70 years old.", "Date": "August 6, 2007"}, {"Title": "MOST AWESOME CAMERA I HAVE EVER OWNED!", "Author": "Mary Miscisin \"Positively Mary\"", "ReviewID": "RC9KHVFC7XUTF", "Overall": "5.0", "Content": "This camera is compact, simple to use, and \"cute\" too! The screen is huge and when you change the camera setting, a prompt appears that tells you what lighting/situation that particular setting is best used for...right there on the screen (then of course it fades away so you can see your subject).  The pictures are sharp and the autosettings make it easy to get the lighting right. Downloading them to the computer is a cinch...although they are huge!!! I guess that's what makes them so clear, eh? Everywhere I go I am always complemented (by women of course) and asked what price I paid. They are always shocked at the value. I highly reccommend this camera.", "Date": "July 3, 2007"}, {"Title": "Great camera!", "Author": "D. C. Joseph \"tuniejr\"", "ReviewID": "R1TOEB73P3S66T", "Overall": "5.0", "Content": "I bought this camera for my son for his college graduation and he's thrilled with it!  He'd asked for this one specifically because of the quality of it and is so happy with it!  I'd recommend it to anyone.", "Date": "June 8, 2007"}, {"Title": "Great to take pictures without thinking too much about it", "Author": "R. Silva", "ReviewID": "R3RY0738CC8O8T", "Overall": "4.0", "Content": "This was my firt digital camera. I got it for a trip and it worked out great. The optics are amazing and the price is really worth it.Though it doesn't work to perfection when it comes to shooting movement, still it has settings for pretty much every situation. The only thing is that these settings are not intuitive, and it took me some trial-and-error to figure in which situation I should use some of them. Having done that, it was really easy.The \"P\" setting is especially nice, since you can use it to set the camera anyway you want, even the flash (which has three levels of strength).The videos it makes aren't the best quality ever, but they're good enough. And the steadycam works fine.All in all, I'm loving my camera.", "Date": "May 25, 2007"}, {"Title": "Slim, Sleek, Easy to use--Great Value", "Author": "Park Hopper", "ReviewID": "R179H6F8AOG9ZB", "Overall": "5.0", "Content": "I was looking for a decent camera that was thin enough to put in my purse or pocket.  This is what I got!  I love this little camera.  The menus and functions are easy to use and the LCD screen is huge compared to other cameras.  When I was comparing other slim cameras with comparable mega bytes I decided to go to the store to see them all for myself before I bought them online.  Once I could see, touch, and feel them I was immediately sold on the SONY.  The other brands felt like they were made of very cheap materials and the buttons wiggled around too much.  The Sony is a solid camera and appears to be manufactured well.  The pictures I have taken have had great lighting and quality.  I am very happy with this purchase. I have been surprised how long the battery lasts and with a 1Gig card I can take an endless amount of pictures.", "Date": "May 13, 2007"}, {"Title": "Not a good choice", "Author": "A. Masson", "ReviewID": "R2HY6YBJ9ZS01B", "Overall": "2.0", "Content": "I am very unhappy with this camera.  I have a large Nikon D50 that I use most of the time, but I wanted a little camera, something that would fit in my pocket for occasions when lugging the D50 isn't convenient.  It turns out, this camera takes terrible pictures.  If anyone moves a muscle in the photo, it'll come out blurred.  I might take 20 pictures at an event, and I'll be lucky if 2 come out at all.  If you are just doing still shots of people, up close and in really good light, then this might be a good choice.  However, I've been very disappointed in the quality and the poor photos.", "Date": "December 1, 2007"}, {"Title": "Standard Camera", "Author": "K. Nicholson", "ReviewID": "R3J2C9J0KVYJUA", "Overall": "3.0", "Content": "I just bought the Sony Cybershot DSCW55 camera the other day to replace my Sony Cybershot DSC-P200, purchased in January 2006, which has already been discontinued.  I wanted a camera that would work with the accessories I had for the DSC-P200, namely the memory card and battery.  Well I just tried to memory card and it does not fit!  Battery is different also.  Grr.  Otherwise the camera seems fine for day to day purposes.I  find digital cameras, particularly those with telescoping lenses, break easily.  I purchased the third party protection plan, so I have my fingers crossed.", "Date": "October 11, 2007"}, {"Title": "Sony Cyber Shot", "Author": "Rodney K. Perry", "ReviewID": "R353I6R0BWHCR3", "Overall": "4.0", "Content": "This is my first digital camera and i really don't have any complains about it... As saying this is my first digital camera i really don't have much room for comparison, but this camera works wonders. You can take good pictures in a dark room and still have the picture turn out well. I would recommend this product for the novice user and for the advanced. It will make your pictures wonderful!!!", "Date": "October 10, 2007"}, {"Title": "Great little camera", "Author": "Donna S. Chandler", "ReviewID": "RAQ8Z1DZGWW01", "Overall": "4.0", "Content": "I have a larger sony and it is never around when you want to take a picture.  I love the size of this one and the ease of use.  The color also gets rave reviews and it you are in a group it stands out so you can find it.  Awesome pictures.  I recently was taking some moving pictures and I was surpirsed at the clarity.  Battery life and zoom are the best.", "Date": "October 10, 2007"}, {"Title": "Excellent product!!!", "Author": "Gabotron", "ReviewID": "R1WE3M9WPBJTEO", "Overall": "5.0", "Content": "Very light but very powerful camera. It takes good shots at night. You can forget about blurry pictures.", "Date": "September 2, 2007"}, {"Title": "Great Deal", "Author": "W. M. Ermine", "ReviewID": "R3DZE1X3M8XYPI", "Overall": "5.0", "Content": "This is vastly superior to the previous digital camera I had (a Canon, I think).  Most importantly to me, it takes pictures from moving vehicles and very rarely returns tracers and fuzziness.  I was also very impressed with the battery life.  We used it on a three day vacation without having to charge it at all.  In fact, we didn't even use half the battery life and we filled up a 1gb memory stick!  That's pretty impressive.Overall, I highly recommend this camera.", "Date": "August 23, 2007"}, {"Title": "Good picture, terrible construction and warranty", "Author": "S. C. Baptiste", "ReviewID": "R2EX4EY7XXZX5J", "Overall": "1.0", "Content": "I bought this late last year for use on the road and really liked the pictures it took.  I didn't use it terribly often, but always kept it in a protective case and never once dropped or otherwise harmed it.  Earlier this month the unit that holds the liquid crystals inside the screen somehow started leaking.  As I said this camera was not put into any situation where this should happen, therefore it is probably a manufacturing defect of some sort.Anyways, I contact Sony and turns out the screen is not covered by the warranty and to get it fixed I will need to pay $111... on a $175 camera I bought a few months ago.  No thanks.  Crappy camera, crappy warranty I think I'll pass.", "Date": "March 25, 2008"}, {"Title": "Gift for the Wife", "Author": "Big-D", "ReviewID": "R29MKO2QZROARJ", "Overall": "5.0", "Content": "After my daughter purchased this very camera, but in Pink, my wife issisted she get one. At 7.1mp, the quality of the pictures is more than enough. Once she read through the short and easy to understand manual, my wife became a pro at taking great pictures. She usually does not like anything fancy, but rather she prefers easy to use electronics. She loves her new little Sony and enjoys more how easy it is to operate.", "Date": "May 12, 2007"}, {"Title": "Good Value for Money", "Author": "N. Palmer", "ReviewID": "R1UVXABEMXYXRV", "Overall": "4.0", "Content": "This camera is an excellent value for money. The issues are1. The USB cable Sony preparatory, really a bad idea another bulky cable to walk around with.2. The Internal memory is not accessible when the memory card are inserted3. The Zoom does not work when the using the Video mode.", "Date": "May 12, 2007"}, {"Title": "Great Camera", "Author": "Tracey Kreuzer", "ReviewID": "R2P55WFMQ6B1NG", "Overall": "5.0", "Content": "This is the 3rd digital camera that I've owned, but by far the easiest to use and takes the best picture's.  Even on foggy mornings in California and during any movement it holds its own.  It's also a great compact shape that doesn't take up too much room in your purse or pocket.", "Date": "July 12, 2007"}, {"Title": "Great point and shoot", "Author": "Dr. Fred R. Sacks", "ReviewID": "R1AK173UY28LKL", "Overall": "5.0", "Content": "I own several digital cameras including two SLR's.  I love carrying this camera with me and using it daily.  The quality of the pictures is superb, it is easy to use, the LCD is gigantic, and the size allows me to carry it anywhere.  Highly recommend this camera!!!", "Date": "May 3, 2007"}, {"Title": "One year later...Still 5 stars!", "Author": "Paul H. \"Paul H.\"", "ReviewID": "R3754S8N4W268N", "Overall": "5.0", "Content": "One year ago I took a photo class. The teacher of the class took a few minutes to discuss what kind of camera you can take with you when you do not want to lug all of your full size SLR camera gear. The camera he used was this same Sony DSCW55 digi camera. The teacher mentioned that the most important part of any camera is the Lens.....not the mega pixel rating. As you are probably aware this particular camera uses a lens made by Carl Zeiss. Zeiss lenses are known worldwide for being one of the best lenses money can buy. I bought this camera the following weekend.One year later I am still very pleased with the camera. I have taken approx 3000 pics with it and it still works like new. It actually still looks pretty good as well. Probably due to the fact that most of the housing of the camera is made of metal not plastic.One very nice surprise with this camera is the video function. While its nowhere near HD quality it is still very good quality considering the size of the camera. Even when viewed on my 50\" plasma TV. In case you are wondering,unlike most cameras that limit the length of your videos to a pre-determined max time, you can record video for any length of time as long as you have available memory on the card. You may also mix video with photos on the same card as well.As far as picture quality goes, I feel it takes pictures Equal to or greater than cameras of a much higher pixel rating...in fact it almost takes as good of a photo as my $1200.00 canon DSLR set up.If you are looking for a small camera that takes great photos, has a great video feature, a good battery life, and is very durable. Stop looking because you just found it.", "Date": "December 11, 2008"}, {"Title": "Horrible Pictures!!!!!", "Author": "Leigh Anne Pickering \"LA\"", "ReviewID": "R2DDAOTAD6SHUT", "Overall": "2.0", "Content": "I purchased this camera a over a year ago and it has become my enemy! I loved this camera in the beginning and now I hate it! This camera takes blurry pictures no matter the circumstance! I tried everything and even flipped through the manual several times to see if I had a setting wrong. I ended up getting so disgusted with my pictures and bought an Olympus Stylus 840. I have to say that it has been a lifesaver! My pictures have not been blurry and while using the zoom option, the pictures are still clear! I would not recommend this Sony to anyone. I would recommend the Olympus Stylus with the image stabilization and the bigger lens!!", "Date": "May 12, 2008"}, {"Title": "Nice Size but Blurry Shots. . .", "Author": "NJ BEACHBUM \"BEACH LOVER\"", "ReviewID": "R1V7FFDQAD1LH2", "Overall": "3.0", "Content": "I bought this at a great price well under [$...]. happy knowing My other Sony, a very expensive ( at the time ) but older P-200 7.2mp model took very beautiful clear shots. I bought this because it uses the same type of memory stick cards and has a optical viewfinder which is important to me useful in bright lighting conditions. I have used this camera 3 times for indoor shots and every photo has been blurry to some degree. I realize the camera does not have a stabalizer but neither does my other 2 year old 7.2 mp digital that takes great pictures.  I am careful to hold camera still focusing on the subject, holding the shutter half way down first before centering the pictures so I can't imagine its me. Perhaps it is the small size that makes it harder for me to hold absolutely still to get a good photo.  I am disappointed because I bought this for indoor photos and its small size making it easy to grab on the go. I would probably stick with Canon or Panasonic from now on and most reviews agree. I would not buy this camera again unless it came with a optical stabalizer.", "Date": "April 21, 2008"}, {"Title": "great product", "Author": "Marcus Jenkins", "ReviewID": "R2M5DZYBSQ8LBA", "Overall": "5.0", "Content": "I have been using this product here in Iraq to take pictures on my mission an this unit takes great pictures and has great battery life, when used with the flash slave works even better at night", "Date": "December 28, 2007"}, {"Title": "best camera choice", "Author": "Catarina Assuncao \"Cathy\"", "ReviewID": "R30JM3RT6FRRYY", "Overall": "5.0", "Content": "If you're looking for a reliable camera with a reasonable price, you gotta have this camera. I had the previous model, W70, when accidentally someone broke it. I was pretty satisfied with that camera, so the replace needed to be at least as good as the old one. And W55 is quite similar, even better, I should say.This one meets all the above-average expectations. Nice pictures, on all sizes and resolutions. You will have a hard time to find a small camera that records such good movies, too.So the pros would be good picture quality, easy to handle, great macro shots, self-explaining menu...Cons: noisy picture when taken on the ISO (1000) option... better do a manual adjustment rather than using this ISO. Picture quality experiments a disappointing decrease when digital zoom is used.Having the coloured options just makes it sweet! I love it on black, it's a stylish choice, much better than the usual silver.If I would recommend this product? Sure do.. :)", "Date": "December 7, 2007"}, {"Title": "Worth the price", "Author": "Whereeaglesnest", "ReviewID": "REV143HM822X9", "Overall": "5.0", "Content": "I have owned this camera for a few months and have taken pictures in all kinds of conditions and even a few videos and all have been excellent to very good quality. With no image stabilizer the very good quality was more the unsteadiness of the picture taker. I found this camera very easy to understand and use. One important feature to me was not only picture quality but video since there are moments you may not have a movie cam handy but you have the picture cam right there. Recording in .mpg format was important to me as I've had one that used .mov format and found it a bit of a pain to share with others and to convert reduced quality even more.I've had no issues with this camera and hope that continues as I truely love this camera. I bought it with a 2 gig pro duo card and that is plenty for lots of fine quality pics and video storage.", "Date": "October 21, 2007"}, {"Title": "So noisy you can almost hear it", "Author": "Sailthenet \"sailthenet\"", "ReviewID": "RIN6M65ZF56U6", "Overall": "3.0", "Content": "I have owned several Sony cameras, and this is the first one to disappoint me. This was purchased to replace a Sony T7 that was lost. The camera is a convenient size, the video quality is pretty good, but the noise is far more than I would expect from a Sony. I have a Sony camera that records on CD, and it takes amazingly noise free photos at even extended shutter speeds (several seconds). That camera processes out the noise on longer exposures. This camera has huge amounts of noise above the 200 ISO, in certain colors. Unfortunately, skin tone is one of those colors, and any shots taken indoors at a high enough ISO to avoid flash will make your subjects look like they are wearing coats of many colors. The noise can be reduced by processing, but then all detail is lost. Sorry Sony, I had hoped for more. I can't recommend the camera, as I now wish I had spent more money to get a more useful camera for real world photography.", "Date": "October 18, 2007"}, {"Title": "My girlfriend love it!", "Author": "LFGD1978 \"The Shopaholic\"", "ReviewID": "R3J1XQ03LMRAR0", "Overall": "5.0", "Content": "I purchase this camera for my girlfriend for her birthday and she absolutely love it! after try the camera for a couple of minutes I end up buying one for my self (on a different color of course) the same model in black looks awesome, very high resolution, perfect size, good zoom, and the metal finish look really sleek", "Date": "September 20, 2007"}, {"Title": "Perfect Size", "Author": "M. Moore", "ReviewID": "R3H6G1VO3HXZ9N", "Overall": "4.0", "Content": "My daughter wanted a new camera for college.  It had to be slim, and easy to use.  Sony DSCW55 had very good reviews from previous customers.  Picture was clear and didn't break or have problems after a few months of use.  She loves it.", "Date": "September 17, 2007"}, {"Title": "Great Camera!", "Author": "D. Imes", "ReviewID": "RY2POF4FBWQ1U", "Overall": "5.0", "Content": "I did quite a bit of research before purchasing this camera.  It's everything it claims to be and, from my perspective, it's a great camera for the price.  The battery life is just as good as everyone raves about.  I still might buy another battery just so I can run it completely dead and not have to worry about when that happens (like in the middle of my 2-year-old's birthday party).", "Date": "September 4, 2007"}, {"Title": "The best choice ever", "Author": "Joseph G.", "ReviewID": "RRJ1A47PFVZF8", "Overall": "5.0", "Content": "If you're looking for a good camera, with a fair price this is the one you need, excellent picture quality, and also a very good interface with the PC, don't need extra software for Windows XP just plug it to the PC and windows see the camera like a Flash memory.I really recommend this camera.", "Date": "August 4, 2007"}, {"Title": "a chick camera....", "Author": "M. Hoppe", "ReviewID": "R2FAD4TZZOEVWK", "Overall": "5.0", "Content": "Beautiful product, very nicely made and very easy to use.  My favorite feature is when you change the settings a brief description is displayed on the screen so you aren't left guessing if you are using the right mode or not.The only possible drawback I have discovered is that the buttons are made for small hands, it would be very difficult for my husband to use this camera easily, but its not a problem for me, I couldn't be happier with it.", "Date": "June 10, 2007"}, {"Title": "Sony Cybershot DSCW55 7 MP Digital Camera A+++", "Author": "C. Carlson \"Codi Carlson\"", "ReviewID": "RDU650AHMCM8C", "Overall": "5.0", "Content": "If you are looking for a camera that turns on immediately and is ready to take awesome photos, then this is your camera. It is good at taking video too.  But its strength really is the photo ability.  The camera has a very small lag time from button push to snap of photo. It fits in your pocket and the photo quality rivals my MUCH more expensive digital camera.I got this camera to take to Disney World.  I did not want to carry around my large digital camera.  WOW!  Am I happy I chose the Sony Cybershot DSCW55 7 MP Digital Camera.", "Date": "June 8, 2007"}, {"Title": "Honey of a camera", "Author": "Ralph Pace", "ReviewID": "RS6DMPCN3NSHS", "Overall": "5.0", "Content": "This is a fantastic little camera - especially for point and shoot users who just want a camera to take snapshots and is not interested in becoming a rocket scientist in order to learn how to operate the camera.  A 7.2 MP and fast shutter with reasonable flash for its size, its hard to mess up pictures.", "Date": "June 7, 2007"}, {"Title": "Sony Cybershot DSCW55 7.2MP", "Author": "The FIVE \"Five\"", "ReviewID": "R25V7GG9U5EHBK", "Overall": "5.0", "Content": "Bright pictures, very small, fits in my pocket not too expensive. Great camera", "Date": "May 12, 2007"}, {"Title": "Sony is trash!", "Author": "Dan Edwards", "ReviewID": "R39QTLMI9QHOFU", "Overall": "1.0", "Content": "Six months after purchasing this camera the lens fails to open leaving me with a $200.00 (more when you consider memory stick and case) piece of junk. Google \"How to fix a stuck lens on a Sony DSC-W55\" and you will see what a common problem this is. My advice is to steer clear of all Sony products as they appear to care little about quality.", "Date": "August 23, 2008"}, {"Title": "Compact, Great Price, Great Color", "Author": "W. Sa", "ReviewID": "R8EU1A1FNF80D", "Overall": "4.0", "Content": "This camera is wonderful in most ways, compact, price, color, quality photos, and comes with it's own battery pack with wall charger. The only down fall I think this camera has is the silver colored plastic surrounding the camera. At first, second, third sight it seems to be metal but then you really don't find out until you drop it on concrete. Then crack, whoops it's plastic.", "Date": "May 14, 2007"}, {"Title": "Nice Camera!!!", "Author": "Patricia V. L. Silv \"Patilda\"", "ReviewID": "RXQIEQ9MPATR4", "Overall": "4.0", "Content": "Great Camera although its menu is not very friendly use, you have to search a lot to find a feature... but besides that it is great!!! nice pictures in such a small camera!!! great to carry around!I really recommend!", "Date": "May 7, 2007"}, {"Title": "A little bling may go ding", "Author": "D. Magid", "ReviewID": "R251FR8MLHTT6H", "Overall": "3.0", "Content": "Overall, the camera is packed with features and seems to be taking good pictures.  I have found a bluish halo around white-framed shots that I need to investigate.  The big fault I have with the camera is that it feels cheap and plastic!  My last digital camera was a Casio Slim Shot (?) that was metal and withstood wear and tear.  The Sony Cybershot is fragile, light and seemingly made of plastic which makes me wonder about the quality of the \"carl zeiss\" lens and whether it will be able to withstand living in my backpack or jacket pocket, ready for use.I dont think I would recommend this camera to everyday users and would definitely have shopped around with cameras in person before purchasing.", "Date": "March 26, 2007"}, {"Title": "Great Camera!", "Author": "Samantha S. Sillett \"Samantha\"", "ReviewID": "R177112BBHV266", "Overall": "5.0", "Content": "I bought this camera 5 years ago and used it regularly.  I just upgraded to a new model and give this one to a friend.  She was so grateful and also uses it.  This camera was built to last and has all the features on it anybody really needs to shoot pictures of their family.", "Date": "December 11, 2012"}, {"Title": "True Cybertech !", "Author": "Paul Rainn", "ReviewID": "R10OVHWM86VNZO", "Overall": "5.0", "Content": "The Sony Cybershot is my 6th digital camera and for the price it offers quite a lot of quality features in a small package.Pros:  *Palm size and lightweight, making it very portable.  *A big, clear LCD screen, viewable even in sunlight/  *Quality optical zoom lens (3x) good enough for face shots  across a large room.  *A Lithium Ion battery, very good as it provides full  power until completly drained, and no memory effect.  *Fast shutter speeds, so you don't miss out on shots.  *Simple cable connections to your TV for display, in both  NTSC (largely USA) or PAL format.  *Tripod mountable, useful when you want the camera to act  as a camcorder, or when filming long events.Cons:  *The sleek brushed metal case of the camera makes it a  little slippery, so be sure to use the wrist strap!  *The internal 56MB memory is really only good for 15-25  quality pictures or a few (3-5) minutes of video.  Of  course if you shoot at a lower pixel setting you can  more than triple your storage space, but if you can get  a 2GB memory card--less than $25 at most stores, you can  easily shoot over 75 minutes of video or store close to  2000 stills!This is quite a handy little camera, easy enough for a beginner to use with its on screen directions and intuitive buttons and offering good performance in a small package to satisfy most casual users.", "Date": "December 16, 2009"}, {"Title": "Great Camera for a great price", "Author": "Discoveries", "ReviewID": "R3UAPH734IXC28", "Overall": "5.0", "Content": "I brought this camera 2.5 years ago.  It's still in great shape and the quality of my photos are great.  I'm not a fancy, advanced user.  I just needed a camera that I could carry with me on trips or special occasions to caught moments.  The battery life is still wonderful.  I use it several times before I have to recharge my battery, which doesn't take long.  My only complaint about this camera is that when it takes a picture, it seems to take awhile for the shot.", "Date": "December 3, 2009"}, {"Title": "Great Camera !", "Author": "K. Funderburk", "ReviewID": "RQ1TF7KAORBMJ", "Overall": "5.0", "Content": "I have had this camera for over a year now. It has been very easy to use with great pictures and video. It is simple to transfer the pictures/video to my laptop and is easily compatible with basic editing software.", "Date": "November 7, 2009"}, {"Title": "great camera", "Author": "Obadiah Lacanilao \"obie\"", "ReviewID": "R2DWD8H80OK82J", "Overall": "5.0", "Content": "its a good camera. pretty durable too. dropped mine twice and pics are still good.", "Date": "September 25, 2009"}, {"Title": "Good overall Camera", "Author": "michanecash \"michanecash\"", "ReviewID": "R3G8LAKOV1B155", "Overall": "4.0", "Content": "This was a pretty good buy. I got it for my wife. The only negative is that the flash always does a burst that disorients people, babies and animals. So you usually have to take multiples to get people to look normal. Excelent picture quality and ease of use.", "Date": "July 17, 2009"}, {"Title": "Good little camera", "Author": "Adam Engels", "ReviewID": "RN47FRLKFIJPY", "Overall": "4.0", "Content": "This camera dropped out of my pocket as I was doing a keg stand and landed in the ice on to of the keg. It stayed there over night. It still works just fine, which is pretty cool. I also take this on Urban Exploration trips where it gets super dusty and dirty and so far there have been no problems (I've had the cam for two years). There are a few features I would like, but no other point and shoot camera has those features either so you really can't hate on this one for not having them. In short it's a great camera for taking regular everyday pictures of trips, parties, etc.", "Date": "March 20, 2009"}, {"Title": "This is an amazing cam!", "Author": "Crhistopher Guzman", "ReviewID": "R20I18O6EX7UFA", "Overall": "5.0", "Content": "This is the best cam that i have own it.. ever!! great picture quality, an excellent battery longlife.. purely, my best Digital Camera investment", "Date": "February 9, 2009"}, {"Title": "Great Price, Without Sacrificing Performance", "Author": "Kyle Gato \"Kyle G.\"", "ReviewID": "RV24O7JSO2IMZ", "Overall": "5.0", "Content": "The DSC-W55 was my first Digital Camera and wow, what an impressive first camera to own.The picture quality is very good, it takes pictures fast, and I put an 8 GB card into it and I can take almost 2 hours of video. The video feature really does make this a video camera as well, high quality and such.", "Date": "November 17, 2008"}, {"Title": "GREAT camera", "Author": "Amber D. Hulbert \"ambeazy\"", "ReviewID": "R25GBVFGYFNSZ0", "Overall": "4.0", "Content": "This camera is amazing... for the price you pay the quality is fantastic and I would buy one again and again!", "Date": "July 18, 2008"}, {"Title": "Great snapshot camera", "Author": "TunaMan \"Engineer Nerd\"", "ReviewID": "RFM13GEII6J1N", "Overall": "4.0", "Content": "I bought this camera for an international trip.  It worked as expected.Things I loved:- Video mode for capturing sound and the \"feel\" of a place- ISO 1000 non-flash mode- EXIF data included in JPG files- Fantastic battery life - I took 300+ photos daily and the battery barely dropped below 90% capacity (recharge nightly for heavy use days)- Form factor- Automatic focus works almost every time- easy zoom switchChanges I'd make:- Stiffer \"mode wheel\" - it was changed easily when putting the camera in my pocket- higher ISO modes - 1000 wasn't high enough to capture the night Chinese New Years parade in Kowloon China. I have lots of blurry images.- include a mode that prevents digital zoom - limit it to optical zoom capabilities - Found this setting in the menu while in Costa Rica.- motorized lens cover and zoom; seems this will be the first thing to break- Menu isn't intuitive to me - seems the menu is one of the best in the digital camera world. I've gotten used to it.- Add a quicker resolution change mode for 7, 5, 3 MegaPixel resolutions. By default, I use 3, but for fine art, I'd like to change to 7 without diving into the full menu system.- Memory should be SD, not Sony memory stick- Plug for transfers should be USB, not proprietary- Battery charger should be over USB, not external or proprietaryMy next camera will:a) avoid the Sony memory stick-based cameras and go with a SD, Mini/MicroSD based solution for compatibility with my other portable devices (Nokia N800 Portable Internet Tablet) and built-in laptop ports.b) support higher ISO modes for better night time pictures without flashc) USB for charging and file transfersOk, I've traveled to Costa Rica and Argentina with this camera and have edited my prior review slightly.  I'm adding 1 more item for my next camera - manual exposure control. Why?  Well, while in Iguazu Argentina, I found myself on a full moonlight tour of the Iguazu Falls (Argentina side). The moon light was more than enough for my eyesight to work and have beautiful views of Garganta del Diablo (Devils Throat), but none of my photos turned out, none.  I also tried a few movies - nice sound, but no, nada, moving pictures.  Fortunately, I met a couple with an SLR and was able to acquire some moonlit photos they took.  Their photos required a 2 second exposure and a steady hand.BTW, this camera produces grainy photos at ISO 1000.", "Date": "February 18, 2008"}, {"Title": "Great Price, Size and Quality", "Author": "Ewafoevah", "ReviewID": "R5PJIDS459J5P", "Overall": "4.0", "Content": "Just recently purchased and used the camera at the Sugar Bowl.  Wanted a camera that would fit in my front pocket.  The incredible part of the camera is the flash, it brightens up a night shot very nicely.  The pictures from the game came out nicely even though we were not at field level.  I was able to capture the excitement of the crowd and the game with clarity.  Obviously the zoom is only 3X but the clarity makes up for it.Pros: Size, clarity and price.  There are many features I have yet to test. The sleek style and portablity.Cons: Lack of image stablizer, the image dial moves freely coming in and out of pocket.  Had to retake some photos as a result because the flash did not go off since some image settings do not have flash.Overall this camera is a great addition for everyday use.  It is still a good idea to have a camera with more zoom for far away shots for children's events and major family trips.", "Date": "January 6, 2008"}, {"Title": "Great For Travel", "Author": "Mike Ventura", "ReviewID": "RQ0NLT41KM2IN", "Overall": "5.0", "Content": "I purchased this camera specifically for a ski trip with my kids.  It met all of my requirements.  Specifically, the camera rates high on ease of use, quality of photographs, and very high quality of videos.  It fits easily in a shirt or jacket pocket and is perfect for athletic activities.  I will take it along on my next mountain bike adventure.  The battery life is so good, that I didn't even make a dent in it shooting for 4 days.  I recommend a 2 gig memory card because you are going to want to shoot videos as well as photographs.There are some annoying vertical blue lines that appear on some videos and I am not sure if the camera has a defect or this is a problem with lens design in certain lighting conditions.  I will give Sony Customer Service a call on this.Serious photographers beware, this is a point and shoot camera only, the only manual setting is ISO. You have white balance, and focus and metering options also. Some of the programmed shooting settings might be useful, however, I shot in P (program mode) at all times.  The flash is deceptively powerful, so it can be a bit overpowering when shooting a close subject.Although small, the camera is easy to hold and operate and the buttons are laid out in an easy to use manner.  The viewfinder is invaluable in bright light when the LCD display is hard to see, a nice feature in a camera at this price.  The menu is easy to use also and seems to be very similar to the Nikon SLR menu.If you are looking for a point and shoot, compact, easy to use camera with very good quality images and attractively priced, consider this one.  Also a thumbs up to Amazon, both on price and speed of shipment (I selected free shipping and received the camera in 5 days during holiday season).Addendum: 6/9/08  The camera broke and had to be returned to Sony.  Large, vertical lines appeared in the photos.  I still like the camera, but don't think that it is very durable or will last very long before having to be replaced.  If it breaks after the warranty period I will trash it rather than get it repaired.", "Date": "January 4, 2008"}, {"Title": "sony cybershot digital camera", "Author": "C. Morris", "ReviewID": "R2VQQUJMXZN6JS", "Overall": "5.0", "Content": "i bought one for myself and took it on my trip to Ireland. Easy to use, great photos, large screen. i bought my brother(silver one) the same one and also got one for my daughter(pink color).great price for a little camera, light and compact also. USB port and charger all in the package. all you need is the memory card and camera caseSony Cybershot DSCW55 7.2MP Digital Camera with 3x Optical Zoom (Black)  great camera !!", "Date": "December 27, 2007"}, {"Title": "Amazing", "Author": "Tony Daddario \"T.D.\"", "ReviewID": "R3KLGUYJHSWR0D", "Overall": "5.0", "Content": "Absolutely magnificent camera.was bought as a Christmas present and is probably the best camera anyone can find for the money.I'd recommend this camera to anyone looking for a digital camera and actually taking great pictures.", "Date": "December 25, 2007"}, {"Title": "VERY Good Value", "Author": "Wayne Maden", "ReviewID": "R1FR0WN6GXVQTL", "Overall": "5.0", "Content": "Had this camera for about 2 or 3 weeks now and I am very pleased with it so far.It was recommended to me by a friend because of the long battery life more than anything else.  But it also takes very clear photos as well, that is if your not too shaky, but if you set it right, then it will compensate for even that.  All in all I would highly recommend this camera, I'm no camera expert by any means, had a few in the past, all film type, this is my first digital.  I didn't yet want to spend the bigger bucks to go to a high quality SLR until I found out if I would like the digital types or not.One handy thing for me anyway, is that most of the time whenevr I leave home to go anyplace, I just put it in my pocket, never been able to do anything like that before.UPDATE: Have now had this camera 3 years and only one problem. It just recently stopped working (2011) completely, thought it was a bad battery, replaced it, still same problem. So I decided to work on it the old \"tried & True\" method, I started banging it against a hard surface..STARTED WORKING AGAIN. So how can you complain against something like that.", "Date": "December 22, 2007"}, {"Title": "simple and reasonable", "Author": "Lee B", "ReviewID": "R1SV5MFMLZH8H8", "Overall": "4.0", "Content": "Since this is a sony I thought it would probably still be good even though it was at the lower end of the price range for digital camera.  My expectations were proven correct.  The camera worked out great and was $100 less than others I considered.  Thanks.  Lee", "Date": "December 11, 2007"}, {"Title": "Bang for your buck", "Author": "Michelle L. Fields \"first time digital camera...", "ReviewID": "RGS9W3KGYC8X2", "Overall": "5.0", "Content": "So far, so good. I've only had the camera about a month but I think it's excellent quality for the price. It has a lot of options and choices, takes great close-up photos,does well in a variety of lighting and the movies aren't too bad of quality. I don't know much technically about electronics but I know this is user friendly enough for me and equipped enough for my tech-savvier boyfriend. Overall, I'm very pleased. Part of the reason I bought this camera was due to reviews on this site while I researched different cameras in my price range. And I have to agree.", "Date": "December 10, 2007"}, {"Title": "Good Camera", "Author": "A. J. Bayless", "ReviewID": "R1HZOT6483SOD3", "Overall": "5.0", "Content": "My sister has had this camera for about a year and a half. When my camera died, I needed something new and purchased this one. I like that there is a rechargeable battery for it. It takes excellent pictures and it's a small, compact camera. Much better than my last one. Would highly recommend this camera to any of my family or friends.", "Date": "December 6, 2007"}, {"Title": "Great camera!", "Author": "Natalie L. Keeth \"Newmom2383\"", "ReviewID": "R1SAO7Z2ZKUI2Y", "Overall": "5.0", "Content": "I thought and read reviews about this camera for weeks.  With the arrival of our son in a month we needed something for this event.  I bought it and haven't regretted it.  It is no big hoopla.  It is a easy to use camera for taking  photos of the family.  There are a lot of extras for this camera but all I use is the video and the auto picture.  They come out beautifully.  Highly recommend.", "Date": "December 6, 2007"}, {"Title": "Sony Cyber Shot is a Great Camera", "Author": "S. Ozdamar", "ReviewID": "R3IS8W5X8GV9QF", "Overall": "4.0", "Content": "The Sony Cybershot is an remarkable addition to anyone's collection of gadgets. Its small enough to bring with you anywhere you want and can have a long lasting impact on a otherwise normal adventure out. Unlike disposable cameras one has the chance to review their pictures with out having to go through the hassle of developing them just to figure out that it is not a good picture. The Sony Cybershot has so many features and extras that allow your pictures to come out amazingly clear. I have had the Sony Cybershot for three years and it goes everywhere with me. It conveniently fits in any bag and is always important when something funny, beautiful, or unusual happens. The Cybershot has an endless amount of  features that can be mixed and matched to make the perfect picture. By fiddling around a little you will stumble upon many scene selections that you camera has. The scenes range from a lens that illuminates and captures fire in all of its brilliance, while in the next picture the snowman that you child just made can be crisp, white, and lifelike all in one.  There are nine scene selections in total all the selections include a view finder meant for large landscapes, night time, night time with a person, snow, a tropical setting, action, and fireworks. If you use these selections right then the picture has the chance of coming out ten times as better as if it were set to a regular lens setting.  Editing can be done right on the camera itself. If the picture needs to be cropped, color altered or removed to create a black and white photo in a couple easy steps it's achieved. If you decide that before the picture is taken you would wish to have it set in black and white or sepia press menus and scroll over a few and you will be able to select color options. Color is not the only thing that the photographer has control over, you can change the focus based on how fine you want the pictures to come out. The song Cybershot has a range of anything from seven millimeter, which assures the best quality of the picture and e-mail size which as crisp and clear but still captures the moment all the same. This camera is not only just a camera, it is also a  video camera. After you are done taking the picture you can upgrade to making the moment last even more with a video clip. The Sony Cybershot can take a movie that is up to an hour long. If you plan on taking an hour long movie, do not plan on taking any pictures. The movies take up a considerable amount of  memory space fast. Though the movies will be worth while, you do not want to have that ruin your ability to continue the day with pictures. I have faced that problem before, my movie was too long and very interesting...therefore I could not take anymore pictures with my friends which was annoying since  I wanted more pictures, but would not delete the movie in its place. I recommend the Sony CyberShot to anyone who loves photography or even memories. It is necessary to capture all the little extra moments in life. This camera eliminates the hassle of using a disposable camera and never knowing how the picture will turn out. You can preview, alter, and delete picture right on the camera at anytime.  The Sony Cybershot is a little pricy but it is more than worth it if you want to have mind-blowing pictures that will last you a lifetime.", "Date": "November 25, 2007"}, {"Title": "Good camera for teens =)", "Author": "Lauren W \"Nernylicious\"", "ReviewID": "R3UL5DDJIY4SFU", "Overall": "4.0", "Content": "As a teen, its cool when i can easily take pics of my friends and quickly upload them. This camera gives good pics of you even when you think u don't look so great that day. When I first got the Sony Cybershot, I was sooo excited because I researched about a lot and it took awhile before I could order it so it is definitely worth the wait. With the specific features that enhance snowy pictures, nightfall pictures, landscapes, and beach pictures, it is easy to look like a photographer without that much work in creating the perfect shot. Also, the black & white feature is great for an elegant pic. I absolutely reccommend this camera to teens!", "Date": "November 23, 2007"}, {"Title": "Awesome camera", "Author": "J. Curtis \"double dad\"", "ReviewID": "RBQUUCSYE2CZ4", "Overall": "5.0", "Content": "I bought this for a trip to Disney and was not dissappointed at all.  The ISO setting of 1000 worked great for the \"It's a small world\" ride.  Lots of low light quick pics and also for the electric light parade.  My sister has an expensive Cannon digital and she couldn't get a clear picture of the Magic Kingdom castle at night.  With this it focused in clearly and I could get a lot of pics of all the different colors of the castle before the fireworks.I also really like the display info for each of settings.  I have an older digital that has a few of the same settings on it, but you need to have the book with you to remember what each setting is for.  On this you just turn the dial and it displays clearly what each setting is used for.I added a 1 gig card to this and I can take as many pictures as I want.  It's also great to just put in your pocket for hikes and walks.  I've used it for snapping pictures while on walks of other landscaping ideas for my home.  During the day it takes great outdoor pictures.  An excellent purchase and the black is pretty cool looking too.", "Date": "October 28, 2007"}, {"Title": "perfect!", "Author": "rk \"rk\"", "ReviewID": "RNBFAMNU6O9OW", "Overall": "5.0", "Content": "this was a perfect size, color and shape for me.it takes great pictures and videos and i learn something new everyday about how to use it since am not good with reading directions.the buttons take time to get used to since their small but thats not a big deal.this is my first camera and am having a great experience.", "Date": "October 24, 2007"}, {"Title": "Great product", "Author": "Juan J. Agudelo", "ReviewID": "R2LU1CAGLGDZKH", "Overall": "5.0", "Content": "This is my 2nd camera, the first one I gave away to my sister.Works great and good price also.", "Date": "October 22, 2007"}, {"Title": "sony cybershot 7.2mp", "Author": "Melissa", "ReviewID": "R38KOOBVU7Z96Q", "Overall": "5.0", "Content": "This camera is fantastic. More than I could have expected. Picture quality is great. It has a lot of settings and capabilities, but does not leave you confused. I would recommend it to everyone!", "Date": "October 14, 2007"}, {"Title": "Sony Cybershot DSCW55 7.2MP - Highly Recommended", "Author": "S. O'TOOLE \"MEFEIN\"", "ReviewID": "R2W7YU0C7Q0C4F", "Overall": "5.0", "Content": "Great little camera, user friendly, love the styling and blue colour, battery lasts for ages, great storage capacity, large lcd screen, overall fantastic little camera, value for money. This camera is ideal for family memories - love it!", "Date": "September 2, 2007"}, {"Title": "Good for cost", "Author": "Kurt D. Schwahn \"Schwahneee\"", "ReviewID": "R1VVKAV2UH22CA", "Overall": "4.0", "Content": "Product works well.  The internal images are nothing spetacular and you need to be sure to hold still.  The image burst is a bit slow, and you must hold still.  For the price over all is a good buy.", "Date": "August 29, 2007"}, {"Title": "Excelent choice", "Author": "Alexandre A. Dekker", "ReviewID": "R3HU1Q08W6R2GZ", "Overall": "5.0", "Content": "Very fast for it's size, great pic quality, well designed. I've a Cannon SD800: sony beats canon in 3 points: user interface (much more intuitive); overall desing; price. Canon's faster and best in pic quality. I think both have the same battery life.", "Date": "August 28, 2007"}, {"Title": "Great camera for the price", "Author": "Deepika Dash \"Deepika\"", "ReviewID": "R3THJMTVO4N0PO", "Overall": "5.0", "Content": "I found this product really wonderfull. I would recommend this to anyone who is looking for a good deal in camera and does not have photographic needs.", "Date": "August 27, 2007"}, {"Title": "Well worth the money", "Author": "JR", "ReviewID": "RSNNZJ1PWPHWO", "Overall": "5.0", "Content": "The camera is very lightweight and small. It takes great pictures with only an occasional blurred picture which happens with any camera (usually due to user error). The start up time is only a second or two making it easy to capture something in a hurry. Also, the LCD screen is visible even in daylight. It is easy to use and provides explanations of what each mode is on the LCD screen when changed.", "Date": "August 14, 2007"}, {"Title": "Value for money", "Author": "Amit Aggarwal \"Amit\"", "ReviewID": "R26OMSETW7WXLU", "Overall": "4.0", "Content": "compact in size , good results with customer service of sony . Worth a buy.Value for each dollars spent.", "Date": "August 4, 2007"}, {"Title": "Digital Camera Sony Cybershot DSCW55 7.2MP", "Author": "Harold \"Harold\"", "ReviewID": "R1WB5NBC8FAXUI", "Overall": "4.0", "Content": "I've had a wonderful experience with this camera, now I can have my own photo album with high quality pictures and great resolution, it's definitely a \"must have it\" product for anyone.", "Date": "July 27, 2007"}, {"Title": "GREAT!!!! CAMERA", "Author": "Hiram De Oleo", "ReviewID": "R3HXRPS1UCMG1G", "Overall": "5.0", "Content": "first when i open the box i fell in love with this cam the blue color is great looks better in hand than in the amazon page photo.very light,strong but delicate camera.very fast,lots of features battery last a lot.huge lcd display came with cable,battery is great!!.dont look for more this is a five star easy to use camera", "Date": "July 3, 2007"}, {"Title": "Great camera!!!", "Author": "George Z. Marootian \"g\"", "ReviewID": "R25SNSVOJX8RKL", "Overall": "5.0", "Content": "Highly recommended for it's size and ease of use.  Sharp photos, high resolution and low price, make this one a winner!  Only problem is its reliance on Sony media.", "Date": "July 3, 2007"}, {"Title": "S-W-E-E-T CAMERA !", "Author": "sappho mytilene \"sappho/mytilene\"", "ReviewID": "R1AH10JV57XUU9", "Overall": "5.0", "Content": "WHAT A SWEET CAMERA THIS DSC-W55 !I THOUGHT THE P200 WAS AWESOMEBUT FOR 1/2 THE PRICEI FIND THE W55 MORE'BETTER'!REALLY ENJOY IT!", "Date": "July 3, 2007"}, {"Title": "Great Camera for the Money!", "Author": "V. Orco-Zerpa \"ilovechagall\"", "ReviewID": "RQ79FWBSR4G67", "Overall": "5.0", "Content": "The resolution is fantastic, the zoom is great. It does look a bit plastic-y, but I honestly don't mind. It's also extremely light and portable.", "Date": "July 2, 2007"}, {"Title": "Great Camera", "Author": "D. A. Valentine", "ReviewID": "R298KBV1EK40IT", "Overall": "5.0", "Content": "I love this camera. Small compact and takes great pictures. I hope it lasts longer than the last two sonys.", "Date": "May 14, 2007"}, {"Title": "WHAT HAPPENED BEWARE", "Author": "T. Householder", "ReviewID": "R174551Z8H941B", "Overall": "1.0", "Content": "When I first got this camra about 2 years ago I loved it. It took the best pictures I had ever seen and after some studing it was pretty easy to use too. Then one day out of now where after using it all the time for 8 month (taking pic of my new son) it one afternoon just stopped working. The LCD screen wopuld not turn on. Now after reading many other reviews I see many others having the same problem and although mine was out of warrenty it seems that would have not fixed it anyways. What a disappointment. I will never buy another Sony again. Buyers BEWARE!", "Date": "July 22, 2009"}, {"Title": "Fuzzy picture quality", "Author": "Bargain", "ReviewID": "RZKQ22EN7EOW5", "Overall": "2.0", "Content": "I am so disappointed with this camera, most of the pictures are grainy, especially inside pictures. Trying to return it to sony but first have to mail it to their repair center. I have an old canon 4 pix that takes much higher quality images. If you care about picture quality, don't buy this camera.", "Date": "October 18, 2007"}, {"Title": "Great size, easy to work, really poor pictures", "Author": "N. Davenport", "ReviewID": "R17KAF813PZVOZ", "Overall": "3.0", "Content": "The reviews for this camera were great, but after a few rounds of photos, I found the Sony Cybershot DSCW55 very disapointing.  The majority of the photos from this camera come out blurry.  Only about 1 in 8 photos are crisp and of a quality similar to that of my old HP 707.  Also, the camera changes modes with very little effort, so that when you pull it out of the case it may very well have gone from auto to ISO or even video, and you have missed the shot.", "Date": "August 10, 2007"}, {"Title": "Nice camera", "Author": "Kazi Al-rashid", "ReviewID": "R2IZPAWXAWUQN", "Overall": "4.0", "Content": "After a moderate research on the web I bought this camera. I was saw good reviews, nice features and thought it would be good value for money. My comments after I have used it a few times - * Picture quality is good, but main problem is it does not have any stability control, so even the slight shake of your hand may reduce the pcture quality drastically. * Picture taken in low light is good in clarity, but it seems a bit pixelized (even taken in the highest megapiels). * Video quality is also quite good for a digital camera * One thing amazed me - I accidentally dropped it twice from my hand once it was quite forceful fall, but the camera kept working fine! It reminded me of my previous Nikon, which was dropped once and never worked again :-( * LCD is big and goodI heard that the later models have picture stability control, with this feature this camera would definitely be a good buy for the price.", "Date": "July 25, 2007"}, {"Title": "Wonderful Camera", "Author": "Lisa Kemes", "ReviewID": "R6Z9EMQOM5VA8", "Overall": "5.0", "Content": "This camera takes very good pics.  I'm a little disappointed at how easy it is to take blurry pictures (if you just move your hand just a little bit).  Plus, it would be nice to have a flash or light when taking video.  But overall, I'm very happy.  Just a couple of seconds between each picture, which is rare for a digital camera.  And it only takes about 10 seconds to turn it on and have it ready to start taking pictures.", "Date": "June 27, 2007"}, {"Title": "A good slim camera", "Author": "Hongwei Jia", "ReviewID": "RSITAIMYM09TI", "Overall": "5.0", "Content": "It's really slim and can easily be put in your pocket, and the quality of the pictures is just fine.However, the workmanship is not so exquisite: when you press the top of the camera, there is some noise, it's somewhat annoying.", "Date": "May 7, 2007"}, {"Title": "great camera", "Author": "S. Rassi", "ReviewID": "R27LAMY8R2EHZC", "Overall": "4.0", "Content": "this is my second cyber shot camera and i am quite pleased.  of course being able to have a choice of different colors also made it an easy decision (i finally decided on the blue).  i haven't played around with all the settings just yet, but so far it takes great pictures.  this is also true in low light, which was a main feature i was looking for.", "Date": "May 5, 2007"}, {"Title": "Excellent camera, just a small contra...", "Author": null, "ReviewID": "R1ARO31R2TSHGA", "Overall": "4.0", "Content": "this camera is excellent, the pics are great but the play button is almost impossible to press, harder if you are a man and don't have nails. Everything else is simply perfect", "Date": "June 10, 2007"}, {"Title": "I love my cute pink camera", "Author": "C. Cope \"Crizzo4\"", "ReviewID": "R1Y7O5U425S5G8", "Overall": "5.0", "Content": "I have used the Kodak line before getting this sony camera, and I will never go back! Sony is the way to go. My pictures are almost always clear and bright, even indoor shots turn out well.This camera is lightweight, easy to use, and the manual that comes with it is excellent. Love the self timer (can be put on 2 second or 10 second delay, and flashes a convenient red light when ready to take picture), easy to use options and menu buttons, review screen is very clear, and the zoom is fantastic!!One year later update:Still LOVE love love this camera. The video quality is also great, as I've found many occasions that videos are necessary. I still highly recommend this camera for the gal on the go, this camera is worth every cent in my opinion for ease, convenience, and crystal clear pictures nearly every time! I also recommend buying the little mini tri-pod stand for low-light pictures or a group shot.", "Date": "July 10, 2007"}, {"Title": "Great Great", "Author": "S. D. White", "ReviewID": "R3GJFZGS2P5V80", "Overall": "5.0", "Content": "What a great camera!  The LCD screen on the back is huge.  The pictures are just beautiful.  No complaints.", "Date": "May 1, 2007"}, {"Title": "Sony is a waste of money", "Author": "Ericka R. Newton", "ReviewID": "R661ICJTI524F", "Overall": "1.0", "Content": "I purchased this camera 6 months ago. After 5 months of use, at my daughters birthday party no less, the screen broke. I sent it back for repair and was told my warranty was void because the damage was caused by \"impact\". I know for a fact that indeed there was no misuse or impact. I believe it was faulty manufacturing and a weak screen. So here I am after only 6 months of use, without a camera. I could pay $111.00 to have it fixed, but instead I am going to purchase a good camera. A Canon. I had my Canon Powershot Elph for 7 years. That camera had been flung around, dropped, and drooled on and it still works. So, if you want a camera that lasts, and a company with good customer service, DONT BUY A SONY. Thank you for reading.", "Date": "October 18, 2007"}, {"Title": "Great while it lasted!", "Author": "K. Barrett", "ReviewID": "R3PJSIA8VHC2Y", "Overall": "2.0", "Content": "I purchased this product in February of 2007.  It is now September and I have not been able to use it since July.  One day it just started acting really weird, the power button was flashing, which means the battery is dead, but even after repeated charging it still would not work.  I purchased a new battery to see if maybe something had happened to the original one and it still did not work.  Per Sony's customer support I sent it to their camera repair center.  Of course, they called me and told me that they could not duplicate the problem.  I told her that it would work for a short period of time only with a fully charged battery and she said the technician would wait a while and try it again.It came back 2 days later and it still doesn't work.Sony's customer support, in Tel-Aviv or wherever, told me to send in my charger to the same repair center since they claimed my camera worked correctly.  That came back as well, apparently they don't fix accessories.  The customer service guy told me that they usually just tell people to buy a new charger, which is $59.99.  The \"accessories\" are supposed to be under warranty as well though, so why should I pay for another charger when the one they gave me is faulty?Now I have to send my camera back to the repair center, again, so they can fix it for real this time.  Meanwhile, my camera still doesn't work, 3 months later.I will never buy a Sony product again, after all this BS.  I have to pay to ship it each time as well, and I am fed up!", "Date": "September 13, 2007"}, {"Title": "Great Camera", "Author": "Y. Pan", "ReviewID": "R1IA5UN4IR5D86", "Overall": "5.0", "Content": "Beautiful product, very nicely made and very easy to use.", "Date": "June 14, 2007"}, {"Title": "Extremely disapointed with this camera", "Author": "cindy", "ReviewID": "R2512PQ3IUH2TW", "Overall": "2.0", "Content": "This camera is beyond disapointement. I wish I could get my money back. I bought it for a trip to Europe. A majority of my pictures came out blurry (indoor lighting) or dark because it doesn't have a strong enough exposure. The shutter speed is so slow I missed a few pictures. On the flip side it takes excellent outdoor photos. Colors are crisp.", "Date": "December 5, 2007"}, {"Title": "Don't buy the Sony Cybershot 7.2 mega pixels camera!", "Author": "C. Renne", "ReviewID": "R6I6ZO4RHV43U", "Overall": "1.0", "Content": "I got this camera for Christmas 2008 and in less than one year the lens cover stopped opening when I turned on the camera. I had to manually tap the lens cover to make it open, and when I turned off the camera the lens cover will remain open so I had to again tap it to make it close.Most of the pictures come out blurry and grainy. The photo quality is poor. I would not recommend this camera to anyone. I hardly used it and now I wonder if I used it a lot - how many more problems would I have.", "Date": "February 13, 2009"}, {"Title": "Nothing but problems...", "Author": "Cortney L.", "ReviewID": "R16VT8AO37Z6UN", "Overall": "1.0", "Content": "I carefully researched and compared before I bought this camera - my 1st digital. I thought it would be a good camera for the price, but boy have I been wrong. I have only had it a little over a year. 6 months after I bought it the flash stopped working properly. Sometimes the flash would be so bright you cannot see the pictures and sometimes it would be too dark. Darker than taking a picture without the flash. Sometimes it would work, but very rarely. Now, 13 months after I've had the camera the zoom function has completely stopped working. In fact, if I even try to move it  - it prompts me to turn off power and turn on again.I'm just going to have to buy a new camera. What a waste of $200+!!I would not recommend this model to anyone. This is my first Sony camera and I will definitely not be buying this brand again.", "Date": "May 28, 2008"}, {"Title": "Didn't last.....", "Author": "Glen R. Harnish \"parrothead\"", "ReviewID": "R2JKOD9KPAKKMT", "Overall": "1.0", "Content": "Well even though my first cyber-shot broke within the first year, I have bought three more with no problems--until this one.  My 14 year old daughter got this one for Christmas and it lasted about two weeks.  Now when you turn it on, the lens goes in and out and the only thing you can do with it is view pictures that were already taken.  Hopefully Sony will warrant it....", "Date": "January 17, 2008"}, {"Title": "Poorly made camera", "Author": "Brian J. McCooley", "ReviewID": "R5L4E8NOUKQ9Z", "Overall": "4.0", "Content": "I purchased this camera to replace a DSC-W50 which broke.  I assumed I was too rough on that camera and thought I would try a new one and be more careful with it.  I kept this camera in a case the whole time I had it. I used it for less than 30 pictures and after 34 days I pulled it out of the case and found the LCD cracked.  I sent it to Sony and they are going to charge me $111 to fix it.  I would not buy another Sony camera again.", "Date": "October 16, 2007"}, {"Title": "loved this camera...instant click no delay!", "Author": "Lola Moonflower", "ReviewID": "R1Y9TKMIOLQNA8", "Overall": "5.0", "Content": "I loved this lil pink camera for many years...so much so I wore the buttons off...I replaced it with a new one... but it had a sec delay n didn't alway capture the pic...This one when u. Hit the button was instant...Lived itIf I could find another just like it I would buy it!", "Date": "January 7, 2014"}, {"Title": "I love it!", "Author": "A. Jacobs", "ReviewID": "R2IN81IUMUGQML", "Overall": "5.0", "Content": "When it comes to cameras, I want something easy to use but gives me a clear photo.  I don't want to mess with the fancy settings or have to take a photography class just to be able to capture clear and great photos of my family.  I had heard wonderful things about the Sony Cyber-Shot. After using the Cyber-Shot I can honestly say that I am in love with this camera.The camera comes in silver, black, pink or light blue.  Of course I chose the pink but only because purple was not an option.  The camera is easy to use and can switch settings with the turn of dial. It features movie setting, automatic setting, twilight setting, landscape setting and many more. It also features the view finder or a digital screen for viewing.  It is powered with a rechargeable battery with loading dock for it to recharge and connection cables for easy downloading of photos to your computer.If you are looking for a new camera that is easy to use but gives you bang for your buck, then Sony Cyber-Shot is worth looking into and adding to your list!", "Date": "December 31, 2013"}, {"Title": "Sony - Great Camera", "Author": "Pili115", "ReviewID": "R2VEVJO0YCI2AX", "Overall": "4.0", "Content": "I purchased this for myself and even after all these years the camera works great. The battery does drain in a day but I have traveled and used this since 2007 and I love the fact that it still works as a back up camera.", "Date": "October 31, 2013"}, {"Title": "great camera", "Author": "Amanda Moran", "ReviewID": "R323T7JE1CPFDX", "Overall": "5.0", "Content": "I Love this camera, it is easy to use and pictures come out great. I had bought one years ago, and I wanted to replace the one i broke.  I however had a bad experience ordering it used off amazon.  I received the wrong camera, and it was broken when i received it, needless to say i had to return it.", "Date": "August 25, 2013"}, {"Title": "HJAVE TO BUY A Sony sd card", "Author": "hydroshocker", "ReviewID": "RLS3ZHN83VYFE", "Overall": "1.0", "Content": "won't take any sd card. Do not like this camera because of that one issue and its the same for ps vita everything has to be Sony and 3 times normal price.", "Date": "August 13, 2013"}, {"Title": "SONY DSC W55 7.2MP Digital Camera", "Author": "Sister in Christ", "ReviewID": "R2OIFLZAQWG4LE", "Overall": "5.0", "Content": "My friends daughter broke my original, my husand and I both loved it so much that I bought two used ones for both him and me 4-years ago and we're still using the same camera's.  We have better ones for sure, but to take on our trips with us when traveling can be a bare with weight, it's perfect!", "Date": "July 18, 2013"}, {"Title": "good buy", "Author": "COFFEY-HAMILTON :0)", "ReviewID": "R2VFBTIA0YI0H0", "Overall": "3.0", "Content": "i loved this camera until it broke. it was my own fault because i dropped it. i replaced it with an updated version of the same type of camera. very easy to use and the battery is rechargeable.", "Date": "July 10, 2013"}, {"Title": "Small but powerful", "Author": "Alan Angel", "ReviewID": "R3F6H70HKQA7GK", "Overall": "4.0", "Content": "For a camera that has been replaced bu other newer cameras this camera is very powerful, and Sony should look at engineering a newer more powerful camera.  It is a good unit.", "Date": "June 12, 2013"}, {"Title": "Camera", "Author": "V. Mead \"Chiquita\"", "ReviewID": "R3MWMTURTQT7AE", "Overall": "5.0", "Content": "I so happy  with this buy.I had never bought anything used for fear of seeing the product in bad shape.Today I changed my mind, ordered this camera and came as new to me.I am satisfied with my camera it  was a perfect purchase.I will order used stuff in the future.Thanks amazon I got my camera on time  :)", "Date": "November 26, 2012"}, {"Title": "Later model is garbage! This one is excellent.", "Author": "embellishedlife", "ReviewID": "R1SWP7QIJ7YTQT", "Overall": "5.0", "Content": "I have this camera from a couple of years ago, was much cheaper than the current price ($200 less). Unfortunately, I smashed the view screen, must have put something on top of it in my handbag. I bought the later model (w530) which is such garbage I'm about to give it away; the pics come out badly no matter what.I use this model still by hooking up the av cords to my flat screen and taking pictures (small items to list online) I will buy another one of these cameras, waiting for the price to drop but apparently everyone is hip to it, the price keeps rising! I might just break down and ask hubby to buy it again for the holidays for me; he had bought the original for my birthday. If I had known what I had I'd have never put it in my bag without its case :(", "Date": "August 12, 2012"}, {"Title": "Great Pictures!", "Author": "Anonymous", "ReviewID": "RJAC0HS85RCSG", "Overall": "5.0", "Content": "This camera shoots amazing pictures.  It's pictures are at the same quality as a lot of DSLRs.Buy this camera and you won't be disappointed.", "Date": "July 30, 2012"}, {"Title": "Took good pictures, but died young.- warranty svc denied", "Author": "J. Buckles", "ReviewID": "R1W9SHL08AATNX", "Overall": "1.0", "Content": "After less than six months the flash has died with the apparently ubiquitous \"E:91:01\" error.  After trying all the \"reset\" options to no avail, I'm going to have to send it in for service.  I wouldn't have high expectations for a $40 camera, but after paying over $200, and with the \"Sony\" name, I expect better.  Picture quality and ease of use are pretty good, but Sony needs to \"have words\" with their contract manufacturer.Update 6/7/2012 -- Sony found \"corrosion\" damage when they opened up the camera.  They claim this is _not_ covered by the warranty.  The camera is only six months old, and has been used only indoors or outside the house in sunny, dry weather!  It has not been exposed to humidity, has not been dropped, has not had any liquid spilled on it.  A google search suggests this is a common problem for Sony cameras.  Sony should honor their warranty.My eight-year-old Canon Powershot still works fine and has been used under much more harsh conditions than the Sony was.I will not buy another Sony camera.", "Date": "May 8, 2012"}, {"Title": "Good camera", "Author": "Blesscyn7", "ReviewID": "R27KLIWXM19UV9", "Overall": "4.0", "Content": "I purchased this camera a while back. It worked just fine for a couple of years and then randomly stopped working. I never took it in to get fixed. Overall its a good camera for those who take basic pics. Fast shipping and delivery.", "Date": "March 12, 2012"}, {"Title": "Great!", "Author": "Mandee Dawn", "ReviewID": "R8X9TC3SEWWWF", "Overall": "5.0", "Content": "I have always been a big fame of Sony products.  My aunt has a pick camera like this and I just loved it.  The color and size are excellent!  It does exactly what I want and takes great pictures.", "Date": "January 21, 2012"}, {"Title": "My 24/7 365 Every Day Camera", "Author": "Gerald Strothers \"JerryDJ\"", "ReviewID": "R2XV0PRL0S6YQ8", "Overall": "5.0", "Content": "Sony Cybershot DSCW55 7.2MP Digital Camera with 3x Optical Zoom (Silver)As the resident writer Cleveland public transit riders blog on the newspaper website I have my Sony Cybershot DSC-W55 with me all of the time.  From \"no flash\" board meetings action shots this camera continues to impress me.It is not the world's greatest camera for macro shots but with a little patience I normally get the shot.  Long distance and sports shots are not that great but that should not be the focus of this camera for most people.People shots, posed pics are outstanding even though I truly hate fake pics this little camera delivers those with the greatest of ease.  I normally charge my battery maybe once a week even though I use this camera just about every day.  I loaded a 4GB memory card in the camera but always download my pics to computer daily.If you can find one of these buy it because most people will have no clue how good this  camera works and the quality of pictures it takes.", "Date": "December 17, 2011"}, {"Title": "Not Worth It for the Price", "Author": "Richard E. Anderson", "ReviewID": "R21Z13YJ32SP36", "Overall": "1.0", "Content": "Having enjoyed the camera for about a year, I learned after turning it on that the telescopic lenses started to actuate back and forth several times before being prompted to turn the camera off.  This repeated itself numerous times.  It turns out the lenses rings became out of tolerance and the pressure on each individual lenses triggers this action.  It is not worth sending in for repair. From here on out it will be Nikon or Panasonic.  The camera is well cared for and looks new.  Anyone want it?", "Date": "October 9, 2011"}, {"Title": "good cam", "Author": "Ryan", "ReviewID": "R1SB7A2FGCSTOL", "Overall": "4.0", "Content": "great Cam had it for a few years and is still working great good size and img qty.i not a fan of sony's memory stick just switch to sd already lol", "Date": "September 27, 2011"}, {"Title": "Love this", "Author": "Jessie", "ReviewID": "R21D78AXC6Y6L1", "Overall": "5.0", "Content": "this camera works excellent! i dont think i will ever get another. it works better then my friends very expensive camera. very glad i bought this.", "Date": "September 7, 2011"}, {"Title": "Great camera", "Author": "Meg", "ReviewID": "R1WIYE5M2PK77T", "Overall": "4.0", "Content": "I received this camera as a Christmas gift several years ago and loved it. The features are easy to use and, best of all, the picture quality is great. This camera is definitely a base model compared to other, more advanced Sony cameras, but the price is right and the quality is excellent. I was especially pleased with the video on this camera; the picture and sound were awesome! Size wise it's a bit larger than some of the newer cameras, but I could always fit it somewhere and liked that it didn't slip out of my grasp as I was taking a photo. The battery life was average, but not too bad.I just replaced this camera with the 14.1 megapixel cybershot after it was ruined at a concert, and love the new camera as well. This was an awesome model camera though, and I have many fantastic photos and videos thanks to it. I would definitely recommend this to anyone looking for a simple to use, high quality camera.", "Date": "August 12, 2011"}, {"Title": "Great Camera / Great Pictures!", "Author": "Brian", "ReviewID": "RFYQQK84G40O2", "Overall": "5.0", "Content": "I previously owned a similar camera model (Sony DSC-W50 6mp) that ended up getting handled by our kids and broken after 5 years of use.  I loved that camera and the quality of pictures that it took, especially in low-light settings and the macro mode.  We tried a Panasonic (12 or 14mp) point-and-shoot camera to replace the Sony, but didn't like the picture quality, and ended up returning it.  Luckily, I was able to find the Sony DSC-W55 on Amazon for a great price.  I believe the price was good due to the blue color - not my favorite, but not bad.  The other 'traditional' colors of black and silver were much more expensive.Pros:- The camera takes great pictures - even in low light situations (when the subject being shot is within range of the flash)!- Great macro mode - can take photos of subjects at very close range while keeping focus and picking up all detail!- Simple interface- Starts up quickly- Good quality video recording- 7.2 mp is perfect - enough to enlarge photos to 8x10 or maybe even 11x14, without creating such large file sizes (like a 12-14mp camera)- Battery lasts a good amount of time- Has a small viewfinder in addition to the rear (2.5\" ?) display.Cons:- color?I would highly recommend this camera to anyone looking for a point-and-shoot camera.", "Date": "June 12, 2011"}, {"Title": "Cybershot DSC W55", "Author": "Walter J. Paul", "ReviewID": "R3IAK4B67X92T6", "Overall": "5.0", "Content": "It was my search for this item that led me to my favorite website, and I found the camera with an excellent offer. Upon receipt of the merchandise I was totally surprised at the appearance and  quality of the camera. The seller was very truthful with his advertisement and the merchandise was Sony Cybershot DSCW55 7.2MP Digital Camera with 3x Optical Zoom (Silver)outstanding in appearance. Like new.", "Date": "April 18, 2011"}, {"Title": "Good while it lasted", "Author": "neopolie", "ReviewID": "R3S9CQ36I7K05M", "Overall": "3.0", "Content": "I am a casual camera user. I do not think I take the BEST care of my electronics, but I am pretty sure this camera did this on it's own.  I notice that other users online have complained about the same problem:  The lens goes in and out, and says that it needs to be turned off.  I have had it 3 years, but it was not used often, so just be prepared for this to happen (other people online said it has happened as early as 18 months)", "Date": "March 13, 2011"}, {"Title": "Great Camera", "Author": "Silena Buckelew \"Lady Multi\"", "ReviewID": "R7FD23UQNEH21", "Overall": "5.0", "Content": "I'm going to make a long story short and try to skip the long winded reasons why this camera is great.  Recently I have been looking to buy a new camera to REPLACE this one.  Curiosity had me finding this page as I was curious to the price tag this camera had on it (finding that it hasn't changed much at all)...Anyway, I've had this particular model of camera for almost five (yes, 5) years.. Mine still works perfectly. I have had no problems at all.  The camera, its functions, and the battery that came with the camera all still work just like they have for 5 years; its been up and around mountains, on roller coasters, and buried in the bottom of my purse on cold/hot days and its still just as good as day one.This was the 1st Digital camera I ever purchased, and it was well worth the money I paid for it.  And because of just how well it has worked for the past few years, I will not be in any need to replace it.  I hope to enjoy this camera for a couple of more years before upgrading.", "Date": "February 26, 2011"}, {"Title": "The best Point and Shoot Camera EVER", "Author": "Mindy \"Mindy\"", "ReviewID": "RW21JU7U4DNOL", "Overall": "5.0", "Content": "Wonderful pictures, enough said.  I have and will always recommend this camera.  I've had one problem, it was within warranty and Sony fixed the flash.  A few years later and it still works perfectly despite accidents.  The macro function is certainly better than professional camera's in a lot of circumstances!", "Date": "February 23, 2011"}, {"Title": "Awesome camera", "Author": "Brandon", "ReviewID": "R2D50RYYP2XPFY", "Overall": "5.0", "Content": "Well I've gone through 2 of these cameras because the 1st one I got into a motorcycle crash and it was in my pocket and the impact messed it up. so I bought another one and have had for a couple of years now. Great picture quality, very easy to use and great video quality as well.", "Date": "February 22, 2011"}, {"Title": "Great Camera", "Author": "Nicole", "ReviewID": "R1RAHDP3WTPIMO", "Overall": "5.0", "Content": "I got this camera in 2007. So three years ago. Although Amazon has it listed at over $300, I paid $180 without tax & what not. Its a great camera. I absolutely love it. Its almost never given my problems. I took it to Warped Tour this past summer...I charged it all night the night before. I was taking pictures from 7AM to 8PM. It lasted the entire time. Not only that, but I was in a mosh pit at one point. It took great pictures even if I couldn't keep my hand steady because of all the pushing and what not. The lead singer didn't stay still at all while he was on stage, and I still got clear pictures. Sound is GREAT. Not to mention,I've dropped it A LOT. I think I even dropped it on the first day I got it. I love this camera! Sadly, it recently stopped turning on. But, I ordered a new Sony Cyber-Shot DSC-W330.Overall, I'm very happy with this and I think I'll be sticking to Sony products.", "Date": "November 27, 2010"}, {"Title": "Great macro photos", "Author": "J. A. Smith", "ReviewID": "R1WQXD93LR7POC", "Overall": "4.0", "Content": "This little camera is the first one I owned that was small and easy to carry and use.  I have taken some great nature shots with the macro lens.  When my first one was damaged by sand on the beach, I ordered this one to replace it because I love the macro shots that it takes, and I already am familiar with how to use it and load the photos onto my computer.", "Date": "September 17, 2010"}, {"Title": "love my pink Sony cybershot!", "Author": "Rumakiw68", "ReviewID": "R38JHE8SD67XE5", "Overall": "5.0", "Content": "I love this camera! it has so many functions, but is so easy to use! I've never been the type to read owner's manuals and won't start now but it really wasn't necessary. This camera takes beautiful pics in every type of light, too! Cautionary tale: use the wrist strap! I dropped it while in use and the lens was stuck out and it wouldn't turn on. Since it was out of warranty with Sony, I sent it to a guy on ebay who fixed it for a flat fee of $65 (versus the starting price of $91 Sony wanted). He replaced the main system board and it is as good as new! I read over the negative reviews here and find them impossible to believe! I think they work for competing companies! LOL When the time comes, I will replace this camera with the newest Sony cybershot available!", "Date": "March 26, 2010"}, {"Title": "Battery issues", "Author": "D. Darcy", "ReviewID": "R3NM75L62FWEG", "Overall": "2.0", "Content": "I like the camera for its design but the power is quite fickle.  It will turn on occassionally and even after changing the batteries it will only turn on sometimes. That's not okay when you are trying to get candid shots. Short battery life and they do not recharge well.  I plan on contacting Kodak for advice.  There's nothing in the manual about power problems.", "Date": "March 11, 2010"}, {"Title": "\"Stands out in a Crowd\"", "Author": "BigMCarr", "ReviewID": "RBVYCQSD1B92G", "Overall": "5.0", "Content": "This little camera, takes great photos, small yet stylish!Beautiful Color and Nice Camera Case.Never gets lost with other cameras, when visiting with familyand everyone is taking photos.Lightweight enough to carry with you all of the time!My Camera Case came in pink, which I like better than the black one,as in the attached photo.", "Date": "February 23, 2010"}, {"Title": "Macro, concerts, art, video, it does it all!", "Author": "M. C. Dunn", "ReviewID": "R36DDDRDY1WB9G", "Overall": "5.0", "Content": "This camera is amazing for its size and cost! Mine has finally died after 2 years of heavy use (and I wasn't too gentle either...I took it into mosh pits). Well, the whole camera didn't die, but the screen finally cracked. This camera has always surprised me with the quality of its shots. To see excellent examples of what this camera can do, I have posted the pictures I have taken with it on this site: [...]If you are a beginning amateur photographer, I highly recommend this camera or something like it.", "Date": "February 26, 2009"}, {"Title": "Great Product", "Author": "David E. Ogron \"David Ogron\"", "ReviewID": "R15V6DOCJMVADC", "Overall": "4.0", "Content": "I bought the same camera in black. A great camera. It's small and can be fit in your pocket easy, although I would strongly suggest you buying a case for it. The case has gotten cheaper since I bought it. I do have to mention that I had a problem with the lens. On a random day, I recharged that battery and slide it back into the camera. The lens went in and out constantly when I turned it on, and meanwhile, the screen was displayed \"Accessing\" or something along that line. The warranty had ran out but the camera broke within 30 days after the warranty was out. So I called the Sony company just to see if they will repair it for me. They eventually made an accommodation for me and and repaired it for me a not charge. Although I did have to pay for shipping to the Sony repair center. When I got my camera back from the repair center they gave me a 90 days warranty.Over all, I am still very satisfied with it and the Sony company customer service.", "Date": "January 28, 2009"}, {"Title": "I love it! Just great!!!!!!!", "Author": "Elaine Rosario \"Elaine Rosario\"", "ReviewID": "R1NI055PMZRR61", "Overall": "5.0", "Content": "This was my second purchase on the online sales business, i am sooo pleased with my camera, it takes beautiful and amazing photos, great resolution, the battery last charged a lot of time, i don't have any complains!!!", "Date": "January 12, 2009"}, {"Title": "3 DIFFERENT MECHANICAL PROBLEMS", "Author": "JOHN KING \"jkallday\"", "ReviewID": "R2UD37RX8797ZL", "Overall": "2.0", "Content": "I actually have a different model, the 6.0 MP version purchased 2 1/2 years ago. But it looks exactly the same, so the mechanicals are probably the same. It was a great little camera while it lasted. Great pictures and great battery life. And as far I'm concerned, 6 MP is all I (and probably most people) really need.After exactly 12 mos the rotary function switch started to act up, switching between adjacent modes unless I kept pressure on it with my finger. It got worse with time. Then I had the apparently common \"stuck lens problem\"; the fix is to bang it on the table, which worked. Then, last week, the shutter button broke off while it was in my wifes purse.So I'm in the market for a new camera; it won't be another Sony.", "Date": "November 30, 2008"}, {"Title": "love this camera!!!", "Author": "Martha Smith", "ReviewID": "R6SE7LXEF0GAR", "Overall": "4.0", "Content": "I bought this cammera almost a year ago and it has been awesome...one of my favorite things about the camera is the beach setting. Since i live near the beach i spend alot of time there and the pictures really show the rich blue color of the water and there is rarely any blur. The one thing that this camera lacks is capturing in dark situations. When it is dark the pictures often become blurry with wierd streaks of light. Besides that I love this camera...it is tiny so it fits anywhere...it is durable (trust me i have dropped it several times)...and the battery stays charged for long periods of time.", "Date": "September 7, 2008"}, {"Title": "Great camera!", "Author": "Silver Toe", "ReviewID": "R1MF58XEHVPRA6", "Overall": "4.0", "Content": "I got this camera as a gift nearly a year ago, and I've taken it all over the place, including in my pocket all around Europe.  It has not let me down once.  It takes good pictures and turns on quickly which is important when traveling.  It's small enough to fit in your pocket and isn't bulky when put in a similar sized case.  The only criticism I would have with this camera is that it can be somewhat sensitive to lighting conditions or can sometimes produce blurry pictures....but on the whole, I would recommend this camera as being a great point and shoot!  It also takes decent video as well.  I loved being able to select the blue color for the camera as opposed to the usual black or silver, which I thought was a nice feature that makes my camera unique, even from an aesthetic standpoint.", "Date": "September 3, 2008"}, {"Title": "Noice cam but annying red lazer light", "Author": "L. Green \"Bird-Knuckle\"", "ReviewID": "R1M5S804HOZEYJ", "Overall": "3.0", "Content": "I got this camera for my girlfriend and she loves it. It's cute, small, and slick looking. And  most of the photos taken with it look pretty good.  My one complaint with it though, is that when you hold down the button to take a picture it shines this red lazer light into the eyes of the people getting their picture taken and then it goes off...and then it snaps.  So not only do they have to squint and hold their pose but then the red light tricks them when it goes off and they start moving about just as the snap actually happens.", "Date": "September 3, 2008"}, {"Title": "whoops, not what I thought", "Author": "C. Gerstenschlager \"csg148\"", "ReviewID": "R5XIWMFPSV6SQ", "Overall": "2.0", "Content": "I must admit that after first purchasing this camera I thought it was a fairly good purchase, however after a recent trip to Disney World with the kids I have to express my new opinion and its not good.  After our return home I attempted to print out some of our memories and found that the pictures, which looked wonderful on the viewfinder and on the computer, were of the poorest quality.  We bought this camera to replace a cheap 3 mp Kodak easy shot, I wish I still had that camera.  The kodak's printed shots far surpassed the Sony (both from the same printer).  Needless to say we are in the market again for a new camera.  Unfortunately one area you dont want to go wrong, especially with the kids, is with a camera.", "Date": "August 23, 2008"}, {"Title": "So close to perfect !!", "Author": "Todd W. Roat \"a_gunslinger\"", "ReviewID": "R2L6GUIOI8EE3U", "Overall": "4.0", "Content": "Love this camera!  Great pictures, features and usability.  The only [huge] problem is the battery pack and not being able to use basic AA batteries.  Even with buying 2 battery packs and trying to always keep one charging, we are always running out of battery power at key times, and often the backup battery is not on hand.  Missed a lot of great shots that way.  Would be the PERFECT camera if you could just use AA batteries.", "Date": "August 12, 2008"}, {"Title": "Worth the money?...maybe.  Worth your time trying to figure out how to download the pictures onto your computer?...no.", "Author": "Daniel T. Gregg", "ReviewID": "R3NBYFTE1KLAWI", "Overall": "3.0", "Content": "I loved the camera until I couldn't download the pictures onto the computer.  Why buy such a great camera for such a great price that wont even let you download the pictures onto your computer?...because all it leads to is great disappointment.  I think a great picture phone would even be better than this camera.", "Date": "July 27, 2008"}, {"Title": "warning", "Author": "Diana Caballero Hernandez", "ReviewID": "R3IW1OIN6D8YFN", "Overall": "3.0", "Content": "I bought this camera last december for an incredible price, it's a wonderful camera, worthy the money I paid for it BUT...you need to be warned, today my camera just stopped working for no apparent reason, when I turn on the camera the lens come out and go back at least 3 times, an \"access\" legend appears on the screen and finally the camera starts beeping and says turn off and turn on again, you can go and see the stored pictures but you can't take pictures anymore.The reason I am warning you is because while searching ways to fix it I learned that this is a very common problem with this camera, SONY needs to take care of this issue.", "Date": "July 23, 2008"}, {"Title": "Its very testy", "Author": "Katherine E. Crumley \"Katie\"", "ReviewID": "R3T7N0ZL8SRNOR", "Overall": "2.0", "Content": "I got this camera in March. It's my second digital camera, I lost my first one, but had been thinking about getting a new one for awhile. I have been very disappointed with the testiness of this camera. First off, I had it as a bar and someone dropped about 5 drops of a drink on it and the zoom function refused to work. Eventually that cleared up. Then, I brought the camera to the beach and the lens would not stay open-- the camera would read \"access, please power on and power off\". Apparently you are not supposed to expose the camera to sand. My old camera was at the beach 6 times a summer and never had an issue.  I took the camera to the repair shop and after a $25 estimate was told that it would take $125 to fix a $175 camera. Frustrated, I took a can of forced air and managed to clear the sand out of the lens. If I had to do it again, I would not buy this camera. I have had nothing but problems. The picture quality is a bit better, but its not the pain it has caused me.", "Date": "July 11, 2008"}, {"Title": "Sony Cybershot DSCW55 7.2MP Digital Camera", "Author": "Marilou Z. Secoquian", "ReviewID": "R3MVRGWQ8ZQSOV", "Overall": "5.0", "Content": "Highy recommend !  I have one of this my self and2 other are gifts for my closed friends.", "Date": "June 21, 2008"}, {"Title": "Wonderful Camera!!!", "Author": "MaR", "ReviewID": "R229U94VCG1OM9", "Overall": "5.0", "Content": "After almost 4 years owning the P100, I decided it was time to get a new camera, mostly because my husband and I had been sharing it and sometimes we both need it. Also, I wanted something smaller that could easily fit any purse. I almost went with the W120 but to be honest I wasn't sure if I needed some of the fancy functions. Plus I got an awesome deal on the W55.Anyway I was hoping the W55 would work as good as it looks, and I'm glad it does! So far I have no complaints, it has pretty much the same functions as the P100, and a much bigger screen which I love. Another review mentioned the buttons being too small and I have to agree, I usually push the playback button with my nail and not my fingertip.I take most pictures with flash so I can't comment on the blurriness a lot of people talk about, but I don't think it's that bad, just a matter of finding the right setting and using a tripod if necessary. Just be careful when taking video, it will do it with the settings you last used for taking pictures (such as black & white). I am very happy with this camera and I am hoping it will last for many many years!", "Date": "May 15, 2008"}, {"Title": "dsc-w55", "Author": "Larry W. Nutter", "ReviewID": "R2O382GDXQSAH9", "Overall": "5.0", "Content": "have been using this camera for a few months now and it is one of the best i have ever used. easy of use is the best feature. i have dropped it a few times and it still works like new. i also like the fact it has a viewfinder for use in sunlight.", "Date": "May 5, 2008"}, {"Title": "Loved it, Now Hate It", "Author": "serc \"serc\"", "ReviewID": "RKDKJBT3K48AV", "Overall": "3.0", "Content": "My husband bought me this same camera, but with 6.1 megapixels.  I LOVED the camera.  Easy to use and my pictures came out great.  The problem came 18 months later when I went to turn in on and a message reading \"Access\" came on and the screen went black.  I went onto the internet to see what the problem could be and there were THOUSANDS of people posting with the same exact problem.  Most of their cameras were less than 2 years old too.  Many had sent their cameras to Sony to fix it and Sony says it was unfixable and gave the customers no accommodations for a camera that broke with less than 2 years of use.  I need to get a new camera now and I though I loved the quality of the pictures, I am afraid of getting another dud from Sony.", "Date": "May 1, 2008"}, {"Title": "Not worth the $$$", "Author": "Gath \"Gath\"", "ReviewID": "R3AQ6TMW9MCXEG", "Overall": "3.0", "Content": "I only bought this model because it was a gift for my daughter and she was sold on it small size and looks. There's better models available (Canon, Fujitsu) for at or less than the same price.  It doesn't take a good picture at anything less than ideal conditions, it uses a proprietary battery so you  can't pop in standard batteries when it goes dead.  Same for the memory card, everything else I own uses SD cards except this one device.  And Sony's memory cards are nearly twice as expensive as well.Pluses: it is easy to use, it does have a nice interface that I like.  And when the conditions are just right, plenty of light, nothing moving too fast, etc, it can take good pictures.  But typically, 1/2 the pictures are blurry and grainy.", "Date": "April 21, 2008"}, {"Title": "Sony Cybershot", "Author": "T. Haynes", "ReviewID": "R24XWGR42THJXC", "Overall": "4.0", "Content": "I love the simplicity of my new camera.  I only wish it had a stronger zoom.", "Date": "April 11, 2008"}, {"Title": "Easy to use, lots of features, very handy", "Author": "Jennifer J. Knapp", "ReviewID": "R2IPW6VTX6NW1O", "Overall": "4.0", "Content": "Anyone looking for a point and shoot camera, this is a very good choice. I like to take pics everywhere I go, and this camera can be carried in your pocket it's so tiny. Plus it's easier to use than any other digital camera I've tried and it has all the features you would want. It takes very nice pictures of landscapes, people, and pretty much everything. The downside is that the pictures will come out blurry if you don't hold the camera completely still, and I would imagine it would be hard for someone with larger hands to opperate it since the buttons and camera itself really are very very small. Also, it's not water-proof or drop proof. The size of it makes it easy to slip out of your hands, so you have to be pretty careful, it's very delicate. Other than that, it's a nice choice at a good price. :)", "Date": "March 28, 2008"}, {"Title": "Great little camera", "Author": "Marsaya L. Toth \"Marsaya\"", "ReviewID": "RMJOQHSGT0JT3", "Overall": "5.0", "Content": "Bought this camera semi-used. It is a great little camera. Easy to use....if you want to use the automatic setting or if you want to get a little fancier. Whatever the case this camera does it just fine. Easy to carry. I got the memory stick with this and it is great for holding at least 500 pictures. I have had some of my pictures printed and they came out GREAT! The battery lasts quite long and the best part is that it's rechargeable. I would definitely recommend this great little camera.", "Date": "March 5, 2008"}, {"Title": "FINALLY!  a digital camera that takes great shots!!!", "Author": "Noneya", "ReviewID": "RVA343EVUVA36", "Overall": "5.0", "Content": "Finally a great camera that takes great shots!! This is my 2nd Sony W55 camera. My first one I bought on ebay used, I should have known better! That one eventually, the lens kept popping in and out and the camera wouldn't function. I'm hoping this won't happen to this camera. I went to Circuit City this time to buy it though, and purchased the 2 year warranty. I've gone thru 6 digital cameras in 4 yrs. This is BY FAR the best quality of pictures! My first digital camera was also a cybershot but it was a 3.2mp (i forgot which model) It was a good camera, however, not great at close up shots, and evening pics. And eventually, that lens stopped working for me also. Sony has yet to prove me wrong that a good camera can last longer than 3 years!!! If you do ebay, as I used to in the past, this is a GREAT camera for that!!! I used to have to always \"fix\" my pictures after I took shots. This camera, I never have to do any editing. I ALWAYS have red eyes in everyone's cameras, this one. I haven't seen one picture yet! Maybe I've been lucky to take pictures in better lighting perhaps. Anyhow, the reason I got this camera is of course the reviews, but my biggest reason is for evening/dark shots. Takes FABULOUS night shots!!! I also have an Olympus FE-210 takes good pictures, however the night shots. IMPOSSIBLE!  Anyhow, for the price, this is really a great camera. I haven't quite mastered all the \"special\" things about it yet. But for me, #1 rule for digital camera has to be that it takes great general shots. Anything \"special\" is just an added bonus that I will rarely use.", "Date": "February 29, 2008"}, {"Title": "Replacement", "Author": "Tracy Song", "ReviewID": "R35XDL56SH65AR", "Overall": "5.0", "Content": "I bought this to replace my original cybershot that was the same, but with 6MP, that was broken by a child in malaysia. So, I'm pleased with it and it was cheaper than my original one though new and better. =D One thing that some might not like is that it doesn't have the option to pick a color and then only produce that color in whatever the shot is. I heard that's only in canons? The flash flashes a few times (to get a good shot I imagine) and it only really bothers me when I'm trying to get a shot of something that won't stay still for very long and if I turn the flash off, then it's dark and blurry but, I make do. Over all, I really my cybershot and I think it's quite simple to figure out if you play around with it. Nice small compact size, bigger screen than the 6MP one, and the hole to hang a wrist strap or other things is at the corner and does not portrude out of the rectangular shape as the 6MP does.", "Date": "February 28, 2008"}, {"Title": "cybershot is good", "Author": "Sassyspic \"Carryna\"", "ReviewID": "R1R4VAUA0HD7IQ", "Overall": "4.0", "Content": "I love it. I haven't figured out what all the buttons do yet, but I love it.", "Date": "February 26, 2008"}, {"Title": "EXCELLENT CHOICE", "Author": "Jeffrey Rodriguez \"Sir.JeffrOD\"", "ReviewID": "R3TXBU9RD6NN6Y", "Overall": "5.0", "Content": "this is an excellent choice, if your looking for a compact easy to use, quality camera. I recommened it.", "Date": "February 25, 2008"}, {"Title": "Great Camera", "Author": "R. Clark", "ReviewID": "R27F7X7Q6P49VA", "Overall": "5.0", "Content": "I have had this camera since Christmas and I pretty much love it! It takes good pictures on it's automatic, and also offers lots of options for others, such as snow (which we got a lot of this winter and I got great pictures!) It has a great little movie setting, which is perfect for grabbing up quick when my 2 year old is doing something cute. I have been very impressed with the quality of pictures so far. My mom liked my camera so much, she went out and traded her Kodak for a Sony, which she loves as well. I think this is a great basic camera that takes quick shots and is very easy to use!", "Date": "February 19, 2008"}, {"Title": "Works so well I bought a second one!", "Author": "Discriminating Shopper \"Walter\"", "ReviewID": "R99697K3ZOVF2", "Overall": "5.0", "Content": "I purchased my first DSCW55 last year to use on a skiing trip to Whistler, BC.  Took it up the slopes and around with us on a snowmobile excursion.  While it got a little damp, I had it in a carrying case and this little gem has worked perfectly ever since.  Use a 2GB memory stick and the photos have been great.  But, my kids love it so much they take it up skiing and use it for videos - so I never see my camera anymore.  So I bought one of my own with some frequent flyer miles and I'm still very happy with this camera.  Was trying to hold out for a Nikon D40 but the itch got to me and I've never been very good with an SLR so Sony it is.  My new camera arrived, works perfectly out of the box, and today I look on Sony's web site to find out you can't buy this little guy from them anymore.  So if you want one, get it quick before it gets replaced with more bells and whistles.  This does everything I need it to, and the menu system is easy to use.  My only drawback - my older eyes need reader glasses so I have to hold it at arms length to read the setting dials.  Just got a monopod for it and I'm looking forward to shooting some kids' baseball games this year.  Battery packs are really solid and hold a charge.  I have 5 between the two cameras but have never run out of battery life yet.  Make sure you fully charge the packs when they come to you, before you start using them.  I'll stick with Sony - great product.  Using the macro feature for flower closeups and the wife uses these for crafting - great shots.  Thanks Sony!", "Date": "February 12, 2008"}, {"Title": "Works well for about 10 months", "Author": "A. Meidlinger", "ReviewID": "R34P1JPI33MXJN", "Overall": "3.0", "Content": "We went on several vacations last year and took thousands of pictures. After about 10 months some of the features stopped working, the settings would jump around on their own and there was a long lag time between shots. We replaced the memory card, but the lag time remained. Overall, it worked well during the 10 months, but would recommend a service warranty if you are going to use it a lot.", "Date": "February 12, 2008"}, {"Title": "Sony CyberShot DSCW55", "Author": "Jose V. Llovera \"Jose V. Llovera\"", "ReviewID": "RDOYMN5SPP939", "Overall": "5.0", "Content": "Beauty Camera, small with a big screen, with good zoom, easy to take pictures in some conditions, I'd like the old type wire to connect to TV and down images to the computers, try to be careffull with the wire. Good price and received just on time.", "Date": "February 11, 2008"}, {"Title": "Satisfied!", "Author": "Krista.V", "ReviewID": "R1YOWEUXVQ7621", "Overall": "5.0", "Content": "Good-looking camera that has a lot of picture-capturing options and is easy to use. Light and easy to take around. Great for those who just want to record memories, family/friend outings, celebrations, family photos, vacations, etc. Basically, it's a camera for those who want something reasonably priced, light, easy to use, fast, and captures with great detail and vibrant color.Advantages: Takes GREAT macro pictures. I used it to take pictures of my lovebird in extreme close-up and she came out beautifully. The details of her feathers all showed and her beak shined. This isn't a camcorder but I'm really pleased with the video quality (as long as it isn't extremely far away). Even when uploaded my videos looked good. I was surprised by how well it works in low lighting, indoors, without flash. Of course light is still needed and the subject can't be shadowed but if your taking pictures indoors, at night, with a bit of light (say a Christmas tree or at a dim restaurant), then the picture will come out naturally and visible.Disadvantages: Doesn't take excellent faraway pictures with the zoom option mainly because the zoom is weak. Not for those who want a \"professional photography as an art\" sort of camera since this is made for capturing memories within a few yards range.Overall, I'm very happy with it and I think it's worth the payment.", "Date": "February 10, 2008"}, {"Title": "Very good", "Author": "Oldemar Zuniga", "ReviewID": "R1ZSIRHDQ67EFY", "Overall": "5.0", "Content": "The quality of the camera is very good and is good looking. I am very satisfied.", "Date": "February 9, 2008"}, {"Title": "I just adore this camera!!!", "Author": "Randolfo Mendez \"Randi\"", "ReviewID": "R2C49MUFBYPSIX", "Overall": "5.0", "Content": "I think this is all an amateur photographer needs. Excellent price and takes awesomne pictures. I used to have the DSC-W50, 6.0 MP, no big difference but the black color looks interesting, I've been also trying another brands and definetely Sony will be my favorite!!", "Date": "February 8, 2008"}, {"Title": "Sony Cybershot Digital Camera  7.2 MP", "Author": "Suzanne G. Warner \"Suzanne W.\"", "ReviewID": "RYN9CVSII17LO", "Overall": "5.0", "Content": "I bought this camera for my husband at Christmas.  He had given me the same one for last Mother's Day.  I love the resolution, the option of taking short videos and the different settings that are on the camera.  Very high resolution and GREAT picture quality.  Highly recommend you buy this camera!You won't be disappointed!", "Date": "February 8, 2008"}, {"Title": "Great little camera", "Author": "D. Dobson", "ReviewID": "R2FWWET5VMPYP7", "Overall": "5.0", "Content": "This is a great camera for the money.  The pictures are clear and it takes great video too.  Nice features.  Doesn't have the \"Steady Shot\" like the DSCW80 but we haven't missed it.  Don't forget you will have to buy a memory stick for this if you want to take more than a few pictures before downloading to your computer.", "Date": "January 31, 2008"}, {"Title": "I love this camera", "Author": "gabyur", "ReviewID": "R23KOKEBOWD5Y3", "Overall": "5.0", "Content": "Its so cute, it looks pretty.I am not a professional so i can talk as a normal costumer,so from my point of view the pictures have a really great quality.", "Date": "January 30, 2008"}, {"Title": "Great camera for the price", "Author": "TLM5", "ReviewID": "RGMW5R6QGVXB5", "Overall": "5.0", "Content": "I bought this camera for my oldest son for Christmas.  For the price, this is a great little camera.  He brought it on our vacation and the pictures turned out great.  It's really easy to operate too!", "Date": "January 28, 2008"}, {"Title": "Great buy!", "Author": "Angie MacLeod", "ReviewID": "R35RAC4EACT4YM", "Overall": "5.0", "Content": "This camera is small enough to fit in pocket or purse yet takes great pictures.  Very satisfied with this product.", "Date": "January 26, 2008"}, {"Title": "GREAT!!!", "Author": "Lance C. Rivera", "ReviewID": "R17RC1KET4UZ3Y", "Overall": "5.0", "Content": "my daughter got this sony camera for xmas and just LOVES it. so eazy to use. she is in leadership for school and is incharge of spirit days. this requires her to take,print,and arrange many different pictures and she does this all by herself. i highly recommend this camera", "Date": "January 25, 2008"}, {"Title": "So so...", "Author": "Jelosamkr", "ReviewID": "R3JM2IAXB40P8K", "Overall": "2.0", "Content": "hi.. i bought the european version of this... the w85.... but i see they are both the same... i want to just say that i was disappointed by the image noise at any level... not like my previous w5 of such a great image quality... so even in daylight i'd see noise with this w85/w55.. i guess it's ok for the ones who just want to take a picture and  keep a souvenir...", "Date": "January 24, 2008"}, {"Title": "excellent choice", "Author": "V. Avila \"Mom of two\"", "ReviewID": "R4H2EWM5DNTZE", "Overall": "5.0", "Content": "as always SONY made an excellent product, this camera isn't only pretty, but light and with an amazing resolution, the images come clear and very beautiful, it brings 54MB memory in the cam, so you can take about 22 good quality pictures.", "Date": "January 23, 2008"}, {"Title": "Little camera and very well performance", "Author": "Jorge Roman", "ReviewID": "R3DN5PSX7PGSHG", "Overall": "4.0", "Content": "A small camera with good performance, the picture may seem thinner, but it is relatively wide for the lens. The battery lasts acceptable and is highly recommended for beginners in photography.", "Date": "January 23, 2008"}, {"Title": "A great digital camera", "Author": "Veronica Y. Rosado", "ReviewID": "R2D58O2TN65IFQ", "Overall": "5.0", "Content": "I've had this camera for 10 months now, and it is one of the best things I've bought.  The pictures are great, no red eye.  Time lag is good, especially since I have a  3 month old baby. I'd recommend a 2G memory,especially for taking a few videos.  The colour pink is my favourite.I keep getting compliments form friends who see my camera. Great buy for a good price. Strongly recommend.", "Date": "January 22, 2008"}, {"Title": "The best ever", "Author": "Sanne Peeters", "ReviewID": "R2K7ESH78HTPI4", "Overall": "5.0", "Content": "This camera is by far the best I ever had.It's small, light, has a very nice design and is very easy to use. It has cool options like the slide show possibility with music and stuff. The screen is large and very clear.", "Date": "January 20, 2008"}, {"Title": "Great camera", "Author": "B. Durham", "ReviewID": "R2E3GJ9VA8211Q", "Overall": "5.0", "Content": "I purchased this camera a couple of days ago on my deployment to the middle east and I have to say for the price it is an amazing camera.Wonderful clear crisp images.It does feel very light.some reviews I've read said they didn't like that.But who really wants to carry around a heavy camera in there pocket.BUY A CASE WITH IT!!! 3 of my friends bought these here and from walking around with it in their pockets 2 of their LCD screens got cracked.Sony will not replace them.good investment.", "Date": "January 20, 2008"}, {"Title": "Sony Cybershot camera", "Author": "LS2008", "ReviewID": "R2NQHLUTQJANND", "Overall": "5.0", "Content": "Bought it as a gift and the recipient was happy with ease of use and nice pictures for a quick,convenient,carry-around handy camera.", "Date": "January 19, 2008"}, {"Title": "Good digital camera", "Author": "Ana Maria Paiva \"Mac\"", "ReviewID": "RN4RCTIXTZ5LA", "Overall": "4.0", "Content": "The pictures I get with this camera is a lot better than the ones I get with others from diferents brands e same 7.2MP, photos are really beutifull. The only problem is night photos of distant panorama, but those i think are only good with professional cameras.", "Date": "January 19, 2008"}, {"Title": "No more buying film for me", "Author": "James Beeman \"Youngstowner\"", "ReviewID": "RQDR73FALAU87", "Overall": "5.0", "Content": "I bought this camera as a Christmas present for an 9 year old granddaughter. She opened the box, glance through the directions & was using it as soon as the battery was charged!! We have used an older \"Cannon\" film type (which was a great camera) for years, but this \"Sony\" has made our \"picture taking\" life easier!! We are over 60, & are always looking for \"simple to use products\" this is one of them.", "Date": "January 18, 2008"}, {"Title": "Sony DSCW55 7.2MP digital camera", "Author": "G. Hurley \"G. Hurley\"", "ReviewID": "RQLD4X7YDLGHA", "Overall": "5.0", "Content": "For the price it's a great buy. 7.2mp for under $140. is really a good deal. Focus is very good, much better than the nikon digital I had. Movies are good and the mic for sound records well. I'd buy another one.", "Date": "January 18, 2008"}, {"Title": "Tiny and takes great pics!", "Author": "Jason Garrett", "ReviewID": "R2U0LSADD04ECI", "Overall": "5.0", "Content": "I upgraded to this after loving and losing my last cybershot..  This one is half the size of my old one, takes way better pics, and actually costs LESS than my first one did!Go sony cybershot!", "Date": "January 18, 2008"}, {"Title": "great gift", "Author": "Wayne Gee \"geeman\"", "ReviewID": "R5Z0XDPTP5MMV", "Overall": "4.0", "Content": "After using other ready to shoot digital cameras, and not being happy with the quality of them, I was extremely happy to find this Sony camera. It is truely a ready to shoot camera, where I don't have to an expert to use.  It will be my main camera from this point forward.  The wife's happy too....", "Date": "January 18, 2008"}, {"Title": "Great camera for a very good price.", "Author": "Mary Collins \"Band Mom\"", "ReviewID": "R3VGB8YQA2MOKV", "Overall": "5.0", "Content": "I bought this camera for my teenage daughter for Christmas.  It was easy to learn how to use.  Although it is a small camera, the viewing window is quite large and it has quite a bit of memory storage.  My daughter uses it for both still shots and video clips.  Uploading is easy (we use iPhoto). I'm so impressed with it I may get one for myself.  It's also a cute color, which matters to my somewhat trendy teen.", "Date": "January 18, 2008"}, {"Title": "Love it", "Author": "Nonya", "ReviewID": "R140UDY7PFYGPG", "Overall": "5.0", "Content": "I got this as a Christmas present and it's the best present I've gotten. I love it soo much. The picture quality is awesome, even in dark settings. If the pictures come out too dark I just easily edit it with a photo program and they come out great.I love the quality of the pictures it couldn't get any better! So far so good not to mention is soooo adorable. I have tiny hands and this camera is still a little smaller than my hands so it's perfect for me!", "Date": "January 17, 2008"}, {"Title": "Good Buy", "Author": "J. Deleon", "ReviewID": "R2P9W4D9CLNRT0", "Overall": "5.0", "Content": "Product came in great condition.  Clear pictures.  I bought it for my boyfriend as a Christmas present and he absolutely loves it.", "Date": "January 15, 2008"}, {"Title": "Cute and functional", "Author": "Mom of twins", "ReviewID": "RR7UUAB75YADI", "Overall": "4.0", "Content": "This is my 3rd Cybershot and it's just as good as its predecessors. I never use many of the options, but I guess it's nice knowing they're there. My main complaint is that you have to remove the battery to charge it, which is mildly inconvenient. I love the fact that it's pink and that I won't easily confuse it with others' cameras when we're hanging out with other people.", "Date": "January 14, 2008"}, {"Title": "PICTURE PERFECT", "Author": "Angie \"Happy in Ohio\"", "ReviewID": "RN02IA9389H2E", "Overall": "5.0", "Content": "good digital cameras are hard to find but this one wins in all categories that matter from ease of use, to excellent view finder (big), to great pictures and long battery life - very sleek, fits anywhere easily and does its job while looking good!!  :)  highly recommend this product to anyone up in the air about which digital camera to buy - you would not be disappointed w/ this one!", "Date": "January 13, 2008"}, {"Title": "Excellent Product and Quick Shipping from Vendor", "Author": "Curtis D. Colaw \"DeanC\"", "ReviewID": "R2W8X7OYU3ZUFQ", "Overall": "5.0", "Content": "Product is excellent, especially with memory upgrade.  Easy to use and small so can be easily stored in pocket.  The vendor had this to me within a few days.", "Date": "January 13, 2008"}, {"Title": "Great price, good camera", "Author": "Penngy \"full time online shopper\"", "ReviewID": "R3CDOEYHHYK6ES", "Overall": "5.0", "Content": "I bought it on sale on amazon for an amazing price, and it is a very nice camera. I like how the display screen is very big, and clear.", "Date": "January 13, 2008"}, {"Title": "Nice camera for the price", "Author": "Gavin A. Buehl", "ReviewID": "R1V9QRV3I3YI5X", "Overall": "4.0", "Content": "I have actually purchased two of these cameras.  Both were gifts for family members who had purchased low end cameras a year or two back and wanted to upgrade.  I own a DSC100 model myself.  These cameras are great little cameras for the money.  It is packed with features.  It takes a little time to get used to how to access the features, but overall it is a great camera.", "Date": "January 13, 2008"}, {"Title": "Great cost benefit product", "Author": "Victor Zockun", "ReviewID": "R864QRII2XO0Y", "Overall": "4.0", "Content": "The pictures taken came out great so the movies (using the best quality).The only * are a few shots at night. Sometimes the flash and colors could work better, so the pictures would be brighterThe battery last for hundred shots.", "Date": "January 13, 2008"}, {"Title": "Great Mom camera!", "Author": "M. Fogleman \"mluv2cruz\"", "ReviewID": "R3QG2ZFA8B9UV4", "Overall": "5.0", "Content": "I was happy with my old Cannon PowerShot A80 because it had an action button for you fast little ones! My husband wanted my old camera for work and said I could pick a new one that was under $200. After a lot of searching I picked this one and boy I am happy! It is so cute, small, and all of the controls are right their. No searching for settings like my other one. I am the one who hates buying new things because I have to learn how to use them and sometimes it just seems so intimidating!! It did sit in the box for 2 days because I thought I was going to need to read a lot of stuff to learn how to use it and it was the Holiday's and had no time. I finally picked it up and it is SUPER EASY!! I love it more than my old Cannon A80. : ) and yes, it takes WONDERFUL pictures!", "Date": "January 12, 2008"}, {"Title": "I understand. Thank you.", "Author": "Angela Z. Feng \"angelafeng\"", "ReviewID": "RZDL6410ZETBT", "Overall": "4.0", "Content": "I didn't recieve the product eventually. However, it was not the seller's fault. UPS lost the items twice.So far, Amazon have provided excellent customer service to me. I appreciated what you've done for me. Thanks a lot.", "Date": "January 12, 2008"}, {"Title": "Great camera", "Author": "George L. Fuller", "ReviewID": "RUXHDHZHL4UKA", "Overall": "5.0", "Content": "My fiance, who I bought the camera for, is enjoying it.  She likes the big LCD viewer so she can easily look at her pictures.  She really likes the camera's capabilities.", "Date": "January 12, 2008"}, {"Title": "Sony Cybershot Digital Camera", "Author": "Linda Thomas", "ReviewID": "R1UEIGWU6IRLW9", "Overall": "5.0", "Content": "I am very happy with my new digital camera.  Plan to use it on my next trip.", "Date": "January 12, 2008"}, {"Title": "satisfaction and usage", "Author": "Dorothy M. Parker \"parker d.\"", "ReviewID": "R2W17DP4OWBD20", "Overall": "4.0", "Content": "I purchased this item for a friend as a gift. I have tried it out myself and find it's clarity and projection very clear.I like the duo pro memory stick capability and easy PC download. good product.I own a Sony cybershot 4.0 mxl with 3x optical. I've had it for almost 5 yrs and love it. I would like an upgrade but donot know what to do with this one. At the time it cost close to $500. Any suggestions?", "Date": "January 12, 2008"}, {"Title": "great camera", "Author": "Jonathan Sanchez", "ReviewID": "R3JRYA0R748LEL", "Overall": "5.0", "Content": "This camera works great. It's small, easy to use and has great picture quality. I recommend it to anyone. Go get it now!", "Date": "January 7, 2008"}, {"Title": "Good camera", "Author": "Yisney Buzo", "ReviewID": "R28T75OLFZX4QP", "Overall": "4.0", "Content": "this is a good camera but the quality of the video recorded with this camera is not really good.", "Date": "January 7, 2008"}, {"Title": "Simple, Easy. Nice", "Author": "Shellina L. Jacobs", "ReviewID": "R3RDJGUNNZZB1L", "Overall": "5.0", "Content": "Purchased this product through Amazon. Had a few good reviews from my personal friends. Got it for a great price and it has been a really great purchase. Small and easy to use. Memory card is cheap and the software for the Cybershot when you upload the pictures is also nice.", "Date": "January 7, 2008"}, {"Title": "Perfect for carrying in his pocket", "Author": "Otty De Boer", "ReviewID": "RE8E9XAGLPZ06", "Overall": "5.0", "Content": "Small, practice, easy to carry, with good quality, it is only that you can not use the zoom when they make a video and has no stabilizer.", "Date": "January 6, 2008"}, {"Title": "who is Carl Zeiss and why is his lense inferior?", "Author": "dave matthews", "ReviewID": "R2PHJA0T8Q0RDX", "Overall": "3.0", "Content": "I bought this to replace my 6+ year old 2mp fuji finepix.  The sony is small and good looking but I was disappointed in the picture quality. I did a side by side comparison with several cameras including my old fuji and the sony had the least sharp picture of all.  I sent it back and bought a Canon Power shot a570 which cost less has much better features and better picture quality.Pros: good looking, small,Cons: picture quality, features, size (yep it is hard to hold), proprietary battery, proprietary card,", "Date": "January 5, 2008"}, {"Title": "Good for Price, Nice features, Compact size.", "Author": "absolutefreaky", "ReviewID": "R3EFYYHM4QRVLK", "Overall": "5.0", "Content": "I bought it for a friend. has sleek design, small size and handy features. it is definitely worth the price. recommended camera. if you are looking for a budget price camera and want to use AA batteries and don't mind using a little thicker camera, go for Canon A570 IS with anti-shake.", "Date": "January 4, 2008"}, {"Title": "sony digital camera", "Author": "Peaches", "ReviewID": "R28KJIMCRSOZBI", "Overall": "5.0", "Content": "A great camera the pictures are sharp and it is so easy to use a great buy.", "Date": "January 3, 2008"}, {"Title": "Great little camera, easy to use, love the color !!", "Author": "Chicago Katie \"ChicagoTarheel\"", "ReviewID": "RDH282H4N95WY", "Overall": "5.0", "Content": "I previously have the Sony Cyber Shot with 4.1 mega-pixels and am very happy with this one.  It is less bulky and more features than my previous camera.  I find this camera extremely easy to use and the pictures look great.", "Date": "January 3, 2008"}, {"Title": "Very Unhappy with this Cybershot", "Author": "survivor gal \"UP quilter\"", "ReviewID": "R3NPS3CGX8DV20", "Overall": "2.0", "Content": "I have been using a Fuji for years and I got this camera for my boyfriend for christmas.  I was VERY unhappy with it.  If the lighting isn't perfect, it has a huge shutter lag due to its extremely slow focusing.  Also, I have never had a problem with taking blurry photos in the past, and nearly all of the photos I took with this camera came out with at least 1/4 of the photo blurry.  I say only 1/4 because there were some very strange effects that happened in most of the photos.  Some how, only the corner of the photo would be blurry or half of a person was blurry and not like they were moving.Additionally, while it has some new flash options that my Fuji didn't have, none of them work as well as the basic ones on my Fuji.  Almost all the people I took photos of with this camera had red eyes, the flash was so very bright, that I really blinded them.  And overall it just didn't look good on the photos.This camera does take excellent movies even in the same situations that it didn't take good photos in.  They have great sound and the focus is GREAT in those.  And the daytime photos are pretty crisp, although I was testing it in the winter, so I had trouble deciding if the color was good...etc.Overall though, I don't think it is worth the money I paid for it. I made a big mistake buying this camera.", "Date": "January 3, 2008"}, {"Title": "Great Camera", "Author": "Fan in Indiana \"geb\"", "ReviewID": "R3I2H48A13OCZX", "Overall": "5.0", "Content": "I bought two of these cameras for Christmas presents.  Aside from the frustration of Sony not using standard memory chips (you have to purchase specific for this camera), this is a great camera.  I gave them to 19 and 16 years old kids and they love them.", "Date": "January 1, 2008"}, {"Title": "Excellent product", "Author": "M. De Coelho", "ReviewID": "R2FGWB8Q3AY6K7", "Overall": "5.0", "Content": "Very good product, good resolution, something expensive but acceptable price for quality  Memory was expensive compared to other market", "Date": "January 1, 2008"}, {"Title": "Sony Cybershot", "Author": "A. Dickinson", "ReviewID": "R399AAOT3QL62X", "Overall": "4.0", "Content": "Four words: I love this camera. The clean and cool design, sexy cerulean blue color, high resolution 7 megapixel images, and user friendliness combine to create one of the best digital cameras I have ever owned.  I love Sony products and this one certainly does not dissapoint!", "Date": "December 31, 2007"}, {"Title": "Pink Sony Cybershot", "Author": "Lauren \"Princesa\"", "ReviewID": "REF5M8PGHCC8R", "Overall": "5.0", "Content": "This camera is a great camera. It is sleek and small and fits in a night clutch bad and the cover that it comes with is great because it never allows it to get scratched. Thats the best thing that should come with every camera. The camera takes great pictures and also videos if you have enough memory. Its a great buy and I love it.", "Date": "December 31, 2007"}, {"Title": "buen desempeño", "Author": "Omar Arreola Valdez", "ReviewID": "RBM9RJVV6XLA4", "Overall": "4.0", "Content": "se la compre a mi hermana y ha tomado miles de fotos a sus amigos y en fiestas tiene un precio excelente ahora...", "Date": "December 29, 2007"}, {"Title": "excellent basic digital camera. Very Stylish too!", "Author": "Kenneth Osherow", "ReviewID": "RLL11931I14N8", "Overall": "4.0", "Content": "I bought this Sony Cybershot digital camera for one of the employees in my office. The camera is very easy to use, very stylish and just about all the camera you will need at a very affordable price. The pictures were crisp and colorful and the setup and use was very simple. This is a decent camera at a affordable price. Sony is a good name so you really can't go wrong with this one.", "Date": "December 28, 2007"}, {"Title": "Great camera!", "Author": "W. Huggins", "ReviewID": "R3MN8ON0ZALZBH", "Overall": "5.0", "Content": "I bought my 2 daughters each one of these for Christmas and they are nice little cameras, very clear pics, easy to use, easy to carry, both girls love them! Well worth the money! Maybe now I will get more pics e-mailed to me from college!!", "Date": "December 28, 2007"}, {"Title": "5 Stars for Fun & Quality Pics!!!!", "Author": "KathAnnon \"Chesapeake Kat\"", "ReviewID": "R1Y9ECWC12UI7F", "Overall": "5.0", "Content": "Bought this one for my 11 year-old and 13-year old and gave one to my Mom too.  This camera is simple enough for point-and-shoot.  Yet, it has enough settings to keep the curious interested for a good long time.  GREAT camera for anyone!  This camera is GREAT!  Particularly good for beginner photographers, kids and those folks who are a little intimidated by too much technology at one time.  With a little practice, anyone can take award-winning pictures with this camera!  AAA+++", "Date": "December 26, 2007"}, {"Title": "It's Pink and It's Good", "Author": "M. G. Chisholm \"chiefengineer3\"", "ReviewID": "R3J4A2OZKR32VC", "Overall": "5.0", "Content": "Bought this for my wife because she wanted a nice new small camera. I got the pink one so my son wouldn't \"borrow\" it and knacker it like the last one. It's as per normal for Sony, well made. Good and small but not too daft where you can't see it properly or operate the buttons. Wife loves the colour but it's slightly on the red side of pink (although still well pink)- more than it appears on screen. Great pictures and easy to use. I tend not to advocate using Sony software because it's normally as crap as the hardware is good, so I can't tell you about that side of it. Good value for money.", "Date": "December 25, 2007"}, {"Title": "Full satisfaction", "Author": "Gloria M. Furtado \"Gloria\"", "ReviewID": "R24XBVMJCQTD6Z", "Overall": "5.0", "Content": "As I say in mi heading, I am realy satisfied with my camera, it is more than I expected, it is confortable and easy to carry, also to use it. I have already recommended it to my friends and also to your customers.", "Date": "December 23, 2007"}, {"Title": "Sony Cybershot Camera", "Author": "Oswaldo", "ReviewID": "R2ODIDTWXZ7XPQ", "Overall": "4.0", "Content": "Is a good camera for me. I'm not a professional photographer, so I'm not very exigent with cameras. The only thing I notice is that the zoom is a little short and in dark conditions without the flash you need a good hand to avoid take fuzzy pictures.", "Date": "December 22, 2007"}, {"Title": "great pictures so far", "Author": "Joanne Filler", "ReviewID": "R3EFRVM2FNB0YB", "Overall": "4.0", "Content": "This camera is easy to use and takes very clear pictures. Great for an amateur like me.", "Date": "December 20, 2007"}, {"Title": "Sony Cybershot", "Author": "i2 \"aloha_bula\"", "ReviewID": "RCZICJ7SE4WB9", "Overall": "5.0", "Content": "Great product! Arrived before the predicted time!! Easy to use and made a great Christmas gift!!!", "Date": "December 18, 2007"}, {"Title": "Great Buy", "Author": "Manik Tyagi", "ReviewID": "RQWFPF77YKM67", "Overall": "4.0", "Content": "Value for money. Infact the results are as good as any other expensive sony cybershot camera.", "Date": "December 14, 2007"}, {"Title": "Excellent camera, excellent price", "Author": "H. Martins \"Helder Martins\"", "ReviewID": "R3062SSPC05KHM", "Overall": "4.0", "Content": "If you want a simple camera for your vacations, and you're not a professional but such a tourist who wants to record all its vacations memories, this is the perfect equipment for you.", "Date": "December 12, 2007"}, {"Title": "So Happy!", "Author": "Daisy Eng \"deng\"", "ReviewID": "R111RCHEMJM3VU", "Overall": "5.0", "Content": "I'm extrememly happy with my new Sony camera. I recieved it within 4 days of ordering. Camera is perfect for me, point and shoot. Pictures are very clear and crisp.", "Date": "December 7, 2007"}, {"Title": "love it", "Author": "Rhonda", "ReviewID": "RZYYTCYHUN8FE", "Overall": "5.0", "Content": "I love this camera, very easy to use...the pictures have come out great.  The handy size makes it convenient to carry while out and about.", "Date": "December 3, 2007"}, {"Title": "Great Camera", "Author": "Annie", "ReviewID": "R1RMERSD0YLT3G", "Overall": "5.0", "Content": "This camera has a big screen...great for anyone with poor eye sight.  Easy to use and takes great pics!", "Date": "December 3, 2007"}, {"Title": "lovely camera at great price~", "Author": "ichaBuNni", "ReviewID": "R1AYMFO915EUTG", "Overall": "5.0", "Content": "I bought this camera over the summer. I've had it for five months now so i thought now would be a great time to review it.First of all, i am extremely pleased and amazed by this camera. It's cheap, slim and comes in great variety of colors (I have the pink one). It takes perfect pictures indoors and outdoors. when taking pictures of people, it makes their skin looks much better than it does with other cameras.I also find the internal memory super useful. 56mb is enough for around 200 photos in 640x480 resolution. I never needed any extra storage, but recently bought a 2GB memory stick anyway because it was cheap ($20)", "Date": "November 27, 2007"}, {"Title": "DSC W55", "Author": "Tuan A. Vu \"hqbabie3\"", "ReviewID": "R25JFDL4I5MBJO", "Overall": "4.0", "Content": "expensive battery ... delivery of effortless  & decent quality picture ... fits well those users who would content w/ a stylish camera having a solid build and a view finder", "Date": "November 24, 2007"}, {"Title": "No bells and whistles. Plain Vanilla, but functional.", "Author": "Sandro Rodriguez", "ReviewID": "R2NAQ5OD1W8YHZ", "Overall": "4.0", "Content": "What more to say?The Cyber-shot DSCW55 is just what you'd expect from other sony cybershot DSCW products. Nothing fancy, nothing professional, just a simple, easy to use point and snap camera. It does have a few settings and picture options to fool around with, but nothing interesting/usefull enough to divert you from using the good 'ol auto setting. The picture quality is just anverage/semi-high quality for this type of camera, which is more than enough for the average user. I did notice that the Macro close-up photographs are not as good and detailed as in other cameras.There is really no, or very little difference between the DSCW35,50 and 55. Just that the W55 has 56MB of internal Ram. (Something very irrelevant, becasue you'll need to purchase a separate Memory card if you plan on taking more then 15 - 20 pictures).The feel of the camera itself is sturdy aluminum (it could handle a few mishaps) exept for the plastic battery/memory cover with feels kinda flimsy and cheap.Its small and lightweight, and easy to fit in your pocket.Overall a nice mainstream camera, great for the casual user, as it doesn't require much practice to take nice clean shots.", "Date": "November 21, 2007"}, {"Title": "Very Nice", "Author": "Leopoldo Carnevali Alvizua \"LGCA\"", "ReviewID": "R3N46HVK7KYM5M", "Overall": "4.0", "Content": "Small and compact. Big screen. Nice picture quality. Easy to use. Good for occational photographing. If it had a mode for moving objects would give it the 5 stars.", "Date": "November 20, 2007"}, {"Title": "SHORT REVIEW!", "Author": "R. Piltzer \"Rocklen\"", "ReviewID": "R1G865L3OLNJFM", "Overall": "5.0", "Content": "EXCELLENT QUALITY CAMERA.  USED ALMOST EXCLUSIVELY FOR CLOSE-UP MACRO SHOTS FOR EBAY SALES...GREAT COLOR RENDITION.  HIGHLY RECOMMENDED!!!", "Date": "November 18, 2007"}, {"Title": "Awesome Camera", "Author": "J. Bell \"Buckeye Fan\"", "ReviewID": "R3E6R52ISGHPP0", "Overall": "5.0", "Content": "Compact; lightweight; ease of use; superb! This is my 3rd Sony digital camera and this is by far the best! They have improved the ease of use over previous models.", "Date": "November 17, 2007"}, {"Title": "Best Amazon Purchase thus far!", "Author": "Brandon Combs \"bjcomb03\"", "ReviewID": "R2DD4BUD9OYFD1", "Overall": "5.0", "Content": "I've been putting off getting a digital camera for quite a while.  I purchased this one on a whim, as a reward for how many hours I had been putting in at work, and to be honest, this is my best purchase thus far.  I've purchased workout equipment all the way to a Coach wallet... but this one takes the cake.  Great resolution, zoom, and the ease of use factor is incredibly high.  Definitely recommend this for anyone less than a professional, as Sony has made this convenient for all users.  If you're on the fence, I say give it a shot! (no pun intended)", "Date": "November 13, 2007"}, {"Title": "Sony Cyber Shot 7.2 Pixel Camera", "Author": "Lauren K. Pickering \"L.P.\"", "ReviewID": "RQNGPT1F54P0W", "Overall": "5.0", "Content": "I've used disposable cameras my whole life, even in high school and college, when everyone else had a digital camera i always stuck with disposable cameras.  I finally decided to buy myself a good quality camera, such that of the Sony Cyber Shot.  Its my first digital camera, and surprisingly very easy to use.  To work the camera, understand the directions, and just being able to use the camera was far more easy than i expected.  Iam not a computer person, nor into high tech gadgets but this camera  is the best investment that i could have ever gotten.", "Date": "November 13, 2007"}, {"Title": "Great Camera for the Price", "Author": "Sohail Ahmed \"superso\"", "ReviewID": "R2R1QIE3C8IYCG", "Overall": "5.0", "Content": "This is an excellent camera for anyone on vacation or everyday use.  SONY also makes excellent cameras in my opinion.  I just upgraded from a SONY camera i've been using for 6 years without any problems.  This camera is everything you need for pictures and video clips.  The only recommendation I would make is to upgrade to a bigger memory card so you can take quality video clips. It has all the excellent basic functions like 2 and 10 second delayed timers, flash and focus settings for all types of lighting conditions, etc.  Of course, you won't be able to take distant landscape pictures in dark conditions but that's something you only expect from a very high end photographer's camera anyway.  I walked through rainforests and picked up all the sounds, as well as driving along country roads and taking great video clips and pictures.", "Date": "November 11, 2007"}, {"Title": "Wonderful!!!!", "Author": "Christina Smith", "ReviewID": "R2KH8LN4PL4KTZ", "Overall": "5.0", "Content": "I love this camera.  It takes much better pictures than I expected and it is very easy to use.  The two minute video feature is a great bonus for those unexpected things that you may want to record.  This camera is great for the first time digital user.  I would and have recommended this camera to everyone I know.", "Date": "November 11, 2007"}, {"Title": "Good buy", "Author": "D. Talen", "ReviewID": "RQYZ1I7JEDXUH", "Overall": "4.0", "Content": "Got this about two months ago. I'm no professional or amateur photographer, but by my standards it takes good pictures. Solid & long battery life. No complaints.", "Date": "November 11, 2007"}, {"Title": "I'm in Love With This.", "Author": "M. Missbach \"Amateur Chef\"", "ReviewID": "R2X0TTMWDZEA44", "Overall": "5.0", "Content": "This is the best camera I've ever owned. It looks amazing, has an amazing screen, takes great pictures and videos with sound, and has a simple settings menu that works great for almost every kind of picture imaginable. The battery lasts forever, is easy and quick to charge, and works like a charm. I used mine nonstop for an entire week at a beach vacation and the battery didn't die until two weeks AFTER the vacation. Memory cards are easy to come by and work great.The absolute only thing wrong with this camera is that the screen is very large and thus very easily scratched.I use the camera to take photos for my home business, to videotape my friends, to take photos of me and my friends, and to take photos on trips. It all works great.LOVE THIS. I recommend it to EVERYONE.", "Date": "November 11, 2007"}, {"Title": "Point and shoot with some additional fun...", "Author": "KLG", "ReviewID": "R3LJIHFTU5I9L1", "Overall": "4.0", "Content": "Great camera, easy to use, quick to learn, and offers great features such as the burst and multi-burst, video, and a small but decent zoom.  Slips in the pocket for easy access; I love it.", "Date": "November 11, 2007"}, {"Title": "Good point and shoot camara", "Author": "Michael D. Rodriguez \"Michael D. R.\"", "ReviewID": "R3T8172827JY4W", "Overall": "5.0", "Content": "Excellent for the price, and the pictures even without the image stabilization, are perfect. Recommend it..", "Date": "November 8, 2007"}, {"Title": "Awesome camera", "Author": "X-ray LOBO 08", "ReviewID": "RLHVHMQ9ISC55", "Overall": "5.0", "Content": "This camera has great resolution for a 7-megapixel and is so compact! It has 56MB internal memory so you probably need a memory card (as with most cameras). It is very user-friendly and is easy to use. Great value for the price!", "Date": "November 7, 2007"}, {"Title": "Good general camera", "Author": "A. Whitford", "ReviewID": "R3IYPM5XONKTSD", "Overall": "4.0", "Content": "Fun to use, easy to navigate, takes great pictures.  Would highly recoment a case to keep  the large display screen safe.  The battery life is outstanding!", "Date": "November 6, 2007"}, {"Title": "i love it", "Author": "N. Song \"eclectic eccentric\"", "ReviewID": "R1X7HU4WL3AY8K", "Overall": "5.0", "Content": "i got this about 4 months ago and have taken it to china with me. its great! i think its definetly a steal at the price. the only down side i would say is that it doesn't take good night scene shots as the aperature is open to long and so its almost impossible to get a not fuzzy picture", "Date": "November 5, 2007"}, {"Title": "Great camera", "Author": "D. Faccas", "ReviewID": "R33EJ67J4F82RO", "Overall": "5.0", "Content": "I owned a 4 MegaPixel Sony Mavica for over 5 years and decided it was time to upgrade; so I stuck with Sony and got this Cybershot.  The pictures are great quality and the user menu got friendlier to use.  I'm very happy with it.  Great camera for the amateur photographer!  Amazon had the best price and it was delivered earlier than expected.", "Date": "November 4, 2007"}, {"Title": "My first digital camera...", "Author": "Booker", "ReviewID": "R2IO0S0JXMJ9W0", "Overall": "5.0", "Content": "Sony Cybershot was my first digital camera purchase.  I'm a complete novice and find this camera very easy to use.  Wonderful pics that I upload to my pc and send to my local store to print on their laser printer.  The software that came with it is very easy as well for editing and turning into close-ups.  Only bad thing is I didn't get a case for it right away and let it rub against my cell phone in my bag and sort of scratched up the LED screen - but it's completely unnoticable when shooting.  However, I recommend some sort of case for it...", "Date": "November 3, 2007"}, {"Title": "Like it a lot...", "Author": "J. Huang", "ReviewID": "R1R1009WKTIFM3", "Overall": "5.0", "Content": "I am very satisfied with the camera. Very light and cute, easy to carry. More importantly, all the functions it promised worked out very well and very user friendly designed (don't need to read the manual at all).Battery last quite long just as promised. The only con is there are only 2 options available for picture resolution. It would be perfect, if there are more options, i.e. some lower options in case you want to record something but didn't want to do it too big in size. However, you can always resize it through some PC programs. Overall, as a non-professional camera, it works very well for me.", "Date": "October 24, 2007"}, {"Title": "very good price for it's quality", "Author": "Reuben Grech", "ReviewID": "R3EXPNV12AKH4K", "Overall": "5.0", "Content": "very good price for it's quality. I really like the camera and also it has a very fast startup", "Date": "October 21, 2007"}, {"Title": "Camera", "Author": "Michelle Charles", "ReviewID": "RD78SW6HDI6IZ", "Overall": "5.0", "Content": "I am very happy with this purchase. I love the compact size and color and the pictures are great.", "Date": "October 18, 2007"}, {"Title": "Sony", "Author": "Bethany Bush", "ReviewID": "R7LFKI3UWFGC1", "Overall": "4.0", "Content": "This product is good.  Takes good pictures.  Can zoom into pictures after being taken and save the oictire that way.", "Date": "October 17, 2007"}, {"Title": "Clarity review of Sony Cybershot DSCW55", "Author": "Stanley V. Patino", "ReviewID": "RETCGQXMM0ARS", "Overall": "4.0", "Content": "I bought this Sony product as it synchronises with my Sony Ericsson mobile phone. The memory card is compatible for both. The 7.2 MP was also very appealing. The convenience of having one common card played out positively with use. However, the clarity I was looking for did not materialise with the 7.2 MP claim. a previous Sony camera with a 4-5 MP specification was not bad compared with this one. It is possible that there is a plateau in the graph of clarity and MP until it rises again. The technical department of Sony can better explain this matter.", "Date": "October 17, 2007"}, {"Title": "Perfect Digital Camera", "Author": "L. M. Foster", "ReviewID": "R24ZB5SLQUW7T8", "Overall": "5.0", "Content": "This is my second Sony cybershot digital camera, although I have purchased Kodak Easy Shares for family members.  I loved the first one (only 3.2 MGP).  This camera is perfect for the not-so-tech-wise consumer.  It takes great pictures and has a high quality Zeiss lens.  Most of all it is easy to use, especialy for the beginner and intermediate user.  It stores easlily in a pocket and I love the color choices Sony gives you!  The review pictures button is a little small, but you get used to it quickly.", "Date": "October 17, 2007"}, {"Title": "Great little camera and the pictures come out clear.", "Author": "Vee fr Texas", "ReviewID": "R1OUS46H3423OZ", "Overall": "5.0", "Content": "I was very pleased with the Sony Cybershot DSCW55 7.2MP Digital Camera with 3x Optical Zoom in pink. Good investment!", "Date": "October 15, 2007"}, {"Title": "Lol!", "Author": "Jose R. M. Bertola \"Renam Bertola\"", "ReviewID": "RN52F2XBFN65A", "Overall": "4.0", "Content": "Unbeliable camera !!!!!7.2 MEga pixel , it's fantastic !The battery takes long time to get over...", "Date": "October 2, 2007"}, {"Title": "Buy the memory stick", "Author": "Mark E. Bellot", "ReviewID": "R2SUEDW0XOHGEQ", "Overall": "5.0", "Content": "It was a good gift for my wife.  It needs the memory stick to be useful.", "Date": "October 2, 2007"}, {"Title": "Great pictures, almost toy-like though.", "Author": "Jessica", "ReviewID": "RZGH4NZ19D15F", "Overall": "4.0", "Content": "This camera takes great pictures and awesome macros. However it is very small and I feel like it's going to break whenever I use it. Very fragile.", "Date": "September 29, 2007"}, {"Title": "Sony dscw55", "Author": "Johuto", "ReviewID": "R2PPPHGEAG400X", "Overall": "5.0", "Content": "The product was shipped promptly and was correctly packaged. No problems. Very good camara for the price. I recommend it.", "Date": "September 29, 2007"}, {"Title": "Pretty good!", "Author": "Puja", "ReviewID": "R2M8FLMSNIV6M9", "Overall": "4.0", "Content": "So far the camera has been amazing.  It takes really wonderful, clear pictures.  it does not come with a memory chip but has an internal card which is def nice.  I love that its pink so its a good conversation starter. The camera has pretty nice functions.  I am still learning but they seem to have every scenario covered.  The quality of the picture is good but takes some getting used to.  I have heard there is a blinding flash that people dont love but aside from that its pretty good.", "Date": "September 5, 2007"}, {"Title": "Great camera for price", "Author": "Thomas W. Ford", "ReviewID": "RM68Z2V72CBF7", "Overall": "5.0", "Content": "I have used this camera on several occasions since I purchased it. It is easy to use and the photos are great. I have a Fujifilm full-size digital which works well for some things, but I have found that this camera matches and exceeds the quality of the Fujifilm. If I had any regret it would be the slight lag time in the shutter when taking motion photos.", "Date": "September 2, 2007"}, {"Title": "Excelent", "Author": "Nora Souki", "ReviewID": "R16RN9CB8AB2MD", "Overall": "5.0", "Content": "Excelent camera, easy to managment, friendly and take excelent pictures. I am happy with it.", "Date": "September 2, 2007"}, {"Title": "Great camera overall", "Author": "David P. Burrows \"Renaissance Man\"", "ReviewID": "R16S7COFBB3HH6", "Overall": "4.0", "Content": "Great little camera for the price. Some of the controls are hard to use if you have big fingers. Arrows for inserting the memory card and battery properly are hard to see.We love it so far and have taken several hundred pictures that we are happy with. Only had it about a month now.", "Date": "August 31, 2007"}, {"Title": "amazing photos", "Author": "Gustavo Restrepo", "ReviewID": "RON3FD2OP5CNS", "Overall": "5.0", "Content": "I am so pleased with the resolution and the iso 1000 feature,I need a camera for night photos with the enough resolution.", "Date": "August 30, 2007"}, {"Title": "review", "Author": "Brian Watson \"svin tokk\"", "ReviewID": "R3UW2UXYYSE60V", "Overall": "4.0", "Content": "Great camera, but with the output port being on the bottom, even with a tripod, you cannot view the picture about to be taken on a tv screen because it is impossible to plug it in.  So you have to view through the small screen to see the approximate area you want to take a picture using timer function and hope you got everything centered the way you want it.Really stupid place for the output port.  They should have at least moved the battery compartment closer to the middle and made the output port on the far side of the bottom of the camera so you could view the picture to be taken on a tv set before actually taking it.I really did not like this part of the camera.  All the basic functions seem to be ok, though.", "Date": "August 23, 2007"}, {"Title": "Charge your battery, attach your memstick and start shooting!!", "Author": "Renato Goncalves Cesar", "ReviewID": "R2HZ38TJPNYLO7", "Overall": "5.0", "Content": "You dont need to know anything about taking shots, using its automatic settings you get a VERY NICE picture...It have everything you want in a digital camera, the movie quality is also very nice!!I didnt think it would be so nice as it is...I recommend!!!", "Date": "August 23, 2007"}, {"Title": "This camera is a little power house!", "Author": "snow-hater", "ReviewID": "R3165T3H2JGQAD", "Overall": "5.0", "Content": "I have used all the other big names in the buisness, and this one is right up there with them. I have lots of other Soney products, so I decided to give this little camera a try.I trust Soney made a good choice bringing us this little beauty! Great, clear pictures,fair price, a definate \"MUST HAVE\". I recomend it Highly.", "Date": "August 23, 2007"}, {"Title": "FLASH PROBLEM", "Author": "ARNEL OF CERRITOS \"ARNEL\"", "ReviewID": "R3D3TCLK73U7SE", "Overall": "2.0", "Content": "This is my second Cybershot.I have both the DSCW50 and DSCW55.The main problem of this particular model is the flash.Code 99 which is defective flash.Luckily on my first camera (DSCW50)the flash broke w/in the year of purchase,so it was fix free.But the second on (DSCW55)broke after 13 months.They were charging me $175.00 just to look at the camera.My older camera w/c is the Canon powershot A85 is still working.So I decided to switch back to Canon", "Date": "August 12, 2007"}, {"Title": "Two Thumbs Up", "Author": "Cynthia Dee Martinez", "ReviewID": "R11VHQCM3VPVHD", "Overall": "5.0", "Content": "This camera is the easiest to use and also the prettiest pink camera around. It is easy to use and easy to upload the pics and the videos onto my computer.  This sale gets two thumbs up from me.", "Date": "July 17, 2007"}, {"Title": "Highly recommended!", "Author": "Roxme", "ReviewID": "R12KQCZUWQW87H", "Overall": "5.0", "Content": "After purchasing two of this camera's predecessors (DSCW50) as gifts, I found myself in the market once again when my scatter brain daughter lost hers on a trip to Italy.  However, this time she had to pay part of the cost in the vain hope that she'd be more responsible the second time around.  Anywho, these cameras have gotten high marks by all concerned for their ease of use, diminutive size, and excellent pictures.  I highly recommended these cameras for the pedestrian shutter bug.", "Date": "July 2, 2007"}, {"Title": "cmguinness", "Author": "Army Medic", "ReviewID": "R25HDQVIIG9LZH", "Overall": "5.0", "Content": "I am extremely pleased with this camera. It is easy to use, has practical features, and is able to take video clips with sound for as long as you have memory on your card. The 7.2 megapixal lense takes top quality pictures!", "Date": "May 13, 2007"}, {"Title": "Worth it.", "Author": "S. Mohan \"Satan\"", "ReviewID": "REYCQJYZA0RZH", "Overall": "5.0", "Content": "I would say that this camera does everything that every other camera does and it is almost the same as any other point and shoot camera. I also have an Olympus Stylus 7.1 meg camera. This is just the same as that. I noticed little pauses with video recording mode. Maybe it was just due to memory stick as I was bought a cheaper quality memory card by my friend. Else, this camera is perfect. I had heard that it has a cheap plastic feel to it. But honestly, tell me who cares so much abt it. From a distance it looks and feels great. ANOTHER MINUS.. I wish this camera was weatherproof like my Olympus.", "Date": "May 12, 2007"}, {"Title": "Great great camera!", "Author": "kg", "ReviewID": "RQORC8E625M3J", "Overall": "5.0", "Content": "I LOVE this camera. It has taken beautiful pictures for me and has some really neat settings. I'm a technologically challenged college student, but this camera is so easy to use. I love using the black and white and sepia settings.Great deal for the price!!", "Date": "May 12, 2007"}, {"Title": "Nice, inexpensive digital camera!", "Author": "K. Hodges", "ReviewID": "RT3B1O3E23MXU", "Overall": "4.0", "Content": "This camera takes good pictures, zooms in pretty well. I do think it is worth the money. It does seem to be geared towards people who are relatively new to the digital camera world and or maybe someone who is not planning on taking millions and millions of pictures, maybe just on special occasions, or something to that effect. Overall I believe the camera is a good buy.", "Date": "May 12, 2007"}, {"Title": "Great value for the price!", "Author": "C. Burcky \"80s fanatic\"", "ReviewID": "R10BEGLQT6XW92", "Overall": "5.0", "Content": "I needed a digital camera that was easy to pick up and use, and this fit the bill! Just let me point out that I don't know about the specifics on digital cameras, but I do know that this can take pics pretty quick, has a pretty high megapixel count (7.2) and is a great value for the price! I highly recommend this camera to anyone who just need a camera to snap some quick pictures with.", "Date": "May 11, 2007"}, {"Title": "Sony Cybershot Digital Camera", "Author": "M. Pichardo", "ReviewID": "R1WBEDC4EM0ZCG", "Overall": "4.0", "Content": "The Sony Cybershot is a great camera. The colors and the features are amazing. Is very easy to use. The only thing I dont like about the camera is the zoom in and out button. If you zoomed in you wont be able to zoom out.", "Date": "April 10, 2007"}, {"Title": "Possibly the worst camera I've ever used", "Author": "Corey Janson", "ReviewID": "R3FT53L2OU9GY2", "Overall": "1.0", "Content": "I purchased this camera to snap off some photos when I moved to Vancouver for school (I left my other camera on the other side of the country) and it's one of the worst mistakes I've ever made.When it's not taking blown out white pictures or pitch black images, it's snapping off blurry or orange tinted images.I brought my first one back for another one- the same problem!(And before anyone says that I just don't know how to use it, keep in mind that I've been a photographer for a few years.)Add to that the countless number of reviews for this camera for the same problems that I'm having and you get one bottom line- THIS CAMERA IS A DUD!I'll never buy another Sony camera again in my life. In fact, as the go-to-guy for my friends when buying tech gear, I've told them to stay away from Sony cameras from introductory to professional.I'm sticking with my Nikon from now on. This is possibly the worst camera I've ever used (and that says a lot)", "Date": "November 9, 2007"}, {"Title": "Great Camera", "Author": "Natalie", "ReviewID": "R32YPG5DU6HKD7", "Overall": "5.0", "Content": "This is the best digital camera I have ever owned. It comes in different colors, it's easy to use and understand, and so much more. For what you're buying these days, 200 dollars isn't so bad for a camera like this. The clarity is AMAZING, and I will never regret buying it.", "Date": "July 19, 2007"}, {"Title": "Great Camera", "Author": "Davvalco", "ReviewID": "RFN9X872KA1ZI", "Overall": "5.0", "Content": "This is my first digital camera, and I have to say that is great, easy to use, compatible with my PSP and w810 phone memory, took a lot of pics on 5 MP quality and they look really good, and it's cheap compared with other digital cameras and its Sony.  The price dropped like $100 since I saw it like a year ago.", "Date": "June 13, 2007"}, {"Title": "Shocked it was made by Sony", "Author": "T. Glover", "ReviewID": "R27VUBSMVG8BYD", "Overall": "1.0", "Content": "I recently purchased this camera because I had dropped my last one by accident. Yes the price was fair and it was a Sony so I said why not. I went on vacation and every picture that I took came out blurry and I thought when I would develop them it was going to be ok . Wll it wasn't I was shocked that the slightest move or wind would make my pictures come out so horrible. The camera is very sensitive so I say be wary of this purchase but I know that I will not purchase another sony camera ever . Ohg by the way I returned it as soon as I got back from vacation.", "Date": "December 4, 2007"}, {"Title": "Very Pleased and Highly Recommended", "Author": "Mark A. Holly", "ReviewID": "RBFZJV5YCJ6XE", "Overall": "5.0", "Content": "I have never owned (or even used) a digital camera until I puchased the DSCW55.  I am very pleased with the ease of use and reasonable price.  I purchased the camera solely because of its high Consumer Report rating.  I do advise that one read the user manual first to become familiar with all the settings.  I especially like the rechargeable battery and charger.  I also purchased at 2GB memory stick pro duo which holds hundreds of pictures.  Very pleased.  Highly recommended.", "Date": "May 14, 2007"}, {"Title": "some goods lots of bads", "Author": "BHBE", "ReviewID": "RG68T0HM7PPDI", "Overall": "2.0", "Content": "My husband and I had decided to get this camera because we needed something smaller compared to our old digital that can actually hold a floppy disk. This camera is compact and fits right into your pocket. I like that the dial on the back is very user friendly, when you move it to a new setting the description pops up on the screen. However I do not like the shutter delay, it's awful. It sets off like 3 flashes which blinds whoever you are takeing a picture of and they blink. Which is horrible for babies and kids. The red eye reduction was on and still red eyes were in several pictures. Also I just recently went to a Nickelback concert and this camera let me down horribly. I wasn't that far from the stage but still needed to zoom in all the way and no matter what setting I tried my pictures were blurry and very grainy. Out of about 80 pics probably 6 were good and thats because the performers were standing really still. I cannot tell you how many times I missed my kids perfect smiles because of the delay. I just ordered a canon and I hope that it doesn't let me down.", "Date": "April 19, 2009"}, {"Title": "v. happy", "Author": "A. Borman", "ReviewID": "RN08RPA9VWJYA", "Overall": "5.0", "Content": "I am v. happy with my purchase - it came just days after I ordered it.  It's easy to figure out and the pictures are amazing!  Only thing is you have to buy the special memory cards for Sony... just one extra step that I'm willing to take though.", "Date": "September 13, 2007"}, {"Title": "Love it!!", "Author": "C. Murga \"Bronco Fan\"", "ReviewID": "R17LM9S6JS91BN", "Overall": "5.0", "Content": "I love this camera, it takes very nice pictures, user friendly and it doen't look like my husband's silver camera!", "Date": "August 23, 2007"}, {"Title": "Lens gets stuck", "Author": "Christopher W. Tham \"Chris Tham\"", "ReviewID": "R1KYY0M8KEOBX2", "Overall": "4.0", "Content": "My wife and I love this camera however the first one we got and the replacement both have the same issue of the lens getting stuck when you turn it on.  This seems to happen about 20% of the time.  The only way to make it work is to push the lens corner so that it comes unstuck.  Then it is fine until the next time it gets stuck.Everything else about the camera is great.  Fast pics, easy to use, good quality, lightweight, etc.", "Date": "August 4, 2007"}, {"Title": "camera", "Author": "person \"person\"", "ReviewID": "R26J94UMKXGWZ0", "Overall": "4.0", "Content": "it is a good camera overall, but the wheel changes to easily and you end up taking pictures on the wrong mode. also the mdoes are somewhat confusing but overall it is great.", "Date": "July 26, 2007"}, {"Title": "Cybershot W55", "Author": "ad283m \"ad283m\"", "ReviewID": "R329BLDS886L6W", "Overall": "5.0", "Content": "The camera is great, takes fantastic pictures with or without light.I went to the licing room and turned off the lights, the image of the picture was great, as if I hadn't turnedd off the lights at all.Also, It looks great really elegant.", "Date": "July 3, 2007"}, {"Title": "camera and case are good. Card reader nan.", "Author": "M. J. Haney", "ReviewID": "RGZDAYQ85ZECN", "Overall": "4.0", "Content": "Camera and case are good. Card reader nan.I found no issue with software, cable, case nor camera. Works great. The card reader is a joke. I highly recommend getting a memory card right way. The camera is so slim and handy I  use it way more that I thought. Love the video function too. I get praise on the pictures and the cute color.", "Date": "July 3, 2007"}, {"Title": "perfect", "Author": "N. Nor", "ReviewID": "RIHYC5P66ROJ1", "Overall": "5.0", "Content": "despite its size that is kinda big and bulky(well for me yes..because i used to own an ultra small pentax optio), but this camera has a little to no weight at all! It snaps a very bright, clear pictures even in a dim room. I bought this for a gift and it's a perfect one..pinky, smart looking etc...", "Date": "May 27, 2007"}, {"Title": "nobrainercamera", "Author": "j-man", "ReviewID": "RZR61AAYGAJNI", "Overall": "5.0", "Content": "I had used an Olypus digital that I paid about $900 for. Granted in the past 4-5 years cameras on all sides have gotten easier and better but this little Sony that fits in your shirtpocket is ten times the camera as the Olympus. I send lots of email photos and this one will hold a weeks vacation without any backup. The adjustments for red eye, closeups, are all very good.", "Date": "May 12, 2007"}, {"Title": "Pretty in Pink", "Author": "A. QUINONES", "ReviewID": "R1I59G004GHQ5H", "Overall": "4.0", "Content": "It is a nice camera.  Takes nice pictures as well as video. I would recommend purchasing this item.", "Date": "October 8, 2007"}, {"Title": "not that great", "Author": "carla", "ReviewID": "R2NAA9LITLTVYQ", "Overall": "3.0", "Content": "bulkier than it looks, and it feels like a toy. not very solid at all, and the pics aren't that amazing either.", "Date": "September 21, 2007"}, {"Title": "Love it...Gotta have it!", "Author": "M. Midgette", "ReviewID": "RKBI7FUG8X4F4", "Overall": "5.0", "Content": "This is the best digi I've ever owned. It takes wonderful pics, is compact, and it comes in girlie pink...I carry it everywhere to have many memories remembered. It uploads pics quick online and to iphoto on my Mac. I love it!", "Date": "July 19, 2007"}, {"Title": "V. Cuuuuuuuuute Digital Camera", "Author": "Reem AlBassam", "ReviewID": "ROI4C06LFKFB9", "Overall": "5.0", "Content": "i Loved it sooo much & its so easy to use.. Great price.Nice availables colors.. i took the blue one.. it should b called baby blue; )Nothing much to say but its highly recommended.. : )", "Date": "April 29, 2007"}, {"Title": "Piece of Junk", "Author": "A. Seitz", "ReviewID": "R180KPCPZROKNF", "Overall": "1.0", "Content": "To say I despise this camera is an understatement. What a waste of money. Sometimes it takes great pictures. Key word - sometimes. Most of the time, however, the pictures are dark & fuzzy. I don't mean blurry - FUZZY, as if it just can't focus. The lens is clean, I've turned on every light possible, and I try taking a picture on every setting, hoping to find one that's somewhat better. It's maddening. After a YEAR of this, and hardly having any decent pictures of my baby's first year of life, enough is enough. This thing is going in the trash, and I won't be buying a Sony as a replacement.", "Date": "December 20, 2009"}, {"Title": "Rate of Sony Digital Camera MP 7.2", "Author": "Merchades M. Rutechura \"Method\"", "ReviewID": "R1XBF2TQMHXA91", "Overall": "5.0", "Content": "THANK YOU FOR THE PRODUCT YOU SOLD TO ME.IT IS REALLY WONDERFUL AND I ENJOY IT.", "Date": "February 15, 2008"}, {"Title": "Good product...Slow shipping", "Author": "S. Delgado", "ReviewID": "RF5HP7I8LT9F6", "Overall": "5.0", "Content": "Good product...Slow shipping because I paid a fast one and i got like in standard shipping", "Date": "January 29, 2008"}, {"Title": "sony cyber shot", "Author": "Judith Persisng \"Judy Persing\"", "ReviewID": "R1HMP1VHAL9AUG", "Overall": "5.0", "Content": "This Sony cybershot was a Christmas gift and she was very happy with it.  It takes beautiful photos...sharp and the clarity is wonderful.", "Date": "December 29, 2007"}, {"Title": "Great camera, great gift.", "Author": "Shawn Lee \"Shawn Lee\"", "ReviewID": "R1WJ7DLUZCQ9J1", "Overall": "5.0", "Content": "It's a great camera and it's pink. I bought one for my girlfriend and was a hero at Christmas. And for the deal on Amazon...nuff said!", "Date": "December 28, 2007"}, {"Title": "Camera", "Author": "Dana E. Tenaglia", "ReviewID": "RJRFGEG0ASJ47", "Overall": "4.0", "Content": "I bought this camera for my 10 year old daughter.  It is easy for her to use and she loves it!!!", "Date": "December 24, 2007"}, {"Title": "Made in China", "Author": "jesprit2", "ReviewID": "RENNIVQTNR9WJ", "Overall": "4.0", "Content": "Easy to use and very handy plus a real value for money. Big dissappointment when i saw that it is made in China. I checked the same model around the local stores here and found out that it is all made in japan. Right there I wished I did not purchase online specially when it comes to electronic. I don't know why they shipped this one to me and not the one that is made in Japan.", "Date": "December 21, 2007"}, {"Title": "WOW, what a great little camera!", "Author": "Rachael Johnson \"Rachel J. Amato\"", "ReviewID": "R3U580ZKSV1A3U", "Overall": "5.0", "Content": "Sony continues to amaze us consumers with products beyond our expectations. Great little camera, I recommend it anyone that takes pictures. Rachel,Davie Fl.", "Date": "December 13, 2007"}, {"Title": "sony cypershot camera 7 megapixels", "Author": "D. Gueldner \"proud parent\"", "ReviewID": "R36LNBQI6MN4V8", "Overall": "5.0", "Content": "I bought this camera for my daugters birthday.  It is adorable, metalic blue and I also bought the metalic pink(they are twins).  The camera is so easy to use they were making quite lengty vidoes on it in minutes. The view screen is huge, the quality of the pictures is incredible. There camera is better than mine, which I paid twice as much for.  I would highly recommend this camera to someone who wants purse size convience and really beautiful pictures.", "Date": "November 29, 2007"}, {"Title": "Nice camera!", "Author": "E. Bacarella \"EP shopper\"", "ReviewID": "R292ETAIXFBR1C", "Overall": "5.0", "Content": "I am very happy with this camera.  It is easy to use and the price is great!", "Date": "November 29, 2007"}, {"Title": "Great little camera!", "Author": "Jeanne Burch \"ashbury555\"", "ReviewID": "RMXE0XTMTHAS8", "Overall": "5.0", "Content": "This is an upgrade to our first Sony Digital Camera.  It is lightweight, easy to use and takes incredible photographs.", "Date": "November 28, 2007"}, {"Title": "The cyber shot camera is great", "Author": "Shamaine Elledge", "ReviewID": "RM0G126RD979F", "Overall": "5.0", "Content": "The cyber shot digital camera by Sony is a great camera. The camera can take so many amazing out standing photos that has been great to show family and friends. This camera is great for anyone who loves taking photos or who just wants to remember their memories.The settings on this camera are hard to figure out at first but as you play with camera more it becomes easier and a lot more fun to have. There are many settings for the seasons, weather, time of day, and whether you are indoors or outdoors. When changing these settings the camera may adjust to the correct scenery but if wrong settings are set to the wrong scenery than the camera may not adjust as well. Also with the settings is the zoom. The zoom is great because it can zoom in very close and zoom out very far. It is very affective and great. Even when there is a picture saved and you need it to be zoomed in closer you can zoom in on that image and make it show even better.When saving pictures its easy with just a press of a button. The camera may be a small little device but it stores a lot of pictures and videos. It also has a small memory stick that holds a lot of pictures and videos so there is twice the storage.This camera is not only tiny but is very lightweight. It can be stored in your purse back pocket, shirt pocket, and other places too. It comes in three different colors silver, black and even pink.This camera is just a great way to remember life when looking at the crisp clear pictures. I use this camera all the time and have never regretted purchasing it. It is just amazing that an item so small can achieve so much and make people happier with their pictures especially with showing their family and friends. I truly believe this camera is one of the best digital cameras out today.", "Date": "November 27, 2007"}, {"Title": "Great deal.........................", "Author": "bigsweetpotato", "ReviewID": "RJTW3HPOHIU9T", "Overall": "5.0", "Content": "I'd brought this camera for my 14 yrs old son birthday, he loved it.This camera is easy to use & have a lot of functions. I think this is a must have camera.", "Date": "November 22, 2007"}, {"Title": "Excellent Camera!", "Author": "A. Orlando \"License\"", "ReviewID": "R1L188TD7RER78", "Overall": "5.0", "Content": "I bought this camera for my wife for her birthday. She loves this camera! Good times for me!", "Date": "September 6, 2007"}, {"Title": "Sony Cybershot 7.2 Black", "Author": "highly educated latina", "ReviewID": "RGJWWVNEIA7SE", "Overall": "5.0", "Content": "This is my first digital camera and I am glad I bought a SONY. I have bought various SONY products in the past and have never regretted it. The camera takes great pictures, there are different modes when taking pictures and make a difference in the pictures when you \"snap the shot\". As long as you sit down and read the manual when you receive the product, you will have no problem with using the camera. In terms of the zooming, I wish it could zoom a bit more but with the 3x zoom, the camera is still good. It is compact and fashionable. I highly recommend the Sony Cybershot DSCW55 7.2MP Digital Camera with 3x Optical Zoom.", "Date": "August 25, 2007"}, {"Title": "awesome", "Author": "Pamela Cox", "ReviewID": "R2W9RRG5RW13GS", "Overall": "5.0", "Content": "thany you so mush I love my camera and thank you for your swift shipping I got and took pic,of grandchild and it is wonderful", "Date": "August 24, 2007"}, {"Title": "very good products and services", "Author": "Lihua Cox \"well\"", "ReviewID": "R1HRE6GOLBQSUZ", "Overall": "5.0", "Content": "product is good, and shipping is fast, we like both product and seller, we will use this seller again.", "Date": "August 17, 2007"}, {"Title": "Excellent!", "Author": "Melanie Mays", "ReviewID": "R181BQCMAI2ZFN", "Overall": "5.0", "Content": "I love this camera. The colors show up so vibrant! It is so easy to transfer pictures and video from the camera to the computer, or from the card(bought separate) to the computer. It's super light-weight and super easy to use.", "Date": "July 3, 2007"}, {"Title": "just what i wanted", "Author": "T. Dijos", "ReviewID": "R2TAU6773H4P1E", "Overall": "5.0", "Content": "this camera is not only sleek and sexy, but it is the perfect camera for anyone. i especially like how huge the screen is.", "Date": "July 1, 2007"}, {"Title": "Great little camera.", "Author": "K. Price \"KP\"", "ReviewID": "R28XXKUSWBBCAJ", "Overall": "5.0", "Content": "I have a large Sony digital camera which I really like but I was looking for a small version that I could stick in my pocket.  This is a great little camera.  Really enjoy taking pictures with it.  Not sure how much I will want to use my larger Sony now that I have this one.", "Date": "May 9, 2007"}, {"Title": "Lens got stuck had to return", "Author": "J. Marie S.", "ReviewID": "R1LTTJBP1BXWXD", "Overall": "1.0", "Content": "I bought this camera and loved the look of it, the feel of it, the photos, the size . . . all until, within 2 weeks of buying it and without anything at all happening to the camera to provoke this problem, the lens stopped opening.  I would turn on the camera, it would start up but the lens cover would not open.  I would turn it off and turn it on again and it would sometimes open the second time and sometimes not.  I loved the camera so much I thought I'd give it a day to \"sort itself out,\" but it just got worse.  So, I'm sending it back and going to try to find a suitable replacement for what the camera was before it broke.", "Date": "September 17, 2007"}, {"Title": "good for taking pics, bad for recording video", "Author": "A. Diri", "ReviewID": "R1VP8YZZB9BQ58", "Overall": "2.0", "Content": "With this camera, I think, you can take good quality pics but there is something wrong about recording video. Because, when you watch videos recorded by W55, you hear a very annoying sound like a machine is working inside the camera..I returned my camera to Amazon two days after I received..", "Date": "July 4, 2007"}, {"Title": "HORRIBLE durability!", "Author": "Steven B. Keith", "ReviewID": "R3PORNP5DD3L5Q", "Overall": "1.0", "Content": "I got this thing and barely ever used it.. took OK pictures but I dropped it ONCE in the grass while i was camping and the shutter wouldnt open, the flash bulb blew out and I couldnt open or close the shutter!  I sent it back and they wouldnt fix anything because I had tried to manually close the shutter to see if it would reset it self or something?  But no.. they wanted me to pay something like $140 on a camera that I got for $150.. I always trusted Sony but now im going with another company.  What a piece of junk!  Get it if you know you will never ever drip it.. not even on soft grass.  Good luck, losers.", "Date": "May 20, 2008"}, {"Title": "Was not impressed!!", "Author": "Jenn", "ReviewID": "R10JO4LWSTTREC", "Overall": "2.0", "Content": "My parents bought my little sister a digital camera for her birthday. I borrowed it and was so impressed with the pictures it took, I immediately wanted one of my own. Ignoring my gut feelings, I bought this camera instead of the one that she had - an Olympus Stylus FE-230. I was immediately disappointed by the pictures it took. They all seemed grainy and BLURRY. No matter how hard I tried, or how much I tinkered with the settings, 80% of the pictures were horribly blurry. I had to work hard to brace my arms and hands to get a decent picture. I took it back the very next day and got the Olympus Stylus FE-230, which I am extremely happy with. If you think you're going to have any trouble keeping your hands still, I would NOT recommend this camera.", "Date": "September 1, 2007"}, {"Title": "Great but some things not too great", "Author": "Mridul Lidder", "ReviewID": "RE1IPS8HTFLEF", "Overall": "4.0", "Content": "I bought this camera becuase it was a great camera and not too expensive. I'm happy with it for the most part. great pictures and video. Not too many effects on it though and i still havnt figured out how to make the pictures  black and white. It's not a really simple camera...but besides all of that, the thing i didn't like about it is that you can't zoom while videotaping. Why in the world would you make a camera that dosn't zoom?? i can't figure it out. but whatever. it's a cool camera! :)", "Date": "June 26, 2007"}, {"Title": "Sony DSC-W55 Camera is junk", "Author": "Texas Dad", "ReviewID": "R1FQ1T03636RJB", "Overall": "1.0", "Content": "This is my second camera of this model.  I loved the first one I bought last year, but dropped it on the kitchen counter about 12 inches and the lens stopped working.  I was quoted $150 to repair it, and instead opted to buy the same model again because it took great photos and thinking the first camera was a lemon.  Six months into owning the 2nd camera, the lens quit ejecting. In addition to cheap plastic parts on the sides, this will be my last Sony camera.", "Date": "October 9, 2008"}, {"Title": "Returning this camera for refund", "Author": "Karl E. Kammer \"gizmod\"", "ReviewID": "R16UORDAGI5OWJ", "Overall": "1.0", "Content": "This camera took worse pictures than my old 3.1 MP camera, every picture came out grainy looking, poor focus control. Very disappointed with Sony on this camera.  I am going to get a refund on this camera and try something else.", "Date": "April 8, 2008"}, {"Title": "Amazon did not deliver it on time", "Author": "EMGgirl", "ReviewID": "R38OACEN08Q522", "Overall": "5.0", "Content": "This is a great camera - too bad I had to call all around the area to find it and drive out of my way to get it due to Amazon's incompetence.If you need something in a hurry, do not rely on Amazon to get it to you overnight, even having paid $35 for delivery.", "Date": "August 12, 2007"}, {"Title": "Nice machine!", "Author": "F. Bayram", "ReviewID": "R1ANPO4J9EQ4K7", "Overall": "4.0", "Content": "I used Sony cameras before. I would say this one is really nice. I'm happy with the picture quality. Easy to use and nice looking as well... I would recommend it to anyone...", "Date": "May 9, 2007"}, {"Title": "Great camera", "Author": "Shirley Smalls-smith \"Lady Chica\"", "ReviewID": "R3RKEQLS26F8RB", "Overall": "5.0", "Content": "The camera takes great pictures, it very easy to use I love it.", "Date": "June 14, 2007"}, {"Title": "junk", "Author": "J. A. titterington", "ReviewID": "R3L78TVR0IPTDF", "Overall": "1.0", "Content": "This might have been a nice camera had it worked. It was broken right out of the box. It is highly unlikely I will never use your web site again if this is the product I can expect. Your site was supposed to save me time and has only been more of a headache than it was worth.", "Date": "January 13, 2008"}, {"Title": "Good Camera but don't pay more then 140", "Author": "chirag", "ReviewID": "RV21ESNNXPIG7", "Overall": "4.0", "Content": "It is a good camera, but you can buy this from Amazon itself for 139$ (if you choose a non-pink color), or from elsewhere for 150$ for pink.If you can afford upgrade to W80.", "Date": "December 15, 2007"}, {"Title": "Great while it lasted..", "Author": "J. Reed", "ReviewID": "R3U4P94RWQL087", "Overall": "2.0", "Content": "I purchased this camera in May and it worked great at first, other than the videos being a little fuzzy, and not taking very good low-light pictures. But around the end of June the shutter started not opening and closing correctly, and the battery power didn't last. Now it isn't working at all. It won't even turn on with a charged battery. Dissapointing.", "Date": "September 28, 2007"}, {"Title": "Awesome machine!", "Author": "Erman Kaya \"crasher\"", "ReviewID": "R1SN68KVXP9JVA", "Overall": "5.0", "Content": "it is such a perfect stuff! It looks real cute. I am so pleased having it.", "Date": "August 16, 2007"}, {"Title": "Sony Cybershots", "Author": "M. M. Gillan \"Book-Worm\"", "ReviewID": "R389DPA3H8S4CR", "Overall": "5.0", "Content": "There are better & new models avaialble, but these are over $300. If you do not want to spent more money, it is the best model.  Easy to use & good results.", "Date": "August 13, 2007"}, {"Title": "Great!", "Author": "Student", "ReviewID": "R2AJ6EP545NTKH", "Overall": "5.0", "Content": "Love this camera.  Good quality.  Very light weight.  Consumer reports is right.  Best value.", "Date": "August 13, 2007"}, {"Title": "Sony Cybershop 7.2 MP digital camera", "Author": "A. N. Herring", "ReviewID": "R1TMANKUI2A6GH", "Overall": "4.0", "Content": "Very cut-looking camera, but not for a novice!!!!  Had to get my great niece to show me how to use  it properly.  Instructions are a joke!!!  Worthless, as far as I am concerned.", "Date": "July 23, 2007"}, {"Title": "Camera Review", "Author": "EJM \"EJM\"", "ReviewID": "R7EZWYSKVH4I", "Overall": "5.0", "Content": "The camera is very good - easy to use etc. and was delivered in good condition.  We are very pleased with it, but have not used it very much so far,  Have not used the battery yet, but I assume it works.", "Date": "August 14, 2007"}, {"Title": "Great features and light weight, great photos!", "Author": "Campmaster Tom \"There's no place like 127.0.0.1\"", "ReviewID": "R4DTA7AQSHVNX", "Overall": "5.0", "Content": "This phone seems to be made of good quality material, very nice style. It's light weight, easy to carry. Has very good battery. The LCD screen is has a good image display, the picture quality is very good and movie quality is also very good. Very pleased and would recommend, great price vs. performance!", "Date": "May 26, 2007"}, {"Title": "IT is ok", "Author": "Lina Dyu \"hurryup2lina\"", "ReviewID": "R2EPTRN34ZRG5N", "Overall": "3.0", "Content": "On the picture the camera looks great. but i do not like plastic cover i prefer metal one. I expected more from this camera than it actually does perform.", "Date": "October 1, 2007"}, {"Title": "Started out ok", "Author": "A. Tartakoff", "ReviewID": "R1BN8PNT6864ZW", "Overall": "2.0", "Content": "At first i was happy with this camera, perhaps lulled by it's good looks and  small size, then I woke up and realized that half of my pictures were out of focus, even when i allowed for the beep supposedly telling me it is focused, achieved by holding the button half way momentarily before taking the picture. Now it seems there is a glitch in the menus. the other day i watched as it scrolled through all the menu settings as if I were turning the menu knob atop the camera. I wasn't.I don't think it's worth my time to send it in for repair. I'll just save for a cannon, I've read good things.", "Date": "November 27, 2007"}, {"Title": "BEWARE!! DEFECTIVE AND PLASTIC!", "Author": "P.Mendoza \"Camera addick\"", "ReviewID": "RN4Q5M6OGDOYI", "Overall": "1.0", "Content": "First of all, I would just like to say that the camera feels cheap.. the buttons are made of cheap breakable plastic. BAD SONY.. (SAYS A LOT ON THE STATUS OF THE COMPANY) which you have to take extra care for.. I bought the W55 pink with case for my girlfriend for our anniversary. I was really expecting a lot from the camera. but just after 2 ... I REPEAT 2 HOURS of total use.. the camera's LCD STARTED SHOWING LINES ON THE SCREEN.. I mean what the... it was never dropped or broken whatsover. I gave the gift late at night so she wasnt able to use it that much. The next morning, she turns on the camera and there.. lines started showing up whenever you take photos.. Amazon I would like a refund or a replacement for this pls.. DONT BUY THIS CAMERA BEWARE.. SONY IM VERY DISSAPOINTED..", "Date": "June 2, 2007"}, {"Title": "High Maintenance Camera!!!", "Author": "Amy C.", "ReviewID": "RCERS7FXPY1V2", "Overall": "1.0", "Content": "This camera is terrible!!  It eats through batteries like you wouldn't believe and the red eye doesn't work at all!! (And yes, it's turned on!)  9 out of 10 photos need to be corrected!  Total waste of money!  My cheaper digital camera takes better pictures than this one!", "Date": "November 29, 2007"}, {"Title": "Wife loves it!", "Author": "Angela K. Allen", "ReviewID": "R20J35EJU0TCQE", "Overall": "4.0", "Content": "This product is great for women who are technologically handicapped.  It has little pop-ups for each setting which tells what the setting does and when to use it.  Camera use is very easy as well.  My wife loves the color, too, which all the women are jealous of (I guess grey or silver clashes and isn't an eye-catcher).  Great product, and I highly recommend it.  I would have given it a five if it was cheaper or came with a memory card.", "Date": "September 3, 2007"}, {"Title": "Bad", "Author": "Rose M. Chopitea \"chopi\"", "ReviewID": "R1HNIOV0BF4B8O", "Overall": "1.0", "Content": "my daughter in law bought this camara, the pictures are bad, the noise is like another rewier said is so loud you can hear it. I told her to stick to Nikon or Canon but you know....... she did not pay attention.The camera is very pretty I grant you that but it sucks.", "Date": "October 31, 2007"}, {"Title": "Very Problematic", "Author": "Steven Orth", "ReviewID": "R1EV3ABH1DD0BZ", "Overall": "1.0", "Content": "So I got my sister Annie, this camera for her birthday. She was really excited, when she opened it up. I go into the kitchen to make flapjacks and sausages. Then all of a sudden, I hear Annie and my wife Linda screaming. I smell smoke. I rushed back into the living room and my sister Annie is on fire. Apparently, she tried to take a picture of my wife and her brand new Sony Cyber-shot bursted into flames, catching the sleeve of my sister's cotton blouse, leaving her with second degree burns. Also, you can't hear the sound on the video playback.", "Date": "April 9, 2008"}, {"Title": "ITs OKay...", "Author": "A. J. ANGUIANO-FRANCO", "ReviewID": "R4ON06KT5POC6", "Overall": "2.0", "Content": "First of all the pictures do not have a high quality. I don't really care since I am just having fun with it. But what really bothers me is that the videos are super blurry. It takes a long time to focus and that's difficult to work with when you are trying to record.I wish I would have choose a better camera.", "Date": "May 14, 2007"}, {"Title": "The camera is just bait, the delivery is hell...", "Author": "Angel", "ReviewID": "R2T56CYIUF5JEV", "Overall": "1.0", "Content": "I purchased the case and the SONY 7.2 MegaPyxel camara... yes it sounded good, free shipping, over nigh delivery, You are the customer and we are here to help... what they don't tell you, once they have the money my overnight delivery was change from PROMISE DELIVERY on the 18 of December to the 21st of FEBRUARY 2008.  Now I check with the availability of the products... they have it IN STOCK. yet they can delivered the item overnighth (today is the 26 of DECEMBER) and after I complained at the delay delivery they are going to send it to me at their cost, OVER NIGHT DELIVERY  on the 21st OF FEBRUARY 2008.", "Date": "December 26, 2007"}, {"Title": "good product", "Author": "KING LUN WONG", "ReviewID": "R4H7TSEIEBHGD", "Overall": "3.0", "Content": "it is a brand new product when i'm received. functionare good and i like it.", "Date": "July 8, 2007"}, {"Title": "Never recieved the camera.", "Author": "B. Holland", "ReviewID": "R1VFHU7VAHCUZQ", "Overall": "1.0", "Content": "It's been over a month now. Where the heck is my camera? Purchased on 8/27 and it is now 9/27. I've decided to take serious action. DO NOT PURCHASE FROM THIS SELLER!", "Date": "September 27, 2007"}, {"Title": "Easy Digital Camera", "Author": "CARLOS G. TORRES LOPEZ \"El Profe\"", "ReviewID": "R2VX890LTOSQ2M", "Overall": "1.0", "Content": "a camera very versatile and easy to use with many additional tools that maximize their operation", "Date": "July 19, 2007"}], "ProductInfo": {"Price": "$374.34", "Features": "7.2-megapixel CCD captures enough detail for photo-quality 14 x 19-inch prints\n2.5-inch LCD display; 3x optical zoom\nHigh-sensitivity shooting mode increases ISO to maximum of 1000\nCapture MPEG VX video with audio\nStores images on Memory Stick DUO or MS Pro DUO memory cards (56 MB internal memory included)", "Name": "Sony Cybershot DSCW55 7.2MP Digital Camera with 3x Optical Zoom (Pink)", "ImgURL": "http://ecx.images-amazon.com/images/I/51eu61f3ufL._SX300_.jpg", "ProductID": "B000M4KXEC"}}