{"Reviews": [{"Title": "ok for its price", "Author": "sokha", "ReviewID": "R33NIH3KSACTVR", "Overall": "1.0", "Content": "i used this thing for 2 days and returned it for the following reasons:1)  internet viewing can only be 3 minutesthis is true for all WiLife product and not just this kit.internet viewing done via the free web address provided by WiLife.2)  the LCD clock is lit blue at night/dark and there's no option to turn it off.  so much for camouflag!!3)  emailed tech support and never got a response.  as of today....4 weeks later, still no response from them yet.4)  you need to install their software to view via LAN.internet viewing kind of useless since you only have 3 minutes from WiLife.5)  camera is completely useless in the dark and also recording quality is quite poor.  the best it can do is 15 fps.  for a moving subject, it's very blurry.everthing advertised by WiLife is true except those quirks i listed above which they didn't tell you until you use the system.i returned the WiLife and got the Panasonic instead.Axis and Toshiba seem like a good candidate also.the nice thing about Panasonic, Axis and Toshiba is that you can spend as much or as little as you want to fit your budget.WiLife camera quality needs some serious work.it depends on your needs but i need a security system that i can identify the culprit's face and that means i will need PIXEL from the camera.  unfortunately, WiLife has no camera that can do this.INSTALLATION:WiLife installation is plug-n-play.the easiness installation of placing the camera anywhere that has electrical outlet in your house is nice.  keep in mind that you can do the same with other brand like Panasonic.  you just need to purchase the thing that called \"powerline\" which convert your household electrical outlet into LAN without having to run your own LAN cable.LOCAL MONITORING:you need to install WiLife software for local viewing compare to Panasonic doesn't need anything special.RECORDING:recording can only be done with local computer that has WiLife software.you can record continuously or based on movement.the recording used WM9 encoder.quality is ok.bad for security purposes since their no FTP for you to send the recording.imagine if the culprit stole the computer with WiLife.you would have no proof of the event!if you have multiple cameras, you will need some powerful computer.WiLife provided the list for this.if you're serious about security, better to spend money on DVR.ALERT:alert via email works as advertised.you can set sensitivity on the movement before activate the recording.CONCLUSION:keep in mind that Panasonic, Axis and Toshiba are the system use by the bank, airport, hotel, mall, park, government building, etc.those brand are for serious security compare to WiLife target the low-end market.  you can get a decent system from Axis or Panasonic for $319 which is the price for WiLife kit.  i chose Panasonic because of its zoom, pan and tilt capability and when i'm ready to spend more money, i can stay within the same brand.  Panasonic allows monitoring up to 12 cameras per account compare to WiLife only 6 cams.  recording quality, 3 minutes internet viewing and no FTP were a serious turn off for me with WiLife.i will write a separate review regarding the Panasonic after a couple months of usage.  also will post the review on my own website, sokhaDotCom.", "Date": "August 28, 2007"}, {"Title": "Good quality & easy to use", "Author": "Y. Pinhas", "ReviewID": "RS8950ENPSYC4", "Overall": "4.0", "Content": "The product is high quality and easy to use. This is a very good choice for hidden camera. I specifically liked the quick install (just a few minutes, and it works!) and the web viewing capability.Drawbacks:1. Has a wide angle view, but still misses a bit. A few more degrees wide would have made it perfect.2. Picture details very good (excellent resolution for the purpose). Color - not good. Most of the time show black & white with very light color. To get good color requires the room to be very lighted.3. It comes with automatic \"relay\" mode that limits web viewing to 3 minutes at a time, and is very slow. Instructions to setup \"direct\" mode exist, but were working for me. I had to do more research to get direct mode working. Once I did, worked perfectly - no time limits, and no delays in web viewing.", "Date": "December 8, 2007"}, {"Title": "Extremely economical survellience", "Author": "Jet Captain", "ReviewID": "R2OK7SL7GCYDJS", "Overall": "5.0", "Content": "First, it works flawlessly at the local network level.Second,I use LogMein & Hamachi to schedule routine transfers of the .wmv files to the computer wherever I'm located.Thirdly, for a very small fraction of the cost of a commercial security system I know exactly what anyone is doing or not doing in my other locations while I'm absent.And for only several thousand dollars more you can get what some of the other reviewers think they should get for a few hundred bucks.", "Date": "November 6, 2008"}, {"Title": "great, easy system", "Author": "Julie S.", "ReviewID": "RL38UWH3BVJVL", "Overall": "4.0", "Content": "The LukWerks spy camera allowed me a great deal of peace of mind when we hired a new nanny.  It was very simple to set up, just install the software and plug in the cameras.  My husband, with the help of WiLife tech support, was able to set up direct viewing so I had a continuous stream of video to watch while I was at work.  If you want to change the area being viewed, simply unplug the camera and plug it in somewhere else.The only drawback, the picture is a bit grainy, but for my purposes it is entirely sufficient.", "Date": "June 23, 2008"}, {"Title": "Keeps freezing! Doesn't reconize camera's", "Author": "Canada \"Robbie\"", "ReviewID": "R38GGUQVTFZRGZ", "Overall": "2.0", "Content": "Once the installation was done ; wich was easy!The hole thing worked good.Then the fun starts the next day when the computer is left alone all night..Minimize wilife to bottom of screen the day before then try to open it again the next day it opens right away but camera screens stays blank..You try to find my cameras again; one that is in the same room 12 feet away and it won't.. It ask if you to do diferent things to find it wich I try still no good..Finally uninstall the program completely then reinstall it and again works like a champ! Right away everything works well!!Next day same problem!Over and over again!You guys need to fix something on this one..Easy to install yes! Hard to keep going!Rob", "Date": "March 29, 2010"}, {"Title": "Useless, doesn't work as advertized.", "Author": "Robert Clary \"bclary\"", "ReviewID": "RSMZR1YJDPUNP", "Overall": "1.0", "Content": "I set up a WiLife system on a dedicated PC in an environment that exceeds all of the recommendations, and it simply doesn't work. The software fails to record video without frequent reboots. The video quality is horrible. The live display falls behind real time so I see the FedEX delivery an hour after it's too late. I eliminated every variable from the system and ran it in a pristine lab environment and it still failed to perform.", "Date": "December 8, 2009"}, {"Title": "You can't \"realy\" view over the web:-(", "Author": "Buddy Davis", "ReviewID": "RYQ4F6P7LCGU5", "Overall": "2.0", "Content": "Not worth the money.Very easy to install.Can't plug the cameras into a power strip or ups.You can't upload to \"your\" web site.You can only upload to \"their\" web site.This makes these cameras almost useless.Not a good picture quality.Great that the cameras are \"inside\" your home looking out of the window so they can not be messed with. Bad you can't up load the video to \"your own\" web site.If you have no desire to view your cameras over the web, and you don't need power strips or ups great buy.If you want to view your cameras over the web or need power strips don't buy these cameras.", "Date": "February 22, 2008"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000N2Z41A"}}