{"Reviews": [{"Title": "What a bargin!", "Author": "Big C \"CEL\"", "ReviewID": "R2AYHQCFECX5GG", "Overall": "5.0", "Content": "I've had my Samsung S85 for a little over 2 weeks now. Before I purchased it , I spent many hours looking over reviews and comparisons of many different digital cameras before I decided on getting the S85. I could not find any reviews with anything negitive to say about the S85. At first I was prepared to spend anywhere from 2-250 dollars on my next camera. But after I did my research, I could not justify spending $200 plus on a Sony cybershot, when the S85 offered me all of the same features and then some, for under 130.00.As far as picture quality goes, the color, and detail of the photos this camera takes are fantastic. Even zoomed all the way to 5X the pictures are still very clear. Once you start going into digital zoom the pictures predictably become less clear.One thing I noticed many reviewers stating was that the interface on the camera itself is somewhat complicated and difficult to use. I can see why they say that. But it  I don't think it is a deal breaker. After playing around with the controls for a few minutes, I quickly became comfortable with how the controls worked. As far as the overall fit and finish of the camera goes. It won't win any beauty contests, but overall the camera feels very solid.The camera comes with 2 AA alkaline batteries included. However as the above reviewer stated, the thing eats through alkaline batteries rather fast. Rechargable batteries are a must.DON\"T LET THE PRICE OF THIS CAMERA FOOL YOU. All of the functions it offers(and there are loads of them)work exactly as they should. If you are looking for an ultra compact digtial camera, and aren't looking to spend loads of money on it. You don't have too. The Samsung S85 is a steal!", "Date": "January 9, 2008"}, {"Title": "Portable Dynamo with a Sharp Lens -- 4 years later", "Author": "John D.", "ReviewID": "RDTDLU5EI155Y", "Overall": "5.0", "Content": "November, 2011 Update: Although the S85, with its excellent lens, manual control, 5x zoom, and sturdy frame is still a solid little camera, one shouldn't pay more than $60 or so for a good used S85 if a used Canon with optical image stabilization, like the A2000 IS, comes available online for less than $100. At the same time, the S85 lens is sharper than that of the Canon A590 IS, and the flash is  stronger. Because of its sharp lens and natural color, at a modest price I would choose it over most any other model without optical image stabilization. This little baby is a classic, but it does need good rechargeables, as I note in the review below.---------------------Looking for a more portable, less expensive second camera with a fairly long zoom, I happened on a S85 in a store and snapped some surprisingly clear, high-resolution images even at the far end of its 5x optical plus 5x digital zoom (25x). The two web reviews at the time (\"Trusted Reviews\" and \"Register Hardware\") were both very positive so I bought it and am very happy I did.The S85 eats up Alkaline batteries like popcorn, so rechargeables are a must.  Alkalines shut the camera down after just a few pictures, the zoom still half extended, suggesting some ominous malfunction.  Changing to rechargeables (especially Sanyo Eneloops) removes the problem permanently.  No need to return the camera or bother Samsung's customer service.The S85 has a myriad of functions and shooting options but it's \"fiddly,\" as one reviewer puts it, so they're revealed only by a confusing combination of buttons.  It takes time to master them all, but well worth the effort.The \"Program\" mode is preferable to the \"Auto\" mode since it allows setting the camera at the lowest ISO for clarity of image and selecting the best white balance.  It is especially preferable in indoor flash situations since with the flash in \"Auto\" come higher ISOs, overexposing nearer subjects and causing noise as well. For superb results, set the ISO on 50 and the flash at anything other than \"S\" (\"Slow\"). You'll be delighted! It has a powerful flash.The \"Manual mode\" allows almost complete camera control, something very valuable for set-up conditions like tripod or macro shooting (the S85's macro capabilities are amazing).  The \"Movie clip\" mode seems to work very well.  Its version of image stabilization, unlike the optical IS system found in many other cameras today, is operable only within a specially dedicated \"Advanced Shake Reduction\" mode (ASR), and then only without use of the flash.  The ASR mode somehow produces sharp images, holding the ISO around 200 to 300 but with a longer shutter-lag.  When I bought the S85 those portable compacts with true optical IS all cost at least twice as much and then were without some of the S85's other valuable features.The red eye removal function is strikingly effective. The S85 does have a red-eye prevention setting which also works well, but its use increases shutter-lag and so I prefer correcting the problem after the fact. The \"E\" button offers additional post-processing adjustments, such as modifying brightness, contrast, and even color due to any white balance error.  On the other hand, the S85 has an extraordinary feature preventing this problem which was discovered by a reviewer of  the S730 on this site.  To shoot in low light situations without a flash, before taking the shot, hit the E button, select \"Image Adjust\" and then \"Saturation.\"  Next, point the camera toward the subject and hit the \"OK\" button.  Doing so adjusts brightness and color for all successive pictures in the same environment.  In a new lighting setting repeat the process to again produce perfect results.The S85 has three automatic focus options: spot, center, multiple, along with a \"face recognition\" capability. The impressive 230,000 pixel, 2.5\" LCD has adjustible brightness (\"dark\" is normally sufficient), and the S85's image colors are very true to the world one sees with the naked eye.  It has a very solid feel, heftier than the earlier S630 and S730, at the same time being the most compact of all the \"S\" series Samsungs.  The S85 slips comfortably into a front pants pocket, even when housed in the very inexpensive Samsonite soft shell case I got for it on E-Bay to protect it from dust and the \"thousand natural shocks that [cameras are] heir to.\"With its combination of* easy portability,* long 5x optical + 5x digital zoom,* sharp lens, producing high IQ even at full zoom extension,* solid construction,* ample 8 mp resolution,* true color quality,* powerful flash,* high-res, adjustable brightness LCD,* amazing set of controls, and* wide range of scene shooting options, along with movie clip,the Samsung S85 is a big camera in a little body for a great price.", "Date": "December 19, 2007"}, {"Title": "A power-hog that takes good pics", "Author": "Chris B.", "ReviewID": "R3ERXDZCMWKN86", "Overall": "4.0", "Content": "I bought this as my \"everyday carry camera\" to complement my DSLR.  I specifically wanted something that would take good pictures, use the same memory card format as my DSLR, uses AA batteries, and is inexpensive (so I don't have to worry about babying it).I was attracted by the combination of size, style, and features at this price.  The 5x optical zoom, 8MP resolution, and large LCD are all exceptional at this price.  And the picture quality is impressive.  The results are sharp with good color and exposure.  Focusing is fast and reliable.  And there are plenty of options, including full manual control over aperature / shutter / ISO, tweaks to sharpness and contrast, and the expected set of options for JPEG compression and resolution.  Using a 2GB card with highest resolution and lowest compression, it estimates it will hold about 400+ pics.The pictures I've taken thus far have turned out really well.  The movie mode works great too.  My only complaint is the power consumption.  I use two 2500mAh rechargeables, and I'll easily run through them in a single afternoon of walking around taking only a few dozen pictures.  There's no optical viewfinder and you can't take pictures with the LCD off, so I'm not sure how well you can tweak it to use less power.That said, I always take along spare batteries, and with the camera being relatively small, it's not a big problem.Overall, I'm very happy with this camera, especially at this price.", "Date": "February 18, 2008"}, {"Title": "S85 for an amateur.", "Author": "Mr. Hai V. Nguyen \"haingu\"", "ReviewID": "R2PY2TN3BLAVCL", "Overall": "5.0", "Content": "This little camera has got all you need to make great pictures. Just take time to get acquainted to its features and you won't be disappointed. I gave it to my wife so she can document her flowers, butterflies, and hummingbirds. The pictures came out wonderful. She only uses auto, zoom and shake reduction, since it is her first camera, I do not want to burden her with advanced features.After seeing her pictures, I bought a S1050 for myself.Both are bought at Amazon (due to its reputation). They are made in China, since I could not find one made by Taiwan, Japan, or elsewhere.I would highly recommend it. Considering price and quality, I would say it is a very good bargain. BTW I use rechargeable batteries, 2500 mA and get an acceptable number of pictures. It takes a few seconds to recycle the flash. The flash is robust too.May be I am lucky to get this one. We love it.", "Date": "February 26, 2008"}, {"Title": "All About the Night Shot", "Author": "Bruce", "ReviewID": "RDVCPGF8X0LKR", "Overall": "3.0", "Content": "The biggest advantage of Samsung cameras is their shooting ability at night time. You will need a tripod for this, but taking shots without flash and on the auto or manual setting (the night mode setting is actually not as nice in my opinion) will yield pictures that are more vibrant than any other camera I've ever used.The biggest disadvantage of Samsung cameras though is their durability. I'm an I've had three Samsungs break because I over used them (two while still in warrenty); when I got them back from the repair center, the reason for the failure was always \"defective parts.\"However their low prices sort of makes up for this.", "Date": "April 20, 2008"}, {"Title": "Great Deal for the Low Price!", "Author": "J. Edmondson", "ReviewID": "R3V641F3APSRRI", "Overall": "4.0", "Content": "Overall:This camera has been working well for me. I has a nice 5X optical zoom which gives an extra \"ooph\" to get that perfect picture. It has many features/options that I haven't explored yet. Its manual controls are also plentyful.Pros:+ 5X Optical Zoom+ Battery Life Good with Rechargables (Ni-MH)+ Big 2.5\" Screen that is very responsive/has good framerateCons:+ If you get this NEW there is a \"8MP, 5X zoom\" sticker that won't come off nicly. I needed to use Goo Gone to remove the adhesive!!!+ Some pictures I took came out fuzzy. (I was taking a low light picture w/o flash on AUTO mode)", "Date": "February 16, 2008"}, {"Title": "fair enough so far", "Author": "Javier Mattera \"Javier Mattera\"", "ReviewID": "R1EK6WMENPXMHL", "Overall": "4.0", "Content": "I've only used this product to take a some 150 snapshots working with standard batteries.At some point the camera turns into black and doesn't respond to any command. I had to take the batteries out every time this happened.I guess this problem will disappear using rechargeable batteries.The picture quality is excelent, and the 5x zoom is amazing.", "Date": "February 28, 2008"}, {"Title": "Great camera", "Author": "ladylazarusplath", "ReviewID": "R3K4XB4B49AYIG", "Overall": "5.0", "Content": "This is a great camera.  I bought one and it didn't work, so I am going to send it back. I didn't want to give up on the model because of the great reviews, so I bought another one at a different place and this one turned out to be fantastic!  I learned very quickly that you need to use batteries with 2500 mAh or better in order for the batteries to last.  If you are looking for a new camera that takes pictures and not expensive, this one is your best bet.", "Date": "February 26, 2008"}, {"Title": "Great deal", "Author": "Sara D. Campomizzi", "ReviewID": "R3K9W20K24IZM1", "Overall": "5.0", "Content": "Great camera for the price.  It's easy to use and fun.  You can edit pictures, change colors, add fun features to your pictures.  Really a good deal for the price!", "Date": "February 5, 2008"}, {"Title": "Good camera for the price.", "Author": "Mary Nell", "ReviewID": "R2PKCOHBRA8K20", "Overall": "4.0", "Content": "I'm not much of a photographer but needed something to take pictures of my grandson.  This camera has lots of features that I liked but it is fiddly to use.  I can't read the little symbols on the buttons, but there aren't many buttons so memorizing their function isn't hard. The LCD screen is large and clear. I have a hard time figuring out the best setting for my situation simply because this camera offers so many variables and choices. The best pictures I have taken so far have been indoors without the flash. I like the camera but it has a higher learning curve thatn the one I owned previously.", "Date": "March 26, 2008"}, {"Title": "Decent photos in daylight, but...", "Author": "Amey Maffucci", "ReviewID": "R1NP0YDQXJ1KJP", "Overall": "2.0", "Content": "This camera takes excellent, high-resolution pictures outside.  I found that it even worked quite well for action shots when there is plenty of sunlight.  However, taking pictures indoors was another story. If there is any motion, indoor pictures come out blurry and grainy.  I had tried taking pictures of hockey, in a very well-lit ice rink, and the pictures always come out brown and grainy.  I have adjusted the settings as well as I could, but the amount you can change the aperture and speed of the exposure is very limited, even in the \"Manual\" mode. I even used a tripod, and the improvement was only marginal.Now, after 1 year of working normally (and the warranty expiring), it has developed a severe problem. It shuts down unexpectedly, regardless of the charge in the batteries. It does with with new, alkaline batteries as well as fully charged NiMH batteries. It takes pictures for a minute or two, then just shuts down. It does not even retract the lens. It just goes black.  Obviously, there is some kind of short or poor connection in it, but it does not appear to be related to the battery door (a common problem area on many digital cameras).Thankfully, the credit card I used to purchase this extends the warranty, so I should be able to get my money back.", "Date": "February 19, 2009"}, {"Title": "great product with one major flaw", "Author": "Denis Roy Dickinson \"Suprman4life\"", "ReviewID": "RPKS7A40JI8T8", "Overall": "4.0", "Content": "this camera takes great pictures and videos. i recommend it at such a great deal of less than $100. however the batteries die quickly. you have to get lithium rechargable batteries to make this camera effective.", "Date": "April 7, 2008"}, {"Title": "What a battery PIG", "Author": "G. Mathias", "ReviewID": "R31KM318XGSGKU", "Overall": "2.0", "Content": "First let me say that I love Samsung products.  However, this camera is a battery PIG.  I can only take up to 15 pictures before the camera starts beeping at me that the batteries are low.  The video recording feature is very useful until you get 30 seconds into your video and the batteries are dead.  I have tried 6 different kinds of batteries and the best have been the Duracell for electronic devices, which got me 23 pictures before being dead!!  Great camera poorly executed.  Come on Samsung, get it together.", "Date": "May 11, 2009"}, {"Title": "Great Quality Point & Shoot", "Author": "Justin Shidell \"Justin\"", "ReviewID": "RG5AOVWB78IO", "Overall": "5.0", "Content": "I was skeptical of this camera due to some reviews indicating it has flakey software and chews up batteries--my fears have been laid to rest.Yes, if you use standard Alkaline AA's, your camera is going to die off after about 50 pictures. However, I'm using knock-off brand 2000mAH NiMH rechargeables and the camera took well over 200 pictures, plus me messing around with flash, video, and playback.Verdict? I know little about cameras, but this model takes great quality pictures, does a pretty fair job of reducing shake without reducing image quality, and holds up well with rechargeable batteries. I'd buy it all over again in a heartbeat, and I'm glad I picked this model.", "Date": "May 9, 2008"}, {"Title": "EXCELLENT CAMERA  GREAT PRICE!!!", "Author": "Letty", "ReviewID": "R2ZR7J6XUUKDMY", "Overall": "4.0", "Content": "I have been trying like crazy to buy this camera and finally found it here at an excellent price.  Pictures are great but the batteries die soooo fast. After taking about 6 pictures and checking some features, a total of about 10 minutes, the batteries just died.  Rechargeables are a must!!!!!!Other than that I am very happy with my new camera.", "Date": "April 29, 2008"}, {"Title": "Great camera", "Author": "S. Green \"movie addict\"", "ReviewID": "R3URER9HQCRRYN", "Overall": "4.0", "Content": "This camera rocks! Great quality for this price point. Picture quality is wonderful. The only downer is that it doesn't come with good instructions for using the video function.", "Date": "April 28, 2008"}, {"Title": "Click!", "Author": "Under the Redwoods", "ReviewID": "R361XDMVK9QR8A", "Overall": "5.0", "Content": "Awesome camera! Fantastic pictures and easy to use! Not too heavy or bulky......the perfect point and shoot!", "Date": "March 19, 2008"}, {"Title": "Great Value", "Author": "Aaron Ruiz", "ReviewID": "R3Q01BOJM1DFTD", "Overall": "3.0", "Content": "This product was purchased at an incredible price, but we've made up for the low price in batteries.  The instruction booklet is very vague and you must play around with it to figure out the features it offers.  It takes very nice pictures once you do figure everything out.", "Date": "March 6, 2008"}, {"Title": "Digimax S85", "Author": "Nunya Bidnez", "ReviewID": "R3PJUQMT0QPFAL", "Overall": "3.0", "Content": "Pictures are nice, does seem to go through batteries pretty fast and likes Duracell batteries over other brands (seem to fit better)", "Date": "March 25, 2008"}, {"Title": "purchased this product a long time ago, still use it.", "Author": "joseph e salgot", "ReviewID": "R1DGNBKWLC2OWR", "Overall": "4.0", "Content": "purchased this product a long time ago, still use it.  I keep it in the car so if needed it is there", "Date": "January 12, 2014"}, {"Title": "Great Little Camera", "Author": "Arthur J. Heller", "ReviewID": "R3CMW3YZWJLKJT", "Overall": "4.0", "Content": "I've purchased this camera twice -- my first S85 was accidentally dropped in a lake, and I liked it so much I immediately went and got another as a replacement. I've had it for five years now, and have taken well over 5,000 images, and it still works just as good as new, and takes just as good pictures as ever.The pictures that it takes are excellent quality. The camera is capable of taking 8.2 megapixel pictures, but I usually set it lower, at 5MP. Some people complain about the night pictures, but there is a night mode that opens the shutter long enough to get some good images -- it is important, though, that you're not holding the camera as the slightest twitch can blur the whole thing.As others have stated, it is a bit of a battery hog, but no more so than other cameras I've owned that've used AA batteries. I usually keep a four-pack of AA batteries in my camera case as backups, in case they're needed. The camera is also a little large; there is a definite feeling of \"heft\" to it, which I sort of like as it makes the camera feel a lot more solid than some of the thin things they're making now.The one downside of this camera is in the video recording. While it can take videos, those videos are limited to 640x480, and with a noticeable shutter \"buzz\" in the audio. Another downside is the fact that the camera cannot access more than 4GB on an SD card. Putting in an 8GB or 16GB SD card only recognizes 4GB -- which is generally more than enough, but I like to have the option to use huge storage.All in all, this is a great little camera that is good at taking pictures and decent at recording video.", "Date": "September 19, 2013"}, {"Title": "Compact Size Produces Surprising Results", "Author": "Ocean Park Volleyball", "ReviewID": "R1E47CI6NNPQ2V", "Overall": "5.0", "Content": "This is a replacement for the same camera we owned previously and it performs perfectly. It is a great camera because of it's size and has great picture resolution. Believe it or not, we use this camera to take action shots at beach volleyball events in California and they are excellent.", "Date": "April 9, 2013"}, {"Title": "Not perfect, but gets the job done", "Author": "Leonard", "ReviewID": "R39S2UJTANS2DN", "Overall": "4.0", "Content": "I first purchased this model in June 2008. Over 4 years later, it still works. It is not perfect. Like many people said, it eats up batteries. It takes horrible night and motion shots. However, if you just want a simple camera to take a picture of the animals in a zoo, the plants in a park, or a parade float then this is ideal. I'm illiterate when it comes to technology. I like this camera since it uses simple AA batteries and not rechargeable batteries. The instructions are fairly straightforward. Many people have complained about blurry shots, but regardless of which camera you use, if you shake a camera, the pictures will come out blurry. Don't blame the camera for you poor technique. In conclusion, I highly recommend this model because it gives you a lot of bang for the buck.", "Date": "December 4, 2012"}, {"Title": "Samsung Digimax S85 8MP digital camera with 5X optical zoom", "Author": "KMAC \"kmac\"", "ReviewID": "R25RJLNTM41UBA", "Overall": "5.0", "Content": "great camera & easy to use.  takes nice, clear pictures.  It does run tru batteries, even the rechargeable ones so have back ups...great camera at a good price", "Date": "January 9, 2010"}, {"Title": "Wonderful 5X camera (vid included)", "Author": "MichiganEdge", "ReviewID": "R127WDHQFUB0XJ", "Overall": "5.0", "Content": "i bought this camera 5 months ago and it's all i need plus more ,astonishing photos. the camera has so many features to list (need some time to learn it all), even the video is good (not great) . i think it's one of the best camera under $100 . i bought another for my brother. check out the video i took with this camera in a concert.[...]", "Date": "January 12, 2009"}, {"Title": "So, so disappointed.", "Author": "A. Berry \"Mom at Large\"", "ReviewID": "RAJSBON1PSTKL", "Overall": "1.0", "Content": "I was thrilled to find a reasonably priced camera from a company I used to trust - what a disappointment. After only a couple months of light duty taking pictures of my kids and dogs, it now randomly shuts down regardless of how fresh the batteries are or what I do to try to solve the problems. When it shuts down, sometimes the lens stays open. Right now, I have this camera on my desk, stuck open, dead as a doornail. We tried cleaning the battery contacts but no dice. Google \"s85 shuts down\" and see that other people have had this problem.", "Date": "December 26, 2008"}, {"Title": "Awesome camera", "Author": "Susan", "ReviewID": "R2BNRITNIWHHUV", "Overall": "5.0", "Content": "I bought this camera June 2008. I read all the reviews, I recommend always reading reviews before buying anything. They are so helpful!!!!!! I too will recommend to buy the recharable batterys and charger. I bought 4 batterys that came with the charger.  The camera takes  Double AA  Batterys. Then you have extra batterys with you when you need them. Also I recommend buying a sandisk 2.0GB memory card, as the camera has only enough space on it to hold about 8 pictures. The 2.0GB can hold about 400 pictures. Now thats alot of pictures! I'am still learning all the camera does, It's a awesome camera!", "Date": "September 11, 2008"}, {"Title": "Samsung Digital Camera Review", "Author": "C. Baker", "ReviewID": "R1J90OE5JO22ZE", "Overall": "2.0", "Content": "Digital Camera is good but falls short on the manual.In fact the manual is nothing at all, in order to properly operate this digital camera one must download the entire manual on their computer.Difficult to reference items of importance; such as correct vocusing, etc.  My husband and myself now understand why this Samsung camera was priced well below other vendors; it's because it does not include an operational manual.  Buyer Beware !", "Date": "March 23, 2008"}, {"Title": "Great Camera", "Author": "Alex", "ReviewID": "R17JQTLZW37K2H", "Overall": "5.0", "Content": "I LOVE THIS CAMERA!! I wanted to upgrade without spending a lot of $$. This is the way to go..it takes wonderful pictures and is well worth the price!", "Date": "June 11, 2008"}, {"Title": "Samsung Digimax S85 (Black)", "Author": "G. Lao", "ReviewID": "RHMSY0MCC30DF", "Overall": "5.0", "Content": "Very Good picture quality for such a low price digital camera. The battery does not seem to last long. It's best to use rechargeable batteries for this digital camera.", "Date": "March 31, 2008"}, {"Title": "samsung s85  compared to my fuji \"NOT\" but ok", "Author": "T. Schantz \"Terry\"", "ReviewID": "R2KQV772NT57LZ", "Overall": "4.0", "Content": "I have had it for 25 days and was thinking about sending it back ,,, I'm going to keep it , The rechargeble batteries are a big $$$ saver for any AA camera especially a battery hog of a cammera. I also had issues w/ it shutting down randomly upon attempting to take photo ,,Problem was powersave options turned on or set to low of a time , 2-3 of them were turned completely off and Hark NO more shutdowns. But,,, man she sucks the power out of a set of ANY type way tooo fast!! People are not complaing as SOMEONE stated ,, There stating a fact. I had a fuji finepix a2650 for 7 yrs , 2.1 MP worked excellent and batteries seemed to last forever. It had a 16 mb xD pic card and it was my only complaint it was propietary to the fuji. I'm sad that died last month while taking pics of my new deck, I was going to get another fuji but don't want those battery packs that require a special charger and cost 1/2 as much as a camera for 1 set of bat. and a charger. i wanted a camera for $100-125 $ bottomline!the s85 takes excellent pictures and is very flexilbe in what it can do. A 2gb sd pic card last forver w/ pics only and can take some nice video w/ sound.I bought a 2 gb and 1 gig card and have not used the 1 g yetno need seems like unlimted room on the 2 gb. It is a very nice camera for $111.00 delivered to my door . the colors are neat and the negative exposure is cool , the manual pretty much Sucks and is vague at best, Play w/ the setting and get familar/used to it and tour good to go !! I don't think I can do better for the money i paid .Some Zoom pics we took amazed me . Also I compared it to a fuji a820 we have at work and it was much better than the fuji . It (s85) takes nice macro pics and the zoom pics were 1000 % better than the fuji a820 , It (the fuji) is not that old and is already making funny grinding noises when zooming in and out. and it won;t take a clear zoom pic at all , i'll keep the samsung and buy another set of rechargeble AA's ,I like it!!!", "Date": "May 31, 2008"}, {"Title": "uesless user guide", "Author": "Sally Potapenko", "ReviewID": "R1YF2T83NDWMLK", "Overall": "2.0", "Content": "Samsung Digimax S85 8MP Digital Camera with 5x Optical Zoom (Black)  I was really looking forward to using this camera but the directions for using the various modes was almost useless.  you were left to figure everything out yourself.  just was not worth the money, no matter how reasonable.  thank you.  returning it to amazon was a breeze.  I was very happy with that aspect.  Sally P.", "Date": "April 5, 2008"}, {"Title": "Loving it", "Author": "S. Golderer \"Passion is Life\"", "ReviewID": "R1N23GGH5H9GRL", "Overall": "5.0", "Content": "This was a gift for my brother and he loves the camera, it actually is better than the camera I own. For the price and all that the camera does it was a great gift for him.", "Date": "May 14, 2008"}, {"Title": "Greate value", "Author": "Ricardo A. Polanco", "ReviewID": "R4HBTK5BW3I48", "Overall": "5.0", "Content": "I'm very happy with my two cameras, they were for a gift, they came on time  and no problems at all.", "Date": "April 8, 2008"}, {"Title": "Amazing Seller...Amazing Product....", "Author": "Varun Vashisht \"VV\"", "ReviewID": "R1ZXHV8DES3SNY", "Overall": "5.0", "Content": "The camera works great....shipping was fast....camera was as described by the seller....will definately buy from the seller again....keep it up....", "Date": "April 7, 2008"}, {"Title": "nice camera for the price", "Author": "Willowand", "ReviewID": "R35VKBPACKDOAW", "Overall": "5.0", "Content": "You couldn't get a better product for the price.  My only problem is you really can't take any good close up pictures - they are horrible, this camera is not meant for that.  But other than that it's a great camera for someone who doesn't need anything more than your basic digital camera.  I recommend this camera for the basic digital camera user.", "Date": "March 16, 2008"}, {"Title": "Samsung digimax S85 is worth passing up", "Author": "J. Cohen", "ReviewID": "R3KNT1R5JYEY68", "Overall": "1.0", "Content": "This was a very dissappointing purchase and I chose to return it.  The camera that I reeived may have been broken, but it would not remain in the \"on\" position for more than one picture.  Despite the setting, the camera shut down after each and every picture.  I could not tell if it was the nature of the camera or if the camera was broken, but I would equate it to a piece of junk.  Spend $50 more on a decent piece of merchandise.", "Date": "April 5, 2008"}, {"Title": "Going to return it", "Author": "minnzo", "ReviewID": "R2XL4I2K8IWLPU", "Overall": "1.0", "Content": "On the first day out of the box, and less than 20 pictures later - the camera randomly shuts down, and quite a few shots are blurry. Some of the shots turned out very nice, but with this shutting down problem, its time to try something else :(", "Date": "February 16, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "8-megapixel CCD captures enough detail for photo-quality 16 x 22-inch prints\n5x optical zoom with Advanced Shake Reduction (ASR); 2.5-inch LCD display\nFace Detection detects up to nine faces and automatically adjusts for optimal focus and exposure\n14 scene modes and special effects \"E\" button; high-resolution movie mode at up to 30 fps\nStores images on SD memory cards (20MB internal memory included); powered by 2 AA batteries", "Name": "Samsung Digimax S85 8MP Digital Camera with 5x Optical Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41bhDz6xDbL._SX300_.jpg", "ProductID": "B000TGQ66M"}}