{"Reviews": [{"Title": "Great little camera", "Author": "J. Wong Ley", "ReviewID": "R1FDJCQL5H7K73", "Overall": "4.0", "Content": "It has a very cool feature: the face recognition, it works very nicely. I have been toying with it just for fun and the camera recognizes most of the faces as long as they are fully facing the camera or not looking away more than 50% to the sides. It's a very cool feature and it does it's best job in focusing and color compensating to make the faces look better.The camera is very slim and fits nicely in any of my pockets. To turn it on you just slide the cover to the side and are ready to shoot. Plenty of manual settings and some buttons to get to specific functions.With a 2Gb memory card I get almost 30min of video at VGA resolution, more than enought to get the funny little videos and show panoramic views of a place.Another cool feature is the \"normal & flash\" option, which takes one picture with ambient light and immediately another with flash, so you can be sure to get a good picture at least.I'm very happy with this camera.Only low grade I can give is the lack of an optical viewfinder, I find that the large LCD display is not very useful on harsh daylight (as I'm used to reflex cameras) and I don't like to hold the camera so far away from my body because of the instability that causes. It would be nicer to hold the camera against my face to provide support.--------------Additions after reading the above reviews:All true complaints of the reviewers, but there are some solutions.Set the auto switch off to 2 minutes, even if the camera is turned on in your pocket (it does when you slide it into the pocket due to the direction of the opening motion).Battery, at my pace, the battery won't last a full day, so I bought a backup battery, very cheap and convenient.Finger blocking the lens, is just a case of learning how to hold the camera. At first is annoying but is no big deal after a few days.Quality of lens, hey if you want professional quality, this is not the camera, this is an point and shoot camera, convenient to carry at all times, just to grab the photo opportunity and avoid blaming yourself the rest of your life for not getting \"that shot\" on time.", "Date": "March 28, 2007"}, {"Title": "Fujifilm Finepix Z5fd 6.3MP  ... one decent camera", "Author": "B. Williams Jr.", "ReviewID": "R1XQQ8J503ZFCY", "Overall": "4.0", "Content": "This is a decent camera. Like most compact cameras is suffers a bit in low light but it's still better than any I tested in the Sony line. Every time I pick the camera up, I'm blown away by how light it is. It almost doesn't feel like I'm holding anything. The photographic power of the cam is pretty good... to the point that I gave up the 8mp Sony T20 for this 6mp. This cam doesn't take pics as fast as the Sony but it is still unlikely that you will miss a shot. This camera isn't slow, the Sony is fast. I always say go to a store and try before you buy as I did and I can say I'm pretty satisfied with this buy.", "Date": "July 4, 2007"}, {"Title": "Spoiled F30 owner.", "Author": "N. Modi", "ReviewID": "R8UEURG068FKI", "Overall": "3.0", "Content": "Bought this (in the nice brown color) after great experience with two other F30 cameras. It has the same sensor but not a great lens, so I was a little skeptical of image quality.As expected, the sensor is good (but not as great as the F30) and the lens is a letdown. Colors are very accurate, but images come out fuzzy due to noise. Camera loves 400 ISO when on auto.I set it manually to 100 ISO and took an indoor shot. The center of the image was very sharp but the edges came out pretty soft and *noise is visible* at this lowest ISO setting; an important issue to note. I bought the Z5fd mainly for indoor shots. Outdoors, on a bright day, I have no doubt that the results will be excellent.I agree with most other reviews about the excellent metering. Pictures come out very nice.It is a good pocket-able camera at the ~$150 price-range. My only other experience with a similar camera is with a Sony T9 which takes horrible indoor shots. The T9 has an image stabilizer while the Z5fd compensates with face detection.People looking at the Z5fd camera may instead want to pick up the F20 while it is still available. I would return the Z5 but wife loves it (sleek and brown in color) so it stays.I have mixed feeling about this camera. It has a good form factor, great build quality and ease of use, but image quality is a letdown.In short:Image Quality: above average for folded zoom optics; below average when compared to an F20/F30.Build Quality: ExcellentLens: barely AverageLCD: Nice and fluidMetering: ExcellentImage stabilization: NOFace Detection: Yes", "Date": "August 31, 2007"}, {"Title": "Same color and size as my Razr cell phone!!", "Author": "L. Gilles", "ReviewID": "R13IJCLHVNZMFS", "Overall": "5.0", "Content": "I own a Fuji S3000 big view finder, 6x zoom, takes the best pictures in the world BUT it was too big to carry at an outing all day long. Loving my Fuji, I decided to stick with what I know, so I purchased the Fuji Z5fd 6.3MP.No regrets, I love it. It is user friendly, most can figure it out without reading the owners manual. Its small, I like the slide over the lens to protect it when not in use. The pictures and videos are outstanding!! The function to shoot the same scene with and without flash is my favorite.I have found a lot of my pics inside look better w/out a flash since using this. The button for this setting is right on the back of the camera (no having to look through menus to get to it) I'm not going to retire my big Fuji, but now my little fuji can go every where with me without carrying a camera case. My one dislike, no view finder But it seems all other brands are omitting them on the compact cameras also.", "Date": "August 1, 2007"}, {"Title": "Even shots of animals", "Author": "fireflycat \"fireflycat\"", "ReviewID": "R33ESZ9W9SZ0OV", "Overall": "5.0", "Content": "I'm very pleased with this camera. I love that:1) It's smaller than an iPod. I can carry it in my purse or slide it in my pocket.2) All of the pictures look great--even shots of animals. I take a lot of photos for an animal shelter, and my old camera took horrible pictures of pets. The animals were always blurry with neon green eyes! This camera has taken great pictures of the animals, with and without flash.3) It is PINK. It's really not wine red--it's actually an adorable, iridescent pink. Love it.Oh-- I also love the video camera option, and the battery, which lasts a really long time, even when I watch and re-watch the videos.", "Date": "May 27, 2007"}, {"Title": "Great little camera", "Author": "C. Johansen", "ReviewID": "R21SIB9EE6SMFX", "Overall": "5.0", "Content": "This camera is great!  In terms of photo quality it's not going to best a bigger bulkier camera - but it's VERY good, I would say better than most (all?) subcompact cameras in its class.  The best part about this camera is that it's quick.  It's quickness is a combo of two factors, design and processor.  The sliding lens cover doubles as the power switch - it's very easy to pull it out and slide back the cover very quickly.  If you have the flash disabled it's ready instantaneously, with flash it'll take just a second to charge.  The focusing mechanism functions very fast and the auto exposure is very robust and can handle many situations - faster and better than other cameras I've used (the exposure is notably better than the F series in regular or high light level situations)The construction of the camera (build quality) is incredible at this price point.  It's really built solid - and has the finish of a luxury product.  I have it in the brown color and have gotten many compliments.  The logo on the front also lights up at power up and when a photo is taken.  It's a nice touch that adds just a little extra polish; you can disable it if you like (another nice touch!).  I've used Sony's offerings in this class (W50, W80) and they feel cheap by comparison.I bought this a couple months ago - it's not a super new camera at this point, but it's still very current - especially with the \"lower\" resolution - you avoid the noise and file sizes of those first generation cameras with the 10-12 megapixel CCDs.  Plus you're not paying out the nose for that higher pixel count which really doesn't help the quality of your photos. There is a newer version of this model (Z10), but I'm not a big fan of where they're taking it design-wise.I also have a Fuji F30.  Obviously the image quality of that camera is better with its bounty of manual options - however the 'F' series isn't the greatest in terms of compactness.  The F30 also bothered me - it takes a while to get a decent picture - even longer to get the ideal exposure, there's just a lot of fiddling to do to get the job done - something that's not always possible in every situation. The Z5 is the opposite, you might not get the highest quality possible, but you're going to get a great shot in the shortest amount of time in just about all the situations the F30 can handle.Low light performance isn't on par with the F series, but it's head and shoulders above everything else in its class.Face detection works pretty well - not every time, but it generally does a good job regardless of light level and is a welcome addition.My only quibbles with this camera are that the lens cover can sometimes slide open in your pocket, it would have been preferable to make it slightly harder to open, but it's minor - only happened a couple times so far. I also wish that there was another quality setting for the 3:2 aspect ratio - for the lowest compression level (best quality) you have to use the standard size.  Fuji has another camera coming out that is similar in design to this model (I think it's going to be the Z100 - it's not on the site yet), but adds optical image stabilization.  I'll probably pick that model up after it drops in price a bit.  I really love my Fujiflm cameras, very high quality in every regard, definitely the best value out there.", "Date": "October 17, 2007"}, {"Title": "great pocket point and shoot", "Author": "C. Buettner", "ReviewID": "R1Q55C8MBSL3CQ", "Overall": "4.0", "Content": "I'd give it five stars if it wouldn't open in your pocket all the time draining the battery.It does what it should exeptionally well for its size.snapshots outdoors and indoors without flash and little movies that is.More than enough features like face detection and normal flash where you take an image with and without flash automatically and later on choose wich you like best. The Macro function is great and picture quality and start up speed, I would rank amongst the best in this category. Don't forgett this thing is way smaller than yor blackberry ...thumbs up", "Date": "June 12, 2007"}, {"Title": "Good camera", "Author": "M. Graham", "ReviewID": "R18UG1ONK5NY4P", "Overall": "4.0", "Content": "Best thing about this camera is the lightning fast shutter.  For me the shutter lag is one of the first things I want to know about a digital camera that I might buy.  The picture quality is as good as I've seen from any other non-SLR digital camera.", "Date": "January 15, 2008"}, {"Title": "Not Perfect but Lots of Positive Features", "Author": "Abby's Dad", "ReviewID": "R38TA25MJ23K7J", "Overall": "4.0", "Content": "First of all, this thing is surprisingly rugged.  For people that complain about LCDs breaking, I have worn this thing all over in a small bag on a belt loop.Outdoors, it takes fantastic pictures.  I travelled through France and the dynamic range and color are very good.  I own a digital SLR but this thing is tiny and easy to carry.Low light performance is dependent on playing with the settings which people looking for a point and shoot normally don't want to do.  It still has the great Fuji option of offering a dual picture with natural light and then with flash.  Results will vary with user's ability.Finally, some people overlook the user interface.  This is probably a personal preference but I like not having any tiny dials to turn.  Everything is pushbutton.", "Date": "January 19, 2008"}, {"Title": "the total package", "Author": "E Harris", "ReviewID": "R2H1ACO440V2BT", "Overall": "5.0", "Content": "This is our third Fuji camera and it's the best of them all. We keep coming back to Fuji because of the easy interface and the image quality. My favorite thing about it, the glowing 'Z5' when you turn it on and after every shot, may be the least functional aspect, but it's the most telling. These small, quality & design tweaks add to the solid Fuji technology. And I love that there's finally some color available now, since the camera has become such a fashion accessory.It does lack some clarity in nighttime and low-light shots, but I have yet to see and small digital camera that doesn't. And it does seem to prefer ISO 400 for everything, but again, you can override this.For a camera that is quick out of the pocket and grabs the shot you were looking for, this is it. It's got all of the current technology a digital should have for a great price and good looks.", "Date": "January 1, 2008"}, {"Title": "Fuji Z5fd Camera", "Author": "Stuart Schneider \"Author of books on collecti...", "ReviewID": "RIL6GD0XA9GGD", "Overall": "4.0", "Content": "This is a great camera for the value. Everyone who sees it thinks it is great. Everything works as expected. With a 2 Gig memory card this could last for a full week's vacation. I bought it so I could always have a camera ready on a trip. It takes great people pictures and scenery is also well balanced. It won't be a great nature photography camera if you like crisp photos that can be obtained with a 6 meg Nikon digital SLR camera. But that's not what you are buying this baby for, is it?", "Date": "October 19, 2007"}, {"Title": "Great", "Author": "Megan", "ReviewID": "R288FKSOEH5VPP", "Overall": "4.0", "Content": "I've had this camera for over a year now and honestly dont have to much of a complant other than a few blurry shots every once in a while. I'm a girl and im addicted to taking pictures, and this camera has been great for every type of picture i take. Great face finder, takes very clear action shots, and great coloring. easy to use on the computer. Honestly if your looking for a camera that can deal with a beating, get this one. If this wasn't a good camera it would be long dead by now, i drop it, get it wet, throw it, squish it into tight places, let all my friends borrow it, slide the cover thing a million times when im bored, and other then a few straches on the corner, it looks new. I have dropped it in my pool and also taking picture with my hands soaking wet and its been dripping with water and still works. other than the one incident i dropped it in my pool it stopped working for about an hour but then revived itself and started working again. only complaints: watch your fingers, its easy to get them in the picture, i live in florida so i bring it to the beach alot and sand gets stuck in the slide cover very easily, also got sand stuck in the lens and it stopped working until i blew the sand out with a blow dryer about 3 days later, and it does not charge in the computer, infact the battery dies pretty quickly when its plugged into the computer so watch out for that, and beware when you put it in your bag or in a purse it doesnt squish against something that flips the slide cover on, that happens very easily.All in all a great camera, worth the buy.", "Date": "July 2, 2008"}, {"Title": "Great gift for teen girl", "Author": "RaDadIndy \"indiana_dad\"", "ReviewID": "RGEXN1045S7TZ", "Overall": "5.0", "Content": "I bought this for my teen daughter and am quite pleased.  She loves it, and it takes great pictures.", "Date": "March 23, 2008"}, {"Title": "Best camera ever!!", "Author": "Barbara Mallory", "ReviewID": "R1TEEVBDB6956N", "Overall": "5.0", "Content": "I love this camera great handy camera can fit just about anywhere. I love this camera.. small but cute easy to carry. take excellent pictures...Face reduction is fabulous. video  very nice. looking for a camera this would be a excellent camera...", "Date": "March 17, 2008"}, {"Title": "Best camera I've ever used.", "Author": "Sean Harshey", "ReviewID": "R2Q0EJ3YFQ5343", "Overall": "5.0", "Content": "I wish I knew how to take great photos with a super cool SLR, but I've never had the patience or the knack for it. So I always use the automatic settings even when I've had some pretty nice cameras. When you're always on \"auto\", like I am, you just need a simple camera and other factors start coming into play more than they would if you're wanting all the latest bells and whistles and interchangeable lenses and blah blah blah. For us, size was a pretty important feature. We take a TON of snapshots in our travels and even just for family events. So, when a camera easily slides into and out of your pocket, you tend to take it along more and you can take more photos. We bought this camera in 2007 and straight-up abused it. We had this thing all over the world. We shot tens of thousands of pictures with it. Of course, we do photography by keeping 1 or 2 good ones for every 100 we shoot. But XD card space is cheap and this camera is so convenient. We lost this one at one of our daughters' volleyball games and never got it back. We've had 2 or 3 different similar but newer cameras since and none of them take as good photos as this little Fuji seemed to. We'd actually just like to have another one of these, but 7 years later they seem to be actually MORE expensive than when we bought it when they first came out. What's with that? Bad things? The worst thing I can say is that the lens is in the corner of the camera. I can't tell you how often someone gets their finger in the way of the photo. It's an annoyance. Also, it only takes xD cards (I think). Battery life is good, it's solidly built and surprisingly rugged. And we get lots of compliments from people on our family photos and people frequently ask what kind of camera we used to take photos. They're very often surprised to learn it's a little pocket camera.", "Date": "December 27, 2013"}, {"Title": "Very good quality", "Author": "Ellen Stein", "ReviewID": "RINF54FQWTW8B", "Overall": "5.0", "Content": "I got it for my friend, she loves it. The only problem is, she wanted exact the same Wine Red color and the store was unable to provide it even though it is listed as available. I don't blame the owner, he/she explained that the camera is old and it's impossible to find the wanted color.", "Date": "November 6, 2013"}, {"Title": "Price was great", "Author": "Wayne E. Stevenson", "ReviewID": "R1OOVBXPO8A1KJ", "Overall": "4.0", "Content": "Good camera but a little outdated.  I purchased a couple of years ago but have just now completed the review.  I would recommend the site for purchases, for great price and delivery.", "Date": "September 19, 2013"}, {"Title": "The perfect purchase :)", "Author": "T33lips", "ReviewID": "R2JHW2FEC68QMT", "Overall": "5.0", "Content": "The only complaint I have is that I can't figure out type of memory card it takes. By it being used it didn't come with a manual so I'm on my own with it. Other then that...thia camera is a Godsend. The picture quality is great, the flash is  great, the color is perfect. This was the perfect purchase for us :)", "Date": "September 12, 2013"}, {"Title": "Pix in her pocketbook", "Author": "J. P. Reilly", "ReviewID": "R2XO6RT727PL91", "Overall": "5.0", "Content": "She loves this camera, fits in her purse and she loves taking pix of the grand kids. This camera is compact and does the job, also bought her the larger memory card and case. Great deal and great product.", "Date": "April 17, 2013"}, {"Title": "Best Camera I Ever Owned!", "Author": "mickey quigley", "ReviewID": "RQJCRHP8NX3QB", "Overall": "5.0", "Content": "The camera I purchased was to replace one that was stolen from me in April.  I have looked at other digital cameras and none compared to this one.  Everyone remarks on my photos I take with it.  Because it is small and thin it fits in my pocket,that's how you get great shots - always have your camera ready.  It takes great action shots and awesome flower/plant closeups which I do a lot of.  I was soooo impressed with Blinq, the company that actually sold it to me through Amazon.  I ordered the camera on Friday and it was in my mailbox on Monday along with a very cute packing list.  The camera looks and works like new even though it was a used item.", "Date": "September 7, 2011"}, {"Title": "finepixz5", "Author": "reviewer", "ReviewID": "R34BRZSG107LRX", "Overall": "3.0", "Content": "I've owned this camera for 3+ years now and am starting to look for a replacement.  Although a decent Point&Shoot; camera, I noticed a definite difference in picture quality when I compared my photos (prints and 'on-screen') to my sister's Point&Shoot; Canon PowerShot, which is actually a year older than my z5.  I've tried 'tooling' around with the different settings/options, but nothing changes. My images are definitely granier and 'softer'...not as crisp and clear as I would like.  It is easy to use, but I am ready for an upgrade.  Canon, here I come!", "Date": "February 13, 2011"}, {"Title": "good camera", "Author": "Pinky Pie", "ReviewID": "R1RW2PEIJOEMJX", "Overall": "5.0", "Content": "Still use this camera even though I've had it for a while. Great for quick snap shots and eBay pics.", "Date": "January 17, 2011"}, {"Title": "Took care of the problem super fast", "Author": "hotrollbill", "ReviewID": "RZPPS3QY58F6R", "Overall": "5.0", "Content": "The zoom wouldn't work on the first camera sent it back and got one that is perfect. Very nice no hassles.", "Date": "July 25, 2010"}, {"Title": "photos or videos with size of ipod", "Author": "R. K. L. ll", "ReviewID": "R9O8FGK2B1O2R", "Overall": "5.0", "Content": "After over a year of use, I feel it is more than safe to say WOW! Fantastic videos & many high quality photos. Many were taken on horseback during long distance competion in high winds, blowing snow, blowing rain, frozen & even nice weather.", "Date": "April 10, 2010"}, {"Title": "Grainy indoor pictures", "Author": "M. Mroz", "ReviewID": "R1V2J6Q9XKKHZD", "Overall": "3.0", "Content": "This camera takes great outdoor pictures, but indoor pictures esp at lower light and close ups are quite grainy.  I bought a Nikon Coolpix P80, a little more expensive and larger to carry, but the picture quality is much better.  Still looking for a great pocket sized camera.", "Date": "February 14, 2010"}, {"Title": "Neat camera", "Author": "K. Powers \"Kaitlyn\"", "ReviewID": "R2R31HQEVAE1LF", "Overall": "4.0", "Content": "I have the pink one. I love the color, and I feel special because it slides to turn on. No it might not get the best pictures, but it suits my needs. If I want to be a photographer, I'll buy a slr camera. As far as I know it doesn't have sepia, which isn;t the end of the world. I wish it has better pixels also.", "Date": "January 30, 2010"}, {"Title": "An amazingly strong camera!", "Author": "Christopher Katko", "ReviewID": "R3E6L9G85K69OB", "Overall": "5.0", "Content": "I am very serious in everything that follows:Over a course of four years, this camera has withstood more abuse than any camera should. I have literally run it over with my car at 40 mph on dirt... more than once. I have dropped it over a hundred times onto hard surfaces. The front faceplate looks like it has 3 bullet dents. The LCD screen has dust and hairs behind it. It is scratched so much you can't see scratches. It has been rained on, dropped in mud, and been literally thrown from a car traveling at 55 mph, sent into brush. It has been stuck with double sided tape to the back of a car doing 55 mph offroad. It was taped to the front of a motorcycle. It was held outside the window of a car doing 100 mph. It was held outside a car doing 70 mph in the rain. It was used in 0 degree flash freezes.I never thought anything about Fuji... and now I can't imagine buying anything else. I simply cannot stress how great this camera is. It is not a shockproof camera--but it has earned the title!Don't believe me? See this camera in action, \"Chris Offroads his Sebring\" on YouTube:[...]All non-HD video is from this camera.", "Date": "November 15, 2009"}, {"Title": "Mom Pat", "Author": "Mom Pat", "ReviewID": "RO9BRP55VMUNP", "Overall": "5.0", "Content": "Great Bargain!  Got this as a gift for my daughter, and she loves it.", "Date": "January 8, 2009"}, {"Title": "Great pictures from an easy to carry camera", "Author": "Jenn", "ReviewID": "R18MJ8TQZCDA95", "Overall": "4.0", "Content": "The photos I've taken with this camera are outstanding - crystal clear.  And I'm NOT that great a photographer.  I keep the camera in an inside pocket of my purse - it takes up virtually no room. My only complaint would be that I forget how certain things work between uses - it could be more menu-user friendly.  overall - i'm thrilled with this camera.", "Date": "November 2, 2008"}, {"Title": "AWSOME", "Author": "B. Rochelle \"mom of two\"", "ReviewID": "R3MQZ0Y7XZDN1K", "Overall": "5.0", "Content": "I would absolutely reccomend it to anyone, I have Z1, this one was for my mom (55) and she has no problem with using it. beautiful photos, very handy!!great purchase!", "Date": "August 26, 2008"}, {"Title": "Super Compact, good image quality, some limitations involved..", "Author": "anonreviewer", "ReviewID": "R3LW5VD2ZLK87U", "Overall": "4.0", "Content": "The Finepix Z5 is an excellent super-compact point-and-shoot digital, with, of course, some serious limitations. I got it mostly because I wanted an inconspicuous (no extending lens-also equals more longevity) candid camera I could carry in my pocket. It works well for that, although sometimes the cover slides open in my pocket..no matter, go into the Setup and make sure it shuts itself OFF after 2 minutes!The image quality is very good for such a small sensor, even up to ISO 800, and there's also an ISO 1600 under the F button, but that's pretty much \"emergency use only\". There aren't a lot of manual settings for this little camera either, but if you meter around the highlights and use a -1/3 to -2/3 exposure compensation setting you can do well in most lighting situations. There's also the nice Fujifilm \"Natural and Flash\" setting that let's you see flash and non-flash photos side by side, and the Chrome setting for more vivid colors. The flash has limited range, but does OK within that range-I don't use flash unless I have to anyway. I do miss having an optical viewfinder, as some of the ultracompact Sonys have, but I wasn't willing to pay twice as much for a Sony. All in all, this is a good and super-portable little camera.", "Date": "August 16, 2008"}, {"Title": "Great little camera.", "Author": "tayloradaly", "ReviewID": "R2L66ET042YJ31", "Overall": "5.0", "Content": "I am by no means a photographer.  I use my camera for primarly one reason: to take pictures of my kids.  This camera is great.  It's user-friendly and the software that comes with it is as well.  Everything is easy with this camera - not to mention I love the color!", "Date": "August 15, 2008"}, {"Title": "Good camera but watch warrenty", "Author": "Angela R. Roy \"AirborneArmyWife\"", "ReviewID": "R33NDGXPE8G5U6", "Overall": "3.0", "Content": "Bought this on Valentines...and its now June and my flash completely stopped on 5k pics. Replaced battery and still no go. Called Fuji film and they will only fix \"this common problem\" with an orginal recipt. Go figure. Other than that it was a Great camera while it lasted. Purchasing another but a dif model. Love the quality. Just short life spans. RIP my fav pink camera..sniffle.", "Date": "June 30, 2008"}, {"Title": "Great camera", "Author": "Carol Smith", "ReviewID": "R9KQXCP17RQ3Y", "Overall": "5.0", "Content": "I bought my daughter a Fuji Finepix Z5fd for Christmas, and she loves it. She was using it all day, and still does, all the time. She says it takes great pictures and videos, and I want to get one for myself. I recommend the Fuji Finepix Z5fd for anyone who is looking for a sleek, good-quality camera.", "Date": "June 10, 2008"}, {"Title": "sweet and sour", "Author": "PierreLeGrand", "ReviewID": "R3EW4HJFEHE7MT", "Overall": "4.0", "Content": "SWEET:slim sizecool designnice colorsfairly easy and fast operationrelatively good photo qualityfast access to video modegood value for moneySOUR:no optical viewfinderno 28mm wide angleno optical stabilizerxd card usage", "Date": "June 1, 2008"}, {"Title": "Nice Camera", "Author": "ehsim", "ReviewID": "R3OBXPDI0F41P7", "Overall": "4.0", "Content": "Not a bad little camera for the price.  If you just want a small pocketable camera that you can carry around for those not to be missed shots, this one is pretty good.  If you're more interested in mega-megapixels, then you can upgrade to others.  This one is accurate in color and clarity enough for the everyday picture-taker who just wants to capture the moment.", "Date": "May 31, 2008"}, {"Title": "almost perfect", "Author": "cheffy", "ReviewID": "R16TOWOB2DM76D", "Overall": "4.0", "Content": "the only reason i did not give this camera 5 stars is that under really bright light(ie. outside under sunny conditions) - it can sometimes be hard to see the screen - not so much for taking pictures but for making changes for the shooting modes.  the resolution of the photo and the size and style of this camera make it a winner.  i read just about every review i could find online and the ones that praise it definitely got it right!!!", "Date": "May 19, 2008"}, {"Title": "Excellent, truly pocket sized zoom camera", "Author": "uktravailer", "ReviewID": "R12RRW4Y74UTQ1", "Overall": "4.0", "Content": "A great little product from Fuji. This camera is very small and intuitive to use. Some great features like the ability to take 2 photos in quick succession with and without flash so you can choose later which is best. Add a 1GB xD card and this will hold 500+ photos. Neat internal optical zoom keeps it all very compact. Battery life seems good so far too from the rechargeable unit supplied with the camera. Movie feature gives clear sound and vision. I cannot comment on the image software as I never use any camera software - I always transfer using a card reader into Google Picasa.The reason it loses one star in the rating? The sliding lens cover operates a little too easily when it's in your pocket. I got round this by always putting it in my pocket with the lens cover facing up so that the act of putting in my pocket closes the cover.Overall though this is excellent value for money at under $150.Update:2 years on, this camera is still my 'default' camera. Easily carried and quick to use with great picture and movie quality. Highly recommended.", "Date": "November 7, 2007"}, {"Title": "Great compact camera!", "Author": "zapber \"SunnyNM\"", "ReviewID": "R3ICB8FZD4A5CY", "Overall": "4.0", "Content": "I really like this camera. I've only had it for a few weeks, but I really like the quality of the pictures. I wanted a small camera that I could carry in my purse without too much bulk and weight.  This camera takes much better pictures than my cell phone camera and has lots of other features, which I still haven't used yet.", "Date": "September 27, 2007"}, {"Title": "Fujifilm Z5fd", "Author": "P. Dinolfo", "ReviewID": "R2UEIIAG72VUE7", "Overall": "5.0", "Content": "This is the second one we have bought, actually this is a replacement becuase someone stole the first one.Anyway, this is a really nice camera and as picky as my son is, he chose this camera.:)Great product.", "Date": "February 15, 2008"}, {"Title": "great little camera", "Author": "Victoria L. Gardner", "ReviewID": "R1DD4HT06PWE07", "Overall": "5.0", "Content": "I am very pleased with this camera and the price was good too.  Arrived very quickly.", "Date": "February 14, 2008"}, {"Title": "Affordable, cute, and great quality!!!", "Author": "great prod \"lo\"", "ReviewID": "RTTXT8OZ031S3", "Overall": "5.0", "Content": "I love my camera! Perfect for point and shoot photos.  I love the black and white setting. Has relatively low battery life but comes with charger.  Great price for a great product!!!!!", "Date": "October 21, 2007"}, {"Title": "Horrible", "Author": "Eduardo Laverde", "ReviewID": "R3GLMW40Q2V8FU", "Overall": "1.0", "Content": "I purchased this camera and owned it for a year and a half, for the first couple of months the quality of the photographs was acceptable, but after the third of fourht month all the photographs lacked sharpness not to say that were blurry. I didn't do anything strange or hit it or anything, I didn't send it back because I live in Colombia - South America, but if I could I would have sent it back. I said I owned it because it was stolen 3 months ago.", "Date": "May 29, 2009"}, {"Title": "Pretty Camera, but HORRIBLE Photo Quality!!!", "Author": "*~*ProudMommy*~*", "ReviewID": "R298CNKM2CCTZ3", "Overall": "1.0", "Content": "I bought this camera thinking it would be the perfect little thing to carry around.... boy oh boy was I wrong. Now unless it was a manufaturer's defect, this camera was a little piece of junk! Complicated with horrible grainy, blurry photos. I would not recommend this camera to anyone looking for a decent yet simple point and shoot camera!", "Date": "July 16, 2008"}, {"Title": "Poor quality, noisy images", "Author": "C. J. Carter", "ReviewID": "R1ENIL9657WWUF", "Overall": "1.0", "Content": "I wanted to like the Finepix Z5fd - sleek looks, nice interface - but the images it produces are awful. I am aware of the noise issues that all digital cameras have to a greater or lesser extent, but this camera produced only adequate images and all showed substantial artifacts and noise when viewed '100 %' in any image viewing software.I'm returning this camera and will probably end up with a Leica. The Fujifilm seemed almost too good to be true at the price - and it turned out that it was.", "Date": "July 28, 2007"}, {"Title": "Terrible Customer Service!!!", "Author": "C. Allen \"Jason Logue\"", "ReviewID": "R3E97R987MJAXE", "Overall": "1.0", "Content": "The camera is fine as long as nothing goes wrong. Fuji has the worst customer service I have ever delt with. They pass you from one person to another and do everything they can not to help you. Be prepared to deal with the worst customer service in the business. I really hope this helps you.", "Date": "December 23, 2007"}, {"Title": "Excellent Seller", "Author": "Renee S. Franks", "ReviewID": "R324UUV52B46KF", "Overall": "5.0", "Content": "I bought this camera for my daughter's birthday after we had compared prices at Best Buy and other online companies. This seller saved us $30.00compared to Best Buy and other companies. I received the camera within 5 days and it was in excellent working condition. My daughter was very happy, she loves her new camera. I would absolutely use this seller again.", "Date": "July 12, 2007"}, {"Title": "Excellent Camera", "Author": "Ashley \"ANG\"", "ReviewID": "R3C40H49X51XNH", "Overall": "5.0", "Content": "I bought this camera for my husband and he absolutely loves it!  Great price, great pics......", "Date": "August 23, 2007"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000LRFS7C"}}