{"Reviews": [{"Title": "Somewhat disappointed user", "Author": "Jeff Davis", "ReviewID": "RPIVKQDM4MZQI", "Overall": "3.0", "Content": "This camera does not have an optical viewfinder. Do not buy it if you do not have very good closeup eye-sight (unless you want to always wear specs/contacts to see the LED screen).Olympus claims a new 'sunshine' technology LED that can be seen in bright sunlight.  In bright sunlight, it is necessary to adjust the LED brightness using a menu selection to be able to see the LED - for shots in any direction relative to the sun's position. Otherwise, you are shooting blind!It would also be useful to know at what ISO the camera is shooting - a lot of shots are moved due to low shutter speeds.On the plus side, the camera does a good job capturing indoor shots and still-lifes - though the flash is too strong for any closeups. The 2 in 1 feature is useful/fun to use.", "Date": "February 14, 2005"}, {"Title": "Excellent, Great crystal clear images...Best for its price", "Author": "Prasanna \"L.Prasanna Venkateswaran\"", "ReviewID": "R2726HK15WSICH", "Overall": "5.0", "Content": "This is a great camera in its range..The Sony DSC-S40 is a good competetion.the only better thig about it is its 640 x 480 resolution movie mode. This olympus has  320 x 160 Quick Time Movie mode.. All the other features are much better than the sony. That is great. The only problem I face about this camera is that its absence of optical viewfinder. If you are person who likes simplicity and powerfullness, this suits you perfect. The menu operations are very simple and its zooming is really good.The images are crystal clear and sharp.. The design is also great.. It is very easy to handle.The thing is you 'll need atleast 128 MB XD Card for experiancing its complete excellence.. The pictures at the Best quality mode are really great..  Even a $400 camera dosn't have such an excellent contrast and brightness. Exciting pics.. When I compared with other cameras around $350, this is even better..The 2in 1 mode isa good one.. The Panorama Mode is extremely great.. You can stitch like 8 pics together to any side using the Olympus Master software given with the camera.. You can take a vast landscape as several pics and fix it all together.", "Date": "June 15, 2005"}, {"Title": "Olympus D-590", "Author": "Donald R. Freeman \"corky50\"", "ReviewID": "R2YN5K135XKKIM", "Overall": "1.0", "Content": "Had the camera 2 weeks when the battery retainer clip failed (fell off). Mailed it back to Olympus for a warranty fix. After a few weeks of waiting for a promised call that never came, I got an e-mail telling me that the failure was my fault and the fix would cost $146. The camera was used for 2 weeks and cost $227!! I called them back and pled my case to no avail. I am now awaiting the return of my Olympus reject. If I can't find a local shop to repair it reasonably I will toss it and start over. Expensive lesson learned: AVOID OLYMPUS. LOUSY PRODUCT, WORSE PR", "Date": "March 14, 2005"}, {"Title": "Love This Camera", "Author": "K. Johanson \"Malka of Napa\"", "ReviewID": "R2RAIZ8MDIC23B", "Overall": "5.0", "Content": "I love this little camera that fits nicely in my back pocket. East to down load and very easy to follow steps in different kinds of picture taking. Great clean and clear lens for sharp photos. Malka of Napa, CA", "Date": "February 28, 2010"}, {"Title": "worst digital camera I've ever used", "Author": "Dave K", "ReviewID": "R1ZXCAPGURJG4R", "Overall": "1.0", "Content": "The flash is required to be used on every picture, or else the tiniest hint of hand movement (no matter how steady you hold your hand) will blur the picture. I don't know why the flash should make a difference in that regard, but it's consistent. Your preferences are reset every time you turn off the camera, so you need to re-select picture size, etc. I'd have to say this is the worst camera I've ever used. Even the one I had back in 1997, with the comport connection, was better than this.", "Date": "December 5, 2007"}], "ProductInfo": {"Price": "$349.99", "Features": "4-megapixel sensor captures enough detail to create photo-quality prints up to 11 x 17\n3x optical zoom and 4x digital zoom (12x total)\n1.8-inch LCD visible even in bright sunlight; movie mode with sound\nStore images on XD Picture Cards; 16 MB memory card included\nPowered by rechargeable lithium-ion battery; connects via USB 1.1. to PCs and Macs", "Name": "Olympus Stylus D590 4MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41QA039KRJL._SX300_.jpg", "ProductID": "B00032HC9W"}}