{"Reviews": [{"Title": "UPDATE June 2007", "Author": "Denise M. Grandits", "ReviewID": "R2ZOQG6SCM5QQE", "Overall": "5.0", "Content": "We bought an \"entry level\" camera three years ago and were ready to upgrade.I did some research on digital SLR's but then decided I'm no where near a professional photographer and just needed something to take great pictures of my children and other \"normal\" events.I found this Kodak and I'm glad I did!  I was going to buy the Z740 after reading the Amazon reviews but ended up with the Z710 for the 7.1 MP.I see someone else's review that the screen was grainy (I found that not to be true).  I haven't printed any pictures yet but have moved them to my computer and they are fantastic.The camera's optional settings (sports, kids, etc..) are fantastic.  I did find that I had to change the flash while on sports last night at my son's basketball game because the gym was a little dark.Which brings me to an AMAZING quality of this camera.  There is a night setting which allows you to take pictures in dark conditions.  I tried it out while driving home and it was amazing.  What was STARTLING was that I tried to take a picture of our all black dog in our completely dark bedroom (ABSOLUTELY NO LIGHTS ON IN THE ROOM OR ANYWHERE IN THE BACK OF THE HOUSE WHERE THE ROOM IS).  The results were fantastic (once I was able to find her in that darkness!!).  It was as if you were taking the picture in absolutely perfect conditions.I will have to get used to not zooming in so much with the 10x optical zoom because I'm not used to having digital zoom also on a camera.  Take your picture as close as you can without making it fuzzy and then zoom in and crop with the settings on the camera or with the software that is included.The camera looks much more expensive than it is.  I played with it for hours last night and the battery has not died (did have that problem with other cameras...battery lasting only minutes/hours).  Display is fantastic; features are fantastic.  Unlike other cameras, the monitor display is crystal clear in all conditions (well, not the total dark room but that's to be expected...and, it is very clear once the flash goes off and you see your image for a moment before it is saved).THIS CAMERA IS ABSOLUTELY WORTH THE MONEY!  You won't be disappointed.  If you're looking to take really great pictures with an amazing piece of equipment, you won't go wrong buying the Z710!Edit in June 2007:  Just came back from a field trip on the Maid of the Mist at Niagara Falls.  Wait until you see these pictures!  This camera is simply spectacular.  I thought I loved the pictures indoors at basketball games.  Then, the love just got bigger when the pictures are outside.  Great colors!  The LCD is a bit hard to see in bright sunlight but rest assured, you're getting the shot!", "Date": "December 8, 2006"}, {"Title": "A Great Value in Digital Zoom Cameras!", "Author": "M. J. Rogers", "ReviewID": "R2JA7TJ6EZG9TY", "Overall": "4.0", "Content": "This is my fourth digital camera having owned a Sony, another Kodak and a Nikon - you can see I went back to Kodak and here's what I found.First the camera isn't quite small enough for pocket size although it isn't cumbersome in the least and is actually lighter in weight than you would think. The pictures give one the impression this camera looks like a full-fledged SLR in weight and size.Typical of Kodak the controls are very easy to understand and even though the little \"getting started\" manual included is fairly skimpy - you don't need much to learn your way around the camera. I did find on this Kodak, the adjusting dial which you use to choose your shooting mode, a bit small. The wide/zoom button also seems a bit small so if you have large hands I strongly suggest you hold the camera in a store before buying. These little reasons were the only reasons I didn't give the camera five stars.I've posted some of my initial pictures and I'm very pleased! The 10x optical zoom puts me up close; the lens captures great detail and the colors look very true to form. I don't know the exact time but from when you first turn the camera on, it's ready to shoot pictures in only a couple of seconds and cycle time between pictures is plenty quick for me.I've not had any issues with the lens cap myself. It may not feel as sturdy as the camera but then again, it is only a lens cap. I did go and buy an additional memory (SD) card as the internal memory is only good for about 12 pictures in the 7.0 meg' range.I'll update this again as I spend more time with the camera but so far I'm very pleased and would recommend this to anyone wanting a simple digital camera with a great zoom lens and one I suspect will render crisp, clear pictures.", "Date": "January 2, 2007"}, {"Title": "Great camera!", "Author": "Carolyn Lee \"Navy Wife\"", "ReviewID": "R3EKYDO07JP57N", "Overall": "5.0", "Content": "I bought this camera on Black Friday when it was on sale. I am so happy with it! I recently learned that the optical zoom is really important and 3x zoom is not any good. I had been wondering why my other Kodak camera's pictures always looked far away and now I know. You need at least 5x zoom for good pictures and 10x is even better. Now my outdoor shots look great.It has a self timer so you can get yourself in those family photos.I would definitely recommend this camera.", "Date": "November 27, 2006"}, {"Title": "GREAT FUN", "Author": "Linda Lou", "ReviewID": "R262K5JXPZKYEK", "Overall": "5.0", "Content": "This camera is fun!  Many great features.  (I finally entered the world of digital 2 weeks ago with this camera.  Originally did not like the look of digital pics. that I had seen from other peoples cameras.  Was a die-hard 35mm.)  This one takes great pics!  Had them printed and you couldn't tell they were from a digital camera.  I had a zoom on my 35mm so that was important to me.  If you like zoom I highly recommend the 10x.  (Depending on what you are shooting some pics can seem a little blurry or hazy but so was my 35mm so that did not concern me.  Just the nature of SOME zoomed pics.)  Origianlly looked at the Kodak C875; but found that in my hands the Z710 was easier to use the zoom and shoot at the same time.  The C875 was not so easy.  By the time you used your zoom (I was taking a pic. of my toddlers) the shot I wanted was gone.  Since I zoom quite a bit there was no question as to which one to get.  Am VERY impressed with the quality of the camera and the pics it takes!!  Would highly recommend it.", "Date": "December 12, 2006"}, {"Title": "The Kodak z710 - great optics at a resonable price", "Author": "Another Movie FAN \"Steve B.\"", "ReviewID": "R9NQ2DO0PZF2P", "Overall": "5.0", "Content": "The Schneider 10:1 zoom on the z710 is absolutely one of the sharpest lenses I have ever owned bar NONE (including my Nikon F Series pro lenses).I don't mind the grainy image in the finder under low light conditions, as it serves as an additional warning that you need to use the flash (or intentionally set a lower ISO rating in `programmed mode' and steady the camera for the resulting longer exposures).It would have been nice if the camera came with a set of rechargeable batteries and charger, but I do like the fact that the camera has very good battery life and will run on several types of batteries, from simple standard AA pen light cells, to AA NiMH rechargeable batteries, to long life lithium photo batteries.  This gives you a lot of options if you find yourself in the middle of nowhere with dead batteries.The z710 has well laid out menus and controls, but if you are a relatively experienced photographer, you may feel that Kodak is guilty of slightly over simplifying things.For example, though the z710 has very sophisticated multi-zone automatic focus that works quite well, there is no manual focus mode (though it would have been easy to implement using something like the zoomed finder view already available in `review' mode to allow the user to zoom in and tweak the focus accurately)Also, although you can select several image resolutions, there is no way to adjust JPEG compression to a higher quality or select a standard uncompressed TIFF file format for output (though I suspect some would like to see a feature like that now that the price of 2Gig SD cards has started to drop).Kodak left out these features in order to leave room for a lot of `cutesy' things I have very little use for like this whole `EasyShare' thing.Overall I am very pleased with the cameras controls, it's just a crying shame (given the quality of the optics and capabilities of the hardware), that they don't offer a slightly more sophisticated user interface.Video capture with sound is available, but you can't zoom while filming, and the 640x480 capture mode only runs at a little over 10fps, which makes for slightly jerky motion.Given the above minor nit picking, I still rated the camera an overall 5 on the strength of the superb Optics (which rate about a 6 on a scale from one to five :)Kodak has a new z712-IS model coming out which sports a 12:1 Schneider Zoom, image stabilization, and which allows zooming during video captures and supports a full 30fps capture rate at 640x480, so if those features are important to you, then you may want to wait for the newer model.It looks like the introduction of the z712-IS has caused some retailers to discount the z710 (I just saw it at Best Buy for $179).  This is an incredible value compared to some of the past competition, but you may want to look over the new z712-IS models specs before making a decision.", "Date": "March 9, 2007"}, {"Title": "For the money it is a mighty little camera!", "Author": "HoraceHorse \"Wind&String;\"", "ReviewID": "R2A6T9MKBVOGJT", "Overall": "5.0", "Content": "If you want to take quality photos like the pros but you don't want to deal with the technicalities of setting the camera for the shots, then this is the camera for you.At 7.1 megapixels you simply can't out resultion this technology and why would there be a need to anyway. While the 10 - yes ten - times optical zoom just makes it a nice choice for the lazy Sports pro photographer as well.I took close ups of a tub of odds and ends, pencils old screwdrivers and other rubbish. Then I enlarged until the definition ( 'grain' in old camera speak ) began to fuzz. Unbelievable results after the edit printed on everday 6x4 HP stock and at normal resolution on a HP AIO printer.Haven't tried the landscape mode yet, but indoors portrait shots on Auto range/focus etc., came out superb as well. In addition the flash on auto does a great job, no need to tinker with that either. Movies work fine but with some care not to move the camera around too much when recording.You must get at least a 1 G SD ram card ( we got a 2gig Sandisk on sale at Circuit City for $34 ) with this model. At full resolution you'll get but 12 shots with the internal 32 meg. With the 2 Gig memory card the camera will take 907, yes that is nine hundred and seven, pictures.A person would be nutz not to buy this Kodak if they are looking for simplicty of use but want a professional print.", "Date": "December 23, 2006"}, {"Title": "Great Camera, Awful Software. Read on...", "Author": "C. Lupo \"goshawk16\"", "ReviewID": "R1VYLC6QITQPL7", "Overall": "5.0", "Content": "First and foremost, this camera is amazing.  Super crisp pictures, good battery life, excellent features, wonderful optical zoom.  I'm printing out 13\"x18\" high gloss pictures that look like professional prints.  Wonderful Camera.Now the bad news.The \"easy share\" software that you install with this camera is absolutely awful.  It conflicts with Adobe, permeates your system throughout the various programs and is all but impossible to fully remove.  Can you say reformat your hard drive just to remove?  Or use System Restore to get out of it.  DO NOT INSTALL SOFTWARE unless your ready to dedicate your computer to Kodak programs only.  Yes It's that bad!Buy the camera, but just use file transfer programs to move pictures around and you'll be ok.  Otherwise, get ready for late nights and locked up software.  This comes from my installing it on two Dell laptops, and one generic PC.Did I mention it's a great camera?", "Date": "May 17, 2007"}, {"Title": "Great pics, great price!", "Author": "Keeley", "ReviewID": "R58H9B1RVLTOB", "Overall": "4.0", "Content": "This camera gets 4/5 because the lens cap is flimsy and the LCD screen is grainy.  Otherwise, you will not be disappointed with this camera.I previously used a Kodak Z650 on a cruise and loved the results, so when it came time for me to update my digital camera, my husband chose this Z710 for me.  The picture quality is fantastic, the menus are easy to understand.  Battery life is great.As I mentioned, the LCD screen is grainy, so pictures may look like they are of mediocre quality when you take them, but when you develop them (or transfer them to your computer), they come out great.  I suggest using the viewfinder instead of the LCD screen when you take pics.  It preserves battery life and gives you a more accurate assessment of your subject.The lens cap is flimsy and pops off easily.  Be careful.Photo quality is so great that you can crop a picture and still enlarge it to 5 x 7 or even 8 x 10 with impressive results.This is a great camera for the advanced amateur or even for a beginner.  It may not be as small as some of the compact digitals, but the extra features (especially the high optical zoom) are worth the extra bulk.", "Date": "January 2, 2007"}, {"Title": "A Big Surprise", "Author": "John J. Firment \"basketgal4476\"", "ReviewID": "R2RL0PD2NMRKHF", "Overall": "5.0", "Content": "This was my second digital camera and was a bit shocked when I received it because I still have an Olympus that I use regularly.  I told my husband that I felt like I was cheating on my older camera with this new flashy one.  But my concerns quickly faded away.  This is such a user friendly camera.  When I first opened the box I spent some time reading the manual and quicly realized that I had in my hand the easiest camera I had ever owned.The picture quality is amazing and I love the 10X zoom.  Great for zooming in on my children in a large school photo.  I now reach for my Kodak camera when head out the door instead of my old Olympus.", "Date": "January 30, 2007"}, {"Title": "A very good camera", "Author": "DUANE", "ReviewID": "R3I6A3MLOAMA4U", "Overall": "4.0", "Content": "I am very happy with the camera. I was surprised that it is smaller than I imagined. Also, it comes without a rechargeable battery which is no big deal, but was a disappointment or at least a surprise. I would like to see this camera come with a rechargeable battery, charger and ac/dc converter. I bought them later from Kodak, and am quite satisfied. The camera has excellent functionality, more than enough pixels, great zoom,and I would recommend it to anyone with a reasonable level of technical skill as well as for the very demanding user.", "Date": "January 11, 2007"}, {"Title": "Feels like a camera in your hand, not a deck of cards with a lens", "Author": "Philip J. Bohlken", "ReviewID": "RAKFG33Z1HU1W", "Overall": "5.0", "Content": "I made the decision to buy this camera based on the many very positive user reviews.  It replaces a six year old 2.1 megapixel camera.  I am not disappointed.  Amazon's price is very good for a 7.1 megapixel camera with a boatload of features.  It is also considerably lighter in weight than the older camera.Later I read reviews by experts who give it only mediocre scores for picture quality.  They criticize it for no image stabilization leading to blur (especially at higher power zoom) and \"noise\" at film speeds over 100 ASA.  I set up a couple of situations in which both problems should have been very apparent.  Then I enlarged smaller portions of the frames to print inexpensive 4 x 6 test photos.  Had I printed the full frame, the print would have been larger than an 8 x 10.  I just do not see the problems the experts criticize.  The colors are rich and vibrant.I really appreciate the wide range of controls.  The user can choose from a number of modes fitted to various situations.  These result in a faster shutter speed, or more depth of field, or fill-in flash, etc.  It is not necessary to memorize the tiny icons on the selector dial.  An on-screen prompt tells you what each mode does.  I also like the amount of control in the manual mode.  The user can choose the ASA rating, shutter speed, apeture opening, and electronic flash mode.  The manual tells how to set the camera for special situations, like photographing documents.  When you take the picture, the through the lens screen goes black for part of a second.  You know the picture has been taken, unlike a camera with an optical finder.The camera is very intuitive for first time use.  I also read most of the manual on-line while waiting for delivery and handled the camera several times in a local discount store.When I first installed the software I restarted the computer, but it repeatedly would not recognize the camera.  I switched to another USB cord and it worked fine immediately.  Then it also began to work with the original USB cord.  I had even checked for a loose connection.  Who knows what that was about!One little thing to keep in mind is this.  If the camera is set on continuous auto focus, you can aim and shoot.  If it is set on one-time auto focus, you must press the shutter halfway down and wait for the green light before shooting, if you want sharp pictures.  I do not know, but expect the difference is battery life.A 1 GB memory card can store 485 pictures at the 7.1 megapixel resolution.", "Date": "April 11, 2007"}, {"Title": "Great Camera", "Author": "Jamie Wadkins", "ReviewID": "R2D8895QFCG8BB", "Overall": "5.0", "Content": "This is a great camera. I am by no means a professional photographer but I know this camera is very user friendly and easy to use. Just be sure you pick up an SD memory card when you get it because without it, it has limited internal memory for storing your pictures.", "Date": "January 9, 2007"}, {"Title": "Z 710 7.1 MP", "Author": "digikrt \"digikrt\"", "ReviewID": "RYELB0HCWDTAW", "Overall": "5.0", "Content": "Love this camera and system: different controls (night, beach, backlight,etc.) allow for vast diversity of capture plus the 10 X optical caps it all off.  Third camera and finally success!!Great point and shoot.", "Date": "January 23, 2007"}, {"Title": "Many features, great price", "Author": "Tom LePen", "ReviewID": "R1VEE7TZ2AFBFK", "Overall": "5.0", "Content": "I've been a 35mm SLR user forever and was a stubborn hold out from going digital. However, I finally decided to buy a digital camera but wasn't ready to fork over $1,200+ for a camera.I then came across Kodak's Z710 advanced point and shoot. The wide array of features on the Z710, plus it's Schneider-Krueznach lens, and it's very reasonable price convinced me that this was a great \"entry\" camera into digital photography. I've had it for 2 weeks now and I'm very happy.Simply put, the camera is fantastic. Amazing color rendition and ease of use. It's easy to handle and I like that it can be worn around the neck. The 10x zoom is also another strong point on this camera and I've used it to my great advantage. Kodak's Z710 has all the features of an SLR without the SLR price tag. I am happy to have it and I would recommend it to anyone seeking an advanced point and shoot digicam.I'll hold onto to my old 35mm SLR's and maybe still use them from time to time, but I know my Kodak Z710 will surely be seeing heavy usage from here on out. I give it an A++++.", "Date": "June 18, 2007"}, {"Title": "Excellent Image/Camera", "Author": "P. Ngo \"Jersey man\"", "ReviewID": "R2XQU09OATRJZW", "Overall": "4.0", "Content": "I just got this camera on last night. After I opened the box, and put Kodak batteries, I took a picture of my living with very little light in night mode. The picture came out very clear and was better than my Canon. It is so easy to use that you do not need to read the manual to know how to operate it. One thing that I do not like about the camera is the zoom mode is not accessible while in video mode.", "Date": "February 14, 2007"}, {"Title": "Very nice camera", "Author": "T. Luczak", "ReviewID": "R2DNOOXHUGMQ47", "Overall": "4.0", "Content": "I very much like the camera and the functions are awesome.  I especially love the cropping option and the clarity is still spot on.  The only downside is that I was using an HP digital camera and am currently using the software with that camera for transferring pictures.  The software that comes with this camera is nice, but when I transferred the photos from my camera to the software it didn't save it on my computer (just in that software with no option to move it to another location) and the pictures were removed from my camera.  I highly recommmend inserting a media card before taking any pictures so that you can print them from anywhere or use any software (I inserted the card into my HP photosmart printer to transfer the next time).", "Date": "January 2, 2007"}, {"Title": "This is a great camera!!", "Author": "A. Collins", "ReviewID": "RQNP85K7YYOHS", "Overall": "5.0", "Content": "I do agree with other reviews of this camera about the LCD being grainy.  But, it is not all the time.  I'm not a camera expert, but I think it has something to do with the amount of light in the room.  I took some photos of our horse outside & screen didn't seem so grainy. I have not had an issue with the lens cap, as I've read from previous reviews.  It does seem kind of flimsy, but it has stayed on just fine & has not just come off by itself or anything.  And the flash is so bright & great!!  I've had to close it several times & just used the light in the room for a photo & the room wasn't that well lit.I am not a fan of the Kodak software.  I have had two previous HP cameras in the past & I am VERY used to their software.  I changed the folder that the photos download to & I have been using the HP software to print & edit photos; Tools, Preferences, then the Transfer tab.  (I learned I could do this from a comment of a previous review.)  I think the only reason I will use the Kodak software is to print a card.  There are really good templates for kids & holidays.Over all....I LOVE this camera.  It is so easy to use & all the different settings make it easy to find the mode you need because it says it on the screen every time you change it, you don't have to memorize icons & pray you are on the right one.  I think this camera would be a great purchase for a beginner.  It's so simple to use.", "Date": "March 3, 2007"}, {"Title": "Oh, my!", "Author": "K. Robertson", "ReviewID": "RV26LVBZI2SUX", "Overall": "5.0", "Content": "I absolutly love this camera!  This takes such amazing pictures and such a huge step up from my old camera (a Sony Cyber-shot 3.1)The fact you have such a huge scene selection and just the complete ease of use makes this a fantastic buy for the first timer or even the expert photographer.  I cannot wait to take this down to Acadia Nat'l Park to really try this out!  Highly recommended!", "Date": "February 3, 2007"}, {"Title": "Great camera", "Author": "Michael Boggus", "ReviewID": "R3AJEMM6BMM57C", "Overall": "4.0", "Content": "The Z710 has so far proved to be a great camera for digital picture taking.  People familiar with Kodak digitals should find no problem working with the menu settings.  If you are interested in action photos however it is a little harder to find a good an appropriate setting in the menu as the \"sports\" setting is only just so effective.  And be warned, the image in the view finder is the same as the one from the LCD screen and you can't use both at the same time.  There is a button that allows you to switch back and forth.  But the picture results are excellent.", "Date": "June 9, 2007"}, {"Title": "Good value!", "Author": "S. Mann", "ReviewID": "R2X430IRR40980", "Overall": "5.0", "Content": "I've been using 35mm SLR cameras for over 30 years. For the last 9 or 10 years I have gone through several under $400 digital cameras as the technology has improved. This Kodak Z710 is a very economical compromise.  The built-in 10X optical zoom is a great feature.The Z710 does not have image stabilization (IS)as do some of the more expensive models but if you have a moderately steady hand and you press the shutter button rather than pound it (and the whole camera!) that's not really a problem.Another feature of this camera that I really appreciate is the manual settings position which allows much more creative control of a shot. Check out the Kodak web site for more information on this.I bought this camera from an Amazon dealer for less than $200 shipped to me.  That's cheaper than a reconditioned unit (same model!) recently sold on eBay.", "Date": "April 16, 2007"}, {"Title": "LOOKS GREAT_BROKE WITHIN 3 WEEKS", "Author": "Famke S. Thomas", "ReviewID": "R3OQFR2HGZCOUU", "Overall": "1.0", "Content": "I did a lot of research before purchasing this camera. I was pleased with the camera when I received it. After 3 weeks the LCD screen went out and over the course of the next week everything else stopped functioning. I thought, no big deal this should be covered under warranty. WRONG!!!! I sent the camera in and was told I would need to pay $140 to fix it. THey said that the camera had been dropped. I want to add that I never dropped the camera or exposed in to extreme conditions. If I had I would not be this upset.I owned a Nikon before for 3 years and never had any problems. I am extremely upset with Kodak and will never buy from them again. Now to get by broken camera back I have to pay them $30.", "Date": "June 29, 2007"}, {"Title": "Very Pleased. Exceeded my Expectations !", "Author": "M. Barnett", "ReviewID": "R21Q81V17C6BXK", "Overall": "5.0", "Content": "Like others have said, this camera delivers professional photos even if you're just a soccer mom or vacation family man. I wanted a simple camera that had a powerful zoom. I'm so happy. I've taken close ups at about 8\" to 50X zoom pictures. All crystal clear. And the battery life is phenomenal! I've taken about 100-125 photos and the Lithium-Ion battery which came with the camera still shows 100%. (You can see this if you hook up the camera to your PC and go to My Computer - Z710 Kodak Camera and right-click Properties).I'd highly recommend this for someone who wants a great crystal-clear zoom without the cost of a digital SLR.A 2GB SD Card will hold 906 +/- photos at 7.1MP or 120 mins of video...or a combination of both.Also, I did not install the included Kodak Software. I can transfer pictures no problem using Windows Explorer or My Computer. Note: NOT a typical Mini-USB. It's a MICRO-USB.I'll try to include a close up of my cat and 3 zoom levels of my geranium plant to show the quality.", "Date": "June 5, 2007"}, {"Title": "Impressive Camera!", "Author": "T. Marlow \"lost40000\"", "ReviewID": "R3AZGPK9A6H9H", "Overall": "5.0", "Content": "I purchased this camera for several reasons. I own a Kodak DX6340, which I love. The batteries, SD card(s), and camera dock are compatible with both cameras (with an adapter available on Kodak's website for approx $15).This camera takes excellent pictures. It has superior optics and is reasonably priced. It is very user friendly, the layout is similar to the DX6340 with more options. In addition to having the icons, the mode appears on the LCD. It also has 5 different sound options for taking pictures (preference I guess). It does not have image stabilization, but a tripod or a solid flat surface will give you clear shots at the maximum zoom, it also has a shaking hand icon to let you know when it needs to be really still. The LCD is a bit small but large enough to know if the picture is clear.You will need to get an SD card; the internal memory only holds about 10 pictures. I would also recommend either a card reader (if you don't have one) and/or a camera dock. It saves on the battery life tremendously and makes for much easier downloads. With a dock you can charge the battery while you download.  I've had the kaa2hr battery for almost 3 years now and it's still holding it's own really well.I feel I have to mention an observation here. I found this camera to have a very comfortable grip, however I am right handed. It may be quite awkward for a left-handed person to operate.", "Date": "March 20, 2007"}, {"Title": "very easy to use", "Author": "Valerie Reid \"Busy woman\"", "ReviewID": "R19Z5OFPQ0229X", "Overall": "5.0", "Content": "Great camera with clear picures for someone like me. I take family pictures, school pictures  etc.  Works great easy to use. !!!!!!!!", "Date": "February 9, 2007"}, {"Title": "AWESOME!", "Author": "Spencer E \"Spencer\"", "ReviewID": "R3SAI48RJ59JA9", "Overall": "5.0", "Content": "This camera is GREAT! It has excellent zoom, and takes high quality pictures. Whether you are an advanced photographer, or just a beginner, this is a wonderful product. The software that comes with it sucks, so it's best if you have a memory card reader that allows you to put pictures directly onto your computer instead of using KODAK as a middle-man.  One feature that kind of annoys me is the focus light. As the camera focuses, a bright green light is emitted from a bulb next to the flash. This feature is great when you're using the timer because you know exatly when the picture is taken (there's no guess work here). It's also good when you're taking group photos because the people know to get ready.The only problem is that there's no way to take authentic candid photos. If you just want a picture of people in their natural environment you may find this frustrating.Other than that, this is an excellent camera. It's small, compact, and very light. I have taken thousands of photos with it in the 6 months that I have had it. (I took it to Alaska, and the pictures I got with it where superb!)", "Date": "August 4, 2007"}, {"Title": "Excellent !!!", "Author": "Elson Alves \"Oaktree\"", "ReviewID": "R193OGLUA3MS97", "Overall": "5.0", "Content": "I bought this camera last december in Houston. Didn't have enough time to test it while there, but recently went on a trip to an island near the coast of Salvador (I'm from Brazil!).I never saw such crisp, live, powerful pics before! Decided to test its features and found myself stunned by the quality and power of this little camera. I'm not a professional photographer but my pics turned out to be best-sellers among my friends. I took 500 pics in three days and not even one came out in bad shape.Great cost-effective deal:Not too expensive.Amazing picture quality (10x optical zoom and 7.1 megapixels).Works with a wide range of batteries (AA, lithium dual pack, rechargeable).", "Date": "April 11, 2007"}, {"Title": "great results", "Author": "A. White \"world traveler\"", "ReviewID": "R25P34Z9T3V5ZO", "Overall": "4.0", "Content": "I've used this camera mostly on Auto, and love it's ease of use.  haven't tried enlarging any photos yet, so I can't comment on quality of larger prints, but the 4x6 are great.  I LOVE the zoom.  I'm mainly a travel photographer, and the zoom is really handy.  and it's quick--you don't have to wait long for the auto to fix itself to perfection.  great camera for beginners and pros alike.", "Date": "March 21, 2007"}, {"Title": "Love it!", "Author": "M. Fulton", "ReviewID": "RW21UW3ZLQY57", "Overall": "5.0", "Content": "I'm so glad to have graduated to a 'better' digital camera.  I'm so in love with this one's features.  It takes awesome pictures, too.", "Date": "January 30, 2007"}, {"Title": "Great Digital Camera", "Author": "K. Sardi", "ReviewID": "RVXMP588GVDFA", "Overall": "5.0", "Content": "I bought this camera a few weeks ago out of desperation when my other camera died and to my surprise, it's turned out to be fantastic. I'm a lousy photographer but I can't take a bad picture with this camera.  I love it.", "Date": "May 5, 2007"}, {"Title": "Kodak Z710", "Author": null, "ReviewID": "R5NTEXYLUWPH", "Overall": "4.0", "Content": "I got this camera for my birthday present in January and I'm extremely satisfied.  I'm very new to the entire \"photography world\", however this camera makes it easy to get into.  The camera is smaller than I expected, however it takes great pictures.  I use it often for pictures while we are on trips.  The picture quality is great, however screen quality isn't up-to-par with other brands.  This is a great value and I really like it.  My only complaint is that the Easyshare software is bad.  It's slow, outdated, and doesn't work well overall.  I recommend getting a 1 GB SD card.  I have 3 of them.", "Date": "April 25, 2007"}, {"Title": "Excellent camera for the price", "Author": "Mom to autism", "ReviewID": "RXMP4PVBV5ABD", "Overall": "5.0", "Content": "Was really suprised at how easy the this camera was to use and at the great photo quality.  Zoom is great!  Don't really care for the easyshare software.", "Date": "April 12, 2007"}, {"Title": "excelect", "Author": "Ricardo J. Marenco", "ReviewID": "REYXUIWR5FYAR", "Overall": "5.0", "Content": "Is one wonderfull camera,but you need to buy too.1. Memory.2. Carry Case.3. You need battery charger...Is an excellent camera.", "Date": "March 24, 2007"}, {"Title": "great features", "Author": "Amazon Customer", "ReviewID": "RZ52R7I457O1N", "Overall": "5.0", "Content": "Great camera for the beginner or advanced photographer. The SCN settings let the beginner take great pictures indoors and outdoors, close up and landscape, snow and beach as well as manners or museums and kids parties.  The sport setting lets you capture moving stills. The Video feature not  only records sound but when you play it back on the camera it lets you hear it all also. For the advanced photographer it will let you set your own settings and it is threaded so that you can add lenses if you like.  The 10x optical lets you get close without being blurred and there is a digital enhancement. The 7.1 megapixels lets  you blow up one small section into a nice size picture.  It is a great camera especially for the price. For the price other companies do not offer any where near all the extras this camera offers that I have been able to find.", "Date": "April 8, 2007"}, {"Title": "Nice Camera", "Author": "Jessica", "ReviewID": "R2NO5P48ATRJCK", "Overall": "4.0", "Content": "I upgraded from an old 2 megapixel Easyshare, and boy am I glad I did. It is very eay to use, and pictures come out great.I do find that the display looks a little grainy, but the pictures never come out that way. The lens cover comes off very easily, and I am not fond of the kodak software.", "Date": "March 31, 2007"}, {"Title": "DO NOT BUY THIS CAMERA!!!", "Author": "J. Beck", "ReviewID": "R1JY621D6TEU5U", "Overall": "1.0", "Content": "We bought this camera right before Christmas 2007 to replace an old 3.1 megapixel camera. We noticed right away that if you zoom too much (not into the digital zoom, just optical) the pictures are bad. It's also pretty shaky since it doesn't have the image stabilization. But we were OK with it anyway. Just had to be more careful when taking pictures. Plus, the lens cap was garbage from day #1.Well, fast forward to a couple of weeks after Christmas 2008. We're about a month out of warranty now and the camera now refuses to turn on. Tried new batteries, cleaning the contacts, etc. etc. This camera has been babied by us, too. Never dropped it, never exposed to liquids. No harm has ever come to it at all. But now it won't work at all in the camera mode.This was my absolute last Kodak camera.Don't get suckered in by the price. It's cheaper to pay more for a better camera that will last more than a year.I wish I could give this thing a -5 for a review. Unfortunately I can't seem to go any lower than 1 star.Stay away, stay FAR away from this junk.", "Date": "January 26, 2009"}, {"Title": "Excellent Camera with AWESOME zoom!", "Author": "K. Babin \"camerareviews\"", "ReviewID": "R2URHR7VPCKNWD", "Overall": "5.0", "Content": "I love this camera!  It's 5x digital zoom is so awesome.  I can zoom in on my son at his baseball games and the pictures come out so clear.  The LCD screen is a good size.  Not too small or too big.  The camera is not too big either.  It can easily be taken on vacations or sightseeing.  I highly recommend this camera!!", "Date": "December 18, 2006"}, {"Title": "Wish I still had this camera", "Author": "Tara Gosse \"\"Chef Girl\"\"", "ReviewID": "R1YGJUSRIQ2J6Q", "Overall": "5.0", "Content": "Had this camera for years until I accidently broke a cracked memory card in it. Technically I could probably get a pro to get the memory card out and continue to use it but instead I just bought a new one. I purchased another Kodak that was basically the 2012 version of this one, with more zoom and MP. It has way more features but the pictures are not nearly as good as my Z710. It took the best pictures!  I wish I could still use it.", "Date": "June 9, 2013"}, {"Title": "Good features and picture quality, but unreliable and poorly built", "Author": "Dave", "ReviewID": "R2BUNZZY7JPR7M", "Overall": "2.0", "Content": "My wife bought this camera new a couple years back, and initially it worked pretty well. Honestly it was probably too much for our needs, we are not camera buffs and could have just used any decent point and shoot. But I digress.The picture quality is quite good, it works well in low light, the face detection works well, and the menu system is fairly easy to use (the notched wheel). But the lens cap doesn't stay on at all, even though it is not visibly broken, after 1/10 or so shots it hangs up for 15 or 20 seconds and gives a 'please wait' type message, which means you have probably missed whatever moment you were hoping to capture. And just as often, it will fail to take the first picture for a few seconds, then flash, then in a few seconds flash AGAIN and take a picture of the floor or whatever. So you point, shoot, nothing happens, bring the camera down to look, then it takes it's picture. Again this happens about 1/10 of the time, so we miss many pictures due to camera problems.I wouldn't buy it again, or anything from Kodak. The camera has never seen abuse, it is just flaky and unreliable. Get something else.", "Date": "November 25, 2011"}, {"Title": "Great camera", "Author": "Lilac Lily", "ReviewID": "R3NMN852REOHKY", "Overall": "5.0", "Content": "Even though this is an older model I still really like this camera. In fact, I prefer the Kodak EasyShare Z710 to some of the newer EasyShare models. It has a sturdy feel to it, and seems to be of a better quality than some of the newer models that are made with a lot of cheap plastic buttons. Obviously, this camera has a pretty small LCD screen by todays standards. But the separate viewer makes up for that and with a simply push of a button you can switch between the LCD screen and the view finder. The picture quality is very good even in low light settings and the 10X optical zoom is a valuable feature. Overall, it's a good quality camera that you can get these days for a pretty low price.", "Date": "January 2, 2011"}, {"Title": "Glad I waited for it", "Author": "Michelle M", "ReviewID": "RDXM22TQLWSZF", "Overall": "5.0", "Content": "I bought this model after drooling over the 5 mp for a year. I love it! Right out of the box, I was taking great pictures. I wish I could figure out how to share some of the larger ones here and maintain the crisp details that I see when I view it on my computer. I have uploaded a few, though.I love the battery pack and am planning on buying the charger dock. I purchased in January of this year and have replaced the battery once, and I use it daily. It is difficult to get the hang of some of the settings, since I'm a point-and-click gal, but once I did, I was very pleased. Cats and kids don't sit still for long, but this camera has given me some great shots. I like being able to pop out the disk storage and pop it right into my computer to download everything-I don't use the Kodak software that comes with the camera. I can take plenty of pics with an optional removable SD disk, but the camera does have internal memory, too. Night mode is great, but it does require some playing around. Be patient, and you will be well-rewarded.My only complaints are, depending on how close the subject is, it can be difficult to get the zoom to cooperate and really focus, and it gets more difficult if the battery pack is slowing down. The video feature is great, but it's best to use it on a tripod if possible, and once you start filming, you can't zoom in or out. If you move, it can take valuable seconds to refocus. I had to send it in for repairs in April because the spring that keeps the disk in apparently broke, and it wouldn't go back in. Customer service was nice, but very slow (I was on the phone forever it seems), and had to ship my camera to a place in Rhode Island for repairs. On the bright side, I had it back in less than a week with no complaints, and, bonus, actually got MY camera back (they won't guarantee that).I would definitely recommend this camera to anyone looking for something easy to use, versatile, and with a good brand name behind it.", "Date": "August 12, 2007"}, {"Title": "Great Camera - Great Price", "Author": "R. Perez", "ReviewID": "R2LQ2QDH1URC1O", "Overall": "5.0", "Content": "I loved loved loved this camera.. Excellent zoom and crisp, clear pictures everytime. Only thing i didn't like was the kodak software that came along with this camera but you dont need to install it.", "Date": "August 7, 2007"}, {"Title": "Great camera!", "Author": "DanniGirl6475", "ReviewID": "RIGW7VGML8UX8", "Overall": "4.0", "Content": "I bought this camera for my boyfriend for Christmas.  He just used it for the first time back in May when he attended his daughters' Pre-K graduation.  The ceremony was held indoors (dim lighting) but the video option managed to capture great footage.  The picture and sound quality were great!  Very clear, with graininess in only a few spots.  The only problem we had is that you can't zoom in or zoom out once you start recording.  There may be a way around this, we just need to figure it out.  Ideas, anyone?Also, he snapped still-shot photos from his nephews graduation and again, the picture quality is sharp.  The colors are magnificent.  Someone had mentioned in a previous review that the LSD screen is a bit sensitive in light, making it hard to see (which is true), but the photos come out beautiful all the same.I wanted to invest in something simple that we could both use, since I love taking pictures also, but aren't very electronically-inclined.  So far, this camera has proven to be very user-friendly for first time digital camera owners and I think the quality is awesome.  I would recommend this product to anyone who would like to step up from 35MM and disposeables.  Just remember to buy memory cards!  I was a bit disappointed that one wasn't included.  The memory in the actual camera doesn't store much information at all.  We have been able to find reasonably priced memory cards at local stores such as Rite Aid and CVS Pharmacy.I also bought the compatible Kodak EasyShare printer for this camera, but we haven't used it yet.  I've read mixed reviews about it.  Anyone have any imput on this product as well?", "Date": "June 16, 2007"}, {"Title": "Excellent Camera", "Author": "M. Durgin", "ReviewID": "R24EUKYD95YDS3", "Overall": "5.0", "Content": "The Kodak EasyShare Z710 is very easy to use and produces excellent pictures.  I am a novice when it comes to photo taking and so far I haven't taken a bad picture with this camera.  The only downside is the lens cap which doesn't stay on at all.", "Date": "June 7, 2007"}, {"Title": "Could Not be happier!", "Author": "K. Jaggers \"wyattsmoma\"", "ReviewID": "R2B6ZRCS6M1E0O", "Overall": "5.0", "Content": "I am no profesional photographer but get profesional results with this camera! The video is better than advertised and as long as you grab a memory card for it theres no limits to the picture taking possibilities. I love that it will take pictures in the night or day and has settings for any type of photo I would ever take! I gave this product 5 stars becasue I dont think I could have been more satisfied! It came at a great price for all of its fun little extras!", "Date": "May 28, 2007"}, {"Title": "My first digital camera - extremely satisfied", "Author": "Fred Roberts", "ReviewID": "R1NNABDEKVJ2F2", "Overall": "5.0", "Content": "This is my first digital camera after using an SLR (film) camera for the last 15 years.I'm very happy with the Z710, with the quality of the photos, ease of use and the selection of features. The other reviewers have said it as well as I could. I tried a few test photos, zooms, sports, etc. The photos came out clear and distinct, even under conditions of swift movement.Another important point for me was the ability to use rechargeable batteries, which the Z710 does. So there is no dependency on expensive throwaway batteries.I would have prefered to have a digital SLR camera, but think I will be satisified with the Z710 until that day finally comes. The one thing I miss is the ability to experiment with different filters. And that's the worst thing I can say about the camera.But a few things I didn't like which had nothing to do with the photo quality: 1) The accompanying software (once installed) is started each time the system boots. I would prefer to start it myself when I need it, but this option doesn't seem to be available. 2) The video sequences are filmed in quicktime (.mov) format. I would have preferred a more accessible format (avi) which I could burn directly onto video cds. I still have to test more, but the video sequences seemed not as smooth as they might have been, especially after converting them to avis. I realized this might be a general artifact of videos produced via digital cameras.In general, it's a great value for the money, and I would recommend it to anyone in the market for a digital camera.", "Date": "April 4, 2007"}, {"Title": "Performance", "Author": "Mel A. Glynn", "ReviewID": "R395AIYCTLQPMH", "Overall": "4.0", "Content": "Very good camera.  Would highly recommend because of the excellent optics and ease of operation.  Looking forward to upgrading to a similar product with more features in the future.", "Date": "March 9, 2007"}, {"Title": "Words cannot even describe............", "Author": "Chrissy", "ReviewID": "RA0675W3RP197", "Overall": "1.0", "Content": "How much I dislike the easy share program with this camera.The camera itself does not take bad pictures, they turn out okay, the problems is getting them onto your computer for storage.  The program  they automatically upload to is crap!  It constantly shuts itself off, claiming it's experiencing errors on my brand new computer.  The customer service from kodak is pathetic.The process of burning to disc is very time consuming, and takes twice as long as any other method I've ever used.If I could give this camera a negative amount of stars I could.", "Date": "January 24, 2009"}, {"Title": "Not for low lighting pics", "Author": "Liz", "ReviewID": "R4WVFMB7VFRGE", "Overall": "4.0", "Content": "I have had this camera for a couple of years now.  I love it for daytime and great lighting situations.  Prints great pics whether ordered or printed from a printing dock.  However, I have children that play sports, sometimes at night (soccer, baseball) and in a gym (basketball).  In a gym, I can not get good pictures at all, day or night.  On the field at night, it may take an alright picture, but it very grainy when I print it.  Very disappointed, as a lot of my pictures are of my children playing sports.  It does take good action shots, just in the daytime, not at night.  For this reason, I will keep this camera as a take along snapshot camera in my purse, however, I am looking at a digital SLR for quality pics of my children's sports.", "Date": "February 18, 2008"}, {"Title": "Great camera for the price.", "Author": "Darrell J. Davis \"Preacher Man\"", "ReviewID": "R3DSBY8YZEI893", "Overall": "5.0", "Content": "Bought this as an upgrade to the Z400.  The LCD screen is a little granier than I would like but the pictures are great.  Works just like its supposed to, not much more you can say about any product.  It's very easy to use right out of the box but also has tons of features for the discerning photographer.  I've found myself wanting to learn more about photography just by using it.  I can't wait to learn all of the features on it.", "Date": "August 14, 2007"}, {"Title": "old camera model  but wonderful camera", "Author": "pwm31066", "ReviewID": "R3VQLPCF8MFVAQ", "Overall": "5.0", "Content": "My first Z710 was stolen out of my wheelchair backpack.. I shopped for two years to find another similar type camera. I bought a canon 12X  optical zoom power shot SX130 12.1 Mega Pixels but was not satisfied with the picture quality... may I add that I will sell this canon very cheap to someone...  Glad to find the Kodak Z710, even though it was used..  I like using AA batteries for camera....", "Date": "January 4, 2014"}, {"Title": "kodak easyshare digital camera", "Author": "Carol kennepohl", "ReviewID": "R4VS7D3YG2L8V", "Overall": "5.0", "Content": "The camera is excellent with everything I want in a digital camera. The German optics are what makes the kodak camera so good. My niece has an expensive Nikon, my pictures rival hers. Close ups are excellent. Sad to hear Kodak is going out of the camera business.", "Date": "October 29, 2013"}, {"Title": "Love it!", "Author": "Christopher Frenzel", "ReviewID": "RQLHFX5X74BW1", "Overall": "5.0", "Content": "This camera works very well !  I use it all the time, take it everywhere.  This is not compact but not a large camera either.  It takes very good quality pictures!  I used it for my daughters graduation pictures they turned out great and she saved a bundle of money too!  I would definitely recommend this to a friend.  This I believe is a quality camera at a reasonable price.", "Date": "October 14, 2013"}, {"Title": "Great Gift.", "Author": "Kaye Currey", "ReviewID": "RQU7HFNGBU71P", "Overall": "5.0", "Content": "The camera works fine. Was a gift for my Daughter, who has since upgraded the camera.  The old one still works great", "Date": "January 6, 2013"}, {"Title": "better than you think", "Author": "semi-pro", "ReviewID": "R1CUJX8UBW60OY", "Overall": "4.0", "Content": "when i got this i was skeptical since this is an 8 year old camera. so i took a few photos and they looked fuzzy on the camera, but when i blew them up on the computer they were fantastic! the videos, however, are fuzzy and the highest setting is at a low frame rate, which is a letdown. a little warning the flash really takes a lot out of the batteries, so you should bring extra if you plan on taking a lot of low light shots. rechargeable batteries are pretty much the only batteries that will last in this camera.", "Date": "March 11, 2012"}, {"Title": "Camera", "Author": "GAR", "ReviewID": "R39W8W820ACSNL", "Overall": "5.0", "Content": "I was not sure about purchasing do to the camera being refurbished. Now that i have had it for a couple of weeks now and i have taken some pictures. It's like a brand new camera everything works great.", "Date": "August 1, 2011"}, {"Title": "Really great product for the price", "Author": "mel \"Mel\"", "ReviewID": "R3UFEW1X2DEIT6", "Overall": "5.0", "Content": "I recived this camera over a year ago as a christmas gift and have been happy ever since! This camera is great for your every day photos! I have since upgraded but still use my kodak", "Date": "November 25, 2009"}, {"Title": "best camera ever", "Author": "Michaelene Masoni \"mmmom\"", "ReviewID": "RMLQX7WKH71RU", "Overall": "5.0", "Content": "I have had this camera for a couple years.  Its been through some rough desert and beach trips.  The lens looks scratched, and the lens cap won't close because of sand, and it still takes the best pics ever, even when zooming in w/editing pics!  Every time I give a pic to someone, they think I have a thousand dollar camera.  I have taken pics at soccer games along side parents w/those huge cameras with the huge zoom lens, and when we compare at the end of the season, I always shock them!I will get the exact same camera when this one finally goes kaput.", "Date": "July 15, 2009"}, {"Title": "Great Camera!!", "Author": "Kadi Merchant \"queen scrapbooker\"", "ReviewID": "R35OK8NW7VCGNL", "Overall": "5.0", "Content": "I have owned this camera for over 2.5 years and I love it!! My pictures come out great. I love that it has rechargable batteries. The only small glitch I have had during my THOUSANDS of pictures being taken is that night landscape pics don't come out well sometimes. For example, we went on a cruise to the Bahamas, St Marten and St Thomas and when trying to get night landscape pictures of the mountains all lit up or of the ship, I got some blurred images... Other than this, my pictures come out great. I love the easy to use options to enhance your situation (ie, sport, indoor party, potrait, etc). It is quick and convenient. The shutter speed is a little slow, but not nearly as bad as other cameras I have used.", "Date": "June 18, 2009"}, {"Title": "Ode to my camera", "Author": "C. Ridgill", "ReviewID": "R2ZUGOBVA2T3SO", "Overall": "5.0", "Content": "I have had my camera for a year now and I just can't say enough about it. I have taken thousands of pics and in many cases on the same batteries. I love the view finder, especially when outside. It is hard to see the screen sometimes when it is very sunny so the viewfinder is a must. You can see examples of my photos on my myspace page.. [...]I really love that you can crop right on the camera. The color is so vibrant and beautiful you won't believe it. Never in my life have I taken a good photo .. but this camera really makes me look good.My mother inlaw has a pricey digital camera, and  I put her memory card into mine and coppied all her photos to my camera. She was not able to do that with hers. It is so much fun to discover all the different things you can do with this camera. 10 stars.. 20.", "Date": "May 29, 2008"}, {"Title": "Great pictures.  One small complaint.", "Author": "Christy Lynn", "ReviewID": "R15UHGNUVE22Y9", "Overall": "4.0", "Content": "This camera takes terrific pictures.  The zoom is great and the menu of settings for different lighting conditions is so easy to use.  My only complaint is that it doesn't have an auto-close lense cap and the manual cap doesn't stay on.  This drove me nuts on a recent trip.", "Date": "May 1, 2008"}, {"Title": "Beautiful Photos", "Author": "L. Milligan \"denhamrookie\"", "ReviewID": "R2RQM89BQH0VXS", "Overall": "5.0", "Content": "I love this camera.  I wanted a digital camera with a view finder in addition to the digital screen because, as some of you may know, on bright sunny days, it is very difficult to see what you are trying to photograph because of the glare on the screen.  This camera allows you to switch between screen and view finder, and takes beautiful, crisp photos.  Mine is an older model, but I love it nonetheless.  The 10x optical zoom is great for closeups.  It's really easy to download photos to a PC or to email them from the camera.  I highly recommend this camera or a newer model like the Easy Share Z712.", "Date": "April 22, 2008"}, {"Title": "Great Camera With Some Reservations", "Author": "R. King \"Book Lover\"", "ReviewID": "R3US1PJWFH7L9O", "Overall": "4.0", "Content": "I bought a refurbished Kodak September 2007 and would recommend it for everyday use. Here is what I like:- reasonably priced- very easy to use (out of the box, I just pointed and shot)- perfect weight- 10x zoom lens- needs just two AA batteriesHere are a few drawbacks:- no zoom stabilization- weak flash- unless the light is perfect, picture quality is a bit grainy- poor lens capDespite the drawbacks, I highly recommend this camera. Contrary to what has been written in other reviews, mine has taken a lot of wear and tear without breaking down. I would however recommend buying a refurbished camera with 1-year warranty.", "Date": "February 10, 2008"}, {"Title": "Works well for the price", "Author": "redbandit2k", "ReviewID": "R2LNJFYFH48PGE", "Overall": "4.0", "Content": "I bought this on Black Friday this year and have been using it for a month now.  I have a Canon S2 (which is wonderful!!) and love the 12x digital zoom. I saw how cheap this was and thought I would try it out also because it had 10x zoom and motion setting.  As soon as I began using it I noticed how the pictures appear grainy on the LCD so I put them on the computer to check it out, but they look normal on the computer.  I like the fact that this camera has a setting for motion shots (the canon does not have one specifically for action).  I took pictures of my dogs playing and they came out great...however, the shutter speed on this camera is SO incredibly SLOW compared to my other 2 Canons.  When you push the button to take a shot, it takes the actual pictures about 1.5-2 seconds later so you do not get a shot of what you wanted-make sure you tell posed people to wait before moving. I am debating whether to take it back because I don't want to have paid money for action shots when my Canon is FAR better in every other aspect...the pictures are very nice, but I can't handle the shutter speed being so slow.", "Date": "December 26, 2007"}, {"Title": "Wonderful camera for the money! Awesome pictures!", "Author": "A. Huss", "ReviewID": "R3IC30OGS8Z5RM", "Overall": "5.0", "Content": "I got this camera to upgrade my 2.1 megapixel Kodak from 6 years ago.  I love it!!  It takes awesome pictures and has so many neat settings I haven't been able to use them all.  I am a very amature photographer and enjoy having the ability to set my own settings.  I have 2 young kids and need the ability to just grab a camera and shoot and this one offers that too.  I have read reviews where it is stated that the screen is pixelated.  Yes, it is a bit pixelated, but that is because the pictures are taken with 7.1 megapixels and the screen doesn't show nearly that man so the picture looks a little bad.  This is true especially when you are looking to take your picture.  The preview of the picture is MUCH better, but nothing compared to how the actual picture looks like.  The lense cap can come off if you touch it right, but there is a very good reason for that.  It is for people like me who forget to take off the lense cap before turning the camera on.  When you turn the camera on, the lense comes out, so the cap is designed to fall off so you don't hurt your lense.  Not that I learned this from experience or anything.  :)  I would definitely recommend this camera to anyone looking for a good digital camera.  The only thing is, I have NOT tried the software provided by Kodak to download my pictures.  Everywhere I read it said to not do that unless I wanted to devote my computer to the software and I don't, but all I have to do is plug the camera into my computer, open the memory and copy all the pictures.  I then paste them where I want them and there is no software involved.  We only paid $150 for this camera on black Friday, but I would've paid the $250 they are asking for it now.  Definitely worth the price!NOTE:  In response to the reviews that say the flash does not work well in low light, there is a setting (ISO) for low light pictures.  It takes very good pictures in low light, you just have to use the low light setting.", "Date": "December 18, 2007"}, {"Title": "Easy to use and good pictures.", "Author": "Karen M. Murchison", "ReviewID": "R2QT8LZ8VJT1YD", "Overall": "5.0", "Content": "My 27 year old daughter had this camera, and I really like it, so I bought one. Then my 14 year old daughter was using mine all the time, so I bought  her one for my birthday.Easy to learn all the features. Not too big and not too little.", "Date": "May 22, 2007"}, {"Title": "Great so far", "Author": "A. Fore", "ReviewID": "R12R7GIPVBKMRF", "Overall": "5.0", "Content": "I haven't had alot of time to mess around with it, but in the couple of instances I've needed to grab a camera and get a couple of quick shots, it's come through great for me. Controls are easy to use. LCD is easy to turn on and off. Zoom is easy to use. The real test will come in a few weeks when I take her to Kansas City and give her a good workout.", "Date": "May 15, 2007"}, {"Title": "Great product", "Author": "P. Alvarez", "ReviewID": "R138EQC5RJF6XK", "Overall": "4.0", "Content": "Great picture quality and very easy to use. The auto picture one of the best I have seen. The only con is the display is not bright enough to see under sunlight.", "Date": "April 15, 2007"}, {"Title": "Good Quality Pictures..Excelent Camera for the Price", "Author": "Edward C. Harris", "ReviewID": "R2WKLOU43ROIWC", "Overall": "4.0", "Content": "I am impressed by how easy this camera is to use. The picture quality is good & the NiC Battary that came w/ it keeps a charge for 2 weeks w/ steady use. The only problem is the lens cap won't stay on", "Date": "April 4, 2007"}, {"Title": "Kodak C710 review", "Author": "Dennis Latona", "ReviewID": "R3CRRJGJ7KP0TN", "Overall": "5.0", "Content": "Easy to use and understand.Gave this to my wife for Christmas and she loves it!", "Date": "February 21, 2007"}, {"Title": "random blurred shots", "Author": "Amy Belonio \"art amy\"", "ReviewID": "R2Y6RW31OGDLDP", "Overall": "2.0", "Content": "When the shots are good, they're GREAT and when blown up VERY impressive!BUT randomly a shot will be totally blurred (EVEN WHEN HOLDING CAMERA PERFECTLY STILL) it is so frustrating because it is seemingly always the best shots, which become unsalvageable.  It is so random that it does this it is not worth the frustration, I find myself taking 2 to 3 shots to hope 1 of the 3 will not be blurred. I am moving on to something else.  Of course most people gave this 5 stars which is why I purchased it, i think I got a lemon! Fingers crossed for my next one, I'm thinking of getting one of the newer ones that have image stabilization.", "Date": "November 2, 2008"}, {"Title": "I'm going to have to get me one of these!", "Author": "Reginald D. Garrard \"the G-man\"", "ReviewID": "R2FFSWD9SRE5OD", "Overall": "5.0", "Content": "Since I've started my new career as a reporter for the local newspaper, I have had the opportunity to use the Kodak EasyShare Z710 and I have been most pleased with its ease of operation.  This is the first digital camera that I have had any dealings with and I can wholeheartedly recommend it.  It lives up to its name in price, function, and adaptability.I can't compare it to other cameras because its my first dealing with digital but I'm glad that my first experience has been so rewarding.Just this past weekend, I made my first video with that particular ability of the camera.I was most impressed and can shout the product's praises as a great starter camera.", "Date": "February 19, 2008"}, {"Title": "This camera is great.", "Author": "Autumn B. Von Kaenel \"Autumn Von Kaenel\"", "ReviewID": "R2B2M59O5DANDY", "Overall": "5.0", "Content": "I love this camera. There are so many options that you can't go wrong.", "Date": "March 28, 2007"}, {"Title": "This camera is a worthless piece of junk", "Author": "S. Harrison", "ReviewID": "RZBVBQN68N5H9", "Overall": "1.0", "Content": "I had to send this camera to Kodak three times for repair during its one-year warranty period.  The first time it died was when I was on vacation in China.  It just quit.  Boom.  The next time it malfunctioned was on vacation in Hawaii.  All of a sudden the focus was erratic - some great pictures, followed immediately by total junk.  The third time was (of course) on another vacation trip, to Eureka, California.  Again, suddenly the focus went kaput.  Following the last repair, the camera has behaved well for about 9 months, but now is once again refusing to focus.  I've had it.My daughter has a three-year-old Kodak Z650, and it takes GORGEOUS pictures - that's why I bought this one.  But I am now ready to toss this one into the trash and buy a Canon.  I have bought Kodak digital cameras ever since they first appeared on the market.  Kodak has, however, lost me as a customer with this piece of junk.", "Date": "May 5, 2009"}, {"Title": "Sending back. Good for outdoors, too many dark areas on inside shots.", "Author": "Ann \"Ann\"", "ReviewID": "R38SI1U6QLAQ1V", "Overall": "2.0", "Content": "Although this camera was easy to use and the zoom was ok, I returned it b/c the photos of people were not crisp enough. For outdoor photos it is good. For indoors - I did not have good luck. Also do not like that there is not a battery indicator. Flash did not seem powerful enough. I was hoping for more out of this camera. Sending back and getting a canon powershot S3 or S5.", "Date": "June 15, 2007"}, {"Title": "Amazing", "Author": "S. J. Lundry \"Sandy\"", "ReviewID": "R159ORHTRB5SWO", "Overall": "5.0", "Content": "I purchased the Kodak Z 710 when I saw a friends pictures.  This camera takes amazing pictures and videos and the color and zoom power is the best I have seen.  I love taking pictures of my dogs and it does great with motion pictues.  I am 100% pleased with the purchase of this camera.", "Date": "August 14, 2008"}, {"Title": "Wow!", "Author": "Richard Lucas \"ol'luke\"", "ReviewID": "R399FC3SZMEUSD", "Overall": "5.0", "Content": "The Mrs. and I love this camera! It's very easy to operate and takes great pictures.", "Date": "March 20, 2007"}, {"Title": "Clunkier", "Author": "Steven C. Kaverman", "ReviewID": "R1VZ9MS57ORBD1", "Overall": "2.0", "Content": "The Z710 is clunkier than my first Kodak digital camera purchased in 2003 - smaller, lighter and picture for picture as good as or better than his unit.  We've had problems with it turning itself off immediately after we turn it on.  It did not include a memory card of any capacity, and did not include a rechargable battery.  Stripped down to the camera and a strap.  You have to be very deliberate about aiming and focusing or the quality goes to heck.  I would recommend you look elsewhere and consider another camera.", "Date": "May 6, 2007"}, {"Title": "Nice camera but...", "Author": "F. Pena \"Franco Nat\"", "ReviewID": "R1VACH5AVZV6C9", "Overall": "2.0", "Content": "I liked the camera when I bought it; the zoom is awesome, it is very funtional and has a great look. The only thing that I find very dissapointing about it is that the flash is very poor. For instance, when taking a picture in a moderate dark location the pictures will look very dark, I hate it. As I said, the zoom is great and the camera is perfect for daylight. I don't recomend it as your main or only camera.", "Date": "April 26, 2008"}, {"Title": "Camera fraud", "Author": "wisdom rules", "ReviewID": "R3S78OLEYTLDDX", "Overall": "1.0", "Content": "This camera was advertised as \"Used- very good condition\"  I purchased it and paid the postage.  When I got it, the camera DID NOT work. I tried putting new batteries in it and took it to a camera repair shop, just in case I was doing something wrong.  I was told it would cost more to repair it than what it was worth, since it had to be sent back to the manufacturers. I sent it back to the seller (and paid postage again).  Amazon reversed the charges on my Discovery account but said that it was advertised \"as is\" and good only for parts.  I checked the original ad again and THIS WAS NOT TRUE. Very disappointed.", "Date": "March 21, 2011"}, {"Title": "Displeased!", "Author": "Displeased", "ReviewID": "R35YC866UA1AY5", "Overall": "1.0", "Content": "I was very displeased with the camera I purchased from this seller.  The seller said it was in very good condition with a \"few scratches\".  The camera had dings in it, not scratches.  Also, the rubber piece around the eye lens had fallen off at some point when he owned it.  The rubber piece was not even on the camera when it arrived, instead in the bubble wrap.  Where the rubber piece belonged was globs of glue that had been used to replace the rubber.  I could have dealt with scratches, but not with dings.  The camera appeared to have been dropped on more than one occassion and had not been taken very good care of.  I will NEVER buy anything used off of any website as I have learned my lesson!", "Date": "September 21, 2010"}, {"Title": "Did not like", "Author": "Bonnie Jean Brecht \"BONNIEB\"", "ReviewID": "R22CKGVOSVOR69", "Overall": "1.0", "Content": "I bought this camera and the LCD screen was not clear, it had a yellowish tint and very grainy. I printed a few pictures and they also were not very good. After contacting Kodak I sent the camera back to Amazon (who has the BEST customer service) and the camera was replaced the next business day but, with the same problem. I have sent it back again and this time ordered a different Kodak camera. I did not like the camera but, I can not complain about Amazon's service", "Date": "November 30, 2006"}, {"Title": "Terrible Software", "Author": "The Bub", "ReviewID": "R1JFDXGXQ0AG8M", "Overall": "1.0", "Content": "Camera is okay, but the EasyShare software is terrible in my opinion.  I've had nothing but problems downloading the supplied CD and the Web supplied whatever. My 12 yr old kids got the camera to transfer pictures to the computer, but as you know, they never tell the parents how to do it. The Kodak Website is worthless in this respect.  I need this camera for my business, but so far its been worthless. I can't get the photos to download on Adobe, Picasa, or even the Kodak EasyShare itself. There's probably a good reason that the futuristic George Eastman committed suicide!  This company is in the toilet.", "Date": "August 3, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "7.1-megapixel CCD captures enough detail for photo-quality 15 x 20-inch prints\n10x optical zoom; 2.0-inch LCD display\nPicture-enhancing features such as cropping, live histogram, and capture grid line display\nComes with Kodak EasyShare Software Version 6.0\nStores images oon SD memory cards (includes 32MB internal memory); powered by lithium battery (included)", "Name": "Kodak Easyshare Z710 7.1 MP Digital Camera with 10xOptical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/4171ZJFB7RL._SX300_.jpg", "ProductID": "B000H9054A"}}