{"Reviews": [{"Title": "Save yourself the hassle.", "Author": "busymommie", "ReviewID": "R3QDFB4YHZ7SGX", "Overall": "1.0", "Content": "In the market for a camera upgrade from My Kodak Easyshare 2mp, I really thought that I had lucked out with this camera. My husband purchased this for me, because he knew I wanted a 5mp camera, and a new MP3 player as well. Two in one! Um, not so good. I can say this, the design is awesome looking and the LCD is very clear, which is why I gave it one star. It's pretty sleek looking and gets lots of comments on how cool it looks. Other than that, this camera is awful. It has very limited settings and the settings do not save once the camera is off, causing you to reset everytime.  The quality and color is horrible no matter what the light. I have yet, out of hundreds of test pictures with multiple different setting changes and configurations, to take ONE decent picture with this camera. They are blurry, grainy when you use the zoom and too dark even in the brightest of rooms. The flash literally whites out the picture when in use, I mean a huge white spot in 85 percent of the picture. The MP three player works ok, but the file listing is horrible. You have to pretty much guess what song it is when scrolling. The video mode has the same problems as the pictures, and no mic on the phone means you have no sound on any video you take. Overall, I would say don't bother with this, beyond the coolness factor, it's a horrible waste of money. There are too many problems to list. I am on the way to return mine. My easyshare 2mp takes better, clearer pictures and video than this and it's over 2 years old. Don't buy this camera.", "Date": "January 22, 2006"}, {"Title": "Hey...I like it", "Author": "David Osgood \"tom lyckus rules\"", "ReviewID": "RGLQ1IULX6RXV", "Overall": "4.0", "Content": "I had gotten a kodak 3mp camera for christmas, it broke after the first day and I was never given the recept, so I could not return it.  I through away the warrenty info, if there even was one so i was left with no alternative but to buy my own.  I got it at wall-mart for 140$.  My kodak was big and ugly and not too easy to use.  this camera by contrast is really sleek and super easy to use.  I really didnt need the mp3 feature but its a nice addition.  Im not like a photographer or any thing but the pictures come out pretty good.  yes the flash does white out some of the pictures but only when you are really close (less than 3 feet).  I really like the look, reminds me of an ipod.  I have yet to make prints but on my computer they look pretty good. Good price, nice package, bonus Mp3 player (would not suggest this for an everyday, stand alone MP3 player), decent pic quality, im happy.", "Date": "March 20, 2006"}, {"Title": "What a disappointment!", "Author": "Almost Heaven", "ReviewID": "ROWFNWTL1ZUDH", "Overall": "1.0", "Content": "The one star I gave this camera is for cool looks only. I returned it after only one day because it's look was all it had going for it. Most of the pictures taken outdoors were whited out, even with the flash disabled, the sun behind the camera, and the brightness setting turned all the way down. The indoor pictures were almost as bad, having inaccurate coloring.The mp3 player does not have enough volume. Also, if you have more than one song by the same artist on your list, you have to guess at which song you are selecting since only the artist name shows, not the song title. I suppose you could get around this by changing the name of each mp3 file you put on it..but what a hassle!A bad mp3 player and even worse camera..don't waste your money.I replaced mine with a Nikon CoolPix 4600, which is great. No mp3 player, but excellent picture quality.", "Date": "February 24, 2006"}, {"Title": "Looks great but doesn't  work great!", "Author": "bcourtney", "ReviewID": "R1VCPDYKMD02AL", "Overall": "1.0", "Content": "Just bought the camera a couple hours ago and now im packaging it back up to return. Looking at the camera, it seems like a good buy with the mp3 player and 5 mp but the pictures just come out horrible. The mp3 functions seems to work good. Would not recommend at all waste of money.", "Date": "February 14, 2006"}, {"Title": "Worth the money IF it's on clearance...but don't pay retail.", "Author": "Common Sense", "ReviewID": "R73D99FEO0NR3", "Overall": "3.0", "Content": "I found this camera on clearance for $49 at WalMart, and I bought it for my daughter.  No, it's not perfect, but I think it's an excellent camera for $49!  Would I suggest paying full list price?  No.  As other reviews said, the flash has issues.  But if you can buy this item for under $50, I say go for it!  My daughter loved it!", "Date": "September 28, 2006"}, {"Title": "horrible", "Author": "Not a Kansan", "ReviewID": "R1WEN3744THLZI", "Overall": "1.0", "Content": "Pictures are awful, blurry. you have to turn the flash off for it to work at all but it won't save the setting. I'd take it back if I could find my receipt.", "Date": "February 26, 2006"}, {"Title": "For what I Paid, It was a good deal.", "Author": "Annette M. Vickers \"DealEager\"", "ReviewID": "R1TEEMLAOAP6ZV", "Overall": "4.0", "Content": "Only reason I got this camera really was because of its great rechargeable lithium polymer battery. No more buying batteries for my camera, and it has longer battery life. Also, I only paid 49.99 for this camera at wal-mart.", "Date": "October 18, 2006"}, {"Title": "How much worse can you ask for?", "Author": "Zandra", "ReviewID": "RE71VMFNQ4K0F", "Overall": "1.0", "Content": "As we speak I am on my way back to wal-mart to return the Polaroid Izone 550. It is a very sleek looking camera, the lcd screen looks awesome, and the fact that it plays mp3's was the reason for buying. On top of the fact that it was a good buy for a 5 mp camera. When I went to take pictures of our living room though, with EVERY light on in the house it turned out HORRIBLE. The pictures turned out grainy,dark, and just bad. The concept of the camera was well thought out. I wish they had taken the time to work on the lighting issues. I'm going to go get a Cannon Powershot. I gave this product 1 star because of the concept and that's it.", "Date": "January 31, 2006"}, {"Title": "Its not even good enuf for an entry level camera", "Author": "Randy Phillips", "ReviewID": "R2E1RATXHAYEUF", "Overall": "1.0", "Content": "I paid $140 online, cudnt get the MP3 to work, the photos outside wer OK didnt try any inside, I got it for my wife but sent it back right away an got her a full featured 4 MP Kodak for $90", "Date": "February 22, 2007"}, {"Title": "Good, Basically, at Everything. Great Buy Under $40", "Author": "J. D. Scott \"Jack Straw from Omaha\"", "ReviewID": "R3D6XVI86W4O74", "Overall": "3.0", "Content": "I purchased my Polaroid izone 550 a couple of years ago on clearance at Wal-Mart for $35. It seemed to be, and was, a great buy at this price with all it offered in a 'small' package (a bit chunky by today's standards at almost an inch thick).  It's held up well functionally and cosmetically, with regular use.  Everything about this multi-media unit is good, in a basic way... except the weak ear-buds, the bloated software, and the lack of on-board memory. But these issues are easily remedied, with a nice set of headphones (low impedance 50-200 ohms, high sensitivity >100 db recommended) and all the GB of cheap SD flash memory you want.  I will say that the 2\" TFT LCD screen is actually great right out of the box, and downloading mp3's in WMP sync mode works just fine.  Plus, in my experience, this is a fun, if quirky, device that's covered my multimedia bases cheaply, conveniently  and enjoyably.  Now some specifics:CAMERA- Hey, this is 5MP, after all, and the bottom line on the camera is you will take decent pics once you get to know it since settings and features are minimal. You need plenty of light, natural light preferably, and a steady hand.  The flash works fine, it is actually powerful, overwhelmong at close range.  I recommend a tinted plastic film over the flash and it's tamed to work better when needed.  Just practice shooting a bit in- and outdoors at first, and then you'll be ready to take good photos when you need to.VIDEO- See 'Camera'.  This is not the izone's strong suit but can be a lot of fun on the fly, provided there's plenty of light and a steady, paced operator.  Practice first, and you'll make vids worth keeping.  Cam and vid can use up the battery in about an hour, but you can charge this unit everywhere with the small usb input- you get about 3 hours out of mp3 use.MP3 PLAYER- extremely simple, basic GUI, with only 8 characters for artist, title and star rating, and no EQ or tone controls! But, the sound quality is actually excellent, with plenty of volume (keep in mind my headphone recommendations). I thoroughly enjoy the depth and texture of the sound, with deep, rich, articulate bass tones.  Again, syncing with WMP and Windows XP works smoothly, although the player can be picky at times about file types.The bottom line is, this unit packs plenty of good, raw hardware, though it certainly lacks significantly in the way of adjustable settings and features, as is. But with a little (easy) dressing up and familiarity, it delivers the goods. Polaroid: our izone 550's would benefit tremendously with firmware and software improvements <hint><hint>.  As is, a recommended buy at under $40.", "Date": "March 5, 2009"}, {"Title": "Horrible Camera", "Author": "M. Osborn", "ReviewID": "RNMD85Y3GSPLU", "Overall": "1.0", "Content": "I bought this a year ago. It sucks. I cant take any pictures inside even with bright light. It looks like I'm in a cave. It was cheap for a reason. Do not buy this camera. I cant even get the mp3 function to work.", "Date": "February 9, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "Compact digital camera makes it easy and fun to take high-quality images\nDelivers amazing quality with 5.0-megapixel images on a two-inch LCD screen\nFeatures a built-in MP3 player so you can listen to your favorite tunes when you're not taking pictures\nSmooth and fluid 4x digital zoom lets you catch every detail in a tight shot\nComes with a one year warranty", "Name": "Polaroid iZone 5.0 MP Digital Camera and MP3 Player", "ImgURL": "http://ecx.images-amazon.com/images/I/31TZ7OBtIqL._SY300_.jpg", "ProductID": "B000CBV4QG"}}