{"Reviews": [{"Title": "Incredible camera for the price", "Author": "Dean Winiarski \"guy with opinions\"", "ReviewID": "R2CA6XXFTK05TK", "Overall": "5.0", "Content": "I've been very happy with Kodak digitals ever since I got my 3mp EasyShare about three years ago.  That camera was a workhorse that never failed.  But when I dropped it into a river this fall, I knew it was time for an upgrade.I was a bit wary of this new model, since it's predecessor (the 6.1mp model) was known to have some issues.  But so far, this camera has been completely problem-free.Not only that, but it TOTALLY BLOWS AWAY my old 3mp---and I was VERY happy with that camera!  Incredibly, this camera has TWICE the power and TWICE the features at HALF the price.  Now, some might say that's just due to perpetually advancing technology in general; but even when that factor is considered, I think Kodak is still significantly ahead of the curve when it comes to \"bang-for-the-buck\" functionality.  I've met \"professional photographer\" type snobs who laugh at these Kodak digitals because they look \"cheep\" and \"simple\" compared to their $2000 SLRs.  But the picture quality is what matters, and these little things come pretty darn close to matching the quality of cameras FOUR TIMES the price in 90% of your common applications.I won't go into a feature-by-feature breakdown, but I'll mention my favorite three noticeable improvements over earlier Kodaks in this line:  First, the self-closing lens protector is such a welcome improvement.  Second, the natural color balance seems to be somewhat improved right out of the camera, reducing my need to tweek my pictures with PhotoShop (I'm a perfectionist about that).  Third, these new intelligent shooting modes REALLY WORK!  One of the most troublesome shots with a digital is a BACKLIT lighting situation; but this camera's \"backlight\" mode compensates incredibly well (saving me a heck-of-a-lotta PhotoShopping as well!)If you're looking for a relatively inexpensive camera that's durable and easy to use---and takes great pictures---this is your choice.  But... don't drop it in the water!", "Date": "November 5, 2006"}, {"Title": "Best Bang for the Buck", "Author": "george bancks", "ReviewID": "RJN9CUSELRM91", "Overall": "5.0", "Content": "Here's my recent camera check list:Under $200  - checkUses AA Batteries - check (I already use NIMH for almost everything)At least 6MP  - check (it's got 7MP)simple to use  - checkSmall  - check (It small but not to small for my fat fingers)USB connection  - check (with easyshare plug it in and it takes off)SD media  - check (I got 1G 30fps that's over 700 pictures @ 7mp)Weight  - check (a little over 5 oz empty)viewfinder  - check (most small cameras don't have one)LCD  - 2.5 indoor/outdoor viewing better than my last cameraPanoramic  - NO ( the only thing missing)I looked at a lot of cameras and I could not find any under $400 which meet all of my criteria. I really liked some other cameras better but they didn't have AA NIMH support or didn't have a viewfinder and sure don't need a $50 battery even if it rechargable. My wife likes it, too. Easy to use so I'm not stuck being the only person able to use it(not meant to be sexist) even my kids can use it and so I'm not to worried if they break it because it under $200. not including the $50 SD cardI love it.", "Date": "October 24, 2006"}, {"Title": "Great quality photos!!!", "Author": "M. Mcelhaney \"MM\"", "ReviewID": "R29Y2WGY3AO1OD", "Overall": "5.0", "Content": "I decided to move from film to digital and after much consideration I decided on this one. This is a great little camera!  The pictures are wonderful on camera and when printed with the G600 or my home printer.  The camera and printer dock are extremely easy to use. It also comes with a program that allows you to post your photos online and e-mail the to friends and family.  This worked out great for me with distant relatives.  I also bought a 512mb memory card to go with it.***I do recommend that you use the lithium batteries.  The alkalines that came with the camera went within 48 hours of me receiving the camera. (camera would not turn on after being shut off and would shut off on its own before preset shut off)  The camera works great with the lithium battery.This is a great choice if you want great photos (of the kids) with little effort!", "Date": "November 14, 2006"}, {"Title": "great little camera", "Author": "K. Allen", "ReviewID": "R3RV1Z0YUXYP2K", "Overall": "5.0", "Content": "I wanted a small easy to use, inexpensive camera that I can keep with me.  I have a couple of other digital cameras that are very nice but a bit too bulky for carrying everywhere.  This camera takes very nice, crisp pictures and I am very happy with it.  It is very easy to use, the controls are placed perfectly for me.  My other cameras have a lot more manual adjustments but I didn't want that this time. I wanted something very simple to use, mostly point and shoot with different scene options.  I first bought it on HSN with a printer but the printer didn't work so I had to send it back.  I really like the camera though so I bought it here at Amazon.  Before I found this one, I had tried a Pentax 7 megapixel camera but the pictures were not as sharp as I wanted.  I would recommend this camera for anyone who wants a nice little camera that takes great pictures.  It is so easy to use, even a novice ould easily master it, right out of the box.", "Date": "November 19, 2006"}, {"Title": "A Good and adequate point and shoot camera", "Author": "hazelqj", "ReviewID": "R2UST4VIUL5VL0", "Overall": "4.0", "Content": "I bought this camera for someone as a gift. Before buying it I did some research and read reviews at different sites on the Internet as well as here on Amazon. The negative reviews really scared me, especially the ones here on Amazon, but my goal was to find an under $200 camera, so I followed through and bought it. I tested the camera out and my impression is that is an adequate point and shoot camera. I think some of the reviews here are much too harsh and I think some of those folks were looking for something more than a camera at this level can provide. I charged the batteries and fired up the camera and started taking pictures and video. I found the camera very simple to use. One review I read complained that the user's manual did not have much information, but the camera is so easy to use, what else do you need to know?? I don't know what else they could put in the manual. The controls are self explanatory as well as menu settings. The camera did not feel like a toy yet it did not feel solid like a full bodied SLR either, but I didn't expect it to. the pictures I took looked fine. The pictures weren't pro quality, but again, I didn't expect them to be. But the pictures were good and showed more than enough sharpness for this level of camera. I took pictures in bright sunlight, indoors, in the dark and they all looked fine. One review I read said that the camera sucked the life out of the batteries, but I didn't find that to be the case at all, however, I tend to take pictures using the view finder anyway. Another review said the pictures were blurry with this camera, but I had to really be moving the camera to make my picture blurry. All in all, I think the C743 is more than adequate as an under $200 point and shoot camera. The only thing I didn't like about it was that it was a little slow taking the pictures. Other than that, I am very pleased.", "Date": "January 6, 2007"}, {"Title": "Excellent Camera", "Author": "jm \"jayclm\"", "ReviewID": "R2BX5RJ98NIUBK", "Overall": "4.0", "Content": "For the price, it can't be beat. I like to take a lot of indoor pics with low lights, like at a club or something and the camera takes very good pics for low lighting. On automode, it takes rapid fast pictures, exactly what I was looking for. During the day, the pictures are crisp and clear. I've had the occasional blurry picture, but that was due to my hand or that i turned on my camera right away. No real major complaints except that it can eat up batteries (I just ordered rechargables) and it can take sometime to load on the computer. (in the camera's defense, I have a 2 gig sd card in it with over 800 pictures). The movie mode is one of the best I've seen. Highly Recommend !", "Date": "January 14, 2007"}, {"Title": "C743: Why pay More?", "Author": "Dennis Bowcut \"dbowcut\"", "ReviewID": "RXITIB36ZW054", "Overall": "5.0", "Content": "Picked up the Kodak C743, advertised at $159, but in store at Circuit City for $139 with a 512MB SD card.  Camera fits in pocket, has all basic features and 7 megapixels!  Menu on this Kodak is simple, LCD screen is very bright and non-reflective, but since there is a viewfinder as well, there should be no problems when the LCD is unusable in bright sun.  Main operation buttons are good sized, clearly marked, and this camera is as intuitive/user-friendly as digicams get.  Took some shots through my spotting scope and they turned out surprisingly clear.  Flash is a little weak, but the price is definitely right on this model and the phrase \"Why pay more?\" comes easily to mind...", "Date": "December 9, 2006"}, {"Title": "Great Great Camera", "Author": "C. Williams", "ReviewID": "RDP8B2G1XDGZQ", "Overall": "4.0", "Content": "Perfect for our teenage daughter.  Takes very good pictures.  The different settings for low-light, bright light, etc., are very useful.  Easy to manipulate the various settings.Software is easy to use, but I have disabled it from auto-starting in Windows because it is then always running, consuming cpu time (waiting for a camera to attach, and always checking for updates to the software) when, in fact, it *only* needs to be running when you are uploading pictures from the camera - technically, you can upload photos from the camera without the software even installed - but the software makes a nice organizer, editor, and viewer.Wish there was a little more memory on it - 32 meg - we will be getting an SD card to go with it.Highly recommend this camera for a very good starter digital camera.", "Date": "January 31, 2007"}, {"Title": "A great Buy", "Author": "M. Schnur", "ReviewID": "R20Y7RIR80LH1K", "Overall": "4.0", "Content": "I am fully satisfied with this little camera! It's worth the price which isn't very high for what you get. Takes great pictures outside and inside dark and light. I am a lighting designer so I needed to take dark pictures for a portfolio and the camera did well once the right setting was chosen. I don't usually take pictures at the full 7.1mp. I have it set at the 6.1 setting so I can take more photos on my card.", "Date": "January 13, 2007"}, {"Title": "Deeply Disappointed", "Author": "J. EDWARD", "ReviewID": "R3SO7FW5AOUKMK", "Overall": "1.0", "Content": "I have owned a Kodak DX7630 for the past 2 years. It takes excellent pictures outdoors and OK pictures indoors. I was looking to upgrade to a higher megapixel camera with a sleeker design. The other model is a little bulky. I used the C743 for the first time on Christmas Day. Out of 120 pictures, 3 were worth the ink to actually print. 75% of the pictures rated from slightly blurry to completely blurred and grainy. This even occurred when holding the camera completely still and taking a picture of an inanimate object. Blurred!! I even asked guests to see if my hands shook (maybe I had a nervous twitch I did not realize), but no! I have already returned this product. I seen only one other negative review listed with similar problems of blurred and grainy pictures, so maybe the two us us just got stuck with a bad product. Either way I am purchasing another camera that is not made by Kodak.", "Date": "December 30, 2006"}, {"Title": "Good Camera for the money", "Author": "Fenway466 \"Space Guy\"", "ReviewID": "R2DGUXTNSCDORZ", "Overall": "4.0", "Content": "This is the ideal starter camera for a beginner.  I found it easy to use and simple to get started with.  However the software that comes with this camera is not so great. It runs slow on my system and has features that most people won't really ever use such as a greeting card maker.  You're going to want a memory card with this camera as the internal memory doesn't hold a huge number of pictures.", "Date": "February 19, 2007"}, {"Title": "very weak indoor/low light performer (pics and video)", "Author": "Amazon Customer \"buddyroo\"", "ReviewID": "R3M1DFQAJO5KEF", "Overall": "3.0", "Content": "I guess for the price it is okay, but there are some definite problems with this camera. First, in my use so far it is almost unusable indoors; the camera needs A LOT of light to be able to focus, and indoors (even with several lights on) it often won't focus (and if you try to take the picture anyway, it will tell you it is too blurry, meaning you won't be able to make a good 4x6 print out of it). The video functionality also suffers in low light --- it is okay outdoors in bright light, but videos taken indoors are very dark and can hardly be seen. In sum, for bright outdoors shots and videos it is okay, but it doesn't work well indoors.", "Date": "December 9, 2006"}, {"Title": "EASYSHARE C743 7.1MP", "Author": "R. L. George \"SOULFABLADY\"", "ReviewID": "R2XRJQFRWSB5X4", "Overall": "4.0", "Content": "IT TAKES GREAT PICS, EASY TO HANDLE AND DOES EXACTLY AS IT SAY, I THINK MORE FEATURES ADDED WOULD HAVE GIVEN IT MORE FOR IT'S MONEY BUT I WAS L@@KING FOR A EASY TO USE CAMERA AND THIS WORKS JUST GREAT! I WOULD RECOMMEND IT TO SOMEONE WHOSE FIRST TIME TAKING A SHOT AT A DIGITAL CAMERA, REALLY WORTH IT! I ALSO, BROUGHT IT FOR THE NAME, WHICH I HAVE KNOWN FOR YEARS/GENERATIONS AND THEY ARE STILL AT THEIR BEST!YOU WONT REGRET YOU EVER PURCHASE IT...IT REALLY SOLD ME!", "Date": "January 19, 2007"}, {"Title": "So far so good", "Author": "Mariadelpilar Verdes \"Maria del Pilar Creech\"", "ReviewID": "R22RFN5YKDCCCC", "Overall": "4.0", "Content": "I got this camara a couple of weeks ago and I'm very pleased, since this is my first digital it took me a couple of tries to see how all the settings worked, of course at the beginning there were some blurry ones but changing to the appropriate settings solve the problems.  We just used it on a trip to New York and took night pics, some from the car while moving and through the windshield and they are great.", "Date": "January 2, 2007"}, {"Title": "Great Camera", "Author": "S.Sakioka \"BookCollector\"", "ReviewID": "R18SD76FVF57I0", "Overall": "5.0", "Content": "We were in the market for a new digital camera with a higher than 6MP rating and chose this Kodak EasyShare based on the MP, the price and the ease of use.  We are VERY happy with our purchase; we have had the camera two weeks at this point.  Previously we owned a Sony digital camera 4.1MP that is two years old.  The photos we have taken with this camera are clear, color is great and all were a snap to email to friends and family.  I would recommend the camera to anyone looking for a new digital camera, in fact, I purchased one for my mom and dad for Christmas.", "Date": "December 20, 2006"}, {"Title": "Perfect, inexpensive option for us!", "Author": "Kitkat", "ReviewID": "R2DUMOO6LL6R0Q", "Overall": "4.0", "Content": "We are not big users of technology.  This bundle was very inexpensive and allows us to produce printed photos with nearly no effort.  The camera is straight-forward to use, though not a sleek as some we've seen!", "Date": "March 12, 2007"}, {"Title": "LOVE IT, LOVE IT, LOVE IT", "Author": "Antonio Gallizzi", "ReviewID": "R1N8DYI084F2S3", "Overall": "5.0", "Content": "I am a busy mom of two young children.  This camera is perfect for capturing all of their cute faces and happy moments.  I love the fast cycle time. I love that I can take multiple pictures in seconds. Would recommend to anyone.", "Date": "March 8, 2007"}, {"Title": "good camera - except screen cracked after 5 weeks - now useless", "Author": "TRMM", "ReviewID": "R3EV4114RGPH73", "Overall": "3.0", "Content": "I bought 3 for daughters over christmas.  Seemed like a great value. They all love the camera.  Very intuitive and easy to use - which helps me out a lot w/ minimal \"training\" from dad.Sad news though, One daughter took pictures at church last night and when she pulled it out of her purse after getting home the lcd screen was cracked and camera is useless. Looks like $150 down the drain.I've seen where one of the Canon cameras has trouble w/ lcd screen cracking easily - not sure if this is a trend w/the Kodak or not.  Perhaps the bigger screen size is more fragile.", "Date": "February 1, 2007"}, {"Title": "Awesome camera", "Author": "patdra \"patdra\"", "ReviewID": "R3N1GPK3QY1CJ0", "Overall": "5.0", "Content": "I bought this camera as a second one for my husband and daughter.  It is really easy to use and takes wonderful photos. I have a 512 mb SD memory card and set on 6.1mp it stores up to 419 pictures.  At 7.1mp it holds up to 372 pictures.", "Date": "July 9, 2007"}, {"Title": "Great Bundle Package", "Author": "Ericka D. Warren \"Greggory\"", "ReviewID": "R1E6FB8EUMG6FA", "Overall": "4.0", "Content": "This product was a dream to me when I first saw it. It explores different features within itself. This product is very user friendly and very self efficent. I would give this product as a gift to anymore. My hats off to Kodak.", "Date": "January 24, 2007"}, {"Title": "The best Digital Camea yet", "Author": "K. Arroyo", "ReviewID": "R1AOFUAL9AUKPK", "Overall": "5.0", "Content": "Very easy to use, multiple languages, something nice and easy for even unexperienced users.  Recommend to anybody buy it, it's worth it.  And the price is right for the features and MP.  I would not hesitate to pay more for this camera.  Kodak has done wonderful job with this one", "Date": "February 6, 2007"}, {"Title": "For 4 wonderful days", "Author": "Timothy S. Anderson-Bowen \"CPT A.B.\"", "ReviewID": "R3216NA6PC9TBO", "Overall": "5.0", "Content": "This I believe is my eighth or ninth digital camera and all but the first one was a Kodak EasyShare.  And unfortunately all but two have met their demise at my hands.  I love to take my camera where ever I go and my wife cringes every time I go out.  I am in the Army and love adventure sports.  The combination isn't well suited for camera handling and I do my best at trying to take care of them.  The last camera that I purchased (before this one) was an EasyShare 643 that I bought before deploying to Iraq in January and it lasted until July when it took one too many tumbles from atop my HMMWV (Hummvee).The camera that I purchased to replace it was this EasyShare 743.  I love these cameras.  They're light weight and compact.  With a 1GB SD card and the Kodak Rechargeable Digital Camera Battery I was able to take over 700 photos between charges and downloads.  The best feature I like is that when pressing the shutter button it takes the photo almost instantly; where other cameras tend to wait for the auto-focus and you miss your shot.  While I'm deployed I figure a camera is doing well if it can last 6 months or more.  For this poor camera 4 days was all it had.  While returning from a mission my .50 caliber machine gun got caught up in some low wires strung up by the local Iraqis and pulled from its connection to the HMMWV.  It landed on my camera which I had thought was securely position inside my turret.  Needless to say the camera was not built to have 150 pounds of machine gun, ammunition and mounting bracket slam into it.  I plan on buying another one as soon and my wife will let me.  I swear by them.  They can take a beating (most times).  I have dropped them, gotten them wet in the rain, covered with dust and sand from driving around in the desert, but they all have managed more than I thought they should in the environments that I have taken them.  They are the best cameras.", "Date": "August 28, 2007"}, {"Title": "Excellent Camera", "Author": "Suzanne Kary", "ReviewID": "R3UISCYLYWTKN4", "Overall": "5.0", "Content": "This is an excellent camera. It's compact and easy to carry around, plus I like the viewfinder option for bright, sunny days. The pictures come out crisp and clear and the color is great. I would highly recommend this camera.", "Date": "August 23, 2007"}, {"Title": "Hard to say", "Author": "Audrey K.", "ReviewID": "R167KY1GTUON6K", "Overall": "4.0", "Content": "Our new camera takes beautiful pictures and easy to use but...it goes through batteries and sometimes doesn't want to turn on even with new batteries. I found this also the case with another Kodak camera that we had.", "Date": "August 14, 2007"}, {"Title": "Quality Good, extremely low battery life", "Author": "Beaner \"Bean\"", "ReviewID": "R133GMFVR9E4QD", "Overall": "3.0", "Content": "I'm very happy with the camera itself and the quality of pictures it takes. The worst problem is that the batteries only last a very short amount of time. I've taken the camera to 2 different events that lasted about 3 hours each and both times the batteries died. Keep in mind that I don't use the live view on the camera because I know how much more that kills the batteries. If I still had the box the camera came in, I would most likely return it.", "Date": "July 4, 2007"}, {"Title": "Great camera BUT not durable", "Author": "Linda McCrane \"puddums314\"", "ReviewID": "R2M337F3J0CEUA", "Overall": "3.0", "Content": "The camera works great... when it works.... for the price, the feature are very good... high quality prints & the video capture with sound is fantastic since you can take video up to the size of your SD card. On the down side the camera is not very durable. The LCD is easliy broken, as is the lens, a lot seem to experiance an error message when trying to open it... I've also had the battery cover break... not break off, the cover cracked in half & part of the plastic fell off....", "Date": "October 22, 2007"}, {"Title": "Very nice compact camera", "Author": "K. Conner", "ReviewID": "R2APSF7A15GB9D", "Overall": "4.0", "Content": "First a disclaimer: I purchased this for my 81-year-old mother-in-law so I don't use it on a regular basis. However, that being said, I've used it more than she has.Compared to my Sony Coolpix camera it's very nice and easy to use with the docking station. It has Sepia settings, black & white settings, which turn out nicely.The biggest problem with most cameras today is that it's so difficult to decipher the symbols they use to tell you what they do! This camera is pretty well thought out in that respect. The pictures that I've seen taken with it have come out nice and crisp.The only downside is the software that comes with it is not user-friendly. The docking station (separate) is awesome and is a great way to charge the camera's batteries and upload them to the camera at the same time. I hate the USB transfer and the docking station was easy to set up and use.", "Date": "October 1, 2007"}, {"Title": "Kodak EasyShare C743 7.1MP Digital Camera", "Author": "Interior Concepts \"OPERATIONS\"", "ReviewID": "R27OW6U80SQKBV", "Overall": "5.0", "Content": "A GREAT CAMERA THAT I WOULD BUY MORE OF IF THEY WERE AVAILABLE. ECONOMICAL CAMERA WITH THE FEATURES OF CAMERAS COSTING 5 TIME THE PRICE.", "Date": "July 30, 2007"}, {"Title": "it is what it is", "Author": "Jon Nelson \"The Collector\"", "ReviewID": "R2S5X0L3F0G9W", "Overall": "5.0", "Content": "This is a good camera. It has everything that anyone would need for common picture taking.", "Date": "July 26, 2007"}, {"Title": "Eats Batteries!!", "Author": "S. Jones \"Keafa\"", "ReviewID": "R1CFHH4L8R5WQH", "Overall": "2.0", "Content": "I have had my C743 for over a year now.  Over all I have been happy with the ease of use and basic picture quality.  The one major drawback is how many batteries this thing will burn through.  I have tried several brands of rechargeables and standard batteries.  At first I would get 25+ pictures before the camera would shutoff, now over a year later I get 1-2 pictures before it shuts itself off.  For the amount of stress and extra cost for batteries I strongly suggest a different camera.", "Date": "June 22, 2008"}, {"Title": "Disappointed", "Author": "R. Smith \"Fairychild\"", "ReviewID": "RDR2M25Q8A6YS", "Overall": "2.0", "Content": "This was a great camera while it was working, and I have always trusted the Kodak brand.  Sadly, my camera just stopped after 9 months.  Yes, I tried new batteries, but that was not the answer.  I talked to a few other people about the same model, and they also had this problem. I will never buy an Easyshare again.", "Date": "March 16, 2008"}, {"Title": "Nice", "Author": "J. Burgess \"allboutboatin\"", "ReviewID": "R9JQCYXP8U7UM", "Overall": "3.0", "Content": "Its pretty good. The only thing that it will eat thru the batteries so make sure you get some rechargables made for digital cameras. They work the best. The 3x zoom is cool and when you take a pic you can zoom up to 8x however there are products out there for the same price with a 12x(panasonic) Kodak is a good product though with easy software to use. Real simple to share photos and set up albums. I would recommend it and I've looked and looked before I bought", "Date": "September 14, 2007"}, {"Title": "great camera with one teeny tiny con", "Author": "Casual buyer Alex", "ReviewID": "R1P8PL36ZGZI23", "Overall": "4.0", "Content": "It cannot be used as a big-volume flash drive. When I was trying to read its internal SD/MMC card on my computer, it only shows the picture files in its own photo folder. And you cannot paste files to the SD/MMC card through it--I do have a card reader but it is still a disadvantage. As to other aspects such as shooting speed, picture quality, I am highly satisfied.", "Date": "December 13, 2006"}, {"Title": "New to the Digital Camera", "Author": "Yvette Kelly", "ReviewID": "R1R94GMO9CISZZ", "Overall": "5.0", "Content": "I was so happy and scared at the same time.  I had never used a digital camera before in my life. Guess what?  It was so easy!!I give Kodak all the koodles.", "Date": "March 8, 2007"}, {"Title": "Garbage", "Author": "Patryska", "ReviewID": "R3FK0UEVKR5DO", "Overall": "1.0", "Content": "I loved my old Kodak, so I thought that this would be a good replacement.  WRONG!  It drained batteries from the word go.  It doesn't matter what kind of battery I use either.  If I leave a battery in overnight, it is dead by morning.  I shouldn't have to remove the battery after every use.  And part of the reason I chose this model was because it takes video, but if I take a  2 minute video with a new battery, it drains the battery to the point that I can't take another picture.  I am sending it in to be repaired, but the service tech from India said that if there is \"any evidence of damage\" my warranty is void.  I told him that the battery cover is cracked from constantly opening and closing it, but that the camera has never been dropped and lives in a camera case.  When I asked if I should be concerned that they might void the warranty because of the cracked battery door he only repeated the threat about damage evidence.  Now I'm paranoid that they won't uphold the warranty.", "Date": "November 1, 2007"}, {"Title": "Blurry Pictures, bad battery management", "Author": "Patel \"Patel\"", "ReviewID": "R272CN54EMQPQT", "Overall": "1.0", "Content": "This is probably the worst camera I have had or seen. The picture quality is horrible, most of picture I shot would have the blurriness indicator (red palm); it wasnt just the picture would be blur, but i would be all dark. I can understand a camera might drain pretty fast, but this camera take too long to power up even when battery is fully charged(I would have to open the battery cover and push the battery in to get the camera to power up).", "Date": "July 24, 2007"}, {"Title": "See below", "Author": "Karen Reed", "ReviewID": "R6GY4EC7MTN9H", "Overall": "5.0", "Content": "I had this camera for years until the latch that holds the batteries in snapped off.  It is my favorite camera and is easier for me to use because of the view finder and other features that it has.  Now I would like to see if anyone has the ink cartridges for the Kodak Easy Share C743 Printer Dock.", "Date": "August 30, 2013"}, {"Title": "Lost Camera", "Author": "jack meyer", "ReviewID": "R13CX079E9SLXB", "Overall": "5.0", "Content": "My wife lost her camera while on vacation and this allowed her to replace it with the same type that is compatable with her printer", "Date": "June 18, 2013"}, {"Title": "Kodak Easyshare Camera", "Author": "Lynn Andrew", "ReviewID": "R18GDK3F6KRCE7", "Overall": "4.0", "Content": "Takes good pictures, but that's all.  Can't review pics on the camera and other uses don't work.  Drains batteries after taking six pictures in a row.  Cannot proceed to take pictures and camera won't close.  Have to change batteries in order to close the lense.", "Date": "June 11, 2013"}, {"Title": "DID NOT WORK", "Author": "jackson", "ReviewID": "R19XYX3XCAXYVH", "Overall": "1.0", "Content": "I waited to do the review on this camera until I was able to use it. I took it on a cruise 4/7/2013 and it did not work. The camera would not even come on. I tried this camera out when I received it and got on good shoot. But the batteries wear down after each shoot. Needles to say I couldn't use it on my trip and paid or an instant camera in order to have pictures of my trip. I believe the seller said good condition, and that was not true.", "Date": "April 15, 2013"}, {"Title": "pictures", "Author": "catherine flores", "ReviewID": "R14PR261AVP1WP", "Overall": "5.0", "Content": "It works find. Use it when we travel. The pictures come out great. The pictures come out clear with great color", "Date": "February 3, 2013"}, {"Title": "replacement", "Author": "Angela Mabe", "ReviewID": "R24YLJJ0V6422S", "Overall": "5.0", "Content": "this is a replacement for one I dropped. easy to use and upload pics good quality and dependable. would reccommend", "Date": "January 13, 2013"}, {"Title": "Best Digital I've found", "Author": "T. Wieser \"sandy toes\"", "ReviewID": "R1OVXGIWOAZI3J", "Overall": "5.0", "Content": "I bought the 743 and the printer dock as a bundle, both were reconditioned when I got them.  I absolutely love my camera, I've had it for 6 years and use it in my appraisal business every day.  It came with the rechargable battery pack and charges on my printer dock so it's always ready to go.  I did have to replace the battery pack once but it was worth it to me because I never have to mess with batteries.  I just ordered a replacement camera because I dropped mine on concrete and fried the display screen. As for the printer dock, it's mostly just a charging station for my camera.  I used it a lot at first to print pictures but the refills are hard to get and expensive, it's just cheaper and faster to go to wallgreens and print the pics I want. Overall just a great camera for the money but get the printer dock & battery pack so you don't have to mess with batteries!Kodak Easyshare C743 7.1 MP Digital Camera with 3xOptical Zoom", "Date": "November 7, 2012"}, {"Title": "Very satisified", "Author": "Craig", "ReviewID": "R6XTT4166KWPS", "Overall": "4.0", "Content": "I've had this camera for a number of years and like it quite a bit.  The camera uses two AA batteries and I use rechargeable NiMH batteries and always carry an extra set.  Battery life is excellent and I love cameras that use AA batteries since they are so easy to keep charged and give you unlimited shooting time.  I do find some batteries stop working and I attribute this to older batteries which I just trade out.  Once replaced, the camera works fine.  I separate these batteries to use in other devices.  If you shoot photos outdoors at dusk or on a cloudy day (or in shadows), turn off the automatic flash and you will get better photos.  The flash will actually darken your photos under these conditions. The overall photo quality is pretty good.  I believe this is a good, reliable camera for general use and to take on vacation.", "Date": "July 29, 2011"}, {"Title": "Digital Camera", "Author": "TheB's", "ReviewID": "R1HCRQZST0ERH3", "Overall": "5.0", "Content": "Oh my gosh, I LOVE this camera. I would have given it 5 stars for battery life, but I use re-chargeable batteries and my Mom says that is why they don't last as long. I bought this camera for myself, my Mother and my Mother In Law. My mother figured it out VERY quickly. It is SUPER easy to use. I love that it has a video feature. The megapixel count is high enough that the picture quality is awesome. It has a feature to let you know if the picture is in focus. It has a feature for close up, night shots, action shots, flash, no flash, red eye reduction, timer, place for a trip pod. I never really make any super long video but I think it will make video as long as your card has space. No need for a video camera. It works FABULOUSLY with the Kodak Easy Share Software which is great for editing and for emailing pictures to the dinosaurs who aren't on facebook. I bought this YEARS ago and it is still working fine. I keep it in a VERY padded camera bag, but other than that it's had the occasion drop. LOVE IT! LOVE IT! LOVE IT! Easy and quality. Great everyday camera!", "Date": "December 7, 2010"}, {"Title": "Disappointed", "Author": "sixjack", "ReviewID": "R1JWSTM1E4LMNM", "Overall": "1.0", "Content": "I had been using a CoolPix 880 and wanted a smaller lighter unit for family pics as well as using at car shows. The c743 looked like the right unit and with Kodak making it I thought that it would do great. What a disappointment! The camera eats batteries even when shut off and in storage. I tried the lith units with only slightly longer life. I bought a pair or rechargeable batteries with the charger and the camera would not recognize them.Also, the camera takes so long to figure out the exposure and focusing that when taking pictures of children, they are looking the other way or out of the picture by decision time.Thanks for listening", "Date": "December 5, 2010"}, {"Title": "Okay camera, poor quality", "Author": "Randall Sepulvado", "ReviewID": "R9V5ZS4C80Z1Z", "Overall": "2.0", "Content": "Camera stopped working after about 9 months with average picture taking. Printer works great,just uses up printer cartridge quick.", "Date": "August 21, 2010"}, {"Title": "Don't waste your money on Kodak", "Author": "David C Hendrickson", "ReviewID": "R3QHB1TPIRXIHP", "Overall": "2.0", "Content": "I have had this camera for several years.  It started out just fine, but then for no reason it wouldn't turn on.  Like others have mentioned, it's hit or miss with turning on.  Changing batteries won't help.  Even though the warranty is for a year, if you're going to spend $200 you want a cameral to last for many years.  I tried updating the firmware to the latest but even that didn't fix the problem.  One other annoying feature is that there is no way to turn off the preview.  Sometimes you want to take several pictures very quickly in succession and I haven't found a way to do it with this camera.One thing in its favor is that it does have a view finder.  In bright lights you can't see the image on the back screen so it is nice to be able to look through a viewfinder.  I have no problems with the quality of the picture that others seem to indicate.  Makes me wonder if the lense somehow got smudged with a fingerprint on their cameras.One other thing.  My wife has the Kodak C713 and it has the same issue of being hit or miss with being able to turn on.  With this problem problem occuring on two Kodak models in this family I think I'm done with Kodak.  I have a hard time tossing away a $200 camera.  The C713 model does not have a view finder either.", "Date": "December 12, 2009"}, {"Title": "happy with purchase", "Author": "Scott Collom", "ReviewID": "R2FRQBWTV6OMQS", "Overall": "5.0", "Content": "Great camera for the moneyI received my camera within a few days of purchase.Everything went good", "Date": "June 29, 2009"}, {"Title": "ok", "Author": "S. Oliver", "ReviewID": "RVG7O27CWMCZJ", "Overall": "3.0", "Content": "I've had this camera for a couple years now. I'm looking for a new camera because it recently just broke. It turns on once with new lithium batteries but then dies immediately. It was great when I first bought it because its inexpensive and it takes great picture outdoors during the daytime. However, when you use the camera indoors or at night the picture come out dark and fuzzy. Theres a night time setting but you need to be super still. Also, it eats up regular batteries. You need to buy lithium batteries for the camera.", "Date": "April 17, 2009"}, {"Title": "Good product", "Author": "David P. \"ROUSHAC\"", "ReviewID": "R1NPLQPP2BNYMD", "Overall": "4.0", "Content": "Good entry level camera. Easy to use. Takes decent pics and videos, but not great.", "Date": "December 24, 2008"}, {"Title": "broke before I even used it!", "Author": "ekk", "ReviewID": "R3HBWHPQ6BD3B5", "Overall": "1.0", "Content": "This is the second kodak 743 I had. The first one just stopped working for no reason. It was past the 1 year warranty,so nothing I could do. I loved the camera and wanted another,but when I received it and put the battery in,the screen was cracked. I guess I'll try another model", "Date": "October 23, 2008"}, {"Title": "I Like my Kodak C743 Camera so Far", "Author": "Curtis R. Seyler", "ReviewID": "R3NK1QCNMKVQOE", "Overall": "5.0", "Content": "I bought this camera as a replacement for my KodakCx7530 for about the same money it would have cost me to have the 7530 repaired. I was very happy with the 7530 until it started to put pink overtones on all PICS.My new C743 is even better than the 7530. I love it.I have not taken any Sepia or Black and whites yet so have no comment on them.My only complaint so far is that I was told by Kodak that I could use my existing camera dock with the C743 camera by simply buying a Kodak D-22 Adapter. I can't find any tho I have tried everywhere even pre ordering a used one on your site.", "Date": "October 9, 2008"}, {"Title": "kodak c743 digital camere", "Author": "dog mom of 7", "ReviewID": "R3J9L9D3H6MDDO", "Overall": "5.0", "Content": "I previously owned this camera and I broke it on my wedding night!(totally my neglegence) I loved this camera because it took great pictures and they were so clear when viewing on my computer as well as when printed.  I was so diappointed that it was a older model and not carried in stores because I needed one immediatley to take a picture to create my thank you card. I was desperate so I decided to by a canon.  To my dissapointment, the pictures were not as clear.  So, I searched the internet and happily found it avaible on Amazon.com.  I was able to soon get started on my thank you cards because my new camera arrived within 3 days! Not only is this a great camera, it's aslo very easy to use!", "Date": "September 25, 2008"}, {"Title": "Look befor you buy!", "Author": "orbie \"orbom\"", "ReviewID": "RVH8BKU985L35", "Overall": "5.0", "Content": "Well i have been checking out the reviews on this package deal that i got on the kodak c743 and printer g600! wow i feel pretty good about it now.  All i paid was $112.00 at shopko! from the prices i have seen i think i got a heck of a deal!", "Date": "September 4, 2008"}, {"Title": "Pretty nice camera...", "Author": "Paige Turner", "ReviewID": "R1DYE734KDG5Y5", "Overall": "3.0", "Content": "This camera works fairly well, and I've been able to take some really nice photos with it. The biggest problem I've had with it is that it takes batteries (instead of having a rechargeable battery...), and it doesn't take very good close-ups.", "Date": "July 12, 2008"}, {"Title": "Great product", "Author": "Greg \"smitz0327\"", "ReviewID": "R3S6K5EH1I7JP2", "Overall": "5.0", "Content": "What can I say about this besides it is great. The camera takes great photos and the printer works great printing high quality photos. I love this item and highly recommend it. Just can't understand why it didn't take off better than it did", "Date": "April 6, 2008"}, {"Title": "Features to price ratio good; LCD high mortality", "Author": "D. Harris", "ReviewID": "R2MWRAUI6JEN36", "Overall": "2.0", "Content": "Low price for decent little pix. Red eye doesn't correct. This is my second of these in 3 years.  I am a point and shoot grandmother.  Met my needs except the LCDs are fragile and both cracked or died within 16 months.  No more Kodak for me.  I am graduating to a Canon ELPH or whatever is new in '08.", "Date": "March 16, 2008"}, {"Title": "I was disappointed...", "Author": "Ellen from N.C.", "ReviewID": "R5PL4RLMNC4GD", "Overall": "2.0", "Content": "I had a great Kodak Easyshare camera that drowned in an unfortunate water bottle leaking incident, and I replaced it with this. I have been pretty disappointed in the quality of indoor pictures. My last Kodak camera had a much stronger flash for the same price. They were almost the same model, but this one had a couple more MP. My indoor pictures stink because this camera has such a weak flash. My sister-in-law's tiny Canon takes much better indoor pictures than this does. I would keep looking...", "Date": "January 20, 2008"}, {"Title": "GREAT", "Author": "Mary Elswick", "ReviewID": "RLBIRZHODQRYS", "Overall": "4.0", "Content": "Gift for my Granddaughter, great little point and shoot. as others have said, not the best flash for dark pics, but good camera for the price.", "Date": "January 14, 2008"}, {"Title": "Wow", "Author": "J. K. Brown", "ReviewID": "R3Q421W4PYGXUX", "Overall": "5.0", "Content": "The ease of taking a picture and then printing it on Kodak paper thrills me to death.  Set up is easy, software is user friendly.  Rechargeable batteries were not included in this bundle just the double A's.  I do recommend purchasing the rechargeable batteries.  We went through Double A Batteries like there was no tomorrow.  The different settings on the camera make it simple to take a photo in any circumstance.  Big bang for the money!", "Date": "January 10, 2008"}, {"Title": "Mixed feelings", "Author": "Dana Seilhan", "ReviewID": "R3536QW5KT6TPT", "Overall": "4.0", "Content": "This is the second Kodak digital point-and-shoot I've owned.  The first one merits its own review but I wound up with a broken battery door I had to tape shut.  With this one I was given a refurb for Mother's Day earlier this year.  It seemed to be fine until my daughter touched the lens with greasy fingers (she was two at the time) and I had to clean it.  Not thinking, I touched the tip of the lens cleaner to the lens.  This is OK in a manual SLR;  it is not OK in an electronic device.  Now the iris that covers the lens when the camera is off does not work right.  On top of that, several months into my ownership of this thing, it makes weird noises sometimes when I am trying to focus on something.  Also, every now and again it seizes up and I have to take the batteries out of it and put them back in to get it to behave correctly again.  (That was a problem before the lens cleaner incident.)  I'm sure some of this is that the camera is a refurb, but between sales staff I spoke with at my local Target and some of the reviewers I've read here and my own experiences, it strikes me that Kodak is making cameras a lot more flimsy than it used to.  Meanwhile my old Canon AT-1 is still working and still taking nice photos at over twenty years of age.  Isn't that sad?  I want to like Kodak's cameras.  I still own an old film point-and-shoot Cameo that I've carried around in my purse and bumped and bruised and it's still in pristine condition.  But if they're making them to break now, to force people to upgrade, that is not cool.  I don't have a bunch of extra money lying around to replace these things every six months.  Sorry.  Guess I'll go with Canon or Nikon next time.I'm rating this thing four stars because the lens cleaner incident was my fault and because the camera still takes gorgeous pictures.  But really, Kodak needs to make cameras for the real world, not just for people who will handle these things with kid gloves and store them in museum conditions at home.", "Date": "December 6, 2007"}, {"Title": "Best point and shoot for the money", "Author": "Joe Pillera", "ReviewID": "R150I2CKJZW3AR", "Overall": "5.0", "Content": "My only complaint: the built-in flashes on these cameras have limited range.  If you're shooting in a dark room and the subject is 30 feet away, it's time to upgrade to a digital SLR.  Otherwise - this is a great camera.", "Date": "February 12, 2007"}, {"Title": "Unhappy with a usually good brand.", "Author": "Kalista \"photography student in the rough\"", "ReviewID": "R14Y743NVPB0CF", "Overall": "1.0", "Content": "I've had a Kodak before and was very happy with it however this one was very disappointing.  My husband and I wanted a nice little camera that fit in our pockets so we didn't have to lug around our larger cameras.  This one felt like a toy coming out of the box.  Second it sucked the life out of the batteries, now granted the batteries that it came with could've been old.  Ok so I replaced them with rechargeable ones I have.  The LCD screen makes the images look terrible, very grainy.  The in camera cropping was fun, up until I wanted to review the images and I got this lovely message saying the file format was invalid or something.  I had formatted my SD before even using the camera, so I thought maybe it was the first set of batteries that made it do that.  That's when I replaced the batteries and then reformatted the memory (yes twice with the formatting).  I took a few more shots and played with the in camera cropping and it happened again, couldn't view the image because the camera said it was an invalid format or what have you.  I couldn't delete the \"bad\" image, couldn't go forward or back to view the rest of the shots and I couldn't turn it off.  I had to remove the batteries. We returned it and got a better camera for about 10 dollars less.  It's not the SD memory because I'm using it in the other camera we just got and it works perfectly.", "Date": "January 2, 2007"}, {"Title": "SO happy!", "Author": "C. Whitney \"CW\"", "ReviewID": "R10YFRN3DGS6D0", "Overall": "5.0", "Content": "I have only have the camera for a couple of days but I am so happy with it. I upgraded from the 3.1 and couldn't ask for a easier camera to use. The picture is very clear and there is a setting for any lighting! I have also used the camera several times and for long periods of time and the batteries are still going strong. The biggest complaint I had from my old camera was changing my batteries every 7-10 pictures. If you are looking for a camera that is easy to use, inexpensive and takes great pictures- this is the one!!", "Date": "December 27, 2006"}, {"Title": "Good hardware, evil software", "Author": "R. Johnson", "ReviewID": "R3DV1D1KFW65FJ", "Overall": "2.0", "Content": "I like the camera.  I like the printer.  The software will not permit you to copy pictures from the camera to your computer, or to print pictures, unless you are an administrator user in Windows XP.  Kodak technical support says there is no way around that.  It is simply insane to require users to be system administrators just to print -- it violates the most fundamental anti-virus principles.", "Date": "January 29, 2007"}, {"Title": "Dead Kodak 743!", "Author": "Digital Randall \"Fuseblew\"", "ReviewID": "R22IEWY6LFJMM8", "Overall": "2.0", "Content": "I bought a 743 for the wife for Christmas. I had a 6330 that I was very happy with. So a 743 should be better Right? Every time that she went to use it the batteries were dead. We finally figured out that a new set would go dead in two days without ever turning it on! After several e mails they told me to call service. I got someone in India that could not understand me and I had a really hard time figuring out what he was saying. They made it very dificult to get it sent in. I sent it in today, but I do not expect much from the example that their service has done so far. I hope it comes back at least.", "Date": "February 12, 2007"}, {"Title": "Good for the price", "Author": "Danes Ordelus", "ReviewID": "R2BDE6716YQAAL", "Overall": "3.0", "Content": "I have to say that this camera deliver what I expected, especially for the price. It takes good pictures, the qualities are good. Can't complain about a thing. After all, you get what you pay for.", "Date": "January 18, 2007"}, {"Title": "Will not turn on reliably", "Author": "John M \"jbakpak\"", "ReviewID": "R1Y6EIVE3ZPVPO", "Overall": "1.0", "Content": "Like some other users, we have found that the camera decides on its own whether to turn on or not. No amount of battery changing, cleaning, will get it to turn on every time. If it does turn on, we tried turning it off and right back on- won;t turn on again. But, if someone just keep turning it on and off, it will eventuallyt turn on once in awhile.Absolutely unreliable.", "Date": "October 28, 2007"}, {"Title": "Lorraine", "Author": "L. Hafleigh", "ReviewID": "R2STX88PTUB2R6", "Overall": "5.0", "Content": "This product is great.  Compact, easy to use, takes & prints wonderful color pictures.  The software for enhancing your pictures is easy to understand and operate.  I am experiencing a problem with the printer cartridge running out before I use up all the photo paper.  It has to be purchased in a kit.  I am questioning Kodak about this problem at this time.", "Date": "June 26, 2007"}, {"Title": "Disappointed", "Author": "Cheryl Lewis \"maggybrn\"", "ReviewID": "R20EOMRVIK3CQJ", "Overall": "1.0", "Content": "Huge problems with the LCD screen, two cameras within one month after purchase showed the LCD \"shattered.\" One has already been shipped for service and the other one will be going in tomorrow.  Sure it is easy to use and produces great pictures, but the LCD problem is a definite negative.", "Date": "April 27, 2007"}, {"Title": "what happened....", "Author": "superdoc", "ReviewID": "R2JG9ELRUR22FX", "Overall": "2.0", "Content": "wow. we've had a few other kodak cameras, and i had hoped this would be a nice upgrade.  it is the worst camera i've ever had.  the christmas photos today were out of focus, grainy, and had weird vertical lines all through them.  the video was ok, but still not as good as the ls753 that i am going to revert to.  sending this one back asap.", "Date": "December 25, 2006"}, {"Title": "WOW!", "Author": "R. Lyon \"retiredNavy\"", "ReviewID": "R3BIK189YZ6V3I", "Overall": "5.0", "Content": "Super easy to use.  Great pictures.  Way more features than I'll ever need.  Great price!", "Date": "December 28, 2006"}, {"Title": "Died after a week!", "Author": "J. Monestere", "ReviewID": "R3QXKDEX9LX46O", "Overall": "1.0", "Content": "I just got this camera a week ago and thought it was great.  But today I tried to turn it on and it's completely dead!  I even changed out the batteries and it's still completely dead.  This is the first digital camera I've had and I bought it because I'm going to Europe (two days after it died).  Now I have to scramble to get a replacement before I take off.Grrrrr!!!", "Date": "March 22, 2007"}, {"Title": "great camera", "Author": "David P. Michaud", "ReviewID": "R2IXK3UBT77XD6", "Overall": "5.0", "Content": "The C743 gives very good quality pictures and is very easy to use. Had a problem with G600 printer jaming but sent it back for a new one which works great", "Date": "January 15, 2007"}, {"Title": "Picture it and print it.", "Author": "Disabled Smurf \"Chato\"", "ReviewID": "REB060T3MEEF4", "Overall": "5.0", "Content": "I just got this camera recently along with the printer. Setting up was very simple. The only problem I came across was putting the ribbon in the printer. You have to use your finger to remove the slack from the ribbon but it's not that easy. When you put the ribbon in the printer it gets caught on something and could damage the ribbon. It takes time and tons of patients to get that ribbon in the printer. The pictures come out very nice and print even better. I washed a couple of pictures to test the quality and they came out flawless. This camera is a value and shouldn't be passed up. The screen on the camera is huge and the buttons take some time to get use too. If you have any further questions feel free to comment them and I'll reply as possible.", "Date": "February 12, 2007"}, {"Title": "Camera we had was unrelible", "Author": "Amazon Customer", "ReviewID": "R2P3V4JB54BR17", "Overall": "2.0", "Content": "Returned this camera after two weeks would not work for my husband one day. Then worked next time we tried it. A few days later it would not work again. Tried new batteries & still did not work.", "Date": "December 15, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000H93FX8"}}