{"Reviews": [{"Title": "Not WHITE, but IVORY very nice SL-6151-C", "Author": "Teena Phillips \"GETTIN'  IT DONE\"", "ReviewID": "R3OUF2KPJA2PD5", "Overall": "5.0", "Content": "The other bells in the store ARE white, but this Ivory exactly matches Krylon Fusion in IVORY (and my house trim).  Hey, details count.Think about being around your place, backyard, shed, garage, apartment, guest cottage, pool, etc.  How are you ever going to know someones at the front door?This is the answer.  Plug in the chime in all those places and no matter which bell is pressed - you hear it.  True, you don't know which of the 6 places there are at - but your alerted.I enclosed a breezeway with 6 storm doors, and sometimes I want to lock the street side.  With a bell there, I still know when someone has arrived.This comes with an A-23 12 volt alkaline battery which says it will last 2 years.The transmission range is 75 feet through doors, walls, floors, windows, storm door(They do make a two C cell model that reaches 100 feet.)123 selectable codes, but if your leave it all to the factory setting then any bell will ring ALL chimes.  If you just want front door and rear door, the chime lets you choose a simple 1 note or 2 note chime (one for front-two for rear?).They have EXCELLENT Customer Support 1-800-858-8501 is you still have questions.Oh, those A-23 batteries.  Bought mine in a package of two at Target $4.24So 6 chimes will cost you $6 a year.  I would sure prefer AA or AAA as I have a solar charger XTG-SLRBC (on Amazon of course) which is the size of my iphone and 2 Delkin rubber cases (so it doesn't shatter when dropped) also Iphone size, that hold 8AAA or 8AA's.  The charger will do these 1000 times.  All that was $63. for solar charger, 2 cases, Amazon brand 8AA's, 6AAA's, delivered. NICE  Does Iphone, Ipod, USB too.The solar idea is if you drive off a cliff, you can still get re-charged and help.  NO WAIT, these last TWICE AS LONG, make that savings $1000.", "Date": "September 17, 2011"}, {"Title": "Exactly what I wanted! Perfect", "Author": "Thomas C. Warner", "ReviewID": "R2LKYCXTAZHIOH", "Overall": "5.0", "Content": "I already had this same product that I had purchased a few years ago.  Other than a slight difference in the appearance of the item, it is identical.  This new unit and my older one work just great.  The reason I got the 2nd one was to have an additional chime in a part of the house that is more remote, and it was difficult to hear when the chime sounded. My older door button conveniently signals and rings both my original and this newer unit.Now I'm all set with TWO chimes and life is good!", "Date": "January 12, 2014"}, {"Title": "Works", "Author": "Steve Vance", "ReviewID": "R2S473QN33Q52", "Overall": "5.0", "Content": "I needed an extra doorbell receiver for the stylized barrel transceiver button plugs that Heath sells seperately. This was exactly as I needed. While I'd like if they'd sell just the bell by itself, having the extra door button around isn't that bad.Not much else to say, opened up the back hatch, set the jumpers to their right pins and worked as advertised.", "Date": "December 22, 2013"}, {"Title": "Only works when the door is already open", "Author": "Richard T. Meyer", "ReviewID": "RJQDV21KZ4RD3", "Overall": "1.0", "Content": "I bought one of these a few weeks ago and installed it in my NYC apartment.  The pushbutton only triggers the chime when the door is open!  Apparently. the transmitter won't penetrate the metal door.  A doorbell which only chimes when the door is already open isn't much use...", "Date": "July 31, 2013"}, {"Title": "JUNK died just after the 90 day warranty GRRRRRRRRRRRRRR", "Author": "Tundra Gregg \"TG\"", "ReviewID": "R3G2VYKTROFTEB", "Overall": "1.0", "Content": "After our wired door bell died after 11 years we got this one as an easy and inexpensive replacement. This one worked for the warranty period. We contacted the customer support area and they walked us through a work around and it worked for a couple of days and then started ringing randomly. I am going to get a wired one that is made in the USA not China like this junk.", "Date": "July 14, 2013"}, {"Title": "Good Product", "Author": "Jerico1", "ReviewID": "R1YOAKALQYQRA4", "Overall": "5.0", "Content": "This unit was purchased to replace a similar older unit that quit. The product was reasonably priced,  they shipped it quickly,  and it works great as expected.", "Date": "December 25, 2012"}, {"Title": "Bought 2, one died after about a year and a half", "Author": "Cary Diehl \"Ochen\"", "ReviewID": "RW3CR44K1LTGH", "Overall": "2.0", "Content": "I bought 2 of these units, thought it would be cool to have one upstairs and one in the basement since when I am down there it is hard to hear the door bell. Anyways, the units have a scratchy sound at best and if someone hits the doorbell quickly, like kids often do, it messes up the signal. Sometime if you hit it twice really quickly it will cancel the signal. My biggest complaint though is that one of the units completely died after about 1.5 years of use.", "Date": "April 6, 2012"}, {"Title": "It is actually ZERO stars as it was never received.", "Author": "Jeff Dowd \"Samba Lover\"", "ReviewID": "R2YNQFQCUMYEG3", "Overall": "1.0", "Content": "Never received item.  Searched all over Amazon and there does not appear to be an icon or anything else to click on to register complaint for third party purchases.  Will never again purchase from one of Amazons \"partners\".  I'm guessing Amazon makes it hard to dig through their clutter to find customer \"service\" and people will give up on low dollar items.  Amazon wants their cut but does not assist with any complaints.  If they say it was delivered you do not have any way of disputing.  Of course you are billed promptly.", "Date": "June 24, 2010"}], "ProductInfo": {"Price": "$18.95", "Features": "Wireless plug-in doorbell chime kit\nWhite molded cover\nUp to 75 feet transmission range\n2-note melody\n1 year warranty The Heath Zenith SL-6151 wireless door chime features a 2-note melody for the front entrance. The wireless door chime kit includes a plug-in receiver and one battery operated push button (push button battery included) with up to 75 feet transmission range between the chime receiver and push button.", "Name": "Heath/Zenith WIRELESS DOOR CHIME Home Security", "ImgURL": "http://ecx.images-amazon.com/images/I/41rSDw8xV3L._SX300_.jpg", "ProductID": "B000I1AST4"}}