{"Reviews": [{"Title": "Moderate", "Author": "Jane Doe", "ReviewID": "RVOZRDQZHOHXE", "Overall": "3.0", "Content": "The connector to the TV is one I have never seen before and it requires a power adapter that is NOT included.  You need $70 worth accessories - BNC to RCA adapters and an RF adapter and a 25 foot coax cable and a coax to rca cable and lots of other stuff.  Cameras at other stores cost only $70 and come with a free 100-foot cable as well as an RCA connector - a pretty common one that plugs straight into your TV.", "Date": "December 29, 2007"}, {"Title": "Good product", "Author": "Steve G", "ReviewID": "R1HYX3KTZNCZ9Y", "Overall": "4.0", "Content": "For the price, this camera is a good deal. It is very well made and the mount is very versatile. The daytime color is a bit washed out and bright backlight is a slight problem. The night (infrared) vision works well and I have caught a visiting wild fox on video tape with it on several occaisions. Overall, for the price, I'd say it's well worth it.", "Date": "September 9, 2007"}, {"Title": "Bought as wide angle.", "Author": "jkalogero", "ReviewID": "R1TOCJQDI73451", "Overall": "3.0", "Content": "These are good cameras if you need faces from 10 -15 feet,bodies up to 40.I expected more from the larger lens. A good quality camera,and they are small.", "Date": "December 30, 2007"}, {"Title": "Great camera when it worked", "Author": "James M Lam", "ReviewID": "R24WJAEU8L6HUN", "Overall": "4.0", "Content": "I put this camera in the attic gable above the garage. It worked great for about a year and a half. Great color and good night vision. I could see everything in my cul-de-sac. The camera finally went out. The heat in the attic may have caused it to go out. I don't know. It was around 119 degrees in the attic many days during the summer. But it was a great camera while it worked. I have used many cameras over the years and this was one of the best budget camera's I owned.", "Date": "February 5, 2013"}, {"Title": "Value for money", "Author": "De_Hunter", "ReviewID": "RRKAIBC5AY63", "Overall": "3.0", "Content": "I have at least three of these cameras.  The quality is not bad both day and night.  My main issues is to be able to see the persons face and clarity of theimage.  What I found was that I have had to replace them after about a year.  I am not sure why, but three of them on different occasion no longer have the night vision.  the IR lights no longer work.  Maybe they are not waterproof as they claim!!!", "Date": "January 4, 2013"}, {"Title": "this camera sucks", "Author": "A. J. Flores", "ReviewID": "R3EW5VREQNPPQI", "Overall": "1.0", "Content": "If I were you I would not buy this camera from the people I bough it from, they advertise on camera and give another one and if you complain about it they will tell you that you.... never mind it's just not worth it.", "Date": "April 28, 2008"}], "ProductInfo": {"Price": "$305.45", "Features": "Built-in 1/3\" SONY CCD, color DSP image sensor\n26 IR leds for night vision. 0 lux with IR LED\n420 TV lines high resolution\nBuild-in f 3.6mm lens for wide view angle\nPower Supply: 12 V DC 500mA not included", "Name": "VideoSecu Built-in 1/3\" SONY CCD IR Night Vision Outdoor Home Security Camera 3.6mm Wide Angle Lens 26 Infrared Leds for CCTV DVR Surveillance System 1MZ", "ImgURL": "http://ecx.images-amazon.com/images/I/41z4o5FswqL._SY300_.jpg", "ProductID": "B000TGHBLG"}}