{"Reviews": [{"Title": "Love the Lumix lineup!", "Author": "Brian Kerecz", "ReviewID": "R1JZBDADB9G7ZT", "Overall": "5.0", "Content": "I bought this camera last year, and returned it because it did not have a Leica lens, which I wanted. However, after a family member bought a Lumix camera sans Leica lens, I was a convert. For the money, you simply cannot beat it!What makes this camera special for the price is the 6x optical zoom (up to 24X in conjunction with the digital zoom, though that causes degradation), and the Mega-OIS, or more precisely Optical Image Stabilization. This feature adjusts the camera to compensate for imperceptible hand shakes which occur inevitably on every push of the button. I believe that in the future, all cameras will have this function as it is the single most common cause of blurred photos. I have a Panasonic LC80 with a Leica lens, but one of the reasons I went looking for another camera was the blurred photos I got, even though I was as steady as I could be. I cannot overstate the importance of this feature.The burst mode is a very nice aspect of this camera too, one mode allowing sequential shots until the entire card is filled. There is absolutely no excuse not to \"get that shot\" with this camera.Also nice is the ability to use AA batteries instead of proprietary batteries which cost $60 or more.  A power supply which can be easily replenished is a necessity if you plan on being out of touch with civilization for any length of time.If you want a \"Con\" to go with the \"Pros\" it would have to be battery life....battery life is very low and even  moreso in colder weather. But this should come as no surprise as this camera does not use a viewfinder; instead it uses a 2 inch LCD screen to compose pictures. Because of this, battery life will necessarily be much lower than with a camera which uses a viewfinder for composition.Batterly life per manual under normal conditions:Panasonic Oxyride: 250 pictures or 125 minutesAlkaline batteries: 155 pictures or 77 minutesNi-MH batteries: 400 pictures or 200 minutesWhen the temperature is 32F:Panasonic Oxyride: 45 pictures or 22 minutesAlkaline batteries: 35 pictures or 17 minutesNi-MH batteries: 360 pictures or 180 minutesOne other thing I would change is the On/Off switch....it can too easily be hit sideways which would open it in the case. If this happens, it could all too easily damage the motor of the zoom lens.  To obviate this potential danger, simply keep the dial mode at \"play\" when the camera is off, and the lens will not open.And it should be noted that this camera does NOT have a microphone for recording in video mode;  if this is what you want look at the DMC-LZ5.  Because I did not plan on using this feature very often, it did not present an issue for me.For picture taking, this is a 5 star camera. For design, there are a few possible improvements which give it 4 stars.4 1/2 stars overall.", "Date": "May 3, 2006"}, {"Title": "Overall great camera that takes beautiful photos!", "Author": "M. Walton", "ReviewID": "R2GJ9B0XLHF1C4", "Overall": "5.0", "Content": "My previous camera before owning this one was a Canon Elph S230, so my comparisons are with that camera in mind.PROS:-A great price for 5MP and 6x optical zoom-The 6x optical zoom, up to 24x digital zoom is awesome-No time limit on movies, as long as you have memory-Takes beautiful photos (Macro mode work great)-Has some neat settings like fireworks, portrait and scenery that adjust everything automatically for youCONS:-Bigger than the Canon Elph series, can't really stick it in your pocket-AA batteries (a pro for most people, I actually preferred the rechargeable Lithium battery on my Canon that already came with a recharger);-no eye-hole (technical term?), only display to take photos (I got used to this real fast; most people only use the display anyways)-only one movie size, and its not very bigWhat you need to buy along with the camera...-AA rechargeables and recharger-camera case-SD memory card (size depending on how many photos you take at a time)", "Date": "July 20, 2006"}, {"Title": "Very Good Cam", "Author": "Juan F. Cordoba", "ReviewID": "R6XUEFN3CED10", "Overall": "5.0", "Content": "I bought this Camera almost one month ago after selling my old HP 307 camera. Compared to my old camera this one rocks!!! Macro mode is excellent, and it's got 11 scenery modes which work really well.Battery life is very good with the Oxyride batteries and rechargable batteries.The M.O.I.S does it's job.It's got 6x optical zoom when most cameras under $200 have 4x max and if you change the aspect ratio you can get a total of 7.5x optical zoom which is very good to say the least.Would i recommend this camera: Yes, definitelyOnly negative i've seen after having this camera for some months now is that it doesn't record video with audio", "Date": "June 11, 2006"}, {"Title": "Great camera, but a  cautionary note", "Author": "J. Sherman", "ReviewID": "RH18J2UZMG1C8", "Overall": "4.0", "Content": "I've been playing with this camera for about a month.  My previous camera was an Olympus Camedia 720, which I decided to replace because of its frustratingly slow lag time between shots and its expensive CR-V3 batteries (it was a battery hog).The LZ3 is much faster (even has a 3- or 5-shot burst mode). In good light, without the flash, lag time has been barely noticeable.  And it uses less expensive rechargeable AA batteries.Another poster, Brian Kerecz on May 3, 2006, has a good analysis of battery usage.This is my first camera without an eyepiece; it only has an LCD screen.Two problems with the lack of an eyepiece:1) I wear reading glasses.  With an eyepiece, there's no problem focusing on the subject; however, with an LCD screen, you'll need to put on your reading glasses.2)On a bright sunny day out in the open (on a veranda overlooking a field), there was so much glare on the LCD screen that I could barely see the subject.  To work around this, I'm buying a \"Delkin 2.0\" Universal Pop-Up Shade\", and I'll update this post after I've used it.**UPDATE**The pop-up shade helps a little bit, but I really miss having an old-fashion optical viewfinder.The camera itself fits into cargo pants pockets.  The controls and LCD screen menus are easy to follow.  And being able to hold the camera up high, using the 'high angle' feature on the lcd screen, allowed me to get some pretty good photos at crowded family gatherings.**2nd Update, 1/25/07**I'm giving this camera to a family member and looking for one with a viewfinder.  It's become way too inconvenient, especially while skiing or hiking or at parties, to put on my reading glasses every time I want to snap a shot.Also (and this may apply to all digital cameras with a \"movie\" function), I love the movie function, but I couldn't adjust the zoom during the movie shot. This was a problem with I started a shot of my son skiing towards me down a hill, and as he got closer I couldn't pull the shot back, so by the end all that filled the screen was his smile.  Artsy, but not what I wanted.", "Date": "July 26, 2006"}, {"Title": "Good zoom and OIS works well", "Author": "Encrypted", "ReviewID": "R3IC3D23AFYYBK", "Overall": "5.0", "Content": "One major selling poing of this camera is its 6x zoom and OIS (Optical Image Stablization) combo.  The tendency is that higher the zoom, easier it is for your picture to bet blurry.  OIS does a good job preventing this common problem.Also, it is kind of nice that I can use AA batteries.  I already have sets of rechargeable from my old camera, so I didn't need to spend extra for proprietry batteries.", "Date": "June 22, 2006"}, {"Title": "Pound for pound, what else could you ask for?", "Author": "T. Stephen", "ReviewID": "R1QB20SCY36ZAY", "Overall": "5.0", "Content": "I rated this camera at 5 for two reasons:1.) A highly polished product for a steal of a price.2.) It was more than I asked for when I walked into the store.I bought an Olympus D-460 for $450 a long time ago. 1.3 MP & 3x optical zoom. Then I bought this, a 5MP 6x optical zoom *with stabilization* for a quarter of the cost of the other one.I went in looking for a 5MP w/3x optical zoom and removable storage with the expectation of dropping $200. I did...but I also walked out with a 1GB SD card and an in-store repair plan. I've had enough experience with digital cameras to know that some type of plan is a virtual necessity.No, this is not a high end camera, nor does it pretend to be. But if you want something with decent resolution, with a bunch of presets, yet still allows you to customize your own shot, then this is your camera.I've been snapping pictures ever since I got home with it...taking some really difficult shots...the TV...the computer. Stuff in a dark closet. The only thing it couldn't do was take a decent picture of me...then again, a professional photographer with a $3000 camera and photoshop couldn't get a good picture of me. :-)", "Date": "February 18, 2007"}, {"Title": "Great easy to use camera", "Author": "S. Shoop", "ReviewID": "RN0JO0L0BX2TM", "Overall": "5.0", "Content": "I bought this camera for my daughter's 13th birthday. She is into salamanders and has 2 geckos. I have not seen a bad picture come out of this camera! I have several black pets that are usually impossible to photograph. They come out clear, with their eyes open! We have also not seen a single blurry photo due to the image stabilization.It also takes wonderful pictures in low light situations.What a buy for such a great price!!!!", "Date": "August 9, 2006"}, {"Title": "Great Camera!", "Author": "Alicia Johnston", "ReviewID": "RH2RWGLT1ZB3J", "Overall": "5.0", "Content": "I originally bought this camera because of my job, now I use it for almost all of my picture taking. I have a 35mm canon rebel G EOS but I was always running to have film developed. I bought this camera so that I could get my pictures easier (and cheaper).It is a really easy camera to use. Mostly point and shoot, but it does allow you to control many options.We do a lot of horticultural diagnostics at work and are always getting calls to come out and figure out what is wrong with a plant or id an insect, plant etc. In macro mode this camera takes the best pictures of insects and small items. Our diagnostic clinic has been able to id mushrooms and diseases from this camera's pictures (which says a lot for this camera's quality).The size of the camera is awesome. It's small and lightweight and can fit in a purse or pocket. I was able to go out into an extremely muddy horse pasture yesterday to do diagnostic work and I was able to not worry about my camera because it was tucked away safely in my pocket. This is not something I could have done with my 35mm.I also use this camera outside of work. It does really well in low light. I have been able to take pictures in a dark auditorium during a choir concert without the flash on and the pictures come out great. It takes great landscape pictures.The software to download the pictures into the computer is really easy to use. Its set up to automatically download the photos as soon as you plug it into the USB port using the cable that comes with the camera. No special docks required.  The only drawbacks to it are:  1- you really need a SD card to supplement storage. Without it you can only store 4-7 pictures.  2- I also recommend getting rechargeable batteries. These have saved me numerous times because you can tend to go through the batteries pretty fast when you use it as much as I do.  Overall I highly recommend this camera.", "Date": "January 12, 2007"}, {"Title": "My new camera", "Author": "Amanda Deuel", "ReviewID": "R3PIBA9M5W1K3Q", "Overall": "5.0", "Content": "Since I have only had this camera for a month, I'm still learning how we fit together, but I'll review the best I can! There are a few cons that I'd like to point out first.-The flash sometimes works funny. It'll make the picture weird colors if I let it do automatic sometimes. And then I'll take it off completely so that I can get a better picture, and it's too dark, or poorly lit. So I'm reading the manual again to find out if there is a way to fix that, but so far I haven't.-The on/off switch is very easy to slide over so if you aren't very careful when putting the camera in it's case, it will slide to on and waste battery power. I wish that it had a button instead of a switch, but oh well.-Lastly is the batteries. I loved the batteries that it came with. They lasted a whole week of constant picture taking (I was on vacation) and viewing. But I can't find them anywhere. So I have been using duracell and energizer AA's, and they work, but the camera goes into power saver mode all the time and so the screen turns off in the middle of setting up for a picture. It gets annoying. I'm going to try the rechargable ones next since I can't find the kind it came with and hope that it solves this problem. Well, it's not really a problem per say, but an annoyance for sure.Overall, so far I love this camera and the things that it is capabale of doing. One suggestion would be to get a screen protector. Where some camera's have the screen that is sunken in some, this one kind of sticks out. So it will get easily scratched if not looked well after, and then sometimes it will anyways. So a screen cover would be a good investment.", "Date": "August 8, 2006"}, {"Title": "Loved it until it broke", "Author": "Apollo \"Live Free or Die\"", "ReviewID": "R12UIYZNLILST1", "Overall": "2.0", "Content": "It took the absolutely best pictures of any digital camera that I have owned (4)...and then while taking pictures in my garden, it froze and stated that I needed to turn it off/on...I did and it said, replace batteries (which were new that day, honest...I had taken only 10-20 photos before it crapped out)...It turned off with the lens extended and it won't focus.  I called up for the one year warranty...that is a one year PARTS warranty, no labor, so I am sol.Great camera, until it died.  They told me that you have to put the exact same type of batteries in it every time.  I have never done that with any electronic device before.", "Date": "November 6, 2006"}, {"Title": "Great Camera", "Author": "J. Rodriguez \"Homer Jay\"", "ReviewID": "R1IITDLE54MNY", "Overall": "5.0", "Content": "Great camera for a great price, using the easy mode is really a wonderful thing, especially if you lack the time to get your hands on the manual to use the other modes. Battery time is optimum and dowloading the pictures is rather easy even in operating systems such as Linux or FreeBSD.", "Date": "November 10, 2006"}, {"Title": "good deal as of 3/28/07", "Author": null, "ReviewID": "R1HPTSE2F3RT2U", "Overall": "4.0", "Content": "I researched a lot of point and shoots before I bought this camera.  Fujifilm has a model that seems to beat out the Panasonic in reviews, for roughly $240 (after rebate).  I didn't want to wait on a rebate, especially when I found the Panasonic new for approximately $156, with free shipping.  I also preferred the idea of using standard rechargeable AA batteries, compared to a proprietary battery that would be expensive to replace. As of of this writing I recommend that you either spend a little extra money on the popularly reviewed Fujifilm, or else go with this Panasonic.  This is an excellent entry level digital camera in terms of image resolution and battery life, as long as you don't expect miracles under low light conditions.  For approximately $20 more you can also find a small two battery charger, and a 1.0 GB SD card that comes with a portable USB card reader.  With shipping and a pack of rechargeable AA batteries bought locally all of it should come in right aound $190, depending on the retailer that you use.  You don't absolutely need the card reader to transfer photos, but it helps to save the batteries, and also lets you use the SD card as a flash drive for other data.  Windows XP doesn't need any of the included software to fetch the pictures off of the camera, or off of a card reader.  The movie mode is effectively useless because it drains the batteries within seconds, but I didn't buy it for shooting video.  The color LCD display has a relatively low resolution (compared to the Fuji), but it isn't anything that affects the final image quality.  Battery life for outside shots without flash is impressive, and pretty good with flash.  Cycle time between shots is a much better than some of the cheaper competition.  A fitted case would've been nice.  Panasonic makes hard and soft cases for this model but they aren't included.  Not a big deal at this price, but they tend to last longer in a padded case.", "Date": "March 28, 2007"}, {"Title": "Panasonic Lumix LZ3S", "Author": "SeaGail \"SeaGail\"", "ReviewID": "R2IUE7TFHURJ4T", "Overall": "4.0", "Content": "This was my first digital camera, but I have found it to be fairly easy to use (at least in \"Simple\" mode) - haven't investigated all the features that it does have, which seem to be voluminous.  The stabilizer seems to work quite well.  In my first 125 pictures, only about 3 or 4 were at all blurry - while most were crystal clear.  The only negative is true of all digital cameras, I imagine, with just the LCD screen (no viewfinder) - in bright conditions, you just have to guess because you cannot see the picture to preview.  I look forward to investigating the features in the upcoming months.  I would definitely recommend this camera.", "Date": "November 9, 2006"}, {"Title": "Great Price, Great product.", "Author": "CS", "ReviewID": "R2AH50FZ1B27LR", "Overall": "5.0", "Content": "For the price, you get a lot out of this camera. 6X zoom Stabilized,  the images comes out great at full zoom (2 stabilization mode).  The aid of a histogram will tell you the right exposure to set for your picture.  The multiple program modes, just about lets you take a great picture under different situation! Controls are easy to use and get to. In all definitely a great buy for the price.  The down side is that movie mode has no sound but if that is a factor then get the DMC-LZ5 or a camcorder.", "Date": "January 30, 2007"}, {"Title": "Great Camera, Especially for the price", "Author": "Erin M. Strawn \"strawbuddy\"", "ReviewID": "R1KOXKY08T4CU5", "Overall": "4.0", "Content": "This camera is the first digital camera we have actually owned but not the first I've used.  There are alot of features to play around with and that can be overwhelming to some people.I like all the features, I find them fun to see which way to get the best picture; the food setting actually takes great pictures under fluorescent lights :) As for blurry pictures, the image stabilizer works great and we have only gotten blurred pics if someone moved after i hit the shutter button, and i didn't have a setting selected that accounts for that (like high sens).The shipping was great; Amazon gave us an accurate delivery date, it was in December even and I think it was even early if i'm recalling correctly :) I can't really comment on the battery life because we use rechargeable batteries, and they are kinda screwy.The other digital camera we used was a kodak easy share 650 and it cost about double and gets about half the results.  We got more blurry pictures, the resolution was lower, and I could go on and on as to how much I dislike the kodak one, but suffice to say the one we bought is much easier to use and to work with (downloading, settings, etc)This camera is also very durable, we have 3 kids and it has been dropped a few times with out its case, still kicking and didn't miss a beat :) I'm very happy with this camera, and feel i got my money's worth.  The only reason we only gave it 4 stars is because the starry sky feature doesn't quite work right at all w/out a tripod, there is no viewfinder, and there is no date stamp... otherwise very satisfied.As a word of advice, purchase it online, through Amazon, you'll get a much better deal than at a retail location: Target is charging locally about 180 dollars for this camera, and I got it here for 161 dollars and some change, including tax,and a memory card (shipping was free).", "Date": "December 31, 2006"}, {"Title": "Great camera", "Author": "K. Duvall", "ReviewID": "R2U6CD3XXH24XX", "Overall": "5.0", "Content": "This is a wonderful camera.  It's simple to use, has fabulous zoom and a fantastic price.  I'm so pleased with it!", "Date": "February 16, 2007"}, {"Title": "Ugh!  So Disappointed!", "Author": "Erin \"Erin from Central PA\"", "ReviewID": "R2OUB8GBJ9BG3N", "Overall": "1.0", "Content": "After reading the other reviews here, I eagerly purchased this camera (about a week ago).  I've taken more than 200 photos, and I've been so disappointed!  I have had several digital cameras over the last seven years, and I have read the manual for this camera cover-to-cover.  I have experimented with the many modes and settings, and yet three out of every four pictures I have taken are blurry or out of focus.  Even in full sunlight!  And any low-light pictures are totally unusable!  The features seemed great, but the photos are terrible!  My experience has been so different than others have described here.  I will be returning this camera as soon as possible.", "Date": "October 23, 2006"}, {"Title": "Nice camera", "Author": "Cliff Jennings", "ReviewID": "R3IFTJG29MX1EC", "Overall": "4.0", "Content": "I brought this to Kenya for a Safari and for the price was very happy with it. Got some great closeups combining the digital and optical zooms.A few pictures were a bit grainy with the full combined zoom, but that is to  be expected.I just wish there was a viewfinder and not just the LCD window. It was hard to see it in bright sun, plus I need my reading glasses to see it clearly.The size of the camera was small enough to fit in my fanny pack and the ease of using the different functions was also good. I am one of those \"technologically challenged\" people and I had no problems.", "Date": "January 9, 2007"}, {"Title": "Panny DMC-LZ3 is a great entry level camera", "Author": "Francis A. Fuselier", "ReviewID": "R1K0O1PK5TP7VV", "Overall": "5.0", "Content": "This was a Xmas gift for my 10 year old daughter.  She's crazy about it.  It's very simple to use, the 6x zoom is a real treat, and the picture quality is great.  My daughter expecially likes the different display options.  The grid lines, which help her compose each picture, are her favorite (leaning about the \"rule of thirds\").", "Date": "January 9, 2007"}, {"Title": "best point and shoot camera in market", "Author": "David S. Woo", "ReviewID": "R21BZJD1UYFRPV", "Overall": "5.0", "Content": "i had to my a digital camera after my nikon coolpix 5700 was broken without knowing any reasons. i am an art college student, so i needed a cheap and high quality camera. i found this item is really good for point and shoot pictures. features that i like (because i always get successful photo with this camera) are good white balance, image stabilization, 6x zooming lens, macro mode, and 16:9 ratio. only con is that there are no manual setting mode. overall, this is a very good camera.", "Date": "January 8, 2007"}, {"Title": "great camera..bad photo software", "Author": "warren s", "ReviewID": "R3Q5N2K7IANAUI", "Overall": "5.0", "Content": "I purchased the Panasonic LUMIX DMC LZ3 camera this summer for our family use. It's been a very good product and takes great pictures at an affordable price. The one knock I have found is the included software LUMIX Simple viewer is extremely lacking. Aside from printing photos or e-mailing them, you cannot easily find the files on your hard drive. The only way to move around the files is to export them back onto your photo card and then move them to a destination. I have since found another program to manage the files. Get the camera and the cannoli s, leave the software.", "Date": "October 2, 2006"}, {"Title": "I am jealous!", "Author": "Melissa Bishop \"momof4\"", "ReviewID": "RCD90Z9FHKGN1", "Overall": "5.0", "Content": "My daughter got this camera for her 9th birthday and may I just say I am pea green with envy!  It takes the most clear, color rich pictures I have seen!  She is currently taking photography classes and is entered in 4H as well.  It is easy enough for her to use, yet the pictures have the clarity that it makes you wonder if it is not a professional camera.  My parents picked this up a few months back at Office Depot and for 1 day only it was less than $90!  Wish I would have gotten one for myself!", "Date": "June 15, 2007"}, {"Title": "LZ3, AN ALMOST AWSOME LITTLE  CAMERA", "Author": "Marshall \"in Texas\"", "ReviewID": "R3IXHB2OUAAFRO", "Overall": "4.0", "Content": "The Panasonic DMC-LZ3, my first digital camera, is a complete photo lab in small box.  Photos can be cropped, subjects centered, file resized and I don't know what else (keep the operating instructions handy).  Your pictures can be shown immediately on a TV with the video plug-in cable.  It can be hard to get a good view on the screen in glary light; I've wished for the old eye viewer.  I've even just held the camera up and had to guess that what I wanted was on the screen and usually came out OK.BUT;After 9 months of carefull use, and toted in a padded case, in one series of shooting I noticed that the lens cover was not closing when I turned the camera off but the lens would still come out and take pictures when turned back on.  Fiddling with the cover got it to close but then it wouldn't open when turned on and of oourse could take no pictures that way.  It went on to where the lens would not even stay out.  A call for help got me through a check list and reset effort to no avail and then authorization to send the camera in for warantee repair.  The camera was back in 2 weeks working like a charm.  How long will it last now?", "Date": "May 31, 2007"}, {"Title": "Love this camera!!", "Author": "Gumby", "ReviewID": "RUJZBVL0BCO7L", "Overall": "5.0", "Content": "Bought this camera about a year ago and have been happy ever since!  Takes very clear pictures and great little videos.  Only complaint is the cheesy little attached lens cover...it's sort of funny to have the little plastic cover on such a nice camera.  Other than the cover we love it!!", "Date": "May 19, 2007"}, {"Title": "Best among i used", "Author": "Venkata Bonam", "ReviewID": "R3DB4NQWIZAOZH", "Overall": "4.0", "Content": "Hi this is the best cam..Dont give second thought for buying this..This is the king for this price range..iam impressed with the sports mode..I was travelling in card 60/mph and had captured some building...wooow you dont belive they came as iam standing infront of the building....", "Date": "May 9, 2007"}, {"Title": "Fair lil' point 'n shoot", "Author": "A. McCullough", "ReviewID": "R1O2EMFRD1LCFY", "Overall": "4.0", "Content": "Not as good of a camera as I had originally thought when I first bought it. Easy to learn, can take very good photos in well-lighted areas but you DO need to use the flash for dimmer environments - its low-light capabilities are horrible. Very fast readiness time from the moment you switch on the camera - slow to recharge from a flash, though, and there's a bit of a lag when you press the shutter button to when the photo is actually taken (not so great for fast action shots, even though it touts a \"sports\" mode). However, its focusing at full zoom is extremely poor, and it does not benefit in the slightest from the image stabilization - I've ruined more shots than I care to mention because it's impossible to hold steady enough (even when braced). Also, its photos have an extreme amount of grain in the shadow areas under slightly unfavorable lighting conditions (in the shadows of leaves on a bright sunny day, for example), and it does not capture an acceptable amount of detail for a camera that takes five-megapixel photos. Having spent some considerable amount of time with this camera now, if I could reduce the amount of stars I first gave it I certainly would. It's a fair beginner's camera, a nice pocket-style camera, but certainly not to be mistaken for a high-end unit and indeed, there are far better pocket cameras available for the price. Frankly, my old Olympus C4000 runs rings around this unit.", "Date": "January 22, 2007"}, {"Title": "The really useful Digital Camera.", "Author": "Steven Hiss \"OTR Hiss\"", "ReviewID": "R1JOGU5B1NLGHH", "Overall": "5.0", "Content": "I experimented with both ends of the digital photo-technology.  This camera is really \"the best of both technologies\".  Incorporating excellent auto-focus technology as well as rapid \"point-and-shoot\" capabilities it extends this with abilities to use starlite, candles, and other extreme low light situations easily with the addition of a tripod.  With a 1G memory card, 405 5 MegaPixels are available.  Who could ask for anything more in this price range.", "Date": "January 3, 2007"}, {"Title": "Excellent Camera For The Price", "Author": "Brian Downard", "ReviewID": "R28P95S8WKY8CX", "Overall": "5.0", "Content": "This is my first digital camera. So, keep that in mind when I am reviewing this.Pros:1. Great Quality.2. Easy to use when uploading to PC.3. Easy to use when taking pictures.4. Easy to use when taking videos (No sound).5. Bottom line just all around easy to use.6. Durable (dropped couple of times and works with ease).Cons:1: No Sound when using video.All I could find is 1 CON reguarding the camera. This camera is so simple to use and it takes great pictures with a push of a button. No, way can you go wrong buying this camera. Buy it and enjoy it, just as I am.", "Date": "December 27, 2006"}, {"Title": "Great camera for 13 months...", "Author": "Andrew \"andrew7459\"", "ReviewID": "R1DT80KTYQWKL", "Overall": "1.0", "Content": "I bought this camera just over a year ago and really enjoyed it.However, it broke about a month ago - just after the warranty expired. The motor that extends/retracts the lens stopped working.Meanwhile, our Canon A60 which we've accidentally dropped a number of times keeps going strong.I liked this camera while I had it. If it was still working I'd give it a higher rating. It took good pictures, was fairly small for a 6x optical zoom camera (by early 2005 standards). The different modes were good, though red-eye was a bit of an issue (though I suppose that's going to be an issue with most small form-factor cameras).I would have preferred to have an optical view finder and audio playback of videos on the camera (the camera video mode DOES record audio - but when you playback on the camera, you can't hear the audio) - not a huge deal.I won't be buying another one of these to replace the broken one. We're going to keep our Canon A60 as our primary camera, then probably look into buying a newer Canon when our A60 breaks or we need two cameras again.", "Date": "October 12, 2006"}, {"Title": "Panasonic Lumix DMC-LZ3S 5MP Digital Camera", "Author": "Lynn R. Breen", "ReviewID": "R4BVEI9D7ZAKO", "Overall": "5.0", "Content": "I bought the camera for my son, who left for Disney Land in California the next day after receiving it.  He took 250 pictures.  The pictures looked so real, it was amazing.  The quality is with out a doubt exceptional.", "Date": "January 6, 2007"}, {"Title": "Panasonic digital camera", "Author": "TwoPalms \"Patricia\"", "ReviewID": "R2HBC4LDHTUKIX", "Overall": "5.0", "Content": "First digital camera for me and the instructions are easy to follow.  It is just the right size and my first batch of pictures turned out great!", "Date": "November 7, 2006"}, {"Title": "Great camera - while it worked ...", "Author": "Ravenhurst", "ReviewID": "RLIZB8CU25NS", "Overall": "2.0", "Content": "I bought this camera as a Christmas 2006 gift. It worked perfectly out of the box. Took great pictures. It was the right camera for what I wanted it (carry along for snapping photos for blogs and Web sites). Then, suddenly, the shutter that covers the lens won't open when the camera is turned on. I reset the camera in the hope that the problem will go away, but it didn't. So, great camera while it worked, 4 star photos. Reliability: Zero.", "Date": "March 21, 2007"}, {"Title": "Best Close Ups", "Author": "Joseph R. Aziz", "ReviewID": "R5GK6N8DZ9ERJ", "Overall": "5.0", "Content": "This camera has the best macro capacity of any camera in its class. I take pictures of coins, and you have to have maximum detail and luster to sell them. I have tried many other more expensive cameras that have worse macro than this camera, even cameras with advanced CMOS technology. If you need a camera for close ups, this is the best choice.", "Date": "August 1, 2012"}, {"Title": "good camera, LCD screen useless in sunlight", "Author": "Harold A. Smith \"cheap geek\"", "ReviewID": "RMGHBURG9AO7N", "Overall": "4.0", "Content": "I've had this camera for a couple of years.  It has done everything I've asked it to do, and well, except show me what the picture will look like when I'm shooting in bright sunlight.  I've found myself just pointing in the general direction, and hoping, far too often.I use this camera regularly, and it has always worked well, but I won't buy another camera without an optical viewfinder.", "Date": "October 5, 2009"}, {"Title": "overall, not bad", "Author": "N. Carlson", "ReviewID": "R1LKWKEVTGLMCF", "Overall": "4.0", "Content": "I am overall quite satisfied.  Battery life seems quite good.  Picture quality is good.  I was hoping to use this as a cheap alternative for intra-oral photography (I am a dentist) and it is not quite as useful for this application as I had hoped.  The macro function works well the flash is very bad for close up shots where you really want good color representation.  Instead this will probably end up as the family camera for travel, recreational shots, etc., for which it is a good camera and an especially good value for the price.", "Date": "January 4, 2007"}, {"Title": "NICE CAMERA", "Author": "Eduardo Rosal Pulgar \"Eduardo Rosal - ATREVET...", "ReviewID": "R1XMUM4RNPDT2M", "Overall": "5.0", "Content": "I think this camera is really nice, good price, 6x optical zoom, pics look great, it feels strong, too many options to take a good picture.", "Date": "November 20, 2006"}, {"Title": "Almost Perfect", "Author": "Robert C. Keiber", "ReviewID": "RZUH9DX82M4SM", "Overall": "4.0", "Content": "I bought this camera for my wife on her birthday. She's rather technophobic, and I really needed something that would deliver the advantages of a digitalwithout being too intimidating, and at the same time still offering more options that could be utilized, if desired. I am very pleased with the Panasonic. The picture quality is excellent and the 6x zoom is great to have. The only complaints are that the screen is hard to see on a bright day (I wish it had an eye viewpiece). Also, there can be a bit of redeye with flash pictures. But that's true of most flash cameras, I think. But all in all, a very good buy.", "Date": "January 10, 2007"}, {"Title": "Great Camera", "Author": "Bruce J. Wertz", "ReviewID": "R3QS3KG2K4V7SR", "Overall": "5.0", "Content": "The cameras is great.  The price was good. It takes wounderful pictures.  The only thing I would change is that it does not have a view finder.  I do a lot of hiking in AZ and it is hard taking pictures in the full sun.", "Date": "January 9, 2007"}, {"Title": "Panasonic Digital Camera 5MP", "Author": "K. Balsamo", "ReviewID": "RUSN4OLCA228O", "Overall": "4.0", "Content": "My camera arrived in a short amount of time.  All of the information that the Seller provided was accurate.  The camera looks like new and it was priced at a fair amount.  I was upgrading from my older camera and needed it for my trip in September to San Francisco.", "Date": "September 3, 2013"}, {"Title": "took it w/me", "Author": "Sonja G. Foxe \"straight shooter\"", "ReviewID": "R2X7UE2MW19A5Q", "Overall": "5.0", "Content": "and when my tablet helped me lose 600 photos from my other more powerful camera, alas babylon, this little refurb job had a couple few decent shots of the places that got wiped out in the holocaust", "Date": "January 1, 2013"}, {"Title": "I liked it.", "Author": "Pokerbluff \"Pokerbluff\"", "ReviewID": "R3CIO2NFWNB12A", "Overall": "5.0", "Content": "I love Panasonic cameras. I have the lz3 not the lz3s. I could not find the lz3 so I thought I would try this. It is close. 5MP is fine for me. It does not have sound in videos is my only complaint. It is small and easy to use. It is cheap so you do have to be careful. I have not broken it yet. The pictures look good to me. 6x is ok. Five stars, well I got mine cheap so I could give it fifty stars for what I paid for mine. I do have a small case for mine and that does help a lot. You have to read the instruction manual many times. It has a lot of settings and you do have to learn them. The quality is so poor it should not get five stars but eveything is cheap and I have had very good nikons with serious issues. There are lots of better cameras today than this but this one has been good to me and the pictures of me are ok.", "Date": "September 9, 2010"}, {"Title": "Great camera for the price", "Author": "Bill Delong", "ReviewID": "R396XYZPEBOHEY", "Overall": "4.0", "Content": "I've had this camera for just over a year now, and it's a great bargain for the money. It's not the perfect camera, but it does take above average quality pictures that are good enough to print up to 8x10 photos.Pros:1) Decent quality photos2) AA battery life lasts about 100 photos if using power save mode3) SD Card is easy to load/unload4) Decent Optical Zoom which is good enough to take close ups from the back row of an auditorium, but you must have VERY still hands when using the zoom or you WILL get blurry pictures!Cons:1) No viewfinder which can prove difficult outdoors on sunny days to see the LCD when taking pictures2) No audio when making video clips3) No Date Stamp feature imposed on pictures", "Date": "August 11, 2009"}, {"Title": "Great camera for all dry conditions!", "Author": "Jose Calderon \"jlcaldemont\"", "ReviewID": "R7CK8RQBLUTLK", "Overall": "5.0", "Content": "I bought this camera a couple of years ago because of its great price and good speccs.It is a 6x optical zoom camera with up to 24x digital zoom (Macro mode also works great)This one is very good for the amateurs cause it adjust everything automatically for you - as many commercial cameras today-Someting very important is that there is no time limit on movies in this camera -as long as you have memory, of course-The cons are that it is a little big (not really for your pocket), no eye-hole and only one small movie size.", "Date": "July 6, 2009"}, {"Title": "Great camera, but no sound for video recording", "Author": "S. Hernandez", "ReviewID": "RXSO3ZCT96047", "Overall": "4.0", "Content": "I really love the quality of the photos. It's really easy to use. The only thing I don't like is that it has no sound (speaker) when you use the video feature. I have all my videos with no sound.Other than that it's a good camera.", "Date": "December 11, 2008"}, {"Title": "Save Your Money", "Author": "S. Lennox", "ReviewID": "R19GZ95DGK4BWW", "Overall": "1.0", "Content": "I purchased one last year and thought it was great, then this past May 2007, I purchased 2 more. One broke just outside of the 90 day labor warranty and Panasonic wants $95 flat fee to fix it, of course that doesn't include parts since that is still under warranty.  The original one, which is now about 18 months old will only take indoor pictures.  For some reason, as soon as you try to take an outside one, the camera goes black.  The indoor pictures have lines all throughout the picutes.  This one is out of warranty all together.  The only one left is one of the two purchased in May.  If I were able to get a refund I would.  The picture quality on this camera is getting terrible.  No matter what setting I have it on, they pictures look great on the computer, but if I get them printed out, or I print them out, they are grainy.  Do not waste your money on this camera!!!  I would never buy a Pansonic again!", "Date": "November 12, 2007"}, {"Title": "Great Compact Camera", "Author": "Donna White-tollis \"DTollis\"", "ReviewID": "R18UZT4IQOF6KA", "Overall": "4.0", "Content": "Took this gem to London/Paris this past april...it lasted two weeks on the battery which despite the bad rap on battery usage I found this to be great.  I got wonderful photos and am very pleased with the camera.  The controls are easy to work and this camera does do short videos also, which was an added benefit.", "Date": "September 24, 2007"}, {"Title": "POOR QUALITY, NOT RELIABLE", "Author": "Angeles U. Brown \"Anbrow\"", "ReviewID": "R145CT3P8YQH57", "Overall": "1.0", "Content": "Hi, I bought this camera and it broke the first time I used it, eventhough I was very carefull  to use it. While taking pictures a message of \"turn of and off camera\" appeared, I checked the manual and it said that when that happens you should take it to repair or call the dealer, because is not working properly. What I think is that they know about their poor quality that they put that on the manual. So, if you want a reliable camera stay away form this one. I got it because I was going to a cruise, but after that of course I couldn't take any photo with this thing, if you can call it camera.", "Date": "November 2, 2006"}, {"Title": "Battery consuming product", "Author": "S. Nilawar", "ReviewID": "R3O3QP1LHSO6RG", "Overall": "2.0", "Content": "I am not satisfied by this product. The calrity is not good. Also this is the most battery consuming device I have ever seen.", "Date": "January 11, 2007"}, {"Title": "Too Slow camera", "Author": "Alex Luzardo", "ReviewID": "R3MXUR7FPPWEYD", "Overall": "2.0", "Content": "I bought this camera because I read Imagen stabilization, really you can move the camera and the photos looks good, but the only problem that I see in this camera is a very slow record when you take a pìcture, I had a sony DSC-W5 and this camera is much faster than Lumix, I don't known why the persons in the previous reviews didn't report the slow record, but for me is unacceptable this condition. I will going to resale this camera.", "Date": "November 23, 2006"}, {"Title": "Nice camera", "Author": "Sherry F. Dick", "ReviewID": "R3JZG88E0T2OX2", "Overall": "5.0", "Content": "I have been very pleased with this easy to use camera. It takes very good quality pictures and the price can't be beat!", "Date": "January 11, 2007"}, {"Title": "Happy to have seen and ordered the unit.........", "Author": "Joseph R. Cromwell", "ReviewID": "R1SDVA2QEWOEIZ", "Overall": "5.0", "Content": "Happy as a clam with the purchase. Amazon is my kind of seller. Keep up the good, no, excellent work.It' a pleasure doing business with you..... Regards, J.R. Cromwell............", "Date": "August 9, 2007"}, {"Title": "Amazon Cancelled the order", "Author": "Danger Girl", "ReviewID": "R3SXMND7PTJJKX", "Overall": "3.0", "Content": "Never got a shipping confirmation, so we emailed Amazon. About 3 hours after we got an email that said \"rest assured your order shipped on July 31st\" we got a second email that said they couldn't find this product anywhere so they were canceling the order. We were counting on getting this camera before we went on vacation.I gave this 3 stars because I'm sure the camera is great, but the service was bad.", "Date": "August 30, 2007"}, {"Title": "Excelente camara para su precio", "Author": "Andres A. Galeano Tamayo", "ReviewID": "R1F6ORVTC90UN5", "Overall": "4.0", "Content": "Esta es la tercer camara que compro. Y de las 3 es la mejor que he tenido.Pros:-Calidad de imagen-Rapidez de captura-Zoom Optico-consumo de pilasContras-No graba sonido", "Date": "May 7, 2007"}, {"Title": "Oops and oops", "Author": "Ted J. Coonfield", "ReviewID": "R3RTLF6DNKK0AL", "Overall": "3.0", "Content": "I did not realize how much I need a viewfinder in a camera. Outside shots almost always preclude seeing the screen in back. Oops, my fault for not figuring that out before buying. Then i dropped the camera and it bent the lens. $150-200 to fix. More that cost of camera--oops #2.", "Date": "January 11, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.0-megapixel CCD captures enough detail for photo-quality 13 x 17-inch prints\n6x image-stabilized optical zoom; 2.0-inch LCD display\nPlayback of 9, 16, and 25 images is possible on a multi-split screen\nConsecutive shooting feature lets you take up to five shots per second\nPowered by 2 AA-size batteries; stores images on SD memory cards (includes 14 MB of internal memory)", "Name": "Panasonic Lumix DMC-LZ3S 5MP Digital Camera with 6x Image Stabilized Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41H5ZD3J7TL._SX300_.jpg", "ProductID": "B000E18BTM"}}