{"Reviews": [{"Title": "Great product, great value", "Author": "Daniel", "ReviewID": "R1ZCLKTTG9CX29", "Overall": "5.0", "Content": "After looking for a small digital camera for family gatherings, vacations, and general candid photo ops, I came across a review in the Wall Street Journal dated 2/18 rating four new small digital cameras hitting the market in the next few months.  I was amazed that they picked a Konica Minolta over the others, including the new Sony DSC-T1, which retails for $549.00.I've had the camera for a few days and it so user friendly that my wife is no longer intimidated by digital photography.  It is incredibly small yet I had no trouble holding it comfortably and was able to keep still while shooting.I have a Nikon Coolpix 950 which I doubt I'll use again.Also, don't be misled by megapixels: 3.2 is plenty for printing, even 8x10\" photos.  Look for more pixels only if you will be  cropping large sections of the photo and then printing large copies.  The only down side is the 16MB SD card provided.  On the 'fine' setting, only 9 photos fit on the card.  Order at least a 256MB which holds approx. 154 photos.Last, but certainly not least, is photo quality.  It is as good or better than larger, more expensive digital cameras I've used.  Red-eye reduction deserves special mention as working well.  Overall, a great package at an unbeatable price.", "Date": "March 3, 2004"}, {"Title": "Absolutely a great camera", "Author": "mike", "ReviewID": "R1KIVC161JPMGZ", "Overall": "5.0", "Content": "First off, I have owned a few digital cameras.  The first was a Sony dsc-p92, nice camera, great quality pictures, a little bulky for the pocket. Traded this camera for the Olympus c-750uz, which is a fabulous camera and has everything one would want in a camera except size.  This camera was stolen because instead of putting it in my pocket(can't do way to big) after the battery went dead, I stupidly put it back in my car in sight (I always put the camera in the trunk except this day) while at the Lowry Park zoo in Tampa for what was to be a few minutes while walking around the park outside. Anyway some Lowlifes broke out he window and grabbed the camera.  (We were told by the park security they had been doing this a lot, Thanks for the warning after $700 worth of camera gone).  The dilemma for the next camera was primarily wanting a camera that I didn't mind having in my pocket even after the batteries went dead, and one my girfriend didn't mind carrying(she hated both the other cameras for their bulkiness).  We also wanted a camera that took decent pictures.  Did lots of internet research and came across the Xt,  I read reviews for the Xt and loved everything about it, except that some reviewers had complained about picture quality, so it was out.  Later while going to Ritz camera they had an Xg, and was told about a wall street journal article that raved about it picture quality being even better than the new Sony 5mp mini.  Decided to get the Xg and test it out.  Wow, Minolta must have fixed any problems with the previous model, this takes a great picture for 3.2mp. It is not up to the definition of the Olympus or sony, and I do miss the 10x zoom sometimes, but this camera goes everywhere.  It is so fast to start up, advertised as the quickest, and It focuses very fast.  My other cameras were a lot slower.  Was out last night at a club, and got some great pictures of the band, the flash is very bright.  I also experimented with the movie and recorded one of the songs.  Now this place was dark, so the movie pictures were not the best, but the sound quality was amazing! If you want a great audio recorder this is it.  The movies taken in full light are ok, but you wouldn't want this camera to be your movie camera nevertheless, cool movies as long as the memory card can handle(The memory cards are very small and cheaper than comparable Sony and Olympus).  Also just started using the burst mode for pictures, If you want some good pictures of your friends this camera can snap off (very quickly)as many pictures as you need, so you can go back and keep the one where everyone has the best smile.  Why try for the one perfect picture? I get about six real quick and always have at least one really good picture.  Other nice features are the battery life, very long outlasts 256mb of pictures.  At first I wanted a camera that took AA batterys, already have rechargeables, but I love this Li-ion battrery, very lightweight and small, and can get them for about $10 on the internet, not bad, and they don't have be drained completely like the Ni-Mh.  They charge really fast too. An Hour Maybe.  SO how about the complaints?  A little weird to handle at first because of the lens and Lcd location. Finger gets in front of lens until trained :) LCD worthless in sunlight, but didn't expect it to be. If Minolta could put the lcd into the viewfinder and have an eyecup attached that kept out the light, that would be fantastic. And if they could ever get a 10x zoom and 5mp in a camera so small, WOW. Your camera purchase comes down to what do need the most.  I think the Olympus has the most features, 10x zoom is amazing plus they sell 2x multipliers for 20X!! and best picture, has raw file mode for uncompressed files.  This camera is great for wildlife photography.  The only drawback is the size, but still not a big a some digitals or 35mm.  The Minolta gives up a few things but much less than any other camera I saw that was as portable or in the price range.  The problems I read others had with this camera I did not find.  Someone had a focusing problem indoors, I did not,  without flash they will blur sometimes which is to be expected (use a mini tripod).  I have taken pictures at night without the flash(and a solid platform) to get the background and they come out brighter than my eyes can see, very surprised.  Other people complained about not having a battery cradle and AV output, but you get so many other things other cameras dont have and the easiest portability of almost any other camera, so this was not a problem for me, it all comes down to what you want, and they haven't made a Camera that has everything in one package yet.....getting close though :)", "Date": "June 13, 2004"}, {"Title": "Just what I wanted", "Author": "Jay Rutherford", "ReviewID": "R2GIVWS7JYE0U9", "Overall": "5.0", "Content": "I wanted a camera that was small and light, to use when backpacking. This little camera represents an excellent compromise for my needs. I like the fact that it is compact; I carry it in my pocket all the time, unlike my other digital camera that gets left behind much of the time. I like the fact that the lens extension is completely internal, and that the camera does not change shape or get larger when opened for shooting. The internal lens means the camera is ready to take pictures in less than a second from turning it on.One needs to be sure to hold the camera carefully when shooting, since the light weight makes it easy to take shaky pictures. Also, one needs to hold it as recommended to avoid blocking part of the picture with a finger or thumb. I can deal with these caveats.All in all, I'm highly satisfied with this camera as meeting my specific needs. I recommend it for anyone needing a camera that's small, light, and always at the ready for a picture. This is one camera that you will take along with you.Jay", "Date": "April 2, 2004"}, {"Title": "Minolta Accountant's Version of Xt", "Author": "YSC", "ReviewID": "R2SSW97HGHETDO", "Overall": "3.0", "Content": "This camera is essentially the same as Xt, except that it has lost some features:-no more charging stand! It's not even available as an option, since the charger contacts were removed all together. you will have to take your batteries out to charge, which is one of the design flaws on other ultralight cameras that drove me to Minolta's original design. Furthermore, the battery charger is just a slight variation of the original charging stand (which charged both camera and batteries), thus it is unnecessarily bulky (with wires galore) for its now reduced functionality.-no more a/c adaptor port. to use the camera with a/c, you will have to buy a proprietary battery-replacing adaptor (a dummy battery with wires).. i.e. you'll have to take the battery out and replace it with the adaptor for it to work, and the wire coming out of a little sliding door next to the battery bay. the door becomes an extrangeous loose piece most of the time, for most people.-lower resolution LCD monitor (85k vs 110k) but slightly larger (1.6\" vs. 1.5\").-No more TIFF (uncompressed) format.-No more video out (where you can play back pictures on TV).-No more quick switching option between color modes through left-right toggles.It has gained a few things:-programmed AE modes: it adds nothing to its photographic features. There's nothing that the camera couldn't do already with orignal set of controls, though some may find it easier to use.-New Image Processor that reportedly improves color.-Better battery life (resulting from the new processor. The camera as well as the Xt uses almost no current with LCD off: extremely efficient).-Added 30fps movie mode (Xt has 15fps only) as well as night mode for movies.-Some seemingly useless features: a paste-over feature where you can superimpose your pictures against some cartoon background; 9-in-1 picture mode, etc.-Allows in-camera movie edit and picture cropping.-it's priced higher.I mourn the demise of a great little combination. Xg feels almost like a downgrade rather than an upgrade. Seeing Xt's corners being cut off and its price jacked up worries me with the direction which Minolta is moving. Xt's a wonderful camera, and so is this nearly-identical Xg, especially now (supposedly) with better images and longer battery life. Yet it seems to me Xt's execution was done with more heart and less number crunching.my $.02", "Date": "April 13, 2004"}, {"Title": "Nice, but expensive", "Author": null, "ReviewID": "R1S8YDTBN9QRRW", "Overall": "4.0", "Content": "I'd been looking for a pocketable digital camera for quite some time and finally settled on the Dimage Xg (after trying and returning several others).  For what you get it's a bit on the pricey side, but it can take great-looking images.  It is a nice size with easy-to-use menus and controls.  The zoom is much quieter than my Nikon Coolpix 995 and image quality is about the same, maybe even slightly better.  However, the Xg does have serious issues with focus, esp. in dimly-lit areas or where the contrast difference is very high (for example, at first I could not get an accurate focus on my blank and white dog).  This can be rectified with careful composing and locking the focus.  Also I found switching to SPOT FOCUS works much, much better.  All in all, it's a nice camera I can easily drop into a pocket and have when I need it.", "Date": "March 15, 2004"}, {"Title": "It doesn't get better than this...", "Author": "David in Houston \"obtusegoose\"", "ReviewID": "R16J826UX2V3NV", "Overall": "5.0", "Content": "If you are looking for a digital camera that will slip right in your pocket and takes terrific pictures, this is the camera. The Dimage XG is so small and thin you will be in shock when you see it in person. The amazing thing is that it takes 3.2 mega-pixel pictures AND includes a 3x optical zoom lens (that is built INSIDE the body of the camera). I bought a 256 MB card which lets me take over 150 \"high quality\" photos (that's a lot of rolls of film). I also ordered the marine enclosure, which I'm looking forward to using while snorkeling in Maui. The color accuracy and photo clarity are both impressive.This camera replaced my \"chunky\" Olympus Camedia D-40 ZOOM. It was a pain to put in your pocket (1-3/4 inches thick), and the menu system was horribly unintuitive.I didn't have the \"white stripe\" problem that another poster mentioned. Maybe their camera was defective.", "Date": "March 11, 2004"}, {"Title": "Excellent Product", "Author": null, "ReviewID": "R2VHJ37QF0F29T", "Overall": "4.0", "Content": "All:I have had this camera for a week and really like it.PROS: Everything the ads say are true. Great pics.Fast startup and snap. Great for people who dont wantto mess with lot of manual settings, although you can dothat too.CONS: Have to think hard for these, but the lens is in a spot that you have to be careful not to cover with your finger when snapping a pic. Also, dont buy the Minolta camera case that you can get to fit the camera. It is a poorly designed case.", "Date": "April 2, 2004"}, {"Title": "actually if 4.5 stars was an option", "Author": "Bryan Rilinger", "ReviewID": "RVSO7LD3BY38B", "Overall": "4.0", "Content": "I like many other people, first became interested in this camera because of the WSJ article.Its tiny, has intuitive useful features such as 6 different types of photo settings, the ability to turn on and be ready to take a shot in less than a second, and it can do digital video with sound.  It takes great pictures at 3.2 MP (which is all i, and most users really need.) COmbine all this that with the fact that it doesn' have a protruding lens and you have one great camera.  At $299, it really is an inexpensive alternative in this latest wave of \"compact digitals\"I would have given it five starts but the battery must be removed to charge it, which really isn't that big of a deal, but a cradle feature would have been a nice touch.  Also, if you use the viewfinder to take pictures (which i do, call me conservative,) the placement of the lens and the camera's extremely small size makes it very likely your finger is going to be in the shot.  The camera is definately geared towards people who want to snap photos using the LCD screen exclusively.I got no beef with this camera.  It rocks, get one!", "Date": "March 20, 2004"}, {"Title": "Konica Minolta DiMAGE Xg Digital Camera", "Author": null, "ReviewID": "R1WPN3GO0V1HBD", "Overall": "5.0", "Content": "Strengths:Compact and lightweight camera that allows photographers on the go to take high-quality pictures in any place and at anytimeWeaknesses:No A/V output and slide show function. This is probably the biggest loss for the XG.Summary:The ultra slim Minolta DiMAGE Xg packs a 3x optical zoom and 3.2-megapixel resolution into a body that is just 20mm thick! Though the DiMAGE Xg is almost identical to its predecessor, the DiMAGE Xt, it has a number of fundamental difference, including a faster start-up time (a speedy 0.8 seconds), a larger 1.6\" LCD monitor, and a fast, 30-frame-per-second movie mode for high quality movies. Much longer battery life - 240 minute playback versus 120 for the XT. Specific AE program modes for sports, portraits, landscapes, sunsets, night scenes. Sports means faster shutter to catch action and so on. Multi-frame in one frame capture for action sequences (9 pics in less than three seconds). Manual settings mode somewhat like the Canon S230. One switch setting chooses the auto settings including the 5 AE modes. The other lets you choose color mode, ISO sensitivity, metering, and white balance. PictBridge printing support. In camera picture editing functions such as cropping and reframing pictures. In camera cut/paste function allows you to place an image within another image. This is one fantastic camera!", "Date": "March 29, 2004"}, {"Title": "Dimage Xg a mixed upgrade to the Xt", "Author": "jaw \"jw1911\"", "ReviewID": "R3P5OYMWO3JIFL", "Overall": "4.0", "Content": "The Dimage Xg appears to be a mixed upgrade to the Xt.The Xt featured a charger stand that allowed for the battery to be charged while in the camera.  Contrary to what the Wall Street Journal article claimed, on the Xg, the battery must be removed and placed in the charger.  Ok, so not that big of a deal, but the charger is clunky with a thick external cord.  For that much infrastructure it should be a charger stand like it was on the Xt. Or, on a camera where removing the battery to charge is a must, the charger should be compact with a flip out plug like that of the Canon Elph series.  The Xg charger is the worst of both worlds.The Xg also lacks the TIFF file format setting and the A/V outputs of the Xt.There are some nice new features such as the Automatic Digital Subject Program Selection, but that appears to only work if one does not use the zoom.  I suppose that if you have time to zoom you have time to select the proper Subject mode but that seems like an omission that could have easily been included.The best feature that the Xg has over the Xt is a drive mode where the camera takes 9 pictures in rapid succession and then produces a grid image with all 9 in one frame (albeit at lower resolutions for each discreet image).Overall it appears to be a mixed upgrade to the Xt.  The gains are offset by some loss of convenience.  If the Digital Subject Programs actually help it take better pictures then it will probably be worth it.  More time with the camera will tell if the additional features are a worthwhile trade off for the loss of the charger stand.", "Date": "March 11, 2004"}, {"Title": "A Great Little Camera", "Author": "Whm", "ReviewID": "R2DSIMJBBTKOD", "Overall": "5.0", "Content": "This camera rivals the quality of picture with my Canon G3.  It doesn't have as many possible settings, but sometimes that's a real convenience.  Quick to start up, fast saving of pictures, and great quality, color, and clarity.  Plus it doesn't hurt that my laptop has an SD drive so it's easy to download the pictures instead of hooking up the adapter for Compact Flash.  Lightweight, easy to use, great pictures at a very very low price.  A winner in my opinion.", "Date": "March 28, 2004"}, {"Title": "Small, light, fast startup, not that fast from shot to shot", "Author": "Alan Edwards", "ReviewID": "R2KT2DH277LNU9", "Overall": "4.0", "Content": "I read all the reviews and got this great form factor camera, however it does not shoot as fast as the Sony T1 (my other choice) from shot to shot, but the startup is as fast or faster. The low light performance is better than the T1 and causes less red eye. It also has the optical as well as the lcd viewfinder. 10x zoom in a non-prutruding lens design is great. BATTERY LIFE IS PHENOMENAL! Secure Digital Card (SD)fits right into your Palm or Pocket PC. Overall a great little camera that you can take anywhere and forget you are carrying it.It all boils down to your memory. If you are using Sony Memory stick, stay with all Sony hardware. Otherwise SD is a great choice as you can have your choice of Palm, Pocket PC, Canon and other hardware that uses the SD format.This has been a great little camera. Highly recommended!", "Date": "July 2, 2004"}, {"Title": "Xg is a Winner", "Author": "James J Stephanidis", "ReviewID": "R1RVUEZDCDAZRE", "Overall": "5.0", "Content": "By far the best ultra compact, truly shirt pocket digital camera with the right combination of features.  Not the best in the world, but real close.  The start up time is less than a second and your ready to shoot.  One mode for fully automatic with preprogrammed settings for portait, sport, sunset, night, and landscape.  Another mode to have more granular control of sensitivity, white balance, and exposure.Prints great 4x6 pictures on glossy paper, which is 99.9% of the type of pictures I will print.  Comes with a 16MB SD card allowing continuous shooting at 1.5 frames per second.There is a 3x optical zoom that is non-protruding.  Great technology with great pictures.  I haven't taken a camera on trips due to their bulkiness.  Yes, I'm lazy.  The Xg is easily kept in a shirt pocket readily available when the urge strikes.", "Date": "March 23, 2004"}, {"Title": "Very good but...", "Author": "Rich \"rpk46\"", "ReviewID": "RTBIR8ELQQX4A", "Overall": "4.0", "Content": "Love the small size and fast startup time, as well as the ability to manipulate manual controls if you want. A couple of things that I miss from my previous Canon Digital Elph: 1- there is no TV (RCA connector) hookup. This is a really nice feature so you can come home and quickly do a slide show on the TV. 2- the charger cable is almost as big as the charger. Again, Canon did it right; the slightly larger charger has prongs built right in, no cord to tie up or tangle.Otherwise, nice small, feature-packed package with 3mp capability.", "Date": "April 15, 2004"}, {"Title": "Good, basic, camera", "Author": "Mark W. \"MW\"", "ReviewID": "RDYWGEPAOOO5N", "Overall": "4.0", "Content": "I have had one of these cameras for about 2 weeks now. This is basically a fancy point and shoot camera. I am finding I am taking this little camera along everywhere because it is small and fun. I am taking it with me to places where I would never take a camera before.I love the small size of this camera, and that it is super-easy to adjust the exposure up to + or - 2.0 EVs. (I have not found any way to specifically override shutter speed or f-stop; but there is a program which places the camera in shutter-speed preferred mode.) With its very small size, I found that my finger at first tended to get in front of the lens, which is at the top corner of the camera where the viewfinder window would ordinarily be. (The viewfinder is immediately adjacent, inboard from the lens, where the rangefinder window would ordinarily be.) The battery life is excellent. The autofocus works fine. Once focus is set, the shutter lag is minimal. There is spot autofocus and spot exposure metering available (requires scrolling through menus.) Sharpness is good for a point and shoot -- I am not expecting the same performance that I get from the high-end optics I attach to my Contax bodies. Distortion from the lens is less at all focal lengths than I expected, and contrast is reasonbly good. All-in-all, so far I am very happy with this little guy and heartily recommend it.", "Date": "September 9, 2004"}, {"Title": "Very satisfied with its compact design and quality", "Author": "Y. Lin", "ReviewID": "RHS85X8F7L6JN", "Overall": "4.0", "Content": "This is the camera for people who'd want to unload the burden while travel.  This is my first digital camera.  I was attracted by its compact size, so I bought it and took it with me to China.Am I glad I made the right choice.  With its compact size, it fits in any of my packet so that I can take picture whenever and wherever.  The quality is better than any fool-proof camera, and with my recently bought LCD Photo Frame, I can enjoy and share my good memory with my friends and family all the time!  The only problem is that the flash seems to consume lots of power so remember to buy extra battery.", "Date": "July 27, 2004"}, {"Title": "Best compact digital camera out there", "Author": "Jeffrey L. Caplan \"datura\"", "ReviewID": "R1AXLW9FV5HF2D", "Overall": "5.0", "Content": "Here is a little history of my digital camera use.  I started using dig cameras when a 640 x 480 camera was $350.  Now they practically give away these cameras away in cereal boxes.  Since then I've used fuji mx2900, fuji mx4900, coolpix 990, SLR-type Minolta N-10, and minolta N-20.  Now I have a the Mionolta Xg and I must say it is the easiest to use out of all the cameras I've tested. Usually the battery life is inaccurate.  On many cameras, after 50-60 pictures and the battery is dead.  I went to korea, and I took over 160 pictures on one battery!  Thus, I bought an extra battery for no reason.  The size is incredible, and the start up time is the best.  It is quite frustrating when you want to capture something and you have to wait for your camera to start up.  This camera starts in a mere 0.8 seconds.Additionally, the camera has a fairly sturdy casing and automatic lens cover.  finally, the LCD is one of the best I've used in overly bright light conditions.Cons:One con is the iso only goes upto 400.  This makes night shots difficult.  Plus since it is hard to control the white balance, you may need to adjust some of your night shots on the computer.  Additionally, there is distortion around the corners of the pictures.  It is a trade of for the internal zoom lens system.  This also causes slight vignetting, which is most obvious when taking pictures of a clear blue horizon.  If you want to take perfect pictures and have complete control then buy an SLR film camera.  If you want a light weight easy to use camera that can go anywhere, then buy a digital like the Dimage Xg.", "Date": "August 30, 2004"}, {"Title": "Nice Little Compact camera", "Author": "John Hook", "ReviewID": "R2XGGJ6Y9TULH", "Overall": "4.0", "Content": "I've had this camera for about 9 months.  It proves to be a usefull camera, with the basic features you need and takes nice pictures in proper lighting.  The flash could be better, but it is what you could expect for a camera this size.  Battery life is very good.  I bought 2 extras, but hardly ever need them.  My son used it on a trip to Spain and came back with some very nice shots!", "Date": "June 17, 2005"}, {"Title": "Compact, cool features, no useless gadgets", "Author": "R. van Rhienen", "ReviewID": "R36COA17Z5MIO4", "Overall": "4.0", "Content": "I've had this camera for about 9 month now and must say that I'm pretty happy with it. The battery capacity is great, as is the size. Picture quality is what I would consider pretty good and the features are all very useful. Particularly the ability to use it as a webcam is handy. Overall a great camera which I'd recommend in a heart-beat!", "Date": "December 10, 2004"}, {"Title": "Sneaky Shooter for Okay Photos", "Author": "JT \"fundaddy\"", "ReviewID": "R24EM5XVJSRHDU", "Overall": "3.0", "Content": "I have a Nikon 990 digital camera for work and personal projects. My wife wanted a digital camera to replace her Olympus Stylus. The Stylus is an excellent camera for travel and fun so we wanted something that would compare in quality but be even smaller. So we got the Minolta XG. I played with a friends Xt for a week and I agree, this XG felt like a downgrade instead of an upgrade.A totally different look in our photos. We turn the flash on for all photos, inside our outside on subjects and it makes a huge difference. After adjusting the camera f and shutter settings for your lighting and personal style the shots are still dark. Any more adjustments will make the shots blurry or washed out.We get photos from ofoto and they come out okay. Not as good as the Nikon 990 or film rolls we send in but good scenery shots. Startup is fast, I can whip the camera out of the pocket my family always wants the photos I take because it can capture the moment faster than anyone else with their gadgets. Shot to shot lags more than I expected.That is important to me - capturing the moment. Two buttons, no knobs or fiddling, just boom, boom, shoot. I wish the shots did not have as many artifacts in lowerlight and skintones. Overall, a good camera for someone who has kids or needs a second camera for the moments that you might miss because you did not have a camera on you.If you get this camera, watch your finger or thumb over the lens. Also, do not depend on centering a shot in the LCD display. It is way off from the actual lens.", "Date": "November 20, 2004"}, {"Title": "Poor flash, useless indoor", "Author": "Kin Leung \"dumbkid\"", "ReviewID": "R3N1SIVC5WA7Y3", "Overall": "2.0", "Content": "Compact camera with tiny flash.  Pretty much useless in the evening, or indoor.  Can't focus most of the time (indoor/evening). No capability for external flash. Pictures taken during the day is good, especially using \"spot\" metering.I bought this for my wife. She has indoor/evening meetings all the time, and this camera is just useless for her.  *sigh*Maybe I am asking too much for little price.", "Date": "December 15, 2004"}, {"Title": "Fantastic Camera", "Author": "R. D. Hoag", "ReviewID": "RJ8GBRNM9WVL2", "Overall": "5.0", "Content": "I bought one of the first Minolta \"X\" versions of this years ago and owned it with heavy use for about 4 years. I then sold it and bought a bigger digital camera for work and home use. My wife wanted a simple, small camera, that would be user friendly and take good pictures, so I bought her a Konica/Minolta \"XG\" and I was very impressed with the improvements made since I had owned my original X model. If you want a camera that is primarily for exchanging pictures on the Internet, or for prints that are smaller then 8x10 this camera is great. The huge advantage it has is it's slim, small design, while still having an excellent, non protuding, telephoto built in, along with extremely fast start up and excellent picture quality. All in all, one of the best small digital cameras that were ever made and holds its own up against the newest brands.", "Date": "January 22, 2009"}, {"Title": "Great Pocket Camera!", "Author": "H. Zeller", "ReviewID": "R35ZZ5ACTDM6EE", "Overall": "5.0", "Content": "The Konica Minolta Xg received an outstanding review in the Wall Street Journal, which motivated me to buy it as my first digital camera. I recently bought a second Xg after my first one was fried when I went swimming with it in my pocket.  The range/view finder, which has been eliminated from most pocket cameras, allows you to see a close approximation of the picture without relying on the LCD screen.  The LCD is small by today's standards but more than adequate to check the image and show others.  Taking pictures using the LCD screen is practically impossible outdoors in bright light, even with the large screens now available.  The viewfinder allows you to hold the camera in the traditional in-your-face picture taking position where it is stable and less likely to move and result in a fuzzy image, which can easily happen holding the camera at arms length viewing the LCD screen.  I also like the non-projecting lens design, which is protected by a sliding metal panel, because it maintains the shape of the camera.  The camera takes excellent pictures in my experience, with multiple pixel settings.  My only major problem was: the flash failed and required a $100 repair.  I never regretted making that investment.", "Date": "April 2, 2008"}, {"Title": "pleased", "Author": "William Fan", "ReviewID": "R33E1B6UC6WBU2", "Overall": "4.0", "Content": "I had this camera for a year now, and I've been very pleased. The main reason I bought this camera is the size. It fits in my pocket nicely. I love the features: night, portrait, action, etc..The flash is a little weak at night, and you probably need to use a tripod to get good pictures at night.I have had SOnys before, seen pictures from a Fuji and Cannon. I have to be honest, this is a 3.2 MP, the quality is below a 5 MP Sony or Cannon, or even a 3.2MP Sony. But it's hard to give up this little camera because of the convenience. I'll probably keep this when I do get a second.", "Date": "December 3, 2005"}, {"Title": "Perfect Blend of Features and Quality", "Author": "G. Schrom \"G-Man\"", "ReviewID": "R14PLGN4KR8RRX", "Overall": "5.0", "Content": "This camera has the perfect blend of features and quality of photos.  Like most people, I am only a casual photographer who wants to cature a few visual memories.  I wouldn't even take with me a larger -sized camera, so those memories are lost.  Because of this camera's small size, I take it with me quite a bit, so I am able to capture moments on \"film\" even if they aren't suitable for poster-sized framing.  Still, the photos are very sharp and nicely colored for 5x7 prints, or even 8x10 if there isn't a lot of detail in the shot.  Who prints 8x10s anyway?  5x7 or even smaller is all most people need.  The price was fantastic, too.  Small cameras like this aren't usually 3.2 MP, so that is a plus.  I also really like the full-motion movie taking capabilities, WITH SOUND, too.  This is very cool and affordable technology in a small, sleek  form that will actually get used!", "Date": "September 3, 2004"}, {"Title": "Excellent Camera", "Author": "MF", "ReviewID": "R32SXD6BEAHT6", "Overall": "4.0", "Content": "All:I have had this camera for a week and really like it.PROS: Everything the ads say are true. Great pics.  Fast startup and snap. Great for people who dont want  to mess with lot of manual settings, although you can do  that too.CONS: Have to think hard for these, but the lens is in a spot that you have to be careful not to cover with your finger when snapping a pic. Also, dont buy the Minolta camera case that you can get to fit the camera. It is a poorly designed case.", "Date": "April 2, 2004"}, {"Title": "Compact, but not good pictures", "Author": "L. E. WANG", "ReviewID": "R4Y3MYZ5WINFB", "Overall": "2.0", "Content": "I received this camera free from a Christmas party drawing (Grand Prize.)  I have to say that my Kodak DX3500 has better picture quality than this one.  It's cute and compact, but the picture quality is not good.", "Date": "July 20, 2004"}, {"Title": "Not cut out to be", "Author": "J. Cheng \"digiman\"", "ReviewID": "R3CTVO9PDO7N1V", "Overall": "2.0", "Content": "I have had the camera a little over 10 months and all i can say is that it was a waste of money. Why? the lcd screen turned off one day, and Minolta refused to cover it saying it was caused by impact.  the truth of the matter is that, i rarely used the camera; and when i did take it out, it was kept in a camera case.  Now i have a 400 dollar dead camera.  I do have a Olympus C4000 that i use for regular daily photography and it has served me fine for 2 years with no problems!  If I had known the camera was so fragile that it broke on its own, then maybe i would have bought another brand.", "Date": "August 11, 2004"}, {"Title": "Great for outdoor shots, hopeless for night shots", "Author": "A. Gadkari \"AG\"", "ReviewID": "R1P8U1VKWPW3UQ", "Overall": "3.0", "Content": "This was my first digicam and I bought it in quite a hurry. Here's what I like about this camera:1)very sleek and compact 2)zoom lens stays inside at all times 3)great outdoor and daytime shots. Here's what I dont like about my camera: 1)LCD resolution really bad 2)lag between 2 shots is too long and the worse part is that 3)this pretty thing is downright useless when it comes to night-time shots. In my opinion, this camera is like a beautiful woman on your arm.....great to flaunt; but when it comes to crunch time, you wish you had someone with more substance!", "Date": "May 29, 2005"}, {"Title": "Disappointing camera from Minolta", "Author": "iim_the_best", "ReviewID": "R1ZMMEFMGQ1SPY", "Overall": "2.0", "Content": "I was in awe with this cute little camera because of it's size which seemed to amaze me, especially because it had a 3X zoom without any protruding lenses, minolta's worth-praising technology. I thought this was going to be every amateur photographers dream come true, as it is extremely mobile.After purchasing this camera and seeing the quality of pictures, I now realize what the price of this camera is all about. To say the least, the picture quality is pathetic. When I compare this to my already existing canon powershot, the difference is strikingly clear. Quality of pictues in this camera would be like those of a web camera, if you excuse the size.I am terribly disappoited. The photo looks totally granulated with lot of disturbance. The color is made up and not natural. I would have forgiven the cheap little camera had I taken photos in no-so-good lighting condition. But as the lighting was good, the performance should have been better.After checking out so many cameras, I belive there is nothing better than canon powershot. If you have some extra bucks, it's worth spending on a canon. The picture quality is amazing.You can read my review for Canon powershot 4 mega pixel digital camera. This doesn't come even close to that.You can waste your money on this one only if you need to be able to carry a camera around in your shirt pocket and be least bothered about quality photos. I wonder how many of us would do that.", "Date": "July 18, 2004"}, {"Title": "BEWARE of 6 MONTH Warranty", "Author": "dmosh \"dmosh\"", "ReviewID": "R1N52R2ATSO00Y", "Overall": "1.0", "Content": "I liked this camera alot, but it broke after 8 months.  Konica Minolta only has a 6 month warranty.  I expected at least a one year warranty.  Now i am out 280 dollars.  I probably won't get another Konica Minolta product EVER!", "Date": "June 29, 2005"}, {"Title": "What a disappointment!", "Author": null, "ReviewID": "R1AILYSC5OWMKL", "Overall": "2.0", "Content": "Areas of high contrast have a conspicuous and distracting white (and sometimes blue) stripe, so I'm returning my camera. As a test, I took comparable pictures with my old Sony U-10, and what a difference! The Sony pictures are free of \"errors\" and are much sharper as well. Think I'll stick with Sony; apparently, you really do get what you pay for.The Dimage XG is small and is loaded with features (ISO control, voice memos, etc. etc.) but that doesn't matter if all you want is a sharp and accurate picture. Shame on the WSJ for recommending this camera.", "Date": "March 5, 2004"}, {"Title": "Could not get past the focusing limitations", "Author": "Nina J. \"nasj\"", "ReviewID": "R1GBUBOV8UE9G1", "Overall": "1.0", "Content": "Seems like a charming camera in many ways, but was completely unable to focus in a wide variety of situations for us (one children's dinner; one cocktail party; and some photos of the rooms in our house).Manual has a half-page of disclaimers which discusses how the camera \"may not be able to focus in certain situations\" -- but literally it was impossible to discern that there were even human beings in the pictures we'd taken.", "Date": "May 31, 2004"}], "ProductInfo": {"Price": "Unavailable", "Features": "3.2-megapixel sensor captures enough detail to create photo-quality 10-by-14-inch enlargements\n3x folded optical zoom lens, 4x digital zoom combines for 12x total zoom\n.8-inches thick; movie mode with audio; PictBridge support\nStore images on Secure Digital (SD) memory cards\nPowered by 1 NP-200 lithium-ion battery", "Name": "Konica Minolta Dimage XG 3.2MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/31brK0%2BtGDL._SX300_.jpg", "ProductID": "B0001G6UBG"}}