{"Reviews": [{"Title": "It's a winner!!", "Author": "\"mgoril\"", "ReviewID": "R2WZUYFHV6XX9", "Overall": "5.0", "Content": "After spending several weeks researching the digital camera market I finally settled on the Mavica CD 1000. The only problem was it was a whole lot more camera than I really needed. So what does Sony do? They bring out the CD-200. Problem solved. Still more camera than I really needed but boy, what a camera!! I've been using my new 200 for a little over a month now and am just as impressed and excited with it as I was on the first day. It has almost all of the features of the CD1000, even the ability to take short MPEG movies, without the extra weight and size. Image quaity, ease of use, features, flexibility.... it's got it all. Much smaller than the 1000, even my 7 year old son has no problem handling it. The viewfinder screen is sharp, clear, and easy to see in almost all lighting conditions. The only exception is very dark flash conditions and the built-in twilight light takes care of that. As with the 1000, the CD storage makes digital photography effortless. Transfering pictures using your CDR-RW drive or the USB cable is a no-brainer. Sony's CD's are a little pricy but Memorex's Pocket CD's work just as well, and their capacity is a little bigger. While on vacation I was able to get 165 large image (1600x1200) shots at high resolution on a single CD. The 5-pack of Memorex CD's cost about $1.80 ea vs 6 rolls of film at $5-6 ea plus processing. Using this camera has actually saved me money in film and developing. As with the 1000 there is a lag time between pressing the button and taking the photo. Pressing the button to Half-Shutter and waiting for your picture pretty much solves that. Excellent zoom, the manual says the image degrades the more zoom you use but I can't tell the difference. The picture quality is still excellent. Battery life is about 2-1/2 hours of shooting time. Carrying an extra battery will keep you shooting from dusk to dawn and then some. Sony has a camera that has taken point and shoot to point, shoot and print. It's that easy.Contrary to what geekysteve from Arkansas says it is not necessary to finalize a disc before picking photos from it. Just pop it into your CD-RW drive and you can copy over one photo, all photos or whatever you choose. I still use this camera almost every day and it's still the best camera in its class.", "Date": "July 22, 2001"}, {"Title": "Unbelievable Camera!", "Author": "robert lerman", "ReviewID": "R1R91IM3MX6JEU", "Overall": "5.0", "Content": "I have never written a review, and always wondered what kind of person would take the time to write. Here I am taking the time to write because this camera is the BEST camera I have ever owned -- bar none. Loaded with the features you need to take great shot -- its worth taking a few minutes to read the manual. This camera takes the best pictures ever. I selected the camera for the cd writing capability and have not been disappointed. You can pop the cd's in any computer anywhere for instant access; or just throw the cd's in a drawer for a rainy day. Last point: i was concerned about 2 megapixels, but have found the image quality to be more than ample. I cant say enough good things about this camera!", "Date": "August 13, 2001"}, {"Title": "Sony MVC-CD200 -- A breakthrough in digital cameras", "Author": "DL Day", "ReviewID": "R64TM14Y89Y9A", "Overall": "5.0", "Content": "I researched digital cameras for six months before buying the Sony MVC-CD200. The CD is what sold me on this one. I didn't want to have to deal with USB connections and special software just to view my pictures. I was also worried that whatever digital camera I bought might become quickly outdated. I don't think that's going to happen with the Sony CD cameras. This is an absolutely incredible camera for both serious and casual photographers. I'm an artist and had wanted to be able to take daily pictures of my work in progress, as well as reference photos. For me, this is the ultimate. The 2.1 megapixels provide photos that are actually superior in many ways to the ones I've taken with my film cameras. For instance, I can see thickness of paint, brush strokes and a full range of color in my paintings. I haven't even bothered to install the software that Sony provides with the camera. All I do is finalize the CD, pop it into the CD-ROM and pull up the pictures either through Microsoft Publisher 2000 or Quark Express. One disc easily stores 70 pictures shot at maximum file size of 1600-1200. I don't think I'd really want more than that on one disc because it makes looking through all of them faster. I print them on an HP Deskjet 1220C using their premium photo paper. I've been amazed at the results I've been able to get indoors with no flash. For instance, I took one of the light from a single lamp in a room on an overcast morning. Gorgeous. The camera is very easy to use. I would recommend going through the manual at some length to take full advantage of all it can do. I really think the Sony CD cameras represent a breakthrough in digital photography for a wide range of people.", "Date": "October 9, 2001"}, {"Title": "If This Camera Were A Man I Would Marry Him", "Author": "Beer Goddess", "ReviewID": "R1O88CE5H2IMED", "Overall": "5.0", "Content": "I simply cannot say enough good things about this camera. I got it for a three-week trip to Europe (took 700+ photos without a hitch, you can't say that about other digital image storage devices) and now I find that I am taking it everywhere!I did not find the problems one previous reviewer had with vibration during \"finalization\" of the cd's. I finalized on a train, and worried about the vibration of the moving vehicle, but did not have any problems at all. Maybe Kitty should be kept out of the room during the process (which takes only a couple of minutes!)I have enjoyed all aspects of this camera in the past three months that I have had it. The ease-of-use, the relative cheap expense of the storage device (I forgot a CD on a recent junket and just bopped into a local office store to purchase a disc for about $3) and the optical quality of the camera makes this a great investment for someone who wants a good, solid camera to accompany you across town or around the world.", "Date": "December 13, 2001"}, {"Title": "need digital stills for professional setting?", "Author": "DAVID ROBERTS", "ReviewID": "R27S7IQMV7YG07", "Overall": "4.0", "Content": "Okay so the price IS a bit steep, but there are plausible reasons and results.  First the 2.2 meg resolution will give you a SHARPER photo that will allow you much better results and allow for much more versility in enlarging and editing. second (and this is a point that I have had one Hell of a time tracking down what is possibly the best reason, I wanted a \"format\" that would allow for the sharpest image to be easily transfered to my PC. now the Mavica FD series using the floppy disk was where I started, but the resolution wasn't very good,then I moved on towards memory sticks and the like, but that necessitates the use of USB 's etc.  where there are the usual complications and time downloading, a slight loss(?) of image sharpness and so on. Now this camera uses a 3-inch miniCD which supposedly (as it turns out) you merely stick into you CD-ROM tray and download directlyinto your PC!!! My piece of cake. The only improvement that I can see would be the next higher model with its 3.3 meg resolution, but I simply don't need THAT much for [that much money]. (oh, make sure you get the starter bag/kit!!! And make sure you get at least another 3 disks for whatever!!!)", "Date": "January 7, 2002"}, {"Title": "The CD gimmick grows old quickly...", "Author": "Steve", "ReviewID": "RCDCGD9ACKC7V", "Overall": "3.0", "Content": "I purchased this camera a month ago, and at first I loved it.  It does take great pictures, there's no arguing that.  However, the CD \"feature\" can be a bit of a nightmare, especially if you take a lot of \"quick\" pictures and want to view them on your PC immediately.Here's the problem: unless you install the Sony USB drivers (which are quite finicky with Windows 2000; one install corrupted my ATAPI drivers effectively disabling my DVD & CD-RW drives), you are required to \"finalize\" a disc before inserting it into your computer.The finalize process takes approximately 1 minute, and \"eats\" 13MB of your 156MB disc.  You can finalize many times, however, each finalize (even if it's only one picture) consumes 13MB of disc space.  And, be sure you don't \"disturb\" the camera while it's finalizing the disc.  ANY vibration/bump/movement will render the disc useless; I've got 2 small coasters because my cat happened to jump on the desk while the camera was finalizing itself.  Mind you, the cat didn't bump the camera - just the vibration through the desk caused it to generate a fatal finalize error (and, our cat is only 7lbs).It does have some high-points like macro mode, a relatively good f-stop range (f2.8 - f11) which makes for great low-light shooting, and it's very easy to use, hold, take along.If Sony could build some good, reliable drivers, I wouldn't be complaining about the finalize feature, as I wouldn't use it much.  However, because they don't seem to support Win2K fully (their website stinks for getting drivers from too), I'm hesitant to suggest this camera to anyone.The drivers seem to work ok on my Win98 boxes, but my webserver runs Win2K, so I had hoped to upload the pics directly to my server.Not a bad camera, but I'd consider flash card versioned cameras if I were to purchase again.", "Date": "September 20, 2001"}, {"Title": "Full features, & full flexibility for a not so full price.", "Author": "David Vohs", "ReviewID": "R3LT08X0ANO83S", "Overall": "5.0", "Content": "Wow! Leave it up to Sony to show that just as the digital camera market had just appeared to \"flame-out\", no, wait, there's still new directions to go. Though you may never use them all, this camera has every feature you ever wanted in a camera for a price that stays below four figures.My one question though: Why didn't Sony just come out with these instead of the FD Mavicas? Not that there's anything really wrong with them (they seem to come from a similar philosophy, after all), but it makes you wonder.With that out of the way: This is a great camera, well worth the price tag. I also reccommend getting the CD Mavica starter kit, primarily for the extra battery & carry case, because once you get it, you'll never want to leave it behind you.", "Date": "December 4, 2001"}, {"Title": "Very useful, excellent camera", "Author": "Ethan Metsger", "ReviewID": "R1JZGGB2QSF5IV", "Overall": "4.0", "Content": "As with all products, the use of the camera really depends on what you buy it for; as a consumer model, this is probably somewhat high end, but I wouldn't consider it professional grade. It has a rich set of features that you definitely wouldn't find on less expensive models.The CD function sold me on the camera, since I am an avid Linux user and didn't want to fiddle with attaching a USB card reader to my system. (Support for them has gotten better in the six months since I purchased the camera, but I have to admit that I'd still stick with the CD's.) The cost to picture ratio is incredibly low--you can buy mini-CD's cheaply (CD-RW's are more expensive), and they can easily hold 300 pictures each (1024x768 resolution, fine). The camera does allow you to take uncompressed images (TIFF format) if you want.As for endurance, the camera has done very well. I did drop it (from about three feet) once, which broke the UV filter I had on it. The camera itself sustained no damage (it was in a bag). The battery life is around two hours, depending on flash use, how often the power is cycled, and whether you spend more time taking pictures or looking at them on the LCD (which, by the way, is of excellent quality; Sony has done us the favor of allowing us to zoom in on the image while still in the camera, so you can often tell how well you've focused on a shot before you open it up on your computer).The picture quality is good. Not perfect, but definitely good. I bought it mostly for web work rather than printing my own shots, which aren't anything to brag about. I have found that taking pictures at 1600x1200 leaves the photos a little grainy (I run my monitor at 1024x768). Its automatic adjustments for light and distance are usually pretty good, though I occasionally mangle them a little bit in manual mode. The ability to take movies has been slightly beneficial, but probably isn't a major selling point (I've used it for some analysis in the martial arts for board breaking).Some problems can arise when taking and recording pictures, which can be a little slow. Recording to mini-CD is certainly slower than recording to a stick, and the focusing process isn't the fastest in the world. (There is a manual focus button, which is convenient.) Depressing the action button down about half way will activate the auto-focus and allow you to take the shot at the right moment, but that does take some getting used to.For people who are going to take a lot of pictures, this is definitely a camera to consider. I've taken probably two thousand of them without any difficulty since I got the camera. The resolution may not be as high as you could get in a stick model, but smaller prints should help mask that a little bit. It's a little pricey, but comes with a plethora of options that can introduce novices (like me) to manual photography without the expense or hassle of development.And, if you like the special side gadgets--TV out and a USB connection (if you even need to use it)--this could turn out very well.", "Date": "September 14, 2002"}, {"Title": "Just to simple and makes you look great...", "Author": null, "ReviewID": "RV2M6C905BD0L", "Overall": "5.0", "Content": "I purchased this camera for my wife for its ease of use and find that I'm using it more than her. Great pictures, easy menu options, simple point  and click. This is not a camera for extreme action pictures, but it can be used for everything else. I personally love the 3:2 ratio format as I print my own pictures and it makes it real easy to print. I also enjoy the MPEG feature at 640 resolution to send mini movies to my mother in-law of our 19 month old boy. Sony has always looked out for the consumer for ease and yet giving great performance with picture quality. I also like the feature for taking night picture with the light focus prior to taking your picture. I recommend this camera to anyone and everyone who wants to look good but really doesn't understand alot about camera's. Beware though you just can't take the cd out and put it in anyone's computer cd-rom without the software. This may be confusing to some, but once you know to bring the software with you, it's great to put the cd in and print. Great Camera!!!!", "Date": "May 7, 2002"}, {"Title": "Not reliable", "Author": null, "ReviewID": "R2NE0NM0760JZ2", "Overall": "1.0", "Content": "After 5 months, the flash no longer functions. Though still under parts warrantee, Sony wants (...money) just to send the camera in for repairs. This is unacceptable for such a high end camera.", "Date": "December 10, 2001"}, {"Title": "first digital camera, and WOW", "Author": null, "ReviewID": "R3VR77WQHUMCNK", "Overall": "5.0", "Content": "after talking with several people who had previous digital camera's, and months later, my decision was the mvc-cd200. What a great gift i bought for myself. This is my first digital camera and boy did i pick a good one.  This camera is the ideal camera for the every day, and more experienced photographers. It's easy to use, and the pictures are of the highest quality.The mini cd storage was the biggest seller for me. I knew i didnt want a camera that had to use memory cards, or floppy disc. I have been like a little kid with a new bicycle for the last 3 days.  What a great product.", "Date": "April 3, 2002"}, {"Title": "Great Pictures When It Works", "Author": null, "ReviewID": "RRUP5SRD2GF4M", "Overall": "2.0", "Content": "This camera takes very good pictures and has a great concept for storage that is by far cheaper per picture than most digital cameras, but it is UNRELIABLE.My camera has been broken with the same issue THREE TIMES in one year.  The issue is a bad power module.  Sony Customer NO Service was not helpful in resolving this issue the first time after I had the camera for 1 week.  It took them 6 weeks to return the camera, eating up the 90 day labor warranty and causing me to have to purchase the extended warranty so I would not have exorbitant labor charges if it needed to be fixed again.  Do not purchase this camera if you want to be sure to get pictures at those important times in life.  If you do, please have another camera on standby so you have another way of capturing the moments.", "Date": "August 8, 2002"}, {"Title": "An amazing camera, if only it was a little smaller.", "Author": "Krista", "ReviewID": "R27QES1O6P7D2C", "Overall": "5.0", "Content": "This is the second digital camera I've owned. It takes great pictures and you can store a ton of them (I get ~300 at 1200x1600) on a cd. It takes great pictures in automatic mode but being able to kick it into full manual (shutter speed, focus, aperture) means you can get pictures in circumstances that the point and click mode would choke on. The fact that you don't have to worry about uploading images off a memory card makes it the perfect camera for long trips. I took it and a couple cds to Thailand for two months and came back with a ton of great pictures. Best of all I didn't have to take a laptop or ration my picture taking. I also took it on a month long bike trip and it worked great. The long battery life and fast charge time are also strong features in it's favor. It's solidly constructed, a year and a half later it's still clicking away. One reviewer was complaining about drivers. HE IS TOTALLY WRONG! It sounds like he didn't have a USB port, you don't ever have to take the cds out of the camera. The device is a USB CD/RW drive, you plug it in and it shows up as a cdrom drive. I've used it with Win2000 and 98 and it's fine. No [bad] program to use to get the photos off, you just drag a copy off the cd and onto your computer. With a little poking you can plug it into your computer and actually burn the cds (though they are the little ones). As I said in the subject the problem with the camera is that it's just too big. The cd drive makes it a funny shape that's kind of a pain. Also the lack of an optical viewfinder [is sort of bad], it's a sacrifice to the cd drive. That said I'd buy this camera again in a minute.", "Date": "January 25, 2003"}, {"Title": "Excellent!", "Author": "Jasjit Singh", "ReviewID": "R1FEW25MZFCL6W", "Overall": "5.0", "Content": "A great camera - I have taken almost 1000 pictures with it (including my brother's wedding in India) in just 4 months. Very easy to use - my favorite toy!", "Date": "January 3, 2002"}, {"Title": "Awesome Camera", "Author": "AiLa", "ReviewID": "RE7R9C2434WO6", "Overall": "4.0", "Content": "I actually love the camera! I love how many options you have when taking photos. Even though the camera is ten years old, the pictures are of great quality. It is relatively easy to use, as long as you have the manual to guide you along. For those people who have the camera without the manual, it can be downloaded from the internet by typing \"mvc-cd200 manual\" in the search engine.The battery life is less than desirable. If you have a charger that is not very compatible with camera, (not a sony charger) or battery that is not a sony battery, the battery power will drain relatively quickly. I suggest if you can find a sony charger and sony battery,(Sony NP-FM50 Li-Ion) buy it. Though it may be more expensive than the \"generic\" or \"equivalent\" batteries, it is totally worth it. Sony NP-FM50 InfoLithium Battery for Select Sony Camcorders & Digital CamerasAs far as downloading pictures to your PC, it can get a bit annoying. The camera requires cds (Sony mavica 8cm) Sony 8cm CD-RW 3-Pack, 3MCRW-156A. The cds have to be initialized (formatted) before pictures can be taken, then the cds have to be \"finalized\" if you want to download pictures from the cds to a PC. The cds can be taken out of the camera and put into a laptop, or the pictures can be downloaded via USB connection port. If you want to take more pictures with the same cds, the cds themselves have to be \"unfinalized\". Usage of the cds is probably the most tedious and irritating part, but after formatting them over and over again, it becomes easier.The pictures are worth the trouble. Even though it is older, it is a great camera, just a great as the newest cameras now. I recommend this camera to anyone. For those that already own a camera, I would not think of selling it or giving it up, it is too valuable.", "Date": "February 3, 2011"}, {"Title": "Several years down the road, still using this camera", "Author": "noffius", "ReviewID": "RF747V1HJJPRA", "Overall": "4.0", "Content": "Overall I have been very satisfied with the CD200. A good camera with 1 major flaw. This flaw was brought up in the exchange between geekysteve and mgoril: finalizing CDs. I feel the need to to comment on this point.In my experience, you DO need to finalize the CD-RW in order to take it out and read it in a normal CD drive. You DON'T need to finalize the CD-RW in order to read it directly through the camera using the USB connection. I prefer to avoid finalizing because its a risky process & wastes CD-RW space. So this is essentailly the same situation I had with memory stick based cameras. This was always disappointing to me.When looking for a camera to buy, I preferred the CD design because I take my camera all over the place-when visiting friends, family, school, work. I thought the CD format was pretty standard. This should allow me to take out and use the CD-RWs at any computer. Just like the floppy based Mavicas, right? Wrong. I have to either finalize or set up a USB connection. I avoid finalizing for the reasons geekysteve mentioned. So what advantage does the big, clunky CD design have if CD-RWs essentially function like memory sticks?I use the USB connection with most computers. But I really don't like setting up a USB connection on someone else's computer. Occassionally you find someone who doesn't have a USB port available. Other times the USB is touchy and causes the entire system to crash. On these occassions I bite the bullet & finalize. The CD Mavica is not quite universal like the floppy models. Though it is still superior to the floppy models which are notorious for low storage space & disk errors.Portability is always an issue with cameras. If your primary concern is creating photos on a highly standardized & easy to use media, go with the floppy Mavicas. If you want more storage space and a smaller camera, go with a memory stick. The CD200 splits the difference. Comparable to memory sticks in storage space. Though it is a bit too bulky. Can be used on nearly any computer, but don't expect it to be as easy as a floppy.", "Date": "July 10, 2006"}, {"Title": "This camera is a winner!", "Author": "Julian Gang", "ReviewID": "R3VLS4PAWMXDLR", "Overall": "5.0", "Content": "This camera has my vote for one of the best cameras made by Sony, or for that matter anybody!  The largest I enlarge my pictures is 8 x 10 and it's perfect for that!  When you figure what is the size most people think of for a picture, its 8 x 10, what else!  The control of this camera rivals 35mm, and then the camera is adaptable to various filter systems.  Who could what anything else!...Julian Gang", "Date": "October 16, 2002"}, {"Title": "Not reliable", "Author": null, "ReviewID": "R1357AVPEDV1OS", "Overall": "1.0", "Content": "After 5 months, the flash no longer functions. Though still under parts warrantee, Sony wants $139 just to send the camera in for repairs. This is unacceptable for such a high end camera.", "Date": "December 10, 2001"}, {"Title": "Great !", "Author": "Deanya Martono", "ReviewID": "R3Q4YNXVPDF2OU", "Overall": "5.0", "Content": "It's great Camera. Cool, compact, smart and unexpensive ! I want it !", "Date": "December 20, 2001"}], "ProductInfo": {"Price": "Unavailable", "Features": "2-megapixel sensor captures 1,600 x 1,200 images for prints at sizes up to 8 x 10 inches\nAutofocus lens with 3x optical/2x digital (6x total) zoom\nStores images on 3-inch mini CD-R discs\nDiscs can be read by virtually all Mac and PC CD-ROM drives\nUses proprietary lithium-ion rechargeable battery(included)", "Name": "Sony MVC-CD200 Mavica 2MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/31xRR1tKK-L._SX300_.jpg", "ProductID": "B00005LVW9"}}