{"Reviews": [{"Title": "Great all around digicam, and it's truly Mac compatible!", "Author": "A. Tubesing", "ReviewID": "RZ7YP19VZGUBD", "Overall": "4.0", "Content": "I have had this camera for about six months now.  As a serious ammateur photographer for 15 years, I swore that I would still use my film camera for some things, but I haven't touched it.  I take this Sony everywhere.  This camera is a great all-around digital camera.  It is compact, easy to use, the menus and controls are easily understood, and it takes great pictures.  I was thinking about getting the S30 without the video feature instead, but I am very glad I got the video.  I really like the video feature and I use it a lot.  Below are a few major points you should consider about this camera.  First of all, no other digital camera brand I have seen comes anywhere close to the lens quality of the Sonys.  The marco (close-up) setting allows you to take a picture from literally a half inch away from the subject.  Most other digital cameras with macro settings let you get as close as a couple feet.  This means that when you can get, at closest, a full-frame picture of your whole hand with other digicams, the sony lets you zoom all the way in to just a fingernail.  Incidentally this camera also has a text-capture mode which I have used quite successfully for taking pictures of blueprints and other documents.  These kinds of images show up nicely on the computer screen.  Secondly, This camera is fully mac-compatible.  It comes with a USB cable and software that actually does work on the Mac.  When you connect the camera to the cable, it shows up on the desktop just like a drive.  The only problem I have had is when reading files right off the disc - sometimes it thinks there's a problem with the drive.  If you first transfer them to your hard drive and then view them there's no problem.   Some rules of thumb for file size:  A high resolution pic (1600x1200) typically takes about 900k, so I figure about one meg each.  The medium res (1024x768) is about 300k per pic, so I figure about three pics per meg.  These are still pretty high resolution pictures.  The lowest res (640x480) pics take about 100k each (a nice size for emailing).  That's about 10 per meg.  On video mode, the high res (320x240) takes about 100k per second, so about 10 sec of video per meg.  The low res video mode (160x112) does about 40 sec per meg.  So with the 4 mb memory stick that comes with the camera you can get about 4 or 5 high res pics, 15 med res pics, 40 low res pics, 40 sec high res video, or 160 sec low res video.  So in summary, get more memory.  I bought two 64 mb cards and they lasted a whole 4-day vacation, and I am pretty snap-happy.  The one problem that I have to complain about is that there is about a one-second delay between pushing the shutter button and the actual capture of the image.  (And I am not talking about the  wait time for writing the file, I am talking about the actual moment of the photograph)  This means that if you are taking pictures of subjects in motion you will have to anticipate the moment and push the button a second early.  If you take a lot of action shots, this camera will proove frustrating.  Often a critical moment will have passed by the time the camera actually takes the picture.  Baby pics, wedding dance pictures, sports shots, all of these are very hard to do with this camera.  For regular static subjects this is not a problem, but for objects in motion this camera is difficult.  All in all I highly reccommend this camera.  Happy shopping.", "Date": "December 2, 2000"}, {"Title": "GREAT Camera with TWO minor drawbacks", "Author": "Keith", "ReviewID": "R7MSQ7FH9KCSY", "Overall": "5.0", "Content": "This is my first digital camera. I origionally intended to purchase the Mavica 90 however when I found the Cybershot, I fell in love with the SIZE and the 2.1 megapixel. The battery life on this camera is fantastic, 2 1/2 hours. The batteries and memory sticks interchange with most of Sony's newer model video cameras. The flash works great in TOTAL darkness up to about 5 feet, after that, it's not much good. In low light, the flash works great. One fantastic feature is the screen, it is clear, sharp and when not in use, turns inward so it is protected from getting scratched ect., a definate PLUS! The screen is some what dark when shooting in low light but you can take your shot and look at it right away in \"play\" mode to see how the shot came out. For me, a minor inconvenience when shooting in LOW LIGHT. The controls are easy to figure out and after playing with them for about 15 minuites, I was ready to go. The video mode will record up to 60 seconds and the sound is really good, given the size of this little baby. Now for the few MINOR drawbacks. First, the 4 meg memory stick supplied with the camera is a joke. Plan on getting at least an 8 meg but I would suggest no less than a 32 meg. Second drawback is the Memory stick/Floppy Disk adaptor. When I purchased it, I was told it worked just like the Mavica - it DOES NOT. Without the software, the adaptor does not work, so if you plan on popping it into a friends computer to look at your pics (Like the Mavica), forget it, unless you carry the software disk around with you. All in all though, this is a great little camera. Smaller, higher pixels and cheaper in price than the Mavica. It performs as advertised by Sony and I was not disappointed. One suggestion, look at the sony starter kit, it includes a carry case, 8 meg memory stick and extra battery, well worth the money in my opinion. If you do get it, I would place a piece of foam in the bottom of the carry case to better padd the camera. Bottom line, if you have been looking at the Mavica's, look at the Cybershot 50 before you make your purchase. If you can do without throwing the floppy disk format into anyone's computer then the cybershot is better, smaller and lighter. For me, it was a minor trade off. EVERY person I have showed this camera to now wants one !", "Date": "November 13, 2000"}, {"Title": "Amazing little digital camera", "Author": "David J. Huber \"Addicted to books!\"", "ReviewID": "R3H9CMGKTC73TJ", "Overall": "4.0", "Content": "I bought one of these about 6 weeks ago as I write this, and have fired a couple hundred pictures, and a couple of short videos through it.  Wonderful! It takes great pictures, and the videos (with built-in  microphone) are pretty cool, too. While the controls seemed a little  unwieldy at first, once I pulled out the manual, I needed less than an hour  to go through the options and see how everything works, which isn't too bad  of a learning curve at all. The LCD viewer is great - I can edit and delete  images while shooting, thus saving some precious memory stick space.  I  have appreciated that the LCD viewscreen can also be swiveled around  laterally and vertically, even to point forward, so I can take a picture of  myself and, at the same time, see myself in the viewfinder.  Brilliant! The  flash does a great job of illuminating scenes.  The camera also offers  ability to adjust for white based on indoor, outdoor, or \"other\"  conditions (sounds dumb, I know, to have \"other\", but trust me,  it makes sense).  This is my first USB peripheral, and I have to say I am  impressed - I can pull down a full 32MB memory stick pretty darn quick, and  it's really nice being able to plug the USB port in *while the computer is  on*, and immediately use it without any software hassles. I have to admit  to a certain awe at Microsoft for actually pulling it off with win98.  You  can use the software that comes with the camera, but I have not, since you  will find better image handling, organizing, and altering software as  freeware, shareware, or expensive (like photoshop) professional  stuff.Another super aspect of this camera is the battery - it is  removable, but it is rechargable, and the camera comes with a DC-in jack  and it's own external power supply, so you can plug the camera into the  wall, and recharge that battery for another 2.0-2.5 hours of use.  No more  buying scads and scads of Earth-killing AAs. This is such a simple built-in  to add, and such a highly useful extra, I really have to question why every  digitial camera doesn't do this.On the downside, the viewfinder is very,  very difficult to see when outside; sometimes impossible to see.  And, of  course, please realize that this camera is a point-and-shoot (albeit a  functional one), so changing lenses is *not* an option, nor is having much  control over f-stop or shutter speed - you will have some control, but the  f-stop and shutter speed ranges are not are not what you might be used to.  I also think that, overall, its senstivity to white is not as good as it  should be - my whites tend to end up a bit grey; not much, but a bit.  But  I have to admit I dont know if that's the camera, or a problem with the  really hazy NYC days we've had and/or from shooting inside in rooms with a  mix of flourescent and incandescent lighting.Overall, I am impressed  with this camera, I'm very glad I bought it (and not a different one), and  while it is not 3 megapixels, unless you plan to make large prints of your  images, the resolution on this camera is far higher than you need for  web-image making, and high enough for anything else. It's small, easy to  carry, easy to use, easy to download, and easy to recharge. For the money,  this is, in my opinion, your best deal for a non-professional 2 megapixel  digital camera.", "Date": "August 6, 2000"}, {"Title": "Snappin Fool", "Author": "Higrpwd", "ReviewID": "R1D1DTTEP8QAXQ", "Overall": "5.0", "Content": "I've been looking at Digital Camera's for about a year now. The Sony has always won my heart because of their Great reputation and Excellent Quality!  I was shooting for the DSC-F505 which has a lot of the same  qualities as this model.  I decided to go for the middle of the road in  price and chose the DSC-S50.  I  am thoroughly satisfied with what I have  acquired!  The picture quality is OUTSTANDING!  I was used to receiving  pictures that were 1.3mega pixels.. well this blows them away!  This camera  makes details crisper and cleaner than anything I've seen before.. it's an  Excellent camera and a must-have for sharing your life through e-mail!  Enjoy!UPDATE:  I dont know who wrote this!  I've never owned this product so never wrote this review!", "Date": "July 9, 2000"}, {"Title": "Delivers the goods", "Author": "Christopher Miller", "ReviewID": "R3VX8RPW08248A", "Overall": "5.0", "Content": "The DSC-S50 is my second digital camera and I have been very satisfied with it.  It is very easy to use and has the power user features that you expect for a camera of it's class.  I use it for capturing pictures for the web and it's 2.1 megapixel resolution is more than adequate for that purpose. It comes with only 4 megs of storage, but is easy to upgrade.  Lexar noew makes memory sticks and the price is close to the compact flash prices.  I picked up a 32 mb stick and I can take about 80 pictures at the medium resolution of 1024x768.  The big drawback is the lack of an optical viewfinder.  The LCD display is very nice, but drains the battery.  It's also very difficult to see in bright daylight.", "Date": "October 2, 2000"}, {"Title": "Initial impressions of the DSC S50", "Author": "D2", "ReviewID": "R1F08DQ7QV2ADS", "Overall": "4.0", "Content": "We just started using a Sony CyberShot DSC S50, purchased from Amazon.com.The price and service from Amazon.com were pretty good, but there's still a lot to buy. Most purchasers of 35 mm point and shoot cameras expect to get a soft case when they buy their camera. Not so with the Sony. The 4MB Memory Stick that comes with the camera is essentially useless, unless the only planned use for the camera is to record low resolution images. Of course, if this were the case, there would be no rationale for buying a 2.1 megapixel camera. Expect to tack at least $100 to the price to buy the \"necessary extras.\"The camera is great fun. It's compact and easy to hold and use. The lithium ion battery charges quickly (full charge in about 2 hours) and provides sufficient power for two days or more of heavy use. The user interface is fairly intuitive and the controls are easy to use. There are several useful features (e.g. adjustable flash intensity). It's easy to get started right away, and it seems to take good pictures under a wide range of lighting conditions.The LCD viewing screen is wonderful. It is clear and bright. The lack of an optical viewfinder, though, is a problem. The LCD is tough to see in bright sunlight (though screen brightness is adjustable). Also, you can't see your subject if you are shooting at night.We've just started experimenting with the image processing software provided for the PC. It's not the easiest nor most intuitive application we have encountered and there is no accompanying  written documentation.Overall, we're happy with the purchase and (based on past volume of use of our point and shoot 35 mm camera) expect to take a lot of digital snapshots.", "Date": "December 3, 2000"}, {"Title": "Sony Comes Through", "Author": "R. Williams", "ReviewID": "R3KLTU63IHHLHU", "Overall": "5.0", "Content": "The Sony DSC-S50 may not be the cheapest digital camera you can buy, but it certainly has to be one of the best. The USB port makes loading your pictures on a computer really easy. The controls and menu layout are similar to the Mavica, so if you have used that camera then you already know how the menu system on this one works. The small size and storage capacity are what sold me on this camera. As noted in some other reviews, a viewfinder would be nice, because if you are taking pictures outside, it can be difficult at times to see the image on the flip-up screen. But those are about the only drawbacks to this camera I can think of. I have taken most of my pictures at the lowest resolution, and even then, they are still EXCELLENT pictures. I even posted a picture of a book cover on ebay, and you could read every word that was printed on the book cover. I used the Macro mode and it worked great. I have used a Kodak and Mavica (not owned) in the past, and found the Kodak to be OK, but it isn't in the same league with SONY. I also have to give AMAZON a plug here too. They gave me great service, shipping costs were reasonable, and you save at least $50 or so compared to a typical retailer. This camera comes with a 4mb Memory Stick and I bought a 16mb for additional storage capacity, and I would definitely recommend getting at least that. They are a little pricey right now, but I'm betting the price will drop in the future. Overall, this is a great camera and you won't be disappointed if you buy it. Don't waste your money on off-brands.", "Date": "September 22, 2000"}, {"Title": "Nice point and shoot with a few compromises", "Author": "\"a_mom\"", "ReviewID": "R26Q6X2N93VYAV", "Overall": "4.0", "Content": "I purchased the S50 as a replacement to my traditional 35mm point and  shoot camera.  For the most part it does a good job.  As others have  mentioned, the LCD is quite difficult (if not impossible) to see in bright  sunlight or dark situations.  The red eye reduction does an adequate job,  but I still get a lot of red eye.  The most annoying thing for me is the  shutter delay.  Even without the flash, the delay is quite disconcerting.  The time the shutter needs to be held to take a photo takes some  adjustment.  If you plan to take action shots or shots of children (who  tend to move constantly) getting the shot you want is nearly impossible.  If you use the flash in red eye reduction mode, the delay is quite long.  Since the camera is digital, it's not as disturbing when I  \"waste\" a shot, but I do get frustrated missing a shot I want  because the of the shutter delay.  However, as with an electronic device  there's a learning curve.  Once you get used to the specifics of the S50,  it's a good camera.  The 4MB memory stick is surprisingly adequate, but  I still recommend an additional 16MB or 32MB stick.  The menu structure is  intuitive, as are the controls.  The layout of the controls on the camera  are well placed, too.  The interface to Windows 98 is seemless.  The  included software has its limitations.  Rotating images yields a  disapointing loss in quality.  It's adequate for simple webpage use, but  for any serious editting there are far better packages.  The S50 is a  good replacement for my old point and shoot, but I still use my traditional  35mm for action shots.", "Date": "September 8, 2000"}, {"Title": "consumer friendly", "Author": "nitin dharwadkar", "ReviewID": "RZIZ4M25MI6P4", "Overall": "4.0", "Content": "the sony dscs50 cybershot digital camera is a much improved design on the mavica series, while giving high resolution and delivering a compact stylish case.  the resoulution is good for web pages, home photos transfer,  and comes with good editing resources.  The other advantage is the easy  storage on the memory stick and of course the adaptors make it easy to  insert as a floppy into your pc.  to summarise the advantages are:1.  good resolution 2. easy to carry 3. easy storage 4. no complicated software  5. easy to transfer onto the pcThe disadvantages are:1. The  resolution is not as good as the 3+ mega pixel cameras available today.  2. THe price is not competitive enoughi would reccomend this camera to  anyone who's starting out with digital cameras and wants a easy to  use,stylish, camera which yields above average resoultion pics by digital  camera standards.  This concludes my review", "Date": "July 8, 2000"}, {"Title": "Great Camera but.....", "Author": "Big time Amazon Fan \"Tom\"", "ReviewID": "RXUC2EXZ6MGUX", "Overall": "4.0", "Content": "I bought one of these cameras and find it to be all that the others have said. However, I find that in the bright sunlight you have trouble seeing  the image in the LCD display. It would be of benefit to have a viewfinder,  wish it did.", "Date": "August 1, 2000"}, {"Title": "Pound For Pound... A Great Digital Camera", "Author": "\"michael-l\"", "ReviewID": "RZ1GPJNZNCJ48", "Overall": "5.0", "Content": "An absolutely fabulous camera.  Better than any that I have seen thus far on the market.  Of course, you do pay a hefty price for such quality (and by this I simply mean price in dollars).  In this particular model, you get up to 2.1 megapixel resolution, which allows for still shots up to 1600 x 1200 (keep in mind, that most people view web pages at 800 x 600, so this is quite large).  The unit ships with a dismal 4 MB of memory, which can only store appx. 4 pictures of the highest resolution.  I would recommend an upgrade to 8 or 16 MB of memory, via Memory Sticks.  Other than that, the product is great, includes USB connectivity for speedy transfers of images, and even allows for full motion video (assuming the memory is available).  As a side note, please use extra caution when touching the screen.  The unit has a special Liquid Crystal display, which does a great job at displaying the images, but is easily susceptable to dust and fingerprints.  Be careful when cleaning the screen, as using a rough substance can really cause problems.", "Date": "December 10, 2000"}, {"Title": "Best camera for the money - works great on Macs", "Author": "Crazy Ed", "ReviewID": "R2FWTH23RPV5G7", "Overall": "5.0", "Content": "While there are many cameras to choose from, the Sony camera offers the most features for the money. Its a great 2 mega pixel camera, that has a VERY nice LCD screen (one of the best I've seen). The MPEG feature will not  be useful to most, being that it is very low quality, but it's nice to  have. Make sure you have a good printer to go with the camera (this is the  case for any digital camera)!The camera comes with everything you need,  cables, battery, software, and 4MB memory stick which suprisingly can hold  a pretty good amount of pictures. I would get the extra 16MB memory stick  as well... With the 4MB and  16MB memory sticks, you'll be set for any vacation.Because it is USB,  all you have to do is copy two sony extensions into your system folder and  the camera is ready to work on your MACINTOSH. Just plug it in and you can  read/delete from the sony memory stick as if it was a mounted drive.", "Date": "August 17, 2000"}, {"Title": "Excellent companion to the Sony Digital Camcorder Series", "Author": "mikecube \"mike\"", "ReviewID": "RCHWMLAR6UBR3", "Overall": "5.0", "Content": "Since my purchase of the Sony DCR-TRV10 camcorder earlier this year, I  found that the 640x480 resoution wasn't enough for all of my digital  imaging needs.  The CyberShot DCS-S50 not only takes excellent pictures on  it own, but is an excellent companion to this digital camcorder.  The  memory sticks are interchangeable between the Camcorder and the CyberShot.  Since the DSC-S50 has higher resolution capability I can take my still  images stored on the Memory Stick from the camcorder and increase their  resolution with the CyberShot without having to first download them to my  PC.  (keep in mind that your Sony Memory Stick must have enough space to  add these higher resolution images, also remember, high res. means higher  memory consumption) These two products also share the same rechargeable  battery pack, lens size (.37mm), memory sticks and recharger.  Since my  earlier camcorder purchase, I have aquired more Memory Sticks and after  market zoom and wide angle lens.  All of these devices are  interchangeable.The main reason that I didn't go ahead and purchase the  DCS-S70 (3.3 Megapixel) was the incompatibilty between lens and sizes.  This DCS-S50 (2.1 Megapixel) made a lot more sense once you weighed in the  interchangeability factor.I am pleased that this manufacturer decided to  maintain this compatability an allow me to enhance my digital photography  collection.I also agree with some others and wish it had a supplemental  fixed view finder like the DSC-S70, for bright sun and very low light  occasions.  But all in all, I believe it is an excellent digital camera  value.", "Date": "August 9, 2000"}, {"Title": "Great camera, all the features you need and easy to use", "Author": null, "ReviewID": "R1UR6YVSEF4MYP", "Overall": "5.0", "Content": "After looking at camera reviews for over 2 months I finally settled on this one.  This is my first camera and I must say that I'm really happy with my choice.  It seems it's hard to find a camera with all the features you want but this one had the most features.  What was important to me was a rechargeble lithium battery with good life and Sony is the only one I know of with the info lithium technology, included AC charger, MPEG movie capable, optical zoom, ease of use, customizable functions, USB connectivity, and of course picture quality.  With other cameras it seemed like you had to buy rechargeable batteries, a charger or they don't have USB support which is a must these days.  My only complaint is that it only comes with a 4mb memory stick which is not very useful but I bought a 16mb stick with it that turns out to be free with a $50 mail in rebate.  This is a great camera and I highly recommend it.", "Date": "January 9, 2001"}, {"Title": "User Friendly", "Author": "Shanna @weebritches.com", "ReviewID": "RXDBQJ2OU2UUQ", "Overall": "5.0", "Content": "I bought this camera for my internet children's clothing business.  I was originally using an FD-73, but needed better resolution that this camera supplied.  With the Cybershot, you can choose you desired resolution.  After careful consideration of the FD-85 for its convenient floppy drive, I chose the cybershot.  A decision that I have not regretted.  The rotating lcd screen is a great idea and safeguard against breakage.  We actually cracked the screen on the previously mentioned camera while it was in its camera case in a suitcase during a vacation.  I have been very pleased with this lightweight camera's performance, user friendliness, and versatility.  However, my shopping list now includes a 64MB memory stick.  The 4MB stick included with the camera holds only 4 pictures in the highest resolution.", "Date": "November 4, 2000"}, {"Title": "All around GREAT camera", "Author": "\"jadedtim\"", "ReviewID": "R33FJ629NWM059", "Overall": "5.0", "Content": "Quick facts about this camera: It's light, battery life lasts roughly 3 hours of straight use, and the 4MB Memory Stick supplied is decent. The user interface is so simple I NEVER had to get the instructions. There are so many personal tweaks you can adjust to the camera (white balance, black and white mode, timed exposures, 10 second timer, great zoom lens, macro mode... the list goes on!). The movable LCD screen is crisp and is very convenient to use. The camera feels solid and well-built.I personally bought a 32MB Memory Stick to gain more picture storage- this camera can now take 80-90 pictures at 1024x768 resolution. Also bought the Floppy Disk Adapter... but stick with the USB if you already have it on your computer. Also, one side note- this camera will be able to link to your Sony Playstation2 video game console in the future!", "Date": "October 18, 2000"}, {"Title": "Sony DSC-S50 CyberShot Digital Camera", "Author": "L", "ReviewID": "RTHOKUURNE05T", "Overall": "3.0", "Content": "As mentioned in previous reviews, if you want higher resolution pictures, the 4 MB or 8 MB memory sticks are not adequate.  I could only get 4 pictures on the 4 MB memory stick.  You are now able to purchase a 64 MB memory stick, which will be much better for long trips and using the movie function. The pictures look great on-line, but you have to have a good printer to go along with the camera if you expect to print pictures.The information available at the Amazon.com site regarding how to select a camera is very helpful and explains a great deal of information that the will not be readily available at your local computer store selling digital camers.", "Date": "November 21, 2000"}, {"Title": "Excellent Camera", "Author": "\"enano69\"", "ReviewID": "R1DZEXVTSBJAMJ", "Overall": "5.0", "Content": "I purchased this camera after looking at a lot of different cameras. I was really impressed by the image quality, and the lithium-ion battery. The main complaint consumers have about digital cameras is battery consumption (I work as a tech-support agent for a digital camera manufacturer and field calls from customers on battery issues daily). The battery, the image quality, and the SONY name sold me on this excellent camera. The small memory stick that was included was a downside, but overall I am very happy. Getting the photos to the PC is very straight forward with no extra software to complicate things - you save images directly off the memory stick as if it were a floppy disk or CD-ROM disk through windows explorer. Easy as pie.", "Date": "May 25, 2001"}, {"Title": "Great Camera", "Author": "John Lane \"johnlane\"", "ReviewID": "R1J4OCY3NGZK9F", "Overall": "5.0", "Content": "Believe it or not, I have taken over 6,000 photos with my Sony DSC-S50 over the past year.  I absolutely love this camera.I researched all cameras well, and for the price, I found this one to be the best buy.  The lithium battery adds alot to the camera.", "Date": "June 9, 2001"}, {"Title": "My first GOOD digital camera.", "Author": "Randy Jones \"Radio Randy\"", "ReviewID": "R1HZ6XAMFV71KF", "Overall": "4.0", "Content": "First, there was the Kodak DC-20...YUK! Then the Polaroid PDC-640...you get what you pay for. Now I have a Cybershot and am finally happy!I purchased this camera mainly because I couldn't get decent resolution in photos I use for computer wallpaper. This camera exceeded my wildest expectations.The download times, with the USB cable, are like Warp 9 vs. 1/4 impulse power from the Polaroid's serial interface. Battery life, WITH the LCD screen beats the pants off the Polaroid, I used to only shop for cameras that took alkaline batteries (I won't even talk about the Kodak, a BAD experience). The ability to add verbal notations with your pictures has been invaluable in my job. I think the only way to get (noticeably) better photo resolution is to spend another $1000 or more.The downsides are, of course, the 4 meg memory stick...lack of a carrying case...delay of shutter release. I won't call the lack of an optical viewfinder bad...the view through the one on my Polaroid never looked like the finished picture.All in all, with the addition of (at least) a 32 meg memory stick AND a decent carrying case, I have an excellent camera for many enjoyable years of photo opportunities.", "Date": "December 19, 2001"}, {"Title": "Most Consistent Cam 6 yesrs later!", "Author": "JimH \"JimH\"", "ReviewID": "R99VCSZ7UHC12", "Overall": "5.0", "Content": "This was the first digital camera I ever owned and I stumbled across the amazon page for it and realized I never wrote a review for it, and it certainly deserves the glaring review I'm about to give it.I own 3 other digital cameras now that I have bought for various reasons (smaller, slr capabilities, large (3.0\" viewfinder) ) and while I am happy with them, none of them deliver more consistently impressive pictures in any surrounding you can think of like the Sony DSC-S50 does.What I am most happy with when it comes to this camera is its night shots. It takes amazong low light shots, I have taken so many incredible pictures at concerts and outdoors (las vegas) with it.The viewfinder is an incredible feature that guarantees perfectly framed self portrait shots, overhead shots, waist high shots, basically you can take a picture from an angle high or low and frame it perfectly because of the viewfinders ability to rotate.Now 2-megapixels isn't the greatest six years later, but I have printed and framed many 5x7's and even 8x10's from this camera (and other megapixel cams) and been very happy with their results and visitors to my home have always asked what kind of camera I took them with and are shocked it was with my trsuty six-year old 2 megapixel S-50.It is a little bulky by todays standards, but it is VERY durable. I have dropped and knocked around this camera for years and it still performs like new (save for one little plasitic knick near the arrow keys that doesn't effect functionality at all).The camera comes with one batterie and when I purchased it originally I bought an extra camera. To this day, they hold a very long charge and sonys battery feature that tells you down to the minute how much time is left on the battery is an incredible feature.The video clips can only record 15seconds at a time (with audio too) but I've fond that is just long enough for a fairly brisk \"happy birthday\" song!I cannot reccomend this camera enough for overall picture quality, functionality, eas-of-use and espeically for those on a budget. Memory Sticks in a suitable capacity for this camera are dirt cheap, and the camera itself is very affordable now.", "Date": "November 26, 2007"}, {"Title": "A retrospecitve review", "Author": "Nona Suomi", "ReviewID": "R2T57O98B9LUO1", "Overall": "5.0", "Content": "It's now obviously long after this piece of antiquated hardware's life cycle, yet here I am writing a review for it. Why? Well read on to find out what's so special about this old Cybershot.In short, this thing is built like a brick. It has hung around for nearly a decade of constant use and abuse at my hands, and it's still kicking. I can't count the number of times I've forgotten to put on the oh-so-useful wrist strap and watch this camera fall three or more feet to hard concrete, only to pick it up and keep on going like nothing had happened.Its 2.1 megapixels are certainly low-end by now, with even my shiny new cell phone's camera outdoing it with a 3.2 MP built-in camera, but there's no beating having a full-size camera when you're taking photos. And besides, unless you plan to make literal wallpaper out of your vacation photos to Sea World, what's the big deal with having 6+ megapixels anyways? Proper composition beats computer editing any day in my book- you can't use Photoshop to change the fact that Dad sucks at taking photos, you can only make it less apparent...The LCD display is both a blessing and a curse- it's great to have a backlit display preview, but the lack of an optical viewfinder makes it a pain to set up shots in bright light. The single best thing about the screen though is the free rotation. I have yet to see another camera with this feature, and until I do I plan to keep this thing handy. Even when you aren't using it to take shots, it's useful since you can turn the LCD inwards, preventing any damage to the screen while the camera isn't in use, which has been the death of so many of my sister's newer cameras.The battery life on this thing has been great for me. I have not replaced the original battery, but still get over 120 minutes of use out of the InfoLithium M battery that shipped with it, not including any excessive use of the flashbulb.It's got a decent set of built-in controls, considering it was designed as a point-and-shoot camera. There's a number of effects to apply pre-shot, as well as brightness sensitivity, focus, etc.The Memory Sticks this device is capable of come in sizes up to 128 megabytes (I have not had any success in getting it to accept anything more recent such as the ProDuo line) but today you can pick up boxes of the 128 MB sticks from online dealers for next to nothing, so you'll never run out of storage space. On top of that, it takes quite a respectable number of photos (or not so many MPEG videos/voice recordings)  to fill up single 128MB memory stick, so you won't be swapping out the card every five minutes unless you're taking photos about once every two seconds.Seriously, the mere fact that this camera still gets the job done nearly ten years after its initial release says something about the quality of it. If Sony were to make their current cameras with this durability I might consider buying one.Bottom Line: If you could find this camera for sale new today, and didn't mind the low resolution (or trying to find working Vista drivers...) then definitely go for it.", "Date": "July 17, 2009"}, {"Title": "Excellent camera even years later!", "Author": "usaf_drew", "ReviewID": "R2M3LCZQO2JTM0", "Overall": "5.0", "Content": "I'm just now writing this review after I bought this camera used on Ebay and years later.  I have nothing but great things to say about it...- It has held up through the worst abuse with me.  Even survived a few concrete drops.  Construction is awsome.- Optics are great.  I can get about 5in from an object before it gets blurry; and that is enough to get fine print off of something in great detail.  Zoom control is great once you get the hang of it.  Moving objects are usually no problem and you do not have to hold the camera extra-steady to aboid blurring either.- Colors are vibrant in most any light source.  I rarely have to mess with the brightness/contrast in PShop.  I don't know how, but image quality rivals 5 MP cameras that I've used.  I actually bought a Casio Exilim 5MP and resold it right away to stick with this.- Swivel LCD is useful for personal photos.  No dead pixels or problems with the LCD after years of USE!- Aftermarket batteries are $10 and work great.  Original used battery lasted 2 yrs.Might not be worth >$100 these days, but definitely close!  One thing's for sure, you definitely won't be the least dissapointed.", "Date": "December 17, 2006"}, {"Title": "Just Right...", "Author": null, "ReviewID": "R3Q06MBVBFEK1L", "Overall": "5.0", "Content": "My dad was the one who first bought this Sony Cybershot. At the time he used it a lot but now he's letting me have a go at it. The zoom is phenomenal and the 2.1 MP resolution is perfect, and allows the photos to be crisp and clinical. It can take reasnable MPEG movies and is very simple to use. Downloading the pictures onto computer proves to be quick and simple. The LCD screen is flexible allowing you better photos from awkward positions. The only small draw-back is that the shutter takes a bit too long too catch a fast moving object such as a bird. This camera was a really pleasent experience for me!", "Date": "April 20, 2004"}, {"Title": "I Love This Camera!", "Author": "MacDoodle", "ReviewID": "R3KRBPLXKETVT5", "Overall": "5.0", "Content": "As an amateur photographer and freelance web designer, I've always been particular about the quality of my photos as the camera captures them - and how well they will translate for web use. I'm as particular about my digital cameras as I am about my film cameras. This camera is my third digital camera purchase in 4 years, and I'm FINALLY happy!The quality of the images for both print and web use is excellent! (Hint: Jump on the Ofoto offer - it's well worth it!) The ability of the camera to go up to large formats - 1600 x 1200 - gives you the ability to print up to 20\" x 30\" photos. The 72 dpi assures you that there will be no wasted file size or web space when used for the web.Even though this camera is lightweight and compact, it has the power to get incredible focus and detail on small objects as well as larger objects caught with the 6x zoom - tripod suggested for zoom photos, as it would be with any other camera. I don't like to leave the house without a camera, but don't always want to carry my bulky cam bag with me - The Sony DSC-S50 is the perfect size to drop into my purse or briefcase!The filter effects let me shoot the same scene in several different modes - B&W;, Sepia, etc. This is a nice feature for artistic experiments, but a little cumbersome in getting there. Effects reset to standard mode when you shut the camera off, which can be annoying when trying to compose and focus while using filter effects.Sony could have cut the price of the camera (or included a larger capacity Memory Stick) by not including the MPEG movie feature, and some of the filters. The MPEGS are nice, good quality, but limited on time/size when using a smaller size Memory Stick and IMPO, don't need to be on a still camera. Best advice I can give for this camera is order a 32mb or larger Memory Stick when ordering the camera. The 4mb stick that comes with it is useless if shooting large size images.Yes, the camera is totally worth the price! Buy it!", "Date": "March 10, 2002"}, {"Title": "Great Camera", "Author": "E. Gonzales \"themightyed\"", "ReviewID": "R3R2794RFNOCCO", "Overall": "4.0", "Content": "I have had mine for over a year now and it still works great.  It comes with a good long lasting battery the NP-FM50.My only complaint is that the included memory stick is only 4MB.  At high resolution (1600x1200) you would only be able to take about 4 pictures.  I bought a 64MB stick the very same day and have had great success.", "Date": "January 1, 2002"}, {"Title": "Great photos - better than a film camera!", "Author": "Country Music Man", "ReviewID": "R3C3DYHE6VDG4U", "Overall": "5.0", "Content": "I think this camera is really great. It takes excellant photos, the resolution is plenty for most any photos, and I like the display that flips up and turns 180 degrees so you can take your own photos (the new Cybershot models don't do this). The MPEGs with sound are really cool and everyone I have shown this too has been amazed that it takes videos with sound. The display is sometimes difficult to see in bright light, and it does not have a viewfinder, but I seem to adapt to this limitation without any problems. I like it more than most other brands of digital cameras and the memory sticks are priced right and hold a lot of photos. I bought the memory stick floppy disk adapter and it makes it easy to read the photos even though the USB interface is really simple to use also, if your computer has one. Just plan to have a CR-RW drive so you can save your photos and clear off the memory stick for taking more. It puts the time and date on your photos for recording when they were taken right on the print, which I have heard most other digital cameras don't do this. It is the perfect size, not too big, and it takes photos that make me look like a professional. I have taken beautiful sunsets that the exposure would not have been right if I had taken them with a 35mm camera. The menu system is great, and the camera has a large display (larger than the new Cybershot models) and a way to flip it around so it is protected from being scratched. I really like it and recommend buying it over the new equivalent model.", "Date": "December 20, 2001"}, {"Title": "Fantastic Camera With a Few Flaws", "Author": "David Marshall", "ReviewID": "R2OHE7M932GEAE", "Overall": "4.0", "Content": "This is the first digital camera I have owned so I can't compare it to others, but this one does most of what I want to do and more than I actually use. I bought it because I, in a strained sense of scurry, drove 200 miles to see my first grandchild and left my 35mm camera at home. I had seen reviews before purchasing but weighed all the options before buying this one. The zoom is great for a small camera but not like a 28-210 Kiron. The ease of use is fabulous for a point and click buff but includes helpful adjustments for lighting, various resolutions, and more. Short video clips of the new \"Princess\" are priceless. Relatives enjoy viewing the \"day's catch\" with the slide show feature. Takes fantastic pictures that I print using my home computer or upload for professional printing. A few flaws I've seen mentioned (...) on which I concur: 4mb memory stick takes 4 pics at 1600x1200, not very useful. I bought 2 64mb sticks (aboout 80 pictures each). I tend to keep almost all of the pictures I take until I've had time to review closer so I won't delete pictures I wish I had back. LCD screen is very hard to see in bright sunlight and since I like the sun to my back and not to the subject's back, well, you get the picture (pun intended). You cannot see subject on LCD at night without lighting assistance. Works best inside, but takes great outdoor pictures if you can frame what you're tryng to photograph. I'm sure more expensive cameras will do more (and they're all over-priced), but for the comparative price range, this one is great.", "Date": "December 18, 2001"}, {"Title": "Definitely easiest-to-use camera!", "Author": "Amazon Customer \"scarface@bezeqint.net\"", "ReviewID": "R1M1ROW95KYASE", "Overall": "5.0", "Content": "Have seen a lot of digicams, but this one (or DSC30 or DSC70 for that matter) beats all of them with it's user-friendly controls and computer interface. Really, as someone has already said here -- I never had to take out the manual....", "Date": "May 19, 2001"}, {"Title": "Pictures great", "Author": "Pete", "ReviewID": "RSR5T4RH0B7PX", "Overall": "5.0", "Content": "I had one of these Cameras and The first time I took a picture with that one ,I ws stunned by how it came out ,That 1 got ruined by accidently getting wet ,so searched for another and it does great Job taking pictures", "Date": "January 6, 2013"}, {"Title": "Over a decade and still outperforms", "Author": "Lee", "ReviewID": "R2HJFQFR3BMRR9", "Overall": "5.0", "Content": "Bought it new in 2000 and at the time digital was just getting hot. For 900 bucks today you can go buy a dslr. But 12 years ago this was hot. I will honestly say after working with many many different cameras this one still blows away most point and shoot. Now there are reasons and some flaws. No viewfinder just a screen. 2.1mp can be found on anything now but the lens is what really makes it. The macro mode is better than ANY point and shoot I've ever used period. I can get 1/4\" away and it'll still focus with a super sharp clear picture. I've tried a $1,200 point and shoot macro and it was put to shame. The guys at the camera store literally couldn't believe their eyes. Battery life of 2+ days, seriously that is just great. For 50 bucks there is no reason not to put this in your arsenal of gear. The macro alone is worth the 900 I paid.", "Date": "February 16, 2012"}, {"Title": "11 years, a love story", "Author": "Valerie Bronson", "ReviewID": "R1TBS2BPQYJVW3", "Overall": "5.0", "Content": "I bought this camera 11 years ago. It has taken over 100,000 pictures for me and I use it everyday. I am an eBay power seller, and I have never had the need to buy another. I am still blown away by some of the close up pictures I have taken with this little gem, and will prolly buy one on eBay if this little work horse ever dies.", "Date": "June 15, 2011"}, {"Title": "This Camera weathers well when compared to today Digitals", "Author": "C. Striemer", "ReviewID": "R23YXBZIJ4G1E5", "Overall": "5.0", "Content": "I no longer own this Camera, having at the time purchased what I thought was a better new camera.  That new camera still doesn't shoot as good of pictures as this Sony.  I took the this on my backpacking trip to Europe in 2001 and most of the pictures were incredible some were even poster quality.  Unfortunately it is only 2MP so there's no way it would print poster sized prints but the quality is there.  I miss my old Sony Camera, so I have recently upgraded again to a new Sony HX1, here's hoping todays top of the line Sony P&S; matches the quality of its way back predecessor.", "Date": "July 7, 2009"}, {"Title": "Big & Old, but Great", "Author": "Click Away", "ReviewID": "RYQCNCQ9NN6Q0", "Overall": "5.0", "Content": "I bought this camera used and have been pleased in every regard.  It takes crisp, clear pictures.  The flash is strong.  The battery life is excellent.  Unless you plan to enlarge your photos to 8\" x 10\" (and would need more pixels), I recommend this camera whole-heartedly.Last week, I used a friend's adorable, new Olympus Stylus Verve and I couldn't believe the difference in photo quality.  This old Sony takes pictures 100 times better.  It's also very easy to use, has a large LCD display that rotates--so you can turn it inward when not in use (protecting the screen) and you can take pictures of yourself without any guesswork.It's a great camera.  Grab one while you can.", "Date": "April 22, 2005"}, {"Title": "Better than SONY DSC-S70 Cybershot", "Author": "EXIT90210", "ReviewID": "R2FFRMZZBT6U0", "Overall": "5.0", "Content": "Bought this camera for my brother and DSC-S70 for myself, I just loved this one more than mine(DSC-S70)for which I evantually paid almost $250.00 more. It has all simple and great features and even my 9yr old son operates it like a pro. I like the LCD on DSC-50 cause it's more protected from scratches and picture quality is not different than DSC-70 on even 8 X 10 size prints.  I strongly recommand DSC-50 over DSC-S70(or on anyother 2 or more megapixel digital camera), for the pic quality, ease of use & price.", "Date": "May 7, 2003"}, {"Title": "ew", "Author": "Holly", "ReviewID": "R2PO6KAYU3XZVD", "Overall": "2.0", "Content": "Cheap, bad quality photos and it doesn't even come with a cable to plug it into your computer. Also the video only records for 1m at a time. Save your money and use your cell phone camera, my bf's was better quality by comparison, not to mention more MPs.2 stars because shipping was fast.", "Date": "July 18, 2013"}, {"Title": "overall bad (lemon)?", "Author": "steve k", "ReviewID": "R3TWDPAD3HB90S", "Overall": "1.0", "Content": "This was my first crack at a Digital Camera. I read reviews and different articles rated this product well. None of the pics I took with this camera turned out well. There were white blotches on the photos and the pixels actually showed up as little squares on the photos. Luckily I bought the camera at Sears and they were really good about taking it back. Only good thing about the experience was Sears has me as a customer for good.", "Date": "April 19, 2001"}, {"Title": "The good and the bad", "Author": "\"dabookie5723\"", "ReviewID": "R3LM4X21K9VGD7", "Overall": "3.0", "Content": "The good news is this camera is packed with alot of great features and is extremely simple to use.  The LCD screen is the best I've had the privledge of viewing.  Also, the screen twisting capability makes it really easy to compose regardless of subject position.  The on screen display and joystick control make it a snap to navigate between options.  The picture taking is fast compared to other cameras I've used that have a 2-3 second delay.  Also, power on and zoom is fast.  The battery life is fantastic for a digital camera.  At this point, the perfect camera for me...Unfortunately, the bad makes this camera completely useless for me.  The pictures are awful, even though others have written good reviews.  At first I thought it might be user error, so I went through all the manuals, tried a bunch of different settings, took flash and ambient light pictures... all had the same result...  dark pictures and lacking definition.  So, then I thought it was the camera so I exchanged and got a second one -- same thing.  I'm returning this camera tomorrow for good.  The Kodak DC290 has a relatively short battery life, a mediocre display and is slow, but takes amazingly beautiful pictures with perfect color rendition.  I'm staying with it...  If Sony could get better picture quality it would be the perfect camera for my needs.", "Date": "October 24, 2000"}, {"Title": "don't use", "Author": "Chadwick H Young", "ReviewID": "R1N81JOQY545OH", "Overall": "5.0", "Content": "I have this product and i don't use it ... it just sits beside my computer ... i'm not even really sure why my parents got it for me ... but if someone wants to buy it from me ... email me at c-young1@northwestern.edu", "Date": "February 1, 2001"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B00004U3AW"}}