{"Reviews": [{"Title": "Skepticism overruled", "Author": "perfectagain \"perfectagain\"", "ReviewID": "RD205L3JX1MBA", "Overall": "4.0", "Content": "I am a serious amateur photographer with professional training and own serious digital and film equipment, including film Leicas.  My wife wanted me to buy this because it looked cute.  It does and it is.  After reading the reviews, I thought all I was getting was \"cute.\"  But having used it both in decent lighting conditions outside and severe natural light conditions inside, I am impressed and my skepticism has been overruled.This is not the equal of a good Canon, or other brand of point and shoot with a zoom lens, ISO adjustments, image stabilization, etc., much less a digital single lens reflex.  That should be obvious.  And if I were buying one camera for general snapshot or travel use, this would certainly not be it.I think of this as a \"fun\" camera for someone who owns a decent general purpose camera, point and shoot, or better, film or digital.  It has given me some very decent photos which I have printed easily to roughly 8\" x 8\".  Add the cute factor, the fit in your pocket factor, the conversation piece factor, use it with an SD card, and I like it -- a lot.You should be aware that as delivered, the battery must be charged off your computer.  However, it uses a very common battery used in Nokia phones, a BL-5B, so replacement batteries are easily available and so are standard wall current chargers.  I have ordered both, but have not received them.  This should improve the utility.Finally, if you believe in lens caps to protect lenses, as I do, you will find that the top of a 35 mm film container with a little tape or something to slightly reduce its diameter will work reasonably well.", "Date": "December 12, 2008"}, {"Title": "It is a toy. Get it?", "Author": "Dr. Hoenikker \"drhoenikker\"", "ReviewID": "RNJT8I1RNO7KI", "Overall": "5.0", "Content": "I am amazed at the number of negative reviews here that come from people that, incredibly, thought they were buying a \"serious\" camera. People, look at it. Read the specs. Go to the nearest store and hold it in your hands. This is a toy, meant to be bought for its looks. It is the cutest thing ever, it will make you the center of attention at any party. And, to top it all, it can even take pictures!But if you expect the quality of the pictures to be the same as from a similarly priced Canon... seriously, you need to have your head examined.", "Date": "March 31, 2008"}, {"Title": "Fun, little camera", "Author": "Steven P. Goldberg", "ReviewID": "RAY57EQDG7DB4", "Overall": "4.0", "Content": "Fun reproduction of the old Leica \"spy\" camera - low end digital capabilities, but functional enough to throw it in  my pocket and take candid snapshots.  Anyone expecting a full function digital camera would be disappointed however", "Date": "January 13, 2008"}, {"Title": "Nice miniature", "Author": "EJG \"Joaquim\"", "ReviewID": "RP60IKMWCUZ18", "Overall": "2.0", "Content": "I was hoping for a better camera for its price.  You are paying for the pure nostalgic miniaturization of a classic camera.  My old 2.0MP Sony takes better pictures.  The camera is an attention getter, though.  People are amazed by the exterior detail and its size.  However, it has the feel of a plastic toy.  The SD card is hard to remove because you feel like you're gonna break the door that covers it.  The picture quality is adequate, except they have a bluish hue which is correctable with any basic photo-editing software. Comes in a great wooden box!", "Date": "January 7, 2008"}, {"Title": "All said and done, I like my mini Leica . . .", "Author": "see jane read", "ReviewID": "RRMWHAAUXTTOB", "Overall": "3.0", "Content": "I like it because it's fun to pull it out of my bag and take a quick picture. I don't keep it as a conversation piece, I'm a camera lover and get a kick out of it, it's as simple as that. I have grown-up cameras in addition to this mini that take better pictures, but I like the size and weight, it's easy to keep in my bag for quick pictures when I'm running around town. I'm not one for cell phone cameras, so this is a good compromise. The pictures are grainy when blown up, but sometimes I like that effect. The colors are sometimes wonky, esp. the blues (too blue), but I also like that effect at times, it can be accidentally beautiful. It's not extremely well-made. I keep a small piece of duck tape over the memory card door because it kept popping open. Also, the little rubber cover that protects the socket for the USB cord keeps popping open. Minox could improve these things in future versions (are you listening Minox?). Is it overpriced? Hell, yes. This camera is a personal thing, you'll know it if you need it. People who are skeptical or wondering should probably pass on it.(Oh, and I have the flash. It works. It gives off some pretty harsh light, but if you shade it just right with your hand you can get some decent indoor pictures. The flash is a huge attachment, tho, bigger than the camera itself, kind of awkward and funny.)", "Date": "November 11, 2009"}, {"Title": "just for fun", "Author": "Wong Ka Ho", "ReviewID": "R1IIHO5REJZ90Q", "Overall": "5.0", "Content": "the size is small enough. The package is strong and safe for transportation. The quality of image is just acceptable. Just for fun only.", "Date": "April 4, 2009"}, {"Title": "BitterSweet", "Author": "Amy Mcintyre", "ReviewID": "RVHXJRUO7G1VI", "Overall": "3.0", "Content": "The camera was lovely, for all of 8 photos before the shot button became stuck :(The camera is a jewel, very sweet and beautiful - the pictures we did get to take turned out lovely. We were very sad to have to return it.", "Date": "January 19, 2009"}, {"Title": "Cute...but image processing a little disappointing...", "Author": "DavidJ", "ReviewID": "RKP2BE9TEC7IN", "Overall": "3.0", "Content": "I have Leica and Minox cameras.  Of course, both have excellent optics.  So when I saw the little M3 package by Minox, I thought I'd have some fun with this little jewel.  The image quality is fine, as expected, but the digital image processing seems quite grainy.  Some work here will yield a much better product.  A little surprised and disappointed.", "Date": "March 26, 2009"}, {"Title": "Fashion statement and OK camara!", "Author": "A. Teutli", "ReviewID": "R3FNHVOCW5I7OH", "Overall": "3.0", "Content": "This item is more of a fashion gadget than a professional Leica. The pictures aren't so bad, just keep in mind it is a 5 megapixel camera. But perfect for facebook pics! And its so small that you can take it everywhere!", "Date": "July 30, 2009"}, {"Title": "More Toy than Camera", "Author": "Ian J. Wade \"Chuck\"", "ReviewID": "R2MW4CJ2VT0QO3", "Overall": "3.0", "Content": "If you want a camera that is going to give you amazing pictures with incredible detail, THIS CAMERA ISN\"T FOR YOU.This camera sells because of the nostalgic effect it has on people not because its a great camera. Minox could do a lot better, and I'm thinking about going to Wetzlar and talking to them next week....Maybe the camera would work better with a Flash?, although I'm not sure it will, and I'm reluctant to buy anything more for this toy.If you don't want to carry a hulking camera everywhere you go this is AN option.The only luck I had was that I didn't have to pay the full 200 some euros for it, since this was the display model directly from Minox I only paid 66.50 Euros, (including shipping and 19% Tax)still a little much for little more than a toy.", "Date": "October 22, 2009"}, {"Title": "when you want to own a leica.", "Author": "Matt the Photographer", "ReviewID": "RNI2Z96O2US0N", "Overall": "5.0", "Content": "ok first off dont think this is a real camera.  its not a point and shoot its not a cheap leica alternative.  this is a functional novelty item.  its tiny and fun and a collector item.  its like a toy for big kids.  or maybe a toy for little kids.  this would be fun to give a small child to learn on.  there is no practical reason to own this camera.  its not going to give you great pictures but it is going to give you pictures and thats something.  i honestly find all leicas to be novelty items (omg i could get shot for saying that).  dslrs are faster and more usable in every way.  its like owning a super car.  the ones that arent street legal and are not race legal.  but they cost a million bucks.  a kia would be more useful as far as practicability. but if i had the money you bet i would buy one.  if i had the money i would probably buy a real lieca to play with. M9 is 7000 a leica lens about 3000. thats 10,000 for something so greatly built and not super functional. so as far as i am concerned this can be compared with a M9.  but for the not so rich guy.  if your rich you own a leica but you also own a real pro dslr with pro lenses that you use when you need quality and speed. but for your personal fun you whip out the leica and show off to your friends that you own a leica.  sense i cant afford a real like like the M9 or even an old film Leica or even the cheapest Leica lens.  but this guy yeah i can afford it.  its not my canon 7D or my Fuji X100. buts its a leica and its awesome.  it looks cool cuz its a leica and takes pictures.  some say its not as good as a cell phone camera and i would disagree... just depends on the cell phone lol.ok this is a fun camera.and before i get all the hate mail about comparing this to a leica M9. i would own a M9 in a heart beat and i know they are awesome.  this was meant to be a fun review as this is a fun camera.cheers", "Date": "February 21, 2012"}, {"Title": "Unique Camera", "Author": "P", "ReviewID": "R2CZGO5BCN30I3", "Overall": "5.0", "Content": "The MINOX DCC Leica M3 5MP is a wonderful concept.  Don't purchase it expecting Canon or Lumix point and shoot characteristics.  Purchase it because it's fun. It has a unique visual quality that can be viewed on any number of internet sites.  The images are distinctive.  I shoot professionally and own large, medium and small format equipment.  I may not use this camera very often, but I love having it around.", "Date": "April 15, 2010"}, {"Title": "Just a toy:-)", "Author": "Ronny Karlsen", "ReviewID": "R2QH69HA318IO6", "Overall": "2.0", "Content": "I bought this camera just as a fun toy. It is not recommended if you want to buy a camera with good picture quality. Buy it as it is, a retro camera with poor image quality.", "Date": "February 23, 2010"}, {"Title": "Nice miniature toy camera", "Author": "J.J.", "ReviewID": "R83I6TH20YDSL", "Overall": "3.0", "Content": "but not digital camera quality pictures but looking soooooooo good so happy with it :)", "Date": "November 18, 2009"}, {"Title": "Best image quality for it's size.", "Author": "C. Costa \"Nikon & Apple Enthusiast!\"", "ReviewID": "R1JKS7IS4LZW25", "Overall": "4.0", "Content": "This is not meant to be a serious camera for serious use.  It's what you would call a \"toy camera\", like the Hipstamatic camera from the 80's.For it's diminutive size though, it's got pretty good image quality. You won't find another camera this tiny that takes photos as good. Another aspect of this camera is the distortion you can get by moving it slowly and slightly while taking a photo. It'll make long object (like skyscrapers or trains) look like they're rubber. Pictures from this camera are somewhat over-saturated (some would call it \"rich\") and it's fixed focus (3+ Feet - infinity) but it can take some pretty darn nice artistic shots. Look this camera up on Flickr to see some examples of what it can do. No two of these take exactly the same pictures due to variations in the sensor and processing chip, and lens manufacturing aberrations.Get this camera for funsies and only if you already have a real digital camera for serious shots.  This is a hobbyist's camera. The possibilities for creativity with this (somewhat fragile) camera are endless and only limited by your imagination.That being said, I rated it 4 stars, as it's a bit pricey (and a little fragile) but even with that, I'd rate it 4.5 stars if I could.I feel bad for the people that bought this camera for a hundred bucks, thinking it was a serious camera but ultimately it's their fault for not researching the camera *before* buying it.", "Date": "May 25, 2010"}, {"Title": "Minox Leica 5.0", "Author": "Happy Buyer", "ReviewID": "RT42F74IROLN1", "Overall": "4.0", "Content": "Takes good pictures.Basically it's a \"Point & Shoot\" camera.Most of the knobs and lever are ornamental, only, with the controls actually being in it's menus' choices.It is small enough to fit in a cellphone case for belt carry.", "Date": "October 7, 2007"}, {"Title": "Looks nice, cute, poor picture quality", "Author": "Seung Eun Lee", "ReviewID": "RWUYIKM4AZBJB", "Overall": "2.0", "Content": "I bought this as a gift. It is really cute and surely get attention from people but the picture quality is really poor. Think of it as a cell phone picture quality. If you are looking for something with good picture quality this is not for you.", "Date": "March 22, 2008"}, {"Title": "Is it for real ??", "Author": "Margaret Igne", "ReviewID": "R2GV8WNPVSNK59", "Overall": "3.0", "Content": "I should be more careful and look more when I purchased my little Leica toy.... its a toy ... can be cute if you are 15 years old and go to a party with this camera, but its not real. It comes with a nice wood box.. but its not what I thought it was going to be. Again it was my fault I did not look  in details before purchasing it. But its a toy.... at my age having a new toy can be fun !!!!!", "Date": "December 21, 2009"}, {"Title": "Junk", "Author": "L. A. Walker", "ReviewID": "R2AT89E6PF26R0", "Overall": "1.0", "Content": "My wife, who normally does not use a camera, loves miniature things. For that reason, we bought the Leica Minox box camera a few years ago.  It soon ceased functioning. I sent the camera to Leica Germany for repair.  It, too, soon ceased functioning. Now it sits at the bottom of the drawer somewhere, a $600 failure.My wife still loves these miniature things and asked me to buy another one like it. The technical specifications of this camera looked good. But I read the user manual and fooled with it a couple of hours, and I still cannot find out how to get the battery into the camera. The battery is a CR2, a cylinder about twice the size as the battery opening.  At least one reviewer has ruined the camera just trying to insert or remove the SD card. No one has said how to get this big barrel of a battery into that thin little slot. If anybody knows how, please comment on this post. Otherwise, I think I will package this piece of junk up and send it back to the retailer before my wife sees it falls in love with its look.", "Date": "February 26, 2013"}, {"Title": "Nice toy camera :)", "Author": "Rina", "ReviewID": "RGYN3VC0PP7GG", "Overall": "4.0", "Content": "Bought this not really for its function but for its cuteness factor. My daughter carries this during our trips and it's just the cutest! Lets her share our fondness for taking photos :)", "Date": "April 12, 2012"}, {"Title": "Nice Novelty", "Author": "Russell B. Smith", "ReviewID": "R3KGXGAU7Z5OM0", "Overall": "4.0", "Content": "This camera is very small, but the picture quality isnt that great. You could get a canon with much better quality, for the same price. It takes really nice pictures if you use it correctly, in natural light, outdoor shots. However, if you plan on using indoors, this probably isnt the camera for you, unless you plan on purchasing the Classic Flash also. All in all, a really cool camera for the price.", "Date": "May 7, 2008"}, {"Title": "Average product", "Author": "G. Mahler \"relham\"", "ReviewID": "R2QSDZ21AKQ5T8", "Overall": "3.0", "Content": "The camera is a sure head turner: small and cute. The quality of the pictures is average at best, the camera works well in natural light and has a good lens that produce sharp images. Sometimes produce some color aberration that generates funny effects.", "Date": "March 14, 2008"}, {"Title": "Suppose to be a quality toy", "Author": "Radu Davidescu", "ReviewID": "R21V4DGCN1U4SV", "Overall": "2.0", "Content": "You must not have any expectation from this product near to any digital camera. It's a toy! The picture quality is below most of phone cameras even if have a 5mpx sensor. I bought for my kid to bring him into photography world. The proportional size was very interesting as for a 4 year kid it have size and ergonomic of a full size Leica camera in adult hands. Being a Leica replica toy and the price tag, I was expecting some \"Leica\" style build quality. But it's not the case! Build quality it's very poor for what you pay. Battery lever that holds battery into position broke quickly and camera becomes non-functional. Very expensive for you actually got!", "Date": "January 11, 2011"}, {"Title": "Too gimmicky", "Author": "Jeffrey Kanjanapangka", "ReviewID": "R1QSBQCDT0KQH3", "Overall": "1.0", "Content": "Like that girl you dated freshman year in college.  Cute, but very little substance.Overall terrible picture quality.  Very impractical and almost as soon as I pulled everything out of the box I wanted to send everything back.  I honestly have no clue as to how you practically use this camera.  As it comes with no lens cover or zoom function the only way to protect the lens is to place it back in its shiny wooden box it comes with.Even so, I still thought it could be \"geek-chic\" showing off at parties and what not.  However the terrible images the camera produces (anything short of perfect studio lighting makes it very muddy) would have my friends probably laughing at me and asking me \"how much did you pay for that?\" in a not so fun way.So, its cute.  But for the price/quality ratio... just come to realize that the girl you dated freshman year won't even end up getting her G.E.D.", "Date": "January 27, 2008"}, {"Title": "Do not Buy!!!!!!", "Author": "CN", "ReviewID": "R218APNHGDRRCH", "Overall": "1.0", "Content": "This camera is a joke! Originally I bought this camera on the shear reason of my faith in German engineering, especially with companies like Leica and Zeiss. The packaging is great, the wooden box is well made with the words MINOX GERMANY on it. Once I opened the nice wooden box I only discovered a cheap light plastic camera with the words MADE IN CHINA proudly labeled on the bottom of the camera. I still gave it a chance and took some pictures only to discover the quality of the pictures. GARBAGE. The LCD screen on the back is so artfully illuminated on the pictures of this camera, once again only to realize that the pictures were misleading and the LCD screen was of poor quality. Save yourselves the money and hassle of returning this and DO NOT BUY.", "Date": "February 28, 2008"}, {"Title": "Really Disappointing Camera", "Author": "Hao Gang \"Un pour Tous, Tous pour Un.\"", "ReviewID": "RMT8ME9YIGDRM", "Overall": "1.0", "Content": "It looks/touches like a toy but not a LEICA titled camera, poor plastic cover, poor rubber USB cover.The small LCD display is deem and has very low resolution. You can hardly get any idea what is displaying on it.The picture image is really poor. I shot 3 pictures in my office(with a steady support)and found almost hardly see any details of the picture.The only attraction is the wood box I got.I am sure, I will refund it.", "Date": "December 29, 2007"}, {"Title": "So not worth it..", "Author": "Starco", "ReviewID": "R2JKQ6ZUGNP378", "Overall": "1.0", "Content": "Once you've got over the cuteness of it, the fact remains that the mini-Minox/Leica takes lousy pictures, is overly difficult to use and (get this!) doesn't do time stamping of picture files. I was very disappointed with this product and wish I could return it somehow..(I can't!)", "Date": "July 9, 2008"}, {"Title": "It REALLY is a toy!!! NOT a camera!!!", "Author": "iceman2058 \"Johan\"", "ReviewID": "R20VRNWPKG9916", "Overall": "1.0", "Content": "There is no other way to put this: as a camera, it is totally useless. It can only take a somewhat useable picture under the most perfect of circumstances, and even then, you are horrified when you zoom in on the pixels. Now, add any kind of unfavorable lighting to the equation, and you end up with TOTALLY UNUSABLE PICTURES. The whites bleed into big blurs, the depth of field is so shallow that all your pictures end up out of focus (and no - that does NOT add a charming bokeh effect at all - it just makes everything look horrible).Do NOT buy this item if you are shopping for a camera. You'd be better off taking pictures with your camera phone, even if it is an old one!If you are after this item for nostalgic reasons, and you have $130 to stick on a shelf, then by all means - it looks nice, and gets a lot of attention from people.", "Date": "February 3, 2010"}, {"Title": "Not Good at ALL - very disapointed", "Author": "M. Vige", "ReviewID": "R3SJ2Z3BVG2DN", "Overall": "1.0", "Content": "Bad quality image - for the price you get someting better from other brand.Really disapointed and very cheap cameraSorry but I regret", "Date": "March 18, 2010"}, {"Title": "Plastic Junk", "Author": "Nik Willmore", "ReviewID": "R3RS7ITI8MUEDQ", "Overall": "1.0", "Content": "Levers don't work. They are just decorative. Blurry pictures. No focus even. You can't even FOCUS this hundred dollar plus toy. It's not even cute. It's not just plastic, but LOOKS plastic.", "Date": "May 11, 2008"}, {"Title": "Rip-off", "Author": "Luis Gonzalez \"Compulsive Shopper\"", "ReviewID": "R29HK6ZC5QPX1A", "Overall": "1.0", "Content": "This camera should sell for $29.95 at Toy's R-US.  The picture quality even under good lighting conditions and setup to \"fine\" is terrible. Worse if you use the digital zoom, then the images become unbearably pixelated. Any cell phone camera can take better pictures. No flash, no way to change the date, no shutter or apperture priority, and no programs. You cannot charge the camera unless you connect it to your PC or Laptop, so it's not even practical for traveling. The menu is limited and hard to use and the manual is a disgrace. In addition, it has poor workmanship and is made of cheap plastic, the cord is made of the cheapest leather and has an ugly brown color. Mine didn't even come in the nice wooden box! It is not worthy of the Leica name. Don't buy it!", "Date": "November 2, 2008"}], "ProductInfo": {"Price": "Unavailable", "Features": "Miniaturized  version of the famous Leica M3 from 1954  / scale 1:3\nComes in metal tin\nAll accessories included", "Name": "MINOX DCC Leica M3 5MP Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/41xywI97N8L._SX300_.jpg", "ProductID": "B000LRIU54"}}