{"Reviews": [{"Title": "WOW !!! AND THAT'S FROM A DIE HARD CANON FAN", "Author": "Amazon Customer", "ReviewID": "R39BOBTX785VGQ", "Overall": "5.0", "Content": "You know that feeling...the one you get after taking a bunch of indoor shots that you think turned out great, but look really crappy on your computer and then you waste tons of time trying to photshop the pics, well that's the feeling I have had with every compact digital camera I've owned. This is especially disappointing when you have important events like birthdays, weddings, etc. and the indoor pics turn out bad. Trust me and check out this camera. You will be shocked at how noise free indoor pics are (even iso 800 w/o flash). I don't know of another non-SLR camera that takes indoor pics this well. The build quality is superb (all metal construction). The only things I don't like: No separate battery charger included (you must charge in camera), no viewfinder, and XD card format. Those are minor quibbles and I would trade them any day for the fantastic indoor pics.I am a photography enthusiast and Canon fan (over $3k in bodies and lenses) and my main camera is an Rebel XTi. However, I've got to give Fuji a lot of credit for focusing on pic quality rather than getting into a megapixel war. Don't be fooled by the megapixel myths. This camera may have lower mp's but it has a very large CCD sensor for a compact camera. And for gods sake don't buy a camera based on looks !!! Do you really care what the camera looks like or do you care about the pictures ??? Also, optical image stabilization (OIS) seems to be the latest rage. Who cares if a camera has OIS, but takes crappy indoor pics? This is the reason I passed on the Canon SD800 IS.", "Date": "April 18, 2007"}, {"Title": "Low light champion", "Author": "Nomad77", "ReviewID": "R6MYJRCA10LBN", "Overall": "5.0", "Content": "There are many reviews of this camera stating how good its low light capabilities are...well, they are all true.  The camera does an excellent job shooting in regular lighting conditions.  Initially, I was a little disappointed about the absolute image quality in the Auto mode but then I started analyzing the pics and saw the camera like to default to widest aperture (2.8) and higher ISO settings (400-800) in this mode.  While the images are pretty good for the average person if you are accustomed to the images from a pro camera like the Canon 20D, then you will be a bit disappointed.  Then I started playing around with the settings and boy or boy...here is the where the camera really shines:Switch it to Aperture Priority mode.Set the aperture to F5.Set the ISO to 100.Turn on flash to red-eye.Set the JPG compression to Fine (6M F).Turn on high speed shooting for faster focusing.Change the color setting to F-chrome. (This boost saturation and contrast)Now go take some pics :)  At these settings this camera is capable of giving a consumer SLR a run for its money.  Its that good!  The color is a bit over saturated but its better than the normal settings which is a bit under saturated for my taste and probably the average person too.The best feature of this camera though that is never really mentioned in the reviews is how good the metering is.  I would say its even better than my 20D.  In complex lighting situations the camera does an excellent job of metering the scene for the best possible exposure.  In auto mode this was immediately evident to me.The images also have a certain quality to them that could only be described as the Fuji look.  In my opinion this camera metering and color rendition is superior to the Canons. I also own a Canon SD700 IS and while also a very good camera, the Fuji is better  in also every respect except size.  It is a little bigger, just a little, than the Canon and the Canon has a longer zoom (4X vs 3X).  The Canon also allows you to adjust the image look with a lot more settings and the lens also has an optical image stabilizer.The movie mode came as another surprise: very good! Again, the camera was awesome in low light.  The movie quality would be comparable to a DV camcorder of a generation or two ago.  Where it and all of these camera break down is when you are recording motion.  Either a fast moving object or when you are panning quickly.  The high compression causes either video artifacts or smear so remember, don't pan quickly.  Again, I would say the movie mode is better than my Canon SD700.The flash on the camera is also pretty powerful for such a small camera and the battery life is very good.  Red-eye is controlled wonderfully and the flash does not burn out the highlights even at close range.  Again...a really good job by the Fuji metering system.All in all, Fuji did a really good job with this camera.  I didn't believe it would be capable of producing images that could rival my 20D with an average lens but it can when all of the setting are set to optimum levels.  I can't say that about my Canon SD700 or any other point-and-shoot digital I have played with.  Now I won't feel so bad about leaving my 20D with its L class lens at home :)PS Fuji has released the F40 now at 8MP.  The problem with the increased pixel count on all of these sensors is that the area size remains the same.  So you are crowding more sensors into the same physical space which increases image noise. So while you may get a higher pixel count you also get more noise.  And let me tell you, one of the reasons I still have the 20D is because of its stunning noise free images.  A completely noise free 4MP image will beat an 8MP noisy image any day.  That is what most consumers do not know ;)  The \"perceived\" resolution and sharpness of an image is determined to a great extent by how much noise it has.  Don't buy into the higher mega pixel myth.  You will never need anything more than 6MP anyway unless you are planning on making a lot of poster size prints :)", "Date": "June 26, 2007"}, {"Title": "Incredible Low - Light Performance", "Author": "Gatorowl", "ReviewID": "RV8HW628QWAXY", "Overall": "5.0", "Content": "I can't say whether this camera is better or worst than the f30, but I can say that the camera is excellent. I've been using a Casio EX-Z750 for the last 18 months, and it is a tremendous outdoor performer. It is also more compact, has a viewfinder and manual mode.  That's where the advantages end. Indoor shots always required flash, and the flash invariable gave skin a strongly unnatural pallor.By contrast, f31fd indoor shots with and without the flash are superb . I recently took over 200 shots at a seminar where I could not use a flash. Skin tones was very natural/accurate and noise at ISO 400 or less was virtually non-existent. At ISO800, noise was noticeable, but the shots were usable.  Shots at ISO 1600 were also usable, but substantial detail was lost. The FD worked, but the subject had to be looking in your direction.  Also, at the longest zoom, the camera would default to ISO 1600 in auto mode.  I found that if I zoomed halfway, I could keep the ISO down to 400 (preferred) or lower.Images are a little soft, which is okay, but might be a problem if you don't want to use Photoshop or similar.  I haven't taken many outdoor shots.  That's not why I purchased the camera.  However, I suspect it will do fine.  Most cameras do.Some dislikes: I wish it had a viewfinder, I wish it was smaller, and I wish that I could use FD in a non-automatic mode (or at least prevent ISO from creeping over 400!).  These are not major dislikes. I'm more than happy to trade off these minor niggles for the great performance.UPDATE:  I've had this camera for about 7 months. The low-light performance is still acceptable, but I am extremely disappointed with the FD feature.  Most of the photos I've taken with FD are unusable especially when there are multiple people in the photo.  It selects settings with a very narrow depth of field, so most faces are out of focus.  Most of the shots are extremely soft. I don't want to have to do a lot of post-processing work with a point-and-shoot.  I will experiment with it more.  But for now, I will rely on my Nikon DSLR for critical shots.", "Date": "February 10, 2007"}, {"Title": "Incredible flexibility", "Author": "Paul Bobbitt", "ReviewID": "RA5Z9JF48VC3H", "Overall": "5.0", "Content": "This camera is very similar to the Fuji F30, but has face detection (fd) that autofocuses on faces in a photo.  Great for taking pictures of yourself, or for snapshots you don't have time to compose.  Excellent quality photos in dim light. At 3200 ISO, photos are washed out and noisy, but still good for capturing an image you would otherwise miss. Option to limit ISO to 1600, or to 400. Camera will use any speed up to the limit. 400 ISO is extremely good. As good as my Canon Digital Rebel xti. Usual modes I never use (flower, landscape, etc.), but one unique mode I use all the time: no flash/flash. The camera takes a picture without flash up to 3200 ISO, and then takes a picture with flash immediately after. Usually takes less than one second to capture both images. No flash doesn't surprise anyone and ruin the candid shot, while the following flash guarantees you'll get the image, even if the \"warm glow of candlelight\" is ruined. I always have the camera set to this mode. Uses xD cards, which I hate, but if you buy a 1 GB card you'll be able to take 400 - 500 photos without ever needing to change the card. Also, battery life is unbelieveable! Fully charge the camera over several hours, and you'll be able to take 400 photos, half with flash, before the battery is drained. Fuji-brand underwater housing is optional, watertight to 40m (121 ft.) Camera comes with underwater setting to intensify non-blue colours, and still keep the intense blue of the water. Literally *every* diver should have one of these cameras. I recommend this camera without hesitation. There simply isn't anything else like it on the market.", "Date": "March 19, 2007"}, {"Title": "Awesome Speed!", "Author": "Daddy O", "ReviewID": "R1337CV9C4T5FD", "Overall": "5.0", "Content": "This camera was recommended by a friend who tends to have the latest, greatest electronic gadgets.  After dealing with my \"antique\" 3-4 year old Olympus digital camera for years, it was such a relief to use the Fuji F31fd.  The speed to turn on and take first picture is awesome, and the shutter response time was great.  The resolution and colors on the viewing screen are also really nice, and the face detection technology is kind of neat.  I was considering a 10 megapixel Sony that was about $100 more, but the speed (and recommendation) on this one sold me.  Even at 6.3 megapixels (instead of the 10 I had been thinking I wanted), this is a great camera.  My 3.1 megapixel Olympus produces nice quality pictures, so I figured 6 would be a good enough increase, and the speed of picture taking was much more important... nice to be able to capture more shots before the moment is lost.  I have seem people around with Fuji's before, and they always seemed so easy to use, and produced nice pictures.  Now I am an owner and believer.", "Date": "December 27, 2006"}, {"Title": "Awesome low light picture quality", "Author": "Sameer Vermani \"samv\"", "ReviewID": "RECTL33C60SYO", "Overall": "5.0", "Content": "I had owned a Canon SD series camera and I was so frustrated with the low light capabilities of that camera. The indoor photos would be illuminated in a very non-uniform manner making people look pale and sick...But this camera takes amazing low light pictures both indoors and outdoors with picture quality at times approaching SLRs. Pretty much all the cameras in the market take good pictures in bright sunshine but this one does it in low light too. Don't follow the mega pixel lure. In high ISO settings , there simply isn't a compact on the market to rival this jewel.The camera is very responsive and fast. The build quality and handling is very good. I would highly recommend this camera to anyone looking for a good compact with more than just \"bright day-light\" capabilities.", "Date": "May 14, 2007"}, {"Title": "Novice and more experience photographers can use this.", "Author": "K. Battee-Freeman", "ReviewID": "R2O475R47HROTP", "Overall": "5.0", "Content": "Pros: Good for those who want an automatic camera and those who want to adjustable settings.Cons: Software is awkward. It can't be used as a webcam.The Bottom Line: A great camera with lot of features that can be used by beginners and enthusiasts.Why did you buy this product?My husband and I got the Fuji Finepix F31FD Digital Camera as our Christmas gift in December 2006. We wanted something to replace our current digital camera which was quickly becoming more and more irritating because it does not take good pictures in low light and it does not have a zoom feature.Describe your experience using this product.The Fuji Finepix F31FD Digital Camera arrived when my husband was at work and I was at home on vacation. I was so excited and immediately started playing with it.One of the first tests I did with Fuji Finepix F31FD Digital Camera was to check how well it worked in low light. I closed all the blinds, turned off all the lights, and took a picture of items approximately 18 feet away. I took this picture at night and the room was pitch black. I was amazed. The picture came out clear and it looked as if it was taken in the afternoon. You could not tell from looking at the picture that it was taking in a completely dark room.The second feature I wanted to test was the face detection feature. So I took pictures of me with this feature turned off and another with it turned on. I was pleasantly surprised at the results. While the pictures were not hugely different, it was clear that the feature worked and that I was more of the focus in the picture that was taken with the feature on. This feature even worked when I took pictures of dolls and when I took a picture of a picture with several faces in it.One feature that I didn't think would be all that useful was the video capture feature. I love taking pictures but have never been into recording video. However since this feature is included I find myself using it more and more. It is quick and easy to switch over to the video capture component and record those precious moment. It is limited to approximately 15 minutes of video which isn't a great deal of time. There is supposed to be a new memory card coming out soon that will allow users to record longer periods of video (approximately 30 minutes). My husband keeps looking for the new memory card to be released but I'm fine with the approximately 15 minutes of video and approximately 350 pictures.What do you love about this product?It's compact and easy to handle. It has a lot of great features including taking pictures in the dark, face recognition, video capture, the ability to let the camera automate the setting or let the user manually adjust them, a 2 sec and a 10 second timer, and an excellent zoom feature.I also like that it warns you when you need to make adjustments to get the best picture. For example if I am zoomed in to closely for the auto focus to work, it warm me.What do you hate?I do not like the software that comes with the camera because 1) I think the way it labels items is awkward, 2)it seems to be all or nothing i.e. save all pictures or erase all pictures 3) it doesn't let you view before saving items, and 4) it's kind of slow. Maybe I just haven't learned to use it correctly but doesn't work well for me.I also do not like that I can not use this as a webcam. I can connect it to my TV tuner and view what is happening in my room but Yahoo Messenger does not recognize it as a webcam.Recommended:Yes", "Date": "March 18, 2007"}, {"Title": "You don't need IS", "Author": "Chaval", "ReviewID": "RMOBZ4BBLVZAQ", "Overall": "5.0", "Content": "Combine the high ISO, low noise and fast shutter speed for great blur free shots on low light AND MOVING SUBJECTS. This is what only Fuji can offer to you on compact camera class.The F31fd doesn't have IS (Image stabilized lenses or a CCD shift sensor), which other cameras use to reduce the effect of blur from camera shaking. But this kind of stabilization is really only useful for 6x or more zoom, for just 3x typical zoom on ultra compact P&S; you just need to hold it firmly and will get the same results.IS also can't prevent blur from moving subjects. With a High ISO like on F31fd you can use faster shutter speeds that will freeze subjects and prevent blur from camera shaking too.Fuji Super CCD sensor provides the lowest noise on High ISO you will find on 2007's compact cameras, the quality is only comparable to the big DSLR professional cameras.Ah, and the Face Detection is not just a gimmick or marketing appeal... it's really great, specially if someone who doesn't know how to focus on the face then recompose the scene is taking pictures of you, with F31fd they will not miss the shot.", "Date": "March 13, 2007"}, {"Title": "This is a truly remarkable camera, with only a few glaring weaknesses.", "Author": "R. Hiranaka", "ReviewID": "R1VGPITPGQJFSM", "Overall": "4.0", "Content": "EDIT: I've just noticed that the F20 has not been highly overpriced since its discontinuation.  It's been compared fairly against the F30 so it might be a fair substitute for the F31fd.I should preface this review stating that I am not a pro or even serious amateur photographer like many of the other reviews here.  I've never even owned a DSLR to compare it to.  What I can say is that this camera more than compensates for museum visits and shaky hands.I remember back when I used my older Nikon camera that I could not take proper shots when in museums and other flash restricted areas in Japan.  As a result many of my shots ended up quite blurry or excessively dim.  Attempts to up the ISO only resulted in pictures looking excessively noisy.  Focus speed could have also used a slight boost for those rare and fast moving moments (those South American travelers in my tour group... ah what lovely memories of the word \"GOAL\").These gripes were solved with the F31fd.  It does not have optical image stabilization like most of the Panasonics and Canons out today, but it doesn't seem to need it all that much.  Having a decent ability to test it against various models (working in electronics retail has its perks), I don't see much of difference between an image stabilized picture and one taken with ISO 400 on the Fuji.  What I do see however is the ability to take shots of fast moving objects.  At even ISO 1600 (which I do know is way too high for this camera or the discerning photo viewer) and a fast shutter speed I could catch a couple of kids running around with a remote controlled car with little blur.  Overall I don't see any bothersome noise until ISO 1600, and that's plenty enough for me.The camera focuses fast.  I could get a candid shot off before the normally camera shy type of person turns around yelling for you not to take a picture of them because they think that they look horrid.  I love it.  From on to the first shot it takes about 2-2.5 seconds depending on what mode you're in.Photos come out quite lovely on the computer.  However even I can notice that they are a bit overexposed when shooting with the sun shining in front of you.  Of course if you dial down the exposure it doesn't look as bad.There are so many things I could say to put this camera in positive light, but since everyone else seems to have done that I might as well list the weaknesses.First and foremost are those infernal xD cards.  They're pricey compared to SD, harder to find, and don't come in capacities bigger than 2 GB.  In addition if you're not in an area with a dedicated and well stocked camera shop they're likely to be the much slower and inferior Type M format.UPDATE: In regards to a comment about there being no difference in xD Type M and H I have actually gone out and bought a Type M to do more extensive testing.  The difference is much worse than I initially realized.  When doing shots on auto it's not a huge difference (maybe a second more time to write it to the card) but in manual mode the difference is about two and in natural light/flash mode (which takes up the most time to write to the card anyway) it takes nearly five seconds to write to the card, while the Type H finishes at three.  Both slow in my opinion, but at least the Type H doesn't make me feel like I might miss an important shot.The difference in speed between a typical SD card camera and the xD Fuji is huge.  It is nice to quickly take a shot, but it is not so nice to wait a second or more (depending on mode) to write the image to the card.  It especially becomes painful when trying to take continuous shots.  The more commonly available Type M is worse.  While I'm not sure about the claims of Type H being 3X faster than M... it certainly feels like a tangible difference.The size of the camera is also a bit hard to swallow.  While not huge (compared to film cameras at least), if you compare it to a Canon Elph or a Sony W series it's huge.  Even the F40fd is thin compared to it.  I'd say for comparison that it's just a hair smaller than the AT&T; 8525.  It does however fit very well and snugly in a Lowepro Rezo 15 (thank you whoever reviewed that case and recommended it).  So it's not huge, and certainly smaller in depth compared to the Canon A series of cameras.The battery also annoys me.  It is a Li-ion cell, which means that if you lose it or the charger you're essentially screwed.  New chargers cost a pretty penny (go with third party stuff or your wallet will bleed), and the batteries are even worse (even third party stuff).  Charging the battery on the included AC adapter is a long experience.  I believe I may have read somewhere in the manual that it would take about three hours to fully charge, but my experience tells me that it's more than four hours to fully charge it.  However the external charger can do it in about three (at least the Impact one I have).  As an additional bonus the AC adapter can power the camera without the battery in.  That and the battery life is suburb (Went through a 1 GB, a 512 MB and was into the 1 GB again before it finally died again).There is also the matter of the camera being a bit difficult to adjust.  In full auto mode the pictures don't look quite as good as other cameras taken in full auto mode.  To me they look a bit washed out, overexposed, and perhaps a trifle too noisy (as the camera tends to push the ISO to 3200 when you disable the flash).  You'll have to adjust the settings every so often.  I do however find some useful tips in the reviews here as well as the forums at dpreview.  It is nice to be able to tailor your settings to just the right ones to the situation (since auto in cameras sometimes makes mistakes), but it is a bit harder.Overall a great camera, but not a perfect camera by any stretch of the imagination and certainly not even a good choice for many people.", "Date": "August 14, 2007"}, {"Title": "Best point and shoot camera I have ever operated", "Author": "Karyn", "ReviewID": "R2FWC8M6AV6S33", "Overall": "5.0", "Content": "I bought this camera for a trip to SE Asia, and in a sea of Canon SD1000 cameras, my Fuji stood out to everyone as the best - other people literally stopped taking photos in favour of getting copies of mine later.  In a group shot in front of a volcano, the F31fd was the only camera to actually capture the volcano - all other attempts were overexposed.  Same with sunset pics, where only my camera successfully took a sharp photo of the portrait subject with true-to-life colour capture.Hands down, this is the best low light camera I have ever used.  The best feature on the camera is a mode that automatically takes 2 pictures in rapid succession - the first without a flash, then one with a flash - then it saves both and lets you select which one was better for your lighting situation.  Most of the time the no flash picture is even better than with a flash - very natural colour and excellent background detail.  The flash is better than I expected, never producing those pictures that are so bright that you can't see the subject.  The pictures are always clear and never grainy.  There is also an option to cap the ISO used if grain is one of your particular concerns.The battery life is also without compare.  I bought a spare battery to go with my camera, but this turned out to be overkill - while everyone else on the trip was busy recharging their batteries nearly daily, it took me 4 days at maximum shutter happiness to run the battery out.  And this is coming from someone whose first camera broke after being driven into the ground with 15 000 pictures taken in 1.5 years.  Not a concern with this camera, which comes with a 3 year warranty - they will replace it even if it breaks from overuse, a real threat to this camera, which you will want to take everywhere.The LCD screen is fantastic, even in very bright light.  Also, for anyone who is serious about having control over their pictures on demand, this camera has shutter and aperture priority!  This is not a common feature on cameras this compact.The videos are extremely clear, high resolution, and smooth.  There is no limit on how long your videos can be (apart from space restrictions on your xD card) and the output file format is .avi - unlike Olympus cameras that only output in a quicktime format and can't be edited with movie maker.Another cool feature is that instead of a play/shoot switch, there is a play button.  This means that as soon as you touch the shutter button, it switches back to shoot mode and you're ready to take your next photo or video.Search this camera on dpreview for side-by-side comparisons of studio shots taken with this camera vs. others, such as a Canon ELPH and a Nikon SLR - they really speak for themselves.", "Date": "August 13, 2007"}, {"Title": "Fun little camera, great battery life!", "Author": "Nebyrneh", "ReviewID": "R2115NWF0B4JC8", "Overall": "4.0", "Content": "I bought this camera to take pictures of my sons playing basketball.  My other camera shot dark grainy pictures indoor.  I have had a lot of success with this and really nice outdoor shots as well.  What I just started playing with, and I love is the video feature.  It is so easy to use and the images are better than I expected.  I bought this camera in December as a present to myself and I have used it constantly and recharged the battery twice.  This is major to me as my Nikon was devouring batteries in an afternoon.  The optical zoom is clean, but the digital is definitely noisy. I have had fun shooting pictures of my kids because the shutter speed is so quick and I don't miss the shot.", "Date": "March 24, 2007"}, {"Title": "Picky photog couldn't be more pleased...", "Author": "D. Powell \"Picky Photo Nut\"", "ReviewID": "R3QFDHG1KE0N4L", "Overall": "5.0", "Content": "I've always preferred to shoot without flash, and had been interested in this line of Fiji cameras for quite a while. Finally, I had the opportunity to buy one, and it only took 2 days to arrive (with the same $30 rebate that was mentioned in an earlier Amazon review).  I took the unit out for a weekend of shooting in a variety of settings, and am most pleased with the results. Here are some observations:* The web reviews that say it's \"a bit large for a compact point-and-shoot\" shouldn't scare anyone off. It's not a credit-card-sized wafer, but remember those miniscule Canon Elph film cameras? Well, I carried the f31fd in my old Elph's belt pouch, and there was plenty of extra room in it. The camera's still quite small.* Similarly, I don't understand the web reviewers that say the camera is noisy! The loudest noise it makes is the little tune that plays when you turn it on. Other than that, the zoom lens is fast, smooth, and whisper-quiet (you could zoom it in church without attracting attention). And even if you set the camera in its continuous-focus mode (which attempts to keep it in-focus all the time, while it's on), you only hear a quiet ticking sound. (I wouldn't use this mode, anyway; it eats battery power.)* A great feature that hasn't been mentioned before is the f31fd's ability to crop photos in-camera after they are taken. If you are running short of space in your xD card, this can help you fit more photos in (as can setting a lower resolution). But, the camera saves both original and cropped versions...so after cropping an image, you may want to delete the original (though you don't have to).* From various reviews, it seems that the camera's images are sharpest when zoomed fully out at f:5. So I used that setting to shoot a sunset through some trees outside our bedroom window. The camera captured the sky's faint peachy colors beautifully, and when I enlarged the image, I could sharply see every individual hole that the Winter Moth caterpillars had eaten in the oak leaves 20 feet from our window. Yuck.* I also tried a few \"extreme\" shots. At night, turned on a floor lamp, set the camera to full Auto, pointed it straight up at the 100W bulb, and snapped. The intelligent flash system actually triggered just enough light to also illuminate the shade without washing everything out. Exposure of both the bulb and lampshade were nicely balanced. And no glare...I could also read the electrical warning label around the socket just below the bulb.* Another extreme test was taking an interior shot of our dark-wallpapered bedroom at night, using only the illumination from one 40W bedside lamp. The ISO 3200 image was indeed pretty noisy in the darkest areas...but still very clean (though a tad soft) elsewhere, compared with what my earlier cameras did. The ISO 1600 image was best, and the ISO 800 was too dark. But adding flash produced wonderful results at any ISO.* I also shot some macros of brightly colored flowers in intense noon light, and with or without flash, they all came out wonderfully exposed. Using full \"Force Flash\" on a flower that's only 2 inches in front of the lens in full noon sun is a challenge for any camera, and the f31fd handled it nicely. In comparison shots of a red hybiscus blossom, my wife preferred the more-intense colors from the camera's \"Chrome\" setting, while I preferred the less-saturated \"Standard\" mode.After an intense weekend with this camera strapped to my belt, I only came away with one nit. The control dial on top works so smoothly and easily, that it's kinda easy to accidentally turn it, when taking the camera out of a pouch. That's how I accidentally captured a cute movie of our cat coming to me, when I whistled to get her attention for a still portrait! (The plus: Movie mode is super-easy...and our cat-loving friends are raving about the clip.) Small price to pay.In short, I love this camera!", "Date": "August 10, 2007"}, {"Title": "Unmatched Low Light Shots, Poor Performance & User Friendliness", "Author": "R. McAuley", "ReviewID": "R333RKC9K0X5YE", "Overall": "4.0", "Content": "I owned a Canon SD600 before this camera and have researched compact cameras to accompany a Digital SLR, and for image quality this seemed to be the most well-reviewed.  I've had this camera for a month and have taken approx. 1000 photos with it in various conditions and across trips over the USA.The single advantage this camera has over every other compact is the low-light shooting quality.  ISO 800 shots are very usable with very little noise and grain to them, compared to the completely unusable ISO 800 shots in every other compact.  All shots, including daytime low ISO shots can have some fuzziness that almost look like JPEG artifacts in details, and a slight halo effect around bright or overexposed areas.  These are not abnormal for a compact, but the photos are less sharp and less defined than my previous Canon compact.  Overall, the image quality is simply bar none compared to other ultra-compacts because of the better high-ISO performance.  If you're a stickler for that, or take lots of no-flash or low-light shots, there's no other camera for you than this.My other favourite plus of the camera not always found in ultra-compacts is the manual shutter priority - simply define your ISO level and the shutter speed you want and the camera will adjust aperture for correct exposure.  Battery life is also excellent, I've taken 400+ non-flash photos in one day and the battery still reports 2 out of 3 bars left.  Fuji says you can have up to 500 shots on one charge - this may be with flash.My largest complaint about this camera is the poor performance.  From focusing, to shooting, to browsing, everything about this camera is slow.  Most of this can be blamed on the xD memory it uses.  A \"high speed shooting\" option speeds up the auto-focus of the camera, which helps somewhat.  (at the loss of being able to take decent macro photos)In practice you will be able to get about 1 shot every 2 to 3 seconds, and when you hit the camera's 3 photo buffer you will have to wait for the card to write to the horrifically slow xD memory.  The user interface could also use some cleaning up and adjustment - some options should be made available in the \"F-menu\" when they are buried in another area.  If you want any control of your photos you'll be fumbling with the menus until you learn them.Overall, this is a thoroughly average camera with fantastic image quality.  If only there was a way of combining the user interface and speed of a Canon with this camera's quality...", "Date": "August 8, 2007"}, {"Title": "AMAZING!  Ten out of five stars!  Buy it if you can find one...", "Author": "J. Mantovani", "ReviewID": "R6SZWN18JGG6G", "Overall": "5.0", "Content": "AFter 2 weeks of research (Fuji Finepix, Sony Cybershots & Canon models) I chose the F31fd based on all of the excellent reviews & it's plethora of features. Was nearly impossible to find one of these brand-new but there are occasionaly a few on Ebay for under $500.First impression of the F31fd:  Much smaller than I thought.  Very well put together, buttons and dials very convenient.  Access to features and menus is logical and usually within 2 button clicks.  The video quality is breathtaking at 30fps, similar to my camcorder.  I've taken hundreds of photos using all of the features and their quality has FAR exceeded my high expectations based on the A310.Three straight days of picture, movie, playback, and \"playing\" with the features, and the battery indicator is still two out of three bars. Fuji says 580 shots per charge. I believe it.  One really neat feature is that you can still take a picture when you are in playback mode (which is conveniently accessed by pushing one button).  The shutter is nearly instantaneous too.I've recommended this camera to family and friends.  WHY can't we find these still in stores?  This is in my opinion the best under $500 camera on the market!  Good luck...buy it if you find it.", "Date": "October 7, 2007"}, {"Title": "Excellent ultra-low-noise ISO3200 CCD makes up for all flaws", "Author": "S. Ragsdale", "ReviewID": "R3UHAEIMWE0V1T", "Overall": "4.0", "Content": "There's a lot to not like about this camera: it seems bulkier than it should be, it uses a proprietary memory card, the camera doesn't mount as a flash drive when you plug it into your computer (buy a Lexar Single-USB Reader), the menu system and user interface needs some polish, and it lacks some of the more advanced manual controls.So why do I recommend this camera to everyone I meet?  It's all about the CCD.  Fuji decided not to fight the megapixel war, started engineering for low-noise, and completely knocked it out of the park with the F30 and its successor the F31.  In low-light conditions this camera takes better pictures than any compact camera I've used.  You get three to four stops more exposure before you need to start using a flash.  Perfect for dimly lit nightclubs, resturants, bars, and concerts - the occasions where most compact cameras are used.", "Date": "July 27, 2007"}, {"Title": "Amazing photos, frustrating manual controls", "Author": "G. Berger", "ReviewID": "R2VRI6ASEYCET5", "Overall": "4.0", "Content": "I was looking for a P&S; camera to take on vacation for those times I didn't want to lug my Canon EOS 30D around. This camera had a rave review on [...], so I purchased one. The photos are amazing - the lens is extremely sharp and the sensor in this camera is phenomenal. It really is specatacular in that regard. Dpreview compared it favorably to a Nikon D50 DSLR, and I agree that it does give a digital SLR a run for it's money. It's pretty darn close, although at full size on a computer screen you can see pixellation in some areas and some lack of detail compared to an SLR. But you have to look closely and it doesn't show in an 8x10. Fuji really did a great job with this camera, not succumbing to the megapixel race and instead concentrating on image quality. Low light shots are better than most cameras can produce. Overall, I'd give this camera top marks for image quality.I give the camera as a whole four stars because the manual controls fall short of what they should/could be. There is no mode in which you can control both shutter and aperture - it's only one or the other. In some modes the camera insists on selecting the ISO for you. You really have to do a lot of moving around inside the menus to get the settings you want, it's just very frustrating in this department. On the other hand, there are 15 scene modes (I think) that can handle most situations pretty well.But overall, considering the price of the camera, this may be asking too much. You can get all the manual controls if you spend twice as much, but I don't think you'd get better image quality - this camera is just too good at the basic task of producing great photos in most situations. I really can't get over how sharp the lens is and how beautiful the photos are. Or did I already say that?Other notes:- There is no external charger for the battery - it must be charged in the camera. Bad.- When I plug the camera into a computer, it does show up as a drive (previous reviewer said it doesn't).- No optical viewfinder. I never would use it anyway, but some people do.- The included software CD should be immediately installed in the nearest garbage can. The software is totally useless if you have any kind of editing software and know how to get pictures from one folder (the connected camera)to another (on your hard drive).", "Date": "August 7, 2007"}, {"Title": "Terrific Image Quality and Design", "Author": "The Hainster \"David\"", "ReviewID": "R2LX89ZZ2VABJB", "Overall": "5.0", "Content": "Image quality is outstanding. The refinements of the F31 over the F30 are well worth the modest price increase. FD (face detection) feature works surprisingly well, even though I'm not much into that.Camera build quality are beyond what you would expect at this price. Menus and controls are well designed. Camera has proved to be very fast in operation with quick start-up and low shutter lag. This camera is the best in the market at night and low-light shooting, while my daytime shots are truly terrific.", "Date": "April 28, 2007"}, {"Title": "Amazing Point-and-Shoot Camera", "Author": "R. King", "ReviewID": "R1CF1MTMUES369", "Overall": "5.0", "Content": "Small size but takes great pictures, even in fully automatic mode! Very low noise for a camera this size. Pictures are very clean and sharp. The manual options allow more experienced users to finesse their photos.Don't be afraid of the xD card: they work great, and are now comparable in price to the SD cards. The read and write speeds are plenty fast.", "Date": "May 6, 2007"}, {"Title": "The Low Light King!", "Author": "Rob LaRosa", "ReviewID": "RTG14AKKHA6R1", "Overall": "5.0", "Content": "The Fujifilm SuperCCD sensor in the F31fd (and other Fujifilm cameras) is unique. No other manufacturer has them. What is great about the SuperCCD sensor is it's ability to take great photos in low light situations WITHOUT the use of a flash. The high ISO photos the F31fd produces are a quantum leap ahead of the competition. Other cameras will produce noisy and virtually unusable photos at ISO above 800, not so with the F31fd. You won't find low light performance in other manufacturer's cameras until you start shelling out big bucks for a digital SLR. If you find yourself in situations where using the flash is not an option, the Fujifilm F31fd is your only answer.", "Date": "October 10, 2007"}, {"Title": "6 Stars", "Author": "Kevin D. Cozma \"Kevin\"", "ReviewID": "R2CYC40OOUUDDT", "Overall": "5.0", "Content": "Can I give this camera six stars?  Thanks for the great camera, Fuji.  I've got a Nikon D200 (love it, too) for when I need more control and performance, but this little gem fits the bill for when I don't want to carry around my SLR.Great metering, size, build quality, flash metering, colors, sharpness, etc.  Even with all of these qualities, the main reason I bought it was its high ISO quality.  This is coming from a pretty picky amateur photographer.  If you've got the time, check out dpreview's article on high ISOs.Yeah, I wish I had access to aperture and shutter speed at the same time, but the lack of this is a small price to pay for a camera that does everything else I need a compact to do.Cheers", "Date": "May 29, 2007"}, {"Title": "Zoom and Lens Cover \"Stick\"", "Author": "William Baker", "ReviewID": "R1DLJGRHRI368I", "Overall": "1.0", "Content": "A FinePix F31fd was purchased early 2007 new from Amazon to replace a first generation Canon digital point-and-shoot. Electronically, the Fuji product is great. The amazing battery life really makes having the opportunity to catch a great shot much easier than having to remember to recharge each night. The low light capabilities, resolution, etc. are stellar as mentioned by numerous reviews here.The achilles heel of the F31, and perhaps affecting all of the similar Fuji FinePix digital cameras, is a tender mechanical lens mechanism and Fuji's inability to correct it. The lens retracts into the camera body on shut-down and a cover closes to protect the lens. The reverse happens when the camera is energized to take a photo.Early in the history of this unit, the lens would be balky ocassionaly on open or close. After several power-up/down sequences the mechanism would work properly. After the lens opened and the cover retracted, the zoom feature would work flawlessly.Frequency of the failure to open or shut down continued to increase until it became too much. The camera was not dependable in being able to catch a spur of the moment shot. After contacting Fuji, the camera was sent to the nearest Fuji authorized repair center which is in San Antonio, Texas. The charge to go through the center was $60 plus SH both ways. Within a few weeks after return from the authorized repair center, the same zoom and lens cover issues returned. Cleaning with compresses air does not appear to help.This unit has been gently handled. When not in use it is returned to the camera case.The Canon this unit replaced did not take the quality of pictures (I think it was 3 MP) nor have the battery life of the F31. However, the mechanical functions never failed to operate properly.Sadly, the F31 is being retired.", "Date": "August 17, 2009"}, {"Title": "Great available light camera.", "Author": "Carl A. Chiulli", "ReviewID": "RWXE5BJAOTGBD", "Overall": "5.0", "Content": "This camera gets photos in very low light, nothing this small comes close to this low light performance.", "Date": "September 16, 2007"}, {"Title": "Best point and shoot for low light photography", "Author": "M. Katz", "ReviewID": "R313HOJJUINGNC", "Overall": "5.0", "Content": "This camera is famous for its low light performance.  Fuji's newer models of the F series are inferior in this regard, so this this is destined to become a collectors item once it is discontinued.  If you like to take indoor pictures with available light (no flash), this is the one to get!", "Date": "September 13, 2007"}, {"Title": "Great camera", "Author": "happy customer", "ReviewID": "R2VPA9Q9BZ1BDX", "Overall": "5.0", "Content": "I probably would have bought this camera even if it had cost 50% more.  Its one of those few purchases that I've ever made which turns out to be great - not in spite of - but especially for the money.  I compared this to just about every other camera on the market and for indoor pictures this one simply can't be beat.  I found this after being severely dissapointed in the performance of the Canon TX-1 - especially indoors.  The Fuji is great for low light situations - and don't be fooled - just about any indoors picture is a low light situation. Canon had my attention from the beginning, but the Fuji really is a performer.", "Date": "August 12, 2007"}, {"Title": "one of the best point and shoot camera", "Author": "Sri Pavan Vemuri", "ReviewID": "RUFVL03DBJDBI", "Overall": "5.0", "Content": "i have done a lot of research and in the end purchased this camera. i have taken arround 600 shots i tell u they are just wonderfull. i have taken  pictures from the top of the empire state building during the night time, they are fabulous. i have also taken a lot pictures at the Niagra falls where the face detection performed at its best especially in situations where the subject is blackened by the bright environment behind. the intelligent flash combined with the face detection gives wonderfull pictures that are evenly lit in low light conditions.the only thing is that it has a bad grip.", "Date": "August 9, 2007"}, {"Title": "Outstanding digi cam", "Author": "James S. Parker \"JParker\"", "ReviewID": "R17QX5QFP0374W", "Overall": "5.0", "Content": "Tis is the best Digital camera I have owned or used. The picture quality is outstanding and the speed is super fast. It has so many options and capabilities that make it such a great camera. The face detection is a little slow and I'm not sure if it makes that much of a difference but I have no complaints at all. The camera is a little pricey but I'm sure it will give me years of trouble free use. I also got a 1GB Type \"H\" (High Speed) card to go with it and this combo is fantastic.", "Date": "January 19, 2007"}, {"Title": "Go for it", "Author": "Z. Shen", "ReviewID": "R1SWHDPWPI4BH0", "Overall": "5.0", "Content": "I have done a lot of research before I bought this camera. This is the best camera around, the picture quality is amazing, and it is very easy to use.  I am so happy that I bought this camera.", "Date": "July 12, 2007"}, {"Title": "Used for more than 6 years got my money worth!", "Author": "Twilight", "ReviewID": "RW6E51DHY3YQX", "Overall": "5.0", "Content": "This was the 1st digital camera I bought for myself and it lasted 6 years!! I've only own two digital cameras my whole life. The previous camera I had was a gift, broke less than a year even had it fixed for free from Kodak. I wanted a good one so I remember doing a lot of research before purchasing this camera. I just broke it today by dropping it on wooden floor and it messed up the zoom while it was on! :( It saddens me since this camera holds so many great memories. I used it for everything and dropped it at least 50 times before it break on me lol NO JOKE! I am super excited getting Fujifilm Z1000EXR! There are a lot more functions and new additions to cameras these days I have a feeling I wont be disappointed with my choice on staying with Fuji.PS This camera is super old and expensive probably no one wants to buy it anymore but if you just looking for something to take great pics and decent videos this is for you. This camera took the best night pics even though all my friends had newer and latest camera that couldnt pull that off.", "Date": "September 7, 2012"}, {"Title": "Excellent compact.", "Author": "T. Hardy", "ReviewID": "RJ5A3LC7NJ1UT", "Overall": "4.0", "Content": "This is an excellent device. Great image quality. If mine had not somehow been afflicted with dust/tiny hairs on the sensor I'd still be using it. Fuji says they will attempt a fix for $150 but do not guarantee the outcome. The only thing I think will replace it is a Panasonic LX5 - that's how good this pioneering camera is. (The newer F series Fujis are, for me, a bit too small.)", "Date": "November 2, 2010"}, {"Title": "Terrific camera for the money", "Author": "Bryan R. Harris", "ReviewID": "R313F86J1UQA5C", "Overall": "5.0", "Content": "We had a Nikon Coolpix before, but just got tired of the slow reaction times and the poor indoor pictures.  So we decided to get a camera that was:  (a) great for indoor and low-light shots, and (b) had a fast reaction time.This camera is terrific in those areas.  I've taken shots with the lights off and been fairly impressed with them.  My eyes are still better than the camera, and I imagine a digital SLR would be better, but this is still miles ahead of where I'm used to being.The speed is wonderful, I can take pictures almost as fast as I can push the button.  I'm used to a 1+ second lag for it to focus, and with little kids they never smile that long!  This camera is quite fast, so we love that aspect of it too.But even better, the battery seems to last forever.  Way better than the coolpix and olympus cameras I've seen.  dpreview.com has more info on it.It's a 6 MP camera, which I thought was good because my hard drive isn't big enough to store many 10+ MP shots.  A nice balance of filesize and quality.The only downside is that I've had trouble with the 2GB card I bought, it gets corrupted and hangs when I'm uploading pictures to my computer.  Still not sure if it's the camera misformatting the data, the card is faulty, or the card reader is dying.Otherwise, a wonderful purchase for someone wanting to get better than compact-quality without spending $700+ to do it.", "Date": "September 19, 2007"}, {"Title": "Awesome and easy!", "Author": "Lizard \"Photo Moto\"", "ReviewID": "R2XETLDPFK535E", "Overall": "5.0", "Content": "I highly recommend this camera as much for its quality of photos as for the tons of features all within a very compact camera.  The price I got via Amazon was great so all around, I am extremely pleased!", "Date": "September 15, 2007"}, {"Title": "Great Camera", "Author": "Gloria Dickerson \"Book hound\"", "ReviewID": "RFQHB2VJKJLIV", "Overall": "5.0", "Content": "My husband has enjoyed this camera a lot.  Just what he wanted and was even more impressed with the price.", "Date": "September 11, 2007"}, {"Title": "Great little camera, plus a $30 reabte until 9/30/07", "Author": "C. Lazdins", "ReviewID": "R14D1C843Q5FCV", "Overall": "5.0", "Content": "got it the other day, seems to take excellent pictures and tone of features packed into such a small camera.Plus Phtotworld sent along a Fuji $30 dollar rebate for purchases until September 30, 2007.  I am glad I decided to go with the F31fd instead of the F40fd since with the rebate they are almost the same price.Photoworld got it to me in 3 days for free and it was very well packaged.", "Date": "August 9, 2007"}, {"Title": "nice package especially for the price", "Author": "Jeremy M. Slagle", "ReviewID": "R2UFIDZX6G4U8J", "Overall": "4.0", "Content": "I've had the F31 for about 2 weeks now and I am impressed. I have been using a Canon 10D SLR system for several years and I was looking for something smaller to take with me everywhere without lugging a heavy camera bag and lenses. The build quality on the F31 is fantastic. the all metal body and size make it feel like you are holding a hand crafted jewel but it still manages a button layout that fits well in my hand. The image quality is is great and the face detection really comes in handy. When looking for a point-and-shoot my biggest concern was shutter lag. It's no DSLR but it's as close as Ive seen for a point-and-shoot. It wont replace my DSLR for the important stuff but I dont feel like I'm missing anything my leaving it at home and taking the F31 when I dont need the extra baggage. I'm very happy with the purchase. I also went ahead and bought the underwater housing. Took it to the pool this week and the kids had a blast with it.Great product. I would highly recommend it.", "Date": "July 16, 2007"}, {"Title": "The Best Image Quality I have yet seen in a Compact Digicam", "Author": "ColetteDallas \"Colette\"", "ReviewID": "RS5M3XBAWMPTT", "Overall": "5.0", "Content": "The High ISO performance is every bit as good as they say.What many reviews don't mention is just how very sharp and crisp image shot low-light and bright daylight are.This is the first compact camera that I have used that gives the kind of superlative image quality of my Minox 35mm film camera.It focuses fast and accurately and the the interface is very intuitive once you've practiced a bit.The battery life is awesome.It is quiet compact and sturdy with a very pretty brushed metal finish.Get a silicone skin for it, it makes it far more secure to hold and tones down the glittery bits so it is less conspicuous!It is the first compact digital camera that I would not hesitate to take with me on a round the world trip!", "Date": "August 8, 2007"}, {"Title": "GREAT camera for casual photographer, but poor video", "Author": "LawyerMom", "ReviewID": "RIT9X4ZD0GJ1X", "Overall": "3.0", "Content": "By no means am I an expert at cameras or photography.  I am a mom.  And I love to take pictures of my family.  And when I finally get that perfect shot -- when my kid finally looks at the camera and smiles perfectly when they're in the middle of swinging through the air or jumping on the bed -- I want that photo to last forever.  But several cameras failed me and on pretty important occasions.Not so, the FinePix F31fd.  Most cameras perform well when there's plenty of sunshine or perfect lighting.  But other (expensive) digital cameras that I was using kept coming up with really grainy photos whenever I took pictures indoors.  (I had zero photos from my law school graduation as a result.)  There was no excuse for that.  But all the reviews about the FinePixF31fd being the king of low light -- all that is true.  I consistently get clear, unblurred and NOT grainy photographs, no matter whether I take them indoors, outdoors, at noon or at dusk.  I'm a casual photographer -- I don't play with the settings on my camera, nor would I know what I was doing if I did.  I just put it on auto focus, point, and click!  And I have months and months of wonderful photos of my little girl's toddler years which are crystal clear.My major complaint though, is that I wanted a device which would take fantastic digital photos as well as good movie clips.  When you're stocking a huge diaper bag, you don't also need to haul both a camcorder and a digital camera along.  Besides, the Finepix is small enough to always carry in your purse so that you always have it on hand to catch life's unexpected moments on film.  That's what I like about it.  But I wish that the movie capabilities were better.  You can zoom in/out and take the movie, but once the movie mode is recording, you can no longer zoom in and out.  But the BIGGEST complaint I have is that the sound quality is awful -- even the loudest sounds get recorded at a muffle.  Quiet sounds are left off the video altogether.  (Sad for me, I was never quite able to get my baby cooing or babbling on tape.)  If Fuji had worked a little bit longer on the microphone on this guy, it would be the perfect device for me!", "Date": "November 20, 2008"}, {"Title": "Malfuctioned after two weeks of moderate use.", "Author": "Richie K \"quality control\"", "ReviewID": "R25JCWIUIRHZOQ", "Overall": "3.0", "Content": "I purchased the new FinePix F31 fd digital camera on 11/30/2006 and received it about a week later. This camera was purchased to replace a Canon A-85 and was to have been used to take digital photos for the Christmas Season. After about two weeks of moderate use, the camera's shutter release would not work. I tried every troubleshooting suggestion in the manual and from your website, but could not get it to work.  Needless to say, my wife and I were extremely disappointed that we would not be able to use the camera during the Holiday Season and that we would have to drive 60 miles from New Haven to Precision Camera Repair in Enfield, CT for repair.", "Date": "January 11, 2007"}, {"Title": "Fujifilm F31fd", "Author": "David Charles Hill", "ReviewID": "R3QT7NY1SU8ABD", "Overall": "5.0", "Content": "Excellent camera full of features that will make it a very versatile camera for me in the future.Great flexibility in camera settings for all kinds of shots.Battery life is excellent, excellent, excellent.Great value.", "Date": "January 27, 2007"}, {"Title": "I will never buy Fuji again", "Author": "Anonymous", "ReviewID": "R3O7A2OTN1P26A", "Overall": "1.0", "Content": "During the warranty period, the power button malfunctioned. We sent the camera in for repair, but Fuji insisted that we damaged it.  They forced us to pay $85.  A couple years later, the same issue occurred -- the power button malfunctioned again.  We sent it back to Fuji, and they want another $85 to fix the SAME problem, even though we did not drop or damage the camera.  This is just ridiculous.  When we called them, Fuji responded that it doesn't matter how many times the same item malfunctions and they repair it, they will charge us.Forget Fuji.  I'm going back to Canon.", "Date": "June 2, 2009"}, {"Title": "Not as big as they hype, but nice", "Author": "M. Sale", "ReviewID": "R38P3DA083CNUJ", "Overall": "3.0", "Content": "Takes good pictures, wonderful capacity for more manual settings (e.g. speed priority) but face recognition doesn't work most the time.. an important thing to note about face recognition I didn't think of... you need to see the full front of the face, profiles or even mild turns to the left or right render it useless... even when it does recognize, it still seems to expose for an average where light background or shadowed faces don't either expose for the recognized face, nor trigger a flash.", "Date": "May 12, 2007"}, {"Title": "What ever the reviews say...", "Author": "Dr.B", "ReviewID": "R1J47B3X53DSY8", "Overall": "2.0", "Content": "Well, I have read everything about compact digital cameras in the last month and the f30 (and I assumed that would also be true for the f31fd) got great ratings in all reviews. But laboratory conditions are not the reality. I really tried hard and I have to say the camera is fast, has a nice screen the battery last for ever (which is a important feature), you have a lot of manual controls, almost no red eye problems (which is also very good) - but in the end everything comes down to the picture quality and here the f31d is not as good as my old canon powershot s45 (I couldn't believe it!). I thought a couple of years and a new digi cam should at least give you the same quality as your old one. NO! The colors are off and weak (especially if you use the presets of the programs for easy shoots without spending 10 minutes to try all possible setups), the focus is not doing very well and the overall picture (including a lot of noise during indoor shoots - and this cam is suppose to be perfect for indoor shoots) was never better than my old canon (no matter what I tried: indoor without flash, outdoor macro, landscape, portray w/wo flash...). Why should I spend more than 300 dollar to get a camera which can not do better then my 4 year old one? I returned it and I am testing the panasonic fx50 right now. This digi cam has less manual controls but much better picture quality, nice leica lenses and a nice 3'' screen! If you don't believe me, just order it from amazon and compare it for your self!", "Date": "January 18, 2007"}, {"Title": "VERY GOOD PICTURE COMBINATION", "Author": "Jignesh Patel", "ReviewID": "R22S82G2DSCKET", "Overall": "4.0", "Content": "I LIKE THIS CAMERA PREETY MUCH.I HAVE 6.3MP CAMERA BUT IT IS WORKING VERY GOOD.I AM ALWAYS PREFER CAMERA FROM FUJIFILM.FUJIFILM ALWAYS GIVES GOOD DEAL.I BOUGHT THREE CAMERA FROM FUJIFILM,BUT NONE HAVE ANY PROBLEM NEVERJIGNESH PATELCALIFORNIA 90620", "Date": "May 15, 2007"}, {"Title": "light sensitive sensor but very noisy pictures", "Author": "Lalelisi", "ReviewID": "R2O2K7PF13W2VV", "Overall": "2.0", "Content": "I bought this camera in the beginning of January. I was looking for a compact camera (not necessarily pocket size, though) that was capable of taking great pictures and that was also capable of taking movies in a decent quality. Based on test reports at DPreview and other customer reports I decided for the Fuji F31fd. I was intrigued by the new sensor that Fuji is using and that seems to be very light sensitive, which is true. After receiving the camera I took a lot of test pictures under various conditions, with and without flash, bright light, low light, different ISO settings, different exposure times, etc. I compared the pictures with my 4-year old SONY DSC-V1 and the results were amazing. The picture quality of the Fuji was very poor. Colors were 'smeared' but the main problem was noise. Even under bright light conditions and ISO 100 settings the white had considerable noise, same with other colors (RGB noise). I didn't check grey/black noise (as they do in the test reports) but the noise in white and colors was just too annoying. What a disappointment. The lens seemed to be pretty poor as well, at least there was no comparison to the SONY DSC-V1 with a Carl Zeiss lens. After one week we returned the camera and I bought the SONY H5. This is really a great camera, I must admit. The picture quality is even better than with the V1 and I thought that the V1 was already pretty good. I can only recommend SONY's H5, even though it has a different form factor and may therefore not really compare to the much smaller F31fd. What I liked about the F31fd was its size, its responsiveness and the monitor and menu. However, if the picture quality is so poor it also doesn't really help.", "Date": "January 24, 2007"}], "ProductInfo": {"Price": "Unavailable", "Features": "6.3-megapixel CCD captures enough detail for photo-quality 14 x 19-inch prints\n3x optical zoom; 2.5-inch LCD display\nFace Detection Technology built-in to the camera’s processor\nISO 3200 sensitivity at full resolution; VGA movie capture of 30 frames per second with sound\nPowered by NP-95 Li-ion battery (battery and power adapter included); stores images on xD-Picture Card (26MB internal memory included)", "Name": "Fujifilm Finepix F31fd 6.3MP Digital Camera with 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/51DifQJpL8L._SX300_.jpg", "ProductID": "B000L9SCIW"}}