{"Reviews": [{"Title": "Great all around camera for casual user....", "Author": "lordhoot \"lordhoot\"", "ReviewID": "R21ATK81ED0W5T", "Overall": "5.0", "Content": "This proves to be a great all around casual camera for most people who shoot everyday photos, home photos, vacation photos and such thing, print them out on a 4x6 up to 8x11 size for their albums.For a camera of this price and size, there are several unbeatable features that simply cannot be ignored. First is the image stablizer which does work and worked well. Second is the 6x optical zoom when most cameras like this only come in 3x. Finally the ease of use where most people with some prior experience with a digital can probably used this camera without reading the instructions and those with no experiences can used this camera within a hour.One element of this camera which have been slammed dunk by many of the on-line and magazine critics is the \"high sensitivity\" mode which artifically boost up the ISO up to 1600 if needed. This allowed the photo to be taken with little light. What they say is true, if you blow up these images taken with that mode, there will be a lot of noise and almost unuseable. However, you really have to blow it up, poster size almost for that to happened. I took a nighttime shot of Hooter Casino and Hotel in Las Vegas in a moving car without a flash with that mode and it came out looking perfect. For most users like myself who will only print it out at most, in 8x11 size, this mode works perfectly and its a highly useful feature, perhaps the most useful feature in the entire camera. People who will buy this camera will not buy it to take professional photos. So we don't have to judge the \"high sensitivity\" mode as a professional but as a casual shooter and its works just fine for us.For casual photographs, this camera shoot just fine and results are quite remarkable. It may not passed the muster for high demanding photographer who happened to be a perfectionist but for the rest of the casual world, this camera take great images.The battery power is pretty good. If you used their special Panasonic batteries, its better but you probably want to use the rechargable sooner or later. LCD screen is 2.5 inches large of small amount of pixal. Its clear and colorful but not definite. I thought this was the only major weakness of the camera. Its uses SD card, it got enough scene modes to satisfied most users and flash proves to be more intelligent then most of its competitors. The camera is lightweight, compact and easy to use and hold. Image stablizer works just fine although it there to help with the hand shaking and not the blur of the target moving very fast. Many of the senior citizens may find this most helpful. Nervous photographers may find this most helpful.Overall, I won't repeat that already been written by other reviewers and Amazon's own description. I would add my voice that this is one terrific camera for casual photographer and for all its features, it definitely worth the price since you won't get better features for such a price.", "Date": "July 25, 2006"}, {"Title": "OIS really works", "Author": "D. madden", "ReviewID": "R33T3R6SC7U0PD", "Overall": "5.0", "Content": "Camera takes excellent pictures. I took all those pictures and have'nt even looked at the manual yet. I'm also a novice novice.pros:Good battery life and great macro ability. The OIS is excellent with low light especially zoom. Really bright LCDCons: 80000pixel display not sharp enough for meBut for the price with all these features i would'nt go with anything else.", "Date": "May 23, 2006"}, {"Title": "Great value for an everyday camera", "Author": "E. J Tastad \"ejt\"", "ReviewID": "R23BBP5CEM6W46", "Overall": "4.0", "Content": "Update: This is an outdated model.  I paid $200 new for it 01/2007I needed an everyday point and shoot camera to take short video clips, good 4x6 to 8x10 pictures, and to be compact enough to fit in a coat pocket, but still large enough to hold.  I wanted a good zoom lens, at least 4-5x optical.  I also wanted affordable.  I didn't need a fancy top of the line 10MP camera or anything.  I currently have an EOS 300D Digital Rebel, but I wanted something I could take with me without dragging around large lenses etc.My thoughts?  Keep in mind while reading this I am coming from a 6MP SLR camera, so I have pretty high standards.  Format the memory card PRIOR to use, I received memory errors about 1/3rd of the way through, formatted with the camera and it was fine.pros:-image stabilization works well-6x optical zoom lens (many cameras only have 3x)-nice image quality (at low ISO, 80 or 100) without messing around with settings-camera can be forced to use a specific ISO-long battery life with AA batteries-good selection of built in scenes that work wellcons:-slow flash recharge time, about 5 seconds (done to save the AA batteries)-very noisy images at ISO 200 and 400 (1)-no full manual mode, but that is what my SLR camera is forbottom line: Great value for a point and shoot camera to supplement an SLR or as an only camera.  If you want full manual, aperture/shutter priority, look elsewhere.(1) I haven't tried the high sensitivity images (800 and 1600), but I hear they are betterImage stabilization helps for taking pictures in dark rooms, but by forcing it to ISO 100 as I do it counteracts much of the improvement.  It is a nice to have feature though.  In general I notice a lot more noise than my 6MP SLR, but the pictures are still very good.  This doesn't work well when the subject is moving, only for reducing camera shake of course.The lens is nice without much distortion.  The macro mode works well up close, allowing for nice close ups as long as light is adequate.  Another one of my reasons for purchasing a point and shoot camera, it costs less than just a good macro lens for my SLR.  However, there isn't a wide angle mode for this lens, it is 1 to 6x.  This might make it inadequate for taking pictures of a room inside a house (applies to real estate agents)The continuous shoot modes are nice, 6 pictures over 2 seconds or so for the full resolution, and indefinite mode the rate is determine by your memory card, but peaks at about 1.5 frames/second.  These only work with the flash off (best forced to disabled)I love the AA batteries, they are cheap and last a long, long, time.  I think I got at least 100 pictures, many with flash, using the included oxyride batteries.  I would strongly recommend the use of NiMH rechargeable batteries, because they last a long time and recharge quickly, just carry some non-rechargeable batteries for emergency use (NiMH batteries discharge rapidly when cold and only hold a charge for about 30 days).  Instructions explicitly say NOT to use lithium batteries, although others say they have used E2 lithiums from Energizer without any trouble. They don't specify what lithium does, but the general comment says it might cause the battery life meter to read wrong (who cares), or it might cause overheating and memory corruption (important, but this might not apply to lithium cells, I don't know).Video is good, but you can't change zoom levels once you start recording.  Not much else to say.  It will work for my purposes.  It is much faster to get the point and shoot camera out when I see something funny than it is to dig out the video specific camera.I would buy the same camera again.  For the price it is a great buy and it fits my needs perfectly.  My 4 star review is because of the noise at higher ISO settings, to me, it really does reduce the image quality and it is hard for me to look at the pictures.  It might not bother you if you are used to point and shoot cameras.", "Date": "January 20, 2007"}, {"Title": "Great Features, Great Value", "Author": "Shopping Queen \"pamrose\"", "ReviewID": "R15Q7ZK7NZ14QI", "Overall": "5.0", "Content": "I was looking to replace my 3 & 4 mp Nikon and Kodak cameras.  Let me preface this review with a strong statement that I am NOT a professional and wanted a good family, vacation camera.  One feature I wanted was more zoom.  This camera has that 6X vs the usual 3x optical.  It really is all the difference when you are trying to capture those moments at a child's school play or little league game.  My old cameras could not come up close enough, they were dark and noisy, with this camera, I took pictures from 100 feet away and they look great. I did not need a camera to print poster size prints so 6MP is great.  The image stablization really works (I am shaky sometimes)and the camera pretty much self adjusts for the lighting.When I was looking for a camera, I had a friend who is a published professional photographer help me make a choice.  He was a doubting thomas about any of the lesser point and shoot but told me this one looked the best out of the bunch (even though he said Nikon and Canon had better names).  Now a few weeks later he saw the camera and the photos it took and is simply amazed.  Cannot believe the price and all the extras.  One of our other friends ordered the same camera when he saw how great the photos were.I bought a 2mg high speed SD card and I believe that is helping with the quickness of downloading the images a great deal.  I have also been playing with the macro function and have been getting great closeups of sliced pepperoni, peanuts in a shell, ball of wool.  My friend the pro said I should submit them to a photo mag.It's a great camera and I look forward to exploring the many diverse uses it has.", "Date": "January 23, 2007"}, {"Title": "Excellent camera, terrible warranty", "Author": "Ricardo V", "ReviewID": "R2GJYUHM242P29", "Overall": "3.0", "Content": "I bought this camera 10 months ago from Amazon. It was my 4th digital in seven years, and definitely my favorite one. The size is just perfect to carry around, and the 6X optical zoom with image stabilization is hard to beat. At the time, I struggled between this model and the Canon counterpart, but at the end, I was really happy with my decision. I actually stopped using my video camera, storing movies in my 4 2GB SD cards.One week ago, the flash stopped working. I thought to myself \"no problem, the one year warranty will cover it\". Well, guess what, the warranty only covers parts, and the labor flat-fee from Panasonic is $170.00 USD. I can buy a new one on Amazon for $20.00 USD more! I wrote to Panasonic, but didn't get a satisfactory response from them.I am switching now to the Canon Powershot A570 IS, which supports image stabilization, and 7 Megapixel pictures. Their warranty covers EVERYTHING for one whole year, so at least I feel safer buying their product. The price is a little bit higher than this model, but totally worth it.Something to keep in mind if you are considering to buy this model.", "Date": "April 25, 2007"}, {"Title": "Panasonic Lumix DMC LZ5K", "Author": "Ann E. Defenbaugh", "ReviewID": "R36PZFKAK6040W", "Overall": "4.0", "Content": "Excellent for a small compact digitial camera. Good zoom. Pixels moe than adequate. Enlarged some photos to 11x24 without any loss. Good use of battery time. Only wish it had a view finder in addition to LCD screen.", "Date": "January 11, 2007"}, {"Title": "One of the best out there", "Author": "That Guy", "ReviewID": "R12IB3TYWL1VMJ", "Overall": "5.0", "Content": "The camera is very versitile, I bought it for it's manual features, retro look, and slightly larger size.  This camera is by no means big, and bulky, but, I don't feel like I will loose it easily, or due to it being so small, forget I put it somewhere and sit on it!  It was recommened to me buy serveral photo students, and it produces well.  It is the sort of camera I could see becoming a very cool, keeper that in the near future will become one that is sot after.  With the upgraded one gig card, holds over 300, 6 meg shots!Great buy!", "Date": "January 21, 2007"}, {"Title": "Great value, excellent photo quality, easy to use and navagate", "Author": "Wiseguy 945", "ReviewID": "R3UC1K97BFIPQ8", "Overall": "5.0", "Content": "I just picked this camera up recently on sale at one of the national chain stores, and so far it has been nice. A thing up front, this unit does use 2 AA batteries and does not have a rechargable battery built in. Not a huge deal since you can buy rechargables, but it can chew through regular batteries quickly, so the Lithium Ion or oxybutide batteries are worth the investment if buying disposable. I plan on buying a couple of set of rechargables and trying them out as well.Now, Overall, I weighted out which camera to buy. My brother has an olympus 710 and it does work great with the digital stabilization, computer enhanced and processed for clarity. This Panasonic LZ5 has an Optical stabilization which dampens movement to take a clear picture immidiately, without any computer processling. This does help well to elimitate the tremor on zoom. Also, a great 6x optical zoom, added with 4x digital for 24x zoom. THe better the optical zoom, the better the picture will be if shooting in zoom. Digital zoom will pixilate a picture at high maginification, the optical zoom delivers true clearer pictures at farther distance. Megapixels are great, but if you shoot with digital zoom, it won't be any clearer than the cheap model cameras. Besides, this camera has 6 Megapixels, more than enough for the average user. This means it can deliver the capability of a 14x19 picture...and which average user prints photos that big. most people print 4x6 or 8x10, and trust me, this camera will cover that brilliantly. This camera does come with Video out cables for video playback, yes this can record video clips. Also, their is the optional power cord attachment for when you are using it at the computer or hooking it to a tv to save batteries. This does use any standard SD memory card up to 2 gigabites. My lz5 model has the capability of shooting picture in standard 4:3, 3:2, and a store exclusive 16:9. The software is great as well. In all, a good value for a great camera. Check it out, its had to find a camera with this optical zoom and megapixel for the price.", "Date": "February 5, 2007"}, {"Title": "Great camera for regular user", "Author": "Gerardo E. García V", "ReviewID": "R130L73SAQGBS9", "Overall": "4.0", "Content": "I have been using it for almost a month and it has worked perfectly.  My only complain is that the batteries that it includes lasts less that the middle of time that it says.  However, you can replace them with Alcalina which works good.Great product for a regular user.", "Date": "January 11, 2007"}, {"Title": "Great Camera", "Author": "B. COX", "ReviewID": "R6P1JA5HS6CJP", "Overall": "5.0", "Content": "I bought this camera with travel in mind.  I'm a senior at college, and studying in England for a semster.  I've been to loads of places and taken loads pictures. I am completely behind the purchase of this camera for any body. Of course there has been a few out of focus, but that wasn't the camera's fault, but rather my own. It has been a breeze to use, and even my poor old chap of a father who has just broken through the barriers of using a VCR can use it.  My mom and dad came over for 3 weeks and he asked if he could use it when I wasn't with him. He produced a number of pictures and used a number of the settings. I've not found a use for the baby settings, but the scenary settings are great. Also it is great b/c it uses AA batteries, which can easily be replaced on a moments notice.", "Date": "November 5, 2006"}, {"Title": "Good digital", "Author": "R. Karmakar \"go digital\"", "ReviewID": "R6UOAIPT9B2K1", "Overall": "4.0", "Content": "This camera is good for point and shoot. However when in auto the pictures seem to have a lot of noise. I think this is one of the main problem with Panasonic sensor; Even when I fix the iso at 80, there seems to be a lot noise.  The camera takes good pictures at sufficient light. I am especially impressed by the movie mode. It can take really good quality movie at 30 fps. Overall at this price I think it is a good camera.", "Date": "March 8, 2007"}, {"Title": "Good camera, misses some features.", "Author": "R. R. NOVAES", "ReviewID": "R3JGJ0OIIFG3LM", "Overall": "4.0", "Content": "This camera is nice. Looks good, and has the feel of a \"normal\" camera. If you want those very thin cameras, this is not the one for you. Exposure and color balance are very consistent, both indoors and outdoors. Anti-jitter works well, but tends to produce somewhat grainy pictures. Better keep your hand steady, specially if you use the 8.3x (max) zoom. It's a shame, though, that it doesn't include preferential aperture and exposure time modes. Sometimes, automatic just won't do what you want. Batteries compartment tends to open if you carry the camera in your pocket, so be sure to buy a case with it.", "Date": "November 13, 2006"}, {"Title": "very capable camera", "Author": "Nicole Machi", "ReviewID": "R1SKOJVDY5688B", "Overall": "5.0", "Content": "I mainly chose to buy this camera for the 6x optical zoom- I do a lot of hiking in Yosemite and near my home in the French alps and wanted to take close-up pictures of the beautiful scenery. The camera has proved to be a great investment.This camera is much better than any other camera I've used in the price range. The image stabilization works well, and it captures great pictures of my active kids. It has many features I haven't learned to use- they may be useful, but the camera simply takes great photos on the basic settings, so it's a good choice for beginners who want a camera that works easily, but that also has more complicated options for better pictures as the user improves. The only trade-off is the size- the camera is a bit large and clunky compared to the sleek new cameras I've used, but it's really worth it if you can spare the space- there's a lot packed into the camera. I own this and the DMC-LZ5 silver version and they are both perfect for pictures and video- I highly recommend this camera!", "Date": "June 12, 2007"}, {"Title": "EXCELLENT CAMERA, BUT DON'T BUY", "Author": "Z. Rojas Llobet", "ReviewID": "R8ZDO5QSTUQ1B", "Overall": "5.0", "Content": "look for the \"Panasonic Lumix DMC-LZ7K 7.2MP Digital Camera with 6x Image Stabilized Zoom (Black)\", you can get it for less price and it is obviously better!", "Date": "April 29, 2007"}, {"Title": "Can't beat for the price.......", "Author": "Frank J. Romolo \"Romz77\"", "ReviewID": "R39SOZ426UP6K5", "Overall": "4.0", "Content": "I have owned this camera for a little over a month now, and Love it......with the features it has, and price, it is tough to find a better buy.....Only negative of this camera is, as stated in another review and magazine reviews, if using the high sensativity mode, blowing up the pics to poster size is not a good idea......won't come out well at all......But besides that, the pitures taken with this camera are excellent quality, and it is very easy to use....I would defiently suggest this camera, the chances of finding a better camera at this price is almost impossible.......", "Date": "November 12, 2006"}, {"Title": "Lumix DMC-L25K Digital Camera Review", "Author": "Old Kevie \"fish/hunt/hike\"", "ReviewID": "R1USN5DSTK8KNL", "Overall": "4.0", "Content": "I do a lot of fishing, hunting and hiking and wanted a \"smaller\" camera.  This camera balanced size, performance and price better than anything else I could find.  It is quick and easy to use  ( after you spend a good amount of time understanding how to use it and it's seemingly endless options ).  Many of the pictures that I end up taking are either in bright sun or frequently in the woods with a blend of light and dark that can be difficult for some cameras to meter properly.  This one handles both situations very well.  I also needed a camera that would meter/adjust to quick movements.  So far this has handled that pretty well also.  For the money,  you will be hard pressed to find a camera that does as well as this one", "Date": "October 30, 2008"}, {"Title": "Great zoom, Great color. Great Image Stabilizer, Little noise", "Author": "Shouvik Basu \"Shouvik\"", "ReviewID": "R9KZCFRMZFIQG", "Overall": "4.0", "Content": "This product has got great zoom 6x (compared to other compacts), great and accurate color. The Image stabilizer is rare in models in this price range.Only cons, little noise.At 6.3MP really did not matter to me as I print in A4 or Letter.Oh yes, and movie quality is also really good. zoom cannot be changed while movie recording is going on.", "Date": "February 22, 2007"}, {"Title": "Great Cam", "Author": "Jason Yost", "ReviewID": "R6XX1KKPEQP1I", "Overall": "5.0", "Content": "This camera is great.  Got it in the mail the other day and now cant stop taking photos.  The photos are very clear, and the optical zoom is great.  Way better then the previous Kodak we had.", "Date": "March 10, 2007"}, {"Title": "camera for every day life", "Author": "Lorenzo Lisciani \"lorenzo\"", "ReviewID": "R2ZDL1S8ZDFEEK", "Overall": "5.0", "Content": "I am really satisfied about the performance of this camera: the Lumix lenses deserve all the best compliments.It can be used for evey situations and nevertheless being a simple compact camera reach high performance.", "Date": "March 8, 2007"}, {"Title": "Good Camera, Nice Quality", "Author": "Raj Goel \"Raj\"", "ReviewID": "RCG0AX08GBD40", "Overall": "4.0", "Content": "Though it is my very first digital camera, but I think in first buy itself I made a wise decision. :-) Initially I was bit scared while buying it over well know products Canon/Sony. Picture quality is very good, zoom works pretty fine though couldn't make out till now how to make the optimal use of both digital & optical zoom combinedly. Dim light is not atall a problem with this camera. Even the night pictures are as bright as day light pictures. Yet to explore the other features of this, but in the last 2 days it seems to be a good buy.", "Date": "December 21, 2006"}, {"Title": "first and best.", "Author": "uh...what", "ReviewID": "RIVMHN7YH9NLT", "Overall": "5.0", "Content": "This was my first digital camera when it was first introduced (i think). It had been replaced by a Sony cyber Shot. I loved the pictures from the Lumix so much better. I had taken it on its last voyage...a trip to Bermuda on a cruise back in 07. The shots were gorgeous. The sony's quality can't even compare to it. I'm very much a beginner when it comes to cameras. I know that all of these shots were taken in sunny conditions outside. But I even have stunning pictures with a flash at night indoors. the colors were just brilliant. And i'm sad i did not stick to my lumix or at least a panasonic.....i was just looking for a prettier, thinner camera to replace it with. wrong move", "Date": "January 23, 2014"}, {"Title": "Terrible value and camera!", "Author": "Deborah King", "ReviewID": "R1M0TALQ9X93AX", "Overall": "1.0", "Content": "This camera took blurry pictures and the flash took so long to recharge that you lost valuable pictures! I would NOT recommend this camera!!", "Date": "January 16, 2014"}, {"Title": "Great camera", "Author": "PJD \"smart shopper 30144\"", "ReviewID": "R3663ULSHBPE2M", "Overall": "5.0", "Content": "I have owned this camera in the silver version since it was first introduced. I paid one hundred and fifty dollars for it at Best Buy at the regular price. The image stabilization was a really big deal back then. The prices being charged now for the cameras being offered here are beyond ridiculous. This is a great camera but there are certainly better ones out there for what some sellers are listing.I mostly use the \"simple\" mode and it does just fine. The 6x optical zoom is a nice feature. I use the macro setting on my flowers, spider webs, mushrooms and other nature shots. Enlarged pics have come out so well they have been given as gifts. (I print at Walmart) The battery life with AA's is acceptable and I like the fact that I can keep some spare batteries in my purse and don't have to worry about a recharger etc.I have high MP cameras but I keep picking up this camera when I'm on the way out to shoot something....or I just keep it in my purse for those \"just in case\" pictures you come across when living in the No.Georgia mountains.", "Date": "June 10, 2012"}, {"Title": "WONDERFUL Camera!!!", "Author": "Turelie02 \"Turelie02\"", "ReviewID": "R470VR2A25WV2", "Overall": "5.0", "Content": "This camera is GREAT! It does everything that I could ever want it to do. Its got all kinds of fun features so that I can take any kind of picture I want to take, but even if you go on a vacation and ask a complete stranger to take a picture for you, it has a simple mode so it becomes a point and click camera. The only kind of pictures that I have had any trouble taking were sport pictures at night, which of course would be difficult due to the lack of light and increased shutter speed. I just lightened them up once I was able to get them onto a computer. Great camera for a wonderful price! I absolutely LOVE it!!", "Date": "March 25, 2007"}, {"Title": "great camera", "Author": "Jamslam \"music junkie\"", "ReviewID": "R1QTJRP17A80BQ", "Overall": "5.0", "Content": "the camera is good for the price  you pay. Stabilization is great. pictures  are crisp and clear. zoom rocks !!!", "Date": "March 8, 2007"}, {"Title": "A very good pick for a compact digital camera with a respectable about of zoom.", "Author": "Richard O. Mccoy \"Digital Gramps\"", "ReviewID": "R394X9QAJJ31RP", "Overall": "5.0", "Content": "A very good pick for a compact digital camera with a respectable about of zoom. It's also from a respectable name that makes a number of good cameras.", "Date": "February 17, 2007"}, {"Title": "had to have a new camera for vegas", "Author": "john's wife", "ReviewID": "R2641N73F5LEMY", "Overall": "5.0", "Content": "I had wanted a digital camera for some time after all my kids had had one or two and here i was still using one with film in fact i still have about 10 films that i still have to have developed. My husband searched and researched as had I and just did not know which camera to buy,well this one won out at first i was not very pleased with the picture on the LED screen(grainy) but when printing the picture was pleased with the clarity and was extremely happy with the outcome. I did not have much time to read all of the instructions before our trip and i still do not know everything that this camera can do but i love it , the ease of use ,the price i paid do not regret my purchase of this camera. Thanks, Rhonda", "Date": "November 29, 2006"}, {"Title": "Panasonic LUMIX", "Author": "Juan Verde \"Libro de Compras\"", "ReviewID": "R2AQ834BHEUST9", "Overall": "4.0", "Content": "The camera is perfectly that I like, but your offered me with the purchase a memory 1gb free and did not send it to me.Con la compra de esta camara Uds ofrecian una memoria de 1g gratis, pero esta no me fue enviada. Quisiera saber porque?", "Date": "February 8, 2007"}], "ProductInfo": {"Price": "$319.90", "Features": "Widescreen 16 - 9 Mode for Panoramic Images lets you shoot images in widescreen (16 - 9 aspect ratio), so that you can achieve bold, panoramic images, and view photos as full screen images on your widescreen TV\nSnap Off Consecutive Shots at 3 Frames per Second! You can take up to 5 images in Standard Mode and 3 images in Fine Mode with full resolution. In addition, the Unlimited Consecutive Shooting function lets you continue shooting until the memory card or built-in memory is full.\n6x Optical Zoom in a Compact Body - Use the 6x optical zoom (without the extended optical zoom) together with the 4x digital zoom to enjoy up to 24x zoom power.\nTwo Convenient Power Sources--Alkaline or Rechargeable Batteries - It can be powered by two AA alkaline or two rechargeable nickel-metal hydride (Ni-MH) batteries. Two Panasonic Oxyride batteries are included, that allow you to take up to 235 photos. Alkaline batteries let you take about 175 photos and nickel-metal hydride batteries allow up to 390 photos.\nBuilt-In Memory--Shoot Even When You Don't Have an SD Memory Card - The built-in memory holds up to 14MB of image data, which you can later upload to an SD Memory Card or PC.", "Name": "Panasonic Lumix DMC-LZ5K 6MP Digital Camera with 6x Image Stabilized Zoom (Black)", "ImgURL": "http://ecx.images-amazon.com/images/I/41DG906S48L._SX300_.jpg", "ProductID": "B000EBHZQ2"}}