{"Reviews": [{"Title": "Small Size is the Only Positive", "Author": "Camera User", "ReviewID": "RTU4FQSCNXOTD", "Overall": "2.0", "Content": "(...) Took 5 pictures with and without flash.  My other camera is a 3-year old Canon S100 with 2MP resolution and I will review my experience with the DXG-409C in compariosn to the Canon.Pros:- Small Size- Nice fit and finish (plastic body but feels ok)- Package includes case (Had to buy extra for Canon)- Uses 2 inexpensive AAA batteries (Canon uses pricey Li-Ions)- No special software or driver was needed under Windows XP and the camera was recognized as an external drive (but they did include a CD with drivers and imgae software).- Date and other settings retained even when batteries are replaced.- 4MP (officially).Cons:- No optical zoom (I guess you can only get digital zoom at this price point)- Long 5 second procesing time after every shot- Even at 6 ft, the picture was slightly fuzzy (I didn't use  digital zoom).  2MP Canon pix were distinctly sharper.- No lens cover- Flimsy rubber-like cover for USB-out, difficult to use.- Batteries drain very quickly especially if using flash.- Even at 4Mp and \"Best\" Image quality setting, the final iamges are about 450KB which is about the same size as the 2MP images on the Canon.  Is the DXG overcompressing the JPGs and is this why the pictures are fuzzy?Bottom line:For casual/first time users, this should be ok.  If you are serious, have used a brand name digital camera before or plan to keep the camera for 2-3 years, stay away.", "Date": "February 19, 2005"}, {"Title": "A decent little camera", "Author": "Ed D.", "ReviewID": "R214UNYV3PISNP", "Overall": "4.0", "Content": "I've had this camera for a little over a week and I've found that it takes decent pictures. They aren't quite as good as my Kodak CX6330, but the DXG-409C costs about half as much. Overall, the pictures are pretty good; better than indicated by the previous reviews.I was looking for something relatively inexpensive ($100) and small enough to put in a pocket and the DXG-409C seemed to be the best option. It works as advertised. Picture quality is certainly acceptable, though not outstanding. Clarity is decent and colors are true, but not quite as vivid as they could be. For casual photography it's fine. The major disadvantage of this camera is the long processing time after a picture is taken, but that's typical of cameras in this price range. I haven't tried movie mode yet, but I expect it will work well enough under good lighting conditions. I haven't tried the voice recording feature yet either.Rechargeable batteries are a must as they are with all digital cameras. This camera takes AAA batteries. Most AAA rechargeable NiMH batteries that you'll find in stores have 750 mAH capacity, but the newest ones from Energizer are 850 mAH. They're starting to hit store shelves now. I bought a pack of four 850 mAH AAA Energizers from my local Target for $10.Bottom line: You get what you pay for. At this price, you expect to get a camera that takes photographs acceptable to the casual photographer. The DXG-409C delivers on that score, plus it has full-motion video capability, voice recording capability and it's small enough to slip in a pocket or purse. In my opinion it provides good value for the money, but don't expect it to equal the performance of an expensive camera. (My rating of 4 stars is based upon the performance I expect for a $100 digital camera.)", "Date": "March 28, 2005"}, {"Title": "A Very Good Value Entry Level Camera", "Author": "Chuck", "ReviewID": "RCMAPURMJWJH7", "Overall": "4.0", "Content": "I looked for a \"glove compartment\" entry level camera and the DXG-409 exceeded my expectations. I have taken about 600 images with it and it functions reliably and produces acceptable results. The shortcomings are the typical rechargeable vs non-rechargeable battery issues (I use rechargeable batteries)and lack of optical zoom. But when you are out in the field and need AAA batteries, just head for the local drugstore or convenience mart. The 5-second \"processing time\" between shots can be a disadvantage, also the dim LCD image in bright sunlight. But for the point and shoot fixed focus casual user, it's great. Just remember to anchor yourself when shooting to eliminate a blurred image. The software can enhance substandard images with acceptable results. I also like the internet mail image sharing feature of the software.My experience with the DXG 409 (cost $85.00 USD) has encouraged me to look at the new DXG-528 5 megapixel with 3x optical zoom and AA batteries.In summary, the DXG-409 is a very good value for the entry level user - I've given it a \"4 out of 5\" rating.CER, Simi Valley, CA", "Date": "September 24, 2005"}, {"Title": "Pictures are very fuzzy, pass this one up.", "Author": "Rajendra Mandalia", "ReviewID": "R1K6LVEWFORKD0", "Overall": "1.0", "Content": "I first tried taking pictures in Auto mode but those did not turn out very good. I then spent some time tweaking all the settings in Manual mode but nothing helps, the pictures this camera takes are fuzzy and extremely poor quality. Though the product comes packaged well and includes all the little extras (cables, case, strap, batteries) I would not recommend this product even to first-time or casual users purely because of the poor quality pictures.This was an impulse buy because of the price but I'm taking it back to the store first chance I get.", "Date": "March 4, 2005"}, {"Title": "Great Camera!", "Author": "Spookilove", "ReviewID": "R3V8029CSUAUU5", "Overall": "5.0", "Content": "Im not very camera savvy, so I was really weary about spending alot of money on a digital camera that didnt take good pictures. So I got this camcera for a little under $100. And I am very pleased with my purchase! The pictures are good quality, the software was easy to use, and the camera can use a SD memory card, which makes transferring pictures very very easy. Thumbs up!", "Date": "January 5, 2007"}, {"Title": "Very disappointing - returning tomorrow", "Author": "MissLibertyBoxer", "ReviewID": "R1CFLVAGNGY6JC", "Overall": "1.0", "Content": "Even though this camera is affordable, the picture quality is terrible.  This was a Christmas present for my son and we are returning it.  The picture quality is very fuzzy.  I want pictures to look like a real photograph.  My original digital camera that is over 5 years old and only 2.1 mega pixels is far better than this one.  Save your money!", "Date": "December 26, 2005"}, {"Title": "My first digital camera...", "Author": "Jonni L. Vann \"Jon\"", "ReviewID": "RSF6UFYLGVPBV", "Overall": "4.0", "Content": "I think this is a great camera for the price.  I didn't want to make a huge commitment so this was a great choice for me from a price standpoint.If you read the directions, you can take a reasonably good picture.It is slow to be able to take another picture right away and it devours batteries.  The memory card that is required is going to cost more than I had hoped to have to spend to make this camera more user friendly.", "Date": "April 21, 2006"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000799ONI"}}