{"Reviews": [{"Title": "Dont bother wasting your money.", "Author": "E. Scinta", "ReviewID": "RD2EQJ4TCXIM4", "Overall": "1.0", "Content": "I was looking for a cheap digital camera, because the previous one I had broke and the company refused to fix it. So I saw this, thinking it would be a good camera. But its not. This has to be the worst digital I've ever seen. And I've seen some bad ones.The main issue I have is that the display screen sucks. No matter how bright it is around you, the screen is always dark, to the point where you can't make anything out. I read through the manual to see if there was anything I could do to remedy the problem, but I had no luck with it.The second issue I have is that the battery life sucks. I've never seen a camera eat up batteries so quickly in my life. You can take maybe 5 pictures and then the whole camera shuts off and your batteries are dead. Even if you put brand new batteries in the thing.Other issues are that the flash is just right out annoying. You have to constantly wait for the flash to be ready, which seems to take forever. And then when its finally ready, it wont let you take the picture. Or the batteries will go dead. And forget about taking a picture without the flash, because you'll be left with an almost black picture, which you cant make anything out.When you do take a picture with the flash, you get an okay picture, but it looks grainy. I had to use my photo editor to clean it up.The video option sucks as well. You only can film 60 seconds. And the video turns out dark and you cant make anything out. Plus you can barely hear the audio of it.Dont waste your money on this camera. I ended up just tossing the thing because it was so bad.", "Date": "April 25, 2008"}, {"Title": "Good for the price.", "Author": "AmazonBuyer \"Dessa\"", "ReviewID": "R3V058J9WC3V1H", "Overall": "3.0", "Content": "Pretty simple & easy to work with. I had problems with lighting for a while, pictures turned out VERY DARK. Finally, I found the setting that fixed this problem... now pictures are way better. It really doesn't take good pictures in the dark, but you can make the picture out if you're on the right setting. Camera is nice overall, and very light weight, which is a pretty good thing. This is a good priced camera, but you are getting what you pay for. If you're not too serious about your pictures, and just need something at a good price; this camera is for you! (:", "Date": "January 1, 2009"}, {"Title": "Good for outdoor pics only", "Author": "Illinoisguy1", "ReviewID": "RYUBA9GQ39DT2", "Overall": "3.0", "Content": "Just got this camera as a cheap introduction to the digital era of pictures.I bought it on clearance at another retailer and went by the name of Polaroid.The package makes it sound like you don't need a memory card to use the camera. Well once you power it up it notifies you right away to Insert Card. And you can't do a thing with it until you do.The manual is a little vague on how to operate the camera and most of it I had to find out for myself.For example, as far as I could find out it has no flash. When in the picture mode you need to push on the \"trash\" button to turn on the lights.When I got the camera I put in two brand new AAA batteries and I took about 30 photos. Some while on the way back as well as indoor shots.The ones I took on the road were clear and bright. Even when bouncing around it took a clear photo.But when I got home and went indoors the pictures turned out fairly dark. And that's including using the built in light feature.As others have pointed out the display is dark and there is no way (that I could find) to brighten it up).As I said above I took about 30 photos and then my batteries died.The manual says to use Alkaline batteries, but since this is a high-drain product I couldn't see why you couldn't use Lithium batteries. I plan on buying some soon and trying it out in this camera.Hopefully it'll make for a better experience.", "Date": "March 4, 2012"}, {"Title": "It's not like I expected it to be good", "Author": "TW", "ReviewID": "R1PV4KNW6FBB5H", "Overall": "1.0", "Content": "All I wanted was a cheap digital camera. I understood that for the price, I would have to sacrifice quality. But, really, when the box says \"16MB of internal memory\" I expect it to take pictures without paying for a memory card. When the box comes with a USB cable, I expect my computer to detect it... at all... ever.I had a digital camera ten years ago that eventually broke. The camera, back then, cost $50. It wasn't very good, even by ten years ago's standards... but guess what? I had fond, nostalgic memories of how good the picture quality was, how good the display was, and how great it was to use my old, cheap, obsolete camera.", "Date": "October 6, 2011"}, {"Title": "Not a good camera", "Author": "Cherry Delicious", "ReviewID": "R7MDSNM6V431F", "Overall": "2.0", "Content": "First off, I'm a picture whore. I take pictures crazy with this digital camera. This was a gift from my parents. It's alright for picture quality.HOWEVER, after awhile it just makes me pissed.1. I put fresh batteries in or they are still good. I try turning it on, but it doesn't go on, but goes off. The lenses opens up, but closes up. You have to click on button to turn it on over & over again at times.2. Spending money on 4 AAA batteries is not worth it.I had this camera for quite awhile though like 7 years about. Last month ago, it decide to screw up on me. Turn it on. The lenses screwed up on me. The display screen is black, which means the lenses was stuck (not open)  I tried everything. Hit it gently against the desk & all, no luck. Now it's junk now. I'm upset a bit, because I love taking pictures & don't have a digital camera to take pictures with it. Although, at the same time, kind of happy, plan on getting a new & better one. Get rechargeable batteries as well too.", "Date": "September 6, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000FW2I5S"}}