{"Reviews": [{"Title": "One of the best compact digital cameras on the market...", "Author": "JoJo", "ReviewID": "R2PE2PKV3BHO9M", "Overall": "5.0", "Content": "I just purchased this as a replacement from my Sony P-100 5 mega pixel camera. WOW! This camera is definitely a sleek improvement from past models. Aside from the 7.2 megapixel count, this camera excels in almost every conceivable area relevant to compacts.First off, this camera starts up in less than a second or so--truly fast compared to other similarly priced cameras. This feature is essential when attempting to capture that oh so special kodak...er...sony moment in a blink.Secondly, the camera is beautiful. Sony got it right this time when designing a sturdy, compact and lightweight technological masterpiece. True, it's not as small as its even lighter cousin--the T-33, or the Pentax Optio S5n and Casio Exlim models, but it passes the pants pocket test with flying colors. Additionally, when compared to the T-33, this camera uses the regular memory stick size and not the smaller duo like the T-33. Sooooo, if you already own a sony, this is a natural upgrade.Some other excellent features on the P-200 are the manual overides. You can adjust the shutter speed and aperature which, for a camera in this class, is a true rarity.I also am enjoying the extremely high quality video mode; although not the most important selling point, having the ability to take camcorder like videos with sound for unlimited amounts of time (unlike 30 second segments from many other cams) is handy.Another amazing feature is the battery life. I remember my first sony digital camera--the DSC-P50 2.1 mega pixel. It's battery life was dismal. My P-72 was slightly improved, but still suffered from chronic battery munchies. The P-200 fully charged can take pictures for over 200 minutes! If you're on the display modes, it can last almost double that--another breathtaking accomplishment. The info lithium works well in calculating the remaining battery life--a major complaint from owners of other cameras like Canon that lack this feature. Lastly, it is a proprietary battery, so purchasing an additional one is recommended.Needless to say, the 2\" lcd is gorgeous, just like the past sony cameras I've had. It's extremely hi-res and I have no difficulty seeing it in sunlight. The lcd's navigation is similar to earlier sony cams with a few new additions. Sony finally placed a protective screen over the actual lcd to prevent damage...took them long enough, but it's much appreciated.Overall, I'm tremendously pleased with the picture quality from this puppy. I envision this camera lasting well into early-mid 2006 when Sony will release yet another improvement. Until then, I highly recommend this for most anybody who appreciates quality and functionality incorporated into a lightweight package.", "Date": "February 26, 2005"}, {"Title": "Probably my last camera for a while", "Author": "maxxpwr \"maxxpwr\"", "ReviewID": "R3MQ4TXOM92BB1", "Overall": "5.0", "Content": "I thought my old Olympus C50 was going to be my last digital camera for a while, but then the P200 was released as an update to the already-excellent P150 and I convinced myself to buy it.I think Sony did a great job on this camera.  It is perfect for those who are tech savvy but really appreciates technology when it is used to make something better without making it cumbersome to use.The Sony DSC-P200 is first and foremost a point and shoot camera designed to capture every-day life images and the occasional video. To best serve that purpose, it is compact, easy to use, and have an exceptionally quick turn-on time. It's not the smallest camera, but it is compact enough to fit inside small pockets, and substantial enough to be easy to hold. Sony cameras, like most Sony brand products, have excellent user interfaces that are logically laid out and easy to comprehend.  I figured out out to use my P200 without reading the manual.  I will probably refer to it to see exactly what the scene modes are but that's about it. The large 2 inch LCD on the P200 also makes it much more user friendly than smaller 1.5 or 1.8 inch displays.  The turn on time for this camera is one of the best, probably somewhere around a second between pressing the power button to being able to snap a picture.  My old Olympus C50 took 3-4 seconds and it was a real bother.Ease-of-use points aside, this is a 7.2 Megapixel camera and it packs a picture-quality punch that is surpassed only by high end cameras such as the SLR variety.  Untill full reviews come out on one of the well known digital camera review sites, I think it is adequate to use reviews for the P150 as a guage.  Those reviews have all been very positive on the P150 and the P200 is at least as good as the P150 in terms of picture quality.Some words about blurrness...I've heard/read about Sony digital cameras taking blurry pictures and all expert opinion attribute the blurrness to two things: image processor, shaky hand/mount.There are only a few Sony digital cameras that suffer from blurry pictures caused by an image processor that is too agressive in performing noise reduction.  The DSC-W1 is probably the best and most recent example.  However, the DSC-P150 does not have this problem, and neither does the P200 according to what I've seen and the pictures I've taken. I tried a DSC-W1 for 2 weeks before returning it so I know first hand what the image processor induced blurryness looks like.The second cause of blurryness is a classic case of shaky hands.  The newer generation of Sony Cameras seem to be programed to prefer a longer shutter open time rather than increase ISO or turn on the flash.  It tries to make the most out of available ambient light before making use of adjustments that compromise picture quality.  What this results in are shutter speeds as slow as 1/30th of a second before the camera will start using the flash in full auto mode.  This combined with 7.2MP of resolution will result in blurry pictures if the hand holding the camera isn't absolutely still. In trying to maximize the picture quality of the camera, Sony has traded off some real-world usability.  Whenever I use my P200 to take a picture and see that the shutter speed is 1/40 or slower, I will make a mental note to brace myself when taking the picture, or at least use both hands.All things considered, it's hard to imagine a more perfect combination of everyday usability and performance.  The P200 is perfectly at home snapping birth-day party pictures for 4x6 prints, or mounted on a tripod to get that perfect shot for a 8x10 blow-up.", "Date": "March 15, 2005"}, {"Title": "Amazing Digital Camera, Incredible Value", "Author": "P. Scott Pope \"Scott Pope\"", "ReviewID": "R1GV3524MMVSSP", "Overall": "5.0", "Content": "The DSC-P200 is an amazing piece of technology that demonstrates how far digital photography has come. With a 7.2 MP resolution, 3X zoom, lithium ion battery and a 2\" LCD screen squeezed into a tiny package, this camera is truly amazing. The output is no less impressive with quality superior to that of any other camera I have seen.One of the advantages of a camera this small is its ability to be carried in your clothing without relying on an external carrying case. While this is a great attribute that allows you to bring it to parties for impromptu photos, its apparent fragility is a cause for concern. It would be nice if Sony provided a glove-like camera case or entirely different, ruggedized housing. Of course, many third-party camera cases are available along with what Sony offers, but even the smallest of these will be too large to fit in a shirt or inside sport coat pocket.In addition to its diminutive size, the camera's portability is also fostered by the lithium ion battery which lasts for nearly two hours. Moreover, with a larger memory chip, you will have everything necessary for a day or more worth of shooting. At the full seven megapixel resolution, photos average about three (3) megabytes each. This means you can store only about ten photos on the included 32 MB Memory Stick, making memory a necessary upgrade. By comparison, my 512 MB Memory Stick allows me to take over 150 maximum resolution 7.2 MP photos. Fortunately, it can be purchased for approximately $55 at Amazon.Even though I am not a professional photographer or artist, I can definitely appreciate the picture quality. I had the opportunity to directly compare the Sony DSC-P200's quality to that of a Minolta 5 MP camera taking the exact same photo at the same distance. The pictures of a friend and me were taken by a waiter in an upscale restaurant with relatively low lighting. At first glance, they appeared to be of comparable quality. After closer inspection, however, it was clear that the Sony image was superior. In one striking example, the shades of my burgundy shirt were more accurate with less pixilation.For the amateur photographer, be aware there are many features to be deciphered. As a former engineer and gadget enthusiast, I consider myself a quick study. Yet, I had to spend a couple of hours reading the manual and still have some learning to do. So, don't buy this camera on the way to your daughter's wedding and expect to use it (besides, the battery will be dead anyway).Many casual photographers may question the need for seven megapixels as this exceeds the resolution of even the largest monitors. For example, a high-end WUXGA (1900 x 1200) wide format monitor only has 2.3 megapixels. However, the camera's superior resolution provides a hidden benefit. Even if you don't want to create large format photos or posters, it does allow for a convenient \"off-line\" zooming. So if you are at sporting event or show, you can take photos of scenes even too far with 3X magnification. When editing the images on your computer, you can crop the part of the photo desired to effectively zoom into the image you wish to save or share with you friends.As a Sony Vaio owner, I have the added benefit of being able to slip the Memory Stick directly into my laptop without having to worry about cables or additional drivers. It would be even nicer, though, if Sony provided some sort of wireless connectivity, such as Bluetooth or WiFi. I can see why Sony would skip this feature as current wireless technology would not be sufficient for transfer of several high-resolution photos.The video capability is a nice frill even though it would not be a key reason for purchasing this camera. I was quite surprised that it produced quality video AND sound recordings. The latter was far crisper than I ever expected. With two gigabyte chips available in 2005, you could record full motion video for nearly 80 minutes. This sounds great, but the camera doesn't record moving scenes very well. Presumably, this is due to internal bandwidth limitations. On this note, it would be nice to provide HDTV video recording, even at a lower frame rate. This would be quite a stretch due to bandwidth limitations/data write speed as HDTV cameras, geared for the professional market, are very expensive.In summary, the Sony DSC-P200 is an incredible piece of technology that provides tremendous picture quality in a small package. I can't imagine wanting more out of a camera other than a ruggedized housing or high resolution HDTV video, which is quite unrealistic given its size and cost.  Given the camera's intended purpose, Sony has done an amazing job. For still photos, the DSC-P200 should be good for a decade or so.Pros7.2 MPIncredible picture qualityLithium Ion batteryCompactConsNo glove-like caseA bit complicated for recreational photographersDelicate (potentially)32 MB of standard memoryNo Bluetooth", "Date": "May 6, 2005"}, {"Title": "Professional Quality Camera", "Author": "J. B. Quattlebaum", "ReviewID": "R33MX3B0BK5XTJ", "Overall": "5.0", "Content": "I resisted \"going digital\" for a long time.  When I finally took the plunge and compared cameras, the Sony DSC-P200 was the standout.  Consider this:The P200 has a metal case -- not plastic.The lens is a Carl Zeiss -- the same German optical firm that makes lenses for Hasselblad and Leica.The P200 is made in Japan by the same Sony subsidiary that makes the professional digital Betacams used in Hollywood.The design of this camera deserves an award - the placement of the buttons, shifting of the lens to the extreme left side - the result is a camera that \"feels right\" -- never do I touch the wrong button, or have to search around for the right function.The photos?  I shot Macro, fluorescent, incandescent, cloudy, and bright sunshine -- exposures were excellent and the 7.2 Megapixel Super HAD sensor produced images that did not pixelate until I had enlarged them to 200X!I bought the Sony DSC-P200 (and I recommend getting a 512MB memory stick -- you can get 130 images at the highest quality setting) and the two of us have been inseparable.", "Date": "May 3, 2005"}, {"Title": "After extensive research...", "Author": "Bethany Cerella", "ReviewID": "R2OMWYDH35SGSN", "Overall": "4.0", "Content": "We spent a long time researching the purchase of a new digital camera. My Nikon Coolpix 880 was great when I bought it in 2000, but it's been dropped a few times, and it was a bit heavy/big. I wanted a camera that took great pictures, was light weight and small enough that I could comfortably carry it in my pants pocket.The Sony Cybershot 7.2 has everything I wanted. It's small, easy to carry in a small purse or pocket, and it takes amazing photographs. The image quality is excellent. I do a lot of scrapbooking and crop a lot of pictures before I print them, so it was important to me to have 7.2 megapixels for enlargement.The camera is easy to hold - I have fairly small hands, and it doesn't feel awkward or big.As far as construction goes, the Sony Cybershot 7.2 is user friendly. The battery, memory card and charging outlet are behind the same \"door\". The buttons are aligned so that, for a right-handed person, it's possible to hold the camera and manipulate the image (ie. zoom, change menu options, etc.) with one hand - but do use the wrist strap! The LCD resolution is very good, definitely better than my old Nikon, and I was thrilled to find that the pictures look even sharper on the computer! One major problem with my Nikon was that the on/off button could easily be triggered by putting it in the case, so the camera would stay on and eat the battery up. On my new camera, the on/off button is slightly recessed, so it won't turn on accidentally, and the battery life is exceptional - 300+ minutes. The turn on speed and the time between shots is very quick - about a second. The zoom is excellent as well and gives me a lot of detail.I didn't buy this camera for the video, but I played around with it to see what it was like, and would seriously consider leaving my other video camera at home now! The microphone is located where you would put your thumb if you held the camera with two hands (unless you were paying attention) and sound quality isn't exceptional, but it definitely works well. If you wanted to narrate, I'd suggest speaking close to the camera.Drawbacks: Personally, I need to hold the camera with two hands to keep it steady. This is not a big problem at all, but I thought I'd mention it - unless I'm trying to catch something on the fly, I don't have a problem keeping the camera steady.In scene mode, when you bring up the menu, your setting choices (snow, candlelight, portrait, etc.) are represented only by icons, and I find it difficult to remember what each is.Neither of these problems are (in my opinion) significant, but I thought I'd bring them up in case they are for you. Overall, I couldn't be happier with my purchase.", "Date": "July 7, 2005"}, {"Title": "Awsome Camera!!!", "Author": "A. Jablonski", "ReviewID": "R2LW1IZX7RZ3TE", "Overall": "5.0", "Content": "I bought this for my mom and she loves it!  It doesn't say this but if you are wondering if it has a time/date stamp for the photos, it does and you can turn it on/off.  She was very concerned with this because she wanted a time/date stamp.  I took a picture of my fan on FASTEST SPEED and it looked like the fan wasn't even moving in the picture.  This camera is amazing.  It is also soooo fast.  It turns on in like less than a second and it takes pictures fast without delay.  Great quality pictures and good video too.  Also you will NEED to get a bigger memory stick than the one it comes with because it will only hold 9 pictures with the one it comes with.  Also if you are concerned it does not have enough zoom, don't be.  Because of the high MP, you can just crop the picture and it will look like it is zoomed and still be a big picture.  The battery has a very long charge, too!  This is just an all-around great camera.", "Date": "December 2, 2005"}, {"Title": "Can't ask for more!", "Author": "Scott Berg", "ReviewID": "R8KSKCWQ1J5GL", "Overall": "5.0", "Content": "Let me start off by saying I have owned an arseload of digital cameras--Kodaks, Nikons, and most recently Canons. My last Canon was a G5 and I feel certain I never used more than 5% of the features it had to offer (my bad) and it was just too much camera for me.On top of that, my wife was always complaining about the shutter lag and how it was so annoying when trying to snap pics of kids and other fast-moving objects. That is the first thing about this camera--it is fast. Fast in startup, fast between shots--in that way, it is great. Second, it is small, but not TOO small. I'm a bigger guy and I tried out the somewhat smaller Canon SD500. The longer form factor of the P200 is perfect for my hands. I've never gotten in the way of the viewfinder or flash.Third good thing is the battery life. It lasts a long time and spares are not that expensive. In the miscellaneous category, the LCD is super and it comes with a handy little strap. I'm sure without it, the camera is easily dropped.Not much on the downside--the 32mb card is useless except for trying it out (9 pics??!!). I have always been a CF card man myself, so I had to revamp all my memory, but a 1gb Memory Stick holds more than 200 images. I plan to pick up another.Haven't tried the Movie function or the Redeye, but I hear they are both great. This is just a fantastic camera. Don't imagine I will be getting another for a while, and that is saying a lot for me.", "Date": "March 22, 2005"}, {"Title": "Great little camera - highly recommended!", "Author": "KE SHEPHARD", "ReviewID": "R1USD5RKWPCXL7", "Overall": "4.0", "Content": "I waited a long time to purchase a digital camera, as I wanted something that would replace my 35mm Olympus, and last me a long time to come.  I'm not a professional photographer, but love taking good quality photos for enjoyment, and so was looking for something that would give me good results without being overly complicated.  I spent several months reading reviews online and visiting various camera shops in my local area.  The Sony Cyber-shot DSC-P200 came up trumps every time.I have had this camera since September 2005, and absolutely love it.  It is very easy to use, with a large and very clear screen, and the picture quality is just great.  I tend to download the pictures to my computer as I go, selecting the ones I'd like to have printed and putting them into a separate folder.  Then, when I have about 100 in my folder, I put them onto a CD and take them to the photographic department of my local pharmacy to be printed (price break at 100+ photos).  I really can't tell the difference between pictures taken with this Sony and those taken with my 35mm, the picture quality is so good.The casing is also well-made and robust and the software is very easy to install.  If you have XP, it is not necessary to install the software.As with most digital cameras, it only came with a tiny 32MB memory stick.  However, I purchased a 1GB Sony Memory Stick Pro and find I can easily store at least 150 photos at maximum 7megapixel resolution, along with several short 1 or 2 minute videos on the standard setting.  The videos certainly use up the space on the chip and drain the battery more quickly, especially on the fine setting.  However, I find the quality of the standard setting videos perfectly adequate.  Also, as I travel a lot between the USA and UK, it's great to be able to play them back on the telly on either PAL or NTSC settings, regardless of how they've been taken.  Indicators can be turned on at the top of the camera screen, to show remaining battery life and chip space.  I recently spent three days at the beach, constantly taking photos and videos, and still had space on the chip and about 100 minutes' battery life when I got home.I have noticed a few little things to be careful of, however, although with a little care and attention, these can easily be overcome:Blurred pictures - I have found the best way to avoid blurred pictures is to hold the camera steady with two hands, press half-way down to focus and then follow all the way through.  A tripod, even a small one, is also handy to have.Dark videos - I find videos are best taken outdoors in natural daylight, or indoors with as much light as possible.Videos deleted from camera in error - When deleting pictures from the camera, be careful not to delete a video in error.  Sometimes, it can look like a blurred picture, or a totally black screen, but that is the first frame of the video.  With the indicators on the camera screen turned on, it will say \"play\" in pale blue on the bottom left for a video, as opposed to \"back/next\" for a photo.Heads cut off printed photos in 6\" x 4\" size - If you open a downloaded photo in Photoshop, taken at 7 megapixels, the image size will show a width of 42.667inches and a height of 32 inches, which is a ratio of 1.333, equal to a size of 6\" x 4.5\".  When you have it printed to 6\" x 4\", however, the ratio changes to 1.5 and a quarter of an inch is chopped indescriminately from the top and bottom of the picture, possibly causing you to lose some of the subject.  If I have a photo in which the subject is close to the top or bottom of the picture, I change the ratio manually in Photoshop, by cropping the height as I want it until it measures 28.45 inches.  I'm not sure if there is a setting in the camera to alter this automatically, but my local Sony store did not know of one and didn't actually know of this problem, although the pharmacy said it had encountered this problem with prints from several different cameras.Flimsy door to charging unit - Charging up is simple and best done overnight (just need plug adaptor if abroad).  However, the door is just a little flimsy and has to be handled carefully.These are just my findings in the 8 months that I have owned this camera, on the few features that I have used.  My boyfriend, who has a greater knowledge of cameras, is also very impressed, and likes the manual features that can be used to override the automatic settings.  One of my friends, who like me, is a point-and-shoot aficionado, liked this camera so much that she bought one for herself, and is really pleased with it.All in all, a great little camera that I am sure I will enjoy using for many years to come.  Highly recommended!", "Date": "May 29, 2006"}, {"Title": "Great little camera", "Author": "Sam Clark", "ReviewID": "R3Q84WVIMESA0V", "Overall": "5.0", "Content": "I have had exclusively Olympus for both 35mm and digital. This was my first venture into a sony. I have to say I am very impressed! I used most of a 1 gig card testing this camera in all types of lights and playing with all the settings and I have found it to be very user friendly and uncomplicated. And the red eye reduction actually works! Not a single picture came out with ANY red eye! My children and neighbors are now hiding from me though ;)And if consistently beautiful pictures aren't enough... the size is perfect! Its small enough to fit into a pocket but not so small you can't see the screen or read the buttons.I am very happy with my little P200!", "Date": "March 20, 2005"}, {"Title": "A go anywhere camera for the digitally conscious", "Author": "A. chiang \"acny\"", "ReviewID": "RYL04RIUKYZ8L", "Overall": "4.0", "Content": "This was the camera I upgraded from the DSC-P150. The size makes it convenient to tote around on trips, both casual and longterm. The photoquality of the camera makes it worthwhile to capture special moments.The 7.2 megapixel captures enough detail for cropping, resizing and digital editing. The camera has a balanced weight in hand. The 3X zoom is ample for most applications as well.I have taken this camera on three trips to europe, photographed the progress of my garden over the past two seasons and taken many animal photos. The camera does well in daylight, reasonably good in low light situations as well as higher shutter speed action shots (taken of my dog playing).This is my 7th digital camera and i honestly haven't considered any other cameras since i purchased this one.Pros:Fast start upnifty operating soundeffects (which can be disabled).large bright lcd screen (slightly larger than the p-150)long battery lifecompact size to fit in jean pocketVideo recording limited to available space on memory stickIndent on top of metal case for firmer grip.Can control zoom while recording video.Circular Green light around power button (tasteful upgrade from P-150)Cons:does not come with protective carry case (must be purchased separately)Silver shell looks like every other digital camera (i would purchase in red or blue next time)Reliance on sony memory stick. (forced to use proprietary memory format)Menus cluttered, could have been better organized.", "Date": "September 19, 2005"}, {"Title": "Great compact camera", "Author": "KJB \"kjbatl\"", "ReviewID": "RD4TH1BA0Q07M", "Overall": "4.0", "Content": "I have enjoyed my new Sony P200.  It's small, lightweight, quick to start up, and fun to use!Sony's colors are a little more vivid than some other digital cameras, but you can adjust that by setting the contrast and saturation levels lower.I have not had a problem with blur at all, but you do have to hold this camera steady.  The optical viewfinder helps.  My photos have been very sharp and crisp.I am particulary impressed with my indoor flash shots.  I set the ISO to 100, shutter speed to 1/60, and aperture to f2.5.  I have gotten excellent shots even in challenging places such as bars and restaurants.", "Date": "March 20, 2005"}, {"Title": "Sony DSC-P200", "Author": "C. Ward", "ReviewID": "R3BD2WCBP2N3MQ", "Overall": "5.0", "Content": "LikesSmall size, fits nicely in my handQuick shutter response and almost no shutter lag, even outdoors at 20 degrees2 inch LED screen makes composition and reading menus easyRed eye not common but happensDislikesOptical viewfinder hard to use wearing glassesFlimsy plastic stop for battery releaseTiny holder for wrist strapNo built-in panorama modeSome red-eye, easy to take out with the Nikon View software that I use to edit my picsSummaryI like this camera and am glad I bought it.  Paid $399 minus a $50 trade-in of any old camera at CompUSA in February 2005.  Small and easy to use.  I was looking for a pocketable camera and found it in the P200.  My wife doesn't like techy things and yet has had no problems using the camera.  She loves the larger 2\" LED viewing screen.  I mostly take pictures of the grandkids and our puppy,  The quicker shutter release and short lag times are a godsend.  No problems with indoor flash shots; have come out sharp and clear.  The main annoyance is what to do with several hundred dollars of CF cards I still have for my Nikon 5400.  Maybe EBay?", "Date": "March 5, 2005"}, {"Title": "GREAT little camera - HIGHLY recommend it!!", "Author": "Kreg", "ReviewID": "RZR8XMMLVVDN0", "Overall": "5.0", "Content": "Just replaced my DSC-P100 with this new DSC-P200 and I love it!  It is incredibly simple to use, makes GREAT videos and UNBELIEVABLE quality 7 megapixel pics!!  Whilst 7 megapixels is over-kill for 4x6 prints, this size image allows it to be cropped and STILL produce great prints AFTER cropping!  Combine that with tiny size, awesome battery life and the extreme flexibility of either point and shoot settings or fully adjustable manual settings and you have a total winner!  The city lights shots this camera can take are INCREDIBLE!!!  Would buy it again in a second!!", "Date": "October 18, 2005"}, {"Title": "An awesome digicam!", "Author": "Sunshine", "ReviewID": "R2P6CU3M1ZH2AI", "Overall": "5.0", "Content": "Finally decided to upgrade my old Sony 1.2MP digital camera.  Wanted something small that could fit in my pocket and take easy, quick shots, but still allow for manual manipulation of the images.  I also wanted a digicam that had a view finder in addition to the LCD panel.  I have found all this and more in the P200 (red, of course!).  It has met or exceeded all of my expectations -- great picture quality, long battery life, fast shutter speed (time it takes to snap the photo and then take the next photo), easy transfer of images to PC, large LCD that has a protective coating, ease of use, etc.  I can't say enough good things about this camera.  One of my relatives went out and bought this after I got mine and he loves it, too.  You won't be disappointed.", "Date": "October 31, 2005"}, {"Title": "Want black spots on your pictures?  Buy this camera!", "Author": "xyzzy", "ReviewID": "R2AJ6C451B4ZNN", "Overall": "2.0", "Content": "I bought this camera for a vacation trip to Paris in April.  I got back to the States and downloaded the pictures from the camera.  What did I see?  Beautiful picture of the Eiffel Tower with a large, blurry black spot in the sky.  About 30% of my photos had the same problem.  The black blur was often in the same area on most pictures, but because the lens moves when I zoom, the spot sometimes is closer to the center, sometimes further to edge.Upon further examination, I noticed that this black blur is also visible on the LCD preview display on the back of the camera.  (No need to download the pictures to see the problem.)I sent the camera in to Sony for repair, under warranty.  One *month* later, I got the camera back.  The original black spot was gone, *but* a new smaller spot had been introduced during repair.  I sent the camera back to Sony a second time.  After *another* month had passed, I finally got it back.  This time, everything was fine.But guess what?  After another month of using the camera, another black spot was again visible.  What's the deal?  I called Sony to get the answer, but they weren't offering any explanation.  What's my personal opinion?  I think that dust or lint particles are making there way too easily inside of the camera body and lodging themselves onto the inner lens and/or CCD array.Once I realized this, I then started examining other people's Dony DSCP-200 (this model) and DSC-P150 (predecessor model) cameras.  Guess what?  Many had the same problem too!  In some cases, it was a blurry round spot, while in others, it was a squiggly line.  Most people just hadn't known what to make of the problem, so they ignored it.So, do you want to see it too?  Here are the conditions you are *most* likely to see it.1.  First off, let me point out that this problem is *NOT* likely to be noticed by observing the camera indoors.2.  To fully observe the effect of this black spot phenomemon, you must be outdoors during daytime hours, where there is plenty of available light.  For best viewing, the camera should be pointed toward a bright, blue sky.3.  Before performing the following tests, minimize the amount of information shown on the LCD display.  For example, turn off the histogram.4.  The degree to which you can see the problem is determined by (a) the amount of telephoto zoom applied, and (b) the megapixel setting.  The size of the black spot generally changes at various megapixel resolutions.  Therefore, zoom the camera *completely* from Wide to Telephoto under *every* megapixel setting (7M, 5M, 3M, 1M, VGA).  On my camera, it is most prominent when the zoom is pushed to maximum telephoto, but your results will vary.If you don't see the problem, congratulations.  Perhaps you're either lucky, or you haven't used your camera much, or Sony has modified their manufacturing process to eliminate the problem.If you're considering purchase of this camera, then be aware of the potential for this problem to occur, and be prepared to return the camera within 30 days, if you don't like the results.Aside from this annoying problem, the camera produced amazing pictures.  The color it captures is brilliant.  As others have pointed out, the camera produces blurry pictures in low-light conditions, but that's expected given the small size of the camera.  I use a small portable tripod to assist me in those conditions.  The main reason why I love this camera?  The manual mode allows me to capture night shots using the aperture, shutter speed, and ISO settings that I am accustomed to on a manual SLR camera.  But the Sony DSC-P200 is a tiny fraction of an SLR's size.  I can keep this camera in my pocket anywhere I go.  If it were not for the black spot problem, I'd give it 5 stars.", "Date": "December 1, 2005"}, {"Title": "SMALL & LIGHT BUT BIG ON FEATURES", "Author": "BEACH BUM \"DACHSHUND LOVER\"", "ReviewID": "R34HJ80KB07L67", "Overall": "5.0", "Content": "THIS is MY 2nd DIGITAL CAMERA AFTER OWNING a 3.2 MEGAPIXEL KODAK for TWO YEARS.  THIS SONY is BEAUTIFUL and TAKES WONDERFUL CLEAR PHOTOS. I CANNOT BELIEVE the FEATURES & OPTIONS THIS CAMERA GIVES YOU for the PRICE. IT is VERY LIGHT BUT SEEMS to be WELL MADE. THE BATTERY LIFE is EXCEPTIONAL AFTER LIVING WITH the KODAK!  YES YOU HAVE to BE STILL to EXPECT GOOD CLEAR PHOTOS BUT THIS HAS ALWAYS BEEN the CASE for ANY PHOTO EVEN FROM the OLD BOX CAMERAS of MY YOUTH! I HAVE READ SOME PEOPLE COMPLAINING ABOUT BLURRY PHOTOS BUT I HAVE NOT HAD THIS EXPERIENCE. THE FLASH is NOT OVERLY STRONG BUT DOES WHAT ADVERTISED, ABOUT 11 FEET. I HAVE SHOT FIREWORKS and MANY BRIGHTLY LIT BEACH SHOTS SINCE I LIVE ON the JERSEY BEACH. SO FAR THIS CAMERA HAS EXCEEDED EXPECTATIONS and MY ADVICE WOULD be to \"SHOP AROUND\" SINCE I HAVE SEEN THIS CAMERA PRICED at VERY COMPETITIVE PRICES ON LINE!", "Date": "July 5, 2005"}, {"Title": "One great camera!", "Author": "Miguel Medina", "ReviewID": "R37GGUPYDWLHLH", "Overall": "5.0", "Content": "This is a great Compact and solid camera. The picture quality is phenomenal. I love the manual settings options and the beautiful pictures it takes in auto mode. It starts up super fast and is so compact there is no excuse not to take it everywhere. Thank you Sony!", "Date": "April 22, 2005"}, {"Title": "Forget the zoom!", "Author": "David Gudas \"dgudas\"", "ReviewID": "R26OWVA43HDXHY", "Overall": "2.0", "Content": "I bought a Sony DSC-P200 on 8/19/2005 from a local OfficeMax store and six days later returned it.I have always bought Sony cameras for myself and other family members, and I have shot in the tens of thousands digital pictures over these years. This was my 7th Sony Camera purchase since 1998.Intially this camera met my every expectation and then some, controls and functions were easy to locate and master, especially having used Sony cameras for so long. The small overall size, easy handling, large LCD screen and great battery life had me in heaven right away.Regular shots were awesome although a few regular shots turned out unexplicably blurry (that happens now and again with every camera for many reasons... not a bnig deal I thought). Then I began using the zoom (both the Precision and Smart zoom) at different resolutions and different magnifications. I consistently found that 75% of my shots were blurry to some degree or another, a phenomenon that I have never come close to experiencing to this extent in the 8 years I've been using digital cameras.I figured I was doing something terribly wrong to produce such a continuously large proportion of blurry pictures.The funny thing is that when you snap the picture the LCD briefly shows the captured image, and it looks great... it's when the pictures are downloaded and reviewed on a computer that the final product is revealed... and most pictures taken using the zoom were terribly blurred.I searched the manual for help and guidance to no avail, and then went to the internet seeking a remedy or explanation, figuring that Using just the keywords of \"DSC-P200\", \"blurry\" and \"zoom\", I uncovered enough commentary and complaining to determine very clearly in mind that this camera is seriously flawed, and that I did not have a lemon. There is even one person who has a web site set up to describe and show examples of the blur problem with the DSC-P200 at: [...]\\\\[...]I consider the zoom on this camera useless. The Sony personnel who had any hands in releasing this camera to the mass market should all be looking for new jobs.Other tibits: The camera took great large video (640 x 480 pixels). The problem is that camera comes with a plain old 32 MB first generation Memory Stick. You need to have a newer Memory Stick called \"Memory Stick Pro\" which has faster read/write capabilities to shoot a video clip with the DSC-P200. So don't plan on even testing the video capabilities with what's supplied in the box. Very cheesy of Sony to do this.Someone on the Internet also mentioned how the box it comes in is most difficult to get back together once it is opened. (Hmmm... to make returning it more difficult????). They were correct and I agree, so if you get one of these pay attention to how you got it out of the box!I was unhappy with this experience, and may be jumping ship with deep regret to another make of camera.", "Date": "August 26, 2005"}, {"Title": "You will fall in love with this camera", "Author": "Ganesh Kumar Eswaran \"Ganesh Kumar Eswaran\"", "ReviewID": "R33BAT8ESDBQUM", "Overall": "5.0", "Content": "The Sony DSC-P200 is the most recent in Sony's highly popular line of subcompact \"P-series\" digital cameras.Positive Factors:+ High-resolution 7.2 megapixel CCD, a 3x optical zoom lens, and an expanded range of nine preset Scene modes to choose from+ The P200 is a capable, yet very compact, digital camera. New to the P200 is a larger, 2.0-inch LCD monitor, and a variety of other improvements all packed into a (very) slightly smaller body size.+ Excellent battery life.  Almost 400 photos before you need to recharge+ Excellent option for rank beginners and more experienced users alike, a nearly ideal \"pocket\" camera to pack along when there just isn't room or time to accommodate a larger or more complex model+ 7.2-megapixel CCD delivering image resolutions of 3,072 x 2,304 pixels.+ Real-image optical viewfinder.+ 2.0-inch color LCD monitor.+ Built-in flash with five modes and an intensity adjustment.+ Sony Memory Stick storage (32MB card included).+ USB computer connection.+ InfoLITHIUM battery system (AC adapter included).Negative Factors:- Can't use ordinary batteries.  An extra battery is expensive- Flash with its default setting (lower setting) gives underexposed photos.  You can change it to a higher setting but that makes the photos overexposed.  Solution:  Keep it at a higer setting and don't be too close to your subjectOther Notes (if you have time to read):Beginning through intermediate users will be right at home with the Sony DSC-P200, and advanced users will enjoy its excellent portability and manual exposure control option. Although the P200 is technically a point-and-shoot digital camera, it has a lot of creative options and enough image adjustments to handle a wide variety of shooting situations. So, while it's designed to reduce the amount of complicated exposure decisions, advanced amateurs and business users will appreciate it for its quality, portability, and varied shooting options. It has a great feel, looks smart, works fast, and takes great pictures. The Sony DSC-P200 would make a great \"family\" camera, where users with a range of skill levels need to share the same camera. It would also make a great \"pocket camera\" for more experienced users.Despite its small size, the Sony DSC-P200's elongated shape provides plenty of room to extend two average-size fingers comfortably across the front and top of the camera, without blocking the lens or any camera controls. By making the camera thin but long, Sony kept the P200 very compact, yet avoided the lack of finger space that plagues many ultra-small digital cameras. The 3x, 7.9-23.7mm zoom lens (equivalent to a 38-114mm zoom on a 35mm camera), dominates the right side of the front of panel, with a small and very bright orange lamp just above and to the right of it, to help with focusing in low-light conditions. (This lamp also blinks when the self-timer is in use, to let you know when the camera is about to snap the picture.) A slightly larger window for the optical viewfinder comes next, followed by the built-in electronic flash. There is no finger grip on the front, however, I found that the camera felt fairly secure in my hand, with my thumb on the back, my index finger on top, and my middle finger wrapped around the front of the body.Color: Very good color, accurate hue, appropriate saturation. Manual white balance handles incandescent lighting very well. The Sony DSC-P200's overall color was good to very good throughout my testing, with only slight warm color casts from its white balance setting. Its color looks very similar to that of the P150 model that it replaces (no surprise), although its skin tones were slightly more orange-looking. It did handle the always-difficult blue flowers of my \"Sunlit\" Portrait test pretty well though. Indoors, its Incandescent white balance setting handled household incandescent lighting pretty well, but the Manual white balance option produced a really excellent shot. All in all, very good color.Exposure: Very good exposure accuracy. The Sony P200's exposure system handled my test lighting quite well, accurately exposing most shots. It underexposed the very high-key \"sunlit\" portrait shot slightly at the default setting, but a relatively small amount of positive exposure compensation (+0.7 EV) brightened the midtones appropriately. Its default tone curve is rather contrasty (similar to those of most consumer digicams), but its contrast adjustment option helps quite a bit with this. (Even with the low contrast option selected though, the P200 didn't do quite as good a job as the P150 at holding onto highlight detail.) The P200 had no trouble distinguishing the subtle pastel tones on the Q60 target of the Davebox, however, and shadow detail was generally good.Resolution/Sharpness: Very high resolution, 1,550 lines of \"strong detail.\" The Sony DSC-P200 performed well on the \"laboratory\" resolution test chart for its 7.2-megapixel class. It started showing artifacts in the test patterns at resolutions as low as 1,200 lines per picture height, in both directions. I found \"strong detail\" out to at least 1,600 lines horizontally, 1,550 lines vertically. \"Extinction\" of the target patterns didn't occur until close to 2,000 lines.Image Noise: Low image noise, but some loss of subtle detail to achieve the low noise levels. The Sony DSC-P200 generally shows low levels of image noise for its resolution class, but it does trade away some subtle subject detail in order to achieve the low noise levels. (While the loss of detail isn't severe, to my mind the P200 doesn't do as good a job in this respect as did the earlier P150.)Closeups: Very good macro performance, good detail and resolution. The flash has a little trouble though. The P200 performed well in the macro category, capturing a minimum area of 2.39 x 1.80 inches (61 x 46 millimeters). Resolution was very high, and detail was strong in the dollar bill. Detail was also good in the coins and brooch, though both were soft due to the close shooting range. (The softness in the coins and the brooch was caused by the shallow depth of field when shooting this close. This is an optical fact of life, and not the camera's fault.) Details also softened toward the corners of the frame. (Most digital cameras produce images with soft corners when shooting in their Macro modes.) The P200's flash had trouble at such close range, and overexposed the top of the frame, with a reflection on the brooch. (Definitely plan on using external lighting for your closest macro shots with the P200.)Night Shots: Excellent low-light performance. Good color and exposure, with low image noise, at the darkest light levels of my test. Good low-light autofocus performance as well. The P200 did just a superb job on our low light test, producing clear, bright, usable images down to the 1/16 foot-candle (0.67 lux) limit of my test, with good color at the 100, 200, and 400 ISO settings. Color balance turned pink in some shots, likely due to a shorter exposure time. Noise is low in most shots, and even at ISO 400, image noise is lower than I expected, with a nice tight, fine \"grain pattern.\" (The shot at ISO 400 and 1/16 foot-candle really looks better than ISO 400 shots from some cameras in full daylight.) The camera also focused very well in the dark. With the AF illuminator turned off, it could focus down to a light level of roughly 1/8 foot-candle. With the AF assist light turned on, it could focus in total darkness, at least on nearby objects. Overall, one of the better low-light performances from a consumer digicam. Since city street-lighting at night generally corresponds to a light level of about one foot-candle, the P200 should do very well for after-dark photography in typical outdoor settings.Viewfinder Accuracy: A tight optical viewfinder, but accurate LCD monitor. The P200's optical viewfinder was rather tight, showing only 84 percent of the final image area at wide angle, and about 80 percent at telephoto. The LCD monitor actually proved slightly loose, showing just a bit more than what made it into the final frame, though results were near 100 percent accuracy. Given that I like LCD monitors to be as close to 100 percent accuracy as possible, the P200's LCD monitor performed pretty well here, but I'd really like to see a more accurate optical viewfinder.Optical Distortion: Good sharpness in the corners and low chromatic aberration. Geometric distortion on the P200 is about average at the wide-angle end, where I measured approximately 0.8 percent barrel distortion. The telephoto end fared quite a bit better, as I measured only one pixel of barrel distortion (about 0.03 percent). Chromatic aberration is lower than average, as I found about six or seven pixels of fairly faint coloration. (This distortion is visible as a very slight colored fringe around the objects at the edges of the field of view on the resolution target.) The P200's images are also quite sharp from corner to corner, although there's a bit more softening in the left hand corners of the frame than I saw in the earlier P150. (Probably just the result of unit-to-unit variations, the two cameras appear to use the same lens.)Shutter lag and cycle time: Very good shutter lag and cycle time, particularly for a compact model. Like most of Sony's current digicam models, the DSC-P200 is very responsive to the shutter, with full-autofocus lag times that range from 0.30 to 0.55 seconds, and a blazing 0.013 (!) shutter lag in when prefocused by half-pressing and holding the shutter button before the shot itself. Cycle times are also excellent for a 7-megapixel camera, regardless of size, at 1.44 seconds/shot in single shot mode, with no apparent buffer limitation (when writing to a Lexar Memory Stick Pro card), and 1 frame/second for five-shot bursts. Its \"multi-burst\" mode captures 16 small images at a time, at rates as high as 30 frames/second. All in all, a great performer, all the more surprising given its diminutive size. (For those comparing the two models, the DSC-P200 is slightly faster starting up and shutting down than the previous P150, a bit faster from shot to shot, and much faster at downloading images. Shutter lag numbers are virtually identical between the two models.)Battery Life: Really excellent battery life for a compact digicam. Thanks to Sony's InfoLithium battery technology, the P200 showed really excellent battery life compared to other compact digicams (actually, it's very good compared to any size digicam), with 202 minutes projected runtime in capture mode with the LCD on, and 402 minutes in playback mode. As always though, I still recommend purchasing a second battery along with the camera, but with the P200, this is much less of a consideration than it normally is.Print Quality: Excellent print quality, excellent color, good-looking 13x19 prints. ISO 400 images look a little rough at 8x10, excellent at 5x7. Testing hundreds of digital cameras, we've found that you can only tell just so much about a camera's image quality by viewing its images on-screen. Ultimately, there's no substitute for printing a lot of images and examining them closely. For this reason, we now routinely print sample images from the cameras we test on our Canon i9900 studio printer, and on the Canon iP5000 here in the office. (See the Canon i9900 review for details on that model.) In the case of the Sony P200, we found that it had plenty of resolution to make sharp-looking 13x19 prints, even with a little cropping. At the largest sizes, the loss of subtle detail caused by its anti-noise processing was visible in Marti's hair and features, but we suspect that most consumers would find the resulting prints acceptable nonetheless. Subjects with strongly contrasting detail (things like tree branches against the sky) showed no loss of resolution, producing very sharp images even at 13x19. Looking at the high-ISO shots, images from the P200 captured at ISO 400 looked a little rough when printed at 8x10, but we felt that they were acceptable when examined at normal viewing distances. (10-12 inches or so) The ISO 400 image noise was essentially invisible in prints 5x7 and smaller. Color-wise, the P200's images looked absolutely beautiful when printed on the i9900, lush and vibrant, yet very natural-looking.Free Photo LessonsSimple pro lighting and use tips let you snap stunning photos. Check out our free Photo School area!Taken as a package, the Sony DSC-P200 is hard to beat in the subcompact point-and-shoot digital camera market. It packs a 7.2-megapixel CCD, a sharp, high-quality 3x optical zoom lens, nine preset Scene modes and a host of other creative options in to a very small, well-built package. While the DSC-P200 is very similar to its predecessor, the P150, it does offer a few new features, including a larger 2.0-inch LCD monitor, and options for Center-Weighted metering, manual white balance, and spot autofocus. Like the P150, the DSC-P200 is a very responsive camera, with excellent shutter lag and shot to shot cycle time numbers, excellent battery life, and surprisingly good low-light capability. Its color is also bright and vibrant, but natural-looking. On the downside, it does trade away a bit more subtle subject detail than did the P150 to achieve its low noise levels. The detail loss is fairly apparent when viewed onscreen at 1:1 pixel size, but high-quality inkjet prints made from the cameras images don't show the softness nearly as much, and our evaluation is that the vast majority of consumers will have no complaints whatever with its image quality. All in all, if you're looking for a great \"take anywhere\" camera with excellent resolution, great versatility, and excellent color and tonality, the Sony DSC-P200 should be an easy choice", "Date": "March 10, 2006"}, {"Title": "Excellent Value", "Author": "Electronic Gadgetphile", "ReviewID": "R2QCL1B5LEOTQL", "Overall": "5.0", "Content": "Purchased this camera for wifey's birthday to replace her 2.1 MP Sony that has served her well for a few years. The 7.2 MP resolution, optical zoom and price were compelling as well as the Sony quality and reliability that I have experienced in several of their cameras. The image quality is very good and the camera is simple to use (unless you want to use more advanced features which are built in). The higher image resolution allows her to significantly crop her photos and still display excellent final print clarity. My Canon EOS 20D does a better job overall, at 4X the price, but she can fit her DSCP200 in her pocket whereas mine requires a backpack. Overall would rate this Sony DSCP200 an excellent value and pleasure to use.", "Date": "August 27, 2005"}, {"Title": "AHHHH...FATHER'S DAY AD", "Author": "Hassell O. Phillips \"OLE HOP\"", "ReviewID": "R3L7XKOIGE0R4A", "Overall": "5.0", "Content": "I have been reading camera reports for some time now and had narrowed my search to this Sony 7.2.I spent time in various stores with this little jewel clicking and clacking..it is so smooth.Reading a Sears ad clinched my purchasing it.The number of functions you can select is amazing and the auto mode will take the guess work out of play if you desire.I have used Nikon 35mm for years but I can tell you,this one is with me at all times.The sharp images and the color saturation are well above what you would expect from a unit this small and in it's price range. I have just ordered the docking station for use with TV slide shows.I don't think you can go wrong with this one !!!I still can't imagine that some are complaining about fuzzy pictures.They must be moving the camera and do not realize it.I shoot on 1M and the sharpness and clarity are incredible.I will shoot some at 7M just to see the outcome.I really don't think I'll see any improvement except if I would wanted to enlarge the image big time..The docking station solves the charging problem (the little access door of the camera).Just sit it on there and watch the charging lights. You can save $30 buying from Amazon..free shipping..got it in 4 days..gonna set it up for some time lapse photos..check it out!!You can set auto function with flash and stop your ceiling fan blades dead still,sharp as a tack even with it running at high speed.Play with all kinds of shots and you could be very suprised.If not.....delete...delete...have fun...", "Date": "June 25, 2006"}, {"Title": "One of the Best I have used", "Author": "Joylene \"Joylene\"", "ReviewID": "R189CZX4LTJEAZ", "Overall": "5.0", "Content": "I recently purchased this camera from SAMS club. I LOVE it. IT takes the best quality pics from a compact size camera that I have ever seen. Very easy to use right out of the box. I have taken it many places including the pool. Never had any problems with the body or \"dust\".  If someone is having problems with this camera is it them and not the camera.Do not hesitate to purchase this camera. After reading the reviews on this site I was very cautious, but now I am SO glad I bought it.Make sure you buy at least a 256mb card to go with it because the 32 mb card only holds about 8 pics on the highest res.update 10/5/09 - still taking great pics!! the camera has been dropped and through a lot of abuse!! few dings- but working great!", "Date": "February 16, 2006"}, {"Title": "takes beautiful pictures", "Author": "Chris' mom \"picture loving parent\"", "ReviewID": "R35M8KZGGJ85TQ", "Overall": "5.0", "Content": "I have had this camera for about a year or so. I bought it from sears and it was $450 but it is worth every cent. I looked on here to see about how much it is going for now and i saw someone wrote a review saying it takes blurry pictures...which I completely disagree with. I have a 13 month old son and I have used this camera for everything he does. It is very rare that you get a blurry picture and it's pretty much if you are taking a picture of soemthing that is moving and you are not using the motion mode on the camera. Also, the camera is a perfect size, not too small where it can be easily lost and not too big where it's difficult to take anywhere. Antoher review said that your fingers get in the way and block the flash or lens, which if you know how to hold a camera when you are taking a photo, you won't get in the way. This camera makes crystal clear pictures, they are good with detail, color, focus. It is 7.2 megapixels and you really can see the diference between this and cameras with less Megapixels. I would recommend this camera to anyone who loves taking pictures. Like i said, i ahve a 13 month old son and i have had to take quick pictures to catch his smile and catch him actually looking at me and the pictures come out beautifully. It's well worth the money.", "Date": "July 25, 2005"}, {"Title": "SONY Hits a Home Run", "Author": "James H. Rainey", "ReviewID": "R3H4J67CC1FFIP", "Overall": "5.0", "Content": "This is my 3rd Digital camera.  I just returned from two weeks in Italy.  This camera is simply amazing.  The quality of the photo's and the ease of use are my favorite things about this model.If you're shopping around, stop here and buy this camera.  We purchased the silver case too and it's the perfect companion.In either Black & White, Sepia or Color the unit out performs anything I've used in the past.JIM", "Date": "March 23, 2005"}, {"Title": "Best investment I've made", "Author": "domestic divalina", "ReviewID": "R21ETHNU53L1QE", "Overall": "5.0", "Content": "I just got the Sony Cybershot and I absolutely LOVE it. The pictures are amazingly clear and the camera itself is light and sleek. The movie mode is just incredible. I paid $399 for this camera and am so happy with this purchase. If the uploading time was just a bit faster, it would be the best camera in the world.", "Date": "March 17, 2005"}, {"Title": "Absolutely great for adventure travel as well as everwhere else!", "Author": "M. E. Spierling", "ReviewID": "R2LJLKJ800V7YR", "Overall": "5.0", "Content": "I travel around the world so I need a digital camera that is small with clear pictures as I often am in a kayak or boat or small aircraft. This is the best camera I have ever used considering the small size.  Sony now makes an underwater housing for this camera which is great if you do a lot of water sports as well. I have beautiful underwater pics recently taken in the Florida Keys.I'm not sure what is causing the complaints of some stating the photos are blurred as I have not experienced that.", "Date": "November 25, 2005"}, {"Title": "Perfect!!!", "Author": "S. Antony", "ReviewID": "RX9XSYYPFZH86", "Overall": "5.0", "Content": "Great quality, perfect for travelers and college students, light-weight, takes great videos, still makes all my friends jealous!!", "Date": "November 6, 2005"}, {"Title": "Very disappointed", "Author": "Gavin Sherlock", "ReviewID": "R3GFXYJGWKFCIE", "Overall": "2.0", "Content": "I used to have a sony 3.2 megapixel camera, which broke when it was dropped, so replaced it with the P200.  I had taken a lot of photos I was happy with with the previous camera, so was expecting to be as happy with this one as I was with the old one, if not happier, given the improved resolution.  However, while I'm no professional photographer, I seem to end up with many more out of focus or blurred pictures with this camera than I did with the other one - probably > 80% are ruined, but it's hard to tell that on the screen on the back, so you lose a lot of treasured moments.  In addition, I often find that the flash illuminates the scene before the picture is taken, and so the pictures are often underexposed.  This happens a lot, and is almost impossible to compensate for, which is very frustrating.  I cannot recommend this camera, and will try a different brand next time.", "Date": "August 31, 2006"}, {"Title": "Nice in perfect conditions", "Author": "E. LAMBERSON", "ReviewID": "R39CK1X66KLYQC", "Overall": "3.0", "Content": "I love this camera for taking photos in ideal conditions.  However, I have had the same problems as another reviewer - using the zoom in dimmer light - fuzzy pics.  It just will not focus - goes in and out.  In fact, now all the photos taken with zoom are fuzzy - even in sunlight. And the flash causes the pic to be black.  I have had to turn the flash off entirely to keep it from ruining the pics. I am very disappointed because I would love to use the zoom in indoor or outdoor events - but this just does not work at all.", "Date": "June 12, 2006"}, {"Title": "great informer-shaky hands!", "Author": "John Moore V", "ReviewID": "R34JHL24BCLWVR", "Overall": "5.0", "Content": "I've had this camera for about 8 months now.i needed to get something alot smaller than my DSC 707 which later i turned infor a DSC 717 sony.i do alot of military missions and the less weights possible,the better.plus room space also.i can just put it in my pocket and keep on trucking.and when i'm ready to take a snap shot of something, man does it come online quick!In the military things happen quick and ya gotta be on your toes.well, this camera is always ready for action!it even lets me know that the camera is too shaky( my hands) lol so i can stabilize it better before i take the shot.u know u hate taken those shots when u think it comes out right and find out later when u blow it up on your laptop only to find out it's blurry.i always have the shaky hands icon on so i get the shot right the 1st time around.", "Date": "March 7, 2006"}, {"Title": "Astonishing pictures", "Author": "Lolly", "ReviewID": "R1EJDH6J8ZWVF1", "Overall": "5.0", "Content": "Bought this camera in June with a planned July trip to Alaska in mind. We have just been back a week and my pictures are amazing. The clarity, color and detail look professional.  I am so happy with this camera. It was the right size to stick in my pocket yet large enough to feel secure in my hand. I bought the 1GB memory stick and took all my pictures on high (3.2) resolution. Took over 400 pictures on this memory stick and still some space left. Also the battery charge lasts over 2 hours so I could go on excursions with just my little camera. No need for batteries or extra memory sticks.  HIghly recommend this camera", "Date": "August 1, 2005"}, {"Title": "so far so good", "Author": "norman", "ReviewID": "R1LNE4W6QH0WW5", "Overall": "5.0", "Content": "Love the camera so far. I don't understand why some people are having problems with blury pictures. I have taken over one hundred and not a single blury picture. Very sharp and color is great. The only negative is downloading to computer and charging battery. So I ordered the docking station right here from Amazon. That should solve that problem.", "Date": "March 15, 2006"}, {"Title": "Suprub tiny camera", "Author": "Mark E. White", "ReviewID": "R1JU1U95TPYNKB", "Overall": "4.0", "Content": "Far exceeded our expectations.  Perfect for point and shoot or taking short movies of the kids doing cute things when the spirits move them.It seems fragile and the dials and settings require a bit of a learning curve.  At first many of my pictures were out of focues, but this has decreased dramatically since I learned to set the scene settings for various kinds of light.Yhe video and audio are amazing, but you cannot use the zoom features and it is easy to get shaky hands while taking these sequences.If you are willing to risk disaster if it falls, go for this nearly perfect camera.  Get the 2 MB pro membory stick from the chepest vendor.  It is annoying that they sell it with aminute memory stick, which you cannot cash in on a better one.  The Sony battery is amazing and seems to last forever, so you needen't buy a spare.The Cyber-Shot station is a supurb accessory to keep the camera charged and uploaded.  Myseteriously, it comes with a wireless remote that seems only to work in the station, allowing you to take pictures of you desk or visitors without them being aware, I guess.  It would be infinitely more useful if this allowed you to connect to the camera and take self portraits from afar, but for some odd reason this did not apparently occur to the Sony engineers.By snapping away and taking dozens of easy pictures of scenes from differnt angles, I have been able to capture amazing shots where everyboy's eyes are open and they are actually doing things rather than painfully posed.  It is not clear if the huge 7Mpixel size really is any better than 3 or 5.All in all, it is an astouding value for a picture that fits in your pocket.  Just don't drop it!  And keep it away from the kids.  Otherwise perfect for parents of small children.", "Date": "August 1, 2005"}, {"Title": "While the big camera is away...", "Author": "Lovisa Gustaffson", "ReviewID": "R8LN7ECTOZFS9", "Overall": "5.0", "Content": "...This little camera will PLAY.This is definitely the little portable camera to have.  I bought the Sony Cybershot after realizing that I needed to have a camera half the size of my \"old-school\" Minolta Maxxum 7 if I wanted to capture half of what I missed in not having the high quality big heavy thing stashed in my little chesire cat purse.The picture quality of this Sony Cybershot is superb, especially for the size.  Being able to record videos with the memory card pro is definitely a very cool at-your-service switch-it-up feature.Sure, I have my own sqaubbles w/ the sometimes failing picture quality of digital, which is a very small percent of blurrier images, usually resulting from movement on the part of the photographer, or a combination of subject or photographer movement and low light. But you hardly have to retreat to delete... MOST of the time images are captured perfectly at an image quality a photographer of any media can be proud of.You must remember that I \"went digital\" not in an attempt for what I consider the true art of photography, but to merely always have a little camera with me that can somewhat live up to my standards of photographic quality while my big camera is away.  This little Sony definitely has not failed and I am very happy with it.This camera takes awesomely to the dark capturing low light images in a highly visible nature. It is easy to use too, and the range is great; you can easily take videos or still photos of you and your friends with your very own normal-length arm.;)Overall, I would highly recommend this camera. It is the perfect sidekick to the person who feels somewhat helpless and stranded without her camera, yet feels that most portables are still like not having a camera with her at all (the lonnnng battery life is GREAT).  The Sony Cybershot pixel quality has enough to suppress these anxieties, and will be the high wire act in digital photography for quite a while, hence, mollifying finicky photographers like me, yet not putting me out on the street with it's cost.8-)I've truly not been disappointed with this purchase.:P", "Date": "July 25, 2005"}, {"Title": "Great Camera for Everything", "Author": "T. Willis", "ReviewID": "R3886Q43ZPTNOJ", "Overall": "5.0", "Content": "This is a great camera. It can do so much.  It can even be used manually and you can adjust the apeture, etc.  But it is easy enough that you can hand it off to someone to take a picture of you without giving them a camera lesson.  I have been very impressed from the moment I took it out of the box.", "Date": "July 6, 2005"}, {"Title": "Don't buy this camera", "Author": "Sal \"sandalot\"", "ReviewID": "R1JNIPWX8PS41Y", "Overall": "2.0", "Content": "I bought this camera to replace my Canon Powershot 5MP that seemed to have constant red-eye problems, and I am so sorry I bought it.  I have the exact same problem with this camera that other people have described in their reviews.  The flash is often out of synch, so pictures are either over exposed, or else totally dark.  Also, the slightest movement causes the pictures to blur, and hence, otherwise picture perfect moments are totally ruined.  This is my third digital camera and I've never had these problems with any other camera.  If you want to take pictures of still objects outdoors in daylight, the pictures are fabulous, but otherwise, this camera is just awful.", "Date": "August 11, 2005"}, {"Title": "Not overly impressed", "Author": "William M. Gibson", "ReviewID": "R2COS3LDBPZ57E", "Overall": "2.0", "Content": "I traded up from an Olympus 3mp. My old camera took consistently good photos, but I like to do alot of cropping, and I thought upgrading to 7.2mp would give me greater ability in that area. Also, I wanted a smaller camera.I must say that I've taken about 200 photos with my new Sony, and I'm not overly impressed. I tend to shoot almost all my shots in full auto mode, and at least half of the photos were blurry, or the color was not accurate. I took thousands of photos with my old Olympus, and I would say maybe 10-15% didn't turn out good. With the Sony its 50%. That's not right! Some might say that I'm doing something wrong, but I'm simply comparing full auto mode of my old Olympus to full auto mode of the Sony.Its possible I got a bum camera. With all the glowing reviews that I have seen on this camera, I tend to think that is a possibility. I'm going to send it back to Sony and get a new one, and see if its any better. If not, then I'm going to return it. Unfortunately I bought it online and they don't take returns, but fortunately AMEX has a return policy and they'll take it back.**Update 3-12-05**I am probably one of the few people that now can say they have owned the new Sony P-200 and the new Canon SD-500. As noted above, I was not pleased with the picture quality of the Sony. I went out and got the Canon today. WOW! Big difference! I've taken about 100 shots with the Canon, in varying lighting situations, all in auto mode, and not one blurry picture!!! The quality, detail and clarity is much better than the Sony in my opinion. I did not conduct a rigorous test, but just took some identical shots in identical lighting with both cameras, and the Canon won hands down. Sharper pictures. More detail. More natural color.Perhaps I have a defective Sony camera, but I have seen some other reviews where people had problems with blurry pictures, and it seems to be a known problem with the camera. After playing around with the Canon, I don't even want to take the chance of returning the Sony and getting a replacement. Its getting returned right away.", "Date": "March 13, 2005"}, {"Title": "Appreciation for this camera grows over time", "Author": "E. Souza", "ReviewID": "R3N5HNOHGY58U9", "Overall": "5.0", "Content": "It may seem odd to review a tech product like this that's basically 2 yrs old now, but I'm finding that as I survey the market for a possible upgrade, I'm not finding a worthy successor very easily.Now that features such as image stabilization and face detection are becoming commonplace in point-and-shoot cameras, I figured I'd survey the scene for a possible replacement of my P200.  I wouldn't mind something that's even a bit more pocketable than the P200 as well.But what I'm finding is that nothing out there provides these improvements while still also providing the range of features that the P200 does, as a great example of camera that can satisfy a range of skills from beginner to intermediate.Are fewer point-and-shoots supporting manual settings these days, or is it just me?  Where's custom white balance, manual aperture/shutter settings, etc. alongside image stabilization?At 7.2 megapixels, the P200 doesn't give me much reason to upgrade on MP alone.  And after testing image stabilization on a few point-and-shoots, I'm finding that the noise this often introduces in the shot isn't an acceptable tradeoff for a more stable image, in my mind.  Meanwhile, there's the apparent lack of manual settings in these newer models.Long live the P200!", "Date": "May 14, 2007"}, {"Title": "Terrific Digital Camera!", "Author": "book worm", "ReviewID": "R1GTKG5K877WFR", "Overall": "5.0", "Content": "I bought TWO of these cameras last Christmas for our two teens. I researched all available reviews and decided it was worth the expense to get a good camera with upgrade potential. We have not been dissapointed.The camera is so feature-rich that it was a bit overwhelming for a teen, and we probably have only used a fraction of this camera's features so far. At first the kids (then 12 & 14) did have some trouble getting clear pictures, but have learned to hold the camera a little stiller. This was a very short-lived problem for one of them, the other tends to be less patient and still has occasional problems. Both have other cameras, but overall are photography novices.We just came back from a big vacation in Oregon and both kids took hundreds of photos each (of course we upgraded to the 1 gig card). One took more than 500 photos, the other more than 700 photos plus numerous short videos. There were no space issues with the cards. The uploaded pictures and the prints are the most beautiful results we have ever had in our history of picture taking. You know when you come home from a trip and are dissapointed that your pictures didn't capture the beauty of a place as you remember it? Well this is the first time that that has not happened--in fact, the greens were so deep, the color so saturated, that some of the places seemed even more beautiful than I remembered them!Here's what my friend said of the trip pictures (she's quite a perfectionist and takes better photos than I):\"Wow!!!!!!!!  Your photos take my breath away!!!!!!!!!  I've already watched the slide show twice, but want to watch it again before I comment on the pictures that really grabbed me.  There were a ton of them!  Surprisingly enough, DSC01336 may be my favorite.  It is picture 47 in your 3rd Installment -- on Mt. St. Helens, with brown grasses, old stumps, and small, new-growth trees.  I'm still trying to figure why I like it best, since it has such stiff competition -- the waterfalls, the roses, the tide pools -- wow!, the ocean view, The Columbia River Gorge (one of my dream vacations), etc.  Maybe it'll get knocked out of first place during my third viewing.\"As you can see, I'm not the only one in awe of what this camera can do. The shots of urban art and architecture were crisp and impressive. Even fine architectural features taken on full zoom had fine, crisp detail. The camera seemed to stop the action of the waterfalls in amazing detail in spite of great distance from the scene. The patterns of water droplets stopped in midair were amazing. Water flowing in streams seemed velvety, capturing a detail of texture I haven't seen before. We watched every second of a beautiful sunset on the coast. My daughter wasn't taking photos and I asked her why. She said they weren't turning out, based on looking at what she was capturing on the screen. The sunset was so amazing I used her camera and took the photos anyways. When we uploaded them they were breathtaking. I guess the screen just couldn't display what the lens captured. We photographed tide pools, looking down thru the water at the aquatic life below. I was sure this would be mediocre. It wasn't. The detail of sea life and color was as good as with the human eye. The kids also captured dozens of roses close up and with great clarity, even though they couldn't find the macro feature of the camera at the time. Water droplets on the flowers were amazingly clear.The only photos I consider average were the mountain shots on very cloudy, hazy days. Both Mt. St. Helens and Mt. Hood had overcast, rainy, or foggy weather, and the photos appear more like those you would expect of an instamatic camera. Perhaps this is because the camera can't focus as well under those conditions. We also had trouble in Timberline Lodge, not getting enough light in some of the photos. However, only the automatic setting was used so this could probably be corrected.Overall, I cannot rate this camera highly enough, and agree with previous reviewers on more technical aspects such as great battery life, etc. Accessories we purchased include:\"Sony LCSPHC Soft Carrying Case for DSCP100/P150/P200 Digital Cameras(Textile)\"\"Sony 1 GB Memory Stick Pro ( MSX1GS )\"I HIGHLY recommend this case. I read all the reviewers of different cases that \"fit\" this camera and decided this one is best. When we got it, it fit like a glove. It's perfectly padded, compact, has a nice front pocket for extra cards or ID. The case has a very solid hook on the back so you can clip it to a jean loop so that when you take out the camera you can't loose the case, plus your hands are free to take the picture.", "Date": "November 29, 2006"}, {"Title": "Sony  DSC-P200 Cyber-Shot Camera", "Author": "old hickory", "ReviewID": "RATT4WMABK3U5", "Overall": "5.0", "Content": "I am very pleas4ed with this camera. It is the first digital camera I owned. It feels good in my hands. Instructions are very clear which made learning to use easy. Pictures can be loaded into the computer easily and are a very good quality. I would recomend this camera very highly.", "Date": "March 14, 2006"}, {"Title": "Wow!!!", "Author": "Geary J. Plateroti \"GJP\"", "ReviewID": "R3AV9LV09XUHAT", "Overall": "5.0", "Content": "This is some camera. Not only are the pictures beautiful,but it is so easy to use.Try the movie mode, it will shock you how well it performs.I have a lot of digital cameras, and I take this onewith me most of the time.", "Date": "November 11, 2005"}, {"Title": "Flash problems....", "Author": "David Jones \"Dave\"", "ReviewID": "R2FS5P5JV1PKOY", "Overall": "4.0", "Content": "I have had this camera for 2 months now and it has been great until this past weekend.  The flash will flash but it seems that it is out of sync the picture. (picture is dark)  *The funny thing is that it does work properly at times! -so frustrating.  I have emailed Sony in regard to this problem in the hopes that they relase a Firmware update to fix this matter.  A friend of mine has the same camera and has the same problem I have just mentioned. (2 out of 2 cameras known)", "Date": "June 20, 2005"}, {"Title": "What a great find!!", "Author": "Tonja Cassity", "ReviewID": "R3PM8FD6DZLAPV", "Overall": "5.0", "Content": "I was skeptical of going digital.  I have an SLR 35mm camera that I adore, but I got a new computer and wanted to do some stuff with digital photography.  I was looking at the SLR models of digital cameras, but I decided since I already had a regular one like that, I would look at the smaller digital cameras that way I could just fit it in my purse, and not have to lug around all of my lenses and stuff.  I wasn't sure I wanted this particular model because it is skinny, it is not as pleasing to the eye as some of the others..but I wanted the high megapixels.  The salesman talked this camera up, and I like Sony products so I thought I would give it a try.  I LOVE IT NOW!!! I shoot pictures all of the time.  I also was not too crazy about the size of the LCD screen.  There were other cameras with bigger LCD screens, but this one had a lithium battery and I really liked that.  I am so glad I picked this model!!  Very easy to use, and the buttons are very easy to access and understand.  I LOVE THIS CAMERA!!!! I concur with the other review on this camera, you need to go ahead and purchase a bigger memory stick or card because the one supplied in the camera only holds about 20-30 pictures!!", "Date": "June 19, 2005"}, {"Title": "Too many problems to get good pics", "Author": "Ana Monica Rodas \"AMRU\"", "ReviewID": "R923K822KJ1ZP", "Overall": "1.0", "Content": "I had the hardest time trying to get clear pictures with too much light or at night.  The pics are coming blurry.  I am not happy with this camera, it not easy to use at all.  Even though I have a friend that has the same camara and tried with the same pics, my pics came out totally unfocus, with black lines, dark, etc, etc.  I don't know if its only my camara, but for me, didn't work out.", "Date": "December 30, 2007"}, {"Title": "Best camera I've ever owned", "Author": "Barbara Seabolt", "ReviewID": "R36XWN4C1PIJN3", "Overall": "5.0", "Content": "I bought the DSC P 200 last year, after spending thousands of hours reading these reviews!!! and I've never had a better camera. So, thanks to everyone who reviewed this camera, and recommended it. This camera takes credible photos from the inside of the car, with the window closed, going 60mph! It fits in your pocket, and stays charged up for days. There are lots of features that I still have not figured out, but all you need to do is point, click and you get a great photo.", "Date": "November 28, 2006"}, {"Title": "Some great features, but....", "Author": "HWWoman \"HWWoman\"", "ReviewID": "RSGB33DTJ6T33", "Overall": "3.0", "Content": "I have had more almost a year to work with this camera, and still have to learn a lot more, but here's what I know as a novice digital camera user:1)Fast Response Time and Vivid Outdoor Photos - In outside lighting conditions, this camera is fast with the automatic settings and the colors are vibrant;  you can capture life (such as a cartwheel or a golf swing) with this camera as it happens, something that I missed out on with my older Olympus - the image quality is more often than not outstanding;2)Using the Zoom Lens - The zoom lens is more dependent on the distance of the object in focus and the amount of light than I would like - in other words, in low light conditions using the zoom, you will in many cases end up with blurry, moving subjects;3) Portability and Durability (or lack thereof) - I love the size and shape! The camera is lightweight and attractive - a great camera to take along with you everywhere you go- the body is metal, however be forewarned - the one time that you drop your camera (as I did - in dry sand on the beach) could be one time too many, especially if you are out of the warranty period. The lens began to malfunction immediately and would not extend or retract.  I could view the photos that I had taken prior to the fatal fall, but otherwise the lens cover would not open.  Fortunately the camera was in the last few months of the one year Sony warranty, so I was able to contact Sony and get it repaired - it came back within two weeks, and appears to be repaired, though I haven't had a chance to try it out yet;4) Battery Life and Proprietary Battery - In the meantime, I purchased another identical model anticipating that the wait time would be long and right away there was one fussy feature with the new camera - it would only accept proprietary  Sony batteries, not the non-proprietary batteries that I was able to purchase for $10 each and use with no problem with my first camera;  battery life is not a major concern, however - this camera can go about 200 minutes of average use on the same battery;4) Using the Movie Mode - The zoom feature is useless for video - don't even think about using it because most likely you will end up with grainy, low quality video - also if using the video feature don't turn the camera vertically (keep it horizontal) because as far as I can see, there's no way to turn your movie around when viewing it on the computer - otherwise the microphone works very well, and the sound quality is good - you get about 20 minutes of video on a 512mb memory card;5)Indoor Flash - you may find as I did that the flash is great for closeup images, but does not capture any of the background, so you may have very bright subjects in a dark, indistinct background;6)Using No Flash or Night Setting - here you have a chance to experiment with other effects, and sometimes you'll be successful at capturing a relatively clear, non-blurry image, but oftentimes you won't if you are holding the camera rather than using a tripod;One thing that I want to add is that I also tried out the predecessor to this (DSC-P150?). I purchased a return at a local department store.  I returned it because a brown, blurry spot was showing up in almost all of my photos, a complaint that has been voiced by many about this camera as well.I am happy to have my original camera back and be within the 30 days for return of the second camera, however if I were in the market for a new camera, I might shop for a different Sony model or for another brand, realizing that there may be a better option out there - Still I am looking forward to experimenting with many of the automatic and manual features that I have not yet tried!  Prices have come down considerably in the last year.", "Date": "May 27, 2006"}, {"Title": "The 'fuzzy life'", "Author": "Shortall", "ReviewID": "R2R1PI3RIWGH71", "Overall": "2.0", "Content": "This camera is a real 'sunbather' type... and if you're in optimum outdoor lighting, and esp. with a subject made of stone (not moving or dead)... chances are pretty good this camera will take quite excellent photos. Anything less than that, and you're likely to experience a good deal of headache in the form of a very high percentage of 'fuzzy pics'. This model is a real 'hit or miss' when shooting indoors unfortunately. Even in fairly good lighting conditions and/or with a variety of settings.And like David Gudas's previous review well stated - this camera does indeed have a FATAL FLAW which I learned of very  well while using it at an indoor event recently - Use the zoom in anything even remotely less than that previously mentioned 'optimum lighting'  and you will have both fuzzy and very dark photos - as the flash will go completley out of synch with any use of the zoom. Making that option useless.Because of that last esp. I can only now recommend passing on the p200, & wait for Sony to release a newer model that (hopefully) fixes these issues.PS: I also have to agree about the 'box issue'... I've not encountered a wackier Rubick's-cube of packaging than what the P200 comes tucked in.  Definitely designed for added annoyance.", "Date": "April 30, 2006"}, {"Title": "Awesome DSC-P200", "Author": "rager", "ReviewID": "R3J9CN2G1DHHQR", "Overall": "5.0", "Content": "Fast. Easy to use. I couldn't get the grin off my face after firing it up. ;)~With a 512MB flash card it takes a 20 minute movie, with sound!!!What a jump over my Sony FD-100. Just fabulous. (grin)", "Date": "April 4, 2006"}, {"Title": "Deserving of 7.2 Stars to go with its Megapixels.", "Author": "T. Moore", "ReviewID": "R26LUVE3RRNIV2", "Overall": "5.0", "Content": "Fantastic little camera. Great form size. Not to small, not to big. Fits easily in your jacket pocket.Great pictures, easy to use menu system, lots of features, but you choose how complex/simplistic you want your picture taking to be.Perhaps the best feature is that when you turn the camera on, it is almost intantly ready to take a picture. No longer miss the shot of the lifetime while you watch the camera hiss and hum getting ready to go.", "Date": "March 11, 2006"}, {"Title": "Just buy it.", "Author": "Thomas Bonneau", "ReviewID": "R1DOIZYRNU5OE", "Overall": "5.0", "Content": "I did a bit of research looking into buying my first digital camera, and I'm EXTREMELY happy with my Sony Cybershot DSP200.My critera were:-Quick shots, not much lag time-Not blurry-No red eye-6+ MP for printing photo albums online-Good battery life-Pocket sizeThis meets all my qualifications by far. The best part it its super quick. You can pull it out, turn it on, and be ready to snap in 2 seconds, literally. Lag a bit longer with flash, but not bad at all.Features are good enough for casual user. The LCD is not huge, but that was far from a priority for me. Who cares about the LCD. You can pay a twice is much for smaller cams with bigger  LCDs (and less MPs mind you), but I don't know why you would.If you are the casual photog, just looking for a nice entry level piece, you can't beat this price. I am more than happy with my purchase and would recommend to anyone.", "Date": "March 3, 2006"}, {"Title": "\"I changed to good for better!\"", "Author": "J. Sanchez", "ReviewID": "R1AZNVDF885R76", "Overall": "5.0", "Content": "My first digital camera was the Sony DSCP100 which I consider it's very good, but I decided to change this one and I'm sure that was the best desición. It is a great camera for the whole life and the quality of image is much better than the other one.I like The large 2 inch LCD on the P200 also makes it much more user friendly than smaller 1, 1.5 or 1.8 inch displays. The turn on time for this camera is one of the best, probably somewhere around a second between pressing the power button to being able to snap a picture. The higher image resolution allows her to significantly crop her photos and still display excellent final print clarity.I think this is one of the best Sony cameras.I am very satisfied with all its presentations it's an excellent value and pleasure to use.", "Date": "September 10, 2005"}, {"Title": "grrreeeattttt camera!", "Author": "Carlos Alejos \"Chine$$e!!!\"", "ReviewID": "R27IG7PRJL7Q4J", "Overall": "5.0", "Content": "this is my first digital camera and i want to say that it is AWESOME!!! the red finish is perfect! very cool color... excellent purchase with the sony value kit and memory stick sony 512mb. I recommend this product!", "Date": "August 21, 2005"}, {"Title": "great little camera", "Author": "AGA", "ReviewID": "RQKN1OIK0XPL", "Overall": "4.0", "Content": "I love my new camera, it's my second sony digital, I gave the old one to my husband so that I could get a newer one :-)  It's small enough to stick in your pocket, you can zoom in and enlarge without losing quality.  It would have been more convenient if it used rechargable AA batteries.  Overall a great little camera, can't imagine how Sony's going to come up with a better one.", "Date": "August 12, 2005"}, {"Title": "Blurry, blurry, blurry...", "Author": "LPS \"LPS\"", "ReviewID": "R1K75380D2TK89", "Overall": "1.0", "Content": "I have sent my DSC-P200 back to Sony twice for repair, as it is taking approx. 25% of the pictures either blurry, out of focus, or with odd motion trails. Yet, they claim the camera works perfect. My past two Sony's and my Nikon had no such issue-- so did I suddenly forget how to take a picture? Sony thinks that is the case. I'll let you judge for yourself - visit [...] and see real life examples for yourself! I'd look elsewhere rather than take a chance with this model...", "Date": "August 4, 2005"}, {"Title": "Sony Cybershot DSCP200 7.2MP Digital Camera 3x Optical Zoom", "Author": "Donna L. Latulippe", "ReviewID": "R17T6F7LF2J0IT", "Overall": "4.0", "Content": "Overall I think this will be an excellent camera. I think as a first time digital camera user, it has a lot of options and my daughter and I could not believe how detailed the photo of her dog came out as we closed in on his face. It was amazing. The only thing I don't like is the little door to recharge the battery does not seem to be something that will hold up for the life of the camera. I'm afraid it will break apart eventually and that is the one thing I do not like. For the price of the camera, I think this should have been better made. I am really disappointed with Sony at this feature.", "Date": "August 29, 2005"}, {"Title": "Excellent digital camera for the cash...", "Author": "Afrik Anne \"AA\"", "ReviewID": "R2R9HPYLS26D1T", "Overall": "5.0", "Content": "I purchased this camera for shooting product photos for our website. I had been using a Nikon Coolpix at 5mp and wanted something relatively low cost with higher mp for the next few years. We plan to purchase something totally outlandish in a few years for super-quality printed photos, but for now, this camera is an excellent investment. Easy and small enough for everyone in the company to carry on trips abroad, but inexpensive enough to not break our hearts if pocket-picked or eaten by a hyena.I've read some reviews that talk about blurred photos...I'm really surprised. I began using ours after I had my son, so many photos were taken without a tripod, one hand holding a nursing child and the other shooting photos...and none of the images turned out blurry. I have taken a few photos of my son now that he's a six-month-old super action hero that look like cotton candy on my Nikon but turn out crystal clear on the Sony.The movie mode is a real plus. I'm actually on this page today because I'm looking to buy one of these for my personal use with video recording in mind. We have a digital video camera, but with plenty of 1G memory cards in hand, I'd rather record action with this camera--the quality and sound are worlds better.This is a lovely little low-cost camera that's suitable for a wide range of users.  I love it!", "Date": "November 7, 2006"}, {"Title": "Great camera!", "Author": "marijke \"violist\"", "ReviewID": "R1DF1JLE44R1QJ", "Overall": "5.0", "Content": "I bought this camera about a month ago and have been highly satisfied with every part of it. At first, I wondered if this was a good choice because of the high price which I could not afford on here, but after doing some local research, I found a great price for this camera and bought it and used it the same day. My first experience, shooting in full light indoors, was great. The zoom worked great and even in an auditorium where there was less light, this camera did everything I needed. The zoom is great and keeps everything at a good resolution and doesn't get it blurry, which I found to be a problem in other cameras. It also has an amazing 7.2 MP which makes it even worth a very high price. I can't find another compact camera this size with such good resolution. Outside it also takes great pics. I was consistently impressed at it's ability to take shots that were not blurry, in a fast moving car. It's shutter speed is very high and you can change that in the Manual Mode, which comes in handy. Also, even shooting in the pitch black with no flash, it's able to take a good enough shot that when you go into a photo editing software, you can get a pretty good picture, or you could use the flash.Overall, I'm very impressed with what Sony has done and it doesn't matter that this is an \"older\" camera, when it comes to new technology. Sony is top mark in its category and I'm consistently impressed with what they come out with. I still  need to find a Sony product that doesn't work at top notch performance. It's great for traveling, very small, and takes amazing pictures. I reccomend this to an amateur photographer, or just someone who wants a point and shoot camera, it has everything. But, just as a note, if you want SOUND on your videos, you need a memory stick pro, which doesn't come with the camera, however the 32 mb will keep you going for a while. Happy shopping!", "Date": "May 22, 2006"}, {"Title": "Ultimate light-weight digital", "Author": "Kaelin \"Love2Travel\"", "ReviewID": "R2NOWA57P0BBFI", "Overall": "5.0", "Content": "Bought this as a Christmas present to myself - traveled for two weeks internationally recently and forgot the charger. This gem never missed a beat and I took pictures everyday without a recharge.  Just a phenominal camera.  Excellent quality pictures that I blew up to very large sizes - buy without hesitation - you will LOVE this camera!!!", "Date": "April 25, 2006"}, {"Title": "Novice Photographer's Opinion", "Author": "Joan E. Scherer \"bug shot\"", "ReviewID": "R35CE20BP0X88Y", "Overall": "5.0", "Content": "I am truly impressed with the quality of the images that are captured on the card.  Also, with the ease of the use of this camera and downloading to viewing on my computer.Amazing.", "Date": "February 23, 2006"}, {"Title": "Very Disappointed...", "Author": "Kelly \"Mom to Aidan (7/05), Owen (4/07) & Eth...", "ReviewID": "R2Z0IMX2TO0R6K", "Overall": "1.0", "Content": "I used to have the Sony DSC-P70, my absolute favorite 3.2 megapixel digital camera, but it was stolen.  I had been so happy with it, that I went out and bought the upgrade of this model - the DSC-P200.  I've never been more disappointed with a Sony product.  The pictures come out great when taken outside in ideal light when the object/person you're shooting is holding still.  If you attempt to use the zoom, or take pictures in not-so-perfect lighting, you get a fuzzy picture, one that is completely white or black (from the flash not working right), or strangely, one that is all red.  I have played with the settings, but the problem only gets worse.  If you're shooting only still, outdoor objects in the daytime, then maybe this camera is for you, but my 9-month-old doesn't hold still for anything, and I'm going to look into returning this camera and getting something better.", "Date": "May 6, 2006"}, {"Title": "The best digital camera i've ever had", "Author": "Galal Hazzi \"Gello\"", "ReviewID": "R3TPNE9SDN38IP", "Overall": "5.0", "Content": "I got this camera after over 2 months of researchs on the internet and visting the stores to touch the competetive cameras in this category. This camera is really great it brings a very high image quality and also from my point of view this camera can be used by everybody, it has a perfect AUTO mode that will brings you a very nice shots without efforts and for the enthusiast it has a MANUAL mode by which you can use to control some aspects of the shot especially the manual balance feature and also the perfect thing about this camera is the wide variety of accessories including lenses and filters, bags and cases and tripods this wide variety make this camera a perfect choice for amateurs who are willing to become more involve in the digital world of photos.conclusion this camera is excellent but the only bad thing about it is the that the memory stick is more expensive than the other cards but you can get it from amazon or wait till you find it on sale.I highly recommend this camera over the Canon SD500", "Date": "December 30, 2005"}, {"Title": "Impressive small package", "Author": "Javier Salazar", "ReviewID": "R2I585W5ROYGO5", "Overall": "5.0", "Content": "I have SRL cameras since many years, the mess to reveal is well known, i enter the digital world for about 10 years so i have decide to buy a small camera with full of features of professionals, first i choose is a well constructed lens, Carl Zeiss are famous for their telescope lens a state of the art technology, second i have an idea of Sony's reputation of small tec and fast ccd chip in just 3 sec i have made a photo, third reason, cameras compact chargeable battery with extended life, and fourth a reliable fast memory (i buy Memory Stick Pro High Speed- 80M/sec). Sony meets these requirements and surpasses them, is a must to compare with same size of other brands and this will be one of the best for its size. If you learn to set the camera, the blurriness suddenly disappears. Check my pics contribution and then decide.", "Date": "August 17, 2005"}, {"Title": "First Granddaughter", "Author": "D. L. Carter", "ReviewID": "R3TZNKNW02P23C", "Overall": "4.0", "Content": "I purchased this camera for my wife as a birthday gift. I'm glad I did because two weeks after the purchase we were grandparents of a baby girl. We have two grandsons so the girl was definitely special for my wife and myself. We took pictures with the new Sony Cybershot. We took pictures at the highest image setting, and also the lowest for emailing to family and friends. To make a long story short, my wife loves the camera. Ease of use, compact,instructional disk very easy for her to understand.", "Date": "September 21, 2005"}, {"Title": "Wish this camera was build to LAST!", "Author": "Nellybelly8cp \"Janell\"", "ReviewID": "R13CNV7VBAO80V", "Overall": "2.0", "Content": "This camera was an awesome little camera.  I loved the features.  But it broke on me after 250 pictures.  I had to take it back.  The flash was not working on it.  It either took all black pictures or all white pictures.  I wanted to buy another one, but apparently that was a common problem.  So while the features worked great, easy to use good size and shape...I will not be getting another one due to all the problems it has.", "Date": "March 28, 2006"}, {"Title": "great!!!", "Author": "Tam Huynh", "ReviewID": "RIX7OUZN5NO6O", "Overall": "5.0", "Content": "i bought this camera because of the 7.2 mp. the quality n clarity of the pictures that i take is fantastic. i own another sony cybershot it's the dsc-t1, and i think this is way better. it's a lil bulky but not too much it still looks really nice. i was gonna go for the canon powershot sd400 because it was smaller and cuter but this had better picture quality and that's all that really mattered to me. this is also a great buy because i bought the t1 for about 540 including tax and you get this cheaper and more megapixel.", "Date": "November 14, 2005"}, {"Title": "not easy to use and blurry pics", "Author": "Abby K. Nedrow \"plant girl\"", "ReviewID": "R14NNELJ70ZZCV", "Overall": "2.0", "Content": "I have had this camera for six months to a year and at first when the pictures were bad (blurry, blue or orange tinted) I thought it was just because I had to learn how to use all the features.  However, this camera seems to be impossible.  At least 3/4 of my pictures are blurry.  It has a very hard time if not in perfect conditions with a still subject.  Even then it has problems.  I think I have given it enough opportunity to take good pictures and its the worst camera I've ever had.The aspects I liked (which really don't matter if the pictures are awful) were that it is rechargeable and has a decent battery life, and it is compact and a good size.  Its also pretty sturdy.I recommend not buying this camera.  I don't think I will buy another Sony camera again.", "Date": "February 7, 2008"}, {"Title": "Overall, Nice Camera", "Author": "Nicole Buchheit", "ReviewID": "RGXQMM9BR513N", "Overall": "4.0", "Content": "If you're thinking of buying this camera... I have a few things for you to be concious of beforehand.1) If you're going to be taking sports pictures (of your kids, or whoever!) and you're indoors our outdoors on a darker day or under lights, the camera does not take any decent pictures.  They're all too dark.  This was one big disappointment for me, regardless if you're in sportsmode (this acutally makes it worse) or just taking the photo in the normal mode.. it doesn't come out.  If this is one major thing you're planning on doing with the camera I would re-consider.2)The zoom isn't what it could be -- at times it's a little frustrating at how little distance 3x really is. Just a thought.Overall, I love the camera. I highly recommend getting a big memory card so you can go a long weekend/vacation without worrying about going over!", "Date": "April 14, 2007"}, {"Title": "OSOM", "Author": "Kunal Rege", "ReviewID": "R1O2OUKDDPCE22", "Overall": "5.0", "Content": "I have been using it for almost a year, I got it for my mother, she loves it.Pros:The picture quality is so good!!!! (on 7.1mp)Battery life is superb, probably one of the best for small cameras.LCD sizeNO Redeye ever!!! very few cameras this size can do thatlots of featurescons:video was not very impressive, quality goes down considerably when you make it a full screen on a 15 inch monitor.it is still very expensive, almost 300$ even now,  I still think it is expensive for a camera, but i guess it is worth the qualityI didnt use software that comes with this so i dont know if there are cons or pros related.", "Date": "October 13, 2006"}, {"Title": "Excellent Camera! Small, easy to use, and high quality pics...", "Author": "Anthony F. Cerella \"Tony Cerella\"", "ReviewID": "R2XHSC7KVDXVG6", "Overall": "5.0", "Content": "My wife and puchased this camera about 10 months ago. We have been absolutely impressed with the quality of the pics. The camera is easy to use and quickly turns on. We have taken trips to Hong Kong, Beijing, Korea, and Japan with this camera and it has never let us down. We purchased a 512MB and a 256MB card to ensure we had enough space for our trips. We did a great deal of research prior to purchasing the camera and considered buying a cheaper camera....but we definatley recommend spending the extra money for this camera.", "Date": "February 26, 2006"}, {"Title": "Very good point N shoot and MORE", "Author": "Rodney", "ReviewID": "R3AGQF2PJGIH9Y", "Overall": "5.0", "Content": "When used with a tripod this camera produces very good exposures using manual, program, and auto modes.  The small size makes for good pocket storage.  Using the auto mode gives acceptable results however use of manual or program modes and adjustment of settings manually, this thing produces better results than most 35mm film cameras can.", "Date": "August 4, 2005"}, {"Title": "Great Camera", "Author": "Jonah", "ReviewID": "R2GQA1FR5ZN9HE", "Overall": "5.0", "Content": "This is my first digital camera and I'm very pleased with it. The size is perfect for my bag and it's a really cute color. The memory stick was to small on memory so I bought a 1GB instead. Overall, I'm very happy with this camera.", "Date": "August 26, 2005"}, {"Title": "Great Christmas Present", "Author": "Rebecca R. Rueblinger \"beckyr718\"", "ReviewID": "RH9H5PZNICZ3C", "Overall": "5.0", "Content": "I just got this camera for Christmas and I love it.  I had a previous Cybershot 1.3 megapixels camera for about 4 years  It took great pictures, but the battery life was starting to get annoying and I wanted more megapixels.  This is a great replacement!!  Very easy to use, although I still haven't discovered all of the neat features!", "Date": "January 3, 2006"}, {"Title": "Truly Awesome!", "Author": "Jackie Wheeler \"Country girl\"", "ReviewID": "R3JBBQI0B1OFKB", "Overall": "5.0", "Content": "This camera is so easy to use and master. I'm not much on electronics, so I was worried I'd have a hard time with this camera. Not so! After just a few months I'm downloading to my computer and using the software provided with my HP Photosmart 8050 to crop and enhance prints. The Sony Cybershot DSCP200 is a real jem!", "Date": "November 5, 2005"}, {"Title": "perfect....except that darn flash", "Author": "BagelBudgie \"Teri\"", "ReviewID": "RI7TS2F6N4TVV", "Overall": "4.0", "Content": "this is a great camera in most aspects. 7 megapixels is an awesome setting if you want professional photos, but other than that the 5 and 3 will work fine. the only complaint is the darn flash. It sad that such a great camera will only produce around 1/2 good photos when taken at night. The flash seems to be horribly out of synch, but when it works (which is whenever it feels like it) the photos are great. If you're using this for daytime, its worth the money. If not, i recommend buying a large memory stick (256mb i use) and dealing with it. We were told this is probably one of the best sony cameras, so if you are a diehard sony fan and want to stay in the $400 range...this is the camera for you", "Date": "June 22, 2005"}, {"Title": "Throw your money out the window instead", "Author": "Shankar B. Kolinjavadi", "ReviewID": "R3HJCXPTZF46DY", "Overall": "1.0", "Content": "This camera is a piece of junk. Though it looks i am repeating what has already been said by others earlier, i have each of the following issues.1 . Now the lens mechanism has jammed in less than a month since purchase and has to be sent back.got to contact sony - seeing all earlier horror stories, bracing for the worst.2 . at night time expect the blurriest pictures possible. be prepared to erase half the photos after clicking it. worst possible focussing3 . at night time, when using flash, half the photos are just black, even though the flash goes off, the picture has no detail. A nightmare", "Date": "February 6, 2006"}, {"Title": "Blurriest camera I've used - Beware", "Author": "Huxley", "ReviewID": "R2JZGEF5OIRZUD", "Overall": "1.0", "Content": "Either the rave reviews here are from people shooting still lifes and landscapes, or roughly a third of these cameras are defective.If you plan to take pictures of people or other non-stationary objects, be prepared to throw out about half your shots - this camera has an extreme tendency to take blurry photos. One of the other reviewers set up myblurrycamera.com to document his experience with this camera, and he captures what you can expect quite accurately.One other thing - the box it came in seems cleverly designed to be impossible to close properly once it's been opened, making returns more difficult. That's just annoying.", "Date": "August 23, 2005"}, {"Title": "CANNOT KILL IT", "Author": "Polly Ester", "ReviewID": "R3J8VMKCSI1981", "Overall": "5.0", "Content": "I bought this camera I believe in 2006.  I have accidentally left it on the top of the car and driven off, left it in the hot car, dropped it I don't know how many times, got damp in my pocket walking in the rain ect..ect.. and this little camera just keeps on working.  I've NEVER had a problem with the battery, the lens is EXCELLENT.I am an artist and use this camera exclusively for jumping out of the car and taking quick photos to use as reference.  I also use it as an all around take a photo of the kids, pets, sunsets ect...For only having 7.2MP it really takes clear, crisp photos with rich color.For reprints up to 5X8 I have been very satisfied with the quality.This is one of those cameras you wish Sony would just make a brand new version of.I only wish they would come out with a waterproof version!", "Date": "June 28, 2013"}, {"Title": "An Excellent Little P&S; - Great for Infrared Too!", "Author": "Kort \"Art, Music, Book & Movie Enthusiast\"", "ReviewID": "R3364SAYCWJF7G", "Overall": "5.0", "Content": "I have two of these camera and both have been modified to take infrared photos. This is a quality little point and shoot that has held up over time. It is fairly intuitive, responsive and easy to use, and the lens/sensor combination created detailed images. Looking at photos from this camera, you wonder why anyone would need more than 7.2 MP of resolution in a compact camera.But the main thrust of my review is to extol the virtues as an infrared camera. For those not familiar with them, infrared cameras capture light in a range a bit higher than the usual visible spectrum. Foliage and other vegetation takes on a white, wintery cast, and skies and water become darker and more dramatic. You can use some cameras to take IR photos just by adding a filter over the lens, but this normally entails the use of a tripod and longer than normal exposure times. The solution to this is to modify you camera by removing the \"hot mirror\" that blocks our much of the infrared spectrum. All you need do then is add an IR filter, either directly over the sensor or on some sort of extender. P200s make great IR camera because they are fairly easy to modify. Don't do it yourself if you don't have the proper tools or know-how. At the current asking price, it is a minimal investment to obtain a quality small format camera that takes such unique photos.  They require some post work in a photo editing program, but even raw photos are striking. I will post some in the customer images section to give you an idea of what you can expect.The bottom line -- a P200 is a great P&S; and 7.2 MP is more than enough for most people. Don't get caught up in the megapixel wars. Having more MPs just lowers the quality of the image while increasing it's size. If you are looking for a camera to modify for infrared use, then the P200 should be at the top of your list if you want one that is ultra-portable. AND they last - both of mine are still in fine working order.~ Kort", "Date": "November 20, 2012"}, {"Title": "Oldie but goodie", "Author": "Xina143", "ReviewID": "RCFPCJL9AYX69", "Overall": "4.0", "Content": "just thought I'd review one of our gadgets we've held onto through the years. We've had this camera for over 6 years now and over 4000 shots and it is still working like a champ. The battery lasts and lasts and the shots are always crisp, clear, and colorful. It has been thrown easily into many pockets throughout the years. It's a simple point and shoot with a great lens. It even has one of those viewfinders you can't find in cameras these days. Sure, there are lots of new cameras on the scene lately, usually with lots of useless fluff, but this unit is tried and true. I'm sure we'll upgrade to a new camera someday soon, but Sony created a wonderful camera in this quick and easy gadget.", "Date": "March 2, 2011"}, {"Title": "Knocks spots off newer cameras", "Author": "T. J. Cox", "ReviewID": "RCGLIRE4711AX", "Overall": "5.0", "Content": "I have owned a P200 since 2005.  When I bought it it was highly recommended by dpreview for its high quality lens and fast start up time.  Over the years it had got some dust inside somehow (driving sand on a Welsh beach perhaps?) and had dark spots on every photo - some more obvious than others.  Time for a new camera.  Started shopping.  Eventually settled on a Canon SD990 - ticked all the boxes - optical viewfinder, good zoom range, some manual control.  But the problem started with the pictures it took.  I don't mind out of focus pictures if it's my fault but I did mind the Canon pictures where their processor had oversharpened them to the point of losing all the fine detail in hair, fur, leaves etc.  If it had texture the Canon would blur it.  This gave my photos a rather surreal effect.  The blurry subjects appeared to be wearing crisp clothing in front of a crisp background but their faces and hair had a soft quality about them (and I wasn't even using the Soft Skin mode).  The other annoying thing was the way the Auto mode defaulted back to standard settings every time the camera was switched off.  In an art gallery I had to reset the flash to off every time.  Of course I could have used the Program mode but from my years of experience with the Sony I found that I wanted Program set to spot focus, spot meter and reduced flash.  That way any tricky focussing situation (small subject in front of background - camera wants to focus on background) could be sorted with one turn of the top dial.One of the other annoying things was that it's 'clever' focus wasn't that clever.  It chose inanimate objects over faces in Face Detect mode for example.  After many lengthy conversations with Canon it got returned.  (I suppose I should say at this point that the video I shot with the Canon was fantastic - you can even zoom while recording which is very unusual for a compact and certainly not available on the P200.)Back to the P200.  A few of weeks ago I sent it to Sony for a flat rate $131 refurbishment/repair.  It was back in about 3 weeks.  The service far exceeded my expectations - as well as getting rid of the spots on pictures problem they gave me a new LCD screen.  The old one was fine other than cosmetic scratches but now I have a brand new LCD complete with plastic cover.So I wanted to encourage anyone thinking of buying 'used' that they can get a fantastic service from Sony to fix any minor problems they might have with the 'new' camera.", "Date": "August 18, 2010"}, {"Title": "Excellent Pictures.  Prone to lens problems.", "Author": "E. Brooks", "ReviewID": "R1BM9ROUIOSJA9", "Overall": "2.0", "Content": "This camera has excellent picture quality.  However, this model is prone to having the lens get stuck or misaligned.  This has happened to me twice - - once under warranty, once not.  Unfortunately the cost to repair actually equated to a new camera.  Look on the net and auction sites and you will find plenty of this cameras sold as is because of the lens having some kind of problem.  Its a shame - I really liked this camera.", "Date": "January 25, 2008"}, {"Title": "Super camera, great size", "Author": "Lisa Shea \"be the change you wish to see in t...", "ReviewID": "R1IGQ4KO8R2KV3", "Overall": "5.0", "Content": "I have used many digital cameras over the years. I got this one right when it came out as a small in-purse supplement to my large-lens \"real digital camera\". The main camera had a gorgeous large lens, a super zoom, and was 5mp. I figured this one would be useful for times I was out and about and didn't have the real camera with me.Over time, though, I realized that I was using this DSC-P200 for pretty much everything. I do origami for sale and take tons of up close photos of origami creations. This camera was super for that. I run a birding website and take lots of photos of birds in trees. The camera was wonderful. I run a gardening site and take garden photos all the time. The camera worked like a charm!I go on many trips, to Alaska, to Hawaii, to the US West. There are all sorts of landscapes I need to take photos of - large cactii, glaciers, volcanos, and more. The camera has been brilliant in all situations. You can see years worth of photos from this camera on the lisashea.com travelogue area.The only reason I got another camera after this one is that it is *slightly* heavy and large in my purse. With the new credit card sized phones coming out, I moved up to an 8.1 megapixel camera that was slimmer and lighter. But I still find many features of this DSC-P200 to be superior than the new one I got. The DSC-P200 is just so easy to use, and the images are so nice in quality.Highly, highly recommended.", "Date": "December 10, 2007"}, {"Title": "Great pictures", "Author": "PMC", "ReviewID": "RKEYAV1USVTOF", "Overall": "5.0", "Content": "My sister owns this camera and I've used it a few times. It takes great pictures, quality pictures that are clear and the colors are deep and beautiful. I love this camera. She never had any problems with it.", "Date": "April 15, 2007"}, {"Title": "WOW.  Great Camera - easy, vivid photos, compact", "Author": "Kate Chan \"Kate\"", "ReviewID": "R1C6TB98Y48GBK", "Overall": "5.0", "Content": "I am in LOVE with Photography again thanks to this camera.It's so easy to use, compact (thus easy to have always) and the pictures are AMAZINGLY clear in all kinds of lighting.THANK YOU SONY for making PHOTOGRAPHY FUN again!I'm now using this camera to take a ton of pictures for my students (HS and college) language projects (Go Flickr and movie making!) and podcasting.AWESEOME.THANK YOUGRACIASMERCI!", "Date": "February 5, 2007"}, {"Title": "A bit large - Good 8x7 pic quality", "Author": "Justin \"An IT Executive in the Chicago area\"", "ReviewID": "R29OU47RZ7UXI1", "Overall": "4.0", "Content": "I have owned this camera for over a year.  There are most likely models out with more pixels.  I like this camera.  It is easy to use and the optical zoom ensures that I keep my resolution.  If you take the memory card to your local drugstore (or other picture printing store) you should be pleased with the quality of the pictures.  To my untrained eye I can not tell the difference between digital and 35mm.", "Date": "January 4, 2007"}, {"Title": "be very careful..", "Author": "Tracey Brewer", "ReviewID": "R2KQ2EN899DCWI", "Overall": "3.0", "Content": "the slightest bump causes the lens to malfunction. the camera isnt that easy to use. Mine is in a box ready to ship back for the second time to fix the lens. an expensive camera with too sensitive lens. i think a simpler camera may work as well. it does take good pics once you get it figured out though.", "Date": "July 14, 2007"}, {"Title": "Great", "Author": "Simone", "ReviewID": "R3HJNFN308PYT5", "Overall": "5.0", "Content": "Fast, no batteries to recharge, large visor, compact size, burst mode, many sceneries options and the best resolution. There's no better camera for this price.", "Date": "September 3, 2005"}, {"Title": "Buyer beware - Lens failed and jammed after 31 pictures", "Author": "PP45 \"PoolParty45\"", "ReviewID": "R2HDQQ5OKBZV8N", "Overall": "1.0", "Content": "I bought this camera last month and I took it out on a field trip and the lens jammed after taking just 31 pictures.  I called Sony and they said that it was a common problem.  The camera all had an \"access error\" displayed on the LCD while it tried to retract the lens.  It would repeat over and over and the only course of action was to remove the battery.  Rather than deal with another lemon, I asked for a refund from the store I bought it from and traded up to a Canon S70.  I should get that camera next week.  This camera has been recalled in China.  The camera store I bought it from (Digitalfotoclub.com) seemed to know exactly what the issue was as soon as I mentioned the model number.  They indicated that 85% of their stock was returned and they have stopped selling this and other Sony models.", "Date": "March 13, 2006"}, {"Title": "I love this camera", "Author": "T. V. Dinh \"tvd\"", "ReviewID": "R38V2B6IJ912UT", "Overall": "5.0", "Content": "I just want to say that i really love this camera not only the price of it and all the features plus the image quality and the easy to use without reading the manual because i come with the flash video tutorial to watch on the computer. Beside, i'm totally agree with the first two reviews.", "Date": "February 28, 2005"}, {"Title": "warranty and support terrible", "Author": "C. R. Bates", "ReviewID": "RFZZHTTHQJ1I2", "Overall": "1.0", "Content": "I bought this sony to take picture for my insurance company of destruction caused to my home by Katrina.  After using the camera at my parents home before going to the disaster area the lens kept going in and out and wouldn't take pictures.  I had not even had the camera for 2 weeks and would not even be able to use it for what I needed it for.  Sony gave me an address to send it to since I had only had it for 2 weeks and was still under warranty.  The camera repair place said it had corrosive damage. NO WAY!  Camera went from Target to my parents home.  They want $386 to fix it.  More than I paid for the camera. I have since learned that many people have problems with the shutter lens!", "Date": "January 3, 2006"}, {"Title": "Outstanding other than the battery", "Author": "Scott D. Smith \"Scott D. Smith\"", "ReviewID": "R3M09GRDRCF05S", "Overall": "5.0", "Content": "I love this camera and I've never been a guy who takes a lot of pictures but this one just seduces you as its just so easy to carry and allows you to take high resolution/pixel photos then crop and zoom them on your PC to get it just right.Outstanding.", "Date": "September 21, 2005"}, {"Title": "50% Handy, 50% Junk", "Author": "Monkey Do Do", "ReviewID": "R3J1DT3A1JU2OI", "Overall": "2.0", "Content": "I bought this camera to take photos of my paintings to print off. I had read reviews about the camera being blurry at times, but I never thought it'd be a problem since I don't have very shaky hands. Yet even standing still, I had problems with getting crisp pictures with accurate colors. I skimmed through several of the different settings, but the camera still produced inconsistent results. Some of the photos looked great while others I immediately deleted. In the end, I went back to my old reliable digital camera.The camera does have some fantastic features, though. It has wonderful battery-life and charges up quickly. The movie features are pretty nice too for a digital camera. The mpegs are not DVD quality, but they are fun to pass around the internet. It also is small, but has a huge LCD screen for its size. It would be the perfect camera if it didn't have such a big problem with blurred pictures.", "Date": "August 5, 2006"}, {"Title": "Great Buy", "Author": "S. Woodward \"tech savy!!!\"", "ReviewID": "R1A67N3XOVT8HI", "Overall": "5.0", "Content": "I have had this camera for about 9 months. This is a great camera. I went to Hawaii, the pictures are breathtaking. I usually take pictures in 3MP mode and they turn out crystal clear and very detailed.", "Date": "May 28, 2006"}, {"Title": "Sony Cyber shot DSCP200 7.2 Digital 3x OpticalZoom", "Author": "Sadie Miller", "ReviewID": "RHNDGZ64SUNDR", "Overall": "5.0", "Content": "Mt daughter had given me one for Christmas in 2009. I lost it and someone found it> but someone had ran over it with there car. So I had to fine another one.", "Date": "March 29, 2013"}, {"Title": "LOVIN it. Trust in Sony.", "Author": "T. Narayanan", "ReviewID": "R25TQPBE07CW85", "Overall": "5.0", "Content": "If you are going to put money into something expensive, then consider Sony first then Samsung. These are some of the best companies in the electronics market. You can't go wrong with them. I own Samsung LCD TV and Sony Cybershot digital camera. Knock on Wood - they have been running without a single problem out of the box. TV since 2007 and digital Camera since last year. All this while they are being abused by my 6 and 1 year old sons.Specifically, this perticular model of digital camera is the best when it comes to picture quality. Pictures don't look bleached or glazed that the pictures look clean, crisp and natural. This is a replacement for my original cybershot dscp200 which I bought back in 2005 that my wife lost.I am loving it. This item came as described - very clean as new and tiny scratch mark on the display. I would buy from this seller again.", "Date": "January 28, 2013"}, {"Title": "Classic", "Author": "E. Brown \"E. Brown\"", "ReviewID": "R170N9WL5QKIQL", "Overall": "5.0", "Content": "Great point and shoot camera.  People that have them love them.  Have had mine for several years.Little bulky by today's standards, but this camera takes great pictures and is very easy to use.  Nothing else to say.", "Date": "November 6, 2012"}, {"Title": "Nice Little Camera.=  Just what I wanted. Thanks Amazon", "Author": "dryduck", "ReviewID": "R1WTEEAIKV1YZR", "Overall": "4.0", "Content": "It is light, easy to use, and has an understadable system of menus.  The Amazon vendor supplied extra memory and I run out of battery now before I run out of memory.  Nice.", "Date": "September 25, 2012"}, {"Title": "Many years on and still working great!", "Author": "Todd Bartholomew", "ReviewID": "ROBN1PCVQ5ZLO", "Overall": "5.0", "Content": "We'd purchased this camera many years ago as an upgrade from my first digital camera and it has never let me down.  I'm sure there's better cameras available that have more advanced features and lets face it, most people are using their smart phones as camera's anyhow.  But if you need a super reliable digital camera at a reasonable price you'd be hard pressed to find something better.  The video feature works VERY well and overall the camera is very intuitive and user friendly...literally point and click if you want or delve deeper into some of the great features it has.  This is as long-lived as any 35 mm camera I've ever had!", "Date": "June 13, 2012"}, {"Title": "Awesome Even Now", "Author": "Daniel", "ReviewID": "R18FH6I6QES6K0", "Overall": "5.0", "Content": "There are definitely better cameras that have come out in the past few years, but this camera is still amazing. According to the official work, this camera supports up to 4gb. With the help of a few adapters, I was able to get my 16gb microSD card recognized just fine.16gb microSD > microSD to MS Pro Duo > MS Pro Duo to MS Pro.http://www.amazon.com/gp/product/B00176F2RC/ref=oh_details_o00_s00_i00http://www.amazon.com/gp/product/B001LGDWE8/ref=oh_details_o01_s00_i00Awesome camera, great quality, and now more storage space than the battery can handle recording video!", "Date": "June 13, 2012"}, {"Title": "Lasted me *eight* years and counting.", "Author": "Ines G.", "ReviewID": "RCB40U558KLF4", "Overall": "5.0", "Content": "This camera is incredibly easy to take for granted because it does everything right. I've put off this review for a very long time because of that but I think it deserves it, so here goes: This camera and I have been virtually inseparable ever since I got it as a gift in 2004. During these eight years (and counting), I've seen people around me cycle through their digital cameras every two years or so. When I got it, 7.2 megapixels was quite a lot. Eventually, that was no longer a big deal and people around me began to pop up with cameras with more megapixels. Still, I have yet to find a camera that takes pictures of comparable quality to mine. I also have the experience, on the sad day that I don't have my camera on me and have to use someone else's digital camera, that I feel like I'm struggling to get a good picture with their camera--it's a frequent experience with digital cameras to get images that are too grainy, too dark, too yellow. But, with this one, the colors are transmitted perfectly, the focus is a cinch, and I find 7.2 megapixels to be more than sufficient (an embarrassment of riches for me). The menu is intuitive and easy to use too, so that if you're in a dark setting you know exactly what to do; I've taken many professional-looking photos on the night setting. All of this aside, most importantly: I can vouch for the reliability and sturdiness of the design: I've had this camera for *EIGHT* years now and it's still working great. It's been dropped, mishandled, groped with greasy hands (I keep a food blog), kept out in the dust without its case but it's like the first time every time. That's the main thing that motivated me to write this review--I don't know anyone whose digital camera has lasted that long. Usually, my friends will replace theirs approximately every two to three years max. My family cycles through them nearly every year; the first Canon they got broke in a year's time. They've had a Panasonic for a few months now but the images come out with a suboptimal color balance, not very true-to-life. Meanwhile, I have not experienced a *single* problem or malfunction of any sort with my camera. I'll update this review when my baby finally goes out of order but I somehow can't imagine that ever happening.", "Date": "February 21, 2012"}, {"Title": "worth every penny", "Author": "Al-ghanimi", "ReviewID": "R3F1BHRMCYUOZW", "Overall": "4.0", "Content": "It is one of the best thing that I've ever bought. The clarity of pictures and the simplicity of using are worth every penny I paided to buy this camera. The long lasting battery is also one of the best features of this camera. The flashing light makes the pictures as bright as nature.The only thing that I did not like is the size; it doesn't fit in most types of pockets. I strongly recommand this amazing camera.", "Date": "February 15, 2012"}, {"Title": "6 years old and still works great.", "Author": "Tydence Davis", "ReviewID": "RYQMDUCYWHH2R", "Overall": "5.0", "Content": "And the stainless steel exterior is ideal for time travel.It has good glass and a good sensor.  But most importantly, it lets you easily control iso, shutter, and exposure time.  It allows you to take shots that other cameras can't.  (It does great starry night shots!)[...]Mine has been overseas 3 times now, on long motorcycle trips, on more hikes than it should.  It still works great.  When it goes, Ill be picking up another one.", "Date": "February 3, 2012"}, {"Title": "Best Little Camera in my Arsenal", "Author": "RNGypsy03", "ReviewID": "R3EGX4C8QU9K09", "Overall": "5.0", "Content": "This camera is amazing!  My husband and I own many cameras.  We have 2 big Canon Dslrs, a Canon point-and-shoot, and a Canon G-11.  I also have a full frame Nikon DSLR, and a Sony Alpha DSLR.....but this review is about the Sony DSC-200 Cybereshot 7.2 mp.  First, with the Carl Zeiss glass in this camera the optics are amazing in such a tiny little camera.  The color saturation set on normal just blows me away.  I have taken some of my truly truly favorite shots of all time with this camera.But the true test is this camera's durability.  It has hiked the Appalachian Trail...riding along in a zip-lock bag....that's a 2,000 mile trail...6 months of steady camping in all weather conditions.  it's been to the Outer Banks, where it had sand all in the pop-out lens mechanism...all over Europe and Central America...It's been dropped a thousand times....and it survived my teen-agers purse!  That last one was the worst!  It is dented, scratched, and the body gaps a teeny bit at the top....but it STILL KEEPS MAKING GREAT PICTURES...I thought maybe I should replace it for a less worn copy.  So, I went online and read about it.  the reviews for this particular model were tremendous.  I tried to find one on eBay, but they were selling for more than the original price...apparently the secret was out.  So I looked for a newer model.  But the reviews on these were milk-warm.  and then I thought...so what if it's dented, and scratched?!...We won those war wounds together on some of the most amazing trips.  I'm gonna send it in to Sony,  just for a once-over, not because it needs it, but because it deserves it.  The movie resolution is incredible, you will not be disappointed.All I can say is, if you can find one, buy it!  Don't be a victim of the megapixel wars, unless you're making posters..it just won't matter.  I have had absolutely no problems with blur, and all I can say to those people is that it's either technique, or you got a lemon....but the vast majority of us have gotten golden apples with this camera as evidenced by its stellar reviews and the price INCREASE of this camera as they become in short supply.For you dog lovers, here is an analogy:  I have a Golden Retriever, and a Shitzhu.  the Golden is 80 pounds of muscle and super sweet.  As a puppy, the Shitzhu was raised by the Golden, so no one has ever told him that he was just  little dog.  He has no little dog bad habits, like barking, or being over stimulated.  In fact, he retrieves, and swims in the ocean just like the big dogs...The point is, my DSLRs are terrific and they take great pictures, but nobody told my little Sony that it can't take great pictures like the big cameras....so it just takes great pictures!  I can put my Shitzhu in my basket on my beach cruiser bicycle, and I can put my Sony in my hip pocket.  I cant do that with my Golden Retriever, or my DSLR.", "Date": "December 15, 2011"}, {"Title": "Lens Problems", "Author": "C. Williams", "ReviewID": "R3TH7R27DO9KUG", "Overall": "3.0", "Content": "My second DSC-P200 just quit working, and it was the same as my first one.....the lens is stuck and won't emerge from the housing. The power switch works and the unit tries to push the lens out, but something is stopping it. I did get a few years out of the first one, and almost 4 out of the second, so I'm not bashing Sony too much. Other than that, it is a great camera.", "Date": "July 4, 2011"}, {"Title": "Another excellent product", "Author": "Georgi Angelov Todorov \"Georgi Todorov\"", "ReviewID": "R1WTQFFDSC1SQ6", "Overall": "5.0", "Content": "This was my first photo camera from Sony (no any other trade marks owned), Sony R1 is my second, but anyway, this P200 is excellent product, just slight dust-bunny problem (it's the whole P series). But so far over 25000 photos and still looks like new. Nice video (VGA) and excellent pictures quality. Even compared to the cameras today they can't compare to P200. So much fun with P200, glad I am owner of one!", "Date": "April 7, 2011"}, {"Title": "Sony Cybershot DSCP200/R 7.2MP Digital Camera 3x Optical Zoom (Red)", "Author": "icehawkyfan \"icehawkyfan\"", "ReviewID": "R23C580HAGKJLO", "Overall": "5.0", "Content": "This is the second time I've bought this camera.(First one was great, but after 4 years, I wasstupid and let water get into it...long story.)I searched for the same camera and found this one.Different color, but everything else is the same.I would buy a third, if ever need be, in thefuture.  It is easy to use and takes greatphotos.  I'm sure it is just as good as anyother cybershot on the market now.  Carryingcase is good for protection....in case youaccidentally drop it. ; )A+", "Date": "July 10, 2010"}, {"Title": "Please, Please", "Author": "Jayar \"Jayar\"", "ReviewID": "RXJLWIB1YUGM7", "Overall": "1.0", "Content": "I've purchased Sony products, radios, TV's, stereos for over 30 years and was amazed at howbad this camera was, after about 1 year of protected use(in a case, never left out, etc.).I began getting smudge spots on all my photos which I thought were caused by dust on the outside of the lens. I, and others like me were wrong, the dust is internal because there are no seals around the lens housing.Their design is so bad, the dust particles INSIDE the camera have taken over about 50% of the image area. The exact area floats about from day to day. I tried having it repaired by Sony and they said it would cost, with shipping charges almost $150.00 (18 months ago). The problem is they didn't recognize the FACT that the camera was designed and built without any seals, therefore what they were charging me for, was cleaning the inside which they would guarantee for 90 days. Meaning the problem would certainly return, since it would still lack lens seals.I've checked with camera dealers who were not aware of this problem with other major camera brands.In my opinion, Sony should have offered owners of the DSC-P200 a free upgrade or recognized the flaw in an otherwise good camera, and have it corrected at no charge.Obviously I won't buy another Sony camera, but unless you find out they fixed this specific problem, or you don't mind the dust balls in your photos, you should look to one of the other major brands. My final attempt for correcting the problem on my own will be disassembling the camera on my own based on the instructions below:[...]If I fail in solving what Sony should have done, my next 300.00+ will go to another camera company.Do yourself a favor by reading more on this problem B4 making your decision.", "Date": "July 10, 2010"}, {"Title": "Perfect for my video recording needs", "Author": "Yusuf W", "ReviewID": "R3HAZZZO6YMQDO", "Overall": "5.0", "Content": "My siblings got me this camera used 2 years ago and I've loved it ever since. I'm into take video clips of sporting events and have found the video good enough for the recordings. I record at 640 X 480, which is enough to post my videos online. Unfortunately, the camera got wet now I have to find a replacement.", "Date": "June 7, 2010"}, {"Title": "wow!", "Author": "P. LIMA \"pedro casado\"", "ReviewID": "R2G402GG85UTEI", "Overall": "5.0", "Content": "the camera is awesome. i also had a sony p100 so there is not much difference from p200.", "Date": "February 22, 2010"}, {"Title": "Sony Cybershot", "Author": "Nan G. \"Nan\"", "ReviewID": "RBD0GKJUEF6SX", "Overall": "5.0", "Content": "The seller was very easy to deal with.  We had a Sony Cybershot which took great pics and it wouldn't work anymore. We paid almost $300. for it.  Got this used one for $130 and it's just like the one we had. Have been taking great pics since we got it.  Thanks, Nancy", "Date": "October 22, 2009"}, {"Title": "Fantastic point and shoot camera", "Author": "Prashanth B. Kulkarni \"Prashanth\"", "ReviewID": "R1L46YD7KNCRQV", "Overall": "4.0", "Content": "After using the camera for more than 3 years and shooting more than 4000 photos, I must say I'm extremely satisfied that I purchased it. It is a different matter that I paid much more than what it sells for now.It is quick (very short start-up time) and takes great photos. Battery life is excellent. The night modes can use some improvement - deducting one star for it. Other than that, I think it takes very sharp pictures - be it outdoors or indoors. One thing to keep in mind - you need to hold the camera very steady to avoid the blur. Trick is to hold the camera steady for an extra second after clicking - most people move it as soon as they click it. I don't have a tripod but have been able to take some extremely good pictures - so say my friends :p", "Date": "June 2, 2009"}, {"Title": "Flash Timing Problems", "Author": "Sofia", "ReviewID": "R355HVT3Y48J9W", "Overall": "3.0", "Content": "I've had this camera since December 2005 as a christmas present. I have used it when I go traveling, partying, and hiking. I have used and abused this camera since I got it and it still works.What I like about this camera is it is handy. It can take video clips. It takes amazing rich color photos and performs well on low light conditions. I think carl zeiss lens has something to do with this. I rarely run out of battery juice. Battery charging time is only an hour or two. I went caving and I got this camera wet. My fellow caver and I were surprised it survived.  Turning the camera on/off is fast that it is unlikely you'll miss a shot. The shutter speed is decent that the timing of taking moving subjects is not hard to get.What I don't like about this camera is the timing of the flash. The flash goes off before the shot. As a result, the picture is taken like as if there was no flash. (No, it was not on a flash delay mode). It takes really great pictures but because of this problem 1 out of 5 attempts comes out right when the flash is needed. It is embarassing to those subjects posing for you. You will lose great shots this way. Like other comments here, the lens curtain doesn't fully shut. But it shuts completely when you play with it. It's been like that even before the caving incindent but I didn't mind it so much because it take great photos. Another thing I don't like about this camera is the discontinued adapters. There are lenses you can attach to this camera like filters and polarized lenses; but it requires an adapter. Since sony stopped making the adapters, this lenses becomes useless.", "Date": "April 13, 2009"}, {"Title": "Best Point in Shoot not made anymore..", "Author": "A. O. \"SPK\"", "ReviewID": "RQ7JHVJC5Z1BX", "Overall": "5.0", "Content": "When I bought my first Camera I made sure to do my homework. I got the Sony P100. When it got stolen I replaced it with the P150 and eventually P200. I have used many other cameras though, since I do photography as a side job, and NONE compare to these 3 cameras. To begin with picture clarity is perfect in any mode. It also has many more available functions than the \"more modern\" cameras. Unless Sony starts making these again, I doubt I will buy their products anymore. The newer ones offer less functions and the picture quality doesn't even compare.I'm currently on the market for another one of these. I just decide if I prefer the P150 or P200.", "Date": "March 17, 2009"}, {"Title": "Give it time and it will malfunction on you..great while it lasts", "Author": "Levi Welmack", "ReviewID": "R31Z1HL8TG3JU", "Overall": "1.0", "Content": "Great camera...at first, I had it for years then all the sudden, the lens woudn't open and it says \"Turn the power off and on again\".  So I sent it in to sony (still under warranty) and they fixed it and sent it back.  A year and half later the same exact thing happened.  Now here I am, out of warranty and without a working camera.  I did have this camera for about 5 years though.  If you bought this camera and can still take it back, I would definitely do that.", "Date": "December 31, 2008"}, {"Title": "It's so great...I bought two!", "Author": "N. Wimmert \"Nix\"", "ReviewID": "RL6V21R6U3NE1", "Overall": "5.0", "Content": "I originally purchased the Sony Cybershot camera in a periwinkle color they had out. I loved my camera so much I took it everywhere with me. It is a great point and shoot camera that takes amazingly crisp pictures. It has a setting for every scenario and you can size your pictures to fit your media needs. It has an option so that pictures are in email form and small enough to zip through the internet. If you'd rather a higher quality picture you can use the 7.2 megapixel capacity and have a crisp, clean shot.This camera was so popular amongst my friends that someone ended up stealing mine. Since I loved it so much I couldn't go without one and ending up buying another in the red. I have had no problems with this camera and absolutely love it.  It is also great to set up on a tripod and take family photos. I have had better luck with the zoom and quality of these photos than many of the professional photos I've had taken.  I would definitely recommend this camera to anyone.", "Date": "December 26, 2008"}, {"Title": "Very sturdy and reliable", "Author": "Amardeep Dabass", "ReviewID": "R2WZ9LXG8ZQ0LC", "Overall": "4.0", "Content": "I have had this camera for about 2.5 years and just replaced it with a newer model. But I have to say that I was delighted in having this camera with me and the results have been fantastic. Some of the plus points -1. Battery Life. I can charge the camera, go over a weekend trip and click 500 photographs with about 20 videos of 30 seconds each and still have battery left.2. Flash - It has a very strong flash. You will not need any external lighting.3. Sturdiness and Reliability - I went to sea world and was capturing a video, when all of a sudden a stream of water came and hit the camera. It got all wet, i tried to dry it but lens also got hold of some water. I tried to capture some sea world pics, but they were blurry and I thought that now I will have to buy a new piece. Came back home. The next day, tried it again and it was back to normal! Not a hint that it was sprayed with water. The picture quality was good as ever.4. The variety of manual features and the settings you can do with this camera are outrageous. I found out about them pretty late, but was pleasently surprised with the results. The night shots with long exposures were just tremendous.5. LCD screen is just gorgeous.Cons -1. It does not have a very good macro mode.2. Not for unstable hands. Its not hard to get a blurry image.I have fallen in love with Sony over quality. I am trying out a Canon SD 770 powershot now and will see how it fares in comparison with this old camera.", "Date": "December 9, 2008"}, {"Title": "Great Camera", "Author": "H. Deaton", "ReviewID": "R14NPHRI2QKSWC", "Overall": "5.0", "Content": "I have used this camera for 2 years now and I could not be happier. It takes great pictures! I have the added many accessories and this is a great little camera. It is compact and easy to use.", "Date": "April 27, 2008"}, {"Title": "Absolutely Love this camera!!", "Author": "Alena K. \"Alena\"", "ReviewID": "R2V9LMR7VMQL2F", "Overall": "5.0", "Content": "I've been using this camera for over a year now and I absolutely love it. It takes great crisp pictures in deep colors colors, the battery lasts forever, lots of setting for every occasion ( I took some excellent pictures at dusk and in low light conditions). You need to get used to it in the beginning and figure out the settings and modes, but once you do - it's awesome!", "Date": "February 24, 2008"}, {"Title": "Nice camera for those on the go", "Author": "A. Honig \"RPG\"", "ReviewID": "R12PWKLQ4YO8VT", "Overall": "4.0", "Content": "I needed a digital camera besides the ones that I already have.  I needed something that i could bring anywhere outside of my professional cams.  What is great for me is that I don't need to carry around a bulky camera and can get basic shots done with no issues.The cord that comes with the product is all tied together so there are only two cords needed.  The conection cord is the first and the second is the power cord.  The camera does not run on normal batteries so if it runs out in the field you need either a second battery or to plug it in, assuming that you bring around the power cord with you.At the very end of the day the battery lasts long enough, takes sharp shots, and can fit on a tripod with no problem.  The only bad part is that it only take sony disks and does not want you using any other format so you have to buy to buy a larger card than the one it comes with or you will run out of space very fast, unless you change the size that is associated with it.Final verdict:  BUY, if and only if you want a cam that is as good as the professional one you have digital quality wise but want the ease to carry it anywhere.", "Date": "June 6, 2006"}, {"Title": "Fantastic", "Author": "R. Mercorelli \"Merc\"", "ReviewID": "R1379PYPMSSYY9", "Overall": "5.0", "Content": "I received my Sony Cybershot 7.2MP camera last week and have been taking pictures every day since.  The quality of the pictures is excellent.  The battery life is excellent (its been five days, 100+ pictures (most with flash), and a dozen less-than-a-minute movie files and I still haven't had to recharge it). I've taken a number of movies and, for a camera, they are great also.  Another great feature is that it takes pictures in relatively rapid succession, even with the flash on.It is small, easy to use, and, overall, just a great camera.  It is very convenient - it fits right into my pocket.I purchased a 512MG memory stick, which I would recommend.The grandparents are going to be very happy!", "Date": "March 13, 2005"}, {"Title": "Switched from Kodack to Sony!", "Author": "Michael A. Levick", "ReviewID": "R11JVGHD21ENHG", "Overall": "5.0", "Content": "Wow!  Am I glad I made the switch from my big, bulky Kodack to my slick, steamlined, and very beautiful SONY!  Beautiful pictures, easy use, tons of features, or just point and click.  No red-eye, no white-out, no PROBLEMS!  I LOVE this camera, and for $399 for a 7.2 Mega-pixel you can't go wrong.  GO BUY IT NOW!", "Date": "February 24, 2005"}, {"Title": "Great camera, annoying AC power/battery charger", "Author": "jm \"jm685\"", "ReviewID": "R1BY1RVDEDJVZ7", "Overall": "3.0", "Content": "Nice small camera to travel with. Unfortunately, Sony includes a very large battery charger, so it defeats the purpose of a small camera when I travel with it.When comparing cameras, keep in mind that you may have to pay $50 for the separate travel charger.", "Date": "December 11, 2005"}, {"Title": "Ronak Shah's review strangely familiar!", "Author": "Gabby \"Gabby\"", "ReviewID": "R296HE8C58CBSJ", "Overall": "4.0", "Content": "My review for the DSC-P200 was posted on Amazon.co.uk about a month ago.Weird then to see it reproduced here by Mr Shah almost in its entirety!Mr Shah you are exposed!  However I like your review considering I wrote it!", "Date": "March 15, 2005"}, {"Title": "Great little camera.", "Author": "D. Harrington", "ReviewID": "RYL239NB3YAFS", "Overall": "5.0", "Content": "Great camera!  Very fasy delivery!  I'm very pleased with the whole process, even though the vacation I purchased the camera for was cancelled.", "Date": "August 15, 2005"}, {"Title": "Hope you like yellow pictures", "Author": "Duchess Sophia", "ReviewID": "R174AYM0KFFJQE", "Overall": "1.0", "Content": "I purchased this camera hoping that Sony electronics and Carl Zeiss lenses would make for a great camera. Unfortunately, this camera takes poorly colored pictures. I found out after I bought it, that Sony is having production problems with this camera and they have not worked them out. The Sony repair people acknowledge that the pictures that this camera takes have yellowish tones, but they claim that is \"normal\" for this camera and will not refund or replace the camera. Buy this camera only if you want to play around with lighting to get moderately decent pictures.", "Date": "January 7, 2006"}, {"Title": "Poor reliabilty", "Author": "Cesar R. Molina \"quasar9\"", "ReviewID": "R3GZUUFCDVMF7C", "Overall": "2.0", "Content": "This is my third Sony digital camera. These cameras have a short lifetime. The first 2 cameras did not last long. I have had this camera repaired for dark pictures while  using the flash. Presetly when using the optical zoom the view finder is unable to adjust and the image is  very blurry.  I do not use the digital zoom.", "Date": "January 2, 2006"}, {"Title": "Not so good for the money", "Author": "Christi Kirby \"Christi\"", "ReviewID": "R2O6IM2JE2P5VH", "Overall": "2.0", "Content": "I have been very pleased with my Sony Cybershot DSC-P72 and my husband surprised me with a new DSC-P200 today.  I spent all night erasing blurred photos.  Our children are ages 2 and 4 yrs, and accompanied by the household dog, are on the move.  Even in Sports Mode, the photos are blurry and trying to do burst photos managed to miss more than it got.  Perhaps it would be better outside in daylight to reduce shutter time but the lighting in the house was farily bright.  The burst mode on the P72 (though only two shots) is a good bit quicker than the P200, and unless you are going to be doing LARGE blowups, the quality of the photos of the two cameras when printed 4x6 aren't significantly different.  I was really really disappointed in the camera's blurriness!  Unless the person is slowly walking (and even then swinging hands and moving feet might be slightly blurry) you won't get a shot with this camera.  If you are looking to get a point-and-shoot camera for scenery or pictures of still people and objects, I think you can find something just as nice in a lower price range.  The manual features are nice and some of the bells and whistles are nice (I personally could care less how pretty it is if it does the job), but it isn't apparently designed for a photos of toddlers who NEVER seem to hold still.", "Date": "January 3, 2006"}, {"Title": "dust on the lens problem", "Author": "Z. Xu", "ReviewID": "RW0CSZFG0O324", "Overall": "1.0", "Content": "I have the same problem as another customer (Frank Jaccarino) about the dust on the lens. It ruins the picture I am taking.Imagine every picture you take with this camera would have a dark spot... I really hope Sony would have some special inexpensive service taking back this model and fix it.", "Date": "May 21, 2006"}, {"Title": "After over a year of research, I made the right decision.", "Author": "E. Martin", "ReviewID": "R1HCC5PANKMVU2", "Overall": "5.0", "Content": "I've had this camera for about a month now.  It has all the features I needed and a few I still haven't tried.  Some people mentioned problems they had, but I didn't have any.  I love that you can buy lenses to expand the features of the camera.  If you are unfamiliar with using a camera like this, you may want to see if your cable provider has free videos explaining the features.  We have i-control here and there are several videos that can help you get the most out of your camera.", "Date": "September 6, 2005"}, {"Title": "LOST AND FOUND !!!!", "Author": "K.H.L. \"kathylambert99\"", "ReviewID": "R2OYTIG8R82DOP", "Overall": "5.0", "Content": "I know you are reading this hoping to read a review. I am desperate to find my lost camera and I hoped this would help. I had a Sony cybershot dsc p200. It took great pictures but that is not why I'm writing this. I'm hoping that whoever found it will look at these reviews if trying to resell. In my opinion, this camera will be useless without a way to charge it or upload it to a computer, as buying accessories for a discontinued camera is not easy or cheap!( I know, I had to replace my usb wire last year after my dog chewed it and it cost almost $100 to replace). My memory card is what I really am hoping to recover as my pics are very precious to me. I had over 170 pics of my childrens' last day of school and my daughter's gymnastics recital and as a scrapbooker, losing pics is devasting! So if anyone has my camera please do the right thing and return it to the North Kingstown police. I live in RI and lost it on 6/24/07 at an airshow. Again, the camera is replacable but the photos on the memory card are priceless to me !!! There will be no questions asked! Thank you so much for reading this and if you are at all religious, say a prayer that my pics are recovered.", "Date": "June 27, 2007"}, {"Title": "Great Pictures when they are not blurry....", "Author": "Walter Ross", "ReviewID": "R28W6E7J6T0BAX", "Overall": "2.0", "Content": "I've owned this camera for a while now and am in the process of getting rid of it and getting a new camera. The biggest problem with this camera is its small size. This camera repeatedly takes blurry pictures due to primarily two reasons..Reason 1) When holding the camera it is very easy to get your finger in the way or partially blocking the flash causing it to not flash all the way or flash out of sync so the picture turns out blurry.Reason 2) Even for us young fella's with rock solid hands it's hard to hold this camera still enough to keep it from shaking ever so slightly and causing blurry pictures. Couple that with its small aperature size and you have to be extremely still to get a crystal clear picture.", "Date": "July 14, 2005"}, {"Title": "Watch Out for the Battery/Memory Card Door.", "Author": "Aimathena \"Aimathena <3\"", "ReviewID": "R2LAFKIQH6ZBGS", "Overall": "2.0", "Content": "I am still giving this camera 2 Stars because... I may have used the wrong settings when taking photo's.But... I ended up with \"a lot\" of blurred and fuzzy photo's. \"example... when we went bowling, almost every photo was blurred or had those acid trip looking streaks.\"My Biggest complaint is the battery door broke completely in half in less then 4 months of use.You might expect that out of a $30 Dollar Camera but \"NOT\" a $3 Hundred Dollar one.I paid $284.99 for the camera, $47.99 for the 1 GB SD Memory Card and $51.54 for the Docking Station and that didn't include S&H; or Taxes, they were extra $$$!My husband replaced this one for me with the Kodak EasyShare C743 and G600 printer dock and it's a 7.1 MP and it takes better quality pictures that I can print @ home for less then this one. ($249.95 W/FREE Shipping & Handling and 1 GB SD Memory Card included) from K O D A K online.", "Date": "December 18, 2006"}, {"Title": "during the rare times that it does get the shot it is great...", "Author": "neurowoman \"blank\"", "ReviewID": "R1L0C7TCGMEFM3", "Overall": "2.0", "Content": "but 50% of the time it is very blurry.  i bought this to go with my sony vaio (wonderful), but it has sent me running back to my old faithful- cannon- read all reviews and think seriously about whether or not you can take the chance of missing the shot (kids, wedding, vacations, et cetera).  every once it a while the shot is outstanding, but more times than not...i'm very dissappointed.", "Date": "May 28, 2006"}, {"Title": "What were you thinking, Sony? Blurs?", "Author": "Bob Summers", "ReviewID": "R3VPVKLWXKSB2", "Overall": "2.0", "Content": "I have a 150, which is the same camera with a smaller LCD. I love Sony, and usually the name stands for fantastic equipment. Not here.I have found the problem with low light situations to be that the flash will sync at 1/40 of a second. Compare that with the usual flash sync of most cameras at 1/60 of a second. That may not seem like such a differnce, but think about taking 1/40th of one pizza and 1/60th of another. The 60 is more stable and has more pieces remaining.I used my camera at an auto show. The 40 sync causes any motion to blur. I got decent car photos, but the people walking in the background were blurs. I took some other shots with friends goofing around at a restaurant. The slightest hand movements in the shot were blurred.Some reviewers will say you need to hold it with both hands and some other things. I have to reject this. This is a pocket sized camera. You get it to carry around and use for snapshots (for the most part). Most of the stuff you're going to shoot with this is going to be indoors with bad light. The camera doesn't work well in the situation most of us bought it for. You can manually adjust the camera to a shuter speed of 60 or better in those situations, but most users won't understand that.Look at a Canon or something, or wait until I hope Sony gets it right next time.", "Date": "March 26, 2005"}, {"Title": "Works great 7 years later!  (Lens Broke after 4 Months, Sony quickly replaced it and it's been a great camera for 7 years!)", "Author": "Christine \"Regular Girl\"", "ReviewID": "R1RO3U26OKJQ23", "Overall": "4.0", "Content": "My first camera was defective, the lens stuck and the photos were blurry.  I sent it in under warranty and it was repaired and sent back and I STILL use the camera all the time!  It's been a great camera for 6 plus years!Clear photos, good zoom, nice range of shooting ability (sports, macro, portraits), strong flash for a short range, stable shooting, good video quality (with a slight whir in the background).  I love this camera and use it far more often than my Canon Rebel (for portability and ease).", "Date": "February 8, 2006"}, {"Title": "sony sucks", "Author": "Jesse A. Chelstrom", "ReviewID": "R3BRXQPOV8KX4V", "Overall": "1.0", "Content": "sony camera's are the worst to repair. they charge you $[...] for a flash.  That is almost the same price as a new one. Buy the other brands.  they have local shops that will fix warrenty problems SONY does NOT have this. you have to send it to Texas. I don't even live in a state that touchs Texas.  Please Buy a different brand of camrea you will be much happier. the parts and acc. are more as well.", "Date": "April 21, 2006"}, {"Title": "Same Problem with the flash...", "Author": "Manuel Arteche", "ReviewID": "R3PV0L8HBDX5D", "Overall": "4.0", "Content": "I have the same problem with the flash some pictures are great but other are dark, is that problem for everybody ? or just some cameras like mine with a malfunction ?How can i solve this problem?? Buying the Slave Flash??", "Date": "June 22, 2005"}, {"Title": "spots + blur", "Author": "Ryu Greg", "ReviewID": "RAA2YC2NNDZPS", "Overall": "1.0", "Content": "This camera has just been banned from the Chinese market because it was found to be defective. Sony even bribed Chinese journalists to hush the issue.I've had mine for nearly a year now. I've had to get it fixed twice for dark spots. This is because dirt/dust gets into the camera and onto the CCD. In short, this camera is not airtight. You need to keep it in a sealed pouch at all times. Once the camera came back from being service, it was not even properly cleaned (check comments here for someone to who the same thing happened). So they changed the whole optical unit.Now the camera gives blurry pictures when using the zoom. This is systematic, even if the camera is on a tripod, even if the object photographed is very far and you manually set the focus on infinity.This camera is a piece of junk. Don't buy it, and seeing the long list of cameras that were banned along with it, don't buy Sony.", "Date": "December 21, 2005"}, {"Title": "Weak point", "Author": "D. L. Sweeney", "ReviewID": "R2MG3HG7J2WUJO", "Overall": "3.0", "Content": "I liked the little camera,but the batttery compartment door jamed and broke off the first time I opened it.I'm looking for something moree robust.Sears refunded without a hassel.", "Date": "April 29, 2005"}, {"Title": "4 1/2 stars", "Author": "SecretReviewer", "ReviewID": "RPEFA851E8D7V", "Overall": "4.0", "Content": "i hav a camera like this and its about4-5 years old. works really well but the flash doesn't work well anymore. but that's not bad for 5 years of constant use.", "Date": "December 11, 2005"}], "ProductInfo": {"Price": "Unavailable", "Features": "7.2 MP CCD captures enough detail for photo-quality prints up to 15 x 20 inches\n3x optical and 2x digital zoom for 6x total zoom\nCarl Zeiss optics; 16-shot burst mode; high-resolution movie mode with sound\nCompatible with Memory Stick and Memory Stick Pro media; includes 32 MB card\nPowered by Lithium-ion battery (NP-FR1); connects to PCs and Macs via USB 2.0", "Name": "Sony Cybershot DSCP200 7.2MP Digital Camera 3x Optical Zoom", "ImgURL": "http://ecx.images-amazon.com/images/I/41EMXKYAG2L._SX300_.jpg", "ProductID": "B0007CZ70Y"}}