{"Reviews": [{"Title": "Not bad, but you could do better", "Author": "A Customer \"customer12345657\"", "ReviewID": "R1E0H84HB1X3DP", "Overall": "3.0", "Content": "Detailed reviews often sound negative, so I will start with the simple good stuff.If you are thinking \"I just want a camera that works, is this one OK?\" the answer is yes, it's OK.  It takes generally decent pictures with good colors, has been reliable for me (no random glitches or picture loss), and is no trouble to connect to a PC.  If that's all you wanted to know, go ahead and buy it.  If you have only used cheap film cameras before, most of the c530's drawbacks won't surprise you.  The c530 is a decent camera and will make a lot of people happy.  It's an improvement over Kodak's previous low-end models with smaller size, faster operation, and larger resolution pictures.But the price of this model creeps very closely to better cameras, some of them only $10 higher, while still maintaining some of the characteristics of cheaper cameras.  So here are the things you might not like if you ever compare it to a better camera...Fixed focus:Like a $10 film camera you used to use, this camera does not have adjustable focus.  The lens is arranged so, through most of it's range, it takes OK pictures.  The pictures are not \"bad\" but never quite perfect either.  For old film cameras, this was often an advantage for people wanting a simple, fast camera.  But the disadvantage is you can't be sure to get a well-focused picture at any specific distance, and you can't get a good picture at all of anything less than 3-4 feet away (you won't be able to get a good full close-up of a face).  Digital cameras with automatic focus are available for only a small price increase, and often can focus and take a picture as fast as the c530.  For a few bucks more, you could have nearly perfect focus on most pictures, and the camera does all the worrying.No \"optical\" zoom:\"Optical zoom\" means the optics (lenses) do the zooming, like a telescope.  \"Digital zoom\" means the camera \"fakes it\" by ignoring the outer portion of the image it would normally take and stretches the middle pixels.  So if you use digital zoom, you aren't really getting a 5 Megapixel picture.  You are taking only, say, 2 megapixels (depending on the zoom level used) from the middle and muddling them to stretch them to 5 megapixels.  A camera with optical zoom instead would have the same clarity at full zoom as it would for close-ups.  If your old film camera had no zoom at all, you might not care, but if you get a camera with real zoom capability you will never want to go back.Shutter response:For any digital camera, there is a slight delay from when you press the shutter button to when the picture is taken, and if your camera is slow you risk missing those brief moments that would be fun to photograph.  This is not convenient, but is unavoidable in affordable digital cameras.  This camera is about average speed for it's price range, but does not have to take time to focus.  In the same time it takes this camera to take a picture, other cameras are able to adjust the focus automatically first and then take a picture just by mashing the shutter button.  Better cameras also let you \"pre-focus\" by pressing the shutter halfway, then waiting for just the right time to click it.  If your dog starts to sniffle, you aim and press the shutter halfway, then wait to click it right when the dog sneezes.  No such option here, because focusing isn't the delay, the delay is just slow operation.Small lens:The plastic window covering it is large, but the actual lens is smaller than a pencil lead.  Smaller lenses capture less light, which means slower shutter speeds are necessary to get a good exposure, which means more motion blur.  It also means pictures in dark areas won't come out quite as good.  Technically there is more to it than lens size, and it's not as bad as I make it sound, but better cameras definitely perform better.Harsh picture compression:Most digital cameras will compress the image they take to reduce the file size and fit more pictures on a memory card, although it also reduces the quality of the picture.  The picture is analyzed by the camera's software and all kinds of fancy math is done so the picture can be encoded into a smaller size file that still displays as many pixels.  Compression of images generally works very well.  A picture can often be reduced to 20% or less of its uncompressed size and you don't even notice.  But the c530's best picture quality compresses your pictures to less than half the file size that most cameras do.  This might actually be balanced with the lens and focus quality and not stand out, but all of these things combined make the 5-megapixel c530 not quite as good as other cameras with the same number of pixels.No lens cover:Most cameras have some kind of cover that slides over the lens when the camera is off to protect it from scratches or dust.  Sometimes it's a fancy automatic mechanism, other times it's just a piece you push manually.  This camera has a fixed window in front of the lens, so it isn't directly exposed, but you don't want that scratched either.No sound for videos:If you are moving up from a cheap film camera, this part you might REALLY not care about.  But nearly all digital cameras have this feature.  Some, like this one, don't record sound, which can be disappointing later.  It's much more fun to record videos of silly things if you can hear the crash or the subject saying \"OK, watch this!\"Should you buy it then?You might still want the c530.  It's smaller than some other cameras, and depending on how you will use it maybe it's fine.  I keep the c530 in my car in case I need it and my other cameras are not handy, so even after all of the drawbacks I listed I still find it to be useful.  But recently a lot of newer cameras are looking like a better deal.  This review of the c530 is very similar to my opinion of the c300 (a larger, older, cheaper model Kodak), except the price of this camera along with newer competitors that are now available make the c530 not necessarily a great deal for the price.Right now I think the best alternative is the Canon a430.  I had this camera in mind when writing this review.  As I write this, it's only $10 more.  It has 4 Megapixels instead of 5 like the c530, but the a430 has optical zoom so you get the same detail when zoomed in as you do for close-ups and everything in between.  Its auto focus can take clearer pictures at any distance.  You can select better picture quality (less compression).  All of that adds up to the a430's 4-megapixel pictures looking better than the c530's 5 megapixels.  If I could trade in a c530 today and pay only $10 to get the Canon a430, I would do it gladly.", "Date": "July 4, 2006"}, {"Title": "great for everyday use", "Author": "C. Chigama", "ReviewID": "RHXPVRATCUNCK", "Overall": "5.0", "Content": "I purchased this camera a few months ago because I like to have a camera on hand always. My DSLR and 35 mm SLR cameras are too bulky for everyday. The price and MPs were right, as well as the small size which fits into the clean pockets of any of my purses- no need to worry about lens scratch. For those who don't carry a purse and are concerned about the lens, a very small case will do the trick. The images are clean although I've only printed up to 8.5 X 11 so far. Additionally, some point and shoot digital cameras have a terrible lag time between when you push the button and when the camera takes the picture. Many spontaneous moments are lost this way. That does not happen with this camera because of the lack of an optical zoom. This was a trade off I was willing to make especially when I see interesting things in nature or people on the street. The ability to capture the spontaneous is a great perk with this camera.Price is low enough to not worry if it gets a bit beat up.May 2008- still using camera, still very happy with it.", "Date": "November 13, 2006"}, {"Title": "Smallest camera in the price range  and good photos are posssible.", "Author": "rmay", "ReviewID": "R3KOXZPOOKN2SM", "Overall": "4.0", "Content": "I have had the camera for about 6 months and do not regret it a bit. That does not mean it is a perfect camera.  First of all here are the list of requirements I had when I was shopping for it.  #1) small  size #2) AA batteries #3) SD Card memory #4) 4MP or better  #5) $100-130 range #6) good battery life #7) no optical zoom #8) convenient and easy to use.  This camera hit on all cylinders and still does.  I know someone is going to say why no optical zoom???  Great question.  Start up time and shutter lag is much more pronounced with optical zoom. Also, the more reviews I read on cameras that were already above my price range the common phrase went something like \"I XXXXXX and the lens won't work anymore XXXXX camera is dead\" It seemed to be the fragile and weak point of the less expensive cameras. Optical zooms also increased my price range and battery drain.  When backpacking I do not want to pack more batteries. Would I have loved to have one of the credit card sized Exilim's with zoom and all?  Sure, they were too much money and besides this camera was going backpacking and all sorts of stuff it was likely to get beat up.  I wanted something solid and so far it is.  The things I discovered I like about this camera that I did not know before hand are #1) the software is the easiest and best I have ever encountered.  I did have some difficulty installing it.  One call to cust service and he walked me through the steps of how to shut down the conflicting application and install it and I have never had an issue yet.  I thought the simplicity and small size would be nice.  I underestimated how nice it is.  Because I can carry it anywhere and use it quickly and easily I take far more pictures.  My kids take far more pictures and they take great pictures.  My wife who could not use anything but a disposable point and shoot can use it.  If you have not figured it out, we like this camera.  Now a couple of things to balance out my review.  I bought the c310 Easyshare for my son.  In comparing photos I noticed a couple of things.  Some of my photos would be very contrasty and his would be more balanced and even.  I have read these cameras electronically boost color saturation and I think they went too far with it on my camera.  But still good pictures in most cases.  In low light I could not get it to take good pictures.  The flash reaches about 7-10 feet and then it was all black.  I found out if there was some light and I turned the flash off I would be able to get a picture and in some cases a good one.  I could not figure this out until I read that the ISO range is 100-400 with auto adjustment except in flash mode.  Then it locked at 140.  Problem solved.  Turn the camera on, push the flash control button 3 times to turn it off and it may take an OK picture. With the flash turned off atleast you have a chance. It still is not a good low light camera but most in this price range are not going to be.  That is a feature that costs more.  All in all, this camera is a keeper? YEP.  It will never be my only camera and it is not perfect, but for a small affordable camera that can go anywhere and be ready to use at a moment's notice it gets the job done.  It is not and never will be perfect nor will it be a professional photographers dream but it is mine and I like it.", "Date": "September 15, 2006"}, {"Title": "Good camera for personal use", "Author": "Brent T. Willner", "ReviewID": "RLLB9A1X40LHY", "Overall": "4.0", "Content": "This is a great camera for around the house and family gettogethers. There are really no cons for this camera, except that there is no lens cover, which probably wont ever be a problem for most people. It takes great photos, and the flash has plenty of power, even from across a room (for those who said it didn't, please adjust your exposure comp. in the menu). It has a pretty good shutter speed too, it only delays about a second between pictures. It's also better on batteries than most digital cameras i've used.", "Date": "August 1, 2006"}, {"Title": "A great simple camera", "Author": "beautiful_dreamer", "ReviewID": "R9K5Z7TDBR66M", "Overall": "4.0", "Content": "I just needed something small, simple, and inexpensive. After comparing prices, I decided on this camera. I am enjoying very much, it takes great pictures and is really easy to use. The only problem I have with it is that the buttons (especially the 4 way control and OK) are a bit sensitive, so use a little care untill you get used to the way the camera works.", "Date": "October 11, 2006"}, {"Title": "For a cheap camera, not bad.", "Author": "ClairElizabeth", "ReviewID": "R1H8D209ORIP5A", "Overall": "4.0", "Content": "This camera is great if you want something to toss in your purse/pocket and take out to a party, or for simple snapshots.  The flash is really bright and there isn't a lense cap, so you should get a little case for it.  The screen in very clear and the timer is helpful.", "Date": "November 28, 2006"}, {"Title": "Great Camera", "Author": "Melissa", "ReviewID": "R27PAVOCJBNCBR", "Overall": "5.0", "Content": "I orignally owned the Kodak Easyshare C300 (3.2 Megapixel) camera.  And recently bought this one to replace it.  The camera is easy to use, and produces quality photos to preserve precious memories with ease.  The 5 MP you get with this camera produces way better quality, without paying an arm and a leg.  Though the video feature isn't improved with this model (like the C300 this model doesn't record sound with video either), all the good features of this camera outweigh the bad.  Great for beginner or experienced photographer on a budget who wants a great camera.", "Date": "June 24, 2006"}, {"Title": "Cool little camera", "Author": "Jaye", "ReviewID": "R26EJ8S95BSI0L", "Overall": "4.0", "Content": "I personally enjoy this camera. I dont see anything wrong with it. Well, except that the video doesnt have any audio. Other than that, I really like this camera. It has taken great photos and I can take it anywhere.", "Date": "September 27, 2006"}, {"Title": "wonderful photos, not as many picture modes", "Author": null, "ReviewID": "R2KIULUXIETW3P", "Overall": "4.0", "Content": "this little camera is great. the moment i got it, it was ready to be used right out of the box! this is perfect for a person like me. I am young so i want to carry it everywhere in my purse, its light, and very easy to use. I really didnt need the user manual that much. I would recommend this camera! the only thing I dont like is that it doesnt have as meany photo settings, ei. landscape, sport, and the video doesnt have audio. but other than that, this camera is great!", "Date": "July 1, 2006"}, {"Title": "Handy and convenient - perfect little camera!", "Author": "Melissa C. Baldwin \"The Book Hunter\"", "ReviewID": "R2WMHJBITMI6O", "Overall": "4.0", "Content": "I am a youth worker and wanted a camera to carry around with me for those fun candid snapshots when working with my kids.  But I didn't want to carry my heavy camera.  This one is PERFECT!!  It's light and runs on double AA's, so it's easy as pie to \"recharge\" when needed.  And the pictures it takes are clear and easy to focus!", "Date": "June 29, 2006"}, {"Title": "Too many \"soft\" pictures", "Author": "Starsong87 \"Starsong87\"", "ReviewID": "R1K1GA5VM4FYT3", "Overall": "3.0", "Content": "A good point-and-shoot camera.  My only complaints are that if you use the zoom AT ALL (even in bright daylight outside), the pictures are not crisp.  You really have to be less than 6 feet from the subject and do not use the zoom feature if you are further away than that.  Also, the flash is very weak and indoor pictures are not good quality (again, unless you are right up close to the subject).", "Date": "July 25, 2006"}, {"Title": "A very ecconomic camera", "Author": "Joshua Hawkins \"thehawkster\"", "ReviewID": "R1S03Y8WAFFHAU", "Overall": "4.0", "Content": "I don't think you'll find a better camera for around $100, but it does have some downsides.  Most of the downsides has to do with it's really really tiny lens.  It says 36mm but that's just a 35mm equivalent (not that I expected a 35mm lens it's just I didn't expect the lens to be that small).  Picture quality is still good especially in medium distance shots with high lighting, but low light can be hit or miss.  It's a great camera for vacation, or family photos and most of the drawbacks won't even be noticed by these users.  Battery life on the camera is really good I've taken about 100 photos (most with flash) and the battery bar hasn't even dropped.  It also has an auto-off feature to save battery life when you forget to turn it off yourself.This camera is fairly easy to use and doesn't really have alot of features to mess around with (or mess up) so it's great for those fairly new to the technology.  It's also priced just right so you can take it anywhere and not worry too much about having it lost or broken.", "Date": "March 21, 2007"}, {"Title": "ANOTHER GREAT CHRISTMAS GIFT", "Author": "Katherine Austin", "ReviewID": "R375HDDETTY2WY", "Overall": "5.0", "Content": "I BOUGHT THIS CAMERA FOR MY 4 YEAR OLD SON AFTER REVIEWING THE \"KID CAMERAS\" AND THINKING FOR A LITTLE EXTRA MONEY WHY NOT GET A REAL CAMERA?  MY 4 YEAR OLD HAS BEEN INTERESTED IN PHOTOGRAPHY FOR ALMOST A YEAR AND HE HOLDS THIS CAMERA EASILY, IT TAKES GREAT PICTURES AND HE HANDLES IT WELL.  NOT DROPPED IT YET AND WE'VE DOWNLOADED 3 OR 4 TIMES SINCE CHRISTMAS.  HE LOVES HAVING \"HIS CAMERA\" AND ITS EASY SINCE  MOM'S CAMERA IS ALSO A KODAK EASYSHARE AND I'M ALREADY FAMILIAR WITH ALL THE SOFTWARE.  ANOTHER GREAT CHRISMAS GIFT!", "Date": "January 31, 2007"}, {"Title": "No lens cover", "Author": "YKZ", "ReviewID": "R30WNLGC0KWJD7", "Overall": "2.0", "Content": "Another reviewer mentioned this, but for some reason this camera lacks a lens cover (either an automatic or manual mechanism).  There is a small sheet of clear plastic covering the actual lens, but if you were to carry the camera around in your pocket, or bag, this plastic cover would get scratched quickly.Because of this, the C530 would probably be good to keep in the house, and take out for indoor pictures on special occasions or something.  It would NOT be a good \"carrying-around\" camera for daily use, despite its relatively small size.", "Date": "July 11, 2006"}, {"Title": "This camera stinks", "Author": "Rags \"Rags\"", "ReviewID": "R1LQBSJJTVIKJ0", "Overall": "2.0", "Content": "I have this camera for work, in a job I should take 100+ pics a day to document my work.Yes, this camera is easy to use and takes decent pics.The bad side: it eats batteries like crazy. The worst part of this camera is that after every 4-5 pics taken in succession, a \"processing\" graphic comes up on the LCD screen, and I need to wait 30-45 seconds before I can take another pic. Of the 15 co-workers who were given this camera as well as me, they experience the same issue.Once the processing is done, a majority of times, it goes back to processing after each image taken. This is really annoying.I tried using one of my personal hi speed SD cards instead of the dollar store SD card that work supplied, and the same result. It makes no difference whether the batteries are new or used.If you wish to take two or three pics, then shut the camera down... this would be a great inexpensive camera.I sure am glad I am on the clock when using this camera. For my personal camera needs, I'd never accept this camera... there would be too many missed shots. I'll stick with my Panasonic Lumix for personal use.", "Date": "April 22, 2007"}, {"Title": "good beginner camera", "Author": "Judith A. Turner", "ReviewID": "R7T3XCOV5KPX5", "Overall": "4.0", "Content": "I purchased this camera for my 13 year old granddaughter. She is having a blast with it!  It is easy for her to use, the pictures so far are quite nice...I am glad I chose this moderately priced camera.", "Date": "January 22, 2007"}, {"Title": "It was good while it lasted...", "Author": "Bujing You", "ReviewID": "R1ITCQP32TMJX2", "Overall": "3.0", "Content": "I bought this for my boyfriend because I'm a college student with only so much money.  We found it to be a good camera for the price... quality pictures, good battery life, easy to handle, etc etc.  Unless you're a photographer, for$56 this is an exceptional camera that gives you just about everything a camer costing $200 would.  But that was before it broke in less than 2 months while sitting on the shelf on its  own.  The screen simply leaked and that was that... I realize now that I made the mistake of buying a piece of electronic that's not Japanese.  I know Canon PowerShot SD1000 is more expensive, but whatever the price this camera felt flimsy to begin with while my PowerShot always gave me the feeling that I'm holding a chunk of solid metal.", "Date": "June 25, 2007"}, {"Title": "Durable, Simple Little Kodak", "Author": "Drew J. Pearson", "ReviewID": "R1XESYAR779YAC", "Overall": "4.0", "Content": "For under $100 purchase price, this is great \"take it anywhere\" camera. Incredibly easy to use and generally takes pictures full of color and detail. Its small size and AA-batteries means it is a great backup/vacation camera.Cons: No optical zoom. It'd be nice to have. No sound with video. Probably not a huge concern for its target buyer, but still an inconvenience. Battery life is also just average, which given the small LCD, doesn't make much sense.", "Date": "August 26, 2007"}, {"Title": "Great cam for the price", "Author": "Amber \"Amber\"", "ReviewID": "R2GXHE20G9MQZT", "Overall": "5.0", "Content": "This is my first digital cam. I was looking for a good price, but also a pretty good quality. I have had nothing but success with this cam. It takes great pictures zooms in on subjects with clarity and I love the auto timer for 2 or 10 seconds. The battery life isn't the greatest but also not the worst I have seen. I would definately reccomend this to others.", "Date": "March 8, 2007"}, {"Title": "EZ Does It", "Author": "Joe Duke \"Duke\"", "ReviewID": "R26SZ52GK36WAI", "Overall": "4.0", "Content": "I purchased this camera for my young daugther, after the canon i bought her fell apart after 3 weeks post-xmas for no good reason. Anyway, the Kodak works nicely enough, has a big screen to view pix on the back, but has a tiny viewfinder, if you like to use that feature ,its difficult. The pix are clear and colors are true. It takes videos which is fun and handy-for a short shoot, of course.The price was great. All around a good camera for the buck. However, it does eat baterries like crazy.", "Date": "March 8, 2007"}, {"Title": "Very good!!", "Author": "Maria Lourdes Gumersell", "ReviewID": "R2EC1SJAIAEHZP", "Overall": "5.0", "Content": "For the price is a very good deal... it takes very clear pictures", "Date": "January 20, 2007"}, {"Title": "No video sound!", "Author": "Amazon Customer \"spicejenmom\"", "ReviewID": "R3P1B7YZFOQ65", "Overall": "2.0", "Content": "We bought this for our daughter and I am very disappointed that it does not record sound with the videos!  It was not clearly indicated that I could find on the box or manual that it did not do this!", "Date": "October 1, 2007"}, {"Title": "You get what you pay for", "Author": "M. Griffin", "ReviewID": "R3SY11EW836602", "Overall": "3.0", "Content": "I Bought three of these camera's for my business. I needed them to be able to take and store large quantities of pictures, so I ordered a few 2.0GB SD cards only to find out that this camera \"IS NOT COMPATIBLE WITH 2 GB SD MEMORY CARDS; your camera accepts a maximum 1 GB SD card\". That should be listed with the technical details. It doesn't even say that on the box or in the Users Manual, I got the info from that website. STUPID...The camera is fine for the basics, I would equate it to a disposable film camera.", "Date": "May 11, 2007"}, {"Title": "Kodak C530", "Author": "Martha McDaniel \"grey lady\"", "ReviewID": "RW2UZF1XJ6RJF", "Overall": "4.0", "Content": "I am very pleased with this camera.  It is very easy to use and a good size.  Takes great pictures, too!", "Date": "March 31, 2007"}, {"Title": "Love it", "Author": "L. M. Dunn \"On my path\"", "ReviewID": "R1WOHS6AC0OMPS", "Overall": "5.0", "Content": "I love my new camera. It takes great pictures and it's easy to opperate.", "Date": "March 27, 2007"}, {"Title": "Kodak Digital Camera", "Author": "Andrew T. Black", "ReviewID": "R7NNH4R6GLVBL", "Overall": "4.0", "Content": "Very good first camera. Easy to use and gives great pictures. Highly Recommend", "Date": "March 9, 2007"}, {"Title": "Instant Digital", "Author": "Robert H. Mahone", "ReviewID": "R1ZUTDJCGMLMQK", "Overall": "5.0", "Content": "Kodak has always been known for instant cameras, this purchase renewed my faith in instant shipment and delivery.", "Date": "March 9, 2007"}, {"Title": "EasyShare C530", "Author": "C Marguerite", "ReviewID": "R2ESMZ6FJ746KQ", "Overall": "4.0", "Content": "Easy to set up and use. Only negative issue is the  camera runs down batteries very quickly. Contacting Kodak for advice regarding the situation.", "Date": "February 24, 2007"}, {"Title": "Nice Little Camera for the money", "Author": "Karen Mahone", "ReviewID": "R3Q5MUKLDNDO2S", "Overall": "4.0", "Content": "My daughter simply loves this little camera - she was very excited Christmas morning when she received it!  I do need to get the outlet for the usb cable looked at because we are having difficulty downloading photos and I will be in contact with the vendor - my computer has been on the fritz so it's taken me a little bit!", "Date": "January 29, 2007"}, {"Title": "Great other then memory capabilities and battery usage", "Author": "T. Soward \"Caring\"", "ReviewID": "R2PPO4K8AUIQI5", "Overall": "4.0", "Content": "Other then a couple small issues, 1. having the ability to only upgrade from the built in 16MB to 1GB of memory, (tried putting a 2GB card in and it fails to recognize the card during format) and 2. Batteries too seem to be an issue. (it blows right through them so rechargeable would probably be the cheaper way to go)this has been a good camera for my daughter. The specifications say \"SD/MMC card expansion slot\" but what it doesn't say is that you can only expand to 1GB.  I now own a spare 2GB card that will use on a different camera. Great starter camera for both the young and older person in your life.", "Date": "January 15, 2007"}, {"Title": "Very Elementary", "Author": "T. George", "ReviewID": "R1CLWV17PA7MVB", "Overall": "3.0", "Content": "I purchased this for my daughter, but was not very impressed with it.  It was very elementary.  Although it is very easy to use, I had hoped it had a little more extras.  biggest dissapointment was not sound with the video.  I have since given it to my niece and purchased another for my daughter, with upgrades.", "Date": "January 12, 2007"}, {"Title": "Picture quality poor", "Author": "Chuck in Los Angeles", "ReviewID": "R24B7ONZKNB8F3", "Overall": "1.0", "Content": "The pictures are grainy, not as good quality as my old 4 MP EasyShare.  I was disappointed, but wanted to make sure, so I compared the photo quality side by side onscreen of the new 5 MP C530 with my old 4MP EasyShare (using the same subject).  The 4 MP has better resolution than the new 5MP C530, which is not what you'd expect.  Kodak unfortunately seems to have taken a step backwards with this camera, and is advertising this as a higher quality camera than the old 4 MP EasyShare.  Too bad, as I've used Kodak for years, but will look elsewhere now.  I returned the C530 to Amazon the same day I bought it.", "Date": "December 29, 2006"}, {"Title": "Terrible camera", "Author": "N. Frost", "ReviewID": "RIM1N235QHIC0", "Overall": "1.0", "Content": "This camera is awful. I recieved it for Christmas in 2006 and I dreaded taking pictures with it all year long in 2007. Pictures from this camera taken in a low lit room are terrible. The quality on some is grainy and very unsharp. Do not buy this camera!!!!!!", "Date": "February 3, 2008"}, {"Title": "kodak c530", "Author": "D. Bridges \"your yellow rose\"", "ReviewID": "RJ2K8PLIIQJCA", "Overall": "3.0", "Content": "This is a good camera. the only problem I have with it is that the video doesnt take sound and that isnt something the site specifies. It also eats batteries.", "Date": "April 7, 2007"}, {"Title": "awful pictures", "Author": "Carrie Richards", "ReviewID": "R270G0CTHHCQ6M", "Overall": "1.0", "Content": "The flash on this camera doesn't go off when it should and even when it does the pictures are dark and blurry. I have a kodak camera with 4MP that is three years old and it takes far better pictures. Don't buy this camera. If you want a kodak upgrade to a better model. This camera is not worth even the cheap price.", "Date": "December 28, 2006"}, {"Title": "Disappointed", "Author": "My review", "ReviewID": "R1JRJZWCRLRQ0W", "Overall": "3.0", "Content": "I have an older 2 MP Kodak Easy Share.  That one had a good, sturdy feel to it.  This model, although with 5 MP, is for me too lightweight.  It feels like plastic.  I didn't like that the lens is covered over with glass which can scratch rather than a retractable lens cap (as the older camera had), so I have to provide extra protection so the glass won't get scratched.  I tried out this C530 over Christmas Eve and I was quite disappointed that most of my photos had white orbs here and there on the photos.  I tried the video feature in normal to low indoor lighting and the images couldn't be discerned.  This camera is listed as a 5 MP which is supposed to make a least a nice, clear 8\" x 10\" but I have my concerns after seeing the quality of the photos that I got, that this camera is putting out that expected quality.  Overall....I'm disappointed.", "Date": "December 26, 2006"}, {"Title": "Kodak Easyshare C530 5 MP Digital Camera", "Author": "mrscrup", "ReviewID": "R32E7170SFNW0C", "Overall": "4.0", "Content": "I ordered two of these cameras as gifts...they have not been used yet,but I do own one that I have had for quite a long time...It is an easycamera for first timers (these were purchased for 7 year olds)", "Date": "September 21, 2012"}, {"Title": "Nice Easy To Use Durable Camera", "Author": "J. S Thomas \"Jethro\"", "ReviewID": "RXGVH31VLBD5D", "Overall": "5.0", "Content": "I have used this camera for the past 5 years as part of my job and taken over 100,000 photos with the camera.  I must say its very easy to use and a good basic camera.  Over these years I have banged, dropped and its been rained on several times and it just kept on working no problems.  The only issue I ever had and it was small was the battery door is flimsy which i fixed right away after getting the camera with some think clear packing tape over the end, problem solved.  The main thing I liked about the camera is the fixed lense, as I didnt have to worry about it getting banged around or sand etc. getting stuck in an extended lense.  The live shot was very easy to use with just a push of the button and just as easy to review photos.  I just stopped by as mine is finally getting worn out after all the years of use and abuse and the many photos, the on/off switch is about to go, Kodak did a fine job with this one and if you can get one it will last a good long time and is very portable....hope I can find another that was as reliable as this one, with a fixed lense, view finder and 2AA batteries......", "Date": "September 20, 2012"}, {"Title": "A Great Starter Camera", "Author": "Ryan", "ReviewID": "R3IVQDWUKNNC02", "Overall": "4.0", "Content": "This camera is great for someone who wants to start taking pictures, but doesn't want to spend a lot of money on it. Perfect for a young teen as a gift.Its 5.0 Megapixels make the pictures it takes look remarkably good, and the option to turn flash on, off, and red-eye remove, is a help in whatever enviornment the picture is being taken.One great thing about the camera is the sheer ease of use it offers. There are only 3 modes, camera, video, and favoriting. On camera, it's simply point-and-shoot and take some pictures. There are a few modes it offers to enhance the visuals of the picture, and similar options that are fun to play around with. Video offers the chance to take a video, but unfortunately does not record sound. Favoriting gives the opportunity to look through all the pictures you have taken and mark which ones are the best. This makes it easier to import the pictures to a computer later.The only fault I find with this camera is the use of AA batteries. I would much rather prefer a rechargable battery, as it uses a wire instead of having to carry around many loose AA batteries. Also, the LCD screen is pretty small, but that doesn't really take away from anything, it's just a heads up.Finally, the share program. This is an EasyShare camera afterall. When you get the camera, it should come with a CD. This CD makes importing your pictures all the easier, and lets you preview them in a super-easy to use setting. In the program you can make your own albums or folders of pictures, and save them whereever you want on your computer. Simply click on a picture you want, and it's in.Overall, this camera is fun, easy to use, and cheap for a starter camera. Hope you have fun with it!", "Date": "June 28, 2011"}, {"Title": "Cheap and cheerful", "Author": "S. Voss", "ReviewID": "R1IPQ2BNQLQE53", "Overall": "4.0", "Content": "Unfortunately they dont make super simple cameras like this anymore.The picture quality is average, which could be easily improved with a new model and the battery upgraded to lithium ion.Many modern digital cameras have too many menus and too many features when users want to be able to just take pictures.This one has no fancy zooms and far fewer buttons. One wishes some other company could just license the design update it, andeven remove a few more buttons.", "Date": "August 15, 2010"}, {"Title": "I love it!!!!!!!!!!!", "Author": "Pink Butterfly", "ReviewID": "R3C5KMH576TDZF", "Overall": "5.0", "Content": "The camera is simple and easy to use. It's small and light weight, you can tuck it in your pocket or purse. I love it.", "Date": "January 14, 2008"}, {"Title": "Beginner Digital Camera", "Author": "N. Ree \"Mom\"", "ReviewID": "R38BVAVJIF2X4J", "Overall": "3.0", "Content": "Kodak EasyShare C530 5MP Digital CameraThis basic digital camera is an absolute beginners camera. It is easy for an older person who prefers not to deal with updated technology as well as for a youngster who might have more technical expertise but isn't responsible enough for a more expensive camera. Easy to use and good sharp pictures. Would purchase again but would want to know that it is basic point and shoot with few extras.", "Date": "January 7, 2008"}, {"Title": "Kodak Easy share camera", "Author": "G. Bartilucci \"amazingrace\"", "ReviewID": "R2W75H2WS1T7VD", "Overall": "5.0", "Content": "This product arrived at my home within the week. The camera came wrapped very carefully so it was in excellent condition.", "Date": "December 21, 2007"}, {"Title": "easyshare review", "Author": "Lester W. Kostyn \"photographer\"", "ReviewID": "R3JZAJPL22JWLF", "Overall": "3.0", "Content": "i bought these for my granddaughters,it is fine for them, not good for someone who is intrested in photography.", "Date": "May 29, 2007"}, {"Title": "not a good camera for me", "Author": "Kathy D. Wolf \"MEMEMAY\"", "ReviewID": "R1J3K09Q175ETL", "Overall": "2.0", "Content": "i bought this camera thinking hey pictures too. i bought the docket to. now don't get me wrong i love kodak cameras but this one is terible the software messed my computer up but i gave it 2 stars because it does take good pictures but next time i buy a kodak it is going to be with out a docket they are to much trouble.i love kodak but this one has been a night mare. in process of sending it back. i am sure i just got a bad one because i have had them before but i would not buy this one. just my opinion. but i will get another one because of all the cameras kodak is the best for me just not this one i tend to spend a little more but hey they are worth it.", "Date": "May 22, 2007"}, {"Title": "A toy camera, but the price... cheap!", "Author": "Gladys Rueda \"Josgla\"", "ReviewID": "R22ZAHQWOMXAST", "Overall": "3.0", "Content": "When I recieved this camera I seems bought a toy, the plastic body wasn't solid and well. The screen is very small.", "Date": "May 13, 2007"}, {"Title": "Very compact", "Author": "L. M. Jones", "ReviewID": "R232CGA8CWBE48", "Overall": "4.0", "Content": "Nice compact camera, was a little shocked at how cheap it felt, it takes decent photos, for the price.", "Date": "May 12, 2007"}, {"Title": "Solid, Inexpensive Camera", "Author": "J. Ulseth \"Big Viking\"", "ReviewID": "R1S0W9C4JRC7NB", "Overall": "3.0", "Content": "Produces pictures capable of enlargement.  Very easy to use in Auto Mode.  Quite satisfied!", "Date": "May 12, 2007"}, {"Title": "Cheap but handy", "Author": "Johnnie C. Bizot", "ReviewID": "R2NZX5YRJUL5IW", "Overall": "4.0", "Content": "The pictures are excellent. The video is rather poor, but that is not what I was looking for. I bought a kingston SD card and it could not read it, so I placed a sandisk card and it was O.K. However, the Kingston card worked perfect in other devices. Weard, isn't it? And it's quite friendly.", "Date": "May 7, 2007"}, {"Title": "Kodak EasyShare C530", "Author": "Angelo Kalevela \"GeloK\"", "ReviewID": "RTD3GVG1T8Z5P", "Overall": "4.0", "Content": "I didn't haven't any problems with the product; however it isn't that spectacular. You do get your money's worth", "Date": "January 11, 2007"}, {"Title": "For The Money, It's Fine", "Author": "James C. Selby", "ReviewID": "RJMUCNTQM7SN9", "Overall": "4.0", "Content": "The Kodak C530 is a nice little camera for general snapshots.It is easy to handle,and can be worn around the neck with optionalneck strap.The included software enables you to edit the originalimage with cropping,color adj.,special effects and more. I studiedphotography originally with film, and find  errors with digital shots in general,but for everyday stuff the thing is acceptable.", "Date": "January 11, 2007"}, {"Title": "Great item for the $$", "Author": "Tonia H. Williams", "ReviewID": "R38MD3R3NBJ6VV", "Overall": "4.0", "Content": "Don't let the price of this camera full you. It is a great little camera.", "Date": "January 11, 2007"}, {"Title": "my husband loves it", "Author": "V. Thomas", "ReviewID": "R29ZXPSLO96D1P", "Overall": "5.0", "Content": "after reading almost every review for almost every digital camera priced under 200 dollars i decided on this one as a gift for my husband. when it arrived i was impressed. it looks nice and feels sturdy not cheap and lightweight. we are also happy with the pictures it takes and the screen is very clear. it doesn't seem to eat up the batteries as i have heard some cameras can. i am very happy with my choice.", "Date": "January 10, 2007"}, {"Title": "Great camera - greater price!", "Author": "Patricia K. Graeser", "ReviewID": "R32NVUFIJWVJPP", "Overall": "5.0", "Content": "I purchased this camera for my 8-year-old granddaughter for Christmas.  It was the first item on her \"wish list\" to Santa.  I was completely pleased, not only with the item, but the prompt shipping I received.  I'd highly recommend purchasing from Amazon.com to anyone.  My granddaugter was totally thrilled!", "Date": "January 9, 2007"}, {"Title": "Great Camera for My Kids", "Author": "Julie Vandeburgh", "ReviewID": "R1BS6MM226K33S", "Overall": "5.0", "Content": "My husband and I wanted to buy real cameras for our 7 and 8 year old boys for Christmas.  The Kodak EasyShare C530 is really quite perfect.  It is a simple camera that takes very excellent photos.  It's compact and easy to operate--a real point and shoot, if you will.  The cameras were easy to engrave--a good thing for brothers with identical cameras.  My older son likes the telephoto feature as well as the movie feature.  It took him no time at all to become wise to operate the camera.  My younger son is a special needs child.  He loves the camera too.  All he has to do is click to capture a nice photo.  Both boys also love the Kodak G600 Printer Dock that we purchased for them to use.  Again, it's so easy to use.  Both of my boys can print pictures without our help.  We have the dock set up and ready to use.  With parental permission, they print their own photos from their own cameras.  My husband and I finally found gifts that will not add to the clutter at the bottom of the toy box.  Great gift for budding photographers.  Thank you Kodak.", "Date": "January 9, 2007"}, {"Title": "Great camera for a child", "Author": "H. Goderis", "ReviewID": "R2SVTT99PCCR0H", "Overall": "5.0", "Content": "We got this camera for our 6 year old son for Christmas, and he loves it.  The camera is a perfect size and very light.  It has a view hole and a display which is great for him.  It has the digital zoom, but no complicated buttons on the camera- just the basics to take a picture.  It is very easy to download the pictures and email them from the directly from the software.  Great, easy to use digital camera!!!!", "Date": "January 9, 2007"}, {"Title": "Kodak Digital Camera", "Author": "John J. Hanrahan", "ReviewID": "R332ZAHADZ3BZG", "Overall": "4.0", "Content": "The price was great for this digital camera at under $100.  It has very good features for an inexpensive camera and will work well with the docking unit the recipient already has.", "Date": "January 9, 2007"}, {"Title": "Good Starter Camera", "Author": "George Merkley \"GTMERKLEY\"", "ReviewID": "R1JKKBWOHR8MW4", "Overall": "2.0", "Content": "A  good starter camera. If you never used a digital camera before this one is for you. Easer to operate then a film camera turn the dial to auto and snap away. I got it for our 8 year old she mastered it and was taking pictures in five minutes an older women relative who never even seen one before was Abel to master it in two.It doesn't have all the gadgets or settings that the others have but that is part of it's appeal for older or younger picture takers. If you can use a film camera you can use this digital. You might even be able to use this one if you cant figure out a film camera. And it takes just as good a picture as most film cameras.In short if you have been scared to go digital because you don't think you can figure out how to use it this one is for you.", "Date": "January 1, 2007"}, {"Title": "No zoom!", "Author": "Miss Helen", "ReviewID": "R126BJPOITU2BT", "Overall": "2.0", "Content": "Kodak easyshare cameras are the way to go with digital, in my opinion. Easy to use and all kodaks work the same. However, this model does not have a zoom! I purchased it, unknowingly, and discovered this fact when I got it home. Spend a few more bucks and get the C533!! I purchased this as a Christmas gift for my younger brother and I know he will love it.", "Date": "December 7, 2006"}, {"Title": "Horrible camera!", "Author": "A. Graham", "ReviewID": "ROL9JPN6IP3EA", "Overall": "1.0", "Content": "This camera takes HORRIBLE pictures. The flash produces very uneven lighting, with a very obvious shadow around the edge of pictures. In normal indoor lighting situations with the flash off (to eliminate the shadows), the pictures are very noisy/grainy. I have a webcam that takes better still pictures than this camera. Avoid this camera at all costs! Spend another $50-80 for a Canon A540 (6 megapixel) if you want a simple point-and-shoot camera that takes awesome pictures. The only good thing about this Kodak is that it's easy to use, which should be expected given the lack of features on this camera.", "Date": "December 28, 2006"}, {"Title": "No es lo que aparente", "Author": "Eladio Garcia", "ReviewID": "R57SY4JZS64FF", "Overall": "2.0", "Content": "El producto es de muy bajas caracteristicas.Material barato, zoon de baja calidad, en otras palabras es sumamente inferior a otros equipos que he probado los cuales se encuentran en el mismo rango de precios.Kodak tiene una linea de Camaras económicas las cuales paracen ser desechables.No lo recomiedo.", "Date": "March 25, 2007"}, {"Title": "Susan's Opinion of the Kodak 530", "Author": "S. Miles \"smiles\"", "ReviewID": "R2JFTUHQ52Z8PL", "Overall": "1.0", "Content": "The Kodak 530 is not as clear as I expected.  The picture does not have the clarity that my Kodak CX4200 have which is only 3 megapixels.  The CD that places the Easy Share program on my computer picks the 530 up as a 315.  Nothing in the camera references the camera as being  a 530.  530 is printed on the outside of the camera only.I loved the Kodak CX4200 which was lost at a reunion (3 megapixels), so I thought the 530 would be a better camera with 5 megapixels but not so.)I really can't be sure the camera is 530 since the computer reads it as a 315.", "Date": "January 5, 2007"}, {"Title": "it was broken by the time i got it", "Author": "T. ajepe \"beautiful\"", "ReviewID": "R19MLCQQ7NYF90", "Overall": "1.0", "Content": "i was so exited to get the camera that, so qouck that when i opened it, the screen was already broken , so much 4 a cute camera", "Date": "November 9, 2006"}], "ProductInfo": {"Price": "Unavailable", "Features": "5.0-megapixel CCD captures enough detail for photo-quality 13 x 17-inch prints\n1.5-inch LCD display\nContinuous QVGA video\nAuto scene mode and three color modes; in-camera cropping\nPowered by AA size batteries; stores images on SD memory cards (includes 16 MB internal memory)", "Name": "Kodak Easyshare C530 5 MP Digital Camera", "ImgURL": "http://ecx.images-amazon.com/images/I/51B5A7P0N5L._SX300_.jpg", "ProductID": "B000CDLFRM"}}