{"Reviews": [{"Title": "Perfect replacement", "Author": "Aaron", "ReviewID": "R29E2J9JJGK4YM", "Overall": "5.0", "Content": "I bought this to replace my original python alarm transponder. It was easy to program once you find the valet button in your vehicle (took me like 10 mins to find the valet button, and 2 mins to program the remote). The design flaw in all of these remotes are the outside casing on the seam pulls apart over the years. I got 7 years from my original and i hope to get the same from this new remote.", "Date": "December 1, 2012"}, {"Title": "Works", "Author": "Andy", "ReviewID": "REZI9JDQDTIKW", "Overall": "3.0", "Content": "It's ok just not like the original one the LCD screen does not light up and the conformation that the vehicle stopped running does not work", "Date": "December 20, 2013"}, {"Title": "Wow! This is good.", "Author": "Harvey N. Hymer \"hnobleh\"", "ReviewID": "R1WVBH7UV8B5MT", "Overall": "5.0", "Content": "Came in a bubble pack, was in perfect new condition and worked perfect.  Very happy with this product.  It came with a belt clip which I leave on (except when pushing buttons) to protect the display.  Don't get it anywhere near water, coffee or other liquids.  That's what happened to my old one.", "Date": "November 3, 2013"}, {"Title": "Perfect replacement", "Author": "Lisandro", "ReviewID": "R132F8F6P0JYGA", "Overall": "5.0", "Content": "This was the exactly replacement to my remote control, I had it for 6 years.Very easy to setup, no professional installation was necessary, it only took five minutes (if you know where the valet switch is on your car). It comes with all the instructions.", "Date": "August 29, 2013"}, {"Title": "BATTERY LIFE SUCKS", "Author": "Aicitel", "ReviewID": "R1CPW7BKN340I3", "Overall": "5.0", "Content": "These remotes are very handy.  Good priced BUT the battery life on these suck. I always have to replace the batteries.", "Date": "June 12, 2013"}, {"Title": "Works great and easy to set up", "Author": "biostroker", "ReviewID": "R1WS0A77L2HK2H", "Overall": "5.0", "Content": "Works awesome-replaced my original as it eventually crapped out.  As long as you can find your valet button it's easy to program. Longest part of programming it was finding the button.  What I did was trace the wire from the Python box that is mounted under your steering wheel to where the button is mounted.  Look up the diagram at Python's website for which wire it is-I can't remember now but I think it was a black and grey wire that leads to the button, but don't quote me on it!", "Date": "April 12, 2013"}, {"Title": "All as described from DEI", "Author": "RUDI", "ReviewID": "R2QDUQHPPG1FAO", "Overall": "5.0", "Content": "What can I say. You go to the manufacturer's website and have full information. No more, no less. All as described. Quality as always excellent.", "Date": "February 2, 2013"}, {"Title": "Excellent turn around time", "Author": "Bman", "ReviewID": "RBXH2JJM2GIQB", "Overall": "5.0", "Content": "This is the real deal from DEI. Programmed easily to my Python alarm and still works great today. My niece dropped it in water, I let it dry and it still works. Can't beat it.", "Date": "September 19, 2012"}, {"Title": "great", "Author": "Iva Culberson", "ReviewID": "R1C7FWQJPT199K", "Overall": "5.0", "Content": "this is just what i needed and it works great.there is nothing more to say about it . i will oder an other on when needed.", "Date": "June 26, 2012"}], "ProductInfo": {"Price": null, "Features": null, "Name": null, "ImgURL": null, "ProductID": "B000CIY5I8"}}